{
  "title": "Designed to Evolve: Discovering God Through Modern Science",
  "description": "Why do we exist? Why is there something rather than nothing? Designed to Evolve examines the question of existence in light of modern science. From the birth of the universe 13.8 billion years ago, to the intricacy of the DNA molecule, nature is explored at the most fundamental level. Two possible explanations emerge. Are we the result of chance or designed for a purpose? There has never been a time when more information on origins has been available. Now we can probe this question and take a critical look at the nature of existence. In the end, the evidence for purpose prevails.Designed to Evolve covers these topics:AN OVERVIEW OF MODERN COSMOLOGY AND BIG BANG THEORY. What we know about the universe and what we don't. How we know what we know.MODERN EVIDENCE FOR GOD. Why big bang theory supports creation and how the fine tuning of the laws of physics suggest an intelligent creator. Specific examples are covered in detail.COMMON ARGUMENTS AGAINST THE EXISTENCE OF GOD. The conditions and merits of these arguments are evaluated. Some arguments made against the Designed to Evolve principle are also examined.QUANTUM MECHANICS AS IT APPLIES TO THE QUESTION OF GOD. Some of the basic principles of quantum mechanics are explained in simple terms, so that the implications of this fundamental property of nature can be examined. This theory not only impacts our understanding of God, but of mind and soul as well.GEOLOGICAL HISTORY, THE FOSSIL RECORD, LIFE HISTORY, AND DNA. The history of the Earth is explored through the eyes of science. Many recent discoveries give us a detailed account of our planet's origin and development through time.OLD EARTH CREATIONISM. This view of biblical creation not only reconciles the Bible with science, but it provides another avenue of proof for God. A day by day comparison is made between Genesis one and the prominent views of scientists.BIBLICAL PREDICTIONS OF MODERN DISCOVERIES. The descriptions in Genesis make many predictions about the early Earth and its development over time. These predictions of modern scientific discovery are a testament to the relevancy of scripture in this age.THE THEORY OF EVOLUTION. The evidence for it, its limitations, and how it impacts the question of God.ORIGIN OF LIFE. The inner workings of life's smallest specification, the cell, is covered in detail. The genetic code of life gives us a strong indication to life's ultimate origin.ASTROBIOLOGY. What can the current status of searches for life outside our solar system tell us about life on our own planet?CHARACTERISTICS OF GOD. Not only does science give us a lot of evidence for the existence of God, it also hints at His character, attributes, and identity as well.Designed to Evolve presents a compelling depiction of creation that embraces modern science. Whether you believe, believe with doubts, consider yourself undecided, or are an atheist, this book will help you to have a fully informed view. Designed to Evolve provides clear, credible, and verifiable evidence that represents the most complete scientific assessment for the existence of God.",
  "genres": [
    "Science",
    "Theology"
  ],
  "author": "Christopher S. Davis",
  "average_rating": "4.29",
  "url": "https://www.goodreads.com/book/show/24473495-designed-to-evolve"
}