{
  "title": "Searchlights and Shadows: A Novel of Golden-Era Hollywood",
  "description": "Have you ever wanted to climb into a time machine and visit Hollywood during its heyday? At the dawn of 1942, the dark days of Pearl Harbor still loom over Los Angeles. America is now at war, and posters warn home-front Hollywoodites that loose lips sink ships. Wartime propaganda is the name of the game, and the studios are expected to conjure stories that galvanize the public for the war effort. Marcus Adler is an MGM screenwriter whose latest movie was stolen out from under his whiskey glass, and he’s determined it won’t happen again. He comes up with a sure-fire hit, but his chance to triumph is threatened by a vicious “Marcus Adler is a goddamned Commie.” Gwendolyn Brick is the handiest gal with a needle this side of Edith Head. After losing her job at the Cocoanut Grove, she dreams of opening her own dress store. But banks don’t make loans to single girls. However, wartime in L.A. opens the door to an opportunity that will rake in the bucks. But will it be worth the trouble if it drags her back into the orbit of Bugsy Siegel? At the outbreak of war, the Hollywood Reporter’s circulation starts to shrink like a food rations coupon book. Its lead columnist, Kathryn Massey, realizes she can no longer ignore the her boss, Billy Wilkerson, is gambling away his fortune—and her future. Could their very survival depend on a place nobody’s heard of called Las Vegas? In the city of searchlights, suspicions can lurk behind every shadow. Searchlights and Shadows is the fourth in Martin Turnbull’s series of historical novels set during Hollywood’s golden age. Hollywood’s Garden of Allah Book 1 – “The Garden on Sunset” Book 2 – “The Trouble with Scarlett” Book 3 – “Citizen Hollywood” Book 4 – “Searchlights and Shadows” Martin Turnbull's Garden of Allah novels have been optioned for the screen by film & television producer, Tabrez Noorani. INTERVIEW WITH THE AUTHOR Your Garden of Allah novels are rich in the history and lore of classic era Hollywood. What was your original inspiration? I came across an online article about the Garden of Allah Hotel, which opened on Sunset Boulevard in 1927 just before “The Jazz Singer” ushered in the talkies, and closed in 1959, the year that “Ben Hur” announced the last hurrah of the studio system. The Garden’s residents witnessed the unfolding evolution of Hollywood and actively participated in it. How has writing these novels changed your view of this golden age that we perceive as the greatest era of film production? L.A. was a much less densely populated city. Consequently, all movie industry workers were far more likely to know each other. People moved from MGM to Paramount to Twentieth Century-Fox to RKO to Warner Bros. Two or three degrees of separation were usually enough! Why did you not go the safe route and change the names of the major players to suit your story? The whole point of recounting the history of Hollywood through the eyes of the Garden’s residents was because so many celebrities lived there. Harpo Marx and Sergei Rachmaninoff were neighbors, F.",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "World War II"
  ],
  "author": "Martin Turnbull",
  "average_rating": "4.39",
  "url": "https://www.goodreads.com/book/show/24482321-searchlights-and-shadows"
}