{
  "title": "Home Ice",
  "description": "USA Today bestselling author Catherine Gayle presents another novella in the emotional Portland Storm hockey romance series.Tough-as-nails Portland Storm head coach Mattias Bergstrom is hard on his players, molding them into heroes on the ice. He’d never let them see his warm, soft side—something he saves only for his younger sister, who has special needs. But when a hockey event brings a sexy, single mother and her four rambunctious daughters into his life, that icy exterior quickly melts away for her youngest, who reminds him of his dear sister.Paige Calhoun has her hands full with four teenage daughters who are beyond boy crazy. Throw crushes on hockey players into the mix, and they’re almost too much to handle. But when Paige meets the Storm’s all-business but irresistible coach, she finds herself as smitten as her girls, and Mattias couldn’t be happier. With a Home Ice advantage, Mattias lets his icy exterior melt away to prove to Paige how hot they can be together.The Portland Storm series reading 1. Breakaway2. On the Fly3. Taking a Shot4. Light the Lamp5. Delay of Game6. Double Major7. In the Zone8. Holiday Hat Trick9. Comeback10. Dropping Gloves11. Home Ice12. Mistletoe Misconduct13. Losing an Edge14. Game Breaker15. Defensive Zone16. Power Play - coming soon17. Neutral Zone - coming soonThe Portland Storm series is a hockey romance series, but it is about a lot more than just hockey. Serious themes are explored in each book, including rape, cancer, addiction, miscarriage, molestation, grief, and many others. If you have triggers, please be aware that some or all of these books could contain material which would trigger you. Even if you don’t have triggers, consider this your tissue warning. You could ugly cry while reading them. sports romance, hockey romance, athlete, tearjerker, emotional romance, Down syndrome, family, sexy romance, mature romance, silver fox",
  "genres": [
    "Sports",
    "Hockey",
    "Sports Romance",
    "Romance",
    "Contemporary",
    "Contemporary Romance",
    "Novella"
  ],
  "author": "Catherine Gayle",
  "average_rating": "4.32",
  "url": "https://www.goodreads.com/book/show/24489295-home-ice"
}