{
  "title": "While I'm Waiting: Going from despair to hope while praising God and choosing contentment during trials",
  "description": "\"While I’m Waiting\" is adapted from the author’s blog devotions from the past few years, appearing for the first time as a collection. This 31-day devotional will inspire the reader to wait on God patiently and reverently to answer prayers according to His perfect timing. The author shares her own struggles and shortcomings in a relatable way that encourages and brings hope even in the most difficult circumstances. The devotions show that it is possible to walk through the valley and not despair while praising God and choosing contentment during trials. As missionary Jim Elliot once said, “God always gives His best to those who leave the choice with Him.” “Hope. It’s a foundation of our faith, but a difficult concept to live out. Author Laura Hodges Poole understands that, and this devotional gives us the roadmap for the path from despair to hope. She writes from the perspective of someone who has traveled that road. Her honesty and humility draws us in, while her wisdom shows us how living in hope truly is possible. This book will have a coveted place on my bedside table and will be a resource that I return to again and again.” ~Edie Melson, Co-director of the Blue Ridge Mountains Christian Writers Conference and author of Prayers for My Soldier“Author Laura Hodges Poole knows first-hand about the power of love and the gift of faith. With every inspirational word, she generously shares her innermost self. Laura openly writes about her personal trials and tribulations…the grief of losing her dear sister to suicide and the deep abiding love she has for family and friends. No matter the circumstance, Laura manages to draw from a well of love and hope. She eloquently expresses the depth of her faith and her very intimate relationship with God. Laura has “died to self” and trusts in our heavenly Father to guide her every step of the way. While I’m Waiting gives witness to Laura’s commitment to our loving Creator and her heartwarming devotion to Him.” ~Dolores Ayotte, inspirational author of Up The Down Ladder: Simple Ideas to Overcome Depression and book reviewer",
  "genres": [
    "Christian"
  ],
  "author": "Laura Hodges Poole",
  "average_rating": "4.42",
  "url": "https://www.goodreads.com/book/show/24485679-while-i-m-waiting"
}