{
  "title": "Der Tempel",
  "description": "Große Freiheit 1929Zehn Jahre nach dem Ende des 1. Weltkriegs betritt Paul Schoner Feindesland: in Hamburg besucht er Ernst Stockmann, den er in Oxford kennen gelernt. Die Brutalität des ersten Weltkriegs hatte die Menschen in vielerlei Hinsicht traumatisiert. Im prüden England ist jedermann verzweifelt bemüht, trotz allem die gewohnte Lebensweise aufrechtzuerhalten. Wie anders dagegen Deutschland: In Wandervogel und Körperkultur manifestiert sich ein Aufbruch der Jugend, der alle Welt in Staunen versetzt.Pauls Hamburger Gastgeber entstammt einer reichen Patrizierfamilie, deren großbürgerliche Lebensweise sich dieser Entwicklung stur widersetzt. Schon bald entflieht Paul ihrer pompösen, aber finsteren Villa an der Alster. In Joachim Lenz, einem ?missratenen? Kaufmannssohn, lernt er bald einen wirklichen Freund kennen, mit dem zusammen er Strandbäder und Nachtbars erkundet und schließlich ?- zusammen mit einem gemeinsamen ?Lover? ? eine Wanderung entlang des Rheins unternimmt. Joachim ist ein Repräsentant des ?modernen? Deutschland: Er fotografiert, will sich aber nicht als Künstler verstanden wissen und er liebt junge Männer, die ihn sofort langweilen, wenn sie seine Gefühle erwidern. Während ihrer Wanderung gelingt es Paul und Joachim, das Lebensgefühl des anderen besser zu verstehen; sie wünschen sich, dass diese Reise niemals enden möge. Als die Nazis in Deutschland immer stärker werden und sogar Joachims Studio verwüsten, verlässt Paul Hamburg, um in Berlin seinen Studienfreund Bradshaw zu besuchen.Spender hat dieses ungemein plastische Porträt einer Epoche unmittelbar nach seiner Rückkehr aus Deutschland geschrieben. Paul Schoner ist darin das Alter Ego des Autors, Joachim Lenz ist als der Fotograf Herbert List und Spenders Freund Bradshaw als Christopher Isherwood zu erkennen. Auch Ernst Stockmann wurde nach einer realen Figur gezeichnet, die für den Fall einer Veröffentlichung allerdings mit rechtlichen Schritten drohte ? einer von mehreren Gründen, aus denen der Roman zunächst nicht gedruckt wurde. 1986, fast am Ende seines Lebens, hat Spender diesen frühen Entwurf überarbeitet, sodass sein Buch die authentische Frische des eigenen Erlebens mit dem Wissen verbindet, was später geschah. Ein großer Roman über den Freiheitsdrang einer jungen Generation und Deutschland am Wendepunkt der Zwischenkriegszeit.",
  "genres": [
    "Fiction",
    "LGBT",
    "Gay",
    "Queer",
    "Gay Fiction",
    "British Literature",
    "Literature"
  ],
  "author": "Stephen Spender",
  "average_rating": "3.77",
  "url": "https://www.goodreads.com/book/show/24483467-der-tempel"
}