{
  "title": "Dirty Promises",
  "description": "\"Dirty Promises, from cover to cover, is a hauntingly dark tale of drugs and sex, greed and bloodlust, murder and revenge. With her beautiful prose and gritty plot, Halle eeks out every drop of emotion a reader can possibly feel until there's nothing left.\" 5 stars - Angie and Jessica's Dreamy Reads  \"This book is going to leave scars. I'm infatuated and repulsed and impressed all at the same time. A twisted tale well done.\" - NYT bestselling author Jay Crownover  \"Sexy dark gritty and sometimes disturbing to read. This book pushed my comfort zone time and time again and I LOVED it!!!\" 5 stars - Shhhh Mom's Reading  The New York Times bestselling author of The Pact and Sins & Needles, brings you DIRTY PROMISES, the FINAL book in the dark romantic suspense Dirty Angels Trilogy.  DISCLAIMER:  Dirty Promises is full of DARK characters. They are BAD people. They do TERRIBLE things. We are talking about the Mexican drug cartels here. In the cartels there is rape and there is cheating and there is torture and million other things that shouldn't exist but the reality is that they do. And this series tries to stay as true to reality as possible. You better check your morals at the door....   Blood. Sex. Revenge. Being king comes at a brutal price.  Drug lord Javier Bernal has sliced and diced his way to the top of the Mexican drug trade, presiding over the country's largest cartel. But his rise to power comes at a brutal price: the death of his sister, Alana. Devastated and wracked with guilt, he turns away from his new wife, Luisa, forcing their marriage into a steady decline. But it isn't until she's pushed into the waiting arms of Esteban Mendoza, his right-hand man, that Javier realizes everything he's lost. And it isn't until he learns the truth about Alana, that he realizes everything there is to gain. Blood will spill. Cities will burn. Heads will roll. Because Javier will stop at nothing until he gets what he wants. And what he wants is raw, ruthless revenge.  Nothing is more dangerous than a man with nothing left to lose.  DIRTY ANGELS TRILOGY READING ORDER:  #1 Dirty Angels #2 Dirty Deeds #3 Dirty Promises  While the first two books (Dirty Angels and Dirty Deeds) can be read by themselves, Dirty Promises should not be read as a standalone. WARNING: contains scenes of rape and torture, reader discretion is advised.",
  "genres": [
    "Dark",
    "Romance",
    "Abuse",
    "Dark Romance",
    "Suspense",
    "Adult",
    "New Adult"
  ],
  "author": "Karina Halle",
  "average_rating": "4.20",
  "url": "https://www.goodreads.com/book/show/24486569-dirty-promises"
}