{
  "title": "Cheese & Quackers",
  "description": "\"Cheese & Quackers\" came about from real life events and I have to give credit where credit is due because my husband actually came up with the idea for this story after hearing the following true events. Not only did he come up with the idea for the book, but he also came up with the title. I was at a loss for a title when the book was finished. He just blurted out \"Cheese and Quackers.\" He thought he was just being funny. \"That's it, that's the title. You are a genius,\" I told him.\" He and I agreed this would be a wonderful inspirational story for not just amputees but anyone living with any type of disability. This is also a wonderful teaching tool for children who are not disabled. It helps them to better understand and appreciate those who are. Marion Bantle, our dear friend, adopted grandmother, and mother of our Pastor Timothy Bantle passed away in August, 2013 from complications after having one of her legs amputated. After the funeral several of her family members went on a weekend get away to a cabin by a lake. They were out on the dock talking and laughing about the wonderful memories with Grandma Bantle when all of a sudden a duck flew onto the dock. To their amazement, the little duck was missing its left leg, just like Grandma Bantle. This book was written for anyone who feels worthless, helpless, or hopeless due to a physical or emotional disability. It was written to inspire and build up anyone of any age needing a little inspiration and encouragement.Mari can't do anything. She is so depressed and feeling sorry for herself after her tragic accident. All she wants to do is sit by the window in her wheelchair and watch the other children playing outside. Her favorite saying is \"I can't do anything.\" All of this changes when she meets an amazing and special little duck who teaches her a very important lesson. What is it that makes this duck so amazing and special and what lesson can Mari possibly learn from a silly little duck? This book was written for anyone who feels worthless, helpless, or hopeless due to any type of disability. It was written to build up anyone needing a little inspiration and encouragement.",
  "genres": [],
  "author": "Ruth Coates Diamond",
  "average_rating": "4.50",
  "url": "https://www.goodreads.com/book/show/24486107-cheese-quackers"
}