{
  "title": "The Panty Whisperer",
  "description": "** Contains adult language and steamy, hot, erotic thigh quivering descriptions. Enjoy!**I want you to remember my face. I want to watch your eyes roll up in your head, your toes cramp up while curling under your feet, your thighs trembling around my face, begging for me. I want to own your mind for the rest of your life. The thought of me will be a thirst you can't quench, a drug you can't have, an itch that cannot be scratched, no matter how hard you try. Nobody will send a shock of neural ecstasy to the tips of your toes the way I will. Care to bet me?Most people have something they're good math, sports, music, art. I was born with a more specific talent, pleasing women. I don't know how or why it happened, it's built into my DNA. I've always had the golden tongue, able to talk women into fulfilling their deepest, darkest fantasies. My name is Joel Hannover, but my friends call me the panty whisperer.I work as an accounting software consultant. It sounds fancy, like I should be good with math or computers. In reality I'm a salesman. My job just happens to be perfect for my hobby. Most accounting departments are comprised of women. Women most people believe are boring or uneventful. I meet these women every day. Insecure, dressed conservatively, hiding their beautiful bodies behind layers of clothing, afraid a few pounds of baby weight may still show. Ladies who work crossword puzzles and process numbers and transactions. It's all a facade, these women are sexual creatures who want to have all of their desires met and all of their needs fulfilled. Begging for someone to explore them, to bring them out of their shell and release the sexual tension that has saturated their entire being, afraid to break free.Meet Jessica mid-thirties, married with two kids, unhappy. Incredibly sexy! Will I open her mind and push the erogenous zones in her brain past their breaking point? You'll have to read to find out...",
  "genres": [
    "Erotica",
    "Romance",
    "Short Stories",
    "Novella"
  ],
  "author": "Sloane Howell",
  "average_rating": "3.84",
  "url": "https://www.goodreads.com/book/show/24482751-the-panty-whisperer"
}