{
  "title": "Superpowered Love Boxed Set",
  "description": "Publisher's All books in the Superpowered Love series were previously released as individual stories but have been compiled into one volume at a reduced price--for a limited time!EquilibriumEcon student Hansen Marks has been hot for Sam MacLeod since they first bonded over their secret superpowers--literally hot, since Hansen can produce fire from thin air. But soccer star Sam was always covered in girls, so Hansen kept his attraction in the closet and convinced himself that \"best friends\" was better than nothing. When Sam's electrical powers freak out in public, Hansen has a sinking feeling they've been spotted by unfriendly eyes. While dealing with the fallout, Sam's emotional dependency on Hansen forces their mutual attraction to the surface. Riot BoyEtienne never thought getting his pocket picked could lead to a first date. He knows the second he catches punk boy Brady's eye that the guy is pure trouble, but Et can't resist his wicked sense of humor, pretty face, cold hands--and the \"piss off\" swagger when Brady's on stage with his band doesn't hurt, either. Nobody's HeroJamie Monday lives in two different worlds. With his family, he's the golden child of awakened superpowered society. He's meant to do Great Things and pass on his powers -- with the appropriate girl, hand-picked by his mother. With his friends, he's the social director and life of the party. He's also an out gay man with an appetite for the quick and easy lay. It's tough to have a relationship when you're hiding off-the-charts electrical powers, but Jamie doesn't mind. Not until the prickly, paddy rocking, geeky-hot new guy at work shows him what he's been missing, anyhow.Losing BetterSuperpowered Special Agent Gabriel Genêt's first solo go to Hooperstown, North Carolina, find evidence that Andrew Wynne is operating as a vigilante, then bring him in. Ten years ago, Gabriel spent a summer alternately torturing and hooking up with Andrew as they tried to ignore their parents' embarrassing affair. A covert game of betrayals ensues. Things start out complicated, with Gabriel using Andrew's open arms and attraction to him for all it's worth. Gabriel tells himself he doesn't reciprocate, and then that he can control it, but it's too violent for either of them to deny. Re-Entry BurnMalory Claremont was born and raised to be the villain in someone else's story, complete with fire-based superpowers. But then his cousin and former partner-in-crime, Brady, led him into a trap, and he's been in superpowered lockdown ever since. When he gets out on parole, he meets Theo McCracken, a cold-superpowered ex-offender. Theo has a modern Hamlet-style past, dangerously pretty eyes, and a hunger for affection that even Mal's best defensive efforts can't deny for long. In DistressHopeless romantic Eddie Kim acts out his favorite 'rescued by the white knight' fantasies through weekly D&D campaigns, but had almost given up hope of ever getting a real one. Then Callum, a mysterious red-head with freezing superpowers and a memorable kiss, saves him from a burning house but disappears without a trace. Taking pity on him, Eddie's friends look to craiglist to relocate his hero.Unfortunately, the publicity brings down the kind of attention Callum Race been trying to avoid; he's in town to try and clear his family name, and now the dangerous superpowered organization he needs to thwart know he's come home again. The heat between Callum and Eddie flares instantly, and Eddie insists on helping to undo the damage his romantic notions have done. The that will mean becoming embroiled in a nefarious plot, not to mention a superpowered world Eddie didn't even know existed a week ago.",
  "genres": [
    "Anthologies",
    "Paranormal"
  ],
  "author": "Katey Hawthorne",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/24504038-superpowered-love-boxed-set"
}