{
  "title": "Fairy Tale Romance Collection",
  "description": "Romance, intrigue, and danger abound in this five-book bind-up of Melanie Dickerson’s bestselling fairy-tale retellings.The Healer’s Apprentice: Rose has been appointed as a healer’s apprentice at Hagenheim Castle, and when Lord Hamlin—the future duke—is injured, it is Rose who tends to him. As she works to heal his wound, she begins to fall in love, and wonders if he feels the same. But Lord Hamlin is betrothed to a mysterious young woman in hiding. As Rose’s life spins toward confusion, she must take the first steps on a journey to discover her own destiny.The Merchant’s Daughter: Annabel is trapped in indentured servitude to Lord Ranulf, a recluse who is rumored to be both terrifying and beastly. She soon finds he is actually very kind and caring, and the two strike up a friendship that could soon become more. Then Annabel becomes involved in a situation that could possibly lead to Ranulf’s demise.The Fairest Beauty: Sophie desperately wants to get away from her stepmother’s jealousy, and receives her chance when Gabe arrives from Hagenheim Castle to rescue her, claiming she is betrothed to his older brother. Though romance is impossible--she is his brother’s future wife, and Gabe himself is betrothed to someone else--the pair flee to the Cottage of the Seven to find help. Before long both must not only protect each other from the dangers around them, they must also protect their hearts.The Captive Maiden: When Gisela learns the duke’s son, Valten--the boy she has daydreamed about for years--is throwing a ball in hopes of finding a wife, she vows to find a way to attend, even if it’s only for a taste of a life she’ll never have. To her surprise, she catches Valten’s eye. Though he is rough around the edges, Gisela finds Valten is everything she hoped he would be. But other forces are bent on keeping the two from falling further in love, putting Gisela in more danger than she ever imagined.The Princess Spy: Margaretha has always been a romantic, and hopes her newest suitor, Lord Claybrook, is destined to be her one true love. But then an injured man is brought to Hagenheim Castle, claiming to be an English lord who was attacked by Claybrook and left for dead. And only Margaretha--one of the few who speaks his language--understands the wild story. It is up to her to save her father, Colin, and Hagenheim itself from Claybrook’s wicked plot.",
  "genres": [
    "Romance",
    "Christian",
    "Fantasy",
    "Young Adult",
    "Historical Fiction",
    "Fairy Tales",
    "Christian Fiction"
  ],
  "author": "Melanie Dickerson",
  "average_rating": "4.52",
  "url": "https://www.goodreads.com/book/show/24503114-fairy-tale-romance-collection"
}