{
  "title": "Stepbrother Untouchable",
  "description": "Calling Nate Thornhill a rich, cocky, arrogant asshole would be an understatement.  He also happens to be stunningly handsome, popular, intelligent, and captain of both the Crew and Lacrosse teams at UVA. I hate him for thinking he’s untouchable—not because he’s a narcissistic, privileged, borderline-misogynistic heartbreaker—but because he’s right.  His first words to me were at a Crew House party, and he literally invited me to have a threesome with him and a random girl. I could’ve died from the embarrassment, he didn’t even know my name at the time, and he didn’t care to. After that night, I promised myself to never waste another second thinking about Nate Thornhilll.  My world becomes a nightmare when I realize my mom’s new husband Pierce has a son who’s my age…and he’s a junior at UVA too. I can’t believe my eyes when Nate walks over and sits down next to us at dinner, introducing himself like he’s never seen me before in his life.  Then I feel his hand on my thigh, underneath the tablecloth with our parents sitting across from us, inching closer and closer to my panties. My mind goes fuzzy, my heart starts racing, and my body does exactly what I don’t want it to do.  And then they hit me with the worst news of all…  Pierce has an internship lined up for me at his firm, and we’re going to live at his Eastern Shore mansion for the summer.  I’ll be sleeping down the hall from my new stepbrother…arguing with him at every breakfast, sitting across from him at every dinner, watching as he brings an endless string of girls back to his room…secretly wishing I was one of them.   Stepbrother Untouchable is a Stand-alone novel. It contains adult themes, harsh language, and graphic sexual content.",
  "genres": [
    "Romance",
    "New Adult",
    "Contemporary Romance",
    "College",
    "Contemporary",
    "Erotica",
    "Adult"
  ],
  "author": "Colleen Masters",
  "average_rating": "3.76",
  "url": "https://www.goodreads.com/book/show/24494627-stepbrother-untouchable"
}