{
  "title": "The Rum Runner's Woman",
  "description": "Whiskey, guns and Mr. WrongRomance set during the days of Prohibition in America.Captain Eric Bolene is a nervy daredevil and expert seaman who courts serious peril on the high seas as he engages in that very special form of American outlawry—rum-running.In a schooner too fast to catch he outwits, outruns, and outfights the United States Coast Guard. Intelligent, brave and cunning he has made a fortune in the illegal liquor trade and by the age of thirty-one he is a very rich man.The lusty outlaw leads a life of devil-may-care until the day he anchors his schooner, the Black Heart, at Okracoke Isle, North Carolina, where he meets May Kaney.May Kaney is a sensual, nineteen-year-old, sapphire-eyed, raven-haired beauty trapped on the island by poverty and forced by her abusive and alcoholic father into a life of unending toil as a waitress in a speakeasy.When the local bootlegger, attempts to rape her she manages to fight him off. When he vows to keep trying until he succeeds she is forced to commit a desperate act. May hides on a rum runner’s schooner and ends up at sea with a crew of dangerous men, and in the arms of a very handsome and virile stranger.The Rum Runner’s Woman by Mia SoulHot Dang!Spice up your weekend with the Rum Runner's Woman - a tantalizing journey to the rip-roaring days of Prohibition when mobsters, bootleggers, and rum runner's waged an all-out war with the Federal Government and the United States Coast Guard.Author Deb SandersMia soul has written a steamy novel full of adventure and erotic romance. This is a well-structured story with two charming characters.Harlequin EditorPlease choose the Look Inside the Book feature offered with just a click on the cover photo. Read the first chapters and if you like what you read please buy my book. If you like adventure, romance and hot love scenes you will enjoy The Rum Runner’s Woman.",
  "genres": [],
  "author": "Mia Soul",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/24503653-the-rum-runner-s-woman"
}