{
  "title": "Kissing the Highlander",
  "description": "His Wild Highland Lass by Terry SpearLady Sorcha Barclay fled her brother-in-law's castle because of his unwanted advances. An awe-inspiring circle of standing stones captures her attention and she captures the attention of the laird who owns the land.Laird Ronan Daziel takes Sorcha to his castle to protect her and give her a home. Before long, he wants much more. He's duty-bound to take a wife whose clan wishes an alliance with his. So why does he long to have something more? Everyone loves the lass as much as he does. But he has pledged his loyalty to his clan. Taking Sorcha to wife could lead to battle on several fronts. How can he wed another when she stole his heart from the first moment he laid eyes on her near the ancient standing stones on his lands?The Highlander's Charm by Eliza KnightThey should be enemies… But passion and love know no bounds.Returning from battle to England, Samuel de Mowbray discovers that his two younger sisters have been stolen by Highlanders. Determined to save them from vicious warriors, he convinces the king to send him north. While there, he discovers that his loyalties are wavering and that a headstrong, feisty lass could destroy everything he believes.Catriona Buchanan must travel north to ask for help in saving her brother and ridding her castle of brutal English knights. Unfortunately, to do so, she must trust in the thing she mistrusts the most—an Englishman. Minute by minute, the man who should be her enemy breaks down her defenses. There is something different about him and she can’t help but be captivated by Samuel, and his steamy kisses.Heart of Stone by Willa BlairRiding home after two years away, Gavan MacNabb encounters a lass and her deerhound in a moonlit circle of standing stones. Little does he know the garland of bluebells she weaves and the spell she sings will change the course of his life.Marsali Murray doesn’t really believe the old wives’ tale that making a chain of bluebells by the standing stones under a waxing moon will bring true love, but she’s desperate to try anything to escape the boring, everlasting sameness of her life.Gavan has already seen much of the world denied to Marsali. He’s ready to settle down. She is eager to spread her wings. Can they find what they need with each other?Kilts and Kisses by Victoria RobertsSince the deaths of her parents, Ceana Gunn has lived in the shadow of her uncle and his family. She wants nothing more than to see her clan the way it was when her father was still laird. But her uncle has other ideas. Ceana soon discovers that the only refuge to be found is in the last place she expects—the arms of her enemy.Luthais MacKay wants to be left alone. His only interest is training his prized hawks. He certainly doesn’t have time to listen to the petty squabbling of his clan when his father travels to Edinburgh and leaves him in charge. But when Luthais discovers a mysterious woman on his lands, he’s determined to unravel her secrets…one layer at a time.My Captive Highlander by Vonda SinclairCan unexpected passion and a little ancient magic turn enemies into lovers?During a fierce storm on the west coast of Scotland, Shamus MacKenzie barely survives a galley wreck only to be captured and held for ransom by the enemy MacDonalds. Aided by the gift of second sight, Maili MacDonald, sister of the ruthless chief, senses the handsome, dark-haired stranger will somehow be important in her life. Compelled to help him, she insists on providing him food and a healer to see to his injuries. She knows she is daft to fall in love with this captivating warrior after one forbidden kiss but cannot help herself. With each visit from Maili, Shamus finds his thoughts consumed by the enchanting lass. Can he convince her to help him escape the dungeon and prevent the impending battle between the two clans?",
  "genres": [
    "Anthologies",
    "Fiction"
  ],
  "author": "Victoria  Roberts",
  "average_rating": "4.17",
  "url": "https://www.goodreads.com/book/show/24499860-kissing-the-highlander"
}