{
  "title": "I Will Breathe",
  "description": "I Will Breathe is a 2017 Literary Classic's Finalist, 2016 New Apple Awards' winner in the YA Science Fiction category, 2015 Science Fiction Finalist in the IAN Book of the Year Awards, and a 2015 Readers' Favorite winner in the YA Science Fiction category. It has also received the Children's Literary Classic Seal of Approval. A Steampunk/Cyberpunk/Post-Apocalyptic Adventure With a Twist. The year is 2836. It has been eight hundred years since The Great War. There are small groups of people scattered in isolated pockets around the world, but most are too suspicious of each other for any intimacy. If they don’t stop hiding, and learn to help each other, there won’t be anyone left on earth. Liberty has grown up in this post-apocalyptic world. Her home is an airship built by her adopted father. Since his death, each day is just another day trying to survive in a hostile environment. That is until her father's dying friend asks if she’ll take custody of a small, child-like robot. The last thing Liberty needs is another responsibility. Surprisingly, once the endearing robot is aboard Airus, she discovers there is more to life than just living, and loving someone can be as easy as breathing. Reviewed By Emily-Jane Hills Orford for Readers’ Favorite “Have you ever wondered what the world would be like in eight hundred years time? Have you wondered what humanity would be like after an Armageddon or apocalyptic disaster? Would the human race even exist? And what in what manner would those surviving humans thrive? In I Will Breathe, Regina Puckett has written a story that reveals a futuristic look at life on a planet ravaged by war. As the main character, Liberty, struggles to survive and continue with the trading life that she learned from her adopted father, the possibility of a civilized human race once again existing evolves. The entire story makes you really think about 'what if?'. And it makes the reader hopeful that all will not be lost in the future. An interesting read.”",
  "genres": [
    "Steampunk",
    "Science Fiction",
    "Young Adult",
    "Fantasy"
  ],
  "author": "Regina Puckett",
  "average_rating": "4.19",
  "url": "https://www.goodreads.com/book/show/24515570-i-will-breathe"
}