{
  "title": "The Baltic Origins of Homer's Epic Tales: The Iliad, the Odyssey, and the Migration of Myth",
  "description": "Compelling evidence that the events of Homer's Iliad and Odyssey took place in the Baltic and not the Mediterranean• Reveals how a climate change forced the migration of a people and their myth to ancient Greece• Identifies the true geographic sites of Troy and Ithaca in the Baltic Sea and Calypso's Isle in the North Atlantic OceanFor years scholars have debated the incongruities in Homer's Iliad and Odyssey , given that his descriptions are at odds with the geography of the areas he purportedly describes. Inspired by Plutarch's remark that Calypso's Isle was only five days sailing from Britain, Felice Vinci convincingly argues that Homer's epic tales originated not in the Mediterranean, but in the northern Baltic Sea.Using meticulous geographical analysis, Vinci shows that many Homeric places, such as Troy and Ithaca, can still be identified in the geographic landscape of the Baltic. He explains how the dense, foggy weather described by Ulysses befits northern not Mediterranean climes, and how battles lasting through the night would easily have been possible in the long days of the Baltic summer. Vinci's meteorological analysis reveals how a decline of the \"climatic optimum\" caused the blond seafarers to migrate south to warmer climates, where they rebuilt their original world in the Mediterranean. Through many generations the memory of the heroic age and the feats performed by their ancestors in their lost homeland was preserved and handed down to the following ages, only later to be codified by Homer in the Iliad and the Odyssey .Felice Vinci offers a key to open many doors that allow us to consider the age-old question of the Indo-European diaspora and the origin of the Greek civilization from a new perspective.",
  "genres": [
    "History",
    "Nonfiction",
    "Mythology"
  ],
  "author": "Felice Vinci",
  "average_rating": "3.72",
  "url": "https://www.goodreads.com/book/show/245164.The_Baltic_Origins_of_Homer_s_Epic_Tales"
}