{
  "title": "Serial Killer Quarterly Vol.1 Christmas Issue \"Body Harvest: Prolific American Killers\"",
  "description": "With nearly 200 victims between them, the seven compulsive killers in Serial Killer Quarterly’s special Christmas 2014 issue, “Body Harvest: Prolific American Serial Killers,” not only destroyed countless lives and families, but Thanksgivings, Christmases, and New Year’s. Author and criminologist Judith A. Yates attributes a minimum of 20 victims to America’s first serial killers, Micajah & Wiley Harpe, who rather than bringing “peace on earth and good will to all men,” sought to exterminate the entire human race. Similarly, whenever Ted Bundy went “walking in a winter wonderland” it was in the snowy mountains of Washington or Colorado – landscapes strewn with the ravaged corpses of his 30+ female victims. Kevin M. Sullivan – author, Bundy researcher, and retired preacher – looks at arguably the most infamous serial slayer in American history, and his victims – known and potential. In her true crime debut, forensic psychologist Joan Swart goes above and beyond to tell us the tale of America’s most prolific homosexual sadist. With possibly a higher body count than Bundy and the Harpes combined, Randy Kraft may have actually rung in the New Year by torturing, killing, and mutilating several of the over 60 young men whose lives he appears to have extinguished.Lee Mellor, author, criminologist, and SKQ editor-in-chief, writes of the 22 strangulation-slayings and post-mortem rapes perpetrated across the USA and in Canada by “Gorilla Murderer” Earle Leonard Nelson during the mid-1920s, as well as 10+ cold-blooded murders linked to “Coin-Shop Killer” Charles T. Sinclair throughout the Eighties. Spokane prostitute killer Robert Lee Yates – another necrophile – has admitted to shooting 16 victims and defiling their bodies, but author and journalist Karen D. Scioscia asks: were there more? Are you full of holiday cheer yet? Well, at least we know that Christmas was truly a time for family in the Bender household – even if their feasts were purchased with the money they stole from the people rotting under their floorboards. Dane Ladwig looks at the more than 20 hammer murders believed to have been committed by The Bloody Benders in the mid-nineteenth century.Cuddle up with a nice piping mug of hot chocolate, because after reading “Body Harvest” there isn’t a blanket in the world that will stop you from getting the chills.‘Tis the Season to be Grinning.- America’s first serial killers Micajah & Wiley Harpe- “Co-ed Killer” Ted Bundy- Randy Kraft kills 60+- “Gorilla Murderer” Earle Leonard- “Coin-Shop Killer” Charles T. Sinclair- Spokane prostitute killer Robert Lee Yates- Hammer time with the Bloody Benders",
  "genres": [
    "True Crime"
  ],
  "author": "Kevin M. Sullivan",
  "average_rating": "4.23",
  "url": "https://www.goodreads.com/book/show/24506545-serial-killer-quarterly-vol-1-christmas-issue-body-harvest"
}