{
  "title": "True Control",
  "description": "WAIT! YOU HAVE A DECISION TO MAKE BEFORE BUYING THIS BOOK!Note from the author: I’ve written two completely different, alternative endings to this series. See for yourself why fans are saying this makes all the other dark romances look like greyed out shades of fairytales.This is the end one way or another.~WillowONE OR TWOThere was only ever one ending for Max and Lucy, but I aim to please—or torture—however you wish to look at it. I believe in true choices, so I give you control of their fate to pick which ending you prefer.LOST OR FOUNDThis is the lighter ending for Max and Lucy. When destiny gets in the way, love may have trouble finding a way back to True Control.NOTE: All the books in this series are available for purchase/download now, so you won’t be left wanting or waiting. This series involves a combination of Domestic Discipline, D/s, and SmNow available in paperback too!Excerpts:I try to be still in Max’s arms. I’m too chilled by his words. So calm. So clear. “What if…what if that’s not what I want…what I need…?” I say this as almost a whisper, too afraid to say it…to afraid to keep it in.He doesn’t say anything for a long time. I almost think he didn’t hear me until his voice answers in a whisper too, “You gave up having a choice when you became my wife, Lucy. What you want…what you need…I decide. You’ll take whatever I do to you.” Even in a whisper, I know his final tone when I hear it. There’s no point in talking more. I swallow and still only speak in a cracked whisper, “What…what are you going to do to me, Max?”And he waits to answer me again. His voice slides across the words, like he’s enjoying hearing the fear in my voice, feeling the shiver in my body. “Do you really want to know, little girl?”…..I don’t really want to be cruel to her. I like hurting her, sometimes just for my pleasure…but I want to be loving and kind to her too. And most of the time, I am.I give her all of my love. I deny her nothing. Within reason anyway. I’m not a fool though. I know what I demand isn’t for everyone. I’ve had enough girlfriends throw modern feminism and equal rights crap in my face to know that Lucy isn’t like any other girl. She understands that she needs my guidance. She gets that all of my rules, demands, punishments are meant to help her, to help us. To be happy. I know I’m a monster. I’ve come to terms with this. I don’t care what anyone thinks of me. I only care about Lucy. About her obeying and submitting to me.",
  "genres": [
    "Dark",
    "BDSM",
    "Abuse",
    "Dark Romance",
    "Erotica"
  ],
  "author": "Willow Madison",
  "average_rating": "3.43",
  "url": "https://www.goodreads.com/book/show/24516154-true-control"
}