{
  "title": "True Control",
  "description": "WAIT! YOU HAVE A DECISION TO MAKE BEFORE BUYING THIS BOOK!Note from the author: I’ve written two completely different, alternative endings to this series. See for yourself why fans are saying this makes all the other dark romances look like greyed out shades of fairytales.This is the end one way or another.~WillowONE OR TWOThere was only ever one ending for Max and Lucy, but I aim to please—or torture—however you wish to look at it. I believe in true choices, so I give you control of their fate to pick which ending you prefer.LOST OR FOUNDThis is the darker ending for Max and Lucy. The monster gets the girl. When love is lost, it may be impossible to find a way back to True Control.NOTE: All the books in this series are available for purchase/download now, so you won’t be left wanting or waiting. This series involves a combination of Domestic Discipline, D/s, and SmNow available in paperback too!Excerpts:I know my girl. She didn’t know her submissive side when I met her. I saw it in her. I recognized the signs, saw what she could be for me. I didn’t go slow. I didn’t have patience. I didn’t ease her into anything.I broke her and made her mine quickly. I forced her to submit to me completely. I gave her only one choice. One chance to back away from her destiny with me. She can’t be lost. I need her. Here with me. I’m lost without her.…..He’ll kill me eventually. In a rage, he’ll do it without thinking. I start to cry again, but shout at myself to stop.I look in the mirror again…I’m only getting more broken by the day…mentally and physically. I try to stand up, to take a deep breath. But I wince at my reflection.I hear him shouting at me and I turn away from the girl in the mirror…I can’t be her today. I can’t be strong when I’m this weak.",
  "genres": [
    "Dark",
    "Abuse",
    "BDSM",
    "Erotica",
    "Contemporary",
    "Dark Romance",
    "Romance"
  ],
  "author": "Willow Madison",
  "average_rating": "3.08",
  "url": "https://www.goodreads.com/book/show/24517063-true-control"
}