{
  "title": "Contract City",
  "description": "Welcome to Tulsa, Oklahoma—the City of the Future™From Elite Medical Services™ to Professional Personal Security® Rest Assured that You and Your Family are in Good Hands.\tThe year is 2021 and the money is still green. The fully privatized city of Tulsa, OK, is home to Sara Paige Christie, a teenage girl with her heart set on a film career in L.A. and her camera trained on the graffiti-covered walls of the city's outskirts. In pursuit of a documentary subject that might propel her from college hopeful to film school admittee at USC, Sara has focused her ambitions upon a singularly ubiquitous tag—WH2RR??From the facades of storefronts to the walls of public restrooms, the tag is appearing nearly everywhere. Its stark all-capital letters and demanding question marks have captured Sara's imagination, even as the private security personnel of Free Force Tulsa (FFT) scramble to eliminate the marks with power washers, gray-overs, and full censorship, stripping even photographs of the tags from the locally accessible Internet. Sara has no doubt that there is meaning hidden in plain sight, and she sets off on a mission to find the person behind the mysterious tags while balancing an already full life: her final exams, her wild best friend, a physical fitness test that threatens her GPA, and a family that seems almost oblivious to what's happening just down the street from their suburban home.With the exception, perhaps, of her father. A retired Marine turned FFT investigator, Sara's dad has been on the trail of the graffiti artist for his own professional reasons. And if he knows what’s going on, he's not telling Sara.And they're not the only ones on the hunt . . .Tensions are rising in town and beyond. Between the machinations of the city's home-grown megachurch, Chosen Hill, and the movements of a growing camp of homeless citizens parked just beyond Tulsa's comfort and security, life in Tulsa is about to become very interesting, and Sara just might be in the right place to catch it all on film . . . \t. . . but only if she survives.",
  "genres": [
    "Science Fiction",
    "Young Adult",
    "Fiction"
  ],
  "author": "Mark Falkin",
  "average_rating": "4.14",
  "url": "https://www.goodreads.com/book/show/24513773-contract-city"
}