{
  "title": "The Loner",
  "description": "Star Allistar:Life is divided into two stages for me: before and after. Unfortunately, I'm not coping so well in the \"after\" stage. My parents decide transferring me to a new school for my last semester of high school will knock me out of my funk. As if a new location is the cure for your boyfriend dying in a terrible car accident. I go along with it, though, I mean, what other choice do I have? I only have one goal at the new school: be invisible. Turns out, small towns have nothing better to do than gawk at the new girl. Great. I instantly despise everyone...except him. Drake Knight. Town bad boy, walks in a cloud of mystery, and turns girls into goo. Not usually my type. Yet, for some reason, I'm drawn to him like a diabetic in a candy store. But there's just one teeny, tiny problem: he turns into a wolf. And not just that, but he's an important wolf-boy whose boss is a powerful angel and has some intense enemies of the demonic persuasion. I mean, we're talking psycho fallen angels who want to take over the world type of intense. How do I explain that one to the parents? Anyway, I once thought my heart belonged to the one I lost, but now...now I'm not so sure.Drake Knight:I don't do love. I tried it once, and she ended up dead in a ravine. So, I tend to keep my distance from people. It's better that way. safer. Yet, when Star Allistar walks into the band room and flashes those big, solemn green eyes at me, I'm a goner.  There's just one problem: she's human, and humans don't survive in my world. But I won't let that stop me. She's my purpose, my hope, my mate, and I'm prepared to kill anyone who tries to jeopardize her happiness. In a twist of Fate, two other shifters also believe Star is their mate. There can only be one. I've never had to fight for love. Didn't even know my heart still worked. But now? Now all bets are off. Star is mine. I just have to make her see it, before it's too late.Three male shifters, an angry fallen angel, and a depressed high school. What could possibly go wrong?",
  "genres": [
    "Paranormal",
    "Young Adult",
    "Fantasy",
    "Paranormal Romance",
    "Werewolves",
    "Supernatural",
    "Romance"
  ],
  "author": "K.R. Grace",
  "average_rating": "3.86",
  "url": "https://www.goodreads.com/book/show/24506421-the-loner"
}