{
  "title": "Dark Screams: Volume Three",
  "description": "Peter Straub, Jack Ketchum, Darynda Jones, Jacquelyn Frank, and Brian Hodge contribute five gloomy, disturbing tales of madness and horror to Dark Volume Three, edited by Brian James Freeman and Richard Chizmar of the celebrated Cemetery Dance Publications.   THE COLLECTED SHORT STORIES OF FREDDIE PROTHERO by Peter Straub A mere child yet a precocious writer, young Freddie records a series of terrifying encounters with an inhuman being that haunts his life . . . and seems to predict his death.   GROUP OF THIRTY by Jack Ketchum When an award-winning horror writer on the downward slope of a long career receives an invitation to address the Essex County Science Fiction Group, he figures he’s got nothing to lose. He couldn’t be more wrong.   NANCY by Darynda Jones Though she’s adopted by the cool kids, the new girl at Renfield High School is most drawn to Nancy Wilhoit, who claims to be haunted. But it soon becomes apparent that poltergeists—and people—are seldom what they seem.   I LOVE YOU, CHARLIE PEARSON by Jacquelyn Frank Charlie Pearson has a crush on Stacey Wheeler. She has no idea. Charlie will make Stacey see that he loves her, and that she loves him—even if he has to kill her to make her say it.   THE LONE AND LEVEL SANDS STRETCH FAR AWAY by Brian Hodge When Marni moves in next door, the stale marriage of Tara and Aidan gets a jolt of adrenaline. Whether it’s tonic or toxic is another matter.Praise for Dark Volume Three   “Well worth picking up and reading . . . If you have not tried the series yet, do yourself a favor and grab a copy of any (or all) of the books for yourself.”—Examiner.com   “Freeman and Chizmar have brought their A-game to Dark Volume Three. If you pick just one installment in this series to read, pick this one.”—LitReactor   “Another winner.”—HorrorTalk   “A gathering of perfect little bites of fiction . . . As you finish one story you’ll definitely be ready to move on to the next one.”—Sweet Southern Home   “Every story has something to offer for horror fans. They’re creepy, thought-provoking, scary and quick reads.”—The Reader’s Hollow   “[Horror] needs to hit you in the sweet spot where the amygdala and the cerebrum whisper to each other, where intellect and emotion intertwine, and all of these stories do that, and they do it well.”—Bibliotica   “A fun, frightful read . . . If the editors keep raising the bar, I’ll be back again and again.”—Atomic Fangirl",
  "genres": [
    "Horror",
    "Short Stories",
    "Anthologies",
    "Fiction",
    "Audiobook",
    "Dark Fantasy",
    "Collections"
  ],
  "author": "Brian James Freeman",
  "average_rating": "3.53",
  "url": "https://www.goodreads.com/book/show/24516415-dark-screams"
}