{
  "title": "Homemade Laundry Soap & Supplies: Easy DIY Household Recipes for Laundry Detergent, Fabric Softener, Stain Remover and Cleaning At A Fraction of the Cost",
  "description": "According to the U.S. Environmental Protection Agency, air quality inside many homes can be 2-5 times more polluted than the air just outside our homes.Traditional household cleaners play a huge factor in this pollution. Synthetic household products contain harmful chemicals that react with ozone from the air, creating toxins like formaldehyde. As an individual you have the power to control most of your choices and, therefore, the impact you create on the environment.Embracing a greener lifestyle isn't just about helping to preserve equatorial rain forests, it can also mean improving your health, padding your bank account, and, ultimately, improving your overall quality of life. For instance, Americans do a lot of laundry — about eight loads a week on average, using store-bought detergent adds up. If you’d rather save money, try making your own detergent — it’s a fun, easy project, and your laundry will cost only pennies per load. So to sum up... non-toxic cleaners are perfectly safe around children, keep the air you breathe clean, are much, much cheaper and they don’t harm the environment. Interested? Read on...What You Will Discover InsideBenefits of Homemade DetergentsPowder vs Liquid DetergentsTransition to Natural LivingWhat's in conventional detergents?Can your detergents stand up to the test?25 Homemade Detergents to try Would You Like To Know More? This book contains some great simple effective recipes to replace your current store bought detergents. The question is, will you choose to use them and save money and the environment at the same time? Or, will you just continue to do what is convenient and harmful in spite of what you have learned here!If you are ready to make a difference and Go Green! then scroll up and grab your copy of Homemade Laundry Soap & Supplies.",
  "genres": [],
  "author": "Cassie Reese",
  "average_rating": "3.95",
  "url": "https://www.goodreads.com/book/show/24525017-homemade-laundry-soap-supplies"
}