{
  "title": "Grind",
  "description": "The Long Way Round series:   Three friends—Cara, Natalie and Chelsea—with three different lives. Sometimes they’re on top of the world. Sometimes they just plod along. Other times they may find they’re starting over again. But will they find their happily ever afters?   Grind by Kait Gamble   Book One in The Long Way Round series  Can Jason convince Cara to go from being lovers to something more?  Commitment phobic Cara Witchai loves her life the way it is—especially her no-strings-attached relationship with long-time lover Jason. But when Jason blurts out a marriage proposal, it throws Cara into a tailspin. How can Jason convince her to stay?  Cara, a successful restauranteur, prefers to be in charge of her life. She’s done a great job of it so far. She has a wonderful friend, a restaurant where customers need reservations months in advance to get a table and she has a man who fits into her life without taking over. She can get on with her life while still having fantastic sex and not have to worry about maintaining a relationship that will eventually fall apart. It’s bliss, as far as she’s concerned.  Jason has other ideas for his latest visit to see Cara. They’ve dated in the past, but after breaking up, their arrangement has evolved into a mutually satisfying meet every few months. They understand each other and are happy in and out of bed. However, neither has pushed for anything more. Jason wants to take things further, so he must convince Cara that they make the perfect couple.  His plan—use every weapon in his arsenal. Money, his command over her body. Whatever it takes. Kait Gamble  About the Author:  Kait was born and raised in the wilderness of the Pacific Northwest and started writing to entertain herself during the long winters as a child. Insatiably curious with a love of learning new things, she’s picked up many random skills including three languages and two martial arts. After travelling three continents (the other four are on her bucket list), she settled in England with her family where she spends most of her time cultivating her daughter’s love of reading and writing, scribbling ideas on every available scrap of paper, and trying out dialogue on her cat.",
  "genres": [],
  "author": "Kait Gamble",
  "average_rating": "4.80",
  "url": "https://www.goodreads.com/book/show/24528324-grind"
}