{
  "title": "Tangled Hearts",
  "description": "When hearts collide, there are bound to be sparks. But when a duo turns into a wickedly passionate menage, there's unstoppable fireworks! In this brand new collection of steamy menage stories, all of your secret desires and wicked fantasies will come to life. Grab your copy of our exclusive box set and surrender to the burning desire of these deliciously naughty tales! Tangled Hearts features all of your favorite boyfriends, including alpha male bikers, powerful shifters and dangerously obsessive men that will take your breath away! Use the preview feature to read the full description of each story and let the sinful fun begin.* * * Taking Heat by Emma YoungRoxy Marshall's life isn't glamorous. Her dead-end job at Hungry Pete's Diner isn't much to brag about, either. All of that changes when she finds herself naked and alone with the local biker gang's leader, David \"Boss\" Rivera. But when David's wife, Brooke, emerges and asks to turn the sinful twosome into a racy threesome, sparks start to fly.The Wolves Next Door by Catherine ValeWhen plus size single Julie moves into a strange town, nothing could prepare her for the dangerously handsome strangers next door who want nothing more than to claim her as their own. The Alpha's Secret by Tabitha ConallPrivate investigators--and werewolves-- Gavin and Liam find their mate, Bridget, while on a case. But in spite of the mating lust riding all three of them, Bridget resists the urge. Something stronger than the mating lust keeps her from committing. Meanwhile, Gavin and Liam discover treachery in her past. Can they unravel the clues to both mysteries so all three of them can come together at last?A Ghostly Menage by Eve LanglaisA haunted house. Ghostly touches. A romance to make you shiver - in a good way.Seducing the Sergeant by Mina CarterGenetically patched and with a distinguished service record, Combat Sergeant Wynter Ferris is as hard as nails and twice as tough as most of the men she leads. But after being assigned to a weredog unit, where partners and Camden and Rennick serve, the rules of her world change.All the Way by Giselle RenardeWhen Josie invites her high school boyfriend Kaz to stay with her family over the holidays, there are a few things she doesn't anticipate, like Kaz admitting he's never been with a woman after all these years. But after her husband, Rob, attempts to give Kaz a little training in the hot tub with Josie by his side, who will Kaz fall for?Her Two Bosses by Rachel ChaseWhen charismatic CEO Vance Harper and billionaire philanthropist Cort McCall take charge of the struggling nonprofit where Alexa Knight works, her two new bosses fuel forbidden erotic fantasies ... that become shockingly real when both men decide they want her too. What Happens in Vegas by Terry TowersAfter a passionate Las Vegas night with two NYPD officers, Dane and Graham Porter, Genevieve Fennel returns to New York, hoping to shrug off the wild fling and a relationship that imploded just weeks before. But when there's a break-in at her boutique and the sexy-as-sin Porter men are sent to her rescue, it becomes clear that fate has other ideas.Inescapable by Saskia WalkerA witness protection safe house. A steamy ménage. As danger closes in Seth and Adrian must learn to share and protect the woman they love.",
  "genres": [
    "Menage",
    "Anthologies",
    "Erotica",
    "Paranormal Romance",
    "Romance",
    "M M F"
  ],
  "author": "Catherine Vale",
  "average_rating": "3.69",
  "url": "https://www.goodreads.com/book/show/24527436-tangled-hearts"
}