{
  "title": "The Fear of Surrender",
  "description": "The Hampton Road Club    Welcome to the Hampton Road Club. It’s the 1920’s and men who enjoy Dominance and submission have to be very careful that their dark desires aren’t discovered. The exclusive and secret Hampton Road Club near Hollywood is one of many private homes around the world that offers facilities for those who practice sadism and masochism. Meet the men who search for love amongst the world of bondage, whips and chains. This is where a Master can find a submissive to cherish forever and a submissive can give himself to his Master for a lifetime of painful pleasure.   The Fear of Surrender by Morticia Knight   Book Three in The Hampton Road Club series  Master Thomas sees a submissive man aching for surrender. But can Linus be convinced not to fear The Hampton Road Club?  Linus never wants to return to Hampton Road after being attacked by a Master there. Even though he aches for the attention of Master Thomas—the one who he’d originally wanted—he isn’t sure he can ever trust another Master not to abuse him again.  Thomas is furious with himself for not protecting the beautiful young submissive whose company he’d enjoyed on a few occasions. He’s relieved that there have been some recent changes to help protect the men who offer themselves at the sadomasochism club. It’s about time to bring Hampton Road into the progressive age of the 1920s. Now that the new rules are in place, perhaps he can woo Linus into giving him a chance.  As Thomas goes out of his way to be kind to him, Linus wonders if he’s misjudged the Master. He’s still not sure if there’s a future for them. What if he never wants to surrender to another man? When he allows Thomas to teach him the joys of Dominance and submission, Linus discovers that he not only wants to surrender, he wants to be claimed permanently. If only Thomas’ old life doesn’t come back to haunt them and destroy their chance of being together forever. Morticia Knight  About the   M/M and M/M/F Erotic Romance author Morticia Knight enjoys a good saucy tale – after all, who doesn’t? Since she loves several genres, you may find your heroes in a contemporary, historical, paranormal or sci-fi setting. One of her passions is bringing people's fantasies to life on the page, because life is too short for even one boring moment. Her stories are volcanic in heat, deep in emotion, and sprinkled with doses of humor.  When not indulging in her obsession for books, she loves the outdoors, film and music. The Pacific Northwest is the ideal spot to enjoy both hiking and beachcombing. Once upon a time she was the singer in an indie rock band that toured the West Coast and charted on U.S. college radio. She now resides on the northern coast of Oregon, where the constant rain and fog remind her of visits to family in England and Scotland when she was a child.  She is currently working on the Sin City Uniforms Series and a BDSM spin-off to the Gin & Jazz series entitled The Hampton Road Club. A follow-up to Bryan and Aubrey’s story in Rockin’ the Alternative will be available in 2015.",
  "genres": [
    "BDSM",
    "Historical",
    "M M Romance",
    "Romance",
    "Historical Romance",
    "Erotica",
    "Gay"
  ],
  "author": "Morticia Knight",
  "average_rating": "4.08",
  "url": "https://www.goodreads.com/book/show/24528049-the-fear-of-surrender"
}