{
  "title": "Quinn's Gambit",
  "description": "An unregistered, human con wizard and a duty-bound, straightlaced elf cop. As New York explodes with dangerous creatures, their passion goes nuclear.After a terrible magical accident at Berkeley created unpredictable holes between realities—all manner of non-human creatures started popping into our world. These displacements, called RARE—Random Anomalous Reality Events—have taken magic out of fiction and relocated it firmly in reality, resulting in a great deal of chaos and confusion. Displaced elf Valerian works with AURA—the Agency of Unnatural Resettlement and Assimilation—to intercept these beings as they appear in the human world, helping the peaceful ones and subduing the violent, malevolent ones. It’s good, satisfying work, and Val would be happy if he wasn’t so lonely.Quinten is a young mage just trying to get by, but New York isn't the easiest city to make a living. If his methods are sometimes morally dubious, his heart is still in the right place. Of course for Quinn, the right place means firmly locked away, protected at all costs. Living by his wits and sometimes magically-induced luck, he works as a ‘free-lance magic user’, or unregistered mage and small time con—according to the authorities. The last thing Quinn wants is to draw the cops’ attention, but when an Event happens right on top of him, he’s forced to turn to AURA for help. Valerian isn’t at all what he’d expected in an AURA cop, and he certainly wasn't expecting to join forces with the sexy elf, a snarky drow and a bitter incubus when certain individuals in power try to stop the RARE by any means necessary.Things are not all what they seem at AURA headquarters, and a greater evil lurks at the top than anyone could have imagined.",
  "genres": [
    "M M Romance",
    "Fantasy",
    "Paranormal",
    "Urban Fantasy",
    "Magic",
    "Romance",
    "M M Paranormal"
  ],
  "author": "Angel  Martinez",
  "average_rating": "3.88",
  "url": "https://www.goodreads.com/book/show/24528629-quinn-s-gambit"
}