{
  "title": "Darkness Series Boxed Set, #1-4",
  "description": "Experience the roller coaster adventure as Sasha confronts a new world full of magic, mayhem, and love. Follow her journey from an orphan who lost everything, to one of the most powerful mages in the nation. By Stefan's side, an alpha male who rules his clan with an iron fist, she will battle for her place as a Black mage, and leader's mate. This thrill-ride will leave you breathless and begging for more!This volume contains the first four Darkness series books; Into the Darkness, Braving the Elements, On a Razor's Edge and Demons.Into the Darkness (Book 1)Sasha has grown up with one surety: she’s not normal. She sees things in the darkness that no one else can see. Mysterious men cloaked in shadow, moving through the night. The problem is, pointing out invisible people is a fast track to a padded cell. Orphaned at age five, Sasha quickly learns an important survival tip: keep her mouth shut and stay out of the spotlight. Until one night, everything changes. Suddenly, the men she was convinced were hallucinations, are very real. And very dangerous. As a new world opens up around her, she meets him. The Boss. An alpha leader who entrances her mind and tugs on her body. Primal and sexual, his people have a different set of rules. And they don’t always play nice. As danger rises up around her, her differences may be the only thing that saves her life. Sasha must embrace the things she tried so hard to hide, while resisting the person her body craves most. She has finally found her shadow men, and they will change her life forever.Braving the Elements (Book 2)With a life goal of fitting in, Sasha hopes her strange abilities will finally make true friendship a possibility. Unfortunately, her magic doesn’t function like everyone else’s. What she thought would make her belong, sets her apart now more than ever. Stefan, all but promised to a different woman, has tried to keep his mind on his duties instead of the irresistible and free-spirited human. But when she is threatened, he can’t keep his distance anymore. He realizes he’ll stop at nothing to keep her safe, and more importantly, make her his. Just when one thing clicks into place, another spirals out of control. Stefan’s clan isn’t the only group that would benefit from an extremely rare type of magic. And their enemies will stop at nothing to get what they want. On a Razor's Edge (Book 3)Life for Sasha isn’t getting easier. She has survived run-in’s with monstrous Dulcha, lived through an abduction, and even made it past Charles’ constant badgering for sex. But if she thought the hurdles of this new life were behind her, she was dead wrong. When the Regional comes to visit Stefan’s clan, the pressure increases. Sasha finds herself on a giant scale, assessed for her magic and held in the balance. If she doesn’t have the magic Stefan hopes, she could find herself on the street while still in grave danger. Even with a favorable outcome, however, her inability to use her magic presents a road block not easily crossed. Demons (Book 4)It’s been a long road, but Sasha has finally claimed her role as the least knowledge mage in history. She’s also acquired a new, incredibly grumpy bodyguard, and a spunky new BFF. With her team by her side, she learns the ropes of this new profession. Her experience level is about to be fast-tracked, however. On a routine trip to check out a perimeter breach, she encounters a hideous demon called by an experienced magic worker. It is this terrifying discovery that unlocks a deeper problem: Stefan’s troubled past.Darkness Series:1. Into the Darkness 2. Braving the Elements 3. On a Razor's Edge 4. Demons 5. The Council 6. Shadow Watcher 7. Jonas 8. Charles9. Jameson",
  "genres": [
    "Paranormal",
    "Fantasy",
    "Romance",
    "Vampires",
    "Urban Fantasy",
    "Paranormal Romance",
    "Erotica"
  ],
  "author": "K.F. Breene",
  "average_rating": "4.39",
  "url": "https://www.goodreads.com/book/show/24534076-darkness-series-boxed-set-1-4"
}