{
  "title": "Crystal Night",
  "description": "*** Best Novella - 2016 Florida Writers Association Royal Palm Literary Awards ***Berlin, 1938. On the eve of one of history’s darkest moments, a Swedish bartender with unusual talents accidentally uncovers a woman’s hidden past while working in the heart of Nazi Germany. Crystal Night is a tale of intrigue, mystery and suspense that follows ordinary German citizens as they struggle under the jackboots of marauding brown-shirts, the dreaded Gestapo and the infamous SS. Can the Prometheus probe as ‘Johann Nilsson’ remain detached during this ugly piece of our history, or will it become an accomplice as the Holocaust accelerates?  A short story from The Prometheus Saga.   INTERVIEW WITH THE AUTHOR   Q - What is the Prometheus Saga?  A - In the Prometheus Saga, thirteen authors unite to interpret how an alien presence would interact with the human condition over a time period that spans from the dawn of man to the present. The stories cross genres and genders, allowing for entirely different narratives and insights on historical events and the human experience.  Q - Where should a reader start when selecting a short story to read in The Prometheus Saga?  A - Each story is self-contained and can be read in any order. The reader is free to select any of the stories at random to begin their experience. Each short story has a different setting in history. The book description will explain the time period setting for each particular story.  Q - What is this alien probe?  A - An alien civilization landed a probe on Earth at the dawn of mankind. This probe, a form of artificial intelligence, can morph into any human form, take on any human identity, either male or female. Its life spans hundreds of thousands of years. Its mission is to report everything it can about us to its home planet. What this humanoid observes and learns over centuries of human existence will be interpreted through each short story in the saga. The alien probe is as mythic as Prometheus, the Greek Titan who was said to have brought fire to mankind.   About the Author   CHARLES A CORNELL is the author of Tiger Paw which won the RPLA Best Thriller award in 2012 from the Florida Writers Association. His newest work is DragonFly which ventures into the realm of dieselpunk, a retro-futuristic collision of science fiction and fantasy with a generous dash of alternative history. DragonFly follows the journey of RAF pilot Veronica Somerset as she battles the odds to become Britain’s first female fighter pilot. DragonFly is not just a novel, Charles Cornell creates a whole new world of fantastic technology, dangerous fighting machines and wizards battling across the boundary between good and evil in a World War re-imagined like never before.  About DragonFly  \"DragonFly is brilliant! The Golden Age of Science Fiction is alive and well!\"—Carol Kean, book reviewer for Perihelion Science Fiction Magazine and Amazon 'Vine Voice' star reviewer  \"A gripping and fast paced new adventure series…\"—Five Star Amazon Review  \"I want to commend the author for writing a compelling and strong female lead... It’s characters like Ronnie and the courage of authors like Cornell (to write such characters) that will help change the face of the sci-fi/fantasy/dystopian genre.\" —Five Star Amazon Review \"It has something for everyone. History wrapped in mystery draped in SciFi makes Dragonfly a fast-paced winner!\"—Five Star Amazon Review  Visit Charles at www.CharlesACornell.com and his illustrated world of DragonFly at www.",
  "genres": [
    "Science Fiction",
    "Historical Fiction"
  ],
  "author": "Charles A Cornell",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/24520928-crystal-night"
}