{
  "title": "Shades of Domination: Fifty by Fifty #2: Billionaire Romance Boxed Set",
  "description": "Fifty By Fifty: Fifty Novels by Fifty Bestselling Authors in four big boxed sets – look for the next one coming soon!We got you going with Volume 1, but now Volume 2 has arrived to turn up the heat.Let a whole new set of hot alpha males steam up your eReader. They will get what they want. Passionate, unrelenting, and insatiable, these men intend to do everything it takes to keep you coming back for more.So pour a glass of wine and cuddle up with this box set. The door to the helicopter is open, and that goddess inside you is saying YES!What’s inside:Cat Haus (Part 1 - Billionaire Bad Boys) by Cat JohnsonHe's a billionaire. She's a hooker. Things are bound to get interesting.The Billionaire's Son by Arabella QuinnJulia stumbles into a world of secrets, powerful billionaires, danger and clandestine sex clubs.Club Soria by Emilia KincadeMaya's life is falling apart. She retreats to Thailand, where she meets a dashing and dominating reclusive billionaire...The Billionaire's Contract (The His Submissive Series, Part One-Part Four) by Ava ClaireLeila Montgomery just landed her dream job. The catch? Her sexy billionaire boss is looking for a personal assistant...and his private submissive.Sex Research (BDSM Billionaire Romance) by Skye EagledayWhen Shauna’s Professor violates research ethics by urging her to become his submissive—will the virgin Shauna risk her future by answering her own questions about sex by crossing this forbidden line?The Vigilante's Lover by Annie WintersA small-town girl is mistaken for a spy and kidnapped by the dark knight of a Vigilante underground.My Rockstar Billionaire by Amy AdayA curvy girl trying to get over a breakup, while in a tropical paradise meets a hot mysterious stranger who has secrets. Dark Velvet by Lisa CarlisleAttraction turns dangerous when the poet discovers the sculptor's dark secret.The CEO and the Girl from the Coffee Shop by Terry TowersWhat happens in Vegas stays in Vegas, right? Not always…Letters of Intent by Angelica Boone and Hayden VossMysterious admirer jeopardizes Abigail's future with the firm, but maybe that's what she needs. A Beautiful & Dark Obsession by Anna AntoniaSophia Carter has loved Alexander Monroe Draven II since she was a girl, but he became an obsession too dangerous to keep. Now he's back.Unwillingly Yours & Meant to Be Yours by Marian TeeBoring nerdy college student Jaike's accepted the inevitable: she's destined to belong to Greek heir Dom Derek Christopoulos, but will she be his only Sub?",
  "genres": [
    "BDSM",
    "Erotica",
    "Anthologies",
    "Romance"
  ],
  "author": "Annie Winters",
  "average_rating": "4.08",
  "url": "https://www.goodreads.com/book/show/24531486-shades-of-domination"
}