{
  "title": "President Lincoln: The Duty of a Statesman",
  "description": "The American president has come to be the most powerful figure in the world—and back in the nineteenth century a great man held that office. William Lee Miller’s new book closely examines that great man in that hugely important Abraham Lincoln as president.Wars waged by American presidents have come to be pivotal historical events. Here Miller analyzes the commander in chief who coped with the profound moral dilemmas of America’s bloodiest war.In his acclaimed book Lincoln’s Virtues (“A fascinating account, sensitively written, rich in insight” —Arthur Schlesinger, Jr.), Miller explored Abraham Lincoln’s intellectual and moral development. Now he completes his “ethical biography,” showing the amiable and inexperienced backcountry politician transformed by constitutional alchemy into an oath-bound head of state, slapped in the face from the first minute of his presidency by decisions of the utmost gravity and confronted by the radical moral contradiction left by the nation’s universal ideals of Equality and Liberty and the monstrous injustice of human slavery.With wit and penetrating sensitivity, Miller shows us a Lincoln with unusual intellectual power, as he brings together the great themes that will be his legend—preserving the United States of America while ending the odious institution that corrupted the nation’s meaning. Miller finds in this superb politician a remarkable presidential an indomitable resolve, combined with the judgment that keeps it from being mindless stubbornness; and a supreme magnanimity, combined with the discriminating judgment that keeps it from being sentimentality. Here is the realistic war leader persisting after multiple defeats, pressing his generals to take the battle to the enemy, insisting that the objective was the destruction of Lee’s army and not the capture of territory, saying that breath alone kills no rebels, remarking that he regretted war does not admit of holy days, asking whether one could believe that he would strike lighter blows rather than heavier ones, or leave any card unplayed. And here is the pardoner, finding every excuse to keep from shooting the simple soldier boy who deserts. Here too is the eloquent leader who describes the national task in matchless prose, and who rises above vindictiveness and triumphalism as he guides the nation to a new birth of freedom.",
  "genres": [
    "History",
    "Biography",
    "Civil War",
    "Politics",
    "Nonfiction",
    "Presidents",
    "American History"
  ],
  "author": "William Lee Miller",
  "average_rating": "4.25",
  "url": "https://www.goodreads.com/book/show/2453730.President_Lincoln"
}