{
  "title": "Lost in Shangri-la",
  "description": "On May 13, 1945, twenty-four American servicemen and WACs boarded a transport plane for a sightseeing trip over Shangri-La, a beautiful and mysterious valley deep within the jungle-covered mountains of Dutch New Guinea. Unlike the peaceful Tibetan monks of James Hilton's bestselling novel Lost Horizon, this Shangri-La was home to spear-carrying tribesmen, warriors rumored to be cannibals. But the pleasure tour became an unforgettable battle for survival when the plane crashed.Miraculously, three passengers pulled through. Margaret Hastings, barefoot and burned, had no choice but to wear her dead best friend's shoes. John McCollom, grieving the death of his twin brother also aboard the plane, masked his grief with stoicism. Kenneth Decker, too, was severely burned and suffered a gaping head wound.Emotionally devastated, badly injured, and vulnerable to the hidden dangers of the jungle, the trio faced certain death unless they left the crash site. Caught between man-eating headhunters and enemy Japanese, the wounded passengers endured a harrowing hike down the mountainside--a journey into the unknown that would lead them straight into a primitive tribe of superstitious natives who had never before seen a white man or woman.Drawn from interviews, declassified U.S. Army documents, personal photos and mementos, a survivor's diary, a rescuer's journal, and original film footage, Lost in Shangri-La recounts this incredible true-life adventure for the first time. Mitchell Zuckoff reveals how the determined trio--dehydrated, sick, and in pain--traversed the dense jungle to find help; how a brave band of paratroopers risked their own lives to save the survivors; and how a cowboy colonel attempted a previously untested rescue mission to get them out.By trekking into the New Guinea jungle, visiting remote villages, and rediscovering the crash site, Zuckoff also captures the contemporary natives#146; remembrances of the long-ago day when strange creatures fell from the sky. A riveting work of narrative nonfiction that vividly brings to life an odyssey at times terrifying, enlightening, and comic, Lost in Shangri-La is a thrill ride from beginning to end.",
  "genres": [
    "Nonfiction",
    "History",
    "World War II",
    "War",
    "Adventure",
    "Survival",
    "Military Fiction"
  ],
  "author": "Mitchell Zuckoff",
  "average_rating": "3.87",
  "url": "https://www.goodreads.com/book/show/10163036-lost-in-shangri-la"
}