{
  "title": "Levenshonger",
  "description": "Ο Ανρί Τρουαγιά γεννήθηκε στη Μόσχα το 1911 και εγκαταστάθηκε στο Παρίσι το 1920. Έπειτα από λίγα χρόνια αρχίζει μια ανοδική λογοτεχνική σταδιοδρομία, με μια σειρά από μυθιστορήματα-ποτάμια και ψυχαναλυτικές βιογραφίες. «Το φως των δικαίων», «Η σπορά και ο θερισμός», «Όσο θα υπάρχει η γη¨, «Ντοστογιέφσκι, Πούσκιν, Λέρμοντοφ»… Το 1938 του απονέμεται το βραβείο Γκονκούρ και το 1959 εισέρχεται στη Γαλλική Ακαδημία. Ο Ανρί Τρουαγιά θεωρείται από τους πιο σημαντικούς σύγχρονους μυθιστοριογράφους. Το ύφος του είναι θαυμάσιο, οι σκέψεις του διαυγείς σαν κρύσταλλο, οι λεπτότατες αναλύσεις του γεμάτες από τρυφερότητα και ανάλαφρη ειρωνεία. Έχει μεγάλες συνθετικές ικανότητες και κατορθώνει –όπως η μεγάλη γενιά των γάλλων και ρώσων μυθιστοριογράφων που αποτελούν τους κοινούς προγόνους του– να συνθέτει μεγάλους πίνακες ζωής από τα καθημερινά μικρά και ασήμαντα γεγονότα. Η μυθιστορηματική τριλογία «Οικογένεια Ηνγκλετιερ» είναι ασφαλώς ένα από τα καλύτερα έργα του, Αυτός είναι ο Β΄ τόμος της τριλογίας.Από τις πρώτες κουβέντες ο Αλεξάντερ Κοζλώφ κατάλαβε πως η παρτίδα θα ήταν πιο διασκεδαστική ακόμα κι από όσο είχε προβλέψει. Και μόνο το γεγονός ότι ήταν θρονιασμένος σ’ αυτό το σαλόνι, αντίκρυ σε αυθεντικούς γονείς, που ενδιαφέρονταν για το μέλλον της κόρης τους, τον γέμιζε άνεση. Καθισμένη, όχι μακριά του, η Φρανσουάζ παρακολουθούσε αυτή τη σημαντική συζήτηση με αγωνία που δεν κατάφερνε να κρύψει. Τη λυπήθηκε και της έριξε μια ματιά που την άρπαξε κλεφτά μ’ ευγνωμοσύνη. Πίσω της υπήρχε ένας τοίχος ροζ, ένας σκούρος πίνακας ζωγραφικής, μια λάμπα με αμπαζούρ στο χρ΄μα της μπανάνας και όλα λούζονταν σε μια γλυκιά ανταύγεια, ακαδημαϊκή, επίσημη, αποκαρδιωτική σε μέτρο και γούστο. Είχαν σερβίρει ουίσκι Βέβαια! Η σαμπάνια θα ήταν γι’ αργότερα, όταν θα ένιωθαν πραγματικά οικογενειακώς μαζί του, όταν θα μπορούσαν να τον συγχαρούν και να συγχαρούν και τον εαυτό τους!",
  "genres": [
    "Fiction",
    "France",
    "Classics",
    "French Literature"
  ],
  "author": "Henri Troyat",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/24539299-levenshonger"
}