{
  "title": "The Deep Space Collection",
  "description": "Amazon is now offering a collection of the best science fiction by the author of the bestselling Mystic Saga for a very affordable price. You’ll get three short tales of sci-fi adventure, each story being over a hundred pages in length.In Dominion, one man is going to bring the furthest reaches of the galaxy within the grasp of mankind. Meriwether Hawke has created a vehicle that folds space, changing the whole perspective of the space program in an instant. Unfortunately for Hawke, the first manned test vehicle doesn’t end up where it’s supposed to. Lost and without sufficient life support, the two-person crew must engage the automated distress beacon and then settle in for a deep cryogenic sleep to await potential rescue. When Hawke is revived from cryosleep by an alien species, he quickly discovers that he is both their honored guest and guarded prisoner at the same time. It’s no secret that they are extremely interested in his ancient dead spacecraft and its method of propulsion. While he may not be aware of how much time has passed, two things become evident to The alien species are sworn enemies of his people, and humanity has become both more and less technologically advanced in the years that have passed. Hawke may hold the only key to the rescue of a forgotten human colony. In Vestige, we find that somewhere amidst the buried ruins of an ancient alien civilization lies the answer to one of the greatest mysteries in our galaxy. But researching the desolate planet brings about more questions than it could ever hope to answer. And those questions need answered soon if Landon is to find out who just declared war on the people of Earth. Landon is the sole operator of the Tachyon Relay – an outpost that serves as an interchange point for wormhole transit throughout the galaxy. When some mysterious ships start attacking Earth’s outposts, Landon is forced to watch helplessly as the wormholes begin to collapse, severing the links to these colonized systems. When Landon’s post is ultimately attacked, his only mode of escape is to slip aboard a vessel heading toward an abandoned system. Much to his surprise, the system had not been abandoned at all and was now home to a settlement that had been excavating alien ruins for the past decade. The ancient civilization, he quickly learns, may somehow be closely related to the unidentified ships that have declared war on Earth. He may have to risk more than just his own life in order to get the answers he needs and put an end to the war.And finally, in Erinyes, a Universal Command Science Ship has just successfully jumped over 160,000 light years into the Large Magellanic Cloud, giving the ship and its crew the honor of being the first to travel to another galaxy. One of these crewmembers, Donovan Rost, was recently presented with an honorary commission as an Ensign in the Universal Command. It appears that the only thing he did to earn such a commission was a simple act of surviving a long time in cryostasis… a very, very long time. Donovan came from a 21st century Earth - an Earth that used to be dominated by humanity. Now, man is a minority and all that he knew of his civilization is buried and almost completely forgotten. He’s about to learn why he and five others were revived and why they were now searching the Large Magellanic Cloud for a technological race that the crew is certain exists somewhere in that galaxy.Brought to you by the international bestselling author of the Mystic Saga and Ghosts of Ophidian. With over 250,000 books downloaded worldwide, Scott McElhaney continues to prove that reasonable Kindle prices do not have to mean poor quality.",
  "genres": [],
  "author": "Scott McElhaney",
  "average_rating": "4.32",
  "url": "https://www.goodreads.com/book/show/24556473-the-deep-space-collection"
}