{
  "title": "Age, Sex, Location",
  "description": "A hilarious and refreshingly honest foray into modern dating, Age, Sex, Location is Bridget Jones's Diary for HBO's Girls generation.\n\nThe last thing twenty-eight-year-old Lauren is looking for is love, so why do the men she's dating assume she's searching for The One?\n\nWith men running for the hills, Lauren takes drastic action and turns her love life into an experiment, vowing to follow the advice of a different dating guide every month.\n\nFrom releasing her inner siren to swearing off sex completely, Lauren will follow The Rules and play The Game, all with the help of her disapproving best friend and her newly loved-up housemate.\n\nBut as she searches for the holy grail of no-strings sex minus the heartache, Lauren soon realizes that dating is more complicated than just swiping right - and that the things you run from tend to always catch up with you...\n\nPraise for Age, Sex Location:\n\n'Great fun - a gripping read and very touching' Marian Keyes\n\n'So smart and sassy but with a great big heart, too. You'll go through this book as quickly as Lauren \"swipes left\" on her iPhone' - Naomi Wood, author of Mrs Hemingway \n\n'Funny, fresh, sassy and totally captures the dating zeitgeist. If you loved Girls, you'll love this!' - Katy Regan, author of The Story of You\n\n\n'With some brilliant one-liners, great dialogue and a main character you want to go out drinking with - this book was a winning combination for me. If you like your chick-lit edgy, cool and genuinely funny then look no further.' - Rosie Blake, author of How to Get a (Love) Life \n\n'Honest, funny and cringingly relatable' Glamour\n\n\n'Funny and honest this is a refreshing look at the modern dating scene' Essentials \n\n'Laugh-out-loud funny' Elle\n\nMelissa grew up in a small town in Massachusetts in a house without cable and therefore much of her childhood was spent watching 1970s British comedy on public television. At twenty-two, she made the move to London and has lived there happily for ten years, though has sadly never come across the Ministry of Funny Walks. Before meeting her fiance, she spent much of her time trawling the London dating scene for clean, non-sociopathic sexual partners and blogging about it, which became the inspiration for her first novel. These days, she spends much of her time reading in the various pubs of Stoke Newington and engaging in a long-standing emotional feud with their disgruntled cat, Welles. She works in publishing.",
  "genres": [
    "Romance",
    "Chick Lit",
    "Fiction",
    "Contemporary",
    "Audiobook",
    "Humor",
    "Adult"
  ],
  "author": "Melissa Pimentel",
  "average_rating": "3.30",
  "url": "https://www.goodreads.com/book/show/24552420-age-sex-location"
}