{
  "title": "Electric Armageddon: Civil-Military Preparedness For An Electromagnetic Pulse Catastrophe",
  "description": "Imagine an America in a permanent blackout, without electric power, without communications, without mass transportation, without banking and finance, without food and water. Imagine the machinery of modern civilization stopped--in an instant. Imagine the high-tech EMP threat killing millions of people the old fashioned way, through chaos, starvation, disease, and societal collapse. Sound impossible? The EMP threat is as real as the nuclear weapons programs of Iran, North Korea, China and Russia. More fantastic still, imagine that Mother Nature can make an EMP that would collapse the machinery of modern civilization everywhere on planet Earth. Imagine that the Sun can make something like an electrical hurricane in space--that we shall call a great geomagnetic storm--that would destroy electronic systems and collapse critical infrastructures everywhere. Imagine that great geomagnetic storms occur about once every century. Imagine that the last great geomagnetic storm was in 1859, before civilization became dependent upon electricity. Imagine that our modern electrified societies are now overdue to experience a natural EMP catastrophe. Incredible? It is all true, and as real as the Sun. Most fantastic of all, imagine that the technology to protect civilization against the nuclear and natural EMP threat is well understood and has been at hand for decades. Imagine that preparedness of the United States to survive and recover from EMP would also mitigate the effects of all other hazards, including cyber attacks, sabotage, hurricanes and earthquakes. Imagine that the cost of protecting the national electric grid from EMP is well within the nation's means and resources. Imagine that saving our power grid and thus the lives of 200 million Americans, who would perish in an EMP event today, at the cost of about a dollar per life. Now imagine that in the U.S. Congress, Democrats and Republicans alike have been trying to protect the United States from EMP for years. Imagine that this bipartisan, unanimous effort to protect Americans from EMP has been thwarted by lawyers in the government bureaucracies and the electric power industry. A paranoid fantasy? It is all true, as real as Washington bureaucrats and K Street lobbyists. This book tells well the story of the EMP threat and of the struggle to protect our nation from this little known, but most perilous and most imminent of all national security nightmares. However, the greatest value of this book is a bold new vision for a way to rapidly protect America from EMP. Every century or so a seminal book, such as Carl von Clausewitz's \"On War\" or Alfred Thayer Mahan's \"Sea Power\" revolutionizes the way people think about national security. This could be another such book--if only it is read. But beyond improved national security, this book's prescriptions hold the promise of an improved America, where national preparedness necessitates renewing in our citizens the fading virtues of self-sufficiency and rugged individualism that made America great, and free.",
  "genres": [],
  "author": "Peter Vincent Pry",
  "average_rating": "4.67",
  "url": "https://www.goodreads.com/book/show/24547273-electric-armageddon"
}