{
  "title": "C. J. Sansom: The Collection",
  "description": "The first three Matthew Shardlake novels from master storyteller, and number one bestselling author, C. J. Sansom. Set in Tudor London and combining engrossing historical detail with first-rate murder mystery, this three book collection Dissolution, Dark Fire and Sovereign. Dissolution Henry VIII has proclaimed himself Supreme Head of the Church and the country is waking up to savage new laws, rigged trials and the greatest network of informers ever seen. Under the order of Thomas Cromwell, a team of commissioners is sent through the country to investigate the monasteries. There can only be one the monasteries are to be dissolved. But on the Sussex coast, at the monastery of Scarnsea, events have spiralled out of control. Cromwell's Commissioner Robin Singleton, has been found dead, his head severed from his body. His horrific murder is accompanied by equally sinister acts of sacrilege - a black cockerel sacrificed on the alter, and the disappearance of Scarnsea's Great Relic. Dr Matthew Shardlake, lawyer and long-time supporter of Reform, has been sent by Cromwell into this atmosphere of treachery and death. But Shardlake's investigation soon forces him to question everything he hears, and everything that he intrinsically believes . . . Dark Fire It is 1540 and the hottest summer of the sixteenth century. Matthew Shardlake, believing himself out of favour with Thomas Cromwell, is busy trying to maintain his legal practice and keep a low profile. But his involvement with a murder case, defending a girl accused of brutally murdering her young cousin, brings him once again into contact with the king's chief minister - and a new assignment . . . The secret of Greek Fire, the legendary substance with which the Byzantines destroyed the Arab navies, has been lost for centuries. Now an official of the Court of Augmentations has discovered the formula in the library of a dissolved London monastery. When Shardlake is sent to recover it, he finds the official and his alchemist brother brutally murdered - the formula has disappeared. Sovereign Autumn, 1541. King Henry VIII has set out on a spectacular Progress to the North to attend an extravagant submission of his rebellious subjects in York. Already in the city are lawyer Matthew Shardlake and his assistant Jack Barak. As well as assisting with legal work processing petitions to the King, Shardlake has reluctantly undertaken a special mission - to ensure the welfare of an important but dangerous conspirator being returned to London for interrogation. But the murder of a local glazier involves Shardlake in deeper mysteries, connected not only to the prisoner in York Castle but to the royal family itself. And when Shardlake and Barak stumble upon a cache of secret papers which could threaten the Tudor throne, a chain of events unfolds that will lead Shardlake facing the most terrifying fate of the age . . .",
  "genres": [
    "Historical Fiction"
  ],
  "author": "C.J. Sansom",
  "average_rating": "4.61",
  "url": "https://www.goodreads.com/book/show/24549641-c-j-sansom"
}