{
  "title": "A Darkness Forged in Fire",
  "description": "We do not fear the flame, though it burns us,We do not fear the fire, though it consumes us,And we do not fear its light,Though it reveals the darkness of our souls,For therein lies our power. -- Blood Oath of the Iron ElvesFirst in a stunning debut series, A Darkness Forged in Fire introduces an unforgiving world of musket and cannon...bow and arrow...magic, diplomacy, and oaths -- each wielding terrible power in an Empire teetering on the brink of war.In this world, Konowa Swift Dragon, former commander of the Empire's elite Iron Elves, is looked upon as anything but ordinary. He's murdered a Viceroy, been court-martialed, seen his beloved regiment disbanded, and finally been banished in disgrace to the one place he despises the most -- the forest.Now, all he wants is to be left alone with his misery...but for Konowa, nothing is ever that simple. The mysterious and alluring Visyna Tekoy, the highborn daughter of an elfkynan governor, seeks him out in the dangerous wild with a royal decree that he resume his commission as an officer in Her Majesty's Imperial Army, effective immediately.For in the east, a falling Red Star heralds the return of a magic long vanished from the earth. Rebellion grows within the Empire as a frantic race to reach the Star unfolds. It is a chance for Konowa to redeem himself -- even if the entire affair appears doomed to be a suicide mission...and that the soldiers recruited for the task are not at all what he expects. And worse, his key adversary in the perilous race for the Star is the dreaded Shadow Monarch -- a legendary elf-witch whose machinations for absolute domination spread deeper than Konowa could ever imagine....",
  "genres": [
    "Fantasy",
    "Fiction",
    "Epic Fantasy",
    "High Fantasy",
    "Magic",
    "Adult",
    "Elves"
  ],
  "author": "Chris  Evans",
  "average_rating": "3.51",
  "url": "https://www.goodreads.com/book/show/2457253.A_Darkness_Forged_in_Fire"
}