{
  "title": "What Lies Behind",
  "description": "\"WHAT LIES BEHIND grabs you by the throat and doesn't let go. Ellison is a great talent—enjoy.\" —Catherine Coulter, # 1 New York Times bestselling authorCritically acclaimed \nNew York Times\n bestselling author J. T. Ellison delivers another riveting novel featuring the incomparable Dr. Samantha Owens Waking to sirens in the night is hardly unusual for Samantha Owens. No longer a medical examiner, she doesn't lose sleep over them, but a routine police investigation in her neighborhood has her curious. When her homicide detective friend, Darren Fletcher, invites her to look over the evidence, she jumps at the chance and immediately realizes the crime scene has been staged. What seems to be a clear case of murder/suicide—a crime of passion—is anything but. The discovery of toxic substances in hidden vials indicates that something much more sinister is at play… As Fletch and Sam try to understand what and who they are dealing with, they are summoned to a meeting at the State Department. High-level officials are interested in what they know and seem to be keeping secrets of their own. It's up to Sam and Fletch to uncover what lies behind the deception as the threat of bioterrorism is exposed, and her boyfriend, Xander Whitfield, may be in the line of fire. Unsure who to trust, Sam and Fletch find themselves up against very powerful people at every stage in the investigation. No one is who they appear to be and with every minute that passes, the danger escalates. It's Sam's most complex case yet and the terrifying reality is beyond anything she could have imagined.More Praise\"Shocking suspense, compelling characters and fascinating forensic details.\" —Lisa Gardner, # 1 New York Times bestselling author\"A terrific thriller…fans of forensic mysteries, such as those by Patricia Cornwell, should immediately add this series to their A-lists.\" —Booklist",
  "genres": [
    "Mystery",
    "Mystery Thriller",
    "Thriller",
    "Fiction",
    "Suspense",
    "Romantic Suspense",
    "Audiobook"
  ],
  "author": "J.T. Ellison",
  "average_rating": "4.10",
  "url": "https://www.goodreads.com/book/show/24570455-what-lies-behind"
}