{
  "title": "Uncharted Territory",
  "description": "A Five-Star Rated Mystery!Grab a latté, a box of Kleenex and a clean pair of panties. Carolyn Ridder Aspenson has done it again.–Lynn/Two Girls & a BookSuburban housewife Angela Panther didn’t want to communicate with the dead, but the universe had other plans…When an unidentified fourteen-year-old boy takes a dive off an interstate overpass, to solve the case, Atlanta area detective Aaron Banner calls on some unlikely help–from psychic medium Angela Panther. Banner knows she’s legit, and knows she’ll get to the truth about his junior John Doe–was the boy’s death suicide, or murder? The problem is, the spirit can’t remember who he was or the night he died, and to make matters worse, he doesn’t care. Instead, he convinces Angela to focus on another spirit, one different from Angela’s usual, garden-variety ghost.To complicate matters, Angela’s best friend Mel, newly single and on the prowl, has her sights set on the sexy Detective Banner, and Angela’s mother drives her even more crazy dead than alive.To solve the dead duo’s dilemmas, armed with little more than their double lattés and a tiny pink bottle of wannabe pepper spray, Angela and her sex-starved sidekick Mel must venture into the dark underbelly of Atlanta and come face-to-face with a gang of saggy-pantsed hoodlums ready to take them out. Will they make it out alive, or end up pushing up daisies alongside the spirits they’re trying to help?In UNCHARTED TERRITORY, AN ANGELA PANTHER MYSTERY, Carolyn Ridder Aspenson’s witty dialog between psychic medium Angela Panther and her best friend, Mel will keep you laughing out loud, while the tear-jerking scenes between the living and dead will leave you hoping the connection with those we love is never lost.",
  "genres": [
    "Mystery",
    "Paranormal",
    "Fantasy",
    "Cozy Mystery",
    "Cozy",
    "Humor",
    "Amazon"
  ],
  "author": "Carolyn Ridder Aspenson",
  "average_rating": "4.44",
  "url": "https://www.goodreads.com/book/show/24570900-uncharted-territory"
}