{
  "title": "The Line Between",
  "description": "There’s a fine line between love and hate, so fine that you don’t know you’ve lost balance until it’s too late. I’m not sure exactly when I lost my balance, all I know is that he was to blame. Dane Winters. The boy who’d spent most of his life hating me for reasons I never understood.  ** ** ** ** ** **  It was no secret that I hated her, but only I knew why. She was off-limits. And then our separate worlds collided with one tragedy. It wasn’t her fault, I knew that, but I wanted her to hurt the way I did, and I needed someone to blame. She was an easy target. Kennedy Monroe. The girl I’d picked on all our lives. And the woman I barely tolerated. Until the line between love and hate was no longer visible…  *New Adult Contemporary Romance* *Due to mature content this book is not suitable for readers younger than 18*  What people are saying....  “I love how Tamsyn approached a love story from a whole different point of view. Absolutely brilliant!!” -Written by Jessica S for Summer's Book Blog.  “Throughout the story your emotions are going back and forth and back and forth and that is the brilliance of Tamsyn's writing and why I love her books.” - Krista Gervais, Goodreads Reviewer  “Well written, HIGHLY emotional and SUPER steamy.” – Sheryl, Goodreads Reviewer.  “This story was kind of a Romeo and Juliet type story with an edge and a lot of steam.” – Mandy, Goodreads Reviewer.  “This was my very first Tamsyn Bester experience and it will not be my last. Hit me woman! I want more!!” – Romance Bytes Book Blog  “This book was a fantastic read! From start to finish I was absolutely sucked into this story and wasn’t able to put it down! This is a book I wouldn’t hesitate to read again and recommend to my friends! Tamsyn does an amazing job of bringing out your feelings during this story.” - Devilishly Delicious Book Reviews  “It is amazing. Well written. Beautiful love story.” - Amber Eckstein, Goodreads Reviewer.  “Splashed with passion, filled with pain and covered with love.” – Scandalous Book Blog",
  "genres": [
    "New Adult",
    "Romance",
    "College",
    "Enemies To Lovers",
    "Contemporary Romance",
    "Contemporary",
    "Young Adult"
  ],
  "author": "Tamsyn Bester",
  "average_rating": "3.90",
  "url": "https://www.goodreads.com/book/show/24568388-the-line-between"
}