{
  "title": "Overcoming Secondary Stress in Medical and Nursing Practice: A Guide to Professional Resilience and Personal Well-Being",
  "description": "Physicians, nurses, and allied health professionals working in today's health care settings must be prepared to offer support in dangerous times despite staffing shortages, financial pressures, and complex legal requirements. Overcoming Stress in Medical and Nursing A Guide toProfessional Resilience and Personal Well-Being is a concise guide for all medical professionals who face these demands. This · Provides critical information about the dangers of compassion fatigue/burnout and vicarious post-traumatic stress disorder in health care settings · Introduces anewly-developed \"Medical-Nursing Professional Secondary Stress Self-Awareness Questionnaire\" that can be profitably self-administered at each phase of one's career and reflected upon in private, with one's mentor, or in a small group setting · Includes a unique section on strengthening one's innerlife through the use of three core spiritual wisdom approaches drawn from a world religion perspective · Provides a description of four types of \"voices\" one needs to have in one's circle of friends to ensure that balance, perspective, growth, and challenge are fostered in one's personal andprofessional life · Describes how physicians, nurses, and allied health professionals can formulate a personally-designed self-care protocol for themselves Lastly, this book offers an extensive and up-to date bibliography of recent research, clinical papers, and books on medical-nursing practice andsecondary stress. Overcoming Stress in Medical and Nursing Practice is an indispensable resource for medical and nursing professionals, students, and the counselors and therapists who work with them.",
  "genres": [
    "Medical"
  ],
  "author": "Robert J. Wicks",
  "average_rating": "3.83",
  "url": "https://www.goodreads.com/book/show/2458666.Overcoming_Secondary_Stress_in_Medical_and_Nursing_Practice"
}