{
  "title": "Hollywood Confessions",
  "description": "From #1 Amazon, New York Times & USA Today Bestselling author Gemma Halliday comes a dead Hollywood producer, a slew of reality show contestants with juicy motives, and one tabloid reporter determined to get the truth! Allie Quick has high aspirations—much higher than reporting on the latest celebrity gossip for the L.A. Informer, Hollywood's most notorious tabloid. But if she's going to join the ranks of the real reporters, she's going to need a headline worthy story under her belt. Which is just what she gets when the producer of the trashiest reality shows on TV winds up murdered, and Allie convinces her editor, Felix Dunn (from the High Heels Mysteries), that this story has her name written all over it. Between an aging dance-off judge, a family with sextuplets and triplets, and the star of a little person dating show, Allie has no shortage of reality stars to question. But when she finds herself falling for her prime suspect, Allie's relationship with her editor is suddenly on the rocks, and her life is in danger. This is one deadline Allie can't afford to miss!What critics are \"The latest in the Hollywood Headlines series is 320 pages of pure fun. Halliday has created yet another laugh-out-loud whodunit. She breathes life into her mystery with a rich cast of vivid, pulp-fiction type characters and a heroine worth rooting for. 4 1/2 stars!\"~ RT Book Reviews \"Gemma Halliday's witty, entertaining writing style shines through in her new book! I look forward to seeing lots more of Tina as this series continues. A fun read!\"~ Fresh Fiction\"Halliday writes the kind of books that just make you smile and put you in a great mood. They're just so enjoyable and I would without a doubt recommend this book to romance and mystery readers alike.\"~ Enchanted By Books \"Very well written with smart and funny dialogue. It is a well-paced story that is thoroughly enjoyable with a mystery, a little romance, and a lot of laughs. Readers are sure to enjoy this delightful tale which is highly recommended.\"~ Romance Reviews Today",
  "genres": [
    "Mystery",
    "Chick Lit",
    "Romance",
    "Fiction",
    "Contemporary",
    "Humor",
    "Romantic Suspense"
  ],
  "author": "Gemma Halliday",
  "average_rating": "3.83",
  "url": "https://www.goodreads.com/book/show/11494141-hollywood-confessions"
}