{
  "title": "Outlaw Hearts",
  "description": "A decades long love story of two people, united by chance, that proves love's lasting power and its ability to overcome all oddsMiranda Hayes has lost everything-her family, her husband, her home. Orphaned and then widowed, desperate to find a safe haven, she sets out to cross a savage land alone...until chance brings her face-to-face with notorious gunslinger Jake Harkner.Hunted by the law and haunted by a brutal past, Jake has spent a lifetime fighting for everything he has. He's never known a moment's kindness...until fate brings him to the one woman willing to reach past his harsh exterior to the man inside. He would die for her. He would kill for her. He will do whatever it takes to keep her his.Spanning the dazzling West with its blazing deserts and booming gold towns, Jake and Miranda must struggle to endure every hardship that threatens to tear them apart. But the love of an outlaw comes with a price...and even their passion may not burn bright enough to conquer the coming darkness.An emotional saga from the \"QUEEN OF WESTERN HISTORICAL ROMANCE\" that will captivate fans of Debra Holland, Jodi Thomas, Diana Palmer, and Linda Lael Miller.The Outlaw Hearts  Outlaw Hearts (Book 1)  Do Not Forsake Me (Book 2) Love's Sweet Revenge (Book 3 coming September 2016)What readers are saying about Outlaw Hearts\"Outlaw Hearts is a saga romance that will enthrall you from the first page, a love story that is majestic in its telling of it.\"\"This was the best western romance I have ever read by one of the greatest authors I truly enjoy.\"\"What I loved most was how this captivated me so much that I lost quite a few hours of sleep so I could read that one chapter.\"\"Jake and Miranda's love and courage remind us of what true devotion and love can conquer.\"What reviewers are saying about Outlaw Hearts\"This is a long, emotional, and adventurous love story about an outlaw who wants to be a better man for the beautiful and honest widow who is looking for a safe haven.\"-Fresh Fiction..\".an emotional roller coaster as I got to know the characters through their pasts, their present and as they looked toward their future.\"-Romance Junkies\"It was raw, gritty, all-consuming, and quite possibly one of the best books I'll ever read.\"\"Outlaw Hearts was a heart-breaking, toe-curling, action-packed story that stuck with me and I would recommend it to all romance readers who enjoy a comprehensive jaunt into the old west.\"What everyone is saying about RT Book Reviews Career Achievement Awardwinning and USA Today bestselling Author Rosanne \"Power, passion, tragedy, and triumph are Rosanne Bittner's hallmarks. Again and again, she brings readers to tears.\"\"The strong flavor of the Wild West combines with a beautiful love story, creating a true saga of the era.\"\"Ms. Bittner has a way of bringing the pages and characters to life which pulled me right in from page one and I hated having to put it down for even one second.\"\"If you like authentic American West romances with in depth characterizations Rosanne Bittner is your author.\"\"We are very lucky to be living during a time when the true Queen of Historical Romance...keeps delivering epic novels that are forever engraved in our hearts.\"\"",
  "genres": [
    "Historical Romance",
    "Romance",
    "Westerns",
    "Historical",
    "Historical Fiction",
    "Western Romance",
    "Western Historical Romance"
  ],
  "author": "Rosanne Bittner",
  "average_rating": "4.26",
  "url": "https://www.goodreads.com/book/show/24584514-outlaw-hearts"
}