{
  "title": "Injustices: The Supreme Court's History of Comforting the Comfortable and Afflicting the Afflicted",
  "description": "Few American institutions have inflicted greater suffering on ordinary people than the Supreme Court of the United States. Since its inception, the justices of the Supreme Court have shaped a nation where children toiled in coal mines, where Americans could be forced into camps because of their race, and where a woman could be sterilized against her will by state law. The Court was the midwife of Jim Crow, the right hand of union busters, and the dead hand of the Confederacy. Nor is the modern Court a vast improvement, with its incursions on voting rights and its willingness to place elections for sale.In this powerful indictment of a venerated institution, Ian Millhiser tells the history of the Supreme Court through the eyes of the everyday people who have suffered the most from it. America ratified three constitutional amendments to provide equal rights to freed slaves, but the justices spent thirty years largely dismantling these amendments. Then they spent the next forty years rewriting them into a shield for the wealthy and the powerful. In the Warren era and the few years following it, progressive justices restored the Constitution’s promises of equality, free speech, and fair justice for the accused. But, Millhiser contends, that was an historic accident. Indeed, if it weren’t for several unpredictable events, Brown v. Board of Education could have gone the other way.In Injustices, Millhiser argues that the Supreme Court has seized power for itself that rightfully belongs to the people’s elected representatives, and has bent the arc of American history away from justice.",
  "genres": [
    "History",
    "Politics",
    "Law",
    "Nonfiction",
    "Social Justice",
    "American",
    "American History"
  ],
  "author": "Ian Millhiser",
  "average_rating": "4.07",
  "url": "https://www.goodreads.com/book/show/24583622-injustices"
}