{
  "title": "Initiate of the New Bushido",
  "description": "In the year 2077, humanity flourishes once again. More than twenty years have passed since “the Collapse,” the complete breakdown of civilization triggered by the end of oil. Out of the wars and famines of the Collapse, new societies have arisen. Based on the principles of efficiency and frugality, these societies cannot squander resources. Gone are the days of wastefulness and sloth.  People have created the “New Bushido” to enforce the discipline necessary to life in a world without cheap energy. Based on the Samurai code of feudal Japan, the laws of the New Bushido require absolute loyalty to one’s company and one’s CEO. When an employee accepts a job with a company, he swears that he will defend it with his life. Hostile acquisitions are accomplished through duels, and swords are the weapon of choice. Honor is all-important. It must be defended at all costs. Jon Benten is a young executive at Avant Computers, a tech company in the country of Socalle. He is a hard worker and a gifted fighter. He has the potential to take over companies, to form an empire. However, someone is determined to make sure Jon does not fulfill his potential. Jon finds himself framed for the most heinous crime possible – corporate treason. Jon’s secret enemy has made him look guilty as hell of stealing company secrets and giving them to the competition. If Jon’s CEO finds him guilty of this crime, he will pay with his life.  Time is running out. Jon must clear his name. With the help of his girlfriend, a brilliant doctor named Whitney Graelock, Jon must find the real traitor and prove his innocence before those who wish him dead find a way to accomplish their mission. His adventure takes him through strange lands, from the “Chumash Nation,” where white men are not welcome, to the radioactive wasteland which was once Los Angles. He gathers information from unlikely sources along the way, bringing him ever closer to proving his innocence.  CEO Volume I – Initiate of the New Bushido is part science fiction, part adventure and part mystery. Action is nonstop. Readers will cheer for Jon as he lays the foundations for the great life he will lead in future volumes.",
  "genres": [],
  "author": "J. Forbes Black",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/24595282-initiate-of-the-new-bushido"
}