{
  "title": "The Emperor of Lies",
  "description": "In February 1940, the Nazis established what would become the second-largest Jewish ghetto, in the Polish city of Lódz. The leader they appointed was Mordechai Chaim Rumkowski, a sixty-three-year-old Jewish businessman and orphanage director—and the elusive, authoritarian power sustaining the ghetto’s very existence.A haunting, profound and challenging novel, The Emperor of Lies chronicles the tale of Rumkowski’s monarchical rule over a quarter-million Jews for the next four and a half years. Driven by a titanic ambition, he sought to transform the ghetto into a productive industrial complex and strove to make it—and himself—indispensable to the Nazi regime. These compromises would have extraordinary consequences not only for Rumkowski but for everyone living in the ghetto. Drawing on the detailed records of life in Lódz, Steve Sem-Sandberg, in a masterful feat of literary imagination and empathy, captures the full panorama of human resilience and probes deeply into the nature of evil. Through the dramatic narrative, he asks the most difficult questions: Was Rumkowski a ruthless opportunist, an accessory to the Nazi regime motivated by a lust for power? Or was he a pragmatist who managed to save Jewish lives through his collaboration policies? How did the inhabitants of the ghetto survive in such extreme circumstances?A critically acclaimed breakout bestseller in Sweden, The Emperor of Lies introduces a writer of great significance to American readers. The archives detail daily life in the Lodz ghetto, under the reign of Rumkowki, but it takes a writer with Sem-Sandberg’s singular talent to help us understand the truth of this chilling history.",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Holocaust",
    "War",
    "Poland",
    "Historical",
    "World War II"
  ],
  "author": "Steve Sem-Sandberg",
  "average_rating": "3.67",
  "url": "https://www.goodreads.com/book/show/11493696-the-emperor-of-lies"
}