{
  "title": "Rendezous with Destiny",
  "description": "October, 1941. Hitler’s troops are steadily storming across Europe, but in a small Michigan farming community, the war seems too far away to be taken seriously. It’s a source of conversation, not fear. A group of teenagers start a bonfire and celebrate life. As they fall in love and fall apart, they have no idea that the war is much closer than they think. That it lurks in the shadows, watching their every move.Theo and Rosika have been the best of friends for the last ten years, something they never expected to change. Through thick and thin, they have each other’s backs and never, ever keep secrets. Until now. He doesn’t know when or how it happened, but somewhere along the line, Theo fell in love with his best friend. If it were any other girl, Theo would tell her how he feels and let the chips fall where they may, but its Rosika. If he tells her what’s in his heart, he suspects she’ll panic and turn her back on him forever. It’s a risk Theo refuses to take. Her American friends might not take the war that’s destroying Europe seriously, but Rosika can’t stop thinking about it. She’s lived in America for most of her life, but she can’t forget she still has family living in Germany. Now, her mother has started to receive letters that make her question which country deserves her allegiance. Part of her wants to share her burden with Theo, but fear keeps her quiet. Theo and Rosika are determined to hold tight to their secrets, but it doesn’t take long to discover that hidden secrets have bad habit of surfacing and wreaking havoc.Rendezvous with Destiny is a World War II is set in Michigan, about six week before the bombing of Pearl Harbor. It’s a sweet romance between an American farm boy and a German immigrant who are about to find out just how dangerous love and secrets can be. This kisses only, rural romance is approximately 22,000 words.",
  "genres": [],
  "author": "Jess Schira",
  "average_rating": "3.90",
  "url": "https://www.goodreads.com/book/show/24580124-rendezous-with-destiny"
}