{
  "title": "Gig: Americans Talk About Their Jobs",
  "description": "More than 150 people in common and unusual occupations talk about their lives and work in the new economy, encompassing the human experience from a labor-support doula to a funeral home director.For the last several years, the editors of Word, the pioneering Web magazine, have been sending interviewers—nearly forty in all—across America to talk to people about their jobs. They wanted to document reality, not to advance any overarching thesis or political agenda. Their sole position on work was that it's a fascinating topic and an elemental part of nearly everyone's life. They were certainly not disappointed with what they found; this wide-ranging survey of the American economy at the turn of the millennium is stunning, surprising, and always entertaining. It gives us an unflinching view of the fabric of this country from the point of view of the people who keep it all moving.Recalling Studs Terkel's 1972 classic best-seller, Working, the more than 120 roughly textured monologues that make up Gig beautifully capture the voices of our fast-paced and diverse economy. The selections demonstrate how much our world has changed—and stayed the same—in the last three decades. If you think things have speeded up, become more complicated and more technological, you're right.But people's attitudes about their jobs, their hopes and goals and disappointments, endure. Gig's soul isn't sociological—it's emotional. The wholehearted diligence that people bring to their work is deeply, inexplicably moving. People speak in these pages of the constant and complex stresses nearly all of them confront on the job, but, nearly universally, they throw themselves without reservation into coping with them. Instead of resisting work, we seem to adapt to it. Some of us love our jobs, some of us don't, but almost all of us are not quite sure what we would do without one.With all the hallmarks of another classic on this subject, Gig is a fabulous read, filled with indelible voices from coast to coast. After hearing them, you'll never again feel quite the same about how we work.",
  "genres": [
    "Nonfiction",
    "Sociology",
    "Business",
    "Essays",
    "Labor",
    "Biography",
    "History"
  ],
  "author": "John Bowe",
  "average_rating": "4.13",
  "url": "https://www.goodreads.com/book/show/246041.Gig"
}