{
  "title": "Celebutantes",
  "description": "Prepare to enter a world of what fashion designer Michael Kors has called “stylish intrigue, glamorous machinations, and such juicy fun.”  Take a wild ride with Amanda Goldberg and Ruthanna Hopper, who have culled their insider’s purview to peel back Oscar’s legendary curtain and reveal what really goes on under the sheets of Young Hollywood. Do Happy Hollywood Endings really exist, or does everyone end up on the cutting room floor sooner or later?  It’s a shocking, entertaining race to the end of the red carpet…\nTwenty-six-year-old Lola Santisi, daughter of an Academy Award-winning mega-director and a former cover model, is Hollywood Royalty without a kingdom—or even a condo—to call her own.  This “Actorholic,” who also suffers from “Career Deficit Disorder,” is looking for more from life than what her famous last name has offered, namely her mother’s last-season Chanel hand-me-downs and the lurking shadow of her father’s fame. In her latest gig as a Hollywood ambassador, Lola’s stepping out of her Louboutins and into fashion’s ultimate combat boots to engage in LA's cruelest blood sport: convincing celebrities to wear an unknown designer's gowns to the Oscars. \nProviding advice, emotional support, and even a new mantra or two are her BFF (Best Friend Forever) Kate Woods, an obsessively ambitious talent agent desperate to go from unter to über, and her BAF (Best Actress Forever) Cricket Curtis, a struggling up-and-comer trying to surpass her role as a coma victim on Grey’s Anatomy and overcome one rejection after another to become the next Cameron Diaz or Nicole Kidman, or the next anybody.  Together, they dodge fashion roadkill while navigating General Motors’ Annual Fashion Show, the Gagosian dinner at Mr. Chow, and more.  Ultimately, the week culminates at the über-exclusive Vanity Fair Oscar party, where the allotted time slot on your invitation marks how far in or out you really are.  But who will be left standing with job, heart, and stilettos still intact at the after-after-Oscar party?",
  "genres": [
    "Chick Lit",
    "Fiction",
    "Contemporary",
    "Young Adult",
    "Audiobook",
    "Adult Fiction",
    "Adult"
  ],
  "author": "Amanda Goldberg",
  "average_rating": "2.95",
  "url": "https://www.goodreads.com/book/show/2460048.Celebutantes"
}