{
  "title": "The VIP Trilogy",
  "description": "Ysabelle They say in order to find yourself you have to go home, but what if home is what you’re escaping from. I went to Miami to discover myself; never in my wildest dreams, did I think home would become a three-letter word. VIP. I was the dream. I was the illusion. I was the fantasy. Until him… Everything went to hell in hand basket the moment we laid eyes on each other. I wanted him. He wanted me. Sebastian I have always been a man who made decisions based on other people’s feelings, wants, and desires. I was selfless. I never wanted to hurt anyone. Especially her. The moment I met her… I wanted her. I loved her. For the woman she was. For the woman she wanted to be. But most of all… For the woman she was, when she was with me. This isn’t a love story, but a story about love. Warning sex/drugs/language. Mature readers only.  <><><><><><><><>  The Madam:  Some people need love…  I need sex, money, control, and power.  Anyone could have those four things, but only one could have VIP. Becoming Madam was never a choice for me, it was a mandated order from the most powerful woman I knew- my mother. I was born to fill her shoes, never to make mistakes, or to show weakness.  You are the product of your environment. They say the apple doesn't fall far from the tree; you learn from what you see, not from what you're told. Nature vs. Nurture. I learned from it all; what I saw, what I didn't see, what I was told, and from reading between the lines.  I was raised with the belief that the world spun ONLY because of me. I held power as far back as I can remember, saw things no one ever talks about, and witnessed illegal acts of sex, drugs, and money by the time I was eighteen.  You saw a glimpse of me in VIP, now see it from the beginning. Enter my world where anything goes; no judgments, no remorse, no guilt. You play by my rules, or you don’t play at all. There are no limits to what I can do, or to what I can show you…I will ensure my legacy by any means necessary.  My name is Lilith Veronica Stone, and I am The Madam.  Warning: Book contains adult situations. Dark content/sex/drugs/language. Mature readers only.  <><><><><><><><>  MVP: Ysabelle I love you. Three words that can make or break you. I thought I needed to find myself. I thought I wasn’t happy. I thought I needed more out of life. I didn’t. I’m more lost now than I was when I left. I have no answers, just endless amounts of questions. It was only a matter of time until the truth came to light. I never imagined it would change my entire life and everything I thought to be true. It was all a game. Except I wasn’t a player. I was a pawn. Sebastian The end. Two words that have several meanings. I never thought I’d lose her. But did I ever really have her… Or did VIP? Can love conquer all? Warning: Book contains adult situations. Sex/language. Mature readers only.",
  "genres": [],
  "author": "M.  Robinson",
  "average_rating": "3.63",
  "url": "https://www.goodreads.com/book/show/24600181-the-vip-trilogy"
}