{
  "title": "Insomnia: A Cultural History",
  "description": "In today’s media-saturated and hyperconnected society, increasing numbers of people are finding it hard to switch off their overstimulated brains and escape the demands of daily life. We are becoming, it seems, a world of insomniacs. But this condition of perpetual unrest has plagued people for centuries. The roots and effects of insomnia are complex, Eluned Summers-Bremner reveals in this fascinating study, and humans have employed everything from art to science to understand, explain, and mitigate this problem. The author begins her exploration of sleeplessness with the literature of ancient times, finding its sufferers in such prominent texts as the Iliad , the Mesopotamian epic Gilgamesh , and the Bible. Insomnia continued to figure large in Romantic and Gothic literature, as the advent of street lighting in the nineteenth century inspired the fantastical blurring of daytime reality and night specters, and authors connected insomnia to the ephemeral worlds of nightmares and the sublime. Meanwhile, throughout the ages insomnia has been variously categorized by the medical community as a symptom of deeper in medieval and early modern times, for example, physicians and philosophers saw insomnia as a sign of lovesickness, melancholy, or even demonic possession. As modern medicine and science evolved, insomnia emerged as a distinct symptom of such ailments as post-traumatic stress disorder after war. Today’s medical solutions tend to involve prescription drugs, and Insomnia ultimately raises important questions about the role of the pharmaceutical industry and the effectiveness of such treatments. Bedside reading of the most useful sort, Insomnia won’t put you to sleep, but it will help you understand your problem and its surprisingly rich cultural legacy.",
  "genres": [
    "History",
    "Science",
    "Nonfiction"
  ],
  "author": "Eluned Summers-Bremner",
  "average_rating": "3.29",
  "url": "https://www.goodreads.com/book/show/2459739.Insomnia"
}