{
  "title": "Chapter 8: The Complete Series",
  "description": "Grace StreetReturn to Grace StreetRevised Edition.Possession. Obsession. Resilience. Insanity.A need for absolute control and a past filled with lies and neglect have led FBI profiler Victor Laurenzo down a ruthless path. On a quest to satiate his sadistic desires, he submits unknowing victims to cold, calculated scenarios meant to push limits while testing the confines of immorality—all under the guise of studying his chapters for the betterment of law enforcement.On the mend from a bad break-up and longing for attention, Elsa consents to an odd proposition. Initially unaware of Victor’s plans, she quickly realizes that the casual encounter she agreed to is, in fact, a cruel psychological game with no ending in sight. She may be one in a long line of test subjects for Victor; however, she can't be broken so easily. What he puts her through only fuels the fire burning within her—a flame that begins to blaze out of control as she becomes obsessed with everything about Victor and peeling back his cruel layers in search of the real man hiding beneath his heartless facade. Stronger and far more resilient than any of Victor's previous chapters, she is determined to make her own rules and flip the table on his selfish game to show him that beyond his darkness, there lies light.Playing an erotic and twisted psychological game in which there are no winners and only chapters in a depraved case file, these two headstrong characters are no match for an unexpected bond that rises above the darkness, bends the rules of conventional romance, compromises principles, and forgives the unforgivable.Though Victor and Elsa's story may not contain hearts and flowers, it is still one of soul-searching passion and reckless love.Warning: this is neither a conventional romance nor a traditional love story. This is not a fairy tale love story nor is it a BDSM romance. There are no hearts and flowers on the pages of this book. The heroine doesn't always make wise choices and though I've tried to make her strong, she's often times weak in the face of the fierce hero. The hero is not a knight in shining armor. He's broken and frequently cruel, and what every woman in the real world should avoid. This is a story about facing the darkness within. The man written within the pages of this book is obsessive, possessive and broken, and he gets off on mind fucking his lovers. He's an anti-hero with an abusive past who often times pushes too hard in his quest to win his own sick game.What's contained within this book is fiction—dark, depraved and decadent make-believe. Contains erotic elements, uncomfortable situations, and descriptions that may trigger past memories of abuse. Intended for readers 18+ Contains bonus material including deleted scenes, alternate ending, and epilogue.",
  "genres": [
    "BDSM",
    "Dark",
    "Erotica",
    "Amazon"
  ],
  "author": "Ella Dominguez",
  "average_rating": "4.10",
  "url": "https://www.goodreads.com/book/show/24602374-chapter-8"
}