{
  "title": "Annie Gomez and the Gigantic Foot of Doom",
  "description": "This YA sci-fi/fantasy adventure portrays the \"teen condition\" with more than a bit of humor, a la Terry Pratchett's Tiffany Aching. It features Annie Gomez and her \"coterie\" of fellow outcasts. Annie Gomez, having just completed 10th grade, wrestles with being the smartest person she knows (and probably the smartest person ever) and yet having to deal with absurd parents, thick classmates, and saving the world from aliens (or possibly fairies.) Fortunately, Annie isn't quite totally alone. Her circle of carefully chosen friends include Andy, half Inuit, half African-American, who once played Anne Frank on stage; Johnny, a shy Romany boy who loves history; Naomi, a sophisticated, mature woman of the world (ok, 16 year old of the world); Justin, who still looks like a 6th grader (and a golden retriever) but plays trombone with a world-class jazz band and is the high schools leading expert in exobiology - the study of alien life; and finally Aaron, whose brilliant mind is beyond the ken of ordinary humans. Aaron is autistic, rarely speaks, and spends his time in realms that are imaginary. Or are they? On the last day of the school year Annie's biology teacher warns her that he believes aliens are trying to take over her mind. \"Why not?\" she shrugs. \"Everyone else is.\" Yet as she continues to lose her grip on reality over the next weeks, she has no choice but to accept the possibility. As events unfold, Annie finds that not one but two different alien races are trying to contact her. One is trying to help. One is trying to destroy humanity. But which is which? Feeling totally helpless for the first time in her life, Annie is pulled first by one and then the other into strange and dangerous landscapes. And her friends (except Aaron, mysteriously disappears) are pulled with her, which is probably a good thing, she figures. A fortune teller told her that she had to learn to trust others (\"yeah, right\") but that in the end she would have to depend on her own resources (\"hey, can't someone help me out here?\"). At the last minute she makes her final effort, deploying her secret weapon, only to be used when there are no other options. And it fails. With no hope left she finds herself locked in mortal, hand-to-hand combat with a terrifying, powerful alien, a battle that will determine whether humanity survives. Her strength failing, she faces the very real probability of her own death and please don't tell this to ANYONE but she realizes she really loves her parents. Will she prevail at the last minute? Where has Aaron been this whole time? What happens when you fall in love with someone from a parallel dimension? And what can stop that gigantic foot descending from the sky",
  "genres": [],
  "author": "Jay Cutts",
  "average_rating": "4.13",
  "url": "https://www.goodreads.com/book/show/24600770-annie-gomez-and-the-gigantic-foot-of-doom"
}