{
  "title": "Perchance to Dream: Selected Stories",
  "description": "The profoundly original and wildly entertaining short stories of a legendary Twilight Zone writer, with a foreword by Ray Bradbury and an afterword by William Shatner It is only natural that Charles Beaumont would make a name for himself crafting scripts for The Twilight Zone—for his was an imagination so limitless it must have emerged from some other dimension. Perchance to Dream contains a selection of Beaumont’s finest stories, including five that he later adapted for Twilight Zone episodes.Beaumont dreamed up fantasies so vast and varied they burst through the walls of whatever box might contain them. Supernatural, horror, noir, science fiction, fantasy, pulp, and more: all were equally at home in his wondrous mind. These are stories where lions stalk the plains, classic cars rove the streets, and spacecraft hover just overhead. Here roam musicians, magicians, vampires, monsters, toreros, extraterrestrials, androids, and perhaps even the Devil himself. With dizzying feats of master storytelling and joyously eccentric humor, Beaumont transformed his nightmares and reveries into impeccably crafted stories that leave themselves indelibly stamped upon the walls of the mind. In Beaumont’s hands, nothing is impossible: it all seems plausible, even likely.ContentsForeward: Beaumont Revisited (by Ray Bradbury)-Perchance to Dream-The Jungle-Sorcerer's Moon-You Can't Have Them All-Fritzchen-Father, Dear Father-The Howling Man-A Classic Affair-Place of Meeting-Song for a Lady-Blood Brother-In His Image-The Monster Show-The Beautiful People-Free Dirt-The Magic Man-Last Rites-The Music of the Yellow Brass-The New People-A Death in the Country-Traumerei-Night Ride-The New SoundAfterward (by William Shatner)",
  "genres": [
    "Horror",
    "Short Stories",
    "Fiction",
    "Fantasy",
    "Science Fiction",
    "Weird Fiction",
    "Classics"
  ],
  "author": "Charles Beaumont",
  "average_rating": "3.92",
  "url": "https://www.goodreads.com/book/show/24611644-perchance-to-dream"
}