{
  "title": "Brand Luther: How an Unheralded Monk Turned His Small Town into a Center of Publishing, Made Himself the Most Famous Man in Europe—and Started the Protestant Reformation",
  "description": "A revolutionary look at Martin Luther, the Reformation, and the birth of publishing, on the eve of the Reformation’s 500th anniversaryWhen an obscure monk named Martin Luther tacked his “theses” on the door of the Wittenberg church in 1517, protesting corrupt practices, he was virtually unknown. Within months, his ideas spread across Germany, then all of Europe; within years, their author was not just famous, but infamous, responsible for catalyzing the violent wave of religious reform that would come to be known as the Protestant Reformation and engulfing Europe in decades of bloody war.Luther came of age with the printing press, and the path to glory of neither one was obvious to the casual observer of the time. Andrew Pettegree is perhaps our most distinguished living historian of the print revolution, but he launched his career as a historian of the Reformation. That double vision positions him to comprehend this epic event, not simply as a religious story but also as a story about how ideas were carried and spread in new ways, by new things—things called mass-produced books. Printing was, and is, a risky business—the questions were how to know how much to print and how to get there before the competition. Pettegree illustrates Luther's great gift not simply as a theologian, but as a communicator, indeed, as the world's first mass-media figure, its first brand. He recognized in printing the power of pamphlets, written in the colloquial German of everyday people, to win the battle of ideas.But that wasn't enough—not just words, but the medium itself was the message. Fatefully, Luther had a partner in Wittenberg in the form of artist and businessman Lucas Cranach, who together with Wittenberg’s printers created the look of Luther's pamphlets, which included the distinct highlighting of the words \"Martin Luther of Wittenberg\" on the title page. Cranach also created the iconic portraits of Luther that made the reformer such a familiar figure to his fellow Germans. Together, Luther and Cranach created a product that spread like wildfire—it was both incredibly successful and widely imitated. Soon Germany was overwhelmed by a blizzard of pamphlets, with Wittenberg at its heart; the Reformation itself would blaze on for more than a hundred years.Publishing in advance of the Reformation’s 500th anniversary, Brand Luther fuses the history of religion, of printing, and of capitalism—the literal marketplace of ideas—into one enthralling story, revolutionizing our understanding of one of the pivotal figures and eras in all of human history.",
  "genres": [
    "History",
    "Nonfiction",
    "Biography",
    "Religion",
    "Christianity",
    "Church History",
    "Theology"
  ],
  "author": "Andrew Pettegree",
  "average_rating": "4.05",
  "url": "https://www.goodreads.com/book/show/24612031-brand-luther"
}