{
  "title": "The Wars of the Roses: The Fall of the Plantagenets and the Rise of the Tudors",
  "description": "The author of Powers and Thrones and presenter of Netflix’s Secrets of Great British Castles offers a vivid account of the events that inspired Game of Thrones and Shakespeare’s Henry IV and Richard IIIDiscover the real history behind The Hollow Crown: The Wars of the Roses , the PBS Great Performance series of Shakespeare's plays, starring Judi Dench, Benedict Cumberbatch, Sofie Okenedo and Hugh Bonneville. The crown of England changed hands five times over the course of the fifteenth century, as two branches of the Plantagenet dynasty fought to the death for the right to rule. In this riveting follow-up to The Plantagenets , celebrated historian Dan Jones describes how the longest-reigning British royal family tore itself apart until it was finally replaced by the Tudors.Some of the greatest heroes and villains of history were thrown together in these turbulent times, from Joan of Arc and Henry V, whose victory at Agincourt marked the high point of the medieval monarchy, to Richard III, who murdered his own nephews in a desperate bid to secure his stolen crown. This was a period when headstrong queens and consorts seized power and bent men to their will. With vivid descriptions of the battles of Towton and Bosworth, where the last Plantagenet king was slain, this dramatic narrative history revels in bedlam and intrigue. It also offers a long-overdue corrective to Tudor propaganda, dismantling their self-serving account of what they called the Wars of the Roses. “If you’re a fan of Game of Thrones or The Tudors then Dan Jones’ swashbucklingly entertaining slice of medieval history will be right up your alley… Every bit as entertaining and readable as his previous blockbuster The Plantagenets .” – Daily Express",
  "genres": [
    "History",
    "Nonfiction",
    "Audiobook",
    "Historical",
    "Medieval",
    "British Literature",
    "European History"
  ],
  "author": "Dan Jones",
  "average_rating": "4.27",
  "url": "https://www.goodreads.com/book/show/24611635-the-wars-of-the-roses"
}