{
  "title": "The Art of Language Invention: From Horse-Lords to Dark Elves to Sand Worms, the Words Behind World-Building",
  "description": "An insider’s tour through the construction of invented languages from the bestselling author and creator of languages for Legendary's Dune , the HBO series Game of Thrones and the Syfy series DefianceFrom master language creator David J. Peterson comes a creative guide to language construction for sci-fi and fantasy fans, writers, game creators, and language lovers. Peterson offers a captivating overview of language creation, covering its history from Tolkien’s creations and Klingon to today’s thriving global community of conlangers. He provides the essential tools necessary for inventing and evolving new languages, using examples from a variety of languages including his own creations, punctuated with references to everything from Star Wars to Janelle Monáe. Along the way, behind-the-scenes stories lift the curtain on how he built languages like Dothraki for HBO’s Game of Thrones and Shiväisith for Marvel’s The Dark World , and an included phrasebook will start fans speaking Peterson’s constructed languages. The Art of Language Invention is an inside look at a fascinating culture and an engaging entry into a flourishing art form—and it might be the most fun you’ll ever have with linguistics.The Art of Language Invention includes a new chapter on phrases, specifically, word order, negation, question formation, pragmatic concerns, relativization, and subordination, providing a complete introduction to language creation and linguistics. Invented languages featured in the book now include Chakobsa from Legendary’s Dune , Trigedasleng (or Grounder) from The 100 , Méníshè language from Fort Salem and Ravkan from the Netflix series Shadow and Bone .",
  "genres": [
    "Nonfiction",
    "Linguistics",
    "Language",
    "Writing",
    "Audiobook",
    "Science",
    "Reference"
  ],
  "author": "David J. Peterson",
  "average_rating": "4.12",
  "url": "https://www.goodreads.com/book/show/24611649-the-art-of-language-invention"
}