{
  "title": "The Wind in the Reeds",
  "description": "From acclaimed actor and producer Wendell Pierce, an insightful and poignant portrait of family, New Orleans and the transforming power of art.  On the morning of August 29, 2005, Hurricane Katrina barreled into New Orleans, devastating many of the city's neighborhoods, including Pontchartrain Park, the home of Wendell Pierce's family and the first African American middle-class subdivision in New Orleans. The hurricane breached many of the city's levees, and the resulting flooding submerged Pontchartrain Park under as much as 20 feet of water. Katrina left New Orleans later that day, but for the next three days the water kept relentlessly gushing into the city, plunging eighty percent of New Orleans under water. Nearly 1,500 people were killed. Half the houses in the city had four feet of water in them--or more. There was no electricity or clean water in the city; looting and the breakdown of civil order soon followed. Tens of thousands of New Orleanians were stranded in the city, with no way out; many more evacuees were displaced, with no way back in.  Pierce and his family were some of the lucky ones: They survived and were able to ride out the storm at a relative's house 70 miles away. When they were finally allowed to return, they found their family home in tatters, their neighborhood decimated. Heartbroken but resilient, Pierce vowed to help rebuild, and not just his family's home, but all of Pontchartrain Park.  In this powerful and redemptive narrative, Pierce brings together the stories of his family, his city, and his history, why they are all worth saving and the critical importance art played in reuniting and revitalizing this unique American city.",
  "genres": [
    "Nonfiction",
    "Memoir",
    "Biography",
    "History",
    "Biography Memoir",
    "Audiobook",
    "African American"
  ],
  "author": "Wendell Pierce",
  "average_rating": "3.97",
  "url": "https://www.goodreads.com/book/show/24611830-the-wind-in-the-reeds"
}