{
  "title": "The Strap-On",
  "description": "A collection of five kinky stories with mixed and varied themes including sex in a public place, BDSM and food fetish.The Strap-On by Maggie MortonFrom the moment he sees the strap-on in his girlfriend’s bedroom drawer, Percy is obsessed with the sex-toy. It fills his every fantasy . Then one day it disappears and he is heartbroken. But it turns out she is taking him on a trip and there is more than one delicious surprise along the way.Confessions by K D GraceConfession is good for the soul, but Hail Marys and Our Fathers aren’t nearly enough to gain absolution when Jilly confesses to an unsuspecting priest that confession makes her come.Doctor’s Orders by Brandon BurnhamHarley’s at a posh party in downtown Miami. He’s having a great time, but he does have a small problem. Both his hands are bandaged after an injury, he needs to visit the Gents, and the woman friend he came with has disappeared. Gorgeous Marie offers to help. She tells him she’s a doctor and used to performing intimate services, but things get rather more intimate than either of them originally planned.Retail Seduction by Tabitha RayneSelena is out shopping when she is overcome by the urge to have an orgasm and she escapes into a changing room with a black silk scarf. Later, at home, she tells her husband, Jim, that she stole the scarf and he ties her up with it and spanks her soundly. But Selena, it seems, enjoys her punishment far too much.Have Your Cake and Eat it by Jeremy SmithJulie is a caterer and one of the things that annoys her is the amount of food that gets wasted. On this particular afternoon she is anxious to get home with boyfriend, Leigh, so they can catch up on their love-life - they haven’t seen each other for a while. While he’s helping her dispose of a mountain of jelly, custard and chocolate gateaux, they discover a much more exciting use for it. Maybe they can combine clearing-up with love-making. Parties will never be quite the same again.These stories have also been published in Kinky Girls",
  "genres": [],
  "author": "Miranda Forbes",
  "average_rating": "3.00",
  "url": "https://www.goodreads.com/book/show/10163992-the-strap-on"
}