{
  "title": "America's Bank: The Epic Struggle to Create the Federal Reserve",
  "description": "A tour de force of historical reportage, America’s Bank illuminates the tumultuous era and remarkable personalities that spurred the unlikely birth of America’s modern central bank, the Federal Reserve. Today, the Fed is the bedrock of the financial landscape, yet the fight to create it was so protracted and divisive that it seems a small miracle that it was ever established. For nearly a century, America, alone among developed nations, refused to consider any central or organizing agency in its financial system. Americans’ mistrust of big government and of big banks—a legacy of the country’s Jeffersonian, small-government traditions—was so widespread that modernizing reform was deemed impossible. Each bank was left to stand on its own, with no central reserve or lender of last resort. The real-world consequences of this chaotic and provincial system were frequent financial panics, bank runs, money shortages, and depressions. By the first decade of the twentieth century, it had become plain that the outmoded banking system was ill equipped to finance America’s burgeoning industry. But political will for reform was lacking. It took an economic meltdown, a high-level tour of Europe, and—improbably—a conspiratorial effort by vilified captains of Wall Street to overcome popular resistance. Finally, in 1913, Congress conceived a federalist and quintessentially American solution to the conflict that had divided bankers, farmers, populists, and ordinary Americans, and enacted the landmark Federal Reserve Act.Roger Lowenstein—acclaimed financial journalist and bestselling author of When Genius Failed and The End of Wall Street—tells the drama-laden story of how America created the Federal Reserve, thereby taking its first steps onto the world stage as a global financial power. America’s Bank showcases Lowenstein at his very finest: illuminating complex financial and political issues with striking clarity, infusing the debates of our past with all the gripping immediacy of today, and painting unforgettable portraits of Gilded Age bankers, presidents, and politicians.Lowenstein focuses on the four men at the heart of the struggle to create the Federal Reserve. These were Paul Warburg, a refined, German-born financier, recently relocated to New York, who was horrified by the primitive condition of America’s finances; Rhode Island’s Nelson W. Aldrich, the reigning power broker in the U.S. Senate and an archetypal Gilded Age legislator; Carter Glass, the ambitious, if then little-known, Virginia congressman who chaired the House Banking Committee at a crucial moment of political transition; and President Woodrow Wilson, the academician-turned-progressive-politician who forced Glass to reconcile his deep-seated differences with bankers and accept the principle (anathema to southern Democrats) of federal control. Weaving together a raucous era in American politics with a storied financial crisis and intrigue at the highest levels of Washington and Wall Street, Lowenstein brings the beginnings of one of the country’s most crucial institutions to vivid and unforgettable life. Readers of this gripping historical narrative will wonder whether they’re reading about one hundred years ago or the still-seething conflicts that mark our discussions of banking and politics today.",
  "genres": [
    "History",
    "Economics",
    "Finance",
    "Nonfiction",
    "Business",
    "American History",
    "Politics"
  ],
  "author": "Roger Lowenstein",
  "average_rating": "3.81",
  "url": "https://www.goodreads.com/book/show/24611598-america-s-bank"
}