{
  "title": "The Hours Count",
  "description": "A spellbinding historical novel about a woman who befriends Ethel and Julius Rosenberg, and is drawn into their world of intrigue, from the author of Margot. On June 19, 1953, Ethel and Julius Rosenberg were executed for conspiring to commit espionage. The day Ethel was first arrested in 1950, she left her two young sons with a neighbor, and she never came home to them again. Brilliantly melding fact and fiction, Jillian Cantor reimagines the life of that neighbor, and the life of Ethel and Julius, an ordinary-seeming Jewish couple who became the only Americans put to death for spying during the Cold War. A few years earlier, in 1947, Millie Stein moves with her husband, Ed, and their toddler son, David, into an apartment on the eleventh floor in Knickerbocker Village on New York’s Lower East Side. Her new neighbors are the Rosenbergs. Struggling to care for David, who doesn’t speak, and isolated from other “normal” families, Millie meets Jake, a psychologist who says he can help David, and befriends Ethel, also a young mother. Millie and Ethel’s lives as friends, wives, mothers, and neighbors entwine, even as chaos begins to swirl around the Rosenbergs and the FBI closes in. Millie begins to question her own husband’s political loyalty and her marriage, and whether she can trust Jake and the deep connection they have forged as they secretly work with David. Caught between these two men, both of whom have their own agendas, and desperate to help her friends, Millie will find herself drawn into the dramatic course of history. As Millie—trusting and naive—is thrown into a world of lies, intrigue, spies and counterspies, she realizes she must fight for what she believes, who she loves, and what is right.",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Historical",
    "Book Club",
    "Jewish",
    "Adult Fiction",
    "New York"
  ],
  "author": "Jillian Cantor",
  "average_rating": "3.88",
  "url": "https://www.goodreads.com/book/show/24611708-the-hours-count"
}