{
  "title": "Christmas Bells",
  "description": "New York Times \nbestselling author Jennifer Chiaverini celebrates Christmas, past and present, with a wondrous novel inspired by the classic poem “Christmas Bells,” by Henry Wadsworth Longfellow.\nI heard the bells on Christmas Day/ Their old familiar carols play/ And wild and sweet/ The words repeat/Of peace on earth, good-will to men!\n   In 1860, the Henry Wadsworth Longfellow family celebrated Christmas at Craigie House, their home in Cambridge, Massachusetts. The publication of Longfellow’s classic Revolutionary War poem, “Paul Revere’s Ride,” was less than a month hence, and the country’s grave political unrest weighed heavily on his mind. Yet with his beloved wife, Fanny, and their five adored children at his side, the delights of the season prevailed. In present-day Boston, a dedicated teacher in the Watertown public school system is stunned by somber holiday tidings. Sophia’s music program has been sacrificed to budget cuts, and she worries not only about her impending unemployment but also about the consequences to her underprivileged students. At the church where she volunteers as music director, Sophia tries to forget her cares as she leads the children’s choir in rehearsal for a Christmas Eve concert. Inspired to honor a local artist, Sophia has chosen a carol set to a poem by Longfellow, moved by the glorious words he penned one Christmas Day long ago, even as he suffered great loss.Christmas Bells chronicles the events of 1863, when the peace and contentment of Longfellow’s family circle was suddenly, tragically broken, cutting even deeper than the privations of wartime. Through the pain of profound loss and hardship, Longfellow’s patriotism never failed, nor did the power of his language. “Christmas Bells,” the poem he wrote that holiday, lives on, spoken as verse and sung as a hymn.  Jennifer Chiaverini’s resonant and heartfelt novel for the season reminds us why we must continue to hear glad tidings, even as we are tested by strife. Reading Christmas Bells evokes the resplendent joy of a chorus of voices raised in reverent song.",
  "genres": [
    "Christmas",
    "Historical Fiction",
    "Fiction",
    "Holiday",
    "Book Club",
    "Civil War",
    "Historical"
  ],
  "author": "Jennifer Chiaverini",
  "average_rating": "3.75",
  "url": "https://www.goodreads.com/book/show/24611642-christmas-bells"
}