{
  "title": "Believe Me: A Memoir of Love, Death, and Jazz Chickens",
  "description": "Critically acclaimed, award-winning British comedian and actor Eddie Izzard details her childhood, her first performances on the streets of London, her ascent to worldwide success on stage and screen, and her comedy shows which have won over audiences around the world.Over the course of a thirty-year career, Eddie Izzard has proven herself to be a creative chameleon, inhabiting the stage and film and television screen with an unbelievable fervor. Born in Yemen, and raised in Ireland, Wales and post-war England, she lost her mother at the age of six. In her teens, she dropped out of university and took to the streets of London as part of a two-person escape act; when her partner went on vacation, Izzard kept busy by inventing a one-person act, and thus a career was ignited. As a stand-up comedian, Izzard has captivated audiences with her surreal, stream-of-consciousness comedy--lines such as \"Cake or Death?\" \"Death Star Canteen,\" and \"Do You Have a Flag?\" have the status of great rock lyrics. As a self-proclaimed \"Executive Transvestite,\" Izzard broke the mold performing in full make-up and heels, and has become as famous for her advocacy for LGBT rights as she has for her art. In Believe Me, she recounts the dizzying rise she made from street busking to London's West End, to Wembley Stadium and New York's Madison Square Garden. Still performing more than 100 shows a year--thus far in a record-breaking twenty-eight countries worldwide--Izzard is arguably one of today's top Kings of Comedy. With her brand of keenly intelligent humor, that ranges from world history to pop culture, politics and philosophy, she has built an extraordinary fan base that transcends age, gender, and race. Writing with the same candor and razor-sharp insight evident in her comedy, she reflects on a childhood marked by unutterable loss, sexuality and coming out, as well as a life in show business, politics, and philanthropy. Honest and generous, Izzard's Believe Me is an inspired account of a very singular life thus far.",
  "genres": [
    "Nonfiction",
    "Memoir",
    "Biography",
    "Audiobook",
    "Humor",
    "Autobiography",
    "Biography Memoir"
  ],
  "author": "Eddie Izzard",
  "average_rating": "3.86",
  "url": "https://www.goodreads.com/book/show/24611840-believe-me"
}