{
  "title": "Rome: A Cultural, Visual, and Personal History",
  "description": "From Robert Hughes, one of the greatest art and cultural critics of our time, comes a sprawling, comprehensive, and deeply personal history of Rome—as city, as empire, and, crucially, as an origin of Western art and civilization, two subjects about which Hughes has spent his life writing and thinking.Starting on a personal note, Hughes takes us to the Rome he first encountered as a hungry twenty-one-year-old fresh from Australia in 1959. From that exhilarating portrait, he takes us back more than two thousand years to the city's foundation, one mired in mythologies and superstitions that would inform Rome's development for centuries.From the beginning, Rome was a hotbed of power, overweening ambition, desire, political genius, and corruption. Hughes details the turbulent years that saw the formation of empire and the establishment of the sociopolitical system, along the way providing colorful portraits of all the major figures, both political (Julius Caesar, Marcus Aurelius, Nero, Caligula) and cultural (Cicero, Martial, Virgil), to name just a few. For almost a thousand years, Rome would remain the most politically important, richest, and largest city in the Western world.From the formation of empire, Hughes moves on to the rise of early Christianity, his own antipathy toward religion providing rich and lively context for the brutality of the early Church, and eventually the Crusades. The brutality had the desired effect—the Church consolidated and outlasted the power of empire, and Rome would be the capital of the Papal States until its annexation into the newly united kingdom of Italy in 1870.As one would expect, Hughes lavishes plenty of critical attention on the Renaissance, providing a full survey of the architecture, painting, and sculpture that blossomed in Rome over the course of the fourteenth through the sixteenth centuries, and shedding new light on old masters in the process. Having established itself as the artistic and spiritual center of the world, Rome in the seventeenth, eighteenth, and nineteenth centuries saw artists (and, eventually, wealthy tourists) from all over Europe converging on the bustling city, even while it was caught up in the nationalistic turmoils of the Italian independence struggle and war against France.Hughes keeps the momentum going right into the twentieth century, when Rome witnessed the rise and fall of Italian Fascism and Mussolini, and took on yet another identity in the postwar years as the fashionable city of \"La Dolce Vita.\" This is the Rome Hughes himself first encountered, and it's one he contends, perhaps controversially, has been lost in the half century since, as the cult of mass tourism has slowly ruined the dazzling city he loved so much. Equal parts idolizing, blasphemous, outraged, and awestruck, Rome is a portrait of the Eternal City as only Robert Hughes could paint it.",
  "genres": [
    "History",
    "Nonfiction",
    "Art",
    "Italy",
    "Travel",
    "Ancient History",
    "Architecture"
  ],
  "author": "Robert Hughes",
  "average_rating": "3.82",
  "url": "https://www.goodreads.com/book/show/11494894-rome"
}