{
  "title": "The Animal That Therefore I Am",
  "description": "The Animal That Therefore I Am is the long-awaited translation of the complete text of Jacques Derrida's ten-hour address to the 1997 Cérisy conference entitled \"The Autobiographical Animal,\" the third of four such colloquia on his work. The book was assembled posthumously on the basis of two published sections, one written and recorded session, and one informal recorded session.The book is at once an affectionate look back over the multiple roles played by animals in Derrida's work and a profound philosophical investigation and critique of the relegation of animal life that takes place as a result of the distinction—dating from Descartes—between man as thinking animal and every other living species. That starts with the very fact of the line of separation drawn between the human and the millions of other species that are reduced to a single \"the animal.\" Derrida finds that distinction, or versions of it, surfacing in thinkers as far apart as Descartes, Kant, Heidegger, Lacan, and Lévinas, and he dedicates extended analyses to the question in the work of each of them.The book's autobiographical theme intersects with its philosophical analysis through the figures of looking and nakedness, staged in terms of Derrida's experience when his cat follows him into the bathroom in the morning. In a classic deconstructive reversal, Derrida asks what this animal sees and thinks when it sees this naked man. Yet the experiences of nakedness and shame also lead all the way back into the mythologies of \"man's dominion over the beasts\" and trace a history of how man has systematically displaced onto the animal his own failings or bêtises. The Animal That Therefore I Am is at times a militant plea and indictment regarding, especially, the modern industrialized treatment of animals. However, Derrida cannot subscribe to a simplistic version of animal rights that fails to follow through, in all its implications, the questions and definitions of \"life\" to which he returned in much of his later work.Collection: Perspectives in Continental Philosophy",
  "genres": [
    "Philosophy",
    "Nonfiction",
    "Theory",
    "Animals",
    "Essays",
    "Politics",
    "Sociology"
  ],
  "author": "Jacques Derrida",
  "average_rating": "4.07",
  "url": "https://www.goodreads.com/book/show/2461524.The_Animal_That_Therefore_I_Am"
}