{
  "title": "Eve's Rib: Searching for the Biological Roots of Sex Differences",
  "description": "Why are the sexes different? Is it because men and women are taught by society to think and behave in sex-typical ways? Or are the sexes different by nature? For a quarter of a century, the dominant view has been that if males and females were treated the same from the time they were born, most sex differences would disappear. In Eve's Rib, Robert Pool describes a new understanding of the sexes that has been emerging over the past decade. When little boys play with trucks and little girls with dolls, or when females talk of feelings and males of facts and rules, the reasons are deeper than the sexes being taught to behave differently by society. The roots of these differences lie in the womb. Scientists know that a person's physical sex is determined in the womb by sex hormones. But unlike the Biblical story of creation, in which God created Eve from Adam's rib, the female body plan is actually the \"standard\" human plan - a fetus will automatically become female unless it is exposed to male hormones. And, as Eve's Rib describes, bodies are not the only things shaped by these hormones in the womb. From before birth, the brains of males and females are different in distinct, predictable ways, and these differences underlie much of the mental, emotional and psychological variation between the sexes. Eve's Rib explores its subject by talking to the scientists doing the research, many of whom are women who find themselves facing a dilemma: They themselves have had to overcome many of the stereotypes about women, and they believe strongly in equality between the sexes, yet their research indicates that in some ways the sexes will never be the same. Their resolutions of this quandary demonstrate how sex differences can be accepted without accepting sexual inequality. The research described in Eve's Rib ranges from rats confused about their sex to humans taking tests of math and verbal ability, and from women exposed to high levels of testosterone in the womb to men wh",
  "genres": [
    "Science",
    "Nonfiction"
  ],
  "author": "Robert Pool",
  "average_rating": "3.79",
  "url": "https://www.goodreads.com/book/show/2461772.Eve_s_Rib"
}