{
  "title": "Expecting Surrender",
  "description": "They’d called it The Game. An intriguing truth or dare, a little spice to an already hot sexual chemistry between two married professionals. But what started as a mere game evolved into something so much more, a dark, exciting adventure into serious power exchange. It soon became the center of their lives, the beating, lust-fueled heart of their sexual relationship. It was an exploration of pleasure, of pain, of elemental desire. A married couple diving deep into the waters of Dominance and submission. Like forbidden fruit, The Game had opened their eyes to the primal drives, the animal lusts lurking within each of them — and they knew they’d never be the same again. Then came the day she’d received the surprise news… in the form of a positive pregnancy test. Now Keihl and Kirsten, deeply in love, facing a profound, joyful change in their lives, must contemplate the prospect of putting aside The Game, just when things are really heating up. After all, pregnancy and BDSM are utterly incompatible. Right? Or was there a way to have both? Perhaps Kirsten’s pregnancy might open up an entirely new world to them within the alluring, lust-drenched context of a loving, yet strict, Dominance and submission dynamic? Perhaps the pregnancy might change them both in ways neither of them yet understand? Two lovers will discover if Dominance and submission, if pain and pleasure, and finding the real people they are inside is indeed still possible, now that a baby is on the way… Publisher's  Intended for mature readers. 18 and over only! This is a contemporary MF steamy D/s romance. The novel contains the following explicit sexuality, pervasive D/s, exhibitionism, spanking, bondage, and other unequal power dynamics. If such content might offend you, please do not purchase this book. Word 134,520 words.",
  "genres": [
    "BDSM",
    "Erotica"
  ],
  "author": "Trent Evans",
  "average_rating": "4.20",
  "url": "https://www.goodreads.com/book/show/24622188-expecting-surrender"
}