{
  "title": "The Traitor",
  "description": "In this mesmerizing finale to the revolutionary Carnivia Trilogy—following The Abomination and The Abduction—Venetian police captain Kat Tapo and U.S. Army intelligence analyst Holly Boland embark on their most dangerous and disturbing journey yetOn Venice’s popular Lido beach, a man is found lying on the shore, his throat slit and his tongue viciously torn out, and his face covered by an unusual antique mask.Superiors inside the Venice Carabinieri have finally given Captain Kat Tapo permission to run her first murder case. But when she learns that the mask is a Masonic “hoodwink”—and that the circumstances of the man’s death are eerily similar to the Masonic punishment for betrayal—she suspects that her appointment has darker implications. As a woman, she cannot penetrate the closed world of Italian freemasonry.The dead man is identified as a senior partner in a small Catholic bank currently engaged in negotiations with one of Italy’s richest men. Yet Kat knows that, when it comes to Venice’s most powerful and influential, money isn’t the only motive for murder.While she focuses on her investigation, American intelligence analyst Holly Boland finds a document among her father’s possessions that offers evidence of a shocking Cold War cover-up. The deeper the second lieutenant digs into what her father knew, the more she begins to wonder: Was her father silenced before he could expose the truth?Reclusive genius Daniele Barbo, creator of the anonymous virtual world Carnivia.com, makes a chilling discovery of his own: his website has been contaminated by a malevolent virus that will cripple Italy unless he can break his own encryption and prevent catastrophe. As the three cases merge, the trio of allies uncover a conspiracy involving the security services, the Church, and the CIA—a devastating plot stretching back decades that could destroy all three of them . . . but not without a fight.",
  "genres": [
    "Thriller",
    "Mystery",
    "Crime",
    "Fiction",
    "Italy",
    "Suspense",
    "British Literature"
  ],
  "author": "Jonathan  Holt",
  "average_rating": "3.97",
  "url": "https://www.goodreads.com/book/show/24619129-the-traitor"
}