{
  "title": "The Bionics",
  "description": "All Blythe Sol ever wanted was to be a normal girl. Yet, her dreams of following in her father’s footsteps by joining the military after graduation are crushed when nuclear war comes to the United States in the year 4006. Tens of thousands are killed in a series of attacks on many major cities, while thousands more are left injured from the devastation of the blasts, or terminally ill from the effects of radiation.When the government offers the sick and injured a second chance as part of the Restoration Project, how could they refuse? Hoping to put her life back together after the blasts take both her arm and her eye, Blythe enrolls in the program filled with hope. She never expects that the bionic additions will change her life so drastically. When it is discovered that those outfitted with the robotic parts have become enhanced beyond the limits of ordinary human ability, normal can never exist for her again.The Bionics become targets of the government, as fear of them spreads across the nation, further enflamed by media propaganda and political conspiracy. Forced to go into hiding or face execution, society’s outcasts band together to form the Restoration Resistance—an underground rebellion which Blythe becomes a part of in order to survive. She could never imagine that joining them would thrust her at the forefront of an imminent revolution, or that it would put her in a confusing tug-of-war between two of her fellow soldiers—Gage Bronson, the mysterious new addition to the Resistance, and Dax Janner, her best friend. Even though Gage is rapidly capturing her heart, she is forced to face the possibility that her feelings for Dax might just go beyond friendship. However, with impending war and the threat of death hanging over her head, Blythe hardly has time to worry about anything as trivial as a love life...",
  "genres": [
    "Science Fiction",
    "Dystopia",
    "Young Adult",
    "Romance",
    "Fantasy",
    "Fiction",
    "Amazon"
  ],
  "author": "Alicia Michaels",
  "average_rating": "3.73",
  "url": "https://www.goodreads.com/book/show/24624260-the-bionics"
}