{
  "title": "The Green Line Divide: Romance, Travel, and Turmoils - endearing and entertaining",
  "description": "THE GREEN LINE DIVIDE: Romance, Travel, and TurmoilsThis is a romantic travel fiction, with a touch of humour, set in two Mediterranean Islands of Cyprus and Rhodes Island of Greece. Join Alexis and Sven, a Swedish United Nations officer on a touching, hilarious journey that carries readers to various parts of the globe to explore romance, relationships, personal growth, and culture like no other than The Green Line Divide. It is set in the two Mediterranean Islands of Cyprus and Rhodes Island of Greece.Description: Alexis is smart, sexy, and enthusiastic—but, like most people, she’s got a few things holding her back in life. And if she’s to ever move forward, she’s got to confront them—head on.From failing her school exams and dealing with her father’s illness to being mistaken for a celebrity and avoiding serious relationships at any cost, Alexis’s life is riddled with complications and concerns, some harrowing and others absolutely hilarious. When she meets a svelte Swede named Sven, Alexis’s life becomes even more complicated, and her fear of commitment becomes more pronounced, placing her at a pivotal point: Can she overcome her fears and get married? Or will she search for any excuse to keep from walking down the aisle?The Green Line Divide: Romance, Travel, and Turmoils follows Alexis’s trials and tribulations in life, love, and relationships, set against a Mediterranean backdrop rich with travel, musicals and culture. A truly informative, laugh-out-loud novel, it is sure to appeal to readers with a wide variety of interests, including tourism, hitchhiking, international history, personal growth, and stories of relationship drama.Back CoverRomance, humor, and drama abound in this fast-paced, playful novel—and so too, do questions and surprises. The Green Line Divide: Romance, Travel, and Turmoils encounters readers with people from various parts of the world, including exotic destinations like Cyprus and the Greek island of Rhodes. And follow a young woman named Alexis as she struggles with gamophobia and tries to come to terms with her independence, relationships, and the future.Smitten with a handsome Swede named Sven, a United Nations officer, Alexis plans to marry him, but has a lot of issues to confront if she’s to make it down the aisle—and, as she confronts them, The Green Line Divide is sure to touch your heart, educate you, tickle your funny bone, and put a smile on your face.Will Alexis ever marry? Or will she find an excuse to run away from it all—again? Step into this book for answers. Along the way, you’ll be entertained and learn new travel, leisure, cultures and celebrations.",
  "genres": [],
  "author": "Z. Vally",
  "average_rating": "4.50",
  "url": "https://www.goodreads.com/book/show/24638755-the-green-line-divide"
}