{
  "title": "Situation Normal",
  "description": "He is determined to never repeat the past.  His failure dregs up bitter memories—memories that leave him feeling powerless—but something doesn't feel right, and the more he looks into it, the less sense everything seems to make. The only constant in his life is Jamie, who has been a godsend—an anchor that keeps him rooted in the stormy prison of his own mind.   Jamie's brother is coming home... and she's terrified of what's waiting for him.   Leo has been the best thing that's happened to Jamie since she started working with the club. But when her brother is returning home from deployment, Jamie knows that he will be instantly caught up in the bloody conflict between the club and the cartel and turns to Leo—hoping that something, anything, can be done to keep her brother safe.   They unearth a sordid secret that will leave them questioning everything.  Determined to keep a returning vet from joining the mess that Lima Six is now in, Leo takes on the role of a mentor to Jamie’s brother in an attempt to keep him away from the club and the cartel. But when Jamie helps him unearth a secret that shatters his belief in everything, they’ll have to do everything in their power to stop this runaway ride that they’ve found themselves on.   EXCERPT  She shivered at his touch, the delicate draw of his finger along her skin sending a crackling pleasure through her. She reached for his shirt but he caught her hands again.  “No…” he whispered as he slowly stepped behind her.  His hands glided over her, sliding down to her lower stomach. As she felt his breath on her neck he pulled her into him, holding her comfortably tight, as his lips began a measured exploration of her neck. As his lips caressed her skin, she wanted to squirm in pleasure and not move, lest she interrupt the delicious pleasures emanating from his touch.  He breathed deep as his lips slowly danced along her neck, her scent, the light fragrance of apples and baby powder a heady bouquet. He kissed up her neck, pausing under her ear, his lips and tongue busy in the spot he knew she liked so well. He brought his hands slowly up and began to work her buttons, the darkness that had attempted to reclaim his soul disappearing like smoke in a wind.",
  "genres": [],
  "author": "Kathryn Thomas",
  "average_rating": "3.86",
  "url": "https://www.goodreads.com/book/show/24630636-situation-normal"
}