{
  "title": "The Winds of Fate",
  "description": "HER INDEPENDENCE COMES AT A COST…CLAIRE HAMILTON will do anything to escape an arranged marriage. Desperate to thwart her uncle’s plan to marry her off to a repugnant duke, she does the unthinkable: she marries a convicted felon before he is hanged, hoping the social stigma will sully her name enough to call off the official wedding. The one thing she didn’t plan on was her imprisoned husband demanding his wedding night. To make matter worse, her plan works too well. Not only does the duke call off the wedding, her uncle banishes her to the island outpost of Jamaica to avoid scandal.HIS FREEDOM CAN’T BE BOUGHT…DR. DEVON BLACKMON angered the wrong men, powerful men. Wrongly accused of treachery against the king, Devon is imprisoned and sentenced to hang. He never expected a prison wedding to an auburn-haired beauty−nor to be sold as a slave instead of hanged, nor his owner to be none other than his wife. But despite her kindness, Devon is unwilling to accept Claire is different than any other London aristocrat and is determined to scorn her.His only chance at freedom comes with escape. But though he rises as the notorious Black Devil pirate, commanding his Caribbean kingdom, striking fear in the crowned heads of Europe…Devon cant’ forget Claire. When he takes her captive aboard ship, his lust for vengeance becomes an uncontrollable desire for the beauty who boldly challenges him.LOVE MUST PAY THE HIGHEST PRICE…With enemies all around them, Devon and Claire must risk their lives and learn to trust each other−or lose their hearts forever.The Winds of Fate Reviews:The Winds of Fate “…captivating romance that takes us to the world of seventeenth-century London...Sexual tension and legal and familial intrigue ensue with the reader cheering on the lovely pair.”−Publishers WeeklyThe Winds of Fate “has everything…full of passion, betrayal, mystery and all the good stuff readers love.”−ABNA Expert Reviewer“Original…strong-willed heroine…I love all of it…the unlikely premise of a female member of the aristocracy visiting a man who is condemned to die and asking him to marry her.”−ABNA Expert Reviewer",
  "genres": [
    "Historical Romance",
    "Romance",
    "Historical",
    "Pirates",
    "Historical Fiction",
    "Regency",
    "Adult"
  ],
  "author": "Elizabeth St. Michel",
  "average_rating": "3.95",
  "url": "https://www.goodreads.com/book/show/24642802-the-winds-of-fate"
}