{
  "title": "Lead on Purpose",
  "description": "Great leaders aren't born. They are made. They are built just as a great structure or machine is. Lead on Purpose: Tools for Effective Leadership introduces you to the tools of the trade that you need to craft yourself as an effective leader. By the end of this powerful book, you'll be ready to take up these tools and change the way you lead, changing every aspect of your life from your performance at work to how you interact in social situations and when volunteering in your community.Interesting StorylineLead on Purpose: Tools for Effective Leadership consists of two parts that come together to unlock the secrets of molding and shaping oneself into a better leader. The first half uses an engaging allegory to introduce the concept of leadership styles in a way that is pleasurable to read and simple to understand. You'll quickly become immersed in the story and anxious to see how it unfolds all the while seeing vivid depictions of effective leadership styles that you can emulate as you work to remake yourself as an effective leader.Practical, Real Life ToolsThe second half of Lead on Purpose: Tools for Effective Leadership allows you to delve deeper into the leadership styles presented in the allegory. Through the use of tool-related metaphors, leadership coach Dan Blakeslee, makes concepts typically reserved for high-level MBA courses simple to understand. Questions are posed to help you think critically about the material and apply it to your own life, ensuring that you get the most out of the tools with which this engaging book will equip you.Proven PrinciplesEven if you were not born a great leader, you can build yourself up with the right tools. Download the Kindle edition or purchase the book; Lead on Purpose: Tools for Effective Leadership today and begin to discover the tools to build an effective leadership style that will help you accomplish your goals in the workplace and beyond",
  "genres": [
    "Leadership"
  ],
  "author": "Daniel Blakeslee",
  "average_rating": "4.64",
  "url": "https://www.goodreads.com/book/show/24641272-lead-on-purpose"
}