{
  "title": "Right Girl",
  "description": "Due to popular demand, I have decided to write an alternate ending to 'Right Girl.' This book will include a complete rewrite of the original ending and I hope you enjoy the final conclusion to this story. Please make sure you have read 'Wrong Girl' followed by 'Now It's Just Us' before purchasing this novel.For those who wanted a different story for Zack & Sam... this one is for you.Wrong Girl Series:#1 Wrong Girl#2 Now It's Just Us#3 Right Girl/ (Alternate ending)Excerpt:\"You're mine. You've always been mine and I will never let you go.\" Zack growls, lowering his lips towards mine, stealing my breath away with a single kiss. His tongue invades my mouth, demanding an entrance as commands me to submit to him. “Only you. Always you. You’re mine forever.” - Zack\"It's so strange how your life can just change in an instant. It's also frightening how your entire future can be shattered in a split second. I stand in front of my sister and her baby, staring at them both in absolute shock and horror. Rachel's baby girl is beautiful with her dark hair and sparkling brown eyes staring back at me...Zack's daughter.She's also my niece and the one thing which threatens to tear us apart forever. I can't be the reason that she grows up without a father and I refuse to be the obstacle which stands in the way of Zack getting to know his own child. The kindest thing I can do for everyone is disappear and I'm more than willing to sacrifice my own piece of happiness for Zack's if that's what I must do.This also means I must leave him... for good.I just pray he will let me go.\" - Samantha\"Samantha brought me to life and makes me feel alive. I'm not afraid to admit that my love for her has become an obsession. I'm addicted to her and the compulsion to be with her has now consumed me entirely. She thinks I'm going to let her walk away from me. She actually believes I would let her go after the torment that I've been through just to keep her. She's severely deluded if she thinks I'm about to admit defeat and let her walk away. Screw the fact that it might be wrong or unhealthy... I'm willing to do everything and anything in my power to make sure I keep her...Even if that involves something she doesn't like.She can run but I will always find her. Samantha is mine and no one is going to take her from me...\" - ZackPrepare yourself for a breath-taking conclusion to a love that was forbidden. Find out if happiness can follow heartache and if joy can be found amongst the darkness of your past. ***This New adult romance contains mature themes, strong language and sexual citations. It is recommended for readers 18+***",
  "genres": [],
  "author": "Lauren  Crossley",
  "average_rating": "2.79",
  "url": "https://www.goodreads.com/book/show/24655799-right-girl"
}