{
  "title": "All Families Are Psychotic",
  "description": "any form of severe mental disorder in which the individual’s contact with reality becomes highly distorted .Douglas Coupland, the author whom Tom Wolfe calls “one of the freshest, most exciting voices of the novel today,” delivers his tenth book in ten years of writing, with All Families Are Psychotic . Coupland recently has been compared to Jack Kerouac and F. Scott Fitzgerald, yet he is a man firmly grounded in the current era. The novel is a sizzling and sharp-witted entertainment that resounds with eternal human yearnings.In the opening pages, 65-year-old Janet Drummond checks the clock in her cheap motel room near Cape Canaveral, takes her prescription pills and does a rapid tally of the whereabouts of her three Wade, the eldest, in and out of jail and still radiating ”the glint”; suicidal Bryan, whose girlfriend, the vowel-free Shw, is pregnant; and Sarah, the family’s shining light, an astronaut preparing to be launched into space as the star of a shuttle mission. They will all arrive in Orlando today – along with Janet’s ex-husband Ted and his new trophy wife – setting the stage for the most disastrous family reunion in the history of fiction. Florida may never recover from their version of fun in the sun.The last time the family got together, there was gunplay and an ensuing series of HIV infections. Now, what should be a celebration turns instead into a series of mishaps and complications that place the family members in constant peril. When the reformed Wade attempts to help his dad out of a financial jam and pay off his own bills at the fertility clinic, his plan spins quickly out of control. Adultery, hostage-taking, a letter purloined from Princess Diana’s coffin, heart attacks at Disney World, bankruptcy, addiction and black-market negotiations – Coupland piles on one deft, comic plot twist after another, leaving you reaching for your seat belt. When the crash comes, it is surprisingly sweet.Janet contemplates her family, and where it all went wrong. “People are pretty forgiving when it comes to other people's family. The only family that ever horrifies you is your own.” During the writing, Coupland described the book as being about “the horrible things that families do to each other and how it makes them strong.” He “Families who are really good to each other, I’ve noticed, tend to dissipate, so I wonder how awful a family would have to be to stick together.”Coupland’s first novel, Generation Tales for an Accelerated Culture , became a cultural phenomenon, affixing a buzzword and a vocabulary to a generation and going on to sell over a million copies. The novels that followed were all bestsellers, and his work has continued to show a fascination with the digital, brand-conscious, media-dense culture of contemporary North American society, leading some to peg him as “an up-to-the-minute cultural reference engine.” Meanwhile, his deeper interests in how human beings function in this spiritual vacuum have become increasingly apparent. For example, the character Wade contemplates his “What would the world have to offer Ted Drummond, and the men like him, a man whose usefulness to the culture had vanished somewhere around the time of Windows 95? Golf? Gold? Twenty-four hour stock readouts?” Janet, on the other hand, nears a kind of peace with “Time erases both the best and the worst of us.” All Families Are Psychotic shows Coupland being just as concerned for the grown-ups as for the kids.",
  "genres": [
    "Fiction",
    "Canada",
    "Contemporary",
    "Humor",
    "Novels",
    "Literary Fiction",
    "Literature"
  ],
  "author": "Douglas Coupland",
  "average_rating": "3.70",
  "url": "https://www.goodreads.com/book/show/246545.All_Families_Are_Psychotic"
}