{
  "title": "The Scent of Rosa's Oil",
  "description": "Set in the beautiful port city of Genoa, Italy, at the turn-of-the-century, The Scent of Rosa's Oil is a magical story that attests to the strength of longing, the consequences of betrayal, and the nostalgic memories only a one-of-a-kind fragrance can evoke . . . The only home Rosa has ever known is the Luna brothel, where she's lovingly cared for by Madam C and all the women who work there. Madam C shelters Rosa from what really goes on at the Luna by telling her they play a game with the men who visit. Naturally, Rosa is curious and can't wait until she grows up so she can also play the game. But when a twist-of-fate forces Rosa to leave the Luna after her sixteenth birthday, she goes to stay with her new friend Isabel, an old woman who distills oils. The strange smells and smoke that emanate from Isabel's shack have deemed her a witch to the locals, but only Rosa sees a lonely, tender woman with a passion for making beautifully-scented oils. Enchanted by the intoxicating fragrances around her, Rosa becomes Isabel's apprentice, learning the art of extracting a flower's essence and selling the oils in the town square. Soon everyone in Genoa is talking about the pretty, young girl with the lush locks of red hair who sells aromatic oils in the piazza. Some say she has the oil to cure whatever ailment one has, while others say her oils will capture the heart of a special person. Indeed, Rosa has learned Isabel's secret for creating her own \"perfect oil\"-a unique fragrance that holds a mysterious power. Now Rosa needs a miracle to make Renato, the man she has fallen in love with, see past the ugly rumors he's heard about her and the Luna brothel. Disguising herself with a black wig and dabbing her special fragrance on her wrists, Rosa sets out to win Renato. But how long can Rosa keep her true identity hidden? And when destiny intervenes, challenging their love in unforeseeable ways, they'll need a magic even greate",
  "genres": [
    "Historical Fiction",
    "Romance",
    "Fiction",
    "Italy",
    "Historical"
  ],
  "author": "Lina Simoni",
  "average_rating": "3.00",
  "url": "https://www.goodreads.com/book/show/2465174.The_Scent_of_Rosa_s_Oil"
}