{
  "title": "A Great and Terrible King: Edward I and the Forging of Britain",
  "description": "This is the first major biography for a generation of a truly formidable king – a man born to rule England, who believed that it was his right to rule all of Britain. His reign was one of the most dramatic and important of the entire Middle Ages, leading to war and conquest on an unprecedented scale, and leaving a legacy of division between the peoples of Britain that has lasted from his day to our own.Edward I is familiar to millions as ‘Longshanks’, conqueror of Scotland and nemesis of Sir William Wallace (‘Braveheart’). Yet this story forms only the final chapter of the king’s astonishingly action-packed life. Earlier Edward had defeated and killed the famous Simon de Montfort in battle; travelled across Europe to the Holy Land on crusade; conquered Wales, extinguishing forever its native rulers, and constructing – at Conwy, Harlech, Beaumaris and Caernarfon – the most magnificent chain of castles ever created. He raised the greatest armies of the English Middle Ages, and summoned the largest parliaments; notoriously, he expelled all the Jews from his kingdom. The longest-lived of all England’s medieval kings, he fathered no fewer than fifteen children with his first wife, Eleanor of Castile, and after her death he erected the Eleanor Crosses – the grandest funeral monuments ever fashioned for an English monarch.In this book, Marc Morris examines afresh the forces that drove Edward throughout his relentless his character, his Christian faith, and his sense of England’s destiny – a sense shaped in particular by the tales of the legendary King Arthur. He also explores the competing reasons that led Edward’s opponents (including Llywelyn ap Gruffudd and Robert Bruce) to resist him, and the very different societies that then existed in Scotland, Wales and Ireland. The result is a sweeping story, immaculately researched yet compellingly told, and a vivid picture of medieval Britain at the moment when its future was decided.",
  "genres": [
    "History",
    "Biography",
    "Nonfiction",
    "Medieval",
    "Medieval History",
    "British Literature",
    "Historical"
  ],
  "author": "Marc Morris",
  "average_rating": "4.15",
  "url": "https://www.goodreads.com/book/show/2465562.A_Great_and_Terrible_King"
}