{
  "title": "The Best of Leigh Brackett",
  "description": "There was once a young girl who created a host of strange and wonderful worlds. These were her very own planets, with such fascinating features as the Sea of Morning Opals, the Mountains of White Cloud, wicked Canal cities, and lost lands full of magic and mystery.That girl's name is Leigh Brackett. And today, more than 35 years after selling her first science fiction story, she continues to thrill and excite all lovers of imaginative writing. Her haunting tales of ancient Mars, wind-swept Venus, and remote worlds beyond human technology have become almost instant classics in the genre; and now Edmond Hamilton, Leigh's husband and a great SF writer in his own right, has personally collected ten of her best stories into a beautiful hardcover anthology. Here's a preview of the amazing tales:THE JEWEL OF BAS. There's an ancient legend passed down among the people of the outermost planet. It tells of Bas the Immortal, possessor of the Stone of Destiny—a jewel of such power that owning it gives a man rule over the whole world. Ciaran and Mouse, two unscrupulous gypsies, only half-believed the story until they found themselves at the mercy of Bas's fierce android army ... pawns in a sinister plan to enslave the human race.THE VANISHING VENUSIANS. For years the space colonists had wandered the hellish eternal seas of Venus, seeking the home that was their birthright, death constantly stalking in their wake. And now they were making their final bid—three of their bravest fighting toward a promised land guarded by nightmare creatures. Who would emerge victorious? Close to 4000 desperate people waited anxiously for the answer...THE VEIL OF ASTELLAR. Tough, hardbitten Steve Vance ... once he was human! But three hundred years ago he betrayed his homeland for a race of alien vampires who fulfilled his every desire in return for a small \"favor.\" All he had to do was lure innocent Earth spaceships to their doom on the vampires' world. He knew his soul was forever damned. But there was one way in which he might atone...THE QUEER ONES. Hank Temple was at the editor's desk when the hospital called him in to see the X-rays. They were of a hill girl's illegitimate baby, and they showed insides like no child ever had. That was the beginning ... and the end came on an enshrouded Ozark mountain, with deadly green lightning flickering and a sound in the sky that was not wind or thunder...",
  "genres": [
    "Science Fiction",
    "Fantasy",
    "Short Stories",
    "Fiction",
    "Pulp",
    "Collections",
    "Anthologies"
  ],
  "author": "Leigh Brackett",
  "average_rating": "4.03",
  "url": "https://www.goodreads.com/book/show/2465085.The_Best_of_Leigh_Brackett"
}