{
  "title": "I Love You Phillip Morris: A True Story of Life, Love, & Prison Breaks",
  "description": "To escape from a Texas jail or prison once is unusual. To do it four times is incredible. To do it four times in five years and always on a Friday the 13th is the stuff of legend. Welcome to the world of Steven Russell. Con artist. Thief. Swindler. Embezzler. Hopeless romantic.A husband and father, Russell was a church organist, prosperous businessman, and onetime Boca Raton cop before turning to his life of crime. Arrested for a string of felonies, with a specialty in fraud, his real expertise turned out to be his uncanny ability to escape from jail. Between 1993 and 1998, he orchestrated a string of prison breaks that were as audacious as they were ingenious. Using whatever unlikely materials were at handa Magic Marker, a pay phone, a walkie-talkie, a pair of stolen bright red women's stretch pantsalong with an innate talent for analytical thinking and boundless quantities of sheer nerve, Russell again and again arranged his own \"early releases\" from jail. Unfortunately, for Russell, staying out of jail is another matter entirely.Over the years, it became increasingly clear that Russell's talent for escape is matched only by his knack for getting arrested. One thing always seems to trump Steven Russell's careful planning, cool head, and instinct for self-preservationlove. Russell cannot resist the urge to try and spring the great love of his lifea fellow inmate named Phillip Morris.In I Love You Phillip Morris, journalist Steve McVicker goes right to the heart of this improbable-but-true story of crime, punishment, and passion. Thanks to unprecedented and exclusive access to Russell, his family, and his friends, he retraces Russell's journey from small-town businessman to flamboyant white-collar criminal and jailhouse Houdini. It's the darkly comic tale of a man with a spectacular ability to manipulate almost everyone he meets, yet who is himself helpless in the face of love.",
  "genres": [
    "Nonfiction",
    "True Crime",
    "Biography",
    "Crime",
    "Romance",
    "LGBT",
    "Biography Memoir"
  ],
  "author": "Steve McVicker",
  "average_rating": "3.57",
  "url": "https://www.goodreads.com/book/show/1149775.I_Love_You_Phillip_Morris"
}