{
  "title": "The Rancher's Woman",
  "description": "Everyone in town knows that sparks of attraction have been flying between Tessa Anderson and Chance Williams almost from the moment her nursery business brought her to beautiful Hope Junction, Wyoming, but it takes an actual fire to really get things moving. When a blaze breaks out in Tessa’s kitchen, it is Chance—a volunteer firefighter—who rushes to the scene.  He asks her out the very next day, but she is shocked by his threat to spank her if it turns out the fire was caused by her carelessness. Nonetheless, Tessa can’t help pushing Chance to see if he would truly spank her, and before she knows it the firm-handed rancher takes her over his knee for a lesson she won’t soon forget. Yet despite his bossy ways, Tessa soon begins to realize that Chance might well be the man she’s been waiting for her whole life, and though it is hard for her to admit, the promise of a sore bottom when she misbehaves arouses her deeply.  But someone apparently has a problem with Tessa’s presence in Hope Junction, and the kitchen fire is followed up by one mysterious incident after another. Tessa keeps these occurrences secret from Chance, believing she can take care of herself. When the truth eventually comes to light, Tessa soon learns that Chance takes her safety very seriously and a bare-bottom spanking is only the beginning of the thorough, humiliating punishment she faces for her subterfuge. Will Chance’s decision to take her in hand so forcefully tear them apart, or will Tessa see his discipline as proof of the love they will share for the rest of their lives?  Publisher’s Note: The Rancher’s Woman is an erotic romance novel that contains spankings, severe punishments with a switch and a strap, sexual scenes including forced orgasm and punishment sex, extensive anal play and punishment, elements of BDSM, and more. If such material offends you, please don’t buy this book.",
  "genres": [
    "Romance",
    "Erotica",
    "BDSM",
    "Westerns"
  ],
  "author": "Helen Karol",
  "average_rating": "3.78",
  "url": "https://www.goodreads.com/book/show/24664498-the-rancher-s-woman"
}