{
  "title": "Fractures of Betrayal",
  "description": "As Mya prepares to become the Unseelie Queen to save her people, she can’t afford distractions. And that is exactly what Cole is. A sexy, dominating and most importantly, forbidden distraction to the Unseelie Queen. Still, she can’t deny the connection she has with Cole. He drives the passion inside of her to greater heights and pushes her to learn the limits of her vast magickal powers. Yet, deep down, the one thing she truly desires above all is to belong to him, only him. But, when he leaves the compound for good, without even saying a word, it shatters her heart and threatens her magickal control. Now, her powers are manifesting to extreme and dangerous levels, strange whispers, voices, a presence of something otherworldly begins to follow her, upsetting the precarious balance of power she’s holding onto, since Cole abandoned her. In order to keep her magick stable, Mya is forced to accept that the only person she can rely on is herself. Cole wants nothing more than to protect Mya and make her his. No one has ever put the eviscerated parts of him back together like she has and every time he’s with her, she makes him whole, right—but it’s so wrong. He’s too damaged and there’s no room in her life for a destroyed man with dark desires. Sacrifices must be made for the continuation of their race and as an Elder, no one understands that better than him—even if it means losing her, so she can fulfill her destiny as Queen. As more secrets and deceptions are exposed, he must choose to either deny his feelings for Mya or choose to break the laws of his people for one chance at becoming whole. Welcome to their fractured Faerie Tale. Dark, Erotic Paranormal Romance with BDSM Elements…packed with a scorching heat that will leave you wanting for more. Note:This book contains dark sexual elements that may be uncomfortable for some readers and is intended for adults. This is the third novella in a series of four.",
  "genres": [],
  "author": "Riley Bancroft",
  "average_rating": "4.53",
  "url": "https://www.goodreads.com/book/show/24675462-fractures-of-betrayal"
}