{
  "title": "Do the Clearing",
  "description": "The waiting is over—it's time to have the things you want! What if you got along better with your family, your friends, and the people at work? What if you were truly in love? What if you finally lost the weight you've been struggling with and you didn't have to worry so much about money? What if you had a way to work things out so you could really enjoy your life? Restart and redefine yourself Whether it was through luck, serendipity, or some sort of divine intervention, you’ve found yourself here. Where is here? Here is where you take the life you’ve been living and turn it into the one you really want. Do the Clearing is your restart. It’s your chance to make important changes, to make things right, even to reinvent yourself completely. In these pages, John guides you through the 7 steps he uses with his clients to finding, and then letting go of, what’s holding you back. He shows you how to use your surroundings to gain an advantage and how to take the events from your past that have been pushing you toward failure and give them new endings that will inspire you to succeed. There is something better ahead for you Your life can be very different from the way it is now. You can lose weight, you can have relationships that make you happy, and you can feel fulfilled at home and at your job. It isn’t too late to have what you want. It isn’t too hard or whatever else you’ve been led to believe. You are much more than you thought—more powerful, more clever, more resilient—and you’ll see this for yourself once you begin to follow the steps in this book. With Do the Clearing you can: • Let go of repetitive negative thoughts• Leave bad relationships in the past—guilt free!• Feel confident taking action in tough situations• Remove motivation crushers from your life• Increase your ability to resolve conflicts quickly• Have better sex• Get along with the people at work• Replace the thoughts that have you believing you can’t lose weight• Act differently in situations that used to upset you• Let go of unresolved pain from your past• Increase love and happiness in your life• Stick to your goals Your life is the greatest thing there is Do the Clearing and realize the truth. You have tremendous power. Connect with it. Take this chance, start reading, and see for yourself. Click the buy now button at the top of the page and begin creating the life you want today.",
  "genres": [
    "Nonfiction"
  ],
  "author": "John Benz",
  "average_rating": "4.33",
  "url": "https://www.goodreads.com/book/show/24661510-do-the-clearing"
}