{
  "title": "Envy the Night",
  "description": "In this first stand-alone novel from the critically acclaimed Edgar Award-finalist, Michael Koryta fulfills his early promise with a dark and mature novel of a young man trying to escape his past. It has been seven years since Frank Temple III joined the rest of the world in learning his father's bloody secret: The U.S. marshal maintained a covert career as a contract killer, a double-life that ended in suicide to avoid prosecution and prison. The shocking revelation triggered years of anonymous drifting for Frank, time spent running from his legacy and struggling to believe that the father he'd loved so dearly was entirely in the wrong. After all, the victims hadn't been innocents. And Devin Matteson, the man who'd lured his father into the killing game only to later give him up to the FBI, is probably the darkest of the lot. Those are troubling thoughts, and Frank tries to stay away from them. But when an old family friend calls to say that Matteson is returning to the isolated Wisconsin lake that was once sacred ground for their families, it's a homecoming Frank knows he can't allow. His arrival in town reveals a situation far from the expected, though. While Matteson is nowhere to be found, his old cabin is indeed occupied---by a strange, beautiful woman and a nervous man with a gun. When a pair of assassins from Miami arrive on their heels, Frank knows Matteson can't be far behind. And while the wise move would be to call in the police and get out of town fast, that just doesn't feel right. After all, contract killer or not, Frank's father was at heart a teacher. And his son excelled at the lessons. Family secrets, mob hitmen, and a father's shadowy legacy combine to make this Koryta's most compelling thriller yet.",
  "genres": [
    "Mystery",
    "Thriller",
    "Fiction",
    "Mystery Thriller",
    "Suspense",
    "Crime",
    "Audiobook"
  ],
  "author": "Michael Koryta",
  "average_rating": "3.88",
  "url": "https://www.goodreads.com/book/show/2467322.Envy_the_Night"
}