{
  "title": "The Soft Dragons Thunder",
  "description": "The Soft Dragon’s Thunder is a YA Fantasy novel about a young reporter trying to find the culprit behind a fairy kidnapping. From there he discovers a conspiracy so far-reaching, his investigation may change the world. The book is set in a rich modern fantasy world akin to Tolkien’s Middle-Earth, but with a modern twist. Think The Hobbit meets Mickey Boltair. You won’t find anything quite like this unique and intriguing adventure. If you’re interested in a fun read, full of humor, fantasy, adventure, mystery, excitement, and just a little bit of romance, then check out The Soft Dragon’s Thunder.  SYNOPSIS:  Ren is having the worst week of his life. He has a close brush with unemployment over a major spelling error, gets assigned an annoying goblin as an assistant, then finds the girl of his dreams who promptly gets kidnapped. As a sixteen-year-old Elven reporter for gossip magazine The Mythland Reporter, Ren’s in the mood for a little adventure. After convincing his boss to let him write a story about his own private rescue mission, Ren assembles a rag-tag team made up of people he meets along the way. But, the world is a big place, and the rescue sees them stow away on the grandest cruise ship ever constructed, chase leads through the bioluminescent plains of Vuunon, and search the marvelous Fairy cities of Moira. All the while his editor is breathing down his neck to hurry up and send the story.  However, the closer Ren comes to his goal, the more he realizes that this isn’t just about a single kidnapped girl. Her kidnapping is one small piece of a far-reaching conspiracy. And someone in Ren’s group is trying to sabotage the investigation. With danger mounting, Ren begins to wonder if continuing on is even worth it. He’s not sure if he’s risking his life to keep his job, save a girl he just met, or do the right thing. Even if he knew, it may already be too late to turn back.  Still not sold? Read the first half of the book, absolutely free, at the author's website: www.adamwebberbooks.com",
  "genres": [],
  "author": "Adam N. Webber",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/24671981-the-soft-dragons-thunder"
}