{
  "title": "The Dominator",
  "description": "In submission there is sometimes freedom...  The story of Tia & Tommy (Trigger Warning: Non and dubious consent sex, blood, profanity, rough sex. Plus: love, hope, redemption...)  Right after her high school graduation, Tia O’Connor’s father tells her he needs her to save his life by being a marker for a gambling debt for just a few days. Then Tia finds out the truth, that her life is no longer her own, that she’s been chosen to marry the son of a local mafia kingpin, a man whose identity shocks her. Tommy Ferrano likes to play mind games. Tommy likes to play a lot of games. Tia has to obey his rules … or else. Rule 1: He owns her and has full control over her. He wants obedience, he punishes defiance. Rule 2: She needs to keep her mouth shut and reveal nothing to anyone about him. He soon reveals rule #3 to her and begins to reveal his dark and depraved sexual side. Tia has to obey in order to survive. Will it break her? Tommy Ferrano never wanted a wife, never even wanted a girlfriend. Women were just a means to an end, a sexual end. Women were always happy to oblige, sometimes so eager to oblige that he had to go over the edge of consent to get what he really wanted, fear then submission. Tommy needs to get married to get control over something he’s worked very hard for. His father has a specific girl in mind and Tommy isn’t sure why her but the idea of owning a woman wakes up deeper, darker urges in him than ever. The minute he sets eyes on Tia O’Connor he feels something inside of him shift, change. And as he gets to know her, he starts to change even further. But what’s his father’s motivation for picking this girl? What’s his father hiding?  “I know you didn’t choose this but I can’t give you up. I won’t. Don’t ever, ever ask me to. After things settle down I’ll help you have a life you’ll want, but with me, and you have to take all of me. I’ll find you answers about your father, I’ll give you everything your heart wants, everything except freedom from me. Don’t ever ask me for it.”",
  "genres": [
    "Dark",
    "Dark Romance",
    "BDSM",
    "Romance",
    "Erotica",
    "Abuse",
    "Mafia Romance"
  ],
  "author": "D.D. Prince",
  "average_rating": "3.91",
  "url": "https://www.goodreads.com/book/show/24664133-the-dominator"
}