{
  "title": "Useful",
  "description": "Sullivan Moss is useless.Once a charming underachiever, he's now such a loser that he can't even commit suicide properly. Waking up in hospital after falling the wrong way on a rooftop, he comes to a decision. He shouldn't waste perfectly good organs just because they're attached to his head. After a life of regrets, Sully wants to do one useful he wants to donate a kidney to a stranger.As he scrambles over the hurdles to become a donor, Sully almost accidentally forges a new life for himself. Sober and employed, he makes new friends, not least radio producer Natalie and her son Louis, and begins to patch things up with old ones, like his ex-best mate Tim. Suddenly, everyone wants a piece of him.But altruism is not as easy as it seems. Just when he thinks he's got himself together, Sully discovers that he's most at risk of falling apart.From the creator of Offspring comes a smart, moving and wry portrait of one man's desire to give something of himself. 'With characteristic charm, wit and humanity, Debra Oswald has crafted an irresistible story of metamorphosis, as Sullivan Moss evolves from a self-described bag of spare parts to something altogether more whole – and way more complicated. As Sullivan opts in to the mess that is life, Oswald makes the most of every twist and turn, while also finding room for poignancy, insightfulness and the ups and downs that are part of being human.' Nick Earls 'I don't know when I have had the absolute pleasure of immersing myself in a novel as rich and rewarding as Useful. With gimlet eye and boundless heart, Debra Oswald pulls together the threads of disparate lives, including an old dog, a suicidal loser, a narcissistic movie star and a crew of Khmer asbestos removers. Their fates entwine in a plot that is by turns dark and light, brimming with insight, mesmerising, and above all, true. This novel is more than useful, it's absolutely essential.' Geraldine Brooks",
  "genres": [
    "Book Club",
    "Fiction",
    "Contemporary",
    "Humor",
    "Romance",
    "Friendship",
    "Adult"
  ],
  "author": "Debra Oswald",
  "average_rating": "3.63",
  "url": "https://www.goodreads.com/book/show/24671194-useful"
}