{
  "title": "Isolde, Queen of the Western Isle",
  "description": "In the golden time of Arthur and Guenevere, the Island of the West shines like an emerald in the sea—one of the last strongholds of Goddess-worship and Mother-right. Isolde is the only daughter and heiress of Ireland’s great ruling queen, a lady as passionate in battle as she is in love. La Belle Isolde, like her mother, is famed for her beauty, but she is a healer instead of a warrior, “of all surgeons, the best among the isles.” A natural peacemaker, Isolde is struggling to save Ireland from a war waged by her dangerously reckless mother. The Queen is influenced by her lover, Sir Marhaus, who urges her to invade neighboring Cornwall and claim it for her own, a foolhardy move Isolde is determined to prevent. But she is unable to stop them. King Mark of Cornwall sends forth his own champion to do battle with the Irish—Sir Tristan of Lyonesse—a young, untested knight with a mysterious past. A member of the Round Table, Tristan has returned to the land of his birth after many years in exile, only to face Ireland’s fiercest champion in combat. When he lies victorious but near death on the field of battle, Tristan knows that his only hope of survival lies to the West. He must be taken to Ireland to be healed, but he must go in disguise—for if the Queen finds out who killed her beloved, he will follow Marhaus into the spirit world. His men smuggle him into the Queen’s fort at Dubh Lein, and beg the princess to save him.From this first meeting of star-crossed lovers, an epic story unfolds. Isolde’s skill and beauty impress Tristan’s uncle, King Mark of Cornwall, and—knowing nothing of her love for Tristan—he decides to make her his queen, a match her mother encourages as a way to bind their lands under one rule. Tristan and Isolde find themselves caught in the crosscurrents of fate, as Isolde is forced to marry a man she does not love. Taking pity on her daughter, the Queen gives her an elixir that will create in her a passion for King Mark and ensure that their love will last until death. But on the voyage to Ireland, Tristan and Isolde drink the love potion by accident, sealing their already perilous love forever.So begins the first book of the Tristan and Isolde trilogy, another stunning example of the storyteller’s craft from Rosalind Miles, author of the beloved and bestselling Guenevere trilogy.",
  "genres": [
    "Historical Fiction",
    "Fantasy",
    "Fiction",
    "Arthurian",
    "Romance",
    "Historical",
    "Mythology"
  ],
  "author": "Rosalind Miles",
  "average_rating": "3.64",
  "url": "https://www.goodreads.com/book/show/24674.Isolde_Queen_of_the_Western_Isle"
}