{
  "title": "The Golden Thread, The Art of Living Life at the Peak",
  "description": "A collection of practical and metaphysical wisdoms, sourced from contemporary geniuses, throughout a range of expert fields. \"The Golden Thread unlocks the potential of your true self\" Each of us is born with The Golden Thread. The Golden Thread is an archetypal symbol of the guiding light that directs us, leading us on our true path in life. It is this thread that links us to the field of infinite creativity and infinite intelligence. Connecting to the Golden Thread illuminates your soul essence and helps you to find true meaning and purpose in life, so that you may live your life in synergy with your true self. By singing your soul song, you inspire others; and you inspire the world. The Golden Thread holds the power to transform your future. • Discover the extraordinary achievements of contemporary geniuses and experience their magical realities • Re-establish your connection with The Golden Thread to live a high vibrational resonance • Awaken your own inner genius and live life at the peak • Re-connect with your truth and unleash your highest potential • Re-discover your passion for life • Embrace your inner magic and discover a world of infinite possibilities • Re-discover the essence of peak states of consciousness “The Golden Thread gives inspiration to us all to unite as a human family to contribute to the next great phase of human consciousness.” ~ Dr Michael Ellis - Doctor, Buddhist,Global Peace Ambassador Author, Amata Natasha Goldie, has dedicated this book to you, in service to humanity, and our awakening consciousness. “Carpe diem...Seize the day....Make your life an epic adventure...The Golden Thread will infuse you with a passion for life!” ~ Nik Halik - Global Entrepreneur, Astronaut and Extreme Adventurer “The Golden Thread gives inspiration to us all to unite as a human family to contribute to the next great phase of human consciousness” ~ Dr Michael Ellis - Doctor, Buddhist, Global Peace Ambassador “The time is Now to awaken to the true nature of your being” ~ Leopold Soham - Spiritual Teacher, Yogi, Entrepreneur “There is no absolute truth, but rather, each of us has our own inner truths. We can realize the living truth within, through a direct experience with The Golden Thread. It is this that is beyond all forms and concepts. The Golden Thread is more than a book; it is a living entity created out of love and humility with the intention to uplift and awaken readers. In doing so, it will serve humankind.” ~ Joseph Law - CEO of Living Greatness and Bestselling Author “Humanity is now ready for this ancient gem of truth” ~ Neil Goldie - Mystic, Poet, Photographer, Artist “The Golden Thread is the link between the two halves and this links consciousness to the Great Mystery where all divine energy is sourced from. When did you last dance to the song of life?” ~ Sean Alan Caulfield - Artist and Spiritual Teacher “The Golden Thread is an archetypal strand of gold that connects us to our true selves, to our beloveds, and to that which we discover to be home.” ~ Stellamara - Musicians and Composers “The Golden Thread is an extraordinary project with an important mission.” ~Tiara Kumara - Global Planetary Light worker and Founder of Children of the Sun",
  "genres": [],
  "author": "Amata Natasha Goldie",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/24685028-the-golden-thread-the-art-of-living-life-at-the-peak"
}