{
  "title": "King Arthur's Sister in Washington's Court",
  "description": "How sick are you of US politics? How doomed is the world because of who has claimed the Oval Office throne—er, chair? Refresh your spirit by laughing along with what Mark Twain might have written about today’s political falderal. “Solidly entertaining.” —Publishers Weekly WINNER 2016 IBPA Benjamin Franklin Gold Medal for Science Fiction & Fantasy. Morgan le Fay, sixth-century Queen of Gore and the only major character not killed off by Mark Twain in A Connecticut Yankee in King Arthur’s Court, vows revenge upon the Yankee Hank Morgan. She casts a spell to take her to 1879 Connecticut so she may waylay Sir Boss before he can travel back in time to destroy her world. But the spell misses by 300 miles and 200 years, landing her in the Washington, D.C., of 2079, replete with flying limousines, hovering office buildings, virtual-reality television, and sundry other technological marvels. Whatever is a time-displaced queen of magic and minions to do? Why, rebuild her kingdom, of course—two kingdoms, in as Campaign Boss for the reelection of American President Malory Beckham Hinton, and as owner of the London Knights world-champion baseball franchise. Written as though by the old master himself, King Arthur’s Sister in Washington’s Court by Mark Twain as channeled by Kim Iverson Headlee offers laughs, love, and a candid look at American society, popular culture, politics, baseball… and the human heart. Mark Twain began work on A Connecticut Yankee in King Arthur's Court in 1879—the same year the Yankee Hank Morgan departed for his sojourn in sixth-century Britain. The first edition was published in 1889 and features more than 200 illustrations by the man who later would become founder of the Boy Scouts of America, Daniel Carter Beard. These illustrations are now in the public domain, and a handful have been incorporated into King Arthur's Sister in Washington's Court as an artistic homage to this classic edition of the first time travel story in all literature.",
  "genres": [
    "Fantasy",
    "Fiction",
    "Historical Fiction",
    "Science Fiction",
    "Time Travel",
    "Arthurian"
  ],
  "author": "Kim Iverson Headlee",
  "average_rating": "3.49",
  "url": "https://www.goodreads.com/book/show/24691167-king-arthur-s-sister-in-washington-s-court"
}