{
  "title": "What the Duke Wants",
  "description": "What happens when a staid duke with a tragic past meets an accident-prone young lady just waiting for the day when she comes into her inheritance? Anything! What the Duke Wants is everything a Regency romance should be – charming, witty, suspenseful, and above all … sexy. Amy Quinton brings you Book 1 of her spicy new Regency series, Agents of Change.  She is from trade. He is a duke and a spy with a name to restore and a mystery to solve.  England, 1814:  Miss Grace Radclyffe is an oftentimes hilariously clumsy 20-year-old orphan biding her time living with her uncle until she is old enough to come into her small inheritance. Much to her aunt’s chagrin, she isn’t reserved (not with her shocking! tendency to befriend the servants), sophisticated (highly overrated if one cannot run around barefoot outside), or graceful (she once flung her dinner into a duke’s face… by accident, of course).  But she is practical (owning a fashion house is in her future, unless someone foils her plans…) and in love… maybe… perhaps… possibly…  The Duke of Stonebridge is a man with a tragic past. His father died mysteriously when he was twelve years old amid speculation suggesting that the old duke was ‘involved’ with another man. He must restore his family name, but on the eve of his engagement to the perfect debutante, he meets his betrothed’s cousin, and his world is turned inside out... No matter; he is always logical (men who follow their hearts and not their heads are foolish) and reserved (his private life is nobody’s business but his own). He isn’t impulsive (it always leads to trouble), charming (that’s his best friend, the Marquess of Dansbury’s, area of expertise).  Or in love… maybe… perhaps… possibly…  Can he have what he wants and remain respectable? Can she trust him to be the man she needs?  Content Notes: Spicy, Historical, Regency, Suspense",
  "genres": [
    "Historical Romance",
    "Historical",
    "Regency",
    "Romance",
    "Regency Romance",
    "Historical Fiction",
    "Amazon"
  ],
  "author": "Amy Quinton",
  "average_rating": "3.93",
  "url": "https://www.goodreads.com/book/show/24688706-what-the-duke-wants"
}