{
  "title": "Berezina",
  "description": "En octobre 1812, piégé dans Moscou en flammes, Napoléon replie la Grande Armée vers la France. Commence La retraite de Russie, l'une des plus tragique épopée de l'Histoire humaine. La Retraite est une course à La mort, une marche des fous, une échappée d'enfer. Deux cents ans plus tard, je décide de répéter l'itinéraire de l'armée agonisante, de ces cavaliers désarçonnés, de ces fantassins squelettiques, de ces hommes à plumets qui avaient préjugé de l'invincibilité de l'Aigle. Il ne s'agit pas d'une commémoration (commémore-t-on l'horreur ?), encore moins d'une célébration, il s'agit de saluer par-delà les siècles et les verstes, ces Français de l'an XII aveuglés par le soleil corse et fracassés sur les récifs du cauchemar. Le géographe Cédric Gras, le photographe Thomas Goisque et deux amis russes, Vassili et Vitaly, sont de la partie. Pour l'aventure, nous enfourchons des side-cars soviétiques de marque Oural. Ces motocyclettes redéfinissent en permanence les lois élémentaires de la mécanique. Rien ne saurait les arrêter (pas même leurs freins). Notre escouade se compose de trois Oural, chargées ras la gueule de pièces détachées et de livres d'Histoire. Au long de quatre mille kilomètres, en plein hiver, nous allons dérouler le fil de la mémoire entre Moscou et Paris où l'Empereur arrivera le 15 XII 1812, laissant derrière lui son armée en lambeaux. Le jour, les mains luisantes de cambouis, nous lisons les Mémoires du général de Caulaincourt. Le soir, nous nous assommons de vodka pour éloigner les fantômes. A l'aube, nous remettons les gaz vers une nouvelle étape du chemin de croix. Smolensk, Minsk, Berezina, Vilnius : les stèles de la souffrance défilent à cinquante à l'heure. Partout, nous rencontrons des Russes qui ne tiennent aucune rigueur à l'Empereur à bicorne. Sous nos casques crénelés de stalactites, nous prenons la mesure des tourments des soldats et nous menons grand train ce débat intérieur : Napoléon était-il un antéchrist qui précipita l'Europe dans l'abîme ou bien un visionnaire génial dont le seul tort fut de croire qu'il suffisait de vouloir pour triompher, et que les contingences se pliaient toujours aux rêves ? Mais très vite, nous devons abandonner ces questions métaphysiques car un cylindre vient de rendre l'âme, la nuit tombe sur la Biélorussie et trois foutus camions polonais sont déjà en travers de la route.",
  "genres": [
    "Travel",
    "Nonfiction",
    "History",
    "Russia",
    "France",
    "French Literature",
    "Adventure"
  ],
  "author": "Sylvain Tesson",
  "average_rating": "3.88",
  "url": "https://www.goodreads.com/book/show/24683905-berezina"
}