{
  "title": "Delayed Penalty",
  "description": "Library Journal raves that readers “looking for heartfelt romance will feel the warmth emanating from this page-turner,” Sophia Henry’s debut featuring the Detroit Pilots, a hockey team full of complicated men who fight for love.Auden Berezin is used to losing her father, her mother, her first love. Now, just when she believes those childhood wounds are finally healing, she loses something the soccer scholarship that was her ticket to college. Scrambling to earn tuition money, she’s relieved to find a gig translating for a Russian minor-league hockey player—until she realizes that he’s the same dangerously sexy jerk who propositioned her at the bar the night before.Equal parts muscle and scar tissue, Aleksandr Varenkov knows about trauma. Maybe that’s what draws him to Auden. He also lost his family too young, and he channeled the pain into his first hockey, then vodka and women. But all that seems to just melt away the instant he kisses Auden and feels a jolt of desire as sudden and surprising as a hard check on the ice.After everything she’s been through, Auden can’t bring herself to trust any man, let alone a hot-headed puck jockey with a bad reputation. Aleksandr just hopes she’ll give him a chance—long enough to prove he’s finally met the one who makes him want to change.Praise for Delayed Penalty“ Delayed Penalty is sexy, fun, and full of angst. Not only does Aleksandr dominate the ice, but he fights for what he wants outside of the rink as well. I will definitely read it again!” — New York Times bestselling author L. P. Dover“ Delayed Penalty is such a rush! Everything I love about the New Adult genre is right a captivating premise, a fresh new setting, and a scorching hot hero who constantly keeps you guessing. The romance is off the charts and Sophia Henry tackles real issues that tug at your heartstrings.” — New York Times bestselling author Rachel Harris“Hot Russian hockey player meets feisty tutor? Yes, please! I loved watching Aleksandr and Auden work through their broken pasts together. Delayed Penalty is a unique New Adult romance that packs an emotional punch.” —Cindi Madsen, USA Today bestselling author of Getting Lucky Number Seven“Auden and her hot Russian hockey god, Aleksandr, really heat up the pages in Delayed Penalty —a touching story about growing up, moving forward, and ultimately finding love.” —Renita Pizzitola, author of Just a Little Kiss“Henry’s debut novel evokes the image of a culture characterized by a stoic exterior, only to reveal deep love as the characters dissolve their emotional walls from the inside out.” — Library Journal“I really, really liked the premise of Delayed Penalty and I thought the characters were fun.” —Heather’s Book Chatter“This was a fun book to read. In addition to being a hockey fan, I’m a sucker for guys who can speak a foreign language. And Aleksander is hot.” —Pages of Comfort“Those who love their hockey romances will enjoy Delayed Penalty .” —Making It Happen“I recommend Delayed Penalty for new adult romance lovers looking for a sexy and fun story. Plus who doesn’t love a hero with a sexy Russian accent?” —Reading in Pajamas“I can’t wait for the next one.” —Book Magic",
  "genres": [
    "Sports",
    "Romance",
    "Sports Romance",
    "New Adult",
    "Hockey",
    "Contemporary",
    "Contemporary Romance"
  ],
  "author": "Sophia Henry",
  "average_rating": "3.62",
  "url": "https://www.goodreads.com/book/show/24683240-delayed-penalty"
}