{
  "title": "Μάρκος Βαμβακάρης: Αυτοβιογραφία",
  "description": "«Τράβηξε η καρδιά μου να γράψω την ιστορία μου. Θέλω να την ιδώ γραμμένη και να τη διαβάσω απ' την αρχή ως το τέλος σα να ήταν κάποιου άλλου. Πιστεύω πως έτσι θα ξεθυμάνει το φούσκωμα της καρδιάς που μου σταλάξανε τόσα πολλά και διάφορα, τέτοια που ο καθένας δεν θα ήθελε να τα 'χει στη δική του την ιστορία. Έχω σκοπό να τη δημοσιέψω κιόλας την ιστορία μου.Η χριστιανή που μου κάνει το γραμματικό λέει πως οι πρώτοι χριστιανοί ξεμολογιόντουσαν δυνατά, μπρος σε όλο τον κόσμο, κι όλος ο λαός τους συγχωρούσε και ξαλάφρωναν για καλά. Όμως τώρα ο κόσμος είναι χαλασμένος και ξέρω πως σήμερα θα βρεθούνε πολλοί που θα σκεφτούνε πως έπρεπε να ντραπώ να ομολογήσω πολλά πράματα. Εγώ θα πάρω το θάρρος τους τέτοιους να μη τους λογαριάσω. Ο άνθρωπος για να λέγεται αληθινός άνθρωπος, πρέπει να μπορεί να 'ρθει και στη θέση του άλλου, του ομοίου του. Γιατί απ' όσα θα σας πω και τα παθήματα και τα φταιξίματα ίδια είναι. Και τα φταιξίματα είναι κι αυτά παθήματα.Δεν εγεννήθηκα κακός ούτε σκέφτηκα ποτές μου να φχαριστηθώ άμα λυπηθεί ο άλλος. Δεν εγεννήθηκα κακός, ούτε για να ζήσω τη ζωή μου όπως την έζησα. Και γι' αυτό παίρνω το θάρρος να εκθέσω τα αμαρτήματά μου στον κόσμο. Σε έναν κόσμο που εγώ πρώτος του τραγούδησα τις χαρές και τις λύπες του, τα πλούτη και τη φτώχεια του, την ορφάνια του και την ξενιτιά του.Αυτός ο κόσμος θέλω να γίνει ο εξομολόγος μου και πιστεύω ότι όλοι αυτοί για τους οποίους έχω γράψει και γράφω μα και θα γράφω εκατοντάδες τραγούδια, θα με συγχωρέσουν, μια και αυτός είναι ο σκοπός της περιγραφής και εξιστορήσεως της ζωής μου, δηλαδή η συγνώμη και η συγχώρεση. Γι' αυτό όσοι θα διαβάσετε την ιστορία μου, φίλοι ή ξένοι, γνωστοί ή άγνωστοι, και μάλιστα οι γνωστοί μου, να 'ρθητε να μου σφίξτε το χέρι και να μου πήτε ένα ανοιχτόκαρδο γεια σου. Να μου πείτε πως όλα περάσανε, ότι όλα αυτά ανήκουν πλέον στο παρελθόν. Να μου πείτε πως αν ζούσατε την ίδια ζωή με μένα, τα ίδια θα παθαίνατε και τα ίδια θα κάνατε.Τώρα όλα αυτά βέβαια ανήκουν στο παρελθόν, και την παλιά μου ζωή τη θυμάμαι σαν ένα κακό όνειρο που όταν θα το ιδείς τινάζεσαι από το κρεβάτι σου. Έτσι περίπου τινάζομαι όταν αναπολώ την περασμένη μου ζωή και θυμηθώ τις κακές στιγμές της...» Με τις πηγές του στα λιμάνια της Ανατολικές Μεσογείου του 19ου αιώνα, το λαϊκό μας τραγούδι, το τραγούδι της ελληνικής εργατιάς, κάνει την εμφάνισή του στον Πειραιά τα πρώτα τριάντα χρόνια του αιώνα μας, φουντώνει κι ακμάζει απ' το 1930 ως το 1950, κι από κει και πέρα ξεφτίζει. Μια επαρκής μελέτη της εξέλιξης του λαϊκού τραγουδιού, ή μια σωστή εισαγωγή στη ζωή του Μάρκου, πρέπει να καταπιαστεί με το δύσκολο θέμα της διαλεκτικής σχέσης της δημιουργίας του τραγουδιού και της αποδοχής του και χρήσης του από το κοινό του. Ακόμη και η σκιαγράφηση αυτού του φαινομένου παίρνει τεράστιες διαστάσεις. Χρειαζόμαστε ιστορικό βάθος. Ποιά ήταν π.χ. η ζωή της ελληνικής και μη ελληνικής εργατιάς στα λιμάνια της Πόλης, της Σμύρνης κλπ.; Χρειαζόμαστε ιστορική και λαογραφική δουλειά, όχι μόνο για τα λιμάνια της Οθωμανικής Αυτοκρατορίας αλλά και για τα λιμάνια του Ελληνικού κράτους, ιδίως τη Σύρα και τον Πειραιά. Χρειάζεται ειδική μουσικολογική ανάλυση των διαφόρων συνθετών και στυλ καθώς και έρευνα των ανατολικών και δυτικών στοιχείων. Τέλος χρειαζόμαστε μελέτη των συμβόλων και της γλώσσας των τραγουδιών και συσχέτισή τους με την κοινωνική εξέλιξη του λαού μας. Αν θέλουμε βέβαια να συνειδητοποιήσουμε τη σημασία της εξέλιξης του λαϊκού τραγουδιού από βαρύ ζεμπέκικο σε συρτάκι, κι από τον τεκέ στις αμερικανικού τύπου τηλεοπτικές διαφημίσεις της Ολυμπιακής, θα πρέπει να το μελετήσουμε όχι μόνο σαν την κατ' εξοχήν τέχνη της εργατιάς μας, αλλά σε συσχέτιση με την τέχνη, τις ανάγκες και τα ενδιαφέροντα του \"Έλληνα αστού\"· κι αυτά όλα σε σχέση με την ιστορία μας και την θέση μας στην παγκόσμιο σκηνή.ΚΑΙΛ-ΒΕΛΛΟΥ ΑΓΓΕΛΙΚΗ",
  "genres": [
    "Biography",
    "Greece",
    "Art",
    "Music"
  ],
  "author": "Μάρκος Βαμβακάρης",
  "average_rating": "4.10",
  "url": "https://www.goodreads.com/book/show/24699926"
}