{
  "title": "The Pisces Affair",
  "description": "CIA operative Jordan Jakes, the heroine of Daco's Amazon #1 Bestseller, The Libra Affair, meets Prometheus when U.S. Secretary of State becomes the target of a terrorist attack at a head-of-state dinner in Dubai. Posing as the fiance of top-ranking government official and ex-Navy Seal, Jordan must identify the assassin and stop an unimaginable act of evil. Will Jordan be able to stop the act in time? And what role does Prometheus play in the conspiracy? The Pisces Affair is a unique blend of spy thriller and sci-fi.  A short story from The Prometheus Saga.   INTERVIEW WITH THE AUTHOR   Q - What is The Prometheus Saga?  A - In The Prometheus Saga, twelve authors unite to interpret how an alien presence would interact with the human condition over a time period that spans from the dawn of man to the present. The stories cross genres and genders, allowing for entirely different narratives and insights on historical events and the human experience.  Q - Where should a reader start when selecting a short story to read in The Prometheus Saga?  A - Each story is self-contained and can be read in any order. The reader is free to select any of the stories at random to begin their experience. Each short story has a different setting in history. The book description will explain the time period setting for each particular story.  Q - What is this alien probe?  A - An alien civilization landed a probe on Earth at the dawn of mankind. This probe, a form of artificial intelligence, can morph into any human form, take on any human identity, either male or female. Its life spans hundreds of thousands of years. Its mission is to report everything it can about us to its home planet. What this humanoid observes and learns over centuries of human existence will be interpreted through each short story in the saga. The alien probe is as mythic as Prometheus, the Greek Titan who was said to have brought fire to mankind.   About the Author   Raised in Huntsville, Alabama, Daco is a member of the International Thriller Writers, Romance Writers of America, Author’s Guild, and the Alabama State Bar. She is the author of The Libra Affair (April, 2013), an international spy thriller featuring CIA agent Jordan Jakes. The Libra Affair was an Amazon #1 Bestseller of Suspense, Romantic Suspense, and Romance in September, 2013. The novel was also included in a limited-time only Suspense bundle entitled Racing Hearts: 10 thrilling suspense novels released in July, 2014. The sequel, The Scorpio Affair, will be released soon.  PRAISE FOR The Libra Affair  “A complex spy game, rather like a Jason Bourne movie – only instead of the usual male secret agent, we get Jordan Jakes. And she is more than capable of rocking your world.” ~ RT Book Reviews  “Daco’s romantic thriller debut intrigues with fast-paced, high-stakes action that forces the take charge heroine to balance her clandestine mission with obligations to her heart … The keenly sharp intelligent female characters soar in this edge-of-your-seat adventure …” ~ Publishers Weekly  Visit Daco at www.authordaco.com, Twitter @AuthorDaco, and her author Facebook page “Daco.”",
  "genres": [],
  "author": "Daco.",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/24695990-the-pisces-affair"
}