{
  "title": "Marathon",
  "description": "The date is 490 BC, the place, the Plains of Marathon, a day's march from Athens. Here has come the fleet of the invading Persians, to be met by the citizen soldiers of Athens and their few allies. Part of the Athenian Army is the playwright Aeschylus and his brother, Cynegeirus. And a stranger by the name of Akakios, a curious man who seems interested in anything and everything. Here will be decided the future of civilization. Tyranny or democracy.A short story from The Prometheus Saga.INTERVIEW WITH THE AUTHORQ - What is The Prometheus Saga?A - In The Prometheus Saga, twelve authors unite to interpret how an alien presence would interact with the human condition over a time period that spans from the dawn of man to the present. The stories cross genres and genders, allowing for entirely different narratives and insights on historical events and the human experience.Q - Where should a reader start when selecting a short story to read in The Prometheus Saga?A - Each story is self-contained and can be read in any order. The reader is free to select any of the stories at random to begin their experience. Each short story has a different setting in history. The book description will explain the time period setting for each particular story.Q - What is this alien probe?A - An alien civilization landed a probe on Earth at the dawn of mankind. This probe, a form of artificial intelligence, can morph into any human form, take on any human identity, either male or female. Its life spans hundreds of thousands of years. Its mission is to report everything it can about us to its home planet. What this humanoid observes and learns over centuries of human existence will be interpreted through each short story in the saga. The alien probe is as mythic as Prometheus, the Greek Titan who was said to have brought fire to mankind. About the AuthorDoug Dandridge is the author of over twenty self-published books on Amazon, including the very successful, Empires at War series, the Refuge techno-fantasy series, The Deep Dark Well Trilogy, as well as numerous standalone science fiction and fantasy novels. His Exodus series had consistently hit the top ten in Space Opera, Military Science Fiction, and Space Fleet on both Amazon.US and Amazon.UK. In a two year period as a self-published author, Doug has sold over one hundred thousand ebooks, plus numerous copies of paperback and audio books. He has amassed over 1,600 reviews across his books on Amazon, with a 4.5 star average. He served in the US Army as an infantryman, as well as several years in the Florida National Guard in the same MOS. Doug, who holds degrees from Florida State University and the University of Alabama, lives with his five cats in Tallahassee Florida. He is a sports enthusiast and regularly attends local university sports, including football, soccer, men’s and women’s basketball and volleyball.",
  "genres": [
    "Science Fiction"
  ],
  "author": "Doug Dandridge",
  "average_rating": "3.31",
  "url": "https://www.goodreads.com/book/show/24695944-marathon"
}