{
  "title": "Midnight and Noonday: Or, The Incidental History of Southern Kansas and the Indian Territory,: Giving Twenty Years Experience on the Frontier ...and Incidents Happening in and Around Caldwell, Kansas",
  "description": "From the \"The notoriety obtained by Caldwell, \"Queen of the Border,\" not only at home, but far away in Eastern States, is such that the public, seeing in newspapers deeds of daring and bloodshed, are led to wonder if such things are merely fiction and '' nothing more.\"\"The inquisitive mind will naturally want to learn the particulars, thinking thereby to discover the true from the false, or the straight veracity from the fictitious. Many of the events herein chronicled have been done so for the first time, while several have been imperfectly published in the newspapers of the land. It has been my utmost endeavor in this book to ascertain the real facts and particulars of events before publishing the same. Realizing the fact that \"truth is stranger than fiction,\" and that the historical student is after only that kind of history, the title of my book, \"Midnight and Noonday,\" is in itself suggestive of a conclusion. There is presumed to be no darker time than midnight or no brighter time than noonday. The early history of all countries seems to be fraught with peril, daring and bloodshed. And especially is this true of border towns. The desperado is social in his nature, courts danger and strives to conquer. The town affords him an opportunity to gratify all of his attributes ; the saloon in which to be social, the drunken brawl in which he finds danger, and the civil law and her officers to conquer.\"I give the reader deeds of crime and dark deeds of horror as \"Midnight,\" and the beautiful country of the plains and the grand \"Queen of the Border,\" as they are seen to-day, as \"Noonday.\"This pre-1923 publication has been converted from its original format for the Kindle and may contain an occasional defect from the original publication or from the conversion.",
  "genres": [],
  "author": "George Doud Freeman",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/24702142-midnight-and-noonday"
}