{
  "title": "Tales from the Kansas City Chiefs Sideline: A Collection of the Greatest Chiefs Stories Ever Told",
  "description": "Beginning with their founding as the Dallas Texans of the American Football League in 1960, the Kansas City Chiefs have been one of professional football’s most storied franchises. In Tales from the Kansas City Chiefs Sideline , veteran sportswriter Bob Gretz brings the team’s rich history to life.Gretz begins with the Chiefs’ visionary, 27-year-old owner Lamar Hunt, who founded not only a team but an entire league. After the Texans won the AFL championship in 1962, Hunt moved the team out of his hometown to Kansas City. Two Super Bowl appearances as the representative of the AFL culminated in a Chiefs’ championship in 1970, despite being a double-digit underdog to the Minnesota Vikings. It would be the final game featuring an AFL team, as the Chiefs and nine other teams merged with the NFL. Gretz covers the battles leading up to the merger along with the high and low points in team history—the lean years (1972–88); the “Carl and Marty” era, when the team made the play-offs in six consecutive seasons; the “Joe and Marcus” show of 1993; the dismal 2008 season; and the team’s 2013 renewal under Andy Reid and John Dorsey.Tales from the Kansas City Chiefs Sideline is a must-have for any Chiefs fan!Skyhorse Publishing, as well as our Sports Publishing imprint, are proud to publish a broad range of books for readers interested in sports—books about baseball, pro football, college football, pro and college basketball, hockey, or soccer, we have a book about your sport or your team.Whether you are a New York Yankees fan or hail from Red Sox nation; whether you are a die-hard Green Bay Packers or Dallas Cowboys fan; whether you root for the Kentucky Wildcats, Louisville Cardinals, UCLA Bruins, or Kansas Jayhawks; whether you route for the Boston Bruins, Toronto Maple Leafs, Montreal Canadiens, or Los Angeles Kings; we have a book for you. While not every title we publish becomes a New York Times bestseller or a national bestseller, we are committed to publishing books on subjects that are sometimes overlooked by other publishers and to authors whose work might not otherwise find a home.",
  "genres": [],
  "author": "Bob Gretz",
  "average_rating": "4.03",
  "url": "https://www.goodreads.com/book/show/24693710-tales-from-the-kansas-city-chiefs-sideline"
}