{
  "title": "Ever After",
  "description": "Two mysterious women convey the same Cinderella story to Giambattista Basile in 1594 and Jacob and Wilhelm Grimm in 1811. How different cultures retell this story reveals humanity’s soul to those who listen.  A short story from The Prometheus Saga.   INTERVIEW WITH THE AUTHOR   Q - What is the Prometheus Saga?  A – The next step in independent publishing. In the Prometheus Saga, twelve authors unite to interpret how an alien presence could have interacted with humanity from the dawn of man to the present. The stories cross genres and genders, providing different narratives and insights on historical events and the human experience.  Q - Where should a reader start when selecting a short story to read in The Prometheus Saga?  A - Each story is self-contained and can be selected at random and read in any order. Each short story has a different historical setting. The story description will explain the setting for each story.  Q - What is this alien probe?  A - An alien civilization landed a probe on Earth at the dawn of mankind. This probe, a form of artificial intelligence, can morph into any human form and take on human identity, male or female. Its mission, which spans thousands of years, is to report everything it can about us to its home planet. What it observes and learns over centuries of human contact will be interpreted through each short story in the saga. The alien probe is as mythic as the Greek Titan who brought fire to mankind.   About the Author   M.J. Carlson lives and writes in Melbourne, Florida. His science fiction/suspense novel, Changed, was released in ebook form in 2014 and is available through Amazon, Barnes & Noble, Smashwords, iBooks, and Kobo. The paperback edition and his next enovel, Naturan Selection are expected in 2015. His first, unpublished novel, The Alien Who Fell, and an unpublished short story, Wish Upon a Falling Star were finalists in their respective catagories in the Florida Writers Association’s RPLA contest. His short stories, A Simple Breach of Etiquette and Paradox Effect received honorable mentions in the international Writers of the Future competition in 2012 & 2013.  “There’s so many books that we could be reading, many of which don’t even bother to carry our attention past the first chapter. This is something that Changed succeeds in.”—J. Gregoire, Reader  Readers are encouraged to visit M.J. at www.mjcarlson.com for updates on his writing, speaking engagements, and musing on anything that grabs his fancy and where he mostly stops referring to himself in thrid person.",
  "genres": [],
  "author": "M.J. Carlson",
  "average_rating": "4.63",
  "url": "https://www.goodreads.com/book/show/24695971-ever-after"
}