{
  "title": "America: Nation of the Goddess: The Venus Families and the Founding of the United States",
  "description": "Explores how a secret cabal of influential families has shaped the United States according to the principles of sacred geometry and Goddess veneration• Exposes the esoteric influences behind the National Grange Order of Husbandry• Examines the sacred design and hidden purpose of the Washington Monument• Reveals how the three obelisks in New York City depict the stars of Orion’s Belt• Explains how every baseball diamond is actually a temple to the GoddessIn Nation of the Goddess , Alan Butler and Janet Wolter reveal how a secret cabal of influential “Venus” families with a lineage tracing back to the Eleusinian Mysteries has shaped the history of the United States since its founding. The evidence for such incredible assertions comes from American institutions such as the National Grange Order of Husbandry and from the man-made landscape of the United States where massive structures and whole cities conform to an agenda designed to elevate the feminine within religion and society.The authors explain how the Venus families, working through the Freemasons and later the Grange, planned the American Revolution and the creation of the United States. It was this group who set the stage for the Founding Fathers to create Washington, D.C., according to the principles of sacred geometry, with an eye toward establishing the New Jerusalem. The authors explore the sacred design of the Washington Monument, revealing its occult purpose and connections to the heavens. They reveal how the obelisks in New York City depict the stars of Orion’s Belt just like the Giza pyramids and how the site of one of them, St. Paul’s Chapel, is the American counterpart to Rosslyn Chapel in Scotland. Exposing the strong esoteric influences behind the establishment of the Grange in the United States, they connect this apparently conservative order of farmers to the Venus families and trace its lineage back to the Cisterians, who were a major voice in the promotion of the Crusades and the establishment of the Knights Templar.The authors conclude with the startling revelation that nearly every city in America has a temple to the Goddess hidden in plain sight--their baseball diamonds--exposing the extent to which the Venus families are still at work behind the scenes.",
  "genres": [
    "Nonfiction",
    "American History",
    "Alternate History"
  ],
  "author": "Alan Butler",
  "average_rating": "3.86",
  "url": "https://www.goodreads.com/book/show/24692863-america"
}