{
  "title": "Manteo: A Speculative History Mystery Short Read",
  "description": "In 1587, Croatoan Manteo returns from London to Roanoke Island, Virginia. Can he reconcile his strong loyalty to the untamed land and people of his home with his desire for the benefits the colonizing English bring with them before one of them destroys the other?  A short story from The Prometheus Saga.   INTERVIEW WITH THE AUTHOR   Q - What is The Prometheus Saga?  A - In The Prometheus Saga, twelve authors unite to interpret how an alien presence would interact with the human condition over a time period that spans from the dawn of man to the present. The stories cross genres and genders, allowing for entirely different narratives and insights on historical events and the human experience.  Q - Where should a reader start when selecting a short story to read in The Prometheus Saga?  A - Each story is self-contained and can be read in any order. The reader is free to select any of the stories at random to begin their experience. Each short story has a different setting in history. The book description will explain the time period setting for each particular story.  Q - What is this alien probe?  A - An alien civilization landed a probe on Earth at the dawn of mankind. This probe, a form of artificial intelligence, can morph into any human form, take on any human identity, either male or female. Its life spans hundreds of thousands of years. Its mission is to report everything it can about us to its home planet. What this humanoid observes and learns over centuries of human existence will be interpreted through each short story in the saga. The alien probe is as mythic as Prometheus, the Greek Titan who was said to have brought fire to mankind.   About the Author   ELLE ANDREWS PATT is a married mother of two unschooled daughters now thriving in high school and at university. She is also an award-winning writer of speculative and literary short fiction. Her work has been published in magazines such as The Rag, Solarcide, and Saw Palm, as well as two anthologies. She is currently seeking representation for her paranormal murder mystery, Billie Mae and completing a literary novel set on Beech Mountain.  To read her short fiction and samples of her novel, please visit Elle at www.elleandrewspatt.com You can also connect with Elle at Facebook: Elle Andrews Patt, The Prometheus Saga, The Alvarium Experiment Twitter: @LAndrewsPatt",
  "genres": [],
  "author": "Elle Andrews Patt",
  "average_rating": "4.25",
  "url": "https://www.goodreads.com/book/show/24695964-manteo"
}