{
  "title": "First World War",
  "description": "Ice Age Europe, 40,000 years ago. Two species of human, Homo sapiens and Homo neanderthalensis, clash in a desperate battle for ownership of the future. Bran, an alien probe sent by a distant intelligence to join human society, is caught in the middle of the first world war, and finds himself alongside Etaa the Ugly, the woman cast out from both sides. A searing tale of hatred and love, \"First World War\" explores what makes one truly human, and the fates of vastly different societies once they confront each other.  A short story from THE PROMETHEUS SAGA.   INTERVIEW WITH THE AUTHOR   Q - What is The Prometheus Saga?  A - In The Prometheus Saga, twelve authors unite to interpret how an alien presence would interact with the human condition over a time period that spans from the dawn of man to the present. The stories cross genres and genders, allowing for entirely different narratives and insights on historical events and the human experience.  Q - Where should a reader start when selecting a short story to read in The Prometheus Saga?  A - Each story is self-contained and can be read in any order. The reader is free to select any of the stories at random to begin their experience. Each short story has a different setting in history. The book description will explain the time period setting for each particular story.  Q - What is this alien probe?  A - An alien civilization landed a probe on Earth at the dawn of mankind. This probe, a form of artificial intelligence, can morph into any human form, take on any human identity, either male or female. Its life spans hundreds of thousands of years. Its mission is to report everything it can about us to its home planet. What this humanoid observes and learns over centuries of human existence will be interpreted through each short story in the saga. The alien probe is as mythic as Prometheus, the Greek Titan who was said to have brought fire to mankind.   About the Author   KEN PELHAM lives and writes in Maitland, Florida. The author of two Royal Palm Literary Award-winning thriller novels (BRIGANDS KEY and PLACE OF FEAR), he is a member of International Thriller Writers and Florida Writers Association. BRIGANDS KEY has won critical praise as \"a perfect storm of menace...breathtaking!\" (the Florida Weekly). He's garnered acclaim as a short story writer, penning award winners such as \"The Light Keeper\" and \"The Wreck of the Edinburgh Kate,\" and writes nonfiction about suspense fiction and related topics on his website, kenpelham.com .  Thanks for dropping by, and reviews are always welcome!",
  "genres": [
    "Science Fiction"
  ],
  "author": "Ken Pelham",
  "average_rating": "4.40",
  "url": "https://www.goodreads.com/book/show/24695965-first-world-war"
}