{
  "title": "Almost Anywhere: Road Trip Ruminations on Love, Nature, National Parks, and Nonsense",
  "description": "At twenty-eight years old, Krista Schlyer sold almost everything she owned and packed the rest of it in a station wagon bound for the American wild. Her two best friends joined her—one a grumpy, grieving introvert, the other a feisty dog—and together they sought out every national park, historic site, forest, and wilderness they could get to before their money ran out or their minds gave in.The journey began as a desperate escape from urban isolation, heartbreak, and despair, but became an adventure beyond imagining. Chronicling their colorful escapade, Almost Anywhere explores the courage, cowardice, and heroics that live in all of us, as well as the life of nature and the nature of life.This eloquent and accessible memoir is at once an immersion in the pain of losing someone particularly close and especially young and a healing journey of a broken life given over to the whimsy and humor of living on the road.Almost Anywhere will appeal to outdoor lovers, armchair travelers, and anyone struggling to find a way forward in life.Early Reviews:“Outstanding, wry, heart-wrenching and healing. Those words describe Almost Anywhere, which hits the bull’s-eye as a cross between Wild and Let’s Pretend This Never Happened. Krista’s unique voice will draw you in and take you on journey to the intersection of unfathomable grief and the healing power of wanderlust.” —Michelle Theall, author of Teaching the Cat to Sit \"Brave, beautiful, and utterly captivating, Almost Anywhere breaks your heart and puts it back together again on a long and often arduous road trip across an America where the uncertain future is always just beyond the horizon and the immutable past rushes at you without remorse. Measuring the sharpness of loss against the hugeness of life, Krista Schlyer has found her way, page by page, to a rare state of grace. An amazing book.\" –William Souder, author of Under a Wild Sky, A Plague of Frogs and On a Farther Shore.",
  "genres": [
    "Travel",
    "Memoir",
    "Nonfiction",
    "Outdoors",
    "Nature",
    "Adventure",
    "Biography"
  ],
  "author": "Krista Schlyer",
  "average_rating": "3.91",
  "url": "https://www.goodreads.com/book/show/24693936-almost-anywhere"
}