{
  "title": "the almost perfect plot",
  "description": "The Almost Perfect Plot is a black humour thriller and quite accurately described by the title. The story revolves around the main character who happens to be called Thomas Hardy, (no, not that one, this one is a truly awful writer!), who has a very mundane life but this all changes and not always for the better! As he finds himself buried alive, pursued by the police as well as his ex-wife and a serial killer, he often wishes he was still a writer of instructions books for anything from flat pack furniture to car sun roofs. He has always had aspirations to write great literary works, but as he seeks material for the life changing plot to his debut novel, life starts to imitate fiction. It all starts when, having been kicked out of his house in the course of his divorce, he decides it is time to make a new start and fulfil the potential he has always believed he holds. Having moved abroad to the south of France, (a task which ended up being far more challenging than he had planned for!), in search of a change of lifestyle, he seeks inspiration in vain until a retired English policeman befriends him. Retired policeman Fred Williams persuades him to write crime fiction based on a real case that Fred himself had worked on but never solved. Tom abandons thoughts of prize winning literature and takes Fred up on his offer. However, struggling for realism in his story, Tom decides to act out the crime he is trying to write about so he can better get the feel of it, and in the process stumbles onto the scene of a real life killing. As the only witness to the crime, the serial killer has no choice but to try and get rid of our hapless hero, only by a series of twists and coincidences this proves to be harder than the killer could have imagined. The coincidences that save our hero also implicate Tom himself as the police try to catch the perpetrator, on top of which Tom has an ex-wife who is trying to hound him, and this was definitely not a good time to fall in love! The Almost Perfect Plot is available in paperback or ebook from Amazonhttp://www.amazon.com/Mr-Ed-Halliday/...",
  "genres": [],
  "author": "Ed Halliday",
  "average_rating": "3.54",
  "url": "https://www.goodreads.com/book/show/24713919-the-almost-perfect-plot"
}