{
  "title": "False Start",
  "description": "Vowing to never follow her heart again, Meg Fulton keeps men at a safe distance. But retired NFL player Connor McKay manages to crack Meg’s defenses, and she discovers the sports-loving alpha male is much more than a sexy package wrapped in great biceps and a tight rear end. False Start, Book 1 of Marianne Rice’s new romance series will be a welcome addition to your romance library.Ex-NFL player turned high school football coach, Connor McKay is well loved by all … except by the sexy principal who wants to make changes to his athletic program. Intrigued by Meg Fulton’s beauty and intelligence, Connor doesn’t mind going head-to-head with her. When he and Meg are set up on a blind date, he’s finally able to open a crack in Meg’s high emotional wall and see the caring woman inside. What Connor doesn’t expect is that his buddy and ex-teammate is the one responsible for Meg’s wall in the first place. To choose between a one-time brother and the woman he’s fallen hopelessly in love with, Connor will make the riskiest play of his life.Always the misfit growing up, newly hired high school principal Meg Fulton uses a fashionable wardrobe and a sharp tongue to keep men at a safe distance. After a drunken, abusive experience in the back of a Chevy as a naïve teen, she became a single mother with a tough hide…until Connor McKay walks into the picture. She can’t stand him. He’s a sports-loving alpha male––no thanks! Meg has a good reason to hate jocks. Been there, done that, much to her regret. But as her path continues to cross with Connor’s, and attraction heats to a boiling point, Meg learns there’s more to Connor than biceps and a tight rear end. Things are heating up with them, when someone from her past threatens to tear them apart. Meg runs for cover…and from Connor. It will take a leap of love for Meg to shed the scars of her past and let love into her life.Content Sweet, Contemporary, Sports, Athletes",
  "genres": [
    "Sports",
    "Contemporary Romance",
    "Romance",
    "Contemporary"
  ],
  "author": "Marianne Rice",
  "average_rating": "4.08",
  "url": "https://www.goodreads.com/book/show/24704838-false-start"
}