{
  "title": "Once Upon a Rose",
  "description": "Alternate cover edition - ASIN B00SSMCT10She stole his roses.  Fleeing the spotlight, burnt out rock star Layla—“Belle”—Dubois seeks refuge in the south of France. That old, half-forgotten heritage in a valley of roses seems like a good place to soothe a wounded heart. She certainly doesn’t expect the most dangerous threat to her heart to pounce on her as soon as she sets foot on the land.  He wants them back.  Matt didn’t mean to growl at her quite that loudly. But—his roses! She can’t have his roses. Even if she does have all those curls and green eyes and, and, and…what was he growling about again?  Or maybe he just wants her.  When an enemy invades his valley and threatens his home, heart, and livelihood, Matthieu Rosier really knows only one way to defend himself.  It might involve kissing.  And that might be just the start.  Praise for Laura Florand’s novels “A poignant, lovely, moving, authentic story.” – Virginia Kantra, NYT bestselling author  “Sweet, sexy, and all around delicious. I’m addicted. I can’t wait for the next book.” – Nalini Singh, NYT bestselling author  “Chocolate, Paris, and a Greek god for a hero; this delectable confection has it all!” – Library Journal Starred Review  “(Florand) captures the nature of love, its fierce, soul-warming necessity, in a way that will make you as happy as the finest bonbon could.” – The Barnes & Noble Review, a Best Book of the Year  “Florand outdoes herself with this exquisite confection… painstakingly crafted and decadent as the sweets it portrays, leaving the reader longing for just one little taste.” – Publishers Weekly Starred Review  “Adorable, charming, whimsical.” – Smexy Books  “Romance at its strongest and most powerful.” – Dear Author, Recommended Read  “A delectable summer bonbon.” – NPR Books",
  "genres": [
    "Romance",
    "Contemporary Romance",
    "Contemporary",
    "Adult",
    "Chick Lit",
    "France",
    "Fiction"
  ],
  "author": "Laura Florand",
  "average_rating": "3.92",
  "url": "https://www.goodreads.com/book/show/24712632-once-upon-a-rose"
}