{
  "title": "ClownFellas: Tales of the Binzo Family",
  "description": "“Carlton Mellick III goes past silly, through weird, detours around dumb, blasts through bizarre, and gets to a place where the normal physics of narrative no longer apply. You will never be the same.”—Cory Doctorow, author of Little Brother and HomelandIn a topsy-turvy world where clowns are killers and crooks, Little Bigtop is a three-ring circus of crime, and no syndicate is more dangerous than the Binzo family. From the wildly original mind of Carlton Mellick III comes the short-story collection ClownFellas—an epic mob saga where life is cheap and the gags will slay you.For years, the hard-boiled capos of the Binzo family have run all of the funny business in Little Bigtop, from the clown brothels to the illegal comedy trade. But hard times have befallen the Binzos now that Le Mystère, the French clown Mafia, has started moving in and trying to take over the city. If that weren’t enough, they’ve got to deal with the cops, the Feds, the snitches, the carnies, the mysterious hit man Mr. Pogo, and the mutant clowns over in the Sideshow district. With the odds stacked against them, the Binzos must fight to survive . . . or die laughing.Praise for ClownFellas“Mario Puzo meets Barnum & Bailey . . . You just can’t look away as the ridiculousness escalates.”—Publishers Weekly“The most original novelist working today? The most outrageous? The most unpredictable? These aren’t easy superlatives to make; however, Carlton Mellick may well be all of those things, behind a canon of books that all irreverently depart from the form and concepts of traditional novels, and adventure the reader into a howling, dark fantasyland of the most bizarre, over-the-top, and mind-warping inventiveness. In my opinion, ClownFellas is his best work to date.”—Edward Lee, author of City Infernal and Header“I rarely enjoy clowns—which is ironic since I’ve been one for over four decades—but ClownFellas is great on so many levels, irony being one of them. What can I say besides I love it! Great read, and funny as hell . . . I have been accused of being unfunny before, and after the trial I had to enter the Witless Protection Program. This is funny!”\n—Barry Lubin, aka Grandma, longtime Big Apple Circus clown\n“If Martin Scorsese and Ronald McDonald had a baby, this would be it. . . . Each story is clever, multi-layered, and filled with witty dialogue. . . . A must-read.”—This Is Horror   “Mellick’s writing is wonderfully descriptive and wildly imaginative. . . . I was utterly delighted, amused, and engrossed. . . . ClownFellas is a gem!”—The Qwillery   “A rollercoaster ride through a strange world that borders on our own reality . . . a story that is just as difficult to define as it is to put down.”—Examiner.com   “Mellick has created another amazing read. . . . Highly recommended.",
  "genres": [
    "Bizarro Fiction",
    "Horror",
    "Fantasy",
    "Humor",
    "Fiction"
  ],
  "author": "Carlton Mellick III",
  "average_rating": "4.23",
  "url": "https://www.goodreads.com/book/show/24703110-clownfellas"
}