{
  "title": "A Daughter’s Disgrace",
  "description": "From Amazon bestselling author Kitty Neale comes a heartbreaking historical novel about a young woman trying to make the best despite the worst circumstances. Is a happy ever after impossible? Previously published in 2015 FracturedAlison is the ugly duckling of her family and has always been treated with disdain by her mother. After years of being bullied, she is drawn to the one man who shows her affection. But when he brutally rapes her, leaving her pregnant, she is cast out. ForgottenShunned by her family, Alison must start to make her own way and plan a life for herself and her unborn child – and for the first time she is master of her own destiny. Forgiven?But when the baby arrives, Alison feels no love for her new son. Terrified that history will repeat itself, can she find a way to love her child? And will she ever find the forgiveness she craves from her family? An utterly unputdownable, heart-wrenching historical novel that will have you completely hooked from the first page. Perfect for fans of Dilly Court, Nadine Dorries and Nancy Revell. ⭐️⭐️⭐️⭐️⭐️ ‘ Had me hooked from the very first page and continued throughout the book. One of those books you just didn't want to end!! Just a BRILLIANT read as always, Kitty Neale!!!’ Amazon reviewer ⭐️⭐️⭐️⭐️⭐ ‘ Worth every penny , unfortunately it kept me from my bed it was such an interesting story and I never imagined the twist at the end….buy it .. love it .’ Amazon reviewer ⭐️⭐️⭐️⭐️⭐️ ‘ Fantastic. It kept me gripped right till the end and could really picture every character.’ Amazon reviewer ⭐️ ⭐️ ⭐️ ⭐️ ⭐️ ‘ I loved it , twists and turns that I certainly wasn't expecting… I just couldn't put it down .’ Amazon reviewer ⭐️⭐️⭐️⭐️⭐ ‘ What a wonderful read . Had me hooked, I fell in love with the characters.’ Amazon reviewer ⭐️⭐️⭐️⭐️⭐️ ‘I had to finish it in almost one read. The book was filled with all the emotions. ’ Amazon reviewer",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Chick Lit"
  ],
  "author": "Kitty Neale",
  "average_rating": "4.40",
  "url": "https://www.goodreads.com/book/show/24709994-a-daughter-s-disgrace"
}