{
  "title": "Sisters in Arms: Catholic Nuns through Two Millennia",
  "description": "Spanning two thousand years of Christian religious women's quest for spiritual and vocational fulfillment, Sisters in Arms is the first definitive history of Catholic nuns in the Western world. Unfolding century by century, this epic drama encompasses every period from the dawn of Christianity to the present.History has until recently minimized the role of nuns over the centuries. In this volume, their rich lives, their work, and their importance to the Church are finally acknowledged. Jo Ann Kay McNamara introduces us to women scholars, mystics, artists, political activists, healers, and teachers--individuals whose religious vocation enabled them to pursue goals beyond traditional gender roles. They range from Thecla, the legendary companion of Paul, who baptized herself in preparation for facing the lions in the Roman arena, to Hildegard of Bingen, whose visions unlocked her extraordinary talents for music, medicine, and moral teaching in the twelfth century. They also include Sister Mary Theresa Kane, who stood before the pope--and an American television audience-in 1979 and urged him to consider the ordination of women.By entering the convent, McNamara shows, nuns gained a community that allowed them to evolve spiritually, intellectually, and emotionally; but the convent was never a perfect refuge. Women's struggles continued against the male church hierarchy, the broader lay community, and the larger cultural and historical forces of change.The history of nuns is an important part of the larger story of western women whose gender provoked resistance to their claims to autonomy and power. As we enter the third millennium, this groundbreaking work pays fitting tribute to the sisters who have labored with prayer and service for two thousand years, who have struggled to achieve greater recognition and authority, and who have forged opportunities for all women while holding true to the teachings of the Gospel.",
  "genres": [
    "History",
    "Religion",
    "Nonfiction",
    "Christianity",
    "Womens",
    "Research",
    "Catholic"
  ],
  "author": "Jo Ann Kay McNamara",
  "average_rating": "3.64",
  "url": "https://www.goodreads.com/book/show/1016445.Sisters_in_Arms"
}