{
  "title": "Not in God's Name: Confronting Religious Violence",
  "description": "***2015 National Jewish Book Award Winner***In this powerful and timely book, one of the most admired and authoritative religious leaders of our time tackles the phenomenon of religious extremism and violence committed in the name of God. If religion is perceived as being part of the problem, Rabbi Sacks argues, then it must also form part of the solution. When religion becomes a zero-sum conceit—that is, my religion is the only right path to God, therefore your religion is by definition wrong—and individuals are motivated by what Rabbi Sacks calls “altruistic evil,” violence between peoples of different beliefs appears to be the only natural outcome. But through an exploration of the roots of violence and its relationship to religion, and employing groundbreaking biblical analysis and interpretation, Rabbi Sacks shows that religiously inspired violence has as its source misreadings of biblical texts at the heart of all three Abrahamic faiths. By looking anew at the book of Genesis, with its foundational stories of Judaism, Christianity, and Islam, Rabbi Sacks offers a radical rereading of many of the Bible’s seminal stories of sibling Cain and Abel, Isaac and Ishmael, Jacob and Esau, Joseph and his brothers, Rachel and Leah. “Abraham himself,” writes Rabbi Sacks, “sought to be a blessing to others regardless of their faith. That idea, ignored for many of the intervening centuries, remains the simplest definition of Abrahamic faith. It is not our task to conquer or convert the world or enforce uniformity of belief. It is our task to be a blessing to the world. The use of religion for political ends is not righteousness but idolatry . . . To invoke God to justify violence against the innocent is not an act of sanctity but of sacrilege.” Here is an eloquent call for people of goodwill from all faiths and none to stand together, confront the religious extremism that threatens to destroy us, and Not in God’s Name.",
  "genres": [
    "Religion",
    "Nonfiction",
    "Theology",
    "Jewish",
    "Judaism",
    "Philosophy",
    "Politics"
  ],
  "author": "Jonathan Sacks",
  "average_rating": "4.36",
  "url": "https://www.goodreads.com/book/show/24727435-not-in-god-s-name"
}