{
  "title": "Craving U",
  "description": "\"Craving U\" is the full-length version of SOCCER SWEETHEART: Don't kiss Juliet goodbye, Mirella Muffarotto's heartfelt debut YA, originally self-published under the pen name Llarjme (anagram of the author's real name, with j instead of i)\"You can’t run away from what you are.No matter where you go, your feelings for her are going to follow you...\"Marika, a teenager from the countryside, has known Matt since they were toddlers... and has been in love with him for almost as long. But while he's a gorgeous, athletic, popular guy with sky-blue eyes and a smile that makes your mind go blank and your mouth go dry, she is just like so many other girls her age: uncomfortable about her looks and her weight – neither super-skinny nor blonde like the cheerleader types – and certain that Matteo is out of her league.They have grown up with very few cares in the world in the midst of vineyards in the rolling Berici Hills, rocked gently by the rhythms of school and friends. But hundreds of miles away in the big city, in an elegant old building downtown, their destiny is about to be changed from behind a luxurious mahogany desk. Matteo's departure for Milan to follow his dreams will throw everything off balance, thrusting new, tempting situations into these two teenagers' experiences of life: unexplored worlds of pro sports and its opportunities and sacrifices, contracts and huge paychecks, symphonic metal, emotions, teenage trials and tribulations, awkward relationships, and memories as cutting as a sword slicing through tofu.When another guy fills that emptiness in Marika's life, every move, every thought, every feeling gets amplified and everything gets more complicated, and more intense.From the AuthorIt took many drafts to get to the final book version. After its initial publication, the author has continued to make revisions to create a story that grabs readers from the very first page and keeps them hooked until the end. Feedback from betas, bloggers and readers proved so precious to make the novel a story that involves the reader from the very beginning. The title changed several times — from Craving U to The Rook Crew to Every Boy is a Book before Soccer Sweetheart was finally chosen — because \"Craving U\" might have misled readers about the point of the story: it sounds too generic, too nondescript, too adult. In order to meet the word-count criteria and submit the full manuscript to publishers, the author decided to revise the book and divide it into two parts, but you need to read both books to love the story; and so, it has been re-collected into a one-volume edition. Soccer Sweetheart includes: Raspberries and a Cherry Tree (Limited ed.) and Sweet Cherry Chapstick (Limited ed.).",
  "genres": [
    "Young Adult",
    "Contemporary",
    "Young Adult Romance",
    "Media Tie In",
    "Friends To Lovers",
    "Romance"
  ],
  "author": "Mirella Muffarotto",
  "average_rating": "4.07",
  "url": "https://www.goodreads.com/book/show/24726374-craving-u"
}