{
  "title": "At the Hands of Persons Unknown: The Lynching of Black America",
  "description": "It is easy to shrink from our country’s brutal history of lynching. Lynching is called the last great skeleton in our nation’s It terrorized all of black America, claimed thousands upon thousands of victims in the decades between the 1880s and the Second World War, and leaves invisible but deep scars to this day. The cost of pushing lynching into the shadows, however—misremembering it as isolated acts perpetrated by bigots on society’s fringes—is insupportably Until we understand how pervasive and socially accepted the practice was—and, more important, why this was so—it will haunt all efforts at racial reconciliation.“I could not suppress the thought,” James Baldwin once recalled of seeing the red clay hills of Georgia on his first trip to the South, “that this earth had acquired its color from the blood that had dripped down from these trees.” Throughout America, not just in the South, blacks accused of a crime—or merely of violating social or racial customs—were hunted by mobs, abducted from jails, and given summary “justice” in blatant defiance of all guarantees of due process under law. Men and women were shot, hanged, tortured, and burned, often in sadistic, picnic-like “spectacle lynchings” involving thousands of witnesses. “At the hands of persons unknown” was the official verdict rendered on most of these atrocities.The celebrated historian Philip Dray shines a clear, bright light on this dark history—its causes, perpetrators, apologists, and victims. He also tells the story of the men and women who led the long and difficult fight to expose and eradicate lynching, including Ida B. Wells, James Weldon Johnson, Walter White, and W.E.B. Du Bois. If lynching is emblematic of what is worst about America, their fight may stand for what is the love of justice and fairness and the conviction that one individual’s sense of right can suffice to defy the gravest of wrongs. This landmark book follows the trajectory of both forces over American history—and makes the history of lynching belong to us all.",
  "genres": [
    "History",
    "Nonfiction",
    "Race",
    "American History",
    "Politics",
    "True Crime",
    "African American"
  ],
  "author": "Philip Dray",
  "average_rating": "4.45",
  "url": "https://www.goodreads.com/book/show/2472613.At_the_Hands_of_Persons_Unknown"
}