{
  "title": "Making the Cut",
  "description": "No cheating, no sex outside the relationship, no love triangles, and no club whores, HEA, no cliffhanger. Determined to remove herself from the rules and regulations of her overbearing religious parents, Avery escapes to college and is determined to make it on her own. Working as a bartender, and mere weeks before her college graduation, she finds herself face to face with thirty members of an Outlaw Motorcycle Club.  She had no idea when the President of the club walked in she'd go weak in the knees for the gorgeous tattooed biker. Axton (aka Slice) is the President of the Selected Sinners MC. At the onset of a huge gun deal with a notorious prison gang, he has no time or desire to have a woman in his life.   Abused by his Hell's Angel father as a child, and wronged by every woman in his past, Axton has one devotion - the MC. After finding out he needs Avery's Criminal Justice education and her linguistic skills to assist in making the gun deal a success, Axton reluctantly approaches her to act as his interpreter. Hoping to win Axton over, Avery attempts to turn off her smart mouth, turn on her charm, and become his woman of interest; even if it means sacrificing a level of independence she's grown accustomed to. But when the gun deal goes to hell in an hand basket, both Avery and Axton are left wondering what their next move may be. NOTE TO READERS* This book is a stand-alone love story and the first book of a series. No other book is required to tell THIS tale. It does have graphic violence, explicit language, sexual situations, and the intricacies of being in an Outlaw Motorcycle Club depicted. All sexual partners in this MC Erotic Romance are over the age of 18. Stand alone love story. HEA. No cliff hanger. If you enjoyed Kick, Throb, or Fat Louise, you'll certainly enjoy this book.",
  "genres": [
    "Romance",
    "Contemporary",
    "Contemporary Romance",
    "Erotica",
    "College",
    "New Adult",
    "Audiobook"
  ],
  "author": "Scott Hildreth",
  "average_rating": "3.88",
  "url": "https://www.goodreads.com/book/show/24725986-making-the-cut"
}