{
  "title": "All the Stars in the Heavens",
  "description": "Adriana Trigiani, the New York Times bestselling author of the blockbuster epic The Shoemaker’s Wife, returns with her biggest and boldest novel yet—a hypnotic tale, based on a true story—that dazzles with the signature elements of her previous work—family ties, artistry, romance, adventure—and introduces an unforgettable new heroine: Loretta Young, an ambitious starlet struggling to survive in Hollywood’s dream factoryIn this spectacular saga as radiant, thrilling, and beguiling as Hollywood itself, Adriana Trigiani takes us back to Tinsel Town’s golden age—an era as brutal as it was resplendent—and into the complex and glamorous world of a young actress hungry for fame and success. With meticulous, beautiful detail, Trigiani paints a rich, historical landscape of 1930s Los Angeles, where European and American artisans flocked to pursue the ultimate dream: to tell stories on the silver screen. The movie business is booming in 1935 when twenty-one-year-old Loretta Young meets thirty-four-year-old Clark Gable on the set of The Call of the Wild. Though he’s already married, Gable falls for the stunning and vivacious young actress instantly. Far from the glittering lights of Hollywood, Sister Alda Ducci has been forced to leave her convent and begin a new journey that leads her to Loretta. Becoming Miss Young’s assistant, the innocent and pious young Alda must navigate the wild terrain of Hollywood with fierce determination and a moral code that derives from her Italian roots. Over the course of decades, she and Loretta encounter scandal and adventure, choose love and passion, and forge an enduring bond of love and loyalty that will be put to the test when they eventually face the greatest obstacle of their lives.Anchored by Trigiani’s masterful storytelling that takes you on a worldwide ride of adventure from Hollywood to the shores of southern Italy, this mesmerizing epic is, at its heart, a luminous tale of the most cherished ties that bind. Brimming with larger-than-life characters both real and fictional—including stars Spencer Tracy, Myrna Loy, David Niven, Hattie McDaniel and more—it is it is the unforgettable story of one of cinema’s greatest love affairs during the golden age of American movie making.",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Romance",
    "Audiobook",
    "Historical",
    "Book Club",
    "Adult"
  ],
  "author": "Adriana Trigiani",
  "average_rating": "3.59",
  "url": "https://www.goodreads.com/book/show/24723249-all-the-stars-in-the-heavens"
}