{
  "title": "Yours Tonight",
  "description": "For fans of J Lynn, Jodi Ellen Malpas and Sylvia Day comes the Reign trilogy, an all-consuming, raw and powerful love story...\n \n\nHe will give her everything she's ever wanted . . .\n\nJack Powell's confidence is matched only by his intensity. The darkness in him comes from years of secrets and memories he'd rather forget. Lana has an exotic innocence that draws him in and Jack wants a taste of her. She's a light in the darkness of his world - and she needs help, which he agrees to give her. \n\nThe only rule? He makes the rules. \n\nLana gives up her control, letting Jack take her body however he needs, while she works her way into his heart. But Jack's past catches up to them and Lana finds herself wrapped up in a scheme that will expose every secret she's worked so hard to keep. She clung to Jack once when her world was crashing down, but this time, she loves him. She'll continue to reach for him - her only fear is if he'll reach back, or go on his way, taking her soul with him . . . \nAddictive and unforgettable, Lana's story will seduce, surprise and stay with you. A brand new trilogy by the #1 Bestselling author of Break Me Slowly, the Reign series is an emotional rollercoaster you'll want to keep riding forever.\n---------------------------------------------------------------------------------------\nEXCERPT\n\"You look flushed,\" he said, his tone so raspy it made me want to tell him why. \"I was just thinking of something,\" I whispered, my gaze zeroing in on his mouth.\"Oh?\" He took one step closer. \"Care to share your thoughts?\"I licked my lips . . . ready to share more than just the thoughts. He'd said earlier he wondered what I tasted like. I was wondering the same about him. \"Is it easy for you? Telling the truth?\" I asked. \"Generally.\"\"How? Not that I lie, but I just don't know how you can say what you say.\"\"You mean voice what I want?\"\"Yes.\" It was then it hit me. I wanted that. To be able to say what I wanted. Put a voice to my fears. My desires. My everything. To have someone actually listen. \"It's a matter of worth over value,\" he said. \"Any given thing has a value. I just decide what it's worth to me to keep that value.\" He took a step forward. \"For example, you have a value. My silence wasn't worth you walking away.\"",
  "genres": [
    "Romance",
    "Contemporary Romance",
    "Adult",
    "Audiobook",
    "BDSM",
    "Erotic Romance",
    "Erotica"
  ],
  "author": "Joya Ryan",
  "average_rating": "3.89",
  "url": "https://www.goodreads.com/book/show/24733119-yours-tonight"
}