{
  "title": "Showdown: Thurgood Marshall and the Supreme Court Nomination That Changed America",
  "description": "Thurgood Marshall brought down the separate-but-equal doctrine, integrated schools, and not only fought for human rights and human dignity but also made them impossible to deny in the courts and in the streets. In this stunning new biography, award-winning author Wil Haygood surpasses the emotional impact of his inspiring best seller The Butler to detail the life and career of one of the most transformative legal minds of the past one hundred years. Using the framework of the dramatic, contentious five-day Senate hearing to confirm Marshall as the first African-American Supreme Court justice, Haygood creates a provocative and moving look at Marshall’s life as well as the politicians, lawyers, activists, and others who shaped—or desperately tried to stop—the civil rights movement of the twentieth century: President Lyndon Johnson; Congressman Adam Clayton Powell Jr., whose scandals almost cost Marshall the Supreme Court judgeship; Harry and Harriette Moore, the Florida NAACP workers killed by the KKK; Justice J. Waties Waring, a racist lawyer from South Carolina, who, after being appointed to the federal court, became such a champion of civil rights that he was forced to flee the South; John, Robert, and Ted Kennedy; Senator Strom Thurmond, the renowned racist from South Carolina, who had a secret black mistress and child; North Carolina senator Sam Ervin, who tried to use his Constitutional expertise to block Marshall’s appointment; Senator James Eastland of Mississippi, the head of the Senate Judiciary Committee, who stated that segregation was “the law of nature, the law of God”; Arkansas senator John McClellan, who, as a boy, after Teddy Roosevelt invited Booker T. Washington to dinner at the White House, wrote a prize-winning school essay proclaiming that Roosevelt had destroyed the integrity of the presidency; and so many others. This galvanizing book makes clear that it is impossible to overestimate Thurgood Marshall’s lasting influence on the racial politics of our nation.",
  "genres": [
    "History",
    "Nonfiction",
    "Biography",
    "Politics",
    "Law",
    "Race",
    "African American"
  ],
  "author": "Wil Haygood",
  "average_rating": "3.99",
  "url": "https://www.goodreads.com/book/show/24738301-showdown"
}