{
  "title": "Intentional",
  "description": "In this novel, a woman’s friends and family deal with the aftermath of her suicide as they try to understand her reasons and their own roles.The last Lily Cummings hears from her best friend, Dust Steward, is a text “I love U. Be.” Be what? Dust (shortened from Dusty) can never tell her, because she shoots herself with her husband’s gun in the fancy bathroom of their home’s luxurious new addition. Lily, 37, together with Dust’s husband, daughter, mother and neighbor, struggles with her grief, confusion and guilt. Dust left no note and had apparently been planning the suicide for some time. Why? A passionate environmentalist, Dust hated the house extension and its enormous carbon footprint—concerns that her husband, Robert, with his conservative political ambitions, dismissed. He also threatened to keep their daughter, Grace, from her if she tried to divorce. Now, he must face up to his “I’m not innocent….Everything she believed in, I smacked down. I did it.” With good cause or without, everyone wonders if they could have done more. Dust’s suicide becomes a catalyst for other major life changes elsewhere—a collapsing marriage, rapprochement with a long-gone mother, etc. Throughout this intelligent and perceptive novel, Arbor traces with strength and delicacy the many strands leading up to and away from a suicide. She brings out the textures of people’s lives through their in-jokes and little customs so that readers can feel the web of living connections that Dust was part of and left behind. The childhood friendship between Lily and Dust is shown to be full of the shared fears, hopes and joys that kept them friends into adulthood, which helps define the scope of loss. Though everyone tries to play detective to understand. Dust’s suicide, the answers are messy. After Dust’s death, one of her jigsaw puzzles, unfinished, lies gathering dust, the pieces never put together.A thoughtful, sensitive but never saccharine exploration of what suicide leaves behind. --Kirkus Review",
  "genres": [],
  "author": "Lynn Arbor",
  "average_rating": "4.63",
  "url": "https://www.goodreads.com/book/show/24734921-intentional"
}