{
  "title": "The House by the Lake: A Story of Germany",
  "description": "In the summer of 1993, Thomas Harding travelled to Germany with his grandmother to visit a small house by a lake on the outskirts of Berlin. It had been her ‘soul place’ as a child, she said – a holiday home for her and her family, but much more – a sanctuary, a refuge. In the 1930s, she had been forced to leave the house, fleeing to England as the Nazis swept to power. The trip, she said, was a chance to see it one last time, to remember it as it was. But the house had changed. Nearly twenty years later Thomas returned to the house. It was government property now, derelict, and soon to be demolished. It was his legacy, one that had been loved, abandoned, fought over – a house his grandmother had desired until her death. Could it be saved? And should it be saved?He began to make tentative enquiries – speaking to neighbours and villagers, visiting archives, unearthing secrets that had lain hidden for decades. Slowly he began to piece together the lives of the five families who had lived there – a wealthy landowner, a prosperous Jewish family, a renowned composer, a widower and her children, a Stasi informant. All had made the house their home, and all – bar one – had been forced out. The house had been the site of domestic bliss and of contentment, but also of terrible grief and tragedy. It had weathered storms, fires and abandonment, witnessed violence, betrayals and murders, had withstood the trauma of a world war, and the dividing of a nation.As the story of the house began to take shape, Thomas realized that there was a chance to save it – but in doing so, he would have to resolve his own family’s feelings towards their former homeland – and a hatred handed down through the generations.The House by the Lake is a groundbreaking and revelatory new history of Germany over a tumultuous century, told through the story of a small wooden house. Breathtaking in scope, intimate in its detail, it is the long-awaited new history from the author of the bestselling Hanns and Rudolf.",
  "genres": [
    "Nonfiction",
    "History",
    "Germany",
    "Biography",
    "Historical",
    "World War II",
    "Memoir"
  ],
  "author": "Thomas Harding",
  "average_rating": "4.13",
  "url": "https://www.goodreads.com/book/show/24737108-the-house-by-the-lake"
}