{
  "title": "Beyond Survival",
  "description": "When life loses its meaning, when suddenly the world is turned upside down, when there's nothing left that resembles life as we've known it, where do we find the strength and sustenance to go on? For naval aviator Jerry Coffee and others who were held as prisoners of war in North Vietnam, there was only one to go within. Beyond Survival is a journey into the invincible human spirit that unites heart and mind in a compelling and unforgettable experience. Drawing from his seven years as a POW, Captain Coffee provides timeless lessons that apply to the physical, emotional, and ethical challenges of everyday life. Proving that leadership and creativity are possible in difficult and uncertain circumstances, Captain Coffee offers a message we can draw on in any trying situation. His story demonstrates that conviction must come from within, and in telling that story he touches the place inside of us where growth begins. Beyond Survival is a positive statement about love and commitment in the midst of war and division. It contrasts the cold reality of war, degradation, and torture with the warmth of human connections, inner serenity, and kinship with all of life. It poignantly illustrates that to be stripped of everything that is familiar and by which we identify ourselves leaves us with only what unites us - our human identity. It conveys truths about relationships at every level - with ourselves, with others, with our country, and with our God. Without inflaming the wounds inflicted by America's involvement in Vietnam, Beyond Survival explores an issue at the heart of every free the willingness of ordinary individuals to maintain a passion for freedom so compelling that adversity strengthens rather than weakens personal resolve in the worst of circumstances. Through Gerald Coffee's story you will discover the universal principles of survival and triumph that empower anyone to overcome adversity.",
  "genres": [
    "Biography",
    "Memoir",
    "Nonfiction",
    "History",
    "Book Club",
    "Military History"
  ],
  "author": "Gerald Coffee",
  "average_rating": "4.21",
  "url": "https://www.goodreads.com/book/show/2474014.Beyond_Survival"
}