{
  "title": "Fallen Angel",
  "description": "Joseph Ryan never knew what family meant until he joined the Steel Jockeys MC. It was there that he met Kyle Clarke, there that he found a brother in all but name for the next ten years.Until one fateful day when he's forced to watch as Kyle is ruthlessly gunned down in a hailstorm of bullets. With his last dying breath, Kyle makes Joseph promise to keep his sister Ruby out of their violent world, no matter what.Having lost her parents when she was just a little girl, Ruby only had her brother Kyle to look after her. Now, he's gone too and she's beside herself with grief, with only Joseph to share her pain with.Joseph is determined to honor his fallen brother's wishes, but when an unexpected kiss from Ruby leads him into her bed, he isn't sure what to think anymore. He promised Kyle to keep Ruby away from the Steel Jockeys, but how can he do that when all she wants is to be a part of his life?From bestselling author Evelyn Glass comes another heart-racing series of love, betrayal, and broken promises.EXCERPTHe leaned in. She bristled, knew she should pull away, shriek, or throw a pillow at him at the very least. Show him that she'd only been performing. Like a ballerina in a music box, dancing on cue simply to save her skin. That she had had no other intention, no other desire for young Joseph Ryan, and that he must be not only presumptuous but insane to think otherwise.Instead, she kissed him back.The way his full lips felt was unexpected, confident but also curious as they probed hers, slowly, exploratory, not in any way aggressive or forceful. He was giving her an out, she realized. In case she didn't want this. In case she'd made a mistake. But she darted her tongue deeper, to taste more, and she felt his body shift and respond, as if he were surprised at the enthusiasm of her kiss.",
  "genres": [],
  "author": "Evelyn Glass",
  "average_rating": "3.53",
  "url": "https://www.goodreads.com/book/show/24757674-fallen-angel"
}