{
  "title": "Midnight Moon",
  "description": "Tamara Gibbs is in way over her head  What was supposed to have been the search for the greatest story has now put Tamara firmly on the frontlines of the Roadside Angels MC and its rivalries across southern Arizona. And that doesn't even take into consideration her newfound obsession with the wolfishly handsome Alexander Cole.   Alexander Cole is having trouble holding his secrets  The shocking discovery of his long awaited mate in Tamara quickly shatters the life that Alexander has so carefully built up around him. Now, with his wolf going restless every time he's around her, it's harder and harder for him to keep his secrets close to his heart.   There's a price to fight for love.  When a string of murders puts all of Rojo Arroyo on high alert, both of them knows that Tamara has found the story she's looking for and that she'll be gone when it's all over. Alexander doesn't want to give up on his mate, but to do so means making a decision that means his desires are more important than the well-being of the town.  EXCERPT  “You’re playing with fire, you know,” he murmured, wrapping his arms around her. “You’re likely to get burned.”  She looked up at him at last, a mischievous smile curving her lips. “How bad can it be?” she asked, eyeing him in open invitation.  He trailed a finger over her lips, smiling back at her. “Third degree burns are inevitable,” he replied. “Extremely dangerous situation. Sure you don’t want to try and escape the flames?”  He had started kissing her before he finished teasing, his lips trailing down from her temples to the tops of her ears, then sliding down to her earlobes, which he nipped and then soothed with erotic licks that pulled a moan from her. She turned her head toward his lips and leaned up, inviting him to end his sensual torment and take her mouth. He touched her lightly there, pressing chaste kisses on each lip before sucking them into his mouth, one at a time, laving them with his tongue and arousing the two of them to fever pitch.",
  "genres": [],
  "author": "Kathryn Thomas",
  "average_rating": "3.74",
  "url": "https://www.goodreads.com/book/show/24749807-midnight-moon"
}