{
  "title": "Stripped Raw: Coffin Nails MC California",
  "description": "--- What’s left when you strip away the lies? ---Sam. Loyal to the Coffin Nails MC. Lives by his own rules. Weakness: Damsels in distress.Jolie. In a deeply ambiguous relationship with the Coffin Nails MC. Lives from paycheck to paycheck. Weakness: Bad boys.As a patched member of the Coffin Nails MC, Sam is finally living the life he was destined for. A life of Harleys, guns, drugs, and eating pussy. A life of brotherhood above all.When he goes to pick up some pot brownies for the club president’s old lady, he meets a girl so sweet, his inner wolf wants to eat her there and then. What is supposed to be a typical fling, gets damn more complicated when the Coffin Nails decide to involve the pretty blonde baker in their drugs operation. Jolie has a knack for baking delicious cakes, but when it comes to her taste in men, she is a self-professed failure. After a disastrous relationship, she is still picking up the pieces and working three jobs to manage the financial carnage her ex left her with. The last thing she needs is a hot piece of tattooed hunk stomping into her life. Sam calls her ‘Candy’, but with a talent for being in the wrong place at the wrong time, Jolie should be called ‘Trouble’.To be with Jolie, Sam would have to disclose a secret he kept locked away for years. A secret so raw, that it might destroy his place in the brotherhood he’s fought so hard to be a part of. POSSIBLE SPOILERS:Themes: Outlaw motorcycle club, drugs, gender identity, transsexuality, secrets, misunderstandings, criminal activity, entrepreneurship, bad luck, debtGenre: Erotic romance, suspenseLength: ~75,000 words (Standalone novel)WARNING: Adult content. Explicit sex, strong language, violence, and morally ambiguous protagonists.",
  "genres": [
    "Romance",
    "Contemporary",
    "M F Romance",
    "Transgender",
    "M M Romance",
    "Erotica",
    "LGBT"
  ],
  "author": "Miss Merikan",
  "average_rating": "3.60",
  "url": "https://www.goodreads.com/book/show/24766500-stripped-raw"
}