{
  "title": "Torque",
  "description": "In the dark underworld of Ashville, crime, deceit, and blackmail reign supreme. Everyone wants that little piece of leverage—that one small key to getting ahead.Aubrey would be happy—and lucky—to simply make it out alive. After falling in debt to one of the city's most dangerous men, she found herself caught in a dispute between two brothers who will do anything to see each other suffer. Aubrey knows she's only a pawn in their game and her only hope is to find some key of her own—a way to guarantee her own safety and the safety of her family.Colt has a long and sordid past with the criminal element. He knows how the game is played and has found himself on all sides more times than he cares to remember. Aubrey is his newest escape route, but their tentative alliance is doomed to crumble if Colt can't find a way to fulfill his end of the bargain with Devlin. How will Colt and Aubrey handle Devlin's newest threat?  I never expected life to be easy, but this….It’s no dreamIt’s no nightmare. It’s the reality of a girl who was determined to make it on her own. I shot for the moon, got fucked by gravity, and landed in the underworld of the city. Caught between two men—brothers—both equally handsome as they are dangerous. Sex, drugs, and alcohol are the only recognized currencies. Stealing and deceit aren’t just a way of life—they’re a survival skill. A requirement to make it through the next night alive.People say that looks can be deceiving, but what they fail to realize is that often, even the truth is deceiving.Devlin promised to help.Colt promised the truth.The only thing they really want is to see me suffer—each in his own demented way.If you’re looking for rainbows, butterflies, and happy endings coated in chocolate and caramel, turn back now! This is a work of serial fiction, so it will be released in distinct parts with no resolute ending until the end of the series.",
  "genres": [
    "Dark",
    "Erotica",
    "Dark Romance",
    "Romance",
    "Amazon",
    "Erotic Romance",
    "Romantic Suspense"
  ],
  "author": "Skye Callahan",
  "average_rating": "4.04",
  "url": "https://www.goodreads.com/book/show/24763554-torque"
}