{
  "title": "Brimstone",
  "description": "Brimstone is a story of temptation, ambition and their consequences.  The year is 1793. The Terror is at its height in France, Britain is at war with her old enemy once more, and along the coast of Sussex the smugglers’ trade in spirits and tobacco is flourishing. The novel’s two heroes are brothers bound by love, but separated by opposing characters which come to represent two the two faces of eighteenth century England – its brutality and its enlightenment. For the reckless Aaron Corbyn, there are adventures to be had and profits to be made from contrabanding. While his elder brother Rafe, a sobrely steadfast physician, runs the family estate of Chalkdean, Aaron builds an illegal empire as master smuggler across the Channel, at Fécamp in Normandy. Ellin Rimmer, daughter of a ‘fire and brimstone’ preacher, marries one brother to escape the loneliness of life in a parsonage, only to find herself hopelessly attracted to the other – and to be compelled through him to an impetuous decision that will have drastic consequences for all three.  Sweeping from the open downland and flintstone villages of Sussex to the coast of revolutionary France, from Newgate prison and the subhuman conditions of a convict transport ship to the penal colony of New South Wales, Brimstone weighs the destructive aspects of sexual obsession against the healing power of generosity to bring its heroine an unexpected redemption.   About the Author Richard Masefield comes from a family of writers – the poet, John Masefield, was his cousin – and with a personal love of animals and the outdoors, he decided at a young age that he would farm and write, if necessary both at once.  It took years of hard work before Richard could realise his ambition and in fact his first published novel was written while milking his herd of Friesian cows.  He still lives on his farm in Sussex, with his wife Lee and together they spend as much time as possible with their large family of children and grandchildren.",
  "genres": [],
  "author": "Richard Masefield",
  "average_rating": "3.25",
  "url": "https://www.goodreads.com/book/show/2477122.Brimstone"
}