{
  "title": "The Tatterdemon Omnibus",
  "description": "Grab all three volumes of the spine-chilling TATTERDEMON trilogy, now available in one single money-saving volume.  In 1691 the town of Crossfall taught the witch Thessaly how to die. They beat her, they shot her, they hung her - but nothing worked. When they finally tried to bury her alive Thessaly set the field against them. The first man died as a gust of wind harrowed the meat from his bones. A root,flung like a dirty javelin, cut a second man down. Many more deaths followed. The Preacher Fell impaled the witch upon her very own broom but she dragged him down into the field to wait for three more centuries.  Three hundred years later Maddy Harker will murder her bullying husband Vic. She will bury him in the field as she buried her abusive father years before that. The very same field where the revenant spirit of Thessaly Cross lies waiting.  In three days Vic will rise again - a thing of dirt, bone and hatred.  Men will call him the Tatterdemon.  And hell - and Thessaly - will follow WHAT PEOPLE ARE SAYING ABOUT STEVE VERNON  \"The genre needs new blood and Steve Vernon is quite a transfusion.\" –Edward Lee, author of FLESH GOTHIC and CITY INFERNAL  \"If Harlan Ellison, Richard Matheson and Robert Bloch had a three-way sex romp in a hot tub, and then a team of scientists came in and filtered out the water and mixed the leftover DNA into a test tube, the resulting genetic experiment would most likely grow up into Steve Vernon.\" - Bookgasm  \"Steve Vernon is something of an anomaly in the world of horror literature. He's one of the freshest new voices in the genre although his career has spanned twenty years. Writing with a rare swagger and confidence, Steve Vernon can lead his readers through an entire gamut of emotions from outright fear and repulsion to pity and laughter.\" - Cemetery Dance  \"Armed with a bizarre sense of humor, a huge amount of originality, a flair for taking risks and a strong grasp of characterization - Steve's got the chops for sure.\" - Dark Discoveries  \"Steve Vernon was born to write. He's the real deal and we're lucky to have him.\" - Richard Chizmar  My Mom thinks I'm pretty cool, too.",
  "genres": [
    "Horror",
    "Fiction",
    "Fantasy",
    "Halloween",
    "Supernatural"
  ],
  "author": "Steve Vernon",
  "average_rating": "3.72",
  "url": "https://www.goodreads.com/book/show/24767371-the-tatterdemon-omnibus"
}