{
  "title": "Crushing on Love",
  "description": "CRUSHING ON LOVE is a USA TODAY BESTSELLER The Bradens are a series of stand-alone romances that may also be enjoyed as part of the larger Love in Bloom series..In CRUSHING ON LOVE...Steve Johnson is living his life's passion watching over the Colorado Mountains as a ranger and wildlife consultant. But his peaceful life is upended when overzealous and insanely beautiful Shannon Braden flits back into his life after returning from a brief trip home to Maryland. He thought his attraction to her was under control--after all, she's only in Colorado temporarily, and he doesn't do casual affairs.Shannon's return to Colorado has as much to do with the game of cat and mouse she and Steve have been playing as it does the data she's been hired to collect. But despite her efforts to explore the undeniable heat simmering between them, Steve's intent on keeping his distance.When a ranch abutting the national park goes up for sale, Steve will do whatever it takes to keep it from falling into the wrong hands. And when all his attempts fail, he's left with no alternative but to follow Shannon's guidance into the online world he abhors in order to raise the funds. The more time they spend together, the deeper their attraction becomes, and a game of cat and mouse turns into an unstoppable connection. But when Shannon's assignment comes to an end, will it mean an end to them, too?***WANT MORE BRADENS? All Braden books can be read as stand-alone novels or as part of the series:THE BRADENS (Peaceful Harbor, MD)Healed by Love (Nate)Surrender My Love (Cole)River of Love (Sam)Crushing on Love (Shannon)Whisper of Love (Tempest)Thrill of Love (Ty)***The Bradens are part of the Love in Bloom big family romance collection. Characters from each sub-series appear in future books. Read the complete Love in Bloom series:SNOW SISTERSTHE BRADENS (at Weston, CO)THE REMINGTONSTHE BRADENS (at Trusty, CO)THE BRADENS (at Peaceful Harbor)SEASIDE SUMMERSWILD BOYS AFTER DARK",
  "genres": [
    "Romance",
    "Contemporary",
    "Contemporary Romance",
    "Friends To Lovers",
    "Second Chance Romance",
    "Womens Fiction"
  ],
  "author": "Melissa Foster",
  "average_rating": "4.52",
  "url": "https://www.goodreads.com/book/show/24779233-crushing-on-love"
}