{
  "title": "Publishing & Marketing Realities for the Emerging Author",
  "description": "Whether you have finished your first manuscript, have several books published, or have just sat down with a great idea for a book, if you are a writer, this book is for you.• Choose the best publishing path based on your individual goals.• Coordinate your marketing tasks and writing obligations. See how they can work together.• Launch your writing career without ever leaving your home office.• Discover the four-fold approach to maximize your Twitter success.• Avoid common publishing pitfalls.• Expand your networks and increase your Internet presence.• Improve your knowledge of social media and how to best use these virtual tools to market yourself and your books.• Learn how to automate your social networks to work while you write.• Understand the 4 Marketing Maxims to increase your marketing success.• Helpful checklists and resources to keep you organized and on task.• Build your brand online and drive traffic to your website.• Get 3 checks a month from Amazon.• Join the eBook Revolution!Christine Rose shares what she’s learned the hard way. From starting with an Indie Press, through self-publishing, to finding a NY Agent and playing with the big boys. No nonsense. No tiptoeing. She tells it like it is. Christine has traveled coast to coast promoting her work, along the way becoming a social networking maverick and an Amazon bestselling author. Her marketing efforts sold over five times more books in the crucial first year than the average books sells in its lifetime. Publishing & Marketing Realities is her guide around the pitfalls en route to success.“Christine’s book offers a thorough, fresh, and honest look at both traditional and self publishing options. Reading it is like sitting down and having coffee with a good friend who’s in the know about the publishing industry.” ~Evelyn Lafont, author of The Vampire Relationship Guide, Volume One.“Christine Rose’s book is mandatory reading for anyone who is thinking about writing a book, in process or has just completed one. As a successful, published author, Christine shares a treasure trove of information about marketing and publishing in a witty, concise manner. A mind-boggling world awaits. Let Christine’s guidance help you to get your work into the right hands.” ~ Caroline Kirby, emerging author.“This should be required reading for emerging authors.” ~ TS Tate, freelance editor.",
  "genres": [],
  "author": "Christine Rose",
  "average_rating": "4.22",
  "url": "https://www.goodreads.com/book/show/11502104-publishing-marketing-realities-for-the-emerging-author"
}