{
  "title": "The Complete Betrayal Series: Lesbian Romance Short Stories, Lesbian Fiction Short Stories, Lesbian Drama Series, Lesbian New Adult",
  "description": "“There are things Brianna has done that you don’t know about, things that would disturb you if I told you about them. I won’t go into details because it is all just too sordid and doesn’t really matter anymore. She is a liar, Abby and cannot be trusted.”Abby knows everything there is to know about her dreamboat boyfriend Kyle; everything except anything having to do with his older sister Brianna. Brianna, an up-and-coming film and television actress, and Kyle have been estranged ever since Brianna ran away from home when she was 18.According to Kyle, there are very shameful secrets about Brianna, and he does not want Abby to learn about them.When Brianna comes to town to audition for the lead role in a very popular Broadway play, Abby is determined to meet the budding star and unravel the mystery that surrounds her once and for all. At a party, Abby and Brianna meet for the first time. Not only does Abby fail to learn the truth about Brianna’s past that night, she also gets caught in the middle of a bizarre, mean-spirited bet that turns her world upside down and changes her life forever.“I only held her gaze for a few seconds, but I will never forget the look in her eyes. The shame and disgust with which she looked at me hurt more than any bruise or gash I had on my body.”Abby’s world is spinning out of control. She has cheated on the love of her life, the man of her dreams, with none other than the man’s own sister. She is confused, ashamed, and filled with regret.Abby is convinced Brianna has manipulated and used her to get back at Kyle for what happened at Ryan’s party.Desperate to prove she is not a monster, Brianna shares with Abby the shocking, heartbreaking story behind her running away from home when she was 18 years old.After hearing the horrific tale, Abby realizes Brianna’s feelings and intentions are genuine.Abby cannot deny her own feelings for Brianna any longer but understands that acting on those feelings would be wrong because of Kyle. So what will she do? Will she choose to do “the right thing” or will she listen to her heart?\"Kyle crossed his arms over his chest. “I know I can’t hold you here against your will, Abby. I’m not an idiot. I don’t need to hold you captive to ruin your life or Brianna’s. All I need to do is pick up the phone and make a call.”When Kyle discovers that Abby, the love of his life, the only woman he’s ever loved or trusted, may be cheating on him, he is heartbroken, angry, lost, disillusioned. The only thing more devastating than finding out his girlfriend of three years is cheating on him is finding out, in the most humiliating way possible, that she is cheating on him with none other than his own sister Brianna, a woman Kyle despises.Kyle is determined to make both Abby and Brianna pay dearly for making a fool out of him. His thirst for revenge leads him down a very dark path. He schemes, manipulates, and even resorts to blackmail just to teach his girlfriend and his sister a lesson. But he goes too far, and his actions may end up costing him his future and possibly his freedom.Will Abby and Brianna’s love survive Kyle’s wrath? Will Kyle come to his senses before it’s too late?",
  "genres": [],
  "author": "Sofia Velardi",
  "average_rating": "3.54",
  "url": "https://www.goodreads.com/book/show/24784812-the-complete-betrayal-series"
}