{
  "title": "Kaya Abaniah and the Father of the Forest",
  "description": "LEGENDS ARE IMMORTAL DREAMS MADE FLESH...Kaya Abaniah believes he’s an ordinary fourteen-year-old college student. He lives with his mother on the Caribbean island of Trinidad; he’s passionate about wildlife conservation and has a crush on the prettiest girl in his class. However, one fateful day, Kaya’s life is changed forever when he encounters Papa Bois, a folklore character similar to the Greek god, Pan.Kaya learns he has the talent. He’s a telepath, and he’s not alone. He discovers that men in black are constantly watching him, Soucouyant, the shape-shifting vampire wants his blood, and his packed lunch is never safe.Will Kaya succeed in protecting his relatives and friends from the supernatural evils that lurk on the tropic isle? Can he reveal the shape-shifter’s secret identity? And, why on Earth is the most gorgeous girl, he’s ever known, so interested in him?Follow Kaya’s struggles with love, rivalry, and academic life, as he confronts the terrifying creatures of Trinidad and Tobago’s folklore, and unlocks the shocking mystery of Papa Bois, the father of the forest.Kaya Abaniah and the Father of the Forest was a 2020 Literary Titan Book Award Winner.About the Author:Wayne Gerard Trotman is a Trinidadian British award-winning author, blogger, filmmaker, artist, photographer, composer and producer of electronic music. Born in the Republic of Trinidad and Tobago, Trotman immigrated to England in 1984, where he lives with his wife and two sons.Reviewed by Rabia Tanveer for Readers' Favorite - 5 StarsKaya Abaniah and the Father of the Forest by Wayne Gerard Trotman is a story of family, friendship, love, and fighting for what is right. Kaya Abaniah is your typical fourteen-year-old guy who has a crush on a pretty girl. He has two good friends; he tries his best to stay away from the bullies and lives with his mother who loves him very much. However, his peaceful existence is shattered when he falls ill with a severe fever and a strange man comes to him in a dream to tell him to be careful of what he eats. Kaya believes it was just a dream, but things are never the same after that. Once he gets well, he can read the minds of people and control animals. However, the real change begins when he comes across Papa Bois. He shares things with Kaya that are impossible. Unbelievable and too fantastical to be true, Kaya has to change his life completely or else everyone he knows will be in grave danger.I love reading about different cultures and mythologies. African literature and mythology are very intricate, but the author easily did it justice. Wayne Gerard Trotman left no stone unturned to fine-tune even the most minor details about the setting and the background of the story. This young adult tale takes the reader on a heart-stopping journey of an extraordinary guy whose life changes overnight. I loved how the author made the story and the characters as genuine as possible. Our protagonist speaks Creole English; he doesn’t act like an American student, he follows the traditions of Trinidad and Tobago and he eats his local food. Kaya is complicated yet simple at the same time, which is very much like the plot of the story. There are layers upon layers of complex plot that you will love to uncover. It is truly an incredibly rich and accurate journey of self-discovery and a fight for survival. To say that I loved this would be an understatement.",
  "genres": [
    "Fantasy",
    "Fiction",
    "Science Fiction",
    "Young Adult"
  ],
  "author": "Wayne Gerard Trotman",
  "average_rating": "4.53",
  "url": "https://www.goodreads.com/book/show/24791787-kaya-abaniah-and-the-father-of-the-forest"
}