{
  "title": "Sometimes Never: The Series Box Set",
  "description": "The entire Sometimes Never series together in one box set.Family isn’t always blood. The Sometimes Never series follows the lives of five friends, as they discover loss and love, and everything in-between, proving the past doesn’t dictate the future. Love can conquer all, and some friendships were made to last a lifetime.Titles include:Special Edition Sometimes Never (With extra and extended scenes.)Blackbird (A Sometimes Never Novella)Before NowLong AfterAlways ForeverLet It Be (A Sometimes Never Novella)Bonus Material: Where Are They Now: A second glance at the Sometimes Never gangSometimes NeverHope didn’t have the best role model when it came to relationships. She’s never believed in love and commitment. Mason never put much stock into love at first sight—until he sees her. Regardless of their painful pasts, Hope and Mason discover that sometimes never can become forever.*This is a special edition of Sometimes Never with extra and extended scenes.BlackbirdWhat happened in the years between the final chapter and epilogue of Sometimes Never? Blackbird is an 18,000+ word novella that continues Mason and Hope's story as they finish high school, start separate colleges, and confront their demons.Before NowAfter his heart was broken by the only girl he ever loved, Park Reed now lives his life following his ever-growing list of “life lessons.” Lucy Braden is everything Park is not. She’s sweet, caring, and an all-around nice person. She tries to follow Lucy's Rules to Live By every day. But Park follows his own rules.Long AfterFor Annie Phillips, there is a right way to do things and everything has a place. Anything less than perfection is unacceptable. Chase Malloy is funny, loyal, and an all around nice guy. He’s also sloppy, tattooed, and undirected. Knowing his best friend’s step-sister since they were fourteen, Annie and he have always had a love-hate relationship. The last thing Chase expects is to fall for Annie, but he knows he’ll never live up to her idea of the perfect man. Will she realize the perfection she’s been searching for has been in front of her all this time?Always ForeverKellin Patel was forced to leave Misty behind when he was twelve years old. While the U-Haul pulled away from the only place that felt like a home, he wasn’t sure if he’d see her again. Now, all grown up, Misty is back and looking for one last wild summer with Kellin before she accepts another man's marriage proposal.Let It BeI’m the happy one. The dependable one. The shoulder. The anchor. The pillar. The rock. The matchmaker. I’m the one you call when you’ve had a bad day. When you need to vent, or scream, or cry. I will always be there to comfort you. It’s a gift. A talent. A role I’ve happily played. I’ve helped my friends become who they were meant to be. I’ve watched them move away, find love, start their lives. But what about me? When does my life start? Where is my happily-ever-after? My name is Guy Handlin, and this is my story.Where Are They Now: A second glance at the Sometimes Never gangTold from Hope's point of view, a quick 600+ word glance at where the Sometimes Never crew is now.***Please note: Each book in the Sometimes Never series is a New Adult romance. Recommended for 17+ due to sexual situations, harsh language, dark subject matter, and drug and alcohol use.",
  "genres": [],
  "author": "Cheryl McIntyre",
  "average_rating": "4.25",
  "url": "https://www.goodreads.com/book/show/24791717-sometimes-never"
}