{
  "title": "What Love Means to You People",
  "description": "A powerful debut about a young man whose denial of his past nearly destroys the new life he seeksShaking off his hellish adolescence in a nowhere Nebraska town (and leaving a beloved younger sister to fend for herself in the same hostile environment), Seth McKenna escapes to make a new reality for himself as a struggling artist in Manhattan. When he falls hard for Jim Glaser, an alluring older man who is astonished to find in Seth the second love of his life, it seems simpler to gloss over his old life in Drinkwater and the history he used to have. Jim, who expected to remain alone forever, is happy to start over, too, and theirs becomes a tender, sexy romance.Although Seth seems to have successfully put his past behind him to become the man he wants to be---the kind of man Jim can cherish---his childhood rushes back unexpectedly and with a vengeance. When Seth's sister, Cassie, arrives in the city with significant secrets and plans of her own, Drinkwater's intractable demands force Seth to revisit his hidden past. What Jim learns about Seth's concealments threatens to destroy their new life together.An engrossing contemporary drama of family ties both imposed and chosen, What Love Means to You People presents an indelible, illuminating look at the survival of the human spirit through willful reinvention and the power of love.Advance Praise for What Love Means to You People\"A powerful debut novel--smart, sexy, and highly readable. NancyKay Shapiro's characters are subtly observed and movingly human.\"--Regina McBride, author of The Marriage Bed\"Profound and moving. Shapiro dares to reimagine suffering and takes us on a journey to love and back. Seth McKenna will get under your skin. I am touched.\"--Abha Dawesar, author of Babyji\"NancyKay Shapiro's debut is a powerful and knowing look at what can happen to love when the past bubbles up into the present. Elegantly written, this is a moving and surprising novel that doesn't let you go.\"--Katharine Weber, author of The Little Women, The Music Lesson, and Objects in Mirror Are Closer Than They Appear",
  "genres": [
    "M M Romance",
    "Fiction",
    "Romance",
    "LGBT",
    "Abuse",
    "Queer",
    "Gay"
  ],
  "author": "NancyKay Shapiro",
  "average_rating": "3.96",
  "url": "https://www.goodreads.com/book/show/247933.What_Love_Means_to_You_People"
}