{
  "title": "LOL Romantic Comedy Anthology - Volume 3 - Sixteen All-New Romance Stories by Bestselling Authors!",
  "description": "\"16 AMAZING STORIES YOU'VE NEVER READ!\"  These 16 sizzling and sweet romance stories are all brand new and never-before-released, until now!  Snowed in? Cuddle up with this anthology of SNOW-inpsired romantic comedy stories.  Readers love these tasty tales from their favorite funny authors and swoon-worthy heroes. By popular demand, here's the third issue of LOL! You'll love (and laugh out loud) at these novellas, with satisfying, romantic endings and not a cliffhanger in sight.  Enjoy 16 brand-new stories from your favorite NYT Bestseller and USA Today Bestseller romance and romantic comedy authors, plus a few fresh new faces. The theme of this volume is SNOW. Enjoy!LOL #3 features exclusive stories from:Waiting for Snow - Melanie MarchandeFor the first time ever, here's his version of how the world's most obnoxious billionaire playboy fell in love with his muse.Heat level: EroticSkiing in June - Blair BabylonRae Stone-von Hannover is no fairy tale princess. She’s a country bumpkin currently turning into a pregnant pumpkin.When three real princesses try to steal away Rae's handsome prince, she'll do anything to keep her man.Heat level: Spicy hot, 4 flames!The Snowman - Sky CorganFerne Lynch hates living in Alaska. She wants nothing more than to get away and explore the world. One night, she builds a snowman and makes a wish upon a star. Before the night is through, a mysterious man shows up on Ferne's doorstep. Are they meeting by chance, or is something magical happening?Heat level: SweetCan You Love Me Now?: Oakland Hills Short Story 3 - Gretchen GalwaySasha Selkirk has been in love with her bestfriend’s brother, Jake Lapinksi, since she was thirteen. Now twenty-eight, she finds him at the snowbound mountain cabin where she’s staying. . .and trying to forget about him.Heat level: SensualSnowbound - Victoria WessexWhen a blizzard traps shy girl Arabella in a gas station with cocky but gorgeous Jarrett, it feels like a fate worse than death. But as temperatures plunge outside, the friction between them leads to sparks...and a whole new way to keep warm.Heat level: SpicyIt Was Always You - Brenna AubreyWhen Jeremy, her brother’s best friend, came back into her life, Michaela cursed the fact that she was in a relationship. Now Michaela’s single again, but he’s dating her roommate.Heat level: SensualTake for Granted - Daisy PrescottJo and Ben Grant are spending a week in Aspen, without the kids. Bliss. Heaven. When Jo plans a wild evening out, will Ben embrace the crazy?Heat level: Sweet & SpicyFall Fast - Zoe YorkNavy SEAL Nathan Meyers isn’t complaining about being snowed in at O’Hare Airport with a sexy flight attendant. But one night together isn’t going to be enough. . .Heat level: EroticVegas Holiday - JJ KnightJo’s high-profile wedding is getting to her, so sheescapes to Las Vegas with her best friend to take a day off. Mayhem ensues, including a surprise attack by an army of XenaWarrior Princesses, and the arrival of an entire troupe of Elvis impersonators.Heat level: Moderately spicyWhen Things Go Wrong - Lacey SilksHigh school friends who don’t believe in lasting relationships reconnect when they’re forced to spend the night together, trapped in a cave.Heat level: EroticThis Never Happened - Julia KentA stolen kiss with her professor two months ago comes back to haunt a young woman when fate—and Mother Nature—bring them together.Heat level: Mostly sweet, some spice!Snow Kissed: A Three Girls short story - Rachel SchurigToo-shy-for-her-own-good Bella is taking a break from her med school applications to get some dating experience. Scott seems like just the guy to help her, and a working vacation at a luxurious ski resort is the perfect setting… for romance, ordisaster.Heat level: EroticBegin Again - Harlow NashAfter catching her cheating ex in the act, Louisa Gallo has sworn off men forever—until she collides with an old flame and starts to second guess everything she thought she knew about love.Heat level: SweetOnce Upon a Midnight Snowy - N.M. SilberProsecutor Kevin Taylor can't help falling for his feisty neighbor Alison Klein twice - once in the show, and once in the night. A cryptic note and a unexplained bang bring the two would-be sleuths and lovers together for romance and mystery.Heat level: SweetWarm Winter Kisses - Juliet SpenserBest friends forge a deeper connection during a winter storm. Hannah is a B&B manager and her best friend, Liam, is a detective. Can she keep her feelings a secret from the hunky investigator?Heat level: SensualLove and Elephants (Love & Witches Short Novella) - Mimi StrongA jaded businessman who doesn't believe in love crosses paths with a witch or two. A case of mistaken identity leads to shenanigans, and kissing!Heat level: Sweet",
  "genres": [
    "Anthologies",
    "Romance",
    "Humor",
    "Contemporary Romance",
    "Contemporary",
    "Romantic Comedy"
  ],
  "author": "Melanie Marchande",
  "average_rating": "4.07",
  "url": "https://www.goodreads.com/book/show/24794170-lol-romantic-comedy-anthology---volume-3---sixteen-all-new-romance-stori"
}