{
  "title": "Dream of Me",
  "description": "From the author who brought you the award winning Grey Wolves and Elfin Series, now brings you a new series based on the human legend, the Sandman. The truth of who and what he is lies between these pages and he is so much more than anyone could have ever imagined.  “In the evening… [he] blows softly upon their necks, till their heads begin to droop. […] Under each arm he carries an umbrella; one of them, with pictures on the inside, he spreads over the good children, and then they dream the most beautiful stories the whole night.” ~ Hans Christian Anderson  Since the dawn of time, Brudair, otherwise known as the Sandman to the world, has faithfully lived out his purpose, faithfully performed his duties. He has never questioned his lot among the immortals, until now, until her. Sarah Serenity Tillman, a consummate beauty both inside and out, is a high school senior five months from her graduation. She has great plans, dreams of leaving the small town of her childhood behind her forever. But destiny has other plans, and it’s the Sandman’s job to make sure those plans are fulfilled.  The tall muscular Sandman, known as Dair to his friends, dressed in black, wrapped in shadows, is more than a myth. And he has a job to do. His very existence makes him a creature of the night, because dreams, (yes the legends got that part right), were indeed his specialty. But his purpose was more than just weaving dreams for sleeping children. No, his dreams were made to influence, made to ensure that certain special individuals, those individuals who would change the course of history, actually accepted their chosen destiny.  Little does Serenity know that she is Dair’s next assignment. And the dream that he weaves for her, if she follows its influence, will change the course of, not only her life, but possibly the whole of history as well. But she isn’t the only one being influenced. The beauty inside of her was weighing on the Sandman, lighting up the darkness that was his constant companion. Her light was warmth, it was life, and he didn’t understand how he had survived the previous millennia without it.  The Sandman was indeed greater than anything humans had ever imagined, and his purpose was vital to the course of history. So what happens when the weaver of dreams gets so distracted by a mere human that he ignores his own duties in the immortal realm? How can an immortal who was never meant to have a mate, join a young woman in her destiny without irrevocably changing the lives of millions and potentially altering history in a way the Creator never intended?  “Dream of me, Princess,” Dair whispered into her ear. “Then weave me a dream, Sandman,” she said softly. “And we can dream together.” As her eyes grew heavy, she heard Dair’s voice telling her to sleep, to open her mind to him and let him in. I’m all yours, she thought as sleep finally claimed her.",
  "genres": [
    "Fantasy",
    "Romance",
    "Young Adult",
    "Mythology",
    "Paranormal Romance",
    "New Adult",
    "Amazon"
  ],
  "author": "Quinn Loftis",
  "average_rating": "4.02",
  "url": "https://www.goodreads.com/book/show/24793513-dream-of-me"
}