{
  "title": "Cabal",
  "description": "WINNER OF THE FRENCH GRAND PRIX DU ROMAN POLICIER'Beautifully written . . . An excellent thriller.' WALL STREET JOURNAL'Zen is one of the greatest creations of contemporary crime fiction.' OBSERVERAN AURELIO ZEN MYSTERYPrince Ludovico Ruspanti died falling a hundred and fifty feet in St Peter's church, in the heart of the Vatican. But did he fall, or was he pushed? Inspector Aurelio Zen finds that getting answers isn't easy, as witness after witness is mysteriously silenced - by violent death. To crack the secrets of the Vatican, Zen must penetrate the most secret place of the Cabal.'A terrific read combining history, travel, sex, violence and of course the very understated brilliance of that complex character Aurelio Zen.' 5* reader review'Excellent.' 5* reader review'You plunge straight into Zen's Italian crime-world. Gripping in its intensity, its atmosphere and its understanding of this is a masterpiece and I read and re-read it.' 5* reader reviewPRAISE FOR MICHAEL DIBDIN AND THE INSPECTOR ZEN 'He wrote with real fire.' IAN RANKIN'A maestro of crime writing.' SUNDAY TIMES'One of the genre's finest stylists . . . And Zen himself is a masterly he is anti-heroic and pragmatic but obstinate, cunning and positively burdened with integrity.' GUARDIAN'Dibdin tells a rollicking good tale that you want both to read fast, because of its gripping storyline, and to linger over, to savour the evocative descriptions of place and mood.' INDEPENDENT'One of British crime fiction's most distinguished and distinctive voices.' ANDREW TAYLOR'Dibdin has a gift for shocking the unshockable reader.' Ruth Rendell'Zen is one of the greatest creations of contemporary crime fiction.' OBSERVER'I love the way these books capture the atmosphere and contradictions of Italy.' 5* reader review'Aurelio Zen novels are a great treat.' 5* reader review'There is no better writer than Dibdin. His books are a joy to read.' 5* reader review'Love these books . . . I am sure you will get hooked too!' 5* reader review",
  "genres": [
    "Mystery",
    "Crime",
    "Fiction",
    "Italy",
    "Detective",
    "Mystery Thriller",
    "Italian Literature"
  ],
  "author": "Michael Dibdin",
  "average_rating": "3.70",
  "url": "https://www.goodreads.com/book/show/11502671-cabal"
}