{
  "title": "Club Girl",
  "description": "Abducted and trafficked from her home ten years ago, Gabby Ward has been through more than any other women in her age, with the scars to prove it. When she finally escapes from the cruel bondage of her pimp, she discovers that most of the world doesn't want to take in someone like her.Desperate to find some way out of the reach of her pimp, she finds herself in the employment of the Hell Brigade MC as a club girl, earning her pay the only way she's known on her back.Nick Parker was supposed to be just another guy in the club to tick off before her day was over. But when he makes her a tempting offer--a tantalizing glimpse of something more than just endless servitude--Gabby doesn't know what to think. Half a life time of hiding her trust in others has left her wary of offers that sound too good to be true. But there's something about Nick, something about him that leaves Gabby hoping that maybe, just maybe, there might be a tiny ray of hope in the darkness.Come along this wild ride with bestselling author Evelyn Glass as Gabby and Nick navigate through the murky waters of their past in an attempt to reach the future that they're meant for.EXCERPTWhen his motorcycle came to a stop outside the clubhouse, she got out, took off her helmet, and handed it to him. “Thank you for a lovely meal!”Now that she decided on her next course of action, Gabby was feeling supremely confident again. After all, she made a living out of seducing men. This was her job, and she was damn good at it.He took off his helmet and hung it on the bar. “You’re welcome.”She ran a hand through her hair and watched as his pupils dilated. Good! It was working. Gabby put a hand on his arm. He tensed, but didn’t say anything. Leaning forward, she claimed his lips. The touch was brief, soft, but the sensations that careened through her veins were unpredictably tumultuous. Need and heat mingled in equal quantities and stormed through her senses. She sucked in a deep breath of air and inhaled the scent of him; spicy and strong. It hit her nostrils and doubled the desire that simmered in her belly.Her tongue licked his lips, and he granted her access. She explored the crevices of his mouth, enjoying the feel of his mouth against hers. His breath was hot. She gripped his shoulders as she clung to him as a drowning man does to anything that can keep him afloat.",
  "genres": [],
  "author": "Evelyn Glass",
  "average_rating": "3.45",
  "url": "https://www.goodreads.com/book/show/24795568-club-girl"
}