{
  "title": "The Legendary Life of Bee Ho Gray",
  "description": "The amazing life of this World Champion Trick and Fancy Roper, trick rider, knife thrower, whip artist, banjoist, actor and comedian is finally revealed in The Legendary Life of Bee ho Gray.Growing up in Indian Territory among the legendary chiefs who had befriended his family, Bee Ho Gray experienced the final days of the real Wild West. As America moved into the 20th Century, the way of life in the West was quickly disappearing, soon to exist only as the subject of myth and popular entertainment. Bee ho knew he was destined for the life of a Western performer. By the age of nineteen, he was on the road with Wild West shows where he performed with Buffalo Bill, Will Rogers, Tom Mix, Hoot Gibson and dozens other Western icons, many of whom were just getting their start in the fledgling entertainment industry. His career took him from Wild West shows to vaudeville, Broadway, silent movies and radio as he presented his unique skills to thousands of spectators in several countries. Born in 1885, Bee Ho Gray was named by Quanah Parker, last Chief of the Comanche and used his upbringing in Indian Territory as a springboard to an amazing career as a Wild West performer. During his fifty years of fame, he was the star on thousands of vaudeville stages and the key performer in several Wild West shows including the famous Miller Brothers 101 Ranch. His daily companions were legends like Buffalo Bill; will Rogers, Tom Mix, Bill Pickett, Iron Tail and many others who helped define the legacy of the American West. Through years of genealogical sleuthing, the author discovered long-lost suitcases full of personal scrapbooks, memorabilia, and diaries. He sought out the few remaining old-timers who once knew Bee Ho. As their fading memories were rekindled, fantastic stores allowed him to piece together an accurate history of his great uncle in - The Legendary Life of Bee Ho Gray.",
  "genres": [
    "Biography",
    "History"
  ],
  "author": "Clark Gray",
  "average_rating": "4.56",
  "url": "https://www.goodreads.com/book/show/24789313-the-legendary-life-of-bee-ho-gray"
}