{
  "title": "The Modigliani Girl",
  "description": "Anna Bright never wanted to write a novel. At least, that’s what she tells herself. But a chance encounter with a famous novelist and a surprise gift of an art book cut a chink in Anna’s resolve. The short, tragic life of Modigliani’s mistress, Jeanne Hébuterne, becomes an obsession and before she knows it, she has enrolled on a creative writing course, is writing about a fictional Jeanne and mixing with the literati. As her novel grows and takes on a life of its own, Anna feels her own life becoming increasingly irrelevant. She is absorbed by the story of Jeanne, who committed suicide aged 19 following the artist’s death, jumping from a high window in Paris, pregnant with his child. When Anna is invited to take part in a televised literary competition, hosted by an unscrupulous writing guru, she agrees, but later regrets her choice. Under the gaze of the camera, she has become part of a TV circus; unlike the Bohemian Jeanne, she has sold out. Will she manage to save her sanity and her relationship, before she becomes a by-product of the literary world? A deceptively light satire on the modern writing and publishing world. Praise for Jacqui Lofthouse’s novel ‘The Temple of Hymen’ “A remarkable, often beautiful and startling piece of writing. A considerable achievement.” – John Mortimer “Deceptive; entertaining and unusual” – Louis de Bernières “A very impressive book… a superbly recreated historical period and a passionate investigation into femininity, all wrapped up in a mysterious and well-paced narrative.” – Jonathan Coe Praise for Jacqui Lofthouse’s novel ‘Bluethroat Morning’ “A classic tale of longing” – Time Out “A thriller full of twists and turns that keeps the reader guessing. Every word is magical, almost luminous” – Daily Mail Formerly titled How To Be A Literary Genius.",
  "genres": [
    "Fiction"
  ],
  "author": "Jacqui Lofthouse",
  "average_rating": "3.83",
  "url": "https://www.goodreads.com/book/show/24808578-the-modigliani-girl"
}