{
  "title": "Passage",
  "description": "Acclaimed science fiction and fantasy writer Lois McMaster Bujold--five-time winner of the Hugo Award--brings us the third installment in her \"New York Times\" bestselling romantic fantasy\"The Sharing Knife, Volume Passage\"Young Fawn Bluefield and soldier-sorcerer Dag Redwing Hickory have survived magical dangers and found, in each other, love and loyalty. But even their strength and passion cannot overcome the bigotry of their own kin, and so, leaving behind all they have known, the couple sets off to find fresh solutions to the perilous split between their peoples.But they will not journey alone. Along the way they acquire comrades, starting with Fawn's irrepressible brother Whit, whose future on the Bluefield family farm seems as hopeless as Fawn's once did. Planning to seek passage on a riverboat heading to the sea, Dag and Fawn find themselves allied with a young flatboat captain searching for her father and fiancE, who mysteriously vanished on the river nearly a year earlier. They travel downstream, hoping to find word of the missing men, and inadvertently pick up more a pair of novice Lakewalker patrollers running away from an honest mistake with catastrophic consequences; a shrewd backwoods hunter stranded in a wreck of boats and hopes; and a farmer boy Dag unintentionally beguiles, leaving Dag with more questions than answers about his growing magery.As the ill-assorted crew is tested and tempered on its journey to where great rivers join, Fawn and Dag will discover surprising new abilities both Lakewalker and farmer, a growing understanding of the bonds between themselves and their kinfolk, and a new world of hazards both human and uncanny.",
  "genres": [
    "Fantasy",
    "Romance",
    "Fiction",
    "Audiobook",
    "Fantasy Romance",
    "Science Fiction Fantasy",
    "Magic"
  ],
  "author": "Lois McMaster Bujold",
  "average_rating": "3.96",
  "url": "https://www.goodreads.com/book/show/10164981-passage"
}