{
  "title": "A Walk In Connection",
  "description": "Living with wolves has provided Tracy with countless experiences that have changed her life in unimaginable ways. As a cofounder of Wolf, a wolf sanctuary in Colorado, Tracy has spent half her life studying wolf behavior and body language. Tracy has learned to leash train and walk wolves, often with painful consequences. Join Tracy as she develops a special bond with an intense British Columbian gray wolf named Shaman. Shaman becomes a great wolf teacher, and eventually the shy wolf grows to trust her. Tracy relies on her instinct and intuition as she moves to calm sensitive wolves like Shaman. She does well but believes in her heart that she can do better.A horse named Ikus comes into Tracy’s life and dramatically changes her understanding of horse-to-person communication. Driven to find her own way to connect with horses, Ikus becomes a professor in nature’s university as Tracy embarks on a journey of learning to speak horse language. Something profound happens when Ikus, a horse with an attitude and a dislike of being haltered, gives Tracy an unexpected lesson in resolving feral behavior. Not only does Ikus teach Tracy how to stop his run-away glitch but Tracy discovers a missing link in her previous wolf-handling life that will forever change her approach to resolving feral behavioral problems in both species. This experience ultimately provides Tracy with a foundation for clear communication, and it awakens in her an effective and natural way to connect with animals.Tracy’s world of wolves and horses is forever inspired as she moves to a new level of connection beyond anything she believed possible, and she strives to share what she has learned. Sally, a young woman from the UK, comes to volunteer at the sanctuary and learns to calm a very frightened eighteen-year-old horse who is going blind and in danger of injuring himself.International Book Awards Finalist 2016.Reader’s Favorite Book Awards Finalist 2016.Winner Best Book Awards Animals/Pets General Category 2016.",
  "genres": [],
  "author": "Tracy Ane Brooks",
  "average_rating": "3.71",
  "url": "https://www.goodreads.com/book/show/24797460-a-walk-in-connection"
}