{
  "title": "The Fairfield Series Box Set",
  "description": "NEW COVERS and re-edited! Discover the lives and loves of Fairfield. Over 200 five-star reviews on the books in this series. All three novels have been on the Amazon Bestseller lists for Women's Fiction, Mystyery, Suspense, Detective categories, plus now there is a novella! Each book is a stand-alone with their own HEA! Carol's When Detective Tom Rivers first meets beautiful Carol Fletcher, he thinks he has been visited by an angel. The gentle ER nurse attending him after an accident, captivates him and when she slips away, he searches diligently to find her. A man used to getting what he wants, Tom works to earn Carol’s trust, knowing that she is the woman for him. Carol, having grown up with her parent’s manipulations, is determined to make her own way and become her own person. She holds a secret and is cautious about giving in to the charms of any man, particularly the persuasive detective. But once she gives him a chance, she finds acceptance as well as love in his arms. When Carol becomes the object of a stalker’s infatuation, Tom vows to keep her safe. When the stalker’s intentions turns deadly, Tom is determined to stop at nothing to bring her back to safety. Laurie's Beautiful Laurie Dodd was perfectly happy with her life. Raised by her loving aunt, she was ready to discover life out on her own. A new town, a new teaching job, a new apartment, and new friends. Finding a new man was not on her list, especially not one with the reputation of a player. Rob McDonald, a local firefighter, had grown tired of one-night stands, but had no desire to be paired with the new woman in town. Until he met her. One look was all it took and Rob knew that Laurie was the one for him, but he was going to have to work to convince her that he was a changed man. One that was worthy of her. A fire at the elementary school brought them together, but illness and deceit threatened to tear them apart. Emma's Beautiful Emma Dodd has always taken care of everyone. She raised her niece when they were orphaned and she cares for the students that she counsels. Deciding to move to Fairfield where her niece now lives, she was hoping to finally find a place to call home. Jake Campbell, was gorgeous enough to catch any woman’s eye, but he had a hard time finding the right one for him. A Fairfield detective, he lives with his mother to help care for her since she was diagnosed with a debilitating disease. After meeting Emma, he knows he has met the woman of his dreams. Now he just has to convince the independent Emma that it is time someone took care of her. While helping one of her students, Emma becomes suspicious of criminal activity in her new town. Will Jake be able to save Emma in time for them to build a life together? Fireworks Over Welcome back to Fairfield, home of good friends and romance. Brock Sinclair retired from the military, living a solitary life, moved to Fairfield looking for his estranged daughter. Jean Roberts was a widow not looking for another love. When they meet, neither can resist the sparks between them. When an arsonist threatens the town and Jean, Brock will fight to save her. Along the way, both discover that love the second time around is just as sweet. **Due to language that some may consider crude and scenes of an explicit sexual nature, 18+ only readers!** SMALL TOWN ROMANCE!",
  "genres": [],
  "author": "Maryann Jordan",
  "average_rating": "4.49",
  "url": "https://www.goodreads.com/book/show/24808880-the-fairfield-series-box-set"
}