{
  "title": "You Don't Look Sick!: Living Well with Invisible Chronic Illness",
  "description": "\"\"Coming to terms with this reality was a lot like accepting the death of a loved one.\"\"You Don't LOOK Sick!: Living Well with Invisible Chronic Illness chronicles a patient's true-life accounts and her physician's compassionate commentary as they take a journey through the three stages of chronic illness--Getting Sick, Being Sick, and Living Well. This resource helps you focus on building a meaningful life that contains illness as opposed to a life of frustration and fear. Designed for patients in at all stages of the chronic illness journey, this book will also be illuminating for caregivers and loved ones.From the book: \"\"I've learned that having a chronic illness is not a prison sentence. It does not mean I must spend the rest of my life feeling depressed and angry, locked away from the world inside my little sick box. It does not mean that I am useless and no longer have any gifts to share, but it may mean that I must develop some new ones.\"\"You Don't LOOK Sick! addresses practical aspects of chronic illness, such as: hiring a doctor managing chronic pain coping with grief and the loss of function winning battles with health and disability insurers countering the social bias against the chronically ill recognizing the limitations of chronics illness care and charting a path for changeIn You Don't LOOK Sick!: Living Well with Invisible Chronic Illness, you will find stories, dialogue, humor, examples, and analogy of the three stages to illustrate a challenging but navigable journey. You will also find suggested reading materials for learning to live well, medical Internet resources, illness-specific Web sites, names and addresses of national associations, and a bibliography of medical books by topic. The short chapters and straightforward language of the book will be helpful for readers who are weary and dispirited. From the authors: \"I've learned that having a chronic illness is not a prison sentence. It does not mean I must spend the rest of my life feeling depressed and angry, locked away from the world inside my little sick box. It does not mean that I am useless and no longer have any gifts to share, but it may mean that I must develop some new ones.\"--Joy H. Selak\"My goal is to work with patients so that, like world class athletes, they can perform at their peak capacity. My job is more than giving answers; I must educate, counsel and encourage patients to set goals and implement a personal care program as well as take appropriate medications.\"--Dr. Steven Overman The authors are experienced public speakers. If you wish to inquire about their availability to speak to patients or health care professionals, please contact Joy Selak by email at JoyWrites@austin.rr.com.",
  "genres": [
    "Health",
    "Nonfiction",
    "Medical",
    "Disability",
    "Self Help",
    "Illness"
  ],
  "author": "Joy H. Selak",
  "average_rating": "3.99",
  "url": "https://www.goodreads.com/book/show/1150391.You_Don_t_Look_Sick_"
}