{
  "title": "Calvin and Hobbes: Sunday Pages, 1985-1995: An Exhibition Catalogue",
  "description": "Celebrating an exhibit of ten years of Sunday comics featuring the beloved boy and his tiger, Calvin and Sunday Pages 1985-1995 is sure to bring back memories.New York Times best-seller!Everyone misses Calvin and Hobbes .It reinvented the newspaper comic strip at a time when many had all but buried the funnies as a vehicle for fresh, creative work. Then Bill Watterson came along and reminded a new generation of what older readers and comic strip aficionados A well-written and beautifully drawn strip is an intricate, powerful form of communication. And with Calvin and Hobbes , we had fun—just like readers of Krazy Kat and Pogo did. Opening the newspaper each day was an adventure. The heights of Watterson's creative imagination took us places we had never been. We miss that.This book was published in conjunction with the first exhibition of original Calvin and Hobbes Sunday pages at The Ohio State University Cartoon Research Library. Although the work was created for reproduction, not for gallery display, was a pleasure to see the cartoonist's carefully placed lines and exquisite brush strokes. In an attempt to share this experience with those who were unable to visit the exhibition, all of the original Sunday pages displayed are reproduced in color in this book so that every detail, such as sketch lines, corrections, and registration marks, are visible. On the opposite page the same comic strip is printed in full color. Because Watterson was unusually intentional and creative in his use of color, this juxtaposition provides Calvin and Hobbes readers the opportunity to consider the impact of color on its narrative and content.When I first contacted Bill Watterson about the possibility of exhibiting his original work, I used the term \"retrospective.\" He replied that we might be able to do an exhibit, but that calling it a retrospective made him uncomfortable. He felt that a longer time was needed to put Calvin and Hobbes in the historical perspective implied by that term. Nonetheless, this show is a \"look back\" at the comic strip as we revisit favorites that we remember. Calvin and Sunday Pages 1985-1995 is particularly interesting because each work that is included was selected by Bill Watterson. His comments about the thirty-six Sunday pages he chose are part of this volume. In addition, he reflects on Calvin and Hobbes from the perspective of six years, and his essay provides insights into his life as a syndicated cartoonist.Reprint books of Calvin and Hobbes are nice to have, but the opportunity to see the original work and read Bill Watterson's thoughts about it is a privilege. He generously shared not only the art, but also his time and his thoughts. When I first reviewed the works included in the exhibit, I knew that everyone who visited it would begin with laughter and end with tears.On behalf of all who enjoyed Calvin and Hobbes , thank you, Bill Watterson.--Lucy Shelton Caswell, Professor and Curator The Ohio State University Cartoon Research Library, June 2001",
  "genres": [
    "Comics",
    "Humor",
    "Graphic Novels",
    "Fiction",
    "Comic Book",
    "Comic Strips",
    "Graphic Novels Comics"
  ],
  "author": "Bill Watterson",
  "average_rating": "4.71",
  "url": "https://www.goodreads.com/book/show/24820.Calvin_and_Hobbes"
}