{
  "title": "Tales of the White Witchman: The Seraph Chronicles Volume One",
  "description": "Tales of the White Witchman is the first omnibus edition of the acclaimed Seraph series, containing the first three adventures: The Trellborg Monstrosities, The Crystal Void and Tomb of the Aeons.  'Wonderfully evocative tales of blood, bullets and ice' David J Rodger 'Anyone who loves a good war or horror story should pick these up.' 4/5 Serena Nelson - Good Reads.com 'I really liked The Trellborg Monstrosities and I encourage you to pick it up.' 4.5/5 Nerds Domain  Seer, witchman, sorcerer, one man dares stand against the might of dread Cthulhu and his minions throughout the ages, that man is the mysterious Mister Seraph  The Trellborg Monstrosities The year is 1943 and as the war stands on a knife edge an ancient evil stirs in remote Norway. British special forces are dispatched to counter this new Nazi threat, but is their mysterious civilian adviser Mister Seraph, truly on the side of the angels or pursuing some dark agenda of his own?   The Crystal Void is the first Mon Dieu! Cthulhu adventure set during 1810, the height of the Napoleonic wars. Major Seraph teams up with the dashing if rather dim French Hussar Gaston d’Bois to rescue his fragrant fiancée Odette. But can the duo foil the evil machinations of the Marquis Da Foz, defeat his loathsome underwater allies and prevent the opening of the fearsome crystal void?  Tomb of the Aeons A lost German tank crew stumble upon a strange temple complex in the heart of the desert during Rommel’s great offensive in 1941. Finding themselves trapped in the unholy ziggurats, their only hope is their strange guide and fellow captive, Captain Seraph. Can they defeat this charnel house's newly awoken ophidian inhabitants and survive the horror lurking at the heart of this tomb of the aeons?",
  "genres": [],
  "author": "John Houlihan",
  "average_rating": "4.36",
  "url": "https://www.goodreads.com/book/show/24811525-tales-of-the-white-witchman"
}