{
  "title": "Sinister Desires",
  "description": "Tired of hearts & flowers? Does the sight of teddy bears make you want to throw up in your mouth? Like your erotica as dark as your soul and just as twisted? Indulge your SINISTER DESIRES with these ten delectable tales of forbidden fancy from previously banned authors.  Available 17-28 February 2015 Only  A percentage of the proceeds from this anthology will go to the National Coalition Against Censorship (NCAC). We will not go gently!  WARNING: Anticipate that ALL books in this antho contain VERY disturbing situations, possible triggers, strong language, and graphic violence.   SINISTER DESIRES features:  NYT, USA Today, & International Bestselling Authors  Beneath the Burn by Pam Godwin Amid corruption and power, rock stars and drugs, Jay and Charlee must face their worst fears. When the battle is over, what will be left...Beneath The Burn.  Captive in the Dark by CJ Roberts This New York Times Bestseller is the story of a young woman kidnapped and held hostage by a human trafficker out for revenge. Gritty, violent, and not for the faint of heart. 18+   Amazon, Barnes & Noble, & International Bestselling Authors  Empathy by Ker Dukey Brother. Detective. Contract Killer. Blake is all three and the last thing he wants is...EMPATHY.  Therapist by Jaden Wilkes A handsome and charming sociopath meets his match in a femme fatale intent on destroying him from the inside out.  The Decimation of Mae by D.H. Sidebottom He called me his lamb. He was the shepherd. As Master, he demanded my mind and surrender and used it to shatter my heart. His violence broke my spirit. His hatred slayed my soul.But it was his kind and gentle side that took my life? Literally.  Joseph Fallen by M.S. Willis There is a fine line between genius and madness, love and hate, right and wrong. Discover how Joseph falls from light into the pitch black depths of ultimate darkness.  Roman by Kimber S. Dawn Roman is a man of little words and lesser morals. Roman has never felt emotions like guilt, shame, or remorse. How do I know all of this? Because, my name is Heather Mackenzie and I've been number thirteen for a lot longer than I ever intended to be.  Flawed by Francette Phal All Lacey wants for herself is a better life. And she does all she can to work towards that goal. But one mistake brings her world to a crashing halt, redirecting her on the path to utter destruction. But it's a destruction she finds herself craving beneath the brutal hands of serial killer Knox Bishop.  Facade by Ker Dukey & D.H. Sidebottom I am, Star, and just like with some stars in the sky, the light you see is an echo, a facade, I am already gone. I am a no one. Especially to him. To him I am the dark in his desires, the corrupt in his depravity.The sin in his immorality.  Her Master's Courtesan by Lily White He does not want love or kindness. He only wants complete submission. Erotic Horror.",
  "genres": [
    "Anthologies"
  ],
  "author": "Pam Godwin",
  "average_rating": "4.33",
  "url": "https://www.goodreads.com/book/show/24832792-sinister-desires"
}