{
  "title": "Suboxone: Take Back Your Life From Pain Medications",
  "description": "Suboxone is a very special medication. It has the amazing ability to allow patients dependant on legal or illegal medications, to experience a fully painless detoxification. The mechanism of this medication is totally unique, and is successful when other treatments fail. Hardcover version available (ISBN 0-9772729-9-0). Suboxone does not require in-patient treatment. It can simply be called into a local pharmacy over the phone. In contrast to pain medications, Suboxone use is strongly supported by the DEA, FDA, the Justice Department and all major addiction societies. You can take Suboxone 30 days or 30 years. And if you have chronic pain, it may be strong enough to replace your current pain medication. In this one-of-a-kind book, Dr. Schaller offers patients and practitioners highly useful information in the practical use of Suboxone. Dr. Schaller has worked with pain medications and addicted individuals his entire career. He is the author of fifteen books, and has invented dozens of unique pain treatments. He holds a Diplomate from the American Society of Pain Management and is the inventor of an antidepressant with anti-arthritis properties. As long ago as the early 1980's, he was working as the Director of Education at a residential drug rehabilitation facility. Since then, he has helped a wide-range of people from all walks of life, and has successfully treated individuals with both psychiatric and addiction problems. He has extensive experience with 12 Step programs and alternative medicine addiction treatments. His passion is healing the many physiological causes of addiction which are often missed. Dr. Schaller is currently researching the body's own narcotic stimulators, which are usually low in individuals struggling to maintain sobriety. Dr. Schaller offers services to individuals throughout the United States.",
  "genres": [],
  "author": "James Schaller",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/2482264.Suboxone"
}