{
  "title": "Everybody Rise",
  "description": "An instant New York Times bestseller!Chosen as one of Summer's Best Books by People MagazineFeatured in Time Magazine's Summer ReadingEntertainment Weekly's Summer Must ListGood Housekeeping Beach Reads Feature\"A witty tale about a high-society wannabe...Little is more delicious than watching an ambitious but tragically flawed protagonist brought down - especially in a designer cocktail dress.\" \n-The Washington Post\n\n\n\n\nEveryone yearns to belong, to be part of the \"in crowd,\" but how far are you willing to go to be accepted? In the case of bright, funny and socially ambitious Evelyn Beegan, the answer is much too far...At 26, Evelyn is determined to carve her own path in life and free herself from the influence of her social-climbing mother, who propelled her through prep school and onto New York's glamorous Upper East Side. Evelyn has long felt like an outsider to her privileged peers, but when she gets a job at a social network aimed at the elite, she's forced to embrace them.Recruiting new members for the site, Evelyn steps into a promised land of Adirondack camps, Newport cottages and Southampton clubs thick with socialites and Wall Streeters. Despite herself, Evelyn finds the lure of belonging intoxicating, and starts trying to pass as old money herself. When her father, a crusading class-action lawyer, is indicted for bribery, Evelyn must contend with her own family's downfall as she keeps up appearances in her new life, grasping with increasing desperation as the ground underneath her begins to give way.People and Time Inc. are not affiliated with, and do not endorse products or services of St. Martin's Press. People's Pick Logo is a Registered Trademark of Time Inc. and is used under license.",
  "genres": [
    "Fiction",
    "Chick Lit",
    "Contemporary",
    "Audiobook",
    "Adult",
    "New York",
    "Literary Fiction"
  ],
  "author": "Stephanie  Clifford",
  "average_rating": "2.94",
  "url": "https://www.goodreads.com/book/show/24823031-everybody-rise"
}