{
  "title": "Double Dragon's Blood: Boxed Set",
  "description": "Hidden within the pages of this anthology, are the impassioned journeys of four separate, erotic, urban fantasies. All are connected by the mystifying ancestry of descendants of the dragon. Two star-crossed lovers are torn apart after a single night of passion ends in tragedy, a three-way tryst that becomes a life or death ordeal, a jilted love triangle in an exotic land, a centuries old curse and ancient lineage that haunts a blood line for generations to come.  The Double Dragon’s Blood Series comes jam packed with tantalizing sex, riveting action and heart warming romance. Inspired by continuous requests of fans, Kali Willows has brought together her best selling stories of her delicious dragon twins and other sensational characters in one complete collection for you to indulge in. With the mysterious match making skills of Madame Evangeline and her 1Night Stand service, explore how it all began and unravelled for our dragon heroes and heroines.   \nDragon's Bond\n In 1952, it’s not proper for a woman to chase after a man, but Lien Long is no ordinary woman. Shattered by his abandonment after their single night of passion ends in tragedy, she travels from a life of sexual servitude in Shanghai to San Francisco to chase her career, her dreams, and her one true love. Armed with new knowledge of her dark lineage and at the encouragement of a colleague, she enlists the help of Madame Eve to arrange a 1 Night Stand, in hopes to find her way into the arms of her soul mate once more.  Cursed with an ancient legacy he knew nothing about, Shen Li flees to San Francisco after the devastating death of his twin brother. Tormented by the guilt and shame of his indulgence in lust and his longing he cannot diminish for his beloved, he accepts the advice of his mentor and boss, to contact the 1 Night Stand services. He seeks an escape of passion to release his sins of the past and move on with his life. What awaits Shen is eye-opening truth about the life he had forsaken. Will he find the night of fiery paradise he hopes for?   \nDouble Dragon Seduction\n Gwen Trembley is disturbed by the upcoming wedding of her reprehensible ex, and coping with her emerging fiery talent. Gwen seeks the services of 1NS for a night where new carnal knowledge will revive her damaged soul. Madame Eve has the perfect arrangements, but perhaps twice what she bargained for.  Twin brothers Tatsu and Yong Li, are in desperate need of a unique woman who can accept them as inseparable. They carry not one, but two secrets. These exotic brothers can’t be with just any woman, and if Gwen is willing to try, she will face the most passionate, lust-filled night of her life, but will she survive? Will they? 1NS finds a match they never expected possible.   \nDragon Temptation\n Cindy Dunham has become sexually emaciated, after a long dry spell and no prospect of romance in her near future. With her best friend’s upcoming wedding, loneliness is taking the lead, and she is starving for erotic rhapsody. The prospect of a blind date for the nuptials is embarrassing, but a necessary evil. The match Madame Evangeline finds for her leaves her reeling with conflict and jealousy. Will she ever get her carnal hunger gratified?   \nDragon's Breath\n Eternal suffering is the fate dealt to Roark Blackwell. A fierce protector under a curse, he longs for a woman can never have. By day, a hideous stone creature, and by night, a flesh and blood immortal, starving for the touch of a single woman. After centuries of torment, he takes his destiny into his own hands and seeks the help of Madame Evangeline.",
  "genres": [],
  "author": "Kali Willows",
  "average_rating": "4.22",
  "url": "https://www.goodreads.com/book/show/24821767-double-dragon-s-blood"
}