{
  "title": "Mending Heartstings",
  "description": "Just when life seems to be manageable, you’re thrown radically off course by “the one”. “The one” you weren’t expecting. “The one” who single handedly holds the key to the tattered and rusted lock to the walls surrounding your heart. Letting her into your protected sanctuary will only serve one purpose, intentional infliction of pain and heartache.  Jon is a man on a mission with only one agenda, to survive…to survive his past, and avoid letting his future be consumed by his history. It’s all really simple, until she walks into his world and turns it, on its axis. She makes him yearn for things he never wanted, or at least didn’t realize he ever would. Now his dreams and writings are consumed with the fantasy that this girl could change everything. But deep down he knows she deserves better. Better than him. Better than anyone he’s ever met.  He’s the lead guitarist for Garrett McKenna’s band. His life consists of touring, studio time, and writing music. That’s it. Staying healthy means keeping his routine, which has been easy enough until this little effervescent beauty rocks his world. Now he’s left questioning everything and doing some soul searching to decide if he’s equipped to give what he knows she needs and deserves.  Whitney avoids love at all costs. She’s not scared of it. She’s too strong to be that weak. She refuses to allow herself to lose her mind over another person, when there’s a high probability of getting her heart broken. She’s witnessed it more times than she can count, and she’s less than interested in taking the gamble.  Her strong will has served her well in life. Very few people know her secrets. She prefers to keep it that way. Her friends and family own her heart and deep devotion. She could easily do without the rest of the population but plays nice so she doesn’t appear to be the major bitch she knows she is on the inside.  Everything in her life makes sense. Her life is filled with more love and laughter than most will ever see, and it feels complete to her. She’s simply satisfied…until him. He complicates things. His life isn’t something she understands or is willing to try to figure out. But she can’t keep her mind from wandering to the scruff faced, gorgeous guitarist, no matter how hard she tries.  He’s everything she’s never wanted, yet her heart is telling her differently. She fears she’s diving headfirst off the cliff of heartache. She’ll never recover from her brief no-strings weekend with this man. If she opens her heart it will be “the end”… no matter what. The question is what kind of ending will it be? Not all fairy tales have the happily ever after.",
  "genres": [
    "Romance"
  ],
  "author": "Felicia Lynn",
  "average_rating": "4.10",
  "url": "https://www.goodreads.com/book/show/24821450-mending-heartstings"
}