{
  "title": "Plot Fiction like the Masters",
  "description": "Plot Fiction like the Masters is an exercise in reading like a writer – reading with the purpose of figuring out how the plots of a few recognized masterpieces succeed in making readers turn the page. The reason for proposing this as a way of learning plot-making is my own experience as a writer -- that the most accomplished novelists are the greatest teachers and that their lessons may be drawn from a close study of their work. The three novels under consideration – Ian Fleming’s Dr. No, Jane Austen’s Pride and Prejudice and Evelyn Waugh’s A Handful of Dust – have all achieved astonishing success. They are all not only recognized masterpieces of their very different genres but have also won the glittering prizes – fame, fortune, movie deals -- for which many a haggard writer would sell his or her soul to the Devil. There are, of course, many other books for sale about the art and craft of story-building. But this book is different from the others, because its plotting lessons are not formulaic but concrete and practical – drawn from a close reading of successful books. For unless theories are informed by the specifics of successful stories, they are (for me, at least) of limited value. That is why this book is not about how plots should be made – but how, in three extraordinary novels, they actually were made. A great plot is a page-turning machine. The reader is immediately grabbed by it and then pulled along by an ever-changing, propulsive dynamic of suspense, curiosity and surprise. All three of these very different novels -- a James Bond thriller, a prototypical “Regency Romance” and a scathing 20th-century black comedy – are driven forward by this kind of engine. One of the chief objectives of this book is – not only to examine the parts of this engine as it moves along, but also to discover the secret of the energy that propels it forward.  Plot Fiction like the Masters is comprised of five chapters, entitled: Introduction; The Case of James Bond; Pride, Prejudice and Plotting; Waugh and the Architecture of Dark Comedy; and Conflict and the Logic of Story-building. Ben Cheever (the author of several fine novels) has written a foreword.",
  "genres": [
    "Writing",
    "Nonfiction"
  ],
  "author": "Terry Richard Bazes",
  "average_rating": "4.16",
  "url": "https://www.goodreads.com/book/show/24820962-plot-fiction-like-the-masters"
}