{
  "title": "Lód",
  "description": "Akcja najnowszej powieści Jacka Dukaja toczy się w alternatywnej rzeczywistości, gdzie I wojna światowa nigdy nie wybuchła, jest rok 1924, a Królestwo Polskie wciąż zamrożone jest pod władzą cara i w Belle Epoque. Warszawę skuwa lód – w środku lata burze śnieżne zasypują drogi. Lute, nieziemskie anioły Mrozu, spacerują ulicami miast, zamrażając prawdę i fałsz… Benedykt Gierosławski, zdolny matematyk, ale i niepoprawny hazardzista, na zlecenie carskiego Ministerstwa Zimy zostaje wysłany Ekspresem Transsyberyjskim do skutego lodem Irkucka, skąd ma wyruszyć na poszukiwanie swojego ojca, podobno potrafiącego porozumiewać się z aniołami mrozu – lutymi. Tysiąc rubli gotówką wydobyłby Benedykta z długów, ale czy misja nie jest przypadkiem zbyt niebezpieczna? Szybko okazuje się, że dla Benedykta będzie to podróż, która odmieni jego życie…Fabuła Lodu wprost skrzy się od zapierających dech w piersiach zwrotów akcji, intryg politycznych, miłosnych, kryminalnych i gospodarczych, naukowych i metafizycznych; wypełniona fascynującymi postaciami, z akcją rozpiętą między brudnymi oficynami carskiej Warszawy, luksusami Ekspresu Transsyberyjskiego na tle lodowej Azji, irkuckimi salonami bogatego mieszczaństwa polskiego, a także podniebnym pałacem generała-gubernatora – jest powieścią, na jaką czekali wszyscy miłośnicy prawdziwej przygody, inteligentnej, pobudzającej intelekt i wyobraźnię, zmieniającej nasz pogląd na rzeczywistość.To opowieść o Historji, czyli o tym, co nie istnieje. To kolejny literacki majstersztyk Jacka Dukaja, dzięki któremu czytelnicy będą mogli poznać nie tylko fascynującą, mrożącą krew w żyłach \"inną możliwą\" historię świata, ale również będą mieli okazję wraz z bohaterem powieści odbyć niezwykłą podróż ekspresem transsyberyjskim i stanąć oko w oko z Innym.",
  "genres": [
    "Science Fiction",
    "Fantasy",
    "Polish Literature",
    "Fiction",
    "Audiobook",
    "Novels",
    "Historical Fiction"
  ],
  "author": "Jacek Dukaj",
  "average_rating": "4.16",
  "url": "https://www.goodreads.com/book/show/2484198.L_d"
}