{
  "title": "Alone Together",
  "description": "Release Your Painful Past and Heal Your LifeDiscover and live your true passion and purpose“Wonderfully written! Alone Together takes the reader through a creative journey of releasing negative beliefs while replacing them with empowering thoughts.”~ Peggy McColl , New York Times Best Selling AuthorAlone Discovering the Secrets to Build A Winning Self Image shares the moving heartfelt stories of a woman named, Stella, as she grows from a child to an adult. Along the way she suffers from abuse that makes her portray a false outward appearance of happiness, while burying her pain and anguish deep within.With the help of friends who have heartbreaking stories of their own, Stella slowly realizes her true purpose and takes command of her life.Through Stella’s eyes you’ll gain insight into your own life, and discover tools that awaken you to the power you have to reshape your internal beliefs. You’ll learn uplifting lessons that transform your self-image and enable you “Monica Da Maren's book is full of stories that will make you feel emotions you thought you forgot how to feel. They will all inspire you to face your own past troubles, forgive yourself and find the strength to start healing…Monica's writing reads like a warm conversation with a dear friend…”~ Jennifer Colford , International bestselling author, Managing MotheringMonica Da Maren was born in Guelph, Ontario to immigrant Italian parents. Having suffered abuse as a teen, she turned to writing as a form of therapy and self -awareness. Through the joy of recording her thoughts and feelings she found healing and peace. As a life coach Monica motivates others to release their pain, follow their hearts and live their lives with authentic vibrancy.\"Monica shares a story of tragedy overcome by courage, sorrow overcome by joy and fear overcome by hope. Her story is one shared by many people, one of belief in the lies of their past. In this book, Monica reveals her way out of those lies and into a fulfilled, meaningful life! Let this book be an encouragement to you, to be brave and to discover who you really want to be; even if others try to tell you that this person does not exist.” ~ Sarah Thatcher  , Teacher",
  "genres": [],
  "author": "Monica Da Maren",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/24835879-alone-together"
}