{
  "title": "A Question of Trust",
  "description": "When Jack Merrill becomes earl Haddington inheriting not only a title but the devastating debt that came with it, his friends convince him that there is nothing for it but to gain quick wealth the really old fashioned way…marry into it!  On the hunt for a wealthy bride, Jack stumbles upon Kitty Hayes, the sister of his former target Evelyn. To him, Kitty is everything Eve was not to him – full of a fire and spirit that challenges him but also everything Eve was as well – a wealthy heiress. But Kitty is a married woman! Can he wait it out until she finds her freedom while reeling her in with friendship and seduction so that he might cast his net about the wealthy heiress the moment her divorce is final?After years of marriage with an abusive husband, Kitty Hayes flees Boston hoping to find protection and anonymity with her sister, Eve MacKintosh, now countess Glenrothes in Scotland, while she petitions for a divorce from the man who has made her life a living hell. Mistaken for her sister, Kitty encounters Jack Merrill who seeks friendship, he claims, but Kitty knows what he is hoping for!Certain that she will never marry again and certainly not expecting such a thing from an inveterate womanizer like Jack Merrill, Kitty negotiates a deal with Jack that if he can wait until her divorce is complete, she will give him the money he desires if in return he becomes her lover! Seeing everything he desires falling into place, Jack agrees to a bargain that is to him a complete win/win scenario that leaves him free of dreaded matrimony.But when Kitty’s life is threatened by her former husband and their 'bargain' suddenly becomes much more complicated, can Jack just stand aside and let this woman walk out of his life forever?",
  "genres": [
    "Romance",
    "Historical Romance",
    "Historical",
    "Historical Fiction",
    "Scotland",
    "Victorian Romance",
    "Adult"
  ],
  "author": "Angeline Fortin",
  "average_rating": "4.21",
  "url": "https://www.goodreads.com/book/show/24846280-a-question-of-trust"
}