{
  "title": "My Own Story",
  "description": "My Own Story (1914) is a memoir by English political activist and suffragette Emmeline Pankhurst. Written at the onset of the First World War, My Own Story brings attention to Pankhurst's cause while defending her decision to cease activism until the end of the war. Notable for its descriptions of the British prison system, My Own Story is an invaluable document of a life dedicated to others, of a historical moment in which an oppressed group rose up to advocate for the simplest of demands: equality.Born in a politically active household, Emmeline Pankhurst was introduced to the women's suffrage movement at a young age. In 1903, she founded the Women's Social and Political Union (WSPU), an organization dedicated to the suffragette movement. As their speeches, rallies, and petitions failed to make headway, they turned to militant protest, and in 1908 Emmeline was arrested for attempting to enter Parliament to deliver a document to Prime Minister H.H. Asquith. Imprisoned for six weeks, she observed the horrifying conditions of prison life, including solitary confinement. This experience changed her outlook on the struggle for women's suffrage, and she increasingly saw imprisonment as a means of radical publicity. Over the next several years, she would be arrested seven times for rioting, destroying property, and assaulting police officers, and while in prison staged hunger strikes in order to gain the attention of the press and political establishment. My Own Story is a record of one woman's tireless advocacy for the sake of countless others.With a beautifully designed cover and professionally typeset manuscript, this edition of Emmeline Pankhurst's My Own Story is a classic of English literature reimagined for modern readers.",
  "genres": [
    "Nonfiction",
    "Feminism",
    "History",
    "Biography",
    "Memoir",
    "Classics",
    "Politics"
  ],
  "author": "Emmeline Pankhurst",
  "average_rating": "4.15",
  "url": "https://www.goodreads.com/book/show/2485756.My_Own_Story"
}