{
  "title": "A Question of Lust",
  "description": "Vin MacKintosh was alive.The news dealt Moira MacKenzie the greatest shock of her life. There should have been joy. Rejoicing. Moira should have been thrilled to have the man she’d loved her entire life back, but after five years of mourning, Moira had forgotten one important detail.She might have loved Vin, but Vin had never loved her back.Moira had finally chosen to move on with her life and seek a husband and a life of her own when Vin reappeared. Though nothing but a one-sided love in the past, Moira’s friends convince her to give the love of a lifetime one last chance. To give Vin the opportunity to see her as a woman he could love.Vin is a man tormented by the past and, with little hope that her dreams of true love will be fulfilled, Moira instead offers Vin the friendship he so desperately needs as he integrates himself back into a normal life.After years as a prisoner of war, Vin MacKintosh returns with a scarred and battered soul. Plagued by guilt and nightmares from his years of torture and torment as a prisoner of war, he must readapt to a world where everyone he knew is a different person and the world a vastly different place.With everyone he knows pointing out how much he has changed, Vin cannot help but turn to the one person who gives him encouragement and motivation to move on, Moira MacKenzie. As his best friend, Jason MacKenzie’s, younger sister. Vin has known Moira her entire life, her letters during the war provided him comfort and understanding. True friendship. Now that he is back, he needs those things more than ever.However, Vin finds he cannot continue to look at Moira merely as a friend and little sister any longer. He cannot help but see her as a woman…and one too desirable to resist.Torn between this new attraction and the guilt he’s been carrying with him for years, Vin fights his attraction to Moira thinking that lust could do nothing but ruin the friendship he needs even more than the truth of her brother’s death might.What will Vin do when he realizes that what he feels for Moira is more than merely a question of lust?",
  "genres": [
    "Historical Romance",
    "Romance",
    "Historical",
    "Historical Fiction",
    "Scotland",
    "Victorian Romance",
    "Adult"
  ],
  "author": "Angeline Fortin",
  "average_rating": "4.15",
  "url": "https://www.goodreads.com/book/show/24846284-a-question-of-lust"
}