{
  "title": "Love Me Madly: A Memoir",
  "description": "WHEN YOUR LITTLE-GIRL DREAMS FOR LOVE ARE SHATTERED BY A SHARK IN SHEEP’S CLOTHING, HOW CAN YOU ESCAPE HIM? CAN YOU EVER REALLY GET AWAY FROM THE TERROR AND LEARN TO TRUST YOURSELF AGAIN?  Growing up in small-town North Carolina, Resa Goldberg shared the dreams of pre-pubescent girls everywhere — dreams of love, of happiness, of being carried away by her very own Prince Charming. But when Goldberg’s prince arrived he came in a pickup truck not on the back of a white horse, and rather than charming he was criminally abusive. The physical and emotional traumas the fifteen-year-old suffered at the hands of this first boyfriend would mark her for life.  In LOVE ME MADLY, a provocative and at times painful memoir, Goldberg chronicles her journey from starry-eyed teenybopper whose innocence is shattered to divorced single mom navigating the shoals of internet dating. Somehow, and despite considerable evidence to the contrary, she never abandons her abiding belief that not only does Mr. Right exist, but that he’s right around the corner. Along the way she encounters a Rogues Gallery of boys and men who exhibit every conceivable male virtue and pathology, but never in a combination that adds up to her cherished ideal. Relying on her reporter’s eye and an engaging narrative style, Goldberg’s descriptions of these suitors and of her encounters with them are so finely drawn and ring so true that they’re certain to induce either cringes or belly laughs, depending on the reader’s point of view.  The payoff at the end of the journey is an epiphany that provides the author an understanding of the past—why she habitually makes such bad choices—and a way forward into a happier future. For readers it is a satisfying coda to a trip that is as rewarding as it is emotionally demanding.    “I found LOVE ME MADLY to be a deeply important book, and a must-read for women, but also for teens who have endured trauma, and parents of daughters. Let Resa Goldberg’s story be a cautionary tale, but also a story full of hope.”— Karsen Price, Editor of \"Today’s Charlotte Woman\" magazine.  “LOVE ME MADLY hits home on all fronts – relationships, family, addiction, powerlessness and hope. Resa’s writing is vivid, clever and most of all, real.”—Wendell Collins, Princeton Online & author, \"Widow’s Walk and Other Stories.\"  “LOVE ME MADLY is a brutally honest, raw, and wonderfully optimistic memoir. Resa Goldberg takes us on a heartfelt adventure as she searches for meaning in both life and, more importantly, in love.”—Samantha Vérant, author of \"Seven Letters from Paris: A Memoir.\"  “A-ripped-from-real-life story detailing a women's journey from early sexual abuse to an adult, slowly but surely developing self awareness that created change in positive new directions. A compelling read!\"—Lauren Wilkinson-Barnes, author of \"Smashed To Pieces and Piece By Piece.\"  “The pain, fear, low self-esteem and the desire to be loved are behaviors that many experience after horrific sexual assault and domestic violence at such a young age, but Resa shows us that happiness and peace are obtainable.”—Jennifer C. Foxworthy, Founder & CEO Inspirationally Speaking, LLC and the Unstoppable You Women's Conference and Retired U.S. Navy Veteran.  “...At times tear-inducing, at times laugh-out-loud funny, you won’t want to put this engrossing memoir down until you learn how it ends.”—Adrienne Rhodes, author of \"Match.bomb: A Twenty-Something’s Exploits with (mostly) Online Dating.",
  "genres": [
    "Memoir"
  ],
  "author": "Resa Goldberg",
  "average_rating": "3.80",
  "url": "https://www.goodreads.com/book/show/24847790-love-me-madly"
}