{
  "title": "Wilkie Collins: A Brief Life",
  "description": "Ackroyd at his best - gripping short life of the extraordinary Wilkie Collins, author of 'The Moonstone' and 'The Woman in White'.Short and oddly built, with a head too big for his body, extremely short-sighted, unable to stay still, dressed in colourful clothes, 'as if playing a certain part in the great general drama of life' Wilkie Collins looked distinctily strange. But he was none the less a charmer, befriended by the great, loved by children, irresistibly attractive to women -- and avidly read by generations of readers.Ackroyd follows his hero, 'the sweetest-tempered of all the Victorian novelists', from his childhood as the son of a well-known artist to his struggling beginnings as writer, his years of fame and his life-long friendship with the other great London chronicler, Charles Dickens. A true Londoner, Collins, like Dickens, was fascinated by the secrets and crimes - the fraud, blackmail and poisonings - that lay hidden behind the city's respectable facade. He was a fighter, never afraid to point out injustices and shams, or to tackle the establishment head on. As well as his enduring masterpieces, 'The Moonstone' -often called the first true detective novel - and the sensational 'Woman in White', he produced an intriguing array of lesser known works. Collins had his own secrets: he never married, but lived for thirty years with the widowed Caroline Graves, and also had a second liaison, as 'Mr and Mrs Dawson', with a younger mistress, Martha Rudd, with whom he had three children. Both women remained devoted as illness and opium-taking took their toll: he died in 1889, in the middle of writing his last novel -'Blind Love'.Told with Peter Ackroyd's inimitable verve this is a ravishingly entertaining life of a great story-teller, full of surprises, rich in humour and sympathetic understanding.",
  "genres": [
    "Biography",
    "Nonfiction",
    "History",
    "Books About Books",
    "Biography Memoir",
    "Victorian",
    "British Literature"
  ],
  "author": "Peter Ackroyd",
  "average_rating": "3.68",
  "url": "https://www.goodreads.com/book/show/24848347-wilkie-collins"
}