{
  "title": "Spring Fever: Shifters in Love",
  "description": "Thaw winter's chill with FIVE brand new stories about SEXY, alphamale shifters with spring fever from FIVE of today's hottest paranormal authors. Match Made in Hell (A BBWparanormal romance) by New York Times and USA Today Bestselling author, Milly Taiden When quiet Laura Nieves is tossed together with hot as hellwarrior Damien Wrath, eternity heats up really fast. Add in the fact they'reliving in hell with a crazy mistress, things go from hot to explosive. Theirbasic urges will take over, or they'll kill each other. An Unexpected Diversionby Vella DayCheyenne Snow has been given an ultimatum by her father--thepack's Alpha--find a shifter husband soon, or she'll be forced to marry.Understanding that the odds of her meeting the deadline are slim, Chey decidesto go out with a bang and find a human diversion. Waking the Bear by KerryAdrienneOverprotective bear shifter, Griff Martin, reluctantly rents hismountain cabin to an artist, Amy Francis. He quickly realizes the plucky artistis his mate. But danger is brewing in the forest, and Griff has to be ready tosafeguard both his female and his den, at the risk of losing both.  Prime Desire by AndieDevauxNicolas can't stop thinking about the woman whose life he saved,and Evie has never forgotten the weretiger who rescued her from certain death.When apparent serendipity brings them together again, Nicolas is faced withcontrolling his inner tiger around the woman he desires above all others. Butwill Evie be able to overcome her fear of his nature to give them a secondchance at love?  Bear Essentials (A BBWparanormal romance) by Lia DavisWhen bear-shifter Trey meets the curvy, raven-haired goddess,Nichole, he realizes exactly what he wants and knows she's worth any amount oftrouble. All he has to do is seduce all of her insecurities away and claim heras his bonded mate.",
  "genres": [
    "Paranormal",
    "Anthologies",
    "Paranormal Romance",
    "Shapeshifters",
    "Romance",
    "Fantasy",
    "Erotica"
  ],
  "author": "Lia Davis",
  "average_rating": "4.32",
  "url": "https://www.goodreads.com/book/show/24852157-spring-fever"
}