{
  "title": "Transfigurations: Collected Poems",
  "description": "Few poets have as much to tell us about the intricate relationship between the African American past and present as Jay Wright. His poems weave a rich fabric of personal history using diverse materials drawn from African, Native American, and European sources. Scholarly, historical, intuitive, and emotional, his work explores territories in which rituals of psychological and spiritual individuation find a new synthesis in the construction of cultural values. Never an ideologue but always a poet of vision, his imagination shows us a way to rejoice and strengthen ourselves in our common humanity.Here, together for the first time, are Wright’s previously published collections― The Homecoming Singer (1971), Soothsayers and Omens (1976), Explications/Interpretations (1984), Dimensions of History (1976), The Double Invention of Komo (1980), Elaine’s Book (1988), and Boleros (1991)―along with the new poems of Transformations (1997). By presenting Wright’s work as a whole, this collection reveals the powerful consistency of his theme―a spiritual or intellectual quest for personal development―as each book builds solidly upon the previous one.Wright examines history from a multicultural perspective, attempting to conquer a sense of exclusion―from society and his own cultural identity―and find solace and accord by linking American society to African traditions. He believes that a poem must articulate the vital rhythms of the culture it depicts and is dedicated to a pursuit of poetic forms that embody the cadence of African American culture.Defying characterization, Wright has experimented with voices, languages, cultures, and forms not normally associated with African American literature. He is well schooled in the cultures of West Africa, Europe, and the Americas, and―true to his New Mexican birth―he is a powerful synthesizer of human experience.Transfigurations reveals Wright to be a man of profound knowledge and a poet of exalted verbal intensity.",
  "genres": [
    "Poetry"
  ],
  "author": "Jay Wright",
  "average_rating": "4.55",
  "url": "https://www.goodreads.com/book/show/1150712.Transfigurations"
}