{
  "title": "A Split in the Road",
  "description": "Samuel had finally gotten away from Master Dumas, but his mother’s abandonment hurt, not to mention the pain of starvation he would endure. Plus, Master Dumas was searching for him, bent on mating Samuel and keeping him under his control.  Taking a human trucker up on a ride wasn’t Samuel’s smartest decision, but being young and small, he wasn’t sure what else he could do. And the human—Tayen—was as sexy as hell, and drew Samuel in like a moth to flame.  Tay took Samuel to his family’s home, their time together resulting in Samuel falling for the big human. But, Myron, Tay’s brother-in-law and a master vampire wouldn’t allow Samuel to remain in their home, too worried for his pregnant mate, Sarah, Tay’s sister. Samuel wouldn’t stay where he wasn’t wanted, and felt guilty for putting Tay in such a situation. But before he could leave, tragedy struck, they were attacked, and Master Dumas once more had his hands on Samuel.  The remorse and anguish Samuel felt at the death of Tay and his family ate at him like acid. He didn’t care whether Master Dumas mated him now. He deserved the pain and degradation he was sure to be subjected to. But to his surprise, another clan destroyed Master Dumas’s clan, and Samuel found himself free, even if the mate bond still pulsed within his mind, weak as it was. His shock only increased when he was accepted into that clan, and was told they weren’t vampires at all, but dyads.  But still the mating bond held him captive, even being bonded to Kylor, the alpha master of the dyad clan. It took time until Samuel was able to ignore the mating bond that tied him to a dead vampire, and the guilt that continued to eat away at him over the deaths he’d caused would never go away.  Only Kylor knew of Samuel’s humiliation, and knew nothing of Tay and Samuel hoped it stayed that way, even as he began his new life without his mate.",
  "genres": [
    "M M Romance",
    "Vampires",
    "Romance",
    "Paranormal",
    "Shapeshifters",
    "Abuse"
  ],
  "author": "C.R. Guiliano",
  "average_rating": "3.66",
  "url": "https://www.goodreads.com/book/show/24867817-a-split-in-the-road"
}