{
  "title": "The Golden Cage",
  "description": "*Parts of the previous eBook edition of The Golden Cage have been removed from this edition and will be re-released in the fourth book in The Ballad of Benfro series: The Broken World* There's a new fantasy phenomenon for 2014 - The Golden Cage is the third enchanting tale in J. D. Oswald's epic fantasy series, The Ballad of Sir Benfro Queen Beulah is determined to have her war, despatching Inquisitor Melyn north, through the ancient forest to cross unseen into the land of her enemies. Battling the ever growing influence of Magog, Benfro struggles to resist the treacherous orders of the long dead Dragon Mage, a task made yet more difficult by the arrival of Errol in his forest refuge. His body broken, Errol is tormented by dreams of his beloved Martha, imprisoned in a Golden Cage. He has escaped from King Ballah's torture chamber but remains powerless to help her. Yet fate has united these two. Errol holds the key to halting Magog's influence, and Benfro has the skill to heal broken bones. Working together they might survive. Apart, they will surely perish, and all Gwlad with them. The Ballad of Sir Benfro is an utterly compelling and beautifully written new fantasy series from J.D. Oswald. Fans of the Inheritance Series and readers hooked to the world of George R. R. Martin's Game of Thrones series will love the magic of the Twin Kingdoms. The Golden Cage is the third book in the series, following Dreamwalker and The Rose Cord, which are also published as Penguin eBooks. *Please note that parts of the previous eBook edition of The Golden Cage have been removed from this edition and will be re-released in the fourth book in The Ballad of Benfro series: The Broken World* J. D. Oswald is the author of the epic fantasy series, The Ballad of Sir Benfro. Currently, Dreamwalker, The Rose Cord and The Golden Cage are all available as Penguin ebooks. He is also the author of the Detective Inspector McLean series of crime novels under the name James Oswald. In his spare time James runs a 350-acre livestock farm in North East Fife, where he raises pedigree Highland Cattle and New Zealand Romney Sheep. http://jamesoswald.co.uk",
  "genres": [
    "Fantasy",
    "Dragons",
    "Fiction",
    "Magic",
    "Young Adult",
    "Audiobook",
    "Adult"
  ],
  "author": "James Oswald",
  "average_rating": "4.06",
  "url": "https://www.goodreads.com/book/show/24877935-the-golden-cage"
}