{
  "title": "Perfect Touch",
  "description": "The queen of romantic suspense returns with a heart-racing tale in which a former soldier turned rancher and a beautiful designer race to stop a vicious killer—a battle for survival that threatens to explode in an intense and irresistible passionAn art dealer and owner of her own design studio, Perfect Touch, Sarah “Sam” Maddox travels the world to find the ideal artwork for her clients. Her sophisticated, comfortable life in San Francisco is light years away from the poverty of her family’s dairy farm, and Sam will do whatever it takes to keep her business strong. A dedicated urban career woman focused on her work, she doesn’t have time or energy for a family or distracting romantic entanglements.Jay Vermillion recently inherited Vermillion Sky, a working ranch near Wyoming’s breathtaking Grand Teton Mountains—and the estates of the rich and restless. While he was fighting in two wars, his father tried to keep the homestead running, until illness stole his fight and then his life. Jay’s determined to restore Vermillion Sky, but first he’s got to settle a vicious battle with his former stepmother over some of his late father’s paintings. The last thing on his mind is a finding a wife and creating a sixth generation of Vermillions. When Jay hires Sam to handle his father’s artwork, it’s love at first sight—a mutually inconvenient attraction that is soon complicated by a double murder at the edge of the ranch and a potential betrayal even closer to home. Working together to unmask a murderer, Sam and Jay try to fight the intense heat between them. Then the killer targets Sam. And suddenly, Jay, the war-weary soldier, finds something he’s once again willing to die for . . .",
  "genres": [
    "Romance",
    "Romantic Suspense",
    "Mystery",
    "Suspense",
    "Fiction",
    "Contemporary",
    "Audiobook"
  ],
  "author": "Elizabeth Lowell",
  "average_rating": "3.70",
  "url": "https://www.goodreads.com/book/show/24871110-perfect-touch"
}