{
  "title": "Life is Awesome",
  "description": "Daniel Schroeder wants nothing more than to repair his father’s broken memories, but it’s been a long time since he’s thought of himself as a memorysmith. Even though convincing Big Dan of their current reality is the most painful task Daniel faces every morning, somehow life manages to prevent him from finding a cure. He needs to keep their family business running. And he needs to moonlight at a competitor’s shop to keep all his employees paid. Or maybe he’s just trying to keep himself from exacerbating the situation.  A year ago, Daniel would have presumed he was clever enough to memorysmith his way out of their predicament, but nowadays he’s not so cavalier. Playing with people’s memories shouldn’t be taken lightly, and things can always get worse. Even with the help of some of the best minds in the business, Daniel still isn’t sure how to navigate his way out of the persistent false memory that’s crippled his life. Is new programming the answer? Better gear? More money? Or is time the only thing that can heal Big Dan’s memories…if they can even be fixed at all.  What Daniel needs most is some breathing room, and Elijah Crowe is eager to provide it. Since he’s smitten with Daniel, Elijah is determined to prove himself—and he’s more than qualified to clear Daniel’s schedule by taking over some duties at Adventuretech. With the support of his new boyfriend, possibilities begin to open up for Daniel, hints of things he hasn’t even realized he’d stopped hoping for: the contentment of a harmonious family, the fulfillment of his creative expression, and a chance for a relationship with a man he loves.  This book completes the Mnevermind Trilogy.",
  "genres": [
    "M M Romance",
    "Science Fiction",
    "Romance",
    "Paranormal",
    "Audiobook",
    "Disability",
    "Fantasy"
  ],
  "author": "Jordan Castillo Price",
  "average_rating": "4.13",
  "url": "https://www.goodreads.com/book/show/24875852-life-is-awesome"
}