{
  "title": "Agents of Empire: Knights, Corsairs, Jesuits and Spies in the Sixteenth-Century Mediterranean World",
  "description": "In the sixteenth century, the Christian states of Western Europe were on the defensive against a Muslim superpower - the Empire of the Ottoman sultans. There was violent conflict, from raiding and corsairing to large-scale warfare, but there were also many kinds of peaceful interaction across the surprisingly porous frontiers of these opposing power-blocs. Agents of Empire describes the paths taken through the eastern Mediterranean and its European hinterland by members of two closely related Venetian-Albanian families, the Brunis and the Brutis, almost all of them previously invisible to history. They include an archbishop in the Balkans, the captain of the papal flagship at the battle of Lepanto, the power behind the throne in the Ottoman province of Moldavia, and a dragoman (interpreter) at the Venetian embassy in Istanbul. Through the life-stories of three generations of Brunis and Brutis, Noel Malcolm casts the world between Venice, Rome and the Ottoman Empire in a fresh light, illuminating subjects as diverse as espionage, anti-Ottoman rebellion, diplomacy, slave-ransoming and the grain trade. He describes the conflicting strategies of the Christian powers, and the extraordinarily ambitious plans of the sultans and their viziers. Few works since Fernand Braudel's classic account of the sixteenth-century Mediterranean, published more than sixty years ago, have ranged so widely through this vital period of Mediterranean and European history. A masterpiece of scholarship as well as story-telling, Agents of Empire builds up a panoramic picture, both of Western power-politics and of the interrelations between the Christian and Ottoman worlds.",
  "genres": [
    "History",
    "Nonfiction",
    "European History",
    "Religion",
    "Politics",
    "Medieval History",
    "16th Century"
  ],
  "author": "Noel Malcolm",
  "average_rating": "4.10",
  "url": "https://www.goodreads.com/book/show/24875209-agents-of-empire"
}