{
  "title": "The Empowered Empath: Owning, Embracing, and Managing Your Special Gifts",
  "description": "If you're among the 1 in 20 people born as an \"empath,\" life's about to get a whole lot better...• Does being with certain people leave you physically drained? • Do you seem to soak up other people's emotions like a sponge? • Do you feel overshadowed by others, not sure who you really are? • Have you tried other advice for empaths to no avail? • Do you secretly worry there's something wrong with you? Life as an empath (someone who can experience another person's reality) can be wonderful. And confusing. While it can give you an edge in every arena of your life, for unskilled empaths, it can mean a bewildering tidal wave of unwanted, unwelcome and usually unconscious empath merges with other people's energy. And that's no fun. But... What if you could learn how to turn that connection off whenever you wanted?That's the promise of The Empowered Empath. While both substantive and fun to read, don't let the lighthearted tone fool you: These are serious skills from the world's foremost expert at helping \"born empaths\"—Rose Rosetree. In this visionary work, Rosetree offers nothing less than: Simple, straightforward and proven techniques for consciously controlling your empath gifts—on command.And it gets better. Along the way, you'll discover that many \"guru-prescribed\" activities are, in fact, unnecessary, don't work, and can't work. These include such \"busywork\" as: • Protecting yourself against \"psychic vampires\" • Using thoughts, feelings or behaviors to manage your sensitivity• Constantly trying to \"clean up your energy field\" • Doing grueling, ongoing work on your \"boundaries\" Instead, you'll discover a path that's far easier and more effective, and one that'll leave you with an enhanced sense of self, along with greater peace of mind, clarity, and personal power. Quit suffering and start living! Note: This is the full-length version of Rose's power-packed book for empaths. For a shorter edition, choose \nThe Empowered Empath—Quick & Easy\n.",
  "genres": [
    "Spirituality"
  ],
  "author": "Rose  Rosetree",
  "average_rating": "4.16",
  "url": "https://www.goodreads.com/book/show/24874575-the-empowered-empath"
}