{
  "title": "And the Weak Suffer What They Must?  Europe's Crisis and America's Economic Future",
  "description": "Η συστηματική άρνηση των πραγματικών αιτίων της ευρωπαϊκής κρίσης γέννησε μια τιτάνια μάχη με θύματα την ακεραιότητα και την ψυχή της Ευρώπης. Στη μάχη αυτή ηττώνται καθημερινά οι δυνάμεις της λογικής και του ανθρωπισμού και θριαμβεύουν ο αυταρχισμός, η ανισότητα, μία μορφή δήθεν λιτότητας που υπονομεύει την ίδια της τη λογική. Ως αποτέλεσμα, οι φυγόκεντρες δυνάμεις που αποδομούν την Ευρωπαϊκή Ένωση ενισχύονται - με το Brexit να δίνει απλά πρόγευση του τι θα ακολουθήσει. Το αποτέλεσμα αυτής της τιτάνιας σύγκρουσης όχι μόνο θα κρίνει το μέλλον της ηπείρου μας, αλλά και θα αποδειχθεί κρίσιμο για την υφήλιο. Η νίκη του ορθολογισμού, της ελευθερίας, της δημοκρατίας και του ανθρωπισμού στην Ευρώπη είναι, άλλη μια φορά, διακύβευμα για όλον τον κόσμο.Στο νέο του βιβλίο, ο Γιάνης Βαρουφάκης αφηγείται τη δημιουργία της ευρωζώνης πάνω στα ερείπια του εντυπωσιακού μεταπολεμικού οικονομικού συστήματος που έστησαν, ως επέκταση του Νιου Ντηλ, οι επίγονοι του προέδρου Ρούσβελτ. Αντίθετα με εκείνη τη νομισματική και οικονομική ένωση (το Μπρέτον Γουντς), η ευρωζώνη οικοδομήθηκε σαθρά, με τρόπο που τη μετέτρεψε γρήγορα σε πυραμιδικό σχήμα (ιδιωτικού και δημόσιου) χρέους, με χώρες όπως η Ελλάδα, η Ιρλανδία, η Πορτογαλία και η Ισπανία στον ρόλο του μονίμως αφερέγγυου δανειολήπτη.Το βιβλίο του Γιάνη Βαρουφάκη \"Η αρπαγή της Ευρώπης\" σκύβει προσεκτικά και μεθοδικά πάνω στην πρόσφατη ευρωπαϊκή μας ιστορία, παραθέτοντας εφικτές λύσεις και αναδεικνύοντας τη μεταμορντέρνα έκδοση της δεκαετίας του 1930 που καραδοκεί εάν κάνουμε το λάθος να πιστέψουμε πως οι μόνες μας επιλογές είναι είτε η υποταγή στις διάφορες τρόικες είτε η διάλυση της Ευρωπαϊκής Ένωσης. (Από την παρουσίαση στο οπισθόφυλλο του βιβλίου)",
  "genres": [
    "Economics",
    "Politics",
    "Nonfiction",
    "History",
    "Finance",
    "Audiobook",
    "Business"
  ],
  "author": "Yanis Varoufakis",
  "average_rating": "4.11",
  "url": "https://www.goodreads.com/book/show/24886497-and-the-weak-suffer-what-they-must-europe-s-crisis-and-america-s-econo"
}