{
  "title": "Memories of Heaven",
  "description": "Nineteenth-century British poet William Wordsworth expressed the idea that we gradually lose our intimate knowledge of heaven as we grow up, observing that “our birth is but a sleep and a forgetting” of our previous heavenly existence.Dr. Wayne W. Dyer and co-author Dee Garnes had often talked about how the ones who know the most about God are those who have just recently been wrapped in the arms of the Divine, our infants and toddlers. In fact, Dee had an interaction with her own young son that convinced her of this. Curious about this phenomenon, Wayne and Dee decided to issue an invitation to parents all over the world to share their experiences. The overwhelming response they received prompted them to put together this book, which includes the most interesting and illuminating of these stories in which very young children speak about their remembrances before they were born.It seems that infants and toddlers often arrive here with memories of their lifetimes in the spirit world and frequently provide evidence of this to their immediate families. They tell of dialogues with God, give evidence that they themselves had a hand in picking their own parents, speak about long-deceased family members they knew while in the dimension of Spirit, verify past-life recollections, and speak eloquently and accurately of a kind of Divine love that exists beyond this physical realm—and even of times when telepathic communication took place, as well as the ability to decide just when they would come here to Earth.This fascinating book encourages parents and grandparents to take a much more active role in communicating with their new arrivals . . . and to realize that there is far more to this earthly experience than what we perceive with our five senses.",
  "genres": [
    "Nonfiction",
    "Spirituality",
    "Religion",
    "Psychology",
    "Self Help",
    "Death",
    "Angels"
  ],
  "author": "Wayne W. Dyer",
  "average_rating": "3.96",
  "url": "https://www.goodreads.com/book/show/24886243-memories-of-heaven"
}