{
  "title": "The Gomorrah Principle",
  "description": "The Vietnam War, often called the CIA's war, tested the morals of men from the highest offices of our nation to those from the smallest boroughs of rural America. Brady Nash was one of those men. When his friend Duff Coleridge is killed in Vietnam, Brady recognizes the mysterious circumstances and is compelled to search for the truth. With an extraordinary ability to shoot and a hard-nosed determination, Brady must face life and death through the scope of a rifle when he gets involved with a clandestine organization. Caught in a web of espionage and black-ops, Brady attempts to find the identity of Duff's killer. However, once he digs too deep, he'll soon find himself on the hit list. While \"truth has a resonance to it that fills the cracks where falsehoods lie,\" Brady will quickly discover his search for truth is leading him to become more and more like the people he despises. Rick DeStefanis' The Gomorrah Principle: A Vietnam Sniper's Story is an exciting new thriller that blurs the line between right and wrong. Filled with gripping espionage and rigid tension, this enthralling story will have readers hooked from the opening pages. Historical fiction mixed with thrilling action, Brady's journey will engross and entertain with its ambitious story and complex themes. Filled with complex characters that eschew traditional cliches, The Gomorrah Principle is an exciting story that grabs readers with thrilling action and espionage but truly captivates them with its surprising depth. Not only perfect for action and thriller fans, this tantalizing novel will fit wonderfully in any casual reader's collection. A page-turner in every sense of the phrase, this mesmerizing story proves easy to pick up and hard to put down. With action, intrigue, and suspense set against a tumultuous time in United States history, The Gomorrah Principle has all of the ingredients to become an instant classic.",
  "genres": [
    "Military Fiction",
    "Thriller"
  ],
  "author": "Rick DeStefanis",
  "average_rating": "4.49",
  "url": "https://www.goodreads.com/book/show/24888772-the-gomorrah-principle"
}