{
  "title": "Back to the Future: The Ultimate Visual History",
  "description": "Great Scott! Go Back to the Future with Doc Brown and Marty McFly in this visually stunning look at the creation of one of the most beloved movie trilogies of all time.Few films have made an impact on popular culture like the Back to the Future trilogy. This deluxe, officially licensed book goes behind the scenes to tell the complete story of the making of these hugely popular movies and how the adventures of Marty McFly and Doc Brown became an international phenomenon.Back to the The Ultimate Visual History is a stunning journey into the creation of this beloved time-traveling saga and features hundreds of never-before-seen images from all three movies, along with rare concept art, storyboards, and other visual treasures.The book also features exclusive interviews with key cast and crew members—including Michael J. Fox, Christopher Lloyd, Lea Thompson, Robert Zemeckis, Bob Gale, Steven Spielberg, Frank Marshall, Kathleen Kennedy, and more—and tells the complete story of the production of the movies, from the initial concept to the staging of iconic scenes such as the “Enchantment Under the Sea” dance and the hoverboard sequence. The book also delves into the wider Back to the Future universe, exploring the animated television show and Back to the The Ride.Written by Michael Klastorin—the production publicist on the second and third movies—with Back to the Future expert Randal Atamaniuk, this book delivers a range of surprises from the Universal Pictures archives and also includes a wealth of special removable items.Comprehensive, compelling, and definitive, Back to the The Ultimate Visual History is the book that fans have been waiting for.Removable items Hill Valley High School Tardy Slip Back to the Future The Ride security pass Save the Clocktower leaflet Sepia photograph of Marty and Doc from Part III Marty’s note to Doc from the first film with the envelope George McFly’s book Jaws 19 movie poster George and Lorraine’s prom photo Doc’s flux capacitor sketch from the first film Doc’s note to Marty from 1885 Biff one dollar bill from Part II Blast from the Past receipt from Part II Lenticular version of the iconic McFly family photo from the first film",
  "genres": [
    "Nonfiction",
    "Film",
    "Media Tie In",
    "Time Travel",
    "History",
    "Art",
    "Pop Culture"
  ],
  "author": "Michael Klastorin",
  "average_rating": "4.70",
  "url": "https://www.goodreads.com/book/show/24892872-back-to-the-future"
}