{
  "title": "Leah's Seduction Books 1-4",
  "description": "Gianni Rinaldi is intrigued by a woman he meets unexpectedly. Then a journal filled with a woman's most intimate fantasies falls into his hands. The wealthy entrepreneur pursues Leah Ivers, thinking she might be the author of a journal he has become obsessed with. At first, his goal is to determine if she wrote the sexual fantasies in the diary. But the way Gianni and Leah respond to each other takes the relationship deeper, and both get more than they expect.“It was as if he saw her clearly even at a distance, and the electricity that radiated between them was undeniable.”Special Offer: Books 1 thru 4 are now available in a boxed set!Book 1Leah Ivers has landed a job as a marketing coordinator in one of the fashion showrooms of New York. Her passion bubbles to the surface when she meets Gianni at an industry event. Knowing she is not his type, Leah is surprised by his interest in her. Intimate encounters make it clear that he can satisfy her as no man has before. How much is she willing to give up in order to have him?“There was a connection between them. When he gazed at her, Leah transformed into a stunning beauty before his eyes. It was as though his look was the sunshine she required to thrive. Gianni had to get a grip. He couldn’t let all of this go to his head. He needed to keep things in perspective, which was difficult. Because the way she had looked at him had affected him. Too much. And not in a way he’d anticipated, allowing just that little bit of control to slip through his fingers.\"Book 2The attraction is too strong. Gianni is deeply affected by Leah. The way she responds to him pushes the limits of Gianni's control, igniting desire he cannot subdue. Can he keep his distance, or will Leah's passion be his undoing?“Many times Leah had contemplated what was happening, and couldn’t say for sure that it was healthy for her. The way Gianni led her into acts that had a taste of the forbidden turned her on. And she couldn’t have pulled back, even if she had wanted to.Book 3On a trip to Amsterdam the relationship heats up. Leah takes a risk that will change her life. She hides her love from Gianni, trying to abide by his rules. But it is more difficult after a weekend away where she sees past his cold façade. Leah thinks her love is enough for both of them, until everything explodes. Will Gianni grant her demand?“Wanting to be with him just might overshadow Leah’s life if she wasn't careful. There had to be a limit. She couldn’t continue to give all if Gianni wouldn’t.Book 4Leah is swept up in the power of her love for Gianni. She wants to please him, but there are limits. Leah knows he is holding something back. And when Gianni pushes her too far, she fights back. Yet she knows there is a dark secret that torments him. Can she persuade him to tell? Or will the past be their undoing?“Gianni says he is greedy, but I am just as greedy as he. The intimate scenes are not enough for me. I want the heart of the man who gives me such immense pleasure. I want to hear the words. I long for the day when Gianni tells me that he loves me.\"Don’t be surprised if you want to read all 10 books. This seductive romance about a possessive alpha male will leave you wanting more!Series Description:Gianni Rinaldi was introduced in the sensual romance series of Touched By You, the endearing love story of Tanner and Natalie. He was the owner of GR Showroom, and showcased Natalie’s fashions. He was a source of jealousy for Tanner, the wealthy hero in that new adult steamy romance. Although his relationship with Natalie was strictly professional in the Touched By You series. But he was deeply involved in his own romance, which you can now read about it in this Rinaldi Romance, the steamy love stories of “Leah’s Seduction.”",
  "genres": [
    "Romance",
    "Anthologies",
    "Contemporary Romance",
    "Amazon"
  ],
  "author": "Emily Jane Trent",
  "average_rating": "4.20",
  "url": "https://www.goodreads.com/book/show/24893985-leah-s-seduction-books-1-4"
}