{
  "title": "Trace: Memory, History, Race and the American Landscape",
  "description": "Through personal journeys and historical inquiry, this PEN Literary Award finalist explores how America’s still unfolding history and ideas of “race” have marked its people and the land. Sand and stone are Earth’s fragmented memory. Each of us, too, is a landscape inscribed by memory and loss. One life-defining lesson Lauret Savoy learned as a young girl was the American land did not hate. As an educator and Earth historian, she has tracked the continent’s past from the relics of deep time; but the paths of ancestors toward her―paths of free and enslaved Africans, colonists from Europe, and peoples indigenous to this land―lie largely eroded and lost. A provocative and powerful mosaic that ranges across a continent and across time, from twisted terrain within the San Andreas Fault zone to a South Carolina plantation, from national parks to burial grounds, from “Indian Territory” and the U.S.-Mexico Border to the U.S. capital, Trace grapples with a searing national history to reveal the often unvoiced presence of the past. In distinctive and illuminating prose that is attentive to the rhythms of language and landscapes, she weaves together human stories of migration, silence, and displacement, as epic as the continent they survey, with uplifted mountains, braided streams, and eroded canyons. Gifted with this manifold vision, and graced by a scientific and lyrical diligence, she delves through fragmented histories―natural, personal, cultural―to find shadowy outlines of other stories of place in America. \"Every landscape is an accumulation,\" reads one epigraph. \"Life must be lived amidst that which was made before.\" Courageously and masterfully, Lauret Savoy does so in this beautiful she lives there, making sense of this land and its troubled past, reconciling what it means to inhabit terrains of memory―and to be one.",
  "genres": [
    "Nonfiction",
    "History",
    "Nature",
    "Memoir",
    "Science",
    "Race",
    "Essays"
  ],
  "author": "Lauret Savoy",
  "average_rating": "4.09",
  "url": "https://www.goodreads.com/book/show/24886834-trace"
}