{
  "title": "Grandbaby Cakes: Modern Recipes, Vintage Charm, Soulful Memories",
  "description": "Grandbaby Cakes: Modern Recipes, Vintage Charm, Soulful Memories is the debut cookbook from sensational food writer, Jocelyn Delk Adams. Since founding her popular recipe blog Grandbaby Cakes in 2012, Adams has been putting fresh twists on old favorites. Adams has earned praise from critics and the adoration of bakers both young and old for her easygoing advice, rich photography, and the heartwarming memories she shares of her family’s generations-old love of baking. As a child, Adams and her family would routinely embark on the ten-hour journey from their home in Chicago to Winona, Mississippi. There, she would watch her grandmother, affectionately nicknamed Big Mama, bake and develop delicious, melt-in-your-mouth desserts. From blooming tree-picked fruit to farm-raised eggs and fresh-churned butter, Big Mama used what was readily available to invent completely original treats. Adams treasured the moments when her mother, aunt, and Big Mama would bring her into the kitchen to let her dabble in the process as a rite of passage. Big Mama’s recipes became the fabric of their family heritage. Grandbaby Cakes is Adams’s love note to her family, thanking those who came before and passing on this touching tradition with 50 brilliant cakes.Grandbaby Cakes pairs charming stories of Big Mama’s kitchen with recipes ranging from classic standbys to exciting adventures—helpfully marked by degree of difficulty—that will inspire your own family for years to come. Adams creates sophisticated flavor combinations based on Big Mama’s gorgeous centerpiece cakes, giving each recipe something familiar mixed with something new. From pound cakes and layer cakes to sheet cakes and \"baby\" cakes (cupcakes and cakelettes), Grandbaby Cakes delivers fun, hip recipes perfect for any celebration.Readers will love this cookbook for its eclectic and bold recipes steeped in equal parts warm Southern charm and fresh Midwestern flavors. Not only will home bakers be able to make staples like yellow cake and icebox cake exactly how their grandmothers did, but they’ll also be preparing impressive innovations, like the Pineapple Upside-Down Hummingbird Pound Cake and the Fig-Brown Sugar Cake. Grandbaby Cakes is a collection for both new-aged and traditional bakers, but mostly it’s for anyone who wants a fresh, modern take on classic recipes as well as cakes full of heart and soul.",
  "genres": [
    "Cookbooks",
    "Cooking",
    "Nonfiction",
    "Food"
  ],
  "author": "Jocelyn Delk Adams",
  "average_rating": "4.25",
  "url": "https://www.goodreads.com/book/show/24886803-grandbaby-cakes"
}