{
  "title": "Normal Life: Administrative Violence, Critical Trans Politics, and the Limits of Law",
  "description": "Revised and Expanded EditionWait—what's wrong with rights ? It is usually assumed that trans and gender nonconforming people should follow the civil rights and \"equality\" strategies of lesbian and gay rights organizations by agitating for legal reforms that would ostensibly guarantee nondiscrimination and equal protection under the law. This approach assumes that the best way to address the poverty and criminalization that plague trans populations is to gain legal recognition and inclusion in the state's institutions. But is this strategy effective?In Normal Life Dean Spade presents revelatory critiques of the legal equality framework for social change, and points to examples of transformative grassroots trans activism that is raising demands that go beyond traditional civil rights reforms. Spade explodes assumptions about what legal rights can do for marginalized populations, and describes transformative resistance processes and formations that address the root causes of harm and violence.In the new afterword to this revised and expanded edition, Spade notes the rapid mainstreaming of trans politics and finds that his predictions that gaining legal recognition will fail to benefit trans populations are coming to fruition. Spade examines recent efforts by the Obama administration and trans equality advocates to \"pinkwash\" state violence by articulating the US military and prison systems as sites for trans inclusion reforms. In the context of recent increased mainstream visibility of trans people and trans politics, Spade continues to advocate for the dismantling of systems of state violence that shorten the lives of trans people. Now more than ever, Normal Life is an urgent call for justice and trans liberation, and the radical transformations it will require.",
  "genres": [
    "Nonfiction",
    "Queer",
    "Politics",
    "LGBT",
    "Gender",
    "Law",
    "Transgender"
  ],
  "author": "Dean Spade",
  "average_rating": "4.42",
  "url": "https://www.goodreads.com/book/show/24886182-normal-life"
}