{
  "title": "Alpha Suits: Suits & Shades",
  "description": "Just One Night by Mallory Dauphin After a terrible start to a friend’s birthday party, Annaliese finds herself in a situation in a dark alley she isn’t able to escape. When a mystery man in a suit rescues her, it takes everything in her power to get him off of her mind. His eyes, his body, his damn near perfect suited body keep running through her mind. Adam Callahan just wants to get dinner with his parents over with, but before he makes it to the restaurant he is stuck rescuing a woman from the hands of her would be rapist. A woman that, after laying eyes one her, he would do anything to spend just one night with. When fate brings the two together again, sparks fly immediately, but once Adam finds out who this mystery girl is will he stay and own up to what he did, or will be disappear from her life for good?  One Love to Obey by H.Q. Frost Things aren’t always as they seem. Caroline and Derek Stringer show one true love is all it takes to obey. People on the outside aren’t privy to what’s on the inside, behind a closed door.  The First of Fifty: Shades of Longing “I Remember You” by fallen kittie Follow Kittie in summer school. Not so much fun in the sun as she soaks with sweat, itching to get The Professor out of his suit.  Keeper by Marilyn Faith Lola is in love with her best friend Calen. She has been for years and is getting tired of sitting around waiting for him to see her as more than just his best friend. Calen is in love with his best friend Lola, whom he knows has feelings for him. The problem is he is afraid to act on those feelings in fear of losing her if it doesn’t work out. Can these two through caution to the wind to pursue what could possibly be the most perfect romance they will ever encounter but could also be the biggest mistake of their lives?  The Applicant by Nicole Hite Jim Jackson was a tall, dark, handsome drink of water - and boy did he know it. When one of his top associates at Jackson, Marks & Moore, leaves the firm, he is forced to find a replacement. What he didn't expect was Finley Underwood to walk through his door. Will he stick to finding a new applicant, or will he fall for the woman with the red lips?  Mr. Andrews: Flying High with The Pilot by Mia Villano Gabby Barone was a strong independent woman that enjoyed the company of men and many of them. Beautiful, confident and proud of her Italian heritage, Gabby wanted to be in charge of her life. Abandoned by her mother, raised by her father, and devastated by the death of her one true love, she learned early in life that people never stayed around for too long. Unable to accept the death of her boyfriend, Gabby moves to New York City, with her best friend Harper. Once there she becomes a hair stylist in NYC’s most popular and sought after salons. Loving her new life, going out drinking, and hooking up with random men, lead her to the one thing she told herself she never wanted again. When she wakes up in the apartment of New York’s richest and biggest playboy she runs into Colt Andrews by chance. He’s intrigued, and Gabby is not too impressed with this older, very wealthy pilot at first. It isn’t until a chance encounter and one night of phone sex, that he awakens something inside her. Something she told herself she would never allow, a need to give herself to a man, and let him be in control, at least in the bedroom. When she sees him at an art gallery opening one night he convinces her to come home with him. Surprised by his forcefulness and strong sexual desire, Gabby has the best sexual experience of her life. Will colt be able to win her over? Will Gabby soften to this man that only wants to love her?",
  "genres": [],
  "author": "M. Dauphin",
  "average_rating": "4.74",
  "url": "https://www.goodreads.com/book/show/24906520-alpha-suits"
}