{
  "title": "Becoming Me: Journal Affirmations for Girls Vol 1",
  "description": "Excellent as a journal for one girl or as a tool to use in a group setting for writing and discussion. Each entry covers a different topic and then allows space for the reader to do their own writing. Topics are particularly relevant today, such as the entry, \"Airbrushed.\" Doesn't talk down or issue simple edicts, such as \"love yourself,\" but takes a different approach, which respects intelligence and individuality. There is an emphasis on empowerment, self-esteem and personal accountability.An affirmation on its own is a powerful thing. However, flexing the muscle of an affirmation with the conscious expression of your own words, thoughts and experiences is a transformative thing. Use this affirmational journal to not only absorb the powerful messages in each affirmation, but to accentuate them tenfold by the expressions of your own creation. Lovely Girls Let the competition stop right now The comparisons end today Never more will I look at another girl And wonder which is better fit Which of us is trimmer Who deserves more praise For their sense of style We are all of us lovely girls Let me forever forward Notice what I find unique about each What charming quality I easily take note of As I look upon them with More admiring eyes Today I will consciously endeavor To see the beauty all around me In every shape and size Every wisp of hair And each unique tone of skin What could be more beautiful Than the exquisite truth Of our perfect individuality? Let me forever celebrate The beauty in every girl around me For we are all of us Lovely girls Please also see: Nonfiction: I am Enough: Journal Affirmations for Girls From this Day Forward: Journal Affirmations for the Bride to Be Affirmation Poetry for Expectant Mothers Affirmation Poetry for Health and Healing Affirmation Poetry for Wealth and Abundance Here and Now: Finding God in the Everyday In the Shadows: Finding God on our Darkest Days Fiction: Paradox Love (Paradox Love, Book 1) Where the Deer Dwell",
  "genres": [
    "Young Adult"
  ],
  "author": "Elizabeth D. Gray",
  "average_rating": "4.44",
  "url": "https://www.goodreads.com/book/show/24895351-becoming-me"
}