{
  "title": "Thriving with Chronic Pain",
  "description": "Life-Changing Solutions for Chronic PainChronic pain threatens the well-being of 100 million Americans and 1.5 billion people worldwide. It affects us at all levels: our physical, mental, and spiritual health and happiness, our work productivity and financial livelihoods, our relationships, and overall life quality.This book shows you how you can flourish despite your pain, even when medical cures aren’t available or come at too high of a cost. Learn how to manage and improve your chronic pain using ideas, strategies, and techniques proven by over a hundred scientific studies and the experience of countless chronic pain patients, including the author.You will learn how to:•\tBetter understand your pain•\tWork more effectively with your doctors and healthcare providers•\tRegain your functionality •\tUnderstand the difference between pain and suffering•\tAccept and transcend your pain and negative emotions•\tImplement a wide range of specific tips, tricks, practices for regaining your life•\tDiscover the positive opportunities in your pain•\tWork with and improve your relationships with family, partners, and friends•\tProsper physically, mentally, and spirituallyFor ten years, Meshorer has traveled the world seeking ideas and practices that successfully alleviate chronic pain. This books focuses only on those ideas and practices that have been proven effective, both personally and scientifically. You can do more than merely suffer through your pain. You can regain your life despite chronic pain, making it richer, happier, and more successful than ever. Thriving with Chronic Pain reveals the secrets.Sean Meshorer is a spiritual teacher based in Los Angeles. He is the author of The Bliss Experiment: 28 Days to Personal Transformation. He graduated from Stanford with a degree in philosophy and religious studies. He spent fifteen years meditating, practicing, and living in a spiritual community in Northern California. Visit seanmeshorer.com for more about Sean.",
  "genres": [],
  "author": "Sean Meshorer",
  "average_rating": "4.33",
  "url": "https://www.goodreads.com/book/show/24906865-thriving-with-chronic-pain"
}