{
  "title": "Adventures in Mother-Sitting",
  "description": "For a daughter, at age 61, being called “mommy” by her own mother was a heart-wrenching experience. This happened to the author during the course of a three-year adventure as the full-time caregiver to her mother, much loved yet caught up in a downward spiral of physical, mental, and developmentally regressed disabilities.  Each day is an adventure because when dementia is present, the typical actions involved with daily care habits become unpredictable. The experience is also termed an adventure because of the surprising twists and turns of emotion that arose in the author, compelling her to recognize and face deep-seated fears and unwanted emotional reactions when her performance was not in accord with the spiritual vision that she had of herself. Moments of comic relief would save the author from the depths of despair during pill-taking and messy hygienic episodes, and her mother’s nighttime delusions. The mantra that kept the author going was an echo of her mother’s life-long response to any calamitous you can do what you have to do.  ADVENTURES IN MOTHER-SITTING is not just a chronicle about the dementia-induced antics of an independent, spirited mother as she approaches the time of her death. The book is also about a daughter’s journey through an emotional rollercoaster passage of grief that gets intermixed with surprising sweet instances of joyful connections with not only her childlike mother but, also, her innermost self. Throughout the book, the author portrays the ways in which the physical and mental needs of an old-age mother and the emotional, spiritual needs of a caregiver daughter lovingly serve each other and how the dementia serves them both.  The memoir depicts not only the role changes that occur in the relationship between a caregiver daughter and her beloved mother but, also, the more compassionate relationship that the daughter gains with herself as she learns to walk more honestly and gently with her fears, worries, and shortcomings.",
  "genres": [
    "Memoir"
  ],
  "author": "Doreen Cox",
  "average_rating": "4.53",
  "url": "https://www.goodreads.com/book/show/24906735-adventures-in-mother-sitting"
}