{
  "title": "Sophisticated for the Night",
  "description": "Who do you want me to be?My name is Logan Steele. I’m devilishly handsome, seriously ripped, well hung, charismatic and highly sexed. Women just can’t resist me. So when I lost my job in the construction industry and was struggling for cash, I decided to put my assets to good use.By day I’m a private personal fitness trainer. By night I’m a high class escort, making women's utmost desires come to life.It had been over nine months since I’d deflowered Summer Beresford, in her Virgin for the Night fantasy. Nine months where she’d plagued my thoughts, both in my personal and professional life. I’d been resolved to never take another booking from her, I’d never gotten emotionally attached to a client before, it didn’t bode well for me. Especially not when she obviously just saw me as the guy she paid to take her virginity and nothing else. I didn’t take rejection well. When I read that her co-star Daron Beck had set his sights on her and planned to accompany her to their movie premiere next week, it made my blood boil. His reputation for sleeping with his leading ladies, was nearly as legendary as my reputation for being the best in the business. He, other the other hand, wasn’t so respectful of women. The thought of him putting his hands on her, if he hadn’t already, or treating her badly, made my mind up. I was about to do something I’d never done, take a former client out without her paying me, and I wasn’t going to take no for an answer. Next week I’d be accompanying Summer to her premiere, whether she liked it or not. Sophisticated is book five in the For the Night series, which can all be read as standalone steamy reads. However if read in the following sequence, you get taken on Logan's journey of self-discovery, and the entire series becomes a romance novel:1.\tStrangers for the Night2.\tVirgin for the Night3.\tFilthy for the Night4.\tMénage for the Night5.\tSophisticated for the Night6.\tBiker for the Night7.\tDominant for the Night8.\tActor for the Night",
  "genres": [
    "Erotic Romance",
    "Erotica",
    "Contemporary Romance"
  ],
  "author": "C.J. Fallowfield",
  "average_rating": "4.36",
  "url": "https://www.goodreads.com/book/show/24899490-sophisticated-for-the-night"
}