{
  "title": "Outcry: Holocaust memoirs",
  "description": "Outcry - Holocaust Memoirs, a profoundly moving autobiographyManny Steinberg spent his teens in Nazi extermination camps in Germany and Poland, miraculously surviving while millions perished. This is his story. Born in 1925 in the Jewish ghetto in Radom (Poland), Manny soon realized that people of Jewish faith were increasingly being regarded as outsiders. When the Nazis invaded in September 1939 the nightmare started. The city’s Jewish population had no chance of escaping and was faced with starvation, torture, sexual abuse and ultimately deportation. Outcry is the candid and moving account of a teenager who survived four Nazi camps: Dachau, Auschwitz, Vaihingen and Neckagerach. While being subjected to torture and degradation, he agonized over two haunting questions: \"Why the Jews?\" and \"How can the world let this happen?\" These questions remain hard to answer. Manny’s brother Stanley had jumped off the cattle wagon on the way to the extermination camp where his mother and younger brother were to perish. Desperately lonely and hungry, Stanley stood outside the compound hoping to catch a glimpse of Manny and their father. Once he discovered that they were among the prisoners, he turned himself in. The days were marked by hunger, cold, hard labor, and fear. Knowing that other members of the family were in the same camp kept them alive. Since acknowledging each other would have meant death, they pretended to be complete strangers. Manny relates how he was served human flesh and was forced to shave the heads of female corpses and pull out their teeth. Cherishing a picture of his beloved mother in his wooden shoe, he miraculously survived the terror of the Polish and German concentration camps together with his father and brother. When the Americans arrived in April 1945, Manny was little more than a living skeleton, with several broken ribs and suffering from a serious lung condition, wearing only a dirty, ragged blanket. This autobiography was written to fulfill a promise Manny made to himself during his first days of freedom. By publishing these Holocaust memoirs, the author wants to ensure that the world never forgets what happened during WWII. The narrative is personal, unencumbered and direct. Outcry touches the reader with its directness and simplicity. The story is told through the eyes of an old man forcing himself to relive years of intense suffering. It is an account of human cruelty, but also a testimony to the power of love and hope. Memoirs worthy of being adapted for the big screen. \"I read this book with a very heavy heart and tears running down my face. For Manny's endurance and his brother Stanley to be so tested is truly a testament to life!\" \"Very well written as it goes straight to the reader's heart!\" \"Manny Steinberg shares his extraordinary teenage story of surviving four concentration camps in an account noteworthy for its straightforward, unencumbered narrative. His is a story almost everyone can imagine happening to themselves - no less harrowing than more dramatic renditions of Holocaust survival, but somehow more compelling, and universal, for the unembellished simplicity of his style.\" \"Manny's story is told so well and his perseverance is so strong that you are uplifted and reminded of the strength of the human spirit.\"",
  "genres": [
    "Holocaust",
    "Nonfiction",
    "History",
    "Memoir",
    "War",
    "Historical",
    "Biography"
  ],
  "author": "Manny Steinberg",
  "average_rating": "4.51",
  "url": "https://www.goodreads.com/book/show/24905072-outcry"
}