{
  "title": "Parrots of the Wild: A Natural History of the World’s Most Captivating Birds",
  "description": "\" Parrots of the Wild  is an exhaustive compendium of information about parrots, from their evolutionary history to their behavior to present-day conservation issues. A must-have for anyone interested in these amazing creatures.\" —Irene M. Pepperberg, Professor at Harvard University and author of  Alex & How a Scientist and a Parrot Discovered a Hidden World of Animal Intelligence—and Formed a Deep Bond in the Process\"If you like parrots then you'll love this book. From their evolutionary past to their modern-day love lives,  Parrots of the Wild  presents a suitably captivating read. I thought I knew a lot about parrots--until I delved into these pages.\" —Tony Juniper, author of  What Has Nature Ever Done for Us?  and  Spix’s The Race to Save the World’s Rarest BirdParrots of the Wild explores recent scientific discoveries and what they reveal about the lives of wild parrots, which are among the most intelligent and rarest of birds. Catherine A. Toft and Tim Wright discuss the evolutionary history of parrots and how this history affects perceptual and cognitive abilities, diet and foraging patterns, and mating and social behavior. The authors also discuss conservation status and the various ways different populations are adapting to a world that is rapidly changing. The book focuses on general patterns across the 350-odd species of parrots, as well as what can be learned from interesting exceptions to these generalities.A synthetic account of the diversity and ecology of wild parrots, this book distills knowledge from the authors’ own research and from their review of more than 2,400 published scientific studies. The book is enhanced by an array of illustrations, including nearly ninety color photos of wild parrots represented in their natural habitats. Parrots of the Wild melds scientific exploration with features directed at the parrot enthusiast to inform and delight a broad audience.",
  "genres": [
    "Animals",
    "Birds",
    "Nonfiction",
    "Science",
    "Ornithology",
    "Biology",
    "Natural History"
  ],
  "author": "Catherine Ann Toft",
  "average_rating": "4.56",
  "url": "https://www.goodreads.com/book/show/24904690-parrots-of-the-wild"
}