{
  "title": "City of God",
  "description": "Daringly poised at the junction of the sacred and the profane, and filled with the sights and sounds of New York - a narrative of the twentieth century written for the twenty-first.In his workbook, a New York City novelist records the contents of his teeming brain--sketches for stories, accounts of his love affairs, riffs on the meanings of popular songs, ideas for movies, obsessions with cosmic processes. He is a virtual repository of the predominant ideas and historical disasters of the age. But now he has found a story he thinks may be-come his next novel: The large brass cross that hung behind the altar of St. Timothy's, a run-down Episcopal church in lower Manhattan, has disappeared...and even more mysteriously reappeared on the roof of the Synagogue for Evolutionary Judaism, on the Upper West Side. The church's maverick rector and the young woman rabbi who leads the synagogue are trying to learn who committed this strange double act of desecration and why. Befriending them, the novelist finds that their struggles with their respective traditions are relevant to the case. Into his workbook go his taped interviews, insights, preliminary drafts...and as he joins the clerics in pursuit of the mystery, it broadens to implicate a large cast of vividly drawn characters - including scientists, war veterans, prelates, Holocaust survivors, cabinet members, theologians, New York Times reporters, filmmakers, and crooners - in what proves to be a quest for an authentic spirituality at the end of this tortured century.Daringly poised at the junction of the sacred and the profane, and filled with the sights and sounds of New York, this dazzlingly inventive masterwork emerges as the American novel readers have been thirsting for a defining document of our times, a narrative of the twentieth century written for the twenty-first.",
  "genres": [
    "Fiction",
    "Literature",
    "Religion",
    "Literary Fiction",
    "Philosophy",
    "Novels",
    "Classics"
  ],
  "author": "E.L. Doctorow",
  "average_rating": "3.40",
  "url": "https://www.goodreads.com/book/show/24912.City_of_God"
}