{
  "title": "The Race for Paris",
  "description": "Meg Waite Clayton, New York Times bestselling author of The Wednesday Sisters, returns with a transportive World War II novel—inspired by real frontline stories—about journalists who, together, race the Allies to occupied Paris for the scoop of their lives.Opening in Normandy on June 29, 1944, The Race for Paris follows two American female war correspondents on their quest to document (and make) history by covering the Allied liberation of Paris. Jane is a young, single journalist for the Nashville Banner. When she's assigned to cover a field hospital, she meets Olivia, \"Liv,\" an Associated Press photographer.However, unlike their male colleagues, Liv and Jane are constantly confronted by red tape and derision because the military believes women cannot handle the rigors of combat journalism. Jane is resigned to making the most of her assignment, but Liv is determined to get to Paris. After failing to win over her commanding officer, she goes AWOL—and seizing her chance to make a name for herself, Jane joins her.Reluctantly accompanied by Fletcher, a male British military reporter, the two women chase their story through the gunfire, carnage, and death scarring the French countryside. Their journey is further complicated by emotional bonds, romantic tensions, and one woman's secret—a secret with the power to end her career and, perhaps, her life.Inspired by pioneering World War II journalists such as Margaret Bourke-White and Martha Gellhorn—who paved the way for Christiane Amanpour, Marie Colvin, and Lynsey Addario—The Race for Paris combines riveting storytelling with deft literary craftsmanship and extensive research in a passionate narrative of women driven to transcend the limitations of their time.",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "World War II",
    "France",
    "Historical",
    "Book Club",
    "War"
  ],
  "author": "Meg Waite Clayton",
  "average_rating": "3.62",
  "url": "https://www.goodreads.com/book/show/24912554-the-race-for-paris"
}