{
  "title": "Dawn of the New Everything: A Journey Through Virtual Reality [Paperback] [Nov 15, 2017] Lanier, Jaron",
  "description": "Jaron Lanier, ‘the father of Virtual Reality … a high-tech genius’ (Sunday Times), tells the extraordinary story of how in just over three decades Virtual Reality went from being a dream to a reality – and how its power to turn dreams into realities will transform us and our world.Virtual Reality has long been one of the dominant clichés of science fiction. Now Virtual Reality is a reality: those big headsets that make people look ridiculous, even while radiating startled delight; the place where war veterans overcome PTSD, surgeries are trialled, aircraft and cities are designed. But VR is far more interesting than any single technology, however spectacular. It is, in fact, the most effective device ever invented for researching what a human being actually is – and how we think and feel.More than thirty years ago, legendary computer scientist, visionary and artist Jaron Lanier pioneered its invention. Here, in what is likely to be one of the most unusual books you ever read, he blends scientific investigation, philosophical thought experiment and his memoir of a life lived at the centre of digital innovation to explain what VR really is: the science of comprehensive illusion; the extension of the intimate magic of earliest childhood into adulthood; a hint of what life would be like without any limits.As Lanier shows, we are standing on the threshold of an entirely new realm of human creativity, expression, communication and experience. While we can use VR to test our relationship with reality, it will test us in return, for how we choose to use it will reveal who we truly are.Welcome to a mind-expanding, life-enhancing, world-changing adventure.",
  "genres": [
    "Nonfiction",
    "Technology",
    "Science",
    "Philosophy",
    "Biography",
    "Memoir",
    "Audiobook"
  ],
  "author": "Jaron Lanier",
  "average_rating": "3.90",
  "url": "https://www.goodreads.com/book/show/24909817-dawn-of-the-new-everything"
}