{
  "title": "Medication Madness: True Stories of Mayhem, Murder & Suicide Caused by Psychiatric Drugs",
  "description": "Medications for everything from depression and anxiety to ADHD and insomnia are being prescribed in alarming numbers across the country, but the “cure” is often worse than the original problem. Medication Madness is a fascinating, frightening, and dramatic look at the role that psychiatric medications have played in fifty cases of suicide, murder, and other violent, criminal, and bizarre behaviors. As a psychiatrist who believes in holding people responsible for their conduct, the weight of scientific evidence and years of clinical experience eventually convinced Dr. Breggin that psychiatric drugs frequently cause individuals to lose their judgment and their ability to control their emotions and actions. Medication Madness raises and examines the issues surrounding personal responsibility when behavior seems driven by drug-induced adverse reactions and intoxication. Dr. Breggin personally evaluated the cases in the book in his role as a treating psychiatrist, consultant or medical expert. He interviewed survivors and witnesses, and reviewed extensive medical, occupational, educational and police records. The great majority of individuals lived exemplary lives and committed no criminal or bizarre actions prior to taking the psychiatric medications. Medication Madness reads like a medical thriller, true crime story, and courtroom drama; but it is firmly based in the latest scientific research and dozens of case studies. The lives of the children and adults in these stories, as well as the lives of their families and their victims, were thrown into turmoil and sometimes destroyed by the unanticipated effects of psychiatric drugs. In some cases our entire society was transformed by the tragic outcomes. Many categories of psychiatric drugs can cause potentially horrendous reactions. Prozac, Paxil, Zoloft, Adderall, Ritalin, Concerta, Xanax, lithium, Zyprexa and other psychiatric medications may spellbind patients into believing they are improved when too often they are becoming worse. Psychiatric drugs drive some people into psychosis, mania, depression, suicide, agitation, compulsive violence and loss of self-control without the individuals realizing that their medications have deformed their way of thinking and feeling. This book documents how the FDA, the medical establishment and the pharmaceutical industry have over-sold the value of psychiatric drugs. It serves as a cautionary tale about our reliance on potentially dangerous psychoactive chemicals to relieve our emotional problems and provides a positive approach to taking personal charge of our lives.",
  "genres": [
    "Psychology",
    "Mental Health",
    "Nonfiction",
    "Health",
    "Medicine",
    "Psychiatry",
    "True Crime"
  ],
  "author": "Peter R. Breggin",
  "average_rating": "4.14",
  "url": "https://www.goodreads.com/book/show/2492547.Medication_Madness"
}