{
  "title": "Just the Three of Us: An Erotic Romantic Comedy for the Commitment-Challenged",
  "description": "Meet Kathy, a thirty-seven-year-old drifter who’s constantly on the move: to new towns, new jobs, and new relationships. Imagine her surprise when she’s befriended by lifelong friends Sam and Ted, attractive young men who, though ten years her junior, are far more settled than she thinks she’ll ever be. Cheer them on as their three-way friendship succumbs to passion, then passion to romance, and romance to… well, surely it couldn’t be love. Could it?With a Heat Level of 4+, dialogue that will make you laugh out loud, and a plot to tickle your most sentimental of spots, Just the Three of Us promises an entertaining read for fans of romance looking for a unique take on love and sexuality.Excerpt:Ted lay beside me, his hand resting on my hip, seeming perfectly at ease. His fingers took a few tentative steps down my thighs and warmth flooded into them. I guess it showed because he smiled meaningfully at me. I smiled back, my knees parting subtly in welcoming expectation.I heard heavy breathing in my other ear. I turned and saw that Sam was hyperventilating.“Are you all right?” I said, stroking my fingers against his chest.“Are we going to…?” he choked. “We are, aren’t we?\"“We don’t have to,” I said uncertainly.“We don’t?”I put on my bravest face and tried to swallow my eagerness. I felt Ted’s fingers pressing into my thigh and disappointment overcame me again. I forced it down. We were friends first, after all. Even if I could pressure him into this, I wouldn’t.“Not if you don’t want to,” I assured him.He swallowed and gazed thoughtfully into my eyes. Behind my back, Ted remained silent.“But you want to, don’t you?”I shrugged away my ardor with effort. “It’s not all about me,” I said.I saw him glance over my shoulder and knew that he was looking at Ted.“It’s not that I don’t want to,” he mumbled. “I’m just… I’m just not sure I’m ready.”Ted laughed loudly behind my back, breaking the tension. I swiveled towards him, startled.“This is all you’ve talked about all week!” he roared, rolling his body into mine.“What?!” I said, turning back to look at Sam. He was grinning rather sheepishly.“Night and day,” Ted confirmed, his hand abandoning my thigh and circling my waist instead. “How he absolutely couldn’t wait one more minute and couldn’t we get you to come over sooner and did I think you’d really go through with it.”“Well, I…” Sam protested feebly, his cheeks coloring as he lapsed again into that sheepish grin.“So the truth comes out!” I laughed.“Hey, it’s totally different now that you’re actually here! I still can’t believe…”“Believe it, buddy!” I interrupted and he gaped at me, surprised by my sudden change in tone. “Now get your butt over here before I lose my temper. It’s not polite to keep a woman waiting.”“Yes, ma’am!” he said, sliding into me with the force of a mudslide. “Miss!” he hurriedly corrected himself.“That’s better! Now by the time I count ten, I expect to be in bed with two very handsome and very naked young men. No more dilly-dallying!” I threatened, wagging my finger at them. “One…”Abruptly they both jerked away from me, and I rolled onto my backside and watched as polo shirts and boxers went flying across the room like kites snapping in a spring breeze.“Eight,” I breathed, but they were already done. They rolled sideways against me and then snuggled up close to each side of me, their cheeks pink with excitement. I sensed the weight of their bodies pushing against me from my chest to my legs; felt the sweat forming where their skin was pressed against mine. And into each of my hips poked something hard but soft; deliciously promising and hopelessly decadent, and I gulped, uncertain whether to savor the sensation or run away from it.Maybe I, too, had the tiniest of doubts about this.",
  "genres": [
    "Romance",
    "Menage",
    "Erotica",
    "Polyamory",
    "Contemporary Romance"
  ],
  "author": "Lori Schafer",
  "average_rating": "3.64",
  "url": "https://www.goodreads.com/book/show/24923702-just-the-three-of-us"
}