{
  "title": "Not Where I Wanna Be",
  "description": "Sarantos is a solo music artist who started a unique journey in 2014 releasing a song, music video & book chapter every month. He plans on doing this every month until the day he dies. Although he is a singer-songwriter, his true passion is lyrics so Sarantos decided to do something no other musician has ever done before! He wrote this 1st Fantasy Adventure Fiction book mirroring each chapter after the specific song released that month.Sarantos has been writing lyrics since he was in the 4th grade and was always mesmerized by words. So Sarantos decided to do something no other musician has ever done before! He wrote his 1st fiction/fantasy book in 2014 but decided to raise the bar. The book is titled \"Not Where I Wanna Be\" which is the exact same title as his 1st CD. Additionally, Sarantos thought it'd be fun to mirror each chapter after the specific song released that month.This is the story of his fantastic journey. Come along for this unusual adventure and prepare to be surprised at every turn.Sarantos unique sound has been best described by industry insiders as \"an emotionally powerful vocal style masterfully united with music that is a fusion of classic 80s rock blended with modern soft rock and pop music!\"In this fiction and fantasy adventure book, Sarantos is a young human male born on Earth, but currently residing in the home of Wallis on the world of Yarrowtopia. He is 30 years old with dark curly hair and a sensitive nature. He writes lyrics and plays guitar. He is being taught by Wallis on the skills of using magic, which he converts into lyrics and sings his spells like a bard of old. He started a band in this new land. He is in love with Leigh and is best friends with Brad. He has traveled from where he didn’t want to be to where he wants to be via a message from a dream. Mika, rescued him and brought him to a world where he found his one true love, Leigh. He loves singing and enjoys his band while still appreciating the luxury of a shower on his new world, which he incorporated to work with the help of Wallis. Little did he ever realize the adventure of a lifetime that would unfold...Sarantos was nominated for 2 awards for the 2014 International Music & Entertainments Awards for the categories of “Rock Song of the Year” and “Pop Album of the Year”.Sarantos finally released his long-awaited and eagerly anticipated 1st solo artist music album on November 18th 2014. The diversity on this CD was crazy as Sarantos tackled almost every genre imaginable ranging from pop, rock, jazz, rap and country. One week later on Black Friday Sarantos also released a Christmas album. This was a wonderful collection of 4 brand new original Christmas songs, 10 covers of Christmas classics and 9 inspirational Christmas short stories. Families will enjoy listening to this CD every Christmas season...Sarantos music has received rave reviews and he relishes this chance to pursue his life long dream. Sarantos currently has over 1.4M Social Media followers and is rated #3 on Reverbnation in the pop genre worldwide. Sarantos performed at the Toronto Music Festival on May 6th to a sold out live audience.Sarantos has always been inclined to help people in need and is proud to launch his music as a way to donate a portion of proceeds to charity, hopefully inspiring other artists & writers to do the same. Just a few of the charities chosen so far include American Cancer Society, American Lung Association, Make-a-Wish Foundation, American Heart Association, St Jude's, Hellenic Academy, ASERF, American Red Cross, Salvaton Army, Children's Hospital of Chicago, Chicago Medical School, Thanioton Society & many more.The website, Melogia (which in Greek means \"with words\") was established by Sarantos, an aspiring singer and song writer.Sarantos Mission or My goal when you listen to one of my songs is very simple. I want you to feel the need -Sing-Dance or move to the groove-Play the song over",
  "genres": [],
  "author": "Sarantos",
  "average_rating": "4.75",
  "url": "https://www.goodreads.com/book/show/24921651-not-where-i-wanna-be"
}