{
  "title": "Operation Arcana",
  "description": "In the realms of fantasy, the battlefield is where heroism comes alive, magic is unleashed, and legends are made and unmade. From the War of the Ring, Tolkien’s epic battle of good versus evil, to The Battle of the Blackwater, George R.R. Martin’s grim portrait of the horror and futility of war, these fantastical conflicts reflect our highest hopes and darkest fears, bringing us mesmerizing visions of silver spears shining in the sun and vast hordes of savage beasts who threaten to destroy all that we hold dear.Now acclaimed editor John Joseph Adams is sounding the battle cry and sixteen of today’s top authors are reporting for duty, spinning never-before-published, spellbinding tales of military fantasy, including a Black Company story from Glen Cook, a Paksenarrion story from Elizabeth Moon, and a Shadow Ops story by Myke Cole. Within these pages you’ll also find World War I trenches cloaked in poison gas and sorcery, modern day elite special forces battling hosts of the damned, and steampunk soldiers fighting for their lives in a world torn apart by powers that defy imagination.Featuring both grizzled veterans and fresh young recruits alike, including Tanya Huff, Simon R. Green, Carrie Vaughn, Jonathan Maberry, and Seanan McGuire, Operation Arcana is a must for any military buff or fantasy fan. You’ll never look at war the same way again.CONTRIBUTORS:Elizabeth MoonTobias Buckell & David KlechaMyke ColeJonathan MaberryGenevieve ValentineDjango WexlerYoon Ha LeeWeston OchseMyke ColeAri MarmellTanya HuffCarrie VaughnTC McCarthyGlen CookSimon R. GreenSeanan McGuireLinda NagataAt the publisher's request, this title is sold without DRM (Digital Rights Management).About John Joseph Adams:“John Joseph Adams has become one of those editors who I know will put together something I will love to read and know that the book I’m about to purchase isn’t going to let me down.” —Wil Wheaton “Merits a place on fantasy fans’ bookshelves.” —Publishers Weekly, on Epic: Legends of Fantasy“A genuine triumph. . . . [A] ‘must buy’ for every sci-fan you know.” —Romantic Times, a “Top Pick” for February 2013, on The Mad Scientist’s Guide to World DominationJohn Joseph Adams—called “the reigning king of the anthology world” by Barnes & Noble.com—is the bestselling editor of many anthologies, such as Under the Moons of Mars: New Adventures on Barsoom, Brave New Worlds, Wastelands, The Living Dead, The Living Dead 2, By Blood We Live, Federations, The Improbable Adventures of Sherlock Holmes, and The Way of the Wizard. He is a two-time finalist for the Hugo Award and a three-time finalist for the World Fantasy Award. He is also the editor and publisher of Lightspeed Magazine, and is the co-host of Wired.com’s The Geek’s Guide to the Galaxy podcast.",
  "genres": [
    "Fantasy",
    "Anthologies",
    "Short Stories",
    "Fiction",
    "Science Fiction",
    "Military Fiction",
    "Magic"
  ],
  "author": "John Joseph Adams",
  "average_rating": "3.59",
  "url": "https://www.goodreads.com/book/show/24921264-operation-arcana"
}