{
  "title": "How to Make Your First App",
  "description": "For years and years, I dreamt about making an iPhone app. But I never followed through.I held myself back by thinking that I needed to be an expert programmer, have an epic idea and have thousands of dollars to invest.But none of that was true. You see, I was able to launch my first app with no coding skills, a simple idea and only $250.Today, it's gotten well over 100,000 downloads and generated thousands of dollars in profit.This book outlines the steps I took so that you can stop dreaming about making an app and finally do it.We'll The exact steps I took to go from nothing to having my own app 1 month later for only $250. And then how I grew it to 100,000+ downloads and profitability.- How to set up accountability so that you actually complete your app instead of continuing to brainstorm- How to analyze and research existing applications to identify gaps and opportunities for new apps that people want- How to validate that your app idea is worth pursuing before spending a cent on a developer- Why competition is GOOD- A proven framework to handle ‘idea overload’ so that you don’t waste weeks debating back and forth between which idea to pursue- The best way to deal with the fear of other people stealing your ideas- How to easily communicate your app idea and design to a developer so that there is no miscommunication and costly mistakes- How to hire a developer without worry or stress- The ridiculously simple hiring strategy I used to weed out 75% of developers, save myself hours of looking through portfolios and automatically identify the best candidates- The best approaches to app marketing and how to get 80% of the results with 20% of the effort. I’ll tell you which popular app marketing methods are complete time-wasters.- How to get tens of thousands of downloads without paying a dime on advertising*This book outlines what I did and how but is by no mean's a guarantee that your results will match mine. You might do better or you might do worse.",
  "genres": [],
  "author": "Ben Philabaum",
  "average_rating": "2.86",
  "url": "https://www.goodreads.com/book/show/24923110-how-to-make-your-first-app"
}