{
  "title": "Die Seele der Nacht",
  "description": "Schon Bastian Balthasar Bux hatte es in der »Unendlichen Geschichte« erlebt: Die Welt Phantásien verändert sich jeden Tag. Phantásien wächst oder schrumpft, bringt unendlich Schönes und ebenso Schreckliches hervor. So wie im Tal der Blauschöpfe. Nacht für Nacht bedrohen dunkle Kreaturen das naturverbundene Volk. Ein eilig zur Kindlichen Kaiserin entsandter Bote kehrt nicht zurück. In ihrer Not fliehen die Blauschöpfe ins mächtige Reich Nazagur. Niemand weiß, warum es schneller wächst als jedes andere Land in Phantásien.Allein die junge Tahâma wartet im Tal der Blauschöpfe weiter auf den Boten. Schwer verletzt kehrt er zurück. Die Nachricht von der Flucht der Blauschöpfe nach Nazagur erschüttert ihn zutiefst. Tahâma versteht sein wirres Gerede nicht, während er ihren Armen stirbt. Nur so viel: Die Blauschöpfe schweben in großer Gefahr. Sie muss ihr Volk retten.Tahâma begibt sich auf eine abenteuerliche Reise, die sie nur mithilfe treuer Gefährten überlebt: den Erdgnom Wurgluck und Céredas, einen Jäger mit einem dunklen Geheimnis. Tahâma fühlt sich schneller zu dem wilden jungen Mann hingezogen, als ihr lieb ist. Als die drei Nazagur erreichen, fängt für sie der Albtraum erst an. Eine unheimliche Macht hält das Land in seinem Bann. Und nun streckt diese Macht ihre Krallen auch nach Tahâma aus.»... aber das ist eine andere Geschichte und soll ein andermal erzählt werden.« Fünf deutsche Autoren haben sich diesem bekannten Satz aus Michael Endes »Die unendliche Geschichte« angenommen. In der Tradition von Michael Ende unternehmen sie in der Reihe »Die Legenden von Phantásien« spannende Entdeckungsreisen in die Welt der Phantasie: Ralf Isau, Ulrike Schweikert, Wolfram Fleischhauer, Peter Freund und Peter Dempf erzählen die aufregenden Geschichten eines grenzenlosen Reiches.",
  "genres": [
    "Fantasy"
  ],
  "author": "Ulrike Schweikert",
  "average_rating": "3.06",
  "url": "https://www.goodreads.com/book/show/2491746.Die_Seele_der_Nacht"
}