{
  "title": "Return From Miami: Women's Erotica Romance - Book 1",
  "description": "Lawyers & Librarians…Accountants & Scientists…Teachers & Trustees…Cops & Cowgirls…Nurses & Nannies…Stockbrokers & Secretaries…Housewives & Hookers…They ALL wanted James Masters.White, Black, Latina, Asian & Native American women…Short, tall, big & small women…Some of these women were older than James…Others were younger than James…But they ALL had something in common…They ALL wanted James Masters…. . .one at a time . . .or sometimes . . .two at a time.What was his secret?James Masters, a handsome, and muscular, but otherwise seemingly “regular guy” became Mr. Grey’s Mentor the Mid-1980’s. This is his story.Book 1 Return from James Masters meets Mr. Grey and soon agrees to be his mentor in the ways of love and seduction. Brenda, 40 year-old, high-powered San Francisco Bay Area divorce attorney, and, smokin’ hot “current” girlfriend of 27 year old James Masters assists in Mr. Grey’s education.Book 2 Mr. Grey’s OH! The things that went on there! And who was listening when it did?Book 3 Higher A flash-back the “college daze” in the Mid-1970’s where nearly 19 year-old “regular guy” James met, and by some stoke of incredible luck ends up being the boyfriend of the also nearly 19 year-old, brilliant and “Traffic Stopping Beautiful” Darlene. She was “The “Pin-Up Girl” in the minds of ALL of the other guys in the dorm! How did THAT happen?Book 4 College Crunch Darlene and James manage to “squeeze-in” a few “study breaks” even during the rigors of academia, but . . .was it too good to last?Book 5 Backgammon Anyone?: Alice Burns, was an unassuming name for the petite seductress, who thought that she was a reincarnation of Aphrodite on earth, and had her sights set on James. Who ended up on top?Book 6 Pool In the last summer before his Senior year of college, James had a summer-fling with Annette, the cowgirl, and OH the surprises that happen at a pool party. Those off-campus apartments are under-rated!(Books 1-6 are released to Kindle NOW!)The upcoming next series of books will trace Mr. Masters mentoring Mr. Grey through the 1980’s and on to today. Starting with the February 2015 release Book 7 Senior “De” the brilliant “hippie chick” makes a miraculous transformation much to surprise of James Masters.",
  "genres": [],
  "author": "Kem Grey",
  "average_rating": "0.00",
  "url": "https://www.goodreads.com/book/show/24917187-return-from-miami"
}