{
  "title": "10 Secrets of the New Rich: Your Ultimate Motivational Guide to Achieving Personal Transformation, Mastering Entrepreneurship, and Joining the World's New Breed of Millionaires",
  "description": "Are you sick and tired of dealing with financial struggles? Are you saddened and discouraged as you watch the years pass and realize that your dreams are becoming increasingly unattainable? You've worked hard your entire life, with little to show for it. You've worked for someone your entire life. Yet you have everything you need to succeed! You have the skill, the innovative ideas, the motivation, the willingness to work hard, and you certainly have the dream of wealth and success. Yet life didn't quite pan out as you'd envisioned it would. Now, you simply don't know where to begin. How do you achieve the wealth and success you've been dreaming about? You'll find the answer in author Kevin J. Donaldson's 10 Secrets of the New Rich: How to Join the World's New Breed of Millionaires. When you buy this comprehensive new self-help guide, you'll be presented with the keys to transforming your finances and improving life amidst a new, rapidly evolving economic environment. According to author Kevin J. Donaldson, the world needs more millionaires. That's why he authored a new in-depth self-help guide that will enlighten and inspire individuals who are ready to embark upon an exciting journey of transformation. It's the perfect guide for the small business owner or aspiring entrepreneur who is ready to achieve the success that's been elusive thus far. A life coach, business coach, chief strategist and CEO at Real Wealth Solutions, Kevin J. Donaldson knows success. In fact, he's among the nation's top ten percent income earners! But he didn't grow up in a world of privilege. Donaldson faced many failures both personally and professionally, but he used these experiences to fuel his drive to succeed not only in business, but in other areas of life as well. When you buy 10 Secrets of the New Rich: How to Join the World's New Breed of Millionaires, you'll access Donaldson's valuable insight. You'll also be privy to the knowledge which has allowed him to succeed in his career --- a career spent transforming lives and helping others as they strive to achieve success; success that was previously relegated to their dreams. Readers of 10 Secrets of the New Rich: How to Join the World's New Breed of Millionaires will enter the world of a new breed of millionaires. Today, an increasing number of aspiring entrepreneurs, investors and small business owners are walking away from the traditional model that's endured for so many years. American society is moving away from working for another business owner, thereby lining his pockets and securing his family's financial future, while your own financial future remains less than certain. Whether you dream of success in the field of entrepreneurship, investment or beyond, 10 Secrets of the New Rich: How to Join the World's New Breed of Millionaires will open your mind and inspire your heart as you discover the keys to transforming your life for the better. Buy this book today and discover the keys to transforming your life.",
  "genres": [],
  "author": "Kevin J.  Donaldson",
  "average_rating": "3.48",
  "url": "https://www.goodreads.com/book/show/24921936-10-secrets-of-the-new-rich"
}