{
  "title": "Miss Match",
  "description": "Back in high school, if someone had told Clare Fox she would write for a living someday, she would have laughed in their face — or just dumped her cafeteria lunch down their shirt.  Ten years later, she has overcome both dyslexia and her high-school-dropout status with her own, personal ace in the hole: Her extensive knowledge of the male species. Now, Clare is Miss Match, the sassy, savvy love advice columnist for online dating site Mister-Match.com.  No one would dispute that Clare knows all there is to know about the male species — though some might say she knows all the wrong things. And lately, her advice columns have strayed a little beyond sassy and into the realm of acerbic...or even downright jaded.  It’s just that her life used to be a lot more exciting. A year ago, she was downtown five nights a week. These days, a typical Friday night is spent on the couch with a pint of Ben & Jerry’s for company. When Clare’s boss sends her on a singles’ cruise, ostensibly to vet the company for a possible partnership deal, Clare can read between the lines: Her job is on the line, and she’s been given one last chance to shape up...or ship out.  And then there are Clare’s meddling best friends, who have cooked up a little scheme of their own. On the sly, they hire the Love Doctor — refined, genteel Javier Valentín — to woo their best friend and sweeten up her bitter heart. Healing broken hearts, after all, is Javier’s work and his passion... Except he normally does it with the woman’s full knowledge and consent. His process highlights perfect honesty, and it’s not about sex — it’s about helping a woman reconnect with her own strength, desires and sense of self-worth.  But Clare is a prime candidate for the Love Doctor’s expertise. Javier can’t pass up such a juicy case, but as soon as he meets her, his careful, tried-and-true process flies right out the window as he is captivated by this fiery, hard-hearted vixen.  Good thing he can see right through her bravado to the tender and passionate heart within. But can Clare let the Love Doctor past her walls and defenses, or will she end up doing what she’s done to a hundred other men, and stomp his heart to pieces?  ---  HEAT LEVEL: Steamy. MISS MATCH is a contemporary romance novel that contains several explicit lovemaking scenes, and plenty of sexual tension between the hero and heroine.",
  "genres": [
    "Romance",
    "Chick Lit",
    "Contemporary",
    "Contemporary Romance",
    "Fiction"
  ],
  "author": "Catherine Avril Morris",
  "average_rating": "3.53",
  "url": "https://www.goodreads.com/book/show/24929414-miss-match"
}