{
  "title": "Everything Carries Me to You",
  "description": "Everything Carries Me to You is the third and final act in the Axton and Leander series. What started off as a sweet story about a reclusive gay werewolf finding love has become a high stakes action packed drama, and now lives are on the line.Love is all you need--unless love is not enough. In Los Angeles, Axton and Leander were blissfully, peacefully in love, navigating the warm, deepening waters of their relationship. But a man from Axton's past took it all away in an instant. With Dana threatening Leander's safety, Axton has no choice but to leave in order to save his human lover's life. After a painful good-bye on a hospital bed, Axton goes away for what might be forever.Axton knew the price was high: a life for a life. But Axton has no idea how much higher the price can still get. Dana might still be in love, so he claims, but mercy will not temper his hand. How far can Axton be pushed before he snaps? How much can Axton take before he's out of his mind with pain and grief? And when he snaps--not if--then who will land the killing bite? Axton? Or his ex-boyfriend turned jailer?Left with two broken legs and a shattered heart, Leander nonetheless knows what he must do. He swore to Axton that they would be reunited, and Leander is a man who keeps his promises. Physical recovery might be slow, but love doesn't wait. Leander sets his plans in motion before he's even out of the hospital. Before he can follow Axton, Leander has to find him...Separated and longing for reunion, Axton and Leander reach for each across the sprawling American landscape. They live under the same moon, they might wish on the same stars, but nothing is easy. Working apart, they will nonetheless have to fight together, fight for each other, fight for their future--or else the good-bye is forever.Sometimes bleak and despairing, sometimes soft and tender, sometimes spitting with rage, Everything Carries Me to You spans the full spectrum of human emotion. From the sublime and lonely mountains of Montana in Winter Wolf, to the friendly and welcoming community in City Wolf, the Axton and Leander series has been a fresh voice in the werewolf romance genre. Though often serious, the story still finds time for subtle humor, and also very unsubtle humor. With a growing, varied cast of characters, the story has kept on evolving.By turns brutal and bloody and then benevolent and beautiful, Everything Carries Me to You is an epic, heart wrenching finale. It's a tale of fighting, of friendship, of freedom. It's romance and angst and action. It's about love measured against loss, about revenge against mercy. Ultimately, the lesson is this: not all fights are the same.There's more than one way to be a hero.",
  "genres": [
    "M M Romance",
    "Shapeshifters",
    "Paranormal",
    "Romance",
    "Fantasy",
    "Werewolves",
    "Contemporary"
  ],
  "author": "S.P. Wayne",
  "average_rating": "4.07",
  "url": "https://www.goodreads.com/book/show/24932393-everything-carries-me-to-you"
}