{
  "title": "Ruined: Loving An Alpha Male",
  "description": "He’s addicted to her. The mere thought of her brings Mason to his knees. There is no other woman in the world that he wants. Max can’t believe that she met a passion-filled man that makes her body yearn for things she’s only dreamed about. He’s ruined her, making him the only man that she wants. Mason West, an ex-Navy Seal turned Amateur MMA fighter, is battling the darkness of the life he left behind. Finding the will to fight back in a woman that completes him was not something that he expected, but it seemed fate had other plans. All Maxine Shaw wanted to do was graduate, become a nurse for the best sports rehabilitation center in the country, and finally achieve the goals she set for herself. Once she catches a glimpse of Mason West, an Alpha male to the core, he awakens a fire inside of her that she never thought existed. The sparks between these two ignite bottomless passion and enduring love that shifts their goals in a way neither suspected. Before Mason and Max can embark on a journey of happily ever after, the strength of their love gets tested. Will this passionate pair be able to survive what fate has in store? Warning: Includes hot alpha male sex ... A LOT OF IT! *** EXCERPT *** Her body was perfect in my eyes. She had just enough cushion to make a man go crazy over. Her ass was round and apple-shaped but not overwhelming. Her waist came in delicately, which enhanced her hips even more. And her thighs … Holy hell, they were my favorite so far. “Do you want to taste?” I traveled back up to her beautiful face. 'Fuck yes, I want to taste. I want to taste every inch of you,' I thought. I know just by looking at her that she would taste exquisite. I rose from my chair and moved closer to accept the spoon that she held out for me. As I took the spoon, I never took my eyes from hers. I moaned at the flavor that attacked my taste buds. I reached my right hand around her waist and noticed that she had some sauce on her right hand that held the spoon. As I pulled her closer to my body, I removed the spoon and then moved her hand closer to my mouth. With my tongue, I licked the sauce from her hand and moaned again, “That does taste good.” “It does?” she asked me as she watched me put each finger of hers in my mouth and suck them one by one slowly. She let a small moan escape her lips and at that moment I wanted to taste more of her. I then leaned in and caressed her lips with mine. I kissed her softly at first, just to feel how much she would give to me. She was hesitant at first but only for a second. I ran my fingers in her short hair and pulled her head back, giving me better access to her. She gasped at the slight force I used to move her head. I took advantage of her mouth opening and thrust my tongue in her beautiful fuckable mouth. Hot damn, she tasted fucking amazing. The more I kissed her, the more I wanted her. She finally let go and fisted my hair with both of her hands. As she moaned in my mouth, it was like a charge that went through me. I grabbed her ass tightly, squeezed and picked her up. I moved her on the counter and she opened her legs to invite me in. I didn’t waste any time attacking her delicate body. I started kissing her neck, biting in certain places that I knew would drive her crazy. “Mason,” she moaned softly and the sound, as I knew it would, almost undid me. I attacked her mouth again and started exploring this body that I’ve been obsessed with since I saw her almost a month ago. “Damn, baby. You feel so good.” I regrettably pulled back and... Wait … Did she really just moan? I looked in her eyes and rubbed her thighs. “I need to taste more of you, angel,” I croaked hoping I didn’t sound too desperate. I felt her hands travel down my back and she gripped my shirt trying to pull it up and off me. She responded, begging, “Please.\"",
  "genres": [
    "Interracial Romance",
    "Romance",
    "Erotica",
    "Military Fiction",
    "Mixed Martial Arts",
    "Suspense",
    "Contemporary"
  ],
  "author": "S.K. Lessly",
  "average_rating": "4.39",
  "url": "https://www.goodreads.com/book/show/24935422-ruined"
}