{
  "title": "A Gorgeous Mess",
  "description": "QCKBKS0000002Four wheels move the body. Two wheels move the soul.ANSON: I was just a mercenary back from fighting the good fight overseas. I was on a quest for my father, my roots, looking for answers. Turk Blackburn, Bent Zealots MC Prez, ordered me on a fresh operation to prove myself, my guts, my valor. Infiltrate the Navajo Rez and find out who is claiming the Zealots’ turf, using kids to cook drugs.My partner is the famous badge slut, Ormond Tangier, known far and wide for his mad oral skills, his subservience to anyone in uniform. Mercenaries don’t wear badges, but my dominant side soon has me all over that seductive Spanish servant. A man may as well have a few laughs while on a fatal mission. Because these things never end pleasantly.ORMOND: I was flung into a life-or-death battle against the slimy Iceman, leader of a rival MC. Iceman is running all sorts of questionable ops on Bent Zealots land, and now Anson and I have to prove our street creds just to stake a claim in our own backyard.I’m a friend of cops, firemen, and soldiers alike, but suddenly I only want one man ordering me around. Anson Dineyazzie, macho half-breed hired gun, has stolen more than just my heart. This was never supposed to happen. ANSON: I swear I’m never falling for that service bottom Ormond. I’m accomplishing this op and going back to Afghanistan. But I have to wrest control of this Rez land from Iceman and the lethal hit man who has been trailing us. I’d bury anyone who got between me and Ormond. Does that mean I’m in love? God, I hope not. Don’t think I can take that again. Just need to get back onto the open road and blow the dust from my soul.Publisher’s warning: This book is not for the faint of heart. It contains scenes of gay sex, illegal doings, violence, and forced seduction roleplay. There is no cliffhanger and there is a HEA.",
  "genres": [
    "M M Romance",
    "BDSM",
    "Contemporary",
    "Crime",
    "Erotica",
    "Romance",
    "Dark"
  ],
  "author": "Layla Wolfe",
  "average_rating": "3.98",
  "url": "https://www.goodreads.com/book/show/24929478-a-gorgeous-mess"
}