{
  "title": "Six Years",
  "description": "***2nd Edition (June 25, 2016)***They hadn’t seen each other in six years. She’d always had a crush on him. He'd only ever seen her like a little sister. And now...he’s back.BrooklynI thought that he was a part of a distant past. I thought I didn’t feel anything for him now, but I was not so sure anymore. Having him back in my life, for however long it was, was making me see things differently. So many things had changed in the last six years and somehow I’d lost myself and forgotten all about my dreams. My home life was still a mess, my personal life was nothing to boast about and when I see how successful he is, how everything he’d always wanted came true, I couldn't help but feel lacking in a lot of ways. But he’s back and he needed me. I knew I was the only one who understood that part of his life, the only one he’s willing to share it with. My heart is still beating too hard and too fast for him and this time around, I was as much an adult as he was. Having a six year age gap didn't mean shit.NolanBeing back in Riverdale was harder than I thought. I’d turned my back on that life, but there had always been that one girl in my head. Little B. Now she’s nothing like the twelve year old girl I’d last seen. She’s a young woman, gorgeous and sexy. I couldn't stay away. There’s something drawing me to her and it goes beyond my need to reconnect with her, to have her back in my life and fill the hollow part of my chest. But I couldn't forget the little girl she had been; I shouldn’t forget the little girl she used to be.Growing up with a junkie mother and nobody else, my neighbor, Brooklyn, had been my only happy place. I had taken care of her, and when I had left, I had to leave behind a huge part of me. I couldn't do it again. I needed her. Once again, she’s the only person I want in my life, but I wasn’t sure if it was for all the right reasons. Were there too many obstacles in the way?Contemporary Romance standalone novel for readers over 18.",
  "genres": [
    "Romance",
    "New Adult",
    "Friends To Lovers",
    "Contemporary Romance",
    "Contemporary",
    "Second Chance",
    "Second Chance Romance"
  ],
  "author": "Stephanie Witter",
  "average_rating": "3.52",
  "url": "https://www.goodreads.com/book/show/24932168-six-years"
}