{
  "title": "Rushing the Goal",
  "description": "Introduced in Toni Aleo’s Bellevue Bullies Series, it’s the Sinclair brothers’ big sister’s turn to find love in the next installment of the New York Times and USA Today best-selling series, the Assassins.Lucy Sinclair was no stranger to pain.She grew up with three younger brothers, met a bad boy, got pregnant by him, married him, and then suffered through a nasty divorce from him. Pain. That was pain. To top it off, she even had to go through the heartbreaking divorce of her parents. Through it all, she survived. All she cared about was making sure her daughter was happy and taken care of. Despite an ex-husband hell-bent on ruining her life, she fought to overcome. She’s gotten to the point that she’s okay with being just okay. She never cared about herself because she never had the time. It was Angie and only Angie she focused on, but that all changed when Benji Paxton offered to help her daughter on the ice.Benji knew the moment he saw Lucy, he’d never be the same. Especially when she came with the bundle of crazy that was her daughter. His heart wasn’t ready for them. After years spent sobering up and finding who he was without the alcohol, he never forgot he was being punished for not appreciating the love he had when he was younger. Because of his past, he had gotten used to being alone, a recluse, but even he had to admit it was getting old. He was lonely. Hockey wasn’t enough anymore. He wanted a family; he wanted his true love.And Lucy and Angie were just that.They were just two lost souls.Floating through life with no purpose.But finding each other gave them direction, a chance at a future.And had them both Rushing the Goal to be together.",
  "genres": [
    "Sports",
    "Romance",
    "Sports Romance",
    "Hockey",
    "Contemporary Romance",
    "Contemporary",
    "Audiobook"
  ],
  "author": "Toni Aleo",
  "average_rating": "4.42",
  "url": "https://www.goodreads.com/book/show/24928488-rushing-the-goal"
}