{
  "title": "Where Souls Spoil (Bayonet Scars Series, Volume I)",
  "description": "Where Souls Spoil (Bayonet Scars Box Set, Volume I) THIS IS THE END OF THE BEGINNING... The only thing stronger than the bond of Forsaken's brotherhood is the strength of the women who fight for their hearts. In Ride we fell in love with Ryan despite our better judgment and cheered Alex on in her relentless pursuit of his heart. In Thrash we hurt for Nic as she struggled to trust Duke and let him love her. In Rev we saw Grady as both an intense lover and a flawed man trying to be a good father. In Crush we were consumed by the volatility of first love with Jeremy and Cheyenne. Now, in Vow we see the product of Ryan's love as he searches for something that Alex may not be ready to give-- yet. For a limited time the first half of the Bayonet Scars series is together with Ride, Thrash, Rev, Crush, and Vow plus Where Souls Spoil & Hearts Rot, an exclusive guide to the Forsaken Motorcycle Club and the Bayonet Scars universe. Love is never more riveting than when it's Forsaken.   Vow (Bayonet Scars, No. 4.5) HE REFUSES TO GIVE IN. SHE REFUSES TO GIVE IT UP. Alexandra Mancuso knows all about regrets. She talked to the wrong person and started a war that’s ravaged her newly adopted motorcycle club family and threatens to cost Alex her life. Now, she’s cautious with the commitments she makes. Ryan Stone, road captain for the Forsaken Motorcycle Club regrets nothing—except putting Cub in danger one time too many. The Forsaken Motorcycle Club has a plan to end the war with the Mancuso crime family and they need everyone’s head in the game. But Ryan can’t focus on the club when he’s so distracted by a certain reckless brunette. She gives him everything except for what he really wants. Today, he refuses to take no for an answer and maybe, just maybe, this time Alex won’t be able to stand her ground. True love always defies the odds.  *VOW Vow is a never before released 13,748 word story from the Bayonet Scars Series.",
  "genres": [],
  "author": "J.C. Emery",
  "average_rating": "4.30",
  "url": "https://www.goodreads.com/book/show/24930334-where-souls-spoil-bayonet-scars-series-volume-i"
}