{
  "title": "With Tooth And Claw",
  "description": "Chad, Vincent and their friends are going camping. Chad doesn’t even like camping. The only reason he is even here is because the delectable Denise has come along too.Now they are all assembled around the campfire drinking and trying to scare one another with lame horror stories. None of which are particularly scary. Chad is hoping they hurry it up and move along to some more risqué games, preferably involving Denise.However, Vincent has one more tale to tell…Nick and Maree just want to have a good night together. But people won’t stop messing with them. The town bully, the self-perceived beauty queen, even the local cop want to give them some sort of hell.Maybe that is a very bad idea…Stu just wants to get himself as drunk as possible and visit all the strip clubs in town, ogling and deriding all the naked dancers he can. Pretty much the same thing he does every night. He thought he knew all the exotic dancing bars and strip clubs, but apparently not. Club Styx isn’t somewhere he has ever been before…John has come home from the war, a deserter, sneaking back into the country. He hasn’t come back the same as he went away. He’s brought something with him, a curse, a contagion. And it isn’t something he can contain. When it starts to spread, it is going to spread like wildfire and there will be no stopping it…Cody and Jeff are supposed to be on a simple stakeout mission, warned by their brutal criminal boss to follow his orders to the letter. Boredom and curiosity are going to get the better of them, and this basic job is about to get a whole lot more involved…Donna can’t let herself fall asleep. Because when she does, the same thing happens every time. People die in a grisly violent fashion. She’s tried everything to halt the inevitable, but she’s so sleepy. And drifting off…Josh and Megan are hiking with their group, aiming to reach the peak of notorious Mount MacGinnis. When a freakish thunderstorm drives them all to seek sanctuary in the many caves existing in the mountainside, the duo take the opportunity to explore their developing relationship. However, there are others in this group who appear to know a little more about the mysterious cave network than they are letting on.Before long, it isn’t just going to be heavy rain and blustery wind pouring havoc down on these unwary shelter seekers…There is a whole lot of gruesome death and violence inflicted within this collection of macabre tales, but the majority of it contains one common element. Weapons and tools are not utilised here, bloody havoc is caused, with tooth and claw.",
  "genres": [
    "Splatterpunk",
    "Horror"
  ],
  "author": "Jim Goforth",
  "average_rating": "4.23",
  "url": "https://www.goodreads.com/book/show/24936977-with-tooth-and-claw"
}