{
  "title": "Ruby",
  "description": "Ruby Erickson was the best OR surgeon the small hospital had. Management had mandated that the doctors were to turn away any people for treatment that couldn’t pay. Under strict orders to follow the rules or else…Ruby operated on the young woman anyway. She’d never live long enough to survive the trip to County. Josh Ewing was suffering from a bad breakup. He had moved to the small town to get away from his cheating ex-girlfriend and former best friend and partner. His sister Bri was here and was all he had left in way of family. When Bri comes up missing, Josh is beside himself with worry. He finds his sister in a small hospital listed as a Jane Doe in critical condition. When he finds out that the doctor who saved her life had lost her job because she didn’t turn his sister away, he wants to do all he can for her… She cut Josh off with a finger punching to his chest. “You’re damn right I saved her life. And do you think that because you put money in my account or paid nearly a hundred grand to my loans that I’m somehow going to be beholden to you? You fucking bastard, take it back. All of it, right now.” Josh shook his head and braced his arms over his chest as if to do battle. Quentin took a step back now. He wasn’t stupid. “You heard me, I want you to take back that money now, or so help me you’re going to need it for your own hospital bills.” “Even if I could—which I don’t care if I can or not—I won’t do it. You risked a great deal to save her life, and I pay my debts.” Ruby growled and took another step toward Josh. It took Quentin several seconds to realize that something had happened in that short period of time. Ruby didn’t have time for a mate, not now not ever. Josh wasn’t happy about it either, but discovered once he got past her stubborn surface, that she really was a rare gem. But trouble doesn’t elude them for long. That ex-girlfriend of Josh’s was into some heavy stuff―things he didn’t know about―things that could get them all killed―things that put them all on the radar of the wrong people…",
  "genres": [
    "Paranormal",
    "Vampires",
    "Romance",
    "Shapeshifters"
  ],
  "author": "Kathi S. Barton",
  "average_rating": "4.21",
  "url": "https://www.goodreads.com/book/show/24937005-ruby"
}