{
  "title": "The Red Web: The Struggle Between Russia's Digital Dictators and the New Online Revolutionaries",
  "description": "A Library Journal Best Book of 2015A NPR Great Read of 2015The Internet in Russia is either the most efficient totalitarian tool or the device by which totalitarianism will be overthrown. Perhaps both.On the eighth floor of an ordinary-looking building in an otherwise residential district of southwest Moscow, in a room occupied by the Federal Security Service (FSB), is a box the size of a VHS player marked SORM. The Russian government's front line in the battle for the future of the Internet, SORM is the world's most intrusive listening device, monitoring e-mails, Internet usage, Skype, and all social networks.But for every hacker subcontracted by the FSB to interfere with Russia's antagonists abroad -- such as those who, in a massive denial-of-service attack, overwhelmed the entire Internet in neighboring Estonia -- there is a radical or an opportunist who is using the web to chip away at the power of the state at home.Drawing from scores of interviews personally conducted with numerous prominent officials in the Ministry of Communications and web-savvy activists challenging the state, Andrei Soldatov and Irina Borogan peel back the history of advanced surveillance systems in Russia. From research laboratories in Soviet-era labor camps, to the legalization of government monitoring of all telephone and Internet communications in the 1990s, to the present day, their incisive and alarming investigation into the Kremlin's massive online-surveillance state exposes just how easily a free global exchange can be coerced into becoming a tool of repression and geopolitical warfare. Dissidents, oligarchs, and some of the world's most dangerous hackers collide in the uniquely Russian virtual world of The Red Web.",
  "genres": [
    "Nonfiction",
    "Politics",
    "Russia",
    "History",
    "Technology",
    "Science",
    "Sociology"
  ],
  "author": "Andrei Soldatov",
  "average_rating": "3.95",
  "url": "https://www.goodreads.com/book/show/24945323-the-red-web"
}