{
  "title": "When Two Rivers Meet",
  "description": "A Clean RomanceAlmost four years after coming out into society as an accomplished young woman, Miss Lilyanna Crosgrove has become tired with her way of life at Heatherhill, the stately home she lives in right outside of Bath. Her mother decides what Lilyanna does and whom she speaks with each day. And when Lilyanna comes to discover what she wishes for most in life, as well as in a future companion, her desires remain unheard. One evening, however, Lilyanna's life promises to change forever when Mr. Elijah Bainbridge, a man as caring as he is handsome, asks her for a dance. Through various assemblies and balls, entertaining dinner parties, and horse rides across the green countryside, their attraction to each other grows. Their relationship does not come without difficulty, however, as outside forces, including an unrelenting suitor and a secret from Elijah's past, will stop at nothing to keep the couple apart. Will Lilyanna and Elijah waver under the pressure of cruel rumors and persistent threats? Or will they be able to join together, eventually overcoming the opposition surrounding their union?Excerpt: Lilyanna glanced to the left of the dancing crowd and noticed a tall, dark-haired man with his back facing her. His broad shoulders stretched a greater width than Lilyanna had seen amongst the recent onslaught of men in Bath, so she stared until he turned, revealing his profile. \"Goodness,\" she breathed, ripping her eyes away from the handsome gentleman only for a moment to ensure no one had heard her embarrassing exclamation. Looking back at him between passing bodies, Lilyanna saw the faintest shadow of dark facial hair framing his strong jaw line. The crowd suddenly thickened as the dance ended, and she craned her neck to catch another glimpse. However, she frowned as she lost sight of him, biting her lip after realizing how far she had moved away from her mother in order to see him. Shocked with her unladylike behavior, Lilyanna blushed, returning to her mother's side, relieved her short absence had gone unnoticed.eBook available at: http://www.amazon.com/When-Rivers-Mee...Paperback available at: www.deborahmhathaway.com",
  "genres": [
    "Regency",
    "Romance",
    "Historical Fiction",
    "Historical",
    "Regency Romance",
    "Clean Romance",
    "British Literature"
  ],
  "author": "Deborah M. Hathaway",
  "average_rating": "4.07",
  "url": "https://www.goodreads.com/book/show/24954838-when-two-rivers-meet"
}