{
  "title": "The Higgs Boson and Beyond",
  "description": "Length: 6 hrs and 20 minsThe discovery of the Higgs boson is a triumph of modern physics. The hunt for the Higgs was the subject of wide media attention due to the cost of the project, the complexity of the experiment, and the importance of its result. And, when it was announced with great fanfare in 2012 that physicists has succeeded in creating and identifying this all-important new particle, the discovery was celebrated around the world.And yet, virtually no one who read that news could tell you what, exactly, the Higgs boson was, and why its discovery was so important that we had to spend 10 billion dollars and build the single largest and most complex device in the history of mankind in order to find it. When you understand the details, this story ranks as one of the most thrilling in the history of modern science.Award-winning theoretical physicist Sean Carroll, a brilliant researcher as well as a gifted speaker who excels in explaining scientific concepts to the public, is perfectly positioned to tell this story. In this 12-lecture masterpiece of scientific reporting, you'll learn everything you need to know to fully grasp the significance of this discovery, including the basics of quantum mechanics; the four forces that comprise the Standard Model of particle physics; how these forces are transmitted by fields and particles; and the importance of symmetry in physics.You also get an in-depth view of the Large Hadron Collider - the largest machine ever built, and the device responsible for finally revealing the concept of the Higgs boson as reality. By the end, you'll understand how the Higgs boson verifies the final piece in the Standard Model of particle physics, and how its discovery validates and deepens our understanding of the universe.",
  "genres": [
    "Science",
    "Physics",
    "Nonfiction",
    "Audiobook",
    "History",
    "Astronomy",
    "Education"
  ],
  "author": "Sean Carroll",
  "average_rating": "4.11",
  "url": "https://www.goodreads.com/book/show/24949899-the-higgs-boson-and-beyond"
}