{
  "title": "Negotiations",
  "description": "Theoden: I am now the official Prince of the City. The reins have been handed over and I am now fully in control. My first order of business is to fortify the defenses of my territory. Thanks to my King, Ara's decree, my plate is exceptionally full. I have to solidify an alliance with Celestial Dragon King, Evander. I also have to make a new alliance with Wolf Alpha, Deacon. That meeting can either end bloody or amicable. Wolves are a stubborn sort and savage in their quest for more power. This night should prove to be very interesting. Noel: Marco doesn't play, and he's going to make me regret my foolish decision. I should have listened to Derek. I know not to cross the mean bastard now. This night has been so busy: Theoden's ascension, my training, what happened at the bar, and on top of that, I still have a punishment looming over me. I haven't even begun to search for a human to sire. Hell, I don't even know how? Do I just grab some unlucky bastard off the streets and say, \"hey, I'm your new vampire daddy!\" This is so messed up, I don't even want to sire anyone, but I have no choice. Also, because I'm Theoden's son, that makes me a General, which I believe is a higher rank than Enforcer. What that means, exactly, I'm not sure... but I know I'll find out sooner or later. Warning: This serial contains strong adult content not meant for sensitive eyes. The novelettes in this serial will be filled with dark, twisted, raunchy and steamy scenes between powerful, sexy men that will either offend you or get ya revved up. This series will not be pulling any punches, and it won’t apologize for hurting your feelings, either. You’ll find no fluff and ruffles here. The vampires are not misunderstood, hopeless romantics looking for love. The werewolves are not cute and cuddly and the dragons aren’t the ones from your childhood. This is NOT a romance. There are approximately 35200 words in this novelette.",
  "genres": [
    "M M Romance",
    "BDSM",
    "Paranormal",
    "Vampires",
    "Erotica",
    "M M Paranormal",
    "M M M"
  ],
  "author": "Nicholas Bella",
  "average_rating": "4.33",
  "url": "https://www.goodreads.com/book/show/24950085-negotiations"
}