{
  "title": "As Night Falls",
  "description": "From the acclaimed author of Ruin Falls and Cover of Snow comes a breathless new novel of psychological suspense about a dark, twisted turn of events that could shatter a family — a read perfect for fans of Gillian Flynn, Chris Bohjalian, and Nancy Pickard.Sandy Tremont has always tried to give her family everything. But, as the sky darkens over the Adirondacks and a heavy snowfall looms, an escaped murderer with the power to take it all away draws close.In her isolated home in the shadowy woods, Sandy prepares dinner after a fight with her daughter, Ivy. Upstairs, the fifteen-year-old — smart, brave, and with every reason to be angry tonight — keeps her distance from her mother. Sandy's husband, Ben, a wilderness guide, arrives late to find a home simmering with unease.Nearby, two desperate men on the run make their way through the fading light, bloodstained and determined to leave no loose ends or witnesses. After almost twenty years as prison cellmates, they have become a deadly Harlan the muscle, Nick the mind and will. As they approach a secluded house and look through its windows to see a cozy domestic scene, Nick knows that here he will find what he’s looking for ... before he disappears forever.Opening the door to the Tremont home, Nick brings not only a legacy of terror but a secret that threatens to drag Sandy with him into the darkness.Praise for Jenny Milchman\nRuin Falls\n\"Tight and suspenseful ... Milchman has a gift that allows her to delve deep into the mind and psyche of her characters, and fans of dark plots like the works of Gillian Flynn will find another author to savor.\" —RT Book Reviews\"Extreme, heart-pounding action ... essential for psychological thriller fanatics.\" \n—Library Journal\n\"A complex and intriguing tale, adeptly pacing the narrative as danger escalates.\" —Publishers Weekly\nCover of Snow\n\"Everything a great suspense novel should be—tense, emotional, mysterious, and satisfying ... Let's hope this is the start of a long career.\" —Lee Child, #1 New York Times bestselling author of Personal\"An emotional roller-coaster ride through the darkest night, with blinding twists and occasionally fatal turns . . . a richly woven story.\" —Booklist (starred review)\"Milchman tackles small-town angst where evil can simmer under the surface with a breathless energy and a feel for realistic characters.\" —The Seattle Times",
  "genres": [
    "Thriller",
    "Suspense",
    "Mystery",
    "Fiction",
    "Mystery Thriller",
    "Psychological Thriller",
    "Audiobook"
  ],
  "author": "Jenny Milchman",
  "average_rating": "3.66",
  "url": "https://www.goodreads.com/book/show/24962099-as-night-falls"
}