{
  "title": "Kindness Wins",
  "description": "\"An indispensable 21st-century manual of manners written for 21st-century parents and their children. With compassion, humor, insight, and practical wisdom born of firsthand experience, Galit Breen makes a compelling case for online decency. What would happen if parents and kids everywhere could read these 10 simple rules of conduct, learn them by heart, and live by them each and every time they log in? The world would change dramatically--and for the good of us all.\"--Katrina Kenison, author of Mitten Strings for God and The Gift of an Ordinary DayIf kindness wins, accountability rules. The need for this mantra is never clearer than when scrolling through posts and comments online.Approximately four out of ten kids (42 percent) have experienced cyberbullying. When we were young, our bullies weren't usually strangers. They were the kids who passed mean notes about us in class, the ones who didn't let us sit at their table during lunch, and the ones who tripped us in the hallway or embarrassed us in gym class. Cyberbullying isn't all that different from the playground bullying of our youth and nightmares. But with social media, our bullies have nonstop access to us--and our kids. In fact, we're often \"friends\" with our bullies online.When freelance writer Galit Breen's kids hinted that they'd like to post, tweet, and share photos on Instagram, Breen took a look at social media as a mom and as a teacher and quickly realized that there's a ridiculous amount of kindness terrain to teach and explain to kids―and some adults―before letting them loose online. So she took to her pen and wrote a how-to book for parents who are tackling this issue with their kids.Kindness Wins covers ten habits to directly teach kids as they're learning how to be kind online. Each section is written in Breen's trademark parent-to-parent-over-coffee style and concludes with resources for further reading, discussion starters, and bulleted takeaways. She ends the book with two contracts―one to share with peers and one to share with kids. Just like we needed to teach our children how to walk, swim, and throw a ball, we need to teach them how to maneuver kindly online. This book will help you do just that.",
  "genres": [
    "Parenting",
    "Amazon",
    "Nonfiction"
  ],
  "author": "Galit Breen",
  "average_rating": "4.73",
  "url": "https://www.goodreads.com/book/show/24964594-kindness-wins"
}