{
  "title": "Buddies",
  "description": "Four guys have been friends since childhood. As ten-year olds, they had taken an oath of secrecy vowing that no matter what they would never squeal on one another. Though very different personalities, they were tight with one another.  At 30-something, they find themselves living in Manhattan at the same time and plan a reunion of their secret club. Once they have caught up on their lives, they decide to maintain contact with one another to play racquetball. On one occasion at the court they befriend RAUL CABRERA, a handsome and very prosperous Argentinian who is in the import-export business of antiquities and ancient relics.  Raul invites his new buddies and their wives to a party at his luxurious, 5th Avenue penthouse apartment where they meet Raul’s exotic, sensuous, and beguiling Brazilian wife, SASHA. All four buddies are immediately smitten with Sasha and become hypnotized by her beauty and vixen-like appeal.  Sasha begins to play them all independently right from the beginning. First she seduces Roy, followed in succession by Billy, Sam, and Joey. They all fall under her spell as she works them for her own ends. She convinces each of them that she is in love with them, that Raul is a dangerous drug dealer who commands an army of murderous thugs, and that her life is in danger. She wants to leave him but is afraid. Each of the buddies believes that he is special and will do whatever he can to protect her with the expectation that she will go off with him once she divorces Raul.  They are willing to sacrifice their friendships, their marriages, and their careers for the sultry Sasha, each feeling that he is the chosen one. When Raul falls from the balcony of their opulent high-rise apartment at a party he hosted, the buddies become suspects. Through the police investigation that ensues after Raul's death, they learn that Sasha is the kingpin in a drug cartel and they realize that they were all used for her nefarious purposes. The police conclude that Raul was murdered and each of the buddies becomes suspect.",
  "genres": [],
  "author": "Edward A. Dreyfus",
  "average_rating": "3.83",
  "url": "https://www.goodreads.com/book/show/24957625-buddies"
}