{
  "title": "An Obsession with Vengeance",
  "description": "Con il suo fisico imponente, segnato dai tatuaggi e celato sotto i completi di alta sartoria che indossa, Maksim Kirov ottiene sempre ciò che vuole, sia all’interno del club per gentiluomini che gestisce, sia in camera da letto.Dal carisma travolgente, spietato e irriverente, ossessionato dal controllo, spicca come uno degli animi più oscuri dell’entourage del Pakhan, Vasily Tarasov. Da ragazzino quando viveva in Russia, Maksim ha frequentato un’accademia molto particolare: lì ha anche imparato i modi più abili e veloci per uccidere un uomo, nonché le torture più efficaci per spingere un prigioniero a parlare.Una volta giunto negli Stati Uniti al fianco di Vasily, ha scalato i vertici dell’organizzazione criminale dei Tarasov e ora gode del rispetto che si deve a un leader.Le attenzioni femminili non gli sono mai mancate, finché un giorno conosce Sydney Martin e tra i due la chimica è elettrizzante e impossibile da ignorare.Sydney gestisce a sua volta un nightclub poco distante da quello di Maksim e cerca di proteggere non solo la propria privacy e l’attività che porta avanti con passione, ma anche il proprio cuore. Purtroppo finisce per rimanere invischiata in un brutto affare con un cartello della droga messicano, che non le lascia altra scelta se non quella di rivolgersi a Maksim e alla famiglia Tarasov per ottenere aiuto. La soluzione che le viene proposta la lascerà senza fiato: lei e Maksim dovranno fingere di stare insieme agli occhi di tutti, perché essere la donna di Maksim è ciò che la rende inattaccabile. Cedere all’attrazione che scorre fra i due potrebbe salvare entrambi o distruggere le loro vite, insieme allo sconvolgente segreto che Sydney custodisce a costo della sua stessa vita.Amore, lussuria, lealtà e vendetta si scontrano negli inferi malavitosi di New York in questo bruciante terzo volume autoconclusivo della serie “Wanted men”.",
  "genres": [
    "Romance",
    "Contemporary Romance",
    "Contemporary",
    "Romantic Suspense",
    "Crime",
    "Suspense",
    "Mafia Romance"
  ],
  "author": "Nancy Haviland",
  "average_rating": "4.25",
  "url": "https://www.goodreads.com/book/show/24965115-an-obsession-with-vengeance"
}