{
  "title": "The Napoleonic Wars: A Global History",
  "description": "Austerlitz, Wagram, Borodino, Trafalgar, Leipzig, Waterloo: these are the places most closely associated with the Napoleonic Wars. But how did this period of nearly continuous warfare affect the world beyond Europe? The immensity of the fighting waged by France against England, Prussia, Austria, and Russia, and the immediate consequences of the tremors that spread from France as a result, overshadow the profound repercussions that the Napoleonic Wars had throughout the world. In this far-ranging work, Alexander Mikaberidze argues that the Napoleonic Wars can only be fully understood with an international context in mind. France struggled for dominance not only on the plains of Europe but also in the Americas, West and South Africa, Ottoman Empire, Iran, India, Indonesia, the Philippines, Mediterranean Sea, and the Atlantic and Indian Oceans. Taking specific regions in turn, Mikaberidze discusses major political-military events around the world and situates geopolitical decision-making within its long- and short-term contexts. From the British expeditions to Argentina and South Africa to the Franco-Russian maneuvering in the Ottoman Empire, the effects of the French Revolution and Napoleonic Wars would shape international affairs well into the next century. In Egypt, the Wars led to the rise of Mehmed Ali and the emergence of a powerful Egyptian state; in North America, the period transformed and enlarged the newly established United States; and in South America, the Spanish colonial empire witnessed the start of national-liberation movements that ultimately ended imperial control. Skillfully narrated and deeply researched, here at last is the complete global story of the period, one that expands our contemporary view of the Napoleonic Wars and their role in laying the foundations of the modern world.",
  "genres": [
    "History",
    "Nonfiction",
    "War",
    "European History",
    "World History",
    "France",
    "Military History"
  ],
  "author": "Alexander Mikaberidze",
  "average_rating": "4.33",
  "url": "https://www.goodreads.com/book/show/24966135-the-napoleonic-wars"
}