{
  "title": "Secrets Exposed: Tall, Dark and Deadly",
  "description": "A sizzling romantic suspense. Her enemy is her passion, her passion is her enemy.Lindsey Paxton was once the number one defense attorney in New York. She fought for those who were innocent, but charged. Her instincts were her lifeline, never failing her, as they guided her in her choices of who to defend. Or so she thought. Until she won a case she would forever wish to have lost. Her client, an accused rapist, kills and rapes a woman only a day after being set free. Destroyed by her role in the woman's death, Lindsey blames her father's controlling ways for what she has become, and runs from her career and life. Years later - the past becomes the present . . . Her father has cancer, and Lindsey is forced to leave her career with the Washington branch of the FBI. She finds herself facing the responsibility of running her father's law firm with the reluctant help of hotshot attorney Mark Reeves, a man who sparks her temper while also managing to tempt her body, her mind, maybe even her heart. With his help she finds herself fighting the emotional battles of the past, tempted to trust both him and her instincts. Now, faced with a case inherited from her father so similar to her career-ending one, she now must decide if her instincts will lead her down the path to saving an innocent man or setting free another killer. But while she fights her own battles, someone watches, wanting from the past what he had failed to get the first time . . . Lindsey.NOTE: Previously released as Hidden Instincts. Title change to indicate prelude to the new TALL, DARK, AND DEADLY trilogy coming in late 2011. I wrote this in 2004 and it was published by a library publisher and is in hardback in many libraries. You will meet the first Walker Brother-- Royce",
  "genres": [
    "Romance",
    "Romantic Suspense",
    "Suspense",
    "Contemporary Romance",
    "Contemporary",
    "Mystery",
    "Erotica"
  ],
  "author": "Lisa Renee Jones",
  "average_rating": "3.94",
  "url": "https://www.goodreads.com/book/show/24975592-secrets-exposed"
}