{
  "title": "Rock Hard",
  "description": "Shut InTara Smith hates her boss. Miguel Andres is mean, cocky and totally hot. He's had it in for her since day one and she's just about had enough. After a particularly rough day, she ends up alone with him in the office after hours. What will she do when she finds out that he's not what he seems?Three's Not A CrowdCollege student Shannon is home for Spring Break and on her way to have dinner with the couple she used to babysit for. She's surprised to find out that they're not as squeaky clean as they appear. Even more surprising, they want to include her in their kinky sexcapade.At His MercyShe lives to serve her Master. He's everything she's ever wanted in a man and He'd brought out a side of her she never knew existed. He earned her submission and she gladly kneels before Him. Whatever He wants, she gives without question. She is His and He is hers.Daddy's GirlJana loves her Daddy. No, not her father. Her Daddy. When he comes home one night and binds her arms and legs, she knows she's in for a treat.Happy EndingLilly is a successful woman with everything she could ever want. Except one thing - a man. She's still fantasizing about a one night stand from a month ago, when her best friend sets up a special massage appointment for her. She gets quite a surprise when Aiden, the masseuse, shows up.Friend ZonedWhat happens when you find out that your best friend has been in love with you for years? Stefania finds out when Zane finally comes clean.Double TroubleA bar, a couple of drinks, and two Navajo hunks. Olivia gets more than she bargained for when she embarks on her first one night stand.Ace of HeartsDana arrives at the Black Snakes Motorcycle Club clubhouse with one thing in mind - revenge. She thinks she has it all figured out. Ace, the club's President, will suffer for what he did to her. Will her plan work or will it all blow up in her face?18 + for explicit language and sexual situations. Contains 8 erotic short stories. Approximately 21,000 words.",
  "genres": [
    "Romance",
    "Erotica",
    "Short Stories",
    "BDSM",
    "Contemporary",
    "Adult",
    "Anthologies"
  ],
  "author": "Alana Sapphire",
  "average_rating": "3.72",
  "url": "https://www.goodreads.com/book/show/24972140-rock-hard"
}