{
  "title": "After a Good Man Cheats: How to Rebuild Trust & Intimacy With Your Wife: Intimacy After Infidelity",
  "description": "You are a good man who made a bad decision. You were unfaithful in your marriage. You love your wife, and now that you see clearly what your infidelity has done to her, you are incredibly sorry that you have hurt her so much.You want to save your marriage. You don't want to lose your family. I know that you are doing your best to regain your wife's trust, but no matter what you do, you seem to make it worse. She has so many questions about your affair. So. Many. Questions.Not only is your wife furious, but she's also emotionally volatile. Sometimes she seems to love you more deeply than ever, and other times she kicks you out of the house.You are on a roller coaster. You want your marriage back, but you're not sure how to help your wife trust you again and move forward. She doesn't know what she wants, and her volatility exhausts and upsets you. You both are stuck.My name is Caroline Madden. I've been a licensed marriage and family therapist in Los Angeles for over a decade. I have helped countless couples restore their marriages after infidelity.I've seen women just like your wife go through the whole process--from uncovering their husbands' affair to making it to the other side, heart healed and marriage restored. I have heard their innermost thoughts and concerns as they try to process their husbands' betrayal. I know what specific stages your wife will experience. I know what prevents women from moving forward, and I know what women need in order to trust and forgive.Most importantly, I know the things men say and do that they think are helpful but that actually make things worse.This book is a practical action plan that will walk you through the first stages after your wife has discovered your infidelity. Learn the tools to fix your marriage. Avoid the (sometimes fatal) mistakes I've seen so many men make.In this book, you'll learn the things your wife is going to feel, say, and do, giving you the * Insight into what she is thinking and why this is so hard for her to get over* Practical advice so you know exactly what to do at this important stage* Actual scripts so you know what to say in response to very specific situations* Clear explanations as to why certain words and actions you think will be helpful might be making this worse* Two self-administered quizzes to help you determine why you cheated so that you can get a better understanding of what triggered your affair.Included at the appropriate points are scripts of what to say and why you need to say those words at that time. You will want to translate the scripts into your own natural wording, using the meaning of each script as a launching pad for productive, healing dialogue with your wife.Also, other these other questions are * She doesn't know. I feel guilty. Should I tell her the truth?* We aren't married yet? How does that impact recovering from the affair?* I didn't have a physical relationship with my Affair Partner, why is my wife so upset?* What is an Emotional Affair?This is the most important time for you to get things right, because your wife is actively deciding at this stage whether or not she wants to stay with you. Buy \"After a Good Man Cheats\" today.",
  "genres": [],
  "author": "Caroline Madden",
  "average_rating": "3.83",
  "url": "https://www.goodreads.com/book/show/24974586-after-a-good-man-cheats"
}