{
  "title": "The Natural History of Make-Believe: A Guide to the Principal Works of Britain, Europe, and America",
  "description": "The Man in the Moon has dropped down to earth for a visit. Over the hedge, a rabbit in trousers is having a pipe with his evening paper. Elsewhere, Alice is passing through a looking glass, Dorothy riding a tornado to Oz, and Jack climbing a beanstalk to heaven. To enter the world ofchildren's literature is to journey to a realm where the miraculous and the mundane exist side by side, a world that is at once recognizable and real--and enchanted.Many books have probed the myths and meanings of children's stories, but Goldthwaite's Natural History is the first exclusively to survey the magic that lies at the heart of the literature. From the dish that ran away with the spoon to the antics of Brer Rabbit and Dr. Seuss's Cat in the Hat, Goldthwaite celebrates the craft, the invention, and the inspired silliness that fix these tales in our minds from childhood and leave us in a state of wondering to know how these things can be. Covering the three centuries from the fairy tales of Charles Perrault to Maurice Sendak's Where the WildThings Are, he gathers together all the major imaginative works of America, Britain, and Europe to show how the nursery rhyme, the fairy tale, and the beast fable have evolved into modern nonsense verse and fantasy. Throughout, he sheds important new light on such stock characters as the fool andthe fairy godmother and on the sources of authors as diverse as Carlo Collodi, Lewis Carroll, and Beatrix Potter. His bold claims will inspire some readers and outrage others. He hails Pinocchio, for example, as the greatest of all children's books, but he views C.S. Lewis's The Chronicles of Narniaas a parable that is not only murderously misogynistic, but deeply blasphemous as well.Fresh, incisive, and utterly original, this rich literary history will be required reading for anyone who cares about children's books and their enduring influence on how we come to see the world.",
  "genres": [
    "Nonfiction",
    "Literary Criticism",
    "Literature",
    "Books About Books"
  ],
  "author": "John Goldthwaite",
  "average_rating": "3.55",
  "url": "https://www.goodreads.com/book/show/2497753.The_Natural_History_of_Make_Believe"
}