{
  "title": "Detroit 67: The Year That Changed Soul",
  "description": "The Epic Story of Motown and Detroit's Independent Soul Music Scene It’s January 1967—and one of the worst snowstorms in decades is blanketing Detroit, Michigan. Berry Gordy, owner of Motown Records, is trapped in his home, unable to do anything about the internal war ravaging his most successful group, The Supremes. Diana Ross, Mary Wilson, and Florence Ballard are imploding as Ballard battles alcoholism and the aftermath of rape. But soon, even more chaos will descend on Detroit. As the year heats up, melting the snow, Gordy and his city face one of the most challenging periods of its existence.Detroit 67 is the story of Detroit in the year that changed everything. Twelve monthly chapters take you on a turbulent year long journey through the drama and chaos that ripped through the city in 1967. Over a dramatic 12-month period, the Motor City was torn apart by personal, political and inter-racial disputes. It is the story of Motown, the breakup of The Supremes and the implosion of the most successful African-American music label ever.Set against a backdrop of urban riots, escalating war in Vietnam and police corruption, the book weaves its way through a year when soul music came of age, and the underground counterculture flourished. LSD arrived in the city with hallucinogenic power and local guitar-band MC5 -self-styled \"holy barbarians\" of rock went to war with mainstream America. A summer of street-level rebellion turned Detroit into one of the most notorious cities on earth, known for its unique creativity, its unpredictability and self-lacerating crime rates.1967 ended in social meltdown, personal bitterness and intense legal warfare as the complex threads that held Detroit together finally unraveled. Detroit 67 is the story of the year that changed everything.",
  "genres": [
    "Music",
    "Nonfiction",
    "History",
    "20th Century",
    "Race",
    "Biography",
    "Research"
  ],
  "author": "Stuart Cosgrove",
  "average_rating": "4.14",
  "url": "https://www.goodreads.com/book/show/24977591-detroit-67"
}