{
  "title": "Innocent Ride",
  "description": "***Although best read in order, each book of the Hellions Ride series can be read as a stand alone novel.***  She is a corporate accountant. Her life is full of structure, routine, and organization. Settled, comfortable, and content, Caroline Milton loves knowing what to expect every minute of every day. More importantly, she loves knowing her life is what she pictures it to be and not what she came from.  He is the Catawba Hellions VP and a wild one, refusing to be tamed. His motto—'hit it, get it, and go; no repeats' where women are concerned—guarantees a new woman in his bed nightly. His life, though, suddenly tilts on its axis when his wild days come barreling back with a major responsibility. Suddenly, Drexel 'Rex' Crews finds he has a real reason to settle down.  When a situation quickly spins out of control at work for Caroline, she reaches out to the one group she least expected to find herself dependent upon—the Hellions Motorcycle Club. Asked as a personal favor from Doll to protect her best friend, Rex can't refuse. Protecting Caroline was supposed to be an innocent task. However, the attraction from their first meeting is a fire burning strong inside of them both. Neither can deny the pull, despite the fact that they come from different worlds.  Can Rex show Caroline the safety and security of the MC? Can Caroline tame the wild beast inside of Rex? Can their innocent ride become a journey to long lasting love?    *Intended for mature audiences only* This series contains strong language, strong sexual situations, and violence. Please do not buy if any of this offends you.  This is not meant to be a true or exact depiction of a motorcycle club, rather a work of fiction meant to entertain.",
  "genres": [
    "Romance",
    "Audiobook",
    "Contemporary",
    "Motorcycle",
    "Contemporary Romance",
    "Adult",
    "Fiction"
  ],
  "author": "Chelsea Camaron",
  "average_rating": "4.20",
  "url": "https://www.goodreads.com/book/show/24981550-innocent-ride"
}