{
  "title": "Fratelli d'Italia",
  "description": "Fratelli d'Italia nacque come uno sfrenato «viaggio in Italia» degli anni Sessanta, uno smisurato Grand Tour di ventenni on the road. Quando fu pubblicato nel 1963, era un romanzo di avventure intellettuali e picaresche attraverso le follie del boom economico e le metamorfosi della società e del paesaggio, delle illusioni e dei caratteri. Oggi, reinventato, ci viene incontro come l'opera «totale» di una vita. Così rinasce tutto nuovo questo libro irriverente e imponente, che racconta l'Italia di allora e di oggi più di qualsiasi summa, con l'estro insolente di un autore che ha saputo infondere nella lingua e nella letteratura italiana una leggerezza e una mobilità senza precedenti. Comico ed enciclopedico, spettacolare, efferato, divertentissimo, questo romanzo di formazione, di conversazione e di idee si presenta anche come una ricapitolazione allucinatoria del Novecento europeo: pieno di figure storiche e personaggi reali, di scoperte e polemiche, di peripezie mondane e aneddoti autentici e battute pazzesche. Notti senza fine di giovani che discutono dei loro autori e dei loro amori fino all'alba, progettando grandi opere-sogno letterarie e teatrali e musicali vere o immaginarie o fantastiche. Affetti e utopie e irrisioni e rivolte contro un oppressivo establishment culturale e politico. Ma anche la verve della café society, quando Roma era una capitale cosmopolita e «passavano tutti di qui», e le donne erano «molto più belle e più intelligenti e spiritose e anche più alte degli uomini corrispondenti». E che cosa significa aver vent'anni e molti desideri, nell'Italia di Petronio, di D'Annunzio e di sempre… Sul fondo, mercuriale e struggente, ironicamente nascosto nel proliferare delle trame, un timbro che non si lascia dimenticare, quello di «un gelido orgoglioso disperato romanticismo intellettuale».",
  "genres": [
    "Fiction",
    "Italian Literature"
  ],
  "author": "Alberto Arbasino",
  "average_rating": "3.81",
  "url": "https://www.goodreads.com/book/show/2498089.Fratelli_d_Italia"
}