{
  "title": "Rough Around the Edges",
  "description": "Tales from The Edge series: The Edge is a training company with a difference. Its weekend clients come for classes in bondage and domination, not team building and problem solving.The management, staff and customers of The Edge do not lead boring lives. In fact they have a habit of getting themselves into all kinds of trouble. Put Dominant, possessive alpha males together with bratty, loveable submissives and sparks are bound to fly. These Tales from The Edge are their stories. Rough Around the Edges by L.M. Somerton Book Five in the Tales from The Edge seriesCan a new beginning be found in leather and chains?Kai Smithson’s life changes dramatically with his first glimpse into the world of BDSM. Completely innocent, Kai can hardly believe his eyes, but he knows what he likes and apparently that’s hot, dominant men in leather. He isn’t sure if he’s a submissive because he doesn’t really know what that means, but the feelings he is experiencing are exciting and new.Harry Croft, bar manager at The Underground BDSM Club, believes in insta-lust rather than love at first sight. And when he agrees to train Kai, the contract between them has one condition—no sex. But Kai has some very definite plans about losing his virginity and a piece of paper is not going to stand in his way. In his new friends at the club and at The Edge, Kai has a ready-made support group of subs that show him that the only rules in a D/s relationship are those he wants to make for himself.The old saying that you can choose your friends but not your family is proved horribly true for Kai, as the mysteries of his past are revealed. As he and Harry start out on their journey together, they must contend with bullets as well as bondage, danger alongside domination, and it’s not easy to establish trust when the whole world is going to hell.L.M. Somerton About the Author:  Lucinda lives in a small village in the English countryside, surrounded by rolling hills, cows and sheep. She started writing to fill time between jobs and is now firmly and unashamedly addicted.She loves the English weather, especially the rain, and adores a thunderstorm. She loves good food, warm company and a crackling fire. She's fascinated by the psychology of relationships, especially between men, and her stories contain some subtle (and some not so subtle) leanings towards BDSM.",
  "genres": [
    "BDSM",
    "M M Romance",
    "Romance",
    "Suspense"
  ],
  "author": "L.M. Somerton",
  "average_rating": "4.09",
  "url": "https://www.goodreads.com/book/show/24978506-rough-around-the-edges"
}