{
  "title": "The Final Temptation",
  "description": "KAYLA~ He moved in next door to me, all bronzed skin and lean muscle, with a panty dropping smile that could make any girl weep with need. He set my body and teenage hormones on fire for three years. THREE LONG YEARS. In that time he became a cop- Officer Sexy as I liked to call him- and every time I pushed, he retreated. But I knew he felt it, I saw it in the way he looked at me. So one night I set my plan in motion and upped my game. I finally reeled the sexy bastard in, and he didn’t know what hit him.COOPER~ She tempted me with her smart mouth and tight body for three painful years. I took an oath to uphold the law and honor it, which she made almost impossible not to break. But when the day finally came, I made her pay, every beautiful inch of her. She might drive me crazy and be the biggest pain in the ass, but she’s my pain in the ass. And I’ll spend everyday for the rest of my life making sure she never forgets who she belongs to.***You asked for our story and now we are going to give it to you. Cooper and I are not only going to share our special day with you, but we are going to take you back to a time that was frustrating, sexy, explosive and downright beautiful. Here is our story, from beginning to… forever.This is a Novella with an HEA and is told in dual POV. It is the last book to the Men Of Honor Series. Although you don’t have to read every book in the series, I strongly recommend that the first book, Fighting Temptation, should be read prior to Kayla and Cooper’s story in order to understand many aspects of this book.WARNING~ Due to mature subject matter, such as explicit sexual situations and coarse language, this story is not suitable for anyone under the age of eighteen.",
  "genres": [
    "Romance",
    "Novella",
    "Contemporary Romance",
    "New Adult",
    "Military Fiction",
    "Contemporary",
    "Audiobook"
  ],
  "author": "K.C. Lynn",
  "average_rating": "4.34",
  "url": "https://www.goodreads.com/book/show/24976627-the-final-temptation"
}