{
  "title": "Alabi's World",
  "description": "Winner of the Gordon K. Lewis Memorial Award for Caribbean Scholarship from the Caribbean Studies AssociationWinner of the J.I. Staley Prize for Excellence in Anthropology from the School of American ResearchWinner of the Albert J. Beveridge Award from the American Historical AssociationIn the early 18th century, the Dutch colony of Suriname was the envy of all others in the Americas. There, seven hundred Europeans lived off the labor of over four thousand enslaved Africans. Owned by men hell-bent for quick prosperity, the rich plantations on the Suriname river became known for their heights of planter comfort and opulence--and for their depths of slave misery. Slaves who tried to escape were hunted by the planter militia. If found they were publicly tortured. (A common punishment was for the Achilles tendon to be removed for a first offense, the right leg amputated for a second.) Resisting this cruelty first in small numbers, then in an ever increasing torrent, slaves began to form outlaw communities until nearly one out of every ten Africans in Suriname was helping to build rebel villages in the jungle.Alabi's World relates the history of a nation founded by escaped slaves deep in the Latin American rain forest. It tells of the black men and women's bloody battles for independence, their uneasy truce with the colonial government, and the attempt of their great leader, Alabi, to reconcile his people with white law and a white God. In a unique historical experiment, Richard Price presents this history by weaving together four voices: the vivid historical accounts related by the slaves' descendants, largely those of Alabi's own villagers, the Saramaka; the reports of the often exasperated colonial officials sent to control the slave communities; the otherworldly diaries of the German Moravian missionaries determined to convert the heathen masses; and the historian's own, mediating voice.The Saramaka voices in these pages recall a world of powerful spirits--called obia's--and renowned heroes, great celebrations and fierce blood-feuds. They also recall, with unconcealed relish, successes in confounding the colonial officials and in bending the treaty to the benefit of their own people. From the opposite side of the negotiations, the colonial Postholders speak of the futility of trying to hold the village leaders to their vow to return any further runaway slaves. Equally frustrated, the Moravian missionaries describe the rigors of their proselytising efforts in the black villages--places of licentiousness and idol-worship that seemed to be a foretaste of what hell must be like. Among their only zealous converts was Alabi, who stood nearly alone in his attempts to bridge the cultural gap between black and white--defiantly working to lead his people on the path toward harmony with their former enemies.From the confluence of these voices--set throughout the book in four different typefaces--Price creates a fully nuanced portrait of the collision of cultures. It is a confrontation, he suggests, that was enacted thousands of times across the slaveholding Americas as white men strained to suppress black culture and blacks resisted-- determined to preserve their heritage and beliefs.",
  "genres": [
    "History"
  ],
  "author": "Richard           Price",
  "average_rating": "3.28",
  "url": "https://www.goodreads.com/book/show/249945.Alabi_s_World"
}