{
  "title": "Schooled",
  "description": "\"By turns dishy, delightful, and hilarious, Anisha Lakhani's debut novel is also a biting teach and tell. Required reading!\"--Claire Cook, author of Summer Blowout, Life's a Beach , and Must Love Dogs \"Schooled isn't only a novel. . . It's a piece of sociology\"-- The Wall Street Journal \"Sharply observed debut\"-- People Magazine \"Witty, entertaining, and all together tantalizing\"-- Town & Country \"Biting teach and tell debut\"-- Redbook Magazine \"Utterly terrifying and delicious. I inhaled this novel in hours\"--Jane Green \"Schooled easily finds itself to the head of the class\"-- Miami Herald \"You're making how much an hour\"\"Two hundred dollars.\"\"Do you ride in on a pony\" All she wants to do is teach. For Anna Taggert, an earnest Ivy League graduate, pursuing her passion as a teacher means engaging young hearts and minds. She longs to be in a place where she can be her best self, and give that best to her students. Turns out it isn't that easy. Landing a job at an elite private school in Manhattan, Anna finds her dreams of chalk boards and lesson plans replaced with board families, learning specialists, and benefit-planning mothers. Not to mention the grim realities of her small paycheck. And then comes the realization that the papers she grades are not the work of her students, but of their high-priced, college-educated tutors. After uncovering this underground economy where a teacher can make the same hourly rate as a Manhattan attorney, Anna herself is seduced by lucrative offers--one after another. Teacher by day, tutor by night, she starts to sample the good life her students binges at Barneys, dinners at the Waverly Inn, and a new address on Madison Avenue. Until, that is, the truth sets in.",
  "genres": [
    "Fiction",
    "Chick Lit",
    "Education",
    "New York",
    "Adult",
    "Adult Fiction",
    "Contemporary"
  ],
  "author": "Anisha Lakhani",
  "average_rating": "3.38",
  "url": "https://www.goodreads.com/book/show/2498975.Schooled"
}