{
  "title": "Eminent Outlaws: The Gay Writers Who Changed America",
  "description": "\"Fascinating...fun to read and will be the standard text of the defining era of gay literati.\" -- Philadelphia InquirerIn the years following World War II a group of gay writers established themselves as major cultural figures in American life. Truman Capote, the enfant terrible, whose finely wrought fiction and nonfiction captured the nation's imagination. Gore Vidal, the wry, withering chronicler of politics, sex, and history. Tennessee Williams, whose powerful plays rocketed him to the top of the American theater. James Baldwin, the harrowingly perceptive novelist and social critic. Christopher Isherwood, the English novelist who became a thoroughly American novelist. And the exuberant Allen Ginsberg, whose poetry defied censorship and exploded minds. Together, their writing introduced America to gay experience and sensibility, and changed our literary culture.But the change was only beginning. A new generation of gay writers followed, taking more risks and writing about their sexuality more openly. Edward Albee brought his prickly iconoclasm to the American theater. Edmund White laid bare his own life in stylized, autobiographical works. Armistead Maupin wove a rich tapestry of the counterculture, queer and straight. Mart Crowley brought gay men's lives out of the closet and onto the stage. And Tony Kushner took them beyond the stage, to the center of American ideas.With authority and humor, Christopher Bram weaves these men's ambitions, affairs, feuds, loves, and appetites into a single sweeping narrative. Chronicling over fifty years of momentous change-from civil rights to Stonewall to AIDS and beyond.Eminent Outlaws is an inspiring, illuminating one that reveals how the lives of these men are crucial to understanding the social and cultural history of the American twentieth century.",
  "genres": [
    "Nonfiction",
    "History",
    "LGBT",
    "Queer",
    "Biography",
    "Gay",
    "Literary Criticism"
  ],
  "author": "Christopher Bram",
  "average_rating": "4.11",
  "url": "https://www.goodreads.com/book/show/11515362-eminent-outlaws"
}