{
  "title": "Hit Me, Fred: Recollections of a Sideman",
  "description": "With Hit Me, Fred , sensational sideman Fred Wesley Jr. moves front and center to tell his life story. A legendary funk, soul, and jazz musician, Wesley is best known for his work in the late sixties and early seventies with James Brown and as the leader of Brown’s band, Fred Wesley and the JB’s. Having been the band’s music director, arranger, trombone player, and frequent composer, Wesley is one of the original architects of funk music. He describes what it was like working for the Godfather of Soul, revealing the struggle and sometimes stringent discipline behind Brown’s tight, raucous tunes. After leaving Brown and the JB’s, Wesley arranged the horn sections for Parliament, Funkadelic, and Bootsy’s Rubber Band, and led Fred Wesley and the Horny Horns. Adding his signature horn arrangements to the P-Funk mix, Wesley made funk music even funkier.Wesley’s distinctive sound reverberates through rap and hip-hop music today. In Hit Me, Fred , he recalls the many musicians whose influence he absorbed, beginning with his grandmother and father—both music teachers—and including mentors in his southern Alabama hometown and members of the Army band. In addition to the skills he developed working with James Brown, George Clinton, Bootsy Collins, and the many talented musicians in their milieu, Wesley describes the evolution of his trombone playing through stints with the Ike and Tina Turner Revue, Hank Ballard, and Count Basie’s band. He also recounts his education in the music business, particularly through his work in Los Angeles recording sessions.Wesley is a virtuoso storyteller, whether he's describing the electric rush of performances when the whole band is in the groove, the difficulties of trying to make a living as a rhythm and blues musician, or the frustrations often felt by sidemen. Hit Me, Fred is Wesley’s story of music-making in all its grit and glory.",
  "genres": [
    "Music",
    "Nonfiction",
    "Biography"
  ],
  "author": "Fred Wesley",
  "average_rating": "4.05",
  "url": "https://www.goodreads.com/book/show/250023.Hit_Me_Fred"
}