{
  "title": "The Beginning of the End",
  "description": "This book is the original first edition of the Dystopia series. It has since been updated with a new cover and content. Wishing to maintain the original first edition, the author chose to leave this copy for those who may wish to see it in its original first edition state.  Follow the action as Destiny & Matt, along with their small group, struggle to maintain some semblance of routine while the world around them spirals into chaos. With limited resources, some knowledge and skills they find that they are somewhat removed from the worst of things. Our group manages through each day until the world’s troubles come to their very home and it is soon apparent that they must adapt and improvise. Watch as they make do and work together to reconcile the reality of this new life. Working together with ingenuity and compromise they begin to overcome many threats that challenge their very survival. It soon becomes apparent that something just doesn’t fit about the Ebola and Isis news. When the financial crisis grinds society to a halt and changes their way of life, they find themselves at the heart of a war they did not intend and an unlikely enemy bent on their destruction. Enjoy their humor as they bring a lighthearted perspective to a very dark time. D. J. Cooper's first novel and the first book in the Dystopia series offers a different view of things that could be, how these events could shape what might be and give hope for what can be. Written for those of us who are somewhat prepared to handle what may come but are like most of us who just make it day to day, they do not have unlimited resources or knowledge and improvise as each challenge arises. A story of today, in our current world of uncertainty, anything could go wrong and bring our way of life to an end.",
  "genres": [
    "Post Apocalyptic"
  ],
  "author": "D.J. Cooper",
  "average_rating": "4.30",
  "url": "https://www.goodreads.com/book/show/25001285-the-beginning-of-the-end"
}