{
  "title": "Lincoln's Billy",
  "description": "Abraham Lincoln trusted and confided in his law partner William \"Billy\" Herndon, but his still-influential 1889 biography was censored by his collaborator and publisher. In Lincoln's Billy, Tom LeClair imagines Herndon's deathbed \"autobiography\" and \"real life\" of his partner, revealing secrets about a randy and \"rasslin\" Lincoln on his youthful trips to New Orleans, the hidden sources of his suicidal depressions, and the untold cause of his hatred of slavery.Based on the latest biographical research, the novel presents a vulgar tale-telling Lincoln unknown to most Americans and a radical truth-telling Herndon who was more advanced - and more contemporary - than the President on public education, women's rights and, most importantly, slavery. The abolitionist and free-thinking Billy contends with his beloved partner for sixteen years, and after the assassination, conflicts with Lincoln's family, other biographers, Christian fundamentalists, corrupt Republican politicians, robber barons and Victorian propriety as he struggles to write his unconventionally frank biography. As strong-willed as the two men are the novel's women: the ambitious, emotionally volatile and, finally, mentally ill Mary Todd Lincoln and Herndon's two wives - Mary Maxcy, an active intellectual helpmeet despite being the mother of six, and Anna Miles, a Democrat, Presbyterian and slavery sympathizer with whom Billy argues issues of the day. Like the story of Lincoln's life and autobiographies by Franklin, Douglass, and Henry Adams, Lincoln's Billy is a classic American tale of failure, resistance, persistence, and hard-won success.The author of five novels with contemporary settings, Tom LeClair throws two vivid historical voices in Lincoln's Billy: Abe's \"Kaintuck\" vernacular and Billy's lawyerly rhetoric as the two attorneys duel over biographical truth and historical fictions. By the end of this novel about friendship, loyalty and betrayal, readers will wonder id they should believe Honest Abe or Trustworthy Billy.",
  "genres": [
    "Historical Fiction",
    "Fiction"
  ],
  "author": "Tom LeClair",
  "average_rating": "3.88",
  "url": "https://www.goodreads.com/book/show/25003044-lincoln-s-billy"
}