{
  "title": "The Best of Spanish Steampunk",
  "description": "The Best of Spanish Steampunk features stories from Spain, Mexico, Venezuela and Chile, as well as from writers in Spanish living in Germany, Dubai and the UK. They are authors who write from the margins, using Steampunk to investigate themes such as the ethical questions posed by scientific and technical developments in our globalised culture of rapid change, and how that leaves countries not from the dominant culture behind. Through Steampunk these authors are offering alternative retellings of their countries’ histories, “critically” reimagining key moments such as the North-American-Spanish Cuban war, the Mexican war, or the Anarchist revolts of the 1930s in Andalusia. They are also attracted to a genre that foreshadows our actual economic problems, high unemployment levels, and frustration with increasing social inequality.  But alternative histories, dystopia and ‘punk’ are not the only focus. Steampunk in Spanish is overshadowed by the ever-present influence of Victoriana. Issues of identity, both cultural and social are posed by this collection of stories, highlighting the ongoing search for a Steam identity, with classical gaslight romance set in nineteenth-century England, or airship fights directly influenced by Michael Moorcock. Still, stories set in Asturias, Cataluña, Andalusia, or the Imperial reign of Felipe II are high points in a collection of stories that finds a place for itself in the ever-growing world of multicultural Steampunk, while sharing an engagement with the steampunk canon that, ultimately, moves them beyond their chosen setting.  Steampunk offers an invaluable opportunity to re-evaluate our world, and the choices we have made that have brought us to the positions we are facing today. Steampunk is a canvas on which to re-imagine what could have been, and show us what we could become.  STORIES BY: Alfredo Álamo • Javi Argauz • Javier Calvo • Jesús Cañadas • Gloria T. Dauden • Francisco Miguel Espinosa • Santiago Eximeno • Cano Farragute • Laura Fernández • Rafael González • Luis Guallar • Isabel Hierro • Jorge Jaramillo • Cristina Jurado • Sergio Lifante • Ismael Manzanares • Rafael Marín • Oscar Mariscal • José Ángel Menédez Lucas • José María Merino • Pedro Moscatel • Oscar Navas • Félix J. Palma • Santi Pagés • Francisco J. Pérez • Paulo César Ramírez • Josué Ramos • Joseph Remesar • Sofía Rhei • Rocío Rincón • Paula Rivera • Leonardo Ropero • Luis Manuel Ruiz • Noemí Sabugal • Rubén Sánchez Trigos • Ángel Luis Sucasas • Rocío Tizón • Eduardo Vaquerizo • Marian Womack • Guillermo Zapata",
  "genres": [
    "Steampunk",
    "Anthologies",
    "Fiction",
    "Fantasy",
    "Science Fiction Fantasy"
  ],
  "author": "James Womack",
  "average_rating": "3.81",
  "url": "https://www.goodreads.com/book/show/24999375-the-best-of-spanish-steampunk"
}