{
  "title": "Max",
  "description": "Max...I’ve got my looks, my charm, and well, a smile that melts panties. My charm only gets me so far though. Apparently, that limit is the law.I don’t even care when the courts finally give me a punishment for vandalising the church property; in my defence, I didn’t know it was a church.They’ve got me serving three months of community service working at the local church’s Salvation shelter.They think three months here will change me; that I will change my delinquent ways. If only they knew... nothing could ever tame me.I was taught at an early age that love destroys you. I accept that I’ll never love and I’ll never be loved.What I’ve learned though is that love is also your greatest weakness; it’s why that one four letter word will never leave my mouth.I’m Lake Miller...For the past year of my life I’ve never stayed anywhere longer than a few weeks. I’d sleep at different homeless shelters, park benches or anywhere I could find a dry place to sleep; the only belongings I have are carried in my backpack. I left everything else behind.Now I’ve ended up in Coldenshire; tired of sleeping on the streets, tired of hurting and tired of eating scraps of food.So when a chance encounter for a job at the local church shelter popped up, I took it. I know my time here is running out and that I should run, especially when the town bad boy, who is sexy as sin and annoying as hell, walks through the doors thinking he’s God’s gift to women.He thinks life is a joke, that his smart mouth hides the pain behind his eyes, but he’s so off track I’m surprised he’s not lost.I see the real him, and I don’t want anything to do with him, but he makes it hard when he’s always in my face. I have my own pain, my own loss and grief to suffer through; I don’t need anyone else’s.I don’t need anything.Not love, not sympathy, and certainly not forgiveness, after all, I killed my brother.I’m a murderer.",
  "genres": [
    "Romance",
    "New Adult",
    "Contemporary Romance",
    "Contemporary",
    "Young Adult",
    "High School",
    "Humor"
  ],
  "author": "Lisa Helen Gray",
  "average_rating": "4.42",
  "url": "https://www.goodreads.com/book/show/25002934-max"
}