{
  "title": "I Am Your Doctor: And This Is My Humble Opinion",
  "description": "What is it like to be your primary care physician? How do day-to-day pressures, concerns and unfolding developments impact the one who looks after your health and wellbeing? What does your doctor feel about the responsibilities and nagging questions that are an integral part of every waking hour? What is it like to know that each routine decision is potentially life-altering to your care? Who cares about your future medical care? Jordan Grumet's writing builds an insider's level of understanding. His unique delivery is simple and eloquently succinct. His potential audience is at a critical juncture in medical-political development, particularly in the United States, and his impactful prose is already vitally felt by a growing number of readers. The timing is optimal for Jordan's writing to be published as a widely accessible collection of stories and essays.Reverent dedication to quality diagnostic care permeates his writing and motivates Jordan to share from the head and heart. Each new essay challenges his readers to think and feel, taking on the varying perspectives of his challenging, endearing and beloved patients, and of family members of the ill or dying. Jordan's words deepen our understanding of the unwelcome, or sometimes welcome, arrival of Death. Jordan opines from experience, while he illustrates doctor-patient relations; doctor-colleague conduct and cooperation; and the impact that exponentially increasing forms, restrictions, technology and time commitment have on the delivery of quality care to patients. You and I and all of those in the medical system feel the impact of this government- and insurance-driven regulatory environment. More and more physicians are shutting down, opting out or simply struggling to juggle the burden of imposed digital and paper requirements, while their expertise is in medicine. Quality medical care, based on face-to-face doctor-patient relationship building, is lagging as a result. Jordan Grumet delivers this news powerfully and persuasively. His ability to do so is both timely and important. Married with two children, he sometimes includes family members in descriptions of his daily life and medical practice. In one essay, Jordan relates how his son's birth reawakens a depth of feeling that he previously guarded tightly as protection from the emotional impact of his work. In story after short story, Jordan reveals to us just how he is able to channel a full range of emotions, healthily and consciously, into his daily interactions. To whom does Jordan's writing appeal? Doctors, nurses and ancillary support workers all relate strongly to his descriptions of the front lines of medical care. Lay people who care about the future of their own medical needs, and all who've felt the benefits of kindly delivered care, resonate with his words. These various reading audiences either nod knowingly, based on their own similar experiences, or burst into tears as they \"get it\" that a physician is called to devote such an ample measure of body, heart and soul to their compassionate care. Humility. Naked self-assessment. Doubt. Surety. Wonder. Devotion. A peek inside.",
  "genres": [
    "Medical"
  ],
  "author": "Jordan Grumet",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/25004701-i-am-your-doctor"
}