{
  "title": "It's Not Harder Than Cancer: The Mindsets You Need to Survive and Thrive After Serious Illness",
  "description": "I am a survivor.Truth is, I seriously dislike that word. While it accurately describes coming out alive after a cancer experience, it is wholly inadequate. “Survivor” does not capture what it means to hear the words \"you have cancer,\" or what it's like to have your rear end radiated to the point of blistering, or your body altered by surgery, or the physiological impact of steroids and poisonous chemicals administered week after week and month after month. “Survivor” also misses the psychological impact of the fear of death that arrives immediately upon diagnosis and the stress of recalibrating your entire life around treatment of the disease. For many of us, we come through the cancer experience with more than a touch of post-traumatic stress disorder.We use the word “survivor” in the cancer community because it's quick shorthand to count the number of people who have lived past their diagnosis and treatment. In truth, that's all the word “survivor” is good for.During my cancer experience, the members of my patient support group and I tried to come up with an alternate word. \"Warrior\" comes close, if you believe cancer is a battle and patients are fighting it. If you don't subscribe to the warlike imagery often used in describing cancer experiences, \"warrior\" definitely falls short.In my life after cancer, I've come to prefer the term \"thriver.\"My life after cancer is thriving. I've had adventures I never I participated in a tandem obstacle course race. I jumped into a startlingly cold river to celebrate the New Year. I became a gym owner. I preached in church. I went to the beach with my wife for the best vacation ever. I became a motivational speaker. And now I've written this book.In short, life is amazing.While it has become fashionable to say \"cancer was a gift\" or \"cancer is the best thing that ever happened to me,\" I don't hold to that. If cancer was a gift, I'd return it to wherever in hell it came from. Rather, I believe having cancer enabled good things to happen. I value gratitude and love more than I ever have. I appreciate all of the amazing people in my life and do my best to not take for granted their presence in my life. I understand that caregivers are intensely undervalued.I learned a lot during my cancer experience, which is why I wrote this book. I also wrote this book because when I went in search of books about colorectal cancer experiences, there were very few on the market. There are a lot of breast-cancer-specific books, however -- no offense to my sister survivors. Which brings me to another reason I wrote this very few books about personal cancer experiences are written by men. I felt the need to add my voice for that reason alone. Finally, the few books that do exist about colorectal cancer tend to be blow-by-blow tales of each author's cancer experience. That's not the story I wanted to tell.Rather, I wanted to tell my story from the perspective of the mental attitudes it takes to survive and thrive after cancer. This is not a how-to book, though. I cannot give you the \"three strategies you need to maintain a positive attitude during your illness.\" Honestly, much of what I write about comes to me naturally. Some I learned along the way, from great authors and from friends whose lives reflect the mindsets about which I write. Some of the mindsets, like being grateful in the face of difficulty and letting go of unnecessary emotions and obstacles, still take practice. In this book, I frame the mindsets around my story and how each of them worked for me.While I cannot give you the \"formula\" for surviving and thriving, most chapters end with a Mindset Exercise, a simple exercise designed to help you think about how you can use each mindset in your own experience.The title of this book comes directly from my response to some of the challenging but wonderful things I've done in the months and years since I finished treatment. Speak onstage about",
  "genres": [],
  "author": "Michael  Holtz",
  "average_rating": "4.45",
  "url": "https://www.goodreads.com/book/show/25003410-it-s-not-harder-than-cancer"
}