{
  "title": "خلف أسوار الحرملك",
  "description": "الناشر:عندما تتحول المرأة إلى \"حرمة\" وتبقى محاصرة في مكان الحريم فإنها إما أن تكون غير مدركة لما هي عليه وغير قادرة على تحليل وضعها فتستسلم له ببساطة أو أن تدرك واقعها فترفضه وتحاول تغييره أو تتذمر منه كحد أدنى يدل على رفضها ذلك، ولكن مناقشة موضوع اضطهاد النساء بأي صورة سيجعل كل من يقول ما لديه ويخالف ما ألفه الناس ذا أهداف خفية ونوايا سيئة في نظر الكثيرين داخل مجتمعنا حتى وإن استشهد بكتاب الله وسنة رسوله، ويظل متهماً بالمؤامرة على المرأة أو داعياً للانحلال والرذيلة، وكأن الإنسان في هذا الوطن ينام ويصحو في رذيلة إلا إذا وقفوا على حراسته ومراقبته. والمنادي بتحرير النساء متهم كما أسلفت بالتآمر أو بالدعوة إلى الرذيلة، وكل متهم مذهب حتى وإن ثبتت براءته. وحتى وإن استشهد بكتاب الله عز وجل. ولكن ها نحن أمام خيارين: أحدهما موقف القرآن الكريم من المرأة وموقف رسول الله صلى الله عليه وسلم من كافة نسائه. أما الثاني فهو موقف التراث الذي يملأ ثقافتنا المكتوبة والشفهية.المؤلف:أحاول في هذا الكتاب أن أسجل ما حدث ويحدث داخل المجتمع النسائي، وأن أتلمس ضمن ما أكتبه الأسباب التي جعلته بالصورة التي هو عليها مضيفة بين صفحاته بعض المواقف التي مررت بها في مجال تعليم البنات والذي عملت فيه عشرين عاماً حتى الآن.. وما دمنا لا نزال نناقش قضية المرأة بينما هي قضية محسومة في الوعي الإنساني خارج مجتمعنا عفا عليها الزمن، فإني أحاول أن أكون موضوعية إلى أقصى درجة أستطيعها. ولعلي بنا أكتبه أكون قد أضأت بعض الأماكن التي وبفعل الأسوار الشاهقة ظلت معتمة وستظل كذلك إلى أن يرى الناس أن للمرأة حق في الحياة لا يقل عن حق الرجل فيها.وبرغم ما يتضمنه الكتاب من وصف للعلاقة بين الرجل والمرأة في مواقف مختلفة إلا أن جل ما تناولته ينصب على وضع النساء القائم. وارى أن وجود عدد من السعوديات اللواتي استطعن الشذوذ عن القاعدة والخروج عن المألوف فتفوقن في مجال من المجالات وتناولهن الإعلام ليثبت من خلالهن تغير وضع المرأة أقول -هن الشذوذ الذي يؤكد القاعدة- حيث إن للعامة أعرافهم وقوانينهم الوصول إلى شهرة معينة أو تفوقت في مجال من المجالات. وإذا درسنا في مجال معين فسنجد أن معظمهن من عائلات تختلف في تعاملها مع المرأة عن المألوف ولا تخضع لكل ما تعرف عليه الناس في بلادنا بخصوص النساء. أضيف إلى هذا وجود بعض التفاوت في التعامل. إذ أن ما تراه قبيلة من القبائل عيباً قد يكون في عرف قبيلة أخرى مقبولاً أو ربما مستحباً. وهذا ما يجعلني أتناول ما هو سائد بشكل أكثر وأتجنب الخوض في عادات خاصة جداً بفئة قليلة من الناس. فإذا قلنا مثلاً إن بعض النساء لا زالت تخفي وجهها عن زوجها ببرقعها داخل منزل الزوجية إلى اليوم -وهذا يحدث فعلاً عند بعض القبائل- أقول: هذا شأن خاص بفئة معينة ولا ينطبق على الأغلبية.. وكما أني قلت إن المتميزات جداً غير معنيات بما سأكتبه هنا، فإن ذوات العادات الخاصة جداً مستثنيات مما سأكتب أيضاً.",
  "genres": [
    "Feminism",
    "Nonfiction"
  ],
  "author": "عائشة عبد العزيز الحشر",
  "average_rating": "3.53",
  "url": "https://www.goodreads.com/book/show/2501261._"
}