{
  "title": "A Crack in the Edge of the World",
  "description": "The international bestselling author of The Professor and the Madman and Krakatoa vividly brings to life the 1906 San Francisco Earthquake that leveled a city symbolic of America's relentless western expansion. Simon Winchester has also fashioned an enthralling and informative informative look at the tumultuous subterranean world that produces earthquakes, the planet's most sudden and destructive force.In the early morning hours of April 18, 1906, San Francisco and a string of towns to its north-northwest and the south-southeast were overcome by an enormous shaking that was compounded by the violent shocks of an earthquake, registering 8.25 on the Richter scale. The quake resulted from a rupture in a part of the San Andreas fault, which lies underneath the earth's surface along the northern coast of California. Lasting little more than a minute, the earthquake wrecked 490 blocks, toppled a total of 25,000 buildings, broke open gas mains, cut off electric power lines throughout the Bay area, and effectively destroyed the gold rush capital that had stood there for a half century.Perhaps more significant than the tremors and rumbling, which affected a swatch of California more than 200 miles long, were the fires that took over the city for three days, leaving chaos and horror in its wake. The human tragedy included the deaths of upwards of 700 people, with more than 250,000 left homeless. It was perhaps the worst natural disaster in the history of the United States.Simon Winchester brings his inimitable storytelling abilities -- as well as his unique understanding of geology -- to this extraordinary event, exploring not only what happened in northern California in 1906 but what we have learned since about the geological underpinnings that caused the earthquake in the first place. But his achievement is even greater: he positions the quake's significance along the earth's geological timeline and shows the effect it had on the rest of twentieth-century California and American history.A Crack in the Edge of the World is the definitive account of the San Francisco earthquake. It is also a fascinating exploration of a legendary event that changed the way we look at the planet on which we live.",
  "genres": [
    "History",
    "Nonfiction",
    "Science",
    "Geology",
    "American History",
    "Audiobook",
    "Nature"
  ],
  "author": "Simon Winchester",
  "average_rating": "3.79",
  "url": "https://www.goodreads.com/book/show/25013.A_Crack_in_the_Edge_of_the_World"
}