{
  "title": "Travesty",
  "description": "'This book is hilarious, quirky and completely out of left field,' said somebody.  From debut author Hayden Bradford comes a rip roaring yarn which could be the funniest book published this year.  'Satire: A Hysterical Australian Comedy about a Bloke Named Travesty' is an unashamedly hilarious tale of a bloke so hard done by in his life, he could only have been born from the imagination of another bloke. His mother named him Travesty as she believed his birth signalled the beginning of one long, drawn out disaster for her. But without warning, Travesty's life comes to an abrupt and ridiculously funny end. He is then delivered to Heaven. How does that happen to an atheist?  Hitch yourself a ride on Travesty's crazy journey on Earth and in Heaven!  'You know when you are sitting alone laughing out loud you have a classic. Great laugh,' said another someone.  The Prophecies of Chapter One: - If Jesus does return, remind him that the Romans did him in; no sense in anyone else taking the rap. - Do not read the Bible to young children. It has scary bits in it. - Do not upset bald men unless you're wearing a bear-protective suit. - If you are in the woors and you happen to see a bald man in a bear-protective suit, keep your wits about you. - The next time you go to church, take your own plate and ask for a donation. - Bald men in the woods should wear hats and put sunscreen on their heads. - If you're enjoying nature by walking in the mountains and you see a bush on fire, trust me, it isn't God. Do the right thing, put it out or call the Fire Brigade. - Just to be sure, before you extinguish the fire, you could ask the bush if it IS God. If God is true, you probably don't want to piss him off with a burst of cold water. - Stupid people are put on Earth to help entertain the rest of us. - Thank God for stupid people.",
  "genres": [],
  "author": "Hayden Bradford",
  "average_rating": "3.30",
  "url": "https://www.goodreads.com/book/show/25022903-travesty"
}