{
  "title": "Paradise City",
  "description": "There's trouble waiting in Paradise.Quiet country-girl Lexie Atkinson is about to get an education she'll never forget. Sent from her family's remote rural property to live in the glittering beachside Paradise City for her final school year, she is plunged into a place where looks can kill and vicious rumours can make or break you. Lexie just wants to fly under the radar...until she meets Luke Ballantine.Impulsive and charming, one thing is Luke is sexier than any guy she has ever known.Suddenly good girl Lexie is breaking all the rules - getting detention, sneaking out to late-night parties, hanging out with boys - and then rumours start swirling...about her! Everything changes fast and Lexie will soon find out if Luke Ballantine is going to be good for her...or very, very bad?A funny, sexy and romantic novel from the bestselling author of the Summer series.'Paradise City is the same brand of feel good, fun and sexy romance that I have come to love from this author' - Book Briefs'I love Duggan's writing and Paradise City was a hoot. I cannot wait for the next book! Is it August yet?' - Reading With ABC'I loved this book - it's the perfect beach read.' - Flying Through Pages'I loved every moment . . . C. J. is a born storyteller that breathes a realism into her characters and situations that we've all found ourselves in.' - Diva Book Nerd'Duggan's writing is addictive, and I really didn't want to put this book down.' - Escape Into Words'Paradise City is going to be on my mind until I can get my greedy eyes on Paradise Road. I need that book yesterday!' - Book Cat Pin'A fast paced fun read with so many steamy situations.' - Dreamy Addictions'Guaranteed her readers will come back for more.' - My Guilty Obsession'Drama, deception, love and a little mystery . . . the ending left me hungry for the next book! I can't wait for Paradise Road!' - Paranormal Tendencies on Goodreads'A bit of Home and Away meets Puberty Blues feel about the novel makes is a great read for older teens and YA. I will be desperately waiting for part 2 in September.' Samantha on Goodreads'Again Ms Duggan had created a winner. Paradise City was a perfect introduction to the series and characters. I was left needing more and it had so much laugh-out-loud fun. This really did have everything from intrigue to addiction, realism of high school antics, steamy sizzles and fast paced readability. I am certainly hooked and desperately want more of all these characters. I highly recommend this to all new adult readers, fan-bloody-tastic!' - Turner's Antics'This is my first taste of Duggan's work and it won't be the last ... It's a story that will have you coming back for more.' - Sassy Book Lovers'convincing and authentic ...",
  "genres": [
    "Romance",
    "New Adult",
    "Contemporary",
    "Young Adult",
    "Chick Lit",
    "Contemporary Romance",
    "Australia"
  ],
  "author": "C.J. Duggan",
  "average_rating": "3.86",
  "url": "https://www.goodreads.com/book/show/25014618-paradise-city"
}