{
  "title": "The Explorer's Code: A Novel",
  "description": "Award-winning CNN journalist Kitty Pilgrim turns her talents to print in The Explorer’s Code, an exciting international thriller that revolves around the quest for a land deed valuable enough to kill for. When the renowned young oceanographer Cordelia Stapleton receives an invitation to accept an award on behalf of her great-great-grandfather, a famous Victorian polar explorer, she has no idea her life is about to change dramatically. John Sinclair—a dashing, wealthy archaeologist and philanthropist—presents Cordelia with the award at the glamorous Oceanographic Institute Ball in Monaco. He also gives her a journal that her greatgreat- grandfather wrote in 1908. An orphan with very few family belongings, Cordelia is amazingly touched to have this precious heirloom. Once the journal is in her possession, Cordelia learns that she is heir to the land on which the Global Seed Vault in Norway sits. The valuable deed for this land, or at least a clue to its whereabouts, may be hidden in the journal. When the journal disappears from Cordelia’s stateroom on the Queen Victoria and Cordelia receives threatening e-mails, it becomes clear that she is in danger. John Sinclair comes to Cordelia’s aid, helping her search for the missing journal and land deed, and capturing her heart. As they race to find the deed, Cordelia and Sinclair encounter a team of British virologists trying to decode the genome of the 1918 influenza pandemic, but unearthing infected tissue samples may prove more lethal than curative. Cordelia and Sinclair sail through the Mediterranean from Monaco to an archaeological site in Ephesus, Turkey. They travel to a beautiful old Parisian home and a lavish estate in the British countryside. Their search culminates in the high Arctic archipelago of Svalbard, not far from the North Pole. Behind them every step of the way are a consortium of Russian underworld criminals, religious fanatics from Texas, a sinister botanist, and a sexy American spy, all hunting for the deed, all pursuing Cordelia. The Explorer’s Code is a satisfying blend of historical detail, fast-paced action, scientific discovery, and the thrill of exploration that informs as well as entertains. The breathtaking ending in the high Arctic is as chilling as a polar breeze.",
  "genres": [
    "Fiction",
    "Mystery",
    "Thriller",
    "Adventure",
    "Suspense",
    "Romance",
    "Romantic Suspense"
  ],
  "author": "Kitty Pilgrim",
  "average_rating": "3.30",
  "url": "https://www.goodreads.com/book/show/11517255-the-explorer-s-code"
}