{
  "title": "Unintended Guardian",
  "description": "Cursed to darkness, he makes a wish for freedom. She shows up instead…  A shapeshifting gryphon cursed to eternal darkness…  Sunlight shouldn't be deadly to Griff Cyrus. Determined to break his curse, he follows an oracle's bizarre instructions to have a magical package shipped to his apartment. Since when do brown trucks deliver mystical cures?  A lonely woman craving the spice of life…  Kala Kaneko's social life couldn’t be more bland. When a strange parcel arrives at her door by mistake, she seizes the excuse to introduce herself to the intended recipient, her mysterious neighbor.  Fate has a twisted sense of humor…  Griff expects the package to free him from the curse, but opening the box unleashes a mythical creature bent on Kala's death. Yet if Griff follows his instincts to protect her, he could sacrifice his last chance at freedom.  *****  Welcome to the Mythos Legacy!  Unintended Guardian is the short story introduction to the Mythos Legacy series, where real myths find real love. The first chapter of Treasured Claim, the first full-length novel in the series, is included at the back of this book!  Each standalone story in the series can be read in any order (and ends happily!), as each of these contemporary fantasy/paranormal romances feature different mythological beings—like shapeshifting gryphons—finding their perfect match among humans.You may like this short story if you like: sexy-hot kissing used as a very effective distraction, guys with wings (especially when they look like Thor), seductive strawberry-eating scenes, Japanese-American heroines, troublesome leprechauns, matchmaking stories, and guys who aren't afraid to let a woman take charge",
  "genres": [
    "Fantasy",
    "Romance",
    "Paranormal",
    "Shapeshifters",
    "Paranormal Romance",
    "Short Stories",
    "Urban Fantasy"
  ],
  "author": "Jami Gold",
  "average_rating": "3.48",
  "url": "https://www.goodreads.com/book/show/25014777-unintended-guardian"
}