{
  "title": "A Symposium and Selected Writings",
  "description": "Last year the Ukrainian Academy of Arts and Sciences in the U.S. commemorated the 110th anniversary of the birth of MykhayloDrahomanov, the distinguished Ukrainian thinker and scholar. His works, written in the second part of the nineteenth century at a time of cultural rebirth among many Slav nations, represent a signal contribution to the problem of relations between the Slavs and especially between the Ukrainians and their neighbors in a community of free and independent nations.The problems which Drahomanov faced in his own day still await solution today. Perhaps a constructive approach may begained through the study of a man who, like many Ukrainian scholars today, had to leave his native Ukraine and yet came to seemore clearly her place in Europe. “Emigration,” Drahomanov wrote, “is bitter, but under certain circumstances, inevitable. Beginning with the sixteenth century the freedom of England, Scotland, then of France, Germany, Italy, and Hungary could not do without emigration and its literature. The freedom of the Ukraine also demands it” (Letters to the Dnieper Ukraine).The Ukrainian Academy has formed a special commission for the study of Drahomanov’s works. In particular it is hoped to preparean edition of the unpublished correspondence of Drahomanov, a part of which (e.g. correspondence between Drahomanov andLesya Ukrayinka) is now at the Academy’s disposal.The present volume which is published as a special issue of the Annals presents a symposium of studies devoted to Mykhaylo Drahomanov and a selection from his own works. It is intended to acquaint the English speaking world and in particular Americanand English students of East European history with the life and work of Drahomanov.It is hoped that the present issue will inaugurate a series of larger monographs or individual works of Ukrainian scholarship in English translation.The Editors",
  "genres": [],
  "author": "Михайло Драгоманов",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/25020027-a-symposium-and-selected-writings"
}