{
  "title": "Now It's Just Us",
  "description": "***'Now It's Just Us' is a short novella which picks up right where 'Wrong Girl' left off so please make sure you do read 'Wrong Girl' first. Prepare yourself for some steamy and explicit scenes as well as plenty of adult content. It also has a cliffhanger ending... be warned.***  \"Do you know how many sleepless nights I’ve spent in complete and utter torment thinking about you? Wanting you and needing you to the point of insanity. I knew then that I would do absolutely anything to have you and now that I do… I’m willing to do everything in my power to keep you. You are mine, Samantha. You always have been and you always will be. Never, ever forget that.” - Zack.  Several months ago I did something unforgivable. I fell in love with my sister's fiancé and now I must face the consequences. I've been disowned by my family and everyone I know despises me for what I did. Everyone except Zack. He's stuck by me through it all and we're more in love than ever. He wants to take me away from it all, he wants to protect me from the cruelty and the judgemental opinions of others. He's finally convinced me to leave it all behind and get away from it all. We're going on our first romantic holiday together so we can be alone, far away from the watchful eyes of others. Now that it's just us we can finally start to figure out how we want to spend the rest of our lives together. This could be where our happy ending begins. - Samantha  Or it could be the start of something else entirely..  Can you reallly move forward from your past when the whole world wants to punish you for it? Can you really live your life and hope for a positive future when there's someone out there who is still waiting for your downfall?  Revenge is sweet and so is payback... especially when you least expect it.  *** This New Adult romance novel contains mature themes, strong language and sexual citations. It is recommended for readers 18+ ***",
  "genres": [],
  "author": "Lauren  Crossley",
  "average_rating": "3.66",
  "url": "https://www.goodreads.com/book/show/25016848-now-it-s-just-us"
}