{
  "title": "حكايتي شرح يطول",
  "description": "الناشر:ها هي حكايتي كتبتها لي ابنتي حنان... حتى إذا رويتها لها توقفت عن لوم نفسي. كنا نجلس معاً من غير آلة تسجيل تخط في دفاترها الصغيرة التي تشبه المفكرات التي ألصقت عليها الصور: ومنها صورتي وأنا أتسلم كأساً فضية عندما توجت إحدى بناتي ملكة الرقص، لأهرع إلى أحدهم في لجنة الحكم طالبة إليه أن يتظاهر بتقديم الكأس لي. ومنها أيضاً صورة امرأة عارية الصدر، وصورة نساء فوق دراجة ملتفات بالعباءات السوداء، يقودها شاب. كنت أستهل حديثنا قائلة: \"حكايتي شرح يطول، لوما الجرادة ما علق عصفور\". ولم تسألني حنان قط ما معنى هذه الكلمة إذ أيقنت أن عصفوراً لحق بجرادة، لذلك وقع في الفخ. ما إن أصابني المرض حتى توقفت حنان عن كتابة حكايتي، خبأت كل الأوراق في كيس، وأخفته في ما في إحدى خزائنها، ثم تعود إلى أوراقي وتكمل حكايتي بعد مرور عامين من وفاتي. تخبر حنان أعز صديقاتها عن عنوان الكتاب، فتستغرب لأنها لم تسألني قط ما تعني هذه الكلمة. فتقص صديقاتها القصة مبتدئة: \"حكايا بكايا، شرح يطول، لو ما جرادة ما علق عصفور\"، عن ملك كان يتمشى في البساتين عندما دخلت جرادة بكم ثوبه الفضفاض، وإذا بعصفور يلحق بها داخل الكم، يخيط الملك الفتحة ويجلس على العرش سائلاً رعيته: \"ماذا في كمي؟\". ولم يعرف أحد ما في كم الملك، إلى أن وقف بين يدي الملك رجل يدعى عصفور، كان قد تلوع من حب امرأة اسمها جرادة، ولم يكن على باله إلا صورة حبيبته، فاستهل حديثه قائلاً: \"حكايا بكايا، شرح يطول، لو ما جرادة ما علق عصفور\". تكمل \"حنان الشيخ\" في حكايتي شرح يطول مسيرتها الأدبية الشاهدة، المحرضة والكاشفة لمجتمعنا. تدخل كالأشعة السينية في ظلام أنفسنا وتقاليدنا وحقيقتنا المرة بكل إصرار ومثابرة، غير مبالية إن كان هذا البوح -الذي لا مكان له سوى الصدق- سيسبب الحرج والاستنكار. حكايتي شرح يطول هو سيرة حياة أمها (كاملة) الذي قرر الجرذ مصيرها. تجبر على الزواج والإنجاب وهي ما تزال تحلم بالحلوى وأساور الشمع الملونة. ومنذ ذاك الحين وهي تتأرجح بين أمواج الحياة، تعلو مع الموجة السعيدة وتهبط مع الموجة المؤلمة، فيصبح عالمها أكثر غرابة من عوالم القصص والروايات. تؤكد حنان الشيخ من جديد موهبتها في القص المميز ورصد الأحداث بكل زخم وشفافية، محولة بذلك أمها إلى بطلة من بطلات رواياتها. حكايتي شرح يطول احتفال بالحياة وبالموت، وشرح للنفس ولطبيعتها.",
  "genres": [
    "Nonfiction",
    "Lebanon",
    "Biography",
    "Memoir",
    "Book Club",
    "Biography Memoir",
    "Islam"
  ],
  "author": "Hanan Al-Shaykh",
  "average_rating": "3.93",
  "url": "https://www.goodreads.com/book/show/2501475._"
}