{
  "title": "The Alpha's Choice",
  "description": "Tamara Gibbs has found her story  Still reeling from the revelation that werewolves exist, Tamara Gibbs knows that she's found the story that she's been looking for. There's only one little problem: the murders are still happening around Rojo Arroyo and people are starting to point fingers at the Roadside Angels.   Alexander Cole knows who is committing the murders  When he picks up an old familiar scent on one of the victims, he knows exactly who and what is behind the murders. Unfortunately, he also knows why they're committing the murders: they're looking for him.   The time to choose is coming, and that time is running out...  When an offer is given to Alexander Cole in exchange for a stop to the murders, he finds himself caught at an impasse. To take the offer means saving the town, but it also means leaving behind his mate, his club, and a guarantee that Rojo Arroyo will still exist by morning.  EXCERPT  Tammie pushed the door handle down and walked in, her shoulders square only because she had her back ramrod straight to prevent her knees from buckling. She refused to be the wussy girlfriend.  “Hi,” she said, wishing she could think of something else to say to the man she was attached to at the heart. He was standing by his desk, and he held out his arms to her. She ran into them and sighed when he closed them around her. He was so big and warm and alive. How could she lose him now? She had only just found him. They hadn’t said the words to each other. And she had never known that she could be so needy. She had lived all her life independently, so why was the thought of losing a man she hadn’t known more than a week breaking her heart? She hugged him back, holding on to him desperately, as though she would protect him…as though she could.  “Breathe, Tamara. I’m here. I won’t leave you; I promise.” His voice soothed her, as did his hands, which were stroking her back. “I don’t want you to worry about this. Everything will be all right; I promise you.”",
  "genres": [],
  "author": "Kathryn Thomas",
  "average_rating": "3.97",
  "url": "https://www.goodreads.com/book/show/25022611-the-alpha-s-choice"
}