{
  "title": "Dearly, Departed",
  "description": "A classic romance, suspense thriller, rip-roaring adventure, and macabre comedy all at once, Dearly, Departed redefines the concept of undying love.   CAN A PROPER YOUNG VICTORIAN LADY FIND TRUE LOVE IN THE ARMS OF A DASHING ZOMBIE?   The year is 2195. The place is New Victoria—a high-tech nation modeled on the mores of an antique era. Sixteen-year-old Nora Dearly is far more interested in her country’s political unrest than in silly debutante balls. But the death of her beloved parents leaves Nora at the mercy of a social-climbing aunt who plans to marry off her niece for money. To Nora, no fate could be more horrible—until she’s nearly kidnapped by an army of walking corpses. Now she’s suddenly gunning down ravenous zombies alongside mysterious black-clad commandos and confronting a fatal virus that raises the dead. Then Nora meets Bram Griswold, a young soldier who is brave, handsome, noble . . . and thoroughly deceased. But like the rest of his special undead unit, Bram has been enabled by luck and modern science to hold on to his mind, his manners, and his body parts. And when his bond of trust with Nora turns to tenderness, there’s no turning back. Eventually, they know, the disease will win, separating the star-crossed lovers forever. But until then, beating or not, their hearts will have what they desire.BONUS: This edition contains an excerpt from Lia Habel's Dearly, Beloved.  “Heart-pounding . . . Nora and Bram’s touching and tender relationship, with its emphasis on equality and living in the moment, feels particularly special.”—Publishers Weekly “Absolutely spellbinding . . . full of ingenious inventions and dynamic characters.”—RT Book Reviews  “A zombie romance? You bet.”—Library Journal",
  "genres": [
    "Young Adult",
    "Zombies",
    "Steampunk",
    "Romance",
    "Fantasy",
    "Paranormal",
    "Dystopia"
  ],
  "author": "Lia Habel",
  "average_rating": "3.83",
  "url": "https://www.goodreads.com/book/show/11517592-dearly-departed"
}