{
  "title": "Nightsongs: The Necropath, Book 1",
  "description": "\"The mon'ter killed my mommy!\" A \"monster\" called Gothic.Not yet three years old, Steven Pierce watched Gothic murder his mother, and the creature marked young Steven as his.As Steven grows up, he struggles with his demons, not realizing that the actual demon, the \"monster\" really was following him, feeding upon him, manipulating his dreams, twisting his thoughts, sweetening his blood for the ultimate final feeding.Unaware that Gothic has always been near, terrifying memories of that night, “The Night of the Crime”, have haunted Steven as he reached manhood. Now, years later, in a failing marriage, a friend offers to help Steven. Successful and ruthless real estate developer David Garrison, however, is sleeping with Steven's wife, and sees an opportunity to conceal the affair - using his considerable resources to help Steven discover what really happened that night.As the secrets peel away, no one is ready for what they discover and the terrifying implications.Though David also has a problem. In addition to sleeping with Steven's wife, he begins an affair with a wealthy, beautiful heiress. Melissa Thornhardt is no one's plaything. She has sought all her life for her \"Intended\", her one true love. Now that she's met David she's certain he's the one.There is more to Melissa however than a romantic nature.In addition to beauty, brilliance, power, and wealth, Melissa takes part in other family traditions, notably the Family Magic. She is a very skilled witch and uses her powers to influence the world around her. No one in her family is accustomed to being told “no”. But this is especially true of Melissa, who bends reality, the will of others, their thoughts, their experiences, to her own bidding. And with this power, she draws her Intended, her true love.She has sought her true love, dueled Fate for it, and no one will deny her.David enjoys Melissa’s passion, but not her obsession. He soon wants to be rid of her as much as she wants all of him. He recognizes her presence when he hears her “night songs” playing, a soundtrack to her intense passion and limitless tenacity.Hell hath no fury like a woman’s scorn. And hell has never dreamed of a woman like Melissa Thornhardt.The inevitable collision of Melissa’s and David’s wills is the classic story of an irresistible force meeting an immovable object.But where this collision coincides with David and Steven confronting the murderer, the \"monster\", no one could have expected what happened next. For as they are told, “there’s no such thing as vampires”, Gothic seems to be just that.What they don't realize is that this outcome may even threaten to tear the very fabric separating the Living from the Dead, Day from Night, Living from the Living Dead.Where Melissa's path crosses that of Gothic, the color is red. Blood red.",
  "genres": [],
  "author": "Christian Masters",
  "average_rating": "4.14",
  "url": "https://www.goodreads.com/book/show/25014587-nightsongs"
}