{
  "title": "A Murder of Crowes",
  "description": "When the life of a family dies, what happens to their secrets? Are the memories of their vitality stamped out by the darkness? Are their heirlooms and photographs stowed away, hidden from view? Can the flicker of a candle’s flame reveal the secrets of a bygone life? Or will the damp and the darkness squelch the truth forever?  The Elkhart Bugle called it A Murder of Crowes. It was a clever play on words. A sinister spin on the traditional meaning of the phrase. A murder of crows - three crows gathered in unison. The trio are seen as an omen, a threat. The three stand in judgment over their peers. Self-declared kings of paupers. But on November 22, 1967, one journalist cloaked the phrase in further darkness when Ellis Crowe and two of his adult sons, Warren and Jasper Crowe, were murdered just moments after they had finished their evening dinner.  There were witnesses who had watched the ordeal play out and all evidence and accounts, all but one, led straight to Nathaniel Crowe. He was the youngest son of Ellis and Victoria Crowe. After his arrest, Crowe Towers was emptied of its residents for the first time since the grand estate was erected in 1754. It would not stay empty though. Like a sadistic case of whisper down the lane, the story changed. The truth was altered, shrouded by local lure, and those that believed the stories couldn’t deny the pull Crowe Towers had over them. They didn’t know that the truth was far worse than the tales that they believed.  Now thirty-six years after Nathaniel Crowe was first sent to prison, the State of Pennsylvania is preparing him for his release. The citizens of Elkhart are on edge. Nathaniel himself is uneasy. All he has known for the last thirty-six years have been the walls of Pennington Prison. But when a triple homicide occurs on the very night he is released from prison, one can only ask, “Is history repeating itself?” Or is there a copycat aiming to make sure Nathaniel never tastes the sweet nectar of freedom again?",
  "genres": [
    "Amazon",
    "Mystery",
    "Romance"
  ],
  "author": "Addison Kline",
  "average_rating": "4.53",
  "url": "https://www.goodreads.com/book/show/25030291-a-murder-of-crowes"
}