{
  "title": "The Forgotten Tale",
  "description": "Forsyth Turn has finally become a hero—however reluctantly. But now that Lucy Piper has married him and they’ve started a family in her world, his adventuring days are behind him. Yet not all is as it should be. Beloved novels are disappearing at an alarming rate, not just from the minds of readers like Pip, but from bookshelves as well. Almost as if they had never been. Almost like magic.Forsyth fears that it is his fault—that Pip’s childhood tales are vanishing because he, a book character, has escaped his pages. But when he and Pip are sucked back into The Tales of Kintyre Turn against their will, they realize that something much more deadly and dire is happening. The stories are vanishing from Forsyth’s world too. So Forsyth sets out on a desperate journey across Hain to discover how, and why, the stories are disappearing… before their own world vanishes forever.In this clever follow-up to The Untold Tale, The Forgotten Tale questions what it means to create a legacy, and what we owe to those who come after us. ----Praise for The Accidental Turn series.If I could mark this as 10/5 stars, I would, but that's impossible, so 5/5 it is, with much hearts and swoons. The Untold Tale is delicious, each word meant to be savoured, breathed in, nibbled at, full of hidden delight and wonder. -- Ana Tan, A Tsp blogThis story is nothing short of fun, unexpected, and a little bit queer. If your interested in a Science Fiction/Fantasy undertaking with all of the ingredients of a queer anthology, The Untold Tale is for you. - Dallas Barnes, PInk Play Magazine“I started reading Untold Tale, and was captivated. This superb novel grabbed me from the opening sentence, and never let go. The very best fantasy stories show us fresh new settings in which deeds and events matter—but first and foremost, they give us colorful, captivating characters we fall in love with, or love to hate, or are fascinated by.\tUntold Tale does all of this, and more. We see someone from a world we know plunged into a world that is strange to us, through the eyes of that unfamiliar world. And we care what happens to her, and to everyone we meet in Untold Tale’s pages.\tAnd the whole tale is several clever twists on the oh-so-familiar fantasies we’ve read before.\tI want more. Books more” —Ed Greenwood, Forgotten RealmsI think that J.M. Frey's The Untold Tale is the most important work of fantasy written in 2015. It may be the most important work of fantasy written this decade, but I'll have to get back to you on that in 2020. -- Mike Perschon, PhD",
  "genres": [
    "Fantasy"
  ],
  "author": "J.M. Frey",
  "average_rating": "4.10",
  "url": "https://www.goodreads.com/book/show/25024494-the-forgotten-tale"
}