{
  "title": "A View into the Hereafter",
  "description": "The trilogy ‘A View into the Hereafter’ is the first book title by Jozef Rulof and as such an excellent way of becoming acquainted with his writing mediumship. The trilogy has been built up around the basic principle for the grow of our spiritual conscious: ‘There is life after death’.In the foreword of the first edition Jozef Rulof wrote: ‘The publication of this book has the aim of giving humanity the conviction of it – in a higher form of existence – continued existence after the physical death.’ Therefore not only ‘life after death’ but the very concrete continued existence of the human personality as spirit. The ‘spirit’ is hereby not a vague concept or a by-product of the brain, as earthly science describes it. The spirit comes to the fore as a human personality, which separates itself from the earthly body upon death and lives on as spirit. That spirit therefore also has a body, an astral or spiritual body, which looks just like the earthly body in the beginning because it has been given form by the same spiritual personality. The nature and construction of this astral body is described in these books in detail.The trilogy makes it clear that the spirits are to be found both in the ‘divine spheres’ and here on earth. They are not visible to most people, because they no longer have a physical body. However, Jozef Rulof could already see them and talk to them as a small child. As a result of his high degree of clairvoyance and clairaudience and his pure emotional life he could be developed into a pure medium for the spirits in order to make themselves known on earth.Jozef is called ‘André’ in these books. The first part of this trilogy describes the wonderful way in which André gets to know the spirit Alcar. In the first instance André wants nothing to do with spirits or spiritualism, but Alcar seeks contact himself with André because Alcar wants to give his wisdom and love to humanity. The book contains hundreds of pieces of proof which Alcar gives to André to show that the spirit really lives on after physical death. Alcar shows that he and his ‘brothers and sisters’ have kept all their human feelings and capacities. In order to also make this clear for other people Alcar asks various spirits to paint again on earth by making use of André’s body. André himself does not possess any talent for drawing, but the spiritual painters create wonderful works of art which testify their high capabilities.André receives these works of art in a state of trance. The painting is also used to deepen this trance. After years of development André is capable of departing from his body as spirit. As a result of this he can check with his own eyes what Alcar told him about the spiritual worlds.Alcar and André make hundreds of ‘astral’ journeys together to the spheres of light and darkness. Alcar takes André to the highest ‘heavens’, in order to give humanity a general overview of what happiness awaits the human being after his earthly death. André sees his own still-born child again in the ‘children sphere’ and as a result of this he can support his wife with the message that their child lives on in divine happiness, brought up by spiritual mothers. Alcar shows André how the human being as a spiritual personality continues to build on art and science, in order to then bring that science to earth. Many spirits of light are continually busy inspiring the earthly scientist and physician to cure the terrible illnesses. Alcar also takes André to the seven spheres of darkness, where the dark spirits have found their astral residence. André is attacked in these dark areas by dark entities who want to control him.",
  "genres": [
    "Spirituality"
  ],
  "author": "Jozef Rulof",
  "average_rating": "4.38",
  "url": "https://www.goodreads.com/book/show/25026132-a-view-into-the-hereafter"
}