{
  "title": "Bound by the Summer Prince",
  "description": "The Summer Court is in an uproar. The king has just been executed for unpardonable crimes, and the queen is prostrate with grief over his loss. This leaves the Summer kingdom bereft of true leadership; a problem which is compounded by the fact that the laws of Fairie require balance to be maintained by having a male and a female ruler for both Season Courts at all times. Uaine, the Summer prince, is the only one who can put things right, but he is without a mate. Knowing that he must take a bride quickly, for the sake of his people, even though he is struggling with his own feelings of pain and anger over his father's treachery, he goes for a walk in a forest near the palace to try to clear his head and determine how best to choose a female to rule beside him.  While walking Uaine discovers a human female running loose in Fairie, which is against the most basic tenets of Fae law. Furious at one more problem he must deal with, he takes her prisoner and locks her in the dungeon; only to discover later that she is his soul-mate. The magical bond between them means they are meant to be together forever, but humans can't feel the magic of Fairie. Will Uaine be able to win her heart and convince her that she can trust him to keep her safe from all the dangers of Fairie...including himself?  Roni is a human con woman and petty thief. Having run afoul of the local crime syndicate in the city where she is staying, she finds herself running for her life. Trouble is no stranger to her, but when she falls through a hole in a wall and finds herself in a world with carnivorous trees and rocks that eat people she realizes she may have found more of it than she can deal with. Rescued/arrested by the prince of the Summer Court, it doesn't take long for her to formulate a plan to use him to get herself home. Unfortunately for her, she soon finds that her heart, which she had thought long ago turned to stone, has begun to feel the love she has been playing at. Will she be able to overcome a lifetime of caution and allow herself to follow her heart? Can a criminal love a cop?  Please be aware that this book contains explicit sexual scenes, depictions of BDSM, and anal play. If these things disturb you, then this may not be the book for you.",
  "genres": [
    "Fantasy",
    "Fantasy Romance",
    "Erotica",
    "Paranormal Romance"
  ],
  "author": "Mistral Dawn",
  "average_rating": "4.09",
  "url": "https://www.goodreads.com/book/show/25027872-bound-by-the-summer-prince"
}