{
  "title": "Dare to Hold",
  "description": "Some women always get it right. Kindergarten teacher, Meg Thompson, on the other hand, consistently makes the wrong decisions — and she is currently single, pregnant and alone. Meg is determined to make changes in her life, to be a better mother than her own had been. No revolving door of men. No man, period. Just a single-minded focus on her baby. Her resolution would be easier to keep if not for hot cop, Scott Dare. He insinuates himself in her life, making Meg want to believe in happily ever after, even if history has taught her to know better.  When Scott Dare hears Meg’s friends are determined she have a night of hot sex, before her life changes forever, he decides that man must be him. Their one night is mind blowing and life altering. And Scott, a man already burned by his ex-wife, finds himself all in anyway. While protecting Meg from her violent ex and becoming part of her increasingly complicated life, he’s falling hard and he can’t seem to find distance. Not when their bodies respond to each other with such heated intensity and he’s drawn to her unique combination of strength and vulnerability.  But Meg’s future is one Scott has accepted he’ll never have, even if his growing feelings say otherwise … (love story, contemporary romance, alpha heroes, beach reads, sports heroes, bad boys, billionaire)  Dare to Love Series Reading Order Book 1: Dare to Love (Ian & Riley) Book 2: Dare to Desire (Alex & Madison) Book 3: Dare to Surrender (Gabe & Isabelle) Book 4: Dare to Submit (Decklan & Amanda) Book 5: Dare to Touch (Olivia & Dylan) Book 6: Dare to Hold (Scott & Meg) coming in 2015 Book 7: Dare to Rock (Avery & Grey) coming in 2015 *each book can stand alone for your reading enjoyment Thank you so much and enjoy!",
  "genres": [
    "Romance",
    "Contemporary",
    "Contemporary Romance",
    "Audiobook",
    "Family",
    "Adult",
    "Erotica"
  ],
  "author": "Carly Phillips",
  "average_rating": "4.02",
  "url": "https://www.goodreads.com/book/show/25028005-dare-to-hold"
}