{
  "title": "Captive, Mine",
  "description": "The day my father agreed to testify against Terrence Randall, one of the most ruthless drug traffickers in North America, was the day I became the target of the drug lord’s enraged vengeance. I was the one thing that stood in the way of Daddy’s testimony, and the one thing that could save Randall. The man would stop at nothing to get his hands on me.  I was prepared for what was coming — as prepared as one could be when vanishing into the U.S. Marshal’s Witness Protection Program.  I just wasn’t prepared for him.  For ex-Navy SEAL turned mercenary Lake Freeman, escorting Lily Cross into the Witness Protection Program was just another job — until a better offer came along. Lake couldn’t have cared less about the life he’d been hired to protect. After all, she was a part of the very organization that had cost him so much already.  At least he never expected to care.  But when forced into a decision he never thought he’d have to make, the mission became one of survival for himself and his beautiful charge. Lake knew that in order to protect her, he’d need to bring the feisty and unpredictable Lily to heel — he couldn't keep her safe if he couldn't keep her under control.  But that protective urge quickly turned into something else, something dark ... and his need to conquer, to claim, overrode all else.  He would keep her safe. He would keep her protected. But he would make her his, as well.  Now, all he had to do was figure out how to keep them both alive long enough to do it...  Publisher's Warning: Intended for mature readers. 18 and over only!  This is a MF BDSM romantic suspense. Themes include: graphic sexuality, pervasive D/s, exhibitionism, spanking, bondage, anal play and other BDSM activities. If such content might offend you, please do not purchase this book.  Word count: 66,328 words",
  "genres": [
    "BDSM",
    "Dark",
    "Erotica",
    "Romance",
    "Dark Romance",
    "Contemporary",
    "Erotic Romance"
  ],
  "author": "Natasha Knight",
  "average_rating": "3.54",
  "url": "https://www.goodreads.com/book/show/25026475-captive-mine"
}