{
  "title": "Risking It All",
  "description": "Risking It All is a 29,000 word novella with a satisfying romantic ending -- no cliffhangers. It is the second of three novellas featuring Jack & Lily, preceded by Betting It All (out now) and followed by Burning It All (April 1st). The Motorcycle Clubs series is a novella series for women who want all of the heat and emotion, but who don't have all of the time. Only 99¢ for a limited time, and always FREE with a Kindle Unlimited subscription.  A month ago, I risked everything with a bet that should have made Jack Hayden mine. But now I think I’ve truly lost…  All my life, I’ve fought for everything I want. That’s earned me a place as the only female member of the Hellfire Riders MC. It’s given me thirty nights with the Riders’ dangerous warlord. It’s given me hope for so much more.  Yet when Jack abandons my bed before the thirty nights are up, the pain of fighting for more time in Jack’s arms just isn’t worth the risk anymore. Because I can’t expose any vulnerability, especially now that the Devil’s Hangmen are making a play for Rider territory—and Jack can lay my heart wide open so easily...  Available Now in the Motorcycle Clubs series:  HIS WILD DESIRE by Ella Goode (Death Lords MC #1) OFF LIMITS by Ruby Dixon (Bedlam Butchers #1) WANTING IT ALL by Kati Wilde (Hellfire Riders #1)  HER SECRET PLEASURE by Ella Goode (Death Lords MC #2) PACKING DOUBLE by Ruby Dixon (Bedlam Butchers #2) TAKING IT ALL by Kati Wilde (Hellfire Riders #2)  THEIR PRIVATE NEED by Ella Goode (Death Lords MC #3) DOUBLE TROUBLE by Ruby Dixon (Bedlam Butchers #3) HAVING IT ALL by Kati Wilde (Hellfire Riders #3)  THEIR FIERCE LOVE by Ella Goode (Death Lords MC #4) BETTING IT ALL by Kati Wilde (Hellfire Riders MC #4) DOUBLE DOWN by Ruby Dixon (Bedlam Butchers MC #4)  THEIR LASTING CLAIM by Ella Goode (Death Lords MC #5)",
  "genres": [],
  "author": "Kati Wilde",
  "average_rating": "4.25",
  "url": "https://www.goodreads.com/book/show/25024191-risking-it-all"
}