{
  "title": "The Whip Master",
  "description": "The time of the annual Festival had arrived and Graye Manor bustled with a frenzy of activity. Its rolling, manicured grounds echoed with the sharp sounds of a whip striking human flesh and shrill cries filled with both pain and pleasure followed, bringing excited smiles and eager anticipation to the faces and hearts of the listeners. The time of the Cirque de Sade Festival had finally arrived and, with it, the final magnificent display of skills, beauty, and selfless service that would end at the auction block. Guests would be arriving from all over the globe to be served, and entertained, by the staff of this unique establishment. The outside world knew nothing about its purpose, or the real history behind the cold stone walls, and Dorian Graye intended it to remain that way. Things happened in the Manor - things that the real world would never embrace...Pride, Integrity, Loyalty and Love, the acronym of PILL, is a hard one for many to swallow in the eyes in today's society. In honor of his mentor's vision for a rich alternative to the old world ideas of domestic service, Graye Manor was founded. Select applicants, known as Graye's Maids, are trained in the classic skills of a domestic - with one major difference. Each is drawn to the darker side of service and flourishes under the command of a hard palm upon a bare backside- or even, in more hardcore cases, the slash of a whip.Dorian Graye is a master of the Florentine long- tail whip, and has made an art form of throwing the braided snakes to paint a human canvas. Like his namesake, he plays hard, but he loves even harder- especially when it comes to Annie, a young woman who was tossed onto the streets by a selfish and neglectful family. He and his beloved wife, known as One, help Annie discover an unknown part of her heart- a heart to serve- but her dreams do not include the type of life that they can offer her. Their love for her demands sacrifice- but will it be enough to mend her brokenness, chase away her fears, and make her dreams come true?The Whip Master is a story about total power exchange, surrender, difficult choices and sacrifices of love. Under the slightly sadistic exterior is a man whose greatest desire is for each of his beloved maids to find happiness. He allows nothing to stand in their way, not even themselves, and is willing to sacrifice anything to grant them their heart's desire... even if the journey to that desire means suffering as the door to previously unspoken taboos are opened and explored during the decadent Cirque de Sade Festival where anything is possible, and everything is probable.",
  "genres": [
    "BDSM",
    "Erotica",
    "Romance"
  ],
  "author": "Breanna Hayse",
  "average_rating": "4.21",
  "url": "https://www.goodreads.com/book/show/25027019-the-whip-master"
}