{
  "title": "Waiting on Zapote Street: Love and Loss in Castro's Cuba",
  "description": "Winner of the 2018 Latino Books Into Movies Award, Drama TV Series.A review by Manuel C Diaz, from El Nuevo Herald (the Spanish equivalent of the Miami Herald) - translated into English.\"...Written using two narrative voices-Laura's mother; and that of Rio, the father - who alternate in each chapter, this wonderful novel begins with Laura leaving Cuba with her three children after having been waiting for twelve long years to be reunited with her husband in the United “She could smell the salt of the sea and hear the waves crashing against steel on that moonless April night. It was 1980, the year everything changed. \"Yes, it was the year that everything changed. Not just for Laura and her family, but for hundreds of thousands of Cubans. What would come to be known as \"the Mariel exodus,\" one of the most shameful episodes to have occurred on the island, had begun.In the following chapters the story goes back in time and sometimes in the voice of Rio and others in that of Laura, Viamontes reconstructs their lives, first, starting from the childhood and adolescence of their parents -to give us a glimpse of what Cuba was like before the arrival of the revolution - and later when they met in 1961, just as the country was entering the black night of totalitarianism.\"Waiting on Zapote Street\" is almost a cinematically-structured novel. Its scenes follow each other with precision of time and space, as if they were those of a script. That is why the plot, although detailed and meticulous, progresses in a linear Laura and Río's wedding, the birth of children, the formation of a family and their “The day of Rio’s departure, everyone at home was sad, as if someone had died. I consoled myself with the idea that my children would soon see their father again.”But that would not happen. What follows is the moving account of a single mother with three children, trapped in the labyrinth of incivility and degradation that Cuba had become, as she tried not to be overcome by frustration and despair.The titles of each chapter can give an idea of the weight of the cross she had to endure ‘Rations’ (“In food stores they altered the weights to keep a fraction of each ounce”); ‘Protesters’ (“When they realized that my children and I were leaving the Immigration building, they began to shout obscenities at us, throw sticks and stones at us, and yell at Worms, traitors!” ...In the last chapter, of great dramatic force, the arrival of Laura and her children in Key West is “Beyond, in the distance, an American flag floated majestically against the blue sky. There were signs in Spanish \"Welcome to the United States.\" My daughter Tania's eyes sparkled as she saw men fall to their knees and kiss the ground as they disembarked. Others hugged each other and 'At last! At last!'.______________________“From its opening shocks of loss and separation to its thrilling and emotional conclusion, Waiting on Zapote Street gives us a front-row experience of a Cuban family’s hardship, love, and enduring love.” John Henry Fleming, author and University of South Florida Creative Writing professor.“This touching narrative depicts the harrowing trials, loss and separation that hit one particular family in Cuba when Castro comes to power…The author demonstrates numerous layers of Cuban life and belief...” Judge, 25th Annual Writer’s Digest Self-Public Book Awards.“We were captivated by this intimate portrayal of the impact of “la revolución.” United Nations (UN) Women Book Club of Gulf Coast.",
  "genres": [],
  "author": "Betty Viamontes",
  "average_rating": "4.25",
  "url": "https://www.goodreads.com/book/show/25032977-waiting-on-zapote-street"
}