{
  "title": "A Dance in the Woods: A Mother's Insight",
  "description": "A Dance in the Woods: A Mother's InsightBy Janet K. BrennanPublisher: Casa de Snapdragon ISBN: 978-1-937240-48-6, Pages: 350, Book Size: 6.69 x 9.61, Price: $15.95 Published Date: January 15, 2015 The fundamental feature of Janet’s character is a passionate quest to find some sign of her daughter even after her tragic death, and she strives for it at any cost. Brennan’s husband is posted to a small village in Italy, Montecchia di Crosara, and the abrupt move is a challenge to the family. Brennan must find herself while learning to live with her family in such foreign but ultimately healing surroundings. After her daughter’s death, Janet lost faith in everything. Apart from a few healing practices of going up and down a hill where Brennan observes an old woman talking to her deceased husband at his gravesite and listening to a local band’s practice music coming from a shed, all that remained was Nature with its dark woods and simple invitation. We witness Janet in the depth of heartsickness slowly but surely being able to kick up her feet “in a mock Tarantella,” thus starting a freeing ritual in nature that would not fail her. Her dancing in the woods becomes a “priestlike task of pure ablution” in the world of nature, and this helps her to get rid of her pain She now experiences Nature’s healing power like Wordsworth in his Tintern Abbey.AUTHOR BIOJanet K. Brennan is an author and poet who lives in the foothills of Albuquerque, New Mexico with her husband Arthur, cat, Amos and two shepherding dogs. She was nominated for the Pushcart Award for her book Gentle Tugs and has graced the front cover of the autumn edition of Mary Barnet’s “The Poetry Magazine.” Brennan has had many of her short stories and articles published in national and international magazines, most recently the overnight best-seller, “Chicken Soup for the Soul, Think Positive” and “A Chicken Soup Christmas.” She has also been featured in “The Power of Prayerful Living,” Rodale Books, “Prevention Magazine,” “Insights, Contemporary Short Stories,” and the military newspaper, “The Stars and Stripes.”She has authored four books of poetry and five novels, including the critically acclaimed, Harriet Murphy: A Little Bit of Something, which was selected as Reviewer’s Choice in the SW Book Reviews and Bookwatch 2010. Janet was cited by Dr. Santosh Kumar as “One of the best contemporary writers of our time” for her memoir, A Dance in the Woods. Amazon, 2011, placed her book, Holiday Word Gifts on the holiday classic list.Janet Brennan is currently serving on the Board of Directors for the New Mexico Book Association. She and her husband Arthur co-founded award winning Casa de Snapdragon LLC and its imprint JB Stillwater Publishing. She is an accomplished pianist and has collaborated in writing music with Disney’s Michael Edward-Stevens. Brennan attended the University of New Hampshire and Hesser Business College where she majored in English. She holds a paralegal certificate from the University of New Mexico.Represented by Karen Villanueva Author Services, 239-877-4248, authorcare@aol.comJanet K, Brennan, Managing Editor, Casa de Snapdragon LLC. www.casadesnapdragon.com",
  "genres": [],
  "author": "Janet K. Brennan",
  "average_rating": "4.71",
  "url": "https://www.goodreads.com/book/show/25033115-a-dance-in-the-woods"
}