{
  "title": "\"We Were Five:\" The Dionne Quintuplets' Story From Birth Through Girlhood to Womanhood",
  "description": "When they were three days old, their father offered them to the Chicago World's Fair as an exhibit.Appalled, the Canadian government made them wards of the crown and installed them in an elaborate nursery, especially built and staffed, across from the bleak frame house in which they were born.The Dionnes were offended and bitter. \"If you find a gold mine,\" a man close to the family complained, \"the government doesn't take it away from you.\"Seven years later, having worn down their guardians by his ceaseless petitioning, their father regained control. \"We were transferred into the Big House like a conquered army - one group of five clinging together as if for protection....\" Their six brothers and sisters were hostile, the parents tight-lipped and restrictive....\"We Were Five\" is the hitherto untold story of the Dionne quintuplets, from birth through childhood to womanhood: what went on behind the scenes of the front-page emotional binge and the years of grist for Sunday supplements that gave the world an image of five cherished little princesses.The true story has the dark atmosphere and emotional pull of Victorian tales of children secretly tyrannized, of desperate efforts to escape, of flights to a convent, of secret courtships (the Quintuplets were taught that there was not the remotest possibility of their ever marrying), of hidden conflicts of will. It has, under the circumstances, a remarkably happy ending.What is most extraordinary is this: out of their strange girlhood the five sisters - princesses, freaks-on-exhibit, fought-over commercial properties, lonely orphans in the heart of a big family - miraculously developed into young women of individuality and courage. Annette, Cécile, Yvonne and Marie recall the incredible events of their lives, the people who exploited them, and the people who befriended them, without illusion and with remarkable charity. Their story is unique and wholly fascinating.To James Brough, for the perception and grace with which he has set down their story, Annette, Cécile, Yvonne and Marie Dionne say, \"Dieu vous bénisse.\"",
  "genres": [
    "Biography",
    "Nonfiction",
    "History",
    "Biography Memoir",
    "Memoir"
  ],
  "author": "James Brough",
  "average_rating": "3.67",
  "url": "https://www.goodreads.com/book/show/2504182._We_Were_Five"
}