{
  "title": "Visual Vitriol: The Street Art and Subcultures of the Punk and Hardcore Generation",
  "description": "Visual The Street Art and Subcultures of the Punk and Hardcore Generation is a vibrant, in-depth, and visually appealing history of punk, which reveals punk concert flyers as urban folk art. David Ensminger exposes the movement's deeply participatory street art, including flyers, stencils, and graffiti. This discovery leads him to an examination of the often-overlooked presence of African Americans, Latinos, women, and gays and lesbians who have widely impacted the worldviews and music of this subculture. Then Ensminger, the former editor of fanzine Left of the Dial , looks at how mainstream and punk media shape the public's outlook on the music's history and significance.Often derided as litter or a nuisance, punk posters have been called instant art, Xerox art, or DIY street art. For marginalized communities, they carve out spaces for resistance. Made by hand in a vernacular tradition, this art highlights deep-seated tendencies among musicians and fans. Instead of presenting punk as a predominately middle-class, white-male phenomenon, the book describes a convergence culture that mixes people, gender, and sexualities.This detailed account reveals how members conceptualize their attitudes, express their aesthetics, and talk to each other about complicated issues. Ensminger incorporates an important array of scholarship, ranging from sociology and feminism to musicology and folklore, in an accessible style. Grounded in fieldwork, Visual Vitriol includes over a dozen interviews completed over the last several years with some of the most recognized and important members of groups such as Minor Threat, The Minutemen, The Dils, Chelsea, Membranes, 999, Youth Brigade, Black Flag, Pere Ubu, the Descendents, the Buzzcocks, and others.",
  "genres": [
    "Music",
    "Art"
  ],
  "author": "David Ensminger",
  "average_rating": "3.94",
  "url": "https://www.goodreads.com/book/show/11519028-visual-vitriol"
}