{
  "title": "How I Wrote Certain of My Books",
  "description": "«Michel Leiris compartía con Robert Desnos el deseo de intervenir sobre la materia misma del lenguaje. Le pedimos varias veces su colaboración, pero por desgracia, no obtuvimos respuesta alguna. Con el tiempo comprendimos que estaba comprometido en una obra totalmente individual que no admitía escape exterior alguno. Aún ahora pocos han comprendido el significado y el alcance de su trabajo. De todos modos, nuestra admiración por él no disminuyó : con el mimo entusiasmo que, a principios de 1924, acogimos su obra, L´étoile au front , en 1926, aclamamos también Poussières de soleil .»                                                                                                                                                                             André Breton   «En 1911, asistí con Picabia y Apollinaire en el Teatro Antoine a la representación de Impressions d´Afrique de Raymond Roussel . ¡Fue formidable ! En escena, había un maniquí y una serpiente que se movían muy poco, todo muy loco, muy insólito. No recuerdo mucho el texto. Lo que más me sorprendió fue el espectáculo en sí. Después leí el texto y asocié las dos cosas. . .  Ese hombre fue un revolucionario, al nivel de un Rimbaud. Rompió con todo. Ya no se trataba de simbolismo, ni siquiera el de Mallarmé, cosas que Roussel ignoraba totalmente. ¡Qué personaje sorprendente ! Vivía encerrado en sí mismo, en su roulotte , con las persianas bajadas. Le vi una vez en la «Régence», donde jugaba al ajedrez. Iba vestido de negro, muy «señorito». No me interesó conocerlo, había leído su obra y me bastaba para opinar. Lo que sí me importaba era su actitud, cómo había hecho todo aquello, por qué razones. ¡Tuvo una vida extraordinaria ! Y, al final, ese suicidio. . . »                                                                                                                       Marcel Duchamp",
  "genres": [
    "France",
    "Fiction",
    "Poetry",
    "Writing",
    "Literary Fiction"
  ],
  "author": "Raymond Roussel",
  "average_rating": "4.10",
  "url": "https://www.goodreads.com/book/show/250408.How_I_Wrote_Certain_of_My_Books"
}