{
  "title": "Dakota's Autumn",
  "description": "Dakota's AutumnA Deadly Flowers StoryFlowers can be beautiful,For over twenty years Shane Black has been a man searching; searching for his missing twin brother, searching for the man who tore his family apart, searching for a way to reclaim his identity, searching for home. In the middle of a mission where his cover is blown, Shane awakens to find himself in a shack in the middle of South America where the beautiful little flower who saved his life has left him and taken the formula he was sent to recover. Now he must find his way home with the few items she has left for him and start a new search. For her.Flowers can be deadly,When Autumn is abducted by the man responsible for destroying Shane’s family, he must face his personal demons and join forces with those he holds responsible for betraying Autumn.While Shane and the Deadly Flowers race to bring Autumn home safely, she stumbles onto what Shane has searched most of his life for, but will they be too late to end the reign of terror of a mad man.Flower can be healing.Autumn Bennett is a woman of many talents and secrets. A top rate trauma surgeon and a master of Dim Mak, she is as complicated and deadly as the flower she is named after, the Autumn Crocus, a flower known to have both healing and life-threatening properties. Autumn’s professional life is turned upside down when she is falsely accused of killing a patient. At odds as to what she should do she turns to the family business, a private security firm where her cousins have banded together to create an all female covert ops team, the Deadly Flowers. Using her skills as a healer, and her mastery of Dim-Mak, Autumn winds her way in and out of her two careers searching for answers to where she belongs, in her life, in her complicated family and the man who fascinates her above anyone else.",
  "genres": [],
  "author": "Savannah Morgan",
  "average_rating": "4.88",
  "url": "https://www.goodreads.com/book/show/25051420-dakota-s-autumn"
}