{
  "title": "The Deception series boxset: FaCade, Cadence, Beneath Innocence",
  "description": "This is a boxset containing; FaCade, Cadence and Beneath Innocence. This is the full bestselling Deception series. WARNING! This boxset is Dark erotica. This book contains situations that some may find offensive. If you are sensitive to graphic violence read with caution. \"TRSOR Top read. Scorching hot erotic thriller\" The Rock Stars Of Romance. \"Don't you love a book that leaves you gasping at the last page,\"- EyeCandy Bookstore \"I shit you not. I was on the edge of my seat for this entire book. BUCKLE UP AND ENJOY THE RIDE.\" - The Twisted Sisters \"Façade is a maze you need to find your way out of in order to discover answers and regain your sanity\" - Sinfully Sexy Book reviews \"This book will blow your mind and leave you numb from the overload of emotions you've just consumed!\" - Rock Out With Your Book Out \"My mind is still reeling from this amazing book. WOW\" - Panty dropping book blog~ Kathy FaCade; You meet someone. You date. You fall in love. You marry. The four simple rules of love.... Wrong! I'm getting married but I'd never met him before now, never dated him, never fell in love. I have no access to the memories of the most magical time of anyone's life. I am, Star, and just like with some stars in the sky, the light you see is an echo, a façade, I am already gone I am a no one. Especially to him. To him I am the dark in his desires, the corrupt in his depravity. The sin in his immorality Cadence; He had her love. Her devotion. He destroyed her with it! I will find him. I will take her from him. And then I will kill him. Beneath Innocence; JENSON We all say we'd kill for the one we love, but would we? I did. And I took great satisfaction in doing it as painfully and gruesomely as possible. He paid for what he did to Blue.... My girl, the only girl who could ever steal my heart. Did it get me anywhere? Oh yeah. I fell onto a path of self-destruction. I reserved myself a spot in hell. And Blue left. BLUE When someone kills for you, you owe them everything, even your life. I couldn't even give him my heart. Why? Because I didn't deserve for him to protect it for me. Instead, I hid away, made some wrong choices and watched from afar as the man I loved fell in love with someone else",
  "genres": [
    "Dark",
    "Dark Romance",
    "Romance"
  ],
  "author": "Ker Dukey",
  "average_rating": "4.39",
  "url": "https://www.goodreads.com/book/show/25043420-the-deception-series-boxset"
}