{
  "title": "Secrets and Lies - The Killers ~ Book One: A D'Silva Brothers Novel",
  "description": "Sometimes Love can be a Killer...  Ethan D'Silva has returned home to Willow Grove and Alison is thrilled, especially when she finds out he has always had feelings for her. Something isn't quite right though as he is vague about his time away and is caught out in a lie. Will Alison find out the truth or will Ethan's brother Marcus prove too much of a distraction?  Lies is the first book in The Killers Series and is set in the small town of Willow Grove in West Virginia. It follows the lives of brothers Ethan and Marcus D'Silva and some of the residents of Willow Grove including Alison, the girl that Ethan fell in love with when he was just a boy.   His phone made a thundering vibration against the table. He found the noise irritating to say the least but less so than the myriad of tones supplied to let you know that someone had sent you a message. He supposed he could turn the phone off but he didn’t want to miss anything. He put down his beer, glanced around the gloomy bar, just to check nobody was watching him, or more to the point, pretending not to watch him. It was a subtle difference but one he could spot a mile away. He also had an unobstructed view of the exits. He liked it that way. A quick glance told him that he was alright for the time being. The bar was only a couple of miles from Vegas so mostly the people here were drinking to numb the pain of losing everything they had. It wasn’t a place for winners, that was for sure. It was perfect for him to fade into the background, a difficult task for someone born as handsome as he was but he tried his best. He picked up his phone.  He’s here. Two words that made him smile. It was just the text he had been waiting for. Something had told him it wouldn’t be long. What do they always say about returning to the scene of the crime? He drained the last of his beer, put his phone in his back pocket and started to make his way out. He was almost to the door when a large guy with far too many tattoos and far too much facial hair, bumped into him. He knew the score, knew what was coming, felt the atmosphere of the place change as everyone turned to look. ‘Hey,’ Beardy said, slightly slurring his words. He turned to face him. ‘You wanna apologise?’ Beardy had nothing against him personally, he just wanted to fight, wanted to feel like a man because the blackjack table or more likely the slots had stolen what little dignity he had left. Beardy had picked on him because out of all the people in the bar, he stood out the most, he didn’t belong in this pit. Beardy had about a hundred pounds on him but it wasn’t muscle, that said two men with similar build, tattoos and facial hair, stood up from their stools as Beardy had spoken, ready to pile in if needed. Everyone else, about six people in total plus the barman had visibly shrunk when this had all started. So it was going to be three against one. Not something that would usually cause him to worry but he didn’t want the hassle, not now. He could see the barman inching towards his left, toward the phone so cops would be on their way if it all kicked off and he could do without being arrested. Not now, he had a long journey ahead of him, although, he’d waited almost a year, what was another few days? He was itching to teach this loser a lesson he wouldn’t soon forget. A couple of days in hospital would make him think twice before picking a fight with a stranger in future.  ‘I don’t want any trouble Runner.’ The barman spoke up finally. He had his hand on the phone now. Runner jabbed the handsome man’s solid chest with two fingers. ‘You deaf?’ Runner asked.",
  "genres": [],
  "author": "Penelope Greene",
  "average_rating": "3.75",
  "url": "https://www.goodreads.com/book/show/25045171-secrets-and-lies---the-killers-book-one"
}