{
  "title": "Your Daily Walk with The Great Minds: Wisdom and Enlightenment of the Past and Present",
  "description": "Do you desire to change the world? It all starts with you so let’s begin your transformation today!Your Daily Walk with the Great Minds is a daily journey based on psychological and spiritual principles that have been scientifically confirmed and shown to help create lasting change and personal growth. When each human being changes and grows it directly affects humanity. If each individual being is committed to change and self actualization the Universe will directly feel this peace and universal transformation will occur. There is no better time than Now to take part in Universal peace and enlightenment. Have you ever wondered?* What your purpose and meaning in life is?* How to combat anxiety and depression in your daily life?* How to begin pursuing your dreams and taking action to achieve them?* How to maintain peace of mind in a world of conflict and strife?* How to transcend the monotony of daily life and truly embrace what life has to offer you?I invite you to find the answers to these and other questions through meditations and journaling exercises on Your Daily Walk with the Great Wisdom and Enlightenment of the Past and Present, 3rd EditionAbout the AuthorRichard Singer is first of all a real human being who is quite faulty and still struggles with life on a daily basis, however on a worldly basis he is an award winning author, trained psychotherapist, Asst. Professor of Human and Social Science, and most importantly a seeker of truth. He continuously searches for wisdom to use in his life, as well as helping other human beings in their precious journey. He has studied Eastern Psychology, Buddhist Healing, and Non-Violence at the Doctoral Level; in addition, he has spent years devoted to the study of wisdom recorded throughout history. He seeks to impart this knowledge to the world through his writing. For more information please visit www.EmbracingthePresent.com\"Having used this book daily for several months, I can honestly recommend it to anyone seeking a path to spiritual growth.\"--Rev. J Francis Stroud, S.J., Director DeMello Spirituality Center\"I have spent my life studying lots and lots of self-development books and I can say emphatically that Your Daily Walk with the Great Minds ranks in the top ten. I whole heartedly recommend this book to any seeker of self-development.\" --C. Kumarbabu, MD, former chair of Psychiatry, Govt. Stanley Hospital, IndiaFrom Loving Healing Press www.LovingHealing.comSELF-HELP / Meditations",
  "genres": [],
  "author": "Richard A. Singer",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/25045110-your-daily-walk-with-the-great-minds"
}