{
  "title": "Alexandr's Reluctant Submissive",
  "description": "This is part TWO of Alex and Jessica's story. Part ONE, Alexandr's Cherished Submissive, should be read first for the most enjoyment.Having believed for five years that his wife and daughter are dead, Alexandr Novikov’s world changes forever when he discovers not only are they alive, but the vile person who tore his family apart was none other than his father, Jorg. Determined to make up for lost time, Alex sets about winning the hearts and trust of his wife and daughter, and healing the emotional damage done to Jessica by their forced separation. Easier said than done when jealousy rears its ugly head, and Jessica struggles to deal with all the women Alex was intimate with after her supposed death.Jessica has prayed for a chance to reunite with Alex, to be the family they were meant to be, to reclaim and rebuild their relationship. Those prayers are finally answered, but she quickly realizes her husband still sees her as the naive twenty-year-old girl she used to be, the one who was content to let him run the show. Jessica’s grown up during their difficult time apart, and she’s no longer content being a piece of arm candy for her powerful husband. If he’s going to bring her back into the deadly world of the Russian mafia, Alex needs to realize that she’s strong enough to be his partner in name and in truth. Only as equals will they find courage enough to face the days ahead.Especially since Jorg isn’t done meddling with their lives…and his latest actions will have deadly consequences for generations to come. This book contains a rather kinky Bratva lord who likes to give his woman all the pleasure she can handle, with the help of his friends. It includes anal, F/F play, spanking, domestic discipline, and a M/F/F/M/F/M/F/M scene that'll make you squirm.",
  "genres": [
    "BDSM",
    "Erotica",
    "Menage",
    "Romance",
    "Contemporary Romance",
    "Contemporary",
    "Dark"
  ],
  "author": "Ann Mayburn",
  "average_rating": "4.41",
  "url": "https://www.goodreads.com/book/show/25049787-alexandr-s-reluctant-submissive"
}