{
  "title": "Failing the Future: A Dean Looks at Higher Education in the Twenty-first Century",
  "description": "Both revealing and compelling, Annette Kolodny’s Failing the A Dean Looks at Higher Education in the Twenty-first Century is drawn from the author’s experience as a distinguished teacher, a prize-winning scholar of American literature, a feminist thinker, and an innovative administrator at a major public university. In chapters that range from the changing structure of the American family and its impact on both curriculum and university benefits policies to recommendations for overhauling the culture of decision making on campus, this former Dean of the College of Humanities at the University of Arizona explores the present state of higher education and offers a sobering view of what lies ahead.In this volume Kolodny explains the reasons for the financial crisis in higher education today and boldly addresses the challenges that remain ignored, including rising birthrates, changing demographics both on campus and across the country, the accelerating globalization of higher education and advanced research, and the necessity for greater interdisciplinarity in undergraduate education. Moreover, while sensitive to the complex burdens placed on faculty today, Kolodny nonetheless reveals how the professoriate has allowed itself to become vulnerable to public misperceptions and to lampooning by the media.Not simply a book about current problems and future challenges, Failing the Future is rich with practical solutions and workable programs for change. Among her many insights, Kolodny offers a thorough defense of the role of tenure and outlines a new set of procedures to ensure its effective implementation; she proposes a structure for an “Antifeminist Intellectual Harassment Policy”; and she provides a checklist of family-sensitive policies universities can offer their staff, faculty, and administrators. Kolodny calls on union leaders, campus communities, policymakers, and the general public to work together in unprecedented partnerships. Her goal, as she states in a closing coda, is to initiate a revitalized conversation about public education.This book should be required reading for all those concerned with the future of higher education in this country—from college trustees to graduate students entering the professoriate, from faculty to university administrators, from officers of campus-based unions to education policymakers.",
  "genres": [
    "Education"
  ],
  "author": "Annette Kolodny",
  "average_rating": "3.85",
  "url": "https://www.goodreads.com/book/show/2504336.Failing_the_Future"
}