{
  "title": "True Choices",
  "description": "A DARK ROMANCETrue Choices is the third book in a series that includes two alternative endings. See for yourself why fans are saying this makes all the other dark romances look like greyed out shades of fairytales. WIN OR LOSE Max leads; Lucy follows. How far he’s willing to push her may test both their limits though. With his prize in sight, Max can’t afford to relinquish control now. DO OR DON’T Lucy embraces all that Max offers, giving exactly what is demanded of her. How far she’s willing to go in order to please him may have her facing the ultimate True Choices.NOTE: All the books in this series are available for purchase/download now, so you won’t be left wanting or waiting. This series involves a combination of Domestic Discipline, D/s, and SmNow available in paperbook too!Excerpts:\"Lucy, I understand that you're trying. I know you want to be respectful and you're figuring out your limits. And I want to help you.\" His hand moves my chin gently back to look at him, but his voice is edgier. \"Look at me when I'm talking to you.\" He drops his hand and I keep my eyes on him while he continues. \"You may ask me to reconsider a decision, but giving me your reasons for wanting me to is tantamount with arguing. Try again.\"…..What if I couldn't give him something that he demanded? What if he couldn't control everything about me? What would happen to us if I couldn't bend to his will no matter how hard I would try? I shudder and put my arms around my middle, hugging myself. I'm not ready to face a possible darkened future. A day that I couldn't give in to Max's needs.I shake my head a final time, close my eyes and breathe in normally. I let go of my waist and square my shoulders. But I keep my head down. I'll do whatever it takes to make Max happy. Whatever is in my power to do.",
  "genres": [
    "Dark",
    "BDSM",
    "Abuse",
    "Dark Romance",
    "Erotica",
    "Contemporary",
    "Romance"
  ],
  "author": "Willow Madison",
  "average_rating": "3.70",
  "url": "https://www.goodreads.com/book/show/25049107-true-choices"
}