{
  "title": "True Nature",
  "description": "DARK ROMANCEA warning comes with this book. It’s not a typical hearts and flowers romance. There are thorns and it’s not for the faint-of-heart. LOVE OR LEAVEMax, true to his nature, takes control right from the start. Lucy has no choice but to give in. As she fights to understand her willingness to give him everything, he pushes her for more.STAY OR GOTheirs is a journey with many a twist and turn, but isn’t love always? It’s the slow build that happens when sweet and shy meets determined and dominant.In the end, the choice is clear. Stay or go. Love or leave. Be what is needed or turn away from True Nature.This is the start of something darker. True Nature is the first book in a series that includes two alternative endings. See for yourself why fans are saying this makes all the other dark romances look like greyed out shades of fairytales. NOTE: All the books in this series are available for purchase/download now, so you won’t be left wanting or waiting. This series involves a combination of Domestic Discipline, D/s, and SmNow Available in Paperback too!Excerpts:Max is a gentleman. A very old fashioned guy. He explained to me. That previous girlfriends had claimed he was chauvinistic, misogynistic, a bully, possessive, antiquated, abusive. He used those words. And he said he didn't care if that's how today's world would view him. He only cared about being true to himself...and about how I viewed him. Therein lies the problem...how do I view him? How do I reconcile the loving, gentle man who takes such attentive care of me, to the one who makes me wet ordering me around, to the one who scares me with how much he demands?! I don't know what to think!.....I lift Lucy's chin to my face. She slowly raises her eyes. The most beautiful light blue, the lids a little red from crying. \"Let me see you.\" She blinks the last of her tears away as I turn her face to the right. \"You'll have a mark.\" She tries to jerk her head away, but I hold her in place. Only her eyes dart to me, the fear back in an instant. \"You can look in a minute.\" I let go of her face, putting my hand back around her waist. She's still shaking a little. She sniffs and starts to lower her face again.\"You have one more thing to do before you can wipe your face and nose.\" Her head jerks back up. I love how responsive she is...how open she is. Her eyes tell me so much...fear, hope, and that beautiful look of shame again. \"You have to say you're sorry for misbehaving.\"",
  "genres": [
    "Dark",
    "BDSM",
    "Abuse",
    "Romance",
    "Dark Romance",
    "Erotica",
    "Contemporary"
  ],
  "author": "Willow Madison",
  "average_rating": "3.29",
  "url": "https://www.goodreads.com/book/show/25049076-true-nature"
}