{
  "title": "The Stolen Child",
  "description": "Synopsis The Stolen Child is the story of Henry Day, a seven-year-old kidnapped by a strange group living in the dark forest near his home. No ordinary kidnappers, they are the fairy changelings - ageless beings whose secret community is threatened by encroaching modern life. They give Henry a new name, Aniday, and the gift of agelessness - now and forever, he will be seven years old. In keeping with folk tradition, the group has left another child in Henry's place. This changeling boy, who has morphed himself into Henry's duplicate, must adjust to a completely new way of life and hide his true identity from the Day family. But he can't hide his extraordinary talent for the piano (a skill the real Henry never displayed), and his near-perfect performances prompt his father to suspect that the son he has raised is an imposter. As he grows older the new Henry Day becomes haunted by vague but persistent memories of life in another time and place, of a German piano teacher and his prodigy. Both Henry and Aniday search obsessively for who they were before they changed places in the world. Narrated in the alternating voices of Henry Day and his double, \"The Stolen Child\" is a classic tale of the search for identity and leaving childhood. With just the right mix of fantasy and realism, Keith Donohue creates a literary fable of remarkable depth and strange delights. The result is a bedtime story for adults, which will appeal to readers charmed and captivated by such recent bestsellers as \"The Time Traveler's Wife\" and \"Jonathan Strange & Mr. Norrell\" and by the classics by Tolkien and J.M. Barrie.  \nFrom the Publisher\n Inspired by the poem by W.B. Yeats about the common folk legend of the fairy changelings, this beguiling and truly original tale moves from contemporary America to nineteenth-century Germany and deep into humankind's most basic fantasies and fears.  \nAbout the Author\n \nKeith Donohue:\n Keith Donohue is Director of Communications for the National Historical Publications and Records Commission at the National Archives, and previously worked at the National Endowment for the Arts. He lives in Maryland, near Washington, DC. This is his first novel.",
  "genres": [
    "Fantasy",
    "Fiction",
    "Book Club",
    "Fairy Tales",
    "Magical Realism",
    "Adult Fiction",
    "Paranormal"
  ],
  "author": "Keith Donohue",
  "average_rating": "3.73",
  "url": "https://www.goodreads.com/book/show/1152031.The_Stolen_Child"
}