{
  "title": "Cataclysm of the Ancients",
  "description": "226 BC: Fall of the Colossus of Rhodes... 2015 AD: A Stolen C.I.A Document… An Explosion Rocks the Sphinx…  From ancient Greece, to the war-torn deserts of Syria, Robert Spire is thrust into an adventure which spans 2041 years. The hunt is on for ancient clues that must be solved…the countdown to the Cataclysm of the Ancients has begun…  226 BC: Fall of the Colossus of Rhodes.  The mighty statue of the Greek Titan Helios stood proudly in the port of the ancient city of Rhodes, Greece. Built to celebrate Rhodes' victory over the ruler of Cyprus in 305 B.C., it is one of the tallest statues of the ancient world, until it is destroyed after only 56 years.  Legend suggests it was destroyed by an earthquake, but legends can be wrong...  2015 AD: A Stolen C.I.A Document…  Langley Virginia: When CIA agent, Dr Vincent Kramer, is found brutally murdered in the facility’s parking lot, it becomes apparent that his death is linked to a missing document that was stored in the agency’s secret vault - A document detailing clandestine remote viewing experiments on the Great Sphinx in Egypt.  An Explosion Rocks the Sphinx…  Soon after the theft, an explosion damages the Sphinx, revealing a secret chamber within the ancient monolith. Upon hearing the news, the UK’s GLENCOM agency, keen to assist Egypt with a terrorist attack on one of its greatest historical monuments, sends their agent, ex-environmental lawyer, Robert Spire, together with archaeologist Professor Casey Carr to Cairo to investigate…  An Ancient Cataclysm Unleashed…  After persuading Egyptian authorities to let them inspect the newly discovered chamber, Spire and Casey make a remarkable discovery, one which leads the pair on a hunt for the remains of one of the lost Seven Wonders of the Ancient World - the legendary Colossus of Rhodes. Someone else is also hunting for the lost pieces of the ancient statue however. A group who believe that if they discover the final resting place of the colossus, they will also discover a secret more powerful than the Gods themselves, and when they do, they will unleash a cataclysm upon the modern world, the likes of which has never been seen before.  As Spire realises the seriousness of the deteriorating situation, he requests help from his old trusted friend, retired U.S. Marine, Travis Dexter. With the clock ticking to an unknown, but almost certain cataclysmic event, the pair race against time to unravel the ancient clues before it’s all too late…",
  "genres": [
    "Thriller",
    "Mystery",
    "Historical",
    "Adventure"
  ],
  "author": "Simon Rosser",
  "average_rating": "4.07",
  "url": "https://www.goodreads.com/book/show/25049511-cataclysm-of-the-ancients"
}