{
  "title": "Good Profit: How Creating Value for Others Built One of the World's Most Successful Companies",
  "description": "THE UNIQUE MANAGEMENT SYSTEM FROM A LEGENDARY CEOIn 1967, Charles Koch took the reins of his father's company and began the process of growing it from a $21 million start-up into a global corporation with revenues of about $115 billion, according to Forbes.So how did this MIT engineer manage grow Koch Industries into one of the largest private companies in the world today with growth exceeding that of the S&P 500 by almost 30-fold over the last five decades? Through his unique five-dimensional management process and system called Market-Based Management. Based on five decades of cross-disciplinary studies, experimental discovery, and practical implementation across Koch companies and their 100,000 employees worldwide, the core objective of Market-Based Management's framework is as simple as it is effective: to generate good profit.What is good profit? Good profit results when a company creates value for customers in a way that helps them improve their lives. Good profit is the result of innovations that customers freely vote for with their own dollars; it's the result of business decisions that create long term value for everyone--customers, employees, shareholders, and society.While you won't find the Koch Industries name on your home's stain-resistant carpet, your baby's more comfortable but absorbent diapers your stretch denim jeans, or your television with a better clarity screen, MBM(TM) drove these innovations and many more.Here, drawing on revealing, honest stories from his five decades in business - the company's many successes as well as its stumbles - Koch walks the reader step-by-step through the five dimensions of Market-Based Management to show stockholders, entrepreneurs, leaders, students -- and innovators, supervisors and employees of all kinds, in any field --how to apply the principles to generate Good Profit in their organizations, companies, and lives.From the Hardcover edition.",
  "genres": [
    "Business",
    "Economics",
    "Nonfiction",
    "Leadership",
    "Entrepreneurship",
    "Management",
    "Biography"
  ],
  "author": "Charles G. Koch",
  "average_rating": "3.86",
  "url": "https://www.goodreads.com/book/show/25058203-good-profit"
}