{
  "title": "I'm Not Myself These Days",
  "description": "I Am Not Myself These Days is Josh Kilmer-Purcell's outrageously intimate memoir of a young man living a double life in the heady days and nights of mid-'90s New York City. As we follow Kilmer-Purcell through alcohol-fueled nights and a love affair with Jack, a crack-addicted male escort, he offers up an alternative universe where normal is \"a Normal Rockwell painting that, if you leaned in close, would discover is made up entirely of misfits.\" By day, Josh drudges off to a Soho-based advertising firm where he creates ad campaigns for corporate clients. At night, he dons live goldfish to complete the look of Aqua, a 7-foot-tall award-winning drag queen who trolls gay clubs in search of her next drink/one night stand. In between, he spends his time trying to build a stable, loving relationship with someone whose beeping pager is a constant reminder of the pair's almost inevitable fate. Yet even as Josh's escapades get increasingly absurd, Kilmer-Purcell is always there to remind us that the story we're reading is real, and that fundamental human emotions and desires are essentially universal. In the end, everyone just wants to be loved and to fit in somewhere. And while the lesson may seem hokey at times, Kilmer-Purcell's sharp wit rescues the memoir from becoming an exaggerated sob The night before any major holiday is always a blockbuster night at gay clubs. Thousands... across the city fortifying themselves for long trips home where they'll be met with awkward silences, stilted conversations and cousins with whom they'd experimented with decades ago. From start to finish, I Am Not Myself These Days is an extraordinary journey into an amazing life. To be a fly on the wall is an adventure that should not be missed. --Gisele Toueg",
  "genres": [
    "Memoir",
    "Nonfiction",
    "LGBT",
    "Humor",
    "Queer",
    "Biography",
    "Book Club"
  ],
  "author": "Josh Kilmer-Purcell",
  "average_rating": "3.96",
  "url": "https://www.goodreads.com/book/show/250539.I_m_Not_Myself_These_Days"
}