{
  "title": "يا ليتني كنت هنديا",
  "description": "الكتاب عبارة عن وقفات تربوية تحدث لأي فرد في الأسرةـ أحب أولادي و أحب طب الأسنان  ـ في حب أولادي نشرت هذا الكتاب التربوي ، وفي حب طب الأسنان سيكون كتابي المقبل #عيادة_الأسنان_نعمة   بعرض رأيك في هذا الهاشتاق تكون قد شاركتني تأليف هذا الكتاب طبيبة أسنان أعمل في عيادات الجمان لـ : طب الأسنان والجلدية في الخبر @ـ‪aljumanـ كاتبة ،نشرت مقالاتي في الصحف والمجلات ومواقع النت آخرها في موقع \" لها أون لاين \" ـ إن أعجبك كتابي فاهده لمن تحب وإن لم يعجبك فإنني أعتذر لك‪   drbushra.allahu@gmail.com@Bushra_allahu Dr_Bushra_  قالوا عن الكتابقرأت الكتاب كاملا حتى ختمته بجلسة صباحية واحدة. ً.الكتاب خفيف، مشرق، بأسلوب يخلو من الثقل في الاسترسال السردي موجها الكلمة كسهم مرق خاطفاً ليصيب عين الهدف، بلا وقفات ولا انحناءات.  نجيب الزامل   الكتاب أشبه بالمائدة المتنوعة الأصناف ، وكل ما عليها شهي ندي يغري القارئ بالمضي في القراءة باستمتاع وإحساس بالفائدة، مع رشاقة التعبير ، وسلاسة الأسلوب الذي يميل كثيرا إلى الأسلوب القصصي ، فلا تعقيد ولا تصنع ، مع صور جميلة تزين الكلام ، كل ذلك يجعل الكتاب قريبا إلى نفوس القراء يقرؤونه ويسعون إلى أن يقرأه الآخروند مأمون فريز جرار  بحس أدبي جميل. وأسلوب ممتزج بعاطفة أمومة جياشة...تنقلنا الى تلك المواقف بتفاصيلها الدقيقة ... فنعيشها ... ونتصور اللحظة ...فنقترب من الصورة ... حتى نكاد نلمسها ... بل وربما نشتم رائحتها ...تطغى الروح المرحـــــــــــــــــــة على المكان ... فتضيف للفائــــــــــــــــــــــدة متعــــــــــــــــــةــ ...د فوزية البراهيم  تسحبنا الكاتبة بنعومة  لتدخلنا تلك الغرف الخلفية من ذاتنا ، ولتوقفنا في (آخر الكلام ) وجها لوجه أمام ما كنا نخفيه وراء ظهورنا ، ولتحكي تجارب هي أقرب ما تكون لتجاربنا ، وكأنها تقول لنا هذه حياتنا وهذه هي مشاكلنا أبسطها أمامكم فما هو آخر كلامكم فيهاأ.ذكاء محمد رواس قلعجي .         ياليتني كنت هنديا  في أحد الشوارع الخلفية لعمارات أبو ظبي السكنية، تسابق أمامي عشرات من الصبيةالهنود قد اعتمروا طاقية ،وبيد كل منهم مصحف ،وحين تساءلت عن الخبر ،قالوا هذا مسجد أقام به الهنود حلقة لتحفيظ أطفالهم القرآن ، وتكرًر المنظر نفسه في سوق دبي الشعبي.استضافتني جارة هندية في أمريكا ،وكان زوجها يعمل سائق تاكسي ،وعندهما طفلة ذات إعاقة، وتحتاج إلى رعاية صحية، ورغم كل هذا ،حين سألتها أين ولداها ،أجابت والبشر يفيض من وجهها :أبشرك ،لقد تمكنا من توفير المال اللازم ،و وأرسلناهما لمدينة أخرى في أمريكا، حيث يتفرغان لحفظ القرآن كاملا لمدة سنتين ،وينقطعان عن الدراسةأثناءهما ، بينما يتكالب الطلبة المبتعثون على تدريس صغارهم اللغة الانجليزية ،ولم يطرأ على ذهن أحد أن يقوم بتحفيظ أطفاله القرآن هناك.ورأيت بنيات الهنود الصغيرات قد ارتدين الحجاب في مسجد في فانكوفر بكندا وقد انضممن في حلقة لحفظ القرآن بعد صلاة الجمعة.في الدمام أذهب ببنيتي لمدرسة الانجليزي الخاصة ،و هي أرملة هندية فقيرة مسكينة ،وتواجه صعابا جمة في التعامل مع بيروقراطية مشاكل الإقامة ،رأيت حرصها على تعلم فتياتها القرآن ، فأسررت لها أن ابنتي قد أتمت حفظ القرآن كاملاففرحت وسألتني :في كم سنة أتمت ابنتك حفظ القرآن ؟فأجبت :حفظته عبر مدارس تحفيظ القرآن في٩ سنوات ٦ سنوات المرحلة الابتدائيةو ٣ سنوات هي المرحلة المتوسطةفشهقت المدرسة :ماذا تسع سنوات ؟ !نحن الهنود يحفظ أبناؤنا القرآن في سنتين.انظري لابن أخي بعد تخرجه من الثانوي ،التحق بحلقة لحفظ القرآن في الهند ، ثم عاد إلي الدمام ، وأقمنا له حفلا في صالة الأفراح ،كيف أنتم تتحدثون العربية وتحفظون القرآن في تسع سنوات؟!!بالطبع لم أخبرها أن مدرسة تحفيظ القرآن حكومية ،لا ندفع مقابلها أي رسوم ،بل تعطي مكافآت تشجيعية ،ولم أخبرها أن ابنتي كانت تقريبا الوحيدة في أهلي حافظة قرآن.ولم أخبرها أن كل ما حفظته ابنتي من القرآن ،لم تقم بمراجعته ،لأنها التحقت في المرحلة الثانوية بمدرسة خاصة ، قوية في اللغة الانجليزية ، لتؤهلها لدراسة الطب. ورغم هذا كله لا أخبرأحدا عن حفظها للقرآن حتى بعد أن توقفت عن مراجعته خوفا من العين.بقي أن أخبركم أن هذه الأرملة تحضر شيخا إلى بيتها لتحفظ أطفالها القرآن.الشاهد أن كل هنديين في أي بقعة من بقاع العالم ، لا بد أن يكون ثالثهما برنامج عملي ناجح في تحفيظ ذريتهما القرآن ،فهم يعتقدون أن حفظ القرآن من أركان الدين، فكيف يصلي المسلم وكيف يعبد الله دون أن يقرأ القرآن ؟!!تقول صديقة لي :سكنت في عمارة سكنية ضخمة سكانها متعددو الجنسيات ، فلاحظت عجبا،يرتاد مدرسو اللغة الانجليزية والموسيقى الشقق العربية ،ويرتاد الشقق الهندية مدرسو القرآنأخذني الحماس قلت لولدي :ما رأيك أن نحفظ القرآن؟فرد ولدي ردا صاروخيا: لماذا؟! هل أنا هندي؟فتنهدت صاحبتي وتنهدت معها:يا ليتني كنت هنديا       -حافية القدمينسمعت بعض أحاديث رسول الله صلى الله عليه وسلم عن الحفاة العراة ولكن لم يدر بخلدي أنني سأراهم على الهواء مباشرة، أما العراة فالحمد لله تكفلت الدولة بستر آخر عار في بلدي، أما الحفاة فما زالوا كثر.تنفست الصعداء بعد أن أنهيت علاج جميع المراجعات المسجلات في جدول مواعيد الفترة الصباحية في المستشفى، وبينما كنت أفكر بكيف أحتفل بهذه المناسبة، هل أشرب كوب شاي وثمنه ريال من بقالة المستشفى التي تصر إدارتها على أن نسميها كافتيريا، وإن كنت أظن أن اسم بقالة هو ظلم لها، فكان أجدر أن تُسمى مستودعا أو مخزنا، أو أي أمر لا تنطبق عليه الشروط الصحية.. أم أزور إحدى الموظفات الإداريات لآكل عندها ما لذ وطاب مما أحضرنه معهن، أم أحادث أمي.. ما هي إلا ثوان معدودة إلا وسمعت ضجيجا عند الباب وإذا بامرأة تقتحم العيادة، حافية القدمين.وقفت أمام الباب وقالت: \"أنا قادمة من بعيد، من البر))\".. الكتاب واضح من عنوانهـ والمطلوب؟! .. لا تستعجلوا الأمر.. بدوية من الصحراء ستلقي ما تريد دون مقدمات وبلا رجاء وبلا إتيكيت.قالت: \"ضرسي يوجعني ورفضوا أن يدخلوني، قالوا يجب أن أحضر تحويلا من مستوصف\".. تأملتها مليا، راودتني نفسي، لم أعالجها؟ لقد أنهيت عدداً من المرضى أعلى من الحد الأقصى الذي تحدده أدنى منظمة صحية.. وأصبحت أضع مبررات لنفسي لا يحق لها العلاج، فهي ليس لديها ملف ،وقد أعرض نفسي للمساءلة.لقد ملأت العيادة برائحة قوية، فكتمت أنفاسي حتى إنني انتظر خروجها لأرش معطر الجو، واتسخت الأرض من أثر قدميها الحافية.. فكيف لو اقتربت منها أكثر!.. ليس عندها حتى أسلوب في الحديث، يجعل قلبك يحن عليها، فلم أعالجها؟!.. ما يؤلمها بحاجة لوقت طويل من العمل وأنا جسدي مرهق وبحاجة إلى كوب شاي.النتيجة لن أعالجها .. ولن أسأل عنها دنيا أو آخرة .. ولكن شيئا في داخلي بدأ يطرق وخفقان يدب، وكنت حديثة عهد بأمومة، ويبدو أن جرعة حنان زائدة قد طفت على السطح.. لم لا أعالجها؟! أليست مواطنة؟ وهذا بلدها، وأنشئ هذا المستشفى الحكومي لأمثالها.قذرة الثياب، نعم، ليس لها ملف، نعم، دون موعد، نعم، ولكن لم أعاقبها بذنب لم ترتكبه هي، وجهلها هو نتاج تقصيرنا بتوعيتها، وأين ستذهب؟ وكيف لي أن أتركها بهذا العذاب.ارحموا من في الأرض يرحمكم من في السماء. هذا الصوت الذي سمعته، ولربما برحمتي لها ترحم العاملة رضيعتي، التي أتركها تحت رحمتها ،بعد أن رفضت إدارة المستشفى إجازة الأمومة ،وألزمني ذل الوظيفة أن أتنازل عن أمومتي لعاملة لا أدري أين أمضت حياتها، أأمضتها في سجن؟!! أم في مصحة نفسية ؟!!أم في إصلاحية؟!!، الله أعلم.عالجت البدوية وتلطفت في معاملتها، وهذا جزء مهم في إنجاح العلاج، فضعفاء القوم يأسرون قلبي وأرى فيهم أجرا مضاعفا، فأنت تنصر من لا ناصر لهم إلا الله.انتهينا، وولت قبل الباب، ففاجأتني بالتفاتة ورفعت أصبعها إلى السماء وهي تشير نحوي وبدأت تهذي بكلام في بادئ الأمر ظننته شتما وقدحا، لصعوبة لهجتها، حتى تبين لي أنها تدعو لي أن يفرج الله لي كل هم ومكروب، وأن يوفقني ويسدد خطاي.. سرت قشعريرة في جسدي فمن النادر أن تسمع هذا الدعاء من أمثالها ولكن عظم ما كانت تعانيه جعلها تفرح وتعبر عن سعادتها بالدعاء.. واستمرت بالدعاء، وراودتني نفسي أن أطلب منها أن يسخر الله عاملتي لرضيعتي الضعيفة، ولكن حفظا لما بين الطبيب والمريض من حاجز امتنعت عن ذلك، ذلك الحاجز الذي يسميه البعض كبرا.وما زالت في دعائها حتى رحمت ذلها..ـ.. أختي أنا لم أعالجك من جيبي، هذا حق من حقوقك، وهذا المستشفى هو ملك الدولة واحمدي الله الذي سخر لك ولأمثالك من يبني لهم المستشفيات.",
  "genres": [],
  "author": "د بشرى عبدالله اللهو",
  "average_rating": "2.40",
  "url": "https://www.goodreads.com/book/show/25055127"
}