{
  "title": "Dubious Knowledge: Doubtful Facts, Twisted History and Other Humorosities",
  "description": "If you like learning with a lively dose of laughter, you'll love this hilarious book full of fishy facts, twisted history, and general “Dubious Knowledge” from award-winning humor columnist Dan Van Oss.  Collected from the best of his weekly “Dubious Knowledge Institute” humor column, these 25 side-splitting features will keep you laughing while you learn about:   The Fourth of July: “In Philadelphia, ships were decked out in red, white, and blue bunting, while an official dinner for the Continental Congress was held to determine what ‘bunting' was.”   Chocolate: “The botanical name of the chocolate plant is Theobramba cacao, which is, coincidentally, the same sound your lower intestine makes after eating an entire bag of M&Ms.”   Lawn care: “The difference between a fertilized lawn and an unfertilized one is about $200.”   Father’s Day: “Father's Day was created to complement Mother's Day, because, without fathers, we wouldn't have anyone to forget to get a card for Mother's Day.”   The Kentucky Derby: \"Women attending the race traditionally wear large, elaborate hats, which are used to hide the fact that they are drinking so many mint juleps.”    Evoking the laugh out loud wit of classic humor columnist Dave Barry, and the British quirkiness of Douglas Adams and Monty Python, Dan expertly melds fact and fiction into a zany mixture of learning and laughter. Guaranteed to make you laugh or your money back!    About the Author  Dan Van Oss grew up reading just about everything he could borrow from the town library, although admittedly sometimes just to get the sticker segments so he could complete the Reading Centipede for each book he finished. He’s a Midwest guy, having spent time in Michigan and Kentucky, but mostly Iowa, where he now lives. He started writing during college, where he enjoyed getting red lines drawn through his Creative Writing projects, and where he also penned a weekly column in the school paper under the pseudonym “Fletcher Ford”. He’s currently working on his Survival Guide for Men series, which will include books on Home Improvement and Sports. You can catch his weekly humor column called the Dubious Knowledge Institute at his author site, danvanoss.com.",
  "genres": [
    "Nonfiction",
    "Humor",
    "Amazon"
  ],
  "author": "Dan Van Oss",
  "average_rating": "3.17",
  "url": "https://www.goodreads.com/book/show/25063128-dubious-knowledge"
}