{
  "title": "Bound Beneath His Pain",
  "description": "The USA Today bestselling author of the Club Sin novels kicks off a deeply sensual new series by introducing readers to Micah, a man who takes what he wants—until he meets the one woman he needs.  Real estate mogul Micah Holt exerts absolute control over all aspects of his life. As a founding member of the Dominants Council that oversees San Francisco’s BDSM club scene, he keeps his dark side hidden away in the dungeon. There, he’s always in command of his subs, fearful of what shameful desires might be released if his firm hand should ever slip. Then Allie Bennett shakes his legendary discipline. She’s beautiful, pure, untainted. But is Micah willing to sacrifice her innocence for his own selfish obsessions?   When that sexy smile makes her body burn, Allie tries with all her might to ignore it. For one thing, Micah’s her new boss. For another, he’s as complicated as he is devastatingly handsome. Still, Allie can only fight so much before she gives in to his dangerous games. She knows he’s got dark secrets. But when she discovers the true depth of his pain, Allie must decide how far she’s willing to go to light the way for love.  Micah is intended for mature audiences.  Praise for Stacey Kennedy’s Club Sin series  “Claimed sucked me in! Stacey Kennedy weaves together the intense BDSM lifestyle with the soft touch of a sweeter, more traditional love story in a novel with an engaging heroine at its heart.”—J. Kenner   “Bared is a seductively haunting tale of control and surrender that will tantalize existing fans of the series while enticing new readers into the passionate world of Club Sin.”—Eliza Gayle   “Desired is sexy, sensual, and totally seductive. Stacey Kennedy sure knows how to make a girl swoon.”—Tracy Wolff   “Freed is fabulous! Stacey Kennedy’s a master at creating steamy and heartwarming romance, where the BDSM lifestyle is inextricably bound with compelling emotion and unforgettable characters!”—Virna DePaul   “Tamed is sexy, sinful, and addictive. You won’t want to put this book down!”—Jen McLaughlin  Includes a special message from the editor, as well as an excerpt from another Loveswept title.",
  "genres": [
    "Romance",
    "BDSM",
    "Erotica",
    "Contemporary Romance",
    "Erotic Romance",
    "Contemporary",
    "Fiction"
  ],
  "author": "Stacey Kennedy",
  "average_rating": "3.98",
  "url": "https://www.goodreads.com/book/show/25063632-bound-beneath-his-pain"
}