{
  "title": "Timeskip",
  "description": "Its opening sentence, \"Every time it rains a ghost comes walking,\" is the perfect start to this bittersweet short story about the hesitant first steps of a relationship. Featuring Newford fiddler Geordie Riddell, it's a gentle story of love, loss and the bonds of friendship. First published in Post Mortem edited by Paul F.Olson and David B. Silva, 1989; also appears in Dreams Underfoot and The Very Best of Charles de Lint Timeskip is where Newford \"Newford was not planned out in advance. It started (unbeknownst to me) with“Timeskip,” a short story that I wrote for an anthology. I wanted to set the story somewhere other than the Ottawa area where most of my stories had taken place, but I didn’t feel comfortable writing about a city that I couldn’t physically visit. So I decided to use various aspects of large urban centers that I had visited, and create a fictitious setting.\" –Charles de Lint, from an interview with FairyRoom.com \"I can never recapture the feeling of first arriving in Newford and meeting the people and seeing the sights as a newcomer. However, part of the beauty of Newford is the sense that it has always been there, that de Lint is a reporter who occasionally files stories from a reality stranger and more beautiful than ours. De Lint also manages to keep each new Newford story fresh and captivating because he is so generous and loving in his depiction of the characters. Yes, there are a group of core characters whose stories recur most often, but a city like Newford has so many intriguing people in it, so many diverse stories to tell, so much pain and triumph to chronicle.\" — Challenging Destiny Charles de Lint is the modern master of urban fantasy. Folktale, myth, fairy tale, dreams, urban legend—all of it adds up to pure magic in de Lint's vivid, original world. No one does it better. — Alice Hoffman Charles de Lint writes like a magician. He draws out the strange inside our own world, weaving stories that feel more real than we are when we read them. He is, simply put, the best. — Holly Black De Lint is probably the finest contemporary author of fantasy – Booklist, American Library Association Unlike most fantasy writers who deal with battles between ultimate good and evil, de Lint concentrates on smaller, very personal conflicts. Perhaps this is what makes him accessible to the non-fantasy audience as well as the hard-core fans. Perhaps it’s just damned fine writing. – Quill & Quire De Lint’s evocative images, both ordinary and fantastic, jolt the imagination. – Publishers Weekly It is hard to imagine urban fantasy done with greater skill – Booklist, American Library Association",
  "genres": [
    "Fantasy",
    "Urban Fantasy",
    "Short Stories",
    "Fiction"
  ],
  "author": "Charles de Lint",
  "average_rating": "4.40",
  "url": "https://www.goodreads.com/book/show/25064074-timeskip"
}