{
  "title": "The Bolingbroke Chit",
  "description": "Earning the nickname Lady Agony was no minor achievement for Lady Agatha Bolingbroke. It required a great deal of effort to make herself so disagreeable, but she did it for a good The fewer invitations she received, the more time she had to paint. Her mother, refusing to accept an unpopular daughter—or, worse, a talented one—insists on dragging her to every event of the season.To thwart her parents and to vent her frustration, Agatha creates a wicked alter a caricaturist whose mocking illustrations take ruthless aim at the ridiculousness of the ton. Her most recent target is Viscount Addleson, whom she dubs Viscount Addlewit for his handsome but empty head. Then one of Agatha’s drawings goes too far and a villain threatens to reveal her true identity if she doesn’t comply with his demands.Now she has an impossible choice—ruin herself or an innocent young lady—and to her utter amazement the only person who can help her is Lord Addleson, whose handsome head, upon closer inspection, isn’t empty at all and whose eyes are full of mischief.Suddenly, she finds it very difficult to be disagreeable to him.————————————————————Readers find Love Takes Root Series wonderfully This book was absolutely delightful! - Noorammk, Goodreads Reviewer ⭐⭐⭐⭐⭐OMG! I love this series. - PLP, Goodreads Reviewer ⭐⭐⭐⭐⭐Excellent plot and filled with intrigue! I adored the heroine and her hoydish, devil may care attitude! - Lisa, Goodreads Reviewer ⭐⭐⭐⭐⭐It is a delight, and my favorite of the series. It is full of impertinence & delightfully devious thinking. - Barbie, Goodreads Reviewer ⭐⭐⭐⭐⭐Oh, what a grand adventure! The whole story was wrapped in layers of intrigue and distrust. What fun I had peeling those layers away page after page. - Charlotte, Goodreads Reviewer ⭐⭐⭐⭐⭐",
  "genres": [
    "Romance",
    "Historical Romance",
    "Historical",
    "Historical Fiction",
    "Regency",
    "Fiction",
    "Regency Romance"
  ],
  "author": "Lynn Messina",
  "average_rating": "3.99",
  "url": "https://www.goodreads.com/book/show/25061477-the-bolingbroke-chit"
}