{
  "title": "Khimera",
  "description": "Tras el éxito de la trilogía «Versos, canciones y trocitos de carne», un thriller literario que algunos ya han calificado de obra Khimera.2054. Tras la Guerra de Devastación Global, la realidad social y geopolítica ha cambiado rotundamente. Los viejos conceptos de la democracia y el capitalismo han sido enterrados por las corrientes transhumanistas y la tecnofagia. El poder se concentra en manos de las grandes corporaciones, sin embargo, todavía queda un cabo suelto, un molesto inconveniente que se escapa de las afiladas uñas de la Khimera.En la arriesgada búsqueda de un enigmático personaje conocido como el bogatyr -héroe para algunos y villano para otros-, están puestas las últimas esperanzas de aquellos que luchan para lograr que el mundo cambie para siempre.César Pérez Gellida, autor de la trilogía «Versos, canciones y trocitos de carne», éxito absoluto de crítica y ventas en el último año, vuelve a la narrativa sobrepasando todas nuestras expectativas y rompiendo sus propios cánones con un relato que estilísticamente recuerda a la habilidad creativa de J.R.R. Tolkien y a la maestría visionaria de George Orwell o William Blake. Una reinvención del thriller literario al más puro estilo Gellida que algunos ya han calificado de obra maestra.Reseñ «Toma aire antes de abrir la primera página, pues no podrás respirar hasta que acabe el libro.» Juan Gómez Jurado«Khimera es una tormenta de adrenalina que nos transporta a un futuro tan tangible que tiene que ser cierto. Una novela con cámara al hombro de la que se seguirá hablando en el año 2054. Inmortal, como Blade Runner.» Ramón Palomar, Las Provincias«No me extrañaría que dentro de unos años mis descendientes leyeran un reportaje para comprobar lo cerca que estuvo Pérez Gellida de ver el futuro.» Rebeca García Cortés, Qué leer«La estructura, el ritmo y sobre todo el final es de las cosas más brillantes que he tenido la oportunidad de leer jamás.» Luis Endera, director de cineEn los blogs... «Pocas veces me ha impresionado una novela como en esta ocasión. Khimera es una sorpresa que va in crescendo página a página. Una locura que no deberías perderte bajo ningún concepto.» Blog Kayena libros«Con ese estilo cinematográfico tan característico de Pérez Gellida que te invita a presenciar la acción desde una hipotética sala de montaje.» Blog El busca libros«Khimera es algo más, es algo lo suficientemente diferente para que se salga de la línea marcada por lo común, rozando en ocasiones la excelencia que todo escritor pretende marcarse a la hora de ponerse a escribir.» Blog A golpe de letra«Khimera es una novela redonda, una obra audaz y ambiciosa con la queel autor nos demuestra que ha crecido y que vino para quedarse en el panorama literario.",
  "genres": [
    "Thriller",
    "Science Fiction",
    "Spanish Literature",
    "Science Fiction Fantasy"
  ],
  "author": "César Pérez Gellida",
  "average_rating": "3.58",
  "url": "https://www.goodreads.com/book/show/25063475-khimera"
}