{
  "title": "Finding Miranda",
  "description": "Nobody \"sees\" Miranda Ogilvy except the hunky blind deejay next door and the men hired to kill them both. Murder, political corruption, quirky small-town neighbors, and Dave the Wonder Dog work together to make this mystery fun, romantic, and satisfying.  Detailed Plot Summary:  Miranda Ogilvy is accustomed to being invisible. Sometimes people actually see her, but they forget her almost immediately. It’s not a bad life for a ghost, but Miranda is not a ghost. She’s a librarian.  The problem may be that Miranda lives in a big, busy city. So when her aunt dies suddenly and leaves Miranda a century-old cottage forty miles beyond the middle of nowhere, Miranda makes the life-changing move from Miami to Minokee.  Moving doesn’t solve the problem, however; people still don’t notice Miranda. The only two people who seem all too aware of her are a handsome neighbor (way out of her league) and the man who murdered her aunt (too late to move back to Miami?).   Shepard Krausse is a late-night radio talk show host, but it isn’t because he “has a face for radio,” as the saying goes. In fact, Shepard is such a hunk that the little old ladies in his tiny Minokee community set their clocks every day in order to be on their front porches sipping coffee and watching through binoculars as he takes his morning run. Shep waves to the ladies (Psst! Bernice, yer droolin; on yer apron.), but he has never seen them. Shep has been blind since birth. His best friend (and guide dog), Dave, goes everywhere with him, including on the morning run. (Shepard’s the cute one; Dave’s the smart one.)  Shepard’s radio show, “Sheep Counters with Shep and Dave,” caters to insomniacs whose paranoia and conspiracy theories are keeping them awake. People enjoy venting their rage on the air, and Shepard’s audience enjoys, in about equal numbers, either agreeing with or ridiculing his callers.  Shep has a conspiracy theory of his own. He believes his uncle, the governor of the state of Florida, is corrupt in a big way, and may even be behind the murder of Shepard’s former neighbor, Phyllis Ogilvy.   Miranda is small, plain, and, of course, invisible. Shepard is the size of a professional television wrestler and, of course, resembles Adonis. She squeaks by on a librarian’s salary, still wearing clothes she owned in high school. His matching outfits are laid out for him every morning by his chauffeur/valet. She has learned four languages by listening to CDs in her car. He speaks seven languages, which he learned while in boarding school in Switzerland. Her aunt was a small-town librarian and part-time birdwatcher. His uncle is the governor of Florida, and his mother acts like the Queen of England. Miranda attended a community college. Shepard has an Ivy League law degree. Not since the owl and the pussycat has there been a more unlikely pair.   Now that Miranda has moved into Minokee, however, Shep and Dave are determined to protect their new neighbor from the bad guys. They just need to find out who or what the villains are. Miranda and Shep don’t know that soon, on a steamy Florida night, the city girl and the blind deejay will be running for their lives in the inky darkness of Little Cypress National Forest.",
  "genres": [
    "Mystery",
    "Romance",
    "Mystery Thriller",
    "Contemporary",
    "Fiction",
    "Audiobook",
    "Cozy Mystery"
  ],
  "author": "Iris Chacon",
  "average_rating": "4.05",
  "url": "https://www.goodreads.com/book/show/25063862-finding-miranda"
}