{
  "title": "My Best Friend's Brother",
  "description": "Fire, meet Gasoline. Attractive, young and equally strong-headed, Scarlett Sommerfield and Dev Bashir were never meant to be a match--at least if his very wealthy and traditional Indian parents have anything to say about it. So it's a good thing that they've despised each other for most of their young lives.But that's about to change. Growing up poor and motherless, smart and ambitious Scarlett is graduating from high school and becoming a new adult in the big scary world without a safe place to land, so when she's invited to move in with her best friend's palatial home on the right side of the tracks for her senior year, things couldn't be better.There, she finds security and kindness--with the exception of her best friend's brooding and arrogant older brother, Dev, who returns home from college struggling with his own demons and seemingly focused on making her the object of his contempt. Over time--and some ill-timed run-ins--Scarlett learns that he's not at all what he seems, and a forbidden love sparks between them, burning out of control when she least expects it. But when there's fire, there's smoke, and controlling Mrs. Bashir catches onto their young romance...and everything goes to hell.Steeped in outdated rules and traditions about love and marriage, the matriarch of the Bashir Family makes no secret that Scarlett simply doesn't measure up as a match for their eldest son. And the very people who made her feel part of the family now want nothing more than to see her gone for good.Including her former best friend. Will Scarlett and Dev's love survive against his intolerant mother's sabotage, her personal misfortunes and a dark life-changing secret he's kept simmering just under the surface? Or will Scarlett end up back where she started: facing her future utterly alone.",
  "genres": [
    "Contemporary Romance",
    "Romance",
    "Contemporary",
    "Enemies To Lovers"
  ],
  "author": "Kennedy Claire",
  "average_rating": "3.85",
  "url": "https://www.goodreads.com/book/show/25059948-my-best-friend-s-brother"
}