{
  "title": "Twain & Stanley Enter Paradise",
  "description": "TWAIN & STANLEY ENTER PARADISE, by Pulitzer Prize-winning author Oscar Hijuelos, is a luminous work of fiction inspired by the real-life, 37-year friendship between two towering figures of the late nineteenth century, famed writer and humorist Mark Twain and legendary explorer Sir Henry Morton Stanley.\tHijuelos was fascinated by the Twain-Stanley connection and eventually began researching and writing a novel that used the scant historical record of their relationship as a starting point for a more detailed fictional account. It was a labor of love for Hijuelos, who worked on the project for more than ten years, publishing other novels along the way but always returning to Twain and Stanley; indeed, he was still revising the manuscript the day before his sudden passing in 2013.\tThe resulting novel is a richly woven tapestry of people and events that is unique among the author's works, both in theme and structure. Hijuelos ingeniously blends correspondence, memoir, and third-person omniscience to explore the intersection of these Victorian giants in a long vanished world.\tFrom their early days as journalists in the American West, to their admiration and support of each other's writing, their mutual hatred of slavery, their social life together in the dazzling literary circles of the period, and even a mysterious journey to Cuba to search for Stanley's adoptive father, TWAIN & STANLEY ENTER PARADISE superbly channels two vibrant but very different figures. It is also a study of Twain's complex bond with Mrs. Stanley, the bohemian portrait artist Dorothy Tennant, who introduces Twain and his wife to the world of séances and mediums after the tragic death of their daughter.\tA compelling and deeply felt historical fantasia that utilizes the full range of Hijuelos' gifts, TWAIN & STANLEY ENTER PARADISE stands as an unforgettable coda to a brilliant writing career.",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Historical",
    "Book Club",
    "Novels",
    "19th Century",
    "American"
  ],
  "author": "Oscar Hijuelos",
  "average_rating": "3.56",
  "url": "https://www.goodreads.com/book/show/25067001-twain-stanley-enter-paradise"
}