{
  "title": "Bo",
  "description": "Now available. From the world of Carolina Bad Boys . . . Bo Maverick is ex-Force Recon and a force to be reckoned with.Bo:I’m a lover, not a fighter. Yeah, right. Talk about bullshit. I’ve been fighting all my life, and I know zip about love. Frankly, I don’t want to. More than bullets whizzing past my head or the very real possibility of ending up dead, love scares the shit out of me. I’m used to guns and killing, blood and dust. Lust. That’s what I feel for this woman, my goddamn shrink, Veronica. Doctor Hartley digs inside my head. She asks me questions, which I never answer. I’d much rather take the smart, sexy Doc to bed, but I can’t because of our clinical relationship. My last Force Recon mission destroyed any semblance of humanity I had left. Those little triggers go off all the time now. When I’m asleep. When I’m awake. When the memories are raw. I bolt up, at knife point again, but there’s no enemy now. Just Veronica and me. Veronica:Veronica. Doctor Hartley. I told Bo to call me Ronnie like everyone else, but he refuses. He shows up like he has a cattle prod shoved up his ass and sits through the allotted hour for his counseling session impervious to every approach. He’s powerful, forceful, explosive. He doesn’t scare me. My marine doesn’t speak, but his sharp gaze pierces me all the same. He watches me with all the greed of a hunger never sated, a need never fulfilled. A desire never explored. He stows his secrets safely away, but I’m patient. I’ll get to him if he doesn’t get to me first. And when I have him? I’ll want him forever. I know this. But I can’t. His past might be complicated, but mine is a minefield, one that will blow up in our faces before all is said and done.Too bad. We could be so good together.Warning: Graphic sex, graphic action, graphic language. Triple X caution.",
  "genres": [
    "Contemporary",
    "Romance",
    "Family",
    "Military Fiction",
    "Erotica",
    "Contemporary Romance",
    "Suspense"
  ],
  "author": "Rie Warren",
  "average_rating": "4.20",
  "url": "https://www.goodreads.com/book/show/25069997-bo"
}