{
  "title": "A Calendar of Sin",
  "description": "Evelyn Scott's \"A Calendar of Sin\" is a compendium of the misfortunes of love. The book reveals persons all over a continent trying for an ecstatic and yet reposeful harmony with other persons—which is what love forces one to do; trying, and not getting very far. And in the procedure of aiming for that permanent keen stillness of self which love, fully possessed, brings, these persons always pretend, stumble, hurt, are hurt—and some kill and are killed.The first thing that the members of the three families with whom the book centrally deals, do, as they are seized by love and try to seize it—is pretend; they pretend in innumerable fashions, for they are frightened somewhere. And all their pretenses Mrs. Scott shows, casually, implicitly; lucidly, however, and with great aesthetic accomplishment. Mrs. Scott is terrifyingly knowing; she sees the devil among the roses; she makes it plain that the dominion of Carnality has indefinitely wavering boundaries and is larger than Jane Austen, say, among the tea-things, is willing to grant. Mrs. Scott seems to know more about the subterranean doings of the minds of fervent ladies and gentlemen than even some famed Viennese experts on the unconscious. What is important, though, is that she has merged her almost uncomfortably adroit awareness of pretense and estimable fooling of self with narrative. She makes her discoveries unobtrusively.The three families I mentioned are the Dolans of Odessa, Indiana—at first, and the Georges and Cowleys of Mimms, Tennessee. What a monstrous whirl the lusts, regrets, disgusts, shrieks, languors, departures, abnegations and deaths of the members of these families make! The gigantic emotional turmoil begins in Odessa in 1867. The Civil War has just gone. America is breathless; feeling somehow the coming of new riches, splendors, and confusions.The book ends in 1914, when John Dolan, afraid he'll die before paralyzed, dim Fanny, sees that both die together, with gas all going and a Bible just read in.I have given some bones and lines of a story that scampers and crawls over thousands of miles and exquisitely lightens the dark and angry places of a thousand instances of noteworthy human behavior. It is a story told in a style that is like sharp steel being shone on. Mrs. Scott's perceptive powers are of the sort that refuse to let the more evanescent and hidden aspects of existence go by, without having been mentally mastered. There are, for instance, scores of kinds of weather greedily, sharply described in \"A Calendar of Sin.\" There are scores of intonations taken prisoner. And the technic of pretense and repression, so compulsory with persons, living in sin or otherwise, has been revealed in appropriately merciless, keen writing.",
  "genres": [],
  "author": "Evelyn Scott",
  "average_rating": "4.40",
  "url": "https://www.goodreads.com/book/show/25068895-a-calendar-of-sin"
}