{
  "title": "Twisted Asphalt",
  "description": "What would one man do to protect his daughter from the fate of his lifestyle choices? Would he go so far as to be a patched in member of an outlaw motorcycle club, and enlist the help of the ATF to bring down the very club he’s spent his whole life in?Undercover ATF Agent Sam Dean made it his mission to take down the James Family, leaders of the notorious Six-gun Outlaw Motorcycle Club until Amy “Amethyst” James, the club president’s daughter, enters his life. Erotic sparks fly, complicating things for the man who is afraid of losing himself to the familial environment provided by his leather clad, Harley riding brothers.The lone figure sat in the interrogation room, glazed eyes staring bleakly at the Styrofoam cup in front of him.What the hell am I doing? The thought kept running through his mind, a sigh bursting past a frown.In a world of violence, tattoos, outlaws and high sexual tension, can Mace expose the traitor, take down the club and convince the woman that the only lie he gave her was his name, before he walks away?Having survived a tragedy, California native Blue Remy, who now resides in the hub of the South, brings an authenticity to her novels that can only come from personal experiences and the heartbreak of being a man's property and ol' lady with intimate knowledge of what women have to struggle with in everyday club life.Remy writes books that cross over genres and grip male and female fans with their combination of gritty MC realism and romance. In between writing about bad boys, she secretly indulges addictions of coffee, cupcakes, collection of boots, and anything Wonder Woman. Blue is an active supporter of the WWP, and the Motorcycle Safety Foundation.Scroll up, click the buy button, and get started today!",
  "genres": [
    "Romance",
    "Dark",
    "Romantic Suspense",
    "Abuse",
    "Motorcycle",
    "Contemporary",
    "Drama"
  ],
  "author": "Blue Remy",
  "average_rating": "3.75",
  "url": "https://www.goodreads.com/book/show/25068814-twisted-asphalt"
}