{
  "title": "The Three-Year Swim Club: The Untold Story of Maui's Sugar Ditch Kids and Their Quest for Olympic Glory",
  "description": "The \nNew York Times\n bestselling inspirational story of impoverished children who transformed themselves into world-class swimmers. In 1937, a schoolteacher on the island of Maui challenged a group of poverty-stricken sugar plantation kids to swim upstream against the current of their circumstance. The goal? To become Olympians. They faced seemingly insurmountable obstacles. The children were Japanese-American and were malnourished and barefoot. They had no pool; they trained in the filthy irrigation ditches that snaked down from the mountains into the sugarcane fields. Their future was in those same fields, working alongside their parents in virtual slavery, known not by their names but by numbered tags that hung around their necks. Their teacher, Soichi Sakamoto, was an ordinary man whose swimming ability didn't extend much beyond treading water. In spite of everything, including the virulent anti-Japanese sentiment of the late 1930s, in their first year the children outraced Olympic athletes twice their size; in their second year, they were national and international champs, shattering American and world records and making headlines from L.A. to Nazi Germany. In their third year, they'd be declared the greatest swimmers in the world. But they'd also face their greatest obstacle: the dawning of a world war and the cancellation of the Games. Still, on the battlefield, they'd become the 20th century's most celebrated heroes, and in 1948, they'd have one last chance for Olympic glory. They were the Three-Year Swim Club. This is their story.*Includes Reading Group Guide*",
  "genres": [
    "Nonfiction",
    "History",
    "Sports",
    "Book Club",
    "Biography",
    "World War II",
    "Audiobook"
  ],
  "author": "Julie Checkoway",
  "average_rating": "3.75",
  "url": "https://www.goodreads.com/book/show/25066982-the-three-year-swim-club"
}