{
  "title": "Chaos and Moonlight",
  "description": "The Nines, an elite group of vampires, was established to stand as protection for their race. Fractured by centuries of betrayal and loss, the group is now little more than myth, its remaining members scarred and shattered.Taris, the oldest living vampire, is no stranger to loss and heartbreak. He is all that holds the Nines together as they struggle to save themselves from total extinction.Enter the beautiful and brilliant Dr. Sarah Bridgeman, whose medical research has resulted in a breakthrough for both humans and vampires. Her work may be the salvation this weary band of guardians has been looking for.Taris needs to reach Sarah and enlist her help before those aligned against him can act. Can a vampire king convince a stunning young scientist to save a species that isn’t even supposed to exist?For now, only one thing is no science can explain the explosive chemistry between them.Chaos and Moonlight is the first installment in the Order of the Nines series, and is A. D. Marrow’s debut novel.  Praise for Chaos and Moonlight: \"A.D. Marrow's Chaos and Moonlight takes readers on an emotional roller-coaster ride, full of passionate characters and story line that will leave you begging for more.\" — Gina L. Maxwell, USA Today and New York Times bestselling author\"Chaos and Moonlight was fast-paced and thrilling. The plot was well executed and fascinating. The story had a good flow and was difficult to put down…I am impressed by her writing style and creativity. I will definitely continue reading this series.\" —Diane’s Book Blog“I love it when an author takes a tired old trope and turns it on its ear. This is exactly what A.D. Marrow has done in her debut novel, Chaos and Moonlight…” —Will Read for Feels\"Chaos and Moonlight was a mix between a Christine Feehan and J.R. Ward book…I will definitely be reading more of this author's future work!\" — Goodreads reviewer",
  "genres": [
    "Paranormal",
    "Vampires",
    "Paranormal Romance",
    "Romance"
  ],
  "author": "A.D. Marrow",
  "average_rating": "3.55",
  "url": "https://www.goodreads.com/book/show/25070804-chaos-and-moonlight"
}