{
  "title": "Kinkaid",
  "description": "From the world of Carolina Bad Boys and Retribution MC, a steamy New Adult standalone novella . . . Magic Mike XXL ain’t got nothin’ on Kinky Kinkaid. Kinkaid:Bonafide pussy magnet. Kinky Kaid I wanna get laid. Yeah, I’ve been called that shit and more. It comes with the territory. See, I’m a male stripper. I shake my moneymaker so I can pay the bills and take care of my people. I’m also a hardcore, hell-bent biker dude, the newest prospect at Retribution MC. Probie 2.0, and they can never find out how I earn my living. Women love me. They toss their panties at me. They push hundred dollar bills into my G-string. I’m down and dirty and the honeys dig it. All but one. There’s this girl, Sadie. She’s beautiful and funny and kickass with some major ink. I’d never make a move on her because she’s my best friend. Sadie:Best friend? Bullshit. Kinkaid treats me like I’m his kid sister. I’m the hell-raiser, the tomboy dirt biker, his late night call but never like that. He thinks he’s safe from me. I’m going to prove him wrong. I’ll make him see me as a woman one way or the other. When I find out what Kinkaid’s been hiding there’s hell to pay. Except then he gives me a lap dance. A hot, wicked, panty-melting lap dance. A lap dance that unleashes our intense desire, fresh jealousy, distrust and anger. Everything changes after that, and not for the better. I love him. I hate him. I can’t lose him. Sometimes I can’t stand him. He’s hot as sin on a sultry lowcountry night, and he’s still my best friend. I don’t know if he’s man enough to give me what I need. Warning: Graphic sex, graphic action, graphic language. Triple X caution.HUNTER, book #1: Now Available!BO, book #3: Available for preorder now, coming July 14th.COLETRANE, book #4 and series finale: Coming in August.",
  "genres": [
    "Erotica",
    "Romance",
    "Contemporary",
    "Contemporary Romance",
    "Humor",
    "New Adult",
    "Friends To Lovers"
  ],
  "author": "Rie Warren",
  "average_rating": "4.13",
  "url": "https://www.goodreads.com/book/show/25069985-kinkaid"
}