{
  "title": "The Do-Over",
  "description": "Just before her fortieth birthday, Mara Jane Mulligan, devoted wife and mother, runs out of bubble bath, and the ensuing panic attack drives her to Canada for more. She realizes that one foamy soak probably won't cure what ails her, so she takes a 30 day vacation from her life. (What woman doesn't need one of those?) She changes her name from plain Janie to Mara, swaps mom jeans for vintage funk, discovers her inner party girl and outer cleavage, and hopes that by the end of the month, she’ll be ready to return home and happily warehouse shop for jugs of ketchup again. Surely her family will understand. Her son’s visiting Grandma, and maybe her husband won't even miss her. Unfortunately, her husband doesn't miss much and tracks her to Abundance, a Vancouver bubble bath company. She's pretty sure she can explain the strip club and the pack of wild grandmas, and also the lesbians at her slumber party, and possibly the all-over sunburn from the clothing optional beach, but the soapy encounters with the bubble bath mogul?… probably not. As her 30 days sail by, Mara Jane Mulligan discovers she has a decision to make that even Dorothy couldn't avoid… Will she click her heels for home or kick them up for good? About the Kathy Dunnehoff has an M.F.A. in Creative Writing from the University of Montana, warehouse shops for ketchup, and at mid-life finally possesses the ability to bring writing and life together with insight and humor. She teaches writing and creativity courses at Flathead Valley Community College, her screenplays have placed in numerous competitions, and she was a recipient of a Zola Award for fiction from the Pacific Northwest Writer’s Association.",
  "genres": [
    "Romance",
    "Chick Lit",
    "Fiction",
    "Contemporary",
    "Humor",
    "Contemporary Romance",
    "Comedy"
  ],
  "author": "Kathy Dunnehoff",
  "average_rating": "3.43",
  "url": "https://www.goodreads.com/book/show/11524202-the-do-over"
}