{
  "title": "Green Apple Red Book: A Trial and Errors: A Memoir of a Chinese-American",
  "description": "Honorable mentions in 2015 San Francisco, New York, and Hollywood Book Festivals, the memoir portrays the American Dream and the Chinese Dream from the perspective of a first-generation Chinese-American born in the heat of the Cultural Revolution who came to America after 1989 Tiananmen Square Protest. The book juxtaposes the story of two immigrant families caught in the crossfire of a real-life legal drama with the author's search for identity by trial and error. The American and Chinese systems of values and justice are in contrast, as the author shows the reversals of fortune and changes of fate and ambition in China and the U.S. through her journey.Rebecca had lived in the proverbial American Dream, only to have a rude awakening on the Great Wall of China when she received an unexpected call from the Chinese Authority. Upon her return home in the U.S., she was thrown into a bizarre lawsuit that lasted years, culminating in a weeks-long jury trial in a Silicon Valley courtroom. Her trial was contemporaneous with a billion-dollar multinational corporate trial across town in San Jose, California and a politically scandalous murder trial in her once-sleepy college town in China; Her adversary was a woman who appeared to have it all, even high blood sugar. Her only connection to the plaintiff was a gifted Vietnamese American with degrees from elite universities who had vanished. The Kafkaesque trial spurred Rebecca to make a reckoning of her life, split between China and America. As she awaited the verdict, she deliberated over the paradox of wealth, class and privilege. 美籍华人丽贝卡觉得自己实现了美国梦 。但是她四十生日全家被中国政府隔离，回到美国后被卷进一场持续多年的官司，最终在加州硅谷法庭审判。原告是一个苹果公司高级雇员，声称她自己孕期血糖高需要被告丽贝卡陪尝。 住东海岸千里远的丽贝卡怎么牵扯上的？一个有名牌大学博士学位但消失得无影无踪的男人是她跟原告越南裔家庭的唯一连系。这个卡夫卡式的审判让丽贝卡回想她在中国的生长然后在美国生存奋斗的旅程。当她期待陪审团裁决的同时，她在审议财富带来的矛盾，把美国和中国的价值观和司法系统形成鲜明的对比。",
  "genres": [],
  "author": "Rebecca Li-Huang",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/25073535-green-apple-red-book"
}