{
  "title": "What Is Punk?",
  "description": "One of The Globe and Mail 's Best Books of 2015 \"A punk primer for the youngest set....Yi's incredibly detailed clay figures are a kinetic and inspired art choice. Their crazy creativity matches the expressive spirit of punk....As [Morse] points out, the best way to learn about punk it just to listen....If invested adults love the topic, a shared reading experience can't be beat.\"-- Kirkus Reviews \"Clay artist Yi molds...fantastically detailed Plasticine figures to create scenes of the birth of punk. Using a benign craft-project material for the skinny bodies and ragged clothing of Joey Ramone, Sid Vicious, and their rowdy, fist-waving audiences is very much in the spirit of punk (Plasticine is especially good for mohawks), and readers will spend long stretches inspecting her painstakingly modeled guitars, amplifiers, and safety pins.\"-- Publishers Weekly \"Why It's Wild: A history of punk music for kids illustrated in Gumby-esque claymation (minus the –mation).\"-- School Library Journal , 100 Scope Notes's \"Wildest Children's Books of 2015\" \" What is Punk? is fun, sophisticated and beautifully illustrated introduction to the music genre for kids--or adults.\"-- New York Daily News \"Reading What is Punk? to [my kids] made me feel as if I was passing on something truly significant. Morse and Yi have created a comprehensive and articulate...documentary about the roots of punk rock.\"-- The Globe and Mail \"An essential way to pass down to your son or daughter the lesson that pop culture can be political.\"-- The Globe and Mail , 100 Best Books of 2015 \"A cool book of punk history for kids by Eric Morse, with great clay illustrations by Anny Yi.\"-- Slate , Mom and Dad Are Fighting podcast \"Eric Morse's book What Is Punk? explains the envelope-pushing genre to the younger set, and perhaps some adults, as well.\"-- St. Louis Public Radio \"Think Wallace and Grommet with liberty spikes and anarchy patches...While [Anny Yi's] images of Johnny Rotten and Henry Rollins are cute, they're presented as live action dioramas that are adorable, accurate and engaging.\"-- San Diego City Beat \"While What Is Punk? is undeniably a children’s book, it can serve as a history lesson for potential fans of any age.... What Is Punk? exposes the reader to the rebellious sub-culture in a friendly, educative manner.\"-- Alternative Press \"A fun little book intended to serve as (rhyming) curriculum for little punks learning their Punk History 101....Sid, Glenn, and Milo meet Wallace and Gromit.\"-- Razorcake \"Pairing Yi's Wallace & Gromit-style clay pictorials with Morse's rhyming ride through the history of punk music across the globe, the children’s book is ready to raise the next generation of riot grrrls....You're going to want to give What Is Punk? as a gift at every baby shower this year. Just don't be surprised if your niece ends up bleaching her hair blonde and tearing up her leather jacket at age 6.\"-- Bustle \"Written by Trampoline House founder Eric Morse in classically Suessical iambic, the book is lusciously illustrated with photographs of Play-Doh recreations of all mommy's and daddy's favorite punk heroes: the Ramones, Iggy and the Stooges--and Debbie Harry, David Byrne, David Johansen, Tom Verlaine, and Lou Reed all standing in front of CBGBs.\"-- Bedford & Bowery What Is Punk? is a must-read pop-culture primer for children--an introduction to the punk revolution, recreated in vivid 3-D clay illustrations and told through rhyming couplets. From London's Clash and Sex Pistols to the Ramones' NYC protopunk, from Iggy Pop to the Misfits, this volume depicts some of our culture's seminal moments and iconic characters. A delightful read for kids and parents alike, illustrated in a truly unique visual style, What Is Punk? lays the groundwork for the next generation of little punks.",
  "genres": [
    "Music",
    "Picture Books",
    "Nonfiction",
    "Childrens",
    "Punk",
    "Art",
    "History"
  ],
  "author": "Eric Morse",
  "average_rating": "4.15",
  "url": "https://www.goodreads.com/book/show/25074132-what-is-punk"
}