{
  "title": "Simon's Cat Off to the Vet . . . and Other Cat-astrophes",
  "description": "\"Cat lovers will adore this and will nod in recognition of real-life cat behavior; cartoon fans will delight in Tofield's graceful skill in capturing the slinkiness, stealth, and self-absorption of our feline masters.\"—Publishers Weekly on Simon's Cat vs. the World\"Fans are in for a treat as favorite characters, as well as new faces, run amok in a world full of surprises.\"—Cat Fancy\"What sets Tofield's cartoons apart are the truly comic moments of pure cat-ness: the merciless patting at a half-dead fly, the single-minded determination, that weird little dance thing that segues seamlessly into a look of utter boredom.\"—Irish TimesIn the last five years, Simon's Cat has become a global phenomenon. Star of thirty-nine films, which have been watched over 500 million times, and winner of a dozen major industry awards, Simon's Cat has captured the hearts of a worldwide audience. In this brand new book we see Simon's Cat face any feline's most dreaded scenario—he's off to the vet. And he's not at all happy about it.Sharing its theme with the first-ever full-color Simon's Cat feature animation, funded by a record-breaking Indiegogo campaign and due to be released alongside the new book, Simon's Cat Off to the Vet . . . and Other Adventures is packed with over 240 pages of hilarious new gags and adventures featuring our favorite furry friend and his companions—both old and new.Simon Tofield is an award-winning animator and cartoonist. He has had a lifelong interest in animals, beginning as a child, when his uncle gave him a plastic pond that quickly filled with wildlife. Simon was given his first cat when he was nine and now has four rescue cats, which are the mischievous inspiration for his work.",
  "genres": [
    "Comics",
    "Humor",
    "Graphic Novels",
    "Fiction",
    "Cats",
    "Animals",
    "Graphic Novels Comics"
  ],
  "author": "Simon Tofield",
  "average_rating": "4.21",
  "url": "https://www.goodreads.com/book/show/25074280-simon-s-cat-off-to-the-vet-and-other-cat-astrophes"
}