{
  "title": "The End of Science: Facing the Limits of Knowledge in the Twilight of the Scientific Age",
  "description": "As staff writer for Scientific American, John Horgan has a window on contemporary science unsurpassed in all the world. Who else routinely interviews the likes of Lynn Margulis, Roger Penrose, Francis Crick, Richard Dawkins, Freeman Dyson, Murray Gell-Mann, Stephen Jay Gould, Stephen Hawking, Thomas Kuhn, Chris Langton, Karl Popper, Stephen Weinberg, and E.O. Wilson, with the freedom to probe their innermost thoughts?In The End Of Science, Horgan displays his genius for getting these larger-than-life figures to be simply human, and scientists, he writes, ”are rarely so human...so at ther mercy of their fears and desires, as when they are confronting the limits of knowledge.”This is the secret fear that Horgan pursues throughout this remarkable Have the big questions all been answered? Has all the knowledge worth pursuing become known? Will there be a final ”theory of everything” that signals the end? Is the age of great discoverers behind us? Is science today reduced to mere puzzle solving and adding detains to existing theories?Horgan extracts surprisingly candid answers to there and other delicate questions as he discusses God, Star Trek, superstrings, quarks, plectics, consciousness, Neural Darwinism, Marx's view of progress, Kuhn's view of revolutions, cellular automata, robots, and the Omega Point, with Fred Hoyle, Noam Chomsky, John Wheeler, Clifford Geertz, and dozens of other eminent scholars. The resulting narrative will both infuriate and delight as it mindles Horgan's smart, contrarian argument for ”endism” with a witty, thoughtful, even profound overview of the entire scientific enterprise.Scientists have always set themselves apart from other scholars in the belief that they do not construct the truth, they discover it. Their work is not interpretation but simple revelation of what exists in the empirical universe. But science itself keeps imposing limits on its own power. Special relativity prohibits the transmission of matter or information as speeds faster than that of light; quantum mechanics dictates uncertainty; and chaos theory confirms the impossibility of complete prediction. Meanwhile, the very idea of scientific rationality is under fire from Neo-Luddites, animal-rights acitivists, religious fundamentalists, and New Agers alike.As Horgan makes clear, perhaps the greatest threat to science may come from losing its special place in the hierarchy of disciplines, being reduced to something more akin to literaty criticism as more and more theoreticians engage in the theory twiddling he calls ”ironic science.” Still, while Horgan offers his critique, grounded in the thinking of the world's leading researchers, he offers homage too. If science is ending, he maintains, it is only because it has done its work so well.",
  "genres": [
    "Science",
    "Nonfiction",
    "Philosophy",
    "Physics",
    "Popular Science",
    "History Of Science",
    "History"
  ],
  "author": "John Horgan",
  "average_rating": "3.58",
  "url": "https://www.goodreads.com/book/show/250814.The_End_of_Science"
}