{
  "title": "A Geometry of Music: Harmony and Counterpoint in the Extended Common Practice",
  "description": "How is the Beatles' \"Help!\" similar to Stravinsky's \"Dance of the Adolescents?\" How does Radiohead's \"Just\" relate to the improvisations of Bill Evans? And how do Chopin's works exploit the non-Euclidean geometry of musical chords?In this groundbreaking work, author Dmitri Tymoczko describes a new framework for thinking about music that emphasizes the commonalities among styles from medieval polyphony to contemporary rock. Tymoczko identifies five basic musical features that jointly contribute to the sense of tonality, and shows how these features recur throughout the history of Western music. In the process he sheds new light on an age-old what makes music sound good?A Geometry of Music provides an accessible introduction to Tymoczko's revolutionary geometrical approach to music theory. The book shows how to construct simple diagrams representing relationships among familiar chords and scales, giving readers the tools to translate between the musical and visual realms and revealing surprising degrees of structure in otherwise hard-to-understand pieces.Tymoczko uses this theoretical foundation to retell the history of Western music from the eleventh century to the present day. Arguing that traditional histories focus too narrowly on the \"common practice\" period from 1680-1850, he proposes instead that Western music comprises an extended common practice stretching from the late middle ages to the present. He discusses a host of familiar pieces by a wide range of composers, from Bach to the Beatles, Mozart to Miles Davis, and many in between.A Geometry of Music is accessible to a range of readers, from undergraduate music majors to scientists and mathematicians with an interest in music. Defining its terms along the way, it presupposes no special mathematical background and only a basic familiarity with Western music theory. The book also contains exercises designed to reinforce and extend readers' understanding, along with a series of appendices that explore the technical details of this exciting new theory.",
  "genres": [
    "Music",
    "Mathematics",
    "Nonfiction",
    "Geometry",
    "Art",
    "Textbooks",
    "Psychology"
  ],
  "author": "Dmitri Tymoczko",
  "average_rating": "4.11",
  "url": "https://www.goodreads.com/book/show/10168194-a-geometry-of-music"
}