{
  "title": "Psycho-Tropics",
  "description": "\"Marrying humor with suspense is not easy, but it comes across masterfully .... A truly enjoyable read.\" -- Writer's Digest Award Winner in Genre FictionA high school reunion unburies the past (literally) in this twisted mystery of revenge and redemption. Lottery-winning surfer Danny Teakwell seems to be living the life, but he's been hiding a terrible secret, punishing himself for two decades. Now he's hit rock bottom. So he thinks. The ghosts from his past show up at the reunion, launching him on a mayhem-filled race through the Sunshine State to save a missing woman, and his soul. The odds aren't good. He has three days and his only allies are a pill-popping lawyer, crusty barkeep, and seven-year-old embalming expert. Heart and dark humor combine with page-turning action and plot surprises that will keep you guessing.\"Marrying humor with suspense is not easy, but it comes across masterfully .... A truly enjoyable read.\" -- Writer's Digest Award Winner in Genre Fiction\"An engaging thriller with plenty of humor, good characterization, and a memorable villain ...\" -- Kirkus Reviews\"Psycho-Tropics is like riding Pipeline with a hangover. It's jaw dropping, heart thumping and addictively exhilarating, but with a hint of disorientation, dizziness and an unsettled stomach. But by the end you'll be smiling ear to ear and bursting to tell your mates how good it was.\" -- Andrew Norton, Surfer Dad UK\"Clues are tossed out like bait, twisting and turning the storyline along ... The characters are brilliantly constructed ... The dark humor serves to lessen the tension in all the right ways before it heightens again ... Effortlessly captures the wonderful eccentricities of life in South Florida ....\" -- IndieReader Official Seal of Approval\"A genuinely creepy sadist is the high point of Box's dark thriller set in Florida in 1995.\" -- Publishers Weekly",
  "genres": [
    "Thriller",
    "Suspense"
  ],
  "author": "Dorian Box",
  "average_rating": "4.25",
  "url": "https://www.goodreads.com/book/show/25080312-psycho-tropics"
}