{
  "title": "And Leave the Ticking Clock Alone, On the Path of Time to Go",
  "description": "Excerpt from the diary of Private Raz V’a van,  “We were the legionaries of Malus, The World Breaker”  To the west side of our position, we gazed at the source of the light and saw that it was a column of chariots charging the rear of the enemy. Above it, a massive multiheaded dragon formed entirely of hellfire flew as the great body of our allies charged the Federal’s rear. The sight was greeted with a resounding cheer from our side and the breaking of ranks and desertion from the enemy, since the Hellfire Dragon was one of the most powerful fire attacks used in battle. On top of that, since our chariots where now sweeping the enemy from behind it meant that the Federal and Volunian chariots had been defeated and if that wasn’t enough, the cherry on top soon followed. For right in the speartip of that formation, riding a topless spider-wolf-jeep was none other than our new fleet commander. Oh yes, The Fox of Marengo himself was leading the charge. That sight of destruction was one of the most beautiful things I saw that whole month.   Private Raz V’a van, Imperial Logistic and Engineer Corps.   Extract from the book “Confessions, an Admirals tale volume I”  ............‘Scuze me, but could we please turn this massive fleet around so I can pulverize some boots, a water bottle, a ration pack and compass so as to not insult the raging killer coming at us, since I realized the enemies true number, for I was too stupid to turn the report page and saw that he has 35.000 ships instead of 350, and I don’t want to make him mad!’   Metternich per Pelasgiamus, Freelance Potions Maker   ................“Come on! What does heaven have against peaches!” the young commodore mentally lamented as he gazed at the magic field map on the spider-wolf-jeep’s backseat dashboard to see what was going on.   ........................\"“By the Glory Hole of Saint Epusculatus, it’s our comm’ander himself, bless ye sir, we din’ think you’d be the ‘one ta save us!” ...........................................   ................\"This made my stomach ache even worse, since I was now isolated from our main army and going back there while a battalion of elite shock troopers, old but still very deadly, where left unchecked in the woodland just to the right of me, was not a very delightful way to spent a lovely thunderstorm riddled morning such as this. \".......................   .............“Tardiness, sloppy pursuit!? Compared to what, a bolt of lightning?” ....................   ...............“Transmit the following: ‘Spare no expense and blast them to Oblivion!’ Also Werner, get your Berets down there, it’s been almost five minutes since your soldiers decimated the enemy and that’s just bad business for us!” Metternich said to Butz and Von Braun........................   ........................Metternich also ordered Butz to join the main army so he could bravely lead his soldiers. Preferably from behind as many bodies between him and the enemy as they are available of course, preferably a few light years away, but then, we all do things that we don’t like from time to time..................   ...........“Sir, I think you might have hit your head in the fight, since what you just suggested is insane!” Dalius spoke up.  “We’re in the military commodore; insanity is a requirement for the job.”",
  "genres": [],
  "author": "R.M. Solea",
  "average_rating": "3.00",
  "url": "https://www.goodreads.com/book/show/25083747-and-leave-the-ticking-clock-alone-on-the-path-of-time-to-go"
}