{
  "title": "Release By Treaty",
  "description": "Release by Treaty, part of a short story collection of futuristic space opera romance from Kayla Stonor.The scent of his attraction drives her wild. Can he accept the war’s over?After decades of war, the Qui Empress ushers in a new galactic era when she signs a peace treaty and takes a human consort. She orders the K’lahn, the Qui’s warrior class, to surrender all human prisoners of war.Hand selected by the Empress, Dol’ce is tasked with the mission to retrieve Colonel Abe Marcel and bring him home. Having lost his entire combat unit, Marcel is barely surviving K’lahn imprisonment. Dol’ce delivers him into the safety of her ship, and through delicate care, nurses his soul and body back to health. But his savior is a member of the Qui, a sophisticated alien race of shape shifters who rule a galactic empire, the very same Qui who once ordered the decimation of Earth. Dol'ce has never met a human before and the overpowering call of Marcel’s unruly male pheromones unleashes havoc on her senses. Her exotic beauty and powerful desire leaves him with a hard problem only she can relieve.Marcel must accept that the war is really over, or lose the alien glittering gem who saved his life.This sexy scifi romance tale is the first in a futuristic collection inspired by Under By Treaty, a space opera romance in Kayla Stonor’s Surrender collection. Each tale in the Qui Treaty Collection is a standalone novella set in the Qui galactic empire, with annihilation of mankind held at bay only through the Treaty consummated between the Qui Empress and the human consort abducted under its terms.Reader please note: Kayla Stonor’s stories can be dark and edgy, hot and wicked, punishing and uplifting. If you find certain themes uncomfortable reading, these stories may not be for you. Although this shifter story is standalone, it is set within a wider space opera saga and it is recommended that the short stories are read in order.",
  "genres": [
    "Aliens",
    "Science Fiction",
    "Romance",
    "Erotica",
    "Erotic Romance",
    "Science Fiction Romance",
    "Futuristic"
  ],
  "author": "Kayla Stonor",
  "average_rating": "3.71",
  "url": "https://www.goodreads.com/book/show/25092310-release-by-treaty"
}