{
  "title": "Uncover the Real World: Books 1 - 5 of the Real World Series",
  "description": "The first five books of the Real World Series all HalfbreedsLonely and rejected, Natalie Woods knows her mother doesn’t want her. Bullied by her brothers, she turns to the only person who seems to her late father’s best friend.Scott Carling knows Natalie is his mate, but he can’t tell her until she’s old enough to understand he’s not a part of the human world, but something else entirely.The two begin a passionate affair when Natalie is still only fifteen, but after witnessing a violent confrontation between Scott and her mother, Natalie runs away.Tracking down his mate took Scott years. Now he’s found her and he’s determined to get her back. He won’t let anyone or anything stand in his way.Lupine TendanciesAfter years of resisting, Chloe Hallet finally gives in to her friend Dale’s attempts to seduce her. With her mother’s recent death and the news she has a mystery father somewhere, Chloe’s defences are down.When she finally meets one of the men who might be her father, Chloe’s world is rocked by the man’s nephew.Reserved and secretive, Martin Reavey attracts her like no other man ever has before. Though shy, he has something that ignites an undeniable passion in Chloe. But Martin is a man with a secret. Once every few weeks, he disappears for a several days.Rejecting her fiancé, Chloe is determined to uncover whatever it is that keeps taking Martin away. Is it another woman, or is there a lot more to Martin Reavey than meets the eye?Warrior RisingOf all the species in the Real World, elves and faeras are the least compatible. Their cultures have nothing in common; only a mutual hatred binds them.Fiercely protective of his family, Brock Fortescue self- imposes exile from all his own kind as a punishment for a murder no one knows he committed. Stuck in a county miles from his family, he feels completely isolated. Then a young woman comes into his life and shakes it to its foundations.Vanessa Elwood, half-elf and innocent, finds herself unable to forget Brock, despite her mother’s attempts to separate them. But Vanessa doesn’t know how much she needs the faera male. Her entire existence has been planned from the moment she was conceived, and the happy future she sees for herself is suddenly snatched away.Only a born warrior can save her.The Time of DespairDragged from their home, Natalie, her husband Alex and her mate Scott seek sanctuary at the new faera court.Chloe and Martin Reavey battle to survive against those they love most as the humans turn on everyone around them.The Lady of Elf, Vanessa, and the King’s Warrior, Brock, uproot their family and travel across a country turned savagely vicious.As the time of prophesy dawns, all the creatures of the Real World join forces to face an enemy more dangerous than any of them have faced before.The Real WorldIn a world changed beyond recognition, the survivors are beginning to build new lives.Nicola Ashbrook lived through the end of the world. Now she sets out in search of food. What she finds is a country populated by creatures she never knew existed. But the real threat could come from the humans who made it through the madness.Vincent Malleson has waited over a century for his mate, but can she accept him for what he really is? Will she see beyond the murderer?When their safe haven is threatened, they set out across a country full of new perils.",
  "genres": [],
  "author": "Eden Elsworth",
  "average_rating": "0.00",
  "url": "https://www.goodreads.com/book/show/25082764-uncover-the-real-world"
}