{
  "title": "The Waste Makers",
  "description": "An exposé of \"the systematic attempt of business to make us wasteful, debt-ridden, permanently discontented individuals,\" The Waste Makers is Vance Packard's pioneering 1960 work on how the rapid growth of disposable consumer goods was degrading the environmental, financial, and spiritual character of American society. The Waste Makers was the first book to probe the increasing commercialization of American life—the development of consumption for consumption's sake. Packard outlines the ways manufacturers and advertisers persuade consumers to buy things they don't need and didn't know they wanted, including the two-of-a-kind of everything syndrome—\"two refrigerators in every home\"—and appeals to purchase something because it is more expensive, or because it is painted in a new color. The book also brought attention to the concept of planned obsolescence, in which a \"death date\" is built into products so that they wear out quickly and need to be replaced. By manipulating the public into mindless consumerism, Packard believed that business was making us \"more wasteful, imprudent, and carefree in our consuming habits,\" which was using up our natural resources at an alarming rate. A prescient book that predicted the rise of American consumer culture, this all new edition of The Waste Makers features an introduction by best-selling author Bill McKibben. Vance Packard (1914-1996) was an American journalist, social critic, and best-selling author. Among his other books were The Hidden Persuaders , about how advertisers use psychological methods to get people to buy the products they sell; The Status Seekers , which describes American social stratification and behavior; and The Naked Society , about the threats to privacy posed by new technologies.",
  "genres": [
    "Nonfiction",
    "Economics",
    "Environment",
    "Design",
    "Business",
    "History",
    "Cultural"
  ],
  "author": "Vance Packard",
  "average_rating": "4.03",
  "url": "https://www.goodreads.com/book/show/250912.The_Waste_Makers"
}