{
  "title": "Kindred Hearts: Not your average romance!",
  "description": "The perfect escape for those who want to be intrigued, seduced and enthralled – gripping bedtime or holiday reading.Tasha is living the London dream with her job at the V&A museum, but has neglected her social life – until now.Sebastian and Celeste – the enigmatic twins from Tasha’s childhood – sweep back into town seducing her with their glamorous lifestyle and intense friendship once again. But the twins have changed in the intervening years; they have secrets and everything is not as perfect as it seems.As the bond between Tasha and Sebastian develops, Celeste grows increasingly possessive of her best friend. Can Tasha make the right choice when it comes to her heart? Or will the past destroy everything worth saving?Perfect for fans of Samantha Young and Lucie Whitehouse.What everyone’s saying about Kindred ‘There were a lot of interesting twists and turns throughout this book that I didn't see coming, but that is for you to discover. I loved the way the author showed how Celeste and Sebastian saw Tasha through their eyes when they first meet, as Tasha thought she didn't need friends. The Epilogue to the book made it absolutely complete. ’ – Rosie’s Book Review Team‘Great read, I didn't have any problems with the 3-way relationship and loved all the sexual tension and suspense building up. Fell in love with the characters immediately and couldn't wait to find out what happened next, which is the sign of a good book imo!’ – Goodreads 5*‘Wow, wow, wow! This a beautifully written, evocative, love story that I simply couldn't put down… Plot twists, romance, spice, and heart wrenching moments – this book had it all – definitely a highly recommended read!’ – Alice Raine, author of The Untwisted Series.What everyone’s saying about Grace ‘Grace Lowrie does a fantastic job building up sexual tension between the three main characters and espousing their intimate liaisons. And yes, it is erotic and spicy. But there is more to there is the complexity of the three-way relationship and a decent yarn that takes you to a satisfying finale. ’ – Facebook review‘From start to finish Grace had me enraptured with the characters and plot to the point where I did little else but read for three days until I had finished. The descriptions of the characters are so well developed that I could picture them perfectly in my mind, in fact, I almost feel as if I know them personally.’ – Alice Raine, author of The Untwisted Series.",
  "genres": [],
  "author": "Grace Lowrie",
  "average_rating": "3.93",
  "url": "https://www.goodreads.com/book/show/25086943-kindred-hearts"
}