{
  "title": "Locke",
  "description": "Jake 'Locke' Dixon has understood what death looks like from an early age as he witnessed the murder of his entire family. Seeking revenge, he spends the next twenty years moving the chess pieces into position in order to find retribution. During this chaotic period of his life, Locke finds some solace within the ACES MC but has recently been made to feel like an outsider from the only family he has known over the past ten years. His decision to lead a double life and not attend the drugs run that resulted in Viper's death, will haunt him forever but it will also continue to fuel the hatred that Duke has towards him. Locke swears to rebuild his relationship with the MC but his meticulously planning for vengeance is nearing its conclusion and he can't be swayed from his ultimate goal. Locke likes to have control over everything but the one thing he didn't prepare for was the fiery yet charming Keira O'Flaherty and the feelings she has stirred inside him, when she forces herself into his life.What happens when his two worlds collide and Keira becomes the focus of the Satan's Wrath's fury? Can Locke prevent Keira from meeting the same fate as that of his family without putting himself and others in danger?Note to readers: This is not your normal MC series. The Aces are an MC with alpha males but the members do not shy away from the fact that they are husbands, fathers and lovers with feelings. If you don’t like a biker who cares and respects his woman, then this isn't a book for you.I want to take the time to mention that I’m from the United Kingdom and use UK spellings.To receive the full experience of the Aces MC Series it is recommended to read the stories in the following order:Diesel – Book 1Duke - Book 2Paige and Chloe - Book 2.5 Spike - Book 3Amy - Book 3.5Locke - Book 4Jayden - Book 4.5",
  "genres": [],
  "author": "Aimee-Louise Foster",
  "average_rating": "4.16",
  "url": "https://www.goodreads.com/book/show/25088161-locke"
}