{
  "title": "The Taxidermist's Daughter",
  "description": "A chilling and spooky Gothic historical thriller reminiscent of Rebecca and The Turn of the Screw, dripping with the dark twists and eerie surprises that are the hallmarks of Edgar Allan Poe, from the New York Times and internationally bestselling author of Citadel.In a remote village near the English coast, residents gather in a misty churchyard. More than a decade into the twentieth century, superstition still holds sway: It is St. Mark’s Eve, the night when the shimmering ghosts of those fated to die in the coming year are said to materialize and amble through the church doors.Alone in the crowd is Constantia Gifford, the taxidermist’s daughter. Twenty-two and unmarried, she lives with her father on the fringes of town, in a decaying mansion cluttered with the remains of his once world-famous museum of taxidermy. No one speaks of why the museum was shuttered or how the Giffords fell so low. Connie herself has no recollection—a childhood accident has erased all memory of her earlier days. Even those who might have answers remain silent. The locals shun Blackthorn House, and the strange spinster who practices her father’s macabre art.As the last peal of the midnight bell fades to silence, a woman is found dead—a stranger Connie noticed near the church. In the coming days, snippets of long lost memories will begin to tease through Connie’s mind, offering her glimpses of her vanished years. Who is the victim, and why has her death affected Connie so deeply? Why is she watched by a mysterious figure who has suddenly appeared on the marsh nearby? Is her father trying to protect her with his silence—or someone else? The answers are tied to a dark secret that lies at the heart of Blackthorn House, hidden among the bell jars of her father’s workshop—a mystery that draws Connie closer to danger . . . closer to madness . . . closer to the startling truth.",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Mystery",
    "Gothic",
    "Historical",
    "Thriller",
    "Crime"
  ],
  "author": "Kate Mosse",
  "average_rating": "3.74",
  "url": "https://www.goodreads.com/book/show/25101706-the-taxidermist-s-daughter"
}