{
  "title": "أبي اسمه إبراهيم",
  "description": "كلمة الناشر:---\"أبي اسمه إبراهيم\" رواية لا تلتزم بعمر أو سن معين لقرائها، كما أنها لا تلتزم بقالب روائي محدد. فأهم ما تصبو إليه هو التحرر من القوالب التقليدية الجاهزة التي كان سيدنا \"إبراهيم ثورة دائمة عليها.الزمان يتغير في هذه الرواية، وكذلك المكان فهي مرة تتحدث عن ماض سحيق. ومرة تتحدث عن حاضر معاصر. وتشير ضمنًا إلى مستقبل يجب أن يكون. مرة تتحدث عن \"أور\" التاريخية، ومرة عن أي عاصمة حديثة من عواصم العالم.هناك مكان واحد تحاول هذه الرواية أن تكون موجودة فيه دومًا لتحفيزه وتفعيله.والمكان هو: رأس القارئ. بغض النظر عن عمره.~~~نبذة موقع \"النيل والفرات\":---\"أبي اسمه إبراهيم\" رواية تستوحي من قصة سيدنا إبراهيم مناخًا عامًا لها، تستمد بعض المشاهد الأساسية من مسار القصة الحقيقي، وتضيف مشاهد وشخصيات أخرى من أجل الضرورة الدرامية.تستند الرواية إلى شخصية إبراهيم طفلاً متمردًا محاربًا لكل المؤسسات التقليدية التي تستغفل عقل الإنسان وتحاول أن تعيق فكره بصره، وبصيرته من الوصول إلى الحقائق.يتصاعد الموقف بين إبراهيم -الطفل، وبين المؤسسات ممثلة في والده وجدته، وكهنة المعبد، يحرجهم إبراهيم بكثرة الأسئلة والنقاش، يحاولون أولاً إلجامه بالطرق التقليدية والأجوبة المسكتة. لكن ذلك لا ينفع معه، فيحاولون طرقــًا أخرى، مثل استقدام كاهنة خاصة لعلاجه.لكن إبراهيم، يقلب الموقف على الكاهنة، ويتحول الأمر ضدها بدلاً من أن يكون ضده. ومع التصعيد في الموقف، يزداد بحث إبراهيم عمقــًا، ويزداد اقترابًا من الحقيقة، بإبطاله لفكرة التعددية الوثنية التي كان مجتمعه قائمًا عليها.ومع إبطال التعددية وإلغائها، يكتشف إبراهيم جوهر التوحيد الصافي، القائم على حقيقة أن هذا العالم المتقن الصنع، لا يمكن أن يكون قد صنع إلا من إله واحد قادر على ذلك.لكن تصريحه بذلك يجعله في مواجهة أكبر مع الجميع -فالحقيقة تهدد الكذب، والصدق يطرد الزيف، وكل ذلك جعل الجميع في حالة استنفار ضد سيدنا إبراهيم.تتصاعد حدة الأحداث بين التشويق والإثارة والمتعة، إلى أن تصل إلى نهايتها...ـ",
  "genres": [
    "Novels",
    "Religion",
    "Fiction",
    "Islam",
    "Childrens",
    "Literature",
    "Spirituality"
  ],
  "author": "أحمد خيري العمري",
  "average_rating": "3.73",
  "url": "https://www.goodreads.com/book/show/2509533._"
}