{
  "title": "Mug Meals: Delicious Microwave Recipes",
  "description": "Cooking for one can be fun and easy. Mug Meals offers 125 incredibly flavorful, no-hassle, single-serving recipes, made with just a few fresh ingredients. It's the easy answer to \"What can I make, fast?\" And a welceom solution for busy families, teens on the go, college students, singles, and seniors. Look at all the helpful features it Simple and satisfying recipes-for-one make the perfect size mealNever eat watery frozen meals or expensive take-out againThe pantry supply list will keep you stocked with the essentials40 colorful photographs of tasty mug means will inspire youSecret your microwave. It really can be used for more than popping popcorn. The straightforward microwave basics section will teach you the ins and outs of microwave cooking. To get started, all you need One mugA microwaveSome fresh ingredients125 hearty meals in minutes. Quickly create that home-cooked dish you've been craving with mouthwatering meals-in-a-mug for any time of day.  Here are just a few to whet your Breakfast--Savory Summer Corn Oatmeal with Bacon; Double Berry French Toast; Lox and Bagel StrataLunch--Moroccan Pumpkin and Chickpea Stew; White Bean Gratin with Olives and Lemon; Double Carrot SoupDinner--Chinese Chicken with Noodles and Black Bean Sauce; Classic Shepherd's Pie; LasagnaDessert--Mango Coconut Crumble; Molten Chocolate Cake with Truffle Filling; Peach and Cornbread Shortcake, to name only a fewInstant one-cup clean-up! No more loads of leftovers that inevitably get tossed in the trash. Put an end to over-buying ingredients only to have them spoil in the crisper. Enjoy instant success with receipes that call for only a few ingredients and cook in one cup, so clean-up is a snap.  And your meal in a mug is oh-so delicious!",
  "genres": [
    "Cookbooks",
    "Nonfiction",
    "Food",
    "Cooking"
  ],
  "author": "Dina Cheney",
  "average_rating": "3.42",
  "url": "https://www.goodreads.com/book/show/25094970-mug-meals"
}