{
  "title": "The Tramp",
  "description": "When John was seven, he found Candy dancing in the neighboring yard wearing a yellow polka-dot bikini and red rain galoshes, splashing and dancing and singing at the top of her lungs. She saved his throat from getting ripped out by her grandma’s guard dog. Good thing she did, too. It was John who raised the alarm that day, when the man who smiled with his mouth but not his eyes drove off with Candy in a cloud of dust. The police stopped whatever might have happened next in a seedy motel—a place Candy doesn’t dare remember. John rescued her, creating a bond between two friends strong enough to awaken…something. That something has haunted the southern mountain town of Shirley since a time before stories were written, in a cycle that has spun for centuries. Years later, John and Candy begin to suspect something more sinister lurking amidst the days of football glory and the nights of clandestine rendezvous. John discovers disturbing symbols from the ancient tribes indigenous to the area in his history textbook, in a local cave system, and in his very dreams. Candy uncovers a family history that is more colorful than she knew. If shades of black are colorful. If only the two friends could foresee the danger looming before them. For another something, one much more dangerous than the first, is waking up to continue the cycle. And this something is bent on revenge…again. Murder forces everyone out of sunny valley torpor, and Candy realizes that more than acquaintance connects her with the killer. When a corpse is found, gutted as if for ritual, she knows that whatever evil has overtaken her hometown is moving forward. She will have to exorcise the haunting herself—though she has no idea how—and she will need John’s predestined help to do it. Candy will have to face the memories of that seedy motel room first. At least she finally understands the power she never knew she had—a link to her departed mother and a line of healers shrouded in pre-history.",
  "genres": [],
  "author": "Sarah Wathen",
  "average_rating": "4.33",
  "url": "https://www.goodreads.com/book/show/25100895-the-tramp"
}