{
  "title": "The Battle of Versailles: The Night American Fashion Stumbled into the Spotlight and Made History",
  "description": "On November 28, 1973, the world's social elite gathered at the Palace of Versailles for an international fashion show. By the time the curtain came down on the evening's spectacle, history had been made and the industry had been forever transformed. This is that story.Conceived as a fund-raiser for the restoration of King Louis XIV's palace, in the late fall of 1973, five top American designers faced off against five top French designers in an over-the-top runway extravaganza. An audience filled with celebrities and international jet-setters, including Princess Grace of Monaco, the Duchess of Windsor, Paloma Picasso, and Andy Warhol, were treated to an opulent performance featuring Liza Minnelli, Josephine Baker, and Rudolph Nureyev. What they saw would forever alter the history of fashion.The Americans at the Battle of Versailles– Oscar de la Renta, Bill Blass, Anne Klein, Halston, and Stephen Burrows – showed their work against the five French designers considered the best in the world – Yves Saint Laurent, Hubert de Givenchy, Pierre Cardin, Emanuel Ungaro, and Marc Bohan of Christian Dior. Plagued by in-fighting, outsized egos, shoestring budgets, and innumerable technical difficulties, the American contingent had little chance of meeting the European's exquisite and refined standards. But against all odds, the American energy and the domination by the fearless models (ten of whom, in a groundbreaking move, were African American) sent the audience reeling. By the end of the evening, the Americans had officially taken their place on the world's stage, prompting a major shift in the way race, gender, sexuality, and economics would be treated in fashion for decades to come. As the curtain came down on The Battle of Versailles, American fashion was born; no longer would the world look to Europe to determine the stylistic trends of the day, from here forward, American sensibility and taste would command the world's attention. Pulitzer-Prize winning fashion journalist Robin Givhan offers a lively and meticulously well-researched account of this unique event. The Battle of Versailles is a sharp, engaging cultural history; this intimate examination of a single moment shows us how the world of fashion as we know it came to be.",
  "genres": [
    "Fashion",
    "Nonfiction",
    "History",
    "Art",
    "France",
    "Fashion History",
    "Business"
  ],
  "author": "Robin Givhan",
  "average_rating": "3.91",
  "url": "https://www.goodreads.com/book/show/25096811-the-battle-of-versailles"
}