{
  "title": "Heartstrings",
  "description": "TALL, DARK-HAIRED, BLUE-EYED MAN TO SIRE GENIUS CHILD. $100 IN GOLDWhen bluestocking bookworm Theodosia Worth resolves to bear a baby for her childless sister, she decides an advertisement is the most practical way to find a father. Leaving behind the comforts of Boston, she travels west in the hope of striking a business-only arrangement with a likely candidate.Hired gun Roman Montana gallops into the dusty Texas town on his silver steed, not knowing he’s been hired to guard the luscious body of a golden-haired, whiskey-eyed beauty with plenty of “book smarts” but without a lick of common sense. Roman is forced to protect the infuriating woman—and her infernal parrot—from the lechers who respond to her ad.Roman may not be a genius but he’s smart enough to realize he’s the only true candidate for the job of the “stud” who can make all of Theodosia’s dreams come true. By proving he’s up to the task, he just might earn a prize more precious than gold—Theodosia’s heart.Winner of the Affaire de Coeur Reviewers Choice Award for “Best Historical Romance”Rebecca Paisley is the bestselling author of Diamonds and Dreams, The Barefoot Bride, A Basket of Wishes, Heartstrings, Bed of Roses, Moonlight and Magic, A Prince to Call My Own and Rainbows and Rapture .“Enchanting and funny…The queen of endearing and perplexing heroines is back! Do not let this book slip by.”— Affaire de Coeur“Witty and charming…a refreshingly different read. Rebecca Paisley has a delightful way with words. She makes your heart sing with joy and her talent shines brighter than any diamond! Historical romance at its best!”— Romantic Times“Charm, imagination and laughter! All you need is Rebecca Paisley!”—Lisa Kleypas, New York Times bestselling author“Boldly goes where few writers go and she does it brilliantly!”—Eloisa James, New York Times bestselling author“Rebecca Paisley is the Queen of unique and charming love stories!” Jill Barnett, New York Times bestselling author“Rebecca Paisley dazzles the heart!” Teresa Medeiros, New York Times bestselling author“One of the most talented writers in the genre, Ms. Paisley is an absolute delight to read! Once you’ve read your first Paisley, we can guarantee it won’t be your last!”— Historical Romance Writers",
  "genres": [
    "Historical Romance",
    "Romance",
    "Historical",
    "Westerns",
    "Humor"
  ],
  "author": "Rebecca Paisley",
  "average_rating": "4.24",
  "url": "https://www.goodreads.com/book/show/25105680-heartstrings"
}