{
  "title": "How to Get Lucky",
  "description": "Sometimes there is more than one way to get lucky… Allison Parker knows winning the New York state lottery is impossible for a retail slave and fashion designer wanna-be who doesn’t, uh, play the lottery. But after a particularly bad day at work and a random prediction from a quirky psychic, she does just that, and wins. Money. Lots of it.  So what does any sane woman do? She tells off her boss, quits her job, breaks the lease on her apartment, buys a round at the bar, and takes the dare to make out with the hottest guy in the room.  Marco Lucky is exhausted and over his bandmates and their diva antics. The drugs, the tantrums, are all so juvenile and self-destructive he finds himself looking for an escape. Yet finding a quiet spot in New York City is damn near impossible and he’s already tired of the women hitting on him strictly because he’s famous. But then the crazy brunette with the winning lottery ticket kisses him and he finds himself impulsively taking her home. It’s been years since he felt chemistry that intense and her snarky wit makes him laugh. When morning rolls around he knows it can’t be anything more than one night given that he’s headed out on tour soon, but when Allison realizes her winning ticket is gone he’s pretty damn sure it’s his fault.  Allison figures it’s only fitting that she be the first woman in the history of ever to hit the lottery and score a smoking hot rock star all in one night, only to wake up with her entire life destroyed a mere eighteen hours later. Marco’s offer of help makes her feel like the biggest lame ass loser, and she can’t get away from him fast enough.  But when the Worst Day Ever comes to an end, will Marco and Allison be ready to put the issue of money to bed? Because being lucky in love just might be hitting the jackpot after all…",
  "genres": [
    "Romance",
    "Contemporary Romance",
    "Contemporary",
    "Chick Lit",
    "Fiction",
    "Humor"
  ],
  "author": "Erin McCarthy",
  "average_rating": "3.81",
  "url": "https://www.goodreads.com/book/show/25107513-how-to-get-lucky"
}