{
  "title": "Missus Buck",
  "description": "Missus Buck--Part Two (A Short Story)--from the Trouble Down South Series (Also Read Slave Auction--Part One)A 6850-Word Short StoryIf you liked \"Slave Auction\" from Trouble Down South and Other Stories, you're going to love to hate \"Missus Buck,\" a 6850-word short story about an elderly woman, advanced in years, who fosters a spirit of hostility toward her daughter-in-law because she believes her to be a commoner. Their family descending from German aristocracy, Missus Buck believes her son has married beneath him when he weds Missus Julie, who feels the sting of her disapproval even from the first day she met her. Missus Buck shows no mercy towards Missus Julie's slaves and squares off with Missus Julie's favored slave, the feisty Rubeline.About the Author--Katrina Parker Williams teaches English grammar and composition at a community college. She is the author of the following titles available at Amazon.Read Katrina Parker Williams’ TitlesThe Dust Storm—A Short Story (Trouble Down South Series)Rock—A Short Story (Trouble Down South Series)Grandpa's Courtship—A Short Story (Trouble Down South Series)Slave Auction—A Short Story (Trouble Down South Series)Missus Buck—A Short Story (Trouble Down South Series)The Hankering—A Short Story (Trouble Down South Series)Trouble Down South and Other Stories—A Collection of Short StoriesNewest Works from The Girlfriend Tales Series at AmazonGirlfriend “Excess Baggage”Girlfriend “The ‘Other’ Other Woman”Girlfriend “Toxic Lies”Girlfriend \"The Ties That Kill\"The Girlfriend Tales Series (Volume I)The Girlfriend Tales is a series of short stories that addresses issues women grapple with from relationships to family to work and everything in between. Sprinkled with a dash of humor, these short stories offer a bit of mischief, mayhem, and even a murder or two. The short stories are of varied lengths from 3000-11,000 words.Nonfiction TitlesHow to Write a Great Short A Beginner's GuideHow to Write a Basic Essay in Seven Easy A Beginner's GuideHow to Write a Researched A Beginner's GuideHow to Write an Argumentative Essay",
  "genres": [
    "Historical Fiction",
    "Fiction"
  ],
  "author": "Katrina Parker Williams",
  "average_rating": "4.27",
  "url": "https://www.goodreads.com/book/show/11527296-missus-buck"
}