{
  "title": "Before The Sun Goes Down",
  "description": "The Blind Girl's War started more than thirteen years ago, but no one can say exactly why....Tazakul is a broken land of contradictions, all but its latest history and culture are long lost: science and magic vie for what little concern its citizens have beyond the struggle to live.  The two main provinces, Dikallah and Draka, are pushed to the edge of destruction by reckless Presidents who believe themselves omnipotent. The remainder of the world is forgotten, so few books remain -- a selective form of censorship enforced by both the government and extremists alike. People die simply because they live in a place their enemy wants to put to better use, in a war fought as often with swords as with automatic weapons and bombs.  Dissidents are imprisoned and women believed to be witches are banished to Meglic Mountain.  'The Blind Girl's War' is a series of a dozen books related by the blood witch, Nadarra Sen. She is held captive by Haqqi Ibais, Dikallah's most-wanted terrorist with a taste for chemical weapons.  Haqqi has chained Nadarra, forcing her to save a mysterious young girl, Tilla, accidentally poisoned by his chemicals. Nadarra has no idea what the child means to him, only that the man she loves, Zaid Ubaid, will be butchered by Haqqi if she doesn't save Tilla's life.  To gain the time she needs for her remedies to work, she tells Tilla stories of people she's known and the horrors they've lived through and how they managed to survive...interweaving the tales with the history of the near-immortal Tazakul witches, their horrific treatment by humans, and the beginning of their vengeful return....  Her thought always return to Zaid.... His elderly father was taken by a death squad only weeks before...would he assume the same has happened with her or that she simply left him for someone else?  'Before the Sun Goes Down' is the first volume in Tazakul's final struggle to survive.",
  "genres": [],
  "author": "Kimberly  Coleman",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/25105946-before-the-sun-goes-down"
}