{
  "title": "At the Gates of Walhalla",
  "description": "The battlefield of Good against Evil can exist anywhere.Maybe just down the road from you. Even in your own backyard...In the economically recessed eighties, the violent winds of change swirl in the drug world. The Canadian federal government is forced to privatize the job of defending the border. The only constant is Kurt Sorensen, a pillar of law abiding society. As a decorated U.S. Border Patrol Officer defending the southern border in El Paso, Texas, his keen skills, strong work ethic, classic Nordic looks and affable, good humor are a breath of fresh air in a region stifled with the burgeoning terror of warring drug gangs just across the border in Juarez, Mexico.But while his wife, Lupe, and twins Mark and Matthew are birthday shopping at the Mercado in Juarez one afternoon, Kurt, loving father and devoted husband loses everything he lives for as they are killed in an extremely vicious and apparently random ambush in broad daylight. Kurt chooses to leave the painful memories behind as he returns to his peaceful, stunningly beautiful hometown, North Walhalla, Manitoba. Instead of finding peace and tranquility as a Canadian Border Officer, Kurt is suddenly swept up in a vortex of evil and injustice that seems to have followed him northward.In a valiant attempt to protect Walhalla from succumbing to a sudden infiltration of death, drugs and destruction, Kurt engages in a long distance battle with the infamous drug lord, ‘El Cabron’, only to be shocked to his core at the revelation of the drug gang’s silent business partner. With no where else to turn, Kurt draws on his ancestral Viking spirit and strength to recruit a secret militia to right the wrongs in society, delivering justice swiftly and in stealth. Powerful forces and matching wills of the militia, the drug lord and the ominous third party are on inescapable collision courses, which intersect at the gates of Viking Heaven – Walhalla",
  "genres": [
    "Fiction"
  ],
  "author": "Justen Forge",
  "average_rating": "4.08",
  "url": "https://www.goodreads.com/book/show/25102172-at-the-gates-of-walhalla"
}