{
  "title": "If the Raindrops United: Drawings and Cartoons",
  "description": "A book of hilarious and ingenious comic drawings from the popular 30 Rock star and \"World Champion\" comedian Judah Friedlander, hailed by Tina Fey as \"one of the all-time great weirdos.\"Most Americans know Judah Friedlander from his role as Frank Rossitano on 30 Rock and from appearances in films like American Splendor and The Wrestler . But long before he became a film and TV star and stand-up comic Friedlander drew stuff.Now, in this quirky, hilarious, and surprisingly profound collection of drawings, Friedlander shows a new side to his \"terrifically entertaining\" ( New York Times ) comedy. Whether imagining George Washington in Las Vegas, plastic surgery for imperfect triangles, and the Keystone Pipeline as a sex act, Friedlander's \"Joodles\" push boundaries as they explore the absurdities of American life, sex, and even history and human rights. If the Raindrops United is a milestone in the career of one of America's most inventive comedians.Praise for If the Raindrops United :\"Judah has drawn a weird and funny book in the grand '70s tradition of B. Kliban! I think this book will probably fix the world.\" -- Tina Fey\"Some people meditate. Some people masturbate. But if you don't have the time or patience for either of those, I recommend reading If the Raindrops United to calm down, have a little laugh, or a big think.\" -- Susan Sarandon\"I've known Judah for many years and I still don't understand how his mind works, but it sure works. Seriously strange. Seriously funny. A National Treasure. Sadly, I need to get a restraining order against him.\" -- Paul Giamatti\"Judah thank you for writing a funny twisted book. It is such an easy read. Even dum dums like me can enjoy it!!! Buy this book.\" -- Dave Attell\"Judah's drawings are deceptively simple, yet they become more compelling with every page. His talent as an actor/writer/comedian is further conveyed in ANOTHER medium. He's a Quadruple Threat. He wears many hats. Literally.\" -- Janeane Garofalo\"Reading Judah Friedlander's new book is a lot like hanging out with Judah occasionally baffling, frequently thought-provoking, but, most of all, consistently hilarious!\" --Mick Foley\"To compare Judah Friedlander to a great cartoonist like Jim Davis would be a compliment to Jim Davis.\" -- Wyatt Cenac\"Another hit from The World Champ tackling the signs and symbols you frequently question while dropping hot lava in your American Standard VorMax.\" -- Eddie Huang",
  "genres": [
    "Humor",
    "Graphic Novels",
    "Comics",
    "Nonfiction",
    "Art",
    "Comedy"
  ],
  "author": "Judah Friedlander",
  "average_rating": "3.24",
  "url": "https://www.goodreads.com/book/show/25112892-if-the-raindrops-united"
}