{
  "title": "Son of the Black Sword",
  "description": "#1 IN A NEW EPIC FANTASY SERIES from Monster Hunter series creator and New York Times best-selling author, Larry Correia!After the War of the Gods, the demons were cast out and fell to the world. Mankind was nearly eradicated by the seemingly unstoppable beasts, until the gods sent the great hero, Ramrowan, to save them. He united the tribes, gave them magic, and drove the demons into the sea. Ever since the land has belonged to man and the oceans have remained an uncrossable hell, leaving the continent of Lok isolated. It was prophesized that someday the demons would return, and only the descendants of Ramrowan would be able to defeat them. They became the first kings, and all men served those who were their only hope for survival.As centuries passed the descendants of the great hero grew in number and power. They became tyrannical and cruel, and their religion nothing but an excuse for greed. Gods and demons became myth and legend, and the people no longer believed. The castes created to serve the Sons of Ramrowan rose up and destroyed their rulers. All religion was banned and replaced by a code of unflinching law. The surviving royalty and their priests were made casteless, condemned to live as untouchables, and the Age of Law began.Ashok Vadal has been chosen by a powerful ancient weapon to be its bearer. He is a Protector, the elite militant order of roving law enforcers. No one is more merciless in rooting out those who secretly practice the old ways. Everything is black or white, good or evil, until he discovers his entire life is a fraud. Ashok isn’t who he thinks he is, and when he finds himself on the wrong side of the law, the consequences lead to rebellion, war—and destruction.At the publisher's request, this title is sold without DRM (Digital Rights Management).\"Bestselling fantasy author Correia (The Grimnoir Chronicles) casts a compelling spell with this India-influenced series opener...Correia skillfully sets in motion this story of plots within plots, revealing complex, sympathetic characters and black-hearted villains with equal detail and insight. Full of action, intrigue, and wry humor, this exciting series launch promises many more thrills to come.\"— Publishers Weekly Starred Review\"Correia is best known for his action-packed urban fantasies (“Monster Hunter Nation” series) so this non-European–set epic fantasy is a pleasant surprise...Fans who like Correia’s fast-moving style will be pleased with the plethora of action scenes, and epic fantasy readers interested in delving into a new universe should be equally satisfied. A solid choice for admirers of Brent Weeks and Brandon Sanderson’s “Mistborn” series.\"— Library JournalAbout Son of the Black \"This book has everything I like in intense action scenes, evil in horrifying array, good struggling against the darkness, and most of all people—gorgeously flawed human beings faced with horrible moral choices that force them to question and change and grow.\"—Jim Butcher, creator of the New York Times best-selling Dresden Files“I loved the book, it was great, fast paced, with wonderful characters, and also a lot of wonderful scenes that screamed to be painted.”—Larry Elmore, legendary, award-winning artist, and cover artist for Son of the Black Sword.About the Urban Fantasy of Larry “[A] no-holds-barred all-out page turner that is part science fiction, part horror, and an absolute blast to read.”—Bookreporter.",
  "genres": [
    "Fantasy",
    "Audiobook",
    "Fiction",
    "Epic Fantasy",
    "Science Fiction Fantasy",
    "Adventure",
    "High Fantasy"
  ],
  "author": "Larry Correia",
  "average_rating": "4.22",
  "url": "https://www.goodreads.com/book/show/25110977-son-of-the-black-sword"
}