{
  "title": "A Holistic Way Through Depression: Free Yourself From Chronic Unhappiness with Natural Remedies and Easy Lifestyle and Diet Changes",
  "description": "What you find in this book can change your life. You will find that you have many options for treating depression, take control today.   \nYou will once again feel empowered to take control of your mental health and above all you will realize that you are capable, regardless of the severity of your depression.\n From dietary changes, stress reduction techniques and the use of herbs remedies with thousands of years of proven history, you now have within your hands the  power to positively change your life and heal your depression once and for all.  If you are suffering from depression you are not alone. In fact, you are in the company of millions of people, just like you that are in pain daily and have had their lives affected by this illness. Many of them have sought traditional treatments, such as medications and psychiatric therapy, and perhaps you have too. As beneficial as these treatments are for some people, they do not work for all, and not everyone is willing to endure the severe side effects of antidepressant medications. Here you will find effective and gentle alternative solutions.   What is being offered in this book is an alternative to taking powerful psychiatric medication.   This is a chance for you to take control of your own mental health. Use this book as a gentle hand guiding you along the way to natural, holistic treatment of your depressive condition.   In This Book You Will Discover:   -Signs And Symptoms Of Depression -Why Traditional Ways of Healing Depression Are Not Effective -6 Foods You Need to Eliminate From Your Diet that Contribute to Depression -10 Best Superfoods To Heal Depression -5 Incredible Super Spices To Combat Depression -The Link Between Depression and Your Gut -7 Powerful Herbal Remedies To Beat Depression -6 Crucial Steps To Take To Make Initiation Into Physical Activity Easier -Step By Step Plan To Reduce Stress And Lessen Its Impact On Depression -Much Much More   SCROLL UP AND CLICK BUY TO DOWNLOAD YOUR COPY INSTANTLY",
  "genres": [],
  "author": "Emily  Walters",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/25112428-a-holistic-way-through-depression"
}