{
  "title": "100 Deadly Skills: The SEAL Operative's Guide to Eluding Pursuers, Evading Capture, and Surviving Any Dangerous Situation",
  "description": "A hands-on, practical survival guide from retired Navy SEAL Clint Emerson—adapted for civilians from actual special forces operations—to eluding pursuers, evading capture, and surviving any dangerous situation.In today’s increasingly dangerous world, threats to your personal safety are everywhere. From acts of terror to mass shootings, and from the unseen (and sometimes virtual) matrix of everyday crime, danger is no longer confined to dark alleys or unstable regions. Potentially life-threatening circumstances can arise anywhere, anytime, and Clint Emerson—former Navy SEAL—wants you to be prepared.100 Deadly Skills contains proven self-defense skills, evasion tactics, and immobilizing maneuvers—modified from the world of black ops—to help you take action in numerous “worst case” scenarios from escaping a locked trunk, to making an improvised Taser, to tricking facial recognition software. With easy-to-understand instructions and illustrations, Emerson outlines in detail many life-saving strategies and teaches you how to think and act like a member of the special forces.This complete course in survival teaches you how to prevent tracking, evade a kidnapping, elude an active shooter, rappel down the side of a building, immobilize a bad guy, protect yourself against cyber-criminals, and much more—all using low-tech to “no-tech” methods. Clear, detailed, and presented in an easy-to-understand and execute format, 100 Deadly Skills is an invaluable resource. Because let’s face it, when danger is imminent, you don’t have time for complicated instructions.",
  "genres": [
    "Nonfiction",
    "Survival",
    "Self Help",
    "Military Fiction",
    "Reference",
    "War",
    "Espionage"
  ],
  "author": "Clint Emerson",
  "average_rating": "3.80",
  "url": "https://www.goodreads.com/book/show/25111028-100-deadly-skills"
}