{
  "title": "Raising Caine",
  "description": "Book Three in the Nebula award nominated and Compton Crook award winning series. Science fiction adventure on a grand scale.Caine Riordan, reluctant diplomatic and military intelligence operative, has just finished playing his part repulsing the Arat Kur’s and Hkh’Rkh’s joint invasion of Earth. But scant hours after the attackers surrender, the mysterious but potentially helpful Slaasriithi appeal to Caine to shepherd a diplomatic mission on a visit to their very alien worlds. The possible prize: a crucial alliance in a universe where the fledgling Consolidated Terran Republic has very few friends. But Caine and his legation aren’t the only ones journeying into the unknown reaches of Slaasriithi space. A group of renegade K’tor are following them, intending to destroy humanity’s hopes for a quick alliance. And that means finding and killing Caine Riordan. Assuming that the bizarre and dangerous Slaasriithi lifeforms don’t do it first.About Trial by Fire: “I seriously enjoyed Trial by Fire. This one’s a tidal wave—can’t put it down. An excellent book.” —Jack McDevitt on the prequel \"Gannon's whiz-bang second Tales of the Terran Republic interstellar adventure delivers on the promise of the first (Fire with Fire). . . . The charm of Caine's harrowing adventure lies in Gannon's attention to detail, which keeps the layers of political intrigue and military action from getting too dense. The dozens of key characters, multiple theaters of operations, and various alien cultures all receive the appropriate amount of attention. The satisfying resolution is enhanced by the promise of more excitement to come in this fascinating far-future universe.\"—Publishers Weekly Starred Review \". . . definitely one to appeal to the adventure fans. Riordan is a smart hero, up against enormous obstacles and surrounded by enemies. Author Gannon does a good job of managing action and tension to keep the story moving, and the details of the worlds Riordan visits are interesting in their own right..\"—Analog  \" . . . offers the type of hard science-fiction those familiar with the John Campbell era of Analog Science Fiction will remember. Gannon throws his readers into an action-packed adventure. A sequel to Fire With Fire, it is a nonstop tale filled with military science-fiction action.\" —Daily News of Galveston CountyAbout Compton Crook award winner for best first novel,  \nFire with Fire:\n “Chuck Gannon is one of those marvelous finds—someone as comfortable with characters as he is with technology, and equally adept at providing those characters with problems to solve. Imaginative, fun, and not afraid to step on the occasional toe or gore the occasional sacred cow, his stories do not disappoint.”—David Weber  \"If we meet strong aliens out there, will we suffer the fate of the Aztecs and Incas, or find the agility to survive? Gannon fizzes with ideas about the dangerous politics of first contact.”—David Brin \"The plot is intriguing and then some. Well-developed and self-consistent; intelligent readers are going to like it.\"—Jerry Pournelle \"[T]he intersecting plot threads, action and well-conceived science kept those pages turning.\"—SF CrowsnestAbout Starfire series hit, Extremis, coauthored by Charles E. Gannon: “Vivid. . . Battle sequences mingle with thought-provoking exegesis . . .”—Publishers Weekly \"It’s a grand, fun series of battles and campaigns, worthy of anything Dale Brown or Larry Bond ever wrote.\" —AnalogAbout Charles E. Gannon: \"[A] strong [writer of] . . . military SF. . .[much] action going on in his work, with a lot of physics behind it. There is a real sense of the urgency of war and the sacrifices it demands.\" —Locus",
  "genres": [
    "Science Fiction",
    "Space Opera",
    "Fiction",
    "Military Fiction",
    "Military Science Fiction",
    "Science Fiction Fantasy",
    "Survival"
  ],
  "author": "Charles E. Gannon",
  "average_rating": "4.03",
  "url": "https://www.goodreads.com/book/show/25110969-raising-caine"
}