{
  "title": "Wherever There Is Light",
  "description": "From the author of Comeback Love­, a sweeping, panoramic tale of twentieth-century America, chronicling the decades-long love affair between a Jewish immigrant and the granddaughter of a slave.Julian Rose is only fifteen when he leaves his family and Germany for a new life in 1920s America. Lonely at first, he eventually finds his way—first by joining up with Longy Zwillman and becoming one of the preeminent bootleggers on the East Coast, and later by amassing a fortune in real estate.Kendall Wakefield is a free-spirited college senior who longs to become a painter. Her mother, the daughter of a slave and founder of an African-American college in South Florida, is determined to find a suitable match for her only daughter.One evening in 1938, Mrs. Wakefield hosts a dinner that reunites Julian with his parents—who have been rescued from Hitler’s Germany by the college—and brings him together with Kendall for the first time. From that encounter begins a thirty-year affair that will take the lovers from the beaches of Miami to the jazz clubs of Greenwich Village to postwar life in Paris, where they will mingle with Sartre, Picasso, and a host of other artists and intellectuals. Through his years serving in American intelligence and as an interrogator at the Nuremberg trials, what Julian wants most is to marry and find the joy that eluded his parents. Kendall craves her freedom, and after trading her oil paints for a Leica camera, becomes a celebrated photographer, among the first American journalists to photograph the survivors of a liberated concentration camp. Yet despite distance, their competing desires, and the rapidly changing world, their longing for each other remains a constant in the ceaseless sweep of time.Captivating and infused with historical detail, this is the epic tale of three generations, two different but intertwined families, and one unforgettable love story.",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Book Club",
    "Romance",
    "Jewish",
    "World War II",
    "Literary Fiction"
  ],
  "author": "Peter Golden",
  "average_rating": "3.74",
  "url": "https://www.goodreads.com/book/show/25111147-wherever-there-is-light"
}