{
  "title": "Her Brother's Keeper",
  "description": "DEBUT SOLO NOVEL FROM THE CO-AUTHOR OF DEAD SIX . Air Force weapons expert Mike Kupari, co-author of Dead Six and Swords of Exodus, offers up a science fiction adventure. When privateer Captain Catherine Blackwood is enlisted to rescue her brother from a treacherous warlord, she finds herself on her most dangerous mission yet.It's been years since Catherine Blackwood left the stodgy, repressive colony world of Avalon. Now the captain of the privateer vessel Andromeda , she is the master of her own destiny. But Catherine soon finds herself back on Avalon after receiving a plea for help from a most unlikely her estranged father, esteemed Avalon Council member Augustus Blackwood.It seems Catherine's brother, the heir to the Blackwood aristocracy, has gone off in search of treasure on the failed, chaotic world of Zanzibar. But Cecil Blackwood's plans have gone very, very wrong, and he has been taken hostage and held for ransom by a fearsome local warlord. Augustus, knowing his daughter is the only one who can be trusted to return his son safely, swallows his pride and hires Catherine to bring her brother home.Catherine takes the job—but it won't be easy. Just getting to Zanzibar proves treacherous. And once she arrives, things only get worse. If she is to save her brother, Catherine Blackwood must face down danger at every turn and uncover a mystery four million years in the making.About Her Brother's Keeper :\"After cowriting Dead Six and Swords of Exodus with Larry ­Correia, Kupari makes his solo debut with this space opera that is bound to attract fans of Mike ­Shepherd’s Kris Longknife series or Elizabeth Moon’s Vatta’s War books. An excellent choice for both teen and adult sf readers.\"— Library Journal\"[P]age-turning action . . . may be Kuperi's best book yet.\"— Galveston County Daily News“ A big, sweeping space adventure, with heroic characters you care about. Mike Kupari is an awesome storyteller.”—Larry Correia",
  "genres": [
    "Science Fiction",
    "Space Opera",
    "Fantasy",
    "Military Fiction",
    "Audiobook",
    "Science Fiction Fantasy",
    "Fiction"
  ],
  "author": "Mike Kupari",
  "average_rating": "3.86",
  "url": "https://www.goodreads.com/book/show/25110971-her-brother-s-keeper"
}