{
  "title": "The Year of Lear: Shakespeare in 1606",
  "description": "Preeminent Shakespeare scholar James Shapiro shows how the tumultuous events in England in 1606 affected Shakespeare and shaped the three great tragedies he wrote that year— King Lear , Macbeth , and Antony and Cleopatra .In the years leading up to 1606, since the death of Queen Elizabeth and the arrival in England of her successor, King James of Scotland, Shakespeare’s great productivity had ebbed, and it may have seemed to some that his prolific genius was a thing of the past. But that year, at age forty-two, he found his footing again, finishing a play he had begun the previous autumn— King Lear —then writing two other great tragedies, Macbeth and Antony and Cleopatra .It was a memorable year in England as well—and a grim one, in the aftermath of a terrorist plot conceived by a small group of Catholic gentry that had been uncovered at the last hour. The foiled Gunpowder Plot would have blown up the king and royal family along with the nation’s political and religious leadership. The aborted plot renewed anti-Catholic sentiment and laid bare divisions in the kingdom.It was against this background that Shakespeare finished Lear , a play about a divided kingdom, then wrote a tragedy that turned on the murder of a Scottish king, Macbeth . He ended this astonishing year with a third masterpiece no less steeped in current events and Antony and Cleopatra .The Year of Lear sheds light on these three great tragedies by placing them in the context of their times, while also allowing us greater insight into how Shakespeare was personally touched by such events as a terrible outbreak of plague and growing religious divisions. For anyone interested in Shakespeare, this is an indispensable book.",
  "genres": [
    "History",
    "Nonfiction",
    "Biography",
    "Literary Criticism",
    "Literature",
    "Theatre",
    "Drama"
  ],
  "author": "James Shapiro",
  "average_rating": "4.06",
  "url": "https://www.goodreads.com/book/show/25111120-the-year-of-lear"
}