{
  "title": "VietnamEazy: A Novel About Mothers, Daughters and Food",
  "description": "Like Viet Thanh Nguyen’s acclaimed The Sympathizer, VietnamEazy captures with startling honesty and detail the dizzying dislocation that so many Vietnamese arrivals in the United States have experienced and, like Amy Tan’s The Joy Luck Club, explores the age-old mysteries of the mother-daughter relationship. It tells the story of Kieu, a Vietnamese-American woman, and her quest for success on a TV cooking show, introducing the intoxicating allure of Vietnamese food to a general audience, interwoven with the haunting, sorrowful tale of her family and upbringing. This is a universal tale of redemption that mothers and daughters can read together and discuss, preferably over a steaming bowl of pho.Kieu is an every-woman trying to navigate challenges that plague so many of us — a difficult mother who shows her love in all the wrong ways, a mix of insecurity and uneasy pride when it comes to her passion in life, bringing traditional Vietnamese cooking to the U.S. with the twist of doing so with simple recipes featuring ingredients easy to find. When to her astonishment she is chosen to compete in the reality-TV cooking program 'Sliced and Diced,' famously cutthroat and competitive, she embarks on a journey of personal discovery that will take her in surprising new directions - leaving her in the end with no easy answers, but a deeper sense of connection to her mother and grandmother and to the land of her birth. Along the way Cron, a gifted cook, brings alive the delectable flavors and textures of Vietnamese food. Each of the eight chapters starts with a recipe, which the story of the chapter then evokes in vivid, unforgettable detail, and together the eight recipes of the book add up to an entire feast - literally, an epic meal much like that served to Vietnamese Emperors, and also figuratively, a feast of story-telling.",
  "genres": [
    "Fiction"
  ],
  "author": "Trami Nguyen Cron",
  "average_rating": "3.68",
  "url": "https://www.goodreads.com/book/show/25110749-vietnameazy"
}