{
  "title": "Twig",
  "description": "The year is 1921, and a little over a century has passed since a great mind unraveled the underpinnings of life itself. Every week, it seems, the papers announce great advances, solving the riddle of immortality, successfully reviving the dead, the cloning of living beings, or blending of two animals into one. For those on the ground, every week brings new mutterings of work taken by ‘stitched’ men of patchwork flesh that do not need to sleep, or more fearful glances as they have to step off the sidewalks to make room for great laboratory-grown beasts. Often felt but rarely voiced is the notion that events are already spiraling out of the control of the academies that teach these things.It is only this generation, they say, that the youth and children are able to take the mad changes in stride, accepting it all as a part of day to day life. Of those children, a small group of strange youths from the Lambsbridge Orphanage stand out, taking a more direct hand in events.Twig is Wildbow’s (J.C. McCrae’s) third web serial, following the underground hit Worm and the successful-enough Pact. As was the case for the prior two stories, Twig will be written on Mondays, some Wednesdays (see below), and Fridays, with chapters going live at midnight, Eastern Standard Time (thus being released very first thing on Tuesdays, some Thursdays, and Saturdays). Chapters are grouped into story arcs each about as long as a novella or short novel, listed in the table of contents and available on the sidebar.Wildbow writes full-time and strives to maintain a professional schedule, with chapters released on time (barring very minor delays with internet issues or website malfunction) for three and a half years and counting. Donations via. Paypal and subscriptions via. Patreon are accepted and remain very much appreciated, as they allow the author to stay fed, stay sheltered, and keep writing. As thanks for this support, the author schedules added chapters to be released on a future Thursday when certain totals are reached.Those on the lookout for trigger warnings should probably be warned, the author’s style leans toward the dark and violent. To clarify to those not familiar with the term: if a key word or storyline touching on a particular topic could ruin your day or induce panic attacks, you might want to steer clear of Twig, as it is likely to touch on many. Sex, however, will happen offscreen if it happens at all, and sex-related triggers are generally avoided, both due to authorial preference. Swearing and violence are likely to be present, if not outright common, so be warned. Use your own judgment to estimate your tolerances and decide if Twig is the sort of thing you’re comfortable reading.If you decide you’re alright with that, you can start reading here.J.C. McCrae can be contacted at Wildbowpig@gmail.com for the time being. He would prefer that fans use the comment section rather than email, if there’s any choice between the two. He gets a great many emails and his attempts to filter and sort things in the shuffle mean that emails can get lost by the wayside, while he does read every comment.",
  "genres": [
    "Fantasy",
    "Fiction",
    "Science Fiction",
    "Horror",
    "Steampunk",
    "Web",
    "Dark"
  ],
  "author": "Wildbow",
  "average_rating": "4.37",
  "url": "https://www.goodreads.com/book/show/25116766-twig"
}