{
  "title": "Friction",
  "description": "Crawford Hunt wants his daughter back. Following the death of his wife four years ago, Crawford, a Texas Ranger, fell into a downward spiral that left him doing deskwork rather than fieldwork, and with his five-year-old daughter Georgia in the custody of her grandparents. But Crawford has cleaned up his act, met all the court imposed requirements, and now the fate of his family lies with Judge Holly Spencer.Holly, ambitious and confident, temporarily occupies the bench of her recently deceased mentor. With an election upcoming, she must prove herself worthy of making her judgeship permanent. Every decision is high-stakes. Despite Crawford's obvious love for his child and his commitment to being an ideal parent, Holly is wary of his checkered past. Her opinion of him is radically changed when a masked gunman barges into the courtroom during the custody hearing. Crawford reacts instinctually, saving Holly from a bullet. But his heroism soon takes on the taint of recklessness. The cloud over him grows even darker after he uncovers a horrifying truth about the courtroom gunman and realizes that the unknown person behind the shooting remains at large . . .and a threat. Catching the real culprit becomes a personal fight for Crawford. But pursuing the killer in his customary diehard fashion will jeopardize his chances of gaining custody of his daughter, and further compromise Judge Holly Spencer, who needs protection not only from an assassin, but from Crawford himself and the forbidden attraction between them. FRICTION will keep you on the edge of your seat with breathtaking plot twists and the unforgettable characters that make Sandra Brown one of the world's best-loved authors. It is an extraordinary novel about the powerful ties that bind us to the ones we love and the secrets we keep to protect them.",
  "genres": [
    "Mystery",
    "Romance",
    "Romantic Suspense",
    "Fiction",
    "Suspense",
    "Thriller",
    "Audiobook"
  ],
  "author": "Sandra       Brown",
  "average_rating": "3.99",
  "url": "https://www.goodreads.com/book/show/25114548-friction"
}