{
  "title": "I Refused to Bribe",
  "description": "The protagonist Jitesh is an honest banker who refuses to sanction a business loan to an industrialist, Satish, whose factory is running at a loss. When Satish offers a bribe to Jitesh, the latter abuses the industrialist and threatens to call the police. Undeterred by all this, Satish approaches Arora who is Jitesh’s senior officer and offers him a share in his business. Arora puts pressure on Jitesh to ignore certain norms and stipulations and approve the loan, but Jitesh succumbs neither to greed nor pressure. Arora and Satish turn hostile towards Jitesh. A few days later at the bank, Jitesh helps an unknown customer, who claims to be illiterate, to fill his withdrawal form. The customer is later identified as a conman who fraudulently withdraws money from someone else’s account. His arch rival Arora manipulates facts and Jitesh is named in the chargesheet. Jitesh is suspended from his job and faces a judicial inquiry that lasts for 14 long and painful years. During the long ordeal, Jitesh is flooded with offers to bribe his way out of the matter and this includes vigilance officers, bank officials, CID officers, court clerks and even the judge. Arora connives with businessmen and amasses huge wealth through underhand means. Arora ignores his family and takes to the wrong path in personal life also. What has destiny in store for him? Is he able to escape from the clutches of justice? ********************************** ABOUT THE AUTHOR: Gireesh Sharma, soldier-turned-author, writes straight from his heart. Born in 1973 in a small hamlet near Aligarh, he was brought up by his grandfather-in-law, an active political leader. It was under his tutelage that he developed patriotic fervour and on turning 17 years of age, chose to join the Indian Air Force to serve the nation. After his retirement, he worked with several youth organisations and today actively participates in socio-political activities to bring a positive change in the country. He is working as a marketing manager in a software company and enjoys writing books during his spare time. I Refused to Bribe is his first fiction, though he has written three popular non-fictions: 'Office Politics', 'How to Win the Heart of Your Wife' and 'Stay Free, Stay Happy'.http://www.amazon.com/gp/search/ref=s...",
  "genres": [
    "Fiction"
  ],
  "author": "Gireesh Sharma",
  "average_rating": "3.68",
  "url": "https://www.goodreads.com/book/show/25119841-i-refused-to-bribe"
}