{
  "title": "Devil's Ride",
  "description": "Alex knew love wasn’t easy   Alex may have accepted the chemistry between her and Cain, but it sure as hell doesn’t mean she has to love him. She knows she wants her unborn child’s father to be involved in its life – but how much does she want this dangerous, magnetic man to be involved in hers?   Cain is torn between his darkest demons and his deepest desires   Cain has never felt more certain of anything in his life. There’s just one problem… the woman he desires wants almost nothing to do with him. Not to mention his stake in the Hellhounds is in trouble if he doesn’t shut down their rival gang’s initiative to take their clients from under their feet – and fast.   Nothing is harder than committing the right sin   Danger has always been the norm for Cain, but when Alex is involved, the stakes are raised to a new level. Now Cain must prove to Alex that he’s ready to do what it takes in his lifelong debauchery as a Hellhound, but not let anyone get hurt in the process. Easier said than done. And neither of them are prepared for the backlash that will put their lives on the line…  EXCERPT  I decided that I was going to do it, that I was going to make the leap of faith as my grandmother had. I leaned into the kiss, forcing Cain’s head back as I rose and sat astride of him, losing myself in the kiss. He pulled me in, holding me tight, his arms wrapping around me and holding me so that I felt protected in a way that I never had before.  He pulled back from the kiss, his lips going to the hollow of my throat where he kissed, his tongue busy caressing my skin. I didn’t love him, but I wanted to. I wanted to fall deeply, madly, head over heels, can’t live without him, in love with him. I opened my heart and, once again, I felt the connections form, tenuous, delicate, easily broken, but there.  “I want you,” I whispered as I held his head to my neck, my face leaning lightly against his hair.  He rose, picking me up with him, and carried me to my bedroom as I wrapped my legs around his back. This was a near repeat of the last time I asked him to stay, but this time I wouldn’t send him away. He dumped me into the bed, falling with me, pressing me into the mattress with his weight and I smiled at him.",
  "genres": [],
  "author": "Kathryn Thomas",
  "average_rating": "3.63",
  "url": "https://www.goodreads.com/book/show/25116601-devil-s-ride"
}