{
  "title": "Devil's Kiss",
  "description": "A single night of sensuality   Alexandra Berndhart was happy with her life, and proud of her difficult, hard-working journey to get to where she was: bartending at one of the most exclusive clubs in the city. It led to a lot of fun, and Alex was always looking forward to what was coming next. That was, until the club is booked one night by a motorcycle club she’s only heard rumors about: the Hellhounds.   Cain’s prerogative is to work hard, and play harder   Cain Rodgers led a life of hedonism and luxury, just how he wanted it. Moving weapons to high-profile clients in the area tended to leave one with more money than they knew what to do with, but he seemed to be doing just fine spending it on all the girls, drugs, and alcohol he could dream of. But what was supposed to be just another reckless night out on the town with the boys ends up with more consequences than he could have ever imagined.   Sometimes the right mistake is the sweetest sin   A drunken, passionate evening is the norm for Cain, but everything still felt different with Alex. Without the time to find her before the Hellhounds move on out, he reluctantly leaves their encounter as a one night stand. Alex, however, has a whole new set of problems to deal with, and a pregnancy test is just the beginning of it…  EXCERPT  He picked me up as if I weighed nothing at all and carried me through my house to my bedroom where he placed me carefully in the center of the bed. He pulled back and simply looked at me, his eyes taking me in as if seeing me for the first time, his expression making me feel like the most beautiful woman in the world.  I didn’t move, allowing him to look at me as I warmed with his gaze. I could feel the first tenuous connections forming between us and I smiled. Perhaps we were meant to be together. I held my arms out, offering myself to him, and his smile touched me. Not the smile of a man taking something he had won, but the smile of a man that was receiving a cherished gift.  He leaned in and took my lips as his fingers drifted along my cheek, his touch gentle, as if he were handling the most delicate flower. He slowly undressed me, removing my button down blouse, jeans, and sneakers, his lips never long removed from my skin. I had managed to unbutton his shirt, but nothing else, and I wanted to feel his flesh against mine. I pulled him up by his arms and he came, his lips finding mine. I pushed his shirt over his shoulders and he allowed it to fall as I began to work on his belt.  He allowed me to open his pants and I reached inside, taking his hardness into my hand, each beat of his heart a pulse in my hand. As I held him, he kissed me with intent, a kiss as erotic as any I ever had, and it practically took my breath.  “I want you,” I whispered as I stared into his eyes.  His smile returned and he beamed at me as his face softened. “I want you,” he whispered in return.",
  "genres": [],
  "author": "Kathryn Thomas",
  "average_rating": "3.39",
  "url": "https://www.goodreads.com/book/show/25118183-devil-s-kiss"
}