{
  "title": "The Heart of the Game",
  "description": "From USA Today bestselling author Pamela Aares comes The Heart of the Game, the sixth book in the Tavonesi family series featuring passion, mystery, and well-won love! “I highly recommend this series to any readers who love Nora Roberts or Bella Andre.” ~ Book Lover ReviewsWhen Cody Bond, the Giants’ hot new catcher, agrees to ride in a benefit polo match to help heiress Zoe Tavonesi, he falls hard for the Italian beauty. Cody’s determined not to screw up his career with relationships, especially when Zoe and the loving, tight-knit, aristocratic Tavonesis remind him of everything his dysfunctional American family isn’t. But while he may be a master of control on the baseball field, Cody’s iron will can’t shield him from the desire Zoe awakens.Zoe wants nothing to do with her family's new home and vineyard in the California wine country. Every day spent in exile from the world she loves in Rome feels like an eternity. Her heart's set on returning to Italy and opening the art gallery her late mother always wanted. But the passion Cody fires has her second-guessing her plan and her dreams.Just as they open to love, Zoe's family is caught up in a dangerous web of Mafia crime. To protect her, Cody must swallow his pride and turn to an ex-CIA operative for help—his estranged father—even as he suspects that Zoe's family is involved in foul play. But will Zoe’s stubborn determination, Cody's inability to trust, and the criminals threatening the Tavonesi family kill any chance for the world-altering love they’ve discovered?Discover what readers are so excited about:While every book in The Tavonesi Series can be read as a standalone, you may enjoy reading all the books in the series: See why readers have fallen in love with this Amazon bestseller!Love Bats Last (Book 1, Jackie and Alex)Thrown By Love (Book 2, Chloe and Scotty)Fielder's Choice (Book 3, Matt and Alana)Love On The Line (Book 4, Cara and Ryan)Aim for Love (Book 5, Sabrina and Kaz)The Heart of the Game (Book 6, Cody and Zoe)Love in the Vineyard (Book 7, Adrian and Natasha)“These stories show us that sometimes the best dreams are the ones we don’t even know we are searching for.” ~ InD’tale Magazine  AUTHOR BIOGRAPHY: Pamela Aares is a USA Today Bestselling, award-winning author of contemporary and historical romance novels. Her contemporary series, The Tavonesi Series, explores the lives, loves, friendships and sizzling romances of the Tavonesi family. Before becoming a romance author, Aares wrote and produced award-winning films including Your Water, Your Life, featuring actress Susan Sarandon and NPR series New Voices, The Powers of the Universe and The Earth’s Imagination. Pamela loves to hear from readers! You can contact her via her website www.PamelaAares.comContemporary Romance Categories: (Alpha males,strong women,sensual romance,new adult romance,wealthy heroes,baseball,sports heroes,heiresses,love story, contemporary romance, alpha heroes, beach reads, sexy romance, bad boys, falling in love, new kindle romance)",
  "genres": [
    "Romance",
    "Contemporary Romance",
    "Sports Romance",
    "Sports",
    "Womens Fiction"
  ],
  "author": "Pamela Aares",
  "average_rating": "4.40",
  "url": "https://www.goodreads.com/book/show/25118005-the-heart-of-the-game"
}