{
  "title": "Miles Away",
  "description": "The mafia couldn't kill him. Prison couldn't break him. Going home threatens to do both.  Miles Capadonno has made some mistakes. Once part of the Capadonno crime family, he took the fall for another member of the crime family who once tried to kill him. At age 17, they put a contract out on Miles' head for neglecting to complete a job. It was a matter of priority. Miles went to his dying mother's side instead of picking up stolen merchandise from the ship yard. When you're in with the Capadonno's, whether you're blood or sworn in, when they say jump you jump, when they say kill you kill. Ignoring an order is an offense of the highest degree. When they couldn't kill him, they let Miles take the fall for another Capadonno family member. Now 15 years later, Miles is being released. He is ready to put his past behind him. There's only one problem. There is still a contract on Miles' head. This time, Miles is man enough to collect on owed debts, and he will not back down from the family that stabbed him in the back.  Leticia \"Letty\" Alves is a saucy Latina and Miles' old high school girlfriend. She was only 16 when Miles was arrested, but she hasn't stopped wondering about the boy who charmed her all those years ago. Now working as a nurse for a home health agency, Letty's priorities are to take care of herself and her 18 month old son, Gabriel. But when Miles walks back into her life everything changes, and suddenly, the family that she had avoided all her life, is now breathing down her neck looking for Miles. Letty is no damsel in distress, though. She's a fighter, and she never backs down from a challenge.  Sparks fly when Miles and Letty reunite. Can they put their differences aside to become one again? Can Miles set down his pride and accept the help and love that Letty can provide? Will Letty get over her resentment over being left so long ago when Miles was arrested? Only readers know for sure.  Welcome to Carrion, New Jersey, where the Capadonno's call the shots. Miles was away for so long, but now the prodigal son has returned. One thing is for sure, the family business isn't ready for a bastard like him.",
  "genres": [
    "Romance",
    "Dark",
    "Suspense",
    "Crime",
    "Contemporary Romance",
    "Mafia Romance",
    "Amazon"
  ],
  "author": "Addison Kline",
  "average_rating": "3.87",
  "url": "https://www.goodreads.com/book/show/25118576-miles-away"
}