{
  "title": "The Breast Cancer Wars: Hope, Fear, and the Pursuit of a Cure in Twentieth-Century America",
  "description": "In this riveting narrative, Barron H. Lerner offers a superb medical and cultural history of our century-long battle with breast cancer. Revisiting the past, Lerner argues, can illuminate and clarify the dilemmas confronted by women with--and at risk for--the disease. Writing with insight and compassion, Lerner tells a compelling story of influential surgeons, anxious patients and committed activists. There are colorful portraits of the leading figures, ranging from the acerbic Dr. William Halsted, who pioneered the disfiguring radical mastectomy at the turn of the century to Rose Kushner, a brash journalist who relentlessly educated American women about breast cancer.Lerner offers a fascinating account of the breast cancer the insistent efforts of physicians to vanquish the \"enemy\"; the fights waged by feminists to combat a paternalistic legacy that silenced patients; and the struggles of statisticians and researchers to generate definitive data in the face of the great risks and uncertainties raised by the disease. And for this new paperback edition, Lerner has included a postscript in which he discusses the most recent breast cancer do mammograms truly lower mortality rates or do they lead to unnecessary mastectomies?In Lerner's hands, the fight against breast cancer opens a window on American medical practice over the last the pursuit of dramatic cures with sophisticated technologies, the ethical and legal challenges raised by informed consent, and the limited ability of scientific knowledge to provide quick solutions for serious illnesses. The Breast Cancer Wars tells a story that is of vital importance to modern breast cancer patients, their families and the clinicians who strive to treat and prevent this dreaded disease.",
  "genres": [
    "Nonfiction",
    "History",
    "Medical",
    "Economics",
    "Politics",
    "Health",
    "American History"
  ],
  "author": "Barron H. Lerner",
  "average_rating": "3.94",
  "url": "https://www.goodreads.com/book/show/251212.The_Breast_Cancer_Wars"
}