{
  "title": "Flat Out Flat Broke: The Original Stig",
  "description": "Perry McCarthy is an ex Formula One racing driver and was the original ‘Stig’ from the BBC Top Gear TV show. Flat Out Flat broke is his hilarious and internationally acclaimed autobiography which takes you on Perry’s roller-coaster adventure as he battled on and off the race tracks of the world to fulfil his dream of Grand Prix stardom. One of the best selling motor racing books of all time, Perry’s story will have you on the edge of your seat either on the verge of tears or howling with laughter at both his bizarre misfortune and his triumphs against the odds. Don't miss it, it's the life story of a battler, a maestro in so many disciplines. But overall Perry McCarthy knows how to recover from failure and create success. From working on oil rigs to fame as The Stig, Flat Out Flat Broke is an utterly fascinating read and you will see why even other racing drivers affectionately call him ‘Mad Dog’! Perry McCarthy’s hilarious autobiography Flat Out, Flat Broke, has already become a motor racing best seller and has received rave SAMPLE OF MAGAZINE/NEWSPAPER  ‘ ... this book is hilarious’ Autosport ‘Perry McCarthy does for Formula One what Bill Bryson did for travel writing. But beneath the black humour and wisecracks – funny enough to make you laugh out loud in public – lies an inspiring and at times poignant tale of that rarest kind of one who never gave up and was, literally, prepared to die trying.’ The Independent on Sunday ‘Perry McCarthy has always been excellent at describing his career in a series of memorable anecdotes, and here they are, strung together in book form. The reader is frequently left racked with sympathy at the author’s outrageous misfortune, or in convulsive sobs of laughter. This is an utterly fantastic read.’ MotorSport magazine ‘Sometimes books, like cigarette packets, should come with a surgeons health warning. Flat Out Flat Broke is a case in point, not just because it contains photographs of the author in the long forgotten days of his early childhood, but because it will make your stomach ache from laughing.’ F1 Magazine '…. A fantastic funny story' (Book of the week) The London Evening Standard ‘His engaging story of a less-than-smooth life in motor racing exudes his own cockney energy and enthusiasm and is a charming feel good tale that shows you can get what you want if you want it badly enough’ Scottish Sunday Express ‘The James Hunt impressions, the Ayrton Senna pizza delivery, the Rat Pack stories - the laughs come thick and fast in Perry McCarthy’s fantastic new book, Flat Out Flat Broke …’ Daily Express ‘The third edition of Perry McCarthy’s autobiography is a brilliant read’ Auto Express SAMPLE OF AMAZON CUSTOMER  'Fantastic' Mr. J. W. Wood (Grimsby, UK) 'Brilliant!' By True Reader' \"Brock\" (London, England) 'Fantastic very funny!' By S.",
  "genres": [],
  "author": "Perry McCarthy",
  "average_rating": "4.28",
  "url": "https://www.goodreads.com/book/show/25124669-flat-out-flat-broke"
}