{
  "title": "Twisting Fate",
  "description": "Corrupt politicians are dropping dead and innocent people are being framed for their murders. Will a young female police officer uncover the truth behind what's really happening?  Officer Kate Murphy has had a tough start in life: her parents and younger brother were killed in a burglary gone bad when she was just a teenager, so her Uncle Kenny took her in and raised her as his own. When his DNA is found at a murder scene, Kate becomes determined to prove that her last remaining relative is innocent. In the process, she is reacquainted with Luke, the crime laboratory supervisor and a childhood friend who stirs feelings in her she can't deny.  But Kate, Luke, and the rest of the world don’t yet realize that a much bigger scheme is at play. Scientists have developed new technologies that encroach on our civil liberties, blur the lines between right and wrong, and turn our societal ethics upside down. They’ve created their own private army and have just one goal: cull the herd and reshape our world.  Will Kate manage to navigate the hurdles that this case throws at her and save her uncle before it’s too late?  Here's what reviewers thought of this romantic police procedural novel:  \"TWISTING FATE is an accomplished mix of romance, mystery, science and police procedural. TWISTING FATE is full of surprises. It begins as a solid police procedural with an appealing lead character and an impressive supporting cast. Officer Kate Murphy is a dedicated policewoman hoping to make detective. Her inability to build connections with her coworkers impedes her career. Kate is lonely, funny, compassionate, prickly and sensual. She uses all of her innate characteristics to pursue a case involving her closest living relative. As odd clues start stacking up, Kate becomes sure that something very unusual is happening. When an autopsy uncovers an impossible identification, the story shifts on its axis and suddenly is not so classifiable. Not many first-time authors have the talent to introduce Wonder Woman and Doctor Who into a romantic murder mystery and sustain a realistic, exciting plot. In TWISTING FATE, Caro Bégin has accomplished that and more. I avoided tax preparation, sleep, and meals while this book held me captive. I recommend you do the same.\" -- I Love Reading  \"A fascinating book about cloning This is one of the most fascinating books I have read in a very long time. It is set in the now, the characters are well described, the story line easy to follow and once you start reading you will not stop unless there is a fire or another emergency. The heroine wishes to become a detective but finds it tough to get along in a man’s world. Her life has not been easy but she overcomes her past and finds herself absorbed into a strange case involving cloning.\" -- Mags  This romantic suspense novel appeals to those who like strong female protagonists, police procedurals, crime fiction, and TV shows like CSI and Sex & The City.  Categories: Crime fiction, romantic suspense police thriller, romantic science-fiction novel, romantic thrillers, romantic psychological thriller, police procedural novel, romantic police procedural thriller, crime fiction new releases, romantic science-fiction",
  "genres": [],
  "author": "Caro Bégin",
  "average_rating": "4.27",
  "url": "https://www.goodreads.com/book/show/25126628-twisting-fate"
}