{
  "title": "Devil's Sin",
  "description": "Cain’s not going home empty-handed   Cain has gone all in to get what he wants, and nothing is going to stop him after promising that to Alex. With the help of his closest brothers, they’re going to shut down the Blacktop Bulls’ secret deal with everything they’ve got.   Alex will put everything on the line    She’s never one to give up, but Alex is at risk of losing everything if Cain doesn’t win this fight. With not only her life at stake, can she afford to keep faith in the man she loves in hopes of him giving up everything for them?   It’s the highest risk for the highest reward: a love like an inferno.   Tensions boil to an all-time high, and just when things look like they’re getting better, the truth about the Hellhounds comes out. It’s going to take a miracle to save this rugged biker and the feisty girl-next-door, and their luck has all but run out. Everything rides on one last ante up: the gamble for life, for the truth, and for a love that overcomes all obstacles…  EXCERPT  He lowered his arm over my head, his other arm coming around my back. “I didn’t have anything to say. I already had everything I wanted.”  “What was that?”  “You, in my arms.”  I leaned into his chest. “Can we start over? Can we go back to the beginning and try again. Pretend the last couple of months haven’t happened?”  “No. I don’t want to give up even one memory of you.”  I whimpered. “Can you forgive me then?”  “Nothing to forgive. I’m sorry I dragged you into this. You had every right to be concerned. I’m glad you were worried over the baby. But now that you’ve seen the club, will you trust me?”  “Yes. I trust you.”  I expected him to pull my lips to his, but when he didn’t move, I looked up at him. He was smiling down at me and moved to offer me his lips, but he gave me the choice to kiss him or not. I stretched up and closed the remaining distance.  As we stood in the bathroom, Cain naked to the waist, my desire for him surged. I knew I had misjudged him from the beginning. He was a good man. All the Hounds appeared to be good men. To have Cherie tell me so plainly how the club interacted made me feel more comfortable with them. They had a certain... honor... about them.  I stepped back from the kiss and took his hand. “Are you able to perform tonight?” I asked as I continued to walk backwards, pulling him along.  “Does this mean I don’t have to sleep on the couch again tonight?” he teased as he followed along in my wake.  I felt guilty that I had let him do that for the last few nights. “So long as you don’t disappoint me,” I teased.",
  "genres": [],
  "author": "Kathryn Thomas",
  "average_rating": "3.78",
  "url": "https://www.goodreads.com/book/show/25123023-devil-s-sin"
}