{
  "title": "The Panty Whisperer: Volumes 1 - 5",
  "description": "**Warning: This a collection of short stories. They contain adult language and hot, steamy, balls deep sexual situations written to make your thighs quiver and your toes curl. Enjoy!**  JOEL IS BACK!!  This collection includes the original plus four additional fast-paced, panty-dropping short stories.  Have you ever been pushed to the edge, and then over it? Have you ever had your toes cramp and your head shoot to the sky, trying to log every touch, every feeling in your memory, to reenact every situation later in the shower, or underneath your cool bed sheets? Have you ever had someone own your mind, penetrating every single one of your sexual fantasies, unable to shake free of them?  The thought of me will be a thirst you can't quench, an itch you just can't scratch, a drug that you cannot have. Every time you run your fingers down over your body, longing for that unattainable feeling I gave you, that warm sensation shooting into your toes, that complete surrender of all inhibition, aching for me to have you just one more time, I'll be there, inside your mind...  My name is Joel Hannover and I am the panty whisperer. Some men are good at business, some gifted at mathematics--I'm good at making women come, hard. It's a gift I've possessed my entire life. If there was a girl nobody could bed, I was the first to get there. I always get there. I work as an accounting software consultant. That's a fancy way of saying I'm a salesman. Accounting departments are full of women, dressed conservatively, presumed to live boring, mundane lives. Nothing could be further from the truth. These women are unique, sexual creatures, yearning for someone to take them to their breaking point and beyond.  Will Joel finally meet his match? You'll have to read to find out...",
  "genres": [
    "Erotica",
    "Romance"
  ],
  "author": "Sloane Howell",
  "average_rating": "4.03",
  "url": "https://www.goodreads.com/book/show/25127727-the-panty-whisperer"
}