{
  "title": "Ion",
  "description": "Series CopyBased on the conviction that only translators who write poetry themselves can properly recreate the celebrated and timeless tragedies of Aeschylus, Sophocles, and Euripides, The Greek Tragedies in New Translations series offers new translations that go beyond the literal meaning of the Greek in order to evoke the poetry of the originals. Under the editorship of Herbert Golder and the late William Arrowsmith, each volume includes a critical introduction, commentary on the text, full stage directions, and a glossary of the mythical and geographical references in the plays.One of Euripides' late plays, Ion is a complex enactment of the changing relations between the human and divine orders and the way in which our understanding of the gods is mediated and re-visioned by myths. The story begins years before the play begins, with the rape of the mortal Kreousa, queen of Athens, by Apollo. Kreousa bears Apollos' child in secret then abandons it. Unbeknownst to her, Apollo has the child brought to his temple at Delphi to be reared by the priestess as ward of the shrine. Many years later, Kreousa, now married to the foreigner Xouthos but childless, comes to Delphi seeking prophecy about children. Apollo, however, speaking through the oracle, bestows the temple ward, Ion, on Xouthos as his child. Enraged, Kreousa conspires to kill as an interloper the very son she has despaired of finding. After mother and son both try to kill each other, the priestess reveals the birth tokens that permit Kreousa to recognize and embrace the child she thought was dead. Iondiscovers the truth of his parentage and departs for Athens, as a mixed blood of humanity and divinity, to participate in the life of the polis.In Ion , disturbing riptides of thought and feeling run just below the often shimmering surfaces of Euripidean melodrama. Although the play contains some of Euripides' most beautiful lyrical writing, it quivers throughout with near disasters, poorly informed actions and misdirected intentions that almost result in catastrophe. Kreousa says at one point that good and evil do not mix, but Euripides' argument, and what the youthful Ion strives to understand, is that human beings are not only compounded of good and evil, but that the two are often the same thing differently experienced, differently understood, just as beauty and violence are mixed both in the gods and in the mortal world.",
  "genres": [
    "Plays",
    "Classics",
    "Drama",
    "Mythology",
    "Fiction",
    "Poetry",
    "Greece"
  ],
  "author": "Euripides",
  "average_rating": "3.71",
  "url": "https://www.goodreads.com/book/show/1152993.Ion"
}