{
  "title": "Not Gay: Sex Between Straight White Men",
  "description": "A different look at heterosexuality in the twenty-first centuryA straight white girl can kiss a girl, like it, and still call herself straight—her boyfriend may even encourage her. But can straight white guys experience the same easy sexual fluidity, or would kissing a guy just mean that they are really gay? Not Gay thrusts deep into a world where straight guy-on-guy action is not a myth but a reality: there’s fraternity and military hazing rituals, where new recruits are made to grab each other’s penises and stick fingers up their fellow members’ anuses; online personal ads, where straight men seek other straight men to masturbate with; and, last but not least, the long and clandestine history of straight men frequenting public restrooms for sexual encounters with other men. For Jane Ward, these sexual practices reveal a unique social space where straight white men can—and do—have sex with other straight white men; in fact, she argues, to do so reaffirms rather than challenges their gender and racial identity.Ward illustrates that sex between straight white men allows them to leverage whiteness and masculinity to authenticate their heterosexuality in the context of sex with men. By understanding their same-sex sexual practice as meaningless, accidental, or even necessary, straight white men can perform homosexual contact in heterosexual ways. These sex acts are not slippages into a queer way of being or expressions of a desired but unarticulated gay identity. Instead, Ward argues, they reveal the fluidity and complexity that characterizes all human sexual desire. In the end, Ward’s analysis offers a new way to think about heterosexuality—not as the opposite or absence of homosexuality, but as its own unique mode of engaging in homosexual sex, a mode characterized by pretense, dis-identification and racial and heterosexual privilege. Daring, insightful, and brimming with wit, Not Gay is a fascinating new take on the complexities of heterosexuality in the modern era.",
  "genres": [
    "Nonfiction",
    "Queer",
    "Sexuality",
    "LGBT",
    "Gay",
    "Sociology",
    "Psychology"
  ],
  "author": "Jane Ward",
  "average_rating": "3.69",
  "url": "https://www.goodreads.com/book/show/25137060-not-gay"
}