{
  "title": "Such Sweet Thunder",
  "description": "“For those of us who are used to handling manuscripts — sometimes to examine them line by line, more often to flip through the pages — it’s a privileged moment indeed when we realize that we are dealing with a text destined for that small shelf of memorable literature certain to be printed and reprinted over the years. The telltale signs, for me, are trembling hands, eyeglasses clouding over — the psychological equivalent of a thunderclap. The book you have in hand now provided all of these emotions. ”-- From The Foreword By Herbert R. LottmanSUCH SWEET THUNDER opens in 1944, somewhere in France, near the fighting. Amerigo Jones, a young foot soldier, is invited by a buddy to bed down with a French girl who has put herself at the service of a black United States infantry unit. But when Amerigo half-reluctantly goes to her he sees not a hardened prostitute, but a sad and bewildered innocent. In a daze, he watches her features take on the aspect of Cosima Thornton, the great obsession of his youth in his native Kansas City. This moment of connection serves as the springboard for a unique and compelling novel that deserves a place of prominence in American literature. Amerigo drifts back in time, so far back he recalls suckling at his mother’s breast. We see life through the eyes of the boy at each stage of his development as he struggles for independence, respect, understanding from his friends and elders, and above all, love.Set during the segregated 1920s and ’30s, Such Sweet Thunder is laced throughout with references to the struggle for justice and freedom, with many allusions to the white man and the white man’s strange, brutal, and just plain crazy ways. But Amerigo also learns about sexuality, love, art, literature, and life itself — the standard themes of the European bildungsroman. Amerigo is a dreamer, and yet it is clear that many of his dreams will go unfulfilled, not because of who he is but because of the color of his skin.Such Sweet Thunder is a jazz song of a book, a river of sound, something like an epic poem. Carter dedicates the novel to Duke Ellington, and it is replete with references to the influential musicians of the Kansas City jazz scene of his youth — Count Basie, Jay McShann, Big Joe Turner, and the young Charlie Parker. And there are references to Louis Armstrong, whose scat singing is a lot like the extended dialogue riffs between the book’s characters. Jazz musicians in Kansas City during the Depression created an influential big band sound, and in a way Carter has structured his book similarly. It has an orchestral feel — it’s big; it’s got sweep; the characters are like musical instruments, carrying their own themes; there are solos, set pieces, drama, comedy, and pathos — and all are arranged to transport the reader on an evocative and emotional journey.Carter has written an unprecedented literary portrait of African American life, but at the heart of this grandly told story is a boy, Amerigo Jones, full of life and humor and as desirous and deserving of love as any child. Part of the greatness of Carter’s achievement is his ability to write the way a young boy truly experiences the world. And his depiction of the noisy, jostling, mysterious, fascinating world rich with warmth and fun, danger, and uncertainty in which Amerigo must find his way is as overwhelming and unforgettable as any to be found in literature.",
  "genres": [
    "Fiction",
    "Literary Fiction",
    "Historical Fiction"
  ],
  "author": "Vincent O. Carter",
  "average_rating": "3.43",
  "url": "https://www.goodreads.com/book/show/1153037.Such_Sweet_Thunder"
}