{
  "title": "Heidel",
  "description": "A tempestuous princess + an arrogant prince = a recipe for royal disaster.  Heidel never wanted to be a cookie-cutter princess. She isn’t graceful. She isn’t sweet. She isn’t even skinny! Heidel would much rather cook than curtsy; is more interested in eating than etiquette.The Nine Princesses are preparing for the annual festival known as Fenwick’s Feast. Heidel plans to enter the King’s Cake Contest given by the famous-but-crazy king of Bauble. But also entering the contest is arrogant Prince Eravis who sneers at Heidel’s cooking skills, insults her rounded figure, and mocks her ambition to cure the world of Red Fever.Caught up in her culinary conquest, Heidel barely notices that another enemy simmers on the back burner, one much more deadly than a sarcastic prince. An enemy who may hold the secret to the princesses’ long lost servants....The Nine Princesses novels is a series that chronicles the adventures of an unconventional family of princesses, the struggles they face in a kingdom often hostile to their humble origins, and the day-to-day dramas of nine young women whose personalities often clash like swords. Fans of Gail Carson Levine and Shannon Hale would enjoy these princess novels.Book Details 249 pages Young Adult Fantasy Funny/Romantic Moderate Violence. Moderate Romance. No sex. Anyone who enjoys fairy tale retellings or a nice princess book ˃˃˃ Read an Excerpt “PRINCE Eravis,” he said, lifting one eyebrow to a haughty angle. “Let’s not forget our manners, my thorny little rosebud.”“Let’s also not forget that I roasted twenty peacocks today.” Heidel’s eyes roved disdainfully over Eravis’ attire. He favored dark colors, deep reds and blues and greens, always set off by a jeweled belt or heavy gold neck chain. “Apparently I missed one.”To her surprise, Eravis belted a loud laugh. “Well, no harm done! I see you put away the extra stuffing.” His eyes fell to Heidel’s waist.Heidel’s teeth ground together. Yes, her body packed more padding than the other princesses. But she liked it. It made her curves curvier, her stature sturdier. She considered herself a plow horse, strong and solid, so much more useful than her parade pony sisters.But she had no stomach for teasing.Worse yet, she had nothing to retort. Eravis was handsome, of normal height and weight. His smile was bright; his gray eyes the sort that made silly maidens large and intense. His thick black hair was purposely rumpled, dangling a few wavy locks on his brow.“Get out of here, Eravis,” Heidel growled. “I have to serve the cake.”“Oh, is THAT what you call this frightful confection!” Eravis waved a hand at it, grinning. “Well, I’m sure it was beautiful before the earthquake.”> Other Books by Anita Valle The Nine Princesses Book 1 (FREE TO DOWNLOAD) The Nine Princesses Book 2 The Nine Princesses Book 4 (Coming Soon!) SINFUL Dark Fairy Tale Queen Series Author's A tough love story for anyone who enjoys medieval romance or fantasy adventure. Meet Heidel - a feisty redhead and a smart princess. Known as a healer, she treats the ailing people of her kingdom.",
  "genres": [
    "Fantasy",
    "Romance",
    "Young Adult",
    "Fairy Tales",
    "Short Stories"
  ],
  "author": "Anita Valle",
  "average_rating": "4.26",
  "url": "https://www.goodreads.com/book/show/25145130-heidel"
}