{
  "title": "Relentless",
  "description": "Sometimes life takes you where you least expect it, and for 24 year old Ava Flores, it’s twelve thousands miles from home. When accepting a position as a journalist for L.A’s top music magazine, she has no idea the new job will involve touring for eight weeks with one of L.A’s up and coming rock bands ‘Relentless Soul’. The long road ahead is full of endless possibilities and surprises. For Jeremy Stone, being the lead singer of ‘Relentless Soul’ means an endless supply of hot women throwing themselves at his feet. But when the sexy and feisty Ava is somehow able to resist his charm, he realises she might be different than all the rest. Jeremy is determined to make her his, but it seems he’s not the only one.After carrying around so much emotional baggage for so many years, Brody Cooper never thought he could be in a serious relationship. His trust issues and personal insecurities always seem to destroy his relationships before they’ve even begun. However, the moment he meets Ava in a Hotel elevator, he knows that he is hooked. The more he gets to know her, the more he is starting to picture a life that he never knew he wanted. As Bass guitarist for ‘Relentless Soul’ Brody is used to letting his best friend, Jeremy take the spotlight and get all of the female attention, but will it be different this time? Ava feels drawn to both Jeremy and Brody, but is confused about where her heart lies. Is it with the man who makes her heart race and treats her like a princess, or with the man who obviously cares about her but is fighting his attraction and continues to push her away? How can Ava follow her heart without coming between the two band mates and best friends? Is a relationship with either of them possible, or is it inevitable destruction of everything they have all worked so hard for?",
  "genres": [],
  "author": "Eve  Cassidy",
  "average_rating": "3.73",
  "url": "https://www.goodreads.com/book/show/25140310-relentless"
}