{
  "title": "No Stone Unturned: The True Story of the World's Premier Forensic Investigators",
  "description": "\"A fascinating journey into the trenches of crime [investigation]\"--Lowell Cauffiel, New York Times bestselling author of House of Secrets  A body stuffed in a car trunk swallowed by the swirling, muddy waters of the Missouri River. A hiker brutally murdered, then thrown off a cliff in a remote mountain range. A devious killer who hid his wife's body under a thick cement patio. For investigators, the story is often the same: they know a murder took place, they may even know who did it. But without key evidence, pursuing a conviction is nearly impossible. That's when they call NecroSearch International.  Necrosearch boasts a brain trust of the nation's top scientists, specialists, and behaviourists who use the latest technology and techniques to help solve \"unsolvable\" crimes, no matter how decayed the corpse, no matter how cleverly the killer has hidden the victim's body.  In NO STONE UNTURNED by New York Times bestselling author Steve Jackson readers are taken on a fascinating, often-shocking journey into a realm of crime investigation of which few people are aware. Necrosearch's most challenging cases are described, step-by-step, as these modern-day Sherlock Holmes's detect bodies and evidence thought irretrievable, and testify in court to bring cold-blooded killers to justice.  Following his participation in a NecroSearch expedition to Russia looking for the remains of a Russian noble in 2013, Jackson the author of MONSTER and BOGEYMAN was voted in as a member of NecroSearch International in February 2015.   What Others Have Said About NO STONE UNTURNED   \"The book covers the group's quirky beginnings and digs into its most important cases suspensefully; Jackson's sharp eye misses nothing in the painstakingly rendered details. A must-have for true crime fans, it should also be of great interest to anyone fascinated with the practical applications of science.\"--Publisher's Weekly (starred review)  \"No Stone Unturned\" delves into cases that would make good novels, but they're real. Furthermore, he describes a group of uncommon people performing uncommon tasks, and he does it with respect, accuracy and genuine style.\"--Ron Franscell, bestselling author of The Darkest Night.  \"True crime author Jackson has created a fascinating account of a group of extraordinary people who volunteer their time and expertise to locate hidden murder victims for the police and prosecutors. ... From this meeting, NecroSearch International was eventually born. Recommended for public and academic libraries.\"--Library Journal  \"Jackson's account of the development and crime-solving uses of forensic science may be grim, but it is also a fascinating, macabre journey sure to entrance true-crime buffs and police-procedural detective fiction fans.\"--Booklist",
  "genres": [
    "True Crime",
    "Nonfiction",
    "Science",
    "Crime",
    "Audiobook",
    "History",
    "Mystery"
  ],
  "author": "Steve    Jackson",
  "average_rating": "4.22",
  "url": "https://www.goodreads.com/book/show/25145264-no-stone-unturned"
}