{
  "title": "Neiko's Five Land Adventure",
  "description": "Winner of the 2012 Indie Reader Approved AwardNominated as \"A Great Book for Kids\" by fantasy and science fiction reviewer CC Cole\"Plenty of action and inspired imagination.\" ~Wulfstan Top 100 Reviewer\"From the first word, Taylor delivers a fresh, vibrant tale of two different worlds.\" ~Steven Knight Book review and author of \"Born of Blood\"\"An imaginative journey that is that is much of an adventure for the reader as it is for Neiko.\" ~CC Cole Book Reviewer and author of the Gastar Series\" A great middle school or read to me book with tons of adventure and characters.\" ~Paper Mustang Book Reviewer \"A fantastical twist to the childhood game of Cowboys and Indians and a wonderful coming of age story.\" ~Indie Reader Reviewer\" Neiko's five land adventure is a gripping young adult fantasy tale. You get an exceptional feel for the protagonist, Neiko, as you travel through the rich worlds between reality and imaginary (well not really imaginary as Neiko soon finds out!) alongside her and her cohorts (I particularly liked Quickstrike)\" ~ Michael Dadich, Award Winning Author of the Silver SphereOverviewWhat if the fate of two worlds were in the hands of one you?The childhood secret of a troubled teen warrior is used against her by her enemies. It turns out what Neiko imagined is real,and she becomes trapped in the same world she imagined by an otherworldly evil that is worse than the devil. Getting home is the least of her problems.The Indians and the Crackedskulls are locked in the turmoil of a war that has raged for centuries, and it is presently in a stalemate. Her enemies, Raven and Bloodhawk, have come up with a scheme to take her down, but in doing so they inadvertently open the door to another universe and to an otherworldly evil. Neiko later finds out that a land she thought she had only imagined is actually real and the dark being is not a figment of her childhood imagination-he is terrifyingly real and she faces him for the first time. To make matters worse, it is now in her world and he has evil plans especially for her .After several standoffs with the malevolent Ramses the Dark Pharaoh in Hawote, she is trapped in Qari by his strange and powerful magic. Trapped in another universe in a place that is not exactly the way she imagined it, and she must somehow find a way to teleport home.",
  "genres": [
    "Fantasy"
  ],
  "author": "A.K. Taylor",
  "average_rating": "4.03",
  "url": "https://www.goodreads.com/book/show/11531008-neiko-s-five-land-adventure"
}