{
  "title": "Loving to Survive: Sexual Terror, Men's Violence, and Women's Lives",
  "description": "Have you wondered: Why women are more sympathetic than men toward O. J. Simpson? Why women were no more supportive of the Equal Rights Amendment than men? Why women are no more likely than men to support a female political candidate? Why women are no more likely than men to embrace feminism--a movement by, about, and for women? Why some women stay with men who abuse them? Loving to Survive addresses just these issues and poses a surprising answer. Likening women's situation to that of hostages, Dee L. R. Graham and her co- authors argue that women bond with men and adopt men's perspective in an effort to escape the threat of men's violence against them. Dee Graham's announcement, in 1991, of her research on male-female bonding was immediately followed by a national firestorm of media interest. Her startling and provocative conclusion was covered in dozens of national newspapers and heatedly debated. In Loving to Survive, Graham provides us with a complete account of her remarkable insights into relationships between men and women. In 1973, three women and one man were held hostage in one of the largest banks in Stockholm by two ex-convicts. These two men threatened their lives, but also showed them kindness. Over the course of the long ordeal, the hostages came to identify with their captors, developing an emotional bond with them. They began to perceive the police, their prospective liberators, as their enemies, and their captors as their friends, as a source of security. This seemingly bizarre reaction to captivity, in which the hostages and captors mutually bond to one another, has been documented in other cases as well, and has become widely known as Stockholm Syndrome. The authors of this book take this syndrome as their starting point to develop a new way of looking at male-female relationships. Loving to Survive considers men's violence against women as crucial to understanding women's current psychology. Men's violence creates ever-present, and therefore often unrecognized, terror in women. This terror is often experienced as a fear for any woman of rape by any man or as a fear of making any man angry. They propose that women's current psychology is actually a psychology of women under conditions of captivitythat is, under conditions of terror caused by male violence against women. Therefore, women's responses to men, and to male violence, resemble hostages' responses to captors.  Loving to Survive explores women's bonding to men as it relates to men's violence against women. It proposes that, like hostages who work to placate their captors lest they kill them, women work to please men, and from this springs women's femininity. Femininity describes a set of behaviors that please men because they communicate a woman's acceptance of her subordinate status. Thus, feminine behaviors are, in essence, survival strategies. Like hostages who bond to their captors, women bond to men in an effort to survive.  This is a book that will forever change the way we look at male-female relationships and women's lives.",
  "genres": [
    "Feminism",
    "Nonfiction",
    "Psychology",
    "Womens",
    "Feminist Theory",
    "Theory",
    "Crime"
  ],
  "author": "Dee L.R. Graham",
  "average_rating": "4.54",
  "url": "https://www.goodreads.com/book/show/25144262-loving-to-survive"
}