{
  "title": "Reckless: My Life as a Pretender",
  "description": "Chrissie Hynde, for nearly four decades the singer/songwriter/ undisputed leader of the Pretenders, is a justly legendary figure.Few other rock stars have managed to combine her swagger, sexiness, stage presence, knack for putting words to music, gorgeous voice and just all-around kick-assedness into such a potent and alluring package. From “Tatooed Love Boys” and “Brass in Pocket” to “Talk of the Town” and “Back on the Chain Gang,” her signature songs project a unique mixture of toughness and vulnerability that millions of men and women have related to. A kind of one- woman secret tunnel linking punk and new wave to classic guitar rock, she is one of the great luminaries in rock history. Now, in her no-holds-barred memoir Reckless, Chrissie Hynde tells, with all the fearless candor, sharp humor and depth of feeling we’ve come to expect, exactly where she came from and what her crooked, winding path to stardom entailed. Her All-American upbringing in Akron, Ohio, a child of postwar power and prosperity. Her soul capture, along with tens of millions of her generation, by the gods of sixties rock who came through Cleveland—Mitch Ryder, David Bowie, Jeff Back, Paul Butterfield and Iggy Pop among them. Her shocked witness in 1970 to the horrific shooting of student antiwar protestors at Kent State. Her weakness for the sorts of men she calls “the heavy bikers” and “the get-down boys.” Her flight from Ohio to London in 1973 essentially to escape the former and pursue the latter. Her scuffling years as a brash reviewer for New Musical Express, shop girl at the Malcolm McLaren and Vivienne Westwood boutique 'Craft Must Wear Clothes But The Truth Loves To Go Naked', first-hand witness to the birth of the punk movement, and serial band aspirant. And then ,at almost the last possible moment, her meeting of the three musicians who comprised the original line-up of The Pretenders, their work on the indelible first album “The Pretenders,” and the rocket ride to “Instant” stardom, with all the disorientation and hazards that involved. The it all comes crashing back down to earth with the deaths of lead guitarist James Honeyman Scott and bassist Peter Farndon, leaving her bruised and saddened, but far from beaten. Because Chrissie Hynde is, among other things, one of rock’s great survivors. We are lucky to be living in a golden age of great rock memoirs. In the aptly titled Reckless , Chrissie Hynde has given us one of the very best we have. Her mesmerizing presence radiates from every line and page of this book.",
  "genres": [
    "Music",
    "Nonfiction",
    "Biography",
    "Memoir",
    "Autobiography",
    "Audiobook",
    "Biography Memoir"
  ],
  "author": "Chrissie Hynde",
  "average_rating": "3.49",
  "url": "https://www.goodreads.com/book/show/25147580-reckless"
}