{
  "title": "The Theory of Death",
  "description": "Now living in upstate New York, former LAPD lieutenant Peter Decker is plunged into a bizarre web involving academia, underworld crime, and calculating killers in this next compulsive novel in New York Times bestselling author Faye Kellerman's beloved Decker and Lazarus seriesFormer LAPD lieutenant Peter Decker is relishing the quiet and slow pace of his new job with the Greenbury police department. The work is low stress and engaging, and it’s been almost a year since the last murder in this sleepy upstate New York town. Then the body of a nude man is found deep within the woods, shattering Decker’s peace. The death appears to be a suicide—a single shot to the head, the gun by his side. But until the coroner’s ruling, the scene must be treated as a suspicious crime. Without any personal effects near the body, Decker must dig to uncover his identity, a task made difficult by the department’s tight budget and limited personnel. Luckily, Decker gets some unexpected help when his friend and former Greenbury colleague Tyler McAdams calls, looking for a quiet place to study for his law finals. The investigation takes Decker and McAdams to Kneed Loft College, where they must penetrate the indecipherable upper echelons of mathematics and mathematical prodigies. Beneath the school’s rarified atmosphere they discover a sphere of scheming academics, hidden cyphers—and most dangerous of all—a realm of underworld crime that transforms harmless nerds into cold, calculating evil geniuses. It will take all of Decker’s experience and McAdams’s brains to penetrate enigmatic formulas and codes and solve a dark, twisted crime devised by some brilliant and depraved masterminds.",
  "genres": [
    "Mystery",
    "Fiction",
    "Crime",
    "Mystery Thriller",
    "Thriller",
    "Audiobook",
    "Suspense"
  ],
  "author": "Faye Kellerman",
  "average_rating": "3.96",
  "url": "https://www.goodreads.com/book/show/25143286-the-theory-of-death"
}