{
  "title": "Second Service Box Set",
  "description": "The complete Bestselling Second Service Contemporary Romance Series available in one box set! Includes the bonus novella: The Best Man!  ***  Part romantic comedy, part thriller, and filled with plenty of intrigue, the Second Service contemporary romance series includes the following novels:  ***  The Wedding Trap  Beth Bradley has a problem. Everyone is expecting her successful music executive boyfriend, Charlie, to be her date for her best friend’s wedding. There’s one hitch: Charlie doesn’t exist. Unless she can think of something fast, she’s headed for the most humiliating weekend of her life.  Alex Tanner has a problem. The former Navy SEAL's search for a double agent lands him at the Kensington Hotel, and he needs a cover to finish the job. When the sexy maid of honor blackmails him into pretending to be her lover, he thinks he's been handed the solution.  Except Beth has a way of stumbling into trouble, and when the man Alex is hunting starts targeting Beth, Alex has to decide between solving the mystery or protecting the woman who has stolen his heart.  ***  The Agent Next Door  Erin Holliday has worked hard to build the perfect life: beautiful house, safe neighborhood, trusted friends. But everything she cherishes is threatened when the new neighbor moves in. As the daughter of a slain motorcycle gang leader, Erin knows what trouble looks like—she’s spent a lifetime trying to avoid it—and John Ryman certainly fits the bill. Her head tells her to keep her distance, but her heart has other plans.  Ex-Navy SEAL John Ryman has spent his whole career surrounded by danger. Now he’s ready to settle down, and a quiet suburban life will suit him just fine, if his gorgeous new neighbor is any indication.  But when a previous mistake has explosive consequences, John and Erin are thrown together, and it doesn't take long for them to realize that the only way they’ll survive to build a future together will by settling the debts of their past.  ***  The Trouble With Temptation  Morgan Kincaid is up to her ears in trouble. It's bad enough that she put her dreams on hold to open a nightclub with her brother, but when she tries to help with staffing problems, books that don't add up, and creepy patrons, he tells her to mind her own business. So, when a tempting stranger appears asking for a job, Morgan isn’t sure if Mr. Tall, Dark and Handsome is her savior or more trouble than she can handle.  Ex-Navy SEAL Ty Brannigan has spent his FBI career tracking down the Russian mob, and the trail has led him directly to Morgan Kincaid’s door. Even though the evidence is damning, Ty can’t bring himself to believe that the eccentric beauty is in league with dangerous criminals.  When the mafia targets Morgan, the pair has no choice but to set aside their suspicions and band together to bring down the criminal organization that would stop at nothing to keep them apart.  ***  The Best Man  Holly Tanner has built a career on love and danger: her popular novels are chock full of them. But the truth is, she's never come face to face with either, and she doesn't expect that to change at her cousin's gorgeous wine country wedding.  But everything changes the moment Holly meets Michael Silva. Suddenly, she's accepting dares, chasing suspicious peeping toms, and kissing under the moonlight.",
  "genres": [
    "Contemporary Romance"
  ],
  "author": "Adrienne Bell",
  "average_rating": "4.41",
  "url": "https://www.goodreads.com/book/show/25152336-second-service-box-set"
}