{
  "title": "Loosed upon the World: The Saga Anthology of Climate Fiction",
  "description": "Collected by the editor of the award-winning Lightspeed magazine, one of the first anthologies of climate fiction—a cutting-edge genre made popular by Margaret Atwood.Is it the end of the world as we know it? Climate fiction (cli-fi) explores the world we live in now—and in the very near future—as the effects of global warming become more evident. Join bestselling, award-winning writers like Margaret Atwood, Paolo Bacigalupi, Kim Stanley Robinson, Seanan McGuire, and many others at the brink of tomorrow. Loosed Upon the World is so believable, it’s frightening. Contents 01 - Paolo Bacigalupi, Shooting the Apocalypse (2014 novelette, p1)02 - Seanan McGuire, The Myth of Rain (2015 short story, p25)03 - Toiya Kristen Finley, Outer Rims (2011 short story, p39)04 - Karl Schroeder, Kheldyu (2014 novelette, p52)05 - Jean-Louis Trudel, The Snows of Yesteryear (2014 novelette, p88)06 - Nancy Kress, A Hundred Hundred Daisies (2011 short story, p111)07 - Tobias S. Buckell, The Rainy Season (2012 short story, p129)08 - Jim Shepard, The Netherlands Lives With Water (2009 short story, p143)09 - Sean McMullen, The Precedent (2010 novelette, p172)10 - Robert Silverberg, Hot Sky (1990 short story, p203)11 - Alan Dean Foster, That Creeping Sensation (2011 short story, p229)12 - Kim Stanley Robinson, Truth or Consequences (2015 short story, p240)13 - Vandana Singh, Entanglement (2014 novella, p269)14 - Angela Penrose, Staying Afloat (2013 short story, p323)15 - Chris Bachelder, Eighth Wonder (2009 short story, p341)16 - Gregory Benford, Eagle (2011 short story, p362)17 - Nicole Feldringer, Outliers (2015 short story, p386)18 - Jason Gurley, Quiet Town (2015 short story, p399)19 - Charlie Jane Anders, The Day It All Ended (2014 short story, p407)20 - Chen Quifan, The Smog Society (2015 translation of 2010 short story, p419)21 - Craig DeLancey, Racing the Tide (2014 short story, p435)22 - Sarah K. Castle, The Mutant Stag at Horn Creek (2012 novelette, p453)23 - Cat Sparks, Hot Rods (2015 novelette, p487)24 - Paolo Bacigalupi, The Tamarisk Hunter (2006 short story, p511)25 - Tobias S. Buckell & Karl Schroeder, Mitigation (2008 novelette, p527)26 - Margaret Atwood, Time Capsule Found on the Dead Planet (2009 short story, p556)Afterword - Ramez Naam, Science Scarier Than Fiction",
  "genres": [
    "Short Stories",
    "Science Fiction",
    "Fiction",
    "Anthologies",
    "Climate Change Fiction",
    "Post Apocalyptic",
    "Horror"
  ],
  "author": "John Joseph Adams",
  "average_rating": "3.68",
  "url": "https://www.goodreads.com/book/show/25152058-loosed-upon-the-world"
}