{
  "title": "Catching Lucy",
  "description": "LucyEveryone has ups and downs. I’m no different. I’ve had some really amazing ups, but I’ve also had some crap-tastic downs.When I was four, my biological mother died. I don’t remember crying for her. She’d never been the type to cuddle me, tuck me in, and read bedtime stories. That job was pushed off onto my sister Lana. She did her best to take care of me until Mom died. After the funeral we went to live with our older sister, Layla and I got to see what a real mother was supposed to be like.When I was six we moved to Malibu for Layla’s new job as the housekeeper to one of the worlds most popular rock bands and their manager. When my sisters told me that we were going to live with Demons I was definitely not looking forward to it. Then I met Nik, Drake, Shane, Emmie and the man that would one day become one of my favorite people in the world. Jesse Thornton.By Christmas my oldest sister was married to the Demon’s Wings drummer. Six months later they made me theirs and adopted me. The day I became Jesse’s daughter was one of the best days of my life. I felt like I belonged to someone for the first time in my life.But you know the rules of fate, or at least the rules it feels like those bitches have specifically for me. Something truly amazing always seems to be followed by something really, really shitty. When I was nine, my real dad was released from prison and tried to take me. I still have nightmares about that night.I got through it, though. My parents sent me to a good therapist, but it was my best friend Harris who really got me through that time in my life. When I couldn’t sleep I would call him and no matter how tired he was he would stay up and talk to me until I would finally fall into an exhausted sleep. He was the kind of friend that one text and he would drop everything for me.To bad my hormones got in the way of our friendship. At twelve, puberty hit me hard, and the love I felt for my best friend got complicated with a crush. They’re called crushes for a reason, something I’d learned real quick that year. I pushed him away to avoid the agonizing pain that my crush made me feel.Now it’s been years since I’ve seen him. He’s graduated from college and moved forward with his dream by opening his first club. First Bass is the most popular nightclub in not just Los Angeles, but all of California. I’m so proud of him, but I’ve avoided going to check it out. After an email that twisted my heart into knots I’m finally going to head over there.Maybe I won’t still be crushing on him. Maybe we can go back to being best friends.Maybe…The series will have 3 novellas and end with a full length book in 2016.",
  "genres": [
    "Romance",
    "New Adult",
    "Friends To Lovers",
    "Music",
    "Contemporary",
    "Contemporary Romance",
    "Young Adult"
  ],
  "author": "Terri Anne Browning",
  "average_rating": "4.18",
  "url": "https://www.goodreads.com/book/show/25158449-catching-lucy"
}