{
  "title": "Hunted",
  "description": "Théoden: Far be it from me to refuse an invitation from the Celestial Dragon King, Evander. Besides, what's the point of living forever if you can't have fun? A little distraction would serve me well. I still had so much to do this night. Children to Sire, a rebel hybrid to hunt down and a test to conduct with Noel that would surely elevate his status in my eyes. That is, if he passed. Apart from that, there was this matter of hunting Dante. Sure, I enlisted the assistance of wolf Alpha, Deacon, but I didn't want to leave the hunt of Dante solely up to him and his pack, especially with the price being so high. I do know one thing, Dante better be worth it.   Noel: My training with Marco is advancing and the more I learn about what I am, the more I discover who I am. Maybe Théoden had a point when he told me that being a vampire is what I wanted. I don't know. I do know that I find myself enjoying the powers and strength I possess. He really is making me into the vampire he wants me to be. I realize that even more now as I try to figure out who I should sire and why. This person will be my child, an extension of me. How do I want to be represented?  Warning: This serial contains strong adult content not meant for sensitive eyes. The novelettes in this serial will be filled with dark, twisted, raunchy and steamy scenes between powerful, sexy men that will either offend you or get ya revved up. This series will not be pulling any punches, and it won’t apologize for hurting your feelings, either. You’ll find no fluff and ruffles here. The vampires are not misunderstood, hopeless romantics looking for love. The werewolves are not cute and cuddly and the dragons aren’t the ones from your childhood. This is NOT a romance. There are approximately 33700 words in this novelette.",
  "genres": [
    "M M Romance",
    "BDSM",
    "Paranormal",
    "Vampires",
    "Erotica",
    "M M M",
    "Fantasy"
  ],
  "author": "Nicholas Bella",
  "average_rating": "4.38",
  "url": "https://www.goodreads.com/book/show/25156014-hunted"
}