{
  "title": "Playing Juliet",
  "description": "Beth Sondquist, age twelve and a half, dreams of playing the part of Juliet. For now she’s just the cat in Cinderella , but one day, she’s determined to become a real actress. But all her hopes for an acting career come crashing down when the Oakfield Children’s Theater is slated to be closed. Its new owner has decided to make it into an adult theater, a real theater. Beth and her best friend, Zandy, are willing to do whatever it takes to save the theater, but their plans quickly go awry. When Beth’s father catches her sneaking back into her bedroom window well past bedtime, Beth is in big, big trouble.With eviction looming, the children’s theater director decides to close the theater with the same play the theater opened with fifty years ago— Romeo and Juliet . But Beth’s grounded for the next two weeks, and she won’t be able to try out. How will Beth pull off playing Juliet if she can’t even make tryouts?Playing Juliet is funny and honest and celebrates bravery and doing the right thing even when it gets you into trouble. It’s about having the courage to go after what you want and making your dreams come true. It’s also about friendship and family. As an almost-thirteen-year-old, Beth has a unique bond with thirteen-year-old Juliet, and she eventually recognizes just how silly and immature Juliet’s decisions are. Only Beth can play Juliet as the kid that she is. With a little bit of luck, maybe she’ll get her chance.Sky Pony Press, with our Good Books, Racehorse and Arcade imprints, is proud to publish a broad range of books for young readers—picture books for small children, chapter books, books for middle grade readers, and novels for young adults. Our list includes bestsellers for children who love to play Minecraft; stories told with LEGO bricks; books that teach lessons about tolerance, patience, and the environment, and much more. While not every title we publish becomes a New York Times bestseller or a national bestseller, we are committed to books on subjects that are sometimes overlooked and to authors whose work might not otherwise find a home.",
  "genres": [
    "Realistic Fiction",
    "Childrens",
    "Middle Grade",
    "Contemporary"
  ],
  "author": "JoAnne Stewart Wetzel",
  "average_rating": "4.19",
  "url": "https://www.goodreads.com/book/show/25159307-playing-juliet"
}