{
  "title": "The Shark Mutiny",
  "description": "Throughout the fifteenth century, China's blue-water navy fleets dominated all the oceans between the Yellow Sea and the Persian Gulf. But for the next five hundred years, it regressed to a dim echo of its glorious past. However, it is now the year 2007 and the Chinese agenda has changed. With a tremendous navy buildup, anchored by a new base in Burma and a $2 billion oil refinery on the southern Iranian coast, the Chinese are poised not only to challenge America's superiority on the open sea but also to upset the delicate balance of oil power in the Middle East and the free passage of the world's giant tankers.Admiral Arnold Morgan, the President's National Security Adviser, is closely monitoring the Chinese when an oil tanker mysteriously explodes in the Persian Gulf. When it happens a second and then a third time, he knows it is no coincidence.... The Chinese navy, in partnership with Iran, has laid a minefield clean across the Strait of Hormuz, holding the world's oil supply hostage. As a global oil crisis ensues, the world financial markets spiral out of control. Mystified by China's motive yet drawn to action, the United States moves to disarm the mines with a huge display of force, deploying five Carrier Battle Groups, 80 percent of its active sea power.While the sweepers blow out the mines, Morgan characteristically slams back at China. Navy SEAL veteran commanders Rick Hunter and Rusty Bennett lead devastating attacks on China's Indian Ocean power bases. And at the center of the missions is USS Shark, a thirty-year-old nuclear boat on her final tour of duty, commanded by Donald Reid, an officer struggling with his inner demons. His executive officer is Lt. Commander Dan Headley, an intrepid Kentuckian, himself on his way to full command. When the brave SEALs are confronted with the unexpected death of their own, the unimaginable happens: the first mutiny in the modern history of the United States Navy.Meanwhile, the People's Liberation Navy sits and waits for their ultimate gambit, a move so shocking and unexpected that it forces the world to hold its breath. Was the minefield in the strait just a diversion?Featuring an ensemble cast that stretches from the most secretive heart of the Chinese high command to the control room of a U.S. submarine, out onto the screaming flight decks of the great aircraft carriers, all the way to a United States Navy court-martial, The Shark Mutiny is epic in its sweep, meticulous in its authenticity, and breathtaking in its pacing. Terrifying and thrilling, it is the most dramatic story of rebellion on the high seas since The Caine Mutiny.",
  "genres": [
    "Fiction",
    "Thriller",
    "Military Fiction",
    "War",
    "Audiobook",
    "Adventure",
    "Maritime"
  ],
  "author": "Patrick Robinson",
  "average_rating": "4.01",
  "url": "https://www.goodreads.com/book/show/1153202.The_Shark_Mutiny"
}