{
  "title": "An Everyone Culture: Becoming a Deliberately Developmental Organization",
  "description": "A Radical New Model for Unleashing Your Company’s PotentialIn most organizations nearly everyone is doing a second job no one is paying them for—namely, covering their weaknesses, trying to look their best, and managing other people’s impressions of them. There may be no greater waste of a company’s resources. The ultimate cost: neither the organization nor its people are able to realize their full potential.What if a company did everything in its power to create a culture in which everyone —not just select “high potentials”—could overcome their own internal barriers to change and use errors and vulnerabilities as prime opportunities for personal and company growth?Robert Kegan and Lisa Lahey (and their collaborators) have found and studied such companies—Deliberately Developmental Organizations. A DDO is organized around the simple but radical conviction that organizations will best prosper when they are more deeply aligned with people’s strongest motive, which is to grow . This means going beyond consigning “people development” to high-potential programs, executive coaching, or once-a-year off-sites. It means fashioning an organizational culture in which support of people’s development is woven into the daily fabric of working life and the company’s regular operations, daily routines, and conversations.An Everyone Culture dives deep into the worlds of three leading companies that embody this breakthrough approach. It reveals the design principles, concrete practices, and underlying science at the heart of DDOs—from their disciplined approach to giving feedback, to how they use meetings, to the distinctive way that managers and leaders define their roles. The authors then show readers how to build this developmental culture in their own organizations.This book demonstrates a whole new way of being at work. It suggests that the culture you create is your strategy—and that the key to success is developing everyone .",
  "genres": [
    "Business",
    "Leadership",
    "Nonfiction",
    "Management",
    "Psychology",
    "Cultural",
    "Education"
  ],
  "author": "Robert Kegan",
  "average_rating": "3.96",
  "url": "https://www.goodreads.com/book/show/25159550-an-everyone-culture"
}