{
  "title": "Lower Ed: The Troubling Rise of For-Profit Colleges in the New Economy",
  "description": "“The best book yet on the complex lives and choices of for-profit students.”— The New York Times Book ReviewAs seen on The Daily Show , NPR’s Marketplace , and Fresh Air , the “powerful, chilling tale” (Carol Anderson) of higher education becoming an engine of social inequalityMore than two million students are enrolled in for-profit colleges, from the small family-run operations to the behemoths brandished on billboards, subway ads, and late-night commercials. These schools have been around just as long as their bucolic not-for-profit counterparts, yet shockingly little is known about why they have expanded so rapidly in recent years—during the so-called Wall Street era of for-profit colleges.In Lower Ed Tressie McMillan Cottom—a bold and rising public scholar, herself once a recruiter at two for-profit colleges—expertly parses the fraught dynamics of this big-money industry to show precisely how it is part and parcel of the growing inequality plaguing the country today. McMillan Cottom discloses the shrewd recruitment and marketing strategies that these schools deploy and explains how, despite the well-documented predatory practices of some and the campus closings of others, ending for-profit colleges won’t end the vulnerabilities that made them the fastest growing sector of higher education at the turn of the twenty-first century. And she doesn’t stop there.With sharp insight and deliberate acumen, McMillan Cottom delivers a comprehensive view of postsecondary for-profit education by illuminating the experiences of the everyday people behind the shareholder earnings, congressional battles, and student debt disasters. The relatable human stories in Lower Ed —from mothers struggling to pay for beauty school to working class guys seeking “good jobs” to accomplished professionals pursuing doctoral degrees—illustrate that the growth of for-profit colleges is inextricably linked to larger questions of race, gender, work, and the promise of opportunity in America.Drawing on more than one hundred interviews with students, employees, executives, and activists, Lower Ed tells the story of the benefits, pitfalls, and real costs of a for-profit education. It is a story about broken social contracts; about education transforming from a public interest to a private gain; and about all Americans and the challenges we face in our divided, unequal society.",
  "genres": [
    "Nonfiction",
    "Education",
    "Sociology",
    "Politics",
    "Economics",
    "History",
    "Social Justice"
  ],
  "author": "Tressie McMillan Cottom",
  "average_rating": "4.26",
  "url": "https://www.goodreads.com/book/show/25159221-lower-ed"
}