{
  "title": "Essie's Roses",
  "description": "#1 Amazon bestseller. Readers' Favorite Silver Medal Winner Best Southern Fiction. A sweeping, moving historical novel set before the Civil War about secrets, freedom, and the power of love.Growing up in the Deep South during the years leading to the Civil War, two young girls find freedom on a hillside overlooking Westland, an Alabama plantation. Essie Mae, an intuitive, intelligent slave girl, and Evie Winthrop, the sheltered, imaginative dreamer and planter’s daughter, strike up a secret friendship that thrives amidst the shadows of abuse.Told from the viewpoint of four women: Katherine Winthrop, kind mistress and unexpected heiress to her father’s small, cotton plantation; Delly, her sassy and beloved house slave; Essie Mae, her slave girl; and Evie Winthrop, Katherine’s only child, Essie’s Roses tells of forbidden relationships flourishing in secret behind Westland’s protective trees and treasured roses.After scandal befalls Westland, Evie and Essie, aged nineteen, travel to Richmond, Virginia, to escape their abusive pasts. There, they face the gross indecencies and divisions leading to the War Between the States. Though the horrors of slavery and discrimination prompt action, Evie and Essie’s struggles lie within. The secrets they hold and the pain of the past lead them away from one another and back home again.A story about a black slave who frees a white woman, Essie’s Roses reveals the diverse meanings of freedom, the significance of a dream, and the power of love. In their efforts to save each other, will the women of Westland find the true freedom they desire?\"Impressively well written from beginning to end, Essie's Roses is an inherently absorbing and skillfully presented read, establishing author Michelle Muriel as an exceptionally talented novelist.\" \n-Midwest Book Review\n\"...tremendously impressive debut novel ... A richly moving reading experience.\" \n-Historical Novel Society",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Chick Lit"
  ],
  "author": "Michelle Muriel",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/25163116-essie-s-roses"
}