{
  "title": "The Wise King: A Christian Prince, Muslim Spain, and the Birth of the Renaissance",
  "description": "An illuminating biography of Alfonso X, the 13th-century philosopher-king whose affinity for Islamic culture left an indelible mark on Western civilization\"If I had been present at the Creation,\" the thirteenth-century Spanish philosopher-king Alfonso X is said to have stated, \"Many faults in the universe would have been avoided.\" Known as El Sabio , \"the Wise,\" Alfonso was renowned by friends and enemies alike for his sparkling intellect and extraordinary cultural achievements. In The Wise King , celebrated historian Simon R. Doubleday traces the story of the king's life and times, leading us deep into his emotional world and showing how his intense admiration for Spain's rich Islamic culture paved the way for the European Renaissance.In 1252, when Alfonso replaced his more militaristic father on the throne of Castile and Leóthe battle to reconquer Muslim territory on the Iberian Peninsula was raging fiercely. But even as he led his Christian soldiers onto the battlefield, Alfonso was seduced by the glories of Muslim Spain. His engagement with the Arabic-speaking culture of the South shaped his pursuit of astronomy, for which he was famed for centuries, and his profoundly humane vision of the world, which Dante, Petrarch, and later Italian humanists would inherit. A composer of lyric verses, and patron of works on board games, hunting, and the properties of stones, Alfonso is best known today for his Cantigas de Santa Marí/i> (Songs of Holy Mary), which offer a remarkable window onto his world. His ongoing struggles as a king and as a man were distilled-in art, music, literature, and architecture-into something sublime that speaks to us powerfully across the centuries.An intimate biography of the Spanish ruler in whom two cultures converged, The Wise King introduces readers to a Renaissance man before his time, whose creative energy in the face of personal turmoil and existential threats to his kingdom would transform the course of Western history.",
  "genres": [
    "History",
    "Biography",
    "Nonfiction",
    "Spain",
    "Medieval",
    "European History",
    "Medieval History"
  ],
  "author": "Simon R. Doubleday",
  "average_rating": "3.57",
  "url": "https://www.goodreads.com/book/show/25159045-the-wise-king"
}