{
  "title": "Whiz Tanner and the Phony Masterpiece",
  "description": "This story is the introductory book to the Tanner-Dent Mystery series. It’s a couple of weeks into sixth-grade and best friends, Whiz Tanner and Joey Dent, just formed a new detective agency. They get a chance to improve their detecting skills by watching experts at work when a traveling art exhibit comes to town. While getting a tour from the security team, Whiz notices a painting he has seen before, but there is something wrong with it. He decides it’s fake, which doesn’t sit well with the museum curator and the head of security. The unusual thing is that the painting is already a forgery of a Vincent van Gogh masterpiece. A fake of a forgery? Can’t be... can it?With the authorities moving slowly, Tanner-Dent decide to do their own surveillance—this doesn’t impress the local police chief, who has warned the boys to stay out of police business. Whiz and Joey find a suspect, but nobody takes them seriously. So… they begin following the clues on their own, with the aid of a few local kids. This puts them in the wrong place at the wrong time—or the other way around, depending on your thinking. Eventually they find the real (fake) painting so they follow it as the suspect moves its hiding spot. In their quest to make sure they really found the stolen painting before calling the police (with the Police Chief already gunning for them, the boys can’t afford to bring the cops in on a false alarm), Agent M (Whiz) and Agent K (Joey) check out the back of a moving van where they find the painting. Then, their only escape, the rear door, is slammed shut and the truck drives away. The boy detectives are trapped!Whiz keeps his head and devises a plan. He and Joey manage to hide the painting (in a virtually empty van—those kids are industrious) and escape the villains. Here they bring in the local police to make the arrest. And, things go just about as Whiz had planned. But they still don’t know why a forgery was worth stealing.In the aftermath, when things seem to calm down to normal, Whiz notices a chip of paint has come off the painting indicating that there is another painting underneath. Using technology from the electronics company where Whiz’s father works, they are able to make out the painting below the forged painting. It surprises everybody. Whiz and Joey become heroes and the Tanner-Dent Detective Agency wraps up its first big-time investigation.",
  "genres": [],
  "author": "Fred Rexroad",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/10022949-whiz-tanner-and-the-phony-masterpiece"
}