{
  "title": "Bride of Fortune: A Novel Based on the Life of Mrs. Jefferson Davis",
  "description": "Novel about Varina Howell, the wife of Jefferson Davis.No woman in America ever lived a life like that of vivid Varina Howell Davis, the First Lady of the Confederacy, \"Queen of the Lost Cause.\" Born an aristocrat in cotton-rich Natchez on the Mississippi, she left her home at eighteen to face an uncertain future as the wife of an enigmatic country man, Jefferson Davis -- and to embark on a swift, kaleidoscopic career such as she had never dreamed of.At his side she rose to eminence in the turbulent years that brought was between North and South. She knew giddy triumph -- the tinseled success of a great beauty, a triumphant woman of the world of Washington, D.C. She knew sudden ups and downs -- defeat, sorrow, loss, and retirement to her river plantation.Then, again, came a swift rise to rank higher than before -- that of a Cabinet wife, with the country's decisions being made all around her, and a part for her in the making. For a time it seemed that the White House of Washington would be her eventual home. Again, a step downward, and then up again, to the rank of the Confederacy's Lustrous Lady. Dazzling days again, and then trial and defeat -- the black hours of a fugitive, her husband facing death. In these hours she became a great personage, a human being fighting for survival: and she won.Above all, Bride of Fortune is the story of a woman in love -- a portrait of a passionate, warm-hearted woman who never faltered in her devotion. For Varina and Jefferson Davis it was one long love affair. Here is a picture of modern America in the making, of Washington and wartime Richmond from inside; and the story of the woman behind the man in the spotlight.No conventional crinolined miss, Varina was a firm-spirited, firm-minded woman who knew what she wanted her life to be and waded forth to make it that way. Some hated her; others loved her; nobody was ever neutral. And all about her moved the great of her day -- Presidents, grand dames, plantation owners, Cuban revolutionaries, Abraham Lincoln, Robert E. Lee.Here is a rich and moving story, a superbly readable one, a remarkable evocation of the native South. Harnett T. Kane, who has never written a book that wasn't a best seller, outdoes all his other successes, bringing to surging life the vivid-hued Richmond: gay-hearted Natchez on the river; lush New Orleans of the Creoles, and Washington, capital of the nation when its life was at stake.",
  "genres": [
    "Historical Fiction",
    "American Civil War",
    "Historical"
  ],
  "author": "Harnett T. Kane",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/2516696.Bride_of_Fortune"
}