{
  "title": "Perfectly Pickled",
  "description": "From the funny author of Confection Connection, Christmas Bizarre and Kitchen Addiction!More cozy comedy! And murder mysteries!Spring is here--finally--and things are looking up! Our intrepid hero, Mina Kitchen, has a new car. Well--it’s new to her. And she even has a boyfriend or two lined up. But that’s because her BFF, Trixie, signed her up on Cupidsbow.com behind her back. Some prospective dates appear a bit odd--but never mind; it’s good to make new friends, right?But all hope of smooth sailing vanishes when Mina hits another bump in the she loses her part-time job at Chi-Chi’s cosmetic counter. And Chef Jack hasn’t been scheduling her at Squirrel Run Acres lately, and her catering for James’ massage gigs are replaced by a new, full-time (and gorgeous) assistant. WTH?To make matters worse, her financial calamities become outnumbered by the steady stream of corpses floating her way. Never mind the dead bodies pouring forth from her aunt’s church, St. Bart’s Episcopal--they’re experiencing a new take on mass exodus. Congregation members are trading up at the Pearly Gates quicker than a greased geezer through a glass casket--that is to say, they’re dropping like flies.The grim mortgage reaper looms, when suddenly Mina’s solvency is rescued as she stumbles upon a full-time job. A rather peculiar job, with some definitely peculiar co-workers. Who try to kill her--and Chef Jack.Can Mina finally climb out of her proverbial--and literal--holes? Or will she wind up getting backhoed alongside a maniacal murderer? And where the heck’s a Lavender Cosmo when you really need one?Vinnie, her mini mountain lion-sized cat insists everything will turn out fine--but his idea of fine usually revolves around cans of Finicky Fare, and not much else.If you're looking for funny novels, chatty animals (in the guise of pets)--and recipes--read this book. Perfectly Pickled packs sit-com humor with stand-up dialogue, a murder mystery and suspense! You’ll cheer for Mina; hiss at the bad guys and sip your very own Lavender Cosmo along the way, courtesy of the author--the recipe’s in the back of the book, along with others, all vetted by Lund’s real-life favorite caterer, her husband, Chef Andrew.˃˃˃ 5-STAR READER’S FAVORITE REVIEWLizz Lund brings back the cooking addicted Mina Kitchen for yet another kooky adventure in Perfectly Pickled. This time Mina decides to give up cooking for a full-time job where she is literally surrounded by dead people. She fights to reorganize her life around the new job while resuscitating her comatose love life. Little does she realize she has once again situated herself for a front row view of one too many mysterious and sudden deaths. Perfectly Pickled is the fourth addition to the Mina Kitchen Cozy Mystery series and probably the best one yet. Lund’s talents as a humor writer are honed and a lot more focused in this book than Confection Connection (which I loved as well), and she provides a more satisfying ending for the love-starved readers who are ready to find the klutzy Mina finally getting her act together. I adore the eclectic cast of secondary characters who made me feel at home once again in the friendly town of LANCaster. I am in love with Chef Jack and was thrilled to see he was given a bigger part in this latest adventure.Scroll up NOW and click the “buy now with 1 click” button! Or read it for FREE with Kindle Unlimited! Also available in Paperback through Amazon!Grab it now!",
  "genres": [
    "Cozy Mystery",
    "Fiction",
    "Mystery Thriller",
    "Amazon",
    "Cozy",
    "Humor"
  ],
  "author": "Lizz Lund",
  "average_rating": "3.97",
  "url": "https://www.goodreads.com/book/show/25166268-perfectly-pickled"
}