{
  "title": "Power and Influence",
  "description": "In today's complex work world, things no longer get done simply because someone issues an order and someone else follows it. Most of us work in socially intricate organizations where we need the help not only of subordinates but of colleagues, superiors, and outsiders to accomplish our goals. This often leaves us in a \"power gap\" because we must depend on people over whom we have little or no explicit control. This is a book about how to bridge that how to exercise the power and influence you need to get things done through others when your responsibilities exceed your formal authority. Full of original ideas and expert insights about how organizations?and the people in them?function, Power and Influence goes further, demonstrating that lower-level personnel also need strong leadership skills and interpersonal know-how to perform well. Kotter shows how you can develop sufficient resources of \"unofficial\" power and influence to achieve goals, steer clear of conflicts, foster creative team behavior, and gain the cooperation and support you need from subordinates, coworkers, superiors?even people outside your department or organization. He also shows how you can avoid the twin traps of naivete and cynicism when dealing with power relationships, and how to use your power without abusing it. Power and Influence is essential for top managers who need to overcome the infighting, foot-dragging, and politicking that can destroy both morale and profits; for middle managers who don't want their careers sidetracked by unproductive power struggles; for professionals hindered by bureaucratic obstacles and deadline delays; and for staff workers who have to \"manage the boss.\" This is not a book for those who want to \"grab\" power for their own ends. But if you'd like to create smooth, responsive working relationships and increase your personal effectiveness on the job, Kotter can show you how?and make the dynamics of power work for you instead of against you.",
  "genres": [
    "Leadership",
    "Business",
    "Self Help",
    "Psychology",
    "Management"
  ],
  "author": "John P. Kotter",
  "average_rating": "3.91",
  "url": "https://www.goodreads.com/book/show/251737.Power_and_Influence"
}