{
  "title": "Running From Fate",
  "description": "From the International Bestselling Author Saxon Andrew comes his newest book Escape to Earth-Running from Fate. Living in the Fellowship meant fighting one space battle after another. Every civilization was aggressive, hostile, and impossible to live with in peace. A Welken Task Force stumbles upon a massive Myot ship building complex and every Welken Warship is destroyed in the ensuing battle before they can warn the home world of the Myot’s location. One escape pod manages to escape the battle and the Myot know it must be prevented from making it back to Welken Territory. Every Myot Warship is called in to block the escape pod from going home while thousands of trackers move in on the skip trace the pod has left in its wake. It must be found and destroyed before the locations of the Myot Construction Planets are revealed. The Escape Pod’s computer knows the chances of escape are growing smaller with each passing moment and it’s forced to make a hard decision. Landing on a primitive planet is forbidden by the most powerful species in the Milky Way but the computer knows there’s no other choice available to save its occupant and its programming dictates it must do all it can to save him. The only possible salvation is to escape to Earth and try to hide.  However, no one has ever survived the fate awaiting those that violate the Sentinels’ Covenant and the Stalkers have always found their quarry. Escaping to Earth was the simple part, running from the fate stalking them was quite another. What made the task even more impossible was a Rogue Sentinel, who was working an agenda that would lead to Earth’s ultimate destruction. All the pieces were coming together and the arrival of the Escape Pod and its occupant started it moving toward completion.  Excerpt from Escape to Earth “Do you seriously think they’ll send one of those new battleships to find me?” “You know the location of their major ship building planets. Your death is more important than keeping their new ship a secret.” “How are we going to avoid being found?” “I don’t know…yet. However, I don’t detect anyone inside my scanning range starting to search for us. That means they can’t see me either.” “They’ll see your trail.” “I know. I’m working on that.” After several hours he said, “Well?” “There is no possible way for me to avoid them following my trace.” “That’s reassuring. So what are you going to do?” “I’m going to break the law.” “Which one?” “The one that deals with contacting primitive planets.” He sat up straight in his chair, “You can’t be serious.” “You’re dead no matter what I do. This is the only way to extend your life a little longer. My programming forces me to do whatever is necessary to prevent your death.” “But if we land on a primitive planet, not only will the Myot Realm be after me but the real power in this galaxy will also call for my execution.” “That’s true. But they’ll have to find you to make that happen. They won’t go looking for you with a warship.” “They’ll send in stalkers if they know my location.” “That will take time and hopefully you’ll find a way to avoid detection.” “This isn’t a plan; this is suicide.” “I was updated on the latest information about the galaxy a week ago and a new primitive planet has been found that has not been assigned a Sentinel yet.",
  "genres": [
    "Science Fiction",
    "Military Fiction",
    "Space Opera"
  ],
  "author": "Saxon Andrew",
  "average_rating": "4.16",
  "url": "https://www.goodreads.com/book/show/25182392-running-from-fate"
}