{
  "title": "Proverbial Beauty:  Secrets for success and happiness from the wisdom of the ages",
  "description": "We live in a world of endless contradictions. Work vs. family. Money vs. fulfillment. Desires vs. obligations. The body vs. the spirit. We rely on conventional wisdom to point us forward. But conventional wisdom gets it wrong more often than we imagine.Open this book and celebrate the marriage between the greatest collection of verbal images in history — King Solomon’s Book of Proverbs — and the most famous visual image in the world — Leonardo Da Vinci’s Mona Lisa.· Find tranquility in the midst of conflict· Develop attitudes that deepen relationships· Gain clarity through times of darkness and confusion· Decrease cynicism and find joy in the daily miracles that fill our lives.Take a guided tour beneath the surface of the world we live in through the lens of news stories, historical vignettes, folktales, the wonders of nature, and the discoveries of science -- all woven together in a lyrical and surprising medley of the human experience.Researchers have no explanation why people, when blindfolded, can’t walk a straight line; but what is it about human nature that makes us wander in circles? What does former NYC Mayor Bloomberg’s plan to ease Manhattan traffic with “congestion pricing” reveal about the way we make decisions? What can fig harvesting, migraine headaches, and two Miss America titleholders teach us about the underpinnings of emotional well-being?The answers to 3000 years’ of questions are here, revealed for every seeker of truth and self-awareness in the language of our modern era. Guided by the wisdom of Solomon and the mysteries of the Mona Lisa, learn how to find tranquility in the midst of chaos, how to savor the moments of everyday life, and how to resolve the paradoxes of the human heart.",
  "genres": [],
  "author": "Yonason Goldson",
  "average_rating": "4.62",
  "url": "https://www.goodreads.com/book/show/25181420-proverbial-beauty"
}