{
  "title": "The Brightest Day: A Juneteenth Historical Romance Anthology",
  "description": "The Brightest Day: A Juneteenth Historical Romance Anthology, with a foreword by the inimitable Beverly Jenkins, brings you four novellas highlighting love, light, and hope set over a period of history that’s often left in the shadows.Amazing Grace, by Lena Hart:It’s the year 1866—the Civil War is over and slavery has ended. Life for 18-year-old Gracie Shaw takes an unexpected turn when she is “encouraged” to marry a man sight-unseen. Boarded on a train headed West—to lawless territory—she is faced with misfortune at every turn and must accept the help of former Confederate soldier, Logan Finley, while denying herself the one thing she wants most. Him.Drifting to You, by Kianna Alexander:During the sultry Carolina summer of 1875, baker Rosaline Rhodes boards a Juneteenth cruise down the Cape Fear River. She's there to serve her famous cinnamon spice cake; shipbuilder Will Pruett is there for pleasure. They've denied their mutual attraction for months, but now the river won't be the only thing ebbing and flowing.A Sweet Way to Freedom, by Piper Huguley:In 1910, schoolteacher Missouri Baxter refuses to return home with a big belly and no husband. She’s got nine months to teach juke joint owner Arlo Tucker—a most reluctant student—an important lesson about what marriage means to their people. With God on her side, she'll show him “A Sweet Way to Freedom.”Let It Shine, by Alyssa Cole:Sofronia Wallis knows that proper Black women don't court trouble by upending the status quo, and they most certainly don't associate with roughneck Jewish boxers like Ivan Friedman. But it’s 1961 and the Civil Rights movement is in full swing. Change—and love—are coming whether Sofie is ready or not.",
  "genres": [
    "Historical Romance",
    "Romance",
    "Anthologies",
    "Historical Fiction",
    "Historical",
    "Short Stories",
    "Interracial Romance"
  ],
  "author": "Kianna Alexander",
  "average_rating": "3.93",
  "url": "https://www.goodreads.com/book/show/25175753-the-brightest-day"
}