{
  "title": "Healing the Wounds of Childhood: A psychologist’s journey and discoveries from wretched beginnings to a thriving life",
  "description": "In Healing the Wounds of Childhood and Culture , author Dr. Don St. John offers a new model of wholeness, and he challenges us to embark on an adventure of a lifetime. The road to healing and self-fulfillment is not always an easy one. It can be ever-growing, with swift turns, unexpected detours, and complicated signs often leading to frustration, irritation, and a sense of defeat. But you don’t have to do it alone, and it doesn’t have to be a headache of conflicting information. Are you ready to embark on the adventure of a lifetime? Let Dr. Don St John take your hand and lead the way towards your revitalization. In Healing the Wounds of Childhood and Culture , he doesn’t promise easy fixes, but meaningful, impactful ones that will guide you through the rest of your life. In blending his personal and clinical experiences, Dr. St John awakens his readers to the multiple effects of personal traumas and the wounds inflicted by our culture that cut into us no matter what age, gender, or backstory. The author shares his own story of growing up in an environment replete with violence and ignorance. He knows his subject matter not only through decades of professional study, but from his own experience as well. His is an “If I can do it, you can do it” story, written from his heart and soul. You can be more than just the culmination of your past. In his book, Dr. St John discusses why many have failed to recognize how their potential has been limited. He calls the process of uncovering , discovering and developing our potential an adventure of a lifetime. As with any great adventure, it can be filled with the unexpected, with challenges and with breathtaking rewards. His own life testifies to this statement. The author shows how societal ills, such as violence, addiction, substance abuse, loneliness, depression, apathy, polarization, and relationship distress, all have roots in trauma, including scarcity and neglect. But if this is where your story began, it most certainly doesn't have to be where your story ends. Your past does not have to limit you to what you can do with your life. Read this from an author who walks his talk. Healing the Wounds of Childhood and Culture points towards a future of harmony, self-love, and an increasing capacity for deep, emotional intimacy. It provides an understanding of what is needed for us not only to survive, but to flourish, especially in relationships with ourselves and our loved ones.Are you ready to move beyond survival and scarcity and embrace abundance and harmony? The journey is yours to take, with Healing the Wounds of Childhood and Culture , yours to conquer.",
  "genres": [
    "Psychology"
  ],
  "author": "Don St. John",
  "average_rating": "3.88",
  "url": "https://www.goodreads.com/book/show/25185320-healing-the-wounds-of-childhood"
}