{
  "title": "Holly",
  "description": "Jude Deveraux, the dazzling \"New York Times\" bestselling author of \"Wild Orchids\" and \"Forever and Always\" delivers a delightful and passionate yuletide tale sure to become a classic this and every holiday season. Hollander \"Holly\" Latham can't believe her good fortune. After endless calls, letters, emails, and promises, she's finally persuaded her parents to buy Spring Hill Plantation just outside beautiful, historic Edenton in eastern North Carolina -- and strategically located near Belle Chere, the purest, most untouched plantation site in America.At the tender age of thirteen, Holly fell in love with Lorrie Beaumont, who inherited the Revolutionary-period estate when his heiress mother died during childbirth. Though more than a decade has passed since Holly last locked eyes with her childhood love, the passion she felt in her young heart has never come close to extinguishing -- that is, until charming, ruggedly handsome Nick Taggert unexpectedly waltzes into her life and treats her to an unforgettable weekend of laughter and intense passion.Despite Holly's undeniable attraction to this dazzling stranger, she knows he's not marriage material. What Holly doesn't know is that Nick Taggert is actually Dr. Nicholas Taggert. Having been with more than his share of women only interested in money and pedigree, Nick decides to test Holly and conceal his more refined qualities. Will Holly be seduced by Lorrie's wealth and privilege, or will she choose the simple gift of love that Nick has offered her? The answer is unveiled on a starry Christmas night, when passion, hate, and greed collide to reveal bitter truths that will forever change the course of Holly's charmed life. With\"Holly,\" Jude Deveraux once again uses her golden touch to conjure up a tale full of dazzling intrigue and inspiring romance. It is a story for all seasons and one to remember always.",
  "genres": [
    "Romance",
    "Christmas",
    "Contemporary Romance",
    "Fiction",
    "Contemporary",
    "Mystery",
    "Holiday"
  ],
  "author": "Jude Deveraux",
  "average_rating": "3.68",
  "url": "https://www.goodreads.com/book/show/251952.Holly"
}