{
  "title": "The Crook Factory",
  "description": "\"Wonderful...brilliantly realized...a gripping narrative.\"- Iain Pears, \"New York Times\" bestselling author of \"An Instance of the Fingerpost\" In 1942, at the height of World War II, the famous writer Ernest Hemingway sought permission from the U.S. government to operate a spy ring out of his house in the Cuban countryside. This much is true...It is the summer of '42, and FBI agent Joe Lucas has come to Cuba at the behest of the Director to keep an eye on Ernest Hemingway, who has recklessly decided to play spy in the Caribbean. Lucas has been instructed to somehow gain the great writer's trust and friendship, but all the agent's cool intellect and training has left him unprepared to withstand the human whirlwind known as \"Papa.\"Hemingway has assembled a spy ring that he calls the \"Crook Factory\"--including an American millionaire, a twelve-year-old Cuban orphan, a Spanish jai alai champion, a priest, and a fisherman, among others--to play a dangerous game of amateur espionage. Then, against all odds, Hemingway uncovers a critical piece of intelligence, and the game turns deadly for himself, Lucas, and for untold innocents.In \"THE CROOK FACTORY,\" Dan Simmons weaves an unforgettable tale of riveting suspense, peopled by larger-than-life characters who inhabit the sensual, intoxicating Cuban landscape of the 1940s. It is a novel of honor, passion, and deadly conspiracy.And it could very well have happened...Interestingly, about 75% of the stuff in this book actually happened. The remaining 25% adds an excellent spy story that may have happened while still fitting all known/revealed facts about Hemingway and his friends in Cuba during WWII.",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Thriller",
    "Mystery",
    "Historical",
    "Espionage",
    "Suspense"
  ],
  "author": "Dan Simmons",
  "average_rating": "3.84",
  "url": "https://www.goodreads.com/book/show/11535.The_Crook_Factory"
}