{
  "title": "The Gardener's Son: A Screenplay",
  "description": "In the Spring of 1975 the film director Richard Pearce approached Cormac McCarthy with the idea of writing a screenplay. Though already a widely acclaimed novelist, the author of such modern classics as \"The Orchard Keeper\" and \"Child of God,\" McCarthy had never before written a screenplay. Using nothing more than a few photographs in the footnotes to a 1928 biography of a famous pre-Civil War industrialist as inspiration, the author and Pearce together roamed the mill towns of the South researching their subject. One year later McCarthy finished \"The Gardener's Son,\" a taut, riveting drama of impotence, rage, and ultimately violence spanning two generations of mill owners and workers, fathers and sons, during the rise and fall of one of America's most bizarre utopian industrial experiments. Produced as a two-hour film and broadcast on PBS in 1976, \"The Gardener's Son\" recieved two Emmy Award nominations and was shown at the Berlin and Edinburgh Film Festivals. This is the first appearance of the film script in book form.Set in Graniteville, South Carolina, \"The Gardener's Son\" is the tale of two families: the Greggs, a wealthy family that owns and operates the local cotton mill, and the McEvoys, a family of mill workers beset by misfortune. The action opens as Robert McEvoy, a young mill worker, is having his leg amputated -- the limb mangled in an accident rumored to have been caused by James Gregg, son of the mill's founder. McEvoy, crippled and isolated, grows into a man with a \"troubled heart\"; consumed by bitterness and anger, he deserts both his job and his family. Returning two years later at the news of his mother's terminal illness, Robert McEvoy arrives only to confront the grave diggers preparing her final resting place. His father, the mill's gardener, is now working on the factory line, the gardens forgotten. These proceedings stoke the slow burning rage McEvoy carries within him, a fury that ultimately consumes both the McEvoys and the Greggs.",
  "genres": [
    "Fiction",
    "Plays",
    "Drama",
    "Historical Fiction",
    "20th Century",
    "American",
    "Film"
  ],
  "author": "Cormac McCarthy",
  "average_rating": "3.46",
  "url": "https://www.goodreads.com/book/show/25199049-the-gardener-s-son"
}