{
  "title": "Seventeen & J",
  "description": "\"In Seventeen the story of a lonely seventeen year old who turns to a right-wing group for self-esteem and J the story of a spoiled, young, drifter son of a Japanese executive Oe shows us a world where the values that had regulated life had been blown to smithereens along with Hiroshima and Nagasaki: what confronts his heroes now is a gaping emptiness.\" \"Seventeen's lost young man is in the throes of becoming a right wing activist and assassin. He feels his identity for the first time in the enervating rush of murderous violence. The story has enormous topicality and vibrancy for today. In J. our protagonist's erotic excitement comes as a \"chikan\" one who rubs himself against women on crowded trains rather than participating in the drab everyday world, which he feels would only be self-deception. He can only feel complete while attaining \"the absolute ecstasy of total action.\" Of course this action of sexual assault can bring arrest, disgrace, and imprisonment. As always, Oe treats his subjects not with pity or disdain, but with sympathy.\" \"Kenzaburo Oe is without a doubt the first truly modern Japanese writer. He has managed a feat which even his talented and prolific elder contemporary, the late Yukio Mishima, was unable to accomplish: he has wrenched Japanese literature free of its deeply rooted, inbred tradition and moved it into the mainstream of world literature. Oe's influences and literary heroes are less Japanese than American and European. Henry Miller, Norman Mailer, and Jean-Paul Sartre rank high among them, and Oe's favorite novel, he confesses, is Huckleberry Finn.\" Oe grew up on the western island of Shikoku, a place steeped in Japanese rural traditions and wartime propaganda. His early works are regarded as classics of the disillusionment his nation felt on seeing what Japan's leadership had done to the country. His heroes have been expelled from the certainty of childhood into a world that bears no relation to their past.",
  "genres": [
    "Fiction",
    "Japan",
    "Japanese Literature",
    "Short Stories",
    "Literature",
    "Novels",
    "Novella"
  ],
  "author": "Kenzaburō Ōe",
  "average_rating": "3.60",
  "url": "https://www.goodreads.com/book/show/25194.Seventeen_J"
}