{
  "title": "Weird Tales: A Collection of \"Original\" Paranormal Short Stories in Classic \"Weird Tales\" Style",
  "description": "FYI . . . \"When You Buy the Paperback Version -You Get the Kindle FREE\"  (Press Release)  FOR IMMEDIATE RELEASE:   Great reviews say it all – Weird Tales tribute Rocks!  The new Weird Tales collection by author Lyn Murray (the best of Lyn Murray) capsulized in this 500 page compilation that is filled with eerie short stories that are based on real events (available now on Amazon.com) is a tribute to the original magazine first published in 1923 – and to all of the literary greats like Ray Bradbury, H. P. Lovecraft and Isaac Asimov, whose contributions made the magazine a huge success – and all of them a household name.  In keeping with the original magazine’s creepy agenda – Lyn Murray’s nomadic mind takes readers on a wild ride into the paranormal world of supernatural beings called BEKs (Black Eyed Kids) who want in and take your soul when they gain access, strange cemeteries with clandestine itineraries, Bigfoot UFOs, ghostly apparitions on a mission, real Werewolves, the most haunted objects in the world, a streetlight for the dead, night shadows with eyes only for you, nightmares that refuse to leave at dawn, and forbidden places that innocently draw you in then refuse to let you leave.  In a world with so many unexplained phenomena – Lyn Murray’s Weird Tales carries on a chilly tradition of cold drafts, goosebumps – and things that go bump in the night that will have you looking under your bed and burning closet lights all night – forever!  Weird Tales by Lyn Murray is no respecter of persons – scaring young and old alike, with fast paced, fact-based stories you can’t put down. As one fan so aptly noted: “Murray has a fine hand with complicated and disturbing paranormal content, and this collection is unsettling and chilling! The hair on the nape of my neck is suitably raised, and Murray is to blame because she is such a skillful writer, bringing the worst imaginings to life with her perfect prose and clever way of pacing with both urgency and elaborate detail, everything from first-hand stories to case studies and research. She's really in command with these tales, like a reporter from the dark side of the paranormal mind.” Alex Prosper.  A different kind of writer, Lyn Murray is a Documentarian Storyteller whose writing style puts you at ease – like enjoying coffee and conversation with an old friend, all the while looking over your shoulder for fear someone (some thing) is creeping up behind you – because somewhere in the back of your mind you know that this is more than just fiction – it’s REAL!  Weird Tales by Lyn Murray Available NOW on Amazon.com Offered by Golden Panda Publishing  Enjoy!",
  "genres": [],
  "author": "Lyn Murray",
  "average_rating": "3.83",
  "url": "https://www.goodreads.com/book/show/25203537-weird-tales"
}