{
  "title": "The Provocateur's Payback",
  "description": "“‘Shit!’” His heart skipped a beat as he stopped the car. He'd almost run over a stray dog….He couldn't shake the lingering presence of his own dear departed dog, Trasto.”The Provocateur’s Payback, a gay thriller of international intrigue, introduces a trio of memorable characters: Curro, disillusioned playboy who’s left the club scene behind in search of a new life purpose after losing his beloved dog; Dima, handsome martial arts champion who’s fled from goons in the Russian Mafia; and Eugenia, elegant super-model with stunning green eyes whom the witless gossips of Madrid society have long pegged as Curro’s ideal consort.The action opens on a hot summer night, as Curro’s driving his convertible sports car, heading back to Madrid from a country house weekend. His world is turned upside down when from out of the darkness he hears a desperate plea: “Hurry, please! Quickly! Get going, they want to kill me.” Before Curro can protest, Dima’s flopped in to the passenger seat. Abandoning caution, Curro agreeably floors the gas with the mysterious stranger next to him.The action speeds along from Curro’s apartment, where Dima finds safe haven to recover from the stab wounds he suffered that fateful night; to Madrid’s Royal Opera House, where Russian thugs stalk Dima; to a posh Madrid night spot where Dima meets Eugenia, and an instant attraction sparks between them. Curro, with his keen sense of sexual chemistry, detects a special link between them, even as he hopes that Dima might save a spark for him.Praise for The Provocateur’s Payback“A fantastic portrait of decadence filled with wit.”—Vanity Fair (Spanish edition)“The most delirious gay thriller in the history of [the] Spanish novel.”—Eñe Literary Magazine“One of the season’s literary surprises.”—Shangay Magazine“A fascinating story filled with humor, violence, and eroticism.”—El Cultural Magazine",
  "genres": [
    "M M Romance"
  ],
  "author": "Paco Munoz-Botas",
  "average_rating": "3.46",
  "url": "https://www.goodreads.com/book/show/25210443-the-provocateur-s-payback"
}