{
  "title": "A Guide to Mindful Eating",
  "description": "The Guide to Mindful Eating is a collection of Mindfulness Eating Exercises and transformation tools with 45 delicious veggie recipes that are recommended within a weekly dream healthy menu. The Guide is designed to enrich the reader’s knowledge about mindfulness, mindful eating and nutrition, it is full of healthy cooking tips, and the ways to have a healthy vegetarian diet. ‘Preparing the Guide to Mindful Eating with Recipes, our aim was to create a set of easy to use and useful transformation tools that will help the reader examine the eating habits and patterns within every day’s life. Mindful Eating Exercises will help with over-eating, eating too often, eating too little, eating junk food, food allergies, etc. Mindful Eating is a big step towards Mindful Living.’ Said Nuit Mirjana Musulin has a BSc of Economics and passion for healthy food. She transformed her life and health improving her diet and nutrition.. 'I have decided to share my thoughts about Nature medicine and my favorite healthy food recipes with you, in hope that you will also learn from Nature about herbs, organics, benefits of eating veggies. I hope to inspire you to find enough strength within yourself to heal your own mind and body, and give yourself a gift of a well designed and balanced diet bring into your life more health and happiness.' Mirjana Nataša Pantović Nuit is a yogi, a writer, and a spiritual researcher in mindfulness, meditation, alchemy, and the art of conscious living. 'The Guide to Mindful Eating is designed to raise awareness around food. The food quality can replaces the quantity, and the mindfulness can become our guide and protector. With mindful eating, the self-respect will follow.' Nuit About the Exploring the Alchemy of Human Being Art of 4 Elements examines Human Brain and Mind Powers, tools to increase Creative Thinking, and ways to achieve Mindfulness and Free Mind. Alchemy of Love Courses specialize in the Mindfulness How to be Mindful, How to eat Mindfully, How to be a Conscious Parent.",
  "genres": [
    "Vegetarian",
    "Self Help",
    "Nonfiction",
    "Spirituality"
  ],
  "author": "Nataša Pantović",
  "average_rating": "4.64",
  "url": "https://www.goodreads.com/book/show/25209039-a-guide-to-mindful-eating"
}