{
  "title": "History on Trial: My Day in Court with a Holocaust Denier",
  "description": "Now a major motion picture starring Rachel Weisz, Timothy Spall and Tom Wilkinson. “A compelling book: memoir and courtroom drama, a work of historical and legal import. ” -- Jewish Week Deborah Lipstadt, author of the groundbreaking Denying the Holocaust , chronicles her six-year legal battle with controversial British World War II historian David Irving that culminated in a sensational 2000 trial in London In her acclaimed 1993 book Denying the Holocaust , Deborah Lipstadt called putative World War II historian David Irving “one of the most dangerous spokespersons for Holocaust denial”, a conclusion that she reached by examining his cunning manipulations of evidence, partisanship to Hitler, persistent exoneration of the Third Reich, and his confirmed celebrity among swelling ranks of anti-Semitic organizations internationally. In 1994, Irving filed a libel lawsuit, not in the U.S. courtroom—where the onus of proof lies on the plaintiff, but in the UK—where the onus of proof lies on the defendant. At stake were not only the reputations of two historians, but the record of history itself. The four-month trial took place in London in 2000 and drew international attention. With the help of a first-rate team of solicitors and historians and the support of her UK publisher, Penguin, Lipstadt won, her victory proclaimed on the front page of major newspapers around the world. Part history, part real life courtroom drama,  Denial is Lipstadt’s riveting, blow-by-blow account of the trial that tested the standards of historical and judicial truths and resulted in a formal denunciation of the infamous Holocaust denier. Originally published as History on Trial .",
  "genres": [
    "History",
    "Nonfiction",
    "Holocaust",
    "Memoir",
    "Politics",
    "Law",
    "War"
  ],
  "author": "Deborah E. Lipstadt",
  "average_rating": "4.21",
  "url": "https://www.goodreads.com/book/show/252116.History_on_Trial"
}