{
  "title": "Sunstroke: Selected Stories",
  "description": "\"The Gentleman from San Francisco\" is easily the best known of Ivan Bunin's stories and has achieved the stature of a masterpiece. But Bunin's other stories are not to be missed. In Sunstroke, Graham Hettlinger has selected the \"Gentleman\" and twenty-four other stories and translated them afresh—several for the first time in English. The result is a collection that is remarkable in its crystalline prose, surprising in its vibrancy. It includes, among others, \"Raven,\" \"Cold Fall,\" \"Muza,\" \"Styopa,\" \"Antigone,\" \"In Paris,\" and \"Late Hour.\" Never has the last of the great \"gentry\" writers and the first Russian to win the Nobel Prize for Literature received a more caring and passionate translation. The lyric impulse that motivated so much of Bunin's writing is evident throughout the stories in Sunstroke. In the prose miniatures, such as \"Summer Day\" and \"Sky Above a Wall,\" he seeks only to capture a momentary impression or a passing scene rather than to write a traditional narrative. And even in his longer works, Bunin displays little interest in exploring the psychology of his characters or creating detailed plots. Instead these stories are primarily shaped by an urge to express both the intense, sensual pleasure of existence and the tragic fleetingness of life. Thus, even as they depict a wide range of affairs, seductions, betrayals, and deaths, they tend to read more like poetry than potboilers, delivering their most powerful effects through the rhythms and pacing of their sentences, their highly detailed, sensuous imagery, and the connotative richness of their language.Sunstroke confirms Bunin's stature as one of the greatest—and most neglected—Russian writers of the twentieth century.",
  "genres": [
    "Russia",
    "Classics",
    "Russian Literature",
    "Short Stories",
    "Fiction",
    "Nobel Prize",
    "20th Century"
  ],
  "author": "Ivan Bunin",
  "average_rating": "4.07",
  "url": "https://www.goodreads.com/book/show/252133.Sunstroke"
}