{
  "title": "Reiser's Ramblings",
  "description": "All profits from the sale of Reiser’s Ramblings go to Haitian relief efforts sponsored by Reiser Relief Inc.“Reiser’s Ramblings” is a collection of daily/weekly meditations/devotions ~ daily reflections from the best columns written over the past three decades by Fr. Bernard Reiser, former pastor of Epiphany Parish in Coon Rapids, Minn.From farm living to an eternity in Heaven, Fr. Reiser brings together a wonderful collection of Christian spiritual “ramblings” that all of us can take to heart. We end up with a lovely book of short, easily read reminiscences and edifying stories and thoughts, with each column titled. The reader is meant ponder the spiritual message and meaning in each column and how, or if, it applies to each individual life. The writings talk of his growing up in a farming family, to teaching you how to start and continue having a relationship with God, and the people around you.As quoted from The U.S. Review of Books website May 13th 2012: “Reiser's Ramblings”, - A collection of weekly newsletter columns from the former pastor of the rural Epiphany Parish in Coon Rapids, Minnesota, this book is a mixture of humorous, sad, nostalgic, and inspirational pieces. By turns thoughtful, provocative, or just plain funny, it is the kind of book one can sample, read and reread, or share stories from with family and friends. It is nicely illustrated with black and white photos and drawings. The columns are short, but memorable, and always provide something to think about or learn from. Never stuffy or preachy, Reiser has created an enjoyable reflection of life.”The columns are separated into six Early Life and Key Influences; The Wonder of God's Creation; Our Place in God's World; Counting Our Blessings; God's Grace at Work Within Us; All Eyes on Heaven. Each column is titled and short. So we end up with reminiscences and a lovely book of short, easily read edifying stories and thoughts.Artwork illustrations were by Minnesota professional portrait painter Mark Sanislo, a long time friend of Fr. Reiser and parishioner of Epiphany Church. And special thanks to our Jacqueline Hilgert/ Traditions Communications who helped put the book into reality; it would have not been possible without her professional assistance.Book Awards and HonorsMay 2011 San Francisco Book Festival \"Honorable Mention\" for the spiritual categoryMay 2011 Paris Book Festival \"Runner-Up\" for the spiritual categoryJune 2011 Beach Book Festival \"Runner-Up\" for the spiritual categoryJuly 2011 Catholic Writers Guild Seal of ApprovalJuly 2011 Midwest Book Reviews Small Press Bookwatch Memoir Shelf, highly recommended)November 2011 - USA News Best Books Awards (Finalist, Christian Inspirational)January 2012 London Book Festival ( Spiritual, Honorable Mention)May 2012 Eric Hoffer Book Award ( Spiritual, Honorable Mention) and The First Horizon Award FinalistWINNER of the 2012 Indie Excellence Award in the category of Religion-Non-Fiction.",
  "genres": [],
  "author": "Bernard Reiser",
  "average_rating": "4.54",
  "url": "https://www.goodreads.com/book/show/11537820-reiser-s-ramblings"
}