{
  "title": "Children and Other Wild Animals: Notes on badgers, otters, sons, hawks, daughters, dogs, bears, air, bobcats, fishers, mascots, Charles Darwin, newts, ... tigers and various other zoological matters",
  "description": "In Children and Other Wild Animals, bestselling novelist Brian Doyle (Mink River, The Plover) describes encounters with astounding beings of every sort and shape. These true tales of animals and human mammals (generally the smaller sizes, but here and there elders and jumbos) delightfully blur the line between the two. In these short vignettes, Doyle explores the seethe of life on this startling planet, the astonishing variety of our riveting companions, and the joys available to us when we pause, see, savor, and celebrate the small things that are not small in the least. Doyle’s trademark quirky prose is at once lyrical, daring, and refreshing; his essays poignant but not pap, sharp but not sermons, and revelatory at every turn. Throughout there is humor and humility and a palpable sense of wonder, with passages of reflection so true and hard earned they make you stop and reread a line, a paragraph, a page. Children & Other Wild Animals gathers previously unpublished work with selections that have appeared in Orion, The Sun, Utne Reader, High Country News, and The American Scholar, as well as Best American Essays (“The Greatest Nature Essay Ever”) and Best American Nature and Science Writing (“Fishering”). “The Creature Beyond the Mountain,” Doyle’s paean to the mighty and mysterious sturgeon of the Pacific Northwest, won the John Burroughs Award for Outstanding Nature Essay. As he notes in that tribute to all things “sturgeonness”: “Sometimes you want to see the forest and not the trees. Sometimes you find yourself starving for what’s true, and not about a person but about all people. This is how religion and fascism were born, but it’s also why music is the greatest of arts, and why stories matter, and why we all cannot help staring at fires and great waters.”",
  "genres": [
    "Essays",
    "Nonfiction",
    "Nature",
    "Parenting",
    "Animals",
    "Humor",
    "Short Stories"
  ],
  "author": "Brian  Doyle",
  "average_rating": "4.50",
  "url": "https://www.goodreads.com/book/show/25220383-children-and-other-wild-animals"
}