{
  "title": "Sherlock Holmes and the Case of the Sword Princess",
  "description": "Mirabella Hudson soon learns that the Great Detective has more in store for her than washing jars and labeling pistol shooting, fencing, boxing, and Jiu-Jitsu. This she can master, but Mirabella must face the greatest horror of Miss de Beauvais' Finishing School for Distinguished Young Ladies.Sherlock Holmes gets more than he bargained for when he hires his landlady's young ward to keep his laboratory in order. Mrs. Hudson's niece might be clever, but Mirabella Hudson is insubordinate, talks too much, is an accident waiting to happen--and, worst of all, is distractingly pretty.Unfortunately, 'pretty' is just what Sherlock Holmes needs.Sherlock might be a master of disguise, but pretty he is not. The Great Detective requires a female operative to go under cover at London's premier finishing school where Princess Elena Petrovic-Njegos of Montenegro is a client--and the target of an assassination plot. If the inexperienced Miss Hudson and her employer do not succeed in saving the princess, there is trouble brewing across the globe leading to war on a massive scale. Montenegro is a small Serbian country, but she has among her allies the Mother Russia.One unsuccessful case could ruin this young detective's career before it starts. Above all, Sherlock must have work. Work is the blood in his veins. Work is life.The game is afoot! And there can be no greater puzzle than what he receives in the form of one Mirabella Hudson--who might stump even Sherlock Holmes.The Great Detective In Love is a series finalist Chanticleer Mystery & Mayhem awards 2017, Goethe Awards for Historical Fiction 2017, International Book Awards Mystery/Suspense 2017, Readers' Favorite Awards Historical Mystery 2017.Romantic Historical Mystery in the humorous vein of Jane Austen. Fast-paced action, historical immersion, characters who come alive on the page, witty dialogue, and delightful romance.Praise for \"The Great Detective in Love\" \"Cumberbatch/Sherlock meets his match!\" - Jan, Audible reviewer\"Sherlock in Mr. Darcy mode...\" - PandaRS, Audible reviewer\"Irene Adler has competition\" - Mary, Audible reviewer\"Sir Doyle would enjoy...this is a tale that Sir Art would enjoy. It has all of the classic trappings of one of his novels. From the language to the descriptions of London and its denizens, it is historical fiction at its best.\" - Christopher Gallagher\"A Sherlock tale with Hepburn and Tracy flair...It had the feel of a classic old Hollywood mismatched romantic comedy to me...Hepburn and Tracy. It was charming and would really appeal to people who love the idea of a kind of Jane Austen meets Conan Doyle mash-up.\" - RaynaRed, Audible reviewer\"Holmes turns Human. Delightful story of a young lady that gets the best of the great stone face. Plot well thought out. Holmes still made deductions that led to an exciting finale, and did his best to avoid his creeping interest in his \"student\". Any fan of Doyle should get a chuckle out of this new picture of the great detective.\" - Milo A. Fabian\"Loved the book and its premise! I enjoy the banter and charged atmosphere between Sherlock and his 'detective in training'! There is a difference in their relationship that cannot be in any way compared to that with Watson.",
  "genres": [
    "Mystery",
    "Historical Mystery",
    "Romance",
    "Historical Fiction",
    "Victorian",
    "Audiobook",
    "Fiction"
  ],
  "author": "Suzette Hollingsworth",
  "average_rating": "4.04",
  "url": "https://www.goodreads.com/book/show/25220773-sherlock-holmes-and-the-case-of-the-sword-princess"
}