{
  "title": "Surrender",
  "description": "This book contains extreme graphic violence, explicit sexual scenes and strong adult language read with caution.  Love. Would we do anything for it? Really put our morals and beliefs, everything we thought right and honourable in front of us and stamp on them all in the name of love? And by wrong, I don’t mean something simple, like turning a blind eye to someone’s addiction, or the fact that the person we are in love with used to be the school bully or uses prostitutes to overcome some deep dark secret they’ve never coped with from their childhood. By wrong, I mean the lowest, most corrupt and ruthless things that someone could ever do. Murder, prostitution, drug dealing, cage fighting, all of the above and more. Could you allow all that just because your heart can’t live without the person that makes your soul dance on dark days, brings you laughter on the day when hell threatens to drag you under and looks at you like their world would end if you ever turned and walked away. Could you condone the actions of a merciless killer just because their touch makes the evil of the world disappear until all that is left is pleasure and ecstasy?  Isla Cormack faces these choices. Her love for Jake Devine is untouchable, pure and undeniable but just when she comes to the conclusion that Jake isn’t a bad man deep down, that his life and even her life has shaped him into the cruel man he is today, both their pasts come back to haunt them, opening secrets that have been buried so deep they threaten to shred any hope of a future together and tearing them so far apart that the chasm between them is impossible to cross.  Isla thought her life had been one long nightmare. She soon finds out that the hell life threw at her is nothing compared to the death and destruction Jake Devine brings with him.",
  "genres": [
    "Dark",
    "Romance",
    "Erotica",
    "Erotic Romance",
    "Contemporary Romance",
    "Mystery Thriller",
    "Psychological Thriller"
  ],
  "author": "D.H. Sidebottom",
  "average_rating": "4.26",
  "url": "https://www.goodreads.com/book/show/25220713-surrender"
}