{
  "title": "Population",
  "description": "Turns out that my alien overlord may be my only shot in this post-apocalyptic nightmare. Figures.AbelEleven years after the sky opened up and aliens descended to ravage the world, Abel thought she had seen and experienced everything that this savage new land – Population – had to offer. Almost...Shock is what she feels when the alien she robbed hunts her down. His corpse, though huge and glowing, had been mangled and left for the scavengers. She thought he was dead, but now he's back to recover what she's stolen and maybe take her life. Abel won't give up either so easily, because these are the only clues she has to where aliens have taken her little sister.What she doesn't expect is to survive her encounter with this brutish, cocky alien, or that she might just have to band together with him to fight against even more dangerous predators. In doing so, Abel unlocks forgotten emotions of a world long past – things she never thought to experience.Desire. Trust. Hope.KaneWhen the little human female attempts to save his life, he doesn't think much of it. But when she makes off with his sword and the key he has been searching for she demands his attention.He hunts her, not expecting that one so small could be so hard to kill. And in dueling with her, and seeing her own determination to save her family, Kane finds it harder to want to push her away and too easy to want to keep her close and under his protection. But the new world that his kind has claimed for their own is harsh and relentless. In order to survive it and complete their parallel missions, they'll need to defy the prejudices of his superior race and work together as equals.Set in a post-apocalyptic Pacific Northwest, Population is an alien invasion, post-apocalyptic, SciFi romance with a strong black female lead kicking ass alongside a possessive, warrior Alpha. This full-length novel contains steamy sex and some violent elements and finds its HEA in book #2, Saltlands. Additional books are planned in the same universe from other characters' perspectives, including Generation 1 in 2020.",
  "genres": [
    "Science Fiction",
    "Romance",
    "Aliens",
    "Fantasy",
    "Post Apocalyptic",
    "Dystopia",
    "Vampires"
  ],
  "author": "Elizabeth  Stephens",
  "average_rating": "4.10",
  "url": "https://www.goodreads.com/book/show/25220487-population"
}