{
  "title": "New York: An Illustrated History",
  "description": "The companion volume to the Emmy Award-winning PBS television series, with more than 500 full-color and black-and-white illustrationsThis lavish and handsomely produced book captures all the beauty, complexity, and power of New York -- the city that seems the very embodiment of ambition, aspiration, romance, desire; the city that has epitomized the entire parade of modern life, with all its possibilities and problems. Chronicling the story of New York from its establishment as a Dutch trading post in 1624 to its global preeminence today, the book is at once the biography of a great city and a vivid exploration of the myriad forces -- commercial, cultural, demographic -- that converged in New York to usher in the contemporary world.Weaving the strands of the city's sweeping history into a single compelling narrative, New York carries us through nearly four centuries of turbulent growth and change -- from the first settlement on the tip of \"Manna-hata\" Island to the destruction wrought by the Revolutionary War; to the city's stunning emergence in the nineteenth century as the nation's premier industrial metropolis; to the waves of early-twentieth-century immigration that forever transformed the city and the nation; to New York's transfiguration as the world's first modern city -- pioneering skyscrapers, apartment houses, subways, and highways -- and its role as the birthplace of so much of American popular culture. Along the way, we witness the building of the city's celebrated landmarks and neighborhoods, from the Brooklyn Bridge and the Statue of Liberty to the Empire State Building and the United Nations; from Wall Street and Times Square to the Lower East Side, Harlem, and SoHo.The book brims with vibrant illustrations, including hundreds of rare photographs, paintings, lithographs, prints, and period maps. The narrative incorporates the voices and stories of men and women -- statesmen, entrepreneurs, artists, and visionaries -- who have lived in and built the an extraordinary cast of characters that includes Peter Stuyvesant, Alexander Hamilton, John Jacob Astor, Walt Whitman, Boss Tweed, Jacob Riis, Emma Lazarus, J. P. Morgan, Al Smith, F. Scott Fitzgerald, George Gershwin, Fiorello La Guardia, Robert Moses, and Jane Jacobs.Accompanying the book's narrative are interviews with Robert A. Caro, David Levering Lewis, and Robert A. M. Stern, and essays by a group of distinguished New York historians and critics -- Kenneth T. Jackson, Mike Wallace, Marshall Berman, Phillip Lopate, Carol Berkin, and Daniel Czitrom -- who add their insights about the city to this splendid history.",
  "genres": [
    "History",
    "Nonfiction",
    "New York",
    "Reference",
    "Travel",
    "Architecture",
    "The United States Of America"
  ],
  "author": "Ric Burns",
  "average_rating": "4.48",
  "url": "https://www.goodreads.com/book/show/2522116.New_York"
}