{
  "title": "One More Ride",
  "description": "Lauren has a choice to make.  With the keys to Blake’s back-up bike in hand, Lauren knows that the door to her freedom has been opened. But the prospect of returning to her old life—the prospect of returning to a different kind of servitude—is not the clear decision that it once was.   Blake has given her more than she ever expected.  When she first came to him, she was nothing more than just another face to be claimed. But he’s brought her into the Night Riders, kept her safe from harm, and given her the hope that maybe, just maybe, everything will be alright.   One final ride, one last chance for the truth.  She wants to make the right choice, the choice that won’t leave her with regrets, but it seems like no matter which choice she makes, she’ll always be losing something. When she sees her picture on the evening news and an impassioned plea from her parents for her return, she knows that separation is all but inevitable…  … Unless she can find a compromise between them.  EXCERPT  Lauren nearly laughed at the idea, the reality of him suddenly so serious. But when he failed to wink and transform it into just another step in whatever dance they were doing, Lauren leaned into the feel of her body tensing even as she stayed in his arms.  “What do you… what do you suggest?” she asked.  He carried her back to his bike and pressed her body into the seat. Climbing behind her, his feet hit the pedals, and the motor purred underneath them as his lips met her ear.  “Found a little place where it can be just us,” he promised. “You want to come with?”  Turning her head over her shoulder, Lauren met his eyes and nodded softly.  “I do,” she confessed, her hands daring to touch his cheek as his brow fell to hers. Their lips nearly met, when Lauren summoned the strength to look ahead even as she kept her hand on his arm.  “Take me,” she said. “Show me where you want us to go.”",
  "genres": [],
  "author": "Kathryn Thomas",
  "average_rating": "3.35",
  "url": "https://www.goodreads.com/book/show/25220218-one-more-ride"
}