{
  "title": "Supervision Basics: A Leadership Mindset",
  "description": "Supervision Basics is a well-rounded low-cost effective supervisor training tool in one volume. For supervisors wanting to better be able to handle the most difficult situations and those who want to go into supervision for the first time. Also for those who work with, or are married to a supervisor, so they can better relate to their demanding experience. Most of those who write books for business are well educated individuals who spent considerable time as managers at upper levels. They usually have a well developed set of skills that make them successful as a both a manager and a writer. They may think they understand front-line management, based upon what they have been told, by those supervisors who are a buffer between them and the guy out on the line. As in all jobs, no one can really understand a job until they have done it. I contend that these authors typically have a disconnect between themselves and the real situation. Front-line management is not the same as middle management. Not many front line managers are capable of, or care to write a book on supervision.  That is where I come in. I have spent years on the front lines of management, working with machine operators, and all types of laborers. The average person just want to make money to support their outside activities, not build a glorious career. They are not looking for every available opportunity to please the boss. Since I share in their lack of interest in advancement, I have spent many years on the front lines. While doing so, as a matter of survival, I have come up with ways to make things work and improve over time, as well as keep the boss and the people content. That is the contents of this book, which I know can be of help to any supervisor who chooses to read it. My expectation is that every reader will find something worth many times the cost of this book that will make their job easier by helping them become more effective. However, It does no good to read the book and not put it into practice. Read a little each day and make the conscious decision to improve upon at least one of your practices. Give it a try. This is not a book about organizational change, but more about working within the norms of whatever the current company culture is. The scope of this book is not to change things about the Company that may need changing. It is about the things that the Supervisor can do for himself.",
  "genres": [],
  "author": "Richard  Warren",
  "average_rating": "0.00",
  "url": "https://www.goodreads.com/book/show/25218900-supervision-basics"
}