{
  "title": "Miriamne the Magdala",
  "description": "\"The Yeshua and Miri Novel Series” is a historical-fiction novel series that follows Jesus and Mary Magdalene during the so called \"missing years\" and throughout their lives. The introductory novel, \"Miriamne the Magdala\", explores the deeply personal relationship between twelve year old Miriamne and her long lost cousin Yeshua bar Joseph. Their tale begins with an unexpected reunion of two Jewish Houses and goes on to explain how a family brought together by a seeming circumstance is ultimately tied together by Destiny. When a family tragedy strikes, and Yeshua and Miri are placed in a dangerous situation, heavenly forces intervene and a divine legacy that must be kept secret to all but their closest family members is revealed.  From the time of his family’s return from Egypt to Nazareth, Yeshua has grown up shunned and reviled by the townsfolk of his step-father Joseph’s home village. Questions surrounding the authenticity of his parentage along with the strange and unpredictable supernatural powers that seem to control Yeshua have the people of the tiny backwater town suspicious and frightened.  When Yeshua’s mother, Mary, sends a letter to her dearest cousin pleading for help for her gravely ill husband, Miriamne’s mother, Salome, instantly responds. Soon, Salome and her husband, Micah – along with their three children: Martha, Miriamne, and Lazarus – set out for Nazareth on a mission of mercy. During the family’s stay, an old but avid argument causes major upset, especially for young Yeshua who loses control of His staggering powers. As a result of the calamity, the angry townsfolk pounce on the opportunity to band together with their rabbi and the Elder’s Council to banish Yeshua from Nazareth—forever.  Once Yeshua is forced to relocate from his family’s home to his cousin’s huge country estate near Sepphoris, the developing friendship between him and Miriamne flourishes. But just when things seem so hopeful, a sudden turn of events causes Yeshua to choose between taking His own action to avoid a terrible tragedy and His obligation to obey His Heavenly Father’s wishes.  When an astonished Miriamne learns of Yeshua’s true identity and His Mission on this earth, she must then decide whether to continue her relationship with Him or risk losing Him to His Fate. The pressure reaches a breaking point when Miriamne’s wealthy uncle, Joseph bar Abram, and his Caravaneers arrive for a family visit, and Yeshua is presented with a rare opportunity that will take Him far, far away from her . . . quite possibly forever. It is then that Yeshua must make a life-altering decision—whether to follow His heart or fulfill His Destiny.  \"The Yeshua and Miri Novel Series\" sequentially includes the following five novels: \"Miriamne the Magdala\" – released in April, 2015 * \"Yeshua the Christ\" * \"Thomas the Twin\" * \"Mark the Scribe\" * \"Princess Sarah\"  * Publication dates to be announced.   Related Subjects    Jesus Christ Mary Magdalene Gnostic Gospels General Christianity Fiction Subjects",
  "genres": [],
  "author": "J.B.  Richards",
  "average_rating": "4.61",
  "url": "https://www.goodreads.com/book/show/25229492-miriamne-the-magdala"
}