{
  "title": "A Strange and Bitter Fruit",
  "description": "A chilly spring night in rural South Carolina at the tail end of Reconstruction, the murder of innocents. This is the setting for the initial chapter of the historical thriller, A Strange and Bitter Fruit.Thomas “Tee” Powell, 15, manages to escape as his family is lynched. His father, Zeke, mother Hessie and young sisters Lannie and Effie were hung to teach the blacks of Aiken that voting is not the right of the former slaves, not anymore. He is angry, but instead of wildly lashing out at the Klansmen that murdered his family, he runs away. After a disastrous detour to Tallahassee, Tee joins the Army and ends up in the West, at a remote Army outpost on the lip of the Black Hills. Here, he grows up and begins to accept responsibility for his life and for the lives of others. After six years, the past, in the form of two of the Klansmen, one now a U.S. Senator on a mission to sign a treaty with the Indians, confronts him.He had buried his past deep, even changing his last name. Now, he has to confront it head on, starting with the two killers that entered his fort. Trained by the Army to kill, Tee emerges from his exile and takes revenge on those that committed the murder of his family, beginning with the two men. His purpose is now clear, he must take revenge, and he proceeds ruthlessly to do so. But revenge has its own cost, and Tee suffers that price. Many innocent people are killed, and he struggles with the guilt.A Strange and Bitter Fruit is the story of revenge and its consequences. It is a story of violence and race, a true American story. The novel raises serious questions: Is there a limit on revenge? Is there an act so horrible that any response, no matter how vicious, is just? A Strange and Bitter Fruit, although it takes place in the 19th Century, confronts the reader with many of the issues of race and violence that we continue to live with today.",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Amazon",
    "Southern",
    "Book Club",
    "Thriller",
    "Historical"
  ],
  "author": "Barry C.  Davis",
  "average_rating": "3.90",
  "url": "https://www.goodreads.com/book/show/11538285-a-strange-and-bitter-fruit"
}