{
  "title": "Turquoise",
  "description": "TURQUOISE adalah simbol cinta dan persahabatan, yang bersemi di tengah konflik yang terjadi di antara tiga orang sahabat yang mencintai seorang gadis yang sama. Kisah yang menuturkan upaya sepasang kekasih dalam mewujudkan cinta sejati mereka di tengah berbagai benturan yang terjadi karena perbedaan-perbedaan prinsip dan ideologi. Di antara kesenjangan sosial psikologis dan keyakinan yang bertolak belakang. Novel ini sarat dengan begitu banyak nuansa. Dengan latar yang digambarkan dengan cara yang sangat detail dan sekaligus puitis. Menggabungkan antara realitas dalam kehidupan masyarakat yang dipenuhi oleh kompleksitas permasalahan, dengan bayang-bayang kabur sebuah dunia surealis yang hidup di dalam dongeng yang sarat dengan mimpi dan sekaligus ilusi yang menyesatkan.TURQUOISE adalah simbol pencarian spiritual dalam diri seorang pemuda dalam upayanya untuk meraih makna kebenaran yang sejati. Di tengah kegalauan hidup yang tiada henti di terjang oleh kencangnya badai gurun. Di tengah amukan badai salju dan kejaran sekawanan serigala yang siap mencabik-cabik tubuhnya. Susah-payah ia bertahan di bawah guncangan kesadaran, bahwa upaya untuk meraih kebenaran adalah merupakan satu-satunya tujuan utama dari hidup itu sendiri. Sebelum akhirnya ia menemui sebuah kenyataan, bahwa cinta tanpa kebenaran tak lain adalah sebuah kesia-siaan, dan kebenaran tanpa cinta tak lain daripada sebuah kemustahilan.TURQUOISE adalah simbol kepahlawanan, kehormatan dan keteguhan hati. Bagaimana seorang gadis berjuang mempertahankan seluruh harga dirinya demi membuktikan ketulusan dan kemurnian cintanya. Dan bagaimana seorang pemuda berusaha keras mengukuhkan segenap rasa cintanya di tengah ombak badai keraguan atas keyakinan dan keimanannya sendiri. Di bawah tekanan moral untuk terus berjuang menegakkan kebenaran dan keadilan, dan mengupayakan nilai-nilai kemanusiaan yang jauh lebih menghargai hidup daripada sebuah kematian.TURQUOISE adalah novel yang menggabungkan kisah-kisah epik penuh kepahlawanan, dongeng-dongeng fantastis yang penuh dengan simbol-simbol puitik, alegori, dan parabel. Penuh dengan benturan berbagai watak dan karakter yang terasa demikian hidup. Sarat dengan aktualitas yang intens dan perdebatan filosofis, melalui beragam konflik yang melahirkan peristiwa-peristiwa tragis dan dramatis sekaligus. “Sebuah riwayat, sedahsyat apa pun, akan tinggal membeku tertimbun gurun waktu, seseorang mengangkatnya kembali dengan cara pandang yang cemerlang. Titon Rahmawan telah menulis secara serius, sehingga terasa betapa kemegahan kisah cinta dan kepahlawanan selalu mencuri perhatian kita untuk menyimak dengan kekaguman tersendiri. Turquoise telah memperlihatkan kelebatan cahaya masa lalu, hadir melalui kata-kata yang anggun dan mudah dipahami. Kita, diam-diam, telah memiliki pengarang setara Tariq Ali.” – Kurnia Effendi, cerpenis dan peneliti LPKP“Karena cinta, persahabatan jadi sirna. Karena cinta harta, cinta jadi binasa. Karena kalap cinta, rasio tidak bicara. Sang penulis, Titon Rahmawan menuliskannya dengan gaya bertutur yang memainkan perasaan, hati, beberapa adegan menampakkan kejutan, secara runtut perlu dibaca dengan cermat untuk mendapatkan efek penggambaran suasana dan peristiwa.” – Yonathan Rahardjo, penulis novel ‘Lanang’ penyabet Juara Harapan 2 Lomba Novel DKJ 2006.“Novel berlatar budaya Arab ini menceritakan senandung kesetiaan di persimpangan jalan. Antara jalan Tuhan dan manusia.‘‘ – Sigit Susanto, novelis dan penulis catatan perjalanan ‘Menyusuri Lorong-Lorong Dunia’“ novel puitis dengan unsur suspense yang semakin menguat dan latar cerita yang berhasil membangun rasa kepedihan.” – Manaek Sinaga, Pemimpin Umum majalah sastra Imajio\"Dengan alur yang tak bersolek, novel ini membuktikan penulisnya adalah juru cerita yang piawai membangun kisah.\" – Donny Anggoro, eseis dan cerpenis. “Sebuah kisah yang sangat menakjubkan, yang dengan cerdas meramu intensitas dramatis, petualangan mistis, ketegangan psikologis, kearifan masa lampau dan gaya tutur yang bertabur puisi menjadi sebuah dongeng dengan latar yang demikian eksotis dan sarat fantasi.” – Ratna Dwi Yulianti, pemerhati sastra.“Lewat Turquoise, Titon Rahmawan berhasil memadukan eksotisme ala Kisah Seribu Satu Malam, kesyahduan sastra sufistik, dan kepiluan gaya Shakespeare-an Tragedy. Salah satu novel yang amat mengasyikkan!” – Iwan Sulistiawan, dosen & penulis pemula",
  "genres": [],
  "author": "Titon Rahmawan",
  "average_rating": "4.29",
  "url": "https://www.goodreads.com/book/show/2522453.Turquoise"
}