{
  "title": "After the Ride",
  "description": "Lauren has been claimed by the hardest, toughest bastard west of the Mississippi.   A month ago, Lauren Nichols would never have thought she’d be where she is now: trafficked and sold to the Night Riders MC, an outlaw biker gang. But that was before she became the property of Blake Bell, and before she discovered her own hidden desire to chase the secret rebel streak within.   There is more to Blake than just a criminal.  The month with Blake is nothing like anything Lauren has ever known. In the privacy of his bed, Lauren discovers a man whose past hides secrets far darker than the ink that covers his scarred body, a man who has never shared that side of him with anyone else, and a man who has become like a drug that she can’t wean herself from no matter how hard she tries.   Together they’ll delve deep into his past to find the keys to her future.   She never expected him to open up to her, never expected him to slowly reveal his secrets to her, and certainly never expected to find a thread of commonality that she shares with the outlaw. The more she unravels his past, the less certain she is of her future and whether or not she could return to the old life she knew.  EXCERPT  “Don’t do that,” he whispered. “Last thing I want is to see you cry.”  Choking back her sobs, Lauren sat up straighter, and her eyes widened when Blake took his hand in hers. His finger curled around her wrist, his hold strangely soft as it grazed her flesh. Daring to meet his eyes, she relaxed as his stare softened.  “I want you to be mine,” he whispered. “All mine. And if…”  He grabbed the back of her head and pulled her into a desperate kiss. Lauren savored the taste of his lips around hers, and as his tongue twirled down her throat, she stretched forward to kiss him deeper, drowning in her addiction of feeling any part of him.  “No…”  She moaned as their mouths parted, but Blake wrapped his arms around her bare shoulders and pressed his brow to hers.  “I’ll keep you safe,” he promised. “You just have to…”  Blake’s voice trailed off, and Lauren took his hand in hers as she waited without breathing for him to finish his thought.  “You just have to trust me.”",
  "genres": [],
  "author": "Kathryn Thomas",
  "average_rating": "3.18",
  "url": "https://www.goodreads.com/book/show/25224289-after-the-ride"
}