{
  "title": "Elliot: His Summer of Love",
  "description": "On the cusp of his senior year at Mercy High, Elliot Donahey, an out but terminally shy gay young man who keeps to the shadows – never wanting to be seen or noticed – suddenly finds himself in the arms of the highest profile jock on campus, local star quarterback, Marco Sforza. Their lives, and those closest to them will never be the same.Set against the backdrop of competitive sports, this character study work deep dives into the lives of these young men who each must \"play the game\" so Marco can continue to play the game he loves. They are just trying to find some small slice of happiness to call their own amidst their hellish final year of high school.Author's Note: Angels of Mercy is first and foremost, a character study. A great deal of it is inner-monologue. Elliot will pause the action, will break momentum as he grapples with his world – all the while flipping a finger to the fourth wall. He knows you're there. It was far more important to me as its author (and a gay man) that the reader come away with the whys of Elliot’s choices in how he navigates his often tumultuous world. The same can be said of Marco (his jock boyfriend) who will pick up the tale with Volume Two (due summer of 2015). I’ve read much queer literature and what I find rather interesting is that for the majority of it, very little is written about the character’s headspace. When you live in a world where you constantly have to be vigilant as you navigate through, it can make for some very powerful storytelling. That is my goal in writing these boys’ lives. I want the reader who may not be queer themselves to come away with what it might be like to be in a gayboy’s shoes – constantly polling and pulse-checking your world because your very survival depends upon it. All of that while you hope, you secretly pray, that you’ll find someone who will see you too and find they can’t live without you in their world. A small slice of happiness to call your own. And though you do everything to keep to yourself, you may still run into those who find your very existence threatens who they are and how they think the world should run. I pull no punches with this work. They are hormonally charged eighteen year old young men who are sexually active. While the sex is present in the work it is not gratuitous in that the main character does evolve from his physical intimacy with his high-profile boyfriend. It is not a genre romance read either, though it has a very strong romance threaded in the work. These elements bring a light to their world that attracts all the wrong attention. In a time where more queer youth are coming out to their teammates and their loved ones, I find that work of this nature is both timely and necessary to tell. I hope you'll find it as interesting and provocative a read as I believe it is.",
  "genres": [
    "Sports",
    "M M Romance",
    "Gay",
    "Young Adult"
  ],
  "author": "S.A. Collins",
  "average_rating": "4.13",
  "url": "https://www.goodreads.com/book/show/25224452-elliot"
}