{
  "title": "Dalton Series: Books 1-3",
  "description": "The first three books in the Dalton series in one volume:  Dalton - Bushwhacked by the corrupt lawman Walker Dodge, Dalton loses his money, his horse, his gun and very nearly his life. Recuperating in the dead-end town of Harmony, he hears rumors of a fabulous treasure hidden nearby and, even with Walker closing in on him, that’s enticing enough to risk staying. And then there’s Misty Valdez, the one person who claims to know where the treasure is, and she entices him even more! But the price of her help may be too high for Dalton. With time running out, can he avoid Misty’s trap and find the treasure before the gun-toting Walker catches up with him? Dalton for Hire - When Dalton holed up in Yellow Creek he tried to put his past behind him. But for a wanted man there can be no peace and he soon finds himself as wealthy Raphael Huffman’s hired gun. Now, with a carpetbag bulging with money to guard in a town bristling with gunslingers, it isn’t long before somebody risks Dalton’s ever-ready gun. But Dalton didn’t expect the money to be stolen from right under his nose and, even worse, for the prime suspect to be his good friend Ryan Foxglove. Despite the numerous killers standing in his way, Dalton must track down the missing money to prove Ryan’s innocence – and stay out of jail. Deputy Dalton - As a wanted man, Dalton never expected to find himself working as a lawman. But that’s just what happens when he rides into Green Creek and the alcoholic Sheriff Holstein press-gangs him into becoming his deputy. Dalton has no choice but to accept the assignment and soon discovers that the whole town has turned against the sheriff. And if that isn’t bad enough, Sharky Bigelow’s spree of cattle rustling is reopening an old vendetta and shattering the town’s peace with a wave of lawlessness. To bring peace to Green Creek, Dalton must restore faith in the law. But can he succeed with nobody to trust but himself? Will the deadly aim of his six-shooter be enough?",
  "genres": [],
  "author": "Ed Law",
  "average_rating": "0.00",
  "url": "https://www.goodreads.com/book/show/25227079-dalton-series"
}