{
  "title": "Saviour",
  "description": "Saviour - Tank and Priss' Story  Everyone has secrets. That is something Hunter ‘Tank’ Adams is well aware of because he has more than his fair share of them.  As an ex-Navy SEAL weapons specialist born into a privileged family, Tank struggles to find his place in the world until he joins Devil’s Spawn MC. Rising through the ranks from prospect to Enforcer; Tank meets what turns out to be his greatest challenge to date. Falling in love with the feisty nineteen-year-old was not part of his game plan. He has too many things holding him back to give her all of himself. She is an unnecessary distraction, but one he can’t seem to live without.  Priscilla ‘Priss’ Walker found herself lost and alone after the sudden death of her parents; left to raise her younger sister, Tilly. Devil’s Spawn MC, the motorcycle club her father belonged to before his untimely death, stepped in to lessen the load. Sending prospects led by the sinfully sexy Tank to help her cope with the upkeep of her family home, Priss finds herself drawn to Tank. Their friendship develops regardless of her growing attraction to him.  Both Tank and Priss are in desperate need of a saviour, but for completely different reasons.  Needing to be cherished, loved, and safe is all that matters to Priss anymore. She believes she found that in Tank, until it all goes horribly wrong. Now she has not only lost her best friend, Priss has to come to terms with the fact that the man she has spent the last six years madly in love with, is not who he claimed to be. Tank hasn’t only kept secrets from her; he has been leading a double life.  Tank needs a saviour to fight back the demons in his head. Someone soft and sweet that will see him through his darkest times, and guide him back to the light when all seems lost. Priss was all that and more to him. Faced with the option of losing her permanently, Tank needs to make a tough decision that will put more than just himself at risk.  Can years of deception be undone by finally admitting the truth to the woman he loves, or will it drive an even bigger wedge between them? Will Devil’s Spawn MC forgive their brother his sins, or will they hunt him like their enemy?  When all is lost will there be anyone left to save him…",
  "genres": [
    "Romance",
    "Contemporary",
    "Friends To Lovers"
  ],
  "author": "Natasha Thomas",
  "average_rating": "3.99",
  "url": "https://www.goodreads.com/book/show/25225332-saviour"
}