{
  "title": "Night After Night",
  "description": "Lauren Nichols’ life will never be the same again.  Twenty-two year old Lauren Nichols is celebrating her college graduation with a two month long cross-country roadtrip. But things take a wrong turn when she finds herself in the back of a van, hooded and headed to God knows where in the middle of the Nevada desert.   To them, she’s nothing but another piece of meat.   When the hood is pulled off and she realizes she’s on an auction block, Lauren knows that things won't ever be the same. Sold like cattle at the fair, Lauren finds herself the property of Blake Bell, the President of the Night Riders MC.   There are no gods in the desert, only devils. And they will have their due.  Blake is everything that Lauren is afraid of: a man who either gets his way or makes one, a man with blood on his hands—a man whose hard tatted body is matched only by the ruthless he shows his enemies.  … and Lauren can’t get enough of him.  EXCERPT  Lauren could do little more than nod, and he did not demand the words. Good thing; she lacked the strength to push them out. Blake turned her face to his, and Lauren blinked as she strained to focus on his face  “How… how did you know?” she finally managed.  “Know what?” he asked.  “That… that this was just what I needed?”  He sighed heavily and pressed one finger to her mouth. Lauren was too weak to suckle his skin, but Blake parted her lips and granted her the taste of his flesh. “Saw it in your eyes,” he said. “No other way I would have laid out that much cash for you.”  Those words alone should have been the shot of adrenaline to bring her to her feet and start her running. But she was weary from the events of this strange day, and his embrace was strong and sure.  “Happy with the purchase?” she murmured.  “Absolutely,” Blake said.  Curling closer to her, he grabbed her face and peered into her eyes. “And there’s no way that I’m ever letting you go.”",
  "genres": [],
  "author": "Kathryn Thomas",
  "average_rating": "3.00",
  "url": "https://www.goodreads.com/book/show/25224290-night-after-night"
}