{
  "title": "Self-Publishing In the Eye of the Storm",
  "description": "The Author’s RevengeA MUST BUY for all self-published authors, writers, scribblers, bloggers, song-writers and spin-doctorsThe moment you click ‘Save and Publish’ you’re no longer on your own. You are now connected to a huge network of hundreds of thousands of fellow writers, and that feels both scary and exciting. By definition writing is a solitary profession. Writers need peace and quiet to gather their thoughts, to research, to dig deep into their subconscious for ideas. Marketers on the other hand need people, and the majority of authors are pretty poor at marketing and have absolutely no interest in it So I’ve put this book together with the assistance of a number of fellow authors who’ve all contributed a piece or two. My objectives with this book are a) to demonstrate to those just about to publish their first book the amount of work they should expect to put in afterwards, b) to perhaps offer direction, to advise on what works and what doesn’t, and, I guess c) to establish for the reader just how hard authors have to graft to promote their work, which is why I’ve included pieces from various authors, who all deserve my recognition and gratitude for demonstrating their often contradictory points of view. What worked for some, bombed when fellow authors tried the same tack, so it’s crucial that I’m true to myself and present the Indie industry in a genuinely transparent form.Thanks to these fellow authors - who’ve contributed a full 28% between them - the reader will find a variety of opposing viewpoints, conflicting assessments and impressions of the industry, and differing outlooks and perspectives. The reader will also discover that a number of authors share identical points of experiences and viewpoints. Special thanks to all contributors, but especially Harpie for baring her soul in sharing excerpts from her wacky, psycho, screwball, demented diaries with us. You’ll be hearing a lot more from Harpie in the future. WARNING: Writers can often be a precious breed of born-again goody-goodies. Me? I never ask anyone to like him. I never pretend to be anything that I’m not. I’m a handful and I know it. I’m strong-willed, a bit outspoken and I write exactly what I’m thinking. If strong language offends or you have an aversion to self-deprecating, piss-taking humour then please DO NOT buy this book, because I use these methods of bringing to light situations that just don't stack up. I truly believe that serious issues can be approached with humour, but I understand not everyone feels the same.So what, or specifically who, is the Storm that the title refers to? I’ll tell you. The Storm refers to a group of people who have no issue whatsoever with an artist hiring out a gallery and displaying his paintings. They don’t mind if a chef opens a new restaurant by inviting local residents to an opening night special, or a beautician promotes her services with the use of posters and referral specials for nails, waxing or sun beds. They don’t even mind a scuba diving club offering come-and-try-it sessions. And they certainly don’t object to a local swing band or orchestra advertising an upcoming concert. They don’t even mind their friends trying out a recently acquired capacity for wine-making on them.BUT, if a hard-working author does similar, if he/she promotes the book they’ve slaved over for the last year, this relentless and insidious enemy of all honest scribblers will have that poor author in their crosshairs in a New York heartbeat. If you’re the Storm, you’ll recognise yourself here.",
  "genres": [
    "Writing",
    "Nonfiction"
  ],
  "author": "Karl Wiggins",
  "average_rating": "4.62",
  "url": "https://www.goodreads.com/book/show/25236500-self-publishing-in-the-eye-of-the-storm"
}