{
  "title": "The Double-Cross System: The Incredible True Story of How Nazi Spies Were Turned into Double Agents",
  "description": "Filled with highly sensitive information about espionage, this secret report was never intended to go beyond a very select audience within the government and security services. The man who wrote it in 1945 was J. C. Masterman, MI5 recruit and leader of the shadowy XX Committee. He was the mastermind behind one of the war’s most remarkable achievements: finding, turning and then running almost every Nazi agent to penetrate the British Isles.No man knew more about the dangers of double-dealing and counter-espionage, and in writing his report, Masterman was keen to give the most complete account possible (albeit braced with a dry wit). The exploits of the intelligence service make hair-raising reading: some German agents made attempts to escape, ­overpowering their guards; others had to be trusted to meet their German paymasters alone. On a daily or weekly basis, the committee had to decide what information to leak to the enemy – should they seek to mislead, or divulge truthful intelligence in order to build conviction for a future move? Occasional failures (‘Tricycle’ picked up information that pointed to Pearl Harbour, but a lack of Anglo-American co-operation at the time meant it was not acted upon), were counteracted by the enormous success of ‘Operation Fortitude’, a significant campaign of misinformation to disguise the true location of the D-day landings.Redolent with a sense of immediacy and absolute authenticity, it is impossible to get closer to the desperate world of war-time espionage than this first-hand account written by a key player of the game.",
  "genres": [
    "History",
    "Espionage",
    "Nonfiction",
    "War",
    "World War II",
    "Military History",
    "Military Fiction"
  ],
  "author": "J.C. Masterman",
  "average_rating": "3.96",
  "url": "https://www.goodreads.com/book/show/252324.The_Double_Cross_System"
}