{
  "title": "Tuck Everlasting",
  "description": "Doomed to - or blessed with - eternal life after drinking from a magic spring, the Tuck family wanders about trying to live as inconspicuously and comfortably as they can. When ten year old Winnie Foster stumbles on their secret, the Tucks kidnap her and explain why living forever at one age is less than a blessing that it might seem. 'Intense and powerful, exciting and poignant, Tuck Everlasting will last forever - in the reader's imagination.' Amazon.com 'Someone ought to start spreading the word that Natalie Babbitt is not only a children's writer the style is so fine and subtle that grownups too will take real pleasure. 'Tuck Everlasting' is one of the best books ever written - for any age.' Anne Tyler, New York Times Featured in Elle Hot 100 \"This refreshing and original story throws up all sorts of moral dilemmas, not least the question of whether one would like to live forever. Children in Year 4 and above will find much to ponder here.\" Times Educational Supplement \"Babbitt's economy of style is such that she can use a single gesture or detail to convey great swathes of meaning She understands perfectly the sense of powerlessness felt by children and her message is whether your name is Harry Potter, Frodo Baggins or Winnie Foster, young people with courage and a sense of rightness can 'make a difference'. \" Herald (Glasgow) 'A welcome reissue of a book previously published in 1977. Long regarded as an American masterpiece, Natalie Babbitt's novel deals with a weighty subject - everlasting life, no less - with a lightness of touch and a simplicity that never descends to the pedantic or the condescending. Sounds fanciful, but is told with all the cool, sharp, clear-eyed 'realism' that represents the best of American writing. And don't be influenced in any way by the fact that a Disney version is in production - just read it. It's breathtaking.' Chris Stephenson, Carousel 'This novel is both lyrical and provocative and a timeless",
  "genres": [
    "Fantasy",
    "Classics",
    "Young Adult",
    "Fiction",
    "Childrens",
    "Middle Grade",
    "School"
  ],
  "author": "Natalie Babbit",
  "average_rating": "3.90",
  "url": "https://www.goodreads.com/book/show/25231.Tuck_Everlasting"
}