{
  "title": "Tell It to the Trees",
  "description": "One freezing winter morning a dead body is found in the backyard of the Dharma family’s house. It’s the body of Anu Krishnan. For Anu, a writer seeking a secluded retreat from the city, the Dharmas’ “back-house” in the sleepy mountain town of Merrit’s Point was the ideal spot to take a year off and begin writing. She had found the Dharmas’ rental through a happy coincidence. A friend from university who had kept tabs on everyone in their graduating year – including the quiet and reserved Vikram Dharma and his first wife, Helen – sent her the listing. Anu vaguely remembered Vikram but had a strong recollection of Helen, a beautiful, vivacious, social and charming woman. But now Vikram had a new wife, a marriage hastily arranged in India after Helen was killed in a car accident. Suman Dharma, a stark contrast to Helen, is quiet and timid. She arrived from the bustling warmth of India full of the promise of her new life – a new home, a new country and a daughter from Vikram’s first marriage. But her husband’s suspicious, controlling and angry tirades become almost a daily ritual, resigning Suman to a desolate future entangled in a marriage of fear and despair. Suman is isolated both by the landscape and the culture, and her fortunes begin to change only when Anu arrives. A friendship begins to form between the two women as Anu becomes a frequent visitor to the house. While the children, Varsha and Hemant, are at school, Anu, Vikram’s mother, Akka, and Suman spend time sharing tea and stories. But Anu’s arrival will change the balance of the Dharma household. Young Varsha, deeply affected by her mother’s death and desperate to keep her new family together, becomes increasingly suspicious of Anu’s relationship with her stepmother. Varsha’s singular attention to keeping her family together, and the secrets that emerge as Anu and Suman become friends, create cracks in the Dharma family that can only spell certain disaster.",
  "genres": [
    "Fiction",
    "Canada",
    "Mystery",
    "India",
    "Book Club",
    "Contemporary",
    "Family"
  ],
  "author": "Anita Rau Badami",
  "average_rating": "3.47",
  "url": "https://www.goodreads.com/book/show/11539637-tell-it-to-the-trees"
}