{
  "title": "Brailling for Wile",
  "description": "\"A measured but ultimately uplifting meditation on family and hope in dark times.\" -Kirkus ReviewsBRAILLING: Feeling the surface of a tile while your hand is in the bag in order to draw a blank or other specific letter. This is strictly forbidden. -from SCRABBLE’s Official GlossaryBrailling was something twelve-year-old Mattias Long learned to master during the games of Scrabble he used to play with his mother while they waited for his father, Wile, to close up the family restaurant. But now, one year after his father’s suicide, it’s Mattias who feels cheated. He hates his father. He hates him for leaving Mattias and his sister, Georgie, alone. He hates him for turning his mother into a young widow who hasn’t left the house in months. And he hates his father for leaving behind his stupid tree. Four of them are planted outside the restaurant, one for each family member, his father’s now casting the biggest shadow. That is until Mattias’s mother, no longer able to stand the sight of the tree, hires a local landscaper to remove it in the middle of the night. This seemingly unremarkable act soon sets in motion of series of events in the small Colorado ski town that leaves more than just young Mattias groping in the dark for answers.Brailling For Wile is a unique novel told from multiple points of view about loss and the lengths some will go to heal the human heart. Ultimately, it is a story about lives being uprooted and what it takes to go on living even when everything in the world might be telling us it isn’t possible to.*Warning: This is NOT a book about Scrabble. Death and suicide are two of the predominant themes. Suitable for adults and mature teens. Contains some profanity, violence, and sex.*",
  "genres": [
    "Fiction",
    "Literary Fiction",
    "Contemporary",
    "Family",
    "Amazon",
    "Drama",
    "Young Adult"
  ],
  "author": "Jamie Zerndt",
  "average_rating": "3.47",
  "url": "https://www.goodreads.com/book/show/25236849-brailling-for-wile"
}