{
  "title": "The Good-Bye Door: The Incredible True Story of America's First Female Serial Killer to Die in the Chair",
  "description": "The true story of the first female serial killer to die in the electric chairNicknamed \"the Blonde Borgia,\" Anna Marie Hahn was a cold-blooded serial killer who preyed on the elderly in Cincinnati's Over-the-Rhine district in the 1930s. When the State of Ohio strapped its first woman into the electric chair, Hahn gained a place in the annals of crime as the nation's first female serial killer to be executed in the chair.Told here for the first time in riveting detail is Anna Marie's gripping story, an almost unbelievable tale of multiple murders, deceit, and greed.Born in Bavaria in 1906, Anna Marie brought shame to her pious family when, as a teenager, she gave birth to an illegitimate son, Oscar. She was shipped off to America in 1929 where she initially lived with elderly relatives in Cincinnati. A year later she married Philip Hahn, a Western Union telegrapher, with whom she bought a new house and opened a delicatessen/bakery.Pressed economically by the Great Depression, the ever-resourceful Anna Marie found other ways to get the money to support her passionate pasttime--betting on horses. She tried burning down the house, then the deli, for the insurance; and she tried killing her husband, also for the insurance. Then she took to befriending the neighborhood elderly, latching on to their life savings before feeding them arsenic with deadly results.For weeks her Cincinnati trial for \"the greatest mass murder in the history of the country\" was a front-page sensation across the nation. A thousand or more curiosity seekers came daily to the courthouse to try to get just a glimpse of her. Nearly 100 witnesses gave damning testimony against her, and the jury's guilty verdict put her on the path to the electric chair. Finally, after a year, all appeals were exhausted, and Anna Marie, age 32, was executed on December 7, 1938, at the state penitentiary in Columbus.True crime buffs, historians, legal professionals, and others seeking an extraordinary story will find The Goodbye Door a compelling addition to true crime literature.",
  "genres": [
    "True Crime",
    "Nonfiction",
    "Crime",
    "History",
    "Biography",
    "Historical",
    "American History"
  ],
  "author": "Diana Britt Franklin",
  "average_rating": "3.58",
  "url": "https://www.goodreads.com/book/show/252329.The_Good_Bye_Door"
}