{
  "title": "The Admissions",
  "description": "The Admissions brilliantly captures the frazzled pressure cooker of modern life as a seemingly perfect family comes undone by a few desperate measures, long-buried secret —and college applications!The Hawthorne family has it all. Great jobs, a beautiful house in one of the most affluent areas of Northern California, and three charming kids whose sunny futures are all but assured. And then comes their eldest daughter’s senior year of high school . . .     Firstborn Angela Hawthorne is a straight-A student and star athlete, with extracurricular activities coming out of her ears and a college application that’s not going to write itself. She’s set her sights on Harvard, her father’s alma mater, and like a dog with a chew toy, Angela won’t let up until she’s basking in crimson-colored glory. Except her class rank as valedictorian is under attack, she’s suddenly losing her edge at cross-country, and she can’t help but daydream about a cute baseball player. Of course Angela knows the time put into her schoolgirl crush would be better spent coming up with a subject for her English term paper—which, along with her college essay, has a rapidly approaching deadline.     Angela’s mother, Nora, is similarly stretched to the limit, juggling parent-teacher meetings, carpool, and a real estate career where she caters to the mega-rich and super-picky buyers and sellers of the Bay Area. The youngest daughter, second-grader Maya, still can’t read; the middle child, Cecily, is no longer the happy-go-lucky kid she once was; and their dad, Gabe, seems oblivious to the mounting pressures at home because a devastating secret of his own might be exposed. A few ill-advised moves put the Hawthorne family on a collision course that’s equal parts achingly real and delightfully screwball—and they learn that whatever it cost to get their lucky lives it may cost far more to keep them.     Sharp, topical, and wildly entertaining, The Admissions shows that if you pull at a loose thread, even the sturdiest lives start to unravel at the seams of high achievement.",
  "genres": [
    "Fiction",
    "Audiobook",
    "Chick Lit",
    "Contemporary",
    "Adult",
    "Family",
    "Book Club"
  ],
  "author": "Meg Mitchell Moore",
  "average_rating": "3.68",
  "url": "https://www.goodreads.com/book/show/25241503-the-admissions"
}