{
  "title": "Darkness",
  "description": "THERE'S A STORM BREWING...BOOM. That's the sound that changes everything for Dr. Gina Sullivan, a renowned ornithologist on a group research grant trip on the remote island of Attu, Alaska. When an everyday outing turns sinister at the onset of one of Attu's infamous storms, Gina expects thunder and lightning - but what she doesn't see coming is the small jet plane that drops out of the sky and into the water mere feet from her boat. Even more unprecedented: there's a sole survivor from the crash, and he needs Gina's help. But it turns out that rescuing the stranger and getting them both out of the oncoming storm is just the beginning. Because the more Gina learns about James \"Cal\" Callahan, he of brooding eyes and muscled frame, the more she fears - for herself, and for him.Cal has made a career of trading on government secrets and emerging unscathed - until a routine pickup goes horribly wrong and lands him in ice-cold water. Literally. He knows the plane crash was no accident and that there could very well be an enemy force currently combing the Alaskan island, ensuring there were no survivors. Now if only the arrestingly beautiful bird-watcher with the clear-blue gaze would stop watching him, well, like a hawk. Cal convinces Gina to return to base camp and help him covertly get off the island. But when Gina makes it safely back to camp and finds her entire team murdered, all bets are off, and as darkness envelops the island, she must decide: trust a man she barely knows, or go it alone and risk running straight into the arms of a killer?New York Times and USA Today bestselling author and \"master of romantic suspense\" (Booklist) Karen Robards does it again with this atmospheric, tightly wound thriller that will keep you spellbound until the very last page.",
  "genres": [
    "Romantic Suspense",
    "Romance",
    "Suspense",
    "Thriller",
    "Fiction",
    "Mystery",
    "Contemporary Romance"
  ],
  "author": "Karen Robards",
  "average_rating": "3.79",
  "url": "https://www.goodreads.com/book/show/25246755-darkness"
}