{
  "title": "Fervent: A Woman's Battle Plan to Serious, Specific and Strategic Prayer",
  "description": "You have an enemy . . . and he’s dead set on destroying all you hold dear and keeping you from experiencing abundant life in Christ. What’s more, his approach to disrupting your life and discrediting your faith isn’t general or generic, not a one-size-fits-all. It’s specific. Personalized. Targeted.   So this book is your chance to strike back. With prayer. With a weapon that really works. Each chapter will guide you in crafting prayer strategies that hit the enemy where it hurts, letting him know you’re on to him and that you won’t back down. Because with every new strategy you build, you’re turning the fiercest battles of life into precise strikes against him and his handiwork, each one infused with the power of God’s Spirit.  New York Times bestselling author Priscilla Shirer, widely known for her international speaking, teaching, and writing ministries, brings her new role from the 2015 film War Room into the real lives of today’s women, addressing the topics that affect them most: renewing their \npassion\n, refocusing their \nidentity\n, negotiating \nfamily\n strife, dealing with relentless \nregrets\n, navigating impossible \nschedules\n, succeeding against \ntemptation\n, weathering their worst \nfears\n, uprooting \nbitterness\n, and more. Each chapter exposes the enemy’s cruel, crafty intentions in all kinds of these areas, then equips and encourages you to write out your own personalized prayer strategies on tear-out sheets you can post and pray over yourself and your loved ones on a regular basis.  Fervent is a hands-on, knees-down, don’t-give-up action guide to practical, purposeful praying.",
  "genres": [
    "Christian",
    "Nonfiction",
    "Faith",
    "Prayer",
    "Christian Living",
    "Religion",
    "Christianity"
  ],
  "author": "Priscilla Shirer",
  "average_rating": "4.46",
  "url": "https://www.goodreads.com/book/show/25245760-fervent"
}