{
  "title": "Mine",
  "description": "USA TODAY BESTSELLER • Dmitri and Presley—the scorching-hot couple who started it all in Claimed—return to save Club Sin in the exhilarating new short novel from Stacey Kennedy.\n Dmitri Pratt is living out his dream. Not only does he own the ultimate playground, he’s found a special connection with his deliciously sexy sub, Presley Flynn, the woman who complements him in ways that go far beyond the bedroom. But when an anonymous blackmailer threatens to expose the elite, high-profile members of Club Sin in a notorious tabloid, Dmitri’s perfect world spirals out of control. Before she met Dmitri, Presley never imagined she would find a Master who could deliver on all her hottest fantasies. Dmitri’s love and his sensual artistry surprise her every day, until he suddenly turns distant and cold. For the first time, Presley wonders where Dmitri’s heart truly with her, or with Club Sin. As the life they’ve built together begins to crumble, Presley can only trust that Dmitri has what it takes—to defend what’s his, and win back the woman he cannot live without. Mine is intended for mature audiences.Praise for Mine “I was so excited to revisit Dmitri and Presley, and Stacey Kennedy did not disappoint. Wildly hot, romantic, and emotional, Mine is another winner!”—New York Times bestselling author J. Kenner“Poignant, suspenseful, smoking hot and sexy, Mine caps off the Club Sin series like a cherry on top of the most decadent sundae.”—Cassie Ryan, author of My Obsession“Amazing . . . an emotional read that will break your heart and put it back together again.”—Once Upon an Alpha “The perfect end to the Club Sin series! Mine takes readers back to the to Dmitri and Presley. As sad as I was to see the series end, it seemed that this was the perfect way to go.”—The Book Cellar “An exceptional finish to a fabulous series. . . . Tasteful with real and raw emotions. It’s only right that the couple that started this memorable series, Dimitri and Presley, be the one to finish it.”—Coffee Books Life “This was such a great story. I was definitely invested in their world and relationship. I love the strength and commitment of Dmitri and Presley’s relationship and how dominant Dmitri truly is.”—About That Story Praise for the Club Sin series “Claimed sucked me in!”—J. Kenner “Bared is a seductively haunting tale of control and surrender that will tantalize existing fans of the series while enticing new readers into the passionate world of Club Sin.”—Eliza Gayle “Desired is sexy, sensual, and totally seductive. Stacey Kennedy sure knows how to make a girl swoon.”—Tracy Wolff “Freed is fabulous! Stacey Kennedy’s a master at creating steamy and heartwarming romance, inextricably bound with compelling emotion and unforgettable characters!”—Virna DePaul “Tamed is sexy, sinful, and addictive.",
  "genres": [
    "BDSM",
    "Romance",
    "Erotica",
    "Contemporary",
    "Erotic Romance",
    "Contemporary Romance",
    "Novella"
  ],
  "author": "Stacey Kennedy",
  "average_rating": "4.01",
  "url": "https://www.goodreads.com/book/show/25241370-mine"
}