{
  "title": "Whales, Dolphins, and Porpoises: A Natural History and Species Guide",
  "description": "The eighty-nine cetacean species that swim our seas and rivers are as diverse as they are intelligent and elusive, from the hundred-foot-long, two-hundred-ton blue whale to the lesser-known tucuxi, ginkgo-toothed beaked whale, and diminutive, critically endangered vaquita. The huge distances these highly migratory creatures cover and the depths they dive mean we catch only the merest glimpses of their lives as they break the surface of the water. But thanks to the marriage of science and technology, we are now beginning to understand their anatomy, complex social structures, extraordinary communication abilities, and behavioral patterns. In this beautifully illustrated guide, renowned marine mammalogist Annalisa Berta draws on the contributions of a pod of fellow whale biologists to present the most comprehensive, authoritative overview ever published of these remarkable aquatic mammals.Opening with an accessible rundown of cetacean biology—including the most recent science on feeding, mating, and communication— Whales, Dolphins, and Porpoises then presents species-specific natural history on a range of topics, from anatomy and diet to distribution and conservation status. Each entry also includes original drawings of the species and its key identifiers, such as fin shape and color, tooth shape, and characteristic markings as they would appear both above and below water—a feature unique to this book.Figures of myth and—as the debate over hunting rages on—figures of conflict since long before the days of Moby-Dick , whales, dolphins, and porpoises are also ecologically important and, in many cases, threatened. Written for general enthusiasts, emergent cetacean fans, and biologists alike, this stunning, urgently needed book will serve as the definitive guide for years to come.",
  "genres": [
    "Science",
    "Nonfiction",
    "Animals",
    "Biology"
  ],
  "author": "Annalisa Berta",
  "average_rating": "4.49",
  "url": "https://www.goodreads.com/book/show/25245985-whales-dolphins-and-porpoises"
}