{
  "title": "Slide Spin: Presentation skills for career success",
  "description": "In this information age and connected world, presentation skills play a vital role in career/business success. A great presentation could make or break a product, an idea…a career! Despite being widely accepted, we see lot of skills gaps in this area even today. Over 90% of professionals feel limited by the tools, thoughts and techniques to express their ideas. 'Thought constipation' can play havoc and limit various opportunities. SLIDE SPIN helps you unfold and unlock your full potential by explaining why it is vital to be able to present your ideas as best as possible, and more importantly, how to leverage your presentational skills like the world’s most successful leaders and entrepreneurs. Slide Spin approaches the topic in an incredibly easy and relatable you don’t need to be a design guru or a technology expert in order to understand the insights featured within this book! As a global e-book award nominee, this publication is quickly gaining momentum and consistently high ratings from readers who are now on their way to become fully empowered Slide Spinners! What is Covered in the book? • Various myths about creating persuasive presentations and how they are demystified. • A practical , ready use presentation framework called PRISM to develop powerful presentation in a structured way. • Universal communication filter called SIMPLE that greatly improves clarity in our communication. • Various practical and useful tips during the presentation development life cycle. • List of useful online resources to enhance the quality of presentation and reduce time spent on development • Various tips and real world examples to help you You think PowerPoint, They think Pressure Point. You start a slide show and it ends up as a horror show. With Slide Spin book you can change all of this. Visit for bonus material and more information.",
  "genres": [
    "Business",
    "Communication",
    "Self Help"
  ],
  "author": "Subbarao Mukkavilli",
  "average_rating": "4.73",
  "url": "https://www.goodreads.com/book/show/25241187-slide-spin"
}