{
  "title": "The Mind Spa Ignite Your Inner Life Coach",
  "description": "Do you believe in magic, in prayers being answered, in dreams coming true and in goals being achieved? The Mind Spa - Ignite Your Inner Life Coach promises to transform your life in unimaginable ways. It will help you cleanse your soul from toxins, slough away the unwanted layers and ultimately leave you rejuvenated. The Mind Spa is interlaced with holistic therapies, unreasonable requests, bitter pills, gentle healing and self coaching invitations that will motivate you into taking immediate action to achieve success in areas of love, health and relationships. The Mind Spa Journal that comes along with this edition will encourage you to explore the wonders of writing, expressing gratitude and engaging in little acts of kindness. This is your opportunity to ignite the life coach within. If not now, when?Discover your biggest FOE to successEscape the big trap of procrastinationAwaken the God inside youAbout the Author:Malti Bhojwani, 44 is a Professional Certified Coach (PCC with the ICF) International Coach Federation, trained in ontological coaching, NLP Neuro Linguistic Programming and a yoga teacher (Yoga alliance America). She has been in the personal development industry for over 14 years and brings her experience to individuals, teams in corporations and entrepreneurs all over the world. Her workshops based on personal power, body communication, self discovery and leadership have motivated people to create new and lasting changes in their lives.She has facilitated workshops and coached teams for International clients including Microsoft, Thought works and The British Council. She has spoken to members of YPO, EO, Rotarians and BNI among others. She is a regular contributor and expert consultant for the Times of India and several International publications. She is a Singaporean, has lived in Jakarta, Indonesia and spent most of her adult life in Sydney, Australia where her daughter Drishti, also an author, resides. Malti currently lives in Pune, India.",
  "genres": [],
  "author": "Malti Bhojwani",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/25244197-the-mind-spa-ignite-your-inner-life-coach"
}