{
  "title": "Objective Troy: A Terrorist, a President, and the Rise of the Drone",
  "description": "Objective Troy tells the gripping and unsettling story of Anwar al-Awlaki, the once-celebrated American imam who called for moderation after 9/11, a man who ultimately directed his outsized talents to the mass murder of his fellow citizens. It follows Barack Obama’s campaign against the excesses of the Bush counterterrorism programs and his eventual embrace of the targeted killing of suspected militants. And it recounts how the president directed the mammoth machinery of spy agencies to hunt Awlaki down in a frantic, multi-million-dollar pursuit that would end with the death of Awlaki by a bizarre, robotic technology that is changing warfare—the drone.       Scott Shane, who has covered terrorism for The New York Times over the last decade, weaves the clash between president and terrorist into both a riveting narrative and a deeply human account of the defining conflict of our era. Awlaki, who directed a plot that almost derailed Obama’s presidency, and then taunted him from his desert hideouts, will go down in history as the first United States citizen deliberately hunted and assassinated by his own government without trial. But his eloquent calls to jihad, amplified by YouTube, continue to lure young Westerners into terrorism—resulting in tragedies from the Boston marathon bombing to the murder of cartoonists at a Paris weekly. Awlaki’s life and death show how profoundly America has been changed by the threat of terrorism and by our own fears.       Illuminating and provocative, and based on years of in depth reporting, Objective Troy is a brilliant reckoning with the moral challenge of terrorism and a masterful chronicle of our times.",
  "genres": [
    "History",
    "Nonfiction",
    "Politics",
    "War",
    "Military Fiction",
    "Terrorism",
    "American History"
  ],
  "author": "Scott  Shane",
  "average_rating": "4.07",
  "url": "https://www.goodreads.com/book/show/25241648-objective-troy"
}