{
  "title": "Pain Free: A Revolutionary Method for Stopping Chronic Pain",
  "description": "Starting today, you don't have to live in pain.That is the revolutionary message of this breakthrough system for eliminating chronic pain without drugs, surgery, or expensive physical therapy. Developed by Pete Egoscue, a nationally renowned physiologist and sports injury consultant to some of today's top athletes, the Egoscue Method has an astounding 95 percent success rate. The key is a series of gentle exercises and carefully constructed stretches called E-cises. Inside you'll find detailed photographs and step-by-step instructions for dozens of e-cizes specifically designed to provide quick and lasting relief of: Lower back pain, hip problems, sciatica, and bad knees Carpal tunnel syndrome and even some forms of arthritis Migraines and other headaches, stiff neck, fatigue, sinus problems, vertigo, and TMJ Shin splints, varicose veins, sprained or weak ankles, and many foot ailments Bursitis, tendinitis, and rotator cuff problems Plus special preventive programs for maintaining health through the entire body.With this book in hand, you're on your way to regaining the greatest gift of all: a pain-free body!the help of Pete Egoscue's revolutionary program of quick stretches and strength-building exercises, you can cure chronic pain, and do it naturally. Pete Egoscue has shown thousands of individuals, corporations, schools, and championship sports teams how to eliminate pain without investing in expensive ergonomic devices or resorting to surgery or drug therapies.  His groundbreaking book, with nearly 50,000 hardcover copies sold, shows readers how to:Relieve lower back painImprove hip problems, sciatica, and bad kneesRelieve migraines and other headaches, stiff neck, fatigue, sinus problems, vertigo, and TMJRelieve painful problems, like carpal tunnel syndrome, often misdiagnosed as arthritisPrevent injuries and maintain health through stretching programs for the entire bodyFilled with easy instructions, photos, and line illustrations throughout, this book will provide quick, effective pain relief. -->",
  "genres": [
    "Health",
    "Reference",
    "Science",
    "Self Help",
    "Nonfiction",
    "Bodies",
    "Personal Development"
  ],
  "author": "Pete Egoscue",
  "average_rating": "4.17",
  "url": "https://www.goodreads.com/book/show/252465.Pain_Free"
}