{
  "title": "The American Slave Coast: A History of the Slave-Breeding Industry",
  "description": "American Book Award Winner 2016The American Slave Coast offers a provocative vision of US history from earliest colonial times through emancipation that presents even the most familiar events and figures in a revealing new light.Authors Ned and Constance Sublette tell the brutal story of how the slavery industry made the reproductive labor of the people it referred to as “breeding women” essential to the young country’s expansion. Captive African Americans in the slave nation were not only laborers, but merchandise and collateral all at once. In a land without silver, gold, or trustworthy paper money, their children and their children’s children into perpetuity were used as human savings accounts that functioned as the basis of money and credit in a market premised on the continual expansion of slavery. Slaveowners collected interest in the form of newborns, who had a cash value at birth and whose mothers had no legal right to say no to forced mating.  This gripping narrative is driven by the power struggle between the elites of Virginia, the slave-raising “mother of slavery,” and South Carolina, the massive importer of Africans—a conflict that was central to American politics from the making of the Constitution through the debacle of the Confederacy.Virginia slaveowners won a major victory when Thomas Jefferson’s 1808 prohibition of the African slave trade protected the domestic slave markets for slave-breeding. The interstate slave trade exploded in Mississippi during the presidency of Andrew Jackson, drove the US expansion into Texas, and powered attempts to take over Cuba and other parts of Latin America, until a disaffected South Carolina spearheaded the drive to secession and war, forcing the Virginians to secede or lose their slave-breeding industry.Filled with surprising facts, fascinating incidents, and startling portraits of the people who made, endured, and resisted the slave-breeding industry, The American Slave Coast culminates in the revolutionary Emancipation Proclamation, which at last decommissioned the capitalized womb and armed the African Americans to fight for their freedom.",
  "genres": [
    "History",
    "Nonfiction",
    "Race",
    "American History",
    "African American",
    "Historical",
    "Africa"
  ],
  "author": "Ned Sublette",
  "average_rating": "4.47",
  "url": "https://www.goodreads.com/book/show/25246348-the-american-slave-coast"
}