{
  "title": "Alexia Eden",
  "description": "I was brought up with a picture-perfect family and the life to match. I believed all those happy-ever-after stories momma read to me and the Fairytales she would whisper before bedtime about my Prince Charming finding me one day. Momma found daddy so it was only inevitable I found my prince too, right? ***Tragedy strikes before Lexi's 16th birthday and the flawless life she once knew is shattered and tarnished. Everyone and everything changes, she decides the only way to survive is to keep all her emotions under lock and not let anyone in. She loses friends, the very ones that were by her side most of her life are now the ones bullying her and making her life hell. She's forced to relocate to a small secluded town, little does she know that the town is run by werewolves. Her first night in town she befriends a brown wolf in the woods. Seeking solace in the comfort of the wolf she tells him all her secrets knowing the animal cant betray her or pity her like humans do. One night at a bar she runs into a gorgeous guy named Jax, she’s under the impression he’s human but in fact he’s the soon to be Alpha of the towns pack. Jax immediately feels a connection to her and she feels the same way. A bond forms... What will happen when the brown wolf from the woods enters the picture …in his human form? Will she recognize him? What will happen to Lexi and Jax? Will Lexi’s trust in her friends remain after all the secrets are revealed? Will she accept the fact that her best friends are werewolves and there’s a secret world out there? Will Lexi reveal her secrets? Something she’s ashamed to admit and something that could put them in danger.While she hides her feelings for one of the wolves, she falls madly in love with the other, thinking that her mother was right after all - she’s found her prince charming, tragedy will strike once again. How will she mend her broken heart this time?***Please note***This book contains violence as well as alcohol and drug abuse. It is not for the faint hearted, don't expect to see werewolves running free and frolicking in meadows filled with daisies - want a romantic werewolf/human love story? Then look elsewhere because this is NOT the book for you. It's raw, gritty and exactly what you would expect from obsessive possessive Alpha's. Want a challenge? Read it.",
  "genres": [
    "Paranormal",
    "Werewolves",
    "Shapeshifters",
    "Fantasy",
    "Young Adult",
    "Paranormal Romance",
    "New Adult"
  ],
  "author": "Sophie Summers",
  "average_rating": "3.84",
  "url": "https://www.goodreads.com/book/show/25250702-alexia-eden"
}