{
  "title": "Manuel de Brito Camacho : um intelectual republicano no Parlamento",
  "description": "Manuel de Brito Camacho foi um dos protagonistas mais destacados e relevantes da década inicial da I República Portuguesa, liderando, até 1919, um dos três primeiros partidos do republicanismo constitucional – a União Republicana. O texto que agora se publica mostra o perfil de um intelectual civicamente interveniente e revela as diferentes facetas do político e do parlamentar – o sobrevivente de diversas conjunturas – que ao longo de quase duas décadas animou debates e abrilhantou, quase diariamente, sessões na Câmara dos Deputados.Uma das questões que mais preocupou Brito Camacho foi a do desenvolvimento nacional, que compreendia em três dimensões: moral, material e política. A entrada no Parlamento, o exercício de funções como deputado foram encarados, desde logo, como uma oportunidade para compreender e analisar detalhadamente os principais problemas que afetavam a sociedade portuguesa. Do ponto de vista do regime, Brito Camacho defendia uma república inspirada nas conceções defendidas por Léon Gambetta: um regime presidido por um chefe de Estado eleito e com um parlamento respeitado, em que burguesia e república se conciliassem sem alienar direitos, nem simpatias. A proclamação da República não lhe atenuou o ímpeto e muito menos serviu para diminuir o tom crítico das suas intervenções que, de resto, continuaram, quanto ao essencial, a não perder de vista um conjunto de princípios fundamentais, nomeadamente a necessidade do regime se apoiar em partidos políticos conscientes dos seus deveres e das suas responsabilidades, defendendo sem peias que a República não podia ser a Monarquia com outro nome. Brito Camacho foi um intelectual que viveu para além do seu tempo. O seu legado, memória e herança, permanecem inscritos na história de Portugal do século XX. Eterno perseguidor da modernidade, foi um defensor acérrimo da reforma da cultura e das mentalidades portuguesas e apologista da difusão do conhecimento e do saber científico, entendendo-o como base do progresso económico e social e sustentáculo de qualquer regime político. Foi essa modernidade e esse desejo de mudança que procurou até ao fim da vida, denunciando e interpretando criticamente as principais debilidades que condicionavam a sociedade portuguesa na transição do século XIX para o século XX e, em boa medida o seu atraso económico. Viveu muitos anos no Chiado, numa casa situada na rua da Assunção; alimentava-se do bulício das ruas, respirava a mundanidade cultural que enchia os cafés da Baixa e passava o final da tarde à conversa com os amigos na Farmácia Durão, propriedade de António Ferreira, que chegou a ser administrador de A Luta, discutia ideias e, algumas vezes, conspirava... Cem anos passados sobre a implantação do regime republicano, importa compreender, identificar, perceber, enquadrar e estudar estes «geradores» de pensamento moderno: médicos, engenheiros, políticos, intelectuais, cientistas e doutrinadores que procuravam um rumo novo, buscando um caminho que, para muitos, o ideário republicano soubera enunciar. Brito Camacho foi um desses desbravadores.",
  "genres": [],
  "author": "Maria Fernanda Rollo",
  "average_rating": "4.50",
  "url": "https://www.goodreads.com/book/show/25251257-manuel-de-brito-camacho"
}