{
  "title": "Mommy Wars: Stay-at-Home and Career Moms Face Off on Their Choices, Their Lives, Their Families",
  "description": "With motherhood comes one of the toughest decisions of a woman’s Stay at home or pursue a career? The dilemma not only divides mothers into hostile, defensive camps but pits individual mothers against themselves. Leslie Morgan Steiner has been there. As an executive at The Washington Post, a writer, and mother of three, she has lived and breathed every side of the “mommy wars.” Rather than just watch the battles rage, Steiner decided to do something about it. She commissioned twenty-six outspoken mothers to write about their lives, their families, and the choices that have worked for them. The result is a frank, surprising, and utterly refreshing look at American motherhood.Ranging in age from twenty-five to seventy-two and scattered across the country from New Hampshire to California, these mothers reflect the full spectrum of lifestyle choices. Women who have been home with the kids from day one, moms who shuttle from full-time office jobs to part-time at-home work, hard-driving executives who put in seventy-hour-plus they all get a turn. The one thing these women have in common, aside from having kids, is that they’re all terrific writers.Pulitzer Prize winner Jane Smiley vividly recounts how her generation stormed the American workplace–only to take refuge at home when the workplace drove them out. Lizzie McGuire creator Terri Minsky describes what it felt like to hear her kids scream “I hope you never come back!” when she flew to L.A. to launch the show that made her career. Susan Cheever, novelist, biographer, and Newsday columnist, reports on the furious battles between the stroller pushers and the briefcase bearers on the streets of Manhattan. Lois R. Shea traded the journalistic fast track for a house in the country where she could raise her daughter in peace. Ann Misiaszek Sarnoff, chief operating officer of the Women’s National Basketball Association, argues fiercely that you can combine ambition and motherhood–and have a blast in the process.Candid, engaging, by turns unflinchingly honest and painfully funny, the essays collected here offer an astonishingly intimate portrait of the state of motherhood today. Mommy Wars is a book by and for and about the real experts on motherhood and hard the women at home, in the office, on the job every day of their lives.Including these “Neither Here nor There” by Sandy Hingston“The Mother Load” by Terri Minsky“Sharks and Jets” by Page Evans“Baby Battle” by Susan Cheever“Guilty” by Dawn Drzal“The Donna Reed Syndrome” by Lonnae O’Neal Parker“Mother Superior” by Catherine Clifford“Good Enough” by Beth Brophy“Big House, Little House, Back House, Barn” by Lois R. Shea“What Goes Unsaid” by Sydney Trent“I Hate Everybody” by Leslie Lehr“Before; After” by Molly Jong-Fast“I Do Know How She Does It” by Ann Misiaszek Sarnoff“Red Boots and Cole Haans” by Monica Buckley Price“Working Mother, Not Guilty” by Sara Nelson“Feminism Meets the Free Market” by Jane Smiley“Happy” by Anne Marie Feld“I Never Dreamed I’d Have So Many Children” by Lila Leff“On Being a Radical Feminist Stay-at-Home Mom” by Inda Schaenen“Being There” by Reshma Memon Yaqub“Russian Dolls” by Veronica Chambers“Peace and Carrots” by Carolyn Hax“Unprotected” by Natalie Smith Parra“Julia” by Anna Fels“On Balance” by Jane Juska“My Baby’s Feet Are Size 13” by Iris Krasnow",
  "genres": [
    "Parenting",
    "Nonfiction",
    "Family",
    "Sociology",
    "Womens",
    "Feminism",
    "Essays"
  ],
  "author": "Leslie Morgan Steiner",
  "average_rating": "3.35",
  "url": "https://www.goodreads.com/book/show/252515.Mommy_Wars"
}