{
  "title": "Another Vagabond Lost To Love: Berlin Stories on Leaving & Arriving",
  "description": "\"Like a modern day beat poet, she might have been seated in between Patti Smith and Jack Kerouac. Charlotte is a rare soul in today's society, carefully balancing between wanting to defy the world, and wanting nothing more than to be a part of it.\"A young writer’s search for a place called home, what it means to be an artist, and finding peace with a restless heart.Signed paperbacks available at: http://www.CharlotteEriksson.com_______________6 months, 2 weeks, 4 days,and I still don’t know which month it was thenor what day it is now.I replace cafés with crowded bars and empty roads with broken bottlesand this town is healing me slowly but still not slow or fast enough because there’s no right way to do this.There is no right way to do this._______________\"It’s the beating of my heart. The way I lie awake, playing with shadows slowly climbing up my wall. The gentle moonlight slipping through my window and the sound of a lonely car somewhere far away, where I long to be, too, I think. It’s the way I thought my restless wandering was over, that I’d found whatever I thought I had found, or wanted, or needed, and I started to collect my belongings. Build a home. Safe behind the comfort of these four walls and a closed door. Because as much as I tried or pretended or imagined myself as a part of all the people out there,I was still the one locking the door every night.Turning off the phone and blowing out the candles so no one knew I was home. ’cause I was never really well around the expectations of my personalityand I wanted to keep to myself. and because I haven’t been very impressed lately. By people, or places.Or the way someone said he loved me and then slowly changed his mind.\"_______________The journals and poetry explore the dreamer’s fate of leaving and arriving, love and loss, and learning to go on on your own. It captures the city of Berlin, where I somehow ended up. The broken concrete, conversations with strangers, small moments of ache or clarity.",
  "genres": [
    "Poetry",
    "Fiction"
  ],
  "author": "Charlotte Eriksson",
  "average_rating": "4.26",
  "url": "https://www.goodreads.com/book/show/25248510-another-vagabond-lost-to-love"
}