{
  "title": "Grey Daze: A Lance Underphal Mystery",
  "description": "“An action-packed page turner based on real events, this murder mystery/thriller is layered with plot twists and alarming details, along with voices of the dead and visions of imminent peril. Grey Daze is sure to please already entrenched Underphal fans and draw new ones to the fold. Highly recommended for thriller/suspense fans.” – Chanticleer Review “A vigorous mystery with a vivid and engaging style that brings the action before the reader in full color. A fine choice for an adrenaline-fueled escape, with three-dimensional characters and bold, no-holds-barred writing.” – IndieReader Top Book Pick\"A well-written mystery that would appeal to those mature audiences who are looking for fast-paced stories from an experienced hand.\" – ForeWord Reviews \"A worthy blend of psychic visions and good old-fashioned detective work\" – Kirkus ReviewsA Supernatural Thriller – Something is wrong. As Lance Underphal pads softly across the cold flagstone, he hears her weeping. She is on her knees, hunched over in the middle of the room, her back to him, facing the dark fireplace. Something is very wrong. Lance wants to rush to her, but can’t. In a hoarse whisper, he says, “Callie?” She lets out a mournful wail from deep within as she turns to him, their infant son in her arms, blue and still. He reels from the blow. How can this be? They don’t have a son.At home in bed, Realtor Callie Harper finds she is not alone. At the cool touch of her estranged uncle’s hand, she shudders. She got the call a few hours ago. Uncle Harold is dead.Grey Daze, the third novel in the Lance Underphal Mystery series is dark, dangerous—not for the for the faint of heart.Looking for a new series of supernatural thrillers? Psychic novels of mystery and suspense? Perhaps a paranormal mystery? Or maybe those scary books for adults only? Regardless, the dark, disturbing novels by Indie Author, Michael Allan Scott, won’t disappoint.",
  "genres": [
    "Mystery",
    "Paranormal"
  ],
  "author": "Michael Allan Scott",
  "average_rating": "4.25",
  "url": "https://www.goodreads.com/book/show/25253328-grey-daze"
}