{
  "title": "Walk through my Door",
  "description": "Finally, an erotic & romantic story of real people, facing the challenges of real life, and searching for the one true love we all dream of finding...Lauren is a newly-single mother carrying the weight of a well-guarded secret while trying desperately to make sense of her new role and being on her own. Adam is a single father, with a powerful past, now struggling to find his place in the world. Together, they are the right people falling in love at the wrong time.Walk Through My Door is the sexually-charged story of one man who's willing to give anything for true love, except give up, and one woman fighting to make the right decision between the man who held her heart for so long and the man with whom she's now deeply fallen for.Adam and Lauren form an unimaginable bond which leads to a romantic, highly erotic, and heartfelt adventure through the struggles and challenges of life, with both hoping to find nothing more than their one true love at the other end of this beautiful journey.Immerse yourself in a reading experience like no other with Enhanced Playlist Experience!Keep your smart-phone (or similar device) at hand as you read. As you come across embedded QR codes, scan the code with your device and instantly hear the song which the author wants you to listen to at that precise moment in the book! EPE and this amazing story come together to give you a reading experience unlike any other!No billionaires, tattooed bad boys, or beautifully proportioned models....just real people!Anthony's goal with Walk Through My Door is to give you a story you can feel in the very depths of your soul. He tapped into those common traits, hopes, dreams, and insecurities found in all of us to create a pair of leading characters who are real. You'll see yourself in Lauren as you feel her happiness and her struggles. As for Adam, let's just say your new book-boyfriend is waiting to meet you!",
  "genres": [
    "Contemporary Romance",
    "Romance",
    "Erotica"
  ],
  "author": "Anthony  Bryan",
  "average_rating": "4.03",
  "url": "https://www.goodreads.com/book/show/25253526-walk-through-my-door"
}