{
  "title": "Tales from Arcadia",
  "description": "The first three books in the Tales From Arcadia series in one volume:Memories of a Forgotten Hero - Rutherford MacKay and his friend Duncan picked the wrong day to stop for a drink in the King’s Cross tavern. Before they can even finish their first ale, Kinnear soldiers arrest Duncan and take him away to be executed at midnight, even though he has committed no crime.Rutherford resolves to save Duncan, whatever the cost, but nobody in Potter’s Pass will help him. With time running out, his last hope arrives in the form of a mysterious stranger, who promises Rutherford that he can free his friend, but could the price of his help be too high?The Siege of Tormond Castle - For three months Tormond Castle has prevailed against Wilbraham Kinnear’s siege, but now food is scarce and there’s still no sign of reinforcements. Worse, Prince Vortigern doesn’t care about the plight of his embattled people and he dines and celebrates as if nothing is amiss.Commander Gideon Copeland must end the siege while he still has time to act, but he faces an impossible dilemma. He must choose between a battle of strength with Wilbraham outside the castle that will result in his death, and a battle of wills with Vortigern inside the castle that will result in his execution for treason.So, with the situation growing desperate, Gideon must make the toughest decision of his life.Trial by Fire - When Huntington Lamont investigates a fatal house fire, he finds an ancient symbol scrawled on a window. He suspects the fire was a deliberate act and that leads him to Tamlyn, a member of the mysterious Order.Tamlyn denies responsibility, but he provides the cryptic prediction that while trying to solve the crime Huntington will face a series of trials. These trials will be of earth, water, air, and fire, and the only way Huntington can succeed in his mission is to fail any of them.Huntington ignores the prediction, but when elements of Tamlyn’s prophecy come true, Huntington comes to understand the Order’s shocking purpose. As more fires are lit and more people die, Huntington faces a race against time to unmask the guilty before it’s too late for everyone.",
  "genres": [],
  "author": "Harlan Finchley",
  "average_rating": "1.00",
  "url": "https://www.goodreads.com/book/show/25254457-tales-from-arcadia"
}