{
  "title": "The Duke and The Domina : Warrick The Ruination of Grayson Danforth",
  "description": "Grayson Locke Danforth, in his wildest of dreams, would never have expected two things. The first was to be recalled from India by Queen Victoria where he worked for the quiet purposes of the crown. He must now become the Duke of Warrick after the tragic deaths of his father and brothers. However, tragedy is entirely in the eyes of the beholder and Grayson never wanted the title, or to return to what remains of his family. Grayson wanted to remain invisible, an outcast, a man in exile for the way his body and mind behaved and the secrets he needed to keep.The second thing he never would have expected was to be forced into marriage with a woman from the 21st century. Lulu is no mere woman, however, she's a switch who works as professional Dominatrix—at least, she did. When she wakes up in a strange house, a strange world, a strange body, she isn't quite sure what to think and is certain she's dreaming. She has less than a day to gain her bearings a make a decision that will dictate the rest of her life in this world—whether or not to marry this handsome stranger. As Lulu and Grayson attempt to begin a life together she discovers the true reason why this man is a stranger to his family. She can only hope she can convince Grayson to accept who she is, and who he was born to be, before he forces her out of his life in order to maintain his well-kept secrets. Trust doesn't come easily to either of them, but it's the only thing they have. Grayson will have to give in to his need to submit in order to get his wife to open up and allow him to posses her fully in return. It's a cautious dance between two people who have never known how to trust, or love.",
  "genres": [
    "Time Travel",
    "Romance",
    "Historical Romance",
    "Historical",
    "BDSM",
    "Erotica",
    "Erotic Romance"
  ],
  "author": "Jenn LeBlanc",
  "average_rating": "3.80",
  "url": "https://www.goodreads.com/book/show/25258717-the-duke-and-the-domina"
}