{
  "title": "The Serpent Sword",
  "description": "BRITAIN 633 A.D. Certain that his brother’s death is murder, young farmhand Beobrand embarks on a quest for revenge in war-torn Northumbria. When he witnesses barbaric acts at the hands of warriors he considers his friends, Beobrand questions his chosen path and vows to bring the men to justice. Relentless in pursuit of his enemies, Beobrand faces challenges that change him irrevocably. Just as a great sword is forged by beating together rods of iron, so his adversities transform him from a farm boy to a man who stands strong in the clamour and gore of the shieldwall. As he closes in on his kin’s slayer and the bodies begin to pile up, can Beobrand mete out the vengeance he craves without sacrificing his own honour … or even his soul? The Serpent Sword is the first novel of the Bernicia Chronicles. PRAISE FOR THE SERPENT SWORD \"The Serpent Sword is a stunning debut: fast, confident, adrenaline-pumped, this story of a young warrior's coming of age in the maelstrom of the Dark Ages has the flavour of early Giles Kristian or James Aitcheson: it's raw, rugged and rich in colour and texture.\" MANDA SCOTT \"...a gripping and credible tale of Dark Ages Britain...Historical fiction doesn't get much better than this.\" ANGUS DONALD \"Vivid and compelling, The Serpent Sword is historical fiction at its brutal best.\" PAUL FRASER COLLARD \"A storming debut novel fans of Bernard Cornwell should not miss!\" STEVEN A. MCKAY \"...a fast-paced tale of historical adventure beautifully written. The Serpent Sword is a story of revenge, passion, betrayal, honour, love and loss. Above all, it contains both a quest and a love story. Harffy’s characters are portrayed with depth and humanity. This novel is a thrilling read.” CAROL MCGRATH \"With powerful language and gripping action, Harffy tells a tale of courage, revenge and love...\" JUSTIN HILL",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Historical",
    "Medieval",
    "Fantasy",
    "Audiobook",
    "Anglo Saxon"
  ],
  "author": "Matthew Harffy",
  "average_rating": "4.15",
  "url": "https://www.goodreads.com/book/show/25263371-the-serpent-sword"
}