{
  "title": "NO STRESS TODAY WITH PSYCH-K®: How to transform stress into vitality, peace and a stress-free fulfilling life",
  "description": "Personal transformation with PSYCH-K®  ‘No stress today’...‘but what about tomorrow?’ Tomorrow is just like ‘today’… It is always today, always now in our automatic belief system (subconscious mind). The subconscious mind only understands now. That is why one single event, which turns our life ‘upside down’, can keep us in stress for years on end.  No Stress Today with PSYCH-K® tells you how this mechanism works and how we can transform the consequences of traumas and everyday situations in a simple way. The book is about achieving a personal transformation, and how to transform stress into vitality, peace and a stress-free fulfilling life. It is the result of years of research, explained in simple words. 77 people who all learned how to reprogram themselves and live a stress-free life contributed with their inspiring testimonials.  All the contributors write how stress affected their lives and how little was necessary to get it transformed. When we are in stress, we are not who we really are, because we do not have ‘our whole brain available’, and parts of ourselves are inaccessible. We can change this situation through PSYCH-K®, an age-old process, which is now becoming accessible to everyone. By applying PSYCH-K® our world is opening up. We realize that we have the choice to decide the way we feel, what we think and how we act. Peace with ourselves, with others around us and with our world is within easy reach for everyone.  Marina Riemslagh has been committed to guiding people for years. She worked as a nurse in psychiatry before she became a pastor and ethicist in hospitals. She started a program assisting women who had undergone an abortion. Afterwards she did qualitative research and obtained her PhD on a thesis titled ‘How is it that we do not behave in an appropriate way?’ Her own quest for wanting to deal with others properly led her to investigate and practice PSYCH-K®, a method to reprogram our own behavior and serve other people’s highest interest.  Marina Riemslagh is fascinated by the workings of the human mind. It is her mission to help people function to their highest possible values and norms, so that they can live a happy, fulfilling life and attain their highest potential.  The author on her personal quest:  “Of course, it was my own quest that led to these discoveries. For years I had asked myself why I was making trouble at certain moments. Now that I know this and am able to change it, my world has opened up. I don't have to be afraid of myself or of others, I don't have to make myself invisible or defend myself. I can choose how to behave and how to feel. In every situation I have a grip on myself and that makes me free to cope with other people in a correct way. This offers a new perspective, both professionally and privately. I can function on my own and in a team, I can expand both intellectually and personally. I am glad about what I do and how I can love. In short, I am happy and enjoy myself.  Sharing the processes, which make this revolution possible, with other people, is my greatest joy. I use my talents for writing, training and counseling and I enjoy my family. That is my way of saying thanks for all the opportunities that life has offered me.”  For further information and workshops see:  www.freefullliving.com and www.nostress.today",
  "genres": [
    "Self Help"
  ],
  "author": "Marina Riemslagh",
  "average_rating": "4.10",
  "url": "https://www.goodreads.com/book/show/25261275-no-stress-today-with-psych-k"
}