{
  "title": "Restrain By Treaty",
  "description": "He hides his true form to spare her sanity. Will the truth destroy them, or is love truly blind?\nAfter decades of war, the Qui Empress ushers in a new era when she takes a human tribute as her price for a peace treaty with Earth. She orders the surrender of all human prisoners of war.Ardant’s mission is to retrieve Captain Bea Solomon and bring her safely home. He finds Bea at the mercy of a flesh dealer, so mistreated that the sight of Ardant’s winged lizard form terrifies her. To gain her trust and rescue both her mind and body, Ardant makes a decision that traps him in a lie.Bea recovers in his care, blissfully unaware her savior is not the man she is growing to love. Ardant is Qui, a member of the shapeshifter alien race who once ordered the decimation of Earth. Attractions collide, pheromones explode, and Ardant clings to his human form by the shreds of his failing willpower. At his wit’s end, he enlists Bea’s help to restrain his baser needs… but this Captain enjoys having a handsome man bound and at her mercy.As passions rise and Ardant’s deception fractures, he faces the approaching reckoning. For no restraint can protect Bea from the devastating truth waiting to destroy her delicate peace of mind.\nThis sexy romance tale is the second short story in a collection inspired by Under By Treaty, a science fiction and erotic romance in Kayla Stonor’s Surrender collection.\nReader please note: Kayla Stonor’s stories can be dark and edgy, hot and wicked, punishing and uplifting. If you find certain themes uncomfortable reading, these stories may not be for you. Although this story is standalone, it is set within a wider story and it is recommended that the short stories are read in order. Please see inside cover.",
  "genres": [
    "Romance",
    "Aliens",
    "Science Fiction",
    "Erotica",
    "Space Opera",
    "Futuristic",
    "Erotic Romance"
  ],
  "author": "Kayla Stonor",
  "average_rating": "3.84",
  "url": "https://www.goodreads.com/book/show/25269801-restrain-by-treaty"
}