{
  "title": "Fifteen Dogs",
  "description": "Winner of the 2015 Scotiabank Giller PrizeFinalist for the 2015 Toronto Book AwardsWinner of the 2015 Rogers Writers' Trust Fiction Prize— I wonder, said Hermes, what it would be like if animals had human intelligence.— I'll wager a year's servitude, answered Apollo, that animals – any animal you like – would be even more unhappy than humans are, if they were given human intelligence.And so it begins: a bet between the gods Hermes and Apollo leads them to grant human consciousness and language to a group of dogs overnighting at a Toronto vet­erinary clinic. Suddenly capable of more complex thought, the pack is torn between those who resist the new ways of thinking, preferring the old 'dog' ways, and those who embrace the change. The gods watch from above as the dogs venture into their newly unfamiliar world, as they become divided among themselves, as each struggles with new thoughts and feelings. Wily Benjy moves from home to home, Prince becomes a poet, and Majnoun forges a relationship with a kind couple that stops even the Fates in their tracks.André Alexis's contemporary take on the apologue offers an utterly compelling and affecting look at the beauty and perils of human consciousness. By turns meditative and devastating, charming and strange, Fifteen Dogs shows you can teach an old genre new tricks.André Alexis was born in Trinidad and grew up in Canada. His debut novel, Childhood, won the Books in Canada First Novel Award, the Trillium Book Award, and was shortlisted for the Giller Prize and the Writers' Trust Fiction Prize. His other previous books include Asylum, Beauty and Sadness, Ingrid & the Wolf and, most recently, Pastoral, which was also nominated for the Rogers Writers' Trust Fiction Prize and was named a Globe and Mail Top 100 book of 2014.\"[Alexis] devises an inventive romp through the nature of humanity in this beautiful, entertaining read … A clever exploration of our essence, communication, and how our societies are organized.\" – \nKirkus Reviews\n\n\"This might be the best set-up of the spring.\" – \nThe Globe & Mail\n\n\n\"André Alexis has established himself as one of our preeminent voices.\" – \nToronto Star",
  "genres": [
    "Fiction",
    "Fantasy",
    "Canada",
    "Book Club",
    "Animals",
    "Philosophy",
    "Dogs"
  ],
  "author": "André Alexis",
  "average_rating": "3.80",
  "url": "https://www.goodreads.com/book/show/25264107-fifteen-dogs"
}