{
  "title": "Weaving A Tapestry of Dreams",
  "description": "Alternate Cover issueLife Happens. A very common phrase used today. We get up. We eat. Go to work. Try to exercise. Maybe fit in a little bit of relaxation. Go to sleep. Just to repeat the process all over again the next day. In the course of this day to day journey we laugh, we cry, we deal with crisis, we experience joy, sorrow, fear anxiety and pain. We get pulled in every direction possible. But for what reason? We usually don't even stop to ask that all important question. We get too caught up in living life to question life. What most of us don't realize is that while life is pulling us in all directions, our soul is on its very own journey. A quest toward enlightenment. This is the story of one such journey. The journey of a woman's soul as she tries to find her way home, her way back to the light. An accident leaves Destiny in a coma. Not quite ready to continue on to the next plane of life and not wanting to return to where she came, she is limbo. While the state of the physical world becomes bleak all around her and the hope of survival hangs from a thread. Her companions from the heavens come to her aid to try to take her home. Destiny is subconsciously torn between the ties she had made on earth and the ones that pull at her heart to take her home. Adam pressures her subconscious by having her experience a series of different parallel lives. With enough pressure he hopes she can break the chains that bind her. And she will be free from having to go through another circle of life in this dimension. She will be free to live in the light eternally. From a small hick town in the Nevada desert to a crystal cave in the heavens, Destiny is confused which life is reality. but realizes what is really important is the lessons she takes from them.",
  "genres": [],
  "author": "Jess Fulton",
  "average_rating": "4.06",
  "url": "https://www.goodreads.com/book/show/25264549-weaving-a-tapestry-of-dreams"
}