{
  "title": "Exceptional: Why the World Needs a Powerful America",
  "description": "Former vice president Dick Cheney, a #1 New York Times bestselling author, and his daughter Liz Cheney, former deputy assistant secretary of state, explain the unique and indispensable nature of American power, reveal the damage done by President Obama’s abandonment of this principle, and show how America can and must lead again.Since World War II, American power and leadership have been an unmatched force for the defense of freedom around the globe. For seventy years, presidents both Republican and Democratic have shared a dedication to maintaining American power and leadership. President Obama has abandoned this bipartisan tradition, choosing instead to “lead from behind” as he abandons America’s allies, appeases our enemies, and apologizes for this great nation.When the former vice president spoke out on the topic last year, the Wall Street Journal declared, “Dick Cheney is still right,” and the Washington Post lauded his comments, adding that “unless we have a president who understands that proactive, early action and a robust military force are essential to national security, we will forever be racing to catch up to our enemies.”Now the former vice president and his daughter, former deputy assistant secretary of state Liz Cheney, team up to explain how President Obama has drastically broken with the bipartisan foreign policy consensus that enabled America to prevail in World War II, to win the Cold War, and to triumph in the first decade of the War on Terror. The Cheneys reveal the damage done by President Obama’s policies and demonstrate how his unwillingness to defend and protect American power has weakened the nation and diminished the ability of future presidents to defend us.Finally, the Cheneys do what no one before them has chart a path forward to restoring American power and strength, explaining what must be done to reverse course, to fight and win the war on terror, to rebuild our military and reassure our allies that they can once again rely on American leadership. A critical, frank, and much-needed touchstone, Exceptional should stand as a guiding principle for the potential presidential candidates in 2016—and for policymakers today and beyond.",
  "genres": [
    "Politics",
    "History",
    "Nonfiction",
    "Political Science",
    "American History",
    "Military Fiction",
    "International Relations"
  ],
  "author": "Dick Cheney",
  "average_rating": "3.71",
  "url": "https://www.goodreads.com/book/show/25278664-exceptional"
}