{
  "title": "The Collapse of Parenting: How We Hurt Our Kids When We Treat Them Like Grown-Ups",
  "description": "In The Collapse of Parenting , physician, psychologist, and internationally acclaimed author Leonard Sax presents data documenting a dramatic decline in the achievement and psychological health of American children. Sax argues that rising levels of obesity, depression, and anxiety among young people—as well as the explosion in prescribing psychiatric medications to kids—can all be traced to parents letting their kids call the shots.Many parents are afraid of seeming too dictatorial and end up abdicating their authority rather than taking a stand with their own children. If kids refuse to eat anything green and demand pizza instead, some parents give in, inadvertently raising children who are more likely to become obese. If children are given smartphones and allowed to spend the bulk of their free time texting, playing video games, and surfing the Internet, they become increasingly reliant on peers and the media for guidance on how to live, rather than getting such guidance at home. And if they won't sit still in class or listen to adults, they're often prescribed medication, a quick fix that actually undermines their self-control. In short, Sax argues, parents are failing to prioritize the parent-child relationship and are allowing a child-peer dynamic to take precedence. The result is children who have no absolute standard of right and wrong, who lack discipline, and who look to their peers and the Internet for direction, instead of looking to their parents.But there is hope. Sax shows how parents can help their kids by reasserting their authority—by limiting time with screens, by encouraging better habits at the dinner table and at bedtime, and by teaching humility and perspective. Drawing on more than twenty-five years of experience as a family physician and psychologist, along with hundreds of interviews with children, parents, and teachers across the United States and around the world, Sax offers a blueprint parents can use to refresh and renew their relationships with their children to help their children thrive in an increasingly complicated world.",
  "genres": [
    "Parenting",
    "Nonfiction",
    "Psychology",
    "Self Help",
    "Audiobook",
    "Family",
    "Adult"
  ],
  "author": "Leonard Sax",
  "average_rating": "4.28",
  "url": "https://www.goodreads.com/book/show/25273812-the-collapse-of-parenting"
}