{
  "title": "Dating in Los Angeles: Dissecting the Dysfunction",
  "description": "Harsh. No-Holds-Barred. Brutally Honest Truth, which will Piss People Off.The above typically describes Dylan Thrasher’s coaching style, but in no other book of his to date does it so accurately describe the tone of his material as this one. Dating in Los Angeles. These four words alone are enough to make many grown men and women complain, cry, pout, and scream in this town. The city that outsiders may relate to with stars and sunshine actually houses so many functional dysfunctionals within, that it is chock full of crazy, funny, and scary dating stories alike – and it’s not just from the celebrity/Hollywood crowd! Far from it, the everyday man or woman, guy or girl walking the streets here has gone through multiple episodes of dating dysfunction, and likely been the root cause of quite a bit themselves!Read through the book now as we look at all the following and more:-What is it about Los Angeles that sparks the wrath of many when discussing the world of not just dating, but love & relationships within its boundaries as well?-Who are the disaffected, disillusioned and sometimes demented purveyors of fame and fortune moving to the city of lost souls, and are they to blame?- Does the entertainment industry promote a lack of true culture, a lack of values, and play a part in creating illusions of what you see here, or more importantly what you see through?-Do all the distractions that Los Angeles offers really correlate to a 70% divorce rate locally, and if so, what is the end game here for all of the beautiful people?This book might upset some and offend others, but will do so indirectly as a symptom of telling the truth in an honest, unfiltered approach exposing what’s it’s really like to date in Los Angeles, as we look not to glamorize the glitz, but rather to dissect the dysfunction.",
  "genres": [],
  "author": "Dylan Thrasher",
  "average_rating": "3.83",
  "url": "https://www.goodreads.com/book/show/25273249-dating-in-los-angeles"
}