{
  "title": "Born Strong: From Surviving the Great Famine to Teaching Tai Chi to Millions",
  "description": "orn in Vietnam, Bon Trong—meaning “born to be strong”—was only ten months old when he was left with his grandmother in China in place of his father to fulfill an ancient Chinese tradition that required a male heir to see his parent off to the next life. Little did anyone know that soon thereafter, the Communist Party under Mao Zedong would overtake China, and change life as they knew it forever. For sixteen years, Bon Trong suffered abuse and terror from the Communist rule and narrowly escaped death from starvation during Mao’s disastrous Great Famine. In a small storeroom with his beloved aunt and older cousin, Bon Trong learned the meaning of love and family in the harshest of circumstances. But his destiny was not in China.When Bon Trong was sixteen, his father managed to get him out from under the Communists in China. He escaped to Hong Kong, where he was welcomed by an uncle and aunt but was distressed by the shock of the new culture and his heart-wrenching separation from his aunt. However, he was determined to win approval from his parents, from his family, but most of all, from himself.As fate would have it, a brother living in Australia paved the way for him to find his future there. Excited by the Western culture and kindness of the people, he finally experienced freedom for the first time in his life. Paul, as he was now known, chose the path of healing early on when he decided to become a doctor. He came to realize how much he loved medicine, and it became clear his calling was to heal people.Dr. Lam was far from well, however, as he suffered many debilitating effects from the years of starvation and malnutrition in his childhood. He began studying tai chi with his father-in-law hoping to ease his painful arthritis. Moved by the art and the movements that began to improve his health and spirit, Dr. Lam became an avid learner and expert in tai chi. Feeling he could help others through tai chi, he started workshops to teach those who wanted to learn, and also instructed others how to teach the methods he had developed. From workshops to lectures to creating DVDs to writing books, Dr. Paul Lam has dedicated his life to spreading the health benefits of tai chi around the world. He has changed the lives of millions of people who seek to connect their mind, body, and spirit through tai chi, fulfilling his destiny to become a true healer.Born Strong is a story of survival, persistence, and love.",
  "genres": [],
  "author": "Paul Lam",
  "average_rating": "4.33",
  "url": "https://www.goodreads.com/book/show/25278270-born-strong"
}