{
  "title": "The Catcher in the Eye",
  "description": "Hey, look at that stunning beauty! What...(S)HE's NOT A GIRL?! Michael Archangel is his name, cracking cases is his game, and 'shame' is not written in his dictionary. When it comes to revealing the killer's hidden secret (or his own legs) he has no hesitation. He hunts down, kicks ass, and nails the killer-in high heels. Kelly is his personal assistant. Her mind is all set for a career. So far, things are going great. She has to get over the apocalyptic divorce, British media keep on calling her Bitch, and her boss treats her like the butt of jokes. When her boss gets summoned by the FBI to help catch an eyeball-snatching serial killer ASAP, things get lovelier. Okay, so hanging around at bloody crime scenes is a part of her job, but it's not easy to see brutally murdered victims eye-to-eye-especially when they are missing the eyeballs. Seriously, can they really catch this killer as a team? For a sneak peek at the first pages of former FBI Special Agent Michael Archangel and Kelly's story, The Catcher in the Eye, scroll up and click the Look Inside feature on the top left hand side of the page. CHECK OUT WHAT THE WORLD IS SAYING ABOUT THEM Words about Michael Archangel: \"Unlike brilliant detectives in the literatures, Archangel didn't need much assistance when it comes to investigation and solving cases. Just like fictional detectives, he was crazy, and he tended to torment his own precious little assistant, having a chuckle at my expense.\"-Kelly Kinki. \"Hannibal Lecter, eat your heart out! In front of that Devil, you're nothing but a small prey. Ha! By the way, I'm not related to the Queen of reality TV.\"-Duff Kardashian, former Chief of Cedar Bay Police Department \"He ain't no angel, no. The rumor is that the devil had once made a bloody murderer cry like a baby. Back then, he was just fifteen. Scary, isn't it? No, I didn't let him make me cry. I'm not that pathetic. What? Is this an interrogation? C'mon, gimme a break. I've got a reputation to keep. Hell, I don't want to talk about it anymore.\"-Dan Harman, an inmate of Deirdre Hall Correctional Facility \"Good thing I'm not one of them crooks he hunts down. Imagine a 7-foot transvestite in high heels beating the crap out of another guy. Funny? Yeah, as long as you're not being punched or kicked at. When it actually happens to you, it gets scary. I, for one, would end up having recurring nightmares. Permanently scarred.\"-Loyd Park, author of Naked Llama Mysteries Series \"Michael rocks in high heels! You should see him in Prada. And it's not just an urban legend.\"-Jeremy Plum, florist in McLean, VA Words about Kelly Kinki: \"Don't ever enunciate that bloody name in front of me. That B****!\"-Lady Dianne AmyEvanovich of Nice, France \"I liked her. Still do. It was nice to talk with her about hobbies and crafts. And her culinary skill was so outstanding that I still miss her omelet sometimes. Suppose she pops out in front of me and offers to make me that special Japanese omelet, I'm gonna be like; Yes, Please!' You know, I'm not much of a romantic, but her sweet omelet, I can't resist.\"-Nick Valentine, Bassist of Iron Dragon \"Don't underestimate her. She's not just a sugar cupcake kind of girl.\"-Harry Satire, the Chief Editor of Daily Thriller \"We were in the same class in Switzerland. She was good at culinary and party organization classes. She reminds me of someone from romantic comedy. Who knew she had such a special skill?\"-Stephanie Janet Poehler, \"real\" housewife of Cedar Bay, NC Currently Available in Kindle Format.",
  "genres": [
    "Mystery"
  ],
  "author": "Lotta Smith",
  "average_rating": "3.76",
  "url": "https://www.goodreads.com/book/show/25271262-the-catcher-in-the-eye"
}