{
  "title": "The House on Fortune Street",
  "description": "Margot Livesey skillfully reveals how luck—good and bad—plays a vital role in our lives, and how the search for truth can prove a dangerous undertaking.It seems like mutual good luck for Abigail Taylor and Dara MacLeod when they meet at St. Andrews University and, despite their differences, become fast friends. Years later they remain an unlikely pair. Abigail, an actress who confidently uses her charms both on- and offstage, believes herself immune to love. Dara, a counselor, is convinced that everyone is inescapably marked by childhood; she throws herself into romantic relationships with frightening intensity. Yet now each seems to have found \"true love\"—another stroke of luck?—Abigail with her academic boyfriend, Sean, and Dara with a tall, dark violinist named Edward, who literally falls at her feet. But soon after Dara moves into Abigail's downstairs apartment, trouble threatens both relationships, and their friendship. For Abigail it comes in the form of an anonymous letter to Sean claiming that she's been unfaithful; for Dara, a reconciliation with her distant father, Cameron, who left the family when Dara was ten, reawakens complicated feelings. Through four ingeniously interlocking narratives—Sean's, Cameron's, Dara's, and Abigail's—we gradually understand how these characters' lives are shaped by both chance and determination. Whatever the source, there is no mistaking the tragedy that strikes the house on Fortune Street. \"Everyone,\" claims Abigail, \"has a book or a writer who's the key to their life.\" As this statement reverberates through each of the narratives, Margot Livesey skillfully reveals how luck—good and bad—plays a vital role in our lives, and how the search for truth can prove a dangerous undertaking. Written with her characteristic elegance and wit, The House on Fortune Street offers a surprisingly provocative detective story of the heart.",
  "genres": [
    "Fiction",
    "Literary Fiction",
    "Book Club",
    "Contemporary",
    "Adult Fiction",
    "Novels",
    "British Literature"
  ],
  "author": "Margot Livesey",
  "average_rating": "3.52",
  "url": "https://www.goodreads.com/book/show/2527206.The_House_on_Fortune_Street"
}