{
  "title": "Building Heat",
  "description": "Things are about to get very hot in an apartment building in Manhattan’s Upper West Side. 12C- Avery McKannery is one of New York City’s most powerful and ruthless lawyers. Professionally, he’s unstoppable and intimidating, destroying everyone in his path. Privately, Avery has issues. Serious issues. And absolutely no personal life beyond silently lusting after the guy next door. 12B- Mason Whitfield has an impressive career in publishing, wrote an incredible book that no one’s read and lives for music. After a humiliating and devastating breakup, he’s avoided dating. Secretly, he’s been casually stalking the ridiculously hot lawyer in 12C. Mason whistled as he skipped up the steps and nodded to the doorman as he entered the lobby. He saw the elevator doors closing and for some reason, he ran for them instead of waiting two minutes for the elevator to return. He grabbed one of the doors and pushed just before they closed and they slid open. Mason smiled as he stepped forward and froze when his eyes met 12C’s. Mason stepped forward and 12C remained still as the doors closed behind Mason, instead of stepping back and giving him room. Once again, they were chest to chest, Mason’s t-shirt brushed against the buttons of 12C’s shirt as he inhaled and Mason let his head fall to the side as he searched 12C’s eyes. Mason saw 12C’s eyes flick to his lips and they were plunged into heat as the elevator went up. There was a groan, Mason wasn't sure who started it but it passed through both of them as his hands closed around 12C’s face and their lips collided. Mason felt his body moving forward, backing 12C against the wall as his tongue traced 12C’s lower lip. 12C gasped and his hands clutched at Mason’s shirt, pulling him closer. Mason’s tongue surged into 12C’s mouth and twirled around his tongue. Mason moaned as he tasted cherries and beer, his tongue swept deep and greedy into 12C’s mouth, searching for more. 12C’s hand burned through Mason’s clothes as it slid down his back. Mason’s eyes flared as he felt 12C’s hand close around his ass and pull him hard against his very large erection. Mason growled in approval as he rocked his hips against 12C. He felt 12C’s other hand slide into his hair as their hearts pounded savagely against each other’s chests. Mason let his fingertips glide down 12C’s neck and chest before he fisted his hands in 12C’s shirt as he angled his head and sucked on 12C’s tongue. The bing of the elevator had their heads snapping up as the doors slid open. Stunned and breathless, Mason stepped back and looked around. What just happened? Mason blinked as he looked back at 12C. There was no help there as Mason met 12C’s glazed expression. They both moved silently into the hall and turned toward their doors. Autopilot kicked in and they walked side by side until Mason reached his door and pulled his keys from his pocket. He fumbled at the lock as 12C continued on to his door. Once he was in his apartment, Mason looked around, disoriented and painfully aroused. “What the hell was that?” Mason whispered as he pressed his hand to his chest, trying to get his breathing to settle. His brows pulled together as he looked in the direction of 12C. “Why am I here and not over there?” He asked as he tried to string his thoughts together and make something coherent happen. There was no doubting 12C’s interest after that. \"Go over there!\" Mason’s brain and throbbing cock urged. He nodded as he looked down at his clothes. Zeppelin t-shirt, jeans and leather flip flops. He wasn’t sure if he should change before he went over.",
  "genres": [
    "M M Romance",
    "Romance",
    "Contemporary Romance",
    "Contemporary",
    "Erotica",
    "Erotic Romance",
    "LGBT"
  ],
  "author": "K. Sterling",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/25278325-building-heat"
}