{
  "title": "Now, Let Me Tell You What I Really Think",
  "description": "Chris Matthews has been playing \"hardball\" since the day he was born. From his first political run-in in the first grade to his years working as presidential speechwriter for Jimmy Carter and top aide to Tip O'Neill, Matthews grew up loving his country and dreaming of his chance to protect it. As one of the most honest, brash, and in-your-face journalists on TV, he has finally gotten the chance. The host of television's Hardball and bestselling author of such classics as Hardball and Kennedy & Nixon, Matthews is a political cop who insists on the truth and nothing but. In this latest work, Now, Let Me Tell You What I Really Think, Chris Matthews is at his brilliant, blunt, bulldogged best.  From the Cold War to the Clinton years, Matthews gives the straight-up account of what it means to be an American. Matthews tells us about his \"God and Country\" Catholic school education in Philadelphia complete with Cold War air-raid drills and his early enthusiasm for politics. He shares with us his life's adventures: two years in Africa with the Peace Corps, the challenge of running for Congress in his twenties, and his three decades deep in the \"belly of the beast\" of American politics.  Matthews has made his name as a razor-sharp journalist who cross-examines the politicians in Washington and takes on the Los Angeles and New York elite who view America's heartland as \"fly-over country.\"  In Now, Let Me Tell You What I Really Think, Matthews rallies those who \"work hard and play by the rules\" and celebrates the wisdom learned from a U.S. Capitol policeman more than twenty years ago, \"The little man loves his country, because it's all he's got.\" A hard-to-categorize maverick with an uncool love for his country, Matthews gives an irreverent look at who we are and whom we trust to lead us.",
  "genres": [
    "Politics",
    "Nonfiction",
    "Biography",
    "Memoir"
  ],
  "author": "Chris Matthews",
  "average_rating": "3.33",
  "url": "https://www.goodreads.com/book/show/252907.Now_Let_Me_Tell_You_What_I_Really_Think"
}