{
  "title": "Universally Preferable Behaviour: A Rational Proof of Secular Ethics",
  "description": "For thousands of years, humanity has attempted to enforce ethics through supernatural and secular punishments; this rabid aggression has been both necessary and ridiculous. It has been necessary because a rational proof of secular ethics has never been achieved; it has been ridiculous because it is impossible to imagine any scientific or mathematical argument being advanced in such a hysterical and violent manner. “Ethics” has been one of the great government programs of history; since kings and priests ruled mankind, only those philosophers who served their interests tended to get promoted to prominence, rather than imprisoned, poisoned or burned. Thus, over 2,500 years since its inception, the discipline of ethics remains largely subjectivist, relativist and cultural – and was not only unable to restrain, but may have played a part in promoting the horrors, wars and genocides of the 20th century, the bloodiest hundred years of history of our species. Stefan Molyneux, host of Freedomain Radio, has written \"Universally Preferable A Rational Proof of Secular Ethics,” which presents radical and rational arguments for a nonreligious, non-statist, entirely secular set ethical standards which validate the nonaggression principle – thou shalt not initiate force against thy fellow human – and the fundamental logic for respecting property rights. Rigorous, analytical and challenging, “Universally Preferable Behavior” provides a solid foundation for secular ethics. This book solves the ancient philosopher Petrarch’s dichotomy, which is that it is better to will the good than know the truth. Armed with the arguments in “Universally Preferable Behavior,” you can both know the truth and will the good.",
  "genres": [
    "Philosophy",
    "Nonfiction",
    "Politics"
  ],
  "author": "Stefan Molyneux",
  "average_rating": "3.72",
  "url": "https://www.goodreads.com/book/show/2528770.Universally_Preferable_Behaviour"
}