{
  "title": "Fearless In Love",
  "description": "\"Full of so much love, compassion, romance and family loyalty, Fearless In Love reels you in and keeps you reading!\" ~ 5 stars After growing up dirt poor in a seedy Chicago neighborhood, Matt Tremont seemingly has it all now—brains, brawn, and billions. And most importantly, Noah, his five-year-old son, the one good outcome of a disastrous relationship that destroyed his last ounce of trust. The only thing he’s lacking is the perfect nanny for his son. And Ariana Jones is absolute perfection. Utterly enchanting. Completely fascinating. And totally off limits.   Like a match made in heaven, this is Ari's dream job. Swallowed up in the foster care system after losing her brother and mother, Ari has always dreamed of family. She showers five-year-old Noah with all the love she’s kept bottled up inside. Love she could also offer to her gorgeous billionaire boss—if only he weren’t the very last man she could ever hope to have.   But when sizzling sparks of attraction turn into a forbidden, sinfully hot night of pleasure, will Ari’s love be enough to make Matt forget the past and love fearlessly? An exciting and emotional contemporary romance series from New York Times and USA Today bestselling authors Bella Andre and Jennifer Skully! THE MAVERICK Breathless In Love Reckless In Love Fearless In Love Irresistible In Love Wild In Love Captivating In Love ~ More Maverick Billionaires are coming soon! ~ \"Wow, this series is so good! I am in love with The Mavericks!\" \"If I could give this book 10 stars I would, but I have to settle for just 5 stars. If you read no other book this month you MUST READ this one!\" \"I fell madly in love with the characters. I laughed, cried and forgot to breathe at the raw emotion.\" \"What's not to love about sexy, alpha-hot billionaires? The cake is delicious, but the icing is their compassion and sensitivity to everyone they care about most.\" Bella Andre's New York Times and USA Today bestselling novels have been #1 bestsellers around the world and she has sold more than 8 million books so far! Known for \"sensual, empowered stories enveloped in heady romance\" (Publishers Weekly), her books have been Cosmopolitan Magazine \"Red Hot Reads\" twice and have been translated into ten languages. She also writes \"sweet\" contemporary romances as Lucy Kevin. There are more than 50,000 5 star reviews for Bella Andre's books on Goodreads! NY Times and USA Today bestselling Jennifer Skully/Jasmine Haynes is the author of classy romance, hilarious romantic mysteries, and the Max Starr paranormal suspense series. Her books have passion, heart, humor, and happy endings. Jennifer lives in the Redwoods of Northern California with her husband and their adorable nuisance of a cat, who obviously runs the household.",
  "genres": [
    "Romance",
    "Contemporary Romance",
    "Contemporary",
    "Amazon",
    "Adult",
    "Fiction",
    "Chick Lit"
  ],
  "author": "Bella Andre",
  "average_rating": "4.17",
  "url": "https://www.goodreads.com/book/show/25293489-fearless-in-love"
}