{
  "title": "Sumisión",
  "description": "Francia, en un futuro próximo. A las puertas de las elecciones presidenciales de 2022. Los partidos tradicionales se han hundido en las encuestas y Mohammed Ben Abbes, carismático líder de una nueva formación islamista moderada, derrota con el apoyo de los socialistas y de la derecha a la candidata del Frente Nacional en la segunda vuelta. François, un profesor universitario hastiado de la docencia y de su vida sexual, que a sus cuarenta años se había resignado a una vida aburrida pero sosegada, ve cómo la rápida transformación que sucede a la llegada del nuevo presidente al Elíseo altera la vida cotidiana de los franceses y le depara a él un inesperado futuro. Los judíos han emigrado a Israel, en las calles las mujeres han cambiado las faldas por conjuntos de blusas largas y pantalones, y algunos comercios han cerrado sus puertas o reorientado el negocio. Y la Sorbona es ahora una universidad islámica en la que los profesores conversos gozan de excelentes salarios y tienen derecho a la poligamia. Al igual que Huysmans, el escritor del siglo XIX convertido al catolicismo al que consagró su tesis, François sopesará pronunciar las palabras que le abrirán las puertas de la religión islámica y de una nueva vida: «No hay más dios que Alá y Mahoma es su profeta.»Sumisión llegó a las librerías francesas el mismo día del trágico atentado contra Charlie Hebdo y Houellebecq, acusado de islamofobia o de dar alas a la extrema derecha, afirmó: «No tomo partido, no defiendo ningún régimen. Deniego toda responsabilidad. He acelerado la historia, pero no puedo decir que sea una provocación, porque no digo cosas que considere falsas sólo para poner nerviosos a los demás.» Más allá de la polémica, Sumisión es una novela de «política ficción» –como 1984 y Un mundo feliz–, una turbadora fábula política y moral, en la que coexisten intuiciones poéticas, efectos cómicos y una melancolía fatalista.«Si hay alguien hoy, en la literatura mundial, que reflexiona sobre la enorme mutación que todos sentimos que se halla en curso sin que tengamos los medios para analizarla, es Houellebecq» (Emmanuel Carrère).«La novela más densa e inquietante de Michel Houellebecq. Una meditación sobre el declive de nuestra sociedad y el deseo de sumisión» (Guy Duplat).«Divertida, impertinente y desesperada, Sumisión esconde una inaudita lección. Menos escandalosa de lo que se ha dicho y más sutil de lo que parece» (Sébastien Lapaque, Le Figaro).«Michel Houellebecq describe el malestar desde el interior, como un médico, más interesado en sanar que en denunciar» (Pascal Bruckner).«Sumisión marca uno de esos hitos excepcionales en los que la política y el arte coinciden. El más destacado misántropo literario europeo ofrece una visión fascinante y asombrosamente pesimista de la naturaleza humana» (Christopher de Bellaigue, The Guardian).«No es sólo un escritor de sátiras sino que es un “sincero” escritor de sátiras, francamente entristecido ante los disparates de la historia y la locura humana, y eso es más inusual» (Adam Gopnik, The New Yorker).«Houellebecq es uno de los observadores más talentosos de las mentiras y contradicciones de nuestras existencias» (Iris Radisch, Die Zeit).",
  "genres": [
    "France",
    "Novels",
    "Politics",
    "Contemporary",
    "Literature",
    "French Literature",
    "Dystopia"
  ],
  "author": "Michel Houellebecq",
  "average_rating": "3.65",
  "url": "https://www.goodreads.com/book/show/25293873-sumisi-n"
}