{
  "title": "The Bennu Project",
  "description": "The book is listed on Amazon as well as Smashwords in the African American Science Fiction Genre. It is also included in the Schomburg Center for Research in Black Culture catalogue. The Bennu Project is a genre-defying read with the suspense of a mystery novel, the mataphors of a science fiction story, and a prevalent theme of historical relevance throughout. Received favorably by both male and female readers from their twenties to their seventies, the novel captures the essence of works by Chancellor Williams and Cheikh Anta Diop. Readers will enjoy the historical accuracy presented as well as the entertaining science fiction narrative. Told as a metaphor for the rise and fall of several Nile valley civilizations, readers will enjoy a science fiction metaphor which presents factual information in a fun and exciting narrative. This is a favorite among home school educators.Young Azubuike is a survivor. Countless generations have passed since the fracture, and subsequent collapse, of the Meroan Republic. Yet remnants of their culture and technology continue to persist on various worlds that have been conquered by their enemies. Subjugated and oppressed, the descendants of this once great republic know they must change the direction of their fate or face extinction.On a dangerous run to scavenge supplies from a remote excavation site located in an isolated section of the Meza ruins, Azubuike and his friends encounter a unique piece of technology left behind by their ancestors. Once exposed to it, the device begins to alter Azubuike’s reality in ways that could, ultimately, unravel his mind. There is no way for the group to know the danger, or benefit, posed by this ancient technology even though it has already set in motion a series of events that will forever change the lives of Azubuike and his friends. Has he just unlocked the secret to ending the alien occupation of his world? Or will it bring about the final destruction of his people?",
  "genres": [],
  "author": "Tyrone Givens",
  "average_rating": "4.92",
  "url": "https://www.goodreads.com/book/show/25294652-the-bennu-project"
}