{
  "title": "Burning It All",
  "description": "Burning It All is a 22,000 word novella with a satisfying romantic ending -- no cliffhangers. It is the third of three novellas featuring Jack & Lily, preceded by Betting It All and Risking It All  The Motorcycle Clubs series is a novella series for women who want all of the heat and emotion, but who don't have all of the time.  As the Hellfire Riders’ warlord, I’m willing to lay down my life to protect the club. But protecting the woman I love might destroy everything…  I’ve never known anything as good as holding Lily Burns in my arms. The only female member of the Hellfire Riders, she’s always fighting—and the last fight she won is bringing hell down on her head. But it’s not the Devil’s Hangmen that worry me. Because there’s power and money moving behind the scenes, and a target on Lily’s back...and I’ll do anything to make sure she’s safe, even if it means standing as her shield.  Even if it means losing her.   Available Now in the Motorcycle Clubs series:   1. HIS WILD DESIRE by Ella Goode (Death Lords MC #1) 2. OFF LIMITS by Ruby Dixon (Bedlam Butchers #1) 3. WANTING IT ALL by Kati Wilde (Hellfire Riders #1)  4. HER SECRET PLEASURE by Ella Goode (Death Lords MC #2) 5. PACKING DOUBLE by Ruby Dixon (Bedlam Butchers #2) 6. TAKING IT ALL by Kati Wilde (Hellfire Riders #2)  7. THEIR PRIVATE NEED by Ella Goode (Death Lords MC #3) 8. DOUBLE TROUBLE by Ruby Dixon (Bedlam Butchers #3) 9. HAVING IT ALL by Kati Wilde (Hellfire Riders #3)  10. THEIR FIERCE LOVE by Ella Goode (Death Lords MC #4) 11. BETTING IT ALL by Kati Wilde (Hellfire Riders MC #4) 12. DOUBLE DOWN by Ruby Dixon (Bedlam Butchers MC #4)  13. THEIR LASTING CLAIM by Ella Goode (Death Lords MC #5) 14. RISKING IT ALL by Kati Wilde (Hellfire Riders MC #5) 15. DOUBLE OR NOTHING by Ruby Dixon (Bedlam Butchers MC #5)  16. BURNING IT ALL by Kati Wilde (Hellfire Riders MC #6) Coming Soon: 17. HIS MAD PASSION by Ella Goode (Death Lords MC #6) 18. SLOW RIDE by Ruby Dixon (Bedlam Butchers MC #6)",
  "genres": [],
  "author": "Kati Wilde",
  "average_rating": "4.21",
  "url": "https://www.goodreads.com/book/show/25283661-burning-it-all"
}