{
  "title": "Frozen Fever: 2015 Best Fiction",
  "description": "This Fiction is based on the new Disney Frozen animated short,\"Frozen Fever.\"  Elsa has spent all summer preparing a surprise party for Anna. Anna completely deserves after all she sacrificed to help Elsa. What happens when Elsa accidentally transfers some of her powers to Anna without either of them realizing it? Neither of them can anticipate that as Anna blows out her birthday candles everything is going wrong. Thankfully Elsa, Anna, Olaf, Kristoff, and Sven are all in attendance to help figure out how to fix what went wrong and how to fix it. The story follows the five of them plus one new character on their adventures trying to figure out how to save Arendelle and everyone who attended Anna’s surprise party before anything else can go wrong.  Let's enjoy reading Frozen Fever  Elsa let the last drop of delicate white icing float softly into place on the three tiered, beautifully crafted cake. Well, almost beautifully crafted. It was absolutely perfect about five minutes ago before she caught Olaf going to town stuffing his face with the outside layer of the icing. She did her best to do a quick icing repair job but she didn’t have time to do a complete redo. It didn’t look like it was just being eaten though so her work was complete.  “Alright Olaf, I fixed it. No one will even notice now.” Elsa said swinging towards Olaf her blue dress arched out twinkling and sparkling as if it were a piece of the bright summer sky smattered with icicles. Her beautiful blue eyes twinkled so Olaf knew she wasn’t mad at him. And she wasn’t. After all who could stay mad at Olaf?  “Thanks Elsa. I am really sorry. Don’t tell Anna about that okay? It was really good by the way. Did you make it?” Olaf responded sheepishly. His carrot nose rose up and down as he spoke.  “Sure Olaf I won’t tell Anna. No one has to know. And yes I did make it. I even added a little touch of something special.” She winked at him and flicked her wrist with the last sentence letting white and light blue spirals spray gently over the cake returning the more intricate icing decorations back to the way they were.  “Cool.” Olaf gasped watching as she walked towards the middle of the courtyard.",
  "genres": [],
  "author": "Anna Princess",
  "average_rating": "3.43",
  "url": "https://www.goodreads.com/book/show/25295948-frozen-fever"
}