{
  "title": "Ashley Bell",
  "description": "#1 NEW YORK TIMES BESTSELLER • NAMED ONE OF THE BEST BOOKS OF THE YEAR BY BOOKPAGE • The must-read thriller of the year, for readers of dark psychological suspense and modern classics of mystery and adventureThis ebook edition contains a special preview of Dean Koontz’s The Silent Corner. The girl who said no to death. Bibi Blair is a fierce, funny, dauntless young woman—whose doctor says she has one year to live. She replies, “We’ll see.” Her sudden recovery astonishes medical science. An enigmatic woman convinces Bibi that she escaped death so that she can save someone else. Someone named Ashley Bell. But save her from what, from whom? And who is Ashley Bell? Where is she? Bibi’s obsession with finding Ashley sends her on the run from threats both mystical and worldly, including a rich and charismatic cult leader with terrifying ambitions. Here is an eloquent, riveting, brilliantly paced story with an exhilarating heroine and a twisting, ingenious plot filled with staggering surprises. Ashley Bell is a new milestone in literary suspense from the long-acclaimed master.Praise for Ashley Bell“A mind-bender filled with satisfying surprises.”—People (book of the week)   “[With] lyrical writing and compelling characters . . . Koontz stands alone, and this novel is a prime example of literary suspense. . . . One of his best.”—Associated Press   “Grabs you on page one and keeps you enthralled with ever widening loops of intrigue, spine-tingling plot twists, absorbing characters and emotional involvement . . . extraordinary.”—Bookreporter   “Heart-pounding and mind boggling . . . a rarity of a thriller—one that asks big questions about life and destiny while succeeding in creating [an] eerie sense of reality.”—Shelf Awareness   “Strap in and hold on. . . . When a writer has managed to catch this kind of lightning in a bottle, every reader should experience the full jolt.”—BookPage",
  "genres": [
    "Fiction",
    "Thriller",
    "Mystery",
    "Horror",
    "Fantasy",
    "Suspense",
    "Paranormal"
  ],
  "author": "Dean Koontz",
  "average_rating": "3.62",
  "url": "https://www.goodreads.com/book/show/25281961-ashley-bell"
}