{
  "title": "Sins Amongst the Cotton Dust",
  "description": "When Abigail, a Savannah plantation owner’s daughter, meets Amos, a cotton field slave, when they are children in the mid-eighteenth century, their secret friendship evolves throughout the years to a blossoming and passionate romance. When her father, one of the richest and most ruthless slave owners in the South, forces Abigail to marry his business partner’s son, she is both shocked and trapped. Seeing no way to back out of the marriage without her father discovering her secret love affair --a crime which is both prohibited and punishable by death in 1775-Abigail goes through with the vows to protect the man that she loves.When war breaks out and positions patriots against British, loyalists against rebels, and fathers against sons, Abigail finds herself once more protecting the secrets of the man in her life. Her new husband, Killian, has decided to take up arms to join the rebel cause--a move that will place him on the divergent side of their family’s strong loyalist stance. It’s a secret that could bring the British right to her doorstep should the truth of her husband’s allegiances ever be reviled. The secret her own heart holds, now that she’s returned to the arms of the slave she truly loves, could also be one of ruin and grave punishment should the truth ever be stumbled upon. But how long can a forbidden love affair go unnoticed?In an atmosphere thick with mistrust, desire, and incipient hope, Abigail will eventually find her loyalties torn between the need to safeguard the man she adores and to change society’s view of the ultimate Southern sin. At a time when rigid societal norms seem absolute, Abigail risks everything and defies all odds in hope that she and Amos can have two things--love and freedom. Yet the real question is can anybody have both in a land torn by prejudice and war?",
  "genres": [],
  "author": "Yolonda Kay",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/25301730-sins-amongst-the-cotton-dust"
}