{
  "title": "Miseryland",
  "description": "Includes volumes 9-15 of the series Powdered Milk Publisher's Weekly - \"Roberts shares her life as a mother living with a young child just learning to push boundaries in this collection of her Ignatz Award-nominated Powdered Milk minicomics. With this strong entry in the autobiographical comic genre, Roberts is unafraid to show herself looking bad, such as when she's frustrated when her daughter, Xia, calls her-only to find out it's to say \"I love you.\" In the comic's best pages, Roberts and Xia struggle with toilet training (\"That already happened,\" Xia beams when she is warned to keep her butt out of the bowl), and Xia abuses her swearing privileges. The linework on the characters is detailed while retaining a sketchiness for backgrounds that makes the figures feel raw, rather than polished. The simple, direct art makes for an intimate, personal journey through Roberts's life as a mother and creator.\" Alex Hoffman, Sequential State, 5 June, 2015 - \"Roberts' comics primarily explore her relationship with her daughter Xia and husband Scott, as well as her interactions with friends and extended family. These are classic slice-of-life comics, and Roberts uses sometimes panels, sometimes full pages to capture the essence of certain moments. Xia is growing up and learning about the world around her, and the strange internal logic of toddlers gives Miseryland much of its charm. Slice-of-life comics can often be cute or endearing, but Miseryland is funny, laugh out loud funny, mostly due to the inanities and bad behaviors of its youngest cast member and Roberts' deadpan reactions. Importantly, Roberts isn't writing a \"kids say the darndest things\" comic; as panels and pages fall into place throughout Miseryland, these small stories paint a picture of Roberts as a melancholy, anxious mother living with bipolar disorder and trying to find the best way to raise her daughter. Xia is oftentimes the access point to these feelings, pointing out the hidden in ways that make it seem obvious. Miseryland isn't a tell all, either - even when things like Roberts miscarriage come up, the stories told are more a remembering than an exposure. We find Roberts at high and low points throughout the book, and while these moments coalesce into a larger vision, Miseryland has time to explore the way creative processes and personal time are changed after you have children. Some of these comics are certainly a part of the book because Xia wasn't napping when Roberts was drawing, just as some are there to illustrate Roberts fears and frustrations.\" printed with the assistance of Koyama Press",
  "genres": [
    "Graphic Novels",
    "Comics",
    "Memoir",
    "Humor",
    "Nonfiction",
    "Graphic Novels Comics",
    "Comix"
  ],
  "author": "Keiler Roberts",
  "average_rating": "4.18",
  "url": "https://www.goodreads.com/book/show/25304516-miseryland"
}