{
  "title": "Mahar Cinta Untuk Anisa",
  "description": "\"Menikahlah, maka kalian akan kaya...\"Aku tersenyum mendengar penjelasan Kiai Faqih. Hatiku berdesir. Semacam ada hawa surga yang tiba-tiba menyelinap ke dalam relung hati.\"Tapi mengapa kamu tiba-tiba berubah pikiran ingin menikah dengan Anisa?\"Pertanyaan Kiai Faqih membuatku salah tingkah. Tiba-tiba sesosok tubuh muncul dari dalam rumah. Anisa membawa teh hangat untuk kami. Rasanya jantungku berhenti sesaat melihat Anisa tersenyum di balik kerudung merahnya. Lalu kami sama-sama menunduk. Anisa meletakkan dua cangkir di atas meja. Beruntung sekali aku yang masih bisa mencuri pandang lewat meja kaca yang membentuk wajah ayu Anisa.\"Anisa, ini adalah fajar, putra Pak Yazid yang Abi ceritakan kemarin.\"Subhanallah! Untuk pertama kalinya, Anisa menyapaku dengan senyum. Cepat-cepat aku mengendalikan perasaan dan mencoba tersenyum sesederhana mungkin. Meski aku malu sekali. Lalu kami saling menunduk sebelum akhirnya Anisa masuk kembali ke dalam rumah.\"Anisa cantik kan?\" kata Kiai Faqih menggoda seraya terkekeh, \"Tapi aku tak ingin kamu menikahi Anisa karena kecantikannya. Aku ingin kamu menikahi Anisa dengan tulus karena Allah. Anisa ingin melihat keseriusanmu. Ia sempat kecewa karena penolakanmu kemarin. Untuk itu, Anisa meminta, jika kamu serius ingin menikah dengan Anisa, maka kamu harus melakukan satu hal sebelum Anisa menerimamu menjadi suaminya. Apa kamu mau melakukannya?\"\"Saya haru melakukan apa, Kiai?\"Kiai Faqih mengehla napas. Lalu terdia beberapa saat.\"Anisa ingin agar kamu melakukan mabit di Masjid Jami' Cukir. I'tikaf-lah di dalam masjid selama tiga malam berturut-turut, mulai ba'da Maghrib hingga Subuh. Dan jangan keluar masjid selama i'tikaf. tentu saja, siang hari kamu boleh melakukan aktivitas seperti biasanya. Allah Maha Mengetahui apa yang kita kerjakan. Apa kamu bersedia, Jar?\"Aku terdiam. Aneh. Anisa memintaku untuk mabit di Masjid Jami' Cukir. Ah, apapun itu, aku akan memenuhi permintaannya. Insya Allah tak sulit i'tikaf selama tiga malam berturut di masjid tanpa keluar masjid sekalipun? Ini ujian ataukah semacam pembalasan dendam karena kemarin aku sempat menolak menikah dengannya? Namun kini aku benar-benar mencintai Anisa? Fajar terus bertanya-tanya dalam hati. Ada kegamangan apakah ia bisa memenuhi permintaan Anisa yang menurutnya aneh-aneh itu. Kuatkan ia i'tikaf di dalam masjid tiga hari berturut-turut tanpa keluar masjid itu? Entahlah, waktu yang akan menjawabnya.",
  "genres": [],
  "author": "Muhammad Taufiq",
  "average_rating": "3.73",
  "url": "https://www.goodreads.com/book/show/11545450-mahar-cinta-untuk-anisa"
}