{
  "title": "Secret Worlds Boxed Set",
  "description": "Secret Worlds, a best-selling boxed set of spicy paranormal reads, is brought to you by twenty-one USA Today and Amazon Bestselling Authors!With twenty-one stories and over a million enchanting words of fiction, this paranormal romance boxed set will keep you spellbound.Dive through Secret Worlds and into the arms of heroes who will steal your heart and leave you hot.Ready to Turn Up the Heat?Whether you love paranormal romance that warms you up or sets you on fire, this boxed set will have something to entice your preternatural sensibilities.Supernaturally thrilling and engaging, this boxed set has it all: ghosts, vampires, mind-readers, shapeshifters, demons, faeries, werewolves, and more.Limited Edition, includes:Taken by the Beast by C. Kressley and R. Hamilton: Women who look a lot like Charisse are going missing. And the man this beauty is falling for may be the beast responsible.The Forever Girl by R. Hamilton: Sophia gets more than she bargains for when she finally decides to trust a shapeshifter.Summoned by Rainy K.: Dimitri can't reveal the paranormal bond controlling him, and Syd won't tolerate his secrets.Purgatory by S. Stec: A sex-hungry myth with no name, no flesh, and no identity ...unless it wears one of you.The Pandora Principle by N. Cosper: As a descendant of Pandora, Cassi must discover if her lover is one of the evil spirits she hunts before all her friends die.Heart Song by S. LaFantasie: When incredibly handsome Marren frees Relena, there's a catch.Changeling by D. Herbert: As a changeling and a witch work together to restore order in Fairy, they discover that love, like magic, casts its own spell.Shiftless by A. Easterling: After years of suppressing her inner predator, Terra meets a shifter who forces her to reclaim her wilder side.The Black Parade by Kyoko M: Poltergeist Michael is the key to saving Jordan's soul from hell, but can she handle the cost of her salvation?Haunting Echoes by C. Faron: Will Amaia's clan kill her ex-fiancé before she learns whether he returned from the grave for love or revenge?Braving Fate by L. Hall: Diana and Cadan fight demonic forces and a deadly passion that has lasted centuries.Trinity Rising by J.E. Taylor: Damian and Naomi are desperate for victory against the devil, but one wrong step could trigger Armageddon.Moonlight by K. Salidas: Good girls don't wear fur, fight over men, or run around naked, howling at the moon. But Fallon's not a good girl.Lash by L.G. Castillo: Lash must choose where to place his trust--in a home he fought so hard to regain or in a forbidden love he can't bear to lose.Between by L. Swallow: Alek could kill Rose with a kiss. Finn, with a touch. Pulled into an intense affair with Alek, Rose discovers her connection to Finn threatens them all.The Devil's Fool by R. McClellan: When vampire Boaz gives Eve the one thing she never had--love--she falls into a world of greed and seduction.Spark Rising by K. Corcino: A runaway Spark and the agent arresting her ignite a revolution to end their people's enslavement while resisting the electricity between them.Ruby's Fire by C. Stine: On the run from a desert cult, Ruby must choose which handsome stranger to trust with her heart and her darkest secret.Cursed by L. Leroux: Isobel has been hiding an uncanny ability her whole life--until the day she must use it to save herself from a madman.Hunted by A.J. Colby: With Agent Holbrook's help, Riley races time to stay ahead of a crazed werewolf killer.Vigilant by A. Lawson: Ari stumbles into a world of crime and vigilantism while discovering the one man that sets her heart on fire.",
  "genres": [],
  "author": "Rebecca  Hamilton",
  "average_rating": "3.97",
  "url": "https://www.goodreads.com/book/show/25300995-secret-worlds-boxed-set"
}