{
  "title": "Dinosaur Fantastic",
  "description": "Mike Resnick and Martin H. Greenberg have called upon such gifted writers as Robert Sheckley, Pat Cadigan, Frank M. Robinson, Judith Tarr, Mercedes Lackey, Larry Dixon, Bill Fawcett, Katherine Kerr, David Gerrold, and Kristine Kathryn Rusch to create these twenty-five stories of the most terrifying and fascinating creatures to ever inhabit the Earth: the dinosaurs. From their native Jurassic landscape to your own backyard, from their ancient mastery of the planet to modern-day curiosities trapped in an age not their own, from the earth-shaking tyrannosaur to the sky-soaring pterodactyl, here are unforgettable tales-some poignant, some humorous, some offering answers to the greatest puzzle of prehistory. But all are certain to capture the hearts and imaginations of dinosaur lovers of all ages.Contents:Introduction (Dinosaur Fantastic) • essay by Mike Resnick\"Just Like Old Times\" • Robert J. Sawyer\"Disquisitions on the Dinosaur\" • Robert Sheckley\"Dino Trend\" • Pat Cadigan\"The Greatest Dying\" • Frank M. Robinson\"Revenants\" • Judith Tarr\"One Giant Step\" • John E. Stith\"Last Rights\" • Mercedes Lackey and Larry Dixon\"After the Comet\" • Bill Fawcett\"Rex Tremandae and Majestatis\" • Kathe Koja and Barry N. Malzberg\"The Skull's Tale\" • Katharine Kerr\"Cutting Down Fred\" • Dean Wesley Smith\"Shadow of a Change\" • Michelle West [as Michelle M. Sagara]\"Wise One's Tale\" • Josepha Sherman\"Curren's Song\" • Laura Resnick\"Whilst Slept the Sauropod\" • Nicholas A. DiChario\"Rex\" • David Gerrold\"The Pangaean Principle\" • Jack Nimersheim\"On Tiptoe\" • Beth Meacham\"Betrayal\" • Susan Casper\"'Saur Spot\" • Kevin O'Donnell, Jr.\"Pteri\" • Lea Hernandez\"Chameleon\" • Kristine Kathryn Rusch\"Fellow Passengers\" • Barbara Delaplace\"Thirteen Ways of Looking at a Dinosaur\" • Gregory Feeley\"Evolving Conspiracy\" • Roger MacBride Allen",
  "genres": [
    "Science Fiction",
    "Short Stories",
    "Anthologies",
    "Fantasy",
    "Fiction",
    "Dinosaurs"
  ],
  "author": "Mike Resnick",
  "average_rating": "3.48",
  "url": "https://www.goodreads.com/book/show/1154584.Dinosaur_Fantastic"
}