{
  "title": "The Shell Keeper",
  "description": "In South Carolina, magic is as plentiful as sweet tea.  Thanks to her aunt’s unwanted generosity, policewoman Lei Texeira has embarked on a vacation—of the supernatural sort. She’s staying on the beach in a frothy mansion that resembles a baker’s confection. Pixie, a Southern belle with enough bling to open a shop on Rodeo Drive, manages the place.  When Pixie reveals a local woman reputed to have psychic powers wants to meet Lei, the invitation is anything but welcome.  What Lei discovers about the sorcery of belief, and the love promised to her future will begin to heal wounds she’s carried for far too long.  Q & A with the Author  What motivated you to write in the Lei Crime World?  I adore Toby Neal’s superb Lei Crime novels. I’m an adoptive parent, and the troubled family life surrounding Toby’s unique protagonist, Lei Texeira, are issues close to my heart. When I heard Lei Crime would become a new Kindle World, I jumped at the chance to contribute.  What was the inspiration behind The Shell Keeper?  I wanted to add elements of fantasy and magic to the Lei Crime series of police procedurals, which are set squarely in the mystery & thriller genre. As Lei evolves throughout the series, she carries grief and a sense of loss due to an abusive childhood. I enjoy writing stories that inspire readers to view the world in a positive light, and felt Lei’s background provided the perfect elements for an uplifting read. In The Shell Keeper, Lei begins healing wounds she’s carried for most of her young life.  When does The Shell Keeper take place?  We meet Lei two weeks before she joins the South Hilo PD in Hawaii. She’s preparing to move from her aunt’s home in California to Hawaii. The vacation she takes in South Carolina is totally unexpected, a surprise gift from her aunt.  Will you write other stories in the Lei Crime World?  Count on it! The Shell Keeper is my first foray into magical realism, a genre I’ve thoroughly enjoyed exploring, and The Shell Keeper begs for a second, longer installment. I’ve already begun work on Lei’s Magic, Part Two.",
  "genres": [],
  "author": "Christine Nolfi",
  "average_rating": "4.64",
  "url": "https://www.goodreads.com/book/show/25314459-the-shell-keeper"
}