{
  "title": "If the Oceans Were Ink: An Unlikely Friendship and a Journey to the Heart of the Quran",
  "description": "PULITZER PRIZE FINALIST  • NATIONAL BOOK AWARD FINALIST • Hailed by The Washington Post as “mandatory reading,” and praised by Fareed Zakaria as “intelligent, compassionate, and revealing,” a powerful journey to help bridge one of the greatest divides shaping our world today.If the Oceans Were Ink is Carla Power's eye-opening story of how she and her longtime friend Sheikh Mohammad Akram Nadwi found a way to confront ugly stereotypes and persistent misperceptions that were cleaving their communities. Their friendship-between a secular American and a madrasa-trained sheikh-had always seemed unlikely, but now they were frustrated and bewildered by the battles being fought in their names. Both knew that a close look at the Quran would reveal a faith that preached peace and not mass murder; respect for women and not oppression. And so they embarked on a yearlong journey through the controversial text.A journalist who grew up in the Midwest and the Middle East, Power offers her unique vantage point on the Quran's most provocative verses as she debates with Akram at cafes, family gatherings, and packed lecture halls, conversations filled with both good humor and powerful insights. Their story takes them to madrasas in India and pilgrimage sites in Mecca, as they encounter politicians and jihadis, feminist activists and conservative scholars. Armed with a new understanding of each other's worldviews, Power and Akram offer eye-opening perspectives, destroy long-held myths, and reveal startling connections between worlds that have seemed hopelessly divided for far too long.Praise for If the Oceans Were Ink“A vibrant tale of a friendship.... If the Oceans Were Ink is a welcome and nuanced look at Islam [and] goes a long way toward combating the dehumanizing stereotypes of Muslims that are all too common…. If the Oceans Were Ink should be mandatory reading for the 52 percent of Americans who admit to not knowing enough about Muslims.”—The Washington Post“For all those who wonder what Islam says about war and peace, men and women, Jews and gentiles, this is the book to read. It is a conversation among well-meaning friends—intelligent, compassionate, and revealing—the kind that needs to be taking place around the world.”—Fareed Zakaria, author of The Post-American World“Carla Power’s intimate portrait of the Quran, told with nuance and great elegance, captures the extraordinary, living debate over the Muslim holy book’s very essence. A spirited, compelling read.”—Azadeh Moaveni, author of Lipstick Jihad“Unique, masterful, and deeply engaging. Carla Power takes the reader on an extraordinary journey in interfaith understanding as she debates and discovers the Quran’s message, meaning, and values on peace and violence, gender and veiling, religious pluralism and tolerance.”—John L. Esposito, University Professor and Professor of Islamic Studies, Georgetown University, and author of The Future of Islam“A thoughtful, provocative, intelligent book.”—Diana Abu-Jaber, author of Birds Of Paradise and The Language of Baklava",
  "genres": [
    "Nonfiction",
    "Islam",
    "Religion",
    "Memoir",
    "Philosophy",
    "History",
    "Book Club"
  ],
  "author": "Carla Power",
  "average_rating": "4.11",
  "url": "https://www.goodreads.com/book/show/25310933-if-the-oceans-were-ink"
}