{
  "title": "Become the Woman of Your Dreams!",
  "description": "Half an hour ago, you were in a rut, a rut so deep you couldn't see anything in your future beyond another evening on the couch. Your transformation into a woman has opened your eyes to the endless possibilities before you. Just thinking about it makes you kinda dizzy.The world is your oyster! What are you going to do with your newfound freedom? *Go shopping for some sexy new clothes.*Explore your new body.*Check out the local nightlife.Aurora Sparks, the emerging erotica writer behind gender-bending hits like \"Gender Swapocalypse\" and \"How to Get Pussy Without Even Trying,\" is proud to present her debut game book, the first-ever interactive gender transformation novel.In Become the Woman of Your Dreams!, you step into the role of a typical city-dweller with a boring white-collar job and a lackluster love life. One evening after work, while walking to the train, you notice a sign on a storefront advertising instant sex changes for a cool $5. Inside, you meet a mysterious fortuneteller who asks you to close your eyes and envision your ideal woman. Is she blonde, brunette, black-haired or a redhead? Slender, voluptuous or somewhere in the middle? You get to decide. When you open your eyes, you're shocked to discover that you've been transformed into the gorgeous female you described!What do from there is entirely up to you. Clocking in at 35,000 words, Aurora Sparks's latest opus boasts 30 unique endings and almost infinite ways to reach them. In its virtual pages, you’ll experience everything from shopping sprees to intimate encounters beyond the veil. You’ll give blowjobs to crooked cops, experiment with BDSM and take part in a massive orgy. You’ll marry a shark. You’ll become a nun. You’ll meet a billionaire with a thirst for human blood, a man made entirely of sugar and a housecat in a $5,000 suit... that is, if you're dedicated and ingenious enough to uncover all of the book's secrets.Sexy, surreal and often hilarious, Become the Woman of Your Dreams! offers one of the most entertaining (and erotic) reading experiences in years!",
  "genres": [],
  "author": "Aurora Sparks",
  "average_rating": "3.27",
  "url": "https://www.goodreads.com/book/show/25312421-become-the-woman-of-your-dreams"
}