{
  "title": "Invisible Girl",
  "description": "What is it like to be a teen with depressed addicts for parents, a mentally ill sister, and a grandfather who killed himself? In this moving, compelling diary, Mariel Hemingway writes as her teen self to share her pain, heartache, and coping strategies with young readers.“I open my eyes. The room is dark. I hear yelling, smashed plates, and wish it was all a terrible dream.” Welcome to Mariel Hemingway’s intimate diary of her years as a girl and teen. In this deeply moving, searingly honest young adult memoir, actress and mental health icon Mariel Hemingway shares in candid detail the story of her troubled childhood in a famous family haunted by depression, alcoholism, mental illness, and suicide. Born just a few months after her grandfather, Ernest Hemingway, shot himself, Mariel’s mission as a girl was to escape the desperate cycles of debilitating mental health that had plagued generations of her family. In a voice that speaks to young readers everywhere, she recounts her childhood growing up in a family tortured by alcoholism (both parents), depression (her sister Margaux), suicide (her grandfather and four other members of her family), schizophrenia (her sister Muffet), and cancer (mother). It was all the young Mariel could do to keep her head. She reveals her painful struggle to stay sane as the youngest child in her family, and how she coped with the chaos by becoming OCD and obsessive about her food. Young readers who are sharing a similar painful childhood will see their lives and questions reflected on the pages of her diary—and they may even be inspired to start their own diary to channel their pain. Her voice will speak directly to teens across the world and tell them there is light at the end of the tunnel. • A hugely important subject for millions (around 10% of Americans suffer from depression) of young adults who are perhaps growing up in families with mental illness, suicide, depression, schizophrenia, alcoholism, and depression, or who themselves suffer from it. • Very few memoirs speak directly to YA readers about mental illness, depression, and what it is like growing up in a troubled family. • Mariel Hemingway speaks honestly about her own experiences with depression, eating disorders, and OCD, and how she learned to overcome these issues.",
  "genres": [
    "Memoir",
    "Nonfiction",
    "Biography"
  ],
  "author": "Mariel Hemingway",
  "average_rating": "3.51",
  "url": "https://www.goodreads.com/book/show/25314655-invisible-girl"
}