{
  "title": "Mammy: A Century of Race, Gender, and Southern Memory",
  "description": "\"An engaging study of 'mammy,' the provocative figure of the African American nanny, cook, and housekeeper in white households . . . Wallace-Sanders reveals . . . disturbing innuendos of mammy still relevant today, in particular the elevation in value of raising others' children at the expense of one's own.\"--- Choice\"In this insightful analysis of representations of mammy, Wallace-Sanders skillfully illustrates how this core icon of Black womanhood has figured prominently in upholding hierarchies of race, gender, and class in the United States. Far from being a timeless, natural, benign image of domesticity, the idealized mammy figure was repeatedly reworked to accommodate varying configurations of racial rule. No one reading this book will be able to see Gone with the Wind in the same way ever again.\"---Patricia Hill Collins, University of Maryland \"Kimberly Wallace-Sanders' interdisciplinary approach is first-rate. This expansive and engaging book should appeal to students and scholars in American studies, African American studies, and women's studies.\"---Thadious Davis, The University of PennsylvaniaHer cheerful smile and bright eyes gaze out from the covers of old cookbooks, song sheets, syrup bottles, salt and pepper shakers, and cookie jars, and she has long been a prominent figure in fiction, film, television, and folk art. She is Mammy, a figure whose provocative hold on the American psyche has persisted since before the Civil War. But who is Mammy, and where did she come from? Her large, dark body and her round smiling face tower over our imaginations to such an extent that more accurate representations of African American women wither in her shadow. Mammy's stereotypical attributes---a sonorous and soothing voice, raucous laugh, infinite patience, self-deprecating wit, and implicit acceptance of her own inferiority and her devotion to white children---all point to a long-lasting and troubled confluence of racism, sexism, and southern nostalgia. This groundbreaking book traces the mammy figure and what it has symbolized at various historical moments that are linked to phases in America's racial consciousness. The author shows how representations of Mammy have loomed over the American literary and cultural imagination, an influence so pervasive that only a comprehensive and integrated approach of this kind can do it justice. The book's many illustrations trace representations of the mammy figure from the nineteenth century to the present, as she has been depicted in advertising, book illustrations, kitchen figurines, and dolls. The author also surveys the rich and previously unmined history of the responses of African American artists to the black mammy stereotype, including contemporary reframings by artists Betye Saar, Michael Ray Charles, and Joyce Scott. Kimberly Wallace-Sanders is Associate Professor of the Graduate Institute of Liberal Arts and Women's Studies at Emory University. She is editor of Skin Deep, Spirit The Black Female Body in American Culture .",
  "genres": [
    "Race",
    "History",
    "Gender",
    "Nonfiction"
  ],
  "author": "Kimberly Gisele Wallace-Sanders",
  "average_rating": "4.29",
  "url": "https://www.goodreads.com/book/show/2531278.Mammy"
}