{
  "title": "For the King and Elven Empire",
  "description": "It was supposed to be a simple trip to the High Elven Kingdom. It started out simply enough, with Gabriel, Eden and their children, accompanying King Elrohir and his bride. They were going to spend some time visiting, some time exploring, and doing a little work on the forest. Nothing, however, seems to ever go smoothly with the Eagle Claw clan and what started off as a simple trip, turned into a nightmare as their children disappear while working in the forest. Eden and Gabriel are frantic; they don’t know which way to turn. Who do they blame for the abduction of their family? Where are their children? Why can’t they touch their life forces? They join their talents and go on a search, calling in every resource they can, but get no results. They reach out to to Empire for help, to use force if necessary. That is quickly brought under control as Lothrariel arrives. It is not a popular decision, as far as the grieving parents are concerned.At Gabriel's command, the Kings and Queens lead their armies into the High Elven Kingdom, but it is not Gabriel who will take the lead; it is Lothrariel, as they find he has finally regained his ancient powers. He searches for answers, but a power as ancient as his has hidden the answers. Who has done this? Why?While Lothrariel tries to calm the irate parents, he greets the members of the council and their consorts in the High Kingdom, the children work behind the scenes to regain their freedom with the help of their friends. There is only one Elf can reach the children where they are, S’Larea. It is she who will lead Lothrariel to the edge of the land where they are hidden, and it is he who will shatter the shield that holds them prisoner. As things come together the Eagle Claw children work their magic on those who have taken them, while S’Larea gathers their friends and rides to their rescue. Will the High Elven Kingdom ever be the same after they are through?",
  "genres": [
    "Fantasy"
  ],
  "author": "M.A. Abraham",
  "average_rating": "4.26",
  "url": "https://www.goodreads.com/book/show/25309153-for-the-king-and-elven-empire"
}