{
  "title": "The SHIVA Syndrome",
  "description": "Goodreads Readers:\"The Shiva Syndrome is in the top 10 books of the best sci-fi/fantasy books I have read in over 40 years and I read over 200 books a year!\"\"a riveting, page-turner, right from the start!\"\"Awesome, awesome, totally Awesome!!!\"\"Not your typical Sci-fi thriller...One of the best books of 2015\"----------------------------------------------Beau Walker is a man without a field. Teaching at a backwater university after being dismissed from a government project because of his ethical concerns and bureaucratic maneuvers on the part of a one-time friend, Walker is an academic pariah until two soldiers appear one day. His former friend needs Walker’s expertise, and the professor—who is haunted by both his empathic abilities and the memory of the one time they failed him—has little choice but to cooperate. In the Russian city of Podol’sk, a project partially based on Walker’s work has gone horribly awry, killing thousands and leaving traces of mysteries that threaten humanity’s scientific understanding. Discovering what occurred, and how to prevent it from happening again, falls on Walker and his new friends...But as secrets and revelations accumulate, the team’s combined knowledge and abilities may be inadequate to stop what’s coming. What happens when science kicks open the door for humans to reach god-like powers of creation and destruction? When human consciousness is made so powerful that it annihilates a city of thousands and impacts the moon's orbit? Blending the paranormal and science fiction in a thrilling mystery, Walker and his team race to find the key to SHIVA facing military intrigues and supernormal assassins. What is at stake? The eradication of life on earth by thought alone. Are you equipped to face the unthinkable?--------------------------------------------------------------------------------------------------Finalist: EPIC (Electronic Publishing Internet Coalition) 2016Finalist: International Book Awards 2016",
  "genres": [
    "Paranormal",
    "Science Fiction",
    "Fantasy"
  ],
  "author": "Alan Joshua",
  "average_rating": "4.27",
  "url": "https://www.goodreads.com/book/show/25308738-the-shiva-syndrome"
}