{
  "title": "Hikertrash: Life on the Pacific Crest Trail",
  "description": "Teetering awkwardly on the brink of insanity, unable to handle life in snowy, cold, ultra-conservative North Idaho, Carl and Erin sold their house and set out in search of a new place to call home. Suddenly finding themselves completely free of responsibilities, jobless, and with a little spare cash in the bank, it didn’t take long before their serious search for a new life took some unexpected twists and turns.“What do you think we should do when we return to the States?” Erin asked Carl, as they sat outside a tiny café sipping coffee. It was a question that had been plaguing her for weeks as they budget travelled across South East Asia in an attempt to avoid winter (and reality).“I’ve been thinking about it, and I think we should thru-hike the Pacific Crest Trail.” Was Carl’s totally unexpected reply.Spend months on end traipsing through the wilderness, petting bunnies and chasing rainbows, as they hiked 2,660 miles from Mexico to Canada? How could Erin possibly say no? Life Rule #1: Never, ever, turn down an adventure.Friends wagered they wouldn’t last a week, but before they knew it, days turned into months as they made their way across America at three miles an hour. As Carl and Erin morphed into Bearclaw and Hummingbird, they found that being hikertrash suited them.Though they will both admit the trail was life altering, there were no great epiphanies, no magic answers to all of life’s burning questions, no “ah-ha!” moments when suddenly life made sense. This is not a tale of personal growth.Through blisters and shin splints, jaw-dropping landscapes and craptastically unspectacular forests, searing heat and pouring rain, complete hilarity and utter exhaustion, this is the story of what day-to-day life is really like on one of America’s greatest trails.As told through Hummingbird's journal entries, this is the story of life on the trail - the people you meet, the things you see, and how, mile by mile, you eventually become Hikertrash.• 6 Overview Maps to Follow our Journey• 19 Black & White Photos of Sights Along the Trail• Leave No Trace Tips• Our Gear Lists• Our Trail RecipesWhat Is Hikertrash? a long distance hiker, shabby and homeless in appearance, rarely bathed and rank in odor, more at home outdoors than in society, with a deep reverence and respect for all things wild.",
  "genres": [
    "Nonfiction",
    "Travel",
    "Memoir",
    "Adventure",
    "Outdoors",
    "Nature",
    "Biography Memoir"
  ],
  "author": "Erin     Miller",
  "average_rating": "4.13",
  "url": "https://www.goodreads.com/book/show/25320276-hikertrash"
}