{
  "title": "Heroes R Us",
  "description": "A SUPERHERO ADVENTURE FROM THE AUTHOR OF THE AMAZON.COM #1 SCI-FI BESTSELLER, ALICE IN DEADLAND SOON TO BE A MAJOR MOTION PICTURE PRODUCED BY THE ANIL KAPOOR FILM COMPANY IN INDIAFirst published in paperback as 'Herogiri' by Random House India, 2010.What happens when fate chooses an ordinary man for an extraordinary mission?Arnab Bannerjee has little excitement in his life other than tracking down missing books as the Assistant Librarian in a small college in Delhi. All that changes one day when he is beaten and left for dead after a robbery. Arnab awakens to discover that he has developed fantastic superhuman powers and he tries to master his new¬found powers and to use them for good. As a hooded superhero he takes to the streets on a one-man crusade against injustice. However he soon realizes that in a society where the only power that matters comes from having money or the right connections, one man, even a superhero, can make little difference.When he embarks on a final, desperate mission, he realizes that to succeed, he has to become a part of the very system he loathes by tapping into a motley set of allies such as the Minister who wants to use his powers to rig elections, the corrupt policeman who shot Arnab for exposing him and the corporate tycoon who wants to sign him up as a brand ambassador!At one level, Heroes R Us seeks to entertain with a delightfully contemporary take on the superhero genre, and at another level it asks the provocative question of whether in the dark and corrupt times we live in, there is any place left for heroes. Slumdog Millionaire meets Spiderman in this exciting novel that will entertain and make you think at the same time.BONUS CONTENT in this The Making of Heroes R Us- the origin of this novel in the author's own words- Free sample of Vimana, the science fiction thriller by Mainak DharPraise for the paperback \"Strikes a chord somewhere, chronicling his journey from a nobody into a somebody and this theme for a dream - to dream big, rather - is what makes it endearing. Overall an honest attempt, Dhar tries to weave the superhuman existence with contemporary; Leaves the reader with the feeling that hope floats, after all!\"- IBN Live\"The plot, thereafter, is engaging, and wholesome Bollywood film material. Herogiri ends on a high note, the action sequence in the stadium is confusing but exciting.\"- Hindustan Times\"A delightful take on the superhero genre.\"- LiveMint\"Excellent balance between super powers and what they leave out, Herogiri also has a surprisingly refreshing take on politics and society. Arnab 'GA' Bannerjee is the unpretentious hero you want by your side.... The most super man ever, this affable, retiring 25-year old is possibly the most likeable of all characters you shall meet this summer.\"- Financial Express\"Here's a delightfully engaging and refreshing take on the superhero genre.... racy good versus evil roller coaster\"- Mid Day\"Exhilarating!\"- Tehelka Magazine",
  "genres": [
    "Superheroes",
    "Science Fiction",
    "Urban Fantasy",
    "Fantasy"
  ],
  "author": "Mainak Dhar",
  "average_rating": "3.48",
  "url": "https://www.goodreads.com/book/show/11547132-heroes-r-us"
}