{
  "title": "Heresy: A guide to Challenge Your Beliefs!™ and create happiness in your life",
  "description": "What’s Keeping You from the Happiness You Deserve?  Learn How to Transform Your Life by Challenging the Self-Limiting Beliefs you Carry Around We all have a set of beliefs about ourselves, about how the world works, and about what we deserve out of life. But, often we don’t realize that we are holding ourselves back. If you’ve ever felt blocked in life or felt that there has to be more to life, this book is for you.Author AnaMaria Rivera helps you learn to change your mindset by challenging the paradigms that guide your everyday life.Heresy is about challenging the mental framework you’ve unintentionally created and then creating a new reality with purpose and direction. It’s a guidebook to a better life.Inside this book you will learn: \n   \n     How to discover what self-limiting beliefs you have \n   \n   \n     The best ways to increase your self-confidence \n   \n   \n     How to transform your thoughts \n   \n   \n     What you need to do to create a new reality \n   \n   \n     How to harness the power of hope \n   \n   \n     What you can do to channel anxiety \n   \n   \n     How to simplify your life by simplifying your thoughts \n   \n   \n     How to make the future of your dreams your current reality \n   \n   \n     The power of forgiveness \n   \n   \n     The best ways to overcome doubt \n   \n   \n     And Much More! \n   \n You don’t have to be a prisoner of your thoughts and self-limiting beliefs. You have the key to free yourself from the prison you’ve inadvertently created for yourself. This book will show you where to find your key and how to use it to free yourself.If you’re looking for quick fixes or magic solutions, this book isn’t for you. But, if you want to be happier and are willing to do the work required to change your thoughts, this book will change your life. Your Best Life is Waiting for You! Order Your Copy Right Now!",
  "genres": [],
  "author": "AnaMaria Rivera",
  "average_rating": "4.81",
  "url": "https://www.goodreads.com/book/show/25319352-heresy"
}