{
  "title": "رحلة للسعادة",
  "description": "الكل يبحث عن السعادة في هذه الحياة.. ولكن هناك عثرات ومشاكل تفقدنا السعادة... وفي هذا الكتاب يأخذك الداعية \"عمرو خالد\" في رحلة للسعادة \"طريقة جديدة لمن يريد وسط هذه الآلام والأحزان أن يعيش حياة تملؤها الطمأنينة والأمل والتفاؤل والأمان والفرحة والابتسامة والسعادة... رحلة للسعادة كتاب يقول لك: السعادة ليست في الجنة فقط، ولكنك في هذه الحياة تستطيع إذا جربت رحلتنا أن تعيش أيضاً سعيداً... \"رحلة للسعادة\" يعرّفك أن السعادة: أربعة أجزاء، جزء روحي، جزء نفسي، جزء مفاهيم عقلية، جزء مادي... كتاب \"رحلة للسعادة\" فيه سر مختلف عن كل ما فهمناه وعرفناه عن السعادة لأن الناس عادة تحصر السعادة في شيء واحد لو تحقق تظن أنه السعادة؛ مثل الرضا أو جمع شمل العائلة أو الأصحاب أو الصحة أو المال، لكن سر السعادة في كتابنا أنها خليط من سبع مجموعات متكاملة، لو نقصت واحدة من هذه المجموعات السبع لفقدنا السعادة ولشعرنا بالهم والحزن ونحن لا ندري لماذا، والسر هو أنك يجب أن تستكمل المجموعات السبع للسعادة التي لُوّنت في البرنامج التلفزيوني للدلالة على معانيها وهذا ما سيقدمه لك الكتاب. رحلة للسعادة سيضيء لك أنوار ومشاكل وشموع من كلام رسول الله صلى الله عليه وسلم وأفعاله، تضيء لك ظلمة الحياة فترى النور.. ستعيش مع رسول الله في كل مجموعة من المجموعات السبع لترى كيف ينير لك أضواء ومشاكل في كل مجموعة منها.. يعتبر الداعية عمرو خالد أن \"الحب أقوى سلاح في الدنيا.. تريد أن تغير.. أن تصلح الدنيا.. تريدين أن تُغيّري.. سلاح الحب أقوى من سلاح القوة.. تريد إصلاح أولادك.. سلاح الحب أقوى من سلاح العقوبة.. أنت لو عندك أعداء تستطيع أن تقاتلهم وأنت أعزل بالحب وهم مدججون بالسلاح.. قاتل أعداءك بالحب، واكسب الناس كلها بالحب، واجمع حولك زوجتك وأولادك وأهلك بالحب، واجه عقد مشاكلك بالحب. نفّذ هذا في شركتك.. أنت تعرف الإدارة بالأهداف والإدارة بالتحفيز والإدارة... لكن إدارة اسمها الإدارة بالحب. الحب أفضل وسيلة لتوجيه أولادك.. قدم الحب.. الحب أفضل وسيلة للتعليم والتوجيه، وجه الناس عن طريق الحب أولاً، غلّف نصائحك بالحب وحفز الشباب بالحب...\".",
  "genres": [
    "Islam",
    "Religion"
  ],
  "author": "عمرو خالد",
  "average_rating": "3.91",
  "url": "https://www.goodreads.com/book/show/11547041"
}