{
  "title": "At The Sharp End of Lightning",
  "description": "AT THE SHARP END OF LIGHTNING.The novel is a crossover fantastical tale that weaves and bursts beyond its genre.One of the two central characters is a Sea Sprite who happens to be a lightning attractor...and likes it.The other is a restless youth, afflicted with a disease of the blood, perplexed as to why a fulminating man in a white suit would try to kill him. It is set across the seas of the Atlantic Ocean and adjacent lands, from the medieval past to the near future, and across intricately connected worlds--and yet timely for the issues of today.It is a serious book about ocean ecology and climate change but set amidst issues of family, of loss and sacrifice, of unexpected gifts and coping with disability and new abilities. About ritual and doubt. About myth, celtic legends and about reshaping of history.It is about how the world might be at the end of the century after the planet has warmed and the oceans have acidified. Book DescriptionAT THE SHARP END OF LIGHTNING is the tale of family, of loss and sacrifice, of unexpected gifts and coping with disability and new abilities set against the backdrop of climate change occurring across parallel worlds. The intertwined worlds of Oceanlight and Earth are no longer hidden from view of each other. In one realm, Yalara Narika, a winged Sea Sprite, searches for her family and she encounters a deadly blue haze at sea. Escaping the poison makes her realize that her world, Oceanlight, is experiencing sudden and catastrophic environmental change. Meanwhile, in the safe suburban normality of North Wales, Einion Morgan Alban, a restless youth with haemophilia, is nearly murdered by a man in a white suit who intentionally shoves him off a cliff. If Yalara and Einion don't uncover the connections between their worlds and near-deaths, it will have dire consequences for the worlds they live in. Book one of the OCEANLIGHT series.",
  "genres": [
    "Fantasy",
    "Paranormal"
  ],
  "author": "N.R. Bates",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/25324761-at-the-sharp-end-of-lightning"
}