{
  "title": "The Last Weynfeldt",
  "description": "Adrian Weynfeldt is an art expert in an international auction house, a bachelor in his mid-fifties living in a grand Zurich apartment filled with costly paintings and antiques. Always correct and well-mannered, he's given up on love until one night—entirely out of character for him—Weynfeldt decides to take home a ravishing but unaccountable young woman. The next morning, he finds her outside on his balcony threatening to jump. Weynfeldt talks her down and soon finds himself falling for this damaged but alluring beauty and his buttoned up existence comes unraveled. As their two lives become entangled, Weynfeldt gets embroiled in an art forgery scheme that threatens to destroy everything he and his prominent family have stood for. This refined page-turner moves behind elegant bourgeois facades into darker recesses of the heart.Martin Suter, born in Zurich in 1948, is a novelist and screenwriter. He has written a dozen novels, many of them bestsellers in Europe and translated into thirty-two languages. Suter lives with his family in Zurich.\"Fans of sensitive, slightly aloof Euro-thrillers—think Stefan Zweig or filmmaker Claude Chabrol—will recognize the metier of Swiss writer Suter, who here leavens the sensationalism of crime fiction with psychological insight and melancholy ... Comfort food for readers who crave memorable characters, romance, and touching, drawn-from-life scenes.\"—Publishers Weekly\"Swift, edgy ... What distinguishes this work is the air of slightly faded existential elegance, which sets off the modern setting splendidly ... Great for sophisticated suspense fans.\"—Library Journal (Starred review)\"Fine art, fine wine, and old money collide with forgery and extortion in Zurich ... Subtly wrought.\"—Kirkus Reviews\"The Last Weynfeldt is a must-read. . . . Once started, you will not stop reading until the end. You will probably forget to eat, not answer text messages and miss your stop on the bus.\"—Süddeutsche Zeitung\"Set in the midst of that vibrant and bizarre organism known as the art world. A captivating read about a memorable protagonist.\"—Noah Charney, author of The Art of Forgery and The Art Thief\"A brilliant talent!\"—Basler Zeitung",
  "genres": [
    "Fiction",
    "German Literature",
    "Roman",
    "Contemporary",
    "Art",
    "Crime",
    "Mystery"
  ],
  "author": "Martin Suter",
  "average_rating": "3.94",
  "url": "https://www.goodreads.com/book/show/25329990-the-last-weynfeldt"
}