{
  "title": "Wildlife",
  "description": "In the Everglades, some sights aren't meant to be seen... Deep in the Florida Everglades, a horrific accident ignites a deadly feud between two families. Meanwhile, a vacationing family takes a boat ride into the isolated wilds of the Everglades, only to become unwitting witnesses to a brutal crime. Now, as night falls, forced to travel on foot, they must flee through the treacherous wilderness while avoiding the dangerous wildlife...and the far more lethal human predators that are hunting them. From the award-winning author of the bestselling Bad Games series comes a heart-stopping new foray into terror like nothing you've ever read. What readers are saying about Jeff Menapace and the Wildlife  \"Could not put it down! Good job of capturing the underlying fear most of us have of gators, snakes, and Deliverance style backwoods.\" ★★★★★ “Menapace will become a household name along with Stephen King, Dean Koontz, and Richard Laymon.\" ★★★★★ \"I have been a lifetime reader of Dean Koontz, Stephen King, James Patterson, Lisa Gardner, and various other suspense and horror authors...I have found a new author to add to my list of greats.\" ★★★★★ “Sharp and fast, the pace reminded me of Jack Ketchum's Off Season.” ★★★★★ \"If you like Stephen King, Blake Crouch, or Dean Koontz, then you'll love Jeff Menapace. ★★★★★ “The best horror novel I've read in a long time. If you are a King, Koontz fan, this ranks right up there.” ★★★★★ “Fast paced read, reminding me a lot of Edward Lee and Jack Ketchum.” ★★★★★ “Reminded me of a tale Jack Kilborn, J.A. Konrath might conjure up.” ★★★★★ \"If you love J.A. Konrath, Jack Kilborn, and Blake Crouch, you'll love Jeff Menapace.\" ★★★★★ \"FIVE STARS...I would recommend this book to any fan of Richard Laymon or Jack Ketchum.\" ★★★★★ \"Compares to my favorite writers Stephen King, Dean Koontz, and John Saul.\" ★★★★★ \"Richard Laymon would be proud.\" ★★★★★ “One of my new favorite authors. Fantastic read! Very King like.” ★★★★★ \"Excellent read! Similar to the style of Dean Koontz.\" I hope you enjoy the first book in the Wildlife series, my friends. This series is ideal for fans of authors across several different blends of dark fiction! Authors Stephen King, Dean Koontz, Richard Laymon, James Patterson, John Saul, Jack Ketchum, J. A. Konrath, Karin Slaughter, Lisa Unger, Lisa Gardner, Blake Crouch, Edward Lee, Brian Keene, Bryan Smith, J. F. Gonzalez, L.T.",
  "genres": [
    "Horror",
    "Thriller",
    "Fiction",
    "Suspense",
    "Mystery Thriller",
    "Mystery"
  ],
  "author": "Jeff Menapace",
  "average_rating": "4.05",
  "url": "https://www.goodreads.com/book/show/25322556-wildlife"
}