{
  "title": "The Translator: A Tribesman's Memoir of Darfur",
  "description": "I am the translator who has taken journalists into dangerous Darfur. It is my intention now to take you there in this book, if you have the courage to come with me.The young life of Daoud Hari–his friends call him David–has been one of bravery and mesmerizing adventure. He is a living witness to the brutal genocide under way in Darfur.The Translator is a suspenseful, harrowing, and deeply moving memoir of how one person has made a difference in the world–an on-the-ground account of one of the biggest stories of our time. Using his high school knowledge of languages as his weapon–while others around him were taking up arms–Daoud Hari has helped inform the world about Darfur.Hari, a Zaghawa tribesman, grew up in a village in the Darfur region of Sudan. As a child he saw colorful weddings, raced his camels across the desert, and played games in the moonlight after his work was done. In 2003, this traditional life was shattered when helicopter gunships appeared over Darfur’s villages, followed by Sudanese-government-backed militia groups attacking on horseback, raping and murdering citizens and burning villages. Ancient hatreds and greed for natural resources had collided, and the conflagration spread.Though Hari’s village was attacked and destroyedhis family decimated and dispersed, he himself escaped. Roaming the battlefield deserts on camels, he and a group of his friends helped survivors find food, water, and the way to safety. When international aid groups and reporters arrived, Hari offered his services as a translator and guide. In doing so, he risked his life again and again, for the government of Sudan had outlawed journalists in the region, and death was the punishment for those who aided the “foreign spies.” And then, inevitably, his luck ran out and he was captured. . . .The Translator tells the remarkable story of a man who came face-to-face with genocide– time and again risking his own life to fight injustice and save his people.",
  "genres": [
    "Nonfiction",
    "Africa",
    "Memoir",
    "Sudan",
    "History",
    "Biography",
    "War"
  ],
  "author": "Daoud Hari",
  "average_rating": "3.93",
  "url": "https://www.goodreads.com/book/show/2532618.The_Translator"
}