{
  "title": "Evolution",
  "description": "Théoden: Dante is within my grasp. I'm actually very excited to meet my future son. He's got wolf's blood flowing within his veins, so I know he'll be the stubborn sort, but I do like a challenge. As for Deacon, the wolf Alpha has surprised me. I hadn't expected him to locate Dante so quickly. He's a cunning one I'm going to have to keep my eye on. His ambition is both admirable and dangerous. As for my King's decree, things are moving along smoothly. I have two more children to sire and then I would have fulfilled my duty. The sooner I'm done with that, the quicker I can get to training my new child. I'm so looking forward to breaking him in.   Noel: As for my obligation to the King, I met his expectations. I've sired my first son and it's been one hell of an experience. I thought I would feel overwhelmed, but Romeo is taking to this life so naturally. I guess you could say that I chose wisely. I'm also getting the hang of being in control and being his Father. No doubt, Marco's training is seeing me through a lot of transition. Now, I have to hold up my part in the bargain Théoden made with Deacon. Can't say I'm happy about being used as a bargaining chip, but it's out of my hands. As for my training with Marco, he's promised to put me through the ringer physically. I'm ready to learn more and grow stronger.  Warning: This serial contains strong adult content not meant for sensitive eyes. The novelettes in this serial will be filled with dark, twisted, raunchy and steamy scenes between powerful, sexy men that will either offend you or get ya revved up. This series will not be pulling any punches, and it won’t apologize for hurting your feelings, either. You’ll find no fluff and ruffles here. The vampires are not misunderstood, hopeless romantics looking for love. The werewolves are not cute and cuddly and the dragons aren’t the ones from your childhood. This is NOT a romance. There are approximately 34,600 words in this novelette.",
  "genres": [],
  "author": "Nicholas Bella",
  "average_rating": "4.37",
  "url": "https://www.goodreads.com/book/show/25324975-evolution"
}