{
  "title": "May All Your Names Be Forgotten",
  "description": "May All Your Names Be Forgotten: Pacy Crime Thriller with Touches of Inky-Black Humour & Tragedy in the Cold-Call Game.Michael Connor’s novel set in 1990s south London exposes the tricks and deceit used by cold callers to dupe businesses into purchasing low value goods at highly inflated prices and then bullying them into buying more. Known in the trade as the ‘directory game’ many of the tricks, although now illegal, are still used.Many people still dread their phone ringing. When the internet was still in its infancy, computer systems were not so integrated and call monitoring not so prevalent - a target could not easily verify what he or she was being told – and probably didn’t feel they needed to if the voice on the other end sounded convincing. In Michael Connor’s new novel, trickster Danny and his crew are especially convincing, working from scripts designed to extract a sale - whatever the occasion.‘May All Your Names Be Forgotten’ - a fast moving crime thriller set in south London containing as many pointers for budding telesales staff prepared to break the rules as it does for the ordinary citizen seeking to avoid being hustled. The author takes each of the characters and explores what makes them tick, then exposes their weaknesses, allowing the reader under their skin as their personal fears cut deep. Threats of violence, extortion, outrageous capers, and the constant worry of ‘the man’ who Danny manages to keep at bay by greasing palms. Sad moments with splashes of inky-black humour.Connor tells us ‘the game has changed, technology has made personal details easier to obtain and the Data Protection Act is no guarantee of protection. Businesses are less the target now – integrated systems and instant recall. Mr & Mrs Bloggs just sitting down to tea are more likely the targets today. A plausible script, a friendly voice, and an offer too good to miss. You have been warned.’",
  "genres": [],
  "author": "Michael Connor",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/25334403-may-all-your-names-be-forgotten"
}