{
  "title": "Censorship Now!!",
  "description": "\"While putting a copy of this book on your nightstand would be a sign of good taste, who cares about good taste? Are you willing to be seen reading a book titled Censorship Now!! in public? If so, your skin might burn with funny glances from squares, scolds and looky-loos. But on the inside, you'll feel your brain throbbing as it swells to accommodate some hilarious, absurd and radical new strategies on how to live in our ridiculous world.\"-- Washington Post \"Svenonius' new book is Censorship Now!! , and the title alone shows just how provocative the author can be. A collection of essays previously published by Vice, Jacobin , and others, it sets up numerous enemies--both real and straw--for Svenonius to knock down....It's all couched in a style that's part anarchist tirade, part postmodern critique, and part punk-rock snottiness--yet it's addictively ridiculous.\"-- NPR \"Censor it all. Film, TV, music, politics, books, news, art--censor all of it. That's the guiding principle of local radical punk Ian Svenonius' latest essay collection, Censorship Now!! \"-- Washington City Paper , Critics' Pick Named a Favorite Book of 2015 by Jason Diamond at Vol. 1 Brooklyn \"Gonzo ecstasy for those who have come to know Svenonius's self-aware political meditations....And though the essays Svenonius writes are not themselves unclear, the process of talking about what he's written involves discussions that some might find uncomfortable. His books make more sense the more you dissect them. So keep them in your back pocket and read them, one word at a time.\"-- Los Angeles Review of Books \"A new collection of essays by everyone's favorite supercilious rock theorist...Svenonius has always been the smartest kid in the room....In print, Svenonius is like that curmudgeonly pal that you adore because, even while his insight quivers between humor, paranoia, and antisocial ire, he never dispels your fascination in how he gets there.\"-- SF Weekly \"Ian Svenonius is best known as the frontman of bands like the Make-Up and Nation of Ulysses, but he's also a brilliant cultural critic with a talent for coming up with the hottest takes you'll ever read. In this collection, Svenonius makes compelling arguments in favor of censorship and hoarding books and records, amid polemics against Apple and Ikea, the yuppification of indie rock, and the shaving of pubic hair.\"-- Buzzfeed \"The essays in Censorship Now!! are equally packed with modest proposals and mock-revolutionary rhetoric, but there are grains of truth in pieces like 'The Historic Role Of Sugar In Empire Building' and ' Heathers The Nerd's Fight For Niceness'--they're just buried somewhere between tongue and cheek.\"-- The A.V. Club \" Censorship Now!! simultaneously deals in the heated rhetoric of insurgent calls to action, the seductive broad strokes of propaganda, and the clever winking of surrealist humor. Often when I'm really convinced Svenonius has gone off a paranoid deep end, the next sentence hits back with knowingly-hilarious exaggeration or profoundly spot-on analysis, realigning my perspective and making me wonder again....It's fitting that a book whose intentions are ambiguous begins with a call to censor art and ends by letting art do the talking.\"-- Pitchfork Ian F. Svenonius's new collection of sixteen essays and stories, entitled Censorship Now!! , is reorganizing people's ideas about censorship, Ikea, documentary filmmaking, the Berlin Wall, the film Heathers , the twist, the frug, the mashed potato, shaving one's body, Apple, Inc., Nordic functionalism, the supposed benevolence of the Wikipedia, hoarding, college rock, the origins of the Internet, and more. It's an underground smash which has been met with a horrified gasp in all respectable quarters and gog-eyed enthusiasm in artist garrets the world over.",
  "genres": [
    "Nonfiction",
    "Essays",
    "Music",
    "Philosophy",
    "Politics",
    "Art",
    "Theory"
  ],
  "author": "Ian F. Svenonius",
  "average_rating": "3.67",
  "url": "https://www.goodreads.com/book/show/25330171-censorship-now"
}