{
  "title": "The Dominator",
  "description": "Librarian's note: This is an alternate cover edition for ASIN: B00SNRG8I0.In submission there can be freedom...Trigger Warning! Dark romance with scenes with dubious/ non-consent, some bondage, and discipline. For mature audiences only.**Right after her high school graduation, Tia O’Connor’s absent father tells her he needs her to save his life by being a marker for a gambling debt for just a few days.Then Tia finds out the truth, that her life is no longer her own, that she’s been chosen to marry the son of a local mafia kingpin, a man whose identity shocks her.Tommy Ferrano likes to play mind games. Tommy likes to play a lot of games. Tia has to obey his rules … or else.Rule 1: He owns her and has full control over her. He wants obedience; he punishes defiance.Rule 2: She needs to keep her mouth shut and reveal nothing to anyone about him.He soon reveals rule #3 to her, revealing his dark, possessive, and depraved sexual side. Tia has to obey in order to survive. Will it break her or will submission bring about a different kind of freedom?Tommy Ferrano never wanted a wife, never even wanted a girlfriend. Women were just a means to an end, a sexual end.Women were always happy to oblige, sometimes too eager, which meant that he had to go over the edge of consent to get what he really wanted, fear then submission.Tommy needs to get married to get control and handed his birthright --- something he’s worked tirelessly for. His father has a specific girl in mind and Tommy isn’t sure why her but the idea of owning a woman wakes up deeper, darker urges in him than ever. The minute he sets eyes on Tia he feels something inside of him shift, change. And as he gets to know her and finds out truths that have been hidden from him, he starts to change even further.What’s his father’s motivation for picking this girl? What’s his father hiding? And how can he get what he wants from her without ruining everything?Ingredients include: profanity, sex, violence, dominating alpha male, blood, pain, love, redemption...No cliffhanger...",
  "genres": [
    "Dark",
    "Dark Romance",
    "BDSM",
    "Romance",
    "Erotica",
    "Abuse",
    "Mafia Romance"
  ],
  "author": "D.D. Prince",
  "average_rating": "3.91",
  "url": "https://www.goodreads.com/book/show/25336041-the-dominator"
}