{
  "title": "30,000 Leagues Undersea: True Tales of a Submariner and Deep Submergence Pilot",
  "description": "Journey with me into the abyss, a world far more dangerous than space!  What's this book about? Life. Death. Imminent danger. Unexpected reprieve. Victory. Defeat. Success. Failure. Thermo-nuclear war. True love. Loss. High drama. Low comedy. Ronald Reagan. Mikhail Gorbachev. And Bond, James Bond.  They’re all here. Ninety amazing and entirely true tales of swash-buckling adventure on the sea and beneath it, as a boy grows into manhood steadfastly pursuing his lifelong dream, wins a million-to-one shot to become a Hydronaut, and lives a life of high adventure undersea exploring the abyss, a world far more dangerous than space.  The author states:  I have been trapped on the seafloor twice. Deluged by flooding as I dove a submarine to its maximum depth. In control of a submerged submarine on fire. Alone on a sinking boat at night, bailing to stay alive. Out of air with empty lungs while diving 90 feet down. Next to a fool about to light his cigarette as we stood on 66,000 gallons of high-octane gasoline. And I have had the chance to do and see amazing things, enough for ten lives.  I have sailed 100,000 miles in submarines, dove more than three miles to the abyssal seafloor of the Pacific, and explored an alien world far more dangerous than space. I have gone to places on Earth no one else ever will. I found the first naval aviator ever recovered from the abyss. I mapped the wreckage of USS Thresher. And I held thermonuclear targeting steady on Mother Russia as President Reagan met Gorbachev in Reykjavik.  In this book, I tell those stories and more, 90 stories of a life spent undersea. These are the good parts, cooked down to short tales you can read on a bus, a lunch break, or in your bunk before lights out.  Join me. I will take you places no one else can. You will survive, I promise, and have a good time along the way. So come on—dive in!  “At turns gripping, compelling, and simply enchanting, Vetter’s 30,000 Leagues Undersea is a door straight into a breathtaking world few human beings have ever touched ... or ever will.” –– Holly Lisle.  30,000 Leagues Undersea. Fiction adventures Jules Verne might have written. But I lived them.",
  "genres": [
    "History",
    "Nonfiction",
    "Biography"
  ],
  "author": "Tom Vetter",
  "average_rating": "4.33",
  "url": "https://www.goodreads.com/book/show/25335211-30-000-leagues-undersea"
}