{
  "title": "Saved: Book 3 of the Surrender Trilogy",
  "description": "After finally rescuing his beloved Kate from the clutches of his twisted cousin, Tony has spent the last seven months running from his demons, only to find himself in a drunken stupor. The thought of her carrying Masimo’s baby plagues his very soul, and yet every day he spends without Kate is sheer torture. Finally resolved to drown his sorrows in a bottomless bottle of whiskey, Tony has taken up residence in a seedy hotel room in downtown San Diego. He has all but given up hope on everything and everyone in his life when his best friend and security expert Jasper arrives to inform him that all is not as it seems. Now Tony must make both the physical and emotional journey back to Kate, beg for forgiveness, and pray that the life he always dreamed of slips through his fingers.Having gone through a lifetime of torture she wouldn't wish on her worst enemy, Kate can’t let go of the hurt of being left her alone and pregnant with Tony’s child. And now, Tony is forced to keep another secret from Kate, something which is certain to make things worse. Following the delivery, Kate spirals into a post-partum depression that renders her helpless, and Tony is forced to function as a single parent.There never appears to be a lull in the storm that looms over Kate and Tony. Just when there seems to be chance for the two of them to get back on track, an ex-girlfriend returns, and makes it clear that she won’t stop until she gets the life with Tony she has always wanted. Now locked in a fight for everything he holds precious, Tony is forced to find a way to put the pieces of the puzzle together in order to get his life and his family back together. Will Tony figure out a way to save Kate and his young family? Find out in Saved, the final story in the Surrender Trilogy.",
  "genres": [
    "Abuse"
  ],
  "author": "Jennifer  Burrows",
  "average_rating": "4.65",
  "url": "https://www.goodreads.com/book/show/25334038-saved"
}