{
  "title": "In This Together: My Story",
  "description": "When Mitt and Ann Romney met in their late teens, a great American love story began. And their life together would be blessed: five healthy sons, financial security, and a home filled with joy. Despite the typical ups and downs, they had a storybook life.Then, in 1998, Ann was diagnosed with multiple sclerosis. She couldn't believe it was real; there were no therapies or treatments to help her. Mitt told her that day that they would tackle the diagnosis as a team: They were in it together. \"As long as it isn't fatal, we're fine. If you have to be in a wheelchair, I'll be right there to push it,\" he told her. And Ann thought, \"But I'll be the one in the wheelchair.\" A caregiver and helper her whole life, she'd crossed a terrible invisible line. She wouldn't be able to care for her family anymore. She was the patient. Ann and Mitt would face the most frightening and humbling experience of their lives.From reflections on her early life, her marriage, and her diagnosis and recovery, the sources of her faith, and the stories of others who overcame adversity and inspired her to keep going, In This Together is a brave and deeply honest portrait of a family facing an unexpected blow, often in the most public of circumstances.\"A lot of people talk about a transformation that happens when life throws you a curve ball, and the big one in my life was my MS diagnosis. With all the blessings I've had, MS has been my greatest teacher: It has taught me about faith, compassion, and serving others. I've met many people along the way who've shared advice and demonstrated enormous resilience in the face of challenges; their stories gave me strength. In sharing my story, I want to give others hope as I've been given hope on this journey.\"",
  "genres": [
    "Memoir",
    "Biography",
    "Nonfiction",
    "Autobiography",
    "Biography Memoir",
    "Politics",
    "Health"
  ],
  "author": "Ann Romney",
  "average_rating": "3.74",
  "url": "https://www.goodreads.com/book/show/25332090-in-this-together"
}