{
  "title": "Learning to Die in the Anthropocene: Reflections on the End of a Civilization",
  "description": "\"Roy Scranton lucidly articulates the depth of the climate crisis with an honesty that is all too rare, then calls for a reimagined humanism that will help us meet our stormy future with as much decency as we can muster. While I don't share his conclusions about the potential for social movements to drive ambitious mitigation, this is a wise and important challenge from an elegant writer and original thinker. A critical intervention.\"--Naomi Klein, author of This Changes Everything: Capitalism vs. the ClimateComing home from the war in Iraq, US Army private Roy Scranton thought he'd left the world of strife behind. Then he watched as new calamities struck America, heralding a threat far more dangerous than ISIS or Al Qaeda: Hurricane Katrina, Superstorm Sandy, megadrought--the shock and awe of global warming.Our world is changing. Rising seas, spiking temperatures, and extreme weather imperil global infrastructure, crops, and water supplies. Conflict, famine, plagues, and riots menace from every quarter. From war-stricken Baghdad to the melting Arctic, human-caused climate change poses a danger not only to political and economic stability, but to civilization itself . . . and to what it means to be human. Our greatest enemy, it turns out, is ourselves. The warmer, wetter, more chaotic world we now live in--the Anthropocene--demands a radical new vision of human life.In this bracing response to climate change, Roy Scranton combines memoir, reportage, philosophy, and Zen wisdom to explore what it means to be human in a rapidly evolving world, taking readers on a journey through street protests, the latest findings of earth scientists, a historic UN summit, millennia of geological history, and the persistent vitality of ancient literature. Expanding on his influential New York Times essay (the #1 most-emailed article the day it appeared, and selected for Best American Science and Nature Writing 2014), Scranton responds to the existential problem of global warming by arguing that in order to survive, we must come to terms with death.Plato argued that to philosophize is to learn to die. If that’s true, says Scranton, then we have entered humanity’s most philosophical age—or this is precisely the problem of the Anthropocene. The trouble now is that we must learn to die not as individuals, but as a civilization.A war veteran, journalist, author, and Princeton PhD candidate, Roy Scranton has published in the New York Times, Wall Street Journal, Rolling Stone, Boston Review, and Theory and Event, and has been interviewed on NPR's Fresh Air, among other media.More praise for Learning to Die in the Anthropocene:\"Perhaps it is because he is a soldier, perhaps it is because he is a literate human being, but the fact is--Roy Scranton gets it. He knows in his bones that this civilization is over. He knows it is high time to start again the human dance of making some other way to live. In his distinctive and original way he works though a common cultural inheritance, making it something fresh and new for these all too interesting times. This compressed, essential text offers both uncomfortable truths and unexpected joy.\"--McKenzie Wark, author of Molecular Red: Theory for the Anthropocene",
  "genres": [
    "Nonfiction",
    "Philosophy",
    "Science",
    "Climate Change",
    "Environment",
    "History",
    "Politics"
  ],
  "author": "Roy Scranton",
  "average_rating": "3.76",
  "url": "https://www.goodreads.com/book/show/25330145-learning-to-die-in-the-anthropocene"
}