{
  "title": "Alone",
  "description": "Alone is the story of Ralph Banister. He is a normal average man, married with two kids. When his wife and children leave for a visit to his in laws in England, Ralph finds himself alone at home. He goes about his daily chores and with his faithful dog Jason at his side, Ralph soon discovers that he is not only alone at home, but he is truly alone. Everyone on the face of the Earth has vanished. With no explanation, Ralph and Jason struggle to survive in an empty world. As power fails and the phones go dead, all hope of contacting his missing family is gone. With no outside communication and no idea what has caused the worldwide disappearances, their outlook is grim. With no power, water or phones, Ralph abandons their home and searches for some place to live that will allow him to provide for the future, whatever the future might bring. As Ralph and Jason face new challenges, the two grow closer together and come to depend on each other for their very survival.Ralph tries to adapt to the loss of everyday conveniences as he and Jason move into an old farm house and proceed to make it their home. Ralph spends part of the time building his own power generating plant and relying on spring water. Together they collect farm animals from the surrounding area and move them to the farm. The animals provide food and help to ease the loneliness. As time passes they settle into their new home. Planting crops for food and then guarding those crops, they struggle to become self sufficient. With no men to stop them, wildlife fills the land and Ralph and Jason have new worries as predators also multiply.Ralph prepares the farm for protection and the pair defend themselves against nature running wild. With an explosion of smaller animals, their food supply is threatened but just as quickly the small animals disappear and their worries quickly turn to the large number of predators that are now in the area. With no men around, the animals become bolder and bolder. They are forced to fight to protect each other and the small farm they now consider home.When nature reaches equilibrium, Ralph and Jason spend each day providing for their needs and trying to cope with loneliness. Each day brings a different struggle and Ralph learns to adapt to each new circumstance. Trying to salvage books and materials before they are lost, Ralph and Jason make numerous dangerous trips into the towns and cities until they are forced to stop. Finally all modern technology fails and mankind retreats several hundred years.As the years roll by, they settle into the routine of their new lives. The lack of human company threatens Ralph’s sanity and his sorrow sometimes overwhelms him. Thoughts of his wife and children are never far from his mind and their loss weighs heavily on him. Finally the last man on Earth, an aged and stooped figure waits for the final end.",
  "genres": [
    "Post Apocalyptic",
    "Fiction",
    "Science Fiction"
  ],
  "author": "T.R. Sullivan",
  "average_rating": "3.69",
  "url": "https://www.goodreads.com/book/show/11548588-alone"
}