{
  "title": "99 Inspiring Stories for Presentations: Inspire your Audience & Get your Message Through",
  "description": "Barry Powell Proudly Presents the 99 Most Inspiring Short Stories Ever Heard in the Business World Are you looking for inspiring stories to use in some of your presentations or simply to help you start practicing storytelling? You’re about to discover a unique reference book that will change the impact of your future presentations forever. After extensive research, Barry Powell has discovered and collected the most popular stories that businessmen and public speakers with strong communication skills, have been using for years to engage their audiences and offer them the best storytelling experiences! The Key to a Memorable Presentation \"Make Them Care\" This is the greatest advice that the most successful public speakers will give you. Whether your audience is hundreds of business executives in a conference room, your marketing team being briefed by you or just a few peers around you drinking cocktails on a networking event, the key to putting your message through and making an impact is to make your audience care. Storytelling is a powerful technique that can do this. When you just dump information onto your audience, you are not really making an impact on their hearts and minds. But, when you start telling a story, a magic thing They instantly give you their full attention. They start really listening to what you are saying with their hearts and minds. And this is your chance to evoke in them some kind of emotion. Delivering your message with a funny or touching story end is the key to creating emotion and making a lasting impact in their hearts and minds. What You Will Find in this Book This collection includes some of the most amazing stories ever told by famous businessmen, spiritual leaders and bestselling writers. If you are determined to improve your storytelling skills in business presentations and public speaking, this book is a highly recommended starting point. The stories included cover a wide range of business values to help you start practicing storytelling at every opportunity and improve your communication skills. Why to Buy this Book Using stories from this collection in your presentations will help Deliver an outstanding presentation even to a tough audienceGet your message through effectively Inspire and motivate others into taking the desired actions Start being regarded as an inspiring public speaker You will also discover that practicing storytelling frequently, not only in presentations but in your daily conversations as well, will make you popular in your business and social circles. Buy this Amazing Collection Today! Business values #1 ASSESSMENT #2 ASSUMPTION MAKING #3 ATTITUDE #4 CARING #5 CHALLENGE #6 COMMON SENSE #7 COMMUNICATION #8 CONFIDENCE #9 CREATIVE THINKING #10 CRISIS MANAGEMENT #11 CUSTOMER EXPERIENCE #12 DECISION MAKING #13 DIPLOMACY #14 DIVERSITY #15 ENTREPRENEURSHIP #16 EXPERIENCE #17 GIVING CREDIT #18 GOALS #19 HABITS #20 INFORMATION #21 INITIATIVE #22 INTEGRITY #23 JUDGEMENT #24 LEADERSHIP #25 LEARNING #26 LEVERAGE #27 LIMITATIONS #28 MAKING AN IMPACT #29 MARKETING #30 OPEN MINDEDNESS #31 OPPORTUNITIES #32 PERSISTE",
  "genres": [
    "Business"
  ],
  "author": "Barry Powell",
  "average_rating": "3.80",
  "url": "https://www.goodreads.com/book/show/25342936-99-inspiring-stories-for-presentations"
}