{
  "title": "Pleasurable Bargains",
  "description": "EDEN'S PLEASURE- Eight years ago, after a summer of sexual dalliance with Gervase Harcourt and his twin brother Gideon, Eden was forced into marriage. Now widowed and twenty six, she is eager to enjoy her freedom and explore her deepest sexual desires. When she crosses paths with the delectable Harcourt twins again, they offer to make amends for their part in her miserable marriage by fulfilling her sexual fantasies. They introduce her to Madame Desiree's House of Pleasure where any erotic dream can become a reality. She also learns love has its darker side and that for Gideon, not all the fantasies played out at Madame Desiree's are pleasurable. As Eden explores her sensuality she realizes her heart still belongs to Gervase. But is she more than just a sexual plaything to him? Forced to consider another unwanted marriage and convinced that her barren state is why Gervase hasn't offered to marry her, Eden flees from Gervase and the sensual web he's spun around her. But Gervase has learned his own lessons at Madame Desiree's... Originally published in 2005.ANTONIA'S BARGAIN- This book is the stand-alone sequel to Eden's Pleasure. Since the suicide of his first wife, Gideon has avoided emotional interactions with women in favor of less emotionally draining liaisons with men. When he unmasks \"Anthony\" Maxwell and finds he is, in fact, Antonia, he is still sexually intrigued enough to want to bed her. A reluctant heiress, Antonia knows she has to marry but she intends to do it on her own terms her wealth in return for a husband-free bed. Gideon offers to help her infiltrate the world of the ton dressed as a man so she can see her potential suitors in their natural habitat. In return, she agrees to allow him to teach her every trick in his sexual repertoire as long as he doesn't take her virginity. Her fear of marriage and pregnancy is a puzzling barrier that Gideon, despite his exceptional skills, finds difficult to penetrate. As they become more scandalously intimate, he has to decide whether to help Antonia face her fears or walk away from the only woman he believes he could ever love.Originally published in 2007.",
  "genres": [
    "Erotica",
    "Historical",
    "Anthologies",
    "Erotic Romance",
    "Historical Romance"
  ],
  "author": "Kate Pearce",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/2533852.Pleasurable_Bargains"
}