{
  "title": "The End of the Game: The Last Word from Paradise: a Pictoral Documentation of the Origins, History & Prospects of the Big Game in Africa",
  "description": "A landmark book on Africa The origins, history, and prospects of big game in Africa \t \t\t \t \t\tResearched, photographed, and compiled over 20 years, Peter Beard ’s End of the Game tells the tale of the enterprisers, explorers, missionaries, and big-game hunters whose quests for adventure and \"progress\" were to change the face of Africa in the 20th century. This landmark volume is assembled from hundreds of historical photographs and writings, starting with the building of the Mombasa Railroad (\"The Lunatic Line\") and the opening-up of darkest Africa. The stories behind the heroic figures in Beard’s work— Theodore Roosevelt , Frederick Courtney Selous , Karen Blixen (Isak Dinesen) , Denys Finch-Hatton (the romantic hero of Out of Africa ), Philip Percival , J. A. Hunter , Ernest Hemingway , and J. H. Patterson (who became famous as the relentless hunter of the \"Man-Eating Lions of Tsavo\")—are all contextualized by Beard’s own photographs of the enormous region. Shot in the 1960s and ’70s in the Tsavo lowlands during the elephant-habitat crisis and then in Uganda parks, Beard’s studies of elephant and hippo population dynamics document the inevitable overpopulation and starvation of tens of thousands of elephants and rhinos. \t\t Originally published in 1965 and updated in 1977, this classic is resurrected by TASCHEN with rich duotone reproduction and a new foreword by internationally renowned travel and fiction writer Paul Theroux. Touching on themes such as distance from nature, density and stress, loss of common sense, and global emergencies, this seminal picture history of eastern Africa in the first half of the 20th century shows us the origins of the wildlife crisis on the continent, a phenomenon which bears a remarkable resemblance to the overpopulation and climate crises we face today.",
  "genres": [
    "Photography",
    "Africa",
    "Art",
    "History",
    "Nonfiction",
    "Travel",
    "Art and Photography"
  ],
  "author": "Peter H. Beard",
  "average_rating": "4.50",
  "url": "https://www.goodreads.com/book/show/2534552.The_End_of_the_Game"
}