{
  "title": "Burn",
  "description": "Suddenly, Gaby remembers everything.\n For a year she believe she was a backpacker chilling out in Pandanus Beach. Working at the library. Getting over the accident that killed her twin brother.  Then Rafa came to find her and Gaby discovered her true identity as Gabe: one of the Rephaim. Over a hundred years old. Half angel, half human, all demon-smiting badass and hopelessly attracted to the infuriating Rafa.  Now she knows who faked her memories, and how—and why it's all hurtling towards a massive showdown between the forces of heaven and hell.  More importantly, she remembers why she's spent the last ten years wanting to seriously damage Rafa.  Paula Weston lives in Brisbane with her husband, a retired greyhound and a moody cockatiel. Burn is book four in The Rephaim series after Shadows, Haze and Shimmer. \nPraise for The Rephaim series\n ‘I have been dying to get my hands on the 3rd book of the Rephaim series ever since Haze officially turned the Rephaim series into my favourite angel series ever. The tension is palpable and the pacing is sharp making Shimmer the most fierce and kick-arse book in the series so far…I haven’t been this pumped for a series since those early Hunger Games days.’ Inkcrush blog ‘Paula Weston has done it again. Shimmer is another stellar instalment in this, the best Angel-themed paranormal series I’ve ever read, and it’s so much heart-palpitating fun that I don’t even mind being led back to that cliffhanger rock-face again for the ending. 5/5.’ ALPHA reader ‘Beautiful writing, witty dialogue, badass characters and an intense and richly crafted tale, what else can you ask for? If you want an angel series that will blow your mind away, this is the one. Now, I only have one question: where’s book 4?’ YA Midnight Reads ‘Paula Weston is the queen of cliff-hanger endings, and this one’s going to blow your mind! I have absolutely loved reading Shimmer, and can’t praise the Rephaim series highly enough.’ Speculating on SpecFic ‘If there is one Aussie author I feel needs more international recognition—it’s Paula Weston. After finishing Shimmer, I can’t suppress the urge to tell everyone I know just how great a series the Rephaim books are…This series is one of my favourite urban fantasy reads and without a doubt my all time favourite angel series.’ Fictional Thoughts ‘Full of suspense. And you’ll love (or love to hate) all the characters.’ Dolly ‘Late for dinner, late for work, late late late. Thanks so much, Paula Weston. I picked up Shimmer and forgot everything else…a gripping tale of half angels, demons, love, sacrifice and very cool violence, wrapped up in one nicely written package.’ Adelaide Advertiser ‘Fast-paced and action-packed, this book doesn’t stop from page one.’ Launceston Examiner on Shimmer",
  "genres": [
    "Fantasy",
    "Angels",
    "Young Adult",
    "Paranormal",
    "Romance",
    "Urban Fantasy",
    "New Adult"
  ],
  "author": "Paula Weston",
  "average_rating": "4.35",
  "url": "https://www.goodreads.com/book/show/25351256-burn"
}