{
  "title": "The Strange Ways of Providence In My Life",
  "description": "God looks after the orphans  \n  Happy childhood, horrors of war and miraculous rescue of the only child survivor from Obertyn.\nKrystyna Carmi's childhood was full of happy moments in the family house. Her childhood was filled with friends, both Polish and Ukrainian girls, that played games with her. She attended a Ukrainian school, participated in school celebrations; she lived a normal, everyday life. In her memoire, published after many years of silence, Krystyna Carmi shows the history of her family and her life. The book contains more than 100 pictures, taken by Krystyna’s father, a professional photographer, and sent it to their family in Israel before the war.Krystyna was gifted with an amazing memory and as such was able to recall the atmosphere of those days, describing in details the appearance of a household; and if that wasn’t enough, Krystyna Carmi writes about something very rare, the smells she remembered from childhood. Walking with her on the streets of pre-war Obertyn, we get to know the Jews, the Ukrainians, and the Poles and the social and material conditions of their lives, as well as their names and surnames. Krystyna Carmi paints a psychological portrait of these people; she writes about how they dressed, what they ate, what their attitude towards others was, and above all, towards God. She writes about things seemingly trivial, however when looking back, they are incredibly significant.But the happy childhood did not last long. The first days of war brought overall fear and panic, the entrance of Red Army soldiers to Obertyn, the arrest of Polish patriots, liquidation of Jewish shops, the gradual growth into a more difficult reality of occupation, the Hungarian army in Obertyn, Jews murdered by Ukrainians in the local towns, incredible photos of the members of the Jewish community, drowning in the Dniester by Ukrainians. However, the worst was still ahead of the Jewish community in Obertyn and her family. First, the Germans, then the Kołomyja ghetto. She was with her parents as well as her maternal and paternal grandfathers. The life conditions in which Obertyn Jews had to live are described in the poem Molasa ”\" Ghetto Sweets; she shows in a fictile, detailed way, psychophysical suffering caused by hunger.People died in the ghetto because of hunger and physical exhaustion; their bodies were collected on a platform. These deaths do not escape the attention of a sensitive and suffering girl, who years later will write a poem with the title In Remembrance of Innocently Suffering People of Different Ages and Sexes from Kołomyja Ghetto; a picture of the platform will stay in her memory forever. \"The open mouth and eyes of these human corpses have been hunting me all my life.\"Then she returned from the ghetto with her parents, and escaped from Obertyn, following by her sisters’ death, which she described in a very suggestive way in her poems: Black Kamionka Forest. Part I Testimony and Black Kamionka Forest. Part II Curse). Her parents’ death, hiding, hunger, thirst, fear for life, then indifference as time goes by because life is hard. It would be easier to part with the world, but The Strange Ways of Providence in her Life has chosen for her to live, to be. This is how you could present in short, the content of Krystyna Carmi’s memoire. The memoire are interspersed with the cover of Doctor Markus Willbach, a friend of the Sorger family to emphasize the authenticity of Krystyna Carmi’s (maiden name: Sorger) memories as the images, situations, and events witnessed by her as a little girl coincide with Doctor Willbach’s account, an a",
  "genres": [
    "Nonfiction",
    "Memoir",
    "Holocaust",
    "Biography",
    "World War II",
    "History",
    "Historical"
  ],
  "author": "Krystyna Carmi",
  "average_rating": "4.17",
  "url": "https://www.goodreads.com/book/show/25353573-the-strange-ways-of-providence-in-my-life"
}