{
  "title": "Coal River",
  "description": "From the New York Times bestselling author of What She Left Behind comes a haunting and meticulously researched novel of historical fiction. Ellen Marie Wiseman draws readers into the Pennsylvania mining operations of the early 20th century—where children had no choice but to work in deadly conditions…or face starvation. This is an eye-opening novel sure to stay with you long after you turn the last page…As a child, Emma Malloy left isolated Coal River, Pennsylvania, vowing never to return. Now, orphaned and penniless at nineteen, she accepts a train ticket from her aunt and uncle and travels back to the rough-hewn community. Treated like a servant by her relatives, Emma works for free in the company store. There, miners and their impoverished families must pay inflated prices for food, clothing, and tools, while those who owe money are turned away to starve.Most heartrending of all are the breaker boys Emma sees around the village—young children who toil all day sorting coal amid treacherous machinery. Their soot-stained faces remind Emma of the little brother she lost long ago, and she begins leaving stolen food on families’ doorsteps, and marking the miners’ bills as paid.Though Emma’s actions draw ire from the mine owner and police captain, they lead to an alliance with a charismatic miner who offers to help her expose the truth. And as the lines blur between what is legal and what is just, Emma must risk everything to follow her conscience.“Wiseman offers heartbreaking and historically accurate depictions . . . [a] powerful story.”— Publishers Weekly“Heartrending and strongly drawn historical details.”— Booklist“Intense and heartbreaking at times, but full of hope. The author’s impeccable research into this era makes for a spot-on portrayal of a dark time in American history…’unputdownable’.”— The Historical Novels Review , Editor’s Choice“Things get really, really fast and furious. This book opened my eyes to the coal mines. I loved it. Would be a great book club selection.”— Jackie Blem, Tattered Cover Book Store (Denver, CO)",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Historical",
    "Book Club",
    "Audiobook",
    "Romance",
    "Adult Fiction"
  ],
  "author": "Ellen Marie Wiseman",
  "average_rating": "3.94",
  "url": "https://www.goodreads.com/book/show/25351642-coal-river"
}