{
  "title": "Making Khushi Mine",
  "description": "Khushi, a vibrant 21 year old was the sunshine of her bade papa and buaji’s existence. Add to it a close set of friends and love for arts and her life was complete. She was beautiful inside out, with her doe-like olive green eyes mature beyond their years. Her life was not perfect but she was not the one to complain for she lived it to the fullest. She made the best out of the situations and believed in moving on. Her smiles and chitter chatter were the life of Raizada Mansion. Everyone loved her dearly.  Everyone, but Avish Singh Raizada. He arrived in her world claiming his stake on two things that Khushi held very dear to her heart. Her home and her bade papa’s love. Sharing was an alien concept to that cynical arrogant man, who was unhappy with pretty much everything around him. And unfortunately Khushi became one more reason of his displeasure. Forgetting her own sadness, she tried to be reasonable and friendly towards him but he refused to warm up to her. So like any other intelligent being she decided to pretend that he does not exist and went on with her life.  It worked, but not for long. The people and the ties binding them were very important, very strong, whether they liked it or not. Their lives touched each other’s on daily basis. So overtime, living under the same roof, sharing the same family forced them into an understanding, a friendship of the sorts.  But like it happened with other people, Avish too found his life revolving around Khushi one fine day. She was not someone you can resent for long and he had understood that slowly. They way she saw his pain through the facade of anger broke his resolve to stay away from her. Her heart warming smiles that he had started discreetly capturing in his camera, thawed his frozen heart bit by bit. But his silent admiration and complex nature did not help the matter. To add to his woes, Khushi was obliviously happy in her own world, where Avish was her friend, just a friend. She sincerely believed in love, but for others not herself. He had always mocked the idea of love, but it was his only salvation now. Second chances are rare in life but he got one, and thus began his quest to bridge the distances between himself and her, distances created by the society, distances created by the age difference, but most importantly distances created by themselves. To make her his for eternity, only his.",
  "genres": [
    "Fan Fiction"
  ],
  "author": "Anamika G.K.",
  "average_rating": "4.32",
  "url": "https://www.goodreads.com/book/show/25350271-making-khushi-mine"
}