{
  "title": "Intercepted",
  "description": "Four people. Four goals. Four endings. In the third and final book of the USA Today bestselling By His Game series, the rules of the game no one knew they’d have to play are blurring, and when the past becomes the opposing team, hearts aren’t the only thing at stake of being lost… Finding naked pictures of her best friend on her boyfriend’s phone wasn’t in Everleigh White’s five year plan. Neither was moving back to Los Angeles, the city of dreams that never managed to make hers come true. There’s only so many years you can be in love with your best friend before you realize he’s never going to love you back, after all. If only her ex would stop showing up at the gym where she works, she’d be much happier. Being a father at nineteen wasn’t how Reid North, the Vipers’ wide receiver, imagined his life going, but when his ex-girlfriend tricked him into parenthood, he accepted it. Eventually. Now, with his ex on the verge of being released from prison, he’s holding onto full custody of his seven year old son, Leo. Football and Leo have left Reid no time for dating… Until Everleigh comes back. His best friend his whole life, Everleigh never knew Reid loved her. She left before he could tell her. Now she’s back in front of him, and he’s not letting go. Even if all he gets is her friendship again. But in a city like L.A., dreams come true when you’re least expecting it. So do nightmares. With their exes beating down their doors with demands and explanations, their hesitant and building relationship is threatened at every corner. They’re at serious risk of being intercepted by the past, and that’s a ball Reid is determined to catch. Except desperation can lead to stupidity—and Reid soon realizes he can’t catch every ball, no matter how perfectly it’s thrown to him. This time a fumble could cost more than a few points. It could cost him everything. (INTERCEPTED is the third and final book in the By His Game series and can be read as a standalone, although it is advised to read BLINDSIDED and SIDELINED before, in this order.)",
  "genres": [
    "Sports",
    "New Adult",
    "Romance",
    "Friends To Lovers",
    "Contemporary Romance",
    "Sports Romance",
    "Football"
  ],
  "author": "Emma Hart",
  "average_rating": "4.12",
  "url": "https://www.goodreads.com/book/show/25346909-intercepted"
}