{
  "title": "Leaves of the Fall",
  "description": "Rose is married to Trevor Dunn, who has been unfaithful in the past. The world drops in on Rose when she realizes he's doing it again. She has a dear friend, Ethan, who may or may not have died in an accident. As Rose pieces the puzzle together, she embarks upon a journey of self-discovery, learning about herself and what she wants for her life. A novella.About the AuthorViolet Yates, 38, was born and raised in Hawaii on the Kona Coast of the Big Island. She often feel as if she has lived several lives! She has three children, two of whom are grown. Her kids are her life. She is an author of several books, short stories, essays and about 100 poems. She owns more books than she could ever read, but she keeps collecting more.She lived in Upstate New York for 10 years, and during that time she went back to school and earned her Bachelor's degree in English, as well as a Master's degree in Higher Education Administration. During that time, she wrote prolifically and has just now begun to edit and publish a lot of it. While in New York, she worked at MetLife as an accounting representative, was an assistant manager at a Domino's pizza and she freelanced for a bi-monthly newspaper (in addition to being their circulation clerk).She has wanted to be a published author since she was eight years old, when she wrote and colored a story and sent it in as a submission to Highlights magazine for children. This was her first rejection letter, the first of many. Her first real novel, Beginnings, was really rough and contrived, and it did not get published, although she still has every single rejection letter. Following this total rejection, she put herself back into college, determined to become a stellar writer. After her separation from her husband, she stopped writing much of anything for years and drowned her sorrows in alcohol. Two and a half years ago, while living in the Berkshires of Massachusetts, she got into recovery. The last two years have been a journey of self-discovery, which she hopes will shine through in Lost & Found, her book of poetry. She gives all the glory to Jesus Christ, her Lord and Savior. While the struggle was indeed awful, she learned so much from those years and wouldn't go back and change a thing.",
  "genres": [],
  "author": "Violet Yates",
  "average_rating": "3.71",
  "url": "https://www.goodreads.com/book/show/11550376-leaves-of-the-fall"
}