{
  "title": "Bastard",
  "description": "#1 BESTSELLER - BASTARDMy name is Carter Reynolds. I was born a bastard and I’ll die a bastard. I learnt it at a young age, and nothing and nobody can change that. I’m on a one-way path of destruction, and god help anyone who gets in my way. I hate my life. Actually, I hate pretty much everything.That’s until I meet the kid next door. Indi-freakin’-ana. My dislike for her is instant. From the moment I lay eyes on her, she ignites something within me. She makes me feel things I thought I was incapable of feeling. I don’t like it, not one bit. When she looks at me with her big, beautiful, haunting, green eyes, it’s like she can see into the depths of my soul. It freaks me the hell out. She’s like sunshine and rainbows in my world of gloom and doom. I hate sunshine and rainbows.******** I’m Indiana Montgomery, my friends call me Indi. Despite losing my mum at the age of six, I have a wonderful life and great friends. My dad more than makes up for the fact that I only have one parent. I’m his little girl, the centre of his world. I adore him. When Carter Reynolds moves in next door, my life takes a turn for the worse. He’s gorgeous—sinfully hot, but that’s where my compliments end. He seems hell bent on making my life miserable. He acts tough, but when I look into his eyes I don’t see it. I see hurt and pain. To me, he seems lost. I should hate him for the way he treats me, but surprisingly I don’t. If anything, I feel sorry for him. I want to help him find peace. Help him find the light that I know is buried somewhere within his darkness, but, he won’t have a bar of it. He’s warned me time and time again to stay away, but I can’t. I’m drawn to him for some reason. He’s always referring to himself as a bastard. That may be true, but to me, he’s more like a beautifully, misunderstood bastard. Whether he likes it or not, I refuse to give up on him.***WARNING This book is recommended for persons over the age of 18 years, due to sexual content and coarse language.",
  "genres": [
    "Romance",
    "New Adult",
    "Second Chance",
    "High School",
    "Contemporary",
    "Contemporary Romance",
    "Enemies To Lovers"
  ],
  "author": "J.L. Perry",
  "average_rating": "4.06",
  "url": "https://www.goodreads.com/book/show/25357266-bastard"
}