{
  "title": "Bride Without a Groom",
  "description": "Rebecca has chosen the most luscious, five tiered, wedding cake – as featured in Hello! Magazine. The engagement ring that she has selected is celebrity inspired. The wedding singer is on speed dial. He doesn’t usually do Michael Bolton, but as it’s for a first dance he’ll make an exception. Father Maguire is checking dates for the parish church as we speak. The deposit on the white sand honeymoon is paid for in full on Barry’s card. Sure, the resort was good enough for Pierce Brosnan when he tied the knot. She has fallen for an ivory lace couture gown that is to die for. The down payment may require her to sell a left kidney, but it will be worth it. Isn’t that why you have two? There’s one teeny problem. It’s nothing, really. No need to panic! It’s just that Barry has yet to propose. Says he’s not ready! He can be a bit of a kill joy that way. It’s time to face the harsh reality – she is a bride without a groom. Truth be told, Barry’s had enough. There’s only so much wedding talk that one man can take. Discovering the credit card statement is the final straw. Now he’s leaving for a conference in Bangkok and frankly, he’s looking forward to the peace and quiet. He says he needs time to think about their relationship. As the Tiger beer flows and the tie loosens, his colleague Shelley is providing more than a shoulder for him to cry on. Maybe Shelley is right. Maybe Rebecca only wants the big day. Back in Dublin, Rebecca worries. Maybe she has pushed Barry too far this time. Best mates Pam and Emer are on hand for counseling and cocktails. With the help of family, friends and a well stocked drinks cabinet, Rebecca puts her cunning plan together. Operation ‘Win Back Barry’ is in full swing. She needs to convince Barry that she’s not crazy – just crazy about him. But wait… who is the mysterious woman that is so keen to talk to her, and what is it that Barry needs to get off his chest?",
  "genres": [
    "Chick Lit",
    "Romance",
    "Unfinished"
  ],
  "author": "Amy  Lynch",
  "average_rating": "3.06",
  "url": "https://www.goodreads.com/book/show/25358014-bride-without-a-groom"
}