{
  "title": "Ambrosia",
  "description": "Ambrosia is book #2 in the Nectar Series and it's now available on Amazon & Kindle Unlimited.Tristan's Prologue:(If you haven't read book one, this synopsis will have Nectar spoilers!)I can’t feel her. Part of me knows she was right to run, and if she hadn’t, I’d have to wonder if she was still the girl I’d fallen for or if maybe I’d ruined her. Who, in their right mind wouldn’t have run?But the other part of me, the part that knows she’s mine and that believes that because she’s mine and because we feel one another so deep...that part wants her to refuse to exist without me. That part of me is so filled with black boiling rage that I could rip myself to shreds because she left me and because I don’t have a fucking clue whether she’s still in one piece or not. I’m still groggy but I ache. I ache because I can’t feel her. She’s been sunshine in the dark for me and I can’t go back to the black, can’t go back to the emptiness I felt, not after feeling her.No.I don’t know if I can’t feel her because she’s sleeping, unconscious, if the tranquilizers aren’t completely out of my system yet, or if maybe our connection is broken because she’s dead.I can only speculate on what happened after I cold clocked and shot Sam. I only know I’m on the floor in this cage and the cage door and panic room doors are open. Sam is face first on the carpet by the bed and I’m lying beside a big crescent-shaped blood stain. It’s slick around my mouth from the blood --- her blood. Before dipping my tongue to the corner of my mouth I already know what it will taste like and I want more. SoMuchMoreDespite being groggy and feeling as if there’s a black abyss where my heart is supposed to be something else is brewing in me. I can’t put a name to it yet and I can’t figure out whether it’s evil or not. I don’t know what it wants.That small part of me that knows she was right to run is relieved I can’t feel her because I’m not ready to find her. I’m not ready because I’m afraid of what I could be capable of when I do. Afraid of what I might be capable of if someone has her or if she’s dead. I need to make myself wait…wait a few days so I'll know she’s stopped bleeding and then find her and fix this. I just need to fucking find her before The Mangler, does. If he hasn’t, already. He knows all about Kyla’s blood, he knows she’s mine, and he wants everything that is mine.Book Three, Essence, is also now available: http://bit.ly/nectar3essence",
  "genres": [
    "Paranormal",
    "Vampires",
    "Dark",
    "Fantasy",
    "Romance",
    "Dark Romance",
    "Erotica"
  ],
  "author": "D.D. Prince",
  "average_rating": "4.04",
  "url": "https://www.goodreads.com/book/show/25358021-ambrosia"
}