{
  "title": "The Beginning and End of Rape: Confronting Sexual Violence in Native America",
  "description": "Winner of the Labriola Center American Indian National Book Award Despite what major media sources say, violence against Native women is not an epidemic. An epidemic is biological and blameless. Violence against Native women is historical and political, bounded by oppression and colonial violence. This book, like all of Sarah Deer’s work, is aimed at engaging the problem head-on—and ending it.The Beginning and End of Rape collects and expands the powerful writings in which Deer, who played a crucial role in the reauthorization of the Violence Against Women Act in 2013, has advocated for cultural and legal reforms to protect Native women from endemic sexual violence and abuse. Deer provides a clear historical overview of rape and sex trafficking in North America, paying particular attention to the gendered legacy of colonialism in tribal nations—a truth largely overlooked or minimized by Native and non-Native observers. She faces this legacy directly, articulating strategies for Native communities and tribal nations seeking redress. In a damning critique of federal law that has accommodated rape by destroying tribal legal systems, she describes how tribal self-determination efforts of the twenty-first century can be leveraged to eradicate violence against women. Her work bridges the gap between Indian law and feminist thinking by explaining how intersectional approaches are vital to addressing the rape of Native women.Grounded in historical, cultural, and legal realities, both Native and non-Native, these essays point to the possibility of actual and positive change in a world where Native women are systematically undervalued, left unprotected, and hurt. Deer draws on her extensive experiences in advocacy and activism to present specific, practical recommendations and plans of action for making the world safer for all.",
  "genres": [
    "Nonfiction",
    "Feminism",
    "Indigenous",
    "History",
    "Native American",
    "Law",
    "American History"
  ],
  "author": "Sarah Deer",
  "average_rating": "4.47",
  "url": "https://www.goodreads.com/book/show/25362708-the-beginning-and-end-of-rape"
}