{
  "title": "Understanding Jim Crow: Using Racist Memorabilia to Teach Tolerance and Promote Social Justice",
  "description": "For many people, especially those who came of age after landmark civil rights legislation was passed, it is difficult to understand what it was like to be an African American living under Jim Crow segregation in the United States. Most young Americans have little or no knowledge about restrictive covenants, literacy tests, poll taxes, lynchings, and other oppressive features of the Jim Crow racial hierarchy. Even those who have some familiarity with the period may initially view racist segregation and injustices as mere relics of a distant, shameful past. A proper understanding of race relations in this country must include a solid knowledge of Jim Crow—how it emerged, what it was like, how it ended, and its impact on the culture. Understanding Jim Crow introduces readers to the Jim Crow Museum of Racist Memorabilia, a collection of more than ten thousand contemptible collectibles that are used to engage visitors in intense and intelligent discussions about race, race relations, and racism. The items are offensive. They were meant to be offensive. The items in the Jim Crow Museum served to dehumanize blacks and legitimized patterns of prejudice, discrimination, and segregation. Using racist objects as teaching tools seems counterintuitive—and, quite frankly, needlessly risky. Many Americans are already apprehensive discussing race relations, especially in settings where their ideas are challenged. The museum and this book exist to help overcome our collective trepidation and reluctance to talk about race. Fully illustrated, and with context provided by the museum’s founder and director David Pilgrim, Understanding Jim Crow is both a grisly tour through America’s past and an auspicious starting point for racial understanding and healing.",
  "genres": [
    "History",
    "Race",
    "Nonfiction",
    "African American",
    "Politics",
    "Social Justice",
    "Art"
  ],
  "author": "David Pilgrim",
  "average_rating": "4.49",
  "url": "https://www.goodreads.com/book/show/25363150-understanding-jim-crow"
}