{
  "title": "Wood, Talc And Mr. J: We Never Had It So Good...",
  "description": "Wood, Talc and Mr. J – We never had it so good…It’s a time of great social and political upheaval – industrial disputes and bullying unions, racial discord and the National Front. 1978, it’s a Britain on the brink. It’s also a Britain of definite youth cultures, when the wrong attire on the wrong street might equal a beating for your blunder, often regardless of your football allegiance…A look back. Without the rose-tinted spectacles, but with hindsight and humour, and with poignancy and affection.The North.Phillip sees life in a simplistic if passionate up or down, us and them, black, white and nothing in-between. When not doing his ‘thing’ in Wigan’s Casino Club – voted ‘The Greatest Disco in the World’ by Billboard Magazine – Phillip hates the world. Or at least he thinks he does. He longs for the weekend, or a greater, permanent escape from the daily grind of factory life in an industrial town.With a little imagination, he might realise things midweek aren’t that there’s the loving family, the secure job amid mass unemployment, a relationship with the perfect young woman… Or maybe he realises too late. And all he’d deemed important was only ever an illusion, his reflected image included.Coming full circle by way of loss and more loss, you would hope lessons are learned…The book progresses through myriad dream sequences, interwoven song-themes, a father’s philosophical ramblings, ever blackening wit, leitmotif – or seemingly recurring scenes; is someone laughing at our hero? And Phillip’s own, lyrical, strut-like, black or white manner.Dancehall adventures via train rides to Heaven, scooter cruising almost coast to coast. Beneath the pier encounters with the opposite sex, et al… set against the birth of Scargill and Thatcher feuding…",
  "genres": [
    "Fiction",
    "Music",
    "Politics",
    "Literature",
    "Coming Of Age",
    "Unfinished",
    "Literary Fiction"
  ],
  "author": "Chris   Rose",
  "average_rating": "4.40",
  "url": "https://www.goodreads.com/book/show/25360547-wood-talc-and-mr-j"
}