{
  "title": "The Rake and The Recluse: A Tale of Two Brothers",
  "description": "Great Britain, 1880A woman out of time.A man stifled by propriety.A nemesis determined to take her away.A brother to the rescue.The Duke of Roxleigh is running the track, training his new set of Friesians when a woman runs from the forest directly into his path, nearly killing her.He takes her back to his home to care for her... but there's something not quite right and though he wishes to be done with the entire situation, he just can't keep her from his thoughts...Francine Larrabee was on a path bound for certain glory, until she lands in Victorian England and is nearly killed by a team of terrifying black horses led by a Duke, Gideon, who matches them in spirit and demeanor and always seems to be cross. Though she is drawn to her rescuer, he wants nothing to do with her.Brother to The Duke of Roxleigh, the Lord Peregrine Trumbull, is Viscount of Roxleigh in name, but a rake of the worst order by action.... until he meets his match in a girl who requires his complete submission, something he has never been familiar with.Lilly Steele was a simple country miss until she was kidnapped, brutally attacked and left for dead in the far reaches of Great Britain, now she has escaped the aftermath and has asked Perry to do the untenable.She managed to recover her physical injuries... but the emotional scars run deep and will require absolute trust and healing from an altogether unlikely source.What is love? Where does it come from? What makes two people crash, and two other people burn. In this six part serial novel we learn what it means to love, what it means to care, and what it feels like to give up everything you know, to save the one person you can't live without.VOTED BEST HISTORICAL ROMANCE BY READERS for the 2012 Bookie Award!THIS IS THE COMPLETE NOVEL.All six parts of the serial are included in this edition:FREEDOMFOUNDTAKENRUINATIONSUBMISSIONRETRIBUTIONTHIS EDITION IS NOT ILLUSTRATED",
  "genres": [
    "Time Travel",
    "Historical Romance",
    "Romance",
    "Historical",
    "Historical Fiction",
    "Victorian",
    "Amazon"
  ],
  "author": "Jenn LeBlanc",
  "average_rating": "3.78",
  "url": "https://www.goodreads.com/book/show/25362386-the-rake-and-the-recluse"
}