{
  "title": "Magnesium: What Your Doctor Needs You To Know: Including: How to Fight Diabetes, Have a Healthy Heart, and Get Strong Bones!",
  "description": "NEWLY REVISED EDITION! *NEW* BONUS CHAPTER NOW INCLUDED! Do you struggle with irritability? Headaches? Inability to sleep or insomnia? Osteoporosis? Diabetes? Hyperglycemia? Hypoglycemia? Your thyroid? Spasms or muscle soreness? A high level of stress? Sensitivity to noise? Difficulty in concentrating? Kidney stones? Gut disorder? Constipation? Lack of appetite? Hypertension? High blood pressure? Nerve dysfunction? Joint pain? Epilepsy? PCOS? Painful PMS? Memory loss? Depression? Chances are you are one of MILLIONS who suffer from one or more of these conditions. In today’s world, more than 80% of people have a deficiency in magnesium, almost all of which are misdiagnosed. Magnesium deficiency can cause a number of unpleasant side effects and impact your feelings of overall well-being as it is an imperative mineral that affects your nervous system. To cope with daily life, we actively decrease the mineral density in our bodies as a way to boost our nervous system. Learn the detailed explanation of the causes, effects and remedies to many physical and mental disorders that all find their root in magnesium. So, do you have enough magnesium? Do you know how much you actually require during different phases of your life? Find out for yourself by reading this informational book! Chapter 1: Introduction Chapter 2: Magnesium and Your Blood Chapter 3: Magnesium and Insulin Chapter 4: Magnesium and Your Energy Chapter 5: Magnesium and Hormones Chapter 6: Magnesium and Muscles Chapter 7: Magnesium and Nerves Chapter 8: Magnesium and Bones Chapter 9: List of Common Disorders Associated with Magnesium Chapter 10: Magnesium and Your Diet NEW BONUS CHAPTER Bibliography Scroll up to the top and Buy Now!",
  "genres": [
    "Health",
    "Nonfiction",
    "Self Help"
  ],
  "author": "Nolan Edwards",
  "average_rating": "4.30",
  "url": "https://www.goodreads.com/book/show/25364031-magnesium"
}