{
  "title": "Julia's Daughters",
  "description": "A novel that explores the surprising ways that families—even the most fractured—can save each other, over and over again by the author of Finding Georgina . Julia Maxton can’t imagine anything worse than losing one of her three daughters—until the day seventeen-year-old Haley runs a stop sign, killing her younger sister Caitlin. Six weeks after the crash, the family is falling apart. Julia struggles not to show hostility toward Haley, but her deep-rooted anger won’t go away. Her husband, Ben, has drifted away emotionally. Their youngest daughter, Izzy, is lost in the shuffle. And despite Haley’s insistence that she’s fine, her actions scream otherwise. Fearing that she’s about to lose a second child, Julia decides to take Haley on a cross-country drive. Maybe somewhere between Nevada and Maine they can bridge the gulf between them. But first there will be painful questions to face—is Julia a good mother? Did she secretly love responsible, respectful Caitlin more than defiant Haley? Can Haley ever find peace with her mother—and herself—again? In Colleen Faulkner’s most thought-provoking and complex novel to date, an unthinkable tragedy becomes the starting place for a powerful journey toward healing and hope. Praise for Colleen Faulkner’s Just Like Other Daughters “This deeply moving story of maternal love and renewal will touch your heart. It’s a celebration of the capacity of the human heart to heal itself and embrace change, beautifully written with rare insight.”—Susan Wiggs, #1 New York Times –bestselling author “Be prepared to weep tears of sorrow as well as tears of joy. This is a novel you won’t soon forget.” —Holly Chamberlin, author of Barefoot in the Sand",
  "genres": [
    "Fiction",
    "Contemporary",
    "Womens Fiction",
    "Adult",
    "Death",
    "Marriage",
    "Family"
  ],
  "author": "Colleen  Faulkner",
  "average_rating": "4.01",
  "url": "https://www.goodreads.com/book/show/25373736-julia-s-daughters"
}