{
  "title": "Bridge Builders: How Superb Communicators Get What They Want in Business and in Life",
  "description": "Both engaging and instructive, BRIDGE BUILDERS presents a simple blueprint for communication success---in business and beyond---written as a persuasive and thought-provoking fable that illustrates the power of human connection.Excerpt. © Reprinted by permission. All rights reserved.An extraordinary desire drives you. You have a story to tell. You have a product, service, idea, or vision to sell---at home or at work. How you choose to communicate your message and connect with your target audience will make the difference between success and failure.When you make a decision to communicate your message like a Bridge Builder, you will achieve more of what you want. You’ll be a Superb Communicator who is able to persuade audiences:To listen. To engage. To connect. To buy your products. To join your causes. To approve your initiatives. To fund your ideas. To believe in your vision. To let you lead.The premise of this book is simple: You already know how to be a Bridge Builder---although you may not realize it. Like most people, you’ve probably forgotten. But you’ve successfully built bridges before. Intention, not perfection, helped you achieve what you wanted. And intention, not perfection, will help you achieve what you want in the future. When you operate from the principles illustrated in the story and in the Approach that follows it, the results you achieve will amaze you.Getting the Most from the StoryStories are often used to communicate important principles. Why? Because we all relate to life through stories. We see aspects of ourselves in the characters, and we hope to gain new insights about business and life from the way they react and the things they learn in the story.The parable in this book is about a man named Daniel who, like us, has a problem (how to communicate effectively with others) but doesn’t recognize the source of his problem or how to solve it. Daniel needs to become a Bridge Builder in order to get what he truly wants, but he struggles to accept the solution to his problem because of past failure, preconceptions, and misunderstandings. He exemplifies the individuals I encounter every day in one-to-one coaching and the corporate consulting process.The characters in this story represent composites of real business professionals I’ve worked with, not anyone in particular. However, early feedback from readers that represent varied industries and cultures tells me that the characters and themes in the story will resonate with most readers in more ways than one.This story applies to business communication, but it also applies to communication at home, at school, at church, and in any organizational setting. Because the story deals with communication and leadership principles, anyone will benefit from reading it, whether or not they work in the corporate world.Organizations, large or small, will also reap the profits of intentionally nurturing a culture of Bridge Builder Communication and Bridge Builder Leadership—and so will those inside those organizations, whether they’re executives, scientists, engineers, sales reps, entrepreneurs, educators, pastors or Creatives. That has been my experience.I suggest that you first read and reflect on the story. Then take the time to ask questions that are naturally suggested in the narrative.",
  "genres": [
    "Business",
    "Leadership",
    "Nonfiction",
    "Communication"
  ],
  "author": "Maria Keckler",
  "average_rating": "4.53",
  "url": "https://www.goodreads.com/book/show/25373616-bridge-builders"
}