{
  "title": "Ordine mondiale",
  "description": "Un ordine mondiale veramente globale, cioè un assetto delle relazioni internazionali riconosciuto e condiviso da tutti gli Stati, non è mai esistito nella storia, perché le diverse civiltà hanno sempre considerato la propria cultura e le proprie leggi le uniche universalmente valide. Così ogni epoca è stata caratterizzata dalla supremazia di una o più potenze egemoni che hanno cercato di imporre, nelle rispettive zone d'influenza, il proprio modello di organizzazione politica e statuale, con esiti più o meno duraturi, ma comunque sempre transitori. Lo dimostra l'attuale sistema unipolare a guida statunitense, affermatosi ormai da un quarto di secolo, che dopo aver tentato di esportare su scala planetaria i principi della democrazia e del libero mercato, sembra avviato verso un inarrestabile declino. Ad affermarlo non è un politologo estremista e antioccidentale, bensì Henry Kissinger, che del potere americano e della «vittoria» sull'Unione Sovietica nella guerra fredda è stato uno dei maggiori artefici, nelle vesti di consigliere per la Sicurezza nazionale e di segretario di Stato. Per giungere a questa conclusione e per scrutare nuovi possibili scenari, Kissinger rivisita momenti cruciali della storia mondiale del secondo dopoguerra, riflette sul futuro dei rapporti tra Stati Uniti e Cina, esamina le conseguenze dei conflitti in Iraq e Afghanistan, analizza i negoziati nucleari con l'Iran, le reazioni dell'Occidente alla Primavera araba e le tensioni con la Russia sull'Ucraina. E rivolge all'Europa uno sguardo preoccupato: il processo di superamento degli Stati nazionali, infatti, non ha creato un nuovo soggetto politico, ma un vuoto di autorità interno e una debolezza ai confini, mentre nella vicina regione mediorientale le strutture governative centrali si dissolvono in una miriade di scontri su basi etniche e confessionali. E allora, quale sarà il nuovo ordine mondiale? E chi ne avrà la leadership? Certamente, sostiene Kissinger, l'America manterrà un ruolo geopolitico di primo piano, ma dovrà imparare a svolgerlo di concerto, oltre che con i tradizionali alleati, anche con i nuovi attori affacciatisi prepotentemente sulla ribalta internazionale, sviluppando insieme a tutte le nazioni protagoniste della vita internazionale «una seconda cultura globale, strutturale e giuridica» che trascenda gli interessi particolari e rispetti profondamente la storia e la cultura di ogni paese.",
  "genres": [
    "Politics",
    "History",
    "Nonfiction",
    "International Relations",
    "Political Science",
    "Economics",
    "World History"
  ],
  "author": "Henry Kissinger",
  "average_rating": "4.05",
  "url": "https://www.goodreads.com/book/show/25375256-ordine-mondiale"
}