{
  "title": "Waterproof Justice",
  "description": "In its heyday, Basin Street was the Park Avenue of prostitution. In 1947, Minnie Tucker runs the last great sporting house in the French Quarter. Ruby Smith comes to New Orleans with a new husband and high hopes, only to find her marriage is a sham. She needs a job and a place to live and Minnie needs an honest bookkeeper, so she hires Ruby who easily manages both sets of Minnie’s books. Ruby is just settling into her new life when she sees Anthony Scapesi, son of Don Scapesi, head of the local Mafia, kill a man. As the only witness, Ruby knows she must leave town.  She ends up in Waterproof, a backwater on the Mississippi where she thinks she can hide. True to her Choctaw heritage, Ruby is a woman of few words. However, she is drawn into small town life. Bitsy Verner, a self-appointed matchmaker wastes no time in introducing her to Sheriff Nate Houston, a widower.  Nate has recently returned from WWII with a piece of shrapnel in his knee. He just wants peace and quiet to heal his mind and body. However, keeping peace in Waterproof isn’t easy. First there is Bud Garvey, the town troublemaker. Then there’s Luther. He is a permanent fixture in the sixth grade and no one expects him to amount to much. But when Nate hires him, we learn Luther has an uncommon ability to see straight to the heart of a problem.  On the home front, Nate’s daughter, Carrie, is coping with becoming a teenager. And finally there’s Miss Laura, his mother-in-law who—like Bitsy—is vitally interested in Nate’s love life. Nate is attracted to Ruby but prefers to do things on his own terms.  When Bud Garvey’s pickup is stolen, he insists that Nate arrest Arlan Walker although it’s clear the boy was just in the wrong place at the wrong time. Arlan refuses to identify his brother as the driver and the case ends up in court. In a fit of anger, Judge Swetman commandeers the trial and sentences Arlan to 15 years in Angola, the bloodiest maximum-security prison in America. A brutal killing at the prison prompts Arlan to escape during a hurricane. He is presumed dead and when Luther and Carrie find him, they persuade Nate to help the boy.  In the meantime, Anthony Scapesi follows Ruby to Waterproof and attempts to silence her. Ruby returns to Minnie’s. In an effort to find her, Tony captures Luther and beats him severely. Tony demands an answer and finally Luther gives him one. However, rather than giving Tony what he wants, it turns out to be his undoing.  With Arlan safe and Tony gone, Nate goes to New Orleans to meet Ruby at Minnie’s and arrives on the night Louis Armstrong comes back to Basin Street where he delivered coal to houses in The District when he was a boy. It is a night no one will ever forget.",
  "genres": [],
  "author": "Grace  Hawthorne",
  "average_rating": "4.27",
  "url": "https://www.goodreads.com/book/show/25366010-waterproof-justice"
}