{
  "title": "A Long Time Until Now",
  "description": "Book 1 in a new series from the creator of the best-selling Freehold Universe series. A military unit is thrust back into Paleolithic times with only their guns and portable hardware.Ten soldiers on convoy in Afghanistan suddenly find themselves lost in time. Somehow, they arrived in Earth's Paleolithic Asia. With no idea how they arrived or how to get back, the shock of the event is severe. They discover groups of the similarly Imperial Romans, Neolithic Europeans, and a small cadre of East Indian peasants. Despite their technological advantage, the soldiers only have ten people, and know no way home. Then two more time travelers arrive from a future far beyond the present. These time travelers may have the means to get back, but they aren't giving it up. In fact, they may have a treacherous agenda of their own, one that may very well lead to the death of the displaced in a harsh and dangerous era.At the publisher's request, this title is sold without DRM (Digital Rights Management).About Michael Z. “A fast-paced, compulsive read…will appeal to fans of John Ringo, David Drake, Lois McMaster Bujold, and David Weber.” – Kliatt“Williamson's military expertise is impressive.” –SF ReviewsMichael Z. Williamson is retired military, having served twenty-five years in the U.S. Army and the U.S. Air Force. He was deployed for Operation Iraqi Freedom and Operation Desert Fox. Williamson is a state-ranked competitive shooter in combat rifle and combat pistol. He has consulted on military matters, weapons and disaster preparedness for Discovery Channel and Outdoor Channel productions and is Editor-at-Large for Survivalblog, with 300,000 weekly readers. In addition, Williamson tests and reviews firearms and gear for manufacturers. Williamson’s books set in his Freehold Universe include Freehold, Better to Beg Forgiveness . . ., Do Unto Others . . ., and When Diplomacy Fails . . .. He is also the author of The Hero–written in collaboration with New York Times bestselling author John Ringo. Williamson was born in England, raised in Liverpool and Toronto, Canada, and now resides in Indianapolis with his wife and two children.",
  "genres": [
    "Science Fiction",
    "Time Travel",
    "Fiction",
    "Military Fiction",
    "Audiobook",
    "Alternate History",
    "Military Science Fiction"
  ],
  "author": "Michael Z. Williamson",
  "average_rating": "3.86",
  "url": "https://www.goodreads.com/book/show/25367908-a-long-time-until-now"
}