{
  "title": "Cold East",
  "description": "‘Meet Aidan Snow, an ice-cold operative in a red-hot adventure. You won't be disappointed.’ - Stephen Leather, Sunday Times bestselling author of the Spider Shepherd series.  In Ukraine, MI6 operative Aidan Snow rescues a British national held by Russian insurgents.  In the United States, a terrorist attack is thwarted by a man who does not exist.  In Russia, a notorious Chechen terrorist escapes from the nation’s most secure prison.  And in Afghanistan, a Red Army soldier long given up for dead delivers a chilling message: Al-Qaeda has an RA-115A, otherwise known as a ‘suitcase nuke’.  As the connection between these separate events begins to become clearer, MI6 and the CIA must attempt to prevent the world’s first act of nuclear terrorism.  But who has the weapon, and what is the target?  Stretching from London to Langley, Virginia, from Afghanistan to Chechnya and the Caucasus, Intelligence services the world over must work together to foil the terrorist threat that lurks in the shadows.  The clock is ticking.  And you never know who you can trust.  Aidan Snow faces his biggest challenge yet, and if he fails, thousands will be incinerated.  Cold East is an international contemporary thriller, perfect for fans of David Baldacci, Chris Ryan and Tom Clancy.   Praise for Alex Shaw   'Shaw’s writing sizzles across the page like the flame on a short fuse racing to detonation. Fans of Clancy, McNab, Ryan and Leather, will love Aidan Snow.' – Matt Hilton, bestselling author of the Joe Hunter thrillers.  ‘He won’t be stopped now. The book will become popular among Kyiv’s expats; some of them will even recognize themselves.’ - \nKyiv Post\n  'A perfect blend of spy fiction and political thriller' - Matt Lynn, author of Search.  Alex Shaw spent the second half of the 1990s in Kyiv, Ukraine, teaching and running his own business consultancy before being head-hunted for a division of Siemens. The next few years saw him doing business for the company across the former USSR, the Middle East, and Africa. He is a member of the International Thriller Writers organisation, the Crime Writers Association and the author of the Aidan Snow SAS thrillers.Alex, his wife and their two sons divide their time between homes in Kyiv, Ukraine and Worthing, England. Alex can be contacted via his website www.alexshaw.com or you can follow him on twitter: @alexshawhetman   Endeavour Press is the UK's leading independent digital publisher. For more information on our titles please sign up to our newsletter at www.endeavourpress.com. Each week you will receive updates on free and discounted ebooks. Follow us on Twitter: @EndeavourPress and on Facebook via http://on.fb.me/1HweQV7. We are always interested in hearing from our readers. Endeavour Press believes that the future is now.",
  "genres": [
    "Thriller"
  ],
  "author": "Alex   Shaw",
  "average_rating": "4.12",
  "url": "https://www.goodreads.com/book/show/25372793-cold-east"
}