{
  "title": "A Change Is Gonna Come: Music, Race & the Soul of America",
  "description": "\". . . extraordinarily far-reaching. . . . highly accessible.\"-Notes\"No one has written this way about music in a long, long time. Lucid, insightful, with real spiritual, political, intellectual, and emotional grasp of the whole picture. A book about why music matters, and how, and to whom.\"-Dave Marsh, author of Louie, Louie and Born to Run: The Bruce Springsteen Story\"This book is urgently needed: a comprehensive look at the various forms of black popular music, both as music and as seen in a larger social context. No one can do this better than Craig Werner.\"-Henry Louis Gates, Jr., W.E.B. Du Bois Professor of the Humanities, Harvard University\"[Werner has] mastered the extremely difficult art of writing about music as both an aesthetic and social force that conveys, implies, symbolizes, and represents ideas as well as emotion, but without reducing its complexities and ambiguities to merely didactic categories.\"-African American ReviewA Change Is Gonna Come is the story of more than four decades of enormously influential black music, from the hopeful, angry refrains of the Freedom movement, to the slick pop of Motown; from the disco inferno to the Million Man March; from Woodstock's \"Summer of Love\" to the war in Vietnam and the race riots that inspired Marvin Gaye to write \"What's Going On.\"Originally published in 1998, A Change Is Gonna Come drew the attention of scholars and general readers alike. This new edition, featuring four new and updated chapters, will reintroduce Werner's seminal study of black music to a new generation of readers.Craig Werner is Professor of Afro-American Studies at the University of Wisconsin, and author of many books, including Playing the Changes: From Afro-Modernism to the Jazz Impulse and Up Around the Bend: An Oral History of Creedence Clearwater Revival. His most recent book is Higher Ground: Stevie Wonder, Aretha Franklin, Curtis Mayfield, and the Rise and Fall of American Soul.",
  "genres": [
    "Music",
    "History",
    "Nonfiction",
    "Race",
    "Politics",
    "African American",
    "Sociology"
  ],
  "author": "Craig Werner",
  "average_rating": "4.13",
  "url": "https://www.goodreads.com/book/show/253757.A_Change_Is_Gonna_Come"
}