{
  "title": "Awake in the Dark Box Set",
  "description": "The first three novels in the series that readers are describing as \"so dark and so funny.\"  This omnibus edition includes the first THREE books in the best-selling Awake in the Dark series.  A 27 year old slacker has seizures during which he may or may not be astral projecting.  What he learns might have the power to change the world.  One second JEFF GROBNAGGER is standing in line at the grocery store, and the next he's in an alley where a hooded figure strangles him to death.  So that sucks.  This happens over and over again, every time Grobnagger has a seizure. Alley. Choking. Death. Repeat. What for? Why would anyone want to kill him repeatedly? Is it just a recurring seizure dream? When a sniper's bullet shatters his apartment window, he realizes two things: he's in serious danger, and there's no way he's getting his security deposit back.  Who is the hooded man? And who tried to kill Grobnagger in real life? His quest for answers leads to a missing girl, cults obsessed with astral projection, an arcane puzzle sphere, an evil book, a private detective named Louise and a mustached man named Glenn that makes the most delicious food he's ever tasted.  No one he meets is who they seem, and every answer leads to more questions, more seizures and more horrific deaths that may or may not be transpiring on some mysterious plane beyond the physical world.  \nScroll up and hit LOOK INSIDE to check out the first few chapters.\n  BLED WHITE (Book 2)  All Jeff Grobnagger wanted was to be left alone. The events of Fade to Black (Awake in the Dark #1) shifted his goal from a life of solitude to figuring out what the hell is happening to him ASAP, so he can, you know, get back to the solitude.  His journey takes another twist when a burned corpse sporting a League of Light robe turns up in a vacant lot. Working undercover to solve the murder reveals bigger and bigger clues about his seizures. Solve the murder, solve the seizures? Maybe. He meets new people and is shown new places on the other side. But who and what can he trust? Just as he realizes that someone close may be working against him, he gets blindsided by the biggest shock yet.  RED ON THE INSIDE (Book 3)  The events of the first two books leave Grobnagger drained, often struggling to stay awake. He shuffles through life half awake, half tethered to reality. He still has no idea what is happening to him, but he's not sure he even cares anymore.  When those that mean him harm finally begin to assert themselves, however, Grobnagger finds himself and his friends under direct threat of death. Plans are made to cross over and rescue Amity once and for all from her vulnerable position in the other world. But his adversaries are one step ahead and a violent spectacle becomes inevitable.  Praise for the Awake in the Dark series:  \"Fade to Black is the funniest book I've read in... I can't remember how long. Seriously funny. I think I laughed out loud roughly once every three pages. That's a lot of funny packed into one book! And not just an internal chuckle here and there, but an honest to goodness laugh out loud that made my significant other call, 'What?' from the next room repeatedly.\" - Lisbeth Ames  \"(FADE TO BLACK) weirdly resonates with me. It is sneaky in a way – it holds the things we fear up to the light – opening the reader up to honesty – to love and hope and the truths of our souls found in the darkest of nights.",
  "genres": [
    "Fantasy"
  ],
  "author": "Tim McBain",
  "average_rating": "3.58",
  "url": "https://www.goodreads.com/book/show/25376769-awake-in-the-dark-box-set"
}