{
  "title": "Rough Sketch",
  "description": "He's got it fame, money, sex appeal... but bad-boy artist Hudson Jones is already a complete mess at twenty-five, and all his friends know it. They've witnessed the heavy drinking and drugs, the out-of-control fighting, and the scores of damaged women who have dared to spend the night with him, willing to endure his brutal dominance for the chance to be seen with a star. But no one knows why Hudson has a violent streak, and he prefers to keep it that way. Besides, he's pretty sure he can suppress his habits for Lilith's sake. But when figures from his horrific past resurface and he can no longer ignore the trauma he once endured, his compulsive need for control threatens to take over.Pleasant, bubbly Lilith Hughes just wants to focus on her art. After all, she's travelled all the way to Canada from England on her parents' dime just to have some time alone with a canvas and a brush. And maybe she wouldn't have fallen so hard for Hudson if her friends hadn't warned her about how screwed up and dangerous he is. But she has become intrigued by this sexy rebel with the mysterious nightmares that have him pleading for mercy in his sleep, and now all she wants to do is fix the broken bad boy and show him the love he's never had. And so what if he is known for being rough in the bedroom? She knows what she's getting herself into... at least, she thinks she knows...Please this book contains dark themes, discussions of child abuse, and graphic depictions of rough sex, and is suitable for a mature audience.“Can I look?”He hesitated. He had only ever allowed Maddy to see his sketches. They were personal and dark, a glimpse at the broken parts of his soul. His sketches came unedited, unfiltered, a scribble of his hand to create exactly what he was thinking of. Unlike his paintings. When he painted, he portrayed only what he wanted people to see. But, like Mad before her, Lilith probably wouldn't have any idea what the images meant, and besides, she hadn't laughed at him for crying in his sleep like some dumb little kid. Maybe his soul was safe with her.“Yeah, go ahead.” He tried to sound casual, but his voice came out too loud and his hands shook.He watched as she opened the book, her delicate fingers handling it as if it were made of the finest gossamer. On the first page was an almost exact sketch of the rock-and-stream painting, except that in this picture there was an opening in the cliff framed with wood, the entrance to a mine. She turned to the next page, a sketch of the meadow painting, exactly the same except for a small hole in the earth where the meadow rose into a bit of a hill, the type of hole a fox might live in. He could see the question on her face before she spoke it.“Why are these ones different?” she asked.The dreaded question. He shrugged. “They're just rough sketches, like a first draft. Not a final product at all. I take out the unnecessary parts when I paint them.” There, would that be enough explanation? No, apparently not, because the next question was already forming on her lips, the same Mad had asked when he saw the first sketches in the series, ages ago.“Well, the paintings are called Small Spaces, though, aren't they? You took out the only small spaces in the pictures.”“Yeah, but I just name them whatever I feel like. You know, art and all that.” He waved his hand like it didn't matter. Never mind that he had named twenty-three paintings the exact same thing.",
  "genres": [],
  "author": "Teega Mack",
  "average_rating": "3.44",
  "url": "https://www.goodreads.com/book/show/25379320-rough-sketch"
}