{
  "title": "A Piece of Jesus' Shirttail",
  "description": "This is the story of a week in the life of precocious, 12-year-old Barky Darden . Barky approaches life in the manner of a satirical idealist, wringing humor from drudgery and folly from his penchant for telling “little white lies.”His narrative reminiscence reveals an ardent search for life’s meaning and purpose, as evidenced by the capricious relationship that develops between himself and Divinity .Barky, a student of human nature, becomes deeply troubled by the contradictions associated with “white Christianity” and its interactions with “negroes” and determines to become a Good Samaritan in the tradition and likeness of Jesus’ related parable. The sudden career change from farm boy to knight errant immediately sets him in perilous opposition, not only with certain family members, but against a community religiously devoted to the spirit of the Antebellum South and the Ku Klux Klan. 70-year-old Mack Sumberlin, an ancestor of Nat Turner and a laborer on the family farm, befriends Barky despite the societal taboo of the time. Barky’s remarkable relationship with Mack, along with those he develops with an actual, tangible Jesus and a female cousin named Ginger, provide pivotal insights into Barky’s Messianic transformation, which is as genial as it is disturbing.In this novel, Griffin presents realism--related to the black language and lifestyle of the time--without minstrelsy, and reason without denigrating commentary. Rather than seeking to moralize, per se, he attempts to pique personal introspection within readers in regards to their relationships with both God and their fellow human beings. He cultivates an attitude of genuine reflection within hearts and minds versus outlining a “you should do this” critique of society’s values and ethics.Born in 1955, the year Rock and Roll was born and the Brooklyn Dodgers won their first World Series, Norfleet Griffin was raised in Franklin City, Virginia in Southampton County.Born with wanderlust in his bones, he joined and served in the U.S. Marine Corps, and has traveled extensively. For the past ten years, Griffin has resided in Bozeman, Montana, where he became a serious minded writer.As a poet, he learned of his soul’s longing to see social justice and equality for all. A Piece of Jesus’ Shirttail is a study of cynicism, human frailties in the struggle for equality, and of brutality in its basest form.Despite its title, A Piece of Jesus’ Shirttail is not a “Christian” novel, but rather reveals Griffin’s personal views against religious hypocrisy and racial bigotry. Sprinkled liberally with humor, miracles, immorality, and unconditional love, it is a fictional account of racism with one eye on the times and the other on the conscience’s reaction to it. But above all, this novel is a presupposition of what happens when the natural and supernatural realms collide violently-with purpose.A Piece of Jesus’ Shirttail is Griffin’s first novel.",
  "genres": [],
  "author": "Norfleet Griffin",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/25378102-a-piece-of-jesus-shirttail"
}