{
  "title": "Rumpole At Christmas",
  "description": "Rumpole at Christmas - the hilarious festive stories of John Mortimer's greatest character 'Without Rumpole, the world would be a poorer place' Daily Mail Horace Rumpole is not overfond of the rituals of turkey, tinsel and the like. But happily the festive season is not one respected by the criminal fraternity; meaning that celebrations in the Rumpole household are frequently disturbed in most-welcome ways. There's the suspicious Father Christmas at Equity's Court's festive party. The actor who goes missing from the panto on the night of a major crime. As well as the body cluttering up the health farm (where the great barrister is gloomily restricted to a diet of yak's milk and steamed spinach to please She Who Must Be Obeyed). These seven wonderful Rumpole stories show the great man at his sharpest, wittiest and best. Readers of Sherlock Holmes, P.D. James and P.G. Wodehouse will love this book. 'One of the great comic creations of modern times' Evening Standard 'There is a truth in Rumpole that is told with brilliance and grace' Daily Telegraph 'Rumpole remains and absolute delight' The Times Sir John Mortimer was a barrister, playwright and novelist. His fictional political trilogy of Paradise Postponed, Titmuss Regained and The Sound of Trumpets has recently been republished in Penguin Classics, together with Clinging to the Wreckage and his play A Voyage round My Father. His most famous creation was the barrister Horace Rumpole, who featured in four novels and around eighty short stories. His books in Penguin The Anti-social Behaviour of Horace Rumpole; The Collected Stories of Rumpole; The First Rumpole Omnibus; Rumpole and the Angel of Death; Rumpole and the Penge Bungalow Murders; Rumpole and the Primrose Path; Rumpole and the Reign of Terror; Rumpole and the Younger Generation; Rumpole at Christmas; Rumpole Rests His Case; The Second Rumpole Omnibus; Forever Rumpole; In Other Words; Quite Honestly and Summer's Lease.",
  "genres": [
    "Christmas",
    "Humor",
    "Fiction",
    "Short Stories",
    "Crime",
    "Mystery",
    "Audiobook"
  ],
  "author": "John Mortimer",
  "average_rating": "4.12",
  "url": "https://www.goodreads.com/book/show/10171282-rumpole-at-christmas"
}