{
  "title": "Novels 1987–1997: Bluebeard / Hocus Pocus / Timequake",
  "description": "In the mid-1980s Kurt Vonnegut entered the final decades of his long and abundantly creative life. Like his earlier fiction, the three novels of his late period combine elements of Swiftian satire, pulp-magazine fantasy, and a small-town midwesterner’s sense of common decency. But they are also suffused with something new: an aching nostalgia for a remembered America on the verge of disappearing forever. Bluebeard (1987) is a tale of the artist’s life as told by Rabo Karabekian, a gifted figurative painter who in the postwar years shrewdly adopted abstraction and earned himself a place in the art world alongside Pollock and Rothko. Now, as he enters his seventies, his minimalist paintings—much in vogue until the substandard acrylics he used began curling off their canvases—have become curatorial liabilities, and his name, once great, has been reduced to one of art history’s comic footnotes. Rueful and alone at his estate in the Hamptons, he retires to a padlocked barn to write his memoirs—and to embark upon a final creative act that just might redeem him, if only in his own eyes. Hocus Pocus (1990) is another kind of autobiography entirely: the prison memoirs of Eugene Debs Hartke, a former professor of physics who has come to a bad end at the end of a bad century. Dismissed from the faculty of Tarkington College for allegedly airing “negative” thoughts in the classroom, Hartke is accused by the U.S. government of masterminding an uprising at Tarkington’s neighboring institution, the N.Y. State Maximum Security Correctional Facility at Athena. Hartke’s episodic memoirs read like antic op-ed pieces on issues that still bedevil our country today—academic freedom, race and class and gender, environmental calamity, and the effects of “progress” on human dignity. The premise of Timequake (1997), Vonnegut’s last completed novel, is that on February 13, 2001, the universe suffered a crisis in self-confidence and stopped expanding indefinitely, and that time skipped like a record needle back to February 17, 1991. Consequently, all humanity was forced to relive an entire decade, self-aware but robbed of the happy illusion of free will. “We all had to get back to 2001,” says Vonnegut, moving forward “the hard way, minute by minute, hour by hour, year by year, betting on the wrong horse again, marrying the wrong person again, getting the clap again. You name it!” Kilgore Trout—running for a second time an obstacle course of his own construction—is the hero of half the story, and the author himself the hero of the rest. Rounded out with a selection of short nonfiction pieces intimately related to these three works, this volume presents the final word from the artist whom the San Francisco Chronicle, reviewing Timequake, called an “old warrior who will not accept the dehumanizing of politics, the blunting of conscience, and the glibness of the late-twentieth-century Western world.”",
  "genres": [
    "Fiction",
    "Novels",
    "Classics",
    "American"
  ],
  "author": "Kurt Vonnegut Jr.",
  "average_rating": "4.26",
  "url": "https://www.goodreads.com/book/show/25387922-novels-1987-1997"
}