{
  "title": "Hell In The Choirstand",
  "description": "There’s no battle like a spiritual one! In HELL IN THE CHOIRSTAND, Jeremiah David Day moves to the spiritually desolate city of Olds. Jeremiah, an anointed Gospel musician, receives an invitation from Rev. Daniel Trantham, the pastor of Ezekiel Baptist Church, to become their minister of music. Ezekiel’s congregation welcomes Jeremiah as he goes to work establishing the music department as an army of worshipers, but Renard Singleton, the church organist, feels that Jeremiah is unnecessarily disturbing the natural order of things. Renard resents being overlooked for the music minister position, and enters into a spree of revenge against Jeremiah through botched choir rehearsals and petty squabbles with individual singers. Renard concentrates the majority of his activities, however, in the spiritual realm. Unbeknownst to Jeremiah, Renard is a member of the Society of Tyrus; a secretive, demonic cult of musicians with chapters (The Pentagrammatory) that span across the country. Renard prepares a series of musical spells and incantations; prescribed from a book (Codified Manual of Tyrus) whose origin dates back to the 9th century and believed to be inspired by Heaven’s (excommunicated) original chief musician, Lucifer. Renard’s intention – use music to erect confusion among God’s people through the worship services. Renard’s father, Adrian, attempts to dissuade his son’s scheme with the admission of a thirty year old family secret, but it’s to no avail. Equipped with the new information, Renard heightens his damnable acts – the planting of arcane devices in Bibles, morbid musical arrangements, and secular compositions that call for the eradication of the people of God. As the story progresses, the Tyrus Society’s annual DOA – a nationwide strategic confusion of church worship - is fast approaching, and Renard wants to be at the forefront of the movement. But God has sharpened Jeremiah’s weapon. A battle ensues as the two musicians take up arms. Jeremiah embraces the Lord while Renard clutches the Ras el-Ain. The result is a musical showdown in the middle of a worship service where human and instrumental voices unite to summon the ear of God and mobilize an angelic host. The Heavens are telling! HELL IN THE CHOIRSTAND is a revelation of the power that music possesses and how faith in God restores and upholds a people, a city, and the world.",
  "genres": [],
  "author": "Titus Pollard",
  "average_rating": "4.33",
  "url": "https://www.goodreads.com/book/show/25391040-hell-in-the-choirstand"
}