{
  "title": "The Wild Side Trilogy",
  "description": "This boxed set contains the complete Wild Side trilogy.THE WILD SIDE ARE YOU READY TO TAKE A WALK?Alasdair Masters is in a rut. He just hit forty, has been nearly celibate for the past year, and his life has turned into a daily sequence of lonely patterns that revolve around avoiding human contact. His tidy life is turned on its head when a hot young blonde at the gym that’s been pseudo-stalking him decides to rock his world. A very young blonde. Way, way too young for him. The problem is, he can’t seem to tell her no, and she just keeps coming back for more. It doesn’t help that he’s ninety percent sure she’s a criminal, and still, he can’t seem to turn her down. What is a dull introvert to do when a chaotic cyclone that oozes sexuality comes twisting into his life? At first, he thinks she’ll give him a heart attack, but after his twenty-year marriage ended a year ago, he’s been a little lost, and when she comes crashing into his life, he realizes that he’s never felt more alive. Is a walk on the wild side just what he needs to get his life on track or a disaster in the making? Is it possible for someone that much younger to be just what he needs, or is she a fortune hunter, as everyone keeps telling him? Is it his hormones telling him that the mysterious younger woman is the one, or could it be more?IRIS (THE WILD SIDE #2) ARE YOU READY FOR A TWIST? Who is Iris? Where did she come from? Where has she gone? Alasdair Masters has more questions than answers about his new, too young obsession, and when he finds out she’s been lying to him, from their first meeting to their last one, he’s more confused than ever about her feelings, her intentions. And what’s just as confusing are his own feelings. Has he turned something purely physical into something emotional in his own head? Is any of it mutual? The only thing he doesn’t question is whether he’ll keep going back for more. DAIR Me, I was simple. I was order. A very neat, efficient machine that ran on nothing but air. Me plus anyone else, well, that was another matter. And me plus Iris, that was a monster of a machine, with all gears going at different speeds, some spinning off their hinges, just going mad, but it was a wonderful madness, at full throttle, misfiring in all directions. It felt wonderful and dreadful. I was breaking down, and it felt amazing. And terrifying.DAIR (THE WILD SIDE #3) ARE YOU READY FOR THE TRUTH? I’d started writing everything about her down. I didn’t want to forget. The color of her hair. The depth of her eyes. The stubborn shape of her jaw. The way her lips shaped words with such expression. The way her voice made my chest ache. The way she gave advice beyond her years. The way she listened like she cared about every word. The way she made me feel—Alive. Every curve and hollow of her body was recorded, in my mind, and now my hard drive. There was a bit of truth in every lie, and even if it had only been fed to me in the smallest increments, I wanted, needed to remember the real Iris. Because in the end, there was one irrefutable thing that I couldn’t deny. Hostage or hustler, sinner or saint, whatever she was or wasn’t, whether she lied to my face or taunted me with hints of the truth, all of this seemed always to defer to the more pertinent fact at hand. She was mine. Inconceivably. Undeniably. Mine. After yet another shocking discovery, followed by a disturbing letter, Dair is almost certain Iris has left his life for good. He tries his best to move on. Easier said than done, and when an unexpected and dangerous opportunity arises for him to find out what happened to her, he doesn’t hesitate to take it. As usual, with Iris, the answer leaves him more lost than the question. Every revelation is shrouded in mystery, and every disclosure leaves Dair more in the dark than ever.",
  "genres": [
    "Audiobook",
    "Romance",
    "Erotica",
    "Contemporary Romance",
    "BDSM",
    "Adult",
    "Erotic Romance"
  ],
  "author": "R.K. Lilley",
  "average_rating": "4.07",
  "url": "https://www.goodreads.com/book/show/25398206-the-wild-side-trilogy"
}