{
  "title": "To Fight Alongside Friends: The First World War Diary of Charlie May",
  "description": "The First World War Diaries of Manchester Pals Captain Charlie May – written and kept in secret and published now for the first time. A born storyteller, Charlie May’s vivid eye for detail and warm good humour brings his experience in the trenches (and the experience of millions of ordinary men like him) to life for a 21st-century readership. Captain Charlie May was killed, aged 27, in the early morning of 1st July 1916, leading the men of ‘B Company’, 22nd Manchester Service Battalion (the Manchester Pals) into action on the first day of the Somme. This tolerant and immensely likeable man had been born in New Zealand and – against King’s regulations – he kept a diary in seven small, wallet-sized pocket books. A journalist before the war and a born storyteller, May’s diaries give a vivid picture of battalion life in and behind the trenches during the build-up to the greatest battle fought by a British army and are filled with the friendships and tensions, the home-sickness, frustrations, delays and endless postponements, the fog of ignorance, the combination of boredom and terror to which every man that has ever fought could testify. His diaries reflect on the progress of the war, tell jokes – good and bad, give details of horse-rides along the Somme valley, afternoons with a fishing rod, lunch in Amiens, a gastronomic celebration of Christmas 1915 and concerts in ‘Whiz Bang Hall’. He describes battles not just with the enemy, but with rats, crows and on the makeshift football pitch – all recorded with a freshness that brings these stories home as if for the first time. The diaries are also written as an extended and deeply-moving love letter to his wife Maude and baby daughter Pauline. ‘I do not want to die’, he wrote – ‘Not that I mind for myself. If it be that I am to go, I am ready. But the thought that I may never see you or our darling baby again turns my bowels to water.’ Fresh, eloquent and warm, these diaries were kept secret from the censor and were delivered to his wife after his death by a fellow soldier in Charlie’s company. Edited by his great-nephew and published for the first time, these diaries give an unforgettable account of the war that took Charlie May’s life, and millions of others like him.",
  "genres": [
    "Nonfiction",
    "World War I",
    "War",
    "Research",
    "Memoir"
  ],
  "author": "Gerry Harrison",
  "average_rating": "4.25",
  "url": "https://www.goodreads.com/book/show/25394454-to-fight-alongside-friends"
}