{
  "title": "Medical Industrial Complex",
  "description": "MEDICAL INDUSTRIAL COMPLEX: The $ickness Industry, Big Pharma and Suppressed Cures is a no-holds barred critique of mainstream medicine and the various players who make up one of the largest and most profitable industries on the planet. Written by novelists, filmmakers and independent researchers James Morcan & Lance Morcan, with a foreword by retired pharmacist Denis Toovey (author of Better Health for You: An Insider's Big Picture Guide), this explosive book explores the contention that Big Pharma and other participants in the healthcare sector put profits ahead of patients’ wellbeing and dollars ahead of lives. MEDICAL INDUSTRIAL COMPLEX leaves no doubt that something has run amuck in the medical field, and what should be the noblest profession has been severely compromised by the various conflicting interests. The authors examine this in language anyone can understand. In the process, they draw attention to the rampant commercialism, political selfishness and dogmatic academia that plagues the industry. The reader is reminded there are many honorable people within the medical establishment who are doing incredible things for their fellow Man. However, the reader is also reminded that doctors, hospitals, medical academia, pharmaceutical companies, medical equipment suppliers, health insurers et al make their money from sick people, not healthy people, and if everyone was healthy many of the aforementioned would be out of business…so it’s hardly in their financial interests to cure illnesses and ailments. MEDICAL INDUSTRIAL COMPLEX asks some hard questions. Questions like: Is your doctor one of those (doctors) who receives kickbacks from pharmaceutical companies? How dangerous are our hospitals for patients? Do the drug companies make drugs or money? Is vaccinating children the smart thing for parents to do? Do you know the medical tests that may kill you? Are cures really being suppressed? What’s the solution regarding private health insurance? Who is quashing alternative medicines? When did your doctor last talk to you about your diet? Above all the reader is urged to stop giving away complete responsibility to doctors and other healthcare providers. “It’s time to start looking at these people as they actually are: advisors for YOU to make decisions about what’s best for YOUR body.”",
  "genres": [
    "Nonfiction",
    "Health",
    "Medicine",
    "Science",
    "Politics",
    "Health Care",
    "Medical"
  ],
  "author": "James Morcan",
  "average_rating": "4.11",
  "url": "https://www.goodreads.com/book/show/25393264-medical-industrial-complex"
}