{
  "title": "Requisite",
  "description": "Contemporary Erotic Romance about two broken people coming together and fixing each other's painful pasts. A story of heartbreak and complications to find love in an unlikely situation. Written in the voices of Lenka and Malcom as it takes place in sunny South Africa.When they say it's not always sunshine in paradise, they mean it. When Lenka and Malcom finally seem to catch a break from the ever-present demons and a new surprise follows their return home, it becomes a blissful life. But when Malcom discovers something worrying, he keeps it from Lenka and soon the demons rise again.Malcom's agreements become headline news and all the women he trained are brought into the spotlight. Lenka loses all her credibility just when she has learned that she deserved the name she made for herself. Family and friends are left with contradicting reactions toward Lenka and Malcom's relationship's origin and Lenka struggles to handle it.One terrible turn for the worst, takes them to a place where Lenka knows she has to use her past's pain to get through it all as Jeffrey's evilness takes on a new form. The one thing they know this time is that for Lenka to be saved, Malcom must become the man he promised to never be again.Note from This book (and series) wasn't written according to the 'Erotic Romance novel formula', it is complete smut according to most of the feedback I've received. So don't consider this if more than ten sex scenes will totally freak you out. (Yes, there is a ton of them...the actually number you'll need to find out for yourself) Before you run though, this book's theme is about how sex can free you from your demons. The purpose with Sparks and Sparrows was not to make the sex redundant, just because I wanted to. I wanted to give the readers enough sex scenes as I, as a reader, sometimes feel they lack in Erotic Romance novels, and in this series they actually have an important purpose. Sex is beautiful and how you perceive it, is just a person's personal view. Also, as most people I know - myself included - like to read only a few chapters an evening before going to bed, the idea was to have a developing storyline, while still having AT LEAST ONE sex scene (grownup bedtime story) per chapter. Honest opinions and reviews are still welcome; this is just here to give a honest insight of the book, before you consider it.See you on the other side,Chevoque",
  "genres": [],
  "author": "Chevoque",
  "average_rating": "4.33",
  "url": "https://www.goodreads.com/book/show/25390695-requisite"
}