{
  "title": "Reawakening",
  "description": "“I’m not a piece of property that you can just claim, Romaric.”Having been held hostage for a month by vicious vampires, Sarah is now recovering in the most unlikely of places…the shelter that her sister, Kate and her vampire mate, Devon, opened to help such victims as herself. After months under the watchful eye of her sister, she’s finally put a plan into motion to secure her future when a very imposing, very stoic and utterly drop dead gorgeous vampire takes her world by storm and turns it completely upside down.“Ah, but that’s where you’re wrong, my beauty. You are mine and I’ve come to do exactly that.”Romaric Dietrich, West Regent Vampire Lord is one of the oldest vampires alive. He’s cold, calculating and nearly unmatched in power. Vampires recognize their Moiras instantaneously and upon first laying eyes on Sarah Hill, he senses she’s his. His Moira. His Destined mate. The one woman meant to be his and his alone. But how is that possible when he’d loved and lost his first? In his quest to uncover the truth, not only does he discover that Sarah is indeed the other half of his soul, but he’s put himself, and his mate, in the crosshairs of yet another very powerful enemy.Only bonded together do they have the power to win the battles ahead.With one look into his icy-blues, Sarah knows that Romaric is not the aloof, uncaring enigma he pretends to be. Underneath his cool, rough exterior lays a passionate, romantic and fiercely loving heart of gold. As they fight the battles to come, Sarah holds the key to not only unlocking his centuries hardened soul, but to the one thing that will save them both from this new nemesis.But will she make her decision in time? And will they finally get the happiness they both deserve?",
  "genres": [
    "Vampires",
    "Paranormal",
    "Paranormal Romance",
    "Erotica",
    "Supernatural",
    "Romance",
    "Fantasy"
  ],
  "author": "K.L. Kreig",
  "average_rating": "4.22",
  "url": "https://www.goodreads.com/book/show/25396213-reawakening"
}