{
  "title": "Piece Us Back Together",
  "description": "A M/M Romance \"Healing\" AnthologyRed Runs Through by Cate AshwoodCarter McClintock’s life is uncomplicated. For the past five years, he’s spent so much time in hospital scrubs that one day bleeds into the next, and that’s just the way he likes it. That is, until he meets Matthew Nolan. Carter has never had a patient affect him the way Matthew does. During Matthew’s stay in the hospital, the chemistry is unmistakable, and once he is discharged, Carter asks him out.Despite the obvious attraction between them, Matthew’s HIV status keeps him from handing Carter his heart, refusing to believe anyone could ever truly want him. When Matthew’s past comes to light, their budding relationship is threatened before it has even begun. But Carter isn’t one to give up without a fight and he will do anything to show Matthew the lengths he will go to keep them together.All That Shimmers by Raine O'Tierney Beau Bell is a former Olympic hopeful, left paralyzed from the waist down after a car accident. He has every reason in the world to be pissed off and miserable, yet he’s training for the Paralympics Men's 100m—S6 division. The chair? Just a part of who he is now. Beau's attitude is golden. If only he could contend with this one little issue: errant erections and no way to relieve them!Nikša Meríc is a lonely scientist and really bad poet living underneath the old building where he does his research. Every night he watches his neighbor through his basement window as he undresses in his wheelchair. Although there is no apparent reason for Nikša to be unhappy, he’s struggled with depression his whole life and has tried to kill himself on multiple occasions.When Beau proposes that his “voyeur” come over and help him experiment with the erections he can’t actually feel, the relationship they build is a sexual one. But the relationship they need is one that will heal each other’s hearts as well.Swimming with Elephants by L.J. LaBartheAfter suffering a torn rotator cuff in his left shoulder, Garrett believes his life is over. Depressed, bereft, in pain, and unable to return to the career he loves as an arborist, he sees no hope or future for himself. But a trip to Havelock Island in India turns his world upside down. He meets Jai, an Indian nurse, and becomes smitten with him. Near the end of his trip, while swimming with an elephant, he tells Jai how he feels.After Garrett returns to Australia, he wonders if he can ever be healed of all his pain—physical, emotional, and mental—and fears that love and romance will never be his again. But then Jai turns up in Perth and brings with him astonishing news.",
  "genres": [
    "M M Romance",
    "Romance",
    "Anthologies"
  ],
  "author": "Raine O'Tierney",
  "average_rating": "3.40",
  "url": "https://www.goodreads.com/book/show/25405465-piece-us-back-together"
}