{
  "title": "The Time Slip Girl",
  "description": "What if the woman you loved was more than a century away? Dara, a computer programmer from Chicago, is visiting London when she opens a door in an Edwardian house and slips into Edwardian England. Agnes, a beautiful London shop girl, takes in the bewildered 21st century American lesbian, but, as Dara begins to accept that she is stuck in 1908, she also begins to accept that she has feelings for Agnes that go beyond gratitude. And the longer Dara stays, the harder Agnes finds it to hide her growing love for the accidental time traveller from the future. Will they overcome grief and prejudice to acknowledge their true feelings for one another? Or will Dara be snatched back to the 21st century before they can express their love?“When? When is this?” Dara asked, gesturing at the room.“It’s June 18th, miss,” Agnes said. “You really didn’t know?”Dara closed her eyes. “The year. What year, please?”“It’s 1908, miss,” Agnes said.Dara opened her eyes, opened her messenger bag, and pulled out her cell phone. She pushed the button to activate the main screen. It didn’t have a signal or the time and date. The battery was at 80 percent. She looked over at Agnes, whose eyes had gone wide. Agnes leaned over in her chair, trying to get a better look at the phone. Dara tapped a few buttons to pull up the photos she had stored on her phone. Yes, they were still there. The photos of Nick, their parents, and their friends were still there. The many pictures of Jenny, with and without Dara, were there. With Agnes still gazing at her and the phone intently, Dara went to her phone’s contacts and dialed Nick’s number. Nothing.“That still doesn’t mean I’m not dreaming,” she muttered.“Perhaps I should make us both some tea, miss.”Dara nodded yes, although she figured she could do with something a good deal stronger than tea. Agnes bustled out of the room.“Oh my God,” Dara said when she was alone. Her eyes darted around the room, taking it all in, the flower-patterned curtains on the one window, the shabby wardrobe standing in the corner, the night stand, the wooden chair, a small desk, the plain iron bed frame and the bedclothes that adorned it. One part of her couldn’t believe it was true, but another part could. That part urged her to accept the truth. It will go much easier on you if you do and soon, it said.She thought of her brother, who was probably frantic with worry wondering where she was. What would he tell their parents if he didn’t find her before they were supposed to fly out of Heathrow next week? Then there were her friends and the co-workers she actually liked. Most of all, though, there was Jenny. Jenny had been dead for over a year, so it wasn’t the fact that she wouldn’t see Jenny again that upset her. She had accepted that. No, it was the fact that she might never see the places she associated with Jenny ever again. She may never see all the little gifts Jenny had given her during their time together. In a panic, she clutched at the thin gold chain she wore around her neck. She kept her engagement ring on that chain. At least she had that. She kissed it tenderly and wept.",
  "genres": [
    "Romance",
    "Time Travel",
    "Lesbian",
    "LGBT",
    "Fantasy",
    "Lesbian Romance",
    "Science Fiction"
  ],
  "author": "Elizabeth Andre",
  "average_rating": "3.83",
  "url": "https://www.goodreads.com/book/show/25400555-the-time-slip-girl"
}