{
  "title": "Hypercar",
  "description": "Getting caught at over double the speed limit throws Ollie’s life into a spin that sees him wrongly convicted, deported and ultimately drawn into the high-stakes world of illegal street racing. A lost battle and a chance encounter with a beautiful, yet mysterious girl triggers a roller coaster of events totally beyond his control. He and his friends must now race against time and fight not only for justice but for their very survival.   Sometimes winning is everything...   ...and sometimes losing’s not an option.   Going beyond the realm of supercars, with speeds in excess of 400km/h, Hypercar is a high-octane story that will have you sitting on the edge of your seat...   David's books continously get positive feedback. Here are just a few comments that have been received:  \"Just finished 'Drift Race' and I have to say its a fantastic read, the terminology and drifting references are spot on as is the story line. Well done David on another brilliant book!\"  \"Got the book today. On page 221 at the moment, and I must say, it has the perfect mix of action, danger and cars!\"   Professional Reviews:  Review by Barbara Murison: ------------------------------ Ollie allows an almost unknown young woman to drive his beloved Porsche GT3 in which she is clocked at over 270ks, crashes the car and then does a runner leaving Ollie, an incredibly wealthy young man, to totally face the music on his own. All the money in the world though can’t stop the subsequent events and Ollie is deported and his car confiscated and he finds himself in the exotic locations of Las Vegas, California and Detroit where he becomes immersed in the illegal street racing culture.  Readers who have enjoyed David Jubermann’s earlier books will find the atmosphere of speed, ambition and money (and what it can buy) are all addictive and his old (and new) fans will find a compelling, unputdownable read.  Review by Bob Docherty: --------------------------- If you are going to write a novel the best piece of advice you can get is to write what you know about. David Jubermann knows about cars and driving fast and he knows about the culture that surrounds speed.  His latest novel is a long way from the boy racers of Christchurch and the drift racers of previous novels Shiftlight and Drift Race although some of the characters appear in this novel. It is nice to know they did alright.  Ollie is wealthy, has just bought a house and drives a Porsche GT3. He allows a fast young woman to drive it in a gross error of judgement. She speeds at 275Ks, is clocked, crashes the car, and does a runner, leaving Ollie to face the music. He is busted, deported and his car is confiscated perhaps by crusher Collins.  These events lead him to Hawaii, then to Las Vegas, California and Detroit, into car racing where the stakes are astronomical. Losing is inconceivable and will mean the loss of your car and even more. This is the world of the super rich and their wondrous toys and extravagant lifestyles and whats more it makes for a very appealing and readible book.  Well written and structured and will appeal to all those petrol heads of high school age who love cars and speed.  Download and read it now!",
  "genres": [
    "Sports"
  ],
  "author": "David Jubermann",
  "average_rating": "4.82",
  "url": "https://www.goodreads.com/book/show/25398466-hypercar"
}