{
  "title": "A Series of Small Maneuvers",
  "description": "Oregon Book Awards Readers Choice AwardMountains & Plains Independent Booksellers Association Reading the West AwardFor 15-year-old Emma Wilson, everything is changing. Uncomfortable at home and in school, Emma is growing up, and feels isolated from her friends and family. Things go from bad to unfathomably worse when Emma inadvertently causes an accident that kills her increasingly distant father on a spring break canoe trip meant to bring them closer together.Suddenly, Emma's efforts to reconcile with her father as a parent and a person have to happen without him, and she must confront her guilt and her grief to begin moving forward. With the help of river rats, ranch hands, and her horse, Magic, Emma finds strength in herself as she and her family navigate their reentry into “normal” life.\"Treichel’s realistic and compelling characterization of Emma highlights a maturity into adulthood that offers no easy solutions to the difficulties of grief, but celebrates the best of her family.\" -Publisher's Weekly, starred review.\"This story about fathers and daughters and grief takes you on an unexpected trip through a girl's sudden coming-of-age, and the deep canyons of who she might be long after the last page.\"-Carrie Mesrobian, Morris Award finalist for Sex & Violence\"With insight, passion and sneaky humor, Treichel probes deeply in life's pool of what's trivial and what's not.\"-Robin Cody, author of Ricochet River\"Treichel handles tragedy, love, and human frailty with clear-eyed compassion. He captures the voice of a young girl with absolute authenticity, weaving a tale that is both unique and universal, and reminding us, once again, that the gift of a great writer is the ability to see through the eyes of another.\"-Karelia Stetz­-Waters, Lambda Award finalist for Forgive Me If I've Told You This Before",
  "genres": [
    "Young Adult",
    "Fiction",
    "Grief",
    "Family"
  ],
  "author": "Eliot Treichel",
  "average_rating": "4.10",
  "url": "https://www.goodreads.com/book/show/25408142-a-series-of-small-maneuvers"
}