{
  "title": "Little Kingdom by the Sea. Secrets of the KLM Houses Revealed, a Celebration of Dutch Cultural Heritage and Architecture",
  "description": "Fasten your seatbelts for an extraordinary journey in time, to the heart of the greatest little kingdom in the world: the Netherlands. A nation founded by courageous pioneers, innovative explorers, world-class artists, outstanding entrepreneurs and other remarkable Dutch characters.From the 17th century onwards, merchants have traveled the seven seas in search of new opportunities. In the Golden Age, Amsterdam became the warehouse of the world and the gateway to Europe. Little Kingdom by the Sea offers an exclusive peak into the lives of the people who pushed the boundaries of a country limited in size but great in hopes and dreams; people who reached out to the farthest corners of the globe. The stories of the lives and achievements from a glorious past have captured our imagination for centuries. Their spirit of diversity, multiculturalism and creativity have been essential to building a cosmopolitan melting pot.In Little Kingdom by the Sea, author Mark Zegeling reveals the secrets behind the facades of a number of national buildings and Amsterdam canal houses, which were once inhabited by notable historic figures in Dutch history. Behind the public image of great pioneers like Rembrandt, Herman Boerhaave, Lucas Bols, Gerard Heineken, Cornelis Lely and extraordinary people such as Mata Hari and Anne Frank, lies a whole new world to discover. The houses of these men and women were often designed by famous architects, and in turn, present-day artists have been inspired to create Delft Blue replicas of these monuments. Ever since the 1950s, KLM Royal Dutch Airlines have been handing out these wonderful little miniatures to its Business Class passengers on long haul flights.The Delft Blue souvenirs are an unrivaled phenomenon in the world of travel and are considered to be a Dutch icon. In this ebook, you’ll discover the history of 95 beautiful KLM canal houses, including the stories of eight national landmarks, which were made into KLM Delftware limited editions. Some of these landmarks include the Royal Palace in Amsterdam, the Hall of Knights in The Hague and Huis ter Kleef in Haarlem - the oldest Real Tennis Court of the World. Little Kingdom by the Sea contains photos of the complete KLM Collection, the addresses of every single monument, including maps of the Netherlands and the cities Amsterdam, Delft and Leiden to show you exactly where the real KLM houses are located.Extensive archive research and interviews with (architectural) historians and current residents of the monuments have yielded a wealth of anecdotes and entertaining stories about previous inhabitants. In Little Kingdom by the Sea, their real life stories are painted in powerful colors, as a source of inspiration for present and future generations.RecommendationsFrits Bolkestein (Former State Secretary of Economic Affairs, Minister of Defense, European Commisioner for Internal Market and Services, and an avid collector of KLM miniature houses):“The author has delivered an impressive piece of work. Using the KLM houses as crystallization point, he offers the reader detailed insight into the history of urban development. I think this book is fantastic and highly original.”Daan de Vries (Bookseller of the Year 2014):“Little Kingdom by the Sea is the ultimate book; a feast for the eyes and mind for hours on end. This isn’t just a history book, it is also an art book, an architecture book and a cult book.”>>> You are invited to a flight through 500 years of Dutch history and architecture <<<Little Kingdom by the Sea is a true celebration of Dutch cultural heritage.",
  "genres": [],
  "author": "Mark Zegeling",
  "average_rating": "3.69",
  "url": "https://www.goodreads.com/book/show/25412022-little-kingdom-by-the-sea-secrets-of-the-klm-houses-revealed-a-celebra"
}