{
  "title": "A Wailing of a Town: An Oral History of Early San Pedro Punk and More 1977-1985",
  "description": "This book is a detailed oral history of early San Pedro punk, from 1977 to 1985, told through countless interviews with artists, locals and fans, all of whom lived there or lived through it.The ensuing history is introduced with a short story told by Gary Jacobelly (of the band Peer Group) about his ventures around the United States in search of this new punk movement, a search for expression, meaning and friendship. The following chapters include interviews and firsthand stories straight from the mouths of San Pedro locals who describe, in vivid prose, the origins of their interests in punk rock, their involvements, their favorite stories, their adventures, their friendships, their definitions, and the largely mainstream misunderstandings and challenges they faced as a part of this original movement. This book is as much a story of overcoming as it is a book about music, friendship, and the history of a standout culture — a story that has never been told fully and from a firsthand perspective before.Among its storytellers, Joe Nolte (the Last) narrates detailed accounts of the early Hermosa Beach and South Bay punk scene from its birth in 1977 through its height in the late 1970s and early ’80s.The history details the pioneering days of San Pedro’s first punk band, the Reactionaries, who later gave rise to the legendary art-punk band the Minutemen. This narrative includes one chapter on the first punk gig in San Pedro (February 17, 1979) that included various up-and-coming South Bay bands: Black Flag (Hermosa Beach), Descendents (Hermosa Beach), the Reactionaries (San Pedro), the Alley Cats (Lomita) and the Plugz.With the innovative sounds of the Minutemen and Saccharine Trust in 1980, the history of the Los Angeles Harbor Area would never be the same, as these bands pioneered the trail of highly original and creative bands and artists. Largely remaining in the shadow of the Minutemen, many of the bands (Slivers, Peer Group, Plebs, etc.) rarely found acceptance in the greater L.A. music scene — their quirky but expressive approach didn’t fit in with the prevailing hardcore or rock scenes of the time. These bands were different. They didn’t sound like anybody else, and apart from the handful of outsiders who lived and breathed the San Pedro scene, these bands were considered too cerebral, and too experimental for widespread acceptance. These bands were ahead of their time.The Minutemen are the central topic and focus of this book. They are the band that put (and still puts) San Pedro on the musical map, and they were undoubtedly the anchor of this new San Pedro punk scene. This book chronicles all six years of the Minutemen’s existence in full detail from the beginning (1980) to their end (1985), including a definitive chapter on their record label, New Alliance.The book also contains chapters describing the history of the early San Pedro clubs, theatres, bars, and haunts, including Capones, Strand Cinema, Star Theatre and Dancing Waters. These locales were frequented mostly by punks from the South Bay, and almost never by the people from the greater L.A. or Hollywood music scenes. The Pedro scene was often overshadowed, forgotten, and dismissed because it was just “too far.”The book also discusses outlying San Pedro and other L.A. Harbor Area venues of the early years (the Fleetwood, the Barn, the Centrexx) and various crucial out of town incidents (Longshoremen Memorial Hall Riot) and occurrences (Wilson Park gigs).Other chapters cover unique memories of house parties, Harbor College, D. Boon’s fanzine: The Prole, Ivica’s New Wave Salon, Black Flag at San Pedro High School, the Fishermen’s Fiesta, the art scene in San Pedro, and an intensive chapter about hardcore punk.The end of the narrative includes individual chapters about Minutemen players D. Boon, Mike Watt and George Hurley, and the catastrophic passing of the brilliant D. Boon. The tragic death of D. Boon stole the wind from the scene and was the catalyst to send the artists, friends and fans on their separate paths into or out of the flickering L.A. harbor lights.Front cover photo by Victor SedilloD. Boon (Minutemen), San Pedro Night, Cathay de Grande,Hollywood, May 19, 1981",
  "genres": [
    "Music",
    "Punk",
    "Nonfiction",
    "History"
  ],
  "author": "Craig Ibarra",
  "average_rating": "4.48",
  "url": "https://www.goodreads.com/book/show/25407973-a-wailing-of-a-town"
}