{
  "title": "The 50 Funniest American Writers*: An Anthology of Humor from Mark Twain to The Onion",
  "description": "Ever wondered who makes a very funny person laugh? Wonder no more. Brought together in this Library of America collection are America’s fifty funniest writers—according to acclaimed writer and comedian Andy Borowitz. Reaching back to Mark Twain and forward to contemporary masters such as David Sedaris, Nora Ephron, Roy Blount Jr., Ian Frazier, Bernie Mac, Wanda Sykes, and George Saunders, The 50 Funniest American Writers* is an exclusive Who’s Who of the very best American comic writing. Here are Thurber and Perelman, Lenny Bruce and Bruce Jay Friedman, Garrison Keillor, Dave Barry, and Veronica Geng, plus hilarious lesser-known pieces from The New Yorker, Esquire, The Atlantic, National Lampoon, and The Onion. Who does “one of the funniest people in America” (CBS Sunday Morning) read when he needs a laugh?Contents:A presidential candidate by Mark TwainThe lecture tickets that were bought but never used by George AdeThe ransom of Red Chief by O. HenryFrom Babbitt by Sinclair LewisFrom Gentlemen prefer blondes by Anita LoosOn conversation by Ring LardnerImperial purple by H.L. MenckenMore alarms at night by James ThurberThe waltz by Dorothy ParkerFarewell, my lovely appetizer by S.J. PerelmanSimple prays a prayer by Langston HughesThe night the old nostalgia burned down by Frank SullivanAcross the street and into the grill by E.B. WhiteThe house of mirth by Peter De VriesFrom The magic Christian by Terry SouthernFrom How to talk dirty and influence people by Lenny BruceThe secret vice by Tom WolfeThe counterfeit secret circle member gets the message, or The asp strikes again by Jean ShepherdThe Kentucky Derby is decadent and depraved by Hunter S. ThompsonA look at organized crime by Woody AllenThe tax man by Bruce Jay FriedmanLetters to Einstein by Philip RothA few words about breasts by Nora EphronOur white heritage by Henry Beard, Michael O'Donoghue, George W.S. TrowBetter read than dead : a revised opinion by Fran LebowitzYour action line by Charles PortisIn the morning post by Donald BarthlemeCurb Carter policy discord effort threat by Veronica GengVacation '58 by John HughesThe laws of cartoon motion by Mark O'DonnellThe Tip-Top Club by Garrision KeillorRolled in rare Bohemian onyx, then vulcanized by hand by Bruce McCallTough as bob war and other stuff by Molly IvinsCorrections by Calvin TrillinTips for women : how to have a relationships with a guy by Dave BarryClinton deploys vowels to Bosnia by The OnionShiftless little loafers by Susan OrleanGothic baseball by Roy Blount Jr.If I were in charge of the networks by George CarlinLaws concerning food and drink ; Household principles ; Lamentations of the father by Ian FrazierThe writer's life by David RakoffFrom I ain't scared of you by Bernie MacBuddy, can you spare a tie? by David SedarisIt's so hard by Wanda SykesWhat I'd say to the Martians by Jack HandeyYour three wishes : F.A.Q. by David OwenAsk the optimist! by George SaundersAwake by Jenny AllenThe pony problem by Sloane CrosleyIf not an apology, at least a \"my bad\" by Larry Wilmore",
  "genres": [
    "Humor",
    "Short Stories",
    "Fiction",
    "Comedy",
    "Essays",
    "Anthologies",
    "Writing"
  ],
  "author": "Andy Borowitz",
  "average_rating": "3.23",
  "url": "https://www.goodreads.com/book/show/11556958-the-50-funniest-american-writers"
}