{
  "title": "Le ali della vita",
  "description": "È notte e la nebbia è illuminata a tratti dai fari delle macchine che sfrecciano accanto a lei. Letty si asciuga l'ennesima lacrima e preme ancora più forte il piede sull'acceleratore. Deve correre il più lontano possibile, fuggire da tutti i suoi sbagli, è la cosa migliore per tutti. Perché la sua vita è stata difficile, ha inanellato una serie di errori uno dietro l'altro e adesso tutte le sue paure sono tornate a tormentarla, senza lasciarle una via di scampo. Intanto, ormai molte miglia lontano, i suoi due figli, Alex e la piccola Luna, stanno dormendo serenamente. Non sanno che la mamma li ha lasciati da soli nel loro letto, schiacciata dal terrore di non essere una buona madre. Convinta che senza di lei Alex e Luna saranno più felici.Quando Alex si sveglia e si accorge che Letty non c'è più, capisce che non deve farsi prendere dal panico. Deve occuparsi della sorellina e seguire le regole. Perché Alex ha quindici anni ed è solo un ragazzino, ma è dovuto crescere in fretta per aiutare sua madre Letty e i suoi occhi troppo spesso tristi. A volte guarda verso il cielo e sogna di volare via, in un posto dove l'azzurro del cielo li possa di nuovo colorare di felicità. La sua passione sono la matematica e lo studio delle rotte migratorie degli uccelli. Da loro ha imparato che non importa quanto voli lontano, c'è sempre un modo per tornare a casa. Alex sa che deve trovare il modo di far tornare anche la sua mamma. Solo lui può farlo, solo lui può curare le sue ali ferite e farle spiccare di nuovo il volo. Perché anche quando l'orientamento è perso, l'amore può farci ritrovare la rotta verso il nostro cuore.Dopo l'enorme successo del \"Linguaggio segreto dei fiori\", bestseller internazionale venduto in più di 40 paesi, ancora ai vertici delle classifiche italiane a tre anni dall'uscita, Vanessa Diffenbaugh torna con un romanzo dalla forza dirompente.",
  "genres": [
    "Fiction",
    "Book Club",
    "Contemporary",
    "Adult Fiction",
    "Adult",
    "Family",
    "Audiobook"
  ],
  "author": "Vanessa Diffenbaugh",
  "average_rating": "3.84",
  "url": "https://www.goodreads.com/book/show/25424558-le-ali-della-vita"
}