{
  "title": "The Complete Hunted Series Boxed Set",
  "description": "Victoria's Downfall:While I was busy running from my ghosts, I was too distracted to notice the danger lurking right in front of me. I felt him though, just as soon as I crashed into his rock hard body. Gabriel Maddox. The heir to the Maddox Empire and target of countless gossip columns. He was the man that all of the single women of New York had their eye on. The playboy with a reputation that preceded him, and a trail of broken hearts left in his wake. The only problem? He seemed to have his eye on me. Victoria Colletti. The woman with a closet full of skeletons and a past that I couldn’t escape from. My too fragile heart couldn’t handle someone like him. I knew it the moment he first made his proposition. But the thing about Gabriel Maddox is, when he wants something, there is nothing he won’t do to get it. Please note: This book contains explicit sexual content, including elements of BDSM and dark erotica. Also, a very alpha male who likes to drop the f-bomb frequently. You have been warned!Gabriel's Collar:Victoria’s asleep. In my arms. And I’m holding her, stroking her, silently hating myself for what she’s turning me into.She says she has to leave, but I need her to stay. Things are getting too complicated between us. Too many secrets, too many lies. I know she’s hiding something from me, but the more I push, the farther she pulls away.  I don’t know how much longer this tether between us can hold. So I’ve done something that I never do. I’ve opened myself up and bared my soul. I told her my secrets in a moment of weakness, and now I have to pay the price. Because if I’m wrong about her, she could destroy me.Orion's Fate:When I moved to New York, I didn’t expect to fall in love. But the city that never sleeps has captured my heart, right along with Gabriel Maddox. Unfortunately, love can’t change my circumstances, and some things will always be out of my grasp. As the clock ticks down on my time with Gabriel, I will have to make a decision. A decision to stay and put his life in danger, or to leave the man that I love behind. But just when I think the choice is actually mine to make, fate steps in and shows me it has other plans. You can’t outrun the past forever, and mine has just caught up with me in the worst way. Not only could I lose Gabriel, but I could lose him for good.",
  "genres": [
    "BDSM",
    "Dark",
    "Romance",
    "Erotica",
    "Contemporary",
    "Contemporary Romance",
    "New Adult"
  ],
  "author": "A. Zavarelli",
  "average_rating": "4.08",
  "url": "https://www.goodreads.com/book/show/25425705-the-complete-hunted-series-boxed-set"
}