{
  "title": "My First Summer in the Sierra",
  "description": "EXCERPT:In the great Central Valley of California there are only two seasons—spring and summer. The spring begins with the first rainstorm, which usually falls in November. In a few months the wonderful flowery vegetation is in full bloom, and by the end of May it is dead and dry and crisp, as if every plant had been roasted in an oven.Then the lolling, panting flocks and herds are driven to the high, cool, green pastures of the Sierra. I was longing for the mountains about this time, but money was scarce and I couldn’t see how a bread supply was to be kept up. While I was anxiously brooding on the bread problem, so troublesome to wanderers, and trying to believe that I might learn to live like the wild animals, gleaning nourishment here and there from seeds, berries, etc., sauntering and climbing in joyful independence of money or baggage, Mr. Delaney, a sheep-owner, for whom I had worked a few weeks, called on me, and offered to engage me to go with his shepherd and flock to the headwaters of the Merced and Tuolumne rivers—the very region I had most in mind. I was in the mood to accept work of any kind that would take me into the mountains whose treasures I had tasted last summer in the Yosemite region. The flock, he explained, would be moved gradually higher through the successive forest belts as the snow melted, stopping for a few weeks at the best places we came to. These I thought would be good centers of observation from which I might be able to make many telling excursions within a radius of eight or ten miles of the camps to learn something of the plants, animals, and rocks; for he assured me that I should be left perfectly free to follow my studies. I judged, however, that I was in no way the right man for the place, and freely explained my shortcomings, confessing that I was wholly unacquainted with the topography of the upper mountains, the streams that would have to be crossed, and the wild sheep-eating animals, etc.; in short that, what with bears, coyotes, rivers, cañons, and thorny, bewildering chaparral, I feared that half or more of his flock would be lost. Fortunately these shortcom ings seemed insignificant to Mr. Delaney. The main thing, he said, was to have a man about the camp whom he could trust to see that the shepherd did his duty, and he assured me that the difficulties that seemed so formidable at a distance would vanish as we went on; encouraging me further by saying that the shepherd would do all the herding, that I could study plants and rocks and scenery as much as I liked, and that he would himself accompany us to the first main camp and make occasional visits to our higher ones to replenish our store of provisions and see how we prospered. Therefore I concluded to go, though still fearing, when I saw the silly sheep bouncing one by one through the narrow gate of the home corral to be counted, that of the two thousand and fifty many would never return.",
  "genres": [
    "Nature",
    "Nonfiction",
    "Travel",
    "Memoir",
    "Classics",
    "Adventure",
    "Biography"
  ],
  "author": "John Muir",
  "average_rating": "4.06",
  "url": "https://www.goodreads.com/book/show/25423144-my-first-summer-in-the-sierra"
}