{
  "title": "Digging Deep: Unearthing Your Creative Roots Through Gardening",
  "description": "'Digging Deep: Unearthing Your Creative Roots Through Gardening' is a step by step guide that gives you what you need to know in order to be creative.I believe from the depths of my heart that gardening can be one of the most profound ways to unearth the creative spirit buried within every one of us. It doesn’t matter whether you have a twenty-acre plot of land or a fire escape in the back of a city apartment; once you unleash this creative energy, you will be amazed at what happens in all areas of your life. You will begin to see how living creatively opens up new vistas in your imagination and new windows of opportunity in your life. You will know beyond a shadow of a doubt that once you discover your authentic, creative nature, you can create absolutely anything you dare to in and of your life.  In Digging Deep, you’ll learn 1. Why you’re creative and always have been.2. How to re-awaken your creative spirit and develop techniques that will help you design your own unique, personal landscape in your garden and life.3. To appreciate the process of gardening, not just the end result.4. The seven steps of creative awakening that will help you develop the knowledge, skills, and confidence to move forward.5. How to use your ‘creative muscles’ to help you get unstuck in the garden and in life.6. To have confidence and know that you can create the life you’re supposed to be living.7. To use gardening as a conduit for living a more joyful, healthier, and meaningful life. If you take one thing from this book, let it be to play. Not just in your garden, but play with ideas, projects, possibilities. 'Digging Deep: Unearthing Your Creative Roots' guides you to give shape to your dreams and helps you bloom along with your flowers!",
  "genres": [
    "Gardening",
    "Nonfiction",
    "Self Help",
    "Nature",
    "Philosophy",
    "Design"
  ],
  "author": "Fran Sorin",
  "average_rating": "3.95",
  "url": "https://www.goodreads.com/book/show/2542248.Digging_Deep"
}