{
  "title": "Ally: My Journey Across the American-Israeli Divide",
  "description": "NEW YORK TIMES BESTSELLERMichael B. Oren’s memoir of his time as Israel’s ambassador to the United States—a period of transformative change for America and a time of violent upheaval throughout the Middle East—provides a frank, fascinating look inside the special relationship between America and its closest ally in the region. Michael Oren served as the Israeli ambassador to the United States from 2009 to 2013. An American by birth and a historian by training, Oren arrived at his diplomatic post just as Benjamin Netanyahu, Barack Obama, and Hillary Clinton assumed office. During Oren’s tenure in office, Israel and America grappled with the Palestinian peace process, the Arab Spring, and existential threats to Israel posed by international terrorism and the Iranian nuclear program. Forged in the Truman administration, America’s alliance with Israel was subjected to enormous strains, and its future was questioned by commentators in both countries. On more than one occasion, the friendship’s very fabric seemed close to unraveling. Ally is the story of that enduring alliance—and of its divides—written from the perspective of a man who treasures his American identity while proudly serving the Jewish State he has come to call home. No one could have been better suited to strengthen bridges between the United States and Israel than Michael Oren—a man equally at home jumping out of a plane as an Israeli paratrooper and discussing Middle East history on TV’s Sunday morning political shows. In the pages of this fast-paced book, Oren interweaves the story of his personal journey with behind-the-scenes accounts of fateful meetings between President Obama and Prime Minister Netanyahu, high-stakes summits with the Palestinian leader Mahmoud Abbas, and diplomatic crises that intensified the controversy surrounding the world’s most contested strip of land. A quintessentially American story of a young man who refused to relinquish a dream—irrespective of the obstacles—and an inherently Israeli story about assuming onerous responsibilities, Ally is at once a record, a chronicle, and a confession. And it is a story about love—about someone fortunate enough to love two countries and to represent one to the other. But, above all, this memoir is a testament to an alliance that was and will remain vital for Americans, Israelis, and the world.Praise for Ally “The smartest and juiciest diplomatic memoir that I’ve read in years, and I’ve read my share. . . . The best contribution yet to a growing literature—from Vali Nasr’s Dispensable Nation to Leon Panetta’s Worthy Fights —describing how foreign policy is made in the Age of Obama.” —Bret Stephens, The Wall Street Journal “Illuminating . . . [Oren’s] personal odyssey exemplifies the shift from a liberal and secular Zionism to a more belligerent nationalism.” — The New York Times“Provocative . . . Oren’s book offers a view into the deep rifts that have opened not only between Washington and Jerusalem, but also between Israeli and American Jews.” — Newsweek “[Oren is] one of the most uniquely qualified judges of this ever more crucial special relationship.” — The Washington Times “The diplomatic equivalent of a ‘kiss-and-tell’ memoir . . . informative and in parts entertaining.” — Financial Times “The talk of Washington and Jerusalem . . . an ultimate insider’s story.” — New York Post",
  "genres": [
    "Israel",
    "History",
    "Nonfiction",
    "Politics",
    "Memoir",
    "Biography",
    "Jewish"
  ],
  "author": "Michael B. Oren",
  "average_rating": "4.14",
  "url": "https://www.goodreads.com/book/show/25430669-ally"
}