{
  "title": "Direct Action: An Ethnography",
  "description": "Anthropologist David Graeber undertakes the first detailed ethnographic study of the global justice movement. The case study at the center of Direct Action is the organizing and events that led to the one of the most dramatic and militant mass protests in recent years—against the Summit of the Americas in Québec City. Written in a clear, accessible style (with a minimum of academic jargon), this study brings readers behind the scenes of a movement that has changed the terms of debate about world power relations. From informal conversations in coffee shops to large “spokescouncil” planning meetings and tear gas-drenched street actions, Graeber paints a vivid and fascinating picture.Along the way, he addresses matters of deep interest to anthropologists: meeting structure and process, language, symbolism and representation, the specific rituals of activist culture, and much more. Starting from the assumption that, when dealing with possibilities of global transformation and emerging political forms, a disinterested, “objective” perspective is impossible, Graeber writes as both scholar and activist. At the same time, his experiment in the application of ethnographic methods to important ongoing political events is a serious and unique contribution to the field of anthropology, as well as an inquiry into anthropology’s political implications.David Graeber is an anthropologist and activist who teaches at the University of London. Active in numerous direct-action political organizations, he has written for Harper’s Magazine and is the author of Fragments of an Anarchist Anthropology, Towards an Anthropological Theory of Value, and Possibilities.In Oakland, California on March 24, 2015 a fire destroyed the AK Press warehouse along with several other businesses. Please consider visiting the AK Press website to learn more about the fundraiser to help them and their neighbors.",
  "genres": [
    "Politics",
    "Anthropology",
    "Nonfiction",
    "History",
    "Activism",
    "Ethnography",
    "Theory"
  ],
  "author": "David Graeber",
  "average_rating": "4.20",
  "url": "https://www.goodreads.com/book/show/2543048.Direct_Action"
}