{
  "title": "The Dark Warrior Series, The Complete Collection: Contains Midnight's Master, Midnight's Lover, Midnight's Seduction, Midnight's Warrior, Midnight's Kiss, ... Surrender (novella)",
  "description": "The Dark Warriors Series, The Complete Collection from Donna Grant contains all eight books in the series and the one sexy Dark Warrior Novella. A Dark Warrior is unlike any other Highlander stronger, faster, more powerful...more dangerous. Thrust from ancient Scotland into our modern world, these dark defenders will find a love that will bring them back into the light. Midnight's Master Gwynn Austin has no idea why her father has disappeared on a mysterious trip to Scotland. When she goes on a desperate mission to search for him she finds more than she bargains for in a ruggedly handsome, wickedly exciting Highlander who exudes danger and mystery. And when she discovers her own link to Scotland, she'll have to trust her heart to help lead her... Midnight's Lover Driven by the fierce god within him, highlander Ian Kerr is sworn to fight for the land he loves—and the brother he lost. But when he's transported four centuries into the future, he finds himself fighting his own desires—for a beautiful, bewitching woman who could hold a warrior spellbound… Midnight's Seduction Captivating and enticing, Saffron Fletcher is a rarity in the Druid world—a Seer. She is the ultimate prize in an epic battle. After suffering horrendously at the hands of evil, her thirst for justice is all that keeps her going. Can she put her trust in the sinfully gorgeous, wonderfully dangerous Warrior who haunts her dreams and promises retribution for their common enemy? Midnight's Warrior For ten long years, Tara has been a woman on the run, hiding from the magic-wielding Warriors and Druids of modern-day Scotland. Now, as a tour guide at a remote Highland castle, she hopes to finally escape her past—until one impossibly gorgeous man enters her life…and exposes her wildest secrets. Midnight's Kiss Dr. Veronica Reid is a world-renowned archeologist whose Druid abilities help her to unearth ancient magical items. The arrival of the all-too-attractive and charismatic Arran MacCarrick puts her on the defensive when he begins to question how she really finds her artifacts…until an unknown foe attacks and Ronnie discovers that Arran has a secret as great as her own. Midnight's Captive Laura Black knows her boss is a man of many secrets—haunted by some unknowable force, driven by some unspeakable destiny—and yet it makes her crave the devilishly handsome, roguishly charming Charon all the more. When she uncovers a betrayal that will send her into a world of magic, she turns to the only one she Charon. Even when she's in jeopardy of losing her heart… Midnight's Temptation Ever since that fateful night, he can't stop thinking about her. A timeless beauty in a nightclub, she moved across the dance floor like an angel, surrendering to the music—and casting a spell that could only be magic. When Phelan took her in his arms and kissed her, the Highlander knew this was no ordinary woman. This was a Druidess who could fulfill his every desire—or destroy him completely… Midnight's Promise For centuries, Malcolm has struggled against the forces of darkness—and bears the scars to prove it. Hardened by a lifetime of fighting, he is more warrior than man, incapable of feeling love or compassion. But one stormy night, he pulls a beautiful woman from a car wreck—and experiences a rush of fiery emotion that could melt even the hardest of hearts. Midnight's Surrender (novella) Dale has been on the run—from himself and from the demons who haunt him. But when he comes across a stunningly beautiful woman he cannot resist, he knows that he must do whatever it takes to possess her. She is a Druid with secrets of her own, but he is drawn to her like no other.",
  "genres": [
    "Historical"
  ],
  "author": "Donna Grant",
  "average_rating": "4.69",
  "url": "https://www.goodreads.com/book/show/25442015-the-dark-warrior-series-the-complete-collection"
}