{
  "title": "Say It Strong",
  "description": "Librarian Note: The latest edition with updated cover of this title can be found HERE \nBook 1 in the Rock Candy series (a spin-off of the Say You Love Me series!) **Note: Rock Strong released June 22, 2015, under the title Say It Strong but has been rebranded to ROCK!Book 2 in the Say You Love Me series, starring a group of male friends--hot young Hollywood heroes and hard-partying rock band bad boys--each on the verge of meeting the girl of his dreams.I've seen and done it all--sex, drugs, rock-n-roll, and then some. I've made the cover of Rolling Stone. I've won Best Rock Performance at the Grammy's. I'm living a life of fame, wild tours, crazy money, and insanely hot women. But the one woman I can't get is prim and proper cellist, Abby Chan--gorgeous, natural, talented as all sin. The first time we met, I knew we would be something special. She's not convinced, but I am.Now I'm going to prove she's all the woman a wild man like me will ever need...Liam Collier, sexy and enigmatic frontman for Point Break, the world's hottest rock band, is at the top of his game. With two songs in the Billboard Top 10, he's a rock-and-roll bad boy, known for his trademark falsetto as well as his proclivity for partying and hooking up with gorgeous women. For Liam, falling in love was something he figured would happen far off in the future--not on the first day of his first world tour. And not with his super sexy but extremely reserved background cellist.With a Master of Music degree from Juilliard School of Music, Abby Chan is on the road to becoming a cellist for the New York Philharmonic Orchestra. But to pay back her expensive education, first she has to travel another kind of road--a gig playing cello for the North American leg of a garish rock band's world tour. She'd expected hard work and long hours, but what she never expected was the intensity of her reactions to Liam Collier. He's sweet. He's hot. And despite being surrounded by roadies and the world's most beautiful women, he's set his sights on her.When classical music meets rock and prim propriety meets a carefree attitude, Abby and Liam venture outside their comfort zones. What they discover is that living wild is the perfect preparation for flying high--on love.New Adult Contemporary Romance with a HEA.**Part of a series, but each book will be a standalone**Say You Love Me Series:Book 1: Say It Sexy (Garrick)Book 2: Say It Strong (Liam)",
  "genres": [
    "Romance",
    "Contemporary",
    "Music",
    "Contemporary Romance",
    "New Adult",
    "Amazon",
    "New Adult Romance"
  ],
  "author": "Virna DePaul",
  "average_rating": "3.66",
  "url": "https://www.goodreads.com/book/show/25442558-say-it-strong"
}