{
  "title": "The Rockstar Series #1-3",
  "description": "ACE of Kindle ASIN B00WQFCVKO. The Rockstar Series Box Set (Books 1-3) Falling Down (Rockstar #1) Amplify (Rockstar #2) A Very Xander Christmas (Rockstar #3) Amplify (Rockstar #4)  DISCLAIMER! If you're unable to suspend disbelief and escape to the Rockstar Land of Fiction, then this book probably isn't for you. As with all the Rockstar books, this book contains mature content and is inappropriate for persons under 18 years of age.   Falling Down - (Rockstar #1)  Jesse Kingston, lead singer for Falling Down, is a tall, dark, and gorgeous temptation I don’t want to resist.  I’m going to ignore all the warning signs and do what I normally wouldn’t—I’m going to indulge my fantasies and give this sexy rocker what he wants and something he won’t soon forget—me.  Will our time together end up changing this bad boy? Or will it end up changing me?  Blush (Rockstar #2)  *WARNING* This is NOT a dark romance. There will be MINIMAL angst or drama. There will be lots of laughs, frequent dropping of the F-bomb, and crazy monkey sex.  You know how people say they woke up in Vegas married and you're like, how the hell could that possibly happen? Who does that? Well, us apparently… and the press is having a field day.  A Very Xander Christmas (Rockstar #2.5) The first Rockstar Christmas. A short story—told Xander Style.  Amplify: (Rockstar #3)  Warning: This story contains grief, loss, sadness, darkness, light, happiness, angst, swearing, explicit sex, graphic violence, new beginnings, and soulmates. I recommend listening to the playlist whenever possible to get the full effect of the story. You may need tissues.  NOTE The book itself is 80,000 words and while Amplify ends at 73%, the download also includes A Very Xander Christmas (Rockstar #2.5) and sample first chapters from six other authors.  Sera He’s my protector, my confidante. Then one night he became more. I want him, I need him, and, if I’m honest with myself, I love him. I just don’t know if he’ll ever see me as more than what we’ve always been: friends. I don’t want to lose him but it’s getting harder and harder to keep my feelings to myself. Should I risk it all or play it safe?  Cage She’s my light, my saving grace. The night we came together I knew I could never live without her. I want her to be mine: my lover, my friend. Maybe, if I can get her to see past all the reasons why we shouldn’t be together, she’ll be my forever. It just might be time to turn it up and go for broke.",
  "genres": [
    "Romance",
    "Contemporary",
    "New Adult",
    "Contemporary Romance",
    "Anthologies"
  ],
  "author": "Anne Mercier",
  "average_rating": "4.50",
  "url": "https://www.goodreads.com/book/show/25436912-the-rockstar-series-1-3"
}