{
  "title": "Underspent: How I Broke My Shopping Addiction and Buying Habit",
  "description": "Do you want to break your impulse shopping addiction and habit of buying ‘stuff’, without dramatically changing your life? Do you want to save money? Do you want to be Underspent, not overspent? Do you want to feel happier and more content?  Right now, the rising cost of living is one of the biggest issues in Australia, America and the UK. According to the media, the average American owns 3.5 credit cards and owes US$15,799 in credit card debt. Three out of five American families can’t pay off their credit card debts. In the UK, someone is declared insolvent or bankrupt every five minutes, and a property is repossessed every eighteen minutes. Thirteen per cent of Australian adults and seventeen per cent of Aussie kids live below the poverty line, whilst the average Australian adult spends the first eight weeks of each year working just to pay for their car. There are more than eighteen million shopaholics in the United States, ninety-three per cent of teenage girls in the United States say shopping is their favourite activity and five per cent of all waste in Australian landfill is discarded clothing. The UK’s Citizens Advice Bureau deals with more than 7,000 debt problems every day and 21,000 credit or debit card purchases are made every minute in the UK.  We don’t need to question whether shopping addictions, household debt and the rising cost of living exist or not – we all know that these issues exist. We think about the cost of living, our household money and our debts every day. It’s what we do about it that’s important.  Rachel Smith interviewed men and women in Australia, the UK and the USA about their shopping habits. She also asked them what they thought would be the biggest challenges or personal battles they’d face if they had to quit shopping for three months. Their answers making do with what we already own, boredom, feeling unprepared, willpower, not buying gifts, fear of missing out and failing to meet children’s needs.  In this groundbreaking and entertaining book, Rachel reveals the Seven-Step Process she took to break her shopping addiction and buying habit, without dramatically changing her life.  For Rachel, the ultimate result of implementing the seven steps set out in this book • being Underspent—spending less than usual (she was spending less money than was required and expected) • breaking her impulse shopping addiction and habit of buying ‘stuff’ • saving 38 per cent of her net (take-home) annual salary • feeling happier and more content.  This is a book that people can use, not just agree with. Underspent examines in • the problems caused by impulse shopping addictions • the seven things we love about buying and shopping • why we shop and buy so much • what triggers our shopping and buying • seven things to love about quitting consumerism • the seven sticking points • seven challenges and personal battles we face when quitting • the seven steps to being Underspent.  Rachel has written this book because she wants to share how she broke her impulse shopping addiction and habit of buying ‘stuff’, without dramatically changing her life. In this book, she tells you what she did; she won’t tell you what to do. Rachel wants to share the tools that worked for her. This is a practical guide for men and women who want to quit shopping and save money.  With case studies, stories, information and practical exercises, Rachel shows you how to apply the seven steps.",
  "genres": [
    "Nonfiction",
    "Money"
  ],
  "author": "Rachel Smith",
  "average_rating": "3.48",
  "url": "https://www.goodreads.com/book/show/25441294-underspent"
}