{
  "title": "Tactical Nuclear Weapons: Debunking the Mythology - Historical Context, Hiroshima and Nagasaki, Limitations of Arms Control, Russian Nuclear Weapon Security, Proliferation",
  "description": "This paper offers a concise summary of many of the difficult issues presented in addressing this category of weapons within nuclear policy and posture, and particularly within the arms control arena. Its four direct findings are worthy of full consideration and debate as we rethink the place and role of tactical nuclear weapons.The paper reviews the many concerns attached to tactical nuclear systems over time, to include recent concerns about security surrounding the Russian stockpile. Given all these issues, the authors propose that tactical nuclear forces be seen in the context of current and future security needs, and that the US not limit its own security needs because of problems with the Russian arsenal.A recommendation to integrate all nuclear weapons into the US nuclear framework is made to enhance deterrence and provide a credible response to a variety of threats to US interests, and to continue the critical trans-Atlantic link between the US and NATO. This accepts both the military and political value of nuclear weapons without distinguishing between them because of yield, range, target effect, delivery vehicles, or deployment location. This is especially important in an environment of declining numbers of strategic nuclear systems and the incorporation of missile defenses. Recent events have demonstrated the difficulty of formal arms control agreements aimed at strategic systems and circumstances of the past and the need to address future threats and situations. Further, the Bush administration's reaction to the ABM Treaty, particularly the rationale provided, suggests that bilateral arms control initiatives will not be as successful in the future as they were during the Cold War.The paper concludes with four findings recommending that US nuclear strategy evolve to include all nuclear systems so they are part of a comprehensive nuclear posture. The first finding acknowledges the lack of Russian incentive to engage in traditional arms control negotiations in any nuclear weapons category other than those in the strategic arena. This is primarily due to weaknesses in Russian conventional forces. Second, even if the Russians were motivated to do so, it is not in the interest of the US or its allies to become entangled in further agreements on systems not previously captured in other treaties. This is the view of the current administration. Third, because of the first two findings it is clear that for the future, other engagements aside from traditional arms control measures, should be the solution for dealing with the Russian \"problem.\" And finally, though historically tactical nuclear systems have not been discussed when talking about the US nuclear arsenal, the US can enhance deterrence by integrating all US nuclear weapons into a comprehensive nuclear posture.TABLE OF CONTENTS * Foreword * Executive Summary * The Definition Problem and Tactical Nuclear Weapons * What is a Tactical Nuclear Weapon? * Taking a Step Hiroshima and Nagasaki * The Limitations of Arms Control * The New Deterrence Requirements * The Historical Context of Tactical Nuclear Weapons * Nuclear Weapons and the Transatlantic Link * Tactical Nuclear Weapons and the Triad * Unilateral Initiatives and the New Environment * Concerns about Russian Nuclear Weapon Security * The Nature of the Russian Problem * Recent Developments and Proliferation Concerns * The Taking \"Tactical\" Out of the Discussion * Finding #1 * Finding #2 * Finding #3 * Finding #4 * Notes",
  "genres": [],
  "author": "USAF Institute for National Security Studies",
  "average_rating": "0.00",
  "url": "https://www.goodreads.com/book/show/25435881-tactical-nuclear-weapons"
}