{
  "title": "Sated",
  "description": "All Keira Kenney wants is her happy ending. Too bad she can never make it through a first date. Is a nice man who’s into fitness and comics, with an extensive knowledge of everything science-fiction too much to ask for? Apparently, since Keira can’t seem to find a partner who can simply tolerate her interests. Perhaps it’s time for her to give up. She has her job at Melrose Fitness, a new season of her favorite space drama added to streaming, and hundreds of thousands of words worth of fan fiction all to keep her mind busy. Her heart will have to wait.Pyrotechnics expert, Daniel Song isn’t looking for anything. He spends his days doing what he loves, and his nights and weekends participating in the kinky activities his body craves. Single life as sexual switch suits him perfectly, giving him the freedom to indulge the types of erotic adventures some people only dream of.When a good friend asks Daniel if his co-worker, Keira can join him at a local sci-fi convention, neither of them expect any sort of fireworks to spark. After all, Keira’s turned off by kink and Daniel can’t live without with it. So naturally they both agree that an official first date would be a great idea. With this new relationship fresh between them, Daniel shares what he can of himself without scaring Keira off, hiding his shock and growing infatuation as she rises to every sexual occasion with her silly, geek-girl personality. It’s only a matter of time before they both have to face the truth; what he wants is the furtherest thing from what she needs. But in the meantime, pushing each other’s sexual limits seems like a good plan. It’s not like either of them is looking for love.**This story contains two massive nerds who can’t keep their hands off each other. And fisting.**",
  "genres": [
    "Romance",
    "BDSM",
    "Contemporary",
    "Erotica",
    "Novella",
    "Contemporary Romance",
    "Fiction"
  ],
  "author": "Rebekah Weatherspoon",
  "average_rating": "3.74",
  "url": "https://www.goodreads.com/book/show/25437986-sated"
}