{
  "title": "Affairytale",
  "description": "#1 Amazon kindle bestselling book-diaries and journals.I’d fallen tragically in love with a man who was always just out of reach. I knew two things for certain. Levi was the man I could never live with. Grant was the man I could never live without. Grant was a rare gentleman, intelligent and gorgeous; a man every woman desired. Every cell in my body was telling me that he was my happily ever after. I was stuck in a marriage of mediocrity, I ached for red silk romance and carry me away passion, but not with my husband. I craved Him. Living without him was cruel and unusual punishment, even for my wandering heart. Finalist, National Indie Excellence Awards 2016Finalist, Readers Favorite Book Awards 2016Finalist, Independent Author Network Book of the Year Awards 2016Finalist, Beverly Hills Book Awards 2015“…a story you only read once in a lifetime. Her writing was unconditionally spell binding.” -Belgian Naughty Reader Book Blog \"Together they prove true love is worth waiting and fighting for.\" -Beaute' De Livres Book Blog\"We found ourselves riveted…\"-Totally Booked Blog “…mesmerizing, breathtaking and spectacular!”-SueBee *Prepare to love it or hate it. Affairytale will rip your heart out and make you hate the author so bad you’ll want to throw it/her at the wall. Or, you will understand and root for love to win. Not for readers under 18, not for readers who can’t stomach real life affairs and why they happen, not for readers who send hate mail and not for readers who like to settle in and get comfortable. This is a cringe worthy, stomach wringing, pain inducing true account of a real life affair that will leave you with no doubt that true love really does exist.",
  "genres": [
    "Nonfiction",
    "Romance",
    "Memoir",
    "Friends To Lovers",
    "Contemporary",
    "Contemporary Romance",
    "Adult"
  ],
  "author": "C.J. English",
  "average_rating": "3.79",
  "url": "https://www.goodreads.com/book/show/25439738-affairytale"
}