{
  "title": "The Sacred Monotony of Breath",
  "description": "Just read “Waiting for the Kitchen Floor to Dry” and try to tell me Robert Nordstrom is not a powerful and sensitive witness. Nordstrom asks the big questions about love and death, old lovers and the celebration of living (“Recalling Happy”). Tell me there’s a better title than “Drinking Tea Downwind from Auschwitz” or a better first line than “my dog’s a liar and she’s not very good at it” (“Good Dog”). Read these poems. These are good poems.Bruce Dethlefsen, author of Small Talk and Unexpected Shiny Things, Wisconsin Poet Laureate (2011-2012) Robert Nordstrom's poems live richly in the space between memory, breath, and desire. Nostalgic, doubting, and doubling-back over the lost country of childhood and adolescence, he affectionately searches the past for clues that will illuminate the mysterious and haunting present.Alison Luterman, author of Desire Zoo and Feral City Robert Nordstrom writes with lyrically gritty understatement, compassion, and humor about the ordinary personal and its historical and political a dead mother “hair in curlers,/ nibbling an egg salad sandwich/ on the dark side of a screen door,” “a shoplifting orgy/ of squirt guns and yo-yos the morning after” a trip to the altar, returning from Vietnam to a shopping mall’s parking lot, a locker room in which “we’re all a bunch of cheerleaders and assassins/ with remotes,” a bus-load of school kids … already programmed with the high and low impulses of humans. “These children, these children, these children—/ why do I love them so? Because they open the windows / on the first warm day of winter,/ inhabit their stories before parody obscures.” Listen as Nordstrom allows his readers to inhabit their stories too.Wendy Vardaman, author of Obstructed View and founding co-editor of Cowfeather Press. She is one of Madison, Wisconsin's two Poets Laureate (2012-2015).",
  "genres": [],
  "author": "Robert Nordstrom",
  "average_rating": "4.85",
  "url": "https://www.goodreads.com/book/show/25443779-the-sacred-monotony-of-breath"
}