{
  "title": "Falaha's Journey Into Pleasure",
  "description": "FALAHA'S JOURNEY SERIES Vol. 2This book is not stand-alone.An EXPANSION SET for Falaha’s Journey: A Spacegirl’s Account in Three Movements (Falaha’s Journey Books 1-3); combined into a full serial novel in a single volume (Falaha’s Journey Book 3.5).Falaha has grown and her transformation also encompasses a transition from a young girl into a young woman. This is an explicit, at times graphic, story of a young woman exploring the depths of pleasure, of mind, body and heart. But she isn’t going on that journey alone…Vol­ume Con­tents:Pro­logue: Wel­come to Adult­hood (Episode #1)Seven years have passed since the war ended. Commander now has her hands and head full with social, household and ship matters. Her loyal first spouse has to do something to help her release steam… and to remind her with a stern yet loving hand that she has entered adulthood.Part One: This Lonely, Lonely Space­man (Episode #2)Nine years have passed since the war ended. Commander has her hands and head full with social, household and ship matters, finding comfort and burning passion in the arms of her insatiable first spouse. Now his father has returned from the Hunter clean-up… to a conspiracy of epic proportions that threatens Commander’s peace and Orewen’s courtship plans.Part Two: The Man in a Box (Episode #3)Kinky, inappropriately funny and strictly immodest, one mountain man’s journey to enlightenment.Deep in the Kjrrn Mountains of Medas, a certain young man runs away from himself… only to find he is face to face with a mysterious massive creature that walks the mountains on misty nights and is somehow tied to his existence. The encounter forces the young man to look for the creature and seek out the answers its emergence may hold.Falaha’s Journey Into Pleasure is a story of recovery, family life, spicy romance and sex, with more insights into the Danna culture and personalities of the characters, also things left unexplored, and side questions left unanswered in the main book. This is a precious time of peace before another calamity.Length: approx. 71 000 words.Publisher's Note: This serial novel includes graphic sexual scenes (M/F, MFM, M/M, MMFM), polyamory, and light elements of BDSM.",
  "genres": [
    "Erotic Romance",
    "Adult Fiction"
  ],
  "author": "Jeno Marz",
  "average_rating": "4.50",
  "url": "https://www.goodreads.com/book/show/25442805-falaha-s-journey-into-pleasure"
}