{
  "title": "Burn",
  "description": "This is second book in raw, intense and edgy, Brothers of Ink and Steel series.Liam Knight, a sexy panty-melting, hard-bodied streetfighter and renowned tattoo artist, is rising up the ranks of the UFC Middleweight Division, but he's about to get knocked out by his past. Quinn Kelley is a semester away from becoming a college graduate when her mother's death sends her spiraling, forcing her to go back to her hometown -- and a past she can't outrun. Nearly a decade ago, Liam and Quinn fell in love while surviving on the city streets together, but they were torn apart by one irreversible night. Now each has moved forward without the other, but like a tattoo on the heart, absolute love creates a lasting burn. Quinn has kept a tight rein on her emotions, but with the passing of her mother, the foundation she's built begins to crack. Will seeing Liam again crumble her fortress to the ground, uncovering the flame that still burns? Or will it extinguish the fire forever? Liam's tough exterior and resentful demeanor hides more than a wounded heart. He's tormented by guilt over what happened to Quinn -- and the secret he kept, even from her. But revealing his secrets would require unearthing the all-consuming monster he keeps caged in the darkest part of his soul, the one that threatens to devour him. When they're given a second chance, will they let go of their fear and pride and let the flame between them become one? Or will the heat burn them both? Note: \"Burn\" promises sincere bonds between strong characters, no cheating, a solid HEA, with angst, violence and mature themes. It is intended for 18+ readers, and can be read as a standalone (but the overall story arc is strengthened by reading each book in the series order). Enjoy!!",
  "genres": [
    "Romance",
    "Contemporary Romance",
    "Fighters",
    "Sports",
    "Contemporary",
    "Mixed Martial Arts",
    "Abuse"
  ],
  "author": "Allie Juliette Mousseau",
  "average_rating": "4.29",
  "url": "https://www.goodreads.com/book/show/25446433-burn"
}