{
  "title": "Inventing a Christian America: The Myth of the Religious Founding",
  "description": "Among the most enduring themes in American history is the idea that the United States was founded as a Christian nation. A pervasive narrative in everything from school textbooks to political commentary, it is central to the way in which many Americans perceive the historical legacy of their nation. Yet, as Steven K. Green shows in this illuminating new book, it is little more than a myth. In Inventing a Christian America, Green, a leading historian of religion and politics, explores the historical record that is purported to support the popular belief in America's religious founding and status as a Christian nation. He demonstrates that, like all myths, these claims are based on historical \"facts\" that have been colored by the interpretive narratives that have been imposed upon them. In tracing the evolution of these claims and the evidence levied in support of them from the founding of the New England colonies, through the American Revolution, and to the present day, he investigates how they became leading narratives in the country's collective identity. Three critical moments in American history shaped and continue to drive the myth of a Christian the Puritan founding of New England, the American Revolution and the forging of a new nation, and the early years of the nineteenth century, when a second generation of Americans sought to redefine and reconcile the memory of the founding to match their religious and patriotic aspirations. Seeking to shed light not only on the veracity of these ideas but on the reasons they endure, Green ultimately shows that the notion of America's religious founding is a myth not merely in the colloquial sense, but also in a deeper sense, as a shared story that gives deeper meaning to our collective national identity. Offering a fresh look at one of the most common and contested claims in American history, Inventing a Christian America is an enlightening read for anyone interested in the story of-and the debate over-America's founding.",
  "genres": [
    "History",
    "Religion",
    "Politics",
    "Nonfiction",
    "American History",
    "Christianity",
    "Satanism"
  ],
  "author": "Steven K. Green",
  "average_rating": "4.01",
  "url": "https://www.goodreads.com/book/show/25446019-inventing-a-christian-america"
}