{
  "title": "The Prince's Assassin",
  "description": "Rumors and whispers of plots in the shadows send royal agent Duga Rigers undercover into the matriarch's harem. Secrets stalk the silken halls threatening not only the royal harem but the Crown Prince's chosen lover. Will death find Duga Rigers and the other boys of the royal harem or will the royal agent unmask the assassin hiding in the silken shadows?If Rigers doesn’t succeed in his mission, he and a hundred other beautiful men may die. Crown Prince Baboye begs Rigers, his special advisor, to save Eyakan, a harem boy with eyes the color of smoke, that he wants to take on as his consort during the upcoming jubilee. But when Rigers learns that Eyakan is the potential assassin, he must figure out how to save the harem, Eyakan, Eyakan’s family and the crown prince while dealing with his own malaise and loneliness.“The prince has also told me of the plan to have you go undercover in the harem. He has already made it possible for you to start as the new sex trainer this afternoon. I hope you’re successful. I’m going to give you an incentive, Rigers.”Duga noticed the prince glance briefly at his mother, but his face still betrayed no emotion.“Incentive, madame?”She nodded. “My jubilee celebration banquet is in six days’ time. You will bring your investigation to a successful conclusion in five days’ time, or all the boys in the harem will be executed.”“Madame?” Duga could not believe what he was hearing. No royal family, as far as he knew, had ever contemplated executing its harem members. Harem boys and girls served the royal family, and the royal family protected them.“Success will mean unmasking the plotters, including the assassin, or concluding that there is no threat.”Duga looked over at the prince, who was looking out the window again.“Don’t worry. We can find more of them where we found you, Rigers,” she said. “Thank you. I bid you good fortune.”That was his cue to leave. He knew there would be no further conversation. He couldn’t imagine that the prince agreed with his mother. After all, the prince wanted to make one of the boys his consort. The boy’s life would be forfeit if Duga failed, and if the matriarch meant to carry out her threat. Duga stood up, bowed and walked swiftly from the office. He picked up the pace once he was in the reception area. He felt blood rushing to his head. All those boys! It’s monstrous! He broke into a jog to get as far away from the matriarch as he could. He slowed down only when he heard Prince Baboye calling his name.",
  "genres": [
    "Fantasy"
  ],
  "author": "Danielle Summers",
  "average_rating": "2.93",
  "url": "https://www.goodreads.com/book/show/25444809-the-prince-s-assassin"
}