{
  "title": "Chasing Mr. Wright",
  "description": "Grayson Wright is a man who knows how to do many things. He knows how to follow his dream and create a company, Wright Creations, alongside his brother. He knows how to be a good son, brother, friend, and employer. Grayson doesn’t know how to fix his toxic relationship with his long-time boyfriend.Grayson decides to throw his boyfriend a surprise birthday party as a last ditch effort to rekindle the old spark, but it’s Gray who gets the surprise of his life when he turns on the lights and learns the ugly truth about his life. Now at age 32, he re-evaluates who he is, what he wants out of life, and the kind of man he wants to give his heart to. Chase Rivers has an MBA from Georgetown with a minor in marketing. His life starts looking up when he accepts an entry level position at an ad agency. It isn’t his dream job, but it’s a great start and it just feels right to him. He hopes this new beginning in his professional life will spill over into his personal life.Chase is unlucky in love and draws every loser, liar and cheater like a magnet. He’s an expert at finding the perfect mate for his friends, but strikes out every time for himself. He gives up on finding Mr. Right and agrees to a date with Mr. Right Now out of loneliness and desperation. Chase didn’t expect Mr. Right Now to lead him to the doorstep of his very own Mr. Wright. If their first meeting was a fluke, then what was the second and third? Twisted fate? Bad luck? Fated hearts? Buckle up for a bumpy ride as these two men travel down a broken road of heartache and discovery. This book contains heart, humor, heat, and a cast of characters that is sure to keep you smiling. It contains adult language, explicit sexual acts between two men, and is intended for people who are 18 and older.",
  "genres": [
    "M M Romance",
    "Romance",
    "Contemporary",
    "Audiobook",
    "Gay",
    "LGBT",
    "Contemporary Romance"
  ],
  "author": "Aimee Nicole Walker",
  "average_rating": "3.95",
  "url": "https://www.goodreads.com/book/show/25446843-chasing-mr-wright"
}