{
  "title": "Medieval Future: The Last Dragon Throne",
  "description": "MEDIEVAL FUTURE The Medieval Future Series, Book #1: The Last Dragon Throne  A tale, thousands of years in the making: Medieval Future unleashes a global conspiracy and catapults humanity ever closer to all out war. Castles, dragons, and dynasties, bent on absolute power, will battle for supremacy against a backdrop of forbidden love and desperate need. The time is right, the planets are aligned...  Forever changed by molten debris hurled through time and space, the planet continues to harbor inhabitants that were once nearly obliterated by the asteroid shower. Rebuilding humanity has taken thousands of years, but peace, at least for now, prevails. A secret cabal, the Allfathers, see themselves as guardians, wielding their influence to unite the kingdoms of the world under a single leader: Prince Daven Brookler, the son and heir of King Daven I. However, the young university student has a mind of his own and seeks freedom to navigate the course of his life, apart from the whims of those in power. Quietly, he has given his heart to a strong-willed woman, with a past...and a secret. Their union threatens too much to be ignored, creating a show down of duty, love, and honor, but that clash is perhaps the least of their concerns.  Thriving in a climate of oppression and hate, a religious faction, set a world apart, has seized control and looks to conquer the planet. Their dogma of 'death or submission' is ruthlessly enforced, enslaving thousands to their God's will, and tipping the scales of political domination, an outcome truly feared by the Allfathers.  Greed, old rivalries, and conspiracies, rife with deceit, threaten a plan for world order that would bring peace and unity. Medieval Future: The Last Dragon Throne is a thought provoking, political thriller of global proportions, swept along by dynamic characters twisted together in a complex, all-encompassing plot. Author Michael Anthony has rewritten the history of the world, bringing book one of his fantasy thriller to light.  Harness your dragon, reach for your buckler and blade and join the battle; the vision of a united future – One World, One People – hangs in the balance. Where will your allegiances lie and who will win your heart?",
  "genres": [
    "Fantasy",
    "Historical",
    "Medieval"
  ],
  "author": "Michael     Anthony",
  "average_rating": "3.47",
  "url": "https://www.goodreads.com/book/show/25449912-medieval-future"
}