{
  "title": "The Real Wealth of Nations: Creating A Caring Economics",
  "description": "Adam Smith's The Wealth of Nations provided the first, most influential and lasting explanation of the workings of modern economics. But with his focus on \"the market\" as the best mechanism for producing and distributing the necessities of life, Smith's concepts only told part of the story, leading to flawed economic models that devalue activities that fall outside of the market's parameters of buying and selling. The real wealth of nations, Riane Eisler argues, is not merely financial, but includes the contributions of people and our natural environment. Here, Eisler goes beyond the market to reexamine economics from a larger perspective--and shows that we must give visibility and value to the socially and economically essential work of caring for people and the planet if we are to meet the enormous challenges we are facing.Eisler proposes a new \"caring economics\" that takes into account the full spectrum of economic activities--from the life--sustaining activities of the household, to the life-enriching activities of caregivers and communities, to the life-supporting processes of nature. She shows how our values are distorted by the economic double standard that devalues anything stereotypically associated with women and femininity; reveals how current economic models are based on a deep-seated culture of domination; and shows how human needs would be better served by economic models based on caring. Most importantly, she provides practical proposals for new economic inventions--new measures, policies, rules, and practices--to bring about a caring economics that fulfills human needs.Like her classic The Chalice and the Blade, The Real Wealth of Nations is a bold and insightful look at how to create a society in which each of us can achieve the full measure of our humanity.",
  "genres": [
    "Economics",
    "Nonfiction",
    "Politics",
    "Feminism",
    "Social Justice",
    "Sociology",
    "Social Science"
  ],
  "author": "Riane Eisler",
  "average_rating": "4.08",
  "url": "https://www.goodreads.com/book/show/115600.The_Real_Wealth_of_Nations"
}