{
  "title": "L.o.v.e.",
  "description": "Before you dive into this story, I need you to promise me something. I need you to promise me just this one thing and I believe you’re one of those people that keeps their promises.Okay, now it’s done.You, my dear reader, just promise me not to hate him.See, he really didn’t have a choice. Well, maybe he did in eyes of some people, but in his, he didn’t, and I’m sure he considered every other way, every other angle. But in the end, it all came to this. And I’m glad, I’m so fucking glad that he chose that direction. That he chose to go down that route. Why?Because he saved me.He saved me from pain.He saved me from misery.He saved me from becoming something I always despised.But first…He gave me love.He gave me happiness. He gave me freedom.He helped me to become the best of me.And for that I’m grateful. Mia Stone doesn’t look for attachments, in fact, she doesn’t look for anything serious at all. Serious means losing something. She’s already lost enough and she doesn’t want to lose…again. Living her life as free and simple as she can, she’s following her own rules.  But everything changes when the mysterious and sexy Dylan Heart comes crashing into her life. And just like that, he tears down the walls that she’s built up solidly for so long. Brick by brick he’s getting closer and closer to her heart, but he’s not the only one, and he’s aware of his competition. Jason, Mia’s friend, hopes for more even though he’s trying to just be a friend.  Will they break through? Will they be able to crush and break the walls of her stubborn heart? Which ONE is going to break through?  Will they save her from her fear to commit or is the commitment going to end them all? *WARNING IYou are about to dive into a non-convectional love story. One that doesn’t hold a fairytale ending, so if you are on the softer side move on to your next read and save yourself a box of tissues. *WARNING IIThis book contains sexually explicit scenes and adult language and may be inappropriate or offensive to some readers. It is intended for readers over 18+*WARNING IIIThis book contains a trigger that might be offensive to some, please consider that before reading.",
  "genres": [
    "Contemporary Romance"
  ],
  "author": "Kate Vine",
  "average_rating": "3.84",
  "url": "https://www.goodreads.com/book/show/25453927-l-o-v-e"
}