{
  "title": "Problems of Translation: or Charlie's Comic, Terrifying, Romantic, Loopy Round-the-World Journey in Search of Linguistic Happiness",
  "description": "\"...A MERRY, YEARLONG CHASE AROUND THE GLOBE....\"--Kirkus Reviews\"A comic masterpiece\" \"Poignant\" \"Pretty much perfectly done\"and A Shelf Unbound 2015 Notable BookCharles Abel Baker--short story writer and a \"most unlikely middle-aged hero\"--sets off around the world on a quest to see one of his short stories translated into ten different languages and back again into English, a sort of literary version of the old party game \"telephone.\" In Moscow, St. Petersburg, Siberia, China, India, Iceland, Japan, Mexico, and more, Charlie's round-the-world peregrinations are comical, romantic, and at times hair-raising.Problems of Translation is a cloak-and-dagger adventure, a love story, and a bracing ride for the language buff. Its naïve hero's quixotic mission will ultimately transform Charlie and those around him. And along the way, Charlie--lonely, divorced--comes to love and be loved by a generous, complicated woman, and at last to understand what drove him to undertake this journey.Who knew that literary translation could be so perilous? So romantic? So downright funny? A rousing hybrid and a great read, Problems of Translation is as stimulating as it is entertaining.\"An insanely amusing adventure that has a deep love of language at its belly-shaking core.\"-Gary Shteyngart, author of Little Failure and A Super Sad True Love StoryFrom Portland Book Review, Four \"...a zany and surprisingly philosophical adventure....This is a complex book that touches on language, culture, and the human desire to search for connection and meaning in life. One part midlife crisis, one part old-timey spy film, and one part romance, Problems in Translation is a multilayered story that readers - particularly those who love book related humor - will enjoy.\"\"Jim Story's name says it he was meant to be a writer...I hope everyone reads this book!\"-Hannah Tinti, author of The Good Thief and The Twelve Lives of Samuel Hawley\"In this comic masterpiece...we take a wild ride...through the underside of the literary world...as [Charlie] stumbles and careens into all kinds of trouble in and obsessive pursuit of hid Dream.\"-Robert Roth, author of Health Proxy; editor, co-creator of And Then\"A fascinating look at the issues of translation, publishing, and an unglamorous middle-age.\"-Edith Grossman, author of Why Translation Matters; award-winning translator of Cervantes, Gabriel Garcia Marquez, and others\"...Marvelous touches of...poignancy that don't...delay the progress of the story toward it's delectable conclusion...pretty much perfectly done.\"-Ron Story (no relation), Emeritus Professor, UMass Amherst; author of Jonathan Edwards and the Gospel of Love",
  "genres": [
    "Fiction",
    "Language"
  ],
  "author": "Jim  Story",
  "average_rating": "3.81",
  "url": "https://www.goodreads.com/book/show/25455906-problems-of-translation"
}