{
  "title": "The Story Grid: What Good Editors Know",
  "description": "WHAT IS THE STORY GRID? The Story Grid is a tool developed by editor Shawn Coyne to analyze stories and provide helpful editorial comments. It's like a CT Scan that takes a photo of the global story and tells the editor or writer what is working, what is not, and what must be done to make what works better and fix what's not. The Story Grid breaks down the component parts of stories to identify the problems. And finding the problems in a story is almost as difficult as the writing of the story itself (maybe even more difficult.) The Story Grid is a tool with many 1. It will tell a writer if a Story \"works\" or \"doesn't work.\" 2. It pinpoints story problems but does not emotionally abuse the writer, revealing exactly where a Story (not the person creating the Story...the Story) has failed. 3. It will tell the writer the specific work necessary to fix that Story's problems. 4. It is a tool to re-envision and resuscitate a seemingly irredeemable pile of paper stuck in an attic drawer. 5. It is a tool that can inspire an original creation. Shawn Coyne is a twenty-five year book-publishing veteran. He's acquired, edited, published or represented works from James Bamford, John Brenkus, James Lee Burke, Barbara Bush, Dick Butkus, Harlan Coben, Nellie Connally, Michael Connelly, Robert Crais, Ben Crenshaw, Catherine Crier, Brett Favre, David Feherty, John Feinstein, Tyler Florence, Jim Gant, Col. David H. Hackworth, Jamie Harrison, Mo Hayder, William Hjortsberg, Stephen Graham Jones, Jon Krakauer, David Leadbetter, Alan Lomax, David Mamet, Troon McAllister, Robert McKee, Matthew Modine, Bill Murray, Joe Namath, John J. Nance, Jack Olsen, Scott Patterson, Steven Pressfield, Matthew Quirk, Anita Raghavan, Ian Rankin, Ruth Rendell, Jerry Rice, Giora Romm, Tim Rosaforte, William Safire, Dava Sobel, Michael Thomas, Nick Tosches, Ann Scott Tyson, Minette Walters, Betty White, Randy Wayne White, Steven White, and Don Winslow among many others. During his years as an editor at the Big Five publishing houses, as an independent publisher, as a literary agent both at a major Hollywood talent agency and as head of Genre Management Inc., and as a bestselling co-writer and ghostwriter, Coyne created a methodology called The Story Grid to teach the editing craft.",
  "genres": [
    "Writing",
    "Nonfiction",
    "Reference",
    "Crafts",
    "Research",
    "How To",
    "Communication"
  ],
  "author": "Shawn Coyne",
  "average_rating": "4.31",
  "url": "https://www.goodreads.com/book/show/25455700-the-story-grid"
}