{
  "title": "Iron & Bone",
  "description": "Will he claim his heart's hungry desire for the first time no matter the price?Boner, the brooding enforcer of the motorcycle club risks his darkest secret to protect Jill, a rebellious young woman and a single mother who's determined to start a new life for herself, despite her volatile ex-husband from a rival club.He knows he should stay away from her. She's much younger. And gorgeous. Generous, funny, brave. And she holds the key to his best friends' happiness. But one violent incident changes his mind.Now thrown together, he can't help himself. He’s possessive, emotional. And when they finally touch, he feels truly alive for the first time in forever.And so does she.But it's not only desire and the bonds of brotherhood and friendship that keep Boner close to Jill. Hungry for Jill.It's his wild, untamed heart.But when his ugly past rears its head and puts the club at risk, will Boner realize how powerful and true their love is before it’s too late?\"A knife that cut too deep,a slash that still burns,failures piled high and flammable.I held my losses at bay with knives, with guns, my hands,my bike, my brothers,my iron will.But not my heart.No, my heart was the flamethat would light the match,ignite the blaze.I am the enforcerThe killer when called upon, the ruthless hound on demand, the one who cleans the mess left behind.The protectorI can make you bleed,Smash you to pieces.But she smashed all my excuses,and I shattered hers.For a split second she was mine,but I will always be hers.Some things,really beautiful things,you can’t hold onto forever.\"\"A magical, intense, sexy, and incredibly satisfying read.\" - Book BellasThe Lock & Key Series:1 - Lock & Key2 - Random & Rare3 - Iron & Bone4 - Blood & Rust*Novella - Lock & Key Christmas*Series spinoff - FuryThe Lock & Key series is a 4 book motorcycle club romance saga with hot alpha anti-heroes. These romantic suspense / romantic adventure / small town romance / biker romance / coming of age / women's fiction novels contain adult language, sex, violence and are intended for mature audiences",
  "genres": [
    "Romance",
    "Contemporary Romance",
    "Contemporary",
    "Dark",
    "Audiobook",
    "Suspense",
    "Dark Romance"
  ],
  "author": "Cat Porter",
  "average_rating": "4.30",
  "url": "https://www.goodreads.com/book/show/25461044-iron-bone"
}