{
  "title": "Deadly Toxins of Unhealthy Churches: A survivor's testimony of hope and triumph amidst the turmoil and trauma of spiritual abuse",
  "description": "The topic of spiritual health is not a very popular one in most churches today. It is a very sensitive and taboo topic that many church organizations would rather not confront. The records however, show that based on the impact on members’ lives, the differences between healthy and unhealthy churches make this discussion one of paramount importance to the Body of Christ. This is largely so because the scars of spiritual abuse, resulting from spiritual toxicity, can last for a lifetime. The fact is that there are churches that spiritually abuse their members. It is a growing trend in Christendom where unhealthy churches have commandeered the lives of millions of followers. Unconditional love is not to be found in these organizations. One has to earn that love and acceptance through performance. Often church leaders would publicly embarrass and threaten members into strict obedience to a legalistic code. This book was written for survivors of spiritual abuse. Much of it recounts the spiritual journey of the author, who spent over two decades as a member of a church recognized internationally as a Christian cult. There are millions of believers who have fallen through the cracks of Christendom and need to hear a healing word of comfort. It was written for them before they reach their breaking point. Many of them drift along aimless and godless. This book is divided into three sections: Section 1 discusses several criteria by which spiritual health can be assessed. Section 2 offers hope and some good news for survivors of spiritual abuse. It discusses the process of: coming to grips with the effects of spiritual abuse, departing such organizations, and seeking redress from unhealthy, abusive church experiences. These are necessary steps on the road towards recovery and wholeness of the inner person. Section 3 is a question and answer section, where frequently asked questions on the issues surrounding spiritual health and spiritual abuse are answered. Our hope and prayer for survivors of spiritual abuse; both the abused and their perpetrators, within the Body of Christ is for them to heed the words of Jesus, as He calls them to lay down the heavy burdens of religious legalism, and find rest, healing and acceptance in Him (Matthew 11:28-31). For it is in Him and Him alone, that true spiritual fulfilment can and must be found.",
  "genres": [],
  "author": "Mike Case",
  "average_rating": "2.80",
  "url": "https://www.goodreads.com/book/show/25459429-deadly-toxins-of-unhealthy-churches"
}