{
  "title": "Hateship, Friendship, Courtship, Loveship, Marriage: Stories",
  "description": "As always, Alice Munro surprises us. While the nine stories in this new collection could not be written by anyone else, they are subtly different. The title story, for example, ranges from small-town Ontario just after the war to a near-deserted hotel on the bald Saskatchewan prairie. The setting may be strange, uncharted Munro territory, but the plot is familiar, with two lives changed forever by a random act of mischief that can never be revealed.“Floating Bridge” is also a typical Alice Munro story, but different. Forty-two-year-old Jinny is fighting cancer, and the front room in their middle-class home is turned into a sickroom. Her husband hires a girl to look after her, and they visit the girl’s trailer park relatives. Class tensions are exposed ( “You know you’ll hurt their feelings,” he whispered. “They’re trying to be nice to you.” ), and then something both unbelievable and totally believable happens to conclude the story in a way the reader will never forget.Other stories contain lines that change the world. A promisingly flirtatious reunion with a teenage sweetheart, now married, takes an unexpected turn. ( “About our youngest boy,” he said. “Our youngest boy was killed last summer.” Oh. “He was run over,” he said. “I was the one who ran over him. Backing out of our driveway.” I stopped again. He stopped with me. Both of us stared ahead. “His name was Brian. He was three.” )In this great book by one of the world’s great writers, the settings may be Vancouver Island, small-town Ontario, Toronto, or Vancouver, but the stories are universal, and the characters – no, the people in the stories – are unforgettable.",
  "genres": [
    "Short Stories",
    "Fiction",
    "Book Club",
    "Canada",
    "Literary Fiction",
    "Contemporary",
    "Nobel Prize"
  ],
  "author": "Alice Munro",
  "average_rating": "4.03",
  "url": "https://www.goodreads.com/book/show/1156317.Hateship_Friendship_Courtship_Loveship_Marriage"
}