{
  "title": "Root River Return",
  "description": "In his long anticipated poetic memoir, internationally acclaimed author and poet David Kherdian continues his poetic reflections, focusing on the city of his youth, Racine, Wisconsin during the 1930 s and 40 s. The poems and prose explore the bittersweet childhood and adolescence of the author at a time when the second generation of Armenian-Americans experienced not only the Depression and the war years, but also the anguish of dual identity, deracination, and discrimination. It was a stressful and confusing era, especially for children and adolescents who had little guidance and no social scientist to verbalize their plight. Meanwhile their impoverished parents, mostly peasants from the old country, were going through the trauma of genocide memories and survival in a strange land.Kherdian portrays the various layers of these stresses in pain and in joy, compassion and understanding. Kherdian succeeds at a very difficult he has \"forgiven\" his childhood. His old friends are all here and remembered with tenderness. Eggs Krikorian, Dominic Galati, Chuck (Horse) Kamakian, Nancy Jacobsen, Gob Kaiserlian, fishing aceJoe Perch, Dafje Vartan, Ray Rodriguez, Lotch Oglanian.The vibrant mosaic of Racine is also the rag man calling from his horse-drawn wagon, bridges, trains, Lake Michigan, Garfield [elementary] School, the Boranian Grocery Store on State Street, driving to a picnic in his uncle's Model- A Ford, the Root River which separated and joined the various communities, St. Mesrob Armenian Church, downtown's Monument Square, Rex, Rialto, and Venetian theatres, and the Armenian sourjarran (coffee house). They all come alive as Kherdian rolls back the years gently into his sometimes gray, sometimes luminescent boyhood.The poems and prose of Root River Return spring from an ancient tradition and bear its stain. The poems are filtered through Kherdian s sensibilities that are uniquely Armenian, but welded to an American tongue, and the solid background of his Midwestern beginnings. Kherdian addresses his life through these poems, digging beneath the events of each experience, pushing them into the light, and revealing their meanings.",
  "genres": [],
  "author": "David Kherdian",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/25470137-root-river-return"
}