{
  "title": "In the Garden of Iden",
  "description": "In 16th-century Spain, everybody expects the Spanish Inquisition, as they have a well-known tendency to cart people off to their dungeons on trumped-up charges. What 5-year-old Mendoza, on the brink of being tortured as a Jew, is totally unprepared for is to be rescued by the Company--the ultimate bureaucracy of the 24th century--and made immortal. In return, all she has to do is travel through time on a series of assignments for the Company and collect endangered botanical specimens. The wisecracking, mildly misanthropic Mendoza wants nothing to do with historical humans, but her first assignment is to travel to England in 1553--uncomfortably close to those damn Inquisitors--with Joseph and Nefer, two other Company operatives. Their intent is to gather herb samples from the garden of Sir Walter Iden, a foolish though generous country squire. (Kage Baker knows her Sir Walter is the descendant of Alexander Iden, loyal subject of Henry IV, who slew the hungry rebel Jack Cade in that very garden in Kent.)The cyborg trio poses as Doctor Ruy Lopez, his daughter Rosa (the irrepressible Mendoza, now grown), and her duenna, Doña Marguerita; Sir Walter's hospitality and discretion are bought for the promise of restored youth. (There are hilarious moments that call to mind the Coneheads, who claimed to be from France when caught doing anything peculiar.) Sir Walter's secretary, Nicholas Harpole, is immediately suspicious of and hostile towards the strange \"Spanish\" visitors, which prompts Mendoza to fall in love with him. Nicholas has his own badly kept he's proudly Protestant at a time when Queen Mary and Philip of Spain are on a Catholicizing rampage. Mendoza knows Nicholas is probably doomed, and that as a Company operative she cannot meddle with his fate, but love makes people do desperate things. Baker surpasses even Connie Willis in humor and precision of period detail in this fresh, ingenious first novel. --Barrie Trinkle",
  "genres": [
    "Science Fiction",
    "Time Travel",
    "Fiction",
    "Historical Fiction",
    "Fantasy",
    "Historical",
    "Romance"
  ],
  "author": "Kage Baker",
  "average_rating": "3.78",
  "url": "https://www.goodreads.com/book/show/2546980.In_the_Garden_of_Iden"
}