{
  "title": "Fractured Legacy",
  "description": "“Callahan has combined two very intriguing characters with a great storyline to create a fast-paced supernatural tale.” (Kimber Leigh Wheaton) Paranormal investigator, Kaylyn is thrilled with the opportunity to investigate the Teague Hotel—a beautiful historic building at the heart of Chatham, Ohio—with a not-so-beautiful past. But the conditions of her investigation aren’t so ideal… First, she screws up on what should be a simple “pick-up” when she’s sent to the local historical society to retrieve an occult object with unknown powers. Then, her new boss threatens to fire her on the spot, potentially ending the career she’s dreamed about and worked for her whole life.Unfortunately, even after he relents and gives her one final chance to prove her worth to the organization, things continue to go wrong. Terribly wrong. Unexplainable dreams and blackouts… Fires… Unrelenting attacks against her mind, body, and soul, that may or may not be real. If Kaylyn stands any chance of defeating the powerful force waiting for her in the hotel, she’ll first have to convince everyone around her that the threat isn’t only in her head. And—possibly the harder task—face up to the fact that she needs to ask for help.“The ending scenes had me on the edge of my seat, behind a cushion hugging my dog.” (Never judge a Book by its Movie)Book 1 in the Aicil Paranormal FilesJoin the members of Aicil, a centuries old organization dedicated to researching and fighting the forces that stalk humankind from just beyond the veil of darkness. Hauntings, occult objects, supernatural beings…. they’re just the beginning for these investigators. The darkness doesn’t always recede when the sun comes up. Previously released as Fractured Legacy, Book 1 as Skye Callahan",
  "genres": [
    "Paranormal",
    "Fantasy",
    "Fiction",
    "Horror",
    "Ghosts",
    "New Adult",
    "Thriller"
  ],
  "author": "S.J. Callahan",
  "average_rating": "3.67",
  "url": "https://www.goodreads.com/book/show/25467075-fractured-legacy"
}