{
  "title": "Plato's Parmenides: Text, Translation & Introductory Essay",
  "description": "Plato’s Parmenides presents the modern reader with a puzzle. Noted for being the most difficult of Platonic dialogues, it is also one of the most influential. This new edition of the work includes the Greek text on facing pages, with an English translation by Arnold Hermann in collaboration with Sylvana Chrysakopoulou. The Introduction provides an overview and commentary aimed at scholars and first time readers alike.Heeding the challenge of balancing intelligibility with faithfulness—while maintaining sufficient consistency to allow the discernment of technical terms—great pains have been taken to secure both accuracy and accessibility. In his Foreword, Douglas Hedley gives an insightful account of the way the Parmenides was received by different cultures and philosophical schools throughout the centuries to the present day.Hermann’s Introduction, aimed at first time readers and professional interpreters alike, offers an overview of the most noted philosophical problems addressed in the dialogue, and of its historical background. In view of the fact that certain individual issues have been exhaustively explored by generations of scholars, Hermann chooses to focus also on subjects that have at times been passed over, or the debt the dialogue may owe to the works of earlier thinkers, or whether it constitutes a response to certain critics of the Theory of Forms; as for the Theory itself, whether it is bolstered or superseded by the dialogue’s conclusions, or whether there is such a thing as a “simple,” unparticipated Form, and if there is, why it cannot be the subject of an account; also, the issue of the “interweaving of Forms,” (the Sophist) is discussed, in light of its possible relevance to the Second Part of the Parmenides. Finally, Hermann provides an overview with a listing and summaries of the individual conclusions to each of the eight central arguments of the dialgoue’s Second Part (plus Coda).\"Arnold Hermann has rendered a major service to every student of Plato by presenting us with a new translation of the dialogue Parmenides conveniently facing the Greek text, together with a challenging introductory essay that calls attention to the important Eleatic dimension pervading all of Plato’s work. Thus Hermann’s insightful commentary pursues the close connections between the Sophist and the Parmenides, while also recognizing the Zenonian character of many of the arguments in Parmenides Part Two. The result is a fuller picture of the links between Parmenides and Plato, as well as between the Parmenides and the other dialogues.There is a thoughtful Foreword by Douglas Hedley tracing the Parmenidean philosophical legacy through Neoplatonism down to Schopenhauer and Wittgenstein.\"—Charles H. Kahn, Professor of Philosophy, University of Pennsylvania\"It is always enlightening to re-read Plato, however often one does so, and to re-read the Parmenides in the company of Arnold Hermann's lucid and elegant translation, with its fine introduction and notes, is a pleasure indeed. We will no doubt never quite solve all the puzzles presented by this most troublesome of Plato's works, but this new edition is a powerful stimulus to try once more.\"—John M. Dillon, Emeritus Professor of Greek, Trinity College, Dublin\"The Parmenides is Plato's most formidable dialogue, posing interpretive problems that remain unresolved despite two millennia of commentary. These problems stem in part from difficulties in translation to modern languages. The translation of Arnold Hermann and Sylvana Chrysakopoulou is one of the three or four best currently available in English. This, along with Hermann's thoughtful introduction, makes Plato's Parmenides a welcome addition to contemporary Plato scholarship.",
  "genres": [],
  "author": "Arnold Hermann",
  "average_rating": "4.40",
  "url": "https://www.goodreads.com/book/show/25476161-plato-s-parmenides"
}