{
  "title": "Paige and Chloe",
  "description": "Eighteen year old identical twins, Paige and Chloe are the youngest of Hound's and Maggie's children. Although sharing their looks that's where the similarities end as Paige embraces club life by becoming a stripper, whereas Chloe follows her dream of becoming a hair stylist. Paige and Chloe's relationship has been arduous over the years, much to Chloe's annoyance because however hard she tries to get close to her twin, her efforts are futile. After months of flirting, Chloe's admirer at the club finally gives into his urges and they start a secret affair but Paige relishes in Chloe's pain and when she catches them in an embrace, she doesn't hesitate to inform Duke of what she has seen. Will the relationship be strong enough to last the distance or will Duke put an end to it before it's even begun? Paige is dealing with her own demons and uses drugs and casual sex to numb the pain, and hide the secret that if revealed, may rip her family apart forever. Paige uses this hate to build a barrier around herself and push away the people who love her, but will there be anyone left to help her when she needs them most or has she burnt all of her bridges forever?Note to readers: This is not your normal MC series. The Aces are an MC with alpha males but the members do not shy away from the fact that they are husbands, fathers and lovers with feelings. If you don’t like a biker who cares and respects his woman, then this isn't a book for you.I want to take the time to mention that I’m from the United Kingdom and use UK spellings.To receive the full experience of the Aces MC Series it is recommended to read the stories in the following order:Diesel – Book 1Duke - Book 2Paige and Chloe - Book 2.5 Spike - Book 3Amy - Book 3.5Locke - Book 4Jayden - Book 4.5",
  "genres": [
    "Romance",
    "Abuse"
  ],
  "author": "Aimee-Louise Foster",
  "average_rating": "4.16",
  "url": "https://www.goodreads.com/book/show/25473137-paige-and-chloe"
}