{
  "title": "Welcome to Forever",
  "description": "“Don’t miss this sparkling debut full of heart and emotion!” raves Lori Wilde. The Hero’s Welcome military romance series introduces a small coastal town where America’s best and brightest risk everything for love.  In Seaside, North Carolina, there are two kinds of Marines, and kids of Marines. Then there’s Kat Chandler. Recently hired as the principal of Seaside Elementary, Kat makes it her mission to turn the school into a place of peace and calm. That’s not going to be easy with hard-liner parents like Micah Peterson storming in, telling her how to do her job—and then kissing her with those gorgeous lips of his and turning her brain into mush.   As a Marine Sergeant and a single dad, Micah Peterson has just two doing his job better than anyone else, and getting the absolute best for his son, Ben. But when he meets Ben’s beautiful new principal, a different yearning shifts into focus. He wants her, sure, but he’s also moved by the connection Kat forges with her students. So after learning that she refuses to date Marines, Micah sets two more convincing Kat to give him a chance . . . and then holding on to her forever.Praise for Welcome to Forever   “Welcome to Forever is a beautiful and touching story of love and loss that will grab you by the heart and hold on long after you’ve finished reading.”—USA Today bestselling author Laura Drewry  “A wonderfully written debut novel that had me fighting back tears and rooting for the couple from the first page. Annie Rains is an author to watch. I can’t wait for more!”—USA Today bestselling author Sidney Halston   “Emotional, heartwarming and completely engaging . . . I highly recommend this one to those looking for a contemporary romance that was realistic instead of angst-filled, with characters who are likable and so deserving of a happy ending.”—Girl Plus Books  Includes a special message from the editor, as well as an excerpt from another Loveswept title.",
  "genres": [
    "Military Fiction",
    "Romance",
    "Contemporary",
    "Contemporary Romance",
    "Childrens",
    "Military Romance",
    "Family"
  ],
  "author": "Annie Rains",
  "average_rating": "3.91",
  "url": "https://www.goodreads.com/book/show/25476323-welcome-to-forever"
}