{
  "title": "Crystal Jake",
  "description": "The Bestselling Erotic Romance Series. Sexy & Suspenseful a whirlwind of steam, romance, and suspense. Meet the commanding, charismatic, Alpha - Crystal Jake Eden. Book 1 Haunted by memories of her brother’s death, and searching for answers,Lily Hart embarks on a career that takes her into a seedy underworld, where she is exposed to wealth, greed, lust and the reign of gorgeous, powerful, and dangerous men—one man in particular wreaks havoc on her emotions.  At thirty Jake Eden has everything: looks to die for, money, power and a never-ending line of twisted, fucked-up women willing to do anything to get with him. Love? Love was for pussies…until a woman with the stage name of ‘Jewel’ arrives on the scene. She alone is different from all the others.  Oozing pure, unadulterated sex, strong, intelligent and independent, she is everything he should stay away from, but she makes him itch to tame her and keep her for himself. Her lure is addictive and undeniable and soon he is hooked. But when the line between betrayal and loyalty is put to test… Will love be stronger than revenge?  Book 2  Lily: It wasn't supposed to be like this- I came ready, determined, but nothing could have prepared me for Jake Eden.  Engulfed in his power, his lust and his primal need for me, I've become ever more helpless in his hands. I love the way he touches me, holds me, protects me. I feel alive in ways I cannot explain. I know I am giving my body to a criminal...week after week, but I can't stop. I'm addicted. He has no idea. It's all wrong, but I'll stay with my plan until I figure out a way around the conflict I'm facing...   Jake: I never knew that looks could blindside a man the way Lily Hart's beauty did me. When our eyes collided that first time, the connection was instant, I knew, that she was like no other. She was something special, uniquely different. But I've discovered since then that there is a secretive side to her, and now I fear deception stalks her eyes.   I know I must keep my distance, but she keeps persisting that I have her heart, so how can I push her away when all I want to do is tie her down and make her mine?  Book 3  Lily: I've been such a fool. Such a fool. He saw me coming and tied me up in knots. And I let him. After Vegas, my heart and mind have been thrown into complete disarray. Is it really possible that what we had— all that blazing, unquenchable passion—was just an illusion? I know I've lost his trust, but somehow I must find a way to repair the damage I have caused and find my way back to his heart.   I have to make it right… whatever it takes.  Jake: She is my wife now, but I know she's not mine. Not really. Not properly. Not the way I want. You see, I want it all. Every last bit of her: heart, mind, body and soul. And I'm prepared to move heaven and earth to make that happen.  This is my mission and my promise.  Watch me make her mine or die trying...",
  "genres": [
    "Romance",
    "Contemporary",
    "Erotica",
    "Romantic Suspense",
    "Contemporary Romance",
    "Mystery Thriller",
    "Dark Romance"
  ],
  "author": "Georgia Le Carre",
  "average_rating": "4.38",
  "url": "https://www.goodreads.com/book/show/25474011-crystal-jake"
}