{
  "title": "Jalendu",
  "description": "Set in the turbulent twilight of the reign of the Mughal Emperor of India, Jalaluddin Akbar, Jalendu tell the story of the socially awkward, but politically important young Prince Adinath and Jali, a handsome, spiritually inclined farm boy who becomes his bodyguard. Their unlikely friendship and love changes the fate of the empire. The small kingdom of Vindhyagarh sits in the Vindhya foothills between Prince Salim, the rebellious son of the emperor and self-declared Sultan of Ilahabad (present day Allahabad) and his powerful Bundela Rajput ally, Maharaja Vir Singh Deo of Orchha. But Salim in truth is no rebel. He is loyal to the power behind the throne, the women of the imperial household. The court nobility, led by the emperor's vizier Abul Fazl, see their power evaporating as the emperor seems powerless to oppose the wishes of the empresses or to act against his disobedient eldest son. They fear that when Salim become emperor, they will be reduced to mere servants. Abul Fazl vows that Salim will never sit on the imperial throne. Rana Jayaram of Vindhyagarh wants peace, but his efforts to ensure it draw his kingdom into a very dangerous political game. His youngest son has rarely left the palace because of illness and spends his time reading ancient Sanskrit texts, drawing and composing poetry. His only friends are his brother's widow and his old tutor. Jayaram sees a chance to extract his kingdom from danger by an alliance with the influential Kachwahas. An alliance by the marriage of Prince Adinath to a Kachwaha princess would not only tie Vindhyagarh to a Rajput house more loyal to the empire but into the imperial family itself. But there is one other person Adinath calls a friend, even though they have barely met. Jali is a mysteriously beautiful young recruit to the reserve of the Vindhyagarh Guard. When Adinath is invited to attend the imperial court at the great red fort in Agra, an invitation that cannot be declined, it is Jali he asks to accompany him as his bodyguard. But there is great danger in Agra for Adinath. Jayaram has negotiated a secret treaty between Prince Salim and his father's greatest enemy, Maharana Amar of Mewar. Adinath held hostage in Agra would force his father to reveal the existence of the treaty, a treaty that would be seen as treason by the emperor and plunge the empire into civil war.",
  "genres": [
    "Historical Fiction",
    "Historical",
    "LGBT",
    "Romance",
    "M M Romance",
    "Fiction",
    "India"
  ],
  "author": "Mark  Andrew",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/25475830-jalendu"
}