{
  "title": "Summer's Last Breath",
  "description": "She’s only human and completely off-limits. He inhabits a world she can never be a part of.I've been crushing on Jamie for going on a year now. Last school year, as a freshman, my eyes lit up like moon pies every time I was lucky enough to get a glimpse of him in the hall or in the cafeteria. My heart would beat wildly when I’d see him pulling in or out of the parking lot in his aqua-blue Bronco. Jamie is and always will be forbidden fruit. All my friends gush and fan-girl over Harry Styles and Ian Somerhalder while my every fantasy is right here under my nose, so close I can smell him. And boy does he smell good. Like the sun and the ocean and a warm salty breeze. My friends are welcome to the latest CW bad-boy cast member, or the hottest boy band member. I want Jamie. Too bad I will never get him.This story is a prequel novel to The Waterborn SeriesExcerpt“How old are you?” The hard edge in his voice prompted me to look up at his face. Water spiked his dark hair, dripping over his cheeks and jaw. I lifted my chin. It would be so easy to let him intimidate me, knowing what I did about him. “Seventeen.” The lie slipped out too easily. Eighteen wouldn’t have worked because I was still a sophomore, and the truth—that I was sixteen—sounded too young, especially with Jamie towering over me even though he wasn’t even standing up. He blotted out the sun, the whole entire world, and I was content to let him. He lifted his hand to my face, his fingers lightly tracing my cheek where Donovan had elbowed me the previous day. His expression softened, his full lips turning slightly down. “Does it hurt?” “A little,” I confessed, drowning in the pools of his green eyes, so pale they were almost no color at all. He stared at me for a long time, as if he were mulling something over in his mind, and all the while his eyes searched my face. My skin shivered. My lips parted as my mind churned for some reasonable excuse as to why in the world I would be hiding here. What could I say that wouldn’t make me sound like a Navy groupie or worse, a stalker? The half-formed words stalled in my throat as his head descended toward me, and before I knew his intention his lips lightly touched my cheek, stunning me into utter stillness. Then his lips found mine and the reasonable voice in my head told me I should push him away, that he’d stepped way out of bounds, and I was about to do it—I was—when his tongue darted out and teased my lips. They opened all by themselves, my body way ahead of my brain, eager in its response. I kept my eyes open, not wanting to miss a single second. The weird thing was he didn’t close his eyes either, which made his kiss all the more potent. I’d been kissed before, but never like this, sweet and gentle with an undercurrent of the not so gentle, a complete possession of my mouth and my heart along with it. He lifted his head a fraction and we shared a breath before he drew away completely. He pushed to his feet, then stood over me again as I met his forceful gaze. “You know what I am.” It wasn’t spoken as a question, but a declaration. “Yes,” I said. Like I would care after that kiss.",
  "genres": [
    "Contemporary Romance"
  ],
  "author": "Kimberly   James",
  "average_rating": "4.26",
  "url": "https://www.goodreads.com/book/show/25479133-summer-s-last-breath"
}