{
  "title": "When I Was a Dynamiter! Or, How a Nice Catholic Boy Became a Merry Prankster, a Pornographer, and a Bridegroom Seven Times",
  "description": "Former beatnik, former member of novelist Ken Kesey’s famed Merry Band of Pranksters, retired journalist and one-time Executive Editor of Larry Flynt’s notorious Hustler Magazine, Lee Quarnstrom has jammed a lot of living into just one life! Now available, his memoir “WHEN I WAS A DYNAMITER, or How a Nice Catholic Boy Became a Merry Prankster, a Pornographer and a Bridegroom Seven Times,” is several fascinating, adventurous autobiographies packed into one.Quarnstrom left home when, he claims, he discovered that his mother was the world’s worst cook. Apparently seeking edible sustenance as well as excitement, he thumbed rides back and forth and up and down across the country – and Mexico – living and loving in some of the capitals of bohemia. His journalistic career started at age 19 when he covered the classic “Front Page” cops and robbers beats at the City News Bureau of Chicago. His stops as a post-Beat Generation, pre-Hippie beatnik included sojourns in San Francisco, Greenwich Village, Seattle, Mexico City and Kesey’s remote home in the Santa Cruz Mountains above the Bay Area.Writing about his peripatetic lifetime, Quarnstrom tells of rubbing shoulders and making friends with a wide spectrum of well-known writers and artists – such as Paul Krassner, founder and editor of The Realist, the late Gonzo journalist Hunter S. Thompson, poet Allen Ginsburg, death-and-dying spiritual counselor Stephen Levine, musicians such as Janis Joplin and the Grateful Dead’s Jerry Garcia, and Neal Cassady, hero of several Jack Kerouac novels and driver of “Further,” Kesey’s psychedelically painted old school bus.“WHEN I WAS A DYNAMITER” also recounts his ongoing sorrow since the 1982 fatal shooting of his 18-year-old son, Eric, near some of the San Francisco beatnik bars where Quarnstrom had hung out with other writers and artists and musicians.And, when he was 18, Quarnstrom did in fact work as a dynamiter – blowing up stumps and boulders – on a three-man crew building trails and bridges in remote parts of Olympic National Park in the state of Washington.Quarnstrom and his wife Christine, a poet, live with their pet Welsh corgis in southern California.",
  "genres": [],
  "author": "Lee Quarnstrom",
  "average_rating": "4.17",
  "url": "https://www.goodreads.com/book/show/25475798-when-i-was-a-dynamiter-or-how-a-nice-catholic-boy-became-a-merry-prank"
}