{
  "title": "Untouchable",
  "description": "One couple. One Romance. One Siri-ously Seductive Series. Sexy, Book One.... he speaks Italian. \"Giorno e notte sogno solo di te.\" Translation: Day and night I dream only of you.Chiseled, rock-hard, handsome with a beautiful smile and swoon-worthy eyes. He looks like a Golden God.Quiet, reserved, disciplined perfection with seductive skills that rival my own. When Mr. Sexy moves into 9G down the hall, everything changes. He haunts my dreams. Hopeful, but careful, I cautiously play my assets. Walking a fine line between teasing to turn him on and tempting him to go too far. But I must find out if he's my one. My soulmate. If you love strong, spirited women who aren't afraid to go all-in-for-the-win when they find their Mr. Sexy, and you fall hard for SAF badass heroes who cherish and protect their women, then you'll love this feel-good, happy, romantic, funny, page-turning, scorching hot romance.  IN FULL FRONTAL DISCLOSURE, Soulmates - Sexiness and Secrets is the love story between Siri Wright and Aurelius Moore. Told through ten individual books that take the reader on the journey of their romantic relationship from the moment they first lay eyes on each other to their happily ever after.  Soulmates - Sexiness and Secrets is a serial, sequel, saga, series (try saying that three times fast) told through a steady stream of consciousness and must be read in order. Some books end on cliff hangers. Some books end on unresolved issues. Plot points are introduced in one book and resolved in another, building to the climatic conclusion.  This romantic adventure is unlike anything you have read before. *The antics that will crack you up.*The dirty talk and sexy banter is fan-yourself, swoon-worthy.*The secrets shared are jaw-dropping.*The twists and turns will put you on the edge of your seat. *The lust and love are pure panty-melting passion.*And, you are guaranteed more than one happy-ending! ;) Soulmates - Sexiness and Secrets is \"a brilliant piece of writing magic.\" Five stars - Goodreads ReviewerDownload \"Sexy: Day and night I dream only of you\" TODAY and let Mr. SEXY begin your seduction.",
  "genres": [
    "Romance",
    "Erotica",
    "Contemporary Romance",
    "Contemporary",
    "Military Fiction",
    "Own",
    "Audiobook"
  ],
  "author": "Jessika Klide",
  "average_rating": "3.83",
  "url": "https://www.goodreads.com/book/show/25484857-untouchable"
}