{
  "title": "The Mage & the Magpie",
  "description": "An invisible girl. A missing mage. A world in need…  Brinley has spent most of her life lost in her own imagination, teaching bullfrogs to do gymnastics and pretending to be invisible. Now, when a magic bell from another world summons her across time and space on a journey to find her mother, she will discover real friendship, face true evil, and overcome her greatest fears in order to save the ones she loves.  The Mage and the Magpie is the first book in Austin J. Bailey's Magemother series: an epic middle-grade fantasy adventure series with witches, shapeshifters, and cliffhangers, and awesome kids (There are very few boring adults in this book!).   What Readers are Saying  Loved the world it took me into to. A good, clean, fun story that left me wanting more. Loved how developed the characters were for such a quick read. A great read for any age.-Melissa  A fresh story of good versus evil set in a fantasy world much like a marvelous daydream gone wild. A truly enjoyable and engaging read.-S.Rosenquist   Interview with the Author  Q - Why should I try your books?  A - Because the Magemother books are fast and fun, and I guarantee you'll never forget the friends you find inside them. Each of the books is a different experience, but each one is worth your time. And I'm not just saying that because I wrote them. I've also read a TON of Fantasy. If you like fun, kid-friendly books with lots of magic and a plot that twists and turns, you'll get a kick out of this series.  Q - So, what makes the Magemother series so special?  A - A few things. When I set out to write the Magemother series I wanted to write the types of books that I love to read. My top picks are usually fantasy books. I'm well into my 20's now and I still love reading the middle grade bestsellers. Especially ones with a good bit of mystery, a few surprises, and lots of laughs.  The Magemother books have a good mix of these things. They mostly focus on the children's fantasy / teen fantasy adventure genre's over all, with some coming of age and mystery aspects thrown in for good measure.  Overall the Magemother series is designed to invite you into another wonderful fantasy universe alongside a set of unforgettable characters.  Q - What order should I read the books in?  A - Well, if I did my job right you should be able to read them in any order you want right? Seriously though, fantasy worlds can get a bit complicated, so if you don't want to risk missing anything I would suggest this order:  - The Mage and the Magpie - The Empty Throne (Novella) - The Paradise Twin - The Bridge to Nowhere (coming soon)  Q - Which one was your favorite to write?  A - That's a tough one. The Empty Throne was fun because Tabitha is such a wonderfully strange and quirky character, and I really had a blast giving her her own adventure. That said, The Paradise Twin is my favorite so far. The characters really come alive in that book, especially Hugo, who has some serious demons to wrestle with. There is also some great plot twists and comedy in that one, if I do say so myself.   Magemother Middle Grade Fantasy Adventure Series eBook Categories:  -kids fantasy series free -teen fantasy series free -teen fantasy free -free teen fantasy books",
  "genres": [
    "Fantasy",
    "Middle Grade",
    "Young Adult",
    "Childrens",
    "Magic",
    "Fiction",
    "Adventure"
  ],
  "author": "Austin J. Bailey",
  "average_rating": "4.20",
  "url": "https://www.goodreads.com/book/show/25486421-the-mage-the-magpie"
}