{
  "title": "Hunted By Treaty",
  "description": "His touch unleashes her heritage. Hiding is no longer an option.\nAfter decades of war, the Qui Empress ushers in a new era when she takes a human tribute as her price for a peace treaty with Earth. She orders the surrender of all human prisoners of war.Butchered and broken, Raiss Tyrone has escaped his K’lahn captors and is running for his life. The arrival of a Qui warship in orbit sparks an intense man hunt. A K’lahn garrison is out in force, chasing him down. His only hope is a strange, insecure half-breed woman, part human, part K’lahn.Crendea has never come to terms with her shape shifting affliction, a genetic aberration from her K’lahn father. She lives with the shame, terrified of exploring the full extent of her heritage. Now a single look from Raiss Tyrone, lust in his eye, and her sparkling lizard scaling bursts forth. His delicious scent and warm touch ripples a terrifying change across her body, and neither of them are prepared for the genetic frenzy they are about to unleash.This sexy romance tale is the third story in a collection inspired by Under By Treaty, a science fiction romance in Kayla Stonor’s Surrender collection. Each tale in the Qui Treaty Collection is a standalone short story or novella set in the Qui galactic empire, with annihilation of mankind held at bay only through the Treaty consummated between the Qui Empress and the human consort abducted under its terms.Reader please note: Kayla Stonor’s stories can be dark and edgy, hot and wicked, punishing and uplifting. If you find certain themes uncomfortable reading, these stories may not be for you. Although this story is standalone, it is set within a wider story and it is recommended that the short stories are read in order.",
  "genres": [
    "Romance",
    "Erotica",
    "Aliens",
    "Space Opera",
    "Science Fiction",
    "Novella",
    "Science Fiction Romance"
  ],
  "author": "Kayla Stonor",
  "average_rating": "3.95",
  "url": "https://www.goodreads.com/book/show/25482428-hunted-by-treaty"
}