{
  "title": "Hugh Glass",
  "description": "A True Story--a white man, whose story was so powerful it became a tradition among the Indians of the American Plains...  BOOK EXCERPT:  By the time Hugh Glass reached Fort Tilton it was well into November. A foot of snow lay across the countryside. Fort Tilton was a small fort that belonged to the Columbia Fur Company. It had been built by William P. Tilton and boasted a garrison of only five men. As it sat near the site of another Mandan village, the Mandans who escorted Hugh dropped him off, then immediately went to visit their cousins. Hugh went to see Tilton, where he learned right away that any hopes of finding a boat to continue his journey were in vain.  “Mr. Glass,” Tilton told Hugh, “I’d like to help you but I can’t. I’ve got five men here, besides myself. I can’t spare any of them. We’re under danger of attack here night and day by the Arikaras. I need every man I have to keep them away. Even if I could spare anyone, I doubt they would go. We’re watched constantly. I had one man who left the fort for only a few minutes. From out of nowhere, that devil Stanapat rode up and killed him, practically on our doorstep. If you hadn’t had the Mandans escorting you, don’t think for a moment that you would have made it in here. Those damn Arikaras would have gotten you before you even came within sight of the fort.”  Disappointed, Hugh exhaled heavily.  “Stanapat,” he said ruefully. “—The Little Hawk With The Bloody Hand…”  Tilton looked at him.  “You speak Arikara?” he asked Hugh.  “Pawnee,” Hugh said absently. “The two languages are almost identical.”  Tilton continued to stare at him. Slowly, a look of dread came over his features.  “Oh no,” Tilton said. “Oh, Christ, I should have known by your scars—you’re the one the Indians call White Bear.”  Hugh gave him a puzzled look.  “How did you know?”  “Mister, you’re the talk of the plains. BIG medicine. Went one on one with a grizzly, left for dead by two white men and still managed to crawl to Fort Kiowa. The Arikaras have tried to kill you and can’t, that’s what they say. Oh, I know all about you. So does every tribe from here to the Rockies. As soon as Stanapat finds out you’re here—and he will—he’ll tear this place down to get to you. New travels real fast in these parts, mister, and the news here is that the Arikaras want you real bad!”  PRAISE FOR \"HUGH GLASS\" by Bruce Bradley--  \"--The kind of book you hate to put down!\" Fraser Whitbread - Muzzle Blasts Magazine   \"This recent book by Bruce Bradley is a great read and should be added to the library of those who have interest in the (Fur Trade) period or are an over-all student of early American History.\" - On the Trail Magazine  \"A very readable telling of an amazing story!\" —Bob Griffith-Amazon.com",
  "genres": [
    "History",
    "Nonfiction",
    "Survival",
    "Biography",
    "Adventure",
    "American History"
  ],
  "author": "Bruce Bradley",
  "average_rating": "4.39",
  "url": "https://www.goodreads.com/book/show/25489851-hugh-glass"
}