{
  "title": "The Massage Disadvantage: What Doctors Know About Making Money That Massage Therapists Don't",
  "description": "If you’re one of the many massage therapists who love your profession but continually struggle with finances, you need this book…Although massage therapy is a wonderful healing profession it tends to have a distinct disadvantage over other healthcare providers. Studies show that more than 50% of therapists must supplement their income by working at another job and many are forced to leave the profession entirely just a few short years after graduation! It’s a shocking statistic but it doesn’t have to be your destiny – there is a solution!The benefits of massage therapy are well-known, yet individual therapists often struggle to stay profitable simply because they lack the necessary business skills to maintain a thriving practice. The Massage (dis)Advantage introduces proven procedures used by thousands of chiropractors and medical doctors that will ensure a full schedule of clients who pay, return, and refer.In an organized and easy to follow, step-by-step format, The Massage (dis)Advantage shows you how to:•\tMaster the business procedures that doctors have used for decades to build busy profitable practices.•\tAttract and keep clients who pay, return, and refer.•\tEstablish yourself as an expert in your town.•\tEstablish referral networks with local chiropractors and medical doctors.•\tAvoid the most common practice-destroying mistakes.•\tOrganize special events and promotions that attract new clients.•\tPromote yourself and your clinic professionally at very low (or no) cost.•\tEducate your clients so they understand the need to return regularly.•\tAnd so much more…Whether you have years of experience, are a new student, or employ massage therapists, this concise and straight-forward system contains the practical advice you need to build your dream practice and stay profitable throughout your career. If you’re tired of struggling and are ready to make the income you deserve, this book is for you!",
  "genres": [],
  "author": "Matthew            Lewis",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/25488656-the-massage-disadvantage"
}