{
  "title": "The Firebrand and the First Lady: Portrait of a Friendship: Pauli Murray, Eleanor Roosevelt, and the Struggle for Social Justice",
  "description": "A groundbreaking book—two decades in the works—that tells the story of how a brilliant writer-turned-activist, granddaughter of a mulatto slave, and the first lady of the United States, whose ancestry gave her membership in the Daughters of the American Revolution, forged an enduring friendship that changed each of their lives and helped to alter the course of race and racism in America.Pauli Murray first saw Eleanor Roosevelt in 1933, at the height of the Depression, at a government-sponsored, two-hundred-acre camp for unemployed women where Murray was living, something the first lady had pushed her husband to set up in her effort to do what she could for working women and the poor. The first lady appeared one day unannounced, behind the wheel of her car, her secretary and a Secret Service agent her passengers. To Murray, then aged twenty-three, Roosevelt’s self-assurance was a symbol of women’s independence, a symbol that endured throughout Murray’s life.Five years later, Pauli Murray, a twenty-eight-year-old aspiring writer, wrote a letter to Franklin and Eleanor Roosevelt protesting racial segregation in the South. The president’s staff forwarded Murray’s letter to the federal Office of Education. The first lady wrote back.Murray’s letter was prompted by a speech the president had given at the University of North Carolina, Chapel Hill, praising the school for its commitment to social progress. Pauli Murray had been denied admission to the Chapel Hill graduate school because of her race.She wrote in her letter of 1938: Does it mean that Negro students in the South will be allowed to sit down with white students and study a problem which is fundamental and mutual to both groups? Does it mean that the University of North Carolina is ready to open its doors to Negro students . . . ? Or does it mean, that everything you said has no meaning for us as Negroes, that again we are to be set aside and passed over . . . ?Eleanor Roosevelt wrote to Murray: I have read the copy of the letter you sent me and I understand perfectly, but great changes come slowly . . . The South is changing, but don’t push too fast. So began a friendship between Pauli Murray (poet, intellectual rebel, principal strategist in the fight to preserve Title VII of the 1964 Civil Rights Act, cofounder of the National Organization for Women, and the first African American female Episcopal priest) and Eleanor Roosevelt (first lady of the United States, later first chair of the United Nations Commission on Human Rights, and chair of the President’s Commission on the Status of Women) that would last for a quarter of a century.Drawing on letters, journals, diaries, published and unpublished manuscripts, and interviews, Patricia Bell-Scott gives us the first close-up portrait of this evolving friendship and how it was sustained over time, what each gave to the other, and how their friendship changed the cause of American social justice.",
  "genres": [
    "History",
    "Nonfiction",
    "Biography",
    "Politics",
    "Social Justice",
    "Womens",
    "Feminism"
  ],
  "author": "Patricia Bell-Scott",
  "average_rating": "4.26",
  "url": "https://www.goodreads.com/book/show/25489049-the-firebrand-and-the-first-lady"
}