{
  "title": "The Life and the Adventures of a Haunted Convict",
  "description": "The earliest known prison memoir by an African American writer—recently discovered and authenticated by a team of Yale scholars—sheds light on the longstanding connection between race and incarceration in America. In 2009, scholars at Yale University came across a startling manuscript: the memoir of Austin Reed, a free black man born in the 1820s who spent most of his early life ricocheting between forced labor in prison and forced labor as an indentured servant. Lost for more than one hundred and fifty years, the handwritten document is the first known prison memoir written by an African American. Corroborated by prison records and other documentary sources, Reed’s text gives a gripping first-person account of an antebellum Northern life lived outside slavery that nonetheless bore, in its day-to-day details, unsettling resemblances to that very institution. Now, for the first time, we can hear Austin Reed’s story as he meant to tell it. He was born to a middle-class black family in the boomtown of Rochester, New York, but when his father died, his mother struggled to make ends meet. Still a child, Reed was placed as an indentured servant to a nearby family of white farmers near Rochester. He was caught attempting to set fire to a building and sentenced to ten years at Manhattan’s brutal House of Refuge, an early juvenile reformatory that would soon become known for beatings and forced labor. Seven years later, Reed found himself at New York’s infamous Auburn State Prison. It was there that he finished writing this memoir, which explores America’s first reformatory and first industrial prison from an inmate’s point of view, recalling the great cruelties and kindnesses he experienced in those places and excavating patterns of racial segregation, exploitation, and bondage that extended beyond the boundaries of the slaveholding South, into free New York. Accompanied by fascinating historical documents (including a series of poignant letters written by Reed near the end of his life), The Life and the Adventures of a Haunted Convict is a work of uncommon beauty that tells a story of nineteenth-century racism, violence, labor, and captivity in a proud, defiant voice. Reed’s memoir illuminates his own life and times—as well as ours today.",
  "genres": [
    "Nonfiction",
    "History",
    "Race",
    "Memoir",
    "Autobiography",
    "School",
    "American History"
  ],
  "author": "Austin  Reed",
  "average_rating": "3.65",
  "url": "https://www.goodreads.com/book/show/25489093-the-life-and-the-adventures-of-a-haunted-convict"
}