{
  "title": "Autobiography of Mark Twain, Volume 3: The Complete and Authoritative Edition (Volume 12)",
  "description": "The surprising final chapter of a great American life.When the first volume of Mark Twain’s uncensored Autobiography was published in 2010, it was hailed as an essential addition to the shelf of his works and a crucial document for our understanding of the great humorist’s life and times. This third and final volume crowns and completes his life’s work. Like its companion volumes, it chronicles Twain's inner and outer life through a series of daily dictations that go wherever his fancy leads.Created from March 1907 to December 1909, these dictations present Mark Twain at the end of his receiving an honorary degree from Oxford University; railing against Theodore Roosevelt; founding numerous clubs; incredulous at an exhibition of the Holy Grail; credulous about the authorship of Shakespeare’s plays; relaxing in Bermuda; observing (and investing in) new technologies. The Autobiography ’s “Closing Words” movingly commemorate his daughter Jean, who died on Christmas Eve 1909. Also included in this volume is the previously unpublished “Ashcroft-Lyon Manuscript,” Mark Twain’s caustic indictment of his “putrescent pair” of secretaries and the havoc that erupted in his house during their residency.Fitfully published in fragments at intervals throughout the twentieth century, Autobiography of Mark Twain has now been critically reconstructed and made available as it was intended to be read. Fully annotated by the editors of the Mark Twain Project, the complete Autobiography emerges as a landmark publication in American literature. Benjamin Griffin and Harriet Elinor SmithAssociate Victor Fischer, Michael B. Frank, Amanda Gagel, Sharon K. Goetz, Leslie Diane Myrick, Christopher M. Ohge",
  "genres": [
    "Biography",
    "Autobiography",
    "Nonfiction",
    "History",
    "Memoir",
    "American History",
    "Biography Memoir"
  ],
  "author": "Mark Twain",
  "average_rating": "4.34",
  "url": "https://www.goodreads.com/book/show/25494458-autobiography-of-mark-twain-volume-3"
}