{
  "title": "Three Feet From Gold",
  "description": "This remarkable business allegory tells a fascinating story in presenting the key principles of Napoleon Hill’s revolutionary bestseller Think and Grow Rich. While you follow a struggling young entrepreneur through a life-changing series of encounters with some of today’s foremost business leaders and inspirational figures, you’ll find encouragement and motivation to believe in yourself, discover your own Personal Success Equation™, and to never give up. You are just three feet from gold!A century ago Napoleon Hill began the research that ultimately resulted in his extraordinary bestseller Think and Grow Rich. Since its publication in 1937, with more than 100 million copies sold worldwide, the book has inspired generations of men and women to turn their dreams into reality with its wise and effective principles of self-motivation, leadership, service, and achievement culled from Hill’s interviews with visionaries of his day. Now, a hundred years later, in Three Feet from Gold, a young entrepreneur whose life is falling apart finds himself retracing Hill’s steps after a serendipitous encounter with a powerful businessman who sees the young man’s potential and sets him on a challenging journey of personal, spiritual, and financial growth.Sharon L. Lechter—co-author of the #1 New York Times best-seller Rich Dad Poor Dad—and Greg S. Reid— a successful author, and in-demand motivational speaker—have given us more than the story of one man’s dogged pursuit of success. They deliver an effective equation for accomplishing goals that calls for combining passion and talent, taking action with the right association, and above all else, having faith that you are on the right path.",
  "genres": [
    "Business",
    "Personal Development",
    "Self Help",
    "Nonfiction",
    "Money",
    "Finance",
    "Inspirational"
  ],
  "author": "Greg S. Reid Sharon L. Lechter",
  "average_rating": "4.34",
  "url": "https://www.goodreads.com/book/show/25496954-three-feet-from-gold"
}