{
  "title": "Blood and Honor: The Foreworld Saga Graphic Novels",
  "description": "Collected for the first time: three exciting alternate history graphic novel adventures exploring fantasy, magic, and martial arts in The Foreworld Saga! Including:Suffrajitsu: Mrs. Pankhurst’s Amazons #1–3:London, 1914: The leaders of the radical women’s rights movement are fugitives from the law. Their last line of defense is the secret society of “Amazons”: women trained in the martial art of bartitsu and sworn to defend their leaders from arrest and assault.After a series of daring escapes and battles with the police, the stakes rise dramatically when the Amazons are forced into a deadly game of cat and mouse against an aristocratic, utopian cult.…The Dead God #1–3:In the year 536 AD, the land of Frisia is a hostile place of swords and sorcery. Across the dark, cold countryside, three valiant warriors quest for a treasure, the likes of which few can comprehend. These three—the mighty grappler, Eadhild; the skilled archer, Coll; and the charming young Valens—are searching for the head of Yvrnn, the sky-god. For, according to legend, the head of Yvrnn will grant its possessors great wisdom and fortune.The trio’s quest won’t be easy, as they must not only contend with Yvrnn’s followers who have set obstacles in their paths, but also the mystical creatures and bandits that haunt the roads of Frisia.Symposium #1–3:The Shield-Brethren is a secret martial order that has defended the West for centuries. Now, the origins of the order are revealed in this stunning three-issue tale.Our heroes, seeking to realize the idea offered to them by the philosopher Plato, leave Athens and travel to Delphi with hope of visiting the oracle. They have a dream to found a city of their own, and they desire insight from the oracle as to their question. But their skills—both as warriors and as thinking men—will be tested by adversaries they do not even know they have.",
  "genres": [
    "Comics",
    "Graphic Novels",
    "Fantasy",
    "Historical",
    "Alternate History",
    "Historical Fiction"
  ],
  "author": "Tony    Wolf",
  "average_rating": "3.12",
  "url": "https://www.goodreads.com/book/show/25496997-blood-and-honor"
}