{
  "title": "Mythean Arcana Boxed Set",
  "description": "Like hot paranormal romance? Dive into the Mythean Arcana, a world where all myths are true. Immortal warriors, witches, gods, and reincarnates all fight for love--and sometimes their lives--in this adventurous series set in Scotland.  \"Linsey Hall's brilliantly imaginative Mythean Arcana is THE must-read series of the year for fans of paranormal romance.\" - Maggie Shayne, NY Times Bestselling Author of TWILIGHT GUARDIANS  Braving Fate Bookish academic Diana Laughton has been having terrible, realistic dreams. When demons invade her quiet life and she flees to Scotland, she wonders if she's going mad. Or if perhaps she's remembering a past life she had no idea existed... Mythean Guardian Cadan Trinovante loved and betrayed Britain's warrior queen Boudica two millennia ago. Now he's tasked with protecting mortals whose lives affect the fate of humanity. His latest assignment is Boudica herself, reincarnated as a woman with no idea of her past or her fated future. Thrown together in a shadowy world that exists alongside our own, Diana and Cadan must fight not only the demonic forces that want Diana dead, but a past and a passion that have lasted centuries.  Soulceress Three hundred years ago, Warren sold his soul in exchange for the safety of his people. He lives immortal and inhuman, a life in the shadows, hiding his secrets. Until now, when he finally has the chance to reclaim his soul after three centuries of suffering… Esha is a soulceress, an immortal who drains the magical powers of others. Shunned by everyone she meets, she’s a rogue mercenary who hunts evil for a living. The only man she cannot harm is Warren, whose secrets intrigue her and whose body sparks her desire… Esha is the only person who can help Warren reclaim his soul. But what begins as a simple quest soon becomes a deadly battle, one in which choices will be made and secrets revealed that could tear them apart. As Esha and Warren uncover their passion, they must defeat the evil forces unleashed against them before time runs out…  Rogue Soul Andrasta, Celtic goddess of victory, has fled the cold, sterile wasteland of Otherworld for the steamy South American jungle. It's only a matter of time before the vengeful gods catch and punish her - unless she can convince the man she betrayed two thousand years ago to help… Born in Otherworld to the life of a god, Camulos went rogue centuries ago. He's living on the banks of the Amazon, boxing in bare-knuckled fights. The gods believe he's dead--until Ana finds him. Ana, the woman who gave him nothing but trouble, and the woman he could never forget… Thrown together, Ana and Cam must evade the wrath of the gods and a return to the living death of Otherworld. But as they flee through the jungle - and as their passion ignites - they find themselves at the heart of an ancient secret. One that could kill them both and extinguish their souls forever...  Stolen Fate Fiona is an Acquirer, an immortal who uses magic to hunt for ancient artifacts. Ever since she failed to live up to her fate and find the Book of Worlds, she’s been slowly losing her mind as her subconscious keeps trying to accomplish her fated task. When she’s presented with one last chance to find the Book and save her sanity, she’ll stop at nothing to accomplish her goal. For more than one hundred years, Ian has been locked in a nightmarish prison.",
  "genres": [
    "Paranormal",
    "Romance",
    "Paranormal Romance",
    "Fantasy",
    "Anthologies",
    "Amazon",
    "Gods"
  ],
  "author": "Linsey Hall",
  "average_rating": "4.27",
  "url": "https://www.goodreads.com/book/show/25496653-mythean-arcana-boxed-set"
}