{
  "title": "The Expert Sword-Man's Companion, 1728",
  "description": "\"Thanks be to GOD, my En'mies I don't Fear;Who was so oft embroil'd in Bloody Wars,Indent as 'twere and Carry'd with Cuts and Scars;Which Fortune seem'd to favour and o'er look,That I might serve you with this Little Book.\"A story so incredible, it was believed to be historical fiction. Donald McBane is a figure from history much loved by those who have had the joy of studying his autobiography. Growing up in Inverness and later joining the British regiments, McBane travelled across Europe pimping, duelling, blowing himself up, and performing other incredible feats of a not always admirable nature. The last we hear of him is when he comes out of his retirement in his fifties to fight one last bout in Edinburgh against an uppity Irish youngster, where he defeated his opponent and walked off with barely a scratch himself. Yet for all his heroic and sometimes crazy actions, he is remembered only for a single act of cowardice on maps marked as the \"Soldier's Leap\". This is a highly accurate reproduction of McBane's original work from 1728, created by the historian Ben Kerr. It features reproductions of all the original image plates as well as a full and accurate transcription of McBane's original text including his teaching on self-defence, an account of his life and adventures and the art of gunnerie. Ben Kerr is one of the senior instructors for the Academy of Historical Arts. He is a professional historian with a specialisation in the Scottish martial traditions and battlefield arts. Along with his study of HEMA, Ben is an experienced heritage craftsman and his work has been featured in Glasgow's Burrell Collection. He has been a member of HEMAC since 2012. Ben is the creator of the facsimiles for The Art of Defence on Foot, 1798 and The Guards and Lessons of the Highland Broadsword, 1799.",
  "genres": [
    "History"
  ],
  "author": "Donald McBane",
  "average_rating": "4.17",
  "url": "https://www.goodreads.com/book/show/25493772-the-expert-sword-man-s-companion-1728"
}