{
  "title": "His Brazen Sub",
  "description": "This edition is no longer available.This is a stand alone, full-length novel. However, to enrich your experience it is recommended that you read the Club Alpha Cove series in order  Zane Wolf could not believe his eyes. Eight months ago, the only sub he had ever wanted simply vanished – now she stood before him. This time he would keep her close and ensure that she would not disappear again.  Jade was shocked, but overjoyed when she bumped into the Dom, who she had previously known only as ‘Sir’. Her inability to forget the commanding Master, who had rocked her world eight months earlier, had ruined her. It would never be possible to find another Dom who could give her what this man had awakened in her.  The intense attraction between them was as electric as ever and Jade blossomed under his whip and flogger. She was helpless against his expert molding of her body’s response to his command, and Zane took full control of her. His sensual torment and her brazen ways swept everyone in their path into their love affair.  When Jade’s haunting past threatens to destroy their relationship, Zane must decide between defeat and keeping the woman he loves. In the midst of the trouble, the Syndicate once again rears its ugly head and threatens to deal them a blow from which they may never recover.  Note: This book is meant for mature readers and contains explicit sexual situations, graphic language, and material that some readers may find objectionable: Anal play, oral, bondage, whipping, some masochism, sadism with BDSM theme and elements. Please read the warning inside and do not purchase the book if such content offend you.  What have your other Club Alpha Cove favorites been up to? Other titles in the Club Alpha Cove Series: His FBI Sub (Club Alpha Cove Book 1) His Ice Baby Sub (Club Alpha Cove Book 2) His Vanilla Sub (Club Alpha Cove Book 3) His Fiery Sub (Club Alpha Cove Book 4) His Sassy Sub (Club Alpha Cove Book 5) Their Bold Sub (Club Alpha Cove Book 6)",
  "genres": [
    "BDSM"
  ],
  "author": "Linzi Basset",
  "average_rating": "4.54",
  "url": "https://www.goodreads.com/book/show/25494922-his-brazen-sub"
}