{
  "title": "Cowgirls Rock",
  "description": "Warning: this book contains humor, sex, cussin’, and enough sarcasm to choke a horse. *** Saddle up your cowpony and come ride along with our plucky heroes. It's after the apocalypse. Humanity gets a do-over on a pristine planet. Annie, her cowboy compadres and the new Amish settlers are exploring parts unknown. They have part of an old map & a lot of spunk. The cowboys & Injins are hot & sexy. Michael has a new friend. For our cover model, it's a dog's life. Warning: this book contains humor, sex, cuss words, and enough sarcasm to choke a horse. This is Spirit Animal series book three, featuring Annie Talks To Horses. Readers of Craig Johnson, Tony Hillerman, Dick Francis, Michael Crichton, Robert B. Parker, Ace Atkins, Robert Knott, Michael Bunker, Janet Evanovich should like this book. *** Barbara Neville's Spirit Animal series is not what you would expect. It’s all about Cowboys and Injins. It’s told by a tough cowgirl. It takes place in the twenty-sixth century. It may be the future, but our cowboys ride horses. You see, five hundred years ago were the Troubles. Earth was blown to smithereens. The lucky people got out just before. Pioneered new planets. War moved out into space. Things got blown back to primitive. Humankind clawed their way back out, ruled by the Federals. Progress made them nervous, so the Feds passed a law declaring all the newly explored planets as wilderness. No internal combustion engines or electronics are allowed beyond the spaceport on planet Rock. The law is meant to save mankind from itself. The problem? Outlaws are beyond the law. *** Rustic western visionary Barbara Neville takes us on another humorous action-packed adventure into the cowboy future. This Native American thriller features a strong woman protagonist and a little help from man's best friend. This is book three of the Spirit Animal series.",
  "genres": [],
  "author": "Barbara Neville",
  "average_rating": "4.60",
  "url": "https://www.goodreads.com/book/show/25505039-cowgirls-rock"
}