{
  "title": "Claiming His Fire",
  "description": "A shifter with a secret that could destroy his world...A witch without a coven to keep her grounded...A fated destiny they'll have to fight to begin. Book five in the Feral Breed Motorcycle Club seriesShadow of the Feral Breed earned his road name by being a sneaky combatant--quite fitting considering he's been hiding the truth about his heritage for decades. With his life wrapped in secrets and lies to protect himself from the judgment of other shifters, he's become a master at keeping people at a distance. He's got a job to do, one that could potentially save the lives of the missing Omega females, and he refuses to let a little thing like honesty get in his way. Fire witch Scarlett left her coven voluntarily after her sister's banishment, but she can't get over the pain of being shunned by the people she saw as her extended family. She keeps her relationships casual, avoiding any real commitment on the chance others may let her down again. But with her powers out of control and her element burning her from the inside out, she's on a path that can only end in ash. After a chance meeting leads to a fiery clash, Shadow and Scarlett work hard to break themselves apart as the thread of destiny pulls them closer together. But secrets and lies aren't a stable foundation for a relationship, and the walls between them are easier to build higher than to tear down. When the truth comes out and the smoke clears, will their fragile connection be burnt through or tempered by the heat? And can their fated bond survive the war brewing in their world?Full-length novel with adult content featuring a wolf shifter with a secret, a stubborn fire witch with a history of loss, and a slow simmering romance leading the two to war.",
  "genres": [
    "Paranormal Romance",
    "Shapeshifters",
    "Paranormal",
    "Romance",
    "Werewolves",
    "Witches"
  ],
  "author": "Ellis Leigh",
  "average_rating": "4.36",
  "url": "https://www.goodreads.com/book/show/25500895-claiming-his-fire"
}