{
  "title": "The Long Roll",
  "description": "Before Gone with the Wind exploded into print, Mary Johnston's The Long Roll was one of the definitive novels about the Civil War. Johnston peels away some of the historical romance of the cavalry and shows how vital artillery was in the battles, while paying close attention to the importance of planning and patience, and the role of roads, rail, horse,and boat, mixing all of these elements with descriptions of raw courage and reckless abandon. \"The two rode on. To left and right were lighted streets of tents, visited here and there by substantial cabins. Soldiers were everywhere, dimly seen within the tents where the door-flap was fastened back, about the camp-fires in open places, clustering like bees in the small squares, everywhere apparent in the foreground and divined in the distance. From somewhere came the strains of 'Yankee Doodle.' A gust of wind blew out the folds of the stars and stripes, fastened above some regimental headquarters. The city of tents and of frame structures hasty and crude, of fires in open places, of Butlers' shops and canteens and booths of strolling players, of chapels and hospitals, of fluttering flags and wandering music, of restless blue soldiers, oscillating like motes in some searchlight of the giants, persisted for a long distance. At last it died away; there came a quiet field or two, then the old Maryland town of Frederick.\"from The Long Roll Before Gone with the Wind exploded into print, Mary Johnston's The Long Roll was one of the definitive novels about the Civil War. Unlike Mitchell's novel of Southern aristocracy, however, Johnston sets her tale among the fighting armies. The Long Roll begins with secession and ends with the funeral of Stonewall Jackson. Our protagonists are Richard Cleave of Virginia, and General Jackson himself, who begins the novel as a major. Cleaves' action in the Confederate artillery alternates with Jackson's cavalry maneuvers to show a wide range of battle experience and combat effectiveness. Johnston peels away some of the historical romance of the cavalry and shows how vital artillery was in the battles. No less significant, she pays close attention to the importance of planning and patience, and the role of roads, rail, horse, and boat, mixing all of these elements with descriptions of raw courage and reckless abandon. As the narrative follows Cleave and Jackson, we are led through the most decisive engagements in the years of Confederate Manassas, The Seven Days, Fredericksburg, Malvern Hill, and Sharpsburg. The Long Roll brings alive the differing motives for secession and war, and eerily evokes the suspicion and battered consciences of both North and South.",
  "genres": [
    "Historical Fiction",
    "Classics",
    "Fiction",
    "Civil War",
    "Southern",
    "Historical",
    "American Civil War"
  ],
  "author": "Mary    Johnston",
  "average_rating": "3.87",
  "url": "https://www.goodreads.com/book/show/1156922.The_Long_Roll"
}