{
  "title": "The Apollo 1 Disaster: The Controversial History and Legacy of the Fire that Caused One of NASA’s Greatest Tragedies",
  "description": "*Includes pictures*Explains the design of the Apollo program and investigations into what went wrong*Includes online resources and a bibliography for further reading*Includes a table of contents“There's always a possibility that you can have a catastrophic failure, of course; this can happen on any flight; it can happen on the last one as well as the first one. So, you just plan as best you can to take care of all these eventualities, and you get a well-trained crew and you go fly.” - Gus Grissom, December 1966The Apollo space program is the most famous and celebrated in American history, but the first successful landing of men on the Moon during Apollo 11 had complicated roots dating back over a decade, and it also involved one of NASA’s most infamous tragedies. Landing on the Moon presented an ideal goal all on its own, but the government’s urgency in designing the Apollo program was actually brought about by the Soviet Union, which spent much of the 1950s leaving the United States in its dust (and rocket fuel). In 1957, at a time when people were concerned about communism and nuclear war, many Americans were dismayed by news that the Soviet Union was successfully launching satellites into orbit. Among those concerned was President Dwight D. Eisenhower, whose space program was clearly lagging a few years behind the Soviets’ space program. From 1959-1963, the United States worked toward putting satellites and humans into orbit via the Mercury program, but Eisenhower’s administration was already designing plans for the Apollo program by 1960, a year before the first Russian orbited the Earth and two years before John Glenn became the first American to orbit the Earth. On May 25, 1961, President John F. Kennedy addressed Congress and asked the nation to “commit itself to achieving the goal, before this decade is out, of landing a man on the Moon and returning him safely to the Earth.” Given America’s inability to even put a man in orbit yet, this seemed like an overly ambitious goal, and it isn’t even clear that Kennedy himself believed it possible; after all, he was reluctant to meet NASA Administrator James E. Webb’s initial funding requests.As Apollo 11’s name suggests, there were actually a number of Apollo missions that came before, many of which included testing the rockets and different orbital and lunar modules in orbit. In fact, it wasn’t until Apollo 8 that a manned vehicle was sent towards the Moon and back, and before that mission, the most famous Apollo mission was Apollo 1, albeit for all the wrong reasons. There were no delusions regarding the dangers of manned space travel, but they were brought home on January 27, 1967, when all three astronauts were killed by a fire that ignited in the cabin during a launch rehearsal. To this day, there is still debate over what ignited the fire, but the disaster made clear that the modules being used by NASA had a series of fatal flaws. After the Apollo 1 tragedy, NASA changed its plans by first running a series of unmanned missions to test the Saturn rockets and the different modules throughout 1967 and early 1968. and it would not be until Apollo 7 launched about 20 months after the disaster that NASA dared to conduct another manned mission. The Apollo 1 The History and Legacy of the Controversial Fire analyzes the conception of the Apollo program and the events that brought about the fateful disaster. Along with pictures of important people, places, and events, you will learn about Apollo 1 like never before, in no time at all.",
  "genres": [
    "History",
    "Nonfiction"
  ],
  "author": "Charles River Editors",
  "average_rating": "3.71",
  "url": "https://www.goodreads.com/book/show/25503785-the-apollo-1-disaster"
}