{
  "title": "Emotional Healing After Being Cheated On",
  "description": "Bertram “Hersh” Alexander delivers another timely guide from his Questions From the Heart Series. Emotional Healing is a follow up to You Cheated (Now Fix It). This volume captures the heartrending, emotionally-charged collapse that occurs when someone discovers their greatest trust has been discarded. The phase following such a calamity, and how you handle it, will determine your psychological health and ultimately your future.The author speaks directly to the offended party, drawing from the mistakes of others to capture the do’s and don’ts of post cheating behaviors. At first, the hurt and anguish will seem unbearable, driving your self-esteem and confidence to all new lows. A sense of worthlessness will temp you back into the arms of the ‘cheater’, before you have a chance to heal and understand. Stop! Take the time, and follow the steps outlined in this guide to heal your heart, before you attempt to heal a rocky relationship.Can, or should you forgive? A truly difficult decision, but one that should be made after your head’s on straight and you’ve worked through some issues. However, revenge is never the answer. It will merely lead to further bitterness and heartache. Learn to cleanse your mind, to laugh, and to trust again. Don’t accept unnecessary blame for circumstances that are out of your control, and when needed, seek counseling.Patience will be your ally in this battle to regain your life, and if you decide to salvage your relationship, it will be a must to reassemble the shattered pieces in an attempt to make it whole. A caution about depression: watch for the signs and pursue avenues of help rather than trying to cope alone.Accept, heal, and move on to a renewed life of love and support. Buy this book to take the first step on the road to recovery.",
  "genres": [],
  "author": "Bertram \"Hersh\" Alexander",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/25508473-emotional-healing-after-being-cheated-on"
}