{
  "title": "The Antarctic Book of Cooking and Cleaning: A Polar Journey",
  "description": "A visually captivating, novelistic travelogue that chronicles the first civilian environmental cleanup expedition in Antarctica—an engaging true story told through anecdotes, journal entries, vignettes, recipes, and archival and contemporary photography.“The first thing that comes to mind about Antarctica is not likely the food. But if you are going there, it is the second.” —Wendy Trusler and Carol DevineThe Antarctic Book of Cooking and Cleaning is a unique journey through an austral summer, when a group of dedicated individuals—fifty-four people from five countries—picked up nearly three decades’ worth of garbage during a three-month period in Antarctica.In this visually captivating polar journal, Wendy Trusler and Carol Devine transport readers back twenty years and thousands of miles to Bellinghausen, the Russian research station that became their temporary home. Devine, a humanitarian who piloted the project, and Trusler, a visual artist and cook, use journal entries, letters, provision lists, recipes, and menus to document their voyage. They share pithy, insightful observations on life, food, science, politics, and the environment. Showcased throughout are modern and vintage photos and vignettes from Antarctica’s short history—all of which add delightful color and warm detail to this unique book.Trusler reveals the challenges of cooking in a makeshift kitchen during long, white nights at the bottom of the world. While the dozens of eco-tourists strive to help preserve the continent, she must figure out how to cook for all of them in the small camp kitchen, using limited ingredients. The Antarctic Book of Cooking and Cleaning includes forty-two eclectic, tasty, and hearty recipes tinged with Russian, Chinese, and South American influences, such as Honey Oatmeal Bread, Cheese Fondue, Great Wall Dumplings, Roasted Pepper Goulash with Smoked Paprika, Roast Leg of Pork, and Frozen Chocolate Cream. All beautifully photographed, these dishes reflect the expedition’s colorful cultural fabric and the astonishing raw beauty of their surroundings—a continent uniquely devoted to peace, cooperation, and science.",
  "genres": [
    "Nonfiction",
    "Food",
    "Cookbooks",
    "Cooking",
    "Travel",
    "Nature",
    "Memoir"
  ],
  "author": "Wendy Trusler",
  "average_rating": "4.01",
  "url": "https://www.goodreads.com/book/show/25515457-the-antarctic-book-of-cooking-and-cleaning"
}