{
  "title": "The Heaven Shop",
  "description": "There is a lion in our village, and it is carrying away our children.At her father's funeral, Binti's grandmother utters the words that no one in Malawi wants to hear. Binti's father and her mother before him, dies of AIDS. Binti, her sister, and brother are separated and sent to the home of relatives who can barely tolerate their presence. Ostracized by their extended family, the orphans are treated like the lowest servants. With her brother far away and her sister wallowing in her own sorrow, Binti can hardly contain her rage. She, Binti Phirim, was once a child star of a popular radio program. Now she is scraping to survive. Binti always believed she was special, now she is nothing but a common AIDS orphan.  Binti Phiri is not about to give up. Even as she clings to hope that her former life will be restored, she must face a greater challenge. If she and her brother and sister are to reunited, Binti Phiri will have to look outside herself and find a new way to be special.  Compelling and uplifting, The Heaven Shop, is a contemporary novel that puts a very real face on the African AIDS pandemic, which to-date has orphaned more than 11 million African children. Inspired by a young radio performer the author met during her research visit to Malawi, Binti Phiri is a compelling character that readers will never forget. \nAwards and Nominations:   Ontario Library Association's Golden Oak Award winner 2006   Winner of the 2005 Jane Addams Children's Book Award in the category of Honor Books for Older Children   Shortlisted for the 2006 Alberta Children's Choice Book Award   A Manitoba Young Readers' Choice Awards Honour Book for 2006   Foreword Magazine 2004 Book of the Year Award finalist   A Children's Africana Book Awards (CABA) 2005 Honor Book for Older Readers   A Canadian Children's Book Centre Our Choice 2005   Ruth & Sylvia Schwartz Children's Book Award for Young Adult/Middle Reader Books finalist",
  "genres": [
    "Fiction",
    "Africa",
    "Young Adult",
    "Malawi",
    "Historical Fiction",
    "Childrens",
    "Contemporary"
  ],
  "author": "Deborah Ellis",
  "average_rating": "3.88",
  "url": "https://www.goodreads.com/book/show/2550894.The_Heaven_Shop"
}