{
  "title": "Music Matters: A New Philosophy of Music Education",
  "description": "There is a mystery about music. On one hand, music making and music listening have occupied a prominent place in every culture since the dawn of recorded history and people everywhere continue to engage in a variety of musical experiences as part of their daily lives. Yet questions about thenature and value of music and its importance as a subject of education remain perplexing to many thinkers and are still hotly debated, even today. As a result, while music has been part of the school curriculum since antiquity, its profound contribution to general education has never beenharnessed--until now.What is music? Does music deserve a place in general education? If so, why? Music Matters builds new answers to these basic questions through a wide-ranging examination of music as a diverse human practice. The result is a ground-breaking philosophy of music education that provides criticallyreasoned perspectives on the nature and significance of performing, listening, musicianship, multiculturalism, creativity, consciousness, curriculum development, and more. Indeed, Music Matters is exceptional for the attention it pays to many aspects of music and education that previous musiceducation doctrine either misses or ignores altogether. Following an incisive critique of past thinking, this important text develops a multidimensional concept of music that explains why music making and listening are unique forms of thinking and unique sources of the most important kinds ofknowing that human beings can gain. In a richly detailed narrative that examines a wealth of recent philosophical and psychological research, the author constructs a compelling philosophical foundation that allows teachers to affirm to themselves and others that music deserves a central place in theeducation of all people. Among the many working ideas of this new philosophy is a distinctive concept of \"curriculum-as-practicum\" that explains how music educators can fulfill their educational mandate.Invaluable as a core text for courses on foundations of music education or philosophy of music education at both the undergraduate and graduate level, Music Matters provides educators with critically reasoned perspectives on the \"why, what, and how\" of music teaching and learning, arguingconvincingly that music is one of the most vital, dynamic, and practical pursuits in the human repertoire and, therefore, fundamental to the full development of the individual and collective self.",
  "genres": [
    "Music",
    "Nonfiction",
    "Teaching",
    "Education"
  ],
  "author": "David J. Elliott",
  "average_rating": "3.75",
  "url": "https://www.goodreads.com/book/show/255084.Music_Matters"
}