{
  "title": "The Warming: Speculative Fiction about the Human Impact of the Climate Crisis",
  "description": "How will the developing climate crisis affect us? The Warming goes beyond mere statistics and arguments over the cause to imagine its impact on people worldwide.It’s 2047. Hundreds of millions around the world are suffering from the warming—drought, rising ocean levels and increasingly calamitous weather.Famine and food riots are becoming more commonplace. Refugees from inundated coastal and drought-stricken areas are on the move. National economies are tanking. Weaker nations are being swallowed up by stronger neighbors. Within countries, The Warming encourages genocide and ethnic cleansing. Nations are turning inward, looking after their own. The United Nations has become a mere shell as members simply stop paying their dues.Dr. Jonathan Carver is brilliant marine scientist--both an observer and participant in the growing crisis. Despite major roadblocks, he works to develop a project that, while it cannot stop The Warming, would help address the growing hunger and famine. He also struggles to bring his dysfunctional personal and professional lives under control.Readers are taken around the world to experience the human impact of The Warming close up—Bangladesh, Los Angeles, Miami, New Orleans, New York, South Sudan, Southwestern China, Tanzania, Venice, the United Arab Emirates and the U.S. Southwest.The 358-page novel is a work of speculative fiction--a thought-provoking and artful amalgam of fact and fiction that puts a human face on the growing crisis. It begins with today’s climate science and imagines the potential impact on people around the globe that its observations and data suggest.While an ever smaller circle of people continues to reject the reality of human-induced global warming and its implications, there is no question--whatever the cause or causes--that the Earth is heating up, the oceans are rising and the changing climate is bringing more severe, tumultuous and unpredictable weather.We’re in for a rough ride.",
  "genres": [
    "Climate Change Fiction",
    "Science Fiction"
  ],
  "author": "Lorin R. Robinson",
  "average_rating": "3.76",
  "url": "https://www.goodreads.com/book/show/25511105-the-warming"
}