{
  "title": "Off Base",
  "description": "NEW YORK TIMES bestselling authors Tessa Bailey and Sophie Jordan team up for a collaboration featuring two sexy contemporary romance novellas. OFF KENNA AND BECK by Tessa Bailey A welcome home he never expected...and will never forget... When Kenna Sutton is tasked with driving home newly returned Beck \"True Blue\" Collier, she expects the strategic Army mastermind to be a pasty number cruncher. Never at a loss for words, Kenna is nonetheless rendered speechless by the gorgeous, inexperienced and tightly-wound Army major that lands in her passenger seat. Outraged by Beck's lack of a welcome home after seven long years overseas, Kenna takes matters into her own hands, giving Beck something he's only ever fantasized about in his bunk. Beck has never shied away from a test of will and Kenna gives new meaning to the word challenge. One problem? Kenna's father is the lieutenant general presenting Beck with the Silver Star and Beck is determined to treat Kenna with the respect she deserves, even if her eyes beg Beck to act out his most secret desires with her. Desires he's always been told were the work of the devil. But how long can one lonely, starving man hope to resist the woman he craves? OFF HUNTLEY AND CULLEN by Sophie Jordan Being a good girl has its drawbacks... Huntley Collier, an emergency room nurse and all-around do-gooder, is tired of living in the friend zone. Cullen Brooks was given the job of babysitting Huntley when her brother-his best friend-deployed. But their friendly coffeehouse hangouts and TV marathons leave her wanting more. When one crazy night leads to too many drinks and an explosion of long-denied lust, Huntley's dreams become a reality. And reality is one hot, wild place she never wants to leave. But only a good girl can bring down a bad boy... Known as Sullen Cullen around Black Rock, Cullen Brooks doesn't have many friends, but Huntley is one of them ... and despite his decidedly unfriendly fantasies of the curvy blonde, she is far too sweet for his darker tastes. Keeping his hands off is easier said than done, however, when demure, little Huntley responds to his touch like the wildcat he never expected...and can't stop pursuing, despite his better judgment. But when Cullen suddenly faces losing her, will this bad boy risk it all to keep his good girl?",
  "genres": [
    "Romance",
    "Military Fiction",
    "Contemporary Romance",
    "Contemporary",
    "Erotica",
    "Novella",
    "New Adult"
  ],
  "author": "Tessa Bailey",
  "average_rating": "3.90",
  "url": "https://www.goodreads.com/book/show/25514203-off-base"
}