{
  "title": "An Incomplete and Inaccurate History of Sport: . . . and Other Random Thoughts from Childhood to Fatherhood",
  "description": "Painstakingly faithful to its title, Kenny Mayne’s book is neither complete nor is it particularly accurate. Ostensibly an A-to-Z encyclopedia of all known sports, many sports are never mentioned. There’s not a word about rugby, volleyball, Roller Derby, swimming, or (shockingly) Basque pelota or shinty. There is a chapter about sliding, but none about skiing. Competitive eating and rhythmic gymnastics will have to wait for another book. However, there are roughly eight chapters about tackle football–“the greatest sport in the world, and everyone knows it”–and a good four or five about horse racing, so quit complaining before you’ve even read the book. There will be plenty of time for complaining after you’ve finished it (about an hour from now–tops).Those sports that are covered in the book are examined with exhaustive inattention to unretained detail. Many chapters have nothing to do with sport. For instance, the chapter on hunting is about hunting for a hassle-free triple tall Americano light on the water.So, then, what exactly is this book-like thing you hold in your hands? Part nostalgic memoir (like the summer Mark Sansaver hit 843 home runs in backyard Wiffle ball), part Dave Barry—esque riffs (like explaining bocce to non-Italians), part scholarly tract (includes the origins of tackle football), and part metafiction (see “Time-outs”). . . all with illustrations drawn by Kenny’s daughters, it is what Kenny calls his anti coffee-table book, or Coaster. The publisher calls it $24.95. Reviewers like Michiko Kakutani may call it “insipid,” but because Kenny has included a revolutionary “backwords” following the book’s foreword, she’ll have to call it an “insipid breakthrough” of a book.So what is this book-like thing? Like the great mysteries in life, you’ll have to decide for yourself.*That would include a thought I just had. This thought had something to do with Wiffle ball. What a great chapter. But that’s not to say the chapter on hunting is terrible even though it’s mostly about coffee. Plus I wrote stuff about my children. There’s even a chapter on jai alai. This book has both still photographs and still illustrations. It doesn’t have any moving pictures. That would have required the inclusion of a projector and a big white screen in the book, and I’m trying to take a stand on energy conservation. Strangely enough, Ken Griffey Jr. asked me if the book would have video. This will make sense when you read the chapter on him.I wish I'd written about the Seattle Pilots. I used to go to their games when I was nine. My favorite player was Tommy Harper.  But this isn't just a sports book. It covers all sorts of things. I hope they place it in the Miscellaneous section. That should draw a lot of attention.  I was told that the presence of a sub-title would sell more books. How am I doing with you? Make sure to tell people about this alluring and informative sub-title. This sub-title is longer than some of my chapters.",
  "genres": [
    "Sports",
    "Nonfiction",
    "Humor",
    "Memoir",
    "Comedy"
  ],
  "author": "Kenny Mayne",
  "average_rating": "3.46",
  "url": "https://www.goodreads.com/book/show/2551714.An_Incomplete_and_Inaccurate_History_of_Sport"
}