{
  "title": "People of the Shadows: The Key",
  "description": "\"Relegated to myth and folklore, a forest-dwelling race known as the Shadow People have evolved alongside humanity. Their archenemy, the greedy Society of the Morrow, means to possess a precious discovery made by the Shadow People—the Key, which is said to embody a secret force of the universe. Once they possess it, they plan to wipe out the Shadow People, develop its weapons potential, and rule the world.Teenager Sam DeAngelo and his parents are taken hostage in their home on the eve of his seventeenth birthday by intruders looking for a key.Sam escapes his captors and follows them to an old rangers’ hut on top of the nearby mountain, where they’ve taken his parents.On his quest to rescue them, his cousin and best friend, Mitchell catches up with him, and together they begin a journey of discovery.Sam meets his mysterious benefactor, Ezekiel, who helps him unravel deeply hidden knowledge about himself and the Shadow People, and gathers an army to rescue Sam’s parents.As Sam rekindles his relationship with his girlfriend, Perrin, another friend joins them and reveals her knowledge of the Morrow’s plan; the kidnap was a ruse to lure the innocent Shadow People to the hut, and they plan to kill as many as they can.In order to avoid a slaughter, the four plan to face the Morrow alone. After surveying the hut, Sam is forced to leave his dying mother where she lies and wrestles with grief and fear as they plan their assault. In the meantime they rescue another unwitting victim of the Morrow, and their team becomes five.The Shadow People know of the Morrow’s plot against them, and intercede before the friends they are sworn to protect, can act. When they charge the hut many are injured and many more are killed.When it looks like all is lost, Sam and his friends join the fight and save the day. Using the Key, they heal the injured, but Sam blames himself for the deaths of those who tried to help his family.His guilt and depression lasts months, but with Ezekiel’s help he finds peace and acknowledges his worthiness for his chosen life mission—to be Custodian of the Shadow People.\"",
  "genres": [],
  "author": "Jodie Zammit",
  "average_rating": "4.40",
  "url": "https://www.goodreads.com/book/show/25509220-people-of-the-shadows"
}