{
  "title": "Illumination Night",
  "description": "With her signature \"vivid, convincing characters [and] uncommon insight,\" (People) Alice Hoffman in Illumination Night follows the lives of an old woman whose last mission is to save her granddaughter's soul; a family torn apart by a wife's fears and a husband's desires-and a high school girl who comes to Martha's Vineyard against her will, and who will bring everyone together in a web of yearning, sin, and ultimate redemption. \"[A] bright constellation of characters...draws the reader into the dusky, dreamy world of Alice Hoffman.\" (St. Petersburg Times) \"Alice Hoffman hits bull's eyes on the incomprehensions between the young and the old, on the magic and pain of ordinary life. She is erotic and romantic...funny...clever and humane.\" (The Times, London) \"Alice Hoffman takes seemingly ordinary lives and lets us see and feel extraordinary things.\" (Amy Tan) From Publishers Weekly With an eye for household details and respect for daily events, Hoffman (Fortune's Daughter unleashes the mythic forcefulness of ordinary life in this polished story of love and loneliness set on the island of Martha's Vineyard. Simon is in his fourth year and small even for his age when he sees white-robed Elizabeth Renny, a neighbor in her 75th, tumble out her attic window \"like a cloud.\" In her convalescence, Elizabeth is cared for by her rebellious teen-aged granddaughter Jody, sent from off-island. Jody sets her sights on Simon's father, Andre, who restores antique motorcycles, raising doubts and fears in Vonny, Simon's mother, Andre's wife. Elizabeth recovers; Jody pines and plots for the taciturn Andre; Simon doesn't grow; and Vonny's anxieties bloom into full-fledged agoraphobia. Seasons advance. Jody learns the limits of her desires and meets a freakishly tall eggman; a child dies, another grows; Elizabeth decides she'd rather live than die; and Vonny faces her fears. Illumination Night, an annual celebration on Martha's Vineyard when Victorian houses surrounding a park and bandstand are lit with hundreds of magical Japanese lanterns, provides apt title and image for this shimmering, radiant tale.",
  "genres": [
    "Fiction",
    "Magical Realism",
    "Contemporary",
    "Fantasy",
    "Audiobook",
    "Romance",
    "Literary Fiction"
  ],
  "author": "Alice Hoffman",
  "average_rating": "3.75",
  "url": "https://www.goodreads.com/book/show/11569698-illumination-night"
}