{
  "title": "12-ALARM COWBOYS",
  "description": "AFTER THE FIRE by Cora Seton When a series of fires keeps bringing him to her door, a firefighter must uncover his ex-girlfriend’s secret or risk losing her forever. WHERE THERE'S SMOKE (A Cowboy Way Novella) by Becky McGraw Cowboy Austin McBride follows a herd to a new town, but firefighting is his passion, so he applies at a local station. Standing between him and the job is a blonde bombshell who thinks she's a shoe-in. SADDLES AND SOOT by Cynthia D’Alba Rancher and volunteer firefighter extinguishes a grass fire accidentally started by the town’s sexy temporary veterinarian but there’s something about her that ignites a fire inside of him. CONTROLLED BURN (Cowboys on the Edge, Book One) by Delilah Devlin Rancher and volunteer firefighter assigns himself to watch a reformed firebug during a controlled burn but she lights the fire inside him instead of the dead grass around them. HIS FIREFLY COWGIRL by Beth Williamson When an arson investigator returns to her hometown she clashes with the firefighter cowboy who broke her heart. Embers turn to sparks between a cowboy and his firefly cowgirl. HER VOLUNTEER COWBOY (Book 6: Harland County) by Donna Michaels Sparks reignite when one-nighters reunite. Can the firefighter/Guardsman convince the reforming bad girl she’s worth fighting for, or will she leave before he finds the courage to volunteer his heart? COWBOY'S MATCH by Lexi Post When a cowboy firefighter works a fire at a nudist resort, he’s sure his ex-girlfriend, the bookkeeper, is to blame. But as he investigates her, his gut tells him he’s going to get burned. HELLFIRE, TEXAS by Elle James A Cowboy-Volunteer Firefighter helps a runaway city girl put out a car fire only to find himself embroiled in a hot little mess of the mob persuasion. REKINDLED (Dallas Fire & Rescue, Book One) by Paige Tyler A hunky firefighter rescues his best friend’s sexy sister from a hotel fire set by her psychotic ex-boyfriend who’d rather see her dead than with another man. TEXAS WILDFIRE by Sable Hunter Honored VFD hero is no angel. In love with his Captain’s wife, all hell breaks loose when Titan learns Makenna is abused. The firestorm their love ignites is so intense no one will emerge unscathed. HOT IN THE SADDLE – Randi Alexander When a rancher/volunteer firefighter is injured saving the life of a female stockcar racer, she stays to pay her debt of gratitude. Will he regret risking his life when he learns why she came to Texas? COME HELL OR HIGH WATER by Sabrina York When offered a second chance to seduce his high school crush, cowboy/fireman Cade Silver cannot resist. Despite her resistance, he is determined to win her, come hell or high water.",
  "genres": [
    "Romance",
    "Anthologies",
    "Westerns",
    "Contemporary",
    "Contemporary Romance",
    "Erotica",
    "Firefighters"
  ],
  "author": "Cora Seton",
  "average_rating": "4.40",
  "url": "https://www.goodreads.com/book/show/25523398-12-alarm-cowboys"
}