{
  "title": "The Awakening",
  "description": "Allie Carmichael has always believed life is simple.You're born. You live. You die.She has no cause to believe those rules don't apply to her.All her life, Allie has suffered in silence as those around her shrink from her touch, too intimidated to take the time to get to know her. It's left her feeling like a pariah for fifteen years.When an unexpected move to Kelleys Island brings Aidan McBrien crashing into her life, Allie is thrown by his reaction. He isn't affected by her touch. He doesn't stutter or make a quick exit. He smiles and welcomes her into his circle of friends.For the first time ever, Allie knows what true friendship means. Finally, she has a real shot at normal--until \"normal\" crashes and burns when she wakes in agony on her sixteenth birthday. Aidan calls it her Awakening, a rite of passage he and their friends have all faced. Allie struggles in ignorance through the experience, uncertain of what is real and what isn't. When she emerges, she is different. She has always been different, but even among her extraordinary friends, she and Aidan are special.As Allie struggles to maintain her tenuous grasp on the power that threatens to overwhelm her, she worries she will lose herself in this strange new world of ancient Immortal beings.A dangerous world where she will have to fight tooth and nail to defend the power and freedom that is her birthright.Join Allie and Aidan in this coming of age, urban fantasy set within our own world.Fans of The Mortal Instruments will enjoy Emerge: The Awakening, Book 1 of the Urban Fantasy, Emerge series. -- \"An unhurried but engrossing start for a potentially riveting paranormal series.\" - Kirkus Reviews-- \"This series is one to keep your eye on!\" -YA Books Central-- \"An absolute must read for fans of Jennifer Armentrout, Lauren Kate, Josephine Angelini and Brigid Kremerer.\" -NetGalley ReviewerEmerge Awards:2015 Dante Rossetti YA Awards Finalist USA Best Book Awards Finalist International Book Awards FinalistTop 50 Indie Books of 2015",
  "genres": [
    "Fantasy",
    "Young Adult",
    "Paranormal",
    "Urban Fantasy",
    "Romance",
    "Fiction",
    "Paranormal Romance"
  ],
  "author": "Melissa A. Craven",
  "average_rating": "4.04",
  "url": "https://www.goodreads.com/book/show/25521894-the-awakening"
}