{
  "title": "Stella Dallas",
  "description": "She's ambitious, she's relentless, she's unstoppable - but she can't hide the stain of her working-class roots. A woman big enough for both Barbara Stanwyck and Bette Midler, Stella Dallas was a best-seller in its time - and a terrific read today.One of the most entertaining, excellently sustained and consistently developed novels of the season. - New York TimesAll she wants is to get ahead in the world. But Stella Dallas's world is one that always brings her shame. She marries Stephen Dallas, a man of great refinement, but he cannot tolerate her crudities; when he finally loses patience with her indiscreet flirtations, it's curtains for the marriage.Stella transfers her hopes for the future to her sweet-as-pie daughter, Laurel, and the two live in shabby gentility, a shadow of their former life. While Stella imagines herself the grand lady, her coarseness and rumored exploits with unsavory men bring her public ridicule - and ostracize Laurel from polite society.Stella finally makes the ultimate sacrifice, marrying an alcohol- and drug-addicted man she loathes to force Laurel to leave her and seek the advantages of her father's home and social class.Deeply moving narrative...Mrs. Prouty's subject is conceived with that surety and understanding which in literature makes beauty. - Boston TranscriptStill shown throught the country at revival houses, the 1937 King Vidor/Sam Goldwyn production of Stella Dallas brought Osca nominations to both Barbara Stanwyck and Ann Shirley. Literary Cinema Classics now brings back the great American novels that became beloved American films. Each book is illustrated with stills form the movie, and each is completely reset in a typeface to enhance your reading pleasure.",
  "genres": [
    "Fiction",
    "Classics",
    "Historical Fiction",
    "Book Club",
    "American",
    "Modern Classics"
  ],
  "author": "Olive Higgins Prouty",
  "average_rating": "3.89",
  "url": "https://www.goodreads.com/book/show/1157098.Stella_Dallas"
}