{
  "title": "The Pistol Poets",
  "description": "The Edgar-nominated author of Gun Monkeys is back with a thrill-a-minute suspense novel that mixes crime and academia—with hilarious results. Here Victor Gischler draws us into a wild and wicked world, where tenured professors are busy burying bodies, cash-up-front P.I.’s hunt for missing coeds and one desperate street-tough has to decide which he’d rather a live poet or a dead criminal.An unlucky grad student just got himself killed in a robbery gone bad. And as lowly drug lieutenant Harold Jenks races with the killer out of the alley, a light goes off in his He’ll steal the dead kid’s identity. Now Jenks, who once lorded it over seven square blocks in East St. Louis, is headed due west. With a .32 in his pocket, a 9mm Glock taped across his back, and a rap sheet nearly as long as Finnegans Wake, he’s cruising the halls of academia as Eastern Oklahoma U’s newest grad student, looking for action and hoping he can stay one couplet ahead of his violent past.While this new bad boy on campus makes mincemeat of his metaphors, across campus visiting professor Jay Morgan has a more pressing What to do about the dead coed in his bed. The professor’s no killer, but try telling that to private eye Deke Stubbs. With the professor on the lam and Stubbs hot on his trail, more trouble blows into town. Now, as St. Louis drug boss Red Zach and his minions converge on Fumbee, Oklahoma, looking for a consignment of missing cocaine, the bullets start flying faster than the zingers at a faculty hate fest. For Morgan and Jenks, now desperate fugitives from poetic justice, survival means learning new skills—and learning fast. Because if they find out they’re bottom-of-the-class, that means they’re already dead.Featuring the sleaziest, sorriest, and most captivating group of criminal lowlifes, sexed-up academics, poets, and rappers ever to collide in one crime novel, The Pistol Poets speeds deliriously to its electrifying payoff.From the Hardcover edition.",
  "genres": [
    "Crime",
    "Fiction",
    "Mystery",
    "Humor",
    "Noir",
    "Thriller",
    "Novels"
  ],
  "author": "Victor Gischler",
  "average_rating": "3.76",
  "url": "https://www.goodreads.com/book/show/255188.The_Pistol_Poets"
}