{
  "title": "One Destination: Discovering the underlying principles of the religions and spiritual traditions of the world.",
  "description": "Acts of love, forgiveness and mercy are not made less precious to those in desperate need of them; not by virtue of being done under the banner of a 'wrong' or 'right' religion, or any at all. A starving man does not care IF or WHO you worship, but it is the kindness in your act of feeding him (even in silence) that sustains him. Our spiritual-self, matured and manifested is nothing less than LOVE IN-ACTION, and it is not only made valuable when it’s kindness is brought forth by the tenants of a specific religion or culture on earth. The failure to accept this fact threatens to suppress more charity in the world, promoting greater misery in its place.  Mankind has always been in the business of trying to limit God, appealing to a specific market or denomination to maximize profit and power. God in contrast is in the business of (according to nearly every tradition) setting mankind FREE; to liberate us from pain, delusion, separation from the divine, from our own carnal and destructive ways.  I encourage you to take your time with this simple introduction into religious pluralism. Expand your general religious knowledge with a brief study of many heartfelt scriptures, taken from a variety of ancient and widespread religious and spiritual traditions in the world. Understanding the beliefs of others on a less superficial/biased level does not mean you will have to adopt a specific belief, change an existing one, or walk a favored path with less confidence. It will not demand that all faiths be equal to you, or render it impossible that any specific one might reflect a stronger image to ultimate Truth, but it WILL do something profound for your life, regardless of your beliefs.  It will cause you to pause and reflect with much greater empathy toward other human beings before you pass judgment on those who may be of a different culture/cloth than you, and to better understand the limitations of those who still do condemn what they don't understand. By softening your heart you will recognize that we share many of the same positive virtues and ideas, even if we express them differently sometimes. If you do this, and take this journey into a more patient and tolerant understanding of the heart and mind of those who seek the will and compassion of God, in whatever way their own road has taken them in life, you may end up better understanding yourself and your own beliefs. Isn't that something we all should strive for?",
  "genres": [],
  "author": "Brett Strobridge",
  "average_rating": "3.67",
  "url": "https://www.goodreads.com/book/show/25522075-one-destination"
}