{
  "title": "Captive",
  "description": "Max ‘Reaper’ Andrews is torn…held captive by the demons of his past, but desperately wanting to break free from the chains that tie him.  As the SAA for Devil’s Spawn MC he’s been fighting himself and others for years, retribution and pain his middle names. Weighed down by the actions he’s carried out for his club over the last almost three decades, Max is also burdened by something darker and more sinister. Something that has the potential to derail his plans of remaining detached and unapproachable to all but his son. Something he had worked hard to forget. All his efforts come to a screeching halt when a petite blonde, dreadlock wearing tattoo artist arrives in Blackwater, Colorado to work at his shop, ‘Skin Fusion’, knocking his world firmly off its axis.  Adelyn Pippa London is captive no more… Seventeen years ago she ran away from a cruel prison where she was held hostage by her foster brother suffering unimaginably before she found the strength and conviction to escape, running straight into the arms of the only woman to ever show her an ounce of kindness, Emily. Embraced by Vengeance MC, which Emily’s son Diesel is a member of, Adelyn changed the course of her life and hasn’t looked back, or so she thought.  Adelyn believed relocating to Denver, Colorado to help her friend Amy establish her budding tattoo shop would be a great opportunity for her. Little did she know that the one friend, other than the MC that had become her family, she had would sell her out in the worst possible way causing her to leave Denver for the much smaller town of Blackwater, Colorado thrust into the care of the resident MC, Devil’s Spawn. More aptly…the care of one Max ‘Reaper’ Andrews.  When she begins to receive disturbing letters and gifts Adelyn is left with the choice to approach Max for help, or go it alone. Believing it’s safer to brave the unknown by herself Adelyn hides her fears until one day when everything changes, and she’s left with no option but to go to the one man that threatens her well-being above all others…  Put in an unforgiving position, Max has to find it in himself to change everything he knows, everything he’s worked for, and everything he’s spent the last twenty-eight years pretending to be, or lose the one woman that would make his life worthwhile.  In the end…did he ever really have a choice? Or did his heart decide for him long before his head caught up?",
  "genres": [
    "Abuse",
    "Second Chance Romance",
    "Romance",
    "Contemporary",
    "Erotica"
  ],
  "author": "Natasha Thomas",
  "average_rating": "3.90",
  "url": "https://www.goodreads.com/book/show/25518058-captive"
}