{
  "title": "Dry Store Room No. 1: The Secret Life of the Natural History Museum",
  "description": "'Dry Store Room No. 1' is an intimate biography of the Natural History Museum, celebrating the eccentric personalities who have peopled it and capturing the wonders of scientific endeavour, academic rigour and imagination. 'This book is a kind of museum of the mind. It is my own collection, a personal archive, designed to explain what goes on behind the polished doors in the Natural History Museum. The lustre of a museum does not depend only on the artefacts or objects it contains -- the people who work out of sight are what keeps a museum alive!I want to bring those invisible people into the sunlight.' Behind the public facade of any great museum there lies a secret one of unseen galleries, locked doors, priceless specimens and hidden lives. Through the stories of the numerous eccentric individuals whose long careers have left their mark on the study of evolutionary science, Richard Fortey, former senior paleaontologist at London's Natural History Museum, celebrates the pioneering work of the Museum from its inception to the present day.He delves into the feuds, affairs, scandals and skulduggery that have punctuated its long history, and formed a backdrop to extraordinary scientific endeavour. He explores the staying power and adaptability of the Museum as it responds to changes wrought by advances in technology and molecular biology -- 'spare' bones from an extinct giant bird suddenly become cutting-edge science with the new knowledge that DNA can be extracted from them, and ancient fish are tested with the latest equipment that is able to measure rises in pollution. 'Dry Store Room No. 1' is a fascinating and affectionate account of a hidden world of untold treasures, where every fragment tells a story about time past, by a scientist who combines rigorous professional learning with a gift for prose that sparkles with wit and literary sensibility.",
  "genres": [
    "Nonfiction",
    "Science",
    "History",
    "Natural History",
    "Nature",
    "Museums",
    "Memoir"
  ],
  "author": "Richard Fortey",
  "average_rating": "3.73",
  "url": "https://www.goodreads.com/book/show/2553092.Dry_Store_Room_No_1"
}