{
  "title": "Drugs and Drug Policy: What Everyone Needs to Know®",
  "description": "While there have always been norms and customs around the use of drugs, explicit public policies--regulations, taxes, and prohibitions--designed to control drug abuse are a more recent phenomenon. Those policies sometimes have terrible side-effects: most prominently the development of criminal enterprises dealing in forbidden (or untaxed) drugs and the use of the profits of drug-dealing to finance insurgency and terrorism. Neither a drug-free world nor a world of free drugs seems to be on offer, leaving citizens and officials to face the age-old problem: What are we going to do about drugs?In Drugs and Drug Policy , three noted authorities survey the subject with exceptional clarity, in this addition to the acclaimed series, What Everyone Needs to Know® . They begin, by defining \"drugs,\" examining how they work in the brain, discussing the nature of addiction, and exploring the damage they do to users. The book moves on to policy, answering questions about legalization, the role of criminal prohibitions, and the relative legal tolerance for alcohol and tobacco. The authors then dissect the illicit trade, from street dealers to the flow of money to the effect of catching kingpins, and show the precise nature of the relationship between drugs and crime. They examine treatment, both its effectiveness and the role of public policy, and discuss the beneficial effects of some abusable substances. Finally they move outward to look at the role of drugs in our foreign policy, their relationship to terrorism, and the ugly politics that surround the issue.Crisp, clear, and comprehensive, this is a handy and up-to-date overview of one of the most pressing topics in today's world.What Everyone Needs to Know ® is a registered trademark of Oxford University Press.",
  "genres": [
    "Nonfiction",
    "Medicine",
    "History"
  ],
  "author": "Mark A.R. Kleiman",
  "average_rating": "4.09",
  "url": "https://www.goodreads.com/book/show/11572178-drugs-and-drug-policy"
}