{
  "title": "A Man's Due",
  "description": "1938 Katie-Lynn grew up knowing the way of things. A man, as the head of the family, was due respect. It was a woman’s place to give her man respect. It was drilled into her head that because a man gave you a place to live, with a roof over your head, you respected him. It was hard work clothing a family and seeing that everyone had something on their plate come dinnertime. Her mama told her that all men needed to be respected, but that it was easier to respect a man who could easily give you clothes, a nice big house and a maid to cook the food that went on the plates. She explained that some men had to work hard, and some had it easier. Katie-Lynn's mama whispered in her ear from little on that she needed to be beautiful, so she could marry a rich man. When a young doctor moved to town, her mama decided that he would be the perfect catch for her Katie-Lynn. Carlton and Katie-Lynn spent some time together and then they married. The moment she took on his name, he changed. Nothing she did was ever good enough for him. He called her on every little mistake she made. Katie-Lynn lived in fear of him. When the second world war started, she was pleased to see him go. However, nothing prepared her for his return. Something happened to him over in Europe, something that changed him - for the better. It was like a whole new man came home to her, one who loved and adored her. Stanley Jones wondered about his mother and his family all of his life. He knew that he was adopted. Still, he often felt like he was leading the wrong life. When he met a man who looked exactly like him, he knew that he'd finally found a member of his family at long last. The sad thing was that his twin brother, Carlton, wasn't as happy to meet him. When Stanley sees a picture of his brother's wife, it's love at first sight. He wants what his brother has. Carlton freely admits that he beats his wife and that he doesn't like her. Stanley longs to meet Katie-Lynn and make her life easier. When Carlton dies on the front, Stanley sees his chance. He takes his brother's place and goes home to the beautiful Katie-Lynn. Will he be able to pull off the switch, or will Katie-Lynn notice that the man who returned home from war isn't the same man who left her? Ages 18 and up.",
  "genres": [],
  "author": "Rachel Burns",
  "average_rating": "4.06",
  "url": "https://www.goodreads.com/book/show/25528334-a-man-s-due"
}