{
  "title": "Demeter's Gold: A Novel of the Ancient World",
  "description": "Phil is enjoying life as a wealthy trader until a stranger brings him a mysterious coin to sell. Coins are his business but this one is nothing but trouble. Phil follows the mystery of the coin through the streets of Athens, the port of the Piraeus, and the temples of Eleusis, staying one step ahead of unseen enemies. Set in ancient Greece in the turbulent period before the rise of Macedon, the novel follows Phillipus, a foreign trader born in Athens, as he tries to solve the puzzle of the unusual coin while staying ahead of enemies who are desperate to acquire the coin and will not hesitate to eliminate anything (or anyone) in their way. As the body count rises, Phil finds he has to become a detective both to solve the mystery of the coin and to keep from becoming the next victim. Moving from the society of aristocrats and courtesans to the ports and markets of Athens and the Piraeus, Phil follows the trail of the strange coin. But as he unravels the mystery, he discovers murder, political intrigue, and betrayal. The character Phillipus follows in the footsteps of other investigators in the historical fiction of the ancient world like the literary detectives of Rome and Egypt as he works his way through high and low society in search of the answers to his mystery. This mystery begins when he is asked to sell a rare and unusual coin by an aristocratic Athenian who is unwilling to share its origin or even the name of the owner. Finding himself interested in the coin but not trusting the story told by his mysterious visitor, Phil starts his own investigation into the coin using his professional and personal connections. He travels from his base in the Piraeus to the great city of Athens and pays visits to people whom he hoped could help to solve his mystery. Instead, he discovers more questions than answers and finds he has more enemies than he ever imagined. This work of fiction explores the different conditions, classes, and customs of the society of ancient Athens and its environs in the fourth century BCE, the prominence of mystery cults in religious life, and some of the historic details that made the period before the rise of Philip II and the Macedonian empire a time of such great change for the culture and politics of the city of Athens and of Greece as a whole. One caveat: Historical fiction can be a challenging genre since it combines imagination and history in a way that can make telling fact from fiction difficult for the reader. This novel is most definitely a work of fiction with a historical setting and it is loaded with anachronisms and purely fictitious details. I have tried to include real political and military events, social customs, and practices as a background for the story but Phillipus, his friends, colleagues, and enemies are all imaginary as are all the incidents that take place in the novel.",
  "genres": [
    "Greece"
  ],
  "author": "Meghan Ray",
  "average_rating": "3.59",
  "url": "https://www.goodreads.com/book/show/25532529-demeter-s-gold"
}