{
  "title": "Dead on the Rocks",
  "description": "Jane could die working this one case... and as far as Sam can tell, his dog is a goner. It takes everything he has to live through the thought of the loss of Jane and to (almost) solve this one himself.Sam Russo is a neglected graduate of the Staten Island Home for Children. Self-named and self-styled, Russo's not long back from World War II where his unit fought on the Pacific Front with the very last of America's cavalry troops. Holding on to the rest of New York City by a ferryboat, Staten Island is not the kind of place for a real Private Eye. But Sam's a dreamer with the gift of gab. He's a young sleuth who'd like to follow in the hard-boiled footsteps of Bogart's Philip Marlowe or Bogart's Sam Spade—if only he was hard-boiled. Even so, sleuthing has brought him three good things: a yodeling dog named Jane, an upper crust sassy dame called Mrs. Willingford, and some tough spots where it's do or die. Sam Russo just wants a few cases, nothing flashy, a few wins at the racetrack, Hollywood cranking out movies so he can go see ‘em, writers writing books so he can lie around reading ‘em, and Jane in his bed. It’s a Murphy bed. It folds up into the wall when guests come calling. His only guest is Holly, the dame next door. Holly is busy these days going to an acting school. Jane is his Egyptian dog with a better nose than Sam has. He’s been shot, sapped, and slapped around. Jane’s had it worse. Time to lie low. So what happens? Mrs. Willingford, who else? Sam and Jane and Holly are sailing on the Willingford yacht whether Sam likes it or not. They’re going down to Hialeah for the races. Mr. & Mrs. Willingford’s prize racing mare is in the Old Hat Stakes. It won’t be just Sam though. The Sip o’ Sea is stuffed with movie stars, writers, actresses, opera singers, horsemen, America’s comic sensation, and a robber baron. Sam hates water. He hates boats. Too bad. What Mrs. Willingford wants, Mrs. Willingford gets. What Mrs. Willingford doesn’t want is a starlet taking a high dive off her yacht, a body stuffed in a closet, and Jane gone missing far from land. Sam is in watery salty hell. It’s bad enough to sail with dead people, where’s his dog!",
  "genres": [
    "Historical Mystery",
    "Murder Mystery",
    "Mystery"
  ],
  "author": "Ki Longfellow",
  "average_rating": "4.05",
  "url": "https://www.goodreads.com/book/show/25534180-dead-on-the-rocks"
}