{
  "title": "A Match for Marcus Cynster",
  "description": "Duty compels her to turn her back on marriage. Fate drives him to protect her come what may. Then love takes a hand in this battle of yearning hearts, stubborn wills, and a match too powerful to deny. #1 New York Times bestselling author Stephanie Laurens returns to rugged Scotland with a dramatic tale of passionate desire and unwavering devotion. Restless and impatient, Marcus Cynster waits for Fate to come calling. He knows his destiny lies in the lands surrounding his family home, but what will his future be? Equally importantly, with whom will he share it? Of one fact he feels certain: his fated bride will not be Niniver Carrick. His elusive neighbor attracts him mightily, yet he feels compelled to protect her—even from himself. Fickle Fate, he’s sure, would never be so kind as to decree that Niniver should be his. The best he can do for them both is to avoid her. Niniver has vowed to return her clan to prosperity. The epitome of fragile femininity, her delicate and ethereal exterior cloaks a stubborn will and an unflinching devotion to the people in her care. She accepts that in order to achieve her goal, she cannot risk marrying and losing her grip on the clan’s reins to an inevitably controlling husband. Unfortunately, many local men see her as their opportunity. Soon, she’s forced to seek help to get rid of her unwelcome suitors. Powerful and dangerous, Marcus Cynster is perfect for the task. Suppressing her wariness over tangling with a gentleman who so excites her passions, she appeals to him for assistance with her peculiar problem. Although at first he resists, Marcus discovers that, contrary to his expectations, his fated role is to stand by Niniver’s side and, ultimately, to claim her hand. Yet in order to convince her to be his bride, they must plunge headlong into a journey full of challenges, unforeseen dangers, passion, and yearning, until Niniver grasps the essential truth—that she is indeed a match for Marcus Cynster. A neo-Gothic tale of passionate romance set in the uplands of southwestern Scotland A Cynster Second Generation Novel—a classic historical romance of 114,000 words.",
  "genres": [
    "Romance",
    "Historical Romance",
    "Historical",
    "Historical Fiction",
    "Regency",
    "Regency Romance",
    "Audiobook"
  ],
  "author": "Stephanie Laurens",
  "average_rating": "3.97",
  "url": "https://www.goodreads.com/book/show/25535898-a-match-for-marcus-cynster"
}