{
  "title": "Something Short",
  "description": "Something Short is a collection of short stories from French and Scottish shores by two female writers; Elspeth Morrison and Angela Lockwood. We meet a variety of interesting and amusing Scottish characters in Begonia, The Wee Baldy Man, The Pop Star and a mad scientist in Animals, but also some personal experiences in dealing with arthritis and depression in Begonia and The Goldfish Bowl. The stories are short but impactful and we hope they leave a lasting impression on you.  About the authors Elspeth Morrison is a published author of historical non-fiction, namely The Dorothy Dunnett Companion vols I & II and editor of The Lymond Poetry. She has always enjoyed writing but only recently has had the nerve to publish her fiction. Some of her work is quite close to the bone, but in her short stories and her poems she strives to make an emotional connection with the reader. Elspeth works and lives in Edinburgh.  Angela Lockwood-van der Klauw was born in the Netherlands. She learned her trade as a jeweller and gemmologist at the Vakschool Schoonhoven before moving to Edinburgh as an apprentice jeweller. There she met and later married her husband Adam. Angela ran her own jeweller’s shop in Edinburgh for ten years before she and her husband moved to the south of France in 2011. Angela prefers the climate there, but often thinks about the town she left behind and its people. Angela started writing in the spring of 2013, a very wet spring during which she found herself climbing the walls, frustrated that she couldn’t go out and have her usual long walks along the seafront. Seeing his wife’s frustration, Adam suggested ‘Why don’t you write a book?’ Angela thought about it for a few days, then switched on her laptop and started writing. She published her first book ‘Language in the Blood’ in August 2013.  Having met many moons ago in Angela’s jewellery workshop when Elspeth discovered a passion for jewellery and wanted to know more about their manufacture, they now share another passion; writing. Even though these friends now live on different shores they have pulled together to release this bundle of short stories.",
  "genres": [],
  "author": "Elspeth Morrison",
  "average_rating": "4.75",
  "url": "https://www.goodreads.com/book/show/25537205-something-short"
}