{
  "title": "The Virtuous Feats of the Indomitable Miss Trafalgar and the Erudite Lady Boone",
  "description": "In 1899, a secret society tried to use a young woman to bring an ancient evil into the world. Twenty years later they will return to finish the job. After the Great War, London is settling once more into the gentle routine of peacetime. The airships that once protected England's coast now ferry people back and forth across the Thames, the magically-inclined are free to return to their normal work, and those who seek treasures left behind by ancient civilizations are again free to explore. Dorothy Boone shunned a life of luxury to follow in her grandmother's footsteps by uncovering the mysteries of \"the worlds that came before ours.\" When a package explodes upon delivery to Lady Boone's townhouse, she is drawn into an unlikely alliance with her nemesis, Trafalgar of Abyssinia, to find the culprit. They soon find themselves unraveling a plot that has left many of their allies dead and the rest in fear for their lives. A group of treasure hunters with a fiendish plot to take over England has begun eliminating its competition in order to fund an expedition to retrieve the last item they need for a summoning that will bring an ancient evil into our world. With no one else to trust, Trafalgar and Boone must put aside their differences and forge a partnership to stop their mutual enemy. If they fail, a world that still bears the scars of the Great War will be once again thrown into turmoil. Welcome to the world of Trafalgar and Boone, a world where airships battled in a Great War that was fought by soldiers who utilized magic and summoned monsters to do their bidding, a world that they must defend by working together to stop an evil far greater than either of them could ever have imagined.",
  "genres": [
    "Fantasy",
    "Steampunk",
    "LGBT",
    "Lesbian",
    "Fiction",
    "Urban Fantasy",
    "Adventure"
  ],
  "author": "Geonn Cannon",
  "average_rating": "3.70",
  "url": "https://www.goodreads.com/book/show/25548484-the-virtuous-feats-of-the-indomitable-miss-trafalgar-and-the-erudite-lad"
}