{
  "title": "Too Hot To Handle: Zero to 60",
  "description": "Hot, funny, sizzling romance! At the airport, Margo Santero crosses the path of a handsome stranger. For a woman with too many secrets to hide, a cocky ex Marine is a dangerous distraction. Except maybe just this once… From working a Texas fence line under the grueling summer sun, Robert Damien 'Rod' McLemore is thrust back into the line of duty. Doing an airport pickup of a wedding guest should be a no-brainer mission. Only he’s blindsided by a pretty woman with a little too much sass for her own good. After one red-hot encounter, these lovers discover they aren’t strangers. A sexy mistake has Margo ready to combust... until McLemore makes an offer too perfect to pass up. From on the run, she accepts this cowboy’s offer, buying her time to outgun the con man vowing to extract a pound of flesh. In a stormy love affair, Margo and Rod’s irresistible attraction forces them over the edge as they wrangle nosy in-laws, Mother Nature, and a ruthless headhunter for the mob. In a merciless showdown, one of them is set to take a fall. Yet in Texas, a battle worth fighting means taking a stand and these lovers do whatever it takes to stay together. Even if it means they have to lie, steal, cheat, or kill. Too Hot To Handle is fast-paced, scorching romance, bringing together the entire McLemore clan in Mia and Brandon's wedding (the high-octane couple from Collared By the Cowboy), and introducing a new character: Margo Santero (Mia's little sister).Sensitive Subject Alert: At the core of this love-conquers-all novel resides the story a young woman, pushed to the brink, who’ll do anything to protect the horse entrusted to her care, as well as coming to terms with her mother’s death.",
  "genres": [
    "Romance",
    "Westerns",
    "Contemporary Romance",
    "Contemporary",
    "Suspense",
    "Erotic Romance"
  ],
  "author": "Susan Arden",
  "average_rating": "4.16",
  "url": "https://www.goodreads.com/book/show/25550058-too-hot-to-handle"
}