{
  "title": "Barefoot Bound",
  "description": "Roxanne St. Claire is thrilled to introduce readers to a new spinoff series set on the sun-baked beaches of Barefoot Bay. But this time, there’s a splash of suspense and a twist of mystery on the sand. Barefoot Bay Undercover features the love stories of men and women who don’t qualify for government protection, but they need to who need to run, hide, and reinvent themselves for a number of reasons. Barefoot Bound is the prequel novella (100 pages, no cliffhanger) that kicks off the Barefoot Bay Undercover series. Legendary spy and beloved bad boy Gabriel Rossi is headed to Barefoot Bay to start and run a new covert operation, but before he goes, he has some business to take care of up in Boston. Family business. With the Rossi and Angelino family, that means there will be laughter, love, food, and forgiveness…and the possibility someone is in danger. On the eve of his departure, Gabe learns that his grandfather, Nino, might be in some serious trouble. Gabe will stop at nothing to help the man he considers his best friend, even if that means risking his own life to save Nino’s. But even Gabe might not be sly and smart enough to protect Nino from the one thing that could really hurt this sweet old man…a broken heart. So, before you slip off your shoes and go all the way undercover, get to know Gabriel Rossi, the hero at the heart of Barefoot Bay Undercover. And get ready for a whole new adventure in Barefoot Bay!  Don’t Miss a Minute in Barefoot Bay BAREFOOT BAY UNDERCOVER Barefoot Bound – The Undercover Series Prequel Barefoot with a Bodyguard (June 2015) Barefoot with a Stranger (September 2015) Barefoot with a Bad Boy (December 2015 – Gabe’s book!)  THE BAREFOOT BAY BILLIONAIRES Secrets on the Sand (always free!) Seduction on the Sand Scandal on the Sand  THE BAREFOOT BAY BRIDES Barefoot in White (currently free!) Barefoot in Lace Barefoot in Pearls  Roxanne St. Claire is New York Times and USA Today bestselling author of forty romance, suspense, and young adult novels. A six-time nominee and one-time winner of the Romance Writers of America prestigious RITA Award, Roxanne’s novels have also been recognized with dozens of other industry awards, including the three National Reader’s Choice Awards, the Booksellers Best Award, and the Borders “Top Pick” of the Year. She resides in Florida and can be found on Facebook, Twitter, and at the beach.",
  "genres": [
    "Romance",
    "Romantic Suspense",
    "Novella",
    "Contemporary",
    "Suspense",
    "Chick Lit"
  ],
  "author": "Roxanne St. Claire",
  "average_rating": "4.09",
  "url": "https://www.goodreads.com/book/show/25547187-barefoot-bound"
}