{
  "title": "The Last Hanging in Scots Bend",
  "description": "Even thirty years after Sherman's March decimated thecommunity of Scots Bend, it still impacts the daily lives of the people livingthere. Even more than destroying the economy, the March and the Reconstructionthat followed destroyed the laws and often the morals that provided structureto the community, and protection for the people struggling to rebuild theirlives. Against that backdrop, two families feud for power anddominance. One family, the Greers, made a devil's deal with the Yankee occupiersto protect their wealth and property. The other, the Casons, proudly fought aguerilla campaign against the carpetbaggers and when they left, continued theirfeud against the Greers and their minions. Told in first person narratives of the characters involved,the feud culminates in the brutal last legal hanging in Scots Bend. Theinternal conflicts of the characters are just as intense as the externalconflicts of their struggles to survive and to win the battles against theirenemies. THE LAST HANGING IN SCOTS BEND opens with an incredibly evocative scene. Leland \"Big Lee\" Cason visits his family's cemetery plots. As he talks to members of his family, he reflects on the events of 1898. Before leaving the cemetery, Big Lee marks his own tombstone with tomorrow's date. From that powerful opening, the story flashes back to 1898. John Brooks \"Stash\" Harris awaits sentencing for the murder of two men. His uncle, Big Lee, is sheriff and has to balance his duty to the community and to his kin. Their rivals, the Greers, gleefully await Stash's sentencing and celebrate the verdict, death by hanging. The small town of Scots Bend staggers as all affected reflect, remembering the events leading up to Stash's crime, the potential aftermath, and their own contributions.From the powerful opening to the explosive ending, THE LAST HANGING IN SCOTS BEND is an incredible read. The story is told through the memories and recollections of a small pocket of humanity struggling to find peace in the aftermath of a war that nearly tore the nation in two. The two families, not content to merely exist, feud proudly. The Casons and the Greers are not the only families in the community of Scots Bend, but they might as well be. Every event revolves around something the Casons did in response to an act the Greers inflicted upon them and vice versa.As the reader is thrust into this hectic world, they become like Stash haunted by the upcoming hanging and the events leading up to his rash actions. Rotating chapters focus on an important character which grants insight into the current events and Stash's character. These chapters read at times like inner monologues and others like journal entries, which work to draw the reader in. The characters are distinct and well-rounded with captivating writing. All of which combines in a contemplative look at faith, honor, family, and man's place in a world shattered by war as it attempts to rebuild. THE LAST HANGING IN SCOTS BEND highlights a captivating examination of human nature in a time of upheaval.",
  "genres": [],
  "author": "Jack Hammond Jr.",
  "average_rating": "4.63",
  "url": "https://www.goodreads.com/book/show/25546198-the-last-hanging-in-scots-bend"
}