{
  "title": "Ten Brides for Ten Hot Guys",
  "description": "Need a beach read to fill your lazy summer days? Look no further! Ten Brides for Ten Hot Guys will take you on a thrill ride until the very last page!Ten New York Times and USA Today bestselling authors bring you ten awesome stories featuring super-hot guys determined to find their perfect brides. Fall in love with doctors, lawyers, billionaires and men in uniform. From small-town to international intrigue, from Boston to Scotland to the Greek Isles, these emotional love stories will touch your heart...and make you reach for a fan to cool the sizzle!TAKING LOVE IN STRIDE by Donna Fasano, USA Today Bestselling Author - The school teacher and the business man—let the clash begin!THE ARMY DOCTOR'S NEW YEAR'S BABY by Helen Scott Taylor, USA Today bestselling author—In the Scottish highlands, a career-driven army surgeon finds his commanding officer's beautiful sister too much of a distraction.I'M NO ANGEL by Mimi Barbour, USA Today bestselling author—A Canadian earthquake brings them together...and their whole relationship is filled with aftershocks.HER GREEK TYCOON by Mona Risk, USA Today bestselling author—In court, an American attorney and a Greek tycoon are ready to tear each other apart, but attraction sizzles during a romantic encounter on Mikonos Island.FOR THE LOVE OF CANDY by Patrice Wilton, USA Today bestselling author—A bar owner and a Boston lawyer plot to keep their two kids from marrying, but their own attraction gets in the way big time.NIGHTFALL by Rebecca York, NYT and USA Today bestselling author—After 20 years, a bride ship finally arrives on all-male planet Palomar, bringing a settler’s wife...won in a lottery.BROSLIN BRIDE by Dana Marton, NYT and USA Today bestselling author—When she is accused of murdering her boss, the detective on the case is her jilted high school flame.MIDSUMMER BRIDE by Nina Bruhns, NYT and USA Today bestselling author—Thrown into an international conspiracy, she learns a few Swedish customs that make for some sizzling hot foreign relations...STARS, LOVE AND PIROUETTES by Alicia Street, USA Today bestselling author—A mysterious stargazer and a TV star take a ballerina for the ride of a lifetime.IRISH EYES by Annie Jones, USA Today bestselling author—A soft-hearted social worker and an Interpol agent team up to track a kidnapped boy.",
  "genres": [],
  "author": "Donna Fasano",
  "average_rating": "3.96",
  "url": "https://www.goodreads.com/book/show/25541445-ten-brides-for-ten-hot-guys"
}