{
  "title": "The Age of Clinton: America in the 1990s",
  "description": "The 1990s was a decade of extreme change. Seismic shifts in culture, politics, and technology radically altered the way Americans did business, expressed themselves, and thought about their role in the world. At the center of it all was Bill Clinton, the talented, charismatic, and flawed Baby Boomer president and his controversial, polarizing, but increasingly popular wife Hillary.Although it was in many ways a Democratic Gilded Age, the final decade of the twentieth century was also a time of great anxiety. The Cold War was over, America was safe, stable, free, and prosperous, and yet Americans felt more unmoored, anxious, and isolated than ever. Having lost the script telling us our place in the world, we were forced to seek new anchors. This was the era of glitz and grunge, when we simultaneously relished living in the Republic of Everything even as we feared it might degenerate into the Republic of Nothing. Bill Clinton dominated this era, a man of passion and of contradictions both revered and reviled, whose complex legacy has yet to be clearly defined.In this unique analysis, historian Gil Troy examines Clinton's presidency alongside the cultural changes that dominated the decade. By taking the '90s year-by-year, Troy shows how the culture of the day shaped the Clintons even as the Clintons shaped it. In so doing, he offers answers to two of the enduring questions about Clinton's legacy: how did such a talented politician leave Americans thinking he accomplished so little when he actually accomplished so much? And, to what extent was Clinton responsible for the catastrophes of the decade that followed his departure from office, specifically 9/11 and the collapse of the housing market?",
  "genres": [
    "History",
    "Nonfiction",
    "Politics",
    "Biography",
    "American History"
  ],
  "author": "Gil Troy",
  "average_rating": "3.48",
  "url": "https://www.goodreads.com/book/show/25560170-the-age-of-clinton"
}