{
  "title": "Montana Rescue",
  "description": "A clean historical western cowboy romance novel about a mail order bride.  Echo Canyon Brides: Book 1  Josie Bainbridge has watched all of her friends get married and despairs ever finding a husband—especially because her home city of Pullman, Washington has too many women and not enough men. It becomes clear that if she’s ever going to find a man of her own, she’s going to have to look elsewhere. Josie begins scouring the personal advertisements, hoping to find the man of her dreams. When she comes across one for a Montana sheriff, she thinks she just might have found him. In 1890, Echo Canyon, Montana, is on the verge of extinction. The gold rush has moved elsewhere along with many of its citizens, including most of the available women. Those who are left are diehards who refuse to leave their hometown. With Echo faced with an uncertain future, a few loyal townspeople create an unusual plan to turn things around in Echo and keep it on the map. It seems simple: if they can increase their population it will keep their businesses alive and Echo will survive. They decide that mail-order-brides are the best way to make their plan a success. But who will be the first gentleman to order a bride? After a shocking incident in Echo, Sheriff Evan Taft reluctantly decides to step up and give it a whirl. If he can secure a bride, maybe other men will follow him in finding their own wives. Evan embarks on finding the perfect wife, but can it be done? Evan has been burned in the past and he doesn’t want to repeat the experience. Even more than he wants to keep from losing Echo, he doesn’t want to lose his heart only for it to be crushed again. Strife and evil forces accompany his search for true love. Will he succeed? The fate of Echo could very well depend on it.",
  "genres": [
    "Historical Romance",
    "Westerns",
    "Historical",
    "Western Romance",
    "Romance",
    "Mail Order Brides",
    "Amazon"
  ],
  "author": "Linda Bridey",
  "average_rating": "4.31",
  "url": "https://www.goodreads.com/book/show/25552805-montana-rescue"
}