{
  "title": "Rendering Unto Caesar: Was Jesus a Socialist?",
  "description": "“Rendering Unto Was Jesus a Socialist?” tackles head-on a persistent myth that has stymied individual freedom in many parts of the world. That myth takes many forms but reduces to “You can’t be for capitalism or free markets and be a follower of Jesus at the same time; Jesus, after all, was a socialist or would at least be supportive of policies that redistribute income through government.” For the first time in a short and readable form, Foundation for Economic Education (FEE) president Lawrence W. Reed debunks these misconceptions in powerful, convincing ways. Though he frequently references Scripture, Reed makes it plain at the start that one doesn’t have to be a Christian to understand the importance of proper interpretation of Scripture, as well as history and economics. People who simply want sound analysis or good history will appreciate it even if they have no faith. By examining the words of Jesus in the context of their time and place, Reed shows Jesus never called for the political process to rearrange wealth. He denounced envy. He stressed choice, accountability and private property. He endorsed keeping one’s word and honoring contracts. He emphasized principles of personal character and the Golden Rule. These things are all difficult to reconcile with political force. Now, when anyone suggests that the teachings of Jesus are in any way incompatible with free markets or capitalism, defenders of free markets can provide concise and conclusive responses. There is no other publication that does the job as fully or as accessibile as “Rendering Unto Caesar.\" Lawrence W. (\"Larry\") Reed became president of the Foundation for Economic Education (FEE) in 2008. Prior to becoming FEE's president, he served for twenty years as president of the Mackinac Center for Public Policy in Midland, Michigan. He also taught economics full-time from 1977 to 1984 at Northwood University in Michigan and chaired its Department of Economics from 1982 to 1984. A champion for liberty, Reed has authored over 1,000 newspaper columns and articles, dozens of articles in magazines and journals in the United States and abroad. The Foundation for Economic Education (FEE) is the premier source for understanding the humane values of a free society, and the economic, legal, and ethical principles that make it possible. At FEE, you’ll be connected with people worldwide who share those values and are inspired by the dynamic ideas of free association, free markets, and a diverse civil society. Explore freedom’s limitless possibilities through seminars, classroom resources, social media, and daily content at FEE.org. Learn how your creativity and initiative can result in a prosperous and flourishing life for yourself and the global community. Whether you are just beginning to explore entrepreneurship, economics, or creating value for others or are mentoring others on their journeys, FEE has everything you need. FEE is supported by voluntary, tax-deductible contributions from individuals, foundations, and businesses who believe that it is vital to cultivate a deep appreciation in every generation for individual liberty, personal character, and a free economy. Supporters receive a subscription to FEE's flagship magazine, the Freeman, also available at FEE.org.",
  "genres": [
    "Economics",
    "Politics",
    "Religion"
  ],
  "author": "Lawrence  W. Reed",
  "average_rating": "4.22",
  "url": "https://www.goodreads.com/book/show/25556060-rendering-unto-caesar"
}