{
  "title": "The Kingdom of Keys",
  "description": "Sixteen year old Toby Pierce is lost, disillusioned and just not happy with the path his life has taken ever since circumstances, four years earlier, changed the course of everything he knew as normal. While his friends look with anticipation towards the future and the enigmatic shadow of adulthood looming on the horizon, Toby could care less about...well, about anything. That is until he discovers the key...\"always the key\"...to the mysterious Door to Nowhere, a perpetually locked, never used, sealed doorway, tucked in the corner of his room.  At first, wary of the odd key’s sudden appearance and peculiar sparkle, Toby tries to put it all out of his mind. However, a strange prophetic dream compels him to confront the key and, with the semi-unflagging support of his two best friends - Billy Bartles, the resident jock and do-no-wrong-whatever- he-does kind of guy, and Lori, his best buddy since kindergarten, who is starting to become more than just a buddy - Toby unlocks the \"Door to Nowhere\". An explosive reception soon follows as the trio is swept away to the magical Kingdom of Keys, where Toby chooses to follow the path of the Doors.  There, in a series of fantastic meetings - with a familiar painter, who creates wonderful impressions of stars in the night; an eccentric writer, who lives alone in the woods, in a small house by a well-known pond; and a troubled Folk Singer from the sixties, who at one time, used his voice to sing for those who lacked the courage to speak for themselves - Toby learns the secret of the seed...the heart...the soul...the passion...the mind...and most of all, how simple it all really is...if he just has the faith to allow it to be….  Action, adventure, fantasy, humor, villains, heroes, Kings, Queens, strange creatures from an enchanted land and a multitude of laser blasts; these are the fundamental elements of The Kingdom of Keys. But, more importantly, woven within is an insightful message designed to encourage young minds - and even some older ones - to choose the path in life most in harmony with, not only their intellect, but also their heart and their soul....",
  "genres": [],
  "author": "Brian  Moloney",
  "average_rating": "4.44",
  "url": "https://www.goodreads.com/book/show/25553775-the-kingdom-of-keys"
}