{
  "title": "Logan's Need",
  "description": "alternate cover edition of ASIN B00XTQ9NBO“I feel like I’ve been wearing blinders for my entire life and now they’ve been ripped off and everything’s too bright – too harsh. Part of me wants them back so I only have to see what’s right in front of me.” --Logan  After Logan Bradshaw’s dreams go up in smoke, he’s left broken and haunted by a cruel betrayal from his former business partner, a man he once thought of as a friend. His life as a professional escort helped pay for his future once, so maybe a few more jobs can give him back what he’s lost. And if that means being a third for one night for a wealthy couple living out a ménage fantasy, then so be it. It might just be the final payout he needs to get his life back on track.  Dominic Barretti has everything money can buy, but it can’t save his beautiful young wife as cancer steals her away from him. He also can’t deny her one last request – a ménage encounter with another man. It’s the perfect excuse to meet the man who’s been haunting his dreams. On paper, Logan is the perfect choice to give his wife what she needs, but he doesn’t expect his own fierce desires to flare up when the young man enters their lives.  Dom and Logan don’t know it, but Sylvie Barretti has decided to play matchmaker from beyond the grave. Unfortunately, getting two broken men to find each other makes dying seem like the easy part.  Logan can’t deny his attraction to Dom, but the surprise desire for another man has left him reeling and questioning everything he’s ever known about himself. But when a threat from the past surfaces, will Logan be able to let go of the life he knew and embrace the one he needs? Note: This book contains M/M sexual content and is intended for mature audiences.",
  "genres": [
    "M M Romance",
    "Romance",
    "Contemporary",
    "Gay For You",
    "LGBT",
    "Audiobook",
    "Erotica"
  ],
  "author": "Sloane Kennedy",
  "average_rating": "4.26",
  "url": "https://www.goodreads.com/book/show/25557476-logan-s-need"
}