{
  "title": "Among the Ten Thousand Things",
  "description": "NEW YORK TIMES BESTSELLER NAMED ONE OF THE BEST BOOKS OF THE YEAR BY SAN FRANCISCO CHRONICLE AND THE HUFFINGTON POST Features an exclusive conversation between Julia Pierpont and Lena DunhamFor fans of Jennifer Egan, Jonathan Franzen, Lorrie Moore, and Curtis Sittenfeld, Among the Ten Thousand Things is a dazzling first novel, a portrait of an American family on the cusp of irrevocable change, and a startlingly original story of love and time lost. Jack Shanley is a well-known New York artist, charming and vain, who doesn’t mean to plunge his family into crisis. His wife, Deb, gladly left behind a difficult career as a dancer to raise the two children she adores. In the ensuing years, she has mostly avoided coming face-to-face with the weaknesses of the man she married. But then an anonymously sent package arrives in the a cardboard box containing sheaves of printed emails chronicling Jack’s secret life. The package is addressed to Deb, but it’s delivered into the wrong her children’s. With this vertiginous opening begins a debut that is by turns funny, wise, and indescribably moving. As the Shanleys spin apart into separate orbits, leaving New York in an attempt to regain their bearings, fifteen-year-old Simon feels the allure of adult freedoms for the first time, while eleven-year-old Kay wanders precariously into a grown-up world she can’t possibly understand. Writing with extraordinary precision, humor, and beauty, Julia Pierpont has crafted a timeless, hugely enjoyable novel about the bonds of family life—their brittleness, and their resilience. Praise for Among the Ten Thousand Things“A luscious, smart summer novel . . . by a blazingly talented young author.”—The New York Times Book Review   “This book is one of the funniest, and most emotionally honest, I’ve read in a long time.”—Jonathan Safran Foer  “Obsessively compelling . . . emotionally sophisticated . . . Among the Ten Thousand Things rises above [other novels] for its imagined structure, sentence-by-sentence punch, and pure humanity.”—Vanity Fair  “Gripping . . . Pierpont brings this family of four to life in sharply observed detail. . . . An acute observer of social comedy, Ms. Pierpont has a keen eye for the absurd.”—The Wall Street Journal   “Pierpont’s language is heart-stopping. . . . Between Pierpont’s literary finesse and her captivating characters, [Among the Ten Thousand Things] reads like a page-turner.”—Entertainment Weekly ( A)   “A twisty, gripping story—that packs an emotional wallop.”— The Oprah Magazine“There are going to be as many ingenious twists and turns in this literary novel as there are in a top-notch work of suspense like Gone Girl.”—Maureen Corrigan, NPR’s Fresh Air“Tender, delicately perceptive . . . Pierpont’s voice is wry and confident, and she is a fine anthropologist of New York life.",
  "genres": [
    "Fiction",
    "Literary Fiction",
    "Book Club",
    "Audiobook",
    "Contemporary",
    "New York",
    "Marriage"
  ],
  "author": "Julia Pierpont",
  "average_rating": "2.82",
  "url": "https://www.goodreads.com/book/show/25554084-among-the-ten-thousand-things"
}