{
  "title": "Rabbit in the Moon",
  "description": "According to Chinese folklore, there is a rabbit in the moon pounding on the elixir of life.Shanghai, May 3, 1949—A city on the edge in a time of tremendous unrest. For most, Communism brings new hope; but for Dr. Ni-Fu Cheng, Communism is no better nor worse than any other system, and only modern science will truly enable the Chinese people to compete with the outside world. On the verge of a stupendous scientific discovery, Dr. Cheng never fears for his safety, and he cannot leave China—not yet. But he will not take a chance with his only daughter, Su-Wei: she has to live. As Dr. Cheng sends Su-Wei to live in America, his heart aches. Don’t worry about me, he thinks. I am the rabbit in the moon. No one will hurt me. Not as long as I can find the secret…San Francisco, 1989—Forty years after Mao and his People’s Liberation Army set out to change China forever, Dr. Lili Quan begins a journey that will change her life forever. In her 27 years, Lili had rarely thought of herself as anything other than an American. But to honor her mother’s dying wish that Lili “return home,” Lili reluctantly sets out for China.On this extraordinary trip filled with remarkable discoveries, Lili finds her grandfather, Dr. Ni-Fu Cheng, a man she believed had died years ago. But Dr. Cheng had made the most remarkable discovery of all—he discovered the secret to long life.Dr. Cheng shares his knowledge with Lili, unknowingly putting her in danger. As greedy and unscrupulous men vie for control of the most earth-shattering discovery of the century, Lili will become a pawn in a deadly international game.From California, to Hong Kong, to Macao, to Seoul, to mainland China, the race is on for the ultimate prize—the rabbit in the moon.",
  "genres": [
    "Fiction",
    "Historical Fiction",
    "Thriller",
    "Mystery",
    "China",
    "Historical",
    "Suspense"
  ],
  "author": "Deborah Shlian",
  "average_rating": "3.57",
  "url": "https://www.goodreads.com/book/show/2556386.Rabbit_in_the_Moon"
}