{
  "title": "The Undertaker",
  "description": "Curiosity can kill more than cats, but when Pete Talbott found himself at the wrong end of Gino Parini's .45 reading his own obituary, it was a mystery he couldn't leave alone. From the cornfields of Ohio to the gritty slums of Chicago, a bloody kitchen in a Back Bay townhouse, New York's Washington Square, and the nation's Capitol itself, the hunt is on. Someone with a penchant for sharp scalpels and embalming tables is planting bodies under other people's names, and if Talbott doesn't stop them, he and his quirky new girlfriend Sandy Kasmarek will be next on the Undertaker's list. Reviewer Comments on the Author's earlier novels:The New Yorker: \"A thriller in the purest cliffhanger vein . . . Mr. Brown's technique is flawless.\"Publisher's Weekly: \"Writing in the vein of Forsythe and Follett, Brown has produced a fast paced thriller . . . \"Worldwide Library: \"William F. Brown has written a mesmerizing tale . . . making the unlikely seem all too real . . . explosive, fast paced action.\" The Orlando Sentinel: \"Brown's novel is a rainy-day adventure with each chapter ending with a cliff-hanging ending.\" The Newport News VA Daily Press: \"A thrilling tale of espionage. His novel never stands still for a second . . . An espionage thriller about a Cairo missile crisis you'll want to read right through in one sitting . . . Brown ought to start writing the film script now.\" The Virginia Gazette: \"It's the stuff of a real good read.\"McNaughton Book Service: \"Tightly plotted suspense in a fast-paced terrorist thriller.\"South Bend Tribune: \"An exceptional book of adventure, intrigue and history... strong figures . . . a well-constructed, powerful story that predicts certain Armageddon.\" Richmond Times Dispatch: \"Author hits the mark with his first novel.\"",
  "genres": [
    "Mystery",
    "Fiction",
    "Thriller",
    "Romance",
    "Amazon",
    "Mystery Thriller",
    "Romantic Suspense"
  ],
  "author": "William F.    Brown",
  "average_rating": "4.04",
  "url": "https://www.goodreads.com/book/show/11578737-the-undertaker"
}