{
  "title": "Heaven Sent 2",
  "description": "They're back!\" The members of the band \"Heaven Sent\" are back in the sequel to \"Heaven Sent: Heaven and Purgatory.\" \"Heaven Sent: Hell\" Heaven Sent gets a hell of new keyboardist with a name to match. Hell Witting is an amazing musician and proves to be the answer to a sound that the band was missing. With lavender hair and big violet eyes, he captivates Brent Rose from the start, and not just with his music.  Brent knows better than to get involved with a member of the band. That just invites trouble and the last thing he wants is trouble for Heaven Sent. So he'll just keep the attraction to himself. Doesn't matter anyway. Hell couldn't possibly want him. After all, Brent's not gorgeous and flashy like the other members of the band.  When Hell makes his interest in Brent all too obvious, Brent is unprepared...and unable...to stay away. \"Heaven Sent: Faith\"  Darien's best friends are the other guys in the rock band Heaven Sent. The three-now four-of them are closer than brothers to him and he's happy that they've all found their life mates. He is. He doesn't at all mind that each of those life mates are men. He doesn't.  In fact, that's just it. Maybe there's something to this gay stuff. He's never been particularly interested before, but after a short, failed marriage, he's willing to open himself up to new possibilities. Especially if one of those possibilities is the gorgeous lawyer who handled his divorce, Christopher Faith.  Trouble is, Chris doesn't seem to want to believe that Darien's serious. Well, sure, Darien's never slept with a guy before, but he's allowed to change his mind. Isn't he? \"Publisher's Note: This book is a male-male love story and contains homoerotic sex acts that may be offensive to some readers.",
  "genres": [
    "M M Romance",
    "Erotica",
    "Romance",
    "Category Romance",
    "Contemporary Romance",
    "M M Contemporary",
    "Yaoi"
  ],
  "author": "Jet Mykles",
  "average_rating": "4.40",
  "url": "https://www.goodreads.com/book/show/2556404.Heaven_Sent_2"
}