{
  "title": "Flying With The Winged Elephant - Niche Opportunities for Global Businesses that may emerge in India",
  "description": "Narendra Modi, now India’s Prime Minister, said in a speech during his election campaigning in 2014 that he believed the 21st century could be India’s century. What better time for a book detailing some business themes that may emerge in India which could benefit international investors? Such a book is “Flying with the Winged Elephant - Niche Opportunities for Global Businesses that May Emerge in India\".The purpose behind this is to identify some of the niche opportunities that might emerge in an evolving and reviving India. For global businesses, the benefits might include increased demand for their specialized services, investments into high-growth pools of opportunity in India, demand for intellectual capital and manufactured inputs, ability to develop products more relevant for India’s cultural specificities, etc., and for India, the benefits might include business and income opportunities, creation of future assets to assist its growth story, deepening of domestic and export capabilities, and a fill-up to overall employment and entrepreneurship. Some of the opportunities mentioned are conventional ideas, but some might be unconventional, but not unreasonable. Many ideas relate to European and North American small businesses, but it is these very small businesses that can become large in a growth economy and help expand and diversify the corporate base. India’s journey following the 1990s reforms saw several such examples.India has often been characterized by the ‘Elephant’ vis-à-vis ‘Dragon’ for China. India’s evolving socio-economic profile, coupled with expectations of revival, can create niche opportunities for businesses worldwide. They can boost growth and help the elephant to race ahead, hence the usage of ‘Wings’. The usage of ‘Flying’ is to convey to global businesses that they could benefit from this growth, by actively partnering in these opportunities.Tag: India, Opportunities, Business, Global, Money, Book, Finance, Modi, Investment, Investors, Growth, Stock Market",
  "genres": [],
  "author": "Sourajit Aiyer",
  "average_rating": "4.80",
  "url": "https://www.goodreads.com/book/show/25574186-flying-with-the-winged-elephant---niche-opportunities-for-global-busines"
}