{
  "title": "Denial of Conscience",
  "description": "*Adventure... Exotic... Romance... Danger...Passion* Inspired by Jane Austen's most alluring romantic couple, this modern adventure stars adaptations of characters from Pride and Prejudice and her other novels.Fitzwilliam Darcy is steel, rock-n-roll, and Tennessee whiskey. Elizabeth Bennet is orchids, opera, and peaches with cream. Thrown together they are physically and emotionally charged TNT, ready to explode!Elizabeth Bennet, a young woman hiding from living life to its fullest, finds herself willing to accept an untenable marriage arrangement solely for the sake of achieving her father's selfish aspiration to save the family's historic home. But even duty and obligation fail to hinder her inner conscience from spurring her to leave - to run - to escape before it's too late. Prompted by a cataclysmic event and the arrival of an attractive, enigmatic man, Liz is thrust into a dangerous liaison where her spirit learns to fly amidst international intrigue.Fitzwilliam Darcy was born into the wealth of Northern Virginia's world of refinement and competitive polo. When a horrific family event rocks his world and shatters his trust in women, he leaves everything behind, determined to never look back. Running from his past and the man he once was, he enters a world of danger, first as a Navy SEAL, then as a government-sanctioned assassin. After thirteen years fortified by his hurt and anger, carrying a career moniker \"The Iceman,\" Darcy finds he still can't avoid his own conscience - beckoning him home to Pemberley, its demons and the man he was meant to be. Fate steps in when a beautiful woman suddenly appears at the end of his deadly rifle scope and he chooses not to take his signature kill shot.Experience adventure, lust, and danger as we burn rubber on the back of Darcy's motorcycle through Washington, D.C. and Mount Vernon, Virginia. We'll fly with our hero and heroine to play roulette in Monte Carlo and take the bullet train to Seville to tango in the moonlight. The island of Capri invites us to indulge before our final stop, Marrakech, Morocco where the exotic city of Arabian Nights brings us to our thrilling climax. Will this seemingly mismatched pair find the peace and the life they were both meant to live? Will \"conscience\" win out with Liz & Darcy finding happiness in one another's arms? As Darcy would say, \"Don't be afraid. Get on... let's ride.\"Authors Note: Jane Austen wrote such wonderful characters, I borrowed their names and some of their characteristics to tell my own tale of hard-won, contemporary love.BE ADVISED: This story contains explicit sexual scenes.",
  "genres": [
    "Romance",
    "Adventure",
    "Contemporary Romance",
    "Romantic Suspense",
    "Retellings"
  ],
  "author": "Cat Gardiner",
  "average_rating": "4.11",
  "url": "https://www.goodreads.com/book/show/25569077-denial-of-conscience"
}