{
  "title": "Pawpaw: In Search of America's Forgotten Fruit",
  "description": "The largest edible fruit native to the United States tastes like a cross between a banana and a mango. It grows wild in twenty-six states, gracing Eastern forests each fall with sweet-smelling, tropical-flavored abundance. Historically, it fed and sustained Native Americans and European explorers, presidents, and enslaved African Americans, inspiring folk songs, poetry, and scores of place names from Georgia to Illinois. Its trees are an organic grower’s dream, requiring no pesticides or herbicides to thrive, and containing compounds that are among the most potent anticancer agents yet discovered.So why have so few people heard of the pawpaw, much less tasted one? In Pawpaw, author Andrew Moore explores the past, present, and future of this unique fruit, traveling from the Ozarks to Monticello; canoeing the lower Mississippi in search of wild fruit; drinking pawpaw beer in Durham, North Carolina; tracking down lost cultivars in Appalachian hollers; and helping out during harvest season in a Maryland orchard. Along the way, he gathers pawpaw lore and knowledge not only from the plant breeders and horticulturists working to bring pawpaws into the mainstream (including Neal Peterson, known in pawpaw circles as the fruit’s own “Johnny Pawpawseed”), but also regular folks who remember eating them in the woods as kids, but haven’t had one in over fifty years.As much as Pawpaw is a compendium of pawpaw knowledge, it also plumbs deeper questions about American foodways―how economic, biologic, and cultural forces combine, leading us to eat what we eat, and sometimes to ignore the incredible, delicious food growing all around us. If you haven’t yet eaten a pawpaw, this book won’t let you rest until you do.",
  "genres": [
    "Food",
    "Nonfiction",
    "Nature",
    "History",
    "Gardening",
    "Science",
    "Plants"
  ],
  "author": "Andrew Moore",
  "average_rating": "3.81",
  "url": "https://www.goodreads.com/book/show/25570982-pawpaw"
}