{
  "title": "Gemini",
  "description": "A marvel of storytelling and historical imagination, Gemini just may be Dorothy Dunnett's pièce de résistance. This culminating installment of the House of Niccolò series is set in Scotland in 1477--and more specifically, in the world of international trade and commerce, which can deal fatal blows to those unfamiliar with its intricacies. When Nicholas de Fleury returns to Edinburgh after a four-year absence, speculation runs rampant about why he closed all his ventures in Scotland and deserted his friends. Struggling to fend off various assassination attempts, Nicholas rejoins the fledgling court of young King James III. Yet he soon discovers that the squabbles between the monarch and his double-dealing siblings are no less dangerous than the intrigues he has left behind. Dunnett recounts the whole story with typically ornate and pungent prose, and delineates her massive cast of characters with a Holbein-like attention to physical detail.Nicholas in particular is a splendidly rounded creation. And by placing him at the center of her sprawling narrative, Dunnett helps us to navigate the many convolutions of the plot. Her female characters, too, are distinctive. However, it is the sheer breadth of Dunnett's ambitions that takes the breath away, along with her exhilarating set The sword point bit into his cloak and grated across the cuirass underneath, bringing the swordsman close for a moment, his face blank with surprise. Nicholas kicked him under the chin, so that he blundered back and hit someone else, while Nicholas dragged out his own sword. The horse wasn't his, but it was a powerful beast and alarmed enough to be ready to rear. Nicholas wrapped the reins around one wrist and hauled, using the bit to drag the horse threshing onto its haunches, and then allowing it to plunge forward again.En garde, Dunnett fans! Those who have made the long trek with our sword-brandishing hero will find this a perfectly orchestrated finale. --Barry Forshaw",
  "genres": [
    "Historical Fiction",
    "Historical",
    "Fiction",
    "Scotland",
    "Adventure",
    "Romance",
    "Audiobook"
  ],
  "author": "Dorothy Dunnett",
  "average_rating": "4.50",
  "url": "https://www.goodreads.com/book/show/1158037.Gemini"
}