{
  "title": "Where the Bodies Were Buried: Whitey Bulger and the World that Made Him",
  "description": "The New York Times bestselling author of The Westies and Paddy Whacked offers a front-row seat at the trial of Whitey Bulger, and an intimate view of the world of organized crime—and law enforcement—that made him the defining Irish American gangster.For sixteen years, Whitey Bulger eluded the long reach of the law. For decades one of the most dangerous men in America, Bulger—the brother of influential Massachusetts senator Billy Bulger—was often romanticized as a Robin Hood-like thief and protector. While he was functioning as the de facto mob boss of New England, Bulger was also serving as a Top Echelon informant for the FBI, covertly feeding local prosecutors information about other mob figures—while using their cover to cleverly eliminate his rivals, reinforce his own power, and protect himself from prosecution. Then, in 2011, he was arrested in southern California and returned to Boston, where he was tried and convicted of racketeering and murder.Our greatest chronicler of the Irish mob in America, T. J. English covered the trial at close range—by day in the courtroom, but also, on nights and weekends, interviewing Bulger’s associates as well as lawyers, former federal agents, and even members of the jury in the backyards and barrooms of Whitey’s world. In Where the Bodies Were Buried, he offers a startlingly revisionist account of Bulger’s story—and of the decades-long culture of collusion between the Feds and the Irish and Italian mob factions that have ruled New England since the 1970s, when a fateful deal left the FBI fatally compromised. English offers an authoritative look at Bulger’s own understanding of his relationship with the FBI and his alleged immunity deal, and illuminates how gangsterism, politics, and law enforcement have continued to be intertwined in Boston.As complex, harrowing, and human as a Scorsese film, Where the Bodies Were Buried is the last word on a reign of terror that many feared would never end.",
  "genres": [
    "True Crime",
    "Nonfiction",
    "History",
    "Crime",
    "Biography",
    "American History",
    "Audiobook"
  ],
  "author": "T.J. English",
  "average_rating": "3.74",
  "url": "https://www.goodreads.com/book/show/25577198-where-the-bodies-were-buried"
}