{
  "title": "De Kooning: An American Master",
  "description": "Willem de Kooning is one of the most important artists of the twentieth century, a true “painter’s painter” whose protean work continues to inspire many artists. In the thirties and forties, along with Arshile Gorky and Jackson Pollock, he became a key figure in the revolutionary American movement of abstract expressionism. Of all the painters in that group, he worked the longest and was the most prolific, creating powerful, startling images well into the 1980s.The first major biography of de Kooning captures both the life and work of this complex, romantic figure in American culture. Ten years in the making, and based on previously unseen letters and documents as well as on hundreds of interviews, this is a fresh, richly detailed, and masterful portrait. The young de Kooning overcame an unstable, impoverished, and often violent early family life to enter the Academie in Rotterdam, where he learned both classic art and guild techniques. Arriving in New York as a stowaway from Holland in 1926, he underwent a long struggle to become a painter and an American, developing a passionate friendship with his fellow immigrant Arshile Gorky, who was both a mentor and an inspiration. During the Depression, de Kooning emerged as a central figure in the bohemian world of downtown New York, surviving by doing commercial work and painting murals for the WPA. His first show at the Egan Gallery in 1948 was a revelation. Soon, the critics Harold Rosenberg and Thomas Hess were championing his work, and de Kooning took his place as the charismatic leader of the New York school—just as American art began to dominate the international scene.Dashingly handsome and treated like a movie star on the streets of downtown New York, de Kooning had a tumultuous marriage to Elaine de Kooning, herself a fascinating character of the period. At the height of his fame, he spent his days painting powerful abstractions and intense, disturbing pictures of the female figure—and his nights living on the edge, drinking, womanizing, and talking at the Cedar bar with such friends as Franz Kline and Frank O’Hara. By the 1960s, exhausted by the feverish art world, he retreated to the Springs on Long Island, where he painted an extraordinary series of lush pastorals. In the 1980s, as he slowly declined into what was almost certainly Alzheimer’s, he created a vast body of haunting and ethereal late work.This is an authoritative and brilliant exploration of the art, life, and world of an American master.",
  "genres": [
    "Art",
    "Biography",
    "Nonfiction",
    "Art History",
    "Biography Memoir",
    "History",
    "20th Century"
  ],
  "author": "Mark  Stevens",
  "average_rating": "4.13",
  "url": "https://www.goodreads.com/book/show/2557.De_Kooning"
}