{
  "title": "Falling Series Boxed Set",
  "description": "Falling into Temptation:Victoria Colletti: Gabriel Maddox was dangerous. I knew it the moment I laid eyes on him. A wealthy playboy with a reputation that preceded him, you could hear it whispered from the tongues of every socialite in New York City. He was known to take pleasure in dominating those around him, and when I crashed into him on the street, he made it very clear he wanted to dominate me. It was the last thing that I needed, and yet it awakened an urge within me I didn’t know how to resist. It was a recipe that could only lead to disaster. Because you see, I lived my life by a very simple set of rules. Don’t get noticed. Don’t get attached. And most importantly, never stay in the same place for too long. You might say that I had more skeletons in my little suitcase than most people had in their entire closet. So what should a girl like me do when I run into a man like Gabriel? Run as fast and as far as I can. Except, I didn’t want to run. Not this time. He made me a proposition. One that was too good to refuse. But the longer I spent with him, the more I saw the vulnerable parts that he had hidden away. He was pulling me closer, tempting my resolve. But it didn’t change anything between us… it couldn’t. The people in my life could only ever be temporary. And whether I liked it or not, Gabriel was no exception to that rule. Falling into Exposure:The second installment in the Falling Series. Gabriel Maddox: Victoria says she has to leave. But I need her to stay. She’s asleep. In my arms. And I’m holding her, stroking her, silently hating myself for what she’s turning me into. I never expected to feel this way about someone. I never expected that there was one thing that she would never submit to, and that’s a future with me. Things are getting too complicated between us. Too many secrets, too many lies. I know she’s hiding something, but the more I push, the farther she pulls away. I don’t know how much longer this tether between us can hold. So I’ve done something that I never do. I’ve opened myself up and bared my soul. I showed her my demons in a moment of weakness, and now I have to pay the price. Because if I’m wrong about her, she could destroy me. Falling into Surrender:When I moved to New York, I didn’t expect to fall in love. But the city that never sleeps has captured my heart, right along with Gabriel Maddox. Unfortunately, love can’t change my circumstances, and some things will always be out of my grasp. As the clock ticks down on my time with Gabriel, I will have to make a decision. A decision to stay and put his life in danger, or to leave the man that I love behind. But just when I think the choice is actually mine to make, fate steps in and shows me it has other plans. You can’t outrun the past forever, and mine has just caught up with me in the worst way. Not only could I lose Gabriel, but I could lose him for good.",
  "genres": [
    "BDSM",
    "Dark",
    "Romance",
    "Erotica",
    "Contemporary",
    "Contemporary Romance",
    "New Adult"
  ],
  "author": "A. Zavarelli",
  "average_rating": "4.08",
  "url": "https://www.goodreads.com/book/show/25575674-falling-series-boxed-set"
}