{
  "title": "Fortress Draconis",
  "description": "In an age of treachery and peril, a young thief may be the prophesied savior . . . or the betrayer of the world.Once one of the grandest of human cities, Yslin now has a dark heart known as the Dimandowns. And when Will, an orphaned young thief from the Dim, plots to prove himself to his master by stealing a prize from the exiled Elves who share the fetid slums, his theft of the strange artifact snares him in a web of prophecy.It also brings him together with Kedyn’s Crow, a shadowy human warrior, and Resolute, a Vorquelf determined to redeem his long-lost island home. To them, Will could be the fulfillment of a long-held dream and the last chance the world has to save itself from Chytrine, the northern tyrant who would be empress of the world.But their belief in Will finds few allies in a world torn by war and magick. Preoccupied with their own internecine struggles, the world’s leaders see Will as a pawn. Only Chytrine seems able to recognize Will’s destiny, and she sends her Dark Lancers to destroy him. For who better to destroy a hero than the ill-fated heroes of the previous generation, survivors of a failed war to exterminate Chytrine, now corrupted to her service?Yet even as Will is tested, a new generation takes up arms where their predecessors failed. Alexia, princess of a dead nation, leads an army to oppose Chytrine. And the sorcerers of Vilwan have fashioned their own hero, Kerrigan Reese, bestowing upon him powers and abilities no human has held for centuries.Together these heroes travel to the mysterious Fortress Draconis to stop Chytrine from stealing more fragments of the DragonCrown—a powerful artifact that, once in her control, will guarantee her dominion forever.",
  "genres": [
    "Fantasy",
    "Fiction",
    "Dragons",
    "High Fantasy",
    "Epic Fantasy",
    "Science Fiction Fantasy",
    "Novels"
  ],
  "author": "Michael A. Stackpole",
  "average_rating": "3.95",
  "url": "https://www.goodreads.com/book/show/255879.Fortress_Draconis"
}