{
  "title": "Get Busy Make Money: Putting Technology & Innovation To Work For You",
  "description": "A Step-by-step process to make money through the use of technology and cutting edge business strategies. Do you work for a business that you would like to help grow and make more profitable? Have you recently been laid off or experienced economic hardship and need to reinvent yourself? Then this business manual is for you! This book can help anyone get a job and make more money... regardless of background and experience levels. Instead of spending money online what if you could make money online? In this secret insider business manual there are amazing easy to use steps that will make any business grow and be much more profitable. Each step is broken down into do-able goals and actions you can take that are not complicated or technical. This manual can be used by anyone with any background to start and grow a business to profitability. The Get Busy Make Money book is not just a step by step guide to show recent graduates how to get a job or immediately get a promotion. The author used his background in computer software methodology to think of the common business problems and solutions in a logical, almost mathematical way. This book starts with how businesses are created in the Internet age and shows you how to start your own business and go all the way, step by step, to making money and creating a wealthy successful company that you can run continually and make lots of money with, or sell to the highest bidder at an enormous profit for yourself and your family. Includes Insider Secrets and Special Techniques Interviews and Interviewing Getting Customers Immediately Creating a Constant Flow of Customers Google Adwords- Get Paid-Per-Click When to Arrive at Meetings Search Engine Optimization How to Dress What to Think and Say in the Business World Who to Hire and Why This book lays out a step by step methodology to start a business, hire employees, market and sell products and services, and set up your business for ongoing success, all with the help of the latest computer software, hardware, and online solutions. This is a manual for anyone to become a business expert and make more money for themselves and any company they will ever work for. This timely gem of a book will inform readers of what it takes in the real world to become successful, and how to manage people and businesses through the use and support of technology.",
  "genres": [],
  "author": "Ian Seamus Finn",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/25580863-get-busy-make-money"
}