{
  "title": "I would, but my DAMN MIND won't let me: a teen girl's guide to understanding and controlling her thoughts and feelings",
  "description": "Do you believe that life is unfair or that change is impossible? Are you unhappy and frustrated with your life? If you answered yes, you’re not alone! Teen Confidence Expert, Jacqui Letran, is here to show you a quick and easy path to a happier, healthier life. You can learn to create permanent changes for the better!Your past can cause you to believe that making positive improvements requires a miracle. In Letran’s award-winning book, I would, but my DAMN MIND won’t let me!, you will learn the simple steps to overcome your obstacles and struggles. Once you understand how your mind works, you will have the knowledge and power to take control of your thoughts and feelings. The power to challenge your old negative patterns and create the exact life you want is in your hands.In this book, you will discover:How to challenge old negative beliefs and create positive new patternsHow to stay calm and in control of even the most difficult situationsHow to keep unhealthy thoughts at bay and replace them with positive onesHow to use the power of your mind to create the success you deserveHow to create positive life experiences and much, much more!I would, but my DAMN MIND won’t let me! is a groundbreaking guide to help you take control of your life. If you like real-life advice that works fast and doesn’t talk down to you, then you will love Jacqui Letran’s game-changing book for teens and young adults. This book is recommended for teens, parents of teens, professionals working with teens, and anyone who is interested in learning how to take control of their mind.Get the award-winning book today to give yourself an unfair advantage in life!",
  "genres": [
    "Parenting",
    "Self Help",
    "Mental Health",
    "Nonfiction",
    "Teen"
  ],
  "author": "Jacqui Letran",
  "average_rating": "4.13",
  "url": "https://www.goodreads.com/book/show/25583597-i-would-but-my-damn-mind-won-t-let-me"
}