{
  "title": "Accounting Made Simple: Basic Accounting principles for new managers, business owners or anyone who wants to get ahead",
  "description": "Cure your accounting phobia and get that job promotion when you understand accounting. Does your lack of financial knowledge limit your effectiveness as a manager or business owner? Would you like to know more about accounting but traditional accounting books bore you to death? Do you suffer from accounting phobia?Pay close attention if you said “yes” to any of these questions.Written in plain, easy to understand language, there is no need to fear accounting (or accountants) any more!Accounting is called the language of business and it is a necessary evil. Supervisors, managers, owners, lenders and investors need to know the financial condition of a business, the performance of the business and the cash flows of the business. Without accounting, there is no tool to understand the financial risks and benefits of a business. The good news is accounting can be explained in very easy to understand terms that will have you talking the language in no time at all. Accounting made Accounting principles for new managers, business owners or anyone who wants to get aheadDiscover all the following written in plain, easy to ready, everyday The accounting equation The big 3 financial statements - necessary for anyone in business 6 key financial ratios - calculate and interpret key financial ratios The 12 basic accounting principles agreed world wide The difference between a debit and a credit Finally understand what is meant by accrual accounting 15 common accounting terms in plain English The four steps to reading and interpreting an annual report Don't be alarmed - you won't be qualified to be an accountant at the end of this book! But you will finally understand what they are talking about.You will understand the basics of basics of accounting and participate in conversations about the financial performance and condition of a business. You will be able to read and interpret financial reports prepared by the accounting department.Who is this book for?New managers or supervisors with no knowledge of accounting principles Aspiring managers or supervisors Business owners, or those aspiring to own a business People who know very little about accounting and financial statements but feel they should Those who are bored to death by accounting texts Would you like to know more? Download and start building your accounting knowledge today.Scroll to the top of the page and select the buy button.",
  "genres": [
    "Money",
    "Business"
  ],
  "author": "Small Business Success Guide",
  "average_rating": "3.65",
  "url": "https://www.goodreads.com/book/show/25588073-accounting-made-simple"
}