{
  "title": "Surrendered to the Pack",
  "description": "*** This is a CLIFFHANGER short novella that is part of the serial, Wicked Wolf Shifters. This is NOT a full-length book. Parts must be read in order to enjoy the story. ***Wicked Wolf Shifters serial, Part 1Cassandra Wakefield's life is about to  change. College student and regular girl, she also comes from an  isolated mountain town that for centuries has been under the thrall of a very wicked pack of wolf shifters. If the insatiably hungry shifters don't get their annual female sacrifice, all hell will break loose on the town. This year, Cassie lost the draw. She's about to face down a magnificent pack of sexy alpha men. Despite her nervousness, she's undeniably intrigued...and deeply aroused. Steely-eyed yet magnetic alpha Trevor, outrageously hot, flirtatious Mac, and drop-dead gorgeous Finn, who has headlined her most secret fantasies for years now, await her.Pack Alpha Trevor Reginald doesn't do three things: drama, hysterics, or emotions. Pack dynamics are for drama, town surrenders tend to get annoyingly hysterical, andemotions--well, emotions are useless things for which Trevor reserves no time. He's here with his packmates for one reason only: to take the surrender's virginity and thus ensure his pack's continued healthy existence. But bringing the lovely Cassandra into the Wicked Mountain Wolf Pack stirs something in Trevor he hasn't felt in years. Something he will fight tooth and claw to resist before it overwhelms his reason and his very way of life ....Because Cassie and all the wolf shifters are in for a huge surprise - one that Cassie might not survive after she is surrendered to the pack.To the reader: This story contains hot sex with all the dirty details, naughty language, characters who say \"oh, hell yeah\" to the fun times, the potential edges of shifter violence, and yes, a cliffhanger. If that isn't your thing, this story probably won't be either. But if all that sounds great, this short piece of Sexy Shifter Smut is for you!coming soon in the Wicked Wolf Shifters serial:Part 2: Claimed by the PackPart 3: Taken by the PackPart 4: Mated to the Pack",
  "genres": [
    "Paranormal",
    "Shapeshifters",
    "Romance",
    "Paranormal Romance",
    "Fantasy",
    "Erotica",
    "Werewolves"
  ],
  "author": "Anna Craig",
  "average_rating": "3.74",
  "url": "https://www.goodreads.com/book/show/25579920-surrendered-to-the-pack"
}