{
  "title": "The Longest Night",
  "description": "In this absorbing and suspenseful debut novel—reminiscent of Revolutionary Road and inspired by a little-known piece of history—a young couple must fight to save both their marriage and the town they live in.   In 1959, Nat Collier moves with her husband, Paul, and their two young daughters to Idaho Falls, a remote military town. An Army Specialist, Paul is stationed there to help oversee one of the country’s first nuclear reactors—an assignment that seems full of opportunity.   Then, on his rounds, Paul discovers that the reactor is compromised, placing his family and the entire community in danger. Worse, his superiors set out to cover up the problem rather than fix it. Paul can’t bring himself to tell Nat the truth, but his lies only widen a growing gulf between them.   Lonely and restless, Nat is having trouble adjusting to their new life. She struggles to fit into her role as a housewife and longs for a real friend. When she meets a rancher, Esrom, she finds herself drawn to him, comforted by his kindness and company. But as rumors spread, the secrets between Nat and Paul build and threaten to reach a breaking point.    Based on a true story of the only fatal nuclear accident to occur in America, The Longest Night is a deeply moving novel that explores the intricate makeup of a marriage, the shifting nature of trust, and the ways we try to protect the ones we love.   Advance praise for The Longest Night   “In The Longest Night, Andria Williams demonstrates her masterly understanding of the painfully gorgeous intimacies of the human condition. The author’s thrilling storyline will keep you turning the pages, while her ability to inject a sharp dose of hope, fear, and desire into the most innocent of scenes will take you captive. I loved it.”—David R. Gillham, author of City of Women   “Andria Williams writes about the challenges and struggles faced by military families in a wholly original way. As a military spouse, Williams brings every nuance of this world to life, but it’s her brimming talent and startling insight into the fragility and tenacity of marriage that kept me glued to the page.”—Siobhan Fallon, author of You Know When the Men Are Gone   “Engrossing, witty, dynamic, and beautifully written, The Longest Night is a literary thrill ride. Andria Williams’s characters—particularly the 1960s military wives—are portrayed with extraordinary intimacy. This is a lovely, harrowing, and original novel. You will want to read it in a single night.”—Julie Schumacher, author of Dear Committee Members   “Andria Williams’s wonderful debut novel is a sobering yet inspiring portrait of human nature, with precisely rendered details about the early years of the nuclear power era.  With exceptional characterization, serious content, graceful structure, and a storyline as gripping as a psychological thriller, The Longest Night is both unforgettable and impossible to put down.”—Frederick Reiken, author of Day for Night \n \n “There is a kind of story about the American West that you think you know. And this book destabilizes it. Williams creates characters who challenge the protocols of the time, and are irradiated by the results.",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Book Club",
    "Literary Fiction",
    "Audiobook",
    "Adult Fiction",
    "Historical"
  ],
  "author": "Andria Williams",
  "average_rating": "3.67",
  "url": "https://www.goodreads.com/book/show/25590601-the-longest-night"
}