{
  "title": "My Soul To Wake",
  "description": "*** Warning: this novel is intended for those over 18 years of age due to its erotic nature and mature content. *** Witchcraft. Reincarnation. True love. These are the things of legend. Unexplained, some even say impossible… but nonetheless prevalent in stories and tales from all cultures and in every land from the beginning of time. What if there’s something to it? What if there is an explanation behind the mysteries and bedtime stories? Something beyond words?  SALEM, MASSACHUSETTES 1692  She was taken from him in the cruelest way... condemned, sentenced and punished out of fear of the unknown. How is he supposed to live without her? How can he go on knowing that in this life, they will never be one again? There's only one thing to do... only one option that will bring them together again.  SALEM , MASSACHUSETTES TODAY  Leah is taken on a weekend excursion with her best girlfriends to let loose, relax and have a little fun. What harm is there in a little vacation? It's not like the legends, the haunted history of the place can scare them away. It's all harmless fun.  Or so she thought.  Something seems familiar about the town. The trees, the winds, the feel of everything. Her ever present nightmares have become more intense within the limits of the old historical setting. She's prepared to write off the whole trip as nothing more than a case of her mind running away with the sensationalized magic here. When she meets a handsome stranger who's eager to know her in a way no one else can, she begins to think there just may be something more to this place, something more to him.  Will has been waiting, biding his time, and praying that she'll come back. He's broken the natural order of things to possibly find her again, weaving their way through the years until they can be together again. He knows he may never find her, but he can't risk not trying. This place calls to her, just as it did to him. It will bring her back home. It will bring her back to him.  What's 300 years when it comes to true love? He's prepared to wait an eternity if he has to, just to see her, hold her, make her his and to help her remember what was stolen from them so long ago. He’ll stop at nothing to make her remember who she is, the power she possesses, and the love they swore to each other.",
  "genres": [
    "Witchcraft"
  ],
  "author": "Tara Oakes",
  "average_rating": "4.55",
  "url": "https://www.goodreads.com/book/show/25596602-my-soul-to-wake"
}