{
  "title": "Losing the Signal: The Untold Story Behind the Extraordinary Rise and Spectacular Fall of BlackBerry",
  "description": "THE BASIS FOR IFC FILMS' BLACKBERRYNamed a Best Business Book by The Wall Street Journal, Forbes, Financial Times, and more The riveting, true story of the BlackBerry empire—and how it would eventually come crumbling down in the wake of the smartphone revolution\"One helluva story.” ―Toronto StarLosing the Signal is a riveting story of a company that toppled global giants before succumbing to the ruthlessly competitive forces of Silicon Valley. This is not a conventional tale of modern business failure by fraud and greed. The rise and fall of BlackBerry reveals the dangerous speed at which innovators race along the information superhighway. With unprecedented access to key players, senior executives, directors and competitors, Losing the Signal unveils the remarkable rise of a company that started above a bagel store in Ontario. At the heart of the story is an unlikely partnership between a visionary engineer, Mike Lazaridis, and an abrasive Harvard Business school grad, Jim Balsillie. Together, they engineered a pioneering pocket email device that became the tool of choice for presidents and CEOs. The partnership enjoyed only a brief moment on top of the world, however. At the very moment BlackBerry was ranked the world's fastest growing company internal feuds and chaotic growth crippled the company as it faced its gravest Apple and Google's entry in to mobile phones. Expertly told by acclaimed journalists, Jacquie McNish and Sean Silcoff, this is an entertaining, whirlwind narrative that goes behind the scenes to reveal one of the most compelling business stories of the new century.",
  "genres": [
    "Business",
    "Nonfiction",
    "Technology",
    "History",
    "Biography",
    "Audiobook",
    "Management"
  ],
  "author": "Jacquie McNish",
  "average_rating": "3.99",
  "url": "https://www.goodreads.com/book/show/25602451-losing-the-signal"
}