{
  "title": "The Companion",
  "description": "You are about to enter a world where there is no turning back. Where danger and desire become one. Where a man and a woman must face the darkest secrets of the night…though they may not survive what awaits them.The CaptiveIan Rufford was captured, enslaved, and then abandoned in the lonely dunes of Egypt’s desert. His tormentor was a woman of magnificent beauty…and the blackest of souls. Now, Ian prays for a death that will not come. Only after his rescue does he begin to realize how he has changed. He is carrying something strange in his blood known only as “The Companion,” and his new-found symbiotic partner will exact a terrible price in return for the gifts Ian is only beginning to understand.The DesireElizabeth Rochewell’s home was Egypt, where she traveled the desert organizing her father’s archeological expeditions. After her father’s death, however, she is sent home to live a conventional life in London. Onboard ship, she finds herself drawn to her mysterious fellow passenger, Ian Rufford. He awakens feelings in her that disturb and tantalize her senses. But he hides a shocking secret. Beth has spent her life unraveling the secrets of the desert. Little does she know how dangerous it will be to unravel Ian’s.The CompanionNow, journey with two linked souls who are determined to stop one woman’s evil; a journey that will take them to the heights of desire and the depths of depravity. The Companion is an unforgettable, sensual and erotic novel that will make you believe in the power of true love.This book was previously published by MacMillan/PanMcMillan/St. Martin's Press\"When it comes to combining extreme sensuality with dangerous drama, no one does it better than Squires.\" Romantic Times BOOKreviews",
  "genres": [
    "Romance",
    "Vampires",
    "Paranormal Romance",
    "Paranormal",
    "Historical",
    "Historical Romance",
    "Fantasy"
  ],
  "author": "Susan Squires",
  "average_rating": "3.54",
  "url": "https://www.goodreads.com/book/show/25601223-the-companion"
}