{
  "title": "Into the Americas",
  "description": "INTO THE AMERICAS (A novel based on a true story) is a gritty, real-life adventure based on one of history’s greatest survival stories. It was inspired by the diary entries of young English blacksmith John Jewitt during his time aboard the brigantine The Boston and also during his sojourn at Nootka Sound, on North America's western seaboard, from 1802 to 1805.Written by father-and-son writing team Lance & James Morcan (authors of The World Duology and The Orphan Trilogy), INTO THE AMERICAS is a tale of two vastly different cultures – Indigenous North American and European civilization – colliding head on. It is also a Romeo and Juliet story set in the wilderness.Nineteen year-old blacksmith John Jewitt is one of only two survivors after his crewmates clash with the fierce Mowachaht tribe in the Pacific Northwest. A life of slavery awaits John and his fellow survivor, a belligerent American sailmaker, in a village ruled by the iron fist of Maquina, the all-powerful chief. Desperate to taste freedom again, they make several doomed escape attempts over mountains and sea. Only their value to the tribe and John’s relationship with Maquina prevents their captors from killing them.As the seasons pass, John ‘goes Indian’ after falling in love with Eu-stochee, a beautiful maiden. This further alienates him from his fellow captive whose defiance leads to violent consequences. In the bloodshed that follows, John discovers another side to himself – a side he never knew existed and a side he detests. His desire to be reunited with the family and friends he left behind returns even stronger than before.The stakes rise when John learns Eu-stochee is pregnant. When a final opportunity to escape arises, he must choose between returning to civilization or staying with Eu-stochee and their newborn son.",
  "genres": [
    "Historical Fiction",
    "Historical",
    "Young Adult Romance",
    "Young Adult",
    "Adventure",
    "Action",
    "Romance"
  ],
  "author": "Lance Morcan",
  "average_rating": "4.29",
  "url": "https://www.goodreads.com/book/show/25600921-into-the-americas"
}