{
  "title": "Goodbye Self-Critical, Hello Self-Thrilled!: An Inspirational Tale of Healing and Empowerment",
  "description": "A Parable About the Spiritual Journey of Self-DiscoveryThis is a parable about living life from your natural talents and spiritual-intuitive guidance versus living through low self-esteem, the “should’s” of a comparative world, and the burial of your best unique self.As a young girl, Agatha starts out with a clear mind, open and vital to life. Guided by her inner compass, she loves her natural curiosities, and daily uses her spiritual talent, that of storytelling wherever she goes.But life happens as she hurt, pain, and danger. Agatha feels she is to blame, as most children do. She covers up what makes her unique and tries to fit in and buries her talent. As she goes into adult life she learns to \"Compare for self-worth, for then there will be none.\" (a quote from the parables antagonist, Conred, King of Comparison). Exterior guidance takes over, talent and intuition get stuffed and her adult life is flat and small.One bright light is her daughter, Zeal, whom she creates from a loveless marriage. Through fear of her daughter’s life and talent also being threatened by Conred, Agatha has to face him. How on earth can she get her confidence back to do this? She finds out, and this changes her small unfulfilled life forever.This parable shows you how to reactivate your intuitive guidance and natural talent that has been buried because of fear and thoughts of unworthiness. Readers are encouraged to invite their demons and dark thoughts in to learn where they came from, talk with them, laugh with them, and walk them out the door.With themes including dyslexia, divorce, rape, weight issues, unique talents, mothering, and career, author Joyce Anderson offers a safe way to look at your own hurt life through the life of Agatha's and this parable.Begin reading Goodbye Self-Critical, Hello Self-Thrilled using Amazon’s “Look Inside” feature and order your Kindle or paperback copy today.",
  "genres": [],
  "author": "Joyce   Anderson",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/25593413-goodbye-self-critical-hello-self-thrilled"
}