{
  "title": "Elizabeth Warren: Understanding the Life and Teachings of Elizabeth Warren: Lawyer, Social Activist, Politician, and Defender of the American Middle Class",
  "description": "For a limited time, get this 1# Amazon bestseller for just $2.99. Regularly priced at $4.99. Read on your PC, Mac, smart phone, tablet or Kindle deviceA resident of Massachusetts, Democrat Elizabeth Warren is no stranger to the world of politics and lawmaking. In fact, she is a bonafide superstar in the world of diplomacy. Fierce and unflinching in her beliefs, Warren has spent much of her life teaching law and fighting, tooth and nail, for middle class Americans. She earned the respect of millions of people for her ability to lead, communicate, and get things done in the face of hard choices and aggressive competition. The respect, success, and “buzz” surrounding this astonishing woman earned her a place in the United States Senate in 2012. However, that is one, tiny detail in the life of the incredible—and multifaceted—Elizabeth Warren. Her list of accomplishments is long and varied, but her ongoing struggles are just as abundant. She is a well-rounded woman full of depth, passion, and wisdom. Her life cannot be reduced to a rough outline of her success; there is much, much more to her story.•Why Elizabeth Warren Has Dedicated Her Time To Helping The Middle Class People•How Elizabeth Warren Became Successful When She Grew Up With Little Resources•The Obstacles Elizabeth Warren Faced From Big Business Backed Politicians•Why Hard Work and Doing The Right Things Are Important Values For Success•The Reason Why Elizabeth Warren Ventured Into Politics•The Posibility Of A Run For PresidencyDownload your copy today!The contents of this book are easily worth over $5, but for a limited time you can download \"Elizabeth Warren\" for a special discounted price of only $2.99",
  "genres": [
    "Nonfiction"
  ],
  "author": "Ruth Carr",
  "average_rating": "3.78",
  "url": "https://www.goodreads.com/book/show/25602057-elizabeth-warren"
}