{
  "title": "Fairytale Beginnings",
  "description": "Love is an open door…except when it keeps slamming in your face  Hopeless romantic Milly Rose has had her fair share of heartbreak. Obsessed with all things Disney, she refuses to give up on finding her Prince Charming – he’s out there somewhere, isn’t he?  When Milly is given a job to investigate the origins of a historical building in the village of Clover's Rest, she’s not sure what to expect. What she discovers takes her breath away - a beautiful real life Cinderella castle, complete with turrets, a magnificent drawbridge AND a very handsome owner…Cameron Heartstone.  As Milly and Cameron begin to unearth the secrets of Clover Castle, they can’t ignore the intense chemistry building between them. But they’ve both been hurt badly before. Can they take a big leap of faith and find their own happily-ever-after?  A deliciously enchanting read that will delight fans of Rachael Lucas, Lucy Diamond and Miranda Dickinson or anyone who has ever blubbed at a Disney movie. Who says real life can’t be a fairytale?  ‘Holly Martin writes about life and love with such big-hearted warmth and flair.’ Belinda Jones  ‘Holly Martin makes me laugh out loud. Her stories are filled with memorable, lovable characters who reel me in and leave me giggling long after I finish the book.’ Jenny Hale   Read what everyone is saying about Holly Martin’s previous   'One Hundred Proposals is beautifully romantic, riveting, completely irresistible and a story that will make you fall in love with love.' Victoria Loves Books  'Funny, poignant and riveting as well as romantic. Don't miss The Guestbook! I couldn't get enough of the guests' entries and it's got humour, heartbreak, loss, love.' I Heart Chick Lit  'If you’re going to buy any book then buy this delightful one! The Guestbook is splendid, it is beautiful, it is magical and it will leave you with such a smile on your face!' Reading in the Sunshine  'This was honestly, 100% one of the most enjoyable books I have ever read – I devoured it in 2 sittings! Holly’s writing style is so easy and fluent it gets hard to stop, and before you know it you’ve read 200 pages and completely forgot about dinner.' Jenny In Neverland  ‘I was immediately hooked from the first page!...There’s an amazing bunch of colourful characters that you can’t help but fall in love with. There were so many laugh out loud moments and funny scenes as well as some more emotional ones too. Stunningly good!’ Rebecca Raisin  ‘The novel has everything – mystery, romance and much more… it totally swept me away.’ Nat's Reading Cloud  ‘I thoroughly enjoyed this uplifting, inspiring, terrific storywhich gives us all hope in our quest to find the ‘one’.’ Em The Bookworm  ‘Holly Martin has created a story that was a romance like nothing I’ve ever read before. The emotion, the passion, it pours from the pages of this spectacular novel. Buy it, read it, devour it.’ Love of a Good Book  ‘The mix of romance and humour couldn’t be more perfect.",
  "genres": [
    "Romance",
    "Chick Lit",
    "Contemporary",
    "Fairy Tales",
    "Contemporary Romance",
    "Fantasy",
    "Adult"
  ],
  "author": "Holly Martin",
  "average_rating": "4.24",
  "url": "https://www.goodreads.com/book/show/25610813-fairytale-beginnings"
}