{
  "title": "The Incomparables: 6 Heroes of Waterloo and the 6 Ladies They Adore",
  "description": "From the Duchess of Richmond’s ball in Brussels to the Battle of Waterloo and beyond, join these six unforgettable heroes as they journey back from the physical and emotional trials of war and discover the passion that thrills the body can also heal the heart.  Interlude with a Baron by Cerise DeLand Emma wants only an interlude with the man she’s adored for years. But Drayton Worth has spent five years riddled with guilt for hurting her—and he’s determined to have more than a few nights in her bed.  The Captain’s Heart by Suzanna Medeiros A man who is determined to fulfill his duty at the expense of his own happiness, a woman who wants only one taste of true passion, and a case of mistaken identity. Can Captain Edward Hathaway and Grace Kent overcome the guilt that continues to haunt them both and find true love?  Love After Waterloo by Suzi Love When Lady Melton and her son, Daniel, are forced to join antagonistic Captain Belling and the last group of wounded soldiers evacuating from Waterloo to London, she expects clashes with army deserters, both French and British. What she doesn’t anticipate is falling in love with the Captain, nor how much their lives will change.  Dreaming of Waterloo by Lynne Connolly Paul “Lucky” Sherstone daren’t even let his wife too close because of his headaches and the living nightmares he can’t dispel. Hetty hardly knows the man who comes back from war, but one thing she does know—she still wants him.  For Love or Revenge by Dominique Eastwick Captain Roarke Wooldridge is about to find out that sometimes love does heal all wounds. But when his need for revenge collides with desires he never believed he would feel again, will he be able to put aside the scars of Waterloo to embrace his future?  Tarnished Honor by Sabrina York Daniel Sinclair is a broken man with war wounds that are physical and spiritual. He’s weighed down by grief and guilt and tormented by his tarnished honor. When he meets Fia Lennox, a beautiful and brave Highland lass in dire need of his protection, he sees in her his chance for redemption…or utter damnation. Because despite his valiant attempts to resist her, he cannot.  The Incomparables limited edition box set includes 6 scorching romances that commemorate the 200th anniversary of the June 18, 1815 Battle of Waterloo.",
  "genres": [
    "Historical Romance",
    "Historical",
    "Romance",
    "Anthologies",
    "Contemporary Romance"
  ],
  "author": "Cerise DeLand",
  "average_rating": "3.92",
  "url": "https://www.goodreads.com/book/show/25609201-the-incomparables"
}