{
  "title": "Gypsy Blood",
  "description": "THIS IS THE OFFICIAL AUTHOR'S EDITION - WHICH MEANS ANY ROYALTIES GO DIRECTLY TO THE AUTHOR AND ARE MUCH APPRECIATED.Half-Gypsy, Carnival carries his dead Poppa inside him as a perpetual adviser as he works as fortune-teller and occult troubleshooter, banishing demons and succubi with a carefree confidence born only of youth. His life journey takes a distinctly different turn when he meets Maya, an alluring female vampire. This novel details a dark version of the modern world, in which demons appear unbidden and where having a talent and using it successfully can mean either life or death. GYPSY BLOOD is a fast-paced, dark, funny and terrifying novel - like nothing that you have ever read before. The whole thing rolls like an avalanche of skateboards building to a climactic battle royal e between Carnival, a two-timing lady vampire, a she-demon with a mother complex, a social-climbing blood god, the collective spirit of the city and a mercenary mariachi band in a rickshaw. This is a fantasy for those folks who HATE fantasy! \"If you have got a taste for over-the-top stories in the campy mode of the EVIL DEAD movies, then this is definitely a book that you should look into.\" - The Goreletter \"If Harlan Ellison, Richard Matheson and Robert Bloch had a three-way sex romp in a hot tub and then a team of scientists came in and filtered out the water and mixed the leftover DNA into a test tube, the resulting genetic experiment would most likely grow up into Steve Vernon.\" - BOOKGASM \"Gypsy Blood is for fans of dark fantasy who think they've seen it all. Where else are you going to find a novel that opens with life and death battle with a succubus, rolls into a vampire's palm reading session, which segues into a bathtub summoning ceremony and climaxes with a non-stop showdown between a blood demon, a city incarnate, and a mercenary band of mariachi armed with a homemade propane-powered kamikaze rickshaw and assorted armaments?\" - Hellnotes \"True originality is rare but you will find it every time that Steve Vernon puts his fingers on the keyboard.\" - Jeff Strand (author of PRESSURE)",
  "genres": [
    "Horror",
    "Fantasy",
    "Fiction"
  ],
  "author": "Steve Vernon",
  "average_rating": "3.55",
  "url": "https://www.goodreads.com/book/show/25605568-gypsy-blood"
}