{
  "title": "The Bird and the Beetle: The Academy Ghost Bird and Scarab Beetle Series Starters",
  "description": "Read the first books from both of C. L. Stone’s USA TODAY Bestselling (and swoon-inducing) Academy Series, together for the first time with the exclusive that fans have been begging for: Meeting Sang, an alternate POV story of how the Ghost Bird Series began.  Introductions–Book 1 of the Ghost Bird Series With an agoraphobic mother and a barely-there father, Sang Sorenson abhors the isolation keeping her in the shadows. What she craves is a fresh start and to be accepted as ordinary, because for her, being different meant being cast out alone. When her family moves to a new school district, Sang infiltrates a group of boys, each nearly perfect in every way. Grateful for an influence outside of her parents’ negativity, she quickly bonds with the boys, hoping to blend in and learn from them what it means to have friends. Only the boys have secrets of their own and they’ll do anything to keep her safe from the knowledge of the mysterious Academy they've sworn allegiance to. Bit by bit, Sang discovers her friends are far from what she’d expected. Will her loyalty change when she's forced to remain in the dark, or will she accept that she's traded one house of secrets for another? Meet Kota, Victor, Silas, Nathan, Gabriel, Luke and North in a story about differences and loyalty, truth and mystery, friendships and heart-throbbing intimacy. The Academy, ever vigilant.  Thief – Book 1 of the Scarab Beetle Series Kayli Winchester is a dirt-poor girl living out of a hotel, forced to be the parent for a drunken father and teenage brother who she's desperate to keep in school. The only way she scrapes by is to utilize her one skill: pickpocketing. But even though she's a thief she has a moral code: no kids or old ladies, only targets who can defend themselves. Not that they see her coming...  Thinking she's been working under the radar, Kayli has no idea The Academy has been watching and taking notice. Now a team that needs her skill has offered her a way out of her predicament and it's her last chance: work with them, or face jail time. Kayli resists at first, but slowly the boys reveal they can be trusted. With Marc, the straight man, Raven, the bad-boy Russian, Corey and Brandon the twins as different as night and day, and Axel their stoic leader, there's a lot Kayli can learn from these Academy guys about living on the edge of the law. If only she can stay on the good side instead of the bad.  Especially when the job they offer her is more than any of them bargained for. After it's done, the hunters have become the hunted and their target is now after Kayli. The Academy boys do their best to keep her hidden, but a thief like Kayli will never sit still for long.",
  "genres": [
    "Reverse Harem",
    "Young Adult",
    "New Adult",
    "Teen",
    "Romance",
    "Amazon"
  ],
  "author": "C.L. Stone",
  "average_rating": "4.42",
  "url": "https://www.goodreads.com/book/show/25609737-the-bird-and-the-beetle"
}