{
  "title": "Hunger",
  "description": "Desperate to solve a global food shortage, ExoGen scientist Dr. Ella Masse oversees the creation and release of RC-714, a gene that unlocks millions of years of adaptation and evolution, allowing crops to use long dormant junk DNA to rapidly adapt to any environment. The world’s food supply grows aggressively, occupying every inch of earth, no matter how inhospitable. World hunger is averted. Humanity flourishes. RC-714 is digested, absorbed and passed on.The Change affects small, fast breeding mammals first. They multiply with the same aggressive speed as the ExoGen plants, but a new, insatiable hunger drives them to violence. War between species breaks out. And then RC-714 reaches humanity, along with every other large creature on the planet. Civilization implodes, as every living thing that consumed the ExoGen crops begins to adapt to a world full of predators, accessing genes dating back to the beginning of life itself.Peter Crane and his son Jakob survive the Change, living in their family farmhouse and eating non-ExoGen food from a biodome, one of many provided by Ella Masse, who discovered the ramifications of her breakthrough too late. The pair ekes out a living in a world full of monsters, surviving until Ella shows up on their doorstep with her daughter, pursued by desperate predators and men alike.As the farmhouse falls under attack, Crane learns that the end of humanity, of life on Earth, can still be averted: if Ella Masse and her daughter survive, and if they make it to the other side of the country without being captured...or consumed.Jeremy Robinson merges the science of Michael Crichton with the horror of Stephen King in this fresh take on the post-apocalypse, creating a true worst-case scenario for GMO crops that will have people reading labels before eating their next pepper, tomato or kernel of corn.",
  "genres": [
    "Horror",
    "Science Fiction",
    "Fiction",
    "Post Apocalyptic",
    "Thriller",
    "Apocalyptic",
    "Audiobook"
  ],
  "author": "Jeremiah Knight",
  "average_rating": "4.07",
  "url": "https://www.goodreads.com/book/show/25612397-hunger"
}