{
  "title": "Untangled: Guiding Teenage Girls Through the Seven Transitions into Adulthood",
  "description": "NEW YORK TIMES BESTSELLER •  An award-winning guide to the sometimes erratic and confusing behavior of teenage girls that explains what’s going on, prepares parents for what’s to come, and lets them know when it’s time to worry. Look for Under Pressure, the companion guide to coping with stress and anxiety among girls, available now.In this sane, highly engaging, and informed guide for parents of daughters, Dr. Damour draws on decades of experience and the latest research to reveal the seven distinct—and absolutely normal—developmental transitions that turn girls into grown-ups, including Parting with Childhood, Contending with Adult Authority, Entering the Romantic World, and Caring for Herself. Providing realistic scenarios and welcome advice on how to engage daughters in smart, constructive ways, Untangled gives parents a broad framework for understanding their daughters while addressing their most common questions, including• My thirteen-year-old rolls her eyes when I try to talk to her, and only does it more when I get angry with her about it. How should I respond?• Do I tell my teen daughter that I’m checking her phone?• My daughter suffers from test anxiety. What can I do to help her?• Where’s the line between healthy eating and having an eating disorder?• My teenage daughter wants to know why I’m against pot when it’s legal in some states. What should I say?• My daughter’s friend is cutting herself. Do I call the girl’s mother to let her know?Perhaps most important, Untangled helps mothers and fathers understand, connect, and grow with their daughters. When parents know what makes their daughter tick, they can embrace and enjoy the challenge of raising a healthy, happy young woman.BOOKS FOR A BETTER LIFE AWARD WINNER“Finally, there’s some good news for puzzled parents of adolescent girls, and psychologist Lisa Damour is the bearer of that happy news. [ Untangled ] is the most down-to-earth, readable parenting book I’ve come across in a long time.” — The Washington Post“Anna Freud wrote in 1958, ‘There are few situations in life which are more difficult to cope with than an adolescent son or daughter during the attempt to liberate themselves.’ In the intervening decades, the transition doesn’t appear to have gotten any easier which makes Untangled such a welcome new resource.” — The Boston Globe",
  "genres": [
    "Parenting",
    "Nonfiction",
    "Psychology",
    "Self Help",
    "Audiobook",
    "Family",
    "Education"
  ],
  "author": "Lisa Damour",
  "average_rating": "4.52",
  "url": "https://www.goodreads.com/book/show/25614847-untangled"
}