{
  "title": "Breaker",
  "description": "ITW THRILLER AWARD FINALIST • A razor-sharp thriller featuring one of the most compelling and complex characters ever to walk the Windy City’s shadowy streets. Living alone in the dusty apartment where he grew up, Ray Nelson is a mystery to his neighbors and an unbeatable foe to the brutal men he fights in the ring for money. But a life defined by sinister secrets doesn’t stop Ray from trying to do the right thing for his dangerously high-flying sister. Or for Natalie, the young girl living next door. As a sadistic murderer’s ominous white van trolls for young victims throughout the Windy City, Ray is determined to protect Natalie from both predators and a bleak future.  When she sees a bruised and beaten Ray return from late-night fights, Natalie spots a kindred spirit. Still, she cannot imagine the darkness just beneath, or what’s hidden in the rooms he calls home. Now, as the horrors of his own past creep back to life with a twisted vengeance, Ray may not even be able to save himself.Praise for Breaker “Richard Thomas’s Breaker is a modern noir fever brutal, lyrical, evocative. But it also exhibits surprising tenderness—its shattered characters find strength in one another, and beauty in the pattern of the cracks.”—Chris Holm, author of The Killing Kind “Gritty, raw, powerful, visceral—that’s all you need to know about Richard Thomas’s novel Breaker. It’s a ‘gotta read this’ book.”—Les Edgerton, author of The Genuine, Imitation, Plastic Kidnapping“One of the most terrifying, harrowing stories you’ll read all year . . . With a solid mix of heartbreak and action, along with some plot-defying acrobatics not seen on the page too often, Breaker delivers the goods on all fronts.”—This Is Horror Praise for Richard Thomas’s Disintegration “A dark existential thriller of unexpected twists, featuring a drowning man determined to pull the rest of the world under with him, Disintegration is a stunning and vital piece of work.”—Irvine Welsh, author of Trainspotting “A twisted masterpiece . . . Richard Thomas writes like a man possessed.”—Chuck Wendig, author of Blackbirds and Double Dead “This novel is so hard-hitting it should come with its own ice pack. Richard Thomas is the wild child of Raymond Chandler and Chuck Palahniuk.”—Benjamin Percy, author of The Dead Lands, Red Moon, and The Wilding “Disintegration is provocative. It’s also damned fine noir.”—Laird Barron, author of The Beautiful Thing That Awaits Us All and The Croning “A psycho-sexual descent into an unhinged psyche and an underworld Chicago that could very well stand in for one of the rings of Dante’s Hell.”—Paul Tremblay, author of A Head Full of Ghosts and The Little Sleep “Gritty, obsessive, and compulsively readable.",
  "genres": [
    "Noir",
    "Mystery",
    "Fiction",
    "Literary Fiction"
  ],
  "author": "Richard   Thomas",
  "average_rating": "4.34",
  "url": "https://www.goodreads.com/book/show/25614725-breaker"
}