{
  "title": "Strange Gods: A Secular History of Conversion",
  "description": "In a groundbreaking historical work that addresses religious conversion in the West from an uncompromisingly secular perspective, Susan Jacoby challenges the conventional narrative of conversion as a purely spiritual journey. From the transformation on the road to Damascus of the Jew Saul into the Christian evangelist Paul to a twenty-first-century “religious marketplace” in which half of Americans have changed faiths at least once, nothing has been more important in the struggle for reason than the right to believe in the God of one’s choice or to reject belief in God altogether. Focusing on the long, tense convergence of Judaism, Christianity, and Islam—each claiming possession of absolute truth—Jacoby examines conversions within a social and economic framework that includes theocratic coercion (unto torture and death) and the more friendly persuasion of political advantage, economic opportunism, and interreligious marriage. Moving through time, continents, and cultures—the triumph of Christianity over paganism in late antiquity, the Spanish Inquisition, John Calvin’s dour theocracy, Southern plantations where African slaves had to accept their masters’ religion—the narrative is punctuated by portraits of individual converts embodying the sacred and profane. The cast includes Augustine of Hippo; John Donne; the German Jew Edith Stein, whose conversion to Catholicism did not save her from Auschwitz; boxing champion Muhammad Ali; and former President George W. Bush. The story also encompasses conversions to rigid secular ideologies, notably Stalinist Communism, with their own truth claims. Finally, Jacoby offers a powerful case for religious choice as a product of the secular Enlightenment. In a forthright and unsettling conclusion linking the present with the most violent parts of the West’s religious past, she reminds us that in the absence of Enlightenment values, radical Islamists are persecuting Christians, many other Muslims, and atheists in ways that recall the worst of the Middle Ages.(With 8 pages of black-and-white illustrations.)",
  "genres": [
    "History",
    "Religion",
    "Nonfiction",
    "Philosophy",
    "Politics",
    "Atheism",
    "Theology"
  ],
  "author": "Susan Jacoby",
  "average_rating": "3.83",
  "url": "https://www.goodreads.com/book/show/25614817-strange-gods"
}