{
  "title": "Cele zece iubiri ale lui Nishino",
  "description": "Cartea lui Hiromi Kawakami cuprinde marturisirile a zece femei si tot atitea povestiri din care, pornind de la frinturi de amintiri, cititorii pot recompune personalitatea fascinanta, greu de prins, magnetica a unui barbat. Fie ca este vorba despre legaturi adolescentine sau din amiaza vietii, eroul dovedeste un sarm fara gres. Intriga donjuanismul nelinistit, nepasarea pe care Nishino o afiseaza, desi e chinuit uneori de angoase morbide, de dragostea pe care si-o declara, fara sa fie crezut. Insa rind pe rind, desi intruchipeaza barbatul ideal, femeile il parasesc, mai puternice dupa apropierea de el. Cele zece iubiri ale lui Nishino capteaza deopotriva unde secrete ale obiectelor, ale naturii si, in stilul bine-cunoscut al lui Hiromi Kawakami, dincolo de simplitatea naratiunii, te face sa simti un parfum si un freamat care dureaza.„In jurul lui plutea un aer straniu. Ceva ce nu vedeai la nimeni altcineva din clasa. Oricit ai fi incercat sa patrunzi in aerul acela, nu ii dadeai de capat, asa mi se parea. Cu cit il razbateai, cu-atit te duceai mai adinc. Dar, oricit de profund ai fi scrutat, tot nu puteai ajunge la Nishino, ascuns dincolo de valul acela de aer. Si, cu toate astea, aerul ala era moale, cald si placut. Te trezeai pe nestiute cu iluzia ca aerul ala era Nishino insusi.“ (Hiromi Kawakami)„Pasionata de reminiscentele pe care le pastram in noi, Hiromi Kawakami urmareste cum se oglindeste Nishino in privirea iubitelor sale. Au fost oare iubiri implinite, destramate, statornice? Absenta unor repere si certitudini mai mult da contur femeilor pe care le-a iubit, decit le sterge. Forta romanului vine tocmai din aceasta apropiere de femeile iubite, niciodata victime, intotdeauna invingatoare, insufletite zi dupa zi de convingerea ca «miine a inceput deja».“ (Telerama)",
  "genres": [
    "Japan",
    "Fiction",
    "Japanese Literature",
    "Contemporary",
    "Romance",
    "Short Stories",
    "Asia"
  ],
  "author": "Hiromi Kawakami",
  "average_rating": "3.44",
  "url": "https://www.goodreads.com/book/show/25616152-cele-zece-iubiri-ale-lui-nishino"
}