{
  "title": "Yeah! Yeah! Yeah! The Story of Pop Music from Bill Haley to Beyoncé",
  "description": "As much fun to argue with as to quote, Yeah! Yeah! Yeah! is a monumental work of musical history, tracing the story of pop music through individual songs, bands, musical scenes, and styles from Bill Haley and the Comets’ “Rock around the Clock” (1954) to Beyoncé’s first megahit, “Crazy in Love” (2003). It covers the birth of rock, soul, R&B, punk, hip hop, indie, house, techno, and more, and it will remind you why you fell in love with pop music in the first place.Bob Stanley—musician, music critic, and unabashed fan—recounts the progression from the Beach Boys to the Pet Shop Boys to the Beastie Boys; explores what connects doo wop to the sock hop; and reveals how technological changes have affected pop production. Working with a broad definition of “pop”—one that includes country and metal, disco and Dylan, skiffle and glam—Stanley teases out the connections and tensions that animate the pop charts and argues that the charts are vital social history.Yeah! Yeah! Yeah! is like the world’s best and most eclectic jukebox in book form. All the hits are here: the Monkees, Metallica, Patsy Cline, Patti Smith, new wave, New Order, “It’s the Same Old Song,” The Song Remains the Same, Aretha, Bowie, Madonna, Prince, Sgt. Pepper, A Tribe Called Quest, the Big Bopper, Fleetwood Mac, “Itsy Bitsy Teenie Weenie Yellow Polka Dot Bikini,” Bikini Kill, the Kinks, Mick Jagger, Michael Jackson, Jay-Z, and on and on and on. This book will have you reaching for your records (or CDs or MP3s) and discovering countless others.For anyone who has ever thrilled to the opening chord of the Beatles’ “A Hard Day’s Night” or fallen crazy in love for Beyoncé, Yeah! Yeah! Yeah! is a vital guide to the rich soundtrack of the second half of the twentieth century.",
  "genres": [
    "Music",
    "Nonfiction",
    "History",
    "Pop Culture",
    "Cultural",
    "Biography",
    "Sociology"
  ],
  "author": "Bob Stanley",
  "average_rating": "4.17",
  "url": "https://www.goodreads.com/book/show/25622259-yeah-yeah-yeah-the-story-of-pop-music-from-bill-haley-to-beyonc"
}