{
  "title": "Chanting Mantras with Best Chords",
  "description": "Applying Quantum Physics to manifestation of Consciousness researching Ancient Psychological aspects of Alchemy & Chinese, Greek, Hindu Philosophers, the compilation of 9 AoL 2 fiction and 7 non-fiction explore Symbols, Mysticism, Arts, Creativity, Consciousness & 1. A-Ma by Nuit, Historical Fiction set in 17th Century China. A Mystical Journey of Portuguese, Chinese Consciousness Researchers, set in the Age of Enlightenment during the Dutch attack to Macao in 1622, the Reform of Chinese Calendar in 1630-s, with Father Adam Schall's appointment to the Chinese Board of Mathematicians during 1650-s, the witch hunt of a Shaman's African Goddess incarnated in China as Ama and her father Ottavio, a Portuguese Alchemist. 244 pg, 6x9”2. Art of 4 Exploring Alchemy through Poetry, Spiritual Four Elements Meditations, a Mystical Journey into Enlightenment through ancient mysteries and stories, by Nuit, Jason Lu, Christine Cutajar, Jeni Caruana. The 120 poems, written by Nuit, acted as an inspiration for the work of 3 artists. 266 pg 8” x 10”3. Mindful Eating with Delicious Raw Vegan Recipes, by Olivera Rosić .Designed with the best Alchemy of Love Mindful Eating Exercises and a collection of Delicious Raw Vegan Recipes. The Exercises help with over-eating, eating too often, eating too little, eating junk food, food allergies, etc. 120 pg 6” x 9”4. Chanting Mantas with Best Chords by Nuit. With more than 50 mantras from all around the world, their spiritual meanings, lyrics and chords, it Hindu Sacred Mantras; Buddhist Mantras; Sufi Chants; New-Consciousness Mantras in English. 120 pg 6” x 9”5. Mindful Being towards Mindful Living Course is a 12 Modules Personal Growth Course full of \"Green Life-Style\" exercises including self improvement and spiritual questionnaires, soul’s diary, behavior pattern modification, relationship contracts, and many other daily self-growth transformation tools on Nutrition, Core Beliefs, Emotional Intelligence, Mind Power, Creative Thinking, Joy and Love. 2015, 187 pg 8” x 10”6. Conscious Mindful Living Course for Parents by Nuit and Ivana Milosavljević (Md Special Needs), a \"Green-Lifestyle\" Training designed for parents with plenty of Questionnaires and Family exercises. We explore the magic work Rhythm, Day-to-day Routine, Happy Family Structure, Cultivating Relationships, etc. We look into parenting goals, dreams, and creativity tools for kids. 228 pg 8” x 10”7. Tree of Life with Spiritual Poetry. A Novel by Nataša Pantović Nuitis set in Findhorn, UK as a Journey into the Field of Dreams that In various religious interpretations, within myths, and as a mystical concept represents the inter-connection of all life on our beautiful planet. The story becomes a true adoption story venturing into Africa, Ethiopia, Kenia, within the magic of four elements, four directions, four stages of Life. 264 pg 6\" x 9”8. Conscious Mindfulness Meditations by Nuit, Developing both Left and Right Brain could be essential for Creative Thinkers of our Future. To purify mind we start with the consciousness that energy follows thoughts and we use Quantum Physics Logic within Consciousness Research of Taoism following Yin and Yang Universe Manifestations to enter Creative Flow. 2017 96 pages, 6\" x 9\"9. Spiritual Symbols with Their Meaning by Nuit. Our Holographic Universe resonates with the most amazing precision creating Realities of our Choice. Using the sound (Aum, Amin, Allah) resonance to mediate, today & in the past our artists use symbols to enter higher states of consciousness. From Neolithic wisdom of Ancient Temples' carvings of spirals, Pythagoras numbers, Leonardo da Vinci's paintings, ancient wisdom of magic, mysticism, occult travels to our worlds giving us conscious / subconscious gift from Greek Philosophers, Neolithic Temples Goddesses, Alchemy Size 152 pg 6\" x 9\"",
  "genres": [
    "Nonfiction",
    "Self Help",
    "Spirituality",
    "Adult",
    "Music"
  ],
  "author": "Nataša Pantović",
  "average_rating": "4.78",
  "url": "https://www.goodreads.com/book/show/25619587-chanting-mantras-with-best-chords"
}