{
  "title": "American Qur'an",
  "description": "A Holiday Gift Guide Selection in the New York Times and San Francisco Chronicle This triumph of American art, reflecting a decade of travel in the Islamic work, unites two cultures with its transcendent power. At a time when the United States was involved in two wars against Islamic nations, American-born artist Sandow Birk wanted to understand the Qur'an as it is, and always has been a universal message to humankind. But to do so, he first needed to comprehend what Islam's holiest book meant to an American living in the twenty-first century. Indeed, how has the Qur'an related to us, as Americans, in this life, in this time? In an attempt to answer his own question, Birk embarked on the most ambitious work of his career. Following in the grand traditions of ancient Arabic and Islamic artists, he began hand-transcribing the entire Qur'an as was done in centuries past―abiding by the traditional prescriptions as to the colors of ink, the formatting of the pages, the size of margins and illuminations of page headings and medallions marking verses and passages. He then took each sura and set it against a backdrop from everyday American life, one that reflected his renowned \"skate-surf\" ascetic. Even before the first images of what became known as the American Qur'an began appearing in public, in 2009, veteran art critics were concerned about its reception. While Birk wasn't illustrating the Qur'an itself, the pairing of Islam’s holiest text with scenes from contemporary American life seemed adventuresome, given the climate of the times. The project, however, was not only welcomed by the Muslim community but also celebrated as an \"ambitious and valuable undertaking\" ( New York Times ). At the same time, many saw it as taking part in an ancient tradition, one that, according to Yale University professor Zareena Grewal, \"eschewed the irony and satire that have become the knee-jerk impulse of so many Western artists.\" Now appearing in full for the first time ever, this lavishly designed volume―containing all 114 suras―melds the past with the present, East with the West like nothing before it. The result, hailed by Reza Aslan as \"a great favor, not only to Muslims, but also to Americans,\" is one of the most original art books to appear in decades. 427 color illustrations",
  "genres": [
    "Religion",
    "Islam",
    "Nonfiction",
    "Art"
  ],
  "author": "Sandow Birk",
  "average_rating": "3.96",
  "url": "https://www.goodreads.com/book/show/25620692-american-qur-an"
}