{
  "title": "White Nationalism, Black Interests: Conservative Public Policy and the Black Community",
  "description": "The rise of the Conservative movement in the United States over the last two decades is evident in current public policy, including the passage of the Welfare Reform Act, the weakening of affirmative action, and the approval of educational vouchers for private schooling. At the same time, new rules on congressional redistricting prohibit legislators from constructing majority black congressional districts, and blacks continue to suffer disproportionate rates of incarceration and death-penalty sentencing. In this significant new study, the distinguished political scientist Ronald W. Walters argues that the Conservative movement during this period has had an inordinate impact on American governing institutions and that a strong, though very often unstated, racial hostility drives the public policies put forth by Conservative politicians.Walters traces the emergence of what he calls a new White Nationalism, showing how it fuels the Conservative movement, invades the public discourse, and generates policies that protect the interests of white voters at the expense of blacks and other nonwhites. Using historical and contemporary examples of White Nationalist policy, as well as empirical public opinion data, Walters demonstrates the degree to which this ideology exists among white voters and the negative impact of its policies on the black community. White Nationalism, Black Interests terms the current period a \"second Reconstruction,\" comparing the racial dynamics in the post-Civil Rights era to those of the first Reconstruction following the end of the Civil War. Walters's analysis of contemporary racial politics is uniquely valuable to scholars and lay readers alike and is sure to spark further public debate.",
  "genres": [
    "Politics",
    "Law"
  ],
  "author": "Ronald W. Walters",
  "average_rating": "4.23",
  "url": "https://www.goodreads.com/book/show/1158674.White_Nationalism_Black_Interests"
}