{
  "title": "SEX DUNGEONS OF THE RICH & FAMOUS (Interactive Alpha Billionaire BDSM Humiliation Erotica)",
  "description": "\"This book tackles the genre of billionaire dominants with a razor wit... It is not an easy thing to do to combine sexy stuff with silly stuff but [Aurora Sparks] does it well.\"-Shon RichardsYou maintain your position, thighs quivering with a combination of terror, desire and simple exhaustion.Holding the paddle in both hands, the masked stranger winds up like he’s about to hit a grand slam and swings with all his might at your posterior.Your bare ass lights up with pain. The blow’s impact makes the flesh of your entire body ripple. Tears appear in the corners of your eyes. The crowd in the sumptuous ballroom claps and cheers, relishing in the spectacle of your humiliation. You tremble harder, terrified of what’s to come.*Wait for the next blow.*Make a run for it!Rumor has it, in the heart of the city that never sleeps, there exists an underground club called the Cash Nexus. There, the wealthiest men in the world gather to indulge their darkest and most taboo sexual desires, unfettered by the legal and moral strictures that govern the workaday world.You've always written it off as an urban legend. One day, however, your best friend slips you the password to a BDSM-themed masquerade she's planning on attending with her brand new billionaire boyfriend. Her directions lead you to a rusty iron door at the end of a garbage-strewn alley. If you knock on the door and repeat the password, you're transported to a surreal soiree filled with Fortune 500 businessmen eager to see you bound, whipped, paddled, humiliated and thrown into subterranean dungeons. If you turn around and leave, an entirely different set of kinky adventures awaits...The follow-up to Aurora Sparks's debut interactive novel, the bestselling Become the Woman of Your Dreams, \nSEX DUNGEONS OF THE RICH & FAMOUS\n (formerly known as Ravished & Lashed in the Cash Nexus) dwarfs its predecessor in both size and scope, comprising 45,000 words and featuring 37 different steamy endings. The author's trademark offbeat humor is in full effect, resulting in an adventure that's equal parts Alice in Wonderland and 50 Shades of Grey.",
  "genres": [],
  "author": "Aurora Sparks",
  "average_rating": "3.25",
  "url": "https://www.goodreads.com/book/show/25617627-sex-dungeons-of-the-rich-famous-interactive-alpha-billionaire-bdsm-hu"
}