{
  "title": "Hold Still",
  "description": "“Lynn Steger Strong paints a portrait of familial love that is real, visceral, and all the more dangerous for being unconditional.” ― Alexandra Kleeman, author of You Too Can Have a Body Like Mine Maya Taylor, an intense, gifted English professor, has a tendency to retreat when she is needed most, escaping on long morning runs or finding comfort in the well-thumbed novels in her library. But when she sends her daughter Ellie to Florida to care for a friend’s child, it’s with the best of intentions. Twenty and spiraling, Ellie is lost in a fog of drugs and men―desperately in need of a fresh start. Her life with this attractive new family in Florida begins well, but Ellie is crippled by the fear that she’ll only disappoint those around her . . . again. And in the sprawling hours of one humid afternoon, she finally makes a mistake she cannot take back. The accident hangs over both mother and daughter as they try to repair their fractured relationship and find a way to transcend not only their differences but also their more startling similarities. In Maya’s and Ellie’s echoing narratives, Lynn Steger Strong creates a searing, unforgettable portrait of familial love and the tender heartache of motherhood―from the sweltering Florida heat to the bone-cold of New York in January. Churning toward one fateful day in two separate timelines, Hold Still is a story of before and after and the impossible distance in between. Heralding the arrival of a profoundly moving new talent, this novel marks a taut and propulsive debut that “builds to a perfect crescendo, an ending that is both surprising and true” (Marcy Dermansky). Hold Still explores the weight of culpability and the depths and limits of a mother’s love. “ Hold Still is an unblinking examination of family, the mother-child bond, and the storms it must withstand. Lynn Strong pulls no punches in considering not just how deep, but also how misguided a mother’s love can be.”―Elisa Albert, author of After Birth",
  "genres": [
    "Fiction",
    "Contemporary",
    "Literary Fiction",
    "Novels",
    "Book Club",
    "Adult",
    "Audiobook"
  ],
  "author": "Lynn Steger Strong",
  "average_rating": "3.18",
  "url": "https://www.goodreads.com/book/show/25622894-hold-still"
}