{
  "title": "Eternity Street: Violence and Justice in Frontier Los Angeles",
  "description": "“John Mack Faragher is one fine writer, bringing early L.A. to life as the setting for all manner of horrific killings and gruesome justice. Eternity Street will keep you up at night ruminating on the roots of American violence.”―Richard Wightman Fox, University of Southern California, author of Lincoln’s Body: A Cultural History Eternity Street tells the story of a violent place in a violent time: the rise of Los Angeles from its origins as a small Mexican pueblo. In a masterful narrative, John Mack Faragher relates a dramatic history of conquest and ethnic suppression, of collective disorder and interpersonal conflict. Eternity Street recounts the struggle to achieve justice amid the turmoil of a loosely governed frontier, and it delivers a piercing look at the birth of this quintessentially American city. In the 1850s, the City of Angels was infamous as one of the most murderous societies in America. Saloons teemed with rowdy crowds of Indians and Californios, Mexicans and Americans. Men ambled down dusty streets, armed with Colt revolvers and Bowie knives. A closer look reveals characters acting in unexpected ways: a newspaper editor advocating lynch law in the name of racial justice; hundreds of Latinos massing to attack the county jail, determined to lynch a hooligan from Texas. Murder and mayhem in Edenic southern California. \"There is no brighter sun…no country where nature is more lavish of her exuberant fullness,\" an Angeleno wrote in 1853. \"And yet, with all our natural beauties and advantages, there is no country where human life is of so little account. Men hack one another to pieces with pistols and other cutlery as if God's image were of no more worth than the life of one of the two or three thousand ownerless dogs that prowl about our streets and make night hideous.\" This is L.A. noir in the act of becoming. 16 pages of illustrations",
  "genres": [
    "History",
    "Nonfiction",
    "American History",
    "Crime",
    "Cultural Studies",
    "Politics",
    "Westerns"
  ],
  "author": "John Mack Faragher",
  "average_rating": "3.99",
  "url": "https://www.goodreads.com/book/show/25622875-eternity-street"
}