{
  "title": "Thieves of State: Why Corruption Threatens Global Security",
  "description": "The world is blowing up. Every day a new blaze seems to ignite: the bloody implosion of Iraq and Syria; the East-West standoff in Ukraine; abducted schoolgirls in Nigeria. Is there some thread tying these frightening international security crises together? In a riveting account that weaves history with fast-moving reportage and insider accounts from the Afghanistan war, Sarah Chayes identifies the unexpected link: corruption.Since the late 1990s, corruption has reached such an extent that some governments resemble glorified criminal gangs, bent solely on their own enrichment. These kleptocrats drive indignant populations to extremes—ranging from revolution to militant puritanical religion. Chayes plunges readers into some of the most venal environments on earth and examines what emerges: Afghans returning to the Taliban, Egyptians overthrowing the Mubarak government (but also redesigning Al-Qaeda), and Nigerians embracing both radical evangelical Christianity and the Islamist terror group Boko Haram. In many such places, rigid moral codes are put forth as an antidote to the collapse of public integrity.The pattern, moreover, pervades history. Through deep archival research, Chayes reveals that canonical political thinkers such as John Locke and Machiavelli, as well as the great medieval Islamic statesman Nizam al-Mulk, all named corruption as a threat to the realm. In a thrilling argument connecting the Protestant Reformation to the Arab Spring, Thieves of State presents a powerful new way to understand global extremism. And it makes a compelling case that we must confront corruption, for it is a cause—not a result—of global instability.",
  "genres": [
    "Nonfiction",
    "Politics",
    "History",
    "Economics",
    "Political Science",
    "Africa",
    "Sociology"
  ],
  "author": "Sarah Chayes",
  "average_rating": "4.11",
  "url": "https://www.goodreads.com/book/show/25622863-thieves-of-state"
}