{
  "title": "A World Apart: Women, Prison, and Life Behind Bars",
  "description": "“Life in a women’s prison is full of surprises,” writes Cristina Rathbone in her landmark account of life at MCI-Framingham. And so it is. After two intense court battles with prison officials, Rathbone gained unprecedented access to the otherwise invisible women of the oldest running women’s prison in America.The picture that emerges is both astounding and enraging. Women reveal the agonies of separation from family, and the prevalence of depression, and of sexual predation, and institutional malaise behind bars. But they also share their more personal hopes and concerns. There is horror in prison for sure, but Rathbone insists there is also humor and romance and downright bloody-mindedness. Getting beyond the political to the personal, A World Apart is both a triumph of empathy and a searing indictment of a system that has overlooked the plight of women in prison for far too long.At the center of the book is Denise, a mother serving five years for a first-time, nonviolent drug offense. Denise’s son is nine and obsessed with Beanie Babies when she first arrives in prison. He is fourteen and in prison himself by the time she is finally released. As Denise struggles to reconcile life in prison with the realities of her son’s excessive freedom on the outside, we meet women like Julie, who gets through her time by distracting herself with flirtatious, often salacious relationships with male correctional officers; Louise, who keeps herself going by selling makeup and personalized food packages on the prison black market; Chris, whose mental illness leads her to kill herself in prison; and Susan, who, after thirteen years of intermittent incarceration, has come to think of MCI-Framingham as home. Fearlessly truthful and revelatory, A World Apart is a major work of investigative journalism and social justice.",
  "genres": [
    "Nonfiction",
    "Sociology",
    "True Crime",
    "Crime",
    "Feminism",
    "Womens",
    "Politics"
  ],
  "author": "Cristina Rathbone",
  "average_rating": "3.93",
  "url": "https://www.goodreads.com/book/show/256267.A_World_Apart"
}