{
  "title": "Half-Earth: Our Planet's Fight for Life",
  "description": "In order to stave off the mass extinction of species, including our own, we must move swiftly to preserve the biodiversity of our planet, says Edward O. Wilson in his most impassioned book to date. Half-Earth argues that the situation facing us is too large to be solved piecemeal and proposes a solution commensurate with the magnitude of the problem: dedicate fully half the surface of the Earth to nature.If we are to undertake such an ambitious endeavor, we first must understand just what the biosphere is, why it's essential to our survival, and the manifold threats now facing it. In doing so, Wilson describes how our species, in only a mere blink of geological time, became the architects and rulers of this epoch and outlines the consequences of this that will affect all of life, both ours and the natural world, far into the future.Half-Earth provides an enormously moving and naturalistic portrait of just what is being lost when we clip \"twigs and eventually whole braches of life's family tree.\" In elegiac prose, Wilson documents the many ongoing extinctions that are imminent, paying tribute to creatures great and small, not the least of them the two Sumatran rhinos whom he encounters in captivity. Uniquely, Half-Earth considers not only the large animals and star species of plants but also the millions of invertebrate animals and microorganisms that, despite being overlooked, form the foundations of Earth's ecosystems.In stinging language, he avers that the biosphere does not belong to us and addresses many fallacious notions such as the idea that ongoing extinctions can be balanced out by the introduction of alien species into new ecosystems or that extinct species might be brought back through cloning. This includes a critique of the \"anthropocenists,\" a fashionable collection of revisionist environmentalists who believe that the human species alone can be saved through engineering and technology.Despite the Earth's parlous condition, Wilson is no doomsayer, resigned to fatalism. Defying prevailing conventional wisdom, he suggests that we still have time to put aside half the Earth and identifies actual spots where Earth's biodiversity can still be reclaimed. Suffused with a profound Darwinian understanding of our planet's fragility, Half-Earth reverberates with an urgency like few other books, but it offers an attainable goal that we can strive for on behalf of all life.",
  "genres": [
    "Science",
    "Nonfiction",
    "Nature",
    "Environment",
    "Biology",
    "Ecology",
    "Climate Change"
  ],
  "author": "Edward O. Wilson",
  "average_rating": "3.90",
  "url": "https://www.goodreads.com/book/show/25622872-half-earth"
}