{
  "title": "Troubled Waters",
  "description": "The question of who his mother was puzzled Ogteah, but not to the extent of bothering him for real. His other troubles, the results of his life as a gambler and a lightweight, breezy and free of responsibility, were the ones to land him in trouble time after time. The people of his own hometown frowned, more and more direfully as the summers passed, until his mounting transgressions made him leave for good, mainly to stop embarrassing his father. A great leader and a very dedicated person, his father was working hard to create an alliance between their own people and their various neighbors, an alliance that was supposed to keep their side of the Great Lake safe from the traditional enemy, the notorious Longhouse People and their Great League’s threatening presence. Concerned with none of this, Ogteah wandered far north, settling in the lands of the people his father wanted an alliance with. Only to run into more trouble.  Gayeri wasn’t concerned with political developments, powerful leaders, or their less successful sons, either. No troublesome newcomers entered her thoughts or caught her attention, certainly not a good-for-nothing gambler with a mysterious past. Having survived a brutal kidnapping but determined to forget all about it, she was busy carving a new life in her new surroundings, set on ensuring that it would shelter her from any more dangerous happenings. Protection was her first priority, and keeping away from men was a large part of it. Large-scale politics were of no consequence, whether those of her former Longhouse People or her new Crooked Tongued countryfolk. Her personal safety was most important, at the expense of everything else.  And yet, the formation of the four Wyandot nations’ union was to interrupt their lives, to demand their involvement and participation, causing them to influence each other’s lives more than any of them could have imagined or foreseen.",
  "genres": [
    "Historical Fiction"
  ],
  "author": "Zoe Saadia",
  "average_rating": "4.54",
  "url": "https://www.goodreads.com/book/show/25626310-troubled-waters"
}