{
  "title": "Deliverance for Amelia",
  "description": "What would you do if the devil held you captive? Would you fight, or play along with his wicked games?WARNING: THIS IS A DARK NOVEL. IT IS NOT INTENDED FOR THE FAINT OF HEART. THERE ARE SCENES WITH EXTREME HORROR AND BRUTAL TREATMENT AS WELL AS ABUSE. THIS BOOK IS INTENDED FOR THOSE 18 YEARS OR OLDER DUE TO ITS GRAPHIC NATURE. THERE ARE SCENES WHICH INCLUDE CONSENSUAL AND NON-CONSENSUAL SEX. IF YOU HAVE TRIGGERS, IT IS NOT RECOMMENDED THAT YOU READ THIS NOVEL. READ AT YOUR OWN RISK.AmeliaMy entire life I've lived in my father's shadow. As the Mayor's daughter, I'm expected to maintain a pristine reputation. Everything must be perfect. My days of tutors and piano lessons may be behind me, but the need to be my father's perfect daughter still rings true.However, I'm in college now - so why not have a little fun? It started out that way, anyway. When I decided to go to a party with my new friend Meg, I thought my college days were just beginning. My boring little life was finally getting the shakeup that it desperately needed. Little did I know, I would become the captive of the devil himself.He says that I'm his. He calls himself my master.GabeWell, well - Mr. Mayor couldn't pay up. I can't say that I'm surprised. The greedy bastard is more concerned about pocketing all that money masked as charity rather than paying his debts.I'm not a debt that you want to forget. I did, after all, kill that poor journalist that was putting his nose where it didn't belong. Not saying that I minded - no, not one bit. It's a high. Watching them writhe in pain, their bodies seizing up as every last drop of hope is drained from their wide eyes. I live for it - the thrill of killing. Not to mention it keeps my wallet nice and plump. My clients know when they say they'll pay - they better pay. Otherwise, I take what I want from them. In most cases, the result is their own blood on my hands. Not this time though. This time I wanted her, and I always get what I want.GABRIEL, which is the sequel to this novel, will be released no later than October 2015.",
  "genres": [
    "Dark",
    "Abuse",
    "Erotica",
    "Dark Romance",
    "Romance",
    "BDSM",
    "Suspense"
  ],
  "author": "Bonny Capps",
  "average_rating": "3.56",
  "url": "https://www.goodreads.com/book/show/25631405-deliverance-for-amelia"
}