{
  "title": "Remember?",
  "description": "They endured hell to be together. Now Larry must suffer again to find his lost love. World famous singer, Larry Davis, frantically searches for his wife, Taylor, who has been missing for more than 18 months. He’s convinced he sees her in a London dress shop, but the lookalike tells him her name is Tiffany, and she is married to renowned neurosurgeon, Clive Bradford, Earl of Lantham.  Larry is certain Tiffany is really Taylor, and on an impulse, he gives her a ticket and pass to his evening performance at the Royal Albert Hall. His quest to prove he is right is fraught with unexpected danger as he follows a trail of passion, lust, betrayal, and revelation.  Review by Trish Jackson--- \"Follow famous singer Larry Davis on his desperate quest to find his missing wife, Taylor.  Cynthia B. Ainsworthe has done it again! Remember? -- Book number two in the Forbidden Series, and following the IPPY award winning novel, Front Row Center—will take you on a journey fraught with danger, passion, and shocking surprises.  Famous singer, Larry Davis’ tour schedule has brought him to London, England, where he continues his desperate search for Taylor. His chances of finding her seem bleak, until he discovers a woman named Tiffany, who has lost her memory, and has no recollection of her life before her marriage to the titled and world renowned neurosurgeon, Clive Bradford, the Earl of Latham.  She looks exactly like Taylor. She speaks like Taylor. Could it be possible she really is Taylor? Or is that just another illusion? You won’t be able to put it down until you know the truth.\"  Review by Alexandria Matthews--  ‘Remember’ by Cynthia B. Ainsworthe, the sequel to the IPPY award-winning ‘Front Row Center’, is a fantastic contemporary romance novel following the lives of Taylor Allen and the world-famous singer and icon Larry Davis. Cynthia is a very gifted storyteller who effortlessly creates well-developed characters and engaging storylines. You are quickly drawn in and kept guessing about what will happen next. If you enjoy a dramatic and intriguing fast-paced love story that you can’t put down, then this is the book for you!\"--- Alexandria Matthews",
  "genres": [],
  "author": "Cynthia B. Ainsworthe",
  "average_rating": "4.60",
  "url": "https://www.goodreads.com/book/show/25634298-remember"
}