{
  "title": "KooKooland:  A Memoir",
  "description": "In the tradition of The Glass Castle and With or Without You, a bracingly funny and chilling true crime memoir about a girl's gutsy journey to escape her charismatic yet cruel father's reign - an unforgettable story of violence, love, and, ultimately, triumph.It's the 1960s in Manchester, New Hampshire, and little Gloria Norris is growing up in the projects. Her parents are Jimmy and Shirley, her sister is Virginia, and her cat is Sylvester. A photo might show a happy, young family, but only a dummkopf would believe that.  Jimmy's a wiseguy who relies on charm, snappy wit, and an unyielding belief that he's above the law; as his youngest daughter, Gloria is just like him. Or at least, she knows that she needs to stay on his good side so he doesn't brain her one. Jimmy is violent: he's passionate about hunting, horse races and slasher flicks, and he's prone to outbursts that have him screaming and reaching for his shotgun. Shirley, mild and meek as she is, tries to protect the girls from Jimmy's most brutal moments, but the thing with Jimmy is that it's his way or the highway. Virginia, older and wiser, tries to stand up to Jimmy. Gloria just wants to make him happy.  He takes Gloria everywhere. Fishing, hunting, drive-ins, and to his parents dingy bar - a hole in the wall with pickled eggs and pickled alkies. The only place Gloria can't go is the dive where Jimmy bets on horses. It's there, as she sits and waits for hours on end, that she imagines a life different from her own. Gloria's favorite of Jimmy's haunts? Hank Piasceny's gun shop. While Hank and Jimmy throw good-humored insults at each other, Gloria talks to Hank's daughter, Susan. Smart, pretty, kind, and ambitious, Susan is Gloria's idol. She represents everything Gloria wants to be - and can be, as long as she tries as hard in school. Just like Susan tells her too.  It's only when Hank commits an unspeakable act of violence, that Gloria and Susan suddenly find themselves on different paths. Hank's violence and Susan's grief serve as eerie warnings of a life to come, especially as Jimmy falls into a depression that has him making threats and reaching for his guns more often and with greater relish.  Against all odds, Gloria's fiery determination takes shape and she sets herself on a path away from the cycle of violence whirling around her - in her home, in the projects, in her small New Hampshire city and even in the national landscape where the assassinations of President Kennedy and Dr. Martin Luther King Jr. and the brutality of Vietnam underscore the tragedies she witnesses up close.  Gloria Norris's unconventional coming-of-age memoir jangles with electricity and suspense. The life of this gutsy young girl is unforgettable and inspiring, wrought with dark humor and tenderness. From the darkness her irrepressible pluck and determination emerges and Gloria triumphantly carves out a good life on her own terms.",
  "genres": [
    "Memoir",
    "Nonfiction",
    "True Crime",
    "Biography",
    "Book Club",
    "Biography Memoir",
    "Crime"
  ],
  "author": "Gloria  Norris",
  "average_rating": "4.10",
  "url": "https://www.goodreads.com/book/show/25639784-kookooland"
}