{
  "title": "Peace, Love, & Romance",
  "description": "For a limited time, ten of today's hottest and bestselling authors bring you Peace, Love & Romance - a collection of full-length novels (some sweet, some sizzling!) all celebrating women who have loved, lost, and triumphed. Out Of The Box, Regifted – Jennifer Theriot (Amazon Bestselling Author) With a new beginning on the horizon for Olivia and Ash, what could possibly stop them from finding their happily-ever-after? In the midst of joy, this blended family finds they have to trust in love and family bonds to get them through what is coming next...or self-destruct. How long can Ash keep parts of his life hidden from those who love him? Scary Modsters – Diane Rinella (Amazon Bestselling Author, two category Amazon Hot 100 Author) Rosalyn is ridiculed for her eclectic wardrobe and unconventional music collection. Niles’s offbeat character is her perfect complement. Sadly his flaws equate to relationship suicide. When Niles learns he can overcome his obstacles by helping the ghost of deceased rock deity Peter Lane avenge murder, how far will he go to secure Rosalyn’s heart? Cheating To Survive – Christine Ardigo Cheating to Survive weaves the story of three Norlyn Plains Hospital coworkers and their seemingly perfect lives. However, their marriages are anything but ideal. When they decide to cheat on their husbands, will they find happiness or be destroyed by the consequences? Christine Ardigo handles infidelity realistically and humorously. It will resonate in some way with every woman on the planet. Chain of Title - Robyn Roze Newly divorced Shayna wants adventure, and Sean wants her. But the revelation of her ex-husband’s dirty secret sets off a chain of events with deadly consequences that reveals who Sean really is and leaves Shayna to question how well she knew either man. Robyn Roze weaves a story of love, loss, betrayal, and ultimately forgiveness. A Different Kind Of Forever - Dee Ernst (Amazon Bestselling Author) Michael is a hot, young rock star. Diane is a single mom almost twenty years older. When they meet, the attraction is immediate. He knows she’s the real thing. She can’t ignore her feelings for Michael, but can’t see past their differences. A Different Kind of Forever is about two complicated people finding—and trying to hold on to— love. Tahoe Blues – Aubree Lane (Amazon Bestselling Author) When Cara finds the glitz and glitter of casino life isn’t what it’s cracked up to be, she divorces her husband, finds a new love, a new home, and new piece of jewelry around her ankle. Under house arrest for a crime she didn’t commit, Cara must rely on a zany group of misfits to help set her free. Tropical Nightmares – Kelly Cozzone (Amazon Bestselling Author) The tranquil life David Murphy and Tiana Alexander built on St. Lucia is threatened by the dangerous and vengeful Robert Dubose. Can they survive his lust for revenge, or will his secret partner succeed where he failed? Can their love survive, or will it be the final casualty? The Fizgig – Jill Cox Vogt (Westmoreland Arts & Heritage Competition Winner) Daisy Young believes that when life hands you lemons, eat chocolate and get on with it, but no amount of candy gets her mind off her drowned fiancé—until she flees to East Tennessee’s mountains and meets a man with a dark, secret past. Doubling Back To Love - Rebecca Warner (Great Southeast Book Festival Top 10, Honorable Mention)Lexi Avery asks, \"Why does it have to come down to choosing just one man, when no one man can give me everything I want?\" Why indeed? Follow her tantalizing adventures as she explores love's options. Sex and the Widow Miles - Nan Reinhardt (Amazon Bestselling Author) Julie is anticipating an idyllic retirement with her husband, Charlie, when he dies suddenly. She meets a younger man, Will, and embraces life—and sex—again. But a dark secret reveals her perfect marriage may have been a lie. Jules goes in search of the truth and finds there’s always a seco",
  "genres": [],
  "author": "Jennifer Theriot",
  "average_rating": "4.53",
  "url": "https://www.goodreads.com/book/show/25636834-peace-love-romance"
}