{
  "title": "HIDDEN MICKEY ADVENTURES 4: Revenge of the Wolf",
  "description": "HIDDEN MICKEY ADVENTURES 4Revenge of the WolfThe 8th Hidden Mickey Adventure Mystery by Nancy Temple Rodrigue.  Thestory line revolves around Walt Disney and Disneyland,written forAdults, Teens, & Tweens (age 9 & up). Hidden Mickey Adventuresseries, volume 4.TWO ADVERSARIES FINALLY FACE OFFUnwillingly hurled into the past, Wolf must confront the mysterious Omah in a final showdown. What will they do when secrets are revealed? Will they be able to put the past behind them and work together?PETER MUST GO TO NEW HEIGHTS TO FOLLOW THE CLUESArmed with a new set of clues, Peter and Catie find themselves in parts of Disneyland they never expected to see. Wolf is still missing. Can Adam and Beth help see them to safety without Wolf?WHO REALLY WROTE THE CLUES?An old enemy is back. Determined to retrieve a cherished possession that has been lost for eons, she will stop at nothing to get it back--even if it means sacrificing Peter.NOW IS THE TIME FOR REVENGEDisneyland--then and now--is the backdrop for this exciting tale of revenge as the past and the present come crashing together. Revenge of the Wolf fits more pieces of the puzzle together as our friends and heroes fight to protect Walt Disney's legacy--and each other.The story continues with... HIDDEN MICKEY ADVENTURES 5: When You WishAnother \"E-Ticket\" ride through Disney's history.Want to go on your own 'E-Ticket' adventure? Next time you visit a Disney Park you can play in Quests like Adam & Lance by bringing with you a copy of HIDDEN MICKEY ADVENTURES in Disneyland - HIDDEN MICKEY ADVENTURES in Disney California Adventure , and for our east coast HIDDEN MICKEY ADVENTURES in WDW Magic Kingdom (or download one to your mobile device).Hidden Mickey Adventures 4: Revenge of the Wolf is Flesch-Kincaid Grade 3.5 - Flesch Reading Ease 86.8",
  "genres": [],
  "author": "Nancy Temple Rodrigue",
  "average_rating": "4.48",
  "url": "https://www.goodreads.com/book/show/25641427-hidden-mickey-adventures-4"
}