{
  "title": "Lightspeed Magazine, Issue 61, June 2015: Queers Destroy Science Fiction!",
  "description": "LIGHTSPEED is an online science fiction and fantasy magazine. In its pages, you will find science from near-future, sociological soft SF, to far-future, star-spanning hard SF--and from epic fantasy, sword-and-sorcery, and contemporary urban tales, to magical realism, science-fantasy, and folktales. Even in science fiction, supposedly the genre of limitless possibility, where everyone is invited to the adventure, heterosexual, heteroromantic, and cisgendered are considered the default, to the extent that everything else is \"deviation,\" and must be eyed with suspicion. LIGHTSPEED was founded on the core idea that all science fiction is real science fiction. The whole point of this magazine is that science fiction is vast. It is inclusive. Science fiction is about people, and queer people, no matter how they identify [Gay, lesbian, bisexual, demisexual, asexual, pansexual, intersex, transgender, genderfluid, genderqueer--anyone who fits within the QUILTBAG], are a big part of that. They always have been. They're just sometimes harder to see. So, in the interests of visibility and breaking stuff, Queers Destroy Science Fiction! will show you just how wide the spectrum of sexuality and gender identity can really be. This special all-queer issue features original science fiction short stories from John Chu, Kate M. Galey, Bonnie Jo Stufflebeam, Chaz Brenchley, Felicia Davin, Rose Lemberg, Jessica Yang, K.M. Szpara, Amal El-Mohtar, Tim Susman, and Susan Jane Bigelow. Plus, we have original flash fiction from E. Saxey, Charles Payseur, Claudine Griggs, Stephen Cox, Eliza Gauger, Erica L. Satifka, Gabrielle Friesen, Gabby Reed, Shannon Peavey, Sarah Pinsker, Bogi Takács, and JY Yang, and reprints by RJ Edwards, AMJ Hudson, Raven Kaldera, Rand B. Lee, and Geoff Ryman. All that, and we also have our usual assortment of author and artist spotlights, along with our latest book review column and an assortment of nonfiction features, plus more than twenty personal essays from writers about their experiences being queer reading and writing science fiction.",
  "genres": [
    "Science Fiction",
    "Short Stories",
    "Queer",
    "LGBT",
    "Anthologies",
    "Fiction",
    "Fantasy"
  ],
  "author": "Seanan McGuire",
  "average_rating": "3.93",
  "url": "https://www.goodreads.com/book/show/25644705-lightspeed-magazine-issue-61-june-2015"
}