{
  "title": "Flax's Pursuit",
  "description": "Flax's Pursuit by Angel Martinez and Bellora Quinn \nBook two in the AURA series\n\nA murderer haunts the city, turning the unwary to stone. Between hunting this evil and corralling new arrivals, Flax struggles to guard both his life and his heart.\nQuinn and Valerian have come through the trials of facing an undead lich queen and the perils of falling in love. Now they work to restore AURA to its previous strength and efficiency while navigating their new life with each other. Fortunately, they’re not in this alone.Kai Hiltas has taken over as the head of the research department at AURA and has become everyone’s favourite workaholic, everyone except his lover Tenzin, who has had enough of his late nights and broken promises. As Kai tries to salvage his relationship, he finds a teacher for Quinn, who also happens to be one of Valerian’s new officers, Flax Wolfheart, a sexy elf with trouble written all over him.Flax has motives beyond simply teaching Quinn to control his magic. He’s trying to recover from his own losses and failures, but he has a plan. The two newest elvish crossovers, Ash and Sage, are sizzling hot and might even like him. With them as backup as he tracks a deadly stone mage and figures out how to teach Quinn, Flax sees his chance to impress Val and snag a place by his captain’s side. On the hunt for both danger and redemption, Flax’s pursuit leads him ultimately down trails he never expected. The AURA series AURA, the Agency of Unnatural Resettlement and it’s a weird job, but somebody’s got to do it.A magical catastrophe tears the fabric of reality, causing unpredictable holes between worlds through which anything might fall—elves, centaurs, trolls, yeti. The brave officers and employees of AURA struggle daily to help the lost and injured, and contain the irretrievably violent while their research staff scramble to find a way to reverse the effect.Anything can and does pop through into the human world, sometimes with disastrous and deadly results. It’s a race against time to see if the AURA mages can repair reality and stop the inter-dimensional flood before something crosses over that proves strong enough to destroy the world. About Angel Martinez The unlikely black sheep of an ivory tower intellectual family, Angel Martinez has managed to make her way through life reasonably unscathed. Despite a wildly misspent youth, she snagged a degree in English Lit, married once and did it right the first time, (same husband for almost twenty-four years) gave birth to one amazing son, (now in college) and realized at some point that she could get paid for writing.Published since 2006, Angel's cynical heart cloaks a desperate romantic. You'll find drama and humor given equal weight in her writing and don't expect sad endings. Life is sad enough.She currently lives in Delaware in a drinking town with a college problem and writes Science Fiction and Fantasy centered around gay heroes. About Bellora Quinn Originally hailing from Detroit Michigan, Bellora now resides on the sunny Gulf Coast of Florida where a herd of Dachshunds keeps her entertained. She got her start in writing at the dawn of the internet when she discovered PbEMs (Play by email) and found a passion for collaborative writing and steamy hot erotica.",
  "genres": [
    "M M Romance",
    "Fantasy",
    "Urban Fantasy",
    "Paranormal",
    "Magic",
    "M M M",
    "Romance"
  ],
  "author": "Angel  Martinez",
  "average_rating": "3.94",
  "url": "https://www.goodreads.com/book/show/25642100-flax-s-pursuit"
}