{
  "title": "Zombie Apocalypse Trilogy:",
  "description": "This boxed set includes all four books in Chelsea Luna’s BESTSELLING young adult Zombie Apocalypse trilogy – Love & the Zombie Apocalypse (Book 1), Death & the Zombie Apocalypse (Book 2) and Revenge & the Zombie Apocalypse (Book 3). Three books for the incredible low price of $9.99. Love & the Zombie Apocalypse - Book 1 Seventeen-year-old Rachel Cole was ecstatic when her little sister Morgan left for science camp at the University of Michigan – anything that would get Morgan out of their horrible foster home for a few weeks. Little did Rachel know that life as she knew it was about to change forever. A suspected biological terror attack has spread over the northern half of the country causing the dead to reanimate and attack the living. The sudden attacks have catapulted Middle America into an all-out war zone. Zombies have swarmed the City of Flint and Rachel must battle through the infected streets to rescue Morgan. Along the way, Rachel meets Cage Vance – the local star quarterback dealing with his own personal demons. Rachel is immediately attracted to Cage, but who has time for love during the zombie apocalypse? Can Rachel and Cage’s small group of friends survive the journey to Ann Arbor and rescue Morgan? Or are they already too late? Death & the Zombie Apocalypse - Book 2 All hope is lost. The zombies have stormed the University of Michigan’s Peabody Dormitory and there’s no way out of the building. Cage is missing and possibly dead. Rachel and her group of friends must somehow escape Ann Arbor and venture to the safe zone at Ford Field in Detroit. As America turns into a wasteland of death and destruction, Rachel and her small group of survivors learn that the growing number of zombies isn’t their only problem — food and water supplies are dwindling, rogue gangs are terrorizing the cities and there is a rumor that the country will soon go dark as small pockets of America have already lost electricity. Can Rachel and her friends make it to the safe zone? Revenge & the Zombie Apocalypse - Book 3 Revenge & the Zombie Apocalypse is the epic conclusion to the Zombie Apocalypse Trilogy. The zombie outbreak has ravished the country for over two weeks. Rachel and her friends are at their breaking point. They have suffered casualties, unspeakable horrors, murder and betrayal. To survive, the battered group must continue on through the great expanse of the American wasteland. Their only hope lies at Camp Freedom Two in Las Vegas—the last major survivor camp still safeguarded by the military. The long journey from Michigan to Nevada is filled with the undead. Danger lurks in every twist of the road. Will the group survive? Can they work together and overcome their struggles? Chelsea Luna is the author of two best selling young adult series, New England Witch Chronicles and Love & the Zombie Apocalypse. Chelsea received a Juris Doctorate from New York Law School in New York, New York in 2007, and a B.A. in Sociology, with a concentration in Criminal Justice, from the University of Tennessee in 2004. Chelsea lives in middle Tennessee.",
  "genres": [],
  "author": "Chelsea Luna",
  "average_rating": "4.50",
  "url": "https://www.goodreads.com/book/show/25655033-zombie-apocalypse-trilogy"
}