{
  "title": "The Pharaoh's Cat",
  "description": "Suddenly talking and walking upright, a stray tomcat in ancient Egypt becomes the young Pharaoh’s intimate and, when accused of his murder, time travels to New York City and learns how to raise him from the dead.The cat is quick-witted, wisecracking narrator as well as free-spirited, ever-curious protagonist, and the story he tells is an exotic, imaginative, spell-binding tragicomedy. The novel interweaves feline and human, past and present, natural and supernatural. It contains numerous surprises, twists and turns, intriguing characters, both human and animal, fascinating revelations about ancient Egyptian history and culture.While exploring a looted tomb in ancient Egypt, the cat is kicked in the ass by the Vizier, the Pharaoh’s uncle and the second in power only to him. Able to speak as a result, the cat immediately gives voice to his intelligence and sense of humor and captivates the young Pharaoh, making him laugh for the first time since his parents’ death. The cat becomes the Pharaoh’s constant companion and, at the royal palace and on a tour of Egypt, participates in the festivities, developing an insatiable appetite for good food, wine, and gossip. Gradually, he renews the Pharaoh’s ability to enjoy life and inspires him to become a stronger leader. The bond of selfless love they share will change Egypt’s destiny.The cat has a good friend in the High Priest of the god Amun-Ra and seeks his help in solving the mystery of his human powers and the supernatural manifestations that plague him. He has a mortal enemy in the cat-kicking Vizier, who hates him for his close relationship with the Pharaoh. The Vizier eventually murders the Pharaoh and accuses the cat, who flees by time-traveling with the High Priest to New York City, where they find an ally in an Egyptologist’s daughter.In New York, they go to an ancient Egyptian exhibit, end up in Central Park, then at a cathedral, and later retrieve a lost spell to revive the dead. They return to Egypt to revive the Pharaoh, but the spell fails to work till Bastet appears to ask the cat to give his life in return for the Pharaoh’s. He says yes, but Bastet only needed him to agree for the spell to work. The Pharaoh is resurrected, kills the Vizier in battle, then returns to the world above after making the High Priest pharaoh in his place.he High Priest reigns for seven years with the cat at his side. A rebellion forces them to return to New York City, where they find Elena pregnant with the High Priest’s child. For her, only months have passed. The cat immediately senses that the child she carries is the Pharaoh reincarnated.Maria Luisa Lang was born in Rome and lives in New York City. She has an art degree and is an amateur Egyptologist. The Pharaoh's Cat is her first novel. She has also published The Eye of Nefertiti, a second Pharaoh’s cat novel.",
  "genres": [
    "Fantasy",
    "Fiction",
    "Egypt",
    "Historical Fiction",
    "Historical",
    "Time Travel",
    "Humor"
  ],
  "author": "Maria Luisa Lang",
  "average_rating": "4.22",
  "url": "https://www.goodreads.com/book/show/25651660-the-pharaoh-s-cat"
}