{
  "title": "Give Me Your Answer True",
  "description": "\"What I feel has no name...\" Suanne Laqueur's award-winning debut novel The Man I Love thrilled readers with its memorable characters and depth of emotion. Erik Fiskare's journey of love, recovery and forgiveness captivated hearts but also left questions unanswered. Now Daisy Bianco has a chance to tell her story. It's been three years since a single lapse of judgment cost Daisy the love of her life. Erik was a conduit to her soul but now he's chosen a path of total disconnection, refusing to speak to her or acknowledge her betrayal. Alone and shattered, Daisy attempts to take responsibility for her actions while building her career as a professional dancer in New York City. But Erik's unforgiving estrangement proves too much for her strength. Plagued by flashbacks to the Lancaster shootings, she falls into a dangerous spiral of self-harm, cutting into her own skin as a means to atone. Only the timely appearance of an old friend, John \"Opie\" Quillis, saves her from self-destruction and gives her a chance to love again. Laqueur skillfully weaves flashbacks to the college years with Daisy's present life. Supported by John's patient affection, she works to separate her evolution as an adult from the unresolved guilt and grief of her youth. As her professional accomplishments lift her out of depression, Daisy learns to hold onto her accountability without letting it become her identity. Years pass and she builds a beautiful life filled with dance and friends. Lovers come and eventually go, leaving her on her own with the old thought: Come back to me. In this parallel narrative, Laqueur peels open the beloved characters from The Man I Love to reveal new and complex layers of vulnerability. The scars from the shooting are deep and pervasive within this circle of friends. Like Daisy, they are trying to evolve without being fully resolved. But when questions from the past go unheeded, you alone must find and give your answers true.\"One doesn't read Laqueur's novels, you experience them... These characters are like people I know and I'm not going to forget them any time soon.\" --Emma Scott, author of RUSH \"Laqueur crafts these characters and knows their ins and outs and bones and blood so well. As readers, we are sucked into their lives. We feel what they feel. We ache when they ache. We cry when they cry. And we miss them desperately when the story is over. This is the gift Laqueur has given to us with her writing.\" --Mary Frame, author of of Imperfect Chemistry and Imperfectly Criminal \"Laqueur has a way of getting to the essence of a scene or character with just a few words carefully placed. They're gorgeous and sad filled with hope and hopelessness and fully intent on drawing you in. Give Me Your Answer True is the kind of book you think about long after it's over...\" --Kayti Nika Raet, author of The Monster Chronicles \"Five stars. Give Me Your Answer True is further affirmation that Suanne Laqueur is a truly gifted writer and knows how to create lasting memory through her superb storytelling ability.\" --Diane Lunsford, Feathered Quill Book Reviews",
  "genres": [
    "Romance",
    "Contemporary Romance",
    "Contemporary",
    "Second Chance",
    "New Adult",
    "Fiction",
    "Mental Health"
  ],
  "author": "Suanne Laqueur",
  "average_rating": "4.55",
  "url": "https://www.goodreads.com/book/show/25649729-give-me-your-answer-true"
}