{
  "title": "Ethan",
  "description": "A paranormal erotic romance novel. Meet the supernatural masters of passion and seduction, feeding upon the erotic dreams and pleasure of humankind.Ethan is an incubus, cast out of the covey by his succubus queen, after his actions directly led to the death of another incubus. He adopts the business of a dead man, and attempts to live as a mortal.When Ethan finds Madison, he knows he should just fly away and leave her to live a normal, human life. But the incubi are hive creatures, he struggles living alone, and allows himself to believe he might find love and happiness in the arms of this shy young woman.Meanwhile, the demonic creature hunting the incubi will not stop with the death of just one black-winged male, he seeks the destruction of Ethan's entire species. After Ethan leaves, the covey is attacked again, and half of the remaining brothers are destroyed, leaving only two surviving males to protect their succubus queen. It is not enough.The queen leads her mates in tracking down Ethan, hoping that the forsaken warrior might save them from starvation. It is a choice which will place the entire covey, as well as Ethan and Madison, directly into the path of the bloodthirsty monster hunting them. This book contains explicit demon erotica and is intended for readers 18 years and older, there is strong language and explicit sexual encounters, including a steamy ménage scene near the end of the book. As the legends suggest, both incubus and succubus demons feed upon sexual energy stolen from sleeping humans. While this might suggest questionable consent, they are actually very generous and considerate lovers.Celeste Hall's Seduction Book #1 EthanBook #2 KyeBook #3 RicoBook #4 GavinBook #5 All The Queen's MenBook #6 The Brothers SinThe Seduction Series Boxed The first five erotic stories in one collection!",
  "genres": [
    "Paranormal",
    "Romance",
    "Erotica",
    "Paranormal Romance",
    "Vampires",
    "Fantasy",
    "Menage"
  ],
  "author": "Celeste Hall",
  "average_rating": "3.82",
  "url": "https://www.goodreads.com/book/show/11593034-ethan"
}