{
  "title": "Light Love Rituals: Bulgarian Myths, Legends, and Folklore",
  "description": "• Discover Ancient Bulgarian Myths, Legends, Folklore, and Mythology• Meet Heroes from Greek Mythology with Thracian Origins• Enjoy Diverse, Delicious Modern and Traditional Bulgarian RecipesA book for children and adults from 8 to 108 who would like to take a journey and discover Bulgarian folk tales, legends, and mythology. Whether you want to learn a little about their ancient Thracian origins, or you want to experience rituals practiced throughout the year with a fictitious Bulgarian family, or even if you’re only interested in traditional Bulgarian cuisine, this book has something for everyone.Bulgarian culture is rich in folklore and traditions surviving since the days of the ancient Thracians. As pagan and Christian religions collided, many celebrations merged into one.“Light Love Rituals” will take you on a journey to discover these unique festivals.• Illuminated by the light of the full moon, a woman in a long, white robe holds an icon while she dances in a trance over burning coals. The mystical music of a shepherd’s pipe plays in the background.• Women dressed in colorful outfits dance in a circle, then pass through an enormous wreath made of magical healing herbs.• Wild spring flowers decorate the hair of young girls. Laden with baskets filled with colorful Easter eggs, the youths travel from house to house singing to bring health and prosperity to the village.• Men clothed like wild animals with colorful, scary masks parade around a village. Attached around their waists, giant cow bells resound announcing their arrival. The men jump and yell to scare away evil spirits.\"Light Love Rituals,\" not only describes the rituals, but also makes them interesting and understandable to people of all ages. The book is divided into four seasons, beginning with winter. It includes activities where you can learn how to make martenitsi, survachka, and Easter eggs dyed with natural colors. A short quiz after each season lets you test your knowledge of what you’ve read. To help you engage in the traditions in the book, you’ll meet Maria and her family. They’ll open the doors of their home so you can participate in these celebrations along with them.",
  "genres": [
    "Mythology",
    "Nonfiction",
    "Spirituality",
    "Bulgaria"
  ],
  "author": "Ronesa Aveela",
  "average_rating": "4.50",
  "url": "https://www.goodreads.com/book/show/25650581-light-love-rituals"
}