{
  "title": "Harry Watt Bounty Hunter: 2150 AD - And Harry's Life Just Got More Complicated",
  "description": "Reader's Favorite 5 Star Review\"....Rob Guy combines old-fashioned thrillers a la Raymond Chandler and Dashiell Hammett with futuristic science fiction-and it works!... The book is very well written, without a lot of unnecessary detail. All in all, Harry Watt, Bounty Hunter is a very entertaining little book that will appeal to fans of detective novels and science fiction alike.\"Raanan Geberer - Reader's Favorite\"What becomes immediately evident in reading Rob's books is that not only has he a fine sense of imagination to create unusual stories, but that he accompanies that with a fine tuned sense of humor that is too often lacking in sci-fi novels and indicates that he may just have a strong hold on a fruitful career In his chosen genre.\"5 Star rating - Grady Harp, Amazon Top 100 Reviewer2150 AD.The Earth is running out of water. On Mars, civil war is looming, which is a pity because there's enough of the wet stuff out there to last the human race for a thousand years.Eager to get their hands on it is Hansel & Gretel, a multi-planetary corporation hell bent on owning every resource in the solar system.WHEN an employee of Hansel & Gretel is accused of theft and then high-tails it to Mars, enter Harry Watt, a would-be bounty hunter who doesn't much care for the water crisis as long as there's enough of the stuff to put ice in his bourbon. Now, a trip to the Red Planet sounds like fun, but our man soon discovers something stinks about his latest case, and it's not one of his socks. To try and find the answers, Harry must first travel to Venus Station. But it's not easy to be in two places at once, and getting framed for murder doesn't help, either.AS the case unravels, Harry must call on all his skills and charm to crack the secret of Mars. His dead partner, an erstwhile assistant, and a host of lady friends lend a hand too.IDEAL for fans of The Hitchhikers Guide to the Galaxy or The Stainless Steel Rat, Harry Watt Bounty Hunter will take you on a non-stop thrill ride across the solar system. With a few laughs and the odd bourbon-on-the-rocks thrown in along the way.",
  "genres": [
    "Science Fiction",
    "Fantasy",
    "Mystery"
  ],
  "author": "Rob Guy",
  "average_rating": "3.81",
  "url": "https://www.goodreads.com/book/show/25649066-harry-watt-bounty-hunter"
}