{
  "title": "A Menina Submersa: Memórias",
  "description": "A Menina Submersa: Memórias é um verdadeiro conto de fadas, uma história de fantasmas habitada por sereias e licantropos. Mas antes de tudo uma grande história de amor construída como um quebra-cabeça pós-moderno, uma viagem através do labirinto de uma crescente doença mental. Um romance repleto de camadas, mitos e mistério, beleza e horror, em um fluxo de arquétipos que desafiam a primazia do “real” sobre o “verdadeiro” e resultam em uma das mais poderosas fantasias dark dos últimos anos. Considerado uma “obra-prima do terror” da nova geração, o romance é repleto de elementos de realismo mágico e foi indicado a mais de cinco prêmios de literatura fantástica, e vencedor do importante Bram Stoker Awards 2013.O trabalho cuidadoso de Caitlín R. Kiernan é nos guiar pela mente de sua personagem India Morgan Phelps, ou Imp, uma menina que tem nos livros os grandes companheiros na luta contra seu histórico genético esquizofrênico e paranoico. Filha e neta de mulheres que buscaram o suicídio como única alternativa, Imp começa a escrever um livro de memórias para tentar reconstruir seus pensamentos e lutar contra o que seria “a maldição da família Phelps”, além de buscar suas lembranças sobre a inusitada Eva Canning, sua relação com a namorada e consigo mesma, que evoca em muitos momentos a atmosfera de filmes como Azul é a Cor mais Quente (Palma de Ouro em Cannes, 2013) e Almas Gêmeas (1994), de Peter Jackson.Não se assuste: é um livro dentro de um livro, e a incoerência uma isca para uma viagem mais profunda, onde a autora se aproxima de grandes nomes como Edgar Allan Poe e HP Lovecraft, que enxergaram o terror em um universo simples e trivial – na rua ao lado ou nas plácidas águas escuras do rio que passa perto de casa – , e sabem que o medo real nos habita. Caitlín dialoga ainda com o universo insólito de artistas como P.G. Wodehouse, David Lynch e Tim Burton, e o enigmático personagem Sandman, de Neil Gaiman, com quem aliás, trabalhou, escrevendo The Dreaming, spin-off derivado da obra-prima de Gaiman. A Menina Submersa evoca também as obras de Lewis Carrol, Emily Dickinson e a Ofélia, de Hamlet, clássica peça de Shakespeare, além de referências diretas a artistas mulheres que deram um fim trágico à sua existência, como a escritora Virginia Woolf.Com uma narração intrigante, não-linear e uma prosa magnífica, Caitlín vai moldando a sua obsessiva personagem. Imp é uma narradora não-confiável e que testa o leitor durante toda a viagem, interrompe a si mesma, insere contos que escreveu, pedaços de poesia, descrições de quadros e referências a artistas reais e imaginários durante a narrativa. Ao fazer isso, a autora consegue criar algo inteiramente novo dentro do mundo do horror, da fantasia e do thriller psicológico.A epígrafe do livro, retirada de uma música da banda Radiohead – “There There” –, diz muito sobre o que nos espera: “Sempre há um canto de sereia lhe seduzindo para o naufrágio”. A Menina Submersa é como esse canto, que hipnotiza até que tenhamos virado a última página, e fica conosco para sempre ao lado de nossas melhores lembranças.",
  "genres": [
    "Horror",
    "Fantasy",
    "Fiction",
    "LGBT",
    "Queer",
    "Paranormal",
    "Urban Fantasy"
  ],
  "author": "Caitlín R. Kiernan",
  "average_rating": "3.71",
  "url": "https://www.goodreads.com/book/show/25660470-a-menina-submersa"
}