{
  "title": "Ardently: A Pride and Prejudice Variation",
  "description": "So much in life depends on chance and sheer luck. How much do we often owe to being in the right place at the right time?  In Jane Austen's Pride and Prejudice, Elizabeth Bennet plans to visit the Lake District with her uncle and aunt, yet ends up at Pemberley instead, just as, by coincidence, Mr Darcy also arrives home. They meet, understand one another better and all eventually ends well.  But what if they did not have such luck? What if Elizabeth actually went to the Lake District and was nowhere near Pemberley, and she and Mr Darcy never met again until another four years had gone by?  Now they are very different people, altered by marriage, time and situation, although, Mr Darcy's failed proposal in the Parsonage at Hunsford still haunts both of them in different ways.  Elizabeth is a companion to her Aunt, Mrs Mountford, a widow of great standing in society who married exceptionally well and 'Miss Bennet' finds herself accepted in the very best of circles and able to marry whomever she might chose.  Mr Darcy did his duty by his sickly cousin, Anne de Bourgh, and married her to protect her from the tyrannical force of her mother Lady Catherine. He has come to Bath, however, a widower, with his family, the Fitzwilliams, and his sister, Georgiana. Darcy sees Elizabeth, the woman who rejected him, in the opposite box at the theatre and cannot help falling in love with her all over again. Now though, it seems there are even more hurdles to overcome for them to be together, including Elizabeth's new suitor, the handsome and charming Mr Yorke.  Mr Darcy is still a little proud, still not able to 'perform to strangers'. Can Elizabeth see past his reserve and awkwardness to the decent man underneath?  This book is a re-telling of Pride and Prejudice from Chapter 36 onwards (Darcy's failed proposal and the delivering of his letter).",
  "genres": [
    "Romance",
    "Historical",
    "Historical Fiction",
    "Regency",
    "Historical Romance",
    "Retellings",
    "Fiction"
  ],
  "author": "Caitlin  Williams",
  "average_rating": "4.38",
  "url": "https://www.goodreads.com/book/show/25656343-ardently"
}