{
  "title": "La Torre Oscura VII - Tomo 2 of 2",
  "description": "Човекът в черно бягаше през пустинята и Стрелецът го следвашеИзминали са много години, откакто Кинг подхваща епичното повествование за последния оцелял стрелец; сега той приключва вълнуващия си разказ, подреждайки последните късчета от пъзела: „И така, Верни читатели, можете да спрете дотук. Надявам се обаче, че сте дошли да чуете интересна история, а не да разберете какво се случва накрая, иначе е достатъчно само да прелистите на последната страница и да прочетете написаното. Обаче краят е безсърдечен. Краят е заключена врата, която никой не може да отвори.“Финалът на Тъмната кула вече настъпи - какъв е той, разберете сами, ако ви стискаЗавършването на тази поредица е като прекратяването на връзка, която не искате да прекъснете, но се налага. Ще съжалявате безкрайно, че краят е дошъл, ще искате ОЩЕ. Роланд е обречен да започне от самото начало и да поднови търсенето на Тъмната кула, защото КА е колело и той е завързан за него.Краят на историята от поредицата „Тъмната кула“ на Стивън Кинг идва зловещ и неочакванТака започва поредицата за Тъмната кула, най-мащабната и най-епичната творба на Стивън Кинг. Фентъзи, изумителни приключения… и дълбоки прозрения за човешката природа, за приятелството, любовта и предателството.Роланд от Гилеад, последният Стрелец, преминава през паралелни светове и се сблъсква с невъобразимото. Олицетворение на самотния герой от древните митове и от класическите уестърни, той извършва подвизи (и понякога предателства) в името на една-едничка цел – да открие и да запази мистичната връзка между всички светове, всички вселени – ТЪМНАТА КУЛА.Членовете на Роландовия ка-тет отново са заедно, ала цената, която плащат, е твърде висока. В заключителния епизод от историята те изминават последния етап от пътя към Тъмната кула. Макар да са спасили Сузана, ще се изправят пред врагове, с които трябва да се справят и които могат да ги унищожат.",
  "genres": [
    "Fantasy"
  ],
  "author": "Stephen        King",
  "average_rating": "4.33",
  "url": "https://www.goodreads.com/book/show/11594.La_Torre_Oscura_VII_Tomo_2_of_2"
}