{
  "title": "A Paradise of One",
  "description": "An elderly man is left in a Honolulu city park, abandoned by his caregivers, his family and his past.In a bid to defend a young woman he finds himself befriended by a unique group of homeless people helping those in a difficult where the beauty inherent in their tropical surroundings encourages empathy, and hope.From Waikiki to Waimanalo beach his adventures help him discover the magic inherent in people who help. Eventually, he discovers a beauty of a deeper source. Just in time.Peacock takes us on another deeply insightful and in-depth view of life in Hawaii. An elderly man, with an adventurous past, and an increasing dose of dementia, is abandoned at a city park in Waikiki. Coming to the aid of a prostitute being attacked, they enter an unusual alliance of trust and survival on the streets of Honolulu, and the beaches of Waimanalo. Eventually, they settle into their final states of being, shaped by the tropical wonder around them, and each other. This is a story you won't soon forget.\"Oh my god!\" the young woman says loudly. Then she says it again, very softly. She looks up at me, still sitting on her recently kicked butt. \"Is he dead?\"\"No way,\" I say, looking down at the growing pool of red that is making its way toward the storm drain. \"Well,\" I re-evaluate. \"Maybe.\"The young woman stands up and grabs my hand. \"Well, if he's not, he's gonna kill me. And, if he is, we're both in trouble.\"I pull back against her hand, more in habit than anything else. She holds tight. Her strength reminds me of the nurses at the dying place. \"I've got to wait on Aunt whats-her-name. She's coming before dark.\"\"Old man, it's already way past dark. Your ride isn't coming.\" She pulls me back around to the side of the restroom, as some of the park people began moving slowly over to where the blood is spilling into the storm drain. I can hear it splashing.She pushes me up against the restroom wall, and I can see buses and taxi cabs moving along the street behind her. Her perfume is overwhelming. I look down at her and am suddenly horrified.\"No! No thank you,\" I say feeling my face flush with embarrassment. \"I don't have any money.\"She takes a step back and laughs gently. I feel like she is being polite, trying not to mock my fear.\"Silly boy, I'm not here for that.\" She smiles in perhaps the most beautiful way I can remember ever seeing anyone smile. She was, at least for that moment in the shadows, angelic. \"What's your name, cowboy?\"I felt too embarrassed about my earlier embarrassment to answer.\"I'm Rainbow,\" she says proudly, holding her hand out to me.I am at a loss for words, for several reasons. But, she has called me cowboy, so I go with that.\"Cowboy,\" I say and take her hand. It is so warm I don't want to let go.Rainbow shakes my hand and then peels hers away. \"Let's go, Cowboy. This is now a crime scene, and I'm on probation.\"I watch her sprint for the street. She turns for me when I don't follow, runs back to grab my arm and leads us both out of the park, onto the sidewalk. She confidently steps out onto Kuhio avenue and pulls up her skirt along one leg which has a strange magnetic effect on two taxis.She pulls me into the first one, reaches over my lap to pull the door closed, brushing her young breasts against what used to be my dangerous parts.\"Waikiki!\" she tells the driver. She leans back into her seat and lets her head rest, closing her eyes, apparently content we have escaped something.I watch out the dirty window as we leave the crime scene, then sadly look into my non-responsive lap and see another one.",
  "genres": [],
  "author": "Everett Peacock",
  "average_rating": "4.60",
  "url": "https://www.goodreads.com/book/show/25660616-a-paradise-of-one"
}