{
  "title": "Night People",
  "description": "IN THIS FAST-MOVING ADVENTURE AND ROMANCE-FILLED MEMOIR THAT READS LIKE A NOVEL, A young Midwestern singer and his vocalist friends experience the transformative power of love, loss, and music in a chaotic West Coast adventure in the 1960s. If you liked memoirs from Bruce Springsteen, Robbie Robertson, Carly Simon, Keith Richards, and Patti Smith, you're sure to enjoy Night People.\"I didn't want to believe how much you've changed, but you're a different person here. You live at night here, your friends are night people and you're becoming one, too. You hardly see daylight on weekends. Here it is, nearly dusk, and you're leaving to play music all night again to entertain your new friends--your new girlfriend--all the new people in your new life.\"In 1965, Larry's rock and roll vocal group is disintegrating along with his marriage to his high school sweetheart. Despite his resolution to turn his life around in Indianapolis, he finds himself reunited with his scattered-to-the-winds friends in distant San Francisco struggling to re-make themselves into a rock band in the dive clubs of the Bay Area.Barely surviving the transformation, they struggle to avoid the dangers,temptations, and insecurities waiting to trip them up in their new life. As the band scrambles to overcome, or at least endure, every obstacle in its path, Larry faces a painful choice that will result in loss fort hose he loves no matter how he decides.Their strong voices and new skills are a potent combination. Soon, Larry and his new band are plunged into a breathtaking journey through mob-run nightclubs, Las Vegas showrooms and backrooms, famous Hollywood night spots, top West Coast recording studios, celebrity managers--and passionate romance.Everything they've ever dreamed of is just around the next corner.Night People's adventure is set against the backdrop of the West Coast in the mid-60s: a historic era of tectonic cultural, political, musical, and sexual upheaval--and the draft. Everything Larry thought he knew about life, love, and himself is challenged in the tumultuous nights where things and people are too easily found and lost.",
  "genres": [],
  "author": "Larry J. Dunlap",
  "average_rating": "4.49",
  "url": "https://www.goodreads.com/book/show/25663295-night-people"
}