{
  "title": "The Middleman",
  "description": "\"The Middleman is smart and entertaining and consistently intriguing...\" \n--Scott Turow, The New York Times Book Review\n\nOne of Entertainment Weekly's hottest summer thrillers\nWith The Middleman, the perfect thriller for our tumultuous, uneasy time, Olen Steinhauer, the New York Times bestselling author of ten novels, including The Tourist and The Cairo Affair, delivers a compelling portrait of a nation on the edge of revolution, and the deepest motives of the men and women on the opposite sides of the divide. One day in the early summer of 2017, about four hundred people disappear from their lives. They leave behind cell phones, credit cards, jobs, houses, families--everything--all on the same day. Where have they gone? Why? The only answer, for weeks, is silence. Kevin Moore is one of them. Former military, disaffected, restless, Kevin leaves behind his retail job in San Francisco, sends a good-bye text to his mother, dumps his phone and wallet into a trash can, and disappears. The movement calls itself the Massive Brigade, and they believe change isn't coming fast enough to America. But are they a protest organization, a political movement, or a terrorist group? What do they want? The FBI isn't taking any chances. Special Agent Rachel Proulx has been following the growth of left-wing political groups in the U.S. since the fall of 2016, and is very familiar with Martin Bishop, the charismatic leader of the Massive Brigade. But she needs her colleagues to take her seriously in order to find these people before they put their plan--whatever it is--into action. What Rachel uncovers will shock the entire nation, and the aftermath of her investigation will reverberate through the FBI to the highest levels of government.",
  "genres": [
    "Fiction",
    "Thriller",
    "Mystery",
    "Mystery Thriller",
    "Espionage",
    "Crime",
    "Suspense"
  ],
  "author": "Olen Steinhauer",
  "average_rating": "3.55",
  "url": "https://www.goodreads.com/book/show/25663708-the-middleman"
}