{
  "title": "Indulgence",
  "description": "“Indulgence: A million words of romance” ~ Fifteen rich, full-length novels by fifteen of today’s hottest authors in one magnificent anthology” Amity Cross, Royal Blood (Royal Blood #1)  A hitman and a woman with an explosive secret collide in this thrilling romance. Will love be enough? Or are they doomed from the start? Audrey Carlan, Angel Falling (Falling, #1)  Socialite Aspen Reynolds is saved from death by country boy, Hank Jensen, who makes it clear he wants her in his life and his bed. Cat Mason, Escaping Me (Shaft on Tour #1)  Temptations, betrayal, and lies are all mixed with booze, tattoos, sex, laughs, and love as the Shaft takes stage after stage. Making friends along the way, Daisy must stop escaping herself. She must stop hiding behind a list and come to terms with what she really wants in life. Emotions and secrets unravel all around as Daisy learns to live the rough and rowdy life of taking Shaft on tour.  Cynthia Sax, Releasing Rage  - Joan sees the darkness in Rage, the sexy cyborg she’s been assigned to maintain. He’s big, angry, violent… and exactly the warrior she needs.  Deanndra Hall My Last Dom  - A submissive who’s addicted to pain runs headlong into a Dominant determined to save her. But her ghosts could ruin their chances for happiness. Jamie Salisbury, Perpetual Love  - Albert and Anne meet on his family's ranch. Cupid's arrow does it's thing. The pair become inseparable. Anne's father meanwhile has his own agenda. JM Witt, Letting Go (Anchored Hearts #1)  - What happens when the girl who's only read about BDSM meets a flawed Dom? Will their tortured souls find love amidst pleasure and pain? Kelley Grealis, The Descendant (The Descendant Vampire Series, #1)  - Mortal death or eternal damnation? If those were your choices, which would you choose? Discover the vampire’s origin in The Descendant – A Vampire Tale of Biblical Proportions! Laura Harner, Rescued (Three's Allowed Book 2)  - With Elizabeth’s abusive ex intent on murder, Sheriff Graeme and security-mogul Michael join forces—but who will rescue them? One woman, two men, deadly serious. Liz Crowe, Man On (Black Jack Gentlemen, #1)  - All eyes are on the fledgling Black Jack Detroit soccer team in its debut season. They must make a good showing in the league and with new fans. But player drama, club dynamics, and misplaced priorities may tear it apart before it even begins. Nina Levine, Relent (Sydney Storm MC, #1)  - Will Evie relent in this second chance romance or has Kick left it too long to go after the woman who's owned his heart forever? Sandy Sullivan, Make Mine a Cowboy (Cowboy Dreamin', #1)  - She writes fantasy cowboys for a living, but she never expected to find her own on the back roads of Hill Country, Texas. Sharon Hamilton, SEAL Under Covers (Seal Brotherhood #3)  - Navy SEAL Armando Guzman is trying to help his sister clean up her life, but he is unprepared for the chemical attraction of his sister’s new best friend who he doesn't know is an undercover cop. Skye Callahan, Irrevocable (Irrevocable, #1)  - They stripped me of my life but never my will to survive. Descending into their darkness and making it my own became my only escape. Theresa Troutman, A Special Connection   - Three friends who are as close as can be, in a moment of despair, share an experience that will forever change their lives.",
  "genres": [
    "Anthologies",
    "Romance"
  ],
  "author": "Nina Levine",
  "average_rating": "4.25",
  "url": "https://www.goodreads.com/book/show/25662651-indulgence"
}