{
  "title": "Splatterpunk: An Extreme Horror Novel",
  "description": "Summary: This is book three in the A Glimpse into Hell series, and was written for the extreme gore lovers. The story is pure gore for the sake of gore. The main character, Seth Coker, and his sidekick, Barry Muller, hold nothing back as they inflict the most gruesome and sadistic acts of torture on the criminals and lowlifes of our society. This book is extremely graphic, but it’s also filled with dark humor. Splatterpunk gets straight to the gore and has very little storyline compared to the first two books in this series. It jumps from one gory scene after another without any rhyme or reason.WARNING: This book is extreme and contains filthy, grotesque and brutal torture scenes. It contains GRAPHIC CONTENT, ADULT LANGUAGE & POLITICAL INCORRECTNESS, and may be disturbing to sensitive readers. A brief comment from the author:My subject matter and humor is not for everyone, especially criminals (particularly molesters and rapists), and people that believe criminals have rights, or even people that are sensitive to extreme gore. I know this will occasionally cost me a low rating and BS review, even though I posted numerous warnings. In addition, I welcome advice from my readers. I write because of you, so I listen to criticism and praise. I’ve tried to create the best quality read possible, but unfortunately, most of us indie authors don't have the means to hire an expensive editing agency like the mainstream authors/ publishers use, and some of us rely on friends, family, fans and individuals that charge a reasonable fee. I can read a sentence ten times with a mistake, and my brain plugs in the correct word, even if it’s missing, so I’m useless as a proofreader. Even though I used editing software and numerous people have edited/ proofread it, there could be some errors remaining. If anyone wants to proofread/ edit my book(s), please email me.If you like Splatterpunk, please leave a review. The more positive reviews, the higher it is on Amazon’s search list, resulting in more people finding it. I truly appreciate the positive reviews, comments and support that I have been receiving, and that is the reason that I wrote this book, the third one in this series, and will continue writing as long as there are people that appreciate my work.If you have any questions, comments or advice, please feel free to contact me at wade.garrett.777@gmail.com.Best wishes,Wade H. Garrett",
  "genres": [
    "Horror",
    "Splatterpunk"
  ],
  "author": "Wade H. Garrett",
  "average_rating": "4.43",
  "url": "https://www.goodreads.com/book/show/25664240-splatterpunk"
}