{
  "title": "Dreamland: The True Tale of America's Opiate Epidemic",
  "description": "Winner of the NBCC Award for General NonfictionNamed on Amazon's Best Books of the Year 2015--Michael Botticelli, U.S. Drug Czar ( Politico ) Favorite Book of the Year--Angus Deaton, Nobel Prize Economics ( Bloomberg / WSJ ) Best Books of 2015--Matt Bevin, Governor of Kentucky ( WSJ ) Books of the Year--Slate.com's 10 Best Books of 2015-- Entertainment Weekly 's 10 Best Books of 2015 --Buzzfeed's 19 Best Nonfiction Books of 2015--The Daily Beast's Best Big Idea Books of 2015-- Seattle Times ' Best Books of 2015-- Boston Globe 's Best Books of 2015-- St. Louis Post-Dispatch 's Best Books of 2015-- The Guardian 's The Best Book We Read All Year--Audible's Best Books of 2015-- Texas Observer 's Five Books We Loved in 2015--Chicago Public Library's Best Nonfiction Books of 2015From a small town in Mexico to the boardrooms of Big Pharma to main streets nationwide, an explosive and shocking account of addiction in the heartland of America.In 1929, in the blue-collar city of Portsmouth, Ohio, a company built a swimming pool the size of a football field; named Dreamland, it became the vital center of the community. Now, addiction has devastated Portsmouth, as it has hundreds of small rural towns and suburbs across America--addiction like no other the country has ever faced. How that happened is the riveting story of Dreamland .With a great reporter's narrative skill and the storytelling ability of a novelist, acclaimed journalist Sam Quinones weaves together two classic tales of capitalism run amok whose unintentional collision has been catastrophic. The unfettered prescribing of pain medications during the 1990s reached its peak in Purdue Pharma's campaign to market OxyContin, its new, expensive--extremely addictive--miracle painkiller. Meanwhile, a massive influx of black tar heroin--cheap, potent, and originating from one small county on Mexico's west coast, independent of any drug cartel--assaulted small town and mid-sized cities across the country, driven by a brilliant, almost unbeatable marketing and distribution system. Together these phenomena continue to lay waste to communities from Tennessee to Oregon, Indiana to New Mexico.Introducing a memorable cast of characters--pharma pioneers, young Mexican entrepreneurs, narcotics investigators, survivors, and parents--Quinones shows how these tales fit together. Dreamland is a revelatory account of the corrosive threat facing America and its heartland.",
  "genres": [
    "Nonfiction",
    "History",
    "True Crime",
    "Politics",
    "Book Club",
    "Medicine",
    "Crime"
  ],
  "author": "Sam Quinones",
  "average_rating": "4.23",
  "url": "https://www.goodreads.com/book/show/25663571-dreamland"
}