{
  "title": "The Cinematic Legacy of Frank Sinatra",
  "description": "In a film career spanning more than five decades, Frank Sinatra proved to be a roulette wheel of constantly spinning talent, the likes of which Hollywood has rarely seen. Film history is filled with stars created by the studio system. Occasionally, however, a performer emerged who, against all preconceived odds of what a star should be or look like, knocked down the walls of convention by becoming nothing other than what they already were. Frank Sinatra was the embodiment of this fundamental truth. The legacy of his work stands apart from many of his contemporaries, who essentially based their performances on an extension of a core character type. Sinatra, however, was able to take his signature persona and translate it successfully into many film genres-first as the comedic song-and-dance man, then as the dramatic actor and romantic lead, and finally as the tough guy and action hero. Sinatra also respectfully challenged contemporary ideals of acting technique. While being humble enough to learn from his peers, he kept his acting style fresh and instinctual, and earned an Oscar at a time when many actors were either classically trained or coached in the \"Method.\"In The Cinematic Legacy of Frank Sinatra, author David Wills presents a stunning collection highlighting the work of one of Hollywood's greatest stars in roles as varied as those in the classics Anchors Aweigh, From Here to Eternity, Suddenly, Guys and Dolls, The Man With the Golden Arm, Ocean's 11, The Manchurian Candidate, Von Ryan's Express, and The Detective. Pairing more than two hundred first-generation photos with reflections on Sinatra from costars and work associates, and including contributing essays by his children Nancy Sinatra, Tina Sinatra, and Frank Sinatra, Jr., it is an unforgettable showcase of the actor's transformation from world-famous singer, to movie star, to Academy Award winner, and finally to one of the most enduring icons in cinema history.",
  "genres": [
    "Film",
    "Nonfiction",
    "Music",
    "Biography",
    "Memoir",
    "Media Tie In",
    "Literary Fiction"
  ],
  "author": "David Wills",
  "average_rating": "4.21",
  "url": "https://www.goodreads.com/book/show/25663937-the-cinematic-legacy-of-frank-sinatra"
}