{
  "title": "Every Song Ever: Twenty Ways to Listen in an Age of Musical Plenty",
  "description": "What does it mean to listen in the digital era? Today, new technologies make it possible to roam instantly and experimentally across musical languages and generations, from Detroit techno to jam bands to baroque opera―or to dive deeper into the set of tastes that we already have. Either way, we can listen to nearly anything, at any time. The possibilities in this new age of listening overturn old assumptions about what it means to properly appreciate music―to be an “educated” listener.In Every Song Ever , the veteran New York Times music critic Ben Ratliff reimagines the very idea of music appreciation for our times. As familiar subdivisions like “rock” and “jazz” matter less and less and music’s accessible past becomes longer and broader, listeners can put aside the intentions of composers and musicians and engage music afresh, on their own terms. Ratliff isolates signal musical traits―such as repetition, speed, and virtuosity―and traces them across wildly diverse recordings to reveal unexpected connections. When we listen for slowness, for instance, we may detect surprising affinities between the drone metal of Sunn O))), the mixtape manipulations of DJ Screw, Sarah Vaughan singing “Lover Man,” and the final works of Shostakovich. And if we listen for closeness, we might notice how the tight harmonies of bluegrass vocals illuminate the virtuosic synchrony of John Coltrane’s quartet. Ratliff also goes in search of “the perfect moment”; considers what it means to hear emotion by sampling the complex sadness that powers the music of Nick Drake and Slayer; and examines the meaning of certain common behaviors, such as the impulse to document and possess the entire performance history of the Grateful Dead.Encompassing the sounds of five continents and several centuries, Ratliff’s book is an artful work of criticism and a lesson in open-mindedness. It is a definitive field guide to our radically altered musical habitat.",
  "genres": [
    "Music",
    "Nonfiction",
    "Art",
    "Unfinished",
    "Cultural",
    "Criticism",
    "Essays"
  ],
  "author": "Ben Ratliff",
  "average_rating": "3.29",
  "url": "https://www.goodreads.com/book/show/25664508-every-song-ever"
}