{
  "title": "Predator's Trinity",
  "description": "Suzan has become the obsession of a vicious cult leader. Percy and Byron are jaguar shifter twins who will stop at nothing to protect her. In Suzan, they have recognized their mate, the one woman they always dreamed of sharing. But when evil visits the Ursa Fishing Lodge and Resort on Gemini Island, will their love be enough to defeat it? The passion and suspense continue in Predator’s Trinity, Book 6 of Rosanna Leo’s paranormal romance series, Gemini Island Shifters.  Librarian Suzan Marsh is an empath who has always felt assaulted by the feelings of others. She has had to distance herself from the people in her life, raising a mental barrier to ward off unwanted emotions. When wolf shifter August Crane abducts her, he breaks through the walls she constructed, forcing her to accept a frightening new truth.  Jaguar shifter twins Percy and Byron Moon are familiar with the evil ways of August Crane. Because of him, their childhood was destroyed. Because of him, their way of life at the peaceful Ursa Fishing Lodge and Resort is threatened. And they won’t rest until he is dead.  When Crane drags Suzan into his cult and decides to make her his “concubine,” Percy and Byron know they must save the human woman. Their connection to her is strong, and they cannot deny the dream they always held close. That they could share a woman and make her their mate.  But even after rescuing Suzan, none of them are free from Crane’s clutches. The wolf shifter has plans, ones that involve the demise of every shape-shifter at the Ursa Resort. Not only must Percy and Byron keep Suzan safe, they must convince her to accept them both. In order to stop Crane from hurting everyone they love, they must learn to fight together.  Content Hot, Anal Play, Anal Intercourse, Polyamory, Paranormal, Shifters, Contemporary, Fantasy, Ménage",
  "genres": [
    "Shapeshifters",
    "Paranormal Romance",
    "M F M",
    "Romance",
    "Paranormal"
  ],
  "author": "Rosanna Leo",
  "average_rating": "4.44",
  "url": "https://www.goodreads.com/book/show/25670112-predator-s-trinity"
}