{
  "title": "One of Us: The Story of a Massacre in Norway -- and Its Aftermath",
  "description": "Alternate cover edition of ISBN 9780374536091.A harrowing and thorough account of the massacre that upended Norway, and the trial that helped put the country back togetherOn July 22, 2011, Anders Behring Breivik detonated a bomb outside the Norwegian prime minister's office in central Oslo, killing eight people. He then proceeded to a youth camp on the wooded island of Utøya, where he killed sixty-nine more, most of them teenage members of the country's governing Labour Party. In One of Us, the journalist Åsne Seierstad tells the story of this terrible day and its reverberations. How did Breivik, a gifted child from an affluent neighborhood in Oslo, become Europe's most reviled terrorist? How did he accomplish an astonishing one-man murder spree? And how did a famously peaceful and prosperous country cope with the slaughter of so many of its young?As in her international bestseller The Bookseller of Kabul, Seierstad excels at the vivid portraiture of lives under stress. She delves deep into Breivik's childhood, showing how a hip-hop and graffiti aficionado became a right-wing activist, a successful entrepreneur, and then an Internet game addict and self-styled master warrior who believed he could save Europe from the threat of Islam and multiculturalism. She writes with equal intimacy about Breivik's victims, tracing their political awakenings, teenage flirtations and hopes, and ill-fated journeys to the island. By the time Seierstad reaches Utøya and relates what happened there, we know both the killer and those he will kill. In the book's final act, Seierstad describes Breivik's tumultuous public trial. As Breivik took the stand and articulated his ideas, an entire country debated whether he should be deemed insane, and asked why a devastating sequence of police errors allowed one man to do so much harm.One of Us is at once a psychological study of violent extremism, a dramatic true crime procedural, and a compassionate inquiry into how a privileged society copes with homegrown evil. Lauded in Scandinavia for its literary merit and moral poise, One of Us is the true story of one of our age's most tragic events.",
  "genres": [
    "Nonfiction",
    "True Crime",
    "History",
    "Crime",
    "Biography",
    "Politics",
    "Terrorism"
  ],
  "author": "Åsne Seierstad",
  "average_rating": "4.42",
  "url": "https://www.goodreads.com/book/show/25667456-one-of-us"
}