{
  "title": "The Ingenuity Gap: Can We Solve the Problems of the Future?",
  "description": "\"The most persuasive forecast of the 21st century I have seen.\" -- E.O. Wilson, author of Consilience: The Unity of Knowledge and twice winner of a Pulitzer prize“Human beings have been smart enough to turn nature to their ends, generate vast wealth for themselves, and double their average life span. But are they smart enough to solve the problems of the 21st century?” -- Thomas Homer-DixonCan we create ideas fast enough to solve the very problems -- environmental, social, and technological -- we’ve created? Homer-Dixon pinpoints the “ingenuity gap” as the critical problem we face today, and tackles it in a riveting, groundbreaking examination of a world that is rapidly exceeding our intellectual grasp.In The Ingenuity Gap, Thomas Homer-Dixon, \"global guru\" (the Toronto Star), \"genuine academic celebrity\" (Saturday Night) and \"one of Canada's most talked about and controversial scholars\" (Maclean's) asks: is our world becoming too complex, too fast-paced to manage? The challenges facing us -- ranging from international financial crises and global climate change to pandemics of tuberculosis and AIDS- converge, intertwine, and remain largely beyond our ken. Most of suspect the \"experts don't really know what's going on; that as a species we've released forces that are neither managed nor manageable. We are fast approaching a time when we may no longer be able to control a world that increasingly exceeds our grasp. This is \"the ingenuity gap\" -- the term coined by Thomas Homer-Dixon, political scientist and advisor to the White House -- the critical gap between our need for practical, innovative ideas to solve complex problems and our actual supply of those ideas.Through gripping narrative stories and incidents that exemplify his arguments, he takes us on a world tour that begins with a heartstopping description of the tragic crash of United Airlines Flight 232 from Denver to Chicago and includes Las Vegas in its desert, a wilderness beach in British Columbia, and his solitary search for a little girl in Patna, India. He shows how, in our complex world, while poor countries are particularly vulnerable to ingenuity gaps, our own rich countries are not immune, and we are caught dangerously between a soaring requirement for ingenuity and an increasingly uncertain supply. When the gap widens, political disintegration and violent upheaval can result, reaching into our own economies and daily lives in subtle ways. In compelling, lucid, prose, he makes real the problems we face and suggests how we might overcome them -- in our own lives, our thing, our business and our societies.",
  "genres": [
    "Science",
    "Business",
    "Nonfiction",
    "Economics",
    "Politics",
    "Technology",
    "Social Science"
  ],
  "author": "Thomas Homer-Dixon",
  "average_rating": "3.72",
  "url": "https://www.goodreads.com/book/show/1159529.The_Ingenuity_Gap"
}