{
  "title": "The Sacred Book of G",
  "description": "On Amazon, there’s a reader’s review stating: “The Sacred Book of G is a very unique and thought provoking journal into the labyrinthian mind of Autism. [...] You’re travelling with the writer in his most sacred territories.”“The Sacred Book of G” is an intimate journal of memoirs in which I got honestly and naturally naked. A private diary that was written in direct connection between my mind and the paper. Without filters. For myself. From my prison in Moscow, to my 3 days of brain death, through pagan rituals and erotic dreams, while wondering the meaning of life before death. Even though I write since I was a teenager, only now I found mental space to publish the journal I wrote through 2014 while travelling and preparing one more of my exhibitions. I needed to release some ghosts from the past. Some inner doubts. But also, I had the need to share that one’s dynamic life and thoughts can help others on their private journey in life. I’m often invited as story-teller to cultural and social events, usually to talk about my life experiences when I travel alone. From the years I spent in Himalayas to the time I spent in Africa, learning with masters and old shamans, opened and eager to learn from different thoughts and unique ways to understand the world. The Sacred Book of G is this. My random thoughts about the world. The process of exorcising myself. Getting rid of what worried me. Accepting and embracing my one flaws as much as I accept others. Exposing how I overcome them all. Being High Functioning Autistic I think in a triangle and logic way, as it makes more sense to me: it’s natural. No matter what natural is. I’m also a visual thinker. In The Sacred Book of G, I might get you confused though. My way of writing is exactly the way I think, following the same rhythm. And if you knew me, you'd know that I'm a bit surrealistic in my speech. I often wonder and get lost while talking as I often think out loud without filters. The Sacred book of G is just my bleeding brain served on a silver tray for you to enjoy. To be tasted carefully, bit by bit. With silver chopsticks, like if the plate in which my brains are would make you an experimental mad surgeon. But do it as a sacred ritual yourself. It's mind encrypted, so you might actually need to go beyond the written words. Carefully.",
  "genres": [],
  "author": "Gonzalo W  Benard",
  "average_rating": "4.50",
  "url": "https://www.goodreads.com/book/show/25665712-the-sacred-book-of-g"
}