{
  "title": "Consequence: A Memoir",
  "description": "\"A man questions everything--his faith, his morality, his country--as he recounts his experience as an interrogator in Iraq; an unprecedented memoir and \"an act of incredible bravery\" (Phil Klay)\"Remarkable... Both an agonized confession and a chilling expose of one of the darkest interludes of the War on Terror. Only this kind of courage and honesty can bring America back to the democratic values that we are so rightfully proud of.\" --Sebastian JungerConsequence is the story of Eric Fair, a kid who grew up in the shadows of crumbling Bethlehem Steel plants nurturing a strong faith and a belief that he was called to serve his country. It is a story of a man who chases his own demons from Egypt, where he served as an Army translator, to a detention center in Iraq, to seminary at Princeton, and eventually, to a heart transplant ward at the University of Pennsylvania.In 2004, after several months as an interrogator with a private contractor in Iraq, Eric Fair's nightmares take new forms: first, there had been the shrinking dreams; now the liquid dreams begin. By the time he leaves Iraq after that first deployment (he will return), Fair will have participated in or witnessed a variety of aggressive interrogation techniques including sleep deprivation, stress positions, diet manipulation, exposure, and isolation. Years later, his health and marriage crumbling, haunted by the role he played in what we now know as \"enhanced interrogation,\" it is Fair's desire to speak out that becomes a key to his survival. Spare and haunting, Eric Fair's memoir is both a brave, unrelenting confession and a book that questions the very depths of who he, and we as a country, have become.",
  "genres": [
    "Memoir",
    "Nonfiction",
    "War",
    "History",
    "Politics",
    "Biography Memoir",
    "Biography"
  ],
  "author": "Eric Fair",
  "average_rating": "3.83",
  "url": "https://www.goodreads.com/book/show/25666070-consequence"
}