{
  "title": "Dad, You Were Right: Reflections From a Stubborn Son",
  "description": "“Dad, You Were Right: Reflections from a Stubborn Son” is the account of the emotional journey of the author’s own life. Written by Chris Schatz, “Dad You Were Right” is a collection of memories shared between a father and a son. In this book, Chris recollects some of the most defining moments and events of his life, with his father serving as his greatest inspiration. After battling some of life’s most difficult challenges, the author realized what got him through it all - his late father’s teachings. He couldn’t have become the man he is today if it wasn’t for his father. Throughout this book, Chris pays tribute to the man who means the world to him, inspiring readers in the process! Summary of the Book: Most of us go through life seeking life’s purpose and looking for answers in the wrong places. Chris believes that often the greatest teachers in our lives are those who love and care for us the most, such as a parent. In his case, it was his father, Dean Schatz, a common man with admirable qualities that made him stand out. He recounts specific events and moments with his father and lessons learned from them. While he learned some of these lessons “the hard way”, he realized others through self-reflections that occurred after he lost his father to brain cancer at the age of 54. Chris Schatz pours out some his most personal stories in “Dad, You Were Right”. The stories and the experiences presented in the book are relate-able in more ways than one. Many of us have felt lost and questioned our direction at some point or another. We’ve all made mistakes and tried to learn from them. It’s always reassuring to take advice from someone who has been through similar ordeals. Their lessons can often help us find the way. That is exactly what this book does through its beautiful writing and powerful narrative. Order your copy today!",
  "genres": [
    "Biography"
  ],
  "author": "Chris Schatz",
  "average_rating": "4.09",
  "url": "https://www.goodreads.com/book/show/25674856-dad-you-were-right"
}