{
  "title": "War and Peace",
  "description": "War and Peace, by Leo Tolstoy, is part of the Barnes & Noble Classics series, which offers quality editions at affordable prices to the student and the general reader, including new scholarship, thoughtful design, and pages of carefully crafted extras. Here are some of the remarkable features of Barnes & Noble Classics:All editions are beautifully designed and are printed to superior specifications; some include illustrations of historical interest. Barnes & Noble Classics pulls together a constellation of influences—biographical, historical, and literary—to enrich each reader's understanding of these enduring works. The most famous—and perhaps greatest—novel of all time, Tolstoy’s War and Peace tells the story of five families struggling for survival during Napoleon’s invasion of Russia. Among its many unforgettable characters is Prince Andrey Bolkonsky, a proud, dashing man who, despising the artifice of high society, joins the army to achieve glory.  Badly wounded at Austerlitz, he begins to discover the emptiness of everything to which he has devoted himself.  His death scene is considered one of the greatest passages in Russian literature. The novel's other hero, the bumbling Pierre Bezukhov, tries to find meaning in life through a series of philosophical systems that promise to resolve all questions. He at last discovers the Tolstoyan truth that wisdom is to be found not in systems but in the ordinary processes of daily life, especially in his marriage to the novel's most memorable heroine, Natasha. Both an intimate study of individual passions and an epic history of Russia and its people, War and Peace is nothing more or less than a complete portrait of human existence. Joseph Frank is Professor Emeritus of Comparative Literature at Princeton University and Professor Emeritus of Comparative Literature and Slavic Languages and Literature at Stanford University. He is the author of a five-volume study of Dostoevsky’s life and work.",
  "genres": [
    "Classics",
    "Fiction",
    "Historical Fiction",
    "Russia",
    "Russian Literature",
    "Literature",
    "War"
  ],
  "author": "Leo Tolstoy",
  "average_rating": "4.16",
  "url": "https://www.goodreads.com/book/show/256732.War_and_Peace"
}