{
  "title": "Alexander Hamilton: The Formative Years",
  "description": "Even though Alexander Hamilton was among the most important Founding Fathers, less is known about his early life than that of any other major Founder. Relatively few records have been found regarding Hamilton’s birth, childhood, and origins in the West Indies. Alexander Hamilton “rarely . . . dwelt upon his personal history” and never recorded his life’s story. Most of Hamilton’s correspondence prior to 1777 was lost during the American Revolution. This has resulted in many gaps in Alexander Hamilton’s biography, which has given rise to much conjecture regarding the details of his life. Relying on new research and extensive analysis of the existing literature, Michael E. Newton presents a more comprehensive and accurate account of Alexander Hamilton’s formative years. Despite being orphaned as a young boy and having his birth be “the subject of the most humiliating criticism,” Alexander Hamilton used his intelligence, determination, and charisma to overcome his questionable origins and desperate situation. As a mere child, Hamilton went to work for a West Indian mercantile company. Within a few short years, Hamilton was managing the firm’s St. Croix operations. Gaining the attention of the island’s leading men, Hamilton was sent to mainland North America for an education, where he immediately fell in with the country’s leading patriots. After using his pen to defend the civil liberties of the Americans against British infringements, Hamilton took up arms in the defense of those rights. Earning distinction in the campaign of 1776–77 at the head of an artillery company, Hamilton attracted the attention of General George Washington, who made him his aide-de-camp. Alexander Hamilton was soon writing some of Washington’s most important correspondence, advising the commander-in-chief on crucial military and political matters, carrying out urgent missions, conferring with French allies, negotiating with the British, and helping Washington manage his spy network. As Washington later attested, Hamilton had become his “principal and most confidential aid.” After serving the commander-in-chief for four years, Hamilton was given a field command and led the assault on Redoubt Ten at Yorktown, the critical engagement in the decisive battle of the War for Independence. By the age of just twenty-five, Alexander Hamilton had proven himself to be one of the most intelligent, brave, hard-working, and patriotic Americans. 'Alexander Hamilton: The Formative Years' tells the dramatic story of how this poor immigrant emerged from obscurity and transformed himself into the most remarkable Founding Father. In riveting detail, Michael E. Newton delivers a fresh and fascinating account of Alexander Hamilton’s origins, youth, and indispensable services during the American Revolution.",
  "genres": [
    "History",
    "Nonfiction",
    "American Revolution",
    "Biography Memoir",
    "American Revolutionary War",
    "American",
    "Biography"
  ],
  "author": "Michael E. Newton",
  "average_rating": "4.43",
  "url": "https://www.goodreads.com/book/show/25673449-alexander-hamilton"
}