{
  "title": "Mentor Me: GA=T+E-A Formula to Fulﬁll Your Greatest Achievement",
  "description": "Selected Reference Photo Quotations Art and Digital Graphic Design Created Based Upon this Groundbreaking Practical Self-Help, Mentoring, Coaching, Personal Success, Business Guide\n Quotations and Photo Quotations from Mentor Me: GA=T+E—A Formula to Fulﬁll Your Greatest Achievement have been posted around the world. Now they are available as reference quotations, art and graphic design in this ebook.  Quotes from Ken Poirot have appeared in Quote, Graphic Arts, Graphic Design, and Photo Quotation form all over the world, in countries such as The Netherlands, The UK, and all over the internet!  Many have found these quotations and photo quotations motivational, inspirational, and a few are just plain \"smile\" moments from \"Mentor Me\" by Ken Poirot which add humor as they are quite humorous in nature.  \nSee What People All Over the World Are Talking About!\n Mentor Me: GA=T+E—A Formula to Fulﬁll Your Greatest Achievement by Ken Poirot is A Fun and Simple Self-Help, Mentoring, Coaching, Personal Success, Business Book!  It has been called \"One of the Best Motivational Self-Help Books and Ebooks\" by many who have read it!  Readers have found motivation, inspiration, improved happiness and self-esteem, from many of these motivational, inspirational, and even humorous quotes, photo quotation graphic design and graphic arts elements.   \nSee Some of the Selected Mentor Me Reference Photo Quotations that have been Posted and Quoted Around the World in Art and Graphic Design!\n See why the author is recently quoted as saying the following about Mentor Me: “On a whole other level it is the crossroads and convergence of where science, metaphysics, religion, and utopian society intersect.”  Ken Poirot is a ﬁnancial professional with over eighteen years' experience as both a successful ﬁnancial advisor and sales manager. As the senior vice president and sales manager for Frost Investment Services, the brokerage department of Frost Bank (NYSE:CFR), he led his department to four consecutive years of double-digit revenue growth, increasing revenue by over 83 percent while substantially increasing the proﬁ t margin. During these same four years, the ﬁnancial advisors he coached increased their individual production from an average of less than $25,000 in revenue per month to over $41,000. Additionally, he has consistently increased sales by double digits as a regional manager at various other ﬁrms, including Guaranty Bank and JPMorgan Chase.  He is a coach, mentor, consultant, scientist, author, and public speaker, currently residing in the Houston suburb of Richmond, Texas.  His quotes have appeared all over the world in quotation, graphic arts, and graphic design form providing motivation, inspiration, increased success, happiness, even humor to many!  His quotes have made him a much sought after public speaker, coach, and mentor..",
  "genres": [
    "Self Help",
    "Business",
    "Nonfiction",
    "Finance",
    "Money",
    "Personal Development"
  ],
  "author": "Ken Poirot",
  "average_rating": "4.11",
  "url": "https://www.goodreads.com/book/show/25677246-mentor-me"
}