{
  "title": "The Snake Charmer: A Life and Death in Pursuit of Knowledge",
  "description": "Although it was still too dark to see well, Joe absentmindedly thrust his right hand into the sack to extract the specimen and have a look. Immediately, he winced with pain and yanked out his hand. A tiny black-and-white banded snake, less than ten inches long, was dangling limply from his middle finger, its fangs still sunk into his flesh.In the fall of 2001, deep in the jungle of Burma, a team of scientists is searching for rare snakes. They are led by Dr. Joe Slowinski, at forty already one of the most brilliant biologists of our time. It is the most ambitious scientific expedition ever mounted into this remote region, venturing into the foothills of the Himalayas. The bold undertaking is brought to a dramatic halt by the bite of the many-banded krait, the deadliest serpent in Asia. In the moment he pulled his hand from the specimen bag and saw the krait, Joe knew that his life was in grave and imminent peril. Thus began one of the most remarkable wilderness rescue attempts of modern times, as Joe's teammates kept him alive for thirty hours by mouth-to-mouth respiration, waiting for a rescue that never came.A daredevil obsessed with venomous snakes since his youth, Slowinski was a modern-day adventurer who rose quickly to the top of his field, discovering many previously unidentified snake species in his brief yet exhilarating career. The Snake Charmer is at once brilliant biography and exotic travel literature, blended with an accessible introduction to the bizarre, fascinating-and sometimes controversial-world of snake science. The narrative transports the reader into primeval wilderness, from the Everglades to Peru to Burma, in search of rattlesnakes and boa constrictors, kraits and cobras.Joe Slowinski's career was fast and exciting, his tragic final expedition a pulse-pounding struggle between man and nature. In The Snake Charmer , renowned journalist and author Jamie James captures the life and death of this charismatic, endlessly fascinating man. Exhaustively researched in interviews with Slowinski's colleagues and family, and the author's own trek into the wilds of Burma, this is narrative nonfiction in the tradition of Into the Wild and The Perfect Storm.",
  "genres": [
    "Science",
    "Nonfiction",
    "Animals",
    "Biography",
    "Nature",
    "Adventure",
    "Travel"
  ],
  "author": "Jamie James",
  "average_rating": "3.97",
  "url": "https://www.goodreads.com/book/show/2567158-the-snake-charmer"
}