{
  "title": "Delicious Foods",
  "description": "NOTABLE BOOK OF THE YEAR: New York Times, Washington PostA BEST BOOK OF THE YEAR: NPR, Kirkus, BuzzFeed, National PostTOP 10 BOOKS OF THE YEAR: Publishers WeeklyTOP 15 BOOKS OF THE YEAR: BookPageHeld captive by her employers--and by her own demons--on a mysterious farm, a widow struggles to reunite with her young son in this uniquely American story of freedom, perseverance, and survival.Darlene, once an exemplary wife and a loving mother to her young son, Eddie, finds herself devastated by the unforeseen death of her husband. Unable to cope with her grief, she turns to drugs, and quickly forms an addiction. One day she disappears without a trace.Unbeknownst to eleven-year-old Eddie, now left behind in a panic-stricken search for her, Darlene has been lured away with false promises of a good job and a rosy life. A shady company named Delicious Foods shuttles her to a remote farm, where she is held captive, performing hard labor in the fields to pay off the supposed debt for her food, lodging, and the constant stream of drugs the farm provides to her and the other unfortunates imprisoned there.In Delicious Foods, James Hannaham tells the gripping story of three unforgettable characters: a mother, her son, and the drug that threatens to destroy them. Through Darlene's haunted struggle to reunite with Eddie, through the efforts of both to triumph over those who would enslave them, and through the irreverent and mischievous voice of the drug that narrates Darlene's travails, Hannaham's daring and shape-shifting prose infuses this harrowing experience with grace and humor.The desperate circumstances that test the unshakeable bond between this mother and son unfold into myth, and Hannaham's treatment of their ordeal spills over with compassion. Along the way we experience a tale at once contemporary and historical that wrestles with timeless questions of love and freedom, forgiveness and redemption, tenacity and the will to survive.",
  "genres": [
    "Fiction",
    "Contemporary",
    "Literary Fiction",
    "Book Club",
    "Audiobook",
    "Race",
    "African American"
  ],
  "author": "James Hannaham",
  "average_rating": "3.81",
  "url": "https://www.goodreads.com/book/show/25677540-delicious-foods"
}