{
  "title": "Secret Windows: Essays and Fiction on the Craft of Writing",
  "description": "One day, while in his laundry room, Stephen King squeezed behind his dryer, looked out of a window, and realized that he was seeing a garden that he'd never noticed before. This is what great writers do, he thought. They look out of an almost forgotten window at an angle that renders the common extraordinary.Secret Windows: Essays and Fiction on the Craft of Writing is an exclusive Book-of-the-Month Club anthology of hard-to-find non-fiction pieces, little-known interviews, short stories, and articles about writing for those looking for direction on how to find their own \"windows\" - or for anyone wishing to be touched by Stephen King's humor and wisdom.Included in this collection are unpublished early fiction (very early; King was twelve when he wrote \"Jumper\" and \"Rush Call\"); a pre-Carrie article with tips for selling stories to men's magazines (\"The Horror Writer and the Ten Bears: A True Story\"); advice to his son on writing (with the look-twice title \"Great Hookers I Have Known\"); recommendations to teen readers in a Seventeen article (\"What Stephen King Does for Love\"); a long chapter from his wonderful treatise on the horror genre (\"Horror Fiction\" from Danse Macabre); and even a first-time-in-print short story, \"In the Deathroom\" (just for fun).Intended as a companion to Stephen King's 2000 book On Writing, Secret Windows: Essays and Fiction on the Craft of Writing captures the author's mind in action-spontaneous, subversive, quirky, yet morally and ethically serious. Together, they comprise virtually the sum of the thoughts on writing of the dominant force in American fiction for the past three decades.-CONTENTS-• Introduction by Peter Straub• Dave's Rag: Jumper, Rush Call• The Horror Market Writer and the Ten Bears: A True Story• Foreword to Night Shift• On Becoming a Brand Name• \"Horror Fiction\" from Danse Macabre• An Evening at the Billerica Library• The Ballad of the Flexible Bullet• How It Happened• Banned Books and Other Concerns• Turning the Thumbscrews on the Reader• \"Ever Et Raw Meat?\" and Other Weird Questions• A New Introduction to John Fowles's The Collector• What Stephen King Does for Love• Two Past Midnight: A Note on \"Secret Window, Secret Garden\"• Introduction to Jack Ketchum's The Girl Next Door• Great Hookers I Have Known• A Night at the Royal Festival Hall: An Interview by Muriel Gray• An Evening with Stephen King: March 30, 1999• In the Deathroom",
  "genres": [
    "Nonfiction",
    "Writing",
    "Horror",
    "Essays",
    "Short Stories",
    "Biography",
    "Anthologies"
  ],
  "author": "Stephen        King",
  "average_rating": "4.07",
  "url": "https://www.goodreads.com/book/show/11596.Secret_Windows"
}