{
  "title": "Firefight",
  "description": "Boone RichardsOur town is burning and people are dying, one fire at a time. My get even scheme has gone to hell, and I’ve fallen for the woman I hated. Can things get any worse? I shouldn’t have asked.Time alone with Olympia, at an isolated cabin, has sealed my fate. Despite the warnings, I can’t keep my hands or my mouth off her luscious body. Seeing her tied up and at my mercy is worth every negative consequence.Her ability to play the perfect submissive whore while maintaining an illusion of innocence is my undoing. I’m hooked. And like any junkie, I won’t be denied my fix. If she remembers her past, our unusual relationship will go up in flames, and I’ll be cleaning up the ashes. When she remembers how I lied to her and leaves the club’s protection, the mysterious arsonist will finish the job he started. Olympia Olsen will burn. I’m going to find him before he lights that match. Then I am going to kill him.No matter what happens, I can count on one thing…my soul getting scorched. Olympia OlsenMy body keeps betraying me. The more I fight the attraction, the less I am able to resist. I don’t want to need him, but I can’t imagine not feeling his touch. He’s under my skin and in my heart, despite my efforts to resist.I can’t remember my life before he rescued me from an arsonist’s rampage, but I’m starting to see flashes. I’m positive Boone is lying. He’s not who he says he is. He is not my husband. Why would he take me? More importantly, why does he fight to keep me?It’s time to turn the tables. If he can’t provide proof of our relationship, I’m leaving this MC and Boone Richards behind, once and for all. I won’t look back. Seriously, who am I trying to fool?I’m hooked. The way he commands my body is something I can’t live without…won’t live without. The way he has found a way into my heart is something I can’t figure out. But one thing is certain; Boone Richards owns me, heart and soul. If I stay, he’ll burn me. If I leave, I’ll face the arsonist’s fire. Either way, my soul will end up scorched. Firefight is book two in a four-part serial-series to be followed by Firestorm and Fireworks. You will want to read Firetrap first. This series is not suitable for readers under 18 due to sexual content, language, violence, and other dark themes. It is a biker romance. If you like your heroes damaged and dark, with particular sexual interests, read on. It does end in a cliffhanger, but I promise a HEA by book four. You've been warned.",
  "genres": [
    "BDSM"
  ],
  "author": "C.L. Riley",
  "average_rating": "3.95",
  "url": "https://www.goodreads.com/book/show/25675073-firefight"
}