{
  "title": "Dark Menace MC - Stone",
  "description": "Rachel offers herself to Stone, the president of an outlaw motorcycle club, as collateral for her family's debt, and becomes the target of a rival club. Wildman, president of the Red Devils, wants her, but so does Stone--and he’ll do whatever it takes to protect her from the evil bastard who calls himself her step-father.  Excerpt - Other than a dozen or so motorcycles backed up at the front of the bar, all seemed quiet for an early Friday afternoon. Stone pulled in at an angle, backing into a spot close to the entrance. He cut the engine and held his hand back, to help me off, I assumed. Once I was standing I reached up to undo my helmet. He dismounted and swung my way, watching me. I tried not to let his silent scrutiny bother me, but that was hard to do when I was pretty sure that what I saw in his dark eyes was arousal. I finally got the strap undone and offered him the helmet, staring right back at him while ignoring the slow heat that was crawling up my neck and spreading to cheeks.  He took the helmet, set it on his seat, and then opened the saddle bag for my bag. As he did this the three men who’d been traveling with us walked up. I wasn’t afraid to meet their eyes, dealt with assholes like them every day, and I wasn’t about to let them intimidate me. They simply smirked at me, and one of them reached for the door.  “Pit Bull.” Mutt or Jeff, I couldn’t tell which, halted and turned back to us. Stone held my bag out to him. “Put this in my room.”  Pit Bull’s smirk turned into a full-fledged grin, and he winked at me, taking the bag from Stone. The bastard! I knew what he was thinking. I waited until he’d disappeared inside before returning my gaze to Stone. Like Pit Bull’s, I knew that the sexy smile on his face was at my expense. He knew what was going through my mind, and I could tell that he was waiting for me to react.  I slammed my hands on my hips. “Your room? And just where will you be sleeping?” I wanted to make it clear from the start that it wouldn’t be with me.  He leaned against his bike and crossed his arms. “I barely have enough rooms for my men, so we’ll be sharing, sweetheart.”  “Like hell we will! I’ll sleep on a couch somewhere.” There was no way that I was sharing a bed with him. Something told me that if I did, we wouldn’t be getting much sleep. I wasn’t stupid. When he’d kissed me back at Maddie’s it may have started in anger, but it had ended in full-blown passion, and there’d been no denying that he’d had a serious hard-on.  I could tell that Stone didn’t like me arguing with him. Well, that was just too damned bad! He could lean against his big-ass Harley with his bulging arms crossed over his massive chest and that smoldering look in his eyes till it snowed. I may want him, because he was hot as hell, but he didn’t have to know that. I wasn’t here to provide that kind of service.  Eyes the color of black coffee took a slow ride over my body, and I got the impression that Stone was sizing me up—not for a fight, but for something entirely different. It was sexual. I kept my hands on my hips in a silent challenge, even as my nipples peaked beneath his hard look. The traitors were actually tingling, and that sharp feeling of need zeroed right down to my sex, which was still buzzing from the bike ride there.  Holy shit, I should have never glanced down at the front of his pants, because now I was on fire. “No way are we sharing a bed,” I repeated, in a tone that was clearly a little weaker than before.",
  "genres": [
    "Romance"
  ],
  "author": "Tory Richards",
  "average_rating": "4.14",
  "url": "https://www.goodreads.com/book/show/25674866-dark-menace-mc---stone"
}