{
  "title": "In The End",
  "description": "In the End is a book that came about because a remarkable person who I cared a lot about died. He wasn't old or in any way ready to die, and his death was tragic, but in the end, it was inevitable, because he had a heart rhythm disorder called Brugada Syndrome which went undiagnosed until just before he died. How he died was very sad, but it was not the defining thing about him, or about why I wrote the book.The reason he mattered, and the reason his story matters, is because even though bad things happened to him, he never lost his goodness. He could have given up many times, but he didn't. Maybe he should've. I, personally, wouldn't have blamed him.His name was Zachary Lee, but everyone who cared about him called him Zee. He was a child prostitute. Although I changed quite a few details in the book, and hopefully never got too graphic, the real person was born to a couple who realized that they could use him for their own gains, and use him they did. when he was ten, he was rescued, and eventually put in foster care until he was adopted at twelve. Most people would have been broken by a childhood and upbringing like that, but Zee was braver and stronger than he knew. After he was adopted, he lived as good a life as he deserved, with a set of parents who loved him and gave him every kindness they could offer. This included a cat named Jellybean, who was Zee's constant companion. He often said that she was better than most humans, because she didn't judge him the way most people did when they heard about his past.I suppose that you can't talk about Zee without mentioning Alex. Alex was his best friend, and the two of them were, at first glance, totally opposite. Alex is taller, for one thing, (close to 6', compared to Zee's 5'4), and exudes an air of confidence that attracts people to him in a way that Zee could only envy. But Alex is something of a contradiction. He came from a broken home and a very unstable mother in particular, and he had to sort of fend for himself a lot when he was younger. In fact, it was Zee and his parents that offered Alex stability. So, as unlikely as it might have seemed at the time, the two of them were very close friends, and still would be if Zee were still here. Alex is in the military, although I confess I'm not sure which branch. He and I have sort of lost touch. He was tickled pink that I wrote him as a main character in the book, and he was a source of a lot of the details I wasn't sure about. He did ask me to change his name in the book, though, for his own privacy.When Zee died, he was nineteen. At the time, it seemed sudden, and it was definitely unexpected, but looking back, there were signs and symptoms, but nothing big enough to make anyone consider that he might die.After he died, it was a very emotional time for everyone who knew him. I still wonder if he knew what a lasting impact he had on those of us left behind. That thought, and a song by Black Veil Brides called In the End, was what pushed me to write the book. The song has a line in it that goes: \"In the end, as you fade into the night, who will tell the story of your life?\" I remember hearing that song and getting this light bulb moment. There was also the famous quote by Banksy, “I mean, they say you die twice. One time when you stop breathing and a second time, a bit later on, when somebody says your name for the last time.” I realized that with words, I had the power to keep his memory alive. So that's what I did. And in the process, I found something I truly love to do, which is to write.",
  "genres": [],
  "author": "L.M.  Davis",
  "average_rating": "4.80",
  "url": "https://www.goodreads.com/book/show/25677975-in-the-end"
}