{
  "title": "The Fifth Sorceress",
  "description": "Not since Terry Goodkind unsheathed the Sword of Truth has there been such an epic tale of heroism and magic that so captures the imagination as this monumental new work by a master storyteller. In The Fifth Sorceress , Robert Newcomb conjures a time and place wrought with exquisite detail, characters vividly drawn and deeply felt, and a history rich in glory and horror, splendor and secrets. . . .“We gave them a chance once, long ago. . . . We offered to share power equally, and in peace. But they refused and chose war. With them it was all or nothing. Wizard against Sorceress. Male against female. Light against dark.”It is more than three centuries since the ravages of a devastating war nearly tore apart the kingdom of Eutracia. In its wake, those who masterminded the bloodshed—a quartet of powerful, conquest-hungry Sorceresses—were sentenced to exile, with return all but impossible and death all but inevitable. Now a land of peace and plenty, protected and guided by a council of immortal wizards, Eutracia is about to crown a new king. And as the coronation approaches, the spirit of celebration fills every heart. Except one.Prince Tristan is a reluctant monarch-to-be. Though born with the “endowed” blood that will give him the power to master magic, and destined by tradition to succeed his father as ruler, he is a rebel soul. And when he discovers the ancient, hidden caves where strange red waters flow—possessed of their own mysterious magic—it only makes him yearn all the more to escape his future of duty . . . and succumb to the stirrings of enchantment within him.But more than tradition compels Tristan to ascend the throne. The very existence of Eutracia depends upon it. For after these long centuries of peace, dreadful omens have begun to appear, heralding something too unspeakable to ponder. And if indeed the old evil has returned, hungry to wreak vengeance, Tristan’s role in an ages-old prophecy must be fulfilled—or the cost to his kingdom and his people will be beyond imagination.It will be a battle like none ever known, against an enemy whose thirst for blood and domination is depthless and unyielding. And for Tristan, it will be the ultimate facing an adversary whose greatest weapon is the person he loves most—transformed into the instrument of his annihilation . . . and the catalyst that will doom Eutracia forever to darkness.",
  "genres": [
    "Fantasy",
    "Fiction",
    "Science Fiction Fantasy",
    "High Fantasy",
    "Adult",
    "Epic Fantasy",
    "Unfinished"
  ],
  "author": "Robert Newcomb",
  "average_rating": "3.19",
  "url": "https://www.goodreads.com/book/show/2568497-the-fifth-sorceress"
}