{
  "title": "Real Life Superman: the Training Guide to Become Faster, Stronger and More Jacked than 99% of the Population: Volume 01: Strength & Conditioning",
  "description": "What If You Knew a Sure-Fire Way to Build the Ultimate Body and Become a Real Life Superman?You’ve always dreamt of developing the physique of a superhero – ripped & muscular, powerful & explosive – but nothing you ever tried gave you the expected results? You’re slowly starting to lose hope. “When will my time come? When will I finally get a body I can be proud of?” What if that dream was only 100 days from becoming a reality?You need to read this book if you want to learn the easiest, most effective way not only to get more jacked than everyone else around you but to gain such strength and athleticism that – to other people – it will seem like you did GROW SUPERPOWERS!No matter your background or where you are in life today, this book will help you reach your goals of greatness. If any of the following applies to your situation, this program was made for don’t have much time to devote to training;You don’t have much cash and can’t afford a gym membership;You have a hectic schedule and can’t train at fixed hours;You don’t want to starve yourself to death to lean down;You’re looking to build muscle but don’t want to sacrifice speed or agility in the process;Your health is important to you and you wish to improve it;You want to realize your full potential and reach for the stars;…This program is unlike any other in that it acknowledges the fact that most guys can’t make everything revolve around forging their physique. They can’t go around their day eating, sleeping and training for a superior body. They have duties to attend to, friends, family and activities which require their attention.In short, they can’t follow the crazy schemes suggested by all fitness “gurus.”What they need is a proven method that can bring results without needing to sacrifice their entire life for it!Stop Wasting Your Time - Learn How to REALLY Eat and Train to Turn Into a Lean & Mean Machine!“Real Life Superman” will teach you the secrets to developing a dynamic, powerful, agile and beach worthy body in less than 100 days. Guaranteed! It will reveal a step-by-step plan where each step builds upon the previous one so as to leave NO STONES UNTURNED. While it’s nice to grow big muscles, to reach your full potential you will need to cover all bases. That’s what this program will teach you, by showing to eat for performance and ultimate well-being;The most effective exercises for building insane amounts of strength and muscle with nothing but your own body weight;How to become a true cardio beast with a few simple drills.Just imagine how your life will change once you get that superior body. A body that not only feels great but performs even better! How people will look at you differently, with awe and admiration.",
  "genres": [],
  "author": "Markus A. Kassel",
  "average_rating": "3.50",
  "url": "https://www.goodreads.com/book/show/25688122-real-life-superman"
}