{
  "title": "The Alpha and His Ace",
  "description": "Dear Author,I am an Alpha werewolf who has been looking for his mate. Until I find him (yes, I am gay, my pack is pretty much open to sexuality), I am allowed to have fun with other guys. I’m known as a player but that’s okay because once I find my mate, my wolf and I will be truly monogamous.Then I find him. My mate (You can decide how we meet— make it meet-cute type). But then my mate says that he is an asexual. What the hell? What does he mean, asexual? Does he mean that I cannot have sex with him ever? That he will never enjoy sex with me? How can I make him fall in love with me then?But my wolf and I are determined to romance my mate; even if I have to join AVEN forum (which I thought at first as forum for AVIAN shifters) and talk around to couples with asexual lovers for tips. Because I will have my HEA with him, right, dear author?Photo Description: A young man and a wolf appear close together. The young man is dark-haired the wolf has pure white fur and amber eyes. The young man is holding the wolf close to himself in an almost possessive manner. They seem like they belong together.This story was written as a part of the M/M Romance Group's \"Love is an Open Road\" event. Group members were asked to write a story prompt inspired by a photo of their choice. Authors of the group selected a photo and prompt that spoke to them and wrote a short story. This story may contain sexually explicit content and is intended for adult readers. It may contain content that is disagreeable or distressing to some readers. The M/M Romance Group strongly recommends that each reader review the General Information section before each story for story tags as well as for content warnings.",
  "genres": [
    "M M Romance",
    "Romance",
    "Paranormal",
    "Shapeshifters",
    "Asexual",
    "Fantasy",
    "LGBT"
  ],
  "author": "Ana J. Phoenix",
  "average_rating": "3.41",
  "url": "https://www.goodreads.com/book/show/25686361-the-alpha-and-his-ace"
}