{
  "title": "A Gallant Gamble",
  "description": "She had been creating havoc since the moment he had first set eyes on her, but avoiding the outrageous yet beautiful Lady Charlotte, had become almost impossible. With her delightful innocence and her exquisite looks, she had entangled herself firmly in his heart.  If only Geoffrey could act upon the riotous emotions that tormented him through day and night, but even as she stood half-naked in front of him, he knew that it was impossible for a stable hand to marry a Lady. Though he had saved her guardians life, the new Lord Caithwell would have him flogged if he knew the thoughts that tortured Geoffrey’s every waking moment.  Now, what with the Duke of Ormond ordering him to accompany Lady Charlotte on her first season in London, Geoffrey’s equilibrium is about to be shattered. Protecting the vivacious woman from the felons who would attempt to steal her fabled Caithwell diamond will be difficult enough, but the thought of any other man even so much as dancing with her was enough to bring Geoffrey out in a cold sweat.  He didn’t think his heart could take it. He needed a distraction from the impossibility of having her for himself. Perhaps riding in Lord Davenport’s annual steeplechase would be a fitting diversion from the delights of the woman he could never win.  Perhaps he would triumph and take the thousand guinea prize. Or maybe he would lose not only the woman he loves, but also his life as rivals for her hand and her priceless heirloom, gamble on the outcome.  A Gallant Gamble is a 16+ (sensual, sexual content) stand-alone read in the Unrivalled Regency series, however, the books are best read in order to fully appreciate all the characters and situations.  Book 1: Silence of Scandal – Death and debt stalk his every waking moment, but will the new Duke of Ormond discover love and happiness on his way to recovering the family jewels.  Book 2: A Murderous Masquerade – A missing Lord, a fabulous jewel and a hangman’s noose are all that prevent Giles Denvers from marrying the love of his life. That’s if he is allowed to have a life after being accused of a murder at Ormond.",
  "genres": [
    "Historical Romance",
    "Romance",
    "Regency"
  ],
  "author": "Jackie Williams",
  "average_rating": "4.11",
  "url": "https://www.goodreads.com/book/show/25687850-a-gallant-gamble"
}