{
  "title": "Imagine Self-Love: A Journal",
  "description": "Our relationship with ourselves is, without a doubt, the most important relationship in our lives. How we treat ourselves 'sets the dial' for our relationships with everything else in our lives:  * How much wealth do we allow into our life? * How much love is the 'right amount'? * How much success do we permit ourselves? * What level of vitality is 'good enough'? * How much happiness can we imagine for ourselves?  The Imagine Self-Love journal is designed to strengthen the core concepts that make all our other dreams possible: self-trust, self-knowledge, self-acceptance and self-love.  Using inspiring quotes, journal prompts, and action exercises, this journal will help you establish self-love as the most important habit in your life.  Here's what others are saying about Imagine Self-Love:  \"Commit to the work in this journal and you're committing to going full-steam ahead on the powerful train to self-compassion. Deep and meaningful changes ahead!\" Keyra Conlinn, author.  \"Imagine Self-Love Journal allowed me to reconnect with myself and my strengths. Reba's gentle encouragement helped me see that I am my own boss and creator of my own life. If you are looking for a journal to help you make your own self-care and self-love a priority I would highly recommend it. Make yourself a priority today.\" Tanya Levy, MSW, RSW, CCC  \"I feel so grateful that this journal came across my desk. Wow!!! As I read through the pages, I feel as if this is a wake up call for us to look honestly at our lives and the roles we have chosen to play. There is much soul searching and contemplation, and acknowledging all the good, as well as the challenges that have crossed our path....I know that I have had to read, then stop, and then revisit the pages. It makes me want to be honest with myself and move beyond self criticism, self judgment and self denial. I highly recommend that everyone go through the journal at least once. To find ourselves and see our lives with more clarity and focus about where we are headed. And change our course, if we must. Bravo, Reba!!!\" Rani Totman, Designer & President, St. Pucchi  Imagine Self-Love was inspired by the journey author Linker traveled while writing her earlier book, Follow the Yarn. As life lessons grew to outpace the knitting tips, Linker underwent a parallel transition from dance studio owner, to life coach and author.  Writing helped Linker accept her self more fully, and discover her true purpose: to share her story and her wisdom, and to tell whoever needs to hear: you are infinitely precious, valuable, and deserving, and you can experience the greatest happiness today.  In Follow the Yarn, Linker shared her story of discovering self-love. In Imagine Self-Love she shares her experience. She offers her readers the same gifts that she received, to support the reader on his or her own journey to self-love.  Live your best life NOW. Happiness is not 'over there,' at the completion of some goal, happiness is here, now. Connect with happiness on every page of this journal, in every moment of every day. Happiness is available all the time, no matter what is happening in your life, and no matter what happened in the past.  Choose happiness! Go through this journal and open the door to greater happiness and satisfaction, every moment of every day.",
  "genres": [
    "Self Help"
  ],
  "author": "Reba Linker",
  "average_rating": "3.75",
  "url": "https://www.goodreads.com/book/show/25682463-imagine-self-love"
}