{
  "title": "Raising Ryland: Our Story of Parenting a Transgender Child with No Strings Attached",
  "description": "This powerful, moving story—which has already touched more than seven million through a viral video created by the Whittington family—is a mother’s first-hand account of her emotional choice to embrace her transgender child.When Hillary and Jeff Whittington posted a YouTube video chronicling their five-year-old son Ryland’s transition from girl to boy, they didn’t expect it to be greeted with such fervor. Beautiful and moving, the video documenting Hillary’s and Jeff’s love for their child instantly went viral and has been seen by more than seven million viewers since its posting in May 2014.Now for the first time, they tell their story in full, offering an emotional and moving account of their journey alongside their exceptional child. After they discovered their daughter Ryland was deaf at age one and needed cochlear implants, the Whittingtons spent nearly four years successfully teaching Ryland to speak. But once Ryland gained the power of speech, it was time for them to listen as Ryland insisted, “I am a boy!” And listen they did. After learning that forty-one percent of people who identify as transgender attempt to take their own lives, Hillary and her husband Jeff made it their mission to support their child—no matter what.From the earliest stages of deciphering Ryland through clothing choices to examining the difficult conversations that have marked every stage of Ryland’s transition, Hillary Whittington shares her experiences as a mother through it all, demonstrating both the resistance and support that their family has encountered as they try to erase the stigma surrounding the word “transgender.” In telling her family’s story, she hopes she can assist the world in accepting that even children as young as five, can have profound and impactful things to say and share. What emerges is a powerful story of unconditional love, accepting others for who they are, and doing what’s right, regardless of whether those around you understand it.",
  "genres": [
    "Nonfiction",
    "LGBT",
    "Memoir",
    "Parenting",
    "Biography",
    "Adult",
    "Transgender"
  ],
  "author": "Hillary Whittington",
  "average_rating": "4.20",
  "url": "https://www.goodreads.com/book/show/25685586-raising-ryland"
}