{
  "title": "Otis",
  "description": "Stand-alone. No cheating, no sex outside the relationship, no love triangles, and no club whores, HEA, no cliffhanger. SAMANTHA (SAM)The only man I've ever loved stepped aside and let me go 15 years ago because I wanted to start a family. After moving as far away from him as possible, I now must return home for my mother's funeral. The problem with going home is I'm single and I'm still deeply in love with Otis. Seeing him and not acting on my feelings would be impossible, so my plan is to slip into town, take care of my deceased mother's affairs, and slip out unnoticed. One drink should settle my nerves...OTISI'm the 6'-5\" tattooed bad-ass that protects my 32 brothers in the Selected Sinners MC. An undercover ATF agent has infiltrated our MC and threatens the security of our club. Determining which of my brothers is the snitch and undoubtedly destined for his grave is my only focus. My only current love is the MC - I let the only woman I've ever loved other than my mother slip away when I was 21 because I young and selfish. I'm 36 now, single, and plan on staying that way. Not finding the snitch is driving me insane, I need a drink...One unscheduled moment between Otis and Sam could prove disastrous. Or, it could rekindle a flame that has always been flickering - a second chance at a first love... \"Being inseparable doesn't define true love. Being separated and having nothing change between you, however, does.\"AUTHORS NOTE: OTIS is a stand-alone MC Erotic Romance with no cheating, no sharing partners, and a HEA. Be forewarned, the main characters in this book are both agoraphiliacs. They enjoy sex in public places, especially if they think someone's watching. OTIS is Book III in a series of true stand-alone MC Romance novels. No other book is required to enjoy this tale. The two previous books in the series may be read as stand-alones or together to fully understand the complexity of the ancillary characters.",
  "genres": [
    "Romance",
    "Contemporary",
    "Erotica",
    "Audiobook",
    "Second Chance",
    "Contemporary Romance",
    "Erotic Romance"
  ],
  "author": "Scott Hildreth",
  "average_rating": "4.10",
  "url": "https://www.goodreads.com/book/show/25694201-otis"
}