{
  "title": "Big Happiness: The Life and Death of a Modern Hawaiian Warrior",
  "description": "\"Big Happiness is extremely important to our community. Mark Panek’s biography of Percy Kipapa speaks to the consequences of the destruction of Hawai‘i’s rural neighborhoods, unchecked development, the ice epidemic, the failures of government, sumo, intricate family and neighbor relationships, and more. What is most impressive is Panek’s ability to weave all of these complex topics together in a seamless narrative that connects all the dots. Part mystery, part investigative journalism, part poignant Island portrait, this work contains an emotional element that binds the reader to the subjects in a dignified yet touching way, showing compassion and even affection for people while revealing their flaws and shortcomings. This book will resonate with an Island audience and with anyone interested in Hawai‘i.\" —Victoria Kneubuhl, Hawai‘i writer and playwright\"This book tells of personal triumphs and failures, and also the triumphs and failures of families, communities, organizations, agencies, governments, and churches dealing with the multiple consequences of ‘progress’ in contemporary Hawai‘i. There have been heroes and villains at all levels—frequently, the same individuals and agencies are both at the same time. The story of Percy Kipapa is especially poignant because professional sumo gave him a unique opportunity to transcend Hawai‘i’s culture of colonialism, racism, poverty, and drug addiction, which in the end all brought him down anyway. Mark Panek has done a masterful job of weaving these strands together.\"—Reverend Bob Nakata, former Hawai‘i state senator\"Spanning the history of Waikane and the brutality of Japan’s national sport, Big Happiness is a remarkably ambitious piece that links one man’s murder to the ice epidemic, land development, and political corruption in Hawai‘i. Mark Panek’s meticulously researched, skillfully written, heartbreaking story, filled with voices that ring true, is an indictment of an entire system that crushed a gentle giant. While other Hawai‘i writers dwell in ‘take me back to da kine’ nostalgia, Panek tells it like it really is.\" —Chris McKinney, author of The Tattoo and Mililani Mauka.",
  "genres": [
    "History",
    "Nonfiction"
  ],
  "author": "Mark Panek",
  "average_rating": "4.42",
  "url": "https://www.goodreads.com/book/show/11598641-big-happiness"
}