{
  "title": "Damn Right!: Behind the Scenes with Berkshire Hathaway Billionaire Charlie Munger",
  "description": "Praise for Damn Right! From the author of the bestselling WARREN BUFFETT SPEAKS. . . \"Charlie Munger, whose reputation is deep and wide, based on an extraordinary record of brilliantly successful business strategies, sees things that others don't. There is a method to his mastery and, through this book, we get a chance to learn about this rare individual.\" -MICHAEL EISNER, Chairman and CEO, The Walt Disney Company \"Janet Lowe uncovers the iconoclastic genius and subtle charm behind Charlie Munger's curmudgeonly facade in this richly woven portrait of our era's heir to Ben Franklin. With a biographer's detachment, an historian's thoroughness, and a financial writer's common sense, Lowe produces a riveting account of the family, personal, and business life of the idiosyncratically complex and endlessly fascinating figure.\" -LAWRENCE CUNNINGHAM, Cardozo Law School, Author of The Essays of Warren Buffett: Lessons for Corporate America \"For years, Berkshire Hathaway shareholders and investors worldwide (me included) have struggled to learn more about Warren Buffett's cerebral sidekick. Now we can rest and enjoy reading Janet Lowe's book about this rare intellectual jewel called Charlie Munger.\" -ROBERT G. HAGSTROM, Author of The Warren Buffett Way \"Charlie has lived by the creed that one should live a life that doesn't need explaining. But his life should be explained. In a city where heroism is too often confused with celebrity, Charlie is a true hero and mentor. He lives the life lessons that he has studiously extracted from other true heroes and mentors, from Ben Franklin to Ben Graham. This book illuminates those life lessons.\" -RONALD L. OLSON, Munger, Tolles & Olson llp \"Janet Lowe's unprecedented access to Charlie Munger and Warren Buffett has resulted in a first-class book that investors, academics, and CEOs will find entertaining and highly useful.\"-TIMOTHY P. VICK, Money Manager and Author of How to Pick Stocks Like Warren Buffett",
  "genres": [
    "Business",
    "Biography",
    "Finance",
    "Nonfiction",
    "Economics",
    "Audiobook",
    "Leadership"
  ],
  "author": "Janet Lowe",
  "average_rating": "4.16",
  "url": "https://www.goodreads.com/book/show/1160.Damn_Right_"
}