{
  "title": "Wormhole Moon: An Alien Civilization’s Alliance With Earth",
  "description": "“Worm Hole Moon” is a story about two Earth, Space Command astronauts that crash land on a seemingly insignificant moon in a sector of space light years away from Earth. Little do they know, the moon secretly conceals a black hole that is a portal to an alien civilization.“Wormhole Moon” contains many characters that are interesting and engaging. The locations in the book consist of space, various countries on Earth, to include alien planets. The villains in this book consist of not only one alien race but two!Twists and turns abound as John Williams skillfully weaves the stories and locations in and around each other in “Wormhole Moon.” You will not find fluff or word fillers in this book. The plots and story line are credible, well researched and easily understood. The reader will not struggle with the technology or procedural syntax. In fact, the book may even educate the reader on some things they did now about space, military tactics and space travel.Wormhole Moon contains a lot of space technology to include new types of weapons and war tactics in the book. In fact, there are weapons in the book that have yet to be seen in film or television as of the writing of this description. Some of the main characters are of course the two Astronauts, The Chief of Security for the alien planet, Special Operations operators, various commanders and decision makers of all kinds.The book is definitely not all about the business of galactic war. It is laced with plenty of humor and interactions between human and new alien races. The challenges and realities of adding a new species to our planet can be seen throughout various story lines in “Wormhole Moon.”Author John Williams has a very descriptive writing style and he creates word pictures and visual portraits for his readers so they may truly have a reading experience.Although “Worm Hole Moon,” is a Sci-fi novel, it is designed to appeal to those who do not usually read Science fiction. This work is over one hundred thousand words long and will delightfully entertain and engage from the novice Sci-fi reader to even the most persnickety, sci-fi reading veteran for hours.",
  "genres": [
    "Science Fiction",
    "Space"
  ],
  "author": "John        Williams",
  "average_rating": "3.70",
  "url": "https://www.goodreads.com/book/show/25699777-wormhole-moon"
}