{
  "title": "Barefoot with a Bad Boy",
  "description": "A man who trusts no one is forced to believe the unbelievable... For years, former spy Gabriel Rossi has been secretly searching for CIA linguist Isadora Winter, a woman he loved and lost long ago. But recently, he learned of her untimely death in an accident...and death of her son named Gabe. Angry, hurt, and uncertain of his next move, Gabe is stunned when a woman he's never met approaches him on the beach and claims to be Isadora. She doesn't look, act, or talk like his beloved Isa, but she knows things about their past that only a lover could know, and she assures him that his son is alive as well. As much as he wants to believe her and knows that in the spy world, anything is possible, doubts and distrust plague him. Still, he sees glimmers of the woman he once knew shine through and she begins to melt his hardened heart. A woman who is tortured by emotions must endure the pain of love... Lila Wickham has been working deep undercover for so long that sometimes she's forgotten who she really is. Now that her assignment is over and the surgeries she endured left her utterly changed, she is determined to fix the broken life she left behind and assure that her little boy is safe. With lingering threats from an unknown source and blinding headaches that torment her whenever she feels deep emotion, she seeks Gabe Rossi for help and protection. But instead of setting her up with a new undercover identity, he insists on luring her nemesis to Barefoot Bay so he can end the threat to Lila and her son once and for all. Can they survive the worst betrayal of all? Even if they succeed in drawing out the killer who has Lila in his sights, a much more serious threat hovers over them...a treacherous, deadly truth that could not only destroy their love but end their lives as well.",
  "genres": [
    "Romantic Suspense",
    "Romance",
    "Contemporary",
    "Suspense",
    "Contemporary Romance",
    "Mystery"
  ],
  "author": "Roxanne St. Claire",
  "average_rating": "4.37",
  "url": "https://www.goodreads.com/book/show/25698237-barefoot-with-a-bad-boy"
}