{
  "title": "Walking Back to Georgia",
  "description": "I died. I fu*&ing died, and when I woke up in a Los Angeles hospital my best friend walked away from me. It wasn’t quite the welcoming back to the world of the living I thought I’d receive, and it rattled me.After an overdose, Henley Hendrix retreats to Georgia to chase sobriety and get her life together. To do that, she’s got to keep her distance from Jagger and company. But when an old friend pops back into her life, a private moment is leaked to the world, and someone she never thought would walk away from her does exactly that. She’s got to deal with rejection, a stalker, her return to the rock world for a promotional tour, jungle peepers, a riot of fans, a 1% motorcycle club, a one-eyed teddy bear, and two men fighting over her.Just when she’s figured out how to finally be the best version of “Henley” she can be and how to stay healthy, her world is turned upside down again when her eyes are opened to something she never expected.This book is not a stand-alone novel. Books 1 and 2 in the Guitar Face Series should be read first. If you are looking for a story of redemption with comic relief and a heavy sexual tone, you've found it. If you are offended by hot, tattooed rock stars, who are vulgar then this is not the book for you. Please be warned, this book is not for anyone below the age of 18. The book has sex, death, violence, and harsh language.About the Award-winning author Sasha Marshall, a concert photographer, toured with legendary bands such as The Allman Brothers Band. A self-proclaimed free spirit, she’s most often found outdoors, or painting a canvas, capturing a photograph, people watching, reading a book, or writing a new book. Sasha makes her home in the beautiful state of Georgia and loves to hear from readers. Visit her website to connect.",
  "genres": [
    "Romance",
    "Music",
    "Humor"
  ],
  "author": "Sasha Marshall",
  "average_rating": "4.62",
  "url": "https://www.goodreads.com/book/show/25700061-walking-back-to-georgia"
}