{
  "title": "The 3 Mistakes of My Life / One Night At The Call Center / Five Point Someone",
  "description": "This are the three best books of Chetan Bhagat combined into one easy to read book: The 3 Mistakes of My Life - In late-2000, a young boy in Ahmedabad called Govind dreamt of having a business. To accomodate his friends Ish and Omi's passion, they open a cricket shop. Govind's wants to make money and thinks big. Ish is all about nurturing Ali, the batsman with a rare gift. Omi knows his limited capabiltiies and just wants to be with his friends. However, nothing comes easy in a turbulent city. To realize their goals, they will have to face it all - religious politics, earthquakes, riots, unacceptable love and above all, their own mistakes. One Night At The Call Center - The novel revolves around a group of six call center employees working in Connexions call center in the Delhi suburb of Gurgaon in Haryana. It is filled with a lot of drama with unpleasant things happening to all of the leading characters. The story takes a dramatic and decisive turn when they get a phone call from God. The novel has also been adapted into a movie. Five Point Someone - Five Point Someone is a story about three friends in IIT who are unable to cope. The book starts with a disclaimer, 'This is not a book to teach you how to get into IIT or even how to live in college. In fact, it describes how screwed up things can get if you don't think straight.'Three hostelmates - Alok, Hari and Ryan get off to a bad start in IIT - they screw up the first class quiz. And while they try to make amends, things only get worse. It takes them a while to realize- If you try and screw with the IIT system, it comes back to double screw you. Before they know it, they are at the lowest echelons of IIT society. They have a five-point-something GPA out of ten, ranking near the end of their class. This GPA is a tattoo that will remain with them, and come in the way of anything else that matters - their friendship, their future, their love life.",
  "genres": [
    "Fiction",
    "Romance",
    "India"
  ],
  "author": "Chetan Bhagat",
  "average_rating": "3.48",
  "url": "https://www.goodreads.com/book/show/11600688-the-3-mistakes-of-my-life-one-night-at-the-call-center-five-point-so"
}