{
  "title": "Balaam Gimble's Gumption",
  "description": "In the character Balaam Gimble, Mike Nichols has created a knight-errant of contemporary rural a Joe Don Quixote. Granted, Balaam's trusty steed may be only a rusty Frankenford-a twenty-three-year-old Ford pickup, reanimated time and again by the transplantation of parts from pickup cadavers, but the giants that Balaam tilts against are real enough to him-a ruthless businessman, a masseur-turned-dirty trickster, a money-mad hometown, and, most of all, plain old change. For months the mayor and city council of the small town of Willoughby have been seeking a way to revitalize their town, to return it to the oil-and-cotton prosperity that it had enjoyed during the 1920s. They need an angle, something to put Willoughby on the map. When Balaam discovers a spring of health-giving mineral water on his two hundred acres of \"woods and weeds,\" the town leaders suddenly see their angle. As Willoughby's merchants begin selling Mason jars of Balaam's wonder water, the town's economic future looks much Howard J. Liggett, the millionaire developer of a chain of upscale mineral spring resorts, offers to buy Balaam's land at many times its market value and build a resort on it, bringing even more people and prosperity to Willoughby. Residents soon forget how much they had cherished the \"in our own sweet time\" pace of their languishing little town. Only Balaam sees that the town is beginning to change for the worse and is determined to save Willoughby from itself. Balaam is adamant-he won't sell the land that has been in his family five generations. But Liggett is just as adamant-he will acquire Balaam's land by hook or crook. That crook is Ernie Ruiz, a young masseur with a criminal record. Liggett dispatches Ruiz to Willoughby to \"persuade\" Balaam to sell. Balaam remains serenely nonviolent in the face of Ruiz's campaign of terror. When Ruiz cannot coerce Balaam to sell, Liggett stoops even He resorts to perfectly legal means, informing Balaam that he has bought the mineral rights. Now the people of Willoughby know that even fool-headed Balaam, bless his heart, can't keep Willoughby off the map. Desperate, Balaam the knight-errant saddles up his Frankenford to make one final head-down, neck-bowed, full-gallop, Lone Star-spangled tilt at the windmills that threaten his hometown.",
  "genres": [],
  "author": "Mike  Nichols",
  "average_rating": "4.67",
  "url": "https://www.goodreads.com/book/show/2569990-balaam-gimble-s-gumption"
}