{
  "title": "The Undead: Book One, Overview",
  "description": "“It changed our relationship with death. People don’t get to be lain to rest now. They have to be put down like animals first. Every death now results in violence, and that fundamentally changed the way that we die, the way that we deal with death, and the nature of grief itself.”What might life be like in a world beset by billions of human zombies?The Undead: Book One, Overview is an introduction to a nightmarish world in which the last few million humans are living in the shadow of a terrible and incurable virus that is drowning the species under a wave of billions of zombies. Book one focuses on how a British government would react to the crisis of suddenly finding that more than 58 million of its people had become highly infectious zombies and that the survivors are all infected with an incurable condition that will turn them into zombies upon death. The worldwide Infection Event occurred in 2020 and the dwindling human race has been struggling to survive in a poisoned world ever since.The Undead series is a five part documentary produced by the British Broadcasting Service that was shown across British cinemas in 2051. The story is told in interview format, with veteran broadcaster Clive Dowd interviewing a wide range of experts from the fields of medical science, the military, history and the government. Areas of discussion in book one include the military situation, policing, agriculture, infrastructure, education and manufacturing, as well as sex, maternity, the Arts and bereavement. No aspect of human life remains untouched by the virus and by extension, the cold grasping hand of the zombies out there on the other side of the Clean Zone Wall. The book also examines the way in which the virus works in the human body, how it spreads, and how the organism is affecting the eco system of the world, from its creation in a vaccine factory to its being embedded in virtually every omnivorous mammal group on land.Prepare yourself to experience a world in which even death is a luxury and life will never be the same as it was before.The Undead: Book One, Overview is an adult book and is not suitable for children.Brief background: My zombie series is really about three things. Firstly, it’s about the entertainment that we derive from death, and it examines that quirk that we all have in us, somewhere. The second thing that the zombie series is about, is our reaction to calamity as a species – not calamity like World War One, something that will strain us but not wipe out the species, but rather something that threatens our very existence on this Earth. I’m not sure that we’d all run around in circles screaming and fanning ourselves with our hands, and I know that we wouldn’t just devolve into a mass of raping, killing machines that wanted to wipe each other out for a moment’s more satisfaction or comfort before the end. We’d have those people, but the most of us would be something else again. The third thing that my zombie series tries to do is to present a zombie narrative that could actually happen, to present a zombie apocalypse in as complete and realistic a way as possible. I have been a zombie fan ever since I saw my first zombie movie and so my series, The Undead books one to five are my attempt to do the zombie story justice.",
  "genres": [
    "Zombies",
    "Horror",
    "Science Fiction",
    "Fiction"
  ],
  "author": "Michael Pugh",
  "average_rating": "3.79",
  "url": "https://www.goodreads.com/book/show/25711357-the-undead"
}