{
  "title": "Bones on Ice",
  "description": "Featuring a preview of the highly anticipated new thriller Speaking in Bones, this eBook original novella showcases #1 New York Times bestselling author Kathy Reichs at the peak of her powers. In Bones on Ice, forensic anthropologist Temperance Brennan gets wrapped up in the ultimate cold a death on Mount Everest.  It is called the “death zone”: the point on Everest, nearly five miles high, above which a climber cannot be rescued. More than 250 souls have lost their lives there. Most of the bodies remain, abandoned, frozen in place. When an earthquake leads to a miraculous recovery, Dr. Temperance Brennan is hired to identify the frozen mummified human corpse. The victim is the daughter of a wealthy Charlotte couple who never got the chance to say goodbye. But far from offering solace and closure, Tempe’s findings only provoke more questions. What happened on Mount Everest? Was the young woman’s death an accident? Why aren’t the other climbers talking? And how far will those hiding the truth go to make sure the past stays buried? Praise for Kathy Reichs and the Temperance Brennan series   “A genius at building suspense.”—New York Daily News   “Kathy Reichs writes smart—no, make that brilliant—mysteries that are as realistic as nonfiction and as fast-paced as the best thrillers about Jack Reacher, or Alex Cross.”—James Patterson   “Reichs, a forensic anthropologist, makes her crime novels intriguingly realistic.”—Entertainment Weekly   “One of the most distinctive and talented writers in the genre.”—Sandra Brown   “Every minute in the morgue with Tempe is golden.”—The New York Times Book Review   “Each book in Kathy Reichs’s fantastic Temperance Brennan series is better than the last.”—Lisa Scottoline   “Reichs always delivers a pulse-pounding story.”—Publishers Weekly  “I love Kathy Reichs‎—always scary, always suspenseful, and I always learn something.”—Lee Child",
  "genres": [
    "Mystery",
    "Fiction",
    "Crime",
    "Audiobook",
    "Mystery Thriller",
    "Short Stories",
    "Thriller"
  ],
  "author": "Kathy Reichs",
  "average_rating": "4.05",
  "url": "https://www.goodreads.com/book/show/25708561-bones-on-ice"
}