{
  "title": "The Liverpool Vampire",
  "description": "\"The grip that men held on their lives amused Dafydd as he feasted on victim after victim. They were so quick to anger and so ready to go to war over issues that really didn’t matter in the scheme of things. Yet when they were running for their lives, they seemed at once to understand that life was precious and that it was worth saving.\"The Liverpool Vampire is an examination of a type of magical serial killer, the vampire, able to act with impunity, and the impact that such a person would have on their victims.The story is told in two parts, describing the life and times of a very old vampire, and the murder investigation into the death of a young woman found in Liverpool city centre on a cold March night in 1965. The vampire's story, beginning in 1295, is one of the fledgling serial killer learning his trade, operating under the radar, giving licence to his plans and passions down the centuries and developing a new, vampires view of mankind. The 1965 murder investigation takes place in a few short weeks and shows the impact that a vampire has on the society that it feeds on.The follow up to this book is now available and is called Judgement Of The Vampire.The Liverpool Vampire is an adult book and is not suitable for children.Brief background: My vampire series is an examination of an awful kind of person – the sort of person who, in real life, really wouldn’t have any problems being a serial killer. In a sense, vampire stories are serial killer stories, but they’re not like any of the serial killers that you could Google or name off the top of your head; these are the sort of killers that many serial killers see themselves as – magical, able to act with impunity; special. If we can look at the vampire and, after seeing him in the worst possible light, still sympathise with him and still root for him on some level, what does that say about us as people? “Humanity needs its vampires.”",
  "genres": [],
  "author": "Michael Pugh",
  "average_rating": "3.71",
  "url": "https://www.goodreads.com/book/show/25711286-the-liverpool-vampire"
}