{
  "title": "Bound To Me",
  "description": "Ambition knows no bounds for renowned sex therapist, Doctor Addison Tyler. Her career is on the fast track with book deals, TV appearances, and clientele comprised of New York City’s naughtiest socialites. Always cool and controlled, Addison is confident she’s got a skintight grip on the reigns of her life… until she comes face-to-face with the one client whose mischievous words, bed-tossed hair, and fiendish impulses prove far too difficult to resist. One false step, slide of the hand, or slip of the tongue could bring her carefully constructed world crashing down.For venture capitalist Decland Wallace, “It’s not you, it’s me” has never been more accurate. With every new business endeavor, he soars to the top of the corporate ladder, but with every failed romance, his belief in “the one” falters. That is, until he discovers a mysterious femme fatale in a club where pleasure-induced deeds transpire in dark corners. The game is on as a single night with the siren in the lace mask ignites a yearning for something more. Just when he thinks he’s met his match, she’s hell bent on walking away, leaving him struggling to hold on to their passion. He’ll use every dirty trick in the book to keep her… even if it costs them everything.As two dominant personalities collide, only one will come out on top. In a tango of wits, lips and limbs, only love will survive the inferno they feel while together… and the anguish of being apart. Sacrifices will be made as they make the decision to come together or let it all fall apart.“‘Bound To Me’ is the first book in the Leather Series by author Megan Elizabeth. What a killer start to the series! ‘Bound To Me’ is filled with steamy sex, sexy characters and great interplay that really makes it a worthwhile read. I would say this will please a lot of the fans who have been turned off by the extreme erotica currently on the market. It will also please those who wish for a hint of danger in their relationship but without warped consequences. This is a must-read for the summer in my opinion, and it won’t let you down.”“Like a rampant rabbit, ‘Bound To Me’ takes the reader on an emotional criss-cross that will have them reaching for the next page and not wanting to give up their book at night. The job? Forget it. The kids? Send them to daycare. ‘Bound To Me’ is the hottest book to come from Megan Elizabeth, and one of the hottest books I’ve read this year. Worth every damn cent the journey costs.”“I think Megan Elizabeth must have a wild sex life. This book is absolutely the kind of book that will turn you off a boring sex life and onto an exciting adventure with the man you love. Put the book down only to move into a liason with the Decland in your life.”“Move over E.L. James… Megan Elizabeth has written a book that makes you look like a rank amateur when it comes to turning readers on.”“Sex, romance, sex, romance, sex, romance… Megan Elizabeth has it all in her new book ‘Bound To Me.’ If you are married then you are in for a very busy time. If you are single… Keep looking and reel a guy in because you’re going to need it.”Sinners Craving",
  "genres": [],
  "author": "Megan   Elizabeth",
  "average_rating": "4.10",
  "url": "https://www.goodreads.com/book/show/25712604-bound-to-me"
}