{
  "title": "Forty Rooms",
  "description": "The internationally acclaimed author of The Dream Life of Sukhanov now returns to gift us with Forty Rooms, which outshines even that prizewinning novel.Totally original in conception and magnificently executed, Forty Rooms is mysterious, withholding, and ultimately emotionally devastating. Olga Grushin is dealing with issues of women’s identity, of women’s choices, that no modern novel has explored so deeply. “Forty rooms” is a conceit: it proposes that a modern woman will inhabit forty rooms in her lifetime. They form her biography, from childhood to death. For our protagonist, the much-loved child of a late marriage, the first rooms she is aware of as she nears the age of five are those that make up her family’s Moscow apartment. We follow this child as she reaches adolescence, leaves home to study in America, and slowly discovers sexual happiness and love. But her hunger for adventure and her longing to be a great poet conspire to kill the affair. She seems to have made her choice. But one day she runs into a college classmate. He is sure of his path through life, and he is protective of her. (He is also a great cook.) They drift into an affair and marriage. What follows are the decades of births and deaths, the celebrations, material accumulations, and home comforts—until one day, her children grown and gone, her husband absent, she finds herself alone except for the ghosts of her youth, who have come back to haunt and even taunt her. Compelling and complex, Forty Rooms is also profoundly affecting, its ending shattering but true. We know that Mrs. Caldwell (for that is the only name by which we know her) has died. Was it a life well lived? Quite likely. Was it a life complete? Does such a life ever really exist? Life is, after all, full of trade-offs and choices. Who is to say her path was not well taken? It is this ambiguity that is at the heart of this provocative novel.",
  "genres": [
    "Fiction",
    "Short Stories",
    "Russia",
    "Literary Fiction",
    "Book Club",
    "Contemporary",
    "Womens"
  ],
  "author": "Olga Grushin",
  "average_rating": "3.87",
  "url": "https://www.goodreads.com/book/show/25716695-forty-rooms"
}