{
  "title": "International Bankster$",
  "description": "Want to know who is covertly manipulating the financial markets behind the scenes? Then follow the money! INTERNATIONAL BANKSTER$: The Global Banking Elite Exposed and the Case for Restructuring Capitalism, by novelists, filmmakers and independent researchers James Morcan & Lance Morcan, identifies who is responsible for the gigantic financial gulf that separates the top 1% of the population from the common people, or the 99%. The financial overlords illuminated in this book include the powerbrokers at Wall Street banks, European central banks, the US Federal Reserve and the Vatican Bank, as well as elite banking dynasties such as the Rothschild and Rockefeller families.INTERNATIONAL BANKSTER$ discloses the real reasons for the series of recent financial crises. These reasons include: the secret world of “black money” and Old World money where most assets and income remain undeclared; the central banking system and the true nature of the Federal Reserve; the less-than-holy financial activities of the Vatican; the IMF and World Bank’s sometimes less-than-charitable dealings with the Third World; the austerity measures currently being inflicted on vulnerable nations like Greece; as well as the theory that the world’s money supply is essentially being created out of thin air. Beyond identifying the problems and exposing corruption, INTERNATIONAL BANKSTER$ proposes ideas for creating a fairer economic system. These ideas include: publicly owned banks; utilizing certain aspects of Islamic banking which may be compatible with Western banking systems; exploring whether capitalism and socialism can actually work in tandem; arguing the case to maintain but restructure capitalism; considering the merits of a universal income; and predicting how cybermoney, or cryptocurrencies, will influence the world economy in the coming years.Though the subjects covered may be monetary issues, that’s on the surface only. In reality, they are humanitarian issues. As the authors state in the book’s opening pages, “Starving the masses of financial opportunities, sinking them in debt and cheating them out of various services their taxes should pay for, are among the greatest sins those in power can commit.”As governments around the world continue to bail out privately-owned banking institutions ahead of rescuing the millions of citizens facing bankruptcy and eviction from their homes, INTERNATIONAL BANKSTER$ is a timely read.",
  "genres": [
    "Nonfiction",
    "Economics",
    "Conspiracy Theories",
    "Finance",
    "Business",
    "Politics",
    "Banking"
  ],
  "author": "James Morcan",
  "average_rating": "3.78",
  "url": "https://www.goodreads.com/book/show/25712675-international-bankster"
}