{
  "title": "Alex's Surprise",
  "description": "This book is now unpublished and included in Saving Alex!!!!!Alex wanted a night of hot passion with Gerome, but he gets more than he ever bargained for. His life will be changed forever in a world where he’ll be thrown in jail— or worse— for being pregnant.Alex’s best friend, Sam, has been acting strange ever since he met Alex’s one-night stand, but now Alex needs help in order to hide, and Sam is his only hope.First book in the Unexpected series.This story was written as a part of the M/M Romance Group's \"Love is an Open Road\" event. Group members were asked to write a story prompt inspired by a photo of their choice. Authors of the group selected a photo and prompt that spoke to them and wrote a short story. Dear Author,When I got pregnant unexpectedly and my partner-in-babymaking up and ran off, I figured I’d be alone forever. It was a rough time and if not for best friend I don’t know how long it would have taken to drag myself out of it. I never thought I’d find myself in this position with him. He has been so supportive through the pregnancy and all these feelings I’d never noticed before started blossoming. This is our first time together and I never thought sex could be this amazing— tender and smoking hot all at the same time. I think it helps that he spent so much time wooing me and we were able to fully switch from “friend” mindset to “romance” mindset before we just jumped into bed.Photo Description: A blond-haired man making love to a visibly pregnant man. From the expression on the blond’s face and the kiss he presses on the black-haired man’s shoulder, it’s clear these two are a couple who are deeply in love. They are somewhere hidden, maybe a basement, since there are stairs visible in the background. It makes me wonder, is the pregnancy forbidden? Are they hiding because of that?This story may contain sexually explicit content and is intended for adult readers. It may contain content that is disagreeable or distressing to some readers. The M/M Romance Group strongly recommends that each reader review the General Information section before each story for story tags as well as for content warnings.",
  "genres": [
    "M M Romance",
    "Paranormal",
    "Vampires",
    "Romance",
    "Friends To Lovers",
    "Fantasy",
    "Gay"
  ],
  "author": "Chris McHart",
  "average_rating": "3.40",
  "url": "https://www.goodreads.com/book/show/25719242-alex-s-surprise"
}