{
  "title": "Mermen (Bonus Pack)",
  "description": "From New York Times Bestseller, Mimi Jean Pamfiloff... **MERMEN BONUS PACK** Get Mimi Jean's NEW RELEASE, MERMEN, plus a taste of two other Mimi Jean series!  Bonus Pack: - MERMEN, Book #1, the Mermen Trilogy (NEW RELEASE!) - KING'S, Book #1, the King Trilogy (USA TODAY BESTSELLER) - FATE BOOK, Book #1, the Fate Book Series (New Adult, Suspense) ************** MERMEN (Book #1, The Mermen Trilogy) These Mermen Don't Have Tails, They're Deadly as Hell, and They've Got Something He Wants...  INFAMOUS BACHELOR and SELF-MADE BILLIONAIRE ROEN DORAN IS A BASTARD. Yes, he knows it. And no, he doesn't care. He's got money and power, and he depends on no one. But when his estranged father dies, willing him a secret island, Roen will come face to face with an even bigger secret: its occupants. And these savage, sea-obsessed warriors are quick to make their position clear: Leave now or die.  There's only one problem. Nobody tells Roen what to do. Ever. Oh, and one other thing. He's just met the island's other new \"guest\" and something about her brings out his possessive side.  SOLE SHIPWRECK SURVIVOR LIV STRATTON had been adrift at sea for ten grueling days when salvation miraculously appeared: an uncharted island. Only, the deceivingly beautiful men who live there aren't interested in saving her. No, not at all. Because they somehow believe she is their property, a gift from the ocean to do with as they please. This is not good.  Her only hope? Billionaire Roen Doran, of all people. A man who's said to care for nothing and no one. But if he's so heartless, then why is he about to risk everything to help her?  ~ ~ ~ KING’S (Book #1 of the USA TODAY BESTSELLING KING TRILOGY): “I am the man who can find anything or anyone. For a price. And my price is you.”  When Mia Turner’s brother goes missing in Mexico, while on an archaeological dig, she believes that life couldn’t get much worse. But when she’s blocked at every turn from finding answers, by both local and U.S. authorities, she must turn to a man she swears is the devil.  Others might be fooled by his private jet, fine tailored suits, and disarming smile, but Mia knows something dark, sinister, and unnatural lurks behind those penetrating, pale-gray eyes. And the more she learns, the more she realizes she may never be free again.  ~~~~ FATE BOOK (Book #1, The Fate Book Series) Dakota Dane is about to tell a lie she’ll wish she hadn’t. Because her lie is dangerous, sexy, and just showed up on campus, angry as hell and looking for her...  Ugly duckling Dakota Dane has a new boyfriend. He’s male-model gorgeous, built to perfection, wealthy, and smart. He is also a lie. As in, 100% fabricated. Does it matter that Dakota has a perfectly good reason for making him up? Not really. Not when Dakota’s made-up boyfriend shows up in the flesh.  So is she crazy? All signs point to maybe. But the walking, talking enigma with the deadly vibe isn’t about to give her any answers or let her out of his sight. And with college just around the corner, Dakota fears her dreams of a bright future have just collided with a dark rabbit hole…",
  "genres": [],
  "author": "Mimi Jean Pamfiloff",
  "average_rating": "4.13",
  "url": "https://www.goodreads.com/book/show/25717454-mermen-bonus-pack"
}