{
  "title": "My Five Sisters: A Psychological Thriller Based on a True Story of Multiple Personalities",
  "description": "My Five Sisters A Psychological Thriller Based on a True Story of Multiple PersonalitiesTold through the eyes of a young child…My Five Sisters is a psychological thriller written by a sibling who was tortured mentally and physically from the age of six until she was thirteen by her older sister who had five distinct personalities.How long can a child be tortured mentally and physically by a sibling and still not suffer permanent psychological damage? Patra will tell you an entire childhood. By the age of six, Patra realized there was something drastically wrong with her sister, Angela. Angela, not knowingly, could switch from one personality to another in a matter of seconds. Not only was there a mental change, but there was also a physical change.Each of the five personalities had their own voice and facial expressions. They dressed differently and reacted to Patra differently. Two of them loved her, Kind and Hero, two of them tolerated her, Normal and Sad, and one of them hated her and wanted her dead, Angry.Through the tumultuous journey throughout Patra’s childhood there is an intriguing story of love, laughter, sorrow, and pain. It shows the great strength one can maintain throughout a young life seemingly without any hope. You will find Patra’s determination to live is remarkable and her faith in her ability to survive is quite astounding.Scroll up to buy My Five Sisters now to experience this psychological thriller focused on mental illness and sibling dynamics.This is a psychological thriller focused on a child's struggle to survive the abuse due partly from her sister's mental illness. Follow as Patra navigates life among her sister's five distinct personalities—some of which mean her harm.Pam Franklin grew up in Jackson, Mississippi and lives in Celebration, Florida with her husband of twenty-five years, Bobby. When not working or writing she spends time in Charleston, South Carolina with her daughter, Whitney and her grandsons, Teague and Crews. Learn more about Pam and her books at her website.",
  "genres": [
    "Thriller",
    "Memoir"
  ],
  "author": "Pam Franklin",
  "average_rating": "3.91",
  "url": "https://www.goodreads.com/book/show/25714730-my-five-sisters"
}