{
  "title": "Blame the Fireworks",
  "description": "Meet Harlie. He thinks he’s too awkward to live, maybe a little too shy and, very much to his frustration, simply ‘all knees and elbows’. A walking disaster zone. Tripping up stairs or running into glass doors, that kinda thing. And he’s got the biggest crush on his roommate’s older brother, Tabby, who seems to be completely out of his league. Not only is Tabby beautiful, he’s also elegant and confident, kindhearted and sort of just ‘perfect’.Tabby knows what he wants out of life, always had, and much to his parents disappointment, he continues pursuing the things that make him happy instead of pleasing them. He lives by mottos such as:‘Choose kindness and laugh often’, and ‘Do small things with great love’.When a tragedy strikes, Tabby realizes that life is more fragile than he ever wanted to admit. While he knows what he wants, Tabby isn’t fearless. The thought of losing his newfound friendship with Harlie terrifies him, but imagining all the wonderful things he’s missing out on, if he keeps chickening out, is even more painful.Perhaps he could talk Harlie into a spontaneous road trip… See if he can overcome his fears?And if fate is kind enough, he might get a chance at something very, very special.* * * Dear Author,My roommate’s brother is visiting again and sleeping on our couch. I tiptoe around and pray I don’t run into anything or cause a clatter that would wake him. All knees and elbows, that’s me— while he’s all strength and grace. Looking at him, I can’t help my wistful sigh. He’s beautiful, but that’s not it. It’s his gentle smiles and kindness. Unlike everyone else, he doesn’t treat me like I’m one stumble away from being declared a walking disaster zone.Unfortunately, he also treats me like a kid brother. He ruffles my hair and calls me ‘kiddo’. I wish I wasn’t so awkward. I wish I was sexy so he’d want me the way I want him. I wish I was the one he dreamed about as he slept on the couch.Photo Description: The photograph shows a black-and-white close-up of the face of a pretty, young man. His eyes are closed, and he appears to be sleeping, content.This story was written as a part of the M/M Romance Group's \"Love is an Open Road\" event. Group members were asked to write a story prompt inspired by a photo of their choice. Authors of the group selected a photo and prompt that spoke to them and wrote a short story. This story may contain sexually explicit content and is intended for adult readers. It may contain content that is disagreeable or distressing to some readers. The M/M Romance Group strongly recommends that each reader review the General Information section before each story for story tags as well as for content warnings.",
  "genres": [
    "M M Romance",
    "Contemporary",
    "Friends To Lovers",
    "Romance",
    "Short Stories",
    "Contemporary Romance",
    "LGBT"
  ],
  "author": "Riina Y.T.",
  "average_rating": "3.36",
  "url": "https://www.goodreads.com/book/show/25719146-blame-the-fireworks"
}