{
  "title": "Legends of the Mountain State",
  "description": "This literary work portrays and even amplifies the mysterious, bizarre and bloodcurdling Mountain State tales and ghoulish legends that have been passed down over the years. A unique and eerie anthology, this volume includes thirteen chilling accounts of Mountain State ghostly manifestations, myths and mountain mythology, based on known legends from West Virginia. Rural hauntings and stories of the macabre take center stage. Topics and stories covered include the Mothman monster, the Ethel coalmine spector, Silver Run, the Chapmanville high school haunting, the Ghost of Holden #22 Mountain and many, many others. West Virginia noted horror writer Michael Knost, of Logan County, WV, aptly serves as the anthology's editor; and writers for this special project are an amalgamation of nationally respected authors in the horror, science fiction and fantasy fields. There are also several up-and-comers included who are from in and around the state. All 13 of these disquieting accounts take place in rural West Virginia and are surprisingly of a family-friendly nature. However, Knost laughingly suggests that these are not the types of stories to be read late at night. He added, \"The thirteen tales are more than just documented biographies of legends, ghosts or spooky events. These are individual cases as told by some of the best storytellers in the business. Buckle up your seatbelt and enjoy the ride.\"Images in anthracite / by Thomas F. MonteleoneThe Chapmanville dead / by Trent WaltersHow the night receives them / by Kealan Patrick BurkeThe Blackwater lights / by Michael M. HughesSilver run / by Scott NicholsonMoney well-earned / by Joseph NassiseAfterdamp / by G. Cameron FullerCountry roads / by Tim WaggonerThe way home / by Mark JusticeScreaming Jenny / by Bev VincentSmoke and steel / by Marta MurvoshThe hungry earth / by Brian J. HatcherWild mountain freesia / by Jude-Marie Green",
  "genres": [
    "Horror",
    "Fiction"
  ],
  "author": "Michael Knost",
  "average_rating": "3.97",
  "url": "https://www.goodreads.com/book/show/2572065-legends-of-the-mountain-state"
}