{
  "title": "CrimeSpree: You Can't kill Murder",
  "description": "At the time, the 8th Day Era of America was seen as enlightened. It stood as a testament to scientific advancement and of man's triumph over nature and instinct. Violent crime was relegated to the history books. Viewed as nothing but a barbaric scourge of the past. Murder went extinct, it had been cured. Mickey Moore grew up in this sanitized version of America. He was a drifter and a small-time cheat. As Mickey matured, he sharpened his con-game, and got by on the misfortunes of others. But trickery and dumb-luck eventually betrayed Mickey, and he found himself broke and homeless as he approached middle age. Destitute and desperate, Mickey was hitching a ride across the New Mexico desert when fate shoved a new path before him. Under the bright rays of a dying sun, Mickey saw the impossible, he witnessed a murder. Shocked still in disbelief, he marveled at this primal display of man's feral past. The violence before him came at Mickey like a revelation. He was frightened, terrified in fact, but the con-man in him saw an opportunity. The sensation that Mickey felt was so strong, he felt as it awakened areas of his mind that the 8th Day Era's medicine had put to sleep. To package and sell such an experience was a million-dollar idea, and for the first time, Mickey actually believed in something. He would erect CrimeSpree, an amusement park, an interactive museum of man at his worst. Mickey's venture offered the American public the chance to participate in violence once again. At CrimeSpree, customers paid to play the parts of the victims of violent crime. It was all scary and lecherous fun, as a bored and uninspired public lined up to take part in the charade. But the fun and the games eventually put out the proverbial eye. The monster that Mickey created came to life and it dug human instinct out of the grave. The past was coming back around again. It was coming for America, and it was coming for Mickey.",
  "genres": [],
  "author": "Rich Hayden",
  "average_rating": "4.33",
  "url": "https://www.goodreads.com/book/show/25726113-crimespree"
}