{
  "title": "Steel & Stone Bundle: Chase the Dark / Bind the Soul / Yield the Night",
  "description": "This bundle includes the first 3 books in the Steel & Stone series:\n  CHASE THE DARK (Steel & Stone Book 1)  Piper Griffiths wants one thing in life: To become a Consul, a keeper of the peace between humans and daemons. There are three obstacles in her way.  The first is Lyre. Incubus. Hotter than hell and with a wicked streak to match. The second is Ash. Draconian. Powerful. Dangerous. He knows too much and reveals nothing. Also, disturbingly attractive — and scary. Did she mention scary? The third is the Sahar Stone. Top secret magical weapon of mass destruction. Previously hidden in her Consulate until thieves stole it, went on a murder spree, and left Piper to take the fall for their crimes.  Now she’s on the run with every daemon in the city gunning to kill her. She’s dead on her own, but there’s no one she can trust — except two entirely untrustworthy daemons... See problems one and two.  BIND THE SOUL (Steel & Stone Book 2)  The most important rule for an Apprentice Consul is simple: Don't get involved with daemons. Well, Piper is planning to break that rule — big time. After a near-deadly scandal with the Sahar Stone, she has the chance to return to the only life she's ever wanted. But there's one problem: Ash is missing.  Really, she shouldn't risk her future for him. He betrayed her. But he also saved her life, damn it. Wherever he is, he's in trouble, and if she doesn't save his sorry butt, who will? But with every dangerous secret she unravels, each one darker than the last, she slips deeper into Ash's world — a world with no escape for either of them.  YIELD THE NIGHT (Steel & Stone Book 3)  After surviving a round-trip to hell, Piper figures she can survive anything — until a group of crazy radicals burn her home to the ground and take her prisoner. The Gaians, a.k.a. the crazy radicals, want Piper to help them rid Earth of daemons and in exchange, they promise her the answer to all her problems: magic. But her magic comes at price — it could kill her.  The life she’s always known is crumbling around her and her future is slipping from her grasp, but the greatest danger of all lies within her, and no matter what she does, she may lose everything — including Ash.The Complete Steel & Stone Series:Chase the Dark (Steel & Stone #1)Bind the Soul (Steel & Stone #2)Yield the Night (Steel & Stone #3)Feed the Flames (Steel & Stone #3.5)Reap the Shadows (Steel & Stone #4)Unleash the Storm (Steel & Stone #5)",
  "genres": [],
  "author": "Annette Marie",
  "average_rating": "4.64",
  "url": "https://www.goodreads.com/book/show/25728570-steel-stone-bundle"
}