{
  "title": "Fifty-two Weeks of Submission",
  "description": "With romance, humour, candour, and plenty of hot and spicy action, this 900 page volume sizzles with first-person accounts of playroom scenes, dungeon visits, and discipline… all told in a lively, informal style by the young heroine. Eleanor, or Ellie for short, is very descriptive in her recounting of how she is taken in hand by her handsome husband, Nicholas, the wealthy CEO and owner of a successful London Marketing Company… who also happens to be Ellie’s boss… and who doesn’t stand for any nonsense.Ellie and Nick - or Sir, as he often prefers to be called - got married after a whirlwind romance, and seemed all set to live happily ever after… but in the first throes of love and lust, Ellie gave scant consideration to the implications of the submission that Nick required from her. With the honeymoon over, Ellie soon finds that she still has a lot to learn about being a submissive, and even more to discover about the extent of Nick’s previous involvement as a respected Dominant within the community.As the New Year starts, Ellie decides to keep a journal in which she chronicles many of the events during their first year of marriage, including her first visit to a BDSM club and an exotic, lifestyle party, describing episodes both pleasurable and painful in some detail, and charting the ups and downs of married life, and some of the challenges she and Nick face as they work out their relationship as a loving D/s couple.This is that journal.Month by month Ellie shares her thoughts and feelings, and her progress towards fully embracing her submissive desires, giving more than a glimpse into her experiences as a fledgling submissive, and her life with Nick, as he undertakes her training, and sometimes struggles with his feelings and his fears of losing her, as he seeks to achieve the balance between his own deep-seated need for control, and the needs of his often headstrong wife.He doesn’t always get it right… and Ellie often gets things wrong. She is fun loving and not always very responsible. Nick is more reserved and takes his responsibilities very seriously, including the need to take Ellie to task when she crosses the line, which she does frequently.Throughout the year, Ellie's understanding of what it means to be submissive changes, as she becomes more involved in the BDSM lifestyle, and along with her friend, Jo, gradually learns the ropes, though they both find it difficult to be on their best behaviour, with sometimes unhappy consequences.This book contains adult material, including explicit language and descriptions of activities involving domestic discipline, BDSM, and consensual sex, and is not suitable for persons under 18 years of age.‘Fifty-two Weeks of Submission’ was previously published in four parts as:'Ellie's Journal: The Diary of a (not very) Submissive Wife'“Dear Diary,My first entry in you – my lovely pink leather-bound journal that Nick gave me for Christmas, with a heap of other fantastic presents. He really does spoil me. Christmas was just perfect. Our first Christmas together, our first Christmas since we got married in October. We spent it with my family in Hampshire and he loved it. He was so relaxed and happy. Apparently it's not the sort of Christmas that he's been used to – everyone mucking in and goofing around, having fun. He's not been used to having fun – not until he met me anyway – well so he tells me. He has always been rather serious… and very responsible. Of course he still is a lot of the time… most of the time… total control freak with a sense-of-humour bypass! No, that's a bit harsh… I don't mean that… he does have a sense of humour, and he does let me get away with quite a lot… really… sometimes. I'm just feeling a tiny bit sorry for myself at the moment. It's only seven in the evening and I've been sent to bed without dinner after a really sound punishment spanking that has left my backside the colour of cooked beetroot, and so sore that I'm having to lie on my front to write this.Yeah, I f….d up again!I suspected when I woke up this morning, at about 11.00 a.m. and with the mother of all hangovers, that there was a very strong likelihood that I probably disgraced myself last night. There was a vague feeling of unease hovering in the back of my addled brain, but with little memory of the detail of the later hours of our New Year's Eve party, I wasn't sure why… except that the last thing that I did remember clearly was a very hard slap on the bum and being ordered – yes, ordered – to go to bed. But then it was about 4.00 a.m. and opening another bottle of champagne was probably not one of Jo's better ideas, particularly when everyone else had already gone to bed and she managed to ricochet the cork off the wall and spill half the contents.I remember that I actually thought for a minute, that Nick was going to mete out the same treatment to her, and he may well have done if she hadn't looked instantly contrite and blurted out a hurried 'sorry Nick', before scuttling off to join Rafael, who had emerged bleary-eyed and stark naked to see what all the noise was about. At least Nick had pulled some jeans on before he'd come to investigate.I don't know if Nick came back to bed. I was out like a light the minute my head hit the pillow. I just know that he wasn't there when I woke up, but that's not unusual.As I eased my aching limbs off the bed and dragged my carcass into the bathroom, I tried to recall last night's events.I know it was a great party and that I had a really good time – best New Year's party ever – whatever Nick may have to say about it! New Year's parties are often a bit lame, but being in our new penthouse apartment, overlooking the Thames, with loads of our friends there, and Nick at his most charming – which is considerably charming, and generous, and sexy and deliciously gorgeous – well it was brilliant, and we had a fantastic view of the fireworks from the balcony. That was so exciting – even Nick was grinning broadly as he hugged me close to his side, though that was probably at my almost childlike enjoyment of the spectacle. It makes him happy when I'm happy. I do love him… so much.So, anyway, after I'd showered and dressed in jeans that hugged my curves and a filmy peasant style blouse that is one of Nick's favourites, I blow-dried my dark hair to glossy perfection and applied a smidgen of lip-gloss. I'd decided that I needed to remind him of how adorable he finds me… … some of the detail of the previous evening had come back to me in the shower, while the warm water worked its magic on my dulled senses… and in the forefront was this vision of Nick, looking really angry, as Jo and I led a conga line into the lift, and I keyed in the code to take about twenty of us down to the foyer, ignoring his shouted protestations. Then, another flash… dancing along the embankment… when Nick suddenly appeared again and started apologising to the two policemen who Jo and I were talking to, and who were actually being really friendly and not at all aggro… so I don't know why he thought he had to throw me over his shoulder like he did.So… yeah… I was sort of expecting more fireworks than had lit up the previous night's sky, when I finally summoned the courage to go and face him… but I clung to the hope that he'd maybe lightened up a bit.”Nick and Ellie's love story, their developing relationship, and Ellie's journey into submission, is described in the trilogy: 'Love by Design', with the three titles – 'Taken in Hand'; 'Taken Further', and 'Taken Completely', or in 'Love by Design – Taken Altogether', which is the revised and edited novel comprised from the original trilogy.Although it is not necessary to have read all, or any, of these in order to follow the accounts in 'Fifty-two Weeks of Submission', the friends that Ellie refers to, and aspects of Nick and Ellie's lifestyle and character are more fully described in the above books.",
  "genres": [],
  "author": "J.R. James",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/25719853-fifty-two-weeks-of-submission"
}