{
  "title": "The Offer",
  "description": "THE OFFER is a STANDALONE, CONTEMPORARY ROMANCE NOVEL from the New York Times, Wall Street Journal and USA Today Bestselling author of The Pact.  She thinks he's an arrogant playboy. He thinks she's an uptight prude. But he's about to make her an offer she can't refuse.  Nicola Price used to have it all – a great career, the perfect boyfriend, an excessive shoe collection and an apartment in one of San Francisco’s best neighborhoods. But when she gets knocked up and her a**hat boyfriend leaves her high and dry, Nicola’s perfectly crafted world comes tumbling down. And stays that way.  Now, Nicola is the proud single mom to a five-year old daughter and living a giant lie. She can barely afford their ghetto apartment and all the men she dates run when they hear she comes with a child. She’s struggling and scared – and nowhere near where she thought she’d be at age thirty-one.  Her saving grace comes in the form of a tall, handsome and wealthy Scotsman Bram McGregor, the older brother of her friend Linden. Bram understands a thing or two about pride, so when tragic circumstances place Nicola at rock bottom, he offers them a place to live in the apartment complex he owns. It’s pretty much the perfect deal, so as long as she doesn’t mind living beside Bram, a man that, despite his generosity, seems to antagonize her at every turn.  But nothing in life is free and as Nicola gets her feet back on the ground, she discovers that the enigmatic playboy may end up costing her more than she thought.  She might just lose her heart.  Those McGregor brothers are nothing but trouble…  Though THE OFFER follows characters that were previously introduced in the novel THE PACT, you do NOT need to read The Pact beforehand as The Offer is its own story and is a fully standalone novel.  This book is rated 18+ for explicit sexual situations and language. Reader discretion is advised.",
  "genres": [
    "Romance",
    "Contemporary",
    "Contemporary Romance",
    "New Adult",
    "Adult",
    "Audiobook",
    "Friends To Lovers"
  ],
  "author": "Karina Halle",
  "average_rating": "3.86",
  "url": "https://www.goodreads.com/book/show/25726443-the-offer"
}