{
  "title": "I Am Crying All Inside and Other Stories",
  "description": "Ten stories of mystery and imagination in a world that cannot be—including the never-before-published “I Had No Head and My Eyes Were Floating Way Up in the Air,” originally written for Harlan Ellison’s The Last Dangerous Visions ™ People work. Folk play. That is the way it has been in this country as long as Sam can remember. He is happy, and he understands that this is the way it should be. People are bigger than folk. They are stronger. They do not need food or water. They do not need the warmth of a fire. All they need is a job to do and a blacksmith to fix them when they break. The people work so the folk can drink their moonshine, fish a little, throw a horseshoe. But when Sam starts to wonder about why the world is this way, his life will never be the same.   Along with the other stories in this collection, “I Am Crying All Inside” is a compact marvel: a picture of an impossible reality that is not so different from our own.   Each story includes an introduction by David W. Wixon, literary executor of the Clifford D. Simak estate and editor of this ebook.Contents: * Clifford D. Simak: Grand Master Indeed! • essay by David W. Wixon * Installment Plan (1959) / novelette by Clifford D. Simak: A work gang shows up on a remote planet to collect the harvest of podars needed for medicine, but the natives would not sell. * I Had No Head and My Eyes Were Floating Way Up in the Air (1973) / short story by Clifford D. Simak: After being rebuilt as an alien monster, a human astronaut plans revenge against his alien tormentors. (Originally written in 1973 for Harlan Ellison's un-published anthology The Last Dangerous Visions.) * Small Deer (1965) / short story by Clifford D. Simak: A tinkerer fires up a time machine and learns what killed off the dinosaurs, and may come back. * Ogre (1944) / novelette by Clifford D. Simak: On a planet ruled by intelligent vegetables - music trees, rifle trees, and electro-vines - humans seeking to exploit the resources find themselves exploited. * Gleaners (1960) / novelette by Clifford D. Simak: The put-upon director of Past, Inc. sends out operatives to cherry-pick treasures from the past, until some oddly prescient folk in his office suggest another way. * Madness from Mars (1939) / short story by Clifford D. Simak: The fourth, and only, spaceship to return from Mars holds an insane crew and a Martian \"furball\". * Gunsmoke Interlude (1952) / short story by Clifford D. Simak I Am Crying All Inside (1969) / short story by Clifford D. Simak: The smart and rich people of Earth have left, along with their smart machines, leaving behind the rest. * The Call from Beyond (1950) / novelette by Clifford D. Simak *All the Traps of Earth (1960) / novelette by Clifford D. Simak: A runaway robot gains the ability to telekinetically fix any problem, yet cannot fix his own problem: the need to be needed.",
  "genres": [
    "Short Stories",
    "Science Fiction",
    "Fiction",
    "Collections",
    "Science Fiction Fantasy",
    "Anthologies",
    "Speculative Fiction"
  ],
  "author": "Clifford D. Simak",
  "average_rating": "4.19",
  "url": "https://www.goodreads.com/book/show/25730874-i-am-crying-all-inside-and-other-stories"
}