{
  "title": "The 2011 Book Blogger's Cookbook (The Book Blogger's Cookbook)",
  "description": "\"This genuinely unique and creative cookbook delivers delicious recipe ideas inspired by some of the hottest novels released in recent years to create a mouthwatering feast for the eyes and the mouth\"~BookBub.comGreat books, bloggers, and recipes meet in this fresh and unique cookbook that helps you experience books, not just read them.Books were selected from the author’s book review blog and paired with delectable recipes like “Fairy Touched Calico Brownies” from the Fablehaven series by Brandon Mull, “7-Day Layer Dip” from Lauren Oliver’s Before I Fall, and “I Hate Chocolate Cake” from Amanda Hocking’s Switched.Mouthwatering photos complement every recipe.The 2012 Book Blogger’s Cookbook is now available and includes a foreword by David Farland, award winning, New York Times Bestselling author.The 2011 Book Blogger’s Cookbook includes a foreword by Amanda Hocking, author of the USA Today Bestselling Trylle Trilogy and showcases over seventy reviews with links to book review blogs and author websites.\"A surprisingly large number of recipes from this collection caught my attention. Even better each one I tried out turned out great. The favorite recipe was the Fablehaven Mint Brownies. The recipe turned out great the very first time and had an appropriate amount of mint flavor. I definitely recommend downloading this unusual collection. You'll get access to recipes worthy of repeat usage and might even find some interesting new reads if you're lucky.\"~Heidi Sue Roth, Midwest Book Review**If you love young adult books, you'll love the cookbook***Whether you're a food lover, an avid reader or a book blogger, there’s something for you in The 2011 Book Blogger’s Cookbook.",
  "genres": [
    "Cookbooks",
    "Cooking",
    "Nonfiction",
    "Reference",
    "Food",
    "Health"
  ],
  "author": "Christy Dorrity",
  "average_rating": "3.59",
  "url": "https://www.goodreads.com/book/show/11605529-the-2011-book-blogger-s-cookbook-the-book-blogger-s-cookbook"
}