{
  "title": "Death Lords Motorcycle Club: Chelsea & Wrecker",
  "description": "HIS WILD DESIRE I'm not supposed to want him, but I do. I'm not supposed to need him, but I can't stop.I'm not supposed to love him, but my heart won't listen.Most of all? I'm definitely, under no circumstances, supposed to sleep with him.Grant \"Wrecker\" Harrison spent three years of his life locked away. He's out and he's tired of hiding. He wants everyone, even his father Judge President of the Death Lords MC, to know she's his.HIS MAD PASSIONWhen Chelsea is mocked in the grocery store of her hometown for being in a relationship with her stepbrother, she swallows her anger. If that's the worst thing that happens, who cares? She and Wrecker are finally together and that’s all that matters.But police at the door of their apartment in the early morning hours shatters her new found happiness with Grant \"Wrecker\" Harrison--the boy who grew into the only man she'll love. Wrecker has spent three years in prison and now that he's out, he's not going back even if that means running from his club, his old man, and the life he thought he always wanted. But he won't leave Chelsea behind this time or let anyone or anything take her from him.HIS BOLD HEARTI'd waited until she was seventeen to claim her. Now she's mine and she'll stay mine even if I have to fight the whole world to keep her.Wrecker waited three years behind bars for his girl, Chelsea, and now that they are together they will fight anyone and anything that threatens to separate them. When a local Fortune woman is killed, Wrecker is a convenient scapegoat for the dirty Fortune police. The answers to the woman's death appears to lie in the hands of a neighboring motorcycle club whose secrets could get them killed.Available Now in the Motorcycle Clubs series. All are available individually free through your Kindle Unlimited subscription. 1. HIS WILD DESIRE by Ella Goode (Death Lords MC #1) 2. OFF LIMITS by Ruby Dixon (Bedlam Butchers #1) 3. WANTING IT ALL by Kati Wilde (Hellfire Riders #1) 4. HER SECRET PLEASURE by Ella Goode (Death Lords MC #2) 5. PACKING DOUBLE by Ruby Dixon (Bedlam Butchers #2) 6. TAKING IT ALL by Kati Wilde (Hellfire Riders #2) 7. THEIR PRIVATE NEED by Ella Goode (Death Lords MC #3) 8. DOUBLE TROUBLE by Ruby Dixon (Bedlam Butchers #3) 9. HAVING IT ALL by Kati Wilde (Hellfire Riders #3) 10. THEIR FIERCE LOVE by Ella Goode (Death Lords MC #4) 11. BETTING IT ALL by Kati Wilde (Hellfire Riders MC #4) 12. DOUBLE DOWN by Ruby Dixon (Bedlam Butchers MC #4) 13. THEIR LASTING CLAIM by Ella Goode (Death Lords MC #5) 14. RISKING IT ALL by Kati Wilde (Hellfire Riders MC #5) 15. DOUBLE OR NOTHING by Ruby Dixon (Bedlam Butchers MC #5) 16. BURNING IT ALL by Kati Wilde (Hellfire Riders MC #6) 17. HIS MAD PASSION by Ella Goode (Death Lords MC #6) 18. SLOW RIDE by Ruby Dixon (Bedlam Butchers MC #6)19. HIS BOLD HEART by Ella Goode (Death Lords MC #7)",
  "genres": [
    "Romance",
    "Erotic Romance"
  ],
  "author": "Ella Goode",
  "average_rating": "4.13",
  "url": "https://www.goodreads.com/book/show/25731915-death-lords-motorcycle-club"
}