{
  "title": "A Man for All Markets: From Las Vegas to Wall Street, How I Beat the Dealer and the Market",
  "description": "The incredible true story of the card-counting mathematics professor who taught the world how to beat the dealer and, as the first of the great quantitative investors, ushered in a revolution on Wall Street.A child of the Great Depression, legendary mathematician Edward O. Thorp invented card counting, proving the seemingly impossible: that you could beat the dealer at the blackjack table. As a result he launched a gambling renaissance. His remarkable success--and mathematically unassailable method--caused such an uproar that casinos altered the rules of the game to thwart him and the legions he inspired. They barred him from their premises, even put his life in jeopardy. Nonetheless, gambling was forever changed.Thereafter, Thorp shifted his sights to \"the biggest casino in the world\" Wall Street. Devising and then deploying mathematical formulas to beat the market, Thorp ushered in the era of quantitative finance we live in today. Along the way, the so-called godfather of the quants played bridge with Warren Buffett, crossed swords with a young Rudy Giuliani, detected the Bernie Madoff scheme, and, to beat the game of roulette, invented, with Claude Shannon, the world's first wearable computer.Here, for the first time, Thorp tells the story of what he did, how he did it, his passions and motivations, and the curiosity that has always driven him to disregard conventional wisdom and devise game-changing solutions to seemingly insoluble problems. An intellectual thrill ride, replete with practical wisdom that can guide us all in uncertain financial waters, A Man for All Markets is an instant classic--a book that challenges its readers to think logically about a seemingly irrational world.Praise for A Man for All Markets\"In A Man for All Markets, [Thorp] delightfully recounts his progress (if that is the word) from college teacher to gambler to hedge-fund manager. Along the way we learn important lessons about the functioning of markets and the logic of investment.\"--The Wall Street Journal\"[Thorp] gives a biological summation (think Richard Feynman's Surely You're Joking, Mr. Feynman!) of his quest to prove the aphorism 'the house always wins' is flawed. . . . Illuminating for the mathematically inclined, and cautionary for would-be gamblers and day traders\"--\nLibrary Journal",
  "genres": [
    "Finance",
    "Biography",
    "Business",
    "Nonfiction",
    "Economics",
    "History",
    "Memoir"
  ],
  "author": "Edward O. Thorp",
  "average_rating": "4.24",
  "url": "https://www.goodreads.com/book/show/25733505-a-man-for-all-markets"
}