{
  "title": "A Small Country about to Vanish",
  "description": "\"A most remarkable homage to things Israeli, things Jewish, things human, and the love and honesty it takes to face down a country gone awry, a people prone to remembering and forgetting, a heart that knows true love and therefore knows its absence.A Small Country About To Vanish is love's survival story, between the author and her country of Israel, between Shelli and Rona, between a mother and her children, between a husband and wife. In many ways, Israel's story is reflected in Eithan's who finds himself ultimately alone and unloved in a sea of condemnation.Avilan, speaking directly to her beloved country, is saying, \"I love you enough to speak truth as I see it.\" Avilan writes about Israel with the love and pain stemming from the realization that not all that we love is perfect, but we can't help loving it, or him, or her.This book almost reads itself, so sure-footed is the pacing, the ease of being drawn in despite some unease about what is written; I admire the way the author does not intrude on her characters (and thus her readers) with the pointed finger of too much message forcibly delivered. A reader's ease and ability to identify with each main character is to have witnessed Avilan's magic literary show.As a reader, one leans into this character or that one, or all of them, as readily as one turns the pages. One of the hallmarks of a well-designed and well-written story, for me, is whether the characters stay with me long after the book is done. Do they ever! Read this book at your own peril and your own pleasure because it will make you feel. And you will remember the people from A Small Country About to Vanish.\" By Historical Romance author T. T. Thomas.",
  "genres": [
    "Romance",
    "Jewish",
    "LGBT",
    "Fiction",
    "Israel",
    "Audiobook",
    "Lesbian"
  ],
  "author": "Victoria Avilan",
  "average_rating": "3.69",
  "url": "https://www.goodreads.com/book/show/25731357-a-small-country-about-to-vanish"
}