{
  "title": "Double Switch",
  "description": "“Monday’s  Double Switch  is a rocket ride of a sports mystery with a wicked curve ball on every smoothly written page. May Johnny Adcock’s careers as a relief pitcher and sleuth motor on for a very long time.\"--David Baldacci, #1  New York Times  bestselling authorBlackmail. Bullets. Deception. It’s time to play ball.Johnny Adcock, the aging major-league relief pitcher who moonlights as a private investigator, returns in the thrilling follow-up to The Setup Man .      Johnny Adcock doesn’t have an office; he has the bullpen. That’s where he’s sitting shelling sunflower seeds after a game, when up walks Tiff Tate, the enigmatic, career-making PR/stylist behind the most highly marketable looks in baseball. Tiff needs Adcock’s special brand of expertise. Her new client is Yonel Ruiz, the rookie phenom who courageously risked life and limb in shark-infested waters to flee his native Cuba for fame, fortune, and freedom in Major League Baseball. Now that Ruiz has signed a record-setting contract, the Venezuelan cartel that smuggled him out is squeezing him for a bigger slice of the action and they’ve unleashed a ruthless assassin, known only as La Loba, to collect. Adcock takes the case, even though the front office wants to shut down his side job and has sent its no-nonsense corporate fixer and “director of security” to keep a close eye on him. Adcock is immediately swept up in a high-pressure game full of surprising twists, double crosses, and deadly gambits that will leave him fighting for his life and in danger of losing more than the heat off his fastball or a spot in the playoffs.     Critics raved about The Setup Man : “A sexy mystery with a rakish lead” ( Milwaukee Journal Sentinel ), “This rookie thriller writer has homered his first time at bat” ( The Free Lance-Star ), and “Teems with sex, violence—and baseball . . . Monday deserves promotion to the starting rotation of thriller writers” ( St. Louis Post-Dispatch ). Double Switc h proves that Johnny Adcock is one of the genre’s most entertaining detectives in years, and gives readers a welcome return to the sexy,action-packed, and thrilling world where high-stakes professional sports and life-or-death action collide.",
  "genres": [
    "Sports",
    "Baseball",
    "Mystery",
    "Fiction",
    "Thriller",
    "Mystery Thriller",
    "Audiobook"
  ],
  "author": "T.T. Monday",
  "average_rating": "3.68",
  "url": "https://www.goodreads.com/book/show/25733909-double-switch"
}