{
  "title": "The Legends Club: Dean Smith, Mike Krzyzewski, Jim Valvano, and an Epic College Basketball Rivalry",
  "description": "The riveting inside story of college basketball's fiercest rivalry among three coaching legends—University of North Carolina's Dean Smith, Duke's Mike Krzyzewski, and North Carolina State's Jim Valvano—by the king of college basketball writers, #1 New York Times bestseller John FeinsteinOn March 18, 1980, the immensely powerful Duke basketball program announced the hiring of its new coach—the man who would resurrect the team, restore glory to Duke, and defeat the legendary Dean Smith, who coached down the road at UNC Chapel Hill and had turned UNC into a powerhouse. Duke's new man was Mike Krzyzewski. The only problem was, no one knew who Krzyzewski was, he had a so-so record in his short time as head coach of Army, and worst of all, no one could even pronounce his name. The announcement caused head scratches . . . if not immediate calls for his head . . . and on this note his career at Duke began.     The table was set nine days later, when on March 27, 1980, Jim Valvano was hired by North Carolina State to be their new head coach. The hiring didn't raise as many eyebrows, but with the exuberant Valvano on board, two new coaches were now in place to challenge Dean Smith—and the most sensational competitive decade in history was about to unfold.     In the skillful hands of John Feinstein, this extraordinary rivalry—and the men behind it—come to life in a unique, intimate way. The Legends Club is a sports book that captures an era in American sport and culture, documenting the inside view of a decade of absolutely incredible competition. Feinstein pulls back the curtain on the recruiting wars, the intensely personal competition that wasn't always friendly, the enormous pressure and national stakes, and the battle for the very soul of college basketball allegiance in a hot-bed area. Getting to the roots of the NCAA goliath that is followed religiously by millions of fans today, Feinstein uses his unprecedented access to all three coaches to paint a portrait only he could conjure. The Legends Club is destined to be one of Feinstein's biggest bestsellers.",
  "genres": [
    "Sports",
    "Nonfiction",
    "Basketball",
    "Biography",
    "History",
    "Audiobook",
    "Leadership"
  ],
  "author": "John Feinstein",
  "average_rating": "4.32",
  "url": "https://www.goodreads.com/book/show/25733908-the-legends-club"
}