{
  "title": "Carry Your Heart",
  "description": "When Isabelle Martin steps onto Sawyer Auto Repair's parking lot, she can't believe it's come to this. After dropping out of a school she never really wanted to go to in the first place and dumping a boyfriend she never really loved to begin with, she thought coming home to Claremont, North Carolina would solve all her problems. Instead, she's still reeling from her mom's death six months earlier and trying, but failing to help her dad, who's sunken deep into a whiskey-fueled depression. Working in the local, motorcycle club-owned, auto shop's office is a last resort, but it's the only option she has...even if it means working with Caleb Sawyer, the bad-boy biker with swagger to spare who used to drive her up the wall in high school.Caleb Sawyer is on the fast-track to a downward spiral. He used to think he had the world at his feet--all he has to do is be patient, earn his keep in the club and in the shop, and his legacy within the Iron Horsemen MC will be his for the taking when the time is right. But that just doesn't mean anything without his old lady by his side, who wants to leave Claremont more than she wants to stay with him. When the bottom finally drops out, nothing prepares him for the impact and he deals with it the only way he knows how--with whiskey and women. Despite all that, being around Isabelle Martin, the girl whose feathers he ruffled so easily in high school, somehow brings him back to life. She doesn't take any of his crap, but she calls him on it without judgment and without pity.Despite some initial animosity, Caleb and Isabelle quickly realize that the perceptions they had of each other in high school couldn't be further from the truth. The more time they spend together, the closer they become and the more they gravitate towards each other. Both are at a crossroads, but stuck in reverse. Isabelle needs help; she just doesn't know how to ask for it. Caleb needs a life preserver; he just doesn't know where to find one. And ultimately, on the path to rediscovery and identity, all roads lead them to exactly what they need--each other.New adult/contemporary romance told in alternating points of view. Recommended for readers 18 and older.",
  "genres": [
    "Romance",
    "New Adult",
    "Contemporary",
    "Contemporary Romance",
    "Adult",
    "Motorcycle",
    "New Adult Romance"
  ],
  "author": "K.   Ryan",
  "average_rating": "3.89",
  "url": "https://www.goodreads.com/book/show/25740316-carry-your-heart"
}