{
  "title": "The Undercover Economist",
  "description": "“The economy [isn’t] a bunch of rather dull statistics with names like GDP (gross domestic product),” notes Tim Harford, columnist and regular guest on NPR’s Marketplace, “economics is about who gets what and why.” In this acclaimed and riveting book–part exposé, part user’s manual–the astute and entertaining columnist from the Financial Times demystifies the ways in which money works in the world. From why the coffee in your cup costs so much to why efficiency is not necessarily the answer to ensuring a fair society, from improving health care to curing crosstown traffic–all the dirty little secrets of dollars and cents are delightfully revealed by The Undercover Economist .“A rare a book on economics that will enthrall its readers . . . It brings the power of economics to life.”–Steven D. Levitt, coauthor of Freakonomics“A playful guide to the economics of everyday life, and as such is something of an elder sibling to Steven Levitt’s wild child, the hugely successful Freakonomics.”– The Economist“A tour de force . . . If you need to be convinced of the everrelevant and fascinating nature of economics, read this insightful and witty book.”–Jagdish Bhagwati, author of In Defense of Globalization“This is a book to savor.”– The New York Times“Harford writes like a dream. From his book I found out why there’s a Starbucks on every corner [and] how not to get duped in an auction. Reading The Undercover Economist is like spending an ordinary day wearing X-ray goggles.”–David Bodanis, author of Electric Universe“Much wit and wisdom.”–The Houston ChronicleFrom Publishers WeeklyNattily packaged-the cover sports a Roy Lichtensteinesque image of an economist in Dick Tracy garb-and cleverly written, this book applies basic economic theory to such modern phenomena as Starbucks' pricing system and Microsoft's stock values. While the concepts explored are those encountered in Microeconomics 101, Harford gracefully explains abstruse ideas like pricing along the demand curve and game theory using real world examples without relying on graphs or jargon. The book addresses free market economic theory, but Harford is not a complete apologist for capitalism; he shows how companies from Amazon.com to Whole Foods to Starbucks have gouged consumers through guerrilla pricing techniques and explains the high rents in London (it has more to do with agriculture than one might think). Harford comes down soft on Chinese sweatshops, acknowledging \"conditions in factories are terrible,\" but \"sweatshops are better than the horrors that came before them, and a step on the road to something better.\" Perhaps, but Harford doesn't question whether communism or a capitalist-style industrial revolution are the only two choices available in modern economies. That aside, the book is unequaled in its accessibility and ability to show how free market economic forces affect readers' day-to-day.Copyright © Reed Business Information, a division of Reed Elsevier Inc. All rights reserved.From Bookmarks MagazineHarford exposes the dark underbelly of capitalism in Undercover Economist . Compared with Steven Levitt’s and Stephen J. Dubner’s popular Freakonomics (*** July/Aug 2005), the book uses simple, playful examples (written in plain English) to elucidate complex economic theories. Critics agree that the book will grip readers interested in understanding free-market forces but disagree about Harford’s approach. Some thought the author mastered the small ideas while keeping in sight the larger context of globalization; others faulted Harford for failing to criticize certain economic theories and to ground his arguments in political, organizational structures. Either way, his case studies—some entertaining, others indicative of times to come—will make you think twice about that cup of coffee.Copyright © 2004 Phillips & Nelson Media, Inc.",
  "genres": [
    "Economics",
    "Nonfiction",
    "Business",
    "Finance",
    "Politics",
    "Science",
    "Psychology"
  ],
  "author": "Tim Harford",
  "average_rating": "3.81",
  "url": "https://www.goodreads.com/book/show/25735.The_Undercover_Economist"
}