{
  "title": "Have Gun, Will Travel",
  "description": "The sun never sets on a Bare Bones patch.Beatrix Hellman has reunited with her Bare Bones sweetbutt friends from high school. Her isolated life in a mountaintop convent has ground to a sudden halt, her faith dashed against the rocks. She needs something else to believe in, and her old friends become her new family. But a sadistic cartel associate of the club has maimed one of the whores. Bee and the women put a bounty on Tony Tormenta’s head. And they think they know just the man for the job.Zane “Sax” Saxonberg is back from a different sort of exile. He was banished by his club Prez brother Leo a decade ago to ride the interstates of America as a nomad. Haunting back road BDSM clubs, Sax has a willing submissive in every state. He returns to the Bare Bones’ backyard to help the women and to check on his nephew Harte. Instead he finds a fiery slave in Bee—part camp counselor, part nun, part Force Me Queen.Will Sax’s bold heroics renew Bee’s faith in the world? She finds control and strength in submitting to the virile bad boy biker. With each power exchange, she is brought closer to a fresh hope and conviction, but tracking down the brutal Tormenta also brings fresh danger as they close in on his mountaintop hideout.Publisher’s Note: This is Book #5 in the Bare Bones MC series. This book is a stand-alone and can be read out of order, but the series is best read in order to gain the full experience. This is not your mother’s contemporary romance. Daring readers will encounter violence against women, rebel play, May/December age play, exhibitionism/voyeurism, spanking, your garden-variety bondage, and a HEA. It is not for the faint of heart. It’s a full length novel of 70,000 words with no cliffhanger. Recommended 18+ due to mature content and possible triggers.",
  "genres": [
    "Romance",
    "BDSM",
    "Contemporary Romance"
  ],
  "author": "Layla Wolfe",
  "average_rating": "4.31",
  "url": "https://www.goodreads.com/book/show/25734651-have-gun-will-travel"
}