{
  "title": "Micah and the Phoenix Tree",
  "description": "Micah and her twin sister Kiera can do things. They’ve known they were different since they were little, but they’d hidden that side of their lives for fourteen years, fearing rejection from their family and friends.Soon after their fourteenth birthday, their lives were uprooted by a group of hooded men ushering them out of their old existence and into a whole new world where everyone was gifted and people could openly be who they were meant to be. The problem is, Micah has no clue who or what she is.The twins run across all the normal things that regular kids find in high school, including some odd classes, the school bully and the high school crushes that simultaneously aggravate and fascinate the girls. They’ve made a few friends and even like a couple of their teachers but Micah feels lost and misses the normal life she had before she found out she was extraordinary.The Phoenix Tree is the one thing that has drawn Micah’s attention. It is the epicenter of their school and the root of all the power the school protects. Their freshman year just happens to be the Year of Renewal, the one time every fifty years that the Phoenix Tree is weakened, and someone wants its power.When Kiera uncovers a secret book in the freshman library, their lives begin to unravel. They discover that their destinies have already been decided for them as they dive deeper into the world of the Linemen, where everyone has their place and the SEAL decides their fates.Suddenly, their friends aren’t exactly who they thought they were and even their own teachers who were sworn to protect them have secrets. Their own school principal, bearing a hideous scar and a mysterious past, is the most frightening of them all and his own grand secrets could mean the end of the new life they’d just barely begun to know.Micah and Kiera are forced to dig deep into those secrets and even deeper into themselves, where the truth is only an illusion and deceit hides out in every corner of every hallway.",
  "genres": [],
  "author": "L.J. Fox",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/25740450-micah-and-the-phoenix-tree"
}