{
  "title": "Death's End",
  "description": "Soon to be a Netflix Original Series!“ The War of the Worlds for the 21st century… packed with a sense of wonder.” – Wall Street JournalThe New York Times bestselling conclusion to a tour de force near-future adventure trilogy from China's bestselling and beloved science fiction writer.With The Three-Body Problem , English-speaking readers got their first chance to read China's most beloved science fiction author, Cixin Liu. The Three-Body Problem was released to great acclaim including coverage in The New York Times and The Wall Street Journal and reading list picks by Barack Obama and Mark Zuckerberg . It was also won the Hugo and Nebula Awards, making it the first translated novel to win a major SF award.Now this epic trilogy concludes with Death's End . Half a century after the Doomsday Battle, the uneasy balance of Dark Forest Deterrence keeps the Trisolaran invaders at bay. Earth enjoys unprecedented prosperity due to the infusion of Trisolaran knowledge. With human science advancing daily and the Trisolarans adopting Earth culture, it seems that the two civilizations will soon be able to co-exist peacefully as equals without the terrible threat of mutually assured annihilation. But the peace has also made humanity complacent.Cheng Xin, an aerospace engineer from the early twenty-first century, awakens from hibernation in this new age. She brings with her knowledge of a long-forgotten program dating from the beginning of the Trisolar Crisis, and her very presence may upset the delicate balance between two worlds. Will humanity reach for the stars or die in its cradle?The Remembrance of Earth's Past series:The Three-Body ProblemThe Dark ForestDeath's EndOther books:Ball LightningSupernova EraTo Hold Up The Sky (forthcoming)At the Publisher's request, this title is being sold without Digital Rights Management Software (DRM) applied.",
  "genres": [
    "Science Fiction",
    "Fiction",
    "Audiobook",
    "China",
    "Fantasy",
    "Science Fiction Fantasy",
    "Space"
  ],
  "author": "Liu Cixin",
  "average_rating": "4.41",
  "url": "https://www.goodreads.com/book/show/25735618-death-s-end"
}