{
  "title": "General George Washington: A Military Life",
  "description": "Much has been written in the past two centuries about George Washington the statesman and “father of his country.” Less often discussed is Washington’s military career, including his exploits as a young officer and his performance as the Revolutionary War commander in chief. Now, in a revealing work of historical biography, Edward Lengel has written the definitive account of George Washington the soldier.Based largely on Washington’s personal papers, this engrossing book paints a vivid, factual portrait of a man to whom lore and legend so tenaciously cling. To Lengel, Washington was the imperfect commander. Washington possessed no great tactical ingenuity, and his acknowledged “brilliance in retreat” only demonstrates the role luck plays in the fortunes of all great men. He was not an enlisted man’s leader; he made a point of never mingling with his troops. He was not an especially creative military thinker; he fought largely by the book. He was not a professional, but a citizen soldier, who, at a time when warfare demanded that armies maneuver efficiently in precise formation, had little practical training handling men in combat. Yet despite his flaws, Washington was a remarkable figure, a true man of the moment, a leader who possessed a clear strategic, national, and continental vision, and who inspired complete loyalty from his fellow revolutionaries, officers, and enlisted men. America could never have won freedom without him.A trained surveyor, Washington mastered topography and used his superior knowledge of battlegrounds to maximum effect. He appreciated the importance of good allies in times of crisis, and understood well the benefits of coordination of ground and naval forces. Like the American nation itself, he was a whole that was greater than the sum of its parts–a remarkable everyman whose acts determined the course of history. Lengel argues that Washington’s excellence was in his completeness, in how he united the military, political, and personal skills necessary to lead a nation in war and peace. At once informative and engaging, and filled with some eye-opening revelations about Washington, the war for American independence, and the very nature of military command, General George Washington is a book that reintroduces readers to a figure many think they already know.From the Hardcover edition.",
  "genres": [
    "History",
    "Biography",
    "Nonfiction",
    "American Revolution",
    "American History",
    "Military Fiction",
    "Military History"
  ],
  "author": "Edward G. Lengel",
  "average_rating": "4.09",
  "url": "https://www.goodreads.com/book/show/1161002.General_George_Washington"
}