{
  "title": "To Date A Disaster",
  "description": "Librarian Cara Devigne was beyond shocked to discover that she was the long lost relative of Apep, the God of Chaos. Though that information went a long way in explaining why madness, mayhem and pandemonium broke out all too often in her vicinity of late. More disturbing, she learnt that the only way for her ruthless relatives to awaken Apep is with her blood… all of it. Accepting a job at the Southern Sanctuary, located in far off Australia, is her best option of staying alive. A place where magic is real and she should be safe. Except she keeps bumping into gorgeous - off limits - Erik Valhalla, and her unstable chaos whammy powers appear to be intent upon killing the man. Maybe it’s because he acts like a grade-A jerk, leering at her and talking to her breasts… so it was a complete mystery to her, why, when she wasn’t trying to kill Erik, all she could thinking about was kissing him. Erik Valhalla is a man under extreme pressure. His mother has gone grandbaby crazy. Desperate to see her son melded she has instigated a major harassment campaign in an attempt to present him with suitable baby-mama candidates. So when gorgeous Cara Devigne practically throws herself at his feet he rightfully panics. He’s determined to act the jerk because he knows bone deep if he doesn’t scare her off, his single status is seriously under threat. Despite knowing that, he can’t seem to stop thinking about unwrapping the shy unassuming librarian package and discovering the fiery gorgeous woman lurking beneath the surface. Constantly thrown together, it will take all of Erik’s magic to protect Cara from the two evil demi-gods hot on her trail and somehow convince her to stop trying to kill him long enough to prove that even though the woman is a walking disaster… she’s his walking disaster.",
  "genres": [
    "Romance",
    "Humor",
    "Paranormal",
    "Paranormal Romance",
    "Love",
    "Magic"
  ],
  "author": "Jane Cousins",
  "average_rating": "4.10",
  "url": "https://www.goodreads.com/book/show/25747856-to-date-a-disaster"
}