{
  "title": "Confederate Chipmunks & Carny Cooter",
  "description": "Do you crave unoffending fiction? A wholesome snack that's low in friction? If so, inside you'll find the words A greasy feast of tasteless turds But those for crass and bawdy wit Will savor every bite of shit! Welcome to Possum Holler, Mississippi, where critters are served on a stick… and might be related to whatever’s been getting in your trash bin. Home of the chaw chewin, stank walkin, pill swillin, leg missin, finger in a belly, punch you in the damn mouth cuz I done TOLD you bout BREATHIN when i’m WATCHIN THE WRASLIN…Cobblepotts: the most delightful redneck couple you’d never invite over for supper. Meet Patty Cobblepott: a certified Yak of a woman. Fueled on potted meat and Mountain Dew, she’ll roll her breasts up and push a Plymouth clear to the freeway, with the E-brake on, and then make balloon animals out of rebar. Her softness of brain is equally mighty; Patty meets all legal requirements for retardation. Meet Otis Cobblepott: a well-bearded, Southern sociopath, more than willing to step on man, woman, or child—preferably woman or child—to pursue a sudden flight of fancy. He’s slightly smarter than Patty, but slightly dumber than a Guinea Pig. He enjoys critter documentaries, lawn mower racing, sturdy women, and getting one over on Patty. Tag along as the Cobblepotts redefine absurdity and turn simple misunderstandings into barn burning blowouts. Can the world survive such an outrageous pair? Can they even survive each other? Peel back the many, ridiculous layers of this hillbilly onion; you may be disturbed to find that--at the core--the Cobblepotts are a lot like you. Southern rooted, pants poopingly hilarious, more clever than your mom, riddled with the best limericks of your life, obscene at times, violent at others, dark and cynical throughout; it’s really kind of a romantic comedy, if that’s possible. It either curb stomps the entire idea of relationships, or offers observations as a bit of hope; you'll have to decide which. One thing's for sure; it's not for the faint of heart. So put grandma to bed, crate your children, and open wide for a whole mess of unfiltered ignorance.",
  "genres": [],
  "author": "Bill Jacks",
  "average_rating": "4.19",
  "url": "https://www.goodreads.com/book/show/25746607-confederate-chipmunks-carny-cooter"
}