{
  "title": "Young Love Part 1: A School Yard Love Story",
  "description": "Sean is only seventeen, but the serious issues he faces when he falls in love with his new class mate, Katherine, resonate also with older readers.Theirs is a complicated relationship from the start. You will appreciate the realistic depiction of the tortured hero's psychological struggle after the heroine ends the relationship, especially when it becomes clear that both young people remain drawn to each other anyway and struggle to regain their balance during the rest of the school year.A refreshing high school romance set in Europe, Flanders, in the early seventies of the previous century with a total lack of stereotyping, that has it all: it's witty, bittersweet, touching and rich in culture and history. The story depicts all the uncertainties and overpowering emotions that come with true young love in a most original and genuine wayIs this contemporay romance, new adult or young adult? It doesn't matter: it's just great writing! Could not stop reading!! When I first picked up this book I wasn't all that sure I would like it, but I was pleasantly surprised when I read it. I can say with complete honesty that I enjoyed the story very much. I'm so glad I picked it! The story drew me in and I felt all the joy and all the pain. It was intelligent and well developed and the dynamic between the main characters was great. I really enjoyed the characters. The characters are very well written: they have substance, and are unique without ever being overdone. The author didn't go over the top with unrealistic scenes either, though sometimes I became frustrated with Sean and even yelled at him once or twice. He took his time and you felt him struggle with his feelings. I was a little sad at some times and even cried at one point. His heartbreak over losing Katherine was really sad. I was left with a little bit of hmmmm a hang. All in all it was a bitter sweet read and wish this authoronly success with many more to come. Totally recommend the book for someone who's looking for a really good, original romance novel.",
  "genres": [
    "Young Adult Romance"
  ],
  "author": "Dean Amory",
  "average_rating": "4.78",
  "url": "https://www.goodreads.com/book/show/25744019-young-love-part-1"
}