{
  "title": "Get Hired!: 20 Steps to Your First Professional Job — from Building Your Resume to Proving You're the Person to Hire",
  "description": "Searching for a Professional Job?Do you know how to find the majority of job openings, which are not advertised?Are you confident that your resume will convince employers to interview you rather than another applicant?Are you ready for tough interview questions, such as what your greatest weakness is and what salary you want?Or do you feel unsure of yourself and worried that you won't find a job?What This Book Will Do for YouGet Hired! will lead you through the key steps in your job search, including the •Finding hidden job openings•Resume writing that demonstrates the skills employers want most•Writing an impressive cover letter•Being prepared and confident for the interview•Handling the difficulties of a phone interview\"Get Hired! is the college course we all wish we had, the one that reveals the secrets of successful job hunting.\" Sue Lugli, Professor of Marketing and Economics, Middlesex Community College, ConnecticutThe Secrets of SuccessSuccessful job hunters know they need to pay attention to every part of the job search. For example, do you know how •Prove you're the person to hire, no matter what questions the interviewer asks?•Sound like a professional during the job interview?•Match your facial expressions and body language to your words?•Use a thank you letter to help you stand out from other applicants?\"The book helps build your confidence, so that you interview well and present your best image regardless of your career aspirations.\" Barry Dunkin, Career Consultant/Counselor/Coach, Baltimore, MDFeel More ConfidentBecause this book is broken into 20 steps, you can focus on what you need to do today, tomorrow, and the day after. As a result, you can feel confident that you're doing everything you need to do.Each chapter is short and easy to read, yet packed with information and advice. In the book, you'll •Instructions on how to write a resume, cover letter, and job reference list•Sample interview questions with recommended answers•Simple ways to reduce nervousness and feel calmer•Techniques that build confidence•Links to dozens of free online resources for more information",
  "genres": [],
  "author": "Mara Braverman",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/25742203-get-hired"
}