{
  "title": "Coming Out Straight: Understanding and Healing Homosexuality",
  "description": "Richard Cohen, a former homosexual, now married with three children, struggled for most of his life with unwanted same-sex attractions. He tried desperately to find professionals who understood his condition and help him heal. Because \"it was so difficult to explain myself to therapists, who didn't have a clue,\" Cohen eventually became a psychotherapist and developed both a groundbreaking understanding of same-sex attractions and a comprehensive treatment plan for healing homosexuality. \"Coming Out Straight\" not only details Cohen's personal journey out of homosexuality but also recounts his experiences helping thousands of men, women and adolescents heal their gender identity. Recoginizing that the \"gay rights movement\" has done a great service in bringing the issue of homosexuality of the closet and into the light, Cohen points out that in the name of tolerance, society has now succumbed to acceptance. \"If we embrace someone's homosexuality as normal and natural, their potential for wholeness will remain dormant beneath their emotional wounds. It's not bad to have same-sex attractions, as they represent a drive to heal unmet love needs. However, acting upon them leads to frustration and pain.\" In simple language, \"Coming Out Straight\" presents the basic causes of same-sex attractions, a clear model for recovery, and stories of individuals who made the change. The book has three parts: In Part I, the author shares his own story and the root causes of same-sex attractions. Part II presents a four-stage model of recovery and healing. Part III discusses the healing of homophobia by overcoming fear and hatred of homosexuality. While the book is meant to educate therapists, clergy, and other professionals, it also assists those who struggle with their own same-sex attractions as well as their loved ones. \"Coming Out Straight\" sets forth an easy to understand primer on homosexuality, both for family members and friends of homosexuals, as well as for the general public. It will open the door to a new, happier, and fulfilling heterosexual life.",
  "genres": [
    "Psychology",
    "Sexuality",
    "Fiction",
    "Social Issues"
  ],
  "author": "Richard Cohen",
  "average_rating": "1.99",
  "url": "https://www.goodreads.com/book/show/2574850-coming-out-straight"
}