{
  "title": "Uprising",
  "description": "As Jess and Mason continue their battle against the princes of Hell on alternate Earth, they must first deal with the aftermath of their failures. After neglecting to prevent the fourth seal from being opened, a new threat is unleashed on the world that only Jess and the other vessels can neutralize. Each of them was brought to this alternate reality for a purpose, and only through facing adversity can they truly find their strengths. After discovering Ravan’s real identity, Jess begins to wonder what role she is destined to play in Lucian’s diabolical plans. Why has he allowed Ravan to live so long on this Earth? What is her true purpose for being? Jess soon realizes that the answers to those questions, and so many more, might lie with Lucifer. However, finding where Lucian is keeping his favorite pet prize won’t be an easy task and rescuing him might prove to be impossible. Meanwhile, the resistance continues to search for clues to uncover the objective of Project T-7. It’s obvious that the princes are searching for something, but what is it? How will its discovery help them intensify the doomsday scenario they’ve already set into motion? Jess and the others know that whatever the princes are trying to locate needs to be found by them first. Will they be able to find out what Project T-7 is all about in time to save alternate Earth? The odds are definitely not in their favor, but with the knowledge that God is on their side, all hope is not lost. Jess knows that she and her friends will have to tackle new challenges at every turn, but she also knows that together they’re strong enough to handle whatever might come their way. Reading Order of Watcher Books by The Watchers Trilogy (Young Adult) The Watcher Chronicles (New Adult) Caylin’s Story (Young Adult) Aiden’s Story (New Adult) The Alternate Earth Series (New Adult) The Redemption Series (New Adult) The Dominion Saga (New Adult)",
  "genres": [
    "Fantasy",
    "Angels",
    "Paranormal",
    "New Adult",
    "Romance",
    "Paranormal Romance"
  ],
  "author": "S.J. West",
  "average_rating": "4.50",
  "url": "https://www.goodreads.com/book/show/25750149-uprising"
}