{
  "title": "Broken",
  "description": "Thomas ‘Glock’ Davies has spent fourteen years being friends with a girl that is way out of his league, off limits to a guy like him. He’s spent two of the last three years lusting after girl that’s not even a legal adult yet. And he’s spent the last year of his life in limbo, waiting, watching, and craving the one woman that owns the other half of his soul.  Devil’s Spawn MC on the precipice of a major deal with Satan’s Sons. A deal that will change everything for both MC’s. Now is not be the time to explore the relationship Glock has desired for longer than he can remember, but no one has ever accused him of being a smart man.  With Glock all set to make his announcement, he gets a blast from the past that leaves him rethinking his intentions with Lexi, and considering doing what he does best…running. After years of battling the noise in his head, it comes down to a test of strengths to see whether Glock can go the distance and make Lexi his, or if he makes the ultimate sacrifice and lets her go.  Alexis Rose Marks is fed up living the way the men in her life have decided she should. For five years she has wanted to do nothing more than write books, but with expectations mounting, and an expiration date on the ultimatum her father Cage laid down looming, Lexi has decisions to make. Lexi’s younger brothers may have been the MC’s hell raisers, but when Devil’s Spawn’s reigning princess drops a bomb, shaking the foundation of the MC it leaves everyone reeling, including Glock, throwing the club into a state of flux without her as their anchor.  What happens when naïve meets experienced in a battle of wills that’s taking no prisoners in its game of love? Can a father let go of his own selfish demands long enough to see his daughter happy? Will Devil’s Spawn be able to embrace their brother when they find out who he intends to claim as his own, and what he’s kept hidden from them?",
  "genres": [
    "Friends To Lovers",
    "Contemporary",
    "Erotic Romance",
    "Romance"
  ],
  "author": "Natasha Thomas",
  "average_rating": "3.97",
  "url": "https://www.goodreads.com/book/show/25756124-broken"
}