{
  "title": "660 Curries",
  "description": "Curry is Salmon with Garlic and Turmeric. Curry is Grilled Chicken with Cashew-Tomato Sauce. Curry is Asparagus with Tomato and Crumbled Paneer. Curry is Lamb with Yellow Split Peas, Chunky Potatoes with Spinach, Tamarind Shrimp with Coconut Milk, Baby Back Ribs with a Sweet-Sour Glaze and Vinegar Sauce, Basmati Rice with Fragrant Curry Leaves. Curry is vivid flavors, seasonal ingredients, a kaleidoscope of spices and unexpected combinations. And 660 Curries is the gateway to the world of Indian cooking, demystifying one of the world's great cuisines.Presented by the IACP award–winning Cooking Teacher of the Year (2004), Raghavan Iyer, 660 Curries is a joyous food-lover's extravaganza. Mr. Iyer first grounds us in the building blocks of Indian flavors—the interplay of sour (like tomatoes or yogurt), salty, sweet, pungent (peppercorns, chiles), bitter, and the quality of unami (seeds, coconuts, and the like). Then, from this basic palette, he unveils an infinite art. There are appetizers—Spinach Fritters, Lentil Dumplings in a Buttermilk Coconut Sauce—and main courses—Chicken with Lemongrass and Kaffir-Lime Leaves, Lamb Loin Chops with an Apricot Sauce. Cheese dishes—Pan-Fried Cheese with Cauliflower and Cilantro; bean dishes—Lentil Stew with Cumin and Cayenne. And hundreds of vegetable dishes—Sweet Corn with Cumin and Chiles, Chunky Potatoes with Golden Raisins, Baby Eggplant Stuffed with Cashew Nuts and Spices. There are traditional, regional curries from around the subcontinent and contemporary curries. Plus all the biryanis, breads, rice dishes, raitas, spice pastes and blends, and rubs.curry, n.—any dish that consists of either meat, fish, poultry, legumes, vegetables, or fruits, simmered in or covered with a sauce, gravy, or other liquid that is redolent with any number of freshly ground and very fragrant spices and/or herbs.",
  "genres": [
    "Cookbooks",
    "Cooking",
    "Food",
    "Nonfiction",
    "Reference",
    "India",
    "Culinary"
  ],
  "author": "Raghavan Iyer",
  "average_rating": "4.17",
  "url": "https://www.goodreads.com/book/show/2575111-660-curries"
}