{
  "title": "100 days of solitude",
  "description": "\"If you have ever stopped yourself doing something you love because 'now just isn't the right time', read this book.\"A personal journey that inadvertently became an alternative self-help guide to doing what you love and living as your true self – whoever that might turn out to be.100 days of solitude is inspiring hundreds of people to seek out and claim the space they need to find themselves and live the life they want.\"A book for everyone.\"How far do you need to go to find yourself? What do you have to give up?Daphne didn't go very far. After too many years of living as a writer who didn't write, she gave up her life in London to spend 100 days of solitude on the remote Greek island of Sifnos, off season, and find out, once and for all, who she really was. Her challenge: to write every day.One hundred days and one hundred entries later, her question had been answered in more ways than she could have imagined, and the things she'd given up never mattered in the first place. This book is her story, as personal as it is universal, of the most obvious and most fundamental quest of all: to be happy; to do what you love.Part memoir, part fiction, part philosophy and part travel writing, 100 days of solitude is a collection of one hundred stories, all of them connected and each one self-contained. One hundred essays on choosing uncertainty over security, change over convenience, seeing things for what they truly are, and being surprised by yourself; on love, loss, death and donkeys; on reaching for your dreams, finding enlightenment on a rural road, peeing in public, and locking yourself out of the house; on dangerous herbs, friendly farmers, flying Bentleys and existential cats; and on what it feels like to live in a small, isolated island community through the autumn and winter, to live as a writer who actually writes, and to live as your true, authentic self, no matter who that turns out to be. And to write your own story, the way you want it told; to find your voice, and the courage to let it be heard.",
  "genres": [
    "Nonfiction",
    "Memoir",
    "Philosophy",
    "Contemporary",
    "Biography",
    "Literature",
    "Self Help"
  ],
  "author": "Daphne Kapsali",
  "average_rating": "3.78",
  "url": "https://www.goodreads.com/book/show/25748341-100-days-of-solitude"
}