{
  "title": "The Western Lands",
  "description": "The Western Lands is the eagerly awaited new novel by the most visionary American novelist of the twentieth century—a haunting Book of the Dead for the nuclear age. Every new work from the pen of William S. Burroughs is an important literary event. This is especially so in the case of The Western Lands. For in this novel, Burroughs completes a trilogy that began with Cities of the Red Night and The Place of Dead Roads, with a profound, revealing, and often astounding meditation on the themes of mortality, loneliness, nuclear peril—and the inextinguishable hope for an existence beyond bodily death. The symbolic vehicle Burroughs uses here is ancient Egyptian mythology, a long-standing interest of his. \"The Western Lands\" of the title are the territory to which the Egyptians believed the souls of the dead made a hazardous pilgrimage in their quest for true immortality. The questers—Joe the Dead, Kim Carsons, the scribe Neferti, Hassan i Sabbah, the Old Man of the Mountain—travel through an unmistakably Burroughs-esque universe of appalling danger and otherworldly beauty—now the back alleys of ancient Egypt, now bombed-out Berlin, now the Old West of the shootists. Their hallucinatory journeys express the author's belief that only through facing the most extreme dangers and testing the possibilities of biological mutation can man escape a dead-end world of blasted dreams and atomic finale. And presiding over all is the haunting figure of \"the old writer,\" who shares in the fate of his characters in being finally unable to write himself out of Time, and into Space. The Western Lands continues and extends one of the great literary odysseys of our time, adding to Burroughs's awesome literary style and black humor chilling touches of elegy and autobiography. It is at once Burroughs's most personal and most universal work, yet another masterwork from the reigning genius of the American literary avant-garde.",
  "genres": [
    "Fiction",
    "Literature",
    "Novels",
    "Fantasy",
    "Science Fiction",
    "20th Century",
    "American"
  ],
  "author": "William S. Burroughs",
  "average_rating": "4.05",
  "url": "https://www.goodreads.com/book/show/257506.The_Western_Lands"
}