{
  "title": "Mahlon Blaine's Blooming Bally Bloody Book",
  "description": "This historical novel takes a rollicking ride through one-eyed Mahlon Blaine's adventures and experiences as an early 20th-Century illustrator. Exploring his friendships with the famous and infamous in bohemian San Francisco, pre-talkies Hollywood and other-worldly New York City, this (self)portrait paints the struggles and triumphs of an artist truly committed to his unique singular vision. Included are over 120 Blaine illustrations and photographs (most previously unpublished, unearthed from the vaults of collectors and friends). Ribald, risqué, bawdy, naughty, salacious – take your pick. Despite labels like these, Mahlon Blaine, 1920s book illustrator and pen-and-ink maestro, campaigned for “freedom of art” against “dysenteric hypocrites” who proclaimed “beauty is obscene.” He mixed his commercial success with an underground vocation of creating “playful drawings – sly dancing thoughts that would delight all men blest with the godly gift of laughter.” This bohemian Rabelaisian, with 2000 published illustrations ranging from children’s books to erotica, fought “for the beautiful and imaginative – conceptions beyond all limits of time and morality.” John Steinbeck was one of his best friends, and Blaine illustrated two of his early novels. The actor John Carradine knew Blaine during his Hollywood career, as did Tina Modotti. Infamous booksellers and art dealers like Jake Zeitlin, Jack Brussel, and Bernard Guerney promoted his work. He painted world-famous ballerina Lydia Lopovka, and God knows who else. Did he win a Caldecott Award? A Newbury? Maybe not, but there were rumors. Did he know Woody Guthrie, and was Bob Dylan an acquaintance? Perhaps. Was his \"Venus Sardonica\" folio the high point of 20th Century published erotica? It's been claimed so, by scholar G. Legman. Until now, no one knew what to believe. Maybe they still don't. This is his unauthorized autobiography.",
  "genres": [],
  "author": "Roland Trenary",
  "average_rating": "4.91",
  "url": "https://www.goodreads.com/book/show/25751289-mahlon-blaine-s-blooming-bally-bloody-book"
}