{
  "title": "Driving Grandpa",
  "description": "What do you get when you combine a hard-nosed WWII vet, a crazy stray dog, a pickup truck, and a string of foreclosed houses? The answer is a hilarious adventure (with a hard-hitting ending) that you don’t want to miss.“This dog’s so old he’s got dentures.”“Grandpa, quit pulling on that dog’s teeth. He’s gonna bite you!”“Boy, never mind that. Did I tell you about the time we almost surrendered to them parrots during World War II?”“Y’all fought pirates during the war?”“No knucklehead—parrots. Them talking birds.”“Grandpa, you’re telling me that y’all surrendered to some birds, and you’re calling me a knucklehead?”“I didn’t say we surrendered to them. I said we almost surrendered to them. Besides, they spoke Japanese.”John (aka “Boy”) is a 40-year-old contract worker hired to clean up abandoned properties. He has happily adopted double duty as ‘chauffeur’ for Grandpa, who (despite his ornery protestations) is not allowed to drive anymore. These two simple tasks collide in a perfect storm of one humorous calamity after another.“Grandpa, why do the cops have you in handcuffs?”“Some fellow kicked in my door.”“So... why are you in handcuffs?”“I ain’t never played home invasion before. I didn’t know the rules.”Woven between the daily adventures of cleaning up supposedly vacant foreclosures, attempting to renew Grandpa’s license, and pursuing a decades gone by female counterpart, are Grandpa’s amusing and often absurd (yet containing a root of truth) stories from the World War II era. An airplane mechanic stationed in Australia and the Pacific during the war, Grandpa fills their commutes with tales of stranded submarines, earthquake bombs, a tombstone repossession, and a gang of ten-year-old boys holding up a train.Behind the story’s humor breathes a warm and touching ode to family, patriotism, and the Greatest Generation. Not so much of an elegy as an attempt to see the world through Grandpa’s peculiar and remarkable eyes, Driving Grandpa offers an amusing and endearing slice of life that is sure to bring a smile.",
  "genres": [],
  "author": "John Redstand",
  "average_rating": "4.58",
  "url": "https://www.goodreads.com/book/show/25762570-driving-grandpa"
}