{
  "title": "Black & White",
  "description": "From the author of Family History (“Poised, absorbing . . . a bona fide page turner”— The New York Times Book Review ) and the best-selling memoir Slow Motion, a spellbinding novel about art, fame, ambition, and family that explores a provocative question: Is it possible for a mother to be true to herself and true to her children at the same time?Clara Brodeur has spent her entire adult life pulling herself away from her famous mother, the renowned and controversial photographer Ruth Dunne, whose towering reputation rests on the unsettling nude portraits she took of her young daughter from the ages of three to fourteen. The Clara Series, which graced the walls of museums around the world as well as the pages of New York City tabloids that labeled the work pornographic, cast a long and inescapable shadow over its subject. At eighteen, when Clara might have entered university and begun to shape an identity beyond her sensationalized, unsought role in the New York art world, she fled to the quiet obscurity of small-town Maine, where she married and had a child, a daughter whom she has tried to shield from the central facts of her early life and her damaging role as her mother’s muse.Fourteen years later, Ruth Dunne is dying, and Clara is summoned to her bedside. Despite her anguish and ambivalence about confronting a family life she has repressed and denied for more than a decade, Clara returns. She finds Ruth surrounded, even in her illness, by worshipful interns, protective assistants, and her conniving art dealer.Once again, she is Clara Dunne, the object of curiosity, the girl in the photos. Except this time she has her own daughter to think about—a girl who at nine looks strikingly like the girl in Ruth’s photos—and she yearns to protect her, to insulate her from the exposure that will inevitably result when her two worlds, New York and Maine, collide.As Clara charts a path connecting her childhood with her adult life, Shapiro’s novel weaves together past and present in images as stark and intense as the photographs that tore the Dunnes apart. A brilliant examination of motherhood—a novel that pits artistic inspiration against maternal obligation and asks whether the two can ever be fully reconciled— Black & White explores the limits and duties of family loyalties, and even of love. Gripping, haunting, psychologically complex, this is Shapiro at her captivating best.",
  "genres": [
    "Fiction",
    "Audiobook",
    "Contemporary",
    "Literary Fiction",
    "American",
    "Novels",
    "Book Club"
  ],
  "author": "Dani Shapiro",
  "average_rating": "3.68",
  "url": "https://www.goodreads.com/book/show/25761.Black_White"
}