{
  "title": "Gold Shimmer",
  "description": "Want more of your favorite characters from the The New York Times & USA Today bestselling IN THE SHADOWS series? GOLD SHIMMER is Cass and Calder's story. You don't have to read books 1-3 to enjoy GOLD SHIMMER.I never thought that my plan to crash a masked party to exact a bit of revenge would fall apart so easily. It was a foolproof plan. The absolute best scenario. Moon-and-stars-aligned worthy. No one would suspect I was anyone other than the wealthy, self-absorbed girl I pretended to be. The one who would wreak havoc that night. Then again, I also didn’t plan on running into a wall of sharp wit and steely determination named Calder. The captivating Navy SEAL might’ve called me by Celeste’s name, but he refused to let me hide my true self from him. His special brand of honest, seductive charm was impossible to resist. He was confident and demanding…and everything I wanted. But the deeper I fell, the higher the stakes rose while playing a role. So I held onto our intense connection for as long as I could, knowing that he would never know me as Cass.When an unexpected turn of events gives me a second chance to see Calder again, of course the opportunity comes with strings attached. I had no idea how dangerously tangled and deeply knotted those strings would become, but for the one man who gave me the courage to live my life for me again, I’d do just about anything.Even become someone else.\nNote: GOLD SHIMMER is meant for readers 18+ due to mature content. This is the first book in the BLACK SHADOWS duet, Cass and Calder's story. The duet falls within the main IN THE SHADOWS series. You can read the duet as a stand alone or as part of the IN THE SHADOWS series.",
  "genres": [
    "Romance",
    "Contemporary Romance",
    "Contemporary",
    "Erotica",
    "Suspense",
    "Erotic Romance",
    "Military Fiction"
  ],
  "author": "P.T. Michelle",
  "average_rating": "4.35",
  "url": "https://www.goodreads.com/book/show/25762686-gold-shimmer"
}