{
  "title": "Razor King",
  "description": "You’re being watched… Your every word… Your every move… … The air that you can breathe smells rancid and leaves a copper taste in the back of your throat. A much-depleted ozone blisters your skin and forces you to work by night and sleep by day. Welcome to your future – to the year 2080 – to a world turned upside down. After a mini-nuclear war wreaks havoc on the planet, the newly-formed “World Council 7” makes a fateful decision – to bring two super-powerful Atomic Quantum Computers online to scrutinize, monitor and record virtually every step mankind takes. Soon thereafter, with the help of nanotechnology and billions of hidden, miniaturized cameras, the QCs wrest control of the planet from the WC7. Using their own autocratic, demented, AI-enhanced minds, they implement their own oppressive rules. Nighttime is what you fear most, though. That’s when RAZOR KING (a ruthless “slice’n’dice” enforcer) and his underground loyalists come out to orchestrate bloody “organ harvests”. Reselling the organs back on the black market at exorbitant prices helps finance their life and death struggle to take back control of the planet from the omniscious QCs. But there is hope… and he goes by the name of CAPTAIN MATAGON. The QCs authorize the highly-decorated CAPTAIN MATAGON to lead a specially-trained and brutal anti-terrorist unit (BATTLE BORN) to bring in Razor King, his band of underground butchers and the mysterious, genius underground leader himself -- DR. OZSO RUKUR -- either dead or alive. But Ozso has a secret agenda all his own and will stop at nothing to succeed – to be the first person to actually marry human DNA into digital DNA and merge himself physically into the QCs achieving ‘God-like’ singularity and take control of every soul on the planet. Haunting and fast-paced, “RAZOR KING” is a futuristic thriller that describes one man’s epic journey as he goes up against the evils of modern technology and describes in harrowing fashion how the best-laid plans of mice and men can sometimes go very, very awry.",
  "genres": [],
  "author": "T.W.  Moore",
  "average_rating": "4.33",
  "url": "https://www.goodreads.com/book/show/25762548-razor-king"
}