{
  "title": "Rumer Godden: A Storyteller's Life",
  "description": "Once upon a time by a river in India there lived a little English girl called Ma Rumer Godden. The life of Rumer Godden, one of our best-loved contemporary authors, has been as eventful and dramatic as the plot of any of her novels. Born in India to English parents at the height of British colonial power, she always knew she wanted to be a writer. Her literary career has spanned six decades. In 1939, Black Narcissus became an overnight bestseller in England and America and it has remained in print ever since. The film she scripted for Jean Renoir in 1949 from her own novel, The River, has become one of the classics of the cinema. Anne Chisholm's biography places Rumer Godden's work in the context of her remarkable life. At the heart of Godden's writing is her idyllic childhood in Bengal. In her twenties, she established her own dancing school in Calcutta and was disapproved of as a working woman and as a teacher of Eurasian girls. Although she married in 1934 and had two daughters, she was a fiercely determined writer who struggled to reconcile her need to write with the demands of her family. As her marriage failed, she retreated from the decadence of fading colonial Calcutta to the tea plantations of Assam and then the mountains of Kashmir. But Godden's relationship with India, though passionate, was ultimately ambivalent. In Kashmir a servant tried to poison her and her children (an extraordinary incident which brought this ambivalence to a head). The notoriety surrounding the case forced Godden to leave Kashmir, soon afterwards she left India for good. This mysterious episode is explored here in detail. On returning to England, she built a new life marrying again and continuing to write. Her conversion to Catholicism led her to write one of her best-known books, In This House of Brede. Several of her novels and children's books were filmed or adapted for television, including The Greengage Summer, Vie Diddakoi and The Peacock Spring Through conversations with Rumer Godden herself and from her exclusive access to private letters, Anne Chisholm has written the definitive story of an emotionally powerful writer and a woman of unusual strength of character.",
  "genres": [
    "Biography",
    "Nonfiction",
    "History",
    "India",
    "British Literature"
  ],
  "author": "Anne Chisholm",
  "average_rating": "3.96",
  "url": "https://www.goodreads.com/book/show/1161315.Rumer_Godden"
}