{
  "title": "The Rules of Inheritance",
  "description": "Claire Bidwell Smith -- an only child -- was just fourteen years old when both of her parents were diagnosed with cancer within months of each other. \"I've already come to the conclusion that I will probably be parentless by the time I am thirty,\" Claire writes in her powerful debut.As her mother begins to succumb during Claire's first year of college, Claire hurtles towards loss. She throws herself into the arms of anything she thinks might hold her up: boys, alcohol, traveling, and the anonymity of cities like New York and Los Angeles. Her every choice carries the weight of a young woman's world, and it feels like a solitary place. Words -- books, diaries, letters, family stories -- become Claire's true companions, and provide a glimpse of the future, however foreign.In New York, she studies writing and learns the ways of the world, falling in and out of love with a troubled young man, all the while grappling not only with her own lonelieness and regret but that of her aging father. She joins him in Los Angeles as a novice journalist, and records one last thrilling entry in their nuclear family history in the fields of Eastern Europe in search of his World War II past. When it is time to say good-bye, once more the fragility of life astonishes.Defying a conventional framework, this memoir is told in nonlinear fashion, using the five stages of grief as a window into Claire's experience, at once heartbreaking and uplifting. \"Why would anyone want to walk into pain?\" Claire asks. \"But when I did, I found that it didn't hurt as much as I thought it would.\"Each step brings her closer to finding the meaning of the rules of inheritance, and how they will shape her future -- as a woman, as a wife, as a mother. As in the very best personal writing, Claire's superbly resonant words render the personal universal.",
  "genres": [
    "Memoir",
    "Nonfiction",
    "Grief",
    "Biography Memoir",
    "Biography",
    "Death",
    "Book Club"
  ],
  "author": "Claire Bidwell Smith",
  "average_rating": "4.13",
  "url": "https://www.goodreads.com/book/show/11613559-the-rules-of-inheritance"
}