{
  "title": "No Easy Mission",
  "description": "Maddox is weary and vengeful.  He has resigned himself to retirement and no longer wants to fight in a war that has cost the lives of so many friends. He certainly isn’t happy when his former colleague, US Major George Lyle, pays him a visit at his home.  But Lyle has a deal to offer. If Maddox joins him for two more missions, Lyle will leak five important names: the men who ordered Maddox’s previous team to their deaths.  Despite his doubts, Maddox agrees.  But the mission is one of his hardest yet.  It is January 1945 and the chances of Germany winning the war are fading. A breakaway group of Nazi extremists have uncovered a 13th Century plague pit in Poland and built a biological-weapons facility on the site.  Their plan is simple but deadly: release Pneumonic Plague – an airborne variant of the Black Death – through the Port of London.  With a mortality rate of more than 99%, the Nazis estimate at least 12 million will die. To prevent the disease spreading, Britain will be forced to close her ports. Supplies to the Western Front will dry up.  Germany will crush the Allies in France.  Rather than destroy the monastery with an aerial bombardment and risk unleashing the plague, the Allies need men on the ground to infiltrate the compound and destroy it.  Maddox and Lyle put together a small, specialist unit to go behind enemy lines.  But the Germans have captured a member of the Polish Resistance who has knowledge of the attack.  The Nazis know Maddox is on his way…  ‘No Easy Mission’ is the third in a series of full-throttle World War Two thrillers featuring Maddox that combine meticulous research with gripping story-telling to create memorable tales of action and adventure.  It is perfect for fans of Jack Higgins and Alistair MacLean.  'An explosive action thriller that throws new light on WWII'.' - Tom Kasey, best-selling author of 'The Dante Conspiracy'.  Jack Hayes is an author and journalist living in London.  Endeavour Press is the UK's leading independent publisher of digital books.",
  "genres": [],
  "author": "Jack  Hayes",
  "average_rating": "4.20",
  "url": "https://www.goodreads.com/book/show/25770322-no-easy-mission"
}