{
  "title": "Gosnell: The Untold Story of America's Most Prolific Serial Killer",
  "description": "He is America’s most prolific serial killer. And yet Kermit Gosnell was no obvious criminal. The abortion doctor was a pillar of his community, an advocate for women’s “reproductive health,” and a respected member of Philadelphia’s professional elite. His Women’s Medical Society Clinic looked like admirable community outreach by a brave doctor committed to upholding women’s rights. Meanwhile, inside the filthy building, Gosnell was casually murdering born-alive infants, butchering women, and making a macabre collection of severed babies’ feet. His accomplices in crime were a staff of dropouts, drug addicts, and unlicensed medical professionals posing as doctors. But even more important to his decades-long crime spree were his enablers in the outside world—from the state bureaucrats who had copious evidence that Gosnell was breaking the law but did nothing to the politicians whose fervent support for abortion rights kept health inspectors away. The “pro-choice” political, bureaucratic, and media establishment smiled on Gosnell—and gave him carte blanche to kill. Even law enforcement seemed to not care. Philadelphia Police Homicide Unit received a complaint about Gosnell years before he was caught, gave it a cursory look, and ignored the evidence. Two women and hundreds of babies died after they closed the case. Luckily, Detective Jim Wood—a narcotics detective—opened a drug case against Gosnell. What he found when he served his warrant left even the most grizzled members of the police force stunned. Now Ann McElhinney and Phelim McAleer, the veteran investigative journalists and filmmakers behind FrackNation, dig into Gosnell’s crimes. A record-breaking crowdfunding campaign financed their Gosnell movie starring young Superman Dean Cain, but in the research for the film, McElhinney and McAleer uncovered fascinating and previously unreported revelations that couldn’t be included in the film. Gosnell: The Untold Story of America’s Most Prolific Serial Killer contains the full results of their investigation.",
  "genres": [
    "True Crime",
    "Nonfiction",
    "Crime",
    "History",
    "Biography",
    "Politics",
    "Audiobook"
  ],
  "author": "Ann McElhinney",
  "average_rating": "4.15",
  "url": "https://www.goodreads.com/book/show/25777967-gosnell"
}