{
  "title": "Above All Else",
  "description": "Avo is a dragon like no other. He’s reclusive, he’s tiny, and he can’t breathe fire.He also has a knack for getting himself into trouble!While wandering through his woodland habitat, Avo happens across a stranger in need. The chance encounter pits him against an ancient enemy, which forces him to flee the forest. During his travels, the little dragon must learn to cooperate with unlikely allies in alien lands. He must safely navigate through a world that is full of betrayal, blood-magic and malice. And finally Avo must accept the part he has to play, as foretold in the prophecies of old.Can his body, heart, and soul survive the journey intact? Will he find sanctuary in an unknown land?Will he become a savoir or a destroyer?A ‘LOVE’S AN OPEN ROAD’ STORY.Written for the 2015 ‘Don’t Read in the Closet’ event that is hosted by the M/M Romance Group.Dear Author,I’m a dragon shifter, and I’m the smallest of my kind. I’m small enough to sit on the shoulders of an average sized man. I might be adorable in both my forms because of my size and looks, but I have a deadly secret ability that other dragons don’t have (at least to the same extent I do). Tell me Author who/what is my mate/s and how do we meet.Photo Description: Ribbons of autumnal sunlight penetrate the canopy of leafless trees. The silvery beams reflect off the rippling river, which winds itself amongst the roots of the ancient forest. Next to the gushing water, a blue dragon rests its claw on a gaping fish. The sapphire-scaled creature stares inquisitively into the woods, listening to the cries of an approaching stranger…This story was written as a part of the M/M Romance Group's \"Love is an Open Road\" event. Group members were asked to write a story prompt inspired by a photo of their choice. Authors of the group selected a photo and prompt that spoke to them and wrote a short story. This story may contain sexually explicit content and is intended for adult readers. It may contain content that is disagreeable or distressing to some readers. The M/M Romance Group strongly recommends that each reader review the General Information section before each story for story tags as well as for content warnings.",
  "genres": [
    "Fantasy",
    "Dragons",
    "M M Romance",
    "Shapeshifters",
    "Magic",
    "Paranormal",
    "Romance"
  ],
  "author": "Dayton Idoni",
  "average_rating": "3.88",
  "url": "https://www.goodreads.com/book/show/25778422-above-all-else"
}