{
  "title": "The Core of the Sun",
  "description": "From the author of the Finlandia Award-winning novel Troll: A Love Story, The Core of the Sun further cements Johanna Sinisalo’s reputation as a master of literary speculative fiction and of her country’s unique take on it, dubbed “Finnish weird.” Set in an alternative historical present, in a “eusistocracy”—an extreme welfare state—that holds public health and social stability above all else, it follows a young woman whose growing addiction to illegal chili peppers leads her on an adventure into a world where love, sex, and free will are all controlled by the state.The Eusistocratic Republic of Finland has bred a new human sub-species of receptive, submissive women, called eloi, for sex and procreation, while intelligent, independent women are relegated to menial labor and sterilized so that they do not carry on their \"defective\" line. Vanna, raised as an eloi but secretly intelligent, needs money to help her doll-like sister, who has disappeared. Vanna forms a friendship with a man named Jare, and they become involved in buying and selling a stimulant known to the Health Authority to be extremely dangerous: chili peppers. Then Jare comes across a strange religious cult in possession of the Core of the Sun, a chili so hot that it is rumored to cause hallucinations. Does this chili have effects that justify its prohibition? How did Finland turn into the North Korea of Europe? And will Vanna succeed in her quest to find her sister, or will her growing need to satisfy her chili addiction destroy her?Johanna Sinisalo’s tautly told story of fight and flight is also a feisty, between-the-lines social polemic—a witty, inventive, and fiendishly engaging read.",
  "genres": [
    "Dystopia",
    "Science Fiction",
    "Fiction",
    "Speculative Fiction",
    "Feminism",
    "Finnish Literature",
    "Fantasy"
  ],
  "author": "Johanna Sinisalo",
  "average_rating": "3.85",
  "url": "https://www.goodreads.com/book/show/25779654-the-core-of-the-sun"
}