{
  "title": "A Dragon's Guide to Making Your Human Smarter",
  "description": "For fans of How to Train Your Dragon comes a new tale about dragon Miss Drake and her human pet Winnie, by a two-time Newbery Honor winner, featuring illustrations by Caldecott Honor winner Mary GrandPré.  Three-thousand-year-old Miss Drake has arranged to send her dear pet Winnie to The Spriggs Academy, an extraordinary school for humans and magicals alike. Winnie is particularly excited about magic class and having Sir Isaac Newton for science. She’s also making new friends—and frenemies. . . . When a plot to snatch Winnie from her San Francisco home is uncovered, Miss Drake is ready to use all her cunning and magic to thwart it. Not that feisty Winnie needs the help. . . . As a team, the intrepid duo you first met in A Dragon’s Guide to the Care and Feeding of Humans is unstoppable! With equal doses of whimsy and humor, Laurence Yep and Joanne Ryder have crafted an enchanting story about true friendship. Praise for A Dragon’s Guide to Making Your Human Smarter•  \"Yep and Ryder keep the magic coming with their whimsical fantasy, enhanced by Grandpré's sweet drawings. The story positively vibrates with fun.\" —Kirkus Reviews•  \" Lighthearted episodes of unusual school lessons and field trips, illustrated by GrandPré’s winsome spot art, are grounded by Miss Drake’s more serious encounters with the goons...a gratifying development as this buoyant, fantastical series continues.\"—The Horn Book Review Praise for A Dragon’s Guide to the Care and Feeding of Humans•  *“Warm humor, magical mishaps, and the main characters’ budding mutual respect and affection combine to give this opener for a planned series a special shine that will draw readers and leave them impatient for sequels.” —Booklist, Starred•  “The tale is alternately comical, suspenseful and sometimes sweetly emotional.” —Kirkus Reviews•  “Miss Drake’s arch narration and the sharp back-and-forth between the characters create an enchanting story, accented by GrandPré’s whimsical black-and-white spot illustrations.” —Publishers Weekly•  “With a black-and-white spot illustration opening most chapters, an engaging narrator, and a consistently fluid writing style, this title makes a fine dragon choice for readers.” —School Library Journal",
  "genres": [
    "Fantasy",
    "Dragons",
    "Middle Grade",
    "Childrens",
    "Audiobook",
    "Adventure",
    "Magic"
  ],
  "author": "Laurence Yep",
  "average_rating": "4.11",
  "url": "https://www.goodreads.com/book/show/25775880-a-dragon-s-guide-to-making-your-human-smarter"
}