{
  "title": "United: Thoughts on Finding Common Ground and Advancing the Common Good",
  "description": "NEW YORK TIMES BESTSELLER • A passionate new voice in American politics, United States Senator Cory Booker makes the case that the virtues of empathy, responsibility, and action must guide our nation toward a brighter future.   Raised in northern New Jersey, Cory Booker went to Stanford University on a football scholarship, accepted a Rhodes Scholarship to Oxford University, then studied at Yale Law School. Graduating from Yale, his options were limitless.   He chose public service.   He chose to move to a rough neighborhood in Newark, New Jersey, where he worked as a tenants’ rights lawyer before winning a seat on the City Council. In 2006, he was elected mayor, and for more than seven years he was the public face of an American city that had gone decades with too little positive national attention and investment. In 2013, Booker became the first African American elected to represent New Jersey in the U.S. Senate.   In United, Cory Booker draws on personal experience to issue a stirring call to reorient our nation and our politics around the principles of compassion and solidarity. He speaks of rising above despair to engage with hope, pursuing our shared mission, and embracing our common destiny.   Here is his account of his own political education, the moments—some entertaining, some heartbreaking, all of them enlightening—that have shaped his civic vision. Here are the lessons Booker learned from the remarkable people who inspired him to serve, men and women whose example fueled his desire to create opportunities for others. Here also are his observations on the issues he cares about most deeply, from race and crime and the crisis of mass incarceration to economic and environmental justice.   “Hope is the active conviction that despair will never have the last word,” Booker writes in this galvanizing book. In a world where we too easily lose touch with our neighbors, he argues, we must remember that we all rise or fall together—and that we must move beyond mere tolerance for one another toward a deeper connection: love.Praise for United\n \n “An exceedingly good book, and an important book, and a reminder of what makes Booker an important and, through it all, a promising public figure.”—PolitickerNJ   “What sets Senator Booker’s work apart from that of similar political books is that it seeks to elevate discourse rather than bring down opponents of the opposite partisan persuasion. This is a refreshing take, one that is truly worthy of study and contemplation.”—The Huffington PostFrom the Hardcover edition.",
  "genres": [
    "Politics",
    "Nonfiction",
    "Memoir",
    "Biography",
    "Audiobook",
    "Biography Memoir",
    "History"
  ],
  "author": "Cory Booker",
  "average_rating": "4.06",
  "url": "https://www.goodreads.com/book/show/25775926-united"
}