{
  "title": "A Doctor in the House: My Life with Ben Carson",
  "description": "“The life of a neurosurgeon isn’t an easy one, and Ben has been required to go above and beyond the call of duty almost constantly. The life of a neu­rosurgeon’s wife isn’t much easier. But it’s all been worth it. Together, we’ve been through poverty, tragedy, wealth, and joy, and we’ve had each other’s backs. I love that guy!” —CANDY CARSON Like most Americans, you might think of Ben Carson as a trailblazing brain surgeon and, in the last few years, as an outspoken commentator on national is­sues. But his wife of more than forty years knows him as so much a loving husband, a devoted father, a devout Christian, a committed philanthropist, and a fierce patriot. Now Candy Carson introduces us to the private side of a very public figure as she shares the inspiring story of their marriage and their family. Like her husband, Candy grew up in Detroit, one of five children of a teacher and a factory worker. Also like Ben, she overcame her humble background through determination, hard work, and perseverance, earning a scholarship to attend Yale University. In that strange new world she focused on her studies, her music, and her deepening spiritual life. She attended church with a handsome older student who liked to tease her, but never assumed he would be anything more than a friend to her. But Ben and Candy quickly became inseparable, and they married soon after she graduated, with Ben still in medical school, preparing for his career as a soon-to-be world-famous pediatric neurosurgeon. In A Doctor in the House , Candy reveals many sto­ries that have never been told before, despite the media spotlight on Dr. Carson in recent years. She shows us what it was like when they moved to Baltimore to join the community centered around Johns Hopkins Hos­pital. She describes how their family evolved with the births of their three sons and the tragic miscarriage of their twins. She talks about the challenges of Ben’s twelve- to twenty-hour workdays, saving thousands of lives every year while Candy ran the household. She also addresses the prejudice they sometimes faced as African Americans, and how Ben’s calm, levelheaded approach made him a great problem solver at home and in their travels, just as he was in the operating room. Above all, she reveals her husband’s consistency as a in God, in family, and in America. Having lived the American Dream, Ben believes every child from every background is capable of achieving it. That’s why he and Candy have been committed to educating and inspiring young people and over the past twenty years have awarded more than 6,700 students with scholarships through their Carson Scholars Fund. A Doctor in the House  is a classic American love story—and that story is far from over. As Candy writes, “We don’t know what God has for us next, but we’re ready to follow. . . . As we head forward into the un-known once more, I thank God for putting us together.\"",
  "genres": [
    "Biography",
    "Nonfiction",
    "Memoir",
    "Biography Memoir",
    "Politics"
  ],
  "author": "Candy Carson",
  "average_rating": "3.99",
  "url": "https://www.goodreads.com/book/show/25776254-a-doctor-in-the-house"
}