{
  "title": "Till the Dark Angel Comes: Abolitionism and the Road to the Second American Revolution",
  "description": "The Transformation of the Abolitionist Movement from Peaceful Demonstration to Radical Confrontation as Embodied in John Brown Establishing himself as a fresh and important voice in the history of African American emancipation,William S. King provides a critical introduction to the lead-up to the Civil War. A skilled and judicious chronicler, King seamlessly weaves multiple and seemingly disparate threads, including early nineteenth-century Revivalism, the emergence of the Republic of Texas, the fugitive slave laws—and even the explosion of a cannon aboard the U.S.S. Princeton in 1844—to explain how the opposition to slavery in America changed from producing speeches and pamphlets to embracing the reality that slavery could be eradicated only through armed conflict. By tracing this transformation through the life of John Brown, King provides an entirely new assessment of this enigmatic figure who was characterized as a “mad man” in the wake of his butchering of proslavery settlers in Kansas and the inept raid on Harper's Ferry, Virginia. King puts these actions in context to explain the paradox of Brown’s legacy. On one hand he was vilified as an unstable threat to American democracy or a fanatical sideshow to the history of the Civil War, while on the other he was an inspiration to the oppressed, a man who garnered the indomitable Harriet Tubman’s commitment to the righteousness of his endeavor. Elegantly written with a command of period sources, Till the Dark Angel Comes: Abolitionism and the Road to the Second American Revolution is the story of interracial opposition to slavery, the important debates among free blacks as to their future in America, and the arguments and compromises at the highest levels of government. Here we encounter many personalities of the time, some well known, such as Frederick Douglass,William Lloyd Garrison, and John C. Calhoun, and others less so, but no less important—Martin Delany, Henry Highland Garnet, and Elijah Lovejoy.",
  "genres": [
    "History"
  ],
  "author": "William S. King",
  "average_rating": "2.50",
  "url": "https://www.goodreads.com/book/show/25778609-till-the-dark-angel-comes"
}