{
  "title": "A Passion for Life: The Biography of Elizabeth Taylor",
  "description": "Born in England to socially ambitious parents, Elizabeth Taylor was catapulted into child stardom and molded by MGM into the great violet-eyed beauty of postwar America. Along the way, she also became an award-winning actress, without training or theory, without teachers or counsel, ultimately dazzling audiences everywhere with spectacular performances. Elizabeth Taylor has lived nothing less than an extraordinarily remarkable life. With an abundance of new information, internationally acclaimed biographer Donald Spoto explores the gripping story of her brutalizing six-month marriage to compulsive gambler and hotel heir Nicky Hilton, her romances with top Hollywood directors, and her marriage to the ailing Michael Wilding. Four years later, she would be swept off her feet by showman Mike Todd, into an alternately violent and loving marriage that would end after a year with Todd's death in a plane crash, leaving Taylor, at the age of twenty-six, a twice-divorced widow with three children. Here are Taylor's years with Eddie Fisher, Republican Senator John Warner and Richard Burton, with whom she would share a hedonistic, brash lifestyle that would virtually define the 1960s jet set. These years are at last fully and richly explored with mines of fresh material, some of it shocking, some of it funny, all of it shedding new light on the complexities of the most beguiling star in movie history. Spoto candidly explores all the highs and lows of Taylor's exploits both in front of the camera and behind the scenes. Throughout the course of her tumultuous marriages, Taylor never stopped making movies, and from Cat on a Hot Tin Roof to Cleopatra to Who's Afraid of Virginia Woolf?, Taylor dazzled audiences with performances that won her two Academy Awards. The cast of supporting players in her life is unparalleled and never less than fascinating: here are Louis B. Mayer and Jack Warner, Montgomery Clift and James Dean, Tennessee Williams and Franco Zeffirelli, Malcolm Forb",
  "genres": [
    "Biography",
    "Nonfiction",
    "Audiobook",
    "Film",
    "Biography Memoir",
    "Media Tie In"
  ],
  "author": "Donald Spoto",
  "average_rating": "3.63",
  "url": "https://www.goodreads.com/book/show/1161615.A_Passion_for_Life"
}