{
  "title": "Fortune Smiles",
  "description": "Winner of the Pulitzer Prize for his acclaimed novel about North Korea, The Orphan Master’s Son, Adam Johnson is one of America’s most provocative and powerful authors. Critics have compared him to Kurt Vonnegut, David Mitchell, and George Saunders, but Johnson’s new book will only further his reputation as one of our most original writers. Subtly surreal, darkly comic, both hilarious and heartbreaking, Fortune Smiles is a major collection of stories that gives voice to the perspectives we don’t often hear, while offering something rare in fiction: a new way of looking at the world. In six masterly stories, Johnson delves deep into love and loss, natural disasters, the influence of technology, and how the political shapes the personal. “Nirvana,” which won the prestigious Sunday Times short story prize, portrays a programmer whose wife has a rare disease finding solace in a digital simulacrum of the president of the United States. In “Hurricanes Anonymous”—first included in the Best American Short Stories anthology—a young man searches for the mother of his son in a Louisiana devastated by Hurricanes Katrina and Rita. “George Orwell Was a Friend of Mine” follows a former warden of a Stasi prison in East Germany who vehemently denies his past, even as pieces of it are delivered in packages to his door. And in the unforgettable title story, Johnson returns to his signature subject, North Korea, depicting two defectors from Pyongyang who are trying to adapt to their new lives in Seoul, while one cannot forget the woman he left behind.Unnerving, riveting, and written with a timeless quality, these stories confirm Johnson as one of America’s greatest writers and an indispensable guide to our new century.",
  "genres": [
    "Short Stories",
    "Fiction",
    "Contemporary",
    "Book Club",
    "Literary Fiction",
    "Literature",
    "Short Story Collection"
  ],
  "author": "Adam  Johnson",
  "average_rating": "4.02",
  "url": "https://www.goodreads.com/book/show/25780610-fortune-smiles"
}