{
  "title": "The Beautiful World",
  "description": "Can beauty survive life’s harshest realities? A mystery unfolds in this contemporary take on Eleanor Porter’s beloved literary classic tale of ten-year-old David, a luminously gifted musician. Why would David’s father, a virtuoso violinist, have raised his prodigy son in seclusion on a mountaintop? Long-hidden secrets unravel when the father dies en route to introduce his guileless son to the people of valley below.Radiantly naïve, David enters a small town orphaned and alone, knowing only his first name and nothing of his heritage. All David knows is what his father has taught him—only what is beautiful and good, and nothing of the evils of the world he is about to encounter. Through a final letter, David's father leaves his son with a challenge. David must discover his purpose: the beautiful work he is meant to do in the world. With his violin eager to express what words cannot, David joyously searches out his true calling. The boy’s unsettlingly wondrous view of the world makes him a problem child to those more consumed with practical, modern living. His startling oddity fuels the town’s drive to solve the puzzle of his presence there and arrange for placement elsewhere. All the while, curiosity leads David to question those he meets about what work they do to make the world a better place. Workaholic farmer Simeon Holly begrudgingly houses David at the insistence of his desperately lonely wife, Ellen. Single mother Tina Glaspell barely makes ends meet, toiling as a housekeeper. Former lawyer, Jack Gurnsey has abandoned his career in the city to rear his much younger sister. Jack's childhood sweetheart, heiress Barbara Holbrook, has everything but purpose in her life, let alone love. As Jack probes the enigma of who David is, the secrets of David's secluded upbringing come to light. But lives and livelihoods hang in the balance. Will life’s harsh realities threaten David’s luminous spirit? Or could this boy have a life-changing impact on everyone he meets?  Susan Rohrer’s “REDEEMING” novels are part of an anthology series, a collection of clean, inspirational stories based on Susan Rohrer’s screenplays. With its touches of allegorical character drama, mystery, adventure, and romance, The Beautiful World is a mashup, a contemporary adaptation of Eleanor H. Porter’s classic novel, Just David, introducing this time-honored tale to a new generation of readers. Young and old alike will be inspired by David’s quest to find purpose, beauty, and joy in everyday living.",
  "genres": [
    "Christian"
  ],
  "author": "Susan Rohrer",
  "average_rating": "4.52",
  "url": "https://www.goodreads.com/book/show/25783369-the-beautiful-world"
}