{
  "title": "Salem Witch Haunt",
  "description": "5 stars Salem Witch Haunt totally nails time travel, December 13, 2015 By sknight It's very hard to write time travel and I keep a watchful eye on it when I know about it, but Theresa Sneed has accomplished time travel so well, I find myself in awe of how she did it. Twists and turns at every point in this tome. I love how she wove in the true history, which includes her own many greats-grandmother, Susannah Martin, who was one of the \"witches\" hung for no more reason than the rants of young women. I loved how I was transported back in time to 1692 to the Boston area. She described it perfectly and now I want to go there. I love how the main character, Bess Martin (also a fictional descendant of Susannah Martin in the book), is transported back in time. It's not what I thought would happen as the first thing she does is get captured and taken to an Indian Village. This part was great and unexpected, and plays a part in the plot throughout the book. I think it might also be the impetus of a sequel. I hope that's true because I really did enjoy this book and couldn't put it down. I spent many nights reading into all hours of the early morning, then struggling to get up to go to work. But that's not a complaint; just the hazards of a reader with a good book. 5 stars RIVETING! By Saguaro Blossomon October 1, 2015 This book held me spell-bound from the beginning and then kept getting better and better. At the end, I found myself wishing there were more pages to read. Sneed is an excellent writer with a wonderful, engrossing story to tell. It has a clever, satisfying twist at the end. That she is a descendant of the people she writes about enriches the story. You can feel her love of the topic and personal involvement in these lives even though the story is fictional. Excellent read! Author Theresa Sneed delivers another compelling story in her new novel SALEM WITCH HAUNT. When Bess Martin’s life suddenly spirals back to 1692, she discovers that she is about to watch the events of the Salem Witch trials unfold—including the hanging of her ancestor, Susannah Martin. Bess is torn between trying to set things right in a volatile and dangerous time period, while struggling with her attraction to Hezekiah, the ancestor of her best friend, Trent. SALEM WITCH HAUNT is full of adventure, suspense, and romance, all set in a fascinating historical era. Highly recommended! – Heather B. Moore USA Today Bestselling Author ***** When she finds herself thrust back in time, 17 year old Bess Martin, a senior at Danvers High, sets out on a mission to save her 11th great-grandmother from the gallows-tree. With a near-perfect knowledge of the historical events about to unfold, Bess knows the untimely fate of many. The problem is that Bess has inherited her grandmother’s sharp tongue—a tongue that caused her grandmother to be tried and hanged as a witch in Salem Village, 1692. Can Bess stop the hangings and change the course of history, or will she share her grandmother’s fate? From the 9th great-granddaughter of Susannah North Martin, accused and hanged as a witch, comes SALEM WITCH HAUNT, a realistic time-travel steeped in suspense and intrigue with a touch of sweet romance.",
  "genres": [
    "Historical Fiction",
    "Time Travel",
    "Young Adult",
    "Fiction",
    "Halloween",
    "Paranormal"
  ],
  "author": "Theresa Sneed",
  "average_rating": "4.08",
  "url": "https://www.goodreads.com/book/show/25782993-salem-witch-haunt"
}