{
  "title": "Spinning Blues into Gold: The Chess Brothers and the Legendary Chess Records",
  "description": "Muddy Waters. Howlin' Wolf. Chuck Berry. Etta James. Bo Diddley.The greatest artists who sang the blues made their mark with Leonard and Phil Chess, whose Chess Records was synonymous with the sound that swept up from the south, embraced Chicago and spread out into mid-century America. Spinning Blues into Gold is the impeccably researched story of the men behind the music and the remarkable company they created. Chess Records-and later Checkers, Argo and Cadet-was built by Polish immigrant Jews, brothers who saw the blues as a unique business opportunity. From their first ventures, a liquor store and then a nightclub, they promoted live entertainment. And parlayed that into the first pressings sold out of car trunks on long junkets through the midsection of the country, ultimately expanding their empire to include influential radio stations. The story of the Chess brothers is a very American story of commerce in the service of culture. Long on chutzpah, Leonard and Phil went far beyond their childhoods as the sons of a scrap-metal dealer. They changed what America listened to; the artists they promoted planted the seeds of rock 'n' roll and are still influencing music today.The story of the Chess brothers and the music they made captures the rich and volatile mix of race, Jews and music. Cohodas takes us deep into the world of independent record producers, sometimes abrasive and always aggressive men striving to succeed. Leonard and Phil worked hand-in-glove with disenfranchised black artists, the intermittent charges of exploitation balanced by the reality of a common purpose that brought them fame. From beginning to end, the lives of the Chesses were entwined with those of the artists socially, financially and creatively.",
  "genres": [
    "Music",
    "History",
    "Biography",
    "African American",
    "Nonfiction"
  ],
  "author": "Nadine Cohodas",
  "average_rating": "4.03",
  "url": "https://www.goodreads.com/book/show/1161633.Spinning_Blues_into_Gold"
}