{
  "title": "WWF WrestleMania : The Official Insider's Story",
  "description": "When Hulk Hogan hoisted the seven-foot-four, five-hundred-pound Andre the Giant into the air and over his head, the crowd fell briefly silent, as if not quite able to believe what was happening. As the Giant crashed to the canvas with a great THUD!, a roar went up from the crowd. It was pandemonium!Goosebump-raising moments like this one at 1987's WrestleMania III in Pontiac, Michigan, are what sports-entertainment is all about. Now fans can relive sixteen years of these electrifying events through vibrant color photographs, previously untold insider anecdotes, and an exclusive DVD of WrestleMania 's greatest moments.In WrestleMania: The Official Insider's Story, Basil V. DeVito Jr. -- a man with intimate knowledge of the past sixteen years of WrestleMania -- takes fans on a journey into the squared circle and into the private worlds behind the curtain and behind the boardroom doors.Fans will be treated to:What happened when the Hell's Angels showed up backstage for the first WrestleMania demanding to be seated in the sold-out houseHow Vince McMahon boldly predicted the weather -- with 93,000 seats on the lineWhich Superstars were in the first-of-its-kind, main-event 60-minute Iron Man match at WrestleMania XIIWhat the guest celebrities were really like, including Muhammad Ali, Liberace, Pete Rose, Mike Tyson, Willie Nelson, Donald Trump, Lawrence Taylor, Vanna White, Burt Reynolds, and many othersWhich Superstar mistook the president of Trump Plaza for the concierge and asked him to sell two WrestleMania IV tickets and bring him the money backstageHow the championship matches link WrestleManias through the yearsWho ushered in a new era of \"Attitude\" at WrestleMania 13How WrestleMania XVI's Fatal Four-Way Title Match -- with Triple H, The Rock, the Big Show, and Cactus Jack -- came to have a McMahon in every cornerAnd much, much more!Whether you're a new fan or an old mark, you don't know sports-entertainment unless you know about the sixteen-year history of its crowning jewel, WrestleMania !",
  "genres": [
    "Nonfiction",
    "Sports"
  ],
  "author": "Basil V. DeVito Jr.",
  "average_rating": "3.85",
  "url": "https://www.goodreads.com/book/show/1161592.WWF_WrestleMania_"
}