{
  "title": "El reino de los hombres sin amor",
  "description": "En la España del siglo de Oro, codicia, corrupción, estafa y asesinato han invadido un reino gobernado por tres viudos y un fraile. Entre tanto hombre sin amor, apenas queda sitio para un hombre honrado Otoño de 1615. Un doble enlace por poderes está a punto de unir las coronas de Francia y España en una alianza que pretende ser el germen de la paz en el de la española Ana de Austria con Luis XIII, rey de Francia, y el de la francesa Isabel de Borbón con el príncipe Felipe. Tras los festejos, ambas damas, seguidas por sus respectivas cortes, emprenderán su camino hasta el paso de Behovia, en la frontera sobre el río Bidasoa, donde se producirá lo que ya se conoce popularmente como «El intercambio de las princesas». Pero Isidoro Montemayor, secretario y amante de la condesa de Cameros, no participa del júbilo general. Un asunto de contrabando de plata pone en peligro a su adorada Micaela y, en consecuencia, también a él. Isidoro, héroe a su pesar, amante contrariado y tenaz investigador, se ve de repente obligado a cambiar la pluma por la espada e intentar conservar la vida en una España donde abundan las puñaladas a traición, tanto en los callejones lóbregos como en las resplandecientes alcobas reales. Con maestría, rigor y una velada ironía, Alfonso Mateo-Sagasta recrea ante nuestros ojos una España marcada por la corrupción y nos brinda esta apasionante aventura de caballeros despechados, damas enamoradas, aunque no bobas, y metales preciosos que unos y otros desean sobre todas las cosas. La crítica ha dicho... «El buen hacer de Isidoro Montemayor, su vis cómica, sus amoríos, su valor y su heroica villanía nos conducen por el lado ameno de la narración, trufada de multitud de anécdotas y de un humor elegante.» Juan Bolea, El Periódico de Aragón «Amor, aventuras y política en una historia trepidante. Una novela como las de antes; un narrador excepcional.» Víctor Andresco, crítico literario y escritor «Un excelente narrador.» Luís Fernández, El Mundo «Mateo-Sagasta, maestro en el género.» Isabel Margarit, Historia y Vida ENGLISH DESCRIPTION With mastery, rigor, and veiled irony, Alfonso Mateo-Sagasta recreates a Spain marked by corruption, and offers us a thrilling adventure of disgruntled knights, lovestruck—but not stupid—women, and precious metals that some desire above all else. Fall, 1615. A double wedding is about to unite the French and Spanish crowns in an alliance that is expected to sow the seed of peace in that of Anne of Austria with Luis XIII, King of France, and that of Elisabeth of France with Prince Philip. After the festivities, both ladies, followed by their respective courts, set out on the journey to the Behobia Pass, on the border along the Bidasoa River, where what is popularly known as \"The Exchange of Princesses\" takes place.",
  "genres": [
    "Historical Fiction"
  ],
  "author": "Alfonso Mateo-Sagasta",
  "average_rating": "3.78",
  "url": "https://www.goodreads.com/book/show/25786336-el-reino-de-los-hombres-sin-amor"
}