{
  "title": "Productive Habits Book Bundle",
  "description": "Increase Your Productivity with S.J. Scott's Best-Selling Book Bundle! Readers who like Getting Things Done and other time management books will love the Productive Habits Book Bundle!If you regularly feel overwhelmed, disorganized, sleep-deprived, or simply unfocused, then this ebook package has the productivity hacks you need to turn everything around.With this bundle, you'll 23 Anti-Procrastination HabitsTo-Do List MakeoverWake Up SuccessfulS.M.A.R.T. Goals Made SimpleDeclutter Your InboxIn 23 Anti-Procrastination How to Stop Being Lazy and Overcome Your Procrastination, you'll learn everything you need to know to stop putting off important tasks and start becoming more productive on a daily basis.In To-Do List A Simple Guide to Getting the Important Things Done, you'll discover how to use different to-do lists for different types of projects. The to-do lists that actually work!With Wake Up How to Increase Your Energy and Achieve Any Goal with a Morning Routine, you'll learn how to harness your energy to focus on one breakthrough goal that will transform your life.Declutter Your 9 Proven Steps to Eliminate Email Overload will take your thousands of unread messages to Inbox Zero in a surprisingly short amount of time. These 9 proven steps will clear the email clutter no matter how many daily emails you receive.In S.M.A.R.T. Goals Made 10 Steps to Master Your Personal and Career Goals, you'll finally get the plan you need to turn any ambition into an actionable plan you can achieve. Soon enough, you'll have daily routines that bring you even closer to your ultimate dreams!S.J. Scott's Productive Habits Book Bundle provides you with the bite-size changes you need to keep overwhelm down and productivity up. Enough with the theory and fluff. Ditch your chronic procrastination and read five books with powerful advice you can apply right away.Buy all five books today and learn how to build the productivity habit",
  "genres": [
    "Nonfiction",
    "Self Help",
    "Business",
    "Amazon",
    "Productivity"
  ],
  "author": "S.J. Scott",
  "average_rating": "3.86",
  "url": "https://www.goodreads.com/book/show/25790801-productive-habits-book-bundle"
}