{
  "title": "The Infatuation",
  "description": "It’s a war of wills between stubborn and sexy Josh Faraday and Kat Morgan. A fight to the bed. Arrogant, wealthy playboy Josh is used to getting what he wants. And what he wants is Kat Morgan.The minute Josh Faraday meets feisty, vivacious Kat Morgan, he wants her. Not for a relationship, of course. He doesn’t do those.  He wants her in his bed.  But, to his shock and extreme frustration, Kat won’t play by Josh’s rules like all the others. No, this stubborn woman declares she won't so much as  kiss Josh until he divulges some highly personal information . . . But it's something Josh has never told anyone, and won't be telling Kat. Not over his dead body, no matter how gorgeous and sexy she is. But the chemistry between the pair is explosive, scorching hot electricity like nothing he’s felt before. Oh, God, he’s got to get a taste. He figures all he has to do is wear the sexy woman down with is patented “playboy razzle dazzle”—show her the hotness she’s missing out on and she’ll cave, like all the rest . . . The only problem with that strategy? It’s Kat’s strategy, too: she plans to wear Josh down and get what she wants by showing him the hotness he’s missing out on. It’s a war of wills. A match to the bed. Who will crack first? And when they do, will either of their hearts be on the line?INFATUATION is first book of the JOSH AND KAT TRILOGY. The next two books are REVELATION and CONSUMMATION, to be read in order.*Readers 18+ due to graphic language and adult situations.NOTE: Kat Morgan is the sister of the Morgan brothers (Colby, Ryan, Keane, and Dax from standalones HERO, CAPTAIN, BALL PEEN HAMMER, and ROCKSTAR), plus best friend Zander (MISTER BODYGUARD). Josh Faraday is the twin brother of Jonas Faraday from THE CLUB TRILOGY. You can jump right in and read Josh and Kat's trilogy, before or after The Morgan Brothers or The Club Trilogy. \"One of my favorite series, ever.\" \"Addicting.\" \"Hot.\" \"Hilarious.\" \"Romantic.\" \"Emotional.\" \"Gripping.\" \"Sexy.\" “I want to be a Morgan.” \"I want to have the Faradays brothers' babies.\"",
  "genres": [
    "Romance",
    "Audiobook",
    "Contemporary",
    "Erotica",
    "Suspense",
    "Friends To Lovers",
    "Humor"
  ],
  "author": "Lauren Rowe",
  "average_rating": "4.26",
  "url": "https://www.goodreads.com/book/show/25789270-the-infatuation"
}