{
  "title": "Inches Aren't Everything",
  "description": "The elite trainers at Body Management Corporation (BMC) have more than sculpting the perfect body on their minds. Working with hot rock stars and professional athletes, they spend as much time between the sheets as on the treadmill. Head trainer, Dean Stoddard, is known for his good looks and stunning bedroom endurance with his more than willing clients. Orlanda Kennedy, one of Dean’s colleagues, is an exquisite goddess on a quest for success and wealth. Orlanda despises the shallowness of the fitness industry and the simple-minded men she works with. She uses her curves and intelligence to manipulate the men who lust after her, to maintain control of the situation – and the men. Dean can't deny his attraction to Orlanda but refuses to give her the satisfaction of turning him down, so he desires her in quiet from a distance – until he thinks she sends him a signal to approach for landing. Orlanda's plot for domination unfolds around BMC's owner, Zack Johnston, who is in a power struggle with his business partner, and in another kind of struggle with Leena Ryan, the mysterious woman who seduced him during a flight and hasn't let him rest since. She is about to push Zack into a whole new understanding of the word “action”, causing him to question himself and everything around him. Luckily, Zack has Keith Langley, his right-hand man and head trainer, keeping him grounded and protecting the business. Keith is a natural leader who longs for love instead of one-night stands. Burned out rock stars, sex-driven sports stars, clients who tempt, and trainers who accept, round out the roster of characters in this page-turning, intriguing romp of a novel. You'll get to laugh at 'em, love 'em and want to join them! Praise for “If you think the world of fitness and personal trainers is all about sit-ups, crunches, and sweating on a treadmill—think again! Inches Aren't Everything is a sexy and exuberant romp through the boardrooms and the bedrooms of some very intriguing people. If you like working out with a good read, minus the sweat, then this is the book for you. I loved it!” -S.P. Hozy, author of A Cold Season in Shanghai and The Scarlet Macaw “This book takes you on an amazing getaway where the world of bodies, fitness and sex collide. Loved it! A lighthearted, yet passionate look between the sheets of two irresistible characters in the fitness industry that will keep you engaged until the very end.” -Jay Bradley Author of LIVE, LOOK, FEEL; The 12-Week Guide to LIVE Longer, LOOK Younger, and FEEL Better! “This book gives you a different view of the other side of the workout machine. It is fun, naughty, sexy and the proper read in a boring airport or with a margarita under an umbrella on the beach.” –Henriette B., travel agent",
  "genres": [],
  "author": "Sarah B. Daniels",
  "average_rating": "4.25",
  "url": "https://www.goodreads.com/book/show/25789906-inches-aren-t-everything"
}