{
  "title": "Devouring Raine",
  "description": "Loving someone means you give them your heart, your soul and everything in between. For 69 Bottles Drummer, Dex Harris, life has always been about taking what he wants from women and walking away, that is until Raine Montgomery came barreling into his life. A force to be reckoned with and a woman he couldn’t ignore. She’s showing him that there is more to women than a temporary cure to boredom. With all their demons laid out on the table, the path to healing can begin. Dex quickly finds he’s replacing a drug addiction, with a Raine addiction, devouring her at every possible moment. Taking her to new heights and pushing her limits is what he’s determined to do. With the help from a couple new friends, Dex and Raine quickly find a new dynamic to their relationship really does work for them, but is it what she wants? Can she surrender herself to him in every way? When his past starts knocking on his door, will he be able to protect Raine from his transgression or will the sins of his past rip apart the one thing that has brought him the most joy? She’s tamed him…now it’s time to show her what true love really means. A Rock Band… A Tour Bus … One WILD Ride! **Content Warning** This story may contain sexual acts, content and otherwise erotic adventures between a man and a woman, Domination, submission, floggers, handcuffs, whips, rope, punishments and raw sexual pleasure in a playroom. May also contain some F/F. The author is not responsible for panty changing, cold showers, boyfriend/husband/significant other breaking or the events that may cause you to read one handed – batteries are not included. This story may also contain discussion of drugs, drug addiction, drinking, alcohol addiction and some violence – reader discretion is advised.",
  "genres": [
    "BDSM",
    "Romance",
    "Erotica",
    "Music",
    "Dark",
    "Menage",
    "Adult"
  ],
  "author": "Zoey Derrick",
  "average_rating": "4.25",
  "url": "https://www.goodreads.com/book/show/25796095-devouring-raine"
}