{
  "title": "The War of Art: Break Through the Blocks and Win Your Inner Creative Battles by Steven Pressfield: Book Summary",
  "description": "This is a Book Summary on The War of Art: Break Through the Blocks and Win Your Inner Creative Battles - Steven Pressfield  The War of Art: Break Through the Blocks and Win Your Inner Creative Battles Author: Steven Pressfield Publication Date: January 11, 2012  Listen to FREE Book Summaries on iTunes via the FlashBooks Podcast: http://www.getflashnotes.com/go/itunes  FlashBooks Podcast Homepage: http://www.getflashnotes.com/podcast  BOOK DESCRIPTION: A succinct, engaging, and practical guide for succeeding in any creative sphere, The War of Art is nothing less than Sun-Tzu for the soul. hat keeps so many of us from doing what we long to do? Why is there a naysayer within? How can we avoid the roadblocks of any creative endeavor—be it starting up a dream business venture, writing a novel, or painting a masterpiece? Bestselling novelist Steven Pressfield identifies the enemy that every one of us must face, outlines a battle plan to conquer this internal foe, then pinpoints just how to achieve the greatest success. The War of Art emphasizes the resolve needed to recognize and overcome the obstacles of ambition and then effectively shows how to reach the highest level of creative discipline. Think of it as tough love . . . for yourself. Whether an artist, writer or business person, this simple, personal, and no-nonsense book will inspire you to seize the potential of your life.  Product Details: Book Summary by FlashBooks: http://getflashnotes.com Paperback: 190 pages Publisher: Black Irish Entertainment LLC (January 11, 2012) Language: English ISBN-10: 1936891026 ISBN-13: 978-1936891023 Product Dimensions: 5 x 0.5 x 8 inches Shipping Weight: 8 ounces (View shipping rates and policies) Average Customer Review: 4.4 out of 5 stars See all reviews (1,802 customer reviews) Amazon Best Sellers Rank: #542 in Books (See Top 100 in Books) #4 in Books > Health, Fitness & Dieting > Psychology & Counseling > Creativity & Genius #6 in Books > Self-Help > Creativity #35 in Books > Self-Help > Success  Get more executive book summaries at http://www.getflashnotes.com  More About the Author › Visit Amazon's Steven Pressfield Page  Steven Pressfield Biography Steven Pressfield is the author of Gates of Fire, Tides of War, Last of the Amazons, Virtues of War, The Afghan Campaign, Killing Rommel, The Profession, The Lion's Gate, The War of Art, Turning Pro, The Authentic Swing, Do the Work and The Warrior Ethos. His debut novel, The Legend of Bagger Vance, was adapted for screen. A film of the same title was released in 2000, directed by Robert Redford and starring Matt Damon, Will Smith and Charlize Theron.His father was in the Navy, and he was born in Port of Spain, Trinidad, in 1943. Since graduating from Duke University in 1965, he has been a U.S. Marine, an advertising copywriter, schoolteacher, tractor-trailer driver, bartender, oilfield roustabout, attendant in a mental hospital and screenwriter. His struggles to earn a living as a writer (it took seventeen years to get the first paycheck) are detailed in The War of Art, Turning Pro and The Authentic Swing. Free Book Summary Website: http://www.getflashnotes.com Executive Book Summary membership: Become a member for $1 today: http://www.getflashnotes.com/join ****************************************************************************** THE FLASHBOOKS PODCAST: Start listening to FREE Audiobooks and Book Summaries on the FlashBooks Podcast! Click below to start listening now:  iTunes: http://www.getflashnotes.",
  "genres": [
    "Leadership",
    "Nonfiction"
  ],
  "author": "Book Summaries by FlashBooks",
  "average_rating": "4.02",
  "url": "https://www.goodreads.com/book/show/25795687-the-war-of-art"
}