{
  "title": "Confident You: An Introvert's Guide to Success in Life and Business",
  "description": "How to Succeed in an Extroverted World (Without Changing Who You Are) Being an introvert can be frustrating... The world applauds extroverts, so it's easy to feel left out in the cold. As an introvert, you know it's important to be outgoing, social and a good leader, yet these behaviors don't seem natural. The truth is that success in life often comes down to how well you sell yourself. This means behaving in a manner that doesn't seem congruent with what's inside. In simple terms, the world around us requires introverts to behave in an extroverted manner. How to Harness Your Introverted \"Powers\" Introversion can be a good thing. Without introverts, society would be full of outgoing and social people but a lot fewer artists, analysts, scientists, doctors, writers, engineers, and designers. On the other hand, the world often celebrates and rewards extroverts, often leaving introverts out in the cold. Instead of trying to make you an extrovert, the goal of \"Confident You\" is to help you capitalize on all the positive aspects of being an introvert, while helping you overcome the less positive aspects of introversion. Confident You - An Introvert's Guide to Success in Life and Business \"Confident You\" provides 15 strategies to help you become more extroverted in business and social situations. You will A 10-Minute Test That Identifies Your \"Type\" of Introversion Simple Lessons from Famous Introverts How to Deal with a Lack of Confidence (or Shyness) in Social Situations The Secret to Making a Good First Impression How to Have Your ACCOMPLISHMENTS Recognized at Work The Best Ways to Nurture Relationships with Extroverts Unique Leadership Qualities of Introverts How to Engage in Small Talk That MATTERS 4 Ways to Overcome the \"Dull Perception\" You can thrive in a world that prefers extroverts. All you need is an action plan for social situations at work and in life. Would You Like To Know More? Download now to learn how to become more confident and successful introvert. Scroll to the top of the page and select the buy now button.",
  "genres": [
    "Self Help",
    "Nonfiction",
    "Business",
    "Psychology",
    "Personal Development"
  ],
  "author": "S.J. Scott",
  "average_rating": "3.73",
  "url": "https://www.goodreads.com/book/show/25793502-confident-you"
}