{
  "title": "Remarkable Me: The Woman's Guide to Becoming Fearless and Getting Whatever You Want!",
  "description": "Do you ever feel stuck? Like you’ve lost your way in life? Lacking creativity? Struggling to find and maintain motivation? Love to change direction but worried how people will react if you do? Or perhaps you’re finding it difficult to ignore the negativity of your family and friends?No matter what challenges are keeping you stuck right now, your dreams are still precious.Perhaps you’d like to change careers, start or grow your own business, find a fulfilling relationship, improve your health, or something else. Maybe you just dream of a life where you’re free to do what you choose, instead of doing what everyone else expects of you.Well, that life doesn’t have to remain a pipe-dream any longer. You can have it if you’re just brave enough to begin!Remarkable Me (which is actually about you) will guide you through the proven method that helps women to get unstuck, overcome their fears, break free of their limitations, and begin to strategically pursue what they really want in life.Now, you may be thinking…There’s no way I can get what I really want. I have too many responsibilities. Or too little time. And, perhaps insufficient cashflow. But none of that matters.In this conversational and highly interactive guide, Jo Davidson will lead you, step-by-step, throughDispelling Limitations and Overcoming Barriers to Your Success.Discovering What is Truly Important to You (instead of what you think is important right now)Developing Unstoppable Confidence.Combatting Negative Self-Talk and Embracing Self-AcceptanceTrusting Your Abilities and IntuitionHandling Negativity and RejectionIntelligent Goal SettingMotivational Tools and TechniquesBuilding Supportive RelationshipsSuper-Charging Creativity and ProductivityScheduling and Prioritisation that actually works (and won’t leave you feeling frazzled)Strategic Action PlanningAnd, Long Term Success TechniquesSo, whatever your current circumstances, this book will give you the tools to thrive, helping you to accelerate your success, and break through the barriers that have been holding you back, so you can start living the life you’ve always wanted (but never dared dream you could actually have).",
  "genres": [],
  "author": "Jo Davidson",
  "average_rating": "4.60",
  "url": "https://www.goodreads.com/book/show/25794944-remarkable-me"
}