{
  "title": "The Burmese Girl and the Bangkok Madness",
  "description": "The Burmese girl, whose father was a Tatmadaw (Burmese military) officer, left the country in turmoil for England at a young age. She later got married; her husband was a British citizen. An unexpected turn of events brought her back to Rangoon. She joined the pro-democracy movement. For her true grit, selflessness and sacrifices, she became the leader of her party committing to the restoration of justice, human rights and democracy to the country.  Is this the story of Aung San Suu Kyi, the icon of the Burmese democratic movement?  Actually, the facts above, curiously familiar as they are, belong to an entirely different heroine rather than that of the Nobel Peace Prize laureate.  Her name is Maya. She is an ordinary Burmese girl, except that she is also very pretty. Like many of the young men and women of her generation who have poured their souls into the resistance movement to overthrow the military regime, she adores Daw Aung San Suu Kyi and regards her as the undisputed leader of the Burmese people. The Lady’s famous statement - “I do not hold to non-violence for moral reasons, but for practical and political reasons, because I think it’s best for the country. And even Ghandiji, who is supposed to be the father of non-violence, said that between cowardice and violence, he’d choose violence anytime.” – is her motto.  In 2006, Maya returned to Rangoon to attend the funeral of a Burmese dissident who was once in love with her. The man had been sold out, imprisoned in Central Prison Insein and was tortured to death. A former student leader masquerading as a restaurateur in London, was identified as the prime suspect behind the death of the dissident. To bring the culprit to justice, Maya went to Bangkok, hid in a 'ghost' building on the bank of the Chao Phraya River and waited for the suspect to appear.  In the summer of the same year, a young Hong Kong man flew into Bangkok with his girlfriend, a Thai prostitute named Kaya. They were the persons wanted in connection with a case of murder and robbery in a tiny Asian city called Macao. They hoped to seek refuge in Bangkok whose seemingly lax law and order was considered their best protection, without knowing three months after they had landed in the city, a democratically elected government was toppled by the military.  Ah Man, which is the name of the young Hong Kong man, was later abandoned by his Thai girlfriend. He was left all alone to face his pursuers (the law enforcers as well as the local gangsters), who were extending their search into the area of Khao San where he had been hiding since his arrival in Bangkok.  To a fate probably even weirder than he could have imagined, Ah Man crossed paths with Maya. Captivated by the beauty of the Burmese girl, fascinated by her story of fighting a brutal government, and lured by the glories of an impending revolution, Ah Man joined Maya as she returned to Rangoon. In the ensuing years, he would experience – adventure after adventure – a train of some most tragic, confused and bizarre events that would have befallen the country, before a new era of reconciliation and reconstruction finally dawned upon Burma.  \"The Burmese Girl and the Bangkok Madness\", a work of fiction, is the first part of the “Burmese Revolutionary Days” series. As much as an epic, the series is an intimate account of revolt, slaughter and ruin, as well as a chronicle of Burmese people’s proud pursuit of democracy which has continued to remain elusive and out-of-reach.",
  "genres": [],
  "author": "Genghis Phone",
  "average_rating": "4.50",
  "url": "https://www.goodreads.com/book/show/25793062-the-burmese-girl-and-the-bangkok-madness"
}