{
  "title": "Minecraft Diaries: Diary of a Wimpy Ninja: The Noob Ninja Chronicles Book 1 (An Unofficial Minecraft Book)",
  "description": "***Free For Kindle Unlimited***Are You A Diary of a Wimpy Steve Fan?Do You Love Minecraft Diaries?Mio is a struggling student ninja in a dojo on top of a hidden mountain. Being always last in his class, he is constantly harassed verbally by his classmate Michael – who was incidentally the best student in the dojo. After many years of being behind, Mio dreamt of a life after being a professional ninja. He only wished for a giant mansion with a roller coaster that connects to a giant castle. But his life is about to have a nasty turn.On the worst day of his life, the rest of his classmates received brand new ninja swords while he was stuck with his wooden sword – to be called a noob ninja for 10 more years! Little did he know that his master recognizes his true potential – the power to learn the fire aspect, which is something not even the most ruthless ninja warrior can simply obtain.Minecraft + Ninjas = Epic?Just when he thought things can’t get any worse, an evil necromancer queen injures their master and threatens to conquer the world by opening a portal to another dimension to take command of the unspeakable creatures that lurk within. But in order to do so, she needed more eyes of ender which are being protected by the ninja dojos across the world. Helpless, their master had no choice but to leave the fate of the world to his young ninja students.Join Mio, Michael, Paul, and Robbie as they face Minecraft zombies, skeletons, spiders, and farting Grandmasters.Can Mio and his classmates stop a necromancer queen from claiming the last eye of ender and save the world?Will he ever learn the secret of the fire aspect?What are the horrors that lie beyond the portal? Diary of a Wimpy Ninja to catch this crazy adventure! minecraft diaries, diary of a wimpy steve, minecraft stories, minecraft comics, minecraft zombie books, minecraft zombies, ninja turtles minecraft, diary a wimpy, kids books minecraft",
  "genres": [],
  "author": "Minecrafty Diaries",
  "average_rating": "4.50",
  "url": "https://www.goodreads.com/book/show/25795766-minecraft-diaries"
}