{
  "title": "Warrior Patient: How to Beat Deadly Diseases With Laughter, Good Doctors, Love, and Guts",
  "description": "This is an alternate cover edition for ASIN: B00NRX4WREWarrior Patient: a 2015 Gold Medal Winner, Readers' Favorite Book Awards. Awarded a B.R.A.G. Medallion in October 2015.Enjoy the surprisingly funny story of someone who recovers completely from a relentless series of medical problems, many resulting from the system designed to prevent them. Today, the patient plays tennis, walks, bikes and works out in a gym. Almost miraculously, he recaptures “normal.” Read how he does it in this award-winning story of survival.PREFACE: The world we live in has the best doctors and the most advanced medical system that our civilization has ever known. Yet 100,000 patients die and nine million suffer injury every year. If medical mistakes were a disease, it would be the sixth leading cause of deaths in America. In this extraordinary age of medical miracles, patients continue to sink into the quicksand of \"going to the hospital.\" Who has not heard about someone who checked into a facility for \"normal\" surgery ... leading to their death? A cartoon makes a joke out of it. It shows a doctor in a laboratory, surrounded by white lab rats. \"We don't need better medicine,\" he announces to his colleagues, \"we need stronger lab rats.\" As you read Warrior Patient you become one of the nine million who suffer injury every year. You take an extraordinary, often amusing journey into the quicksand of modern medicine. In the midst of a long list of life-threatening illnesses, you learn to laugh and you learn how to become a much stronger lab rat, a \"Warrior Patient.\" You take advantage of America's fabulous medical system. You are not taken advantage of by that system. The story unfolds with humor and anecdotes that capture characters, times and places, from good doctors to bad ones, from childhood to old age, from Africa to Sweden. In the end, you fully recover. You live again. You have a life. Enjoy the trip.",
  "genres": [
    "Memoir"
  ],
  "author": "Temple Emmet Williams",
  "average_rating": "4.61",
  "url": "https://www.goodreads.com/book/show/25798245-warrior-patient"
}