{
  "title": "His Dirty Girl: Vol. 1",
  "description": "Volume One - Pounding the Princess... in Public!- STEP Party- Keeping His Bed Warm... at a special discounted rate!BOOK DESCRIPTIONS :Pounding the Princess... in Public!It isn't easy living under the same roof as someone you want, but aren't supposed to have . This is the dilemma of 19-year-old Jamie and her forbidden fuck Jeff, who share a taboo relationship . Fortunately for them, a carnival's come to town, and they're about to turn it into a personal playground of pleasure...(previously titled Carnal Days and Carnival Nights )STEP PartyEmma's special male friend , Danny, is the best. And he's also the best in bed . Danny is SO GOOD at fucking her that Emma can't help but brag to all her college girlfriends. They would give anything to have Danny inside them , too, so Emma decides to invite them over for a sexy menage party , or sleepover, one fateful Saturday evening.\"Sleeping\" is the LAST thing they'll be doing, however... unless they count sleeping with each other !(previously titled Sleepover With Danny and Friends )Keeping His Bed WarmPaul and the lady of the house are recently divorced, yet Abby still likes to call him by a naughty nickname . She's felt closer to Paul than any other man for years now, so when he finds himself without a place to stay following the split, Abby insists he come live with her. She quickly learns why his marriage failed -- his prudish wife simply couldn't satisfy his voracious sexual appetite!When Abby walks in on Paul pleasuring himself , she convinces her *horny houseguest* to let her be there for his \"needs\", like his woman couldn't... This 17,000+ word three-book anthology contains explicit depictions of hot, steamy, taboo lovin' between dirty girls and their *forbidden* men. Characters are consenting adults (18+) whom share a non-blood relationship which may be considered \"offensive\" to some readers.",
  "genres": [],
  "author": "Sarah Sethline",
  "average_rating": "3.36",
  "url": "https://www.goodreads.com/book/show/25803807-his-dirty-girl"
}