{
  "title": "Dog Medicine",
  "description": "At twenty-two, Julie Barton collapsed on her kitchen floor in Manhattan. She was one year out of college and severely depressed. Summoned by Julie's incoherent phone call, her mother raced from Ohio to New York and took her home.Psychiatrists, therapists and family tried to intervene, but nothing reached her until the day she decided to do one hopeful thing: adopt a Golden Retriever puppy she named Bunker.Dog Medicine captures in beautiful, elegiac language the anguish of depression, the slow path to recovery, and the astonishing way animals can heal even the most broken hearts and minds.ADVANCE PRAISE“Dog Medicine is the kind of memoir that will bring tears of sadness and joy to anyone who has ever felt rescued by a pet. It is a memoir about how the right animal can inspire not just hope but mercy. Julie Barton’s prose is lyrical and unflinching, a gorgeous howl in the darkness that leads the reader into the light.”— Steve Almond, author of Against Football and Candyfreak“Anyone who has ever opened their heart and asked an animal to teach them how to live—and there are so many of us—will be deeply moved by the story of Julie Barton and her soulmate Bunker. In this honest, gloriously unselfconscious and compelling memoir, she does great honor, not only to her dog, but to the miracles made possible when logic, and even language, is not allowed to stand in the way of love.”— Pam Houston, author of Sight Hound and Contents May Have Shifted.Julie Barton’s memoir \"Dog Medicine\" is the most heartbreaking and heartwarming book I’ve read in years. It tells both the harrowing story of a depression so severe that Barton felt it might “vaporize her into millions of tiny molecules” and the consoling story of her eventual recovery through the love of and for her beloved dog and “spirit twin,” Bunker. Reader, this book about how Barton’s dog changed her life will change your life.— David Jauss, author of \"Glossolalia: New & Selected Stories.\"It is not easy to explore the frightening landscape of depression with depth and surprising beauty. But Julie Barton has done just that. As someone who has lived with chronic depression for many years, I can tell you from personal experience how daunting and misunderstood this disease is. Not surprising that it takes the love and loyalty and unwavering sanity of a dog — any pet, really — to reach those of us struggling to find a way through the grips of melancholy. This, I know from experience, too. Read this book if you or someone you love is wrestling with depression. Read this book if you love dogs. Read this book if you want to remember what hope feels like. Just read this book.— Susan Chernak McElroy, New York Times bestselling author of \"Animals as Teachers\" and \"Healers.\"There are times when another creature can hold our love until we can hold it for ourselves. And then, in perfect symbiosis, the beloved can become the lover, until they are one force. Dog Medicine shows us that this is not just possible, but sometimes, a matter of life or death.— Laura Munson, New York Times bestselling author of \"This Is Not The Story You Think It Is\"\"Dog Medicine\" accomplishes what only the most authentic writing can do: craft language so that readers live an experience. In this brilliant and lyrical debut memoir, Barton has written a narrative of inescapable appeal. The bond, here, between human and animal isn’t easy or sentimental— rather, it’s archetypal and magical. There is a Buddhist story of a Bodhisattva, an enlightened one, who refused to enter paradise until an ailing companion dog could also enter. \"Dog Medicine\" relates an equally powerful story of devotion, only related in real, worldly terms with heartbreaking consequences and rewards.— Sue William Silverman, author of \"The Pat Boone Fan Club: My Life as a White Anglo-Saxon Jew.\"You may think you’re about to read a book about a charming dog, or about struggling with identity in your twenties, or about how a young woman pulls herself together after a diagnosis of depression. But you’d be wrong. \"Dog Medicine\" is a love story—a great big beautiful honest touching intoxicating riveting page-turning instruction manual on the palpable healing power of love and forgiveness. Every word in this book is as honest and courageous as any I’ve ever read, and I’ve read a lot. — Robin Oliveira, New York Times bestselling author of \"My Name is Mary Sutter.\"Julie Barton’s wise, wonderful, impeccably written memoir is not just a book about how a puppy can help keep at bay the gray wolf of depression. It’s also a book filled with love stories and stories of people finding their better selves, all dramatized with novelistic suspense and complexity. In this age of hour-long therapy shows and sensationalistic self-depiction, Barton’s book holds true wisdom as it tells the hard-earned truths of mental illness, self-doubt, abuse, hope, family, forgiveness, connection with self and others, and finally something close to salvation. Barton gives real insight, conveyed through incisive, evocative prose. And she proves the adage that purpose comes not only from how well we are loved, but by how well we love.— Tim Parrish, author of \"Fear and What Follows\" and \"The Jumper\"A raw and honest memoir about Julie Barton's clinical depression and how the love of a dog helped pull her back from hell. An eloquent testament to the resilience of humans and the healing power of canine love.— Susan Richards, New York Times bestselling author of \"Chosen By a Horse\"Julie Barton was haunted by a major depression that threatened to topple her. What could one small puppy, Bunker, do in the face of such calamity? Only when Barton created a sacred place where she and Bunker could meet, a place without ridicule, doubt, sorrow, or anger, could the true healing begin. Her meticulous rendering of this transformation honors the power of love.— Jacqueline R. Sheehan, New York Times bestselling author of \"Lost & Found\"Anyone who has ever loved a dog will relate to Julie Barton's \"Dog Medicine.\" This memoir is a heartfelt tribute to man's best friend. - Elliott Holt, author of You Are One of ThemThis absorbing memoir travels along the axis of depression and hope in beautifully crafted prose. Ms. Barton uses fresh language to provide a better understanding of the depths of depression, and introduces us to Bunker, her saving grace who throughout the book holds readers in their place. –Marcelle Soviero, Editor-in-Chief, Brain, Child: The Magazine for Thinking Mothers.",
  "genres": [
    "Nonfiction",
    "Memoir",
    "Animals",
    "Dogs",
    "Biography",
    "Biography Memoir",
    "Health"
  ],
  "author": "Julie Barton",
  "average_rating": "4.25",
  "url": "https://www.goodreads.com/book/show/25799992-dog-medicine"
}