{
  "title": "How to Catch a Cheater in 48 Hours or Less!: Exercise Your Right to Know the Truth!",
  "description": "Do You Suspect Your Partner of Cheating, But Just Can’t Prove It?  If You’re a Woman Ask Yourself These  Has he suddenly become more secretive about his online and offline activities? Has he suddenly become more (defensive) about his cellphone lately? Have you suddenly started hearing “Sorry, but tonight I have to work late” on a regular basis? Has he started finding fault with you for no reason? Has he stopped caring about having sex with you? Is he constantly accusing you of being unfaithful to him? Is he constantly having mood swings and starting arguments out of nowhere?  If You’re a Man Ask Yourself These  Has she started giving you (excuse after excuse) of why she can’t have sex with you? Has she started telling you that “She needs her space”? Has she started dressing up more provocatively when she leaves the house? Has she started dropping hints to you that she’s unhappy? Has she started accusing you daily of cheating on her? Has she become more (defensive) when you ask her questions like “Where you’ve been?” Has she started detaching herself from your friends and family? Does she become (defensive) when you ask her about her new (mysterious friend)?  If you’re lucky, you’ll never have to experience what it’s like to be the victim of cheating.  However, the statistics aren’t About 60 percent of men and 40 percent of women will cheat at some point in their relationship.  But what’s WORST OF ALL…The Majority of Cheating Goes UNKNOWN and UNDETECTED by the INNOCENT victims.  But Now You Can Exercise Your Right to Know The Truth!  In “How to Catch a Cheater in 48 Hours or Less” you’ll   * How to Find Out Whose Been Secretly Calling and Texting Your Partner’s Cellphone  * How to Find Out What Your Partner’s Been Hiding On The Internet  * How to Trace Your Partner’s Whereabouts When They Leave the House  * The Tell Tale Signs that Your Man is Cheating On You  * The Tell Tale Signs that Your Woman is Cheating On You  * How to Catch Your Partner “In the Middle of The Act”  * How to Get Your Partner to “Confess” to the Affair  * How to Get Over the Hurt and Move On After The Affair  * How to Rebuild The Relationship If There’s Still a Chance  * How to Start Over If The Relationship Is Finished  * How to Spot a Cheater Next Time Before You Get Your Heart Involved  * and MUCH MUCH MORE!  How OUTRAGED would you be to discover that your partner has been cheating on you ALL THIS TIME? (at your own expense)  As you read every word of this book you’ll discover “easy-to-follow” techniques you can use to “Catch a Cheater in 48 Hours or Less”  Isn’t it time you found out the truth about your partner’s secret affairs?  Isn’t it time you put “everything out in the open” and cleared your conscious once and for all?  Isn’t it time you stopped stressing and worrying throughout the day and night?  Well, Now You Can Bring All Your Partner’s Secrets to The Light!  “How to Catch a Cheater in 48 Hours or Less” by Eugene Walker  P.S. Cheating is NOT a laughing matter. It can destroy relationships and even destroy lives.",
  "genres": [],
  "author": "Eugene Walker",
  "average_rating": "4.43",
  "url": "https://www.goodreads.com/book/show/25801347-how-to-catch-a-cheater-in-48-hours-or-less"
}