{
  "title": "Deviant",
  "description": "JulienI'm a hit man, an assassin. A deviant by all accounts. I never pretended to be the good guy. She was the opposite.But the minute she pulled the curtains back and saw my face, watched me screwing the blonde who happened to be my next mark, she sealed her own fate. There could be no witnesses, ever. Imagine my surprise when I turned up to take care of her only to find two goons breaking down her door, weapons in hand. Turned out she had a price on her head. Her stepbrother wanted her and he wanted her alive. I'd never been one to pass up an opportunity to collect the kind of money he was offering, especially if I could have some fun while I was at it. It just never occurred to me she’d be anything more than my next mark.Mia“Curiosity killed the kitten.” I'll never forget the look in his eyes when he said those words. When I watched them from the window, I didn't suspect for a moment that he'd seen me, that he was watching me back. Not while he was doing what he was doing to the woman on her knees before him. But then she turned up dead, and he turned up in my hotel room, waiting for me in the dark. I didn't think for one second him being there that night would save my life. I'd been on the run for two years, but my stepbrother had finally caught up with me. Or his two thugs had. Finding out I had a quarter-of-a-million dollar bounty on my head convinced Julien I was more valuable alive than dead. But to collect it would mean returning me to my stepbrother, who had sworn to make me pay for what I'd done. Julien was cruel. He was merciless. He scared the crap out of me. But there was something else, something he never wanted me to see. Inside, he was broken, like me.My stepbrother was wrong if he thought I'd ever let him get his hands on me again. I had no intention of allowing that to happen, even if it meant I'd have to sleep with the devil to survive. And I had no doubt Julien was the devil.",
  "genres": [
    "Dark",
    "Romance",
    "BDSM",
    "Erotica",
    "Dark Romance",
    "Abuse",
    "Contemporary"
  ],
  "author": "Natasha Knight",
  "average_rating": "3.79",
  "url": "https://www.goodreads.com/book/show/25804028-deviant"
}