{
  "title": "The Deception of the Emerald Ring",
  "description": "A dangerous ring of spies, a game of mistaken identities, and a heartwarming romance of unlikely pairs come together in Lauren Willig's engaging and exciting third novel THE DECPTION OF THE EMERALD RING. Praised for the \"cheerfully postmodern and energetic . . .romance-adventure hybrids [that] have escaped the clutches of niche fiction.\" (The Onion A.V. Club), her Pink Carnation series is garnering her critical acclaim and a loyal fan base.  Lauren Willig's debut The Secret History of the Pink Carnation, appeared on retailer bestseller lists in hardcover and made a big splash in sales in trade paperback. Her second book, The Masque of the Black Tulip, was selected as a BookSense Pick for January 2006, and continue to rack up incredible reviews. Lauren Willig's passion for authentic historical detail coupled with her talent for enthralling love stories make her series the perfect read for lovers of romance, history and adventure.  The year is 1803 and England and France remain at odds. Hoping to break the English once and for all, Napoleon backs a ring of Irish rebels in uprisings against England and sends the Black Tulip, France's most deadly spy, to the Emerald Isle to help. What they don't know is that also in Ireland is England's top spy, the Pink Carnation, who is working to shut the rebels down. Meanwhile, back in England, Letty Alsworthy intercepts a note indicating that her sister, Mary, is about to make the very grave mistake of eloping with Geoffrey Pinchingdale-Snipe (second in command of the League of the Purple Gentian). In an attempt to save the family name, Letty tries to stop the elopement, but instead finds herself swept away in the midnight carriage meant for her sister and is accidentally compromised. Geoff and Letty, to each other's horror, find themselves forced into matrimony. Then, Geoff receives word that he is to travel to Ireland to help the Pink Carnation and disappears immediately after their wedding ceremony. Letty learns of Geoff's disappearance and, not to be outdone by her husband, steals away on a ship bound for Ireland, armed and ready to fight for her husband…and to learn a thing or two about spying for England. \t As in her previous tales, The Secret History of the Pink Carnation and The Masque Of the Black tulip, our modern-day heroine and hero, Eloise Kelly and Colin Selwick, continue their budding romance in this captivating third novel in the series.",
  "genres": [
    "Historical Fiction",
    "Romance",
    "Historical",
    "Mystery",
    "Historical Romance",
    "Fiction",
    "Chick Lit"
  ],
  "author": "Lauren Willig",
  "average_rating": "3.91",
  "url": "https://www.goodreads.com/book/show/25802.The_Deception_of_the_Emerald_Ring"
}