{
  "title": "When Brooklyn Was the World, 1920-1957",
  "description": "Around the corner. The next block. Across the At the end of the line. Borough Park. Gowanus. Flatbush. Canarsie. Ridgewood. Greenpoint. Brownsville. Bay Ridge. Bensonhurst. City Line. What was the place called Brooklyn really like back then... when Brooklyn was the world?Elliot Willensky, born in Brooklyn and now official Borough Historian, takes us back to a sweeter time when a trip on the new BMT subway was a delightful adventure, when summer days were a picnic on the sand and evenings were Nathan's hotdogs at Coney Island and a whirl of lights, spills, and chills at dazzling Luna Park.Remembering Brooklyn, it's the neighborhoods you think of first -- or maybe it's your own block, the one you were raised on. In those days, the street was a more animated, more colorful place. Jacks and jump rope, hit-the-stick, double-dutch and skelly or potsy (hopscotch to you) were played everywhere. The street was a natural amphitheater, and the stoop was the perfect place for grown-ups to sit and watch and visit with neighbors. Stores-on-wheels selling fruit, baked goods, and the old standby, seltzer, rolled right down the block, and the Fuller Brush man and Electrolux vacuum-cleaner salesmen worked door to door, saving housewives countless shopping trips.For many, a big night out was dinner at a Chinese restaurant, where 99 percent of the patrons were non-Chinese, and you could get mysterious-sounding dishes like moo goo gai pan and subgum chow mein -- \"One from column A, two from column B.\" If you could afford to go somewhere really classy, the Marine Roof of the Bossert Hotel was one of the hottest nightspots. A hot date on Saturday night featured big bands at the clubs on The Strip (Flatbush Avenue below Prospect Park) -- the Patio, the Parakeet Club, the Circus Lounge -- or gala stage shows at the Brooklyn Academy of Music or the enormous Paramount Theatre.Still, for family entertainment you couldn't beat a day at the beach and a night on Surf Avenue, taking in the sideshows and the penny arcades.For Brooklyn, the years between 1920 and 1957 were a special time. It was in 1920 that the subway system reached to Brooklyn's outer edge -- linking the entire borough with Manhattan and making it an ideal spot for millions of new families to build their homes. The end of the era came in 1957 -- the last year that Brooklyn's beloved Dodgers played at Ebbets Field before moving to sunny California. For many loyal fans the fate of \"Dem Bums\" represents the fate of Brooklyn.With a brilliant, entertaining text and hundreds of exciting, nostalgic photographs (many never before published), When Brooklyn Was the World recovers the history of this lively city, as remembered by the millions of people who knew Brooklyn in its golden era.",
  "genres": [
    "History",
    "New York",
    "Nonfiction"
  ],
  "author": "Elliot Willensky",
  "average_rating": "4.10",
  "url": "https://www.goodreads.com/book/show/258010.When_Brooklyn_Was_the_World_1920_1957"
}