{
  "title": "A Clear View of the Southern Sky",
  "description": "A Clear View of the Southern Sky reveals women in the twenty-first century doing what women have always done in pursuit of life, liberty, and happiness. In each of the ten tales from Southern storyteller Mary Hood, women have come—by circumstances and choice—to the very edge of their known worlds. Some find courage to winnow and move on; others seek the patience to risk and to stay. Along the way hearts, bonds, speed limits, fingernails, and the Ten Commandments get broken. Dust settles, but these women do not.In the title story, a satellite dish company promises that happiness—or at least access to its programming—requires just a TV and a clear view of the Southern sky. The short story itself reveals the journey of a Hispanic woman whose mission is to assassinate a mass murderer, an agenda triggered by post-traumatic stress wrought by seeing the murderer's cynical grin on a news program. We follow her into the shadow of an enormous satellite dish on a roof across the street from the courthouse and ultimately into a women's prison English-as-Second-Language class where she must confront her life. She has slept but never dreamed, and now she wakes.In other stories Hood introduces us to a kindergarten teacher, stunned by a student's blurted-out question, as she discovers her deepest vocation and the mystery of its source. We meet a widow who befriends a young neighbor, only to realize they must keep secrets from each other and hold fast to their hope. A woman trucker discovers the depth of her love as she imagines her cell phone calls—and her sweetheart's own messages—winging their way, tower to tower, along her interstate route. Two stories deal with one man and two of his wives and how they learn the lessons only love can teach about the reach and limitations of ownership and forever. The collection concludes with the novella \"Seam Busters,\" in which a diverse cast of women workers in a rural Georgia mill sew camouflage for U.S. soldiers in Afghanistan. The women are part of a larger purpose, and they know it. When the shadow of death passes over the factory, each woman and the entire community find out what it really means to have American pride.New York Times best-selling writer and Story River Books editor at large Pat Conroy provides a foreword to the collection.",
  "genres": [
    "Short Stories",
    "Fiction"
  ],
  "author": "Mary Hood",
  "average_rating": "4.03",
  "url": "https://www.goodreads.com/book/show/25800739-a-clear-view-of-the-southern-sky"
}