{
  "title": "Demon's Wings Collection",
  "description": "Family means everything to the rockers in Demon’s Wings and their manager, Emmie. Together they have made their own family, having spent the last sixteen years having each other’s back and making sure that Emmie was taken care of. Now things are changing. Their family of five is expanding, and not everyone is happy about it. Follow them through six full-length books as they discover new things about themselves, and figure out what the meaning of love really is.The Rocker Who Holds MeYou can choose your own family. For Emmie she’s always known who her real family is, the four rockers who have taken care of her since she was five years old. Now, as their manager, she spends every second of her day making sure that they are taken care of. It’s not always easy, especially when she’s fighting feelings that having nothing to do with sisterly love for one of the four rockers…The Rocker Who Savors MeGetting kicked out of her house by her mother at sixteen was tough, but for Layla that only made her stronger. She’s always taken care of herself and managed to survive through all the hard times. Now, with two sisters to take care of on her own, things are about to get a lot tougher. Being offered a trial job as housekeeper for one of the hottest rock bands will hopefully change that. If she can keep her hands off the sexy as sin drummer…The Rocker Who Needs MeLana knew the second she laid eyes on the Demon that her life was going to change. She didn’t anticipate falling in love with him, but when she did she fought hard to hide her feelings. She knew that she could only ever be his friend and was okay with it. Until one night changed everything…The Rocker Who Loves MeGrowing up being told daily that she wasn’t good enough has beaten down Harper’s self-esteem. She knows that she’s not good enough—not beautiful enough—to catch one particular Demon’s eye. Yet, for some reason he keeps coming back, keeps tempting her with his cheesy pickup lines and those damn blue-gray eyes. She wasn’t sure if she was strong enough to keep resisting…The Rocker Who Holds HerWhen Nik first met the tear stained face of the little baby doll next door, he knew she was going to be a big part of his life. He never anticipated he would one day fall for her. For years he fought his feelings, but he can’t keep quiet any longer. However, seeing the girl he’s about to declare his love to kissing his friend wasn’t part of his plans for how the night would end…The Rockers’ BabiesThings are changing. Emmie’s family has grown and she couldn’t be happier. Fate, however, has other plans for the happy Emmie and her rockers have found…",
  "genres": [
    "Romance",
    "New Adult",
    "Contemporary",
    "Music",
    "Contemporary Romance",
    "Amazon"
  ],
  "author": "Terri Anne Browning",
  "average_rating": "4.53",
  "url": "https://www.goodreads.com/book/show/25812912-demon-s-wings-collection"
}