{
  "title": "Tonight",
  "description": "David has loved his older brother Derek's BFF, Wiley, since the first day he met him, five long lust-filled years ago. But, as Derek never hesitates to point out, Wiley is straight.When Wiley has a falling out with his roommate and winds up crashing on David and Derek's couch for a month, he's a 24/7 reminder of what David wants but fears he'll never have. Until one afternoon when David has a major art project to finish and a model who's a no-show. Wiley offers to pose for him---and it sure feels like the heat between them is mutual.Could Derek have been wrong about his best friend for all these years? Would David's dreams about Wiley finally come true? The only thing David knows is that one way or another he'll find out for sure...tonight. This story was written as a part of the M/M Romance Group's \"Love is an Open Road\" event. Group members were asked to write a story prompt inspired by a photo of their choice. Authors of the group selected a photo and prompt that spoke to them and wrote a short story. Here is the letter and a description of the photo that accompanied this prompt:Dear Author,See the hot jock sitting on top of me? He’s my older brother’s team mate and I’ve lusted after him— and loved him— since forever. I never thought I’d have a chance though. That dumbass brother of mine always said he was straight. But look at the way he’s giving the phrase “He takes my breath away” a whole new meaning! My brother must be wrong. Please, dear author, let him be wrong and make my dream come true.Photo Description: Two sexy, shirtless, dark-haired young men are making out on a couch. The muscular, tattooed man on top is holding the other guy’s wrists above his head with one strong hand as they kiss.This story may contain sexually explicit content and is intended for adult readers. It may contain content that is disagreeable or distressing to some readers. The M/M Romance Group strongly recommends that each reader review the General Information section before each story for story tags as well as for content warnings.",
  "genres": [
    "M M Romance",
    "Friends To Lovers",
    "Romance",
    "Contemporary",
    "College",
    "New Adult",
    "Short Stories"
  ],
  "author": "Karen Stivali",
  "average_rating": "3.82",
  "url": "https://www.goodreads.com/book/show/25808753-tonight"
}