{
  "title": "The English and their History",
  "description": "In The English and their History, the first full-length account to appear in one volume for many decades, Robert Tombs gives us the history of the English people, and of how the stories they have told about themselves have shaped them, from the prehistoric 'dreamtime' through to the present day.If a nation is a group of people with a sense of kinship, a political identity and representative institutions, then the English have a claim to be the oldest nation in the world. They first came into existence as an idea, before they had a common ruler and before the country they lived in even had a name. They have lasted as a recognizable entity ever since, and their defining national institutions can be traced back to the earliest years of their history.The English have come a long way from those precarious days of invasion and conquest, with many spectacular changes of fortune. Their political, economic and cultural contacts have left traces for good and ill across the world. This book describes their history and its meanings from their beginnings in the monasteries of Northumbria and the wetlands of Wessex to the cosmopolitan energy of today's England. Robert Tombs draws out important threads running through the story, including participatory government, language, law, religion, the land and the sea, and ever-changing relations with other peoples. Not the least of these connections are the ways the English have understood their own history, have argued about it, forgotten it, and yet been shaped by it. These diverse and sometimes conflicting understandings are an inherent part of their identity. Rather to their surprise, as ties within the United Kingdom loosen, the English are suddenly beginning a new period in their long history. Especially at times of change, history can help us to think about the sort of people we are and wish to be. This book, the first single-volume work on this scale for more than half a century, and which incorporates a wealth of recent scholarship, presents a challenging modern account of this immense and continuing story, bringing out the strength and resilience of English government, the deep patterns of division, and yet also the persistent capacity to come together in the face of danger.",
  "genres": [
    "History",
    "Nonfiction",
    "Audiobook",
    "British Literature",
    "European History",
    "Historical",
    "Politics"
  ],
  "author": "Robert Tombs",
  "average_rating": "4.21",
  "url": "https://www.goodreads.com/book/show/25810756-the-english-and-their-history"
}