{
  "title": "Our Man in Charleston: Britain's Secret Agent in the Civil War South",
  "description": "Between the Confederacy and recognition by Great Britain stood one unlikely Englishman who hated the slave trade. His actions helped determine the fate of a nation. When Robert Bunch arrived in Charleston to take up the post of British consul in 1853, he was young and full of ambition, but even he couldn’t have imagined the incredible role he would play in the history-making events to unfold. In an age when diplomats often were spies, Bunch’s job included sending intelligence back to the British government in London. Yet as the United States threatened to erupt into Civil War, Bunch found himself plunged into a double life, settling into an amiable routine with his slavery-loving neighbors on the one hand, while working furiously to thwart their plans to achieve a new Confederacy. As secession and war approached, the Southern states found themselves in an impossible position. They knew that recognition from Great Britain would be essential to the survival of the Confederacy, and also that such recognition was likely to be withheld if the South reopened the Atlantic slave trade. But as Bunch meticulously noted from his perch in Charleston, secession’s red-hot epicenter, that trade was growing. And as Southern leaders continued to dissemble publicly about their intentions, Bunch sent dispatch after secret dispatch back to the Foreign Office warning of the truth—that economic survival would force the South to import slaves from Africa in massive numbers. When the gears of war finally began to turn, and Bunch was pressed into service on an actual spy mission to make contact with the Confederate government, he found himself in the middle of a fight between the Union and Britain that threatened, in the boast of Secretary of State William Seward, to “wrap the world in flames.” In this masterfully told story, Christopher Dickey introduces Consul Bunch as a key figure in the pitched battle between those who wished to reopen the floodgates of bondage and misery, and those who wished to dam the tide forever. Featuring a remarkable cast of diplomats, journalists, senators, and spies, Our Man in Charleston captures the intricate, intense relationship between great powers on the brink of war.",
  "genres": [
    "History",
    "Nonfiction",
    "Civil War",
    "Biography",
    "American History",
    "War",
    "Espionage"
  ],
  "author": "Christopher Dickey",
  "average_rating": "3.97",
  "url": "https://www.goodreads.com/book/show/25807730-our-man-in-charleston"
}