{
  "title": "The Lost Book of Moses: The Quest for the World's Oldest Bible--and the Man Who Wrote It",
  "description": "A gripping account of one man's quest to find the oldest Bible in the world and solve the riddle of the brilliant, doomed antiquities dealer accused of forging it. In the summer of 1883, Moses Wilhelm Shapira--archaeological treasure hunter, inveterate social climber, and denizen of Jerusalem's bustling marketplace--arrived unannounced in London claiming to have discovered the world's oldest Bible scroll. Written centuries earlier in the barren plains east of the Dead Sea and stashed away in caves, the mysterious scrolls called into question the divine authorship of the scriptures, taking three thousand years of religious faith and turning them upside down. When news of the discovery leaked to the excited English press, Shapira became a household name. But before the British Museum could acquire them, Shapira's nemesis, French archaeologist Charles Clermont-Ganneau, denounced his find as a fraud. Humiliated, Shapira fled the country. Six months later he was dead. With the discovery of the eerily similar Dead Sea Scrolls in 1947, investigators reopened the case, wondering whether the ill-fated merchant had, in fact, discovered the first Dead Sea Scroll, decades before the rest. But by then Shapira's scrolls had vanished. Tigay, award-winning journalist and son of a renowned Bible scholar, set out to find the scrolls and determine Shapira's guilt or innocence for himself. The globetrotting hunt that follows vibrates with the suspense of a classic detective tale. Weaving meticulous research into fast-paced storytelling, Tigay spins a remarkable tale of history and theology; intrigue and scandal; greed, ambition, and the struggle for authenticity. With a brilliant eye for detail, Tigay takes us from restricted storerooms at the Louvre to musty English attics to a flooded Jordanian gorge--and to the German countryside where he meets Shapira's aggrieved descendants. At once historical drama and modern-day mystery, The Lost Book of Moses brings to life 19th century London and Jerusalem and a cast of rogues, reverends, and relic hunters at whose center sits Moses Wilhelm Shapira, a flamboyant, ingenious, and ultimately tragic personality.",
  "genres": [
    "History",
    "Nonfiction",
    "Religion",
    "Books About Books",
    "Archaeology",
    "Judaism",
    "Biography"
  ],
  "author": "Chanan Tigay",
  "average_rating": "3.85",
  "url": "https://www.goodreads.com/book/show/25816698-the-lost-book-of-moses"
}