{
  "title": "Rightful Heritage: Franklin D. Roosevelt and the Land of America",
  "description": "The acclaimed, award-winning historian—“America’s new past master” (Chicago Tribune)—examines the environmental legacy of FDR and the New Deal.Douglas Brinkley’s The Wilderness Warrior celebrated Theodore Roosevelt’s spirit of outdoor exploration and bold vision to protect 234 million acres of wild America. Now, in Rightful Heritage, Brinkley turns his attention to the other indefatigable environmental leader—Teddy’s distant cousin, Franklin Delano Roosevelt, chronicling his essential yet under-sung legacy as the founder of the Civilian Conservation Corps (CCC) and premier protector of America’s public lands. FDR built from scratch dozens of State Park systems and scenic roadways. Pristine landscapes such as the Great Smokies, the Everglades, Joshua Tree, the Olympics, Big Bend, Channel Islands, Mammoth Cave, and the slickrock wilderness of Utah were forever saved by his leadership.Brinkley traces FDR’s love for the natural world from his youth exploring the Hudson River Valley and bird watching. As America’s president from 1933 to 1945, Roosevelt—consummate political strategist—established hundreds of federal migratory bird refuges and spearheaded the modern endangered species movement. He brilliantly positioned his conservation goals as economic policy to combat the severe unemployment of the Great Depression. During its nine-year existence, the CCC put nearly three million young men to work on conservation projects—including building trails in the national parks, pollution control, land restoration to combat the Dust Bowl, and planting over two billion trees.Rightful Heritage is an epic chronicle that is both an irresistible portrait of FDR’s unrivaled passion and drive, and an indispensable analysis that skillfully illuminates the tension between business and nature—exploiting our natural resources and conserving them. Within the narrative are brilliant capsule biographies of such environmental warriors as Eleanor Roosevelt, Harold Ickes, and Rosalie Edge. Rightful Heritage is essential reading for everyone seeking to preserve our treasured landscapes as an American birthright.",
  "genres": [
    "History",
    "Biography",
    "Nonfiction",
    "Politics",
    "Presidents",
    "Nature",
    "American History"
  ],
  "author": "Douglas Brinkley",
  "average_rating": "4.27",
  "url": "https://www.goodreads.com/book/show/25816604-rightful-heritage"
}