{
  "title": "Medusa's Web",
  "description": "From the award-winning author of Hide Me Among the Graves, Last Call, Declare, and Three Days to Never, a phantasmagoric, thrilling, mind-bending tale of speculative fiction in which one man must uncover occult secrets of 1920s Hollywood to save his family.In the wake of their Aunt Amity’s suicide, Scott and Madeline Madden are summoned to Caveat, the eerie, decaying mansion in the Hollywood hills in which they were raised. But their decadent and reclusive cousins, the malicious wheelchair-bound Claimayne and his sister, Ariel, do not welcome Scott and Madeline’s return to the childhood home they once shared. While Scott desperately wants to go back to their shabby South-of-Sunset lives, he cannot pry his sister away from this haunted “House of Usher in the Hollywood Hills” that is a conduit for the supernatural.Decorated by bits salvaged from old hotels and movie sets, Caveat hides a dark family secret that stretches back to the golden days of Rudolph Valentino and the silent film stars. A collection of hypnotic eight-limbed abstract images inked on paper allows the Maddens to briefly fragment and flatten time—to transport themselves into the past and future in visions that are both puzzling and terrifying. Though their cousins know little about these ancient “spiders” which provoke unpredictable temporal dislocations, Ariel and Claimayne have been using for years—an addiction that has brought Claimayne to the brink of selfish destruction.As Madeline falls more completely under Caveat’s spell, Scott discovers that to protect her, he must use the perilous spiders himself. But will he unravel the mystery of the Madden family’s past and finally free them. . . or be pulled deeper into their deadly web?",
  "genres": [
    "Fantasy",
    "Fiction",
    "Horror",
    "Time Travel",
    "Science Fiction",
    "Urban Fantasy",
    "Historical Fiction"
  ],
  "author": "Tim Powers",
  "average_rating": "3.56",
  "url": "https://www.goodreads.com/book/show/25816801-medusa-s-web"
}