{
  "title": "Dark Territory: The Secret History of Cyber War",
  "description": "The never-before-told story of the computer scientists and the NSA, Pentagon, and White House policymakers who invented and employ the wars of the present and future - the cyber wars where every country can be a major power player and every hacker a mass destroyer, as reported by a Pulitzer Prize-winning security and defense journalist.In June 1983, President Reagan watched the movie War Games, in which a kid unwittingly hacks the Pentagon, and asked his top general if the scenario was plausible. The general said it was. This set in motion the first presidential directive on computer security.The first use of cyber techniques in battle occurred in George H.W. Bush's Kuwait invasion in 1991 to disable Saddam's military communications. One year later, the NSA Director watched Sneakers, in which one of the characters says wars will soon be decided not by bullets or bombs but by information. The NSA and the Pentagon have been rowing over control of cyber weapons ever since.From the 1994 (aborted) US invasion of Haiti, when the plan was to neutralize Haitian air-defenses by making all the telephones in Haiti busy at the same time, to Obama's Defense Department 2015 report on cyber policy that spells out the lead role played by our offensive operation, Fred Kaplan tells the story of the NSA and the Pentagon as they explore, exploit, fight, and defend the US. Dark Territory reveals all the details, including the 1998 incident when someone hacked into major US military commands and it wasn't Iraq, but two teenagers from California; how Israeli jets bomb a nuclear reactor in Syria in 2007 by hacking into Syrian air-defense radar system; the time in 2014 when North Korea hacks Sony's networks to pressure the studio to cancel a major Hollywood blockbuster; and many more. Dark Territory is the most urgent and controversial topic in national defense policy.",
  "genres": [
    "History",
    "Nonfiction",
    "Technology",
    "Politics",
    "Science",
    "War",
    "Audiobook"
  ],
  "author": "Fred  Kaplan",
  "average_rating": "3.90",
  "url": "https://www.goodreads.com/book/show/25814289-dark-territory"
}