{
  "title": "The First Signs: Unlocking the Mysteries of the World's Oldest Symbols",
  "description": "One of the most significant works on our evolutionary ancestry since Richard Leakey’s paradigm-shattering Origins, The First Signs is the first-ever exploration of the little-known geometric images that accompany most cave art around the world—the first indications of symbolic meaning, intelligence, and language.Imagine yourself as a caveman or woman. The place: Europe. The time: 25,000 years ago, the last Ice Age. In reality, you live in an open-air tent or a bone hut. But you also belong to a rich culture that creates art. In and around your cave paintings are handprints and dots, x’s and triangles, parallel lines and spirals. Your people know what they mean. You also use them on tools and jewelry. And then you vanish—and with you, their meanings.Join renowned archaeologist Genevieve von Petzinger on an Indiana Jones-worthy adventure from the open-air rock art sites of northern Portugal to the dark depths of a remote cave in Spain that can only be reached by sliding face-first through the mud. Von Petzinger looks past the beautiful horses, powerful bison, graceful ibex, and faceless humans in the ancient paintings. Instead, she’s obsessed with the abstract geometric images that accompany them, the terse symbols that appear more often than any other kinds of figures—signs that have never really been studied or explained until now.Part travel journal, part popular science, part personal narrative, von Petzinger’s groundbreaking book starts to crack the code on the first form of graphic communication. It’s in her blood, as this talented scientist’s grandmother served as a code-breaker at Bletchley. Discernible patterns emerge that point to abstract thought and expression, and for the first time, we can begin to understand the changes that might have been happening inside the minds of our Ice Age ancestors—offering a glimpse of when they became us.",
  "genres": [
    "History",
    "Nonfiction",
    "Anthropology",
    "Science",
    "Art",
    "Archaeology",
    "Audiobook"
  ],
  "author": "Genevieve von Petzinger",
  "average_rating": "3.95",
  "url": "https://www.goodreads.com/book/show/25814327-the-first-signs"
}