{
  "title": "The Fever of 1721: The Epidemic That Revolutionized Medicine and American Politics",
  "description": "More than fifty years before the American Revolution, Boston was in revolt against the tyrannies of the Crown, Puritan Authority, and Superstition. This is the story of a fateful year that prefigured the events of 1776.In The Fever of 1721, Stephen Coss brings to life an amazing cast of characters in a year that changed the course of medical history, American journalism, and colonial revolution, including Cotton Mather, the great Puritan preacher, son of the president of Harvard College; Zabdiel Boylston, a doctor whose name is on one of Boston's grand avenues; James and his younger brother Benjamin Franklin; and Elisha Cooke and his protegee; Samuel Adams.During the worst smallpox epidemic in Boston history Mather convinced Doctor Boylston to try a procedure that he believed would prevent death--by making an incision in the arm of a healthy person and implanting it with smallpox. Inoculation led to vaccination, one of the most profound medical discoveries in history. Public outrage forced Boylston into hiding, and Mather's house was firebombed.A political fever also raged. Elisha Cooke was challenging the Crown for control of the colony and finally forced Royal Governor Samuel Shute to flee Massachusetts. Samuel Adams and the Patriots would build on this to resist the British in the run-up to the American Revolution. And a bold young printer James Franklin (who was on the wrong side of the controversy on inoculation), launched America's first independent newspaper and landed in jail. His teenage brother and apprentice, Benjamin Franklin, however, learned his trade in James' shop and became a father of the Independence movement.One by one, the atmosphere in Boston in 1721 simmered and ultimately boiled over, leading to the full drama of the American Revolution.",
  "genres": [
    "History",
    "Nonfiction",
    "Science",
    "Medical",
    "Medicine",
    "American History",
    "Historical"
  ],
  "author": "Stephen Coss",
  "average_rating": "3.73",
  "url": "https://www.goodreads.com/book/show/25814342-the-fever-of-1721"
}