{
  "title": "The Nazi Hunters",
  "description": "“[A] deep & sweeping account of a relentless search for justice.”—Washington Post After the Nuremberg trials & the start of the Cold War, most of the victors in WWII lost interest in prosecuting war criminals. Many of the lower-ranking perpetrators quickly blended in with the millions who were seeking to rebuild their lives in a new Europe, while those who felt most at risk fled the continent. The Nazi Hunters focuses on the few who refused to allow their crimes to be forgotten—& who were determined to track them down. The Nazi Hunters reveals the experiences of the young American prosecutors in the Nuremberg & Dachau trials, Benjamin Ferencz & Wm Denson; the Polish investigating judge Jan Sehn, who handled the case of Auschwitz commandant Rudolf Höss; Germany’s judge & prosecutor Fritz Bauer, who repeatedly forced his countrymen to confront their country’s record of mass murder; the Mossad agent Rafi Eitan, in charge of the Israeli team that nabbed Eichmann; & Eli Rosenbaum, who rose to head the US Justice Department’s Office of Special Investigations that belatedly sought to expel war criminals who were living in the USA. But some of the Nazi hunters’ most controversial actions involved ambiguous cases, such as former UN Secretary-General Kurt Waldheim’s attempt to cover up his wartime history. Or the fate of concentration camp guards who have lived into their 90s, long past the time when reliable eyewitnesses could be found to pinpoint their exact roles.  The story of the Nazi hunters is coming to an end. It was unprecedented in many ways, especially the degree to which the initial impulse of revenge was transformed into a struggle for justice. The Nazi hunters have transformed fundamental notions of right & wrong. Nagorski’s book is a richly reconstructed odyssey, a tale of gritty determination, at times reckless behavior & relentless pursuit.",
  "genres": [
    "History",
    "Nonfiction",
    "World War II",
    "War",
    "Holocaust",
    "Crime",
    "Politics"
  ],
  "author": "Andrew Nagorski",
  "average_rating": "3.85",
  "url": "https://www.goodreads.com/book/show/25814355-the-nazi-hunters"
}