{
  "title": "Forged: A Forged Series Book",
  "description": "My name is Rayne. Just Rayne. I’m sure there’s a last name around here somewhere, but since no one knows who my parents were, it remains a mystery to me. The scars of my past won’t haunt my future, knowing that the tragedies and trials I’ve endured were meant to break me only serves to strengthen my resolve to be stronger than anyone expects me to be. I won’t be a victim again, despite the nightmares that stalk me. My curse has put everyone I’ve made the mistake of loving into a premature grave. The curse and the voices that taunt my days aren’t the only reason I retreated into the solitude of rural living. I’ve never really been great with people, no matter how drawn to me they tended to be. I much prefer being alone. But, when the immeasurably maddening and immensely infuriating Kenryk shows up at my doorstep, my lady parts suddenly stand up and take notice, responding in ways I never thought I could. I can’t seem to get enough of him. Bringing with him a two-punch combo of a magically magnetic touch and wildly shifting mood swings, my relative peace is shattered. What’s more, I’m thrust into an unknown world, piling up with impossibilities too difficult to fathom. Suddenly, I find myself with powerful enemies and ageless allies, fighting to survive a war I know nothing about. With more questions than answers, I struggle to make sense of the chaos that has become my life. I have no desire to be a part of the war brewing between the immortals that I’m suddenly surrounded by, much less lead them to their victory. However, with each new kernel of information that I glean, it looks more and more like fate has different plans for me. In the midst of the turmoil, I find myself drawn to Kenryk, despite how fervently I try not to. As things become more and more tangled, the lines between my beliefs and reality become increasingly blurry.",
  "genres": [],
  "author": "L.L. Ford",
  "average_rating": "3.82",
  "url": "https://www.goodreads.com/book/show/25816861-forged"
}