{
  "title": "The Past",
  "description": "In her most accessible, commercial novel yet, the “supremely perceptive writer of formidable skill and intelligence (New York Times Book Review) turns her astute eye to a dramatic family reunion, where simmering tensions and secrets come to a head over three long, hot summer weeks.With five novels and two collections of stories, Tessa Hadley has earned a reputation as a fiction writer of remarkable gifts. She brings all of her considerable skill and an irresistible setup to The Past, a novel in which three sisters, a brother, and their children assemble at their country house.These three weeks may be their last time there; the upkeep is prohibitive, and they may be forced to sell this beloved house filled with memories of their shared past (their mother took them there to live when she left their father). Yet beneath the idyllic pastoral surface, hidden passions, devastating secrets, and dangerous hostilities threaten to consume them.Sophisticated and sleek, Roland’s new wife (his third) arouses his sisters’ jealousies and insecurities. Kasim, the twenty-year-old son of Alice’s ex-boyfriend, becomes enchanted with Molly, Roland’s sixteen-year-old daughter. Fran’s young children make an unsettling discovery in a dilapidated cottage in the woods that shatters their innocence. Passion erupts where it’s least expected, leveling the quiet self-possession of Harriet, the eldest sister.Over the course of this summer holiday, the family’s stories and silences intertwine, small disturbances build into familial crises, and a way of life—bourgeois, literate, ritualized, Anglican—winds down to its inevitable end.With subtle precision and deep compassion, Tessa Hadley brilliantly evokes a brewing storm of lust and envy, the indelible connections of memory and affection, the fierce, nostalgic beauty of the natural world, and the shifting currents of history running beneath the surface of these seemingly steady lives. The result is a novel of breathtaking skill and scope that showcases this major writer’s extraordinary talents.",
  "genres": [
    "Fiction",
    "Literary Fiction",
    "Contemporary",
    "Family",
    "British Literature",
    "Book Club",
    "Audiobook"
  ],
  "author": "Tessa Hadley",
  "average_rating": "3.25",
  "url": "https://www.goodreads.com/book/show/25816831-the-past"
}