{
  "title": "Kim Kardashian",
  "description": "The definitive biography of the world’s number-one reality star, Kim Kardashian West—the savvy entrepreneur and fashion forward woman who has defined fame for today’s generation—from the UK's leading celebrity biographer.A thoroughly modern woman, Kim Kardashian West, the daughter of headline-making lawyer Robert Kardashian, grew up like a princess in a Beverley Hills mansion. As a young girl, Kim’s ambition was to appear on The Real World, the groundbreaking hit series. But reality proved even bigger than her dreams, when just a few years later she became the star of her own smash show, Keeping Up With the Kardashians.While Keeping Up with the Kardashians took us into Kim’s privileged world and made her a household name, the details of her life story—murder, elopement, domestic violence, a sex tape, a quickie divorce, religious worship, and unbelievably glamorous designer fashions—played out like an X-rated version of the 1980s soap opera Dynasty. But Kim’s story has only just begun. Married for a second time—to one of the biggest stars on the planet, Kanye West—she has begun her own dynasty with the birth of daughter, North, and another baby due in November 2015.Filled with delicious, painstakingly researched, eye-popping detail, Kim Kardashian uncovers what it took for Kim to rise to the top—and how she intends to stay there. Sean Smith offers a multidimensional portrait of this remarkable woman, exploring her childhood, her family, her turbulent love life, and her glitzy multi-millionaire lifestyle. From her fabulous fashion-sense, to her world-famous physique, to her devotion to her family, including her relationship with her stepparent, Bruce Jenner and his transition to Caitlyn Jenner, this sensational, addictive biography tells the unvarnished truth about the undisputed Queen of Celebrity—the real story of Kim Kardashian.",
  "genres": [
    "Nonfiction",
    "Biography"
  ],
  "author": "Sean  Smith",
  "average_rating": "3.45",
  "url": "https://www.goodreads.com/book/show/25817882-kim-kardashian"
}