{
  "title": "The California Wife",
  "description": "In the sweeping, poignant sequel to The Vintner’s Daughter, the Lemieux family’s ambition to establish an American winemaking dynasty takes Sara and Philippe from pastoral Napa to the Paris World’s Fair and into the colourful heart of early 20th-century San FranciscoIt is 1897, and Sara and Philippe Lemieux, newly married and full of hope for the future, are determined to make Eagle’s Run, their Napa vineyard, into a world-renowned winemaking operation. But the swift arrival of the 20th century brings a host of obstacles they never dreamed of: price wars and the twin threats of phylloxera and prohibition endanger the success of their business, and the fiercely independent Sara is reluctant to leave the fields behind for the new and strange role of wife and mother.An invitation to the World’s Fair in 1900 comes just in time to revive the vineyard’s prospects, and amid the jewel-coloured wonders of Belle epoque Paris, Sara and Philippe’s passion is rekindled as well. But then family tragedy strikes, and, upon their return to California, a secret from Philippe’s past threatens to derail their hard-won happiness in one stroke.Sara gains an ally when Marie Chevreau, her dear friend, arrives in San Francisco as the first female surgery student to be admitted to prestigious Cooper Medical College. Through Marie, Sara gets a glimpse of the glittering world of San Francisco’s high society, and she also forges friendships with local women’s rights advocates, inciting new tensions in her marriage. Philippe issues Sara an ultimatum: will she abandon the struggle for freedom to protect her family’s winemaking business, or will she ignore Philippe and campaign for a woman’s right to vote and earn a fair wage?Fate has other plans in store in the spring of 1906, which brings with it a challenge unlike any other that the Lemieux family or their fellow Northern Californians have ever faced. Will the shadow of history overwhelm Sara and Philippe’s future, despite their love for each other? In The California Wife, Kristen Harnisch delivers a rich, romantic tale of wine, love, new beginnings, and a family’s determination to fight for what really matters—sure to captivate fans of The Vintner’s Daughter and new readers alike.",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Drama",
    "Historical",
    "Novels",
    "Book Club",
    "Romance"
  ],
  "author": "Kristen  Harnisch",
  "average_rating": "3.98",
  "url": "https://www.goodreads.com/book/show/25818189-the-california-wife"
}