{
  "title": "The Who: 50 Years: The Official History",
  "description": "The only official history of The Who—created with the full cooperation of Pete Townshend and Roger Daltrey, and spectacularly illustrated with rare photographs and memorabilia—published in conjunction with the fiftieth anniversary of the release of the band's first album, My Generation, and their celebratory world tour.Three legendary bands are revered as the holy trinity of modern rock and roll: The Beatles. The Rolling Stones. The Who. This landmark publication is the first official history of The Who featuring exclusive access to never-before-published images and memorabilia from the band's own archive, and from other sources including collectors and fans.Blending memoir, history, and music, The Who explores the influences that shaped the band and its members, from Britain’s post-war austerity to Elvis, Lonnie Donegan, and American youth counter-culture. It follows them through the Mod and Pop years and the furiously fast sixties, and charts the hit singles—\"My Generation,\" \"I’m a Boy,, \"The Kids Are Alright,\" and \"Pinball Wizard.\" It revels in memories of making it big in America and inspiring Jimi Hendrix to set his guitar on fire, and much more.It records the band’s highs—their groundbreaking artistic achievements of Tommy and Quadrophenia—and the devastating lows—the loss of Keith Moon and John Entwistle. The Who documents the extraordinary story of how a tax inspector, sheet metal worker, art school stoner and maverick drummer—John Entwistle, Roger Daltrey, Pete Townshend and Keith Moon—became one of the most famous and enduring musical acts of modern times and transformed the world, creating the sound of a generation.The Who includes approximately 500 color and black-and-white photos, band and fan memorabilia, and archive material; Pete Townshend and Roger Daltrey are writing the captions, providing an extra layer to the book; and there is a special pullout feature spreads providing vivid background social history and context.",
  "genres": [
    "Music",
    "Nonfiction",
    "Biography",
    "History"
  ],
  "author": "Ben Marshall",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/25817430-the-who"
}