{
  "title": "Midnight in Broad Daylight: A Japanese American Family Caught Between Two Worlds",
  "description": "Meticulously researched and beautifully written, Midnight in Broad Daylight is the true story of a Japanese American family that found itself on opposite sides during World War II. An epic tale of family, separation, divided loyalties, love, reconciliation, loss, and redemption, Pamela Rotner Sakamoto’s history is a riveting chronicle of U.S.-Japan relations and of the Japanese experience in America.After their father’s death, the Fukuhara children—all born and raised in the Pacific Northwest—moved with their mother to Hiroshima, their parents’ ancestral home. Eager to go back to America, Harry and his sister, Mary, returned there in the late 1930s. Then came Pearl Harbor. Harry and Mary were sent to an internment camp until a call came for Japanese translators, and Harry dutifully volunteered to serve his country. Back in Hiroshima, their brothers, Frank and Pierce, became soldiers in the Imperial Japanese Army.As the war raged on, Harry, one of the finest bilingual interpreters in the United States Army, island-hopped across the Pacific, moving ever closer to the enemy—and to his younger brothers. But before the Fukuharas would have to face one another in battle, the U.S. detonated the atomic bomb over Hiroshima, gravely injuring tens of thousands of civilians, including members of the Fukuhara family.Alternating between American and Japanese perspectives, Midnight in Broad Daylight captures the uncertainty and intensity of those charged with the fighting, as well as the deteriorating home front of Hiroshima—never depicted before in English—and provides a fresh look at the events surrounding the dropping of the first atomic bomb. Intimate and evocative, here is an indelible portrait of a resilient family, a scathing examination of racism and xenophobia, an homage to the tremendous Japanese American contribution to the American war effort, and an invaluable addition to the historical record of this extraordinary time.",
  "genres": [
    "History",
    "Nonfiction",
    "Japan",
    "World War II",
    "Biography",
    "War",
    "Book Club"
  ],
  "author": "Pamela Rotner Sakamoto",
  "average_rating": "4.30",
  "url": "https://www.goodreads.com/book/show/25817182-midnight-in-broad-daylight"
}