{
  "title": "Got Milked?: What You Don't Know About Dairy and the Truth About Calcium",
  "description": "Refuting the milk industry’s overwhelmingly popular campaign—“Got Milk?”—which has convinced us that milk is essential, this scientifically based expose proves why we don’t need dairy in our daily diets, how our dependence on it is actually making many people sick, and what we can do to change it.Bolstered by the dairy industry and its successful “Got Milk?” advertising campaign launched in California to help declining milk sales, as well as the government’s recommended dietary guidelines, many Americans view cow’s milk as an essential part of a daily diet, unequaled in providing calcium, protein, and other nutrients and vitamins. Cow’s milk has been promoted as a food without substitute, as being necessary and not interchangeable with foods outside the dairy food group. But as food processing and marketing expert Alissa Hamilton reveals, cow’s milk is far from essential for good health, and for many, including the majority of American adults who can’t properly digest it, milk can actually be harmful.In Got Milked, Hamilton turns a critical eye on the Dairy Food Group and the promotional programs it supports to dispel misconceptions about milk and its crucial role in our health. Interweaving cutting-edge science in a lively narrative, Got Milked opens our eyes to the many ways in which dairy can actually be harmful to our bodies. In addition, the book offers simple and tasty food and drink swaps that deliver the same nutrients found in milk products, without all the sugar, saturated fat and negative side effects.Complete with delicious dairy-free recipes and full meal plans for “Making it Without Milk,” Got Milked is a unique, substantive, and important look into an industry that has hugely impacted our diets and our lives.",
  "genres": [
    "Nonfiction",
    "Health",
    "Food",
    "Science",
    "Cooking",
    "Nutrition"
  ],
  "author": "Alissa Hamilton",
  "average_rating": "3.10",
  "url": "https://www.goodreads.com/book/show/25817218-got-milked"
}