{
  "title": "Hi, Anxiety: Life With a Bad Case of Nerves",
  "description": "Joining the ranks of such acclaimed accounts as Manic, Brain on Fire, and Monkey Mind, a deeply personal, funny, and sometimes painful look at anxiety and its impact from writer and commentator Kat Kinsman. Feeling anxious? Can’t sleep because your brain won’t stop recycling thoughts? Unable to make a decision because you're too afraid you’ll make the wrong one? You’re not alone. In Hi, Anxiety , beloved food writer, editor, and commentator Kat Kinsman expands on the high profile pieces she wrote for CNN.com about depression, and its wicked cousin, anxiety. Taking us back to her adolescence, when she was diagnosed with depression at fourteen, Kat speaks eloquently with pathos and humor about her skin picking, hand flapping, “nervousness” that made her the recipient of many a harsh taunt. With her mother also gripped by depression and health issues throughout her life, Kat came to live in a constant state of unease—that she would fail, that she would never find love . . . that she would end up just like her mother. Now, as a successful media personality, Kat still battles anxiety every day. That anxiety manifests in strange, and deeply personal ways. But as she found when she started to write about her struggles, Kat is not alone in feeling like the simple act of leaving the house, or getting a haircut can be crippling. And though periodic medication, counseling, a successful career and a happy marriage have brought her relief, the illness, because that is what anxiety is, remains. Exploring how millions are affected anxiety, Hi, Anxiety is a clarion call for everyone—but especially women—struggling with this condition. Though she is a strong advocate for seeking medical intervention, Kinsman implores those suffering to come out of the shadows—to talk about their battle openly and honestly. With humor, bravery, and writing that brings bestsellers like Laurie Notaro and Jenny Lawson to mind, Hi, Anxiety tackles a difficult subject with amazing grace.",
  "genres": [
    "Nonfiction",
    "Memoir",
    "Psychology",
    "Mental Health",
    "Mental Illness",
    "Self Help",
    "Biography"
  ],
  "author": "Kat Kinsman",
  "average_rating": "3.64",
  "url": "https://www.goodreads.com/book/show/25817260-hi-anxiety"
}