{
  "title": "Eat Dirt: Why Leaky Gut May Be the Root Cause of Your Health Problems and 5 Surprising Steps to Cure It",
  "description": "National Bestseller Doctor of Natural Medicine and wellness authority Dr. Josh Axe delivers a groundbreaking, indispensable guide for understanding, diagnosing, and treating one of the most discussed yet little-understood health conditions: leaky gut syndrome. Do you have a leaky gut? For 80% of the population the answer is “yes”—and most people don’t even realize it. Leaky gut syndrome is the root cause of a litany of ailments, including: chronic inflammation, allergies, autoimmune diseases, hypothyroidism, adrenal fatigue, diabetes, and even arthritis. To keep us in good health, our gut relies on maintaining a symbiotic relationship with trillions of microorganisms that live in our digestive tract. When our digestive system is out of whack, serious health problems can manifest and our intestinal walls can develop microscopic holes, allowing undigested food particles, bacteria, and toxins to seep into the bloodstream. This condition is known as leaky gut syndrome. In Eat Dirt , Dr. Josh Axe explains that what we regard as modern “improvements” to our food supply—including refrigeration, sanitation, and modified grains—have damaged our intestinal health. In fact, the same organisms in soil that allow plants and animals to flourish are the ones we need for gut health. In Eat Dirt , Dr. Axe explains that it’s essential to get a little “dirty” in our daily lives in order to support our gut bacteria and prevent leaky gut syndrome. Dr. Axe offers simple ways to get these needed microbes, from incorporating local honey and bee pollen into your diet to forgoing hand sanitizers and even ingesting a little probiotic-rich soil. Because leaky gut manifests differently in every individual, Dr. Axe also identifies the five main “gut types” and offers customizable plans—including diet, supplement, and lifestyle recommendations—to dramatically improve gut health in just thirty days. With a simple diet plan, recipes, and practical advice, Eat Dirt will help readers restore gut health and eliminate leaky gut for good.",
  "genres": [
    "Health",
    "Nonfiction",
    "Food",
    "Nutrition",
    "Self Help",
    "Audiobook",
    "Science"
  ],
  "author": "Josh Axe",
  "average_rating": "4.03",
  "url": "https://www.goodreads.com/book/show/25817770-eat-dirt"
}