{
  "title": "Our Kiss",
  "description": "Chasing after heartfelt dreams and finding true love are two of life’s most thrilling and daunting challenges. Follow along with Emma Morgan as she searches to discover what true love really is—all the while, trying desperately to rediscover her own true self along the way. A heartwarming, insightful story of self-discovery, missed opportunities, second chances, and rekindled love. A lowly legal intern, Emma toils under the yoke of her powerful father at his prominent Midtown Atlanta law firm. Her boyfriend is a gorgeously handsome rising legal superstar that her father just adores. Everything about her life is going as they have it planned—for her. Emma desperately wants to find some deeper meaning to her carved-in-stone life. With each passing day, she feels more hopeless, hardened, and alone. Nothing would make her happier than finding true love—some spark of burning passion that would give her the courage to finally break free. David was her secret crush since childhood. But everything conspired to keep them apart. Age, distance, social class, and a tragic plane crash in Paris that ripped away his parents when he was just a child—leaving him with painfully deep emotional scars. Not able to recover, he threw caution-to-the-wind and embarked on a wild carefree lifestyle. After finally hitting rock-bottom, remorseful over what should have been, he is now desperate to somehow save Emma from making the same mistakes—missing the opportunity to find happiness, and true love. They only have one thing in common—a love of the arts. It is the only way David can touch her heart with enough passion, to force her to reevaluate her life, to feel passionate once again—to be real. Using his master skills of sculpting learned from his mother, he struggles to create the ultimate expression of love—one that is carved in stone. A story as old as time—told with a new twist—Our Kiss is not just another love story—it’s a masterpiece.",
  "genres": [],
  "author": "J.A. Alldredge",
  "average_rating": "3.62",
  "url": "https://www.goodreads.com/book/show/25825446-our-kiss"
}