{
  "title": "The Shell Seeker",
  "description": "In South Carolina, there’s more than magic in the air. Now policewoman Lei Texeira must solve the case of the Pirate Necklace.  The famed emeralds, spirited in the 1700s from the pirate Blackbeard’s ship, have been snatched once again. This time, the bling was taken from Marie-Therese Belvedere, a woman whose cruelty is only topped by her arrogance.  Lei doesn’t care for the icy socialite, but she feels an instant connection with the woman’s stepdaughter. An unlucky star has followed Sydney Belvedere her entire life. If the necklace isn’t found, she’ll lose a treasure more dear than the finest gem.  Only the magic of Lei’s intuition stands between Sydney and unspeakable loss.  Q & A with the Author  What was the inspiration behind The Shell Seeker?  I wanted to add elements of fantasy and magic to the Lei Crime series of police procedurals, which are set squarely in the mystery & thriller genre. As Lei evolves throughout the series, she carries grief and a sense of loss due to an abusive childhood. I enjoy writing stories that inspire readers to view the world in a positive light, and felt Lei’s background provided the perfect elements for an uplifting read. In The Shell Seeker, Lei continues to heal wounds she’s carried for most of her young life as she connects with a kindred soul, Sydney Belvedere.  When does The Shell Keeper take place?  The story follows directly after the events in The Shell Keeper (Lei’s Magic, Part One). Thanks to Pixie Delacorte, the psychic hostess at the Bed & Breakfast, Lei is drawn into solving the case of the stolen Pirate Necklace.  What motivated you to write in the Lei Crime World?  I adore Toby Neal’s superb Lei Crime novels. I’m an adoptive parent, and the troubled family life surrounding Toby’s unique protagonist, Lei Texeira, are issues close to my heart. When I heard Lei Crime would become a new Kindle World, I jumped at the chance to contribute.",
  "genres": [],
  "author": "Christine Nolfi",
  "average_rating": "4.64",
  "url": "https://www.goodreads.com/book/show/25825007-the-shell-seeker"
}