{
  "title": "\"Battered, Bruised, and Inhumanly Beaten\"",
  "description": "To come to the study of wife torture (not \"wife abuse,\" not \"domestic violence\") by way of the 17th century is to come face to face with an unpleasant its persistence reveals the depth of men's hostility towards women. It was for many men a bonding experience. \"If you want to know what men really think of women,\" Thomas Wentworth Higginson told a Women's Rights Convention in 1856, \"you must follow your young admirer from the ball room into the bar room, where he ridicules you among his companions.\" Henry B. Blackwell thought contempt for women pervaded society \"like an atmosphere.\" In that male world which encouraged violence and disrespect for women. there was value in public wife beating and no stigma attached to it. Most men were incapable of committing the barbarities they read about in their daily newspapers, but they were content to allow others to punch, to kick and in other ways assault their wives--and by their inaction they signified their approval. Because of their complacency, a large number of married women lived much of their lives in fear, anticipating their husbands' beatings as the almost inevitable consequence of sharing a home. Ray Rice's public assault on his fiancée in February 2014 and its subsequent trivialization by the NFL leadership focused attention on the widespread problem of wife torture in contemporary America. There has been so much exposure that some people are optimistic or at least hopeful that at last solutions will follow. This series demonstrates very clearly the need to be skeptical. We have been in this position before. Because of both the temperance crusade and the women's rights movement, the nineteenth century witnessed an intense and prolonged examination of wife abuse. Violence against wives was declared illegal, condemned--and tolerated. An essential argument of these essays is that virtually nothing is being said today that wasn't said 100 or 200 years ago. Readers will recognize the similarities, testimony of the continuing existence of a culture of violence and evidence of a need to be vigilant. Women will have to keep the public gaze unflinchingly focused on tortured wives, on the men who torture them, and on the society which continues to nurture a high level of violence. I begin with the 17th century.",
  "genres": [],
  "author": "Jerome J. Nadelhaft",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/25828025-battered-bruised-and-inhumanly-beaten"
}