{
  "title": "You, UNLEASHED!: Building a Success Mindset, Overcoming Obstacles, and Living a Life That Matters",
  "description": "Don't read any further if you're happy with struggling with obstacles in your life. Stop, if you're content with seeking, but not finding a success mindset. Don't go on, UNLESS, you want to learn to really live a life that matters!Are you:- Frustrated with the obstacles that are keeping you from living a successful life, regardless of your situation?- Confused about what success and a success mindset really are and how to get one? Do you want to live a life that really matters, regardless of your age, background or experience? Every day we face obstacles that keep us from becoming who we were made to be. Sometimes these obstacles result from other people's actions, but most of the time we cause them! Most people have lived with these obstacles for so long they're blind to them. Or worse, they've simply accepted them as part of who they are.STOP! You don't have to live with these obstacles holding you back any longer and you can overcome them! Confidence and success are available to everyone if you're willing to put in the work. When you're ready, Jonathan Cragle shows you how! Get UNLEASHED and make a difference in your world today! Learn the foundational pieces that everyone needs to succeed in their lives. The book is written in 3-parts, in which readers are challenged to rethink their own perspectives with fresh insights and stories.Mr. Cragle distills struggles that exist in people's lives into easy to understand and powerful stories that take us from the 1964 Olympics, to the daily life of a single mother and her son who lives with Spinal Muscular Atrophy; from a CrossFit gym to a woman who has fully lived and persevered with Parkinson's disease for 42 years!This stirring book is filled with stories; action plans and motivation sure to help you finally find and live a successful and free life that matters!Join Jonathan Cragle on this exciting journey to crushing your limiting beliefs and becoming a more confident and giving person. Make a huge impact on your world and those around you starting today!",
  "genres": [
    "Self Help"
  ],
  "author": "Jonathan Cragle",
  "average_rating": "3.94",
  "url": "https://www.goodreads.com/book/show/25833276-you-unleashed"
}