{
  "title": "Ruined",
  "description": "The duke of Ashton sits at the Opera at Vauxhall Gardens, bored out of his mind, and plans murder.He curses the day that brought the little governess, destitute and sad, at his door eight months ago, to upset his careless if a bit meaningless existence. How could he have guessed the terrible, evil secrets she was hiding? And now that he knows all, the truth appears wilder, even more despicable than even he could have imagined. He hadn’t counted on losing his heart to her, of course, but he did.What he doesn’t know is that a tendril of the shadows of madness and sin that followed Beatrice to his door is still out there, looking for something to devour.The only one who can save him from the darkness is the girl herself, but he knows he’ll never see her again. He who once prided himself on his indifference to other human beings, feels his chest constrict with pain every time he even thinks of her. Beatrice, smart, gentle, kind-hearted, lovely.Ruined. A perfect blend of darkness and light, this Regency retelling of Jane Eyre will break your heart as well as uplift it.Reader Reviews for RuinedThis book reminds me of These old shades [by Georgette Heyer]. You are a terrific writerand your characters are beautifully written. I enjoyed it a lot and now youhave a fan!~Eyregirl I am so hooked...~Sam Lovely story -compelling twist on a classic, beautifullywritten prose, believable and great pacing. ~Theresa This is an interesting take [on a classic tale] and M.C. Frank writes it very well. Her turn of phrase is lovely and thedetailing is particularly good. ~NBRobertsThe writing was gorgeousand everything from the setting to the character development...was pretty muchperfect. I loved it. It was so beautifully written and grabbed me rightfrom the very first paragraph. It truly was such a wonderful experienceto get to know Beatrice and Dominic.~ThisBookish Endeavor on youtube",
  "genres": [
    "Historical Fiction",
    "Romance",
    "Retellings",
    "Historical",
    "Regency",
    "Fantasy",
    "Fiction"
  ],
  "author": "M.C. Frank",
  "average_rating": "3.85",
  "url": "https://www.goodreads.com/book/show/25831278-ruined"
}