{
  "title": "GoneGodWorld, Episode Three",
  "description": "Episode Three...  What a day! After some strange 'Other' blew up the One Spire Inn and killed his friend, Jean-Luc spent the last few hours trying to figure out what's going on. Lucky for him, he is friends with the angel Penemue and the succubus Astarte—two creatures older than most mountains. Unlucky for him, the insane creature that's causing havoc in his city is the one and only Avatar of Gravity, a being as old as the universe itself...  GoneGod damn—a lot can happen in a day...  The gods are gone. All of them.  Their last message to humanity was: \"Thank you for believing in us, but it is not enough. We're leaving. Good luck.\" At first no one took them seriously. Until, that is, all the denizens of all the heavens and hells started showing up on people's doorsteps.  Creatures that were once thought of as myth are now refugees striving to adapt to life on earth. Trouble is, after eons of living forever, they're not very good at being mortal.  Caught in the middle is Jean-Luc, a struggling hotelier who (reluctantly) promised to help these 'Others' live in this new GoneGod world. But taking care of his guests, keeping his hotel afloat and dealing with the constant drama of the Others' lives is figuratively killing him. And now that an unusually strange Other is in town, his figurative demise might soon become more literal.  Paradise Lot is a new urban fantasy series by R.E. Vance that chronicles the adventures of the humans and 'Others' alike, as they struggle to navigate this strange, new post apocalyptic godless world.   The Cast: - The human Jean-Luc; - The angel Penemue; - The gorgon Medusa; - The fairy TinkerBelle; - The archangel Michael; - The succubus Astarte; - The poltergeist Judith; - The shade Bella...  and many, many more legendary characters from mythology, folklore and fairy tales.    For a limited time only - EPISODE ONE is only 0.99c or completely FREE on Kindle Unlimited!     PLUS BE SURE TO CHECK OUT THE SPECIAL BONUS BEING OFFERED IN THE FRONT OF THE BOOK!",
  "genres": [],
  "author": "R.E.  Vance",
  "average_rating": "4.51",
  "url": "https://www.goodreads.com/book/show/25833944-gonegodworld-episode-three"
}