{
  "title": "Sinners & Saints",
  "description": "“Every saint has a past, and every sinner has a future.” – Oscar Wilde Juliet From the first moment I saw him, I knew he was it for me… even if he didn’t. The most beautiful boy I have ever seen has become my obsession and yet I am perfectly fine with it. I was born with a warm heart… but a strong one at that. Scarlett They call me a bitch; they say I’m cruel, vindictive, and evil beyond repair… and they’re right. Frankly, I don’t find anything wrong with that. I believe people should be more like me. Life is so much easier when you shut off all the emotions that cause you to care. I am simply a woman who gets what she wants and what I want is for everyone to know their place. Hugo Most people feel sorry for my father. Jonathan Mandrake. Wife and son are dead. Remaining sons might as well be dead. One is autistic and the other is the devil. If you haven’t guessed by now, I’m not the twin with autism. That’s my brother, August. We are a mirror image of each other but due to bad luck, we are complete opposites. My father is a prick—don’t let the smile fool you. My brother is one of the few people I tolerate and like. The only person who’s ever really understood me is Scarlett. The closest thing I have to a parent is Ms. Eleanor, my temporary guardian. When wealthy parents don’t want to leave their children home alone to embarrass the family name, they send them to her, not caring that her head is full of nothing but butterflies, rainbows, Bloody Mary’s, and young Latin men. Aside from my brother, I also live here with Jordana Abbott, the only girl I haven’t slept with because she's a lesbian; Poppy Montgomery, who loves pink and pills; and Cody Nichols, a virgin—poor bastard. But now we have added a new resident. I call her the English Rose. She’s beautiful, British… and very annoying. Scarlett wants me to break her, but something tells me there is no breaking this girl. So I won’t bother. Unfortunately, along with being unbreakable, Juliet Spears is also persistent when it comes to things she should not delve into… which is me.",
  "genres": [
    "New Adult",
    "Romance",
    "Contemporary",
    "Young Adult"
  ],
  "author": "Chelsea Ballinger",
  "average_rating": "4.26",
  "url": "https://www.goodreads.com/book/show/25833508-sinners-saints"
}