{
  "title": "Rise Siren Five",
  "description": "Rise Siren Five Book 1 of the Disclosure SeriesAmazon Kindle Editionhttp://www.amazon.com/dp/B00XTALKJISci-Fi for Grown Ups - Sleek, Sexy, Sci-Fi Action ThrillerThe Blackest of Ops. The Hottest of Connections. The Most Coveted Asset in the Cosmos. Cooper Pierce is the best Off-World Black Ops Agent modern day Earth has known. He returns to us now with the beautiful Moethiican, Rise. Code Name Siren Five. But deeply laid plots, secret players, and the smoldering heat between Cooper and Rise could change everything. Rise Siren Five is a sleek, sexy Sci-Fi Action Thriller. Suspense, Action & characters that draw you in; this is intelligent, emotive, playful Sci-Fi with thrills, intrigue and heat.BOOK JACKETIs he feeling her? Or Still Feeling Them?Cooper Pierce is the best Off-World Black Ops Agent our world has ever known. Undercover with the cruel and powerful Echelon, he has discovered the most coveted asset in the cosmos. The beautiful Moethiican, Rise. Code Name SIREN FIVE.She is the only being in the known worlds able to open the Veil Portal shimmering above Earth. The most powerful beings in the Cosmos wait behind it. Our true Makers among them. But four equally beautiful and powerful Sirens before her have failed. Will she be any different?And Cooper has been undercover with the Echelon longer than is safe for him. They are predators. The pet military of the Old Ones. Dark powers, dark appetites, dark magic. Ones like Rise are given to them as soon as they come of age. To do with what they will. To indulge every dark desire.To see if one like her, is the Siren.And if the Old Ones control the Siren, they will control everything.From the far reaches of the Cosmos to modern day Earth, deeply laid plots, secret players, forbidden worlds and unlikely alliances all hurtle towards the anticipated Veil Opening and the final war.And all the while, the connection between Cooper and Rise keeps getting hotter and hotter. In the end, will it be this that changes everything?Rise Siren Five is a sleek, sexy, Sci-Fi Action Thriller. Suspense, Action & characters that draw you in; this is intelligent, emotive, playful Sci-Fi with thrills, intrigue and heat.",
  "genres": [],
  "author": "S.S. Delaunay",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/25834433-rise-siren-five"
}