{
  "title": "Picking Up the Pieces",
  "description": "A shattered heart. A damaged soul. A second chance. A journey of learning to love again, battling to pick up all the pieces.  Ellie finally found her knight in shining armour. She thought she had her happily ever after. But of course, not all stories have a happy ending, and tragedy strikes in the worst form. Widowed at twenty-four, she turns to her old friend tequila. Her best friend and fellow nurse leaves England to start a new life in Vancouver, Canada, but not before inviting Ellie to join her. Both agree this could be the fresh start she needs. A way to escape her haunting memories. Unfortunately, life has other ideas and throws Ellie a new set of trials. The biggest one being Kyle—“Prez” of the Angels of Death MC. Kyle’s life is the MC… and his kid brother. He doesn’t do relationships. He doesn’t do love. But fate throws a feisty Brit in his path, with more baggage than a Boeing 747. Not only does Ellie manage to crawl under his skin, but she manages to unintentionally crawl her way into his normally stone-cold heart. “He didn’t even notice my scars. If he did, he looked straight through them. I knew right then all he could see was me. All of me. My hurt, my pain, my flaws, my conflict, my desire, my love… all the craziness that made my brain tick. He saw me. Only me.” Ellie finds herself on a journey of self-discovery as she not only has to come to terms with her past, but has to learn how to love again and accept her future. Kyle has to follow his own path and realise he is capable of love and there’s more to life than the club. “Who was I trying to kid? She was mine. She was mine the moment I saw her, packing my kid brother’s bullet wound in the middle of a hospital waiting room. She just didn't know it yet.”",
  "genres": [
    "Abuse",
    "Contemporary Romance",
    "Romance"
  ],
  "author": "E.L. Green",
  "average_rating": "3.90",
  "url": "https://www.goodreads.com/book/show/25845119-picking-up-the-pieces"
}