{
  "title": "Love After Dark",
  "description": "Paul Martinez has been run ragged by the demands of managing the family’s landscaping business and his mother’s battle with dementia. It’s been so long since he had sex, he can’t remember the last time. The arrival of nurse Hope Russell brought some badly needed help to Paul and his brother Alex in managing their mother’s illness, but Hope’s presence has sparked a whole new problem for Paul—lusting after one of his employees, something his late father would never condone. Hope and her young son Ethan badly need this second chance on Gansett Island, and she’s determined to make her new job work for both of them. Kissing her boss, however, was not part of the plan. The more time she spends with Paul, the more she admires the way he cares for his mother and the attention he pays to her son. But when Paul finds out about her shameful past, will he still want her and Ethan in his life? Come back to Gansett Island to find out what’s going on with all your favorite characters, including Mac and Maddie, Seamus and Carolina and the rest of the Gansett crew. Weeks before Alex and Jenny’s long-awaited wedding, Alex begins to worry that his bride is getting cold feet—or is something else going on? It’s September on Gansett where the days are cool, bright and sunny and the nights are hot and sexy! Gansett Island Reading OrderMaid for Love (Mac & Maddie)Fool for Love (Joe & Janey)Ready for Love (Luke & Sydney)Falling for Love (Grant & Stephanie)Hoping for Love (Evan & Grace)Season for Love (Owen & Laura)Longing for Love (Blaine & Tiffany)Waiting for Love (Adam & Abby)Time for Love (Daisy & David)Meant for Love (Jenny & Alex)Chance for Love, A Gansett Island Novella (Jared & Lizzie)Gansett After Dark (Owen & Laura)Kisses After Dark (Shane & Katie)Love After Dark (Paul & Hope)Celebration After Dark (Big Mac & Linda)Desire After Dark (Slim & Erin)Light After Dark (Mallory & Quinn)Victoria & Shannon (Episode 1)Kevin & Chelsea (Episode 2)A Gansett Island Christmas NovellaMine After Dark (Riley & Nikki)Yours After Dark (Finn & Chloe)Trouble After Dark (Deacon & Julia)Rescue After Dark (Mason & Jordan)",
  "genres": [
    "Romance",
    "Contemporary Romance",
    "Contemporary",
    "Chick Lit",
    "Adult",
    "Fiction",
    "Family"
  ],
  "author": "Marie Force",
  "average_rating": "4.44",
  "url": "https://www.goodreads.com/book/show/25839475-love-after-dark"
}