{
  "title": "Of the Conduct of the Understanding & On Human Understanding",
  "description": "Of the Conduct of the Understanding Locke's treatise Of the Conduct of the Understanding differs significantly in style and format from its predecessor, Some Thoughts Concerning Education. The Thoughts took form in a series of letters to Edward Clarke on the rearing of his children, and the work itself bears the characteristic marks of its origin: it is loosely drawn, often repetitive, and generally informal in tone. The Conduct, on the other hand, was initially conceived as an addendum to the Essay Concerning Human Understanding, and is in the character of that Essay, although at the same time more systematic and more abstruse. It can be read, as Mr. Garforth points out, both as an extension of the Essay, indicating the practical implications of the doctrines set forth there, and as a complement to the Thoughts, elaborating in particular those principles that apply to the cultivation of the intellect.Yet the cast of the Thoughts and the Conduct is essentially the same. Taken together, they stand squarely within the tradition of Elyot's Governour, Brathwait's English Gentleman, and Chesterfield's Letters, as courtesy books addressed to the problem of educating a ruling class. They assume, in the fashion of the genre, that the ideal training for leadership takes place, not in schools and universities, but within the family, and they sketch the principles for making that training noble, responsible, and effective. On Human Understanding First appearing in 1690 with the printed title An Essay Concerning Humane Understanding, An Essay Concerning Human Understanding by John Locke concerns the foundation of human knowledge and understanding. He describes the mind at birth as a blank slate (tabula rasa, although he did not use those actual words) filled later through experience. The essay was one of the principal sources of empiricism in modern philosophy, and influenced many enlightenment philosophers, such as David Hume and George Berkeley.ABOUT THE AUTHOR:John Locke, widely known as the Father of Liberalism, was an English philosopher and physician regarded as one of the most influential of Enlightenment thinkers. Considered one of the first of the British empiricists, following the tradition of Francis Bacon, he is equally important to social contract theory. His work had a great impact upon the development of epistemology and political philosophy. His writings influenced Voltaire and Rousseau, many Scottish Enlightenment thinkers, as well as the American revolutionaries. His contributions to classical republicanism and liberal theory are reflected in the American Declaration of Independence.Locke's theory of mind is often cited as the origin of modern conceptions of identity and the self, figuring prominently in the work of later philosophers such as Hume, Rousseau and Kant. Locke was the first to define the self through a continuity of consciousness. He postulated that the mind was a blank slate or tabula rasa. Contrary to pre-existing Cartesian philosophy, he maintained that we are born without innate ideas, and that knowledge is instead determined only by experience derived from sense perception",
  "genres": [],
  "author": "John Locke",
  "average_rating": "4.20",
  "url": "https://www.goodreads.com/book/show/25844831-of-the-conduct-of-the-understanding-on-human-understanding"
}