{
  "title": "Tammy and the Declaration of Independence",
  "description": "Flesch-Kincaid Reading Grade Level is 4.7 suitable for 9 to adult readers. This edition is the full length 18,500 word edition. An abbreviated edition for 8 1/2-12 is available with 7,000 words. Another edition for 9-10 age readers contains 2200 words. Follow alongside of ten-year-old Tammy Wurtherington, the little doll girl from River Falls, Ohio in this exciting new adventure that is sure to delight any youngster. Her cute associates, Cedric the Mongoose, Zeke the orphaned opossum, and Alfred the mouse accompany her in this trip through history in which they must see that the space-time continuum is maintained and the Declaration of Independence is signed on July Fourth, 1776. The emphasis is on telling a spell binding story that will leave any reader with a firm understanding of the events that led to the signing of the Declaration of Independence and the reasons for the Revolutionary War. As with all the Wurtherington Diary books, this one abounds in developing worthwhile feelings for its young readers. Things like honesty, compassion, and respect for others abound on very page. The reader will be alongside of the leaders of the Revolutionary War as they reach the decisions that will make them true heroes in the minds of historians. Tammy becomes a part of the rebel minutemen and joins the spy network that led to Paul Revere's famous ride in which he declared, \"The British are Coming!\" Ride along with Tammy and Paul Revere and then witness her account of \"The Shot Heard Around the World?\" in Lexington. Historians have long agued as to exactly who fired that first shot that began the Revolution War. Tammy's accounting settles the issue for all time. You will be there on a hot summer day in Independence Hall when the Committee of Five, Thomas Jefferson, John Adams, Ben Franklin, Roger Sherman, and Robert Livingston are nominated to write the Declaration of Independence. Take part in the discussions during the three weeks in which they created what many believe to be the most important words in the history of the English language. The reader will be see how Tammy assisted Betsy Ross and George Washington in creating the first American flag. And exactly how did that crack in the Liberty Bell occur? Whether you are a young reader or a parent/educator, everyone will enjoy this remarkable tale of a wonderful little girl who became a legend in her efforts to \"nudge\" history and see that the American Revolution began without a hitch",
  "genres": [],
  "author": "Reynold Jay",
  "average_rating": "4.60",
  "url": "https://www.goodreads.com/book/show/25844162-tammy-and-the-declaration-of-independence"
}