{
  "title": "The Matriarch of Ruins",
  "description": "Prepare to be immersed in the toil and triumphs into whose lives you step.In Book 1, NOT ONE AMONG THEM WHOLE, a novel of Surgeons and the Wounded at Gettysburg, the harrowing story of life at the front edge of a 19th century battlefield hospital was told. Now, from the author of that acclaimed novel, comes the story of the civilians among the wounded in that surreal time: THE MATRIARCH OF RUINS, a novel of civilians and the wounded at Gettysburg. Husbands and wives.Sons and daughters.Soldiers and surgeons.Men and slaves.Widows and ghosts. The living and the dead come alive in this epic novel of a widow struggling to keep her family together amid the carnage of the Battle of Gettysburg—and the memories of her dead husband. A story of ordinary folks caught in the maelstrom of an extraordinary time. It is 1863 and the war has come home to the Gamble farm in Southern Pennsylvania. With her husband buried under the willow tree in the back yard, and only four months in the ground, the widow Purdy Gamble must cope with losing him all over again when a rebel surgeon conscripts her farm—and Purdy’s growing respect despite herself. Hannah Gamble Griel, Purdy’s daughter, disappears into the chaos of war to chase her own ghosts, both imaginary and real. And then there are the twins Loli and Coal, just fourteen. One, struck dumb by a mule kick at age five, will find a disturbing peace amid the flames of war. The other will twice save a man’s life, unburying a horrid family secret in the process—a secret at once as alive as warm flesh and as dead as cold bones mouldering under the earth.  The Matriarch of Ruins is a haunting story of lost love, moral dilemmas, and psychological traumas amid the ruins of war. This is a vivid, suspenseful tale, told with heart-breaking empathy and stunning detail. Available today for the Amazon Kindle. Soon in paperback as well. From Northampton House Press.",
  "genres": [],
  "author": "Edison McDaniels",
  "average_rating": "4.75",
  "url": "https://www.goodreads.com/book/show/25854659-the-matriarch-of-ruins"
}