{
  "title": "And After Many Days",
  "description": "An unforgettable debut novel about a boy who goes missing, a family that is torn apart, and a nation on the brinkDuring the rainy season of 1995, in the bustling town of Port Harcourt, Nigeria, one family's life is disrupted by the sudden disappearance of seventeen-year-old Paul Utu, beloved brother and son. As they grapple with the sudden loss of their darling boy, they embark on a painful and moving journey of immense power which changes their lives forever and shatters the fragile ecosystem of their once ordered family. Ajie, the youngest sibling, is burdened with the guilt of having seen Paul last and convinced that his vanished brother was betrayed long ago. But his search for the truth uncovers hidden family secrets and reawakens old, long forgotten ghosts as rumours of police brutality, oil shortages, and frenzied student protests serve as a backdrop to his pursuit.In a tale that moves seamlessly back and forth through time, Ajie relives a trip to the family's ancestral village where, together, he and his family listen to the myths of how their people settled there, while the villagers argue over the mysterious Company, who found oil on their land and will do anything to guarantee support. As the story builds towards its stunning conclusion, it becomes clear that only once past and present come to a crossroads will Ajie and his family finally find the answers they have been searching for.And After Many Days introduces Ile's spellbinding ability to tightly weave together personal and political loss until, inevitably, the two threads become nearly indistinguishable. It is a masterful story of childhood, of the delicate, complex balance between the powerful and the powerless, and a searing portrait of a community as the old order gives way to the new.",
  "genres": [
    "Fiction",
    "Africa",
    "Nigeria",
    "African Literature",
    "Literary Fiction",
    "Contemporary",
    "Historical Fiction"
  ],
  "author": "Jowhor Ile",
  "average_rating": "3.43",
  "url": "https://www.goodreads.com/book/show/25852858-and-after-many-days"
}