{
  "title": "Down Under Complete Trilogy Box Set",
  "description": "++ This Box Set is not intended for readers below the age of 18+ due to strong language and sexual content ++  The complete Down Under Trilogy Box Set - Limted Edition  Head Down Under with the hot and demanding Alpha that is Max Wild. The box set includes:  ~ Escape Down Under: For Jess Townsend, life is about to get complicated.  Following on from her split with Josh two months ago, Jess has thrown herself into her work full throttle, making sure that the one good thing in her life remains the same.  Suddenly she is called into an important meeting at work. Absolutely petrified that she is about to lose her job, she does the only thing she knows how. Panic on the inside and walk through it with her head held high on the outside.  Jess soon discovers she is being offered a once in a lifetime opportunity, but will she take it?  After dealing with an ex who can't let go and a broody mysterious Adonis who won't accept no for an answer, maybe the opportunity of an escape has arrived at the perfect time.  What does fate have in store and what obstacles will be thrown her way?  ~ Fallen Down Under: \"F**k.\" I slam my fist into the desk before me and feel nothing but rage. I need to go after her. I need to explain. \"But isn't this what you wanted?\" The voice inside my head whispers. \"Isn't this a nice easy way out?\"  Everything Max has done has always been at a cost to others around him. He wasn't about to make that mistake again. No longer will his selfish ways punish those close to him. Sometimes it's better to have had and lost than to never have had at all.  Finally after what felt like forever, Jess was getting a glimpse of control over her life again and allowed her defences to come crashing down, only to have what it guarded to be crushed once again. Now, on the other side of the world away from her friends, she doesn't know what to do.  Should she stay or should she go?  Is it too late or have they both fallen too far into something that is completely out of their depths?  ~ Forever Down Under: In the last few months, Jess has been faced with more obstacles than she ever thought possible. Heartbreak, loss and betrayal to name just a few. Will her drama fuelled life finally settle into the happy, care free one that she deserves or is someone hiding and waiting for the perfect opportunity to ruin it all?  Life for Max hasn't exactly been plain sailing either. Now that he finally has someone in his life that means more to him than anything he has ever known, one thing is for certain, he's not going to let anyone get in the way of his new found happiness, no matter what the cost.  Demons are released, pasts are exposed and their future together is only what they make of it.",
  "genres": [],
  "author": "S.M.  Phillips",
  "average_rating": "4.38",
  "url": "https://www.goodreads.com/book/show/25847573-down-under-complete-trilogy-box-set"
}