{
  "title": "Artists Cookbook: True Artists Cook to Taste",
  "description": "A recent movement in cooking focuses on art-oriented food. This well photographed art-oriented food book organizes recipes from a social perspective: -food is fuel, -food as art, -food makes friendships, and -food for more at the door. In other words from an artist's point of view cooking solo, for patrons, for friends, for gatherings.  Working in the studio for who knows how long, auurlh, a stomach growls to attention. No matter. The art habit is always fed first. To brave on in hunger, even starvation, arreeowrauh! — Oh quick, what to eat to be back in a flash? — Or maybe a studio friend comes, what food will stimulate a cultural conversation? — Or what feast to make friends with a potential patron or family? — Or what to cook if there are hordes at the door? Such is the formal arrangement of this art-oriented food book.  This is not a cookbook ordered by appetizers, main dishes, and desserts. It is irrational – how you meet society through food, beginning with yourself, cooking to taste, and somewhat irrationally eating well.  Not fancy-shmancy, the Artists Cookbook is about art-oriented cooking. What working stiffs eat, who are also artists. Such artists grapple with the irrational whims of muses who want something immediate one minute, then something pleasurable the next. Then again, the muse may run leaving you alone to fend off the visits of hungry masses. These existential problems are solved differently by actual artists: the solo creator, a band of musicians, those in need of a book full of meals for friends of significant influence, and those planning a festive feast to honor an art teacher, or even a shouting yard party involving a whole neighborhood.  Art-oriented cooking always aspires. We have seen food eras called natural, organic, vegetarian, raw, regional vs fusion, dietist, seasonal, sustainable, farm-to-table, (seed-to-mouth?), modernist, and paleo. However, art-oriented cooking knows no bounds in space or time. It aims at sensual excellence; at times, in the simplest of transformations of nature into art. Of great surprise in assembling the treasury for the chapter Food As Art, was finding that modern artists tended to share dishes from the historic past, recipes often forgotten. To be art-oriented in cooking is to eternally focus on the senses, particularly the nose, tongue, and mouth. The true artist cooks to taste.  This treasury of recipes, favored by the art community, is tested and perfected by fine artist Mark Richard Beaulieu with the help of culinary expert Joanna Beaulieu. The book draws on half a dozen professional artists: painters, musicians, writers, photographers, software engineers, and chefs.",
  "genres": [],
  "author": "Mark Richard Beaulieu",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/25851645-artists-cookbook"
}