{
  "title": "Treachery at Lancaster Gate",
  "description": "Gripping and provocative, the latest Thomas and Charlotte Pitt mystery by New York Times bestselling author Anne Perry peers unflinchingly into the corrupt affairs of Victorian society on the brink of the century s turn. The world is poised for social and political change, but England holds tight to its traditions, classes, and prejudices.  When an explosion in London kills two policemen and seriously injures three more, many believe that anarchists are the culprits. But Thomas Pitt, commander of Special Branch, knows the city s radical groups well enough to suspect that someone with decidedly more personal motives lit the deadly fuse. As he investigates the source of the fatal blast, Pitt is stunned to discover that the bombing was a calculated strike against the ranks of law enforcement.  But still more shocking revelations await, as Pitt s inquiries lead him to a member of Parliament hoping for a lucrative business deal, a high-ranking police officer with secrets to keep, and an aristocratic opium addict seeking murderous revenge. As he pursues each increasingly threatening lead, Pitt finds himself impeded at every turn by the barriers put in place to protect the rich and powerful barriers that, as they start to crumble, threaten to bury him alive. Praise for Anne Perry s most recent Charlotte and Thomas Pitt novels\nThe Angel Court Affair\n Be prepared for another well-deserved vacation to Victorian London with Anne Perry as the most cunning tour guide you will ever need. . . . She is one of the best.  Bookreporter \nDeath on Blackheath\n Thoroughly enjoyable and entertaining . . . The period detail is beautifully done, and realistic characters and tense action are woven seamlessly together.  Historical Novels Review\nMidnight at Marble Arch\n  Sweeping and scandalous . . . Perry has perfected a delicate touch.  The New York Times Book Review \nDorchester Terrace\n The always clever Anne Perry infuses Dorchester Terrace with the right amount of intrigue and complex relationships that have made this prolific series one of the finest in modern mystery fiction.  Bookreporter\nTreason at Lisson Grove\n Perry has always done her historical homework on the darker elements of the British ruling class, and she has outdone herself this time. \n The Washington Times\n From the Hardcover edition.\"",
  "genres": [
    "Mystery",
    "Historical Fiction",
    "Historical Mystery",
    "Fiction",
    "Audiobook",
    "Victorian",
    "Historical"
  ],
  "author": "Anne Perry",
  "average_rating": "4.06",
  "url": "https://www.goodreads.com/book/show/25852854-treachery-at-lancaster-gate"
}