{
  "title": "Fade",
  "description": "There are these moments when everything is so bad you are certain that this isn’t really your life.Like, maybe this is just a nightmare and any moment you are going to wake up and the absolutely horrible thing you are facing is in fact just a repulsive piece of your subconscious trying to invade the rest of your mind.Then you open your eyes.And it’s all real. Blu is living her worst nightmare. Having had dark fantasies of murder and torture for years, Blu is certain that she is being cosmically punished when she is taken captive by human traffickers.My entire life I learned how to read people, and then how to manipulate those people into believing whatever I wanted them to believe. Before my mama passed, she used to say I had the face of an angel and the heart of the devil.Rhys is the president of the Black Lilies motorcycle club and living a double life as a contract killer. He is happy living a life distanced from people and living out his dark fantasies. She had a look which resonated as a combination of fierce and yet amused by his pain.It was exquisite. Once Blu and Rhys meet, everything changes. Together, they are a nefarious and unstoppable force.  The typical story would dictate that I meet the man, we fall in love, and we ride happily into the sunset to live forever in a state of perpetual bliss.Love. What the hell did I know about love? It’s this mystical, magical thing supposedly existing in the world. My life and my darkness had shown me nothing but facades, bleakness, and empty nothingness. Perhaps the old me could have believed in love. But the old me is gone. Faded away into the never-ending abyss of the universe never to be seen again. The new me is just broken.Broken people don’t love.This is not your typical love story. This is the story about the universe putting someone in your path as dark as you, of embracing your true nature, and of the sweet joy of carnage. ***Author's Note***This story is a very dark romance which contains graphic rape and violence scenes. There are intense scenes of murder and torture. This book is not for the faint of heart. You have been warned.",
  "genres": [
    "Dark"
  ],
  "author": "Claire  Phoenix",
  "average_rating": "3.83",
  "url": "https://www.goodreads.com/book/show/25853901-fade"
}