{
  "title": "Smartbrain",
  "description": "A 2016 Next Generation Indie Book Awards “Finalist” ~ Science fictionNew Consumer Tech: SMARTPHONE STREAMS DIRECTLY INTO HUMAN BRAINSmartbrain-an eerily predictive, 2-part NovelPart 1: Mind Sarah Whiting, young, attractive, tech-savvy homebody, accepts a potentially lucrative offer to join a product/market analysis team that is performing the final evaluation of the believed technological breakthrough of the century before its release to the public. As the incredible opportunity unfolds, Sarah finds herself smitten with the technology, as well as with the project’s lead engineer. Even with the contrast of taking care of her Alzheimer’s-ridden father, it all seems like a dream-come-true for Sarah. That is, until she abruptly learns that she may now be unwittingly mired in a dangerous ruse of international deception, and that the man she’s fallen for, as well as this new, highly transformative technology may originate from somewhere else, other than Earth.Part 2: MatterSarah’s world is further thrown into chaos and confusion when she wakes up with little memory of her recent past and is told that she is a victim of severe brain injury brought on by the very technology she had been working with. Sarah is lost in the revelation, loath to accept the reality being told her, and soon falls into a downward spiral fueled by a husband she doesn’t remember, along with the abysmal fear that she may actually be losing her mind. What Sarah doesn’t realize is that as she fights to gain a hold on what is real, others are in the process of risking their lives in a desperate attempt to free her from her perceptual prison. Filled with guilt, the very man who blames himself for Sarah’s cerebral incarceration begins to work with a group of highly trained professionals who might just be Sarah’s only hope of ever returning to her real life.Tags: Smartphone/Brain Computer Interface, Consumer, Technology, Virtual Worlds, Artificial Telepathy, Neural Streaming, Auxiliary, Senses, Brain Hacking, Ruse, Alzheimer’s Disease, Mind Control, Artificially-Viable Transhuman Realities, Avatars, Human Trafficking, Streamplaces, Dreams, Purpose, Romance, Adventure, EnvironmentA 2-part Novel in one Volume2nd EditionPrinted pgs. - 496Smartbrain Universe-and the Penchant SeriesSmartbrain, a two-part novel and the first in the Penchant Series, introduces the Reader to a burgeoning, future universe where new, uber-immersive consumer technology creates the potential for worlds of augmented realism that exceeds ordinary, high-definition reality by inestimable measures.Is technology truly leading us to a better world?Will innovation and technology ultimately save our environment from self-induced catastrophe?Are we, because of technology, losing an important part of our humanity?Will this new universe of technology be just another contributor to the separation of the classes?Would technology like this help balance, or destroy world economics?Will we become so dependent on technology that we can no longer survive in the natural world?To what degree, or limit, can technology and biology combine?Can, or will, AI—artificial intelligence—actually supersede human intelligence?Will technology truly help us reach out and colonize the heavens?Will technology enable us to learn that we are not alone in the universe, or ultimately to find out that we are?Technology has already defined an entire new epoch in Earth’s history; will this be the final one? Moreover, if not, what could possibly come next?*Visit the Author’s website: gfsmithbooks (dot) com",
  "genres": [
    "Science Fiction",
    "Fantasy",
    "Fiction",
    "Technology"
  ],
  "author": "G.F. Smith",
  "average_rating": "3.76",
  "url": "https://www.goodreads.com/book/show/25848705-smartbrain"
}