{
  "title": "The End of Protest: A New Playbook for Revolution",
  "description": "Is protest broken? Micah White, co-creator of Occupy Wall Street, thinks so. Disruptive tactics have failed to halt the rise of Donald Trump in the upcoming US presidential election. Movements ranging from Black Lives Matter to environmentalism are leaving activists frustrated. Meanwhile, recent years have witnessed the largest protests in human history. Yet these mass mobilizations no longer change society. Now activism is at a crossroads: innovation or irrelevance. In The End of Protest Micah White heralds the future of activism. Drawing on his unique experience with Occupy Wall Street, a contagious protest that spread to eighty-two countries, White articulates a unified theory of revolution and eight principles of tactical innovation that are destined to catalyze the next generation of social movements.  Despite global challenges—catastrophic climate change, economic collapse and the decline of democracy—White finds reason for optimism: the end of protest inaugurates a new era of social change. On the horizon are increasingly sophisticated movements that will emerge in a bid to challenge elections, govern cities and reorient the way we live. Activists will reshape society by forming a global political party capable of winning elections worldwide.  In this provocative playbook, White offers three bold, revolutionary scenarios for harnessing the creativity of people from across the political spectrum. He also shows how social movements are created and how they spread, how materialism limits contemporary activism, and why we must re-conceive protest in timelines of centuries, not days. Rigorous, original and compelling, The End of Protest is an exhilarating vision of an all-encompassing revolution of revolution.",
  "genres": [
    "Nonfiction",
    "Politics",
    "Activism",
    "Social Justice",
    "Philosophy",
    "Social Issues",
    "Sociology"
  ],
  "author": "Micah White",
  "average_rating": "3.62",
  "url": "https://www.goodreads.com/book/show/25852766-the-end-of-protest"
}