{
  "title": "Stacked Up",
  "description": "Opposites attract in this seductive novel from the author of Against the Cage (“Funny, steamy, scorching.”—Toni Aleo), with a chiseled MMA fighter falling for a single mom who could use a real man in her corner.   Working two jobs to support her infant daughter is harder than anything Penny Richards has ever done, but it sure beats living under the rules of her stepfather, a television preacher who demands a picture-perfect family. And if Penny hadn’t struck out on her own, she never would have met Travis Calhoun. The intensely physical heavyweight brawler has a way of drawing out her wild side. But Travis lives fast, with no responsibilities—and that just isn’t for Penny.   Most of the women in Travis’s circle wear tight clothes, high heels, and tons of makeup—not pearls or plaid headbands. But once he works past Penny’s inhibitions, Travis discovers a kindred spirit who longs to trust someone with her body, and her secrets. Still, Travis can’t help but wonder if this rich girl is just slumming it before she returns to her privileged life. Now it’s up to Penny to prove that she wants her hard-edged, hard-loving fighter just the way he is.   Praise for the Worth the Fight series \n \n “Holy hot MMA fighter, I wanted more. Five stars all the way!”—New York Times and USA Today bestselling author Toni Aleo   “A steamy and fun romance that will leave readers begging for more. Sidney Halston is an author to watch!”—New York Times bestselling author Cherry Adair, on Against the Cage   “Halston’s new series opener creates an organic and sensual dynamic between Jack and Chrissy that makes an easy buy-in for readers.”—Library Journal (starred review), on Against the Cage   “Sidney Halston has another knockout with her latest release in the Worth the Fight series. Full Contact is a heavyweight contender in the world of MMA romances.”—Smut Book Junkie Book Reviews“If you love cracktastic drama and sexy times, this is for you!”—RT Book Reviews, on Fighting Dirty   Includes a special message from the editor, as well as an excerpt from another Loveswept title.",
  "genres": [
    "Romance",
    "Sports",
    "Mixed Martial Arts",
    "Contemporary Romance",
    "Fighters",
    "Sports Romance",
    "Contemporary"
  ],
  "author": "Sidney Halston",
  "average_rating": "4.14",
  "url": "https://www.goodreads.com/book/show/25852653-stacked-up"
}