{
  "title": "Scotch on the Rocks",
  "description": "Family secrets threaten Brodie and Ishabel’s future happinessISHABEL STUART is at the crossroads of her life. Her wealthy industrialist father has died unexpectedly, leaving her a half-share in a ruined whisky distillery on a Scottish and the task of scattering his ashes on a Munro. After discovering her fiancé playing away from home, she cancels their lavish Christmas wedding at St Giles Cathedral, Edinburgh and heads for the only place she feels safe - Eilean na Sgairbh, a windswept island on Scotland’s west coast - where the cormorants outnumber the inhabitants, ten to one.When she arrives at her family home - now a bed and breakfast managed by her left-wing, firebrand Aunt Esme, she finds a guest in situ - BRODIE. Issy longs for peace and the chance to lick her wounds, but gorgeous, sexy American, Brodie, turns her world upside down. In spite of her vow to steer clear of men, she grows to rely on Brodie. However, she suspects him of having an ulterior motive for staying at her aunt’s Bed and Breakfast on remote Cormorant Island. Having been let down by the men in her life, will it be third time lucky for Issy? Is she wise to trust a man she knows nothing about - a man who presents more questions than answers?As for Aunt Esme, she has secrets of her own . . .Reviews for Scotch on the RocksLizzie Lamb has already demonstrated that she is an expert in writing romantic fiction. She creates believable main characters who fall in once-in-a-lifetime love; she devises imaginative and unusual conflicts and tensions that threaten to keep the lovers apart; she develops a rich cast of supporting players who help and hinder the resolution to the lovers' problems; and she describes fascinating and beautiful settings in which their story unfolds. Catherine Such an enticing read could not put it down, loved every page of the story . Parts made me laugh and some made me weep but over all a very beautiful novel. Highly recommend. Pamela MackenzieMy favourite characters were Isabella - the Italian opera diva and Pershing the parrot. I enjoyed the book and would recommend it to others. Astrid Bennett-ClaasA cast of great characters complement Issy and Brodie, including the brilliant Pershing - a parrot with a somewhat cheeky mouth! His comic timing is epic. India Anticipating where the plot was leading in this novel, of course I was wrong! It just goes to show, Lizzie Lamb keeps us guessing right to the end! Theresa Le Flemm",
  "genres": [
    "Romance",
    "Scotland",
    "Chick Lit"
  ],
  "author": "Lizzie Lamb",
  "average_rating": "4.15",
  "url": "https://www.goodreads.com/book/show/25849896-scotch-on-the-rocks"
}