{
  "title": "Addicted to You",
  "description": "In a sweet, sexy novel for fans of Abbi Glines, Monica Murphy, and Christina Lauren, the author of Just a Little Kiss tells the story of two friends who each want more—and the love triangle that’s holding them back.   In the sleepy fishing town of Port Lucia, everyone knows everyone, but Isla Diaz really knows Colby Callahan, with his blue-gray eyes and the tousled brown hair always tucked sexily into his cap. After all, Isla has been crazy about Colby ever since she can remember—even if he treats her like a kid sister. Now, without her best friend, Felicity, around, Isla spots a golden opportunity to take things to the next level . . . or at least wrangle a kiss out of Colby.   By random chance, a tropical storm is headed toward the coast, leaving them stranded together overnight—and there’s nothing to do but drink. As the evening wears on, Isla gets the feeling that her not-so-secret crush may finally release her from the friend zone. With her dreams finally coming true, Isla isn’t about to pump the brakes, but is this just a one-time thing? What if the next morning, she needs more than Colby’s prepared to give?   Little does she know, Colby would like nothing more than a real relationship with Isla. She’s always been the one. But there’s a very good reason he’s been keeping his distance. Someone else loves her too, someone who also means the world to his brother.  Praise for Addicted to You“A girl-next-door meets friends-to-lovers meets love-triangle in this new adult romance. Renita Pizzitola brings the angst in this roller-coaster ride of tension, anticipation, and heat. . . . Fans of Marquita Valentine, Melissa Foster, and Joss Wood will enjoy Addicted to You.”—Harlequin Junkie “A beautiful summer romance book as a whole. The setting was perfect and the story was packed with all the sweet goodness that a contemporary reader craves. If you are a fan of Abbi Glines and Jenny Han, consider this book as your next read.”—Pages of Pearl",
  "genres": [
    "Romance",
    "New Adult",
    "Contemporary",
    "Contemporary Romance",
    "Friends To Lovers"
  ],
  "author": "Renita Pizzitola",
  "average_rating": "3.49",
  "url": "https://www.goodreads.com/book/show/25852666-addicted-to-you"
}