{
  "title": "Drawn from Paradise: The Natural History, Art and Discovery of the Birds of Paradise with Rare Archival Art",
  "description": "From the moment Europeans were introduced to the birds of paradise in the early sixteenth century, their unique beauty was recognized and commemorated in the first name that they were given - birds so beautiful they must be from paradise. Originally they were thought not to have legs and therefore never to land. Still very rarely encountered, even in their natural habitat of New Guinea, they are still birds that elicit sheer awe in those who are lucky enough to see them. Drawn From Paradise will showcase the magnificence and beauty of the birds of paradise as they have never before been seen, with more than two-hundred hand-painted images and sketches by the men who originally studied them and luminary artists such as Jacques Barraband, William Hart, John Gould, Rubens and Breughel, to name a few. The art comes from the private collections of the two authors and has been rarely if ever published. Not only will the book feature the beautiful Greater Bird of Paradise-a bird that was originally believed to have been sent from Paradise, and was thought to never touch the earth-but it will also present more than forty other distinct species currently recognized-each representing amazing differences in size, shape, and color patterning.The introduction provides a brief history into the discovery of these illustrious birds, from how they were originally perceived and idolized by the natives of New Guinea, to the arrival of Europeans, who were immediately captivated by their bright, vibrant colors. The chapters are ordered according to the sequence in which the birds representing the various genera made their appearance in Europe (thereby highlighting the books educational aspect). Within its pages, readers will catch a glimpse of these birds through vivid, highly-detailed painting, as well as learn more about each individual bird and genus-comparisons and contrasts between the males and females, as well as between the different genus's.A tour through art and history, with a good deal of ornithology thrown in, Drawn From Paradise is not only a must-have for ornithologists and bird-watchers, but also a beautiful collectible for students, artists, and aesthetes. Its central idea is to showcase the breathtaking beauty of these birds and the enormous interest that still surrounds them even today.",
  "genres": [
    "Art",
    "Nonfiction",
    "Birds",
    "Animals",
    "Science",
    "History",
    "Nature"
  ],
  "author": "David Attenborough",
  "average_rating": "4.41",
  "url": "https://www.goodreads.com/book/show/25851691-drawn-from-paradise"
}