{
  "title": "That Touch of Ink",
  "description": "This is an alternate/new cover for ISBN-13: 9781940976099.--SLEEK, CHIC AND CONSTANTLY SURPRISING... \"The suspense is intense, the plot is hot and the style is to die for. A thoroughly entertaining entry in this enjoyable series.\" - Catriona McPherson, Agatha Award-Winning Author of the Dandy Gilver Mystery Series When a rare five thousand dollar bill arrives in the mail, interior decorator Madison Night knows it’s a message from her past. In happier times, she once joked that she could be bought for $5000—how could she deny a bill with her name on it? Suspecting the bill indicates trouble, she consults a numismatist. They set up a meet, but upon arrival she finds an abandoned office, a scared dog,…and a dead body in the kitchen. The twist? The victim isn’t the numismatist; it’s a John Doe.The police—led by Lt. Tex Allen—are on the case, but it’s Madison who discovers the victim’s identity. But where’s the numismatist? Before long, she uncovers a kidnapping plot, a unique counterfeit operation, and the true price of her own independence. Praise for THAT TOUCH OF INK: \"A terrific mystery is always in fashion--and this one is sleek, chic and constantly surprising. Vallere's smart styling and wry humor combine for a fresh and original page-turner--it'll have you eagerly awaiting her next appealing adventure. I'm a fan!\" - Hank Phillippi Ryan, Agatha, Anthony, Macavity and Mary Higgins Clark Award-Winning Author of The Other Woman \"All of us who fell in love with Madison Night in Pillow Stalk will be rooting for her when the past comes back to haunt her in That Touch of Ink. The suspense is intense, the plot is hot and the style is to die for. A thoroughly entertaining entry in this enjoyable series.\" - Catriona McPherson, Agatha Award-Winning Author of the Dandy Gilver Mystery Series \"A fast-paced mystery with fab fashions, an appealing heroine, and a clever twist, That Touch of Ink is especially for fans of all things mid-century modern.\" - Reader to Reader \"Diane Vallere...has a wonderful touch, bringing in the design elements and influences of the '50s and '60s era many of us hold dear while keeping a strong focus on what it means in modern times to be a woman in business for herself, starting over.\" - Fresh Fiction Books in the Mad for Mod Humorous Mystery Series: MIDNIGHT INK (prequel novella in OTHER PEOPLE'S BAGGAGE) PILLOW STALK (#1) THAT TOUCH OF INK (#2) (April 2014) WITH VICS YOU GET EGGROLL (#3) (April 2015) Part of the Henery Press Mystery Series Collection, if you like one, you'll probably like them all... Author Bio: Diane Vallere lives in a world where popcorn is a breakfast food and Doris Day movies are revered for their cultural significance. After over twenty years in the fashion industry, she now writes full time, juggling the Mad for Mod series, the Style & Error series, and the upcoming Material Witness series. She launched her own detective agency at age ten and has maintained a passion for shoes, clues, and clothes ever since.",
  "genres": [
    "Mystery",
    "Cozy Mystery",
    "Cozy",
    "Amateur Sleuth",
    "Chick Lit",
    "Fiction",
    "Whodunit"
  ],
  "author": "Diane Vallere",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/25854333-that-touch-of-ink"
}