{
  "title": "Law and the Modern Mind: Consciousness and Responsibility in American Legal Culture",
  "description": "In postrevolutionary America, the autonomous individual was both the linchpin of a young nation and a threat to the founders' vision of ordered liberty. Conceiving of self-government as a psychological as well as a political project, jurists built a republic of laws upon the Enlightenment science of the mind with the aim of producing a responsible citizenry. Susanna Blumenthal probes the assumptions and consequences of this undertaking, revealing how ideas about consciousness, agency, and accountability have shaped American jurisprudence.Focusing on everyday adjudication, Blumenthal shows that mental soundness was routinely disputed in civil as well as criminal cases. Litigants presented conflicting religious, philosophical, and medical understandings of the self, intensifying fears of a populace maddened by too much liberty. Judges struggled to reconcile common sense notions of rationality with novel scientific concepts that suggested deviant behavior might result from disease rather than conscious choice. Determining the threshold of competence was especially vexing in litigation among family members that raised profound questions about the interconnections between love and consent. This body of law coalesced into a jurisprudence of insanity, which also illuminates the position of those to whom the insane were compared, particularly children, married women, and slaves. Over time, the liberties of the eccentric expanded as jurists came to recognize the diversity of beliefs held by otherwise reasonable persons.In calling attention to the problematic relationship between consciousness and liability, Law and the Modern Mind casts new light on the meanings of freedom in the formative era of American law.",
  "genres": [
    "Law",
    "History",
    "Psychology",
    "American History"
  ],
  "author": "Susanna L. Blumenthal",
  "average_rating": "4.71",
  "url": "https://www.goodreads.com/book/show/25848513-law-and-the-modern-mind"
}