{
  "title": "The Sibley Field Guide to Birds of Western North America",
  "description": "FlexiboundNow completely revised and updated--the indispensable resource for all birders seeking an authoritative guide to the birds of the West in a portable format they will want to carry into the field.  Compact and comprehensive, this guide features 715 bird species, plus regional populations, found west of the Rocky Mountains. Entries include stunningly accurate illustrations--more than 5,046 in total--with descriptive captions pointing out the most important field marks. Each entry has been updated to include the most current information concerning frequency, nesting, behavior, food and feeding, voice description, and key identification features. Here too are more than 652 updated maps drawn from information contributed by 110 regional experts across the continent, and showing winter, summer, year-round, migration, and rare ranges.NEW AND IMPROVED:   •   Updated habitat, description, behavior, and conservation text for each species account and all family pages (drawn from the second edition of The Sibley Guide to Birds and tailored for the specific region).    •   All illustrations, including new and revised illustrations of species and regional forms, are taken from the rescanned and meticulously color-corrected second printing of the second edition of the Sibley Guide.    •   New design reflects the layout of The Sibley Guide to Birds, Second Edition. All species accounts are now presented in columns, rather than stacked, allowing for better comparison and more illustrations and text for each species.    •   Current taxonomic order and up-to-date common names.    •   All maps revised to reflect the most current range information.    •   More species and rarities included.",
  "genres": [
    "Birds",
    "Reference",
    "Nature",
    "Field Guides",
    "Nonfiction",
    "Science",
    "Natural History"
  ],
  "author": "David Allen Sibley",
  "average_rating": "4.71",
  "url": "https://www.goodreads.com/book/show/25852757-the-sibley-field-guide-to-birds-of-western-north-america"
}