{
  "title": "The Brave Bostonians: Hutchinson, Quincy, Franklin, and the Coming of the American Revolution",
  "description": "Most Americans are familiar with the Revolution through its defining the Stamp Act riots, the Boston Massacre, the Boston Tea Party, Paul Revere's ride, the first shots fired at Lexington and Concord. These were events fueled by the anger of an array of Bostonians in search of liberty and justice for an American cause. As a legacy of the Revolution, their heroic tales have intimately defined our consciousness as Americans and the sense of history we carry with us today.But there is another side to the story, a story of Bostonians equally brave and as intensely devoted to liberty and justice, who watched with horror as their homes were pillaged, their reputations destroyed, and their lives torn apart. They were the losers, far more deeply than Britain, King George, or a host of British Redcoats. But their story is largely forgotten.In The Brave Bostonians, acclaimed novelist and historian Philip McFarland traces both sides through the intertwined lives of three native, and eminently respected, Bostonians during the turbulent year preceding the Revolution. Thomas Hutchinson, the last civilian governor of the Massachusetts Bay Colony, stands as the centerpiece of the story. Unfalteringly loyal to British law and order and far from home as an exile in London, he could only agonize over letters and newspaper headlines as his beloved Boston burst apart at the seams. Josiah Quincy, an archpatriot and feverish enemy of Hutchinson's loyalism, drove himself to his own tubercular death in pursuit of the colony's independence. And Benjamin Franklin, the venerable diplomat, scientist, and devoted Anglophile, fought with considerable skill to hold the British Empire together before conceding at last to declare himself heart and soul an American. These three men, each fiercely loyal in his own way to Boston and America, stood in separate corners of the conflict. And each found his own fate.Told in skillful style through the words of those who endured the struggles of the times, The Brave Bostonians brings fresh life to this stirring period of America's past.",
  "genres": [
    "History",
    "American Revolution"
  ],
  "author": "Philip McFarland",
  "average_rating": "3.30",
  "url": "https://www.goodreads.com/book/show/1163274.The_Brave_Bostonians"
}