{
  "title": "The Rivals of Versailles",
  "description": "And you thought sisters were a thing to fear. In this compelling follow-up to Sally Christie's clever and absorbing debut, we meet none other than the Marquise de Pompadour, one of the greatest beauties of her generation and the first bourgeois mistress ever to grace the hallowed halls of Versailles.I write this before her blood is even cold. She is dead, suddenly, from a high fever. The King is inconsolable, but the way is now clear.The way is now clear.The year is 1745. Marie-Anne, the youngest of the infamous Nesle sisters and King Louis XV's most beloved mistress, is gone, making room for the next Royal Favorite.Enter Jeanne-Antoinette Poisson, a stunningly beautiful girl from the middle classes. Fifteen years prior, a fortune teller had mapped out young Jeanne's destiny: she would become the lover of a king and the most powerful woman in the land. Eventually connections, luck, and a little scheming pave her way to Versailles and into the King's arms.All too soon, conniving politicians and hopeful beauties seek to replace the bourgeois interloper with a more suitable mistress. As Jeanne, now the Marquise de Pompadour, takes on her many rivals - including a lustful lady-in-waiting; a precocious fourteen-year-old prostitute, and even a cousin of the notorious Nesle sisters - she helps the king give himself over to a life of luxury and depravity. Around them, war rages, discontent grows, and France inches ever closer to the Revolution.Enigmatic beauty, social climber, actress, trendsetter, patron of the arts, spendthrift, whoremonger, friend, lover, foe. History books may say many things about the famous Marquise de Pompadour, but one thing is clear: for almost twenty years, she ruled France and the King's heart.Told in Christie's witty and modern style, this second book in the Mistresses of Versailles trilogy will delight and entrance fans as it once again brings to life the world of eighteenth century Versailles in all its pride, pestilence and glory.",
  "genres": [
    "Historical Fiction",
    "France",
    "Historical",
    "Fiction",
    "18th Century",
    "Romance",
    "Adult"
  ],
  "author": "Sally  Christie",
  "average_rating": "3.88",
  "url": "https://www.goodreads.com/book/show/25855582-the-rivals-of-versailles"
}