{
  "title": "Transformed Into A Dog",
  "description": "TRANSFORMED INTO A DOG Tina is a person from an extra world, yet another universe. When she is inexplicably kidnapped and changed into a dog, she's thrown into an unknown world where she meets her new homeowners. Dre and Water, who rename her as Stovers.After getting lost, multiple instances, and finding connections alongside the way in which, she meet up with twelve, potent boys who all deeply care about her. But she can not keep the hide are true self forever. What occurs once they find out? Can they still accept her ? CHAPTER ONE WE ARE FRIENDS MIKEL'S POV \"hi there NIKITA!\" I call out to my new friend. Ever for the reason that i ended bothering him, it looked like all people else backed off too, which used to be just right. He and that i had a just right, lengthy, talk about it, we forgave ourselves . \"Yah, I advised you to name me Deb. It sounds bizarre when so calls me NIKITA after this kind of very long time.\" I chuckle at him and chat with him about college before meeting up with Blake at the institution gates. \"good day hyungs~\" The blonde cooed and all of us laughed, joking with every different effortlessly. \"Oh my gosh, is not that Deb?\" \"i know correct, when did that occur? MIKEL and Deb? Please.\" extra whispers crammed the halls,Within the nook of my eye, I see Deb's smile falter somewhat. I swing an arm over him protectively, he appears up at me surprised, however most of all, joyful. \"don't take heed to them. They are so annoying. Like one time a girl known as me so lovable just because--\" Blake areas his arm round Deb's different shoulder and began one in every of his rants once more, but the two of us let the younger speak as a lot as he pleased. \"Thanks, MIKEL.\" Deb whispered, I stared at him, smiling. I used to be about to reply, after I was cut off. \"hiya! Are you guys even listening?\" The more youthful whined, \"Gosh, these hyungs..\" I shift my awareness to Blake. \"Is that anyway to speak to me?\" I let go of Deb and immediately assault Blake, giving him a excellent noogie. \"MIKEL! MIKEL! I am sorry! Let go!\" I chortle and free up him as he painfully holds onto his head, evident at me. I smirk at him in the meantime Deb simply laughs at our childish conduct. We have been all joyful like that, hanging out amongst ourselves, although, mostly Deb did wander away to speak to lay. DARA'S POV Water used to be crashing at my situation for a even as seeing that Dre mother and father used to be travelling him, they usually failed to recognize of Water staying at Dre situation. To be honest, Water and i were historic childhood friends, we had both decided to return to Korea, and right here we're. \"but I need to watch a drama.\" I reasoned, looking on the many DVDs scattered throughout the espresso desk. We have been both on the sofa, Water' arm over my shoulder, as we had been voting for what we must watch tonight. \"Then which drama do you think we must watch?\" He requested, giving into my idea. \"What about that trendy film, The Werewolf Boy?\"(i love this film so much, like i sobbed so tough, you dont even know) I suggested, watching at him optimistically. \"however isn't that some unhappy?\" He requested, furrowing his eyebrows at me. He wasn't a significant fan of those types of movies, however I decided to push with the thought anyhow. Probably he'll love it. \"I do not know, let's just watch.\" Water shrugs and takes out the CD, going over to the DVD participant and pushing it in.",
  "genres": [],
  "author": "Cozy M.",
  "average_rating": "4.25",
  "url": "https://www.goodreads.com/book/show/25857264-transformed-into-a-dog"
}