{
  "title": "The Raven Warrior",
  "description": "With the knowing eye and fiery voice of an accomplished storyteller, Alice Borchardt takes us back to the amazing world of a re-envisioned Camelot in the continuing Tales of Guinevere. Remarkably strong, magically talented, a match for friend and foe alike, Guinevere has come into womanhood—and faces a new relationship with Lancelot that will lead to the sharp-edged triangle of legend. . . .Born of the Highlands, along Pictish shores washed by the icy North Sea, Guinevere, Queen of the Dragon People, has become a woman. She has taken the power offered to her by the Dragon Throne. Now there is no turning back. In order to protect her beloved homeland from the obscene greed of the Saxon raiders, Guinevere knows she must launch an attack. The sub-chiefs refuse to fall in line with her plans (because what does this young thing, barely a woman, know of warfare?) and give her an army of the useless, the outcast, the weakest of their young boys and girls. But the war party must proceed. If it fails, the command of both land and sea will fall to the enemy. Facing her first battle against the pirates on foreign shores, and backed only by a meager band of ill-equipped fighters, Guinevere calls upon the spirits of the dead to aid her in the attack. Diving into the dark, morbid depths, Guinevere suddenly understands more of hate, love, anger, and revenge than she has ever wanted to. But the power the dead provide comes at a severe price. If she makes it through the raid, she will be a changed woman, in more ways than she can possibly imagine. Further south, Black Leg, her childhood companion, sets out on his own. It is a quest to become a man—a man, he hopes, who will be worthy of the newly crowned Guinevere. A shapeshifter and the son of Guinevere’s adoptive man-wolf father, Black Leg (soon to be Lancelot) feels he has much to learn—and even more to prove. He discovers both his inner strength and an unmitigated passion when he meets the Lady of the Lake. But the trials of his journey— both mental and physical—turn out to be more perilous with each step. And when Lancelot and Guinevere are finally reunited, the consequences of both their ordeals will unleash a torrent of anguish and desire.With familiar names brilliantly repositioned for a new generation of Arthurian fans—evil Merlin, conniving Igrane, complex Lancelot, tainted Arthur, and of course, warrior Guinevere—Alice Borchardt’s creation stands as a testament to the power of imagination.From the Hardcover edition.",
  "genres": [
    "Fantasy",
    "Arthurian",
    "Fiction",
    "Historical",
    "Historical Fiction",
    "Paranormal",
    "Science Fiction Fantasy"
  ],
  "author": "Alice Borchardt",
  "average_rating": "3.85",
  "url": "https://www.goodreads.com/book/show/258660.The_Raven_Warrior"
}