{
  "title": "Fabulous Showman",
  "description": "This is a fast-paced, carefully documented, and rich biography of Barnum, the greatest showman of all time, the American from Bethel, Connecticut, whose eccentricities and oblique cynical approach to humanity transformed entertainment into a big, incredibly profitable business. As bachelor, husband (twice), father, and grandfather, Barnum comes to life in Mr. Wallace's crowded book, an exceedingly interesting and human man. here, too, are New York City in all its 19th century color, the London of Queen Victoria, and the Paris of Napoleon III.In 1842, Barnum opened the first of the great museums of curiosities and freaks, adding immeasurably to the gaiety of New York life. He exhibited the tiny Charles Sherwood Stratton so successfully that he became known as General Tom Thumb, a world-famous figure. In 1850, Barnum imported Jenny Lind for a concert tour beginning at Castle Garden (later the Aquarium in Battery Park) which more than prefigured the later exploits of S. Hurok. When past 60, Barnum opened in Brooklyn \"The Greatest Show on Earth,\" the first great American traveling circus. Combining 10 years later with James Anthony Bailey, he gave to millions of American children and grownups The Barnum and Bailey Circus. He bought from the London Zoological Society the huge elephant that became known everywhere as Jumbo. And always, he shrewdly understood that people did not mind being fooled (\"There's a sucker born every minute\"), if they were only entertained.Besides the towering figure of Barnum himself, this book's cast of characters includes not only Jenny Lind, Jumbo, and Tom Thumb, but also such ill-assorted figures as Chang and Eng (the original Siamese Twins), Queen Victoria herself, captive white whales, The Feejee Mermaid, and Abraham Lincoln.1959 David Wallechinsky (P)2017 David N. Wilson",
  "genres": [
    "Biography",
    "Nonfiction",
    "History",
    "Business",
    "American History",
    "American"
  ],
  "author": "Irving Wallace",
  "average_rating": "3.95",
  "url": "https://www.goodreads.com/book/show/11633616-fabulous-showman"
}