{
  "title": "The Dragon Queen",
  "description": "Arthur turned and strode toward us. He was magnificent, and I will never forget that, in that moment, I first loved him. And I believe--had I known what the future held for us: all the trouble, torment, battle, and grief of our lives--I still believe that I would have yielded my heart into his keeping as I did then . . .In a sweeping epic of the imagination, Alice Borchardt enters the wondrous realm of Arthurian legend and makes it her own. The Dragon Queen is the first volume in a trilogy of novels that boldly re-imagines Camelot--and casts Guinevere as a shrewd, strong-willed, magical warrior queen.Born into a world of terrible strife, where war is constant and weapons are never far from the hands of men or women, Guinevere, daughter of a mighty pagan queen, is a threat to her people and a prize to the dreaded sorcerer Merlin. Sent into hiding, she grows up under the protection of a shapeshifting man-wolf and an ornery Druid. But even on the remote coast of Scotland, where dragons feed and watch over her, she is not safe from the all-seeing High Druid Merlin. He knows the young beauty's destiny, and he will stop at nothing to prevent what has been foretold. For if Guinevere becomes Queen and Arthur, King, they will bring a peace to the land that will leave the power-hungry Merlin a shriveled magician in a weary cloak.Yet Guinevere possesses power of her own--dazzling power to rival even that of Merlin. Summoned from her home by forces she cannot fathom, she travels from the Underworld to an Otherworld of the Past, at each step calling on ancient powers to aid her way. When young Guinevere proves her mettle to an embarrassed Merlin, even her faithful dragon protectors cannot prevent the evil that the sorcerer rains down. Seeking revenge, Merlin banishes Arthur to a world from which the only escape is death. Now Guinevere must face Merlin's wrath without him--and prove that she is worthy of being Arthur's Queen.From the glass-roofed Great Hall at Tintigal to the lush garden forts of Wales, Alice Borchardt details the travels of Guinevere in a rich fabric of prose. The Dragon Queen is a novel of great emotional depth, timeless romance, and soul-stirring adventure.",
  "genres": [
    "Fantasy",
    "Arthurian",
    "Fiction",
    "Historical Fiction",
    "Dragons",
    "Historical",
    "Mythology"
  ],
  "author": "Alice Borchardt",
  "average_rating": "3.82",
  "url": "https://www.goodreads.com/book/show/258666.The_Dragon_Queen"
}