{
  "title": "The Strangeness of Men",
  "description": "Finalist in USA Best Book AwardSilver IPPY WinnerThe Strangeness of Men is a witty collection of short stories, flash fiction, and prose poetry. A naked sleepwalker, Wonder Woman wrangled by a housewife, a 1913 murder, sex lessons at church nacho night, the mythic Andromeda in an assisted living facility, a Zambian youth besieged by bullies, and a guy in a dog suit—are just a few of these thirty—eight quirky tales that will keep you thinking long after you put down the book.   “Relationships are tricky, whether it’s men and women, fathers and daughters, siblings, or a disabled lady and the gentleman who sleepswims naked in her pool. Kim Drew Wright fearlessly explores the spectrum of human dynamics. With humor and compassion she introduces us to all kinds of characters: the Jesus with great pot, the arthritic dog who forges an unlikely friendship between a widower and a prickly neighbor, the controlling husband who lies to his wife about a letter. Brimming with finesse, The Strangeness of Men is a treasure chest stuffed with literary goodies. Open it up and look inside!” —Boston Literary Magazine  “These stories and poems are filled with those small significant moments in life where we try to snatch triumph from calamity. Kim Drew Wright is insightful and her characters are as real as the couple next door, your colleagues, your friends. Fun and sassy, sometimes sad, always heartfelt, this diverse collection is an excellent read.” —Jennifer Falkner, Circa: A Journal of Historical Fiction  “Sweet and simple at times, experimental and edgy at others, this short and eclectic collection is imbued with a sense of longing that transcends gender and cuts straight to the heart of the human condition.” —Bill Glose, author of Half a Man and The Human Touch   “In The Strangeness of Men, Wright displays an uncanny ability to reveal significance in moments of profound mundanity. These pieces, a beautifully orchestrated collection of stories and poems, speak to our human fragility and resilience. Here, even the briefest encounters resonate with startling insight and poignancy.” —Rebeca Morales, The Milo Review  “Kim Drew Wright’s The Strangeness of Men traverses an emotional terrain spanning the complications of modern love to the secrets of lives in subdivisions. With a quick eye to popular culture and sympathy for the small, human moments that make a life meaningful, this collection takes the reader on a journey through the extraordinary within the ordinary.” —Renée K. Nicholson, Souvenir, author of Roundabout Directions to Lincoln Center  Kim Drew Wright is an award-winning writer with fiction and poetry published internationally by over a dozen literary journals and organizations, including, The Pinch, The Milo Review, Sixfold, and in an anthology, What We Carry Home. She graduated in journalism from the University of North Carolina – Chapel Hill and enjoyed a career in advertising. She currently resides in Richmond, Virginia, with her husband and three children. The Strangeness of Men is her debut collection.  Find out more at KIMDREWWRIGHT.COM",
  "genres": [
    "Short Stories"
  ],
  "author": "Kim Drew Wright",
  "average_rating": "4.33",
  "url": "https://www.goodreads.com/book/show/25864262-the-strangeness-of-men"
}