{
  "title": "The Crowd: A Study of the Popular Mind",
  "description": "The Crowd: A Study of the Popular Mind by French social theorist Gustave Le Bon is a short treatise on the principles of large gatherings of people. As the disclaimer on the title page notes, the ideas in Le Bon's book were popular at the time of the late 19th century but are no longer in vogue today. The reasons for this are obvious, as LeBon unpretentiously puts to fault all the rhetoric about \"democracy,\" \"equality,\" \"fraternity,\" and \"equality\" as being mere catchphrases that self-serving demagogues use to control the spirit of the masses. He cites the French Revolution and the demands of Socialism and Communism during his time. Le Bon outlines the way crowds tend to think (in vivid images illogically connected), how they reason (they don't for all practical purposes), how they express exaggerated emotion, how they are very quick to take action without coherent thought and of the general extreme-conservatism and intolerance of crowds. The individual who becomes part of a crowd tends to loose himself, and feels invincible as he is aware of the similarity of mind and purpose of all those surrounding him. Le Bon notes how individuals become unthinking entities of the Herd, and can be unconsciously made to do acts, which can either be of great criminality or heroism. The reasoning of the solitary individual is superior to that of a crowd which has no individuality. All are \"equal\" in a crowd where, for instance, a mathematician is caught up in the same spirit as a laborer and class and intelligence differences fall to the lowest common denominator. One advantage of crowds is that they can express the spirit of a class, caste, or race of a people better than the individual can, and that crowds are capable of great deeds such as victory in a war or the spread of a religion that would be beyond simply one person's effort. Hitler, Mussolini in addition to Freud were familiar with LeBon's work, and it is readily apparent that their followers acted very similar to the behavior that LeBon describes.",
  "genres": [
    "Psychology",
    "Nonfiction",
    "Sociology",
    "Politics",
    "Philosophy",
    "History",
    "Classics"
  ],
  "author": "Gustave Le Bon",
  "average_rating": "3.82",
  "url": "https://www.goodreads.com/book/show/25870624-the-crowd"
}