{
  "title": "Early One Morning",
  "description": "'As gripping as any thriller' Daily MailA grey dawn in 1943: on a street in Rome, two young women, complete strangers to each other, lock eyes for a single moment.One of the women, Chiara Ravello, is about to flee the occupied city for the safety of her grandparents' house in the hills. The other has been herded on to a truck with her husband and their young children, and will shortly be driven off into the darkness.In that endless-seeming moment, before she has time to think about what she is doing, Chiara makes a decision that changes her life for ever. Loudly claiming the woman's son as her own nephew, she demands his immediate return; only as the trucks depart does she begin to realize what she has done. She is twenty-seven, single, with a sister who needs her constant care, a hazardous journey ahead of her, and now a child in her charge - a child with no papers who refuses to speak and gives every indication that he will bolt at the first opportunity.Three decades later, Chiara lives alone in Rome, a self-contained, self-possessed woman working as a translator and to all appearances quite content with a life which revolves around work, friends, music and the theatre. But always in the background is the shadow of Daniele, the boy from the truck, whose absence haunts her every moment. Gradually we learn of the havoc wrought on Chiara, her family and her friends by the boy she rescued, and how he eventually broke her heart. And when she receives a phone call from a teenage girl named Maria, claiming to be Daniele's daughter, Chiara knows that it is time for her to face up to the past.This epic novel is an unforgettably powerful, suspenseful, heartbreaking and inspiring tale of love, loss and war's reverberations down the years.",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Italy",
    "Historical",
    "World War II",
    "War",
    "Book Club"
  ],
  "author": "Virginia Baily",
  "average_rating": "3.43",
  "url": "https://www.goodreads.com/book/show/25871534-early-one-morning"
}