{
  "title": "Marius the Epicurean: His Sensations and Ideas",
  "description": "\"The great English prose work has been written and perfectly written and you and I would do well to lay down our pens. . . . I believe that the worst page of prose Pater wrote is better than the best that anybody else ever wrote.\" - George Moore Set in the second century A.D. against the backdrop of a Roman Empire on the verge of decline, Marius the Epicurean is the story of the philosophical and spiritual development of Marius, a young Italian serving as amanuensis to the great emperor Marcus Aurelius. Marius explores the various systems of philosophy in search of an elusive vision of love, moving from Epicureanism to Cyrenaicism and finally Stoicism before finally finding what he had sought in the terrible beauty of Christian martyrdom. Marius the Epicurean is the rare novel that is as significant for its style as for its plot. Told in Pater's uniquely exquisite and poetic prose, Marius became a profound influence on writers of the Aesthetic and Decadent movements of the late Victorian era, including Pater's former student, Oscar Wilde. It is also an important forerunner of the psychological novels of Joyce, Woolf, James, and Conrad, all of whom absorbed into their fictional techniques Pater's emphasis on the rendering of impressions and his presentation of character and point of view. This new edition, the first in over two decades, is based on the first edition of 1885 and features a new introduction and notes by Pater specialist Gerald Monsman. Also included is a generous selection of supplementary materials, such as contemporary reviews and excerpts from Pater's manuscripts, some of which are published here for the first time.",
  "genres": [
    "Classics",
    "Fiction",
    "Historical Fiction",
    "Philosophy",
    "19th Century",
    "Literature",
    "Novels"
  ],
  "author": "Walter Pater",
  "average_rating": "3.55",
  "url": "https://www.goodreads.com/book/show/2586977-marius-the-epicurean"
}