{
  "title": "Angelbound Origins",
  "description": "Alternate cover edition of ASIN B010TX7QL8ANGELBOUND (Book 1)Myla Lewis is a girl who loves two things: kicking ass and kicking ass. She’s not your every day quasi-demon, part-demon and part-human, girl. Myla lives for the days she gets to fight in Purgatory’s Arena. That is, until she meets Prince Lincoln, a super-sexy half-human and half-angel demon hunter. But what’s a quasi-demon girl to do when she falls for a royal demon killer? With a love with fighting for, Myla’s about to shake up the after-realms.SCALA (Book 2)Myla Lewis has a whole lot of trouble. A magical object called Lucifer’s Orb is threatening millions of souls, and it’s Myla’s job to make it go away. Plus, an old enemy is plotting to separate Myla from her Angelbound love, Prince Lincoln. But Myla and Lincoln are fighting back. Can they stop the Orb, save Purgatory’s souls, and stay together… Or will both the after-realms and their relationship be d troyed?ACCA (Book 3)In just one week, supernatural warrior Myla Lewis must discover enough evidence to send the evil House of Acca to prison… or she’ll end up in jail herself, along with her fiancé, Prince Lincoln. No pressure. To gather proof, Myla and Lincoln go undercover at an all-girl’s high school on Earth. Lincoln acts as the new gym teacher; Myla becomes the school’s least popular transfer student ever. To stop them from getting the goods, Acca releases Hell on Earth. Literally. Good thing Myla and Lincoln aren’t afraid of a tough fight. This one promises to be the hardest yet. After all, who ever said high school wasn’t hell?EXTRA CONTENTThis special collection of Angelbound Origins Books 1-3 includes an appendix with character letters, interviews, inside stories and more!",
  "genres": [
    "Fantasy",
    "Paranormal",
    "Romance",
    "Angels",
    "Paranormal Romance",
    "Demons",
    "Young Adult"
  ],
  "author": "Christina Bauer",
  "average_rating": "4.26",
  "url": "https://www.goodreads.com/book/show/25869412-angelbound-origins"
}