{
  "title": "Times of Our Lives",
  "description": "“Growing old is not for Sissies…”Set against the backdrop of OWL Haven, Australia’s first exclusively lesbian retirement community, an irreverent cast of residents share their lives, hopes and dreams together.At 65, Meg Sullivan is very clear about what and who she wants in life. Despite a string of lovers Meg’s first loyalty has always been to her best friend, Allie Richards. After reading about OWL Haven in a magazine, she knows the lesbian retirement village would be perfect for them both.Allie Richards has shared the best part of her life with Meg. For over forty years they’ve traveled the world, and love and trust each other completely. Moving to OWL is perfect, as a new group of friends join their comfortable circle of two.After her last relationship ended, Sparrow Hopkins was left with a broken heart. Quietly resigned to being alone for the rest of her life Sparrow discovers a feisty, vibrant group of women who are not afraid to take chances. Despite her promise to never fall in love again, life, as she is to find out, has other plans.Pat and Bella have been together for nearly fifty years. To them OWL represents the secure and loving community they rarely experienced in the homophobic Sydney of the 60’s. But life is never simple, and safety is sometimes elusive as they face their own personal challenges.Daphne Williams has always been a loner. Despite her preconceptions of retirement villages she discovers peace and happiness at OWL Haven. However, when her tightly controlled world goes into freefall, Daphne has to make a major decision. Does she keep control or open up a new world of joy and hope.Through laughter, tears, and joy these woman prove that no matter what your age, you’re never too old to fall in love.",
  "genres": [
    "LGBT",
    "Romance",
    "Lesbian",
    "Lesbian Fiction"
  ],
  "author": "Jane Waterton",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/25873465-times-of-our-lives"
}