{
  "title": "When Skies Have Fallen",
  "description": "For many in war-torn 1944, love blossoms in the dance hall, and airman Arty Clarke is no exception. He’s a thinker and a dreamer; however, it’s not the beautiful, talented dancer in his arms—his best friend Jean—who inspires his dreams. For when his gaze meets that of Technical Sergeant Jim Johnson, Arty dares to imagine a different dance.Their love is forbidden, by both the armed forces and the law, but with Jean’s cunning and support, Arty and Jim try to bridge the distance between them and find true love despite the danger and a life-threatening disaster that could destroy Arty’s dreams for good.Can the pair stand strong together, no matter how many skies have fallen?This story was written as a part of the M/M Romance Group's \"Love is an Open Road\" event. Group members were asked to write a story prompt inspired by a photo of their choice. Authors of the group selected a photo and prompt that spoke to them and wrote a short story. Dear Author,Life isn’t a fairytale. These two know that better than most. These men are survivors. Against all odds, they made it through hardships, separation, and war. They clung to hope where little existed and, as the skies fell around them and the world was torn apart, found strength in loving each other.Suddenly, the war was over. Battlefields lay silent and troops prepared for the journey home. These two were more than ready. They had experienced enough loss, grief, and pain to last ten lifetimes. The country they left behind may not have been ready to accept them, but they were prepared to live no matter how many skies had fallen.Photo Description: Picture is of two young soldiers at the front of a WWII armed forces jeep. Both men are dressed in fatigues. One is sitting on the hood of the jeep; the other is standing and is kissing the seated soldier’s cheek, whilst embracing him around the shoulders. Both men have cheeky, happy smiles.This story may contain sexually explicit content and is intended for adult readers. It may contain content that is disagreeable or distressing to some readers. The M/M Romance Group strongly recommends that each reader review the General Information section before each story for story tags as well as for content warnings.",
  "genres": [
    "Historical",
    "M M Romance",
    "Romance",
    "Military Fiction",
    "Historical Fiction",
    "LGBT",
    "Historical Romance"
  ],
  "author": "Debbie McGowan",
  "average_rating": "4.11",
  "url": "https://www.goodreads.com/book/show/25870756-when-skies-have-fallen"
}