{
  "title": "When Skies Have Fallen",
  "description": "For many in war-torn 1944, love blossoms in the dance hall, and airman Arty Clarke is no exception. He’s a thinker and a dreamer; however, it’s not the beautiful, talented dancer in his arms—his best friend Jean—who inspires his dreams. For when his gaze meets that of Technical Sergeant Jim Johnson, Arty dares to imagine a different dance.  Their love is forbidden, by both the armed forces and the law, but with Jean’s cunning and support, Arty and Jim try to bridge the distance between them and find true love despite the danger and a life-threatening disaster that could destroy Arty’s dreams for good.  Can the pair stand strong together, no matter how many skies have fallen?  * * * * *  Part of Love is an Open Road (Don’t Read in the Closet 2015) Based on the prompt:  Life isn’t a fairy tale. These two know that better than most. These men are survivors. Against all odds, they made it through hardships, separation, and war. They clung to hope where little existed and, as the skies fell around them and the world was torn apart, found strength in loving each other.  Suddenly, the war was over. Battlefields lay silent and troops prepared for the journey home. These two were more than ready. They had experienced enough loss, grief, and pain to last ten lifetimes. The country they left behind may not have been ready to accept them, but they were prepared to live no matter how many skies had fallen.  You can tell me the story of how these men met, but what I really want to know is what happened to these men after this photo was taken. Did their love endure the trials of a return to civilian life? Were they able to overcome the trauma of war and find peace together?  Sincerely, Tiffany",
  "genres": [
    "Historical",
    "M M Romance",
    "Romance",
    "Military Fiction",
    "Historical Fiction",
    "LGBT",
    "Historical Romance"
  ],
  "author": "Debbie McGowan",
  "average_rating": "4.11",
  "url": "https://www.goodreads.com/book/show/25875578-when-skies-have-fallen"
}