{
  "title": "The Portable Veblen",
  "description": "An exuberant, one-of-a-kind novel about love and family, war and nature, new money and old values by a brilliant New Yorker contributorThe Portable Veblen is a dazzlingly original novel that’s as big-hearted as it is laugh-out-loud funny. Set in and around Palo Alto, amid the culture clash of new money and old (antiestablishment) values, and with the specter of our current wars looming across its pages, The Portable Veblen is an unforgettable look at the way we live now. A young couple on the brink of marriage—the charming Veblen and her fiancé Paul, a brilliant neurologist—find their engagement in danger of collapse. Along the way they weather everything from each other’s dysfunctional families, to the attentions of a seductive pharmaceutical heiress, to an intimate tête-à-tête with a very charismatic squirrel. Veblen (named after the iconoclastic economist Thorstein Veblen, who coined the term “conspicuous consumption”) is one of the most refreshing heroines in recent fiction. Not quite liberated from the burdens of her hypochondriac, narcissistic mother and her institutionalized father, Veblen is an amateur translator and “freelance self”; in other words, she’s adrift. Meanwhile, Paul—the product of good hippies who were bad parents—finds his ambition soaring. His medical research has led to the development of a device to help minimize battlefield brain trauma—an invention that gets him swept up in a high-stakes deal with the Department of Defense, a Bizarro World that McKenzie satirizes with granular specificity. As Paul is swept up by the promise of fame and fortune, Veblen heroically keeps the peace between all the damaged parties involved in their upcoming wedding, until she finds herself falling for someone—or something—else. Throughout, Elizabeth McKenzie Where do our families end and we begin? How do we stay true to our ideals? And what is that squirrel really thinking? Replete with deadpan photos and sly appendices, The Portable Veblen is at once an honest inquiry into what we look for in love and an electrifying reading experience.",
  "genres": [
    "Fiction",
    "Humor",
    "Book Club",
    "Literary Fiction",
    "Contemporary",
    "Romance",
    "Adult"
  ],
  "author": "Elizabeth Mckenzie",
  "average_rating": "3.46",
  "url": "https://www.goodreads.com/book/show/25876280-the-portable-veblen"
}