{
  "title": "Being Max's Mom",
  "description": "I watched as the blond sat up straight in her seat as she proudly declared that Max was “unteachable” and “unreachable.” She pronounced that he would never thrive. Max would never learn to dress himself, feed himself, use the toilet or read and write. It was in his best interests if I surrendered him that very day. She sat back and seemed very sure of herself. Her mood changed when Brian and his mom started to intervene. The group began to argue amongst themselves while Brian advocated that Max remain with me. His mother challenged the methods of test taking, as they were not age appropriate. I didn’t say a word. Instead, I let this all settle in. The group was quite large and had representatives from all different aspects of child welfare. They had cast a judgment about me. I was a single mom working as a cocktail waitress with no social supports, and I was a survivor of domestic abuse. They questioned me directly. Do I take drugs? Did I do drugs when I was pregnant? Am I high now? Am I an alcoholic? Did I drink during my pregnancy? How much money do I make? Did I graduate high school? The questions went on and on, scrutinizing me as a parent and somehow blaming me directly for my son’s autism. The social workers were ready to take Max from me that very day, but Brian stepped in and stopped them. I sat silently and watched the negotiations unfold. I let Brian and his mom fight my battle for me and work out a deal that would prevent Max from being removed or my being coerced into giving him up voluntarily. The blond eventually relented. She flat out said that Max was only allowed to come home with me because I had Brian in my life and he was a “stabilizing influence.” What amazed me was that I was spared having my son being taken away from me because I had a man in my life. His mom also pledged her support. My degree from CU, my contributions to the community before I got involved with Train Wreck meant nothing. Instead I was the ex of a felon who did meth. Surely, I was the same way. The fact that he was violent didn’t matter. Neither was the fact that TW had a plan to kill me and take my son. Somehow, I was at fault for all of this and my son would be better in the hands of others. I didn’t argue with their assessment. Instead, I calmly sat holding my son. I looked into his big blue eyes. Unteachable. Unreachable. Max smiled at me and pulled on my necklace, burying his face into my arm. I held him and rocked him. We started playing our own game, tuning out the din of the voices that surrounded us. I knew right then that my Max was going to be okay. I saw a spark in his eyes and I knew he was in there. We didn’t need words to speak to each other. I could reach him. I could teach him. \"Being Max’s is a story about love and one mother’s determination to help her son. The story is raw and honest, coming straight from the heart. Miller provides sound advice, uses humor and is uncensored when describing how she negotiated an autism diagnosis while being in extreme poverty and uninsured. Despite his earlier diagnosis of being “unteachable,” Miller’s son thrived. Her story provides the reader with hope and reaffirms that children like her son are just different, not less. Rebecca Miller’s son Max published his first book in 2014 entitled, \"Hello, My Name is Max and I Have Autism.\" His book describes what life is like on the autism spectrum via art and essays. \"Being Max’s Mom\" is the companion reader to this text.",
  "genres": [],
  "author": "Rebecca   Miller",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/25876569-being-max-s-mom"
}