{
  "title": "You, Again",
  "description": "'Fresh, witty, and utterly romantic , this is the deliciously offbeat modern reimagining of When Harry Met Sally I never knew I needed' Ali Hazelwood , The Love Hypothesis'An enemies-to-lovers, New York-set romcom inspired by When Harry Met Sally ? Yes, please! There are not enough superlatives for how much I adored You, Again ' Sarra Manning, Red Magazine, Top 10 Books of September 2023'This is a romance sung in perfect pitch! A spectacular debut!' Christina Lauren , The Unhoneymooners'Every character is as sexy as they are gloriously messy... a masterclass in banter' Rosie Danan, The Roommate----Ari , a free-spirited struggling comedian, likes to keep things casual, and never sleeps over after hooking up. Josh , born-and-bred Manhattanite, has ambitious plans to take the culinary world by storm, to find The One and live happily-ever-after.After a confrontational first meeting (at the apartment of the woman they are both sleeping with), Ari and Josh never expect their paths to cross again, but years later, as they're both reeling from ego-bruising breakups, a chance encounter leads to a surprising friendship. Turns out, spending time with your former nemesis can be fun when you're both too sad and miserable to hate each other.And as odd as it seems, they become friends-without-benefits, finding comfort in late night Netflix binges, swiping through each other's online dating profiles, and bickering endlessly on their phones across boroughs. It's better than romance. Until one night, the unspoken boundaries of their platonic relationship begin to blur...With sharp observations and sizzling chemistry, YOU, AGAIN explores the dynamics of co-ed friendship in this sparkling romantic comedy of modern love in all its forms.",
  "genres": [
    "Romance",
    "Contemporary",
    "Fiction",
    "Contemporary Romance",
    "Audiobook",
    "Adult",
    "Enemies To Lovers"
  ],
  "author": "Kate Goldbeck",
  "average_rating": "3.57",
  "url": "https://www.goodreads.com/book/show/116352446-you-again"
}