{
  "title": "Jax",
  "description": "MMA Middleweight World Champion, Jackson \"Jax\" Malone has just entered the fight of his life. Known for his viciousness in the cage, and his playboy ways out of it, Jax is arrested and charged with a brutal rape. The thought of spending decades in prison is one of the few things that actually scares the shit out of this cocky fighter.  Newly admitted attorney Page Davenport is willing to do anything it takes to get out from under her father's thumb and finally prove herself in his law firm. Anything except represent the infamous miscreant, Jackson \"The Mauler\" Malone. Despite her protests, Page is powerless to avoid becoming the sacrificial lamb, the token female, who will be the face of the violent, angry Neanderthal's defense team.  Jax is a bad boy with a temper, doing whatever the hell he wants in life while flipping the bird at all his haters. Page is the prim and proper rich debutante her parents want her to be. They've been pulling her strings, telling her what to do, where to go to school, what to wear, and even who she should marry.  Page and Jax struggle to work together, engaging in a knockdown drag-out fight for dominance. When they finally stop taking swings at each other, they're both surprised to realize that sometimes first impressions are completely wrong. In fact, opposites really do seem to attract. However, there are lines that attorneys and their clients can never cross, if Page wants to keep her license to practice law.  Will Page risk it all and submit to the cocky fighter? Or will Jax's temper and jealousy prove too much for her to take on outside of the courtroom?  Either way, one thing is for sure - neither Page nor Jax are going down without a fight. In the end, the secret for them to find heaven may be to battle their way through hell first.  This 72K word book has a HEA with no cliffhanger.",
  "genres": [
    "Romance",
    "Sports",
    "Mixed Martial Arts",
    "Fighters",
    "Sports Romance",
    "Contemporary",
    "Contemporary Romance"
  ],
  "author": "Lane Hart",
  "average_rating": "4.23",
  "url": "https://www.goodreads.com/book/show/25871501-jax"
}