{
  "title": "Learning Mandarin for the Fish and Chips: Learning Mandarin Chinese in Taiwan and Mandarin Legal Work in London",
  "description": "For one reason or another, after I arrived in Taiwan, I became the world's most serious student. I spent almost every hour in the day memorizing Chinese characters, using special recording machines to listen to the feedback of my spoken Chinese tones and even learning Cantonese at the same time. I probably went to sleep quite early during this time and all I remember dreaming of was my Chinese characters, but I was often awake or kept half awake waiting for the next creak, crash, bang, unknown sound or throat clearing from the Unbelievable Character that always showed up just after I had fallen asleep and stayed awake until the early hours of the morning playing a symphony on the creaky chair which synced with my sleeping and non-sleeping patterns so that just after I had fallen asleep again, I was again awaken by a particularly loud creak, throat clearing, interminable cupboard opening scrape...a moment of quiet ....some further delay here then.........light cough. Then it started all over again a short while later after I had just fallen into a deep sleep.I made the most of this so that every time I woke up, I went back to revising the day's new characters in my mind. I tried to memorize 50 new characters, including all the four essentials, of each character every day. This was alongside all the other things you need to do to learn a language such as doing language exchanges, learning the tones, and many other things.......Opposite this permanently brimming, busy restaurant was another named 'Heng Tu,' which was a particular favourite of mine. Whereas the Four Seasons came bedecked with large round white tables and smart efficient waiters Heng Tu was somewhat run down like the Chinese equivalent of an old English greasy griddle café where ham and chips are served for two pounds fifty, the spooky stained wall shadows come for free, the jukebox is 20 pence and you need to check the buttered toast under your fried egg to confirm it hasn't been burned to black carbon dust before you eat it if you don't wish to expire from cancer on the spot....Mrs. Huang came to the UK in 1992 as a student and then overstayed her visa. She had since then disappeared into the thin air. Every attempt by the authorities to apprehend her- attempt, well - there really were no attempts to speak of mind you as they had been too preoccupied with tending the crown estate bonzai trees, climbing ladders to dust off outsized paintings of Lord Curzon, polishing black and white chequered marble floors and knocking back bottles of Tizer while watching the cricket in luxurious mahogany paneled rooms with enormous windows- had been futile until she was arrested recently for selling wonky DVDs. She had then applied to remain as the wife of her now husband who was British, but the Home Office was requesting that she return to home country and apply again from there....From my own initial learning experiences, I realized that to memorize each character, you need to learn what I called \"The Four Essentials\" which 1. The various meanings of a character - which sometimes even have opposite meanings2. The component parts - that enables you to write it effectively3. The pronunciation(s) - characters regularly have two pronunciations4. The tone(s) - as aboveI felt I needed a place to put all these pieces of information, in a more physical sense, so that I would have more confidence I could recall each bit of data when I needed it. I then used a memory room, for example the room where I was staying, and created a character memorization story for each character that I learned within that room.",
  "genres": [],
  "author": "Hastings Cavendish",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/25881299-learning-mandarin-for-the-fish-and-chips"
}