{
  "title": "The Hopkins Manuscript",
  "description": "Recently there was a revival of one of the greatest of C20th stage plays, Journey's End (1929). It was wonderfully acted and produced, prompting us to search out the author's other work. R C Sherriff (1896-1975) had served in WW1; when he returned to his job as an insurance clerk he wrote plays for his local amateur dramatic club and, eventually, Journey's End, based on his letters home from the Front. During the 1930s he worked in Hollywood, writing screenplays for films such as Goodbye Mr Chips (1933) and The Four Feathers (1938); meanwhile he wrote novels, including A Fortnight in September (1931), which Persephone Books will publish in 2006, and a 1939 catastrophe novel 'written' by 'Edgar Hopkins'.I n The Hopkins Manuscript we watch through his eyes as the moon veers off course, draws slowly closer to the earth, and finally crashes into it on May 3rd 1946. Because it falls into the Atlantic much of humanity survives – only to generate new disasters. But this is not science fiction in the mode of H G Wells's The War of the Worlds; it is a novel about human nature.The 'manuscript' was named after its 'author', a retired Hampshire schoolmaster whose greatest interest in life is his Bantam hens; rather self-important and lacking much sense of humour, Edgar Hopkins nevertheless emerges as an increasingly sympathetic and credible character, the ordinary man with whom we very much identify as Sherriff describes the small Hampshire village trying to prepare itself in its last days. In Journey's End he evoked the trench experience as he had lived it; in The Hopkins Manuscript he describes the catastrophe as he might have lived it.But the book is also a superbly written novel in its own right, one which we are sure readers will find as unforgettable as any of Persephone Books' other titles. We defy anyone not to be overwhelmed by the scene when the villagers staunchly play a last game of cricket by the light of the moon that 'hung like a great amber, pock-marked lamp above a billiard-table, so vast and enveloping that the little white-clad cricketers moved without shadows to their appointed places on the field.'So how did 'the destruction of the Western civilisation' happen?  In 1945 (and there is a wonderful irony that, writing in 1939, Sherriff anticipated that our civilisation might be destroyed then) scientists discovered, during an eclipse of the sun, that the moon was twelve seconds late in its arrival and had drawn nearer to the earth by 3,583 miles; subsequent observations showed that it was continuing to approach at a speed increasing steadily by eight miles a day. Disaster had become inevitable.R C Sherriff made the scientific aspect of The Hopkins Manuscript strangely plausible even though, as Michael Moorcock writes in his Preface, 'he did not believe that there was any immediate likelihood of the moon crashing into the Earth.  We write such books not because we are convinced that they describe the future, but because we hope they do not.' Nonetheless, Sherriff's writing is so convincing that we have added a scientific explanation of the events in the book; this was written by the Big Bang scientist George Gamow for a 1963 US reprint.The reason The Hopkins Manuscript was reprinted then was because of the near-catastrophe of the Cuban Missile Crisis the year before; the previous reprint had been in 1958, at the height of the world's desperate anxieties about the H-Bomb; and the original publication was in the spring of 1939 when many believed that, once war was declared, Hitler would destroy civilisation as they knew it. And the 2005 reprint? The largest threat facing mankind today is global warming. The Hopkins manuscript can be read as a gripping and extremely interesting novel in its own right; but also as a parable of the possibly catastrophic effects of climate change.",
  "genres": [
    "Science Fiction",
    "Fiction",
    "Classics",
    "Dystopia",
    "British Literature",
    "Post Apocalyptic",
    "Speculative Fiction"
  ],
  "author": "R.C. Sherriff",
  "average_rating": "4.09",
  "url": "https://www.goodreads.com/book/show/2588395-the-hopkins-manuscript"
}