{
  "title": "All Is Calm / All Is Bright",
  "description": "All Is CalmBrendan Waddell needs a place to recuperate. Lauren Everman needs a place to hide. It's going to be an unexpectedly romantic Christmas at Bluebird Ranch.Brendan Waddell has always considered Bluebird Ranch a little piece of heaven: an idyllic ranch that pairs abused children with abused horses, run by one of his old Marine buddies. Now, recovering from an on-the-job injury, Brendan thinks the ranch is the perfect place to spend Christmas healing up.When Lauren Everman was a seventeen-year-old foster kid, Bluebird Ranch was the safest place she knew. Now it's the perfect hideout for a woman on the run. As the witness to a murder, Lauren needs somewhere to lie low, and her skill with horses means she'll be able to lend a hand with the troubled kids at Bluebird—without answering too many questions.Lauren's rich hair, high cheekbones, and dark eyes immediately get Brendan's attention—but so does her secretive behavior. This Special Ops Intel man knows a woman on the run when he sees one, and he's not about to let her put Bluebird Ranch at risk.But as Brendan and Lauren get to know each other, their suspicions evaporate and romance starts to sizzle. But this would-be couple has more to worry about than each other—there's a killer on the loose who wants Lauren kept quiet.All Is BrightA romantic, Christmas wedding at her seaside hotel gives Delilah a chance to shine with her unique gifts. But will her light be snuffed out before the bride and groom say “I do”?As manager of the Tidewater Inn, Delilah Carter has been planning a spectacular Christmas wedding for her friends at the grand hotel overlooking the ocean. While picking up still more twinkly lights and some last-minute groceries for the reception dinner, a huge truck runs her off the freezing, wet roads into the dark night. Her car stops just short of an enormous tree and the truck speeds off into the night. Delilah escapes with her life and has almost convinced herself the whole thing was an accident, but then she begins to receive threatening phone calls. With the wedding just hours away, she's distracted and anxious. Then Sheriff Tom Bourne stops by the inn and volunteers to help.Tom has always had a soft spot for Delilah, and he's determined to protect her. But he is pulled away by a bizarre Christmas stunt that has the neighborhood reeling, and Delilah is attacked again.Will Delilah have to cancel the Christmas wedding at Tidewater Inn? And will Tom's protection be enough to save Delilah from the shadowy figure looming in the background?",
  "genres": [
    "Christmas",
    "Romance",
    "Christian Fiction",
    "Fiction",
    "Suspense",
    "Mystery",
    "Contemporary"
  ],
  "author": "Colleen Coble",
  "average_rating": "3.81",
  "url": "https://www.goodreads.com/book/show/25880543-all-is-calm-all-is-bright"
}