{
  "title": "Dragon Guard Series Box Set, #1",
  "description": "Enter the World of the Dragon Guard and ... Forever be Changed.This volume contains the first seven books in the bestselling Dragon Guard series in one place plus a BONUS book!There Are No Coincidences. The Universe Does Not Make Mistakes. Fate Will Not Be Denied.Book 1: Her Dragon to Slay (Revised, rewritten and re-edited!!!!!) The chemistry between a strong-willed curvy girl and fierce warrior makes all the difference in the world where nothing is as it seems. The existence of an ancient race of honor-clad, tradition-bound protectors might be hard to accept but now the dead are coming back to life and holding a knife to her neck. Can these fated mates defeat their greatest enemies and get their happily ever after? Book 2: Her Dragon’s Fire (Revised, rewritten and re-edited!!!!!)Her brilliant blues eyes and luscious curves have fueled his fantasies for over six years. The guilt of his younger brother’s death a weight around his heart that kept him from claiming the one the Universe had made for him. Now, nothing was as he thought and the woman he believed was unattainable is within his grasp, if only he can keep her safe from those that would use her to hurt him. Book 3: Haunted by Her Dragon Lance has spent his long life cracking jokes and making fun of his brethren as each succumbed to the sappiness of everlasting love with the one that completes them like no other. Now the Universe is the one laughing and his fellow Guardsmen are the ones making jokes as the mating call of his kin push him headlong towards the one that will bring light to his soul. He can no longer deny that he is meant to spend the rest of his many years with Sam but his obligation to eliminate any threats to her life must come first…right? For the Guardsman who has hot-dogged his way through one hundred and twelve years, one brown-eyed curly-headed doctor will make him rethink everything he ever knew. Book 4: For the Love of Her Dragon Two souls…destined for a Great Love decreed by Fate. But Fate has Her hands full with this couple, and if that wasn’t enough, the traitor has an army ready to destroy all they both hold dear. Can Royce forget the past and believe in the future? Can Kyra forgive a betrayal that cuts deep and believe Love will always find a way? Can they defeat an evil with no conscience, only the desire for vengeance? The Universe, the Goddess and Fate have their work cut out for them if Kyra is to know the love of her dragon. Book 5: Saved by Her Dragon Anya is the light of his soul and the only woman able to tame the beast within. Devon has the strength and knowledge she will need in the coming days. Together, they just may be the key to saving Dragon kin. All they have to do is defeat the traitor…but that means they have to find him first. Book 6: Only for Her Dragon Nobody said it was going to be easy. The fight will be real. It will take compromise and a love created by the Universe. Only Charlie can take the leap of faith, and only for her dragon... Book 7: Fighting for Her Dragon One doomed dragon. One very special woman. One destiny no one could have predicted. Will they save dragon kin or destroy it? ... and the BONUS book!Book 8: Her Dragon’s Heart What do you get when you combine one head-strong dragon shifter with a young woman whose past won’t stay hidden, add a coven of demon-raising wizards and a Fate that will not be denied? The perfect recipe for sizzling romance, spine-tingling intrigue, sword swinging action and swoon-worthy love.",
  "genres": [
    "Dragons",
    "Shapeshifters",
    "Paranormal",
    "Amazon",
    "Romance",
    "Paranormal Urban Fantasy",
    "Fantasy"
  ],
  "author": "Julia Mills",
  "average_rating": "4.54",
  "url": "https://www.goodreads.com/book/show/25878640-dragon-guard-series-box-set-1"
}