{
  "title": "The Victim",
  "description": "In the spring of 2003 on a desolate stretch of Arizona highway, Anton Mackey’s life was changed forever. A reckless decision to get behind the wheel when he was in no condition to drive spawned a moment that threatened to destroy everything the 21 year-old had spent his life working toward. In an instant, Anton made a decision to save himself. A decision that claimed the lives of two people.Eleven years later, Anton is a rising star in the Miami criminal defense community. He is married and has an infant daughter. He is earning a good living and steadily building a name for himself as an aggressive advocate for the accused. Anton shares an office with veteran defense attorney, Jack Savarese. A mentor of sorts, Anton strives to model his practice - and career - after Jack’s. A Miami criminal defense legend, Jack’s accomplishments in the courtroom are second to none. However, Jack remains burdened by the conviction of Osvaldo Garcia, a mentally-ill client from ten years earlier found guilty and sentenced to life in prison for the death of a troubled teen.When Daniella Avery, the beautiful wife of a man accused of a heinous act of domestic violence, comes into Anton’s office seeking his services, Anton thinks he’s landed a great case with a great fee. But when he succumbs to temptation, he realizes that Daniella is a figure from his past. Anton finds himself caught between the possibility of being exposed and the fact that his client - Daniella’s husband - may be an innocent pawn in the victim’s attempt to carry out her revenge against Anton. As Anton struggles to balance defending his client while concealing the secret he has sought to forget, he uncovers the truth behind what really happened on that highway eleven years earlier. The truth that may be connected to the conviction of Osvaldo Garcia.",
  "genres": [
    "Thriller"
  ],
  "author": "Eric  Matheny",
  "average_rating": "4.06",
  "url": "https://www.goodreads.com/book/show/25879359-the-victim"
}