{
  "title": "Return to Cooter Crossing",
  "description": "Aidan Quinn is having a good day, possibly the best day of his life, at least since moving to Dublin. He just received word that his degree committee approved his PhD and he’s on his way home, with lamb chops, chard, and a bottle of wine. Time to celebrate in the little cottage he shares with his mentor and lover, Dr. David Stokes. But, something is wrong when he gets home. Dr. Stokes has found a new student to “mentor.”  Like any good Irish-American lad, he gets drunk and heads home to his mother. He hopes to find himself and make plans for a new future in the quiet backwater town of Cooter Crossing. But, he forgot what it’s like being part of a large family in an extremely small town. He gets off the plane in Tampa and finds his little sister is pregnant and won’t tell anyone who the father is. His next two older brothers, Danny and Dillon, are keeping secrets, and the oldest, Rory, shows up with his son, Sean, expecting Aidan to help him navigate Sean’s coming out.  Just as Aidan thinks he’s finally getting ahead of the family drama, and settling back into life in a small Florida village, someone shoots him. And people start dying. Will he find a way to put all the pieces back together? Will he find a new direction for his life? And, what really happened to Mrs. DeWitt’s prize rooster?  “Return to Cooter Crossing” is a contemporary southern family drama with strong characterization and set in Stephen del Mar’s rich world of Bennett Bay and Big Cypress County, Florida. Although not a part of the paranormal series “The Live Oak Tales,” this story takes place after the events in “Hunter Moon and the Red Wolf” and includes a few familiar characters from that series, such as Innes Callahan and his sister Fi, Allen Clark, Deputy JJ Jackson, Max Crawford and Marcus Murphy, among others.",
  "genres": [
    "M M Romance",
    "Contemporary",
    "Romance",
    "Amazon"
  ],
  "author": "Stephen del Mar",
  "average_rating": "4.30",
  "url": "https://www.goodreads.com/book/show/25881342-return-to-cooter-crossing"
}