{
  "title": "The Oregon Trail: A New American Journey",
  "description": "The Oregon Trail is an epic account of traveling the length of the Oregon Trail the old-fashioned way—in a covered wagon with a team of mules, an audacious journey that hasn’t been attempted in a century—which also chronicles the rich history of the trail, the people who made the migration, and its significance to the country.Spanning two thousand miles and traversing six states from Missouri to the Pacific coast, the Oregon Trail is the route that made America. In the fifteen years before the Civil War, when 400,000 pioneers used the trail to emigrate West—scholars still regard this as the largest land migration in history—it united the coasts, doubled the size of the country, and laid the groundwork for the railroads. Today, amazingly, the trail is all but forgotten.Rinker Buck is no stranger to grand adventures. His first travel narrative, Flight of Passage, was hailed by The New Yorker as “a funny, cocky gem of a book,” and with The Oregon Trail he brings the most important route in American history back to glorious and vibrant life.Traveling from St. Joseph, Missouri, to Baker City, Oregon, over the course of four months, Buck is accompanied by three cantankerous mules, his boisterous brother, Nick, and an “incurably filthy” Jack Russell terrier named Olive Oyl. Along the way, they dodge thunderstorms in Nebraska, chase runaway mules across the Wyoming plains, scout more than five hundred miles of nearly vanished trail on foot, cross the Rockies, and make desperate fifty-mile forced marches for water. The Buck brothers repair so many broken wheels and axels that they nearly reinvent the art of wagon travel itself. They also must reckon with the ghost of their father, an eccentric yet loveable dreamer whose memory inspired their journey across the plains and whose premature death, many years earlier, has haunted them both ever since.But The Oregon Trail is much more than an epic adventure. It is also a lively and essential work of history that shatters the comforting myths about the trail years passed down by generations of Americans. Buck introduces readers to the largely forgotten roles played by trailblazing evangelists, friendly Indian tribes, female pioneers, bumbling U.S. Army cavalrymen, and the scam artists who flocked to the frontier to fleece the overland emigrants. Generous portions of the book are devoted to the history of old and appealing things like the mule and the wagon. We also learn how the trail accelerated American economic development. Most arresting, perhaps, are the stories of the pioneers themselves—ordinary families whose extraordinary courage and sacrifice made this country what it became.At once a majestic journey across the West, a significant work of history, and a moving personal saga, The Oregon Trail draws readers into the journey of a lifetime. It is a wildly ambitious work of nonfiction from a true American original. It is a book with a heart as big as the country it crosses.",
  "genres": [
    "Nonfiction",
    "History",
    "Travel",
    "Memoir",
    "Biography",
    "American History",
    "Audiobook"
  ],
  "author": "Rinker Buck",
  "average_rating": "3.85",
  "url": "https://www.goodreads.com/book/show/25881642-the-oregon-trail"
}