{
  "title": "Fireheart",
  "description": "***National Finalist in the RWA On the Far Side contest!***In a land of dying magic and vanished elves, two warriors are brought together by fate and discover a passion that unleashes a lost magic. Lelia​na is the famed commander of Syldor's army. The Fire Maidens, her elite guard, are feared across the Realm. But power and leadership are lonely. Leliana has given up on love and embraced a life of war and pleasure.Daryn Raine needs an army. A Dark Dragon, believed extinct, has destroyed his city and forced his people to flee. When the Jutland general seeks refuge in Syldor, he doesn't expect to be so attracted to their commander. And he never expects to fall in love.Leliana and Daryn set off on a quest to slay the Dark Dragon, but along the way they forge a bond that defies logic. When the boundaries of these passionate warriors are tested, can Leliana give their relationship a chance? And can Daryn honor his duty and his love--or will he be forced to choose?In the first book of the Fire Maiden series, Leliana and Daryn face a Dark Dragon, betrayal, and internal battles as their relationship turns from passion to something deeper—something magical.FIREHEART is Book One of the Fire Maiden series. It can be read as a standalone novel.Note: Previously published as two books, now released in one volume. This edition of Fireheart contians what used to be book 2, Fire & Raine.--------------Sensuality Level: SteamyFull length fantasy romance novel: 112,000 words | approx. 465 pages in paperbackThis story takes place in a land free of gender roles and sexual orientation as we know them. The characters and plot reflect this enticing reality.Contains mature themes intended for readers 18+, including plenty of exciting sword fights and love scenes between irresistible characters.",
  "genres": [
    "Fantasy"
  ],
  "author": "Natalia Marx",
  "average_rating": "3.47",
  "url": "https://www.goodreads.com/book/show/25882020-fireheart"
}