{
  "title": "The Witch Queen",
  "description": "Jan Siegel has created one of the most compelling fantasy series in recent memory. What began with Prospero’s Children and continued with The Dragon Charmer now comes to a dazzling conclusion with  The Witch Queen . Magnetically gifted Fern Capel has at last come into her own with her magical powers—and just in time. . . .It is a fearsome world of witches, dragons, and goblins, where a gnarled tree bears fruit of human heads. Fern Capel believes she has left it all behind. But now that world is seeping into modern day The witch-queen Morgus, who had imprisoned Fern in the ghostly Otherworld, has returned from countless years of exile beneath the gruesome Eternal Tree. Stalking the twenty-first century in her Prada stilettos, Morgus has the mindset of the Dark Ages and vows to rule the ancient kingdom of Logrez, now modern Britain.Most of all, Morgus wants revenge on Fern Capel. Rejuvenated through sorcery, neither charm nor weapon can harm the witch-queen. She has planted a cutting from the Eternal Tree in the real world and awaits with impatience the ripening of its terrifying bounty. When Fern learns that her enemy cannot be defeated through conventional means, she turns to her best friend, Gaynor, her brother, Will, her old mentor, Ragginbone, and Maldo, the goblin-queen. Together, they track Morgus through London’s high-society parties and seedy, sinister contacts, until they finally draw a magic circle in a Soho basement. Fern Capel knows that survival is not This time she must win. But she does not yet understand how high a price she will have to pay.In this thrilling final novel of her acclaimed trilogy, Jan Siegel takes advantage of her greatest strengths as a writer—weaving magic into a modern-day world and bringing vivid life to a host of characters that readers will not soon forget.",
  "genres": [
    "Fantasy",
    "Fiction",
    "Young Adult",
    "Witches",
    "Urban Fantasy",
    "Science Fiction Fantasy",
    "Supernatural"
  ],
  "author": "Jan Siegel",
  "average_rating": "3.84",
  "url": "https://www.goodreads.com/book/show/116366.The_Witch_Queen"
}