{
  "title": "Sun Tzu Was a Sissy: Conquer Your Enemies, Promote Your Friends, and Wage the Real Art of War",
  "description": "We live in a vicious, highly competitive workplace environment, and things aren't getting any better. Jobs are few and far between, and people aren't any nicer now than they were when Ghengis Khan ran around in big furs killing people in unfriendly acquisitions. For thousands of years, people have been reading the writings of the deeply wise, but also extremely dead Chinese philosopher Sun Tzu, who was perhaps the first to look on the waging of war as a strategic art that could be taught to people who wished to be warlords and other kinds of senior managers. In a nutshell, Sun Tzu taught that readiness is all, that knowledge of oneself and the enemy was the foundation of strength and that those who fight best are those who are prepared and wise enough not to fight at all. Unfortunately, in the current day, this approach is pretty much horse hockey, a fact that has not been recognized by the bloated, tree-hugging Sun Tzu industry, which churns out mushy-gushy pseudo-philosophy for business school types who want to make war and keep their hands clean. Sun Tzu was a Sissy will transcend all those efforts and teach the reader how to make war, win and enjoy the plunder in the real world, where those who do not kick, gouge and grab are left behind at the table to pay the tab. Students of Bing will be taught how to plan and execute battles that hurt other people a lot, and advance their flags and those of their friends, if possible. All military strategies will be explored, from mustering, equipping, organizing, plotting, scheming, rampaging, squashing and reaping spoils. Every other book on the Art of War bows low to Sun Tzu. We're going to tell him to get lost and inform our readers how real war is currently conducted on the battlefield of life.",
  "genres": [
    "Business",
    "Nonfiction",
    "Humor",
    "Philosophy",
    "Leadership"
  ],
  "author": "Stanley Bing",
  "average_rating": "3.17",
  "url": "https://www.goodreads.com/book/show/2588.Sun_Tzu_Was_a_Sissy"
}