{
  "title": "The Wedding Rescue, Complete",
  "description": "The Wedding Rescue, the hot and sexy series by Alexa Wilder, is now available as a complete series. For the first time you can read all five books in one volume! She thinks she's not his type. He's determined to prove her wrong. Leigha Carmichael is used to the quiet life. A junior accountant by day, she knows girls like her don't have exciting lives. She's smart, shy and her curvy body doesn't fit in among the beauty queens of Las Vegas. Still reeling from her ex-boyfriend's betrayal, Leigha's sworn off all men. Except she has a huge problem, and only the right man can solve it.  The moment he sees her across a crowded bar, Dylan Kane knows he wants her. And Dylan Kane always gets what he wants. Especially when the object of his desire is sitting in his own casino. She's nothing like the skinny, overly made up women he's used to. From her clear gray eyes to her luscious curves, Leigha is the real thing. Exactly the change of pace he's been looking for. And even better, she needs something from him. With the bargain he has in mind, they'll both get exactly what they want.  In the few days she's his, Dylan plans to take control of every delectable inch of Leigha's body. But when the weekend is over, will he be able to let her go? **This hot and steamy alpha billionaire romance is perfect for fans of Hannah Ford, Lila Monroe, Cassie Cross and J.S. Scott**   BOOK ONE EXCERPT: I saw her across a crowded room. It’s such a cliché, especially for me. I see beautiful women across crowded rooms all the time. The Delecta was my casino, and she was sitting at my bar.  It’s hard to say what made me stop. She wasn’t a showgirl or a model, and nothing like the tall, skinny, overly made up women I was accustomed to. No, she was something else. She was real.  When was the last time I’d had real? Real curves, generous enough to have her hips straining the seams of her navy blue dress. Real tits. Had to be. They were soft and full, even from a distance. They, too, strained against her dress. Mouthwatering. And her lips. A plump bow, ready to open for me. I had to see more.",
  "genres": [
    "Romance",
    "Contemporary Romance",
    "Contemporary",
    "Audiobook",
    "Erotica",
    "Romantic",
    "Fiction"
  ],
  "author": "Ivy Layne",
  "average_rating": "4.34",
  "url": "https://www.goodreads.com/book/show/25877511-the-wedding-rescue-complete"
}