{
  "title": "The Winter Sword",
  "description": "The bestselling historical fiction story you have been looking for...“ One of my favorite genres-- and when practiced very well as with Mr. Longward's series, it is the Best.” – Amazon review”I'm impressed with how this series was crafted. I was not disappointed. I've shared this series with a couple of my friend who like movies and books about ancient times and they loved it. The battles are epic and I like how the author used accurate historical events to tie into the plot.” – Amazon reviewHraban’s dice are cast.He has chosen to serve Nero Claudius Drusus, the mighty Roman general and the stepson of the princeps of Rome; Augustus. He has abandoned his hope of ever finding fame and home with the Marcomanni and has turned his back on Armin the Cherusci, who offered him a place amongst the foes of Rome and of Maroboodus, Hraban’s traitorous father, who is working for Rome.Yet, the fate of Drusus is not to idle in Gaul, but to take the war to Armin and the Cherusci, and Hraban follows him to war, serving the great lord in his drive to slay Armin and to pacify lands east of Rhenus River. In the land of the Cherusci, Hraban will uncover dangerous plots against Drusus, he will seek his lost daughter Lif and he shall try to finish his grudges as the tumultuous events inevitably lead to a summer of war.Will Hraban’s Winter Sword deal with Maroboodus and Odo, finally to lead Hraban into peace, or shall he simply find a darker road to follow?Perfect for those who love the stories of Bernard Cornwell, Colleen McCullough, Simon Scarrow, and Griff Hosker, the Hraban Chronicles will take you on an incredible and authentic road through the ancient Roman Empire and into the secretive court of Augustus and Tiberius. We will be following Hraban’s relentless pursuit for the truth behind the deaths of his family, and for the causes of his misfortune.The book contains graphic violence and is not suited for a reader seeking a fast read.",
  "genres": [
    "Historical Fiction"
  ],
  "author": "Alaric Longward",
  "average_rating": "4.36",
  "url": "https://www.goodreads.com/book/show/25888365-the-winter-sword"
}