{
  "title": "The Fall of the Red Queen",
  "description": "Madlyn Robicheaux earned her reputation as the Red Queen. She crushes her opponents with a calculated ruthlessness that never loses. Jared Marshall is a distraction she doesn’t want or need. Even worse, he’s a threat. If she’s not careful, he could blow the lid off everything she’s spent ten years protecting, but crushing Jared is proving as impossible as resisting him. Jared Marshall hates being a lawyer, he’d rather play with his band at Trick’s or make cheesecake at his bakery. His one shot at avoiding the family firm rests on convincing the Red Queen to join Marshall and Marshall. But when his legendary charm fails, he falls straight through the looking glass where nothing is as it seems. And the chemistry that blows up between them exposes a shocking vulnerability that questions everything he’s ever believed about her.  --------------------------------------------------The Fall of the Red Queen is Book 3 in the Southern Style Series. While it can stand alone, it’s highly recommended that you read Sweetened with a Kiss first. Not a serial. Each book in the Southern Style Series features a different couple with standalone HEA. It's category style contemporary romance told in third person from the point of view of both hero and heroine. It has been professionally edited, copy-edited and proofed. Intended for mature audiences only. THE FALL OF THE RED QUEEN weaves a fascinating storyline and larger-than-life characters with super intense sexual chemistry. The wicked witch and the bad boy have never been so good together. This book elevates Callahan's Southern Style Series into something really special and unforgettable. It made me cry, and I don't do that very often reading romance. Don't miss this beautifully-written, sexy, and emotional addition to the series. Highly Recommend. Grade: A+Penny Watson, Bestselling author of APPLES SHOULD BE RED",
  "genres": [
    "Contemporary Romance",
    "Enemies To Lovers",
    "Romance",
    "Contemporary"
  ],
  "author": "Lexxi Callahan",
  "average_rating": "4.23",
  "url": "https://www.goodreads.com/book/show/25891237-the-fall-of-the-red-queen"
}