{
  "title": "Breakdown",
  "description": "NEW YORK TIMES BESTSELLER • Jonathan Kellerman has been universally hailed as the master of psychological suspense, and the blockbuster new thriller featuring Alex Delaware and Milo Sturgis confirms his status as today’s preeminent practitioner of saber-sharp storytelling.   Psychologist Dr. Alex Delaware meets beautiful and emotionally fragile TV actress Zelda Chase when called upon to evaluate her five-year-old son, Ovid. Years later, Alex is unexpectedly reunited with Zelda when she is involuntarily committed after a bizarre psychotic episode. Shortly after Zelda’s release, an already sad situation turns tragic when she is discovered dead on the grounds of a palatial Bel Air estate. Having experienced more than enough of L.A.’s dark side to recognize the scent of evil, Alex turns to his friend LAPD Lieutenant Milo Sturgis for help in finding out who ended Zelda’s broken life.   At the same time, Alex is caught up in another the search for Zelda’s missing son. And when other victims vanish from the same upscale neighborhood, worry turns to terror.   As Alex struggles to piece together the brief rise and steep fall of a gorgeous, talented actress, he and Milo unveil shattered dreams, the corruption of a family, and a grotesque betrayal of innocence. With each devastating revelation and damning clue, Alex’s brilliant mind is challenged as never before—and his determination grows to see a killer caged and the truth set free.Praise for Breakdown   “This is a book you should not miss. . . . A master craftsman at the top of his game . . . one of his best to date.”—Bookreporter “Gripping . . . an exhilarating masterclass in the art of plotting, suspense, characterization and brilliant mind games.”—Blackpool Gazette   Praise for Jonathan Kellerman   “Jonathan Kellerman’s psychology skills and dark imagination are a potent literary mix.”—Los Angeles Times   “Kellerman doesn’t just write psychological thrillers—he owns the genre.”—Detroit Free Press",
  "genres": [
    "Mystery",
    "Fiction",
    "Thriller",
    "Crime",
    "Mystery Thriller",
    "Audiobook",
    "Suspense"
  ],
  "author": "Jonathan Kellerman",
  "average_rating": "3.97",
  "url": "https://www.goodreads.com/book/show/25892497-breakdown"
}