{
  "title": "Deadly Messengers",
  "description": "3 massacres, 2 detectives, 1 writer, 0 answersFreelancer Kendall Jennings writes fluff pieces for women’s magazines. When a horrific massacre occurs at Café Amaretto, she scores an exclusive interview with a survivor. Suddenly, she’s the go-to reporter for the crime. Investigating veteran detective Lance O’Grady and his partner Trip are tasked with finalizing the open and shut case. Seven people are dead at the hands of an unprovoked killer wielding an axe. It seems simple.Then another mass killing occurs. This time, arson, and ten eldercare facility residents die in the blaze. Both killers die at the scene. The crimes have no motive, and Lance O’Grady is left wondering how evil can strike twice.Then it happens again. Even more shocking: a mother with a gun goes on a rampage at a family birthday party.The killers share one odd detail: none have a murderer’s profile. No history of violence, no connection to terrorists, no vendettas. Ordinary citizens suddenly became killers. Drawn deeper inside the crime investigation, Kendall finds herself not only clashing with O’Grady but also struggling with old demons. O’Grady resents Kendall’s involvement as her presence provokes memories of a personal tragedy.O’Grady and Kendall are caught up in a plan greater reaching than the crimes. They just don’t know it. Someone is sending a message. And unless they can decipher the meaning, very soon, many more will die.Deadly Messengers is a page-turning thriller taking readers into the minds of mass killers in all their disconcerting madness. It poses the question: Is there a killer lurking inside everyone? The answer could prove more frightening than the crimes.",
  "genres": [
    "Thriller",
    "Mystery",
    "Crime",
    "Fiction",
    "Suspense",
    "Psychological Thriller",
    "Mystery Thriller"
  ],
  "author": "Susan May",
  "average_rating": "3.63",
  "url": "https://www.goodreads.com/book/show/25892846-deadly-messengers"
}