{
  "title": "Orson Welles, Vol. 3: One-Man Band",
  "description": "• A  New York Times Book Review  Editors’ Choice •The third volume of Simon Callow’s acclaimed Orson Welles biography, covering the period of his exile from America (1947 – 1964), when he produced some of his greatest works, including Touch of EvilIn One-Man Band , the third volume in his epic and all-inclusive four-volume survey of Orson Welles’s life and work, the celebrated British actor Simon Callow again probes in comprehensive and penetrating detail into one of the most complex, contradictory artists of the twentieth century, whose glorious triumphs (and occasional spectacular failures) in film, radio, theater, and television introduced a radical and original approach that opened up new directions in the arts. This volume begins with Welles’s self-exile from America, and his realization that he could function only to his own satisfaction as an independent film maker, a one-man band, in fact, which committed him to a perpetual cycle of money raising. By 1964, he had filmed Othello , which took three years to complete; Mr. Arkadin , the most puzzling film in his output; and a masterpiece in another genre, Touch of Evil , which marked his one return to Hollywood, and like all too many of his films was wrested from his grasp and reedited. Along the way he made inroads into the fledgling medium of television and a number of stage plays, of which his 1955 London Moby-Dick is considered by theater historians to be one of the seminal productions of the century. His private life was as spectacularly complex and dramatic as his professional life. The book reveals what it was like to be around Welles, and, with an intricacy and precision rarely attempted before, what it was like to be him, answering the riddle that has long fascinated film scholars and lovers alike: Whatever happened to Orson Welles?",
  "genres": [
    "Biography",
    "Film",
    "History",
    "Nonfiction",
    "Art",
    "Media Tie In"
  ],
  "author": "Simon Callow",
  "average_rating": "4.41",
  "url": "https://www.goodreads.com/book/show/25894033-orson-welles-vol-3"
}