{
  "title": "One Wild Bird At A Time: Portraits of Individual Lives",
  "description": "The acclaimed scientist's encounters with individual wild birds, yielding “marvelous, mind-altering” ( Los Angeles Times ) insights and discoveriesIn his modern classics One Man’s Owl and Mind of the Raven, Bernd Heinrich has written memorably about his relationships with wild ravens and a great horned owl. In One Wild Bird at a Time, Heinrich returns to his great love: close, day-to-day observations of individual wild birds. There are countless books on bird behavior, but Heinrich argues that some of the most amazing bird behaviors fall below the radar of what most birds do in aggregate. Heinrich’s “passionate observations [that] superbly mix memoir and science” ( New York Times Book Review ) lead to fascinating questions — and sometimes startling discoveries. A great crested flycatcher, while bringing food to the young in their nest, is attacked by the other flycatcher nearby. Why? A pair of Northern flickers hammering their nest-hole into the side of Heinrich’s cabin deliver the opportunity to observe the feeding competition between siblings, and to make a related discovery about nest-cleaning. One of a clutch of redstart warbler babies fledges out of the nest from twenty feet above the ground, and lands on the grass below. It can’t fly. What will happen next? Heinrich “looks closely, with his trademark ‘hands-and-knees science’ at its most engaging, [delivering] what can only be called psychological marvels of knowing” ( Boston Globe ). An eminent biologist shares the joys of bird-watching and how observing the anomalous behaviors of individual birds has guided his research. Heinrich (Emeritus, Biology/Univ. of Vermont; The Homing Instinct: Meaning and Mystery in Animal Migration, 2014, etc.) smoothly describes how studying the daily lives of birds in their natural environments allows him to experience their world vicariously. Now retired and living in a cabin in the Maine woods, he devotes himself to closely observing “his avian neighbors, visitors, and vagrants, and keep[ing] daily records throughout spring, summer, fall, and winter.” Every year, he welcomes a pair of broad-wing hawks who feast at a vernal pond populated by frogs, spring peepers, and salamanders while refurbishing their old nest. Unusually, they provide a fern cover on the nest, which they update on a daily basis after their chicks hatch. Heinrich also includes anecdotes from an earlier time when he still lived in Vermont. Awakened one morning by the loud drumming of a male woodpecker on a nearby apple tree, the author wondered if perhaps he was seeking to attract a female. Surprisingly, when a female was drawn to the sound, he stopped drumming and flew away. The same behavior was repeated the following day. The author’s observations led him to conclude that the bird's drumming was not part of a mating ritual but rather a noisy advertisement of his nest-building skills. Vireos nesting near his cabin allowed him to observe how they deliberately reduced the number of eggs they were hatching to accommodate the reduced food supply after an unseasonal freeze. Heinrich explains that bird-watching has been an important part of his life since he was a boy on his family's farm. When he was 6, they moved from Germany to Maine. Finding familiar birds nesting “immediately made this place our home,” he writes. An engaging memoir of the opportunities for doing scientific research without leaving one's own backyard. (Kirkus)",
  "genres": [
    "Nature",
    "Nonfiction",
    "Birds",
    "Science",
    "Animals",
    "Audiobook",
    "Natural History"
  ],
  "author": "Bernd Heinrich",
  "average_rating": "3.87",
  "url": "https://www.goodreads.com/book/show/25897867-one-wild-bird-at-a-time"
}