{
  "title": "Miss Julia Inherits a Mess",
  "description": "In this entry in Ann B. Ross's New York Times bestselling series, Miss Julia finds herself an executrix on a desperate hunt for a valuable antique so she can honor her friend's last wishes. Don't miss her newest,  Miss Julia Raises the Roof , coming April 2018 from Viking.When Miss Julia hears that Miss Mattie Freeman has taken a fall and is in the hospital, she wishes she'd spent more time getting to know the woman--and not just because she's last to hear about the accident! So when the tumble proves fatal, the last thing Miss Julia expects is a phone call from Ernest Sitton, Attorney at Law. Suddenly Miss Julia finds herself the executrix of Miss Mattie's estate, and from what Ernest has to say, Miss Mattie's coffers weren't exactly full. Determined to find something of value for Miss Mattie's beneficiaries, Miss Julia is faced with a room full of clutter that's now hers to disperse. With the lovelorn caretaker Etta Mae Wiggins working overtime, her good friend Mildred Allen on bed rest, and Helen Stroud cataloging Miss Mattie's furniture, Miss Julia soon realizes she's got a blue-million things to do to honor her friend's last wishes. Thank goodness for Miss Mattie's handsome young neighbor, Nate Wheeler, who's ever ready to help out, and of course for Sam, who's always willing to lend an ear.But when a young man claiming to be Miss Mattie's great-nephew turns up, demanding to live in her apartment while he writes a family history, Miss Julia will find herself closer to Mattie Freeman and her mysterious family than ever before. In this seventeenth installment in the Miss Julia series, Ann B. Ross delivers another hilarious and big-hearted novel celebrating the South's favorite steel magnolia and the unforgettable residents of Abottsville.",
  "genres": [
    "Fiction",
    "Mystery",
    "Cozy Mystery",
    "Humor",
    "Southern",
    "Audiobook",
    "Adult Fiction"
  ],
  "author": "Ann B. Ross",
  "average_rating": "4.07",
  "url": "https://www.goodreads.com/book/show/25894030-miss-julia-inherits-a-mess"
}