{
  "title": "Fiona",
  "description": "Fiona moves from her unstable home in Texas to take an au pair job in a castle in the Scottish Highlands, her deceased mother’s homeland and the place she has always dreamed of visiting. In this riveting, character-driven second novel, the fairy tale life Fiona imagined turns into a nightmare when a decades-old family feud resurfaces and forces her to confront the ghosts of her past—and question her own sanity.Fiona, an independent loner with wild red hair, leaves her fractured home in Texas for a brand-new life in the Scottish Highlands to be the au pair for Poppy Mackenzie, the young daughter of her mother’s recently deceased childhood friends. Fee, as she’s called, is thrilled to be free of her less-than-ideal home life. But there’s another motive driving her eagerness to flee to the Highlands: the desire to reconnect with her mother, who succumbed to suicide after a long battle with schizophrenia when Fiona was only twelve, leaving her to live with distant relatives of her absentee father.Fee doesn’t have much time to settle into her new home—a castle maintained by the Mackenzie family fortune—before a series of strange events starts to make her question her sanity. As the attacks on her mental health become more and more intense, Fee finds herself both the pawn and the target in a ruthless, greed-driven plot with roots that go all the way back to her mother. Alone and friendless in a foreign country and half-convinced she’s losing her mind—just like her mother—Fee must rely on her wits and her street smarts to save not only herself but also the lives of her newfound Scottish family.Meredith Moore’s smart, classic-meets-cool storytelling style delivers fast-paced twists and gobs of drama with raw emotion and literary flair.",
  "genres": [
    "Mystery",
    "Romance",
    "Young Adult",
    "Mental Illness",
    "Fiction",
    "Contemporary",
    "Suspense"
  ],
  "author": "Meredith Moore",
  "average_rating": "3.76",
  "url": "https://www.goodreads.com/book/show/25894088-fiona"
}