{
  "title": "Visitor",
  "description": "The seventeenth novel in Cherryh’s Foreigner space opera series, a groundbreaking tale of first contact and its consequences…The human and atevi inhabitants of Alpha Station, orbiting the world of the atevi, have picked up a signal from an alien kyo ship telling them that the ship is inbound toward Alpha. Five thousand of the inhabitants of Alpha are human refugees from the now derelict Reunion Station. They have seen this scenario before, when a single kyo ship swooped into the Reunion system and, without a word, melted a major section of Reunion Station with a single pass. These refugees, who were rescued through the combined efforts of an allied group of humans and atevi and brought to safety at Alpha, are now desperate with fear.Bren Cameron—brilliant human emissary of Tabini-aiji, the powerful atevi political leader on the mainland below, and also the appointee of the human president of the island nation of Mospheira—is the obvious choice of representative to be sent up to deal with both the panicked refugees and the incoming alien ship.As a member of the spacefaring delegation who rescued the refugees, Bren has talked to kyo before—and even won their trust by saving one of their kind from a Reunioner prison. Because of his remarkable diplomatic and linguistic abilities, Bren managed to communicate with that grateful kyo individual on a limited basis, and he has evidence that that same kyo is on the ship heading to defenseless Alpha Station.But no one can predict what an alien race might do, or what their motivations could be.And Bren Cameron, the only human ever to be accepted into atevi society, is now the one individual with a hope of successfully interacting with the crew of the incoming ship. But Bren knows it will take putting himself in the hands of the kyo.Can Bren count on the gratitude of one individual alien to save his life and the lives of thousands on Alpha Station?",
  "genres": [
    "Science Fiction",
    "Fiction",
    "Aliens",
    "Science Fiction Fantasy",
    "Space Opera",
    "Audiobook",
    "Fantasy"
  ],
  "author": "C.J. Cherryh",
  "average_rating": "4.49",
  "url": "https://www.goodreads.com/book/show/25894045-visitor"
}