{
  "title": "Libertarians on the Prairie: Laura Ingalls Wilder, Rose Wilder Lane, and the Making of the Little House Books",
  "description": "This myth-busting book finally reveals the true story behind the beloved children's classics.Generations of children have fallen in love with the pioneer saga of the Ingalls family, of Pa and Ma, Laura and her sisters, and their loyal dog, Jack. Laura Ingalls Wilder's Little House books have taught millions of Americans about frontier life, giving inspiration to many and in the process becoming icons of our national identity. Yet few realize that this cherished bestselling series wandered far from the actual history of the Ingalls family and from what Laura herself understood to be central truths about pioneer life.In this groundbreaking narrative of literary detection, Christine Woodside reveals for the first time the full extent of the collaboration between Laura and her daughter, Rose Wilder Lane. Rose hated farming and fled the family homestead as an adolescent, eventually becoming a nationally prominent magazine writer, biographer of Herbert Hoover, and successful novelist, who shared the political values of Ayn Rand and became mentor to Roger Lea MacBride, the second Libertarian presidential candidate. Drawing on original manuscripts and letters, Woodside shows how Rose reshaped her mother's story into a series of heroic tales that rebutted the policies of the New Deal. Their secret collaboration would lead in time to their estrangement. A fascinating look at the relationship between two strong-willed women, Libertarians on the Prairie is also the deconstruction of an American myth.Skyhorse Publishing, along with our Arcade, Good Books, Sports Publishing, and Yucca imprints, is proud to publish a broad range of biographies, autobiographies, and memoirs. Our list includes biographies on well-known historical figures like Benjamin Franklin, Nelson Mandela, and Alexander Graham Bell, as well as villains from history, such as Heinrich Himmler, John Wayne Gacy, and O. J. Simpson. We have also published survivor stories of World War II, memoirs about overcoming adversity, first-hand tales of adventure, and much more. While not every title we publish becomes a New York Times bestseller or a national bestseller, we are committed to books on subjects that are sometimes overlooked and to authors whose work might not otherwise find a home.",
  "genres": [
    "Biography",
    "Nonfiction",
    "History",
    "Politics",
    "Books About Books",
    "Biography Memoir",
    "Historical"
  ],
  "author": "Christine Woodside",
  "average_rating": "3.60",
  "url": "https://www.goodreads.com/book/show/25898539-libertarians-on-the-prairie"
}