{
  "title": "When Eagles Burn",
  "description": "September 1944.Germany is being pushed back across Europe but the war is not yet won. A fanatical group within the Nazi hierarchy is determined to do whatever is necessary to tip the balance in the Fatherland's favour.Their plan? Pinpoint guided V2 rockets.From across the seas, the Nazis will be able to hit a specific location with a large enough warhead to guarantee precision assassinations.Their first Winston Churchill.Captain Maddox is a veteran of Britain's Special Operations Executive.He is sent behind enemy lines to Finland thwart this new menace.But finding and stopping the Germans is just the first problem among many. Will the local Finns, battling Soviet Russia, greet him as friend or foe?And what of the Red Army, who want the technology for themselves?Worse still, Maddox quickly realises not everyone on his team wants him to make it through the war alive.\"When Eagles Burn\" is the electrifying first book in the Maddox series.A fast-paced thriller in the style of Alistair MacLean, Jack Higgins and Clive Cussler.\"Another masterful thriller from Jack Hayes. A precision guided bomb explodes in London, throwing the British high command into disarray. But the threat comes not from Nazi Germany but from the trackless wastes and endless winter night of occupied Finland. A team of hand-picked soldiers is parachuted into the area with the most specific instructions and one simple objective. But facing the armed might of both the Nazis and the Red Army isn't their only problem – they have a traitor in their ranks, a man with his own very different agenda. A gripping tale of heroism and treachery.\" -- James Becker, author of \"The Lost Testament\"\"A cracking read!\" -- Roger Hurn, author of \"Business is Murder\"\"A thriller in a class of its own!\" -- Matt Lynn, author of the \"Black Ops\" series.",
  "genres": [
    "Fiction",
    "Historical Fiction",
    "War",
    "World War II",
    "Action"
  ],
  "author": "Jack  Hayes",
  "average_rating": "3.76",
  "url": "https://www.goodreads.com/book/show/25899862-when-eagles-burn"
}