{
  "title": "Massacre on the Merrimack: Hannah Duston's Captivity and Revenge in Colonial America",
  "description": "Early on March 15, 1697, a band of Abenaki warriors in service to the French raided the English frontier village of Haverhill, Massachusetts. Striking swiftly, the Abenaki killed twenty-seven men, women, and children, and took thirteen captives, including thirty-nine-year-old Hannah Duston and her week-old daughter, Martha. A short distance from the village, one of the warriors murdered the squalling infant by dashing her head against a tree. After a forced march of nearly one hundred miles, Duston and two companions were transferred to a smaller band of Abenaki, who camped on a tiny island located at the junction of the Merrimack and Contoocook Rivers, several miles north of present day Concord, New Hampshire.This was the height of King William s War, both a war of terror and a religious contest, with English Protestantism vying for control of the New World with French Catholicism. After witnessing her infant s murder, Duston resolved to get even. Two weeks into their captivity, Duston and her companions, a fifty-one-year-old woman and a twelve-year-old boy, moved among the sleeping Abenaki with tomahawks and knives, killing two men, two women, and six children. After returning to the bloody scene alone to scalp their victims, Duston and the others escaped down the Merrimack River in a stolen canoe. They braved treacherous waters and the constant threat of attack and recapture, returning to tell their story and collect a bounty for the scalps.Was Hannah Duston the prototypical feminist avenger, or the harbinger of the Native American genocide? In this meticulously researched and riveting narrative, bestselling author Jay Atkinson sheds new light on the early struggle for North America.\"",
  "genres": [
    "History",
    "Nonfiction",
    "American History",
    "True Crime",
    "Audiobook",
    "Book Club",
    "Survival"
  ],
  "author": "Jay Atkinson",
  "average_rating": "3.75",
  "url": "https://www.goodreads.com/book/show/25902283-massacre-on-the-merrimack"
}