{
  "title": "Threading My Prayer Rug: One Woman's Journey from Pakistani Muslim to American Muslim",
  "description": "SHORTLISTED FOR THE 2018 WILLIAM SAROYAN INTERNATIONAL PRIZE FOR WRITING. ONE OF BOOKLIST' S TOP TEN RELIGION AND SPIRITUALITY BOOKS OF 2016. ONE OF BOOKLIST' S TOP TEN DIVERSE NONFICTION BOOKS OF 2017. Honorable Mention in the 2017 San Francisco Book Festival Awards, Spiritual CategoryA 2019 United Methodist Women Reading Program SelectionThis enthralling story of the making of an American is also a timely meditation on being Muslim in America today.Threading My Prayer Rug is a richly textured reflection on what it is to be a Muslim in America today. It is also the luminous story of many from Pakistan to the United States in an arranged marriage that becomes a love match lasting forty years; from secular Muslim in an Islamic society to devout Muslim in a society ignorant of Islam, and from liberal to conservative to American Muslim; from student to bride and mother; and from an immigrant intending to stay two years to an American citizen, business executive, grandmother, and tireless advocate for interfaith understanding.Beginning with a sweetly funny, moving account of her arranged marriage, the author undercuts stereotypes and offers the refreshing view of an American life through Muslim eyes. In chapters leavened with humor, hope, and insight, she recounts an immigrant’s daily struggles balancing assimilation with preserving heritage, overcoming religious barriers from within and distortions of Islam from without, and confronting issues of raising her children as Muslims—while they lobby for a Christmas tree! Sabeeha Rehman was doing interfaith work for Imam Feisal Abdul Rauf, the driving force behind the Muslim community center at Ground Zero, when the backlash began. She discusses what that experience revealed about American society.",
  "genres": [
    "Nonfiction",
    "Memoir",
    "Religion",
    "Biography",
    "Islam",
    "Pakistan",
    "Biography Memoir"
  ],
  "author": "Sabeeha Rehman",
  "average_rating": "4.05",
  "url": "https://www.goodreads.com/book/show/25898620-threading-my-prayer-rug"
}