{
  "title": "Suck and Blow: And Other Stories I'm Not Supposed to Tell",
  "description": "Hailed by many as the world's greatest harmonica player, John Popper has redefined the instrument. As the lead singer and principal songwriter of Blues Traveler, Popper has performed for more than 30 million people over 2,000 live dates and composed such radio staples as \"Hook,\" \"But Anyway,\" and \"Run-Around,\" the longest-charting single in Billboard history. He has appeared with Eric Clapton and B. B. King at the White House, welcomed the Hungarian ambassador to the stage, and inducted Carlos Santana into the Rock and Roll Hall of Fame.In Suck and Blow , Popper shares a candid, spirited account of his life and career. A straight-F student at Princeton High School, Popper's life changed with one serendipitous harmonica solo that captured the attention of his mercurial band teacher (the same teacher whose life was later fictionalized in the Academy Award-winning film Whiplash ). After befriending three fellow musicians with whom he would form Blues Traveler, Popper's academic career nearly ended in twelfth grade, until a meeting with the Dean of the New School for Social Research in which Popper pulled out his trusty harp and played his way into college.Popper and Blues Traveler soon became enmeshed in the lower Manhattan music scene of the late 1980s, eventually becoming the house band at the fabled Wetlands Preserve and embarking on a journey that would one day land the group at Madison Square Garden on New Year's Eve. Along the way, Popper and his cohorts commanded the attention of fans and bands alike, through inspired performances and riotous debauchery.Popper's unique perspective on the music business began under the tutelage of Blues Traveler's mentor and manager Bill Graham. After the rock impresario's untimely passing, Popper applied many of Graham's lessons to the formation of the H.O.R.D.E. tour, which John co-owned and hosted over eight years, welcoming such artists as Neil Young, the Allman Brothers Band, Phish, Dave Matthews Band, Ziggy Marley, and his longtime friends the Spin Doctors.Popper also shares a forthright assessment of his longstanding battle with obesity. Plagued by weight problems since childhood, a motorcycle accident a few years into his career confined him to a wheelchair for two years while his weight ballooned to 436 pounds. Angioplasty, gastric bypass surgery, and a tattoo on his chest that reads \"I Want to Be Brave\" when viewed in the mirror are products of Popper's struggle, compounded by codependency issues and the untimely death of founding Blues Traveler bassist Bobby Sheehan.Popper's personal identity is entwined with his political passions. A staunch supporter of gun rights, he has performed at the National Republican Convention, yet he also maintains liberal positions on social issues. He will reconcile these views and share his encounters with the Bush family, the Clintons, the Gores, and other politicos.The iconoclastic, self-described Johnny Appleharp also dishes on cutting contests, Twitter trolls, party fouls, and prostitutes.In Suck and Blow , John Popper does it all with his signature honesty, humility, and humor.",
  "genres": [
    "Music",
    "Memoir"
  ],
  "author": "John Popper",
  "average_rating": "3.81",
  "url": "https://www.goodreads.com/book/show/25898162-suck-and-blow"
}