{
  "title": "I Swear I'll Make It Up to You",
  "description": "I Swear I'll Make It Up to You is Mishka Shubaly's apology for choices he wasn't sure he'd live long enough to regret. It is a story of drinking, women, punk rock, and a journey so far down the low road that it took Shubaly years of running to come back.A misfit kid in the best of times, Shubaly had his world shattered when, in a 24-hour span in 1992, he survived a mass shooting on his school's campus, then learned that his parents were getting divorced. After the departure of his father, a decorated rocket scientist, his remaining family soon lost their house. In his first act to avenge the wrongs against his mother, Shubaly plunged into a 17-year love affair with alcohol.In this fiercely honest, emotional, and darkly witty book, Shubaly relives the best and worst of these adventures: the disastrous events that fractured his life; his imaginatively destructive romances; his hot-and-cold career as a rock musician; his travels across the country in search of meaning, drugs, and his family; and the time he met his newborn nephew while tripping on cough syrup.I Swear I'll Make It Up to You is a memoir of a precocious young man trying to be good and failing (and failing, and failing)—until, one day, he succeeds. Taking a cab home one night after a bar fight, Shubaly decides to run five miles the next morning to retrieve his bike. Thus begins a new, much healthier love affair with running, and eventually a new life. And when Shubaly finally reunites with his distant father, he discovers the story of his childhood was radically different from what he'd imagined. Shubaly's muscular prose, big heart, and sharp humor inflect this grand story of mistakes, their consequences, and eventual redemption.",
  "genres": [
    "Memoir",
    "Nonfiction",
    "Audiobook",
    "Mental Health",
    "Biography",
    "Biography Memoir"
  ],
  "author": "Mishka Shubaly",
  "average_rating": "4.14",
  "url": "https://www.goodreads.com/book/show/25898128-i-swear-i-ll-make-it-up-to-you"
}