{
  "title": "Mendel",
  "description": "Mendel: a moving Holocaust story for childrenIn Mendel, a father lovingly tells his two children the story of a Jewish boy, who once lived in Europe during WWII. Each night after he tucks his children in, Father sits on the edge of the bed and begins his story about Papa, Mama and their three boys.Historically, the story is true. The tone is simple, poignant and gentle which makes it suitable for children aged 8 to 10.The author, daughter of Holocaust survivor Manny Steinberg ('Mendel' in the story), emphasizes the importance of family, hope and love.The book has been illustrated with pencil drawings that beautifully depict the mood and era of the storyThis book does not contain any graphic details or violence.\"Passing along family history and the simple lessons of life to our children is maybe the most important responsibility parents have. Perhaps the most challenging lessons are those that deal with reality and the fact that bad things happen and children need to know this without scaring them.Anita Lavi tells a beautiful and compelling tale of a young lad and his brother who find themselves in a German Concentration Camp during the wanning days of World War II. As it turns out, the title character, Mendel, is author Lavi's father. Mendel, a Jew, is uprooted from his home and thrust into unspeakable horrors....we know. But Ms. Lavi is writing a children's book so while we who are reading this lovely story to our little ones, know the details of history, the book Mendel is written to teach without frightening.The family ultimately emigrates to the US, arriving to be greeted by Lady Liberty in New York harbor.If your family is Jewish, this a great book to start to teach the kids in a gentle way some of the more difficult parts of history. It is an excellent tool to generate healthy questions and discussions.My heritage is rooted in the Deep South of the United States with its history of slavery. Lavi's story is just as relevant here.To accompany the book, Ms Lavi has included a wonderful collection of simple pencil illustrations by Caroline Juler. The drawings are great punctuations in the story and themselves a great way to engage children and let them talk about what they see.Read this book to your children and then have a chat about Mendel and his family and then talk about your family.\"",
  "genres": [
    "Childrens"
  ],
  "author": "Anita Lavi",
  "average_rating": "4.88",
  "url": "https://www.goodreads.com/book/show/25900764-mendel"
}