{
  "title": "What Happens In The Dark Book One",
  "description": "“Matt Star had money, power, and influence, the triple threat combination that would make anyone a formidable threat...”   Lizzie Winter is just 3 short months away from graduation when the unthinkable happens. A prank gone wrong by the football team takes a devastating turn and changes her life forever. Just when things can't get any worse, Matt Star decides to up the anti and throw blackmail and manipulation into the mix. To complicate matters, Lizzie starts developing feelings for Matt's best friend, Brandon Rivers. Brandon suspects something's off with Lizzie and Matt's relationship, but Lizzie is sworn to secrecy. The only way she can protect Brandon, and everyone else she cares about is to continue lying. Will Brandon be able to figure out what Matt is doing to Lizzie, and save her before its too late? Or will Lizzie be forced to do everything she can in order to save Brandon from Matt's sick, psychopathic ways?   \"It was then that I realized there really was no point in trying to fight him anymore, because just like on the football field, he would always win. I would never beat him, the only thing I could do was try to give him what he wanted; and just hope that it was enough to keep everyone I cared about safe. I promised myself that night, that I would do everything I could, to protect the people I love the most...\"   **Trigger Warning** This book is not suitable for readers under 18. This book contains elements of emotional, sexual, and physical cruelty. Any readers with sensitivity to the above topics should proceed with caution, and at their own risk.  *This is book 1 of a 3 book series. This series will make you cry, it will make you laugh, it will make you feel things that you don't want to feel. It will make you question yourself, non-stop. It is a long way to happy for the main character. The things that the main character (Lizzie) will go through/be subjected to during the entire series will break your heart,right along with hers. However, it will show you that you can put those broken pieces back together, and come out stronger then you could ever thought possible.",
  "genres": [],
  "author": "Ashley Jade",
  "average_rating": "3.85",
  "url": "https://www.goodreads.com/book/show/25901034-what-happens-in-the-dark-book-one"
}