{
  "title": "Tempt: Volume 1",
  "description": "Smart girls don’t use their bodies to get what they want.  Smart girls don’t pursue men they can’t have.  Which means I must have lost my damn mind. Since the night I tripped into sexy, reclusive genius Theo Sutherland I’ve given in to my body’s desires. Now the need to possess a man I can’t have is overriding my typically excellent smart girl sensibilities.  To everyone else Theo is cold and commanding, but with me he’s sweet, sexy, and almost shy. He shows me a side of him no one else knows, maybe even himself. And that makes me want to conquer him at all costs.  I want him.  He’s mine.  He just doesn’t know it yet. ***** Tempt: Volume 1 is the first book in a new five-volume serial releasing every three weeks between July and September 2015. It is part of the Tease universe, but is a standalone serial. These books are fast 15,000 word temptations meant to satisfy your reading needs in an episodic format. Each book has a beginning, middle, and end, while still being part of a bigger story. *****  From the first chapter....  I shook my head and somehow managed to lose my balance. Maybe it was the non-stop dancing, or maybe it was the champagne. Heck, maybe Luis wasn’t as smooth as I gave him credit for. I’m still not entirely sure how I managed to lose my footing. All I know is that I landed right into the sexiest wall of muscle in a designer suit I’d ever seen.  Well, at least the bottom half of him was sexy.  “Careful. We wouldn’t want to lose the night’s star dancer so soon.”  That voice… Oh sweet Jesus that voice. It was sandpaper. It was as masculine as a voice could get. It was deep, yet soft. It was British and yet had some sort of brogue I wasn’t familiar enough with yet to positively identify. Scottish? Irish? I didn’t know and didn’t care because at that moment my face was planted firmly against his navy blue vest.  His arms held me in place. They were strong and unwavering; as if holding me were the easiest thing they’d done all day. He smelled divine. There was definitely an expensive cologne clinging to his clothes, but it was something else entirely that was making me lightheaded.  It was him.  Whatever natural musk belonged to the man with the strong arms and sex-god voice, my body was fine tuned to needing it. I was in serious trouble and a little bit afraid that if I looked up and saw a face that matched the body I was going to come undone.  Maybe he was married. Please be married. None of this would matter if he were married.  I closed my eyes and sucked in a breath to pull myself together. “Thank you so much for catching me.” It was utterly ridiculous to believe I could actually be attracted to someone I’d only been in contact with for five seconds—and hadn’t even looked in the eye. I was clearly overreacting.  But seriously, that was all it took. Five seconds and I was hot, bothered, and breathless. That had to count for something.  The man chuckled and eased me back onto my feet, which was when I finally got a chance to take him all in.  He was gorgeous.  A little rough around the edges, but in a very good, very manly way. A scar ran through his left eyebrow. There was another on the edge of his square jaw. His lips were full, his eyes were dark, and his hair was perfectly styled to match the late Prohibition years of the early 1930’s.",
  "genres": [
    "Romance",
    "Novella"
  ],
  "author": "Alexis Anne",
  "average_rating": "4.06",
  "url": "https://www.goodreads.com/book/show/25903851-tempt"
}