{
  "title": "Circle the Sun: Summer's Sol",
  "description": "What secrets does the Earth still keep? \n Discover the answer while plunging yourself into a new and unique reading experience created by visually mesmerizing, color illustrations on every page. Circle the Sun is an immersive fantasy adventure with artistic imagery that draws you right into the midst of the narrative! The journey begins on the Summer Solstice as The Traveler prepares to leave for an ordinary, early morning walk. But everything changes when a strange visitor arrives at the door setting events in an unexpected direction. \n\n\"This is your path,\" said the Whistling Tree in a creaking, earthy voice. \"Beware as you step into the Shadow of the Light, for where there is Beauty there is also Darkness.\"\n\n   Will you dare to take those first steps with her into the Shadow of the Light and discover a fantastical world existing just at the edges of sight?   Find out who the mysterious Traveler is and embark on her adventure along with all manner of magical faerie creatures. But Beware! For there is more to this story…Dark forces emerge trying to steal away the light of Sol, our Sun and threatening the very planet we all live upon.Tasks are given with riddles to solve, guiding the way through summer. The Seasons, Nature, and Science all play a role in this integrative expedition where reality and fantasy collide!  \nAre You ready to be whisked away to the far reaches of your imagination? Buy it today! \n Circle the Sun is an illustrated mythic-fantasy series with a story continuing through 4 books. Summer's Sol is book one in the series. Circle the Sun books are appropriate to be enjoyed by any age. The reading level is Middle Grade and up. A fun experience for anyone with captivating illustrations and lots of hidden or subtle imagery to find! Coming Soon! Book Two: Autumn’s Heart*Kindle Customers: This ebook is a replica of the print edition. To preserve the artwork as it was intended to be viewed, it has fixed double-page spreads. On mobile devices such as a Kindle or tablet, this ebook is enabled with pinch and zoom capability for easier reading. It is best read on a larger device such as a Kindle, tablet, laptop or PC, and is less suitable for a phone.",
  "genres": [
    "Fantasy"
  ],
  "author": "Susan Schroder",
  "average_rating": "4.48",
  "url": "https://www.goodreads.com/book/show/25909858-circle-the-sun"
}