{
  "title": "Come When Called Complete Serial Box Set",
  "description": "Now you can get the complete seven episode, international bestselling, Come When Called serial, conveniently in one volume,enjoying the story from beginning to its happily ever after ending!Come When Called serial achievements include: ~Amazon Top 50 Bestseller in Bisexual Romance~ ~Amazon Top 50 Bestseller in Gay Erotica~ ~Amazon Top 50 Bestseller in LGBT Erotica~This bundle contains all seven episodes of the Come When Called serial:Episode #1: The IncidentEpisode #2: The OfferEpisode #3: CharleyEpisode #4: DeeperEpisode #5: DarkerEpisode #6: The PunishmentEpisode #7: The Sunrise __________ Evie has made a deal with the devil.She has a safe-word. She has a way out. But her submission to him is her only way in...Billionaire Ford Hawthorne is cool sexuality and dominance, his best friend, biker Charley Baker, is warm muscles and affection, and Evie is the lucky girl in the middle.Evie is shocked when she's forced to agree to bad-boy billionaire, Ford Hawthorne's, unthinkable deal: belong to him for a year, body and soul, completely. Anything he wants, anytime he wants it... even sharing her \"services\" with his best friend, Charley.Damaged and reclusive, Ford has been yearning to act on his fantasies of domination and control. He wants every carnal thing Evie can give him, but refuses to open his heart to love... even if that refusal will destroy them all.Evie is running from a dangerous man who used her and blackmailed her. She seeks refuge at Ford's estate, but that refuge comes at a price. Is she strong enough to endure the forbidden things he craves? But Evie soon learns there's no safe-word to stop the pain this gorgeous, enigmatic man causes her heart or sweet Charley's.Ford's best friend, biker Charley Baker, completes their unlikely trio, but Charley wants more than Ford has been willing to give him until now.As the situation escalates out of control, Ford, Charley and Evie experience the twists and turns of a sexual journey that none of them saw coming. A journey that knows no bounds--in ecstasy, in heartbreak and in love.__________ This box set contains the complete serial with an HEA and no cliffhangers. The box set contains lots of hot, satisfying sex between two mouth-watering heroes and a heroine strong enough to handle them both.Note: Adult content 18+. Contains scenes of BDSM. Menage - MMF",
  "genres": [
    "Menage",
    "BDSM",
    "M M F",
    "Erotica",
    "Romance",
    "M M Romance",
    "M F M"
  ],
  "author": "Piper Trace",
  "average_rating": "4.05",
  "url": "https://www.goodreads.com/book/show/25909160-come-when-called-complete-serial-box-set"
}