{
  "title": "The Last Kingdom",
  "description": "BBC2’s major Autumn 2015 TV series THE LAST KINGDOM is based on Bernard Cornwell’s bestselling novels on the making of England and the fate of his great hero, Uhtred of Bebbanburg. The Last Kingdom is the first book in the series.Uhtred is an English boy, born into the aristocracy of ninth-century Northumbria. Orphaned at ten, he is captured and adopted by a Dane and taught the Viking ways. Yet Uhtred's fate is indissolubly bound up with Alfred, King of Wessex, who rules over the only English kingdom to survive the Danish assault.The struggle between the English and the Danes and the strife between christianity and paganism is the background to Uhtred's growing up. He is left uncertain of his loyalties but a slaughter in a winter dawn propels him to the English side and he will become a man just as the Danes launch their fiercest attack yet on Alfred's kingdom. Marriage ties him further still to the West Saxon cause but when his wife and child vanish in the chaos of the Danish invasion, Uhtred is driven to face the greatest of the Viking chieftains in a battle beside the sea. There, in the horror of the shield-wall, he discovers his true allegiance.The Last Kingdom, like most of Bernard Cornwell's books, is firmly based on true history. It is the first novel of a series that will tell the tale of Alfred the Great and his descendants and of the enemies they faced, Viking warriors like Ivar the Boneless and his feared brother, Ubba. Against their lives Bernard Cornwell has woven a story of divided loyalties, reluctant love and desperate heroism. In Uhtred, he has created one of his most interesting and heroic characters and in The Last Kingdom one of his most powerful and passionate novels.",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Historical",
    "Fantasy",
    "Audiobook",
    "Medieval",
    "Adventure"
  ],
  "author": "Bernard Cornwell",
  "average_rating": "4.27",
  "url": "https://www.goodreads.com/book/show/11642899-the-last-kingdom"
}