{
  "title": "Jesse",
  "description": "Meet the Damage Control Boys, set in the world of the bestselling series Inked Brotherhood. This is New Adult Contemporary Romance. Returning to Madison hurts. I thought I’d left my past behind, but the past goes on living. I carry it inside of me, it’s a piece of me. People have marked me in indelible ways and I drag the shreds of my soul behind me, trying to put my pieces back together. I’m not the Amber I used to be. I fly under the radar, try to be invisible. It doesn't always work. Drawing attention scares me. It always spells trouble. Returning to my home town is a last ditch effort to lay my demons to rest and start anew, for good this time. Meeting Jesse Lee wasn’t in the plan. Yet here he is with his heart-stopping, sexy grin, handsome like a god, shining bright. He’s full of life, full of heat, packing the energy of a thousand suns in his gaze and muscular body. Jesse burns, and the pain of being near him is sweet. But he’s foiling my plans. It’s hard to remain a ghost when he’s around. Hard to avoid his attention, to remain invisible. He sees me, really sees me, and behind his bright radiance, I can see shadows from his own past crowding in. He’s swimming hard to stay afloat even as he reaches for me. What is he afraid of? And how can he save me from drowning when he can’t even save himself? Standalone novel. No cliffhanger. *Warning: this book contains graphic language, sex, and violence. Mature readers only. Not intended for young readers.* JESSE is book 2 in the series Damage Control - a series set in the same world as Inked Brotherhood. The boys of Damage Control were taken in by Zane Madden and Rafe Vestri and offered apprenticeship and work in the tattoo shop Damage Control. Next in the Damage Control series: SETH (Damage Control 3).",
  "genres": [
    "Romance",
    "Audiobook",
    "New Adult",
    "Contemporary Romance",
    "Dark",
    "Adult",
    "Contemporary"
  ],
  "author": "Jo Raven",
  "average_rating": "4.29",
  "url": "https://www.goodreads.com/book/show/25916372-jesse"
}