{
  "title": "The Unseen Man",
  "description": "From Chapter Heart of Darkness.'I have killed and I have robbed and I have broken most of the civilized laws of man at one time or another, but I leave no witnesses to that fact … none who have seen my original face. At the point I was empowered and about to take revenge on ******, this was also the cusp of the ultimate phase of my philosophy … it was the tipping point from Niles Novack, cautious but ambitious career criminal to The Unseen Man, Master Criminal.But first I had people to kill.'Who is The Unseen Man? Hero? Villain? Or something in between?He has been among the worst of humanity - he has tried to conquer the Earth and enact terrible revenge for wrongs, real or perceived but in the here and now he is about to give his life to save you ... to save every one of you.He is the Unseen Man and this is his story.If you love superhero comic books written for adults, you'll love this book.If you love superhero comic book movies, you will love this book.If you're into sci-fi, fantasy and pop culture that takes from the best of all your favourite genres of film, TV, comic book and literature to make an epic world building adventure, the likes of which you've never seen before in prose fiction ... then you, my friend will LOVE this book!For your added reading pleasure, the 3 main parts of the novel are followed by a 'DVD Extra,' section which annotates and explains the majority of the sometimes obscure sci-fi, comicbook, literary pop culture references or easter eggs to be found within.Please support THE UNSEEN MAN - in the future i hope to bring the epic world built within to a line of books set within the MERIDIAN UNIVERSE and for the UNSEEN MAN itself to go on to a live action movie or TV series.I invite any satisfied or curious reader to join me any time on my writer page where i will happily discuss the book, characters and in as much as i can ... plans for the future of the franchise.Jason :)",
  "genres": [],
  "author": "Jason Greenfield",
  "average_rating": "3.75",
  "url": "https://www.goodreads.com/book/show/25916680-the-unseen-man"
}