{
  "title": "Love's Every Whisper",
  "description": "\"A whole new level of storytelling.\" Laurie Alice Eakes, Author of The Mountain Midwife\"One of those rare occasions where I loved the second book more than the first!\" Heidi Robbins, Book BloggerVictoria Donnelly wants to do something right at least once in her lifetime. With five years of failed courtships behind her and the calendar inching closer to another birthday, she's finally found a way to redeem herself in the eyes of her family. But her plan requires her to return to her home town of Eagle Harbor, where forgotten feelings for a man she can never have lie buried. Elijah Cummings has loved Victoria for fifteen years. But fishermen’s sons don’t marry shipping barons’ daughters. He knows it. She knows it. The entire town knows it. Resolved to keep his distance from Victoria, Elijah focuses on establishing a much needed life-saving station, risking his own life by rescuing sailors stuck aboard shipwrecks... until he learns she's about to make an irreversible decision, one she'll spend the rest of her life regretting. He knows how to save drowning sailors—but how is he to save the woman he loves from the biggest mistake of her life… without destroying both their hearts in the process?Come back in time and revisit the remote town of Eagle Harbor, Michigan, in this memorable story of love, courage, and drama by fan-favorite author Naomi Rawlings.Eagle Harbor Series--Where Love Finds Its Anchor Book 1: Love's Unfading Light (Mac and Tressa)Book 2: Love's Every Whisper (Elijah and Victoria) Short Story: Love's Beginning (Elijah and Victoria)Book 3: Love's Sure Dawn (Gilbert and Rebekah)Book 4: Love's Eternal Breath (Seth and Lindy--winter 2016)Book 5: Love's Constant Hope (Thomas and Jessalyn--summer 2016)Book 6: Love's Bright Tomorrow (Isaac and Aileen--winter 2017)",
  "genres": [
    "Historical Fiction",
    "Christian Fiction",
    "Romance",
    "Fiction",
    "Historical Romance",
    "Christian",
    "Historical"
  ],
  "author": "Naomi Rawlings",
  "average_rating": "4.49",
  "url": "https://www.goodreads.com/book/show/25915455-love-s-every-whisper"
}