{
  "title": "Dark Days: A Memoir",
  "description": "Lamb of god vocalist D. Randall Blythe finally tells the whole incredible story of his arrest, incarceration, trial, and acquittal for manslaughter in the Czech Republic over the tragic and accidental death of a concertgoer in this riveting, gripping, biting, bold, and brave memoir.On June 27, 2012, the long-running, hard-touring, and world-renowned metal band lamb of god landed in Prague for their first concert there in two years. Vocalist D. Randall \"Randy\" Blythe was looking forward to a few hours off—a rare break from the touring grind—in which to explore the elegant, old city. However, a surreal scenario worthy of Kafka began to play out at the airport as Blythe was detained, arrested for manslaughter, and taken to Pankrác Prison—a notorious 123-year-old institution where the Nazis' torture units had set up camp during the German occupation of then-Czechoslovakia, and where today hundreds of prisoners are housed, awaiting trial and serving sentences in claustrophobic, sweltering, nightmare-inducing conditions.Two years prior, a 19-year-old fan died of injuries suffered at a lamb of god show in Prague, allegedly after being pushed off stage by Blythe, who had no vivid recollection of the incident. Stage-crashing and -diving being not uncommon occurrences, as any veteran of hard rock, metal, and punk shows knows, the concert that could have left him imprisoned for years was but a vague blur in Blythe's memory, just one of the hundreds of shows his band had performed over their decades-long career.At the time of his arrest Blythe had been sober for nearly two years, having finally gained the upper hand over the alcoholism that nearly killed him. But here he faced a new kind of challenge: jailed in a foreign land and facing a prison sentence of up to ten years. Worst of all, a young man was dead, and Blythe was devastated for him and his family, even as the reality of his own situation began to close in behind Pankrác Prison's glowering walls of crumbling concrete and razor wire.What transpired during Blythe's incarceration, trial, and eventual acquittal is a rock 'n' roll road story unlike any other, one that runs the gamut from tragedy to despair to hope and finally to redemption. While never losing sight of the sad gravity of his situation, Blythe relates the tale of his ordeal with one eye fixed firmly on the absurd (and at times bizarrely hilarious) circumstances he encountered along the way. Blythe is a natural storyteller and his voice drips with cutting humor, endearing empathy, and soulful insight. Much more than a tour diary or a prison memoir, Dark Days is D. Randall Blythe's own story about what went down—before, during, and after—told only as he can.",
  "genres": [
    "Nonfiction",
    "Music",
    "Biography",
    "Memoir",
    "Autobiography",
    "Biography Memoir",
    "Music Biography"
  ],
  "author": "D. Randall Blythe",
  "average_rating": "4.51",
  "url": "https://www.goodreads.com/book/show/25915998-dark-days"
}