{
  "title": "Charmed and Dangerous",
  "description": "Magic takes many forms. From malignant hexes to love charms gone amok, you’ll find a vast array of spells and curses, creatures and conjurings in this massive collection—not to mention a steamy dose of man-on-man action. Charmed and Dangerous features all-new stories of gay paranormal romance, supernatural fiction and urban fantasy by ten top m/m paranormal authors.Rhys Ford - Dim Sum AsylumFor Detective Roku MacCormick, working Arcane Crimes is his passion. Now cleared of any wrongdoing for shooting his last partner, MacCormick is given back his badge… as well as a new case and partner. Trent Leonard isn’t exactly what he’d expected, but then nothing in San Francisco’s Chinatown ever is.Ginn Hale - Swift and the Black DogWhen Jack Swift killed a tyrant and won the revolution he became a national hero. But someone in the new government prefers dead heroes to living, swearing, cynical wizards. Caught between bullets, revenge and desire, Jack had better be swift indeed.KJ Charles - A Queer TradeApprentice magician Crispin Tredarloe returns to London to find his master dead, and his papers sold. Papers with secrets that could spell death. Waste paper seller Ned Hall can’t resist Crispin’s pleading—and appealing—looks. But can the wasteman and the magician prevent a disaster and save Crispin’s skin? Nicole Kimberling - Magically DeliciousOccult attacks against NIAD agents aren’t remotely Keith Curry’s department. But when his lover, Gunther, is assaulted, Keith refuses to just sit back and fill out paperwork. He’s on the case—even if that means enraging powerful mages, crossing leprechaun picket lines, or braving dinner with Gunther’s goblin parents.Jordan Castillo Price - Everyone's Afraid of ClownsPsychic medium Victor Bayne can spot a ghost any day of the year, but Halloween holds some special surprises. His psych-groupie boyfriend Jacob coaxes him to the location of an old spirit sighting, but they can’t ghosthunt without enduring a cheesy “haunted house” that’s even more disturbing than they realize.Jordan L. Hawk - The Thirteenth HexHexman Dominic Kopecky doesn’t understand why dashing crow familiar Rook wants his help investigating murder by patent hex. For one thing, Dominic isn’t a witch. For another, the case is already closed—and someone is willing to kill to keep it that way.Charlie Cochet - The Soldati PrinceRiley Murrough goes from serving lattes to being chased by demons. If that wasn’t bad enough, he bears the mark of a shapeshifter king from a magical realm. Riley’s determined to get answers, but if the demons out for his blood don’t kill him, the urge to strangle the arrogant king might.Lou Harper - One Hex Too ManyVeteran detective Mike Mulligan is an expert on violent crimes—of the occult variety. He might even be cursed. Detective Hugh Fox is eager to partner up and prove himself, but Mulligan is accustomed to flying solo. Can they trust each other enough to track a killer who’ll stop at nothing, not even summoning a demon?Andrea Speed - Josh of the Damned vs. the Bathroom of Doom It's a boring night at the Quik-Mart for Josh and his friend Doug. Until a vampire with a grudge—and the most adorable backup ever—crashes the store. Can Josh survive the Bathroom of Doom?Astrid Amara - The Trouble With HexesP.I. Tim Keller has a problem. And the only person who can solve it is his ex-boyfriend, Vincent, whose job as a hexbreaker was the reason they broke up. It’s hard admitting he was wrong, especially when coughing up organs. But there’s a missing person to find, a hexmaker to hunt down, and a romance to repair before Tim breathes his last.",
  "genres": [
    "Paranormal",
    "Anthologies",
    "M M Romance",
    "Fantasy",
    "Urban Fantasy",
    "Romance",
    "Short Stories"
  ],
  "author": "Jordan Castillo Price",
  "average_rating": "4.01",
  "url": "https://www.goodreads.com/book/show/25912719-charmed-and-dangerous"
}