{
  "title": "Sacred Sea: A Journey to Lake Baikal",
  "description": "\"Absoliutno blagopoluchnoe ozero Baikal!\" the Russian scientist looking out over the great lake says. \"Lake Baikal is Perfect!\" And humans can never harm it.For a man cut loose from his life in the U.S., Lake Baikal-Siberia's sacred inland sea-becomes a place of pilgrimage, the focal point of a 25,000-mile journey by land and sea in search of connection, permanence, restoration and hope.Following a difficult divorce, veteran environmental journalist Peter Thomson sets off from Boston with his younger brother for one of nature's most remarkable creations, in one of the farthest corners of the planet. Lake Baikal, a gargantuan crack in the Siberian plateau, is the world's largest body of fresh water, its deepest and oldest lake, and a cauldron of evolution, home to hundreds of unique creatures, including the world's only freshwater seal. It's also among the most pristine lakes on earth, with a mythical ability to protect itself from the growing human impact-a \"perfect,\" self-cleansing ecosystem.A trip halfway around the world by train, cargo ship and rubber raft brings the brothers to a place of sublime beauty, deep history and immense natural power. But at Baikal they also find ominous signs that this perfect piece of nature could yet succumb to the even more powerful forces of human hubris, carelessness and ignorance. They find that despite its isolation, Baikal is connected to everything else on Earth, and that it will need the love and devotion of people around the world to protect it.On their trek to and from Siberia the author and his brother also encounter a stream of people who are also lonely, displaced and yearning for something beyond the limits of their own lives, but many of whom are also big-hearted and deeply connected to their own communities and the world around them. What begins as a search for restoration in nature becomes as well a discovery of the restorative power of trust, faith and human connection.",
  "genres": [
    "Travel",
    "Russia",
    "Nonfiction",
    "Memoir",
    "Geography"
  ],
  "author": "Peter Thomson",
  "average_rating": "3.70",
  "url": "https://www.goodreads.com/book/show/1164359.Sacred_Sea"
}