{
  "title": "You Brought Me Faith",
  "description": "Child prostitution, sexual slavery and domestic abuse remain ongoing, international issues. Young girls and women all over the world are being abused, and silenced. But more and more women are breaking their silence, to tell their horrific stories.  In You Brought Me Faith, author MariaLiza Navarro has chosen to act as a voice for the women who are unable to speak out for themselves.  Here is the fictional testimony of Kristina Rivera, a beautiful Filipina whose harrowing tale represents the collective voices of abused women and girls from across Asia, and who literally leaps out of the pages with her lively narrative. Kristina’s story begins in Cebu, Philippines, where she spent the first six years of her life as a happy child. But after the death of her beloved father, Kristina is suddenly thrust into a world of violence, as her own mother and siblings begin abusing her, enslaving her as their personal maid, and even committing acts of incest and rape.  Sold into prostitution by her own brother and forced to work as a stripper at the age of thirteen, Kristina spends years battling to stay alive and maintain her sanity, always believing in the love of God and her chance for freedom.  When a mysterious, charming and cultured French gentleman named Alain Moreau appears in her life, Kristina falls in love, convinced she has found her saviour. But even as Alain showers Kristina with gifts and affection, she has reason to believe he is also secretly betraying her. Now trapped between two worlds—her cruel, heartless family and the man she loves but cannot trust—Kristina must find her independence and rise above a life of drugs, prostitution, physical and emotional torture and slavery, with no one to depend on but herself.   Riveting, gripping, emotionally-charged and ever- compelling, MariaLiza Navarro’s debut novel, You Brought Me Faith will capture you until the very last page, leaving you breathless for more.",
  "genres": [],
  "author": "MariaLiza Navarro",
  "average_rating": "4.08",
  "url": "https://www.goodreads.com/book/show/25924564-you-brought-me-faith"
}