{
  "title": "La lista de Mario",
  "description": "Llega La lista de Mario, el esperado desenlace de La lista de Oliva.Oliva se ha equivocado y se ha despedido de Mario. Él está decepcionado y ha dicho adiós a Oli, pero… ¿será capaz de mantener ese adiós como algo definitivo? ¿Será capaz de perdonarla? ¿Serán capaces de seguir con su vida como si nada hubiese ocurrido?Pero mientras lo meditan, el mundo sigue girando y Oli conoce al pastelero de ojos verdes. Y Maite recibe una noticia inesperada. Y Sonia prepara la que parece la boda del siglo.¿Podrá Oli olvidarse de Mario? ¿Es posible querer a otra persona cuando otra lo sigue llenando todo, incluso desde la distancia?“¿Es eso posible? ¿Es posible encontrar a alguien que consiga llegar a tu corazón cuando aún sigue siendo propiedad de otro? Y si lo es, ¿es eso amor también? ¿O solo funciona así por necesidad?”L@s lector@s dijeron sobre La lista de Oliva…“Está escrita perfectamente, siempre te tiene con la intriga de qué será lo siguiente que pase y es un libro con el que puedes estar llorando y a la vez riendo, ya que es una novela increíble ¡¡y los personajes y diálogos son únicos!!”“¡Buf, cómo me ha gustado! Me he reído, he llorado, me he metido por completo en la historia y todos los personajes son geniales. Me he pasado todo el libro deseando leer para saber qué pasaba y al mismo tiempo con pena, porque cuanto más leía menos libro me quedaba.”“Sin duda alguna el mejor libro de temática romántica que he leído este año. Desde el descubrimiento de Elisabeth Benavent ningún libro había logrado llegarme tanto, hacerme reír, enamorarme y emocionarme con tal intensidad, el abandono que sentí al acabar de leerlo fue tal, que la espera de la segunda parte se va a hacer muy larga. Absolutamente imprescindible.”“Me ha gustado lo que cuenta, cómo lo cuenta y el ritmo de la historia. Se trata de una historia de amor con la que todas hemos soñado. Divertida y entrañable.”¿A qué esperas para adentrarte en el mundo de Oliva?",
  "genres": [
    "Romance"
  ],
  "author": "Andrea Longarela",
  "average_rating": "3.94",
  "url": "https://www.goodreads.com/book/show/25925402-la-lista-de-mario"
}