{
  "title": "Mad Dog and The Englishman",
  "description": "Do you want biting political and cultural satire which cleverly and expertly sends up the idea of national and cultural stereotypes of our times and exposes the raw fetidness of our global iconographic zeitgeist? Well tough! This is just crudely written dreck aimed not only at insulting your intelligence but insulting you personally!! There now follows a very very serious disclaimer that you will ignore at your peril ... i really mean it! IF YOU ARE EASILY OFFENDED AND BELONG TO ONE OF THE FOLLOWING GROUPS, PLEASE DO NOT READ THIS SCOTTISH, WELSH, NORTHERN IRISH, IRISH CATHOLICS, COCKNEYS, CHAVS, UPPER CLASS ENGLISH TWATS, RELIGIOUS CHRISTIANS, MUSLIMS, JEWS, HOMOSEXUALS, RESIDENTS OF WATFORD, THE ACTOR ROBERT CARLYLE, THE WORKING CLASSES, THE UNEMPLOYED PUB GOING DOLE SCROUNGERS, THE AUTHOR'S FRIEND DANIEL SKELTON, REPUBLICAN AMERICANS, SOUTHERN STATES AMERICANS, CHRISTIAN MIDWEST AMERICANS WITH TRADITIONAL VALUES, ANY AMERICAN, TRANSVESTITES, SUPPORTERS OF THE ENGLAND FOOTBALL SQUAD, IRANIANS, EX PRESIDENT OF IRAN MAHMOUD AHMADINEJAD, SYRIANS, BASHAR AL ASSAD, WAYNE ROONEY, BELGIUMS, AGATHA CHRISTIE, THE FRENCH, YAHOO MESSAGE BOARD COMMENTATORS, SOUTH AMERICAN CRIME CARTELS, PRIESTS AND REVERENDS, THE WRITER OF THIS BOOK, PALESTINIANS, ARABS IN GENERAL, OLD YIDDISH MEN, THE FICTIONAL OLLAWONGA TRIBE OF DARKEST AFRICA, THE WRITER AND READERS OF FIFTY SHADES OF GREY, THE CHINESE AND TONY BLAIR. IF YOU BELONG TO ONE OF THE FOLLOWING GROUPS WHO HAVE HAD A MORE THAN CAMEO MENTION/APPEARANCE IN THE NOVEL, PLEASE READ THE BOOK WITHOUT FEAR OF OFFENSIVE ITALIANS. If you have got this far, then allow me to enlighten you about a secret so great that the general public has no idea about but every government in the world knows and they are involved in a consistent cover up to keep the horrors from you.. What are the Ethereals? Some say they are the personifications of iconic and stereotypical energies given life by our collective beliefs and imagination. Others say they started as humans and evolved for much the same reasons given above. Both viewpoints have a basis in truth. A decade ago one of the most fearsome of these beings 'The Englishman,' was banished from our plane of existence by a weeping Tony Blair who cut the throat of a small child in a necromantic energy ritual to do so. With such a price paid, the question has to be asked ... just how serious a threat has arisen from the Ethereal world that the British government's only option is to bring back the Englishman to save us!!!! Set in 2012 in the lead up to the US election ... welcome to the twisted world of Mad Dog and The Englishman. The following piece of hack work contains levels of swearing, depraved activity and violent situations sufficient enough to have Jihadi John puking up his guts. Cover Design - Bradley. J. Kornish",
  "genres": [],
  "author": "Jason Greenfield",
  "average_rating": "3.62",
  "url": "https://www.goodreads.com/book/show/25923226-mad-dog-and-the-englishman"
}