{
  "title": "Hidden No More",
  "description": "A lady concealed from society…Lady Ellington, the illegitimate daughter of a wealthy marquis, has spent her entire life hiding from London’s high society—both as a result of her own desires and those forced upon her by her overbearing and abusive father. When the marquis passes away suddenly, Ellie feels as though a weight has been lifted and immediately assumes her role as mistress of Drake House. Though she is constantly looking over her shoulder, wondering when it will all be taken from her. And for good reason—no sooner has she shed her black mourning garb than a missive arrives, announcing an heir to the Marquisate. A person she has never heard of before, but one with enough power to change her fate entirely.A man uncovering the secrets of his past…Taken in by his nursemaid in infancy and raised as an orphan, Alex has never had the benefits of a name or a bloodline. Yet he’s content to work hard and earn his keep as a stable hand in one of London’s finest homes, proving himself worthy of both his position and his friendship to the beautiful Lady Ellington. When Ellie asks for his help with a delicate matter, he’s happy to oblige, but soon finds himself in the middle of more than he bargained for. His innocent meeting reveals secrets from the past that he never could have imagined, and he discovers that he’s a duke by birth. But even with the possibility of a title and all that goes along with it, Alex is unsure whether he can tear down the walls Ellie has built to protect her heart.A love neither can hide…While the two have a love that’s undeniable, it may not be enough to bridge the gap and overcome the obstacles standing in their way. And now, with every secret revealed, there’s even more at stake.Don't miss the highly anticipated final novel in Christina McKnight’s A Lady Forsaken Series! Regency Romance at its best!",
  "genres": [
    "Historical Romance",
    "Romance",
    "Regency",
    "Historical"
  ],
  "author": "Christina McKnight",
  "average_rating": "4.10",
  "url": "https://www.goodreads.com/book/show/25927378-hidden-no-more"
}