{
  "title": "With Every Breath",
  "description": "#1 USA Today and New York Times bestselling author Maya Banks continues her suspenseful and sizzling Slow Burn series with this fourth book—a mesmerizingly sexy tale of a strong, brilliant woman who encounters the one man who makes her lose all control.Eliza Cummings fought free of a monster who terrorized her when she was an innocent teenager and helped put him away for good. She took a job with Devereaux Security Services and devoted every hour to taking down the very thing she’d nearly become. No one, not even those closest to her, know her darkest, shameful secrets. But now the killer has been set free on a legal loophole and it’s only a matter of time before he comes for her. Eliza's only choice is to run and lead the monster away from the people she loves.Wade Sterling has always lived by his own rules, a law unto himself who answers to no one. He’s never professed to be a good man, and he’s definitely not hero material. Wade never allows anyone close enough to see the man behind the impenetrable mask—but one woman threatens his carefully leashed control. He took a bullet for her and the result was more than a piece of metal entrenched in his skin. She was under his skin and nothing he did rid himself of the woman with the courage of a warrior and who thinks nothing of putting her life before others.But when Wade sees a panicked and haunted Eliza he knows something is very wrong, because the fool woman has never been afraid of anything. And when she tries to run, the primal beast barely lurking beneath his deceptively polished façade erupts in a rage. She may not know it, but she belongs to him. This time, Eliza isn't going to play the protector. She was damn well going to be the protected. And as long as Wade breathes, no one will ever hurt what is his.",
  "genres": [
    "Romance",
    "Romantic Suspense",
    "Paranormal",
    "Suspense",
    "Contemporary",
    "Contemporary Romance",
    "Audiobook"
  ],
  "author": "Maya Banks",
  "average_rating": "3.70",
  "url": "https://www.goodreads.com/book/show/25923420-with-every-breath"
}