{
  "title": "Find Me Unafraid: Love, Loss, and Hope in an African Slum",
  "description": "Find Me Unafraid tells the uncommon love story between two uncommon people whose collaboration sparked a successful movement to transform the lives of vulnerable girls and the urban poor. With a Foreword by Nicholas Kristof.This is the story of two young people from completely different worlds: Kennedy Odede from Kibera, the largest slum in Africa, and Jessica Posner from Denver, Colorado. Kennedy foraged for food, lived on the street, and taught himself to read with old newspapers. When an American volunteer gave him the work of Mandela, Garvey, and King, teenaged Kennedy decided he was going to change his life and his community. He bought a soccer ball and started a youth empowerment group he called Shining Hope for Communities (SHOFCO). Then in 2007, Wesleyan undergraduate Jessica Posner spent a semester abroad in Kenya working with SHOFCO. Breaking all convention, she decided to live in Kibera with Kennedy, and they fell in love.Their connection persisted, and Jessica helped Kennedy to escape political violence and fulfill his lifelong dream of an education, at Wesleyan University.The alchemy of their remarkable union has drawn the support of community members and celebrities alike—The Clintons, Mia Farrow, and Nicholas Kristof are among their fans—and their work has changed the lives of many of Kibera’s most vulnerable population: its girls. Jess and Kennedy founded Kibera’s first tuition-free school for girls, a large, bright blue building, which stands as a bastion of hope in what once felt like a hopeless place. But Jessica and Kennedy are just getting started—they have expanded their model to connect essential services like health care, clean water, and economic empowerment programs. They’ve opened an identical project in Mathare, Kenya’s second largest slum, and intend to expand their remarkably successful program for change.Ultimately this is a love story about a fight against poverty and hopelessness, the transformation made possible by a true love, and the power of young people to have a deep impact on the world.",
  "genres": [
    "Nonfiction",
    "Africa",
    "Memoir",
    "Biography",
    "Biography Memoir",
    "Book Club",
    "Audiobook"
  ],
  "author": "Kennedy Odede",
  "average_rating": "4.47",
  "url": "https://www.goodreads.com/book/show/25934653-find-me-unafraid"
}