{
  "title": "Mildred Budge in Embankment",
  "description": "When the car sailed over the embankment carrying the four members of the pulpit committee, Mildred Budge called out, “Jesus saves.” The others heard it, but they were also experiencing their own quick flashes of insight. Liz, a serial widow, felt unsatisfied with her life. She wanted more. Sailing toward her death, she still did. Sam, who had turned the steering wheel that had sent them over the embankment, was looking forward to the crash. He wanted to feel it—the hard slam of collision. His hands held the wheel tightly, bracing for it. Jake smiled. He resisted holding Mildred’s hand, because black men still didn’t touch white women in the where he lived. And he took note of the wonder of the experience that was like flying. ‘So, this is what it’s like—to fly. To live.’ And then the car touched down hard and slammed into a tree. And when they could speak, their conversation was different than it had been moments before. Life was different. What they really wanted was not what they thought. But in order to pursue it, they had to get out of the ravine where they had landed. And they had to work together to get home. This is a story about “Jesus saves” and how that message gets lived out in people who know the gospel and believe it. If you love a Christian story about real people, you’ll enjoy this second book in the Mildred Budge series. Daphne Simpkins writes about church life in the South through her Mildred Budge books. She has also written about caregiving, cooking, Christmas, and Nat King Cole, a native of Montgomery, Alabama. Connect with her on Facebook, Twitter, or Linkedin.com Or, if you want to keep up with her book news, like her Quotidian Books Facebook page or her author pages on Amazon, Goodreads, or BookBub.",
  "genres": [
    "Contemporary",
    "Fiction"
  ],
  "author": "Daphne Simpkins",
  "average_rating": "4.58",
  "url": "https://www.goodreads.com/book/show/25934789-mildred-budge-in-embankment"
}