{
  "title": "The Adventurer's Daughter",
  "description": "Gaeliam ‘Musty’ Fotherington was the greatest adventurer the world had ever seen. There was never a challenge he couldn’t overcome, no danger too dire, no peril too bleak or adversary too evil. He’d been from one end of the Empire to the other and everywhere in between, climbed unscalable mountains, done battle with monsters most foul and spoken the unspeakable, and that was all before morning tea. While he had amassed a king’s ransom of ancient crowns and lost swords and priceless stones during his lifetime, they were as nothing compared to his young daughter, Annahenata Fotherington. A beautiful jewel herself, she was his most precious treasure of all. To her his epic quests, his terrible calamities and his hair-raising escapes were the best stories, and she dreamed of one day becoming an adventurer in her own right. After Musty’s death those stories became all Anna had to remember him by. Childhood fancy soon gave way to the demands of the aristocracy, and that little girl with the grubby hands grew into the young heiress of Fotherington Manor. Her dreams faded and were forgotten, the door to all of Musty’s works closed. Reputation and standing became her world, opulence and grandeur her life, and under the cold tutelage of her mother, she turned her face from her father’s legacy. Until his Legacy comes looking for her. Though Musty is indeed gone, his enemies most certainly are not, and they want their revenge. They are after Musty’s famous Legacy, a horde of riches he collected and hid after a lifetime of adventuring, and if they can’t take it from the man himself, they will turn to the next best thing. Anna is plunged into their world, a world of cutthroats and villains, scoundrels and blackguards. Haunted by a side of her father she never knew, she must stay alive long enough to sift the lies and dredge the truth about who he really was, and discover the shocking revelations behind his famous hidden Legacy before they get to it first. Anna must open the book of her father’s past and step into his stories, where she will soon come to find that, actually, this adventuring lark is a bit more involved than the usual swash, swash, buckle, buckle, home in time for a scone, as most people might have you believe.",
  "genres": [],
  "author": "Stuart Kurth",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/25929315-the-adventurer-s-daughter"
}