{
  "title": "The Fall of Princes",
  "description": "“A heart-wrenching, beautiful, darkly comic, deeply necessary tale that stuns again and again with razor-sharp prose and glittering wit. Robert Goolrick is, without question, one of the greatest storytellers of our time.” —Téa Obreht, author of The Tiger’s Wife  In the spellbinding new novel from #1 New York Times bestselling author Robert Goolrick, 1980s Manhattan shimmers like the mirage it was, as money, power, and invincibility seduce a group of young Wall Street turks. Together they reach the pinnacle, achieving the kind of wealth that grants them access to anything--and anyone. Until, one by one, they fall. Goolrick’s literary chops are on full display, painting an authentic portrait of a hedonistic era, tense and stylish, perfectly mixing adrenaline and melancholy. Stunning in its acute observations about great wealth and its absence, and deeply moving in its depiction of the ways in which these men learn to cope with both extremes, it’s a true tour de force.  “An addictive slice of semiautobiographical fiction . . . Goolrick vividly plumbs the depths of fortune and regret. The result is a compulsively readable examination of the highs and lows of life in the big city.” —Publishers Weekly  “A compelling, wholly seductive narrative voice . . . Goolrick’s stellar prose infuses this redemption story with a good deal of depth and despair, making it read like the literary version of The Wolf of Wall Street.” —Booklist  “A dark, intoxicating morality tale . . . With his impeccable prose, Goolrick focuses his unflinching eye on the grittiness beneath the sleek facade of nightclubs, fashion, and monied Manhattan extravagance. Beautifully crafted, seductive, and provocative.” —Garth Stein, author of A Sudden Light and The Art of Racing in the Rain",
  "genres": [
    "Fiction",
    "Historical Fiction",
    "Contemporary",
    "New York",
    "American",
    "Novels",
    "LGBT"
  ],
  "author": "Robert Goolrick",
  "average_rating": "3.42",
  "url": "https://www.goodreads.com/book/show/25940147-the-fall-of-princes"
}