{
  "title": "Raising Peacemakers",
  "description": "Raising Peacemakers tells a twenty-two year story of kids growing up with peacemaking as their foundation. At Downtown Alternative School (DAS), a small public elementary school in Toronto, child-to-child conflicts were understood as opportunities. Children and adults worked hard to create a warm inclusive community where differing viewpoints and disagreements could be handled fairly and safely. While the book includes documentation and transcripts, it’s a narrative rather than an academic text. It’s the author’s story and many stories. It’s a trail of re-thinking, negotiating and re-negotiating, solving and re-solving (occasionally resolving) teaching and learning dilemmas. It’s a tale of one school’s brave and optimistic effort to create and sustain healthy, safe, equitable, and academically relevant conditions for and with people whose lives were and are at stake in public education. It’s about children and adults growing together as they discover more about what it means (and what it takes) to become responsible citizens who care about each other, about their community, and about the world. Between their many inevitable conflicts, encouraged by adults, DAS children established their own rituals. They would double-cross their arms and clasp fingers in a group handshake to mark the conclusion of “a peacemaking.” They would wipe away tears, giggle, move on to other things, or resume their play. They were learning to express themselves, listen, and include. The adults learned to hold back, hover, and accept what for the children constituted resolution, even when they (the adults) did not always fully get it. The DAS community was dedicated to the serious work, and to the joy, of respectful relationships and power sharing. This book invites you to step back more than twenty years to learn about how this began and what keeps it alive to this day.",
  "genres": [],
  "author": "Esther Sokolov Fine",
  "average_rating": "4.45",
  "url": "https://www.goodreads.com/book/show/25941519-raising-peacemakers"
}