{
  "title": "Crossover",
  "description": "Discover the Magic of this Award-Winning Fairy Fantasy Adventure Crossover is the first book in an exciting new trilogy about fairies on a quest for their wings, who are unknowingly at the center of a forgotten prophecy that will change two realms forever. Receiving 5-star reviews, this breakout fantasy adventure is full of unexpected twists and turns... enthralling both Young Adults and Adults alike In the best traditions of high fantasy and the immortal quest, this suspenseful new book weaves an unexpectedly contemporary and complex saga where fairies struggle through nine increasingly dangerous rites to earn their wings, even as the shadows of a forgotten prophecy gather to change their realm. The quest follows Danai and her friends as they confront the Rites, their own fears and beliefs, and archaic traditions as they seek to earn their wings. From the whip-crack of the Hunted Rite, through the final gut-wrenching Rite of Krisalys, they are determined to succeed or die trying. Crossover was a 2008 semi-finalist for the Reader Views Choice Literary Awards and the Eric Hoffer Book Awards. Dark Fire, Krisalys Chronicles of Feyree: Scroll 2 will be published in 2009. Receiving Great Reviews from both Young Adults and Adults  * Do you know that kind of book that you cant put down and as soon as you finish it, you want to start over again? That is the kind of book that Crossover is It is a thrilling, fantastical adventure, combining many mythical creatures and different languages that meld into a wonderful read I recommend it to anyone who loves fantasy - Carolyn S., age 12  * I give a resounding Wow for Claudia Newcorns new book, Crossover. This intelligently written adventure story involving old grudges, ambition, love, and other dimensions of existence, also speaks to the difficulties of growing up and making independent, responsible choices. Deb Shunamon, Readerviews.com  * With Crossover, Claudia Newcorn has crafted a truly imaginative and breathtaking fantasy realm. Her engrossing storytelling and great attention to detail put Crossover among the top tier of fantasy books, on par with the famous works of Tolkien. - Nick Pena, Editor, Chart Magazines  * A fantasy adventure that turned out to be a real page turner for me. Its a fairy tale with a hard edge that often surprises you. Just when you think you can predict whats going to come next, you find the author has the creativity to catch you off guard and move you deeper into this fantasy world. Ken McCall, Editor, Stanislaus Magazine  * I love fantasy, and I found Crossover hard to put down. It's not just about a fairy getting her wings. It's really about a seismic cultural shift, much like what's happening in our own world. Dana's quick-thinking and willingness to deviate from traditions is going to become pivotal in this trilogy. She reminds me of The Lord of the Rings Frodo in many ways - the unwilling hero whose choices could change the world. W. Moss",
  "genres": [
    "Fantasy",
    "Fairies"
  ],
  "author": "Claudia Newcorn",
  "average_rating": "4.23",
  "url": "https://www.goodreads.com/book/show/2594193-crossover"
}