{
  "title": "32 Yolks: From My Mother's Table to Working the Line",
  "description": "NEW YORK TIMES BESTSELLER • Hailed by Anthony Bourdain as “heartbreaking, horrifying, poignant, and inspiring,” 32 Yolks is the brave and affecting coming-of-age story about the making of a French chef, from the culinary icon behind the renowned New York City restaurant Le Bernardin.NAMED ONE OF THE BEST BOOKS OF THE YEAR BY NPRIn an industry where celebrity chefs are known as much for their salty talk and quick tempers as their food, Eric Ripert stands out. The winner of four James Beard Awards, co-owner and chef of a world-renowned restaurant, and recipient of countless Michelin stars, Ripert embodies elegance and culinary perfection. But before the accolades, before he even knew how to make a proper hollandaise sauce, Eric Ripert was a lonely young boy in the south of France whose life was falling apart.Ripert’s parents divorced when he was six, separating him from the father he idolized and replacing him with a cold, bullying stepfather who insisted that Ripert be sent away to boarding school. A few years later, Ripert’s father died on a hiking trip. Through these tough times, the one thing that gave Ripert comfort was food. Told that boys had no place in the kitchen, Ripert would instead watch from the doorway as his mother rolled couscous by hand or his grandmother pressed out the buttery dough for the treat he loved above all others,  tarte aux pommes . When an eccentric local chef took him under his wing, an eleven-year-old Ripert realized that food was more than just an It was his calling. That passion would carry him through the drudgery of culinary school and into the high-pressure world of Paris’s most elite restaurants, where Ripert discovered that learning to cook was the easy part—surviving the line was the battle.Taking us from Eric Ripert’s childhood in the south of France and the mountains of Andorra into the demanding kitchens of such legendary Parisian chefs as Joël Robuchon and Dominique Bouchet, until, at the age of twenty-four, Ripert made his way to the United States, 32 Yolks is the tender and richly told story of how one of our greatest living chefs found himself—and his home—in the kitchen.Praise for  32 Yolks“Passionate, poetical . . . What makes 32 Yolks compelling is the honesty and laudable humility Ripert brings to the telling.” — Chicago Tribune“With a vulnerability and honesty that is breathtaking . . . Ripert takes us into the mind of a boy with thoughts so sweet they will cause you to weep.” — The Wall Street Journal",
  "genres": [
    "Food",
    "Nonfiction",
    "Memoir",
    "Biography",
    "Audiobook",
    "Cooking",
    "France"
  ],
  "author": "Eric Ripert",
  "average_rating": "3.96",
  "url": "https://www.goodreads.com/book/show/25937923-32-yolks"
}