{
  "title": "The Girls Who Went Away: The Hidden History of Women Who Surrendered Children for Adoption in the Decades Before Roe v. Wade",
  "description": "A powerful and groundbreaking revelation of the secret history of the 1.5 million women who surrendered children for adoption in the several decades before Roe v. Wade  In this deeply moving work, Ann Fessler brings to light the lives of hundreds of thousands of young single American women forced to give up their newborn children in the years following World War II and before Roe v. Wade. The Girls Who Went Away tells a story not of wild and carefree sexual liberation, but rather of a devastating double standard that has had punishing long-term effects on these women and on the children they gave up for adoption. Based on Fessler's groundbreaking interviews, it brings to brilliant life these women's voices and the spirit of the time, allowing each to share her own experience in gripping and intimate detail. Today, when the future of the Roe decision and women's reproductive rights stand squarely at the front of a divisive national debate, Fessler brings to the fore a long-overlooked history of single women in the fifties, sixties, and early seventies.  In 2002, Fessler, an adoptee herself, traveled the country interviewing women willing to speak publicly about why they relinquished their children. Researching archival records and the political and social climate of the time, she uncovered a story of three decades of women who, under enormous social and family pressure, were coerced or outright forced to give their babies up for adoption. Fessler deftly describes the impossible position in which these women found themselves: as a sexual revolution heated up in the postwar years, birth control was tightly restricted, and abortion proved prohibitively expensive or life endangering. At the same time, a postwar economic boom brought millions of American families into the middle class, exerting its own pressures to conform to a model of family perfection. Caught in the middle, single pregnant women were shunned by family and friends, evicted from schools, sent away to maternity homes to have their children alone, and often treated with cold contempt by doctors, nurses, and clergy.  The majority of the women Fessler interviewed have never spoken of their experiences, and most have been haunted by grief and shame their entire adult lives. A searing and important look into a long-overlooked social history, The Girls Who Went Away is their story.",
  "genres": [
    "Nonfiction",
    "History",
    "Feminism",
    "Adoption",
    "Sociology",
    "Womens",
    "Memoir"
  ],
  "author": "Ann Fessler",
  "average_rating": "4.24",
  "url": "https://www.goodreads.com/book/show/116477.The_Girls_Who_Went_Away"
}