{
  "title": "Blue Talk and Love: Stories by Mecca Jamilah Sullivan",
  "description": "The award-wining collection Blue Talk and Love tells the stories of girls and women of color navigating the moods and mazes of urban daily life. Set in various enclaves of New York City — including the middle-class Hamilton Heights section of Harlem, the black queer social world of the West Village, the Spanish-speaking borderland between Harlem and Washington Heights, and historic Tin Pan Alley — the collection uses magic realism, historical fiction, satire and more to highlight young black women's inner lives. The storylines range a big-bodied teenage girl from Harlem discovers her sexuality in the midst of racial tensions at her Upper East Side school; four young women from Newark, New Jersey, are charged with assaulting the man who threatens to rape them; a pair of conjoined black female twins born into slavery, make their fame as stage performers in the Big City. In each story, the characters push past what is expected of them, learning to celebrate their voices and their lives. In honor of Mecca Sullivan’s being named the recipient of the 2018 Judith A. Markowitz Lambda Award as an emerging LGBTQ writer, Riverdale Avenue Books has released a second edition of her acclaimed collection for which the Lambda judges called Sullivan, \"An essential writer of our present moment.” \"We are so proud of Mecca for receiving this prestigious award. She made her fiction debut with Riverdale Avenue Books five years ago, when we were both new to the literary scene, and we are publishing an updated second edition with the wonderful quote from Ntozake Shange on the cover to commemorate this achievement,” said Publisher Lori Perkins. ***** “In Blue Talk and Love... the lives of wounded and glorious young gay women of color are portrayed with the delicacy of a mother tending to her terrible wounds…Sullivan enriches our lives with ...characters, who are so rich and impoverished at once.” —Ntozake Shange, author of for colored girls who have considered suicide/when the rainbow is enuf \"An essential writer of our present moment\" —Judges for the 2018 Judith A. Markowitz Lambda Emerging LGBTQ Writer Award Blue Talk and Love’s \"voice, despite material that seems frankly contemporary, is paradoxically lyrical, nearly Faulknerian.\" —Rick Moody, judge for the American Short Fiction Short Story Contest “Mecca Jamilah Sullivan’s debut story collection is a remarkable work best described as elegiac blues… Blue Talk and Love stuns with subtle imagery, powerful linguistic energy, and chiseled, innovative control.” — LaShonda Katrice Barnett, author of Jam on the Vine \"Sullivan’s prose shocks, intrigues, and transports us through fourteen artful and unique stories. And so do her rich and inimitable characters, most of them young black women struggling in a world they did not make but one they must confront, tear down, and remake. Black girls matter and Sullivan shows us just how much.\" — Cheryl Clarke, author of Poems in the Tradition of Black Women",
  "genres": [
    "Short Stories",
    "Fiction",
    "LGBT",
    "Anthologies",
    "College",
    "Lesbian",
    "Queer"
  ],
  "author": "Mecca Jamilah Sullivan",
  "average_rating": "4.16",
  "url": "https://www.goodreads.com/book/show/25948374-blue-talk-and-love"
}