{
  "title": "Acceptable Risk",
  "description": "From the roots of an ancient witchcraft ... a new terror to destroy.With billions of dollars at stake, every scientist in America is fighting to discover the next Prozac, the latest 'feel good' drug.Edward Armstrong believes he has hit the jackpot. He has isolated a stunningly effective anti-depressant from a bacterial mould first uncovered over two hundred years ago.But there is more to the drug than anyone could have imagined. When Edward turns violent and the corpses of mutilated animals appear near the laboratory, his girlfriend decides to investigate the truth about this new 'miracle' drug. Before it claims any more innocent lives...From the best-selling doctor whose high-voltage thrillers regularly quicken readers' pulses comes a harrowing tale of greed, abandoned ethics, and ambition run awry in the newest area of medical intervention: cosmetic psychopharmacology.Prozac-like drugs are being prescribed not only for their original purposes but increasingly to alter individual personalities to currently valued norms. With dead-on accuracy and the pre-science of tomorrow's headlines, Robin Cook explores the perilous intersection where fame and unfathomable lucre waylay and seduce the very best and brightest of those sworn to do no harm.When neuroscientist Edward Armstrong begins dating Kimberly Stewart, a descendant of a woman who was hanged as a witch at the time of the Salem witch trials, he takes advantage of the opportunity to delve into a pet theory: that the \"devil\" in Salem in 1692 had been a hallucinogenic drug inadvertently consumed with mould-tainted grain. In an attempt to prove his theory, Edward grows the mould he believes responsible from samples taken from the Stewart estate. In a brilliant designer-drug transformation, the poison becomes Ultra, the next generation of antidepressants with truly startling therapeutic capabilities.",
  "genres": [
    "Fiction",
    "Thriller",
    "Mystery",
    "Medical",
    "Suspense",
    "Horror",
    "Mystery Thriller"
  ],
  "author": "Robin Cook",
  "average_rating": "3.82",
  "url": "https://www.goodreads.com/book/show/259523.Acceptable_Risk"
}