{
  "title": "The Scrumban [R]Evolution: Getting the Most Out of Agile, Scrum, and Lean Kanban",
  "description": "Create Thriving, High-Performing Teams and Organizations with Scrumban\nScrumban allows you to use Kanban as a catalyst for increasingly valuable changes to your existing software development processes, amplifying and expanding upon Scrum’s benefits. Now, there’s a definitive guide to Scrumban that explains what it is (and isn’t), how and why it works, and how to use it to improve both team and organizational performance.Comprehensive, coherent, and practical, The Scrumban [R]Evolution will help you incrementally apply proven Lean/Agile principles to get what matters most: pragmatic, bottom-line results. Pioneering Scrumban coach Ajay Reddy clarifies Scrumban’s core concepts and principles, and illuminates their application through real-life examples. He takes you from the absolute basics through sustainable adoption, and from choosing metrics to advanced forecasting and adaptive management.Whatever your role in the organization, this essential guide liberates you to tailor Kanban systems based on your unique challenges–and to solve delivery problems and improvement stagnation you haven’t been able to solve with Scrum alone. \n   Discover how Scrumban can help you reignite stalled Agile initiatives \n   Clarify crucial relationships between purpose, values, and performance \n   Quickly develop shared understanding in and across teams \n   Use Scrumban to better manage Product Owner/Customer expectations \n   Improve the rollout of Scrum in any team using Scrumban \n   Use Scrumban and let real improvements spread with least resistance \n   Use the right metrics to gain insight, track progress, and improve forecasting \n   Take advantage of Scrumban’s advanced capabilities as you gain experience \n   Develop leaders to successfully guide your Agile initiatives \n   Integrate modeling to reliably refine your forecasting and decision-making",
  "genres": [
    "Programming",
    "Management",
    "Nonfiction",
    "Computer Science"
  ],
  "author": "Ajay Reddy",
  "average_rating": "3.72",
  "url": "https://www.goodreads.com/book/show/25953144-the-scrumban-r-evolution"
}