{
  "title": "Genesis",
  "description": "\"There is no good or evil. We classify things into good and evil because we are currently unable to solve the two problems of the world: death and dearth. If there ever comes a time when we can solve these problems, we won't be required to do this anymore.\"  For the first time in history, the truth is out.  This story reveals to you the truth about reality and the fabric of the universe, which up until now had been kept secret from mankind.  This book solves the enigmas that have perplexed even the greatest thinkers of the world throughout the ages: what is soul, what is human, what happens after we die, what law governs the universe.  From personal spiritual awakening to the grand design of the world's systems, from love stories to the realm of quantum physics, this book carries you through time, from the beginning of consciousness to the future, where the hidden-but-now-revealed truth holds.  If Jesus Christ was the one we read in the bible, he couldn't possibly be the Son of God. If Muhammad was the one we read in the Quran, he couldn't possibly be the Messenger of God. If Buddha thought and acted the way we know from the many books, he hadn't developed the true awareness. If Hindu's Gods liked to war the way we read in many books, then their existence is questionable. Why? It's simple, because the stories we read about them showed that they didn't know.  Genesis, on the other hand, knows.  For the first time, you will also be given the explanation/clues: 1. Why the universe is infinite. 2. How to come up with the ultimate theory and get rid of the discrepancies among theories, by giving the correct definition of absolute distance, space, matter, and reality. 3. What actually happened in the beginning of the universe: it was not big bang. 4. Whether parallel universes exist. What are they? Can we go there? 5. That due to the new definition of space and time, it is not possible to go to the future. 6. Why there isn't any singularity inside a black hole. 7. What gravity is. 8. Why scientists can't get anything right. 9. What soul is, and the reason why this world is full of sufferings. 10. That there is no hell, and there is no heaven, and ultimately the truth will be revealed against THE BIGGEST LIE IN THE WORLD EVER, which has shaped the foundation of humanity from the very beginning of its time.",
  "genres": [
    "Science Fiction"
  ],
  "author": "Andreas Laurencius",
  "average_rating": "3.96",
  "url": "https://www.goodreads.com/book/show/25944368-genesis"
}