{
  "title": "The Apothecary",
  "description": "You’re going to love The Apothecary, an extraordinary technothriller jam-packed with action and suspense!.From a \"Foreword Reviews,\" Award Winning Author, Marshall Chamberlain gives us another adventure into plausible reality. Set in Atlanta, Georgia, The Apothecary is a nano-technology thriller, exploring the heights of human degeneracy and the vile consequences of insane arrogance.A TOP SECRET, DOD NANOTECHNOLOGY PROJECT IS COMPROMISED.A ROGUE SCIENTIST EXPERIMENTS ON HUMAN BEINGS.DESIGN OF INEXPENSIVE NANO-DRUGS TAKES OVER THE DRUG INDUSTRY.THE NANO REPLICATION PROCESS CAN DESTROY THE PLANET.Dr. Corey Parnevik, the director of Pharmco’s DOD project, who functions under heavy medication to control behavior disorders, disappears along with proprietary, hi-tech nanite inventory—test products capable of significantly affecting human behavior.A pattern of mysterious homicides manifests, and Parnevik becomes a prime suspect. The Atlanta PD investigates and is assisted by an unlikely alliance of three civilians: Mallory Driscoll, a lawyer and sister to the first homicide victim; Ryan McKenzie, a DEA agent with a past romantic attachment to Mallory; and Professor Barius VonMitton, a reclusive, retired Emory University academic plagued by multiple personality disorder.The stakes quickly morph into a matter of the highest national security when Parnevik’s profane experimenting and complicity lead to a disaster in the nano-labs at Atlanta’s Georgia Tech University.With the President of the United States involved and the media ready to pounce, the pursuit of the elusive Parnevik leads the alliance to the mountains of North Georgia, the slopes of the French Alps, the mesas of New Mexico, the hallowed halls of Washington, D.C., and the city streets of Caracas.Again Chamberlain gives readers an exploration into plausible reality, packed with suspense--one of the best technothrillers of the decade.",
  "genres": [],
  "author": "Marshall Chamberlain",
  "average_rating": "4.27",
  "url": "https://www.goodreads.com/book/show/25944916-the-apothecary"
}