{
  "title": "Katherine Howard: The Tragic Story of Henry VIII's Fifth Queen",
  "description": "Looming out of the encroaching darkness of the February evening was London Bridge, still ornamented with the severed heads of Thomas Culpeper and Francis Dereham; the terrible price they had paid for suspected intimacy with the queen.Katherine now reached the Tower of London, her final destination. Katherine Howard was the fifth wife of Henry VIII and cousin to the executed Anne Boleyn. She first came to court as a young girl of fourteen, but even prior to that her fate had been sealed and she was doomed to die. She was beheaded in 1542 for crimes of adultery and treason, in one of the most sensational scandals of the Tudor age.The traditional story of Henry VIII's fifth queen dwells on her sexual exploits before she married the king, and her execution is seen as her just dessert for having led an abominable life. However, the true story of Katherine Howard could not be more different. Far from being a dark tale of court factionalism and conspiracy, Katherine's story is one of child abuse, family ambition, religious conflict and political and sexual intrigue. It is also a tragic love story. A bright, kind and intelligent young woman, Katherine was fond of clothes and dancing, yet she also had a strong sense of duty and tried to be a good wife to Henry. She handled herself with grace and queenly dignity to the end, even as the barge carrying her on her final journey drew up at the Tower of London, where she was to be executed for high treason.Little more than a child in a man's world, she was the tragic victim of those who held positions of authority over her, and from whose influence she was never able to escape.",
  "genres": [
    "History",
    "Nonfiction",
    "Biography",
    "Tudor Period",
    "Politics",
    "Historical",
    "British Literature"
  ],
  "author": "Josephine Wilkinson",
  "average_rating": "3.93",
  "url": "https://www.goodreads.com/book/show/25960578-katherine-howard"
}