{
  "title": "Sleeping Giants",
  "description": "From Book 1: A page-turning debut in the tradition of Michael Crichton, World War Z, and The Martian, Sleeping Giants is a thriller fueled by an earthshaking mystery—and a fight to control a gargantuan power.  A girl named Rose is riding her new bike near her home in Deadwood, South Dakota, when she falls through the earth. She wakes up at the bottom of a square hole, its walls glowing with intricate carvings. But the firemen who come to save her peer down upon something even stranger: a little girl in the palm of a giant metal hand.   Seventeen years later, the mystery of the bizarre artifact remains unsolved—its origins, architects, and purpose unknown. Its carbon dating defies belief; military reports are redacted; theories are floated, then rejected.   But some can never stop searching for answers.   Rose Franklin is now a highly trained physicist leading a top secret team to crack the hand’s code. And along with her colleagues, she is being interviewed by a nameless interrogator whose power and purview are as enigmatic as the provenance of the relic. What’s clear is that Rose and her compatriots are on the edge of unraveling history’s most perplexing discovery—and figuring out what it portends for humanity. But once the pieces of the puzzle are in place, will the result prove to be an instrument of lasting peace or a weapon of mass destruction?   Praise for Sleeping Giants“Reminiscent of The Martian and World War Z, Sleeping Giants is a luminous conspiracy yarn that shoots for (and lands among) the stars.”—Pierce Brown, New York Times bestselling author of Red Rising  “As high-concept as it is, Sleeping Giants is a thriller through and through. . . . Not only is Sleeping Giants one of the most promising series kickoffs in recent memory, it’s a smart demonstration of how science fiction can honor its traditions and reverse-engineer them at the same time.”—NPR   “Neuvel weaves a complex tapestry with ancient machinery buried in the Earth, shadow governments, and geopolitical conflicts. But the most surprising thing about the book may just be how compelling the central characters are in the midst of these larger-than-life concepts. . . . I can’t stop thinking about it.”—Chicago Review of Books “First-time novelist Sylvain Neuvel does a bold, splashy cannonball off the high dive with Sleeping Giants. It bursts at the seams with big ideas and the questions they spawn—How much human life is worth sacrificing in the pursuit of scientific progress? Can humanity be trusted with weapons of ultimate destruction? And the biggest: Are we alone? But all that really matters is that this book is a sheer blast from start to finish. I haven’t had this much fun reading in ages.”—Blake Crouch, author of Dark Matter and the bestselling Wayward Pines trilogy“A remarkable debut . . . Reminiscent of Max Brooks’s World War Z, the story’s format effectively builds suspense.",
  "genres": [
    "Science Fiction",
    "Fiction",
    "Audiobook",
    "Fantasy",
    "Adult",
    "Mystery",
    "Science Fiction Fantasy"
  ],
  "author": "Sylvain Neuvel",
  "average_rating": "3.82",
  "url": "https://www.goodreads.com/book/show/25955353-sleeping-giants"
}