{
  "title": "Grey: Fifty Shades of Grey as Told by Christian by by E L James | Summary & Analysis",
  "description": "SPECIAL DISCOUNT  (Regularly $3.99 $2.99.) Grey is the parallel narrative to the 50 Shades of Grey trilogy by E.L. James, from Christian Grey’s point of view rather than Anastacia Steele’s. Grey is an erotic novel with aspects of romance that delves into a topical display of the BDSM (bondage, discipline, sadism, masochism) lifestyle. As a result of Grey only being told from Christian Grey’s point of view, the reader gets a strong sense of Grey’s past and his personal perspective via flashbacks, dreams, nightmares, and a constant internal monologue. The reader is told that Grey uses the “discipline” aspects of BDSM culture as a coping mechanism for the physical and psychological abuse he suffered as a child, between the ages of 3 and 4. Grey unintentionally shows stunted emotional growth and vents his frustrations with his subconscious self through “performative punishment” acts; he shows no emotional attachment to and of the women who agree to be his “submissives” until he meets and become infatuated with Anastacia Steele. Steele consumes his thoughts and fantasies before, during, and after their one-month, whirlwind relationship, and the novel ends when he commits to winning her back. Grey as a novel reads at an elementary school level; outside of Grey’s dreams told from the point of view of toddler-aged Grey, the novel is simplistic at best, with instances of word misuse and extremely vague description. The character development is nominal; when presented with an adult with deep psychological scars, the author has given themselves the responsibility to develop them into a realistic character – many people have abuse in their pasts and can relate to this topic, therefore, when a writer establishes a character with substantial amounts of abuse, they need to give an equally substantial amount of consideration to the treatment of the character because the potential readers who don’t identify with the character could potentially carry over the same superficial treatment of a fictional character to a real person. That being said, James does not allow any growth for Grey as a character within the novel, except to move him towards “consideration” of growth rather than “actualization” of growth. She cuts Grey off at the proverbial knees, by keeping as an attractive, rich man with a kinky sex life and a shadowy background. Would You Like To Know More? Download your copy today! Available on PC, Mac, smart phone, tablet or Kindle device. 2015 All Rights Reserved",
  "genres": [
    "Romance",
    "Contemporary",
    "BDSM"
  ],
  "author": "aBookaDay",
  "average_rating": "4.43",
  "url": "https://www.goodreads.com/book/show/25955362-grey"
}