{
  "title": "My Grandfather Would Have Shot Me: A Black Woman Discovers Her Family's Nazi Past",
  "description": "An international bestseller, this is the extraordinary memoir of a German-Nigerian woman who learns that her grandfather was the brutal Nazi commandant depicted in Schindler's List.In this powerful story of discovery, a black woman learns by chance the truth about her family's secret Nazi past.Jennifer Teege is 38, married, a mother of two, and ten years into a career in advertising when by chance she pulls a book from the library shelf. The book is about her own family, and its contents will profoundly change her life and lead her down a painful path of self-discovery.Jennifer discovers that her grandfather is Amon Goeth, the brutal Nazi concentration camp commandant who oversaw the clearing of the Krakow ghetto in 1943 as well as the Plasz w concentration camp. He shot hundreds of people and was personally responsible for the deaths of thousands more. Millions of people worldwide know of him through Ralph Fiennes' chilling portrayal in Steven Spielberg's film Schindler's List. Guilty of genocide and war crimes, Goeth was hanged in 1946. Teege is his African-German granddaughter.Raised by foster parents, she grew up with no knowledge of the family secret. Now, it unsettles her profoundly. What can she say to her Jewish friends, or to her own children? Who is she - truly?My Grandfather Would Have Shot Me is Teege's searing chronicle of grappling with a haunted past that is suddenly, irrevocably hers. Research into her family takes her to Poland and to Israel, where she had lived for several years in her twenties, and learned fluent Hebrew. Her story was co-written by award-winning journalist Nikola Sellmair who also supplies historical context in a separate, interwoven narrative. Step by step, horrified by her family's dark history, Teege builds the story of her own liberation.",
  "genres": [
    "Nonfiction",
    "History",
    "Memoir",
    "Biography",
    "Holocaust",
    "World War II",
    "Biography Memoir"
  ],
  "author": "Jennifer Teege",
  "average_rating": "3.82",
  "url": "https://www.goodreads.com/book/show/25961355-my-grandfather-would-have-shot-me"
}