{
  "title": "Redux",
  "description": "Alex Parker sits at the crossroads, out of time and out of place...She went back to fix the past, not to imperil the future. Rescued from the icy waters of the Bering Sea by one familiar face, she's helpless to find another. Declan O'Connell jumped with her, but where did he go?In the middle of her search, a new threat confronts Alex. A serial killer with a taste for Variants has Seattle on edge. When she crosses the path of this vicious murderer, the revelations Alex discovers could change everything. That outcome is an unknown, but there is a terrible certainty on the table—an impossible decision with irreversible consequences. But can Alex make that choice and commit herself and those she loves to a total redux?Redux is the third electrifying novel of The Variant Series. A page-turning YA paranormal adventure full of unexpected twists that will keep you reading late into the night and leave you craving the next installment.Reader Praise for Redux“Oh my Declan!!! This book is a must read! I spent most of this book bawling my eyes out and cheering for the impossible! It's so suspenseful, and dramatic, and leaves you yearning for more!” -  Amazon Customer ★★★★★“This book definitely grabs your attention and never lets it go. It finally answers all the questions I had while reading the previous 2 books. Definitely love the ending. Can't wait for the next one.” -  Genevieve Mullings ★★★★★“Another great addition to this series! I was extremely impressed by the author's forethought in setting up the timeline. Everything flowed seamlessly, and the author handled the time traveling with finesse.” -  The Road Not Taken ★★★★★\"My teenager and I both love this series!” - bookworm ★★★★★“I enjoy this book more than words can express. It's an amazing story and so different from other books i've read.” -  Laura Sylvia Whetstone ★★★★★**This book is part of a series and ends in a cliffhanger.**",
  "genres": [
    "Paranormal",
    "Fantasy",
    "Young Adult",
    "Romance",
    "Time Travel",
    "Young Adult Paranormal",
    "Paranormal Romance"
  ],
  "author": "Jena Leigh",
  "average_rating": "4.26",
  "url": "https://www.goodreads.com/book/show/25955763-redux"
}