{
  "title": "The Wind's Twelve Quarters / The Compass Rose",
  "description": "Grand Master Ursula K. Le Guin has been recognised for almost fifty years as one of the most important writers in the SF field - and is likewise feted beyond the confines of the genre. The Wind's Twelve Quarters was her first collection and it brings together some of finest short fiction, including the Hugo Award-winning The Ones Who Walk Away from Omelas, the Nebula Award-winning The Day Before the Revolution, and the Hugo-nominated Winter's King, which gave readers their first glimpse of the world later made famous in her Hugo- and Nebula-winning masterpiece The Left Hand of Darkness.Contents:The Wind's Twelve Quarters • (1975) • collection by Ursula K. Le GuinThe Compass Rose • (1982) • collection by Ursula K. Le GuinA Trip to the Head • (1970) • shortstory by Ursula K. Le GuinApril in Paris • (1962) • shortstory by Ursula K. Le GuinDarkness Box • (1963) • shortstory by Ursula K. Le GuinDirection of the Road • (1973) • shortstory by Ursula K. Le GuinForeword (The Wind's Twelve Quarters) • (1975) • essay by Ursula K. Le GuinNine Lives • (1969) • novelette by Ursula K. Le GuinSemley's Necklace • [Hainish] • (1964) • shortstory by Ursula K. Le Guin (variant of The Dowry of Angyar)The Day Before the Revolution • [Hainish] • (1974) • shortstory by Ursula K. Le GuinThe Field of Vision • (1973) • shortstory by Ursula K. Le GuinThe Good Trip • (1970) • shortstory by Ursula K. Le GuinThe Masters • (1963) • shortstory by Ursula K. Le GuinThe Ones Who Walk Away from Omelas • (1973) • shortstory by Ursula K. Le GuinThe Rule of Names • [Earthsea Cycle] • (1964) • shortstory by Ursula K. Le GuinThe Stars Below • (1974) • shortstory by Ursula K. Le GuinThe Word of Unbinding • [Earthsea Cycle] • (1964) • shortstory by Ursula K. Le GuinThings • (1970) • shortstory by Ursula K. Le GuinVaster Than Empires and More Slow • (1971) • novelette by Ursula K. Le GuinWinter's King • (1969) • novelette by Ursula K. Le GuinGwilan's Harp • (1977) • shortstory by Ursula K. Le GuinIntracom • (1974) • shortstory by Ursula K. Le GuinMalheur County • (1979) • shortstory by Ursula K. Le GuinMazes • (1975) • shortstory by Ursula K. Le GuinPreface (The Compass Rose) • (1982) • essay by Ursula K. Le GuinSchrödinger's Cat • (1974) • shortstory by Ursula K. Le GuinSmall Change • (1981) • shortstory by Ursula K. Le GuinSome Approaches to the Problem of the Shortage of Time • (1979) • shortstory by Ursula K. Le GuinSQ • (1978) • shortstory by Ursula K. Le GuinSur • (1982) • shortstory by Ursula K. Le GuinThe Author of the Acacia Seeds and Other Extracts from the Journal of the Association of Therolinguistics • (1974) • shortstory by Ursula K. Le GuinThe Diary of the Rose • [Orsinia] • (1976) • novelette by Ursula K. Le GuinThe Eye Altering • (1976) • shortstory by Ursula K. Le GuinThe First Report of the Shipwrecked Foreigner to the Kadanh of Derb • (1978) • shortstory by Ursula K. Le GuinThe New Atlantis • (1975) • novelette by Ursula K. Le GuinThe Pathways of Desire • (1979) • novelette by Ursula K. Le GuinThe Phoenix • (1982) • shortstory by Ursula K. Le GuinThe Water Is Wide • (1976) • shortstory by Ursula K. Le GuinThe White Donkey • (1980) • shortstory by Ursula K. Le GuinThe Wife's Story • (1982) • shortstory by Ursula K. Le GuinTwo Delays on the Northern Line • [Orsinia] • (1979) • shortstory by Ursula K. Le Guin",
  "genres": [
    "Science Fiction",
    "Fantasy",
    "Short Stories",
    "Fiction",
    "Classics",
    "Anthologies",
    "Adult"
  ],
  "author": "Ursula K. Le Guin",
  "average_rating": "4.03",
  "url": "https://www.goodreads.com/book/show/25956281-the-wind-s-twelve-quarters-the-compass-rose"
}