{
  "title": "Selling Well: The 5 Relationships that Experts, Authors & Coaches Use to Sell 1,000 Books in 21 Days",
  "description": "I’ve observed that the experts who have these five relationships down are the ones that are actually thriving. One can sell 1,000 books in 21 days without them in place, but only a 5 Relationship-focused expert can build on the momentum of a launch and turn it into an amazing business success.  The relationships start from within and move progressively outward. Incidentally, they are also the very tools that Sarah used to help her have an amazing book launch.  Without further ado, here are The 5  Relationship 1: Your Mindset Relationship 2: Your Message Relationship 3: Your Marketing Relationship 4: Your Members Relationship 5: Your Money  In the book there are questions to ask yourself as well as an action plan to help you put each relationship into motion in your business.  Relationship 1: Your Mindset When very successful people were asked by Napoleon Hill near the turn of the century what got them their wealth, in one way or another they referred to their mental ability to create before creating physically in the real world. Building on timeless principles Your Mindset is about creating that working relationship with yourself that fosters growth, ability and confidence. Here we discuss the process of turning your dreams into reality.  Relationship 2: Your Message Confidence that you have something that will better lives leads successful authors to get to know their audience in a deep meaningful way. The message you share stems from this awareness of your reader and creates something that truly resonates with them. If the sum of the first relationship is “know thyself,” the short of this one is “know your reader.” In relationship 2 we share hot tips for targeting your ideal reader.  Relationship 3: Your Marketing While many experts have the first two relationships down, this is where some things start to break down. They know they want to get the word out and often they are trying so hard. They blog, they tweet, they tell people. But in the end it feels like an uphill battle. The relationship examined in Your Marketing is the one you have with partners, those who are speaking to your readers, those who already have built trust with the ones you want to speak to. This is a core part of my group success program and it’s a core part of a platform that thrives. Here we uncover the secrets to building a big audience fast.  Relationship 4: Your Members I’m not sure if it’s baggage from the past that keeps many experts from making regular and clear invites...Fear of rejection or something similar? If so, I can relate. But I can testify how a plan to do invite readers to become members of your group will that also share how to set up a plan that both encourages new subscribers and keeps them fiercely loyal.  Relationship 5: Your Money Likely if any one of the five relationships is missing, it’s this one. Money’s ability to come to you hinges on your ability to create the organization and systems that money likes. You see, money is just a trust that has in your ability to solve their problems. That trust increases exponentially when you assure your members that they’re safe with you. I divulge some of the basic systems that actually make money, increase average orders and do so without breaking your back.",
  "genres": [
    "Business",
    "Writing",
    "Entrepreneurship"
  ],
  "author": "Ryan Mendenhall",
  "average_rating": "4.57",
  "url": "https://www.goodreads.com/book/show/25965112-selling-well"
}