{
  "title": "Deathwing",
  "description": "This classic anthology of dark and gothic SF was first published in the late 1980s and richly deserves its cult reputation. It includes work by blistering talents such as Ian Watson, Storm Constantine, Dan Abnett, Charles Stross, William King, Neil McIntosh, Gav Thorpe and Graham McNeill.Deathwing, a Warhammer 40,000 anthology, is a gripping collection of the darkest science fiction stories set in the stark and brutal universe of Warhammer 40,000, stretching from the exploits of the lethal agents of the Officio Assassinorum to the babbling of incarcerated lunatics, their minds broken by the insanity of Chaos. The Deathwing are the secretive inner circle of the most vigilant and zealous of the Emperor's warriors, the Dark Angels. They alone bear the truth of the hidden shame that taints them and each one of their fellows, and their ancient disgrace is just one in a galaxy of mysteries. In the nightmare future of the 41st Millennium, humanity must fight for survival againt a myriad heretical alien races – but the most dangerous enemies of all are the former champions of mankind, now corrupted by the foul taint of Chaos!Contents: 8Deathwing [Warhammer 40,000] (1990) / novella by Bryan Ansell, William King *Devil's Marauders [Warhammer 40,000] (1990) / novelette by William King *Pestilence [Warhammer 40,000] (2001) / novelette by Dan Abnett *Lacrymata [Warhammer 40,000] (1990) / novelette by Storm Constantine *The Alien Beast Within [Inquisition War] (1990) / novelette by Ian Watson *Seed of Doubt [Warhammer 40,000] (1990) / novelette by Neil McIntosh *Suffer Not the Unclean to Live [Warhammer 40,000] (2001) / novelette by Gav Thorpe *Warped Stars [Inquisition War] (1990) / novella by Ian Watson * Monastery of Death [Warhammer 40,000] (1990) / novelette by Charles Stross * Unforgiven [Warhammer 40,000] (2001) / short story by Graham McNeill.",
  "genres": [
    "Science Fiction",
    "40k",
    "Fiction",
    "Anthologies",
    "Short Stories",
    "Military Science Fiction",
    "Role Playing Games"
  ],
  "author": "Neil Jones",
  "average_rating": "3.65",
  "url": "https://www.goodreads.com/book/show/2596527-deathwing"
}