{
  "title": "Lines in the Sand: An American Soldier's Personal Journey in Iraq",
  "description": "For F. Scott Service, a five-minute phone call one peaceful morning was all it took. Faced with the terrible dichotomy of his moral opposition to war and an innate sense of duty, little did he realize that when he was called for deployment in Iraq that his would be a tour of duty destined to change him forever.Witnessing the violence of a country ravaged by chaos and facing the disintegration of his life back home, his sojourn in Iraq forced him to fight a new battle, a battle within himself. What had once been a noble intention became a desperate struggle to salvage what was left of his humanity, an excursion into the darkest recesses of the human mind that ultimately led him to question everything he had come to believe. Pushed to the edge, only then would he discover what lay within.Author F. Scott Service recounts his wartime experience within an artfully lyrical epistolary composition. Transcribed from his handwritten journals, Lines in the Sand is a powerful exercise in self-exploration amid heart wrenching loss and anguish.From the author: Why would a Conscientious Objector make the choice to go to war?In this unique book marking the 10-year anniversary of my return home from Iraq while being deployed with the U.S. Army, I answer that and much more through a transcription of my personal, handwritten journal I kept while stationed at Camp Anaconda. I take you on a roller coaster ride through the realities of my Iraq War experience, from the boredom to the bombs, from losing my marriage to finding my inner spirituality and with on the spot journaling, you're in the front seat.Mine is a story of love, betrayal, fear, courage, despair, and hope.",
  "genres": [
    "Nonfiction",
    "War",
    "Memoir",
    "Military Fiction",
    "History"
  ],
  "author": "F. Scott Service",
  "average_rating": "4.70",
  "url": "https://www.goodreads.com/book/show/25966340-lines-in-the-sand"
}