{
  "title": "Murph",
  "description": "Murph, the Sports Entrepreneur Man and His Leagues, is the captivating autobiography of Dennis Arthur Murphy, Sr., the energetic sports promoter who helped to found such professional leagues as the World Hockey Association, the American Basketball Association, World Team Tennis and Roller Hockey International. Jeanie Buss, the vice president of the Los Angeles Lakers, said that Dennis Murphy has connections so strong he can gather the top 10 sports moguls in a room with a single phone call. Murphy used those connections to build leagues that competed head to head with the entrenched National Hockey League and National Basketball Association. Murphy and his cohorts enticed Bobby Hull to flee the NHL to the WHA with an unprecedented $1 million contract and Mr. Hockey, Gordie Howe, soon followed. The list of people Murphy reminisces about in Murph reads like a Who’s Who of Sports in the 20th century and into the 21st – Billie Jean King, Chris Evert, Rod Laver, John Newcombe, Scotty Bowman, Frank Mahovlich, Wayne Gretzky, George Mikan, Julius Erving, Wilt Chamberlain, Rick Barry, George Gervin, Larry Brown and Bill Sharman. Murphy also hobnobbed with politicians and other celebrities. In 1967, Murphy and attorney Gary Davidson created the American Basketball Association, a league that eventually merged several teams into the NBA. Under Murphy’s watch, the ABA became famous for its red, white and blue basketball, sideline cheerleaders, the 3-point shot and the slam dunk. The World Hockey Association debuted in 1972 and gave the more established National Hockey League fits by cannibalizing NHL rosters, placing teams in major cities that didn’t host NHL teams, and successfully challenging the reserve clause that bound players to their teams. This victory gave NHL players the opportunity to split to the upstart league; 66 NHL players followed Bobby Hull’s lead in the WHA’s first year. The league disappeared in 1979, but not before four teams – the Edmonton Oilers, New England Whalers, Quebec Nordiques, and Winnipeg Jets – joined the NHL. Murphy co-founded World Team Tennis in 1973. League play began in 1974 with 16 teams, a four-color tennis court, and teams made up of two men and two women. This made WTT the first professional sports league to give equal weight to each man and woman competing for their teams. In 1992, Murphy, then 66 years old, was inspired to develop a new pro sport out of that decade’s inline skating craze. RHI was the first pro full-contact league in which women played against men – Manon Rheaume, Kelly Dyer and Erin Whitten were RHI goalies. Murphy, now 86, is trying to create a new 6-foot-4 inches-and-under pro basketball league, a Women’s Sports Walk of Fame and a new professional roller hockey league. Murphy might be the most unlikely, least known and most influential visionary in North American professional sports history, according to Richard Neil Graham, the editor of Murph. According to Graham, Murphy has a rather leprechaun-like stature, tall dreams, a gift of gab and the ability to bring together a diverse group of people to work toward a common goal. Humble and hilarious, with a touching and impressive old-school respect for women, an enduring love for his USC Trojans, and friendships lasting a half century and more, Dennis Arthur Murphy has extensive and illuminating sports memories. Read about Gordie Howe’s hotel room being bugged by the Russians during the 1976-77 Super Series between WHA teams and teams from the USSR, how the WHA almost went with a red puck, how the owner of the Winnipeg Jets turned down Barbra Streisand as a singer at his nightclub, how Scotty Bowman kept Murphy and his Los Angeles Sharks from stealing Ken Dryden away from the Montreal Canadiens, and more. The 323-page book includes 20 pages of black and white photos and letters promoting Murphy to the Hockey and Basketball Halls of Fame.",
  "genres": [
    "Sports",
    "Nonfiction",
    "Biography",
    "Baseball"
  ],
  "author": "Dale Murphy",
  "average_rating": "3.87",
  "url": "https://www.goodreads.com/book/show/2596297-murph"
}