{
  "title": "Aberrations in Black: Toward a Queer of Color Critique",
  "description": "A hard-hitting look at the regulation of sexual difference and its role in circumscribing African American cultureThe sociology of race relations in America typically describes an intersection of poverty, race, and economic discrimination. But what is missing from the picture—sexual difference—can be as instructive as what is present. In this ambitious work, Roderick A. Ferguson reveals how the discourses of sexuality are used to articulate theories of racial difference in the field of sociology. He shows how canonical sociology—Gunnar Myrdal, Ernest Burgess, Robert Park, Daniel Patrick Moynihan, and William Julius Wilson—has measured African Americans’s unsuitability for a liberal capitalist order in terms of their adherence to the norms of a heterosexual and patriarchal nuclear family model. In short, to the extent that African Americans’s culture and behavior deviated from those norms, they would not achieve economic and racial equality. Aberrations in Black  tells the story of canonical sociology’s regulation of sexual difference as part of its general regulation of African American culture. Ferguson places this story within other stories—the narrative of capital’s emergence and development, the histories of Marxism and revolutionary nationalism, and the novels that depict the gendered and sexual idiosyncrasies of African American culture—works by Richard Wright, Ralph Ellison, James Baldwin, Audre Lorde, and Toni Morrison. In turn, this book tries to present another story—one in which people who presumably manifest the dysfunctions of capitalism are reconsidered as indictments of the norms of state, capital, and social science. Ferguson includes the first-ever discussion of a new archival discovery—a never-published chapter of  Invisible Man  that deals with a gay character in a way that complicates and illuminates Ellison’s project. Unique in the way it situates critiques of race, gender, and sexuality within analyses of cultural, economic, and epistemological formations, Ferguson’s work introduces a new mode of discourse—which Ferguson calls queer of color analysis—that helps to lay bare the mutual distortions of racial, economic, and sexual portrayals within sociology.",
  "genres": [
    "Queer",
    "Race",
    "Theory",
    "Nonfiction",
    "LGBT",
    "Queer Studies",
    "Sexuality"
  ],
  "author": "Roderick A. Ferguson",
  "average_rating": "4.33",
  "url": "https://www.goodreads.com/book/show/1164964.Aberrations_in_Black"
}