{
  "title": "The Casanova Killer: The Life of Serial Killer Paul John Knowles",
  "description": "Paul John Knowles, nicknamed the Casanova killer, went on a 4-month killing spree in 1974. He still remains one of the lesser known serial killers of his generation. Read about this psychopath who wanted fame before his life ended . Download FREE with Kindle Unlimited! November 7, 1974 As she entered her home in Milledgeville, Georgia, all Ellen Carr probably had on her mind was going to bed. She was a registered nurse who worked a night shift, and although the small family welcomed the money, the job was a demanding one. Inside, the house was unnaturally quiet. She found that odd. Her husband, forty-five-year-old businessman Carswell Carr and fifteen-year-old daughter Amanda usually greeted her when she came home from the hospital. That wasn’t the only sign that something was seriously amiss. As an investigator later put it, “The (place) looked as if it had been attacked by an animal.” Mirrors were smashed. Slashed furniture lay everywhere, some of it in pieces. Books from the bookshelves littered the floor. Had they been robbed? Where were Carswell and Mandy? Heart pounding, Mrs. Carr ran from room to room, calling out. Minutes later, she was back outside, screaming hysterically. Neighbors called the police to what was obviously the scene of a gruesome double homicide. Carswell Carr’s nude corpse was lying face down on the couple’s bed, hands bound behind his back and twenty-seven stab wounds, inflicted by scissors, all over his body. The medical examiner later determined that he had died of a heart attack, likely brought on by the torture. Down the hall, Amanda was also face down in her room, one nylon stocking tied tightly around her neck and the other shoved down her throat. To compound the horror, she appeared to have been raped after death. When Mrs. Carr regained her senses, she went through the house with the police and identified several things that were Carswell’s briefcase, shaving kit, credit cards, identification, and most of his clothing. While detectives searched for more clues, the murderer, wearing his victim’s clothes, was in an Atlanta bar, flirting with a lady reporter. He told her his name was Daryl Golden, but his real name was Paul John Knowles, and he was destined to be remembered as one of the most vicious and unpredictable serial killers of his generation. Read on your favorite devices such as Kindle, IPhone, IPad, Android cellular phone, tablet, laptop, or computer with Amazon's free reading Kindle App. Scroll back up and click the BUY NOW button at the top right side of this page for an immediate download!",
  "genres": [
    "True Crime",
    "Nonfiction",
    "History",
    "Crime"
  ],
  "author": "Jack          Smith",
  "average_rating": "3.62",
  "url": "https://www.goodreads.com/book/show/25962587-the-casanova-killer"
}