{
  "title": "Bat-21",
  "description": "Book Review: Requiem for a Yankee Hero in Vietnam By PAUL DEAN, Los Angeles Times, October 23, 1980Excerpt:\"Lt. Col, Iceal E. Hambleton, U.S. Air Force, has been a forgotten hero since 1972. As North Vietnam's hammer was beating out South Vietnam's submission, Hambleton was shot down 12 miles south of the DMZ. He later received the Silver Star and lesser medals. They don't seem enough. For \"Bat-21\" reveals a military man amidst 12 days of continuous valor, above and beyond other moments of bloody bravery. And it is certainly worth noting that Hambleton, quite out of his element as an airman ducking on the ground, was 53 years old—too ancient for such combat. A navigator aboard an EB-66 radar plane, Hambleton's body was peppered by flak and jolted by ejection after a surface-to-air missile exploded his aircraft. He parachuted, not behind North Vietnamese lines, but into the middle of a major advance. Despite injuries, Hambleton buried himself in a shallow grave while American aircraft ringed his position with gravel, lemon-sized mines to block North Vietnamese searchers. They wanted him. We wanted him. Hambleton's head was stuffed with electronic surveillance secrets. In the literal tug-of-war that followed, with helicopter rescue made impossible by enemy gunfire, Hambleton used his survival radio to call in air strikes against gun emplacements and troop movements in his area. His diet was rainwater and raw corn. He fought pain, infection and eventual dysentery. He survived earth tremors when, for the first time in the history of air search and rescue, a B-52 strike was used to sterilize hostile ground around his hideaway. His movements constantly quarterbacked by a forward air controller orbiting a light plane overhead, Hambleton was eventually ordered to crawl to freedom at night. North Vietnamese were known to be monitoring rescue frequencies, So a code was devised; he was given distances and directions toward freedom that overlaid golf courses he had played. Hazards for Hambleton's deadly 18 holes were a polluted river, leeches, snakes, exhaustion, starvation, dehydration, illness, hallucination and an encounter with a North Vietnamese soldier Hambleton killed in a knife fight. It is a tense, ascending narrative, written capably by Anderson so long after the event. He catches the jargon and humor of airmen. He has no difficulty pegging the depression and euphoria of a man in the middle, the unexpected stamina born of stubbornness and, through it all, the frustration of a 53-year-old man forcing himself to generate the vitality of a 24-year-old.\"",
  "genres": [
    "Nonfiction",
    "Military Fiction",
    "History",
    "War",
    "Biography",
    "Military History",
    "Aviation"
  ],
  "author": "William C. Anderson",
  "average_rating": "4.17",
  "url": "https://www.goodreads.com/book/show/2597303-bat-21"
}