{
  "title": "Plum Upside Down",
  "description": "Farm Romance and Farm Living - a new take on Christian Romance Novels!  Christian Contemporary Romance with a Farm Lit Flair  Topsy-Turvy... or Right-Side Up?  Green Acres newcomer Chelsea Riehl is annoyed she’s assigned to farm work alongside the only other single, a faith-filled hippie with a missionary vision.  She'd hoped to organize events and keep her heart safe, not pit plums with annoying Keanan Welsh.  Discouraged by Chelsea's lack of spiritual depth, Keanan is confused when she offers to arrange meals for the church Alpha program he is co-hosting. Maybe he misjudged her, after all.   When fake it ’til you make it gives way to stepping out in faith, both Chelsea and Keanan have some soul-searching to do. And while getting on the same page spiritually is a good start, other barriers may keep their budding romance from flipping right-side up.   About The Farm Fresh Christian Romance Series  1. Raspberries and Vinegar (free Christian Romance novel!) 2. Wild Mint Tea 3. Sweetened with Honey 4. Dandelions for Dinner 5. Plum Upside Down  Love farm life?  Plum Upside Down is the fifth novel in the Farm Fresh Romance series. This Christian romance series follows the adventures, romantic and otherwise, of a group of young women who purchase an old farm together in northern Idaho to grow their own organic food and prove to those around them that they can make a difference. These farm romance novels are stories of farm life with a focus on local food. The Farm Fresh Romance series doesn't pad the issues nor preach about them, but allows the characters the freedom to grapple with environmentalism and sustainability as believers.  Award-winning Christian contemporary romance series at its finest!   *~* EXCERPT *~*   Lights dimmed in the back of the room, and Keanan looked up to see Chelsea, sweater and purse tossed over her shoulder, striding near, her unfriendly gaze seemingly fixed on Tracy.  He frowned. What was all that about?  Chelsea’s eyes didn’t waver from Tracy’s as she spoke. “Ready to go, Keanan?”  “Yes.” He stood, flexing his shoulders. Sitting for so long was more difficult than physical labor. “Good to meet you, Tracy. I’ll see you next week.”  He didn’t miss the speculative gleam as Tracy looked between him and Chelsea. Discomfort sifted through him. Tracy couldn’t be interested in him any more than Chelsea could. Neither woman needed to size up the competition. Chelsea had made her dislike of him obvious enough in the few weeks they’d known each other. Besides, it didn’t matter. He wasn’t looking for romance.  Tracy stretched a hand to Chelsea. “I’m Tracy Grindle. I don’t believe we’ve met?”  Was she offering sincere friendship? That would be good. They must be about the same age.  “Chelsea Riehl. Nice to meet you.” She sidled a bit closer to Keanan as she shook Tracy’s hand.  Awkward. Keanan took a step back, further from the two women who seemed to analyze each other. He glanced toward the door.  Pastor Ron waited by the light switch, a bemused expression on his face.  Keanan turned to the impasse before him. “Time to go, ladies. Pastor Ron’s ready to lock up.”  Neither moved.",
  "genres": [
    "Christian Fiction",
    "Contemporary",
    "Romance",
    "Clean Romance",
    "Christian",
    "Christian Romance"
  ],
  "author": "Valerie Comer",
  "average_rating": "4.50",
  "url": "https://www.goodreads.com/book/show/25966101-plum-upside-down"
}