{
  "title": "Giada's Kitchen: New Favorites from Everyday Italian",
  "description": "She’s taught us every facet of Italian cooking—from traditional and regional to seasonal and contemporary. She even made us fall in love with pasta again by opening us up to lighter, healthier versions that don’t weigh us down. Now the Food Network star and bestselling author of Everyday Pasta, Giada De Laurentiis, takes us down a new path, sharing her love of food with clean, vibrant, simple flavors and bursts of bright colors that look as beautiful on the plate as they are delicious. Yes, you will still find those fabulous recipes she remembers so fondly from family meals, but you’ll also find updated twists on classic trattoria favorites—California-inflected, hearty but not overwhelming, and with the perfect balance of healthfulness and terrific flavor. Wouldn’t you love a faster, lighter take on osso buco (here made with turkey instead of veal), a salad with real substance (like one of cantaloupe, red onion, and walnuts), and fish that gets an Italian makeover by way of lots of fresh veggies and accents such as fennel and grapefruit salsa? And let’s not forget dessert. After all, what’s not to adore about little doughnuts dipped in chocolate sauce?Ranging from soups and snacks to easy entrées and elegant dinner-party fare, Giada’s recipes are perfect for any day of the week. And for the first time, she includes a full section of dishes that the little ones will love making as much as they love eating (like mini chicken meatballs). With something to please everyone at your table, Giada’s Kitchen deliciously demonstrates why Giada De Laurentiis has become America’s best-loved Italian cook.Italy meets California In Giada De Laurentiis’s collection of 100 new recipes, she focuses on fresh ingredients, simple preparation, and bright flavors. Anyone who wants to indulge in the pleasures of Italian food without feeling weighed down will find inspiration for delicious, hearty yet healthy weekday meals. Giada’s recipes satisfy both our desire to eat with gusto and to feel good about what we eat.",
  "genres": [
    "Cookbooks",
    "Cooking",
    "Food",
    "Nonfiction",
    "Reference",
    "Italian Literature",
    "Italy"
  ],
  "author": "Giada De Laurentiis",
  "average_rating": "4.10",
  "url": "https://www.goodreads.com/book/show/2596537-giada-s-kitchen"
}