{
  "title": "Against the Wall: A Novel",
  "description": "The RITA-nominated author of The Edge of Night returns with another seductive novel, hailed by M. O’Keefe as “a dirty, gritty gem of a book.” As teens, Eric and Meghan fell for each other despite the odds—but now that they’re all grown up, they’re reunited by dangerous secrets.\n \n Eric Hernandez is the bad boy of every schoolgirl’s fantasies—and every mother’s nightmares. But after serving time for manslaughter, he’s ready to turn his life around. He just needs a chance to prove himself as a professional tattoo artist. The one thing that keeps him going is the memory of the innocent beauty he loved and left behind.   Meghan Young’s world isn’t as perfect as it looks. The preacher’s daughter is living a lie, especially now that Eric is back. Tougher, harder, and sexier than ever, he might be the only person she can trust. But there’s no telling what he’ll do to protect her if he learns the truth, and that’s a risk Meghan won’t let him take. And yet, back in the arms of the troubled boy with the artist’s soul, Meghan can’t help surrendering to the man he’s become.  Praise for Against the Wall\n \n “Against the Wall is a sexy, unique love story that I devoured in one day. Jill Sorenson’s voice is so fresh, her characters shine bright. This book is a must-read for New Adult lovers.”—New York Times bestselling author Monica Murphy   “A dirty, gritty gem of a book, with a hard edge of realism and bright, hopeful heart!”—M. O’Keefe, author of Everything I Left Unsaid\n \n “Tackling serious elements such as domestic abuse and gang violence, the author never lets the compelling plot take a backseat to the sexy love story between her two imperfect yet likable characters.”—Library Journal\n \n “This intense contemporary story has solid character and emotional development.”—Publishers Weekly\n \n “The story is tough and gritty but well done and worth reading.”—Book BingePraise for Jill Sorenson   “Jill Sorenson’s sleek sensuality and fresh new voice are sure to score big with readers.”—New York Times bestselling author Cindy Gerard   “With Jill Sorenson, you are guaranteed a dangerously addictive, gut-wrenchingly fast-paced read.”—New York Times bestselling author Stephanie Tyler Includes a special message from the editor, as well as an excerpt from another Loveswept title.",
  "genres": [
    "New Adult",
    "Romance",
    "Contemporary Romance",
    "Contemporary",
    "Second Chance",
    "Suspense",
    "College"
  ],
  "author": "Jill Sorenson",
  "average_rating": "3.45",
  "url": "https://www.goodreads.com/book/show/25982510-against-the-wall"
}