{
  "title": "Meditate the Pounds Away: How I Met My Weight Loss and Wellness Goals Through Meditation",
  "description": "Through the authors' personal journey, discover her secrets to finally dropping those unwanted pounds. This must-have book moves weight loss away from the gym and into the mind, body and spirit.Her discovery? Even the most perfect diet and perfect medical test results didn't yield weight loss results without having the mind and spirit on board.Suki S. Miller had picked up pounds after two major injuries and, of course, some 'happy eating.' After the first injury, the weight was gone in a year. But at age 38 at that time, it wasn't that difficult to lose.However, some years later and after a year of 'happy eating' , followed by a devastating back injury making it difficult to engage in the same active lifestyle as before, the weight became stubborn.After eight years of blood testing, addressing nutritional deficiencies, removing environmental toxins and removing food allergens, the scale barely budged. During this time, even consuming high quality, organic, non-GMO and nutritious foods, only a few pounds disappeared. Calories weren't a question since there weren't food cravings. Even with exercise, the stubborn weight wouldn't leave.Yet, only two weeks after beginning a meditation regime, the weight began to fall off - a bit at first. And then in two more weeks, it began to fall away rapidly. During this time, there was no change in diet nor in activity levels.The secret is re-setting your mental and spiritual self-image. What you believe and what your mind's eye sees will happen. Learn how to train your mind, your heart, your soul and of course, your body to embrace the new you and to make it happen.The wonderful side effect? Joy, beauty, love and personal growth.Learn how the author developed a personalized daily meditation program. From her experiences, you too can:* Take control of your health and wellness.* Build a foundation for life-long health and wellness* Become your own healer* Develop your own meditation program* Set the stage for success with your meditation and your weight loss* Meet and develop a personal relationship with your guides* Meet the angels, archangels and spirit guides that can help you on your path* Use meditation aids that will become second nature to you* Develop your own visualizations and imagery to move that pesky fat OUT of your body* Learn various meditation techniques to train your mind, spirit and body to drop those poundsAlso included:* Learn to employ gratitude for overall happiness in your life* Tips on various medical tests that can help you eliminate toxins and find nutritional gaps* Learn how to add nutrients that are not being absorbed* Information on the hormones that control your metabolism and how hormones can improve your quality of life* Recipes for your own liposomal supplements* Fascinating reading and viewing list of books and films that can enhance your lifeYou too can experience the same success, and can feel a new joy in life, a new lift in your step, and a new connection to yourself and your own path.",
  "genres": [],
  "author": "Suki S. Miller",
  "average_rating": "4.60",
  "url": "https://www.goodreads.com/book/show/25973192-meditate-the-pounds-away"
}