{
  "title": "Against The Darkest Shadow",
  "description": "Just when you think it couldn't possibly get any darker...  Matt: I'm a manipulator, I'm a sociopath, I'm a rapist. Problem is? I don't remember any of it. Everyone in town looks at me like I'm the most disgusting man in the world, except for her. Lucky for me...she's the most beautiful girl I've ever seen in my life. Lizzie's keeping something from me though, and I need to find out what it is. Something tells me that I'll lose her, if I remember everything and become myself again. I wish there was a way I could get all of my memories back, become myself again...and be able to keep her too...  Lizzie: Almost three years have gone by. Three years since my heart was ripped out of my chest. Three years since I've seen the two men responsible for destroying me. I'm dealing with it and picking up all the broken pieces of my life as best as I can. Then, the opportunity for payback and revenge walks right through my door. Do I take it? Hell yes. Everything is going according to plan...until my own head and heart get in the way. I still need my revenge though, and I'll stop at nothing to get it. That's when I realize I made the biggest mistake of all...a mistake just like Brandon's.  Brandon: I made the biggest mistake of my life. I deserve to serve my time. I hurt and destroyed the woman I love the most in this world. Prison's the easy part. Not being able to see or talk to Lizzie...That's the worst sentence of all. Or so I thought...until she tears my heart out and serves it to me on a dark and cold platter. My road to redemption isn't an easy one...and I soon realize there are worse things in the world than Lizzie breaking my heart. It's the words: “She's missing. He took her...”    Warning: This is the final installment in the series and it is by far the darkest book in the series. Please proceed with caution! I'll take you to the happy ending my gorgeous readers...but you're going to suffer through the disturbing parts first.     * It is advised/suggested that book one, be read before book two (Always Comes To Light) and book three (Against The Darkest Shadow.) To help you understand the main character's 5 year journey.  It will also, make every single twist and turn you uncover...that much darker.  -For this book in particular- you at least have to read \"Always Comes to Light\" (book 2.)      ***Trigger Warning*** This book is not suitable for readers under 18. This book contains elements of emotional, sexual, and physical cruelty. Any readers with sensitivity to the above topics should proceed with caution, and at their own risk.",
  "genres": [
    "Romance"
  ],
  "author": "Ashley Jade",
  "average_rating": "4.19",
  "url": "https://www.goodreads.com/book/show/25975837-against-the-darkest-shadow"
}