{
  "title": "A Net of Dawn and Bones",
  "description": "Blood rituals, black magic, and broken masquerades. Names to run away from really fast. And maybe the end of the world....Welcome to Intrepid, North Carolina. Where autumn brings leaf season, tourists, and bloody sacrifice.Twenty years have passed since the Dark Day brought creatures of horror onto the evening news. Now vampires run nightclubs, alchemists deal potions on the street corners, and werewolf gangs lay claim to shady alleys. The honest cops of Intrepid enforce human laws on supernatural evil, and pray. Because the turn of the leaves brings Halloween, tourists... and the return of a serial killer who’s plagued Intrepid for over two decades. Yet the night holds darker secrets than even the best detectives have unearthed. Somewhere in Intrepid, a demonic sorcerer plans to bring Hell on earth. And the Demongate is almost complete. In the midst of a stakeout gone wrong, two mysterious wanderers drop into Detective Church’s life. Aidan, who moves like flames and holds secrets in his shadows... and Myrrh, a holy warrior born of ancient Alexandria. Enchantress. Heretic. Hell-raider. Welcome to Intrepid.Evil’s in for a hell of a night....---------This book was written because I couldn’t find anything like it on the shelves....No, seriously. After the umpteenth time picking up yet another urban fantasy that looked promising but on closer skimming had the Designated Protagonist choosing the Sexier Evil, I kind of snapped. Part of the fun of any story is putting yourself in the character’s shoes. But these shoes I not only didn’t want to slip into, I wanted to set them on fire. Where were the good guys? The honest cops? The ordinary people choosing to do the Right Thing, no matter how hard it was? Where was the belief that there is a Right Thing; that there is Good, and Evil, and you pick the side you’re going to fight for, even if the heavens fall? In short - where were the heroes?I assure you, if I were in on ground zero of a vampire versus werewolf blood war, my thoughts would not be centered on, omigod the two main supernatural guys are so darkly yummy in their hellspawn black leather. They would be, stake, silver - where are they and how fast can I reload? So here they an honest cop, a half-demon, and an ancient heretic who just might be a saint. Out to kick butt, save lives, and hopefully save souls. Welcome to Intrepid, North Carolina.I’m hoping to stay awhile.",
  "genres": [
    "Fantasy",
    "Urban Fantasy",
    "Young Adult",
    "Mythology",
    "Magic"
  ],
  "author": "C. Chancy",
  "average_rating": "4.24",
  "url": "https://www.goodreads.com/book/show/25974614-a-net-of-dawn-and-bones"
}