{
  "title": "Always for You: Jack",
  "description": "Praised by Susan Mallery as a bestselling author whose “heartfelt, touching stories never disappoint,” Alexis Morgan introduces Sergeant Joe’s three brothers living up to a legacy of courageous military service—and pursuing the women who have captured their hearts.   No one understands family loyalty like Jack McShane. He’d do anything to honor his foster father’s last wishes, even if it means putting his own plans on hold to manage Joe’s construction business. An ex–Special Forces operative, Jack thrives on the thrill of globe-hopping rescues. But now he’s needed closer to home. His foster mother has her hands full with a troubled teen, and when Jack meets the hired tutor, he discovers a woman who stirs his protective instincts—and his deepest desires.   Caitlyn Curtis knows that good looks can hide a hot temper. After an abusive marriage crushed her dreams of a happy ending, she swore off men—until one intoxicating dance in Jack’s strong arms breaks down every emotional barrier. Tough but tender, he leaves Caitlyn yearning for more of his gentle seduction. Despite the violence he’s seen, Jack is a good man. And even though passion can be dangerous, the promise of Jack’s kiss tempts her to believe that love is a risk worth taking.Praise for Always for Jack   “Engaging and charming, Always for Jack is a story of fulfillment, forgiveness, and passionate romance. The combined strength Jack and Caitlyn wield when facing anyone who threatens to break their bonds is incredible. I can’t wait for the rest of the series.”—Vonnie Davis, author of the Highlander’s Beloved and Black Eagle Ops series“[A] poignant and touching love story . . . I loved every minute, every word of it. This story really touched my heart.”—Books and Spoons Includes a special message from the editor, as well as an excerpt from another Loveswept title.",
  "genres": [
    "Romance",
    "Contemporary Romance",
    "Contemporary",
    "Military Fiction",
    "Suspense",
    "Family",
    "Chick Lit"
  ],
  "author": "Alexis Morgan",
  "average_rating": "3.88",
  "url": "https://www.goodreads.com/book/show/25982502-always-for-you"
}