{
  "title": "Jagger",
  "description": "Full of swagger and sensuality, the Caldwell Brothers series—perfect for fans of Katy Evans and Emma Chase—packs an emotional punch as the last bachelor standing fights for a woman who’s worth every ounce of trouble.   Jagger Caldwell is no one’s hero. With a reputation busting heads and breaking hearts on the underground MMA circuit, he lives for easy cash and easier women. But when he stumbles upon an all-too-familiar scene, painful memories awaken Jagger’s sensitive side and compel him to act. As a kid, he stood by helplessly as his old man beat his mom. Now, Jagger won’t let seventeen-year-old Tatiana Rand suffer the same fate. Nothing matters except saving her.   Tatiana is a prisoner in her own home, at the mercy of her violent father—until an unlikely savior bursts through her door and into her life. Six-feet-plus of tattooed muscle and raw power, Jagger is no prince charming—but Tatiana stopped believing in fairy tales long ago. Despite their differences in age and, well, everything else, the sexy bad boy sparks a fire that Tatiana never knew she had—and desires that only Jagger can quench.   Praise for Hendrix by Chelsea Camaron and MJ Fields \n \n “This book is full of laughs, a lot of love, and will leave you feeling drained, but in a good way. If you haven’t got your copy yet, I definitely recommend it! You’ll be just as anxious as I am for another Caldwell brother.”—Book Boyfriend Hangover (five stars)   “What happens when two worlds collide not once, but twice? Wow. There are so many books I want from this series.”—Reading Renee   “I loved seeing the family dynamics and bond these three brothers have.”—Twinsie Talk   “I can’t wait to dive into more of the Caldwell brothers’ stories.”—The Book Enthusiast   Includes a special message from the editor, as well as an excerpt from another Loveswept title.",
  "genres": [
    "Romance",
    "Audiobook",
    "Abuse",
    "Contemporary Romance",
    "New Adult",
    "Contemporary",
    "Fighters"
  ],
  "author": "M.J. Fields",
  "average_rating": "3.96",
  "url": "https://www.goodreads.com/book/show/25982511-jagger"
}