{
  "title": "Testimony: A Memoir",
  "description": "One of the most spellbinding, entertaining, major books of the fall: the long-awaited memoir from the Canadian music legend takes us candidly, in his own voice, into his extraordinary life and friendships with some of the greatest artists of the last half-century.     Robbie Robertson's singular contributions to popular music have made him one of the most beloved songwriters and guitarists of all time. But few could have expected that a young Canadian would pen some of the most distinctively American songs, music that seems soaked in the mythology of the Old South. With songs like The Weight, The Night They Drove Old Dixie Down, and Up on Cripple Creek, Robertson and his partners in The Band fashioned a new popular music lexicon that has endured for decades, influencing countless musicians.In this captivating memoir of The Band's storied career, Robertson weaves together his half-Jewish, half-Mohawk upbringing on the Brantford Six Nations Reserve and in Toronto; his odyssey south at sixteen and rollicking early years on the road with rockabilly legend Ronnie Hawkins; the slow formation of The Band, their trial-by-fire with Bob Dylan on his 1966 world tour, and the forging of their unique sound. He recounts being catapulted to fame with the success of their groundbreaking debut, and takes us through the astonishing run of albums that culminated in one of history's most famous farewell concerts: the movie The Last Waltz, directed by Martin Scorcese. This is the story of a time and place--the moment when rock 'n' roll became life, when electric blues legends like Muddy Waters and Otis Rush criss-crossed the circuit of clubs and roadhouses from Texas to Toronto. It's the story of exciting change as the world tumbled into the '60s, and figures like Dylan and The Band redefined music and culture, with a little help from sex and drugs. And it's the moving story of the profound friendship between five young men who together created a new kind of popular music.",
  "genres": [
    "Music",
    "Biography",
    "Nonfiction",
    "Memoir",
    "Autobiography",
    "Biography Memoir",
    "Audiobook"
  ],
  "author": "Robbie Robertson",
  "average_rating": "4.20",
  "url": "https://www.goodreads.com/book/show/25982551-testimony"
}