{
  "title": "The Singing Bone",
  "description": "A convicted killer's imminent parole forces a woman to confront the nightmarish past she's spent twenty years escaping.1979: Seventeen-year-old Alice Pearson can't wait to graduate from high school and escape the small town in upstate New York where she grew up. In the meantime, she and her three closest friends spend their time listening to Led Zeppelin, avoiding their dysfunctional families, and getting high in the nearby woods. Then they meet the enigmatic Jack Wyck, who lives in the rambling old farmhouse across the reservoir. Enticed by his quasi-mystical philosophy and the promise of a constant party, Alice and her friends join Mr. Wyck's small group of devoted followers. But once in his thrall, their heady, freewheeling idyll takes an increasingly sinister turn, and Alice finds herself crossing psychological and moral boundaries that erode her hold on reality. When Mr. Wyck's grand scheme goes wrong, culminating in a night of horrific murders, Alice's already crumbling world falls into chaos, and she barely makes her way back to normal life. Twenty years later, Alice has created a quiet life for herself as a professor of folklore, but an acclaimed filmmaker threatens to expose her secret past when he begins making a documentary about Jack Wyck's crimes and the cult-like following that he continues to attract even from his prison cell. Jack Wyck has never forgiven Alice for testifying against him, and as he plots to overturn his conviction and regain his freedom, she is forced to confront the long suppressed memories of what happened to her in the farmhouse—and her complicity in the evil around her.The Singing Bone is a spellbinding examination of guilt, innocence, and the fallibility of memory. Weaving together folklore, seventies-era anxiety about sex, drugs, and cults, and dominated by the indelibly menacing Jack Wyck, this richly imagined novel heralds the arrival of a remarkable new voice in literary mystery.",
  "genres": [
    "Fiction",
    "Mystery",
    "Thriller",
    "Cults",
    "Adult Fiction",
    "Suspense",
    "Mystery Thriller"
  ],
  "author": "Beth  Hahn",
  "average_rating": "3.73",
  "url": "https://www.goodreads.com/book/show/25986942-the-singing-bone"
}