{
  "title": "The Forged Prince",
  "description": "The only future seen clearly is a single howling wilderness, in a land both barren and dead, an unmarked grave for the dreams of Man, with all the great castles fallen. Six hundred years past, High Queen Boudicca unified the three great peoples of the south and fought the Roman Empire to a standstill, forcing Nero's retreat from the land once called Brython by some and Prydein by many. Thus was the Kingdom of Tethera founded.The victors spoke only of the will of the gods and the great heroes that had made their victory a reality, yet rumors persisted of a triumph attained only at the expense of secret bargains with the ever duplicitous Fae, and of druids meddling with forbidden enchantments .Now the last high king is dust, his line long ended by treachery and murder, while the great kingdom itself lies in ruins a century old. Immutable prophecy dictates neither will come again: \"Tethera cannot be restored until High King Pwyl's heir takes up his crown.\" To the people of the five kingdoms, \"until Pwyl's heir takes up his crown\" is just a an elaborate way of saying \"never.\" The fragmented lesser kingdoms, all that remain of what once was, are failing, unable to prosper on their own. The wilderness grows, the barbarians press, the warlords feud, the Fae grows ever bolder, and even the very waves of the sea become hostile. In the end, none of that may matter for Annwyn, that otherworld also known as the Land of the Dead, creeps forth upon the world, growing larger with each passing year while its lord gathers his forces to crush all and end everything. Nevertheless, the Lord of Annwyn has a rival in the Queen of Deceit. She readies her own final stroke with the forging of a very special weapon. It is a weapon intended to sunder prophecy itself and one which even the Lord of Annwyn may find reason to fear. Yet even a weapon forged for evil can turn in its maker's grasp and strike in an unexpected direction—most especially a weapon with a mind of its own.",
  "genres": [],
  "author": "Michael Laird",
  "average_rating": "4.14",
  "url": "https://www.goodreads.com/book/show/25990381-the-forged-prince"
}