{
  "title": "The Fugitives",
  "description": "From National Book Award finalist Christopher Sorrentino, a bracing, kaleidoscopic look at love and obsession, loyalty and betrayal, race and identity, compulsion and free will…Sandy Mulligan is in trouble. To escape his turbulent private life and the scandal that’s maimed his public reputation, he’s retreated from Brooklyn to the quiet Michigan town where he hopes to finish his long-overdue novel. There, he becomes fascinated by John Salteau, a native Ojibway storyteller who regularly appears at the local library.But Salteau is not what he appears to be—a fact suspected by Kat Danhoff, an ambitious Chicago reporter of elusive ethnic origins who arrives to investigate a theft from a nearby Indian-run casino. Salteau’s possible role in the crime could be the key to the biggest story of her stalled career. Bored, emotionally careless, and sexually reckless, Kat’s sudden appearance in town immediately attracts a restive Sandy.As the novel weaves among these characters uncovering the conflicts and contradictions between their stories, we learn that all three are fugitives of one kind or another, harboring secrets that threaten to overturn their invented lives and the stories they tell to spin them into being. In their growing involvement, each becomes a pawn in the others’ games—all of them just one mistake from losing everything.The signature Sorrentino touches that captivated readers of Trance are all sparkling dialogue, narrative urgency, mordant wit, and inventive, crystalline prose—but it is the deeply imagined interior lives of its characters that set this novel apart. Moving, funny, tense, and mysterious, The Fugitives is at once a love story, a ghost story, and a crime thriller. It is also a cautionary tale of twenty-first century American life—a meditation on the meaning of identity, on the role storytelling plays in our understanding of ourselves and each other, and on the difficulty of making genuine connections in a world that’s connected in almost every way.Exuberantly satirical, darkly enigmatic, and completely unforgettable, The Fugitives is an event that reaffirms Sorrentino’s position as an American writer of the first rank.",
  "genres": [
    "Fiction",
    "Literary Fiction",
    "Contemporary",
    "Novels",
    "Literature",
    "Mystery"
  ],
  "author": "Christopher Sorrentino",
  "average_rating": "3.00",
  "url": "https://www.goodreads.com/book/show/25987136-the-fugitives"
}