{
  "title": "Herbert West: Reanimator and Other Stories",
  "description": "The first horrible incident of our acquaintance was the greatest shock I ever experienced, and it is only with reluctance that I repeat it. As I have said, it happened when we were in the medical school1 where West had already made himself notorious through his wild theories on the nature of death and the possibility of overcoming it artificially. His views, which were widely ridiculed by the faculty and by his fellow-students, hinged on the essentially mechanistic nature of life; and concerned means for operating the organic machinery of mankind by calculated chemical action after the failure of natural processes. In his experiments with various animating solutions, he had killed and treated immense numbers of rabbits, guinea-pigs, cats, dogs, and monkeys, till he had become the prime nuisance of the college. Several times he had actually obtained signs of life in. animals supposedly dead; in many cases violent sign5; but he soon saw that the perfection of his process, if indeed possible, would necessarily involve a lifetime of research. It likewise became clear that, since the same solution never worked alike on different organic species, he would require human subjects for further and more specialised progress. It was here that he first came into conflict with the college authorities, and was debarred from future experiments by no less a dignitary than the dean of the medical school himself -- the learned and benevolent Dr. Allan Halsey, whose work in behalf of the stricken is recalled by every old resident of Arkham. I had always been exceptionally tolerant of West’s pursuits, and we frequently discussed his theories, whose ramifications and corollaries were almost infinite. Holding with Haeckel that all life is a chemical and physical process, and that the so-called \"soul\" is a myth, my friend believed that artificial reanimation of the dead can depend only on the condition of the tissues; and that unless actual decomposition has set in, a corpse fully equipped with organs may with suitable measures be set going again in the peculiar fashion known as life. That the psychic or intellectual life might be impaired by the slight deterioration of sensitive brain-cells which even a short period of death would be apt to cause, West fully realised. It had at first been his hope to find a reagent which would restore vitality before the actual advent of death, and only repeated failures on animals had shewn him that the natural and artificial life-motions were incompatible. He then sought extreme freshness in his specimens, injecting his solutions into the blood immediately after the extinction of life. It was this circumstance which made the professors so carelessly sceptical, for they felt that true death had not occurred in any case. They did not stop to view the matter closely and reasoningly. It was not long after the faculty had interdicted his work that West confided to me his resolution to get fresh human bodies in some manner, and continue in secret the experiments he could no longer perform openly. To hear him discussing ways and means was rather ghastly, for at the college we had never procured anatomical specimens ourselves. Whenever the morgue proved inadequate, two local negroes attended to this matter, and they were seldom questioned. West was then a small, slender, spectacled youth with delicate features, yellow hair, pale blue eyes, and a soft voice, and it was uncanny to hear him dwelling on the relative merits of Christchurch Cemetery and the potter’s field. We finally decided on the potter’s field, because practically every body in Christchurch was embalmed; a thing of course ruinous to West’s researches.",
  "genres": [
    "Horror",
    "Short Stories",
    "Science Fiction",
    "Fiction",
    "Fantasy"
  ],
  "author": "H.P. Lovecraft",
  "average_rating": "3.86",
  "url": "https://www.goodreads.com/book/show/2598931-herbert-west"
}