{
  "title": "a little book about believing: The Transformative Healing Power of Faith, Love, and Surrender",
  "description": "Penner Inc. is the publisher of A Little Book About Believing. Paperback copies can be ordered directly from them here.This is an insightful, fascinating and empowering book about health, healing, love, and faith that has the potential to change forever the way you view your life and your health.The Casa de Dom Inaçio in Brazil is a center of extraordinary spiritual energy, a place where the same profound force of unconditional love used by countless healing practitioners throughout history brings relief to thousands of people who visit each year. Treatment is free. Nobody is turned away. The results are beyond uncanny.'a little book about believing' chronicles 12 days in the life of journalist Cash Peters, and several others, as they travel to the Casa and experience the phenomenal abilities of world-renowned faith healer John of God. But does spiritual healing really work? Can the loving power of our connection to the Divine be harnessed to fix the human body and ensure greater longevity? These questions and many more are answered in this unique and gripping book.With a foreword by Dr. Jeffrey Rediger of Harvard Medical School, and filled with enlightening insights, Cash’s moving story takes us to a place where faith, love, and surrender become powerful tools for healing. In doing so, it plants seeds of renewed hope for those facing serious illness, while inviting the rest of us not to fear our health issues, but to embrace them as significant opportunities for learning and growth.\"Highly thought-provoking and compelling! An extraordinary book with a life-changing message!\" - Andreas Moritz, author of Timeless Secrets of Health and Rejuvenation.\"Uplifting. One of the first books I've read from cover to cover in a long time.... A great writer.\" Alan Cohen, Hay House Radio.\"If the phone rang tomorrow and I got the news we all fear – that a loved one had been diagnosed with cancer – the first thing I would do is get online and order a copy of Cash Peters’ new book. A Little Book About Believing is one of those books that can not only change a life, but might actually save a life…. A balanced, interesting and ultimately life-affirming picture of just how much healing we are capable of experiencing, if we’ll just get out of the way of the Divine Life Force that lives in all of us.\" D.K. Brainard, Edge Magazine\"This book resonated on many levels...It brought a lot of ideas together which reinforce the power of positive thinking and the importance of detox and a plant-based diet for long-term health and healing.\" Jennifer Thompson, Healthy Bliss",
  "genres": [],
  "author": "Cash Peters",
  "average_rating": "4.43",
  "url": "https://www.goodreads.com/book/show/11652066-a-little-book-about-believing"
}