{
  "title": "The Bitterbynde Trilogy: The Ill-Made Mute, The Lady of the Sorrows, and The Battle of Evernight",
  "description": "Three complete An epic fantasy of love, war, rebirth, and magical destiny, based on the haunting folklore of England, Ireland, and Scotland.In  The Ill-Made Mute , a wretched, nameless mute awakens without a memory in a lofty tower upon whose battlements winged horses and flying ships make landfall. The amnesiac longs to escape and roam the wild landscape in search of a past, a name, and a destiny. But the tales the servants whisper by the hearth all turn out to be The legendary creatures that plague the world beyond the castle walls are real and innumerable. Travelers in this beautiful, eerie wilderness must beware. . . . The Lady of the Sorrows  begins with a newly minted lady carrying important tidings to the King-Emperor of Caermelor. In her heart, she longs to encounter the king’s ranger Thorn, but upon reaching the royal court she learns that the ruler and his men have gone to war against the forces of wickedness that are threatening the realms of mortals. As the maiden awaits their return, a dreadful suspicion The brutal Lord Huon and his monstrous Wild Hunt are attacking again and again—is she the target they seek? In  The Battle of Evernight , the Lady of the Sorrows must save her loved ones from catastrophe by uncovering the secrets of her past. She journeys to the terrible fortress of the Raven Prince in Evernight, despite the Bitterbynde curse that is distorting her memories and the onset of a debilitating malady for which a cure may never be found. As a battle for the destiny of the world begins, the lady must make a fateful decision. If she reveals what she knows, she will liberate 2 worlds—or incite the downfall of everything she loves.",
  "genres": [
    "Fantasy",
    "Fiction",
    "Science Fiction Fantasy",
    "Speculative Fiction"
  ],
  "author": "Cecilia Dart-Thornton",
  "average_rating": "3.94",
  "url": "https://www.goodreads.com/book/show/25992262-the-bitterbynde-trilogy"
}