{
  "title": "Amy",
  "description": "Amy Stokes is the loyal sister of the Aces VP Diesel, and confidant to most members of the club. Her many endearing qualities make her suitable for one of the most important roles a woman can have within the club, and it was only a matter of time before she embraced the inevitable to find solace in the arms of a club member. Recon is everything her mother warned her about, strong, dominant and dangerous but the pull between them is far too strong for her to break free.During a turbulent time within the club, Amy's loyalties are tested when she's called upon to assist the Aces. Trying to prove her worth and hoping to win the heart of the man she cares so deeply for, Amy agrees but in doing so pays the ultimate price.Struggling with her emotions from her loss, Amy spirals out of control and quickly goes down a path of self-destruction, ignoring the pleas of her family and friends until Duke finally steps in and offers her a way out. Amy settles into her new role and slowly rebuilds her life as she enjoys helping the club from afar, until Doc's son James comes crashing into her life.James is everything that Recon isn't which intrigues Amy and a relationship quickly develops but James is hiding his own secrets that when revealed, bring Amy's insecurities to the forefront. Blake 'Recon' Washington has only ever loved one woman, and when those feelings aren't reciprocated, Recon deals with the issue the only way he knows how and leaves Essex for another chapter in Norfolk. But absence makes the heart grow fonder, and when Duke asks Recon to come back and assist him as the clubs Sergeant at Arms, he jumps at the opportunity of supporting his close friend and at the possibility of winning Amy's heart. Will Amy find the love that she deserves from James or will Recon stir up the feelings she's been trying to forget for so long?Note to readers: This is not your normal MC series. The Aces are an MC with alpha males but the members do not shy away from the fact that they are husbands, fathers and lovers with feelings. If you don’t like a biker who cares and respects his woman, then this isn't a book for you.I want to take the time to mention that I’m from the United Kingdom and use UK spellings.To receive the full experience of the Aces MC Series it is recommended to read the stories in the following order:Diesel – Book 1Duke - Book 2Paige and Chloe - Book 2.5 Spike - Book 3Amy - Book 3.5Locke - Book 4Jayden - Book 4.5",
  "genres": [
    "Contemporary"
  ],
  "author": "Aimee-Louise Foster",
  "average_rating": "4.21",
  "url": "https://www.goodreads.com/book/show/25996510-amy"
}