{
  "title": "The Strangest",
  "description": "Michael Seidlinger has dared tackle one of the literary classics of the 20th century literature and reimagined it for the 21st: and in Albert Camus’ anti-hero Meursault, at once apathetic and violent, unable to connect with his fellow humans, Seidlinger exhumes a perfect metaphor for the Internet Generation. Zachary Weinham, anchorless in terms of morals and committed to nothing except commenting on comments and their comments etc., finds himself involved in the sinister machinations of Rios, someone he meets in a bar, and allows himself to be set up—whether out of apathy or a desire for self-destruction it’s hard to tell. A murder ensues. Shunned by his friends and associates, not sure of what he has gotten into, Zachary heads for confrontation with society—and his own moral values.“For a line to exist, it would first have to be crossed.”\"A smart adaptation indeed of a hallowed classic, repositioning it for a grimmer world three-quarters of a century on.\" –Kirkus Reviews\"The Strangest is a stark and deliberate analysis of life in the 21st Century. Its evaluation of not just social media, but modern presence and its adaptation of what I’ll refer to here as a the new human condition, is, much like Camus’ Stranger, authoritative and convincing. Of the string of, or even genre of, contemporary works concentrated on these themes, I found Seidlinger’s The Strangest to be, thus far, the most concise and expressive.\" –The Modern Review\"[Seidlinger] takes us into the consciousness of a person so withdrawn that he must have some sort of social anxiety disorder; every bit as affectless as Camus’s Stranger, his smartphone is his only lifeline of communication with people, even when they’re right on the subway with him. I like how the author constructs the protagonist’s consciousness, with the integration of social media being elegant and measured, and I particularly like a few pivotal scenes where what is happening is carefully elided by the author—it’s very effective.\"-Conversational Reading“Step back Camus, your anti-hero has been fragmented and dispersed via the free-fall of social media. Michael J. Seidlinger’s re-visioning enters the anthropocene without apology or oxygen masks, and asks us to take the trip toward self discovery as if the self was moving particles. A kick-ass ride. A beautiful dismemberment.”–Lidia Yuknavitch, author of The Small Backs of Children“When I was in high school, I read The Stranger in French. L’Étranger. I was not an A student in French. Maybe a B. Minus. My accent was ‘formidable!’, my grammar and reading comprehension ‘médiocre’. I never looked at that book again, in any language. Now I actually have read Michael Seidlinger’s uniquely compelling The Strangest. Am I supposed to now go back read a book of a lesser superlative? This book not only lives up to its title, it does so with impeccable rhythm and a perfectly odd, discomfiting grace befitting of this tale of strangeness updated for our strange present.”–Elizabeth Crane, author of We Only Know So Much“If anyone at any time is in search of a novel that renders the dysphoria and fragmentation experienced by the first generation to live through social media, then he or she should begin with The Strangest. Like Camus, Seidlinger does not so much describe anomie as write from it; the result is a strangely resonant book that feels, above all else, honest.”–Will Chancellor, author of A Brave Man Seven Storeys Tall“The Strangest is a bold and stirring portrayal of the alienation of contemporary life, how technology amplifies our desire for approval and magnifies the horror of others’ judgment.”–Sarah Gerard, author of Binary Star“The world that Michael J. Seidlinger navigates in The Strangest is one in which the dying battery of a mobile phone provokes more emotion than a dying tree or child, told by a man whose sole value lies in the affirmation of his online persona, each comment and ‘like’ tallied one by one. Not since Seidlinger’s last book have I encountered the chilling terror of Paul Bowles and his dissonant, virtually toneless minimalism, nor the evisceration of contemporary life that Michel Houellebecq delivers, ruthless as a diamond with a broken heart. Camus himself, I think, would affirm this homage to his famous book, with a solemn nod, perhaps, and the crushing underfoot of his last cigarette. For myself, I’m as nauseated as I am lifted, as redeemed as appalled. If you want a vision of life without a soul yoked to one of ways to smash it, step into this void. The lesson is relatively short, but its benefits are sure to go on and on.”–D. Foy, author of Made to Break",
  "genres": [
    "Fiction",
    "Literature"
  ],
  "author": "Michael J. Seidlinger",
  "average_rating": "3.92",
  "url": "https://www.goodreads.com/book/show/25992479-the-strangest"
}