{
  "title": "Mãn",
  "description": "”Mamma och jag, vi liknar inte varandra. Hon är kort, och själv är jag lång. Hon är mörkhyad, och själv har jag hy som en fransk docka. Hon har ett hål i vaden, och själv har jag ett hål i hjärtat.”Mãn är en kvinnas kärleksförklaring till de kvinnor som i tur och ordning födde henne, gav henne mat och uppfostrade henne. Som nyfödd övergavs hon av en tonåring i trädgården till ett buddistiskt tempel som låg högt uppe på en flodbank vid en av Mekongflodens slingrande tentakler. En nunna tog hand om henne och livnärde henne på risvatten och bröstmjölk från en kvinna i området, innan hon lämnade henne vidare till ytterligare en kvinna – som var lärarinna på halvtid och spion på heltid.Mãn är också en berättelse om snedvriden kärlek, en kärlek som måste tystas ner och aldrig får flöda fritt; en kärlek som inte får präntas in i minnen och historier. Men på en plats långt bortom tropisk hetta, där skira snöflingor sakta singlade ner, fanns en enkel och oförställd kärlek. En vanlig kärlek född ur ett vanligt möte med en vanlig man, något som för henne var mycket ovanligt. Om Ru handlade om att lära sig att överleva, är Mãn ett utforskande av kärleken.Mãn betyder ”full av lycka” eller ”att det inte finns något mer att längta efter”, eller ”att alla önskningar har gått i uppfyllelse”.Kim Thúy lämnade Vietnam som båtflykting 1978, tio år gammal. I dag är hon bosatt i Montreal med sin make och deras två barn. Kim Thúy har arbetat som översättare, advokat och krögare. Hennes debut Ru blev en fantastisk succé i Quebec 2009 och tilldelades Kanadas finaste litteraturpris, Governor General’s Award, och det franska Grand Prix RTL-LIRE 2010. Sedan dess har Ru översatts till närmare tjugo språk och utgavs på svenska 2011 av Sekwa. Även här möttes både boken och Kim Thúy av ett entusiastiskt mottagande. Mãn är hennes tredje roman och den fick stor uppmärksamhet när den släpptes i Kanada i april 2013.",
  "genres": [
    "Fiction",
    "Canada",
    "Asia",
    "Food",
    "France",
    "Contemporary",
    "Book Club"
  ],
  "author": "Kim Thúy",
  "average_rating": "3.81",
  "url": "https://www.goodreads.com/book/show/25999106-m-n"
}