{
  "title": "Отнесени от вихъра. Том 2",
  "description": "„Pe aripile vantului“ este una dintre acele carti rare, care nu se uita niciodată. Cine a citit-o in adolescenta s-a indragostit cu siguranta de protagonisti si de culorile vii ale sudului american, apoi a vazut superbul film cu Vivian Leight si Clark Gable si s-a intors la carte sa retraiasca iar si iar iubirea imposibila dintre Scarlett O’Hara si Rhett Butler.Totul incepe 1836, in ajunul izbucnirii Razboiului Civil, care avea sa schimbe fundamental o natiune si sa le aduca aminte oamenilor ca sunt muritori. In acele vremuri tulburi si neasezate, Scarlett O’Hara, o adevarata Southern belle, o tanara rasfatata si independenta,care nu pune mare pret pe reguli si conventii sociale si care stie sa foloseasca evenimentele si oamenii in favoarea sa, invata ca viata inseamna mai mult decat baluri si stralucire. Intalnirea ei cu nonconformistul si scandalosul Rhett Butler, un soi de outcast al lumii bune, o aduce cu picioarele pe pamant si ii schimba destinul si felul de a gandi.Iar schimbarea mentalitatii unui personaj cum e Scarlett O`Hara simbolizeaza modificarea structurii sufletesti a tuturor celor hotarati sa mearga in sensul istoriei propriei tari.„Pe aripile vantului“, roman distins cu Premiul Pulitzer în 1937, s-a vandut in primul an de la aparitie in peste 2.000.000 de exemplare, iar dupa o luna de la lansare, producatorul David Selznick a cumparat drepturile de ecranizare, platind o suma fabuloasa pentru acel timp: 50.000 de dolari. Pe 26 ianuarie 1939 incepeau filmarile la ecranizarea cartii, care avea sa fie capodopera cinematografiei americane. Filmarile s-au incheiat pe 27 iunie 1939, iar premiera a avut loc in Atlanta, pe 15 decembrie 1939. Au urmat nu mai putin de 11 premii Oscar, milioane de spectatori in intreaga lume si clasarea peliculei pe locul 4 in topul celor mai bune 100 de filme, realizat de Institutul American de Cinematografie.",
  "genres": [
    "Classics",
    "Romance",
    "Fiction",
    "Historical Fiction",
    "Novels",
    "American",
    "Historical"
  ],
  "author": "Margaret Mitchell",
  "average_rating": "4.62",
  "url": "https://www.goodreads.com/book/show/25998712-2"
}