{
  "title": "Nightmares Unhinged: Twenty Tales of Terror",
  "description": "Nightmares come in many forms. Some rend the veil of sleep with heart-stopping madness. Others defy sanity to leave a helpless corner of your mind twitching for release. Sometimes, hours after waking, a nightmare drifts across your memory, tainting your day with wisps of discomfort. NIGHTMARES UNHINGED reveals horror in all its mutable forms—abject to absurd—through twenty tales of terror.Contributors include Mario Acevedo, Edward Bryant, Dustin Carpenter, Sean Eads, Keith Ferrell, Warren Hammond, Jason Heller, Gary Jonas, Stephen Graham Jones, J.V. Kyle, Aaron Michael Ritchey, Jeanne C. Stein, Steve Rasnic Tem, and Dean Wyant. Foreword by New York Times bestseller Steve Alten. Edited by Joshua Viola. Illustrations by Aaron Lovett.A portion of the book's proceeds will be donated to Rocky Mountain Cancer Assistance in honor of Melanie Tem.Contents:Foreword “Terrors in the Night” by Steve AltenIntroduction “Reclaim Your Fears” by Joshua Viola“The Brollachan” by Steve Rasnic Tem“Fangs” by J.V. Kyle“Be Seated” by Keith Ferrell“The Man Who Killed Texas” by Stephen Graham Jones “Scarecrows” by Joshua Viola “Zou Gou” by Mario Acevedo “Needles” by Joshua Viola and Dean Wyant “The Projectionist” by Jason Heller “The Wolf’s Paw” by Jeanne C. Stein “Danniker’s Coffin” by Keith Ferrell “Deep Woods” by Aaron Michael Ritchey “Diamond Widow” by Dustin Carpenter “The Camera” by Joshua Viola “Lost Balls” by Sean Eads “Bathroom Break” by J.V. Kyle “Marginal Ha’nts” by Edward Bryant “Delicioso” by Warren Hammond “The Librarian” by Joshua Viola “Gurgle. Gurgle.” by Mario Acevedo “Taking the Dare” by Gary Jonas Afterword “Melanie Tem: Hubble’s Child” by Edward Bryant",
  "genres": [
    "Horror",
    "Short Stories",
    "Fiction",
    "Anthologies",
    "Horror Thriller",
    "Amazon"
  ],
  "author": "Joshua Viola",
  "average_rating": "3.63",
  "url": "https://www.goodreads.com/book/show/25991965-nightmares-unhinged"
}