{
  "title": "Boundaries with Teens: When to Say Yes, How to Say No",
  "description": "Helping Your Teen Be Responsible and Responsive The teen years can be challenging and even scary for parents and those involved with youth. Attitudes and behaviors of the adolescent can be unhealthy for him and for the family. However, good boundaries are the bedrock of not only better relationships, but also maturity, safety, and growth---especially for teens and their parents. In order to help teenagers grow into healthy adults, parents and youth workers need to help them experience how to take responsibility for their behavior, their values, and their lives. Dr. John Townsend, coauthor of the Gold Medallion Award-winning book Boundaries, is a parent of two teenagers himself. With wisdom and empathy, he applies his biblically based principles to bear on the challenging task of the teen years, showing * How to deal with disrespectful attitudes and irresponsible behaviors in your teen * How to set healthy limits and realistic consequences * How to be loving and caring while establishing rules * How to determine specific strategies to deal with problems both big and small The book begins by giving parents a way to look at adolescence itself, so they can better understand how a teen thinks, feels, and relates to others. Then it provides the nuts and bolts of what boundaries are all about and how to apply them. There are many topically based chapters devoted to specific problems, from moodiness to school problems to aggression. Finally, Townsend addresses the attitudes, conflicts, and difficulties of parents themselves, helping them resolve their own personal obstacles to being an effective maturing force for the teen. Also available on unabridged audio CD, read by the author.",
  "genres": [
    "Parenting",
    "Nonfiction",
    "Christian",
    "Self Help",
    "Family",
    "Psychology",
    "Christian Living"
  ],
  "author": "John  Townsend",
  "average_rating": "4.19",
  "url": "https://www.goodreads.com/book/show/259950.Boundaries_with_Teens"
}