{
  "title": "Intimate Danger",
  "description": "All The Secrets InsideClancy McRae is mad as hell. Charged with creating technology-enhanced troops, she s discovered her top-secret nano-device has been surgically implanted in four U.S. Marines without her approval. Though it makes them smarter, faster, and stronger than any human on earth, in this untested stage it can also drive them insane -- or kill them. Now she s stolen classified data, risking her career -- and her life -- to go after them. While recovering from a shoulder wound, Spec Ops leader Mike Gannon learns the rest of his team was dropped into the jungles of Peru to locate a chilling new weapon. Then: nothing, nada. Injured or dead, it s his duty to bring them home and destroy the threat. But when a scrappy red-haired beauty butts into his rescue mission, insisting the government turned his men into lab rats, Mike doesn t believe her -- till she becomes a moving target. Keeping Clancy with him keeps her safe, yet as the tropical temperatures rise with their passion, Mike and Clancy are ensnared in a labyrinth of ingenious deceptions concealing a peril no one suspects -- and only they can stop. In the dark forgotten Andes, they unearth a deadly plan and an ancient menace that turns a rescue into the crucial fight for their very survival.\nAnd the clock is ticking...\n\nThe daughter, wife, and now mother of career U.S. Marines, Amy J. Fetzer has penned over thirty five novels and novellas in historical, historical paranormal, contemporary, and romantic suspense. Amy s work has been nominated twice for Storyteller of the Year in historical and contemporary, and is the winner of the Romantic Times Career Achievement award in romantic adventure, and hit the top spots of the Waldenbooks bestseller lists, as well as winning several genre awards. After twenty-five years of traveling with the Marine Corps, Amy and her family live in South Carolina, enjoying the quiet, retired life and trying to behave like civilians.",
  "genres": [
    "Romantic Suspense",
    "Romance",
    "Suspense",
    "Contemporary",
    "Military Fiction",
    "Contemporary Romance",
    "Action"
  ],
  "author": "Amy J. Fetzer",
  "average_rating": "3.91",
  "url": "https://www.goodreads.com/book/show/259952.Intimate_Danger"
}