{
  "title": "Helena's Choice",
  "description": "It is the summer of 1837 when Helena Cadfield graduates from the Parisian boarding school and returns to Cadfield House, in Oxford, England. There, she receives the unfortunate news that her father passed away in Greece while excavating treasures on her late mother's property. Without funds, she cannot travel to Greece to take care of the property, and thus is employed as a governess with the Stirling family in hopes of traveling to Greece. Her plan comes to fruition when Mr. Stirling procures a permanent position with the Greek government, and the family and Helena travel to Greece. She glimpses the ravages of the revolution, through the poverty of the people and the demolished buildings, but is whisked away to the Stirling house in Athens, where she spends her time as a governess to Miss Stirling. The juxtaposition of the two worlds, England and Greece, is evident here.  Meanwhile, the Archaeological Society of Athens has taken over Helena's property in the city of Nemea, with hopes of uncovering more treasures like the two thousand year-old gold cup that Dr. Cadfield had discovered and donated to them. They are unaware that Dr. Cadfield had a daughter. Dr. Aristotle Mastoras, who studied in Germany, has been hired to lead the project. He had left Greece as a child during the revolutionary war with his grandfather, and settled in Germany. Keen on returning to Greece, Aristotle accepts the offer from the Archaeological Society to lead this project, and agrees to the condition that he provide the funds because the society has no funds. He hires 40 Albanians and hopes that the treasures they find on the property will offset the costs.  Helena is unaware of the Archaeological Society's interference with her family property. She officially meets Dr. Aristotle Mastoras at a court ball, where she is watching over her charge, Miss Stirling. Dr. Mastoras remembers Helena from a previous encounter, and when they dance the waltz, they develop feelings for each other. However, Dr. Mastoras is stunned to learn from Mr. Stirling that Helena is the daughter of Dr. Cadfield.  Afterwards, they meet and he convinces her to join him on the journey to the property, but she does not give her answer until the next morning. He is glad to see her waiting for him, and they embark on the journey together. Their relationship blossoms. Helena also meets her uncouth \"bandit\" cousins who live nearby and are saddled with knives and guns that they readily use, except when they are around her.  Together, Helena and Aristotle succeed in finding the treasures. Helena develops good relations with her three \"bandit\" cousins who end up guarding the place, but the evil forces rear their ugly heads, and the treasures are stolen. Another fly in the ointment, Greta Heinz, has traveled all the way from Germany with her brother to see Aristotle, and demands from him a proposal of marriage just when he is about to go search for the stolen treasures with the \"bandit\" cousins.  In Helena's darkest moment, she tensely observes Aristotle with Greta, who is clinging to him, and believes that they are lovers. Helena is torn between her love for Aristotle and the possibility that he will marry Greta. Aristotle leaves to go after the thieves, and Helena is left alone, believing that she has lost the love of her life. Will they get back together again, and will Aristotle find the lost treasures?",
  "genres": [],
  "author": "Patty Apostolides",
  "average_rating": "4.03",
  "url": "https://www.goodreads.com/book/show/26001765-helena-s-choice"
}