{
  "title": "Dancing in the Duke's Arms",
  "description": "Why Do Dukes Fall in Love? Every summer the cream of society gathers at the Dukeries, named for the ducal estates concentrated in one small corner of Nottinghamshire. While the entertainments include parties, balls, and a famous boat race, the ducal hosts and their guests find heartbreak, love and happy endings. Four heartwarming stories from four bestselling historical romance authors.  MAY I HAVE THIS DUKE? by Grace Burrowes The trouble with Houseparties. . . Gerard Hammersley, Duke of Hardcastle, is dragooned by an old friend into attending a house party, though Hardcastle refuses to fall prey to the matchmakers who relish such gatherings. He recruits his nephew’s prim, prickly governess, Miss Ellen MacHugh, to preserve him from being compromised by the conniving debutantes, and offers in exchange to deflect the drunken viscounts who plague Ellen.  . . . Is that they must end. Ellen agrees to Hardcastle’s scheme for two reasons. First, she’s been attracted to His Grace since the day she laid eyes on him, and knows that behind Hardcastle’s lack of charm lies a ferociously loyal and faithful heart. Second, she’s departing from Hardcastle’s household at the conclusion of the house party, and two weeks safeguarding His Grace’s bachelorhood is as much pleasure—and as much torment—as she can endure before she leaves him.  DUCHESS OF SCANDAL by Miranda Neville Too Many Scandals After months of marriage, the Duke of Linton agreed to live apart from his wife. Thrown together due to a scheduling error, Linton finds Althea still has the power to make his heart race. Linton seems different from the critical, indifferent man Althea married. But though she burns for him as a lover, can she trust him to be the husband she needs?  WAITING FOR A DUKE LIKE YOU by Shana Galen There’s no such thing as the perfect hero… Nathan Cauley, tenth Duke of Wyndover, is so handsome ladies swoon—literally swoon. His blond hair and blue eyes certainly draw attention at the Duke of Sedgemere’s house party, but Nathan doesn’t want a fawning young miss for his duchess. He stumbles upon a bedraggled woman sleeping under Sedgemere’s bridge, and his protective instincts stir. When he recognizes her as the princess he fell in love with eight years before, he’s determined to win not only her affections but her heart.  Or is there? After revolutionaries massacre Princess Vivienne’s family, she and the head of her guard flee to England. Before they can reach London to beg asylum, assassins kill the last of her defenders. Vivienne is alone and on the run when the Duke of Wyndover comes to her rescue. She barely remembers meeting him years before, and isn’t comfortable with gentlemen who are more attractive than she is. Nathan is more than a pretty face, though, and when the assassins return, he might just prove to be the duke Vivienne has been waiting for.  AN UNSUITABLE DUCHESS by Carolyn Jewel The Duke of Stoke Teversault has well earned his reputation for bloodless calculation. Indeed, recently widowed Georgina Lark has no idea he’s loved her since before her late husband swept her off her feet. Stoke Teversault means to keep it that way. The cold and forbidding duke and the blithe and open Georgina could not be less suited in any capacity. And yet, when Georgina and her sister arrive at his home, his ice-bound heart may melt away.  Georgina Lark has never thought of thought of the Duke of Stoke Teversault as a man capable of inducing passion in anyone. He’s long disapproved of her, but she will be forever grateful to him for his assistance after her husband died.",
  "genres": [
    "Historical Romance",
    "Romance",
    "Anthologies",
    "Historical",
    "Novella",
    "Historical Fiction",
    "Regency"
  ],
  "author": "Grace Burrowes",
  "average_rating": "3.99",
  "url": "https://www.goodreads.com/book/show/26011222-dancing-in-the-duke-s-arms"
}