{
  "title": "Pak Harto: The Untold Stories",
  "description": "\"Piye to kok ora bisa ditulung (bagaimana sih kok tidak bisa ditolong)?\" adalah pertanyaan Pak Harto ketika ia merasa limbung menghadapi kenyataan baru saja kehilangan belahan jiwanya, Ibu Tien Soeharto-istri tercinta yang puluhan tahun menemaninya mengarungi suka dan duka, istri yang selalu mengobarkan semangatnya, menuangkan kasih sayang, serta menguatkan hati.Setetes air mata Pak Harto menandai kehilangan besar yang harus diikhlaskannya hari itu, disaksikan Profesor Dr. Satyanegara yang selanjutnya menjadi lebih sering menjaga kesehatan Pak Harto. Demikian pula perjalanan hidup Pak Harto sejak muda yang terekam dengan baik dalam ingatan keluarga besar, sesama kepala negara, para menteri, ajudan, serta orang-orang yang bekerja bersamanya, menjelaskan sisi-sisi lain karakter Pak Harto yang sangat jarang dipublikasikan, yang selama ini tersimpan sebagai the untold stories seorang Pak Harto.Masih dalam kenangan mesra Pak Harto bersama Ibu Tien, Brigjen TNI (Purn) Eddie Nalapraya, yang berpangkat kapten ketika menjadi pengawal pribadi Pak Harto di tahun-tahun awal menjabat Presiden RI, pernah mendapat pesan jenaka dari Ibu Tien. Ibu Negara itu mengetuk-ngetuk jendela mobil sesaat sebelum Eddie berangkat mengawal Pak Harto memancing ke laut lepas, \"Jangan memancing ikan yang berambut panjang ya....\" Pesan canda buat sang pengawal itu membuat Pak Harto tersenyum mendengarnya.Sementara Profesor Dr. Emil Salim, Menteri Lingkungan Hidup pada masa pemerintahan Pak Harto, menuturkan kisah yang mengharukan ketika sepasukan tentara disiapkan untuk menembaki serombongan gajah yang dilaporkan memorakporandakan kebun-kebun warga desa transmigrasi di Lampung. Rupanya hewan-hewan besar itu keluar dari hutan karena setiap enam bulan sekali mereka perlu berendam di laut untuk mendapatkan garam.\"Mendengar rencana itu, Pak Harto segera memerintahkan agar para tentara tidak menembaki kelompok gajah pada saat mereka pulang nanti, melainkan menggiringnya melalui jalan yang berbeda, dengan menggunakan peralatan yang bisa menghasilkan bunyi-bunyian seperti genderang dan terompet. Maka pada perjalanan kembali ke habitatnya di atas bukit, gajah-gajah itu tidak lagi menghancurkan kebun dan rumah di desa transmigrasi,\" cerita Pak Emil.Ide sederhana Pak Harto ini berakhir tidak sederhana. \"Setelah berhari-hari mengawal kawanan gajah pulang ke hutan tempat tinggalnya di atas bukit, beberapa tentara meneteskan air mata haru karena dapat merasakan terbitnya kasih sayang di hati mereka terhadap hewan-hewan itu. Presiden Soeharto lantas mengundang semua tentara yang bertugas dari yang berpangkat terendah ke rumahnya di Jalan Cendana. Dengan riang Pak Harto menyalami mereka satu per satu sebagai tanda terima kasih,\" cerita Pak Emil.Buku ini memang sarat bermuatan kisah-kisah human interest sebagai bagian dari keseharian Pak Harto sejak muda hingga akhir hayatnya. Kisah tentang seekor burung beo di halaman belakang yang akhirnya menjadi salah bicara setelah Pak Harto berhenti dari jabatan presiden, isyarat dari alam semesta mengenai akan terjadinya suatu peristiwa duka terhadap diri Pak Harto melalui burung-burung camar yang merontokkan bulu-bulunya memenuhi geladak kapal pada saat Pak Harto sedang bermalam di tengah laut, bahkan kisah tentang rumor yang tidak bertanggung jawab di seputar wafatnya Ibu Tien Soeharto, semua terpapar gamblang apa adanya di dalam buku ini melalui penuturan 113 narasumber yang mengalami dari dekat berbagai peristiwa suka duka di sepanjang hidup Pak Harto.",
  "genres": [
    "Biography",
    "Nonfiction",
    "History",
    "True Story"
  ],
  "author": "Donna Sita Indria",
  "average_rating": "4.07",
  "url": "https://www.goodreads.com/book/show/11655171-pak-harto"
}