{
  "title": "Crowdsourcing: Why the Power of the Crowd Is Driving the Future of Business",
  "description": "“The amount of knowledge and talent dispersed among the human race has always outstripped our capacity to harness it. Crowdsourcing ­corrects that—but in doing so, it also unleashes the forces of creative destruction.”—From CrowdsourcingFirst identified by journalist Jeff Howe in a June 2006 Wired article, “crowdsourcing” describes the process by which the power of the many can be leveraged to accomplish feats that were once the province of the specialized few. Howe reveals that the crowd is more than wise—it’s talented, creative, and stunningly productive. Crowdsourcing activates the transformative power of today’s technology, liberating the latent potential within us all. It’s a perfect meritocracy, where age, gender, race, education, and job history no longer matter; the quality of work is all that counts; and every field is open to people of every imaginable background. If you can perform the service, design the product, or solve the problem, you’ve got the job.But crowdsourcing has also triggered a dramatic shift in the way work is organized, talent is employed, research is conducted, and products are made and marketed. As the crowd comes to supplant traditional forms of labor, pain and disruption are inevitable.Jeff Howe delves into both the positive and negative consequences of this intriguing phenomenon. Through extensive reporting from the front lines of this revolution, he employs a brilliant array of stories to look at the economic, cultural, business, and political implications of crowdsourcing. How were a bunch of part-time dabblers in finance able to help an investment company consistently beat the market? Why does Procter & Gamble repeatedly call on enthusiastic amateurs to solve scientific and technical challenges? How can companies as diverse as iStockphoto and Threadless employ just a handful of people, yet generate millions of dollars in revenue every year? The answers lie within these pages.The blueprint for crowdsourcing originated from a handful of computer programmers who showed that a community of like-minded peers could create better products than a corporate behemoth like Microsoft. Jeff Howe tracks the amazing migration of this new model of production, showing the potential of the Internet to create human networks that can divvy up and make quick work of otherwise overwhelming tasks. One of the most intriguing ideas of Crowdsourcing is that the knowledge to solve intractable problems—a cure for cancer, for instance—may already exist within the warp and weave of this infinite and, as yet, largely untapped resource. But first, Howe proposes, we need to banish preconceived notions of how such problems are solved.The very concept of crowdsourcing stands at odds with centuries of practice. Yet, for the digital natives soon to enter the workforce, the technologies and principles behind crowdsourcing are perfectly intuitive. This generation collaborates, shares, remixes, and creates with a fluency and ease the rest of us can hardly understand. Crowdsourcing , just now starting to emerge, will in a short time simply be the way things are done.",
  "genres": [
    "Business",
    "Nonfiction",
    "Technology",
    "Sociology",
    "Internet",
    "Entrepreneurship",
    "Economics"
  ],
  "author": "Jeff   Howe",
  "average_rating": "3.84",
  "url": "https://www.goodreads.com/book/show/2601510-crowdsourcing"
}