{
  "title": "Hearing Jesus",
  "description": "Hearing things, that’s what she thinks is happening. Not her deceased husband, of course. But someone else is there. Why isn’t she frightened at the prospect? Is she really that lonely?Gladys Hight lives in a cozy little house in southeastern Wisconsin. Occasionally, her visiting family has heard her speaking with Harry, her husband, who died four years ago. Her daughter, Patty, the type-A opposite of Gladys, obviously worries about her mother’s sanity. At seventy-eight, even Gladys has her doubts.When she assumes she’s alone in the house one Sunday, a stranger suddenly appears and begins talking to her as if he has known her forever. Despite discovering an unexpected man in her house, Gladys is not frightened, though she does wonder anew if she’s losing her marbles.Complicating her self-doubt is the fact that the man smiling at her in her hallway looks just as she imagines Jesus would look. But she discovers that no one else can see him or hear him as she can.In the days and weeks that follow, Gladys’s visitor convinces her he is real, and he is Jesus. More than that, he shows her how much he loves her, as he squires her through her formerly lonely days and accompanies her in facing disappointments and disasters from her past. Not only does Gladys receive emotional healing, she also serves as Jesus’s messenger for people around her, both family and strangers. Though she had never wished for such a rare experience, nor even imagined such a thing possible, nothing in all her life impacts Gladys more profoundly than actually seeing and hearing Jesus.The second book in the Seeing Jesus series, Hearing Jesus explores the boundaries of belief and imagination, while revealing the limitless grace and love of Jesus.",
  "genres": [
    "Christian",
    "Christian Fiction",
    "Fiction",
    "Inspirational",
    "Faith"
  ],
  "author": "Jeffrey McClain Jones",
  "average_rating": "4.65",
  "url": "https://www.goodreads.com/book/show/26017068-hearing-jesus"
}