{
  "title": "Reluctant Genius: The Passionate Life and Inventive Mind of Alexander Graham Bell",
  "description": "Award-winning author Charlotte Gray's latest biography, Reluctant Genius: The Passionate Life and Inventive Mind of Alexander Graham Bell offers an eye-opening account of the famously white-bearded inventor of the telephone. Who knew that he also was a pivotal figure in the development of the airplane, the hydrofoil, genetic engineering, and more? Charlotte Gray does, and she tells us how and why she brought to life the passionate mind and heart of the man behind so many amazing ideas and innovations. --Lauren Nemroff \nSome Questions for Charlotte Gray\n[image] 1. Most people picture Alexander Graham Bell as that grandfatherly looking man with a long white beard who invented the telephone. What's wrong with that image? The image of Alexander Graham Bell as a kindly Santa Claus figure is the one we all know: It is as familiar as the one of Einstein with his hair in a frizzy grey mass. But when Alexander Graham Bell was struggling to invent the telephone, he was a skinny, clean-shaven, neurotically intense young man and a hypochondriac, with obsessive work habits and a very volatile nature. Reading his letters and journals, I was shocked to discover how often he would ricochet between euphoria and depression. Invention was Alexander Graham Bell's passion, but I frequently wondered whether, if he had not had an early success and the right wife, his difficult personality would have prevented him achieving anything. I think it is important to revise the grandfatherly stereotype of Bell in order to show that invention is difficult, and inventors are not easy, placid people to live with. 2. In what way does Bell's genius different from other inventors of his age, such as Thomas Edison or the Wright brothers? The wonderful thing about the inventions of such nineteenth century giants as Bell, Edison and the Wright brothers is that, with a little bit of effort, even those of us who never did Grade 12 physics can actually understand how their inventions worked. One could never say that about today's microelectronic technology. Intuition and imagination were all crucial for the breakthroughs made by Edison, the Wright brothers and Bell. However, what sets Bell apart from Edison and the Wright brothers was that he didn't have an entrepreneurial bone in his body. He was more like a holdover from the eighteenth century Enlightenment, while the others were go-getting twentieth-century hustlers. Edison was always looking for financial backers; he announced his breakthroughs before he had even built working prototypes; he was one of the first inventors to put together a real R and D team at a purpose-built laboratory, at Menlo Park. He understood that invention is, in his own words, \"One percent inspiration, ninety percent perspiration.\" Similarly the Wright Brothers were eager to make money out of their flying machines. They refused to share their technological breakthroughs, guarded their patents fiercely, and wouldn't give any demonstrations to the public of their biplanes. Bell was the opposite--totally absorbed in extending the frontiers of knowledge, and completely careless about commercial exploitation of his ideas. 3. Is it true that \"necessity is the mother of invention\" or is it something else? Invention has many mothers - the right materials, a widespread understanding that this will improve the world in some way, the right individual to pursue the elusive dream. In the case of the telephone, one can argue that there was no overwhelming necessity for a new form of communication: the telegraph had been working well for 30 years, and only a few people realized that a device that could carry the human voice, rather than the Morse code, would pull people together in a revolutionary way. As soon as telephones appeared in the market, their advantages were obvious. But there was still incredible resistance. In Britain, the upper classes were slow to acquire telephones because they posed a class issue: who should answer them? Everybody knew that, in a house with servants, the servant answered the door when the telegraph boy rang the bell. But should master or servant speak on the phone?  The democratic nature of the telephone--anybody could use it, not just qualified operators--also shackled its spread. In Russia after the revolution, Stalin is said to have vetoed the idea of a modern telephone system. \"It will unmake our work,\" the dictator decreed. \"No greater instrument for counter-revolution and conspiracy can be imagined.\" So did necessity drive the invention of the telephone? No--when Bell first started speculating on its impact, people thought he was mad. But it quickly became a total necessityimagine life without electronic communication today! 4. It was amazing to learn that Bell's mother and his wife were both deaf, and that from an early age he was immersed in research on the nature of sound and oral communication. How important were these personal relationships in shaping his outlook and inventions?  One of my greatest surprises when I started research for Reluctant Genius was the discovery that Bell's first ambition was to be a teacher of the deaf, and that he remained committed to the cause of improved education for the hearing impaired throughout his life. I had no idea of this side of him, or of his long relationship with Helen Keller. The fact that the two most important women in his life, his mother and his wife, were deaf was of crucial importance both to his own work, and to his attitude to others. His respect for their intelligences and personalities meant that, unlike many of his contemporaries, he never assumed that deafness was linked to intellectual disability. Moreover, his scientific interest in their condition informed his telephone research. Because he knew why their ears didn't work, he understood how sound should reach the brain in a hearing person's ear, through the ear drum. None of his competitors made that intuitive leap. Their early attempts to build working telephones were foiled because they didn't include the diaphragm that mimicked the action of the ear drum, and which was the key feature of Bell's first phone. Lastly, Bell was also fascinated by the intergenerational transmission of deafness. This led to his research on genetics in general - and the program he initiated at his summer home, in Cape Breton, to breed a flock of \"super sheep\" that would always have twin births. 5. Bell's wife, Mabel Hubbard Bell, was a remarkable person in her own right. Why was it so important to tell her story? Too often, biographies of \"Great Men\" suggest they achieved everything by their own efforts. A few did, of course, but most depended on the support and encouragement of others--parents, partners, associates--to provide the right environment in which they could achieve their goals. Behind every great man.This was the case with Alexander Graham Bell. He would always have had his \"Eureka Moment\", in the summer of 1874, when he realized how a \"talking telegraph\" might work. But without Mabel, we probably would never have heard of him. He would not have patented the invention or found the business partners who helped him moved his invention from the laboratory to the market place. Mabel's father, Gardiner Hubbard, was his patent lawyer: Mabel herself ensured that he went to the Philadelphia Exposition, in 1876, to demonstrate his new apparatus. In later years, Mabel provided all kinds of other practical help, in ensuring that her exasperating husband could focus on his inventions. She handled the financial side of their marriage: she found qualified young men who could help him work on his flying machines: she was always cheering him up and stroking his ego when he got depressed. And she created, along with their two daughters, a warm family environment which gave balance to Bell's life - and which so many of his contemporaries, including Thomas Edison, never enjoyed. I was determined to give Mabel her due in the story of Bell. I found her such an attractive and intriguing figure. She was stone deaf, ten years younger than her husband, and their relationship began as a teacher-student one. It would be easy to assume that this brilliant, world famous man would be the dominant figure in the relationship. In fact, the reverse is true. 6. What do you think Bell would think of cell phones, the internet and other wireless means of communication? Bell himself anticipated \"electric communication\": he was very frustrated by how long it took for a letter from Nova Scotia to reach Europe. I'm sure he would be delighted by the internet. However, he would be appalled by the constant buzz of other technological advances, and the way we've allowed them to trump all other forms of human intercourse. This is a man who wouldn't have a telephone in his own study, because its ring would disturb his train of thought. He was a gracious, well-mannered man who would have been horrified by the way many of us let our cell phones to interrupt our face-to-face conversations. And if somebody pulled out a Blackberry and started punching into it while Bell was speaking of him--well, Alec would have muttered, \"Shee-e-esh\" (the nearest he ever got to swearing) and stomped out of the room. 7. What was the most exciting research discovery that you made? As a biographer, I have to say that my most exciting discovery was the wealth of material I had to work with. Because Alexander Graham Bell could never speak to his wife on the telephone, he and Mabel exchanged long, intimate, colourful letters whenever they were apart--and that was often. I was thrilled to discover, at the Alexander Graham Bell Historic Site in Baddeck, Nova Scotia, 180 three-ring binders of family correspondence (another set is housed at the Library of Congress, Washington.) These letters let me explore the inner-workings of the mind of a genius, and of a remarkable marriage, in a way that I had hardly dared hope for. I was also amazed at the range of Bell's activities. The telephone, the photophone (which sent sounds down beams of light), an early iron lung, a desalination process for salt water, flying machines, hydrofoils, genetic experimentshis scientific interests were enormously varied. And at the same time, he was doing so much else, for example with the Smithsonian Institute, and the National Geographic Society. And throughout his career, there was his long-running commitment to deaf education. It was hard not to be overwhelmed! 8. What are you working on right now? Yes, I'm already launched on my next biography. (In fact, I find it very hard not to start my next book before the previous one is even in the stores--I have a psychological need to live both my own life and someone else's!) My next project is a short biography of Nellie McClung, the Canadian author and political activist.",
  "genres": [
    "Biography",
    "Nonfiction",
    "History",
    "Science",
    "Biography Memoir",
    "Canada",
    "Technology"
  ],
  "author": "Charlotte Gray",
  "average_rating": "4.32",
  "url": "https://www.goodreads.com/book/show/1165655.Reluctant_Genius"
}