{
  "title": "The Daddy's Girl Series",
  "description": "The first three books of Normandie Alleman’s best-selling Daddy’s Girl series are now available in one volume. The Daddy’s Girl Collection includes: Daddy Morebucks From the moment she laid eyes upon him, Marley knew in her heart that James was not just another client, and the difference wasn’t even the large sum of money he offered in return for a single night of submission. No, what set him apart was the fact that when she called James “daddy”, it was her own heart which beat faster and her own body which ached with need. After that night, Marley does her best to put all thought of him behind her, using the huge payday he provided to get on her feet again and start over… until James knocks on her door and walks right back into her life. He makes her a simple offer: if she will live with him and submit to him whenever he wishes, he will provide for her every desire. Even before she accepts his offer, Marley knows that what she truly wants is not money or clothing or even a fancy new car. What she longs for is a daddy who will give his little girl what she really needs… a daddy who will spank her bare bottom when she is naughty, tie her up and take her any way he pleases, and then cuddle her until she falls asleep in his arms. Can she dare to hope that James will be that daddy? Daddy’s Game Sparks fly when up-and-coming artist Carmen Harris meets football star Natron Dakers at her first gallery opening. Carmen soon discovers that Natron is the type of man who sees what he wants and goes after it… and apparently what he wants is her. Almost before she knows it Carmen finds herself taking everything Natron gives her and begging for more, and when he reveals that he wants to be her dominant daddy and her to be his submissive little girl, she doesn’t hesitate to agree. At the top of his profession, Natron has money, fame, and all the perks that go with them, and now at last in Carmen he has found a woman he wants to share it with. His life feels complete… until in a split second everything comes crashing down when a devastating injury threatens to end his season—and maybe his career. Natron fears he will lose it all, but will he self-destruct or can he dig deep and fight hard for himself, his teammates, and his little girl? Poor Little Daddy’s Girl Twenty-four-year-old Charmaine Bainbridge appears to have it all—beauty, fame, and tremendous wealth—yet behind all the glitz and glamour hides a sad little girl who has been abandoned by every man she’s ever loved. When firefighter Hunter Baldwin saves Charmaine from a fire in her penthouse apartment—a blaze started by her own carelessness—he’s appalled by her nonchalant attitude. Forced to carry her to safety, he throws her over his shoulder, but not before correcting her behavior with a well-deserved spanking. Something about Charmaine arouses him deeply, and it isn’t just her gorgeous looks. This girl needs to be firmly corrected and thoroughly dominated, and a part of Hunter demands that he be the one to take her in hand. Though he’s used to charging into burning buildings on a daily basis, Hunter knows taming Charmaine’s wild ways may prove to be his greatest challenge yet. Undeterred, he takes on the role of Charmaine’s daddy dom in hopes of breaking down her defenses and healing her wounds. But can she bring herself to open her heart to him, or will she remain the lonely little rich girl forever?",
  "genres": [
    "BDSM",
    "Romance",
    "Erotic Romance"
  ],
  "author": "Normandie Alleman",
  "average_rating": "4.07",
  "url": "https://www.goodreads.com/book/show/26017461-the-daddy-s-girl-series"
}