{
  "title": "Moyers on Democracy",
  "description": "Bill Moyers on America “Here in the first decade of the twenty-first century the story that becomes America’s dominant narrative will shape our collective imagination and our politics for a long time to come. In the searching of our souls demanded by this challenge . . . kindred spirits across the nation must confront the most fundamental liberal failure of the current the failure to embrace a moral vision of America based on the transcendent faith that human beings are more than the sum of their material appetites, our country is more than an economic machine, and freedom is not license but responsibility—the gift we have received and the legacy we must bequeath.“Although our sojourn in life is brief, we are on a great journey. For those who came before us and for those who follow, our moral, political, and religious duty to make sure that this nation, which was conceived in liberty and dedicated to the proposition that all are equal under the law, is in good hands on our watch.”—from “For America’s Sake”People know Bill Moyers mostly from his many years of path-breaking journalism on television. But he is also one of America’s most sought-after public speakers. His appearances draw sell-out crowds across the country and are among the most reproduced on the Web. “And one reason,” writes noted journalist Bill McKibben, “is that Moyers pulls no punches. His understanding of America’s history is at least as deep as his understanding of Christian tradition, which is an integral part of his background . . . With his feet firmly planted in the deepest American traditions, Bill Moyers is helping to keep alive an oratorical tradition that is fading after two centuries. Trained by his career in broadcasting, he writes for the ear, his cadences and his repetitions timed to bring an audience to full realization of its role and its power.”And that is the message of this book. Moyers on Democracy collects many of Bill Moyers’s most moving statements to connect the dots on what is happening to our country—the twinned growth of private wealth and public squalor, the assault on our Constitution, the undermining of the electoral process, the accelerating class war against ordinary (and vulnerable) Americans inherent in the growth of economic inequality, the dangers of an imperial executive, the attack on the independence of the press, the despoiling of the earth we share as our common gift—and to rekindle the reader’s conviction that “the gravediggers of democracy will not have the last word.” Richly insightful and alive with a fierce, abiding love for our country, Moyers on Democracy is essential reading in this fateful presidential year.",
  "genres": [
    "Politics",
    "Nonfiction",
    "History",
    "Philosophy",
    "Essays",
    "Political Science",
    "Sociology"
  ],
  "author": "Bill Moyers",
  "average_rating": "4.30",
  "url": "https://www.goodreads.com/book/show/2602541-moyers-on-democracy"
}