{
  "title": "An Aspiring Escort: The Making of a High-Class Call Girl",
  "description": "After graduating from law school and passing the bar exam months ago, Prim walks away with more than just impressive credentials and an idealistic American dream—she also inherits mountains of debt and an unfortunate tendency to choke in job interviews. After one such nightmarish interview, Prim is on her way to see Paul, her longtime friend-with-benefits, to relieve some tension. Just when she is at her lowest and wants nothing more than for Paul to put her at ease, she finally catches a break in the form of an unexpected encounter with a mysterious businesswoman named Veronica McCarthy. Seeing deep potential in Prim, Veronica offers her a rare chance to enter the secretive world of high-class escorting. Intrigued by the opportunity and desperate from her debt, Prim nervously jumps at the chance. Through the process of learning the nuances of being a top-dollar escort for Veronica, Prim becomes surprisingly fond of it. After weeks of professional pampering with the best hair, makeup, and wardrobe stylists, she builds an impressive portfolio that attracts the city’s highest bidder. The result is a distinguished night of finer pleasures and passions than Prim has ever experienced. While she’s becoming more confident and successful as an escort, Prim can’t bring herself to share the details of her new job with Paul. After a hard day of being mentally beat up by Veronica and her team, Prim meets Paul in her full escort attire, and he is blown away by the beauty and mystique of this woman he’s known for years. Just when Prim is becoming settled in her new lifestyle, things seem to be falling apart for her mentor, Veronica. Unbeknownst to Prim, things aren’t as bad as she was led to believe, and a secret night planned by Veronica and Paul ends up giving Prim the life that she has always wanted.",
  "genres": [],
  "author": "Erika Night",
  "average_rating": "3.75",
  "url": "https://www.goodreads.com/book/show/26028672-an-aspiring-escort"
}