{
  "title": "Broken Wing",
  "description": "Winner of IPPY gold, a Historical Novels Review Editor’s Choice and an All About Romance Desert Island Keeper, Judith James’ breathtaking Broken Wing is the poignant story of a complex man, bitterly wounded by life, who finds self-worth through love. Abandoned as a child and raised in a brothel, Gabriel St.Croix has never known family, friendship or affection. Hiding physical and emotional scars behind an icy façade, his only bond is with the young boy he has spent the last five years protecting from the brutal reality that surrounds them. But the boy's family has found him and are coming to take him home. Sarah Munroe blames herself for her brother's disappearance. When he's located safe and unharmed despite where he’s been living, she vows to aid the man who rescued him in any way she can. She tries to help Gabriel face his demons and show him he can trust in friendship and in love - but when the past catches up with him he must face it on his own. As a mercenary, pirate, professional gambler, Gabriel travels to London, France, and the Barbary Coast in a desperate attempt to find Sarah again - but on the way he will discover that the most dangerous journey and the greatest gamble of all, lies within the darkest regions of his own heart. Warning Gabriel’s journey from a man who knows nothing of friendship or affection, to a man who is able to love and accept love, is a hero’s journey, though perhaps not one typical of most romances. I’ve tried to give an honest portrayal of the problems and issues many who survive cruelty and warfare confront, and as a result, it may be too dark and edgy for some readers, and it may not appeal to those looking for a lighter read. Those who like raw-edged emotion and intense romance, spiced with high adventure, exotic locales, and an extra dollop of history, will I hope, be in for a treat. Like most of us, Gabriel and Sarah are flawed characters trying to do their best, and I dare you not to fall in love with them.",
  "genres": [
    "Historical Romance",
    "Historical",
    "Romance",
    "Historical Fiction",
    "Pirates",
    "Fiction",
    "Regency"
  ],
  "author": "Judith James",
  "average_rating": "3.90",
  "url": "https://www.goodreads.com/book/show/26028195-broken-wing"
}