{
  "title": "Kiss Me Quick Before I Shoot",
  "description": "Finally, a book for all who love the movies written by a filmmaker who has walked the walk in TV and film. A very entertaining journey of fascinating industry stories providing a true look behind the curtain of filmmaking. Don't miss this unique treat inside the real Hollywood! -- JOE ALVES, British Academy Award winning Production Designer, JAWS, CLOSE ENCOUNTERS OF THE THIRD KINDJacqui and Guy have lived a true Hollywood love story which includes a brave triumph over cancer beautifully told in layman s words. This is a great memoir for all romantics, caregivers, and movie fans! -- LINDA MENDEZ, Business Manager Entertainment IndustryGuy's hilarious stories and unique voice makes this memoir a very compelling read about the behind-the-scenes of filmmaking and living a romantic Hollywood life. A smart, engaging and uniquely passionate book. -- GEOFF SCHAAF, 4-time Emmy Winning Cinematographer, FATAL EXPOSURE, SEAQUEST, JACK AND JILLKiss Me Quick Before I Shoot is a memoir about magic...the kind that permeates the air every time I call 'Action,' every time I'm in an editing room, every time I'm working with a composer on a film score. For me, there is no more magical a career endeavor than making films.Movie lovers will discover what it would be like to work in the dream factory, to be a film director, to have an inside peek at Hollywood s inner workings making movies and TV shows. This memoir brings to life the many personalities and stars encountered, and tells the hilarious stories behind the stories on the rocky road to Hollywood success.With production work spanning over 100 credits from docs to shorts to TV shows to feature films, Guy Magar s behind-the-scenes stories range from his first producer turning out to be a Mafia assassin, to shooting in Egypt for the original series Battlestar Galactica, to directing a grunting Mr. T on The A-Team, to almost decapitating a young Drew Barrymore, and to almost derailing James Cameron s career (or slowing it down as he proved way too talented for anyone to alter his storied destiny.) This memoir is about living the great American dream, an immigrant s dream to make movies in Hollywood.Kiss me quick before I shoot has been my welcoming catchphrase to my wife Jacqui whenever she visited on-set, seemingly always just before I rolled cameras. And so this book is also about a deeper magic, the magic of finding a life partner. Love begins when you meet a kind heart, a kind soul, and blossoms into caring for that person more than for yourself.Jacqui and I were married in a memorable and beautifully costumed Renaissance-themed wedding. I got to duel in a sword fight to win her hand against hooligans (stuntmen friends) who kidnapped her after she arrived by horse and buggy in front of 300 surprised guests. It was a magical wedding. It was my Errol Flynn life moment!Now, 28 years later, I am still head-over-heels in love with Jacqui. But then, suddenly, Black Monday Jacqui was diagnosed with leukemia.I immediately moved into the role of caregiver, and my entire 24-hour life focus became Jacqui s healing. We discovered the healing mecca of the City of Hope in Duarte, California. There we met a world-class gifted doctor who welcomed Jacqui to join their national trial. We locked up our house, boarded the dog, and moved in to start Jacqui s curative journey back to health.DARE TO DREAM! As an immigrant with Hollywood dreams to become a director and I did...I dreamed of finding true love and I did at 34...and when Jacqui got ill, I dreamed we would find a way to heal her, and we did. People love stories about making dreams come true. I dared to dream!",
  "genres": [
    "Memoir"
  ],
  "author": "Guy Magar",
  "average_rating": "3.92",
  "url": "https://www.goodreads.com/book/show/11658355-kiss-me-quick-before-i-shoot"
}