{
  "title": "The Wizard of Oz and Other Narcissists: Coping with the One-Way Relationship in Work, Love, and Family",
  "description": "Every day headlines are filled with examples of narcissistic individuals in positions of power who are nothing more than impostors plundering and wreaking havoc on the lives of others. From the financial barons of Wall Street to our elected officials in government, we are confronted daily with narcissists and the self-serving systems that enable them. Helping people reclaim their lives from this sinister exploitative force is the mission behind Payson's book, The Wizard of Oz and Other Narcissists: Coping with the One-Way Relationship in Work, Love, and Family. Using simple metaphors from the American classic, The Wizard of Oz, Payson illustrates how Dorothy's journey captures all the seductive illusions and challenges that occur when we encounter the narcissist. Empowering the reader with the ABCs of unhealthy narcissism and the unique problems that occur when a person becomes involved with the narcissist, Payson gives step-by-step practical tools to identify, protect, and heal from these destructive relationships. Largely un-addressed in the psychology and self-help literature, this ground breaking book offers hope and help to those who have been drawn into these devastating relationships. She includes illuminating case studies that identify the problems that occur in the different types of relationships, from co-workers, to friends, to parents, to lovers. Readers employing these insights and skills will find new abilities to identify and protect against the narcissist's manipulations and take back control of their lives.",
  "genres": [
    "Psychology",
    "Nonfiction",
    "Self Help",
    "Mental Health",
    "Relationships",
    "Personal Development",
    "Audiobook"
  ],
  "author": "Eleanor D. Payson",
  "average_rating": "4.17",
  "url": "https://www.goodreads.com/book/show/116590.The_Wizard_of_Oz_and_Other_Narcissists"
}