{
  "title": "Empowerment: Taking Charge of Your Life",
  "description": "Announcing the AMAZON.COM KINDLE Direct Publishing edition of: EMPOWERMENT: TAKING CHARGE OF YOUR LIFE,A Consumer and Career Survival Guide, by Dr. Eugene F. Elander, economist and consultant EMPOWERMENT provides a unique set of techniques for dealing effectively with The System, and thus taking charge of your life. Far too many people feel powerless in the face of giant corporations which seek to control every aspect of their lives. This book offers tried-and-true ways of coping with firms, agencies, and institutions which seem to hold all of the cards -- until they are effectively challenged. Every one of us has both the right, and the absolute moral obligation, to be in control of our own destiny. EMPOWERMENT tells us just how to achieve that control in a host of settings, and was recently updated with a chapter on avoiding cybercrime. Readers can apply these techniques to improve their own lives by taking full control of their decisions and the resulting outcomes!  Author's Biography: Eugene Elander won the Young Poets Award at 16 from the Dayton Poets Guild for his poem The Vision. He was chosen Poet Laureate of Pownal, Vermont for his poem Pownal People. His three new verses titled America the Beautiful: September 11, 2001, memorializing the terrorist tragedy, have been widely acclaimed and read into the Congressional Record by then-Connecticut U.S. Senator Chris Dodd. Dr. Elander has authored four volumes of poetry: The Right Click, The World Click, Journeyings, and Philosophy over Fika (two of which were co-authored with his wife Birgit) -- as well as two published novels: The Goat of God, and Turning the Tides, both available from Signalman Publishing of Florida. Dr. Elander is a freelance columnist who published a newspaper for ten years in New London, CT. He is an economist and college lecturer, and has been an agency executive director, emergency management consultant, investigator; and former animal control officer, deputy code enforcement and health officer for Farmington, New Hampshire. He and his wife Birgit divide their time between Dahlonega, Georgia and her homeland, Gotland, Sweden. They have also traveled extensively throughout the United States, Canada, and Europe. Several other books are underway, including a collection of his Op Ed articles titled: Tales for Troubled Times. He is president of his own Elander Press, which has recently published EMPOWERMENT. Eugene F. Elander",
  "genres": [],
  "author": "Eugene Elander",
  "average_rating": "4.50",
  "url": "https://www.goodreads.com/book/show/26024228-empowerment"
}