{
  "title": "The Adrian's Undead Diary Omnibus: Volume One",
  "description": "Collected here are the first four books of the eight book, bestselling epic Adrian's Undead Diary.The world crashed to pieces on June 23rd, 2010 and Adrian Ring wasn't anywhere near ready for it. He had no guns, no food, no friends around, a cat that wanted to slip out the back of the condo and a girlfriend trapped in the heart of the city.This is the story of how he survived.Bookie Monster Best series of 2014.Book One: Dark RecollectionsBeheading a zombie isn't easy in a world where you're more afraid of the living than the dead. Adrian Ring's simple life is thrown into chaos when the world is ripped apart by a plague of undead and legions of desperate survivors. Retreating to Auburn Lake Preparatory Academy, Adrian attempts to rescue friends and family on the way while dancing around his impending insanity over who and what he left behind, and evading maniac survivors. He saves his cat Otis, but shoots his mom. Pretty successful, all things considered. Of course, his sanity takes a hit as a result. Real, flawed, and raw, Dark Recollections is the first part of Adrian's own story of how he survived after \"That Day.\" Told through his eyes as he talks to his laptop, affectionately named 'Mr. Journal,\" and through short stories that entwine with his tales that bring forth dark visions of a world being eaten alive by an unimaginable evil. Adrian's Undead Diary is an eight part epic about a solitary, guilt stricken man that didn't think he deserved to live, but realizes very soon that he survived, and suffered for a reason. Dark Recollections is the first book in the AUD series. It covers Adrian's journal entries from September 21st 2010, to December 1st, 2010. Intermingled with his personal diary entries, book one also contains the short stories Phil's Story, McGreevy's Report, and Soccer Mom. The second edition of the book contains slight revisions to the table of contents, a new foreword by the author, and some editorial revisions.Book Two: Alone No MoreRealizing you have a surviving neighbor after the world is overtaken by the undead isn't always a good thing. Unless that neighbor is the grumpy, armed and retired Green Beret Gilbert Donohue. In that case, finding out you've got a neighbor is a lot like hitting the proverbial jackpot. Adrian's piecemeal life on campus since \"That Day\" has been a struggle. Retrieving supplies from local neighborhoods filled with the walking dead has been dangerous for him, but he's stayed alive by being a little smarter than the other survivors, and a lot faster than the roaming, hungry zombies that have overtaken his home town, and the world. In Alone No More, the second installment in the smash hit series Adrian's Undead Diary, Adrian's life is poised to become even more complicated and dangerous when some familiar faces find their way to ALPA with some less than friendly folks on their tail. For the first time the breadth of Adrian's Apocalypse widens to reveal the death of one of the oldest cities of mankind in one of the most popular of all the AUD short stories: Jerusalem. Sometimes in the cold of winter, the only thing that can keep you warm is freshly spilled blood. Alone No More is the second entry in the AUD series, and covers Adrian's journal entries from December 3rd 2010 through December 27th 2010. Intermingled with his personal diary entries Alone No More also contains five short stories. One Mistake: The Last Stand of Hall B, Putting a Name to a Face, Exodus, Jerusalem, and The Chief.Book Three: MidnightTap tap tap went the zombie on the bridge...Book Four: The Failed CowardA sinister darkness has finally cast its long shadow across the world, and Adrian Ring now suspects he's at the center of the maelstrom. And he's not alone.",
  "genres": [
    "Zombies",
    "Horror",
    "Fiction",
    "Apocalyptic",
    "Science Fiction"
  ],
  "author": "Chris Philbrook",
  "average_rating": "4.55",
  "url": "https://www.goodreads.com/book/show/26032056-the-adrian-s-undead-diary-omnibus"
}