{
  "title": "Life in Christ: A Spiritual Commentary on the Letter to the Romans",
  "description": "In Life in Christ Raniero Cantalamessa, preacher to the papal household, presents a project ofre-evangelization and spiritual renewal based on St. Paul's Letter to the Romans. It is therefore neither an exegetical commentary nor a theological treatise, but goes straight to the heart of what animated the Apostle when he wrote this letter. His aim was not to give the Christians of Rome—and the Christians of later generations—a difficult text on which to exercise their critical wisdom but rather to impart a spiritual gift to them so that they would be strengthened and mutually encouraged by each other's faith. At the beginning of the third millennium a new phenomenon is spreading through the Christian Churches which can only be the work of the Holy Spirit. Up to now Christians of different denominations have proclaimed Jesus Christ mainly in competition and rivalry with one another, thus compromising our testimony in the eyes of the world. Why should we not grasp this unique occasion to start proclaiming together with brotherly love our common belief in Christ, which is far more important than what still separates us? Pope John Paul II has espoused this project and has expressed the wish that all Christians take this opportunity for fruitful cooperation in the many areas which unite us; these are unquestionably more numerous than those which divide us.\" Life in Christ is a contribution to the realization of this project. Father Cantalamessa has made the most of the insights and riches present in each one of the three main Christian Catholic, Orthodox, and Protestant, avoiding those points not commonly shared by all believers in Christ, or at least by the majority of them. The Letter to the Romans lends itself to this aim because it deals with the basics of the Christian faith, leaving all the rest aside. It is the ideal basis for that \"Common Witness\" which is becoming more and more central to ecumenical dialogue. This is, therefore, a first and \"partial\" attempt to present a spirituality and a proclamation corresponding to the new grace of understanding and unity given to the Christians in the second half of this century. Chapters are \"Loved by God!\" \"all Have Sinned,\" \"The Righteousness of God Has Been Manifested!\" \"He Was Put to Death for Our Trespasses,\" \"He Was Raised for Our Justification,\" \"God Did Not Spare His Own Son,\" \"Let Not Sin Reign in Your Mortal Bodies!\" \"The Law of the Spirit Which Gives Life,\" \"The Spirit Intercedes for Us,\" \"Let Love Be Sincere,\" \"Don't Think Too Highly of Yourselves,\" \"By One Man's Obedience,\" and \"Let Us Put on the Armor of Light.\" Raniero Cantalamessa, OFM Cap, is a past professor of the history of Christian origins at the Catholic University of Milan and a member of the International Theological Commission. He is preacher to the papal household and the author of The Mystery of Pentecost , Easter in the Early Church ; The Our Sanctification ; The Mystery of God's Word ; The Holy Spirit in the Life of Jesus ; Jesus Christ, The Holy One of God ; Mary, Mirror of the Church ; The Mystery of Christmas ; and The Mystery of Easter published by The Liturgical Press. \"",
  "genres": [
    "Catholic",
    "Spirituality",
    "Christian",
    "Religion",
    "Faith"
  ],
  "author": "Raniero Cantalamessa",
  "average_rating": "4.62",
  "url": "https://www.goodreads.com/book/show/1166064.Life_in_Christ"
}