{
  "title": "Lost Journal Vol. 2: Five Older Brothers, Twenty Bad Jobs, and Zero Dates",
  "description": "One part memoir, two parts humor, LOST JOURNAL collects the best of the nationally syndicated column seen in over 300 newspapers and websites. Each column is a humorous snapshot of a day in the author's past, written as a journal entry. A particular entry may be from Halloween 1980, yesterday, or the day he was born. By writing a diary in retrospect, Mollen satirizes both past and present, serving up pop culture and nostalgia with a wit that is both sharp and gentle-hearted. Many of the entries present poignant, self-deprecating stories of growing up in the 1970s and '80s as the youngest of six boys in a middle-class, Irish Catholic family. This volume is one of a three-part series, each one a treasury of humor. Praise for LOST “LOST JOURNAL is classic, timeless humor writing that's nonetheless very much of our era, and it ought to be in every newspaper in America.” – Jonathan Caws-Elwitt, playwright, The Can of Yams “It's a challenge to write with such specific details of places and people and have it relate to a national audience. Kudos, Tim, on a great gem of a collection!” – Hannah Maria Hayes, former Features Editor, Binghamton Press & Sun-Bulletin “Mollen has entertained our readers for over six years. Men have welcomed his fresh perspective. Women have enjoyed his unique voice, which is always humorous. He always has a fun take on life.” – Katie Hall, Living Section Editor, Cortland Standard “Tim Mollen's keen observations sparkle with wit while he dissects the mysteries of childhood and beyond.\" – John Ducey, actor, The Jonas Brothers , Sabrina the Teenage Witch , Will & Grace “Mollen's uniquely funny and engaging LOST JOURNAL gets a great response from our readers, and we know you'll easily relate to the amusingly disarming stories in this book. Enjoy!” – James Israel, Publisher & Editor, Humor Times “Mollen is the Norman Rockwell of newspaper columnists. His LOST JOURNAL is a masterful glimpse into the American psyche, each collective memory mysteriously pulling you deeper into your own past.” – Santino DeAngelo, playwright, composer & lyricist, Another Happy Ending “Tim Mollen is a prose raconteur with a comedian's flair for wit, timing, and knowing just where the laughs go, and he has a genius for harvesting hilarious personal tales from the landscape of ordinary life.” – Jeremy Edwards, author, The Pleasure Dial “Mollen’s LOST JOURNAL is a thought-provoking collection of his most famous columns, capturing with amazing clarity those experiences we have been only too happy to the middle school field trip, the bad summer job, and that secret longing to be one of the Scooby-Doo gang. Read LOST JOURNAL. It’s like regression therapy without the couch.” – Diana Bean, Editor, Binghamton University Magazine “LOST JOURNAL proves Mollen is a gifted humorist with a knack for eliciting both laughter and nostalgia.” – Mike McNally, author, Mr. Father “When I think back on being an adolescent in the '80s, I don't know whether to laugh or cry. But if it's Tim Mollen taking me back, it's laughter all the way. He's like Sherman, minus Mr. Peabody.” – Sarah D'Esti Miller, NEA Arts Journalism Fellow & former arts critic, Gannett “LOST JOURNAL is a compilation of hilarity, and it will feed your soul!” – Roger L. Brooks, author, The Power of Loyalty “I look forward each week to receiving Tim's articles. LOST JOURNAL is a personal favorite of mine, and many readers have expressed the same sentiments. Whether it be reading of his childhood antics, or the trials of his adulthood, Tim Mollen will keep you enthralled.” – Amanda Thombleson, News Editor, Mt. Carmel Daily Republican Register",
  "genres": [],
  "author": "Tim Mollen",
  "average_rating": "4.71",
  "url": "https://www.goodreads.com/book/show/26036231-lost-journal-vol-2"
}