{
  "title": "The Rise of the Alpha",
  "description": "“You are getting married… with a beautiful goddess… while I am left here alone. For the second time, you have broken my heart. However, the law of the Lycans gives me the privilege to assert my right to marry you. She may be a goddess, and I am just what they call a weaker creature, but I hold the strongest weapon of all—your heart.” ~Asra “Enough, Asra. Your effort is futile. The love you’re fighting for is not at all possible. I am marrying this goddess not because I love her but because it’s the only way for me to free my people. Save yourself and spare me from the pain of losing you. Now don’t cry… or my heart will break.” ~Lior WARNING: This book contains sexually explicit scenes and language. FOR ADULTS ONLY. ----------------------------  BRIEF DESCRIPTION:  He is Lior Wolverton, a Lycan god of Asgard. Odin sends him on a mission to the realm of the mortals to kill a future threat to Asgard. Her name is Asra. One look at this breathtakingly beautiful half-Elf half-human and Lior cannot control his desire to claim her. Instead of killing her, he hides her in the Kingdom of the Dark Elves. He decides to remain in the mortal world as a self-punishment for breaking his warrior code.  Asra wakes up from a deep slumber. She finds out that she has been asleep for two hundred years. It is now the twenty-first century and she's no longer the princess of the mighty MacLeod clan of Scotland but a prisoner of the very man she hates with every fiber of her being, the man who broke her heart.  Lior is now a billionaire living in the UK, dwelling with the mortals while keeping his pack of Lycans together. It is a different time and the balance of power has shifted. Odin summons him again to do a mission. This is his chance to redeem his old place in Asgard, but he has to deliver Asra to Odin at all costs.  The survival of his Lycan race depends on it.",
  "genres": [],
  "author": "Garnet Hart",
  "average_rating": "4.50",
  "url": "https://www.goodreads.com/book/show/26033979-the-rise-of-the-alpha"
}