{
  "title": "Visions",
  "description": "A young detective working the night shift in Hollywood, Wendell Book has seen plenty of tragic teen runaways, but never one like Molly. Every night, she dreams of violent deaths and whispering voices that push her to do wicked things, like run away from home, steal cars, and break into a stranger's apartment. Wendell Book's apartment.In time, maybe just in time, Molly begins to see her dreams for what they really are. Memories. The deaths she recalls were all her own, each a link in a long chain of lifetimes. The mercilessly unfolding truth - this overwhelmed girl is the fox in an impossible hunt. She is the guardian of an ancient and mysterious object known only as the King's X. Its true owners have chased her from lifetime to lifetime to get it back. Now, they have the scent again... \"King's X\" is a noir detective mystery and a swashbuckling, romantic, historical adventure. Two stories gradually dovetail to reveal that they are in fact one story. An epic chase across many lifetimes.[br][br]****“KING'S X is that rare reader experience: an authentic thrill-ride that reads like literary fiction. Stephen T. Harper has written a bona fide page-turner. This tale is replete with beauty, brains, and brawn. The heroes and heroines are capable of breaking your heart, and the villains will evoke grudging admiration. KING'S X is a must-read that is destined to become a classic!” --Laura Taylor, Award-Winning Author & Veteran Editor**** ****\"Outstanding Fiction\" Award Winner- Southern California Writers Conference********FAIR WARNING**** before you purchase this book:King's X is a provocative thriller with a paranormal twist told in SERIALIZED EPISODES. Each Episode is NOVELLA LENGTH, priced at 99 cents, and ends in a cliffhanger until the first long arc story concludes in Episode 4: \"Thieves,\" due in January 2011. King's X is addictive and it wants to get you hooked.",
  "genres": [
    "Fantasy"
  ],
  "author": "Stephen T. Harper",
  "average_rating": "3.76",
  "url": "https://www.goodreads.com/book/show/10177750-visions"
}