{
  "title": "Romantic As Hell - Tales of Woe, Tips of Woo",
  "description": "From the bestselling author of Things Go Wrong for Me and Perhaps I've Said Too Much... In this hilarious, heartfelt and surprisingly useful book, bestselling author and comedian Rodney Lacroix opens up about his failed romantic endeavors and - more importantly - how you can avoid the same hysterically bad mistakes. Forming a relationship is hard. Keeping a relationship is harder. But adding romance into that relationship? Well, that can be a real bitch, can't it? Written in Rodney's trademarked comedic style, Romantic As Hell gives some great relationship advice like: - Why shouldn't I give a feral cat as a token of my affection? - Why you're not fooling anyone with that \"free back massage any time\" coupon. - Which \"romantic getaways\" should you avoid, and which one may result in having your own shoes thrown at you? - Why doesn't my man wear his Pinocchio thong? - How can we keep the spark alive while parenting in a house with four children who are all busy annoying the crap out of us? Each hilarious story is punctuated with amazing illustrations that transform the book into a highly entertaining feast for the eyes, as well. Let's face it. Everyone can use a little help in the dating and love departments. It just so happens that sometimes such help comes in the form of a hysterical book that has a cover showing a teddy bear riddled with arrows and the word \"Hell\" in the title. Whether you're trying to find a mate, already dating, trying to keep your marriage fresh or just looking for some new ideas, Romantic As Hell - Tales of Woe, Tips of Woo by award-winning humor author Rodney Lacroix has got your situation covered and is here to save the day. Rodney Lacroix knows two things: comedy and romance. As \"A Guide for the Romantically Challenged,\" he puts them together in a package that is sure to give the audience some unique concepts and perspectives on affection, and a whole lot of side-splitting laughter.",
  "genres": [
    "Humor",
    "Romance"
  ],
  "author": "Rodney Lacroix",
  "average_rating": "4.29",
  "url": "https://www.goodreads.com/book/show/26046116-romantic-as-hell---tales-of-woe-tips-of-woo"
}