{
  "title": "Stephen Fry in America",
  "description": "Britain's best-loved comic genius Stephen Fry turns his celebrated wit and insight to unearthing the real America as he travels across the continent in his black taxicab. Stephen's account of his adventures is filled with his unique humour, insight and warmth in this beautifully illustrated book that accompanies his journey for the BBC1 series.'Stephen Fry is a treasure of the British Empire.' - The GuardianStephen Fry has always loved America, in fact he came very close to being born there. Here, his fascination for the country and its people sees him embarking on an epic journey across America, visiting each of its 50 states to discover how such a huge diversity of people, cultures, languages, beliefs and landscapes combine to create such a remarkable nation.Starting on the eastern seaboard, Stephen zig-zags across the country in his London taxicab, talking to its hospitable citizens, listening to its music, visiting its landmarks, viewing small-town life and America's breath-taking landscapes - following wherever his curiosity leads him.Stephen meets a collection of remarkable individuals - American icons and unsung local heroes alike. Stephen starts his epic journey on the east coast and zig-zags across America, stopping in every state from Maine to Hawaii. En route he discovers the South Side of Chicago with blues legend Buddy Guy, catches up with Morgan Freeman in Mississippi, strides around with Ted Turner on his Montana ranch, marches with Zulus in New Orleans' Mardi Gras, and drums with the Sioux Nation in South Dakota; joins a Georgia family for thanksgiving, 'picks' with Bluegrass hillbillies, and finds himself in a Tennessee garden full of dead bodies.Whether in a club for failed gangsters (yes, those are real bullet holes) or celebrating Halloween in Salem (is there anywhere better?), Stephen is welcomed by the people of America - mayors, sheriffs, newspaper editors, park rangers, teachers and hobos, bringing to life the oddities and splendours of each locale.A celebration of the magnificent and the eccentric, the beautiful and the strange, Stephen Fry in America is our author's homage to this extraordinary country.",
  "genres": [
    "Nonfiction",
    "Travel",
    "Humor",
    "Audiobook",
    "Memoir",
    "Biography",
    "American"
  ],
  "author": "Stephen Fry",
  "average_rating": "3.78",
  "url": "https://www.goodreads.com/book/show/2604700-stephen-fry-in-america"
}