{
  "title": "Mercs",
  "description": "Earth has been a scarred ruin for three decades, its scattered people struggling to survive amid the poisoned and radioactive wreckage of the final war between its despotic Superpowers. While the people of Earth struggle to survive, out on the frontier, on a thousand worlds, mankind thrives and grows, building new civilizations and looking boldly to the future. But man has never been able to live in peace, and even Earth’s sad fate has failed to slow the call to war.  Most of the colonies lack the industry and economic power to sustain their own armies and navies, and they look to the mercenaries of the Great Companies for aid in time of war. These futuristic condottiere contract themselves to the highest bidder, and the mightiest strike fear into the hearts of all who oppose them.  Darius Cain is the leader of the Black Eagles, the most renowned of all the Companies. A military genius, he has led his undefeated warriors from victory to victory. The Eagles command the highest rates of any of the Companies, and leaders bankrupt worlds to pay their price.  But amid the ruins of Earth and on planets all across occupied space there are signs of a greater darkness, a force working in the shadows, waiting for the right moment to strike, to launch a final war to reduce all mankind to slavery.  As Cain slowly uncovers the truth, he must forge an alliance among old enemies, the other Companies his men have fought for years…and the twin brother he hasn’t seen in a decade.  The Crimson Worlds are about to explode into a war that may be mankind’s last.  Also By Jay Allan:  The Crimson Worlds Series:  Marines (Crimson Worlds I) The Cost of Victory (Crimson Worlds II) A Little Rebellion (Crimson Worlds III) The First Imperium (Crimson Worlds IV) The Line Must Hold (Crimson Worlds V) To Hell’s Heart (Crimson Worlds VI) The Shadow Legions (Crimson Worlds VII) Even Legends Die (Crimson Worlds VIII) The Fall (Crimson Worlds IX) War Stories (3 Crimson Worlds Prequels)  Gehenna Dawn (Portal Wars I) The Ten Thousand (Portal Wars II)  The Dragon's Banner (Pendragon Chronicles I)  Now Available for Pre-Order: Into the Darkness (Crimson Worlds Refugees I) Release Date: Jun 23, 2015",
  "genres": [
    "Science Fiction",
    "Military Fiction",
    "Amazon",
    "Space Opera",
    "War",
    "Military Science Fiction"
  ],
  "author": "Jay Allan",
  "average_rating": "4.20",
  "url": "https://www.goodreads.com/book/show/26048798-mercs"
}