{
  "title": "The Never List",
  "description": "SHORTLISTED IN THE 2016 CHATELAINE INTERNATIONAL BOOK AWARDS\nVictoria Smith's life seems dreary until someone knocks on a sealed door inside her London bookshop.  When Tori discovers it's not a ghost but a journalist from 1854, she accidentally strands him in 2014. Intrigued by the dapper and crusading Charles Stratford, Tori offers to help him locate a pendant that will reopen the door to his century.  Even when their treasure hunt across London turns dangerous, Tori finds herself wishing that Charles could stay.  But after losing her family a decade before, can she risk loving someone again, especially a man from 1854?Lured into the future by a mysterious pendant, Charles Stratford must track down its counterpart to unlock the door between Londons.  When the winsome Victoria Smith volunteers to join his search, Charles becomes smitten with the intrepid bookseller.  He also uncovers an ancient struggle between two underground societies and becomes entangled in their secret intrigues.  If Charles fails to return both pendants to 1854, he places his own London at risk.  But how can he succeed when it means saying farewell to Victoria in 2014?From modern-day Soho to nineteenth-century Mayfair, The Never List takes readers on a whirlwind tour of Londons new and old as its time-crossed heroes search for a way to love each other within two centuries.  It is the first book in the Love Across Londons series which should be read in order.Book One: The Never ListBook Two: The Best-Left QuestionsBook Three: The Next ForeverRomance Heat Scale: Mild/PG. No detailed sex scenes, profanity, or graphic violence.Praise for The Never List - SEMI-FINALIST in the 2017 Kindle Book Awards:",
  "genres": [
    "Time Travel",
    "Historical Fiction",
    "Fiction",
    "Romance",
    "British Literature",
    "Historical",
    "Historical Romance"
  ],
  "author": "F.E. Greene",
  "average_rating": "3.92",
  "url": "https://www.goodreads.com/book/show/26049225-the-never-list"
}