{
  "title": "One Continuous Fight: The Retreat from Gettysburg and the Pursuit of Lee's Army of Northern Virginia, July 4-14, 1863",
  "description": "The titanic three-day battle of Gettysburg left 50,000 casualties in its wake, a battered Southern army far from its base of supplies, and a rich historiographic legacy. Thousands of books and articles cover nearly every aspect of the battle, but not a single volume focuses on the military aspects of the monumentally important movements of the armies to and across the Potomac River. One Continuous The Retreat from Gettysburg and the Pursuit of Lee’s Army of Northern Virginia, July 4-14, 1863 is the first detailed military history of Lee’s retreat and the Union effort to catch and destroy the wounded Army of Northern Virginia.Against steep odds and encumbered with thousands of casualties, Confederate commander Robert E. Lee’s post-battle task was to successfully withdraw his army across the Potomac River. Union commander George G. Meade’s equally difficult assignment was to intercept the effort and destroy his enemy. The responsibility for defending the exposed Southern columns belonged to cavalry chieftain James Ewell Brown (Jeb) Stuart. If Stuart fumbled his famous ride north to Gettysburg, his generalship during the retreat more than redeemed his flagging reputation.The ten days of retreat triggered nearly two dozen skirmishes and major engagements, including fighting at Granite Hill, Monterey Pass, Hagerstown, Williamsport, Funkstown, Boonsboro, and Falling Waters. President Abraham Lincoln was thankful for the early July battlefield victory, but disappointed that General Meade was unable to surround and crush the Confederates before they found safety on the far side of the Potomac. Exactly what Meade did to try to intercept the fleeing Confederates, and how the Southerners managed to defend their army and ponderous 17-mile long wagon train of wounded until crossing into western Virginia on the early morning of July 14, is the subject of this studyOne Continuous Fight draws upon a massive array of documents, letters, diaries, newspaper accounts, and published primary and secondary sources. These long-ignored foundational sources allow the authors, each widely known for their expertise in Civil War cavalry operations, to describe carefully each engagement. The result is a rich and comprehensive study loaded with incisive tactical commentary, new perspectives on the strategic role of the Southern and Northern cavalry, and fresh insights on every engagement, large and small, fought during the retreat.The retreat from Gettysburg was so punctuated with fighting that a soldier felt compelled to describe it as “One Continuous Fight.” Until now, few students fully realized the accuracy of that description. Complimented with 18 original maps, dozens of photos, and a complete driving tour with GPS coordinates of the entire retreat, One Continuous Fight is an essential book for every student of the American Civil War in general, and for the student of Gettysburg in particular.About the Eric J. Wittenberg has written widely on Civil War cavalry operations. His books include Glory Enough for All (2002), The Union Cavalry Comes of Age (2003), and The Battle of Monroe's Crossroads and the Civil War's Final Campaign (2005). He lives in Columbus, Ohio.J. David Petruzzi is the author of several magazine articles on Eastern Theater cavalry operations, conducts tours of cavalry sites of the Gettysburg Campaign, and is the author of the popular \"Buford's Boys\" website at www.bufordsboys.com. Petruzzi lives in Brockway, Pennsylvania.A long time student of the Gettysburg Campaign, Michael Nugent is a retired US Army Armored Cavalry Officer and the descendant of a Civil War Cavalry soldier. He has previously written for several military publications. Nugent lives in Wells, Maine.",
  "genres": [
    "Civil War",
    "American Civil War",
    "History",
    "Military History",
    "Civil War Eastern Theater",
    "War"
  ],
  "author": "Eric J. Wittenberg",
  "average_rating": "4.08",
  "url": "https://www.goodreads.com/book/show/2605606-one-continuous-fight"
}