{
  "title": "Deadly Messengers",
  "description": "3 massacres, 2 detectives, 1 writer, 0 answers\nFreelancer Kendall Jennings writes fluff pieces for women's magazines. When a horrific massacre occurs at Café Amaretto, she scores an exclusive interview with a survivor. Suddenly, she's the go-to reporter for the crime. Investigating veteran detective Lance O'Grady and his partner Trip are tasked with finalizing the open and shut case. Seven people are dead at the hands of an unprovoked killer wielding an axe.Then another mass killing occurs. This time, arson, and ten eldercare facility residents die in the blaze. Again the killer dies at the scene. The crimes have no motive, and Lance O'Grady is left wondering how evil can strike twice in such a short space of time.Then it happens again. Even more shocking: a mother with a gun goes on a rampage at a family birthday party.The killers share one odd detail: none have a murderer's profile. No history of violence. No connection to terrorists. No vendettas. Ordinary citizens suddenly just became killers. Drawn deeper inside the crime investigation, Kendall finds herself not only clashing with O'Grady but also struggling with old demons. O'Grady resents this interfering reporter, whose presence provokes memories of a personal tragedy.What Kendall and O'Grady don't realize is they are caught in a plot far greater reaching than just these crimes. Someone is sending a message. And unless they can decipher the meaning, very soon, many more will die.Deadly Messengers, an unputdownable thriller, poses the question: Does a killer lurk inside everyone? The answer may prove more frightening than the crimes.INCLUDES:\nBonus \"THE WAR VETERAN\" from \"Behind Dark Doors,\" Susan May's horror short story collection of dark thrillers. \n   Bonus five chapter excerpt from \"BACK AGAIN\" Susan May's time thriller which brings a whole new meaning to time slips.",
  "genres": [
    "Thriller",
    "Mystery",
    "Crime",
    "Fiction",
    "Suspense",
    "Psychological Thriller",
    "Mystery Thriller"
  ],
  "author": "Susan May",
  "average_rating": "3.63",
  "url": "https://www.goodreads.com/book/show/26061318-deadly-messengers"
}