{
  "title": "If At First You Don't Succeed",
  "description": "Take one clueless, newbie Dom, and his chatty, bratty bottom, and you have a recipe for disaster. Evan Marshall and his boyfriend, Julien Bouvet, are madly in love and have decided to spice up their sex life with kink. Unfortunately, it’s not going quite as planned. Will they survive their kinky adventures? And will someone come along who can help guide them on their journey?****First published as part of the Love's Landscapes Anthology(DRiTC 2014, MMRomanceGroup), based on the prompt:Dear Author,My boyfriend and I have always played it safe, but recently we’ve tried to experiment with some of the more extreme aspects of the sexual realm. Well, extreme for us. Unfortunately, things haven’t always gone our way. We’re both a little awkward and geeky, but we like to flirt with “danger” (as long as it’s safe). For instance, our scene with chains turned into a giggle-fest because they were too cold. And don’t even get me started on what happened when we tried exhibitionism.Now, here I am trying to get into my brand new leather pants because I’m supposed to be playing the role of Dom, while my boyfriend is all tied up in the bedroom. I can’t exactly go out there like this.Please help us find our way in this brave new world, but make sure we have fun along the way.***I envision this story describing some interesting scenes where these two figure out what “does” work for them. However, I’m pretty open for anything. You can make this as wild or tame as you like as long as it keeps a certain level of comedic charm. These two are in love and trust each other, so I don’t have any issues if they want to try a threesome (or more) or other playfulness. But mostly, you can just take this in any direction you want. Have fun!Sincerely,Lisa T",
  "genres": [
    "M M Romance",
    "BDSM",
    "Contemporary",
    "Romance",
    "Short Stories",
    "Humor",
    "Erotica"
  ],
  "author": "K.C. Faelan",
  "average_rating": "3.63",
  "url": "https://www.goodreads.com/book/show/26057026-if-at-first-you-don-t-succeed"
}