{
  "title": "Moving Forward",
  "description": "To the outside world, Luke Monroe’s got it all. Brains. Looks. Popularity. The perfect girlfriend, even. Everything a twenty-year-old college guy could ask for. Deep down, however, Luke’s miserable and alone, because it’s all a façade meant to hide the secret he buried with his brother’s death six years ago. He’s gay. The only thing that’s kept him from shattering completely is Tristan. The cute, nerdy guy his heart secretly longs for.  Tristan Davis never cared much that he's always been invisible. Comfortable with who he is, he enjoys single life while he focuses on school, content with where his life is heading. Having Luke Monroe land in the class he’s the aide for brings back memories of their first meeting in high school. But Luke’s always had a girlfriend and so Tristan keeps his attraction to the guy to himself.  A special assignment brings Luke and Tristan closer than they’ve ever been. Tristan learns there’s more to Luke than his outward demeanor shows and Luke finds himself wanting to tell Tristan his secret. The fear of what the truth may bring, however, proves difficult to overcome.  When Luke finally finds the courage to open up to Tristan, everything changes and Luke gets his first glimpse of the joy and freedom he’s never known. But with it also comes the one thing that’s driven him to keep his secret for so long. The fear of hurting, and possibly losing, his family.  Luke knows he needs to choose, but how does he when loving Tristan could mean losing everyone else he loves? For the first time in his life, moving forward never seemed so hard.  This gay romance, stand-alone novella features content intended for mature audiences.  More from Savannah: Short Stories: Falling for his Best Friend Letting Him In Never in a Million Just One Kiss Cross My Heart  Novelettes: Finding His Forever Guy Snowed In Whole Again",
  "genres": [
    "M M Romance",
    "Contemporary",
    "College",
    "LGBT",
    "Romance"
  ],
  "author": "Savannah Brooks",
  "average_rating": "3.75",
  "url": "https://www.goodreads.com/book/show/26054777-moving-forward"
}