{
  "title": "SIMPLE TRIPLE STANDARD",
  "description": "The Real Official, Almost True Backstory for Modern Commercial Radio SIMPLE TRIPLE STANDARD is Historical Fiction gnawing the gut of local radio news reporter Bryant L Herman in a close-knit community rife with extrapolated double standards that garner deadly impact. If you’ve ever lived in a small town, you know about double standards... How much more complicated can a triple standard be, right? World famous Austin music celebrities, and behind the scenes radio personalities embody Bryant's descriptive of this genuine 1970s Texas style nostalgic romp which also includes love, passion, and an unexpected lethal twist. Notable Reviews:\"Writer to watch.\" —Marsha Wright, BBC\"Personalities rise up from the page.\" —Derrill Holly, Texas Radio Hall of Fame Inductee and Washington, D.C. JournalistRay Palla's SIMPLE TRIPLE STANDARD is about radio, Texas, the music scene, and a city called Austin that's as famous for bringing out the craziness of all three as it is for being a stomping ground for colorful politicians. SIMPLE TRIPLE STANDARD is more than just another \"See what happened was\" story about rednecks, long necks and college interns. It's a tale spun from the heart that brings it all together and makes the personalities rise up from the page.\"A brimming time capsule of '70s Austin, TX nostalgia.\" —Jay Levine (Former KOKE-FM DJ - \"Country Jay\"), Emmy Winning Hollywood Sound EditorAustin is a liberal jewel in a conservative state, and great place to live, then and now. Ray has captured the essence, sounds, and personalities of radio wars, music, & people of the '70s that put Austin on the path to become a world-class hub of culture. I was lucky enough to be a deejay on KOKE-FM, 'Super Roper Radio,' from 1973-76. Palla tells it like it was when Austin's unique culture first began to bloom.\"A fascinating, humble player on a huge stage.\" —Wes Chick, PlaywrightFollowing Bryant L Herman through the world of radio so many years ago grabbed my attention and was truly fascinating. I highly recommend SIMPLE TRIPLE STANDARD.",
  "genres": [],
  "author": "Ray Palla",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/26059590-simple-triple-standard"
}