{
  "title": "The Ghostlands, Part 1: Erie Energy",
  "description": "Her brother thought she would just disappear. Shy, weak Anastasia had only ever been a burden. She wouldn't be missed. She wouldn't survive. He never imagined she might thrive. Or that she might discover the secrets that could tear his world apart. \n**From Amazon Bestselling authors CN James & Amy Joy**\n Anastasia lives in a wondrous future world, protected from the ghosts outside by an energy barrier that surrounds her home of Erie Energy. The daughter of affluent parents, she lives atop of one of the city's premier towers. She should be prepared to settle into a safe, comfortable life like everyone else. But Anastasia isn't like everyone else. And she doesn't feel safe anywhere.  Anastasia doesn't come close to fitting the definition of a useful member of society. And her Name Value shows it. If it drops any further, she won't find a job after graduation, and she'll surely be traded to another city. But no one ever listens to Anastasia. Her father' s always working. Her mother works far away,visiting only as a hologram on weekends. Her teachers don't seem to care. She can't talk to her classmates. Her only brother is too focused on himself to ever notice she is there--that is, unless she can help him win the election for City Overseer. Her boyfriend is gone. Traded away, along with his family, and never heard from again. He would have listened and understood. He was her only true friend. But now no record of him exists. And no one will give Anastasia any answers. Her panic attacks are increasing daily. Anastasia can feel herself unraveling. And now the ghosts--the ones they swear don't ever enter the city, the ones whose speech they say is unintelligible--they are following her, visiting her, sending her ominous warnings. When it all comes crashing down, her brother arrives, telling her he has proof as to the whereabouts of her missing boyfriend. But to find him, she'll have to venture into the wilderness of the ghosts, and discover within herself a strength she never knew she had. In this, their fourth full-length novel, bestselling authors CN James and Amy Joy deliver their most haunting novel yet. Young Adult • Paranormal • Dystopian • Sci-Fi • Romance • Thriller",
  "genres": [],
  "author": "C.N. James",
  "average_rating": "4.36",
  "url": "https://www.goodreads.com/book/show/26059400-the-ghostlands-part-1"
}