{
  "title": "Masterpiece",
  "description": "This book is no longer available. Finalist for Best BDSM Romance of 2015 at the BDSM Writers Conference/NYC.\"Masterpiece is a book that should be on every BDSM lover’s bookshelf.\" Literary Nymphs Reviews - 5 Nymphs.\"5 Stars.\" ARe Cafe.\"This was the first book of this genre to give me a \"book hangover\" in a long time, and for that I commend the author...I had a hard time starting another book because I was still thinking about this one...Julianne was my favorite part of the book and there was emotional depth linked to her.\" Wicked Reads Book Reviews - 5 Stars.\"An intense, sexy and exhilarating read that we could not put down!!!!...Jillian’s development of [Nicolai and Julianne] is absolutely amazing and breathtaking...Did we mention that it was smokin’ hot, sexy and has some of the best ménage scenes we have read in a long, long time???\" Sassy Bitches Book Reviews - 5 Stars.Master. Lover. Submissive. Muse.When Julianne Giroux, an aspiring artist with a dark secret, apprentices with Nicolai Stavros in his Paris gallery, she finds far more than a passion for art. She finds herself. The masterful artist with forbidden tastes strips away her reserved veneer to reveal the daring, darkly passionate woman beneath and introduces her to the erotic world of The Order.A celebrated artist, an indulged heir, and a sexual Dominant, Nicolai has it all...except what he needs. In Julianne, he finds his muse. Nicolai crafts the ingénue into his living masterpiece and through the arduous process, finds himself re-created. With Julianne as his inspiration, Nicolai aspires to become something greater than he has been.But in an erotic world where powerful players enjoy dark games and buried secrets bite, new life comes at a painful price.Welcome to The Order, an elite and secret society of powerful brothers bound by social status and sexual tastes. Come. Play dark games with us.Publisher's Note: This book was previously released by another publisher, but it has been revised and re-edited in this edition.",
  "genres": [
    "BDSM",
    "Erotica",
    "Romance",
    "Contemporary",
    "Dark",
    "Menage",
    "M F Romance"
  ],
  "author": "Jillian Verne",
  "average_rating": "3.87",
  "url": "https://www.goodreads.com/book/show/26062791-masterpiece"
}