{
  "title": "First Gear: A Motorcycle Memoir",
  "description": "A powerful story of childhood physical, emotional and sexual abuse unrolls as the author, at age 50 and living with Multiple Sclerosis, rides her 2009 Harley-Davidson — named Thelma D. — from Ottawa to Winnipeg and back, with detours to northern Ontario and a detour into Quebec. During her ride through the stunning landscape of the Canadian Shield, she shares stories of her childhood growing up in the 1970s in the Ottawa Valley with her three brothers, a violent father and an alcoholic mother. Told with a frank openness and humour, First Gear is ultimately a story of courage, survival, and recovery.“A gritty and courageous story of one woman’s journey to make peace with her past. Powerfully written. A compelling read.”—Helen Numphreys, author of The Evening Chorus\"Told with searing honesty and peppered with vivid imagery, First Gear is a memoir that will leave you marvelling at Lorrie Jorgensen’s intelligence, generosity, and resilience. When I was a teenager, I read Zen and the Art of Motorcycle Maintenance, and learned much from it. And while Jorgensen’s tale is also a journey by bike, it goes far beyond the philosophical musings in Pirsig’s compelling work – because truth is, indeed, stranger than fiction. Stranger. Fiercer. And ultimately, much more forceful. long after I turned the last page, this memoir has stayed with me. I often find myself musing about Lorrie’s teachings – about family, wisdom, friendship, self-reliance, and survival.\"—Rena Upitis, Professor of Arts Education, Queen’s University and President, Wintergreen Studios\"First Gear is the memoir of writer Lorrie Jorgensen and her companion Thema D, a Dyna Super Glide Custom Harley-Davidson. These are their trials together through small town Ontario—it is both bike-lover's journey on asphalt and the three decades long retracing of tough youth spent in the Ottawa Valley. This is a fighter's tale of survival against abuse, her debilitating muscular disease, addiction and depression. First Gear is studded with good humour, kindness, and remarkable resilience. Readers will cheer Jorgensen on and laugh out loud. She finds love, reclaims her integrity and discovers a disconcerting truth that is both unexpected and painful. You will marvel at the crisp lucid language and—above all—the honesty of this document of persistence, and the courage it took to write it down.\"—Robin Collins\"This is a book about courage, about rising above circumstance and claiming your life as your own. First Gear is a first rate memoir about confronting the demons of the past and dealing with the vicissitudes of the present. At times, while reading the book, I wanted to rush in somehow and stop Lorrie from having to experience the nightmares that no one should have to go through. I really felt as if I got to know Lorrie, her wry humour, her skillful story telling and, as the story unfolded, so equally rose my respect and admiration. An inspiring read that tells you in no uncertain terms that it’s never too late to take charge of your life and travel down the road that you want to.\"— Lisa de Nikolits, author of A Glittering Chaos, The Witchdoctor's Bones, and Between the Cracks She Fell",
  "genres": [
    "Memoir"
  ],
  "author": "Lorrie Jorgensen",
  "average_rating": "4.92",
  "url": "https://www.goodreads.com/book/show/26058182-first-gear"
}