{
  "title": "Black Silent Majority: The Rockefeller Drug Laws and the Politics of Punishment",
  "description": "Often seen as a political sop to the racial fears of white voters, aggressive policing and draconian sentencing for illegal drug possession and related crimes have led to the imprisonment of millions of African Americans—far in excess of their representation in the population as a whole. Michael Javen Fortner shows in this eye-opening account that these punitive policies also enjoyed the support of many working-class and middle-class blacks, who were angry about decline and disorder in their communities. Black Silent Majority uncovers the role African Americans played in creating today’s system of mass incarceration.Current anti-drug policies are based on a set of controversial laws first adopted in New York in the early 1970s and championed by the state’s Republican governor, Nelson Rockefeller. Fortner traces how many blacks in New York came to believe that the rehabilitation-focused liberal policies of the 1960s had failed. Faced with economic malaise and rising rates of addiction and crime, they blamed addicts and pushers. By 1973, the outcry from grassroots activists and civic leaders in Harlem calling for drastic measures presented Rockefeller with a welcome opportunity to crack down on crime and boost his political career. New York became the first state to mandate long prison sentences for selling or possessing narcotics.Black Silent Majority lays bare the tangled roots of a pernicious system. America’s drug policies, while in part a manifestation of the conservative movement, are also a product of black America’s confrontation with crime and chaos in its own neighborhoods.",
  "genres": [
    "History",
    "Race",
    "Nonfiction",
    "Politics",
    "Crime",
    "American History",
    "Sociology"
  ],
  "author": "Michael Javen Fortner",
  "average_rating": "3.94",
  "url": "https://www.goodreads.com/book/show/26065570-black-silent-majority"
}