{
  "title": "Interference",
  "description": "“Sophia Henry tackles real issues that tug at your heartstrings,” raves bestselling author Rachel Harris. Now, in this sweet, sensual Pilots Hockey novel, a young single mom falls for a damaged coach pulling double duty as a cop.   Linden Meadows doesn’t back down from anyone, especially if her family’s involved. So when her little brother’s new hockey coach benches him in the middle of a game, Linden lets him have it. She also notices that the coach is way hotter than she expects, but Linden won’t let herself get burned by another athlete. Been there, done that—and had a kid at seventeen to show for it.   When Jason Taylor isn’t taking abuse from hockey moms, he’s patrolling the streets as a member of the Bridgeland PD. After Jason pulls Linden over for speeding, he begins to see that there’s more to her than a big mouth . . . or a lead foot. Their chemistry leads to good company, intense conversation, and an intimacy that pushes beyond the boundaries of friendship. And yet Linden’s decision to keep her now three-year-old son, Holden, is a painful reminder to Jason that his own mother gave him up for adoption.   Linden’s sure she’s found the man to round out their family. But when Holden’s deadbeat dad forces his way back into the picture, Jason starts to back off. He needs time—to heal, to grow, and to love with all his heart.   Praise for Sophia Henry’s Delayed Penalty \n \n “Delayed Penalty is sexy, fun, and full of angst. Not only does Aleksandr dominate the ice, but he fights for what he wants outside of the rink as well. Will definitely read again!”—New York Times bestselling author L. P. Dover   “Delayed Penalty is such a rush! Everything I love about the New Adult genre is right a captivating premise, a fresh new setting, and a scorching hot hero who constantly keeps you guessing. The romance is off the charts and Sophia Henry tackles real issues that tug at your heartstrings.”—New York Times bestselling author Rachel Harris   “Hot Russian hockey player meets feisty tutor? Yes, please! I loved watching Aleksandr and Auden work through their broken pasts together. Delayed Penalty is a unique New Adult romance that packs an emotional punch.”—Cindi Madsen, USA Today bestselling author of Getting Lucky Number Seven    “Auden and her hot Russian hockey god, Aleksandr, really heat up the pages in Delayed Penalty—a touching story about growing up, moving forward, and ultimately finding love.”—Renita Pizzitola, author of Just a Little Kiss   “Henry’s debut novel evokes the image of a culture characterized by a stoic exterior, only to reveal deep love as the characters dissolve their emotional walls from the inside out. [Readers] looking for heartfelt romance will feel the warmth emanating from this page-turner.”—Library Journal",
  "genres": [
    "Sports",
    "Romance",
    "Hockey",
    "Sports Romance",
    "Contemporary Romance",
    "New Adult",
    "Fiction"
  ],
  "author": "Sophia Henry",
  "average_rating": "3.86",
  "url": "https://www.goodreads.com/book/show/26067202-interference"
}