{
  "title": "The Agony House",
  "description": "A New Orleans haunted house, a killer ghost, and a long-lost comic book come to life in this blend of mystery and comics by the author of I Am Princess X.Denise Farber has just moved back to New Orleans with her mom and stepdad. They left in the wake of Hurricane Katrina and have finally returned, wagering the last of their family's money on fixing up an old, rundown house and converting it to a bed and breakfast.Nothing seems to work around the place, which doesn't seem to weird to Denise. The unexplained noises are a little more out of the ordinary, but again, nothing too unusual. But when floors collapse, deadly objects rain down, and she hears creepy voices, it's clear to Denise that something more sinister lurks hidden here.Answers may lie in an old comic book Denise finds concealed in the abandoned the lost final project of a famous artist who disappeared in the 1950s. Denise isn't budging from her new home, so she must unravel the mystery--on the pages and off them--if she and her family are to survive . . .Open this book and dare to enter The Agony House, another spectacular mix of novel and comics form Cherie Priest.Praise for The Agony House\"Priest pairs with O'Connor to neatly weave together the history of comic books and contemporary concerns about gentrification into an eerie ghost story set in a ramshackle house that's as much a character as the people living in it . . . At its heart, though, this is a ghost story, and Priest excels at building palpable atmosphere . . . Dynamic characters and a surprising mystery round out this sharp, satisfying, and engrossingly spooky story.\" --Booklist, starred review\"Priest ably weaves contemporary issues and a feminist strand into this fantasy . . . A wonderfully melodramatic climax . . . Conflicts, ectoplasmic and otherwise, laid to rest in a deliciously creepy setting.\" --Kirkus Reviews",
  "genres": [
    "Horror",
    "Young Adult",
    "Graphic Novels",
    "Mystery",
    "Paranormal",
    "Supernatural",
    "Ghosts"
  ],
  "author": "Cherie Priest",
  "average_rating": "3.66",
  "url": "https://www.goodreads.com/book/show/26067820-the-agony-house"
}