{
  "title": "The 'N' Word",
  "description": "WARNING: This book is adult in nature. It is for mature audiences only.PLEASE NOTE: This is the FIRST book of a two-book series. The second book, \"Word of Honor\" is being released at the exact same time, and is also available NOW. They can be purchased together. Thank you.They say there are two sides to a story. And two sides to every man… Aaron Pike is one of those men. Aaron is a white nationalist, a Commander in the organization and Nazi who grew up in Frisco City and Gordon, Alabama. He considers himself an activist and purist for the white race in America and offers no pretenses or excuses for his controversial views, affiliations, machinations, and sometimes violent behavior. Despite the common theory or belief that the majority of white supremacists are void of any aptitude and acumen, Aaron is not only intelligent, but also sometimes charming, witty, and funny. He has the power to disturb and fluster with merely a look. Much to no one’s surprise, including his own, he ends up in the prison system, serving a stint for beating a man nearly to death in what is perceived as a racially driven assault. While serving his term, the recidivist Aaron believes as he's always done that he will serve his time and be right back out on the front lines of the movement. However, fate ushers him down a different path altogether… A new prison psychiatrist is assigned to Holman Correctional Facility, and Mr. Pike is forced to delve deep and discuss in detail situations regarding not only his tumultuous past, but his not so clear future. …And the future holds a strong desire to meet a woman he is not only compatible with but one he is determined to make his wife… Mia Armstrong is an elementary schoolteacher from a conservative, Christian background. She also volunteers at the prison, and is asked to help spread the word about a prison pen pal program. In that process, she runs into Aaron, and before long, the two hit it off. Only there is one problem… Mia Armstrong is African American. The two forge an alliance and that friendship flourishes into pure, unadulterated love. How will Aaron deal with the truth of his feelings? Can he force himself to hate a woman he adores and loves based on her race alone? Will Mia be able to stay by his side after discovering the darker edge of the man she’s fallen helplessly in love with? Will she be able to offer forgiveness and redemption or will she turn her back on a lost soul who is used to not giving love, or receiving it?Step inside of this explosive novel, ‘The ‘N’ Word’, to find out how this story of unlikely love unfolds.",
  "genres": [
    "Interracial Romance",
    "Romance",
    "Contemporary",
    "Dark",
    "Contemporary Romance",
    "Dark Romance",
    "Fiction"
  ],
  "author": "Tiana Laveen",
  "average_rating": "4.22",
  "url": "https://www.goodreads.com/book/show/26069114-the-n-word"
}