{
  "title": "A Roman Holiday",
  "description": "This is the third book in the Art Historian Superhero series. In Summer of 71 you were introduced to Max DuPont, a young American who spends his summers in Rome, split between two continents and shared by divorced parents. That summer Max had the romance of his life and was introduced to the mysteries of women by Molly, the dream lover of any young man, a down on her luck actress and model ten years his elder. Theirs was a romance which defined who they were and who they were to become. Seven years later, in my second novel, Great Caesar’s Ghost, Max found himself again in Rome, this time an adult, working on the curatorial staff of the Metropolitan Museum of Art. Together with his father Edward, an American archaeologist, Max discovered a long lost treasure, the personal artifacts of Gaius Julius Caesar. Amongst the relics was a ring which had the ability, when worn by one of Caesar’s descendants, to transport the bearer to any time and place. Max started his journey to uncover the past and ultimately to visit with Caesar himself. Waking from her near-death experience, having survived the sinking of the Titanic, Sarah Goldsmith (Sally) saves Max and accompanies him in his travels. Brilliant and resourceful, a Harvard educated art historian, she awakens from a frightening era of anti-Semitism to champion the fight against injustice, intolerance and barbarity in all its forms. A natural feminist, Sally finds her match in Max, and two lonely lives come together as one. This third novel in the series takes the time travelers from the modern world to the ancient past. Travel with them to California in the year 2050 to gather together their team and to New York in 1980 where Max lives his current life. Visit Studio 54, the court of Theodoric the Ostrogoth in Rome in 494 AD, and be present at the epic battle of Alesia where Caesar battles the Gauls in 52 BC. Ultimately a love story and also a tale of discovery and self-awareness, join Max as he sheds the loneliness he has endured since his teenage years and finds the girl of his dreams who travels at his side. Then be prepared to admit within your circle one of the strongest and most attractive characters I’ve written…Ambrosia, a combined product of Apple and Google, and the most capable heroine in this series. These are all adult books. They are written for a mature audience, suffused with observations of history, art history, Roman culture, contemporary New York, and many other locations. They are also a story of attraction, commitment, discovery and self-awareness, loss of innocence, coming of age, love and lust. They are often erotic but always loving, respectful of both genders, upbeat and satisfying. Although adult themes abound, they do not dominate, and these books are romantic time-travel historical fiction first and erotic adventures second. Come along for the journey in this sequel to Great Caesar’s Ghost.",
  "genres": [],
  "author": "Rebecca Branch",
  "average_rating": "4.71",
  "url": "https://www.goodreads.com/book/show/26069808-a-roman-holiday"
}