{
  "title": "Behind the Mask",
  "description": "Board Resolution By Joey W. HillSavannah was groomed from birth to take the reins of her father's manufacturing empire. Her emotional armor is as tough as the steel used in her factories, and nobody is allowed past it. Business partner Matt realizes that the key to entry is to command her submission. Calling on the unique sensual talents of his four-man management team, he engineers an aggressive and erotic takeover, determined to rescue the woman he's loved from the steel cage she's manufactured around her heart. Masked and lost to the sensations the team arouses in her, Savannah is theirs, at least for this one night.Hidden Desires By Elizabeth LapthorneLily had to admit she was desperate. Here she was in New Orleans on a two week vacation, she made the trip especially for the Mardi Gras, and she didn't have a mask! Everything she found seemed wrong.As a last ditch effort, she entered a small shop and found the perfect mask…until it showed her visions of herself getting ravished by a masked highwayman.But when that highwayman turned up at the Mardi Gras bash, she knows the chemistry between them could only lead to one place.The only things between them that remained hidden were their true desires.Mardi Gras By Lacey AlexanderMia Sanderson has been in love with her boss, Ty Brewer, for years, but ladies' man Ty only sees her as a friend and even worse, a good girl. So when Mia and Ty are invited to the same Mardi Gras party, Mia decides to live out a fantasy. Donning a Mardi Gras mask and wig, Mia masquerades as the seductive Mistress Mina, the bad girl of Ty's dreams. But what will happen if Ty discovers her true identity? Mina's risking their friendship and her job, but for a night with Ty, it's worth it.",
  "genres": [
    "BDSM",
    "Erotica",
    "Romance",
    "Erotic Romance",
    "Anthologies",
    "Menage",
    "Contemporary"
  ],
  "author": "Joey W. Hill",
  "average_rating": "4.05",
  "url": "https://www.goodreads.com/book/show/260662.Behind_the_Mask"
}