{
  "title": "Evanthia's Gift",
  "description": "Sophia Giannakos will settle for nothing less than the rare love her parents share. At a tender and impressionable age, she has found her soul mate in Dean, the boy she has known her whole life -- until secrets and deceptions pull them apart. No stranger to heartache, Anastacia, Sophia's mother, attempts to comfort her without revealing ugly family truths that could haunt her daughter's future.In the year 1956, Anastacia, a former NYU student, finds herself in the challenging role of a single parent. Left with emotional wounds from a bad marriage, she is reluctant to trust and resists her growing feelings for Alexandros, an old acquaintance. But his persistence and unconditional love for Ana and her child is eventually rewarded, and his love is returned. In a misguided but well-intentioned effort to protect the ones they love, both Ana and Alex keep secrets -- ones that could threaten the delicate balance of their family. The story continues in the 1970s, as their daughter attempts to negotiate between two cultures. Greek-American teenagers, Sophia and Dean, have shared a special connection since childhood. Although their desire for one another is undeniable, Dean resists her, rebelling against the pressure his father places on him to uphold his Greek heritage. When he can no longer fight his feelings, Dean asks Sophia to conceal their love. She hesitantly complies until it becomes too much for her. Like her mother, Sophia loves with every fiber of her soul, leaving her shattered when Dean pulls away from his family, culture, and ultimately his love for her, leaving her no choice but to find a life different than the one she'd hoped for. Evanthia's Gift is a multigenerational love story spanning fifty years and across two continents, chronicling the lives that unify two families.",
  "genres": [
    "Romance",
    "Audiobook",
    "Historical Fiction",
    "Fiction",
    "Amazon",
    "Contemporary",
    "Family"
  ],
  "author": "Effie Kammenou",
  "average_rating": "4.39",
  "url": "https://www.goodreads.com/book/show/26069535-evanthia-s-gift"
}