{
  "title": "Nanjing: The Burning City",
  "description": "After the bombs fell and shook the walls of Nanjing, the Imperial Japanese Army entered and seized the Chinese capital. Through the dust of the demolished buildings, screams echo off the rubble. Two abandoned Chinese soldiers are trapped and desperately outnumbered inside the walled city. What they'll encounter will haunt them. But in the face of horror, they'll learn that resistance and bravery cannot be destroyed by the enemy.Ethan Young (Tails) delves into World War II's forgotten tragedy, the devastating Japanese invasion of Nanjing, and tells a heart-wrenching tale of war, loss, and defiance. Beautifully illustrated in black and white.\"In Nanjing, cartoonist Ethan Young tells an intimate story against an epic landscape. Bold, heart-breaking, and gorgeously rendered.\" —Eisner and Printz Award-winner Gene Luen Yang (Boxers & Saints, American Born Chinese)\"Young’s decision not to glorify violence or titillate the reader in any way avoids a common pitfall and heightens the drama. This is stunning, stirring historical fiction by a creator at the height of his craft.\" (Starred review) —Publishers Weekly\"Young’s is just one chapter in an overwhelmingly grievous episode of the 20th century. The specifics might be fictional amidst a historical backdrop, but in creating names, depicting individual faces both living and dead, Young conjures a haunting microcosm amidst a horrifying event of epic proportions.\" —Smithsonian APAC Bookdragon\"Nanjing: The Burning City deserves a spot alongside not only historical comics, but wartime prose and non-fiction as well. It’s not often that an author can so skillfully evoke powerful emotion while telling a complex and long-forgotten story and this book is an excellent, necessary addition to the genre.\" —The A.V. Club\"Haunting and powerful, Nanjing is a moving tribute to an event which needs to be remembered, as much as we'd like to forget it.\" —Eisner and Harvey Award-winning author Derek Kirk Kim (Same Difference, Tune)\"Young's expressive, thoughtful line work takes full advantage of comics' power. Nanjing reads effortlessly while begging the eyes to savor each page. A triumph at the very soul of the medium, a perfect marriage of Toth and Tatsumi.\" —Eisner Award-winning writer/artist Nate Powell (March, Swallow Me Whole)",
  "genres": [
    "Graphic Novels",
    "Comics",
    "Historical Fiction",
    "War",
    "China",
    "Historical",
    "Fiction"
  ],
  "author": "Ethan Young",
  "average_rating": "3.83",
  "url": "https://www.goodreads.com/book/show/26067680-nanjing"
}