{
  "title": "Sherpa's Adventure: Destroying the Hologram",
  "description": "2014 Indie Excellence Finalist, and the sequel to the award winning Sherpa’s Saving the Future. Sixteen year old Sherpa returned home to the year 2310 exhausted from her time travel adventures helping historical figures including Amelia Earhart, John Lennon and Neil Armstrong when they were kids about to make a mistake that would change the course of history. She just wanted to kick back, relax with her BFF Amy and collaborate with Professor Lester T. Chester on making the National Museum’s Road of Life exhibit an extraordinary experience. However, the future Chancellor of Positivity for the Western World is about to find out her plans have changed . . . big time. Spies in the Intelligence Agency have learned a deadly Hologram has been hidden for the past sixteen years in an attempt to protect Earth—by Sherpa’s father! General Alphoneous Aveel stored the ultimate evil in that Hologram; the DNA of the most horrific dictators and murderers in all of history and plans to use that DNA to create a ruthless HuBot army. There is no doubt it has the potential to destroy civilization across the millennium. Aveel is desperate to get his Hologram back, and the stakes have never been higher. Lillian, Ruler of the Western World once again is forced to send her daughter back into danger. Sherpa’s boyfriend, the brilliant and gorgeous surfer / scientist Dr. Lichtenstein, created the Reality Tracking Devise (RTD) that allows her to time travel safely back to the twenty-first century. There she recruits her friends, Emma Johnson and Jose Ramirez, to again help her save the future. Using her ingenuity and every ounce of courage she can muster, Sherpa races against the clock, bullies, and transfiguring HuBots to find the father she has never met and save the Earth from impending disaster!",
  "genres": [],
  "author": "Lori Costew",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/26071501-sherpa-s-adventure"
}