{
  "title": "And After the Fire",
  "description": "AND AFTER THE FIRE has received the inaugural Book Club Award of the 2016 National Jewish Book Awards.The New York Times-bestselling author of A Fierce Radiance and City of Light returns with a new powerful and passionate novel—inspired by historical events—about two women, one European and one American, and the mysterious choral masterpiece by Johann Sebastian Bach that changes both their lives.In the ruins of Germany in 1945, at the end of World War II, American soldier Henry Sachs takes a souvenir, an old music manuscript, from a seemingly deserted mansion and mistakenly kills the girl who tries to stop him.In America in 2010, Henry’s niece, Susanna Kessler, struggles to rebuild her life after she experiences a devastating act of violence on the streets of New York City. When Henry dies soon after, she uncovers the long-hidden music manuscript. She becomes determined to discover what it is and to return it to its rightful owner, a journey that will challenge her preconceptions about herself and her family’s history—and also offer her an opportunity to finally make peace with the past.In Berlin, Germany, in 1783, amid the city’s glittering salons where aristocrats and commoners, Christians and Jews, mingle freely despite simmering anti-Semitism, Sara Itzig Levy, a renowned musician, conceals the manuscript of an anti-Jewish cantata by Johann Sebastian Bach, an unsettling gift to her from Bach’s son, her teacher. This work and its disturbing message will haunt Sara and her family for generations to come.Interweaving the stories of Susanna and Sara, and their families, And After the Fire traverses over two hundred years of history, from the eighteenth century through the Holocaust and into today, seamlessly melding past and present, real and imagined. Lauren Belfer’s deeply researched, evocative, and compelling narrative resonates with emotion and immediacy.",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Music",
    "Holocaust",
    "Historical",
    "Jewish",
    "World War II"
  ],
  "author": "Lauren Belfer",
  "average_rating": "3.92",
  "url": "https://www.goodreads.com/book/show/26074206-and-after-the-fire"
}