{
  "title": "Bellarion: The Fortunate",
  "description": "Bellarion, a young man set on joining the priesthood, is diverted from his calling to serve the Princess Valeria. He remains with her for five years, serving her faithfully despite her cold response. Yet when the time comes for him to leave, they both find that the passion and romance of Italy has left its mark…  The Author: Rafael Sabatini was born on 29 April 1875 in Jesi, Italy, the only son of Maestro-Cavaliere Vincenzo Sabatini and his English wife, Anna Trafford, both of whom were opera singers. He was first educated in Zug, Switzerland, and then in Portugal, but finally settled in England where he married Ruth Dixon (from whom he was divorced in 1932) and became a British citizen in 1918, having worked in War Office intelligence during the First World War.  His first novel, The Tavern Knight, was published in 1904, and more novels followed before his first major success The Sea Hawk which was published just after the start of the war. This then led to renewed interest in his earlier novels and assured Sabatini an ardent and loyal following.  The majority of his novels are based upon events in European history, and many started out as short stories first published in popular magazines before expansion into full length works. Sabatini also produced two notable historic works, The Life of Cesare Borgia (1912), and Torquemada and the Spanish Inquisition (1913), which have been justly praised for being both comprehensive and definitive.  He touched on biography further in Heroic Lives (1934) in which he drew away from full life stories so as to concentrate on the circumstances and mind sets of the individuals studied in a determination of what made them into heroes touching the lives of others as they did. In The Historical Nights' Entertainments (1918, 1919, and 1938), which is now combined into a single volume, he investigated numerous historical controversies and further delved into the personalities of selected historical figures.  It is Sabatini's deep knowledge of history and his determination to ensure accuracy where facts were stated even within his fictional works, as to customs, politics, religion, together with ordinary everyday human behaviour in context that ensures his books maintain enduring popularity. He covered many periods, but revolutionary France and Renaissance Italy appear most often, with Cesare Borgia making more than one appearance.  Many of Sabatini's works were turned into films, notably Captain Blood, Scaramouche, and The Black Swan, and this ensured immense popular success. It was, however, sometimes at the expense of the opinions of some critics who regarded his genre, fundamentally historic and romantic fiction, as a little outside of that ought to be of merit. Many fellow authors admired the manner in which he constructed his plots and his narrative. In particular, they and his army of readers fully appreciated the way his characters were life-like and convincing, and true to historical form.  In 1935 Sabatini married again, and he and his new wife, Christine, moved to Herefordshire. Fishing the local River Wye was one of his hobbies, but far from 'retiring' to the country he maintained all of his links with the publishing world in London.  Raphael Sabatini died in 1950 following a skiing accident in Switzerland.",
  "genres": [
    "Historical Fiction",
    "Classics",
    "Adventure",
    "Fiction",
    "Swashbuckling",
    "Novels",
    "British Literature"
  ],
  "author": "Rafael Sabatini",
  "average_rating": "4.23",
  "url": "https://www.goodreads.com/book/show/26074362-bellarion"
}