{
  "title": "The Fragrance of Surrender: Inspirational Women's Fiction",
  "description": "What would cause a woman to stand on the edge of a cliff deciding whether to slip over it or to live another day?How bad would it have to be?And what if she can't turn to God because she believes He’s the root of all her problems? Set among the fragrant sweet smell of ripening orange tree blossoms, this emotional story is about a woman who battles God for the right to determine how things should be. Gabriella’s life has been filled with tragedy, including the mystery of why her own parents disappeared one night, leaving her alone at a tender young age. Soon after her husband dies, she and her son move to her childhood home—a house on a cliff by the sea in a village that time has left behind. It’s there that she and some local villagers begin the process of bringing her parent’s old orange grove back to life.As Gabriella begins to put together the pieces of why her parents abandoned her, she soon learns they were victims of powerful forces that threatened to tear apart the quiet little village by the sea. And that knowledge, along with all the other losses she’s experienced, causes Gabriella to view God with great suspicion and fear. So when her young son experiences a dramatic conversion and begins to serve Him, an all-out battle ensues.During this time, Gabriella often feels called to the edge of the cliff, torn between letting herself slip over it and ending the pain, or fighting for a happiness she’s not even sure exists. Will Gabriella continue to do battle with God? Or will she come to have faith in the God she blames for all the tragedies she’s suffered? And what role will her young son play in her decision?This book considers questions like: What happens when God doesn’t act like we think He should? And Can someone who has experienced so much pain and disappointment ever really let go of the hurt and learn to trust Him?>>>>Reader Reviews:“Seriously....love it!! Wish I could read at work!! ““Oh my gosh, Gabriella kept me up all night!”Watch for Book 2 in this Series: A Leap of Faith – Available for pre-order February 8, 2016",
  "genres": [
    "Fiction",
    "Christian Fiction"
  ],
  "author": "April Geremia",
  "average_rating": "4.32",
  "url": "https://www.goodreads.com/book/show/26074921-the-fragrance-of-surrender"
}