{
  "title": "The Courtship Maneuver, Book 1",
  "description": "Introducing The Courtship Maneuver, the hot and sexy new series by Alexa Wilder! Chloe Henson is in love with her boss. Completely, totally, head over heels in love. She knows he doesn't feel the same way - she doesn't expect him too. Sam Logan is successful and wealthy, and he only dates supermodels. When he could have any woman in Las Vegas, why would he want his shy, abundantly curvy assistant? Determined to ignore her heart, Chloe puts her feelings on hold. But when her brother disappears, and she ends up in the cross-hairs of the Russian mob, she has nowhere to turn. Except to Sam.  Sam Logan has a problem. He has a thing for his assistant, but he knows he can't act on it. Chloe's the best assistant he's ever had, and over the three years they've worked together, she's become his best friend. Chloe is so shy, he knows one wrong move will send her running. When her irresponsible brother rips off a mob boss and vanishes, Chloe is in danger, and Sam's tired of waiting to make his move. The best way to keep her safe is to make her his. But with bullets flying and betrayal around every corner, can Sam convince Chloe that this is more than just a fling? **This hot and steamy alpha billionaire romance is perfect for fans of Hannah Ford, Lila Monroe, Cassie Cross and J.S. Scott**  The Courtship Maneuver is a serial romance in three parts. All parts are complete and the release schedule will be as follows: Book One: August 10th, 2015 Book Two: August 18th, 2015 Book Three: August 25th, 2015 BOOK ONE EXCERPT: Sam groaned deep in his chest and began to move, backing me into the wall without breaking the kiss. I kept my grip on his hair, loving the feeling of his head in my hands as his mouth fed from mine in kiss after drugging kiss. His hands were everywhere, stroking my back, my sides, untucking my blouse and sliding beneath to brand my bare skin with trails of heat. When his palm rose to graze the side of my breast, I whimpered. Like a shot, he was gone, stepping back, dropping his hands and shoving them in the back pockets of his jeans. “Sleep well,” he said as if he hadn’t just been holding me to the wall kissing the life out of me. “If you need anything, I’m right across the hall.” With that, he left. I stood there, leaning against the wall for a long minute before going to the bathroom to change into his t-shirt. I got into his bed, surrounded by his scent and tried to fall asleep, my head spinning from his kiss. What had that been about? I’d never had any idea Sam might want to kiss me. I’d dreamed about it, but I hadn’t imagined those dreams might ever come true. Not that they had, really. In my dreams he didn’t kiss me breathless and then walk away.",
  "genres": [],
  "author": "Alexa Wilder",
  "average_rating": "3.95",
  "url": "https://www.goodreads.com/book/show/26071939-the-courtship-maneuver-book-1"
}