{
  "title": "Lies My Teacher Told Me: Swastikas, Nazis, Pledge of Allegiance Lies Exposed by Rex Curry and Francis & Edward Bellamy",
  "description": "Lies are exposed to reveal the following: The Nazi salute was performed by public officials in the USA from 1892 through 1942. What happened to the photographs and films of the American Nazi salute performed by federal, state, county, and local officials? Those photos and films are rare because people don't want to know the truth. Public officials in the USA who preceded the German socialist (Hitler) and the Italian socialist (Mussolini) were sources for the stiff-armed salute (and robotic chanting) in those countries and other foreign countries.Explore how the \"ancient Roman salute\" myth originated from the city of Rome in the state of New York (not Italy), Francis Bellamy's hometown. Learn about Mussolini's strange gift to the city of Rome, NY: a statue of two human male infants suckling on a female wolf. That statue remains on display in Rome, NY. Learn how the word \"fascist\" is related to the word \"faggot.\"Discover how the military salute was the origin of the Nazi salute.Read why the Pledge of Allegiance would not be performed by anyone (other than kooks ) if the truth were taught in school.Find out who you are, what you are, and how you got to be that way. Also learn who you should blame: your teacher (and the government's schools).Debunk myths about Adolf Hitler, Joseph Stalin, Mao Zedong, Francis Bellamy (and his cousin Edward Bellamy), Fascism, Unionism, Socialism, genocide, swastikas, the Pledge of Allegiance to the flag, the cliche' \"under God,\" Christianity, ancient Rome, military socialism, crony socialism, and the military-socialism complex.The Pointer Institute proudly presents another news-breaking volume from the Dead Writers Club (DWC) and Micky Barnetti. Lies your teacher taught you are illuminated from the work of the historian Dr. Rex Curry. Micky Barnetti is a philologist and a forensic fraud analyst. Barnetti's work led to the arrest, trial, conviction, and imprisonment of America's Dumbest Criminals (and the foreclosure of their homes, along with victim restitution liens, and criminal forfeiture judgments, in amounts totaling millions of dollars).Barnetti collaborates with the Dead Writer's Club (“DWC” -an author's group) and assists the Pointer Institute for Media Studies to provide remedial education to journalists about history, economics, and government.",
  "genres": [
    "Nonfiction"
  ],
  "author": "Micky Barnetti",
  "average_rating": "2.90",
  "url": "https://www.goodreads.com/book/show/26071209-lies-my-teacher-told-me"
}