{
  "title": "The Truthseeker",
  "description": "This story details your personal journey, through a strange and dangerous pocket-limbo, as recounted by a mysterious narrator that doesn't reveal him or herself until the very end. Into this harrowing, long-forgotten world you are thrust, encountering maniacal rulers, living nightmares, demons, sardonic inanimate objects and, ultimately, the hero you were always destined to become and forget.Your adventure starts standing within an oversized, mist-filled, bloody womb and a tall, floating mirror sent by way of invitation. The acceptance of this invitation nearly leads you to your second, and final death, at the hands of a woman you would later come to know as The Goddess. Fortunately, a mysterious nightmare entity makes the fateful decision that you may be the key to stopping her insidious plans once and for all, the eradication of all humanity on earth; the motivations fueling her vicious aim are revealed by the time the story concludes.This dark benefactor, you eventually come to know as Stalker, absconds you to a cozy living room setting and quickly begins a more careful study of you, in which your previous life's demise is revealed and your truthseeker and shape shifting abilities are uncovered; throughout this process, you learn that his race is the embodiment of all nightmares by the “higher lifeforms” of earth. Sadly, your how-to-survive session is short lived as demons, in the employ of The Goddess, tear through surrounding portals assailing both of you and knocking you unconscious. You awaken next to a dying Stalker, encircled by mirror portals, within a surreal stonehenge structure. As his final pieces of guidance are offered you, you once again find yourself alone with more questions than answers, and an after-world with a myriad of possibilities.",
  "genres": [
    "Fantasy"
  ],
  "author": "Eric Stockwell",
  "average_rating": "4.78",
  "url": "https://www.goodreads.com/book/show/26081331-the-truthseeker"
}