{
  "title": "Murder is Dicey",
  "description": "“Far superior . . . this uniquely capricious mystery will engage readers from the very first page to the surprising conclusion.” —Publishers Weekly  Welcome to Serenity Cove, a peaceful Southern community where the residents like to play dice, play golf and, when foul play moves in, play detective.  Kate McCall is an avid fan of detective shows and mysteries. And while she’s always looking for a whiff of trouble, the truth is that she and her friends in the close-knit community of Serenity Cove are more likely to cause it than to find it. But whether it’s their lively, sometimes rowdy bunco dice games or a trip out to the local watering hole, it’s always good fun. Until the round of golf that leads them to the discovery of a dismembered limb—and the realization that three of their friends are missing.  With the local sheriff stumped for clues and the list of suspects growing, Kate decides to roll the dice and try a little sleuthing on her own. But when another body part shows up, this dedicated fan of mysteries knows the odds are stacked against her.  Relying on her new detective kit, her natural curiosity, and a flare for unearthing clues, Kate has to gamble that she can catch a killer before more heads roll.  This book was originally published under the title Whack ’n’ Roll.  About the Author:  Friends often accuse Gail Oust of flunking retirement. While working as a nurse/vascular technologist, Gail penned nine historical romances under the pseudonym Elizabeth Turner for Avon, Pocket, Berkley, and Kensington. It wasn’t until after she and her husband retired to South Carolina that inspiration struck for a mystery. Hearing the words “maybe it’s a dead body” while golfing with friends fired her imagination for this series. Gail is currently writing the Spice Shop Mysteries for Minotaur/St. Martin’s. When she isn’t reading, writing, or sleeping, she can usually be found on the golf course or hanging out with friends.",
  "genres": [
    "Mystery",
    "Cozy Mystery",
    "Collections"
  ],
  "author": "Gail Oust",
  "average_rating": "3.51",
  "url": "https://www.goodreads.com/book/show/26078217-murder-is-dicey"
}