{
  "title": "The Type-Writer Girl",
  "description": "Juliet Appleton is an officer’s daughter who is forced to make her own way in the world after her father’s death. Having been trained in typewriting and shorthand, she obtains employment at a law office, only to find that she cannot bear to work with her unpleasant colleagues and employer. Juliet possesses some of the characteristics of the infamous \"New Woman\": she has attended Girton College, she smokes cigarettes, and she travels the countryside on her bicycle. After various adventures, Juliet finds a new opportunity as a type-writer girl for a publishing company. She falls in love with her employer, and he with her, but complications inevitably ensue. At the end of the nineteenth century, the Canadian-born Grant Allen was a prolific professional author of popular science texts on evolution as well as a fiction writer. The Type-Writer Girl (1897) is one of only two novels he wrote under a female pseudonym, possibly to lend credibility to his first-person female narrator. The Type-Writer Girl invokes tensions typical of the fin de siècle concerning evolution, technology, and the role of women. This Broadview edition provides a reliable text at a very reasonable price. It contains textual notes but no appendices.Excerpt: ... THE TYPEWRITER .GIRL, Chapter' i: INTRODUCES A LATTER-DAY HEROINE. I Was twenty-two, and without employment. I would not say by this that I was without occupation. In the world in which we live, set with daisies and kingfishers and undeciphered faces of men and women, I doubt I could be at a loss for something to occupy me. A swallow's back, as he turns in the sunshine, is so full of meaning. If you dwell in the country, you need but pin on a hat and slip out into a meadow, and there, in some bight of the hedgerow, you shall see spring buds untwisting, sulphur butterflies coquetting; hear nightingales sing as they sang to Keats, and streamlets make madrigal as they wimpled for Marlowe. Nay, even Lhere m London, where life is rarer, how can I cruise down the Strand without encountering strange barks--mysterious argosies that attract and intrigue me? That living stream is so marvelous! Whence come they, these shadows, and whither do they go?--innumerable, silent, each wrapped in his own thought, yet each real to himself as I to my heart. To me, they are shooting stars, phantoms that flash athwart .the, bribit of my life one second, and .then.vanish.-. But io themselves they are the: ceirCre of *a Wdrld--of the world; and I am but one of the meteors that dart across their horizon. I cannot choose but wonder who each is, and why he is here. For one after another I invent a story. It may not be the true story, but at least it amuses me. Every morning I see them stream in from the Unknown, by the early 1 rains, and disperse like sparks that twinkle on the thin soot of the chimney-back--men with small black bags, bound for mysterious offices. What happens in those offices I have no idea: they may lend money, or buy shares, or...",
  "genres": [
    "Fiction",
    "Classics",
    "19th Century",
    "Historical",
    "Victorian",
    "International"
  ],
  "author": "Olive Pratt Rayner",
  "average_rating": "3.36",
  "url": "https://www.goodreads.com/book/show/2608500-the-type-writer-girl"
}