{
  "title": "The House of Dr. Edwardes",
  "description": "The single most striking quality of Francis Beeding's 'The House of Doctor Edwardes' is the sense of foreboding and uncertainty that pervades every scene, the hallmarks of many great mystery. From the very first page of the prologue, Beeding makes the very air the characters live and breathe in seem to crackle with an ominous electricity. It is surely what appealed to Alfred Hitchcock when he found in Beeding's work the inspiration for his classic, unforgettable film, 'Spellbound'.Fans of Hitchcock will want to take special notice of 'The House of Dr. Edwardes', for, unlike other adaptations, 'Spellbound' strays rather dramatically from its source material. Not only do the differences offer fascinating peeks into the great director's creative vision, they also ensure that even Hitchcock fans familiar with 'Spellbound' will find much in Beeding?s novel that will surprise and delight. The \"house\" of the title is in fact a lunatic asylum in France, and Dr. Edwardes is the head psychiatrist and presiding genius there. And although he is a highly esteemed, almost iconic figure in psychiatric circles, there is something clearly amiss. The novel opens with a puzzling, ominous episode in which a patient being transported to the asylum grows agitated as the car bringing him there approaches its destination. He suddenly screams \"the gorge of the devil\" and attacks and kills one of his supervisors. On the heels of this terrible and inauspicious arrival is another newcomer to the asylum, Dr. Constance Sedgwick. A promising but inexperienced psychiatrist, Dr. Sedgwick accepts a position on Dr. Edwardes' staff to learn at the feet of the great man. But she arrives to discover that Dr. Edwardes has taken a leave of absence to calm his nerves, and it does not take her long to discover that the house is hardly in order. It is probably evident from just that short description that this work has much to say about madness, power and terror. What is interesting is the two very different paths taken by two very different artists-Beeding and Hitchcock-to best give life to these ideas. Hitchcock, as any fan of Spellbound knows, borrowed heavily from Freudian psychoanalysis and its emphasis on dreams, repression and desire. Salvador Dali's surrealistic interpolations serve as vivid illustrations of the irrational throughout the movie. Beeding, however, owes less to Freud, displaying much closer affinities with the brooding, psychological landscapes of the Gothic novels of the eighteenth and nineteenth centuries, especially Emily Bronte's masterpiece 'Wuthering Heights'. The result is a compelling work-part mystery, part modern gothic. 'The House of Dr. Edwardes' is a gripping novel that continues to provoke and inspire readers and artists alike",
  "genres": [
    "Mystery",
    "Fiction",
    "Thriller",
    "Mystery Thriller",
    "Horror",
    "Classics",
    "British Literature"
  ],
  "author": "Francis Beeding",
  "average_rating": "3.33",
  "url": "https://www.goodreads.com/book/show/2609027-the-house-of-dr-edwardes"
}