{
  "title": "Light Years: Memoir of a Modern Lighthouse Keeper",
  "description": "From publisher's website: In 2007, Caroline Woodward was itching for a change. With an established career in book-selling and promotion, four books of her own and having raised a son with her husband, Jeff, she yearned for adventure and to re-ignite her passion for writing. Jeff was tired of piecing together low-paying part-time jobs and, with Caroline’s encouragement, applied for a position as a relief lightkeeper on a remote North Pacific island. They endured lonely months of living apart, but the way of life rejuvenated Jeff and inspired Caroline to contemplate serious shifts in order to accompany him. When a permanent position for a lighthouse keeper became available, Caroline quit her job and joined Jeff on the lights.Caroline soon learned that the lighthouse-keeping life does not consist of long, empty hours in which to write. The reality is hard physical labour, long stretches of isolation and the constant threat of de-staffing. Beginning with a 3:30 a.m. weather report, the days are filled with maintaining the light station buildings, sea sampling, radio communication, beach cleanup, wildlife encounters and everything in between. As for dangerous rescue missions or dramatic shipwrecks—that kind of excitement is rare. “So far the only life I know I’ve saved is my own,” she says, with her trademark dry wit. Yet Caroline is exhilarated by the scenic coastline with its drizzle and fog, seabirds and whales, and finds time to grow a garden and, as anticipated, write.Told with eloquent introspection and an eye for detail, Light Years is the personal account of a lighthouse keeper in twenty-first century British Columbia—an account that details Caroline’s endurance of extreme climatic, interpersonal and medical challenges, as well as the practical and psychological aspects of living a happy, healthy, useful and creative life in isolation.",
  "genres": [
    "Nonfiction",
    "Memoir",
    "Canada",
    "Biography Memoir",
    "Biography"
  ],
  "author": "Caroline Woodward",
  "average_rating": "3.76",
  "url": "https://www.goodreads.com/book/show/26089081-light-years"
}