{
  "title": "Fear",
  "description": "Welcome back to the FAYZ! This is Book 5 in the series that Stephen King calls a \"Driving, torrential narrative.\" Night is falling in the FAYZ. Permanently. The gaiaphage has blotted out the sun and the barrier that surrounds the town of Perdido Beach is turning black. It's Sam's worst nightmare. With Astrid still missing and Edilio and Lana struggling to maintain order, Sam and his followers need all the courage they can get. As their world descends into darkness, only real heroes will survive. The GONE series is Lord of the Flies for the 21st century. In turns breathtaking, harrowing, and utterly terrifying. Its complex characters and moral dilemmas will delight fans of The Hunger Games, Divergent and The Maze Runner. This is dystopian fiction at its best. Have you got all 6 titles in the New York Times bestselling Gone, Hunger, Lies, Plague, Fear, and Light? \"I am now free to leave the FAYZ, but my time there was well spent.\" (Stephen King). If you love GONE, be sure not to miss Michael's new series Front Lines - it's WWII but not as you know it! The first book is Front Lines, followed by Silver Stars. Michael Grant also has a World Book Day book, Dead of Night, which is set in the Front Lines universe and written exclusively for World Book Day 2017. Michael Grant has lived an exciting, fast-paced life. He moved in with his wife Katherine Applegate after only 24 hours. He has co-authored over 160 books but promises that everything he writes is like nothing you've ever read before! If the Gone series has left you hungry for more from the dark genius of YA fiction, look out for the BZRK BZRK, BZRK Reloaded, BZRK Apocalypse and the terrifying Messenger of Fear and its sequel The Tattooed Heart. Michael is a World Book Day author for 2017.",
  "genres": [
    "Young Adult",
    "Dystopia",
    "Science Fiction",
    "Fantasy",
    "Fiction",
    "Horror",
    "Paranormal"
  ],
  "author": "Michael  Grant",
  "average_rating": "4.22",
  "url": "https://www.goodreads.com/book/show/26090159-fear"
}