{
  "title": "Obsession By Treaty",
  "description": "She vows to break him, her love knows no limits…\nObsession by Treaty is set in war-torn Earth, as the United Regions awaits the arrival of the Qui Empress, her consort, General Jaden, and the prisoners of war liberated under the new Qui Treaty.On a routine tech recovery mission at a downed alien warship, Major Darby McCabe is contaminated by a psychotropic alien device. Her mind and emotions are twisted by psychosis as the love she secretly harbors for her commanding officer, Ethan Saracen, morphs into a dark, dangerous obsession. A sharp, highly competent military officer, Darby uses all her wits and resources to abduct Ethan, forcing him into sexual submission and taking complete control of his life.Ethan can see no escape from the downward spiral of his destructive, forced relationship with sociopath Darby, a woman he once loved and now hates. She's taken everything – his pride, command, and capacity to function as a soldier, but the inconvenient truth that hurts most... he still loves her.This is a dark psycho-thriller futuristic sci-fi romance with graphic language and violence that will appeal to fans of the prequel Under By Treaty. Readers are advised this novel contains scenes of a non-consensual nature and explicit sex.This sexy sci fi romance is the fifth story in the Qui Treaty Collection inspired by Under By Treaty, a science fiction romance novel in Kayla Stonor’s Surrender collection. Each scifi romance is a standalone episodic story set in the Qui galactic empire, with annihilation of mankind held at bay only through the Treaty consummated between the Qui Empress and the human consort abducted under its terms. Although Obsession By Treaty is standalone, the story is set within a wider saga that continues in later stories. It is recommended to read the Qui Treaty Collection in order: See inside cover.Reader please note: Kayla Stonor’s romance can be dark and edgy, hot and wicked, punishing and uplifting. If you find certain themes uncomfortable reading, these stories may not be for you. Obsession By Treaty contains extreme and mature themes including graphic violence. Please see more details regarding the content inside the cover.",
  "genres": [
    "Space Opera",
    "Romance",
    "Dark Romance",
    "Aliens",
    "Science Fiction",
    "Futuristic",
    "Erotica"
  ],
  "author": "Kayla Stonor",
  "average_rating": "4.02",
  "url": "https://www.goodreads.com/book/show/26088652-obsession-by-treaty"
}