{
  "title": "A Rough Ride to Albany: Teddy Runs for Governor.",
  "description": "Just as essential to Theodore Roosevelt’s accession to the Presidency as his charge up San Juan Hill was his election as Governor of New York four months later. A defeat would have seriously set back and perhaps even destroyed his chances to gain the White House. Yet, until A Rough Ride to Albany, no book has devoted itself primarily to that hard-fought uphill campaign, which he barely won only after a series of energetic “whistle stop” tours, and in which he displayed for the first time a unique power to stir audiences that has rarely been seen in American politics. The book also describes how Roosevelt had to balance his commitment to reform with the positions of New York’s Republican leadership, which did not share many of his priorities. It thus provides lessons that are just as relevant today as they were more than one hundred years ago.Although Roosevelt is the book’s dominating character, its pages are also filled with other absorbing personalities. Among them are silky Republican “Easy Boss” Thomas Collier Platt, who disliked Roosevelt but for the party’s good was forced to back him for Governor; passionate political reformer John Jay Chapman, who accused Roosevelt of backing out on his word by refusing to run as an independent after being assured the Republican nomination; Elihu Root, whose lawyer’s skill saved Roosevelt’s candidacy when his opponents discovered he had failed to pay his New York taxes; and Richard Croker, the arrogant Democratic boss whose failure to back a sitting judge for refusing to appoint a Tammany Hall functionary to a court clerkship created such public revulsion that Roosevelt was able to capitalize on the incident to turn a likely defeat into victory.A Rough Ride to Albany is must reading for anyone who is fascinated by the career of Theodore Roosevelt or by the details of a dramatic political campaign that helped set the course of Twentieth Century American history.",
  "genres": [],
  "author": "John A. Corry",
  "average_rating": "3.67",
  "url": "https://www.goodreads.com/book/show/260921.A_Rough_Ride_to_Albany"
}