{
  "title": "Quinoa & Sons: How to Open a Cafe like a Legend.",
  "description": "Going to a cafe is the best way to do something without doing anything. You can go there to be social, antisocial or just social-adjacent.  Unfortunately all the How-To-Open-Your-Dream-Cafe books out there are terrible. All of them.  I mean, these books are great if you want to open the cafe equivalent of Friends and out-bland your competitors to death, but if not I’d avoid them. They invariably adopt this congratulatory, back-slapping tone for throwing off the corporate shackles and creating an uncertain financial future for your family, before putting you to sleep with fatherly advice on how to set up the most white bread, Central Perk-esque cafe in all of suburbia.  But people keep reading these same terrible books and opening the same terrible cafes. They go on about business plans (Cool!), hiring staff (Extreme!) and budgeting wisely (Paleo!) until your soul just wants to vomit on itself.  Cafes are, above all, human businesses. They aren’t about all that other stuff, they’re all about the feel. All cafes have a feel; bad cafes have a bad feel and good cafes have a good feel. It's the most important and least understood part of any cafe and you can usually pick it the second you walk in the door. And as with most intangibles no attempt is ever made to really understand it, instead owners are happy to shrug their shoulders and tell themselves “Hey, you’ve either got it or you don’t”. Which is bullshit. This book will tell you how to create the right atmosphere and there’s nothing those cafe fat cats in their ivory towers can do about it.  “I thought you just said cafes were relaxing and perfect and chilled out businesses. So why all the rules then, you gout-suffering jerk?”  Firstly, leave my buildup of uric acid out of it.  Secondly, I said the best cafes are relaxing and perfect. The others - you know, the one’s that aren’t the best - usually go out of business, which is not relaxing. These cafes need these rules more than oxygen. No one wants to be told how to run their cafe - they started this business to get away from people telling them what to do in the first place - it’s their dream and they’ll run it the way they want to. Fair enough. Unfortunately ‘their way’ tends to be exactly the same way as every other cafe in the suburb.  Quinoa & Sons is for anyone who owns, would like to own, or just loves cafes. The topics covered range from the trivial to the frivolous, but ironically these are the only things that really matter when it comes to cafes. They’re your points of difference and they’re not covered in any of the other books. Cafes go under every day because owners follow all the cookie-cutter advice out there; they do everything these books say, everything that seems like a perfectly safe, standard cafe decision. Which is exactly the problem.",
  "genres": [],
  "author": "Charles  Logan",
  "average_rating": "4.13",
  "url": "https://www.goodreads.com/book/show/26091390-quinoa-sons"
}