{
  "title": "Welcome to Death Row: The Uncensored Story of Death Row Records in the Words of Those Who Were There",
  "description": "It started in Compton. it ended in infamy.In the wake of Marion \"Suge\" Knight's move to rip the guts out of Ruthless Records and NWA, Death Row Records exploded on the music scene in 1993 with the \"gangster rap\" sound that had taken world by storm. Yet despite its unprecedented success with stars such as Dr. Dre, Snoop Dogg and Tupac Shakur, it quickly unraveled in a firestorm of rivalries, greed, violence and government scrutiny as Suge Knight's unconventional business methods increasingly mirrored the violent, hard-edged themes of its music.Based on the award winning documentary film of the same name, WELCOME TO DEATH ROW is the complete and untold story of the rise and fall of the notorious Death Row Records label, presented as an oral history through first-hand accounts of the people that lived it. It is vastly expanded with compelling (and sometimes shocking) accounts not heard in the documentary film, with stories from over 60 former Death Row rappers, promoters, music executives, journalists, producers, managers, publicists, lawyers and drug dealers -all eyewitnesses to the label's phenomenal success, internal battles and violence, and its inevitable crash.Interwoven with these histories is the story of the high-risk quest to complete the film, chronicling how director Leigh Savidge and producers Steve Housden & Jeff Scheftel navigated a surreal world of Crips & Bloods, crooked lawyers and cocaine kingpins, 'gangsta' rappers and thuggish music executives, and how the team persuaded the key players to tell their story under the threat of retaliation from every element, including threats from major music companies and the bizarre involvement of OJ Simpson prosecutor Chris Darden.Universal Pictures' STRAIGHT OUTTA COMPTON was developed a follow up to the WELCOME TO DEATH ROW film by its producers, constructing the story and acquiring rights, with author S. Leigh Savidge writing initial drafts of the screenplay",
  "genres": [
    "Music"
  ],
  "author": "S. Leigh Savidge",
  "average_rating": "3.89",
  "url": "https://www.goodreads.com/book/show/26094661-welcome-to-death-row"
}