{
  "title": "Welcome to Foxyland: Great Adventures of Little Foxycat",
  "description": "The curious and imaginative Foxycat must explore his village to find the ingredients needed for his mother to bake his favorite dessert, in this delightful, fully illustrated children’s book.From the moment he wakes up in his cozy cottage on the edge of the forest, Foxycat is filled with wonder at the world around him. With his vivid imagination knowing no bounds, he speaks to Mrs. Toothbrush about going into battle to defend his teeth from bacteria, and chats happily to the contents of his kitchen cupboards before sitting down for breakfast. Indulging his wandering mind and need to discover something new every day, Foxycat’s mother sends him on a journey to seek out the ingredients to make his favorite pie.Now out on his own in Foxyland, his imagination is free to run even wilder. Foxycat sings a duet with the sun, sporting a sombrero - of course - and has a conversation with the fish found in the forest brook. Not forgetting his important task - and the freshly baked reward he will get upon completing it - Foxycat makes at stop at Uncle Beaver’s sawmill for a new breadboard and rolling pin, learning more about the surrounding woods before heading to Mr. Hams’ windmill for a bag of flour and a lesson on the hard work it takes to run such a business. Of course, he will still have to find a friend who can help him get the milk…With Great Adventures of Little Foxycat, Wald Peterson has created a fantastical and warm new world in which friendship, discovery and learning with open eyes are the central, heartfelt themes. Filled with bright and expressive illustrations, Foxycat’s journey in the animated world of Foxyland is beautifully rendered, a wonderful story that parents, teachers and children will enjoy reading and revisiting. Great Adventures of Little Foxycat is an amusing new addition to children’s illustrative fiction that will be delight younger readers for years to come.",
  "genres": [],
  "author": "Wald Peterson",
  "average_rating": "3.75",
  "url": "https://www.goodreads.com/book/show/26094524-welcome-to-foxyland"
}