{
  "title": "Disciplined",
  "description": "Théoden: My Father and Sire, King Ara is leaving New Haven this morning to embark on his campaign to take over Athens, Greece. I have no doubt that he will success, but I am also concerned. This would be the first time since I was embraced by him that I am not by his side to see him to victory. I only hope that his army will be enough. As for the rest of my night, well, It's time to take Dante to the next level and I'm going to have a hell of a lot of fun doing it, as will my sons.  Noel: Woke up to find that Dante is in our hands. My younger brother has no idea what's in store for him. I'm caught between wanting to take it easy on him because I've been where he is, or teaching him a lesson myself for how rude he was to me when I was trying to help him out. I do know one thing, I don't like that he and Romeo have a history. I'm going to be keeping my eye on them.  Deacon: Elijah is slowly coming on board. I think it's because he's realizing that this is his life now. There is no escaping, their is no going back. But there's more to it than that. Since we've bonded completely, I think he's feeling a kinship to me and our pack. We're a family now and we look out for each other. I'm going to need him to feel that connection when we go before the Alphas and I present him as my mate. One false move on his part or mine could endanger our Pack.  Warning: This serial contains strong adult content not meant for sensitive eyes. The novelettes in this serial will be filled with dark, twisted, raunchy and steamy scenes between powerful, sexy men that will either offend you or get ya revved up. This series will not be pulling any punches, and it won’t apologize for hurting your feelings, either. You’ll find no fluff and ruffles here. The vampires are not misunderstood, hopeless romantics looking for love. The werewolves are not cute and cuddly and the dragons aren’t the ones from your childhood. This is NOT a romance. There are approximately words in this novelette.",
  "genres": [],
  "author": "Nicholas Bella",
  "average_rating": "4.38",
  "url": "https://www.goodreads.com/book/show/26095944-disciplined"
}