{
  "title": "The Flying Kite",
  "description": "(SHORT STORY, part of \nThe Gingerbread Collection\n) Although I have been loose with the facts and changed names and dates to avoid copyright violation, this story was inspired by actual events. Adjacent to where I work is a basement littered floor to ceiling with \"antiques\" (aka junk). Among the wreckage is a shelf of National Geographic magazines dating back to 1924. They're fun to peek through. In one 1970s issue, I read the story of a man who set out to walk from the northernmost foothills of the Andes in South America to the southern tip of Tierra del Fuego. His wife joined him on part of the trip, but died in an accident. The interviewer asked if he intended to continue, and he said yes. Internet searches, trips to the library, and perusals of future issues turned up nothing for me in the way of a followup or resolution to this story. Naturally, as a fiction writer, I took it upon myself to invent the rest of his story.In my story, he turns up again a dozen years later, crazed but still wandering. Three decades later, another Nat Geo photojournalist finds him in Patagonia and walks with him, trying to establish whether he is a hoaxer or the real thing. Guillermo Faulkner, as I've named him, slowly turned from a serious world traveler to a lost troubadour, to an urban legend. As a short story writer, I value brevity. This is the first time I've been so taken with an idea that I've been tempted to write a novel. Unfortunately, I feel I've mastered neither the state of mind nor the state of affairs necessary to dive wholeheartedly into that effort. So I sought out a way to tell the story briefly. Thus the twist: A man walks into a bar claiming that this urban legend is real. The entire story is told as a story within a story, and the dramatic tension comes from the question: Can this man, this americano, be trusted?",
  "genres": [],
  "author": "Victor A. Davis",
  "average_rating": "4.75",
  "url": "https://www.goodreads.com/book/show/26098780-the-flying-kite"
}