{
  "title": "The Courtship Maneuver, Book 2",
  "description": "Introducing The Courtship Maneuver, the hot and sexy new series by Alexa Wilder! Chloe Henson is in love with her boss. Completely, totally, head over heels in love. She knows he doesn't feel the same way - she doesn't expect him too. Sam Logan is successful and wealthy, and he only dates supermodels. When he could have any woman in Las Vegas, why would he want his shy, abundantly curvy assistant? Determined to ignore her heart, Chloe puts her feelings on hold. But when her brother disappears, and she ends up in the cross-hairs of the Russian mob, she has nowhere to turn. Except to Sam.  Sam Logan has a problem. He has a thing for his assistant, but he knows he can't act on it. Chloe's the best assistant he's ever had, and over the three years they've worked together, she's become his best friend. Chloe is so shy, he knows one wrong move will send her running. When her irresponsible brother rips off a mob boss and vanishes, Chloe is in danger, and Sam's tired of waiting to make his move. The best way to keep her safe is to make her his. But with bullets flying and betrayal around every corner, can Sam convince Chloe that this is more than just a fling?  **This hot and steamy alpha billionaire romance is perfect for fans of Hannah Ford, Lila Monroe, Cassie Cross and J.S. Scott**  The Courtship Maneuver is a serial romance in three parts. All parts are complete and the release schedule will be as follows: Book One: August 10th, 2015 Book Two: August 18th, 2015 Book Three: August 25th, 2015  BOOK TWO EXCERPT I leaned forward the few inches separating me from Sam and pressed my lips to his. I don’t think I’d ever initiated a kiss with a man. Aside from pressing my lips to Sam’s, I didn’t know what to do. When we’d kissed before, I hadn’t put much thought into what I was doing. Forget much thought, I hadn’t put any thought into it. Sam had kissed me and my body had taken over.  There was a moment of doubt. That he would reject me, that I was doing it wrong, before Sam groaned and his arms closed around me. His lips took mine, deepening the kiss, his tongue rubbing and tasting in a dance that stole my breath. He rose above me, sliding me onto the bed until I was flat on my back. My legs spread and my knees came up to grip his hips as I felt his weight pinning me down.  His kiss made me crazy. The taste of Sam in my mouth, the citrus and spice scent of him, his big, hard hands, one on my waist and the other on my face. My hips rolled beneath him, my body urging me on, demanding more even though I didn’t know how to ask for what I needed. I didn’t have to. For the first time I was grateful for Sam’s experience. He knew exactly what to do. He just didn’t move fast enough.  Breaking our kiss, he sat up, kneeling between my spread legs. His eyes, sharp and hot, raked my body, his breath coming in short pants, exactly like my own. “Chloe, honey,” he said, his voice growly and low. “I need to know that you understand where this is going. That you want this. You have to tell me. I’m not going to take advantage of you.”  “I do,” I said, squirming beneath him, clamping my knees to his thighs and lifting my hips just a little. I didn’t really know what I was doing, or why. I just knew my body needed to move and Sam was so still, watching me. His eyes, flaring every time I shifted, only made me more restless. “Sam, please.”",
  "genres": [],
  "author": "Alexa Wilder",
  "average_rating": "4.04",
  "url": "https://www.goodreads.com/book/show/26101411-the-courtship-maneuver-book-2"
}