{
  "title": "Rotten Peaches",
  "description": "“Animal Dwarf Bandits” with Tommy Guns are on a crime spree in Georgia!  Dillinger-style bank heists are being committed by a dangerous gang of little people wearing animal masks. Enter ursine photojournalist Thelonious T. Bear. Still smarting from his misadventures in Norfolk, he’s eager to begin his assignment in the American South. However, Thelonious soon learns that the South isn’t all fried chicken and sweet tea. In between encounters with a trigger-happy farmer and a fire-and-brimstone preacher with a snake, he’s stalked by a man in a red pickup truck and nearly bear-napped by a family of hillbillies. Thelonious’s resemblance to one of the bank bandits puts him on the radar of Sheriff Maynard Grizzle and budding reporter Nate Jessop, both of whom are convinced he’s in the gang. As the robberies gain more media attention, locals smell fame in the air. Suddenly everyone wants in on the action. And Thelonious finds himself at the heart of yet another series of crimes!  From bestselling author Mitzi Szereto, co-authored with her celebrity sidekick bear Teddy Tedaloo. Be sure to read Normal for Norfolk (The Thelonious T. Bear Chronicles), the first in the series!  Mitzi Szereto (mitziszereto.com) is an author and anthology editor of multi-genre fiction and non-fiction. She has her own blog Errant Ramblings: Mitzi Szereto’s Weblog (mitziszereto.com/blog), and a web TV channel Mitzi TV (mitziszereto.com/tv), which covers the \"quirky\" side of London. Her books include Love, Lust and Zombies; Darker Edge of Desire: Gothic Tales of Romance; The Wilde Passions of Dorian Gray; Normal for Norfolk (The Thelonious T. Bear Chronicles); Thrones of Desire: Erotic Tales of Swords, Mist and Fire; Pride and Prejudice: Hidden Lusts; Red Velvet and Absinthe: Paranormal Erotic Romance; In Sleeping Beauty's Bed: Erotic Fairy Tales; Getting Even: Revenge Stories; Dying For It: Tales of Sex and Death; Wicked: Sexy Tales of Legendary Lovers; and Silk Sheets: Collected Stories of Mitzi Szereto.  Teddy Tedaloo is an author, celebrity teddy bear and the publisher and editor of The Teddy Tedaloo Times. He's also a trendsetter, world traveller, and the production assistant extraordinaire/co-star of the web TV channel MITZI TV, which covers \"quirky\" London. Popular in social media circles such as Facebook and Twitter, he’s known for his entertaining commentary and opinions as well as being an advocate for animal welfare. He lives (and goes) wherever Mitzi lives (and goes). Rotten Peaches (The Thelonious T. Bear Chronicles) is his second novel in the series.",
  "genres": [],
  "author": "Mitzi Szereto",
  "average_rating": "4.56",
  "url": "https://www.goodreads.com/book/show/26107283-rotten-peaches"
}