{
  "title": "Best of the Best: 20 Years of the Year's Best Science Fiction",
  "description": "For years, The Year's Best Science Fiction has been the most widely read short science fiction anthology of its kind. Now, after twenty-one annual collections, comes the ultimate in science fiction anthologies, The Best of the 20 Years of the Year's Best Science Fiction , in which legendary editor Gardner Dozois selects the very best short stories for this landmark collection. Some notable stories \"The Left Hand of Darkness\" by Ursula K. Le Guin. Coming of age is a difficult passage for any adolescent, but couple that with the potential to be either sex and you've got a dilemma of seismic proportion. Bringing readers back to the world of her classic and best known novel, The Left Hand of Darkness , Le Guin creates a compelling and evocative story of transition.\"The Winter Market\" by William Gibson. Called the SF Timothy Leary of our times, Gibson returns to the subject that made him a cultural icon, cyberpunk. People who know what they want are often lauded and honored in this society. But when those people start using others to get it, beware!\"Trinity\" by Nancy Kress. People have searched for God since the dawn of time, but not until the new millennium did they think to find this celestial being through technology. Since soon after the series began, Kress has been an annual and esteemed contributor to The Year's Best Science Fiction .Contributors * Stephen Baxter * Greg Bear * William Bigson * Terry Bisson * Pat Cadigan * Ted Chiang * John Crowley * Tony Daniel * Greg Egan * Molly Gloss * Eileen Gunn * Joe Haldeman * James Patrick Kelly * John Kessel * Nancy Kress * Ursula K. Le Guin * Ian R. MacLeod * David Marusek * Paul McAuley * Ian McDonald * Maureen F. McHugh * Robert Reed * Mike Resnick * Geoff Ryman * William Sander * Lucius Shepard * Robert Silverberg * Brian Stableford * Bruce Sterling * Charles Stross * Michael Swanwick * Steven Utley * Howard Waldrop * Walter Jon Williams * Connie Willis * Gene WolfeWith work spanning two decades, The Best of the Best stands as one of the ultimate science fiction anthologies ever published.",
  "genres": [
    "Science Fiction",
    "Short Stories",
    "Fiction",
    "Anthologies",
    "Speculative Fiction",
    "Collections",
    "Science Fiction Fantasy"
  ],
  "author": "Gardner Dozois",
  "average_rating": "4.15",
  "url": "https://www.goodreads.com/book/show/2610719-best-of-the-best"
}