{
  "title": "Writing Success: Your Book from Start to Finish to Publication",
  "description": "A limited-time collection of writing craft books all in one fabulous boxed set. Whether you write fiction, nonfiction or true stories, this anthology has something for you.  A Field Guide to Genres in Fiction by Karen Ball and Erin Taylor Young Know and understand your genre like never before. Why? To give your readers what they want—and keep them coming back for more! Let these essential tips and how-tos from an editor, author, and literary agent of over 30 years guide you to craft a story that not only captures your readers, but spurs them on to tell their friends about it too.       Writing Fiction for All You’re Worth by James Scott Bell A treasure trove of fiction techniques from #1 bestselling writing coach James Scott Bell. Everything from the secrets of writing action scenes to how to grab readers from page one. Included also are inspirational articles on the writing life, such as finding courage to write, and how to deal with setbacks. Finally, a special section of Jim's interviews with some of the top authors working today, including: Jeffery Deaver, David Baldacci, Brad Thor and more.  The 11 Secrets to Getting Published by Mary DeMuth Author of 30 books, Mary DeMuth teaches writers how to craft the kind of query letter that gets industry professionals' excited, write attention-grabbing prose, create effective writing routines to meet your daily and weekly goals, navigate a writing conference with confidence, and find and woo an agent.   Write Like an Insider by Tricia Goyer and Cindy Coloma Write Like an Insider will help you build great interview and research skills. You'll also learn how to navigate the delicate challenge of gathering masses of information and knowing what to include in your written work. By following Tricia and Cindy's tips and advice, writers will learn how to find great research, walk in other people’s shoes, and experience stories that will stay with them always. Learn to write like an insider to improve you work and impact your readers in new ways.  10 Ways That Facebook Can Help You Write True Stories by Erin MacPherson Erin MacPherson will take you through a series of exercises using Facebook (yes, Facebook) to help you to tell true stories in a way that's both compelling and honoring to the real-life hero or heroine in your story.  With simple tried-and-true tips and even some personal examples, Erin will help you to whip your next non-fiction book or article, memoir or even truth-inspired fiction into shape.    The Chunky Method Handbook by Allie Pleiter Allie Pleiter’s innovative Chunky Method Handbook offers practical, real-world productivity advice for writers.  This easy to read and inspiring workbook outlines a step-by-step plan to identify your unique writing “Chunk” and wield it to create a solid plan that works--even when life gets in the way.  If you want to finally finish that book, want to meet your deadlines with less stress, or just need to write faster, the Chunky Method Handbook will get you to your creative writing goals.  Pleiter is the award-winning author of 28 published works in both fiction and non-fiction.  The Story Equation, Simplified by Susan May Warren What if, with one easy question and one powerful technique, you could build a compelling, organic story? You can—with a powerful tool of storycrafting called the Story Equation.  Using the “SEQ”, a method that has created nearly 50 best-selling, award-winning romances, including RITA, Carol and Christy winners, international, award-winning writing teacher Susan May Warr",
  "genres": [
    "Writing",
    "Nonfiction"
  ],
  "author": "Karen Ball",
  "average_rating": "3.46",
  "url": "https://www.goodreads.com/book/show/26106365-writing-success"
}