{
  "title": "The Courtship Maneuver, Book 3",
  "description": "Introducing The Courtship Maneuver, the hot and sexy new series by Alexa Wilder!  Chloe Henson is in love with her boss. Completely, totally, head over heels in love. She knows he doesn't feel the same way - she doesn't expect him too. Sam Logan is successful and wealthy, and he only dates supermodels. When he could have any woman in Las Vegas, why would he want his shy, abundantly curvy assistant? Determined to ignore her heart, Chloe puts her feelings on hold. But when her brother disappears, and she ends up in the cross-hairs of the Russian mob, she has nowhere to turn. Except to Sam.  Sam Logan has a problem. He has a thing for his assistant, but he knows he can't act on it. Chloe's the best assistant he's ever had, and over the three years they've worked together, she's become his best friend. Chloe is so shy, he knows one wrong move will send her running. When her irresponsible brother rips off a mob boss and vanishes, Chloe is in danger, and Sam's tired of waiting to make his move. The best way to keep her safe is to make her his. But with bullets flying and betrayal around every corner, can Sam convince Chloe that this is more than just a fling?  **This hot and steamy alpha billionaire romance is perfect for fans of Hannah Ford, Lila Monroe, Cassie Cross and J.S. Scott**  The Courtship Maneuver is a serial romance in three parts. All parts are complete and the release schedule will be as follows:  Book One: August 10th, 2015 Book Two: August 18th, 2015 Book Three: August 25th, 2015  BOOK THREE EXCERPT Even my most heated fantasies of Sam hadn’t included having sex with him in his office. My imagination hadn’t dared to go that far. But there was one thing that had crept into my secret dreams. I’d always envisioned doing it at his desk, my body hidden beneath the bulky furniture while he lounged back in his chair and let me pleasure him.   The couch would do well enough. Peeking over my shoulder to reassure myself that the door was safely closed, though I already knew it was locked, I slid off Sam’s lap. He murmured a protest, but I ignored him. I stood before him in my proper suit, the power of his need flowing through me, making me brave. Taking a step back, I raised my hands and began to unbutton my jacket. Sam froze in the middle of reaching for me and slowly sat back. I bit my lip, looking down at his face, his blue eyes burning, the flush of passion on his cheekbones. He was mine. And I was going to show him how much I wanted him.",
  "genres": [],
  "author": "Alexa Wilder",
  "average_rating": "4.15",
  "url": "https://www.goodreads.com/book/show/26101410-the-courtship-maneuver-book-3"
}