{
  "title": "The Minister's Daughter",
  "description": "SHE HAD ONCE SWORN SHE WOULD NEVER RETURN TO SOVEREIGN, AND NOW ... HERE SHE WAS! Tall, blonde and beautiful, Nellie Walker, 21, daughter of Maggie the minister of the local Union church, is also self-centered and a bit of a snob. When a tragic loss leaves her alone in the world, she's forced to return to Sovereign, Maine -- a place she's always disliked -- to pick up the pieces of her mother's life. Soon, Nellie finds herself overwhelmed by the generosity of the goodhearted townspeople, who ply her with chocolate cakes, cookies, and casseroles in an attempt to console her.  Life in this rural farming community is much different for Nellie this time around, however, as much to her surprise she finds herself enjoying herself, having dinner with Wendell and Rebecca at the old Russell homestead; lighting deer with Ryan and Trudy; and learning about old-fashioned roses from the compassionate country doctor, Doctor Bart, Nellie's childhood champion, who helps Nellie search for her father, a man whose identity her mother has never revealed. In return, Nellie helps Doctor Bart realize a long-time dream by opening a free medical clinic in Miss Hastings' former music studio.  Doctor Bart's other long-time dream is to make Nellie his wife. But stiff-necked Nellie naturally wants to choose her own partner and newcomer Walden, the \"Mushroom Man,\" has piqued her interest. Who is this mysterious stranger? And why has his unorthodox view of land ownership created such a stir in Sovereign?  A magical story filled with the stuff that makes Maine wonderful -- the scent of the fall woods, hand-made quilts, storytelling Old Farts, forgotten history like mortgage buttons, Needhams (chocolates), old-fashioned roses and herbs -- Book 4 in Jennifer Wixson's Sovereign Series (a standalone novel) returns with your favorite Sovereign characters. The Minister's Daughter, as with all of Wixson's delightful novels, will leave you hankering after a simpler lifestyle and wondering whether you can reach Sovereign in time for suppah!  PUBLISHER'S NOTE: The Minister's Daughter was meant to conclude the series; however, thanks to the encouragement of her fans, Jennifer has recently announced there will be at least two more titles in addition to The Sovereign Series Cookbook coming late 2015 or next year.  For more information on the series please visit www.TheSovereignSeries.com. You can follow Jen on Twitter @ChickenJen and visit her Facebook author's page for the latest on her writing www.facebook.com/Jennifer.Wixson.author",
  "genres": [],
  "author": "Jennifer Wixson",
  "average_rating": "4.57",
  "url": "https://www.goodreads.com/book/show/26103734-the-minister-s-daughter"
}