{
  "title": "Buffalo Chief",
  "description": "This is a twofold story of a dramatic struggle for survival. For countless generations the lives of the American bison and the Plains Indians were as one. Periodically stirred by the rhythm of the seasons, the great buffalo herds followed the ancient trails from north to south and back again, and the Indians followed the buffalo. It was a pattern and way of life regarded by both as inevitable. The Indians depended on the buffalo for food, for clothing and shelter, and for sport. In turn the buffalo accepted Indian hunts as only another natural hazard of their nomadic life, along with wolves and grizzlies, floods and droughts and blizzards. But with the coming of the white man, this age-old relationship was changed forever. Both Indian and buffalo, threatened with extinction, struggled desperately for survival. This Native American story is told through the lives of Standing Elk, a wise old Sioux medicine man, his headstrong, warlike son, Hawk, and Hawk's adopted brother, Stabs-the-Bear, in spite of his youth a \"far-seer\" like his foster father. Woven through their experiences and adventures are the ways of the buffalo, centered on the life of the king bull, Kahtanka, from birth through his sagacious later years as herd master. And opposed to these plains dwellers is the advancing, disrupting tide of the white man, with his guns, his railroads, his hide hunters, and his soldiers. Between them, Mr. and Mrs. Annixter have written four previous novels, many novelettes, and over five hundred short stories for almost every U.S. magazine. He was born in Minneapolis, she in Detroit. They have traveled throughout the United States, Canada, and parts of Mexico, mostly off the beaten paths. They now live in Pasadena, California, where they work with their hands at gardening or building when not at their typewriters or off mountain-climbing. They believe that the efforts of both head and hands are necessary for a balanced life, and that the world of nature is no less important than the works of man.",
  "genres": [],
  "author": "Jane Annixter",
  "average_rating": "4.33",
  "url": "https://www.goodreads.com/book/show/26104616-buffalo-chief"
}