{
  "title": "The Tuskegee Airmen: The History and Legacy of America’s First Black Fighter Pilots in World War II",
  "description": "*Includes pictures*Includes accounts of training, combat, and segregation written by multiple members of the Tuskegee Airmen*Includes online resources and a bibliography for further reading*Includes a table of contents“When World War II started, the black press and the black community wanted blacks to be able to fly because in 1925, the military had done a study that said that blacks didn’t have the intelligence, ability, or coordination to fly airplanes. The pressure from the NAACP and the press caused them to start an experimental group that was to be trained in Tuskegee, Alabama, and that’s why we were known as ‘The Tuskegee Airmen.’…I come from a generation of African Americans where we were always trying to be better. We were taught that you had to be better than whites in order to move ahead, so we were very competitive…Practically everyone in the Tuskegee Airmen was an exceptional scholar and athlete, so the competition was really great and it helped to bond us together.” – Roscoe Brown, one of the Tuskegee AirmenThe United States has no shortage of famous military units, from the Civil War’s Iron Brigade to the 101st Airborne, but one would be hard pressed to find one that had to go through as many hardships off the field as the Tuskegee Airmen, a group of African American fighter pilots who overcame Jim Crow at home and official segregation in the military to serve their country in the final years of World War II. In fact, it required a concerted effort by groups such as the National Association for the Advancement of Colored People (NAACP) and the extreme circumstances brought about by World War II that the military eventually decided to establish the “Tuskegee Experiment.”The black crews trained at Tuskegee before being sent overseas, and even then, they faced discrimination from those who didn’t trust them to do more than escort bombers flown by white pilots. However, as the men proved their worth in the heat of battle, some of the squadrons’ red markings helped them earn the nickname “Red Tails,” and their track record was so good that eventually the white pilots of American bombers wanted to fly with them. As Tuskegee airman Roscoe Brown eloquently put it, “They have a saying that excellence is the antidote to prejudice; so, once you show you can do it, some of the barriers will come down.”In time, the Tuskegee Airmen would be romanticized and mythologized to the extent that it was erroneously claimed that some escort squadrons didn’t lose a bomber to the enemy, which led Tuskegee airman Grant Williams to note in jest, “Back then, nobody realized the significance of what we were doing. Now, they seem to think we could walk on water.\" However, even though the suggestion that the escorts lost no bombers on their missions was inaccurate, there is no question that the Tuskegee Airmen’s record was elite and some of the fighter pilots were among the best to serve. Ironically, this was a byproduct of the systemic racism the men had to overcome, which resulted in extra training and planning among other issues. The Tuskegee The History and Legacy of America’s First Black Fighter Pilots in World War II chronicles the story of the Tuskegee Airmen and their important place in American military history. Along with pictures of important people, places, and events, you will learn about the Tuskegee Airmen like never before, in no time at all.",
  "genres": [
    "History"
  ],
  "author": "Charles River Editors",
  "average_rating": "4.21",
  "url": "https://www.goodreads.com/book/show/26103458-the-tuskegee-airmen"
}