{
  "title": "The Social Anxiety & Shyness Cure: The Secret to Overcoming Social Anxiety and Gaining Confidence",
  "description": "Overcome Social Anxiety and Shyness For Ever The complete guide to overcoming social anxiety and shyness for ever! This book reveals how you can get rid of your fears right now.Social anxiety is real and it can affect every aspect of your life making it hard for you to lead a normal life. If you are tired of that and want to put an end to your social anxiety, this book is what you need to start your walk towards a social butterfly version of yourself. It helps you understand social anxiety better, how it works, why you have it, what can be done about the situation, and how to build your confidence in the long-term.You are going to learn A to Z what it takes to not only know what causes social anxiety, but essentially how to overcome social anxiety and gain confidence in the long term so you can lead a normal life again. What You'll Learn ✔ What is Social Anxiety?✔ How to overcome Social Anxiety: recognize your triggers✔ Tackling the list✔ Creating the conditions for overcoming anxiety and building confidence✔ Staying calm in the moment✔ Overcoming your anxiety with time✔ Additional tips to overcome social anxiety and shyness✔ And much, much more!There are many social anxiety books out there, but only few of them shed light on best practices and common mistakes associated with it, shyness and confidence. This book also touches the topics 'social anxiety disorder' and 'building confidence'.Don't wait any longer and get this book now for a discounted price!Tags: social anxiety, social anxiety disorder, shyness, social anxiety and shyness, social anxiety books, social anxiety and shyness, overcome social anxiety, overcome shyness, overcoming social anxiety, how to overcome shyness, overcoming shyness, managing social anxiety, confidence, building confidence",
  "genres": [],
  "author": "Scott Cooper",
  "average_rating": "4.17",
  "url": "https://www.goodreads.com/book/show/26109607-the-social-anxiety-shyness-cure"
}