{
  "title": "Ex-Con",
  "description": "Shocked by an act of bravery, and intrigued by a stranger's good looks and demanding demeanor, Emily Stewart agrees to let a man walk her to her car. She had no idea at the time that this was exactly what Jackson Shephard had hoped for.Jackson \"Big Jack\" Shephard rides with the Hell's Fury MC. He's big, not afraid of any man, and goes to great lengths to provide protection to his club brothers and those he loves. He lives by a code most men couldn't begin to understand. He's faithful in life and love, and he never breaks a promise. Emily \"Em\" Stewart knows Jack is inherently different in all regards. Em has never had a man provide her with enough excitement, praise, or variety to keep her attention for long. As a result, she's never had a relationship. Until that night when a muscular tattooed biker steps in to her life and 'takes care of' the abuser. Jack can only be with one type of woman; the type who lets him call the shots in the bedroom. Emily agrees to an exclusive relationship, because her heart and being know no other way and because Jack isn't one to cheat, lie, or do anything but love completely and love HARD. There's one BIG problem. An undercover ATF agent. Will this shatter what they've built, will the walls crumble, and will Jack go to prison?If he does will their bond survive?EX-CON is a stand-alone, no cheating, no sex outside the relationship, HEA story of love, loss, second chances, and living life outside of the boundaries most citizens live in. EX-CON depicts life of in Outlaw Motorcycle Club and life in prison with accuracy. It is Book V in the Selected Sinners series of MC Erotic Romance novels, and is able to be enjoyed fully as a stand-alone. This series of MC Romance novels has no club whores, no cheating, and no typical MC Romance drama. To experience the series in full, Making the Cut, Taking the Heat, Otis, Hung, and EX-CON may, however, all be read (in that order).",
  "genres": [
    "BDSM",
    "Romance",
    "Audiobook",
    "Contemporary Romance",
    "Erotica",
    "Contemporary",
    "Erotic Romance"
  ],
  "author": "Scott Hildreth",
  "average_rating": "4.31",
  "url": "https://www.goodreads.com/book/show/26110891-ex-con"
}