{
  "title": "For the Glory: Eric Liddell's Journey from Olympic Champion to Modern Martyr",
  "description": "The untold and inspiring story of Eric Liddell, hero of Chariots of Fire , from his Olympic medal to his missionary work in China to his last, brave years in a Japanese work camp during WWIIMany people will remember Eric Liddell as the Olympic gold medalist from the Academy Award winning film Chariots of Fire . Famously, Liddell would not run on Sunday because of his strict observance of the Christian sabbath, and so he did not compete in his signature event, the 100 meters, at the 1924 Paris Olympics. He was the greatest sprinter in the world at the time, and his choice not to run was ridiculed by the British Olympic committee, his fellow athletes, and most of the world press. Yet Liddell triumphed in a new event, winning the 400 meters in Paris.Liddell ran--and lived--for the glory of his God. After winning gold, he dedicated himself to missionary work. He travelled to China to work in a local school and as a missionary. He married and had children there. By the time he could see war on the horizon, Liddell put Florence, his pregnant wife, and children on a boat to Canada, while he stayed behind, his conscience compelling him to stay among the Chinese. He and thousands of other westerners were eventually interned at a Japanese work camp.Once imprisoned, Liddell did what he was born to do, practice his faith and his sport. He became the moral center of an unbearable world. He was the hardest worker in the camp, he counseled many of the other prisoners, he gave up his own meager portion of meals many days, and he organized games for the children there. He even raced again. For his ailing, malnourished body, it was all too much. Liddell died of a brain tumor just before the end of the war. His passing was mourned around the world, and his story still inspires.In the spirit of The Boys in the Boat and Unbroken , For the Glory is both a compelling narrative of athletic heroism and a gripping story of faith in the darkest circumstances.",
  "genres": [
    "Biography",
    "Nonfiction",
    "History",
    "Sports",
    "Christian",
    "Biography Memoir",
    "Audiobook"
  ],
  "author": "Duncan Hamilton",
  "average_rating": "4.29",
  "url": "https://www.goodreads.com/book/show/26109437-for-the-glory"
}