{
  "title": "Oneida: From Free Love Utopia to the Well-Set Table",
  "description": "A fascinating and unusual chapter in American history about a religious community that held radical notions of equality, sex, and religion—only to transform itself, at the beginning of the twentieth century, into a successful silverware company and a model of buttoned-down corporate propriety.In the early nineteenth century, many Americans were looking for an alternative to the Puritanism that had been the foundation of the new country. Amid the fervor of the religious revival known as the Second Great Awakening, John Humphrey Noyes, a spirited but socially awkward young man, attracted a group of devoted followers with his fiery sermons about creating Jesus’ millennial kingdom here on Earth. Noyes established a revolutionary community in rural New York centered around achieving a life free of sin through God’s grace, while also espousing equality of the sexes and “complex marriage,” a system of free love where sexual relations with multiple partners was encouraged. Noyes’s belief in the perfectibility of human nature eventually inspired him to institute a program of eugenics, known as stirpiculture, that resulted in a new generation of Oneidans who, when the Community disbanded in 1880, sought to exorcise the ghost of their fathers’ disreputable sexual theories. Converted into a joint-stock company, Oneida Community, Limited, would go on to become one of the nation’s leading manufacturers of silverware, and their brand a coveted mark of middle-class respectability in pre- and post-WWII America.Told by a descendant of one of the Community’s original families, Ellen Wayland-Smith's Oneida is a captivating story that straddles two centuries to reveal how a radical, free-love sect, turning its back on its own ideals, transformed into a purveyor of the white-picket-fence American dream.",
  "genres": [
    "History",
    "Nonfiction",
    "Religion",
    "American History",
    "Cults",
    "Audiobook",
    "Book Club"
  ],
  "author": "Ellen Wayland-Smith",
  "average_rating": "3.56",
  "url": "https://www.goodreads.com/book/show/26114413-oneida"
}