{
  "title": "Dark Harvest Legacy of Frankenstein*OP",
  "description": "What if Frankenstein got it right? What if Victor Frankenstein had embraced his discoveries rather than seeking to destroy them? Rejected by his peers and his family, hunted by the Creature, Victor slips into the background of history. Manipulating people, events, whole countries, Frankenstein slowly plans and executes his revenge. Carved out of the Balkan conflicts of the mid-1800's, Victor Frankenstein hijacks the unification of Romania and creates his own Promethea. Established on high ideals of equality and scientific advancement for the good of all, the reality is very different. Creating Promethea saw Victor make deals that compromised the integrity of his vision. Almost literally walled off from the rest of Europe, Promethea is a nightmare where the rich elite feed off the beauty and strength of the poor. While incredible advances across all scientific disciplines promise a bright future, the land is blighted by a new feudal regime - the Harvest. Even as Frankenstein moves to bring Promethea in line with his original vision, so he is stalked by the Creature. Seeking to destroy all his creator's works, the Creature and the resistance movement he leads often find they share Frankenstein's goals. Both Victor and the Creature know that Frankenstein's gift must never escape the fortified borders of Promethea, bringing the dark harvest to all the world. Dark Legacy of Frankenstein is a detailed, fascinating game setting, a terrifyingly plausible alternative history and a fiction anthology; a gothic horror fantasy that will appeal to gamers and the general public alike. A standalone product, Dark Legacy of Frankenstein uses a version of the Heresy Engine system and is fully compatible with the Victoriana 2nd Edition, also available from Cubicle 7 Entertainment.",
  "genres": [],
  "author": "Iain Lowson",
  "average_rating": "4.40",
  "url": "https://www.goodreads.com/book/show/11674757-dark-harvest-legacy-of-frankenstein-op"
}