{
  "title": "The Empty Ones",
  "description": "1977 was a bad year for Carey: The NYC summer was brutally hot, he barely made rent on his apartment, and most of his friends were butchered by a cult that worships the quantum angel he helped give birth to. He needs a vacation. You know where there’s supposed to be a killer punk scene? London. Oh, plus the leader of the aforementioned murderous cult is building an army there in an attempt to solve the world, once and for all. Time to mix business with pleasure. Along the way, maybe he’ll make some friends that won’t try to kill him, or even meet a nice girl who eats angels for supper and can kick a man in half. 1978 is looking better already…2013 was a bad year for Kaitlyn, too: LA was distinctly unkind to her aspirations towards a career in stunt work, she hooked up with her childhood crush—a B-list celebrity heartthrob named Marco—and he turned out to be an immortal psychopath trying to devour her soul, and she accidentally killed the angel Marco and his bizarre cult worshipped. Now she’s on the run through the American Southwest. She heard Marco’s filming a new show in Mexico, though, so all she has to do is cross the border, navigate a sea of acidic sludge monsters, and find a way to kill an unkillable monster before he sacrifices her and her friends to his extra-dimensional god. Nobody said a career in the entertainment industry would be easy.Following on the heels of his hilarious and horrifying novel The Unnoticeables, Robert Brockway’s The Empty Ones is like any good punk band: just when you think it can’t get any louder, they somehow turn it up a notch. It’s terrifying and hilarious, visceral and insane, chaotic and beautiful.“The Unnoticeables is a nightmarish and hilarious tour through modern-day Hollywood, the 1970s New York punk scene, and Robert Brockway’s own diseased mind.” —David Wong",
  "genres": [
    "Horror",
    "Fantasy",
    "Urban Fantasy",
    "Fiction",
    "Supernatural",
    "Humor",
    "Paranormal"
  ],
  "author": "Robert Brockway",
  "average_rating": "4.12",
  "url": "https://www.goodreads.com/book/show/26114236-the-empty-ones"
}