{
  "title": "Take a Risk Bundle",
  "description": "The Take a Risk bundle by USA Today best selling author Robin Bielman includes three of her popular Take a Risk novellas plus an additional, never-before-published novella, One Night of Risk. Worth the RiskSamantha Bennett put Dean Malloy out of her mind five years ago, when he broke her heart after a summer fling. But now he's back in her life, and ready to steal a heritage protection contract that could make or break her career-if he doesn't steal her heart first. Samantha's vowed to hate him, but one wild weekend could change everything. Risky SurrenderWhen Keats McCall catches Lucy Davenport at his latest project, he suspects she's up to no good. She's secretive, sexy as hell-and has trouble written all over her. He devises a plan to keep her close so he can watch her. But what he isn't prepared for is just how close he wants to get.His Million Dollar RiskCharlize Beckett is in deeeep trouble. This is her one chance to prove to her publisher dad that she's a serious reporter, even if she has to pretend she's someone else. And the subject of the story, Connor Gibson, is way too charming for her to maintain any objectivity, or even keep her from getting into all kinds of sexy trouble. By going off the record, Charlie is putting both her reputation and her heart on the line...One Night of RiskWith her mom sick, good girl Malia Davis has returned to Kauai in order do something bad-retrieve a piece of crystal believed to have healing properties. She thinks her only problem is accessing the \"closed to the public\" temple. She's wrong. She has an even bigger problem-former Navy SEAL and security expert Clay Doherty, the guy who broke her heart ten years ago who she still wants. Certain that Malia is up to no good, Clay will do whatever it takes to protect her...even if it means losing her for good.",
  "genres": [
    "Romance",
    "Contemporary",
    "Novella"
  ],
  "author": "Robin Bielman",
  "average_rating": "4.46",
  "url": "https://www.goodreads.com/book/show/26114720-take-a-risk-bundle"
}