{
  "title": "The Rookie",
  "description": "Number one draft pick, Legend James—soon to be back up quarterback for the Dallas Destroyers hates the press. Especially when a scathing article about his love life reveals 22 dates in four years with only 3 repeat dates and calls him a ‘cold hearted snake.’—Who is this reporter and how come she clearly copied Paula Abdul’s song. Charity Saint only cares about one thing…being a reporter for the new york times—who cares, that her long time high school boyfriend, Paul.—he cheated on her…is that what you wanted to hear? Who cares, she didn’t need a man, she never would again. She’d gotten lost in Paul and she would never do that with a man, again! When the opportunity to get noticed by them in exchange for studying the arrogant, cocky, too big for his britches, Legend James comes along—she takes it. And though writing about peoples love life’s isn’t where she wants to go in her career—it does get her foot in the door for the job. Until Legend calls for her head and she loses the job. To add insult to injury, he shows up at the bed and breakfast she helps her mother run and then---to top it all off—when she gets a call that her grandfather’s had a stroke—he has the nerve to offer her a ride to the hospital in Park City. Legend has no idea why he ends up staying in Park City, and definitely doesn’t understand what insane, masochistic thing makes him want to help Ms. Saint---a saint—is definitely what she is not. When Legend gives her the chance to write a real story on him, and she takes it—she never imagined sky diving, mountain biking, and sitting with her by her grandfather’s hospital bed would make her do something she told herself she wouldn’t do—like him. Legend can’t describe why hauling her grandfather’s record player and Beattle albums to the hospital and offering to give her an exclusive interview, something he hates doing—is actually what he wants to do for her. When the New York Times offer her her job back and Legend gets the announcement that the Destroyers really want him---will both of them decide getting what they want is enough—or will they make one more rookie move?",
  "genres": [
    "Romance",
    "Sports",
    "Contemporary",
    "Clean Romance",
    "Fiction",
    "Chick Lit",
    "Football"
  ],
  "author": "Taylor Hart",
  "average_rating": "4.12",
  "url": "https://www.goodreads.com/book/show/26116602-the-rookie"
}