{
  "title": "What a Fish Knows: The Inner Lives of Our Underwater Cousins",
  "description": "A New York Times Bestseller Do fishes think? Do they really have three-second memories? And can they recognize the humans who peer back at them from above the surface of the water? In What a Fish Knows, the myth-busting ethologist Jonathan Balcombe addresses these questions and more, taking us under the sea, through streams and estuaries, and to the other side of the aquarium glass to reveal the surprising capabilities of fishes. Although there are more than thirty thousand species of fish—more than all mammals, birds, reptiles, and amphibians combined—we rarely consider how individual fishes think, feel, and behave. Balcombe upends our assumptions about fishes, portraying them not as unfeeling, dead-eyed feeding machines but as sentient, aware, social, and even Machiavellian—in other words, much like us. What a Fish Knows draws on the latest science to present a fresh look at these remarkable creatures in all their breathtaking diversity and beauty. Fishes conduct elaborate courtship rituals and develop lifelong bonds with shoalmates. They also plan, hunt cooperatively, use tools, curry favor, deceive one another, and punish wrongdoers. We may imagine that fishes lead simple, fleeting lives—a mode of existence that boils down to a place on the food chain, rote spawning, and lots of aimless swimming. But, as Balcombe demonstrates, the truth is far richer and more complex, worthy of the grandest social novel. Highlighting breakthrough discoveries from fish enthusiasts and scientists around the world and pondering his own encounters with fishes, Balcombe examines the fascinating means by which fishes gain knowledge of the places they inhabit, from shallow tide pools to the deepest reaches of the ocean. Teeming with insights and exciting discoveries, What a Fish Knows offers a thoughtful appraisal of our relationships with fishes and inspires us to take a more enlightened view of the planet’s increasingly imperiled marine life. What a Fish Knows will forever change how we see our aquatic cousins—the pet goldfish included.",
  "genres": [
    "Science",
    "Nonfiction",
    "Animals",
    "Nature",
    "Biology",
    "Audiobook",
    "Popular Science"
  ],
  "author": "Jonathan Balcombe",
  "average_rating": "4.21",
  "url": "https://www.goodreads.com/book/show/26114430-what-a-fish-knows"
}