{
  "title": "A Mate for York",
  "description": "Standalone Vampire Romance Novel  Have you ever wanted to date a vampire? Human women required. Must be enthusiastic about interactions with vampires. Must be willing to undergo a stringent medical exam. Must be prepared to sign a contractual agreement which would include a non-disclosure clause. Limited positions available…  York has always wanted a female of his very own. One to love and care for. One who will love him in return. More than anything he wants a family… he longs to hear the sound of children’s laughter filling his home. It is his deepest desire.  Since most vampire females are not able to birth young, a program is started to ensure the continuation of the vampire species. The vampire elite must fight, fist and fang, for a much sought after place in the program and a chance to date human women.  There are a multitude of beautiful human females in attendance. They have been handpicked to ensure that they are irresistible to vampire males. Why is it then that York wants the one female he can’t have?  When Cassidy is selected for the trial phase of the program, she is ecstatic. This is the break she’s been waiting for. Her job is to root out any vampires with bloodlust. She’s quaking in her boots because she could end up dead. This position certainly isn’t for sissies. Thing is, it’s only three days of her life. All she needs to do is to allow a few of them to drink from her and survive long enough to get paid. Then she’s home free. Besides, she quit her job in order to be here so she so doesn’t have any other options available to her. Three days… pity one big, badass vampire is determined to get in the way of her plans.  The story contains strong sexual themes/language and is not intended for readers under the age of 18.  This is a standalone novel. No cliffhanger!",
  "genres": [
    "Vampires",
    "Paranormal",
    "Paranormal Romance",
    "Romance",
    "Erotica",
    "Fantasy",
    "Audiobook"
  ],
  "author": "Charlene Hartnady",
  "average_rating": "3.98",
  "url": "https://www.goodreads.com/book/show/26116818-a-mate-for-york"
}