{
  "title": "Vampire Ascension: A Teen Vampire Romance",
  "description": "Three unlikely friends do everything in their power to stop a war that's killing thousands.When seventeen-year-old Gertie leaves New York to study abroad in Athens, she learns that vampires and demigods are real and unwittingly becomes a catalyst to an uprising led by Dionysus, lord of the vampires.In this final installment, Gertie, Jeno, and Hector struggle to bring a peaceful resolution to the war in Athens, but any success they make comes at great cost. How many more people must die for freedom and justice? The teens quickly learn that nothing is fair in love and war. Sometimes even love requires a terrible price.PG 13: Contains violence, mild language, and no sex.\"This is a pure work of art. Anyone who loves vampires and romance should love this amazing spin. I’ll definitely be looking out for more... although - beware - it broke my heart in the end - like I said - you get emotionally involved.\"--Dawn E. Gilliland, Amazon Reviewer ★★★★★\"Please continue to write these fab books. More of the same please. Have reread all three back to back.\"--kriss Sharpe, Amazon Reviewer ★★★★★\"Eva Pohler is an excellent writer. She is considerate of the reader's understanding and provides interesting twists and turns assuring the reader never gets bored!\"--Vellie, Amazon Reviewer ★★★★★\"Couldn't put it down. Quick read. Fun story line. Great use of Greek mythology.\"--Loren, Amazon Reviewer ★★★★★\"Absolute EPIC conclusion to an awesome tale of vampires and Greek mythology!\"--Jeanine Palinkas, Amazon Reviewer ★★★★★Grab your copy to continue the exciting adventure today!Related  C. Gockel, Anthea Sharp, Susan Kaye Quinn, Cassandra Clare, Chanda Hahn, Quinn Loftis, Kim Richardson, S.T. Bende, Karen Lynch, Kimberly Loth, Richelle Mead, M. Lynn, Allie Burton, Ashley McLeo, Frost Kay, Cameo Renea, Elise Kova, Nicole Zoltack, A.L. Knorr, Kay L. Moody, Melissa Craven, Laura Thalassa, Rose Garcia, Holly Hook, Robin D. Mahle, Elle Madison, Raye Wagner, Elisa S. Amore, Stephenie Meyer, Tracy Wolff, J.L. Weil, P.C. Cast, L.J. Smith.",
  "genres": [
    "Fantasy",
    "Romance",
    "Vampires"
  ],
  "author": "Eva Pohler",
  "average_rating": "4.27",
  "url": "https://www.goodreads.com/book/show/26121411-vampire-ascension"
}