{
  "title": "The Quantum Cosmic Affirmations - Inspirational Channeling of Light Vibrations",
  "description": "General Description of the program It is a very light software for your ‘operating system’ – consciousness, which will help you to run your ‘every day program’ smoothly, in harmony (harmonizing all your hormones) with the Universal Stream of Light!!! It is a software of Attunements on the vibrations of Pure Divine Love and Deep Inner Peace, which will Harmonize and Balance All spheres of Your Life!!! Just take it easy and enjoy creating these light formulas everyday, additionally to your everyday meditation and yoga practice!!! Have Fun in Uplifting Your Spirit into the New Dimension of Great inspiration and ‘Bliss of Peace’!!! Ana-Stasi Fennell, MA in Ed.COSMIC AFFIRMATION: In the infinite consciousness itself lives the vision and recognition of the uncontradicted truth that all life is shrouded by a unique and stable source of existence. A source enchanted by the Mistress of Creation to rediscover the \"I\" of self-awareness. I am born of her movement and appreciation for a world appearance as Spirit's sparkling depths. In the clearest moments I know I am an intentional action of universal truth which can never change. It is this knowledge that empowers me to declare that I am a spark of light through which cosmic truth shines. I cannot be limited by the countless reflections that constitute the appearance of the world. I am a Creational Force in human form that is here to love all that I love from the beginning, to discover new dimensions, and to be the cosmic station radiating love frequency energy. I'm totally united with my cosmic divine Spirit and I'm here on Earth to support Cosmic Nirvana Network and the Paradise Codes for the benefit of all...",
  "genres": [],
  "author": "Ana-Stasi Fennell",
  "average_rating": "3.50",
  "url": "https://www.goodreads.com/book/show/26120705-the-quantum-cosmic-affirmations---inspirational-channeling-of-light-vibr"
}