{
  "title": "A Bachelor Still",
  "description": "What’s a sworn bachelor to do when forced to wed the woman of his dreams?Liana McElreath is in need of a hero. After her father bargains away her innocence to settle a gambling debt, she stands at the altar, about to be wed to the worst sort of villain. The last man she expects to come charging to her rescue is the Marquess of Courtland, her brother’s dearest friend and the last remaining Free Fellow.Alexander Courtland has no desire to be leg-shackled for life to some society miss. But nor can he stand idly by and watch as the lovely Liana is sacrificed at the altar of matrimony. When he decides he has no choice but to step into the role of her bridegroom, he vows to give her his name, but not his heart.Alex soon finds that heart softening beneath Liana’s tender touch. And once a man starts to realize he may be at risk of losing the love of a lifetime, how is he to remain…A Bachelor Still?The “Free Fellows League” Series includes BARELY A BRIDE, MERELY THE GROOM, HARDLY A HUSBAND, TRULY A WIFE, A BACHELOR STILL and CLEARLY A COUPLE (a novella in TALK OF THE TON)“Tender, enthralling romance straight from the heart!”—Eloisa James, New York Times bestselling author“Sparkling romance and passion that sizzles…Rebecca Hagan Lee taps into every woman’s fantasy!”—Christina Dodd, New York Times bestseller“Merely the Groom is a perfect 10!”—Romance Reviews Today“Merely the Groom is another wonderful story in the Free Fellows League Series!”—The Romance Reader’s Connection“Barely a Bride is a wonderfully charming tale. Intelligent and witty!”—Romance Reviews Today“Barely a Bride is a superb novel!”—The Best Reviews“Barely a Bride is simply luscious!”—The Romance Reader’s Connection",
  "genres": [
    "Historical",
    "Romance",
    "Historical Romance",
    "Historical Fiction",
    "British Literature"
  ],
  "author": "Rebecca Hagan Lee",
  "average_rating": "4.23",
  "url": "https://www.goodreads.com/book/show/26119750-a-bachelor-still"
}