{
  "title": "Stardust and Ash",
  "description": "Stardust and Ash is a collection of seven science fiction short stories and eight poems, each tied together by a theme of tragedy, loss, and accepting our own mortality. Each story shows the darker side of the human condition. Whether planted firmly on Earth or residing in the far-flung corners of our galaxy; whether living in the present day or in the distant future, the human experience remains much the same. Though we can experience much joy in life, we also must experience much sorrow and pain. The stories in this collection illustrate the latter. Don't expect a happily ever after from the stories collected in Stardust and Ash.These stories and poems were written between 2009 and 2015 and are collected for the first time in this single digital edition.The Android - An eccentric millionaire has his body cryonically frozen when he dies, in hopes that he can be revived at some point in the future. He wakes up in the future with his consciousness transferred into the body of an android.The Escapee - In the midst of an alien attack, one crew member manages to escape in an emergency escape pod, leaving behind the rest of the crew. No one comes for help, and she is stuck alone drifting through space in the escape pod for months.The Garbage Collector - In the future, Earth begins disposing of its waste via a black hole. The unthinkable happens to one garbage man while on duty.The Satellite - The Satellite is the first manned spacecraft to be sent to Mars. Commander Martin Stone describes what he is seeing above the Cydonia region of Mars.The Colonist - A man named Blake is selected to become one of the first people to colonize Mars. Though his ex-girlfriend begs him to stay, he can't wait to leave behind a planet that has nothing to offer him.Abduction - After losing control of their craft, one of the members of a surveillance mission wakes up on an alien operating table, surrounded by strange beings. She is helpless to escape.Dust and Ash - Two lovers spend their final moments on Earth together as they await a nuclear explosion.",
  "genres": [],
  "author": "Jennifer Wilber",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/26117037-stardust-and-ash"
}