{
  "title": "The Keeneston Roses",
  "description": "Alternate Cover Edition can be found here  The Bluegrass book everyone has been asking for is finally here. The Rose sisters have survived the lows and enjoyed the highs throughout their lives. See what events shaped Keeneston's most beloved siblings.  Lily Rae Rose has been headstrong since she was a child. She was the oldest, after all. Maybe that’s why she fell for the bad boy next door. But Lily learns that not all bad boys can be reformed. After suffering the pain of a broken heart, Lily dedicated herself to finding the perfect match for her friends. This let her enjoy the benefits of love without the pain. Until town gossip John Wolfe forced her to confront the pain of the past.  Daisy Mae Rose may only be minutes apart from her two sisters, but she always felt invisible as the middle sister. When a man makes her the center of attention, Daisy blooms under his loving care. That is, until he joins the war effort and leaves her behind forever. But there was someone else who had loved Daisy in high school, and now he has returned. At their 70th high school reunion, he decides to see if there’s a reason to move back to Keeneston.  Violet Fae Rose was always the wild one. After high school, she did the unthinkable for a single woman in the early 1960s . . . she left the small town of Keeneston and went to culinary school in France. While in the City of Love, Violet falls madly in love with the one person she shouldn’t. Violet quickly finds out the downside of a forbidden romance and runs away to the French countryside to lose herself in her cooking. But sometimes it takes returning home to fully put things back together. Violet finds peace in playing matchmaker with her sisters for many years. And then one day, Violet finds herself on the receiving end of someone else's matchmaking.  Time can heal many wounds, but the Rose sisters' wounds run very deep. Will the three sisters finally find true love during their golden years? And better yet, can Keeneston even handle three Rose sisters in love?",
  "genres": [
    "Romance",
    "Contemporary",
    "Contemporary Romance",
    "Family",
    "Romantic Suspense",
    "Audiobook",
    "Chick Lit"
  ],
  "author": "Kathleen Brooks",
  "average_rating": "4.61",
  "url": "https://www.goodreads.com/book/show/26120207-the-keeneston-roses"
}