{
  "title": "Eaglechild",
  "description": "Rupert Carlos is the only son of an English Earl and a Spanish Countess.The Earl tries to persuade Rupert that the “Red Indians” of North America are the losers in the battle for survival because their cultures are weak and inferior. He thinks of himself and his ancestors as swashbuckling Protestant capitalists. He is proud of his family’s involvement in the Hudson’s Bay Company which colonised vast areas of Canada on behalf of the British Empire.However, the Countess feels guilty because her aristocratic ancestors exploited los Indios since the times of Columbus. She is a Catholic, but open to an unorthodox belief in “natural priesthood” and other “ways of knowing” such as shamanism. As such, she wants to use her immense wealth, her Spanish titles and her son’s future role in the British House of Lords, to make restitution to the Indians of all the Americas from the Arctic to the Antarctic.In his attempt to cope, the intelligent and sensitive young Rupert creates his own secret world in the woodlands of his father’s estate in Oxfordshire, complete with a tipi and an imaginary Indian blood brother.In 1982, while an undergraduate at Oxford, Rupert encounters Clearvoice, an 82-year-old Cree Indian “troublemaker” who has come to England to meet the “White Queen”. He confronts the British Parliament and demands that it honour the treaty Queen Victoria made with his grandfather on the Canadian prairies in 1876. His visit is also the fulfilment of a Vision Quest dream he experienced when he was sixteen years of age.As Rupert emerges into manhood, his search for an authentic role in the midst of these conflicting cosmologies is complicated by a corrupt official at the Canadian embassy in London whose scheming triggers a chain of shocking events that forces Rupert to re-evaluate all his beliefs and loyalties.The story of the novel also features a Blackfoot-Cree Holy Woman from Alberta and a Jesuit with Christian-Marxist tendencies from Seville. All these complex characters are swept up in mystery and suspense by a plot that twists and turns until the last page. Although it is a modern story, the first four chapters include references to more than a hundred years of relations between Britain and the Indian nations told from both points of view.Set mainly in 1982-85 in England, Canada and Spain, it is fiction inspired by fact in a rich mixture of politics, religion, family and tribe. It demonstrates how the search for personal identity and integrity can play a vital role in nation-building.The novel is unusually long because it is two books in one. Book 1 consists of four chapters in which the main characters transport the reader into their four quite different cosmologies. Book 2 deals with the conflict between these four worlds between 1982 and 1985.",
  "genres": [
    "Historical Fiction"
  ],
  "author": "Victor O'Connell",
  "average_rating": "3.93",
  "url": "https://www.goodreads.com/book/show/26117817-eaglechild"
}