{
  "title": "Winter Oranges",
  "description": "A Love for the Holidays charity novel  Jason Walker is a child star turned teen heartthrob turned reluctant B-movie regular who’s sick of his failing career. So he gives up Hollywood for northern Idaho, far away from the press, the drama of LA, and the best friend he’s secretly been in love with for years.  There’s only one problem with his new a strange young man only he can see is haunting his guesthouse. Except Benjamin Ward isn’t a ghost. He’s a man caught out of time, trapped since the Civil War in a magical prison where he can only watch the lives of those around him. He’s also sweet, funny, and cute as hell, with an affinity for cheesy ’80s TV shows. And he’s thrilled to finally have someone to talk to.  But Jason quickly discovers that spending all his time with a man nobody else can see or hear isn’t without its problems—especially when the tabloids find him again and make him front-page news. The local sheriff thinks he’s on drugs, and his best friend thinks he’s crazy. But Jason knows he hasn’t lost his mind. Too bad he can’t say the same thing about his heart.  * * * * * * *  Twenty percent of the proceeds from this title will be donated to the Gay, Lesbian, Bisexual and Transgender (GLBT) National Help Center.  Founded in 1996, the GLBT National Help Center is a non-profit organization that provides vital peer-support, community connections and resource information to people with questions regarding sexual orientation and/or gender identity. Utilizing a diverse group of GLBT volunteers, they operate two national hotlines, the GLBT National Hotline and the GLBT National Youth Talkline, as well as private, volunteer one-to-one online chat, that help both youth and adults with coming-out issues, safer-sex information, school bullying, family concerns, relationship problems and a lot more.  To learn more about this charity or to donate directly, please visit their website at glbthotline.org.",
  "genres": [
    "M M Romance",
    "Paranormal",
    "Romance",
    "Fantasy",
    "Christmas",
    "Contemporary",
    "Holiday"
  ],
  "author": "Marie Sexton",
  "average_rating": "4.10",
  "url": "https://www.goodreads.com/book/show/26117781-winter-oranges"
}