{
  "title": "The Lost",
  "description": "Darkly haunting erotica with the taboo appeal of V.C. Andrews.\"If the romantic character study is a genre, this fascinating contemporary novel is its exemplar. McCade digs deep into the difficult topics of rape, incest, and sexual abuse via the remarkable voice of Clarissa Leigh VanZandt.\" - Publishers WeeklyThere's something wrong with Leigh.She's known it her whole life. She knows it every time she spreads her legs. Every time she begs for the pain, the pleasure, the heat of a hard man driving deep inside. She's a slave to her own twisted lusts--and it's eating her alive. She loves it. She craves it. Sex is her drug, and she's always chasing her next fix. But nothing can satisfy her addiction, not even the nameless men she uses and tosses aside. No one's ever given her what she truly needs.Until Gabriel Hart.Cold. Controlled. Impenetrable. Ex-Marine Gabriel Hart isn't the kind of man to come running when Leigh crooks her pretty little finger. She loathes him. She hungers for him. He's the only one who understands how broken she is, and just what it takes to satisfy the emptiness inside. But Gabriel won't settle for just one night. He wants to claim her, keep her, make her forever his. Together they are the lost, the ruined, the darkness at the heart of Crow City.But Leigh has a darkness of her own. A predator stalking through her past--one she'll do anything to escape.Even if it means running from the one man who could love her...and leaving behind something more precious to her than life itself.TRIGGER WARNING: 18+This book contains material that may be triggering or deeply disturbing to some readers, including scenes discussing or detailing rape, physical and emotional abuse, and incest. Please focus on self-care and, if this book is triggering to you, do not be afraid to put it down and walk away, or skip certain chapters. Be good to yourselves. -C",
  "genres": [
    "Dark",
    "Romance",
    "Abuse",
    "Erotica",
    "Adult",
    "Contemporary",
    "Military Fiction"
  ],
  "author": "Cole McCade",
  "average_rating": "3.99",
  "url": "https://www.goodreads.com/book/show/26119463-the-lost"
}