{
  "title": "Darwin's Sacred Cause: How a Hatred of Slavery Shaped Darwin's Views on Human Evolution",
  "description": "An “arresting” and deeply personal portrait that “confront[s] the touchy subject of Darwin and race head on” (The New York Times Book Review).   It’s difficult to overstate the profound risk Charles Darwin took in publishing his theory of evolution. How and why would a quiet, respectable gentleman, a pillar of his parish, produce one of the most radical ideas in the history of human thought? Drawing on a wealth of manuscripts, family letters, diaries, and even ships’ logs, Adrian Desmond and James Moore have restored the moral missing link to the story of Charles Darwin’s historic achievement.   Nineteenth-century apologists for slavery argued that blacks and whites had originated as separate species, with whites created superior. Darwin, however, believed that the races belonged to the same human family. Slavery was therefore a sin, and abolishing it became Darwin’s sacred cause. His theory of evolution gave a common ancestor not only to all races, but to all biological life.   This “masterful” book restores the missing moral core of Darwin’s evolutionary universe, providing a completely new account of how he came to his shattering theories about human origins (Publishers Weekly, starred review). It will revolutionize your view of the great naturalist.   “An illuminating new book.” —Smithsonian   “Compelling . . . Desmond and Moore aptly describe Darwin’s interaction with some of the thorniest social and political issues of the day.” —Wired   “This exciting book is sure to create a stir.” —Janet Browne, Aramont Professor of the History of Science, Harvard University, and author of Charles Voyaging",
  "genres": [
    "History",
    "Science",
    "Biography",
    "Evolution",
    "Nonfiction",
    "Biology",
    "Anthropology"
  ],
  "author": "Adrian J. Desmond",
  "average_rating": "3.91",
  "url": "https://www.goodreads.com/book/show/26123640-darwin-s-sacred-cause"
}