{
  "title": "The Grand Slam: Bobby Jones, America, and the Story of Golf",
  "description": "From the bestselling author of the critically acclaimed The Greatest Game Ever Played comes The Grand Slam , a riveting, in-depth look at the life and times of golf icon Bobby Jones. In the wake of the stock market crash and the dawn of the Great Depression, a ray of light emerged from the world of sports in the summer of 1930. Bobby Jones, an amateur golfer who had already won nine of the seventeen major championships he'd entered during the last seven years, mounted his final campaign against the record books. In four months, he conquered the British Amateur Championship, the British Open, the United States Open, and finally the United States Amateur Championship, an achievement so extraordinary that writers dubbed it the Grand Slam. A natural, self-taught player, Jones made his debut at the U.S. Amateur Championship at the age of 14. But for the next seven years, Jones struggled in major championships, and not until he turned 21 in 1923 would he harness his immense talent. What the world didn't know was that throughout his playing career the intensely private Jones had longed to retreat from fame's glaring spotlight. While the press referred to him as \"a golfing machine,\" the strain of competition exacted a ferocious toll on his physical and emotional well-being. During the season of the Slam he constantly battled exhaustion, nearly lost his life twice, and came perilously close to a total collapse. By the time he completed his unprecedented feat, Bobby Jones was the most famous man not only in golf, but in the history of American sports. Jones followed his crowning achievement with a shocking his retirement from the game at the age of 28. His abrupt disappearance from the public eye into a closely guarded private life helped create a mythological image of this hero from the Golden Age of sports that endures to this day.",
  "genres": [
    "Sports",
    "Biography",
    "Nonfiction",
    "History",
    "Audiobook"
  ],
  "author": "Mark Frost",
  "average_rating": "4.43",
  "url": "https://www.goodreads.com/book/show/1167728.The_Grand_Slam"
}