{
  "title": "La stagione del ritorno",
  "description": "Un'ombra si stende su Lirian, sulle Terre d'Oriente incombe la notte.L'odio, la guerra bruciano corpi e cuori.Nelle tenebre dorme una luce, solo un uomo potrà ridestarla.Riuscirà a sconfiggere il buio? Sarà capace si sacrificare tutto? Quarta di copertina:Nelle Terre d’Oriente si verificano strani delitti. Savìla e Lirian se ne addossano a vicenda la colpa. Diffidenza e sospetto si spargono come un veleno, dopo secoli di pace si torna a parlare di guerra. Pochi sanno che è un altro, il nemico: un’ombra maligna che penetra le menti degli uomini, che fa leva sul loro orgoglio per asservirli, per spingere i popoli a uno scontro totale.E la guerra esploderà, feroce fino alla barbarie, coinvolgendo tutte le Terre d’Oriente. L’unica speranza è un fiore d’argento, un talismano che solo un uomo potrà ritrovare.Sarà un cammino sull’orlo dell’abisso, un arduo viaggio per luoghi remoti ma anche all’interno di sé, a confronto coi propri demoni in una lotta dall’esito mai scontato.La Stagione del Ritorno è la storia di una discesa all’inferno e di una faticosa risalita, in un difficile percorso di maturazione di individui e popoli verso un nuovo equilibrio.Universo fantastico e realistico insieme, quello de “La Stagione del Ritorno” è un mondo dai tratti rinascimentali e mediterranei dove re e contadini, servitori e maghi si muovono tra intrighi di corte e incantesimi, creature del male e battaglie, eroismo e tradimento.Una storia a più voci narrata con una sensibilità moderna, attenta alle dinamiche interiori e interpersonali, agli interrogativi etici, ai conflitti, ai simboli.Un fantasy non convenzionale rivolto a lettori che amino immergersi in mondi complessi, lettori in cerca non solo di evasione, ma anche di stimoli di riflessione sui grandi temi dell’esistenza umana.Talismano in copertina dipinto dall'artista veneziana Fanny ZavaIn allegato mappa \"Le Terre d'Oriente\" formato cm.30x40Scheda completa del libro: http://bit.ly/1Ib9kE7",
  "genres": [],
  "author": "Angela Di Bartolo",
  "average_rating": "4.43",
  "url": "https://www.goodreads.com/book/show/26125732-la-stagione-del-ritorno"
}