{
  "title": "Walk, Don't Run: A Rockin’ and Rollin’ Memoir",
  "description": "“An epic story of show-biz dreams.”—Mike Foley“It’s this generation’s American Graffiti — it’s Happy Days slammed into Resurrection Boulevard.”—Rick Marcelli“Johnson’s memory for the adventures we shared breaking into show business is seamless.”—Edward James Olmos“Like a front-row seat to the action when rock ‘n’ roll was still young and exciting!”—Jason LillerKids, This Is Rock ‘N’ Roll: A Rockin’ and Rollin’ Memoir Made on the 1960s Sunset Strip in HollywoodHere is a story that is glamorous, inspiring, and gritty — a marvelous fusion of the ups, downs, and in-betweens of life and music and passion in 1960s Hollywood, California, the place where dreams are made and chased and, sometimes, die.When Steven “Rusty” Johnson, Eddie Olmos, and Joey Zagarino met in high school in 1962, the sky was the limit and rock ‘n’ roll stardom was a record deal away. These three friends forged a life-long friendship that would take them through triumph and tragedy, victory and defeat, success and failure — all in the pursuit of reaching the rock ‘n’ roll dream.This is not only the story of three dreamers, it is a true tale that shows that success — and life — is about taking it from the top, catching a good groove, and taking it one beat at a time.SOUNDTRACK INCLUDED WITH BOOK AND EBOOK!Walk, Don’t Run: A Rockin’ and Rollin’ Memoir is about passion and dreams — and music. That’s why this incredible book comes complete with an incredible soundtrack! When you get the book, you’ll also get the album that The Pacific Ocean featuring Edward James Olmos singin’ and screamin’ on vocals while Steven “Rusty” Johnson pounds away on the drums. All of it digitally remastered in high-quality mp3 format beautifully tagged and ready to be transferred to you favorite music device. It’s a riveting and exciting album that will take you back to a time when the music was loud, the cars were fast, and dreams were a record deal away.Track List of Album: 16 Tons • Road to Hell • My Shrink • Subterranean Homesick Blues • Track of My Tears • I Can’t Stand It • I Wanna Testify • 99 1⁄2 • Mickey’s Monkey(If you purchased the book or ebook elsewhere, please visit www.WalkDontRunTheBook.com to claim your soundtrack. You’re going to love it!)",
  "genres": [],
  "author": "Steven Jae Johnson",
  "average_rating": "4.75",
  "url": "https://www.goodreads.com/book/show/26129739-walk-don-t-run"
}