{
  "title": "This Man of Mine",
  "description": "How well can you truly know a person? What if the love of your life was the one person you didn't know if you could trust? I thought I met the love of my life. I thought he was my soulmate. I thought I could trust him with my life. But at what point do you truly know a person?I met Finn when I was a child. He was my best friend, my protector, my other half. Both of us had troubled childhoods, secrets we wanted to take to the grave, but somehow together we grew stronger. Our connection was the most important part of my life until the day everything fell apart. After Finn broke my heart, I decided to pour myself into my graduate studies with handsome Professor Bhear. His intellect and understanding inspired me and lead to our joint research and investigation of a local mystery. The lines soon became blurred as we delved deeper into the disappearance of local girls and I began to wonder exactly what Professor Bhear wanted from me. And then I met Rafe: serious, thoughtful and passionate. He was the antithesis of everything I believed in, yet I was drawn to him, like a moth to a flame. He excited me with his romanticism, yet, there was a frightening edge to him that I didn't understand. His pursuit of me was ruthless, captivating, all-consuming and that excited me.Then the emails started coming. And the calls. A dark mysterious stranger started wooing me. And something about our connection and his devotion to me ignites a yearning in me that can't be quenched or matched. I find myself drawn to this man, even though common sense tells me to be cautious. Intrinsically, I know I can trust him. I know his devotion and love are real. But then more girls start going missing. And I find myself caught up in a web of deceit, love and secrets that I don't know how to untangle. As I start to unravel the layers of all of the men in my life, I start to realize that nothing is ever as it seems and sometimes the ones we trust the most are the ones that can most shock us.",
  "genres": [],
  "author": "J.S. Cooper",
  "average_rating": "4.42",
  "url": "https://www.goodreads.com/book/show/26137245-this-man-of-mine"
}