{
  "title": "Stolen",
  "description": "Warning: This story is for mature adults only. It contains violence, mature and explicit content and non-consensual/dubious, graphic sexual activity that some readers may find upsetting. This is a dark erotic thriller, not to be confused with a dark romance. HERThis was never supposed to happen to me. I was smart. I was strong. I was a fucking first degree black belt for fuck's sake, but none of that mattered. Not when you're out-gunned and outnumbered. I was stolen from my life and thrown into the dark and hollow depths of human trafficking. But it’s not all glitter and rainbows...especially when it comes to him. He wants me beaten. He wants me broken. But most importantly, he just wants me and that's the scariest thing of all. I won't let him win. I won't let him break me. I'll come back like steel every time. Because in the end, what doesn't kill me will only make me stronger...HIMI'm not a very nice guy. I'm a terrible person in fact, but I'm not going to pretend to care. I have a billion-dollar empire to run that manifests carnage, blood, and money and I crave it all. Nothing ever got in my way, nothing stopped me. If I wanted something, I made it happen, that is until this damn red-head crawled into my life. Strong, defiant, and a mixed martial artist, she was everything I never expected to want in a woman. Breaking her down became an obsession as she'd always somehow pop back up like a damn weed I couldn't kill. It was addicting and it became harder and harder for me to pretend I didn't love the taste of her fire every time I covered her with my ice. I wanted more and I'll be damned if I didn't get it. Because in the end, I always get what I want. *NOTE: For every book that is sold, a portion of the proceeds will be donated to a charity that benefits victims of human trafficking.*",
  "genres": [
    "Dark",
    "Dark Romance",
    "Abuse",
    "BDSM",
    "Erotica",
    "Contemporary",
    "Romance"
  ],
  "author": "Jay Marie",
  "average_rating": "4.14",
  "url": "https://www.goodreads.com/book/show/26134502-stolen"
}