{
  "title": "A Doubter's Almanac",
  "description": "NEW YORK TIMES BESTSELLER • In this mesmerizing novel, Ethan Canin, the author of America America and The Palace Thief, explores the nature of genius, rivalry, ambition, and love among multiple generations of a gifted family.Milo Andret is born with an unusual mind. A lonely child growing up in the woods of northern Michigan in the 1950s, he gives little thought to his own talent. But with his acceptance at U.C. Berkeley he realizes the extent, and the risks, of his singular gifts. California in the seventies is a seduction, opening Milo’s eyes to the allure of both ambition and indulgence. The research he begins there will make him a legend; the woman he meets there—and the rival he meets alongside her—will haunt him for the rest of his life. For Milo’s brilliance is entwined with a dark need that soon grows to threaten his work, his family, even his existence. Spanning seven decades as it moves from California to Princeton to the Midwest to New York, A Doubter’s Almanac tells the story of a family as it explores the way ambition lives alongside destructiveness, obsession alongside torment, love alongside grief. It is a story of how the flame of genius both lights and scorches every generation it touches. Graced by stunning prose and brilliant storytelling, A Doubter’s Almanac is a surprising, suspenseful, and deeply moving novel, a major work by a writer who has been hailed as “the most mature and accomplished novelist of his generation.” Praise for A Doubter’s Almanac “551 pages of bliss . . . devastating and wonderful . . . dazzling . . . You come away from the book wanting to reevaluate your choices and your relationships. It’s a rare book that can do that, and it’s a rare joy to discover such a book.”—Esquire“[Canin] is at the top of his form, fluent, immersive, confident. You might not know where he’s taking you, but the characters are so vivid, Hans’s voice rendered so precisely, that it’s impossible not to trust in the story. . . . The delicate networks of emotion and connection that make up a family are illuminated, as if by magic, via his prose.”—Slate“Alternately explosive and deeply interior.”—New York (“Eight Books You Need to Read”) “A blazingly intelligent novel.”—Los Angeles Times “[A] beautifully written novel.”—The New York Times Book Review (Editors’ Choice)",
  "genres": [
    "Fiction",
    "Historical Fiction",
    "Literary Fiction",
    "Novels",
    "Contemporary",
    "Book Club",
    "Literature"
  ],
  "author": "Ethan Canin",
  "average_rating": "3.68",
  "url": "https://www.goodreads.com/book/show/26139748-a-doubter-s-almanac"
}