{
  "title": "You could never objectify me more than I've already objectified myself",
  "description": "'Dismissing the myth of poetry as precious self-expression outside of capitalism, Naughton’s writing consistently reflects on the mechanisms behind it. In You Could Never Objectify Me, Naughton points out that as soon as she publishes her intimate thoughts, they — and she — become commodities to be consumed. “I do make myself a product, but so do so many other people on the internet,” she said recently in a video chat. “This is what we have, this is what we’re working with.”But what’s most interesting about Naughton’s take on the topic is her decided ambivalence about it. She writes: I don’t want you to like my writing because you want to fuck me/I want you to want to fuck me because you like my writing … identity as masturbation fantasy. Rather than shying away from the implications that her online persona has on her sense of identity, she revels in the failings of that dichotomy, provocatively stoking a fire under questions about self and selling out that she doesn’t propose to answer.Naughton’s reaction to feeling objectified is to intensify that simplification of her personality to the point of absurdity, packing on perceived vulnerability until it becomes a deflective shield. “Before you can decide how weak I am, I’m just going to completely skewer myself so that you can’t do that to me,” she said. “Here I am just completely embarrassing myself or exposing myself so that you can’t.”' - Sarah Burke, \"Stick a fork in Alexandra Naughton\"\"Alexandra Naughton's poems are subversive, honest poems. They are in the spirit of resistance to dudebro culture and beefpizzle literature. This book is a heartless and utter rejection of the white cis male death grip on all our lives.\"- Dena Rash Guzman, Life Cycle (Dog On A Chain Press, 2013)Authored by Alexandra Naughton Cover design or artwork by Geoff Melville Edited by A. Razor US Trade PaperTrim Size: 5\" x 8\"Color: Black and WhiteRelated Categories: Poetry / Women Authors",
  "genres": [
    "Poetry"
  ],
  "author": "Alexandra Naughton",
  "average_rating": "4.46",
  "url": "https://www.goodreads.com/book/show/26133576-you-could-never-objectify-me-more-than-i-ve-already-objectified-myself"
}