{
  "title": "Souvenirs d'un survivant de la Shoah",
  "description": "Mendel (Manny) Steinberg a passé son adolescence dans les camps de concentration nazis d'Allemagne. Il a miraculeusement survécu alors que des millions ont péri. Voici son histoire. Né en 1925 dans le Ghetto juif de Radom, en Pologne, Manny a vite compris que les membres du peuple juif étaient de plus en plus marginalisés. En septembre 1939, ce fut l'invasion nazie, et le début du cauchemar. La population juive de la ville n'avait aucune chance de s'échapper et dut subir la famine, la torture, les abus sexuels et, enfin, la déportation. Souvenirs d'un survivant de la Shoah est le récit sincère d'un adolescent qui a survécu à quatre camps nazis : Dachau, Auschwitz, Vaihingen et Neckagerach. Soumis à la torture et aux humiliations, il s'est souvent posé ces deux terribles questions : « Pourquoi les Juifs ? » et « Pourquoi le reste du monde laisse-t-il ces horreurs arriver ? » Nous n'avons toujours pas de réponse. Stanley, le frère de Manny, avait sauté du wagon à bestiaux qui l'emmenait vers le camp d'extermination où sa mère et son petit frère devaient périr. Désespérément seul et affamé, Stanley a guetté l'intérieur du camp, espérant y apercevoir Manny et leur père. Une fois qu'il a découvert qu'ils comptaient parmi les prisonniers, il s'est rendu au garde. Leur emprisonnement fut marqué par la faim, le froid, les travaux forcés et la peur. Savoir que d'autres membres de leur famille étaient dans le même camp les maintenait en vie, mais, puisque dévoiler ce lien familial aurait signifié la mort, ils ont fait semblant de ne pas se connaître. Manny raconte qu'on lui a servi à manger de la chair humaine et qu'on l'a forcé à raser les cheveux des cadavres de femmes et de leur arracher les dents. En conservant toujours une photographie de sa chère mère dans son sabot, il a survécu miraculeusement aux sévices des camps de concentration allemands aux côtés de son frère et de leur père. Quand les Américains sont arrivés, en avril 1945, Manny n'était guère plus qu'un squelette vivant, avec plusieurs côtes cassées, souffrant d'une sérieuse condition pulmonaire et seulement vêtu d'une couverture sale et déchirée. Cette autobiographie fut écrite pour répondre à une promesse que Manny s'est faite à lui-même aux premiers jours de sa libération. En publiant ses souvenirs de l'Holocauste, il veut s'assurer que les générations futures n'oublieront jamais ce qui s'est passé durant la Deuxième Guerre mondiale. Ce récit est personnel, simple et direct. C'est une histoire racontée à travers les yeux d'un vieil homme qui se force à revivre des années de souffrance intense. Elle relate la cruauté humaine, mais est également un témoignage poignant du pouvoir de l'amour et de l'espoir.",
  "genres": [
    "Holocaust",
    "Nonfiction",
    "History",
    "Memoir",
    "War",
    "Historical",
    "Biography"
  ],
  "author": "Manny Steinberg",
  "average_rating": "4.51",
  "url": "https://www.goodreads.com/book/show/26134263-souvenirs-d-un-survivant-de-la-shoah"
}