{
  "title": "Die sechs Romane: Emma, Kloster Northanger, Mansfield Park, Stolz und Vorurteil, Überredung, Verstand und Gefühl",
  "description": "Alle sechs Romane Jane Austens in der Übersetzung von Ursula und Christian Grawe mit einem Nachwort: Emma, Kloster Northanger, Mansfield Park, Stolz und Vorurteil, Überredung, Verstand und Gefühl. Die inzwischen klassischen Übersetzungen von Ursula und Christian Grawe haben wesentlich dazu beigetragen, Jane Austen im deutschsprachigen Raum populär zu machen. Die Nachworte, die sie jedem Roman beigefügt haben, erschließen den Leser/-innen Jane Austens Welt.Zu den Romanen:Stolz und Vorurteil: Dieser Roman gehört zu den erfolgreichsten Liebesgeschichten der Weltliteratur. Eine gehörige Portion \"Stolz\" muss abgelegt und so manches \"Vorurteil\" aus dem Weg geräumt werden, bis Elizabeth und Mr. Darcy endlich ein Paar werden.Mansfield Park: Jane Austen bezaubert in \"Mansfield Park\" - jetzt auf dem Höhepunkt ihrer schriftstellerischen Karriere - durch Ironie, feine Satire und intensive Charakterzeichnungen. Das vehemente Engagement gilt auch hier dem Recht der Heldin auf Selbstbestimmung. Verstand und Gefühl: Ein Roman aus dem ländlichen England des 18. Jahrhunderts über die beiden Schwestern Elinor und Marianne, die bis zum Traualtar einen dornenreichen Weg zurücklegen müssen. Emma: Emma Woodhouse, Anfang Zwanzig, führt den Haushalt ihres gesundheitlich angeschlagenen Vaters. Das führt zu Missverständnissen und Liebeskummer. Doch nicht zuletzt wegen Emmas Humor lösen sich die Verwirrungen und Verwicklungen in einem guten Ende auf.Überredung: Acht Jahre ist es her, dass sich Anne Elliot von ihrem Vater überreden ließ, den Heiratsantrag Frederick Wentworths zurückzuweisen. Als sich beide eines Tages wieder begegnen, beginnt eine zaghafte Annäherung, die in einer der originellsten Liebeserklärungen der Weltliteratur ihren Höhepunkt findet.Kloster Northanger: Die siebzehnjährige Catherine Morland beeindruckt den jungen Geistlichen Henry Tilney mit ihrer frischen, naiven Art. Bevor beide ein Paar werden können, müssen sie allerhand kleine und große Hürden überwinden.",
  "genres": [
    "Classics",
    "Fiction",
    "Romance",
    "Historical Fiction",
    "Literature",
    "Historical",
    "Novels"
  ],
  "author": "Jane Austen",
  "average_rating": "4.60",
  "url": "https://www.goodreads.com/book/show/26141672-die-sechs-romane"
}