{
  "title": "Dr. Mabuse",
  "description": "Back in print at last is Dr. Mabuse. This extremely rare English translation of the Norbert Jacques novel appeared only once in 1923 and then was lost for decades. And what a fantastic find it is! Molded as much by legendary film director Fritz Lang as by novelist Norbert Jacques, Dr. Mabuse remains one of the more enigmatic figures in crime fiction and cinema. Created between the Great War and World War II, he became an embodiment of the rising Nazi Party and the disintegration of Germany's Weimar Republic. The parallels were so close between Hitler and Mabuse that Lang's first two Mabuse films were banned in Germany by Joseph Goebbels' propaganda machine. There is a broad streak of the weird running through the Dr. Mabuse legacy. Is he an evil genius-a mere mortal with a malignant bent, or is he a demon spirit who carries on the dark crusade long after the human avatar is destroyed by his own maniacal ambitions? The plot is wickedly simple. Dr. Mabuse has a mad dream to create his own personal empire in Brazil, an empire called Citopomar. In Citopomar he can rule without constraint. He can be a god! . . . but even a god requires some start-up cash, so he regrettably returns to his hated Europe to raise funds by any criminal means necessary. Why make money when you can steal it? Why merely cheat somebody at cards when you can control their hand through telepathic hypnosis? Why be just another common criminal when you can be an evil genius mastermind bent on world domination? Man or devil, he is a prototype super-villain whose sinister incantations still resonate in fiction and film today. Fascinating parallels can be found in Ian Fleming's first James Bond outing, Casino Royale. In that novel, bad boy Le Chiffre trolls the high-roller casinos to fund his schemes and even dares to embezzle from SMERSH in order to fund his human trafficking pipeline. Le Chiffre is yet another reincarnation of Dr. Mabuse. Bruin Asylum is proud to announce the resurrection of Dr. Mabuse by Norbert Jacques. English translation by Lillian A. Clare.",
  "genres": [
    "Fiction",
    "Crime",
    "Classics",
    "Mystery",
    "Novels",
    "Speculative Fiction"
  ],
  "author": "Norbert Jacques",
  "average_rating": "3.10",
  "url": "https://www.goodreads.com/book/show/26148541-dr-mabuse"
}