{
  "title": "Covert Interference",
  "description": "A secret from the past holds the key to saving the future.Calla Cress, top government code breaker, thought she had defeated the world's most dangerous man. But when she made the fatal mistake of letting him live, she never could have imagined what would follow. The billionaire criminal mastermind, locked away in a high-security prison, is now luring the globe's smartest minds into his cell, where they emerge in comas and his lethal hacks infiltrate government systems worldwide.As a museum curator turned undercover agent, Calla is at the center of a dangerous game. She holds a secret, hidden in the depths of technology history, that could alter civilization. But when an explosion rocks her Colorado hideout, Calla wakes up captive to a powerful organization that demands she produces the whereabouts of a missing MI6 agent who holds the key to stopping the billionaire's hacks.With only a handful of clues, Calla, NSA security advisor Nash Shields, and tech entrepreneur Jack Kleve, must race across the globe to unravel the clues. But the key to stopping the billionaire's reign of terror comes at an astonishing price.Uncover a world of espionage and danger in this must-read thriller that fans of Jason Bourne, Steve Berry, Ernest Dempsey, and Scott Mariani will love.What readers are saying about The Decrypter Series and Calla  ★★★★★ “Gripping read!”★★★★★ “Absolutely brilliant storyline. After reading book one I just had to get into book two.”★★★★★\"Takes you on a ride and refuses to let you off until you reach the very end.\"★★★★★\"A brilliant read! I recommend this to anyone who enjoys mystery, suspense, thrillers or action novels. The detail is astounding! The historic references, location descriptions, references to technology, cryptography....this author really knows her stuff.\"★★★★★\"An action-packed adventure, techno thriller across several continents like a Jason Bourne or James Bond movie, but with an actual storyline!\"★★★★★\"Brilliantly written. I loved the very descriptive side, which was a good way of visualizing and getting to terms with each new place, as the action takes place in several different countries.\"",
  "genres": [],
  "author": "Rose Sandy",
  "average_rating": "4.06",
  "url": "https://www.goodreads.com/book/show/26142343-covert-interference"
}