{
  "title": "Phat('s) Chance for Buddha in Houston",
  "description": "It's what you have been wondering for years: just how many Buddhist monks CAN you fit into a 1970 Buick Electra 225 convertible?Mid-life crisis meets puberty...It's 1990 and just another typical summer day in Mapletown, Indiana until Uncle Phat, The Reptile (or Uncle Mike, as he used to be called), who seems to have been in a mid-life crisis since he was born, wanders into the garage and gives his puberty-stricken 15 year old nephew, Galen Calcoun, only about an hour to pack. The four of them, a squinting Uncle Phat, his beloved Ruby--a 1970 ruby red white-top convertible Buick Electra 225, Galen, and \"the three books about Buddhism\" that take their place in the middle of the front seat, are headed to Houston, Texas to \"look at an engine\" for Ruby. They leave a note for the family and with ZZ Top blaring, take to the road. Both are escaping not only the monotony of their town but also the tyranny of the \"cousins\" who by sheer numbers alone, wield chaos-based control over the entire clan, the brunt of which is borne by Uncle Phat though Galen is tiring of it too, even if he doesn't know it--yet. \"Intellectuals in a sea of morons\" is how Galen views it ten years later as narrator, recounting their trip that includes lessons in French history from Vincennes (Indiana) and Cape Girardeau, Missouri. Of course they have to make a stop at Mark Twain National Forest. After a foray in a casino bar on a boat in Shreveport, LA, they have a run-in with a bunch of gun-totin' nature lovers on ATV's. It could go horribly wrong but... Their \"irresponsible\" behavior is buffered by the people they meet on the trip that despite their antics, see the better side, invite them in, befriend them. The point of the trip was what again? Oh yea, getting to Houston to look at that engine for Ruby except...All the while, they are badgered by the family to stay in touch so they can get yelled at, chastised some more, bashed for acting \"irresponsible\". Starting with the first lie, the trip is predicated on more lies and when it ends, only one of them returns home. Wow is now.",
  "genres": [],
  "author": "Virginia Arthur",
  "average_rating": "4.21",
  "url": "https://www.goodreads.com/book/show/26147436-phat-s-chance-for-buddha-in-houston"
}