{
  "title": "Wall Street's Think Tank: The Council on Foreign Relations and the Empire of Neoliberal Geopolitics, 1976-2014",
  "description": "Traces the expansive influence of The Council of Foreign Relations in advancing Wall Street's foreign policy agendas and U.S. influence abroadThe Council on Foreign Relations is the most influential foreign-policy think tank in the United States, claiming among its members a high percentage of government officials, media figures, and establishment elite. For decades it kept a low profile even while it shaped policy, advised presidents, and helped shore up U.S. hegemony following the Second World War. In 1977, Laurence H. Shoup and William Minter published the first in-depth study of the CFR, Imperial Brain Trust, an explosive work that traced the activities and influence of the CFR from its origins in the 1920s through the Cold War.Now, Laurence H. Shoup returns with this long-awaited sequel, which brings the story up to date. Wall Street’s Think Tank follows the CFR from the 1970s through the end of the Cold War and the collapse of the Soviet Union to the present. It explains how members responded to rapid changes in the world globalization, the rise of China, wars in Iraq and Afghanistan, and the launch of a “War on Terror,” among other major developments. Shoup argues that the CFR now operates in an era of “Neoliberal Geopolitics,” a worldwide paradigm that its members helped to establish and that reflects the interests of the U.S. ruling class, but is not without challengers. Wall Street’s Think Tank is an essential guide to understanding the Council on Foreign Relations and the shadow it casts over recent history and current events.",
  "genres": [
    "History",
    "Nonfiction",
    "Politics",
    "Economics",
    "The United States Of America",
    "American",
    "United States"
  ],
  "author": "Laurence H. Shoup",
  "average_rating": "4.12",
  "url": "https://www.goodreads.com/book/show/26143687-wall-street-s-think-tank"
}