{
  "title": "Tease",
  "description": "LaynieSmile when you’re happy, cry when you’re sad and don’t ever be afraid to try something new. These are the words I live by. We only get one shot at this life, and I intend to live the best one I can. I had it all growing up. Popularity, beauty, great friends and a perfect family. But then one day, it all changed – now I’m blind. I’ve never let that stop me though. Life is an adventure and I believe in making the best out of every moment.  I spend my days with a job I love, online friends and a sexy new book boyfriend every week. I know in my heart that someday, my own prince charming will come along and appreciate me for exactly who I am – I won’t settle for anything less. Meeting Tease seems like the beginning of my fairy tale … until he opens his mouth.TeaseI don’t trust people – ever. Every single person I’ve ever loved has contributed, in one way or another, to the shit show that is my life. Keeping everyone I meet at arm’s length, I work hard at being the star of most people’s nightmares. People think I’m a monster and honestly – they’re right.Laynie’s beauty is what caught my eye, but her personality is what held it. Laynie’s the only person to ever see past my appearance and break down the walls I’ve worked so hard to build. I’ll do whatever it takes to keep her. When things heat up with a rival club, and Laynie gets caught in the crossfire, I will unleash hell on earth to protect the woman who makes me want to trust someone again. When bullets start flying and bodies start piling up, keeping her safe may be the last thing I ever do.***Note: This book contains violence, strong language and descriptive sexual situations. It is intended for readers over the age of 18.",
  "genres": [
    "Romance",
    "Audiobook",
    "Contemporary",
    "Contemporary Romance",
    "Adult",
    "Abuse",
    "Dark"
  ],
  "author": "Geri Glenn",
  "average_rating": "4.12",
  "url": "https://www.goodreads.com/book/show/26142795-tease"
}