{
  "title": "The Black Widow Club",
  "description": "Two Part Series...ALL IN ONE BOOK! Part One: V: My father owned the most prestigious strip club in New York City. “The Black Widow Club.' The dancer's were women whose husband's and boyfriend's had abused them. My father would take them in, and he would offer them protection, seeing as he was the head of the Masseria crime family. Once you were in the family, as he called it, you were taken care of forever. They never had to fear another thing again. Until my Uncle Lorenzo ruined everything. He started trafficking them. To complicate matters, he even hired the most notorious hit-man in the mob- 'Ice Man' to kill my father..Now, it's up to me to get revenge...and trust me...I'll stop at nothing to get it. Including going undercover as a Black Widow myself. I don't care how dangerous it is. I don't care what the consequences are. My first order of business: is to take out Ice Man...if only I could find him. That shouldn't be too hard.I'm focused...until I meet Hunter, a sweet and sexy school teacher. He's irresistible, cocky and powerful...and distracting as ever.Little did I know...the most dangerous consequence of all...would be falling for a professional killer. Hunter: I'm not just a bad boy...I'm thee bad boy. I'm a cold blooded, and ruthless killer. Don't get swept away by the other side of me: the sweet, undercover school teacher. This side- will always take precedence- first. I'll never be able to settle down and lead a normal life. At least, that's what I thought...until the day I met V. I have no clue who she is- since she's so guarded...but I'm immediately captivated.She's so strong, sexy, and fierce...I'm dying to know more about her. She makes me feel like a good guy. I don't feel like Ice Man, the killer...when I'm with her. I feel like I'm Hunter, the human being. Is her love enough to change who I really am on the inside, though? Part Two: V: Everyone I cared about tried to warn me. They all said my plan was dangerous.They fought so hard to stop me...to make sure this never happened. I wish now more than anything that I had listened to them. Who knew that I, myself...would end up being the biggest danger to a hit-man. Hunter: I thought I had everything planned out. I thought the biggest danger was Lorenzo coming after me. I thought V was protected. I was wrong. So wrong. V was right. I should never have walked out that door. I should never have left her side. Now, she's going to pay the ultimate price for my mistake. ***Trigger Warning*** This book is not suitable for readers under 18. This book contains elements of emotional, sexual, and physical cruelty. Any readers with sensitivity to the above topics should proceed with caution, and at their own risk. You've been warned.",
  "genres": [],
  "author": "Ashley Jade",
  "average_rating": "4.40",
  "url": "https://www.goodreads.com/book/show/26150550-the-black-widow-club"
}