{
  "title": "Time Patrol",
  "description": "An anthology of the classic short tales of the Time Patrol, the future organization that insures the continuity of human history. Forget minor hazards like nuclear bombs. The discovery of time travel means that everything we know, anyone we know, might not only vanish, but never even have existed. Against that possibility stand the men and women of the Time Patrol, dedicated to preserving the history they know and protecting the future from fanatics, terrorists, and would-be dictators who would remold the shape of reality to suit their own purposes. But Manse Everard, the Patrol's finest temporal trouble-shooter, bears a heavy burden. The fabric of history is stained with human blood and suffering which he cannot, must not do anything to alleviate, lest his tampering bring disastrous alterations in future time. Everard must leave the horrors of the past in place, lest his tampering or that of the Patrol's opponents, the Exaltationists, erase all hope of a better future, and instead bring about a future filled with greater horrors than any recorded by past history at its darkest and most foul. Contents: * Time Patrol [Time Patrol • 1] (1955) / novelette by Poul Anderson: In the mid-20th century Manse Everard answers a job ad and gets hired as a time cop. Time travel will be invented centuries in the future; untold centuries beyond that mankind has evolved into a species called the Danellians, who persuaded the early time travellers to set up the Time Patrol with the aim of protecting all of time from any alteration by interfering temponauts that might risk the Danellians' existence. Manse's first mission is to go back to the late 19th century to correct the circumstances that led to the appearance of an anachronistic item in an old burial mound * Brave to Be a King [Time Patrol • 2] (1959) •/ novelette by Poul Anderson: A Time Patrol friend of Manse's, Keith, has gone missing in 6th-century Iran, and Keith's wife begs Manse to go find him. Trouble is, Manse has always had the serious hots for the wife, despite her somewhat whiny voice, so it's very tempting not to try very hard -- to assume that Keith has landed on his feet and is happy where he is, sort of thing. But his honourable self knows better. He discovers Keith has been forced to adopt the persona of Cyrus the Great; rescuing him while preserving the course of history proves to be a far more tortuous business than one might imagine. * Gibraltar Falls [Time Patrol • 3] (1975) / short story by Poul Anderson: What must have been the most remarkable spectacle of known prehistory, the collapse of the isthmus at the Gates of Hercules and the inundation of the basin that is now the Mediterranean Sea by the waters of the Atlantic * The Only Game in Town [Time Patrol • 4] (1960)/ novelette by Poul Anderson: Manse and a friend manage to head off the Chinese colonization, pre-Columbus, of the Americas. 8 Delenda Est [Time Patrol • 5] (1955) / novelette by Poul Anderson: Manse and a friend return from a holiday in the Pleistocene to their own time, only to discover it considerably changed; clearly there's been an unauthorized change to history. Eventually they trace it to an incident during the Punic Wars, which incident made it possible for Hannibal to defeat Rome. They succeed in reversing the change, but know that in so doing they're wiping out all the people they've befriended in the alternative 1950s. They succeed, though, in saving the laughing-eyed Hoirish colleen whom Manse's friend has fallen for. * Ivory, and Apes, and Peacocks [Time Patrol • 6] (1983) / novella by Poul Anderson: Tells of the Exaltationists, the 23rd-century cult whose obsessive pursuit of hedonism renders them unimpressed by the effects their vicious power-and pleasure-seeking could do to the timestream, including the possibility of their wiping the existence of their own culture out of history. Pummairam, a youth who takes Manse under his wing when first the patrolman arrives in Tyre, engineers much of the tricksterism Manse must use to thwart the baddies. * The Sorrow of Odin the Goth [Time Patrol • 7] (1983) / novella by Poul Anderson: A history prof, Carl Farness, has allowed himself to become the personification of the god Odin to a 4th-century tribe of Goths; he has also allowed himself to become far too personally involved with the people whom he's there to study, marrying one of them (with the knowledge of his 20th-century wife) and keeping an eye on the usually somewhat messy fates of his children, grandchildren, etc. Manse gets involved because incarnations of gods are the kind of thing that cause history to be altered; in fact, as Carl points out, all kinds of Goth tribes were convinced they'd been visited by various deities, and their stories were usually quickly dismissed as myths, then forgotten. Still, he must extract himself from the situation with care. * Star of the Sea [Time Patrol • 8] (1991) / novella by Poul Anderson: Europe in the 1st century, and various peoples, led by the likes of Civilis, are rebelling against corrupt Roman rule -- with the violence continuing even after it becomes clear that an honourable peace could be struck. A major factor keeping them at war is the zeal of a visionary/prophetess called Veleda, who for reasons unknown has had a far greater and longer influence in a revealed timeline than she had in the known history of the period. Manse and a historian called Floris, who becomes his first real love, manage to sort out the situation. * The Year of the Ransom [Time Patrol • 9] (1988) / novel by Poul Anderson: Heroine Wanda Tamberley's Uncle Steve, living among Pizarro's brutal conquistadors at the time of the ransoming of Atahuallpa, is attacked by the Exaltationists and then abducted into a very distant past by a quick-witted Spanish soldier who believes him to be a demon. Manse and Wanda to the rescue, of course. * Death and the Knight [Time Patrol] (1995) / novelette by Poul Anderson: how to rescue an errant time agent without changing history. Hugues Marot, a time traveler from the future who towers over most men with his great height, is a member of the Templars. He has accurately predicted some future events: when he is arrested and detained by his fellow Templars, he grasps a crucifix which is a \"...symbol and source of help from beyond this world\". A source of help indeed, as it conceals his Time Patrol communicator..",
  "genres": [
    "Science Fiction",
    "Time Travel",
    "Fiction",
    "Historical Fiction",
    "Alternate History",
    "Fantasy",
    "Speculative Fiction"
  ],
  "author": "Poul Anderson",
  "average_rating": "3.75",
  "url": "https://www.goodreads.com/book/show/261499.Time_Patrol"
}