{
  "title": "Precious Cargo: My Year of Driving the Kids on School Bus 3077",
  "description": "NATIONAL BESTSELLERFor readers of Kristine Barnett's The Spark, Andrew Solomon's Far From the Tree and Ian Brown's The Boy in the Moon, here is a heartfelt, funny and surprising memoir about one year spent driving a bus full of children with special needs.With his last novel, Cataract City, Craig Davidson established himself as one of our most talented novelists. But before writing that novel and before his previous work, Rust and Bone, was made into a Golden Globe-nominated film, Davidson experienced a period of poverty, apparent failure and despair. In this new work of riveting and timely non-fiction, Davidson tells the unvarnished story of one transformative year in his life and of his unlikely relationships with a handful of unique and vibrant children who were, to his initial astonishment and bewilderment, and eventual delight, placed in his care for a couple of hours each day--the kids on school bus 3077.     One morning in 2008, desperate and impoverished while trying unsuccessfully to write, Davidson plucked a flyer out of his mailbox that read, \"Bus Drivers Wanted.\" That was the first step towards an unlikely new driving a school bus full of special-needs kids for a year. Armed only with a sense of humour akin to that of his charges, a creative approach to the challenge of driving a large, awkward vehicle while corralling a rowdy gang of kids, and unexpected reserves of empathy, Davidson takes us along for the ride. He shows us how his evolving relationship with the kids on that bus, each of them struggling physically as well as emotionally and socially, slowly but surely changed his life along with the lives of the \"precious cargo\" in his care. This is the extraordinary story of that year and those relationships. It is also a moving, important and universal story about how we see and treat people with special needs in our society.",
  "genres": [
    "Nonfiction",
    "Memoir",
    "Canada",
    "Book Club",
    "Biography",
    "Autobiography",
    "Audiobook"
  ],
  "author": "Craig Davidson",
  "average_rating": "3.66",
  "url": "https://www.goodreads.com/book/show/26150409-precious-cargo"
}