{
  "title": "It Takes A Village: The Complete Story",
  "description": "An eighth of the population remained after a devastating virus swept across the globe. The survivors were trying to pick up the pieces of a broken world when the new government took over control.Paisley Roberts did not have a carefree childhood. The unfortunate knowledge she learned as an adolescent elevated her in the new world. She used those skills to create a place in the broken society around her. She struggled to live in the old world, but new circumstance allowed her to thrive.Paisley manages to balance many responsibilities. Griffon Park houses eight kids per adult. Her village produces enough surplus to supply itself, and other neighboring villages adequately. Instead of forcing the children to work, they attend school daily. While many basic conveniences are still available, supply is sparse and must be managed continuously. The last thing on her mind is a romantic relationship. She manages to find comfort in a friend, but keeps him at a distance. So many lives within her village are in her hands, so feelings are ignored in lieu of occasional sexual release.Everyone is comfortable with this arrangement until Paisley is summoned to another village. She never dreamed she would reunite with Archer Troy when she waved at Edsel from the helicopter as she left. Will a chance encounter shift her focus elsewhere?Nothing is the same. New rules govern every day life. The only gray areas seem to be relationships and the governing style of each individual village. Love comes in many forms, but the new environment complicates the old fashion ideas once held by the majority of society.Paisley thought keeping politics and feelings separate was the only way to run a village effectively. Despite the issues that would arise from embarking on a new way of living, could that be the answer to her dilemma?",
  "genres": [],
  "author": "Marley Claire",
  "average_rating": "3.50",
  "url": "https://www.goodreads.com/book/show/26150829-it-takes-a-village"
}