{
  "title": "The Age of Genomes: Tales from the Front Lines of Genetic Medicine",
  "description": "A leading geneticist explores what promises to be one of the most transformative advances in health and medicine in historyAlmost every week, another exciting headline appears about new advances in the field of genetics. Genetic testing is experiencing the kind of exponential growth once seen with the birth of the Internet, while the plummeting cost of DNA sequencing makes it increasingly accessible for individuals and families.Steven Lipkin and Jon Luoma posit that today’s genomics is like the last century’s nuclear a powerful tool for good if used correctly, but potentially dangerous nonetheless. DNA testing is likely the most exciting advance in a long time for treating serious disease, but sequencing errors, complex biology, and problems properly interpreting genetic data can also cause life-threatening misdiagnoses of patients with debilitating and fatal genetic diseases. DNA testing can also lead to unnecessary procedures and significantly higher health-care costs. And just around the corner is the ability to cure genetic diseases using powerful gene-editing technologies that are already being used in human embryo research. Welcome to the Age of Genomes!The Age of Genomes immerses readers in true stories of patients on the frontier of genomic medicine and explores both the transformative potential and risks of genetic technology. It will inform anxious parents increasingly bombarded by offers of costly new prenatal testing products, and demonstrate how genetic technology, when deployed properly, can significantly improve the lives of patients who have devastating neurological diseases, cancer, and other maladies. Dr. Lipkin explains the science in depth, but in terms a layperson can follow.",
  "genres": [
    "Nonfiction",
    "Science",
    "Genetics",
    "Health",
    "Biology",
    "Medical",
    "Medicine"
  ],
  "author": "Steven M. Lipkin",
  "average_rating": "3.76",
  "url": "https://www.goodreads.com/book/show/26150612-the-age-of-genomes"
}