{
  "title": "The Politics of Resentment: Rural Consciousness in Wisconsin and the Rise of Scott Walker",
  "description": "Since the election of Scott Walker, Wisconsin has been seen as ground zero for debates about the appropriate role of government in the wake of the Great Recession. In a time of rising inequality, Walker not only survived a bitterly contested recall that brought thousands of protesters to Capitol Square, he was subsequently reelected. How could this happen? How is it that the very people who stand to benefit from strong government services not only vote against the candidates who support those services but are vehemently against the very idea of big government?           With The Politics of Resentment, Katherine J. Cramer uncovers an oft-overlooked piece of the rural political consciousness and the resentment of the “liberal elite.” Rural voters are distrustful that politicians will respect the distinct values of their communities and allocate a fair share of resources. What can look like disagreements about basic political principles are therefore actually rooted in something even more who we are as people and how closely a candidate’s social identity matches our own. Using Scott Walker and Wisconsin’s prominent and protracted debate about the appropriate role of government, Cramer illuminates the contours of rural consciousness, showing how place-based identities profoundly influence how people understand politics, regardless of whether urban politicians and their supporters really do shortchange or look down on those living in the country.The Politics of Resentment shows that rural resentment—no less than partisanship, race, or class—plays a major role in dividing America against itself.",
  "genres": [
    "Politics",
    "Nonfiction",
    "Political Science",
    "Sociology",
    "Social Science",
    "Book Club",
    "History"
  ],
  "author": "Katherine J. Cramer",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/26153424-the-politics-of-resentment"
}