{
  "title": "Makers and Takers: The Rise of Finance and the Fall of American Business",
  "description": "Is Wall Street bad for Main Street America?\"A well-told exploration of why our current economy is leaving too many behind.\" — The New York TimesIn looking at the forces that shaped the 2016 presidential election, one thing is much of the population believes that our economic system is rigged to enrich the privileged elites at the expense of hard-working Americans. This is a belief held equally on both sides of political spectrum, and it seems only to be gaining momentum. A key reason, says Financial Times columnist Rana Foroohar, is the fact that Wall Street is no longer supporting Main Street businesses that create the jobs for the middle and working class. She draws on in-depth reporting and interviews at the highest rungs of business and government to show how the “financialization of America”—the phenomenon by which finance and its way of thinking have come to dominate every corner of business—is threatening the American Dream. Now updated with new material explaining how our corrupted financial sys­tem propelled Donald Trump to power, Makers and Takers explores the confluence of forces that has led American businesses to favor balance-sheet engineering over the actual kind, greed over growth, and short-term profits over putting people to work. From the cozy relationship between Wall Street and Washington, to a tax code designed to benefit wealthy individuals and corporations, to forty years of bad policy decisions, she shows why so many Americans have lost trust in the sys­tem, and why it matters urgently to us all. Through colorful stories of both “Takers,” those stifling job creation while lining their own pockets, and “Makers,” businesses serving the real economy, Foroohar shows how we can reverse these trends for a better path forward.",
  "genres": [
    "Economics",
    "Business",
    "Nonfiction",
    "Finance",
    "Politics",
    "History",
    "Audiobook"
  ],
  "author": "Rana Foroohar",
  "average_rating": "3.98",
  "url": "https://www.goodreads.com/book/show/26150584-makers-and-takers"
}