{
  "title": "Jungle Virgins - Two Book Combo",
  "description": "Many books have been written about how Tarzan and Jane made a life in the African Jungle. They were wonderful books, and the reader is urged to explore them all. But, the fact is that, in the days in which Tarzan's exploits were first told, there were certain aspects of jungle life that, in polite society, were forbidden to be discussed.Time marches on, however and, now, that societal mores have marched on as well, we may pursue some of those discussions ... or at least imagine what those unmentioned parts of life might have been like. Did you ever wonder what it might have been like for Jane, a civilized young woman, alone in the jungle, to meet the legendary Tarzan? What would he have thought of this pale female human? How would he have acted? How would she react to the King of the Jungle? What if he smelled... woman... in heat? Book one of this volume simply imagines how Tarzan was first exposed to his eventual mate and, perhaps, how that first ... mating ... took place. So, too, can we add to the story, imagining that, while Jane decided not to go back to civilization, civilization might have need of still having dealings with her. What, for instance, might it have been like for a lawyer to have to try and find Tarzan and Jane,to serve them papers? That is the purpose of book two, in which civilization comes looking for Jane, and runs firmly afoul of the Jungle. A new character joins the Tarzan family. Telling more than that would ruin the suspense. Suffice it to say that the Jungle is a lusty place, where life is created and taken routinely. These books deal primarily with the creation part of things, though death is dealt with as This book deals with adult situations, and concepts. Due to the graphic depiction of both sexual acts and violence, this book is not appropriate for those under the age of eighteen.",
  "genres": [
    "Erotica"
  ],
  "author": "Robert Lubrican",
  "average_rating": "4.23",
  "url": "https://www.goodreads.com/book/show/11683128-jungle-virgins---two-book-combo"
}