{
  "title": "The Wild Horse Dilemma: Conflicts and Controversies of the Atlantic Coast Herds",
  "description": "AWARD WINNING! Tirades and threats. Hyperbole and deception. Changing landscapes and immutable opinions. Living traditions and dead animals. The conflicts that rage around the wild horses of the Atlantic coast can be loud, confusing, and downright vicious. Wild horses have lived on these barrier islands for hundreds of years, and many people would like to see them remain. Horse advocates and horse detractors alike turn to research to support their claims, but often reach different conclusions from the same information.  Engaging the reader at every turn of the page, Bonnie Gruenberg frequently breaks new ground as she separates fact from myth and exposes the roots of issues for the reader to consider. She does not flinch from probing questions: Are these horses wild or feral? Native or exotic? Were Chincoteague Ponies used in bioweapons research? Did the U.S. Coast Guard patrol East Coast beaches with Western mustangs in WWII? How does the condition of lactating mares predict environmental health? She weaves a story of ancient origins and current events, hard science and fiery passion. The result is the most comprehensive and factual reference on the wild horses of the Atlantic coast. The Wild Horse Dilemma: Conflicts and Controversies of the Atlantic Coast Herds Introduction by Jay F. Kirkpatrick, PhD The Science and Conservation Center Author of Into the Wind Foreword by Don Hoglund, MS, DVM Author of Nobody's Horses  Winner Third Place Grand Prize Winner for Non-Fiction books entered in the 2015 Next Generation Indie Book Awards. Bronze medal: South East: Best Regional Non-fiction 2015 Independent Publisher (\"Ippy\") Book Awards  Winner Animals/Pets category 2015 Next Generation Indie Book Awards  Finalist The 2015 Montaigne Medal: \"awarded to the most thought-provoking titles each year.\" Finalist Science/Nature/Environment category of the 2015 Next Generation Indie Book Awards Finalist Regional Non-Fiction category of the 2015 Next Generation Indie Book Awards. Reviews  \"To say I am impressed is an understatement. This is an in-depth read not to be missed by serious wild horse enthusiasts. While the collection of archival photos is a treat, Gruenberg's own photos are second to none.\" Victoria Tollman Executive Director, Equus Survival Trust  \"It is the most impressive work about wild horses that I have ever read. I am in awe.\" Karen McCalpin Executive Director, Corolla Wild Horse Fund  \"It is comprehensive, a stellar piece of research, and simply fascinating to read.\" Steve Edwards Assistant Commonwealth's Attorney, Isle of Wight Co., Va. Wild Horse Rehabilitator  \"I am mightily impressed . . . with your scholarship and thoroughness.\" -Jay F. Kirkpatrick, PhD Director, Science and Conservation Center, ZooMontana\"",
  "genres": [
    "Nature",
    "Animals"
  ],
  "author": "Bonnie Urquhart Gruenberg",
  "average_rating": "4.33",
  "url": "https://www.goodreads.com/book/show/26157296-the-wild-horse-dilemma"
}