{
  "title": "Rough Riders: Theodore Roosevelt, His Cowboy Regiment, and the Immortal Charge Up San Juan Hill",
  "description": "The first definitive account of this legendary fighting force and its extraordinary leader, Theodore Roosevelt, Mark Lee Gardner’s Rough Riders is narrative nonfiction at its most invigorating and compulsively readable. Its dramatic unfolding of a familiar, yet not-fully-known story will remind readers of James Swanson’s Manhunt.Two months after the sinking of the USS Maine in Havana Harbor in February 1898, Congress authorized President McKinley to recruit a volunteer army to drive the Spaniards from Cuba. From this army emerged the legendary “Rough Riders,” a mounted regiment drawn from America’s western territories and led by the indomitable Theodore Roosevelt. Its ranks included not only cowboys and other westerners, but several Ivy Leaguers and clubmen, many of them friends of “TR.” Roosevelt and his men quickly came to symbolize American ruggedness, daring, and individualism. He led them to victory in the famed Battle at San Juan Hill, which made TR a national hero and cemented the Rough Riders’ place in history. Now, Mark Lee Gardner synthesizes previously unknown primary accounts as well as period newspaper articles, letters, and diaries from public and private archives in Arizona, Texas, Oklahoma, New Mexico, Boston, and Washington, DC, to produce this authoritative chronicle. He breathes fresh life into the Rough Riders and pays tribute to their daring feats and indomitable leader. Gardner also explores lesser-known aspects of the story, including their relationship with the African-American “Buffalo Soldiers,\" with whom they fought side by side at San Juan Hill.Rich with action, violence, camaraderie, and courage, Rough Riders sheds new light on the Theodore Roosevelt saga—and on one of the most thrilling chapters in American history.",
  "genres": [
    "History",
    "Nonfiction",
    "Biography",
    "American History",
    "Military Fiction",
    "Military History",
    "War"
  ],
  "author": "Mark Lee Gardner",
  "average_rating": "4.06",
  "url": "https://www.goodreads.com/book/show/26156427-rough-riders"
}