{
  "title": "The Boys in the Bunkhouse: Servitude and Salvation in the Heartland",
  "description": "In this haunting modern Dickensian story that is a literary tour de force, Pulitzer Prize-winning New York Times columnist Dan Barry chronicles a shameful case of exploitation and abuse in America’s heartland, involving a group of developmentally disabled men and the advocates who helped them find justice and reclaim their livesIn the tiny Iowa farm town of Atalissa, a group of intellectually disabled men, all from Texas, lived in a tired old schoolhouse. Every morning, well before dawn, they were bussed to a processing plant to eviscerate turkeys in return for food, lodging, and $65 a month. From 1974 until 2009, the men lived in near servitude, enduring increasing neglect, exploitation, and physical and emotional abuse—until state social workers, local journalists, and one tenacious government lawyer helped these men achieve their freedom.New York Times columnist Dan Barry reveals how these men in an Iowa schoolhouse remained nearly forgotten for more than three decades. Drawing on exhaustive interviews, he dives deeply into their lives, recording their memories and suffering, their tender moments of joy and persistent hopefulness—their endurance of harrowing circumstances. Barry explores why this small heartland town remained all but blind to the men’s plight, details how those responsible for such profound neglect justified their actions, and chronicles the lasting impact of a dramatic court case that has spurred advocates—as well as President Obama—to push for just pay and improved working conditions for people with disabilities.A luminous work of social justice, told with compassion and compelling detail, The Boys in the Bunkhouse is inspired storytelling and a clarion call for vigilance—an American tale that holds lasting reverberations for all of us.",
  "genres": [
    "Nonfiction",
    "History",
    "True Crime",
    "Book Club",
    "Audiobook",
    "Disability",
    "Crime"
  ],
  "author": "Dan Barry",
  "average_rating": "4.14",
  "url": "https://www.goodreads.com/book/show/26156452-the-boys-in-the-bunkhouse"
}