{
  "title": "Inner City Blues",
  "description": "Bree, a high school student living in Dallas, Texas, has a natural intellect and a desire to succeed. More than that, Bree has a dream -- a dream that is quite unlike her peers at her city high school. Bree wants to go to college, study biology and make a name for herself in this world. In a city filled with drugs, crime and violence, her world is in constant conflict with her vision Neglected and abandoned by many of the teachers, counselors and support system of the high school, Bree dares to dream and make her vision a reality regardless. Bree's personal story intersects against a familial backdrop that provides challenges at every turn. Her father is a drunk who is absent, both physically and emotionally, more than he is present. His abusive tendencies have driven away her brother towards a life embracing the criminal underbelly of the city. Along the way, Bree, her family and her friends continue to be confronted with challenges that are inherent to inner city Dallas life. Above all, Bree's personal journey coincides with a greater purpose: helping others just like her rise above their plights and situations. Bree begins volunteering at a Dallas crisis hotline with the hopes of having a great volunteer experience for her college application, and she quickly realizes that her volunteer role is helping to make a difference in her community as well. The Dallas depicted in Inner City Blues is quite unlike the Dallas in most readers' imaginations. Far from the glitz and glamor of the Dallas Cowboys and big-city living, there is the simple struggle to be. The community depicted in the novel struggles with day-to-day drugs, violence, and the neglect of society of large. Ultimately, Inner City Blues is a story of singular vision and inspiration that can only occur when one determined individual chooses to rise above all of the odds and circumstances formed against her. Readers will cheer every step of Bree's journey as she motivates, inspires and changes the lives of the characters in Inner City Blues as well as the reader. While the world and story of Inner City Blues were intricately crafted to entertain the reader, the story was also created with a greater social purpose in mind: to remind the reader that the story of Bree and her family is the story of too many Americans today. These inner city communities are neglected, abandoned and denied resources that are necessary for building healthy communities capable of fostering a child's dreams and visions. The educational systems of today are letting down the young luminaries who are capable of great things, just like Bree. A life of drugs and violence does not need to be a foregone conclusion, but it will be the conclusion of too many African-American lives so long as educational opportunities and resources are denied and dreams are not nurtured. To this end, Inner City Blues is not simply an example of art imitating life since it also offers an antidote for present-day problems. Bree's volunteer choices in the book are not there by accident. Her choice to volunteer at a Dallas crisis hotline is meant to demonstrate the ways that these hotlines provide essential knowledge and resources to anyone in need of assistance with drugs, violence, crimes and bullying-related issues. It is for this reason that the book concludes with a helpful list of resources, hotlines and crisis centers for a wide range of issues. Centers and resources directed at aiding domestic assault victims, sexual assault victims, mental health issues, veteran issues and more are all listed at the end of the book with websites and phone numbers to call. In effect, Inner City Blues provides readers with a powerful fictional narrative that delivers a profound statement on real-world issues, making it a must read for anyone who is committed to social justice and making America a better place with brighter futures for all its citizens.",
  "genres": [],
  "author": "T.L. Wilmore",
  "average_rating": "4.55",
  "url": "https://www.goodreads.com/book/show/26157710-inner-city-blues"
}