{
  "title": "Mercy",
  "description": "Daniel Nash needs to receive mercy from his family, his friends, from God, and from himself. Now in his mid-forties, he’s spent most of his life suppressing memories and his rage regarding the severe abuse he suffered during his first twelve years. The situation for Daniel is He’s finally reached his breaking point. His downward spiral into mental instability threatens to rob him of his stable home life with his loving wife and children, his successful career, and his sanity. However, his breakdown also promises to release repressed memories that may lead him to a younger brother, one he hadn’t known survived. While fighting the demons in his mind, Daniel also fights with his body, which causes him constant pain due to the passage of time and the multitude of injuries that had gone without treatment before he was rescued from his childhood hell.Daniel’s wife, Sarah, does what she does best – whatever she can to help those she loves. Despite her own emotional struggles and visual impairment, Sarah is the woman who always manages to keep her family going. However, she finally decides that it’s time to take care of herself as well. As she tries to deal with rejection from her former stepmother and the results of Daniel’s breakdown, Sarah begins therapy and returns to work. She regains a life purpose outside of her dedication to her husband, children, and other family members. Watching Daniel suffer brings forth the inner strength she always manages to find in times of strife, regardless of her own emotional turmoil.Tristan Maes, Sarah’s biological father and Daniel’s de facto one, draws upon all of his own tragic life experiences and his resolve to persevere in an effort to save his two eldest children. He works with his family and Daniel’s new therapist as he attempts to keep connecting with the rational part of Daniel’s mind. In the midst of his stress and worry regarding Sarah and Daniel, Tristan unexpectedly finds love with a fellow architect. However, the perplexing circumstances of his ex-wife’s departure, combined with her odd behavior, have him and the rest of the family searching for answers. Tristan holds onto hope but knows his grasp is tenuous.Mercy is what Daniel, Sarah, and Tristan need most. It’s also what they provide for each other and what they receive from those closest to them. Although many things are beyond their control, their overwhelming love and devotion to one another are their strongest assets in the most difficult battle of their lives -- a battle to stay together and find their own version of living happily ever after.",
  "genres": [],
  "author": "Lauren  Cutrera",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/26168887-mercy"
}