{
  "title": "The Book of Man: The Human Genome Project and the Quest to Discover Our Genetic Heritage",
  "description": "James Watson, a discoverer of the structure of DNA, described it as \"the most golden of molecules,\" the true chemical for life. Indeed, it is the essential component from which our genes are made. In it is encoded the genetic language that controls our destinies. Astonishingly powerful, just six millionths of a gram of DNA carries as much information as ten volumes of the Oxford English Dictionary .The \"Book of Man,\" is the term used by Walter Bodmer and Robin McKie for the DNA that is the instruction set according to which all humans are made. At conception, a single cell--the fertilized egg--is produced, and it is this one cell that has the potential to form a new and unique individual under the guidance of the DNA within its nucleus. The human body is made up of a hundred million million cells of many different sorts, and all contain the inherited information that comes from that first, single cell created at fertilization. Bodmer and McKie assert that when we learn how to read DNA's pages and chapters we will obtain the information relevant to the understanding of most diseases, individual differences in behavior, and a new awareness of our own history and evolution. The Book of Man explores how genetic information is now being read and interpreted by focusing on biology's most ambitious undertaking to date--the Human Genome Project, an attempt to uncover all the 100,000genes that control our development and detail the DNA alphabet of each. The authors go on to wrestle with the moral and ethical issues of modern genetics, making a case for a rational appraisal of genetic engineering and for the public to become sufficiently \"DNA literate\" in order to appreciate the crucial role it plays in our lives.From Gregor Mendel's discovery of the laws of inheritance to the high-tech, crime-stopping power of forensics science and the fascinating but sometimes troublesome implications of the latest science of genetic engineering, The Book of Man brilliantly explores and explains the quest that is changing our understanding of what it means to be a human being.",
  "genres": [
    "Science",
    "Nonfiction",
    "Biology"
  ],
  "author": "Walter Bodmer",
  "average_rating": "3.72",
  "url": "https://www.goodreads.com/book/show/2617150-the-book-of-man"
}