{
  "title": "By Moonlight",
  "description": "15 COMPLETE NOVELS AND NOVELLAS FROM YOUR FAVORITE PARANORMAL AUTHORS IN ONE PRETTY PACKAGE. Due to mature content, situations and language, this collection is recommended for audiences 18+. All works in this box set have been professionally proofed by Paper Gold Publishing and Pelican Proofing, unless this service was expressly refused by the author. Some stories are written in American, and some in British English. The authors have chosen to stay true to their heritage. Includes a mix of already released and never-before seen stories, all complete works. Those books which are part of a series can be enjoyed fully without the need to read the complete series (though there is a chance you might develop story-addiction issues—for that, we apologize). By Moonlight is an astounding collection of paranormal stories — some romances, some mysteries, all suspenseful, and every one containing supernatural features that will lead your imagination on a wild adventure. 15 new worlds to explore, 15 kinds of paranormal beings to investigate, 15 new sets of best friends to make — who can ask for more? The perfect companion for a leisurely weekend away is at your fingertips. Add it to your kindle with one click now. THIS BOX SET INCLUDES THE FOLLOWING TITLES: TANGLED ROOTS — Rebekkah Ford TRUST: A TWISTED WOLF TALE — Rene Folsom HIDDEN (MARCHWOOD VAMPIRE SERIES #1) — Shalini Boland ETERNAL ISLAND — K.S. Haigwood & Ella Medler MISSING PIECES — Tiffany Flowers FALLING FOR HEAVEN — Anne Conley SAVE MY SOUL — K.S. Haigwood THE SNOW CRYSTALS — Kendra Hale WEIRD: A HENRY IAN DARLING ODDITY: MISSIVE ONE — Julie Elizabeth Powell WEIRD: A HENRY IAN DARLING ODDITY: MISSIVE TWO — Julie Elizabeth Powell MARY HADES — Sarah Dalton THE PERFECT SPIRIT — Traci Hayden ENCOUNTER — Cherime MacFarlane WHISPER CAPE — Susan Griscom THE EX-ARMY WIVES BOOKCLUB — Marissa Storm",
  "genres": [],
  "author": "Rebekkah  Ford",
  "average_rating": "4.35",
  "url": "https://www.goodreads.com/book/show/26164325-by-moonlight"
}