{
  "title": "The Life and Struggles of Our Mother Walatta Petros: A Seventeenth-Century African Biography of an Ethiopian Woman",
  "description": "The first English translation of the earliest book-length biography of an African womanThis is the hardcover scholarly edition of the award-winning English translation of the earliest-known book-length biography of an African woman, and one of the few lives of an African woman written by Africans before the nineteenth century. As such, it provides an exceedingly rare and valuable picture of the experiences and thoughts of Africans, especially women, before the modern era. It is also an extraordinary account of a remarkable life--full of vivid dialogue, heartbreak, and triumph.The Life and Struggles of Our Mother Walatta Petros (1672) tells the story of an Ethiopian saint who led a successful nonviolent movement to preserve African Christian beliefs in the face of European protocolonialism. When the Jesuits tried to convert the Ethiopians from their ancient form of Christianity, Walatta Petros (1592-1642), a noblewoman and the wife of one of the emperor's counselors, risked her life by leaving her husband, who supported the conversion effort, and leading the struggle against the Jesuits. After her death, her disciples wrote this book, praising her as a friend of women, a devoted reader, a skilled preacher, and a radical leader. One of the earliest stories of African resistance to European influence, this biography also provides a picture of domestic life, including Walatta Petros's life-long relationship with a female companion.Richly illustrated with dozens of color illustrations from early manuscripts, this groundbreaking volume provides an authoritative and highly readable translation along with an extensive introduction. Other features include a chronology of Walatta Petros's life, maps, a comprehensive glossary, and detailed notes on textual variants.",
  "genres": [
    "History",
    "Nonfiction",
    "Biography",
    "Ethiopia",
    "Theology",
    "Religion",
    "Christianity"
  ],
  "author": "Galawdewos",
  "average_rating": "4.13",
  "url": "https://www.goodreads.com/book/show/26173464-the-life-and-struggles-of-our-mother-walatta-petros"
}