{
  "title": "Under Total Eclipse We Will Tremble Like Birds Without Song",
  "description": "In 1941 a woman schoolteacher in a small port city in Occupied France is caught between compliance and moral action. Numbed by the savagery of the life she sees around her, she is fearful and unable to decide if compliance is collaboration. She cannot find a moral center on which to found a life. One day while out cycling, she happens upon the brutal execution of a collaborator, which shocks her from numbness. But the shock is not the awakening of life in her. The story examines the reality of oppression and resistance with extreme authenticity..Whether love can bring us redemption.Whether what we do matters to us or to the world.Whether we can ever forget what we've done and been.According to author, Lee Total Eclipse We Will Tremble Like Birds Without Song is a love story taking place among civilians in Europe under the Nazi Occupation in the years 1941-44. This is a new and extremely authentic portrait of life under WW2 Nazi Occupation, based on years of research.The story explores the daily reality of occupied wartime, collaboration and resistance both. The lives and moral dilemmas facing people, and the cost of their decisions to their lives and being. It also accurately documents the routine daily lives and work of Resistance civilians and describes the historical course of the civilian war, through several countries over several years. The book includes a short but definitively accurate historical record of the events which took place in Auschwitz concentration camp, and at the Gestapo massacre of more than 30,000 people in Babi Yar, Kiev, Ukraine on September 29–30, 1941. The Auschwitz Chapter from this novel is an extremely accurate account of Auschwitz concentration camp processes and systems, offered free for unedited publication in educational text books anywhere in the world. The Auschwitz Chapter can also be found as a separate publication on Amazon.Please Both this book and The Auschwitz Chapter are subject to attacks by holocaust deniers.A careful reading of any peculiar review for hidden motive is recommended.Many more reviews of Lee Vidor's books can be seen critic is the kind of book that makes you think about who you really are. And what you might do. It is fearless fiction which is true and authentic.. The book is both moving and shocking, for the very first time I truly felt that I understood what it might mean to be caught in a war. It was terrifyingly real. I have rarely read any book with a stronger grasp of what it means to be human. Or to be faced with unresolvable moral conflict.What would you really do if the eclipse of war suddenly came swooping down upon you, and fear was all around you. And your moral courage was tested in the endless darkness? 'After you read this book you will know. It's the kind of book you can't forget after you read it.' About Lee Vidor is a writer and artist.Lee Vidor is the original source of the astonishing Shakespeare-X Message.She is the author of the novel cycle, 20th Century Bohemians and Angels, which is a cycle of literary novels which dramatizes the 20th Century Modernist Renaissance.The first published book on Amazon now is about the artists and exiles of 1920s Paris. An authentic and entirely fresh portrait of Jazz Age artists living with wild extravagance while creating the modern world.",
  "genres": [],
  "author": "Lee Vidor",
  "average_rating": "4.14",
  "url": "https://www.goodreads.com/book/show/11685347-under-total-eclipse-we-will-tremble-like-birds-without-song"
}