{
  "title": "Dragon Lords World 5 Book Box Set",
  "description": "Read the NYT & USAT Bestselling Author whose Dragon-Shifters and Cat-Shifters have stood the test of time in this Limited Edition Box Set.This box set includes the first books from series in the Dragon Lords World at an unbeatable, never before seen low price.This is a Limited Time Offer so Act Fast!Love these reads? There is so many more book in the Dragon Lords World for you to read. YAY!This Set Includes:1. Barbarian Prince (Dragon Lords Book 1, 10th Anniversary Edition) (Reg $3.99)2. The Savage King (Lords of the Var Book 1) (Reg $4.99)3. His Frost Maiden (Space Lords Book 1) (Reg $4.99)4. Determined Prince (Captured by a Dragon-Shifter 1) (Reg $2.99)5. PLUS! A BONUS READ: The Mighty Hunter! (Reg $3.99)That is nearly a $20 savings!Barbarian PrinceDragon-shifter Prince Ualan is prepared to follow dragon-shifter tradition and marry the woman revealed to him during the Breeding Festival. When the stubborn, yet achingly sexy, Morrigan refuses to accept their shared fate and his supreme authority over her, it is all he can do to keep from acting like the barbarian she accuses him of being.The Savage KingCat-shifting King Kirill knows he must do his duty by his people. When his father unexpectedly dies, it's his destiny to take the throne and all of the responsibility that entails. What he hadn't prepared for is the troublesome prisoner that's now his to deal with.Undercover Agent Ulyssa is no man's captive. Trapped in a primitive forest awaiting pickup, she's going to make the best out of a bad situation...which doesn't include falling for the seductions of a king.Determined PrinceDragon-shifter Prince Kyran has studied the Earth people and is ready to assimilate. Female shifters are all but going extinct on his planet of Qurilixen, and his people are desperate for mates--so much so they're taking matters into their own hands. What better place to capture a woman than Earth? After all, dragon-shifters had come from there centuries ago. Surely a human female would be honored to be selected by one as fine and fierce as himself? While on Earth, Kyran stumbles upon the most beautiful woman he's ever imagined, singing something the natives call rock 'n' roll. His blood simmers and he knows Eve is the one for him. But taming this feisty female is going to take much more than his training prepared him for.His Frost MaidenEmpath and space pirate, Evan Cormier is obsessed with decoding an ominous premonition about his future. When a fellow crewman angered a spirit, the vengeful Zhang An took her wrath out on everyone in the vicinity. Evan just happened to be one of them. He's now facing a future in which he'll be forever alone.  Lady Josselyn of the House of Craven has been betrayed. With her home world on a Florencian moon under attack and her family dead, she finds herself at the mercy of the one who deceived them. There is only one thing left to do--die with honor. But before she can join her family in the afterlife, she must first avenge all that she held dear. Falling in love with a pirate was never in the plan. Evan and his thieving crewmates might have delayed her fate, but they can't stop destiny.***BONUS CONTENT***The Mighty Hunter - Lords of the Abyss, Book One (Not Part of the Dragon Lords World)Caderyn the Hunter, the sexiest-and perhaps craziest-man she's ever laid eyes on may have rescued her from death, but who's going to rescue her fr",
  "genres": [
    "Romance",
    "Paranormal",
    "Dragons",
    "Science Fiction Romance",
    "Paranormal Romance",
    "Shapeshifters"
  ],
  "author": "Michelle M. Pillow",
  "average_rating": "4.18",
  "url": "https://www.goodreads.com/book/show/26177488-dragon-lords-world-5-book-box-set"
}