{
  "title": "8th Round",
  "description": "The story is about a man named Jacob(Jakes) Patrick Wallace who is sent back in time over various lifetimes. He thus carries knowledge of a global plague called the Husk plague, that causes people to go crazy and bloodthirsty, that will spread throughout the earth and that leaves only him with the power and knowledge to try and stop it. Throughout the book he deals with various people in his life including a love interest named Julia Baldacci and his younger brother named Andy. This first book mainly sets the scene of the oncoming plague by giving glimpses of the future in 2017 etc but mainly plays out over a period starting from 1995 up to date. The ebola virus which ravaged west Africa during 2014 plays a central theme in the book and helps to set the pace of the oncoming plague. The antagonist in the story is for the first part mainly played by a man called Rudansky who forms part of a larger group of people which is mainly referred to as the Company. The Company helps to set the scene for a larger worldwide conspiracy which dates back as far as the early 1600’s. With the VOC as the main background of this conspiracy, hence the settings in Amsterdam. Jakes however also starts to develop certain abilities which helps him to be stronger, faster and even some psychic abilities which helps him throughout the book from time to time. Later in the book it becomes clearer that even the main antagonist Rudansky is merely a puppet for the bigger threat namely a man called Lord wittenheer who is the creator of the company and who has lived since the 1600’s. Later in the book it also becomes clear that this man also happens to be the father of our main character unbeknownst to the main character though which is off course only revealed to him at the very ending of the book. The book ends with Jakes still in 2014 facing off against his father in a dream that he had, setting the scene for the second book which bring us closer to the release of the actual virus and the effect it will have on civilization, with the virus taking a equal but secondary role to jake’s main battle with the company who is still trying to reclaim the world as their own.",
  "genres": [],
  "author": "T.C. O'Reilly",
  "average_rating": "4.50",
  "url": "https://www.goodreads.com/book/show/26174822-8th-round"
}