{
  "title": "Hurt",
  "description": "Enrapture by Rachel Van DykenTrace is everything.My freaking world.And I would do anything to keep her safe.But, I can’t protect her from every kind of evil..and I canno longer keep the past a secret…We were left folders.Each one filled with the sins of our pasts.And Traces grandfather just asked us to read his.There was no preparation.And now I’m wondering if I should have let the love of mylife read it at all, because some things can’t be unsaid, some words stay with us forever.I know, from this day forward, nothing will ever be the same.The Initiation by Kristin VaydenIt wasn’t blood in… no out.It was death the moment were initiated with the mob and a living hell from that moment on. I knew, because it was my hell. But I wanted… no I needed out.I had watched it suck the life from my father till nothing was left but the ashes from betrayal, and I wanted more.So I made a deal, one that got me shot. But the nurse made up for the injury—Daphne had always teased my dreams, out of reach but close enough to tease me with the fantasy of what if.But what if… was now my reality and there was no way I was giving it up.So I called in a favor… to the Mafia.Made a deal with the devil, to save my soul.And if it works, I’ll die… so that I’ll have a chance at really living.Ice by Elise FaberOne night of weakness five years ago turned out to be the biggest mistake of Laila’s life.The sex with her coworker (and then commander) Ryker hadbeen hot. But the ensuing strain of having to work with him, having to see him seduce and sleep with other women tore her heart from her chest and crushed it beneath his military-grade boot.Now they’re on a mission together and she’s running command.Her damaged heart would like to make him pay, but her body isn’t so sure, especially when Ryker apologizes and tries to make things right between them.Can Laila put aside the past, if it means another chance — areal one this time — with Ryker? Or will those old wounds never heal? And when their mission goes awry, will they even survive to have a shot at that future?",
  "genres": [
    "Romance",
    "Romantic Suspense",
    "Novella",
    "Anthologies",
    "Mafia Romance",
    "New Adult",
    "Second Chance"
  ],
  "author": "Rachel Van Dyken",
  "average_rating": "4.41",
  "url": "https://www.goodreads.com/book/show/26174710-hurt"
}