{
  "title": "Meg & Linus",
  "description": "Can friendship, Star Trek, drama club, and a whole lot of coffee get two nerdy best friends through the beginning of their senior year of high school?Meg and Linus are best friends bound by a shared love of school, a coffee obsession, and being queer. It’s not always easy to be the nerdy lesbian or gay kid in a suburban town. But they have each other. And a few Star Trek boxed sets. They're pretty happy.But then Sophia, Meg’s longtime girlfriend, breaks up with Meg. Linus starts tutoring the totally dreamy new kid, Danny—and Meg thinks setting them up is the perfect project to distract herself from her own heartbreak. But Linus isn’t so sure Danny even likes guys, and maybe Sophia isn't quite as out of the picture as Meg thought she was. . . .From crowdsourced young adult imprint Swoon Reads comes Meg & Linus by Hanna Nowinski, a fun friendship story about two quirky teens who must learn to get out of their comfort zones and take risks—even if that means joining the drama club, making new friends, and learning how to stand on your own.Praise for Meg and Linus, from the Swoon Reads community:\"I also love that friendship takes center stage in this story. . . . I didn't want the story to end! Such a beautiful story.\" —Rita, reader on SwoonReads.com\"I liked that both characters are queer, and while it is a part of the story, it's not the story itself. . . . It's delightfully refreshing.\" —Tammy Wanzer, reader on SwoonReads.com\"What made this unique was the strong friendship between the two narrators (who were not romantically interested in each other), and how that friendship influenced their romances with their partners. It was also refreshing to haveLGBT representation that was beyond stereotypes.\" —Julia Durrant, reader on SwoonReads.com\"This book is a really lovely story about young love and being true to yourself despite the pressures to conform.\" —Jill Watkins, reader on SwoonReads.com\"Get ready to fall in love with two oddball nerdy best friends. . . . This adorable, warm hearted contemporary YA is tremendously funny, and full of some seriously swoony moments. . . . The world needs more diverse love stories, whether that be long time girlfriends working through some issues, first crushes or friendships.\" —Charlie, reader on SwoonReads.com",
  "genres": [
    "LGBT",
    "Young Adult",
    "Contemporary",
    "Romance",
    "Fiction",
    "Queer",
    "Young Adult Contemporary"
  ],
  "author": "Hanna Nowinski",
  "average_rating": "3.41",
  "url": "https://www.goodreads.com/book/show/26176756-meg-linus"
}