{
  "title": "Between the World and Me: Sidekick",
  "description": "#1 NEW YORK TIMES BESTSELLER \"Between the World and Me,\" by Ta-nehisi Coates is a modern pillar in American literature. In the form of a letter, Coates manages to address American race relations in the past, present, and future. While the letter contains a wealth of information and insight, so much can be easily lost through his constant wavering between discussion and story.\n  This sidekick to \"Between the World and Me\" has done the work of combing through the book for you and offers a crisp explanation of every major theme. Broken into chapters, the reader can easily follow themes along through each chapter by referencing the included quotations. A summary of each chapter is also provided as a refresher.   The full poems and essays referenced in the epigraph and in each chapter are provided with a concise analysis allowing the reader to understand Coates' choices and their reflection of the rest of the book. A read through Coates' best seller isn't nearly a mind opening as when read alongside the sidekick. You'll put down \"Between the World and Me\" feeling enlivened by your understanding of the complexities of racism in America and of the various ways Coates talks about it.   \nWhile reading this sidekick you'll have the chance to:\n  Delve deeper into the major themes of the novel   Analyze the full works of each poem and essay mentioned and their relation to the letter   Get to know the authors Coates admires   Grow your understanding of the allusions and references   Arm yourself with the tools to discuss this book with confidence   Disclaimer: This book serves as an accompaniment to the bestseller \"Between the World and me\" by Ta-Nehisi Coates. It is meant to broaden the reader's understanding of the book and to offer some insights which can easily be overlooked. You should order a copy of the actual book before reading this.",
  "genres": [],
  "author": "Clarity Hawkins",
  "average_rating": "4.35",
  "url": "https://www.goodreads.com/book/show/26181926-between-the-world-and-me"
}