{
  "title": "Het wereldmuseum van de kunst",
  "description": "Het wereldmuseum van de kunst maakt zijn titel waar. Het kolossale boek (van zeven kilo) is te beschouwen als een ‘museum in druk’. Het is opgedeeld in ‘zalen’ met kunstvoorwerpen van alle tijden, culturen en landen. Wat is de merite van zo’n boek waarin een gigantische collectie wereldkunst is opgenomen versus een collectie losse delen?Bladerend door de kunstcollecties, die in themazalen zijn opgedeeld, is het antwoord daar: Het is als wandelen door totaalmusea als the Metropolitan, maar dan met nog meer wijd uitgestrekte vleugels die alle continenten en epoques omspannen.Het Wereldmuseum begint bij het allervroegste begin, vanaf de rotstekeningen van 40.000 tot 14.000 jaar geleden. Op de kunst uit die steentijd volgt de ijstijd met beeldjes en siervoorwerpen uit het bovenpaleolithicum, en dan door naar een nieuwe ‘zaal’, voor het Oude Nabije Oosten.Vanaf daar is de opdeling verfijnd tot kunstcollecties en stijlen uit Mesopotamië, Assyrië, Babylon en negen andere beschavingen. Egypte heeft al een volledige eigen zaal, en die volledigheid loopt door tot op het heden.Het Wereldmuseum is zo letterlijk als het kan. Van de steentijd tot hedendaagse artiesten als Hirst en Hockney, beslaat het boek eveneens alle continenten.Er staan prachtillustraties in van architectonische objecten als de Babylonische Ishtarpoort, de chroomboon van Kapoor uit het Park in Chicago of gietijzeren silhouetten op een strand, waarbij in begeleidende tekst weer verwezen wordt naar een andere pagina over boeddhistische kunst als inspiratiebron van dat kunstwerk.En dan stuit je op handschriften met jaïnistische teksten, een rococozaal in Versailles, iconografie in Rusland of de impressionisten. Zulke collecties kom je nooit in één museum tegen, if ever. Je blijft eindeloos bladeren, lezen, onderzoeken en bewonderen.Het boek is overzichtelijk ingedeeld in vijfentwintig van die kleurgecodeerde ‘zalen’, waarin per zaal wordt ingegaan op belangrijke topics of tijdperken. Schilderijen, fresco’s, wandtapijten, friezen, foto’s, installaties, video’s, performances, houtsneden, manuscripten en keramiek: in totaal bijna drieduizend kunstwerken.De afgebeelde werken zijn speciaal geselecteerd op relevantie voor de kunstgeschiedenis en als cultureel erfgoed. Alles is voorzien van heldere teksten over de kunst zelf, de artiesten, de periode en de geschiedkundige achtergrond.In het voorwoord wordt met gepaste trots vermeld dat met dit boek de grootste kunstcollectie is bijeengebracht, niet gehinderd door enige fysieke beperking. En daar hebben de makers – honderden experts op hun vakgebieden – helemaal gelijk in.",
  "genres": [
    "Art",
    "Nonfiction",
    "Reference",
    "History",
    "Art History",
    "Art Design"
  ],
  "author": "Marianne Thys",
  "average_rating": "4.34",
  "url": "https://www.goodreads.com/book/show/26181715-het-wereldmuseum-van-de-kunst"
}