{
  "title": "All for a Rose",
  "description": "‘Twas Beauty that soothed the savage Beast.It is recommended that you read the Blood Prince series first, but you won’t be lost if you don’t. May contain spoilers for books in the Blood Prince series. A Man Becoming a Beast..The naga lord Daman is trapped between forms, half man half wyvern. Once the savior of enslaved changelings all over the kingdom of Sanguenay, Daman is now a danger to everyone around him. The curse that holds him prisoner in his own skin and scales keeps him in a constant state of imbalance, his altruistic nature fighting with the quick and violent temper of his more bestial side. When his plan to capture the witch who cursed him fails and leaves him with a sweet and beautiful changeling, Daman finds himself with the perfect opportunity to prove to himself that he is more man than beast. But hope dies a little more every day, and with every passing sunset, Daman finds his temper growing more and more out of control… A changeling searching for freedom... Guilt is eating Gigi alive. Since her family lost their fortune and had to move out of their mansion to a poor farm, Gigi has never felt better--and her sister has never felt worse. It seems that every time Gigi digs her hands into the earth to work the farm, she feels stronger, and every time her sister even thinks about working the land, she grows weaker. Gigi’s existence is about easing her sister’s pain, and the guilt over wanting freedom from that responsibility is killing her. What does it say about her loyalty when she leaps at a chance to be the prisoner of a monster just to get away from being her sister’s keeper? And what does it say about her that this monster makes her feel more alive than she ever imagined? A tale as old as time… An enchanted rose. A witch’s curse. A beast’s temper. A maiden who can see the potential for good even beneath the scales of a monster. It’s amazing what can transpire… all for a Rose.",
  "genres": [
    "Fantasy",
    "Beauty and The Beast",
    "Romance",
    "Dragons",
    "Fairy Tales",
    "Paranormal Romance",
    "Paranormal"
  ],
  "author": "Jennifer Blackstream",
  "average_rating": "3.84",
  "url": "https://www.goodreads.com/book/show/26185200-all-for-a-rose"
}