{
  "title": "The Battle of Hurtgen Forest",
  "description": "It was the longest battle ever fought by the US Army,  Thirty thousand American GIs were killed or wounded.  A battle that has been ignored for more than fifty years - and one that should never have been fought.  From September 1944 to February 1945, eight US infantry and two US armoured divisions were thrown into the ‘green hell of Hurtgen’: fifty square miles of thick, rugged, hilly woods on the Belgian-German border, full of German soldiers in a deadly network of concrete bunkers.  The butcher’s bill was high; casualty rates ran to 50 per cent and more for most rifle companies.  The High Command, from the relative comfort and security of their headquarters, miles away from the forest, refused to admit there had been a mistake. Careers, and the pride of the army, were at stake.  More troops were poured in and the slaughter continued, to capture an objective that had long since lost any real purpose.  The Battle of Hurtgen Forest is a classic account of the price fighting men must pay for the prideful blunders of their commanders.  'A classic account of a terrible battle.' - Tom Kasey, best-selling author of 'Trade Off'.  Charles Whiting (1926-2007) was one of Britain’s most prolific military writers, with over 300 books to his credit. He saw active service in the Second World War, serving in an armoured reconnaissance regiment attached to both the US and British armies. His books therefore possess the insight and authority of someone who, as a combat soldier, actually experienced the horrors of the Second World War.  Charles Whiting is the author of numerous history books on the Second World War. Under the pen name of Leo Kessler he also wrote a series of bestselling military thrillers, including ‘Guns at Cassino’ and ‘Valley of the Assassins’.  Endeavour Press is the UK's leading independent publisher of digital books.",
  "genres": [
    "History",
    "Nonfiction",
    "War",
    "Military History",
    "Military Fiction",
    "World War II",
    "Historical"
  ],
  "author": "Charles Whiting",
  "average_rating": "3.81",
  "url": "https://www.goodreads.com/book/show/26189543-the-battle-of-hurtgen-forest"
}