{
  "title": "Trial by Fire",
  "description": "★★★ THE APOCALYPSE CONTINUES★★★  From the best-selling author of SCARS comes the captivating sequel in this epic end-times series torn from the pages of Revelation.  After exposing the secret agenda of the New World Order, street-smart reporter Brock Summers finds himself imprisoned as a resister and facing a terrifying choice: receive the mark of the beast or die under the blade of the guillotine.  Trial by Fire takes you on an unforgettable journey through the apocalyptic ruins of a Northern California city into the vast wilderness where Brock must decide on which side he will fight. Will he bow down to the beast and take the mark?  WHO WILL SURVIVE?  TAGS: Christian Fiction, bestseller, best sellers, Kindle book, kindle books, Kindle store, kindle ebooks, Christian fiction best sellers, Christian fiction books, religious fiction, Christian books, Christian book, Christian fiction best sellers 2011 Christian, mystery and thrillers, thriller, Amazon.com, end times, end times in Kindle store, end times bible prophecy, end times fiction, end times prophecy, end times survival, end time prophecy, end times books, end time, end of the world, end of days, prophecy books, apocalypse, apocalypse in kindle store, apocalypse books, apocalyptic fiction, apocalypse fiction, tribulation, end of the world, eschatology, Compare to Left Behind by Tim LaHaye and Jerry Jenkins, Revelation, Petrus Romanus, antichrist, false prophet, Patience Prence, SCARS, Christian novel, Christian suspense, top rated, five stars, Christian audio books , Christian audiobooks , Christian audio cds , Christian audio cd, Christian audiobooks for kindle, Christian audio books for Kindle, Christian audio books for Kindle Fire ,Christian fiction, End times, end times fiction, audio book, Audiobook, download, #ChristianFiction, #EndTimes, Trial By Fire An End-Times Prophecy Book ( Christian Fiction ).",
  "genres": [],
  "author": "Patience Prence",
  "average_rating": "4.64",
  "url": "https://www.goodreads.com/book/show/26183971-trial-by-fire"
}