{
  "title": "Save Me Tonight",
  "description": "Dear Author,MC1: Stupid, arrogant son of a bitch. And I mean that in both the figurative and literal sense. Because if I could have laid my hands on his mother, I’d have skinned the bitch alive, and worn her as a fur coat. And this fool obviously takes after her. What did he think he’d get? Demanding an alliance. Forcing me into this goddamned mate bond. I may not have a choice, but I’ll make damn sure he regrets taking my freedom, bargaining for my dick like it’s something he could own. I’ll give it to him till he screams. And then give him more.MC2: He never knew it, but he saved me from her when I was a child. From the monster, my mother. Saved me and gave me hope. And now I need this alliance to save my pack from her legacy. But it’s not just for the pack. I know it’s wrong, forcing him to bond with me, giving him this insatiable craving to breed with someone he despises, someone he could never love. I am tainted. Her son. But I’ve been in love with him since I was a child. If this is all I can have of him, I’m taking it. I know he’ll be brutal. I just hope he doesn’t kill me.Photo Description: Two men in the middle of hardcore doggy style sex in a bushland setting, both fully naked, and the sex looks angry. There is another set of men’s legs there in the frame, but not a part of the sex.This story was written as a part of the M/M Romance Group's \"Love is an Open Road\" event. Group members were asked to write a story prompt inspired by a photo of their choice. Authors of the group selected a photo and prompt that spoke to them and wrote a short story. This story may contain sexually explicit content and is intended for adult readers. It may contain content that is disagreeable or distressing to some readers. The M/M Romance Group strongly recommends that each reader review the General Information section before each story for story tags as well as for content warnings.",
  "genres": [
    "M M Romance",
    "Shapeshifters",
    "Paranormal",
    "Romance",
    "Fantasy",
    "Short Stories",
    "Contemporary"
  ],
  "author": "M.P. Wallace",
  "average_rating": "3.23",
  "url": "https://www.goodreads.com/book/show/26190906-save-me-tonight"
}