{
  "title": "Eleanora Duse",
  "description": "A new biography, the first in two decades, of the legendary actress who inspired Anton Chekhov, popularized Henrik Ibsen, and spurred Stanislavski to create a new theory of acting based on her art and to invoke her name at every rehearsal.Writers loved her and wrote plays for her. She be-friended Rainer Maria Rilke and inspired the young James Joyce, who kept a portrait of her on his desk. Her greatest love, the poet d’Annunzio, made her the heroine of his novel Il fuoco (The Flame). She radically changed the art of acting: in a duel between the past and the future, she vanquished her rival, Sarah Bernhardt. Chekhov said of her, “I’ve never seen anything like it. Looking at Duse, I realized why the Russian theatre is such a bore.” Charlie Chaplin called her “the finest thing I have seen on the stage.” Gloria Swanson and Lillian Gish watched her perform with adoring attention, John Barrymore with awe. Shaw said she “touches you straight on the very heart.”When asked about her acting, Duse responded that, quite simply, it came from life. Except for one short film, Duse’s art has been lost. Despite dozens of books about her, her story is muffled by legend and myth. The sentimental image that prevails is of a misty, tragic heroine victimized by men, by life; an artist of unearthly purity, without ambition. Now Helen Sheehy, author of the much admired biography of Eva Le Gallienne, gives us a different Duse—a woman of strength and resolve, a woman who knew pain but could also inflict it. “Life is hard,” she said, “one must wound or be wounded.” She wanted to reveal on the stage the truth about women’s lives and she wanted her art to endure. Drawing on newly discovered material, including Duse’s own memoir, and unpublished letters and notes, Sheehy brings us to an understanding of the great actress’s unique ways of working: Duse acting out of her sense of her character’s inner life, Duse anticipating the bold aspects of modernism and performing with a sexual freedom that shocked and thrilled audiences. She edited her characters’ lines to bare skeletons, asked for the simplest sets and costumes. Where other actresses used hysterics onstage, Duse used stillness.Sheehy writes about the Duse that the actress herself tried to hide—tracing her life from her childhood as a performing member of a family of actors touring their repertory of drama and commedia dell’arte through Italy. We follow her through her twenties and through the next four decades of commissioning and directing plays, running her own company, and illuminating a series of great roles that included Emile Zola’s Thérèse Raquin, Marguerite in Dumas’s La Dame aux camélias, Nora in Ibsen’s A Doll’s House, and Hedda in his Hedda Gabler. When she thought her beauty was fading at fifty-one, she gave up the stage, only to return to the theatre in her early sixties; she traveled to America and enchanted audiences across the country. She died as she was born—on tour.Sheehy’s illuminating book brings us as close as we have ever been to the woman and the artist.From the Hardcover edition.",
  "genres": [
    "Nonfiction",
    "Biography",
    "History"
  ],
  "author": "Helen Sheehy",
  "average_rating": "4.26",
  "url": "https://www.goodreads.com/book/show/261903.Eleanora_Duse"
}