{
  "title": "Psychopath Free: Recovering from Emotionally Abusive Relationships With Narcissists, Sociopaths, and Other Toxic People",
  "description": "\"The psychopath carefully selects the most indifferent & heartbreaking way imaginable to abandon you. He wants you to self-destruct, cleaning up any loose ends as he begins the grooming process with his latest victim. He destroys you as a way to reassure himself that his new target is better. But most importantly, he destroys you because he hates you. He despises your empathy & love - qualities he must pretend to feel every single day. To destroy you is to temporarily silence the nagging reminder of the emptiness that consumes his soul.\" (pg. 58)Unbeknownst to both of you, this is the beginning of a great adventure...Psychopath Free is a recovery handbook, guiding survivors through the nightmare of psychopathic relationships from beginning to end. The goal is to make the process a bit more holistic - to provide all the tools you'll need to find validation, self-respect, peace, & love. This book operates under the assumption that you are not defined by your pain, but instead by the subsequent choices you make along the way. Psychopath Free will help you out of the darkness so that you can begin making better choices that will forever alter the course of your life.So say farewell to love triangles, cryptic letters, self-doubt, and manufactured anxiety. You will never again find yourself desperately awaiting a text from the man you love. You will never again censor your spirit for fear of losing the perfect relationship. You will never again be told to stop over-analyzing that which urgently needs analysis. You are no longer a pawn in the mind games of a psychopath. You are free.",
  "genres": [
    "Psychology",
    "Self Help",
    "Nonfiction",
    "Mental Health",
    "Relationships",
    "Personal Development",
    "Abuse"
  ],
  "author": "Jackson MacKenzie",
  "average_rating": "4.19",
  "url": "https://www.goodreads.com/book/show/26190453-psychopath-free"
}