{
  "title": "Resist",
  "description": "In this sizzling short novel from New York Times bestselling author Missy Johnson, a young journalist goes undercover in a world of desire—and gets seduced by the billionaire bachelor she’s supposed to be chasing.  Recent college grad Charlotte Lucas thinks she has found her breakout story. It all begins when she answers a provocative want ad posted by a secretive mogul who happens to be a prime suspect in his girlfriend’s disappearance. Young and inexperienced, Char has never been pushed to the limit—until their games take her to the very edge. Char has gone in looking for the truth, but now she’s in way too deep with a master who plays her body like it belongs to him.   Jaxon Murphy knows a lot more about Char than he lets on. Although the media has made him out to be a monster, he’s not about to come clean about his tormented past—at least not before he turns this good girl bad and sends her out to do his dirty work. After all, Jax didn’t make it to the top without breaking some rules. But as their play grows passionate and achingly real, Jax can’t resist taking a shot at something that’s bigger and more powerful than revenge: love.Advance praise for Resist\n \n “Prepare to read late into the night. Resist is a sizzling-hot, intense must-read.”—Stacey Kennedy, USA Today bestselling author of the Club Sin series  “Resist is a twisted, gritty, and provocative read full of toe-curling steam and spine-tingling suspense. I give Missy Johnson a big thumbs up for this one!”—USA Today bestselling author J. L. Mac“This dark, intense page-turner had me gripped to the end. Jaxon Murphy is the troubled soul that every girl will want to heal.”—USA Today bestselling author R. J. PrescottPraise for Missy Johnson’s Code of Honor\n \n “Yet again Missy Johnson slays us with an impeccable story and characters that make us think. Code of Honor is a beautifully written tale of a life we can only imagine.”—Ashley Suzanne, author of Raven and the Destined series   “Code of Honor is dark, sexy, and deliciously enthralling. Missy Johnson takes you into a dangerous world you won’t want to leave.”—Cecy Robson, author of Once Kissed\n \n “In a beautiful love story I couldn’t put down, Missy Johnson weaves together mob action with an element of stepbrother taboo. She’s for sure an author to watch!”—Laura Marie Altom, author of The Escort  Includes a special message from the editor, as well as an excerpt from another Loveswept title.",
  "genres": [
    "Romance",
    "Contemporary Romance",
    "BDSM",
    "Erotica",
    "Contemporary",
    "New Adult",
    "Adult Fiction"
  ],
  "author": "Missy Johnson",
  "average_rating": "3.37",
  "url": "https://www.goodreads.com/book/show/26192248-resist"
}