{
  "title": "A Friend of the Devil",
  "description": "Beware when the well-dressed visitor in the back row whispers in your ear because the things he tells you will change your life forever. These are the lazy days of summer when families pack up and head to their favorite vacation spots where they rent bungalows or cottages or stay at motels on the beach. It is a time before the bridge connects the east and western shores of the Chesapeake Bay and you have to take a ferry to reach places like Smith and Paradise Islands or the Atlantic beaches. Jack Davis is staying on his boat at the local marina. He won’t admit to it but he has a bad habit of seducing young women before stealing their money and he has his eye on Amanda the preacher’s daughter.  The authorities have been trailing Jack for some time now but he is always one step ahead of them. They have credible information that he may be on Paradise Island and they need to find him soon because there is a terrible storm out in the Atlantic that may be heading right for the bay. It would be easy for Jack to slip away, especially if there is an evacuation. Some people don’t believe in the devil and you certainly don’t expect him to be in church on a Sunday morning, but when Jack meets Draper Moon he begins to think that he isn’t the only killer on Paradise Island.  Amanda is a girl with her own agenda especially when it comes to Jack. She is willing to do whatever it takes to keep anyone from getting between them, especially her best friend Carmen. Amanda has lived on the island most of her life and she can sail and fish and she has a secret place where she always catches the fattest crabs. And she knows that crabs like to eat the most awful things. Amanda spends hours watching over her precious Jack from the church steeple, where can see just about everything that happens on the island.  That night a girl goes missing and while the police are searching for her they discover a terminally ill mother suffocated in her own bed. Then a council woman disappears before her speech at the Fourth of July parade, and a young man drinking Cajun moonshine causes a spectacular explosion on the fireworks barge that puts an abrupt end to the gala celebration. Even the deaths from natural causes look suspicious and it’s all the island’s small police department can do to piece things together. And all the time buzzards circle the island…one for every dead person. Little Emma Gleason is the only one who can see the dead but her sister won’t believe her. Emma says that they dress like court jesters or those puppets in the Punch and Judy shows. Her sister asks what they want and Emma tells her that she thinks they want to know who killed them. The girls have an abusive dad who drinks too much and hits his wife and sometimes nails the bedroom window shut when Cassie and Emma sneak out at night. That’s when the weather begins to go sour. Everyone hoped the hurricane would stay out over the ocean but the warm waters of the bay are too inviting. The authorities order vacationers to leave Paradise Island but most of the residents decide to stay. Businesses and homes are boarded up against the storm. Little Emma’s abusive father forces his family to wait out the hurricane in their dark house while he continues to drink and get more violent. Draper Moon hosts a gala hurricane party in the ballroom of the Grand Hotel where ladies in gowns and men in tuxedoes drink champagne and laugh as the storm worsens. Streets are flooding and the wind tears roofs from building as people gather for safety in the small church.  They say the devil is a roaring lion looking for someone to devour and the people of South Paradise Island are the wide eyed gazelles gathering at the watering hole…",
  "genres": [],
  "author": "Doug Byra",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/26183948-a-friend-of-the-devil"
}