{
  "title": "The Planet Remade: How Geoengineering Could Change the World",
  "description": "The risks of global warming are pressing and potentially vast. The difficulty of doing without fossil fuels is daunting, possibly even insurmountable. So there is an urgent need to rethink our responses to the crisis. To meet that need, a small but increasingly influential group of scientists is exploring proposals for planned human intervention in the climate system: a stratospheric veil against the sun, the cultivation of photosynthetic plankton, fleets of unmanned ships seeding the clouds. These are the technologies of geoengineerin--and as Oliver Morton argues in this visionary book, it would be as irresponsible to ignore them as it would be foolish to see them as a simple solution to the problem.\"The Planet Remade\" explores the history, politics, and cutting-edge science of geoengineering. Morton weighs both the promise and perils of these controversial strategies and puts them in the broadest possible context. The past century's changes to the planet--to the clouds and the soils, to the winds and the seas, to the great cycles of nitrogen and carbon--have been far more profound than most of us realize. Appreciating those changes clarifies not just the scale of what needs to be done about global warming, but also our relationship to nature.Climate change is not just one of the twenty-first century's defining political challenges. Morton untangles the implications of our failure to meet the challenge of climate change and reintroduces the hope that we might. He addresses the deep fear that comes with seeing humans as a force of nature, and asks what it might mean--and what it might require of us--to try and use that force for good.",
  "genres": [
    "Science",
    "Nonfiction",
    "Climate Change",
    "Environment",
    "Politics",
    "Research",
    "Geology"
  ],
  "author": "Oliver Morton",
  "average_rating": "3.77",
  "url": "https://www.goodreads.com/book/show/26189312-the-planet-remade"
}