{
  "title": "His Forever Sub",
  "description": "This edition is no longer available.Iliana Wolf was underfoot in the club wherever Ryder Whitmore turned. He was irritated, he was annoyed, and he was aroused - all the time. There was something about her that called out to him and he found it hard to resist. As a successful businessman, he knew how to deal with people and as the Club Manager and Senior Master at Club Alpha Cove, he knew how to handle women. He’d had more than enough ‘little pets’ in his bed as proof of that. Now, he ran across one woman he didn’t know how to handle. He kept pushing her away with one hand and dragging her back with the other.  Iliana wanted Ryder from the first moment she laid eyes on him and made her intentions clear, willing to fight for what she wanted. She was a tough cookie in the boardroom and had brought grown men to their knees many a time. But there was something missing in her life. She needed more, she needed to let go of being tough and let someone else be in charge. She believed Ryder was the man to take full control of her.  What followed was an emotional rollercoaster filled with swirling emotions, insecurities, and Ryder’s past, which tore them apart. Would he be able to rebuild the bridge that he destroyed with his actions? Moreover, would Iliana believe him?  And what about the Syndicate? How far will they go this time to obtain their primary goal? Taking over David’s Island.  This is a standalone, full-length novel. However, to enrich your experience it is recommended that you read the Club Alpha Cove series in order.  WARNING: This book contains content that might offend some readers or could trigger bad memories. Please read the warning at the start of the Prologue before you purchase this book.  Note: This book is intended for mature audiences and contains explicit sexual situations, graphic language, and material that some readers may find offensive: anal play, oral sex, impact play, BDSM theme, and elements of sadism/masochism. Please, read the warning message from the Author in the “Look Inside” and do not purchase this book if you find this content objectionable or offensive.",
  "genres": [
    "BDSM"
  ],
  "author": "Linzi Basset",
  "average_rating": "4.56",
  "url": "https://www.goodreads.com/book/show/26183344-his-forever-sub"
}