{
  "title": "A Gentleman For All Seasons",
  "description": "The tiny village of Hemshawe is the sort of place where nothing ever happens…until a handsome ex-soldier and his matchmaking sister let the imposing manor house at the edge of town. The friendly Londoners shake up the staid people of Hemshawe, and villagers see each other in a new and oh-so-appealing light. Suddenly long-sparring enemies become lovers, a town festival heralds a new start for a fallen woman and a dandy, and a man who has given up on love gets a second chance with the woman he never forgot. And the matchmaker herself? She won’t rest until she finds her own happily-ever-after… A Madness in Spring by Kate Noble Adam Sturridge has made Belinda Leonard’s blood boil since childhood, and the feeling is mutual. But when a would-be matchmaker arrives in the village of Hemshawe, she’d determined to erase the thin line between love and hate. Now, Belinda and Adam are faced with falling for someone they’ve always considered an enemy — can they overcome old prejudices and discover how to rub each other the right way? The Summer of Wine and Scandal by Shana Galen When viscount’s son and dandy Peregrine Lochley is temporarily exiled from London to the country for his misdeeds, the last thing he expects is to encounter an intriguing woman. But Caroline Martin has a secret to hide, and it just might be too scandalous for even this debauched rogue. Those Autumn Nights by Theresa Romain Ten years ago, wealthy Eliza Greenleaf broke lowly soldier Bertram Gage’s heart—but the last decade brought changes in fortune to them both. Now that he’s made his mark on the world, a twist of fate brings the Greenleaf family under his power. Will this war-hardened officer triumph over his former lover…or will Bertie and Eliza give love a second chance? The Season for Loving by Vanessa Kelly Miss Georgie Gage, matchmaker extraordinaire, is resigned to life as a spinster—almost. When notoriously aloof bachelor Fergus Haddon arrives from Scotland to spend Christmas with the Gage family, Georgie thinks she’s finally found her own perfect match—if, that is, she can get the handsome Highlander to agree!",
  "genres": [
    "Historical Romance",
    "Anthologies",
    "Romance",
    "Novella",
    "Historical",
    "Historical Fiction",
    "Regency"
  ],
  "author": "Shana Galen",
  "average_rating": "3.89",
  "url": "https://www.goodreads.com/book/show/26195054-a-gentleman-for-all-seasons"
}