{
  "title": "Imbeciles: The Supreme Court, American Eugenics, and the Sterilization of Carrie Buck",
  "description": "One of America’s great miscarriages of justice, the Supreme Court’s infamous 1927 Buck v. Bell ruling made government sterilization of “undesirable” citizens the law of the land New York Times bestselling author Adam Cohen tells the story in Imbeciles of one of the darkest moments in the American legal tradition: the Supreme Court’s decision to champion eugenic sterilization for the greater good of the country. In 1927, when the nation was caught up in eugenic fervor, the justices allowed Virginia to sterilize Carrie Buck, a perfectly normal young woman, for being an “imbecile.”It is a story with many villains, from the superintendent of the Dickensian Virginia Colony for Epileptics and Feebleminded who chose Carrie for sterilization to the former Missouri agriculture professor and Nazi sympathizer who was the nation’s leading advocate for eugenic sterilization.  But the most troubling actors of all were the eight Supreme Court justices who were in the majority – including William Howard Taft, the former president; Louis Brandeis, the legendary progressive; and Oliver Wendell Holmes, Jr., America’s most esteemed justice, who wrote the decision urging the nation to embark on a program of mass eugenic sterilization.Exposing this tremendous injustice—which led to the sterilization of 70,000 Americans—Imbeciles overturns cherished myths and reappraises heroic figures in its relentless pursuit of the truth. With the precision of a legal brief and the passion of a front-page exposé, Cohen’s Imbeciles is an unquestionable triumph of American legal and social history, an ardent accusation against these acclaimed men and our own optimistic faith in progress.From the Hardcover edition.",
  "genres": [
    "History",
    "Nonfiction",
    "Law",
    "Politics",
    "American History",
    "Science",
    "Audiobook"
  ],
  "author": "Adam Cohen",
  "average_rating": "3.77",
  "url": "https://www.goodreads.com/book/show/26192925-imbeciles"
}