{
  "title": "Angels Burning",
  "description": "“Compelling, fast-paced.” —Library Journal, starred review  “Stellar.” —Publishers Weekly, starred review  “A page-turner.” —Kirkus Reviews From the New York Times bestselling author of the Oprah Book Club pick Back Roads comes this fast-paced literary thriller about a small town police chief who’s forced to dig into her own shadowy past as she investigates the murder of a teenage girl.On the surface, Chief Dove Carnahan is a true trailblazer who would do anything to protect the rural Pennsylvanian countryside where she has lived all fifty of her years. Traditional and proud of her blue-collar sensibilities, Dove is loved by her community. But beneath her badge lies a dark and self-destructive streak, fed by a secret she has kept since she was sixteen. When a girl is beaten to death, her body tossed down a fiery sinkhole in an abandoned coal town, Dove is faced with solving the worst crime of her law enforcement career. She identifies the girl as a daughter of the Truly family, a notoriously irascible dynasty of rednecks and petty criminals. During her investigation, the man convicted of killing Dove’s mother years earlier is released from prison. Still proclaiming his innocence, he approaches Dove with a startling accusation and a chilling threat that forces her to face the parallels between her own family’s trauma and that of the Trulys. With countless accolades to her credit, author Tawni O’Dell writes with the “fearless insights” (The New York Times Book Review) she brought to the page in Back Roads and One of Us. In this new, masterfully told psychological thriller, the past and present collide to reveal the extent some will go to escape their fate, and in turn, the crimes committed to push them back to where they began.",
  "genres": [
    "Mystery",
    "Thriller",
    "Fiction",
    "Mystery Thriller",
    "Crime",
    "Suspense",
    "Contemporary"
  ],
  "author": "Tawni O'Dell",
  "average_rating": "3.92",
  "url": "https://www.goodreads.com/book/show/26197485-angels-burning"
}