{
  "title": "Breaking India: Western Interventions In Dravidian And Dalit Faultlines",
  "description": "India's integrity is being undermined by three global networks that have well-established operating bases inside India: (i) Islamic radicalism linked with Pakistan, (ii) Maoists and Marxist radicals supported by China via intermediaries such as Nepal, and (iii) Dravidian and Dalit identity separatism being fostered by the West in the name of human rights. This book focuses on the third: the role of U.S. and European churches, academics, think-tanks, foundations, government and human rights groups in fostering separation of the identities of Dravidian and Dalit communities from the rest of India. The book is the result of five years of research, and uses information obtained in the West about foreign funding of these Indian-based activities. The research tracked the money trails that start out claiming to be for \"education,\" \"human rights,\" \"empowerment training,\" and \"leadership training,\" but end up in programs designed to produce angry youths who feel disenfranchised from Indian identity. The book reveals how outdated racial theories continue to provide academic frameworks and fuel the rhetoric that can trigger civil wars and genocides in developing countries. The Dravidian movement's 200-year history has such origins. Its latest manifestation is the \"Dravidian Christianity\" movement that fabricates a political and cultural history to exploit old faultlines. The book explicitly names individuals and institutions, including prominent Western ones and their Indian affiliates. Its goal is to spark an honest debate on the extent to which human rights and other \"empowerment\" projects are cover-ups for these nefarious activities. For more information, or to view videos about this book, visit www.breakingindia.com",
  "genres": [
    "India",
    "History",
    "Nonfiction",
    "Politics",
    "Hinduism",
    "Indian Literature",
    "Unfinished"
  ],
  "author": "Rajiv Malhotra",
  "average_rating": "4.40",
  "url": "https://www.goodreads.com/book/show/11687399-breaking-india"
}