{
  "title": "Enchanted Islands",
  "description": "Inspired by the midcentury memoirs of Frances Conway, Enchanted Islands  is the dazzling story of an independent American woman whose path takes her far from her native Minnesota when she and her husband, an undercover intelligence officer, are sent to the Galápagos Islands at the brink of World War II. Born in Duluth, Minnesota, in 1882 to immigrant parents, Frances Frankowski covets the life of her best friend, Rosalie Mendel, who has everything Fanny could wish for—money, parents who value education, and an effervescent and winning personality. When, at age fifteen, Rosalie decides they should run away to Chicago, Fanny jumps at the chance to escape her unexceptional life. But, within a year, Rosalie commits an unforgivable betrayal, inciting Frances to strike out on her own.Decades later, the women reconnect in San Francisco and realize how widely their lives have diverged. While Rosalie is a housewife and mother, Frances works as a secretary for the Office of Naval Intelligence. There she is introduced to Ainslie Conway, an intelligence operator ten years her junior. When it’s arranged for Frances and Ainslie to marry and carry out a mission on the Galápagos Islands, the couple’s identities—already hidden from each other—are further buried under their new cover stories. No longer a lonely spinster, Frances is about to begin the most fascinating and intrigue-filled years of her life.Amid active volcanoes, forbidding wildlife and flora, and unfriendly neighbors, Ainslie and Frances carve out a life for themselves. But the secrets they harbor from their enemies and from each other may be their undoing.Drawing on the rich history of the early twentieth century and set against a large, colorful canvas, Enchanted Islands boldly examines the complexity of female friendship, the universal pursuit of a place to call home, and the reverberations of secrets we keep from others and from ourselves.",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "World War II",
    "Book Club",
    "Historical",
    "Adult Fiction",
    "Literary Fiction"
  ],
  "author": "Allison Amend",
  "average_rating": "3.76",
  "url": "https://www.goodreads.com/book/show/26192488-enchanted-islands"
}