{
  "title": "Rock Chick Recall",
  "description": "Rock Chick Recall is the first three books in the Rock Chick Series. Based in Denver, the Rock Chick Series is eight books that take you on the wild ride of the courtships of the Rock Chicks and the Hot Bunch. The Rock Chick Recall boxed set includes: Rock Chick, Rock Chick Rescue and Rock Chick Redemption. Rock Chick Recall is the first three books in the Rock Chick Series. Based in Denver, the Rock Chick Series is eight books that take you on the wild ride of the courtships of the Rock Chicks and the Hot Bunch. The Rock Chick Recall boxed set includes: Rock Chick, Rock Chick Rescue and Rock Chick Redemption.Rock Chick - Indy Savage has been in love with Lee Nightingale since she was five years old but Lee never showed an interest - so Indy finally gave up. Now a bag of diamonds is missing and Lee is forced to step in when Indy is stun gunned, kidnapped and finding dead bodies. Indy and Lee need to solve the mystery of the diamonds to keep Indy alive, and at the same time Lee needs to work to win back her heart. Rock Chick Rescue - Jet has a secret. Eddie has the hots for Jet. Jet has too many problems to realize that Eddie’s interested. Eddie loses patience when Jet ends her shift at a strip club with a knife at her throat. Since Eddie’s a cop, he figures he can help. Jet’s used to solving everyone’s problems so she doesn’t want Eddie’s help. So Eddie’s got to rescue Jet from a bad man and teach her that some dreams can come true.Rock Chick Redemption - Roxie’s on the run from a bad boyfriend and isn't looking for love at first sight. But when her eyes fall on Hank, she's in trouble. Roxie tries to hold Hank at arm’s length, but when Roxie’s trouble catches up with her, Hank steps in to help out. Hank also needs to show Roxie her past decisions don’t mean her future can’t include something as delicious as...normal.",
  "genres": [
    "Romance",
    "Contemporary",
    "Erotica",
    "Adult"
  ],
  "author": "Kristen Ashley",
  "average_rating": "4.68",
  "url": "https://www.goodreads.com/book/show/26197591-rock-chick-recall"
}