{
  "title": "The Gilda Stories",
  "description": "Before Buffy, before Twilight, before Octavia Butler's Fledgling, there was The Gilda Stories, Jewelle Gomez's sexy vampire novel.\"The Gilda Stories is groundbreaking not just for the wild lives it portrays, but for how it portrays them--communally, unapologetically, roaming fiercely over space and time.\"--Emma Donoghue, author of Room\"Jewelle Gomez sees right into the heart. This is a book to give to those you want most to find their own strength.\"—Dorothy AllisonThis remarkable novel begins in 1850s Louisiana, where Gilda escapes slavery and learns about freedom while working in a brothel. After being initiated into eternal life as one who \"shares the blood\" by two women there, Gilda spends the next two hundred years searching for a place to call home. An instant lesbian classic when it was first published in 1991, The Gilda Stories has endured as an auspiciously prescient book in its explorations of blackness, radical ecology, re-definitions of family, and yes, the erotic potential of the vampire story.Jewelle Gomez is a writer, activist, and the author of many books including Forty-Three Septembers, Don't Explain, The Lipstick Papers, Flamingoes and Bears, and Oral Tradition. The Gilda Stories was the recipient of two Lambda Literary Awards, and was adapted for the stage by the Urban Bush Women theater company in thirteen United States cities.Alexis Pauline Gumbs was named one of UTNE Reader's 50 Visionaries Transforming the World, a Reproductive Reality Check Shero, a Black Woman Rising nominee, and was awarded one of the first-ever \"Too Sexy for 501c3\" trophies. She lives in Durham, North Carolina.More praise for The Gilda Stories:\"Jewelle's big-hearted novel pulls old rhythms out of the earth, the beauty shops and living rooms of black lesbian herstory, expressed by the dazzling vampire Gilda. Her resilience is a testament to black queer women’s love, power, and creativity. Brilliant!\"--Joan Steinau Lester, author of Black, White, Other\"In sensuous prose, Jewelle Gomez uses the vampire story as a vehicle for a re-telling of American history in which the disenfranchised finally get their say. Her take on queerness, community, and the vampire legend is as radical and relevant as ever.\"--Michael Nava, author of The City of Palaces\"I devoured the 25th anniversary edition of Jewelle Gomez's The Gilda Stories with the same venal hunger as I did when I first read it. I still feel a connection to Gilda: her tenacity, her desire for community, her insistence on living among humanity with all its flaws and danger. The Gilda Stories are both classic and timely. Gilda emphasizes the import of tenets at the crux of black feminism while her stories ring with the urgency of problems that desperately need to be resolved in our current moment.\"--Theri A. Pickens, author of New Body Politics\"This revolutionary classic by a pioneer in black speculative fiction will delight and inspire generations to come.\"--Tananarive Due, author of Ghost Summer\"The Gilda Stories was ahead of its time when it was first published in 1991, and this anniversary edition reminds us why it's still an important novel. Gomez's characters are rooted in historical reality yet lift seductively out of it, to trouble traditional models of family, identity, and literary genre and imagine for us bold new patterns. A lush, exciting, inspiring read.\"--Sarah Waters, author of Tipping the Velvet\" . . . its focus on a black lesbian who possesses considerable agency throughout the centuries, and its commentary on gender and race, remain significant and powerful.\"--Publishers Weekly",
  "genres": [
    "Fantasy",
    "Horror",
    "Vampires",
    "Fiction",
    "Queer",
    "Historical Fiction",
    "LGBT"
  ],
  "author": "Jewelle Gómez",
  "average_rating": "3.96",
  "url": "https://www.goodreads.com/book/show/26196033-the-gilda-stories"
}