{
  "title": "Even in Paradise",
  "description": "Peter Ducksworth, a Trinidadian widower of English ancestry, retires to Barbados, believing he will find an earthly paradise there. He decides to divide his land among his three daughters while he is alive, his intention not unlike that of King Lear, who hoped \"That future strife/May be prevented now.\" But Lear made the fatal mistake of confusing flattery with love, and so does Ducksworth. Feeling snubbed by his youngest daughter, Ducksworth decides that only after he dies will she receive her portion of the land. In the meantime, he gives his two older daughters their portions, ironically setting in motion the very strife he hoped to prevent.Beautifully written in elegant prose, this is a novel about greed, resentment, jealousy, betrayal, and romantic love in the postcolonial world of the Caribbean, giving us a diverse cast of characters of African, Indian, Chinese, Syrian/Lebanese, and English ancestry.\"King Lear in the Caribbean--except in this novel, the flattery and deceit of Glynis (Goneril) and Rebecca (Regan) lose out to the principled, honest love of their younger sister, Corinne (Cordelia).Nunez's latest novel follows widower and Barbados retiree Peter Ducksworth, who tests the love and loyalty of his three daughters. Like Lear, things fall apart for Ducksworth when he fails to realize that his youngest daughter truly loves him while the older two are simply using flattery to obtain their inheritance. It all takes place on sumptuous white Caribbean beaches and lush gardens.\"--\nNew York Post\n\"--\nO, the Oprah Magazine\n, 10 Titles to Pick Up NowNamed a Must-Read Book by the \nNew York Post\n\"An epic tale of family betrayal and manipulation couched in superbly engaging prose and peopled with deftly drawn characters. In a story structure as rhythmic as the ebb and flow of the water surrounding Trinidad and Barbados, this revisiting of the classic story of King Lear becomes a subtle, organic exploration of politics, class, race, and privilege. A dazzling, epic triumph.\"--\nKirkus Reviews\n, Starred review\"[Narrator] Émile remarks on parallels to King Lear repeatedly, but there is much more to unpack here. The issue of racism is woven throughout, as are regional problems such as access to Barbados's beaches and poverty in Jamaica's Tivoli Gardens. This is also a celebration of the arts, culture, and natural beauty of the islands. Shakespeare's work is a tragedy, but for Émile 'the future shimmers before [him] full of wondrous possibilities.' Nunez treats her source material with a deft touch, making this story impressive in its own right.\"--\nPublishers Weekly\n\"Nunez's textured and engaging novel explores familial discord, along with questions of kinship and self-identity....With a nod to King Lear, Nunez crafts an introspective tale as her vividly drawn characters navigate complications of heritage, race, and loyalty.\"--\nBooklist\n\"Even if you're not familiar with King Lear, William Shakespeare's great tragedy, you will still enjoy Even in Paradise by Elizabeth Nunez...The author's drama heads to a new place: the Caribbean. We meet Peter Ducksworth, a widower of English ancestry, who retires to beatific Barbados...Ducksworth’s plan to divide his land evenly among his three daughters goes horribly awry when he cuts off his youngest. Having been deceived by the older two, he sees his dreams of a heaven on earth turn hellish. Nunez inspires with this one.\"--\nEssence Magazine\n\"Nunez has written a Caribbean reimagining of King Lear that adds colonialism and racism to the story of three sisters, the men they love and their battle over the deed to their father's beloved property. Themes of greed, jealousy and resentment play out after their father confuses flattery with love and disowns his favorite daughter.\"--\nMs. Magazine\n\"King Lear in the Caribbean.",
  "genres": [
    "Fiction",
    "Retellings",
    "Literary Fiction",
    "Contemporary",
    "Romance",
    "Novels",
    "Love"
  ],
  "author": "Elizabeth Nunez",
  "average_rating": "3.65",
  "url": "https://www.goodreads.com/book/show/26196022-even-in-paradise"
}