{
  "title": "The Rosetta Man",
  "description": "Translator for first contact.Immediate opening. Danger pay allowance.\"The Rosetta Man is an intriguing alien first contact novel–with non-verbal aliens.\" - Nicole LuikenAbout the When aliens finally make first contact, they abduct Estlin Hume from his home and take him across the globe to act as translator — too bad he has no idea what they’re saying.Estlin Hume lives in Twin Butte, Alberta surrounded by a horde of affectionate squirrels. His involuntary squirrel-attracting talent leaves him evicted, expelled, fired and near penniless until two aliens arrive and adopt him as their translator. Yanked around the world at the center of the first contact crisis, Estlin finds his new employers incomprehensible. As he faces the ultimate language barrier, unsympathetic military forces converging in the South Pacific keep threatening to kill the messenger. The question on everyone’s mind is why are the aliens here? But Estlin’s starting to think we’ll happily blow ourselves up in the process of finding that out.About the Claire McCague is a writer, scientist, and folk musician who fabricates nanostructured materials by day and spins words into scripts and books as the stars rise. She lives and doesn’t sleep much in British Columbia.Claire McCague has spent time playing with focused electron beams, femtosecond laser beams, neutron beams and plain, old x-rays. She has a doctorate in chemistry, achieved explicitly to support her arts habits, and spends her days trying to save the world through development of nanostructured materials for sustainable energy conversion systems. Claire performs regularly with the Sybaritic String Band and her plays have been featured in festivals across Canada.\"What makes The Rosetta Man stand-out? An unusually dense squirrel population for sci-fi. It’s light-hearted, accessible sci-fi with exotic present day settings and a pair of aliens who are focused on observing the revealing chaos their visit creates.\" - Claire McCague, authorA perfect sci-fi romp for fans of The Hitchhiker’s Guide to the Galaxy!",
  "genres": [
    "Science Fiction",
    "Fiction",
    "Aliens",
    "Science Fiction Fantasy",
    "Humor",
    "Canada"
  ],
  "author": "Claire McCague",
  "average_rating": "3.86",
  "url": "https://www.goodreads.com/book/show/26197684-the-rosetta-man"
}