{
  "title": "Confessions of an Unlikely Runner: A Guide to Racing and Obstacle Courses for the Averagely Fit and Halfway Dedicated",
  "description": "Witty, observant, and full of cringe-worthy confessions and heartwarming encouragement, Confessions celebrates both running and life.\nPart Bridget Jones, part Forrest Gump, Dana Ayers chronicles her awkward mishaps and adventures in transitioning from childhood bookworm to accidental accomplished athlete. Over the last ten years, Ayers has completed a vast array of races. She runs them all while admittedly not getting much faster, much thinner, or much more disciplined—though she has managed to be on national television, split open her pants, and get electrocuted. Ayers intersperses her hilarious yet relatable struggles with insights about how and why she keeps running.A self-proclaimed ambassador of slow runners, Ayers has completed dozens of endurance challenges, including Tough Mudder, the Ragnar Relay, Muddy Buddy, Warrior Dash, Run Amuck, the Army Ten-Miler, the Country Music Marathon, and many more mud runs, obstacles courses, and races. Her race descriptions will entertain seasoned runners and non-runners alike. Woven into the chaos of her running adventures is compassionate reassurance for anyone who feels like they aren’t fast enough, athletic enough, or strong enough to finish a tough race.Though told with humor, Confessions’ stories share an underlying theme of Ayers’ serious reverence for the sport of running and the running community. Ayers describes experiences such as participating in a 1,000-mile relay for Boston Marathon bombing victims, and being overcome by emotion while observing wounded veterans struggling to finish a race. Her stories prove how life-enriching it can be to physically fight for something and to cheer on others who are doing the same.For anyone who has considered trying a marathon, an obstacle race, or simply taking up running for the first time, Ayers is your ambassador. If she can do it, you can too.",
  "genres": [
    "Nonfiction",
    "Sports",
    "Memoir",
    "Health",
    "Fitness",
    "Biography",
    "Humor"
  ],
  "author": "Dana L. Ayers",
  "average_rating": "4.05",
  "url": "https://www.goodreads.com/book/show/26204920-confessions-of-an-unlikely-runner"
}