{
  "title": "Yoga for Kids",
  "description": "Yoga for Kids will help your Child to find its Inner Balance and Self Awareness  \n  With full color photographs and clear instructions\nThis book will teach you and your child in an easy and playful way to get acquainted with yoga exercises that can be easily integrated into your daily activities. The exercises help your kid develop focus and concentration, and balance its emotions.  Yoga for Kids contains:  \n   relaxing and energizing exercises \n   simple breathing exercises \n   playful ways to stimulate the senses \n   relaxing massage for kids \n   songs and yoga games \n  ˃˃˃ No prior yoga experience required! Through simple and fun breathing exercises and yoga figures, such as animal poses, kids quickly and naturally learn how to use their senses, are more aware of their body and feel increasingly at ease with themselves. Even more importantly, fun exercises and basic yoga poses help kids to get in touch with their inner selves, and build self-confidence. There is a tendency to focus on the cognitive side, stressing the importance of learning, knowledge and rational thinking. Just as important - if not more important - is the emotional aspect when raising kids.  ˃˃˃ Suitable for Toddlers and Pre-schoolers The book is for you if you are either a mom or dad or a teacher. It is suitable for teachers at primary school, day care centres, Kindergarten or at a yoga studio. Especially the last chapter of the book provides you with tools and inspiration to experiment with yoga in a playful way that will surely strike a chord with children who are perceptive to animal poses and singing songs. They pick it up with enthusiasm, and do not realize how important it is for their future life. This is how learning should be! Yoga is a perfect and pleasant way to connect with your child.The Series Inner Wisdom for kids consists of:#1 Happy Family Life#2 Yoga for Kids The author, a well-known certified yoga instructor, specialized in teaching yoga classes for toddlers and pre-schoolers, has a long experience with instructing yoga and has drawn from her vast experience so you and your child can benefit. \n Yoga for Kids is a must have for every parent and teacher who wants to raise wise, happy kids with a strong feeling of self",
  "genres": [],
  "author": "Marjolein Smit",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/26201371-yoga-for-kids"
}