{
  "title": "Sleep With One Eye Open: Ghost",
  "description": "With cunning, courage and good luck, John survived the horror of the zombie outbreak in Sydney. He fled the city with little more than the clothes on his back, hoping to outrun the savage horde of ghouls that annihilated Sydney’s population of four and a half million people.His perilous journey north covered several hundred kilometres of hostile territory, arriving at the outskirts of Coomba Park, the tiny lakeside settlement where he grew up. His family were missing, but he found clues to their location. As he continued his journey to Gloucester, he quickly discovered it is impossible to outrun an enemy that doesn’t need sleep. He found his family in time to warn them of the horde of flesh-eating ghouls that would soon arrive on their doorstep. Under the cover of darkness they successfully escaped the ravenous pack of fiends that swarmed through the town.Taking refuge on an abandoned rural property outside the remote village of Nowendoc, the group must evade enemies, both living and undead, as they try to establish a new life for themselves. Struggling to survive with limited supplies, John and his family realise they can’t hide forever. Everything they do increases their chances of being discovered. The sleepy country town of Gloucester might be small, but it is just as treacherous as Sydney. Marauding zombies and other survivors create a dangerous environment that can quickly turn lethal; ensnaring the unwary and the unlucky.While searching for supplies in the abandoned homes and businesses of Gloucester, John rapidly learns his presence isn’t welcome. He doesn’t know who these people are or understand their motives; but they are determined to make his life hell. Join John as he tries to remain one step ahead of this new enemy.",
  "genres": [
    "Horror",
    "Zombies"
  ],
  "author": "Beau Johnston",
  "average_rating": "4.10",
  "url": "https://www.goodreads.com/book/show/26198358-sleep-with-one-eye-open"
}