{
  "title": "Prom Dates from Hell",
  "description": "Maggie Quinn, girl reporter. Honors student, newspaper staffer, yearbook photographer.   Six weeks from graduation and all she wants to do is get out of Avalon High in one piece. A sensible nerd would have kept her head down, done her drive-by photo shoot of the prom, and continued the countdown to Deploma Day. But fate seems to have different plans for Maggie.   High school may be a natural breeding ground for evil, but the scent of fire and brimstone is still a little out of the ordinary. It's the distinct smell of sulfur that makes Maggie suspect that something's a bit off. And when real Twilight Zone stuff starts happening to the school's ruling clique—the athletic elite and the head cheerleader and her minions, all of whom happen to be named Jessica—Maggie realizes it's up to her to get in touch with her inner Nancy Drew and ferret out who unleashed the ancient evil before all hell breaks loose.   Maggie has always suspected that prom is the work of the devil, but it looks like her attendance will be mandatory. Sometimes a girl's got to do some pretty undesirable things if she wants to save her town from soul-crushing demons from hell. And the cheerleading squad.\"Dripping with wit on nearly every page.\"- School Library Journal\"Smart (and smart-ass).\"- KLIATT\"There is a lot to like in this story that takes on magic, romance, and even clique politics.\"- Publisher's Weekly\"Fans of shows like Charmed and Buffy the Vampire Slayer will relish the unflappable, edgy humor Maggie brings to her fight against supernatural evil.\"- The Horn Book Magazine\"Sharp, sarcastic wit...[This book] will appeal to supernatural fans of Meg Cabot's Mediator series.\"- VOYA",
  "genres": [
    "Young Adult",
    "Fantasy",
    "Paranormal",
    "Supernatural",
    "Urban Fantasy",
    "Romance",
    "Demons"
  ],
  "author": "Rosemary Clement-Moore",
  "average_rating": "3.74",
  "url": "https://www.goodreads.com/book/show/2619995-prom-dates-from-hell"
}