{
  "title": "Rune of the Apprentice",
  "description": "In a world where magic, technology, and nature have merged, the few who can control Runes hold dominance over all of creation. All believe that Aleksi, a sixteen-year-old orphan, was blessed to be born with a Rune embedded in his palm, but that’s only because they don’t know the truth―Aleksi’s Rune is so powerful it’s killing him.Asura, a brutal emperor who uses Runes to conquer entire continents, will stop at nothing to kill Aleksi and claim the boy’s power for his own. With Aleksi’s Rune burning its way through his body and assassins hunting his every step, his survival depends on discerning ally from enemy and learning to tame the competing forces of light and dark within.With the burden of his rune haunting his days and the prophetic whispers of a young captive priestess illuminating his nights, Aleksi will be able to unravel the mysteries of his past, rescue the girl in his dreams, and challenge the most powerful warlord the world has ever known only if the one thing keeping him alive―his Rune―does not kill him first.--From the Back Cover:AN ANCIENT CURSE COULD MEAN ULTIMATE POWER.BUT AT WHAT COST?\"Stone has hit it out of the ballpark with this book, and you will not want to put it down.\" --Ben Greenfield, New York Times bestselling author of Beyond Training\"An engaging story filled with magic, swordplay, and even pirates... Easy five stars.\" --Dave Barrett, author of It's All Fun and Games\"The flowing prose is experienced rather than read--and done with vivid clarity. I'm highly anticipating the next in the series!\" --J-F. Dubeau, author of The Life Engineered and A God in the Shed\"I was on the edge of my seat, across oceans and over land, until the last page.\" --Zachary Tyler Linville, author of Welcome to Deadland\"Absolutely the perfect universe to geek out over.\" --Rick Heinz, author of The Seventh Age: Dawn\"A fresh superbly crafted fantasy epic that conquers both world and character building\" --Tal M. Klein, author of The Punch Escrow",
  "genres": [
    "Fantasy",
    "Science Fiction"
  ],
  "author": "Jamison Stone",
  "average_rating": "3.93",
  "url": "https://www.goodreads.com/book/show/26201256-rune-of-the-apprentice"
}