{
  "title": "Death at Breakfast",
  "description": "From the acclaimed New York Times bestselling author of Still Missing, More Than You Know, and Gossip comes the first entry in a stylish and witty mystery series featuring a pair of unlikely investigators--a shrewd novel of manners with a dark heart of murder at its center, set in small-town New England. Indulging their pleasure in travel and new experiences, recently retired private school head Maggie Detweiler and her old friend, socialite Hope Babbin, are heading to Maine. The trip--to attend a weeklong master cooking class at the picturesque Victorian-era Oquossoc Mountain Inn--is an experiment to test their compatibility for future expeditions. Hope and Maggie have barely finished their first aperitifs when the inn's tranquility is shattered by the arrival of Alexander and Lisa Antippas and Lisa's actress sister, Glory. Imperious and rude, these Hollywood one-percenters quickly turn the inn upside-down with their demanding behavior, igniting a flurry of speculation and gossip among staff and guests alike. But the disruption soon turns deadly. After a suspicious late-night fire is brought under control, Alex's charred body is found in the ashes. Enter the town's deputy sheriff, Buster Babbin, Hope's long-estranged son and Maggie's former student. A man who's finally found his footing in life, Buster needs a win. But he's quickly pushed aside by the \"big boys,\" senior law enforcement and high-powered state's attorneys who swoop in to make a quick arrest. Maggie knows that Buster has his deficits and his strengths. She also knows that justice does not always prevail--and that the difference between conviction and exoneration too often depends on lazy police work and the ambitions of prosecutors. She knows too, after a lifetime of observing human nature, that you have a great advantage in doing the right thing if you don't care who gets the credit or whom you annoy. Feeling that justice could use a helping hand--as could the deputy sheriff--Maggie and Hope decide that two women of experience equipped with healthy curiosity, plenty of common sense, and a cheerfully cynical sense of humor have a useful role to play in uncovering the truth.",
  "genres": [
    "Mystery",
    "Fiction",
    "Cozy Mystery",
    "Mystery Thriller",
    "Audiobook",
    "Crime",
    "Cozy"
  ],
  "author": "Beth Gutcheon",
  "average_rating": "3.15",
  "url": "https://www.goodreads.com/book/show/26198888-death-at-breakfast"
}