{
  "title": "All the Glory",
  "description": "This is an alternate Cover Edition for ASIN: B00OY5NLYO.NEW YORK TIMES and USA TODAY BESTSELLING AUTHOR, ELLE CASEY, brings readers the Thriller/Romantic Suspense novel ALL THE GLORY: How Jason Bradley Went from Hero to Zero in Ten Seconds Flat.Jason Bradley has everything going for him. He's Banner High's first-string varsity wide receiver, headed to another State championship, and the college recruiters are already knocking on his door. His girlfriend is every guy's dream, there's a brand new black Camaro with a 6.2L, V-6 engine parked in his garage, and he's on cruise control. But when the school's beloved football coach turns up dead and Jason's found standing over the body, his cruise control cuts off bringing his charmed life to a screeching halt, and the reality of being an accused murderer of the first degree takes over. When everyone else walks away and leaves him to hang, one girl can't. But it's going to take more than guessing and wishing to get through to him and the truth of what happened, since he seems bound and determined to accept his fate as a criminal, tried as an adult and eligible for lethal injection.Can one really determined girl get to the bottom of the mystery when no one else seems to care? It would be so much easier to watch him go down, and for many, maybe just a little bit too satisfying. After all, who isn't guilty of finding pleasure in seeing that perfect someone suddenly exposed for the self-centered prick that he really is?Content warning: For teens and adults. Some foul language, violence is mild in description but serious in effect.A message from Elle about this book: I was lying in bed one night, almost totally asleep, and this story just popped into my head. It was so gripping, I forced myself to wake up so I wouldn’t lose the idea. I sat up in bed with my laptop computer that’s never far from my side and wrote out the first 10,000 words along with a plot outline. I’m a big fan of stories where people’s lives are completely turned upside down, so this was a real pleasure to dig into. For me, it was one of those books that practically wrote itself.",
  "genres": [
    "Young Adult",
    "Sports",
    "Romance",
    "Contemporary",
    "High School",
    "Mystery",
    "New Adult"
  ],
  "author": "Elle Casey",
  "average_rating": "3.84",
  "url": "https://www.goodreads.com/book/show/26205316-all-the-glory"
}