{
  "title": "The Accidental Slaveowner: Revisiting a Myth of Race and Finding an American Family",
  "description": "What does one contested account of an enslaved woman tell us about our difficult racial past? Part history, part anthropology, and part detective story, The Accidental Slaveowner traces, from the 1850s to the present day, how different groups of people have struggled with one powerful story about slavery.For over a century and a half, residents of Oxford, Georgia (“the birthplace of Emory University”), have told and retold stories of the enslaved woman known as “Kitty” and her owner, Methodist bishop James Osgood Andrew, first president of Emory’s board of trustees. Bishop Andrew’s ownership of Miss Kitty and other enslaved persons triggered the 1844 great national schism of the Methodist Episcopal Church, presaging the Civil War. For many local whites, Bishop Andrew was only “accidentally” a slaveholder, and when offered her freedom, Kitty willingly remained in slavery out of loyalty to her master. Local African Americans, in contrast, tend to insist that Miss Kitty was the Bishop’s coerced lover and that she was denied her basic freedoms throughout her life.Mark Auslander approaches these opposing narratives as “myths,” not as falsehoods but as deeply meaningful and resonant accounts that illuminate profound enigmas in American history and culture. After considering the multiple, powerful ways that the Andrew-Kitty myths have shaped perceptions of race in Oxford, at Emory, and among southern Methodists, Auslander sets out to uncover the “real” story of Kitty and her family. His years-long feat of collaborative detective work results in a series of discoveries and helps open up important arenas for reconciliation, restorative justice, and social healing.",
  "genres": [
    "History",
    "Anthropology",
    "Education"
  ],
  "author": "Mark Auslander",
  "average_rating": "3.70",
  "url": "https://www.goodreads.com/book/show/11688523-the-accidental-slaveowner"
}