{
  "title": "The Butterfly Code",
  "description": "My name is Aeris Thorne. I am a genetically modified human. PAINFUL SECRETS. STARTLING TRUTHS.UNDENIABLE LOVE.All it took was a chance meeting--one tingling glance across a darkened street to change my life.I'd been searching for my two best friends in the crowded Zenith Club, which was a really bad idea because I'm totally claustrophobic. I burst outside, and that's when I came face-to-face with the incredibly gorgeous Hunter Cayman. Dark-haired, tall, and leaning against an insane sports car, my pulse went haywire. Maybe things weren't so bad after all. The young doctor had his long muscular arms crossed over his leather jacket clad chest, and all his six-foot something would make any girl's knees turn weak. But then, if what Ella said was true, Hunter was the kind of guy who left behind a trail of broken hearts. And heartache was the last thing I needed right now.Yet there's something strange, something almost superhuman about Hunter. It's more than that infuriatingly knowing grin. I'm trying to stop thinking about him, and I get the feeling he's avoiding me, too. Yet Deep Cove is a tiny town and every time we run into each other the tension literally crackles, sparking around us. It just figures that when suddenly I'm in danger, he's there to save me.In truth, I should be dead. By all the logic in this world, I should be shattered to pieces. How fast was I going on that ATV when I smashed into those iron gates? Ninety? A hundred? And the men who were chasing me, where did they go?Somehow I'm whole.Maybe better than whole. There's no one I can talk to, not even my best friend, Gage. Gage hates Hunter. He wants Hunter's laboratory to be shut down. He thinks Hunter's a monster. And yet, if that's true, if Hunter's a monster...than what am I? I'm not sure what terrifies me more, the metamorphosis taking place inside me, or the intensely powerful connection with a guy whose heart and soul has become linked with mine.",
  "genres": [
    "Romance",
    "Science Fiction",
    "New Adult",
    "Mystery",
    "Fantasy",
    "Thriller",
    "Young Adult"
  ],
  "author": "Sue Wyshynski",
  "average_rating": "3.98",
  "url": "https://www.goodreads.com/book/show/26207629-the-butterfly-code"
}