{
  "title": "ProHuman Inc",
  "description": "Prohuman Inc. introduces the new craze in town, a virtual reality, recreational system created by its founder Ray Raskal. Each user is given various choices and can participate in a vast assortment of lifelike, exotic, fantasy services from the luxury and comfort from their own homes through a virtual reality headset that can read and interact with their neural processes. The service provided is extremely popular as vast numbers of users sign up and join one of the five powerful clan groups that Ray Raskal has created purely for their entertainment within the Recreation framework. Clients are given the ability to travel through a virtual realm and can become personified programs, viruses, hero's or even villains as preferred. Each client is provided with the opportunity to join a powerful clan group that interacts with other users as either an Attacker, a Protector, an Enabler, a Socialite or a Freelancer as desired. The luxury, recreational service leaps out into the commercial world and attracts immediate interest and significant sign ups as people start to enjoy the flexibility to facilitate the technology to make either love, war, enemies or allies through various virtual reality interactions and activities and Recreation provides them with an escape and fantasy world they can indulge whenever they want to.However as the lines between reality and virtual reality become more obscure, some clients suddenly start to discover that not everything in Recreation is as perfect as they originally envisaged it to be. Once they plunge more deeply into the realms of this new, experimental technology they suddenly find themselves facing horrific side effects as they rapidly begin to realize exactly what their participation in this enchanting, alluring fantasy trip has actually induced and the deadly price they may now actually have to really pay.There is always a price to pay for progress....Written By Jill Thrussell.Glitches Series:The Glitches series explores the possible facilitation of technology when 'the end justifies the means' is applied to technological developments and their implementation by human beings and examines how that can result in both negative and positive outcomes.",
  "genres": [],
  "author": "Jill Thrussell",
  "average_rating": "4.75",
  "url": "https://www.goodreads.com/book/show/26210053-prohuman-inc"
}