{
  "title": "Fret",
  "description": "WARNING: This book contains homosexual relations and crude language. A sneak peek at book 2 follows the ending!  Former Navy SEAL Axel Blaze lives a solitary life. He doesn't do emotions, and he doesn't do babysitting. Used to being on his own, his job consists of Wetwork (a charming term coined by the KGB) for his former Master Chief, Mac. When an out-of-the-ordinary job lands on his doorstep, Axel heads down a path that includes a famous heavy metal rock band and one quiet, vulnerable, guitar-shredding virtuoso named Gareth Wolf.  Gareth Wolf's life changed in an instant when a car he was a passenger in crashed, hurting his brother's best friend and the band's lead guitarist. They created the band, Skull Blasters, as kids. Gareth had always been happy in the background, playing roadie. With the lead guitarist's injury, Gareth is suddenly thrust into the limelight and into a frenzied life he never imagined for himself. Finally fed up with living a lie, Gareth comes out as gay in a newspaper interview and finds himself in the bulls-eye of a crazed stalker. Somebody wants Gareth hurt - or worse - and Mac has been hired to be sure that doesn't happen. Babysitting duty is NOT Axel's strong suit, but Mac won't be budged.  Enter Axel Blaze.  Against his better judgment, the big man takes the job to protect the shy musician. The more time he spends with Gareth Wolf, the more he admires the man. Where's a simple assassination when you need one? The situation becomes more volatile for each man as the attempts on Gareth escalate just as Axel finds himself falling for the quiet lead guitarist.  Strong, funny, smart-ass -- and kinda sweet Axel is everything Gareth has ever wanted in a man. Too bad he's off limits. As the stalker grows bolder, Gareth and Axel move closer emotionally - but is it too late? All Axel knows is that they don't stand a chance if he can't find the maniac trying to kill the man he's come to care about. A lot. Everyone knows that relationships that begin in pressured or volatile situations eventually fizzle out. Or do they?",
  "genres": [
    "M M Romance",
    "Romance",
    "Music",
    "Military Fiction",
    "Contemporary",
    "Musicians",
    "Audiobook"
  ],
  "author": "Sandrine Gasq-Dion",
  "average_rating": "3.98",
  "url": "https://www.goodreads.com/book/show/26206849-fret"
}