{
  "title": "AJAYA - RISE OF KALI (Book 2)",
  "description": "\"THE MAHABHARATA ENDURES AS THE GREAT EPIC OF INDIA. While Jaya is the story of the Pandavas, told from the perspective of the victors of Kurukshetra, Ajaya is the tale of the Kauravas, who were decimated to the last man. From the pen of the author who gave voice to Ravana in the national bestseller, ASURA, comes the riveting narrative which compels us to question the truth behind the Mahabharata.  THE DARK AGE OF KALI IS RISING and every man and woman must choose between duty and conscience, honour and shame, life and death…   o The Pandavas, banished to the forest following the disastrous games of dice, return  to Hastinapura.  o Draupadi has vowed not to bind her hair till she washes it in the blood of the Kauravas.  o Karna must choose between loyalty and gratitude, friend and Guru.  o Aswathama undertakes a perilous mission to the mountains of Gandhara, in search of the  Evil One.  o Kunti must decide between her firstborn and her other sons.  o Guru Drona has to stand with either his favourite disciple or his beloved son.  o Balarama, having failed to convince his brother about the adharma of violence, walks the  streets of Bharatavarsha, spreading the message of peace.  o Ekalavya is called to make the ultimate sacrifice to uphold a woman’s honour.  o Jara, the beggar, sings of Krishna’s love while his blind dog, Dharma, follows.  o Shakuni can almost see the realization of his dream to destroy India.  As the Pandavas stake their claim to the Hastinapura throne, the Kaurava Crown Prince, Suyodhana, rises to challenge Krishna. As great minds debate dharma and adharma, power hungry men prepare for an apocalyptic war. The women, highborn and humble, helplessly watch the unfolding disaster with deep foreboding. And greedy merchants and unscrupulous priests lie in wait like vultures. Both sides know that beyond the agony and carnage the winner will take all. But even as gods conspire and men’s destinies unfold, a far greater truth awaits.   *****   One of the six most remarkable writers of India. DNA  An Amazing read. The WEEK  Unique voice of a rebellious author telling the story from the other side,  a feat a few have dared or managed so well. Bihar Times\"",
  "genres": [
    "Mythology",
    "Fiction",
    "Historical Fiction",
    "Indian Literature",
    "Novels",
    "Audiobook",
    "India"
  ],
  "author": "Anand Neelakantan",
  "average_rating": "4.26",
  "url": "https://www.goodreads.com/book/show/26206227-ajaya---rise-of-kali-book-2"
}