{
  "title": "The Berserker and the Pedant",
  "description": "Gurken Stonebiter, avatar of Durstin Firebeard, templerager of the Stonebiter clan, is in a pretty pickle. He’s an axe-happy, grammatically-challenged dwarf on the hunt for blood. Thieves made off with temple property, sending him into a fit of vengeful rage. Seeing as he's a Berserker, it’s in everyone’s best interest not to get Gurken’s hackles up. Gurken often dissolves into a fury of blood, lust, and carnage unlike anything seen in the age of men. When he finds those whom he assumes to be the aforementioned thieves, he is unable to control himself. Thus for our heroes, a master magician named Arthur and a girl-child named Pellonia, the blood flows until poor Arthur is hacked into pieces. It takes all the temple priests (and all the king’s men) to put Arthur back together again. Imprisoned for their supposed crimes, Pellonia and Arthur aren't willing to sit around the dungeon on principle, and so promptly escape. They return the following morning to join Gurken on a hilarious and dangerous adventure to the Mines of Moog to recover the sacred Orb of Skzd. Along the way they face gruesome deaths at the hands of enormous arthropods, an amiable Minotaur, and excitable dragons, making them wonder what exactly they’re doing on this quest in the first place. Pellonia, for one, is much more than meets the eye, and although she has the body of a pre-pubescent girl, she is full of snark and knowledge beyond her years. Her past and fate become apparent as they meet mysterious denizens from her childhood. Arthur’s ability to frequently engage in death throes only to return once more is to be admired as well as puzzled over. Unfortunately, one too many dismemberments occur and some shortcuts are taken during the resurrection process, to Arthur’s utmost shame and revulsion. Gurken, with his brash temperament and willingness to confront anything that challenges them, though it be ten times his size, is both an enviable asset and a terrible curse along the way. The three companions come together to brave obstacles and solve puzzles hindering them from obtaining the goal of their quest. Within the Mines of Moog, the lurking creatures multiply in size, cleverness, and deadliness. Well, with the exception of a new knoll dwarf ally, who joins them as a healer to serve against future dismemberments. Kitten-sized ants, elven maidens, and others occasionally strive to assist our heroes on their oft-forgotten quest. Gurken’s adventures run the gamut of the fantasy genre, taking us through the ridiculous to the mythological, passing through epic fantasy, and finally resting on fantastically improbable. The rapid, so-fast-you-might-miss-it pace of the short stories make for one incredible, bordering on the absurd, ride that will enthrall fantasy lovers everywhere. Fantastic creatures abound in these stories, and it takes a clever eye to catch all the different breeds and specimens from orc to elf. Blink and you will miss a flippant phrase or a clever beast of burden flickering into existence and going out. Gurken’s adventures have a cunning, dry, tongue-in-cheek style and quick-as-a-whip writing that will have fans of William Goldman’s The Princess Bride begging for more.",
  "genres": [
    "Fantasy",
    "Humor",
    "Magic",
    "Paranormal",
    "Science Fiction",
    "Audiobook"
  ],
  "author": "Josh Powell",
  "average_rating": "3.70",
  "url": "https://www.goodreads.com/book/show/26213725-the-berserker-and-the-pedant"
}