{
  "title": "One More Day",
  "description": "She dropped out of college to pay her bills. Now, her medical test results are back and they say it's cancer. As if that isn't bad enough, getting laid off means Mackenzie is broke. No money, no friends, and right now, she could really use a shoulder. It's the worst day of her life. Not even meeting the Super Hot Guy from the coffee shop can make it better.Or can it?Ryan had been trying to get the nerve to talk to her for months. This time, the beautiful artist isn't lost in her work. Nope, she's distracted by something else. Something that brings tears to those gorgeous eyes. It's the excuse he needs to finally get the nerve to say hi. She needs a shoulder and he's more than willing to give it - plus a job that lets her use her art. Besides, a wise man keeps his muse very close.Maybe a tattoo parlor isn't the best place for a girl with cancer to work, but rent still has to get paid. Plus, spending time with her hot boss is pretty nice. Maybe too nice? His shy smiles make her stomach flip... or that could be the chemo. It all comes back to her cancer, it seems, but she finally has a reason to keep fighting. Not that some sick, bald girl is going to impress anyone, but if she can just get better, then maybe she'll finally get the chance.It doesn't take long for her secret to come out, but Ryan isn't going to lose this girl. Not because he's her boss, not because he waited too long to make a move, and he's certainly not going to let some disease screw this up. She thinks the cancer is going to win, but he has other plans. He just needs one more day to prove it, but she may not give him that option.***Possible Sensitivity Notice*** The female main character in this book has cervical cancer and goes through treatment over the course of this story. However, this is a romance novel and has a Happy Ever After.",
  "genres": [
    "Romance",
    "Contemporary",
    "Contemporary Romance",
    "M F Romance",
    "Illness",
    "Adult",
    "Fiction"
  ],
  "author": "Auryn Hadley",
  "average_rating": "4.32",
  "url": "https://www.goodreads.com/book/show/26215381-one-more-day"
}