{
  "title": "Highlands",
  "description": "Journey of Dreams- Dreams have a way of infusing themselves into our souls–becoming an indivisible part of who we are. Five lives irrevocably change when their greatest longings become their new reality–and for one, vice versa. The Journey of Dreams series is Contemporary Christian Fantasy, exploring the desires of our hearts and how the Lord meets them. ~ * ~ * ~ * ~ * ~ * ~ Introspection–this place invites it. I’ve never allowed myself the time to pause and get to know myself. My father taught me it was weak. Focus on the prize–eyes off yourself. The goal matters. You are just the instrument to get you there. Here… Is this what that goal was and I never knew it? The peaks above, the trees that stand tall beside me as if my own personal bodyguards. I am alive–maybe for the first time in my life–and I think it’s because I’m dead. When Tony arrives in Highlands, he must come to grips with a world that embraces birth defects as beautiful and to be celebrated–even those easily corrected. Balancing the beauty of utter acceptance and the wisdom of when to alter the “workmanship of God” creates tension between Tony and the Highlanders. The Journey of Dreams series explores themes in the Christian life from a different perspective–from a world that can’t exist anywhere but in the dreams of the people who live there.  Editorial Review Ms. Havig drops a modern young athlete (nearly naked!) into a remote, bizarre community. He is confused. He is horrified. He wonders if he has died and is in some sort of afterlife. And then, with perfect, almost elegant pacing, the story unfolds, revealing a fascinating world in which people have unquestioningly accepted every circumstance as the will of – gifts from – God. Our hero struggles with understanding their beliefs – and so does the reader. The themes of extreme submission and gratitude are thought-provoking in this context. ~Cathe Swanson",
  "genres": [
    "Fantasy",
    "Christian",
    "Christian Fiction"
  ],
  "author": "Chautona Havig",
  "average_rating": "4.56",
  "url": "https://www.goodreads.com/book/show/26222101-highlands"
}