{
  "title": "Mistletoe, Marriage, and Mayhem: A Bluestocking Belles Collection",
  "description": "In this collection of novellas, the Bluestocking Belles bring you seven runaway Regency brides resisting and romancing their holiday heroes under the mistletoe. Whether scampering away or dashing toward their destinies, avoiding a rogue or chasing after a scoundrel, these ladies and their gentlemen leave miles of mayhem behind them on the slippery road to a happy-ever-after.  ***All proceeds benefit the Malala Fund.***  All She Wants for Christmas, by Amy Rose Bennett A frosty bluestocking and a hot-blooded rake. A stolen kiss and a Yuletide wedding. Sparks fly, but will hearts melt this Christmas?  The Ultimate Escape, by Susana Ellis Abandoned on his wedding day, Oliver must choose between losing his bride forever or crossing over two hundred years to find her and win her back.  Under the Mistletoe, by Sherry Ewing Margaret Templeton will settle for Captain Morledge’s hand in marriage, until she sees the man she once loved. Who will win her heart at the Christmas party of her would-be betrothed?  ‘Tis Her Season, by Mariana Gabrielle Charlotte Amberly returns a Christmas gift from her intended—the ring—then hares off to London to take husband-hunting into her own hands. Will she let herself be caught?  Gingerbread Bride, by Jude Knight Traveling with her father's fleet has not prepared Mary Pritchard for London. When she strikes out on her own, she finds adventure, trouble, and her girlhood hero, riding once more to her rescue.  A Dangerous Nativity, by Caroline Warfield With Christmas coming, can the Earl of Chadbourn repair his widowed sister’s damaged estate, and far more damaged family? Dare he hope for love in the bargain?  Joy to the World, by Nicole Zoltack Eliza Berkeley discovers she is marrying the wrong man—on her wedding day. When the real duke turns up instead, will her chance at marital bliss be spoiled?",
  "genres": [
    "Romance",
    "Historical Romance",
    "Regency",
    "Anthologies",
    "Historical Fiction",
    "Novella"
  ],
  "author": "Amy Rose Bennett",
  "average_rating": "4.16",
  "url": "https://www.goodreads.com/book/show/26215089-mistletoe-marriage-and-mayhem"
}