{
  "title": "The Big Brush-off",
  "description": "The irresistible Jake & Laura return in Michael Murphy's witty, fast-paced mystery series—perfect for readers of Dorothy Cannell and Christopher Fowler. In The Big Brush-off, the charming and indomitable duo heads to the Midwest to solve a chilling cold case of a young girl's murder. Blackie Doyle is dying. That's what Jake Donovan's literary agent tells him. Sales are falling, and the rough draft of Jake's latest Blackie novel doesn't look promising. Maybe Jake has been distracted by a recent barrage of real-life homicides, or by his marriage to the beautiful up-and-coming actress Laura Wilson, now slated for a part opposite Clark Gable himself. Whatever the reason, Jake decides to return to his roots. Which is why he and Laura hop the next train to the small town in Pennsylvania where Jake once worked as a Pinkerton detective. Ten years ago, the murder of a teenage girl interrupted life in quiet, God-fearing Hanover. The unsolved case has always gnawed at Jake, and it seems no coincidence that as soon as he starts digging up old ghosts, he's once again writing like a dervish. Nor is it surprising that some townfolk would rather see the truth stay buried—and maybe even Jake and Laura with it. But the glamorous crime-solving pair refuse to leave before sorting through a bevy of suspects—and at long last nailing the one who almost got away with the not-so-perfect crime. Praise for Michael Murphy's Jake & Laura mysteries “Glittering with a hint of Nick and Nora, Michael Murphy's 1930s Manhattan provides a witty setting for murder and mayhem.”—Mary Daheim, bestselling author of The Alpine Yeoman, on The Yankee Club “[Jake and Laura] are fun, witty, and charming, and [All That Glitters] is filled with the same kind of 1930s Hollywood glamour that made the film of The Thin Man such a classic.”—Popcorn Reads “The third installment in Murphy's series is just as much fun as the first. The mystery is full of twists with an ample amount of red herrings, suspects, and action.”—Mystery Please!, on Wings in the Dark",
  "genres": [
    "Mystery",
    "Historical Mystery",
    "Historical Fiction",
    "Detective",
    "Crime"
  ],
  "author": "Michael  Murphy",
  "average_rating": "4.19",
  "url": "https://www.goodreads.com/book/show/26230382-the-big-brush-off"
}