{
  "title": "GUTS 'N GUNSHIPS: What it was Really Like to Fly Combat Helicopters in Vietnam",
  "description": "Synopsis  In the summer of 1967, Mark Garrison had dropped out of college at Southern Illinois University in Carbondale, Illinois, just before entering his third year. He had run out of money and had to work for a while. These were the days before the lottery and the draft soon came calling. In order to somewhat control his own future, he enlisted in the U.S. Army’s helicopter flight school program. Little did he know that this adventure would be the most profound experience of his life.  Garrison flew hundreds of missions for the 119th AHC, stationed in the Central Highlands at Camp Holloway in Pleiku, Vietnam. He was awarded twenty-five Air Medals, four campaign Bronze Stars, and The Distinguished Flying Cross among numerous other awards. His narrative takes you through the whole process, from basic training, flight school, flying combat in Vietnam, and his return to the United States. His description includes many incidents in combat flight, including being hit by rocket propelled grenades and being on fire in the air, over hundreds if not thousands of enemy troops. But this is not all. He elaborates on the daily lives, emotions, and nuances of the pilots and what they considered their mission to be.  \nGUTS 'N GUNSHIPS\n is a must read if you are to have a realistic understanding of what flying helicopters in Vietnam combat was all about.   Review  “Mark Garrison’s Guts 'N Gunships is more than just another Vietnam flashback. It is a portal which will transport readers to a most painful American experience. These were definitely goodbye times in America and the author bares his soul with his narrative.  The author reveals how he, his friends and family, like millions of other Americans were sucked into the Vietnam whirlwind while the nation’s leaders wrestled with a domino theory pressed upon the nation by think tanks tied to the military industrial complex.  Guts 'N Gunships follows Garrison’s true life story of being on the short list for the draft, and then going all in by signing up for helicopter pilot training. After just a few months training, he found himself in the mountains of Vietnam flying Huey helicopters into small holes in the triple canopy jungle. He had been assigned to duty with the Crocodiles and Alligators of the 119th Assault Helicopter Company, just a few short miles from the dreaded Ho Chi Minh Trail.  His one year recounting of his numbered days there is painted with blood, pathos and hilarious incidents, stemming from hard drinking and furious nap of the earth flying, while the helicopters were blown apart with the pilots and crews in them.  Most uplifting of all is the author’s first person accounting of a unit of pilots who saw the American mission failing but renewed vows among themselves that they would give the enemy no quarter and would cut no corners in their attempts to bring home alive every American they possibly could.  No one has ever before addressed the American helicopter pilot experience in the way Garrison does.” —Ron Gawthorp",
  "genres": [
    "History",
    "Military Fiction",
    "War",
    "Military History",
    "Nonfiction",
    "Memoir",
    "Aviation"
  ],
  "author": "Mark   Garrison",
  "average_rating": "4.30",
  "url": "https://www.goodreads.com/book/show/26223663-guts-n-gunships"
}