{
  "title": "Fate Of The Children: Holocaust Confessions Of A Reluctant Nazi",
  "description": "A young Jew interviews an old Nazi about the intense debate among German soldiers, officers, and commanders over the fate of ninety Jewish children in 1941.A young Jewish documentary producer is obsessed with the holocaust story of Bila Tserkva.In 1941, the Germans rounded up and killed the adults and older children. The shooting bothered the soldiers. They had a harder time with the remaining ninety children. The children were held in a building while chaplains and officers took it higher up the chain for a decision on killing the children.The young filmmaker found an old German living in the South with his great niece. He offered to watch the old man during the day if he could interview him.The story leaked out to the young man's friends in Hollywood and a film star was interested. The young man fought to keep them away from what he thought was a story that needed to be told in a factual way.As he interviewed the old German, he got an inside look into the minds of the soldiers as they debated the fate of the children.He got insight into the relationship of two soldiers who were bound together through love and hate. Not even twenty years old, one was a feared killer, the other was an easily dismissed compassionate man. Together, the two Germans fought, killed, drank and debated. The two young men personified the ease and struggle, the pleasure and pain, the horror and delight of hating and killing Jews.All of this came out in the old man's story along with a powerful love story between a German soldier and a beautiful Jewish woman, who was known as \"the woman in the window.\"In the present day, the young filmmaker fell in love with the old German's great niece. Together, they struggled with the moral and ethical dilemmas unfolding as the blanket of inhumanity was lifted to reveal a bit of humanity inside one of the horrible episodes of the holocaust.",
  "genres": [],
  "author": "David Matheny",
  "average_rating": "4.22",
  "url": "https://www.goodreads.com/book/show/26227234-fate-of-the-children"
}