{
  "title": "The Science of the Lambs",
  "description": "The classic satire that predicts BREXIT and President Trump!OMG! if the rest comes true we're all hosed.'The Science of the Lambs' puts the diss into dystopia and where meat really is murder.\"The Science of the Lambs\" is a witty and topical black comedy about our planets future history over the coming decade.It is the year 2025 and the world is utterly mad. The principal culprits for this outbreak of global insanity are cows…..although monkeys, pigs and even innocent little baby lambs are also complicit.In the previous decade Ebola had killed fifty million people. The pandemic’s initial cause was infected meat and today certified uncontaminated edible meat costs more than most countries GDP’s.Geopolitically, a majority UKIP government has removed Britain from the EU and granted independence to Scotland, Northern Ireland, Wales, the Isle of Man, the Channel Isles, the Isles of Scilly and Carshalton. The remaining rump is called Little England. In the Middle East the ruling Barbaric State now controls the majority of the world’s oil supplies as well as awesome quantities of sand and dust.The Barbaric State’s Caliph and entourage are visiting Little England to negotiate oil supply and peace agreements with Prime Minister Farrago. The culmination of their visit features a State Banquet in Windsor Castle hosted by King Wills and Queen Consort Kate. Halal lamb (Agneau de la Nouvelle Saison de Windsor au Basilic) will be served to the 160 fortunate attendees. The meat has an estimated black market value of £500bn.Given the paucity and price of edible meat, a number of gatecrashers have designs on dinner. Those parties include the Ram-Raiders (professional meat thieves), Lambophobics (animal rights activists turned predators), a Romanian mafia family and, of course, the police and army Beefeaters are also there to protect and serve.The competing parties encounter each other in a deranged denouement in Windsor Castle. The castle fares quite badly as a consequence as do many of the protagonists. The fate of the meat is sealed and the newly-elected Archbishop of Canterbury Russell Gland says Grace at the ensuing Banquet, or perhaps he utters the Last Rites?",
  "genres": [],
  "author": "MT-B",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/26227089-the-science-of-the-lambs"
}