{
  "title": "The Beatles and their Journey Into Beatledom: The Beatles as Prophets, Peaceniks & Holy Writ - The Fabulosity Of The Foursquare Golem.",
  "description": "From local Liverpool Writer Joe Robinson who has featured on the BBC and ITV (UK) and American Radio; comes a unique Liverpudlian perspective as the author traces The Fab Four's epic Journey into Beatledom via their close-knit Labskausian coterie. A story that is told through their songs which demonstrates The Beatles visionary farsightedness as 'Pop' Prophets of their times. - A Quantum Journey into the Psychedelic void.  Beatledom is a mythic land in which The Beatles are saints, probably prophets and possibly even demi-gods. A land in which John Lennon is a martyr, Paul McCartney a doppelgänger, George Harrison a guru, and Ringo Starr isn't even the best drummer in the band.  Here, tales are told, fables unfurled, myths debunked, and Beatle songs scrutinised for the stories they tell, of their youth, their mental world of transcendent word games and all too worldly gains, the sheer madness of Beatlemania and the sheer magic that held these four young men together whilst the world around them went mad, and in so doing, changed forever, changing them as they changed it.  Were The Beatles part of a brain-washing conspiracy, foisted on a gullible public by the shadowy denizens of a new world order? Had they themselves tapped into a font of hidden knowledge from the psychic realm, translating a subliminal treasure trove of hidden clues in their songs and the pop art artefacts of their ground breaking albums? Did their transcendental message of peace and love delve beyond, into the quantum realm, a universe in itself of strange ideas and even stranger realities.  As a microcosm of the broad based sixties vibe, The Beatles undoubted reflection and shaping of all this, was only possible because of processes going on in the nano-realm of their brainwaves, both receiving and transmitting back the literal oceanic soup of the collective unconscious from their global fan-base, much like the internet is able to do today, with it's algorithmic translation of millions of Google search enquiries into future behavioural trends. The sixties focus on all things Beatles was the Internet of it's day.  Review:  'In Journey into Beatledom: The Fabulosity of the Foursquare Golem, Joe Robinson offers new readings of the Beatles’ words and music through a richly textured sociocultural context. Drawing upon historical, materialist, and political insights, Robinson’s study reframes the Four Lads from Liverpool for new generations of readers. It is a wonderful book based on a remarkable set of ideas.'  Professor Kenneth A. Womack.  Author of the award-winning novel John Doe No. 2 and the Dreamland Motel (2010), also a gold medallist in the Independent Publisher Book Awards for Best Regional Fiction (Mid-Atlantic USA). Author of Reading the Beatles: Cultural Studies, Literary Criticism, and the Fab Four (2006; with Todd F. Davis), Long and Winding Roads: The Evolving Artistry of the Beatles (2007), and The Cambridge Companion to the Beatles (2009), which was named by The Independent (UK) as the 2009 Music Book of the Year.  If you want a paperback version of the book, feel free to message the author directly on Facebook here at https://www.facebook.com/joe.robinson... and he can let you know when the paperback is out on Amazon (Which will be very soon). . Thanks for browsing and keep on Beatleing!! :-)) Joe Robinson, Liverpool, UK.",
  "genres": [
    "Music"
  ],
  "author": "Joe  Robinson",
  "average_rating": "4.90",
  "url": "https://www.goodreads.com/book/show/26223485-the-beatles-and-their-journey-into-beatledom"
}