{
  "title": "A Southern Country Novel Series Books 1-3: Boxed Set: Happy Valley, Mississippi Gambler, Mississippi Bluff",
  "description": "Happy ValleyA year ago, Jo Preston was released and sent home from a mental institution. She has only vague memories of why she had been committed. Circumstances beyond her control will cause those memories to surface, one by one.A tragedy, brought on by deceit, leaves her heartbroken and rejected. She is sent away to live with some rather peculiar relatives. Her fear of being institutionalized again has her desperate to keep her past hidden, but how long can she keep it a secret when her imagination begins playing tricks on her... or is it? A voice from her past resurfaces as well as the man who wants her secret to die with her.This is a story about a young girl's heartbreak, rejection, fear, faith, and determination.Happy Valley is the first in the series of A Southern Country Novel.Mississippi GamblerWhen Jo Preston Lane was nineteen, she left home thinking that was the answer to her problem, but now, four years later, she must return, and who she has to face is the least of her problems. To protect her family, she must keep all that she discovered five months ago a secret. She has little time to prepare for her great escape before her worst nightmare catches up with her. She can’t afford to trust anyone, as her life truly depends on it. Not the police or the FBI.Mississippi Gambler is the second in the series of A Southern Country Novel.Mississippi BluffA Mississippi Bluff is a Texas Hold ’Em poker strategy, seventy-five percent bluffing and twenty-five percent odds. Jo Lane doesn’t gamble on anything but love and her life. In the past, gambling on love has been a no-win for her. However, she’ll have to bluff her way out to win the latest game on her life.With a deranged clown and a contract assassin after her, the odds don’t look good for the young Special Agent Lane. The clown is seeking revenge—but for whom? The contract assassin is desperate to get his hands on something in Jo’s lost airline luggage. The assassin plans to take her out of the picture as soon as he gets his hands on it—but who hired him?Sam Hunter is new in town. He’s looking for his missing young niece, April, and requests Jo’s help in finding her. After much thought, she agrees to try to tap into her God-given ability to locate April. The more she digs into April’s history, the more confused Jo becomes. Something isn’t adding up—but what?Jo’s love life takes a toll on her emotions, leaving her heartbroken. After she’s made up her mind that she’s through with the game of love, a new player sits down at the table, and he’s all in. Is she willing to take the risk and bet it all, or will she fold and walk away?The stakes are high in Mississippi Bluff, the third book in A Southern Country Novel series.",
  "genres": [],
  "author": "Diana   Anderson",
  "average_rating": "4.25",
  "url": "https://www.goodreads.com/book/show/26228488-a-southern-country-novel-series-books-1-3"
}