{
  "title": "Knitlandia: A Knitter Sees the World",
  "description": "Knitting aficionado and notable artisan Clara Parkes delves into her storied travels with this inspiring and witty memoir on a creative life enriched by her adventures around the world.    Building on the success of The Yarn Whisperer, Parkes’s rich personal essays invite readers and devoted crafters on excursions to be savored, from a guide who quickly comes to feel like a trusted confidante. In Knitlandia, she takes readers along on 17 of her most memorable journeys across the globe over the last 15 years, with stories spanning from the fjords of Iceland to a cozy yarn shop in Paris’s 13th arrondissement.   Also known for her PBS television appearances and hugely popular line of small-batch handcrafted yarns, Parkes weaves her personal blend of wisdom and humor into this eloquently down-to-earth guide that is part personal travel narrative and part cultural history, touching the heart of what it means to live creatively. Join Parkes as she ventures to locales both foreign and familiar in chapters like:  Chasing a Legend in TaosGlass, Grass, and the Power of Place: Tacoma, WashingtonA Thing for Socks and a Very Big Plan: Portland, OregonAutumn on the Hudson: The New York Sheep & Wool FestivalCashmere Dreams and British Breeds: A Last-Minute Visit to Edinburgh, Scotland  Fans of travel writing, as well as knitters, crocheters, designers, and fiber artists alike, will enjoy the masterful narrative in these intimate tales from a life well crafted. Whether you’ve committed to exploring your own wanderlust or are an armchair traveler curled up in your coziest slippers, Knitlandia is sure to inspire laughter, tears, and maybe some travel plans of your own.",
  "genres": [
    "Knitting",
    "Nonfiction",
    "Travel",
    "Memoir",
    "Essays",
    "Crafts",
    "Audiobook"
  ],
  "author": "Clara Parkes",
  "average_rating": "3.83",
  "url": "https://www.goodreads.com/book/show/26240620-knitlandia"
}