{
  "title": "The Way It Never Was",
  "description": "Since coming back from Australia, twenty-eight-year old Kate Harrington has been stuck in a dead-end secretarial job she hates with a boss she despises.  To make matters worse, she’s renting out a room in her seaside flat to Claire, someone she never got along with at school, let alone now.  And then there’s her love life.  After two years, she still holds a flame for the enigmatic Joe, her ex-boyfriend, who might have sported a questionable ponytail but who has somehow become more mythical and beautiful as time has gone on.  The problem? He lives about 10,000 miles away and they’ve fallen out of touch.  Everyone around her seems to have their lives together; her brother, Dan, is living the high life and her old friend, and formerly reliable ‘plus one’, Stan, is dating the self-assured Anna.  Kate decides that she’s had enough and quits her job.  When she gets asked by heavily pregnant Liv to help her out at the Globe Café, one of her favourite places, she jumps at the chance.  Maybe she’ll enjoy waitressing despite the grumpy Italian owner and his judgemental wife?  She was good at making cappuccinos in Sydney, so why not in Broadstairs?   Just as Kate thinks she’s found happiness, her life is thrown into confusion, as she discovers that someone close to her has been hiding his true feelings.  Can she face up to everything that happened in the past to move forward with someone new?  The Way It Never Was is a memorable story of old loves and new beginnings.  Praise for Lucy Austin:  ' 'The Way it Never Was' is a charming and heart-warming rom com' - Holly Kinsella, best-selling author of 'Uptown Girl'.  Lucy Austin has worked as a freelance copywriter for the last twelve years, working for businesses and creative agencies around the world. She now lives with her husband and two children on the Kent coast. ‘The Way It Never Was’ is her first novel.  Endeavour Press is the UK's leading independent digital publisher. For more information on our titles please sign up to our newsletter at www.endeavourpress.com. Each week you will receive updates on free and discounted ebooks. Follow us on Twitter: @EndeavourPress and on Facebook via http://on.fb.me/1HweQV7. We are always interested in hearing from our readers. Endeavour Press believes that the future is now.",
  "genres": [],
  "author": "Lucy  Austin",
  "average_rating": "3.23",
  "url": "https://www.goodreads.com/book/show/26239041-the-way-it-never-was"
}