{
  "title": "Patient Zero: Three Years to Live",
  "description": "Follow the true story of a 15-year-old, impoverished, illegal immigrant as she deals with a devastating disease known as Myasthenia Gravis. She grew up in Glasgow, Scotland, where she lived with her two brothers and parents. Disenchanted with failed attempts to make a living, her father moved the family to the United States, with hopes of finding work. Financial ruin, alcoholism and lack of legal status force the family to go back to Great Britain. After selling everything they owned and purchasing plane tickets, Margaret becomes gravely ill, and the move is cancelled. A former gymnast, she quickly and suddenly loses the ability to speak, chew and swallow food, exercise, and ultimately, breathe. She suffers misdiagnoses, multiple hospitalizations, and unnecessary surgery, eventually landing in intensive care and on life support. She undergoes years of treatments, including total body irradiation therapy and chemotherapy. Countless medications fail to alleviate her symptoms, and cause life-threatening side effects. At the same time, she manages to complete high school and go to college. After graduating with a Master’s degree, Margaret was accepted in to a doctoral program, along with her father. Knowing that she was physically weakened and mentally destroyed, her father gives up his job, and joins the doctoral program to support her. While going to school, and still in her twenties, she receives a terminal diagnosis, and told that she has approximately three years to live. Promising never to tell a soul about her prognosis, Margaret continues onwards as best she can. Find out how a unique approach to treatment changed her life forever, as well as the lives of thousands of people living with Myasthenia Gravis. A truly remarkable and inspirational story of survival and resilience.",
  "genres": [
    "Memoir"
  ],
  "author": "Margaret  Kane",
  "average_rating": "4.36",
  "url": "https://www.goodreads.com/book/show/26241119-patient-zero"
}