{
  "title": "Perdita: A Lost Child",
  "description": "Perdita - A Lost Child is an allegory based on the greatest romance of all time. Set in a Medieval setting, our story while written like a fantasy is really a retelling of a story thousands of years old. Some of us are still anticipating its fulfillment today.  The story begins with the Kingdom of Caelestis. The peace and quiet of the realm is interrupted by an attack on the House of the High King and his son. Thus begins the precipitous slide of the world into the cataclysm of apocalyptic destruction.  We see the peoples of the kingdoms choosing sides and the animosity and anger that is generated by the division. This emotional atmosphere becomes even greater as natural and political events themselves take a downturn.  Perdita is separated from her home and family. As a babe it is thought that she is the princess destined to be married to the High King. But the occurrences of her life dispel that hope as she is torn from her mother and home and adopted into a new home and family far from the world she was born into. She has no way to find her way home, and in a frightening world disintegrating around her she has to even flee what safety she had known in her adopted home to try and escape annihilation. Perdita's parents, Paul and Beatrice, are also caught up in the turmoil and destruction tearing the whole world apart. It separates them in their journey towards home and hope, leaving them to struggle in a frightening world to while trying find peace and each other.  Perdita, Beatrice, and Paul are not alone in their struggles. We face with them challenges of traveling in a chaotic world, and the dangers of enemies on every side. In turn they also find encouragement and guidance in the help of kind strangers they meet in their travels. They face hardship and terrifying encounters, but they also learn that they are never alone and that they are always loved wherever their paths take them. www.PerditaALostChild.com",
  "genres": [],
  "author": "Tina Steele Penn",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/26232435-perdita"
}