{
  "title": "Wild, Wicked and Wanton",
  "description": "A Hot Historical Romance Bundle Erotic Romance set in Regency Era America with heroines who are Wild, Wicked and Wanton.She wanted just one naughty carriage ride... Beth McConnell has a secret. Sometimes in the afternoons, she escapes the drudgery of her family's shop and seduces wealthy gentlemen. One encounter is all Beth allows. She must leave them burning. When she boldly seduces Grey Sexton, a powerful shipping magnate, Beth finds his ice-over-fire combination of ironclad self-control and sensual indulgence too tempting to resist. Surely, one or two more clandestine trysts wouldn't hurt? But Grey Sexton demands more. His possessive determination to own her, body and soul, threatens to expose hererotic life. To give into his demands means losing her good name and her place in her brother's home...everything she holds dear. She must turn away, for she knows that a poor girl can never afford to trust her heart to a gentleman. Reader Advisory: Grey's Lady is an erotic / hot historical romance. It contains scenes of frequent, explicit sex andgraphic sexual language. It contains a non-traditional romance plot and an unconventional heroine. White Lace and PromisesNew York Merchant Prince Grey Sexton loves the audacious, spirited young temptress who seduced him in a Philadelphia bookseller’s and made passionate love to him in his carriage. Her fiery nature broke through his cold self-protection. Beth McConnell loves her husband-to-be very much, yet she wonders if she will ever be able to present herself as the respectable lady he needs for his wife. What started out as a secret, tumultuous affair has blossomed into something neither of them can live without. But under the strains created by the differences in their social rank, they begin to have serious doubts about the future. And dark secrets from their past threaten to tear them apart. Can their love prevail?Alex’s AngelErotic Romance ~ Georgian Historical Set in USA ~ Novel Length 100,000+ words In the wake of a devastating epidemic, sheltered Emily Eliot finds herself alone, making her own decisions for the first time. When desperation leads her to sell her virtue, she walks straight into trouble. Enter one gorgeous, golden haired gentleman bent on protecting her. Alexander Dalton came to the Blue Duck Tavern seeking to lose himself in sexual pleasure. But when he saw the delicate and vulnerable young woman, he couldn't turn away. Emily is alarmed by her own intense responses as this charismatic and carnal man introduces her to erotic pleasure. Having lived as a virtual prisoner of her grandmother's suffocating manipulation, Emily bridles under Alex's possessive, protectiveness. And Alex's charming smile hides a dark secret that could destroy their chance at happiness. Emily’s SeductionBook Four in the Wild, Wicked and Wanton SeriesLove is the most seductive sacrifice of all. Before he can share his deepest, darkest secrets with her, he has to show her what seduction truly means.For the first time in a long time, Alex is genuinely happy.",
  "genres": [
    "Historical",
    "Historical Romance",
    "Anthologies",
    "Romance"
  ],
  "author": "Natasha Blackthorne",
  "average_rating": "3.86",
  "url": "https://www.goodreads.com/book/show/26234555-wild-wicked-and-wanton"
}