{
  "title": "Fast Draw",
  "description": "Filled With Memorable Moments That'll Keep You Turning Pages!(*Revised 4/2/22)The amazing Bob Mayes lives a contended life. His fast-draw show thrills the tourists and pays the bills. His loving wife, Ellie, keeps him happy. What more could he ask for? One fateful night, an incident after a show confronts him with an evil so brutal and far-reaching, he realizes he can never return to a simple life again. He sets out to face the evil with the help of a young psychic named Sarah and her grandmother, Rita. A group of brave underground \"white hat\" warriors joins them to battle the Faction, who are hell-bent to rule the earth. In the midst of his heroism, will Bob discover there is more to him than he ever knew? Will his uncanny speed and accuracy be enough against the formidable Faction? Is he, in fact, a Supernatural? Fast Draw is a story of love, betrayal, heroism, and one you will never forget. The main character is based on the real-life fast-draw artist, Bob Munden. - For anyone who enjoys urban fantasy or military scifi/fantasy, Fast Draw might be for you! *Contains strong language, graphic violence, and some sexual situations.Reviews for Fast  \"Its like Louis Lamour and Stephen King came together and wrote this book. I loved it very much and can't wait for the next one.\" - Amazon Customer\"I got so engrossed, I finished it one day. It is riveting . . . Bottom line D.W. Collins has written one great book in Fast One Bullet to Hell.\" - Amazon Customer\" . . . The pacing was excellent and Collins does a good job of it. He spaces the events in the book out perfectly and fills the intervening time with things that make sense, all the while pushing a sense of urgency. \" - Amazon Customer\"This book made me want to stay up late turning pages. Twist and turns surprise ending. Would read anything by this author.\" - Amazon Customer\"The good guys include one of the best characters ever. A geriatric gunfighter named Bob, who shoots faster than the eye can see and never misses.\" - Goodreads user\"Think Stephen King's fire starter only with a world wide reach, maybe a bit like Larry coreia's Grimnoir Chronicles Series, only not quite so concentrated. Anyway, suffice it to say, it's a darned good read, and if you like action, you won't want to miss this one.\" - Goodreads user",
  "genres": [
    "Paranormal"
  ],
  "author": "D.W. Collins",
  "average_rating": "4.08",
  "url": "https://www.goodreads.com/book/show/26235955-fast-draw"
}