{
  "title": "Reclamation",
  "description": "Dear Author,I am a cop newly promoted to detective. I’ve been asked to go undercover as a stripper at a strip club to investigate (kidnappings, drugs, sex trade… I’ll leave that up to you). While working there I meet the man who will become my lover.He is in a law enforcement type job (fireman, FBI, search and rescue, military, take your pick). Is he just there because he likes strip clubs? Is he undercover as well, working a different angle and we get together… in more ways than one?I have to admit striptease movements really get the blood going, but are these pictures of me working out for the job itself, a private viewing, or am I fantasizing about his hands, his mouth, his body?I thought I could handle this assignment, but that was before the bad guys figured out why I was actually there.Photo Description: In the series of GIFs, we see a man from his shoulders down, shirtless, clad only in a pair of sinful denim jeans and moving in a way that makes you think warm and happy thoughts (it’s getting hot in here, whoo!). The still picture, on the other hand, depicts a naked man crouched on the ground, his hands behind his head, in a shower of water against a dark background.This story was written as a part of the M/M Romance Group's \"Love is an Open Road\" event. Group members were asked to write a story prompt inspired by a photo of their choice. Authors of the group selected a photo and prompt that spoke to them and wrote a short story. This story may contain sexually explicit content and is intended for adult readers. It may contain content that is disagreeable or distressing to some readers. The M/M Romance Group strongly recommends that each reader review the General Information section before each story for story tags as well as for content warnings.",
  "genres": [
    "M M Romance",
    "Dystopia",
    "Science Fiction",
    "Romance",
    "Futuristic",
    "Short Stories",
    "M M Science Fiction"
  ],
  "author": "Cari Z.",
  "average_rating": "3.71",
  "url": "https://www.goodreads.com/book/show/26242012-reclamation"
}