{
  "title": "Djinn Rummy",
  "description": "After being tricked into a life time of servitude by a wily Djinn, Alicia still hasn’t learned any lessons. She is as pig headed now as she was one hundred years ago when the beautiful male first stole her away. That’s lucky. Because the beautiful and determined Alicia is going to need every ounce of stubbornness and pride to get through what’s coming. Marriage. Nasaan is pressured to wed another and after tricking her, stealing away her mortal life, showing her a whole new realm of fleshly pleasures and abducting her to the world of Jejhal, Alicia isn’t about to let him get away!  Warning: Contains explicit content and this material is not suitable for anyone below 18 years of age.  Excerpt: She trusted him where she had trusted no one in her previous life. It had been proven to her time and again in the mortal realm that she couldn’t have faith in anyone and that it was best to keep her own desires and wishes at the forefront. Sure, she still threw things at his head from time to time to keep life exciting because there was nothing worse than being in a rut but both of them enjoyed the punishment sessions that came from her carefully calibrated bad behaviors. So what was the problem here? Her eyes drifted to the parchment on the polished surface of the desk but to her chagrin, it was written in high Djinn, the overtly floral and formal language of the upper echelons of Djinn society, something that Alicia hadn’t yet gotten a handle on. There were a few words that she was able to pick out, something about a ceremony? Some form of offer? Perhaps this was what was upsetting him. Maybe a distraction might be just the thing… She plucked the scroll from his hand and tossed it on the end of his desk. He growled at her wordlessly and reached for the ornate parchment again but she forestalled him with a hand on his forearm. His gaze flashed to her and he cocked an eyebrow in arrogant query. Alicia carefully hid an impudent smile. Instead, she slipped from his lap. His muscles bunched in unconscious protest but before he could grab her, she moved to face him and sat on the desk tucking her feet next to his powerful thighs. He stilled.  This is not your average bed time story. For lovers of hot twisted male characters, myth, magic and folklore, this is an adult legend with a twist. This supernatural story is not for the faint-hearted. If you're a fan of paranormal erotic romance and have a thing for dominat males than this one is for you!",
  "genres": [],
  "author": "Stella Inox",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/26242031-djinn-rummy"
}