{
  "title": "Captivate Me",
  "description": "Revenge comes at a price.The Ravage MC is a family . Always has been, always will be.Now it all comes down to this a day of reckoning . After all, now they know the cause of all the turmoil their lives have become. And only one thing is on their vengeance .Unfortunately, sometimes the cost is far greater than one can bear .Survival of the fittest, just got an entirely different meaning.** Please note, this book is told from several different points of view to get the full effect of the story.**Captivate Me is the final book in the Ravage MC series . This series must be read in order. The Ravage MC series is an action packed, suspenseful motorcycle club romance that will have you on the edge of your seat wondering what will happen next. If you like alpha males, bad boy bikers and strong women , you've found the perfect MC series. Ryan is known for her twists and turns and the unexpected, so beware!Come and join the ride with the Ravage MC!—Ravage MC Series reading 1.Ravage Me (Cruz & Princess)2.Seduce Me (GT & Casey)3.Consume Me (Tug & Blaze)4.Inflame Me (Rhys & Tanner)5.Captivate Me (Buzz & Bella – Breaker & Shania)**Ride with Me (co-written with Chelsea Camaron)6.The Ravage MC Novella Collection (Satisfy Me, Rattle Me, Final Ravage MC Epilogue)Ravage MC Bound Series (Second Generation) reading 7.Bound by Family (Cooper & Bristyl)8.Bound by Desire (Deke & Rylie)9.Bound by Vengeance (Ryker & Austyn)10.Bound by Affliction (Green & Leah)11.Bound by Destiny (Emery & Jacks & Micah)12.Bound by Wreckage (Nox & Carsyn)13.Bound by Destruction (Coming Soon)Ravage MC Rebellion Series (Second Generation & New Chapter) reading 14.Connected in Pain (Crow & Rylynn)15.Fueled in Fire (Crow & Rylynn)16.Sealed in Strength (Crow & Rylynn)17.Connected in Code (Wrong Way & Hayden)—Ryan Michele found her passion bringing fictional characters to life. She loves being in an imaginative world where anything is possible. Her knack for the unexpected twists and turns will have you on the edge of your seat with each page. She is best known for her alpha, bad boy bikers and strong, independent heroines in her MC romance books.",
  "genres": [
    "Romance",
    "Audiobook",
    "Contemporary",
    "Dark Romance",
    "Erotica",
    "Adult",
    "Suspense"
  ],
  "author": "Ryan Michele",
  "average_rating": "4.32",
  "url": "https://www.goodreads.com/book/show/26252172-captivate-me"
}