{
  "title": "People Centricity: The Incredible Power of Putting Other People First",
  "description": "“Stephen is the Life guru for our times.” —Mark Price, MD, Deputy Chairman of the John Lewis PartnershipWould you like to haveany — or all — of these?Good health? Financial security? Personal, emotional, and sexual gratification? The enjoyment of the happiness and health of the people who are dear to you? An occupation you find absorbing, fascinating, and lucrative? Agreeable leisure-time activities? A faith you find important, whether religious or secular? An overwhelming sense of positivity in yourself? The feeling that you are a good person and that you generate good outcomes for yourself and for the people you care about and work with? Anything else that makes you feel most happy?If you have all the happiness you can handle, that’s great! Put this book down and move along. If not, then you need to put the power of People Centricity — the life philosophy of making an investment of time and emotional energy to advance the agenda of people with whom you have a mutually beneficial interaction who are outside your immediate close circle — to work in your life.People Centricity is a philosophy to take you through life. It’s all about learning how to understand and share the feelings of other people so as to produce the best mutually beneficial outcome for those other people and for you.From your personal interactions to your business success and beyond, Stephen Hewett will guide you on this life-changing journey, one that will make your bad days good and your good days wonderful.“Stephen’s philosophy of Customer Centricity is at one with my own. Customer Centricity really is the core of business. Stephen is a customer guru of our times”—Mark Price MD, Waitrose & Deputy Chairman of John Lewis Partnership“Stephen certainly practices what he preaches and is one of the few consultants that really listen to what their customer is trying to achieve. He gave us some key insight that helped us to really shape our future strategy”.—Jo Foley Senior Director, Retail Change ASDA“Led by the impressive Stephen Hewett, their laser-like focus on the customer stood them apart in our minds...”—Jack Upton, Director, Training, Education and Customer Services, McDonald’s UK“In essence, what Stephen have helped us do is to allow everyone at Argos to be brilliant with customers.”—Perry Price, Argos Customer Lead",
  "genres": [],
  "author": "Stephen Hewett",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/26253008-people-centricity"
}