{
  "title": "Irrevocably Claimed",
  "description": "ONE FORBIDDEN NIGHT by Sherri HayesJustin has had a crush on his best friend’s little sister, Kim, since high school. When she shows up on his doorstep, offering herself to him for one night, will he be able to say no? Or will he give in to one forbidden night with the woman who has haunted his dreams for years?***THREEPEAT by A.M. ShrumMadison’s best friend, Lillian, is constantly sharing the details of her perfect life with husband, Adam, including her off the charts sex life. It’s great, except that Madison has been harboring a secret fantasy: she doesn’t just want to hear about the great sex that Lillian and Adam are having, she wants to experience it for herself…with them. One night after drinks, the three friends agree to a deal: One night. The three of them. Together. And anything goes. Will a night of heated passion be exactly what they all need? Or will it go too far and destroy everything they have? ***LOVER’S SWEET DISCOVERY by KD JonesClaire Vanderling has reached middle age but doesn’t feel like she has anything to show for it. As the manager of a prosperous art gallery, she works hard, but her personal life is practically nonexistent. Her son, Thomas, has graduated college and is about to start a new IT company in Japan with his best friend. She might not see him for six months, so she arranges for them to have one more trip to a family beach home in the Hamptons. When her son’s best friend shows up, she finds much more than just a simple vacation—she discovers a passion long buried inside her. Jacob Tanner is excited to be starting a new company with his best friend. He wants to go directly to Japan to get settled, but Tom insists that they spend time this summer with Tom’s mother. He met Claire once before while he and Tom were still in school together. When he sees her again, he is surprised to find that he cannot take his eyes off her. How had he not realized how sexy Claire was? As desire flares up and passion is unleashed, will they give in to their bodies’ demands or will they be able to resist lovers’ sweet discovery?***THE ENCOUNTER by Susan WardJena was Holly’s best friend when they started high school. By graduation, Holly avoided Jena at all cost. Their friendship had become confusing, the emotions so complex, and at times unnerving, that Holly couldn’t even risk being near Jena.Seven years later, unhappily married Holly is thrown together with Jena at a bachelorette party. Was forbidden desire beneath their unsettling friendship all along? And will Holly surrender at last to Jena’s pursuit? ***ZEKE’S EDEN by K. WebsterFollowing Daddy’s rules has always been easy. Smile. Nod. Repeat.Until I met Zeke.Dark. Dirty. Sinner. A hungry beast, released from his cage.And I’m on the menu.Tonight, I’m Zeke’s Eden.His sugar.His whore.Daddy’s little girl is all grown up…***COUNTRY METAL by Michael SchneiderSweet as iced tea, her life was the very anthem of a country song. Blue skies, cornfields and cotton fed her soul. Tattooed and pierced, he’s the lead singer for Violent Standard. His idea of country is a trek through Central Park. His band is in town to film their newest music video. Can heavy metal and a country twang blend into a perfect harmony? Will he claim the southern belle before the last note fades? ***HER SECRET SERVICE by Demi DukePresidential candidate’s daughter, Cammie Douglas, needs her wild ways tamed and kept out of the news. So Jude Warner, a tall, dark, and handsome Secret Service agent, is called up for duty. His orders: Control Cammie no matter what it takes… Even if she’s drawing him into her sexual thrall. Will he risk it all for her? Or have to tame his own desires? *** DREAM WEAVER by Cherry ShephardWhen Charlotte is caught by one of her college students in a moment of pleasure, she awakens the Dream Weaver . . . the Master . . . her Dom. Can he revive her confidence and prove to her just how desirable she is?*** TEMPTING TANNER by Lori KingAshley Gahl lost her virginity in a whirlwind of passion after a night of celebration, and Tanner Lake has haunted her dreams ever since. One-night flings aren’t suitable for relationships, so she’s determined to pretend it never happened, only he reappears in her life, and throws her carefully laid out plans into disarray. When he becomes a permanent fixture in her world as her new stepbrother, she knows she should put their passionate past behind her, but she finds herself craving him more and more. Is she really ready for the whirlwind that Tempting Tanner with bring?",
  "genres": [
    "Anthologies",
    "Romance",
    "Erotica",
    "BDSM"
  ],
  "author": "Angela M. Shrum",
  "average_rating": "4.12",
  "url": "https://www.goodreads.com/book/show/26252197-irrevocably-claimed"
}