{
  "title": "The Highest Glass Ceiling: Women’s Quest for the American Presidency",
  "description": "In The Highest Glass Ceiling, best-selling historian Ellen Fitzpatrick tells the story of three remarkable women who set their sights on the American presidency. Victoria Woodhull (1872), Margaret Chase Smith (1964), and Shirley Chisholm (1972) each challenged persistent barriers confronted by women presidential candidates. Their quest illuminates today s political landscape, showing that Hillary Clinton s 2016 campaign belongs to a much longer, arduous, and dramatic journey.The tale begins during Reconstruction when the radical Woodhull became the first woman to seek the presidency. Although women could not yet vote, Woodhull boldly staked her claim to the White House, believing she might thereby advance women s equality. Republican Senator Margaret Chase Smith came into political office through the widow s mandate. Among the most admired women in public life when she launched her 1964 campaign, she soon confronted prejudice that she was too old (at 66) and too female to be a creditable presidential candidate. She nonetheless became the first woman to have her name placed in nomination for President by a major party. Democratic Congresswoman Shirley Chisholm ignored what some openly described as the twin disqualifications of race and gender in her spirited 1972 presidential campaign. She ran all the way to the Democratic convention, inspiring diverse followers and angering opponents, including members of the Nixon administration who sought to derail her candidacy.As The Highest Glass Ceiling reveals, women s pursuit of the Oval Office, then and now, has involved myriad forms of influence, opposition, and intrigue.\"",
  "genres": [
    "History",
    "Politics",
    "Nonfiction",
    "Feminism",
    "Audiobook",
    "American History",
    "Womens"
  ],
  "author": "Ellen Fitzpatrick",
  "average_rating": "3.72",
  "url": "https://www.goodreads.com/book/show/26264756-the-highest-glass-ceiling"
}