{
  "title": "New Approaches to Gone With the Wind",
  "description": "Since its publication in 1936, Gone with the Wind has held a unique position in American cultural memory, both for its particular vision of the American South in the age of the Civil War and for its often controversial portrayals of race, gender, and class. New Approaches to \"Gone with the Wind\" offers neither apology nor rehabilitation for the novel and its Oscar-winning film adaptation. Instead, the nine essays provide distinct, compelling insights that challenge and complicate conventional associations.Racial and sexual identity form a cornerstone of the collection: Mark C. Jerng and Charlene Regester each examine Margaret Mitchell's reframing of traditional racial identities and the impact on audience sympathy and engagement. Jessica Sims mines Mitchell's depiction of childbirth for what it reveals about changing ideas of femininity in a postplantation economy, while Deborah Barker explores transgressive sexuality in the film version by comparing it to the depiction of rape in D. W. Griffith's earlier silent classic, Birth of a Nation.Other essays position the novel and film within the context of their legacy and their relevance for national and international audiences. Amy Clukey and James Crank inspect the reception of Gone with the Wind by Irish critics and gay communities, respectively. Daniel Cross Turner, Keaghan Turner, and Rich Richardson consider its aesthetic impact and mythology, and the ways that contemporary writers and artists, such as Natasha Trethewey and Kara Walker, have engaged with the work. Finally, Helen Taylor sums up the pervading influence that Gone with the Wind continues to exert on audiences in both America and Britain.Through an emphasis on intertextuality, sexuality, and questions of audience and identity, these essayists deepen the ongoing conversation about the cultural impact and influence of this monumental work. Flawed in many ways yet successful beyond its time, Gone with the Wind remains a touchstone in southern studies.\"",
  "genres": [],
  "author": "James A. Crank",
  "average_rating": "3.40",
  "url": "https://www.goodreads.com/book/show/26266802-new-approaches-to-gone-with-the-wind"
}