{
  "title": "The Incredible Origins of the Onyx Sun",
  "description": "The Incredible Origins of the Onyx Sun is an award-winning space adventure for young adults that has earned the acclaim of Publisher's Weekly, Writer's Digest, Amazon.com, and kids and parents everywhere.The book follows Zack Goodspeed, a perfectly normal 11-year old boy, who discovers his eccentric grandfather has invented a source of unlimited power, called the Onyx Sun and harnessed that power to fuel a spaceship. Stowing away on the ship with his mischievous neighbor Angelina \"Max\" Maximillian, Zack is thrust into a journey that strands him on the Moon, introduces him to bold new friends, and pits him against Dr. Machvel, a rouge member of crew bent on turning the Onyx Sun into a weapon of mass destruction.Through an imaginative storyline, the book immerses children in the possibilities they will one-day face to improve humanity through invention and technological exploration. It is a scintillating, roller-coaster ride of a story that helps kids also understand the nature of friendships, conflict, and personal growth. Publisher's Weekly applauds the book, saying \"This space adventure yarn has the right stuff. The fast-paced novel keeps the reader engaged throughout. The main characters are nicely done, the plot is exciting, and there’s a clear jumping off point for a sequel, which young sci-fi fans would surely look forward to.\"This debut novel by Christopher Mahoney has also won an honorable mention in the 17th Annual Writer's Digest Self-Published Book Awards and reached the semifinals of the 2010 Amazon Breakthrough Novel Awards.An engaging book for young readers as well as the rest of the family, The Incredible Origins of the Onyx Sun inspires all of us with visions of what life could be like as humanity spreads into the stars. More information and online secure order form at http://www.onyxsun.com.",
  "genres": [
    "Science Fiction",
    "Young Adult",
    "Fiction",
    "Childrens",
    "Fantasy"
  ],
  "author": "Christopher Mahoney",
  "average_rating": "3.74",
  "url": "https://www.goodreads.com/book/show/2627131-the-incredible-origins-of-the-onyx-sun"
}