{
  "title": "The Brothers Sinister: The Complete Boxed Set #.5-4.5",
  "description": "This is the complete boxed set of Courtney Milan’s acclaimed Brothers Sinister Series – four full length books, three novellas – together, almost half a million words. The Governess AffairMiss Serena Barton intends to hold the petty, selfish duke who had her sacked responsible for his crimes. But the man who handles all the duke's dirty business has been ordered to get rid of her by fair means or foul. She’ll have to prove more than his match… The Duchess War The last time Minerva Lane she was the center of attention, it ended badly—so badly that she changed her name to escape her scandalous past. So when a handsome duke comes to town, the last thing she wants is his attention. But that is precisely what she gets... A Kiss for MidwinterMiss Lydia Charingford does her best to forget the dark secret that nearly ruined her life, hiding it beneath her smiles. But someone else knows the truth of those dark days: the sarcastic Doctor Jonas Grantham. She wants nothing to do with him...or the butterflies that take flight in her stomach every time he looks her way... The Heiress EffectMiss Jane Fairfield does everything wrong in society--intentionally. Mr. Oliver Marshall does everything right. So why is it, then, that the one woman he can't forget is the exact opposite of what he needs? The Countess Conspiracy Sebastian Malheur is the most dangerous sort of rake. Violet Waterfield, the widowed Countess of Cambury, on the other hand, is entirely respectable--and she’d like to stay that way. Their association would be scandalous even if someone suspected lies. But the truth about the secrets they share will bring England to its knees… The Suffragette ScandalA suffragette meets a scoundrel, and as scoundrels do, he lies to her, attempts to blackmail her…and falls in love with her against his better judgment. By the time he realizes that his cynical heart is hers, it's too late. Once the woman he loves realizes how much he's lied to her, he'll lose her forever. Talk Sweetly to MeMiss Rose Sweetly is a shy, mathematically-minded shopkeeper’s daughter who dreams of the stars. When Stephen Shaughnessy, infamous advice columnist and known rake, moves next door, she knows she should avoid him. But you know what they say about the best-laid plans of mice and astronomers…",
  "genres": [
    "Romance",
    "Historical Romance",
    "Historical",
    "Historical Fiction",
    "Fiction",
    "M F Romance",
    "Victorian"
  ],
  "author": "Courtney Milan",
  "average_rating": "4.36",
  "url": "https://www.goodreads.com/book/show/26260740-the-brothers-sinister"
}