{
  "title": "The Power Broker",
  "description": "Exposing high-level governmental corruption, conspiracy, and murder has garnered plenty of attention for Christian Gillette, the young dynamo chairman of the famous New York private equity firm Everest Capital. Now the reputation he has built taking Everest to the top has been noticed beyond the boardrooms of high finance–by powerful people with potentially devastating agendas.Christian’s own attention is on Las Vegas, where he means to stake out a piece of the action by opening a new casino and launching an NFL franchise. But Sin City didn’t get its nickname for nothing, and the mob soon makes it clear that Christian’s company will have to pay if it wants to play in the nation’s gaming capital. Christian has already taken on corporate pirates and cold-blooded assassins and lived to tell about it, but crossing the underworld could do more than just kill his brilliant career. It could crush his chance to fulfill his late father’s political legacy.Dynamic U.S. senator Jesse Ford is the odds-on favorite to make history as the first black president. And the man he wants beside him in the red-hot race for the White House is Christian Gillette. But Samuel Hewitt, a Texas mogul with billions to burn, has another fate in mind for Christian: to be part of a shadow organization, powered by wealth and bound by dark secrets that has manipulated the course of American history for generations.As the pieces of Hewitt’s plot fall into place, and a twisted chain of intrigue, treachery, blackmail, and death gets tighter and tighter, Christian realizes–maybe too late–that in a grudge match between kingmakers hell-bent on victory at all costs, he may be the last pawn sacrificed.With The Power Broker, bestselling author Stephen Frey unleashes an ever-accelerating thriller that breaks the suspense barrier–and never stops.From the Hardcover edition.",
  "genres": [
    "Fiction",
    "Thriller",
    "Mystery",
    "Audiobook",
    "Suspense",
    "Mystery Thriller",
    "Business"
  ],
  "author": "Stephen W. Frey",
  "average_rating": "3.78",
  "url": "https://www.goodreads.com/book/show/26284.The_Power_Broker"
}