{
  "title": "Flawless Mistake",
  "description": "A Prequel Novella – The Spencer & Sione Series She made a mistake with a devious stranger. Spencer Edwards is used to fighting to get ahead in a world that has given her few chances. Just when she thinks she's turned a corner, another setback gives her no choice but to manipulate and deceive. One fateful afternoon, when her guilt can no longer bear the weight of her lies, Spencer meets Ben Chang, a charismatic stranger who appears to be the perfect mark for her charming deceit. But, Ben's magnetic presence and genuine affection captivate Spencer, threatening her plans to swindle him and her vow to never fall in love. Desperate to save herself from certain heartbreak, Spencer makes a disastrous mistake, awakening a dangerous side of Ben that could cost her everything. He made a mistake with a familiar enemy. Sione Tuiali’i is used to fighting to keep his violent past from threatening his new life as the owner of an exclusive resort in Belize. Just when he thinks he's exorcized the demons that tormented him, a suspicious incident forces him to contend with the violence that influenced his former life. After a fateful encounter with a pretty stranger, Sione finds out Ben Chang, a cunning adversary from his past, orchestrated the random hookup. The hostility behind Ben’s sneak attack enrages Sione, threatening to reignite the feud that began between them years ago. Determined to defeat his bitter enemy, Sione makes a life-altering mistake and learns that the truth behind Ben’s secret agenda could cost him everything. Some mistakes are worth making. Though Spencer and Sione are miles apart, they are closer than they realize, connected by a dangerous foe who has them in his crosshairs. They have too much to lose and just as much to gain, but only if they can figure out that some mistakes are so perfect, they're flawless.",
  "genres": [
    "Romance"
  ],
  "author": "Rachel  Woods",
  "average_rating": "3.77",
  "url": "https://www.goodreads.com/book/show/26310702-flawless-mistake"
}