{
  "title": "Audrey Hepburn's Neck",
  "description": "Offering a unique perspective and unusual insight into modern Japan and its wartime past, Audrey Hepburn's Neck is also a shrewd study of cross-cultural obsessions, and of erotic, romantic, and familial love.The American author Alan Brown crosses both racial and cultural lines to tell his story through the eyes of a young, handsome Japanese cartoonist, Toshiyuki (\"Toshi\") Okamoto, who traces his strong attraction to Western women back to his ninth birthday, when his mother took him to see Audrey Hepburn in the movie Roman Holiday .Leaving behind a sad, silent childhood—which was spent living in two rooms above the family noodle shop on an isolated peninsula in the far north of Japan—Toshi moves to Tokyo to pursue his career. There he falls under the spell of three his best friend and confidante, the generous and extroverted Paul, a gay advertising copywriter who has plenty of his romantic mishaps with Japanese men; Jane, his glamorous but emotionally unstable teacher at the Very Romantic English Academy, with whom Toshi has a hazardous sexual affair; and, finally, the lovely and talented composer, Lucy, with whom Toshi falls in love.The novel deftly moves back and forth between present and past, as Toshi explores his unhappy childhood, the reasons behind his mother's unexplained abandonment when he was eight years old, and her move to a seaside inn across the peninsula. As the novel draws to a close, tragic events, both public and personal, bring past and present together, revealing the painful truth of Toshi's parents' lives during World War II, and a secret in Toshi's own past that, in the end, gives him the strength and knowledge to confront the future.",
  "genres": [
    "Fiction",
    "Japan",
    "Japanese Literature",
    "Novels",
    "Literature",
    "Contemporary",
    "War"
  ],
  "author": "Alan Brown",
  "average_rating": "3.49",
  "url": "https://www.goodreads.com/book/show/262804.Audrey_Hepburn_s_Neck"
}