{
  "title": "Kiss the Bride: Three Summer Love Stories",
  "description": "Meet the people who make it all happen—the planners, the photographers, the musicians who have helped orchestrate the perfect day for countless couples—as they find their own happy endings in the second Year of Weddings novella collection.\nPicture Perfect Love: A June Wedding Story\n by Melissa McCloneWhen image becomes everything, it’s up to love to refocus the heart.Photographer Jenna Harrison wants every bride and groom to look picture perfect on their special day. But her own heart is still broken, the unworn wedding dress hanging in her closet a reminder that relationships aren’t always as perfect as they look through her camera lens.Attorney Ashton Vance is the one that got away, but he wrongly blamed Jenna for ruining his political aspirations. Even if Jenna can forgive him, dare he hope for a second chance at her love?\nI Hope You Dance: A July Wedding Story\n by Robin Lee HatcherCan two left feet lead to one perfect romance?Grant Nichols is a genius in the kitchen and a klutz on the dance floor. But his friend’s wedding is shaping up to be a shindig the likes of which Kings Meadow has never seen—including dancing. Lots of dancing.Former rodeo queen Skye Foster is offering dance lessons for the wedding party. Grant and Skye are no match on paper. But when they step onto the dance floor, they create a melody all their own.\nLove on a Deadline: An August Wedding Story\n by Kathryn SpringerMacKenzie “Mac” Davis returns to her hometown of Red Leaf, Wisconsin, and takes a job at the weekly newspaper writing about social events.When Hollis Channing, Mac’s high school nemesis, returns to Red Leaf to marry her celebrity fiancé, the editor asks Mac to cover all the festivities for the newspaper. The last thing Mac wants to do is reconnect with the person who made her life miserable when she was a teenager . . . unless it’s spending time with Ethan Channing, the bride’s older brother—and Mac’s first crush.",
  "genres": [
    "Romance",
    "Christian Fiction",
    "Contemporary",
    "Christian",
    "Fiction",
    "Audiobook",
    "Novella"
  ],
  "author": "Robin Lee Hatcher",
  "average_rating": "3.97",
  "url": "https://www.goodreads.com/book/show/26309261-kiss-the-bride"
}