{
  "title": "Angelica",
  "description": "Family is many things to many people but in one woman’s world family means Respect Honor Loyalty These words are the meaning to life in her world. When these words are not followed there is only one other word that you must know Revenge For Angelica it is the only word that has held any meaning in her life for ten years. Taught at an early age that disloyalty equals death and that blood is to be answered with blood she seeks vengeance for the deaths of those she loved. Always alone she has been careful to stay free of emotional ties until her life takes an unexpected turn. Unfortunately like everything in her life it has consequences. Consequences that can only be answered with blood. As her past and future collide together Angelica must face her past once and for all if she has any chance at a future and happiness that she never dared hope for. She must do it quickly before she sinks further into the darkness and becomes the very thing that she hunts. excerpt: At the age of ten I was my daddy’s little princess and my mommy’s little angel. I was kept in my tower like any other princess. My mommy was the most beautiful woman in the world. She was so beautiful that many people called her Helen of Troy, and though our coloring was different, everyone said I was just as beautiful. When Mommy chose Daddy, the other men she hadn’t chosen were very angry, though they hid it and waited. My parents were worried that someone would steal me, so I lived in my tower, only allowed to be seen by my family. When I was ten my mommy became pregnant with my brother, and we were sent away to be safe. When I was ten my daddy and my mommy died and I was forced to run and hide. When I was eleven he found me. When I was twelve he found me. When I was thirteen he found me. When I was fourteen he found me. When I was fifteen he found me. When I was sixteen he found me and told me that I would be his princess. When I was seventeen he found me and told me that I was to remain a virgin. When I was eighteen he found me and told me that I was to be his virgin princess bride. When I was nineteen he found me. As I escaped again he yelled to me that if I ever allowed any to touch me, he would kill them, and the pain I suffered now would be nothing compared to what I would suffer for the rest of my life. His threats scared me then no more than they had when I was eleven. The hurt he did to me I refused to show. The numbness of my existence let me block it out. The problem was, when I turned twenty I did something I had never done before. I allowed someone to become my friend.",
  "genres": [
    "Dark",
    "Mafia Romance",
    "Romance",
    "Abuse",
    "Action",
    "Contemporary Romance",
    "Dark Romance"
  ],
  "author": "Angelique Jones",
  "average_rating": "4.11",
  "url": "https://www.goodreads.com/book/show/26284367-angelica"
}