{
  "title": "Memoirs of Leonora Christina, Daughter of Christian IV. Of Denmark: Written During Her Imprisonment in the Blue Tower at Copenhagen, 1663 1685",
  "description": "Excerpt from Memoirs of Leonora Christina, Daughter of Christian IV. Of Denmark: Written During Her Imprisonment in the Blue Tower at Copenhagen, 1663 1685 In placing the present translation of Leonora Christina Ulfeldt's Memoirs before the English reading public, a few words are due from the Publishers, in order to explain the relation between this edition and those which have been brought out in Denmark and in Germany. The original autograph manuscript of Leonora Christina's record of her sufferings in her prison, written between the years 1674 and 1685, belongs to her descendant the Austrian Count Joh. Waldstein, and it was discovered only a few years ago. It was then, at the desire of Count Waldstein, brought to Copenhagen by the Danish Minister at Vienna, M. Falbe, in order that its authenticity might be thoroughly verified by comparison with documents preserved in the Danish archives and libraries, and known to be in the hand-writing of the illustrious authoress. About the Publisher Forgotten Books publishes hundreds of thousands of rare and classic books. Find more at www.forgottenbooks.com This book is a reproduction of an important historical work. Forgotten Books uses state-of-the-art technology to digitally reconstruct the work, preserving the original format whilst repairing imperfections present in the aged copy. In rare cases, an imperfection in the original, such as a blemish or missing page, may be replicated in our edition. We do, however, repair the vast majority of imperfections successfully; any imperfections that remain are intentionally left to preserve the state of such historical works.",
  "genres": [
    "Classics",
    "History",
    "Nonfiction",
    "17th Century",
    "Biography",
    "Danish",
    "Scandinavian Literature"
  ],
  "author": "Leonora Christina",
  "average_rating": "3.40",
  "url": "https://www.goodreads.com/book/show/26318719-memoirs-of-leonora-christina-daughter-of-christian-iv-of-denmark"
}