{
  "title": "The Pixar Touch: The Making of a Company",
  "description": "Magia Pixar este cronica plină de viaţă a istoriei şi evoluţiei companiei Pixar Animation Studios şi a „găştii de tocilari” care au înfiinţat-o. Cu ajutorul geniului animaţiei John Lasseter şi a vizionarului om de afaceri Steve Jobs, Pixar a devenit standardul absolut în producţia de filme animate, începând cu proiectele de efecte speciale realizate la Lucasfilm la începutul anilor 1980, până la filmele de referinţă precum Toy Story, Finding Nemo, WALL-E sau Ratatouille.David A. Price intră în culisele primilor ani cu mici reuşite obţinute cu greu şi ale disputelor de mai târziu dintre Lasseter şi cel pe care îl admirase odinioară atât de mult, Jeffrey Katzenberg, dar şi ale celor dintre Jobs şi Michael Eisner. Nu în cele din urmă, Price analizează și relaţia complexă dintre Pixar şi Walt Disney Company, finalizată cu achiziția studioului de animație, preluat de către Disney, contra fabuloasei sume de 7,4 miliarde de dolari.„Price, un reporter aspru şi nesentimental, scoate la lumină diverse drame de culise din surse noi, urzind o poveste reală, demnă de toată lauda.” Entertainment Weekly„Detalii inedite referitoare la procedeele interne ale companiei recunoscute pentru reticenţa în dezvăluiri făcute presei; o poveste bogată în lecţii atât pentru oamenii de afaceri, cât şi pentru pasionații de filme de animație.” The Wall Street Journal„O poveste de pomină, iar David Price este cel care a reuşit în sfârşit să o spună aşa cum trebuie, cu toate detaliile şi personajele implicate în acest demers. Aceasta este istoria de referinţă a studiourilor Pixar.” Alvy Ray Smith, cofondator Pixar„Am citit o mulţime de istorii ale organizaţiilor de-a lungul anilor, în special poveşti despre succesul sau eşecul unor afaceri inovatoare, dar Magia Pixar este una dintre cele mai reuşite cărți de acest gen.” Robert Sutton, profesor de ştiinţa şi ingineria managementului la Stanford School of EngineeringCartea conține un capitol inedit despre rolul lui Steve Jobs în reușita PIXAR.",
  "genres": [
    "Nonfiction",
    "Business",
    "Biography",
    "History",
    "Audiobook",
    "Film",
    "Technology"
  ],
  "author": "David A.  Price",
  "average_rating": "3.95",
  "url": "https://www.goodreads.com/book/show/2632830-the-pixar-touch"
}