{
  "title": "Colossus Trilogy: Colossus/Fall of Colossus/Colossus and the Crab",
  "description": "25th Anniversary Omnibus EditionFor the first time ever, Colossus: The Boxsetcollects D F Jones’ bestselling trilogy of technothrillers.‘A whip-cracker…’ – Chicago TribuneColossus: The Boxset includes:ColossusMan has lost control...Charles Forbin has dedicated the last ten years of his life to the construction of his own supercomputer, Colossus, the United States’ very first Artificially Intelligent defence system.Colossus is a supercomputer capable of in-taking and analyzing data rapidly, allowing it to make real time decisions about the nation’s defense.But Colossus soon exceeds even Forbin’s calculated expectations, learning to think independently, processing data hundreds of times faster than Forbin had ever thought possible…And when the Russian equivalent announces itself and the two supercomputers face off with the might of each superpower at their control, the entire world is thrown into a chaotic maelstrom that may end in World War Three.Having handed over total control of American defence missiles to Colossus, the President and Forbin must act quickly to shut down the unstable machine.But will Forbin be able to take down the machine he’s spent ten years building?Or will Colossus cause real damage before it’s too late?The Fall of ColossusIn the thrilling sequel, Colossus’ power is still expanding beyond belief and beyond Forbin’s control.No longer is Colossus content managing the world’s military might – now it undertakes surveillance and strict authoritarian rule over its entire populace.The world as we know it may be at an end…But soon, Forbin will receive a message that changes everything … a message from another planet: Mars.Now the enduring scientist must decide which threat is greatest: that of Colossus, his unwieldy supercomputer, or the Martians, with the power to destroy it, and potentially all of mankind in the process…Colossus and the CrabThe 22nd Century. Forbin has but one chance to save the world, for once and for all – or to be its doom.Having calling upon invaders from Mars to destroy the supercomputer Colossus, Forbin now finds himself negotiating for Earth’s very existence.The Martians want compensation.Compensation in the form of Earth’s greatest resource: oxygen.Will he give in to their demands? Or will Forbin find another way to halt the Martian threat?There is only one solution: Colossus must return.But will Forbin be able to reactivate his creation in time, or will Earth be finally and irrevocably left to its fate?Find out in this thrilling conclusion to D F Jones’ bestselling trilogy.",
  "genres": [],
  "author": "D.F.    Jones",
  "average_rating": "4.08",
  "url": "https://www.goodreads.com/book/show/2632810-colossus-trilogy"
}