{
  "title": "Destructive Emotions: A Scientific Dialogue with the Dalai Lama",
  "description": "*Why do seemingly rational, intelligent people commit acts of cruelty and violence?*What are the root causes of destructive behavior?*How can we control the emotions that drive these impulses?*Can we learn to live at peace with ourselves and others?Imagine sitting with the Dalai Lama in his private meeting room with a small group of world-class scientists and philosophers. The talk is lively and fascinating as these leading minds grapple with age-old questions of compelling contemporary urgency. Daniel Goleman, the internationally bestselling author of Emotional Intelligence , provides the illuminating commentary—and reports on the breakthrough research this historic gathering inspired.Destructive EmotionsBuddhist philosophy tells us that all personal unhappiness and interpersonal conflict lie in the “three poisons”: craving, anger, and delusion. It also provides antidotes of astonishing psychological sophistication--which are now being confirmed by modern neuroscience. With new high-tech devices, scientists can peer inside the brain centers that calm the inner storms of rage and fear. They also can demonstrate that awareness-training strategies such as meditation strengthen emotional stability—and greatly enhance our positive moods.The distinguished panel members report these recent findings and debate an exhilarating range of other What role do destructive emotions play in human evolution? Are they “hardwired” in our bodies? Are they universal, or does culture determine how we feel? How can we nurture the compassion that is also our birthright? We learn how practices that reduce negativity have also been shown to bolster the immune system. Here, too, is an enlightened proposal for a school-based program of social and emotional learning that can help our children increase self-awareness, manage their anger, and become more empathetic.Throughout, these provocative ideas are brought to life by the play of personalities, by the Dalai Lama’s probing questions, and by his surprising sense of humor. Although there are no easy answers, the dialogues, which are part of a series sponsored by the Mind and Life Institute, chart an ultimately hopeful course. They are sure to spark discussion among educators, religious and political leaders, parents—and all people who seek peace for themselves and the world.The Mind and Life Institute sponsors cross-cultural dialogues that bring together the Dalai Lama and other Buddhist scholars with Western scientists and philosophers. Mind and Life VIII , on which this book is based, took place in Dharamsala, India, in March 2000.",
  "genres": [
    "Psychology",
    "Nonfiction",
    "Buddhism",
    "Philosophy",
    "Self Help",
    "Spirituality",
    "Science"
  ],
  "author": "Daniel Goleman",
  "average_rating": "4.11",
  "url": "https://www.goodreads.com/book/show/26332.Destructive_Emotions"
}