{
  "title": "The American regional mystery",
  "description": "Penzler Pick, February 2001: More than 30 years ago, Marvin Lachman began writing a series of articles for a now defunct mystery fan magazine (fanzine, to the informed), The Mystery Reader's Newsletter. The subject was regional mysteries, which previously had not been written about. When that pioneering newsletter folded, it was picked up by the greatest of all mystery fanzines, The Armchair Detective, under the impressive editorship of Allen J. Hubin. The series required 14 installments, running from February 1970 to October 1977. The impetus for a subject that at first flush appeared somewhat arcane was the realization that the mystery genre had undergone a major transformation after World War II. While fully 50 percent of all American mysteries had traditionally been set either in New York or California, authors had begun to discover new locales in which to set their tales. Equally important, or perhaps of even greater significance, it no longer seemed sufficient merely to mention that a story was set in, say, Boston. Writers began to fill out the description of their locales to bring a greater sense of place and ambience, moving the genre away from mere puzzles to fully developed novels. While occasional stories from earlier times did evoke a place and time (no better examples come to mind than Melville Davisson Post's Uncle Abner stories or O. Henry's marvelous tales of turn-of-the-century New York), it is Raymond Chandler who receives credit for making locale an integral element of a story. His Southern California is more real to most Americans than the actual place ever could have been. Is this really a big deal, you might ask. The answer is yes. Mystery novels, not unlike mainstream novels, made a point of becoming more realistic, so various locales no longer served as a convenient setting for a murder in a vicar's garden, but as a real place filled with people of varying socioeconomic and ethnic backgrounds who spoke, dressed, and behaved according to the region in which they lived. From these mystery novels, historians and sociologists of the next century will probably be able to have a more accurate view of life in these 50 United States than could be gleaned from the history and sociology texts of our time, with all the biases and agendas toted around by their authors. The American Regional Mystery is more than a compilation of those 14 very learned and surprisingly comprehensive articles. The past quarter-century has seen a greatly heightened level of regional writing, and the entire project had to be dramatically researched, rethought and rewritten. And what a job Lachman has done. One can only imagine the amount of reading and note-taking he needed to put together this superb tome of more than 500 densely packed pages. If you have any interest whatever in mystery fiction beyond the element of puzzle-solving, this should be a book for your reference shelf. --Otto Penzler",
  "genres": [],
  "author": "Marvin Lachman",
  "average_rating": "0.00",
  "url": "https://www.goodreads.com/book/show/2633300-the-american-regional-mystery"
}