{
  "title": "Patient H.M.: A Story of Memory, Madness, and Family Secrets",
  "description": "For readers of The Immortal Life of Henrietta Lacks and The Hare with Amber Eyes comes a propulsive, haunting journey into the secret history of brain science by Luke Dittrich, whose grandfather performed the surgery that created the most studied human research subject of all time: the amnesic known as Patient H.M. In the late 1930s, in asylums and hospitals across America, a group of renowned neurosurgeons embarked on a campaign to develop and refine a new class of brain operation—the lobotomy—that they hoped would eradicate everything from schizophrenia to homosexuality. These \"psychosurgeons,\" as they called themselves, occupied a gray zone between medical research and medical practice, and ended up subjecting untold numbers of people to the types of surgical experiments once limited to chimpanzees. The most important test subject to emerge from this largely untold chapter in American history was a twenty-seven-year-old factory worker named Henry Molaison. In 1953, Henry—who suffered from severe epilepsy—received a radical new version of the lobotomy, one that targeted the most mysterious structures in the brain. The operation failed to eliminate Henry's seizures, but it did have an unintended effect: Henry left the operating room profoundly amnesic, unable to create new long-term memories. Over the next sixty years, Patient H.M., as Henry was known, became the most studied individual in the history of neuroscience, a human guinea pig who would teach us much of what we know about memory today. Luke Dittrich uses the case of Patient H.M. as a starting point for a kaleidoscopic journey, one that moves from the first recorded brain surgeries in ancient Egypt to the cutting-edge laboratories of MIT. He takes readers inside the old asylums and operating theaters where psychosurgeons conducted their human experiments, and behind the scenes of a bitter custody battle over the ownership of the most important brain in the world. Throughout, Dittrich delves into the enduring mysteries of the mind while exposing troubling stories of just how far we've gone in our pursuit of knowledge.  It is also, at times, a deeply personal journey. Dittrich's grandfather was the brilliant, morally complex surgeon who operated on Molaison—and thousands of other patients. The author's investigation into the dark roots of modern memory science ultimately forces him to confront unsettling secrets in his own family history, and to reveal the tragedy that fueled his grandfather's relentless experimentation—experimentation that would revolutionize our understanding of ourselves. Patient H.M. combines the best of biography, memoir, and science journalism to create a haunting, endlessly fascinating story, one that reveals the wondrous and devastating things that can happen when hubris, ambition, and human imperfection collide.",
  "genres": [
    "Nonfiction",
    "Science",
    "Psychology",
    "History",
    "Medicine",
    "Biography",
    "Medical"
  ],
  "author": "Luke Dittrich",
  "average_rating": "3.85",
  "url": "https://www.goodreads.com/book/show/26367014-patient-h-m"
}