{
  "title": "The Trench",
  "description": "Munif sets this second volume of his critically acclaimed Cities of Salt trilogy in a Middle Eastern kingdom during the 1950s.The American ``liberation'' of Kuwait adds unexpected timeliness to the second volume of Munif's stately, satirical Cities of Salt trilogy (1987), which picks up the story of the Middle Eastern sultanate of Mooran in the 1950's, as the corrupting effects of oil, greed, and American values reach epidemic proportions. Munif cannily keeps both oil and Americans offstage, focusing instead on the petty conflicts and intrigues swirling through the reign of Sultan Khazael, and especially on the incessant plotting of Machiavellian Dr. Subhi Mahmilji, the young sultan's chief advisor, who has the authority to establish and direct Hammad al-Mutawa as head of the secret police--but whose power is subtly challenged by his wife Widad, who dreams of every man in the sultanate but him; by his assistant Muhammed Eid, who wants to marry his golden-haired daughter Salma; by his son Ghazwan, whose trip to the US infects him with the decline of the West; and by innumerable rivals in and out of court. Mooran's inexorable slide toward capitalism (Munif's title refers both to shifting seismic foundations and to holes people can fall into) is presented in tiny, apparently inconsequential episodes, from business deals--an automobile franchise provides a particularly riotous interlude--to family quarrels; and Munif, who seems to love his scheming principals as much as Jean Renoir loved his doomed aristocrats in Rules of the Game, stays so close to their plans, fears, and desires that their tragic absurdity remains hidden for a long time--until the inevitable peremptory reaction against the sultan's regime. Munif's satire, in fact, may be entirely too subtle for American readers. But this sly, patient dissection of a sultanate grown too rich for its own survival makes it clear why the author lost his own Saudi citizenship.",
  "genres": [
    "Fiction",
    "Novels",
    "Literature",
    "Historical Fiction",
    "Classics",
    "Politics",
    "Cultural"
  ],
  "author": "عبد الرحمن منيف",
  "average_rating": "4.17",
  "url": "https://www.goodreads.com/book/show/263555.The_Trench"
}