{
  "title": "The Usurper's Crown",
  "description": "In a sweeping new epic of breathtaking excitement and adventure, Sarah Zettel, author of A Sorcerer's Treason , tells the enthralling story of a courageous woman from small-town Wisconsin caught up in a maelstrom of empire-shaking politics and sorcerous conspiracy on a dazzling world far removed from our own.It is 1872. Ingrid Loftfield and her sister Grace are living uneventful lives with their family on Sand Island, Lake Superior, until the day Grace nearly drowns. Grace becomes inexplicably ill, for she has been saved by the spirit of a drowned sailor which rests uneasily beneath the water. Ingrid can only watch as her sister drifts toward death, lured by the restless spirit, until an immegrant Finnish fisherman, Avan, helps Ingrid release Grace from the spell that binds her.Having rescued her sister, Ingrid herself begins an odyssey stranger than she could imagine. For Avan is not what he's assumed to be. He's Avanasy, a powerful sorcerer who's been banished from another world, Isavalta, where he tutored Medeoan, the princess-heir to the empire until she married a prince of a rival realm.Prince Kacha has won Medeoan's heart, and with the aid of his mentor, a subtle and ambitious sorcerer, plans to win Isavalta, using sweet Medeoan's love and an array of magical means to usurp her crown.Once Avanasy is gone, Kacha acts swiftly to isolate Medeoan from other allies, and to weave a spell that will weaken her so he can rule in her stead. When Medeoan discovers Kacha's treachery she flees, determined to win back her crown. She can only succeed if Avanasy, her oldest friend and most powerful ally, will return to help her. BBecause Avanasy loves Ingrid Loftfield and she loves him, together they must cross the vast gulf that separates our world from the magical realm of Isavalta. to rescue Medeoan, and fulfill a destiny far beyond Ingrid’s wildest dreams.",
  "genres": [
    "Fantasy",
    "Fiction",
    "Science Fiction Fantasy",
    "Romance",
    "Historical Fiction"
  ],
  "author": "Sarah Zettel",
  "average_rating": "3.76",
  "url": "https://www.goodreads.com/book/show/2634444-the-usurper-s-crown"
}