{
  "title": "Finding Courage to Speak: Women's Survival of Child Abuse",
  "description": "Haunted by their horrific pasts and suffering in silence, girls traumatized by severe child abuse often endure debilitating medical ailments and serious psychiatric problems well into adulthood. They withstand clinical depression, anorexia, sleep dysfunction, post-traumatic stress disorder, alcoholism, and one of the most extreme conditions-dissociative identity disorder (DID), the development of multiple personalities.Paige Alisen, herself diagnosed with DID as a result of repeated sexual, ritual, and psychological abuse, skillfully blends her own painful experiences with the powerful testimonies of other survivors, to present a disturbing yet inspiring account of childhood trauma and its long-term consequences for women's mental and physical well-being. She also delivers a strong indictment against a society that permits and perpetuates the brutal treatment of women and children, and offers an informative, practical, and encouraging guide for survivors on the journey to healing and recovery.Bringing together personal, psychiatric, social, and feminist perspectives, Alisen defines the different types of child abuse, describes why children remain silent about their ordeal, explores the ways in which they try to speak through their behaviors and their bodies, and examines how they develop extraordinarily complex and extreme strategies, including the creation of alter personalities, to cope with and survive the torment. She faults government, churches, schools, the health care system, and other institutions for their failure to adequately recognize and deal with the widespread problem of childhood trauma. Included in the volume are useful self-help resources and crucial advice for survivors and their support networks.Alisen's innovative and courageous approach to a difficult subject will empower the countless women who bear the emotional and physical scars of severe childhood trauma. In addition, her compelling work will raise awareness about the devastating effects of child abuse and sound a call to those in key positions to advocate for and effect social change that will end the vicious cycle of abuse.",
  "genres": [],
  "author": "Paige Alisen",
  "average_rating": "4.09",
  "url": "https://www.goodreads.com/book/show/2635224-finding-courage-to-speak"
}