{
  "title": "James Dean: Tomorrow Never Comes",
  "description": "America's most enduring and legendary symbol of young rebellion, James Dean continues into the 21st Century to capture the imagination of the world. In recognition of his enduring appeal as Hollywood's most visible symbol of unrequited male rage, bars from California to Nigeria and Patagonia are named in his honor.Dean, a strikingly handsome heart-throb, is a study in Tough but tender; brutal at times but remarkably sensitive; a reckless hellraiser badass who could revert to a little boy in bed. From his climb from the dusty backroads of Indiana to the most formidable boudoirs of Hollywood, his saga is electrifying.He claimed that sexually, he didn't want to go through life with one hand tied behind his back. He corroborated his identity as a rampant bisexual through sexual interludes with Marilyn Monroe, Rock Hudson, Elizabeth Taylor, Paul Newman, Natalie Wood, Shelley Winters, Marlon Brando, Steve McQueen, Ursula Andress, Montgomery Clift, Pier Angeli, Tennessee Williams, Susan Strasberg, and (are you sitting down?) both Tallulah Bankhead and (as a male prostitute) FBI director J. Edgar Hoover. Woolworth heiress Barbara Hutton wanted to make him her toy boy.Tomorrow Never Comes, the newest in Blood Moon's critically acclaimed Babylon Series, is the most penetrating look at James Dean to have emerged from the wreckage of his Porsche Spyder in 1955. He flirted with Death until it caught him. Ironically, he said, \"If a man can live after he dies, then maybe he's a great man.\"Before setting out on his last ride, he also said, \"I feel life too intensely to bear living it.\"Tomorrow Never Comes is published in recognition of the 60th anniversary of his early death. It presents a damaged but beautiful soul, and the embarrassing and sometimes lurid compromises James Dean made on his road to \"success\" before his demons grabbed him.",
  "genres": [
    "Biography",
    "Nonfiction"
  ],
  "author": "Darwin Porter",
  "average_rating": "3.50",
  "url": "https://www.goodreads.com/book/show/26347429-james-dean"
}