{
  "title": "An Unwalled City",
  "description": "About the Genevieve Betts grew up in Tempe, AZ. She currently lives and writes in Brooklyn, NY. Betts has been published in NANO Fiction, Poetry Quarterly, The Bakery, Digital Americana, and Mom Egg Review. An Unwalled City is her debut book! \"Whether writing of childbirth, caring for an adventurous pet tarantula as a child in Arizona, or reading Sendak's A is for Alligator to her son as, on the other side of the wall next door, a murder-suicide unfolds in Brooklyn, Genevieve Betts is an empiricist of the im/material world, crossing real borders in that imaginary country called memory, traveling across states lines of the mind and heart. An Unwalled City opens with an epigraph from Epicurus about life being a city without walls of protection from death, and in wry, stark poems, Betts observes life and death in the balance with a keen and unblinking eye. 'How will death come for me?' one speaker, a new mother after a hard birthing, asks. The answer is startling and 'like a giant black-eyed moth / closing its white velvet / around the winter of my body.' An Unwalled City is a breath-taking debut volume.Cynthia Hogue, author of Revenance \"In Genevieve Betts' An Unwalled City, her human babies are animalish creatures while desert insects and spiders are cared for as carefully as the babies. A collection as much about her family as it is about Arizona, we are given a world in which 'latchkey was just another way to say freedom,' and in which poisonous giant desert centipedes that jump at her face during sex are quickly termed 'centipedus coitus interuptus.' This book will make you laugh aloud, but it will also make you feel tender about all junky, ugly, poor, poisonous, regular, and vulnerable things of this world that Betts so tenderly notices.\"Sarah Vap, author of End of the Sentimental Journey",
  "genres": [],
  "author": "Genevieve Betts",
  "average_rating": "4.75",
  "url": "https://www.goodreads.com/book/show/26345401-an-unwalled-city"
}