{
  "title": "Illiberal Reformers: Race, Eugenics, and American Economics in the Progressive Era",
  "description": "In \"Illiberal Reformers,\" Thomas Leonard reexamines the economic progressives whose ideas and reform agenda underwrote the Progressive Era dismantling of \"laissez-faire\" and the creation of the regulatory welfare state, which, they believed, would humanize and rationalize industrial capitalism. But not for all.Academic social scientists such as Richard T. Ely, John R. Commons, and Edward A. Ross, together with their reform allies in social work, charity, journalism, and law, played a pivotal role in establishing minimum-wage and maximum-hours laws, workmen's compensation, progressive income taxes, antitrust regulation, and other hallmarks of the regulatory welfare state. But even as they offered uplift to some, economic progressives advocated exclusion for others, and did both in the name of progress.Leonard meticulously reconstructs the influence of Darwinism, racial science, and eugenics on scholars and activists of the late nineteenth and early twentieth centuries, revealing a reform community deeply ambivalent about America's poor. Economic progressives championed labor legislation because it would lift up the deserving poor while excluding immigrants, African Americans, women, and \"mental defectives,\" whom they vilified as low-wage threats to the American workingman and to Anglo-Saxon race integrity.Economic progressives rejected property and contract rights as illegitimate barriers to needed reforms. But their disregard for civil liberties extended much further. \"Illiberal Reformers\" shows that the intellectual champions of the regulatory welfare state proposed using it not to help those they portrayed as hereditary inferiors, but to exclude them.",
  "genres": [
    "History",
    "Politics",
    "Economics",
    "Nonfiction",
    "American History",
    "Race",
    "Eugenics"
  ],
  "author": "Thomas C. Leonard",
  "average_rating": "4.12",
  "url": "https://www.goodreads.com/book/show/26402848-illiberal-reformers"
}