{
  "title": "Splinterpoint",
  "description": "For stranded Earthling Nunzio Arquette, life in the interdimensional megalopolis of Splinterpoint isn’t a piece of cake. Between cutthroat guilds, his flamboyant alien ex-boyfriend, and an unfortunate run-in with a cursed burrito, all he wants is to get back home — if only he knew how to find Earth again. In the meantime, he uses his curse as a tool to assist him in bounty-hunting. It’s not the best job in the world, but it pays the bills.That is, until an attractive, affable, magic-wielding barbarian named Kol’daar crashes Nunzio’s licensing evaluation with the Mercenaries’ Guild. Nunzio ends up on probation, and Kol’daar moves in next door. Despite getting off on the wrong foot, Kol’daar wants to be friends, even when Nunzio responds to his overtures with vandalism. His curse has kept him celibate for over a year, and even with a flirty new neighbor to tempt him, that won’t change. If Nunzio catches himself staring at those perfect abs, it’s just because the dude refuses to wear a shirt. Further proving that Murphy’s Law is a multiversal constant, an apocalypse threatens the city. Of course, the only things that can stop it are Kol’daar, armed with his trusty music-magic, and Nunzio’s own unique destructive ability — that is, if the demons, pissed-off landladies, teenaged girls, self-interested thieves, radio evangelists, and mad scientists don’t get them first. This story was written as a part of the M/M Romance Group's \"Love is an Open Road\" event. Group members were asked to write a story prompt inspired by a photo of their choice. Authors of the group selected a photo and prompt that spoke to them and wrote a short story. Photo Description: Two well-built, dark-haired men face each other in a small bathroom, their lower halves nearly touching. The shorter one has his back to the mirror, a disheveled look to his business-casual clothes. The taller one has shorter hair and no shirt at all. Both have shaving foam on their faces. The shorter man drags a razor over the taller one’s cheek. A second razor glides across his own face, guided by no visible hand.This story may contain sexually explicit content and is intended for adult readers. It may contain content that is disagreeable or distressing to some readers. The M/M Romance Group strongly recommends that each reader review the General Information section before each story for story tags as well as for content warnings.",
  "genres": [
    "Science Fiction",
    "M M Romance",
    "Fantasy",
    "Humor",
    "Romance",
    "LGBT",
    "Aliens"
  ],
  "author": "Regina St. Claire",
  "average_rating": "4.18",
  "url": "https://www.goodreads.com/book/show/26390668-splinterpoint"
}