{
  "title": "Becoming Jane Jacobs",
  "description": "Winner of the 2016 Jane Jacobs Urban Communication Book Award The result of years of groundbreaking research, Becoming Jane Jacobs is the first intellectual biography to focus on Jacobs's early life and writing career leading up to her great book, The Death and Life of Great American Cities. Through an analysis of Jacobs's life and work, including many of her previously unknown writings and other original discoveries, Becoming Jane Jacobs offers a new foundation for understanding not only Death and Life, but her subsequent books on cities, economies, and civilizations.Jane Jacobs is universally recognized as one of the most important figures in American urbanism, and The Death and Life of Great American Cities one of the most important books on cities. However, because of her David-versus-Goliath battles with \"Power Broker\" Robert Moses and the urban-renewal establishment, Jacobs has received more attention for being an activist than a thinker, despite having written a list of influential books on cities, economies, and other subjects. Her intellectual skills have often been reduced to unusually keen powers of observation and common sense.With Becoming Jane Jacobs , Dr. Peter L. Laurence shows that what is missing from the stereotypes and myths is a critical examination of how Jacobs arrived at her ideas about city life. The book shows that although Jacobs had only a high school diploma, she pursued a writing career that prepared her to become a nationally recognized architectural critic just as postwar urban renewal policies came into effect. After starting her writing career in the 1930s, and developing it as a writer and propagandist for the US government in the 1940s, Jacobs was immersed in an elite community of architects, city planners, and academics as an editor of the Time Inc. magazine Architectural Forum . The 1950s, a critical decade for US cities, was the time when Americans were deciding between living in new suburbs or rebuilding and modernizing old cities. Laurence reveals that when faced with this choice, Jacobs not only sided with urban renewal, but idealized the field of city planning-- before soon coming to see the problems with outdated and anti-urban concepts and methods for improving cities. Laurence traces the evolution of Jacobs's thinking--through her visits and studies of redevelopment in Philadelphia, Baltimore, Cleveland, Washington DC, Fort Worth, and East Harlem, among other places, and close interactions with notables including editor Douglas Haskell, shopping mall designer Victor Gruen, housing advocate Catherine Bauer, architect Louis Kahn, Philadelphia city planner Edmund Bacon, urban historian Lewis Mumford, urban theorist Kevin Lynch, and collaborators at the British magazine The Architectural Review. Challenging the stereotyped limits of Jacobs's geography and outsider status, Laurence shows that Jacobs contributed significantly to architectural criticism and urban design, participated in important academic conferences, and became known as an expert writer on cities even before she started writing Death and Life .The product of many years of groundbreaking research, Becoming Jane Jacobs shows that The Death and Life of Great American Cities could only have been written by Jane Jacobs. Through analysis of many of previously unknown writings, identified and discussed here for the first time--including Jacobs's government employment records, FBI files, work memoranda, and correspondence with notable acquaintances and confidants--and through an understanding of her ideas in their historical context, Laurence asserts that Death and Life was not the spontaneous epiphany of an amateur activist but the product of a professional writer and experienced architectural critic with deep knowledge about the renewal and dynamics of American cities. But at the same time, by showing how Jacobs's ideas evolved, Laurence suggests ways that we can become more like Jacobs ourselves, and continue to develop our understanding of better cities.",
  "genres": [
    "Biography",
    "History",
    "Nonfiction",
    "Urbanism",
    "Architecture"
  ],
  "author": "Peter L. Laurence",
  "average_rating": "4.04",
  "url": "https://www.goodreads.com/book/show/26371412-becoming-jane-jacobs"
}