{
  "title": "The House at Sugar Beach",
  "description": "Journalist Helene Cooper examines the violent past of her home country Liberia and the effects of its 1980 military coup in this deeply personal memoir and finalist for the 2008 National Book Critics Circle Award.Helene Cooper is “Congo,” a descendant of two Liberian dynasties—traced back to the first ship of freemen that set sail from New York in 1820 to found Monrovia. Helene grew up at Sugar Beach, a twenty-two-room mansion by the sea. Her childhood was filled with servants, flashy cars, a villa in Spain, and a farmhouse up-country. It was also an African childhood, filled with knock foot games and hot pepper soup, heartmen and neegee. When Helene was eight, the Coopers took in a foster child—a common custom among the Liberian elite. Eunice, a Bassa girl, suddenly became known as “Mrs. Cooper’s daughter.”For years the Cooper daughters—Helene, her sister Marlene, and Eunice—blissfully enjoyed the trappings of wealth and advantage. But Liberia was like an unwatched pot of water left boiling on the stove. And on April 12, 1980, a group of soldiers staged a coup d'état, assassinating President William Tolbert and executing his cabinet. The Coopers and the entire Congo class were now the hunted, being imprisoned, shot, tortured, and raped. After a brutal daylight attack by a ragtag crew of soldiers, Helene, Marlene, and their mother fled Sugar Beach, and then Liberia, for America. They left Eunice behind.A world away, Helene tried to assimilate as an American teenager. At the University of North Carolina at Chapel Hill she found her passion in journalism, eventually becoming a reporter for the Wall Street Journal and the New York Times. She reported from every part of the globe—except Africa—as Liberia descended into war-torn, third-world hell.In 2003, a near-death experience in Iraq convinced Helene that Liberia—and Eunice—could wait no longer. At once a deeply personal memoir and an examination of a violent and stratified country, The House at Sugar Beach tells of tragedy, forgiveness, and transcendence with unflinching honesty and a survivor's gentle humor. And at its heart, it is a story of Helene Cooper’s long voyage home.",
  "genres": [
    "Africa",
    "Nonfiction",
    "Memoir",
    "Book Club",
    "History",
    "Biography",
    "Biography Memoir"
  ],
  "author": "Helene Cooper",
  "average_rating": "3.91",
  "url": "https://www.goodreads.com/book/show/2643182-the-house-at-sugar-beach"
}