{
  "title": "The Gospel of Germs: Men, Women, and the Microbe in American Life",
  "description": "AIDS. Ebola. \"Killer microbes.\" All around us the alarms are going off, warning of the danger of new, deadly diseases. And yet, as Nancy Tomes reminds us in her absorbing book, this is really nothing new. A remarkable work of medical and cultural history, The Gospel of Germs takes us back to the first great \"germ panic\" in American history, which peaked in the early 1900s, to explore the origins of our modern disease consciousness.Little more than a hundred years ago, ordinary Americans had no idea that many deadly ailments were the work of microorganisms, let alone that their own behavior spread such diseases. The Gospel of Germs shows how the revolutionary findings of late nineteenth-century bacteriology made their way from the laboratory to the lavatory and kitchen, with public health reformers spreading the word and women taking up the battle on the domestic front. Drawing on a wealth of advice books, patent applications, advertisements, and oral histories, Tomes traces the new awareness of the microbe as it radiated outward from middle-class homes into the world of American business and crossed the lines of class, gender, ethnicity, and race.Just as we take some of the weapons in this germ war for granted--fixtures as familiar as the white porcelain toilet, the window screen, the refrigerator, and the vacuum cleaner--so we rarely think of the drastic measures deployed against disease in the dangerous old days before antibiotics. But, as Tomes notes, many of the hygiene rules first popularized in those days remain the foundation of infectious disease control today. Her work offers a timely look into the history of our long-standing obsession with germs, its impact on twentieth-century culture and society, and its troubling new relevance to our own lives.",
  "genres": [
    "History",
    "Nonfiction",
    "History Of Medicine",
    "History Of Science",
    "Academic",
    "Science",
    "Gender Studies"
  ],
  "author": "Nancy Tomes",
  "average_rating": "3.90",
  "url": "https://www.goodreads.com/book/show/1170005.The_Gospel_of_Germs"
}