{
  "title": "How to Improve Your Marriage Without Talking About It: Finding Love Beyond Words",
  "description": "Men are right. The “relationship talk” does not help. Dr. Patricia Love’s and Dr. Steven Stosny’s How to Improve Your Marriage Without Talking About It reveals the stunning truth about marital • Love is not about better communication. It's about connection.• You'll never get a closer relationship with your man by talking to him like you talk to one of your girlfriends.• Male emotions are like women's you can't be too direct too quickly.• There are four ways to connect with a activity, sex, routines.• Men want closer marriages just as much as women do,but not if they have to act like a woman.• Talking makes women move closer; it makes men move away.• The secret of the silent male is his wife supplies the meaning in his life.• The stunning truth about love is that talking doesn’t help.Drs. Patricia Love and Steven Stosny have studied this all-too-familiar dynamic between men and women and have reached a truly shocking conclusion. Even with the best of intentions, talking about your relationship doesn’t bring you together, and it will eventually drive you apart.The reason for this is that underneath most couples’ fights, there is a biological difference at work. A woman’s vulnerability to fear and anxiety makes her draw closer, while a man’s subtle sensitivity to shame makes him pull away in response. This is why so many married couples fall into the archetypal roles of nagging wife/stonewalling husband, and why improving a marriage can’t happen through words.How to Improve Your Marriage Without Talking About It teaches couples how to get closer in ways that don’t require “trying to turn a man into a woman.” Rich in stories of couples who have turned their marriages around, and full of practical advice about the behaviors that make and break marriages, this essential guide will help couples find love beyond words.",
  "genres": [
    "Relationships",
    "Nonfiction",
    "Marriage",
    "Self Help",
    "Psychology",
    "Audiobook",
    "Personal Development"
  ],
  "author": "Patricia Love",
  "average_rating": "3.94",
  "url": "https://www.goodreads.com/book/show/2644961-how-to-improve-your-marriage-without-talking-about-it"
}