{
  "title": "Heave",
  "description": "In this wholly original novel, twenty one year old Seraphina Sullivan longs for a cosmopolitan world but she's trapped in traditional seaside Nova Scotia where the dramatic landscape and magnificent North Atlantic ocean shape her world as much as the traditional culture and rigidly gendered expectations. The novel begins with Seraphina fleeing her wedding and taking refuge in one of her father’s antique outhouses where she finally confronts the secrets and lies buried in her past.Seraphina sweeps us into her exhilarating, poignant and often hilarious journey as she rebels and flees from rural Nova Scotia to London bars, to strip clubs on the docks, through mental hospital wards and rehab centres, back to pie factories, country roads, sweeping verandahs and row boats in serene Lupin Cove. Told with wry humour, Heave pulls us into the lives of obscure people and elevates the majesty of their struggles and triumphs.Seraphina’s first person narrative is both propulsive and lyrical, shifting effortlessly between the present and past, evoking an array of off-beat characters. Serrie's best friends, Dearie and Elizabeth, are both dreamers living lives dictated by generations of expectation and oppression. Dearie, the anglicized Acadian who wants to go to New Orleans to find her Cajun relatives, Elizabeth, who, like Seraphina, fears adulthood with its scarcity of opportunity. There is Chester, who Seraphina meets in a psychiatric hospital, a man who believes he is a lobster. Seraphina’s brother Percy, is a concert violinist who hides in music. Martha, Seraphina’s bitter and exhausted mother, must come up with a scheme to make money to save the family from being homeless. She coerces Seraphina into a complicated scheme which ends in disaster. Seraphina’s growing despair and sense of disillusionment spiral her towards a climax that is at once unexpected and yet inevitable. Heave explores what one generation inherits from the next and bursts with relentless hope for the sweet losers who need it most of all.",
  "genres": [
    "Fiction",
    "Canada",
    "Book Club",
    "Novels",
    "Family",
    "Contemporary",
    "Humor"
  ],
  "author": "Christy Ann Conlin",
  "average_rating": "3.57",
  "url": "https://www.goodreads.com/book/show/1169937.Heave"
}