{
  "title": "In Awe",
  "description": "Sarah, Harriet and Boris are outcasts searching for solace in their own private fantasy worlds. Mourning the recent death of her best friend, Marshall, Sarah tries to find comfort in the countless horror movies she loves. Harriet, Marshall's mother, grieves by immersing herself in the serenity of her farm. Then there is Boris. A sixteen-year-old orphan with dreams of writing the ultimate zombie novel, he spends his nights sneaking away from a youth home and his days dreaming of Rex, a beautiful but savage classmate. It is this fascination that sets in motion a violent chain of events that ultimately tests the boundaries of the three misfits' obsessions and leads the novel to its brutal and startling conclusion. \"Nimble, alarming, complex, and lushly written.\"-- \"New York Post\"\"Elegantly written.\"-- \"Time Out New York\"\"[Heim] teases out the pleasures of cruelty in language that scalpels one minute, unfurls lushly the next.\" \"Village Voice\"\"Grand, uncanny, horrific and sweet. . . . Those who give themselves to it will be haunted.\"-- \"Lambda Book Report\"\"Unforgettable. . . . Quite simply, In Awe is awesome: inordinately powerful and alarming, terrifying and breathtaking. A transcendent, bittersweet novel of obsession and pain, love and loathing, memory and desire. Heim is testing the limits of his dynamic, raw vision.\"- \"Kansas City Star\"\"The ripple of danger beneath the surface of Scott Heim's In Awe should serve as a warning to anyone expecting a casual ride: this is a book that means to take you places. A patina of malevolence overhangs Heim's Kansas, and even the quietest moments can have the most terrifying consequences for his trio ofmisfits, Boris, Sarah, and Harriet. The story draws us forward toward its heart like the best of spiderwebs.\"--Jim Grimsley",
  "genres": [
    "Fiction",
    "LGBT",
    "Queer",
    "Gay Fiction",
    "Gay",
    "Young Adult",
    "Queer Lit"
  ],
  "author": "Scott Heim",
  "average_rating": "3.62",
  "url": "https://www.goodreads.com/book/show/264255.In_Awe"
}