{
  "title": "Monster Stalker",
  "description": "Horror follows vampire Nico to a new world, and an old horror within her responds; kill it before it kills her. Nico jeopardises everything on a lone, redemptive path rescuing victims of the underworld and hunting the nightmare that created her—a monster only Nico knows is there. A paranormal sci-fi noir. Darquepunk science fiction for the gothic, different, and queer. Gen X, gender fluidity. Polyaphroditic. Cyberpunk. Some sexual content; Mild language; Violence; sexual violence.  “Kill first.” Vampire Nico popped from the year 1998 into an Again NewYork airfield, a sudden chrono-immigrant with Mr Bear strapped to her, her switchblade in hand, and no idea how or why she got there. She’s on Darqueworld: an intragalactic society 400 light years from Old Earth, where Other-beings and humans co-exist and vampires are no big deal. Nico can have a normal student life at last and even date a diner waitress she likes. But there’s a darkened spot in her mind, one blanking out her immediate past, and the spectre of Nico's maker haunts her. Only in Again NewYork’s underworld can Nico find what pursues her—and kill it again.  “Way to go, Super Nico!” “I am not super,” Nico snapped. “Got it. Stupid nickname. You are Lone Nico and Bear.”  Meet Nico Alexikova and Bear: Eighteen years old at death and fifteen years unliving, Nico worked hotel front desk, nightshift, attended universities, and led a quiet life on Old Earth. But unknown circumstances sent her to Darqueworld, and with no memory of her immediate past, she can only rely on herself, Bear, and her knife in a futuristic, spacefaring society with creatures like her—and with women she could care for.  Heloise Allen: Tall, dark, and sharply beautiful, she's a vampire chrono-refugee with affluence, connections, and the possible answers to Nico's past—if Nico can trust her.  Shayla O'Fey: As seemingly light as Heloise is dark, she's a Lucy's Diner waitress and witch Nico can't help falling for. But Shayla is also a coven's ex-Pistol, their former peacekeeper, and her history with vampires is not kind.  Enjoy the Darquepunk Universe: Preternaturals take to the stars, but the gods and goddesses had long gone first, in sentient sky boats, chariots, and Valkyrian ships, to found a planet of quakes, dreams, and monsters. Darqueworld: where spacefarers and chrono-travellers seek answers and riches amid celestial corporations and refugee Other-beings. Weird-matter wielders, shifters, vampires, intragalactic species, bio-mechanical beings, artificial constructs—and mere humans; every adventurer and outcast with a dream or desire, come to Darqueworld for haven or hell.  More from Elizabeth Watasin’s Darquepunk series: Bloody Nike: A Darquepunk Novel Vol 2 (Coming Soon) Gunslinger: A Darquepunk Novel Vol 3 (Coming Soon)  Also by Elizabeth Watasin: The Dark Victorian: Risen Vol 1 The Dark Victorian: Bones Vol 2 Ice Demon, A Dark Victorian Penny Dread Vol 1 Medusa, A Dark Victorian Penny Dread Vol 2 Sundark: An Elle Black Penny Dread Vol 1 Poison Garden: An Elle Black Penny Dread Vol 2 (Coming Soon) Charm School: The Wrecking Faerie Vol 1 (Coming Soon) And enjoy Elizabeth Watasin’s comic book series: Charm School Digital, No 1-9  To Stay Up To Date: Be sure to visit the Author Page and hit 'Follow'. Thanks for being a reader!",
  "genres": [
    "LGBT",
    "Paranormal",
    "Fantasy",
    "Science Fiction",
    "Lesbian",
    "Vampires",
    "Romance"
  ],
  "author": "Elizabeth Watasin",
  "average_rating": "4.19",
  "url": "https://www.goodreads.com/book/show/26424508-monster-stalker"
}