{
  "title": "The 33-Year-Old Rookie: How I Finally Made it to the Big Leagues After Eleven Years in the Minors",
  "description": "Chris Coste dreamed of playing major-league baseball from the age of seven. But after eleven grueling years in the minors, a spot on a major-league roster still seemed just out of his reach–until that fateful call came from the Philadelphia Phillies in May 2006. At age thirty-three (“going on eighty”), Coste was finally heading to the big time.The 33-Year-Old Rookie is like a real-life Rocky, an unforgettable and inspirational story of one man’s unwavering pursuit of a lifelong goal. Beginning in a single-parent home in Fargo, North Dakota, and ending behind home plate on the flawless diamond of the Phillies’ Citizens Bank Park–where fans and teammates call him “Chris Clutch” because of his knack for getting timely hits–this intimate account of Coste’s baseball odyssey is a powerful story of determination, perseverance, and passion.For eleven seasons, Coste hustled, fought, and gritted his way to his breakthrough–and never lost faith in his abilities. Along the way, he gained the affection and admiration of baseball fans from Ottawa and Scranton to various Mexican and Venezuelan cities. Battered by years spent behind a catcher’s mask, and faced with bracing realities–there were bills to pay, and his young daughter was entering first grade–Coste decided to give it one last shot in 2006. But that year, during the Phillies’ major-league spring training, Coste was demoted to the minors at the last minute to make room for a utility outfielder, despite having hit a blistering .463 and earning the trust of the team’s pitchers. Later that season, though, Coste finally got the call-up, and he hit .364 during the Phillies’ furious battle to nail down the final postseason berth.Coste takes us through the 2006 spring training season–with its pulse-quickening moments and close calls–and into his first season as a major-league catcher with the Phillies. From tense stretch-run games that kept Phillies’ fans on the edge of their seats to moments of intimate personal reflection, Coste’s saga offers baseball aficionados an inside look at a remarkable life and career. In this stirring, wry, and candid look at the life of a professional baseball nomad who never surrendered his dream, we savor the sometimes bittersweet fruits of victory against seemingly insurmountable odds.",
  "genres": [
    "Sports",
    "Baseball",
    "Nonfiction",
    "Memoir",
    "Biography",
    "Autobiography"
  ],
  "author": "Chris Coste",
  "average_rating": "3.74",
  "url": "https://www.goodreads.com/book/show/2642454-the-33-year-old-rookie"
}