{
  "title": "Pivot Point: How to Build a Winning Career Game Plan for Mid-Career Women",
  "description": "“Pivot Point is a great tool for mid-career talent to continuously improve self-awareness and collaborate on a plan to succeed.” - Dr. Idalene “Idie” Kesner, Kelley School of Business, Dean “Pivot Point exemplifies the power of collaboration. When we connect with purpose, we create sustainable change.” - Jennifer Browning Holmes, Integrating Woman Leaders, Inc. Founder and President “Our success is directly linked to the success of our people. In Pivot Point, Julie Kratz offers us a unique and very actionable set of career development tools.” - Mikell Riggs Parsh, Adayana, CEO ----- The purpose of Pivot Point is to empower mid-career, high-potential women through building winning career game plans. Even with more women than men graduating from college and becoming middle managers, few make it to the C-suite or to corporate boards. The glass ceiling is still very much in place. In a series of interviews with mid-career, high-potential women, Julie Kratz discovered that women want more actionable tools to implement positive change. Thus, the idea was born. Let’s take a long look into that daunting glass ceiling and, instead of thinking of ways to break or shatter it, let’s use it as a mirror to our advantage. Pivot Point is built on the principle of reflection, and sharing our reflections. The power of reflection has layers. We must first know our authentic selves, find and express our sources of confidence, and build our winning career game plan. Then, sharing our reflec-tion requires us to connect with those who will help us achieve our career game plan, ask for it, and continuously improve our reflections through leading with influence. It’s like a circle, once we have completed the process and lead with influence, others follow suit and begin their own Pivot Point journeys.",
  "genres": [],
  "author": "Julie Kratz",
  "average_rating": "3.00",
  "url": "https://www.goodreads.com/book/show/26474055-pivot-point"
}