{
  "title": "Warrior's Song",
  "description": "What if someone told you in no uncertain terms that you were destined to become president of the United States someday? Would you believe him or her? Someone told Parker Shaw that very thing. But, like any twenty-year-old, he just shook his head, not sure what to think of the elderly Navajo man he and his buddy Sam encountered one summer day. Why does he look so familiar? Granted, Parker and Sam had been trespassing on this guy’s property out in the middle of Monument Valley, but they had not expected so many surprises. That is, unless you count the fact that Parker had a dream about being shot in the head after falling off a horse, out in a desolate, red-rocked, smokestack factory kind of place—like northern Arizona. By a bunch of vaqueros, no less! Imagine his surprise when his curiosity led him to a spot where the dream may have taken place? What? Parker’s mom would have completely flipped out, and his dad would have disowned him if they had known what he was up to, his strong Chesapeake Bay roots echoing centuries of learned Shaw men who had answered a nation’s call, the least of which being his Civil War hero ancestor. That’s beside the point; Parker was entering a new world, and all he could do was buckle his seatbelt, sit back, and enjoy the ride. Thank God Sam was there. Poor Parker just wishes he could go back to being an average kid. But the destiny doesn’t give up on you, Parker, so you can’t give up on it. As his story continues to unfold, his uncanny knack for being in the right place at the right time only serves to awaken him. \"Like so many college students, Shaw is torn between his father’s dream for his future and his own uncertainty. Shaw’s intellectual self-exploration provides the foundation of this novel. Hill sprinkles the novel’s dialog with references to the fundamentals of a liberal arts education, including American history, science, psychology, sociology, and philosophy. At first, these references seem unrelated; however, Mr. Hill winds them together in an increasingly pertinent existential rationale. Elemental to this exploration are concepts of the human soul, reincarnation and the integration of purpose, fulfilled as a result of Hill’s use of nuance and association.\" —Charles Weinblatt, author of Jacob's A Holocaust Love Story\"This book is so very inspirational. There are many young men in the United States who will study for and enter government activities at some time in their lives. They may have taken the same classes as Parker and Sam, but will they have the same drive, the need to reach out and know even more. If you have a teenage son, or daughter, looking toward college, I highly recommend this book be read by the entire family. Hill writes fluently from what he had studied, but more importantly merges his own personal philosophy that has undoubtedly evolved, and shares it with us as we each strive for success in today's world. This literary gem is undoubtedly the first in what will become a treasure of conceptual thinking and insight that will surely spark new enthusiasm in the lives of each and every reader. Don't miss the opportunity!\" —Glenda Bixler, Reviewers Roundup",
  "genres": [],
  "author": "Thomas M. Hill",
  "average_rating": "4.14",
  "url": "https://www.goodreads.com/book/show/11700740-warrior-s-song"
}