{
  "title": "Chiara Corbella Petrillo",
  "description": "Chiara Petrillo was seated in a wheel chair looking lovingly toward Jesus in the tabernacle. Her husband, Enrico, found the courage to ask her a question that he had been holding back. Thinking of Jesus's phrase, my yoke is sweet and my burden is light, he asked: \"Is this yoke, this cross, really sweet, as Jesus said?\"A smile came across Chiara's face. She turned to her husband and said in a weak voice: \"Yes, Enrico, it is very sweet.\"At 28 years old, Chiara passed away, her body ravaged by cancer. The emotional, physical, and spiritual trials of this young Italian mother are not uncommon. It was her joyful and loving response to each that led one cardinal to call her a saint for our times.Chiara entrusted her first baby to the blessed Virgin, but felt as though this child was not hers to keep. Soon, it was revealed her daughter had life-threatening abnormalities. Despite universal pressure to abort, Chiara gave birth to a beautiful girl who died within the hour. A year later, the death of her second child came even more quickly.Yet God was preparing their hearts for more more sorrow and more grace.While pregnant a third time, Chiara developed a malignant tumor, but refused the treatment that would save her treatment that would have risked the life of her unborn son.Almost immediately after giving birth to Francesco, Chiara's tumor became terminal and caused her to lose the use of her right eye. Her body was tested, and so was her soul as she suffered through terrible dark nights.She said yes to everything God sent her way, becoming a true child of God. And as her days on earth came to an end, Enrico looked down on his wife and said, \"If she is going to be with Someone who loves her more than I, why should I be upset?\"Each saint has a special charisma, a particular facet of God that is reflected through her. Chiara's was to be a witness to joy in the face of great adversity, the kind which makes love overflow despite the sorrow from loss and death.",
  "genres": [
    "Catholic",
    "Biography",
    "Faith",
    "Nonfiction",
    "Religion",
    "Christian",
    "Spirituality"
  ],
  "author": "Simone Troisi",
  "average_rating": "4.69",
  "url": "https://www.goodreads.com/book/show/26485204-chiara-corbella-petrillo"
}