{
  "title": "Miracle",
  "description": "It is New Year’s Eve when the storm of the century hits northern California. In a quiet neighborhood in San Francisco, amid the chaos of fallen trees and damaged homes, the lives of three strangers are about to collide. For Quinn Thompson, what happens in the storm’s wake will bring down a barrier he has built around himself since his wife’s death. For neighbor Maggie Dartman, it will spark friendship at a time when she needs it most. And for Jack Adams, a carpenter who will repair Quinn’s and Maggie’s homes, the storm brings an opportunity: to help two people and to be repaid with the greatest gift of all.As three lives come together and a unique friendship is forged, something extraordinary begins to happen...Maggie, still grieving a loss, slowly comes alive again-–and Jack finally shares a painful secret he has hidden for years. But at the center of the friendship is Quinn. A man who has scaled heights of success in business, Quinn is now adrift, waiting as builders put the finishing touches on his newest passion, a 180-foot yacht he plans to sail around the world. Looking back at all he missed with his family while he built his empire, Quinn is consumed by guilt, focused only on escaping to the sea. But as his plans near completion, and his friendship with Maggie begins to change, Quinn faces a choice–between a safe haven and an adventure of the heart. The choice he makes will affect other lives as powerfully as his own. And it will take him on an extraordinary journey-–and into a second, terrifying storm, one that will bring him danger...or deliverance.Danielle Steel brings us miracles big and small-–the kind we are blessed with and those we give to others. With a subtle hand and a flawless touch, she has written a novel that soars with hope, and makes us laugh, cry, and care.From the Hardcover edition.",
  "genres": [
    "Romance",
    "Fiction",
    "Chick Lit",
    "Contemporary",
    "Novels",
    "Drama",
    "Audiobook"
  ],
  "author": "Danielle Steel",
  "average_rating": "3.84",
  "url": "https://www.goodreads.com/book/show/26508.Miracle"
}