{
  "title": "Family Bible",
  "description": "“Delbridge knows sorrow like she knows the rhythm of her own heart. . . . Fans of Carson McCullers won't want to miss this one—witty, tragic, and relentlessly wise.”—Booklist, starred review\"Melissa Delbridge's memories of her early life are dead-accurate, hilarious, and tragic and will surely prove enduring as a guide to the Deepest South—a place and a culture that continue to prove alarmingly vital. I mean to keep the book handy, for pleasure and real guidance.\"—Reynolds Price\"Family Bible is a gritty coming-of-age story set on the banks of the Black Warrior River in Tuscaloosa, Alabama, with everything one expects of the Deep South: incest (some willing, some not), guns, bourbon, insanity, Jesus, fast women, cheating men. But Melissa Delbridge explodes and exploits these clichés into something startling and new, and in spite of the horror aroused by some events, it's a hell of a fun ride. Delbridge's ability to bring such joy to her readers through narratives that contain so much quiet sorrow is a true testament to her understanding of what it means to persevere.\"—Jennifer S. Davis, author, Our Former Lives in Art\"Melissa Delbridge chronicles her journey toward self-realization with startling freshness and humor. I highly recommend it.\"—Bev Marshall, author, Right As Rain, Walking through Shadows, and Hot Fudge Sundae Blues\"Family Bible took me home. Reading it was like going to a reunion. All the people I wanted to see were there, fully there. All the people I never wanted to see again were there as well! It was deliciously painful. She captured the past, in character and place, and brought them to life in the now.\"—Steven Sherrill, author, The Minotaur Takes a Cigarette Break, Visits from the Drowned Girl, and The Locktender's House\"Melissa Delbridge's Family Bible is one of the most memorable books to come my way in a long time. She writes with grace, love, and understanding. Her ear is pitch perfect, and her eye misses nothing, not even the smallest detail. Put this one on a shelf where you can find it easily, because if you're like me, you'll want to re-read it again and again.\"—Steve Yarbrough, author, The End of California\"What a solid, warm embrace Melissa Delbridge offers the South in her memoir. But don't think she's not able, somehow, to keep eye contact with what's behind her, literally and figuratively. Family Bible is a true triumph, and proves that there's no such thing as moderation down here.\"—George Singleton, author, Work Shirts for Madmen\"Melissa J. Delbridge writes with a watch-maker's eye and a warrior's brave heart. Family Bible is wonderful.\"—Marshall Chapman, songwriter/rocker/author of Goodbye, Little Rock and Roller\"Swimming and sex seemed a lot alike to me when I was growing up. You took off most of your clothes to do them and you only did them with people who were the same color as you. As your daddy got richer, you got to do them in fancier places.\" Starting with her father, who never met a whitetail buck he couldn't shoot, a whiskey bottle he couldn't empty, or a woman he couldn't charm, and her mother, who \"invented road rage before 1960,\" Melissa Delbridge introduces us to the people in her own family bible. Readers will find elements of Southern Gothic and familiar vernacular characters, but Delbridge endows each with her startling and original interpretation. In this disarmingly unguarded and unapologetic memoir, she shows us what really happened in the \"stew of religion and sex\" that was 1960s Tuscaloosa.Whether telling of her father's circumspect \"hunting trips,\" her mother's sudden, tempestuous moves across town in the middle of the night, or coming to terms with her own sexuality on the banks of the river, Delbridge is the real star of this entertaining memoir. Crackling with wit, frighteningly smart, both drop-dead funny and wrenchingly sad, Family Bible is a stunning personal history.",
  "genres": [
    "Memoir",
    "Nonfiction"
  ],
  "author": "Melissa J. Delbridge",
  "average_rating": "3.90",
  "url": "https://www.goodreads.com/book/show/2650193-family-bible"
}