{
  "title": "Flowers in the Mirror: A Classic Qing Dynasty Chinese Novel",
  "description": "Written by Li Ju-chen during the Qing dynasty Flowers in the Mirror is a classic novel of Chinese literature. It is full of fanciful tales. The term \"Flowers in the Mirror\" is an idiomatic phrase meaning \"illusion.\" An example is a moon as seen upon a body of water which appears to be close and near, but it is a mere reflection. Empress Wu Tse-tien: The stories are set during the reign of Wu Tse-tien, female ruler. Wu was actually an Empress of China who ruled from 690 to 705. Her reign was a part of the short-lived Zhou dynasty, which interrupted the Tang dynasty. Some traditional historians portray Wu as a power hungry woman who cared little for those who she hurt nor what she did. A popular theory is that Wu killed her own child in order to become the empress. She was recognized, however, as both capable and attentive even by traditional historians who disliked her behavior. She had an ability to select capable people to serve as officials. She was admired for this trait throughout the Tang and subsequent dynasties. Wu was the only female emperor of China in more than four millennia. Fall from Grace: The story begins with a terrible blizzard. In show of hubris, Empress Wu issues a decree that all flowers must bloom. At the time, the fairy of a hundred flowers, ruler of all flowers in the celestial realm, goes on a personal visit to Maku, another fairy. In her absence, her subordinate fairies in response to the decree, take the initiative of blooming on their own. The Jade Emperor, the ruler of all the heavens, noting this subordination, punishes the fairy of a hundred flowers. He forces her to reincarnate in the human world. She reincarnates as the daughter of Tang Ao. Strange and Fantastic Lands: Previously, Tang Ao, an aspiring bureaucratic scholar, took the official scholars examination, and had passed the exam, gaining an exalted official title. However, because of his association with a failed coup against the Empress Wu, his title is revoked. Despairing and disillusioned with the scholarly bureaucracy, Tang boards a sailboat, and with his brother-in-law, Merchant Lin, and a hired sailor \"Old Tou.\" The three travelers sail on the open sea and visit various fantastic and strange countries. They also encounter a variety of bizarre characters: First is the country of \"the gentlemen.\" Merchants there try to sell their best quality goods at the cheapest price while customers haggle and to pay more for merchandise. In the country of \"the Giants,\" virtuous people have rainbows under their feet. Wicked people have dark clouds under their feet. The government officials of this country cover their feet with multicolored robes cover so no one can tell if they have rainbows or clouds under their feet. In the \"two faced kingdom,\" people have two faces; one in the front and one in the back. The faces in front are smiling, and the faces in the back are ugly. The people of this kingdom are deceptive. Another country has only people who always lie, and never tell the truth. There are many other such strange countries. The first half of the book describes the adventures of Tang Ao and his companions as they travel overseas by boat.",
  "genres": [
    "China",
    "Fiction",
    "Classics",
    "Fantasy",
    "Feminism",
    "Literature",
    "Asian Literature"
  ],
  "author": "Li Ruzhen",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/26509006-flowers-in-the-mirror"
}