{
  "title": "Prison Industrial Complex For Beginners",
  "description": "Prison Industrial Complex For Beginners is a graphic narrative project that attempts to distill the fundamental components of what scholars, activists, and artists have identified as the Mass Incarceration movement in the United States. Since the early 1990s, activist critics of the US prison system have marked its emergence as a \"complex\" in a manner comparable to how President Eisenhower described the Military Industrial Complex. Like its institutional \"cousin,\" the Prison Industrial Complex features a critical combination of political ideology, far-reaching federal policy, and the neo-liberal directive to privatize institutions traditionally within the purview of the government. The result is that corporations have capital incentives to capture and contain human bodies. The Prison Industrial Complex relies on the \"law and order\" ideology fomented by President Nixon and developed at least partially in response to the unrest generated through the Civil Rights Movement. It is (and has been) enhanced and emboldened via the US \"war on drugs,\" a slate of policies that by any account have failed to do anything except normalize the warehousing of nonviolent substance abusers in jails and prisons that serve more as criminal training centers then as redemptive spaces for citizens who might re-enter society successfully. Prison Industrial Complex For Beginners is a primer for how these issues emerged and how our awareness of the systems at work in mass incarceration might be the very first step in reforming an institution responsible for some of our most egregious contemporary civil rights violations.",
  "genres": [
    "Nonfiction",
    "Race",
    "Politics",
    "Graphic Novels Comics",
    "History",
    "Crime",
    "Business"
  ],
  "author": "James Braxton Peterson",
  "average_rating": "4.29",
  "url": "https://www.goodreads.com/book/show/26494216-prison-industrial-complex-for-beginners"
}