{
  "title": "The Ecology of Law: Toward a Legal System in Tune with Nature and Community",
  "description": "WINNER OF THE 2015 IBPA BENJAMIN FRANKLIN AWARD IN POLITICS/CURRENT EVENTSThe Ecology of LawFritjof Capra and Ugo Mattei argue that at the root of many of the environmental, economic, and social crises we face today is a legal system based on an obsolete worldview. Capra, a bestselling author, physicist, and systems theorist, and Mattei, a distinguished legal scholar, explain how, by incorporating concepts from modern science, the law can become an integral part of bringing about a better world, rather than facilitating its destruction.This is the first book to trace the fascinating parallel history of law and science from antiquity to modern times, showing how the two disciplines have always influenced each other—until recently. In the past few decades, science has shifted from seeing the natural world as a kind of cosmic machine best understood by analyzing each cog and sprocket to a systems perspective that views the world as a vast network of fluid communities and studies their dynamic interactions. The concept of ecology exemplifies this approach. But law is stuck in the old mechanistic paradigm: the world is simply a collection of discrete parts, and ownership of these parts is an individual right, protected by the state. Capra and Mattei show that this has led to overconsumption, pollution, and a general disregard on the part of the powerful for the common good.Capra and Mattei outline the basic concepts and structures of a legal order consistent with the ecological principles that sustain life on this planet. This is a profound and visionary reconceptualization of the very foundations of the Western legal system, a kind of Copernican revolution in the law, with profound implications for the future of our planet.",
  "genres": [
    "Law",
    "Philosophy",
    "Nonfiction",
    "Science",
    "Environment"
  ],
  "author": "Fritjof Capra",
  "average_rating": "3.92",
  "url": "https://www.goodreads.com/book/show/26485636-the-ecology-of-law"
}