{
  "title": "Breathe Deeply My Son",
  "description": "11th Edition Reviews 'This book is an epic account of physical strength, low cunning, pluck, luck and an indomitable will to live.'  The Independent on Sunday'At first, he recoils from trying to convey the extremity of anguish, the enormity of what really happened in situations unimaginable to anyone except the participants...  Wermuth's Claim to fame is that he had the opportunity to assassinate Hitler, which he did his best to take...'  The Jewish Chronicle'As well as a heartbreaking diary it is a manual of survival skills...'  Daily Telegraph Magazine'The Author has the emotional strengths to let the reader enter into the happenings and, with great accuracy, he is also capable to portray the often unintelligible thoughts and deliberations that Jews harboured during the Holocaust'  Frankfurter Allgemeine ZeitungFrom readers' letters:'Danielle and I were wholly involved by you in your account...I am sure you have succeeded in making the whole shattering and almost incredible chain of events, including the effectiveness of the Nazi policy of extermination, slightly more comprehensible. For that we, and no doubt all your readers, are deeply grateful to you.'  Sir John Lyons - Trinity College, Cambridge'We read many books of Survivors, but never anything like Henry's story. We could not think and speak of anything else for days.'  Professor Jan Bruell - Austin University, Texas  To Prof. K. Benyamini, Jerusalem University'The fact that so many students have bought your memoir speaks for itself. I have included your book and seminar on the timetable for the next year.'  Dr. Brian Cheyette - London University'I also read 2-3 books each week and have a library of over 1000 volumes... Your book is possible one of the best books of one persons experience that I have read'  Benjamin M. Nachman DDS - USA",
  "genres": [
    "Holocaust"
  ],
  "author": "Henry Wermuth",
  "average_rating": "4.51",
  "url": "https://www.goodreads.com/book/show/26491982-breathe-deeply-my-son"
}