{
  "title": "Possession Point, Premiers carnets de route d'Anis W.",
  "description": "“ Tes iris à toi, mon ange, avaient la couleur de la mer avant l’orage, aux rives d’Half Moon Bay. Toutes les Mavericks de Pillar Point y écrivaient en germes les promesses que tu tenais. Je roule parfois jusque là-bas pour jeter un sucre au manque qui me tient dans ses tenailles. Je marche de Ghost Trees à Half Moon Bay. Pour regarder les vagues, de peur d’oublier tes yeux. Quelque part entre les fantômes des arbres et le meurtrier Pillar Point, assise à même la poudre de mon sablier, je bois cette couleur. Je la respire, pendant qu’elle reflue et déferle. J’essaye, une fois encore, d’élucider la technologie de ce mystère. De comprendre comment le monde des hommes transforme la couleur des Mavericks en cadrans d’horloges. Comment le rythme des vagues immenses a pu s’enrouler pour devenir, dans tes yeux, ce cercle de métal auquel j’ai donné un tour ou deux, jadis. C’était un rouage. Mais tout autant, je le sais bien, la face implacable d’un barillet.”Dans un monde transfiguré par le retour de la Féerie, Anis a pris la route, à la recherche d’une cité légendaire dont on dit qu’elle ne se laisse trouver qu’à son gré : Frontier. C’est dans la “ville au bord du monde”, patrie des fays, que vit à présent l’homme qu’elle a aimé, et trahi : Jay, membre du redoutable gang changeling de Seattle. À travers leur histoire, feuilletée comme un album photo depuis le jour de leur rencontre jusqu’à celui de leurs hypothétiques retrouvailles, c’est la vie de tous les Premiers qui se dévoile, durant les années précédant et suivant directement la fondation de l’utopie que fays & fées nomment Le Seuil. *LS tisse les récits des fays de Frontier depuis 1998. Elle a pris définitivement résidence auprès des ‘coucous’ depuis dix ans, avec le recueil Musiques de la Frontière, (Prix Imaginales 2005). Possession Point est son quatrième roman.",
  "genres": [
    "Urban Fantasy"
  ],
  "author": "Léa Silhol",
  "average_rating": "4.78",
  "url": "https://www.goodreads.com/book/show/26516582-possession-point-premiers-carnets-de-route-d-anis-w"
}