{
  "title": "Forbidden Passion",
  "description": "Sexy billionaire Jacob Rinaldi needs a new submissive. He does not have romance in mind. Lovely, aspiring actress, Vivienne Lake captivates him from the first moment. But she thinks he is rude and arrogant. Yet also, sexy as sin.Despite being wrong for each other, one passionate encounter leads to another. Jacob discovers that dominating Vivienne is more of a challenge that he anticipated. Will she enter his forbidden world? Will he let her?Excerpt:“The scent of lilac and rose wafted over Jacob like a drug. He looked into Vivienne’s green eyes, willing his desire under control. When she took his hand, the feel of her soft skin inspired him, and Jacob bowed to kiss her knuckles.The gesture was a little foolish. He was no knight in shining armor. Vivienne squeezed his hand and looked into his eyes. This woman was really getting to him. Jacob sensed a note of challenge in her expression. He had taken care not to reveal emotion, and didn’t see how Vivienne could know what he felt.Yet there was an instant connection. The look in her eyes teased him, dared him to go further if he was brave enough. That was unexpected. Vivienne may not be the type to fall at his feet and do as he commanded. But it didn’t dissuade Jacob. For some inexplicable reason, he wanted her even more. He needed to get a grip if he had any hope of maintaining control.”Series Description:Forbidden Passion is the first book in the Bend To My Will series, a Rinaldi Romance that unfolds over a series of novellas. Jacob Rinaldi made his fortune in wine importing, and he travels the world. He is a billionaire with his choice of women, but is obsessed with having Vivienne Lake. This is a steamy romance with bdsm elements. Throughout this hot love story, Jacob faces the darkness that threatens to engulf him. And Vivienne learns the joy of submission, while teaching Jacob that love isn’t out of reach.",
  "genres": [
    "BDSM",
    "Romance",
    "Erotica",
    "Novella"
  ],
  "author": "Emily Jane Trent",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/26521350-forbidden-passion"
}