{
  "title": "A Mate for Gideon",
  "description": "Standalone Vampire Novel  Have you ever wanted to date a vampire? Human women required. Must be enthusiastic about interactions with vampires. Must be willing to undergo a stringent medical exam. Must be prepared to sign a contractual agreement which would include a non-disclosure clause. Limited positions available…  Jenna has a few skeletons in her closet. One of which is tall, dark and gorgeous. He also happens to be a vampire with a grudge against her. She’s made mistakes and has done things she’s not proud of. The time has come to take charge of her life. The opportunity to do just that comes along in the form of an acceptance into the infamous vampire program.  Would she like to date a vampire? Hell yes!  But not just any vampire, her vampire. That is, if he’ll ever forgive her. With such a dark past, she worries whether she’ll ever be able to confront him and in so doing, bear her soul to him. It would kill her to see the disgust and contempt in his eyes when he finds out... her heart clenches and her eyes mist at the thought.  Gideon is almost brought to his knees, when he realizes, that Jenna is one of the females that’s taking part in the dating program.  His Jenna. No! Not his. Not anymore.  What the hell is she doing here? With all he knows about her, there’s no way that she was able to meet all the minimum criteria required for acceptance. Not a damned chance! He’s not interested in her… or any human female for that matter. That said, he also refuses to just stand by and watch her get seduced by one of the victorious ten, elite males. His only option is to find a way to expose her as the deceptive female that she is.   The story contains strong sexual themes/language and is not intended for readers under the age of 18.  Although this is a standalone novel, it would be best enjoyed as a part of the series. No cliffhanger!",
  "genres": [
    "Paranormal",
    "Vampires",
    "Paranormal Romance",
    "Romance",
    "Fantasy",
    "Erotica",
    "Shapeshifters"
  ],
  "author": "Charlene Hartnady",
  "average_rating": "4.19",
  "url": "https://www.goodreads.com/book/show/26525761-a-mate-for-gideon"
}