{
  "title": "The Mindfulness Edge: How to Rewire Your Brain for Leadership and Personal Excellence Without Adding to Your Schedule",
  "description": "Imagine that you could transform activities that are normally thought of as “wastes of time” into some of the most productive moments of your day, allowing you to rewire your brain in ways that help you make better business decisions, improve your people skills, and become more innovative, while also realizing greater happiness. Cutting edge research in neuroscience suggests you can. In The Mindfulness Edge, you'll discover how a subtle inner shift, called mindfulness, can transform things that you already do every day into opportunities to become a better leader. This book brings together training programs presented to Fortune 500 companies, universities, and other organizations around the world to present a complete, self-guided process that enables you to systematically train to improve self-awareness and mental agility. Step-by-step guidance for applying mindfulness to break free from conditioned ways of behaving and making decisions gives you the keys to both better business acumen and emotional and social intelligence, which allows you to create and sustain high-performance team cultures. You’ll learn how to quickly and seamlessly integrate mindfulness training into your daily life and easy-to-understand insight into the neuroscience behind it. Every chapter includes review questions to reinforce covered material and accelerate progress toward mastering the most important element of professional and personal success: your mind. In this book, you'll learn how mindfulness training helps you:- Quickly improve business acumen and your impact on the bottom line- Become more innovative and attract/retain innovative team members- Develop the emotional intelligence essential for creating and sustaining a winning culture- Realize the extraordinary leadership presence that inspires greatness in others- Realize happiness during even the most simple, mundane moments of your dayWhether you’re brushing your teeth, waiting for the train, or walking to the office, The Mindfulness Edge will help you take advantage of each moment to gain a significant competitive edge and more fully enjoy your life.",
  "genres": [
    "Leadership",
    "Nonfiction",
    "Brain",
    "Philosophy",
    "Self Help",
    "Psychology"
  ],
  "author": "Matt Tenney",
  "average_rating": "4.02",
  "url": "https://www.goodreads.com/book/show/26535670-the-mindfulness-edge"
}