{
  "title": "Druids of the Faerie: Gather the Champions",
  "description": "Young Baytel, overshadowed by his imperious father, King Vokat, and by his increasingly demonic twin brother, Ravek, is being tutored by a Tree Faerie, Cyr. Fueled with idealistic courage and no knowledge of the land outside his father's realm, Baytel abandons his birthright and duties and begins a journey to fulfill the destiny he senses within himself. His quest leads him to become a Citadel Druid, skilled in the healing arts and self-reliance. He devotes himself to enabling peaceful coexistence among the many sects of humanity who inhabit the One Land. All of this is in grave conflict with his father's and brother's plans of conquest. Through mysteries and battles that leave him severely at odds with his father's ideas of domination, Baytel's quest leads him to learn of his grandfather he had never met, his ancestry in a powerful sect, and a magic of the ages emerging within him. His adventures unite him with a group of men and women with particular individual skills and resourcefulness. To bring peace requires violent counter-action, brilliant quick thinking, steadfastness, a bit of humor, and magical happenings, all enveloped in their devotion to the quest and the ripening of friendships. Baytel's globe is breathtakingly real, in an era of castles, blacksmiths, pulsing forests and swamps, magic and spirits, self-sustaining villages, and diverse beings and creatures--a living earth with individuals of honor and evil. Lewis G. Gazoul has always enjoyed wilderness hiking, hunting and camping. The astonishing wonders of the outdoors became the context for a short bedtime story he whispered to his two children. Later, during an especially slow day at work, Lewis wrote that adventure episode onto a piece of paper, and from that page grew his vision for an entire, vast inhabited, mystical and wondrous land, which is the setting for this book. The still-evolving land and story remain true to the tale that enchanted his children, allowing their imaginations to flourish. Lewis makes his home with his family in the City of Grosse Pointe, Michigan.",
  "genres": [],
  "author": "Lewis G. Gazoul",
  "average_rating": "4.10",
  "url": "https://www.goodreads.com/book/show/26542714-druids-of-the-faerie"
}