{
  "title": "Nightshade",
  "description": "17 original stories by some of today's bestselling urban fantasy authors.  The Agency-Donna Augustine: Before Karma joins the agency, she’s just another assignment handed to Fate from the Universe. But she’s destined to become more than that.  De Facto-Annie Bellet: Verity Li’s just a bureaucratic cog, going through the motions until she interrupts a kidnapping next door, and now all the problems are hers.  Venom-Sarra Cannon: On the run from a coven of witches determined to capture and enslave him, Rend must overcome the limitations of the human world and embrace his true demon power. But will he survive?  Honeysuckle Memory-Selene Charles: Scarlett Smith’s on a mission to track down the man who sentenced her to an eternity of purgatory, but first she needs to pass the mental health assessment board of the paranormal investigative department.  Spirits of Bourbon Street-Deanna Chase: It’s Halloween and time to party, but when a spirit traps everyone in the past, white witch Jade Calhoun’s forced to forgo the cocktails in order to save those she loves.  The Ghost & Mrs. MacKay-Kate Danley: It's Halloween and Maggie's mother has invited all the ghosts of the neighborhood over for a party. Unfortunately, one of the ghosts is wanted by the Other Side's finest. It’s up to Maggie and Killian to find out what caused this soul's unrest and return him to his happy haunting ground.  Full Moon Mischief-Debra Dunbar: Getting summoned on Halloween isn't any demon's idea of fun especially when yanked from a rocking party into a coat closet. But rules are rules and Imp Sam must find a way to get rid of a gold-digger hussy then hope the pint-sized mage sends her back before the party’s over.  Dog Days of Summer-Hailey Edwards: When a fae boy goes missing, Thierry is called to lead the hunt for the rogue. But the closer she gets to locating the boy, the further she gets from the truth.  Victoria Gardella: Vampire Slayer-Colleen Gleason: Balls, beaux, dance cards....and stakes? Lady Victoria Gardella must juggle her responsibility as a debutante in 19th century London Society while fulfilling her family legacy as a vampire hunter.  Atomic-C. Gockel: Sigyn is prophesied to be the consort of a king. Instead she marries a fool. Centuries after his chaos destroys their marriage, the fallout begins .  Highland Magic-Helen Harper: The Veil has kept the Highlands of Scotland free from demons for centuries, and ensured relative peace for the Sidhe Clans. However, a strange encounter on a dark, heather-strewn hillside might mean all that is about to change.  Contents May Have Shifted-Shawntelle Madison: Return to the Coveted universe in this tale featuring werewolf Natalya Stravinsky. Two werewolf shopkeepers in a mystical flea market encounter deadly merchandise that has no intention of being sold.  Illusions-Christine Pope: Warlock Damon Wilcox is plotting to kidnap the most powerful witch in a rival clan. But Damon’s brother Connor has plans of his own.  Dying Night-SM Reine: Hell’s trying to squeeze its way onto Earth via the Grand Canyon. Elise and James, a demon hunting team, haven’t spoken about that thing that happened in Copenhagen for six months. With all the pressure boiling under the surface, something's sure to blow.  Brea's Tale: Arrival-Anthea Sharp: When a faerie girl is sent on a mission to the mortal world, she must learn to navigate the intricacies of life among humans - but will she survive undetected?  Angels and Demons-Colleen Vanderlinden: A mysterious woman haunts the streets of Detroit, dishing up her own version of vigilante justice.Dragon's Fury -Phaedra Weldon: A tragic part of Crwys Holliard's past is revealed when his lover becomes a target in a serial killer's vendetta against women who have crossed Crwys's path. Unfortunately, this also makes Crwys the prime suspect in their deaths.",
  "genres": [],
  "author": "Donna Augustine",
  "average_rating": "3.93",
  "url": "https://www.goodreads.com/book/show/26546695-nightshade"
}