{
  "title": "Big Green Purse: Use Your Spending Power to Create a Cleaner, Greener World",
  "description": "Read Diane McEachern's posts on the Penguin Blog.Protecting our environment is one of the biggest issues facing our planet today. But how do we solve a problem that can seem overwhelming-even hopeless? As Diane MacEachern argues in Big Green Purse , the best way to fight the industries that pollute the planet, thereby changing the marketplace forever, is to mobilize the most powerful consumer force in the world-women.MacEachern's message is simple but revolutionary. If women harness the \"power of their purse\" and intentionally shift their spending money to commodities that have the greatest environmental benefit, they can create a cleaner, greener world. Spirited and informative, this book:- targets twenty commodities-cars, cosmetics, coffee, food, paper products, appliances, cleansers, and more-where women's dollars can make a dramatic difference;- provides easy-to-follow guidelines and lists so women can choose the greenest option regardless of what they're buying, along with recommended companies they should support;- encourages women to spend wisely by explaining what's worth the premium price some green products cost, what's not, and when they shouldn't spend money at all; and- differentiates between products that are actually \"green\" and those that are simply marketed as \"ecofriendly.\"Whether readers want to start with small changes or are ready to devote the majority of their budget to green products, MacEachern offers concrete and immediate ways that women can take action and make a difference. Empowering and enlightening, Big Green Purse will become the \"green shopping bible\" for women everywhere who are asking, \"What can I do?\"",
  "genres": [
    "Nonfiction",
    "Sustainability",
    "Reference",
    "Environment",
    "Green"
  ],
  "author": "Diane MacEachern",
  "average_rating": "3.89",
  "url": "https://www.goodreads.com/book/show/2654672-big-green-purse"
}