{
  "title": "The Lady with an Ostrich-Feather Fan: The Story of the Yusupov Rembrandts",
  "description": "In 1660, in the darkest depth of his personal problems and at the height of his artistic abilities, REMBRANDT paints the portraits of a Dutch couple about to be married. ANNEKE, an unwed mother, hopes her imminent wedding to HENRYK, the child’s sea-captain father, will remove the condemnation of church and society and she will finally find security, respect, and home. But, before the paint is dry, Anneke suffers an accident and drowns in an icy Amsterdam canal, leaving her daughter to the care of the sea-captain father and her thoughts and secrets locked in a leather journal. Following is a journey through trials and victories as Anneke’s lineage of committed mothers and daughters and their men dedicate their lives to save and hold the great paintings, symbols of their family dignity and pride. The characters protect the Rembrandts through the decline of Holland’s Golden Age, the visit of Peter the Great, and the chaos of the French Revolution where they escape with a Russian prince to Saint Petersburg and into the palace and collection of the richest family in czarist Russia, the Yusupov family. Rescued from the ravage of Napoleon’s assault of Russia, they return to the security of the famed Moika Palace. Saved by a successor countess from the turmoil of the Russian Revolution and in the wake of the palace murder of the decadent Rasputin, the paintings are taken to safety by the murderer, the disguised PRINCE FELIX YUSUPOV and later his wife, the PRINCESS IRINA, in a daring escape. The destitute Prince and Princess Yusupov arrive in London and sell the paintings to the American millionaire collector JOSEPH WIDENER under contestable conditions. Prince Yusupov sues to regain ownership of the Rembrandts. Their destiny falls to the mercy of the Supreme Court of New York in the most famous and contentious art lawsuit in American legal history. Finally, the portraits are gifted by the rich, but socially disillusioned, Widener to The National Gallery of Art in Washington where, in 1942, a couple from the exiled Dutch government, the woman a direct descendant of the lady in the portrait, view the Rembrandts, satisfied the paintings have finally found their home. Opening the ancient leather journal she reads the thoughts and secrets of her ancestor ending in the eternal truth, “Home, we know, is not a place; it is where we belong to each other.” The Rembrandt portraits, known as Portrait of a Lady with an Ostrich-Feather Fan and Portrait of a Gentleman with Tall Hat and Gloves hang permanently today in The National Gallery of Art, Washington, DC.",
  "genres": [
    "Historical Fiction"
  ],
  "author": "Frederick R. Andresen",
  "average_rating": "3.82",
  "url": "https://www.goodreads.com/book/show/26534913-the-lady-with-an-ostrich-feather-fan"
}