{
  "title": "Michael Kohlhaas: A Tale from an Old Chronicle",
  "description": "\"Michael Kohlhaas\" is a novella written by famed writer Heinrich von Kleist (1777-1811). The story is based upon the historical figure of Hans Kohlhase, a 16th century merchant who turned violent after being attacked and victimized by the authorities. As a result, he gathered around him a band of criminals and spread terror throughout the whole of Saxony. --- \"The novella is a good example of Kleist's excellent narrative art: The action can be summed up in a few words, such as the formula for this story, given expressly on its first page: 'His sense of justice made him a robber and a murderer.' There is no leisurely exposition of time, place, or situation; all the necessary elements are given concisely in the first sentences. The action develops logically, with effective use of retardation and climax, but without disturbing episodes; and the reader is never permitted to forget the central theme. The descriptive element is realistic, with only pertinent details swiftly presented, often in parentheses, while the action moves on. The characterization is skilfully indirect, through unconscious action and speech. The author does not shun the trivial or even the repulsive in detail, nor does he fear the most tragic catastrophes ... The whole work in all its parts is firmly and finely forged by a master workman. --- Kleist has remained a solitary figure in German literature. Owing little to the dominant literary influences of his day, he has also found few imitators. Two generations passed before he began to come into his heritage of legitimate fame. Now ... his place is well assured among the greatest dramatic and narrative authors of Germany.\" (John S. Nollen)",
  "genres": [
    "Classics",
    "Fiction",
    "German Literature",
    "Germany",
    "Literature",
    "Historical Fiction",
    "19th Century"
  ],
  "author": "Heinrich von Kleist",
  "average_rating": "3.55",
  "url": "https://www.goodreads.com/book/show/2655010-michael-kohlhaas"
}