{
  "title": "Nothing Personal, Just Business: A Guided Journey into Organizational Darkness",
  "description": "Throughout the United States and indeed the world, organizations have become places of darkness, where emotional savagery and brutality are now commonplace and where psychological forms of violence--intimidation, degradation, dehumanization--are the norm. Stein succeeds in portraying this dramatically in his evocative, lucid new book, and in doing so he counters official pronouncements that simply because unemployment is low and productivity high, all is well. Through the use of symbolism and metaphor he gives us access to the interior experience of organizational life today. He employs a form of disciplined subjectivity, based on Freud's concept of counter-transference, and other methods to help us comprehend what such dominating notions as managed social change really mean. Downsizing, reengineering, managed care, endless organizational restructuring--all are presented as just business but in reality, says Stein, they are devastatingly personal in their effects. With numerous vignettes and anecdotes drawn from his formal and informal research, Dr. Stein shows us in often horrifying detail what work has come to be in so many of these dark places--but also what must happen, and can happen, to lift them into the light.Through consultations, observation, and personal experience, Stein documents the ordinary assaults on the human spirit, a form of violence in the workplace that usually escapes common classification. By that he means culturally sanctioned violence, such as everyday forms of intimidation, ridicule, goading, and doubling of workloads--all in an asserted effort to make the workplace more productive, more competitive. His examples, metaphors, symbols, images come from the Holocaust and the Vietnam War, and refer back to other horrors in other times, the Crusades and the Spanish Inquisition among them. His book demonstrates precisely how brutal so many of our rational business practices have become, and how disposable all of us ultimately are, at all levels, in all organizations. Stein draws upon a variety of research techniques, including a form of counter-transference based on Freud's concept, to understand the inner meanings and feelings contained in workplace metaphors and symbols. An incisive foreword by Dr. David B. Friedman, Associate Clinical Professor of Psychiatry at the New York University School of Medicine, comments on this, puts the book in perspective and offers additional insights into Stein's themes and how brilliantly he develops them.",
  "genres": [],
  "author": "Howard F. Stein",
  "average_rating": "3.40",
  "url": "https://www.goodreads.com/book/show/265487.Nothing_Personal_Just_Business"
}