{
  "title": "Druids of the Faerie: Baytel and the Goblin Horde",
  "description": "Remaining steadfast to their quest to bring peace to the One Land, the Druid Baytel and his varied companions are tested against unexpected forces as well as horrific flying goblins dispatched by Baytel's twin brother, Prince Ravek. Meanwhile, the master Tree Faerie, Yar, is being hunted by these horrific creatures and Baytel's grandfather, Calidor, pursues the creatures into the uncharted eastern lands where a struggle of might and magic could tear the One Land apart. Dread and treachery stalk Baytel and his allies. A massive army led by a traitor member of the Citadel threatens to ruin Baytel's courageous efforts. And the land itself trembles anxiously. Yet with the growing realization that Baytel is a descendant of a legendary magical sect of warriors, the fiefdoms and kingdoms of the north unite to follow him through the blistering cold winter months toward his homeland, the castle that now throbs with evil. As Baytel learns to reconcile anxiety with determination, wariness with trust, and impulse with wisdom, he and his companions and allies push tensely toward an all-out battle with the powerful dominating forces assembled by his father and brother. Lewis G. Gazoul has always enjoyed wilderness hiking, hunting and camping. The astonishing wonders of the outdoors became the context for a short bedtime story he whispered to his two children. Later, during an especially slow day at work, Lewis wrote that adventure episode onto a piece of paper, and from that page grew his vision for an entire, vast inhabited, mystical and wondrous land, which is the setting for this book. The still-evolving land and story remain true to the tale that enchanted his children, allowing their imaginations to flourish. Lewis makes his home with his family in the City of Grosse Pointe, Michigan.",
  "genres": [],
  "author": "Lewis G. Gazoul",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/26542721-druids-of-the-faerie"
}