{
  "title": "An Autobiography: The Story of My Experiments with Truth",
  "description": "It is not my purpose to attempt a real autobiography. I simply want to tell the story of my numerous experiments with truth, and as my life consists of nothing but those experiments, it is true that the story will take the shape of an autobiography....Identification with everything that lives is impossible without self-purification; without self-purification, the observance of the law of Ahimsa must remain an empty dream; God can never be realised by one who is not pure of heart. Self-purification, therefore, must remain purification in all walks of life. And purification being highly infectious, purification of oneself necessarily leads to the purification of one's surroundings.But the path to self-purification is hard and steep. To attain perfect purity, one has to become absolutely passion-free in thought, speech and action; to rise above the opposing currents of love and hatred, attachment and repulsion. I know that I have not in me as yet the triple purity, in spite of constant ceaseless striving for it. That is why the world's praise fails to move me; indeed it very often stings me. To conquer the subtle passions seems to me far harder than the physical conquest of the world by the force of arms. Ever since my return to India, I have had experiences of the dormant passions lying hidden within me. The knowledge of them has made me feel humiliated though not defeated. The experiences and experiments have sustained me and given me great joy. But I know I still have before me a difficult path to traverse. I must reduce myself to zero. So long as a man does not of his own free will put himself last among his fellow creatures, there is no salvation for him. Ahimsa is the farthest limit of humility.Mohandas Karamchand Gandhi,26 November, 1925.",
  "genres": [
    "Biography",
    "Nonfiction",
    "History",
    "Autobiography",
    "India",
    "Philosophy",
    "Memoir"
  ],
  "author": "Mahatma Gandhi",
  "average_rating": "4.10",
  "url": "https://www.goodreads.com/book/show/2656458-an-autobiography"
}