{
  "title": "Omega Born",
  "description": "Arri had been abused and picked on all his life. Born a runt, and then maturing into an omega, he was cast out of his pack. Figuring he’d not find another pack willing to take him in, he struggled to make a life for himself in the human world. If he didn’t have bad luck, he had no luck at all. Jobs were hard to come by, and he wasn’t able to keep them for long, his omega empathy causing humiliating meltdowns. He’d been robbed, mugged, and nearly raped too many times to count. Arri’s wolf was fundamentally broken, with no way to emerge, or protect him, finally withdrawing deep within him and remaining silent. Then, a day came when things changed. Answering yet another employment ad, he was stunned to find the source of the advertisement was a beta wolf, then was shocked further when he was presented before the alpha of the Woodlynn pack. He’d heard rumors about this pack, the alpha considered one of the strongest on the continent. He believed the rumors after meeting the large male. Arri’s silent wolf had awakened, whispering to him, calling the alpha, mate, which was ridiculous. Alphas didn’t mate with lowly omegas. Especially male omegas, even though Arri was perfectly capable of giving an alpha pups, or so he’d been told by the old ex-beta he’d befriended. But then again, male omegas were rare, and thought little of, viewed as weak, considered unnatural. So, he would ignore his wolf, do his job, and keep his head down, not causing Alpha Dryden any cause to fire him. *~*~*~* Dryden knew there was something different about the assistant his beta, Vann, had brought to him. He was human, yet he smelled of wolf. But not a scent Dryden had ever experienced before. Vann hadn’t seemed to notice, though Dryden suspected his beta was still angry at Dryden insisting on a human assistant. How could he tell his beta he’d felt an uneasiness in his pack, a danger that he couldn’t put his finger on, and didn’t want to trust any pack-mates to handle his affairs? As time passed, his instincts that something was wrong within his pack grew, along with the certainty that Arri was not what he seemed. It was when Dryden was visiting another pack, tremulous negotiations for an alliance in the works, and Arri was attacked, that the truth came out. Dryden’s assistant was an omega wolf. And not just any omega, but a Fae Omega, which would be the reason Dryden hadn’t known. Omega wolves were rare, and most packs banished them for their weaknesses. But a Fae Omega was unheard of, most believing them myths. The Fae had died out a long time ago, and for an omega wolf to be born with Fae blood was incredible. But that wasn’t Dryden’s biggest problem. The moment Arri had shifted, Dryden’s wolf went into the blood-mate fever, the need to claim the omega the only thing he was capable of thinking about. But to claim Arri, Dryden would have to fight the alpha of Arri’s home pack, and he wasn’t sure he could win. And, then there was the unknown threat within his own pack that he still needed to figure out.",
  "genres": [
    "M M Romance",
    "Paranormal",
    "Shapeshifters",
    "Romance",
    "Abuse",
    "Werewolves",
    "Fantasy"
  ],
  "author": "C.R. Guiliano",
  "average_rating": "3.71",
  "url": "https://www.goodreads.com/book/show/26568624-omega-born"
}