{
  "title": "Taboo: Taking Instruction / Taking on the Law / Taking the Job / Taking it Personal",
  "description": "Taboo - Taking Instruction By Cheyenne McCray Taboo series.Jessica Grayson is a college freshman who's had the hots for her university professor all year long. He's sexy and unobtainable and she's determined to get into his bed. Dating one of his own students is taboo and Craig Bennett intends to never break that school rule... Until he finds an end-of-the-semester present in his office the gorgeous co-ed he hasn't been able to keep off his mind. And she's naked, sitting on his desk. It isn't long before Jessica discovers she's gotten more than she bargained for. She finds out exactly who's in control as she learns how the professor likes to play. A whole new world of BDSM is opened up to her and being a bad girl never felt so good.Taboo - Taking On the Law By Cheyenne McCray Taboo series.Erin Wilson has had the day from hell, which includes catching her boyfriend and her best friend having an affair. On top of that, she's stopped by a cop who turns out to be the high-school sweetheart she dumped when they graduated. But things go from cold to hot real fast. On the side of the road. Against her car. Blue and red lights flashing. What happens is taboo, a line Dave Bennett never dreamed he would cross. Yet he can't believe his luck. The All-American girl he'd fallen in love with years ago is now at his mercy in more ways than one. He has a very special jail cell and some handcuffs just for her, not to mention a few other naughty surprises. A little time behind bars might be all Erin needs to convince her to put herself in his protective custody forever.Taboo - Taking the Job By Cheyenne McCray Taboo series.Software design consultant Elsie Meyers schedules an interview for a position at Bennett Consulting but a rainstorm, a spilled purse and a chance encounter with a steaming hunk she met under very compromising circumstances a few months ago change that interview into an outright erotic fantasy. From the moment John Bennett spots Elsie and remembers where he first met her, he knows she would make a perfect submissive. When she drops her briefcase and a flogger tumbles out, the interview takes a whole different turn, into taboo territory. The beautiful redhead is in between Doms and John is in between subs. In a sensual encounter John finds himself offering Elsie a different position, then discovers he'd like to make that position permanent and convince Elsie to take it. Taboo - Taking It Personal By Cheyenne McCray Taboo series.Sarah Fairland gets what she wants in business and in private. What she wants is Drew Bennett, her personal trainer, and she intends to have him. Drew is attracted to the confident, intelligent Sarah. Despite the sexual vibes between them, he's kept their training sessions professional until now. During a private training session, Drew breaks a taboo, taking Sarah to sexual heights in a room where they could be interrupted any moment. He leaves her hanging for more...and confused at her response to his dominance. A gift with a daring note convinces her to come to his home where he teaches her the freedom and strength that comes from turning over sexual control to him. Drew's not finished, though. Control of Sarah's heart is next.",
  "genres": [
    "BDSM",
    "Erotica",
    "Contemporary",
    "Romance",
    "Contemporary Romance",
    "Anthologies"
  ],
  "author": "Cheyenne McCray",
  "average_rating": "3.71",
  "url": "https://www.goodreads.com/book/show/2656326-taboo"
}