{
  "title": "The Lion, the Legend and the Coal-Miner's Daughter: the biography of a brief fling",
  "description": "Some people come into our lives and change nothing; they are simply sojourners travelling along, admiring the view. Then others come and blow in a hurricane of change, opening up doors of choice that can bring joy or destruction. So it was with Anne Mayhew and Eric Clapton. What should have been a youthful infatuation and an exciting journey into the life of the guitar player, turned into the biggest nightmare a mother could ever experience – the loss of her children. His life moved on like a feather in a gentle breeze, hers crashed like a fallen big wheel in a glittering fair ground.In the late seventies Eric Clapton was experiencing a low ebb in his life. He was facing a divorce from his wife Patti and had realised that Lori, the mother of his son was not the woman for him. He consoled himself with fishing and cricket and it was at Edgbaston in 1987 where he met someone who had never heard of him – a young North-Eastern mother. Their working class backgrounds brought them spontaneous ease with one another and very soon the guitar player, who had never had a proper job, and the coal-miner’s daughter were inseparable. But only for a summer and summers end.Paul Scott (author of Motherless Child, Clapton’s latest biography) called it a ‘brief fling’. For Anne, there was nothing brief about it. The ramifications of crossing Eric’s path spun off into eternity. Yet, it could be construed as a fling – flinging her and her children into a destiny that only hell could have conjured up. The big wheel of fortune showed little mercy. With God on her back she enters into the maze of religious fanaticism hoping to find mercy, forgiveness and understanding within the warmth of the church, only to discover that maybe... the devil dwells there too.Anne Mayhew, twenty-eight years later, shares the continuous journey of her life after the legend crossed it and unwittingly left her to pick up the pieces of eternal debris. Her eldest son prompts, “Mom, it’s time…” This is the moment Anne has been dreading all of her life – the truth... her truth. How do you tell your first child that an ex-lover replaced God, and the illusion of glamour replaced him? He was six years old and his brother was four when fate decided it was time for the small family to face a tsunami of change. When mothers lose their children, no matter the circumstance, madness will follow, but sometimes that’s exactly what’s needed for survival.A true and intimate account of milestones in a personal journey from hell to heaven, lost to found, wreckage to repair, ignorance to enlightenment and madness to sanity... almost!",
  "genres": [],
  "author": "Anne Mayhew",
  "average_rating": "4.60",
  "url": "https://www.goodreads.com/book/show/26541501-the-lion-the-legend-and-the-coal-miner-s-daughter"
}