{
  "title": "Killing Hitler: The Third Reich and the Plots to Kill the Führer",
  "description": "For the first time in one enthralling book, here is the incredible true story of the numerous attempts to assassinate Adolf Hitler and change the course of history.Disraeli once declared that “assassination never changed anything,” and yet the idea that World War II and the horrors of the Holocaust might have been averted with a single bullet or bomb has remained a tantalizing one for half a century. What historian Roger Moorhouse reveals in Killing Hitler is just how close–and how often–history came to taking a radically different path between Adolf Hitler’s rise to power and his ignominious suicide. Few leaders, in any century, can have been the target of so many assassination attempts, with such momentous consequences in the balance. Hitler’s almost fifty would-be assassins ranged from simple craftsmen to high-ranking soldiers, from the apolitical to the ideologically obsessed, from Polish Resistance fighters to patriotic Wehrmacht officers, and from enemy agents to his closest associates. And yet, up to now, their exploits have remained virtually unknown, buried in dusty official archives and obscure memoirs. This, then, for the first time in a single volume, is their story. A story of courage and ingenuity and, ultimately, failure, ranging from spectacular train derailments to the world’s first known suicide bomber, explaining along the way why the British at one time declared that assassinating Hitler would be “unsporting,” and why the ruthless murderer Joseph Stalin was unwilling to order his death. It is also the remarkable, terrible story of the survival of a tyrant against all the odds, an evil dictator whose repeated escapes from almost certain death convinced him that he was literally invincible–a conviction that had appalling consequences for millions.From the Hardcover edition.",
  "genres": [
    "History",
    "Nonfiction",
    "World War II",
    "Germany",
    "War",
    "Holocaust",
    "Historical"
  ],
  "author": "Roger Moorhouse",
  "average_rating": "3.82",
  "url": "https://www.goodreads.com/book/show/1170443.Killing_Hitler"
}