{
  "title": "The Emperor and the Spy: The Secret Alliance to Prevent World War II",
  "description": "Welcome\n to the intriguing world of an adventurous American Intelligence Agent, Colonel Sidney Forrester Mashbir (1891-1973), who spent the 1920s and 1930s in alliance with the Japanese Royal Family and other top leaders of Japan. Together, they delayed and made a valiant effort to prevent war between their nations.\nThe Emperor and the Spy\n, is based on and inspired by the author's acquisition of Colonel Mashbir's never-before-revealed intimate letters, secret official documents, and photographs. It is a rare occasion when the personal papers of a spy come to light! For sixteen years these primary source materials, along with other diverse historical archives were researched giving a window to an exciting untold story. This thrilling saga explores the life of a real-life James Bond, a master spy, who pioneered the beginning of the CIA, engaging in secret diplomacy and dangerous missions to shape world events. His long career began in the early 1900s, continuing into the Atomic Age!Mashbir so embraced the Japanese language and customs that he achieved a closer intimacy with Emperor Hirohito than probably any Westerner. In spite of Mashbir and his Japanese allies' courageous, peace-keeping efforts, World War II erupted, with Mashbir then forced to take a pivotal role in defeating Japan, a nation and its people whom he had so befriended.Sixty-five years after World War II, President Barack Obama awarded the \nCongressional Gold Medal\n, the nation's highest civilian honor, to those who had served under Colonel Mashbir's command in a top secret intelligence organization called A.T.I.S., in recognition of their major contributions to winning that conflict.After reading the novel, you're invited to explore www.TheEmperorAndTheSpy.com this website displays many of the fascinating historical materials from the Mashbir collection. *This is the first novel to reveal Colonel Mashbir's leadership role during this dramatic time in history.*",
  "genres": [],
  "author": "Katz S Stan",
  "average_rating": "4.25",
  "url": "https://www.goodreads.com/book/show/26571370-the-emperor-and-the-spy"
}