{
  "title": "The Land of Green Ginger",
  "description": "This beloved classic is a funny, clever, and original novel that opens with Aladdin (now Emperor of China) trying to decide what to name his son, a child who won't stop talking and is already far too articulate for his own good. The Genie of the Lamp announces that Abu Ali should be the child's name and that his destiny is to rescue the magician who created the Land of Green Ginger (a sort of fabulous floating garden) and then turned himself into a Button-Nosed Tortoise by mistake. Abu Ali is told he is the only one who can find the peripatetic island, locate the Button-Nosed Tortoise, and reverse the spell. And so begins a series of adventures that invoke a memorable cast of characters, some despicable, some feckless, and some (no surprise) beautiful and feisty.It's all here: Flying Carpets, Green Dragons, Magic Phoenix Birds, Boomalakka Wee, the dysfunctional infant son of the Genie of the Lamp, the displaced mouse who was supposed to have been a donkey, even Omar Khayyam himself. It all adds up to a fantastical tale of adventure and mayhem, fabricated by the screenwriter of The Wizard of Oz and illustrated by the inimitable and beloved Edward Ardizzone.From front inside flyleaf (1972 reprint of 1966 ed.):\"What happened after Aladdin married his princess and started to live happily ever after? This book tells the story of Aladdin’s son, the noble prince Abu Ali, whose only fault was that he was far too nice, and who was sent by the Genie of the Lamp to set free a magician from the spell which had turned him into a Button-Nosed Tortoise.Abu Ali travelled far and wide in his search for the beautiful Land of Green Ginger, which he understood was floating somewhere over the desert, and on the way he encountered some exciting adventures and interesting people, including two rich and very wicked princes, and Silver Bud, the dearest and prettiest girl in the world.This is a delightful, witty book which will be enjoyed by romantics of every age, and is especially good for family reading aloud.\"",
  "genres": [
    "Fantasy",
    "Fiction",
    "Childrens",
    "Classics",
    "Adventure",
    "Humor",
    "Fairy Tales"
  ],
  "author": "Noel Langley",
  "average_rating": "4.24",
  "url": "https://www.goodreads.com/book/show/2657724-the-land-of-green-ginger"
}