{
  "title": "Inside Out: A Personal History of Pink Floyd",
  "description": "Here, for the first time, is the story of Pink Floyd from the inside out. With 116 million albums sold worldwide and 25 years on the pop charts to their credit, Pink Floyd is one of the most successful rock groups in history, yet their story until now is one of the least known. The only continuous member of the band through its entire 40-year history, Nick Mason has witnessed every twist, turn, and sommersault from behind his drum kit. The journey begins with the band's origins as the darlings of London's late 1960s underground and the creation of the classic Pink Floyd sound, all the way through to The Wall and those legendary stadium shows. Here are the players who shaped the band's history and the story behind the story the inside perspective on, for example, the deterioration and departure of Syd Barrett; the overwhelming success of The Dark Side of the Moon and the resulting pressures and conflicts within the band, including the rift with Roger Waters; and Nick and David Gilmour's decision to put their reputations on the line and continue as Pink Floyd. Packed with rare photographs and vintage Floyd graphics from Nick Mason's extensive private archive, Inside Out is an eye-opener for both veteran fans and those just discovering the group. And, in keeping with the classic Floyd style, the book's cover was designed by Storm Thorgerson, creator of such iconic images as the Dark Side pyramid. Always candid, by turns poignant and funny, Nick's own memories are augmented with extensive research and interviews, making Inside Out a comprehensive history of one of the most brilliant and imaginative bands the world has known and a masterly memoir of rock and roll.",
  "genres": [
    "Music",
    "Nonfiction",
    "Biography",
    "Autobiography",
    "Memoir",
    "History",
    "Biography Memoir"
  ],
  "author": "Nick Mason",
  "average_rating": "4.12",
  "url": "https://www.goodreads.com/book/show/265734.Inside_Out"
}