{
  "title": "Bladesong: 1151 in the Holy Land",
  "description": "'A masterpiece. A historical feast.' C.M.T.Stibbe, Chasing Pharoahs 1151: the Holy Land From the Winner of the Global Ebook Award for Best Historical Fiction Estela, the troubadour, is following the destiny of her beautiful voice. Dragonetz, her passionate knight has a dangerous mission to fulfill; divided by the times they love in, they fight to be together. Imprisoned in Damascus, Dragonetz suffers the mind games inflicted by his anonymous enemies, as he is forced to remember the traumatic events of the crusade, two years earlier. His military prowess is as valuable and dangerous to the balance of power as the priceless Torah he has to deliver to Jerusalem, and the key players want Dragonetz riding with them - or dead. Instead of remaining safely at home, Estela is desperate to rescue Dragonetz at all costs. She sets out for the Holy Land, never realising that the person she thinks will be her knight's saviour might actually be his doom. Can Estela get him out alive, despite Nur-ad-Din, the Muslim Atabeg; Mélisende, the Queen of Jerusalem; and an avenger from the past? Will she still want to, when she knows what they've done to him? Once more 'the master of historical intrigue' whirls the reader off into medieval mayhem. Jean Gill's details of crusading strategy and riding a camel are as convincing as the pangs of medieval childbirth. She brought medieval France to life in 'Song at Dawn'; now she adds 12th century Damascus and Jerusalem with equal aplomb. 'Wonderful. If you love historical romance and adventure, you must pick up this series!'Autumn Birt, Rise of the Fifth Order www.jeangill.com Sign up to Jean's newsletter for a free Jean Gill book Trailer youtube.com/watch?v=5PREVetis1E",
  "genres": [
    "Historical Fiction",
    "Medieval",
    "Romance",
    "12th Century",
    "Amazon",
    "Historical",
    "Fiction"
  ],
  "author": "Jean Gill",
  "average_rating": "4.13",
  "url": "https://www.goodreads.com/book/show/26590072-bladesong"
}