{
  "title": "Dead Doctors Don't Lie",
  "description": "\"The Alternative Health Tell-All That Makes Doctors Cringe!\" Skyrocketing health-care costs today are forcing many people to take another look at conventional medical treatment and determine how they can eliminate a major portion of costly medical expenses. In \"Dead Doctors Don't Lie\" the reader will gain a clear understanding of the importance of the sixty essential minerals and how they effect the body and health. And, it will convince you of one of Dr. Joel Wallach's and Dr. Ma Lans principle medical \"Its not what you eat that kills you; its what you don't eat!\" Over 45 million copies of Dr. Wallach's audiocassette, Dead Doctors Don't Lie are in circulation today. (Chances are, you probably have one of them!) This book is an expansion of that highly popular tape. You will be shocked as it reveals many facts and truths that are 180 degrees opposite from what the medical community has led you to believe. The sad reality is that the physicians who have brainwashed you for years cannot keep you healthy. Nor can they save you. You will learn how to prevent and reverse 412 diseases with vitamins, minerals, trace minerals, and herbs. You will also learn that only those who take personal responsibility for maintaining and enriching their physical bodies are going to live safe and healthy lives. Your president, governor, mayor, physician, or even your spouse cant do it for you. In most instances, they cant even help themselves! The good news is, you don't have to wait for twenty years of expensive double blind studies to know how to start rescuing your health. You will learn how peoples in ancient and highly diverse cultures live to 120 and 140 years of age without high tech medicine or the skills of western style physicians. \"Dead Doctors Don't Lie\" will give you facts, proven truths, and the knowledge and tools necessary to identify the elemental raw materials of life no longer found in our food. And, you will find the ability to reach your genetic potential for a happy and long life.",
  "genres": [
    "Health",
    "Nonfiction",
    "Medicine"
  ],
  "author": "Joel D. Wallach",
  "average_rating": "3.96",
  "url": "https://www.goodreads.com/book/show/2657667-dead-doctors-don-t-lie"
}