{
  "title": "Pandora: An American in Prague",
  "description": "Leaving her safe, lovely life in Santa Barbara for her husband's native Czechoslovakia after the fall of communism was the biggest adventure Pandora had ever undertaken, and establishing her lingerie boutique Pandora's Box in Prague the culmination of a cherished dream. But there are other kinds of dreams, dreams that lurk at the edge of our consciousness, and making her husband's fantasy a reality initiated her into a world of sexual ecstasy beyond anything she'd ever imagined. Coffee Time Romance And More 4 coffee cups. \"...incredibly erotic, and whether the scenes involve f/f, f/m, or f/m/m etc. you always feel right there in the moment.\" Erotica Revealed Two thumbs up!. \"It's erotic but manages to be gentle to its characters (and reader) even when there are threesomes, foursomes, or moresomes in play. Pandora would be a perfect book to pass to someone dipping their toes into erotica for the first time, and, as Christmas approaches, a good gift for someone in that scenario - there's enough titillation and frank prose to give a sense of the genre, but nothing so shocking as to startle someone not used to the style and content it generally holds. That might mean that people who've read a lot of erotica will find Pandora plays it a little safe, but I enjoyed the softer touch. And it was certainly a welcome change to find women who were taking what they wanted, and not being consistently and constantly submissive. Pandora works with Ty to explore her sexuality - and, most of the time - takes charge of her own path.\" Publisher's Like the best travel writing, erotic fiction should take us places we wouldn't necessarily wish to (or get to) visit, and excite and inspire us. Reminiscent of the classic film Emmanuelle, Pandora, an American in Prague is a landmark work of women's and female erotica. Ms. Myonas' beautifully rendered erotic imaginings take Pandora from her first tentative lesbian encounter, through every conceivable ménage combination, and finally to the best sex a couple ever had on vacation, the latter showing that a work of erotica can also be very romantic. If you like your romance with more than a touch of spice, wit and color, and characters who don't just live on the page, you're going to love Pandora.",
  "genres": [
    "Erotica"
  ],
  "author": "Zoë Myonas",
  "average_rating": "3.13",
  "url": "https://www.goodreads.com/book/show/11703864-pandora"
}