{
  "title": "Shavetail",
  "description": "IN THE LITERARY TRADITION OF CORMAC MCCARTHY'S AND LARRY MCMURTRY'S HISTORICAL WESTERNS, SHAVETAIL TRACES THE BRUTAL COMING-OF-AGE OF A BOY SOLDIER STATIONED AT A REMOTE U.S. ARMY OUTPOST AND A YOUNG WOMAN'S TERRIFYING PASSAGE ACROSS THE AMERICAN FRONTIER.Set in 1871 in the unforgiving wasteland of the Arizona Territory, Shavetail is the story of Private Ned Thorne, a seventeen-year-old boy from Connecticut who has lied about his age to join the Army. On the run from a shameful past, Ned is desperate to prove his worth -- to his superiors, to his family, and most of all, to himself. Young and troubled, Ned is as green and stubborn as a \"shavetail,\" the soldiers' term for a dangerous, untrained mule.To endure in this world, Ned must not only follow the orders of the camp's captain, Robert Franklin,but also submit to the cruel manipulations of Obediah Brickner, the camp's mule driver. Both Franklin and Brickner have been damaged by their long military service, both consider themselves able to survive the dangers of the desert -- floods, scorpions, snakes, and Indians -- and both imperil Ned.Yet there are other characters, all richly drawn, who also confront half-wit soldiers, embattled Indians hidden in cliffs, a devious and philosophical peddler, and the fleshy whores who materialize in the desert as soon as the paymaster has left camp and dance with drunken soldiers around a fire late into the night.After a band of Apaches attack a nearby ranch, killing two men and kidnapping a young woman, Ned's lieutenant -- a man seeking atonement for his own mistakes -- leads Ned and the rest of his patrol on a near-suicidal mission through rugged mountains and into Mexico in hopes of saving the woman's life. It is unlikely any can survive this folly, and those who do will be changed forever.Meticulously researched and vividly told, Shavetail renders a time when the United States was still an expanding empire, its western edge bloody with the deaths of soldiers, settlers, and Indians. In language both spare and brilliant, Cobb brings readers this lost American landscape, untouched by highways or electricity and without the comforts of civilization.Shavetail also marks the return of a great American literary voice. Cobb's first and only other novel, Crazy Heart, was published in 1987 to great acclaim and was edited by the legendary editor Ted Solotaroff. Cobb is also a former student of Donald Barthelme, who described Crazy Heart as \"a bitter, witty psychological profile of genius.\"Brutal and deft, laced with both violence and desire, Shavetail plunges into the deepest human urges even as it marks the ground where men either survive or perish.",
  "genres": [
    "Westerns",
    "Fiction",
    "Historical Fiction",
    "Historical",
    "Coming Of Age"
  ],
  "author": "Thomas Cobb",
  "average_rating": "3.57",
  "url": "https://www.goodreads.com/book/show/2660699-shavetail"
}