{
  "title": "Miracle of the Rose",
  "description": "This is the third of Genet's prose works to be published in the United States, following Our Lady of the Flowers (1963) and The Thief's Journal (1964). It is, however, Genet's second novel, having been written in La Santé and Tourelles prisons in 1943, directly after Our Lady of the Flowers. Like that first work, Miracle of the Rose was written in the solitude of a prison cell, on the pieces of white paper the penal authorities furnish the convicts for making paper bags.The work is set in the State prison of Fontevrault. It is the height of the German Occupation and in the prisons of France the convicts, barely subsisting on near-starvation rations, spend their endless days weaving camouflage nets for their German conquerors. Miracle of the Rose is, first of all, an account of life at Fontevrault during that period. But Genet is no realist, and his account of prison life is an extraordinary mixture of dreams and reality, past and present.If Fontevrault is the present of his narrative, the past is the Mettray Reformatory, the almost idyllic, flower-covered \"prison colony\" for boys to which he was sent for theft as a mere child. It was here at Mettray that he was initiated into the life of confinement, into the world of the criminals and homosexuals in which he was to live for the next twenty-five years. Genet's story moves back and forth between Fontevrault and Mettray almost without the reader's being aware of the transition. Doubtless, in Genet's mind, there is no transition. Both prisons and both times fuse into one immense and erotic dream.The boys at Mettray do not pity or despise the hardened criminals at neighboring Fontevrault; on the contrary, they are the \"saints\" the boys look up to, the heroes they hope to emulate. More than fifteen years after his precocious arrival at the Mettray Reformatory, Genet finally reaches the Fontevrault Prison. Among the pimps and big shots, the crashers and chickens that form the homosexual hierarchy of the convict criminal society, he finds again many of his former boyhood friends and lovers.Foremost among them is Harcamone, a character notable in the narrative for his off-stage presence. Harcamone has been condemned to death for having killed the only guard at Fontevrault who had ever shown him the least bit of kindness. During the month and a half prior to his execution, his presence from his solitary cell on death row both encompasses and dominates the prison. At one point, as Harcamone passes Genet in the prison corridor, the author has a vision in which he sees the chains that bind Harcamone miraculously flower into a garland of white roses.Miracle of the Rose contains many such visions wherein Genet, taking the dross of \"evil'' transmutes it into a work of beauty.",
  "genres": [
    "Fiction",
    "France",
    "Queer",
    "French Literature",
    "Literature",
    "Gay",
    "LGBT"
  ],
  "author": "Jean Genet",
  "average_rating": "4.10",
  "url": "https://www.goodreads.com/book/show/266034.Miracle_of_the_Rose"
}