{
  "title": "The End of American Childhood: A History of Parenting from Life on the Frontier to the Managed Child",
  "description": "How American childhood and parenting have changed from the nation's founding to the presentThe End of American Childhood takes a sweeping look at the history of American childhood and parenting, from the nation's founding to the present day. Renowned historian Paula Fass shows how, since the beginning of the American republic, independence, self-definition, and individual success have informed Americans' attitudes toward children. But as parents today hover over every detail of their children's lives, are the qualities that once made American childhood special still desired or possible? Placing the experiences of children and parents against the backdrop of social, political, and cultural shifts, Fass challenges Americans to reconnect with the beliefs that set the American understanding of childhood apart from the rest of the world.Fass examines how freer relationships between American children and parents transformed the national culture, altered generational relationships among immigrants, helped create a new science of child development, and promoted a revolution in modern schooling. She looks at the childhoods of icons including Margaret Mead and Ulysses S. Grant―who, as an eleven-year-old, was in charge of his father's fields and explored his rural Ohio countryside. Fass also features less well-known children like ten-year-old Rose Cohen, who worked in the drudgery of nineteenth-century factories. Bringing readers into the present, Fass argues that current American conditions and policies have made adolescence socially irrelevant and altered children's road to maturity, while parental oversight threatens children's competence and initiative.Showing how American parenting has been firmly linked to historical changes, The End of American Childhood considers what implications this might hold for the nation's future.",
  "genres": [
    "Parenting",
    "Nonfiction",
    "History",
    "Sociology",
    "American History"
  ],
  "author": "Paula S. Fass",
  "average_rating": "4.43",
  "url": "https://www.goodreads.com/book/show/26597322-the-end-of-american-childhood"
}