{
  "title": "Darkness Spoken: The Collected Poems of Ingeborg Bachmann",
  "description": "Darkness Spoken gathers together Ingeborg Bachmann’s two celebrated books of poetry, as well as early and late poems not collected in book form, over 100 of them appearing in English for the first time, as well as 25 poems never before published in German. Bachmann is considered one of the most important poets to emerge in postwar German letters, and this volume represents the largest collection available in English translation. Influencing numerous writers from Thomas Bernhard to Christa Wolf to Elfriede Jelinek (winner of the 2004 Nobel Prize in Literature), Bachmann’s poetic investigation into the nature and limits of language in the face of historical violence remains unmatched in its ability to combine philosophical insight with haunting lyricism.Bachmann was born in 1926 in Klagenfurt, Austria. She studied philosophy at the universities of Innsbruck, Graz, and Vienna. In 1953 she received the poetry prize from Gruppe 47 for her first volume, Borrowed Time (Die gestundete Zeit). Her second collection, Invocation of the Great Bear (Anrufung des großen Bären), appeared in 1956. Her various awards include the Georg Büchner Prize, the Berlin Critics Prize, the Bremen Award, and the Austrian State Prize for Literature. Writing and publishing essays, opera libretti, short stories, and novels as well, she divided her time between Munich, Zurich, Berlin, and Rome, where she died from a fire in her apartment in 1973.Peter Filkins has published two volumes of poetry, What She Knew (1998) and After Homer (2002), and has translated Bachmann’s The Book of Franza and Requiem for Fanny Goldmann. He is the recipient of an Outstanding Translation Award from the American Literary Translators Association and the Berlin Prize from the American Academy in Berlin. He teaches at Simon’s Rock College of Bard in Great Barrington, Massachusetts.",
  "genres": [
    "Poetry",
    "German Literature",
    "Germany",
    "Literature",
    "20th Century",
    "Womens",
    "Fiction"
  ],
  "author": "Ingeborg Bachmann",
  "average_rating": "4.37",
  "url": "https://www.goodreads.com/book/show/265986.Darkness_Spoken"
}