{
  "title": "The Mercy Oak",
  "description": "In the South, family is the one thing worth dying—or killing—for. . . .Things are heating up between young widow Bay Tanner, sometime private investigator, and Red, local sheriff’s sergeant and her late husband’s brother. But a new case that strikes too close to home endangers more than just her love life.An unexpected call from her housekeeper’s son hints that a recent hit-and-run may have been more than an accident. Roberto fears the victim, a local crusader for the rights of illegal immigrants, may have been silenced. But almost immediately it becomes clear that the dead girl was not the intended victim, and before Bay has a chance to launch an investigation, Roberto himself disappears.Meanwhile, Red and the rest of the sheriff’s deputies are working overtime to solve a string of holdups terrorizing local businesses and banks. When Lavinia Smalls, longtime companion to Bay’s crippled father, is caught up in one of these robberies, Bay finds herself enmeshed in yet another mystery. What does Lavinia know about this gang of thieves, and why is she so reluctant to share her secret? What clues does her friend, the ancient black man with the intricately carved walking stick, carry in his muddled memory?Then the strange phone calls begin, and Bay realizes someone desperately wants her off the case—but which one? Determined to protect those she regards as family, Bay struggles against the fear that she may be endangering the very people she’s come to love in order to bring a killer to justice. Almost too late, she discovers that tempers run hot and prejudices deep when it comes to the growing immigrant population of the sultry South Carolina Lowcountry.In Kathryn Wall’s eighth captivating Southern mystery, Bay Tanner will pay a terrible price to uncover the secrets of the Mercy Oak.",
  "genres": [
    "Mystery",
    "Southern",
    "Adult Fiction"
  ],
  "author": "Kathryn R. Wall",
  "average_rating": "3.99",
  "url": "https://www.goodreads.com/book/show/2661891-the-mercy-oak"
}