{
  "title": "The Omega's Bodyguard",
  "description": "Sparks fly when a protective alpha meets an omega in danger, but there's a catch: this omega is still human, and doesn't know what he could become with a bite from the right wolf.  Being an alpha werewolf made Rusty Jamison one of the best while he served in the Marines, a top team leader in the elite Force Recon. But now his instincts have made military life unbearable--he couldn't protect his team without revealing what he was. He's out of the Corps and taking his first job as a bodyguard, using those instincts while protecting his secret. But his client is the last thing Rusty expected: a latent omega, a human with werewolf blood just waiting for a bite to awaken his potential.  Sam Hurley has fended off plenty of unwanted advances in his twenty-four years. As a baby-faced computer genius, he's used to being sought after for more than just his brains--but now someone is stalking him, and Sam is going to need help getting him to take no for an answer. His new bodyguard seems like he'll be able to do the job, but once Sam meets him he wants Rusty for a lot more than protection.  Rusty and Sam can barely keep their hands off each other from the moment they meet, driven by their werewolf instincts. Rusty knows that whoever's stalking Sam must be another alpha, hunting this rare unprotected omega. Sam might just be Rusty's chance to start a pack of his own; all he has to do is give up his secrets, hunt down a rogue alpha, and make sure Sam still wants to be his at the end of the day...  The Omega's Bodyguard is a m/m werewolf romance featuring a powerful, protective alpha, a sweet, smart omega, and a steamy happy ending that is only the beginning of this new pack's adventures...",
  "genres": [
    "M M Romance",
    "Shapeshifters",
    "Paranormal",
    "Romance",
    "Omegaverse",
    "Fantasy",
    "Erotica"
  ],
  "author": "Dessa Lux",
  "average_rating": "3.59",
  "url": "https://www.goodreads.com/book/show/26596223-the-omega-s-bodyguard"
}