{
  "title": "The Absent Body",
  "description": "The body plays a central role in shaping our experience of the world. Why, then, are we so frequently oblivious to our own bodies? We gaze at the world, but rarely see our own eyes. We may be unable to explain how we perform the simplest of acts. We are even less aware of our internal organs and the physiological processes that keep us alive. In this fascinating work, Drew Leder examines all the ways in which the body is absent —forgotten, alien, uncontrollable, obscured.In part 1, Leder explores a wide range of bodily functions with an eye to structures of concealment and alienation. He discusses not only perception and movement, skills and tools, but a variety of \"bodies\" that philosophers tend to the inner body with its anonymous rhythms; the sleeping body into which we nightly lapse; the prenatal body from which we first came to be. Leder thereby seeks to challenge \"primacy of perception.\" In part 2, Leder shows how this phenomenology allows us to rethink traditional concepts of mind and body. Leder argues that Cartesian dualism exhibits an abiding power because it draws upon life-world experiences. Descartes' corpus is filled with disruptive bodies which can only be subdued by exercising \"disembodied\" reason. Leder explores the origins of this notion of reason as disembodied, focusing upon the hidden corporeality of language and thought. In a final chapter, Leder then proposes a new ethic of embodiment to carry us beyond Cartesianism.This original, important, and accessible work uses examples from the author's medical training throughout. It will interest all those concerned with phenomenology, the philosophy of mind, or the Cartesian tradition; those working in the health care professions; and all those fascinated by the human body.",
  "genres": [
    "Philosophy",
    "Nonfiction",
    "Bodies",
    "Psychology"
  ],
  "author": "Drew Leder",
  "average_rating": "4.33",
  "url": "https://www.goodreads.com/book/show/1170509.The_Absent_Body"
}