{
  "title": "Baby ER: The Heroic Doctors and Nurses Who Perform Medicine's Tiniest Miracles",
  "description": "With \"Baby ER,\" Pulitzer Prize-winner Edward Humes tells the unforgettable story of wonder and hope that lies at medicine's cutting edge, where extraordinary healers and extraordinary patients come together to make miracles -- in a place where lives are held, literally, in the palms of doctors' hands. For the parents of sick and premature babies, some weighing less than a pound and no bigger than a can of cola, the Neonatal Intensive Care Unit -- the \"Baby ER\" -- is their one bastion of hope during the most terrifying moments of their lives, when their children's very survival hangs in the balance. Given unprecedented access to this normally private world, Humes witnesses the midnight deliveries, the harrowing Code Blues, the heart-wrenching setbacks; be there when a young mother first holds her son as he finally emerges from the incubator, and for the triumphant day of discharge, when families are at last made whole.Set in Southern California's Long Beach Memorial Medical Center, home to one of the largest and most respected neonatal units in the nation, \"Baby ER\" also describes the inspiring and dramatic efforts of the uniquely gifted physicians, nurses and other healers who work medicine's tiniest miracles, bringing life to a place where, for all but a minute fraction of human history, death has reigned supreme. The neonatal unit has been transformed in recent years by revolutionary advances that have enabled impossibly small preemies not only to survive but to thrive. Children born so early they would have been considered miscarriages fifteen years ago are now going home in their car seats thanks to state-of-the-art care; parents who would have faced unspeakable lossnow have diapers to change.But there is also a cost to the wonders of technology and skill that preserve such fragile lives. Though joy is most often the result of this remarkable brand of medicine called neonatology, a life saved does not always lead to a life worth living. The accompanying burdens -- sometimes grievous ones -- raise difficult moral, ethical and financial questions. In a narrative both lyrical and intense, Humes does not skirt these tough questions, nor do the talented physicians at the center of \"Baby ER,\" who must ask themselves not only how far they can go to save a child, but how far they should go. In an era when aggressive new fertility treatments have created an epidemic of high-risk multiple births, and one in ten babies in the U.S. is born premature, \"Baby ER\" provides a timely and compelling portrait of medicine's brave new world.",
  "genres": [
    "Nonfiction",
    "Medical",
    "Science",
    "Health",
    "Medicine",
    "Nursing"
  ],
  "author": "Edward Humes",
  "average_rating": "4.19",
  "url": "https://www.goodreads.com/book/show/1170654.Baby_ER"
}