{
  "title": "Forced Submission Bundle",
  "description": "Taking What's Mine   Alone at night in the middle of nowhere. The town sheriff pulls me over. I should be safe.  I'm not.  Nothing could have prepared me for what he had planned. And my darkest desires should have remained a secret. But it seems he knows everything about me.  I'm his now, and only I will do.   Taking What's Ours   You can't tease two alpha men like Hudson and Ridge and not expect consequences, not when you've become their every obsession.  They have a target...but their one obstacle has long legs, thick curves, and a mouth made for sin.  They do everything together, and Charlotte is no exception. She tempted them...and now they've come to collect. Together.  Can they take what they want and still stick to the plan? Five feet, seven inches of lush addiction says no.  Taking What's Hers   We've all been that girl.  Maybe you did a little social media stalking to check him out. Maybe you just drove by his house to see if he was home. Maybe you took it a step further and followed him once or twice.  We've all gone a little crazy over a guy before.  I went a little crazy. That's how Archer Ware ended up tied to the bed. I should probably feel bad about it, and maybe once I get what I want, I will. But right now he's mine, and that's all I care about.  This isn't the forced submission story you're used to. Valentina will stop at nothing to have the man she wants, and Archer can only take what she gives.  Warning:  Obsession beyond control. These books contain situations involving forced submission and dubious consent. Nothing can stop them from having what they feel is theirs. These themes are triggers for some, but sweet candy for others. If you're willing to hold off judgment until the last page, the ending is worth it, I promise.  BONUS: Bundle includes never before seen epilogues for all three stories & chapter 1 of TAKING WHAT’S HIS!",
  "genres": [
    "Erotica",
    "Romance",
    "BDSM",
    "Contemporary",
    "Dark",
    "Contemporary Romance",
    "Anthologies"
  ],
  "author": "Alexa Riley",
  "average_rating": "3.97",
  "url": "https://www.goodreads.com/book/show/26627323-forced-submission-bundle"
}