{
  "title": "Moments In Maplesville: A Perfect Holiday Fling & A Little Bit Naughty",
  "description": "Books One and Two in the “Moments in Maplesville” Novella SeriesA Perfect Holiday Fling - Book One(Originally published December 2012)It’s no mystery why veterinarian Callie Webber is having a hard time getting into the holiday spirit. When the residents of her small hometown aren’t pitying her because of her ex-husband’s very public departure, they’re attempting to hook her up with a man…any man. Fed up with being everyone’s favorite charity case, Callie considers closing her animal clinic and moving to the big city. But, before she goes, she decides to give herself a Christmas treat to a romantic holiday fling. And who better to have a fling with than the gorgeous newcomer who is turning heads around Maplesville?When injured Navy pilot Stefan Sutherland reluctantly rescues a gutter cat for the sake of his five-year-old nephew, he never imagined it would lead to him discovering Maplesville’s most fascinating attraction…its smoking hot vet. Getting involved with a woman was the last thing Stefan anticipated when he agreed to care for his nephew during his Army nurse sister’s deployment, but if he’s going to spend the holidays in this sleepy Southern town, why not make the most of it with the perfect holiday fling.A Little Bit Naughty - Book Two(Originally published March 2013)Sometimes a girl can't help being a little bit naughty...Jada Dangerfield was living her fairy tale—married to her high school sweetheart and working in her dream job—until it all came crashing down. Struggling to make ends meet, the unemployed divorcée stumbles upon a decidedly naughty new income stream, selling erotic toys to the women of her small hometown. And when Jada gets the chance to host a \"Naughty Nights\" party at the home of her uptight life-long nemesis Mason Coleman, she realizes it’s the perfect way to get under the skin of the one person who has always made her feel as if she wasn’t good enough.Mason Coleman relishes his career as a high-powered tax attorney, but his most important job is keeping the promise he made to his father to watch out for his baby sister...even though she hasn't been a \"baby\" in thirty years. When he learns that his sister may be in trouble, Mason is forced to call on the one person he's never been able to abide, her brash and sexy friend, Jada Dangerfield. There's just one problem...how does he stop Jada from corrupting his sister with her kinky new business?When this unlikely pair is forced to work together, things get a little bit naughty.",
  "genres": [
    "Romance",
    "Contemporary",
    "Contemporary Romance",
    "Anthologies",
    "Amazon",
    "African American Romance",
    "Christmas"
  ],
  "author": "Farrah Rochon",
  "average_rating": "3.98",
  "url": "https://www.goodreads.com/book/show/26645414-moments-in-maplesville"
}