{
  "title": "The Gateway",
  "description": "Thirty-three years after the perceived loss of the Colonization Project, a distress beacon from one of its shuttles is suddenly discovered between Earth and Jupiter. The problem is, the existence of said shuttle is absolutely impossible, even if the Colonization Project had survived its journey. Lieutenant Commander Rigel Knight soon discovers that it’s not only possible, but that he and his crew are the ones who must respond to the call for a rescue. A gateway has been opened up between the people of Earth and Kepler Moon Alpha, but this may pose more problems for the colony than it could potentially fix.  Colonization Saga: Kepler Moon Alpha (Book One) Black Hole (Book Two) The Gateway (Book Three) Valhalla (Book Four)Fossil (Book Five)Warrior of the Myst (Book Six)Warrior of the Myst II (Book Seven)  Editorial Reviews: \"McElhaney's story telling is deft, well-paced, and with an ear for conversation\" ~ Beacon Journal Book Review \"The author does a good job of sucking you into the moment and feeling as if you are the main character. The technology and scenarios are realistic enough for this sci fi fan and if you like a good storyteller Mr. McElhaney knows how to do it.\" ~Top 50 Amazon Reviewer and Vine Voice Michael GallagherBrought to you by the author of the international bestselling novel “The Mystic Saga”. Scott McElhaney brought the concept of serial novels back to science fiction after the idea lie dormant for many decades. Why spend $9.99 on a novel only to discover after the first eighty pages that you really don’t like it? The 99-cent serial novel gives you a full 80-100 page story that in itself can stand alone. If you like it, you’ll find another 99-cent continuation within the next month. If you didn’t like it, you only wasted 99 cents. If you stick with the whole story, you won’t have spent more than $5.00 and hopefully you enjoyed it even more than those ten-dollar novels. The Mystic Saga started out as a serial novel and now you can buy the whole 550-page omnibus for $2.99. That’s the way we roll around here.  Over 250,000 copies of McElhaney’s book have been downloaded worldwide!",
  "genres": [],
  "author": "Scott McElhaney",
  "average_rating": "4.21",
  "url": "https://www.goodreads.com/book/show/26632799-the-gateway"
}