{
  "title": "Bad Wicked Twisted",
  "description": "FOUR RED-HOT BOOKS + BONUS CHAPTERS about the BAD, WICKED and TWISTED characters of Briarwood Academy, featuring a dirty-talking gym owner, a football player, a sexy rock star, and a British bad boy.   1.) VERY BAD THINGSLeaving behind her mansion and Jimmy Choos, Nora Blakely becomes a girl hell-bent on pushing the limits with alcohol, drugs, and meaningless sex.  Then she meets her soulmate, but he doesn’t want her.  Sexy gym owner Leo Tate has one rule: never fall in love…until Nora shows up with her list of bad things. He resists the pull of their sizzling connection, hung up on their age difference.  2.) VERY WICKED BEGINNINGS (Prequel Novella)When wicked ballerina Dovey Beckham meets football star Cuba Hudson, she didn’t plan on having her heart shattered into a million pieces. He’s the bad boy with a dark past and when he falls for Dovey, he knows she can’t be part of his future.Welcome to VERY WICKED BEGINNINGS.  3.) VERY WICKED THINGSDovey Beckham is a ballerina from the wrong side of the tracks. Cuba \"Hollywood\" Hudson is a wealthy football player with fast cars and even faster girlfriends.  Their passion is electric, their connection deep, but once in a lifetime kind of love doesn't come easy, especially when dirty money, past sins, and old flames come calling.  4.) VERY TWISTED THINGS Violet St. Johns is a talented violinist hiding out in a Hollywood mansion, struggling to forget the devastation of her parent’s sudden death.  Vital Rejects front man Sebastian Tate never imagined his music video would go viral, skyrocketing him to instant fame.  When he sees the elusive girl in the mansion next door playing her violin nude, they begin an erotic game of spying.  When they finally come face-to-face, sparks fly and clothes comes off. But giving his heart to a girl isn’t Sebastian’s plan; falling for a guy who craves attention isn’t Violet’s.  Welcome to Briarwood Academy….Hollywood style….where the best things in life are VERY TWISTED THINGS.",
  "genres": [
    "Romance",
    "Young Adult",
    "New Adult",
    "Dark",
    "Contemporary",
    "Sports"
  ],
  "author": "Ilsa Madden-Mills",
  "average_rating": "4.31",
  "url": "https://www.goodreads.com/book/show/26647920-bad-wicked-twisted"
}