{
  "title": "Wives of my Father",
  "description": "Includes FREE audiobook. Look Inside for details.A compilation of three stories written by Zack Mantri, and edited by Sarah Matalas.Shortly after Markie's Dad married wife number three, he disappeared during a photojournalism assignment and was never heard from again. As a result, Markie Bender is faced with the challenge of taking care of his father's three 20-something ex-wives.These are the stories of Markie's magic summer between high school and college during which time, each stepmother would give him valuable lessons about understanding women in the most intimate way possible.Wives of My Father, RitaBeautiful redhead Rita, Markie’s first stepmother, is a nurse by trade, but with her gorgeous long red hair and beautiful Irish face he always suspected that she was actually as sex model in disguise. Then one day he fell off the ladder while attempting got fix a broken gutter at Rita’s house and soon after he discovered that his stepmom Rita was the best nurse he ever had.Her talents really shined during the check of Markie’s tailbone area, when she became terribly distracted by her stepson’s arousal. For Nurse Rita this became one more item to diagnose and care for.Wives of My Father, SarahBeautiful brunette Sarah, Markie’s second stepmother, ran into a problem one day when her breast pump broke. It was an emergency situation, but luckily Markie’s was there for a visit that day, so he was able to help her right away. With her direction, her stepson’s assistance worked so well for Sarah, she decided not to replace her expensive pump after all. Instead, Markie would regularly invite his best friends to help relieve her excess milk, the quick and natural way.Sarah was so pleased with the outcome that she decided to help Markie and his friends find relief for their excess fluids too.Wives of My Father, CynthiaBeautiful blonde Cynthia, Markie’s third stepmother, is the most beautiful of all of Markie’s stepmothers, or at least he thought so, probably due to her waist-length lush blonde hair and her demanding yet playful attitude. Even though he was most bashful around her, he thought she would be the best one to answer his questions about how to better understand girls. However, little did he know that this particular 20-something stepmom was one to turn the tables on men, every time she got the chance. So to Markie’s surprise, he would soon find himself the subject of a demonstration that he would never forget.With the help of Cynthia’s young hot friend Debbie, he would understand girls better by being treated as one, all day and all night.",
  "genres": [],
  "author": "Zack Mantri",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/26631767-wives-of-my-father"
}