{
  "title": "If Democrats Had Any Brains, They'd Be Republicans",
  "description": "“Uttering lines that send liberals into paroxysms of rage, otherwise known as ‘citing facts,’ is the spice of life. When I see the hot spittle flying from their mouths and the veins bulging and pulsing above their eyes, well, that’s when I feel truly alive.”So begins If Democrats Had Any Brains, They’d Be Republicans , Ann Coulter’s funniest, most devastating, and, yes, most outrageous book to date.Coulter has become the brightest star in the conservative firmament thanks to her razor-sharp reasoning and biting wit. Of course, practically any time she opens her mouth, liberal elites denounce Ann, insisting that “She’s gone too far!” and hopefully predicting that this time it will bring a crashing end to her career.Now you can read all the quotes that have so outraged her enemies and so delighted her legions of fans. More than just the definitive collection of Coulterisms, If Democrats Had Any Brains, They’d Be Republicans includes dozens of brand-new commentaries written by Coulter and hundreds of never-before-published quotations. This is Ann at her best, covering every topic from A to Z. Here you’ll read Coulter’s take • Her “As far as I’m concerned, I’m a middle-of-the-road moderate and the rest of you are crazy.”• Hillary “Hillary wants to be the first woman president, which would also make her the first woman in a Clinton administration to sit behind the desk in the Oval Office instead of under it.”• The “God gave us the earth. We have dominion over the plants, the animals, the trees. God said, ‘Earth is yours. Take it. Rape it. It’s yours.’”• “It’s become increasingly difficult to distinguish the pronouncements of the Episcopal Church from the latest Madonna video.”• Global “The temperature of the planet has increased about one degree Fahrenheit in the last century. So imagine a summer afternoon when it’s 63 degrees and the next thing you know it’s . . . 64 degrees. Ahhhh!!!! Run for your lives, everybody! Women and children first!”• Gun “Mass murderers apparently can’t read, since they are constantly shooting up ‘gun-free zones.’”• Bill “Bill Clinton’s library is the first one to ever feature an Adults Only section.”• Illegal “I am the illegal alien of commentary. I will do the jokes that no one else will do.”If Democrats Had Any Brains, They’d Be Republicans is a must-have for anyone who loves (or loves to hate) Ann Coulter.",
  "genres": [
    "Politics",
    "Nonfiction",
    "Humor",
    "Comedy"
  ],
  "author": "Ann Coulter",
  "average_rating": "3.40",
  "url": "https://www.goodreads.com/book/show/266384.If_Democrats_Had_Any_Brains_They_d_Be_Republicans"
}