{
  "title": "Sans Souci",
  "description": "Abused and beaten by his father, Crown Prince Frederick of Prussia resolves to escape by fleeing to England with the help of his friend and lover, Hans Hermann von Katte. The plan is underfoot when one of the party betrays the Crown Prince, and he and von Katte are imprisoned to await court martial for treason. The outlook is grim; the King is demanding the severest punishments, possibly even the executions of his son and his son’s hated lover. But the Crown Prince’s friends are determined that Fritz will not live his life out as a lonely, embittered man, forced to watch his friend die.This story was written as a part of the M/M Romance Group's \"Love is an Open Road\" event. Group members were asked to write a story prompt inspired by a photo of their choice. Authors of the group selected a photo and prompt that spoke to them and wrote a short story. Dear Author,I am Frederick the Great. As you can see, I stand there all alone. When I was young, my father killed my lover Hans Herrmann von Katte and made me watch. This changed my life forever. But what if Hans and I had managed to escape together, or at least, managed to be together? Would we have loved each other until the end of our lives? Would our bond have survived even marriage to others and hiding ourselves from the court? Please, show me a reality where we would have been happy, loving and together.Photo Description: It is the middle of the 18th Century. The King of Prussia, slender and elegant in clothes of the finest cut, heavy lace at throat and cuffs, his dark jacket open to reveal a cream waistcoat and wearing fine breeches and knee-high boots, stands alone in the centre of a magnificent music room watched by his courtiers, ladies of the court and a group of musicians. He is playing the traverse flute, his eyes fixed intently on the music sheets in front of him as he plays, accompanied only by a harpsichord. In the wings Johann Quantz watches.This story may contain sexually explicit content and is intended for adult readers. It may contain content that is disagreeable or distressing to some readers. The M/M Romance Group strongly recommends that each reader review the General Information section before each story for story tags as well as for content warnings.",
  "genres": [
    "Historical",
    "M M Romance",
    "Romance",
    "LGBT",
    "Short Stories"
  ],
  "author": "Aubrey E. Dyett",
  "average_rating": "3.52",
  "url": "https://www.goodreads.com/book/show/26700440-sans-souci"
}