{
  "title": "Cade: Fire and Ice",
  "description": "Cade: No one can do what I can do with a puck, a stick and some good ice. Destined for NHL stardom and known for my finesse both on and off the ice, I've had my eyes on the prize since I was five years old. Nothing is going to get in my way. At least that's how it was supposed to be, until I met Ellie Hesketh and the feeling of her body next to mine brought out my fiercely protective side and made me question everything I thought I knew.Ellie: I'm that girl. The one from the wrong side of the tracks in a small town where appearances are everything. Not that I've got time for what anybody else thinks of me. I've got three little brothers who need raising and there's no one to do it but me. Until Cade walks into my life and starts to make me feel like maybe, just maybe, my life wasn't meant to be nothing more than a lonely struggle against hardship. The only problem is, he's only in town for a few short months and we both know that when he leaves, I can't go with him...We're from different worlds. We both knew our paths were destined to deviate. But the sweet, perfect heat of being together blossomed into something more than either of us could handle and now I have a secret. A dimpled, blue-eyed secret who's the spitting image of his daddy. Cade lives in the big city now. A life of money, fame and adoring fans. So why is the media filled with stories about his reckless, self-destructive behavior? And what am I supposed to do when, during a live interview, he confesses to a secret of his own?Love broke us. Can it put us back together again?This is a full-length 58k standalone romance novel with a HEA and no cliffhanger! It includes steamy, adult situations and is intended for a mature audience over 18.",
  "genres": [
    "Sports",
    "Hockey",
    "Sports Romance",
    "Contemporary Romance",
    "Romance",
    "Friends To Lovers",
    "Second Chance"
  ],
  "author": "Alana Hart",
  "average_rating": "3.63",
  "url": "https://www.goodreads.com/book/show/26699957-cade"
}