{
  "title": "The Song of the Jubilee",
  "description": "A CLINICAL TRIAL UPON THE EARTH'S SURFACE ...TO TEST A TREATMENT AGAINST REASSORTMENT ...WILL ALTER THE COURSE OF TRANSHUMAN HISTORY.In the Great Commonwealth of Beimeni, a subterranean civilization in North America, expansion long ago gave way to peace and prosperity in the face of the history's most devastating plague. Immortality is the reward for service and loyalty in Beimeni, a place where the physical blends with the metaphysical and power consolidates in the hands of those with a genetic edge. The fissures first spread slowly, then swiftly, until now the Great Commonwealth finds itself on the brink of economic devastation, challenged by forces from within that know its secrets and its crimes. At the center of the conflict lie the Selendias of Piscator, founders of the resistance with an uncanny connection to the zeropoint field, and the Barão Strike Team, three researchers tasked with finding a cure to the Reassortment Strain, the plague that nearly wiped transhumankind from the Earth. Traveling from the uninhabitable but pristine surface to the habitable but inhospitable underground, this is a story about dedication to dreams, battle for survival, discovery and connection, song and celebration, undoing past misdeeds, and sacrifice for the greater good.In THE SONG OF THE JUBILEE, Captain Broden Barão, Striker Nero Silvana, and Strategist Verena Iglehart, together with the elite Reassortment research team, release a protohuman on the Island of Reverie, testing a serum designed to thwart the Reassortment Strain. They must find a cure to the plague or suffer the inevitable consequence for failure: demotion or worse, exile to the Lower Level some four thousand meters beneath the Earth's surface. Meanwhile, in the Great Commonwealth, two thousand five hundred meters deep, the resistance movement known as the Liberation Front suffers a disastrous defeat when its leader, Jeremiah Selendia, is captured by Lady Isabelle Lutetia, Supreme Director of the Department of Communications and Commonwealth Relations. With Jeremiah held by the government, his middle son unexpectedly finds the weight of the war on his shoulders. It falls to Johann to lead the Front, to rescue his father from one of the commonwealth's most impregnable fortresses, and to keep his younger, underdeveloped brother hidden from the chancellor, who forces foes to undergo clinical trials against the plague upon the surface. Johann's efforts draw the attention of powerful enemies and start a chain of events that will forever change his family, the Barão Strike Team, and the Great Commonwealth of Beimeni.",
  "genres": [
    "Science Fiction",
    "Apocalyptic",
    "Amazon",
    "Collections",
    "Dystopia"
  ],
  "author": "Raeden Zen",
  "average_rating": "3.45",
  "url": "https://www.goodreads.com/book/show/26709327-the-song-of-the-jubilee"
}