{
  "title": "A History of Gold and Money: 1450-1920",
  "description": "For much of human history, the motive force behind war, conquest, social conflict and world exploration has been the drive to acquire gold. From the ancient world of Croesus to the wealthy dynasties of Renaissance Italy, from the earliest European explorations into Africa, America, and Asia to the gold rushes of the nineteenth century and the banking crises that lay beyond them, Pierre Vilar depicts the awesome power of avarice to structure the world in which we live. The insidious power of gold and money is the subject of this enlightening and entertaining history.The age of exploration brought an influx of treasure into Western Europe, prompting disputes between theologians and early economists over the causes of inflation in the sixteenth century. In time, American silver distorted metropolitan Spanish society beyond recognition. Vilar goes on to examine the roots of the modern banking and financial systems in institutions founded in Holland, England and France during the seventeenth and eighteenth centuries. And in the nineteenth century, the gold rushes of Australia, California and South Africa generated new modifications in the international monetary system.Vilar concludes the story of these developments with a discussion of the crisis of the 1920s that, in the wake of the world credit crash of 2008, is more pertinent than ever. A History of Gold and Money provides a unique work of synthesis on the role of money in modern economic history.The Verso World History Series : This series provides attractive new editions of classic works of history, making landmark texts available to a new generation of readers. Covering a timespan stretching from Ancient Greece and Rome to the twentieth century, and with a global geographical range, the series will also include thematic volumes providing insights into such topics as the spread of print cultures and the history of money.",
  "genres": [
    "History",
    "Economics",
    "Nonfiction",
    "Science",
    "Politics",
    "Spain",
    "World History"
  ],
  "author": "Pierre Vilar",
  "average_rating": "3.67",
  "url": "https://www.goodreads.com/book/show/11709259-a-history-of-gold-and-money"
}