{
  "title": "Bankrupting the Third World",
  "description": "Dedicated to the impoverished in forgotten places of the world, this book questions whether the likes of the World Bank, the International Monetary Fund, the United States Agency for International Development and other big international aid organizations help or hinder the world’s poorest people. It also questions whether the aid packages provided are genuine or whether they are scams designed to subjugate Third World countries.BANKRUPTING THE THIRD WORLD: How the Global Elite Drown Poor Nations in a Sea of Debt, by novelists, filmmakers and independent researchers James Morcan & Lance Morcan, exposes the culture of corruption within the aforementioned aid organizations and the arrogance with which they treat their Third World ‘clients.’The Morcans reveal there’s a nefarious hidden agenda at play whereby the ‘generosity’ extended by international aid organisations in assisting the development of the Third World and providing relief in the event of natural disasters comes with serious strings attached. Strings designed to fleece vulnerable nations.The reader is reminded the economic hit men popularized in John Perkins’ 2004 bestseller ‘Confessions of an Economic Hit Man’ are still alive and well – in Africa in particular.BANKRUPTING THE THIRD WORLD puts two poverty-stricken nations under the magnifying glass to reveal the long-term impact of being the recipient of substantial financial aid from the West. The resulting debt accrued by these nations may surprise even the most skeptical reader.In writing this book, the authors were motivated by one sickening statistic: 21,000 people die from starvation every day. That’s one person every four seconds!More sickening is the fact such deaths are unnecessary given there is more than enough wealth in the world for everyone to at least receive the basic necessities of life, and more than enough in the Third World for it to organically sustain itself.By the time you get to the end of this book you’ll see there’s as much wealth to be found in the Third World as there is in the First World. In fact, terms like ‘Third World’ and ‘impoverished nations’ are essentially misnomers as they imply wealth and resources are limited in these forgotten places. The authors aim to dispel that myth once and for all.It’s hoped BANKRUPTING THE THIRD WORLD will contribute in some small way to the masses pressuring world leaders to eradicate the extreme poverty that sees millions of our fellow Human Beings – men, women and children – dying unnecessarily every year.",
  "genres": [
    "Nonfiction",
    "Spanish Literature",
    "Poverty",
    "Africa",
    "Economics",
    "Politics",
    "Conspiracy Theories"
  ],
  "author": "James Morcan",
  "average_rating": "4.38",
  "url": "https://www.goodreads.com/book/show/26722083-bankrupting-the-third-world"
}