{
  "title": "The Gambit With Perfection",
  "description": "AN UNPRECEDENTED MISSION ACROSS THE GALAXY ...FORTY THOUSAND LIGHT YEARS FROM EARTH ...WILL CHANGE THE WORLD.In the Great Commonwealth of Beimeni, a subterranean civilization in North America, expansion long ago gave way to peace and prosperity in the face of the history's most devastating plague. Immortality is the reward for service and loyalty in Beimeni, a place where the physical blends with the metaphysical and power consolidates in the hands of those with a genetic edge. The fissures first spread slowly, then swiftly, until now the Great Commonwealth finds itself on the brink of economic devastation, challenged by forces from within that know its secrets and its crimes. At the center of the conflict lie the Selendias of Piscator, founders of the resistance with an uncanny connection to the zeropoint field, and the Bar達o Strike Team, three researchers tasked with finding a cure to the Reassortment Strain, the plague that nearly wiped transhumankind from the Earth. Traveling from the uninhabitable but pristine surface to the habitable but inhospitable underground, this is a story about dedication to dreams, battle for survival, discovery and connection, song and celebration, undoing past misdeeds, and sacrifice for the greater good.In THE GAMBIT WITH PERFECTION, Cornelius Selendia continues his journey to Blackeye Cavern, Supreme Scientist Damosel Rhea makes progress on Project Silkscape, and the consequences of failure during the last Jubilee confront the Bar達o Strike Team. Captain Broden Bar達o, Striker Nero Silvana, and Strategist Verena Iglehart have been recalled to the Huelel Facility for a commonwealth mission to the Vigna system. Will the Bar達o Strike Team succeed in the mission? Will Cornelius make it to the Cavern before the commonwealth's agents recapture him? Will Damy revive the prehistoric life vital to her survival in the commonwealth? As the season shifts from spring to summer on the Earth's surface, civilizations collide inside the planets Earth and Vigna, changing the world in unexpected ways.",
  "genres": [
    "Science Fiction",
    "Apocalyptic",
    "Collections",
    "Dystopia"
  ],
  "author": "Raeden Zen",
  "average_rating": "3.77",
  "url": "https://www.goodreads.com/book/show/26709757-the-gambit-with-perfection"
}