{
  "title": "Naughty by Nature",
  "description": "Scorpio Valentino, a sexy-diva beauty-salon owner, is used to having her way with any and every man that she meets. She's a master at playing head-games and also possesses a curvaceous body that'll have any man's tongue watering. But when one man (Jaylin) has finally been able to free himself from her grip and moves on, Scorpio just ain't having it. She'll try anything to get him back. Jaylin has moved to Florida after breaking-up with Scorpio when he learned that she's so grimey that she slept with his own cousin! Now he's got what he feels is the best life for him -- a successful financial career, a woman that's worthy of him and a good best-friend (Shane). Shane Alexander is under the pressure of meeting the demands of a big account at work. Complicating the matter is a girlfriend that's also pressuring him to marry her and a business partner (Felicia) that's pressuring and blackmailing him into staying with the firm. The opportunity arises for Scorpio to reclaim Jaylin, when Shane invites his best-friend to fly into town to help close a major business deal. Just by seeing Scorpio's face again, it quickly reminds Jaylin of the power she once had over him and leaves him in a vulnerable and confused state – just how Scorpio likes it. Felicia Davenport is a hard-nosed, low-down, majority-owner of the company where Shane works. She's the boss and that's that! Secretly, she has a thing for Shane, but gets ruthless when she's unable to attract him and learns that Scorpio seems to have his nose wide-open for her. A CD in Felicia's possession threatens to simultaneously destroy the lives of both Shane and Jaylin. Scorpio's naughty sex-life catches up with her, as she starts being anonymously terrorized with harassing phone calls and vandalism of her property. Eventually, it's Scorpio's own behavior that leads to her staring down the barrel of gun, wielded by the scorned-wife of one of the many men that she's been sexin'. Some women are greedy. Some women are sneaky. Some even think they're Slick. But there's nothing like a woman that's Naughty-By-Nature!",
  "genres": [
    "Urban",
    "Erotica",
    "African American Romance"
  ],
  "author": "Brenda Hampton",
  "average_rating": "4.61",
  "url": "https://www.goodreads.com/book/show/2673231-naughty-by-nature"
}