{
  "title": "The Great Gatsby: A Graphic Adaptation",
  "description": "In homage to F. Scott Fitzgerald's jazz age classic, this acclaimed graphic adaptation brings to life the glitter, the melancholy and the grand and crumpled dreams of Fitzgerald's unforgettable characters. Daisy, Nick, Tom, Jordan and Gatsby himself are rendered true to Fitzgerald's original characterisation, with a they are not human. Inhabiting the authentic setting of 1920s New York, they join a throng of fantastical creatures to play out the drama, the wry humour and the tragedy of the novel. The book is presented in the form of an old photograph album, with the snapshots forming the \"frames\" of the story. In this way, the reader is invited into the private world of the characters, while sharing the sense of nostalgia and loss that pervades the novel. Fittingly for the defining novel of the Jazz Age, this adaptation has the flavour of a jazz interpretation - an energetic and entertaining, but also thoughtful and subtle, \"arrangement\" of the original piece of music. \"Bizarre, absorbing and very funny, Nicki Greenberg casts a surrealist eye over Fitzgerald's world of careless money, social politics and misplaced ambition. It's a bold idea that works to great effect, where frivolous and monstrous natures are plain to see and enjoy, while all the while a much darker current flows ominously beneath the surface.\" SHAUN TAN \"Greenberg's The Great Gatsby is a pure delight... it's a work of art; every page is beautiful.\" THE BLURB \"That we quickly accept this surreal bestiary... is a credit to Greenberg's delicate, expressive artwork, deft period recreation and precise, sympathetic storytelling, which effectively capture the novel's glittering surface and melancholic undertow.\" THE WEEKEND AUSTRALIAN - REVIEW",
  "genres": [
    "Graphic Novels",
    "Comics",
    "Classics",
    "Fiction",
    "Historical Fiction",
    "Graphic Novels Comics",
    "Young Adult"
  ],
  "author": "Nicki Greenberg",
  "average_rating": "3.97",
  "url": "https://www.goodreads.com/book/show/2672476-the-great-gatsby"
}