{
  "title": "Not for Ourselves Alone: The Story of Elizabeth Cady Stanton and Susan B. Anthony",
  "description": "Elizabeth Cady Stanton and Susan B. Anthony were two heroic women who vastly bettered the lives of a majority of American citizens. For more than fifty years they led the public battle to secure for women the most basic civil rights and helped establish a movement that would revolutionize American society. Yet despite the importance of their work and they impact they made on our history, a century and a half later, they have been almost forgotten.Stanton and Anthony were close friends, partners, and allies, but judging from their backgrounds they would seem an unlikely pair. Stanton was born into the prominent Livingston clan in New York, grew up wealthy, educated, and sociable, married and had a large family of her own. Anthony, raised in a devout Quaker environment, worked to support herself her whole life, elected to remain single, and devoted herself to progressive causes, initially Temperance, then Abolition. They were nearly total opposites in their personalities and attributes, yet complemented each other's strengths perfectly. Stanton was a gifted writer and radical thinker, full of fervor and radical ideas but pinned down by her reponsibilities as wife and mother, while Anthony, a tireless and single-minded tactician, was eager for action, undaunted by the terrible difficulties she faced. As Stanton put it, \"I forged the thunderbolts, she fired them.\" The relationship between these two extraordinary women and its effect on the development of the suffrage movement are richly depicted by Ward and Burns, and in the accompanying essays by Ellen Carol Dubois, Ann D. Gordon, and Martha Saxton. We also see Stanton and Anthony's interactions with major figures of the time, from Frederick Douglass and John Brown to Lucretia Mott and Victoria Woodhull. Enhanced by a wonderful array of black-and-white and color illustrations, Not For Ourselves Alone is a vivid and inspiring portrait of two of the most fascinating, and important, characters in American history.",
  "genres": [
    "History",
    "Nonfiction",
    "Biography",
    "Feminism",
    "Womens",
    "Historical",
    "Politics"
  ],
  "author": "Geoffrey C. Ward",
  "average_rating": "4.09",
  "url": "https://www.goodreads.com/book/show/267295.Not_for_Ourselves_Alone"
}