{
  "title": "Memories, Dreams and Reflections",
  "description": "This book is a more personal history than has ever before been written by or about Marianne Faithfull. Anecdotal, conversational, intimate and revealing, this is her no-holds-barred account of her life, her friends, her triumphs and mistakes. A decade after the publication of ‘Faithfull’, one of the most acclaimed rock autobiographies of all time, Marianne Faithfull is back, vowing periodically leave her wicked ways behind and grow up, but finding that somehow strange things keep happening. A wry observer of her slightly off-kilter world, Marianne muses nostalgically about afternoons languishing on Moroccan cushions at George and Pattie's, getting high and listening to new songs. She fondly recalls the outlandish antics of her Beat friends Allen Ginsberg and William Burroughs; is frequently baffled at her image in the press (opening the paper to read of her own 'Sixties Star in Death Plunge'); terrified by the curse sent by Kenneth Anger; mortified by her history of reckless behaviour; not to mention her near-death experience in Singapore while looking for an opium den. Marianne peoples her anecdotal memoir with legendary characters one can imagine only Marianne assembling around her, both the eccentric and the beautiful, from Henrietta Moraes and Donatella Versace to Sofia Coppola, Juliette Greco, and Yves St. Laurent's dog. Here is Marianne on the dark side of the sixties and the bright side of the nineties, which saw her collaborating with the likes of Blur and Jarvis Cocker; compelling recollections of an unconventional childhood in her father's orgiastic literary commune to a hilariously decadent few days at Lady Caroline Blackwood's deathbed. Here she is her blossoming movie career, on her records as subliminal autobiography. This is as intimate a portrait as we've ever had of Marianne, as she meditates on sex and drugs, confronts her alter-ego, the Fabulous Beast, and faces her own mortality in her battle with breast cancer. Since her last book Marianne has, in her own words, 'made quite a few records, gone on many tours, tried to play it straight, and… Well, the rest is the subject of this book.'",
  "genres": [
    "Music",
    "Biography",
    "Nonfiction",
    "Memoir",
    "Biography Memoir",
    "Autobiography",
    "British Literature"
  ],
  "author": "Marianne Faithfull",
  "average_rating": "3.57",
  "url": "https://www.goodreads.com/book/show/2673394-memories-dreams-and-reflections"
}