{
  "title": "The Jew of Rome",
  "description": "Whether progress is provable or not, even praisers of times past would have to admit the historical novel of today stacks up favorably alongside its peers of yesterday. Tho past-partisans mightn't allow Rbt Graves' Claudius books, Alfred Neumann's The Devil, Lion Feuchtwanger's Power & Josephus, Th Mann's Joseph & His Brothers the palm over such classics as Defoe's The Journal of the Plague Year, Tolstoy's War & Peace, Flaubert's Salammbo, critical consensus is that modern exponents are obviously better grade than romanticists like Walter Scott, Charles Reade et al. Feuchtwanger's 2nd volume on the Jewish Historian Josephus doesn't let his colleagues' standard down. Flavius Josephus, or Joseph ben Matthias, as his fellow-Jews called him, was a queer sort of hero. Feuchtwanger's 1st volume told how Josephus, after fighting the Romans like an unexceptionable patriot, turned his cloak into a toga to save what he might from the wreck of Judea. Thereafter he never completely got back his countrymen's confidence, never altogether won the Romans' respect. Josephus was never quite sure how he stood with himself. When his hated master, Emperor Vespasian, died & his friend Titus came to the throne, Josephus' wave curled to its crest. Reading over the new edition of his famed book, the Jewish War, gazing at his bust in Rome's Temple of Peace, where only the greatest writers were immortalized, he tells himself: \"There are 77 who have the ear of the world, & of these I am one.\" But when he let his adored Egyptian wife wean away their son to Hellenic heathenishness, when he compromised with his religion for the sake of Roman rewards, he'd think: \"Your Doctor Joseph is a scoundrel.\"  While Titus' infatuation with Berenice, the Jewish princess, lasted, Josephus made hay. But the affair came to an end. To win back his waning popularity, Titus gave freer rein to the antisemites. Josephus' wife & son left him; his son by an earlier marriage died, partly thru his neglect. He went back to Judea, visited the desolate site of what had once been Jerusalem, saw how vexed the land was by its Roman conquerors, by a dangerous new sect called Minaeans or Christians, by the iron orthodoxy of the Jewish doctors of the Law. Sadly he returned to Rome again, determined to be neither hidebound Roman nor hidebound Jew but a citizen of the world. He got back in time to see his emperor Titus die, to be evicted from his house by Domitian, to be mocked by the Roman rabble.",
  "genres": [
    "Historical Fiction",
    "German Literature",
    "Classics",
    "Christianity",
    "Fiction",
    "Literature"
  ],
  "author": "Lion Feuchtwanger",
  "average_rating": "4.42",
  "url": "https://www.goodreads.com/book/show/2674595-the-jew-of-rome"
}