{
  "title": "The Solitude of Self: Thinking About Elizabeth Cady Stanton",
  "description": "Elizabeth Cady Stanton—along with her comrade-in-arms, Susan B. Anthony—was one of the most important leaders of the movement to gain American women the vote. But, as Vivian Gornick argues in this passionate, vivid biographical essay, Stanton is also the greatest feminist thinker of the nineteenth century. Endowed with a philosophical cast of mind large enough to grasp the immensity that women's rights addressed, Stanton developed a devotion to equality uniquely American in character. Her writing and life make clear why feminism as a liberation movement has flourished here as nowhere else in the world.Born in 1815 into a conservative family of privilege, Stanton was radicalized by her experience in the abolitionist movement. Attending the first international conference on slavery in London in 1840, she found herself amazed when the conference officials refused to seat her because of her sex. At that moment she realized that \"In the eyes of the world I was not as I was in my own eyes, I was only a woman.\" At the same moment she saw what it meant for the American republic to have failed to deliver on its fundamental promise of equality for all. In her last public address, \"The Solitude of Self,\" (delivered in 1892), she argued for women's political equality on the grounds that loneliness is the human condition, and that each citizen therefore needs the tools to fight alone for his or her interests.Vivian Gornick first encountered \"The Solitude of Self\" thirty years ago. Of that moment Gornick writes, \"I hardly knew who Stanton was, much less what this speech meant in her life, or in our history, but it I can still remember thinking with excitement and gratitude, as I read these words for the first time, eighty years after they were written, ‘We are beginning where she left off.' \"The Solitude of Self is a profound, distilled meditation on what makes American feminism American from one of the finest critics of our time.",
  "genres": [
    "Nonfiction",
    "History",
    "Feminism",
    "Biography",
    "Philosophy",
    "Womens",
    "Gender"
  ],
  "author": "Vivian Gornick",
  "average_rating": "3.97",
  "url": "https://www.goodreads.com/book/show/267288.The_Solitude_of_Self"
}