{
  "title": "Top Shelf",
  "description": "USA TODAY BESTSELLER • Whether it’s a clutch goal or a cocktail, nothing beats “top shelf.” In this novel from the bestselling author of the Heller Brothers Hockey series, a fun-loving jock and an ambitious career woman mix business with pleasure. Not only is Jared Rupp one of the stars of the NHL’s Chicago Aces, he’s also the owner of the Sin Bin, the after-hours hot spot where the whole team hangs out. Lately, Jared can’t take his eyes off the woman he’s hired to give the Bin a more modern a sexy, sophisticated consultant who has carved out a niche updating drink menus. She’s as passionate about her career as Jared is about hockey—and yet he can’t help wondering what kind of cocktail she really wants. In her line of work, Sidney Frayne is used to guys hitting on her in bars, but Jared gets her hot enough to burst into flames. When he’s wining and dining her, he’s sophisticated as hell; on the rink, he’s a testosterone-fueled powerhouse. Still, Sidney’s bitter divorce taught her to keep her emotions on ice. With her busy schedule—and Jared’s playboy reputation—she’s not sure she’s ready for a fling. Because if she lets Jared into her bed, she just may have to let him into her heart.Kelly Jamieson’s USA Today bestselling Aces Hockey series can be read together or MAJOR MISCONDUCTOFF LIMITSICINGTOP SHELFBACK CHECKSLAP SHOTPLAYING HURTBIG STICKDon’t miss any of Kelly’s alluring The Bayard Hockey  SHUT OUT | CROSS CHECKThe Last Shot  BODY SHOT | HOT SHOT | LONG SHOTThe standalone  DANCING IN THE RAINPraise for Top Shelf“I’m a total sucker for sports romances, and so Top Shelf ticked a lot of boxes for me. If you’ve got a similar bent, I’d recommend it to you, too.”—All About Romance“Five star Top Shelf is a sweet romance with a credible couple and, as it is the third book in the Aces series, you get a feel for the way the club ticks and there are guest appearances from the stars of the previous two books. . . . Although you can read this as a stand-alone story, I thoroughly recommend that you pick up the first two in this series and catch up with the rest of the team. Go Aces!”—Angel Net Reviews “Fans of Jamieson’s silver-tongued heroes with a heart of gold will find a good deal to like here, and newcomers to the series’ will find it easy to get their footing.”—RT Book Reviews “Mixology is a special skill and Top Shelf is the only way to go. With a little sadness, a lot of heat, and crazy chemistry, this book was difficult to put down. I’ve enjoyed Jared and his bar in previous books, I loved him in this! Five stars.”—Hines and Bigham’s Literary Tryst “I loved this book. Jared and Sidney were so entertaining.”—A Crazy Vermonter’s Book Reviews Includes an excerpt from another Loveswept title.",
  "genres": [
    "Romance",
    "Sports",
    "Sports Romance",
    "Hockey",
    "Contemporary Romance",
    "Contemporary",
    "Audiobook"
  ],
  "author": "Kelly Jamieson",
  "average_rating": "4.02",
  "url": "https://www.goodreads.com/book/show/26758093-top-shelf"
}