{
  "title": "Nudity: A Cultural Anatomy",
  "description": "Nudity features regularly in all major media. So why is it illegal to appear naked in public? Nudity has always been paradoxical. In modern consumer culture, it is actively encouraged in some contexts, but criminal or deviant in others. Images of nudity are everywhere. Advertising uses nudity to sell everything from housing loans to appliances, perfume to cars. Nudity has, in fact, become the latest fashion. This is not surprising. Advertising and fashion need a constant stream of novelty and there's nothing so new as nudity, the oldest fashion of all. Aside from being big business, nudity is a legal and moral minefield, the object of psychological study, and a mundane fact of everyday life. We alternately think of it as a perversion and a state of absolute innocence. Why does nudity mean so many contradictory things, and why is it treated so differently in different contexts? Drawing on a wealth of examples from popular culture, literature, philosophy and religion, as well as first-hand interviews, A Cultural Anatomy goes deep into the naked underworld to answer these questions. Barcan encounters morticians, nudists, strippers, nurses, tattooists, artists and makers of pornography. She demonstrates that ordinary people, popular culture and high philosophy are all sources of wisdom about the naked body. Nudity is one of the most fundamental metaphors in the Western tradition - indeed, it is a metaphor for human nature itself - and yet this book is one of the first to explore its paradoxes in depth. Barcan's mission is to shine a light on a topic that has been largely ignored, even within cultural studies, despite its ability to titillate, shock or entertain. From pubic hair fashions through to a Royal \"full monty,\" A Cultural Anatomy is a fascinating blend of meaningful minutiae and big philosophical questions about the most unnatural state of nature in the modern West.",
  "genres": [
    "Nonfiction"
  ],
  "author": "Ruth Barcan",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/2675420-nudity"
}