{
  "title": "Trick or Sweet",
  "description": "Load up on pumpkin spice, grab your bowl of candy, and settle in for a spooky night with six brand-new modern Jane Austen adaptations from the authors of Holidays with Jane: Christmas Cheer and Spring Fever!  Must Be Magic by Kimberly Truesdale Eight years ago Anne Elliot made a devastating choice. When a new threat and an old love both come into her life, she faces that choice again. This time will it be love or will it be magic?  Once Upon a Story by Rebecca M. Fleming Catie Morland isn’t sure how to explain what happened at Abbey College’s annual Fall-o-Ween event until bumping into vacationing sisters Jane and Cassie. Will everything begin to make sense as she tells them the whole story?  Insensible by Cecilia Gray Miriam Dashwood has to throw a party for straight-laced Brandon Firestone without spending a dime. When the lead for rock sensation Willow Bee offers a free performance, Miriam figures he's her hero. Brandon has other ideas, but will free spirited Miriam come around to his way of thinking?  Emma Ever After by Melissa Buell Emma Woodhouse is determined that this year's Fall Ball will be the most successful one yet. An influx of single men in Highbury make a Bachelor Auction a reality. Can she work her matchmaking magic once again?  Mansfield Unmasked by Jennifer Becton An impromptu Halloween party at Mansfield Park Boarding House provides Pug an opportunity to use his magic powers to unite Pryce and Spenser. But can he expose their true feelings for each other before his powers fade?  Beyond Midnight by Jessica Grey Halloween isn't what Will Harper planned. His sister is playing fairy godmother. He’s at Chawton High's Trick or Sweet Dance. He’s in costume...and falling for Elena Marquez? Is it real or magic…and can it last Beyond Midnight?  Approx. 85k words",
  "genres": [
    "Halloween",
    "Romance",
    "Short Stories",
    "Anthologies"
  ],
  "author": "Kimberly Truesdale",
  "average_rating": "3.91",
  "url": "https://www.goodreads.com/book/show/26767008-trick-or-sweet"
}