{
  "title": "Confessions of the Pricing Man: How Price Affects Everything",
  "description": "The world s foremost expert on pricing strategy shows how this mysterious process works and how to maximize value through pricing to company and customer.In all walks of life, we constantly make decisions about whether something is worth our money or our time, or try to convince others to part with their money or their time. Price is the place where value and money meet. From the global release of the latest electronic gadget to the bewildering gyrations of oil futures to markdowns at the bargain store, price is the most powerful and pervasive economic force in our day-to-day lives and one of the least understood.The recipe for successful pricing often sounds like an exotic cocktail, with equal parts psychology, economics, strategy, tools and incentives stirred up together, usually with just enough math to sour the taste. That leads managers to water down the drink with hunches and rules of thumb, or leave out the parts with which they don t feel comfortable. While this makes for a sweeter drink, it often lacks the punch to have an impact on the customer or on the business.It doesn t have to be that way, though, as Hermann Simon illustrates through dozens of stories collected over four decades in the trenches and behind the scenes. A world-renowned speaker on pricing and a trusted advisor to Fortune 500 executives, Simon s lifelong journey has taken him from rural farmers markets, to a distinguished academic career, to a long second career as an entrepreneur and management consultant to companies large and small throughout the world. Along the way, he has learned from Nobel Prize winners and leading management gurus, and helped countless managers and executives use pricing as a way to create new markets, grow their businesses and gain a sustained competitive advantage. He also learned some tough personal lessons about value, how people perceive it, and how people profit from it.In this engaging and practical narrative, Simon\n \nleaves nothing out of the pricing cocktail, but still makes it go down smoothly and leaves you wanting to learn more and do more as a consumer or as a business person. You will never look at pricing the same way again.\"",
  "genres": [
    "Business",
    "Nonfiction",
    "Economics",
    "Buisness",
    "Management",
    "Biography",
    "Finance"
  ],
  "author": "Hermann Simon",
  "average_rating": "4.24",
  "url": "https://www.goodreads.com/book/show/26784759-confessions-of-the-pricing-man"
}