{
  "title": "Bearing False Witness: Debunking Centuries of Anti-Catholic History",
  "description": "As we all know and as many of our well-established textbooks have argued for decades, the Inquisition was one of the most frightening and bloody chapters in Western history; Pope Pius XII was anti-Semitic and rightfully called “Hitler’s Pope,” the Dark Ages were stunting the progress of knowledge to be redeemed only by the secular spirit of the Enlightenment. The religious Crusades were an early example of the rapacious Western thirst for riches and power. But what if these long held beliefs were all wrong? In this stunning, powerful, and ultimately persuasive book, Rodney Stark, one of the most highly regarded sociologists of religion and bestselling author of  The Rise of Christianity (HarperSanFrancisco 1997), argues that some of our most firmly held ideas about history, ideas that paint the Catholic Church in the least favorable light are, in fact, fiction. Why have we held these wrongheaded ideas so firmly and for so long? And if our beliefs are wrong, what is the truth? In each chapter, Stark takes on a well-established anti-Catholic myth, gives a fascinating history of how each myth became conventional wisdom and presents a startling picture of the real truth. For example, instead of the Spanish Inquisition being an anomaly of torture and murder of innocent people persecuted for “imaginary” crimes such as witchcraft and blasphemy, Stark argues that not only did the Spanish Inquisition spill very little blood, but it was a major force in support of moderation and justice. Stark dispels the myth of Pope Pius XII being apathetic or even helpful to the Nazi movement, such as to merit the title “Hitler’s Pope,” and instead shows that the campaign to link Pope Pius XII to Hitler was initiated by the Soviet Union, presumably in hopes of neutralizing the Vatican in post-World War II affairs. Many praised Pope Pius XIIs vigorous and devoted efforts to saving Jewish lives during the war. Instead of understanding the Dark Ages as a millennium of ignorance and backwardness inspired by the Catholic Church’s power, Stark argues that the whole notion of the “Dark Ages” was an act of pride perpetuated by anti-religious intellectuals who were determined to claim that theirs was the era of “Enlightenment.” In the end, readers of Bearing False Witness will have a more accurate history of the Catholic Church and will also understand why it became unfairly maligned for so long. Bearing False Witness is a compelling and sobering account of how egotism and ideology often work together to give us a false truth.",
  "genres": [
    "History",
    "Religion",
    "Catholic",
    "Nonfiction",
    "Christianity",
    "Church History",
    "Christian"
  ],
  "author": "Rodney Stark",
  "average_rating": "4.33",
  "url": "https://www.goodreads.com/book/show/26778184-bearing-false-witness"
}