{
  "title": "Father's Day",
  "description": "\"You never know what day your kids are going to remember most about growing up.You hope that it is a good day, a day when you performed well as a parent. Your greatest fear is that it will be a bad day, a day when you lost your temper or let the dog run out in front of traffic, or a day when something happened that is only talked about in front of high-priced therapists.In my case it was the day my dad bought sod.\"Thus begins Donald J. Bingle's award-winning short memoir about his father, a heart-warming, surprising, and humorous tale about how a single incident on a single summer day can become one of a child's favorite memories of his parent.This short, simple tale will bring both laughter and tears and create a lasting memory that no mass-produced Father's Day card can ever duplicate. Pre-load it on your dad's Kindle for a perfect Father's Day gift. At about 2,000 words, it is a delightful short read, not a lengthy chore.\"Father's Day\" won 1st Place in the California Literary Arts Society Memoir Contest (2009) and 2nd Place, Non-Fiction, in West Suburban Living's Annual Writing and Photography Contest (2005). It is also available as part of a deluxe 3-pack edition.Best known as the world's top-ranked player of classic role-playing games for fifteen years, Donald J. Bingle is an oft-published author in the science fiction, fantasy, horror, thriller, steampunk, romance, and comedy genres, with three published novels (Net Impact; Forced Conversion; GREENSWORD) and more than forty stories, primarily in DAW themed anthologies and tie-in anthologies, including stories in Time Traveled Tales, Sidekicks!, The Crimson Pact, Steampunk'd, Imaginary Friends, Fellowship Fantastic, Zombie Raccoons and Killer Bunnies, Time Twisters, Front Lines, Slipstreams, Gamer Fantastic, Transformers Legends, Search for Magic (Dragonlance), If I Were An Evil Overlord, Blue Kingdoms--Mages & Magic, Civil War Fantastic, Carnage & Consequences, Future Americas, All Hell Breaking Loose, The Dimension Next Door, Sol's Children, Historical Hauntings, and Fantasy Gone Wrong.Many of Don's stories are electronically available, individually or in genre collections, including \"Writer on Demand: Tales of Gamers and Gaming,\" \"Writer on Demand: Tales of Humorous Horror,\" \"Writer on Demand: Tales Out of Time,\" \"Writer on Demand: Grim, Fair e-Tales,\" \"Writer on Demand: Tales of an Altered Past Powered by Romance, Horror, and Steam,\" \"Not-So-Heroic Fantasy,\" and \"Shadow Realities.\"His story \"Gentlemanly Horrors of Mine Alone\" was the ninth story in Mike Stackpole's Chain Story Project. His original short stories, \"Season's Critiquings\" and \"Running Free: A Tale Inspired by Patsy Ann,\" are available for just 99 cents each..Donald J. Bingle is a member of the Science Fiction and Fantasy Writers of America, International Thriller Writers, the International Association of Media Tie-In Writers, the GenCon Writers Symposium, and the St. Charles Writers Group.",
  "genres": [],
  "author": "Donald J. Bingle",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/11710155-father-s-day"
}