{
  "title": "The Self-Acceptance Project: How to Be Kind and Compassionate Toward Yourself in Any Situation",
  "description": "Even after years of spiritual practice, self-improvement, or therapy, many of us still have trouble with one essential self-acceptance. How do we stop from constantly judging ourselves as inadequate, finding fault with our bodies, or being plagued by our inner critics? The Self-Acceptance Project was created to help us find a solution. In this collection of essays, contemporary luminaries in spirituality, psychology, and creativity offer insights and teachings for truly embracing who we are no matter what our circumstances, • \"Waking Up from the Trance of Unworthiness\"―Tara Brach illuminates the source of self-rejection and offers a powerful process to reverse unconscious patterns• \"Compassion for the Self-Critic\"―Dr. Kristin Neff shows how self-judgment is often a misplaced but well-meaning survival instinct• \"Held, Not Healed\"―Jeff Foster on making the space to accept anything that arises with open-hearted curiosity• \"No Strangers in the Heart\"―poet Mark Nepo helps us reconnect to the sense of deep aliveness that we were born with• \"Taking in the Good\"―Dr. Rick Hanson offers effective neuroscience-based insights and practices for overcoming our \"negativity bias\"• \"Transforming Self-Criticism into Self-Compassion\"―Dr. Kelly McGonigal reveals practical strategies for changing the habitual way we treat ourselvesWhy is it often so much easier to feel compassion and forgiveness toward others than toward ourselves? Where do our self-critical voices come from? Can we be motivated to grow and excel while still accepting ourselves as we are? In these 19 offerings, some of today’s most trusted teachers share their most valuable practices and techniques for building confidence, transforming our relationship with our inner critics, and using any circumstance as an opportunity to treat ourselves with kindness, compassion, and love.",
  "genres": [
    "Self Help",
    "Psychology",
    "Nonfiction",
    "Mental Health",
    "Health",
    "Essays",
    "Personal Development"
  ],
  "author": "Tami Simon",
  "average_rating": "3.91",
  "url": "https://www.goodreads.com/book/show/26778866-the-self-acceptance-project"
}