{
  "title": "Douglas MacArthur: American Warrior",
  "description": "A new, definitive life of an American icon, the visionary general who led American forces through three wars and foresaw his nation’s great geopolitical shift toward the Pacific Rim—from the Pulitzer Prize finalist and bestselling author of Gandhi & ChurchillDouglas MacArthur was arguably the last American public figure to be worshipped unreservedly as a national hero, the last military figure to conjure up the romantic stirrings once evoked by George Armstrong Custer and Robert E. Lee. But he was also one of America’s most divisive figures, a man whose entire career was steeped in controversy. Was he an avatar or an anachronism, a brilliant strategist or a vainglorious mountebank? Drawing on a wealth of new sources, Arthur Herman delivers a powerhouse biography that peels back the layers of myth—both good and bad—and exposes the marrow of the man beneath.MacArthur’s life spans the emergence of the United States Army as a global fighting force. Its history is to a great degree his story. The son of a Civil War hero, he led American troops in three monumental conflicts—World War I, World War II, and the Korean War. Born four years after Little Big Horn, he died just as American forces began deploying in Vietnam. Herman’s magisterial book spans the full arc of MacArthur’s journey, from his elevation to major general at thirty-eight through his tenure as superintendent of West Point, field marshall of the Philippines, supreme ruler of postwar Japan, and beyond. More than any previous biographer, Herman shows how MacArthur’s strategic vision helped shape several decades of U.S. foreign policy. Alone among his peers, he foresaw the shift away from Europe, becoming the prophet of America’s destiny in the Pacific Rim.Here, too, is a vivid portrait of a man whose grandiose vision of his own destiny won him enemies as well as acolytes. MacArthur was one of the first military heroes to cultivate his own public persona—the swashbuckling commander outfitted with Ray-Ban sunglasses, riding crop, and corncob pipe. Repeatedly spared from being killed in battle—his soldiers nicknamed him “Bullet Proof”—he had a strong sense of divine mission. “Mac” was a man possessed, in the words of one of his contemporaries, of a “supreme and almost mystical faith that he could not fail.” Yet when he did, it was on an epic scale. His willingness to defy both civilian and military authority was, Herman shows, a lifelong trait—and it would become his undoing. Tellingly, MacArthur once observed, “Sometimes it’s the order you don’t obey that makes you famous.”To capture the life of such an outsize figure in one volume is no small achievement. With MacArthur Arthur Herman has set a new standard for grappling with the legacy of this American legend.",
  "genres": [
    "Biography",
    "History",
    "World War II",
    "Nonfiction",
    "Military Fiction",
    "American History",
    "War"
  ],
  "author": "Arthur Herman",
  "average_rating": "4.48",
  "url": "https://www.goodreads.com/book/show/26767481-douglas-macarthur"
}