{
  "title": "Tocqueville: A Very Short Introduction",
  "description": "No one has ever described American democracy with more accurate insight or more profoundly than Alexis de Tocqueville. After meeting with Americans on extensive travels in the United States, and intense study of documents and authorities, he authored the landmark Democracy in America , publishing its two volumes in 1835 and 1840. Ever since, this book has been the best source for every serious attempt to understand America and democracy itself. Yet Tocqueville himself remains a mystery behind the elegance of his style.Now one of our leading authorities on Tocqueville explains him in this splendid new entry in Oxford's acclaimed Very Short Introduction series. Harvey Mansfield addresses his subject as a thinker, clearly and incisively exploring Tocqueville's writings--not only his masterpiece, but also his secret Recollections , intended for posterity alone, and his unfinished work on his native France, The Old Regime and the Revolution . Tocqueville was a liberal, Mansfield writes, but not of the usual sort. The many elements of his life found expression in his his aristocratic ancestry, his ventures in politics, his voyages abroad, his hopes and fears for America, and his disappointment with France. All his writings show a passion for political liberty and insistence on human greatness. Perhaps most important, he saw liberty not in theories, but in the practice of self-government in America. Ever an opponent of abstraction, he offered an analysis that forces us to consider what we actuallydo in our politics--suggesting that theory itself may be an enemy of freedom. And that, Mansfield writes, makes him a vitally important thinker for today.Translator of an authoritative edition of Democracy in America , Harvey Mansfield here offers the fruit of decades of research and reflection in a clear, insightful, and marvelously compact introduction.",
  "genres": [
    "History",
    "Philosophy",
    "Politics",
    "Biography",
    "Sociology",
    "Nonfiction",
    "American History"
  ],
  "author": "Harvey C. Mansfield",
  "average_rating": "3.51",
  "url": "https://www.goodreads.com/book/show/267711.Tocqueville"
}