{
  "title": "Twilight of American Sanity: A Psychiatrist Analyzes the Age of Trump",
  "description": "A landmark book, from “one of the world’s most prominent psychiatrists” (The Atlantic, June 2017): Eminent psychiatrist Allen Frances analyzes the national psyche, viewing the rise of Donald J. Trump as darkly symptomatic of a deeper societal distress. Equally challenging and profound, Twlilight of American Sanity makes sense of our time and charts the way forward.It is comforting to see President Donald Trump as a crazy man, a one-off, an exception—not a reflection on us or our democracy. But in ways I never anticipated, his rise was absolutely predictable and a mirror on our soul. … What does it say about us, that we elected someone so manifestly unfit and unprepared to determine mankind’s future? Trump is a symptom of a world in distress, not its sole cause. Blaming him for all our troubles misses the deeper, underlying societal sickness that made possible his unlikely ascent. Calling Trump crazy allows us to avoid confronting the craziness in our society—if we want to get sane, we must first gain insight about ourselves. Simply put: Trump isn’t crazy, but our society is. \n–\nfrom TWILIGHT OF AMERICAN SANITYMore than three years in the making: the world's leading expert on psychiatric diagnosis, past leader of the American Psychiatric Association’s DSM (“the bible of psychology”), and author of the influential international bestseller on the medicalization of ordinary life, Saving Normal, draws upon his vast experience to deliver a powerful critique of modern American society’s collective slide away from sanity and offers an urgently needed prescription for reclaiming our bearings. Widely cited in recent months as the man who quite literally wrote the diagnostic criteria for narcissism, Allen Frances, M.D., has been at the center of the debate surrounding President Trump’s mental state—quoted in Evan Osnos’s May 2017 New Yorker article (“How Trump Could Get Fired”) and publishing a much-shared opinion letter in the New York Times (“An Eminent Psychiatrist Demurs on Trump’s Mental State”). Frances argues that Trump is \"bad, not mad\"--and that the real question to wrestle with is how we as a country could have chosen him as our leader. Twilight of American Sanity is an essential work for understanding our national crisis.",
  "genres": [
    "Nonfiction",
    "Politics",
    "Psychology",
    "History",
    "Sociology",
    "Society",
    "United States"
  ],
  "author": "Allen Frances",
  "average_rating": "3.60",
  "url": "https://www.goodreads.com/book/show/26795354-twilight-of-american-sanity"
}