{
  "title": "Dirk Quigby's Guide to The Afterlife: All You Need To know To Choose The Right Heaven",
  "description": "\"Impish and delightful—a hilarious Zagat's Guide to Heaven!\"—Ray Bradbury\"A fantastical, profound, hilarious and rollicking good ride through the heavens and hells of the afterlife! A wonderful book.\"—Margaret ChoHell's too full, so the Devil hires ad man Dirk Quigby to pen a travel guide enticing travelers to different afterlives: Hindu, Catholic, Protestant (that one's got a lot of subdivisions), Scientologist, and more. Instead of writing a boffo bestseller, Dirk unites all religions in a common goal: kill Dirk.The New York Journal of Books.\"This is the most delightful book this reviewer has read in a while.... King does a masterful job at mixing short vignettes of Dirk’s experience with the Devil, his travels to the many heavens, his newly discovered lover, and the factual descriptions of the final paradise of each faith. The Guide to the Afterlife is a mixture of fact and fiction, faith and mysticism at its best.\"The Midwest Review of BooksShopping around for where you spend eternity can prove quite overwhelming. \"Dirk Quigby's Guide to the Afterlife: All You Need to Know to Choose the Right Heaven\" is a humorous analysis of the world's religions with a focus on the afterlife. Tying the analysis together with a quirky and offbeat novel, the laughs roll together well with plenty of substance. \"Dirk Quigby's Guide to the Afterlife\" is excellently composed and a read that is fun and very hard to set down.Boring Is Safe S. F. WeeklyIt’s well-established that the devil has the best music, roller derby teams, and cocktail mixers, so we can assume his nine circles of eternal pain and suffering are overflowing with eager participants. The premise of author E.E. King’s first novel, Dirk Quigby’s Guide to the Afterlife, is that the devil, frustrated by hell's overpopulation problem, hires an ad man to make plain-vanilla heaven appear more inviting. A mock ZAGAT Guide to the Lord's domain, Dirk Quigby’s Guide to the Afterlife is a sly and satirical glimpse into what would happen if a Madison Avenue mad man gave heaven a PR makeover. King clearly relishes her many opportunities to skewer the advertising industry and the pious, indulging in jokes at the expense of religions both venerable (Catholicism) and questionable (Scientology). As the book's framing narrative develops, the titular ad man finds that his succinct reviews of the world's religions (using a convenient ZAGAT-style rating scale) inflame believers of all faiths. It's a risk the real-life author is also taking. Considering her vocal support for scientific research and rational thought, and her role as an adviser for a number of science advocacy organizations, she probably doesn't mind a bit of religious controversy. All the better for us nonbelieving heathens: As King demonstrates, the devil also has the best jokesPublisher’s WeeklyThis ecumenically snarky review of postlife paradises spares no religion–large (Roman Catholicism) or small (Zoroastrianism), venerable (ancient Greek) or modern (Scientology)–in its attempts to rate their various comforts and costs. Wrapped in a slight frame story about an underpaid ad writer trying to stem the flow of souls to overcrowded Hell, the individual assessments include thoughtful descriptions of each “end destination,” background information on theology, and five-star ratings of perks, food, drink, music, accommodations, and ease of entry. Even top-rated afterlives get some pointed comments: Islam’s Paradise is helpfully given three stars “(For men only),” and the Baha’i faith is summarized: “If you’re a Star Trek fan and like the Federation, this is the religion for you!” Not for the easily offended of any faith.",
  "genres": [
    "Humor",
    "Fiction",
    "Religion",
    "Fantasy",
    "Science Fiction"
  ],
  "author": "E.E. King",
  "average_rating": "3.39",
  "url": "https://www.goodreads.com/book/show/26792413-dirk-quigby-s-guide-to-the-afterlife"
}