{
  "title": "Sharks: Face-to Face with the Ocean's Endangered Predator",
  "description": "Lights, cables, and teeth: The ocean s endangered predator as never seen before This stunning monster shark book will eat you alive Maxim.comMichael Muller has carved a career out of impressive encounters. Famed for his portraits of the world s most elite actors, musicians, and sports stars, he has in the last decade built up one of the most spectacular portfolios of underwater shark photography.Muller s quest is to document sharks with an unprecedented proximity and precision, bringing the Hollywood portrait session to the ocean predator. In ocean depths around the world, he approaches the sharks with a patented seven-bulb, 1200-watt plexi-encased strobe lighting rig, developed with NASA engineering, and no cage.This collection of Muller s images, including the including the first-known photograph of great white breaching at night, is a catalog of adrenaline and awe. Arranged geographically, it follows Muller s ocean adventures from black tip and sand tiger sharks in South Africa to great hammerheads in the Bahamas, with thrilling narratives from each trip documenting the challenges and near-misses along the way.To compliment Muller s work for advocacy organizations such as WildAid and EarthEcho, the images are contextualized with essays from Philippe Cousteau, Jr. and marine biologist Alison Kock, who discuss exploration and conservation of our oceanic kingdom. Culture writer Arty Nelson adds an overview of Muller s work, while a technical section explains the precise equipment behind these spectacular shots. Together, these insightful texts and awesome images offer a record of breathtaking photographic feats, a tribute to the beauty and might of the shark, and a rallying cry for its fragile future.\"",
  "genres": [
    "Nonfiction",
    "Photography",
    "Nature",
    "Animals",
    "Science",
    "Art"
  ],
  "author": "Michael Muller",
  "average_rating": "4.70",
  "url": "https://www.goodreads.com/book/show/26786848-sharks"
}