{
  "title": "Tigerheart",
  "description": "For all readers who have ever lent an enthusiastic ear to a wonderfully well told tale, or tumbled gladly into pages that could transport them anywhere, now comes novelist Peter David’s enchanting new work of fantasy. Action-packed and suspenseful, heart-tugging and wise, it weaves a spell both hauntingly familiar and utterly irresistible for those who have ever surrendered themselves to flights of fancy, and have whispered in their hearts, “I believe.”Paul Dear is a good and clever boy, doted on by a father who fills his son’s head with tall tales, thrilling legends, and talk of fairy-folk, and by a mother who indulges these fantastic stories and tempers them with common sense. But Paul is special in ways that even his adoring parents could never have imagined. For by day, in London’s Kensington Gardens, he walks and talks with the pixies and sprites and other magical creatures that dwell among the living–but are unseen by most. And at night in his room, a boy much like himself, yet not, beckons to Paul from the mirror to come adventuring. It’s a happy life for Paul, made all the more so by the birth of his baby sister.But everything changes when tragedy strikes, and Paul concludes that there’s only one course of action he can take to dispel the darkness and make things right again. And like countless heroes before him, he knows that he must risk everything to save the day.Thus begins a quest that will lead Paul down the city’s bustling streets, to a curio shop where a magical ally awaits him, and launches him into the starry skies, bound for a realm where anything is possible. Far from home, he will run with fierce Indian warriors, cross swords with fearsome pirates, befriend a magnificent white tiger, and soar beside an extraordinary, ageless boy who reigns in a boundless world of imagination.Brimming with the sly humor and breathless excitement of a traditional Victorian bedtime story, deftly embroidered with its own unique wisdom and wonder, Tigerheart is a hymn to childhood’s happiness and heartbreak, a meditation on the love, courage, sacrifice, and faith that shape us and define our lives, and a splendidly rendered modern fable–for readers of any age–that brilliantly proves itself a worthy brother to the timeless classic that serve as its inspiration.",
  "genres": [
    "Fantasy",
    "Young Adult",
    "Fiction",
    "Pirates",
    "Retellings",
    "Adventure",
    "Historical Fantasy"
  ],
  "author": "Peter David",
  "average_rating": "3.69",
  "url": "https://www.goodreads.com/book/show/2678758-tigerheart"
}