{
  "title": "Top Floor",
  "description": "At the age of sixteen, Sean O’Reilly started over in America after the influenza epidemic of 1919 killed his entire family back in Ireland. It has taken three years, but he’s built a new life for himself in Manhattan, rising from Bell Hop to Room Service Boy at the Astraea, a hotel for the wealthy. He loves his job, and life is good, until the fateful day his manager discovers a secret— a secret that could ruin Sean and everything he’s worked for.Among the richest men in New York City, one Harrison Devaux, a cranky recluse, keeps secrets of his own in the penthouse of the Astraea. No one knows why he never leaves his suite, but rumors circulate about his constant state of drunkenness and his willy-nilly firing of employees.Sean is assigned to attend Mr. Devaux, and events don’t go well when the two men first meet. But Sean soon finds out that Mr. Devaux isn’t exactly as the rumors portrayed. Maybe a Room Service Boy and a billionaire businessman have more in common than one might expect.This story was written as a part of the M/M Romance Group's \"Love is an Open Road\" event. Group members were asked to write a story prompt inspired by a photo of their choice. Authors of the group selected a photo and prompt that spoke to them and wrote a short story. Photo Description: Two pieces of art, the first is of a smiling, redheaded Room Service Boy wearing a bright-red uniform and cap. He is reading a card and has pulled his penis out of his trousers laying it on a plate on his service cart. The second picture is of a handsome, and shirtless, dark-haired man looking off in the distance. Roses frame the man’s image.This story may contain sexually explicit content and is intended for adult readers. It may contain content that is disagreeable or distressing to some readers. The M/M Romance Group strongly recommends that each reader review the General Information section before each story for story tags as well as for content warnings.",
  "genres": [
    "Historical",
    "M M Romance",
    "Historical Fiction",
    "Romance",
    "LGBT",
    "Erotica",
    "Historical Romance"
  ],
  "author": "K.C. Faelan",
  "average_rating": "3.69",
  "url": "https://www.goodreads.com/book/show/26789997-top-floor"
}