{
  "title": "Christmas in the City",
  "description": "Fourteen newly written stories by fifteen Authors in the City authors. This anthology will benefit a children's hospital in the Florida area where the 2016 Authors in the City book signing will be held. Authors in the City is hosted by Stephanie's Book Reports.Waiting for Midnight - Samantha ChaseMaddie’s wishing for a little holiday magic with her sexy neighbor Noah.White Christmas - AJ HarmonLisa, a happy and well-adjusted 14 year old, decides that it’s time to meet her birth parents.April and Erik haven’t seen each other since high school graduation 12 years ago. How will they react when they are both invited to a Halloween party? They are about to come face to face with the past they are both still trying to forget. This heart-warming novella celebrates family, acceptance and forgiveness, as hearts are healed and new bonds formed.Holiday With Holli - S.M. DonaldsonHolli and Zack have despised each other their entire lives. A trip home for the holidays makes them pose the question… Can a few hot moments make it possible for these two to de-frost their old relationship and start a new one?One Hot Christmas - A.D. JusticeWhen rock stars have too much time on their hands, they naturally turn to one thing...having a good time. A girlfriend. An ex-girlfriend. A best friend. A matchmaker. Four rock stars on tour. Plans are bound to backfire, but when they go right, it creates One Hot Christmas.Nick - AM MaddenA one-night stand that broke all the rules. It was supposed to be one night. It was supposed to be meaningless--with no emotion. Just desire and passion. But it was so much more... By definition, a one-night stand is simply a sexual encounter lasting only a single night. Meaningless, mindless, detached fornication without an expectation of further relations. Each party then resumes their lives as if never having met the other. On a snowy night in Chicago, Nick and Angela had a one-night stand…and rewrote the definition.Coming Home - Taryn PlendiShe wanted a one night stand. He wanted more. Iowa winters can be brutally cold, but when Ella Marks and Matteo Lazos get together, the results are sizzling. When life is up in the air, sometimes coming home for the holidays is the only way to find solid ground.Tangled in Tinsel - Mariah DietzChristmas is in three days, and I have eight states to cross before I get home. Mother Nature and kismet have joined forces in an attempt to ruin this holiday season as flights across the East Coast have been canceled due to a snowstorm. I hate traveling nearly as much as I hate the snow.How is kismet involved, you ask? Carter O’Brien is trying to get home as well. Do you know what I hate more than snow and traveling? Carter O’Brien.Stay Awhile - Gia RileyGarrett Kristoff’s living the life he’s always wanted, yet something’s missing. As a well-respected surgeon, he’s seen it all. But even he isn’t prepared for his next case. Should he tempt fate or play it safe? There’s too much on the line to get it wrong. Megan Campbell’s married to her high school sweetheart. Their entire world revolves around their beautiful little girl. But seven years into their marriage, tragedy strikes, revealing her husband’s secrets. Life can change in the blink of an eye. Will Megan hold onto the only man she's ever loved, or accept the truth that will change her world forever? This Christmas, they could all use a miracle.White Midnight - Shari J. RyanChristmas isn’t the same anymore, but at least I still have my little tree and the two unopened gifts that will forever haunt me. That’s what Christmas is to me now—sadness and bad luck. But then I met Bex in the middle of a blizzard in the mountains of New Hampshire (Did I mention I’m from Florida?). A chance encounter with this ruggedly good-looking mountain-man might just make me question how bad my luck really is. A Holiday Discovery - Ellie KeysMaria, a reporter, is in the center of a big story while on a trip. The decision: adventurous holiday or career goldmine?Christmas Letters - Christina BenjaminRae has never loved Christmas much. Bouncing from place to place in the foster system didn’t afford her very fond holiday memories. This Christmas is proving to be one of her most difficult yet when she starts to receive mysterious letters counting down the 12 days until Christmas. At first she thinks the letters are just a prank, but whoever is sending them knows startling details about her life and most recent failed relationship. Will the clues from the cryptic letters leave her broken hearted or could this be the Christmas miracle she’s been waiting for?All I Want for Christmas - Misha ElliottAll Adrianna Lutz wants is for the holidays to be over. This year an unexpected prize sends her to the Caribbean with her best friend, brother and an unexpected guest. The boy who was once the bane of her existence. Seeing him face to face brings back unwanted feelings. To Eric Wayne, Adrianna was nothing more than the annoying little sister of his best friend—until the night they shared an amazing kiss. Now she’s all grown up and all he wants is her. Will time in paradise with Eric be what she needs to bring back the holiday spirit?Repairing Christmas - Sidonia RoseThe presents are wrapped, the semester is finishing up, and it’s almost time for Christmas.Christmas has always been the same, quiet and cozy at home. Miranda is changing things and spending this Christmas with her boyfriend, until he becomes her ex-boyfriend and breaks their plans. Christmas for Glenn is about family and their annual holiday party. Until he meets Miranda and discovers that some things don’t have to be broken to be fixed.Finding Christmas - Elizabeth Hayes & Ashlee TaylorChristmas hi-jinks & practical jokes are all fun and games until someone's water breaks.",
  "genres": [
    "Christmas",
    "Anthologies",
    "Holiday",
    "Romance",
    "Short Stories",
    "Contemporary Romance"
  ],
  "author": "Samantha Chase",
  "average_rating": "4.27",
  "url": "https://www.goodreads.com/book/show/26796087-christmas-in-the-city"
}