{
  "title": "Never a Dull Moment: 1971 The Year That Rock Exploded",
  "description": "**One of Amazon's Best Books of 2016: Top 100 Editors' Picks**A rollicking look at 1971, rock’s golden year, the year that saw the release of the indelible recordings of Led Zeppelin, David Bowie, the Who, Rod Stewart, Carole King, the Rolling Stones, and others and produced more classics than any other year in rock historyThe Sixties ended a year late. On New Year’s Eve 1970 Paul McCartney instructed his lawyers to issue the writ at the High Court in London that effectively ended the Beatles. You might say this was the last day of the pop era.1971 started the following day and with it the rock era. The new releases of that hectic year―Don McLean’s “American Pie,” Sly Stone’s “Family Affair,” Marvin Gaye’s “What’s Going On,” Joni Mitchell’s “Blue,” Led Zeppelin’s “Stairway To Heaven,” the Who’s “Baba O’Riley,” and many others―are the standards of today.David Hepworth was twenty-one in 1971, and has been writing and broadcasting about music ever since. In this entertaining and provocative book, he argues that 1971 saw an unrepeatable surge of musical creativity, technological innovation, naked ambition and outrageous good fortune that combined to produce music that still crackles with relevance today. There’s a story behind every note of that music. From the electric blue fur coat David Bowie wore when he first arrived in America in February to Bianca’s neckline when she married Mick Jagger in Saint-Tropez in May, from the death of Jim Morrison in Paris in July to the re-emergence of Bob Dylan at Madison Square Garden in August, from the soft launch of Carole King’s “Tapestry” in California in February to the sensational arrival of Led Zeppelin’s “Stairway To Heaven” in London in November, Hepworth’s forensic sweep takes in all the people, places and events that helped make 1971 rock’s unrepeatable year.",
  "genres": [
    "Music",
    "Nonfiction",
    "History",
    "Pop Culture",
    "Audiobook",
    "Historical",
    "Cultural"
  ],
  "author": "David Hepworth",
  "average_rating": "3.94",
  "url": "https://www.goodreads.com/book/show/26792278-never-a-dull-moment"
}