{
  "title": "The Play",
  "description": "A troubled Scottish rugby player who doesn't play by the rules. A vivacious man-eater who's given up on love. When it comes to Lachlan and Kayla, opposites don't just attract - they explode.  From the New York Times, Wall Street Journal and USA Today Bestselling author of The Pact and The Offer, comes The Play, a standalone spinoff and contemporary romance about taking chances and rescuing hearts.  Kayla Moore has always been comfortable with her feisty, maneating reputation. At least it was fine until she hit her thirties and saw her best friends Stephanie and Nicola settle down with Linden and Bram McGregor, leaving Kayla to be the odd one out. Tired of being the third wheel with nothing but one-night stands and dead-end dates in San Francisco, Kayla decides to take a vow of celibacy and put men on the backburner.  That is until she lays her eyes on Linden and Bram’s cousin, hot Scot Lachlan McGregor. Lachlan is her sexual fantasy come to life – tall, tatted, and built like a Mack truck. With a steely gaze and successful rugby career back in Edinburgh, he’s the kind of man that makes her want to throw her vow right out the window. But Lachlan’s quiet and intense demeanor makes him a hard man to get to know, let alone get close to.  It isn’t until the two of them are thrown together one long, unforgettable night that Kayla realizes there is so much more to this brooding macho man than what meets the eye. But even with sparks flying between the two, Lachlan can’t stay in America forever. Now, Kayla has to decide whether to uproot her whole life and chance it all on someone she barely knows or risk getting burned once again.  Sometimes love is a game that just needs to be played.",
  "genres": [
    "Romance",
    "Sports",
    "Contemporary Romance",
    "Contemporary",
    "New Adult",
    "Sports Romance",
    "Adult"
  ],
  "author": "Karina Halle",
  "average_rating": "4.11",
  "url": "https://www.goodreads.com/book/show/26801732-the-play"
}