{
  "title": "Combat de nègre et de chiens: (suivi des) Carnets",
  "description": "(…) Combat de nègre et de chiens ne parle pas, en tout cas, de l'Afrique et des Noirs – je ne suis pas un auteur africain –, elle ne raconte ni le néocolonialisme ni la question raciale. Elle n'émet certainement aucun avis.Elle parle simplement d'un lieu du monde. On rencontre parfois des lieux qui sont, je ne dis pas des reproductions du monde entier, mais des sortes de métaphores, de la vie ou d'un aspect de la vie, ou de quelque chose qui me paraît grave et évident, comme chez Conrad par exemple les rivières qui remontent dans la jungle... J'avais été pendant un mois en Afrique sur un chantier de travaux publics, voir des amis. Imaginez, en pleine brousse, une petite cité de cinq, six maisons, entourée de barbelés, avec des miradors ; et, à l'intérieur, une dizaine de Blancs qui vivent, plus ou moins terrorisés par l'extérieur, avec des gardiens noirs, armés, tout autour. C'était peu de temps après la guerre du Biafra, et des bandes de pillards sillonnaient la région. Les gardes, la nuit, pour ne pas s'endormir, s'appelaient avec des bruits très bizarres qu'ils faisaient avec la gorge... Et ça tournait tout le temps. C'est ça qui m'avait décidé à écrire cette pièce, le cri des gardes. Et à l'intérieur de ce cercle se déroulaient des drames petits-bourgeois comme il pourrait s'en dérouler dans le seizième arrondissement : le chef de chantier qui couchait avec la femme du contremaître, des choses comme ça...Ma pièce parle peut-être un peu de la France et des Blancs : une chose vue de loin, déplacée, devient parfois plus symbolique, parfois plus déchiffrable. Elle parle surtout de trois êtres humains isolés dans un lieu du monde qui leur est étranger, entourés de gardiens énigmatiques. J'ai cru – et je crois encore – que raconter le cri de ces gardes entendu au fond de l'Afrique, le territoire d'inquiétude et de solitude qu'il délimite, c'était un sujet qui avait son importance (…).",
  "genres": [
    "Plays",
    "Theatre",
    "France",
    "French Literature",
    "Classics",
    "Africa",
    "Drama"
  ],
  "author": "Bernard-Marie Koltès",
  "average_rating": "3.67",
  "url": "https://www.goodreads.com/book/show/2679950-combat-de-n-gre-et-de-chiens"
}