{
  "title": "How Huge the Night",
  "description": "Fifteen-year-old Julien Losier just wants to fit in. But after his family moves to a small village in central France in hopes of outrunning the Nazis, he is suddenly faced with bigger challenges than the taunting of local teens. Nina Krenkel left her country to obey her father’s dying Take your brother and leave Austria. Burn your papers. Tell no one you are Jews. Alone and on the run, she arrives in Tanieux, France, dangerously ill and in despair. Thrown together by the chaos of war, Julien begins to feel the terrible weight of the looming conflict and Nina fights to survive. As France falls to the Nazis, Julien struggles with doing what is right, even if it is not enough―and wonders whether or not he really can save Nina from almost certain death. Based on the true story of the town of Le Chambon―the only French town honored by Israel for rescuing Jews from the Holocaust― How Huge the Night is a compelling, coming-of-age drama that will keep teens turning the pages as it teaches them about a fascinating period of history and inspires them to think more deeply about their everyday choices. \"The Munns have written an engrossing historical novel that is faithful to the actual events of World War II in western Europe during the tumultuous year 1940. But How Huge the Night is more than good history; it is particularly refreshing because the reader sees the conflict through the lives of teenagers who are forced to grapple with their honest questions about the existence and goodness of God in the midst of community, family, and ethnic tensions in war-ravaged France.\"-- Lyle W. Dorsett , Billy Graham Professor of Evangelism, Beeson Divinity School, Samford University \"Seldom have the horrors of war upon adolescents--or the heroism of which they are capable--been so clearly portrayed. I loved this coming-of-age story.\"-- Patricia Sprinkle , author of Hold Up the Sky \"The book expertly weaves together the lives of its characters at a frightening moment in conflicted times. As we read of their moral dilemmas and of their choices, we too wonder, Would I do as these in the story have done?\" -- Karen Mains , Director, Hungry Souls",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Christian Fiction",
    "Young Adult",
    "Historical",
    "World War II",
    "Holocaust"
  ],
  "author": "Heather Munn",
  "average_rating": "3.81",
  "url": "https://www.goodreads.com/book/show/10181988-how-huge-the-night"
}