{
  "title": "Alpha",
  "description": "Zane Six years ago, I did something I shouldn’t have done. I took something that didn’t belong to me. It had felt good, so damn good. It was a night I’d never forget. One that would ruin her for other men. But there’s always a price to pay when you break the rules. I just didn’t realize she’d be the one to pay it. I didn’t know that my weakness would destroy her life, take away everyone she loved. I was son of Alpha. A hunter. I was a cocky SOB. I’d been sent to find Aria Hale and her family. They’d said it was to bring them home. But that was a lie. That night six years ago was when I learned what betrayal was. When those I trusted destroyed what I’d come to love. I ran that night, leaving everything behind, leaving her behind. But when your Alpha’s son, when you have his blood in your veins, no matter how fast or how far you run, you’re never really out. I was a fool to ever think I was. I never expected to see Aria again, but here she was, six years later, standing on my doorstep, looking for answers, trying to understand something that couldn’t be understood. She had every right to know the truth about the night her family was murdered, but I couldn’t give it to her. She didn’t belong in our world, we were monsters. And as powerful as the urge to claim her was, she couldn’t belong to me. I’d do whatever it took to keep her from ever finding out what I really was, what really happened that night, because if she did, she’d hate me. I could live with blood on my hands. I could exist without her if it meant keeping her safe. I just couldn’t live knowing she hated me. Aria I guess he thought I’d leave the past alone. Forget it and walk away, like he had. Like it meant nothing. Like I meant nothing. Six years had passed since the night my life changed forever. The night I lost everything. It was supposed to be the happiest of my life, but it had turned into a nightmare that ripped everything and everyone I loved from me, leaving me alone and lost, stumbling in the dark for answers. Zane Von knew more about that night than he let on. He was the key to understanding what had happened when my family was killed. To learning why they died and I didn’t. Whether he liked it or not, our lives were bound together irrevocably and if he thought I’d turn my back on the past, well, then he didn’t know me as well as he thought. Note: Alpha is a standalone paranormal (shapeshifter) romance. The story is dark and gritty with strong language and dirty, kinky sex. No cliffhanger.",
  "genres": [
    "BDSM",
    "Paranormal Romance",
    "Erotica",
    "Dark",
    "Paranormal",
    "Shapeshifters",
    "Romance"
  ],
  "author": "Natasha Knight",
  "average_rating": "3.75",
  "url": "https://www.goodreads.com/book/show/26806866-alpha"
}