{
  "title": "The Gardener",
  "description": "Adam is an introvert. He lives alone and he's doing everything he can to keep it that way. \"I prefer plants to people,\" he tells his only friend, Donna. \"It's just the way I am.\" An accountant by day, he spends his free time tending his impressive garden and reading grim 19th century novels from the private library in his Victorian house. His cautious, predictable life is governed by a set of sensible rules, just the way he likes it. One winter day, a young man shows up to ask about the apartment for rent above the garage. Adam quickly decides Sam is not a suitable applicant, no matter how polite and attractive he is. Unless, just once, Adam bends his rules. How bad could it be? Adam would never let things get out of control . . . would he?What follows is a humorous emotional roller coaster involving social awkwardness, gardening, classic literature, flirting, doughnuts, office politics, a southern lady, pickup trucks, ice cream, dish washing, sex, a stern Scotswoman, great meals, homophobia, arson, the police, psychotherapy, a renovation project, and a guy who calls everyone \"dude.\" Did I mention murder? And what about that handsome guy at the office who compliments Adam's ugly necktie? What does he want? Nope . . . Adam would never lose control of his life! With a full cast of well-developed characters, The Gardener depicts a journey of self-discovery that explores the many variations of love, relationships, commitment, fidelity, and family.~~~~~~This is a full-length contemporary M/M novel written by a gay man with twenty-five years of experience as a mental health professional helping gay men deal with depression, anxiety, relationship problems, and other issues. I did not write this novel to make money. While much of the story is humorous, it could be classified as a “dark romance.” It does not follow the predictable formulas of most romance novels because I don’t like romance novels. This is more of a love story than a romance.If you can’t cope with the full range of human emotions, or if you don’t like to read about fictional characters who make choices you wouldn’t make, or if you are someone who wants trigger warnings for anything other than flashing lights that might cause seizures, you probably shouldn’t read this book. Romance is easy. Real love is not for the faint of heart.(There are no flashing lights in this novel.)",
  "genres": [
    "M M Romance",
    "Contemporary",
    "Gay",
    "Romance",
    "LGBT",
    "Fiction",
    "Queer"
  ],
  "author": "Charles Reeza",
  "average_rating": "4.33",
  "url": "https://www.goodreads.com/book/show/26810079-the-gardener"
}