{
  "title": "Unaccountable: Truth and Lies on Parliament Hill",
  "description": "A unique insider's account of the Harper government so damning that it cannot be ignored     In March 2008, Kevin Page was appointed by the federal Conservatives to be the country's first Parliamentary Budget Officer. The move fulfilled a Tory campaign promise to deliver greater government transparency and accountability. He was later denounced by the same people who appointed him to scrutinize their spending. When he challenged the government on several issues--most notably about the true costs of the F-35 fighter planes--and publicly claimed the government was misleading Canadians, Page was vilified. He was called \"unbelievable, unreliable and incredible\" by then-Finance Minister Jim Flaherty. Page's term was not extended and he retired from the civil service.     Page's assessment of the F-35 procurement was proven right, a major embarrassment to the Harper government. But Page's overriding concern is that Parliament does not get the information and analysis it needs to hold the executive (the prime minister and cabinet) to account. Parliament, he argues, is broken, with power centralized in the PMO. The civil service appears cowed, and members of parliament almost never see enough financial analysis to support the policy decisions they make. That was true at various times on the tough-on-crime legislation, new military procurement as well as changes to the Canada Health Transfer and Old Age Security.      In this shocking insider's account, Page argues that democracy is being undermined by an increasingly autocratic government that does not respect facts that run counter to its political agenda. Elected officials need accurate, independently verified data to support the implementation of policies and programs. In Unaccountable, Page tells all Canadians why we should be concerned.",
  "genres": [
    "Politics",
    "Nonfiction",
    "Canada",
    "History"
  ],
  "author": "Kevin Page",
  "average_rating": "3.93",
  "url": "https://www.goodreads.com/book/show/26815393-unaccountable"
}