{
  "title": "Gentleman Junkie and Other Stories of the Hung-Up Generation",
  "description": "The original 50 cent paperback edition of this book now goes for $100 in rare book auctions. Why? Because it contains 25 of the best, hardest-to-find stories of the writer the Washington Post calls \"one of the great living American short story writers,\" the unpredictable Harlan Ellison.Bold and uncompromising, Gentleman Junkie and Other Stories of the Hung-up Generation is a watershed moment in Harlan Ellison’s early writing career. Rather than dealing in speculative fiction, these twenty-five short stories directly tackle issues of discrimination, injustice, bigotry, and oppression by the police. Pulling from his own experience, Ellison paints vivid portraits of the helpless and downtrodden, blazing forth with the kind of unblinking honesty that would define his career. ContentsForeword (Gentleman Junkie and Other Stories of the Hung-Up Generation) • (1961) • essay by Frank M. RobinsonIntroduction: The Children of Nights • (1975) • essayFinal Shtick • (1960) • short story Gentleman Junkie • (1961) • short story May We Also Speak? • (1961) • essay Daniel White for the Greater Good • (1961) • short story Lady Bug, Lady Bug • (1961) • short story Free with This Box! • (1958) • short story There's One on Every Campus • (1959) • short story At the Mountains of Blindness • (1961) • short story This Is Jackie Spinning • (1959) • short story No Game for Children • non-genre • (1959) • short story The Late, Great Arnie Draper • (1961) • short story High Dice • (1961) • short story Enter the Fanatic, Stage Center • (1961) • short story Someone Is Hungrier • (1960) • short story Memory of a Muted Trumpet • non-genre • (1960) • short story Turnpike • (1961) • short story Sally in Our Alley • (1959) • short story The Silence of Infidelity • non-genre • (1957) • short story Have Coolth • (1959) • short story RFD #2 • (1957) • short story by Harlan Ellison and Henry SlesarNo Fourth Commandment • (1956) • short story The Night of Delicate Terrors • (1961) • short story",
  "genres": [
    "Fiction",
    "Short Stories",
    "Science Fiction",
    "Speculative Fiction",
    "Crime",
    "Horror",
    "Science Fiction Fantasy"
  ],
  "author": "Harlan Ellison",
  "average_rating": "3.99",
  "url": "https://www.goodreads.com/book/show/268098.Gentleman_Junkie_and_Other_Stories_of_the_Hung_Up_Generation"
}