{
  "title": "Work Like Any Other",
  "description": "In this astonishingly accomplished, morally complicated, “exceptional and starkly beautiful debut” (Kevin Powers, National Book Award–nominated author of The Yellow Birds), a prideful electrician in 1920s rural Alabama struggles to overcome past sins and find peace after being sent to prison for manslaughter.Roscoe T Martin set his sights on a new type of power spreading at the start of the twentieth century: electricity. It became his training, his life’s work. But when his wife, Marie, inherits her father’s failing farm, Roscoe has to give up his livelihood, with great cost to his sense of self, his marriage, and his family. Realizing he might lose them all if he doesn’t do something, he begins to use his skills as an electrician to siphon energy from the state, ushering in a period of bounty and happiness. Even the love of Marie and their child seem back within Roscoe’s grasp.Then a young man working for the state power company stumbles on Roscoe’s illegal lines and is electrocuted, and everything changes: Roscoe is arrested; the farm once more starts to deteriorate; and Marie abandons her husband, leaving him to face his twenty-year sentence alone. Now an unmoored Roscoe must carve out a place at Kilby Prison. Climbing the ranks of the incarcerated from dairy hand to librarian to “dog boy,” an inmate who helps the guards track down escapees, he is ultimately forced to ask himself once more if his work is just that, or if the price of his crimes—for him and his family—is greater than he ever let himself believe.Gorgeously spare and brilliantly insightful, Work Like Any Other is “a striking debut about love and redemption, the heavy burdens of family and guilt, and learning how to escape them…Virginia Reeves is a major new talent” (Philipp Meyer, New York Times bestselling author of The Son).",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Literary Fiction",
    "Historical",
    "Southern",
    "Book Club",
    "Novels"
  ],
  "author": "Virginia  Reeves",
  "average_rating": "3.73",
  "url": "https://www.goodreads.com/book/show/26809893-work-like-any-other"
}