{
  "title": "Valhalla",
  "description": "Three people wash up on the beach near the village of the original CP-4 colony. They are all three near death and claim to have lost their ocean vessel to a powerful hurricane. They also claim that their ship was a trade vessel running a regular shipping route between two nations. If their stories are correct, then Kepler Moon Alpha was already colonized in two other locations and it would mean there were already thousands or even millions of people already living on their world. Yet the CP-4 colony never saw any evidence of their presence before now. They also learn that according to everyone on Earth, yet again, everyone in the CP-4 colony is presumed dead and has been for several years. Their newfound curiosity would lead to an investigation that could most certainly prove quite deadly.  Colonization Saga: Kepler Moon Alpha (Book 1) Black Hole (Book 2) The Gateway (Book 3) Valhalla (Book 4) Fossil (Book 5)Warrior of the Myst (Book 6)Warrior of the Myst II (Book 7)  Brought to you by the author of the international bestselling novel “The Mystic Saga”. Scott McElhaney brought the concept of serial novels back to science fiction after the idea lie dormant for many decades. Why spend $9.99 on a novel only to discover after the first eighty pages that you really don’t like it? The 99-cent serial novel gives you a full 80-100 page story that in itself can stand alone. If you like it, you’ll find another 99-cent continuation within the next month. If you didn’t like it, you only wasted 99 cents. If you stick with the whole story, you won’t have spent more than $5.00 and hopefully you enjoyed it even more than those ten-dollar novels. The Mystic Saga started out as a serial novel and now you can buy the whole 550-page omnibus for $2.99. That’s the way we roll around here.  Over 250,000 copies of McElhaney’s book have been downloaded worldwide!",
  "genres": [],
  "author": "Scott McElhaney",
  "average_rating": "4.31",
  "url": "https://www.goodreads.com/book/show/26809568-valhalla"
}