{
  "title": "Captain Z-Ro's Indispensable Book of Days",
  "description": "Already sold out in the future, this is a book no time-traveler can do without! Have you ever had the embarrassing experience of encountering a famous space explorer on a lost planet or perhaps being interrogated by a super villain in his or her secret orbital lair and not realizing that it’s their birthday? We’ve all had this happen…you’re traveling through time and stop for a cocktail. Only later do you realize that if you’d traveled one day farther in either direction you would have been present at an amazing discovery or, more important, missed a really horrible disaster. Awkward! With Captain Z-Ro’s Indispensable Book of Days, you no longer need to guess whether the radium your time machine requires for fuel has been discovered yet, or if you still have a couple more days to enjoy beautiful Krypton. From Captain Z-Ro, celebrated explorer of time and space, comes this handy pocket guide to orienting oneself in the space-time continuum. The day book’s easy-to-use calendar lists the birthdays of many of the most important scientists, artists, writers, directors, actors, cosmic explorers, super heroes, and monsters. (You REALLY don't want to forget Godzilla's birthday!) There’s also room by each day to write your own notes so you don’t forget that clandestine meeting, fatal deadline, or critical warp drive parts shopping list. Know the dates of inexplicable events, planetary cataclysms, fantastic discoveries, and alien invasions -- Captain Z-Ro’s Indispensable Parallel Universe Book of Days is invaluable for successful cross-time real-estate and stock investment, or just knowing when it’s time to warm up your art-deco void cruiser and get the hell out before that Vogon constructor fleet arrives. The Book of Days is stuffed to the hull-plates with Earth’s history on this plane and all the most contiguous alternate worlds. It even includes a new introduction by the famous time traveler Enoch Soames. Captain Z-Ro’s Indispensable Book of Days is the perfect gift for that avid parallel universe historian or hard-to-buy-for dimensional exile! …but the Book of Days isn’t just a calendar! The Book of Days is filled with convenient maps and tables arranged for quick reference during stressful moments. Perhaps you’ve been wondering how many years have passed on Earth since you blasted off for outer space? Is that warning sign in Vulcanese, Galifrean, or Kryptonian? Need to know when the radiation has died down and it’s safe to leave the vault? …or maybe you’re just trying to settle a bar bet in some joint on Tatooine. Captain Z-Ro’s Indispensable Book of Days has you covered! Here are just some of the things readers have said about the Book of Days:\"Whoa!” - Bill Preston and Ted Logan, founders of The Wyld Stalyns“I keep my copy with my towel.” - Ford Prefect, notable hitchhiker“The perfect reference to help one think the unthinkable, do the undoable, and eff the ineffable.” - Dirk Gently, holistic detective“Where you’re going, you may not need roads, but you’ll need a copy of the Book of Days.” - Dr. Emmet Brown, eminent scientist“A smegging good read in the loo.” - Dave Lister Jr. and Sr., 3rd Class Technician, Red DwarfGlance at a copy, and you’ll see why Captain Z-Ro’s Indispensable Parallel Universe Book of Days can be found in tardis reference libraries, the ruins of non-Euclidian pre-human cities, space port bars, and starship bathrooms throughout the known and unknown universe. Don’t be caught hopelessly wandering the endless corridors of space and time without it!",
  "genres": [],
  "author": "Bill Whitcomb",
  "average_rating": "3.75",
  "url": "https://www.goodreads.com/book/show/26809078-captain-z-ro-s-indispensable-book-of-days"
}