{
  "title": "Murder at the Lighthouse",
  "description": "What would you do if you found a body under a lighthouse?  Love Agatha Christie-style murder mysteries, cosy crime, clever animals and cake, and Murder at the Lighthouse, the first in a fun series of mysteries set in a small English seaside town in Somerset, is for you.  The body on the beach throws Libby Forest's new life into turmoil. Everyone in town knows the dead woman under the lighthouse, but no one seems to care how or why she died. Only Libby believes someone murdered the ageing rock-star.  A woman talks to Libby. Then she, too, dies...  Discover how Exham on Sea's first female sleuth, helped by an enormous dog called Bear and an aloof marmalade cat, unpicks the clues to solve the mystery.  Amateur female sleuth Libby Forest arrives in the small town after years in a disastrous marriage, determined to build a new life making cakes and chocolates in Exham on Sea. She joins forces with the attractive but secretive Max Ramshore and risks the wrath of the townspeople as she pieces together the jigsaw to solve the mystery of Susie Bennett's death.  The first short read in the series, set in the coastal resort of Exham on Sea, Murder at the Lighthouse introduces a cast of colourful local characters, including Mandy the teenage Goth, Frank the baker and Detective Sergeant Joe Ramshore, Max's estranged son.  The green fields, rolling hills and sandy beaches of the West Country provide a perfect setting for crime, intrigue and mystery.  For lovers of Agatha Christie novels, Midsomer Murders, lovable pets and cake, the series offers a continuing supply of quick crime stories to read in one sitting, as Libby solves a mixture of intriguing mysteries and uncovers the secrets of the small town's past.",
  "genres": [
    "Mystery",
    "Cozy Mystery",
    "Crime",
    "Fiction",
    "Audiobook",
    "Cozy",
    "Amazon"
  ],
  "author": "Frances Evesham",
  "average_rating": "3.83",
  "url": "https://www.goodreads.com/book/show/26824951-murder-at-the-lighthouse"
}