{
  "title": "Selected Stories",
  "description": "Fifty-two stories spanning Chekhov’s career.Anton Chekhov’s Selected Stories contains a wide spectrum of classics and new favorites, including “Ward No. 6,” “The Lady with the Little Dog,” “Anna on the Neck,” “The Name-Day Party,” “The Kiss,” An Incident at Law,” and “Elements Most Often Found in Novels, Short Stories, Etc.” This edition features twenty-five brand-new translations, commissioned expressly for this volume from Richard Pevear and Larissa Volokhonsky, Peter Constantine, Rosamund Bartlett, Michael Henry Heim, among others. Twenty translations have been selected from the published work of such master translators as Patrick Miles and Harvey Pitcher, Ann Dunnigan, and Ronald Hingley. Seven additional translations are by Constance Garnett, substantially revised by Cathy Popkin. All stories are annotated to clarify unfamiliar material and to point out differences in the translators’ strategies.'Life and Letters' includes a rich selection of Chekhov’s letters, some in English for the first time, some with previously redacted passages restored, as well as Aileen Kelly’s portrait of Chekhov.“Criticism” explores the wide range of approaches and interpretations in two sections. “Approaches” juxtaposes five different perspectives on how to read Chekhov, represented by Peter Bitsilli, Alexander Chudakov, Robert Louis Jackson, Vladimir Kataev, and Radislav Lapushin. “Interpretations” contains ten divergent readings of stories in this edition. Case studies include Michael Finke on “At Sea”; Cathy Popkin on “[A Nervous] Breakdown”; Julie de Sherbinin on “Peasant Women”; Liza Knapp on “Ward No. 6”; Robert Louis Jackson on “Rothschild’s Fiddle” and “The Student”; Wolf Schmid on “The Student”; John Freedman on “Man in a Case,” “Gooseberries,” and “About Love”; Caryl Emerson on “A Calamity,” “Anna on the Neck,” “About Love,” and “The Lady with the Little Dog”; and Rufus Mathewson on “The Lady with the Little Dog” and “The Beauties.”A Chronology and Selected Bibliography are included, as is a postscript on the translators and their work. A special section, “Comparison Translations,” gives passages from selected stories in multiple translations.",
  "genres": [
    "Short Stories",
    "Fiction",
    "Classics",
    "Russia",
    "Russian Literature",
    "19th Century",
    "Literature"
  ],
  "author": "Anton Chekhov",
  "average_rating": "4.04",
  "url": "https://www.goodreads.com/book/show/26821731-selected-stories"
}