{
  "title": "When We Were Kings",
  "description": "ON THE FIRST DAY SHE MET HER MATCH. THEN SHE KILLED 16 MEN. Tossed into the gladiator arena,  the delicate girl in the fancy pink dress should have been the first to die. Leyli had other plans. Surviving was at the top of her list. Revenge was a close second.Having grown up behind the sheltered walls of the Oberhame Palace, she knew what the crowd wanted. Norihame had built their culture from the scraps of their neighbors. Gladiators were just one part. Evidently, political coups were another, and she'd just become a pawn in the games of men. But why was she still alive?  They'd killed her brother, the heir to the throne. Had they gotten to her father?  Was the king dead? In the cell beside her,  the Lion of Lenlochlien was impressed. The first day, they all cried. Men, women, it didn't matter. But this one was different. Her tears didn't slow her down, they just made her stronger, and when he looked in her eyes, he saw it. Her desperation was feral. It meant she wouldn't hesitate to do what she had to. She might be cornered, but that bitch was the kind that would bite. When he offered advice, she took it. When he told her how to be better, she tried. When she kept coming back after each round, he dared to hope that she'd survive. He had no idea that he was about to become her best weapon.  Leyli didn't just want to live through the games, she wanted to protect her father's throne, but to do that, she had to become someone else. She couldn't be the Princess of Norihame. The Lion had to make her a Wolf. Chained side by side, he'll show her how to be a killer. She'll give him a reason to keep fighting. Together, they'll learn that it takes a friend to survive. ** When We Were Kings is a complete novel without a cliffhanger ending. **",
  "genres": [
    "Fantasy",
    "Romance",
    "Historical",
    "Fantasy Romance",
    "Historical Romance",
    "Slow Burn",
    "Friends To Lovers"
  ],
  "author": "Auryn Hadley",
  "average_rating": "4.45",
  "url": "https://www.goodreads.com/book/show/26816622-when-we-were-kings"
}