{
  "title": "My Best Friend Is a Secret Agent: How Chip Became C.H.I.P. and Foiled the Freaky Fuzzy Invasion",
  "description": "From school goof to secret agent in just a few easy clicks…*Over 100,000 copies downloaded!* *Finalist in the 2017 Wishing Shelf Book Awards!*“It’s funny. Really, really funny. And not only the writing, the drawings are funny too. The plot is exciting and it is almost impossible to work out what’s going to happen next. The author has an amazing imagination.” Wishing Shelf 5-Star review\"Highly entertaining and extremely imaginative.\" \"The characters... stem from an imagination beyond anything I have seen or read before.\" Readers' Favorite 5-Star review10-year-old Nort McKrakken is a pint-sized computer genius. 14-year-old Chip Munson is his best friend - and loyal guinea pig. When their beloved town of Vortville is attacked by an army of brain-warping Freaky Fuzzy toys, Nort implants Chip with a microchip that instantly turns him into a real live secret agent! Will they be able to save the town... or will the microchip fritz out?!If you like Diary of a Wimpy Kid, Captain Underpants or Zac Power, you'll love My Best Friend Is a Secret Agent! Hilariously illustrated, this middle grade chapter book graphic novel is a comic romp full of action and adventure for any reader - children, tweens, teens... and beyond! This funny spy story is the first in a series, so if you like it, there's more to come!(Don't forget to look for the surprise after Chapter 1!)Read the reviews from real readers!\"I love this book. I was so involved in reading it. Very action packed and involved technology, right up my alley. I highly recommend this book. Thank you to the author, illustrator and editor. 2 thumbs up!\"\"This was an amazing book I love the way you made the story look so movieish anyways I loved it so much I told everyone about it and now there reading it\"\"I think that this is the best book i have ever read in my life and i think this is a great book for kids\"\"Compared to other free books I have read, this book is great. This is a book worth at least 10 bucks. This is one of the funniest books I have read. It is right up there with Diary of a Wimpy Kid and The treehouse series.\"",
  "genres": [
    "Childrens",
    "Fiction",
    "Middle Grade",
    "Amazon"
  ],
  "author": "Richard     Clark",
  "average_rating": "4.18",
  "url": "https://www.goodreads.com/book/show/26819851-my-best-friend-is-a-secret-agent"
}