{
  "title": "An Indonesian Love Story by an American Man",
  "description": "\"This is my love poem to the wonderful, sexy, lovely, amazing, spectacular, shy, wild, passionate, inhibited, deeply contradictory women of Indonesia, and to the wonderful land of Indonesia itself....She was crying.Her emotion was flowing out of her, erupting, gushing, overflowing, spilling out of her uninterrupted. I don’t think she could have stopped crying, talking, or pouring out her emotions even if she wanted.She cried like a child who has just lost her parents. She cried like a young mother who has just lost her child.She did not cry like an old woman who lost her husband. Her loss was not one she expected, and she did not have the comfort of a long life together. Her loss was that of losing a chance at that long life together.She cried like a woman who has just lost the love of her life. I was that to her, and I didn’t deserve it.\"- ExcerptA story of love and romance between Indonesian women and the American man who loves them. An unnamed western man comes to Indonesia looking for easy sex with many beautiful women. Instead he finds himself hopelessly in love, his heart torn between three young women, with him loving each more than the last and unable to choose between Grace- a shy deeply religious girl who never expected what would happen when she met the tall stranger.Honey- the sad single mother with dark secrets in her past who must face her new love and the illness that could kill her.Maria- the passionate sensous sexy woman who must face temptations with her new love. She is determined to remain a virgin in the face of her deep love and attraction for the new man in her life and the strong desire they both feel for each other.For any Indonesian woman who has ever thought about being with a western man.For any western man who has ever thought about being with Asian women.An Indonesian Love Story by an American Man will challenge what you think such a romance would be like, and how your life will be changed by it.Passionate, sensual, naughty, sexy, deeply romantic, heartfelt, poetic, and ultimately sad and tragic, this work will show Indonesians what westerners are like and what we think of your amazing country and its lovely people.None of them were expecting the power of attraction, passion, and a love they couild not control overpowering them. But the time will come when they all must face decisions about what will happen in their future together.",
  "genres": [],
  "author": "An American Man",
  "average_rating": "3.20",
  "url": "https://www.goodreads.com/book/show/11714086-an-indonesian-love-story-by-an-american-man"
}