{
  "title": "Two If By Sea",
  "description": "From the #1 New York Times bestselling author of The Deep End of the Ocean, an epic story of courage and devotion that spans three continents and the entire map of the human heart.Just hours after his wife and her entire family perish in the Christmas Eve tsunami in Brisbane, American expat and former police officer Frank Mercy goes out to join his volunteer rescue unit and pulls a little boy from a submerged car, saving the child’s life with only seconds to spare. In that moment, Frank’s own life is transformed. Not quite knowing why, Frank sidesteps the law, when, instead of turning Ian over to the Red Cross, he takes the boy home to the Midwestern farm where he grew up. Not long into their journey, Frank begins to believe that Ian has an extraordinary, impossible telepathic gift; but his only wish is to protect the deeply frightened child. As Frank struggles to start over, training horses as his father and grandfather did before him, he meets Claudia, a champion equestrian and someone with whom he can share his life—and his fears for Ian. Both of them know that it will be impossible to keep Ian’s gift a secret forever. Already, ominous coincidences have put Frank’s police instincts on high alert, as strangers trespass the quiet life at the family farm. The fight to keep Ian safe from a sinister group who want him back takes readers from the ravaged shores of Brisbane to the middle of America to a quaint English village. Even as Frank and Claudia dare to hope for new love, it becomes clear that they can never let Ian go, no matter what the cost. A suspenseful novel on a grand scale, Two If by Sea is about the best and worst in people, and the possibility of heroism and even magic in ordinary life.",
  "genres": [
    "Fiction",
    "Mystery",
    "Book Club",
    "Adult Fiction",
    "Contemporary",
    "Suspense",
    "Paranormal"
  ],
  "author": "Jacquelyn Mitchard",
  "average_rating": "3.37",
  "url": "https://www.goodreads.com/book/show/26836378-two-if-by-sea"
}