{
  "title": "The Secret of Lost Things",
  "description": "A missing manuscriptA young woman's voyage of discoveryAnd the curious bookshop where it all begins...In this charming novel about the eccentricities and passions of booksellers and collectors, a captivating young Australian woman takes a job at a vast, chaotic emporium of used and rare books in New York City and finds herself caught up in the search for a lost Melville manuscript.Eighteen years old and completely alone, Rosemary arrives in New York from Tasmania with little more than her love of books and an eagerness to explore the city she’s read so much about. She begins her memorable search for independence with appealing enthusiasm, and the moment she steps into the Arcade bookstore, she knows she has found a home. The gruff owner, Mr. Pike, gives her a job sorting through huge piles of books and helping the rest of the staff—a group as odd and idiosyncratic as the characters in a Dickens novel. There’s Pearl, the loving, motherly transsexual who runs the cash register; Oscar, who organizes the nonfiction section and shares his extensive, eclectic knowledge with Rosemary, but furiously rejects her attempts at a more personal relationship; and Arthur Pick, who supervises the art section and demonstrates a particular interest in photography books featuring naked men.The store manager, Walter Geist, is an albino, a lonely figure even within the world of the Arcade. When Walter’s eyesight begins to fail, Rosemary becomes his assistant. And so it is Rosemary who first reads the letter from someone seeking to “place” a lost manuscript by Herman Melville. Mentioned in Melville’s personal correspondence but never published, the work is of inestimable value, and proof of its existence brings the simmering ambitions and rivalries of the Arcade staff to a boiling point.Including actual correspondence by Melville, The Secret of Lost Things is at once a literary adventure that captures the excitement of discovering a long-lost manuscript by a towering American writer and an evocative portrait of life in a surprisingly colorful bookstore.",
  "genres": [
    "Fiction",
    "Books About Books",
    "Mystery",
    "Historical Fiction",
    "Book Club",
    "Contemporary",
    "Literary Fiction"
  ],
  "author": "Sheridan Hay",
  "average_rating": "3.11",
  "url": "https://www.goodreads.com/book/show/268370.The_Secret_of_Lost_Things"
}