{
  "title": "Natural Remedies for HSV ~ How to Put Herpes in Remission",
  "description": "Others may offer you prescriptions and potions to 'cure' your Herpes. They may tell you to eat right and to manage stress, which is great. That's important. They may even offer you some nutritional suggestions or meditations to reduce stress, but they rarely tell you \"Why?\".Furthermore, they don't reveal the mystery behind it all, the real reason for eating right and managing stress. The part you need to know and understand in order to put herpes in remission once and for all. I do.And, once you understand the \"Why?\" you may get angry over having already spent money on information and products that didn't aid the \"Why?\"As you may or may not already know, there are certain foods that can trigger herpes symptoms and there are certain foods that can help to keep herpes in remission. There are also other natural remedies that can help to put herpes in remission, such as supplements, teas, essential oils and salts that can help to put herpes in remission. There are also very specific herbs you can use to help, both, prevent and manage breakouts according to your constitutional temperament.You're about to discover the following The #1 Remedy to Put Herpes in RemissionFood Remedies to Put Herpes in RemissionSupplement Remedies to Put Herpes in RemissionHerbal Remedies to Put Herpes in RemissionTea Remedy Recipes to Put Herpes in RemissionHomeopathic Remedies to Put Herpes in RemissionEssential Oil Remedy Recipes to Put Herpes in RemissionBath Salt Remedy Recipes to Relieve Agonizing Genital Herpes & Shingles Pain & ItchYou will also receive a ton of information about HSV statistics, how herpes is spread, what herpes looks like, viral shedding, the different types of herpes viruses, symptoms (including Pruritus and Herpetic Neuralgia), pregnancy and nursing concerns, complications of herpes, about ICP-47, and what medical doctors are doing to treat Herpes Simplex Virus 1 & 2.STD Testing information, STD Hotlines (American & Canadian) and HSV Dating Sites are included, so you will have everything you need to put herpes in remission, gain control of your life and find love after herpes.There is no cure for herpes, but you can put it in remission. I show you how!",
  "genres": [],
  "author": "Mari J. Dionne",
  "average_rating": "3.00",
  "url": "https://www.goodreads.com/book/show/26837099-natural-remedies-for-hsv-how-to-put-herpes-in-remission"
}