{
  "title": "One Million in the Bank: How to Make $1,000,000 With Your Own Business, Even If You Have No Money Or Experience",
  "description": "Winner of 7 Book AwardsI used to be you. After ten years of honorable service to my country, I went into the private sector and found challenges I'd never encountered before. I had big plans and big ideas, but for seven years I struggled to just survive. I went bankrupt. My wife and son watched our car get repossessed. We were kicked out of a rented house during Christmas--right after my young son had decorated the tree. Finally, I learned the principles described in this book and started a tried and true business. Within three and a half years, I went from negative numbers to having seven figures in my bank account. I want to save you all the headache and heartache I went through, if I can. Or, if you're in the middle of your own troubles, I want to show you how to not only improve your situation but how to literally change your life. I wish I'd known the simple yet profound information I have learned since those hard times and now share in these pages. Through my own experience and after interviewing dozens of other successful entrepreneurs, this is what I've discovered: whoever you are, you already have what it takes to start a million-dollar business. You don't need more education, more money, or more time. Thousands of boring, everyday businesses quietly earn their owners six-figure incomes or more, year after year. You don't need to have or be anything special to be a successful small business owner. In this book, I provide you the simple roadmap you need to start a business that puts $1,000,000 in your personal bank account--regardless of your location, education, race, gender, or age. You'll read stories of everyday people from all backgrounds that I've personally interviewed and vetted, from people with graduate degrees to high school dropouts, and from yard guys to corporate professionals. Really, the only thing they all have in common is that they've put $1,000,000 in the bank (or will shortly). This is not a get-rich-quick book. These everyday businesses take time and effort to build. As you'll see, it takes at least three years, and sometimes as long as a decade. But it's worth it. There are three key ideas to small business success:1. You don't need to come up with anything new--you just need a tried and true business model. 2. You don't need any money--all the money you need is hiding in plain sight. 3. There are millions of dollars' worth of help, advice, and consulting available to you right now--absolutely free. Here's a quick breakdown of the book. Part I is about how to pick a tried and true business model that you know works, and then how to find the help you need to get started. Part II is about money: how to find it, how to spend it, and how to save it. Part III is about the basic sales and marketing skills critical to starting your business. Lastly, Part IV is about the personal skills critical to maintaining your business. You don't have to stop at $1,000,000. You don't have to stop at one business. But this book is where you start.",
  "genres": [
    "Business",
    "Entrepreneurship",
    "Money",
    "Finance",
    "Nonfiction",
    "Personal Finance",
    "Self Help"
  ],
  "author": "Michael L.F. Slavin",
  "average_rating": "3.79",
  "url": "https://www.goodreads.com/book/show/26832680-one-million-in-the-bank"
}