{
  "title": "Devices Brightly Shining",
  "description": "On the first day of Christmas my true love gave to me Dreadful relations, high expectations, And a sudden urge to pull up ropes and flee.  It is the event of the season—on Twelfth Night, the Dunsmuirs have invited the cream of London society to celebrate the marriage of Lady Claire and Andrew Malvern at a reception to which the Prince Consort himself is expected. Captain Ian Hollys brings his fiancée Alice Chalmers to London to attend and to meet his family—people who cannot see past her flight boots to the woman who stands by his side as an equal.  Now adjusting to life as a newlywed, seeing to her business affairs, and preparing the Mopsies to return to school in Munich, Lady Claire is settling into her new life with joy. When two young cousins of Gloria Meriwether-Astor arrive in London, the inhabitants of Carrick House are happy to welcome them. Sydney and Hugh Meriwether-Astor are completing a world tour, and the Dunsmuirs’ ball is just the thing to cap it off in splendid fashion. But Maggie learns that Sydney has his own plans for the family business—and they don’t include cutting off the supply of arms to the Royal Kingdom of Spain and the Californias, as Gloria is determined to do.  It’s time for someone with a spine, an airship of her own, and reasons to put fields of air between herself and decisions about her future to pull up ropes and warn Gloria that betrayal is closer than she thinks …  “It’s another element I love about these books; from Claire to Gloria to Alice to Lizzie and Maggie to Lady Dunsmuir, the women in this series generally like and respect each other. Other women are not required to be lesser—weaker, more cowardly, less intelligent—in order for Claire to be awesome. She is not an exceptional woman, she is an awesome woman among awesome women.” —Fangs for the The latest in urban fantasy from a social justice perspective",
  "genres": [
    "Steampunk",
    "Young Adult",
    "Fantasy",
    "Historical",
    "Fiction",
    "Science Fiction",
    "Adventure"
  ],
  "author": "Shelley Adina",
  "average_rating": "4.07",
  "url": "https://www.goodreads.com/book/show/26832003-devices-brightly-shining"
}