{
  "title": "Accidentally Ever After",
  "description": "Accidentally Ever After by USA Today bestselling author Dakota Cassidy is a fairy tale romp complete with fairy godmothers, an evil queen, woodland creatures, a Jersey salesclerk on a mission to find Shamalot, and of course a handsome hero. This laugh-out-loud addition to the Accidentally Paranormal series will get you in the holiday mood as the girls from OOPS strut their stuff in a land far, far, far away.  Antonia Vitali's on the run and in hiding, working as a salesclerk in a designer outlet mall in Jersey. Toni's life has been on a steady downward decline for three years now, the ghosts of her past always nipping at her heels.  Little does she know, her life's about to change when the OOPS girls whisk in for a day of Christmas shopping and fall through a wormhole in the store's dressing room, taking Toni with them!  Now Toni's got a pair of sparkly purple heels gifted to her by the ​Good Witch of the South—gorgeous heels she can't take off until she returns them to the king​. With​ a trio of reluctant fairy godmothers​ and​ an ogre named Dannan​,​ ​Toni's on a mission to get to the castle to ​receive ​a happily-ever-after she never asked for. Along the way, ​she meets an amazingly handsome, utterly chiseled stable boy named Jon Doe, who offers to help them navigate the Not So Sherwod Forest​​ and get them all to Castle Beckett before Christmas Eve.  But if her happily-ever-after is at the castle, why ​would she rather make time with the stable boy? And why does the evil Queen Angria want Toni’s head on a platter?​ And how in the world has she developed her newfound, peculiar...um...talents?​  Join Toni, Marty, Nina, Wanda and Carl, as they journey along the treacherous road to love and eternal happiness in the magical realm of Shamalot!",
  "genres": [
    "Paranormal",
    "Romance",
    "Fantasy",
    "Paranormal Romance",
    "Magic",
    "Audiobook",
    "Vampires"
  ],
  "author": "Dakota Cassidy",
  "average_rating": "4.07",
  "url": "https://www.goodreads.com/book/show/26841800-accidentally-ever-after"
}