{
  "title": "Love is a Simple Thing The Sound of a Cello Singing",
  "description": "Love Is A Simple Thing, The Sound Of A Cello Singing, explores the authentic lives of the expatriate artists and bohemians of the Lost Generation of Paris exiles in the 1920s Jazz Age. In the early 1920s a young married American couple, Slim and Gene, escape to Paris to fulfill their dreams of a bohemian life of art and liberation. There in the Montparnasse community of expatriate artists and writers Gene believes he can finally write a great novel. Paris is undergoing a great golden age of art and expression, and both of them long to be a part of it. Among the lost generation expatriate artists of Paris they find the bohemian artistic world they have imagined. But it is a world which transforms people. Paris is in a mad fever of inspiration, here life and art are not separated, and what is inside a person will reveal itself. In a lively cafe Slim and Gene together meet the most radiantly expressive woman either of them have ever set eyes upon. She is divinely beautiful and wildly bohemian. Eva von Herzberg belongs here. But encounters with the exotic kill the pleasures of the everyday, and Eva can see things in them they have never dared see in themselves. Eva von Herzberg knows something which no-one else seems to know.. According to author, Lee The book authentically explores the lives of the exiled artists and bohemians of the Lost Generation of Jazz Age Paris in the 1920s. It's a much different view than has ever been seen before, far more frank and realistic. It's a bohemian Paris seen from the perspective of an artist, rather than an academic. This is a Paris populated by revolutionary art, dangerous narcotics and uninhibited artists of genius going mad with obsession and inspiration. It is based on extensive and thorough research. The exiles went to Paris to find freedom, and they knew exactly what to do with it when they found it. Particularly the women exiles, who transformed themselves even more completely than the men, and therefore changed the world. This is a far richer and more authentic portrait of 1920s Paris than has ever been seen before. A Lost Generation Paris brought alive for a reader to experience. Many more reviews of Lee Vidor's books can be seen According to 'If you enjoyed. A Moveable Feast or The Paris Wife, you will certainly also enjoy this book. Although you may be quite shocked to discover the authentic reality of the milieu.' 'The book is full of wild behavior and madness. I've read a great many 1920s Paris memoirs and studies, but none with the people brought alive like this. I believe every single word of it. This is a fresh and authoritative voice on a fascinating subject.' Regarding 20th Century Bohemians and This is the first book of the 20th Century Bohemians and Angels novel cycle to be published. The entire novel cycle explores and dramatizes the developing Modernist Renaissance of the 20th Century. Each novel is an independent story concerning different artists, periods and milieus of the 20th Century. Together the cycle forms a thematically unified portrait of the entire artistic Modernist Renaissance of the 20th Century. The novels of the cycle can be read in any order. See LeeVidor.com or the Amazon Author page. About Lee Vidor; Lee Vidor is a writer and artist. Lee Vidor is the original source of the astonishing Shakespeare-X Message.",
  "genres": [],
  "author": "Lee Vidor",
  "average_rating": "3.50",
  "url": "https://www.goodreads.com/book/show/11715028-love-is-a-simple-thing-the-sound-of-a-cello-singing"
}