{
  "title": "L'impostore",
  "description": "LA CRONISTORIA DEL ROMANZO DI CUI TUTTI PARLANO:3 settembre 2015: “L’impostore” di Javier Cercas, attualmente uno degli scrittori più importanti in lingua spagnola, esce nelle librerie italiane dopo essere stato al vertice delle classifiche spagnole. Il premio Nobel Vargas Llosa è tra i primi a sostenerne l’eccezionalità.Il tema del romanzo è la storia vera di un novantenne di Barcellona, militante antifranchista, che si finge sopravvissuto ai campi di sterminio. La qualità della scrittura e la profondità di analisi sono così potenti che il venerdì di Repubblica gli dedica la copertina, con un’illustrazione di Gipi appositamente disegnata per il libro.Anche Concita De Gregorio lo recensisce su La Repubblica. L’articolo è richiamato dalla prima pagina del quotidiano.Tutti i principali quotidiani, settimanali, blog, testate on line cominciano a parlare del libro.Due intere pagine, a firma di Pier Luigi Battista, vengono dedicate al romanzo su La Lettura, proprio al centro del prestigioso inserto del Corriere della Sera.È la qualità e la varietà delle reazioni che colpisce: il libro scatena riflessioni sulla forma del romanzo, sul rapporto tra Storia e memoria, tra verità e menzogna, sull’ambiguità come categoria letteraria, sulla manipolazione del genocidio, persino sulla politica attuale e passata.Nel frattempo, anche in Francia esce “L’impostore” ed esplode subito il caso editoriale: 2 ristampe in meno di un mese, candidato a due tra i più importanti premi letterari: PRIX MÉDICIS e PRIX FEMINA.In Italia “L’impostore” viene ristampato 2 volte in meno di una settimana...Un affascinante romanzo vero, ma allo stesso tempo una mirabile opera di finzione. La finzione, però, in questo caso non è frutto della fantasia dell’autore, ma è opera dello stesso protagonista, Enric Marco. Chi è Enric Marco? Un novantenne di Barcellona, militante antifranchista, che negli anni Settanta è stato segretario del sindacato anarchico – la CNT – e in seguito ha presieduto l’associazione spagnola dei sopravvissuti ai campi di sterminio nazisti, ricevendo numerosi riconoscimenti per il coraggio dimostrato negli anni e la testimonianza degli orrori del lager. In realtà, è un impostore. Nel 2005 la sua menzogna è stata pubblicamente smascherata. Enric Marco, come ha rivelato uno storico, non è mai stato internato a Flossenbürg. E l’intera sua vita è un racconto intessuto di finzioni, dalla sua partecipazione alla guerra civile alla militanza antifranchista. Dieci anni dopo, la magistrale scrittura di Javier Cercas traduce in un romanzo audace che sfida le convenzioni narrative, l’enigma del personaggio, le sue verità e le sue bugie. In queste pagine intense si dipana un intero secolo di Storia, raccontato con la passione di un sovversivo della letteratura e un’ammirevole onestà dissacratoria.",
  "genres": [
    "Nonfiction",
    "History",
    "Spain",
    "Biography",
    "Spanish Literature",
    "True Crime",
    "World War II"
  ],
  "author": "Javier Cercas",
  "average_rating": "3.63",
  "url": "https://www.goodreads.com/book/show/26842250-l-impostore"
}