{
  "title": "Tanner's Devil",
  "description": "In Detroit, strange things can happen. What does a Duke, a Former Street Doctor & Prostitute and A Pimp with a very big gun have to do with one another in 21st City of Detroit? Find out in Tanner's Devil. Can an urban woman find love in a world not her own? Or give it up and accept her fate with her ex-pimp?Long DescriptionDiscover the alluring world of \"Tanner's Devil,\" a captivating novel filled with suspense, romance, and the powerful pull of desire. Follow the journey of Tanner, a strong-willed ex-prostitute, caught between her past and an uncertain future, creating a web of passion and danger that will leave you breathless.Once trapped in the clutches of the city's seedy underworld, Tanner broke free from her life of degradation, and most importantly, her ex-boyfriend and former pimp, Donatello. However, he remains a constant shadow, seeking not just to lure her back into the illicit trade, but desiring to reclaim his lost love. When a financial crisis threatens Tanner's newfound freedom, she faces a life-altering decision – should she adhere to the path of righteousness or succumb to Donatello's dangerous proposition?Devlin Sanchez, a man of principle and unspoiled innocence at the age of 33, had vowed to save himself for marriage. But when his world shatters, he seeks solace in the most unlikely place, the intriguing and complex Tanner. Their impassioned encounter ignites a flame that leaves Devlin yearning for more. Yet, can he handle the tumultuous world Tanner inhabits, or will he be another casualty of her precarious life?\"Tanner's Devil\" is a seductive tale that intricately weaves suspense and romance, exploring the depths of love, betrayal, and sacrifice. This book delves deep into the complexities of human relationships, creating an addictive narrative that speaks to the heart of suspense-romance enthusiasts.If you crave romance layered with thrilling suspense, characters that will capture your heart, and a story that keeps you guessing, \"Tanner's Devil\" is your next must-read. Embark on this thrilling journey that explores the tantalizing line between love and danger, right and wrong, and the lengths one will go to for love.Experience the heart-racing suspense and the intoxicating romance of \"Tanner's Devil.\" Add this unforgettable tale to your collection today!",
  "genres": [],
  "author": "Sylvia Hubbard",
  "average_rating": "4.36",
  "url": "https://www.goodreads.com/book/show/26844500-tanner-s-devil"
}