{
  "title": "Orphans of the Secret War",
  "description": "American soldiers left after Vietnam, breaking hearts of many Thai women, abandoning mix-breed children to grow up within a culture that wouldn't accept them.The title of the conflict \"The Vietnam War\", doesn't totally encompass the impact it had on the region it consumed--Southeast Asia. In the 1960s and throughout the 70s, the much more powerful North Vietnamese Army took full advantage of Laos' weaker position by fueling the internal conflict within the landlocked country and gaining room for their troops to maneuver within Laos. During this time, and fearing that the communist propaganda would cross its border with Laos and spread unrest within, The Kingdom of Thailand agreed that the US military could use Thai air bases around the country to fight in defense of freedom and democracy. The Americans swarmed into the Thai Kingdom like migrating African bees, ultimately giving Thailand something magical to smile about, at least superficially. The social stratosphere of Thailand quickly adapted like only Thai culture can. Cities were erected around Thai Air Force Bases throughout the nation, solidifying the shaky foundation of shadow businesses that abound in Thailand and generate a large portion of the Thai GDP. One nation’s lust gave rise to the “shadow economy” as it temporarily pacified another nation’s greed. To supply the popular demand, entertainment venues opened and were thronged with lonely Tahaan Falaang , and “bar-girls” willingly came in waves to provide their services. Is it that people who are willing to sell their bodies have no dignity, no limits? Or is it the other way around--that the person willing to buy someone's body--has no dignity, and no limits? Before you come to any conclusions, allow me to tell you a short story… I am a result of the Vietnam War, actually—the \"Secret War\" in Laos--a bastard son of an American soldier stationed in Udon Thani during the decades-long Indochina conflict. When American soldiers moved into Udon Air Force Base, the promise of great opportunities and riches excited many impoverished villagers around the rural Isaan farmlands; long overlooked by the Thai government. My mother, a young woman at the time, embraced this chance to make money, and even dreamed of being married off to a rich Tahaan Falaang who would take her away from the misery of subsistence living—a poor rural Isaan woman’s fantasy that evaporated the moment the Americans packed up and went home. Many of the women pursuing a dream became pregnant. Out of guilt, some would abort, knowing that bearing a mixed-breed child would only bring disgrace and shame to her family. Yet, many children were given the chance of life, only to find their culture was not ready to accept them for who they were—children of God. In fact, a Thai term had to be invented just to describe such children—“loog-kruenk” or “half-breed”. Something like \"half-blood\" or “half-ghost-half-human”. Upon returning home, pregnant and abandoned, my mother hid her secret as long as she could, only to have it revealed through the noticeably different looking son born to her. He would never be confused with a typical Isaan farmer. Undereducated Isaan villagers did everything possible to lift my mother onto the stage of disgrace. With mounting pressure to survive in these rural lands, my mother did what many women in the same situation did—dropped me off at an orphanage where I witnessed the darker side of “Thai-ness”—and where I quickly learned how to conform to the system. It was a journey that shredded my spirit and buried me deep in despair. I had no choice but to reach out into the unknown, begging a comet to save me and praying to any invisible powers willing to listen to an orphan’s plea. Fate took me there. But a miracle brought me out…",
  "genres": [
    "Asia"
  ],
  "author": "Bruce King Anderson",
  "average_rating": "3.83",
  "url": "https://www.goodreads.com/book/show/26842999-orphans-of-the-secret-war"
}