{
  "title": "Saving Ren",
  "description": "Three men brought together by circumstance who found something none of them knew they needed...Ren Barretti has finally come home after a year of being held captive by the terrorists who slaughtered his entire Special Forces team. But he can't escape the nightmares that torment him or the guilt that he was the only one to walk away. The life his older brothers have brought him home to doesn't exist for him anymore and to keep them and their loved ones safe from the rage and pain that consume him, Ren needs to disappear.Police Detective Declan Hale has felt an undeniable pull towards the very straight Ren Barretti since the day Ren's brother married Declan's younger sister almost a dozen years earlier. But even though the Ren who has come home isn't the one who left, all of Declan's feelings come rushing back to the surface and he steps in to help the only man he's ever truly wanted. And even though there's no future for them, keeping Ren safe is all that matters and Declan will risk anything to make that happen.Tough as nails former soldier and mercenary Jagger Varos has returned to Seattle after years of running from his past and he's hoping that joining Barretti Security Group will help him finally call the city he left behind home. But within weeks, his new beginning is tested after multiple run-ins with the gruff, infuriating Detective Hale. When he inadvertently discovers that Declan is hiding Ren from the very brothers offering Jagger a new start, Jagger finds himself torn between his newfound loyalty to Vin and Dom Barretti and the need to protect the young man he himself helped rescue from his captors.For Declan and Jagger, it's hate at first sight but they soon realize that they will need each other if they have any hope of saving Ren from himself. And neither of them expects their mutual distrust in one another to grow into something else entirely or that Ren himself will find in both of them what he needs to rebuild his life and come to terms with who he really is.Can the fierce attraction between three men become something more or will the demands of the real world tear them apart?Note: This book contains explicit M/M/M content and is intended for mature audiencesAlthough this book is part of a series, it can be read as a stand-alone. No cliffhangers.Barretti Security SeriesBook 1 - Loving Vin (M/F)Book 2 - Redeeming Rafe (M/M)Book 3 - Saving Ren (M/M/M)The Barretti Security Series is a spin-off of The Escort Series and some of the characters from that series appear in this one so if you want to read the books in order, start with this series:The Escort SeriesBook 1 - Gabriel's Rule (M/F) Gabe & RileyBook 2 - Shane's Fall (M/F) Shane & SavannahBook 3 - Logan's Need (M/M) Logan & Dom",
  "genres": [
    "M M Romance",
    "Romance",
    "M M M",
    "Menage",
    "Contemporary",
    "Military Fiction",
    "Abuse"
  ],
  "author": "Sloane Kennedy",
  "average_rating": "4.28",
  "url": "https://www.goodreads.com/book/show/26846304-saving-ren"
}