{
  "title": "Mark Twain’s Memoranda: from The Galaxy",
  "description": "This collection of short stories was originally published in 1871 in England without Mr. Twain's authority. It began a copyright war that carried on for years. This collection contains 67 sketches taken directly from THE GALAXY magazine. Mark Twain was an editor for THE GALAXY from 1870 to 1871. This edition is not a scan or photocopy. It has been painstakingly transcribed and edited to resemble the original publication in a digital format. Many of the sketches in the original book (and magazine) were not titled, but later received titles from Mr. Twain. They are indicated in the list below as \"Untitled\" but the later titles used are in brackets. The following sketches are contained in this publication: Introductory The Facts in the Case of the Great Beef Contract About Smells Disgraceful Prosecution of a Boy The Story of the Good Little Boy Who Did Not Prosper Untitled [Coal Mine] Untitled [The Sunday School] Untitled [Poor Human Nature] A Couple of Sad Experiences The Judge’s “Spirited Woman” “Hogwash” Post Mortem Poetry Wit-Inspirations of the “Two-Year-Olds” Untitled [Lady Franklin] How I Edited an Agricultural Paper The “Tournament” in A.D. 1870 Untitled [A Curious Incident] Enigma Untitled [Higgins] An Unburlesquable Thing The Late Benjamin Franklin The Editorial Office Bore A Daring Attempt at a Solution of it To Correspondents A Memory Political Economy John Chinaman in New York The Noble Red Man A Royal Compliment The Approaching Epidemic Favors from Correspondents The Reception at the President’s Goldsmith’s Friend Abroad Again Curious Relic for Sale Science vs. Luck Untitled [Dan Murphy] Favors from Correspondents [How High is This for High?] [Johnny Greer] Mark Twain’s Map of Paris Riley—Newspaper Correspondent Goldsmith’s Friend Abroad Again A Reminiscence of the Black Settlements A General Reply Favors from Correspondents An Entertaining Article “History Repeats Itself” Dogberry in Washington My Watch—An Instructive Little Tale Favors from Correspondents The Coming Man A Book Review The Tone-Imparting Committee The Danger of Lying in Bed One of Mankind’s Bores A Falsehood The Indignity Put Upon the Remains of George Holland by the Rev. Mr. Sabine The Portrait The Facts in the Case of George Fisher, Deceased Untitled [Forty-Niner] \"Doggerel\" Goldsmith’s Friend Abroad Again Mean People A Sad, Sad Business Concerning a Rumor Answer to an Inquiry from the Coming Man Running For Governor The “Present” Nuisance",
  "genres": [
    "Fiction"
  ],
  "author": "Mark Twain",
  "average_rating": "2.25",
  "url": "https://www.goodreads.com/book/show/26841928-mark-twain-s-memoranda"
}