{
  "title": "Dragon Keeper",
  "description": "Enter the spellbinding world of dragons... and those who tend themOne of the most gifted fantasy authors writing today, New York Times bestselling author Robin Hobb has dazzled readers with brilliantly imaginative, emotionally resonant, and compulsively readable tales set in far-flung realms not unlike our own. In this enthralling new novel, she returns to the territory of her beloved Liveship Traders and Tawny Man trilogies with a story of dragons and humans, return and rebirth, and the search for meaning, belonging, and home.For years, the Trader cities valiantly battled their enemies, the Chalcedeans. But they could not have staved off invasion without the powerful dragon Tintaglia. In return, the Traders promised to help her serpents migrate up the Rain Wild River after a long exile at sea--to find a safe haven and, Tintaglia hopes, to restore her species. But too much time has passed, and the newly hatched dragons are damaged and weak, and many die. The few who survive cannot use their wings; earthbound, they are powerless to hunt and vulnerable to human predators willing to kill them for the fabled healing powers of dragon flesh.But Tintaglia has vanished and the Traders are weary of the labor and expense of tending useless dragons. The Trader leadership fears that if it stops providing for the young dragons, the hungry and neglected creatures will rampage--or die along the river's acidic muddy banks. To avert catastrophe, the dragons decree a move even farther up the treacherous river to Kelsingra, their ancient, mythical homeland whose mysterious location is locked deep within the dragons' uncertain ancestral memories.To ensure their safe passage, the Traders recruit a disparate group of young people to care for the damaged creatures and escort them to their new home. Among them is Thymara, an unschooled forest girl of sixteen, and Alise, a wealthy Trader's wife trapped in a loveless marriage, who attaches herself to the expedition as a dragon expert. The two women share a deep kinship with the Thymara can instinctively communicate with them, and Alise, captivated by their beauty and majesty, has devoted her life to studying them.Embarking on an arduous journey that holds no promise of return, the band of humans and dragons must make their way along the toxic and inhospitable Rain Wild River--an extraordinary odyssey that will teach them lessons about themselves and one another, as they experience hardships, betrayals, and joys beyond their wildest dreams.",
  "genres": [
    "Fantasy",
    "Dragons",
    "Fiction",
    "High Fantasy",
    "Epic Fantasy",
    "Audiobook",
    "Adventure"
  ],
  "author": "Robin Hobb",
  "average_rating": "3.96",
  "url": "https://www.goodreads.com/book/show/26841427-dragon-keeper"
}