{
  "title": "Forget Me Not",
  "description": "10 artists auditioning for a shot at working with the Reed Brothers 10 skins, each with a story to tell10 perfect tattoos so they'll never forgetA little bit of healingA whole lot of heartAn anthology of ten short stories by ten different authors who are donating 100% of the proceeds to benefit Alzheimer's and brain health. Join Tammy Falkner, Jane Charles, Ava Stone, Marquita Valentine, Lexi Eddings, Lj Charles, Andris Bear, Jerrica Knight-Catania, Caren Crane and Diane Franks to help combat this terrible disease.Tammy Always, April- You probably love to hate her. She's the woman who broke Matt's heart and inspired that awesome letter in MMM. But whatever happened to her? Find out about the crazy dream that made her ditch her unfaithful husband in Scotland, and let's give her some closure, shall we? (Matt has a pretty big cameo in this one!)Andris Inked - The only thing officer Brent Copeland wants when he enters Reeds’ is some fresh ink to honor his fallen partner. But when he comes face to face with Honor Sloan, a hellcat he arrested six months ago, he must confront the mistakes of his past if he is to have any chance at a future.Jane Rattled - She enters the tattoo shop with an envelope full of memories and a heart filled with longing. What she leaves with is more than she dreamed of, and it just might be the first step to healing the wounds of the past.LJ Burned - Fred’s agony over past mistakes is so overwhelming he craves a reminder of them—one that will be burned into his flesh forever. Little does he know the past is about to explode into present-day reality.Ava Hold Me Tight - Film student Seth Elliott can hardly believe his luck when Molly Wolfe, a pretty face from his past, stumbles into the Reeds' looking for a tattoo to remember her brother. Finding her after so many years is even better than any of the classic movies he loves so much.Lexi Eddings - Coldwater Blues - Michael Evans is the poster boy for trouble on two legs. After losing the one person who ever believed he'd amount to anything, he hitches his way across country to the Big Apple, convinced he can outrun the mistakes that forced him to leave his hometown. But as his dear Gran always said, \"Wherever you go, Mike, there you are...\"Jerrica Knight The Knot - Ethan Masters never imagined he'd go for a girl with a tattoo, but when he learns the story behind Madison Kennedy's mysterious design, all he wants to do is take care of her. But Madison is still struggling with great loss in her life, and is terrified of getting close to anyone ever again, especially someone as perfect as Ethan Masters.Marquita Skin Deep - After one reckless night ends in tragedy, Scottish rugby player Maddox Stuart turned his back on his former life, leaving everything behind, but when the girl he left behind ends up as his client in the Reed Brother's shop, Maddox is forced to face his demons.Caren Lakewood Confidential - Tondra is struggling for attention on the New York art scene when a chance to ink notorious hip-hop legend Lakewood lands in her desperate hands. The reclusive rapper shares a part of his history he's never told anyone, forcing Tondra to choose between ensuring her own success and safeguarding Lakewood's secrets.Diane The Test of Time - He's not the man he used to be. She's desperate to find a way to bring him back to her. She needs a tattoo to help her remember. She needs a tattoo so he won't forget.",
  "genres": [],
  "author": "Tammy Falkner",
  "average_rating": "4.25",
  "url": "https://www.goodreads.com/book/show/26852334-forget-me-not"
}