{
  "title": "Fossil",
  "description": "Humans may not be the only ones living in the Tau Ceti system and there's a chance we might not even be the top of the food chain anymore. A land survey being conducted at a glacial lakebed brings Thatcher, Henley, and Rigel face-to-face with evidence of a frightening humanoid alien life form. And even though that evidence is in the form of fossilized bones and likely a million years old, it may suggest that this life form could still exist on their world. After all, none of our old robotic landers or unmanned probes were programmed to search for life where these particular creatures might currently be thriving. When discussion begins regarding further research however, one of the colonists begins to worry. It seems that he already knows something about this alien civilization and he had been keeping that knowledge to himself. Now it's time for him to speak up. Colonization Saga: Kepler Moon Alpha (Book 1) Black Hole (Book 2) The Gateway (Book 3) Valhalla (Book 4) Fossil (Book 5) Warrior of the Myst (Book 6)Warrior of the Myst II (Book 7)Brought to you by the author of the international bestselling novel “The Mystic Saga”. Scott McElhaney brought the concept of serial novels back to science fiction after the idea lie dormant for many decades. Why spend $9.99 on a novel only to discover after the first eighty pages that you really don’t like it? The 99-cent serial novel gives you a full 80-100 page story that in itself can stand alone. If you like it, you’ll find another 99-cent continuation within the next month. If you didn’t like it, you only wasted 99 cents. If you stick with the whole story, you won’t have spent more than $5.00 and hopefully you enjoyed it even more than those ten-dollar novels. The Mystic Saga started out as a serial novel and now you can buy the whole 550-page omnibus for $2.99. That’s the way we roll around here.",
  "genres": [],
  "author": "Scott McElhaney",
  "average_rating": "4.39",
  "url": "https://www.goodreads.com/book/show/26852616-fossil"
}