{
  "title": "Preyfinders",
  "description": "Aliens have found Earth and their intentions are completely dishonourable and utterly filthy.They want their females on their knees, on their backs, or with their legs spread, and those they select will soon be climaxing helplessly on command.A Preyfinder’s task is to find female prey for the warrior males who have earned a new pet, but when it comes to our planet and our women nothing quite goes as planned.There is no shame in being a pet. Well… none for the males. Brittany, Willow, and Talia don’t know what is coming for them, how little choice they will have, or how irresistible will be their needs. As the nanochem matures in their blood, arousal is guaranteed, as are screaming orgasms and a willingness to do whatever their masters require of them. What neither master nor pet knew was how the bondmating of alien to human would unleash unique powers within each female.Both male and female find themselves irrevocably bound together, and these alien warriors and the women who grow to love them may be the only ones who can stop the evil that has been buried beneath our dirt for centuries, waiting to arise.\"...badass alien warriors and unique humans who become stronger when together\" \"This is the first book in a long time that I've stayed up half the night to read in one sitting.\"\"... absolutely LOVED the conclusion to the Preyfinders series!!This entire series was well written - the characters were developed and like-able. The aliens were HAWT, the humans were sweet, and the sex was sizzling!\"ALL THREE BOOKS IN THE SERIES IN ONE BOXSET.160,000 words from NY Times and USA Today bestselling author Cari Silverwood. Featuring 3 books - Precious Sacrifice, Intimidator, and Defiler. Sometimes love needs hunting down.There is a spin-off, standalone novel called Cyberella.",
  "genres": [
    "Science Fiction Romance",
    "BDSM",
    "Science Fiction",
    "Erotica",
    "Paranormal",
    "Aliens"
  ],
  "author": "Cari Silverwood",
  "average_rating": "3.98",
  "url": "https://www.goodreads.com/book/show/26851945-preyfinders"
}