{
  "title": "Muse: A dark romance",
  "description": "One disowned heir to a chocolate empire.One recent library science grad.A roommate who can best be described as sex on a stick.A job that entails researching Regency era brothels and, um, “acting.”What could possibly go wrong?(Damn near everything.)My name is Sim. This book is about Alaric White—my best friend, college roommate, partner in literary crime. Alaric writes kissing books. And by “kissing,” I mean … well, you know what I mean.He writes each book with a muse. (If the IRS asks, tell them she’s a “research assistant.”) Yeah, I’ve told him this reflects a certain lack of imagination on his part. But I help out with his books so far be it from me to complain too much.Usually it doesn’t take him long to find a “research assistant” for a new book. Women send him their “resumes.” Call. Email. Turn up at every stop on his book tours. (I know, it’s a rough life but someone has to live it.)But his current work-in-progress? Well, it’s different. So he needs a different muse. Someone innocent and untouched … but also brave enough to embark on a journey into her deepest, darkest desires.After a year, he’s still searching. His agent is getting antsy. (Okay, she’s on the verge of full-blown panic that he won’t finish the book on time.)Then he sees her, looking like an angel just arisen from a leisurely afternoon of amour. (His exact words.) She’s sitting in a suburban coffee shop … and being threatened by a goon with a pistol in his waistband.(Dear reader, he rescues her.)Then a plot twist no one saw coming.He knows he should let her go. But he’s a selfish bastard. (I am too, but that’s a different story.) He just needs to keep her long enough to finish the book …Muse is a melt-your-clothes-off scorching hot standalone billionaire (well, Alaric's not technically a billionaire but he acts like one half the time) boss romance with a sweet happy ever after. (If I might say so myself.) Find out why readers are saying, “Holy hotness!” … “the sexiest thing I have ever read” … “5 stars are not enough!” (Well, I’m one of the reasons why they say that.) Of course, everyone wants my story now, too. We’ll see. My story makes Alaric’s look like a damn fairy tale. A twisted sort of fairy tale, but … well, just read it. (Trust me, it’s worth it.)",
  "genres": [
    "Romance",
    "Contemporary",
    "Fiction",
    "New Adult",
    "Contemporary Romance",
    "Erotica",
    "Chick Lit"
  ],
  "author": "Julia Gabriel",
  "average_rating": "3.94",
  "url": "https://www.goodreads.com/book/show/26858841-muse"
}