{
  "title": "A Chance to Live",
  "description": "A Chance to Live Book Description: Eleonora is from a prosperous Jewish family in St Petersburg, but they are reduced from riches to rags by the Russian Revolution of 1917. Luckily she meets an aspiring musician, marries him and is blessed with a son, Felix. She would do anything for her son and when he begins an illegal gay relationship with his soul mate, Eugeny, she is determined to protect them. The ‘family’ facade she so carefully creates keeps them safe and allows the ‘boys’ to develop their musical careers, but they are eventually pushed to extremes when a stalker threatens their cover. Eleonora would die for her son but how far would she go to conceal his forbidden passion? The body of a beautiful young woman is discovered by the pier in Sochi – a Black Sea resort in the south of Russia. Can this be the missing daughter of a senior Moscow Communist Party official? Vadim Vasin, a young lieutenant from the Moscow Criminal Investigation Department, is sent to Sochi to investigate and he encounters Felix and Eugeny, but they don’t seem connected with his investigation. Thirty years later Vadim Vasin, now a major, investigates the suspicious death of his own beloved grandmother, which again brings him into contact with the two men. Can the famous conductor Felix Kaplan or his son-in-law, charismatic musician Eugeny Krassilnikov, have anything to do with these crimes? Vadim vows to solve this mystery. This is a fully developed novel that comprises a psychological thriller integrated within a family drama/saga, a multifaceted story combining mystery, murder, suspense, crime, and romance. Set in oppressive 20th century Russia, it tells of a mother’s fearless devotion, amazing family loyalty, and the courage to be different, but also how fear can drive people to extremes. Just how far will they go to keep their secret?Author’s NoteThis story takes the reader into a bizarre society in which most people are anxious to ‘toe the line’ in order to avoid persecution. Such is the shocking reality for the majority of people living in the Soviet Union – so aptly labelled ‘The Evil Empire’ by President Reagan. Nevertheless some of the so-called intelligentsia, like the artistic family featured in my story, manage to carve themselves a comfortable niche. Just as long as they keep a low profile and avoid official attention, they can live a privileged and unconventional life. But it would be a disaster to be involved in a scandal, which could result in ruthless persecution by the authorities. Being gay is illegal in 20th century Russia, and prison a fate worse than death, so imagine how desperate they would be. To understand the main characters we need to appreciate their family backgrounds, so that is how the book begins.",
  "genres": [],
  "author": "Marina English",
  "average_rating": "4.19",
  "url": "https://www.goodreads.com/book/show/26860075-a-chance-to-live"
}