{
  "title": "No Parachutes To Carry Me Home",
  "description": "Maisha Z. Johnson’s elegant meditation on human difference, No Parachutes to Carry Me Home, opens with an epigraph from June Jordan’s On the Black Family —we came and we come in a glory of darknessaround the true reasons for sharingour dark and our beautifulnameAs though in direct response to this testament, readers are introduced to the compassionate speaker of the opening poem Sacrifices who will guide us through the book and the life of its protagonist. This neighbor– the book’s witness– describes the unsmiling stone face of an angel on her stoop and the anonymous sacrifices that are lit and left at the angel’s feet. She concludes:i like to imagine these sacrificesas somebody’s secret – someonewho spends his evenings making promisesto his family. nights, asking my angel for the same.The narrator of No Parachutes is not a shadow spying from behind the curtains, but a woman who goes forth each day to imagine the suffering of others not so different from her own.We partake in one initiation after another, as she moves from the loss of a young girl’s magic marble to her first sexual experience with another woman. Throughout there is a dialogical tension between external and internal reality which the speaker must true the way one true’s the bubble in a level or the sharpness of a blade.i knew the answerto the true or false question,and i knew my answer-the two were not the same.From mr. lowell’s religion class, st. mary’s high schoolAnd she knows that her answers are not without consequence:god sat at the edgeof my desk, her gray dreadlocksdipped in ink black as my pupilsThere is a humorous counterpoint, a leitmotif that runs through the book, surely the voice of the superego reminding the narrator how she might be perceived by others. These poems are all titled the people say and the people say things like black girls don’t do yoga. The people say black girls don’t kiss dogs. Black girls don’t have eating disorders.And yet we know, like the speaker in the poet’s chosen epigraph by Gwendolyn Brooks from a song in the front yard, Maisha Z. Johnson will not be shaped by what the people say, nor will she be detoured by her own mistakes. She will move from the front yard, from the boredom of the beautiful, to the untended out back.I’ve stayed in the front yard all my life.I want a peek at the backWhere it’s rough and untended and hungry weed grows.A girl gets sick of a rose.Gwendolyn Brooks, a song in the front yardShe will explore her parental homeland with nostalgia and curiosity.i wish this map would showwhere the queer girls go. in placesof pretending those girls don’t exist,they hold each othersomewhere, perhaps in plain sight.A reader cannot help but love the narrator of this first powerful collection of poems as she enters one life, then another, from Trinidad to Oakland, and approaches each with her great gifts of simple clarity , lyric beauty and humility–me, carrying only my gentle breath beneathloose jeans and a baggy black sweatshirt.Sandra Alcosser, poet, A Fish to Feed All Hunger and Except by Nature",
  "genres": [],
  "author": "Maisha Z. Johnson",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/26867257-no-parachutes-to-carry-me-home"
}