{
  "title": "Introvert/Extrovert",
  "description": "T.S. Eliot, Dylan Thomas and Walt Whitman: these are some of the planets \"Introvert // Extrovert\" forced me to think of. Yes, the voice in \"Introvert // Extrovert\" is large and complicated. It is generous and compelling. It is filled with contradictions, planets and LOVE. It is filled also with strange darknesses, but these, shrewdly and honestly, are displayed most nakedly in dreams only. I bring up T.S. Eliot because the voice here forces me to.Forces me to because of the sexual agony. Forces me to because of the way Social Media, through the sad and brilliant brain, is measured out in dull lightning bolts like and a la coffee spoons. T.S. Eliot because of the grime, the parking lots, pizza, death by drowning, and other fast-food rubble. T.S. Eliot because of the way the universe gets crumpled down into a ball. And, of course, in T.S. Eliot I am bringing up (am forced to bring up) all Art dating back to and including the strange animals ritualized on ancient cave walls. I bring up Dylan Thomas because Russell forces me to. Forces me to because of the way he moves in and out of the universe. Dies away, humanly and insignificantly, underneath it.But, more potently, draws the universe (the planets, the stars, and the darknesses) into himself. I bring up Whitman because Russell forces me to. Forces me through sheer joy and insistence. Forces me through scale and cosmic rocking. Whitman, of course, will not let you go. And Whitman of course, for all his human indecencies is grounded in LOVE. I am forced to bring up Whitman because Whitman is also the great poet-masturbation-God. You might object to my invoking three male poets here and ask \"What does this say about the work of Russell Jaffe??\" And here I'll just quote Russell Jaffe:I like can't even deal w the patriarchy right nowI don't know why Russell Jaffe hasn't blown up yet. It seems inevitable.-RAUAN KLASSNIK",
  "genres": [],
  "author": "Russell Jaffe",
  "average_rating": "4.83",
  "url": "https://www.goodreads.com/book/show/26867453-introvert-extrovert"
}