{
  "title": "Smudging for Beginners: Secrets from a Professional",
  "description": "So, are you interested in cleansing your space and raising your vibration? Or are you looking to rid your location of that crummy energy tied to your ex-partner who you can't get out of your head? Either way, this book can assist as LeeZa Donatella helps readers understand the basics as well as tricks of the trade when it comes to smudging their space, person or objects in her book, Smudging for Beginners. \"I'm a spiritualist who works with energy. After receiving thousands of emails after an article I shared about this ancient form of cleansing and clearing, my publishers asked if I would write a smudging book. So I created a detailed yet easy to follow and informative guide for people who want to understand the correct way to smudge. I also share a few of my experiences dealing with what some term \"paranormal\" or energetic activity. You may just find yourself laughing out loud as you gain valuable insight into energy, vibrational frequency and the art of smudging. Blessings... LeeZa Donatella\"With the shift in the vibrational frequency of the energies coming in since 12/21/12, people are experiencing more than ever before. Unfamiliarity with this energy can be confusing and cleansing one's person and space is always a good start. Every culture and religion uses cleansing techniques to raise the vibration and energy of a location or person. Smudging has become a household term with trendy supermarkets now selling smudge sticks, it's time to share the information and practices I've used for decades. This companion book has everything you'll need to know to perform full blessing and clearing ceremonies including: Steps for Smudging Home, Persons & Objects| Anointing| House Preparation| Smudging Prayers & Blessings| Materials Used and their Spiritual Significance| Person Preparation: Grounding & Balancing| What to Do if You Encounter a Spirit| Best Days to Smudge| Releasing Trapped Negativity and more.",
  "genres": [
    "Spirituality",
    "Nonfiction"
  ],
  "author": "Leeza Donatella",
  "average_rating": "4.36",
  "url": "https://www.goodreads.com/book/show/26861214-smudging-for-beginners"
}