{
  "title": "The Patrick Melrose Novels",
  "description": "NATIONAL BESTSELLERAn Atlantic Magazine Best Book of the YearA Publishers Weekly Best Book of the YearFor more than twenty years, acclaimed author Edward St. Aubyn has chronicled the life of Patrick Melrose, painting an extraordinary portrait of the beleaguered and self-loathing world of privilege. This single volume collects the first four novels—Never Mind, Bad News, Some Hope, and Mother’s Milk, a Man Booker finalist—to coincide with the publication of At Last, the final installment of this unique novel cycle.By turns harrowing and hilarious, these beautifully written novels dissect the English upper class as we follow Patrick Melrose’s story from child abuse to heroin addiction and recovery. Never Mind, the first novel, unfolds over a day and an evening at the family’s chateaux in the south of France, where the sadistic and terrifying figure of David Melrose dominates the lives of his five-year-old son, Patrick, and his rich and unhappy American mother, Eleanor. From abuse to addiction, the second novel, Bad News opens as the twenty-two-year-old Patrick sets off to collect his father’s ashes from New York, where he will spend a drug-crazed twenty-four hours. And back in England, the third novel, Some Hope, offers a sober and clean Patrick the possibility of recovery. The fourth novel, the Booker-shortlisted Mother’s Milk, returns to the family chateau, where Patrick, now married and a father himself, struggles with child rearing, adultery, his mother’s desire for assisted suicide, and the loss of the family home to a New Age foundation.Edward St. Aubyn offers a window into a world of utter decadence, amorality, greed, snobbery, and cruelty—welcome to the declining British aristocracy.",
  "genres": [
    "Fiction",
    "Contemporary",
    "Novels",
    "Literary Fiction",
    "Literature",
    "British Literature",
    "21st Century"
  ],
  "author": "Edward St. Aubyn",
  "average_rating": "4.06",
  "url": "https://www.goodreads.com/book/show/11717571-the-patrick-melrose-novels"
}