{
  "title": "Married For Jeremy",
  "description": "James Walker is a self-sufficient bachelor who spends his days working at an outfitting store, evenings at his grandmother’s side in the nursing home where she lives, and nights in a rustic, waterfront cabin. His volunteer firefighting career fills up his spare time. When Ellen moves to town to work at the nursing home, James finds himself interested in pursuing a relationship for the first time in forever. When things get too steamy, too quickly and Ellen ends up pregnant and furious. James suggests a marriage of convenience to preserve their reputations and offer the child the best possible home.As two near strangers, they find their differences hard to bear, especially after Ellen embraces a faith James doesn’t believe in anymore.EXCERPTThe sterile smell of the nursing home met him as he pushed through the front door and headed to his grandmother’s room. “Hey Grandma.”“Hi James.” His grandmother, Anna, was already in bed, but happy to see him as usual. “How was your day?”James dropped into the chair beside her bed and stretched his feet out. “I’m tired.”“I heard on the news that someone hit a moose again.”“Yeah, I wish it would stop making the news,” James said with an unintended edge in his voice.“It’s been quiet around here lately, the reporters are just doing their job.” As usual, his grandmother always saw the potential good in a situation.“I know, but it interferes with mine. How was your day?”“My hip’s been bothering me, so I spent most of the day in here reading.”“What were you reading?” James asked, really only half interested.Anna gave him a funny look. “Well, I read my Bible mostly.”“That’s good, I guess.”“You might find it’s not as bad as you think.”“Grandma, it’s hard enough to read the reservation book, much less something written thousands of years ago.”“I’m still praying that someday you won’t feel that way.”“I know, but don’t count on it.”His grandmother dropped the subject as he knew she would if he just shrugged it off and they had a pleasant conversation for the next few minutes. Then James excused himself, knowing that she was tired. It was hard for him to understand how she kept such a positive outlook on life, when her mobility was as limited as it was. Occasionally she still used her walker, but for the most part, the pain kept her confined to bed, or her wheelchair. She claimed it was faith that kept her strong.He left the room and strode down the hall, too tired himself to pay attention to where he was going.“Hey! Watch it!”He crashed into a skinny brunette carrying a stack of sheets. The bedding went flying and he found himself standing face to face with a furious, brown-eyed PSW that he’d never seen before.“Uh, sorry. I wasn’t watching where I was going.”“No kidding,” she snapped.He grabbed her arms. “Are you okay? I didn’t hurt you did I?”“No, but you’re hurting me now.” She scrambled free of his too harsh grasp and knelt to pick up the dropped bedding.James dropped to his own knees.“You don’t have to help. You’ve caused enough trouble for one night.”“You’re not the friendly type are you?” James scooped up the last sheet and stood up. The girl stood staring at him.“Not to jerks that trip me.”“Well excuse me.” He shoved the bundle into her arms. “Good night.” He spun around and headed out of the building.Angry, Ellen stared after him. His black windbreaker had big red letters on the back, reading ‘Darcy-Creek Fire Rescue’. While he’d been almost strikingly handsome, he certainly wasn’t the gentlemanly fireman type she’d envisioned. He was strong though, she couldn’t help but notice that.“He’s hot stuff huh?” Ellen looked up at Katie, one of her co-workers.“What do you know about him?” Ellen asked, wanting to avoid having to give her own opinion.“Anna’s grandson James. Story is, he had a tough childhood and is avoiding the past. We all think he’s just yummy.”",
  "genres": [],
  "author": "Katy Andrews",
  "average_rating": "3.00",
  "url": "https://www.goodreads.com/book/show/26878252-married-for-jeremy"
}