{
  "title": "Exhale and Reboot",
  "description": "First day on Campus Candice meets up with her cousin, Lisa Tyler whose visit six months prior was what gave her the push she needed to reboot her life. Lisa introduces her to a gang of eight students who hang together and make up an odd, but tight-knit clique. She also runs into Simon Bennett, a handsome professor, notorious as the Bluebeard of Homewood Campus. He is carrying on an investigation into the disappearance of a young medical student who vanished one cold February evening while running off to the lab in his shirt sleeves. The student in question happens to be his sister’s fiancé, so Simon will not rest until he finds out what happened to Jeremy.When one of the members of the ominous bunch of eight proposes she try a little experiment on Professor Bennett, since he has asked her out, Candice refuses. She finds them immature and so not the reason why she came to Johns Hopkins. She turns down their little game Yes sir, no sir, even when they promise they could rake in a pool of thousands of dollars on the outcome. This is when she finds herself on Simon’s side of the debate while she slowly becomes entangled in his own game of seek-and-find.Candice gets caught up in Simon’s research of the case even police could not resolve. Authorities have too many suspects and as they have no body, no weapon, and Jeremy never turns up, they relay the file to Missing Persons. Candice soon realizes Simon Bennett is more tenacious than any deep and dark mystery, and that he will stop at nothing to get to the truth. The charismatic man has her mesmerized, and as Candice fears losing her heart to another dead possibility, she wonders if his quest might put her life in danger. Even more troubling, Candice doubts her hungry heart can survive another letdown. As she begins to do some poking of her own, she stirs the guilty party in motion and unwittingly sets the stage for murder…",
  "genres": [],
  "author": "Joss Landry",
  "average_rating": "4.70",
  "url": "https://www.goodreads.com/book/show/26874162-exhale-and-reboot"
}