{
  "title": "Hawk's Property",
  "description": "From the first time Hawk saw her, he knew he wanted to do dirty things to her in his bed.Hawk, the muscled, tatted, badass Vice President of the Insurgents Motorcycle Club, sees women as bed warmers, nothing more. He never stays with the same woman, and although there are plenty of women who want to be his old lady, he wants none of that. He doesn't date.He doesn't let chicks ride on the back of his bike.He doesn't fall in love.And that suits him just fine until he meets her whose eyes light a fire in him. Problem is she's not so easy to get into his bed. Hawk wants her. And when Hawk wants something he takes it. Cara Minelli doesn't want to go to the biker bar, but her friend talks her into it. Swearing off men since she caught her fiancé cheating on her right before her wedding, she has buried herself in her career not wanting a man in her life. Until she sees him. He is sexy, rough, crude, and oh so very wrong for her. So why can't she stop thinking of all the nasty things he'll do to her if she relents and lets him in her bed?Then a vicious killer who has been strangling women in the area focuses on Cara. Police think bikers are involved. Can Cara set aside her trust issues and let Hawk into her life? Hawk sees it as his job to protect what is his...and Cara is very much his even if she doesn't know it yet. Cara keeps her heart guarded, but when danger comes calling, their lives collide. Hawk will stop at nothing to keep Cara safe and make her “Property of Hawk”. The Insurgents MC series are standalone romance novels. Hawk’s Property is Book One in the series. This book contains violence, strong language, and steamy sexual scenes. HEA. No cliffhangers. The book is intended for readers over the age of 18.",
  "genres": [
    "Romance",
    "Contemporary",
    "Erotica",
    "Contemporary Romance",
    "Abuse",
    "Dark",
    "Suspense"
  ],
  "author": "Chiah Wilder",
  "average_rating": "3.85",
  "url": "https://www.goodreads.com/book/show/26873744-hawk-s-property"
}