{
  "title": "Dark Matter Heart",
  "description": "A new town. A new school. A new beginning. Seventeen year-old Cordell Griffin and his mother move from Los Angeles to the Pacific Northwest to deal with his \"allergies,\" and start a healthier new life. Cor has one To blend in and be invisible. Unfortunately for him, no matter how far he goes, he can't run away from his secrets. Secrets about who he is. Secrets about why he's sick. And secrets about why so many people he meets end up dead, drained of blood.In \"Dark Matter Heart\", the origin novel in the \"Cor Griffin Bloodsuckers\" Young Adult Paranormal Thriller series from filmmaker and author Nathan Wrann, Cor must uncover the mysteries of his past and conquer the secrets of the present in order to protect the girl of his future, and save himself.------------------------------------------------------------About the Dark Matter Heart A new town. A new school. A new beginning. Seventeen year-old Cordell Griffin, and his mother, moved from Southern California to the Pacific Northwest to deal with his \"sun allergies,\" and bizarrely restrictive \"human blood diet\". Cor has one To blend in and be invisible. Unfortunately for him, no matter how far he goes, danger and tragedy lurk around every corner. Realizing that he and his friends, Taylor, Caitlyn, and Diana, can never lead normal lives, his goal changes to simply survive the experience. Armed with knowledge gleaned from antique books and artwork, Cor and his new friends set out to uncover the truth behind the myths, legends and scary stories that keep us awake late at night.The Dark Matter Heart Trilogy is the origin story in the Cor Griffin Bloodsuckers series. --------------------------------------------------------------------------- \"From Out Of Chaos\" Book 2 in the Dark Matter Heart Trilogy is now available.",
  "genres": [
    "Paranormal",
    "Vampires",
    "Young Adult",
    "Urban Fantasy",
    "Fantasy",
    "Thriller",
    "Romance"
  ],
  "author": "Nathan M. Wrann",
  "average_rating": "3.64",
  "url": "https://www.goodreads.com/book/show/11717567-dark-matter-heart"
}