{
  "title": "Razzle Dazzle: The Battle for Broadway",
  "description": "[Read by Peter Berkrot]Broadway's most respected (and feared) commentator pulls back the curtain on its stars, its producers, and its mega-hits to reveal all the shocking drama, intrigue, and power plays that happened off stage.Razzle Dazzle is a provocative, no-holds-barred narrative account of the people and the money and the power that re-invented an iconic quarter of New York City, turning its gritty back alleys and sex-shops into the glitzy, dazzling Great White Way -- and bringing a crippled New York from the brink of bankruptcy to its glittering glory.In the mid-1970s Times Square was the seedy symbol of New York's economic decline. Its once shining star, the renowned Shubert Organization, was losing theaters to make way for parking lots. Bernard Jacobs and Jerry Schoenfeld, two ambitious board members, saw the crumbling company was ripe for takeover and staged a coup amidst corporate intrigue, personal betrayals, and criminal investigations. Once Jacobs and Schoenfeld solidified their power, they turned a collapsed theater-owning holding company into one of the most successful entertainment empires in the world, ultimately backing many of Broadway's biggest hits, including A Chorus Line, Cats, Les Miserables, Phantom of the Opera, and Mamma Mia! They also sparked the revitalization of Broadway and the renewal of Times Square.Now Michael Riedel tells the stories of the Shubert Organization and the shows that re-built a city in grand style, revealing the backstage drama that often rivaled what transpired onstage, exposing bitter rivalries, unlikely alliances, and -- of course -- scintillating gossip. This is a great story, told with wit and passion.",
  "genres": [
    "Nonfiction",
    "Theatre",
    "History",
    "Music",
    "Audiobook",
    "New York",
    "Pop Culture"
  ],
  "author": "Michael Riedel",
  "average_rating": "4.16",
  "url": "https://www.goodreads.com/book/show/26878821-razzle-dazzle"
}