{
  "title": "The One-Hundred",
  "description": "WATTYS 2015 AWARD WINNER  If you're wanting a happy fairytale, keep looking. This isn't he story for you. But if you're looking for a mythical story filled with dystopia and magic, both dark and light, keep reading. This story is one where evil is in every crevice of the world, and where one girl is destined to destroy it. But first, she has to choose that destiny.  Every baby is killed beneath the waves--with one exception. The one-hundred thousandth lives.  A long time ago, 1 in every 100,000 children born from a human was a mermaid. But now mermaids are the only ones that can survive in this flooded world. The human children, the one-hundreds, are placed on the \"islands\" poking up over the sea. The humans that live through Mother Nature's fury have created Tribes, created rules. One of these rules is to not go near the water, to not touch it. And then there's a girl who lives to be sixteen, who goes and touches the water. Who begins to show symptoms of something half-human. Symptoms of a mermaid. These symptoms have drawn something out from the depths of the woods, from the darkness of the sea... And it's out to get this girl that's growing scales. The One-Hundred in the midst of one-hundreds. Cressa-la. Gifted and spared. Will she be so lucky again?  WATTPAD REVIEWS AND bailal1 : Ok so I really, really love this book. It was an instant hook, from the summary to the first chapter... I love trying to guess what might happen next, and all the twists and turns already in only the first chapter! The imagery was on point, the originality was check plus... livelaughanimals : The book had me hooked from the get-go... Overall, this book was definitely deserving of the Watty's Award. The imagery is AMAZING, and the plot and word choice is very polished. This is definitely a must-read! Wolfsbane753 : No other book can compare. I may be a boy, but this book about mermaids has gotten me completely hooked. I read this book start to finish, never stopping once... You had an amazing plot, with a wonderful array of characters. When you added the magic, I just couldn't stop reading... zeinabdel : It is really interesting and well written... As for the story itself, the plot is very original and different than the other stories we see which makes it very interesting to read. starry_dreams_ : it's enthralling and well written, with a mysterious touch that leaves me wanting more. Harmony_Sea : It's amazing I've read it so many times and can't stop reading it! ashlynnhigginson : It's very unique and always keeps you guessing. Each chapter gets readers asking for more. The storyline is unlike anything I've read before, filled with magic, mermaids, and a futuristic setting. I think it is probably one of the most creative stories I've read on Wattpad! :) EmanAlAdl : This book is my new favourite, with no doubt... the book content is decent unlike most of the books on this site. It also proves how a 16 year old girl can possess such a determined and an independent personality which is striking the image of the girl being weak that is spread by media. This book deserves all the support and success. ...AND SO MANY MORE!  \"The One-Hundred\" was an instant hit, reaching about one thousand reads on just the introduction within a short amount of time. As chapters were added on, the reads grew and grew--and it's reaching over EIGHT HUNDRED THOUSAND reads today, growing rapidly. So jump head-first into the mystery of the unknown, and read something like you've never read before.",
  "genres": [
    "Fantasy"
  ],
  "author": "K. Weikel",
  "average_rating": "4.06",
  "url": "https://www.goodreads.com/book/show/26885995-the-one-hundred"
}