{
  "title": "Thicker Than Blood",
  "description": "Now in a single volume...all of Crouch's Andrew Z. Thomas/Luther Kite novels that lead up to his and J.A. Konrath's thriller STIRRED...THICKER THAN The Complete Andrew Z. Thomas Trilogy (Desert Places, Locked Doors, and Break You), is now available in a single ebook featuring a goldmine of killer bonus features, including the never-before-released alternate endings to both Desert Places and Locked Doors, which together comprise the length of an additional novel.DESERT A \"Greetings. There is a body buried on your property, covered in your blood. The unfortunate young lady's name is Rita Jones. In her jeans pocket you'll find a slip of paper with a phone number on it. Call that number. If I have not heard from you by 8:00 p.m., the police will receive an anonymous call. I'll tell them where Rita Jones is buried on your property, how you killed her, and where the murder weapon can be found in your house. (I do believe a paring knife is missing from your kitchen.) I strongly advise against going to the police, as I am always watching you.\" Andrew Z. Thomas is a successful writer of suspense thrillers, living the dream at his lake house in the piedmont of North Carolina. One afternoon in late spring, he receives a bizarre letter that eventually threatens his career, his sanity, and the lives of everyone he loves. A murderer is designing his future, and for the life of him, Andrew can't get away.LOCKED A Seven years ago, suspense novelist Andrew Thomas's life was shattered when he was framed for a series of murders. The killer's victims were unearthed on Andrew's lakefront property, and since he was wanted by the FBI, Andrew had no choice but to flee and to create a new identity. Andrew does just that in a cabin tucked away in the remote wilderness near Haines Junction, Yukon. His only link to society is by e-mail, through which he learns that all the people he ever loved are being stalked and murdered. Culminating in the spooky and secluded Outer Banks of North Carolina, the paths of Andrew Thomas, a psychotic named Luther Kite, and a young female detective collide. Locked Doors is a novel of blistering suspense that will scare you to death.BREAK A Following the events of Desert Places and Locked Doors, Andy Thomas and Violet King are hiding out in the wilds of northern Canada, where Violet has a four-month-old son and a burgeoning romance with Andy. On a cold, rainy night at their cabin in the woods, the promise of an idyllic life that seems just around the corner is shattered when a man from their past, a monster of pure malevolence, returns. What he has in store for them will challenge their understanding of evil and stretch the fibers of their love to the breaking point.This 220,000-word ebook is absolutely loaded with content, including 2 full-length novels, a 20,000-word novella, an introduction, forewords to every book, an afterword, the short story, \"Ginsu Tony\" upon which Desert Places was based, the never-before-released 100-page alternate ending of Desert Places, the never-before-released 140-page alternate ending of Locked Doors, and more. This is everything written by Blake that you need to read in advance of the release of Blake's and J.A. Konrath's upcoming collaboration novel, Stirred.",
  "genres": [
    "Horror",
    "Thriller",
    "Mystery",
    "Mystery Thriller",
    "Fiction",
    "Short Stories",
    "Crime"
  ],
  "author": "Blake Crouch",
  "average_rating": "4.04",
  "url": "https://www.goodreads.com/book/show/26881599-thicker-than-blood"
}