{
  "title": "Amplitude: Part 2",
  "description": "This is the second part of the Amplify series and isn't a standalone. It is recommended you read the first of the two part series Amplified firstHaygan fights the forces that compel them together, by refusing to be in a relationship with Paige, always telling her the brutal truth, screwing other woman with her full knowledge, and shoving her towards other men. Yet, Haygan gives her mixed signals; refusing to let her go fully, always pursuing sex with her, jump starting her huge acting career, and emotionally supporting her in other areas of life.Idealistic Paige, has made a life of being everyone’s best friend, but is still lonely. Above all, she desires a deeper connection, which she thinks she discovers in Haygan. She has mind-altering boundary-pushing sex with him, but he honestly tells her, he is unavailable for anything more. For a time, Paige is happy with phenomenal kinky sex-buddy status, but the realization that he is unfaithful, not interested in any kind of relationship, and she is in love with him, ultimately coerces her to alter her course. Paige attempts to distance herself by telling Haygan she loves him and expecting he will run, but it only makes the twisted pair more tortured as the fates thrust them back together, by acting as co-stars in a three-part movie and enticing them to live under the same roof. Paige torments them both with sexual denial, but she stays inexplicably faithful to him as they shred each other apart emotionally with brief encounters.Unwavering Paige finally separates herself from Haygan, through a planned, shocking encounter shattering them both in half and forcing Haygan to face what he has long denied. Paige leaves him as her professional career soars to unimaginable heights, while her personal life hits even greater lows.Will Paige have the strength to resist Haygan or will she let love die?Will she ever be the same again?***Warning***This book is for adults. This book is not for people easily offended, have problems will illegal drug usage, explicit language, and graphic sexual descriptions. This is not your typical love story. Haygan and Paige’s romance is a turbulent, troubled, and flawed one. This story takes you on an emotional roller coaster of highs and lows. There is a happily ever after, but it is a long, painful road to their end.",
  "genres": [],
  "author": "Naomi Landes",
  "average_rating": "3.60",
  "url": "https://www.goodreads.com/book/show/26889008-amplitude"
}