{
  "title": "Perilous Passage: Mankind and the Global Ascendancy of Capital",
  "description": "In this innovative and ambitious global history, distinguished economic historian Amiya Kumar Bagchi critically analyzes the processes leading to the rise of the West since the sixteenth century to its current position as the most prosperous and powerful group of nations in the world. Integrating the history of armed conflict with the history of competition for trade, investment, and markets, Bagchi explores the human consequences for people both within and outside the region. He characterizes the emergence and operation of capitalism as a system driven by wars over resources and markets rather than one that genuinely operates on the principle of free markets. In tracing this history, he also charts what happened to the people who came under its sway during the last five centuries.Bagchi thus broadens our understanding of the nature and history of capitalism and challenges the fetishism of commodities that limits the perspective of most economic historians. The book also challenges the Eurocentrism that still underlies the conceptual framework of many mainstream historians, joining earlier narratives that chronicle the history of human beings as living persons rather than as puppets serving the abstract cause of \"economic growth.\"His unflinching examination of the human costs of development—not only in the colonial periphery but in the core nations—includes not only economic processes and issues of inequality within and among nations but also the intertwining of economics and war-making on a world scale. The book also contributes to our knowledge of how and in what sequence human health has been shaped by public health care, sanitation, modern medicine, income levels and nutrition. Written with extraordinary range and depth, Perilous Passage will change the ways in which we think about many of the largest issues in world history and development.",
  "genres": [
    "History",
    "Economics",
    "Politics",
    "Nonfiction",
    "World History",
    "Theory"
  ],
  "author": "Amiya Kumar Bagchi",
  "average_rating": "4.29",
  "url": "https://www.goodreads.com/book/show/2690635-perilous-passage"
}