{
  "title": "The Bride of Texas",
  "description": "Josef Skvorecky, as a Czech émigré and Canadian citizen, seems an unlikely chronicler of the American Civil War. On closer examination, however, Skvorecky's choice of subject matter in his novel The Bride of Texas makes a great deal of sense: he has spent his career struggling with problems of nationalism, totalitarianism, and the crushing effects of history on the individual spirit, from his pre-immigration writings such as The Bass Saxophone to his great later works, including The Engineer of Human Souls.  He centres The Bride of Texas on a largely historical group of Czech combatants in the Union Army, whose stories Skvorecky discovered in the Czech archives at the University of Chicago while researching his novel Dvorak in Love. The novel follows the soldiers as they campaign for General Sherman in the closing months of the war, but it reaches forward into the post-war years and backward into the soldiers' pasts in the United States and Europe. Skvorecky develops his characters in decidedly romantic terms: Sergeant Kapsa has fled to the United States in the wake of a catastrophic love affair with an Austrian officer's wife; Cyril Toupelik falls hopelessly in love with a beautiful slave from a neighbour's cotton plantation; while his sister Lida (the bride of the title) is buffeted by a series of doomed affairs in both Europe and America. These narratives are interspersed with the autobiographical writings of Lorraine Henderson Tracy, a popular novelist, protofeminist, and confidante of the much-maligned General Ambrose Burnside.  This is an enormous, complex, and meticulously plotted novel. Though not perfect--Skvorecky's few combat sequences are disappointingly vague, and his treatment of the Civil War may feel too idealistic to some--it is unique. The closely knit Czech combatants never quite assimilate into American culture, giving The Bride of Texas an outsider's perspective that allows it to sharply illuminate the cultural, sexual, and racial struggles of both Europe and America. --Jack Illingworth",
  "genres": [
    "Fiction",
    "Czech Literature",
    "Historical Fiction"
  ],
  "author": "Josef Škvorecký",
  "average_rating": "3.49",
  "url": "https://www.goodreads.com/book/show/2690243-the-bride-of-texas"
}