{
  "title": "Blood in the Fruit",
  "description": "Blood in the Fruit , the hard-hitting fourth volume of the five-novel Marq’ssan Cycle, focuses sharp, analytical attention on human rights issues. The novel opens in October 2086. After ten years’ absence, the Marq’ssan Fleet returns to Earth to determine whether humans should be quarantined, and a young alien, unprepared for the shock of human culture, becomes a dangerous loose cannon taking violent, unilateral action. In the Free Zone, a flood of renegades led by Elizabeth Weatherall establish a fortress; even Hazel Bell, Weatherall’s lover, doesn’t know what they’re up to. In the US, when the government responds to increasing dissent and civil disorder by ratcheting up its repressive tactics, brave and dedicated human rights activists like Celia Espin join forces with the Free Zones in a global challenge that threatens to undermine governments around the world. Blood in the Fruit offers a grand, sweeping story through the eyes of four individuals with markedly contrasting perspectives and experience. Reviews “The latest book in the Marq’ssan Cycle might just be the best yet, part of a series that is the most important political SF published in the last decade. Praised by the likes of Cory Doctorow and Samuel Delany, Duchamp’s accomplishment here is deadly, sharp, emotional, and intelligent.”— Jeff VanderMeer, OMNIVORACIOUS , March 18, 2008 “The novel—the series for that matter—is a distillation of political and ethical philosophy, a commentary on the importance and frailty of human rights, a feminist dystopia, and something of an adventure story, although most of the real conflict tends to be on the intellectual rather than physical level. This is the kind of novel which probably won’t appeal to a mass audience, in part because it steps outside the usual genre rules. For those willing to invest the time to actually think about what they’re reading and work out the implications, it’s a treasure house.”— Don D’Ammassa, September 25, 2007 “Each volume [of the Marq’ssan Cycle] is...a narrative which grabs and does not let you go and leaves you breathless at the end....[It is a] sophisticated, complex, and realistic depiction of women, social organisation, and the tangled interplay of the personal and the political... Blood in the Fruit is not a comfortable it goes to some very dark places indeed, although never pruriently lingers on pain and suffering in a gratuitous fashion. But it is a very rewarding one.”—Lesley A. Hall, Strange Horizons , May 23, 2008",
  "genres": [
    "Science Fiction",
    "Fiction"
  ],
  "author": "L. Timmel Duchamp",
  "average_rating": "4.12",
  "url": "https://www.goodreads.com/book/show/2691884-blood-in-the-fruit"
}