{
  "title": "Become the Woman of Your Dreams! 2 (Interactive Gender Transformation Feminization Erotica)",
  "description": "\"You don't know any spells to turn men into women, do you?\" you ask the wizard nervously, well aware of how strange the question must sound.He scoffs. \"You kidding? Gender transformation magic just so happens to be my specialty.\"Your eyes widen. \"No way... \"This could be the solution to all my problems! The novel I'm working on is about a man who wakes up one morning as a woman, but I haven't been able to get into the protagonist's head.\"\"Is that so? Well, when I'm done with you you'll be able to write a friggin' sex change autobiography! But I've gotta warn you, it's hard out there for a woman. Are you sure you want to go through with this?\"*\n\"Yeah, let's do it.\"\n*\"I don't know...\"In April of 2015, Aurora Sparks set the Amazon charts on fire with debut game book Become the Woman of Your Dreams!, the first-ever interactive gender transformation novel. Now, she's back with the sequel to that sizzling runaway smash.In \nBecome the Woman of Your Dreams! 2\n, you step into the shoes of a male erotica author hard at work on an epic gender transformation novel. You've got the ambition and the talent to write a masterpiece. There's only one minor issue: you have no idea what it's like to be a woman. Just when you're about to throw in the towel, a wizard from another dimension offers you the chance to experience life from a female perspective. He asks whether you're into blondes, brunettes, black-haired women or redheads. Do you like your women supermodel-skinny or a little bit thicker? Then, with a wave of his magic wand, he creates a sexy female body customized to suit your tastes.From there, you're thrown into a weird, wide world where anything can happen—and I do mean anything. You might hop on the back of a werewolf biker's Harley and experience a massive MC orgy in a tumble-down roadhouse, or recline on the back of a Bengal tiger as you get some oral action from a vampire billionaire. A dream could spirit you away to a fairytale forest, where you'll watch Sasquatch duke it out with a bear shifter for your affection. You may even meet an untimely end... and then hook up with well-hung angels in the afterlife!One thing, at least, is for certain: with 100,000 words' worth of content (That's nearly three times the length of BtWoYD!!), 50-plus unique endings and myriad alternate paths at your fingertips, you'll never read the same story twice.",
  "genres": [],
  "author": "Aurora Sparks",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/26895666-become-the-woman-of-your-dreams-2-interactive-gender-transformation-fe"
}