{
  "title": "That Eighteenth Summer",
  "description": "The summer of 2003, Ollie Hannigan's eighteenth summer, changes everything...Ollie knows exactly where he's going and what his plan is: get a smokin' hot girlfriend (so she can cry over him when he enlists), join the military, work his way up to Army Ranger, and finally earn he respect of his big brother, Benjam.But everything changes when a military car pulls up in front of the Hannigan household.Now Ollie's world is in chaos. His friends have abandoned him, his plans are falling through left and right, and he doesn't know what he wants in life anymore. Plus, as if he wasn't already confused enough, his brother's best friend, Luca Santini, has caught Ollie's eye.While Luca may be smokin' hot, he's definitely not the girlfriend Ollie was expecting!--------------Dear Author,All my life I idolized my older brother. He was popular, always had pretty girlfriends, and was wicked smart. When he joined the military, I thought I would follow in his footsteps.When I turned eighteen, the summer after graduating high school, the army men came to the door to deliver the blow. My brother was dead. When his best friend and fellow soldier came to his funeral, I felt like I had a part of my brother back. Someone I could talk too. Someone who understood the loss of my best friend and inspiration.I had always hoped to be like my brother and have a hot girlfriend, so I don’t understand why I am starting to feel something for this man. Why am I turned on? Why do I want to feel how soft his lips are?Photo Description: Two men snuggle together. One, dark haired, bearded, and wearing a gray Henley, sits on the floor, leaning against the foot of the bed. The other, also dark haired and dressed in jeans and a black sleeveless tee, lays his head on the first man’s shoulder. Both have their eyes closed. There is a bold green and cream patterned bedspread on the bed. The early morning light perfectly accents the photograph.This story was written as a part of the M/M Romance Group's \"Love is an Open Road\" event. Group members were asked to write a story prompt inspired by a photo of their choice. Authors of the group selected a photo and prompt that spoke to them and wrote a short story. This story may contain sexually explicit content and is intended for adult readers. It may contain content that is disagreeable or distressing to some readers. The M/M Romance Group strongly recommends that each reader review the General Information section before each story for story tags as well as for content warnings.",
  "genres": [
    "M M Romance",
    "Romance",
    "Military Fiction",
    "Contemporary",
    "Disability",
    "Young Adult",
    "Coming Of Age"
  ],
  "author": "Raine O'Tierney",
  "average_rating": "3.98",
  "url": "https://www.goodreads.com/book/show/26892128-that-eighteenth-summer"
}