{
  "title": "The Fog: A Novel",
  "description": "Excerpt from The Fog: A Novel I straddled, precariously balanced, atop a seven-foot fence marking the northern boundary of the little Vermont school yard. As this was the opening morning for the September term, I had left home painfully dressed in the full armor of country-village scholarship. Already the puckering-string of my blouse was broken and my new dollar-and-a-quarter boots were hot upon my feet. No matter! Noisily on the philosophical old boards I whacked a barrel stave. I had aspirations toward making the lower world of pinafored humanity remark nervously of my valor and horrible propensities for breaking an arm. But I did not address that pinafored world directly. No such aplomb is possessed by a youngster of eight. A new boy edged his way into the yard twenty minutes before the bell rang and moved along my fence. He concentrated upon tallying its knotholes. I noted that he was a stranger and immediately took his measure. \"'Lo!\" I greeted him. \"'Lo, yourself!\" he responded. \"What's yer name?\" I demanded, piqued. \"Name, name, Puddin' Tame; ask me again and I'll tell yer the same!\" \"Aw, don't get fresh!\" I advised him. \"I could 'do' you with one hand tied behind me - if I wanted.\" \"My ma licks me if I fight - when I'm dressed up. If it wasn't for that, you couldn't.\" And the new boy looked at me gladiatorially, expecting me to believe this bravado without a question. About the Publisher Forgotten Books publishes hundreds of thousands of rare and classic books. Find more at www.forgottenbooks.com This book is a reproduction of an important historical work. Forgotten Books uses state-of-the-art technology to digitally reconstruct the work, preserving the original format whilst repairing imperfections present in the aged copy. In rare cases, an imperfection in the original, such as a blemish or missing page, may be replicated in our edition. We do, however, repair the vast majority of imperfections successfully; any imperfections that remain are intentionally left to preserve the state of such historical works.",
  "genres": [],
  "author": "William Dudley Pelley",
  "average_rating": "1.75",
  "url": "https://www.goodreads.com/book/show/26930302-the-fog"
}