{
  "title": "Facts and Statements Concerning the Right of the Crown of Portugal to the Territories of Molembo, Cabinda, Ambriz, and Other Places on the West Coast ... and the Eighth Degree of South Latitude, 187",
  "description": "Excerpt from Facts and Statements Concerning the Right of the Crown of Portugal to the Territories of Molembo, Cabinda, Ambriz, and Other Places on the West Coast of Africa, Situated Between the Fifth Degree Twelve Minutes, and the Eighth Degree of South Latitude, 187Occurrence of various Facts on the West Coast of Africa, situated between the 5th degree 12 minutes, and the 8th degree south latitude. The Convention of 1876 between Portugal and France. The Conquest of Mossulo in 1790; Treaties between England and Portugal, and Great Britain's Interpretation of them up to the month of September, 1846; The Constitutional Charter of the Portuguese Monarchy. The Territories of Cabinda and Molembo. The Constitution of 1838, and the British Government; Various Particulars, relating to Portuguese Dominion, to the Slave Trade and to Lawful Commerce on the African Coast. Session of the Colonial Council in which the Occupation of Ambriz was proposed; The Question raised by the English Government in 1846 as to Interpretation of the Treaties. Examination of this Question; Objections of the British Government; The Occupation of Ambriz in 1855. Proceedings of the Portuguese Authorities. Correspondence of the English Naval Commanders. Slave Trade. Lawful Commerce. ConclusionAbout the PublisherForgotten Books publishes hundreds of thousands of rare and classic books. Find more at www.forgottenbooks.comThis book is a reproduction of an important historical work. Forgotten Books uses state-of-the-art technology to digitally reconstruct the work, preserving the original format whilst repairing imperfections present in the aged copy. In rare cases, an imperfection in the original, such as a blemish or missing page, may be replicated in our edition. We do, however, repair the vast majority of imperfections successfully; any imperfections that remain are intentionally left to preserve the state of such historical works.",
  "genres": [],
  "author": "Sá da Bandeira",
  "average_rating": "0.00",
  "url": "https://www.goodreads.com/book/show/26949042-facts-and-statements-concerning-the-right-of-the-crown-of-portugal-to-th"
}