{
  "title": "Curiosities of Puritan Nomenclature",
  "description": "Excerpt from Curiosities of Puritan Nomenclature I will not be so ill-natured as to quote the names of all the writers who have denied the existence of Puritan eccentricities at the font. One, at least, ought to have known better, for he has edited more books of the Puritan epoch than any other man in England. The mistake of all is that, misled perhaps by Walter Scott and Macaulay, they have looked solely to the Commonwealth period. The custom was then in its decay. I have to thank several clergymen for giving me extracts from the registers and records under their care. A stranger to them, I felt some diffidence in making my requests. In every case the assistance I asked for was readily extended. These gentlemen are the Rev. W. Sparrow Simpson, St. Matthew, Friday Street, London; the Rev. W. Wodehouse, Elham, Canterbury; the Rev. J. B. Waytes, Markington, Yorks.; the Rev. William Tebbs, Caterham Valley; the Rev. Canon Howell, Drayton, Norwich; the Rev. J. O. Lord, Northiam, Staplehurst; and the Rev. G. E. Haviland, Warbleton, Sussex. About the Publisher Forgotten Books publishes hundreds of thousands of rare and classic books. Find more at www.forgottenbooks.com This book is a reproduction of an important historical work. Forgotten Books uses state-of-the-art technology to digitally reconstruct the work, preserving the original format whilst repairing imperfections present in the aged copy. In rare cases, an imperfection in the original, such as a blemish or missing page, may be replicated in our edition. We do, however, repair the vast majority of imperfections successfully; any imperfections that remain are intentionally left to preserve the state of such historical works.",
  "genres": [
    "Nonfiction",
    "Religion",
    "History"
  ],
  "author": "Charles Wareing Endell Bardsley",
  "average_rating": "4.22",
  "url": "https://www.goodreads.com/book/show/26967845-curiosities-of-puritan-nomenclature"
}