{
  "title": "Improbable Warriors: Women Scientists and the U.S. Navy in World War II",
  "description": "At the outbreak of World War II, four scientists left their comfortable college teaching positions to work for the government. Three served in uniform, the fourth oversaw contracts for the Navy. Such dramatic changes in life styles during the period were common -- for men. But these established scientists were women, and each made significant contributions to a Navy embroiled in a modern, science-dependent war. Mary Sears, a Woods Hole Oceanographic Institution planktonologist, headed the Hydrographic Office's Oceanographic Unit. Grace Hopper, a Yale-trained mathematician, went to the Bureau of Ships Computation Laboratory at Harvard where she worked on one of the first computers, churning out essential data for ordnance and other projects. Florence van Straten, a New York University chemist, served as an aerological engineer analyzing the use of weather in combat. Mina Rees was the chief technical aide to the applied mathematics panel of the National Defense Research Committee. This book firmly places the women within the context of their times. Deeply rooted in previously unexamined primary sources, the work helps readers understand the personal and professional experiences of women in the military and the attitudes they faced, and fully appreciate the educational and occupational barriers faced by women scientists in the 1930s and 1940s.The author focuses on their efforts during the war, but also discusses the women's skills and training, tells how they came to war work, and examines the contributions they made once there. She further considers how the war changed their lives, especially their professional lives, and how it affected their future careers. While other books havebeen written about women in the military, this is the first to focus on Navy women scientists.",
  "genres": [
    "History",
    "World War II",
    "Nonfiction",
    "Biography",
    "Science"
  ],
  "author": "Kathleen Broome Williams",
  "average_rating": "3.50",
  "url": "https://www.goodreads.com/book/show/2699627-improbable-warriors"
}