{
  "title": "Roar Of The Heavens: Surviving Camille, the Worst Storm in American",
  "description": "\"Rain is likely tonight, ending tomorrow. Thursday will be fair and cooler.\" So began the final and most destructive act of Hurricane Camille, a storm so ferocious that scientists calculated the odds as once in a thousand years. In 1969, meteorologists were yet to have satellite and computer technology at their disposal, and the National Hurricane Center’s director, Dr. Robert Simpson, could only rely on his instincts to predict Camille’s track. The Category Five storm, with wind gusts over 200 miles per hour, tore into the Mississippi/Alabama coast, erasing entire towns. At a hurricane party on a rooftop a few miles from where Camille made landfall, the nearly three-story tidal storm surge—the highest ever measured—collapsed the entire building and swept 23 people to their deaths. Incredibly, the worst was yet to come. As Camille hit the mountains of western Virginia she also collided with two other weather systems that squeezed millions of tons of water out of the storm like a sponge. It didn’t just rain; the air held nearly the maximum amount of water theoretically possible, becoming a solid body of descending liquid, and lightning flashed sideways. Eight hours and more than two feet of rain later, 124 people in rural Nelson County were dead. Many of them, taken by the devastating floods, would never be found. Roar of the Heavens tells Camille’s destructive hour-by-hour story through the riveting first-person accounts of survivors and key players, including Dr. Simpson, who would later help to pioneer the universal Saffir-Simpson Scale for hurricanes; Mary Ann Gerlach, the lone survivor of that hurricane party, who was later found clinging to a tree five miles away; and William Whitehead, the very untraditional sheriff of Nelson County, who became a central figure in the storm’s aftermath. At the height of school desegregation, blacks and whites came together to rebuild, and students worked together with locals who had so recently attacked them for demonstrating against the Vietnam War. Camille’s ferocity exposed the inadequacies of the nation’s ability to deal with such a cataclysmic event and led directly to the creation of the Federal Emergency Management Agency. Yet Roar of the Heavens is also a cautionary tale, as the United States is still terribly unprepared to deal with hurricanes. When Katrina came ashore as a Category Four hurricane in 2005, over 1,000 lives were tragically lost, and experts agree that it is only a question of time before another Category Five storm hits the U.S. mainland.",
  "genres": [
    "Nonfiction",
    "History",
    "American History"
  ],
  "author": "Stefan Bechtel",
  "average_rating": "4.22",
  "url": "https://www.goodreads.com/book/show/269934.Roar_Of_The_Heavens"
}