{
  "title": "The Woman That Never Evolved",
  "description": "What does it mean to be female? Sarah Blaffer Hrdy--a sociobiologist and a feminist--believes that evolutionary biology can provide some surprising answers. Surprising to those feminists who mistakenly think that biology can only work against women. And surprising to those biologists who incorrectly believe that natural selection operates only on males.In The Woman That Never Evolved we are introduced to our nearest female relatives competitive, independent, sexually assertive primates who have every bit as much at stake in the evolutionary game as their male counterparts do. These females compete among themselves for rank and resources, but will bond together for mutual defense. They risk their lives to protect their young, yet consort with the very male who murdered their offspring when successful reproduction depends upon it. They tolerate other breeding females if food is plentiful, but chase them away when monogamy is the optimal strategy. When \"promiscuity\" is an advantage, female primates--like their human cousins--exhibit a sexual appetite that ensures a range of breeding partners. From case after case we are led to the conclusion that the sexually passive, noncompetitive, all-nurturing woman of prevailing myth never could have evolved within the primate order.Yet males are almost universally dominant over females in primate species, and Homo sapiens is no exception. As we see from this book, women are in some ways the most oppressed of all female primates. Sarah Blaffer Hrdy is convinced that to redress sexual inequality in human societies, we must first understand its evolutionary origins. We cannot travel back in time to meet our own remote ancestors, but we can study those surrogates we have--the other living primates. If women --and not biology--are to control their own destiny, they must understand the past and, as this book shows us, the biological legacy they have inherited.",
  "genres": [
    "Science",
    "Nonfiction",
    "Feminism",
    "Anthropology",
    "Evolution",
    "Psychology",
    "Biology"
  ],
  "author": "Sarah Blaffer Hrdy",
  "average_rating": "4.09",
  "url": "https://www.goodreads.com/book/show/270098.The_Woman_That_Never_Evolved"
}