{
  "title": "Why They Stay: Sex Scandals, Deals, and Hidden Agendas of Nine Political Wives",
  "description": "Why do good women stay with bad men?What if political wives are just as calculating as their infamous husbands?If Hilary Clinton had left her marriage, she might only be known as the spurned wife of a retired politician. Instead, she became the first woman to run for U.S. president on a major party ticket.Veteran political journalist Anne Michaud knows the hidden agendas women employ to gain and cling to power. Working as a reporter for The Wall Street Journal and awarded “Columnist of the Year” by the New York News Publishers Association, Anne has researched the women behind some of the most notorious men in the public eye.She discovered a surprising pattern as old as the dynastic maneuverings of England’s medieval queens.Today, women married to the “royalty” of our times–politicians–make bold decisions to keep their “thrones” and their family’s history-making potential.Why They Stay reveals the inner lives of eight political wives as they fight to maintain a grip on power and pursue personal ambition:Melania & Donald Trump: A foreigner’s desire to live the American dreamHilary & Bill Clinton: One masterful decision launched her political careerJackie & John F. Kennedy: Coping in bed and all the way to the bankEleanor & Franklin D. Roosevelt: A lifeless marriage sparks a social championMarion Stein & Jeremy Thorpe: Riding out British scandal to provide for her sonsWendy & David Vitter: Married to the Party versus married to a manSilda Wall & Elliot Spitzer: Real-life drama spawns TV show The Good WifeHuma Abedin & Anthony Weiner: How to win against a man and the MediaThese political wives aren’t powerless pawns. They are shrewder than you expect. Why They Stay pulls back the curtain to reveal why women throughout history stand by their man … for better and for worse.",
  "genres": [
    "Nonfiction",
    "Politics",
    "History",
    "Inspirational",
    "Education",
    "Book Club",
    "How To"
  ],
  "author": "Anne  Michaud",
  "average_rating": "4.29",
  "url": "https://www.goodreads.com/book/show/27015454-why-they-stay"
}