{
  "title": "Satyricon",
  "description": "Oorspronkelijk in het Nederlands uitgegeven als Schelmen en tafelschuimers : een satirische zedenroman uit de tijd van keizer Nero. door De Haan (1966).Petronius was een vertrouweling van keizer Nero en maître des plaisirs aan diens hof. Veel meer weten we niet, behalve dat hij een principiële immoralist en een levensgenieter was, zoals blijkt uit de schets die geschiedschrijver Tacitus van hem geeft. Al in de eerste zin van diens portret staat: ‘Petronius passeerde zijn dagen slapend, zijn nachten met de verplichtingen en genietingen des levens.’ Om aan een vonnis te ontkomen pleegde hij in 66 n.Chr. zelfmoord.Satyricon is met niets anders in de klassieke literatuur te vergelijken. In deze fragmentarisch overgeleverde avonturenroman, die zich afspeelt in de lagere regionen van de Romeinse maatschappij, zijn de hoofdpersonen nogal louche, maar sympathieke slaven en vrijgelatenen. Via hun belevenissen geeft Petronius een onvergetelijk beeld van het leven in het Romeinse Zuid-Italië. Er wordt bedrogen, gescholden en gevochten, maar ook vriendschap gesloten, plezier gemaakt en gevreeën. De bekendste passage is het humoristische ‘feestmaal bij Trimalchio’, waarin decadente gerechten en vulgaire gesprekken elkaar in hoog tempo afwisselen.Lange tijd vond men door de ‘aanstootgevende’ passages een integrale vertaling niet wenselijk (‘On lit Pétrone, on ne cite pas’) en las men het boek vooral stiekem. Tegenwoordig staat Petronius echter weer volop in de belangstelling, vooral sinds Fellini’s beroemde film Satyricon.Deze eerste integrale, ongekuiste vertaling van de hand van A.D. Leeman beleefde al drie drukken.Ed van Eeden in Utrechts Nieuwsblad: ‘De Satyricon [is] superieure literatuur, de eerste Europese roman, een van de zeldzame bronnen over de Latijnse volkstaal en de kleinburgerlijke moraal van vrijgekochte Romeinse slaven, een edelsmeedwerk uit de Zilveren periode der Latijnse literatuur.’",
  "genres": [
    "Fiction",
    "Poetry",
    "Literature",
    "Ancient",
    "Classics",
    "Roman",
    "Ancient History"
  ],
  "author": "Petronius",
  "average_rating": "3.78",
  "url": "https://www.goodreads.com/book/show/11722189-satyricon"
}