{
  "title": "African Queen: The Real Life of the Hottentot Venus",
  "description": "Saartjie Baartman was twenty-one years old when she was taken from her native South Africa and shipped to London. Within weeks, the striking African beauty was the talk of the social season of 1810–hailed as “the Hottentot Venus” for her exquisite physique and suggestive semi-nude dance. As her fame spread to Paris, Saartjie became a lightning rod for late Georgian and Napoleonic attitudes toward sex and race, exploitation and colonialism, prurience and science. In African Queen, Rachel Holmes recounts the luminous, heartbreaking story of one woman’s journey from slavery to stardom.Born into a herding tribe known as the Eastern Cape Khoisan, Saartjie was barely out of her teens when she was orphaned and widowed by colonial war and forced aboard a ship bound for England. A pair of clever, unscrupulous showmen dressed her up in a body stocking with a suggestive fringe and put her on the London stage as a “specimen” of African beauty and sexuality. The Hottentot Venus was an overnight sensation.But celebrity brought unexpected consequences. Abolitionists initiated a lawsuit to win Saartjie’s freedom, a case that electrified the English public. In Paris, a team of scientists subjected her to a humiliating public inspection as they probed the mystery of her sexual allure. Stared at, stripped, pinched, painted, worshipped, and ridiculed, Saartjie came to symbolize the erotic obsession at the heart of colonialism. But beneath the costumes and the glare of publicity, this young Khoisan woman was a person who had been torn from her own culture and sacrificed to the whims of fashionable Europe.Nearly two centuries after her death, Saartjie made headlines once again when Nelson Mandela launched a campaign to have her remains returned to the land of her birth. In this brilliant, vividly written book, Rachel Holmes traces the full arc of Saartjie’s extraordinary story–a story of race, eros, oppression, and fame that resonates powerfully today.From the Hardcover edition.",
  "genres": [
    "History",
    "Nonfiction",
    "Africa",
    "Biography",
    "Feminism",
    "Historical",
    "Race"
  ],
  "author": "Rachel  Holmes",
  "average_rating": "3.60",
  "url": "https://www.goodreads.com/book/show/270277.African_Queen"
}