{
  "title": "Hardtack & Coffee: The Unwritten Story of Army Life",
  "description": "First published more than 100 years ago, Hardtack And Coffee is John Billings’ absorbing first-person account of the everyday life of a U.S. Army soldier during the Civil War.  Billings attended a reunion of Civil War veterans in 1881 that brought together a group of survivors whose memories and stories of the war compelled him to write this account.  It is set in November, 1860.  Lincoln has been elected as President of the United States.  The Democrats split into two factions, divided over the issue of slavery.  As early as October, Southern politicians decide that the state of South Carolina should withdraw from the union.  Georgia, Alabama, Mississipi are among the states who seceded from the Union, creating the South Confederacy.  On the 15th April, Lincoln issues a proclamation that will send 75,000 militia to suppress the rebellion for three months.  ‘Hard Tack and Coffee’ is the story of one of those ‘Minute Men’.  John D Billings describes in rich detail the daily routine of a foot soldier as the Civil War developed.  Recruitment became conscription, provisions became rations, tents became ‘bomb-proofs’, and the muzzle-loading rifle became breech-loaded.  In this unique account, we are given the first-hand account of life as a Massachusetts soldier, from conscription and training through to camp-life at discipline.  First published in 1887, ‘Hard Tack and Coffee’ is a gripping military memoir that promises to deliver a new insight into the Civil War.  Albion Press is an imprint of Endeavour Press, the UK's leading independent digital publisher. For more information on our titles please sign up to our newsletter at www.endeavourpress.com. Each week you will receive updates on free and discounted ebooks. Follow us on Twitter: @EndeavourPress and on Facebook via http://on.fb.me/1HweQV7. We are always interested in hearing from our readers. Endeavour Press believes that the future is now.",
  "genres": [
    "Civil War",
    "History",
    "Nonfiction",
    "American Civil War",
    "Military Fiction",
    "Memoir",
    "American History"
  ],
  "author": "John Davis Billings",
  "average_rating": "4.05",
  "url": "https://www.goodreads.com/book/show/27030321-hardtack-coffee"
}