{
  "title": "The Poetry of Charles d'Orléans and His Circle: A Critical Edition of Bnf Ms. Fr. 25458, Charles d'Orléans's Personal Manuscript of His Poetry and that of His Court at Blois",
  "description": "This is the first complete, modern critical edition of the personal copy of the poetry of Charles, duc Orléans (BnF MS. fr. 25458), a manuscript made up primarily of lyrics. The duke also included lyrics composed by members of his household, his family, his friends, his peers, and various visitors to his court at Blois. The edition contains the first translation (facing-page) of the duke’s collection into English. It is intended to supersede Pierre Champion’s 1923 edition of the same manuscript. Before Champion, editions of the duke’s poetry simply reproduced the poems in manuscript order; his edition offered a new order based on his observations of the manuscript’s construction. This new edition corrects that order by basing it on a recent codicological study of the manuscript, The Poet’s Notebook, by Mary-Jo Arn. The manuscript was almost certainly commissioned in London near the end of the duke’s captivity (1439–1440). Into it went most of the poetry the duke had written up to that time (he was about forty-six), but he also arranged for many blank leaves for future compositions. He returned to France with it and continued to add lyrics until his death in 1465, adding parchment as the need arose. No manuscript can thus have any higher authority than this one (though a handful of lyrics that were not copied into it turn up in other manuscripts). It could be described as a best-text edition, but it is more than that because of its provable physical connection with the author over a period of decades. Although this collection contains eleven lyrics in Middle English, the bulk of his English poetry can be found in another manuscript, BL MS. Harley 682, edited in 1994 by Mary-Jo Arn (Fortunes stabilnes). This edition is intended for literary scholars of both French and English, but its extensive contextualizing introduction, translation, and glossary will make it useful to advanced students and readers in a variety of disciplines. With an excursus on literary context by Stephanie A. V. G. Kamath (University of Massachusetts, Boston).",
  "genres": [],
  "author": "Charles d'Orléans",
  "average_rating": "3.00",
  "url": "https://www.goodreads.com/book/show/11723848-the-poetry-of-charles-d-orl-ans-and-his-circle"
}