{
  "title": "The Unthinkable: Who Survives When Disaster Strikes—and Why",
  "description": "It lurks in the corner of our imagination, almost beyond our ability to see the possibility that a tear in the fabric of life could open up without warning, upending a house, a skyscraper, or a civilization.Today, nine out of ten Americans live in places at significant risk of earthquakes, hurricanes, tornadoes, terrorism, or other disasters. Tomorrow, some of us will have to make split-second choices to save ourselves and our families. How will we react? What will it feel like? Will we be heroes or victims? Will our upbringing, our gender, our personality–anything we’ve ever learned, thought, or dreamed of–ultimately matter?    Amanda Ripley, an award-winning journalist for Time magazine who has covered some of the most devastating disasters of our age, set out to discover what lies beyond fear and speculation. In this magnificent work of investigative journalism, Ripley retraces the human response to some of history’s epic disasters, from the explosion of the Mont Blanc munitions ship in 1917–one of the biggest explosions before the invention of the atomic bomb–to a plane crash in England in 1985 that mystified investigators for years, to the journeys of the 15,000 people who found their way out of the World Trade Center on September 11, 2001. Then, to understand the science behind the stories, Ripley turns to leading brain scientists, trauma psychologists, and other disaster experts, formal and informal, from a Holocaust survivor who studies heroism to a master gunfighter who learned to overcome the effects of extreme fear.Finally, Ripley steps into the dark corners of her own imagination, having her brain examined by military researchers and experiencing through realistic simulations what it might be like to survive a plane crash into the ocean or to escape a raging fire.    Ripley comes back with precious wisdom about the surprising humanity of crowds, the elegance of the brain’s fear circuits, and the stunning inadequacy of many of our evolutionary responses. Most unexpectedly, she discovers the brain’s ability to do much, much better, with just a little help.The Unthinkable escorts us into the bleakest regions of our nightmares, flicks on a flashlight, and takes a steady look around. Then it leads us home, smarter and stronger than we were before.",
  "genres": [
    "Nonfiction",
    "Psychology",
    "Science",
    "Survival",
    "Self Help",
    "History",
    "Audiobook"
  ],
  "author": "Amanda Ripley",
  "average_rating": "4.19",
  "url": "https://www.goodreads.com/book/show/2706211-the-unthinkable"
}