{
  "title": "East West Street: On the Origins of \"Genocide\" and \"Crimes Against Humanity\"",
  "description": "A profound and profoundly important book—a moving personal detective story, an uncovering of secret pasts, and a book that explores the creation and development of world-changing legal concepts that came about as a result of the unprecedented atrocities of Hitler’s Third Reich.East West Street looks at the personal and intellectual evolution of the two men who simultaneously originated the ideas of “genocide” and “crimes against humanity,” both of whom, not knowing the other, studied at the same university with the same professors, in a city little known today that was a major cultural center of Europe, “the little Paris of Ukraine,” a city variously called Lemberg, Lwów, Lvov, or Lviv. It begins in 2010 and moves backward and forward in time, from the present day to twentieth-century Poland, France, Germany, England, and America, ending in the courtroom of the Palace of Justice at the International Military Tribunal in Nuremberg in 1945. The book opens with the author being invited to give a lecture on genocide and crimes against humanity at Lviv University, welcomed as the first international law academic to give a lecture there on such subjects in fifty years. Sands accepted the invitation with the intent of learning about the extraordinary city with its rich cultural and intellectual life, home to his maternal grandfather, a Galician Jew who had been born there a century before and who’d moved to Vienna at the outbreak of the First World War, married, had a child (the author’s mother), and who then had moved to Paris after the German annexation of Austria in 1938. It was a life that had been shrouded in secrecy, with many questions not to be asked and fewer answers offered if they were. As the author uncovered, clue by clue, the deliberately obscured story of his grandfather’s mysterious life and of his flight first to Vienna and then to Paris, and of his mother’s journey as a child surviving Nazi occupation, Sands searched further into the history of the city of Lemberg and realized that his own field of humanitarian law had been forged by two men—Rafael Lemkin and Hersch Lauterpacht—each of whom had studied law at Lviv University in the city of his grandfather’s birth, each of whom had come to be considered the finest international legal mind of the twentieth century, each considered to be the father of the modern human rights movement, and each, at parallel times, forging diametrically opposite, revolutionary concepts of humanitarian law that had changed the world. In this extraordinary and resonant book, Sands looks at who these two very private men were, and at how and why, coming from similar Jewish backgrounds and the same city, studying at the same university, each developed the theory he did, showing how each man dedicated this period of his life to having his legal concept—“genocide” and “crimes against humanity”—as a centerpiece for the prosecution of Nazi war criminals. And the author writes of a third man, Hans Frank, Hitler’s personal lawyer, a Nazi from the earliest days who had destroyed so many lives, friend of Richard Strauss, collector of paintings by Leonardo da Vinci. Frank oversaw the ghetto in Lemberg in Poland in August 1942, in which the entire large Jewish population of the area had been confined on penalty of death. Frank, who was instrumental in the construction of concentration camps nearby and, weeks after becoming governor general of Nazi-occupied Poland, ordered the transfer of 133,000 men, women, and children to the death camps. Sands brilliantly writes of how all three men came together, in October 1945 in Nuremberg—Rafael Lemkin; Hersch Lauterpacht; and in the dock at the Palace of Justice, with the twenty other defendants of the Nazi high command, prisoner number 7, Hans Frank, who had overseen the extermination of more than a million Jews of Galicia and Lemberg, among them, the families of the author’s grandfather as well as those of Lemkin and Lauterpacht. A book that changes the way we look at the world, at our understanding of history and how civilization has tried to cope with mass murder. Powerful; moving; tender; a revelation.",
  "genres": [
    "History",
    "Nonfiction",
    "Politics",
    "Biography",
    "Law",
    "Holocaust",
    "War"
  ],
  "author": "Philippe Sands",
  "average_rating": "4.46",
  "url": "https://www.goodreads.com/book/show/27068666-east-west-street"
}