{
  "title": "Unequal Democracy: The Political Economy of the New Gilded Age",
  "description": "Using a vast swath of data spanning the past six decades, Unequal Democracy debunks many myths about politics in contemporary America, using the widening gap between the rich and the poor to shed disturbing light on the workings of American democracy. Larry Bartels shows the gap between the rich and poor has increased greatly under Republican administrations and decreased slightly under Democrats, leaving America grossly unequal. This is not simply the result of economic forces, but the product of broad-reaching policy choices in a political system dominated by partisan ideologies and the interests of the wealthy. Bartels demonstrates that elected officials respond to the views of affluent constituents but ignore the views of poor people. He shows that Republican presidents in particular have consistently produced much less income growth for middle-class and working-poor families than for affluent families, greatly increasing inequality. He provides revealing case studies of key policy shifts contributing to inequality, including the massive Bush tax cuts of 2001 and 2003 and the erosion of the minimum wage. Finally, he challenges conventional explanations for why many voters seem to vote against their own economic interests, contending that working-class voters have not been lured into the Republican camp by \"values issues\" like abortion and gay marriage, as commonly believed, but that Republican presidents have been remarkably successful in timing income growth to cater to short-sighted voters. Unequal Democracy is social science at its very best. It provides a deep and searching analysis of the political causes and consequences of America's growing income gap, and a sobering assessment of the capacity of the American political system to live up to its democratic ideals.",
  "genres": [
    "Politics",
    "Nonfiction",
    "Economics",
    "Political Science",
    "History",
    "Sociology",
    "Business"
  ],
  "author": "Larry M. Bartels",
  "average_rating": "3.91",
  "url": "https://www.goodreads.com/book/show/2705879-unequal-democracy"
}