{
  "title": "Seductive Affair",
  "description": "Jacob can't forget Vivienne.And must persuade Vivienne to be his submissive.Vivienne knows that Jacob Rinaldi is the only man for her, even if she is mad at him. On a trip to Paris, an unexpected event fuels her passion, once again. And she must make a decision. Separation is torture, and Jacob hopes a romantic interlude at his luxury villa will convince her to agree to his terms.“The thrill of the playroom had its effect, and Vivienne wanted more of the same. Yet she was emotionally conflicted. Jacob was out of her league in more than one way. Not only was he wealthy, which would take some getting used to, but he was sexually experienced. It wasn’t just that he had been with plenty of women. Vivienne didn’t want to think about that. It was his lifestyle that concerned her, which was the only thing to call it.Jacob preferred taking her to a sort of sexual dungeon over making love in his bed. There was no denying that Vivienne wanted the same, which made the whole experience a bit electrifying. She didn’t know what it all meant, and what exactly Jacob wanted. Since he didn’t have steady relationships, and preferred a life devoid of dating, where did that leave her?”Will Vivienne turn away from Jacob? Or will she give in to powerful desire?˃˃˃ Series Affair is the second book in the Bend To My Will series, a Rinaldi Romance that unfolds over a series of novellas. Jacob Rinaldi made his fortune in wine importing, and he travels the world. He is a billionaire with his choice of women, but is obsessed with having Vivienne Lake. This is a steamy romance with bdsm elements. Throughout this hot love story, Jacob faces the darkness that threatens to engulf him. And Vivienne learns the joy of submission, while teaching Jacob that love isn’t out of reach. wealthy billionaire hero, steamy alpha male romance mystery",
  "genres": [
    "BDSM",
    "Erotica",
    "Contemporary Romance",
    "Romance"
  ],
  "author": "Emily Jane Trent",
  "average_rating": "4.35",
  "url": "https://www.goodreads.com/book/show/27068103-seductive-affair"
}