{
  "title": "It's Dangerous to Believe: Religious Freedom and Its Enemies",
  "description": "Mary Eberstadt, “one of the most acute and creative social observers of our time,” (Francis Fukuyama) shines a much-needed spotlight on a disturbing trend in American society: discrimination against traditional religious belief and believers, who are being aggressively pushed out of public life by the concerted efforts of militant secularists.In It’s Dangerous to Believe, Mary Eberstadt documents how people of faith—especially Christians who adhere to traditional religious beliefs—face widespread discrimination in today’s increasingly secular society. Eberstadt details how recent laws, court decisions, and intimidation on campuses and elsewhere threaten believers who fear losing their jobs, their communities, and their basic freedoms solely because of their convictions. They fear that their religious universities and colleges will capitulate to aggressive secularist demands. They fear that they and their families will be ostracized or will have to lose their religion because of mounting social and financial penalties for believing. They fear they won’t be able to maintain charitable operations that help the sick and feed the hungry.Is this what we want for our country?Religious freedom is a fundamental right, enshrined in the First Amendment. With It’s Dangerous to Believe Eberstadt calls attention to this growing bigotry and seeks to open the minds of secular liberals whose otherwise good intentions are transforming them into modern inquisitors. Not until these progressives live up to their own standards of tolerance and diversity, she reminds us, can we build the inclusive society America was meant to be.",
  "genres": [
    "Religion",
    "Politics",
    "Cultural",
    "Nonfiction",
    "Christianity",
    "Catholic",
    "Philosophy"
  ],
  "author": "Mary Eberstadt",
  "average_rating": "3.92",
  "url": "https://www.goodreads.com/book/show/27067865-it-s-dangerous-to-believe"
}