{
  "title": "Die Dog or Eat the Hatchet",
  "description": "From Adam Howe, winner of Stephen King's On Writing contest, come three original novellas of hardboiled crime, graphic horror and pitch-black gallows humor.'Damn Dirty Apes': Washed-up prizefighter Reggie Levine is eking a living as a strip club bouncer when he's offered an unlikely shot at redemption. The Bigelow Skunk Ape - a mythical creature said to haunt the local woods - has kidnapped the high school football mascot, Boogaloo Baboon. Now it's up to Reggie to lead a misfit posse including a plucky stripper, the town drunk, and legend-in-his-own-mind skunk ape hunter Jameson T. Salisbury. Their mission: Slay the beast and rescue their friend. But not everything is as it seems, and as our heroes venture deeper into the heart of darkness, they will discover worse things waiting in the woods than just the Bigelow Skunk Ape. The story the Society for the Preservation of the North American Skunk Ape tried to ban; Damn Dirty Apes mixes Roadhouse with Jaws with Sons of Anarchy, to create a rollicking romp of 80s-style action/adventure, creature horror and pitch-black comedy.'Die Dog or Eat the Hatchet': Escaped mental patient Terrence Hingle, the butcher of five sorority sisters at the Kappa Pi Massacre, kidnaps timid diner waitress Tilly Mulvehill and bolts for the border. Forcing his hostage to drive him out of town, it's just a question of time before Tilly becomes the next victim in Hingle's latest killing spree. But when they stop for gas at a rural filling station operated by deranged twin brothers, Dwayne and Dwight Ritter, the tables are turned on Hingle, and for Tilly the night becomes a hellish cat-and-mouse ordeal of terror and depravity. The meat in a maniac sandwich, Tilly is forced against her nature to make a stand and fight for survival. Because sometimes the only choice you have is to do or die...to Die Dog Or Eat The Hatchet.'Gator Bait': Prohibition-era 1930s... After an affair with the wrong man's wife, seedy piano player Smitty Three Fingers flees the city and finds himself tinkling the ivories at a Louisiana honky-tonk owned by vicious bootlegger Horace Croker and his trophy wife, Grace. Folks come to The Grinnin' Gator for the liquor and burlesque girls, but they keep coming back for Big George, the giant alligator Croker keeps in the pond out back. Croker is rumored to have fed ex-wives and enemies to his pet, so when Smitty and Grace embark on a torrid affair...what could possibly go wrong? Inspired by true events, Gator Bait mixes hardboiled crime (James M. Cain's The Postman Always Rings Twice) with creature horror (Tobe Hooper's Eaten Alive) to create a riveting tale of suspense.",
  "genres": [
    "Horror",
    "Short Stories",
    "Fiction",
    "Thriller",
    "Crime",
    "Humor",
    "Novella"
  ],
  "author": "Adam Howe",
  "average_rating": "4.32",
  "url": "https://www.goodreads.com/book/show/27073484-die-dog-or-eat-the-hatchet"
}