{
  "title": "More Than it Hurts You",
  "description": "The acclaimed author of Chang and Eng returns with a literary showstopper— a beautifully realized novel that at its heart is the story of a woman who will risk everything to feel something; a doctor whose diagnosis brings her entire life into question; and a man who suddenly realizes that being a good husband and a good father can no longer comfortably coexist. Josh Goldin was savoring a Friday afternoon break in the coffee room, harmlessly flirting with coworkers while anticipating the weekend at home where his wife, Dori, waited with their eight-month-old son, Zack. And then Josh’s secretary rushed in, using words like intensive care, lost consciousness, blood. . . . That morning, Dori had walked into the emergency room with her son in severe distress. Enter Dr. Darlene Stokes: an African-American physician and single mother whose life is dedicated both to her own son and navigating the tricky maze of modern-day medicine. But something about Dori stirred the doctor’s suspicions. Darlene had heard of the sensational diagnosis of Munchausen by Proxy, where a mother intentionally harms her baby, but had never come upon a case of it before. It was rarely diagnosed and extraordinarily controversial. Could it possibly have happened here? As their four lives intersect with dramatic consequences, Darlene, Dori, and Josh are pushed to their breaking points as they confront the nightmare that has become their new reality. Darin Strauss’s extraordinary novel is set in a world turned upside down—where doctors try to save babies from their parents, police use the law to tear families apart, and the people you know the best end up surprising you the most.",
  "genres": [
    "Fiction",
    "Psychology",
    "Book Club",
    "Audiobook",
    "Medical",
    "Adult Fiction",
    "Literary Fiction"
  ],
  "author": "Darin Strauss",
  "average_rating": "2.92",
  "url": "https://www.goodreads.com/book/show/2707148-more-than-it-hurts-you"
}