{
  "title": "The Lonely Sea and the Sky",
  "description": "...Every night, almost without fail for nine weeks, I had the same nightmare between 3 and 4 o'clock. I was in the air flying, when my vision went completely and I waited in fearful darkness for the inevitable crash. Usually I woke to find myself clawing at a window or a wall trying to escape. In view of what happened later I wonder if this was a sort of 'Experiment with Time' experience, or just a coincidence.' Born in 1901, at the age of eighteen and with a taste for adventure, Francis Chichester emigrated to New Zealand with only ten pounds in his pocket. With the impetuousness of youth, he tried his hand at a myriad of jobs, some more successful than others, and by the age of twenty-six, had been a farmhand, a boxer, a shepherd, a lumberjack, a member of three trade Unions - the Firemen's, the miners' and the Timber Workers' - a railway worker, a gold prospector, a coal miner, a door-to-door salesman, and a land agent. And it was only then that his real adventures began. It would be from a chance business venture that Chichester would discover the passion for travel that would become his life. With a fellow risk-taker, he helped to establish an early aviation company and began to fly the planes - though not necessarily with an immediate talent. But enthusiasm and experience made him a leader of the field, and in 1929 he embarked on his most famous flight: a solo enterprise in the Gypsy Moth from England to Australia. He was only the second person ever to accomplish this feat. A great sailor as well as aviator, further journeys came hot on the heels of Chichester's achievements in the air - including winning a trans-Atlantic race in the yacht Gipsy Moth III - and in 1967 he was knighted. The Lonely Sea and the Sky is Sir Francis Chichester's acclaimed autobiography; a tale of ardour and adventure, of intrepid endeavours on land, on the sea and in the air, and of the physical and mental challenges he faced. The life and sheer temerity of his undertakings mark Sir Francis Chichester as a true old-fashioned adventurer.",
  "genres": [
    "Biography",
    "Nonfiction",
    "Travel",
    "Adventure"
  ],
  "author": "Francis Chichester",
  "average_rating": "3.96",
  "url": "https://www.goodreads.com/book/show/27080.The_Lonely_Sea_and_the_Sky"
}