{
  "title": "Standard Operating Procedure",
  "description": "An utterly original literary and intellectual collaboration by two of our keenest moral and political observers has produced a nonfiction Heart of Darkness for our time: the first full reckoning of what actually happened at Abu Ghraib prison, based on hundreds of hours of exclusive interviews with the Americans involved.The Ballad of Abu Ghraib reveals the stories of the American soldiers who took and appeared in the iconic photographs of the Iraq war-the haunting digital snapshots from Abu Ghraib prison that shocked the world-and simultaneously illuminates and alters forever our understanding of those images and the events they depict. Drawing on more than two hundred hours of Errol Morris's startlingly frank and intimate interviews with Americans who served at Abu Ghraib and with some of their Iraqi prisoners, as well as on his own research, Philip Gourevitch has written a relentlessly surprising account of Iraq's occupation from the inside out-rendering vivid portraits of guards and prisoners ensnared in an appalling breakdown of command authority and moral order.What did we think we saw in the infamous photographs, and what were we, in fact, looking at? What did the people in the photographs think they were doing, and why did they take them? What was \"standard operating procedure\" and what was \"being creative\" when it came to making prisoners uncomfortable? Who was giving orders, and who was following them? Where does the line lie between humiliation and torture, and why and how does that matter? Was the true Abu Ghraib \"scandal\" a result of an expose or a cover-up?In exploring these questions, Gourevitch and Morris have crafted a nonfiction morality play that stands to endure as essential reading long after the current war in Iraq passes from the headlines. By taking us deep into the voices and characters of the men and women who lived the horror of Abu Ghraib, the authors force us, whatever our politics, to reexamine the pat explanations in which we have been offered-or sought-refuge, and to see afresh this watershed episode. Instead of a \"few bad apples,\" we are confronted with disturbingly ordinary young American men and women who have been dropped into something out of Dante's Inferno.The Ballad of Abu Ghraib is a book that makes you think and makes you see-an essential contribution from two of our finest nonfiction artists working at the peak of their powers.",
  "genres": [
    "Nonfiction",
    "History",
    "War",
    "Politics",
    "Military Fiction",
    "True Crime",
    "American History"
  ],
  "author": "Philip Gourevitch",
  "average_rating": "3.90",
  "url": "https://www.goodreads.com/book/show/270949.Standard_Operating_Procedure"
}