{
  "title": "Gruppenführer's Mistress",
  "description": "\"Gruppenführer’s Mistress\" is book two in the series “The Girl from Berlin,” which continues to follow Annalise’s story. Caught up in a dangerous game between the Allies and Nazi Germany Secret Service – the RSHA – she’s torn between staying faithful to her husband and yielding to the demands of her American superiors and starting a romance with the unpredictable Chief of the RSHA Ernst Kaltenbrunner, who she finds herself attracted to more and more every day…Reviewed By Jack Magnus for Readers’ Favorite The Girl from Berlin: Gruppenführer's Mistress is the second book in Ellie Midwood's historical fiction series, The Girl from Berlin. Annalise realizes that she is playing a very dangerous game when she asks for Gruppenführer Dr. Kaltenbrunner's assistance in exacting revenge on her boss, Reinhard Heydrich, but she's mad with grief over his complicity in the suicide death of her brother Norbert and the resulting miscarriage of her and her husband's first child. While the leader of the Austrian SS has an evil reputation as a monster and a sadist, Dr. Kaltenbrunner has always been oddly gentle and attentive with her. And while he's initially taken aback at the audacity of her request, he agrees to start the process that will result in Heydrich's death.  Ellie Midwood's World War II historical fiction novel, The Girl from Berlin: Gruppenführer's Mistress, is an outstanding and enthralling tale recreating the lives of Annalise and her husband as they work for the American Secret Service in the guise of loyal Germans working in the Reich Main Security Office. The depth of the author's research and her expertise on the subject of Nazi Germany is evidenced on every page of this thrilling and suspenseful tale. I would urge new readers to begin with the first book in the series, Standartenführer's Wife, to get the full impact of this most impressive series. Gruppenführer's Mistress is impeccably researched and beautifully written, making the workaday world and intrigue surrounding Annalise and Heinrich's lives feel real, and the psychological thriller aspect of Annalise and Ernst Kaltenbrunner's growing attraction to each other is masterfully played out. While the title does let prospective readers know that there is definitely romance, some of which is steamy, in this novel, The Girl from Berlin: Gruppenführer's Mistress is historical literary fiction at its finest. It's most highly recommended.Other books in the series:Book one: \"The Girl from Berlin: Standartenfuhrer's Wife\"Book three: \"The Girl from Berlin: War Criminal's Widow\"",
  "genres": [
    "Historical Fiction",
    "Romance",
    "World War II",
    "Historical",
    "War"
  ],
  "author": "Ellie Midwood",
  "average_rating": "4.35",
  "url": "https://www.goodreads.com/book/show/27109583-gruppenf-hrer-s-mistress"
}