{
  "title": "Awakened",
  "description": "Dru:At 17 years old, I’ve traveled around the globe with my family, part of an organization with operatives secretly protecting the planet from extraterrestrials. Moving is just part of the job. But this time it's different. My shifting ability is out of control, putting everyone in danger. While I learn to handle this dangerous power, we’ve ended up in the middle of nowhere, U.S.A. and I hate it with a passion.Until I see her! A jolt of recognition runs through me when seeing her. I can't explain it. It’s like she has always been and will always be mine. The attraction is instant and primal. But getting close to her could put her in danger. Can I take that chance?Alayna: Nothing remarkable ever happens in Riverside. It’s a small town that isn't even on the map. You blink and you'll miss it. So, when I head off to the first day of school, the last thing I expect is for my life to be turned upside down. But then I see him! My knees go weak, my hair stands on end, and a faint buzzing begins in the back of my skull. It feels as though an invisible cord has hooked itself around my waist and is reeling me in. I’m caught off guard by the intense craving to be with him. It's like my body is a magnet, and he is the north pole. I can’t help but be pulled in.But as I’m drawn into Dru’s world, things get crazy! First, a chimera shows up in the woods. Seriously … a CHIMERA, like from Greek mythology. Then Dru uses superpowers to save my butt. He is apparently some kind of super-alien! That part doesn’t bother me exactly. What does have my stomach in knots is that I’ve been claimed! Whatever that means. Now, I’ve started manifesting superpowers of my own! I’m questioning my understanding of reality, not to mention sanity, but it’s too late to turn back now. Dru and I must evade the evil aliens called Drakkon and discover the truth about our connection. But the Drakkon kidnap Dru and force him to help with their evil plans. I’m not sure how strong I am, but I must stop the Drakkon at all costs--even if it means getting myself killed. Will I be able to save Dru? Or will he be lost forever to the clutches of the Drakkon?C.J. Anderson’s award-winning novel Awakened takes the reader on a journey with two teens who, after experiencing a supernatural connection with each other, plunge headfirst into an impossible world of superpowers, mythological creatures, and aliens.",
  "genres": [
    "Romance",
    "Young Adult",
    "Fantasy"
  ],
  "author": "C.J.   Anderson",
  "average_rating": "4.78",
  "url": "https://www.goodreads.com/book/show/27125568-awakened"
}