{
  "title": "Stealing Indians",
  "description": "\"A poignant story of colonization and assimilation, something I know a little bit about. A masterpiece.\"—Chinua Achebe\"One of our most brilliant writers tells a harsh truth about American history.\"—Roxanne Dunbar-Ortiz, An Indigenous Peoples' History of the United StatesPraise for Edge of Nowhere:\"Smelcer's prose is lyrical, straightforward, and brilliant . . . authentic Native Alaskan storytelling at its best.\"—School Library Journal (starred review)\"A spare tale of courage, love and terrible obstacles.\"—The Wall Street Journal\"More psychological depth than Robinson Crusoe.\"—Frank McCourtPraise for Lone Wolves:\"A beautiful and moving story of courage and love.\"—Ray Bradbury\"Smelcer [is] a rockstar of Alaskan literature.\"—Mushing magazine\"Powerful, eloquent, and fascinating.\"—Kirkus Reviews\"Smelcer's work has a touch of the classical, combining good old-fashioned adventure and survival themes with heart-tugging moments of clarity and poignancy that recall Jean Craighead George's Julie of the Wolves.\"—BooklistPraise for The Trap:\"A gripping and poignant story, made even more so because of its basis in historical fact.\"—Horn Book (starred review)Four Indian teenagers are kidnapped from different regions, their lives immutably changed by an institution designed to eradicate their identity. And no matter what their home, their stories are representative of every story, every stolen life. So far from home, without family to protect them, only their friendship helps them endure. This is a work of fiction. Every word is true.John Smelcer is the author of over forty books, including essays, story collections, poetry, and novels, and five YA novels.",
  "genres": [
    "Historical Fiction",
    "Young Adult",
    "Historical",
    "Fiction",
    "Native American",
    "Realistic Fiction"
  ],
  "author": "John E. Smelcer",
  "average_rating": "3.69",
  "url": "https://www.goodreads.com/book/show/27135069-stealing-indians"
}