{
  "title": "The Great Unraveling: Losing Our Way in the New Century",
  "description": "\"Paul Krugman is a hero of mine. Read his book.\"―Al Franken No one has more authority to call the shots the way they really are than award-winning economist Paul Krugman, whose provocative New York Times columns are keenly followed by millions. One of the world's most respected economists, Krugman has been named America's most important columnist by the Washington Monthly and columnist of the year by Editor and Publisher magazine.A major bestseller, this influential and wide-ranging book has been praised by BusinessWeek as Krugman's \"most provocative and compelling effort yet,\" the New York Review of Books as \"refreshing,\" and Library Journal as \"thought-provoking...even funny.\" The American Prospect put it in vivid terms: \"In a time when too few tell it like it is...[Krugman] has taken on the battle of our time.\"Built from Paul Krugman's influential Op-Ed columns for the New York Times , this book galvanized the reading public. With wit, passion, and a unique ability to explain complex issues in plain English, Krugman describes how the nation has been misled by a dishonest administration.In this long-awaited work containing Krugman's most influential columns along with new commentary, he chronicles how the boom economy unraveled: how exuberance gave way to pessimism, how the age of corporate heroes gave way to corporate scandals, how fiscal responsibility collapsed. From his account of the secret history of the California energy crisis to his devastating dissections of dishonesty in the Bush administration, from the war in Iraq to the looting of California to the false pretenses used to sell an economic policy that benefits only a small elite, Krugman tells the uncomfortable truth like no one else. And he gives us the road map we will need to follow if we are to get the country back on track.The paperback edition features a new introduction as well as new writings.",
  "genres": [
    "Economics",
    "Politics",
    "Nonfiction",
    "History",
    "Finance",
    "Business",
    "Essays"
  ],
  "author": "Paul Krugman",
  "average_rating": "3.91",
  "url": "https://www.goodreads.com/book/show/27143.The_Great_Unraveling"
}