{
  "title": "What's in the Way Is the Way: A Practical Guide for Waking Up to Life",
  "description": "Imagine for a moment that you had no pressures in your life―no problems to fix, no deadlines to meet, no struggles to overcome. Do you feel that sense of spacious relief? It’s not an illusion, teaches Mary O’Malley. It really is possible to live with that profound openness all the time, even while tending to your everyday tasks and obligations. In What’s in the Way Is the Way , Mary offers practical guidance for meeting all of your experience with an abiding sense of ease, trust, and peace of mind.This accessible book is divided into ten phases, featuring inspiring wisdom and step-by-step exercises to heal the core beliefs that keep you stuck. With each chapter, Mary invites you to come into the present and see yourself and your circumstances in a different way―unclouded by preconceptions, struggle, or fear. Join her on this illuminating journey to • How fear controls our lives―untangling the conditioning that keeps us from trusting our complete experience• The healing power of curiosity―a natural way to meet our lives without needing to change or judge anything• Trusting what happens even when we feel threatened, ashamed, or afraid• Why we become more active, engaged, and effective when we stop \"doing\" life and start being fully present for our lives• Remembering exercises―simple, powerful practices for reconnecting with our natural state of curiosity, trust and love\"No object, person, or experience will ever bring you the deep and lasting peace that comes from simply being open to life,\" writes Mary. With What’s in the Way Is the Way, this renowned teacher brings you a powerful guide for turning your obstacles into your greatest allies and teachers―and showing up for your life with all your vulnerability, passion, and magnificent perfection.",
  "genres": [
    "Self Help",
    "Nonfiction",
    "Spirituality",
    "Mental Health",
    "Personal Development"
  ],
  "author": "Mary   O'Malley",
  "average_rating": "4.41",
  "url": "https://www.goodreads.com/book/show/27131783-what-s-in-the-way-is-the-way"
}