{
  "title": "Brussels Noir",
  "description": "\"Brussels, Belgium's cosmopolitan, multilingual capital, has it criminal underside, as shown in the 13 dark--and sometimes darkly humorous--stories in this strong Akashic noir volume.\"-- Publishers Weekly\"A perfect choice for those who love noir or those who love armchair traveling, this assortment of short stories gives the reader a glimpse into what life in the Belgian capital is like. An excellent entry in Akashic Books' noir series, which began with Brooklyn Noir more than a decade ago, Brussels Noir takes readers through the underbelly of yet another fascinating locale.\"-- Self Awareness for Readers\"Akashic Books deserves kudos for their fine service to noir . . . If these volumes are designed to give crime writers a nifty forum and also capture the local flair and flavor, Brussels Noir is a fine come-hither.\"-- New York Journal of BooksAkashic Books continues its groundbreaking series of original noir anthologies, launched in 2004 with Brooklyn Noir . Each story is set in a distinct neighborhood or location within the city of the book.Brand-new stories Barbara Abel, Ayerdhal, Paul Colize, Jean-Luc Cornette, Patrick Delperdange, Sara Doke, Kenan Görgu¨n, Edgar Kosma, Katia Lanero Zamora, Nadine Monfils, Alfredo Noriega, Bob Van Laerhoven, and Émilie de Béco.From the introduction by Michel Dufranne :\"For our grand tour, please be seated, ladies and gentlemen readers, in Tram 33...and no, there's no rain in the forecast today, just a leaden sky; for that matter, considering the timetables of the STIB, it's probably better to go on foot than to take public transport. We'll explore the city center, that pentagonal surface defined by urban highways and a canal, home to the real old Brussels, the historic core. We'll take a dainty stroll through an edifice that achieves the feat of being more vast and monolithic in style than St. Peter's the Palais de Justice. From there, it's easy to glide down to the Marolles; then let your feet carry you from kabberdouch to stamcafé, as you wander in an ethereal, even surrealist mode through the heart of the city, and finally come full circle.Having whetted our appetites, we'll play leapfrog along the boulevards to make our way to the inner ring road and tiptoe across the razor's edge of the city...And if the life of the abattoir hasn't sated you, you'll have plenty of room to maneuver as you stray from the center and discover the oh-so-serene neighborhoods of the greater ring, home to our venerable European institutions above all suspicion.\"",
  "genres": [
    "Short Stories",
    "Fiction",
    "Mystery",
    "Crime",
    "Anthologies"
  ],
  "author": "Michel Dufranne",
  "average_rating": "3.35",
  "url": "https://www.goodreads.com/book/show/27131489-brussels-noir"
}