{
  "title": "Deadly Peril",
  "description": "Winter 1763. Alec, Lord Halsey is sent on a diplomatic mission to Midanich, imperial outpost of the Holy Roman Empire, to bargain for the freedom of imprisoned friends. Midanich is a place of great danger and dark secrets; a country at civil war; ruled by a family with madness in its veins. For Alec it is a place of unspeakable memories from which he barely escaped and vowed never to return. But return he must, if he is to save the lives of Emily St. Neots and Sir Cosmo Mahon. In a race against time, Alec and the English delegation journey across the icy wasteland for the castle fortress where Emily and Cosmo are imprisoned. The severe winter weather is as much an enemy as the soldiers of the opposing armies encamped along the way. And as members of Alec’s party begin to disappear into the night, he begins to suspect it is not the freezing conditions but that a murderer lurks amongst them. Awaiting him at his destination is the Margrave and his sister, demanding nothing less than Alec’s head on a pike.The Alec Halsey mysteries explore the darker side of Lucinda Brant’s deliciously romantic 18th century world. Along with her trademark wit and high drama there are deeper subplots and even quirkier characters that will have you shuddering and laughing in equal measure! Book Details  Book 3 in the Alec Halsey Mystery series Parental Guidance Recommended (mild sensuality, mild violence) Full-length novel (~100,000 words, about 400 std. print pages) First edition, 2015 Character-driven amateur sleuth Connecting Books Many readers enjoy Lucinda Brant's books as part of a wider series since her characters inhabit the same meticulously-researched 18th Century world with people and events cross-referenced throughout. You can explore the details and delve deeper into the history within each book by visiting LucindaBrantAuthor on Pinterest. Should you wish to read each series in chronological order, here is the Alec Halsey Mystery SeriesSpring 1763 DEADLY ENGAGEMENT (Country house murder and mayhem)Autumn 1763 DEADLY AFFAIR (A poisoned vicar and the mysterious Miranda)Winter 1763 DEADLY PERIL (Bloody intrigue abroad)Summer 1764 DEADLY KIN (Evil lurks in Edinburgh) In progressSalt Hendon Series1763 SALT BRIDE (Magnus and Jane)1767 SALT REDUX (Antony and Caroline)1767 A FAIRY CHRISTMAS (Kitty and Tom); a short story in SILVER BELLS COLLECTION, a Timeless Romance anthologyRoxton Family Saga1740s NOBLE SATYR (Renard and Antonia)1760s MIDNIGHT MARRIAGE (Julian and Deb)1770s AUTUMN DUCHESS (Antonia and Jonathon)1770s DAIR DEVIL (Dair and Rory)1770s PROUD MARY (Mary and Christopher)1780s SATYR’S SON (Henri-Antoine and Lisa) Reviews Lucinda Brant is the queen of Georgian Historical Mystery just as Georgette Heyer was the queen of Regency Romance.— Anne Boling, Readers’ Favorite",
  "genres": [
    "Mystery",
    "Historical Romance",
    "Historical Mystery",
    "Historical",
    "Historical Fiction",
    "Georgian",
    "Audiobook"
  ],
  "author": "Lucinda Brant",
  "average_rating": "4.32",
  "url": "https://www.goodreads.com/book/show/27150867-deadly-peril"
}