{
  "title": "Alabanza: New and Selected Poems 1982-2002",
  "description": "Alabanza is a twenty-year collection charting the emergence of Martín Espada as the preeminent Latino lyric voice of his generation. \"Alabanza\" means \"praise\" in Spanish, and Espada praises the people Whitman called \"them the others are down upon\": the African slaves who brought their music to Puerto Rico; a prison inmate provoking brawls so he could write poetry in solitary confinement; a janitor and his solitary strike; Espada's own father, who was jailed in Mississippi for refusing to go to the back of the bus. The poet bears witness to death and rebirth at the ruins of a famine village in Ireland, a town plaza in México welcoming a march of Zapatista rebels, and the courtroom where he worked as a tenant lawyer. The title poem pays homage to the immigrant food-service workers who lost their lives in the attack on the World Trade Center. From the earliest out-of-print work to the seventeen new poems included here, Espada celebrates the American political imagination and the resilience of human dignity. Alabanza is the epic vision of a writer who, in the words of Russell Banks, \"is one of the handful of American poets who are forging a new American language, one that tells the unwritten history of the continent, speaks truth to power, and sings songs of selves we can no longer silence.\" An American Library Association Notable Book of 2003 and a 2003 New York Public Library Book to Remember.\"To read this work is to be struck breathless, and surely, to come away changed.\"—Barbara Kingsolver \"Martín Espada is the Pablo Neruda of North American authors. If it was up to me, I'd select him as the Poet Laureate of the United States.\"—Sandra Cisneros \"With these new and selected poems, you can grasp how powerful a poet Espada is—his range, his compassion, his astonishing images, his sense of history, his knowledge of the lives on the underbelly of cities, his bright anger, his tenderness, his humor. \"—Marge Piercy \"Espada's poems are not just clarion calls to the heart and conscience, but also wonderfully crafted gems.\"—Julia Alvarez \"A passionate, readable poetry that makes [Espada] arguably the most important 'minority' U.S. poet since Langston Hughes.\"—Booklist\"Neruda is dead, but if Alabanza is any clue, his ghost lives through a poet named Martín Espada.\"—San Francisco Chronicle",
  "genres": [
    "Poetry",
    "Anthologies",
    "Spanish Literature",
    "Nonfiction"
  ],
  "author": "Martín Espada",
  "average_rating": "4.45",
  "url": "https://www.goodreads.com/book/show/271456.Alabanza"
}