{
  "title": "Native Believer",
  "description": "Shortlisted for the 2018 Saroyan Prize, presented by Stanford Libraries \" Native Believer stands as an important contribution to American literary a book quite unlike any I've read in recent memory, which uses its characters to explore questions vital to our continuing national discourse around Islam.\"-- New York Times Book Review , Editors' Choice \"M.'s life spins out of control after his boss discovers a Qur'an in M.'s house during a party, in this wickedly funny Philadelphia picaresque about a secular Muslim's identity crisis in a country waging a never-ending war on terror.\"-- O, the Oprah Magazine \" Native Believer is a page-turning contemporary fiction that addresses burning issues about the very essence of identity, and without question Ali Eteraz is a writer's writer, one whose ear for the English language is just as acute as fellow naturalized Americans Vladimir Nabokov (born in Russia) or Viet Thanh Nguyen (Vietnam).\"-- Los Angeles Review of Books \"[A] poignant and profoundly funny first novel....Eteraz combines masterful storytelling with intelligent commentary to create a nuanced work of social and political art.\"-- Booklist \"Eteraz's narrative is witty and unpredictable...and the darkly comic ending is pleasingly macabre. As for M., in this identity-obsessed dandy, Eteraz has created a perfect protagonist for the times. A provocative and very funny exploration of Muslim identity in America today.\"-- Kirkus Reviews \"In bitingly funny prose, first novelist Eteraz sums up the pain and contradictions of an American not wanting to be categorized; the ending is a bang-up surprise.\"-- Library Journal \"Who wants to be Muslim in post-9/11 America? Many of the characters in Ali Eteraz's new novel Native Believer have no choice in the matter; they deal in a variety of ways with issues of belonging and identity in a society bent on categorizing, stereotyping, and targeting Muslims.\"-- KPFA Pacifica \"Ali Eteraz is a pen name that means 'Noble Protest.' In his darkly funny debut novel, the protest may not be entirely noble, but it is essential--the story follows M., a Philadelphia man who is Muslim by birth but not by belief. When he gets fired for owning a copy of the Quran, his life spirals out of control as he tries to find some semblance of a place in the world.\"-- Literary Hub \"A sad, funny, and haunting novel that debates what America is. The novel captures post-9/11 U.S. in a brilliant satire . . . With the groundwork laid for an ending that will surprise readers, Native Believer offers no pat answers about being Muslim in America, but it does pose a lot of good questions.\"-- Rain Taxi Review of Books Ali Eteraz's much-anticipated debut novel is the story of M., a supportive husband, adventureless dandy, lapsed believer, and second-generation immigrant who wants nothing more than to host parties and bring children into the world as full-fledged Americans. As M.'s life gradually fragments around him--a wife with a chronic illness; a best friend stricken with grief; a boss jeopardizing a respectable career--M. spins out into the pulsating underbelly of Philadelphia, where he encounters others grappling with fallout from the War on Terror. Among the pornographers and converts to Islam, punks and wrestlers, M. confronts his existential degradation and the life of a second-class citizen. Darkly comic, provocative, and insightful, Native Believer is a startling vision of the contemporary American experience and the human capacity to shape identity and belonging at all costs.",
  "genres": [
    "Fiction",
    "Contemporary",
    "Cultural",
    "Islam",
    "Muslims",
    "Adult Fiction",
    "Literary Fiction"
  ],
  "author": "Ali Eteraz",
  "average_rating": "3.34",
  "url": "https://www.goodreads.com/book/show/27131490-native-believer"
}