{
  "title": "My Android Alpha / Alpha Stud on Cam",
  "description": "Two erotic shorts for the price of one!  My Android Alpha: Jacob never wanted an android, but when one ends up in his apartment thanks to his friend Sharon, an award winning android engineer, he decides to try it out anyway. At least the machine will look and act like his ideal man, right?  Jacob downloads an unauthorized program to fit the android with an alpha knot, sets his dominance and kink levels to their highest setting, and nervously turns it on...  Alpha Stud On Cam Jared is an alpha and a pornstar. He loves showing off his magnificent body, flexing, posing and doing *other things* for his audience. When the opportunity to get his own omega - despite the fact that he's a Class A alpha - presents itself, he pounces.  Scott has had his chance at a nice Class B or Class C alpha and blown it. He's too difficult to control, and as such will be handed off to one of the beasts. A Class A alpha. This is not what he'd planned...  (These short stories were originally published under the pen-name of Riley Trent)  ---  “Scott. We've matched you with another alpha.”  Sharon, his caseworker, didn’t look happy. Usually she would be bubbling at this point, singing the praises of whatever new asshole he was being paired with. As if it mattered. In a few weeks they’d be right back here, his new alpha returning him and demanding a suitable replacement. Like it was his fault he didn’t want some meathead knotting his virgin ass.  Knotting - contrary to the propaganda spread by the alpha elite - hurt like a bitch. Scott might not have first hand experience to back that assertion up, but he’d talked to enough mated omegas to know that it wasn’t a fun experience. That being filled and claimed was excruciating.  “OK? Tell me about him. Does he rescue puppies? Does he save cats from tall trees in his free time?” he asked sarcastically, giving his attempts to get out of the cuffs one more go. Sharon looked down, a frown pulling the corner of her mouth down.  “No. His name is Jared Wood, he’s thirty years old, and he’s not at all suitable. I have no idea how his application was accepted… but it was and now you’re facing the consequences of your stupidity.”  “What?” Scott was confused.  “They’re not going to waste any more time with you, Scott. Jared is a Class A alpha. He’s your last stop.”",
  "genres": [
    "M M Romance",
    "BDSM",
    "Omegaverse",
    "Fantasy",
    "Short Stories",
    "Science Fiction",
    "Erotica"
  ],
  "author": "D.J. Heart",
  "average_rating": "3.92",
  "url": "https://www.goodreads.com/book/show/27153277-my-android-alpha-alpha-stud-on-cam"
}