{
  "title": "The Spirit King - A Destiny Awakens",
  "description": "The Spirit King weaves Dreams into Destiny and Destiny into Heroes! – Adventurous, psychological, spiritual and poignant, this book will take you on a provocative and magical journey of the mind, body, and spirit. How much of our reality is only fantasy, and how much fantasy can become reality?  The Spirit King – A Destiny Awakens, is a coming of age story about destiny, compassion, magic and dreams! Like Luke Skywalker in Star Wars, Eragon, Frodo Baggins in Lord of the Rings, or Jake Sully in Avatar, Thane Winstrom is led on a journey of discovery, both in “real life,” as well as in his “dream world,” weaving dreams and reality back and forth, influencing each other along the way.  • “Thane had a curious feeling about this particular summer. He felt something was going to happen that would alter his life … and he was right!”   The story begins in Los Angeles in the nineteen eighties. Our hero’s life is changed after a near death experience, when he glimpses a touch of the “other side,” coming to learn that there is more to life than we know both on Earth and after death.  • Spiritual, compassionate, loving and profound –   Thane’s near death experience allows him to dream every night. Both in real life, as well as in his dreams, Thane begins connecting to nature, sensing energy coming from the Earth. This energy is personified in his reoccurring dreams when he becomes an Arthurian heroic character named Sarghon, destined to save his world from a dark and powerful tyrant King. Surrounded by a sentient forest, mythical beasts, and new friends, Sarghon (Thane’s dream alter-ego) sets off on a fantastical adventure. As Thane evolves and grows in the “real world,” so does his dream character, as their worlds weave back and forth, influencing each other in dramatic and unexpected ways.  • Destiny, Adventure, lured by the power of the Earth –   The story weaves philosophical ideology with science fact in an adventure story of epic proportions. As our unlikely hero sets off on a journey of discovery in both worlds, mythology and reality intertwine with environmental and sociopolitical significance. Something is triggered in both Thane and his alter ego Sarghon, giving them a profound connection to nature. As Thane begins to discover compassion and empathy for the Earth, Sarghon tries to save his world from a Dark Lord who wants to use Sarghon’s elemental powers of earth, air, fire and water for his own manipulative purpose.  • Bravery, adventure and destiny are strong themes of this story –  …as well as environmentalism, fantasy and spirituality. In the dream world, this means accepting fate, facing myriad challenges of sword and sorcery, mythical creatures and new love. Ambroas, (Sarghon’s teacher and Lord of the Rings style Gandolf character) tells him:  “You were chosen because you have bravery within you, my boy. Some are born with it, some learn it over time, and some have none at all. But bravery indeed, is in your blood. It’s a presence of strength within you that you don’t know you already have.”  • Thane believes humanity may be entering the next phase of evolution.  “We are evolving!” Like “The Force,” in Star Wars, or the mutant powers portrayed in the world of X-Men, Thane believes he is beginning to see the first signs of our next step in human evolution. In the detailed writing of Game of Thrones, George R. R. Martin also creates an Arthurian world of magic and Dragons.",
  "genres": [],
  "author": "Paul Bradley Sterman",
  "average_rating": "3.67",
  "url": "https://www.goodreads.com/book/show/27157534-the-spirit-king---a-destiny-awakens"
}