{
  "title": "Falling in Fiji",
  "description": "A woman betrayed... Corinne Anderson designs the most stunning engagement rings on the west coast. A jewelry designer for the jet set and engaged to marry the man of her dreams, Corinne thinks she has it all—until her engagement explodes in spectacular fashion. Devastated, Corinne dares a sexy stranger to help turn her honeymoon from broken to breathtaking.  A frazzled financier... Everett Harden, a sought-after financial whiz kid, is overworked and stressed to the max. Minutes away from closing a lucrative deal, he’s approached by a tiny spitfire who slaps down two airline tickets and a challenge: join her on a beach getaway where the sand is hot and the adventures hotter. Intrigued and desperate for an escape, Everett accepts.  Adventures unknown... Fiji began as a fancy-free trip, but with the high-tech Adventure App running the show, Corinne and Everett find more than paradise. But can their romance survive the pressures of the real world, where reality bites, adventure is hard to come by, and—there is no App for love...  Okay folks…this book is for readers 18+. I write open door sex scenes. Wide open! Like, you’ll be right under the covers, in the chair, pinned against the wall, etc. with my heroines. You get the point. This is not an opportunity for a bonding moment between mother and daughter. Well, unless you roll like that. Personally, I don’t. My mother will read this, but we will forever pretend there is no sex in it. She’s a virgin, I’m a virgin. We will dwell in blissful ignorance. But I digress. If open door sex scenes aren’t your jam…don’t buy this book. Don’t be that person who buys the book despite this warning and then slays me in the ratings because you didn’t follow instructions. This work contains explicit language. Again, if this offends you, this is not the book for you. I don’t drop f-bombs every sentence, but you will find some colorful exclamations. Now, if you’re like me, and like sexy geeks, travel adventures, humor, and hot romance…this is the story for you. Enjoy!",
  "genres": [
    "Romance",
    "Contemporary Romance",
    "Contemporary"
  ],
  "author": "Casey Hagen",
  "average_rating": "4.28",
  "url": "https://www.goodreads.com/book/show/27160802-falling-in-fiji"
}