{
  "title": "Beyond Repair",
  "description": "Everybody loves Katie; with her bubbly personality, her beauty, her never-ending supply of care and support for her patients and friends, and her huge sense of fun, there’s very little to dislike. Yes, she’s a bit scatty, she tends not to sweat the small stuff (like an engine light on her dashboard – that is until her Mini won’t actually start any more), and she can talk the hind legs off a donkey, but none of that stops most people from thinking she’s pretty damn adorable. Well, most people, other than Sam, that is.  Sam is anything but bubbly. His surly demeanour is the complete opposite of Katie's, and over the six years that she’s known him one thing has become very clear: Sam cannot stand her. The fact that he makes her nervous doesn’t help the situation. Around Sam her verbal diarrhoea seems ten times worse, the snort that she tries to hold in when she laughs refuses to be suppressed, and her clumsiness assumes clown-like proportions.  If only he weren’t quite so intimidating, she might be able to act like a normal human being, but his sheer masculine beauty is enough to throw her off before she’s even spoken to him. Then there’s the fact that he looks at her like she’s something he’s scraped off his shoe. The combination is enough to short-circuit her brain.  Katie may be bubbly and bright but unfortunately her past is not, and it’s started leaking into her present. She hides her fear from her friends as they have problems of their own, but when Sam finds out the potential danger she’s in, for some reason he is furious.  Then again, there’s a reason Sam is the way he is. He has his own demons to contend with. Shutting himself off and burying his pain has been working well for him over the last six years since leaving the Special Forces, so the last thing he wants is to spend any time with the one woman that cuts through the numbness he surrounds himself with and actually makes him feel again. But he simply can’t stand by if Katie is in danger; he can’t allow her to be hurt. Unfortunately there are other ways to be hurt, and by getting closer to Katie, Sam may inflict more damage than her past ever could.  Because Sam is damaged, and some things are beyond repair.  This is a full-length contemporary romance / romantic comedy with its own HEA and no cliffhanger.  Warning – Beyond Repair differs from Susie’s other books in that there is some violence within the story. If this, combined with some swearing at times, is not for you, then it may not be your cup of tea.  Author Background  Susie Tate is a general practitioner now, but she has also spent years working in hospital medicine. This the first of her books to be set in general practice and she hopes that it will give readers a feel for what it’s like behind the scenes, as well as being a funny, at times heartbreaking story.",
  "genres": [
    "Romance",
    "Contemporary",
    "Contemporary Romance",
    "Enemies To Lovers",
    "Military Fiction",
    "Slow Burn",
    "Medical"
  ],
  "author": "Susie Tate",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/27153306-beyond-repair"
}