{
  "title": "The Bang-Bang Club: Snapshots from a Hidden War",
  "description": "Most people, upon hearing gunfire, would run away and hide. Conflict photojournalists have the opposite reaction: they actually look for trouble, and when they find it, get as close as possible and stand up to get the best shot. This thirst for the shot and the seeming nonchalance to the risks entailed earned Greg Marinovich, Joao Silva, Ken Oosterbroek, and Kevin Carter the moniker of the Bang-Bang Club. Oosterbroek was killed in township violence just days before South Africa's historic panracial elections. Carter, whose picture of a Sudanese child apparently being stalked by a vulture won him a Pulitzer Prize, killed himself shortly afterwards. Another of their posse, Gary Bernard, who had held Oosterbroek as he died, also committed suicide. The Bang-Bang Club is a memoir of a time of rivalry, comradeship, machismo, and exhilaration experienced by a band of young South African photographers as they documented their country's transition to democracy. We forget too easily the political and ethnic violence that wracked South Africa as apartheid died a slow, spasmodic death. Supporters of the ANC and Inkatha fought bloody battles every day. The white security forces were complicit in fomenting and enabling some of the worst violence. All the while, the Bang-Bang Club took pictures. And while they did, they were faced with the moral dilemma of how far they should go in pursuit of an image, and whether there was a point at which they should stop their shooting and try to intervene.  This is a riveting and appalling book. It is simply written--these guys are photographers, not writers--but extremely engaging. They were adrenaline junkies who partied hard and prized the shot above all else. None of them was a hero; these men come across as overweeningly ambitious, egotistical, reckless, and selfish, though also brave and even principled. As South Africans, they were all invested in their country's future, even though, as whites, they were strangers in their own land as they covered the Hostel wars in the black townships. The mixture of the romantic appeal of the war correspondent with honest assessments of their personal failings is part of what makes this account so compelling and so singular among books of its ilk. – J. Riches",
  "genres": [
    "Nonfiction",
    "History",
    "Africa",
    "Photography",
    "South Africa",
    "Biography",
    "Memoir"
  ],
  "author": "Greg Marinovich",
  "average_rating": "4.25",
  "url": "https://www.goodreads.com/book/show/271543.The_Bang_Bang_Club"
}