{
  "title": "Memorias del underground barcelonés",
  "description": "Los años míticos en los que los tebeos estaban hechos de sexo, drogas y rock’n’roll, mezclados a dosis generosas con sangre, sudor y lágrimas y hasta el mismísimo corazón de las tinieblas, en los que una generación irrepetible lo mismo se paseaba en tules y tacón por Ibiza que coordinaba unas jornadas libertarias, tienen un testigo de excepción en la figura de Onliyú.Texto de contracubierta:\"¡Ay, Señor, las cosas que hemos visto!... Y por cierto, ¿qué fue de aquella Montse, la tra-vesti, que hacía tele y se follaba en el wáter de la redacción del Víbora a los nuevos dibu-jantes que venían a enseñar sus páginas, diciéndoles que era la redactora jefe? ¿No tuvo un niño con el Mellan, el que vendía chocolate en el Kike? ¡Aquél que pillaron vendiendo en la primera feria del cómic y la Montse montó un escándalo gordísimo en el stand del Jueves!\" Nazario.Hubo una época en la que el cómic no era el territorio de gafapastas que eyaculan pretensiones autorales a través del Photoshop.Hubo unos años míticos en los que los tebeos estaban hechos de sexo, drogas y rock'n'roll, mezclados a grandes dosis con sangre, sudor y lágrimas, y hasta el mismísimo corazón de las tinieblas. Hubo un tiempo en el que revistas como E/ Rrollo, Purita o El Víbora tomaban al asalto las calles de Barcelona, armadas con los delirios de una generación irrepetible, que lo mismo se paseaba en tacón y vestidos de tul por Ibiza que coordinaba unas jornadas libertarias.Ese periodo de locura y frustración, que dio nombres propios como Nazario, Mariscal, Montesol o Ceesepe, tiene un narrador de excepción en Onliyú, quien presenta por primera vez una crónica nada sentimental de aquellos (no tan) maravillosos años.Onliyú, conocido entre los burócratas como José Miguel González Marcén, nació en Madrid en 1952. Tras licenciarse en Filología Hispánica en la Universidad Autónoma de Barcelona sin haber leído ni una línea de Lope de Vega (algo de lo que sigue jactándose hoy en día), entra en contacto con los que luego serían los más granados miembros del cómic underground barcelonés y otros personajes destacados no ya del panorama del cómic sino de la vida cultural más gamberra y moderna de la ciudad, Onliyú asistió el nacimiento de revistas míticas como El Rrollo Enmascarado, Purita o El Víbora, de la que fue redactor jefe durante los años ochenta. En esa época dirigió junto a Montesol \"El altillo del Cotolengo\" en RNE. También ha escrito una novela, Me parece que nos atacan, ha dirigido y escrito teatro y está preparando otra, Emporio celestial de conocimientos benévolos.\"",
  "genres": [
    "Memoir"
  ],
  "author": "Onliyú",
  "average_rating": "3.33",
  "url": "https://www.goodreads.com/book/show/27159093-memorias-del-underground-barcelon-s"
}