{
  "title": "The House at the Edge of Night",
  "description": "A sweeping saga about four generations of a family who live and love on an enchanting Mediterranean island off the coast of Italy—combining the romance of Beautiful Ruins with the magical tapestry works of Isabel Allende.Castellamare is an island far enough away from the mainland to be forgotten, but not far enough to escape from the world’s troubles. At the center of the island’s life is a café draped with bougainvillea called the House at the Edge of Night, where over generations the community gathers to gossip and talk. Amedeo Esposito, a foundling from Florence, finds his destiny on the island with his beautiful wife, Pina, whose fierce intelligence, grace, and unwavering love guide her every move. An indiscretion tests their marriage, and their children—three sons and an inquisitive daughter—grow up and struggle with both humanity’s cruelty and its capacity for love and mercy.Spanning nearly a century, through secrets and mysteries, trials and sacrifice, this beautiful and haunting novel follows the lives of the Esposito family and the other islanders who live and love on Castellamare: a cruel count and his bewitching wife, a priest who loves scandal, a prisoner of war turned poet, an outcast girl who becomes a pillar of strength, a wounded English soldier who emerges from the sea. The people of Castellamare are transformed by two world wars and a great recession, by the threat of fascism and their deep bonds of passion and friendship, and by bitter rivalries and the power of forgiveness, in this richly written and powerful novel.Catherine Banner has written an enthralling, character-rich novel, epic in scope but intimate in feeling. At times, the island itself seems alive, a mythical place where the earth heaves with stories—and this magical novel takes you there.",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Italy",
    "Book Club",
    "Family",
    "Historical",
    "Romance"
  ],
  "author": "Catherine Banner",
  "average_rating": "3.98",
  "url": "https://www.goodreads.com/book/show/27163154-the-house-at-the-edge-of-night"
}