{
  "title": "Galloping with Light - Einstein, Relativity, and Folklore",
  "description": "Tired of popular science books written by renowned physicists who think you cannot comprehend what they do, so... all you deserve is the illusion of understanding? If yes, this is the book for you. The fact that the reader may not have a scientific education does not mean that s/he does not have the intelligence to understand profound concepts -- as long as they are presented with semantic and epistemological clarity. After all, Einstein said that Science is simply the refinement of our intuition and everyday experiences. Galloping with Light is a symbolic cavalcade that starts with the discovery of fire 1.5 million years ago; it allegorically employs the imagination of an adolescent called Einstein to explain the Theory of Relativity in non-scientific terms, and ends with the Apollo 11 landing on the Moon in 1969 -- depositing on lunar soil a laser retro-reflector which would prove, once again, that Einstein was right. Motivated by his own difficulties to understand Relativity Theory, and convinced that it is possible to teach the layperson without distorting the subject matter, the author takes an approach utterly opposed to that of most popular science books. Knowing he has to demolish what the reader understands by time, distance, and motion, the author -using his experiences as a child, adolescent, and adult- dedicates the first half of the book to convince the reader that our intuition and common sense, as applied to those three everyday concepts, have a foundation as solid as that of a castle on the sand. The purpose of this book is to demystify and 'defolklorize' the reader; to destroy the aura of mystery and incomprehensibility surrounding Relativity Theory, unmasking and debunking the body of popular (and scientific) beliefs (mostly erroneous) which -taking advantage of the confusion between relativity and subjectivity, as well as of Einstein's popularity and prestige- have been used to validate preposterous assertions in fields like psychology, morality, spirituality, sociology, literature, art, etc.Editorial ReviewsA remarkable book. You have \"galloped with light\" very astutely and imaginatively! Besides being a thorough student of your subject, you are also a skilled pedagogue of it! -- Adolf Grünbaum, Author of Philosophical Problems of Space and Time and The Foundations of Psychoanalysis: A Philosophic Critique.I'm impressed at your pedagogical capability to explain advanced physics with words (almost) only. An absolutely fascinating reading, a cultural Odyssey through the roots of physics. -- Matts Roos, Author of \"Introduction to Cosmology\"A delightful treat for the inquisitive mind. -- Raj Rajamani, Professor, University of Utah, Salt Lake City, Utah, USA.By reading this book anyone can comprehend Einstein's concepts and implications and, at the end, one would like to start all over. -- Manuel Toharia Cortés, Scientific Director of 'Ciudad de las Artes y las Ciencias' (Spain)An introduction intellectually accessible and literarily enchanting to the Theory of Relativity. -- Jesús Zamora Bonilla, Professor of Philosophy of Science (UNED, Spain)If this reviewer was teaching a course in physics at the college level, Mr. Alba-Juez's book would be an absolute must on the course reading list. -- Donn Gurney (BookReview.com).An excellent pick that blends humor, common sense, and knowledge into one entertaining package, highly recommended. -- Michael J. Carson (Midwest Book Review).From the AuthorAt the beginning of 2008, I started my dream of finishing my life explaining the most profound concepts in Science to the big public, and decided to start doing so by writing this book about Einstein, Relativity, and Folklore. By Folklore, I mean the set of popular (and scientific) beliefs, mostly erroneous, associated with Relativity Theory and with our scientific activity in general. In this new project as a writer of Popular Science, my objective is to reach the mass reader, that non-scientific person with the curiosity of understanding the Universe in which we live, who has the habit of reading and thinking and the respect for her/his own capacity of logical analysis and comprehension, and who is conscious of the relevance Science carries in current society, and the essential role it plays as a modeler of our destiny as a biological species.Around my 14 years of age I avidly read a little book on Relativity Theory without understanding a thing. However, I was perplexed, because the three concepts about which the author elaborated upon over and over were precisely those which every 14-year kid had to be already intimately familiarized with, by the sheer fact of growing up: time, distance, and speed. What did I learn from that frustrating juvenile experience? That the author expected me to employ what every one of us (even adults) understands by time, distance, and speed to reach conclusions which only could be considered untrue and preposterous precisely because, had we considered them credible and sensible, we would have been compelled to throw away our millenary understanding of those three cherished concepts. What a peculiar approach, I said to myself: if the conclusion is going to destroy our deepest convictions, why not start analyzing those convictions, attempting to grasp the experiences, basic principles, and hypotheses that made us erroneously though vehemently believe in them for thousands of years?What the non-scientific reader needs (as well as the scientist) is a book giving more importance to the intuitive physical meaning of the words than to the unmeasured erudition an author can display with them. My objective thus is not to turn the reader into an expert in Relativity; on the contrary: that would require a much bigger effort than simply reading this book. My purpose is to show that the Theory of Relativity, experimentally confirmed in the last hundred years, regardless of how strange and opposed to our prejudices (disguised in the mask of 'common sense') may seem to be, is rational, consistent, and intelligible for the layperson -- if, and only if, s/he has the audacity of accepting the unfounded nature of those preconceptions. It is my desire and the honor of stimulating in the non-specialized person such a necessary intellectual boldness that have motivated me to write this book. These intellectual strength and courage have nothing to do with our academic or professional credentials; even more: had I believed they are strictly necessary to seize a concrete and positive message out of this book, I would have not gone through the trouble of writing it. I thus dream for the reader finishing this book with the sensation that it is possible to achieve an acceptable understanding of the Theory of Relativity based on the objective truth and free of folklore (popular as well as scientific). And... if, after some time, the reader feels the urge to read my book again so as to strengthen his/her understanding, my ephemeral stay in Plato's cave will have had the sense and transcendence that all of us seek for our existence.From the Back Cover\"...an introduction, intellectually accessible and literarily enchanting, to one of the principal components of the scaffold scientists have built for the current understanding of the Universe: the Theory of Relativity.\" Jesús Zamora Bonilla, Full Professor of Philosophy of Science at the UNED (Madrid, Spain)\"...By reading this book anyone can comprehend the immensity of Einstein's concepts and implications. And not only that: it is read with gusto and at the end one would like to start all over; in part just for the mere pleasure of it, but mostly because there is profound philosophical content throughout the book.\"Manuel Toharia Cortés, Scientific Director of the 'Ciudad de las Artes y las Ciencias' (Valencia, Spain)",
  "genres": [
    "Physics",
    "Science",
    "Nonfiction"
  ],
  "author": "Felix Alba-Juez",
  "average_rating": "3.92",
  "url": "https://www.goodreads.com/book/show/11730232-galloping-with-light---einstein-relativity-and-folklore"
}