{
  "title": "إمرأة صالحة",
  "description": "كثير من الواقعية والصراحة، وكشف للحقائق الاجتماعية التي تسيّر الأشخاص وتحدد توجهاتهم وخياراتهم في هذه الرواية للكاتبة الأميركية الذائعة الصيت، والتي لا تحتاج رواياتها للدعاية والترويج، خاصة في أميركا حيث لا تزال تحتل مركز \"الأكثر مبيعا\". قد تنقلب حياة الكائن البشري رأسا على عقب دون توقع منه ودون أي تحضير مسبق. فحادثة غرق سفينة \"تايتانيك\"، ستقلب حياة \"أنابيل\" رأسا على عقب، بعد أن تكون السبب في خسارتها لأبيها وأخيها، كما ستكون السبب في زعزعة الاستقرار النفسي لأمها التي لم تستطع تخطي المأساة. فأنابيل وهي الابنة الوحيدة للمصرفي في نيويورك كانت قبل هذا الانقلاب المفاجئ تعيش حياة رغدة، وكان \"من المريح أن تترعرع في حماية هذا العالم الآمن\". تتزوج أنابيل من \"جوشيا\" المحبّ والحنون والذي يكبرها بأعوام، لكن سوء الطالع سيرافقها، إذ أنه لن يقوم بأي علاقة معها لأنه يكتشف بعد فترة وجيزة أنه مصاب بمرض السفلس، وسوف يجبرها على الطلاق رغما عن إرادتها، موضحا لهاً: \"لن أضع يدي عليك أو أحاول منحك الأطفال الذين أعرف أنك ترغبين بهم بشدة، لن أجازف بحياتك. أحبك كثيرا لأفعل ذلك بك\". \"تستحقين أكثر مما أستطيع منحك إياه\". يتواصل سوء الطالع فتتعرض أنابيل لحادثة اغتصاب، ينتج عنها ابنة غير شرعية. تلاحقها الإشاعات المغرضة والسمعة السيئة. فتغادر إلى مكان آخر بعيداً عن الصراع. وتتمكن من العمل كطبيبة وتعمل على تربية ابنتها تربية صالحة. لكن هل يقبل حبيبها الجديد \"انطوان\" بهذه الحقيقة، أم يتخلى عنها؟ الجواب مؤسف، لقد \"وقعت إلى الأبد في شرك خطايا الآخرين، وان أحداً لن يقبل براءتها، ولا حتى الرجل الذي زعم أنه يحبها..\". \"إنها ضحية قرارات الأشخاص الآخرين ونقاط ضعفهم وأكاذيبهم. من المحزن التوصل إلى هذا الشعور كما لو أن الحقيقة لن تظهر أبدا إلى الضوء..\" \"إنها أم جيدة وطبيبة رائعة، وشخص محترم\"، هي تعرف هذه الحقيقة، وعليها فرضها، فهل يتحول طالعها من السيئ إلى الجيد؟ رواية غنية بالتحليل والأحداث والوقائع، تضع مقاييس المجتمع وقيمه موقع الشك والإدانة، خاصة فيما يتعلق بوضع المرأة، وتكشف عن ظلم يقع يوميا وتقع نتيجته ضحايا بريئة.",
  "genres": [
    "Romance",
    "Fiction",
    "Historical Fiction",
    "Historical",
    "Chick Lit",
    "Drama",
    "Novels"
  ],
  "author": "Danielle Steel",
  "average_rating": "4.07",
  "url": "https://www.goodreads.com/book/show/11730109"
}