{
  "title": "The Complete Flying Officer X Stories",
  "description": "Includes an introduction by Patrick Bishop, bestselling author of Bomber Boys: Fighting Back 1940-1945.The Flying Officer X stories were written by H.E. Bates in his unprecedented role as an official war writer with the R.A.F. during WWII, where he animates the realities faced by pilots tasked with protecting the skies from enemy aircraft. The resulting stories that appeared under the pseudonym Flying Officer X are portraits of individual pilots narrated by an observer who, like Bates, is on the inside of the air force without being a pilot. These portraits recount the personal history of the pilots, and convey the individual qualities and forces that motivate them. They blend the action and suspense of aerial battles, friendships cut off too soon, and life enduring against all odds. In true Bates style, the New York Times noted “These are tales told in impressive quiet, tales that are innocent of even the suggestion of flagrant heroism that colors so many stories about combat pilots.\"Bloomsbury Reader is delighted to collect these stories into one volume for the first time, along with five additional stories from the same period, never before included in a collection: 'Fishers' sees a bond between two soldiers from very different walks of life; 'Happy Christmas Nastashya' sees an English officer encounter a young woman in service to her country in Russia; 'The Bell' follows a young flying officer as he travels back to a familiar pub to reminisce about a lost friend; 'From this Time forward' exposes the raw emotion of losing a loved one; and 'Three Thousand and One Hours of Sergeant Kostek' shows us a man of extraordinary character and flying ability.",
  "genres": [
    "Fiction",
    "War",
    "World War II",
    "Short Stories",
    "Historical Fiction"
  ],
  "author": "H.E. Bates",
  "average_rating": "3.92",
  "url": "https://www.goodreads.com/book/show/27169913-the-complete-flying-officer-x-stories"
}