{
  "title": "Aryadeva's Four Hundred Stanzas on the Middle Way: With Commentary by Gyel-Tsap",
  "description": "Gyel-tsap Dar-ma-rin-chen states that Aryadeva's Four Hundred Stanzas was written to explain how, according to Nagarjuna, the practice of the stages of yogic deeds enables those with Mahayana motivation to attain Buddhahood. Both Nagarjuna and Aryadeva urge those who want to understand reality to induce direct experience of ultimate truth through philosophic inquiry and reasoning. Aryadeva's text is more than a commentary on Nagarjuna's Treatise on the Middle Way because it also explains the extensive paths associated with conventional truths. The Four Hundred Stanzas is one of the fundamental works of Mahayana Buddhist philosophy, and Gyel-tsap's commentary is arguably the most complete and important of the Tibetan commentaries on it. Mahayana practitioners must eliminate not only obstructions to liberation but also obstructions to the perfect knowledge of all phenomena. This requires a powerful understanding of selflessness, coupled with a vast accumulation of merit, or positive energy, resulting from the kind of love, compassion, and altruistic intention cultivated by bodhisattvas. The first half of the text focuses on the development of merit by showing how to correct distorted ideas about conventional reality and how to overcome disturbing emotions. The second half explains the nature of ultimate reality that all phenomena are empty of intrinsic existence. Gyel-tsap's commentary on Aryadeva's text takes the form of a lively dialogue that uses the words of Aryadeva to answer hypothetical and actual assertions questions and objections. Geshe Sonam Rinchen has provided additional commentary to the sections on conventional reality, elucidating their relevance for contemporary life. This is a republished version of Yogic Deeds of Bodhisattvas.",
  "genres": [
    "Buddhism",
    "Religion",
    "Philosophy",
    "Eastern Philosophy"
  ],
  "author": "Aryadeva",
  "average_rating": "4.59",
  "url": "https://www.goodreads.com/book/show/2716790-aryadeva-s-four-hundred-stanzas-on-the-middle-way"
}