{
  "title": "We Are Not Such Things: The Murder of a Young American, a South African Township, and the Search for Truth and Reconciliation",
  "description": "In the vein of the podcast Serial, a gripping investigation of an iconic murder case that calls into question the accepted narrative that has come to exemplify the process of Truth and Reconciliation in South Africa The story of Amy Biehl is well known in South Africa: After the twenty-six-year-old white American Fulbright scholar was brutally murdered on August 25, 1993, during the final, fiery days of apartheid by a mob of young black men in a township outside Cape Town, her parents’ forgiveness of two of her killers became a symbol of the Truth and Reconciliation process in South Africa. Inspired by the story, Justine van der Leun, an American writer living in South Africa, decided to introduce it to an American audience. But as she delved into the case, the prevailing narrative started to unravel. Why didn’t the eyewitness reports agree on who killed Amy Biehl? Were the men convicted of the murder actually responsible for her death? And then van der Leun stumbled on another brutal crime committed on the same day, in the very same area. The story of Amy Biehl’s death, it turned out, was not the story hailed in the press as a powerful symbol of forgiveness, but was in fact more reflective of the complicated history of a troubled country. We Are Not Such Things is the result of van der Leun’s four years investigating this strange, knotted tale of injustice, violence, forgiveness, and redemption. It is a gripping journey through the bizarre twists and turns of this case and its aftermath—and the story that emerges of what happened on that fateful day in 1993 and the decades that followed provides an unsparing account of life in South Africa today. Like Katherine Boo and Tracy Kidder, van der Leun immerses herself in the lives of her subjects. With her stark, moving portrait of a township and its residents, she provides a lens through which we come to understand that the issues at the heart of her investigation—truth and reconciliation, loyalty, justice, race, and class—are universal in scope and powerful in resonance. We Are Not Such Things reveals how reconciliation is impossible without an acknowledgment of the past, a lesson just as relevant to America today as to a South Africa still struggling with the long shadow of its history.",
  "genres": [
    "Nonfiction",
    "True Crime",
    "History",
    "Africa",
    "South Africa",
    "Crime",
    "Politics"
  ],
  "author": "Justine van der Leun",
  "average_rating": "3.72",
  "url": "https://www.goodreads.com/book/show/27163153-we-are-not-such-things"
}