{
  "title": "Fierce in Fur",
  "description": "Elise really did love her family. Mostly. Except they just wouldn’t leave her the heck alone. Yes, she’d just returned after two years of hell at the hands of a militant group called Freedom. And, yes, she was a severely broken Senstive. But, no, she wasn’t a baby who needed to be coddled and wrapped in cotton. Which was why she got the hell out of Dodge and headed to the one place she knew she’d feel more herself and less cotton-y: Ridgeville. Only her escape didn’t go as expected. There was a whacked out wedding, followed immediately (really immediately) by Elise putting her nursing skills to use and catching a couple of babies. Somewhere along the way, her friend Maddy worked her Sensitive magic mojo, and Elise began to feel more like herself and less jacked in the head. Of course, her life took a turn for the O-M-G-Awesome when she stumbled across her mate. Did she mention he was over six feet of lickaliciousness?Brute had never put much thought into the idea of an all knowing deity. Not that he didn’t believe, he just hadn’t ever pondered the idea. He was too busy protecting the Prima (mostly from herself), protecting the pride (mostly from the Prima) and generally keeping his family from murdering each other (often). But the day he met the curvaceous fox he’d call his own was the day he figured there was a God, and the guy kinda liked him. That thought stuck with him until he found out that his sweet fox was the battered and bruised Sensitive that had been rescued with Maddy. Then his mind centered on helping his woman heal and was most definitely not on the hardness of his junk when she was near. Nope. Not at all.When they get to sexy times, it’s all broken beds and orgasms until a threat from the past shows up on Elise’s doorstep. Will Brute be able to prove to his little fox that the gentle giant can become a furry fierce lion when needed?",
  "genres": [
    "Paranormal",
    "Shapeshifters",
    "Paranormal Romance",
    "Romance",
    "Erotica",
    "Humor",
    "Contemporary"
  ],
  "author": "Celia Kyle",
  "average_rating": "4.09",
  "url": "https://www.goodreads.com/book/show/27162050-fierce-in-fur"
}