{
  "title": "Tihkal: The Continuation",
  "description": "A continuation of the classic PIHKAL, TIHKAL focuses on the family of psychoactive drugs in the tryptamine family and provides a blend of biography, botanical facts, scientific speculation, and psychological and political commentary written by renowned psychopharmacologist Alexander Shulgin and his wife Ann Shulgin. Where PiHKAL focuses on a class of compounds called phenethylamines, TiHKAL is written about a family of psychoactive drugs known as tryptamines with TiHKAL being an acronym for Tryptamines I Have Known and Loved\". Like its predecessor, it is divided into two parts. The first part of the book begins with the story of Alice and Shura, a fictionalized autobiography, which picks up where the similar section of PiHKAL left off. The book opens with the story about the DEA raid that occurred a few years after the publication of their first book, PiHKAL. It's a window into the DEA, the institutional aspect and human side of it as well, and the price that Shura and Alice pay for doing what they do, including exercising their first amendment rights. It then continues with a collection of essays on topics ranging from psychotherapy and the Jungian mind, to the prevalence of DMT in nature, ayahuasca, the War on Drugs, and even the Big Bang. It is a blend of travel, botanical facts, scientific speculation, psychological and political commentary. It is fascinating getting to know the mind of the man behind the compounds - his thoughts on science, technology, law, and society. And the mind of the woman who brought his work and their story into the light of the world. The second part of TiHKAL is \"The Chemistry Continues\". It is a detailed manual for 55 psychedelic compounds (many discovered by Shulgin himself). For each compound there is information on synthesis, effective dosage, duration of effects, and commentary on the subjective effects that were experienced. The Shulgin's' two big books span autobiography, organic chemistry, politics, ethnobotany and psychopharmacology and the cultural impact of these works has been profound and will continue to be so in the future.",
  "genres": [
    "Science",
    "Nonfiction",
    "Psychology",
    "Chemistry",
    "Biography",
    "Reference",
    "Philosophy"
  ],
  "author": "Alexander Shulgin",
  "average_rating": "4.42",
  "url": "https://www.goodreads.com/book/show/271921.Tihkal"
}