{
  "title": "Wedding Party",
  "description": "❤ Always best of friends. Now best of lovers?❤You are cordially invited to join the wedding celebration as college friends embark on the greatest education of all - falling in love, finding the perfect bride, and becoming the happiest grooms around...Michael Dickinson is delighted to be best man at his friend’s wedding — but there’s one complication.Tris Donlin.Tris is a bridesmaid. He’s wanted her for longer than he cares to remember, but to her, he’s just good old Michael — college pal, confidant, best buddy. Would a few days of wedding celebration let him get her out of his system once and for all?Her cousin Paul’s wedding party has Tris’s head and heart full of memories of college days with him, Michael, and their friend Grady. Grady was her college crush and Michael was her buddy. Now that they’re all grown up ...my how things have changed.She sees Michael with new eyes ... and a full heart.She’s certain she’s found the best man for her … if only she can convince him.Praise for Wedding Party\"Years of friendship and unspoken desires finally come to the surface. ... What to say about Book 2 but amazing.\" -- 5-star review\"Old friends, lots of mistakes and misunderstandings, this story of Trish and Michael will break your heart at times, frustrate you at their blindness, and warm your heart at their love. Happy endings!\" -- 5-star review“Sweetly intense … with compelling characters.” -- 5-star review\"Fun, heartwarming.\" -- 5-star review\"Feels like they are REAL people that you could know.\" -- 5-star review\"I loved reading this fantastic story. The characters are interesting and entertaining and their love and friendship is beautiful. Great read.\" -- 5-star review“Absolutely delightful … will make hard hearts believe in love again.” -- 5-star reviewPraise for The Wedding Series“A wonderful series that will make you laugh and cry. Each page is filled with love that will eventually come to the people who so need it. A must read!” -- 5-star review\"Love this series! It takes you from home to all over the world!\" -- 5-star review\"Perfect. The characters were multi-dimensional ... warm, thoughtful, loving. Heart-warming.\" -- 5-star review\"Great love stories! … Must read all books in the series! … I laughed and cried!” -- 5-star review“Full of warmth, understanding of human nature, and great characters. ... By the time you are finished, you feel as if you are a part of their extended circle.” -- 5-star reviewThe Wedding Series’ moving, passionate contemporary romances with a touch of humor will captivate you.Enjoy all of Patricia McLinn's The Wedding Series!Prelude to a WeddingWedding PartyGrady’s WeddingThe Runaway BrideThe Christmas PrincessHoopsThe Surprise PrincessNot a Family ManThe Forgotten Prince&l",
  "genres": [
    "Romance",
    "Contemporary",
    "Contemporary Romance",
    "Amazon",
    "Fiction",
    "Friends To Lovers"
  ],
  "author": "Patricia McLinn",
  "average_rating": "3.88",
  "url": "https://www.goodreads.com/book/show/11731784-wedding-party"
}