{
  "title": "Crazy Kinky Dirty Love - Box Set",
  "description": "Crazy Kinky Dirty Love is a series of short stories and novellas revolving around the sex life of a young, kinky couple. Dan and Kyle don’t hesitate to go through with even the dirtiest and least politically correct of sexual scenarios. Each story focuses on a particular roleplay fantasy.With a partner who knows you well, and whom you trust, even being subjected to a rough gangbang can be a declaration of love.All the stories can be read as standalones.WARNING: The stories are extreme roleplay gay erotica, with a focus on dirty talk and humiliationThe Box Set contains:--Crazy Kinky Dirty Skinhead--Kyle promised himself that when he goes to college, he would change. He wouldn’t sleep around like before. But the side of him that wants to fulfill dirty, kinky fantasies is about to rear its ugly head when the LGBT club gets a new member. Dan is the big, bad boyfriend-to-be Kyle always dreamed of, but will Dan still treat him seriously when he finds out about Kyle’s most secret fantasy?Length: ~16,000 wordsErotic content: sizzling hot graphic language, mock-homophobic humiliation, rape fantasy role play, bondage, toys, spanking, dirty talk, boot licking, skinhead--Crazy Kinky Dirty Stud--This year, Kyle is taking the plunge and letting his new boyfriend, Dan, meet his parents for Christmas. It might be time to share one of his secret fantasies with Dan and see if he doesn’t freak out. Will Dan turn out to be a stud dog or a puppy?Length: ~5,000 wordsErotic content: pet play, stud dog, sexual role play, mock-bestiality, breeding, bareback, rough sex, anal sex, mock-dubious consent--Crazy Kinky Dirty Home Invasion--Dan and Kyle have just moved in together, but to make their new place cozy, Dan wants to make friends in the neighborhood. Dan’s dirty minded boyfriend has been mentioning his interest in a threesome and Dan is ready to take the plunge. He’s willing to invite someone new into their bedroom, but it will only be happening on his own terms. And those involve handcuffs, duct tape, and a fake gun.Length: ~11,000 wordsErotic content: sizzling hot graphic language, humiliation kink, rape fantasy role play, bondage, toys, spanking, dirty talk, threesome--Crazy Kinky Dirty Clowns--Kyle’s rushing home after a late evening shift. He takes a shortcut through the park, but a poster informing about a killer clown in the area makes him apprehensive. It turns out there are cackling shadows hiding in the dark, but what does a bunch of crazy clowns do when they catch you?Length: ~10,000 wordsErotic content: sizzling hot graphic language, gangbang, humiliation, role play, bondage, toys--Crazy Kinky Dirty Pirates--All Kyle knows is that he’s in for a vacation break of a lifetime. He is going to the seaside with his boyfriend Dan, and as he loves surprises, he lets Dan arrange all the details. What he doesn’t know is that he is about to get kidnapped by a whole crew of pirates, all of them sex starved for a slave boy they can keep on board and fuck whenever they please. Kyle’s endurance will be tested to the limits, and the surprises will keep coming, as Dan ups the game once more, with a treasure map to much more than a stack of chocolate coins.Length: ~25,000 wordsErotic content: sizzling hot graphic language, multiple partners, humiliation, roleplay, bondage, toys, forced feminization, food play, spanking",
  "genres": [
    "BDSM",
    "M M Romance",
    "Erotica",
    "Contemporary",
    "Menage",
    "M M M",
    "Romance"
  ],
  "author": "K.A. Merikan",
  "average_rating": "3.81",
  "url": "https://www.goodreads.com/book/show/27188347-crazy-kinky-dirty-love---box-set"
}