{
  "title": "This Is Where You Belong: The Art and Science of Loving the Place You Live",
  "description": "A journalist embarks on a project to discover what it takes to love where you live.The average restless American will move 11.7 times in a lifetime. For Melody Warnick, it was move #6, from Austin, Texas, to Blacksburg, Virginia, that threatened to unhinge her. In the lonely aftermath of unpacking, she wondered: Aren't we supposed to put down roots at some point? How does the place we live become the place we want to stay? This time, she had an epiphany. Rather than hold her breath and hope this new town would be her family's perfect fit, she would figure out how to fall in love with it--no matter what. How we come to feel at home in our towns and cities is what Warnick sets out to discover in This Is Where You Belong. She dives into the body of research around place attachment--the deep sense of connection that binds some of us to our cities and increases our physical and emotional well-being--then travels to towns across America to see it in action. Inspired by a growing movement of placemaking, she examines what its practitioners are doing to create likeable locales. She also speaks with frequent movers and loyal stayers around the country to learn what draws highly mobile Americans to a new city, and what makes us stay. The best ideas she imports to her adopted hometown of Blacksburg for a series of Love Where You Live experiments designed to make her feel more locally connected. Dining with her neighbors. Shopping Small Business Saturday. Marching in the town Christmas parade.  Can these efforts make a halfhearted resident happier? Will Blacksburg be the place she finally stays? What Warnick learns will inspire you to embrace your own community--and perhaps discover that the place where you live right now . . . is home.From the Hardcover edition.",
  "genres": [
    "Nonfiction",
    "Self Help",
    "Audiobook",
    "Psychology",
    "Memoir",
    "Book Club",
    "Travel"
  ],
  "author": "Melody Warnick",
  "average_rating": "3.70",
  "url": "https://www.goodreads.com/book/show/27209432-this-is-where-you-belong"
}