{
  "title": "Quilling Basics: Discover the Magic World of Surprises in Quilling",
  "description": "A trip in Cosmina's world Cosmina, an ambitious young lady, learns step-by-step the secrets of the quilling technique. Starting from her desire to discover a new world, Cosmina applies herself to the art of quilling while being guided by a person who truly cares for her, and thus she becomes, after many trials, an example for her friends.You are invited to read this book to come closer to Cosmina and her experiences in the art of quilling.Book content The book is divided in five chapters, bringing the readers detailed explanations and good practice techniques for skilful paper rolling.\"Quilling Basics. Discover the Magic World of Surprises in Quilling\" is a complete guide for paper rolling. It is addressed especially to those who wish to learn the art of quilling, but also to those who are already initiated in this art but who are looking for answers of how to create better and cleaner work that can attract admiring looks from people.The book structure is as 1 Types of paper recommended for quilling Chapter 2 Basic tools required for quilling Chapter 3 Rolling the paper and basic shapes Chapter 4 Tips every beginner should know Chapter 5 Quilling designs you can make at home Appendix 1. How to make quilling paper Appendix 2. Types of paper and using recommendations Appendix 3. Metrical dimensions Appendix 4. Basic quilling shapes Appendix 5. Standard colours for quilling paper strips Appendix 6. Glossary Discover your own world of magic By following the instructions, examples and advices, and by practicing the models suggested by the author for home study, you can enjoy the crafting of objects that you can do yourself, and which can be given various creating cards, decorating picture frames, presents, the Christmas tree, and any household object you may fancy.The models are easy to craft by a beginner, while the most advanced artists may also find a source of inspiration for more complex projects.Considering the fact that some people might consider using this art as a source of income through their own small business, we could say that they will be paid many times more than what they have invested.",
  "genres": [],
  "author": "Alberta Neal",
  "average_rating": "4.27",
  "url": "https://www.goodreads.com/book/show/27208139-quilling-basics"
}