{
  "title": "The Genital Herpes Cure : How to Cure Genital Herpes from a Physical, Emotional & Spiritual Level",
  "description": "The Genital Herpes Cure : How to Cure Genital Herpes from a Physical, Emotional and Spiritual Level  In 2009 after being diagnosed with herpes I thought that was the end of my dating and sexual life.  Years later, I discovered the real meaning of this \"skin condition\" and started seeing it as a blessing, as a real opportunity to experience being Vulnerable, Open & Real.  Being open to the world and embracing my pain let me Heal Spiritually & Emotionally.  Wanting to experience less outbreaks, I decided to start a very healthy lifestyle and specific treatments I share with you in this book...and soon I was outbreak free.  I had the feeling I had cured this \"skin condition\" permanently. Although there isn´t any test that determines wether the virus is still in your system (as it only checks for antibodies), I started voluntarily \"triggering\" the virus with certains foods and with the amino acid L-Arginine to check if the virus would present itself. It didn´t.  After spending almost an year \"triggering voluntarily\" the virus without experiencing any outbreaks, I had the certainty I had cured my genital herpes forever.  To this day, after serveral years, I am outbreak free and I have never ever transmitted the virus to any of my partners.  Today, in this book I want to share with you my journey and how I cured my genital herpes from a Physical, Emotional and Spiritual Level.  Here are the specific benefits you can get from reading this book:    You will understand why there is nothing you can get from traditional treatments. Plus, you will get to know the forces behind herpes medications which offer nothing but false hopes.    The book provides alternative treatments which you can do at home.     This work will also help you realize that there’s a spiritual and psychological battle to be won. Find out how you can make a complete turnaround by changing the way you think.     There are reminders that can assist you in leading a healthy lifestyle. You might have not known all along that your happiness and cure are in your hands. Just keep practicing healthy habits.    _____________________________ Tags: herpes cure treatment, herpes natural cure, herpes protocol, herpes secret, herpes simplex virus, genital herpes, genital herpes treatment, HSV eraser",
  "genres": [],
  "author": "Ivo Anconia",
  "average_rating": "3.60",
  "url": "https://www.goodreads.com/book/show/27207868-the-genital-herpes-cure"
}