{
  "title": "The Franchise Babe",
  "description": "The legendary Dan Jenkins returns with another bawdy, over-the-top novel of hijinks on the links – this time, the LPGA gets the treatmentJack Brannon, a golf writer in his forties who has been bunkered more than once in the marriage game, covers the sport for the big-time magazine SM . Lately he’s been bored out of his mind writing about the PGA Tour, which he says has become “Tiger and a bunch of slugs playing pushover courses.” So he decides to check out what he calls “the Lolitas,” a new breed of young chicks on the LPGA Tour. Jack chooses as a magazine subject Ginger Clayton, a fiery eighteen-year old with flowing blond locks, legs up to here, and a personality that combines mischief with confidence. With her killer looks and killer game, Ginger looks very much like the kind of star who can take the LPGA to the next level of excitement and acceptance. She is, indeed, The Franchise Babe, and everyone seems to want a part of her.Jack’s interest in Ginger’s career might have something to do with her mother, Thurlene Clayton, a knockout herself who looks plenty okay in a jacked-up mini-to use Jack’s description of her outfit. As Ginger shows her grit on the ladies’ tour, the greedy hordes looking to benefit from the kid’s talent and personality aren’t the ones who worry Thurlene-and Jack-the most. Someone is trying to knock Ginger out of the competition-permanently.Jenkins captures the growing buzz around the Franchise Babe and all the insane and hilarious things that happen when the sports world anoints someone new to the throne of super-stardom. Along the way, Jenkins issues bawdy, dead-on takedowns of selfish sports moms, gasbag corporate sponsors, adventurous promoters, sleazy sports agents, point-missing magazine editors, and all the other modern annoyances that make life hard for a guy who, as they say in Texas, is just tryin' to get by without gettin' hurt.",
  "genres": [
    "Fiction",
    "Sports",
    "Novels",
    "Humor"
  ],
  "author": "Dan Jenkins",
  "average_rating": "3.72",
  "url": "https://www.goodreads.com/book/show/2720899-the-franchise-babe"
}