{
  "title": "The Alchemists of Kush",
  "description": "From internationally acclaimed author Minister Faust, increasingly described as one of the best writers of his generation, comes a searing new novel fusing modern realities with ancient yearning, struggle and triumph.The Alchemists of Kush is the story of two Sudanese “lost boys.” Both lost fathers to civil war and mothers along the path of escape. Both boys were hunted and fell into violence to survive. Both came under the guardianship of mystic madmen who promised to transform them. And both vowed to become leaders who would transform their worlds, or die trying.One of those lost boys is Raphael Garang, known to the streets of E-Town as the Supreme Raptor.The other lost boy was Hru-sa-Usir, who lived 7,000 years ago in the Savage Lands of the Lower Nile, and known to the Greeks as Horus, son of Osiris.AUTHORS PRAISE THE ALCHEMISTS OF “It was only a matter of time before the hip hop culture would invade the literary world. With The Alchemists of Kush, Minister Faust is leading the invasion. His novel is possibly the first hip hop epic. Hip hop has a short attention span on most occasions. The Alchemists of Kush gives it gravitas.”—Ishmael ReedAuthor of Mumbo Jumbo and Juice!“Minister Faust’s first two books broke new ground in the SF field. His latest, The Alchemists of Kush, not only breaks new ground; with the story-telling skills of a modern jali, the Minister creates new vistas of history, mythology, erudition, uplift, tragedy, triumph, and contemporary community activism. Once you start the first page of this book, you won't be able to put it down until you’ve finished the last one.”—Charles R. SaundersAuthor of Imaro and Dossouye“I started The Alchemists of Kush and kept reading until I finished. Minister Faust has the most electrifying and true voice I've read in years. The Alchemists of Kush is brilliant.”—Sparkle HayterAuthor of What's A Girl Gotta Do? and Naked Brunch“I loved the story, the mythology, and the characters. I found myself locked into it for hours at a time and couldn't put it down. Rich in detail ...A great book.”—Kenneth T. WilliamsPlaywright of Thunderstick and Three Little Birds“A hell of a story. A hell of a book. A hell of a style. A frenetic novel and voice—very enjoyable. Minister Faust knows how to write about male relationships, brotherhoods, and getting into the hearts of men, and about boys turning into men. The Alchemists of Kush is a triumph, not just for Minister Faust, but for Edmonton and the community of Kush.”—Wayne ArthursonAuthor of Final Season and Fall from Grace“Inspired by a true story and set against an urban backdrop of African immigrant communities in present day Edmonton, Minister Faust weaves a masterful tale around the sacred Book of the Golden Falcon, ten Hermetical scrolls that expound upon the cross pollination of cultural themes and social considerations shared by Original People throughout the African Diaspora.“The Alchemists of Kush is more than a story; it’s a philosophical elixir of Kemetic (Egyptian) folklore, African traditions, urban Sufism, hip hop culture, and Five Percenter pedagogy designed to transmute the challenges of colonialism, assimilation, juvenile delinquency, and moral decay into a universal solvent.",
  "genres": [
    "Fantasy",
    "Fiction",
    "Young Adult",
    "Speculative Fiction",
    "Historical",
    "Canada",
    "Science Fiction"
  ],
  "author": "Minister Faust",
  "average_rating": "3.92",
  "url": "https://www.goodreads.com/book/show/11731785-the-alchemists-of-kush"
}