{
  "title": "Anatomy of a Soldier",
  "description": "Anatomy of a Soldier is a stunning first novel—of patriotism, heroism, and profound humanism—that will immediately take its place on the shelf of classics about what it truly means to be at war.  Let’s imagine a man called Captain Tom Barnes, aka BA5799, who’s leading British troops in the war zone. And two boys growing up together there, sharing a prized bicycle and flying kites before finding themselves estranged once foreign soldiers appear in their countryside. And then there’s the man who trains one of them to fight against the other’s father and all these infidel invaders. Then imagine the family and friends who radiate out from these lives, people on all sides of this conflict where virtually everyone is caught up in the middle of something unthinkable. But then regard them not as they see themselves but as all the objects surrounding them shoes and boots, a helmet, a bag of fertilizer, a medal, a beer glass, a snowflake, dog tags, and a horrific improvised explosive device that binds them all together by blowing one of them apart—forty-five different narrators in all, including the multiple medical implements subsequently required to keep Captain Barnes alive. The result is a novel that reveals not only an author with a striking literary talent and intelligence but also the lives of people—whether husband or wife, father or mother, son or daughter—who are part of this same heart-stopping journey. A work of extraordinary humanity and hope, created out of something hopeless and dehumanizing, it makes art out of pain and suffering and takes its place in a long and rich line of novels that articulate the lives that soldiers lead. In the boom of an instant, and in decades of very different lives and experiences, we see things we’ve never understood so clearly before.From the Hardcover edition.",
  "genres": [
    "Fiction",
    "War",
    "Military Fiction",
    "Contemporary",
    "Novels",
    "Historical Fiction",
    "Literary Fiction"
  ],
  "author": "Harry  Parker",
  "average_rating": "3.99",
  "url": "https://www.goodreads.com/book/show/27208514-anatomy-of-a-soldier"
}