{
  "title": "Try Not to Breathe",
  "description": "For fans of Gillian Flynn, Laura Lippman, and Paula Hawkins comes Holly Seddon’s arresting fiction debut—an engrossing thriller full of page-turning twists and turns, richly imagined characters, and gripping psychological suspense. Some secrets never die. They’re just locked away.Alex Dale is lost. Destructive habits have cost her a marriage and a journalism career. All she has left is her a morning run until her body aches, then a few hours of forgettable work before the past grabs hold and drags her down. Every day is treading water, every night is drowning. Until Alex discovers Amy Stevenson. Amy Stevenson, who was just another girl from a nearby town until the day she was found unconscious after a merciless assault. Amy Stevenson, who has been in a coma for fifteen years, forgotten by the world. Amy Stevenson, who, unbeknownst to her doctors, remains locked inside her body, conscious but paralyzed, reliving the past.   Soon Alex’s routine includes visiting hours at the hospital, then interviews with the original suspects in the attack. But what starts as a reporter’s story becomes a personal obsession. How do you solve a crime when the only witness lived but cannot tell the tale? Unable to tear herself away from her attempt to uncover the unspeakable truth, Alex realizes she’s not just chasing a story—she’s seeking salvation.   Shifting from present to past and back again, Try Not to Breathe unfolds layer by layer until its heart-stopping conclusion. The result is an utterly immersive, unforgettable debut.   Praise for Try Not to Breathe“A brilliant, beautifully written thriller.”—Augusten Burroughs, New York Times bestselling author of Running with Scissors “A razor-sharp plot and wonderfully complex characters . . . Not since The Girl on the Train have I been so captivated by a work of suspense.”—New York Times bestselling author Tess Gerritsen“A fast-paced debut about long-buried secrets and tangled truths.”—New York Times bestselling author Kimberly McCreight   “Engrossing . . . Seddon’s storytelling skills are strong. . . . The world she’s constructed is fascinating and slightly dark.”—Kirkus Reviews",
  "genres": [
    "Mystery",
    "Fiction",
    "Thriller",
    "Mystery Thriller",
    "Crime",
    "Audiobook",
    "Suspense"
  ],
  "author": "Holly Seddon",
  "average_rating": "3.91",
  "url": "https://www.goodreads.com/book/show/27208369-try-not-to-breathe"
}