{
  "title": "The Last Storyteller",
  "description": "Frank Delaney, New York Times bestselling author of Ireland, Shannon, Tipperary, Venetia Kelly’s Traveling Show, and The Matchmaker of Kenmare , is the unparalleled master of Irish historical fiction, bringing Ireland to life with exceptional warmth, wisdom, and wit. Now, in The Last Storyteller, Delaney weaves an absorbing tale of lasting love, dangerous risk, and the healing power of redemption. “Every legend and all mythologies exist to teach us how to run our days. In kind fashion. A loving way. But there’s no story, no matter how ancient, as important as one’s own. So if we’re to live good lives, we have to tell ourselves our own story. In a good way.” So says James Clare, Ben MacCarthy’s beloved mentor, and it is this fateful advice that will guide Ben through the tumultuous events of Ireland in 1956. The national mood is downtrodden; poverty, corruption, and a fledgling armed rebellion rattle the countryside, and although Ben wants no part of the upstart insurrection along the northern border, he unknowingly falls in with an IRA sympathizer and is compromised into running guns. Yet despite his perilous circumstances, all he can think about is finding his former wife and true love, the actress Venetia Kelly. Parted forcibly from Ben years ago, Venetia has returned to Ireland with her new husband, a brutal man and coarse but popular stage performer by the name of Gentleman Jack. Determined not to lose Venetia again, Ben calls upon every bit of his love, courage, and newfound gun-running connections to get her back. And as Ben fights to recapture his halcyon days with Venetia, he must finally reconcile his violent and flawed past with his hopes for a bright and loving future. Brimming with fascinating Irish history, daring intrigue, and the drama of legendary love, The Last Storyteller is an unforgettable novel as richly textured and inspiring as Ireland itself.",
  "genres": [
    "Historical Fiction",
    "Ireland",
    "Fiction",
    "Irish Literature",
    "Historical",
    "Adult",
    "Unfinished"
  ],
  "author": "Frank Delaney",
  "average_rating": "3.93",
  "url": "https://www.goodreads.com/book/show/11732774-the-last-storyteller"
}