{
  "title": "MacLean's Passion",
  "description": "USA Today bestselling author Sharon Cullen’s Highland Pride series continues as Scotland’s most reckless smuggler meets his match in a beautiful spitfire who arouses a renewed sense of duty, camaraderie, and passion.   Colin MacLean has always felt like a black sheep—especially after his brothers are slain before his eyes in the Battle of Culloden. A smuggler by trade, Colin makes for an embarrassing chieftain. He can’t even save his friends from their British pursuers without getting himself captured. But before he is martyred by the hangman’s noose, Colin escapes with his cellmate, a brave lad he’s come to admire. It’s only in the depths of the Highlands that Colin discovers the lad is a lass—and a bonnie one at that.   Raised by her older brothers, Maggie Sinclair can drink a pint in no time flat and wield a dagger with the best of ’em. Still, men have always excluded her and women have always shunned her. Colin makes her feel different. His wild spirit and rugged good looks have Maggie reconsidering her less than ladylike ways. For the first time, she’s tempted to put on a gown, just to see how Colin would react. She can only imagine what might happen a kiss . . . a touch . . . and perhaps enough sultry heat to melt a cold Highland night.  Look for all of Sharon Cullen’s delightful historical    The All the Queen’s Spies WED TO A SPY | BOUND TO A SPY   The Secrets & Seduction THE NOTORIOUS LADY ANNE | LOVING THE EARL | PLEASING THE PIRATE | HIS SAVING GRACE | SEBASTIAN’S LADY SPY | THE RELUCTANT DUCHESS   The Highland Pride  SUTHERLAND’S SECRET | MACLEAN’S PASSION | CAMPBELL’S REDEMPTION Praise for the novels of Sharon Cullen   “This Regency romance has it all—danger, blackmail, passion, love, and characters that draw you in and leave you wanting more.”—Fresh Fiction, on Sebastian’s Lady Spy   “Heart-wrenching and full of real emotion, proving that love is always the answer, His Saving Grace is the best book I’ve read this year!”—USA Today bestselling author Bronwen Evans   “A sizzling, smart relationship that evolves beautifully to capture readers’ hearts as well as their imaginations.”—RT Book Reviews, on Pleasing the Pirate    Includes an excerpt from another Loveswept title.",
  "genres": [
    "Historical Romance",
    "Romance",
    "Historical",
    "Historical Fiction",
    "Scotland",
    "Adult",
    "Adventure"
  ],
  "author": "Sharon Cullen",
  "average_rating": "3.99",
  "url": "https://www.goodreads.com/book/show/27208841-maclean-s-passion"
}