{
  "title": "Garden of Lamentations",
  "description": "Scotland Yard detectives Duncan Kincaid and Gemma James are drawn into separate investigations that hold disturbing—and deadly—complications for their own lives in this powerful mystery in the bestselling series.On a beautiful morning in mid-May, the body of a young woman is found in one of Notting Hill’s private gardens. To passersby, the pretty girl in the white dress looks as if she’s sleeping. But Reagan Keating has been murdered, and the lead detective, DI Kerry Boatman, turns to Gemma James for help. She and Gemma worked together on a previous investigation, and Gemma has a personal connection to the case: Reagan was the nanny of a child who attends the same dance studio as Toby, Gemma and Kincaid’s son.Gemma soon discovers that Reagan’s death is the second tragedy in this exclusive London park; a few months before, a young boy died in a tragic accident. But when still another of the garden residents meets a violent end, it becomes clear that there are more sinister forces at play. Boatman and Gemma must stop the killer before another innocent life is taken.While his wife is consumed with her new case, Kincaid finds himself plagued by disturbing questions about several previous—and seemingly unrelated—cases involving members of the force. If his suspicions are correct and the crimes are linked, are his family and friends in mortal danger as well? Kincaid’s hunch turns to certainty when a Metropolitan Police officer close to him is brutally attacked. There’s a traitor in the ranks, and now Kincaid wonders if he can trust anyone.As Gemma begins to see a solution to her case, she realizes she holds a child’s fate in her hands. Can she do the right thing? And can Kincaid rely on his friends, both inside and outside the Scotland Yard force, to stand beside him as he faces the deadliest challenge of his career?",
  "genres": [
    "Mystery",
    "Fiction",
    "Audiobook",
    "Mystery Thriller",
    "British Literature",
    "Crime",
    "Detective"
  ],
  "author": "Deborah Crombie",
  "average_rating": "4.08",
  "url": "https://www.goodreads.com/book/show/27213092-garden-of-lamentations"
}