{
  "title": "Stronger Than BPD: The Girl's Guide to Taking Control of Intense Emotions, Drama, and Chaos Using DBT",
  "description": "You are strong! No matter what anyone says, you can heal the symptoms of borderline personality disorder (BPD). In this unique guide, influential BPD advocate and blogger Debbie Corso offers an easy-to-use primer on dialectical behavior therapy (DBT), as well as powerful peer-to-peer support for managing your worst BPD symptoms.If you have BPD, you may experience extreme emotional ups and downs. These intense feelings can make navigating everyday life that much more difficult, and as a result, you may have trouble maintaining relationships, seeing yourself clearly, or reaching career goals. You should know that you are not alone, and that BPD isn’t your fault. Most importantly, you need to know that you are strong. With the right tools, you can overcome the symptoms of your BPD—this book will show you how.Written by a BPD survivor and advocate, Stronger Than BPD offers practical, evidence-based dialectical behavior therapy (DBT) skills to help you manage the intense emotions and negative self-image that can occur with BPD. This easy-to-use guide helps you apply the fundamental components of DBT—such as mindfulness, distress tolerance, emotion regulation, and interpersonal effectiveness—to everyday situations that can trigger your symptoms. And through personal examples and real-life stories, you’ll see how others have put these skills to work in their own lives to get relief. You’ll even learn how social media can help you heal!BPD is a part of your life, but it doesn’t have to define you. If you are ready to take control of your symptoms using powerful, evidence-based DBT skills, this friendly guide will light the way.",
  "genres": [
    "Self Help",
    "Mental Health",
    "Nonfiction",
    "Psychology",
    "Parenting",
    "Mental Illness"
  ],
  "author": "Debbie Corso",
  "average_rating": "4.09",
  "url": "https://www.goodreads.com/book/show/27214332-stronger-than-bpd"
}