{
  "title": "The Angel: The Egyptian Spy Who Saved Israel",
  "description": "يغطي كتاب \"الملاك\" لمؤلفه يوري بار – جوزيف إحدى أكثر قصص الجاسوسية إثارة في القرن العشرين؛ الحياة الباهرة والموت المريب لأشرف مروان، الموظف المصري الرفيع الذي عمل سراً لمصلحة الموساد الإسرائيلي. من موقعه كصهر للرئيس المصري الراحل جمال عبد الناصر ومستشار مقرَّب من خلفه، أنور السادات، استطاع أشرف مروان الوصول إلى أدق أسرار حكومة بلاده. لكن، كان لدى مروان سرّه الخاص: لقد كان جاسوساً للموساد، وكالة الاستخبارات الإسرائيلية الشهيرة. أشرف مروان، الذي كان معروفاً لدى مشرفه باسم \"الملاك\"، حوَّل مصر إلى كتاب مفتوح وأنقذ إسرائيل من هزيمة نكراء بتزويده الموساد معلومات مسبقة عن الهجوم المشترك المصري السوري في حرب اكتوبر 1973. الملفت في الأمر أن مروان استطاع تضليل الشرطة السرّية المصرية الصارمة لعقود في السنوات اللاحقة، استمتع بحياة مترفة، لكنها وصلت إلى نهاية صاعقة في عام 2007، حين عُثر على جثته في الحديقة أسفل مبنى شقته في لندن. شكَّت الشرطة في احتمال أن يكون قد رُمي من شرفته في الطابق الخامس، لكن القضية بقيت غير محسومة. ولغاية الآن، بعد موت مروان، لم يُكشف سوى النذر اليسير عن حياته الغامضة.إن كتاب \"الملاك\"، الذي يستند إلى أبحاث دقيقة ومقابلات حصرية مع الشخصيات الهامة ذات الصلة، هو أول كتاب يناقش دوافع مروان في التجسس، وكيف تم الكشف عن هويته كجاسوس للموساد ليس من أحد آخر سوى الرئيس السابق للاستخبارات العسكرية الإسرائيلية، وكيف تمت الاستفادة من – وإساءة استخدام – المعلومات التي قدَّمها. وبالتوسع حول هذه القضية، يُلقي الكتاب الضوء على التاريخ المعاصر للشرق الأوسط والدور الحاسم للجاسوسية البشرية في تشكيل مصير الأمم. وهو، لأول مرة، يجيب عن الأسئلة التي تلف ميراث مروان، وفي آخر الأمر، من الذي كان أشرف مروان يخونه حقاً؟ ومن قتله؟_____________A gripping feat of reportage that exposes—for the first time in English—the sensational life and mysterious death of Ashraf Marwan, an Egyptian senior official who spied for Israel, offering new insight into the turbulent modern history of the Middle East.As the son-in-law of Egyptian president Gamal Abdel Nasser and a close advisor to his successor, Anwar Sadat, Ashraf Marwan had access to the deepest secrets of the country’s government. But Marwan himself had a secret: He was a spy for the Mossad, Israel’s intelligence service. Under the codename “The Angel,” Marwan turned Egypt into an open book for the Israeli intelligence services—and, by alerting the Mossad in advance of the joint Egyptian-Syrian attack on Yom Kippur, saved Israel from a devastating defeat.Drawing on meticulous research and interviews with many key participants, Uri Bar Joseph pieces together Marwan’s story. In the process, he sheds new light on this volatile time in modern Egyptian and Middle Eastern history, culminating in 2011’s Arab Spring. The Angel also chronicles the discord within the Israeli government that brought down Prime Minister Golda Meir.However, this nail-biting narrative doesn’t end with Israel’s victory in the Yom Kippur War. Marwan eluded Egypt’s ruthless secret services for many years, but then somebody talked. Five years later, in 2007, his body was found in the garden of his London apartment building. Police suspected he had been thrown from his fifth-floor balcony, and thanks to explosive new evidence, Bar-Joseph can finally reveal who, how, and why.",
  "genres": [
    "History",
    "Nonfiction",
    "Politics",
    "Biography",
    "Israel",
    "Espionage",
    "War"
  ],
  "author": "Uri Bar-Joseph",
  "average_rating": "3.84",
  "url": "https://www.goodreads.com/book/show/27213220-the-angel"
}