{
  "title": "The Elizabethans",
  "description": "The acknowledged master of the all-encompassing single volume of history demonstrates the profound impact the Elizabethan age has had on contemporary Britain.With all the panoramic sweep of his bestselling study of The Victorians , A. N. Wilson relates the exhilarating story of the Elizabethan Age. It was a time of exceptional creativity, wealth creation and political expansion. It was also a period of English history more remarkable than any other for the technicolour personalities of its leading participants.Apart from the complex character of the Virgin Queen herself, we follow the stories of Francis Drake, a privateer who not only defeats the Armada, but who managed to circumnavigate the globe with a drunken, mutinous crew and without reliable navigational instruments. Then there were political intriguers like William Cecil and Francis Walsingham, so important to a monarch who often made a key strategy out of her indecisiveness.Favourites like Leicester and Essex skated very close to the edge as far as Elizabeth's affections were concerned, and Essex made a big mistake when he led a rebellion against the crown.There was a Renaissance during this period in the world of words, which included the all-round hero and literary genius, Sir Philip Sidney, playwright-spy Christopher Marlowe and that 'myriad-minded man', William Shakespeare. Life in Elizabethan England could be very harsh. Plague swept the land. And the poor received little assistance from the State. Thumbscrews and the rack could be the grim prelude to the executioner's block.But crucially, this was the age when modern Britain was born, when the country established independence from mainland Europe -- both in its resistance to Spanish and French incursions and in its declaration of independent religious liberty from the Pope. After Sir Walter Raleigh established the colony of Virginia, English was destined to become the language of the great globe itself, and the foundations were laid not only of later British imperial power but also of American domination of the world.In The Independent's judgement, A. N. Wilson's book on The Victorians was 'a masterpiece of popular history, comprehensive and sound but with the author's trademark wit and iconoclasm'. With The Elizabethans , Wilson reveals himself again as the master of the definitive, single-volume study.",
  "genres": [
    "History",
    "Nonfiction",
    "Tudor Period",
    "British Literature",
    "16th Century",
    "Biography",
    "Historical"
  ],
  "author": "A.N. Wilson",
  "average_rating": "3.69",
  "url": "https://www.goodreads.com/book/show/11733162-the-elizabethans"
}