{
  "title": "Imagines: Celebrity Encounters Starring You",
  "description": "Anna Todd (#1 internationally bestselling author of the After series) headlines this unique anthology of “imagines”—the first book of its kind—stories from Wattpad writers that immerse you in a fantasy world of fame, adventure, and flirtation with your favorite celebrities.Imagine running around the city, dodging paparazzi with Jennifer Lawrence…Imagine Justin Bieber setting up a romantic scavenger hunt for your anniversary, retelling the story of your love…Imagine selfies have been outlawed, making Kim Kardashian a freedom fighter who needs your help in bringing justice and good lighting to the people…Let your fantasies take over! That’s what the top Wattpad authors have done in this special collection of fictional scenarios that bring you up close and personal with the real celebrities you love—star alongside Zayn Malik, Cameron Dallas, Kanye West, Selena Gomez, Dylan O’Brien, Tom Hardy, Jamie Dornan, Benedict Cumberbatch, and many more!Authors included in the book are Leigh Ansell, Rachel Aukes, Doeneseya Bates, Scarlett Drake, A. Evansley, Kevin Fanning, Ariana Godoy, Debra Goelz, Bella Higgin, Blair Holden, Kora Huddles, Annelie Lange, E. Latimer, Bryony Leah, Jordan Lynde, Laiza Millan, Peyton Novak, C.M. Peters, Michelle Jo Quinn, Dmitri Ragano, Elizabeth A. Seibert, Rebecca Sky, Karim Soliman, Kate J. Squires, Steffanie Tan, Kassandra Tate, Anna Todd, Katarina E. Tonks, Marcella Uva, Tango Walker, Bel Watson, Jen Wilde, and Ashley Winters.Wattpad is a writing community in which users are able to post articles, stories, fanfiction, and poems about anything either online or through the Wattpad app. Although this book mentions many real celebrities, they have not participated in, authorized, or endorsed its creation.",
  "genres": [
    "Romance",
    "Short Stories",
    "Young Adult",
    "Fiction",
    "Contemporary"
  ],
  "author": "Anna Todd",
  "average_rating": "2.88",
  "url": "https://www.goodreads.com/book/show/27214606-imagines"
}