{
  "title": "Loving your Life!: Explorations on loving your self and your life more wondrously using the power of mBIT, Positive Psychology & NLP",
  "description": "Do you love your life? Are you living the most vibrant and enchanting life you can? Would you like to learn how to do that? This book provides a series of explorations and meditations on bringing your human spirit alive. It shares ideas, strategies and techniques for loving yourself and loving your life more fully and more wondrously. It’s based on both science and ancient wisdom. It’s simple yet profoundly powerful. Using this book you can enhance your life and take it to new levels of meaning and purpose. It’s all about ‘Loving your Life!’ As both a guide and a tool for helping you focus on key aspects of loving your self and your life more fully, this book can help you open your heart to parts of yourself that you can support and love more fully and more amazingly. It’s like a spotlight you can use to enlighten aspects of your deep and wondrous self – it helps you explore the processes of authoring and creating a deep and generative ‘self’. At the same time it teaches you how your mind and body works by explaining these aspects in terms of recent advances in the fields of multiple Brain Integration Techniques (mBIT), Positive Psychology and Neuro Linguistic Programming (NLP). Developed as a series of bite sized explorations based on affirmative statements that have been modelled from people who truly and deeply love their lives and who put more love into their relationships with themselves and others. It is designed to be dipped into, played with and used to open your mind to new ways of thinking about your self and your life. Use the power of mBIT and NLP to align your heart, head and gut brains, to bring your human spirit alive, and love your life more wondrously!",
  "genres": [],
  "author": "Grant soosalu",
  "average_rating": "4.71",
  "url": "https://www.goodreads.com/book/show/27211340-loving-your-life"
}