{
  "title": "An Innocent Fashion",
  "description": "“Writing in a fervently literary style that flirts openly with the traditions of Salinger, Plath, and Fitzgerald, Hernández is a diamond-sharp satirist and a bracingly fresh chronicler of the heartbreak of trying to grow up. Honest and absurd, funny and tragic, wild and lovely, this novel describes modern coming-of-age with poetic precision.” —  Kirkus Reviews (starred) The literary love-child of The Devil Wears Prada and The Bell Jar, this singular debut novel is the story of Ethan, a wide-eyed new Ivy League grad, who discovers that his dream of “making it” at leading New York City fashion magazine Régine may well be his undoing.When Ethan St. James graduates from Yale, he can’t wait to realize his dream of becoming a fashion editor at Régine. Born Elián San Jamar, he knew from childhood that he was destined for a “more beautiful” life than the one his working-class parents share in Texas—a life inspired by Régine’s pages. A full ride to the Ivy League provided the awakening he yearned for, but reality hits hard when he arrives at Régine and is relegated to the lowest rung of the ladder.Mordantly funny and emotionally ruthless, An Innocent Fashion is about a quintessential millennial—naïve, idealistic, struggling with his identity and sexuality—trying to survive in an industry, and a city, notorious for attracting new graduates only to chew them up and spit them out. Oscillating between melodrama and whip-smart sarcasm, pretentiousness and heartbreaking vulnerability, increasingly disillusioned with Régine and his two best friends from Yale, both scions of WASP privilege, Ethan begins to unravel.As the narratives of his conflicted childhood, cloistered collegiate experience, and existential crisis braid together, this deeply moving coming-of-age novel for the 21st century spirals towards a devastating truth: You can follow your dreams, but sometimes dreams are just not enough.",
  "genres": [
    "Fiction",
    "Contemporary",
    "Adult Fiction",
    "Fashion",
    "Book Club",
    "Novels",
    "Literary Fiction"
  ],
  "author": "R.J. Hernández",
  "average_rating": "3.36",
  "url": "https://www.goodreads.com/book/show/27213231-an-innocent-fashion"
}