{
  "title": "The Hill",
  "description": "North Africa, 1942.  A new batch of prisoners have just arrived in British detention camp 3599.  Among them is Stevens, puny, effeminate and psychologically weak.  The prisoners are both entertained and repulsed by his bizarre outbursts and cries for help; his frailty initially disgusts them but soon becomes an alarming call for help.  Stevens shares Cell 8 with fellow new arrivals Bartlett, the old lag, Bokumbo, tough West African, McGrath, hardened Scottish fighter and Roberts, a warrant officer who refused to go into a suicidal action.  The clash of personalities beneath the brutal lust for power of a staff sergeant generates a savage tension.  The mental torture Stevens is forced to endure leaves the other cell members speechless and full of hatred for a military system that they had once been part of.  Eventually, they put their differences to one side and decide there is something else worth fighting for.  The hot sun of Egypt permeates every thought and action, and the steep hill - over which prisoners have to run at the double with full kit - burns into the consciousness of every man.   Finally, the pitiless indifference shown by the authorities leads to a shocking denouement.  This is a brutal story of British detention camp and one man’s sadistic lust for power.  Praise for Ray Rigby:  ‘The most spectacularly powerful novel since Bridge over the River Kwai…a crescendo of excitement’ – The New York Times  Ray Rigby was an English novelist and playwright. ‘The Hill’ was turned into a blockbuster film starring Sean Connery and Michael Redgrave.  Endeavour Press is the UK's leading independent digital publisher. For more information on our titles please sign up to our newsletter at www.endeavourpress.com. Each week you will receive updates on free and discounted ebooks. Follow us on Twitter: @EndeavourPress and on Facebook via http://on.fb.me/1HweQV7. We are always interested in hearing from our readers. Endeavour Press believes that the future is now.",
  "genres": [
    "Fiction",
    "War",
    "British Literature",
    "Novels"
  ],
  "author": "Ray Rigby",
  "average_rating": "4.12",
  "url": "https://www.goodreads.com/book/show/27213452-the-hill"
}