{
  "title": "Certain to Win: The Strategy of John Boyd, Applied to Business",
  "description": "Certain to Win [Sun Tzu's prognosis for generals who follow his advice] develops the strategy of the late US Air Force Colonel John R. Boyd for the world of business.The success of Robert Coram's monumental biography, Boyd, the Fighter Pilot Who Changed the Art of War, rekindled interest in this obscure pilot and documented his influence on military matters ranging from his early work on fighter tactics to the USMC's maneuver warfare doctrine to the planning for Operation Desert Storm. Unfortunately Boyd's written legacy, consisting of a single paper and a four-set cycle of briefings, addresses strategy only in war.  Boyd and BusinessBoyd did study business. He read everything he could find on the Toyota Production System and came to consider it as an implementation of ideas similar to his own. He took business into account when he formulated the final version of his OODA loop and in his last major briefing, Conceptual Spiral, on science and technology. He read and commented on early versions of this manuscript, but he never wrote on how business could operate more profitably by using his ideas.Other writers and business strategists have taken up the challenge, introducing Boyd's concepts and suggesting applications to business. Keith Hammonds, in the magazine Fast Company, George Stalk and Tom Hout in Competing Against Time, and Tom Peters most recently in Re-imagine! have described the OODA loop and its effects on competitors.They made significant contributions. Successful businesses, though, don t concentrate on affecting competitors but on enticing customers. You could apply Boyd all you wanted to competitors, but unless this somehow caused customers to buy your products and services, you ve wasted time and money. If this were all there were to Boyd, he would rate at most a sidebar in business strategy.Business is not WarPart of the problem has been Boyd's focus on war, where affecting competitors is the whole idea. Armed conflict was Boyd's life for nearly 50 years, first as a fighter pilot, then as a tactician and an instructor of fighter pilots, and after his retirement, as a military philosopher. Coram describes (and I know from personal experience) how his quest consumed Boyd virtually every waking hour.It was not a monastic existence, though, since John was above everything else a competitor and loved to argue over beer and cigars far into the night. During most of the 1970s and 80s he worked at the Pentagon, where he could share ideas and debate with other strategists and practitioners of the art of war. The result was the remarkable synthesis we know as Patterns of Conflict. Discussions about generals and campaigns, however, did not give Boyd much insight into competition in other areas, like businessNow you might expect, at first glance, that business is so much like war that lifting concepts from one and applying them to the other would be straightforward. But think about that for a minute. Even in its simplest description, business doesn't really look much like war. For one thing, there are always three sides to business competition: you, customers, and competitors. Often it is vastly more complex, with a multitude of competitors who are customers of each other as well. In business, unlike war, it may even be desirable to be conquered by a competitor in a lucrative merger or acquisition. Finally, and most important, it is rarely possible to defeat the other player in the triangle, that is, to compel an unwilling customer to buy. Attempts to pressure customers into paying too much or into buying more than they need often open a window for competitors (as the US airline industry is belatedly discovering.) Generally all we can do is attract offer products and services to potential customers, whose decisions determine who wins and who loses.What this means is that the strategies and tactics of war, Boyd's included, are destructive in nature and so never apply to business. Expressions like Attack enemy weaknesses have no meaning, except as metaphors and analogies. Across different domains, such literary devices are as likely to be misleading as helpful.Boyd's Strategy Still AppliesBusiness is not war, but it is a form of conflict, a situation where one group can win only if another group loses. If you dig beneath Boyd's war-centered tactics you find a general strategy for ensuring that in most any type of conflict your group will be the one that wins.Although Boyd made a number of new and fundamental contributions, his is an ancient school, extending back in written form 2,500 years. It is built around two primary themes:A focus on time (not speed) and specifically, using dislocations in time to shape the competitive situation. These effects, by the way, are quite different in business than they are in war.A culture with attributes that enable even impel organizations to exploit time for competitive advantage. Within Boyd's culture, members will seek out or invent specific practices that will work for it.Why You Should Read this BookThis book will give you a firm foundation in Boyd's strategy, starting with its military roots, but it is not a how-to manual. There could never be such a manual for strategy since all sides could use it and so would derive no strategic benefit. Anything you can write a how-to manual for is tactics or even technique. Strategy begins where these leave off.You should read this book if you ve found other books on business strategy lacking something. You should read it if you appreciate that Sun Tzu seems to be revealing fundamental truths, but it's not clear what they have to do with business. You should read it if you intend to run your own show without the decision making by committee, shunning of responsibility, and breakdown of ethics and trust that you see around you every day.",
  "genres": [
    "Business",
    "Nonfiction",
    "Leadership",
    "Management",
    "Self Help",
    "Military Fiction",
    "Entrepreneurship"
  ],
  "author": "Chet Richards",
  "average_rating": "4.14",
  "url": "https://www.goodreads.com/book/show/1018410.Certain_to_Win"
}