{
  "title": "Invincible Summer",
  "description": "\"Breathtaking. This book will change your life.\" - Schmexy Girl Book Blog “Magnificent. Invincible Summer is one of those books that you read and know you are better for it.” - Red Cheeks Reads \"Heart-achingly beautiful...I was speechless...my life ceased to exist while I read this book...enlightening and uplifting...this book is extraordinary.\" - Relentless Book Chics Rambling and Reviews We all remember our first love, that one affair that took custody of your heart and never really let it go. Readers around the world were touched by The Summer Remains, a heartbreaking and inspiring novel about one of these romances – but Cooper Nichols, the enigmatic young man at the center of the novel, was largely silent on the matter. Until now. “I just can’t believe it’s over between you guys,” my best friend said as we walked down the pier. “You two were supposed to last forever.” I stared out at the blue sea. “Oh, trust me, it’s not over. I am going to see that girl’s face in every crowd I look into, forever. And maybe a few forevers after that…” And so begins the tale of young writer Cooper Nichols. Left in ruins after a tragic summer romance, Cooper is afraid the sun may have set on him for good – until his mother discovers a copy of Cooper’s journal he kept of that summer. As he reluctantly slips back into his own past in the pages of his notebook, Cooper starts to rethink everything he thought he knew about life, death, and all the love that can bloom in between – and what follows is a thrilling and breathtaking journey back to joy that will sink into you and stay there for the long haul. Illuminating, romantic and soul-stirring, Invincible Summer is a testament to the miraculous power of love, in all its immortal glory and everlasting majesty. If you have ever found yourself drifting back to a long-lost romance during a quiet moment, prepare to be pulled under all over again. “That one summer. Everyone’s got one, that fleeting season that rearranged you and imprinted itself onto your soul forever. You were mine. I swear I’ll never forget your hazel eyes. I swear I’ll never forget those few months when the winds roared. I’ll always think of you that way. And if you can, please come back to me. At the end of the day I’m just a boy who wants to get back to his first love, and I miss you. Just find a way back, please. I’ll be waiting. Until then, I’ve got nothing…”",
  "genres": [
    "Romance",
    "New Adult",
    "M M Romance",
    "Death"
  ],
  "author": "Seth King",
  "average_rating": "4.45",
  "url": "https://www.goodreads.com/book/show/27215165-invincible-summer"
}