{
  "title": "No One Has Such a Dog, and No One Should: Collected Canine Essays",
  "description": "My love of canine kind verges on, and sometimes leaps the brink into, the ridiculous. Growing up, my family dogs were always particularly rotten, but also infinitely good. Having them in my life has both enriched and enlivened my days, as well as offered me unique perspectives on a variety of topics. As both a writer and an anthropologist, I have long been fascinated by the dog's role in human cultural evolution. Forming half of this particular commensal dynamic, dogs have changed with us as a species. They have traveled vast distances, endured the hardships of new climates and environmental conditions, and witnessed the birth of agriculture and domestic animal husbandry. Perhaps they even played a crucial role in the success of some ventures, thanks to the unique bond they shared with their humans.Over the centuries, they have remained our stalwart companions, absorbing breed shifting and blending with grace. However, I think that at its core, our relationship with dogs and our mutual needs have not changed all that much in the 15 millennia we've travelled together. We look to them for comfort, companionship, help in a variety of tasks from Service aides, Search and Rescue, and Law Enforcement to work in the fields of herding and ranching. They are always there, ready to help. All they ask is that their needs be met--food, shelter, and perhaps a little affection.This unlikely alliance between a feared predator and our ancestors is perhaps more understandable than one might first suppose. Within these essays, I explore a variety of topics, from silly, personal rituals to scientific advancements in our understanding of canine physiology, human cultural evolution, and even the similarities between the two species--from hierarchical group formation to neurobiology. I'm so pleased to share my experiences and my curiosity with you. With hope, this will inspire you to chronicle your own journey with a Person of Importance and Great Worth.As we say in this household, \"No one has such a dog, and no one should. But we do.\" May everyone be as lucky.",
  "genres": [],
  "author": "Erin Sandlin",
  "average_rating": "4.70",
  "url": "https://www.goodreads.com/book/show/27223002-no-one-has-such-a-dog-and-no-one-should"
}