{
  "title": "Of Love and Other Demons",
  "description": "From the Nobel Prize-winning author of Love in the Time of Cholera, a startling new novel -- the story of a doomed love affair between an unruly copper-haired girl and the bookish priest sent to oversee her exorcism.Of Love and Other Demons is set in a South American seaport in the colonial era, a time of viceroys and bishops, enlightened men and Inquisitors, saints and lepers and pirates. Sierva Maria, only child of a decaying noble family, has been raised in the slaves' courtyard of her father's cobwebbed mansion while her mother succumbs to fermented honey and cacao on a faraway plantation. On her twelfth birthday the girl is bitten by a rabid dog, and even as the wound is healing she is made to endure therapies indistinguishable from tortures. Believed, finally, to be possessed, she is brought to a convent for observation. And into her cell stumbles Father Cayetano Delaura, the Bishop's protege, who has already dreamed about a girl with hair trailing after her like a bridal train; who is already moved by this kicking, spitting, emaciated creature strapped to a stone bed. As he tends to her with holy water and sacramental oils, Delaura feels \"something immense and irreparable\" happening to him. It is love, \"the most terrible demon of all.\" And it is not long before Sierra Maria joins him in his fevered misery.Unsettling and indelible, Of Love and Other Demons haunts us with its evocation of an exotic world while it treats, majestically the most universal experiences known to woman and man.Natasha Richardson's film credits include Nell, Widow's Peak, The Comfort of Strangers, and The Handmaid's Tale. She has appeared on stage in Anna Christie, High Society, Hamlet, and A Midsummer Night's Dream, among others.",
  "genres": [
    "Fiction",
    "Classics",
    "Magical Realism",
    "Historical Fiction",
    "Romance",
    "Literature",
    "Latin American"
  ],
  "author": "Gabriel García Márquez",
  "average_rating": "3.96",
  "url": "https://www.goodreads.com/book/show/2723147-of-love-and-other-demons"
}