{
  "title": "Unexpected Forfeit",
  "description": "Chyna  Every chance I get, I go to watch the local fights. I crave the excitement and the rush as it courses through my body, with the sounds of fists meeting flesh.  It’s not just the blood or the hard bodies that keeps me coming back each time, wanting more. It’s Jace ‘King’ Kash and his artic blue eyes. He has fists made of steel with a body honed for speed. He’s breathtaking to watch in the cage. The King easily brings men to their knees, and then graciously helps them up when he’s finished.  Getting introduced to him was thrilling, falling in love with him, unexpected. Jace comes pounding through, waking my mind and body up; showing me what I was missing out on in my life. He makes me realize what I could have and that what doesn’t destroy me, will eventually make me stronger.  Jace Illusions, life is full of them. My life wasn’t always like it is now, how it appears from the outside. I was drowning in drugs, gangs and in my brother’s bad decisions. So, I did what I do best, I fought my way out. I keep fighting, using every asset I have and attempting to get as far away from my past as possible.  Chyna enters into my life right as I’m prepping for the biggest fight of my existence. I wasn’t looking for any new distractions, but she becomes my personal drug of choice, begging me to use her. Unfortunately, Chyna’s not the only person that show’s up out of the blue. When my past decides to go after my girl, it’s my turn to make it rain, to make it hurt. I refuse to let it destroy me this time, dragging her down in the process. I just hope she can make it through the last round beside me and not forfeit.  Once that bell rings, watch out, because I will come for you, I will hunt you down and fight to the death. I’m the King, I won’t be defeated.",
  "genres": [
    "Mixed Martial Arts",
    "Fighters",
    "Romance",
    "Contemporary",
    "Amazon",
    "Contemporary Romance",
    "New Adult"
  ],
  "author": "Sapphire Knight",
  "average_rating": "4.19",
  "url": "https://www.goodreads.com/book/show/27231672-unexpected-forfeit"
}