{
  "title": "The Last Days of Old Beijing: Life in the Vanishing Backstreets of a City Transformed",
  "description": "A fascinating, intimate portrait of Beijing through the lens of its oldest neighborhood, facing destruction as the city, and China, relentlessly modernizes. Soon we will be able to say about old Beijing that what emperors, warlords, Japanese invaders, and Communist planners couldn’t eradicate, the market economy has. Nobody has been more aware of this than Michael Meyer. A long-time resident, Meyer has, for the past two years, lived as no other Westerner—in a shared courtyard home in Beijing’s oldest neighborhood, Dazhalan, on one of its famed hutong (lanes). There he volunteers to teach English at the local grade school and immerses himself in the community, recording with affection the life stories of the Widow, who shares his courtyard; coteacher Miss Zhu and student Little Liu; and the migrants Recycler Wang and Soldier Liu; among the many others who, despite great differences in age and profession, make up the fabric of this unique neighborhood. Their bond is rapidly being torn, however, by forced evictions as century-old houses and ways of life are increasingly destroyed to make way for shopping malls, the capital’s first Wal-Mart, high-rise buildings, and widened streets for cars replacing bicycles. Beijing has gone through this cycle many times, as Meyer reveals, but never with the kind of dislocation and overturning of its storied culture now occurring as the city prepares to host the 2008 Summer Olympics. Weaving historical vignettes of Beijing and China over a thousand years through his narrative, Meyer captures the city’s deep past as he illuminates its present. With the kind of insight only someone on the inside can provide, The Last Days of Old Beijing brings this moment and the ebb and flow of daily lives on the other side of the planet into shining focus.",
  "genres": [
    "China",
    "Nonfiction",
    "History",
    "Travel",
    "Asia",
    "Memoir",
    "Politics"
  ],
  "author": "Michael Meyer",
  "average_rating": "3.96",
  "url": "https://www.goodreads.com/book/show/2723256-the-last-days-of-old-beijing"
}