{
  "title": "The Summer Before the War",
  "description": "NEW YORK TIMES BESTSELLER “A novel to cure your Downton Abbey withdrawal . . . a delightful story about nontraditional romantic relationships, class snobbery and the everybody-knows-everybody complications of living in a small community.”—The Washington PostThe bestselling author of Major Pettigrew’s Last Stand returns with a breathtaking novel of love on the eve of World War I that reaches far beyond the small English town in which it is set.   East Sussex, 1914. It is the end of England’s brief Edwardian summer, and everyone agrees that the weather has never been so beautiful. Hugh Grange, down from his medical studies, is visiting his Aunt Agatha, who lives with her husband in the small, idyllic coastal town of Rye. Agatha’s husband works in the Foreign Office, and she is certain he will ensure that the recent saber rattling over the Balkans won’t come to anything. And Agatha has more immediate concerns; she has just risked her carefully built reputation by pushing for the appointment of a woman to replace the Latin master.  When Beatrice Nash arrives with one trunk and several large crates of books, it is clear she is significantly more freethinking—and attractive—than anyone believes a Latin teacher should be. For her part, mourning the death of her beloved father, who has left her penniless, Beatrice simply wants to be left alone to pursue her teaching and writing.  But just as Beatrice comes alive to the beauty of the Sussex landscape and the colorful characters who populate Rye, the perfect summer is about to end. For despite Agatha’s reassurances, the unimaginable is coming. Soon the limits of progress, and the old ways, will be tested as this small Sussex town and its inhabitants go to war.  Praise for The Summer Before the War   “What begins as a study of a small-town society becomes a compelling account of war and its aftermath.”—Woman’s Day  “This witty character study of how a small English town reacts to the 1914 arrival of its first female teacher offers gentle humor wrapped in a hauntingly detailed story.”—Good Housekeeping   “Perfect for readers in a post–Downton Abbey slump . . . The gently teasing banter between two kindred spirits edging slowly into love is as delicately crafted as a bone-china teacup. . . . More than a high-toned romantic reverie for Anglophiles—though it serves the latter purpose, too.”—The Seattle Times  “[Helen Simonson’s] characters are so vivid, it’s as if a PBS series has come to life. There’s scandal, star-crossed love and fear, but at its heart, The Summer Before the War is about loyalty, love and family.”— The Magazine “This luminous story of a family, a town, and a world in their final moments of innocence is as lingering and lovely as a long summer sunset.”—Annie Barrows, author of The Truth According to Us and co-author of The Guernsey Literary and Potato Peel Pie Society     “Simonson is like a Jane Austen for our day and age—she is that good—and The Summer Before the War is nothing short of a",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Historical",
    "Book Club",
    "Audiobook",
    "British Literature",
    "World War I"
  ],
  "author": "Helen Simonson",
  "average_rating": "3.79",
  "url": "https://www.goodreads.com/book/show/27232505-the-summer-before-the-war"
}