{
  "title": "The Thomas Elkin Series",
  "description": "Elements of Retrofit Generation versus generation, traditional versus contemporary, these men are about to learn a lesson in architecture and love. Can they prove that the old and new can be the perfect design? A successful New York architect, Thomas Elkin almost has it all. Coming out as gay and ending his marriage before his fortieth birthday, he needed to start living his life. Now, four years later, with his relationship with his son back on track, and after a few short-lived romances, this esteemed traditional draftsman thinks he knows everything about architecture, about life. Cooper Jones, twenty-two years old, is about to take the architect world by storm. Talented, professional, driven and completely infuriating, Cooper is the definition of Generation Y. Starting an internship working with Thomas, Cooper is about to knock Tom's world off its axis. Tom can teach Cooper about the architecture industry, but Cooper is about to teach Tom what it means to live. Clarity of Lines When some lines blur, others become crystal clear. Absolutely smitten, Thomas Elkin and Cooper Jones have decided they're prepared to give a relationship a try. What they're not prepared for is the reaction from their families, who try to force them apart. Both men are about to learn that there are lines that define us. Sometimes the lines blur, sometimes the lines become crystal clear. Sense of Place Designing homes is easy. Finding home is something else entirely. Thomas Elkin and Cooper Jones finally have the support of their families, and their love grows stronger every day. Now living together, they think nothing can stand in their way. But there are outside influences trying to pull them apart. Cooper encounters a man, closer to his age and with connections high up the property development chain, who wants Cooper as his own. Tom encounters discrimination and a hidden agenda from a fellow senior partner who's trying to take him down. No matter what the world throws at them, Tom and Cooper are the real deal. Age differences aside, Tom has finally found his sense of place. His one true center, his home.",
  "genres": [
    "M M Romance",
    "Romance",
    "Contemporary",
    "Audiobook",
    "LGBT",
    "M M Contemporary"
  ],
  "author": "N.R. Walker",
  "average_rating": "4.58",
  "url": "https://www.goodreads.com/book/show/27234595-the-thomas-elkin-series"
}