{
  "title": "Human Rites",
  "description": "Judgement is in the eye of the beholderAdrian Harvey, London wine merchant, has lost the Christmas spirit. Someone is stalking him, stealing his post and vandalising his shop. When the police question him after an anonymous tip-off, he's more than anxious. He's scared. And who is that nun? Long time neighbour and friend DI Beatrice Stubbs is dispatched to Germany to investigate a series of apparently related art thefts, so Adrian seizes the chance to flee the city. He follows her to Hamburg to do some Christmas shopping and visit his ex. Yet the stalker is still on his heels.While Beatrice is on the trail of a violent gang of mercenary thieves, Adrian runs from danger to the remote island of Sylt. But danger follows and Adrian has run too far. From the icy streets of Hamburg, to the canals of Amsterdam, and the snowswept beaches of Sylt, Beatrice and Adrian discover how a virtue taken to extremes can lead to deadly sin. Each book works as a stand-alone novel. If you enjoy Kathy Reichs, LJ Ross and Henning Mankell, you'll love Human Rites.\"Enthralling! The menace of Du Maurier meets the darkness and intrigue of Nordic Noir. Keep the lights on and your wits about you.\" - Anne Stormont, author of Displacement\"Human Rites has got it organised crime, Beatrice Stubbs, nuns, Stollen, wine, Adrian and Expressionist art, with the added delights of a German Christmas, gay men's choirs and a farty Husky. She's back and she's brilliant!\" - The Crime Addict Discover Beatrice Stubbs - detective inspector, metaphor mixer and stubborn 1. Behind Closed Doors (Switzerland)2. Raw Material (England/Wales)3. Tread Softly (Basque County, Spain)4. Cold Pressed (The Greek Islands)5. Human Rites (Germany)6. Bad Apples (Portugal)7. Snow Angel (England)8. Honey Trap (Italy)9. Black Widow (France)10. White Night (Finland)11. The Woman in the Frame (Mallorca)12. All Souls' Day (Belgium)Plus the exclusive free prequel for newsletter Black Dogs, Yellow Butterflies (London)",
  "genres": [
    "Mystery",
    "Crime",
    "Fiction"
  ],
  "author": "J.J. Marsh",
  "average_rating": "4.37",
  "url": "https://www.goodreads.com/book/show/27240233-human-rites"
}