{
  "title": "Mad About You",
  "description": "'The inevitable comparisons with Marian Keyes are justified and well deserved - Moriarty's characters are likeable, well developed and funny ****' HeatSinead Moriarty's riveting new novel, Mad About You, will make every reader stop and think about the importance of trust in relationships - how fragile it can be, how easily damaged, how hard to repair. Sinead combines the storytelling genius of Jodi Picoult, and the compassion and humour of Marian Keyes, in a gripping story of contemporary marriage.Emma and James Hamilton have weathered lots of storms in their ten-year marriage. From the heartbreak of infertility, to the craziness of then becoming parents to two babies in one year, to coping with James losing his job, somehow they have always worked as a team.However, the pressure of moving from Dublin to London for James's new job - away from familiar surroundings and the family Emma loves - puts them under stress like never before. So when James starts getting texts from a stranger - texts that show startling insights into their lives - Emma is not sure what to think. She is far from home, isolated and before long finds herself questioning everything about their relationship.Maybe those texts are telling her the truth and the life she believed to be solid and secure is just a mirage. Somehow she has to get a grip, but how can she do that when a stranger is set on driving Emma out of her home and her marriage?'One of the brightest voices in modern women's fiction' BellaSinead Moriarty lives with her family in Dublin. Her previous titles The Baby Trail; A Perfect Match; From Here to Maternity; In My Sister's Shoes; Keeping It In the Family (also titled Whose Life is it Anyway?); Pieces of My Heart , Me and My Sisters and This Child of Mine.",
  "genres": [
    "Chick Lit",
    "Contemporary",
    "Fiction",
    "Romance",
    "Mystery",
    "Adult",
    "Family"
  ],
  "author": "Sinéad Moriarty",
  "average_rating": "3.52",
  "url": "https://www.goodreads.com/book/show/27246064-mad-about-you"
}