{
  "title": "The Time Traveler's Handbook: 18 Experiences from the Eruption of Vesuvius to Woodstock",
  "description": "Travel through time to witness some of the most extraordinary and colorful events in world history with this unusual and entertaining guide that includes fascinating cultural details from each period, including what and where to eat, what to wear, how to act like a local, and most importantly, how to stay alive.Have you ever wished you could have experienced some of the most interesting and important events that have helped shape history? With The Time Travel Handbook you can! Johnny Actonis, David Glodblatt, and James Wyllie transport you back in time, providing a “you-are-there” front-seat view of some the greatest moments in the human timeline. Filled with engaging and colorful details, The Time Travel Handbook helps you make the most of your “travels,” giving you background information, insight into local customs, and advice on all aspects of period life to make your adventures authentic and help you actually live them. Forget museums and history books—The Time Travel Handbook gives you unprecedented access to a wide range of milestones, including Celebrations & Exhibitions; Moments That Made History; Cultural & Sporting Spectaculars; Epic Journeys and Voyages; and Extreme Events. Observe Mount Vesuvius erupt (and survive), see the assassination of the Archduke Ferdinand in Sarajevo, boogie with the Beatles in Hamburg, accompany Marco Polo to Xanadu, attend the opening night of Shakespeare’s Globe Theater, smell the cordite at the battle of Bull Run, and sit ringside at Foreman and Ali’s “Rumble in the Jungle” in Kinshasa. Illustrated with color and black-and-white paintings and photographs of famous figures and locations, as well as detailed maps and illustrations to aid in your journey through time, The Time Travel Handbook is the ultimate guide to exploring history that unlocks the wonders of the past as never before.",
  "genres": [
    "History",
    "Nonfiction",
    "Time Travel",
    "Humor",
    "Historical",
    "Travel",
    "Apple"
  ],
  "author": "James Wyllie",
  "average_rating": "3.68",
  "url": "https://www.goodreads.com/book/show/27246881-the-time-traveler-s-handbook"
}