{
  "title": "Strip City: A Stripper's Farewell Journey Across America",
  "description": "There's no business like the sex business -- or is there? In this poignant, bittersweet, sometimes funny account of a stripper's odyssey, the reader is allowed many roles. We start innocently enough: reading a journal about finding oneself -- a journey across America to recapture and understand a young woman's history as she prepares for a new life.Along the way, we are alternately voyeurs and witnesses, learning the details and daily grinds of a worker in the sex trade -- an exotic dancer, on her last cross-country tour of the clubs that have been such an important part of her life. Well written and powerful, Strip City becomes, about midway through, the journal of a soul. It asks why we do what we do, what it means to say one is a feminist, and how to understand (with eyes wide open) an industry that is both liberating and degrading -- a job in some ways like many others, yet one ultimately corruptive of our very dreams, nightmares, fears, and desires. Strip City is not a tell-all, although it tells much. It is one woman's attempt to come to terms with her past: to glorify the dance and not to victimize, preach, or pass judgment on the dancers or to mystify the work, the audience drawn to it, and (most of all) the toll on the women themselves. It is both painful and funny and cathartic for both writer and reader. Most of all, it is a very moral tale, honestly told, deftly written, and exhibiting neither shame nor undue pride: an American tale, filled with pop culture images that remind us, over and over again, of the roles a prosperous, bountiful nation has allowed to (or forced on) women. Strip City provides us a dazzling, glitzy, and devastating meditation. ( Fall 2001 Selection)",
  "genres": [
    "Memoir",
    "Nonfiction",
    "Sex Work",
    "Biography",
    "Sexuality",
    "Feminism",
    "Book Club"
  ],
  "author": "Lily Burana",
  "average_rating": "3.65",
  "url": "https://www.goodreads.com/book/show/272440.Strip_City"
}