{
  "title": "Through Thorny Ways",
  "description": "With secrets dating back two generations, will Wisteria House unite or destroy an already-fractured family?Shrouded in scandal and secrets, Arilee Rutledge’s family is as tangled as the thorns surrounding their unwelcoming antebellum mansion. When her brother Davis returns from the Great War, she hopes they will make a new start after a season of devastation. But Davis is haunted by their younger brother’s death and his wife’s committal to the state asylum; while he loses himself in his work, Arilee continues raising his children. Determined to control at least one area of their lives, the siblings hire a former acquaintance to restore their dilapidated home.Thrown from a carefree boyhood into the horrors of trench warfare, Adam Harrison is broken yet matured by his experiences. He takes a job updating and repairing Wisteria House, not only to pay his way through medical school, but in hopes of winning the woman he has long admired. A startling discovery plunges them all into a series of events revealing dark mysteries and shaking their already-uncertain future.Can the thorns of grief, pain, and regret ever be cleared from their troubled hearts?For those who love the Church, for those who have been hurt by the Church, and for those of us who are both, Jennifer Q. Hunt brings a poignant new family saga in which the challenges of life are not glossed over and hope in Christ is never underestimated. Powerful and compelling, Through Thorny Ways is a story of sacrifice and family, forgiveness and love, new beginnings and utter dependence on the Lord. Find a permanent place on your shelf, because once you travel to 1921 Atlanta with Hunt, you aren't going to want to leave. —Heather Wood, Author of the Finding Home series.",
  "genres": [
    "Historical Fiction",
    "Christian Fiction",
    "Romance",
    "Christian",
    "Fiction",
    "Christian Romance",
    "Clean Romance"
  ],
  "author": "Jennifer Q. Hunt",
  "average_rating": "4.59",
  "url": "https://www.goodreads.com/book/show/117367614-through-thorny-ways"
}