{
  "title": "My Russian Master",
  "description": "Sometimes the road to happily-ever-after begins with two simple words: “Yes, Sir.”\n  For CEO Caroline Turner certain truths were inescapable. No matter how powerful, successful, and pretty she was, it didn’t matter when it came to the number on her scale -- a number she wasn’t at all happy with. Like every other obstacle in her life though, she had a plan for overcoming it. The famous Maxim Volkov chef and fitness expert wasn’t cheap, and he wasn’t exactly falling in line with her wishes either, but he was perfect for the job … and extremely easy on the eyes. However alpha and devastatingly handsome the taciturn Russian might, he seemed to have a different understanding about who the boss was in their particular arrangement. She’d just have to put him in his place… and try to ignore the insane urge to kneel at his feet.  Taking the job offered by the spoiled, if intriguing American CEO was something Maxim wouldn’t normally do. He didn’t need the money, and he usually found Western women trying at best, maddening at worst. But something about the pretty Caroline spoke to him, her defiance, and acid-tongued ways hiding an appealing vulnerability he longed to bring to the fore. Despite her self-image, he saw little wrong with the curvy, brunette beauty. Nothing wrong that is that couldn’t be cured with a little strict, bare bottom discipline, and some loving, sensual aftercare. That the appealingly disobedient, mouthy American woman would surrender to him was never in doubt.  The only question was when.  But behind Caroline’s strong, professional facade, something else lurked, a part of her painful past that threatened to endanger her future -- and perhaps her life. Hiding his own potentially explosive secrets, Maxim must help her finally put that dark chapter behind her -- no matter what it took, no matter how much she might fight it, no matter how much it hurt. Worse, hated competitors, circling like sharks, threatened to destroy all that Caroline had worked so hard to create.  Struggling with demons both internal and external, her last, best hope might just be a man as hard and implacable as a Siberian winter...  Publisher’s Warning: Intended for mature audiences. 18 and over only!  This sensuous romance contains explicit sexual situations, spanking, and anal play. This book deals with eating disorders and could be a trigger for some. This book can be read as a standalone. Enjoyment of the novel will be enhanced by reading the previous entries in the series, but it’s not necessary.",
  "genres": [
    "BDSM",
    "Contemporary"
  ],
  "author": "Megan Michaels",
  "average_rating": "3.89",
  "url": "https://www.goodreads.com/book/show/27250002-my-russian-master"
}