{
  "title": "The Black Dogs MC",
  "description": "From bestselling author Sienna Valentine…Books 1 & 2 of the bestselling Black Dogs MC series, available together for one low price and for a very limited time. When the time is up, the bundle will disappear!JASEThis MC took me in when no one else would. It was the only real family I’ve ever known. Her asking me to leave was bullshit, but then disappearing without even saying goodbye was so much worse.I was done with Maggie then. I never wanted to see her face again.Five years. Five years of anger, pain and regret. Five years to move on and forget.And five seconds to get sucked back in.MAGGIEI have no right coming back here. No right asking for help. Not after the way I left everything - the way I left Jase.But what choice do I have? I’m dead if I don’t.I’ve made so many bad choices in my life. Caused so much pain. Maybe I deserve what’s coming to me. What right do I have putting Jase, my father, and the whole MC in danger just to help me?The MC is Jase’s sanctum, and I may not deserve it, but I’m praying that it can now become mine.WillI was a different man two years ago. I was soft, too easy-going.Look where that got me. Death and destruction, and all of it my fault. I wasn’t going to let that happen again.Now all I wanted to do was fight, drink and fuck.I couldn’t imagine that anything short of retribution for the past could make me want to turn back into the man I was before.I certainly never imagined someone like Eva…EvaWhen my brother and I moved to this small little town to take over my Uncle’s bar, I thought that it was just going to be like a little mini vacation from our lives.What I didn’t expect was to be threatened almost as soon as we got there. And I certainly didn’t expect protection from that threat to come from a man like Will Bowers.Dark, violent and completely gorgeous. He’s the complete opposite of the type of guy I’m usually attracted to, but then again, I’ve never met a man like him before. My instinct tells me to stay far away, but at the same time, I can’t ignore the feeling that there is more to him than his rough exterior. I see something behind all of that pain in his eyes. Something that draws me forward.Besides, my friend Laura is always telling me that I spend too much time with my head buried in my books, and that I need to actually lift it up and live a little.Maybe she’s right, but I don’t think this is what she had in mind. These books are both stand-alone romance novels with HEA endings. They contain sex and violence, and are intended for adults only.",
  "genres": [],
  "author": "Sienna Valentine",
  "average_rating": "3.95",
  "url": "https://www.goodreads.com/book/show/27249898-the-black-dogs-mc"
}