{
  "title": "Torn: A Dark BDSM Romance Novel",
  "description": "ASIN: B016Z6AC5K'Alternate cover edition'“That’s what love is, isn’t it? It’s when you go to sleep every night hoping that you are less happy than your lover; it’s hoping that you’ve given everything you could to them so that their day could be just a tiny bit better.” I was so innocent then. So naïve. I thought that I’d been hardened by my time living on the streets, but I’d had no idea how broken I could become. My story is a hard one, full of hope, grief, love, and anger, but it’s a story that needs to be told. I was only 20 when I first met Mr. Sheffield. He saved me. He gave me a chance. Until I met him, I’d been living on scraps of food from dumpsters and wearing the same filthy clothes that I’d worn when I failed out of college. I was the animal that passed by unseen by the people of the world. But Mr. Sheffield saw me. He was a handsome older gentleman, but that wasn’t what was important at the time. Out of the goodness of his heart, he gave me a job cooking and cleaning for him. To you, it may seem like a menial task below your station, but to me it was a chance at a life worth living. Little did he know, I couldn’t cook or clean. Again, he showed his good nature by teaching me, as a father teaches a daughter, with strict punishments and just rewards. He could have forced me from his home like another worthless piece of garbage, but he gave me chance after chance, and in the process, he showed me a world that I’d never dreamed of. If you’re looking for a story that will warm your heart and make you see the good in the world, look elsewhere. This is about the darkness that lies behind the mask that we all wear. Other stories may bring you romance and candles, but this is a story with claws and teeth. It is raw. It is passion. It is real. \"... gut-wrenching, heartbreaking love story, complicated adult relationships and flawed people instead of cardboard cliches\" ~Lilah E. Noir, author of Stroker Ace Note: This novel contains many explicit BDSM scenes and is intended for adults only.",
  "genres": [
    "BDSM",
    "Romance",
    "Erotica",
    "Dark",
    "Dark Romance"
  ],
  "author": "Lexie Syrah",
  "average_rating": "3.79",
  "url": "https://www.goodreads.com/book/show/27255557-torn"
}