{
  "title": "The Vampire Circus",
  "description": "It is June of 1923. After serving twenty years on death row for executing five vampires, members of a traveling circus who had killed his wife and son, the 65-year-old Johnny Durango is pardoned and set free. Now penniless, the former best-selling author of a series of cowboy detective memoirs based on his life as a Pinkerton operative in the Old West, travels to San Francisco to empty his sole remaining bank account. And discovers that he is now worth twelve million dollars, as the result of owning a long-forgotten block of Atlantic-Richfield stock. With his newfound wealth, Durango resolves to travel to Europe and track drown the remaining members of the vampire circus troupe who murdered his family.In Paris, meanwhile, Columbine Zwellinger (Coco), the Swiss-born young authoress who serves as editor and ghostwriter to her lecherous, syphilitic much-older husband Hugo Urbaine-Damon, is unexpectedly reunited with her long-lost twin sister, the American Zuleika (Zuzu). Both young women are the daughters of a black mother, a former circus performer, and a white Swiss doctor, now mysteriously dead. Zuzu is the freshly discovered sensation of Paris, the “Black Venus”, for her singing and “Negro” jazz-dancing act in the nude. Coco, who has passed for white all her life, envies Zuzu her freedom and longs to emulate it; however, she is constrained by feelings of responsibility for her increasingly insane husband, whom she despises, and Hugo’s mistress Minout, who lives with them.Though she is unaware of it, Coco is worshipped from afar by her newspaper delivery boy, the fifteen-year-old Willy de Groote. Willy lives with his mother and uncle, Père Rémy, the parish priest, in the presbytery of a nearby church. Uncle Rémy, a former sergeant in the French Foreign Legion, is a vampire-hunter for the Vatican and is training the diminutive Willy to succeed him. Their murder of a predatory horla, a lawless predatory breed of vampire created by the evil Maître du Monde (Master of the World), brings them to the attention of Superintendent Alphonse Jauvet of the Paris Judiciary Police, who sets out to solve the riddles posed by the crime.On his way from San Francisco to New York City, Johnny Durango is twice nearly killed by Corsican assassins, whom he suspects are vampires; in both cases, he and his newly engaged “secketary”, Emmeline Parry, barely manage to escape with their lives. Once aboard the Berengaria, he embarks on an affaire with a married Frenchwoman, Berthe Hadley, the younger sister of Superintendant Jauvet. Zuzu, making the round of Paris’ night clubs with her many lovers, is introduced to the eccentric Baron Emile Warburg, the wealthiest man in France, and his business partner the Marchesa dell’Ogg, who runs the exclusive brothel, La Bagne Rose, reputedly a club for vampires.The battle lines between the vampires and the vampire-hunters are being drawn. Willy’s uncle Rémy is shot through the lung by the vampire they have stalked and killed, and lies gravely wounded in his bedroom at the presbytery. Finding the key to a hotel room in the dead vampire’s pocket, Willy burgles his effects and finds a cache of diamonds. With these he plans to rescue Coco from her husband.Both Warburg and the Contessa do the bidding of the Master, who is the oldest vampire left alive in the world. And the Master, who has been in Bavaria grooming the young horla, Adolf Hitler, has plans for Coco and Zuzu, who are unknowingly doomed by their genetic heritage to become vampires themselves…",
  "genres": [],
  "author": "Rod Kierkegaard Jr.",
  "average_rating": "3.14",
  "url": "https://www.goodreads.com/book/show/27254874-the-vampire-circus"
}