{
  "title": "GIANTS OF MARS",
  "description": "A Science Fiction Dystopian Action Romantic Journey.  NOT A STAND ALONE! Please read Rebel Lexis (Rings of Polaris Book 1) for full enjoyment.  Giants of Mars: Science Fiction/Dystopian Masterpiece Pits Maverick Spaceship Captain against Seductive, Alluring & Possibly Deadly AI Computer System. Masterfully crafted by Paul Alan, the second volume in the celebrated new ‘Rings of Polaris’ series fuses sci-fi, dystopian fiction, action and erotica – in an adventure giving Arthur C. Clarke a run for his money. Readers are invited to strap in with Captain Jason Bjorn on a mission to Mars. But Bjorn’s white-hot love for a virtual reality companion and the constant sexual advances from his onboard AI computer system are about to cause a distraction that could leave him dead... While nobody will deny science fiction’s timeless popularity, both readers and critics are currently crying out for wholly-unique new narratives that don’t succumb to recycling of the “same old” concepts. Thankfully, Paul Alan has stepped up to the plate with gusto, serving up a compelling new series that melds traditional sci-fi hallmarks with palm-sweating erotica. …Sexual encounters with virtual reality companions, that is! ‘Rebel Lexis’ may not follow convention, but Alan’s creation is rapidly building up a following among those who fell in love with Joseph Kosinski’s ‘Oblivion’ and the groundbreaking ‘2001: A Space Odyssey’. It’s easy to see why. Synopsis: Jason Bjorn just wants to do his job and captain his ship, but when his employer—The Polaris Corporation—sends him to Mars where he encounters treachery, an ancient cult, and secrets that strike at the heart of Polaris’ control over the planet Earth. Soon, fighting to stay alive is the least of his worries as he finds himself at the center of a conflict that could change everything with nobody on his side but the seductively independent operating system that runs his ship. “While of course rooted in science fiction, this series is deeply invested in the romance and emotional side of its main players,” explains Alan. “Captain Bjorn is smitten with Rebel Lexis and finds it hard to refuse the suggestions of her– but when their loyalty dies and he’s left to fend for himself, he has to learn who he can trust, when he can trust them and if they can provide any hope for him staying alive. You won’t find anything as unique as this in any other novel out there.” Continuing, “I wanted to build on Arthur C. Clarke’s notion of a creative and mysterious AI computer system that, while exhibiting human emotions, can react in the most unlikely and unpredictable ways. I admit that I took a risk with this format, but initial feedback has been overwhelmingly positive.” Alan isn’t exaggerating. For example, J&R Michaels say's, \"Giants of Mars is the second book in Paul Alan's series, and I'm looking forward to the third installment. I think ever man alive is now in love with Lexis, who is the beautiful SYN, who stole the heart of ship captain, Jason Bjorn at the end of the first novel, Rebel Lexis. The first book was a fast moving story that made me melancholy as I read about things of today that no longer exist in the futuristic universe...I am always amazed by the twists and turns, author Alan gives us readers.\"  For more information on ‘Giants of Mars’, from P. Rebog Productions, visit the official website at: http://www.rebellexis.com/  TAGS: Books > Science Fiction & Fantasy > Science Fiction > Dystopian > Future Kindle Store > Kindle eBooks > Science Fiction & Fantasy > Science Fiction",
  "genres": [],
  "author": "Paul Alan",
  "average_rating": "4.53",
  "url": "https://www.goodreads.com/book/show/27258050-giants-of-mars"
}