{
  "title": "Marked Men Complete Collection",
  "description": "The complete Marked Men Collection - six scorching reads: Rule, Jet, Rome, Nash, Rowdy and Asa!RULE: Shaw is a good girl and should know better than to get involved with a guy like Rule. Rule is the guy your mother always warned you about: he’s used to getting everything he wants yet even he knows that beautiful Shaw is strictly off limits. But what if what you want is exactly what you need?JET: Ayden is a good Southern girl, from the tips of her cowboy boots to the depths of her country music soul. With a troubled childhood behind her, all she wants is a normal life – and a bad boy like Jet is definitely not in the plan. But what happens when the bad boy picks you?ROME: Cora hides a heart that’s been mistreated too many times and she wants nothing less than ‘perfect’. Rome is as far from perfect as can be. Rigid and uncompromising, he’s returned from his final tour of duty a broken man. In the search for perfect, imperfection might just be what they need…NASH: Nash is reeling from a long-held family secret and needs something to hold on to – and the nurse with the beautiful grey eyes seems familiar… Saint knew Nash way back when and she can’t tell if he’s the same guy who made her life hell, who she vowed never to forgive. Trouble is, Nash is impossible to stay away from…ROWDY: After his first broken heart, Rowdy decided life was all about the good times. But when a ghost from the past appears, he questions everything he thought he knew about love. Salem left her unhappy childhood behind as soon as she could, but she never forgot the boy next door…ASA: Royal is a cop, first and foremost, so when a call-out goes wrong, she finds herself suspended from the job, seeking solace in oblivion. Asa spent his life on the wrong side of the law, but a near death experience left him rebuilding his life. On paper, the cop and the con seemed doomed to heartbreak – but when love has stolen your heart, how can you walk away?",
  "genres": [
    "Romance"
  ],
  "author": "Jay Crownover",
  "average_rating": "4.58",
  "url": "https://www.goodreads.com/book/show/27262418-marked-men-complete-collection"
}