{
  "title": "Green Chic: Saving the Earth in Style",
  "description": "\"Matheson slyly steers us toward consumer goods and services that minimize our earth-stomping human footprint. She's brave enough to say 'buy less of everything, ' and even the politically fraught 'buy nothing.' Matheson's genius is to make this seem not only doable, but fun.\"- Elizabeth Royte, author of Garbage Land and Bottlemania Want to go green without giving up great style? Welcome to the world of Green Chic. Choosing to be green makes a real difference in the fight against global warming. But did you know that it's also hip, classic and stylish? Offering up dozens of author-tested, earth-friendly ideas, writer Christie Matheson reveals that being chic and saving the planet aren't mutually exclusive. Embrace the fabulousness of green living and you can: - Look gorgeous - Have a killer wardrobe- Feel amazing- Travel in style- Create a home that's an oasis- Host fun parties- Eat incredible food and drink phenomenal wine... All while feeling more connected to your friends, family and nature. (And did we mention that green women don't get fat?) Printed on recycled paper, with a portion of its proceeds going to a green cause, Green Chic is the perfect book for style-savvy readers with a green heart. Can living a chic green lifestyle TRULY make a difference to the planet? You bet your organic cotton sheets it can. Buying into the Green Chic movement doesn't mean you need to buy more stuff.Avoid products that purport to be green just for the marketing effect: \"organic\" processed foods; huge, gas-guzzling hybrid SUVs; clothes boasting that they're green just because they're made from \"natural\" cotton. Claiming to be green is trendy and companies out there are taking advantage. Don't believe all the hype. 10 GREEN CHIC-AND EASY-WAYS TO MAKE A DIFFERENCE- Ditch bottled water: refill a sassy thermos. - Pop little purchases in your purse, not a shopping bag.- Sip biodynamic wine.- Choose cashmere, not acrylic. - Let your hair air dry for a while before you blow dry: less frizz, less energy consumed.- Unplug (and put away) unsightly cell phone chargers.- Opt for quality over quantity in everything you buy.- Cut down on clutter.- Limit your consumption of anything packaged in plastic.- Support local designers. BUT REMEMBER: Don't go out and replace everything you own, from your makeup to your wardrobe to your furniture, with (theoretically) ecofriendly products. Being ecofriendly means consuming less, not more. Get in the habit of thinking before you buy. The best time to purchase ecofriendly goods is when you need them. That's when you're in a position to make a choice and express yourself as a green consumer. Being Green isn't a fad ... it's timelessly chic.",
  "genres": [
    "Nonfiction",
    "Green",
    "Environment"
  ],
  "author": "Christie Matheson",
  "average_rating": "3.57",
  "url": "https://www.goodreads.com/book/show/2726462-green-chic"
}