{
  "title": "America's War for the Greater Middle East",
  "description": "LONGLISTED FOR THE NATIONAL BOOK AWARD • A searing reassessment of U.S. military policy in the Middle East over the past four decades from retired army colonel and New York Times bestselling author Andrew J. Bacevich From the end of World War II until 1980, virtually no American soldiers were killed in action while serving in the Greater Middle East. Since 1990, virtually no American soldiers have been killed in action anywhere else. What caused this shift? Andrew J. Bacevich, one of the country’s most respected voices on foreign affairs, offers an incisive critical history of this ongoing military enterprise—now more than thirty years old and with no end in sight. During the 1980s, Bacevich argues, a great transition occurred. As the Cold War wound down, the United States initiated a new conflict—a War for the Greater Middle East—that continues to the present day. The long twilight struggle with the Soviet Union had involved only occasional and sporadic fighting. But as this new war unfolded, hostilities became persistent. From the Balkans and East Africa to the Persian Gulf and Central Asia, U.S. forces embarked upon a seemingly endless series of campaigns across the Islamic world. Few achieved anything remotely like conclusive success. Instead, actions undertaken with expectations of promoting peace and stability produced just the opposite. As a consequence, phrases like “permanent war” and “open-ended war” have become part of everyday discourse. Connecting the dots in a way no other historian has done before, Bacevich weaves a compelling narrative out of episodes as varied as the Beirut bombing of 1983, the Mogadishu firefight of 1993, the invasion of Iraq in 2003, and the rise of ISIS in the present decade. Understanding what America’s costly military exertions have wrought requires seeing these seemingly discrete events as parts of a single war. It also requires identifying the errors of judgment made by political leaders in both parties and by senior military officers who share responsibility for what has become a monumental march to folly. This Bacevich unflinchingly does. A twenty-year army veteran who served in Vietnam, Andrew J. Bacevich brings the full weight of his expertise to this vitally important subject. America’s War for the Greater Middle East is a bracing after-action report from the front lines of history. It will fundamentally change the way we view America’s engagement in the world’s most volatile region. Praise for America’s War for the Greater Middle East“Bacevich is thought-provoking, profane and fearless. . . . [His] call for Americans to rethink their nation’s militarized approach to the Middle East is incisive, urgent and essential.”—The New York Times Book Review “Bacevich’s magnum opus . . . a deft and rhythmic polemic aimed at America’s failures in the Middle East from the end of Jimmy Carter’s presidency to the present.”—Robert D. Kaplan, The Wall Street Journal“A critical review of American policy and military involvement . . . Those familiar with Bacevich’s work will recognize the clarity of expression, the devastating directness and the coruscating wit that characterize the writing of one of the most articulate and incisive living critics of American foreign policy.”—The Washington Post “[A] monumental new work.",
  "genres": [
    "History",
    "Politics",
    "Nonfiction",
    "War",
    "Military Fiction",
    "Military History",
    "American History"
  ],
  "author": "Andrew J. Bacevich",
  "average_rating": "4.24",
  "url": "https://www.goodreads.com/book/show/27272125-america-s-war-for-the-greater-middle-east"
}