{
  "title": "At the Water's Edge",
  "description": "NEW YORK TIMES BESTSELLERIn this thrilling new novel from the author of Water for Elephants, Sara Gruen again demonstrates her talent for creating spellbinding period pieces. At the Water’s Edge is a gripping and poignant love story about a privileged young woman’s awakening as she experiences the devastation of World War II in a tiny village in the Scottish Highlands.\n\n\nAfter disgracing themselves at a high society New Year’s Eve party in Philadelphia in 1944, Madeline Hyde and her husband, Ellis, are cut off financially by his father, a former army colonel who is already ashamed of his son’s inability to serve in the war. When Ellis and his best friend, Hank, decide that the only way to regain the Colonel’s favor is to succeed where the Colonel very publicly failed—by hunting down the famous Loch Ness monster—Maddie reluctantly follows them across the Atlantic, leaving her sheltered world behind.    The trio find themselves in a remote village in the Scottish Highlands, where the locals have nothing but contempt for the privileged interlopers. Maddie is left on her own at the isolated inn, where food is rationed, fuel is scarce, and a knock from the postman can bring tragic news. Yet she finds herself falling in love with the stark beauty and subtle magic of the Scottish countryside. Gradually she comes to know the villagers, and the friendships she forms with two young women open her up to a larger world than she knew existed. Maddie begins to see that nothing is as it first appears: the values she holds dear prove unsustainable, and monsters lurk where they are least expected.   As she embraces a fuller sense of who she might be, Maddie becomes aware not only of the dark forces around her, but of life’s beauty and surprising possibilities.Praise for At the Water’s Edge “Breathtaking . . . a daring story of adventure, friendship, and love in the shadow of WWII.”—Harper’s Bazaar  “A gripping, compelling story . . . Gruen’s characters are vividly drawn and her scenes are perfectly paced.”—The Boston Globe   “A page-turner of a novel that rollicks along with crisp historical detail.”—Fort Worth Star-Telegram   “Powerfully evocative.”\n—USA Today\n  “Gruen is a master at the period piece—and [this] novel is just another stunning example of that craft.”—Glamour   “A captivating tale.”\n—Us Weekly\n  “Compulsively readable . . . a rich, beautiful novel . . . at once a gripping love story, a profound examination of the effects of war on ordinary women, and a compelling portrait of female friendship.”—Kristin Hannah   “Utterly winning.”\n—The Miami Herald\n  “A compelling, enthralling read, a novel which captivates and rewards, paying off in a series of emotional and narrative twists . . . comfort reading of the highest order.”\n—The Globe and Mail\n  “A super steamy love story.”\n—Good Housekeeping\n  “Unique in its setting and scope, this impeccably researched historical fiction is full of the gorgeous prose I’ve come to expect from this author.”—Jodi Picoult   “[Gruen] conveys the lure of the Scottish Highlands. . . . At the Water’s Edge captivates with its drama, intrigue and glimpses of both the dark and light of humanity.”—BookPageFrom the Hardcover edition.",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Book Club",
    "Romance",
    "Historical",
    "Audiobook",
    "Scotland"
  ],
  "author": "Sara Gruen",
  "average_rating": "3.68",
  "url": "https://www.goodreads.com/book/show/27272239-at-the-water-s-edge"
}