{
  "title": "The Perfect Pass: American Genius and the Reinvention of Football",
  "description": "A Kirkus Reviews Best Nonfiction Book of the YearIn the tradition of Michael Lewis’s Moneyball , award-winning historian S.C. Gwynne tells the incredible story of how two unknown coaches revolutionized American football at every level, from high school to the NFL.Hal Mumme is one of a handful of authentic offensive geniuses in the history of American football. The Perfect Pass is the story of how he irreverently destroyed and re-created the game.Mumme spent fourteen mostly losing seasons coaching football before inventing a potent passing offense that would soon shock players, delight fans, and terrify opposing coaches. The revolution he fomented began at a tiny, overlooked college called Iowa Wesleyan, where Mumme was head coach and Mike Leach, a lawyer who had never played college football, was hired as his offensive line coach. In the cornfields of Iowa, while scribbling plays on paper napkins, these two mad inventors, drawn together by a shared disregard for conventionalism and a love for Jimmy Buffett, began to engineer the purest, most extreme passing game in the 145-year history of football. Implementing their “Air Raid” offense, their teams—at Iowa Wesleyan and later at Valdosta State and the University of Kentucky—played blazingly fast—faster than any team ever had before, and they routinely beat teams with far more talented athletes. And Mumme and Leach did it all without even a playbook. Their quarterback once completed sixty-one of eighty-six passes, both collegiate records.In The Perfect Pass , S.C. Gwynne explores Mumme’s leading role in changing football from a run-dominated sport to a pass-dominated one, the game that tens of millions of Americans now watch every fall weekend. Whether you’re a casual or ravenous football fan, this is a truly compelling story of American ingenuity and how a set of revolutionary ideas made their way from the margins into the hot center of the game we celebrate today.",
  "genres": [
    "Sports",
    "Football",
    "Nonfiction",
    "Biography",
    "Audiobook",
    "History",
    "American History"
  ],
  "author": "S.C. Gwynne",
  "average_rating": "4.39",
  "url": "https://www.goodreads.com/book/show/27276309-the-perfect-pass"
}