{
  "title": "In the Forest of Light and Dark",
  "description": "With one look at her, you would think that Cera Singer from Saraland, Alabama is your typical teenage girl from a rural Southern Gulf town. That is, she faces all the problems you would expect a seventeen-year-old would face; boys, drugs, fitting in, her upcoming senior year, and on top of that getting her first car on the road. But what Cera doesn't know yet is what will ultimately set Cera apart from all the other girls her age. Cera is a witch. In this supernatural thriller, you’ll be taken along as Cera recounts her experiences in her memoir of how she discovered that the women in her mama’s family lineage were actually a long line of witches responsible for the protection of her new home and community. As Cera writes she will explain to you how her honest curiosity along with her rebellious, down-to-earth nature quickly got her into more than she could handle, mentally and physically, as she uncovers the many deep and well-hidden layers in her relationships with her mother and grandmother. After the BP Deepwater Horizon oil spill shut down the fishing industry in the Gulf causing Cera’s Step Daddy Cade to lose his job, Cera and her parents find themselves in dire straits when they learn that their local bank is planning to foreclose on their home. Now just when Murphy's Law seems to be at its all-time worst for Cera and her family, news comes that Cera's grandmother, Lyanna Barrett, has passed. But soon, Cera and her family quickly find out her passing isn't all bad news. In an inheritance letter that Cera's mama (Janine) receives in the weeks that follow her mother’s death, she is informed that she is to receive all of her mother’s assets which are to include a house in New York, a new Cadillac, and a substantial amount of cold, hard cash. Reluctant to leave Saraland and move back to New York, Cera's mama is torn but sees no other option other than accepting the inheritance that her mother bequeathed to her and make a fresh start back in her place of birth, Mount Harrison. After arriving in Mt. Harrison, a picturesque, little Western New York village nestled in a valley below the forest covered mountain from which it gets its name—Cera quickly comes to the understanding as to why her mama, at age eighteen, had elected to run away from her home and head for the Deep South. Nearly all the village’s residence, acting under a curse put upon them by Abellona Abbott (a three-hundred-year-old witch that still resides in the forest atop Mt. Harrison and takes the embodiment of her teenage former self) treats Cera and her mama with utter contempt for bringing the Barrett bloodline back into the village and thereby angering Abellona Abbott even further because of a grudge the witch still carries against the Barrett family that stretches back to the time of her death. As Cera and her family try their best to settle into their new home and community, Cera immediately finds out, even before her very first day at her new school, that she along with her mama are not going to be welcomed in their new village which quickly becomes evident to Cera by the lack of acceptance she receives from several of her new classmates and her neighbor’s disdainful attitudes towards her and her family. If Cera hopes to survive her senior year of high school, then together with the help of another village outcast named Katelyn, she has to piece together her family’s history in Mt. Harrison in connection with Abellona Abbott and develop her newly found magic skills before it’s too late. In the Forest of Light and Dark IS IN NO WAY A CHILDREN'S BOOK!!!",
  "genres": [
    "Thriller"
  ],
  "author": "Mark Kasniak",
  "average_rating": "4.33",
  "url": "https://www.goodreads.com/book/show/27275052-in-the-forest-of-light-and-dark"
}