{
  "title": "The Underground Knowledge Series I-V",
  "description": "Discover what has been hidden from you... Introducing the boxed set containing the first five books in The Underground Knowledge Series by James Morcan & Lance Morcan. THE UNDERGROUND KNOWLEDGE SERIES I-V comprises the following books: GENIUS INTELLIGENCE ANTIGRAVITY PROPULSION MEDICAL INDUSTRIAL COMPLEX THE CATCHER IN THE RYE ENIGMA INTERNATIONAL BANKSTER$ Garnering evidence from court cases, declassified government files and media reports, The Underground Knowledge Series discloses little-known facts on a wide range of topics. GENIUS INTELLIGENCE: Secret Techniques and Technologies to Increase IQ This book (with foreword by leading scientist Dr. Takaaki Musha) shatters the myth that geniuses are born not developed. It reveals how most instances of above-the-ordinary intelligences are acquired thru superior cognitive techniques or brain enhancing technologies. Drawing on the latest findings in neuroscience, it lists dozens of practical methods to increase IQ and speed-learn any subject. Among the discoveries shared are brain waves common to geniuses and various ways to induce those brain waves. ANTIGRAVITY PROPULSION: Human or Alien Technologies? A far-reaching exploration into the UFO phenomenon (with foreword by advanced interstellar propulsion systems expert Grant Hayman and afterword by leading scientist Dr. Takaaki Musha) that covers all possible scenarios and discounts nothing. It includes never-before-mentioned accounts of popular UFO topics like Area 51, Roswell and alien abduction claims, and lesser known subjects such as Nazi and Japanese antigravity experiments. MEDICAL INDUSTRIAL COMPLEX: The $ickness Industry, Big Pharma and Suppressed Cures An explosive book (with afterword by retired pharmacist Denis Toovey) that explores the contention Big Pharma and other participants in the healthcare sector put profits ahead of patients’ wellbeing and dollars ahead of lives. This no-holds barred critique of mainstream medicine urges readers to stop giving away complete responsibility to doctors and other healthcare providers, and to take more responsibility for their own health. THE CATCHER IN THE RYE ENIGMA: J.D. Salinger's Mind Control Triggering Device or a Coincidental Literary Obsession of Criminals? This book unearths the mysteries surrounding arguably the most controversial book of all time – J.D. Salinger’s 1951 novel The Catcher in the Rye. It examines the theory that, in league with the CIA, coded messages were implanted in that novel, inspiring some of the most infamous crimes of the 20th Century…including the murder of John Lennon and the attempted assassination of President Reagan. INTERNATIONAL BANKSTER$: The Global Banking Elite Exposed and the Case for Restructuring Capitalism This book identifies who is responsible for the gigantic financial gulf that separates the top 1% of the population from the common people, or the 99%. The financial overlords named and shamed include the powerbrokers at Wall Street banks, European central banks, the US Federal Reserve and the Vatican Bank, as well as elite banking dynasties. The authors also propose ideas for creating a fairer economic system.",
  "genres": [
    "Nonfiction",
    "Science",
    "Politics",
    "History",
    "Conspiracy Theories"
  ],
  "author": "James Morcan",
  "average_rating": "4.30",
  "url": "https://www.goodreads.com/book/show/27276028-the-underground-knowledge-series-i-v"
}