{
  "title": "When We Meet Again",
  "description": "Emily thinks she's lost everything . . . until a mysterious painting leads her to what she wants most in the world. The new novel from the author of international bestsellers The Sweetness of Forgetting and The Life Intended shows why her books are hailed as \"engaging\" ( People ), \"absorbing\" ( Kirkus Reviews ) and \"enthralling\" (Fresh Fiction).Emily Emerson is used to being alone; her dad ran out on the family when she was just a kid, her mom died when she was seventeen, and her beloved grandmother has just passed away as well. But when she's laid off from her reporting job, she finds herself completely at sea . . . until the day she receives a beautiful, haunting painting of a young woman standing at the edge of a sugarcane field under a violet sky. That woman is recognizable as her grandmother—and the painting arrived with no identification other than a handwritten note saying, \"He always loved her.\"Emily is hungry for roots and family, so she begins to dig. And as she does, she uncovers a fascinating era in American history. Her trail leads her to the POW internment camps of Florida, where German prisoners worked for American farmers . . . and sometimes fell in love with American women. But how does this all connect to the painting? The answer to that question will take Emily on a road that leads from the sweltering Everglades to Munich, Germany, and back to the Atlanta art scene before she's done.Along the way, she finds herself tempted to tear down her carefully tended walls at last; she's seeing another side of her father, and a new angle on her painful family history. But she still has secrets, ones she's been keeping locked inside for years. Will this journey bring her the strength to confront them at last?",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Romance",
    "World War II",
    "Historical",
    "Audiobook",
    "Mystery"
  ],
  "author": "Kristin Harmel",
  "average_rating": "4.20",
  "url": "https://www.goodreads.com/book/show/27276412-when-we-meet-again"
}