{
  "title": "Black Lotus: A Woman's Search for Racial Identity",
  "description": "A unique and exquisitely wrought story of one multiracial woman’s journey to discover and embrace herself in a family that sought to deny her black heritage, Sil Lai Abrams shares her story in Black A Woman’s Search for Racial Identity —an account that will undoubtedly ignite conversation on race, racial identity, and the human experience.Author and activist Sil Lai Abrams was born to a Chinese immigrant mother and a white American father. Out of her family, Sil Lai was the only one with a tousle of wild curls and brown skin. When she asked about her darker complexion, she was given vague answers. At fourteen, the man she knew her entire life as her birth-father divulged that Abrams was not his biological child, but instead the daughter of a man of African descent who didn’t know she existed.This shocking news sparked a quest for healing that would take her down the painful road to reclaim her identity despite the overt racism in her community and her own internalized racism and self-hatred. Abrams struggled with depression, abuse, and an addiction that nearly destroyed her. But eventually she would leave behind the shame over her birthright and move toward a celebration of her blackness.In Black Lotus , Abrams takes you on her odyssey filled with extreme highs and lows and the complexities of not only the black experience, but also the human one. This vivid story reexamines everything you think you know about racial identity while affirming the ability of the human spirit to triumph over tragedy. Ultimately, Black Lotus shines a light on the transformative power of truth and self-acceptance, and the importance of defining your personal identity on your own terms.",
  "genres": [
    "Memoir",
    "Nonfiction",
    "Biography Memoir",
    "Race",
    "African American",
    "Biography",
    "Cultural"
  ],
  "author": "Sil Lai Abrams",
  "average_rating": "3.85",
  "url": "https://www.goodreads.com/book/show/27276451-black-lotus"
}