{
  "title": "84 Charing Cross Road",
  "description": "(This edition contains both \"84 Charing Cross Road\" & \"The Duchess of Bloomsbury Street\")\"84, Charing Cross Road\" is a charming record of bibliophilia, cultural differences, and imaginative sympathy. For 20 years, an outspoken New York writer and a rather more restrained London bookseller carried on an increasingly touching correspondence. In her first letter to Marks & Co., Helene Hanff encloses a wish list, but warns, \"The phrase 'antiquarian booksellers' scares me somewhat, as I equate 'antique' with expensive.\" Twenty days later, on October 25, 1949, a correspondent identified only as FPD let Hanff know that works by Hazlitt and Robert Louis Stevenson would be coming under separate cover. When they arrive, Hanff is ecstatic - but unsure she'll ever conquer \"bilingual arithmetic.\" By early December 1949, Hanff is suddenly worried that the six-pound ham she's sent off to augment British rations will arrive in a kosher office. But only when FPD turns out to have an actual name, Frank Doel, does the real fun begin.Two years later, Hanff is outraged that Marks & Co. has dared to send an abridged Pepys diary. \"I enclose two limp singles, I will make do with this thing till you find me a real Pepys. THEN I will rip up this ersatz book, page by page, AND WRAP THINGS IN IT.\" Nonetheless, her postscript asks whether they want fresh or powdered eggs for Christmas. Soon they're sharing news of Frank's family and Hanff's career.\"The Duchess of Bloomsbury Street\" is a memoir of the author's visit to London following the publication of \"84 Charing Cross Road.\" It is based on diary entries written during her stay and chronicles the events she attended, the people she met, and her impressions of a city she had long dreamed of experiencing.",
  "genres": [
    "Nonfiction",
    "Books About Books",
    "Memoir",
    "Biography",
    "Book Club",
    "Audiobook",
    "Biography Memoir"
  ],
  "author": "Helene Hanff",
  "average_rating": "4.16",
  "url": "https://www.goodreads.com/book/show/2727537-84-charing-cross-road"
}