{
  "title": "Alliance of Equals",
  "description": "A new novel in the popular and exciting science fiction Liaden Universe® series. Over a half million Liaden Universe® books sold with an audience that keeps growing!Beset by the angry remnants of the Department of the Interior, challenged at every turn by opportunists on their new homeworld of Surebleak, and somewhat low on funds, Clan Korval desperately needs to reestablish its position as one of the top trading clans in known space. To this end, Master Trader Shan yos'Galan, aboard Korval's premier trade ship, Dutiful Passage, is on a mission to establish new business associations and to build a strong primary route that links well with existing Loops and secondary routes.But reestablishing trade and preserving the lives of the few remaining members of the clan aren't all of Korval's problems. Matters come to a head as Dutiful Passage , accustomed to being welcomed and feted at those ports on its call-list, finds itself denied docking, and blacklisted, while agents of the DOI mount armed attacks on others of Korval's traders, under the very eyes of port security systems.Traveling with Dutiful Passage on this unsettling journey is Padi yos'Galan, the master trader's heir and his apprentice. Padi is eager to make up for time lost due to Korval's unpleasantness with the Department of the Interior. She is also keeping a secret so intense that her coming of age, and perhaps her very life, is threatened by it.About Alliance of Equals :\" . . . continues to delight with genteel interactions between mild-spoken characters who are capable of great passions and swift actions, and its immense scope encompasses a well-realized and comfortable universe.\"— Publishers WeeklyAbout series prequel Dragon in Exile :“[S]prawling and satisfying. . . . Space opera mixes with social engineering, influenced by Regency-era manners and delicate notions of honor. . . . [I]t’s like spending time with old friends . . .”— Publishers WeeklyAbout Necessity's Child :“Compelling and wondrous, as sharp and graceful as Damascus steel, Necessity's Child is a terrific addition to Lee & Miller's addictive series.”—#1 New York Times best seller, Patricia BriggsAb out the Liaden Universe® “Every now and then you come across an author, or in this case, a pair, who write exactly what you want to read, the characters and personalities that make you enjoy meeting them. . . . I rarely rave on and on about stories, but I am devoted to Lee and Miller novels and stories.”—Anne McCaffrey“These authors consistently deliver stories with a rich, textured setting, intricate plotting, and vivid, interesting characters from fully-realized cultures, both human and alien, and each book gets better.”—Elizabeth Moon“[D]elightful stories of adventure and romance set in a far future. . .space opera milieu. It’s all a rather heady mix of Gordon R. Dickson, the Forsythe Saga, and Victoria Holt, with Lee and Miller’s own unique touches making it all sparkle and sizzle. Anyone whose taste runs toward SF in the true romantic tradition can’t help but like the Liaden Universe.”— Analog“[T]he many fans of the Liaden universe will welcome the latest…continuing young pilot Theo Waitley’sadventures.”— Booklist on Saltation“[A]ficionados of intelligent space opera will be thoroughly entertained. . .[T]he authors' craftsmanship is top-notch.”— Publishers Weekly on Lee and Miller’s popular Liaden Universe® thriller, I Dare",
  "genres": [
    "Science Fiction",
    "Space Opera",
    "Fiction",
    "Fantasy",
    "Science Fiction Fantasy",
    "Adventure",
    "Romance"
  ],
  "author": "Sharon Lee",
  "average_rating": "4.32",
  "url": "https://www.goodreads.com/book/show/27276247-alliance-of-equals"
}