{
  "title": "The James Boys: A Novel Account of Four Desperate Brothers",
  "description": "A provocative and strikingly original new voice in fiction reinvents the historical novel–along with American history itself–in this wry “what if?” that merges and mashes up four of our most famous and infamous national icons.Historian Otis Pease once remarked that the story of nineteenth-century America could be encompassed in the lives of the two sets of James brothers–William and Henry in the East, Frank and Jesse in the West. The James Boys goes further by making all four of them the fruit of the same family tree and showing how it shakes out.In 1876, the No. 4 Missouri Pacific Express pulls out of Kansas City for Saint Louis. Among those on board is Henry James, the erudite and esteemed novelist and brother of the brilliant philosopher William James. Trying his hand at travel writing, Henry is beset, as ever, by hypochondria–in the form, this case, of dire digestive woes.Suddenly, the train is stopped and robbed–and not by just any bandits but by the legendary James Gang. Taken hostage by the brigands, Henry realizes to his unspeakable horror that Jesse and Frank are in fact “Rob” and “Wilky,” his long-lost brothers, who had disappeared during the Civil War and been presumed dead for more than a decade.From there the ride only gets wilder, careening through underbrush and ivory towers, throwing together America’s greatest intellectuals and most notorious outlaws in a saga of six-guns and sherry that is peopled by a fascinating roster of passengers, both historical and imagined. Most prominent among them are Elena Hite, a feisty young feminist deeply aroused by the down-and-dirty charisma of the criminal Jesse; Alice Gibbens, the eminently sensible schoolteacher engaged to the sexually inexperienced William, who tempts him to stay put rather than joining Henry out West; and William Pinkerton, the renowned detective hot on all of their trails–especially Elena’s.Based on and incorporating actual events, The James Boys is a through-the-looking-glass romp that boldly blends both sides of the American character–the brilliant and the barbaric–in one unforgettable family and one seriously entertaining story.From the Hardcover edition.",
  "genres": [
    "Historical Fiction"
  ],
  "author": "Richard Liebmann-Smith",
  "average_rating": "2.98",
  "url": "https://www.goodreads.com/book/show/2728337-the-james-boys"
}