{
  "title": "Mastodonia",
  "description": "In rural Wisconsin, wonder clashes dangerously with corporate greed when an alien visitor opens up a gateway through time into a breathtaking prehistoric lost worldOn sabbatical from teaching at a small university, paleontologist Asa Steele is content to relax amidst the pastoral splendor of his Wisconsin farm. That is, until his dog starts bringing home unrecognizable artifacts and, strangest of all, fresh dinosaur bones. Since boyhood, Asa has heard the rumors of a UFO crash site nearby, and his encounter with a cat-faced alien life form proves the old story to be shockingly true. A gregarious immortal stranded on Earth for fifty thousand years, Catface has the power to create portals in time, and now he has opened a gateway into a prehistoric world of wonder and beauty, a place Asa calls “Mastodonia.” But keeping this idyllic realm a secret from a prying government and the greedy corporate entities it serves could prove impossible—and perilous—when there are resources to drain, land to despoil, and gargantuan vanished beasts from a distant age to hunt down and destroy in the name of profit. Clifford D. Simak’s glorious vision of a gateway to the past and of the tantalizing commercial potential of all things prehistoric predates Michael Crichton’s Jurassic Park by many years, yet it remains as provocative, enthralling, and fun for twenty-first-century science fiction lovers as it was for its original readers. Breathtaking, thrilling, imaginative, and awe-inspiring, Mastodonia is a world that, once entered, can never be forgotten, such is the unique creative genius of legendary science fiction Grand Master Simak, one of the most revered writers ever to dream the future . . . and the past.",
  "genres": [
    "Science Fiction",
    "Time Travel",
    "Fiction",
    "Fantasy",
    "Science Fiction Fantasy",
    "Dinosaurs",
    "Prehistoric"
  ],
  "author": "Clifford D. Simak",
  "average_rating": "3.71",
  "url": "https://www.goodreads.com/book/show/27277482-mastodonia"
}