{
  "title": "With Visions of Red",
  "description": "This is a dark erotic thriller series intended for adult audiences.\n\nPassion and lust ignite. Dark and light battle. This explosive first installment of the Broken Bonds series sets the exhilarating pace for a cat and mouse game where no one knows who's really pulling the strings.Book One: Criminal profiler Sadie Bonds knows blood. Her affair with the gruesome, dark world of killers began long before she started applying her analytical skills to investigate gory crime scenes. She gets inside the killers' heads, breaks them down, relates to them on an arcane level. She prefers it this way--because it's safer to ally herself with the villain than the victim. At least, that's how she's coped ever since she was abducted and tortured as a teen.She will never be a victim again.Now, she's honed her skills in order to bring justice to these ritualistic offenders. Working alongside her colleagues, armed with sharp wit and a SIG, Sadie always catches her sadist. Until one ruthless serial killer gets inside Sadie's head, turning the tables. He knows her secrets. Her obsessions. The darkest, most deviant part of her soul.When she meets Colton Reed, dangerous stakes are raised as he threatens to unravel her control and reveal her darkest fantasies. The sexy-as-sin bondage rigger at an exclusive BDSM club pushes her boundaries, forcing her to acknowledge that side of herself she fears. Plunged into a realm of torture and suffering, pain and pleasure, Sadie balances on the razor-sharp edge of two intersecting worlds threatening to swallow her.  Book Two: The UNSUB has made contact.  After a rapid string of grisly murders shakes the usually peaceful city of Arlington, Virginia, the sadistic killings of young women lull into a deceptive calm. Agent Sadie Bonds knows the terror isn’t over; serial killers don’t stop until caught.  And this sadist has targeted the profiler, revealing pieces of her dark past and weaving her secrets into each gruesome crime scene. Is the killer someone from Sadie’s past, her present? Or is he part of a fated future she brought on herself? The answer lies within the riddle of the copycat killings, ones mimicked after the infamous Blood Countess.  As tension brews in the department awaiting the UNSUB’s next move, Sadie’s more than on edge—her deviant cravings for the possible perpetrator have ratcheted out of control. She needs the feel of Colton’s ropes binding her, sheltering her from stark reality.  Only Colton Reed has his own twisted secrets that threaten to unravel not only Sadie as they come to light, but the UNSUB’s carefully constructed web now entangling both the profiler and her sexy bondage rigger.  Book Three: Who is the UNSUB? For Agent Sadie Bonds, finding the answer to that question means the difference between life and death for someone close to her. The UNSUB’s latest abduction reaches right into the heart of the ACPD, forcing every member of the department to search within their ranks for the sadistic perpetrator.Suspicion not only clouds the task force; it slithers into Sadie and Colton’s bond, challenging their love. Discovering the truth means facing their past together. Sadie’s connection to Colton has quieted her inner demons—but is she strong enough to confront the real monster?All players take their places as the stage is set for the final scene.",
  "genres": [
    "Dark Romance",
    "Dark",
    "BDSM",
    "Suspense",
    "Audiobook",
    "Erotica",
    "Romantic Suspense"
  ],
  "author": "Trisha Wolfe",
  "average_rating": "4.27",
  "url": "https://www.goodreads.com/book/show/27281008-with-visions-of-red"
}