{
  "title": "Grotto of the Dancing Deer and Other Stories",
  "description": "Ten tales of wonder, danger, and the future--including the Hugo and Nebula Award-winning title story--from the science fiction Grand Master.This volume #4 contains ten stellar short stories by science fiction Grand Master Clifford D. Simak. In “Grotto of the Dancing Deer”, a man carrying an ancient secret finally speaks up, unable to bear any longer the loneliness he has experienced for millennia. In “Over the River” , which Simak wrote in memory of his beloved grandmother Ellen, children from an embattled future are sent back for safekeeping to their ancestors in the peaceful past. And in “Day of Truce”, the inhabitants of a suburban subdivision must barricade themselves against bands of roving attackers. On only one day each year do the gates open wide. . . .Each story includes an introduction by David W. Wixon, literary executor of the Clifford D. Simak estate and editor of this book.Contents: * The Language of Clifford D. Simak • essay by David W. Wixon * Over the River and Through the Woods (1965) / short story by Clifford D. Simak * The Grotto of the Dancing Deer(1980) / short story by Clifford D. Simak (variant of Grotto of the Dancing Deer) * The Reformation of Hangman's Gulch (1944) / novelette by Clifford D. Simak * The Civilization GamThe Grotto of the Dancing Deer (1958) / novelette by Clifford D. Simak * Crying Jag (1960) / novelette by Clifford D. Simak * Hunger Death (1938) / novelette by Clifford D. Simak * Mutiny on Mercury (1932) / novelette by Clifford D. Simak * Jackpot (1956) / novelette by Clifford D. Simak * Day of Truce (1963) / novelette by Clifford D. Simak * Unsilent Spring (1976) / novelette by Clifford D. Simak, Richard S. Simak.",
  "genres": [
    "Science Fiction",
    "Short Stories",
    "Fiction",
    "Fantasy",
    "Audiobook"
  ],
  "author": "Clifford D. Simak",
  "average_rating": "4.08",
  "url": "https://www.goodreads.com/book/show/27277484-grotto-of-the-dancing-deer-and-other-stories"
}