{
  "title": "Split: Coffin Nails MC",
  "description": "--- Split between a lust for life and a craving for death ---Astaroth. Motorcycle club president’s daughter. Virgin. Occultist.Hunter. Outlaw biker. Loves a challenge. Ex-Christian.Hunter knew he was in deep shit when a patchover went sideways, ending up with his prez dead, and him and his cousin becoming live-in hostages at the Coffin Nails MC clubhouse. What he didn’t know though, was that the girl he fucked just a few days before was the Coffin Nails club president’s daughter, set on having nothing to do with him after a creepy one-night stand in an abandoned church. Tough luck, because Hunter is not a quitter, even if getting involved with the prez's hot daughter could get him killed.Astaroth is devastated after losing the two people closest to her. Unable to connect with her grieving father, she believes that a ritual described in her late mother’s notes might hold the key to bringing back the balance in her family. During the ceremony, she needs to get pregnant by the demon she summons, but why does he have to appear in the form of a handsome, long-haired, asshole of a biker, who just doesn’t know when to give up? She never intended to see him again, but there he is, a new member of her dad’s club. And worst of all, the other man who appeared that fateful night, Hunter’s cousin, is also up for seconds. Astaroth was supposed to die in nine months, but instead, she is only beginning to feel truly alive for the first time. But no matter what she feels for the man who crashed into her life so unexpectedly, if she ever wants her family to be whole again, she needs to finish what she started. POSSIBLE SPOILERS:Themes: Outlaw motorcycle club, criminal activity, forbidden love, overprotective father, secret baby, revenge, occultGenre: New Adult erotic contemporary romance, suspense (NOT paranormal)Length: ~93,000 words (STANDALONE novel)WARNING: Adult content. Explicit sexual content, strong language, violence, and topics that might be considered taboo. Reader discretion advised.",
  "genres": [
    "Romance",
    "Dark",
    "Contemporary",
    "M F Romance",
    "Suspense",
    "Dark Romance",
    "M M Romance"
  ],
  "author": "Miss Merikan",
  "average_rating": "3.85",
  "url": "https://www.goodreads.com/book/show/27280618-split"
}