{
  "title": "The Rhino with Glue-On Shoes: And Other Surprising True Stories of Zoo Vets and their Patients",
  "description": "A moray eel diagnosed with anorexia…A herd of bison whose only hope is a crusading female doctor from Paris…A vet desperately trying to save an orphaned whale by unraveling the mystery of her mother’s death…This fascinating book offers a rare glimpse into the world of exotic animals and the doctors who care for them. Here pioneering zoological veterinarians—men and women on the cutting edge of a new medical frontier—tell real-life tales of daring procedures for patients weighing tons or ounces, treating symptoms ranging from broken bones to a broken heart, and life-and-death dramas that will forever change the way you think about wild animals and the bonds we share with them.From a root canal on a three-thousand pound hippo to one doctor’s heartbreaking effort to save a critically ill lemur, here are acts of rescue, kindness, and cross-disciplinary cooperation between zoo vets and other top scientists. We meet highly trained specialists racing against time and circumstance to save the lives of some of the most exotic animals in the world. Shoes designed for racehorses help a rhinoceros with a debilitating foot disease. A kangaroo survives spinal surgery performed by a leading human doctor. These unforgettable stories capture the bonds that develop between vets and their animal patients, the ingenious measures many vets have tried, and the remarkable new insights modern medical technology is giving us into the physiology and behaviors of wild animals.At once heart-quickening and clinically fascinating, the stories in this remarkable collection represent some of the most moving and unusual cases ever taken on by zoological vets. A chronicle of discovery, compassion, and cutting-edge medicine, The Rhino with Glue-on Shoes is must reading for animal lovers, science buffs, and anyone who loves a well-told tale.",
  "genres": [
    "Nonfiction",
    "Animals",
    "Science",
    "Short Stories",
    "Nature",
    "Memoir",
    "Biography"
  ],
  "author": "Lucy H. Spelman",
  "average_rating": "3.98",
  "url": "https://www.goodreads.com/book/show/2728511-the-rhino-with-glue-on-shoes"
}