{
  "title": "Four Years in the Rockies -- the Adventures of Isaac P. Rose--Hunter and Trapper in that Remote Region",
  "description": "\"The hunters and trappers of the far west were a brave, hardy and adventurous set of men, and they had peculiarities in their characters that cannot be found in any other people. Their character is a compound of two extremes — recklessness and caution — and isolation from the world makes them at all times self-reliant.\" No novel was ever written depicting more thrilling encounters with Indians or hair-breadth escapes than were experienced by Isaac Rose and his companions. These are fully recounted in a volume entitled, \"Four Years in the Rockies,\" the authorship of which is accredited to James B. Marsh. It is a work full of interest for all readers. Isaac P. Rose (1815-1899) was a Rocky Mountain trapper and mountain man. He was nineteen years old when he left his plough and, in company with a companion, Joe Lewis, he made his way to Pittsburg. The boys had cherished the hope of securing employment as stage drivers but, as they found no opening in that direction, they accepted berths at $15 per month as deck hands on a steamboat that was then loading for St. Louis. When they reached the latter city, Rose found employment as a hack driver in a livery stable, and Lewis a job of attending to the horses. Here the boys became acquainted with a number of \"Rocky Mountain Boys,\" as they were called, and became fascinated with their stories of mountain life, of fights with bear and adventures in buffalo, elk and deer hunting, together with skirmishes with the Indians. Soon after this he joined a company formed by Nathaniel Wyeth, which started from Independence for the Rocky Mountains, with an outfit worth $100,000, sixty men and 200 horses and mules heavily loaded with goods. At the Gallatin River Isaac Rose and his party were joined by some trappers belonging to the American Fur Company, one of whom was Kit Carson. For years this noted trapper and Mr. Rose were closely associated in their adventurous life. Later, Mr. Rose became so expert a trapper himself that he won a prize of $300 as a trapper of beaver. In 1836 he had a thrilling experience with Indians, which almost caused the loss of his arm. The author \"The hunters and trappers of the far west, at the time when the incidents I am about to relate occurred, were a brave, hardy and adventurous set of men, and they had peculiarities in their characters that cannot be found in any other people. From the time they leave civilization they—metaphorically speaking—carry their lives in their hands. An enemy may be concealed in every thicket or looked for behind every rock. They have not only the wild and savage beasts to contend with, but the still more wily and savage Indian, and their life is one continual round of watchfulness and excitement. Their character is a compound of two extremes— recklessness and caution—and isolation from the world makes them at all times self-reliant. In moments of the greatest peril, or under the most trying circumstances, they never lose their presence of mind, but are ready to take advantage of any incident that may occur to benefit themselves or foil their enemies. \"As, in the course of this narrative, we may have occasion to describe some of the trappers who were comrades of Mr. Rose, and who took part in many of his adventures, I wish my readers to be fully aware of the character of these men, and that their camp stories are not all idle boasting. A more hardy, fearless, improvident set of men can nowhere else be found.\"",
  "genres": [
    "History",
    "Biography",
    "Nonfiction",
    "Travel",
    "Audiobook",
    "Westerns",
    "American"
  ],
  "author": "James B. Marsh",
  "average_rating": "3.82",
  "url": "https://www.goodreads.com/book/show/27279570-four-years-in-the-rockies----the-adventures-of-isaac-p-rose--hunter-and"
}