{
  "title": "The Lost Waves of Time: The Untold Story of How Music Shaped Our World",
  "description": "The Lost Waves of Time is the mind-blowing story of how music― (the sound vibrational matrix of infinite variety)―literally shaped human history. \"Lost Waves of Time will take you back to the beginning and ahead to the potential that we have forgotten. Prepare for a ride through history in a way that will move you to your core. You will recognize information from a deeper inner place that you likely didn't know even existed within in you.\"―Sharry Edwards, Founder Bio Acoustics This book reveals―more than anything else―what the conventional history books never will! Almost no one knows this story―and I doubt academia would dare to tell it! \"From the mythic days of Atlantis through all the histories of the major An idea echoes around the ancient world; the vibrational power of music slowly shapes human emotions, behaviors and actions. These influences accumulate and solidify, resulting in entire cultural reform… . Like the slow erosion of a tall mountain into a gentle rolling hill, music's subtle energy relentlessly molds everything in its path.\"―Hank Setala, Founder Holistic Health & Healing Music has always molded our world―much more than we can imagine. The mirror of music reflects a culture's deepest social and moral values. Using their understanding of music's power―ancient man shaped his world and maintained his creation for millennia. Pliable music was the foremost ancient tool to perform unbelievable feats. \"Three time author Jill Mattson breaks through in The Lost Waves of Time, revealing ancient vibrational energy techniques for sublime results. Enormous in scope. Reach new levels of consciousness. It will alter your ideas of sound and the ancient world―forever!\"―Bessheen Baker, Director & Founder of NITE.2016 Coalition of Visionary Resources (COVR) Book of the Year 2016 Coalition of Visionary Resources (COVR) Alternative Science Book of the Year",
  "genres": [],
  "author": "Jill Ingeborg Mattson",
  "average_rating": "4.67",
  "url": "https://www.goodreads.com/book/show/27286992-the-lost-waves-of-time"
}