{
  "title": "The Young Skin Diet: Science-Based Recipes and Treatments to Reveal Your Best Skin Ever",
  "description": "FINALIST, 2016 THE WISHING SHELF BOOK AWARDSJAMES BEARD BOOK AWARD NOMINATED AUTHORGet the diet book your skin has been waiting for!Learn how you can turn back the clock on skin aging.Michelle Lee (media personality and author of highly-acclaimed Living Luxe Gluten Free) sets forth the easy and delicious diet plan for your best skin ever in The Young Skin Diet. Based on hundreds of peer-reviewed scientific studies, the book reveals:-The Six Principles of nutrition to rejuvenate skin and keep it young.-The latest scientific findings on how to halt and reverse collagen loss, wrinkling, discoloration, sagging, inflammation and dryness in the skin -- with simple changes to your diet.-Cutting edge food combinations, preparation techniques and dietary habits for your best skin.-Over 75 recipes using dedicated nutrition science to make skin young again. -Holistic and balanced meal plans, skin treatments and dietary guidance to make young skin a sustainable and rewarding part of your life.With over 75 beautiful photographs and full nutrition information for every recipe, The Young Skin Diet sets forth a healthy, easy-to-follow approach for revealing your best skin ever. Plus, do-it-yourself natural skin treatments are provided for every day of the week.Tired of her own visible signs of aging, mother and entrepreneur Michelle Lee wanted to rejuvenate her skin. She first turned to traditional skincare products but quickly grew tired of their expense and harmful chemicals. So she compiled the best peer-reviewed research on how to make skin young again with diet and natural topical applications -- all of which is found in The Young Skin Diet.Michelle Lee's earlier book Living Luxe Gluten Free has been nominated for the 2016 James Beard Book Awards for \"Focus on Health\" and Photography.\" She appears on KLRR's morning show where she shares healthy living tips and recipes on \"Delicious Dishes with Michelle Lee.\"Praise for Michelle Lee's works:\"Good guidance...useful\" - Publishers Weekly\"User-friendly resource, highly recommended\" - Midwest Book Review\"Exceptional...impressive\" - Gluten Free & More Magazine",
  "genres": [
    "Food"
  ],
  "author": "Michelle   Lee",
  "average_rating": "3.94",
  "url": "https://www.goodreads.com/book/show/27287158-the-young-skin-diet"
}