{
  "title": "Harbinger in the Mist",
  "description": "“Oh my God! Did we do something horribly wrong?” Lindsey cried as she and the twins fled the room and down the stairs. Before the front door slammed behind them, the planchette moved across the floor and onto the wudu board.It stopped over the word “Yes.”When 18-year-old Lindsey and her mother unexpectedly inherit a beautiful Antebellum home in Walterboro, South Carolina, they think it will be an adventure, a new start. And at first glance, the Marla Rae Retreat House promises that and more. With its two-story columns on a wide board porch framed by dozens of ancient, mossy Live Oak trees, the house looks like something out of a history book.But the Marla Rae has a dark past and at least one ethereal occupant that likes to play tricks on Lindsey. When she and the girls next door attempt to contact the spirit through a Gullah ritual board, something vicious is unleashed. What once seemed harmless is now malevolent, hell-bent on revenge.Tensions mount when Eli, a handsome and mysterious man who is weeks away from entering the seminary, moves into the guest room for the summer. The draw to him is immediate – and forbidden. When he reveals a secret to Lindsey, her world is turned upside down.As she fights her feelings for the esoteric priest-to-be, Lindsey begins to unravel the violent history of the Marla Rae. With the help of the Charleston Area Paranormal Investigators, Lindsey searches for a way to end the haunting. Can the pagan psychics successfully join forces with Eli’s brotherhood to release the spirits from their earthly ties? Or will the faith that binds Eli to his brothers be stretched to a breaking point, threatening to damn both he and Lindsey to a greater hell than they ever imagined?",
  "genres": [
    "Angels",
    "Paranormal Romance",
    "Dark Romance",
    "Ghosts",
    "Paranormal"
  ],
  "author": "Anabell Martin",
  "average_rating": "3.76",
  "url": "https://www.goodreads.com/book/show/11737794-harbinger-in-the-mist"
}