{
  "title": "The Streets of Babylon: A London Mystery",
  "description": "'In this engaging first volume of a new historical series...Burman reveals her knowledge of Victorian England.' Library Journal‘As far as escapism goes, this is as good as it at times I felt as if I was actually in the book.' Vulpes Libris'Burman's extraordinary feeling for history and eccentric wit make for a most unusual kind of crime caper.' Independent on Sunday'A mystery packed with Victorian flavour.' Kirkus ReviewsI have seen a good many cities. Berlin is a charming conglomeration of small villages, while Paris is truly urbane. But London surpasses them both. One can never quite make out London and the Londoners. Everything is here. This is a historical detective novel that will appeal to fans of Sarah Waters, author of Fingersmith . The setting is London in 1851, the year of the Great Exhibition. Together with a Welsh police inspector, the successful Swedish authoress Euthanasia Bondeson goes in search of her beautiful companion, who has disappeared in the narrow streets and alleyways of London. She meets beggars and whores, artists and society beauties, all actors on the modern city’s stage in a drama of dark shadows and ever-changing desires. In this world where gender boundaries are constantly shifting, can we even tell who is a man and who is a woman? With skirts flapping, Euthanasia forges her way through this romp of a crime novel, surveying the streets that Sherlock Holmes himself would not tread until a whole generation later. Carina Burman, PhD , a well-known novelist and assistant professor at Uppsala University, has written extensively on eighteenth- and nineteenth-century literature. She’s made a name for herself as a skillful writer of pastiche, reflecting the language and atmosphere of days gone by. In 2001, she published a biography of Fredrika Bremer. Streets of Babylon is her fifth novel.",
  "genres": [
    "Historical Fiction",
    "Crime",
    "Mystery",
    "British Literature"
  ],
  "author": "Carina Burman",
  "average_rating": "3.40",
  "url": "https://www.goodreads.com/book/show/2729232-the-streets-of-babylon"
}