{
  "title": "Muse of Fire",
  "description": "Since the publication of Song of Kali in 1985, Dan Simmons has produced a substantial body of fiction notable for its vigor, variety, and sheer imaginative reach. His latest, a novella-length tale of startling originality, beautifully embodies these qualities, reaffirming Simmons's position as one of the finest storytellers of our time.Muse of Fire takes place in a remote future age in which the human enterprise has all but ground to a halt. Earth, drained of its oceans and populated largely by the dead, is little more than a distant memory. The scattered human remnants occupy the lowest rung of a Gnostic hierarchy that dominates both their secular and spiritual lives. Against this backdrop, Simmons introduces the Earth's Men, a wandering troupe of players dedicated to presenting the works of Shakespeare to every accessible corner of the settled universe.The story begins on the planet known as 25-25-261B, a regular stop on the players' interstellar tour. A routine performance of Much Ado About Nothing is in progress when an unprecedented event occurs. A band of Archons—members of the usually invisible ruling caste—enter the makeshift theater and join the audience. In doing so, they change the course of human—and non-human—history.What follows is an intellectual adventure story of astonishing richness and depth in which disparate species face each other across an insurmountable divide, their only point of contact the indelible language of William Shakespeare, the story's true muse. Skillfully deploying the elements of traditional science fiction—advanced technologies, alien encounters, strange new worlds—Muse of Fire entertains and illuminates while celebrating the best, most durable elements of our cultural legacy. It is a work of wit, erudition, and tightly compressed grandeur that only Dan Simmons could have written.",
  "genres": [
    "Science Fiction",
    "Fantasy",
    "Fiction",
    "Novella",
    "Space Opera",
    "Speculative Fiction",
    "Short Stories"
  ],
  "author": "Dan Simmons",
  "average_rating": "3.57",
  "url": "https://www.goodreads.com/book/show/2730248-muse-of-fire"
}