{
  "title": "The Three Battles of Sand Creek: In Blood, in Court, and as the End of History",
  "description": "The Sand Creek battle (or massacre) occurred on November 29-30, 1864, a confrontation between Cheyenne and Arapaho Indians and Colorado volunteer soldiers. The affair was a tragic event in American history, and what occurred there continues to be hotly contested. Indeed, labeling it a \"battle\" or a \"massacre\" will likely start an argument before any discussion on the merits begin. Even questions about who owns the story, or how it should be told, are up for debate. Three hearings were conducted about the Sand Creek affair, and there seems to be an overabundance of evidence from which to answer just about anything relating to the subject. Unfortunately, the available documentation only muddies the issues. Were the Indians peaceful? Did they hold white prisoners? Were they under army protection when the fighting took place? Were excessive numbers of women and children killed, and were bodies mutilated? Did the Indians fly an American flag? Did the chiefs die stoically in front of their tipis? Were white scalps found in the village? Gregory Michno candidly addresses these and other issues in The Three Battles of Sand Creek. The award-winning Indian Wars author divides his unique study into three sections. The first, \"In Blood,\" details the events of November 29-30, 1864, in what is surely the most comprehensive account published to date. The second section, \"In Court,\" focuses on the three investigations into the affair, illustrates some of the biases involved, and presents some of the contradictory testimony. The third and final section, \"The End of History,\" demonstrates the utter impossibility of sorting fact from fiction. Using Sand Creek as well as contemporary examples, Michno examines the evidence of eyewitnesses--all of whom were subject to false memories, implanted memories, leading questions, prejudice, self-interest, motivated reasoning, social, cultural, and political mores, an overactive amygdala, and a brain that had a \"mind\" of its own--obstacles that make factual accuracy an illusion. Living in a postmodern world of relativism suggests that all history is subject to the fancies and foibles of individual bias. The example of Sand Creek illustrates why we may be witnessing what Michno calls \"the end of history.\" Michno's extensive research includes primary and select secondary studies, including recollections, archival accounts, newspapers, diaries, and other original records. The Three Battles of Sand Creek will take its place as the definitive account of this previously misunderstood, and tragic, event.",
  "genres": [
    "History"
  ],
  "author": "Gregory F. Michno",
  "average_rating": "3.32",
  "url": "https://www.goodreads.com/book/show/27303450-the-three-battles-of-sand-creek"
}