{
  "title": "Bound By Heat Anthology",
  "description": "Burn up the pages with this multi-author volume which includes three brand new stories of dragon shifter romance! Kirall’s Kiss by M.K. EidemKirall was desperate. He was a Black Prime Dragoon, the strongest and fiercest of his kind. He was returning home after defeating the Varana when a small planet's moon triggered his Joining Heat. It shouldn't have been possible.He was right. Autumn was desperate. She was human, female and struggling to survive. At twenty-two she was barely making ends meet. It's why she agreed to impersonate her roommate as a waitress for the weekend at a private party. She believed the money would change her life. She was right. Two unlikely people are brought together because of desperation. If they can find a way past the deceptions that brought them together, they will change not only each other, but possibly the Universe as well.*-*A Dragon’s Promise by J.A. HornbuckleWarrior Dragon Ti'eron is dedicated to fulfilling his duties to eradicate the alien invasion threatening Earth and all its inhabitants. However, the reappearance of Adri, the young girl he'd promised to live his 'forever' with years before, shatters his resolve and splits his focus. Adri is instantly attracted to the young commander but refuses to accept the overwhelming desire they feel for one another is all Ti'eron is able to give. Especially in light of the oath he'd pledged to her when they were young. Because every knows a dragon's promise is never able to be broken. *-*Rylin’s Fire by Michelle HowardRylin thought he’d lost everything when his mate left him to bond with another. Then in a surprising twist of fate he inherited the mantle of leadership. Now Rylin rules the Black Dracol but it’s a lonely life. With hopes of finding another mate, he attends a mating party and finds the fates aren’t done with him yet. An Earth woman captures his heart with one flash of her endearing smile and the open ability to laugh at herself. *-*Note: Intended for mature readers (18+) due to strong language and sexual situations.",
  "genres": [
    "Paranormal",
    "Dragons",
    "Aliens",
    "Romance",
    "Shapeshifters",
    "Science Fiction",
    "Paranormal Romance"
  ],
  "author": "M.K. Eidem",
  "average_rating": "4.06",
  "url": "https://www.goodreads.com/book/show/27313113-bound-by-heat-anthology"
}