{
  "title": "40 Dump Cake Recipes: Delicious and Easy Dump Cakes Your Friends and Family will Love",
  "description": "40 Dump Cake Recipes The Essential Kitchen Series, Book 104Delicious and Easy Dump Cakes Your Friends and Family Will LoveThese are cakes like your grandmothers made...lots of delicious ingredients, blended easily together and thrown in an oven. Paul Watson is quoted as saying; \"These cakes may not have the most flattering of names, but they more than make up for it in their amazing taste.\"No more tiptoeing across the kitchen floor for fear of having the cake fall or crossing your fingers for a scrumptious result...these recipes deliver in ease and flavor. Here's a small sample of a few of the recipes we've included: Black Forest Dump Cake Peach Cobbler Dump Cake Cherry Pineapple Cabana Dump CakeWhat is a 'Dump Cake'Preparing, making and baking a dump cake is perhaps the easiest form of baking. Ingredients are placed in a single pan, layered, and popped into the oven. Does it sound overly simple? YES! That's the point. The concept was likely conceived by a woman but intended for a man.Any number of tasty combinations are possible. Once you've mastered the 40 recipes contained in this easy-to-follow cookbook, you'll astound your family and friends with your own concoctions. There is literally no way to go wrong with this type of cake.A Delicious Treat at Your FingertipsInside this unusually simple guide, you'll learn how to make decadent cobblers, fruity sensations, and much, much more...Learn what thousands have already discovered: there is an easy, fast way to impress your family with a quick, after-dinner dessert. Serve it right from the pan it was cooked in. They're delicious on their own or truly astounding when covered with whipped cream or vanilla ice cream.A Baking Bonanza In One, Simple PurchaseIt's your kitchen, why mess it up at the end of a long day...simply slam a few ingredients into a pan and serve it, hot and ready.Adopt the idea of 'I can do it' and buy this cookbook today!You'll have absolutely no regrets, but will be thrilled with the comments these recipes will elicit from your loved ones. When you purchase today, you will also get access to a special free gift from The Essential Kitchen Series ($97 Value).",
  "genres": [],
  "author": "Sarah Sophia",
  "average_rating": "4.33",
  "url": "https://www.goodreads.com/book/show/27301907-40-dump-cake-recipes"
}