{
  "title": "The Merman and the Moon Forgotten",
  "description": "Nikolas and Company is fantasy adventure meets GooniesThis middle grade fantasy is perfect for readers between the ages of 10 and 16. \"A long time ago in a world not so far away…\"Senior stagecoach driver, Yeri Willrow, leads a group of mysterious passengers through one of the most fog-ridden nights of his prestigious career. What he thought would be a simple drive and drop quickly turns into an attack by foul-breath, red-eyed creatures. Yeri learns that his mysterious passengers are a family of automaton-legged merfolk, and he is their only hope from the creature most foul.\"Sometime in the near future…\"Fourteen-year-old Nick lives in a time when one can zip from country to country in mach-speed hovercars, extend their life indefinitely through cerebral downloads, and have every whim taken care of by their ever faithful nannydrone.Nick hates it. Aside from the refugee camps, overpopulation, and unchecked consumerism filling every city across the globe, Nick just doesn’t belong. That is when he hears the voice of a woman: “The Rones lie about their true intent. They enter the city of Huron at the peril of us all.” Shortly after, his slightly crazed grandfather reveals to him:“All you’ve ever heard about the Moon is a lie, my dear Nikolas. He was not always a mere satellite, a ghost wandering the stars. In an age before our own, Moon was our twin, and in him bore the whole of magical life. The cradle of this magical civilization was a fantastic metropolis filled with fire-breathing winged lions, volcano-born nymphs, automaton-legged mermaids, and so much magic you could smell it. We called this city Huron, and you, Nikolas, are her steward.”",
  "genres": [
    "Fantasy",
    "Steampunk",
    "Young Adult",
    "Science Fiction",
    "Middle Grade",
    "Adventure",
    "Childrens"
  ],
  "author": "Kevin McGill",
  "average_rating": "3.95",
  "url": "https://www.goodreads.com/book/show/11738356-the-merman-and-the-moon-forgotten"
}