{
  "title": "Freak the Mighty [Lit Plan Teacher Pack]",
  "description": "Grades 6-9. Essentially a complete teacher's manual for the novel, this LitPlan Teacher Pack includes lesson plans and reproducible resource materials for Freak the Mighty by Rodman Philbrick. It includes: 21 Daily Lessons Short answer study questions Multiple choice quiz questions Vocabulary worksheets for each reading assignment 3 detailed writing assignments Individual and group activities Critical thinking discussion questions 5 unit tests (2 short answer, 2 multiple choice, 1 advanced) Evaluation forms Review puzzles & games Bulletin board ideas Reproducible student materials And more! A Note About A Few Of The Many Different Assignments Included: There is a group theme project in this unit. Students will become knights on a quest to bring their Liege information about the Arthurian Legend. There are three writing assignments in this unit, each with the purpose of informing, persuading, or expressing personal opinions. In Writing Assignment One students will write an informative essay about their quest project assignments. Writing Assignment Two asks students to give a personal response to one of two quotes from the story. In Writing Assignment Three students pretend to be the prosecuting attorney for Killer Kane s attempted murder trial, and they write their closing arguments to the jury. Uses: These materials are geared for whole class use but are very easily adaped for independent study work, lit circles or book groups, home school use, or tutoring. If you have never taught this book before, this manual will give you a great foundation of materials on a variety of levels. If you have taught this book before, you might like to know that veteran teachers have told us they have found our LitPlan Teacher Pack manuals to be different from many other materials they have seen--and very helpful.",
  "genres": [],
  "author": "Stacy C Littleton",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/2731192-freak-the-mighty-lit-plan-teacher-pack"
}