{
  "title": "Flash of Silver: ...the leap that changed my world",
  "description": "\"Flash of Silver, the leap that changed my world\" is more than a celebrity memoir. It contains a powerful remedy for indifference in just one word...resilience!Resilience has begun to outstrip 'sustainability' as the action to be taken to preserve many species, including our own.Graham Kerr, as the 'Galloping Gourmet' was referred to, during his international TV series, as the 'High Priest of Hedonism'. He had learned how to eat, cook and profit from some of the finest and richest foods in the world and he used those gifts with enormous enthusiasm and good humor.Suddenly everything changed as an accident severed his success with one blow.Searching for a return to resilience for himself and his family he began an ocean sailing adventure that took them 24,000 miles in 2 years.Then follows one of the most observed U turns ever made by one man. The Kerr's went from a conspicuous gourmet lifestyle to that of a small family living their lives beyond immediate self-interest and they did this in plain sight!Graham uses the literary practice of the 'extended metaphor' to enquire how habits are both formed and relinquished. He does this by comparing his life with that of a wild pacific Chinook salmon. Using poetic license, imagination and good science he asks his readers to hear from the salmon...direct and to see how both man and fish have somewhat similar rites of passage.They are swept 'downstream' where they face continuous discovery, some of which are difficult, some joyful...even hilarious.Upon reaching the salt waters they encounter the challenge of an almost limitless 'ocean of opportunity' where they must eat or be eaten, always driven by immediate self-interest and the need to survive.Finally they turn away from conspicuous consumption and begin to go 'upstream on purpose', this time motivated not just to survive as individuals, but also as a species...It's a wild ride as the scent of their natal river begins to provide direction for their way back home, where it all began.Kerr is not an angry activist, as he puts it.\"I have a story to tell and it's personal. I have made a series of very obvious leaps over some major obstacles, not unlike the salmon. Their flashes of silver are, for me, a splendid example of the resilience that is ours for the asking.\"Flash of Silver is supported by an extensive web site that includes an interactive 'REFLECTIVE READERS CLUB' at www.grahamkerr.com/RRC",
  "genres": [],
  "author": "Graham Kerr",
  "average_rating": "3.59",
  "url": "https://www.goodreads.com/book/show/27312855-flash-of-silver"
}