{
  "title": "Le Passager",
  "description": "Que celui qui s'aventure en compagnie de cet étrange Passager sache qu'il n'en sortira pas indemne. Patrick Senécal est en effet passé maître dans l'art d'aspirer son lecteur dans la spirale infernale de l'étrange. Inexorablement.  Étienne Séguin vit à Montréal. Sa femme l'a quitté et ce jeune homme sensible a du mal à croire qu'il se remettra un jour de ce gros chagrin d'amour. Quand on lui offre un poste de professeur de littérature à Drummondville, sa ville natale, il accepte sans hésiter, voyant là une occasion unique de se changer les idées. Il devra y enseigner le roman fantastique, lui qui n'a, dit-il, jamais été attiré par la violence.  Trois fois par semaine, le jeune prof emprunte l'autoroute 20, entre Montréal et Drummondville. Sans savoir pourquoi, il est irrésistiblement attiré par un auto-stoppeur, posté toujours au même endroit, toujours à la même heure. Il finit par s'arrêter et comprend vite que ce passager n'est pas un étranger, mais qu'il l'a connu, enfant, avant qu'un coup reçu sur la tête le plonge dans une amnésie totale. (…) pendant quelques secondes, sa silhouette se découpe à contre-jour de façon plutôt impressionnante, telle une entité mystérieuse émergeant des ténèbres. Je me dis même tout à coup que j'ai fait une erreur, que je devrais partir tout de suite… Évidemment, Étienne ne partira pas et découvrira, à l'issue d'un véritable voyage au bout de l'enfer, une part de lui-même engloutie dans un lointain passé.  L'auteur des Sept Jours du talion maîtrise sur le bout des doigts la partition de l'horreur. Suspense, action, amnésie, cauchemars récurrents, fausses coïncidences, lieux déserts, Senécal exploite tous les rouages du genre avec la dextérité d'un pianiste effréné. Dans une langue sans grand effet de style, mais d'une redoutable efficacité, l'un des rares auteurs québécois de roman noir prend son lecteur au piège, comme son héros, et ne les lâche que quand l'un et l'autre ont totalement rendu les armes. --Pascale Millot",
  "genres": [
    "Horror",
    "Thriller",
    "School",
    "France",
    "Fiction",
    "Mystery",
    "Read For School"
  ],
  "author": "Patrick Senécal",
  "average_rating": "3.91",
  "url": "https://www.goodreads.com/book/show/2732069-le-passager"
}