{
  "title": "The Quest for Shakespeare: The Bard of Avon and the Church of Rome",
  "description": "Highly regarded and best-selling literary writer and teacher, Joseph Pearce presents a stimulating and vivid biography of the world's most revered writer that is sure to be controversial. Unabashedly provocative, with scholarship, insight and keen observation, Pearce strives to separate historical fact from fiction about the beloved Bard.Shakespeare is not only one of the greatest figures in human history, he is also one of the most controversial and one of the most elusive. He is famous and yet almost unknown. Who was he? What were his beliefs? Can we really understand his plays and his poetry if we don't know the man who wrote them?These are some of the questions that are asked and answered in this gripping and engaging study of the world's greatest ever poet. \"The Quest for Shakespeare\" claims that books about the Bard have got him totally wrong. They misread the man and misread the work. The true Shakespeare has eluded the grasp of the critics. Dealing with the facts of Shakespeare's life and times, Pearce's quest leads to the inescapable conclusion that Shakespeare was a believing Catholic living in very anti-Catholic times.Many of his friends and family were persecuted, and even executed, for their Catholic faith. And yet he seems to have avoided any notable persecution himself. How did he do this? How did he respond to the persecution of his friends and family? What did he say about the dreadful and intolerant times in which he found himself? \"The Quest for Shakespeare\" answers these questions in ways that will enlighten and astonish those who love Shakespeare's work, and that will shock and outrage many of his critics. This book is full of surprises for beginner and expert alike.",
  "genres": [
    "Biography",
    "Catholic",
    "Nonfiction",
    "History",
    "Religion",
    "Christian",
    "British Literature"
  ],
  "author": "Joseph Pearce",
  "average_rating": "4.24",
  "url": "https://www.goodreads.com/book/show/2732406-the-quest-for-shakespeare"
}