{
  "title": "The Consequences of Ideas: Understanding the Concepts that Shaped Our World",
  "description": "If you think philosophy is irrelevant to your daily life, think again. You need only observe the world around you to discover how substantially the ideas of history's thinkers affect us still. You can hear it in the beliefs of your non-Christian friends. In the media, your music, your children's classrooms. You can see it in our public policies, on every bookstore shelf, in the way we understand our very existence--even in the church. We like to believe that we create our little worlds from scratch and then live in them. But the reality is, we step into an environment that already exists, and we learn to interact with it . The game has been conceived long before us; the rules and boundaries already decided. We may be amused when René Descartes labors so long in order to conclude that he exists, or puzzled by Immanuel Kant spending his life analyzing how we know anything. Yet these men were not simply contemplating minutiae. The foundational thinking of philosophy tries to lay bare all of our assumptions, revealing our false and sometimes dangerous beliefs so that we may arrive at a coherent worldview. The greater our familiarity with the ideas that have shaped our culture over the centuries, the greater our ability to understand--and influence--that culture for Christ. From ancient Greek thinkers like Plato and Aristotle to Christian philosophers like Augustine and Aquinas to the molders of modern thought such as Kant and Nietszche, R. C. Sproul traces the contours of Western philosophy throughout history and demonstrates the massive consequences these ideas have had on world events, theology, the arts, and culture--as well as in our everyday lives.",
  "genres": [
    "Philosophy",
    "Theology",
    "Christian",
    "Nonfiction",
    "History",
    "Christianity",
    "Religion"
  ],
  "author": "R.C. Sproul",
  "average_rating": "4.18",
  "url": "https://www.goodreads.com/book/show/273400.The_Consequences_of_Ideas"
}