{
  "title": "Confucian Analects, The Great Learning & The Doctrine of the Mean",
  "description": "Central to the study of Chinese civilization at its widest extension is the thought of the great sage K'ung, usually known in the West by the Latinized form of his name, Confucius. His works form the core of more than two thousand years of Oriental civilization, and even today, when he has been officially discarded, his thought remains important for understanding the present as well as the past. Yet Confucius is the property of not only the his ideas stood behind much of the rational social thought of the European Enlightenment, as great philosophers from Leibnitz on seized with delight \"the perfect ethic without that China offered them.The present edition of the wisdom of Confucius is certainly the best edition ever prepared in the West. The results of many years of study in China by the great Sinologist James Legge, it contains the entire Chinese text of the Analects (or sayings) of Confucius in large, readable characters, and beneath this Legge's full translation, which has been accepted as the definitive, standard English version. The book also includes The Great Learning and The Doctrine of the Mean .In addition to the texts and translation, a wealth of helpful material is offered to the countless notes embodying textual studies, commentators' opinions, interpretation of individual characters, disputed meanings, and similar material. More than 125 pages of introduction cover the Chinese classics, the history of the texts in this volume, and the life and influence of Confucius. Most useful, too, is a complete dictionary of all the Chinese characters in the book, with meanings, grammatical comments, place locations, and similar data. Subject and name indexes enable you to find material easily.",
  "genres": [
    "Philosophy",
    "China",
    "History",
    "Classics",
    "Religion",
    "Nonfiction",
    "Ancient"
  ],
  "author": "Confucius",
  "average_rating": "3.85",
  "url": "https://www.goodreads.com/book/show/27317.Confucian_Analects_The_Great_Learning_The_Doctrine_of_the_Mean"
}