{
  "title": "Here to Stay",
  "description": "“You can’t sort of do this, Fish. Draw a line and get on one side or the other...”Love is never so sweet as when it receives a second chance. In the sequel to her award-winning novel The Man I Love, Suanne Laqueur continues the story of Erik Fiskare’s romance with Daisy Bianco. Though separated for twelve years, the extraordinary bond forged in their youth has endured. But when your soulmate has caused you indescribable pain, how easy is it to forgive? How much trust is needed to place your heart back into the hands that once broke it? How much faith does it take to ask the question, \"Do you still want me?\" and believe in the reply: “I still want us.” Erik and Daisy commit to creating a new life together. They are separated by geography, loyal to career commitments and burdened with lingering pain from a decade spent apart. Yet despite the challenges, Erik knows Daisy is the best thing to happen to him twice. Slowly Erik earns back Daisy’s love as well as the trust of his incomparable friend, Will Kaeger. Both relationships grow deeper and more complex, as do Erik’s ties to the past. Unexpected contact with distant cousins offers new insight to the cruel childhood desertion that shaped so much of Erik’s adult life. With Daisy at his side, he travels back to his hometown to meet his people, explore his family’s history and learn about the men who wore his heirloom necklace before him.The cathedral once burned down is rebuilt. But a love affair is never a finished thing. Life is never without its tragedies. Daisy and Erik soon face a threat more harrowing than gunfire, more sorrowful than the lost years. With Will at his back and family close by, Erik must fight for the things he once walked away from and prove his love is here to stay.“Because of Laqueur's ability to smash you inside the heads of her characters, you feel and experience everything right along with Erik and Daisy. Here to Stay is honest and authentic. Never fake, forced, contrived, or overwrought. It’s a perfect conclusion: a love story fully told, nothing left unsaid or undone.”—Emma Scott, author of RUSH“Suanne Laqueur's writing is deeper than real, more than just truth. Her words are a ribbon winding themselves around you, over and under until you're tied up tight in the story. Not sure where it leaves off and you begin. Words in the hands of such a skilled writer are a powerful thing, and Laqueur proves time and time again she's worthy of our trust.”—Terri Lee, author of The Bootlegger’s Wife",
  "genres": [
    "Romance",
    "Contemporary Romance",
    "Contemporary",
    "Second Chance Romance",
    "New Adult",
    "Second Chance",
    "Fiction"
  ],
  "author": "Suanne Laqueur",
  "average_rating": "4.59",
  "url": "https://www.goodreads.com/book/show/27320582-here-to-stay"
}