{
  "title": "God's Middle Finger: Into the Lawless Heart of the Sierra Madre",
  "description": "From the acclaimed author of Dispatches From Pluto and Deepest South of All , a harrowing travelogue into Mexico’s lawless Sierra Madre mountains.Twenty miles south of the Arizona-Mexico border, the rugged, beautiful Sierra Madre mountains begin their dramatic ascent. Almost 900 miles long, the range climbs to nearly 11,000 feet and boasts several canyons deeper than the Grand Canyon. The rules of law and society have never taken hold in the Sierra Madre, which is home to bandits, drug smugglers, Mormons, cave-dwelling Tarahumara Indians, opium farmers, cowboys, and other assorted outcasts. Outsiders are not welcome; drugs are the primary source of income; murder is all but a regional pastime. The Mexican army occasionally goes in to burn marijuana and opium crops—the modern treasure of the Sierra Madre—but otherwise the government stays away. In its stead are the drug lords, who have made it one of the biggest drug-producing areas in the world.Fifteen years ago, journalist Richard Grant developed what he calls \"an unfortunate fascination\" with this lawless place. Locals warned that he would meet his death there, but he didn't believe them—until his last trip. During his travels Grant visited a folk healer for his insomnia and was prescribed rattlesnake pills, attended bizarre religious rituals, consorted with cocaine-snorting policemen, taught English to Guarijio Indians, and dug for buried treasure. On his last visit, his reckless adventure spiraled into his own personal heart of darkness when cocaine-fueled Mexican hillbillies hunted him through the woods all night, bent on killing him for sport.With gorgeous detail, fascinating insight, and an undercurrent of dark humor, God's Middle Finger brings to vivid life a truly unique and uncharted world.",
  "genres": [
    "Travel",
    "Nonfiction",
    "Adventure",
    "Memoir",
    "History",
    "Travelogue",
    "Crime"
  ],
  "author": "Richard Grant",
  "average_rating": "3.99",
  "url": "https://www.goodreads.com/book/show/2736567-god-s-middle-finger"
}