{
  "title": "Hooray For Diffendoofer Day!",
  "description": "With the release of 'Hooray for Diffendoofer Day!', readers young and old are afforded a dazzling glimpse into the genius of Theodor \"Dr. Seuss\" Geisel.This book is based on 14 rough drawings and verses Geisel's secretary gave to the author's editor, Janet Schulman, after his death in 1991.In these scribbled sketches and scratched-out lines, we witness the Seussian process in building a story. When brainstorming the name of what resulted in the Diffendoofer School, he jots down several possible names—\"William Wilkins Woofer Junior,\" \"Woodrow Watkins Woofer,\" \"Zoofendorf Elementary,\" \"J. Ebeneezer Bomberg Jr.\"—all of a slightly different cadence and rhythm, which he tests like a composer writing a new concerto.A small collection of Geisel's rough sketches would be plenty to thrill even the Grinchiest of readers, but there's much more to this marvelous book. Renowned children's poet Jack Prelutsky and award-winning illustrator Lane Smith were called to action by Schulman to pull these sketches into a complete story that would make Dr. Seuss fruffulous with glee.Prelutsky's delicious verse is uncannily Seussian, and it is inexplicably sensational when exploring the Diffendoofer School to discover good old Horton, a platter of green eggs and ham, and a few Whos from Who-ville scattered across the surreal and fascinating landscape of Smith's artwork. Lane and Prelutsky have gone above and beyond the call of duty, maintaining the characters and themes Geisel was just beginning to develop, but enhancing them with their own delightful stylistic stamps.Above all, this incredible book is an ode to unorthodox, unusually creative teachers, and the innovative thinking they encourage in young minds. It is a noble theme, and one that Geisel surely had in mind when he concocted these preliminary sketches. Both new Dr. Seuss aficionados and those who remember \n'The Cat in the Hat's'\n 1957 debut will cherish this book for its message, artwork, and poetry, and most of all as a tribute to the man who inspired thousands of readers.Ages: 3 and older",
  "genres": [
    "Picture Books",
    "Childrens",
    "Poetry",
    "Fiction",
    "Humor",
    "School",
    "Fantasy"
  ],
  "author": "Dr. Seuss",
  "average_rating": "4.15",
  "url": "https://www.goodreads.com/book/show/273730.Hooray_For_Diffendoofer_Day_"
}