{
  "title": "Yaser and Yasmeen: A Novel In Verse",
  "description": "Yaser and his friends sacrificed their lives not only for love, but to redeem the whole world. There were no limits they hadn't crossed to attain the needed goal of happiness. They had lost everything in their lives due to much of their bad conduct. After witnessing the whole world descend to the darkness of sorrow, they took it upon themselves to be saviors of humanity. Besides being a love story between Yaser and Yasmeen, it is also a tale of how four friends were able not only to inspire love on Earth, but also to redeem the people of all layers of Hell into Heaven. By doing so, they had angered not only the police force on Earth, but also all the demons in the afterlife. These four friends went on crazy adventures, always thirsting for the experience of life and fun. They sought out pleasure despite boredom, and joy despite sorrow. Throughout the story, they formed a musical cult with odd rituals and customs. After spending much time in this cult, they eventually expanded it to spray paint slogans of love all throughout the city of Abu Dhabi, United Arab Emirates. Eventually, in the afterlife, they had dialogues and fights with demons, struggling to save themselves from the fire and misery beneath in hell. After much struggle and suffering, they ended up changing not only things on Earth, but the circumstances in the life after death. And with much striving for peace and serenity, Heaven was a final destination. An Excerpt from Yaser and seemed that the one thing people would never dareWas to truly and fully, never really careFor if progress will never come there was no point in fast paced movementAnd so we resorted to the ways of fast attained amusementSometimes I got this nervous shiver in my backAnd then I realized I was stupid and that I needed to relaxAnd this would happen in a mall, and in a strange kind of formalityI began to admit that such malls are a different form of a realityWe shopped for things that we wear through one weekAnd then when the strands of the clothes look crappy, or kind of weakWe went about buying more things with this motive driven by greedWe went about buying things, as though they were legacies, to pass on to our seedAnd that was why Basim and I would go out on a journey embarkedAnd we’d go to such a beautiful and greenly decorated parkAnd upon smoking the hookah we spoke words which may heal sadnessAnd in our talks, we talked of our main goal, of attaining true happinessFor we realized that the whole world was in a type of repressionIt seemed that it was normal to have some sort of depressionWhenever I said I was depressed, all my friends at me would laughThey told me the whole world felt shitty, if you’d but do the math",
  "genres": [
    "Poetry"
  ],
  "author": "Saleh M. Radaideh",
  "average_rating": "4.68",
  "url": "https://www.goodreads.com/book/show/27385804-yaser-and-yasmeen"
}