{
  "title": "Sim 299",
  "description": "While the others slept, Aidan spent hours each night running sim after sim. Although he was only a twelve-year cadet, he had completed more simulations than any prime— ever. “You are setting history,” General Estrago told him. “No one has ever made it to the current simulation you are attempting. The other Masters and I are eager to see what comes next.” So was Aidan.Book Synopsis: The planet Ethos is at war with a savage enemy known as the Splicers. Their only successful defense is the Prime Initiative. All newborns with the compatible genes to become primes are taken from their families and injected with the Prime Stimulus. Those that survive the stimulus develop extraordinary abilities and are conscripted into the Ethos Army for training. But each ability comes with a defect. After turning twelve, Aidan is moved to the upper-class at the Mount Fegorio training complex. But Aidan is different than the other primes. Not only does he have two abilities, but he has no defects, besides the fact he is unable to sleep. His special gifts allow him unprecedented success in the virtual training simulations, known as The Pit. Using his unique abilities, Aidan goes further than any prime in history by reaching the final simulation, sim 299. No one knows what lies after sim 299, not even Director Tuskin, the ruthless and reclusive ruler of their planet. But someone, or something, has been guiding Aidan there, waiting for him to complete sim 299. If he can pass the final tests, he may unlock the key to ending the Splicer War. -- From the imaginative mind of debut author Johan Twiss, I AM SLEEPLESS: Sim 299 is an extraordinary space fiction adventure series that will delight readers of all ages. I AM SLEEPLESS has a clean read rating with the perfect mix of humor, mystery, and adventure that will keep you turning pages through the night. CLEAN RATING: There is no sex, drugs, graphic violence or typical swearing in this novel. There are numerous fight scenes and action sequences where people are injured and/or die, but it is not graphic and takes place in a virtual simulation. Swear words are fitting to the fictional world of Ethos, such as \"Tuskin's Fury,\" \"Batmonkeys\", \"Holy Hippophants\" etc... There are some budding, innocent romances with kissing involved, but nothing more. There are suspenseful situations with monster aliens and an overall thematic undertone of good v. evil.",
  "genres": [
    "Science Fiction",
    "Young Adult",
    "Fantasy",
    "Dystopia",
    "Mystery",
    "Fiction",
    "Middle Grade"
  ],
  "author": "Johan Twiss",
  "average_rating": "4.28",
  "url": "https://www.goodreads.com/book/show/27385248-sim-299"
}