{
  "title": "Promises Part 2",
  "description": "Roman “Quick” Webb is one badass bounty hunter on the crime-filled streets of Atlanta. He’s fearless when it comes to carrying out his dangerous job alongside his longtime best friend and business partner, Duke. However, there is one thing that has begun to cause Quick concern and it’s the dreadful thought of living out the rest of his life alone. Seeing his best friend and his son fall in love and sharing the special connection that only true soulmates can, has made him all the more aware of what’s lacking in his life. Love.Dr. Cayson Chauncey has been wildly attracted to the big, tattooed hunter for almost a year, ever since he performed the surgery that saved Quick’s best friend’s life. Cayson must’ve mistaken Quick’s gratitude for something more, because the one time he tried to make his desires known, he was harshly rebuffed and left on the man’s doorstep feeling stupid for hitting on an obviously very straight man. Cayson never dated a man who was willing to come out of hiding and be with him. Now at almost forty, Cayson is intent on no longer being anyone’s dirty secret. Having experienced countless disappointments, and having taken a stand not to fall for any more tricks, Cayson is more than a little skeptical when Quick comes around asking for a second chance to prove himself. The gorgeous man had already made it clear that he was not interested in Cayson… or so he’d thought.Dr. Chauncey stirred up Quick’s suppressed, most carnal desires from a place deep down inside of him. He’d reacted so badly the first time that now his sexy surgeon wanted nothing to do with him. It was going to take a fair amount of patience and a whole lot of wooing involved as Quick sets out to convince Cayson that he’s worth another chance and that he is the brave lover who Cayson has been looking for.With a scorned ex and a very dangerous job thrown into the mix, Cayson’s happiness and all of Quick’s promises may not be as easy to keep as they’d hoped.",
  "genres": [
    "M M Romance",
    "Romance",
    "Contemporary",
    "Audiobook",
    "Crime",
    "LGBT",
    "Gay"
  ],
  "author": "A.E. Via",
  "average_rating": "4.16",
  "url": "https://www.goodreads.com/book/show/27402172-promises-part-2"
}