{
  "title": "The Mysteries of London, Vol. I",
  "description": "The million-copy bestseller that rocked mid-Victorian England returns to print for the first time in a century! The government feared him. Rival authors like Charles Dickens, whom he outsold, despised him. The literary establishment did its best to write him out of literary history. But when George W.M. Reynolds, journalist, political reformer, Socialist, and novelist, died in 1879, even his critics were forced to acknowledge the truth of his obituary, which declared that he was the most popular writer of his time. And The Mysteries of London, which was published in 1844 in the \"penny dreadful\" format of weekly installments sold for a penny each, was his masterpiece and greatest success, selling 50,000 copies a week and over a million more when published in volume form. The Mysteries of London is a sprawling tableau, seeking to depict life as Reynolds saw it in mid-Victorian London and expose what he viewed as gross injustice toward the poor. Some of the notable storylines involve Richard Markham and Eliza Sydney, two virtuous but ingenuous youths inveigled into the fraudulent schemes of rogues; George Montague, a libertine who appears literally out of nowhere and nearly overnight becomes one of the richest and most powerful men in London; Anthony Tidkins, the \"Resurrection Man,\" a ruthless murderer and body-snatcher; and Ellen Monroe, an impoverished girl forced to submit to the worst degradations to earn money to feed her elderly father. The story takes us from royal drawing rooms, offices of cabinet ministers, and chambers of Parliament to the bowels of Newgate prison, the workhouse, and the lowest of taverns and gambling dens as Reynolds unfolds his thrilling plot, which never flags for an instant over the course of nearly 1,200 pages. This edition, the first in over 100 years, includes the unabridged text of the complete first series of The Mysteries, including its illustrations, more than fifty in all, and features a new foreword by Victorian scholar Louis James and annotations by Dr. Dick Collins.",
  "genres": [
    "Classics",
    "Mystery",
    "Gothic",
    "19th Century",
    "Victorian",
    "Fiction",
    "Novels"
  ],
  "author": "George W.M. Reynolds",
  "average_rating": "3.91",
  "url": "https://www.goodreads.com/book/show/273993.The_Mysteries_of_London_Vol_I"
}