{
  "title": "In the Dead of Winter",
  "description": "1918, Northampton, Massachusetts. Faye Tullis and her friend, Rachel White, two students at Smith University, are arrested after attending a lively suffragette rally. Things start to get out of hand, and the police arrive. The two girls are arrested, and spend the night in jail, where they meet a tall and imposing woman, who imperiously demands to be released. When her freedom is denied, she suddenly and inexplicably falls ill… Faye is therefore doubly surprised when she attends a class on logic the next morning to find this lady at the front of the class, introducing herself as ‘Dr. Myrl Adler Norton’, a professor of logic. She astonishes the class with her ability to deduce personal information about them from the minutest details… Rachel’s flat is broken into in suspicious circumstances. When Rachel called out to her landlady, Alyssa Dansen, a mysterious recluse, she only hears a strained voice in reply… Myrl and Faye rush to the flat to investigate and the situation is far worse than they imagined… Alyssa Dansen is seen from the window, a ghostly figure, staring straight out ahead of her... When they find her they realise someone has slit her throat, drained all her blood, and stuffed her with sawdust – and it is unclear how long she has been sitting, lifeless, at her window, staring out at the world with blank glass eyes. Faye is soon swept up in Myrl’s plan to find the killer herself. However, the more she gets involved with Myrl, the more she finds there are troubling elements to her new friend’s personal life… What is the terrible affliction that Myrl seems to suffer from? What is the real story behind Myrl’s parentage? And could the answer prove relevant to Myrl’s new found aptitude for detective work? ‘In the Dead of Winter’ is a gripping historical crime featuring Irene Adler’s daughter detective. Praise for Abbey Pen “The Great Detective as a woman? Yes, with all the quirks, foibles, and misanthropy, all the genius, and the darkness that runs through that remarkable mind. I look forward to more of Myrl Adler and her faithful Watson\" – Laurie R. King. “Abbey Pen Baker successfully creates a new world where a young woman detective embodies an equal amount of courage, curiosity, determination, and brains…An exciting plot, a refreshing main character, and precise and evocative language combine to offer us a fine read.” – Sena Jeter Naslund “Baker juggles her large cast and their secrets dexterously….Recommended for readers who aren’t sick of the centenary glut of Holmes pastiches, and even for those who are’ – Kirkus Reviews. Abbey Pen Baker is the great niece of Faye Martin Tullis. She divides her time between Yellow Springs, Ohio where she lives with children, animals and the title of Professor of English and New England, where she eats too much good food with good friends and collects rocks and sea glass on the coast of Maine. She is very busy editing the notes and previously published novels first penned by her great aunt.",
  "genres": [
    "Mystery",
    "Historical Fiction",
    "Historical",
    "Fiction"
  ],
  "author": "Abbey Pen Baker",
  "average_rating": "3.79",
  "url": "https://www.goodreads.com/book/show/27393637-in-the-dead-of-winter"
}