{
  "title": "Confessions Of A Cannibal: The Shocking True Story of Depraved Child-Killer Albert Fish",
  "description": "The shocking true account of one of the most sickening murders in the annals of American crime.On a drab, humid day in June 1928, a frail looking old man called at the Manhattan apartment of Albert and Delia Budd and persuaded them to allow their ten-year-old daughter to accompany him to a children’s party. What followed was one of the most sensational murder cases in American history, a crime that shocked, disgusted and enthralled an entire nation.Follow the paths of a horrendously depraved killer and the relentless detective who dedicated six years of his life to tracking him down. Get inside the courtroom for one of the trials of the century. Revisit the crime scenes and hear from the psychiatrists who examined this human monster. And finally, read the barely believable confessions of one of the most perverted individuals ever to walk this earth. Confessions Of A Cannibal will shock you to the core. This no holds barred account is not for the faint-hearted.˃˃˃˃˃˃˃˃˃Scroll up to grab a copy of Confessions Of A The Shocking True Story Of Depraved Child Killer Albert FishBook Series by Robert KellerMost of my works cover serial killers, while the “Murder Most Vile” series covers individual true crime stories. These are the main collections;American Monsters50 American Serial Killers You’ve Probably Never Heard OfMurder Most VileHuman MonstersBritish MonstersAustralian MonstersCanadian MonstersGerman MonstersCannibal KillersPlus various other standalone books, including the The Deadly Dozen, which is available as a free download on Amazon, and Serial Killers Unsolved, which you can get for free when signing up to my mailing list. Robert Keller’s True Crime eBook Serial KillersTrue CrimeSerial Killer BiographiesMurder and MayhemTrue Murder CasesSerial Killer Case FilesTrue Crime Short Stories",
  "genres": [
    "True Crime",
    "Nonfiction",
    "Crime"
  ],
  "author": "Robert Keller",
  "average_rating": "3.96",
  "url": "https://www.goodreads.com/book/show/27402555-confessions-of-a-cannibal"
}