{
  "title": "Misfit",
  "description": "The final book in the series tells the story of Cash \"Ghost\" McCall, Louis \"Stretch\" King, and the woman they allow in their relationship, Ophelia Donovan, who just happens to be Outlaw's little sister.Ophelia Donovan wants to move past the loves of her life, two badass bikers in her brother’s MC. When she gave Cash “Ghost” McCall and Louis “Stretch” King, an ultimatum of bringing their relationship out in the open or she’d walk, they chose separation. It crushed Ophelia’s dreams of having a happily-ever-after and family with Ghost and Stretch.Stretch lives with guilt and pain from the death of his former lover and the injuries he received the same night. For a while, Cash and Stretch worked fine. They’d agreed to choose a woman together to bring into their relationship. Instead, Cash brought Outlaw’s sister in, intending to use her as a shield for Cash’s growing feelings for both Stretch and Fee. The dissolution of their relationship because of Fee’s goading leaves Stretch angry with both of his lovers.Ghost doesn’t do relationships. He doesn’t have the confidence in himself that he’s equipped for something meaningful. He only knows he loves both Stretch and Ophelia. She wants kids, a house with him and Stretch, and, most of all, an open relationship with them. So open she expects Ghost to go to her brothers—his club’s president—and confess all. Even if he did do commitment, he wouldn’t be alive to see it through. Outlaw would kill Ghost, especially after already warning him away. Christopher “Outlaw” Caldwell knows Ghost is about fun and fucking. He’s in charge of the Bobs, those women trotted out for pleasure at special club occasions. Outlaw’s little sister wants a family and he refuses to allow her to waste her years on a man who’ll walk away in the end. Outlaw’s life has been quiet recently, with every known club threat removed, giving him plenty of time to focus on family.Thanks to Cash’s outrageous plan to throw Outlaw off, he raises the man’s suspicions instead. A biker from a rival club uses Ophelia to get on Outlaw’s good side, leaving her gravely injured, Outlaw in jail, Stretch admitting how important both she and Cash are to him, and Cash determined to never deny his love again.Warning: Not suitable for anyone under 18. Contains excessive swearing, graphic sex between MMF, taboo subjects, and…Kendall at her finest.",
  "genres": [
    "M M F",
    "M M Romance",
    "Menage",
    "Dark",
    "Erotica",
    "Romantic Suspense",
    "Contemporary"
  ],
  "author": "Kathryn C. Kelly",
  "average_rating": "4.17",
  "url": "https://www.goodreads.com/book/show/27403231-misfit"
}