{
  "title": "Beautiful Liar",
  "description": "Nola is a relentless manipulator! Through her manipulative tactics, she has somehow made everybody love her. However, if they really knew her, their love would be pure hatred. The feisty 29 year-old girl seems to have it charm, fashion, a profitable career, and disposable income. Yet, she still wants more— the handsome and widowed Pastor Ronnie Robinson, who just so happens to be the father of one of her closest sorority sisters. Although her dear friend Marley is against Nola’s attempt to pursue her father, Nola is willing to risk losing sisterhood in order to gain what she believes to be destiny.Leaving a breadcrumb trail of lies and deceit, Nola is faced with maintaining her impressive reputation within her sorority chapter, while secretly pursuing her forbidden love interest. With threats of being exposed, infected, and losing everything, Nola seems to have succumbed to the stereotype of being merely a troublemaking, selfish grown-girl who lives off of her family's money.Is Nola trying to fill a void that no one on Earth has the power to fill?? Can someone like Nola win a pastors’ heart?? During this unexpected journey, Nola encounters drama, old bad habits, hidden dark secrets, new relationships, discovering her true self, and something major that would change her life forever...Beautiful Liar is the debut fiction novel to the Sisterly Relations series written by J. Jakée. So get ready to curl up on your favorite spot of the sofa--don't forget your favorite glass of wine--and allow the pages to pull you into the familiar, yet unfamiliar world of sorority life after college; by way of romance, betrayal, life's rollercoaster, spirituality, envy, but most importantly sisterhood. As a member of the first black Greek letter sorority , J. is able to effortlessly paint a realistic perspective on sorority/sisterhood experiences in all of the series, so you don't want to miss one chapter of any of them.",
  "genres": [],
  "author": "J. Jakee",
  "average_rating": "4.71",
  "url": "https://www.goodreads.com/book/show/27406593-beautiful-liar"
}