{
  "title": "Bounty",
  "description": "Mob justice meets the internet in this globe-spanning thriller—think EBay for assassins—where outraged citizens bid up bounties to take out unrepentant crooks.Relentlessly suspenseful and disturbingly timely, Bounty summons a chilling vision of our Internet culture gone mad, where freedom, privacy, and the rule of law are demolished by a crisis of nightmare proportions—and the future of justice lies in the hands not of the bravest but the most brutal. When a notorious Wall Street vulture is executed in his high-rise office by a sniper’s bullet, it’s the kill shot heard around the world. Welcome to Bounty4Justice.com, a rogue website for vigilante assassins, where outraged citizens bid up bounties on corporate crooks and corrupt elites. As the number of targets soars, amateur bounty hunters and professional hit men compete to exterminate the condemned, “proof-of-death” videos become Internet sensations, and the self-styled Robin Hood pulling the strings threatens to plunge the international community into anarchy. Along with other law enforcement agencies across the globe, the FBI and its agents on the case—led by Roman Novak and Rosemary Michaels—are desperately seeking a way to outmaneuver and overpower an all-but-invisible adversary with millions of dollars at its disposal and the ability to cripple the most sophisticated attackers with a keystroke. Following a black-hat hacker extraordinaire down a rabbit hole of firewalls, encryption, and unbreakable codes leads Novak and Michaels into the virtual underworld of the darknet—a seemingly impenetrable haven for the illicit and illegal where Bounty4Justice’s mastermind is almost certainly hiding. But just when the agents think they are close to breaching their quarry’s digital fortress, they find themselves stalked by an army of cyber outlaws out for blood.",
  "genres": [
    "Thriller",
    "Fiction",
    "Mystery",
    "Science Fiction",
    "Mystery Thriller",
    "Crime",
    "Adult"
  ],
  "author": "Michael Byrnes",
  "average_rating": "3.72",
  "url": "https://www.goodreads.com/book/show/27405155-bounty"
}