{
  "title": "Freeware",
  "description": "Rudy Rucker has seen the future. . .and it is extreme.The Godfather of cyberpunk--a mad scientist bravely meddling in the outrageous and heretical--Rucker created Bopper Robots, who rebelled against human society in his award-winning classic \"Software.Now, in 2053, \"moldies\" are the latest robotic advancement--evolved artificial lifeforms made of soft plastic and gene-tweaked molds and algae, so anatomically inventive and universally despised that their very presence on the planet has thrown the entire low-rent future into a serious tailspin. So the moon is the place to be, if you're a persecuted \"moldie\" or an enlightened \"flesher\" intent an creating a new, more utopian hybrid civilization. Of course up there, there are other intergalactic intelligences to contend with--and some not so intelligent--who have their own agendas and appetites.This is scientific fabulation at its most brazenly inventive--funny, cutting-edge and deeply informed. No writer alive puts it all together like Rudy Rucker.Artificial life forms made of soft plastic and gene-tweaked mold and algae, moldies are evolved robots in the year 2053--anatomically inventive and universally despised. In a sleazy, low-rent future, sexual fraternization with moldies is strictly taboo--a societal sin that is of no concern whatsoever to Randy Karl Tucker. A Kentucky boy who has seriously strayed from the Heritagist religion's stern teachings about the evils of artificial life, Randy feels a definite something for Monique, moldie bookkeeper and maid at the Clearlight Terrace Court Motel But Monique1s sudden and inexplicable abduction from the planet--coupled with unsettling revelations about Randy1s own dubiousorigins--is dragging the degenerate flesher and all those around him into an ugly, conspiratorial mess. . .even as it pulls an unsuspecting humanity ever-closer to a stunning encounter with intergalactic intelligence.",
  "genres": [
    "Science Fiction",
    "Cyberpunk",
    "Fiction",
    "Speculative Fiction",
    "Science Fiction Fantasy",
    "Novels",
    "Dystopia"
  ],
  "author": "Rudy Rucker",
  "average_rating": "3.75",
  "url": "https://www.goodreads.com/book/show/274046.Freeware"
}