{
  "title": "The Leap of Forgiveness",
  "description": "This book intertwines two love stories and a mystery that, once solved, has the potential to alter the lives of everyone involved. What if everything you’ve ever been told is a lie? When Joshua was just a young boy in the 60's, he was told his mother took her own life and left him to be raised by an emotionally absent man and a woman who had slipped into insanity because of the death of her own child. Those circumstances affected every aspect of Joshua’s life but it wasn’t until he met Isabelle, the red-haired bookstore owner on Bell Island, that he realized just how emotionally stifled he was. He loved her, but his tragic past kept him from fully committing. And Isabelle was tired of waiting. Then lavender scented letters began arriving in Joshua’s mailbox. The letters were signed “Mama,” and they filled in the missing pieces of his early life with his mother, including why her own turbulent love story caused her to walk into the ocean one day in her best suit. They also contained God-inspired wisdom that had the potential to set Joshua on another path. But Joshua must determine whether the letters are truly from his mother, who he believes has been dead for 20 years, or if there is an even deeper mystery that will finally explain the heartbreaking events of so long ago. If you love inspirational books that make you feel, buy The Leap of Forgiveness and begin reading it today. Reviews for the first book in this series, The Fragrance of Surrender: \"The journey of the main character is hard and intense. I recommend this book to readers who want to be moved by words. I'd just like to offer one word of caution... once you start reading this book you may not want to put it down until you finish reading it to the last page. It's that good.\" Marlene Bertrand \"This book was totally remarkable...You will feel God working throughout this book.\" Debbie Jamieson, Goodreads. \"The two stories - Gabriela's battle against faith while her son embraces it and the village mystery - develop together so quickly that this is a book difficult to put down. We want to find out what has been happening in the village, what happened to Gabriela's parents, and if Gabriela will win her fight against God. And Geremia uses well-developed secondary characters - Gabriela's foreman and his wife, Raul and Mona, and a local evangelist named the Preacher - to help propel the stories forward. Faith is a messy business, as Gabriela and her son discover. It often means sacrifices, and it can mean pain. But, as Gabriela learns, it always involves a choice.\" Glynn Young, Faith, Fiction, Friends \"This book inspired me to be a better person all of the time! \" Terrie Urbanczk \"I loved the way the author portrayed the characters in this book. She made the struggles of each character so REAL.\" Amazon customer \"Oh my gosh, Gabriella kept me up all night!\" Amazon customer Watch for Book 3 in this Series: The Irrationality of Poetry - Available for pre-order August 18, 2016",
  "genres": [],
  "author": "April Geremia",
  "average_rating": "4.63",
  "url": "https://www.goodreads.com/book/show/27408844-the-leap-of-forgiveness"
}