{
  "title": "Lawyer Games: After Midnight in the Garden of Good and Evil",
  "description": "LAWYER GAMES is the TRUE story of the murder case that spawned a best-seller and film: Midnight In The Garden Of Good And Evil. But this book goes far beyond the boundaries of a single murder case. No reader of LAWYER GAMES will ever again look the same way at a criminal trial. Kirkus: \"Riveting.\"In the early morning of May 2, 1981, Danny Hansford was shot dead by James Williams with a World War II vintage Luger in a historic Savannah mansion. For the next eight-and-a-half years, through four murder trials and intrigue which reached the highest levels of Georgia politics -- including a former governor and the Georgia Supreme Court -- lawyers battled over whether the 50-year-old Williams shot the 21-year-old Hansford in self-defense.Written by Dep Kirkland, who arrived at the scene when Hansford's body was still on the floor, Lawyer Games is the true story of this remarkable case. Kirkland, the Chief Assistant DA at the time, made the decision to arrest Williams and tried the first of four murder trials alongside the District Attorney. His firsthand knowledge allows him not only to deeply analyze the murder case but also to expose the legal mischief spawned when a defendant facing unshakable physical evidence possesses almost unlimited funds.LAWYER GAMES is not merely the story of an infamous murder case. It is the story of lawyer obfuscation, subterfuge and manipulation of the criminal trial process. These are common tools of a certain species of defense lawyer. LAWYER GAMES demonstrates the connection by drawing parallels with other high-profile criminal defendants, including O.J. Simpson, Phil Spector, Angelo Bruno (one of two Hillside Stranglers) and others.True crime aficionados will be drawn to the two stories told in the book: The riveting story of the case, its evidence (including facts never heard in the courtroom), trials and results, and the incredible eight-year campaign to beat a murder rap no matter what, with a look behind the curtain at a darker side of the American criminal justice system.",
  "genres": [
    "True Crime",
    "Nonfiction"
  ],
  "author": "Dep Kirkland",
  "average_rating": "3.57",
  "url": "https://www.goodreads.com/book/show/27406304-lawyer-games"
}