{
  "title": "Gideon's Trumpet",
  "description": "Gideon's Trumpet is the story of this extraordinary case, from the night of June 3, 1961, when the Bay Harbor Poolroom was robbed, to the moment that Clarence Earl Gideon walked out of the Panama City, Florida, Courthouse a free man, on August 5, 1963.Gideon's plea to the United States Supreme Court was deceptively simple: he had been denied a lawyer at the time of his trial for burglary because he could not afford one. To most laymen this would seem to provide grounds for a new trial, but the fact is that until the Supreme Court heard Gideon's case, an indigent prisoner did not have the right to a lawyer in many state courts.The case of Gideon v. Wainwright changed all that. The Supreme Court decided to hear Gideon's plea, and it appointed Abe Fortas, a noted Washington lawyer, to represent him.On March 18, 1963, the Court announced its historic decision: the Justices unanimously overruled an earlier case and held that henceforth the \"due process of law\" guaranteed by the Fourteenth Amendment meant that poverty alone could not deprive a criminal defendant of the right to counsel. For Gideon this meant a new trial, and this time, with the help of a lawyer, he was acquitted.But Gideon's Trumpet is far more than the dramatic story of a single case whose reverberations will change the lives of thousands of other prisoners; it is also an inspiring examination and interpretation of the role of the Supreme Court itself. The reader learns much of the history of the Court, of the constitutional and criminal law in the United States, of the philosophies of law of various Justices, of changing historical interpretations of the Bill of Rights and its various amendments, and of the modus operandi of the Court day by day.Anthony Lewis writes about the complex and momentous issues involved in Gideon v. Wainwright with simplicity, clarity and precision, and his portrait of Gideon and his dogged fight for freedom is as poignant and, in the words of one distinguished reader, \"as absorbing as the best fiction.\"",
  "genres": [
    "Law",
    "Nonfiction",
    "History",
    "Politics",
    "American History",
    "Biography",
    "Political Science"
  ],
  "author": "Anthony  Lewis",
  "average_rating": "3.91",
  "url": "https://www.goodreads.com/book/show/27404.Gideon_s_Trumpet"
}