{
  "title": "A Question of Love",
  "description": "The earl of Shaftesbury’s countess must be refined. Cultured. Perfect. It was a lesson that proper Evelyn Ashley-Cooper had learned flawlessly over six oppressive years of marriage. Even when widowhood freed her from the prison her life had become, Eve still floundered under the veneer of perfection that her domineering husband demanded, unable to unleash the lively girl she once was from the confines of her prim exterior.But when her long-lost first love Francis MacKintosh, earl Glenrothes reappears in her life, Eve is tempted by the desire to escape her proper façade and the longing to truly live once again. Discovering that enticement alone cannot overrule years of tyranny, Eve struggles between her old self and the new, between yearning to be with him and a determination never to put herself under the thumb of another man - even one she discovers she still loves as much as her Glenrothes.Since meeting a vivacious, young Eve many years before, Francis MacKintosh has become a man embittered by life, by a wife who has made him a cuckold to the whole of Scotland and by a humiliating divorce that has rained scandal down upon the heads of himself and his family for years. Never had he thought that he would find Eve, his Eden, once again or that he would dare push aside his disdain of the fairer sex, to trust and love once more. But for Eve, for the love and happiness he is suddenly certain they can find only in each other, he finds himself willing to take a chance.If only he might convince his true love to do the same!Francis' seduction and ability to blend her proper side with the spirited Eve of years past lure the countess back to him but just when happiness seems but a step away, their mutual pasts will come crashing down around them attempting to tear them apart and Eve and Francis will have to risk their lives for a future together.The question remains, will their rediscovered love be enough to conquer all?",
  "genres": [
    "Historical Romance",
    "Romance",
    "Historical",
    "Historical Fiction",
    "Scotland",
    "Regency",
    "Fiction"
  ],
  "author": "Angeline Fortin",
  "average_rating": "4.13",
  "url": "https://www.goodreads.com/book/show/11742919-a-question-of-love"
}