{
  "title": "Gentry Boys",
  "description": "**NYT and USA Today Bestselling Series! This four-book limited edition box set with bonus content will be available for the sale price of 99 cents for a very short time.***  “All my life I’d always known what the Gentry boys were. A set of fraternal triplets born to a depraved family, they were rough, sexy and wild as wolves...\"  DRAW They called us ‘those white trash Gentry boys’ until we believed that’s what we were. Our people squatted at the edge of a hellhole prison town for generations. The childhood we endured was the stuff of nightmares. I’d learned early on that my brothers, Chase and Creed, were the only people on earth worth my time. They all told us we were bad, that we’d always be bad. The horrors of the past have scarred my soul. But now I need to be better. For her.  RISK Violence had always found us Gentrys but this time I’d put the price on my own head. It was my cross to bear. No flinching allowed. There was only room for me, my brothers, and the resolve to survive. That’s all there ever had been. There was certainly no reason for more than than a quick and dirty time with any female, no matter how much this sassy southern girl with a killer body turned my head around. I shouldn’t hold on to Truly Lee for more than a few hours. I shouldn’t even think about it. This thing could finish us both. It doesn’t matter. She’s all I want.  GAME Gentry men aren’t supposed to be very bright. We’re big. We’re brutal. Women can’t wait to invite us inside. I know I can have any one of them I want any time I want. It seems unlikely that some bad-tempered chick and her snotty attitude would keep my interest but here it is. Stephanie has no idea what she does to me. I want that girl in more ways than I can even talk about. It should have been enough to have her and be done with it. But no matter how volatile we are together, it’s never enough. To hell with anyone who objects. I’m not letting her go.  FALL How many women have I ruined? Hell if there’s any point in counting. Only once did I ever do something unforgivable and the consequence crushed my soul. Maybe that’s why I remain here, in the barren desert wasteland occupied by the worst of my degenerate family. This is a prison I’ve inflicted on myself. Into my purgatory walks Jenny; feisty, beautiful, not much more than a girl herself. No one decent should want a thing to do with me. I told her that. She didn’t listen.  **Also includes an excerpt from HOLD, Book #5 in the Gentry Boys series.  This series is intended for mature audiences. It contains explicit language, sexual situations, and violence that may be upsetting to some.",
  "genres": [
    "Romance",
    "Contemporary",
    "New Adult",
    "Contemporary Romance",
    "Amazon",
    "College",
    "Adult"
  ],
  "author": "Cora Brent",
  "average_rating": "4.39",
  "url": "https://www.goodreads.com/book/show/27411218-gentry-boys"
}