{
  "title": "The Renegade Queen",
  "description": "Two Renegades So Controversial, They Were Erased From History  \n  Discarded by society, she led a social revolution. Disgusted by war, he sought a new world.\nShe was the first woman to run for President, campaigning before women could vote.He was the Hero of Vicksburg, disillusioned with the government after witnessing the devastating carnage of the Civil War.Their social revolution attracted the unwanted who were left out of the new wealth: the freed slaves, the new immigrants, and women.Who were they?This is the true story of Victoria Woodhull and the love of her life, James Blood. Adored by the poor, hated by the powerful, forced into hiding during their lifetimes and erased from history after death, the legend of their love lives on. It’s 1869 and Victoria has a choice to make. She can stay in an abusive marriage and continue to work as a psychic, or she can take the offer of support from handsome Civil War general James Blood and set about to turn society upside down. Victoria chooses revolution.But revolutions are expensive, and Victoria needs money. James introduces Victoria to one of the wealthiest man in America--Commodore Vanderbilt. Along with her loose and scandalous sister, Tennessee, Victoria manipulates Vanderbilt and together they conspire to crash the stock market”--and profit from it. Victoria then parlays her fortune into the first female-owned brokerage firm. When her idol Susan B. Anthony publishes scandalous rumors about Victoria’s past, Victoria enters into a fierce rivalry with Susan to control the women’s movement. James supports Victoria's efforts despite his deep fears that she may lose more than the battle. She might lose part of herself.Victoria starts her own newspaper, testifies to Congress, and even announces her candidacy for President. But when Victoria adopts James's radical ideas and free love beliefs, she ignites new, bruising, battles with Susan B. Anthony and the powerful Reverend Henry Beecher. These skirmishes turn into an all-out war, with Victoria facing prejudice, prosecution, and imprisonment. Ultimately, Victoria and James face the hardest choice of all: the choice between their country and their love.",
  "genres": [
    "Historical Fiction",
    "Romance",
    "Historical",
    "Historical Romance",
    "Literary Fiction",
    "Fiction"
  ],
  "author": "Eva Flynn",
  "average_rating": "3.76",
  "url": "https://www.goodreads.com/book/show/27420732-the-renegade-queen"
}