{
  "title": "Temptation Creek",
  "description": "Originally issued as \"Up a Dry Creek\".Dry Creek has been home to the Layton family for generations, a heritage Claire Layton and her brothers Hank, Chris and Sam all appreciate. Claire is a successful, though somewhat debt-ridden, restaurateur who minds her own business—literally. She has enough on her plate between an irascible chef, an abandoned sous-chef, and the pressure of running her highly praised eatery, Harvest Bistro. But when she discovers one of her customers dead in her dumpster, her world begins to unravel. Even as her County Sheriff brother Hank and his team are still swarming the property looking for evidence, Claire receives a threatening call. It seems there’s a slight problem involving the dead young woman in the dumpster. She doesn’t have her phone and her flash drive with her. The killer makes it clear that Claire better find them by noon the next day or he’ll go after her and her entire family. With the clock ticking, Claire searches for the missing items to no avail. Complicating matters is the arrival of Jake Warrick, a hotshot security expert hired by the dead woman’s father to find her killer. Claire’s trying her best to get Jake out of her restaurant when her Jeep goes up in flames. The noon deadline has passed.  Determined to find the killer and to keep her family safe, Claire refuses to back down, even as the murderer continues to terrorize her. Jake isn’t backing down either, and the tension between the two—sexual and otherwise—continues to mount. Jake has no intention of leaving Claire in danger—or of leaving at all before he gets to know her much, much better. Clues, most leading nowhere, pile up, and the threads of the mystery are becoming still more complicated, even as the killer comes closer and closer to claiming his prize—and his prey.",
  "genres": [
    "Romance",
    "Romantic Suspense",
    "Contemporary",
    "Contemporary Romance",
    "Amazon",
    "Suspense",
    "Mystery Thriller"
  ],
  "author": "Avery Flynn",
  "average_rating": "3.90",
  "url": "https://www.goodreads.com/book/show/11743977-temptation-creek"
}