{
  "title": "Miscarriage of Justice: The Jonathan Pollard Story",
  "description": "When the name of admitted spy Jonathan Pollard is mentioned, fierydebate breaks out between those who believe he should have been shot,and those who contend that he was railroaded into prison for life bygovernment officials who violated his constitutional rights. Now, forthe first time, the case involving the most controversial spy inAmerican history is examined by presenting every aspect of the Pollardstory. It shows the moral dilemma faced by Jonathan Pollard, a Zionistand naval analyst who admitted passing top secret security documents tothe Isr'li government in the mid-1980s. In Miscarriage of Justice,attorney and author Mark Shaw delivers an in-depth portrait of thefascinating case that Fresh background material about the committed Zionist from his fatherclearly indicating Pollard's motive for spying for Isr'l.. Details of the love story that bound Anne and Jonathan Pollardtogether in their efforts to aid Isr'l.. Factual data regarding Isr'l high government official's activeparticipation in the spy scheme.. Motives as to why leaders of the Jewish community abandoned Pollard inhis time of need.. Pollard supporter's accusations that Defense Secretary CasparWeinberger lied about hisrole in the Pollard case.. Scathing rebuttal by Pollard prosecutor Joseph di Genova regardingallegations that the spy's constitutional rights were violated.. Behind-the-scenes facts concerning why Pollard was sentenced to lifein prison by Federal Court Judge Aubrey Robinson.. Pollard supporters allegations that President Bill Clinton reneged onpromises to free the spy.. Comparisons of Pollard's sentence with other noted spies and withcases involving the infamous Alfred Dreyfus and atomic bomb spy,Theodore Hall.. Assessment of Pollard's chances to be freed from prison.From start to finish, Miscarriage of Justice presents a balancedstudy/objective view of a confusing case, one rife with lies,half-truths, innuendo, speculation and deception. All regarding themysterious Jonathan Pollard, dubbed by New York Times Magazine, \"The SpyLeft Out In The Cold.\"",
  "genres": [],
  "author": "Mark  Shaw",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/1174414.Miscarriage_of_Justice"
}