{
  "title": "Zone to Win: Organizing to Compete in an Age of Disruption",
  "description": "Over the last 25 years, Geoffrey Moore has established himself as one of the most influential high-tech advisors in the world--once prompting Conan O'Brien to ask \"Who is Geoffrey Moore and why is he more famous than me?\"Following up on the ferociously innovative ESCAPE VELOCITY, which served as the basis for Moore's consulting work to such companies as Salesforce, Microsoft, and Intel, ZONE TO WIN serves as the companion playbook for his landmark guide, offering a practical manual to address the challenge large enterprises face when they seek to add a new line of business to their established portfolio. Focused on spurring next-generation growth, guiding mergers and acquisitions, and embracing disruption and innovation, ZONE TO WIN is a high-powered tool for driving your company above and beyond its limitations, its definitions of success, and ultimately, its competitors.Moore's classic bestseller, CROSSING THE CHASM, has sold more than one million copies by addressing the challenges faced by start-up companies. Now ZONE TO WIN is set to guide established enterprises through the same journey.\"For any company, regardless of size or industry, ZONE TO WIN is the playbook for succeeding in today's disruptive, connected, fast-paced business world.\" --Marc Benioff, CEO, Salesforce\"Once again Geoffrey Moore weighs in with a prescient examination of what it takes to win in today's competitive, disruptive business environment.\" --Satya Nadella, CEO, MicrosoftWith this book, Geoffrey Moore continues to lead us all through ever-changing times...His work has changed the game of changing the game! --Gary Kovacs, CEO, AVG\"ZONE TO WIN uses crystal-clear language to describe the management plays necessary to win in an ever-disrupting marketplace. Regardless of your level of management experience, you will find this book an invaluable tool for building long-term success for your business.\" --Lip-Bu Tan, President and CEO, Cadence Design Systems",
  "genres": [
    "Business",
    "Nonfiction",
    "Management",
    "Leadership",
    "Entrepreneurship",
    "Buisness",
    "Technology"
  ],
  "author": "Geoffrey A. Moore",
  "average_rating": "3.85",
  "url": "https://www.goodreads.com/book/show/27418306-zone-to-win"
}