{
  "title": "Treat Climate Change, Save the Earth: How to Prevent Flooding and Drought to Slow Global Warming",
  "description": "Have you ever been frantic with worry about your family and friends after a hurricane or a wildfire swept through the area where they live?  Have you worried that all that we can seem to do so far is to debate whether climate change exists, whether it's mankind's fault, and whether anything should be done about it?  Have you felt despair because while all of this debate continues, you or your family or your friends are standing waist deep in water inside your house?  Perhaps you’re gazing out at your crops which are dying from thirst?  Perhaps you’re unable to make yourself trust the drinking water that comes out of your tap?  This book isn't a debate about climate change.    This isn’t about tips that you can do around your household to recycle or use less energy.  This book isn’t even about reducing carbon use! That will be worked on by our world leaders at the climate change summit in Paris this year.   We have problems. This book is about solutions!    This book is about ways to act before the tragedies strike:   -Act before a storm hits to prevent flooding  -Act to deliver potable water where it is desperately needed  -Act to maintain land to reduce the risk of fires  -Act to strategically help to restore and support our glaciers  -Act to no longer depend only on underground sources of freshwater, allowing them to replenish themselves.  -Act to extend humanitarian aid in a way that will help countries to support themselves instead of being forced to rely on charity.  The system I’ve devised will take time and resources to build. But it also takes time and resources to build the pipelines to transport oil from the tar sands. And when those pipelines leak, the oil destroys land, kills wildlife, and cripples the livelihoods of the people living in that area.  Wouldn’t it be far better to use our resources to support our population and to protect wildlife?  Wouldn’t it be far better if this system can support itself with its own generated energy, and have the potential to generate additional energy for human use?  We’re already taking steps toward increasing our use of renewable energy. Now it is time for us to live more in harmony with our planet instead of sucking all of the resources out of it.  Ours is a rapidly growing population. Across our entire planet, humanity requires more to support itself.  Yet at the same time, we have developed enough that we can begin to support the land that support us!  Read my book, and find out ways we can start to live like an even more mature race of sentient beings!",
  "genres": [],
  "author": "Amanda Rothman",
  "average_rating": "3.75",
  "url": "https://www.goodreads.com/book/show/27419355-treat-climate-change-save-the-earth"
}