{
  "title": "The Duke Of Eden",
  "description": "The Complete Novel - Also Available In Serial Brand Ellsworth turned down his father's viscountcy in favor of the dukedom held by Aaron North, a close family friend who had a three-year-old daughter but no son. The price of the rise in rank was his betrothal to the daughter, Adria. At the time it seemed a small price for a big gain - even if Brand had to endure Uncle Aaron and Adria's inane babbling about him being the little tyke's fated soul mate.Brand became a man in the same household where Adria grew to be a girl and then a teenager. At first, Brand lived there so that Aaron could train him in his duties. But just a few years after the betrothal, Aaron committed suicide, jumping to his death from the same cliff where his late wife had died a few years earlier. Brandon became the Duke of Warren and found that the power and wealth of the position fit him well. He balanced duty and honor with a rather devoted pursuit of pleasure. As the years passed and his young betrothed matured, the price that seemed small to the youth seemed too much to bear to the man who considered Adria a little sister.Adria inherited the North family's famed \"sense of direction.\" Her father sensed that Brand was her fated soul mate. Adria's even stronger sense detected that Brand had been her soul mate in many lifetimes, although they hadn't spent all of them together. When suddenly, after years of begging to be allowed to go to London, she gets packed up and urgently delivered for a conversation with Brand, she fears the worst and is proved right.To avoid the looming marriage, Brand deliberately stepped into a marital trap clumsily set by his best friend's little sister. It isn't until he sees the announcement in the morning paper that he learns that for all of these years he hasn't been the Duke of Warren. He's merely held the title until his wedding to Adria. Her husband will be the Duke. But that's not the worst part. When he lays eyes on Adria to break their betrothal, he hasn't seen her in three years and the woman who walks into his study proves again that the North sense of direction is never wrong.Brand takes one look at her and knows that the exquisite redhead is just what Uncle Aaron said she'd become - she's his Eden without the apple. But he chose the apple.Is their paradise lost?",
  "genres": [
    "Historical"
  ],
  "author": "Mary Anne Graham",
  "average_rating": "3.50",
  "url": "https://www.goodreads.com/book/show/11744727-the-duke-of-eden"
}