{
  "title": "Our Stolen Future: Are We Threatening Our Fertility, Intelligence and Survival? A Scientific Detective Story",
  "description": "\"A critically important book that forces us to ask new questions about the synthetic chemicals that we have spread across this earth.\"—former vice president  Al Gore , author of An Inconvenient TruthOur Stolen Future  examines the ways that certain synthetic chemicals interfere with hormonal messages involved in the control of growth and development, especially in the fetus.The developing fetus uses these natural hormonal messages, which come from both from its own hormone system and from its mother, to guide development. They influence virtually all of the growing individual's characteristics, from determining its sex to controlling the numbers of toes and fingers to shaping intricate details of brain structure. Scientific research over the last 50 years has revealed that this hormonal control of development is vulnerable to disruption by synthetic chemicals. Through a variety of mechanisms, hormone-disrupting chemicals (also known as endocrine disrupting chemicals or endocrine disruptors) interfere with the natural messages and alter the course of development, with potential effects on virtually all aspects of bodily function.Our Stolen Future  explores the scientific discovery of endocrine disruption. The investigation begins with wildlife, as it was in animals that the first hints of widespread endocrine disruption appeared. The book then examines a series of experiments examining endocrine disruption of animals in the laboratory which show conclusively that fetal exposure to endocrine disrupting chemicals can wreak life-long damage. These experiments also reveal some of the biological processes by which these chemicals have their effects, and that endocrine disruption effects can be caused by exposure to infinitesimally small amounts of contaminant. Moving from animals to people,  Our Stolen Future  summarizes a series of well-studied examples where people have been affected by endocrine disrupting chemicals, most notably the synthetic hormone dietheylstilbestrol (DES), to which several million women were exposed through misguided medical attempts to manage difficult pregnancies in the 1950s, '60s and '70s.Our Stolen Future  then asks a broader, more difficult and more controversial set of questions. Given what is known from wildlife and laboratory studies, and from examples of well-studied human exposure, and given that exposure to endocrine disrupting chemicals in the real world is widespread at levels comparable to those sufficient to cause animal harm, what effects should health scientists be looking for in people in general? Effects to be expected include declines in fertility and other impacts on the reproductive system of both men and women, impairments in disease resistance, and erosions in intelligence.",
  "genres": [
    "Science",
    "Nonfiction",
    "Environment",
    "Health",
    "Biology",
    "Read For School",
    "Sustainability"
  ],
  "author": "Theo Colborn",
  "average_rating": "4.12",
  "url": "https://www.goodreads.com/book/show/274198.Our_Stolen_Future"
}