{
  "title": "Between Two Skies",
  "description": "Hurricane Katrina sets a teenage girl adrift. But a new life — and the promise of love — emerges in this rich, highly readable debut.Bayou Perdu, a tiny fishing town way, way down in Louisiana, is home to sixteen-year-old Evangeline Riley. She has her best friends, Kendra and Danielle; her wise, beloved Mamere; and back-to-back titles in the under-sixteen fishing rodeo. But, dearest to her heart, she has the peace that only comes when she takes her skiff out to where there is nothing but sky and air and water and wings. It’s a small life, but it is Evangeline’s. And then the storm comes, and everything changes. Amid the chaos and pain and destruction comes Tru — a fellow refugee, a budding bluesman, a balm for Evangeline’s aching heart. Told in a strong, steady voice, with a keen sense of place and a vivid cast of characters, here is a novel that asks compelling questions about class and politics, exile and belonging, and the pain of being cast out of your home. But above all, this remarkable debut tells a gently woven love story, difficult to put down, impossible to forget.What separates Evangeline's story from the myriad others that have come and gone in the wake of one of the nation's worst natural disasters is O'Sullivan's deft lyricism...O'Sullivan's light touch and restraint will allow readers to follow Evangeline as she stands howling into the wind that howled into her.—Kirkus Reviews (starred review)O’Sullivan’s debut novel excels in its expressive language and the use of place: a colorful home, a city that contrasts what Evangeline has lost, and the aftermath of the storm that destroyed nearly everything she holds dear. Told in a strong, purposeful voice filled with controlled emotion and hope, the impact of Katrina on families is as compelling as Evangeline’s drive to regain her sense of self and belonging.—Booklist (starred review)This tale reminds readers that there were millions of people all over the gulf affected by [Hurricane Katrina] and that for many, the horror of the event was only beginning, not ending, when the skies cleared. A compelling novel with a tender romance, this debut is a great choice for teens who appreciated Jewell Parker Rhodes’s Ninth Ward or Denise Lewis Patrick’s Finding Someplace.—School Library Journal",
  "genres": [
    "Young Adult",
    "Romance",
    "Historical Fiction",
    "Realistic Fiction",
    "Contemporary",
    "Fiction",
    "Family"
  ],
  "author": "Joanne O'Sullivan",
  "average_rating": "3.99",
  "url": "https://www.goodreads.com/book/show/27426036-between-two-skies"
}