{
  "title": "I Love Superfood Smoothies",
  "description": "This book will make you a real superfood smoothie specialist. You will learn the benefits of different popular superfoods and of fruits and herbs. Attention is given to baby smoothies, kids, teens, pregnant women and the elderly. We show you how to create great tasting smoothies, which detoxify your body and make you lose a lot of weight. You do not want to miss the chapter about green smoothies, as they are fantastically healthy. With the basic recipes of nuts, hemp and sesame milk, you will learn to make your own healthy and creamy, base milk. The 114 delicious recipes in this book are 100% raw, vegan and gluten free. In the blink of an eye you will be able to make the freshest, tastiest and healthiest super food smoothies. Flavours that complement each other have been chosen from real and extensive testing & tasting. You will learn what the benefits of various superfoods are to you and how you can enjoy them in everyday life. You will be surprised by all the delicious tasting superfood smoothies that are ready to be made by you, so that you will feel more alive and thrive. Soon, you will find that your energy level goes up or that you will experience other benefits of smoothies, like more clarity to your mind and just generally feeling better! This book will give you a simple answer to the question: How do I process superfoods in my daily diet? Superfoods are often sold in the shape of (freeze-dried) powders. As you can imagine perhaps, eating powders alone is not an easy thing to do. A tasty smoothie where you put in your superfood (powders), is therefore one of the fastest and easiest ways to get the good nutrients into your body to address any shortages. The only tools you need for making these great tasting and nutritious smoothies are a blender, a knife and a cutting board. Of course, you will need the ingredients but also your creativity: Make sure you have the necessary ingredients in your fridge and cupboards ready; fruits, superfoods, sweeteners, herbs and/or green vegetables, melons the list is almost endless. In the back of the book, the first appendix is a glossary. In part 3 consecutively superfoods, herbs and fruits, including their health effects, have been described. Furthermore you will find many practical tips in this book, such as 'How to open a fresh coconut?' or 'What goes first or last in the blender?' and many more. In the handy Recipe Index you will find the recipes listed alphabetically (mentioned by name), the main ingredients and the superfoods with the corresponding page number. We hope you get as much pleasure with your superfood smoothie adventure, as we had creating this book!",
  "genres": [],
  "author": "Daphne Groothuijse",
  "average_rating": "4.75",
  "url": "https://www.goodreads.com/book/show/27427567-i-love-superfood-smoothies"
}