{
  "title": "Mr. Sebastian and the Negro Magician",
  "description": "From the author of Big Fish comes this haunting, tender story that weaves a tragic secret, a mysterious meeting with the Devil, and a family of charming circus freaks recounting the extraordinary adventures of their friend Henry Walker, the Negro Magician. In the middle of a dusty Southern town, in the middle of the twentieth century, magician Henry Walker entertains crowds at Jeremiah Musgrove’s Chinese Circus. Though not the world-famous illusionist he once was, Henry, with his dark skin and green eyes, is still something of a novelty to the patrons who pay a dime to see his show. Most of the patrons, anyway. As the novel begins, one May night in 1954, Henry is confronted by three menacing white teens, and soon thereafter disappears. With his fate uncertain, his friends from the circus—Jenny the Ossified Girl, Rudy the Strong Man, and JJ the Barker—piece together what they know of Henry's mysterious and extraordinary life. The result is a spellbinding adventure that begins when ten-year-old Henry meets the devil, who gives him the art of magic and then steals the one thing that means the most to him. As Henry’s friends recount the remarkable adventures and incredible heartache that result from this childhood encounter, only one thing seems certain about Henry's life: nothing is as it appears.Brimming with surprising twists and turns, and peopled with a literal circus of memorable characters, Mr. Sebastian and the Negro Magician is Daniel Wallace at his finest. As in his beloved debut, Big Fish, Wallace once again conjures a wondrous tale with an emotional punch. This is a story of love and loss, identity and illusion, fate and choice; a story that will capture your heart and your imagination and not let go until the very last page.",
  "genres": [
    "Fiction",
    "Fantasy",
    "Historical Fiction",
    "Magic",
    "Mystery",
    "Magical Realism",
    "Audiobook"
  ],
  "author": "Daniel Wallace",
  "average_rating": "3.54",
  "url": "https://www.goodreads.com/book/show/27441.Mr_Sebastian_and_the_Negro_Magician"
}