{
  "title": "Mourir partir revenir. Le jeu des hirondelles",
  "description": "«En avril dernier, sur le site de l’INA, qui venait de mettre ses archives en ligne, je suis tombée sur un reportage sur Beyrouth en 1984. Les journalistes interviewaient les habitants d’une rue située sur la ligne de démarcation. Bloquée à cause des bombardements dans l’entrée de son appartement – l’entrée était souvent la pièce la plus sûre car la moins exposée –, une femme au regard angoissé dit une phrase qui m’a donné la chair de poule. Cette femme, c’était ma grand-mère. J’étais à Paris et tout d’un coup, sur l’écran de mon ordinateur, ma grand-mère faisait irruption et m’offrait un bout de notre mémoire. Ça m’a bouleversée, je me suis dit que c’était peut-être le moment d’écrire enfin le récit qui me travaillait depuis un moment déjà. “Je pense, qu’on est quand même, peut-être, plus ou moins, en sécurité ici” C’est la phrase qu’a dit ma grand-mère en 1984. C’est une phrase qui s’interroge sur la notion d’espace et de territorialité. C’est une phrase qui résume la raison pour laquelle beaucoup d’habitants sont restés « chez eux » malgré le danger. C’est aussi la première phrase mon futur album.Nous sommes à Beyrouth, dans les années 80, au 38 de la rue Youssef Semaani, et plus précisément, dans l’entrée de l’appartement du premier étage. Comme c’est la pièce la plus sûre de la maison – et donc de l’immeuble, puisque l’appartement est au premier étage – tous les voisins sont là aussi. Dans cette entrée il y a l’histoire de chacun des personnages, l’histoire qu’ils ont en commun, celle du microcosme qu’ils forment et l’histoire de la moitié de ville que Beyrouth était devenue. Dans cette entrée, il y a aussi une tenture. Dans cet intérieur exigu où elle est présente d’abord en toile de fond, elle matérialise petit à petit la guerre qui fait rage à l’extérieur. Cette tenture est le fil conducteur de l’histoire que je raconte.»Zeina Abirached",
  "genres": [
    "Graphic Novels",
    "Comics",
    "Memoir",
    "Nonfiction",
    "War",
    "History",
    "Lebanon"
  ],
  "author": "Zeina Abirached",
  "average_rating": "3.81",
  "url": "https://www.goodreads.com/book/show/2743973-mourir-partir-revenir-le-jeu-des-hirondelles"
}