{
  "title": "Left Out: The Politics of Exclusion: Essays 1964-2002",
  "description": "\"Despite our country’s bootstrap rhetoric, outsiders in this land of individualism rarely make a go of it alone. As the first essay in this collection—an analysis of the anti-slavery movement of the mid-nineteenth century—attempts to show, improving conditions for those who have been left out‚ hinges on the ability of the despised and downtrodden, and their allies, to band together in collective struggle and insist on their entitlements.\"—from the Introduction, Left Out The lives of \"outsiders\" have been the focus of Martin Duberman’s work as a public intellectual for the past four decades. Best known for his biography of Paul Robeson, Duberman highlights the \"banding together\" of the excluded in Left Out. These identity-based movements—black power, gay liberation, feminism—have created a vital and controversial change in American consciousness in recent decades. Duberman’s collected essays trace this evolution of thought in lively and engaging language. Available here for the first time in paperback, this edition includes three new essays. Presenting summations of Duberman’s views on such matters as race, foreign policy, gender, and sexuality, Left Out offers incisive analyses of the split between class-based and identity-based politics on the Left. As a white anti-racist, feminist man, socialist queer, and \"godfather\" of the gay studies movement, Duberman has taken many brave and prescient stands. His writing shows why he is considered a deeply moral and wise man. \"No matter the topic, Martin Duberman’s thoughtful and nuanced essays are written with a humanity and optimism all too rare in our cynical times.\"—Susan Faludi \"[Duberman] has engaged the greatest struggles of our times with an unflinching nerve, a wise heart and a brilliant intellect.\"—Jonathan Kozol",
  "genres": [
    "LGBT",
    "Nonfiction",
    "Queer",
    "Essays",
    "Feminism"
  ],
  "author": "Martin Duberman",
  "average_rating": "3.95",
  "url": "https://www.goodreads.com/book/show/274277.Left_Out"
}