{
  "title": "A Handful of Hard Men: The SAS and the Battle for Rhodesia",
  "description": "A biography of a Special Forces soldier who battled the forces of Mugabe and Nkomo, earning a reputation as a military maestro.   During the West’s great transition into the post-colonial age, the country of Rhodesia refused to succumb quietly, and throughout the 1970s, fought back almost alone against Communist-supported elements that it did not believe would deliver proper governance. During this long war, many heroes emerged, but none more skillful and courageous than Capt. Darrell Watt of the Rhodesian SAS, who placed himself at the tip of the spear in the deadly battle to resist the forces of Robert Mugabe and Joshua Nkomo.   It is difficult to find another soldier’s story to equal Watt’s in terms of time spent on the field of battle and challenges faced. Even by the lofty standards of the SAS and Special Forces, one has to look far to find anyone who can match his record of resilience and valor in the face of such daunting odds and with resources so paltry. A bush-lore genius, blessed with uncanny instincts and an unbridled determination, he had no peers as a combat-tracker—and there was plenty of competition. The Rhodesian theater was a fluid and volatile one, in which he performed in almost every imaginable fighting as an airborne shock-trooper leading camp attacks, long range reconnaissance operator, covert urban operator, sniper, saboteur, seek-and-strike expert, and, in the final stages, as a key figure in mobilizing an allied army in neighboring Mozambique. After twelve years in the cauldron of war, his cause slipped from beneath him, however, and Rhodesia gave way to Zimbabwe.   When the guns went quiet, Watt had won all his battles but lost the war. In this fascinating biography we learn that in his later years, he turned to saving wildlife on a continent where animals are in continued danger, devoting himself to both the fauna and African people he has cared so deeply about.",
  "genres": [
    "History",
    "Military Fiction",
    "Africa",
    "War",
    "Nonfiction",
    "Military History",
    "Audiobook"
  ],
  "author": "Hannes Wessels",
  "average_rating": "4.30",
  "url": "https://www.goodreads.com/book/show/27427765-a-handful-of-hard-men"
}