{
  "title": "Shane",
  "description": "Once upon a time, my life was good. I had a family, I had a girlfriend, and hopes for the future. That was long ago, but I remember it. A hazy dream of what could have been.That’s gone now. I lost it all. Life fucked me over, and now I’m scared of my own damn shadow. I’m training to be a tattoo artist, but I bet I’m not good enough. I have a roof over my head, but every morning I’m scared shitless that I’ll find myself on the street again – or worse, back in prison. And every time a pretty girl looks at me, every single fucking time, I know I can’t be with her. Not only because she’ll find out I’m an ex-con and run the other way, no. It’s more than that. I just can’t. The thought of anyone touching me, the thought of getting aroused from that touch brings back every damn nightmare from my past to swallow me whole.Can’t fucking do it. Not even if it’s the prettiest girl on earth – Cassie. With her long blond hair and her pretty tits, her short skirts and high heels, she’s all my fantasies rolled into one. See, the fact she kissed one of my buddies? That’s good. The fact she looks at me like I’m a bug under her shoe? Even better.Because it means she’s not interested in getting hot and sweaty with me, and that I can keep living that fantasy.The fantasy that she wants to be with me as much as I want to be with her – even though I know it will never happen.Standalone novel. No cliffhanger.*Warning: this book contains graphic language, sex, and violence. Mature readers only. Not intended for young readers.*SHANE is book 4 in the series Damage Control - a series set in the same world as Inked Brotherhood. The boys of Damage Control were taken in by Zane Madden and Rafe Vestri and offered apprenticeship and work in the tattoo shop Damage Control.Next in the Damage Control series: OCEAN (Damage Control 5).",
  "genres": [
    "Romance",
    "New Adult",
    "Audiobook",
    "Contemporary",
    "Contemporary Romance",
    "Abuse",
    "Erotica"
  ],
  "author": "Jo Raven",
  "average_rating": "4.42",
  "url": "https://www.goodreads.com/book/show/27464652-shane"
}