{
  "title": "More Than Human: Embracing the Promise of Biological Enhancement",
  "description": "WINNER OF THE 2005 H.G. WELLS AWARD\"The Editors Recommend\" -  Scientific American  What if you could be smarter, stronger, and have a better memory just by taking a pill? What if we could alter our genes to cure Alzheimer's and Parkinson's?What if we could halt or even reverse the human aging process?What if we could communicate with each other  simply by thinking about it ?These questions were once the stuff of science fiction. Today, advances in biotechnology have shown that they're plausible, even likely to be accomplished in the near future. In labs around the world, researchers looking for ways to help the sick and injured have stumbled onto techniques that enhance healthy animals--making them stronger, faster, smarter, and longer-lived--in some cases, even connecting their minds to robots and computers across the Internet. Now science is on the verge of applying this knowledge to healthy men and women, allowing us to alter humanity in ways we'd previously only dreamed possible. The same research that could cure Alzheimer's is leading to drugs and genetic techniques that could boost human intelligence. The techniques being developed to stave off heart disease and cancer have the potential to slow or even reverse human aging. And brain implants that restore motion to the paralyzed and sight to the blind are already allowing a small set of patients to control robots and computers simply by thinking about it.Not everyone welcomes this scientific progress. Cries of \"against nature\" arise from skeptics even as scientists break new ground at an astounding pace. Across the political spectrum, the debate Should we embrace the power to alter our minds and bodies, or should we restrict it? Distilling the most radical accomplishments being made in labs worldwide, including gene therapy, genetic engineering, stem cell research, life extension, brain-computer interfaces, and cloning,  More Than Human  offers an exciting tour of the impact biotechnology will have on our lives. Throughout this remarkable trip, author Ramez Naam shares an impassioned vision for the future with revealing insight into the ethical dilemmas posed by twenty-first-century science.\"A terrific survey of current work and future possibilities in gene therapy, neurotechnology and other fields.\"  - Los Angeles Times\"Ramez Naam provides a reliable and informed cook's tour of the world we might choose if we decide that we should fast-forward evolution. I disagree with virtually all his enthusiasms, but I think he has made his case cogently and well.\"     - Bill McKibben, author  Staying Human in an Engineered Age  \" More Than Human  is one of those rare books that is both a delightful read and an important statement. No one interested in the future intersections of science, technology, and medicine can afford to miss this book.\"    - Steven Johnson, author of  Mind Wide Open and Where Good Ideas Come From\" More Than Human  is excellent - passionate yet balanced, clearly written and rich with fascinating details. A wonderful overview of a topic that will dominate the twenty-first century.\"     - Greg Bear, author of  Dead Lines  and  Darwin's Children\"The future accelerates and change is upon us.  The only question - asked cogently in  More Than Human  - is whether we can learn to ride the waves, or else be swept away. This book is a how-to guide for future-wave riders.\"    - David Brin, author of  EXISTENCE  and  The Transparent Will Technology Make Us Choose Between Privacy and Freedom?",
  "genres": [
    "Science",
    "Nonfiction",
    "Technology",
    "Futurism",
    "Biology",
    "Economics",
    "Singularity"
  ],
  "author": "Ramez Naam",
  "average_rating": "3.81",
  "url": "https://www.goodreads.com/book/show/274638.More_Than_Human"
}