{
  "title": "F. Scott Fitzgerald's The Great Gatsby: A Literary Reference",
  "description": "The “colossal affair” that is Jay Gatsby’s mansion, Owl Eyes, Wolfsheim and his “gonnegtions,” West Egg, East Egg, the valley of ashes, Jordan Baker, and Daisy Fay—they belong to all time as does the American classic in which they appear. But a classic belongs to its own time, too, and this meticulously compiled, handsomely designed and generously illustrated volume documents the social reality out of which The Great Gatsby grew and the cultural milieu in which F. Scott Fitzgerald wrote. It thus identifies for contemporary readers the crazes and events, the celebrities and the criminals, the music and dances and books, that the novel’s first readers in 1925 would have immediately recognized. This invaluable companion to The Great Gatsby also examines—and illustrates with facsimiles of pages from Fitzgerald’s handwritten drafts and revised typescripts—the arduous process of composition that ultimately produced the book hailed by critic Gilbert Seldes as “vivid and glittering and entertaining.” Reviews and promotions as well as correspondence and comment from such literary figures as Edmund Wilson, Ernest Hemingway, Edith Wharton, and H. L. Mencken illuminate Gatsby’s mostly favorable critical reception. Still, in the wake of the 1940s’ Fitzgerald revival, as this volume’s final chapter on the enduring reputation of The Great Gatsby shows, the novel has fulfilled Fitzgerald’s boast that he wrote for “the youth of his own generation, the critics of the next, and the schoolmasters ever afterward,” as well as the moviemakers, play producers, choreographers, and composers. And all students of Fitzgerald and general readers will find new insights into what makes Gatsby great in this generously illustrated, engaging reference book’s every chapter.",
  "genres": [
    "Fiction"
  ],
  "author": "Matthew J. Bruccoli",
  "average_rating": "4.10",
  "url": "https://www.goodreads.com/book/show/27452.F_Scott_Fitzgerald_s_The_Great_Gatsby"
}