{
  "title": "The Salt of His Seed: The Complete Trilogy",
  "description": "The battle goes sour for a handsome young viking. Leif, a powerful Viking warlord, spares him on the field and claims him as his captive. What the new thrall will soon discover, is that the brutal, alpha Viking has taken him not so the thrall can wait on him, but to have a captive to warm his bed and serve his every need. Go back in time, to a world where men were ruthless warriors, and follow the Viking Warlord and Einarr's romantic journey from enemies to lovers...and beyond in this 15,700 word complete and discounted collection of the three The Salt of His Seed books!  Captured By The Gay Viking Warlord  The battle goes sour for a handsome young viking. Leif, a powerful Viking warlord, spares him on the field and claims him as his captive. What the new thrall will soon discover, is that the brutal, alpha Viking has taken him not so the thrall can wait on him, but to have a captive to warm his bed and serve his every need. The new thrall must now submit to his enemy's domination, as he is taken in every hole. When his desires for the rugged Lief heat up, will the thrall betray his people by taking pleasure in his first time with a man?  This 5,500 erotic story contains:  Gay Sex First Time Gay Sex Vikings Anal Sex Oral Sex Some BDSM Historical Romance  Trained By The Gay Viking Warlord  Now, weeks into his captivity, the captive is caught between resisting his new master and thirsting for his touch. Leif decides to train his thrall, using a merciless chastity belt that he hopes will have the captive begging to be taken by the alpha warlord...after Leif takes his pleasure in the young man's holes himself. Will this feisty thrall resist the advances of this rough warlord? Does he want to?  This 5,000 erotic story contains:  Gay Sex First Time Gay Sex Vikings Anal Sex Oral Sex Some BDSM and Sex Toys, Dildos Spanking Historical Romance  Wedded and Bedded By The Gay Viking Warlord  What the new thrall has discovered, is that the brutal, alpha viking warlord, can be a rough, but caring lover. As the two fight alongside each other, and their trust grows, Leif knows that he needs to take a daring step to bring his thrall into the approval of the warriors under his command. There needs to be a ritual, steeped in the traditions of the north, that will unify the two men, one that could even free the young thrall from his servitude. Will the young thrall accept Leif's offer, even if it means being taken  publicly, and in front of the viking warriors? Find out in the steamy and epic conclusion to The Salt of His Seed trilogy!  This 5,200 erotic story contains:  Gay Sex First Time Gay Sex Vikings Anal Sex Oral Sex Public Sex / Exhibitionism / Voyeurism Historical Romance",
  "genres": [
    "Romance",
    "Historical",
    "Gay"
  ],
  "author": "Richard Lunch",
  "average_rating": "3.71",
  "url": "https://www.goodreads.com/book/show/27484451-the-salt-of-his-seed"
}