{
  "title": "The Naughty List",
  "description": "Six holiday romances, from sexy to sweet, prove that love is better on the Naughty List.A Christmas Maggie by Tiffany ReiszAll Daniel wanted for Christmas was to spoil his new girlfriend, Anya, make love under the tree, and ignore all his old heartaches. But the ghosts of Christmas past aren’t so easily forgotten especially when Maggie, his late wife, shows up to remind him why the past should stay in the past and why his Christmases-future could be the best of his life if he can finally let himself live and love in this Christmas present. (A Christmas Maggie is the final story in the Daniel trio [from the Original Sinners series] beginning with The Gift and followed by Daniel Part Two.) Christmassy by Alexa PiperWhen taotien Valerion and witchling Cora get together sparks fly. But on the way to visit Cora’s family for Christmas, they encounter a supernatural predator that will not only test their individual powers and abilities, but also their connection to one another. My Midnight Cowboy by Pumpkin SpiceIf chocolate is the way to a man’s heart, then pastry chef Lucy Baker has the recipe for success. But will her culinary skills melt the most hard-hearted bachelor in Wyoming? A chance encounter on a New Year’s Eve flight leaves two strangers to discover unbound pleasure and a hunger for sexual discovery. In the Doghouse by Elizabeth BlackNicky and Angela had just begun to add a little kink to their lives when, caught up in the influence of his dudebros he forgot their anniversary and broke Angela’s heart. Angela wants Nicky’s strong arms around her again, but first she wants him to fight for her. Can one night, a paddle and some restraints bridge the gap between them? Winter’s Daughter by Doug BlakesleeA child of the Fae—bound to winter and a promise given to her chosen mate. She must claim him before time runs out and all she loves in the world falls to ruin. A child of mortals—forgotten and discarded by the world, then torn from the most amazing woman he’s ever met. Trapped in the sort of fae-tale that rarely ends in happily ever after, are they strong enough to defy the odds and find love? Stealing Time by Wendy SparrowAs Father Time’s son, Zeit must sacrifice a mortal’s lifetime to the Fates each New Year’s Eve. Last year—inexplicably, really—he made an 11:59 substitution. The Fates are pissed and they’re after his mortal Hannah. With the year ending, he ought to figure out why he’d saved her—and why he keeps doing it. Following an unlucky year, Hannah needs a week’s holiday in a lodge to unwind. What she gets is near-death experiences and a sexy immortal who can’t avoid kissing her, but might have to kill her. After all, even Zeit can’t hold back time indefinitely.",
  "genres": [
    "Erotic Romance",
    "Anthologies",
    "Erotica",
    "Romance"
  ],
  "author": "Cori Vidae",
  "average_rating": "3.95",
  "url": "https://www.goodreads.com/book/show/27475969-the-naughty-list"
}