{
  "title": "Cotton Candy on a Rainy Day",
  "description": "A pivotal work in Nikki Giovanni's career, Cotton Candy on a Rainy Day is one of the most poignant and intorspective of all Giovanni's collections. Moving from the emotionally fraught political arena to the intimate realm of the personal, the poems in this volume express a conflicted consciousness and the disillusionment shared by so many during the early 1970s, when the dreams of the Civil Rights era seemed to have evaporated. First published in 1978, this classic will remind her readers why they were first drawn to Nikki Giovanni and enthrall new readers who are just now coming to these timeless poems. As a witness to three generations, Nikki Giovanni has perceptively and poetically recorded her observations of both the outside world and the gentle yet enigmatic territory of the self. When her poems first emerged from the Black Rights Movement in the late 1960s, she immediately became a celebrated and controversial poet of the era. Written in one of the most commanding voices to grace America'ss political and poetic landscape at the end of the twentieth century, Nikki Giovanni's poems embody the fearless passion and spirited wit for which she is beloved and revered. A pivotal work in Nikki Giovanni's career, Cotton Candy on a Rainy Day is one of the most poignant and introspective of all Giovanni's collections. Moving from the emotionally fraught political arena to the intimate realm of the personal, the poems in this volume express a conflicted consciousness and the disillusionment shared by so many during the early 1970s, when the dreams of the Civil Rights era seemed to have evaporated. First published in l978, this classic will remind her readers why they were first drawn to Nikki Giovanni and enthrall new readers who are just now coming to these timeless poems. As a witness to three generations, Nikki Giovanni has perceptively and poetically recorded her observations of both the outside world and the gentle yet enigmatic territory of the self. When her poems first emerged from the Black Rights Movement in the late 1960s, she immediately became a celebrated and controversial poet of the era. Written in one of themost commanding voices to grace America's political and poetic landscape at the end of the twentieth century, Nikki Giovanni's poems embody the fearless passion and spirited wit for which she is beloved and revered. \"Nikki Giovanni is one of our national treasures. For decades she has offered her wit and wisdom, her bruising honesty, and, above all, her unbounded love through these poems as a healing for herself, her community, and her country.\" --Gloria Naylor",
  "genres": [
    "Poetry",
    "Race",
    "Feminism",
    "Fiction",
    "Classics",
    "Adult",
    "African American Literature"
  ],
  "author": "Nikki Giovanni",
  "average_rating": "4.41",
  "url": "https://www.goodreads.com/book/show/275130.Cotton_Candy_on_a_Rainy_Day"
}