{
  "title": "Where Water Begins: New Poems and Prose",
  "description": "Where Water Begins, which arrives thirteen years after his last collection of new poems, resumes John Stone’s literary quest to express his fascination with life’s mysteries and miracles. Much has happened in the interim, as this collection of writing intimates. While Stone’s artistic gaze combines the perspectives of poet, physician, teacher, husband, and father, his world has changed, reorienting and deepening his vision. The title of the book suggests both a journey and an water as source, water as life―whether it flows as a rivulet near Stone’s cabin in the north Georgia mountains or circulates within the human body. To quote W. H. Auden (as the book’s title poem does):Thousands have lived without love,but none without water.To read Where Water Begins is to follow life’s eddies and flows―along the streets of Oxford, England, or through an Atlanta neighborhood (“Talking with the Mockingbird”); to experience not only “the bitter physics of the world” (the loss of a spouse in “Seeing in the Dark”) but also the healing that comes with the tincture of time (“Abid-ing”); to rediscover the triumphs and solace of humor (the terror of piano lessons in “Preludes”); to turn the corner of a day and find joy in a soap bubble floating down through busy traffic; to recognize one’s limitations (“He Attends Exercise Class―Once”); to encounter the incongruities of travel, like the third-floor Chicago hotel room with a sliding patio door but “my God―no patio outside!” (“The Good-bye, Good Morning, Hello Poem”); to experience and reexperience a spectacular ice storm (“Ice”); and to welcome and bless the voice of an infant grandchild.Stone’s poem to his granddaughter, “Singing from the West Coast,” concludes,None of the banquetsof this worldwould dare startwithout you.Where Water Begins is a book of many musics from a man attentive to the plenty, the mystery, and the passing of life’s banquets.",
  "genres": [
    "Poetry"
  ],
  "author": "John    Stone",
  "average_rating": "4.17",
  "url": "https://www.goodreads.com/book/show/2749534-where-water-begins"
}