{
  "title": "Surrender Your Heart",
  "description": "Secrets and fears… Everyone has them; Jack Murphy and Liam Connelly are no exception.  A secret brings Liam Connelly to D.C., but what he discovers upon his arrival is so much more than he expected. Hired to tend bar at Bottoms Up, Liam finds himself drawn to his enigmatic boss like a moth to a flame.  Jack “Dragon” Murphy dedicated his life to serving his country, but PTSD forces him into early retirement. Jack sets out to build a new dream with the love and support of his family, friends, and his dog, Charlie. Bottoms Up becomes his new beginning and his solace from the inner turmoil caused by the secret he has been hiding for twenty years. A secret he is able to deny until he meets Liam.  Jack is rocked by the death of the man he respects above all others. His loss brings about a new discovery, making him realize that things aren’t always what they seem.  Fear of rejection keeps Liam from revealing the truth of why he came to town and guilt is eating him alive. He’s built a new life with wonderful friends and losing all of it seems like more than he can handle. He turns to the man who has come to mean so much to him and learns that he’s not the only one hiding a secret.  Jack wants Liam more than his next breath, but can he take the risk of losing everyone he holds dear; to take that leap that will either bring him happiness or cause him to lose the one person who makes him feel complete?  Jack and Liam join forces to find closure for Jack’s lost hero and learn a lot more about themselves and each other along the journey. Will these two men find a future together or will outside forces keep them apart? Are they brave enough to surrender their hearts to one another or will fear break their bond?  Surrender Your Heart is the third book in the Fated Hearts Series. It can be read as a standalone book, but has many characters that have been introduced in Chasing Mr. Wright and Rhythm of Us.  *This book contains sexually explicit material and is intended for adults only.",
  "genres": [
    "M M Romance",
    "Romance",
    "Contemporary",
    "LGBT",
    "Military Fiction",
    "Friends To Lovers",
    "Adult"
  ],
  "author": "Aimee Nicole Walker",
  "average_rating": "4.17",
  "url": "https://www.goodreads.com/book/show/27516724-surrender-your-heart"
}