{
  "title": "A Rare Breed of Love: The True Story of Baby and the Mission She Inspired to Help Dogs Everywhere",
  "description": "When you meet Baby, the first thing you notice is her limp. She only has three legs, you see -- she lost one following years of mistreatment at a puppy mill. But spend a little more time with Baby and her irrepressible \"Ma,\" Jana Kohl, and you'll hear the story of how this gentle creature has gone from puppy-mill victim to celebrity \"spokesdog\" -- hobnobbing with celebrities, lobbying politicians, and inspiring an entire movement to end the kind of animal abuse she suffered for so many years. Several years ago, Jana decided she wanted to buy a toy poodle. But the nightmarish conditions she was confronted with at a breeder's farm -- hundreds of dogs confined to small, dirty cages for their entire lives until they were killed for the crime of being too old to produce puppies -- opened her eyes to abuses in the world of commercial breeding. There are thousands of puppy mills all across the United States, and most of those cute little puppies in pet store windows are products of such nightmarish places. Jana knew this was a wrong she couldn't ignore. Her first step was to adopt a rescued adult dog instead of buying a puppy from a commercial breeder. And that's how she found Baby, a roughly nine-year-old poodle who had been locked in a cage. But Jana's mission didn't stop there. Soon, Jana and Baby (whose sweet face and three-legged hobble attract attention wherever she goes) found themselves speaking to groups about the terrible conditions at many breeders' farms and urging politicians to change the lax laws that regulate this industry. Today, Baby is the unofficial spokesdog for the Humane Society of the United States on the topic of puppy mills, and she and Jana travel around the country lobbying for reform on this important issue. A Rare Breed of Love contains more than sixty photographs of Baby with many of her high-profile fans, from Barack Obama to Judge Judy to Patti LaBelle, as well as original essays from luminaries such as Alice Walker and Gloria Steinem about the special love we all have for the pets in our lives. In this heartbreaking, compelling, and ultimately heart-warming book, Jana Kohl and Baby offer practical advice on what each of us can do to raise awareness, make a difference, and stop animal suffering everywhere.",
  "genres": [
    "Animals",
    "Nonfiction",
    "Dogs"
  ],
  "author": "Jana Kohl",
  "average_rating": "4.19",
  "url": "https://www.goodreads.com/book/show/2754643-a-rare-breed-of-love"
}