{
  "title": "Travels of William Bartram",
  "description": "For years, serious naturalists have treasured their copies of Francis Harper's naturalist's edition of The Travels of William Bartram as the definitive version of Bartram's pioneering survey. Complete with notes and commentary, an annotated index, maps, a bibliography, and a general index, this classic is now back in print for the first time in decades. Harper's knowledge of natural history transforms Bartram's accounts of the southern states from a curious record of personal observation from the past into a guidebook useful to modern biologists, historians, ornithologists, and ethnologists.In 1773 the naturalist and writer William Bartram set out from Philadelphia on a four-year journey ranging from the Carolinas to Florida and Mississippi. For Bartram it was the perfect opportunity to pursue his interest in observing and drawing plants and birds. Combining precise and detailed scientific observations with a profound appreciation of nature, he produced a written account of his journey that would later influence both scientists and poets, including Wordsworth and Coleridge.Bartram was among the first to integrate scientific observations and personal commentary. Unlike most of his contemporaries, he condemned the idea that nature was simply a resource to be consumed. Instead, he championed the aesthetic and scientific values of an \"infinite variety of animated scenes, inexpressibly beautiful and pleasing.\" From his field journals he prepared a report for his benefactor and a larger report for the public. The former was rediscovered much later and published in 1943; the latter was published in 1791 and became the basis for the modern Bartram's Travels.",
  "genres": [
    "History",
    "Nonfiction",
    "Travel",
    "Science",
    "Nature",
    "Natural History",
    "Memoir"
  ],
  "author": "William Bartram",
  "average_rating": "3.91",
  "url": "https://www.goodreads.com/book/show/2760202-travels-of-william-bartram"
}