{
  "title": "Stranded",
  "description": "Daily lotteries take females from the dying Earth, to the planet of Karal. Their sole purpose has been to breed with the Karal to make their next generation.  Until now.  Seven lottery winners are chosen to compete, to go on the first deep space mission, to find a new planet for the humans to call home. Only one gets to go. The rest will be sent to the farming belt.  Bronwyn has always wanted a child, but she cannot bear the idea of sentencing a child to a life on the dying Earth. Instead, she uses her extra coin to help her brother and his family. But she can't help entering the lottery, in the hope she can fulfil her dream of having her own child one day on the planet Karal.  However, when she does win the lottery, she has another decision to make. Win the trials and become the first human female to go into deep space, or live safely on Karal.  She hopes if she discovers a new planet, she might be able to secure a place for her brother and his family there. That is the only reason she tries her best, it has nothing to do with not wanting to lose to Lucile, a pent from Earth. Or her attraction to the huge, well muscled Karalian who will be her companion on the mission.  Quin is the pilot of the first deep space mission, he would rather go alone than with a female. But he has no choice, he must fulfil his duties and breed before his prime ends. To make sure his son is strong and intelligent, he is willing to put his own preferences aside and take the winner of the trials.  But the more he sees of Bronwyn, the more he wants to put aside his best judgement. Even if it means putting the mission in at risk, because he knows she makes him feel things that might influence his actions.  And that could be bad news for them both, and the whole of the human race.  Contains strong sexual themes and is meant for adults only.",
  "genres": [
    "Science Fiction",
    "Romance",
    "Aliens",
    "Science Fiction Romance",
    "Fantasy",
    "Paranormal",
    "Erotica"
  ],
  "author": "Harmony Raines",
  "average_rating": "4.02",
  "url": "https://www.goodreads.com/book/show/27576793-stranded"
}