{
  "title": "الدماغ وكيف يطور بنيته وأداءه",
  "description": "\"يتحدث هذا الكتاب عن الاكتشاف الثوري بأن الدماغ البشري يمكن أن يغّير نفسه\"، وكما علّقت عليه صحيفة النيويورك تايمز: \"تفوز قوة التفكير الإيجابي أخيراً بالمصداقية العلمية. إخضاع الدماغ. وصنع المعجزات، وترويض الحقيقة..كتاب يجسر الثغرة بين العلم ومساعدة النفس\".لقد ساد في الأوساط العلمية، وبعد عدة تجارب لم تؤد إلى النجاح المطلوب، أو كان نجاحها محدود زمنياً، أن \"العلاج للعديد من المشاكل الدماغية هو غير فعّال وحتى غير مبرّر\"، وأن \"الدماغ لا يمكن أن يتغير\"، وبالتالي \"فإن الطبيعة البشرية المنبثقة منه بدت بالضرورة ثابتة وغير قابلة للتغيير أيضاً\". يبيّن مؤلف هذا الكتاب عكس ذلك تماماً، عبر هذه الدراسة العلمية والبحث الميداني وعبر النتائج الإيجابية المدهشة التي أحرزها العديد من العلماء مع مجموعة من الحالات السريرية، مما يعتبر ثورة في هذا المجال ستكون لها تأثيرات عميقة تطال \"فهمنا للكيفية التي يغيّر بها الحب والحزن والعلاقات والتعلّم والإدمان والثقافة والتكنولوجيا والعلاجات النفسية، أدمغتنا\".بحسب المؤلف المشهور والطبيب والمحلل النفسي، فإن \" فكرة أن الدماغ يمكن أن يغيّر تركيبه من خلال التفكير والنشاط هي، برأيي، التعديل الأهم في نظرتنا للدماغ منذ أن وضعنا لأول مرة مخططاً لتركيبه البنيوي الأساسي وأعمال مكونّه الأساسي، إلا وهو \"العصبون\" أو الخلية العصبية\". فتح هذا الاكتشاف، و\"هو بكل تأكيد واحد من أكثر الاكتشافات استثنائية في القرن العشرين\"، والذي توصلت إليه مجموعة العلماء المتخصصين، باب علم جديد خاص بالأدمغة المتغيرة سمي: \"اللدونة العصبية\"، وهو مصطلح يشير إلى \"ليونة الخلايا العصبية في أدمغتنا وأجهزتنا العصبية وقابليتها للتغيير\".يجد القارئ في هذا الكتاب مجموعة اللقاءات التي قام بها المؤلف مع هؤلاء العلماء الاختصاصيين في هذا العلم الجديد، ليبرز أهمية ما توصلوا إليه نتيجة الممارسة والتعامل مع حالات مرضية معينة، وليخبر تفاصيل تجاربهم مع مرضاهم \"الذين حولوا حياتهم\".يروي المؤلف قصصاً عن حالات مرضية شفيت عن طريق هؤلاء الاختصاصيين الجدد، بعد أن خضعت \"لتحولات اللدونة العصبية\": امرأة كانت تقع باستمرار لأنها كانت تشعر أنها تقع، وأخرى استطاعت أن تشفي نفسها من صفة \"متخلفة عقلياً\"، و ضحايا سكتات دماغية سيتعلمون أن يتحرّكوا ويتكلّموا مرة أخرى، وغيرها، وسيبرهن كيف أن خاصية قدرة الدماغ على التغيّر يمكنها زيادة حدة الإدراك الحسي والذاكرة وزيادة سرعة التفكير وإشفاء مشاكل التعلّم، كما أن بإمكانها إيقاف القلق والوسواس والرغبات القسرية والعادات السيئة، كما سيربط علاقتها بالجاذبية الجنسية والحب، إلى ما هنالك، لأن هذه الخاصية المكتشفة ستمتد آثارها لتشمل جميع العلوم الإنسانية والاجتماعية والفيزيائية، و\"سيكون على جميع فروع العلم هذه أن تتوافق مع حقيقة الدماغ المتغيّر ذاتياً ومع حقيقة أن بناء الدماغ يختلف من شخص إلى آخر وأنه يتغيّر في سياق حياتنا الفردية\".",
  "genres": [
    "Nonfiction",
    "Science",
    "Psychology",
    "Neuroscience",
    "Brain",
    "Health",
    "Self Help"
  ],
  "author": "Norman Doidge",
  "average_rating": "4.20",
  "url": "https://www.goodreads.com/book/show/11751143"
}