{
  "title": "Born in Blood: The Mafia Chronicles Collection",
  "description": "This boxed set includes the first three books in the Born in Blood Mafia Bound By Honor (Book 1)Bound By Duty (Book 2)Bound By Hatred (Book 3)Bound By Born into one of the leading Mob families in Chicago, Aria Scuderi struggles to find her own path in a world where no choices are given. Aria was only fifteen when her parents betrothed her to Luca – The Vice – Vitiello, the oldest son of the head of the New York Cosa Nostra to ensure peace between the two families.Now at eighteen, the day Aria has been dreading for years is looming her wedding to Luca.Aria is terrified of marrying a man she hardly knows, especially someone like Luca who got his nickname ‘the Vice’ for crushing a man’s throat with his bare hands. Luca might be one of the most sought after men in New York thanks to his good looks, wealth and predator-like charisma that radiates power, but the society girls throwing themselves at him don’t know what Aria that the bad boy aura isn’t just a game; blood and death lurk beneath Luca’s striking gray eyes and arrogant smile.In her world a handsome exterior often hides the monster within; a monster who can just as easily kill as kiss you.The only way to escape the marriage to Luca would be to run away and leave everything she’s ever known behind but Aria can’t bear the thought of never seeing her family again.Despite her fear, she decides to go through with the marriage; Aria has grown up among predators like Luca and knows that even most cold-hearted bastards have a heart and she has every intention of working her way into Luca’s.Bound By Dante – The Boss – Cavallaro’s wife died four years ago. On the verge of becoming the youngest head in the history of the Chicago mafia, Dante needs a new wife and Valentina was chosen for the role.Valentina lost her husband, too, but her first marriage had always been for show. When she was eighteen, she agreed to marry Antonio in order to hide the that he was gay and in love with an outsider. Even after his death, she kept his secret, not only to preserve the honor of a dead man, but also to protect herself. But now that she’s about to marry Dante, her castle of lies threatens to crash. Dante is only thirty-six but already feared and respected in the Familia, and he’s notorious for always getting what he wants. Valentina is terrified of the wedding night that might reveal her secret, but her worries prove unfounded when Dante shows her the cold shoulder. Soon her fear is replaced by confusion and indignation. Valentina is tired of being ignored. She’s determined to get Dante’s attention and desire, even if she can’t get his heart that still belongs to his dead wife.Bound By HatredWhen Gianna watched her sister Aria getting married to a man she barely knew, she promised herself she wouldn’t let the same thing happen to her.Matteo Vitiello set his eyes on Gianna the moment he saw her on his brother Luca’s wedding, and Rocco Scuderi is more than willing to give his daughter to him, but Gianna has no intention of marrying for any other reason than love. A few months before the wedding, Gianna escapes her bodyguards and runs away. She has enough money to flee to Europe and begin a new life. But staying undetected when the mob is searching for her is a challenge that takes everything, especially as one of their best hunters and assassins is after Matteo.After six months on the run, Gianna finally settles into a tentative routine in Munich, but then Matteo and a couple of her father’s soldiers find her with another man.Despite her pleads they kill her boyfriend, and Gianna is forced to marry Matteo. Her emotions alternating between guilt over having dragged an innocent into her world and hatred toward Matteo, Gianna is determined to make life hell for her husband. But Matteo is a master at mind games and their struggle for power soon turns into hate-fueled nights of passion.",
  "genres": [
    "Dark",
    "Mafia Romance",
    "Crime",
    "Romance",
    "Dark Romance"
  ],
  "author": "Cora Reilly",
  "average_rating": "4.51",
  "url": "https://www.goodreads.com/book/show/27642791-born-in-blood"
}