{
  "title": "The Bridge over the Racial Divide: Rising Inequality and Coalition Politics (Wildavsky Forum Series)",
  "description": "In a work that will significantly influence the political discussion with respect to race and class politics, one of the country's most influential sociologists focuses on the rising inequality in American society and the need for a progressive, multiracial political coalition to combat it. The culmination of decades of distinguished scholarship, The Bridge over the Racial Divide brilliantly demonstrates how political power is disproportionately concentrated among the most advantaged segments of society and how the monetary, trade, and tax policies of recent years have deepened this power imbalance. Developing his earlier views on race in contemporary society, William Julius Wilson gives a simple, straightforward, and crucially important diagnosis of the problem of rising social inequality in the United States and details a set of recommendations for dealing with it.Wilson argues that as long as middle- and working-class groups are fragmented along racial lines, they will fail to see how their combined efforts could change the political imbalance and thus promote policies that reflect their interests. He shows how a vision of American society that highlights racial differences rather than commonalities makes it difficult for Americans to see the need and appreciate the potential for mutual political support across racial lines.Multiracial political cooperation could be enhanced if we can persuade groups to focus more on the interests they hold in common, including overcoming stagnating and declining real incomes that relate to changes in the global economy, Wilson argues. He advocates a cross-race, class-based alliance of working-and middle-class Americans to pursue policies that will deal with the eroding strength of the nation's equalizing institutions, including public education, unions, and political structures that promote the interests of ordinary families. He also advocates a reconstructed \"affirmative opportunity\" program that benefits African Americans without antagonizing whites. Using theoretical arguments and case studies, Wilson examines how a broad-based political constituency can be created, sustained, and energized. Bold, provocative, and thoughtful, The Bridge over the Racial Divide is an essential resource in considering some of the most pressing issues facing the American public today.This book is a copublication with the Russell Sage Foundation.",
  "genres": [
    "Politics"
  ],
  "author": "William Julius Wilson",
  "average_rating": "3.52",
  "url": "https://www.goodreads.com/book/show/276299.The_Bridge_over_the_Racial_Divide"
}