{
  "title": "Howards End",
  "description": "Howards End, by E. M. Forster, is part of the Barnes & Noble Classics series, which offers quality editions at affordable prices to the student and the general reader, including new scholarship, thoughtful design, and pages of carefully crafted extras. Here are some of the remarkable features of Barnes & Noble Classics:All editions are beautifully designed and are printed to superior specifications; some include illustrations of historical interest. Barnes & Noble Classics pulls together a constellation of influences—biographical, historical, and literary—to enrich each reader's understanding of these enduring works. Considered by many to be E. M. Forster’s greatest novel, Howards End is a beautifully subtle tale of two very different families brought together by an unusual event. The Schlegels are intellectuals, devotees of art and literature. The Wilcoxes are practical and materialistic, leading lives of “telegrams and anger.” When the elder Mrs. Wilcox dies and her family discovers she has left their country home—Howards End—to one of the Schlegel sisters, a crisis between the two families is precipitated that takes years to resolve. Written in 1910, Howards End is a symbolic exploration of the social, economic, and intellectual forces at work in England in the years preceding World War I, a time when vast social changes were occurring. In the Schlegels and the Wilcoxes, Forster perfectly embodies the competing idealism and materialism of the upper classes, while the conflict over the ownership of Howards End represents the struggle for possession of the country’s future. As critic Lionel Trilling once noted, the novel asks, “Who shall inherit England?”Forster refuses to take sides in this conflict. Instead he poses one of the book’s central questions: In a changing modern society, what should be the relation between the inner and outer life, between the world of the intellect and the world of business? Can they ever, as Forster urges, “only connect”?Mary Gordon is a McIntosh Professor of English at Barnard College. Her best-selling novels include Final Payments, The Company of Women, and Spending. She has also published a memoir, a book of novellas, a collection of stories, and two books of essays. Her most recent work is a biography of Joan of Arc.",
  "genres": [
    "Fiction",
    "Classics",
    "Historical Fiction",
    "Literature",
    "British Literature",
    "Novels",
    "20th Century"
  ],
  "author": "E.M. Forster",
  "average_rating": "3.96",
  "url": "https://www.goodreads.com/book/show/27621.Howards_End"
}