{
  "title": "Eclipse",
  "description": "Also see: Alternate Cover Editions for this ISBN [ACE] \nACE #1\nIn the dead silence, all the details suddenly fell into place for me with a burst of intuition. Something Edward didn't want me to know. Something that Jacob wouldn't have kept from me.... It was never going to end, was it?\"BELLA?\"Endward's soft voice came from behind me. I turned to see him spring lightly up the porch steps, his hair windblown from running. He pulled me into his arms at once, just like he had in the parking lot, and kissed me again. This kiss frightened me. There was too much tension, too strong an edge to the way his lips crushed mine - like he was afraid we had only so much time left to us.AS SEATTLE IS RAVAGED BY A STRING OF mysterious killings and a malicious vampire continues her quest for revenge, Bella once again finds herself surrounded by danger. In the midst of it all, she is forced to choose between her love for Edward and her friendship with Jacob - knowing that her decision has the potential to ignite the ageless struggle between vampire and werewolf. With her graduation quickly approaching, Bella has one more decision to make: life or death. But which is which?READERS CAPTIVATED BY Twilight AND New Moon will eagerly devour Eclipse, the much-anticipated third book in Stephenie Meyer's riveting vampire love saga. LEGIONS OF READERS ARE HUNGRY FOR MORE.This special edition of the #1 New York Times bestseller includes:The first chapter of Breaking Dawn, the fourth book in the Twilight Saga.A limited-edition, full-color poster (on reverse side of book jacket), featuring stunning cover art from Breaking Dawn.Exclusive \"Team Edward\" and \"Team Jacob\" T-shirt transfers.GIVE IN TO TEMPTATION....",
  "genres": [
    "Fantasy",
    "Young Adult",
    "Romance",
    "Vampires",
    "Fiction",
    "Paranormal",
    "Paranormal Romance"
  ],
  "author": "Stephenie Meyer",
  "average_rating": "3.74",
  "url": "https://www.goodreads.com/book/show/2764437-eclipse"
}