{
  "title": "The Enchanted Collection",
  "description": "Ella Enchanted How can a fairy'sblessing be such a curse?At her birth, Ella of Frell was the unfortunate recipient of a foolish fairy's gift—the \"gift' of obedience. Ella must obey any order given to her, whether it's hopping on one foot for a day and a half, or chopping off her own head! But strong-willed Ella does not tamely accept her fate. Against a bold backdrop of princes, ogres, giants, wicked stepsisters, and fairy godmothers, Ella goes on a quest to break the curse—once and for all.The Two Princesses of BamarreWhen a plague strikes Bamarre, Princess Addie must save her sister.Brave and adventureous, Princess Meryl dreams of fighting dragons and protecting the kingdom of Bamarre. Shy and fearful, Princess Addie is content to stay within the safety of the castle walls. The one thing that the sisters share is their unwavering love for each other.The tables are turned, however, when the Gray Death leaves Meryl fatally ill. To save her sister, meek Princess Addie must find the courage to set out on a dangerous quest filled with dragons, unknown magic, and death itself. Time is running out, and the sisters' lives—and the future of the kingdom of Bamarre—hang in the balance. FairestOnce upon a time, there was a girl who wanted to be pretty . . .Aza's singing is the fairest in all the land, and the most unusual. She can \"throw\"t her voice so it seems to come from anywhere. But singing is only one of the two qualities prized in the Kingdom of Ayortha. Aza doesn't possess the other: beauty. Not even close. She's hidden in the shadows in her parents' inn, but when she becomes lady-in-waiting to the new queen, she has to step into the light—especially when the queen demands a dangerous favor. A magic mirror, a charming prince, a jealous queen, palace intrigue, and an injured king twine into a maze that Aza must penetrate to save herself and her beloved kingdom.",
  "genres": [
    "Fantasy",
    "Young Adult",
    "Princesses",
    "Fairy Tales",
    "Fiction",
    "Adventure",
    "Fairy Tale Retellings"
  ],
  "author": "Gail Carson Levine",
  "average_rating": "4.41",
  "url": "https://www.goodreads.com/book/show/2762487-the-enchanted-collection"
}