{
  "title": "Not Quite A Mom",
  "description": "From the acclaimed author of Not Quite a Bride comes a romantic new novel about a woman with a plan-for love, life, marriage, and motherhood-and how one phone call upends it all. When Elizabeth Castle's handsome Beverly Hills boyfriend Daniel McCafferty proposes, she feels like all her hard work has finally paid off. Granted, her fact-checking job for a tabloid TV show isn't exactly the news anchor spot she aspires to, but she's come a long way from the backward hometown she left at eighteen. That is until a lawyer from Victory, California, calls to announce that Elizabeth's best childhood friend has died and left custody of her teenage daughter, Tiffany, to Elizabeth . . . Buck Planter, a former high school football star in Victory, has never forgotten his senior prom date, Lizzie Castle, and her irresistible, too-cool-for-school attitude. He always hoped he'd reconnect with her, but arriving at Elizabeth's doorstep with Tiffany in tow isn't exactly the kind of romantic reunion he'd envisioned. Though fate might have other ideas when at the prospect of instant fatherhood Elizabeth's fiance breaks off their engagement . . . Funny and heartwarming, Not Quite a Mom is a delightfully unexpected story of modern love and accidental motherhood from \"an extremely talented author\" (Fresh Fiction). More Praise For Kirsten Sawyer And Not Quite A Bride \"Endearing characters . . . hard to put down and leaves you hoping for a sequel\" -Romantic Times (4 ½ stars) \"Funny, quirky lead characters and fully developed, wonderful supporting characters . . . a zany ride through a modern woman's quest to fulfill her fantasy . . . A terrific look at modern friendship, family, and weddings\" -Romance Reviews Today Not Quite A Bride \"A sympathetic character . . . weddings are a popular subject for romance readers so this book is sure to be popular\" -Booklist \"A delightfully hilarious debut\" -Fresh Fiction Kirsten Sawyer graduated from the",
  "genres": [
    "Chick Lit",
    "Romance"
  ],
  "author": "Kirsten Sawyer",
  "average_rating": "3.32",
  "url": "https://www.goodreads.com/book/show/2768841-not-quite-a-mom"
}