{
  "title": "Healing Is a Choice: 10 Decisions That Will Transform Your Life and 10 Lies That Can Prevent You From Making Them",
  "description": "DO YOU WANT TO GET WELL? The power to heal―physically, mentally, emotionally, spiritually―is in God’s hands. But the choice to be healed is yours. Everyone, at some level, needs healing. You may have prayed for healing many times, for many years. Perhaps you have lived with your brokenness so long that you have become accustomed to it. Maybe you wonder just when God is going to take all the hurt away. He can. But you also must choose to let the hurt go and let the healing begin. In this special edition of Healing Is a Choice , author Stephen Arterburn offers a unique combination of book and workbook, outlining ten choices crucial to receiving healing. Embracing these choices means rejecting the lies we often tell ourselves. These are not hoops God requires you to jump through to earn your miracle; they form, instead, the journey He desires for you. He can―and will―walk with you. But you must put one foot in front of the other and choose to let the hurt go and let the healing begin. “His Word affirms that God wants us to experience His healing, but many times we make choices that stand in the way. Healing Is a Choice is a helpful resource that lays out the path of healing God’s way.” ― JACK HAYFORD Founding pastor, The Church on the Way, Van Nuys, CA “When we look back at the past turns and twists in the pathways of our lives, we can see significant choices we made, which helped create the lives we have now. Stephen Arterburn has provided us with a guide for making the right decisions today to provide a redemptive path for tomorrow.” ―JOHN TOWNSEND Coauthor of the bestseller Boundaries “I am asking you to give up your life as you know it so that you can fi nd the life God has for you. Take hold of your future today and make the choices that will lead to your healing.” ―STEPHEN ARTERBURN “He heals the brokenhearted and binds up their wounds.\" ―Psalm 147:3",
  "genres": [
    "Christian",
    "Self Help",
    "Nonfiction",
    "Faith",
    "Christian Living",
    "Health",
    "Psychology"
  ],
  "author": "Stephen F. Arterburn",
  "average_rating": "4.19",
  "url": "https://www.goodreads.com/book/show/11751802-healing-is-a-choice"
}