{
  "title": "Un mundo sin fin",
  "description": "Han pasado ya 16 años desde la publicación de Los pilares de la Tierra. Ken Follet vuelve al fascinante mundo de Kingsbridge para presentar a sus lectores una magnífica saga épica marcada por el amor, la guerra y la peste. Los pilares de la Tierra narra los acontecimientos de la ciudad inglesa de Kingsbridge entre 1135 y 1174. Con Un mundo sin fin regresamos a Kingsbridge, pero 153 años después. El primer día de noviembre de 1327 cuatro niños escapan de la catedral de Kingsbridge para jugar en un bosque prohibido. Son, Gwenda, hija de un ladrón, Caris, una niña excepcional que quiere ser doctora y los hermanos Merthin y Ralph, el primero un genio con la cabeza llena de inventos y el segundo un tirano, cruel y vengativo. Allí en el bosque serán testigos de una pelea entre un caballero y dos soldados. Los soldados mueren y el caballero entierra un documento antes de ingresar en el monasterio de Kingsbridge para convertirse en monje el resto de su vida. El contenido de este documento secreto jugará un papel importante en varios momentos de la novela. Como adultos las vidas de estos cuatro niños se verán entrelazadas por la ambición, el amor, el odio y la venganza. Vivirán momentos de gran prosperidad y también de hambruna; años de guerra y años de peste. Caris, es la hija de un mercader de lana. De pequeña quería ser doctora, profesión prohibida a las mujeres en la Edad Media. Sin embargo, Caris no acepta ni esta ni ninguna otra prohibición. Estudia con una curandera y mantiene constantes enfrentamientos con la iglesia. Su lucha por la independencia y su determinación a no someterse a ningún hombre pone constantemente en conflicto su amor por Merthin. Merthin, por su lado, comienza como aprendiz de carpintero y su gran talento le convierte en el mejor arquitecto de Kingsbridge. No acepta las restricciones y limitaciones de los que mandan en la ciudad. Cuando ve que no puede casarse con Caris ni realizar sus proyectos soñados decide viajar a Italia. Ralph, hermano de Jack, tiene un carácter violento, cruel y vengativo. Sus proezas en la guerra contra Francia le llevarán a una posición de poder pero siempre será víctima de su propio rencor, corrupción y odio. Gwenda, hija de un ladrón, luchará para conseguir el hombre que adora pero su vida será siempre dura y trabajará en el campo de sol a sol para alimentar a sus hijos. Kingbridge es el lugar central de esta maravillosa novela con su catedral, monjes y monjas, su burguesía y sus obreros. Sin embargo, el eje central es la peste, el desastre más grande que asoló la humanidad durante la Edad Media. Es la peste la causante de muchas de las calamidades. De repente no habían campesinos para cultivar los campos, ni curas para enterrar a los muertos y predicar en las iglesias, ni mercaderes para comprar y vender.. y para los que sobrevivieron todo había cambiado. La peste negra llegó a Inglaterra en 1348 y durante los dos años siguientes mató entre el 30% y el 40% de la población. Las brotes de peste que asolaron Europa durante cientos de años crearon momentos excepcionales que propiciaron los acontecimientos extraordinarios que viven nuestros protagonistas.",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Historical",
    "Audiobook",
    "Medieval",
    "British Literature",
    "Fantasy"
  ],
  "author": "Ken Follett",
  "average_rating": "4.32",
  "url": "https://www.goodreads.com/book/show/2768070-un-mundo-sin-fin"
}