{
  "title": "The Physics of NASCAR: How to Make Steel + Gas + Rubber = Speed",
  "description": "Every NASCAR fan – at one time or another – asks the same question: Why isn’t my favorite driver winning? This is your chance to discover how much more there is to NASCAR than “Go fast, turn left and don’t crash.” If you’ve ever wondered why racecars don’t have mufflers, how “bump drafting” works, or what in the world “Let’s go up a pound on the right rear and add half a round of wedge” means, The Physics of NASCAR is for you. In this fast-paced investigation into the adrenaline-pumping world of NASCAR, a physicist with a passion uncovers what happens when the rubber hits the road and 800- horsepower vehicles compete at 190 miles per hour only inches from one another. Diandra Leslie-Pelecky reveals how and why drivers trust the engineering and science their teams literally build around them not only to get them across the finish line in first place, but also to keep them alive. Professor Leslie-Pelecky is a physicist in love with the sport’s beauty and power and is uniquely qualified to explain exactly how physics translates into winning races. Based on the author’s extensive access to race shops, pit crews, crew chiefs and mechanics, this book traces the life cycle of a race car from behind the scenes at top race shops to the track. The Physics of NASCAR takes readers right into the ultra competitive world of NASCAR, from the champion driver’s hot seat behind the detachable steering wheel to the New Zealander nicknamed Kiwi in charge of shocks for the No. 19 car. Diandra Leslie-Pelecky tells her story in terms anyone who drives a car--and maybe occasionally looks under the hood--can understand. How do drivers walk away from serious crashes? How can two cars travel faster together than either car can on its own? How do you dress for a 1800°F gasoline fire? In simple yet detailed, high-octane prose, this is the ultimate thrill ride for armchair speed demons, auto science buffs, and NASCAR fans at every level of interest. Readers, start your engines.",
  "genres": [
    "Science",
    "Sports",
    "Nonfiction",
    "Racing",
    "Physics"
  ],
  "author": "Diandra Leslie-Pelecky",
  "average_rating": "3.87",
  "url": "https://www.goodreads.com/book/show/2767203-the-physics-of-nascar"
}