{
  "title": "She and I",
  "description": "Unforgettable...I read this book a number of years ago and just can't get it out of my mind...The story of how these twins...grow up and become women is fascinating...if you have a super curious mind and enjoy a story quite odd, you will LOVE this book.5 stars Reader's Review (hardcover edition) from Amazon.com\"I found myself laughing out loud at some of the incidents, and also found it very interesting. Once I started reading it I couldn't put it down. I have loaned it to all of my friends who like to read, and they also found the book a very good read. Buy it! You won't be sorry.\"5 stars Reader's Review (hardcover edition) from Amazon.com\"The novel lives up to the wit of its premise... hilarious situations...Yet there's a touching story here too...an entirely recognizable sense of how hard it often is to live in a world with other people.\"Cosmopolitan Magazine\"...if you just want a satisfying, mind-bending reading experience, you will find what you are looking for in She and I...\"Mindi Dickstein, St. Petersburg (Florida) Times\"The questions that She and I make us ask are the endlessly fascinating ones...where is the real freakishness? In being a Jew? A woman? An intellectual? In not being pretty? In being desperately in love? Or is it really in being tied by a band of flesh to The Other, to the worst...nightmare any of us have?\"Amy Wallace, Los Angeles Times Sunday Book Review\"Through Lottman's masterful handling of her material, suspense is maintained...to the last page.\"Barbara Rich, Women's Review of Books\"...an extraordinary book. I read it months ago and the impression stayed with me so long that I've decided I must read it again and recommend it to all my friends (many of whom are writers, as I am).\"Dale Rhonda Burg, by unsolicited postcard to the author\"I was in stitches reading She and I.",
  "genres": [
    "Fiction"
  ],
  "author": "Eileen Lottman",
  "average_rating": "3.54",
  "url": "https://www.goodreads.com/book/show/2767255-she-and-i"
}