{
  "title": "My Addiction: Second Chances Series",
  "description": "Take every chance you get in life because some things only happen once! Ayana... I want him... There's no other way to say it; I want this man. Oh, I've wanted him since forever. He's just amazing. He's that perfect man you can't help but dream about. He has an amazing heart. He'll do anything for you. He has a smile that will make you melt where you stand. He has a body that's sheer perfection. And his eyes, oh man, they can look through your soul and strip you bare until you have no choice but to give yourself to him. It's a power he's had over me since the first day we met. Hands down, ladies, he's fine as hell. Oh, and his lips, goodness, I can't forget those. Let me tell you, the moment he touches you with his lips, you instantly cream. You can't help it. The feeling he generates is like no other. With just the simplest touch, he can make you soak with a need that only he can satisfy. He can effortlessly bring nothing but sweet ecstasy and pure desire all through your body. Do you see why I want him? He's my addiction, and I crave him with every second I draw breath. So why can't I have him? It's simple; I don't deserve him. You see I've had an opportunity to make him mine forever, and I blew it. I blew it so bad that I don't know if he'll ever give me another chance. But, oh, if he does, I promise you; I won't waste it. Brad... I've never met anyone like this woman. She had me the first day I laid my eyes on her. She's beautiful. No doubt about it; she's a goddess. She has curves that I can't keep my hands off of. Her skin is smooth like melted chocolate on your fingers. She has an unbelievable spirit and fierce loyalty that you'd want in your corner. Did I say she's sexy as shit? She turns me on with just the sheer thought of her. My favorite part of her are those lips of hers. Damn, I want to kiss her all the time. I can't get enough of her taste. She's made for me, I know this... I'm not denying that. I've been in love with her since before I even knew she existed. She's my best friend. I can't live without her. I just don't know if that's enough, if my love for her is enough. I want to give her a second chance, but I don't know if she's ready. They say that you only give second chances if a person has learned from their mistakes. What if she hasn't? What do you do when the one you love has an addiction stronger than you? Do you fight for her or do you let it consume you both? Life is about second chances. The question is can we survive?",
  "genres": [
    "Romance",
    "Interracial Romance",
    "Friends To Lovers",
    "Contemporary Romance",
    "Second Chance"
  ],
  "author": "S.K. Lessly",
  "average_rating": "4.33",
  "url": "https://www.goodreads.com/book/show/27729794-my-addiction"
}