{
  "title": "The Neoliberal Deluge: Hurricane Katrina, Late Capitalism, and the Remaking of New Orleans",
  "description": "Katrina was not just a hurricane. The death, destruction, and misery wreaked on New Orleans cannot be blamed on nature’s fury alone. This volume of essays locates the root causes of the 2005 disaster squarely in neoliberal restructuring and examines how pro-market reforms are reshaping life, politics, economy, and the built environment in New Orleans.The authors—a diverse group writing from the disciplines of sociology, political science, education, public policy, and media theory—argue that human agency and public policy choices were more at fault for the devastation and mass suffering experienced along the Gulf Coast than were sheer forces of nature. The harrowing images of flattened homes, citizens stranded on rooftops, patients dying in makeshift hospitals, and dead bodies floating in floodwaters exposed the moral and political contradictions of neoliberalism—the ideological rejection of the planner state and the active promotion of a new order of market rule.Many of these essays offer critical insights on the saga of postdisaster reconstruction. Challenging triumphal narratives of civic resiliency and universal recovery, the authors bring to the fore pitched battles over labor rights, gender and racial justice, gentrification, the development of city master plans, the demolition of public housing, policing, the privatization of public schools, and roiling tensions between tourism-based economic growth and neighborhood interests. The contributors also expand and deepen more conventional critiques of “disaster capitalism” to consider how the corporate mobilization of philanthropy and public good will are remaking New Orleans in profound and pernicious ways. Barbara L. Allen, Virginia Polytechnic U; John Arena, CUNY College of Staten Island; Adrienne Dixson, Ohio State U; Eric Ishiwata, Colorado State U; Avis Jones-Deweever, National Council of Negro Women; Chad Lavin, Virginia Polytechnic U; Paul Passavant, Hobart and William Smith Colleges; Linda Robertson, Hobart and William Smith Colleges; Chris Russill, Carleton U; Kanchana Ruwanpura, U of Southampton; Nicole Trujillo-Pagán, Wayne State U; Geoffrey Whitehall, Acadia U.",
  "genres": [
    "History",
    "Economics"
  ],
  "author": "Cedric Johnson",
  "average_rating": "3.86",
  "url": "https://www.goodreads.com/book/show/11752145-the-neoliberal-deluge"
}