{
  "title": "Arthur Spiderwick's Field Guide to the Fantastical World Around You",
  "description": "It all began with a strange, mysterious correspondence left for authors Tony DiTerlizzi and Holly Black at a small New England bookstore. Written by three siblings, the letter told of their great-great-uncle Arthur Spiderwick and an unfinished tome filled with eyewitness accounts of creatures otherwise thought to be the stuff of legend. In the #1 New York Times bestselling serial the Spiderwick Chronicles, readers were enthralled by the account of the those siblings, Jared, Simon, and Mallory Grace, as they battled dwarves, goblins, elves, and a diabolical ogre in their efforts to hold on to their uncle Spiderwick,s life work. Now, through the combined efforts of the Grace children and authors Tony DiTerlizzi and Holly Black, Simon & Schuster is thrilled to present that work to you!  Beginning with a thoughtful and informative introduction, progressing through six exhaustive sections featuring thirty-one faerie species, and culminating with an addendum that includes observations supplied by Jared Grace, this long-awaited compendium to the worldwide Spiderwick phenomenon delivers enough information to satisfy even the most demanding faerie enthusiast. Not only will readers learn the habits and habitats of the fourteen fantastical creatures featured in the New York Times, USA Today, and Publishers Weekly bestselling chapter books, but they will be delighted and astonished by an additional seventeen creatures. Also included are dozens of snippets from Arthur Spiderwick,s personal journal as well as cameos from a few series favorites.  With so much to offer, this book is destined to be pored over for generations to come!",
  "genres": [
    "Fantasy",
    "Childrens",
    "Middle Grade",
    "Fiction",
    "Art",
    "Magic",
    "Picture Books"
  ],
  "author": "Tony DiTerlizzi",
  "average_rating": "4.38",
  "url": "https://www.goodreads.com/book/show/277187.Arthur_Spiderwick_s_Field_Guide_to_the_Fantastical_World_Around_You"
}