{
  "title": "For Love of Leelah",
  "description": "**ALL PROCEEDS GO TO SUICIDE PREVENTION AND SUPPORT FOR LGBTQ YOUTH** In December of 2014 the world was rocked by the loss of a young trans woman named Leelah Alcorn, a young girl who, feeling trapped and alone without support in her community, ended her life violently on a wintry Ohio highway in a desperate plea that the world see kids like her and do something to stop their pain, to help them be who they were despite the conventions of society. Leelah was not alone, one of many young kids we lost that year and in the coming months, tragedy after tragedy which moved all of us who saw to take action, to do something to stand for the trans kids, let them know we saw In December of 2014 the world was rocked by the loss of a young trans woman named Leelah Alcorn, a young girl who, feeling trapped and alone without support in her community, ended her life violently on a wintry Ohio highway in a desperate plea that the world see kids like her and do something to stop their pain, to help them be who they were despite the conventions of society. Leelah was not alone, one of many youth lost that year and in the coming months, tragedy after tragedy, which moved all of us who saw to take action, to do something to stand for the trans kids, let them know we saw them, their spirit, and that they mattered, had every right to claim the long lives ahead of them for themselves. “For Love of Leelah: An Anthology About Souls” was created in the name of Leelah’s spirit, to honor her and every other transgender youth who ever needed it past and present, here and tragically gone. In so doing we found that cis and trans blended together, the differences between the authors fell to the wayside and the beauty of the human spirit came through in so many forms. May this anthology benefit LGBT youth the world over and may we never let their songs cease, so long as they need us to hear. From the minds of: Christina Engela, Peyton Pratt, Lorelei Shannon, Amanda M. Lyons, Ashley L. Hunt, Shawn Pfister, Alex Shalenko, Ceri Naz, Brenda Evans, Susan Simone, Magan Rodriguez, Charie D. LaMarr, Magenta Nero, Naomi Matthews, Essel Pratt, Sammy Bourgeois, Michelle Brown, Stephanie A. Kriel, Eris Threthewey, Tabitha Baoumander, Anastasia Vitsky, Aghori Shaivite, Brian Barr, and C. E. Kilgore Do you or someone you know need help? Contact The Trevor Project: http://www.thetrevorproject.org/ or call the hotline 24/7 at 866-488-7386 Founded in 1998 by the creators of the Academy Award®-winning short film TREVOR, The Trevor Project is the leading national organization providing crisis intervention and suicide prevention services to lesbian, gay, bisexual, transgender and questioning (LGBTQ) young people ages 13-24.",
  "genres": [
    "Transgender"
  ],
  "author": "Susan Simone",
  "average_rating": "4.09",
  "url": "https://www.goodreads.com/book/show/27738943-for-love-of-leelah"
}