{
  "title": "Conquistador: Hernán Cortés, King Montezuma, and the Last Stand of the Aztecs",
  "description": "In an astonishing work of scholarship that reads like an adventure thriller, historian Buddy Levy records the last days of the Aztec empire and the two men at the center of an epic clash of cultures. \n\n“I and my companions suffer from a disease of the heart which can be cured only with gold.” —Hernán CortésIt was a moment unique in human history, the face-to-face meeting between two men from civilizations a world apart. Only one would survive the encounter. In 1519, Hernán Cortés arrived on the shores of Mexico with a roughshod crew of adventurers and the intent to expand the Spanish empire. Along the way, this brash and roguish conquistador schemed to convert the native inhabitants to Catholicism and carry off a fortune in gold. That he saw nothing paradoxical in his intentions is one of the most remarkable—and tragic—aspects of this unforgettable story of conquest.In Tenochtitlán, the famed City of Dreams, Cortés met his Aztec counterpart, Montezuma: king, divinity, ruler of fifteen million people, and commander of the most powerful military machine in the Americas. Yet in less than two years, Cortés defeated the entire Aztec nation in one of the most astonishing military campaigns ever waged. Sometimes outnumbered in battle thousands-to-one, Cortés repeatedly beat seemingly impossible odds. Buddy Levy meticulously researches the mix of cunning, courage, brutality, superstition, and finally disease that enabled Cortés and his men to survive.Conquistador is the story of a lost kingdom—a complex and sophisticated civilization where floating gardens, immense wealth, and reverence for art stood side by side with bloodstained temples and gruesome rites of human sacrifice. It’s the story of Montezuma—proud, spiritual, enigmatic, and doomed to misunderstand the stranger he thought a god. Epic in scope, as entertaining as it is enlightening, Conquistador is history at its most riveting.From the Hardcover edition.",
  "genres": [
    "History",
    "Nonfiction",
    "Biography",
    "War",
    "Audiobook",
    "World History",
    "Historical"
  ],
  "author": "Buddy Levy",
  "average_rating": "4.29",
  "url": "https://www.goodreads.com/book/show/2774104-conquistador"
}