{
  "title": "When the Stars Go Cold",
  "description": "Dear Author,(Guy 1) He is a trained and seasoned warrior. Perhaps he is a defender, a mercenary for hire, a bodyguard. A shadow that follows you, without you knowing. Are his intentions good/bad? He had seen and experienced more than most in his life. Is he mortal? Does he age slower than normal humans? He appears to be a man who has always known the world, the good and the bad. He seems to be focused, solid. He knows what and when to expect certain things. Then he meets (intentionally or not?) (Guy 2) and his life is flipped inside out.(Guy 2) He is clumsy and innocent/naive. He has heard of the evil/bad, but has never experienced it first-hand. The people that surround him have both good and bad intentions. Is he just a pawn in some people’s eyes? Viewed more like a ‘product’ or ‘doll’. Born with the ability to bear children. (He knows and is educated about being a bearer). Is he (completely) human? Does he know of his true origins? Then he sees him (Guy 1) and his sheltered world changes.Photo Description: The two pictures show two different guys. The first one is black-haired, gray-eyed and has pointy ears. He is holding his head with one hand, as if something bad has happened and he is wondering what to do. The second one is blond, blue-eyed, and is sitting in shallow water like he has tripped and fallen.This story was written as a part of the M/M Romance Group's \"Love is an Open Road\" event. Group members were asked to write a story prompt inspired by a photo of their choice. Authors of the group selected a photo and prompt that spoke to them and wrote a short story. This story may contain sexually explicit content and is intended for adult readers. It may contain content that is disagreeable or distressing to some readers. The M/M Romance Group strongly recommends that each reader review the General Information section before each story for story tags as well as for content warnings.",
  "genres": [
    "Science Fiction",
    "M M Romance",
    "Romance",
    "Aliens",
    "Short Stories",
    "Military Fiction",
    "Dystopia"
  ],
  "author": "Destiny Kyle",
  "average_rating": "3.66",
  "url": "https://www.goodreads.com/book/show/27753214-when-the-stars-go-cold"
}