{
  "title": "What Belongs to You",
  "description": "Longlisted for the National Book Award in Fiction • A Finalist for the PEN/Faulkner Award for Fiction • A Finalist for the Los Angeles Times Book Prize for Fiction • A Finalist for the James Taite Black Prize for Fiction • A Finalist the Center for Fiction First Novel Prize • A Finalist for the Green Carnation Prize • A New York Times Book Review Editors’ Choice • A Los Angeles Times BestsellerNamed One of the Best Books of the Year by More Than Fifty Publications, The New Yorker, The Paris Review, The New York Times (selected by Dwight Garner), GQ, The Washington Post, Esquire, NPR, Slate, Vulture, the San Francisco Chronicle, The Guardian (London), The Telegraph (London), The Evening Standard (London), The Philadelphia Inquirer, The Miami Herald, The Millions, BuzzFeed, The New Republic (Best Debuts of the Year), Kirkus Reviews, and Publishers Weekly (One of the Ten Best Books of the Year)\"Garth Greenwell's What Belongs to You appeared in early 2016, and is a short first novel by a young writer; still, it was not easily surpassed by anything that appeared later in the year....It is not just first novelists who will be envious of Greenwell's achievement.\"—James Wood, The New YorkerOn an unseasonably warm autumn day, an American teacher enters a public bathroom beneath Sofia’s National Palace of Culture. There he meets Mitko, a charismatic young hustler, and pays him for sex. He returns to Mitko again and again over the next few months, drawn by hunger and loneliness and risk, and finds himself ensnared in a relationship in which lust leads to mutual predation, and tenderness can transform into violence. As he struggles to reconcile his longing with the anguish it creates, he’s forced to grapple with his own fraught history, the world of his southern childhood where to be queer was to be a pariah. There are unnerving similarities between his past and the foreign country he finds himself in, a country whose geography and griefs he discovers as he learns more of Mitko’s own narrative, his private history of illness, exploitation, and want.What Belongs to You is a stunning debut novel of desire and its consequences. With lyric intensity and startling eroticism, Garth Greenwell has created an indelible story about the ways in which our pasts and cultures, our scars and shames can shape who we are and determine how we love.A conversation between Garth Greenwell and Hanya Yanagihara is included inside the e-book edition.",
  "genres": [
    "Fiction",
    "LGBT",
    "Queer",
    "Contemporary",
    "Literary Fiction",
    "Gay",
    "Novels"
  ],
  "author": "Garth Greenwell",
  "average_rating": "3.78",
  "url": "https://www.goodreads.com/book/show/27751443-what-belongs-to-you"
}