{
  "title": "The Christmas Quilt",
  "description": "When Christmas Eve comes to Elm Creek Manor, the tenor of the holiday is far from certain. Sylvia Bergstrom Compson, the Master Quilter, has her own reasons for preferring a quiet, even subdued, Christmas. Her young friend Sarah McClure, however, takes the opposite view and decides to deck the halls brightly. As she explores the trunks packed with Bergstrom family decorations that haven't been touched in more than fifty years, Sarah discovers a curious Christmas quilt. Begun in seasonal fabrics and patterns, the quilt remains unfinished.  Sylvia reveals that the handiwork spans several generations and a quartet of Bergstrom quilters -- her great aunt, her mother, her sister, and herself. As she examines the array of quilt blocks each family member contributed but never completed, memories of Christmases past emerge.  At Elm Creek Manor, Christmas began as a celebration of simple virtues -- joy and hope buoyed by the spirit of giving. As each successive generation of Bergstroms lived through its unique trials -- the antebellum era, the Great Depression, World War II -- tradition offered sustenance even during the most difficult times. For Sylvia, who is coping with the modern problem of family dispersed, estranged, or even forgotten, reconciliation with her personal history may prove as elusive as piecing the Christmas Quilt.  Elm Creek Manor is full of secrets, from a Christmas tree with unusual properties to the sublime Bergstrom strudel recipe. Sylvia's tales at first seem to inform her family legacy but ultimately illuminate far more, from the importance of women's art to its place in commemorating our shared experience, at Christmastime and in every season.",
  "genres": [
    "Christmas",
    "Fiction",
    "Historical Fiction",
    "Quilting",
    "Holiday",
    "Chick Lit",
    "Audiobook"
  ],
  "author": "Jennifer Chiaverini",
  "average_rating": "3.90",
  "url": "https://www.goodreads.com/book/show/27748.The_Christmas_Quilt"
}