{
  "title": "For the Win",
  "description": "What happens when you fall for your biggest competition? Sara Rider scores with this charming romance about soccer stars battling their tough opponents and playing the field of love.Lainey Lukas has sacrificed everything—sleep, family, carbs, a life—to earn her spot as the top player and captain of the Seattle Falcons women’s soccer team. She’s determined to lead her team to a national championship and finally earn the sport the respect it deserves—and nothing will throw her off her game. When Lainey’s hero Gabe Havelak, star of the Seattle Surge, crashes her team’s first press conference—making the Falcons look like a joke to the local media and humiliating Lainey in the process—she’s hell-bent on revenge.Charming, confident Gabe is practically a god to Seattle soccer fans, but he doesn’t mind a little friendly competition from tough-as-nails Lainey, with her top-notch athletic skills, her mile-long legs, and her girl-next-door freckles. But when he learns the Falcons are booting the Surge from their coveted practice space to the notoriously cursed Cricket Field, those warm feelings give way to crippling superstition. With his contract up for renewal and his thirty-fourth birthday just weeks away, Gabe will risk anything to protect his position with the Surge.The rivals agree to settle their differences in a Battle of the Sexes competition—a test of skills, fitness, and willpower. At first the situation seems win-win: Gabe gets the chance to earn back the Surge’s practice space, and Lainey’s team will finally get some much-deserved media attention. But as the friction between them becomes hot enough to spark and smolder, Lainey and Gabe are entering new territory—and with both of their careers on the line, love might just be the toughest opponent of all.",
  "genres": [
    "Romance",
    "Sports",
    "Sports Romance",
    "Contemporary",
    "Soccer",
    "Contemporary Romance",
    "Enemies To Lovers"
  ],
  "author": "Sara  Rider",
  "average_rating": "3.57",
  "url": "https://www.goodreads.com/book/show/27778685-for-the-win"
}