{
  "title": "Welcoming the Bad Boy",
  "description": "From the bestselling author of Welcome to Forever (“Full of heart and emotion!”—Lori Wilde) comes a sweet, sexy novel about breaking all the rules. In Seaside, North Carolina, the boys on the base are heroes—but that doesn’t mean they’re always well-behaved.   As a preacher’s daughter, Valerie Hunt only dates the very respectable, very boring men who meet her father’s strict standards. In private, however, she leads a double life as a romance writer of steamy stories about the least respectable sorts of men. Valerie has always kept her hottest fantasies separate from her real life, but when she nearly runs a hot-blooded biker off the road, the lines begin to blur.   Even though Valerie almost killed him, Griffin Black can’t be angry after he learns the reason for her distracted an unruly puppy belonging to her ailing friend. As a member of the military police K-9 unit, Griffin insists on training the dog himself. But he soon wonders how he’s ever going to stay disciplined around the most alluring, down-to-earth, and totally unattainable woman he’s ever met. Valerie is the ultimate good girl. And Griffin is going to need all his old tricks to unleash her wild side.Praise for the Hero’s Welcome series   “Annie Rains didn’t disappoint with this new story, and pulled me right into the book, making me fall in love once again with her characters, the small town setting and an emotional story that made my heart soar. I think I’ll never get enough of this series!”—Roberta’s Dreamworld, on Welcome Home, Cowboy   “Welcome Home, Cowboy\n \nis sweet and entertaining, with a little side of playfulness. The characters were loveable and the storyline was able to fully capture my attention.”—Hines and Bigham’s Literary Tryst   “A story that made me smile, laugh out loud, shed a tear, and sigh so deeply, while telling a tale of love, and loss.”—Books and Spoons, on Welcome Home, Cowboy   “Not only was it a great, heartwarming, and spicy romance, but it was a book of hope, second chances, finding strength inside oneself, and making life better. . . . Great book!”—Devilishly Delicious Book Reviews, on Welcome Home, Cowboy   “Don’t miss this sparkling debut full of heart and emotion!”—New York Times bestselling author Lori Wilde, on Welcome to Forever   “A beautiful and touching story of love and loss that will grab you by the heart and hold on long after you’ve finished reading.”—USA Today bestselling author Laura Drewry, on Welcome to Forever   “A wonderfully written debut novel that had me fighting back tears and rooting for the couple from the first page. Annie Rains is an author to watch. I can’t wait for more!”—USA Today bestselling author Sidney Halston, on Welcome to Forever   Includes a special message from the editor, as well as an excerpt from another Loveswept title.",
  "genres": [
    "Romance",
    "Contemporary Romance",
    "Military Fiction",
    "Contemporary",
    "Military Romance",
    "Loveswept"
  ],
  "author": "Annie Rains",
  "average_rating": "4.13",
  "url": "https://www.goodreads.com/book/show/27774343-welcoming-the-bad-boy"
}