{
  "title": "Darkly Dreaming",
  "description": "Rae and best friend Layla are in France, to escape the wreckage Rae created when she chucked a hand-grenade into her miserable marriage. She’s escaping the misery she’s created for herself by dreaming her life away, but now she’s left her confused husband behind while she tries to summon the courage to leave him for once and for all. At a street festival they are infected with the Vampire virus by a rebellious vampire and Rae finds herself living a new and terrifying existence. She struggles to retain her essential self, which she has only just worked so hard to re-discover, but she is struggling against new and powerful drives and desires. She and Layla are taken to join the vampire Pride by Guillaume, the Pride Leader. He explains their new evolution into stronger, faster, more intelligent beings, which heal quickly, and only feed on blood, but are not the vampires of legend. They are not undead, and they are not immortal. They discover that she and the other vampires have special gifts which are different for everyone, and not always immediately apparent. Rae and Layla are Pretty ones, which means they can beguile other vampires with their Glamour. They soon, and embarrassingly learn that unchecked this Glamour causes the Need- intense and uncontrollable sexual desire- on contact with another vampire, any other vampire. Rae also discovers that vampires don’t dream. She has lost her escape, just as life gets so terrifying. Then she finds out that fresh blood can fill her mind with narcotic mists of her victim’s memories. She is determined to retain her humanity and refuse to kill, but how can she resist such temptation? She falls head over heels in unrequited love with Guillaume, and goes into battle against the rebellious vampires. The consequences are immense, and mean the whole Pride faces the death penalty from the Vampire High Council.",
  "genres": [
    "Paranormal"
  ],
  "author": "Chloe Hammond",
  "average_rating": "4.13",
  "url": "https://www.goodreads.com/book/show/27778905-darkly-dreaming"
}