{
  "title": "The Wicked Boy: The Mystery of a Victorian Child Murderer",
  "description": "Winner of the 2017 Edgar Award for Best Fact Crime Book! From the internationally bestselling author, a deeply researched and atmospheric murder mystery of late Victorian-era LondonIn the summer of 1895, Robert Coombes (age 13) and his brother Nattie (age 12) were seen spending lavishly around the docklands of East London -- for ten days in July, they ate out at coffee houses and took trips to the seaside and the theater. The boys told neighbors they had been left home alone while their mother visited family in Liverpool, but their aunt was suspicious. When she eventually forced the brothers to open the house to her, she found the badly decomposed body of their mother in a bedroom upstairs. Robert and Nattie were arrested for matricide and sent for trial at the Old Bailey. Robert confessed to having stabbed his mother, but his lawyers argued that he was insane. Nattie struck a plea and gave evidence against his brother. The court heard testimony about Robert's severe headaches, his fascination with violent criminals and his passion for 'penny dreadfuls', the pulp fiction of the day. He seemed to feel no remorse for what he had done, and neither the prosecution nor the defense could find a motive for the murder. The judge sentenced the thirteen-year-old to detention in Broadmoor, the most infamous criminal lunatic asylum in the land. Yet Broadmoor turned out to be the beginning of a new life for Robert--one that would have profoundly shocked anyone who thought they understood the Wicked Boy.At a time of great tumult and uncertainty, Robert Coombes's case crystallized contemporary anxieties about the education of the working classes, the dangers of pulp fiction, and evolving theories of criminality, childhood, and insanity. With riveting detail and rich atmosphere, Kate Summerscale recreates this terrible crime and its aftermath, uncovering an extraordinary story of man's capacity to overcome the past.",
  "genres": [
    "Nonfiction",
    "True Crime",
    "History",
    "Crime",
    "Mystery",
    "Historical",
    "Biography"
  ],
  "author": "Kate Summerscale",
  "average_rating": "3.48",
  "url": "https://www.goodreads.com/book/show/27774749-the-wicked-boy"
}