{
  "title": "The Exact Sciences in Antiquity",
  "description": "Based on a series of lectures delivered at Cornell University in the fall of 1949, and since revised, this is the standard non-technical coverage of Egyptian and Babylonian mathematics and astronomy, and their transmission to the Hellenistic world. Entirely modern in its data and conclusions, it reveals the surprising sophistication of certain areas of early science, particularly Babylonian mathematics.After a discussion of the number systems used in the ancient Near East (contrasting the Egyptian method of additive computations with unit fractions and Babylonian place values), Dr. Neugebauer covers Babylonian tables for numerical computation, approximations of the square root of 2 (with implications that the Pythagorean Theorem was known more than a thousand years before Pythagoras), Pythagorean numbers, quadratic equations with two unknowns, special cases of logarithms and various other algebraic and geometric cases. Babylonian strength in algebraic and numerical work reveals a level of mathematical development in many aspects comparable to the mathematics of the early Renaissance in Europe. This is in contrast to the relatively primitive Egyptian mathematics. In the realm of astronomy, too, Dr. Ncugebauer describes an unexpected sophistication, which is interpreted less as the result of millennia of observations (as used to be the interpretation) than as a competent mathematical apparatus. The transmission of this early science and its further development in Hellenistic times is also described. An Appendix discusses certain aspects of Greek astronomy and the indebtedness of the Copernican system to Ptolemaic and Islamic methods.Dr. Neugebauer has long enjoyed an international reputation as one of the foremost workers ill the area of premodern science. Many of his discoveries have revolutionized earlier understandings. In this volume he presents a non-technical survey, with much material unique on this level, which can be read with great profit by all interested in the history of science or history of culture.Unabridged, slightly corrected reprint of the 2nd, 1957 edition. 14 plates, 52 figures. xvi + 240pp. Paperbound.",
  "genres": [
    "History",
    "Science",
    "Mathematics",
    "History Of Science",
    "Astronomy",
    "Nonfiction",
    "Astrology"
  ],
  "author": "Otto Neugebauer",
  "average_rating": "4.10",
  "url": "https://www.goodreads.com/book/show/1175282.The_Exact_Sciences_in_Antiquity"
}