{
  "title": "Codename Angel",
  "description": "When government scientific advisor, Professor Ralph Frederick, is summoned to a meeting with wartime Prime Minister Winston Churchill, he is given an assignment that will change his life forever..Frederick is assigned as lead researcher to a top secret group, Codenamed Angel. Their role, to investigate the flying saucer paranoia sweeping both the United Kingdom and the United States.Frederick is sent to North Yorkshire to investigate the disappearance of a young woman. But suspects her disappearance is down to a domestic tiff and soon returns to London. However, when the woman turns up a few weeks later, Frederick finds himself at the centre of a complex mystery that will push his scientific knowledge to its limits. And when he encounters three unknown craft at RAF Yeadon, he learns the startling truth. ‘We are not alone.’Unknown to the Angel Committee, Soviet agents have infiltrated the highest levels of power within the corridors of Whitehall. Their goal, to gain information relating to what the British government know about UFOs. Frederick also encounters CIA agents posing as RAF service men.Drawing from eyewitness accounts and a memo, Winston Churchill wrote in July 1952, requesting information on flying saucers. Mixing a blend of fact and science fiction.This story has its roots in declassified government documents. Have British and American governments had ‘first contact’ with ‘extraterrestrials?’ Is there an attempt to hide the truth?What people have been saying about Codename Angel'Loved this book, couldn't put it down.''Probably the most rewarding book I’ve ever read. Just enough truth in it to make it utterly compelling.'If you're into Science Fiction, UFOs, Conspiracy Theories, etc, this is an absolute must for you.''The reader is drawn into a world that could...or indeed may...exist.''I've always believed in there being other life out there and this book really makes you think.'",
  "genres": [],
  "author": "Jason Chapman",
  "average_rating": "3.92",
  "url": "https://www.goodreads.com/book/show/27790263-codename-angel"
}