{
  "title": "Roadmap to Liberty: The Liberty-Approach to Every Economic, Political and Social Topic",
  "description": "ROADMAP TO LIBERTY lays out how free markets have the power to solve the countless problems of big government. Every major economic, political and social issue is covered: ranging from our $22 trillion in welfare spending that has failed to lower poverty by even 1% point over the last 50 years, to our bloated military industrial complex that costs the average US taxpayer $5,000 per year.\n\n\n\nWhether you are looking for a comprehensive guide on how to apply the principles of liberty to any life situation, an introduction to key libertarian concepts, or simply a repertoire of fact-based arguments ordered by issue - Roadmap to Liberty delivers.\n\n\n\n\n\nYour time is limited - this is why I made all efforts to summarize everything you need to know about liberty in little more than 40 chapters and sub-chapters - readable in any order! \"Roadmap to Liberty\" has one of the highest \"information densities\" of any book out there - promised.\n \n\n\n\n\nWritten in an Easy-to-Grasp Conversational Style\n\n\nFeaturing examples from around the world on how government should and should not work - including cases on:How one company was granted the monopoly right to produce TSA baggage locksHow privatization of wildlife saved entire species from extinction in AfricaThe US' 900 foreign military bases worldwide - 30 times more than all the foreign military bases owned by all other countries combinedThe background on why the US abandoned the gold standard, and how the petrodollar system replaced itThe success of school vouchers in NYC and DC, and the fact that government schooling costs more than private schoolThe mathematical proof of why truly unregulated free trade (i.e. not government regulated trade such as the TPP) is always goodHow the total word count of US regulations increased by 40% between 1997 and 2012 alone - reaching more than 100 million wordsHow Libya went from Africa's richest state to a failed countryAbove list includes just the tiniest tip of the iceberg of mind-blowing, around-the-world case stories.Happy Reading & Thinking! - For more information visit RoadmapToLiberty.comChapter OverviewCh 1 - Principles of LibertyCh 2 - Political IdeologiesCh 3 - Government- Section 1 - Passing Laws- Section 2 - Special InterestsCh 4 - Taxation- Section 1 - Types of Tax Systems- Section 2 - Income Tax- Section 3 - Consumption Tax- Section 4 - Property TaxCh 5 - Social Security- Section 1 - Pensions- Section 2 - Unemployment Benefits- Section 3 - Health Insurance- Section 4 - Assistance to the PoorCh 6 - InfrastructureCh 7 - EducationCh 8 - The Judiciary- Section 1 - The Court System- Section 2 - Correctional FacilitiesCh 9 - Domestic Security- Section 1 - Police Force- Section 2 - Fire ServicesCh 10 - International Security- Section 1 - GunsCh 11 - Marriage and ReligionCh 12 - AbortionCh 13 - Discrimination- Section 1 - Racism Ch 14 - ImmigrationCh 15 - Regulation- Section 1 - Consumer Protection- Section 2 - Environmental Protection- Section 3 - Individual LifestylesCh 16 - Trade and ProtectionismCh 17 - Monetary System- Section 1 - The Federal Reserve- Section 2 - Fiat Currencies- Section 3 - Inflation VS Deflation- Section 4 - Privatization of Money",
  "genres": [
    "Economics",
    "Politics",
    "Philosophy",
    "Nonfiction"
  ],
  "author": "Lucas Vincent",
  "average_rating": "4.36",
  "url": "https://www.goodreads.com/book/show/27800523-roadmap-to-liberty"
}