{
  "title": "The Sweet Charm of Distance",
  "description": "Dalton Novak can’t really complain. He’s lived a charmed life. But he’s about to turn sixty, and lately, his days and nights have been spent coping with the shock of losing his wife and facing the future, what’s left of it, alone in a world gone mad. Then Jacqueline Purcell gets in touch with him, appearing straight out of the blue June night, and all of a sudden Dalton must face the past as well. When they met on New Year's Eve 1979, he and Jacqueline were each standing at crossroads. She was an idealistic college student about to graduate and looking to “save the world” at her husband’s side. He was a brooding townie, trying to keep his dream of becoming a writer alive, but watching anxiously as the years slipped past. They became fast friends, an unlikely pair in a precipitous time. But left unchecked, their friendship evolved into a potent attraction, driven as much by vulnerability as desire. Boundaries were crossed, and what too easily became a secret love affair they had no business having, could not help but be forced to an abrupt - and unpleasant - end.Thirty years later, they’re still standing at crossroads. Dalton has become a writer. He captured that dream, but has learned wealth and fame are no panacea. Jacqueline is divorced and completely disillusioned with her chosen path. Any remnants of the idealism she once cherished have long since dried up and blown away.Beside a secluded New Hampshire lake, they reacquaint, recalling the spring of 1980 in the autumn of their years. It would be ideal if they could reconcile the past with the future, but Dalton has some unresolved feelings about how they left things so long ago, a lot of guilt over the life he's led since, and can’t help but wonder if love is worth pursuing, or even possible, in a world that bears little resemblance to what he or his generation once knew, or could ever have imagined.With biting humor lending punctuation to a strong sense of melancholy, \"The Sweet Charm of Distance\" is at once a timeless tale of star-crossed love, and a swan song for a generation.",
  "genres": [],
  "author": "Jared Glovsky",
  "average_rating": "4.50",
  "url": "https://www.goodreads.com/book/show/27797075-the-sweet-charm-of-distance"
}