{
  "title": "The Gray-Haired Knitting Detectives Series",
  "description": "This knitting group of Jessica Fletcher wannabes is not about to sit at home and knit when accusations of murder and thievery are flying.The adventure begins when one of the knitters suddenly dies. The police claim the death was of natural causes, but the knitters aren't buying it. If the police won't do any investigating, then they will!Get all three adventures of the Gray-Haired Knitting Detectives series in one bundle. The bundle includes Murder, Mystery & Dating Mayhem, Jack Gets His Man, and Love in the Time of Murder.Murder, Mystery & Dating MayhemA middle-aged widow gangs up with her gay best friend and a posse of gray-haired wannabe detectives to solve a murder. Maybe she should have stuck to speed dating? \"a lot of fun to read. The characters are a hoot!!\" \"sweet, light and hilarious and kept you guessing!\" \"sure to put a smile on your face\"Jack Gets His ManJack's life is awesome even if his ex is being a pain, but then his smoking hot new bookkeeper discovers things at his store aren't actually as they seem. Jack's bestie and the Gray-Haired Knitting Detectives jump at the chance to solve Jack's problems. Will Jack catch a thief or find love? \"I ate this book up like a grubby little kid.\" \"expertly worded and pretty funny suspense story with a romantic touch.\"Love in the Time of MurderWhen Dee's ex is murdered, she's the number one suspect. The Gray-Haired Knitting Detectives aren't about to let one of their own get sent to the slammer and jump at the chance to search for the true killer. \"totally scrumptious cozy mystery\" \"This fun and witty whodunit will have you laughing till the very end.\"Buy now to join the Gray-Haired Knitting Detectives on all of their adventures.",
  "genres": [
    "Cozy Mystery",
    "Mystery"
  ],
  "author": "Elaine Spaan",
  "average_rating": "4.07",
  "url": "https://www.goodreads.com/book/show/27799390-the-gray-haired-knitting-detectives-series"
}