{
  "title": "Rough Waters: Our North Pacific Small Fishermen's Battle : A Fishing Family's Perspective",
  "description": "Note: \"Rough Waters: Our North Pacific Small Fishermen's Battle\" is out of print.An updated edition (2021) titled \"Rough Waters: Alaska to Oregon - Small Fishermen's Battle\" has the same content butincludes a new title, ISBN and introduction. The author created a new edition to reflect disastrous disruptions to climate, North Pacific and Pacific Northwest coast ecology, and fisheries that have occurred since the old edition was published in 2015. The new edition remains in print.The new edition's summary:\"Rough Waters: Alaska to Oregon--Small Fishermen's Battle\" is for the great numbers of people drawn to fish, fishing, fishermen and their communities. But beyond those always engaging topics is the worry today over our fisheries' sustainability. The warming of our oceans, the politics and management issues are part of the growing public concern. For coastal people, especially, and river lovers too, the changes can't be ignored. Fishermen of the small-boat fleets (salmon, crab, halibut and cod, through nets, pots, troll and longlines are the ones particularly covered here) are the canaries in our giant watery coal mines. And they are always in competition with the industrial fleets and their lobbyists.The communities of the small-boat fleets are also at risk. Especially the youth are floundering--the ones who had planned to take over their folks' beloved livelihood. The transfer of permits and licenses to owners who never fish is evidence. The plight of specific fishing families described here will be familiar to those who come from a small-farming background.\"Rough Water\"s presents all this graphically through a blend of on-the-dock interviews, the author’s personal experience, historical photos and extensive research. It reveals the threats to a livelihood that for generations has been a huge part of the Northwest Coast mystique.",
  "genres": [],
  "author": "Nancy Danielson Mendenhall",
  "average_rating": "4.50",
  "url": "https://www.goodreads.com/book/show/27781999-rough-waters"
}