{
  "title": "The White Bone",
  "description": "Barbara Gowdy brings her staggering imagination to an utterly new realm in \nThe White Bone\n, a classic quest story of elephants, memory and the will to survive.Despite the proliferation of recent non-fiction bestsellers that have opened our eyes to a new understanding of animals, no book has taken these ideas to their natural conclusion, which is that animals who possess emotions and awareness must also have stories. If elephants could tell us just one story, it would be the story of Mud, which is the story at the heart of \nThe White Bone\n.Mud is a young elephant cow, orphaned at birth and blessed with visionary powers. For many years, she and her adoptive family roam the plains of Africa until prolonged drought forces them to stay close to one of the few remaining watering holes. It is there that ivory poachers find them and kill, or drive off, almost all the elephant cows and their young. Mud, now an adolescent and pregnant with her first calf, sets out with the wounded and traumatized survivors in search of the injured. Guided by visions, memories and hallucinations as much as their incredible sense of smell, the ruined herd hears rumors of A Safe Place and the White Bone that can lead them there. The quest becomes one of endurance, sacrifice, and, ultimately, transcendence, as the elephants struggle for their own lives and the continuation of their kind.Barbara Gowdy's work has been celebrated as \"dazzling and wholly original.\" With \nThe White Bone\n, Gowdy both explores the territory of the family, and takes her talent for \"audacious concept, inspired characterization, and poignant message\" (Publishers Weekly) to remarkable new heights. Her genius lies in the combination of a universal theme with the creation of characters entirely true to their animal natures.",
  "genres": [
    "Fiction",
    "Animals",
    "Africa",
    "Canada",
    "Fantasy",
    "Book Club",
    "Novels"
  ],
  "author": "Barbara Gowdy",
  "average_rating": "3.77",
  "url": "https://www.goodreads.com/book/show/1018651.The_White_Bone"
}