{
  "title": "Mail Order Bride Collection",
  "description": "Six Award-Winning Authors have contributed new stories to A Timeless Romance Mail Order Bride Collection. Six historical romance novellas set in the Old West. WRITTEN IN HER HEART, a charming novella by Stacy Henrie, Georgeanna is getting desperate. She can’t fund her favorite orphanage unless she marries and secures the rest of her inheritance left by her father. But her father’s financial planner, Clay, can't understand why she's not content with her current situation. Georgie determines to send out a notice as a mail order bride to attract suitors who won’t know her financial situation. Little does she know, Clay takes up the pen and sends her letters of his own under an assumed name. After years of working for Georgie’s father, Clay realizes he isn’t ready to watch her marry another, not when his heart is already claimed by her. In Kristin Holt’s delightful novella MIDWIFE BRIDE Dr. Naomi Thornton thinks she has it a beautiful house, a loving husband, and a fulfilling career. But when everything she holds dear is ripped away, Naomi has no choice but to start over. What will she find in the wild and untamed Wyoming Territory? Dr. Joe Chandler has waited years for a wife with the knowledge, skills, and tender heart he yearns for in a medical colleague and lifetime companion. When a midwife arrives with more expertise and secrets than he counted on, Joe quickly discovers there’s more to love and marriage than a simple mail order contract. In THE SOUND OF HOME, a captivating novella by Annette Lyon, Marilyn is given the choice of either marrying the despicable Victor or being charged with a murder she didn’t commit. Refusing to believe that either is her fate, she finds a third she answers a mail order bride advertisement and boards a train to Wyoming to wed a man named Harry. Moments after her arrival, she learns that Harry isn’t who he seemed to be, and the advertisement turns out to be a giant mistake. Harry’s brother Thomas agrees to let her stay until she can figure out what to do next—after all, she simply cannot return to New York—but Marilyn quickly finds herself developing feelings for Thomas. In Sarah M. Eden’s endearing novella FOR BETTER OR WORSE Gerald Smith, on the advice of his well-meaning neighbors, has decided it’s time to change his lonely existence. Mary Hill, on the advice of her empty pocketbook and non-existent roof over her head, has decided it’s time to secure herself a future. A mail-order marriage, they both realize, is no guarantee of happiness, but it is a risk they are willing to take. However, coming face to face on the train platform, the hapless couple discovers an unexpected marriage to a perfect stranger is sometimes far preferable to the prospect of a lifetime with someone you used to know. Heather B. Moore’s sweet novella THE INCONVENIENT BRIDE sees Carmela traveling from Boston to Colorado, eager to meet the man she’s been corresponding with and will soon marry. Her brother’s new marriage leaves little room for Carmela in her old life. Upon arrival in Leadville, she faces a rude awakening, and the only one who can understand her predicament is her fiance’s brother, Samuel. But Samuel can’t possibly help her out of an awkward situation, can he? It would be better for all if she returns immediately to Boston and pretends she never traveled to Colorado in the first place. THE PRICE OF SILVER, an engaging novella by Siân Ann Bessey, Katie leaves New York for Idaho to marry Jake, a man she’s written to a couple of times. But when she steps off the train, his brother Caleb is there to greet her. Jake has gone to take a mining job he couldn’t pass up. Caleb takes Katie back to the family ranch to wait for Jake’s return. The more Caleb gets to know Katie, the more he envies his brother, but he can’t let his heart overrule his head unless Jake changes his mind about his intended bride.",
  "genres": [
    "Romance",
    "Historical Fiction",
    "Historical Romance",
    "Historical",
    "Clean Romance",
    "Westerns",
    "Anthologies"
  ],
  "author": "Stacy Henrie",
  "average_rating": "4.14",
  "url": "https://www.goodreads.com/book/show/27813354-mail-order-bride-collection"
}