{
  "title": "The Sacrificial Knight",
  "description": "Dear Author,Remind me why I’m doing this?Walking through the not-surprisingly empty streets of Dorbarra behind a man holding reins. My reins? Like I’m one of those stupid sirit that humans use?I could breathe on him and poof! bits of ash drifting in the morning mist.He’s barely longer than my forearm. I could curl my claws around him, lift and snack. Though probably not. Great-great-great-Aunt Grnvlia had one once during an attempted hoard heist, and she said the rumors are wrong. They don’t taste like chicken. At all. Nasty after-taste, too.I could raise my head, yank him off the ground, shake, and see how far he’d fly before bouncing off… something-or-other.I could stand tall, walk forward two fast steps and drop. His king’s street sweepers would have something to sweep… or mop… up.I could… shift. Rip my clothes off. His. Bend him over and fuck him here and now. Or perhaps not in the street. Humans are so touchy about public displays of affection. But there’s a nice, shadowed alley over there. No one would notice. Much. Though they’d hear his howls of pleasure. And mine.If I could do all that, and I so easily could, then why…Oh.Photo Description: Through the mist-swept streets of the capital city, a young knight leads a dragon on an enormous pair of reins. Though the creature towers over the knight, it follows willingly, its intense blue gaze focused on the man who looks back over his shoulder, the connection between them intense and undeniable.This story was written as a part of the M/M Romance Group's \"Love is an Open Road\" event. Group members were asked to write a story prompt inspired by a photo of their choice. Authors of the group selected a photo and prompt that spoke to them and wrote a short story. This story may contain sexually explicit content and is intended for adult readers. It may contain content that is disagreeable or distressing to some readers. The M/M Romance Group strongly recommends that each reader review the General Information section before each story for story tags as well as for content warnings.",
  "genres": [
    "Fantasy",
    "M M Romance",
    "Dragons",
    "Romance",
    "Shapeshifters",
    "Short Stories",
    "Magic"
  ],
  "author": "Kestrel Drake",
  "average_rating": "3.69",
  "url": "https://www.goodreads.com/book/show/27804299-the-sacrificial-knight"
}