{
  "title": "Blackstone and the Rendezvous with Death",
  "description": "The body of a young man fished out of the Thames is of little interest to Londoners caught up in the excitement of Queen Victoria’s Diamond Jubilee celebrations.  Yet to Inspector Sam Blackstone, the case is as puzzling as any he has ever come across.  Why should a corpse dressed the in rags of a commoner have the face of a gentleman?  And if this man does belong to noble stock, why has no one come forward to claim the body?  As his investigation proceeds, Blackstone finds himself entering the world of the aristocracy—in which the presence of an ordinary policeman is far from welcome—and tramping the dangerous streets of London's Little Russia—where English law and order are not welcome.  Death seems to stalk him, and as each new clue leads to nothing more than a new murder, Blackstone comes to realize that he is caught up in what may turn out to be the most horrendous crime of the century…  Blackstone and the Rendezvous with Death is an expertly plotted Victorian mystery that will keep readers guessing to the last page.  Praise for Sally Spencer:  “Spencer's finest hour: a tightly plotted puzzler with surprises at every turn” Kirkus Reviews  “Spencer is an accomplished craftsman who serves up a good puzzle and deftly solves it with intelligence and insight” Publishers Weekly  “Characters are diverse, intriguing, and believable . . . plots never fail to surprise; and the procedural details are grittily realistic” Kirkus Reviews  Sally Spencer worked as a teacher both in England and Iran - where she witnessed the fall of the Shah. She now writes full time.  Endeavour Press is the UK's leading independent publisher of digital books.",
  "genres": [
    "Mystery",
    "Historical Fiction",
    "Historical",
    "Historical Mystery",
    "Fiction",
    "Crime",
    "Victorian"
  ],
  "author": "Sally Spencer",
  "average_rating": "4.09",
  "url": "https://www.goodreads.com/book/show/27826920-blackstone-and-the-rendezvous-with-death"
}