{
  "title": "The Angel And The King Of Cruel",
  "description": "Out of the Lilac City comes a powerful narrative to rival the finest fiction written today. A cult classic Horror/Mystery. A crime novel of notoriously violent proportions. Sensational, dark and disturbing, this poetic, raw study of the human condition promises to emerge as a literary monument. Enter at your own risk. A mad poker player's apocalyptic love will be the death or salvation of a beautiful young siren. The fate of the city itself stands on a razor's edge as the depth of his insanity is revealed. \"Bursting with poetic prose, enticing mystery, and brilliantly articulated violence, this powerhouse of romance and horror grips the reader with a literary dichotomy never experienced in fiction.\" Set in the urban decay of the severely corrupt “Lilac City,” a mad poker player named Slo’ struggles to escape poverty and make it to the ocean, where the roots of his forgotten past seem to be founded—along with the memory of a lost love. Slo’’s delicate hold on sanity is compromised as he falls in love with a beautiful young siren, Stevie, who is confronted with Slo’’s brilliant and malevolently exploitive split personality, Syles. Stevie is faced with the impossible position of loving “Slo’,” a personality who regards her as ultimate beauty, and fearing the same man as “Syles,” who holds insidious designs on her future so terrifying they approach true horror. As the depth of Slo’’s insanity is revealed, the fate of the Lilac City itself is ruled by the final outcome of this epic triangle of love, lust, and hate. Author W.T. Shad has redefined violence in literature with a powerfully poetic narrative. The reader is held close by the most beautiful passages of romance in modern fiction, and simultaneously thrilled and terrified by the fruits of a mystery never before seen on the written page.",
  "genres": [
    "Psychological Horror"
  ],
  "author": "W.T. Shad",
  "average_rating": "3.81",
  "url": "https://www.goodreads.com/book/show/27822609-the-angel-and-the-king-of-cruel"
}