{
  "title": "An Ideal Present",
  "description": "Q. What could be better than getting a billionaire for Christmas? A. Getting THREE billionaires for Christmas! Three Wise Men is a series of three books set in the sub-tropical Northland of New Zealand following the stories of three billionaire brothers and the single mums they fall in love with. This year, Ophelia Clark isn’t looking forward to Christmas. Her ex-husband, Dillon, doesn’t want to be her ex anymore, and their daughter, Summer, wants him there on Christmas Day, so Ophelia’s finding it difficult to convince him their marriage is over. The last thing she needs is to start dating someone else and cloud the issue. And then the cute doctor she’s had her eye on finally asks her out. Research scientist Charlie King has given up on relationships. Going without sex is a major drawback to that plan, but even though he has an IQ one point off Einstein’s, he considers himself hopeless with women. When he discovers the gorgeous Ophelia is now single, though, he decides to give himself one last chance to find love. Logic tells Ophelia to wait until her divorce is through before getting involved with a new man, but her body hungers for the sexy scientist, and it doesn’t help that Charlie can’t keep his hands off her. Christmas looms full of the magic of their new love affair, and then Summer falls ill and ends up in hospital. Ophelia’s torn between duty and desire. Should she follow her head and close this chapter of her life before she opens the next? Or should she follow her heart and give herself the ideal present—the prospect of forever with the man of her dreams? Warning: Includes sexual content – adults only. Book 1: The Perfect Gift Book 2: An Ideal Present Book 3: A Secret Parcel",
  "genres": [
    "Romance",
    "Contemporary",
    "Contemporary Romance",
    "Holiday",
    "Christmas"
  ],
  "author": "Serenity Woods",
  "average_rating": "4.35",
  "url": "https://www.goodreads.com/book/show/27831281-an-ideal-present"
}