{
  "title": "A Secret Parcel",
  "description": "Q. What could be better than getting a billionaire for Christmas? A. Getting THREE billionaires for Christmas! Three Wise Men is a series of three books set in the sub-tropical Northland of New Zealand following the stories of three billionaire brothers and the single mums they fall in love with. Georgia Banks’s life is falling apart. She’s done her best to stay strong since she lost both her husband and her home in the Christchurch earthquake over four years ago, but her eleven-year-old son, Noah, is going off the rails, and some days it’s all she can do to get out of bed in the morning. Luckily, she has a great job working for the We Three Kings Foundation, helping to make the wishes of sick children come true. It does mean seeing the gorgeous Matt King on a regular basis though, which is both torture and delight rolled into one. He’s relentless in his pursuit of her, but so far she’s managed to ward him off. The last thing she needs is to have her heart broken by the handsome but shallow playboy. Children’s author Matt can’t stop thinking about sexy Georgia. She insists he’s only interested in her because he can’t have her. He concedes she could be right, but how will he know until he’s sated his hunger? Eventually, she agrees to a brief fling, but that only seems to make the fire between them burn hotter. Matt wants more, but even though Noah seems to like him being around, when Matt unearths Georgia’s troubled past he decides it’s time to move on before he gets too entangled. As Christmas approaches, though, he discovers that love can be like mistletoe, infiltrating and binding two people together until it’s impossible to separate their hearts. By the time of the party on Christmas Eve, all three King brothers are in love. Will there be enough Christmas magic to make all their dreams come true? Warning: Includes sexual content – adults only. Book 1: The Perfect Gift Book 2: An Ideal Present Book 3: A Secret Parcel",
  "genres": [
    "Romance",
    "Contemporary",
    "Contemporary Romance",
    "Christmas"
  ],
  "author": "Serenity Woods",
  "average_rating": "4.36",
  "url": "https://www.goodreads.com/book/show/27831285-a-secret-parcel"
}