{
  "title": "Getting Book Reviews: Easy, Ethical Strategies for Authors",
  "description": "Reviews help sell books. When browsing online for their next read, most readers are drawn to the books with many reviews. More and more readers glance at what other readers have to say about a book before they hit the 'buy now' button. The more people have read and liked the book, the more they want to experience it for themselves. This is a known psychological factor called 'social evidence', and it plays a big role in purchasing decisions. The more reviews your book has, the better, especially if they are genuine, personal, thoughtful and positive. Reviews can multiply your sales and catapult your book to the top of bestseller lists - but how do you get them? Perhaps you're a new author and can't get those crucial early reviews to start the train rolling. Maybe you're a seasoned author and your books have garnered reviews, but not as many as you need to break out. Or perhaps you've gone the corporate publishing route, and find that your publisher's publicist isn't getting your book the attention it needs. This book shows you many proven strategies to get the reviews your book deserves. Instead of urging you to labour through tedious, spirit-draining procedures, I'll reveal quick, fun, empowering tricks. All my suggestions are legitimate and ethical. In this book you won't find methods for manipulating, faking and cheating. Strengthen your readers' bond with you, don't sabotage it. Most of the methods I suggest are free, although some incur expenses. You will definitely need to spend time. You can apply them all these techniques, or cherry-pick the ones you like now and keep the rest for another time or a different book. At the end of most chapters, I'm sharing mistakes I made and learnt from. They all seemed a good idea at the time. Rayne",
  "genres": [
    "Writing",
    "Nonfiction"
  ],
  "author": "Rayne Hall",
  "average_rating": "4.33",
  "url": "https://www.goodreads.com/book/show/27831294-getting-book-reviews"
}