{
  "title": "The Light of Paris",
  "description": "“I adored  The Light of Paris . It’s so lovely and big-hearted—it made me long for Paris.”—Jojo Moyes,  New York Times -bestselling author of  Me Before You and After YouThe miraculous novel from the  New York Times –bestselling author of  The Weird Sisters— a sensation beloved by critics and readers alike. Madeleine is trapped—by her family's expectations, by her controlling husband, and by her own fears—in an unhappy marriage and a life she never wanted. From the outside, it looks like she has everything, but on the inside, she fears she has nothing that matters.In Madeleine’s memories, her grandmother Margie is the kind of woman she should have been—elegant, reserved, perfect. But when Madeleine finds a diary detailing Margie’s bold, romantic trip to Jazz Age Paris, she meets the grandmother she never knew: a dreamer who defied her strict, staid family and spent an exhilarating summer writing in cafés, living on her own, and falling for a charismatic artist.Despite her unhappiness, when Madeleine’s marriage is threatened, she panics, escaping to her hometown and staying with her critical, disapproving mother. In that unlikely place, shaken by the revelation of a long-hidden family secret and inspired by her grandmother’s bravery, Madeleine creates her own Parisian summer—reconnecting to her love of painting, cultivating a vibrant circle of creative friends, and finding a kindred spirit in a down-to-earth chef who reminds her to feed both her body and her heart.Margie and Madeleine’s stories intertwine to explore the joys and risks of living life on our own terms, of defying the rules that hold us back from our dreams, and of becoming the people we are meant to be.",
  "genres": [
    "Fiction",
    "Historical Fiction",
    "France",
    "Book Club",
    "Chick Lit",
    "Romance",
    "Adult Fiction"
  ],
  "author": "Eleanor Brown",
  "average_rating": "3.62",
  "url": "https://www.goodreads.com/book/show/27833796-the-light-of-paris"
}