{
  "title": "The Identity Wars: Utopia is Dystopia",
  "description": "Where will you be in the year 2035? Most novels about a dystopian future have little to do with the real world. They either take place in some post-apocalypse wasteland that has no connection with the present day, or they are old-fashioned visions of far-right totalitarianism on the out-of-date 20th century model. “The Identity Wars” is very different. It is a new type of dystopian novel based upon the actual society that we live in today. It portrays a dystopian future which arises directly out of the politics and policies of contemporary society. This novel puts together three features of your world. (1) An impending, and much predicted, serious crash of capitalism causing economic collapse. (2) Western societies becoming ever more divided by multiple ethnic cultures. (3) The growing gender segregation of men and women, such as the social phenomenon of Men Going Their Own Way (MGTOW), as a result of the iniquities of feminism. Given these three features of the world you live in, “The Identity Wars” looks twenty years into the future and what will society become? What will happen to a feminist-multiculturalist society under the impact of a global financial meltdown? It is also the story of three men on their fortieth birthdays. The grandfather, Alf Eldridge, who was forty in 1975. The father, Michael Eldridge, who was forty in 2005. The son, Kyle Eldridge a.k.a. Ritzy, who is forty in 2035. Each of them is a product of the culture they live in. Each of them lives in a culture entirely different from the other two. Each of them has a wholly different conception of manhood. Across these three generations, from grandfather to grandson, the world changed radically and dramatically. There will be no going back. This is the news from tomorrow. The future is coming.",
  "genres": [],
  "author": "J.P. Tate",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/27827024-the-identity-wars"
}