{
  "title": "Southern Comfort: A Honky Tonk Angels Tale from Cotton Creek",
  "description": "\"A page turner! I couldn't put it down. Ciana has a way of weaving a tale that leaves you spellbound. Sweet, funny, and a splash of Danger! Definitely a story you can get lost in.\" Candid Book ReviewsA man hiding from his past and a woman running from hers.Two people from different worlds who know one another only from what they have shared with one another in Facebook messages. They've never heard the other's voice, or seen a photo. Analise Becke writes romance with western heroes, men she has dreamed up by combining the looks of her favorite western actor with the qualities she discovers in her online chats with the Texas rancher, Riley Morgan. She's cooked up more than a few fantasies about Riley over the last year, but knows them for what they are -- fantasies of a lonely woman whose marriage is falling apart. Riley looks forward to the online chats more than he is willing to admit but has never considered asking what she looks like. She's just an online friend. Yeah, they have a connection, but certainly not enough to even consider that a face-to-face meeting will spark anything other than a solidification of their friendship. Riley Morgan and Analise Becke are in for a big surprise - actually a series of surprises. Their lives are about to be turned upside down as passion and danger come to Cotton Creek, Texas. And they say nothing ever happens in Cotton Creek. Southern Comfort is the first book in Ciana's HONKY TONK ANGELS series. Come and meet the folks who call Cotton Creek home and bring their tales to Honky Tonk Angels in down-home fun with, good-old fashioned romances (with perhaps a bit of a twist)!",
  "genres": [
    "Romance",
    "Contemporary Romance",
    "Westerns",
    "Contemporary",
    "Paranormal",
    "Western Romance",
    "Fiction"
  ],
  "author": "Ciana Stone",
  "average_rating": "3.93",
  "url": "https://www.goodreads.com/book/show/27828644-southern-comfort"
}