{
  "title": "Seed Sovereignty, Food Security: Women in the Vanguard of the Fight against GMOs and Corporate Agriculture",
  "description": "In this unique anthology, women from around the world write about the movement to change the current, industrial paradigm of how we grow our food. As seed keepers and food producers, as scientists, activists, and scholars, they are dedicated to renewing a food system that is better aligned with ecological processes as well as human health and global social justice. Seed Sovereignty, Food Security is an argument for just that--a reclaiming of traditional methods of agricultural practice in order to secure a healthy, nourishing future for all of us. Whether tackling the thorny question of GMO safety or criticizing the impact of big agribusiness on traditional communities, these women are in the vanguard of defending the right of people everywhere to practice local, biodiverse, and organic farming as an alternative to industrial agriculture.Contents• Seed Sovereignty, Food Security VANDANA SHIVA • Fields of Hope and Power FRANCES MOORE LAPPÉ & ANNA LAPPÉ • The Ethics of Agricultural Biotechnology BETH BURROWS • Food Politics, the Food Movement and Public Health MARION NESTLE • Autism and Glyphosate: Connecting the Dots STEPHANIE SENEFF • The New Genetics and Dangers of GMOs MAE-WAN HO • Seed Emergency: Germany SUSANNE GURA • GM Soy as Feed for Animals Affects Posterity IRINA ERMAKOVA & ALEXANDER BARANOFF • Seeds in France TIPHAINE BURBAN • Kokopelli vs. Graines Baumaux BLANCHE MAGARINOS-REY • If People Are Asked, They Say NO to GMOs FLORIANNE KOECHLIN • The Italian Context MARIA GRAZIA MAMMUCINI • The Untold American Revolution: Seed in the US DEBBIE BARKER • Reviving Native Sioux Agriculture Systems SUZANNE FOOTE • In Praise of the Leadership of Indigenous Women WINONA LADUKE • Moms Across America: Shaking up the System ZEN HONEYCUTT • Seed Freedom and Seed Sovereignty: Bangladesh Today FARIDA AKHTER • Monsanto and Biosafety in Nepal KUSUM HACHHETHU • Sowing Seeds of Freedom VANDANA SHIVA • The Loss of Crop Genetic Diversity in the Changing World TEWOLDE BERHAN GEBRE EGZIABHER & SUE EDWARDS • Seed Sovereignty and Ecological Integrity in Africa MARIAM MAYET • Conserving the Diversity of Peasant Seeds ANA DE ITA • Celebrating the Chile Nativo ISAURA ANDALUZ • Seed Saving and Women in Peru PATRICIA FLORES • The Seeds of Liberation in Latin America SANDRA BAQUEDANO & SARA LARRAÍN • The Other Mothers and the Fight against GMOs in Argentina ANA BROCCOLI • Seeding Knowledge: Australia SUSAN HAWTHORNE",
  "genres": [
    "Environment",
    "Nonfiction",
    "Politics",
    "Nature",
    "Feminism",
    "Economics"
  ],
  "author": "Vandana Shiva",
  "average_rating": "3.95",
  "url": "https://www.goodreads.com/book/show/27830854-seed-sovereignty-food-security"
}