{
  "title": "The Carson Brothers of Kansas",
  "description": "99 cents for a limited time only.  Desperate for grandbabies and cursed with four wayward sons, Maggie Carson concocts a scheme to impersonate them in letters sent back east for mail order brides.  Charlie  Rebecca Hart is the first ensnared, romanced by sweet words, poetry, and the promise of a new life. When she arrives in Topeka, she is eager to marry the man she thought she had come to admire, but the groom, Grant Carson, is nowhere to be found. It is his younger brother, Charlie, who greets her at the train station.  Charlie is appalled after discovering his mother’s deception, yet jealous that Rebecca is meant for his older brother, who, in his estimation, does not deserve her. Grant reluctantly makes an effort to romance Rebecca, but his heart is elsewhere, as he is involved with a married woman in town. Rebecca and Charlie find themselves thrown together often, and a friendship emerges. An unexpected kiss confuses Rebecca, and she questions if it is Grant she really wants.  Bronson  Fleeing from an abusive marriage, Charlotte Mills and her five-year-old son, Dudley, travel to Kansas in the hope of securing a better future. While on the train to Topeka, the passengers are robbed by a band of outlaws. In the midst of the chaos, one of the bandits, a tall, rugged man in a bandana, shamelessly steals her last ten dollars.  Injured after a robbery, Bronson Carson is forced to return to the Carson Ranch to recuperate. His mother has once again schemed to find a wife for his younger brother, Grant, having brought in a woman from back east. But there is something about Charlotte that catches his eye, as she nurses him to health. Falling in love was the last thing he expected or wanted, preferring to live wild and unencumbered. As the blonde with the sweet smile softens his heart, he finds himself in a quandary. His lifestyle as a hardened criminal is hardly appropriate for a woman and her son, but his feelings will not be denied.  The past is never far behind, and Charlotte’s day of reckoning is at hand. Her husband has found her, and he is not a forgiving sort of man.  Wyatt  Hired for a cattle drive, Wyatt Carson is surprised when his boss, Mr. Hardin, expects him to transport his mail order bride, Sofia Parker, from San Antonio, Texas to Abilene, Kansas. Little does Wyatt know that the real Sofia Parker has just passed away from blood poisoning. Her roommate, Eugenia Madsen, has taken her place, determined to escape poverty by marrying a rich cattle baron.  While on the Chisholm Trail, Eugenia’s drawn to the handsome trail boss, but Wyatt Carson, oldest of the Carson brothers, has no plans to settle down just yet or anytime soon, preferring his freedom. Eugenia is a raven-haired beauty with big, dark eyes. Her fun and flirty manner begin to wear him down, especially after she dons a pair of men’s denim pants and learns to ride and shoot.  Two months on the trail is a long time—far too long to be spent with a woman like Eugenia and not touch her. The flirtatious vixen tempts him like no other, and his good intentions begin to evaporate.  As the cowboys pull into Abilene, Wyatt must let Eugenia go. This could be the biggest challenge of his life.  Grant  Eva Caldwell is on the hunt for the gunslinger who attacked her sister, Cora, vowing to kill the man when she sees him again. The orphaned sisters have never had an easy life, struggling to fend for themselves by any means possible. A pickpocket by profession, Eva brazenly robs several men on the train to Topeka.",
  "genres": [],
  "author": "Carré White",
  "average_rating": "4.29",
  "url": "https://www.goodreads.com/book/show/27838444-the-carson-brothers-of-kansas"
}