{
  "title": "Christmas Eve Kisses",
  "description": "Enjoy this collection from some of your favorite inspirational authors. This anthology is all about Christmas.  The Knight and the Damsel by USA Today bestselling author Margaret Daley Retired champion bull-rider, Michael Knight, leaves his ranch when his younger brother calls for help. Someone is sabotaging and poisoning rodeo animals. Determined to stop them, Michael takes a job in the center of the action as a bullfighter.  Bella Rosenthal is one of the few female bull-riders competing with the men. Someone is harassing her, and Michael decides to solve that case as well, but Bella doesn’t want any help. She insists on taking care of herself until one of her bull rides is sabotaged, and she is nearly killed. Michael and Bella work to find out who is behind what is happening on the rodeo circuit while fighting their growing feelings for each other.   Jingle Bell Cowgirl by USA Today bestselling author Lacy Williams It will be a Christmas to remember… Prodigal cowgirl Lila Andrews returned to her hometown on a whim, but she’s been unable to step foot on the family ranch because of childhood memories that haunt her. That hasn’t stopped ranch foreman Ben Taylor from dogging her heels around town. Ben has been managing the Circle A ranch since Lila’s father passed away. He made a promise to his mentor that he’d see Lila back where she belonged. But the stubborn cowgirl isn’t cooperating. When Lila and Ben are forced to work together to rescue a neglected horse, they begin to discover their first impressions were wrong. Friendship blooms… sparks fly… but Ben needs a Christmas miracle to convince Lila to stay in Redbud Trails.  Winter Homecoming by Lyn Cote Catching a freight train out of Chicago is no way to spend Christmas Day. But Will Gustafson has run out of options. The Depression has cost him everything—his classy wife, executive job and high society life. Now he’s heading home to the northwoods of Wisconsin to face the “I told you so’s” he deserves. On the freight train a homeless little boy attaches himself to Will like a lost puppy. Who is the boy and why is he alone? On the day after Christmas in her Model T, Cass Newton picks up Will and the boy and takes them home with her. Is she crazy? But a new widow, she needs a handyman to help her weather the winter in her isolated cabin. She’s concealed her “delicate” condition from everyone but can’t deceive Will. A baby is coming and Will wonders how he’ll handle this—when his lady boss refuses to see a doctor. Why not for heaven’s sake? He fights his growing attraction to this good but stubborn woman—so unlike the wife who divorced him. The three of them become an unlikely “family.” Yet what will happen when the snow melts and all their secrets are revealed?  Meant to Be by Brenda Minton What happens when love takes childhood friends by surprise? Laney Walton and Aaron Thomas have known each other since childhood. It was the dream of their  mothers that the two of them should someday marry. But Aaron married Angela and had a son. Laney remained the quiet wallflower, the girl every mom wanted for a daughter-in-law, but none of their sons wanted for a wife. Now divorced, Aaron is back in the small town of Red Oak and his mom finds she has one more chance to make the perfect match between her son and the daughter of her best friend.",
  "genres": [
    "Christmas",
    "Contemporary Romance"
  ],
  "author": "Margaret Daley",
  "average_rating": "4.25",
  "url": "https://www.goodreads.com/book/show/27844367-christmas-eve-kisses"
}