{
  "title": "Young Orson: The Years of Luck and Genius on the Path to Citizen Kane",
  "description": "“A remarkable, eye-opening biography . . . McGilligan’s Orson is a Welles for a new generation, [a portrait] in tune with Patti Smith’s Just Kids.”—A. S. Hamrah, BookforumNo American artist or entertainer has enjoyed a more dramatic rise than Orson Welles. At the age of sixteen, he charmed his way into a precocious acting debut in Dublin’s Gate Theatre. By nineteen, he had published a book on Shakespeare and toured the United States. At twenty, he directed a landmark all-black production of Macbeth in Harlem, and the following year masterminded the legendary WPA production of Marc Blitzstein’s agitprop musical The Cradle Will Rock. After founding the Mercury Theatre, he mounted a radio production of The War of the Worlds that made headlines internationally. Then, at twenty-four, Welles signed a Hollywood contract granting him unprecedented freedom as a writer, director, producer, and star—paving the way for the creation of Citizen Kane, considered by many to be the greatest film in history.Drawing on years of deep research, acclaimed biographer Patrick McGilligan conjures the young man’s Wisconsin background with Dickensian richness and his childhood as the second son of a troubled industrialist father and a musically gifted, politically active mother; his youthful immersion in theater, opera, and magic in nearby Chicago; his teenage sojourns through rural Ireland, Spain, and the Far East; and his emergence as a maverick theater artist. Sifting fact from legend, McGilligan unearths long-buried writings from Welles’s school years; delves into his relationships with mentors Dr. Maurice Bernstein, Roger Hill, and Thornton Wilder; explores his partnerships with producer John Houseman and actor Joseph Cotten; reveals the truth of his marriage to actress Virginia Nicolson and rumored affairs with actresses Dolores Del Rio and Geraldine Fitzgerald (including a suspect paternity claim); and traces the story of his troubled brother, Dick Welles, whose mysterious decline ran counter to Orson’s swift ascent. And, through it all, we watch in awe as this whirlwind of talent—hailed hopefully from boyhood as a “genius”—collects the raw material that he and his co-writer, the cantankerous Herman J. Mankiewicz, would mold into the story of Charles Foster Kane.Filled with insight and revelation—including the surprising true origin and meaning of “Rosebud”—Young Orson is an eye-opening look at the arrival of a talent both monumental and misunderstood.",
  "genres": [
    "Biography",
    "Film",
    "Nonfiction",
    "History",
    "Cultural",
    "Audiobook",
    "Biography Memoir"
  ],
  "author": "Patrick McGilligan",
  "average_rating": "4.12",
  "url": "https://www.goodreads.com/book/show/27844357-young-orson"
}