{
  "title": "Present Over Perfect: Leaving Behind Frantic for a Simpler, More Soulful Way of Living",
  "description": "LIVE A LIFE OF MEANING AND CONNECTIONInstead of pushing for perfectionA few years ago, I found myself exhausted and isolated, my soul and body sick. I was tired of being tired, burned out on busy. And, it seemed almost everyone I talked with was in the same boat: longing for connection, meaning, depth, but settling for busy.I am a wife, mother, daughter, sister, friend, neighbor, writer, and I know all too well that settling feeling. But over the course of the last few years, I’ve learned a way to live, marked by grace, love, rest, and play. And it’s changing everything.Present Over Perfect is an invitation to this journey that changed my life. I’ll walk this path with you, a path away from frantic pushing and proving, and toward your essential self, the one you were created to be before you began proving and earning for your worth.Written in Shauna’s warm and vulnerable style, this collection of essays focuses on the most important transformation in her life, and maybe yours too: leaving behind busyness and frantic living and rediscovering the person you were made to be. Present Over Perfect is a hand reaching out, pulling you free from the constant pressure to perform faster, push harder, and produce more, all while maintaining an exhausting image of perfection.Shauna offers an honest account of what led her to begin this journey, and a compelling vision for an entirely new way to live: soaked in grace, rest, silence, simplicity, prayer, and connection with the people that matter most to us.In these pages, you’ll be invited to consider the landscape of your own life, and what it might look like to leave behind the pressure to be perfect and begin the life-changing practice of simply being present, in the middle of the mess and the ordinariness of life.",
  "genres": [
    "Nonfiction",
    "Self Help",
    "Christian",
    "Audiobook",
    "Faith",
    "Memoir",
    "Personal Development"
  ],
  "author": "Shauna Niequist",
  "average_rating": "3.82",
  "url": "https://www.goodreads.com/book/show/27840585-present-over-perfect"
}