{
  "title": "Dark Ages: 2020",
  "description": "No civilization has ever stood the test of time. When societies collapse... How do the unprepared survive? After ancient Rome fell to the barbarian hordes and its light went out, 500 years of economic and cultural deterioration followed in Europe - The Dark Ages. In the 14th century, the most brutal pandemic to ravage mankind finally pulled this part of the world out of the darkness. The Black Death decimated over 60% of the population, creating an immediate surplus of goods and land, which catapulted Europe into a new age of the rebirth: The Renaissance. The Black Death pandemic of the 14th century was no act of nature. The outbreak was unleashed on purpose, by an ancient and occult cabal which still operates at the present time, behind the secret societies of the rich and powerful. In the year 2020, moved by the desire to launch humanity into a new era of enlightenment and scientific advancements, this same obscure society plans to release a virus which can wipe out up to 90% of the world's population. Political maneuvering and the biggest false flag event in generations sets their plan in motion, and immediately the President of The United States is caught in a web of horror weaved by this powerful global elite. In the midst of it all, a clandestine CIA agent is torn between honor, duty and family. A struggling entrepreneur obeys the State and yet pays the ultimate price. An influential philanthropist has a dark secret that can alter the course of history, one which might lead a trio of scam artists to get more than they ever expected. As modern society crumbles and the final unleashing of a New World Order takes place, these 5 lives will collide in a violent struggle for control, power and ultimate survival.",
  "genres": [
    "Post Apocalyptic",
    "Science Fiction",
    "Fiction",
    "Dystopia"
  ],
  "author": "J.D. Dutra",
  "average_rating": "3.82",
  "url": "https://www.goodreads.com/book/show/27838585-dark-ages"
}