{
  "title": "Lust of Innocence",
  "description": "LUST OF INNOCENCEAn Erotic, Gripping and Compelling tale of Curiosity, Exploration and Desire...In this sensuous erotic tale, meet ELIZABETH, gently bred, and unaware of her precarious position in her household. Elizabeth is introduced to exquisite pleasures and flattered by the tantalizing advances of the pretty, ample-bosomed, colored-serving maid, Syreena.She and Syreena defy aristocratic etiquette and embark on an illustrious affair which threatens to consume them both...Take a peek at what's Jason turns, presenting Syreena with his back and she pulls his pants down, exposing his derriere. Jason closes his eyes. Syreena picks up a wooden paddle and slowly raises her arm. And in that moment, all seemed to go silent. Elizabeth’s breathe catches and every nerve within her is inflamed with anticipation ... ‘whack, whack, whack’ against Jason’s naked posterior. Jason throws his head back, a guttural sound expels from his throat. Syreena lays down the paddle and gingerly traces the inflamed marks on his butt with her fingers. She lowers her dark head and her pink tongue travels across his posterior. She licks one crimson cheek, then the other.Elizabeth can feel herself getting wet down there. Fascinated, Elizabeth is transfixed on Syreena’s tongue teasing Jason. Syreena brings her hand around to the front of Jason and wraps her fingers around his engorged manhood. Slowly she begins to stroke him, her heavy breasts brushing against his legs, her mouth and tongue trailing over his buttocks.Elizabeth is filled with excitement and she feels a hot pressure building between her legs. Without realizing it, she emits a moan.Syreena raises her head and looks sideways towards Elizabeth. Elizabeth freezes. Her breath catches in her throat as she makes contact with Syreena’s inviting, smoldering dark gaze. Jason is unaware of his sister’s presence and his voice dripping with need breaks through their hypnotic gaze. “May I please suckle on your teats?”Syreena’s eyes become emotionless as she regards Jason, and she gently corrects him, “May I please, Mistress Syreena, suckle on your teats.”Syreena snaps her fingers at Jason and Jason obediently lowers himself, and eagerly repeats her words, “May I please, Mistress Syreena, suckle on…” And as he crawls on all fours to face Syreena, he is too anxious to finish the sentence and without restraint, clamps down on her engorged nipple.Syreena stiffens from the pain, but then her dark eyes connect with Elizabeth’s wide blue eyes and she moans.",
  "genres": [],
  "author": "P.J. MacDowell",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/27841074-lust-of-innocence"
}