{
  "title": "The Great Good Thing: A Secular Jew Comes to Faith in Christ",
  "description": "Edgar Award-winner and internationally bestselling novelist tells of his improbable conversion from agnostic Jewish-intellectual to baptized Christian and of the books that led him there.“Had I stumbled on the hallelujah truth, or just gone mad—or, that is, had I gone mad again?”No one was more surprised than Andrew Klavan when, at the age of fifty, he found himself about to be baptized. Best known for his hard-boiled, white-knuckle thrillers and for the movies made from them—among them True Crime (directed by Clint Eastwood) and Don’t Say a Word (starring Michael Douglas)—Klavan was born in a suburban Jewish enclave outside New York City. He left the faith of his childhood behind to live most of his life as an agnostic in the secular, sophisticated atmosphere of New York, London, and Los Angeles. But his lifelong quest for truth—in his life and in his work—was leading him to a place he never expected.In The Great Good Thing, Klavan tells how his troubled childhood caused him to live inside the stories in his head and grow up to become an alienated young writer whose disconnection and rage devolved into depression and suicidal breakdown. But he also stumbled into a genuine romance, a passionate and committed marriage whose uncommon and enduring devotion convinced him of the reality of love.In those years, Klavan fought to ignore the insistent call of God, a call glimpsed in a childhood Christmas at the home of a beloved babysitter, in a transcendent moment at his daughter’s birth, and in a snippet of a baseball game broadcast that moved him from the brink of suicide. But more than anything, the call of God existed in stories—the stories Klavan loved to read and the stories he loved to write.The Great Good Thing is the dramatic, soul-searching story of a man born into an age of disbelief who had to abandon everything he thought he knew in order to find his way to the truth.",
  "genres": [
    "Biography",
    "Nonfiction",
    "Christian",
    "Memoir",
    "Religion",
    "Christianity",
    "Biography Memoir"
  ],
  "author": "Andrew Klavan",
  "average_rating": "4.49",
  "url": "https://www.goodreads.com/book/show/27840638-the-great-good-thing"
}