{
  "title": "Singapore Salvation",
  "description": "“Revealing account of the destruction of one woman’s personal and professional identity amid Asia’s cultural quicksand” Read the unvarnished truth about the expat lifestyle in Singapore Salvation. The \"extremely entertaining\" Jennifer Burge understands the challenges of life abroad. A professional trailblazer with a wanderlust affliction, she refused to give up after documenting the pitfalls of taking her career from the United States to Europe in her first memoir, The Devil Wears Clogs. Instead, the story continues where we left her--in the Netherlands on the eve of her move to Singapore. On arrival, she is confounded by the subtle complexity of Asian cultures, her understanding of local tradition is a mirage, appearing and disappearing with each new interaction. Moving to Southeast Asia when the rigidity of European life began to wear on her seemed to be the perfect solution. A sophisticated modern condo in the heart of a developing nation was the answer to her prayers—or so she thought. The entrance of the Global Financial Crisis compounded the already-challenging international job search to an unprecedented level. Living in her fourth country without her professional status or a peer network leaves Jennifer to question her identity. Solo travel across Asia allows her to create an authentic one. From the Back Cover: Singapore, shining example of modernity and development in Asia? Or “Disneyland with the Death Penalty”? I was ready to leave Europe, but knew nothing about Asian culture. Landing in Singapore was a crash course. Learning the difference between North Americans and Europeans was kindergarten compared to East meeting West. I’d left my job just before the grand entrance of the Global Financial Crisis, and Singapore was fiercely protecting its own. I was no longer branded with a corporate identity and I wasn’t anyone’s mother. Not only did my external landscape undergo a radical transformation, my internal one was left in ashes. I had to go looking for it in Tokyo, Cambodia, Vietnam, and New Zealand−places I never expected to find myself. When I did, no one was more surprised than I.",
  "genres": [],
  "author": "Jennifer Burge",
  "average_rating": "3.90",
  "url": "https://www.goodreads.com/book/show/27838479-singapore-salvation"
}