{
  "title": "Dirty Bad Box Set",
  "description": "The first three Amazon Top 100 books in the Dirty Bad Series - Dirty Bad Wrong, Dirty Bad Savage and Dirty Bad Strangers - now available in one volume!*Bonus content - read the first two chapters of the next in the Dirty Bad series before release***Warning - these novels contains graphic sex, and hardcore elements of BDSM. There are scenes of violence (consensual) as well as sexual practices some readers may find offensive.If you aren't turned on by dirty bad wrong sex then please walk on by. Thank you.***Dirty Bad WrongThey call him Masque.I call him God.The man I want to consume me, own me,break me and corrupt me.Yet I've never seen his face.His body ripples like an Adonis, sculpted in steel anddripping in sin. His flesh is inked with the mark of thechimera - one body, two very different halves.He plays hard.He plays rough.He has no limits.He's so fucking dirty bad wrong.But I love him for it.***Lydia Marsh is always the strong one. The girl who never breaks, and sure as hell never cries. She's got it all - the perfect little life in cosy suburbia, with her perfectly nice boyfriend, and their perfectly sufficient sex life. She's even got her perfect little career plan all wrapped up at Trial Run Software Group.But when it all falls apart, and Lydia's pretty, green eyes are fixed on a brutally sexual stranger - the man they call Masque - she comes to suspect that being strong isn't all it's cracked up to be.For now Lydia wants something she's never wanted before...And she wants Masque to give it to her.Dirty Bad SavageThey say Callum Jackson's a savage. No home. No prospects. No self-restraint. He's red-flagged on my system, a grade-1 aggression risk, totally off limits for a woman like me. But the rules don't allow for my dangerous games; they don't bend for my twisted desires. Callum Jackson is the most beautiful beast. A beast I can't stop thinking about, can't stop wanting, can't stop hunting... ...I just pray to God this beast bites. Sophia Harding runs a tight ship. She may work in the dregs of housing association slums, but her patch is on the way up. Anti-social behaviour is down, employment is on the rise, and she's even been shortlisted for estate manager of the year. It's looking good. Really good. Until Callum Jackson completes his jail time and lands right back on her doorstep. She could do without a guy like him on her books: a failure of the system and a pain in the fucking ass.She should tick the boxes, do her job and keep her distance – that's what the handbook says. The handbook says no one-on-one contact, no at-risk situations, no direct confrontation of any kind. But the handbook doesn't know of her craving for hardcore submission. The handbook has no fucking idea how she yearns to unleash Jackson at club Explicit, where his savage can really run wild. The handbook doesn't know shit... Dirty Bad Strangers He calls me his dirty girl. He’s just a caller, a sex line client, an anonymous pervert like all the others. Except he isn’t. He’s under my skin… his voice, his laugh, his twisted fantasies. He wants to watch me with other men. Lots of other men. He wants me blindfolded and bound and taken by strangers until I’m a used-up mess. Then he wants to take me himself. I should hang up, report him to my supervisor. But I won’t.",
  "genres": [],
  "author": "Jade West",
  "average_rating": "4.38",
  "url": "https://www.goodreads.com/book/show/27837253-dirty-bad-box-set"
}