{
  "title": "American Commander: Serving a Country Worth Fighting For and Training the Brave Soldiers Who Lead the Way",
  "description": "In recent years, the world has learned just what is required to bravely serve America through SEAL Team Six. Now, for the first time, we hear from their commander.For more than half a decade, Ryan Zinke was a Commander at the elite unit Navy SEAL Team Six.  A 23-year veteran of the U.S. Navy SEALs,  Zinke is a decorated officer and earned two Bronze Stars as the acting Commander of Joint Special Forces in Iraq.  Zinke trained and commanded many of the men who would one day run the covert operations to hunt down Osama Bin Laden and save Captain Phillips (Maersk Alabama). He also served as mentor to now famous SEALs Marcus Luttrell (Lone Survivor) and Chris Kyle (American Sniper).Written with #1 New York Times bestselling co-author of American Sniper, Scott McEwen, American Commander will offer readers the hard-hitting, no nonsense style the SEALs are known for.When Zinke signs with the U.S. Navy, he turns his sights on joining the ranks of the most elite fighting force, the SEALs. He eventually reaches the top of the SEAL Teams as an assault team commander at SEAL Team Six. Zinke shares what it takes to train and motivate the most celebrated group of warriors on earth and then send them into harm’s way. Through it, he shares his proven problem-solving approach: Situation, Mission, Execution, Command and Control, Logistics.American Commander also covers Zinke’s experience in running for Montana’s sole seat in the United States Congress. Zinke’s passion for his country shines as he conveys his vision to revitalize American exceptionalism. Scott McEwen and Ryan Zinke take readers behind the scenes and into the heart of America’s most-feared fighting force. American Commander will inspire a new generation of leaders charged with restoring a bright future for our children’s children.",
  "genres": [
    "Military Fiction",
    "Nonfiction",
    "History",
    "War",
    "Biography"
  ],
  "author": "Ryan Zinke",
  "average_rating": "3.74",
  "url": "https://www.goodreads.com/book/show/27840683-american-commander"
}