{
  "title": "Coins: Five Hammers of the Void",
  "description": "The man reached in his pocket and drew forth several small coins. He threw them on the ground and after they bounced to a stop, the unbelievable happened. The coins began to transform. One folded and refolded like origami into a scorpion the size of a car, the next spun and faded and in its place left a flying creature with glittering eyes and wicked claws. The last erupted into a hulking, dusky beast on two legs carrying a massive stone club. The man signaled with his hand and the creatures closed in…Everything Chance knew about the world has changed. His quiet, peaceful life with his father on their ranch, a lie. The death of his mother, a lie. Even his last name “Clayton” is actually “Mallory.” Not to mention that the fate of every soul on earth now depends on something that fits in the palm of his hand…In one life-altering moment Chance is swept up in an ancient war between those who wish to control life on earth and those who wish to protect it. The War of Coins. Scattered throughout the world there exist a variety of powerful coin-shaped artifacts. From within each coin an avatar can be summoned and controlled by whoever throws the coin – these users are also knows as Wielders. The avatars summoned can be used for evil or benefit, which is also determined by the Wielder.This secret war that has been played out on the landscape of humanity for centuries becomes Chance’s legacy when the nefarious Solomon Drake attacks his home destroying all Chance knows and holds dear. Chance’s father sacrifices himself to save Chance giving him a single coin and making Chance swear to protect it at all costs.Chance is spirited away to the mother he never knew, Alana, a key player in the war siding with those who protect humanity from wielders of diabolical intent. She informs Chance that the coin he has is The Coin of War one of a set of five that if thrown together can unleash The Hammer of the Void – a single, great titan whose powers are such that it would rend the wielder invincible. Solomon is clearly trying to assemble the set and it’s up to her and her team of experts to stop him.Chance is hesitant to join this woman who abandoned him, but more reluctant to disobey his father’s orders to protect The Coin of War. Hence, Chance is introduced to the team: Karl, a weapons man and the best wielder among them. Morgan Lafayette, a young girl whose seemingly bubbly personality betrays her expertise as a wielder of fae-specific coins. Thomas Song, a calm Asian man wise beyond his years and deadly at throwing combo-creature coins. And Mara Coronado, the beautiful guardian of the Coin of Storms, a woman with an astonishing secret and a score to settle with Solomon Drake.The adventure takes the team on an exotic, global scavenger hunt to find the Coins of the Void before Solomon does. They’re one step behind him as their journey leads everywhere from the Amazon to the Himalayas to a small island in Polynesia. The wonders of the secret world of coins unfold before Chance, as do his feelings for his teammate Mara.But greater challenges await him as well – evil mercenaries known as the Banner are hired to seek out and kill. A religious fanatic group known as The Purifiers – devoted to the destruction of coins and wielders – seek to form a tenuous alliance with Alana and the group. But can they be trusted?And ultimately there is more to Solomon’s scheme than the group ever could have imagined. Solomon will put Chance to the ultimate test challenging everything he believes along with his ability to sacrifice for those he loves.",
  "genres": [],
  "author": "Bradley Kayl",
  "average_rating": "3.00",
  "url": "https://www.goodreads.com/book/show/27835535-coins"
}