{
  "title": "Paths of Fear: An Anthology of Overcoming Through Courage, Inspiration, and the Miracle of Love",
  "description": "Connie Kerbs and Pebbled Lane Books presents this collection of stories, poems, and essays, on a universal theme. Most of all, Paths of Fear is a deeper look at all that fear can teach us and our triumph over it as we find the fortitude to replace it with hope, and determination.“Feed your faith and your fears will starve to death.” ~ Max LucadoPaths of Fear is an inspirational reflection on facing, enduring and overcoming one of the most basic human emotions. Fear. It is an experience we all have at one time or another, to varying degrees. Understanding that the lasting aftershocks can be as devastating as the original traumatic event or fearful season in our life is paramount. Fear is our most primal emotion. It manifests as a scream of sheer terror, an alarm of mortal danger, or a simple cry for help. Sometimes it is silent, imagined, a recipe for our nightmares.Fear can be a discouraging whisper saying “you will fail” or “you’re not good enough.” Sometimes our fears are planted by other people. Other times our fear-based emotions are cultivated by an environment that would extinguish us, not obviously or quickly, but rather excruciatingly erode us bit by bit on the inside. Through these pages, we learn it is about the enduring of fear on our own terms, with dignity, even if imperfectly. The heartfelt essays in Paths of Fear speak to how others breached their fears to become wiser, stronger and eventually able to give and receive the only true antidote to fear - love, in one form or another.There are no werewolves, vampires, or masked maniacs in this light inspirational. The only monsters here are those of circumstance and the innermost demons we face. Most of all, Paths of Fear shows us how many others, from all walks of life, have experienced many different kinds of fear…and how they have endured with courage, faith, and love to prevail.Part poetry, part self-help, part inspiration, means inspiring quotes and timeless poetry lace the chapters and thematic transitions. In this way, the book hopes to be as engaging and heartfelt as it is inspiring.",
  "genres": [],
  "author": "Connie Kerbs",
  "average_rating": "4.64",
  "url": "https://www.goodreads.com/book/show/27855331-paths-of-fear"
}