{
  "title": "Sim 299",
  "description": "While the others slept, Aidan spent hours each night running sim after sim. Although he was only a twelve-year cadet, he had completed more simulations than any prime— ever.“You are setting history,” General Estrago told him. “No one has ever made it to the current simulation you are attempting. The other Masters and I are eager to see what comes next.”So was Aidan.Synopsis: The planet Ethos is at war with a mysterious enemy known as the Splicers. Their only successful defense is the Prime Initiative. All newborns with the compatible genetic code are taken from their families and injected with the Prime Stimulus. Each child that survives the stimulus develops an extraordinary ability and is conscripted into the military for training.After turning twelve, Aidan is moved to the upper-class at the Mount Fegorio training complex. His special gifts allow him unprecedented success in the virtual training simulations, advancing him further than any prime cadet in history. No one knows what lies after sim 299, not even Director Tuskin, the ruthless and reclusive ruler of their planet. But something, or someone, has been guiding Aidan there. If he can pass the final tests, he may discover the key to ending the Splicer War.----From the imaginative mind of debut author Johan Twiss, I AM SLEEPLESS: Sim 299 is an extraordinary space fiction adventure series that will delight readers of all ages. I AM SLEEPLESS has a clean read rating with the perfect mix of adventure, humor, and mystery in a SciFi Fantasy world that will keep you turning pages through the night.Clean Rating: There are no scenes with sex, drugs, graphic violence or typical \"earth\" swearing in this novel. There are numerous fight scenes and action sequences where people are injured and/or die, but it is not graphic and takes place in a virtual simulation. Swear words are fitting to the fictional world of Ethos, such as Tuskin's Fury, Batmonkeys, Holy Hippophants, etc... There are budding romances with kissing involved. There are suspenseful situations with monster alien creatures, fitting of the science fiction genre, and an overall thematic undertone of good v. evil that is suitable for tweens, teens and young adults.",
  "genres": [
    "Science Fiction",
    "Young Adult",
    "Fantasy",
    "Dystopia",
    "Mystery",
    "Fiction",
    "Middle Grade"
  ],
  "author": "Johan Twiss",
  "average_rating": "4.28",
  "url": "https://www.goodreads.com/book/show/27846534-sim-299"
}