{
  "title": "Alt.Film Journal! How I Made A Low-Budget Indie Film for $32,000",
  "description": "Based on a blog kept at the time filming, Alt.Film Journal!, by Eric Bickernicks, is the story of his foray into the world of independent filmmaking. In it he gives candid, no-holds-barred account of his experience, sprinkled with advice to a new generation of would-be filmmakers.Trailer of the film: https://youtu.be/Tu1CEwozC0sEric covers all his choices with character and settings during the writing of the screenplay. He explains the technical aspects, such as sound, lighting equipment, editing and special effects used in editing. He also describes the process of hiring and working with actors, dealing with unreasonable actor unions and avoiding location permits. He also explains how to go about submitting a movie to the Sundance Film Festival and how to approach the big talent agencies. He reveals his unique method that will get you past the gatekeepers at these agencies so you can talk to a real person. He exposes how certain people in the business want your money for their so-called \"advice\", knowing that you, as a filmmaker will be desperate for any lead. Eric's first feature length project is an Internet experience in every sense of the word. Not only does much of the action take place on the Internet, the production was created almost exclusively via the Internet circa 1999. The original casting call was done online and the initial interviews were done through e-mail. The Super 16mm camera used to shoot the film was purchased online through eBay, and the first 20 rolls of film were found on the usenet newsgroup alt.rec.movies.cinematography. Most of the music used in the film was found online through music websites such as mp3.com and IUMA.com. With a fast Internet connection, Eric was able to screen hundreds of potential artists and songs. He then contacted the artists online to secure permission to use their music. The subject of the book, “alt.sex”, was filmed in and around Boston, Massachusetts and is based on his own dating experiences and how the Internet, in particular, affected them. It was filmed over a period of a year and half, with 38 shooting days, most of them weekends. The film, very independent in nature (i.e., very low budget), was done completely on a volunteer basis. None of the cast or crew were paid, all locations were donated, no permits were issued or insurance taken out. The final budget of $32,000 covered mainly the camera purchase, film costs and food for cast and crew. The story of ”alt.sex\", an offbeat comedy, is a surreal look at the world of dating, computers and the Internet. The script, which Bickernicks wrote, is based on his own experiences and dating misadventures during his search for the “perfect” partner. It deals with how computers and the Internet can help or hinder the search for that perfect someone. For example, it’s very easy to mislead people online, through falsified details (lying about one’s age, using someone else’s picture); and it’s easy to let your own starry-eyed expectations misread things. The story begins when the hero, John, breaks up with his domineering girlfriend Irene. When he becomes despondent, his friends step in—often with humorously bad results—to help him recover and move on. Complicating their well-meant intentions are a cast of characters, such as a hacker who goes by the name of “Mongo”, several voyeuristic co-workers and a new office computer with a migrating cache of NSFW photos. When his buddies' advice backfires, John sets out on his own to find the perfect mate. With his furry pooch and an enigmatic online friend for support, John's search takes him through misleading, badly-worded personals ads, lubed-up urban rednecks, a disgruntled, balloon-delivering clown and more than one fishnet-clad leg. The entire movie is online, so readers can watch and follow the production as in unfolds on a day by day basis. The link to the movie is included in the eBook.",
  "genres": [],
  "author": "Eric Bickernicks",
  "average_rating": "4.25",
  "url": "https://www.goodreads.com/book/show/27855071-alt-film-journal-how-i-made-a-low-budget-indie-film-for-32-000"
}