{
  "title": "The Vineyard",
  "description": "In The Vineyard, New York Times bestselling author Barbara Delinsky (Lake News, Coast Road, Three Wishes) has written her most complex and emotionally rewarding novel: a story of two women, a generation apart, each of whose dream becomes bound with the other's. To her family, Natalie Seebring is a woman who prizes appearances. She is exquisitely mannered, socially adept, a supportive wife, and head of a successful wine-producing enterprise. So when she announces plans to marry a vineyard employee mere months after the death of her husband of fifty-eight years, her son and daughter are stunned. Faced with their disapproval, Natalie decides to write a memoir. There is much that her children don't know about her life -- about her love of the vineyard, her role in fighting to build it up, and the sacrifices she made for her family. Olivia Jones is a dreamer, living vicariously through the old photographs she restores. She and her daughter, Tess, have no one but themselves, so they cling to the fantasy that a big, happy family is out there somewhere, just waiting to welcome them home. When Olivia is hired by Natalie to help with her memoir, a summer at Natalie's beautiful vineyard by the sea seems the perfect opportunity to live out that fantasy -- an elegant home by the shore, a salary that allows her to hire a tutor for her dyslexic daughter, a job that is creative, hours spent with a woman who has led a charmed life. But all is not as it seems, Olivia and Tess discover when they arrive at Asquonset, the vineyard in Rhode Island. While welcoming, Natalie is not quite the mothering type, as is quickly evident in the hostility her daughter and son have toward her -- it's a hostility that Olivia must buffer. Another dose of stark reality comes in the form of Simon Burke, who runs the vineyard's day-to-day operation and sees in Olivia and Tess an unwelcome reminder of the wife and daughter he tragically lost. And then there is the cruel reality of Olivia's own life -- the mother who never wanted her, and a career that has floundered. Natalie's story, intended for her own children, enlightens Olivia as well. The lives of these two women of different generations, parallel in so many ways, become, in The Vineyard, a powerful and moving story as the fantasy of an idealized life, complete with perfect romance, crashes headlong into reality.",
  "genres": [
    "Fiction",
    "Romance",
    "Chick Lit",
    "Contemporary",
    "Womens Fiction",
    "Drama",
    "Adult"
  ],
  "author": "Barbara Delinsky",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/278564.The_Vineyard"
}