{
  "title": "Cómo vivieron más de 110 años: Recetas de LARGA VIDA de los supercentenarios abuelos del mundo",
  "description": "Hay una raza especial de personas que no siente el paso del tiempo como el resto de los mortales, que envejece lentamente y con gracia, que como mucho necesita ir al médico una o dos veces en toda su larguísima vida. Una raza a la que las enfermedades llamadas de la edad (Parkinson, Alzheimer, cáncer, degenerativas…) no afectan. Un grupito de personas repartidas por todo el mundo que no tienen necesidad de preocuparse por el colesterol, ni por la tensión alta, ni por los ataques al corazón, ni siquiera por las arrugas. Son gente a las que la vida trata con gracia y les permite vivir año tras año con una salud insultantemente buena y conservando todo su sentido del humor. ¿Cuáles fueron sus recetas y lecciones para el resto de los mortales? ¿Qué descubrieron los científicos estudiando los códigos genéticos de estos privilegiados? ¿Cuál es el factor común que une a toda esta élite de supervivientes dispersa por todo el mundo? Y sobre todo, ¿qué pasaría si escucháramos sus consejos y siguiéramos sus recomendaciones? En este libro encontrarás reunida toda la información y consejos que proporcionaron los más destacados miembros del selecto club de los supercentenarios. Son los abuelos del mundo, los que rompen barreras de longevidad y larga vida. Son personas que llegaron sin esfuerzo y con salud plena a superar los 110 años (alguna superó los 120). Y aún mejor, lo hicieron con una salud prácticamente perfecta y conservando su personalidad y buen humor hasta casi el final de su larga vida. Se trata de una obra recopilatoria de recetas, trucos y anécdotas para vivir mejor y más tiempo. Serán los propios supercentenarios los que te digan cómo lo hicieron, y de paso conocerás algunas de sus apasionantes vidas. También te pondrás al día en los últimos avances y descubrimientos científicos en materia de alargar y mejorar la calidad de la existencia, cómo el código genético puede ayudarnos a descubrir el secreto de los superabuelos para vivir más y mejor.",
  "genres": [],
  "author": "Maya Ruibarbo",
  "average_rating": "0.00",
  "url": "https://www.goodreads.com/book/show/27854166-c-mo-vivieron-m-s-de-110-a-os"
}