{
  "title": "Sammy and The San Juan Express: Seals The Deal",
  "description": "Think Katniss (Hunger Games) meets Nancy Drew (Girl Detective)— Now, meet Sammy — Only a week after their mother died, fourteen year old Samantha Carlisle and her younger brother, Loren, are shipped off to live with their Uncle, a float plane pilot in the San Juan Islands. Sammy’s hidden powers emerge when she senses danger and harm being done to seals and sea lions. Her effort to protect them triggers a chain of events that lead to kidnapping and attempted murder. Only her strength, courage, and new found friends, above and below the water’s surface, will determine if she lives or dies. “You are special,” her mother told her. Now she finds out why. Overview Samantha Carlisle’s world is turned upside down with the death of her mother. Her father, a gulf war veteran, is lost in anger and alcoholism. At fourteen Sammy is alone, frightened and abandoned. In her most desperate moment, she and her seven year old brother are sent to live with their Uncle Teddy, a float plane pilot, in the San Juan Islands. The adventure begins. Just two weeks in the Islands and Sammy’s world transforms from absolute grief to an awakening that leads to a fight for survival and if she succeeds, saving her new found friends, and finding herself. Along the way she meets a federal agent who in her words, “looks like a female Indiana Jones,” she meets a pathologist from the National Animal Crime Scene Investigation unit, meets a woman who, through experiencing a similar loss, becomes her emotional sister, and encounters a marine biologist whose southern drawl carries Sammy to the realization that she can do anything. Most importantly, Sammy discovers a special sensitivity to animals that opens doors to a new world. “You’re special,” her mother told her, and she now learns just how special she is. Sammy also finds plenty of trouble along the way. “There are pirates in these waters,” Uncle Teddy told her, and she soon learns how dangerous modern day pirates can be. Thugs and killers might be a better description. Whether she lives or dies depends on her wits and courage, and on the new family, above and below the water’s surface, she has gathered around her. Seals The Deal is fast moving adventure on the high-seas of the San Juan Islands. A must read for ten to fifteen year olds, and young hearted adults of all ages.",
  "genres": [],
  "author": "Nickolai Vasilieff",
  "average_rating": "4.57",
  "url": "https://www.goodreads.com/book/show/27848446-sammy-and-the-san-juan-express"
}