{
  "title": "The Supermarket Guy",
  "description": "The Supermarket Guy is a hilarious story that takes you on a Ferris wheel ride of fun and unexpected twists and odd situations. In the end, it offers that sort of spirit and camaraderie that truly makes any country great. It's people looking after its people.  The Supermarket Guy, known as Harold, starts his normal routine off to work at his uncle's grocery store, causing a few destructive incidents at work. Unfairly blamed for the chaos created at the grocery store, he gets demoted. While having to suffer profusely, watching his alcoholic rival take charge of the store, he makes his best attempts to please his new master.  With love in full blossom at the time-love is always on Harold's mind-he mistakenly meets up with a high-class hottie named Shelly, which changes a lot of things for the better. At the same time, an investment opportunity with an old friend conjures up future fortunes. Life seems to be looking up for old Harry-or is it just a mirage at the market?  Can Harold stomach entering into his workplace demoted just when meeting his new high-class love interest?  Growing up, my main interest was art sketching, and I got plenty of inspiration for practice through the comic books I bought locally. I became a big fan of Marvel and Archie comics. Then there was the calmness and serenity that was only offered by small-village life, with the art of fishing and wading in its rivers in the hot summer months. Being a nature lover, sometimes a thirst came to just escape into the wild where the scent of pines and fir trees abounded in massive quantities. Then the yellow colors of birches, red maple leaves, and the fall rustle of leaves on the ground provided for myself a strange sort of reflection and admiration of the cycle of nature. The solace of winter and the fresh powder base allowed us to rush out again to enjoy cross-country skiing, sliding, and downhill skiing.",
  "genres": [],
  "author": "Daren Doucet",
  "average_rating": "3.90",
  "url": "https://www.goodreads.com/book/show/11758416-the-supermarket-guy"
}