{
  "title": "The Truth: I'm a Girl, I'm Smart and I Know Everything",
  "description": "THE TRUTH is a delightful, humorous secret diary, written by a girl who is 11-12 years of age. She is wise and yet innocent. Her words acknowledge those priceless truths that we all knew as kids. She makes us cry and laugh and see ourselves. Everybody loves reading her thoughts, secrets, adventures and solutions to difficult problems. Girls are naturally curious and this book gives them a real opportunity to see how a girl like themselves in so many ways handles her toughest problems and most personal thoughts. Mom can read the book along with her daughter and not only be brought back to herself as a youngster, but find on every page relevant topics for discussion with her daughter. How do you handle a bully? How do you handle a crush on a boy? What about teasing? How do you find time to listen to your daughter? Do we have enough fun together? What really matters? There is space right within the book for the girl and or mom to make notes or her own diary entries. The book ends with discussion ideas that can also open up whole new areas of topics for mom and daughter or the young reader and other members of her family, friends, or teachers. Behind this very easy read, written by a positive psychologist with over 25 years of clinical experience, is the psychological message to the girls reading THE TRUTH that they can and must keep the fire and passion of their girlhoods as they grow up and have the courage to carry the most precious parts of themselves into adulthood.. For parents the book is a way back to what made them feel most special at 10, 11 or 12. Once parents are back in the place where their kids live, then listening, trust and real sharing can begin. Every girl and ever parent wants this kind of TRUTH! Girls who enjoy THE TRUTH will be eager to go on and read the next book in The Truth You Tell Me Yours and I'll Tell You Mine...Maybe, where the girl is now 13, has moved, has to adjust to new friends, a new baby and all sorts of other problems that face us in our early teens.",
  "genres": [],
  "author": "Barbara Becker Holstein",
  "average_rating": "3.75",
  "url": "https://www.goodreads.com/book/show/2785158-the-truth"
}