{
  "title": "Odyssey In A Teacup",
  "description": "Note: Alternate-cover edition for ASIN: B0153VEB2IA tut-tutting, big-breasted, modern-day gorgon; a humourless schoolmarm with an unfortunate name and freakishly long, yellow incisors (yeesh)—these are the kinds of people Ruth Roth regularly encounters. Add in daily dealings with an acerbic mother who squawks like a harpy, a father with a dodgy moral compass and a God complex, a bitchy mirror, and Ruth’s existence feels like a Greek tragicomedy. The idiocy of daily life makes sense to Ruth when she develops a fascination with ancient mythology. She learns that the deviant gods and spectacular monsters of bygone myths are alive and well in the backwoods of our psyche; that there’s always one who escapes suppression and can have the whip hand in our lives. Ruth’s is one of the most unwelcome societal presences—the goddess of obscenity. And talk about ugly! Ruth can relate to this immortal. Not in looks; Ruth is quite comely. But she feels unwelcome in her own family (she gatecrashed her mother’s womb only two months after her brother vacated it). Despite being labelled the ‘black sheep’, or maybe because of it, Ruth takes on her nemeses, bravely and brazenly (her dirty goddess doesn’t give a rat’s about social niceties). But our heroine is war-weary. And the yearning to fit in somewhere—anywhere—eventually undoes her. We must look on helplessly as Ruth loses her soul. She wants it back, though! Just as well the mad characters in her mind and experiences won’t quit. Just as well Ruth never loses her wry wit. And where her nearest and dearest attempt to keep her shrunken into a wholesome package of conformity, Ruth’s two closest girlfriends simply won’t allow it. And then there’s Ralph Brill. Ruth’s hot-looking, eccentric cousin and best friend, Ralph is her staunchest ally. Also a misfit in his family, he has his share of problems including a st-t-t-tuttering brutish father, and an obsessive-compulsive personality disorder—Ralph needs to do everything twice, twice. Ruth relies on his repeated encouragement and the support of her girlfriends as she embarks on an odyssey. A good homoeopathic dose of ancient mythology helps her find her way back through the sludgy shame and irrational fears choking her spirit. Then just when all seems well, Ruth faces an apocalypse … Tags: satire, humor satire, women's fiction, humorous fiction, humor satire, fiction satire, humorous fiction best sellers, humor",
  "genres": [
    "Chick Lit",
    "Fiction",
    "Humor"
  ],
  "author": "Paula Houseman",
  "average_rating": "4.30",
  "url": "https://www.goodreads.com/book/show/27853133-odyssey-in-a-teacup"
}