{
  "title": "Warden",
  "description": "Max is a Warden, a sacred being burdened with the task of ensuring nature continues to thrive. Wardens are revered and to be afforded the respect of their stations at all times for they are passive beings, in constant danger from dark forces. Every warden has their own paladins, ancient knights born to protect, obey and serve. They are bound by honour, justice, courage, and above all, loyalty to their liege.   Sounds like a pretty good deal, right?   The only problem is, Max has no idea what a warden is let alone a paladin. She's been alone her whole life, causing natural disasters and bar fights everywhere she goes. Strange creatures stalk her every step, and she's fairly certain she's a chocolate junkie. Meeting a bunch of smokin' hot knights seems too good to be true but she's just desperate enough to believe them. After all, what harm could there be in a few days of rest and relaxation in a beautiful house by the beach, surrounded by a harem of muscle-bound warriors?   But there's one thing she didn't count on ... Ryker.   The unofficial leader of the group of outcast paladins, Ryker is a perpetually premenstrual, growly, broody, insensitive jerk with no brain-to-mouth filter. He also happens to be the sexiest, hottest, most sensual man Max has ever had the pleasure of ogling. Six foot four of solid muscle, deep chocolate brown eyes, shaggy black hair and a rugged scar down one side of his face, he was Max's every fantasy come to life. But the ancient knight is scarred with a tragic past and believes his soul is stained with dishonour. Coupled with Max's own stubbornness and trust issues, she figures the chance of getting a happy ending is pretty slim.  But fate can be a fickle wench, as Max and Ryker soon discover in Warden, Elemental Paladins: Book One.",
  "genres": [
    "Fantasy",
    "Paranormal",
    "Romance",
    "Paranormal Romance",
    "Magic",
    "Urban Fantasy",
    "Reverse Harem"
  ],
  "author": "Montana Ash",
  "average_rating": "4.20",
  "url": "https://www.goodreads.com/book/show/27863665-warden"
}