{
  "title": "Let Me Tell You a Story",
  "description": "\"Did I ever tell you about Wilt Chamberlain?\" \"Did I ever tell you about Bob Cousy?\" \"Did I ever tell you about Joe DiMaggio?\" Whenever Arnold \"Red\" Auerbach starts a sentence with those six words -- \"Did I ever tell you about . . .\" -- anyone within earshot should prepare to hear a marvelous story.As a living legend among sports fans, Red Auerbach -- the fiery coach who led the Boston Celtics to nine NBA championships, eight of them consecutive -- has long been renowned for his formidable brash, opinionated, and unfailingly accurate. As a coach, he had a great eye for talent, drafting such Hall of Famers as Bill Russell and Larry Bird, and managed to build a powerful franchise with an abiding legacy. Red never stood still along the sidelines and was never seen without his trademark cigar.Now in retirement, at age eighty-seven, he remains a lively part of the game, still consulted by coaches, players, and general managers. And his admirers continue to be legion. Not long ago a former president postponed a meeting with Bill Gates so as not to pass up the chance to talk with Red. For the past several years, John Feinstein has met regularly with Red Auerbach and his friends in a series of raucous, unforgettable sessions.Out of those smoke-and-laughter-filled rooms have emerged the stories of Red's life, from his childhood on the playgrounds of Brooklyn to his triumphs at the famed Boston Garden, where he coached for sixteen years. Just listen as Red colorfully recalls all the players and coaches he has worked with and played Bill Russell, Larry Bird, Bob Cousy, Wilt Chamberlain, Sam Jones, and Michael Jordan -- you name them, the basketball greats are all here. Red holds nothing back.In Let Me Tell You a Story , Red Auerbach's unique experiences in sports and John Feinstein's unparalleled skills as a storyteller combine to produce one of the most richly entertaining books ever written about the game of basketball.",
  "genres": [
    "Sports",
    "Basketball",
    "Biography",
    "Nonfiction",
    "Memoir",
    "History",
    "Autobiography"
  ],
  "author": "John Feinstein",
  "average_rating": "4.12",
  "url": "https://www.goodreads.com/book/show/1175894.Let_Me_Tell_You_a_Story"
}