{
  "title": "Two Captains, One Chair",
  "description": "This is a previously-published cover of ASIN B0186KV0ZERocking sparkly purple toenails under a pair of steel-toe boots, Suzy is a river barge captain in the Alaskan Bush. She’s a tiny gossip with big problems: her able-bodied barge boy just left her high and dry, she can’t sleep, her best friend Helly is getting all the action… and now, someone’s stolen her gold nugget.  Ed is a nice guy. He’s a bushrat with a big beard, a knack for fixing things, and a wardrobe consisting of flannel… period. He’s the only man who can help Suzy with all of her problems, but he’s also her most likely suspect. And Ed has a secret, one which Suzy will go to great lengths—even if those lengths are measured in rope—to uncover.  Enter Helly’s brothers, who rob Suzy of orgasms, harass her wildlife, and break her roof. Then, Ed’s wicked sister, who insists Suzy’s nugget is hers. Add in a whole Passion Party’s worth of tipsy women, a pet goat bent on revenge, conniving fishing guides… and Suzy’s belligerent dad, who’s got a hard-on for the law.  In the resulting madness—amongst big criminal acts, little criminal acts, and ones that are juuuust right—will Suzy have a fighting chance of finding her gold nugget? Or will she get sidetracked by the tantalizing mystery that is Ed, and in doing so, discover just how bad Ed can be?  Two Captains, One Chair is a romantic comedy that can be read as a standalone - though you’ll laugh a boatload more if you read Two Cabins, One Lake first. Catch up with Helly and Gary in Marlow's latest wacky contemporary romance, and meet an expanded cast of quirky characters as they maraud through the Alaskan Bush, violating the basic tenets of civilization to bring you another sexy, ridiculous adventure.",
  "genres": [
    "Romance",
    "Contemporary",
    "Humor",
    "Contemporary Romance",
    "Chick Lit",
    "New Adult",
    "Comedy"
  ],
  "author": "Shaye Marlow",
  "average_rating": "4.26",
  "url": "https://www.goodreads.com/book/show/27857713-two-captains-one-chair"
}