{
  "title": "A Kaleidoscope of Masquerades",
  "description": "Climatic events at a 1983 masquerade ball are merely the beginning of a kaleidoscope of confusion and anarchy that threatens life and liberty of a society facing change and choices that will reverberate into the future known as now. More than 30 years ago, to be a Lady in Disguise meant prestige, money and fun! Ladies travel the world as volunteers for charitable humanitarian relief work. Mysterious costumed Ladies in hooded cloaks roam the streets in a suburbia marketing blitz for hair care products. Their all-American spookiness and corporate success make them the natural choice to host a charity masquerade ball where rising political stars of the 20th century will emulate kings & queens of the 1700s. The cost for a ticket is more than Lt. Sinclair Plate makes in a month as a police officer but he will be there on duty. Successful insurance agent, Daphne Martin, can afford a ticket but several others are planning to crash the party and steal the show. Still, despite Plate's suspicions of common criminal pursuits such as drugs or prostitution, it all seems innocent entertainment and Plate is warned to back off. But then customers of the Lady in Disguise Corporation start disappearing and an unidentified body is found dressed in a cloak. The party must go on. Many in the upper society of the world of politics are counting on it to herald the dawn of a new political age, introducing the country to the leaders of tomorrow. Fears for the safety of the guests take a backseat to concerns as to which politician or socialite will get to wear which costume. All the men want to be Louis XVI and all the women covet the costume of Marie Antoinette and play those parts in the theatrical skits onstage at the ball. A fair lottery is the mechanism of choice, so guests are warned to be content with the character they draw. Little do they know the fates of past royals are intertwined with destinies of 1980s celebrities, as is the future direction of the country, in this historical fiction mystery featuring Lt. Sinclair Plate, descendant of a famous 1900s Texas lawman, combining forces with Daphne Martin, his insurance agent girlfriend. The fate of Plate and Daphne's relationship also hangs in the balance as Plate contemplates old and new women in his life and how any future with Daphne would impede his work in the present. They must also choose the direction of their lives.",
  "genres": [],
  "author": "Deborah DR Kralich",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/27858045-a-kaleidoscope-of-masquerades"
}