{
  "title": "Light of Honor",
  "description": "Multiple-awards winning Primeval Origins: Light of Honor is the second book of the epic origins story of mankind, our heavenly hosts, and the eternal war between good and evil where all is revealed, through characters both past and present, and tellings of humanity's heroic struggles against terrible tyrannies, deadly dinosaurs, and ancient gods answering the question, \"What if all of our myths and legends are true?\" Book 2 in this epic series.* AWARD WINNING, Winner, Epic Fantasy Book ofthe Year, 2017 Independent Press Awards* AWARD WINNING, 2nd Place, Fantasy Book of the Year, 2016 Reader Views Literary Awards. * AWARD WINNING, Merit, Fiction/Fantasy Book of the Year, 2016 CIPA EVVY Award* AWARD WINNING, Finalist, Fantasy Book of the Year, 2016 International Book Awards * AWARD WININNG, Finalist, E-Book Fiction Book of the Year, 2016 Next Generation Indie Book Awards* AWARD WINNING, Finalist, Science Fiction, 2016 Best Book Award Young Adult, Fantasy, High Fantasy, Epic Fantasy, Dystopian, Science Fiction, Action & Adventure, Myth & Legend, Good and Evil, Kindle Book  Nikki and the crew of the Wind Runner battle against Tyr super-soldiers in the seas of the Bermuda Triangle to keep safe their strange and ancient cargo. Nikki is fatally wounded protecting Rogaan and Aren and is plunged into their primeval world reliving Rogaan's and Aren's memories. Wanted as fugitives after escaping the law, Rogaan flees with his best friend Pax and his love, Suhd, traveling the deadly wilds, surviving vicious dinosaurs and battles between demi-gods. They find themselves in the company of the revered Kardul and his rugged band of dinosaur hunters, the Sharur, who offer their skills to rescue the trio's parents from the tyrannical clutches of Shuruppak's law keepers and soldiers. Rogaan finds in Aren a tormented and reluctant ally in his fight for freedom against the unseen hands controlling the law keepers. Failure will see their parents found guilty and condemned to the hellish pits of the Farratum arena, where those who are lucky are torn to shreds for the amusement of the blood thirsty crowd. Will Rogaan, Pax, and Suhd rescue their parent's and evade capture? Will Rogaan and Aren find a way to work together to survive? Will Nikki and the crew of the Wind Runner survive the Tyr super-soldiers and protect their ancient discovery from the hands of despotic forces? Join in the journey of Primeval Origins: Light of Honor as Rogaan and friends battle Shuruppak's powerful forces and malicious dinosaurs as Nikki and crew challenge the growing tyrannical powers now seeking to subjugate our world.Visit the Primeval Origins websites at:www.celestialfurypublsihing.comwww.primevalorigins.comwww.facebook.com/primevalorigins The websites are loaded with news, the Primeval Origins Encyclopedia and Lexicon (all the background elements that you just can't stuff into the books).",
  "genres": [
    "Fantasy",
    "Science Fiction",
    "Young Adult",
    "Epic Fantasy",
    "Christian Fantasy"
  ],
  "author": "B.A. Vonsik",
  "average_rating": "4.50",
  "url": "https://www.goodreads.com/book/show/27862725-light-of-honor"
}