{
  "title": "Britannia's Fist: From Civil War to World War: An Alternate History",
  "description": "Once too often in the War Between the States, Great Britain's support for the Confederacy takes it to the brink of war with the Union. The escape of a British-built Confederate ironclad finally ignites the heap of combustible animosities and national interests. When the U.S. Navy seizes it in British waters, the ensuing battle spirals into all-out war. Napoleon III eagerly joins the British and declares war on the United States. Meanwhile, treason uncoils in the North as the anti-war Democrats, known as Copperheads, plot to overthrow the U.S. government and take the Midwest into the Confederacy. Britannia's fist strikes quickly and hard. Along with the Canadians, the British invade New York and Maine, and the Royal Navy strikes at the South Atlantic Blockading Squadron. The clash at Charleston is history's first great naval battle between ironclads. Meanwhile, a French army marches into Texas from Mexico, and the French Navy attacks the Gulf coast. In the Midwest, the Copperheads rise in revolt to liberate Confederate POWs and arm them with stockpiled weapons. Never has the Republic been in such peril. Britannia's Fist brilliantly describes not just a war of stroke and counterstroke but one in which new technologies--repeating weapons, observation balloons, advances in naval ordnance and armament--become vital factors in the struggle of the young country against the Old World's empires. For one of the great missed stories of the Civil War was not the advance of military technology but its impediment by incompetence, disorganization, and in some serious cases outright refusal to contemplate anything innovative. This is also a war in which the Union finds a \"combat multiplier\" when it organizes history's first national-level intelligence effort. Britannia's Fist is the compelling story of powerful historical personalities who come together as the Union goes into total war mobilization in the fight for its life.",
  "genres": [
    "Alternate History",
    "Historical Fiction",
    "Fiction",
    "Civil War",
    "Science Fiction",
    "Military Fiction"
  ],
  "author": "Peter G. Tsouras",
  "average_rating": "3.93",
  "url": "https://www.goodreads.com/book/show/2785829-britannia-s-fist"
}