{
  "title": "Catalina Blues",
  "description": "Dear Author,“This young crewman of a US Navy “Dumbo” PBY rescue mission has just jumped into the water of Rabaul Harbor to rescue a badly burned Marine pilot who was shot down while bombing the Japanese-held fortress of Rabaul. Since Japanese coastal defense guns were firing at the plane while it was in the water during take-off, this brave young man, after rescuing the pilot, manned his position as machine gunner without taking time to put on his clothes. A hero photographed right after he’d completed his heroic act. Naked.”That is the caption and the story behind the picture taken in 1944 and I figured that alone could make for a really good prompt for Love is an Open Road. I’m being cliché but wouldn’t it be nice to imagine that the naked gunner and the marine pilot; you fill in the blank.Photo Description: A black and white photograph of a dripping-wet, naked gunner standing in a flying boat’s cupola, manning his machine gun. His long crew cut hangs in his face, his headphones protect his ears, and he stares out against his enemy with concentration. Behind him on a small bit of wall is a poster showing silhouettes of Japanese warships. Photographed by Horace Bristol, 1944.This story was written as a part of the M/M Romance Group's \"Love is an Open Road\" event. Group members were asked to write a story prompt inspired by a photo of their choice. Authors of the group selected a photo and prompt that spoke to them and wrote a short story. This story may contain sexually explicit content and is intended for adult readers. It may contain content that is disagreeable or distressing to some readers. The M/M Romance Group strongly recommends that each reader review the General Information section before each story for story tags as well as for content warnings.",
  "genres": [
    "Historical",
    "M M Romance",
    "Romance",
    "LGBT",
    "Military Fiction",
    "Short Stories"
  ],
  "author": "Marlo York",
  "average_rating": "3.07",
  "url": "https://www.goodreads.com/book/show/27859477-catalina-blues"
}