{
  "title": "The Coming of the Prophet",
  "description": "From International Bestselling Author, Saxon Andrew, comes a new series, The Death Prophecies. The first book is The Coming of the Prophet. A strange alien calling himself the Prophet has appeared in orbit above Earth and the planet’s most powerful weapons have proved useless against his ship’s defenses.   To make matters worse, the Prophet tells mankind that Earth will soon be invaded and destroyed if the nations don’t learn how to live in peace and start building to meet the coming enemy. Failure to change humanity’s warlike ways will lead to its destruction.  This Death Prophecy isn’t initially believed but when the Prophet starts sending a series of recordings of planets conquered by the Traugh, mankind is forced to reevaluate how to live together. The Death Prophecy appears to be real and inescapable. Humanity has never been able to live in peace and time is running out. Mankind turns to the only human the Prophet has declared sane but he refuses the role being forced on him. Will he make the difference? First, he has to believe he can. Excerpt: The Coming of the Prophet Col. Brighton looked up at the young officer standing at the door to his office, “Yes, Captain.” “I’ve received word from the head scientists operating the Mount Graham, Lick Observatory, Palomar, and the Hawaii Observatory that they have discovered something they feel we should be aware of. “What is that?” “Something located about three thousand miles above Earth in stationary orbit is blocking the view of stars behind it.” Col. Brighton stared at Captain Connor and his eyes narrowed, “I’m not sure I understand what you’re saying, Captain. Isn’t it impossible for something to remain in stationary orbit without being pulled in by Earth’s gravity?” “Whatever it is, Earth’s gravity is not having any effect on it.” Connor opened a folder and began laying photographic images on the Colonel’s desk. Tony looked at the images and shook his head slightly, “What am I looking for?” Essay took another folder and began placing other photos above each of the ones he first put on the desk, “The top row is what the sky looked like five months ago when the telescopes looked at that place above Earth. The bottom row is the same image taken over the last four months.” Tony looked from the top row to the bottom as he moved across the rows of images. He looked up and said, “There is a black shadow or something that is blocking the stars behind it in the bottom row of images.” Connor nodded. “What could be causing this?” Connor blew out a breath and said, “It’s not a natural phenomenon.” “Why not?” “It doesn’t reflect any light from the planet and it remains pitch black in every image. Something is blocking light from being reflected or coming through it.” “Have they been able to determine its size?” “Six hundred feet long and about a hundred feet wide.” Tony stared at Connor with wide eyes and stared at the two rows of pictures. He picked up the telephone on his desk. He pressed a three-digit code and after a moment started speaking, “Admiral, I have evidence that there is something above the planet that is a possible danger to us.” After a moment, Tony said, “I’ll be there momentarily. I’m bringing the officer that brought this information to me.” Tony hung up and said, “Let’s go.”  Kam stared at his scanner’s images and leaned back in his command chair on the large Traugh Warship as he listened to the exchange.",
  "genres": [],
  "author": "Saxon Andrew",
  "average_rating": "4.38",
  "url": "https://www.goodreads.com/book/show/27862525-the-coming-of-the-prophet"
}