{
  "title": "Codename: Night Witch",
  "description": "EXCERPT (FROM NIGHT WITCH):Sigrid had been trained since childhood for moments exactly like this. She was made to survive. But all her training, all the shouted words of her instructors, abandoned her. She couldn't focus on anything, she couldn't concentrate, and it was going to get her killed. She didn't even see the gully until she tripped and fell into it, rolling down the embankment. But it was enough to shake away the fog. That, and the sound of alarms blaring behind her.Scores of men were emerging from the facility's entrance behind her. Soldiers. A hunting party. Then she heard something barking.Dogs. They had bloody dogs.Glancing back, she saw the search beams and heard their shouts. From somewhere behind her, hidden amongst the trees, an air vehicle was sent aloft. Sigrid glanced skyward. Thunderhawks. She counted three of the heavy gunships rising above the canopy of pines. Two of them rumbled toward her and then past, close enough for her to feel the heat of their thruster wash blast over her.She hadn't even remembered cloaking. It was perhaps the only thing that saved her.The third Thunderhawk stayed back. It hovered above the soldiers, moving with them. Belly-mounted floodlights illuminated the woods, lighting their way. They'd be scanning for her. She could only hide so long. She had to move; she had to stay ahead.Lost, alone and armed only with the stolen knife, Sigrid did the only thing she could. She unthinkable has happened. Sigrid Novak, the most dangerous and wanted person in the history of the Federation of Corporate Enterprises, has been captured. For the women of New Alcyone—women just like her, genetically reengineered and trained since childhood to be the most effective killers in the galaxy—this is a staggering loss. For the Independents, the rebels who captured her, this is a boon beyond measure.If they can figure out how to control her.Now, six years have passed since the events of Bellatrix, and for six years Sigrid Novak has been gone, vanished, with no sign, no word and no trace. But all has not been quiet within the Federation. The Council for Trade and Finance has been murdered, assassinated, and the death toll among the Federation's ruling elite continues to rise.With every corporate enclave that falls, the legend grows. They call her the Night Witch. A champion to some, a nightmare for others. Wherever she goes, death is soon to follow. Then, in an abandoned CTF research facility—and after so many years lost—a woman awakens. Her name is Sigrid Novak. And she is very, very angry.",
  "genres": [
    "Science Fiction",
    "Lesbian",
    "Action",
    "Audiobook",
    "LGBT",
    "Adventure",
    "Fiction"
  ],
  "author": "Cary Caffrey",
  "average_rating": "4.09",
  "url": "https://www.goodreads.com/book/show/27861205-codename"
}