{
  "title": "Sexy Bastards Anthology: A Collection of Bad Boy, Biker and Alpha Romance Stories",
  "description": "A Collection of Bad Boy, Biker and Alpha Romance Stories  Featuring New York Times and USA Today Bestselling Authors. 12 top selling authors bring you 12 never-before-published Hot and Steamy Romance stories  Christine Bell - SWITCHBLADE Michael Blade has always thought of Kaitlin Pepper as the irritatingly prissy girl next door, but when she mistakes him for his twin and shows up at his house wearing only a trench coat and a shaky smile, he starts to reconsider...Bella Wild - BAD BOY BIKERJessie used to think being a parolee psychologist was her way of helping ex-cons get a second chance as they integrated back into society--until she met Jace. He's the angry, inked, biker ex-con who refuses rehabilitation and insists on getting under her skin. Sierra Rose - FORBIDDEN This is the fu---- up version of Romeo and Juliet MC Club style...imagine Juliet a pistol, and Romeo a sexy, bad ass with wicked tats....oh, did I mention there's lots of cursing, leather-clad bikers, motorcycles, and sex? Lexy Timms - BILLIONAIRE BIKERKatie's not your usual rich girl, and Morgan's not your typical biker. Falling for each other is inevitable, but what will happen when their worlds collide? Dale Mayer - SALVATION Beaten. Broken. Finished. An abused wife meets the most unlikeliest of angels - a man who looks like the very devil himself. He won't let her give up. Nor will he let her go. Will he be yet another captor or will he become her salvation?Lisa Ladew - THE BIKER'S SECRET TORMENTHe'd loved her for as long as he could remember, but he would never pursue her, because he alone knew he was responsible for the one thing she would never forgive anyone for. When she starts to pursue him though, he doesn't think he can keep his distance.Cassie Alexandra - TAMING THE BIKER After a short fling with hell-raising womanizer, Taylor (Tail) Adams, Lauren Macey discovers that she’s pregnant with the biker’s child. Knowing that the MC lifestyle isn’t what she wants for their baby, and that Tail isn’t exactly ‘father’ material, Lauren decides not to tell him. This proves challenging, especially when she realizes that he isn’t ready to end their affair… Tasha Lyons - BIKER BLUES BABY Morgan and Jazz have dealt with most of the horrific problems that plagued their fledging relationship, at least they hope so. But just as one horrific set of troubles falls away, another interesting one comes into play. Will they survive this one too? C.J. Pinard - ANTIHERO Can a street punk on the wrong path be transformed into a Special Forces killing machine? Once he’s been “rehabilitated”, Ellis Anderson is determined to show the woman he loves that he's nothing like both the lives he's left behind. But actions speak louder than words – and he has a lot of work ahead of him. C.C. Cartwright - JUST LOVE ME Justin can't get Sloane out of his head. He pushes her away for being his little sister's best friend, but now that she's filled out in all the right places, will he be able to resist the innocent, yet enticing woman she has become? Bella Love-Wins - DOG Kane is now top dog in the Rugged Angels MC, and has slept with half the eligible biker chicks in Tucson. He meets his match when Kim, daughter of his club's former president, just won't give in to his usual tricks. Kylie Walker - INDECENT DESIRES District Attorney Eric Steel is used to getting his way, and when he meets the new intern hired for his team, he wants her: preferably stripped",
  "genres": [],
  "author": "Christine  Bell",
  "average_rating": "4.32",
  "url": "https://www.goodreads.com/book/show/27860140-sexy-bastards-anthology"
}