{
  "title": "The Theseus Paradox",
  "description": "What if everything you thought you knew about London's 7/7 bombings was a lie?  July 2005: In the midst of Operation Theseus, the largest police investigation that the UK has ever known, Detective Inspector Jake Flannagan begins to ask difficult questions that lead to the mysterious disappearance of his girlfriend and his sudden suspension from the Metropolitan Police.  Who masterminded London's summer of terror? Why can’t Flannagan make headway in the sprawling investigation? Is Jake’s absent girlfriend really who she claims to be?  While hunting for the answers to the most complex terrorist case in British history, one man will uncover the greatest criminal deception of our time.  Terror, extremism and fear of the unknown, Sometimes the answer is much closer to home.  The author, David Videcette, is a former Scotland Yard Detective who has worked on a wealth of infamous cases, including the July 2005 London bombings. He has twenty years of policing and investigative experience, specialising in counter-terror operations and organised crime. He currently consults on security operations for high-net-worth individuals and is an expert media commentator on crime, terrorism, extremism and the London bombings. David says, ‘I can’t tell you the truth, but I can tell you a story…’  'A chillingly credible tale based on real events.'  'A five-star, explosive finale.'  'Leaves the reader hungry to research this version of events!'  'This fictional theory holds a lot of water - do not miss!'  'Astoundingly accomplished and pacey. If anyone has the background and understanding to pull this off, it is David Videcette. His experience and know-how shine through on every page without it ever slowing the pace of the drama. And the scenario he paints is a vivid and realistic one. Possibly too realistic!'  'A very exciting proposition. The concept behind this book will make headlines.'  'The desire to find out the truth will drive interest alone. Strong stuff.'  'I adored the lead character, DI Jake Flannagan. He is one of a kind. I would class this novel in the same arena as the blockbusting best seller ‘Bravo Two Zero’ by Andy McNab – but for the fact that ‘The Theseus Paradox’ is far better written!'  'We’re into the action immediately and there’s a great sense of authenticity and control in David’s storytelling. The plot revelations in this book are all too possible; the whole tale is just far too chillingly credible.'  'Finished this at 6.00am this morning having thoroughly enjoyed it! Eloquent and adeptly argued; the narrative flowed well throughout the various ups and downs and dead-ends - towards an utterly thrilling conclusion. It leaves the reader hungry to research whether they believe this version of events!'  'An incredible 'big reveal' at the end. Stunning dialogue that has that rare ring of authenticity to it. This is a premise really worth hearing about.'  'A stunning, mind-bending finale. A powerhouse of a fact-fiction mash-up.'  'Brilliant stuff that smacks you in the face!'  'The Theseus Paradox' is proud to support the Police Dependants' Trust.",
  "genres": [
    "Thriller",
    "Fiction",
    "Crime",
    "Suspense",
    "Mystery",
    "Terrorism"
  ],
  "author": "David Videcette",
  "average_rating": "4.01",
  "url": "https://www.goodreads.com/book/show/27873220-the-theseus-paradox"
}