{
  "title": "The Alien's Pet",
  "description": "When an injured stranger breaks into her small-town veterinary clinic late at night and demands that she assist in treating his wounds, Serena Spiers knows right away that something is amiss. Though he is undoubtedly handsome, the intruder’s oddly colored eyes and extraordinary height leave no doubt in her mind that he is not of this world.  Seeking to escape her predicament, she treats his wounds and then does her best to discretely sedate him, but a tranquilizer shot proves far less effective than she had hoped. Her captor is none too pleased by her attempt at subterfuge, and before she knows it Serena is blushing crimson as she is held firmly across his muscular thighs, completely naked, while her bare bottom is soundly spanked.  Serena’s ordeal is just beginning, however. It turns out that her alien visitor is a high-ranking commander among his people, and when he realizes that the discovery of her encounter with him could put Serena in grave danger, he takes it upon himself to ensure her safety by bringing her along as he leaves Earth behind. But his people have very specific rules about transporting primitive species aboard their ships, and she will not be treated as his guest or even as his prisoner, but as his pet.  She will be expected to submit to him completely, and any defiance will earn her a painful, humiliating punishment. Yet despite her fury at the indignity of it all, Serena cannot help reacting with shameful, helpless arousal as she is stripped bare, thoroughly examined, and then claimed in any way her new master pleases, sometimes in full view of the ship’s crew. Can she learn to yield to the pleasure that results from his conquest of her body, or will she spend the entire voyage with her bottom sore both inside and out?  Publisher’s Note: The Alien’s Pet is an erotic romance novel that contains spankings, sexual scenes, pet play, medical play, anal play, exhibitionism, elements of BDSM, and more. If such material offends you, please don’t buy this book.",
  "genres": [
    "Erotica",
    "BDSM",
    "Aliens",
    "Science Fiction",
    "Science Fiction Romance",
    "Paranormal Romance",
    "M F Romance"
  ],
  "author": "Loki Renard",
  "average_rating": "3.67",
  "url": "https://www.goodreads.com/book/show/27868387-the-alien-s-pet"
}