{
  "title": "Three Days to Die",
  "description": "HE DIDN'T MEAN TO OVERHEAR ... but he did.HE ONLY HEARD A FEW WORDS ... but he heard too much.HE RAN ... but he was followed -- a mistake that would turn thirteen-year-old Aaron Quinn's, and his beautiful, courageous, single mother, Ashley's, worlds upside down.THE CLOCK STARTS TICKING ... when Aaron is stolen from his mother by a psychotic killer and thrust headlong into a dark underworld of armed robbery, prostitution, and death. Will Aaron lose his mind as he's forced to participate in a deadly crime spree and witness first hand the horror of cold-blooded murder?THE WALLS CLOSE IN ... on Ashley when she listens to a tape recording left on her pillow by the killer, giving her two choices:1) Call the police and risk being responsible for her only child's death ...2) Offer herself as a sacrifice in exchange for his life ...WHAT WOULD YOU DO IF YOU WERE HER?---A CRIME THRILLERAn ACTION MOVIEA LOVE STORYIn THREE DAYS to DIE, debut author John Avery takes you on a perilous journey unlike any suspense thriller you've read before.From the opening sequence to the smashing ending, THREE DAYS to DIE moves at lightning speed, introducing the world to an exciting new hero, a beautiful and plucky heroine, and a truly frightening villain.\"John Avery opens Three Days to Die with a bang and then sprints toward the finish line ... taking thriller lovers of any age on a heart-pounding, pulse- tingling ride, and he does it with style. Five Stars!\" – Jill Allen, Foreword Review\"I truly got lost between the pages of this wonderfully told story - though I did cringe and even cry sometimes and wanted to hit someone at other times, which is totally against my nature. It just goes to show how totally absorbed I was in the world John Avery created in Three Days to Die.\" - N. Budden - Amazon Top Reviewer---*** Adapted from the original screenplay, THREE DAYS to DIE, by John Avery - Shortlisted for Hollywood's prestigious 2010 - PAGE International Screenwriting Awards ***Approx 225 pagesRecommended for adults 16+",
  "genres": [
    "Thriller",
    "Mystery",
    "Crime",
    "Fiction",
    "Suspense",
    "Mystery Thriller",
    "Amazon"
  ],
  "author": "John  Avery",
  "average_rating": "3.51",
  "url": "https://www.goodreads.com/book/show/11760588-three-days-to-die"
}