{
  "title": "The Thirteenth Hour",
  "description": "“The ancient clock in the Land of Dreams struck thirteen, and the dreams, now free, soared back to Earth under first vesper’s light …\" And so begins “The Thirteenth Hour,” a tale about dreams and wishes, wild hearts and childhood promises, and the quest to find the unsung hero that lies in all of us. When a young boy falls asleep during school one day, he is transported into a fantasy world of wizards, dragons, quests, and the tale of Logan, who has come of age and must leave his sleepy village to be a soldier in King Darian IV's Imperial Army. Although he finds himself immediately at odds with military life, Logan’s tour is surprisingly extended when he is picked by the King’s wizards to be specially trained as an Imperial Ranger for a mysterious quest to find the secret to eternal life, catapulting him into an epic adventure he had previously only thought possible in books, daydreams, and fairy tales. Combining the adventure of “The Princess Bride,” the irreverent humor of “The Hitchhiker's Guide to The Galaxy,” and the feel of 1980s science fiction and fantasy films such as “The Neverending Story” and “Labyrinth” with a healthy dose of introspection surrounding the journey teens experience on the way to becoming adults, “The Thirteenth Hour” is part adventure yarn, part fairy tale, and part introspective narrative that can be enjoyed by both teenagers and teens in remission. “The Thirteenth Hour” contains over 35 illustrations, music written specifically for the story, and rich world both on and off-line that was sixteen years in the making. Check it out today, and let the adventure of “The Thirteenth Hour” become your story! Continue the quest here: •\tWebsite: http://13thhr.wordpress.com •\tBook trailer: https://www.youtube.com/watch?v=hpcIU...",
  "genres": [
    "Fantasy",
    "Young Adult"
  ],
  "author": "Joshua Blum",
  "average_rating": "3.96",
  "url": "https://www.goodreads.com/book/show/27867510-the-thirteenth-hour"
}