{
  "title": "Cooking for Picasso",
  "description": "For readers of Paula McLain, Nancy Horan, and Melanie Benjamin, this captivating novel is inspired by a little-known interlude in the artist’s life. The French Riviera, spring 1936: It’s off-season in the lovely seaside village of Juan-les-Pins, where seventeen-year-old Ondine cooks with her mother in the kitchen of their family-owned Café Paradis. A mysterious new patron who’s slipped out of Paris and is traveling under a different name has made an unusual request—to have his lunch served to him at the nearby villa he’s secretly rented, where he wishes to remain incognito. Pablo Picasso is at a momentous crossroads in his personal and professional life—and for him, art and women are always entwined. The spirited Ondine, chafing under her family’s authority and nursing a broken heart, is just beginning to discover her own talents and appetites. Her encounter with Picasso will continue to affect her life for many decades onward, as the great artist and the talented young chef each pursue their own passions and destiny. New York, present day: Céline, a Hollywood makeup artist who’s come home for the holidays, learns from her mother, Julie, that Grandmother Ondine once cooked for Picasso. Prompted by her mother’s enigmatic stories and the hint of more family secrets yet to be uncovered, Céline carries out Julie’s wishes and embarks on a voyage to the very town where Ondine and Picasso first met. In the lush, heady atmosphere of the Côte d’Azur, and with the help of several eccentric fellow guests attending a rigorous cooking class at her hotel, Céline discovers truths about art, culture, cuisine, and love that enable her to embrace her own future. Featuring an array of both fictional characters and the French Riviera’s most famous historical residents, set against the breathtaking scenery of the South of France, Cooking for Picasso is a touching, delectable, and wise story, illuminating the powers of trust, money, art, and creativity in the choices that men and women make, as they seek a path toward love, success, and joie de vivre.",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Book Club",
    "Art",
    "France",
    "Romance",
    "Mystery"
  ],
  "author": "Camille Aubray",
  "average_rating": "3.88",
  "url": "https://www.goodreads.com/book/show/27876293-cooking-for-picasso"
}