{
  "title": "The Art of Rivalry: Four Friendships, Betrayals, and Breakthroughs in Modern Art",
  "description": "Pulitzer Prize–winning art critic Sebastian Smee tells the fascinating story of four pairs of artists—Manet and Degas, Picasso and Matisse, Pollock and de Kooning, Freud and Bacon—whose fraught, competitive friendships spurred them to new creative heights. Rivalry is at the heart of some of the most famous and fruitful relationships in history. The Art of Rivalry follows eight celebrated artists, each linked to a counterpart by friendship, admiration, envy, and ambition. All eight are household names today. But to achieve what they did, each needed the influence of a contemporary—one who was equally ambitious but possessed sharply contrasting strengths and weaknesses. Edouard Manet and Edgar Degas were close associates whose personal bond frayed after Degas painted a portrait of Manet and his wife. Henri Matisse and Pablo Picasso swapped paintings, ideas, and influences as they jostled for the support of collectors like Leo and Gertrude Stein and vied for the leadership of a new avant-garde. Jackson Pollock’s uninhibited style of “action painting” triggered a breakthrough in the work of his older rival, Willem de Kooning. After Pollock’s sudden death in a car crash, de Kooning assumed Pollock's mantle and became romantically involved with his late friend’s mistress. Lucian Freud and Francis Bacon met in the early 1950s, when Bacon was being hailed as Britain’s most exciting new painter and Freud was working in relative obscurity. Their intense but asymmetrical friendship came to a head when Freud painted a portrait of Bacon, which was later stolen. Each of these relationships culminated in an early flashpoint, a rupture in a budding intimacy that was both a betrayal and a trigger for great innovation. Writing with the same exuberant wit and psychological insight that earned him a Pulitzer Prize for art criticism, Sebastian Smee explores here the way that coming into one’s own as an artist—finding one’s voice—almost always involves willfully breaking away from some intimate’s expectations of who you are or ought to be.Praise for The Art of Rivalry“Gripping . . . Mr. Smee’s skills as a critic are evident throughout. He is persuasive and vivid. . . . You leave this book both nourished and hungry for more about the art, its creators and patrons, and the relationships that seed the ground for moments spent at the canvas.”—The New York Times“With novella-like detail and incisiveness [Sebastian Smee] opens up the worlds of four pairs of renowned artists. . . . Each of his portraits is a biographical gem. . . . The Art of Rivalry is a pure, informative delight, written with canny authority.”—The Boston Globe",
  "genres": [
    "Art",
    "Nonfiction",
    "History",
    "Biography",
    "Art History",
    "Book Club",
    "Historical"
  ],
  "author": "Sebastian Smee",
  "average_rating": "3.93",
  "url": "https://www.goodreads.com/book/show/27876332-the-art-of-rivalry"
}