{
  "title": "Dave Dashaway The Young Aviator or, in the Clouds for Fame and Fortune",
  "description": "CHAPTER IDAVE DASHAWAY’S MODEL“You don’t mean to say that new-fangled air ship of yours will fly, Dave Dashaway?”“No, it’s only a model, as you see.”“Would the real one go up, though?”“It might. I hope so. But this is a start, anyway.”“Yes, and a fine one,” said Ned Towner, enthusiastically. “You’re a smart boy, Dave, and everybody says so.”“I wish my dear old father was living,” remarked Dave in a tone of sadness and regret. “There wasn’t much about sky sailing he didn’t know. In these times, when everybody is so interested in airships, he would be bound to make his mark.”The two, manly-appearing youths stood in the loft of the dilapidated old barn of Silas Warner’s place in Brookville. It held a work bench and some tools, and on one end of the bench was the model at which they were looking.It was neat enough and intricate enough, being made by a mere lad, to have attracted the attention of any inventor or workman. An outsider, however, would have been puzzled, for while its shape suggested a bird kite with an umbrella top, it had so many rods, joints and levers that a casual observer would have wondered what they were all there for.Dave showed a good deal of pride in his model. It had cost him all his loose change to buy the material to construct it, and many a busy hour during the preceding few weeks. He sighed as he turned from it, with the “All I need now is some silk to cover those wings. That finishes it.”“Then what will you do?”“Well,” replied Dave vaguely, “then I hope I can find some practical airship man who will tell me if it’s any good.”“Say, it will be a fortune if it works, won’t it, Dave?” exclaimed Ned.“Oh, hardly that. They are getting up so many new kinds all of the time. It would get me into the swim, though. All I want is to have a chance to make the acquaintance of some expert airman. I reckon the flying fever was born in me, Ned.”“Well, that’s quite natural,” responded Ned. “Your father must have been famous in his line, according to all those scrap-book articles you showed me the other day.”“Anyhow, I’m getting tired of the dull life I’m leading here,” went on Dave seriously. “I’d like to do something besides slave for a man who drives me to the limit, and amount to something in the world.”“Good for you!” cried Ned, giving his friend and chum an encouraging slap on the back. “You’ll get there—you’re the kind of a boy that always does.”“Hey, there! are you ever going to start?” rang out a harsh, complaining voice in the yard outside.Dave hurriedly threw an old horse blanket over his model and glanced out of the window.“It’s Mr. Warner,” he said, while Ned made a wry face. “I’ll have to be going.”Old Silas Warner stood switching his cane around and growling out threats, as Dave reached the yard and crossed it to where a thin bony horse and an old rickety wagon stood. The vehicle held a dozen bags filled with potatoes, every one of which Dave had planted and dug as his hardened hands bore proof.“You’ll quit wasting my time, Dave Dashaway,” carped the mean-faced old man, “or there’s going to be trouble.”“I was just showing Ned about the loft,” explained Dave.“Yah! Fine lot of more valuable time you’ve been wasting there, too,” snorted old Warner. “I’ll put a stop to some of it, you mark me. Now then, you get those bags of taters down to Swain’s warehouse and back again afore six o’clock, or you’ll get no supper. There’s a lot more of those taters to dig, but an hour or two this evening will finish them.”",
  "genres": [
    "Middle Grade"
  ],
  "author": "Roy Rockwood",
  "average_rating": "3.60",
  "url": "https://www.goodreads.com/book/show/27873856-dave-dashaway-the-young-aviator-or-in-the-clouds-for-fame-and-fortune"
}