{
  "title": "A Fistful of Love",
  "description": "English 212Back of the BookA man was sitting with his friends in a local inn. After a couple of drinks, he asked his friends, `Do. You love me?\" \"Of course, we do,\" they replied. \"So do you know what I need?\" No one answered. If you don't know what I need then how can you say you love me?\" To love and to be loved is the most basic human need. No wonder we are attracted to people who give us attention, care about us, and love us. Yet, love also remains the greatest challenge in most relationships. Why? A Fistful of Love is a collection of insightful, thought-provoking nuggets of wisdom appreciated by millions around the world. This book is full of humour and narratives most beautifully woven into 'earnings of life that will make you stop and think. About the Author Om Swami is a mystic living in the Himalayan foothills. He has a bachelors degree in business and an MBA from Sydney, Australia. Prior to his renunciation of this world, he founded and ran a multimillion dollar software company successfully. He is the bestselling author of The Ancient Science of Mantras, An Untold Story, A Million Thoughts and if truth be told A monks Memoir. Foreword Once upon a time, Buddha was walking along a riverside with nine of his disciples. In his quiet and graceful manner, the sage was talking to Ananda about mindfulness when suddenly almost all the monks stopped in their tracks and looked the other way, across the river, in great awe. A yogi was crossing the waters and coming towards them. Ordinarily, this would not have been a distracting sight. Especially, considering that Buddha was delivering a sermon on mindfulness. This yogi, however, was not crossing the river in a boat; he wasn't even swimming across; he was simply walking on water.",
  "genres": [
    "Nonfiction",
    "Philosophy",
    "Spirituality",
    "Self Help",
    "Indian Literature",
    "Relationships"
  ],
  "author": "Om Swami",
  "average_rating": "4.53",
  "url": "https://www.goodreads.com/book/show/27877963-a-fistful-of-love"
}