{
  "title": "Saying Yes",
  "description": "Walking into a private sex club shouldn’t have been so hard for a Ph.D’d sex therapist, but it was. Eliza Swift was trained to understand the human sexual condition, but it didn’t translate into her own life. Challenged by a patient that her knowledge of what constitutes mild to deviant behavior is only based on books, has her second guessing her personal and professional life.The Raven’s Nest is a high-end sex club where desires are lived out and identities are kept safe. Intrigued and eager to learn the hidden secrets of the club, Eliza begs the only man she knows with the sexual appetite, privilege and power to take her, Nick Slade. Her playboy best friend and the only constant in her life.Nick’s very protective of the woman who’s owned his heart for as long as he can remember. Initially reluctant to bring Eliza into his secret world, Nick takes the chance to prove he’s more than a friend, hoping to show her a different side of his sexuality while expanding hers. What he doesn’t anticipate is how captivated everyone at The Ravens Nest becomes with the stunning brunette, whose shy demeanor entices them to draw her out. No person more than, Lake Mitchell, the billionaire club owner who rarely steps into the seductive world but finds himself fascinated by the gorgeous woman who’s clearly out of place.Never more intrigued, Lake steps into her private world as a patient to obtain her. Eliza is enamored by his passionate declarations of obsession and the need to “claim” someone so thoroughly. Her attraction alone has her nervous, but his subtle flirtations make her question whether she can continue to treat him as a patient. Their connection is instant, unlike any other she’s ever encountered, but she has never crossed the lines of professionalism for any man and won’t start now. Her resistance is strong, but his charm is stronger. She surrenders to his will, his yearning and sexual lessons, but Lake learns the lessons are really his. Eliza may be giving her body, but her heart is off-limits. With Nick vying for more than friendship and Lake’s past threatening to destroy his future with Eliza, he pulls out every stop to win her love.In the end, Eliza learns there’s more to the human sexual condition than what she learned in books. If she wants a real chance at love, she’ll have to take a leap of faith and play to win with the most dominant man she’s ever encountered…saying yes to everything.",
  "genres": [
    "M F Romance",
    "Erotica",
    "Drama",
    "Contemporary"
  ],
  "author": "Heather M. Miles",
  "average_rating": "4.33",
  "url": "https://www.goodreads.com/book/show/27886148-saying-yes"
}