{
  "title": "The PureLights of Ohm Totem",
  "description": "This is an alternate Cover Edition for ASIN: B00BLMYDDQ.\"Two children from a forgotten land, ancestors of the Island of Ohm Totem, one being of the night walkers and the other of the sacred heart, will purify the energies, bring back the old ways, and unite the PureLights once again, putting an end to the coming Shiver.\"~ Windstorm ProphecyZoey and Coda are like everyone else in their small town of Gladstone, but that's about to change - forever.Zoey has a dream, one that feels far more real than it should. A strange wolf with a beautiful, violet crystal embedded in his forehead visits her. \"Please help us,\" the wolf implores with sad eyes. \"Remember, Zoey, who you truly are.\" Zoey wakes up, dismissing it as a silly dream. However, she soon realizes that it was far more real than she could've ever imagined. Coda is Zoey's older brother. Like many boys his age, he has a craving for adventure and a loathing for his younger sister. He can't stand it that she constantly gets in his way, joining in on all his fun, and ruining it in the process. The worst, according to Coda, is that Zoey gets all the attention from their parents. A big drag in his mind.Then destiny arrives, one that Zoey and Coda must face together - if they want to survive.Together, they journey to a place deep in the Cornell Forest, beyond the Snow Tree, through a patch of blackberry bushes concealing a secret portal that leads them to an ancient world called Ohm Totem - to the place of the PureLights, the race beckoning for their help. There, Zoey and Coda discover something so unique, so magical, and so sacred within themselves, that even those who called for them could not have known how powerful these two children really are. Caught between an age old war and finding their way back home, Zoey and Coda go on an amazing adventure, taking them beyond the veils of everything they once knew, and into the terrifying grasp of the unknown.With the storytelling creativity of authors like C.S. Lewis of the Chronicles of Narnia and the writing acumen of Erin Hunter of the Warriors and Seekers series, Omon Hart offers a captivating novel showcasing his skill and ingenuity as a storyteller. He's an author to watch.The PureLights of Ohm Totem is Book I of an ongoing series. Book II, The PureLights & the PureLight Order, is soon to arrive on Amazon.",
  "genres": [
    "Fantasy",
    "Fiction",
    "Amazon",
    "Young Adult",
    "Young Adult Fantasy"
  ],
  "author": "Brandon Ellis",
  "average_rating": "3.92",
  "url": "https://www.goodreads.com/book/show/27882052-the-purelights-of-ohm-totem"
}