{
  "title": "Valentine Pets & Kisses: Fourteen Sweet Romances",
  "description": "FOURTEEN ALL-NEW, SWEET VALENTINE ROMANCESCandy and canines. Flowers and felines. Celebrate this Valentine's Day with your sweethearts of the human and fuzzy varieties! Nothing is more heart-warming than kisses from the pet who adores you and the man who loves you, so snuggle up with VALENTINE PETS & KISSES -- an anthology of fourteen sweet romances from USA Today bestselling and award-winning authors -- and strike the perfect mood for moonlit walks and candlelight dinners with your pet and sweetheart.Valentine Hound Dog - Rachelle AyalaA fashion designer and her basset hound puppy convince a burned ex-firefighter that beauty is never skin deep and neither is love.The Crazy Girl’s Handbook - DelSheree GladdenWatching her nephews was supposed to be a fun and relaxing weekend for Greenly, not a never ending disaster all witnessed by the best blind date she ever stood up. The Vet's Valentine Gift - J.L. CampbellA veterinarian is caught between his job, an ex, a menagerie and love. Can a little Cupid fix things by Valentine’s Day?Her Perfect Catch - K.L. BradyYears of faithful dog-sitting pays sweet dividends when a struggling sports writer scores tickets to the Super Bowl and encounters her favorite football player.Inflamed - Jade KerrionA firefighter running from his past convinces a hard-luck single mother to believe in happy endings.Remember When - Hope Welsh\tLaura and Brent really tried to make their marriage work, but in the end, it just wasn't meant to be--or was it?Your Biggest Fan? - Sydney Aaliyah MichelleSnowed in with the man of her dreams, a football fan and her dog find love.The Feline Fix - Caroline Bell FosterA scientist questions her cat’s loyalty when it comes to love and a hunky policeman.Trembling Hearts - Suzette RiddickA daring young woman crashes into the life of a disfigured recluse and his pooch. Can love be far behind?Valentino, Be Mine - Tina D.C. HayesSparks fly when two people who can't stand each other wind up dog-sitting a rambunctious little Yorkie that needs a new home. Lost and Found - Jeanne BannonStuck with her ex’s puppy, a young teacher meets a new man after a series of unfortunate events. Surviving San Francisco - Susan OloierA small town girl survives San Francisco after she hits a cat and falls for a handsome veterinarian.19 Ivy Lane - Aubrey WynneA mysterious woman and her cat befriend a postman and set tongues wagging on Ivy Lane. But when he delivers a long-awaited letter, will his heart be “returned to sender?”Three Plus Three - Cindy Flores MartinezA grieving widow and her beloved doggie meet a handsome widower the day before Valentine’s Day.",
  "genres": [],
  "author": "Rachelle Ayala",
  "average_rating": "4.31",
  "url": "https://www.goodreads.com/book/show/27887192-valentine-pets-kisses"
}