{
  "title": "Angel of Song",
  "description": "** Winner of the Bronze Medal for Modern Historical Literature Fiction in the 2016 Global Ebook Awards** Angel of Song is a romantic historical fiction novel set in the Great War:Born into the halcyon era of the Belle Époque, Parisian debutante Angelique de Villefontaine has been shielded all her young life by her influential guardian, the marquis du Bois; and his life-long companion, Madame Dupont. Despite the protection of her mentors, the allure of her ethereal beauty and surpassing talent cannot be restrained, and Angelique's life becomes a frenetic whirl of performance and social engagement, peppered with the seduction of fame and adulation. Though she has a voice of an angel, she is not without her demons.Unbeknownst to Angelique, her guardian is frantically attempting to bring the antiquated French Military into the twentieth century. Acutely aware of growing political tensions and paranoia sweeping Europe, the marquis' efforts are rebuffed. Despairing, he sends his protégé on a mission hitherto unthinkable. Oblivious to this seething political clime, Angelique embarks on the most important tour of her budding career, only to be turned back by a murder that plunges the world into darkness.Rendered hysterical by the horrors of war, Angelique rallies to help the wounded. Amidst rumours of an angel whose voice can inspire, soothe and heal, an eminent general makes an astonishing request. And the marquis must use all his ingenuity to protect his ward from enemies, both within their own military and without.In the particular hell of the trenches, soldiers sacrifice their lives to hold their posts against insurmountable odds; and as the French search for inspiration to counter the nihilistic policy of an implacable enemy, they find they already have a secret weapon—their own Angel of Song.",
  "genres": [
    "Romance",
    "Historical Fiction",
    "War",
    "World War I",
    "Love Inspired Historical",
    "Historical Romance"
  ],
  "author": "Anne Rouen",
  "average_rating": "4.38",
  "url": "https://www.goodreads.com/book/show/27887280-angel-of-song"
}