{
  "title": "The Antidote: Healing America From the Poison of Hate, Blame and Victimhood",
  "description": "For a half century or more, black people have labored under the spell of what Jesse Lee Peterson calls the “alchemists.” These are the race hustlers, media hacks, politicians, community organizers and the like who promise to “fundamentally transform” America. The transformation they promise, however, produces only fool’s gold—unearned benefits like welfare, food stamps, subsidized housing, payouts from lawsuits, and maybe one day even reparations. Worse, to secure these counterfeit goods, recipients have to sacrifice something of infinite the sanctity of the two-parent family. It is a devil’s bargain. To make this experiment work, the alchemists have created an ungodly and unhealthy environment, one in which the white population is made to feel guilty and the black population made to feel angry. The pattern in this is children—black or white—when deprived of fathers, grow up angry at their parents. White children displace their anger in a thousand different directions. Black children channel theirs, for the most part, in a single destructive direction—towards and against white people. The alchemists encourage them to do this, enable them, and even reward them. This anger fuels the system and pays the alchemists’ bills. As bleak as this all sounds, an antidote exists, which saved Peterson’s life, that of his son, and those of countless young men who have been counseled at Peterson’s organization, BOND. The perverse genius of liberalism has been its ability to capture black anger and project it outwards towards anyone, black or white, who resists the Democratic agenda. By encouraging a resentful dependency, liberals have instituted a new kind of slavery in the black community as emotionally shackling as the physical slavery that first brought Africans to America. Peterson knows this story from the inside as few other people do. Born on an Alabama plantation, he was abandoned by his father before he was born. After high school, Peterson moved to Los Angeles and for the next twenty years moved purposelessly through life, channeling his internal anger outwards towards white people and America in general. In the mission he has undertaken since, and in this hopeful book, Peterson shares what he learned on his personal road to Damascus.",
  "genres": [
    "Nonfiction",
    "Politics"
  ],
  "author": "Jesse Lee Peterson",
  "average_rating": "4.23",
  "url": "https://www.goodreads.com/book/show/27888018-the-antidote"
}