{
  "title": "Cartucho: Relatos de la lucha en el norte de México",
  "description": "Marginado por villista, por ser de una mujer, por salirse del canon, Cartucho, Relatos de la lucha en el Norte de México es uno de los grandes textos de la literatura mexicana. Como señala Jorge Aguilar Mora en su prólogo a este libro, Cartucho esta en todos los vértices críticos de nuestro discurso histórico-literario: es quizás el libro más extraordinario, donde se funden la singularidad autobiográfica, el anonimato popular, la relación histórica, la transparencia literaria, la crónica familiar. Como ningún otro escritor de la revolución, Campobello se aproximó al acontecimiento pasajero, instantáneo, aparentemente insignificante, pero profundamente revelador. Ella no describió las batallas, ni las posiciones políticas; no rescató los testimonios extensos de los guerreros. Ella fue a su memoria para perpetuar los instantes más olvidables para otros y más intensos para quienes los vivieron. Ella escribió de lo sucedido en una tarde tranquila, borrada en la historia de la Revolución ; escribió de los momentos literalmente originales de la historia y de personajes únicos como Pablo López, como Catarino Acosta, como José Díaz, como Pancho Villa, un hombre que nació en 1910 , ya que antes nunca existió. Nellie Campobello escribió la crónica de lo que casi nadie quería, ni ha querido escribir: del periodo entre 1916 y 1920 en el estado de Chihuahua, que los historiadores coinciden en llamar la etapa más cruel que vivió Chihuahua durante la revolución y uno de los periodos más oscuros de toda su historia. El hallazgo iluminador de Campobello fue hundir la historia -la macrohistoria- en las minucias, en los rincones, en la anonimia, en los sobreentendidos, en los recintos más diminutos de la voluntad de los hacedores de esa historia. No hay detalle aquí que no tenga un sentido totalizador, no hay instante que no sea la grieta finísima por donde entra la eternidad. Este volumen contiene tambien, una cronología de la vida de la autora, que recoge los últimos datos disponibles, y una bibliografía actualizada.",
  "genres": [
    "Spanish Literature",
    "Short Stories",
    "Fiction",
    "Historical Fiction",
    "Womens",
    "School",
    "Historical"
  ],
  "author": "Nellie Campobello",
  "average_rating": "4.05",
  "url": "https://www.goodreads.com/book/show/1176395.Cartucho"
}