{
  "title": "American Indian Policy in the Twentieth Century",
  "description": "Until now, books about American Indian Policy have dealt with laws and acts long since adopted and in effect. In American Indian Policy in the Twentieth Century, edited by Vine Deloria, Jr., a group of writers deals with present realities and future possibilities, taking the lead in encouraging discussion and further research into areas of concern to American Indians. Against the background of the larger field of Indian affairs, these authors suggest new ways of thinking about specific Joyotpaul Chaudhuri ― \"American Indian An Overview\" Sharon O'Brien ― \"Federal Indian Policies and the International Protection of Human Rights\" Fred L. Ragsdale, Jr. ― \"The Deception of Geography\" Michael Lacy ― \"The United States and American Political Relations\" Daniel McCool ― \"Indian Voting\" Tom Holm ― \"The Crisis in Tribal Government\" David L. Vinje ― \"Cultural Values and Economic Development on Reservations\" Robert A. Nelson and Joseph F. Sheley ― \"BIA Influence on Indian Self-Determination\" Mary Wallace ― \"The Supreme Court and Indian Water Rights\" John Petoskey ― \"Indians and the First Amendment\" Vine Deloria, Jr. ― \"The Evolution of Federal Indian Policy Making\" The articles treat both historical problems and current issues that must be confronted if Indians are to move forward to stabilize their communities and protect their rights and resources. In part speculative, the book defines many of the factors that bear on the formation of policies at the federal level, and it discusses new institutions and legislation that can assist American Indians, enabling tribal members and other individuals to better understand their present status and draw reasonable conclusions about their future. This book will be of interest in several fields of study. History and law classes, short courses on Indian affairs, tribal governments and training programs, and state agencies that deal with Indians will find it of benefit, as well as the general reader interested in the welfare and future of American Indians.",
  "genres": [
    "Native American",
    "American History",
    "Nonfiction",
    "Law"
  ],
  "author": "Vine Deloria Jr.",
  "average_rating": "3.97",
  "url": "https://www.goodreads.com/book/show/279125.American_Indian_Policy_in_the_Twentieth_Century"
}