{
  "title": "The Bad-Ass Librarians of Timbuktu: And Their Race to Save the World's Most Precious Manuscripts",
  "description": "To save precious centuries-old Arabic texts from Al Qaeda, a band of librarians in Timbuktu pulls off a brazen heist worthy of Ocean’s Eleven.In the 1980s, a young adventurer and collector for a government library, Abdel Kader Haidara, journeyed across the Sahara Desert and along the Niger River, tracking down and salvaging tens of thousands of ancient Islamic and secular manuscripts that had fallen into obscurity. The Bad-Ass Librarians of Timbuktu tells the incredible story of how Haidara, a mild-mannered archivist and historian from the legendary city of Timbuktu, later became one of the world’s greatest and most brazen smugglers.In 2012, thousands of Al Qaeda militants from northwest Africa seized control of most of Mali, including Timbuktu. They imposed Sharia law, chopped off the hands of accused thieves, stoned to death unmarried couples, and threatened to destroy the great manuscripts. As the militants tightened their control over Timbuktu, Haidara organized a dangerous operation to sneak all 350,000 volumes out of the city to the safety of southern Mali.Over the past twenty years, journalist Joshua Hammer visited Timbuktu numerous times and is uniquely qualified to tell the story of Haidara’s heroic and ultimately successful effort to outwit Al Qaeda and preserve Mali’s—and the world’s—literary patrimony. Hammer explores the city’s manuscript heritage and offers never-before-reported details about the militants’ march into northwest Africa. But above all, The Bad-Ass Librarians of Timbuktu is an inspiring account of the victory of art and literature over extremism.A la manera de la famosa novela de Ray Bradbury, Fahrenheit 451, Hammer nos embarca en esta épica y azarosa aventura digna de un Indiana Jones asistido por una bibliofilia a prueba de bombas. La historia comienza en Tombuctú en la década de los ochenta, cuando el librero, historiador y bibliotecario Abdel Kader Haidara recibe el encargo de buscar y rescatar decenas de miles de manuscritos antiguos que han caído en el olvido. La maravillosa tarea emprendida por nuestro joven protagonista se ve seriamente amenazada cuando, en 2012, miles de militantes de Al Qaeda toman el control de la mayor parte de Mali. Tras la ocupación se impone la sharia, una cruel tradición que impone la mutilación a los ladrones, la lapidación de las parejas de hecho y la destrucción de cualquier texto que no cumpla con la ortodoxia islámica.",
  "genres": [
    "Nonfiction",
    "History",
    "Africa",
    "Books About Books",
    "Audiobook",
    "Book Club",
    "War"
  ],
  "author": "Joshua Hammer",
  "average_rating": "3.50",
  "url": "https://www.goodreads.com/book/show/27905440-the-bad-ass-librarians-of-timbuktu"
}