{
  "title": "Edward Abbey: A Life",
  "description": "“The best biography ever about Ed. Cahalan’s meticulous research and thoughtful interviews have made this book the authoritative source for Abbey scholars and fans alike.” —Doug Peacock, author, environmentalist activist and explorer, and the inspiration for Hayduke in The Monkey Wrench GangHe was a hero to environmentalists and the patron saint of monkeywrenchers, a man in love with desert solitude. A supposed misogynist, ornery and contentious, he nevertheless counted women among his closest friends and admirers. He attracted a cult following, but he was often uncomfortable with it. He was a writer who wandered far from Home without really starting out there. James Cahalan has written a definitive biography of a contemporary literary icon whose life was a web of contradictions. Edward A Life sets the record straight on \"Cactus Ed,\" giving readers a fuller, more human Abbey than most have ever known. It separates fact from fiction, showing that much of the myth surrounding Abbey—such as his birth in Home, Pennsylvania, and later residence in Oracle, Arizona—was self-created and self-perpetuated.It also shows that Abbey cultivated a persona both in his books and as a public speaker that contradicted his true publicly racy and sardonic, he was privately reserved and somber. Cahalan studied all of Abbey's works and private papers and interviewed many people who knew him—including the models for characters in The Brave Cowboy and The Monkey Wrench Gang —to create the most complete picture to date of the writer's life. He examines Abbey's childhood roots in the East and his love affair with the West, his personal relationships and tempestuous marriages, and his myriad jobs in continually shifting locations—including sixteen national parks and forests.He also explores Abbey's writing process, his broad intellectual interests, and the philosophical roots of his politics. For Abbey fans who assume that his \"honest novel,\" The Fool's Progress, was factual or that his public statements were entirely off the cuff, Cahalan's evenhanded treatment will be an eye-opener. More than a biography, Edward A Life is a corrective that shows that he was neither simply a countercultural cowboy hero nor an unprincipled troublemaker, but instead a complex and multifaceted person whose legacy has only begun to be appreciated. The book contains 30 photographs, capturing scenes ranging from Abbey's childhood to his burial site.",
  "genres": [
    "Biography",
    "Nonfiction",
    "Nature",
    "Westerns",
    "Environment"
  ],
  "author": "James M. Cahalan",
  "average_rating": "3.85",
  "url": "https://www.goodreads.com/book/show/278948.Edward_Abbey"
}