{
  "title": "Retribution: Episode One of Season Four: The Kingdom of Ara",
  "description": "Théoden: Tonight is the night I break through Dante's last wall. The one he's been trying to keep fortified as he struggles to resist the temptation of the life I'm offering him. I had planned to enjoy doing this. What I did not plan for, is to discover that a vampire in my city was murdered. I have my best on it and when I find out who crossed me, they will suffer a fate worse than death.  Noel: I had a revelation tonight that literally changed my entire world, and I believe for the better. At least, that's what I hope. On top of that megaton bomb being dropped, I find out that a vampire was killed in Marco's district. I'd hate to be the person Marco is hunting for, the stupid bastard.  Deacon: With my plan fully underway, now it just becomes a game of waiting before I can make another move. But that isn't the most significant thing that's happened today. I've finally discovered my mate's true weakness and it's the same as his greatest strength. His deepest desire and it’s everything I'm capable and willing to fulfill.  Josef: The last thing I needed to hear this morning is that one of my wolves didn't show up for their duty. My wolves don't slack in any way because they know I will not tolerate disobedience. What’s more, when I get wind of a dead body being discovered in the dragons' warehouse district, well, that sort of thing peaks my interest because I don't believe in coincidences.  Warning: This serial contains strong adult content not meant for sensitive eyes. The novelettes in this serial will be filled with dark, twisted, raunchy and steamy scenes between powerful, sexy men that will either offend you or get ya revved up. This series will not be pulling any punches, and it won’t apologize for hurting your feelings, either. You’ll find no fluff and ruffles here. The vampires are not misunderstood, hopeless romantics looking for love. The werewolves are not cute and cuddly and the dragons aren’t the ones from your childhood. This is NOT a romance. There are approximately 45,100 words in this novelette.",
  "genres": [],
  "author": "Nicholas Bella",
  "average_rating": "4.34",
  "url": "https://www.goodreads.com/book/show/27918051-retribution"
}