{
  "title": "Searching for the Sound: My Life with the Grateful Dead",
  "description": "Right in time for the Grateful Dead's 40th anniversary, eccentric bass player extraordinaire Phil Lesh has delivered fans a most welcome gift: his autobiography. There are many books out there about the Dead told from the perspective of roadies, journalists, third party observers, and fans. However, with the exceptions of Jerry Garcia's ramblings in Garcia: A Signpost to New Space and Conversations With the Dead, Lesh's Searching for the Sound is the first time a founding member of America's favorite band tells their own story of what it was like inside the Grateful Dead. And what a wonderful, strange tale it is.Phil Lesh, considered the most academic of the group due to his avant-garde classical composition training, literate mind, and passion for the arts, decided to write his story himself. Written without the crutch of a ghostwriter, Searching for the Sound might be considered disjointed in places, but overall it comes across as conversational, intimate, informative, and candid (particularly regarding topics of drug use and death). If you are familiar with the band and their extended family, their history, the sixties' musical milestones and influences and all the band's famous tales (the Garcia/ Lesh \"silent\" confrontation, being busted on Bourbon Street, the Wall of Sound), you may be a little disgruntled there is not much new here in the way of content. However, what is \"new\" and totally satisfying is Phil's warm, optimistic perspective on the many events that helped shape his life. As described by Lesh, his life's journey, much like the Dead's music, is \"a [series] of recurring themes, transpositions, repetitions, unexpected developments, all converging to define form that is not necessarily apparent until it's ending has come and gone.\" For the many fans who enjoyed the fruits of his life pursuit of sonic explorations, Searching for the Sound is a welcome addition to their Dead library.",
  "genres": [
    "Music",
    "Nonfiction",
    "Biography",
    "Memoir",
    "Autobiography",
    "Audiobook",
    "Biography Memoir"
  ],
  "author": "Phil Lesh",
  "average_rating": "4.16",
  "url": "https://www.goodreads.com/book/show/279410.Searching_for_the_Sound"
}