{
  "title": "The Essential Augustine",
  "description": "Foreword1 THE MAN & HIS WRITINGS: How A. Came to the Episcopacy (Serm. 355, 2); A. Chooses Eraclius as His Successor (Letter 213, 1, 5f); A. on His Own Writings (Retractations Prol. I, 1-3)2 FAITH & REASON: Belief is Volitional Consent (On the Spirit & Letter 21, 54; 34, 60); To Believe Is to Think w/Assent (Predestination of the Saints 5); Believing & Understanding (On Free Choice II, 2, 4-6); Authority & Reason (Against the Academics III, 20, 43); Two Ways to Knowledge (On Order II, 9, 26f); Reason & Authority in Manicheism (Value of Believing 1-4); The Relation of Authority to Reason (True Religion 24, 45--25, 47); If I Am Deceived, I Am Alive (City of God XI, 26); I Know that I Am Alive (The Trinity XV, 12, 21f); Knowledge & Wisdom (The Trinity XII, 14, 21--15, 25); Error & Ignorance (Enchiridion 17)3 THREE LEVELS OF REALITY: Creator, Human Soul, Body (Questions for Simplicianus I, 2, 18); Natures on Three Levels (Letter 18, 2); Soul, Ruled by God, Rules Its Body (On Music VI, 5, 12f); Soul: Above the Sensible, Below God (True Religion 3. 3); God, Mutable Spirits, & Bodies (Nature of the Good 1-25); Divine, Psychic & Bodily Nature (City of God VIII, 5f); Causality: Divine, Psychic & Bodily (City of God V, 9); Divine Ideas as Prototypes (83 Different Questions 46, 1f); God Set Spiritual Creation Above the Corporeal (Literal Commentary on Genesis VIII, 20, 39; 25, 46; 26, 48); Evil: the Privation of the Good (Enchiridion 10-12)4 MAN’S SOUL: Existence, Life, Sense & Reason (On Free Choice II, 3, 7f, 10); Sensation as an Activity of the Soul (On Music VI, 5, 9f); Memory, Understanding & Will (The Trinity X, 11, 17f); The Wonders of Memory (Confessions X, 8-26); Three Levels of Vision (Literal Commentary on Genesis XII, 6, 15--11, 22; 30, 58--31, 59)5 THE WORLD OF BODIES: All Bodily Natures Are Good (City of God XII, 4); Invisible Seeds in the Elements (The Trinity III, 8, 13); The Elements Contain Seminal Reasons (Literal Commentary on Genesis IX, 17, 32); Measure, Number, & Weight (Literal Commentary on Genesis IV, 3, 7); Concerning Formless Matter (Confessions XII, 3. 3--9, 9); Place, Time & the Physical World (City of God XI, 5-6); The Wonders of Nature (City of God XXI, 4-5); God Works Thruout Nature (The Trinity III, 5, 11--6, 11); Man’s Natural Endowments (City of God XXII, 24); The Physical World & the Xian (Enchiridion 9)6 APPROACHING GOD THRU UNDERSTANDING: Creation is a Great Book (Serm., Mai 126, 6); The Journey of the Soul to God (On Free Choice II, 12, 33f; 15, 39f; 16, 41f); The Soul’s Ascent to God (Confessions VII, 10, 16--17, 23); The Whole World Proclaims Its Maker (On Psalm 26, Serm. 2, 12); Ascending to the Supreme Truth (True Religion 29, 52--31, 58); Plato’s View of God (City of God VII, 4); How to Think About God (The Trinity V, 1f--2f); The Problem of Speaking About God (The Trinity VII, 4, 7-9); God Is the Selfsame (On Psalm 121, 3, 5); A Divine Invocation (Soliloquies I, 2-6); Late Have I Loved Thee (Confessions X, 27, 38--28, 39)7 MORAL & RELIGIOUS LIFE: All Men Desire Happiness (On Psalm 32, Serm. 3, 15f); Man’s Greatest Good (Moral Behavior of the Catholic Church 3-8); Good Love & Bad Love (City of God XIV, 6f); Moral Evil Stems from Bad Will (City of God XII, 6); Two Precepts of Love (City of God XIX, 14); On Diversities of Local Customs (Letter 54, 1-4); Doing Good to Body & Soul (Moral Behavior of the Catholic Church 27f); The Evil of Telling a Lie (Enchiridion 18f, 22); Lying & Concealing the Truth (On Psalm 5, 7); Faith, Hope & Charity (Enchiridion 8); No Virtues Apart from God (City of God XIX, 25); Our Reward Is Not in This Life (On Psalm 48, Serm. 2)8 DIMENSIONS OF GRACE: What the Grace of God Is (On Admonition & Grace 2f); A. Was Never a Pelagian (Retractations I, 9, 2-4); What True Grace Is (On the Grace of Christ 26f); The Work of Grace (City of God XXI, 15f); How Freedom Is Restored by Grace (Enchiridion 30-32); God’s Foreknowledge & Human Willing (City of God V, 10); Grace Before & After the Fall (Enchiridion 104-106); Grace & Good Works (On Psalm 31, Serm. 2, 6-8); Prevenient Grace (On Psalm 18, Serm. 2); Grace & Human Miseries (City of God XXII, 20-22); The Beatific Vision (On Psalm 36, Serm. 2, 8)9 THE TWO CITIES: A.’s Analysis of the City of God (Letter to Firmus); How the Two Cities Differ (City of God XIV, 1); Two Loves Make Two Cities (Literal Commentary on Genesis XI, 15, 20); Two Cities Formed by Two Loves (City of God XIV, 28); The Unimportance of Externals (City of God XIX, 19); Relation of the Heavenly & Earthly Cities (City of God XIX, 17); Jerusalem & Babylon (On Psalm 64, 2); Summary of the Two Cities (City of God XVIII, 1); All Nations Are in the City of God (On Psalm 86, 5); The Church & the City of God (On Psalm 98, 4); The Foundation of the Holy City (On Psalm 121, 4); Religion & Human Destiny (True Religion 7, 13--8, 14); The Meaning of a People (City of God XIX, 23f); Peace: the Tranquility of Order (City of God XIX, 11-13); Two Kingdoms After the Resurrection (Enchiridion 111)10 PHILOSOPHY OF HISTORY: Belief & Historical Events (83 Different Questions 48); The Universality of Providence (City of God V, 11); Meaning in History (True Religion 50, 98f); Six Ages in Biblical History (On Psalm 92, 1); Symbolic Meaning of Jewish History (On Psalm 64, 1); Christ in History (Letter 137, 4, 15f); The Two Cities in History (On Catechizing the Uninstructed 21, 37); What Is Time? (Confessions XI, 14, 17--30, 40); Critique of Cyclicism (City of God XII, 13-15)APENDIXES: 1 Selected, Annotated Bibliography 2 Alphabetical List of A.’s Writings 3 Glossary of TermsINDEX",
  "genres": [
    "Philosophy",
    "Theology",
    "Religion",
    "Nonfiction",
    "Classics",
    "History",
    "Christianity"
  ],
  "author": "Augustine of Hippo",
  "average_rating": "3.75",
  "url": "https://www.goodreads.com/book/show/27924.The_Essential_Augustine"
}