{
  "title": "The Un-Prescription for Autism: A Natural Approach for a Calmer, Happier, and More Focused Child",
  "description": "Winner: Nautilus Book Awards, Psychology Winner: International Book Awards, Psychology/Mental Health Winner: International Book Awards, Alternative Medicine Winner: Best Book Awards, Alternative Medicine  Winner: Book Excellence Awards, Alternative Medicine Winner: Bookvana Book Awards, Psychology/Mental Health Winner: Bookvana Book Awards, Alternative MedicineEach year, more than 50,000 U.S. families receive an autism diagnosis. On top of turmoil and worry, they share the same urgent question: What can we do to help our child?The answers parents find can be contradictory…even dangerous. The conventional approach is to medicate difficult behaviors into submission—suppressing symptoms while leaving underlying health challenges untouched. Surfing the Internet for alternatives just leads to confusion.Now, Dr. Janet Lintala, founder of the Autism Health center and an autism mom herself, shares the non-prescription protocols used in her practice to dramatically improve the function and well-being of children on the spectrum. Drawing on the latest research developments, as well as personal and clinical experience, she targets the underlying issues (gastrointestinal dysfunction, immune dysregulation, chronic inflammation, oxidative stress) associated with the behavior, bowel, and sleep problems so common to autism.Supporting and correcting these overlooked conditions with digestive enzymes, probiotics, antifungals, and other nonpsychiatric treatments brings transformative results: less pain, less aggression, and a child who is more receptive to behavioral and educational interventions.While the medical profession is slow to change, autistic children and adults need help immediately. The Un-Prescription for Autism provides clear explanations, detailed protocols, and examples to help parents act quickly to restore their child’s health, self-control, and even language—paving the way for a vibrant life on the autism spectrum.",
  "genres": [
    "Autistic Spectrum Disorder",
    "Nonfiction",
    "Parenting"
  ],
  "author": "Janet Lintala",
  "average_rating": "4.07",
  "url": "https://www.goodreads.com/book/show/27919190-the-un-prescription-for-autism"
}