{
  "title": "Critical Condition",
  "description": "In the heat of a passionate encounter, ecstasy suddenly turns to terror for renowned geneticist and TV personality Dr. Kathleen Sullivan. Stricken by a brain hemorrhage, she is rendered completely paralyzed and speechless . . . but still utterly aware; a prisoner inside her own body.Kathleen is rushed to a Manhattan hospital, her chances of survival slim. Even if she pulls through, the likelihood that she’ll sustain permanent brain damage is near one hundred percent. But neither outcome can compare to the insidious fate in store for her masterminded by the very people entrusted with saving her life. As her lover, ER chief Richard Steele, watches and waits for a miracle, Kathleen becomes a pawn in a clandestine plot that runs deeper than medical politics–and reaches into the highest echelons of power at New York City Hospital.Placed in the hands, and at the mercy, of revered Chief of Neurosurgery Dr. Tony Hamlin, Kathleen descends into a waking nightmare. Powerless to resist the sinister experiments she is subjected to, and unable to cry out for help, she must fight desperately to communicate her tortured, trapped thoughts to Steele–before her tormentors can carry their bizarre and potentially lethal work to its completion.Ruthlessly determined to achieve their goals, the secret cabal of ambitious physicians will go to any length to avoid discovery, defy the law, and make medical history at all costs . . . even the human life they are sworn to preserve.For anyone who has ever had a mortal fear of hospitals, and the sense of powerlessness that often transpires within their cold, sterile corridors, Peter Clement’s Critical Condition will provide chilling new nightmares–along with infectious suspense.",
  "genres": [
    "Thriller",
    "Medicine",
    "Suspense",
    "Mystery Thriller",
    "Crime",
    "Medical",
    "Fiction"
  ],
  "author": "Peter Clement",
  "average_rating": "3.97",
  "url": "https://www.goodreads.com/book/show/279238.Critical_Condition"
}