{
  "title": "Rebel",
  "description": "Librarian's note: This is an alternate cover edition for ASIN: B00Q7O0LDO.Book One in the Dead Man's Ink Series. This book contains strong ties with the Blood & Roses series, but you do not have to have read those works in order to read this one. Rebel is a contemporary romance story with occasional dark themes that some people might find confronting.SophiaSometimes, you don't mean to become another person. Sometimes the choice is made for you, and pretending is the only thing that keeps you going. When Alexis Romera is taken and her kidnappers find her fake ID in her purse, she must become Sophia in order to keep her family safe. Revealing her real identity to the man she's sold to would be easy enough, but can she trust him? Hell bent on revenging the murder of his uncle, Rebel doesn't seem all that interested in playing things safe.In fact, nothing about the secretive, dark and brooding MC president seems safe at all.RebelWhat do you do when the man who raised you is murdered, and the only witness is kidnapped girl who's being sold as a sex slave? You buy her, of course. As president to the most powerful motorcycle club in America, Rebel isn't lacking in power. There are strings the man can pull, and entire criminal organisations and corporate businesses alike would fall to their knees. However, along with such power comes intense interest. The DEA have their eye fixed solely on the MC...and they're just waiting for Rebel to trip up.Getting Sophia to testify is the only way to bring the Los Oscuros cartel down. The beautiful, dark haired, dark eyed woman is belligerent and uncooperative and unlikely to bend to his will, but Rebel has a few tricks up his sleeve to make her compliant--he'll charm her until she's bending over backwards to please him.Of course, falling for her might cause a few hiccups along the way...*** Rebel is part 1 in a 3 part story, and ends on a cliffhanger. Rogue, part 2 in the Dead Man's Ink series comes out Nov 17 ***",
  "genres": [
    "Romance",
    "Dark",
    "Dark Romance",
    "Contemporary",
    "New Adult",
    "Abuse",
    "Contemporary Romance"
  ],
  "author": "Callie Hart",
  "average_rating": "4.13",
  "url": "https://www.goodreads.com/book/show/27969892-rebel"
}