{
  "title": "The Heart of Falcon Ridge",
  "description": "Librarian's note: This is an alternate cover edition for ASIN: B00BH34Y74.Three hearts beat as one, for one. Always.\"Everything inside him ached for Claira in a way that was completely unfair to the memory of his wife.\" ~ Grey McLendon Claira Robbins technically didn't exist until two weeks before she began teaching at Grassland Academy. Her new identity may have given her the credentials she needed for the job, but it hasn't helped one whit to soothe her frayed nerves caused by years on the run. It also didn't come with instructions on how to handle three ravenous cowboy brothers intent on seducing her. Six years after losing their wife, the McLendon brothers are focused on running their family ranch, Falcon Ridge, and raising their rambunctious twin boys. They've never believed they could find another woman with which to share their hearts and family. When Matt and his twin, Mason, meet their sons' classy new teacher, hope and love aren't the only things that spring back to life. Matt is convinced she was Heaven sent to heal their family. Mason hopes he's right, but knows they have a bigger problem than convincing Claira to take a chance on their unconventional family; a much bigger, surly, older brother kind of problem. After their wife died, Grey McLendon planned to live the rest of his life comfortably numb from the neck down, even if it killed him...and it just might if he can't reconcile his guilt and desire for Claira before her treacherous past catches up with her. Author Note: Originally published as Second Chances. Remastered and reedited with bonus content for The McLendon Family Saga Series. GENRE: Western Romance, Menage Romance, MFM, MFMM, Contemporary Cowboy, Romantica, Family Saga The McLendon Family Saga reading order:The Heart of Falcon Ridge A McLendon Christmas Rock Star Cowboys (Coming January 2016) Rock Star Cowboys: The Honeymoon (Coming January 2016)",
  "genres": [
    "Romance",
    "Menage",
    "Erotica",
    "Westerns",
    "Contemporary",
    "Contemporary Romance",
    "Reverse Harem"
  ],
  "author": "D.L. Roan",
  "average_rating": "4.01",
  "url": "https://www.goodreads.com/book/show/27971172-the-heart-of-falcon-ridge"
}