{
  "title": "Uncovering You: The Complete Series",
  "description": "Borrow free on Kindle Unlimited!From Amazon best-selling author Scarlett Edwards...Join Lilly and J.S. as they begin their twisted tale of love and revenge. The Uncovering You Complete Series Box Set includes all eleven books of the best selling dark romance series that has captivated readers all over the world.Books of the Series:Uncovering You 1: The ContractUncovering You 2: SubmissionUncovering You 3: ResistanceUncovering You 4: RetributionUncovering You 5: ConfessionsUncovering You 6: DeliveranceUncovering You 7: ResurrectionUncovering You 8: RedemptionUncovering You 9: LiberationUncovering You 10: The FinaleUncovering You 11: The Lost Chapter---Uncovering You 1 - The ContractWhen I wake up in a dark, unfamiliar room, I have no idea what's waiting for me in the shadows. My imagination conjures up demons of the worst kind.Reality is much worse:A collar with no leash. A prison with no walls. And a life stripped of meaning.I am presented with a vile contract and asked to sign. It outlines the terms of my servitude. The only information I have about my captor are the two small letters inked at the bottom:J.S.Armed with only my memories, I must do everything I can to avoid becoming ensnared in his twisted mind games. But in the end, it all comes down to one choice:Resist and die.Or submit, and sign my life away.---Uncovering You 2 - SubmissionI have survived the worst. I have come out of the darkness with my sanity intact.Now, I get to meet the monster holding me here. For the first time since my captivity began, I get to meet Stonehart.Whatever he wants, I'll be ready. The collar may be tight around my neck, but I will not be a prisoner.A prisoner has no choice. A prisoner has no purpose.But a concubine, on the other hand? She always has a choice.And today, I choose to fight.---Uncovering You 3 - ResistanceJeremy Stonehart is a cruel, vindictive man. He wants me to submit. He wants me to give in.I will never give in. I will never yield. No matter what he subjects me to, I will always fight.I will not forget my resolve.Let Stonehart think me broken. I am not so easily deterred as that. No matter what he puts me through, I will always remember my own strength. I will always remember that in the end, I have control of the one thing he really wants:My mind.I will never give him that.I will resist.---These books contain scenes of intense emotional and physical cruelty. Readers with sensitivity to such subjects are advised to proceed with caution.---EXCLUSIVE BOX SET BONUS: Five FULL NOVELS from Scarlett's back catalogue!",
  "genres": [
    "Dark",
    "Dark Romance",
    "BDSM",
    "Romance",
    "Erotica",
    "Contemporary Romance"
  ],
  "author": "Scarlett Edwards",
  "average_rating": "3.97",
  "url": "https://www.goodreads.com/book/show/27989635-uncovering-you"
}