{
  "title": "Das Erbe von Winterfell",
  "description": "Wie schafft er das? Mit seiner nahezu grenzenlosen Fantasie zieht George R. R. Martin selbst all jene in seinen Bann, die sich geschworen haben, nie wieder einen Fantasy-Wälzer zu beginnen (die englische Originalausgabe des ersten Bandes, Die Herren von Winterfell, hat über 700 Seiten). Das Erbe von Winterfell ist nicht nur länger, sondern auch noch düsterer, und dennoch überzeugen die Charaktere Martins auch in diesem zweiten Band. Die sieben vereinten Königreiche sind vom Verfall bedroht. Joffrey, der Sohn der sadistischen Königin Cersei, tritt nach dem Tod von Robert Baratheon, der den Thron mit Gewalt an sich gerissen hatte, dessen Nachfolge an. Die Lannister, das Adelsgeschlecht der Königin Cersei, verteidigen Joffreys Herrschaft. Doch auch der finstere Stannis und der charismatische Renly Baratheon, die beiden Brüder Roberts, erheben Anspruch auf die Krone. Robb Stark, der erklärte König im Norden, will sich für den Tod seines Vaters rächen und seine Schwester vom Hofe Joffreys befreien. Daenerys, die im Exil lebende letzte rechtmäßige Thronerbin des ehemals herrschenden Adelsgeschlechts, züchtet unterdessen drei Drachen heran und sucht ebenso nach einer Möglichkeit, in ihre Heimat zurückzukehren. Gleichzeitig erleidet die Nachtwache, die mit der Verteidigung des Reiches gegen die Gefahren nördlich der Mauer betraut wurde, kontinuierliche Verluste, während barbarische Kräfte zusehends an Stärke gewinnen und grässliche Kreaturen im Verwunschenen Wald umherstreifen. Zugegeben, das klingt alles recht verworren, doch versteht Martin es, aus all diesen Handlungssträngen ein aus dunkler Magie, komplexen politischen Intrigen und grauenvollem Blutvergießen bestehendes, abgerundetes Ganzes zu zaubern. --Nona Vero",
  "genres": [
    "Fantasy",
    "Fiction",
    "High Fantasy",
    "German Literature",
    "Epic Fantasy",
    "Audiobook",
    "Adult"
  ],
  "author": "George R.R. Martin",
  "average_rating": "4.46",
  "url": "https://www.goodreads.com/book/show/1176683.Das_Erbe_von_Winterfell"
}