{
  "title": "The Heights: Anatomy of a Skyscraper",
  "description": "From the author of The Works: Anatomy of a City comes a gorgeous graphic tour through the inner workings of skyscrapers.   The skyscraper is perhaps the most recognizable icon of the modern urban landscape. Providing offices, homes, restaurants, and shopping to thousands of inhabitants, modern skyscrapers function as small cities- with infrastructure not unlike that hidden beneath our streets. Clean water is provided to floors thousands of feet in the sky; elevators move people swiftly and safely throughout the building; and telecom networks allow virtual meetings with people on other continents. How are these services-considered essential, but largely taken for granted- possible in such a complex structure? What does it really take to sustain human life at such enormous heights?  Exploring the interconnected systems that make life livable in the sky is the task of Kate Ascher's stunningly illustrated The Heights: Anatomy of a Skyscraper. Ascher examines skyscrapers from around the world to learn how these incredible structures operate. Just how do skyscrapers sway in the wind, and why exactly is that a good idea? How can a modern elevator be as fast as an airplane? Why are skyscrapers in Asia safer than those in the United States? Have new safeguards been designed to protect skyscrapers from terrorism?  What happens when the power goes out in a building so tall? Why are all modern skyscrapers seemingly made of glass, and how can that be safe? How do skyscrapers age, and how can they be maintained over decades of habitation? No detail is too small, no difficulty too big to escape Ascher's encyclopedic eye. Along the way, The Heights introduces the reader to every type of person involved in designing, building, and maintaining a skyscraper: the designers who calculate how weight and weather will affect their structures, the workers who dig the foundations and raise the lightning rods, the crews who clean the windows and maintain the air ducts, and the firefighters-whose special equipment allows blazes to be fought at unprecedented heights.  More than a technical survey, Ascher's work is a triumphant ode to the most monumental aspect of modern civilization. Saturated with vivid illustrations and unforgettable anecdotes, The Heights is the ultimate guide to the way things work in the skyscraper.",
  "genres": [
    "Architecture",
    "Nonfiction",
    "Science",
    "Cities",
    "Reference",
    "Urbanism",
    "Engineering"
  ],
  "author": "Kate Ascher",
  "average_rating": "4.04",
  "url": "https://www.goodreads.com/book/show/11766982-the-heights"
}