{
  "title": "Devil Chaser's MC Romance Boxed Set",
  "description": "From the New York Times and USA Today best seller, L WilderFor a limited time, the Devil Chaser's MC Romance Boxed set \n\nInferno:Inferno; noun1. a large fire that is dangerously out of control.2. a place of suffering; hellTessa is a school teacher and single mom starting a new life in Paris, TN. Romance is the last thing on her mind. Bishop is the leader of the Devil Chasers' Motorcycle Club, and a single dad trying to rescue his son from sins of his father. Bishop's past won't let go, and soon Tessa is swept up in the powerful, intense biker's world- and all the danger that brings. When all hell breaks loose, will their love survive the blast or will everything be lost in the inferno?  Smolder-Smolders; 1.: To burn slowly without flames but usually with smoke 2. (Literary) a.: to feel a strong emotion but keep it hidden  Some connections are so intense, so deep that they span years. Starting with nothing more than a casual conversation, a look in the eye, a touch --but the point is they start. They smolder with a quiet intensity that eventually leads to combustion.  When both Taylor and Renegade's lives are rocked by tragedy, can they find comfort in each other's arms? Or will old wounds and scars tear them apart forever? In hearts where pain, love, and passion lie smoldering... will anything survive the blast when the fire sparks?Ignite:Ignite; ignites; ignited; igniting 1. To set (something) on fire: to cause (something) to burn 2. To give life or energy to (someone or something) Lily's quiet life was upturned the day she found out her sister was dead. Now, she only has one thing on her mind- to keep her sister's baby safe... at all cost. As Vice President of the Devil Chaser's MC, Goliath's main focus his my club. He's worked hard to help make it legal and successful, and it's finally paying off. He's committed to the Devil Chaser's, and his brother's know he'll do anything for them. Goliath had no clue what he was getting into the day he matched wits with the sassy spitfire Bishop hired to run the bar. Sometimes fate intervenes when we least expect it, and forces collide so fast and so hard, they can't help but Ignite.  ConsumedConsumed1.            To destroy (something) or expend by use; use up 2.            To destroy by burning (something) 3.            To absorb; engross Courtney is a curvy, feisty bombshell who has watched her friends be swept off their feet by the alpha men of the Devil Chasers' Motorcycle Club. She thinks she has met her match when she falls for one of the MC bad boys, but a vindictive act against the Devil Chasers will change her forever. Bobby is the brains behind the Devil Chasers' Motorcycle Club, a computer whiz who keeps his club a step ahead of the rest. The club is his family, and he would protect them at any cost. When a rival club puts her in danger, Bobby's world is rocked to its core.Combust:(verb)•\tto catch fire; burst into flame•\tto become suddenly angry(Noun)•\tthe act or process of burning•\trapid burn •\tviolent excitement or passionSheppard’s devotion to his club was unquestionable. He would do anything for them, including giving his own life to protect his brothers’. He proved that the day he took a bullet for Bishop, the president of the Devil Chaser’s MC. He thought his life was over when he fell into the lake and got dragged under by the fast-paced current. Ana’s world was crashing down around her. Her lifelong dream of becoming a doctor was being threatened. She felt lost, and she was quickly losing hope. The day she stumbled across a body by the lake, her instinct to his life overwhelmed her. She knew her life was complicated, but she couldn’t stop herself. She had to help him. When she looked into the handsome stranger’s eyes, she knew she would go to any lengths to save him.Ana would do everything she could to save Sheppard’s life, but would he be able to do the same for her? When Ana’s past comes crashing into her future, will they be able to withstand the blast? Or will their love combust into flames?",
  "genres": [
    "Romance",
    "Contemporary Romance",
    "Contemporary",
    "Adult"
  ],
  "author": "L. Wilder",
  "average_rating": "4.50",
  "url": "https://www.goodreads.com/book/show/27984491-devil-chaser-s-mc-romance-boxed-set"
}