{
  "title": "The Penguin Book of Vampire Stories",
  "description": "The Penguin Book of Vampire Stories is the definitive collection of short tales of those deadly bloodsuckers. Editor Alan Ryan includes a wide range of talents here, from Bram Stoker to Robert Bloch to Tanith Lee.Contents:\"Fragment of a Novel\" by George Gordon, Lord Byron \"The Vampyre\" by John Polidori \"Varney the Vampyre, or, the Feast of Blood\" [excerpt] by James Malcolm Rymer \"The Mysterious Stranger\" by Anonymous\"Carmilla\" by Sheridan Le Fanu\"Good Lady Ducayne\" by Mary Elizabeth Braddon \"Dracula's Guest\" by Bram Stoker \"Luella Miller\" by Mary E. Wilkins-Freeman \"For the Blood is The Life\" by F. Marion Crawford \"The Transfer\" by Algernon Blackwood \"The Room in the Tower\" by E.F. Benson \"An Episode of Cathedral History\" by M.R. James \"A Rendevous in Averoigne\" by Clark Ashton Smith \"Shambleau\" by C.L. Moore \"Revelations in Black\" by Carl Jacobi \"School for the Unspeakable\" by Manly Wade Wellman \"Drifting Snow\" by August Derleth \"Over the River\" by P. Schuyler Miller \"The Girl with the Hungry Eyes\" by Fritz Leiber \"The Mindworm\" by C.M. Kornbluth \"Drink My Blood\" by Richard Matheson \"Place of Meeting\" by Charles Beaumont \"The Living Dead\" by Robert Bloch \"Pages from a Young Girl's Journal\" by Robert Aikman \"The Werewolf and the Vampire\" by R. Chetwynd-Hayes \"Love-Starved\" by Charles L. Grant \"Cabin 33\" by Chelsea Quinn Yarbro \"Unicorn Tapestry\" by Suzy McKee Charnas \"Following the Way\" by Alan Ryan \"The Sunshine Club\" by Ramsey Campbell \"The Men & Women of Rivendale\" by Steve Rasnic Tem \"Bite-Me-Not, or, Fleur de Feu\" by Tanith Lee Also includes short appendices of vampire novels and movies.",
  "genres": [
    "Horror",
    "Vampires",
    "Short Stories",
    "Fiction",
    "Fantasy",
    "Anthologies",
    "Gothic"
  ],
  "author": "Alan Ryan",
  "average_rating": "3.94",
  "url": "https://www.goodreads.com/book/show/279969.The_Penguin_Book_of_Vampire_Stories"
}