{
  "title": "Blood in the Water: The Attica Prison Uprising of 1971 and Its Legacy",
  "description": "The first definitive account of the infamous 1971 Attica prison uprising, the state’s violent response, and the victims' decades-long quest for justice including information never released to the public published to coincide with the forty-fifth anniversary of this historic event.On September 9, 1971, nearly 1,300 prisoners took over the Attica Correctional Facility in upstate New York to protest years of mistreatment. Holding guards and civilian employees hostage, during the four long days and nights that followed, the inmates negotiated with state officials for improved living conditions. On September 13, the state abruptly ended talks and sent hundreds of heavily armed state troopers and corrections officers to retake the prison by force. In the ensuing gunfire, thirty-nine men were killed, hostages as well as prisoners, and close to one hundred were severely injured. After the prison was secured, troopers and officers brutally retaliated against the prisoners during the weeks that followed. For decades afterward, instead of charging any state employee who had committed murder or carried out egregious human rights abuses, New York officials prosecuted only the prisoners and failed to provide necessary support to the hostage survivors or the families of any of the men who'd been killed. Heather Ann Thompson sheds new light on one of the most important civil rights stories of the last century, exploring every aspect of the uprising and its legacy from the perspectives of all of those involved in this forty-five-year fight for justice: the prisoners, the state officials, the lawyers on both sides, the state troopers and corrections officers, and the families of the slain men.",
  "genres": [
    "History",
    "Nonfiction",
    "True Crime",
    "Politics",
    "American History",
    "Race",
    "Crime"
  ],
  "author": "Heather Ann Thompson",
  "average_rating": "4.45",
  "url": "https://www.goodreads.com/book/show/28007898-blood-in-the-water"
}