{
  "title": "Blood Secrets",
  "description": "A Note from the Publisher: Under No Circumstances Should You Reveal the Plot of this Book To Anyone.\nWhen Irene Rutledge, a brilliant and beautiful young graduate student, meets the mysterious and fascinating Frank Mattison, the two soon fall in love and marry, despite the warnings of Irene’s family and friends. But after their marriage, dark secrets from Frank’s past emerge to threaten their happiness, secrets that will lead to murder—and a shocking and horrific conclusion . . .Craig Jones’s critically acclaimed first novel, the Edgar Award-nominated Blood Secrets (1978), was a bestseller when originally published and has since been acknowledged by many critics as a masterpiece of modern Gothic fiction. This edition features a new preface by the author.REVIEWS“Chill-hungry readers can enjoy the nicely knotted domestic tension and aroma of undefined evil that first-novelist Jones fabricates so well.” —Kirkus Reviews“Craig Jones is a deft storyteller, ruthless at withholding information and absolutely, instinctually right about the precise moment to release information. You read this novel to find out what happens next; what happens is scary, comic, dark and sympathetic—and never disappointing.” —John Irving, author of The World According to Garp“A book strongly reminiscent of Ira Levin’s Rosemary’s Baby, though it does not deal with witches, merely strange people . . . a novel which starts out as a love story soon becomes a nightmare for those closely involved.” --West Coast Review of Books“There’s not a dull moment in this raw and shocking tale of evil family ties by a psychologically perceptive writer who knows how to build up to a searing, multi-twist ending the way a tornado gathers momentum. It’s undiluted horror.” --Mademoiselle“Blood Secrets is primarily a suspense story . . . but it is also a sort of domestic tragedy about two convincing, often likeable people in conflict over their child. The combination makes for a book that is hard to put down.” —Atlantic Monthly",
  "genres": [
    "Horror",
    "Mystery",
    "Thriller",
    "Fiction",
    "Classics",
    "Mystery Thriller",
    "Horror Thriller"
  ],
  "author": "Craig  Jones",
  "average_rating": "3.88",
  "url": "https://www.goodreads.com/book/show/28004926-blood-secrets"
}