{
  "title": "The Year 200",
  "description": "“There could scarcely be a more opportune moment for the appearance in English of the late Cuban science fiction master Agustín de Rojas’s epic novel The Year 200 …. De Rojas’s lucid fictional world intersects with many of our contemporary technological obsessions but charges them with remarkably distinct political valences..... A riveting narrative of espionage and geopolitical turmoil.” ―Los Angeles Review of BooksCenturies have passed since the Communist Federation defeated the capitalist Empire, but humanity is still divided. A vast artificial-intelligence network, a psychiatric bureaucracy, and a tiny egalitarian council oversee civil affairs and quash “abnormal” attitudes such as romantic love. Disillusioned civilians renounce the new society and either forego technology to live as “primitives” or enhance their brains with cybernetic implants to become “cybos.” When the Empire returns and takes over the minds of unsuspecting citizens in a scenario that terrifyingly recalls Invasion of the Body Snatchers , the world’s fate falls into the hands of two brave women.Drawing as much from the realms of the adventure novel, spy thriller, and political satire as from hard science fiction, horror, and fantasy, The Year 200 has been proven prophetic in its consideration of cryogenic freezing, artificial intelligence, and state surveillance, while its advanced weapons and robot assassins exist in an all-too-imaginable future. Originally published in 1990, just after the fall of the Berlin Wall and before the onset of Cuba's devastating Special Period, Agustín de Rojas’s magnum opus brings contemporary trajectories to their logical extremes and boldly asks, “What does ‘the greatest good for the greatest number’ really mean?”",
  "genres": [
    "Science Fiction",
    "Fiction",
    "International"
  ],
  "author": "Agustín de Rojas",
  "average_rating": "3.66",
  "url": "https://www.goodreads.com/book/show/28010265-the-year-200"
}