{
  "title": "War in a Time of Peace: Bush, Clinton and the Generals",
  "description": "In this successor to his #1 nat'l bestseller \"The Best & the Brightest,\" Halberstam describes in fascinating human detail how the shadow of the Cold War still hangs over American foreign policy & how domestic politics have determined our role as a world power. More than 25 years ago he told the story of the men who conceived & executed the Vietnam War. Now the Pulitzer Prize-winning author has written another chronicle of Washington politics, this time exploring the complex dynamics of foreign policy in post-Cold War America. Halberstam evokes the internecine conflicts, the untrammeled egos & the struggles for dominance among the key figures in the White House, the State Department & the military. He shows how the decisions of men who served in the Vietnam War--such as Gen. Colin Powell & presidential advisers Richard Holbrooke & Anthony Lake--& those who didn't have shaped American politics & policy makers (perhaps most notably, President Clinton's placing, for the 1st time in 50 years, domestic issues over foreign policy). With his ability to find the real story behind the headlines, he shows how current events in the Balkans, Somalia & Haiti reflect American politics & foreign policy. He discusses the repercussions in Washington on policy makers from two different administrations; the wariness of the American military to become caught again in an inconclusive ground war; the frustrations of civilian advisers, most of whom have never served in the military; & the effects these conflicting forces have on the American commander in Kosovo, Gen. Wes Clark. Sweeping & deep, \"War in a Time of Peace\" provides portraits of Clinton, Bush, Reagan, Kissinger, James Baker, Dick Cheney, Madeleine Albright & others, to reveal modern political America.",
  "genres": [
    "History",
    "Politics",
    "Nonfiction",
    "War",
    "American History",
    "Military Fiction",
    "Political Science"
  ],
  "author": "David Halberstam",
  "average_rating": "3.93",
  "url": "https://www.goodreads.com/book/show/280028.War_in_a_Time_of_Peace"
}