{
  "title": "Arrowood",
  "description": "A haunting novel from the author of The Weight of Blood about a young woman's return to her childhood home--and her encounter with the memories and family secrets it holdsITW THRILLER AWARD FINALISTArrowood is the most ornate and grand of the historical houses that line the Mississippi River in southern Iowa. But the house has a mystery it has never revealed: It's where Arden Arrowood's younger twin sisters vanished on her watch twenty years ago--never to be seen again. After the twins' disappearance, Arden's parents divorced and the Arrowoods left the big house that had been in their family for generations. And Arden's own life has fallen apart: She can't finish her master's thesis, and a misguided love affair has ended badly. She has held on to the hope that her sisters are still alive, and it seems she can't move forward until she finds them. When her father dies and she inherits Arrowood, Arden returns to her childhood home determined to discover what really happened to her sisters that traumatic summer.Arden's return to the town of Keokuk--and the now infamous house that bears her name--is greeted with curiosity. But she is welcomed back by her old neighbor and first love, Ben Ferris, whose family, she slowly learns, knows more about the Arrowoods' secrets and their small, closed community than she ever realized. With the help of a young amateur investigator, Arden tracks down the man who was the prime suspect in the kidnapping. But the house and the surrounding town hold their secrets close--and the truth, when Arden finds it, is more devastating than she ever could have imagined.Arrowood is a powerful and resonant novel that examines the ways in which our lives are shaped by memory. As with her award-winning debut novel, The Weight of Blood,  Laura McHugh has written a thrilling novel in which nothing is as it seems, and in which our longing for the past can take hold of the present in insidious and haunting ways.",
  "genres": [
    "Mystery",
    "Fiction",
    "Thriller",
    "Suspense",
    "Gothic",
    "Mystery Thriller",
    "Audiobook"
  ],
  "author": "Laura McHugh",
  "average_rating": "3.76",
  "url": "https://www.goodreads.com/book/show/28007948-arrowood"
}