{
  "title": "The Terror Years: From al-Qaeda to the Islamic State",
  "description": "With the Pulitzer Prize–winning The Looming Tower, Lawrence Wright became generally acknowledged as one of our major journalists writing on terrorism in the Middle East. Here, in ten powerful pieces first published in The New Yorker, he recalls the path that terror in the Middle East has taken, from the rise of al-Qaeda in the 1990s to the recent beheadings of reporters and aid workers by ISIS.The Terror Years draws on several articles he wrote while researching The Looming Tow er , as well as many that he’s written since, following where and how al-Qaeda and its core cultlike beliefs have morphed and spread. They include a portrait of the “man behind bin Laden,” Ayman al-Zawahiri, and the tumultuous Egypt he helped spawn; an indelible impression of Saudi Arabia, a kingdom of silence under the control of the religious police; the Syrian film industry, at the time compliant at the edges but already exuding a feeling of the barely masked fury that erupted into civil war; the 2006–11 Israeli-Palestinian conflict in Gaza, a study in the disparate value of human lives. Other chapters examine al-Qaeda as it forms a master plan for its future, experiences a rebellion from within the organization, and spins off a growing web of worldwide terror. The American response is covered in profiles of two FBI agents and the head of the intelligence community. The book ends with a devastating piece about the capture and slaying by ISIS of four American journalists and aid workers, and our government’s failed response. On the fifteenth anniversary of 9/11, The Terror Years is at once a unifying recollection of the roots of contemporary Middle Eastern terrorism, a study of how it has grown and metastasized, and, in the scary and moving epilogue, a cautionary tale of where terrorism might take us yet.",
  "genres": [
    "History",
    "Nonfiction",
    "Politics",
    "Terrorism",
    "War",
    "Religion",
    "Military Fiction"
  ],
  "author": "Lawrence Wright",
  "average_rating": "4.03",
  "url": "https://www.goodreads.com/book/show/28007900-the-terror-years"
}