{
  "title": "To Dance with Ugly People",
  "description": "CONTROVERSIAL,STUNNING AND PASSIONATE NOVEL, \"TO DANCE WITH UGLY PEOPLE,\"DEPICTS THE DAMAGE HUMANS CAN INFLICT ON ONE Lake Helen, Bestselling African American Women's Fiction author, Lorene Stunson Hill, energizes the readers with passion and feelings; liberates the readers minds to become aware of the struggles of others outside of what we perceive on a daily basis. Lorene Stunson Hill promises to make an impact as she eloquently guides you through this journey of life, hope and despair. The story lines range from heartfelt tenderness to explosive reality. Dani Marie Dobson's story exhibits the good sensitively, the bad as the reality of life and the ugly as things we hope will never happen to us. It is sure to be a hit with both men and women of all ages, college students and new adults alike. Where do I begin?? This story is told through letters from Dani's youth all the way into her adulthood. The author, Lorene Stunson Hill, portrays all of the struggles that her character suffered as a child including abandonment and resentment. As she grows older, life challenges her even more with desperation when her world is shaken by the Detroit Riots of 1967, fear and unrequited loneliness leads her to feeling hopeful as she moves to Orlando, Florida living in low income housing as a single Mother, but she has the courage and strength to carry on. She still believes that someone is out there who can give her the only thing that she has always searched for, true affection and respect toward the woman she has become. The author, Lorene Stunson Hill, wants her readers to understand the pain and hardships that plagued Dani's life so that you can understand her strength and the measures she took to find happiness. Both men and women can read this because this story does not have a specific gender preference. While the story is written in a series of letters by Dani, the main character, it is by no means too feminine. I give this book five stars because it was very well written and creative. There is so much raw talent that is encompassed into this novel; therefore, I was unable to put it down and I enjoyed having learned some new depths of life... Lauren Jones (Lauren's Book & Media Club).By K.W.C on June 18, 2014 Great read! I enjoyed this story. The author Ms. Hill, has an excellent way of \"drawing you in\" to the story. Very well done! I felt emotion as I read it and the To whom it may concern piece, really had me connecting with the primary character! Marie Buck on July 20, 2014 Thought Provoking Read! To Dance with Ugly People really drew me in with the author's concept of basing each 'chapter' of life on an African dance. I found this to be a thought provoking, emotional and a very clever read. By Rukia the Reader on October 21, 2014 An emotive and memorable read! This is an emotional and captivating novel, which is cleverly written. It is formatted using a unique style that enables the author to portray stories relating to some of the struggles of daily life for the main character Dani and the heartache endured. As it covers emotive subjects like drug abuse, and abusive relationships, it is obvious that the author has invested emotionally in this book and this gives it a sense of honesty and integrity. It is an intense read in parts and is an enjoyable book to read. By Tassy Trip The Light Fantastic! To Dance with Ugly People by Lorene Stunson Hill is an inspirational and emotional drama of the life and times of Dani growing up fast from 5 years old. Told in diary format this remarkable story squeezes every drop of emotion from the reader without being preachy or overbearing. Well done to the author for tackling such a subject in a way that is totally unique. By Robin Squire October 2, 2015 This is the most wonderfully entertaining and powerful book,written with great sensitivity, guts and feeling. I urge you to read it, it will enhance your life. Amazon Books",
  "genres": [],
  "author": "Lorene Stunson Hill",
  "average_rating": "4.53",
  "url": "https://www.goodreads.com/book/show/28008270-to-dance-with-ugly-people"
}