{
  "title": "The 400-Million-Year Itch: Silurian Tales Volume 1",
  "description": "The Silurian Vatles Volume 1 The 400-Million-Year Itch, Volume 1 of The Silurian Tales, represents the first volume of a master work by one of the SF genre's greatest short story writers.  The stories in Steven Utley's Silurian Tales have appeared in Asimov's, Analog, SciFiction, F&SF, and Cosmos, and have been beguiling readers with glimpses of prehistoric life since the mid-1990s. These tales have been described by Brian Stableford in Science Fact and Science Fiction: An Encyclopedia as \"[t]he most elaborate reconstruction of a past era in recent speculative fiction.\"  Publishers Weekly Review (17 September 2012) For the first time, 18 of Utley’s intriguing Silurian Tales (and an additional original offering) have been collected and placed into chronological order, starting with the introductory “All of Creation,” in which a link to the mid-Paleozoic Siluro-Devonian era grants present-day people a unique opportunity to study the Earth of 400 million years ago. These stories range in tone and style as they explore a wide variety of topics. Utley eschews action in favor of character-driven tales and weighty discussions, tackling the many-worlds hypothesis in “The Gift Horse,” time travel in “The Age of Mud and Slime,” and theology in “Half a Loaf.” The real focus is on Utley’s thought-provoking exploration of the concept from every angle, since the sprawling cast and lack of obvious connecting narrative leave each story standing alone. The result is subtle but powerful, and will leave readers wanting to do their own research into prehistoric eras. (Nov.) http://www.publishersweekly.com/978-1...  The series employs a variety of literary techniques in recounting the adventures and misadventures of a scientific expedition in the Paleozoic Era and also address some implications of the \"many-worlds\" hypothesis in quantum physics; several of the stories have been reprinted in Gardner Dozois' Year's Best Science Fiction anthologies and the Year's Best SF edited by David G. Hartwell and Kathryn Cramer.",
  "genres": [
    "Science Fiction",
    "Short Stories"
  ],
  "author": "Steven Utley",
  "average_rating": "3.96",
  "url": "https://www.goodreads.com/book/show/28005314-the-400-million-year-itch"
}