{
  "title": "Faith Adventures: Stories of Learning with an Unseen God",
  "description": "Faith Adventures is a book of essays and scripture studies centered around the allusive idea of faith. It is full of real-life stories meant to encourage your courage, dwindle your fear, and cultivate your faith in a faithful God. Local missions, foreign mission, adoption, social anxiety, spiritual growth, loss, friendship, and leadership are just some of the topics covered in this inspiring book. Faith Adventures reminds us that childlike faith isn't shallow. So let this book spur you into a deeper faith, that remains simple and pure.  This eBook also includes a guide for group study that could be completed in 5 or 9 weeks.  Table of Contents: FAITH ADVENTURES THE YURT LUCY SEEDS LIVER TRANSPLANTS BUILDING BIBLE CLUB CHILDLIKE CHAD THE CALL MORE TRIPS MEASURES ADOPTION TARGET FRIEND ETHIOPIA GREAT COMMISSION SOCIAL ANXIETY CAMP & CAFE´ COMMUNITY & ANXIETY GROWTH & HUMILITY MOVING & MARRIAGE HOME SCHOOL SET THE TABLE MONEY AND TALENTS BIKES MISSION STORIES ABRAHAM TESTIMONY DAD HEROES LEADING SPEAKING CONFERENCE ALIVE LOOKING BACK GUIDE FOR GROUP STUDY MIX TAPE FOR MY READERS APPENDIX A NOTES ACKNOWLEDGEMENTS  “Have you ever felt you had to hide the true you, the anxious, hurting and fearful you, even from God? Jennifer L. Lane's Faith Adventures shows us in her vulnerability before both God and her readers that: 'Our God isn't shallow. Our God doesn't call us shallow, and He knows that sometimes with a phone call, a run stoplight, a routine blood test, or a sonogram, we can be thrown into the deep end.' Through both her experiences and Scriptures, Jennifer reassures us that: 'He is there in the deep end with us.' She shows us that it is precisely in the moments we choose to face our humanity - our anxiety, hurt and fear - leaning into the arms of our mighty God to hold, soothe and protect us, that our greatest faith adventures are birthed. Let Jennifer inspire, challenge and encourage you to step into the exciting Faith Adventures awaiting you. Pick up a copy of her book or gift it to someone you would love to bless this Christmas. You won't be disappointed.”  - Anna Smit, Christian blogger sharing her journey into God's love at www.joyofthespiritwithin.wordpress.com",
  "genres": [],
  "author": "Jennifer L. Lane",
  "average_rating": "4.67",
  "url": "https://www.goodreads.com/book/show/28012465-faith-adventures"
}