{
  "title": "The Flaming Blue Sword",
  "description": "Angelica Thompson, an award-winning novelist, makes a decision to end her turbulent relationship back home in Denver and heads off to a secluded spot on the shores of Black Rock Cove in Oregon. She cannot get her mind into finishing her last novel in her paranormal romance series and is being pressured by the publisher to finish by the end of the summer. She finds out the first night of her arrival how vividly her mind’s thoughts and dreams come alive without visions of any problems back home. Her imagination of a dead sea captain, a black panther pouncing on her for his evening meal, and falling to her death in a cove hundreds of feet down off a cliff is only the beginning. Janie, her first friend from the village, wakens her in her cottage. She is the local real estate agent. But, was she awakened or had what happened been only a dream…could it be real? An ancient prophesy of destruction has been set into motion, and what destiny has in store for Angelica and the entire village of Black Rock Cove is bigger than anyone can imagine. The end is coming, and unless Angelica and the others learn to believe in what is about to happen and trust each other, they may never unravel the mystery surrounding the death of Jonathan Knight, the sea captain from two hundred years ago. Is the Black Panther what he appears to be or is there something strange in how he comes and goes. Experience the power of true love. Feel the intensity of real emotion when one woman loves one man but powerful forces threaten to keep them apart forever! See real magic. Fear real evil. Find true love. Do not miss this epic tale of love lost for two hundred years… This novel is the first in the Storm Lord Trilogy Series by Sidney St. James. It contains some graphical scenes and sexual themes not intended for readers under adult age.",
  "genres": [],
  "author": "Sidney  St. James",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/28002461-the-flaming-blue-sword"
}