{
  "title": "The Santini Brothers Collection",
  "description": "Containing RICARDO (book 1) and BRANDO (book 2) of THE SANTINI BROTHERS SERIES, as well as I LOVE YOU, SALVATORE.RICARDO'S BLURB:On a Mediterranean Island run by mafia, the Santini brothers are fighting a war against the Landi family, who are targeting their loved ones. After his fiancée is murdered, Ricardo, the eldest of the brothers, starts spiraling out of control, his violent nature leading him down a path that could rip his family apart. But, when two women walk into his life... His first love—Bianca D’Angelo And an assassin from the Viper Sisterhood ...he finds himself pulled into a world of espionage, intrigue, and seduction, where he'll win his family's safety and the woman of his dreams—or lose everything. BRANDO'S BLURB:Death and sex on two legs ... BRANDO is coming for you.Dark, brooding, and one hell of an asshole, Brando walks through life taking what he wants—and who he wants, whether they like it or not. And he wants Ivy, the second in command of the Vipers—a team of female assassins.Having been owned before, Ivy tries to resist Brando, who is just as deviant as her former master—a notorious human trafficker called the Black Russian. But after discovering Brando’s devastating past, she sets out to get to know the real man behind the beautiful face: a tortured soul with secrets to die for.I LOVE YOU, SALVATORE'S BLURB:Every love story is important, whether it ends in a happy-ever-after or tragedy, because two people shared something so special that it made them value each other’s life more than their own. I know this is true because my life with Salvatore Santini was a beautiful love story…One that ended far too soon.But I would rather live for only one day with him, than suffer a lifetime without him. Being with Salvatore was worth a thousand deaths. Through him, I experienced heaven on earth, something very few people find. So don’t cry for me, I was truly happy. But if you can’t stop your tears, save them for Salvatore…The one I left behind.",
  "genres": [],
  "author": "Marita A. Hansen",
  "average_rating": "4.31",
  "url": "https://www.goodreads.com/book/show/28001060-the-santini-brothers-collection"
}