{
  "title": "Tommy's Tale",
  "description": "From the Number One Best Selling Author Saxon Andrew comes the fourth Book in the Best Selling Annihilation Series, “Tommy’s Tale”. The Stars Realm is finally at peace and the Algeans are now allies of the Realm. The Gardner’s youngest child, Tommy, has made a quest to free the captured Alfont from the Captors that have held them imprisoned for more than sixty million years. The Captors are hundreds of millions of years more advanced technologically than the Stars Realm Military and nothing in the Realm’s arsenal can match their ships, some of which are more than three thousand miles in diameter. The Captors have annihilated more than a million planets whose starships had the misfortune to stumble into their domain and Tommy is putting the Realm on a collision course with these beings that show no mercy. What the Realm doesn’t know is that the Captors are coming no matter what course Tommy decides to follow. The difference maker in the coming conflict could be two Algean Adolescents that have started their education. These two will find redemption for all the destroyed worlds their race harvested and perhaps even more than redemption, each other.The Annihilation Series continues and the action is non-stop as the Stars Realm fights to survive its most dangerous opponent.Excerpt from “Tommy’s Tale”The crew of the Kosiev was aboard ship preparing for their shakedown cruise. Cassandra was sitting in her command chair letting her mind roam the various systems of the ship feeling at peace from the contact. The ship was feeling like a cat purring in her lap. The Algean adolescents were in the nose of the giant ship connecting the device that they had built in Sten’s lab making sure all the connections were secure.“Tommy!”“What, Rose?”“A giant red ship has just come out of star drive just outside the orbit of Jupiter. The ship is almost two thousand miles wide.”“Rose, ground all ships and stop any in system traffic immediately. What is it doing?”“It appears to be just firing a beam into Jupiter’s atmosphere.”Tommy looked over at Cassie and thought to Rose, “We have no choice; I’m jumping into the Captor’s system immediately. If it causes a warning to all ships, perhaps that one will leave and go home to help defend the home world.”“Tommy, you’ll be killed.” Rose wailed!“I don’t know if we can out run them or not but if that ship turns its attention on Earth, it will destroy the planet.” Tommy reached forward and keyed his command circuit on the Kosiev and pressed a red button; immediately the ships intercom began blaring on all decks, “Battle stations, all hands to battle stations; this is not a drill.”“What’s going on?” Cassandra asked anxiously from her command chair as she punched the blue general quarter’s button.“A Captor ship had just entered Earth’s solar system and is firing a beam into Jupiter’s atmosphere. I suspect it is taking readings but when it finishes it will probably turn its attention on Earth. If it follows its normal behaviors then Earth and all its outposts will be destroyed. Our shakedown cruise has just been canceled. We are jumping into the Captor’s home system close to the planet, fire a full salvo of penetrators, and then jump away. I’ve entered the jump coordinates into your board, Cassie. We must divert that ships attention away from Earth’s solar system quickly.”Everyone on the bridge prepared for battle but felt the real fear of facing this enemy that was hundreds of millions of years more advanced. Cassandra thought to Tommy, “We aren’t ready.",
  "genres": [
    "Science Fiction",
    "Military Fiction",
    "Space"
  ],
  "author": "Saxon Andrew",
  "average_rating": "3.97",
  "url": "https://www.goodreads.com/book/show/11768814-tommy-s-tale"
}