{
  "title": "Dando on Delhi Ridge",
  "description": "India, 1857.  Joseph Dando, a resilient young Cockney, finds himself on Delhi Ridge in India fighting a bloody mutiny.  After surviving the outbreak of the mutiny in Meerut, along with the ghastly killings, looting, and rapes, Dando and the rest of the survivors face the brutal hike across the Doab Desert to help protect Delhi…and prevent the fall of the British Empire in India.  Will fortune favour the bold, or will Britain’s last line of defence be slaughtered on Delhi Ridge?  Using brief flashbacks to fill in Dando's background and extend the scope and flexibility of the narrative, author Ronald Bassett paints a fascinating picture of Victorian England as well as India.  ‘Fortune Favours the Brave’ was previously published under a different title, ‘Dando on the Delhi Ridge’.  Praise for Ronald Bassett:  ‘One of the most impressive things I found about the book was that you got a real feel for the time and place. Scenes set in India or England felt different and I think that's a great achievement.’ – Library Thing.  Ronald Bassett was born in 1924 in Chelsea. During the Munich crisis, at age fourteen, he falsified enlistment papers to become a Rifleman of the King's Royal Rifle Corps (60th Rifles). Following active service, he was exposed and discharged. In his records, his colonel noted, ‘A good soldier. I am sorry to lose him.' Undismayed, he immediately entered the Royal Navy, in which he remained for fourteen years, serving in the Arctic, North Atlantic, Mediterranean, the Far East and, later, Korea. He died in 1996 in Surrey.  Endeavour Press is the UK's leading independent digital publisher. For more information on our titles please sign up to our newsletter at www.endeavourpress.com. Each week you will receive updates on free and discounted ebooks. Follow us on Twitter: @EndeavourPress and on Facebook via http://on.fb.me/1HweQV7. We are always interested in hearing from our readers. Endeavour Press believes that the future is now.",
  "genres": [
    "Historical Fiction",
    "India"
  ],
  "author": "William Clive",
  "average_rating": "4.19",
  "url": "https://www.goodreads.com/book/show/2802849-dando-on-delhi-ridge"
}