{
  "title": "Dead Man Walking : An Eyewitness Account of the Death Penalty in the United States",
  "description": "When Chava Colon from the Prison Coalition asks me one January day in 1982 to become a pen pal to a death-row inmate, I say, Sure. The invitation seems to fit with my work in St. Thomas, a New Orleans housing project of poor black residents. Not death row exactly, but close. Thus begins Sister Helen Prejean's story of her encounter with the death penalty in America. When she first writes to Patrick Sonnier, the condemned killer of two teenagers, this unassuming Roman Catholic nun from a middle class Louisiana family is wholly unprepared for what will follow. As she grows to know Sonnier, she sees the terrified human being beneath the surface of the repentant killer and becomes increasingly disturbed not only by the inhumane conditions of his confinement but also by the terrible anguish he suffers during the long countdown toward execution. She also sees the moral struggles of the public officials - the governor, the head of the Department of Corrections, wardens, guards - who have to carry out killings that the law demands but that they do not personally believe in. And she comes to know the dismaying truth about the death penalty's disproportionate cost in money and resources, and how fragile and sometimes chaotic the justice system can be. Her experience soon leads her to ask: How can society benefit from replicating the violence it condemns? In formulating her answer, however, Helen Prejean also confronts the counterbalancing factors. Chief among them is the devastating rage and grief of the victims' families, whom she comes to know and befriend and whose need for retribution she understands. Prejean's indictment of capital punishment sensitively navigates the complex personal,ethical, and legal issues involved, balancing compassion for both the criminals and the people whose lives they destroy. By turns reflective and deeply personal, spiritual and candidly human, this engrossing and deeply moving meditation on one of the most painfully controversial issue",
  "genres": [
    "Nonfiction",
    "True Crime",
    "Memoir",
    "Biography",
    "Crime",
    "Politics",
    "Religion"
  ],
  "author": "Helen Prejean",
  "average_rating": "4.14",
  "url": "https://www.goodreads.com/book/show/1018780.Dead_Man_Walking_"
}