{
  "title": "The Tao of Fully Feeling: Harvesting Forgiveness out of Blame",
  "description": "This book is a handbook for increasing your emotional intelligence. Moreover, if you are a survivor of a dysfunctional family, it is a guide for repairing the damage done to your emotional nature in childhood. As such it is actually a sequel to my later book: Complex PTSD from Surviving To Thriving. The Tao of Fully Feeling focuses primarily on the emotional healing level of trauma recovery. It is a safe handbook for grieving losses of childhood. Whether or not you are a childhood trauma survivor, this book is a guide to emotional health. The degree of our mental health is often reflected in the degree to which we love and respect ourselves and others in a myriad of different feeling states. Real self-esteem and real intimacy with others depends on the ability to lovingly be there for oneself and others, whether one's feeling experience is pleasant or unpleasant. Those who can only be there for themselves or another during the \"good\" times show no constancy, inspire little trust, and are only fair weather friends to themselves and others. Without access to our dysphoric feelings, we are deprived of the most fundamental part of our ability to notice when something is unfair, abusive, or neglectful. Those who cannot feel their sadness often do not know when they are being unfairly excluded, and those who cannot feel their normal angry or fearful responses to abuse, are often in danger of putting up with it without protest. Repressing our emotions creates anxiety and stress, and stress, like most of our emotions is often treated like some unwanted waste that must be removed. Until all of the emotions are accepted indiscriminately (and acceptance does not imply license to dump emotions irresponsibly or abusively), there can be no wholeness, no real sense of well being, and no solid sense of self esteem. Thus, while it may be fairly easy to like oneself when feelings of love, happiness or serenity are present, deeper psychological health is seen only in the individual who can maintain a posture of self-compassion and self-respect in the times of emotional hurt that accompany life's inevitable losses, disappointments and unforeseen difficulties. Finally this book explores the nature and limits of real forgiveness - identifying behaviors and people who cannot authentically be forgiven.",
  "genres": [
    "Psychology",
    "Self Help",
    "Nonfiction",
    "Mental Health",
    "Spirituality",
    "Philosophy",
    "Audiobook"
  ],
  "author": "Pete Walker",
  "average_rating": "4.41",
  "url": "https://www.goodreads.com/book/show/28023686-the-tao-of-fully-feeling"
}