{
  "title": "The Nordic Theory of Everything: In Search of a Better Life",
  "description": "A Finnish journalist, now a naturalized American citizen, asks Americans to draw on elements of the Nordic way of life to nurture a fairer, happier, more secure, and less stressful society for themselves and their children.Moving to America in 2008, Finnish journalist Anu Partanen quickly went from confident, successful professional to wary, self-doubting mess. She found that navigating the basics of everyday life—from buying a cell phone and filing taxes to education and childcare—was much more complicated and stressful than anything she encountered in her homeland. At first, she attributed her crippling anxiety to the difficulty of adapting to a freewheeling new culture. But as she got to know Americans better, she discovered they shared her deep apprehension. To understand why life is so different in the U.S. and Finland, Partanen began to look closely at both.In The Nordic Theory of Everything, Partanen compares and contrasts life in the United States with life in the Nordic region, focusing on four key relationships—parents and children, men and women, employees and employers, and government and citizens. She debunks criticism that Nordic countries are socialist “nanny states,” revealing instead that it is we Americans who are far more enmeshed in unhealthy dependencies than we realize. As Partanen explains step by step, the Nordic approach allows citizens to enjoy more individual freedom and independence than we do.Partanen wants to open Americans’ eyes to how much better things can be—to show her beloved new country what it can learn from her homeland to reinvigorate and fulfill the promise of the American dream—to provide the opportunity to live a healthy, safe, economically secure, upwardly mobile life for everyone. Offering insights, advice, and solutions, The Nordic Theory of Everything makes a convincing argument that we can rebuild our society, rekindle our optimism, and restore true freedom to our relationships and lives.",
  "genres": [
    "Nonfiction",
    "Politics",
    "Sociology",
    "Audiobook",
    "Memoir",
    "Economics",
    "Philosophy"
  ],
  "author": "Anu  Partanen",
  "average_rating": "3.86",
  "url": "https://www.goodreads.com/book/show/28014216-the-nordic-theory-of-everything"
}