{
  "title": "Complete Writings",
  "description": "The extraordinary writings of Phillis Wheatley, a slave girl turned published poetIn 1761, a young girl arrived in Boston on a slave ship, sold to the Wheatley family, and given the name Phillis Wheatley. Struck by Phillis' extraordinary precociousness, the Wheatleys provided her with an education that was unusual for a woman of the time and astonishing for a slave. After studying English and classical literature, geography, the Bible, and Latin, Phillis published her first poem in 1767 at the age of 14, winning much public attention and considerable fame. When Boston publishers who doubted its authenticity rejected an initial collection of her poetry, Wheatley sailed to London in 1773 and found a publisher there for Poems on Various Subjects, Religious and Moral.This volume collects both Wheatley's letters and her hymns, elegies, translations, philosophical poems, tales, and epyllions--including a poignant plea to the Earl of Dartmouth urging freedom for America and comparing the country's condition to her own. With her contemplative elegies and her use of the poetic imagination to escape an unsatisfactory world, Wheatley anticipated the Romantic Movement of the following century. The appendices to this edition include poems of Wheatley's contemporary African-American Lucy Terry, Jupiter Harmon, and Francis Williams.For more than seventy years, Penguin has been the leading publisher of classic literature in the English-speaking world. With more than 1,700 titles, Penguin Classics represents a global bookshelf of the best works throughout history and across genres and disciplines. Readers trust the series to provide authoritative texts enhanced by introductions and notes by distinguished scholars and contemporary authors, as well as up-to-date translations by award-winning translators.",
  "genres": [
    "Poetry",
    "Classics",
    "History",
    "Essays",
    "Race",
    "School",
    "Nonfiction"
  ],
  "author": "Phillis Wheatley",
  "average_rating": "3.66",
  "url": "https://www.goodreads.com/book/show/280470.Complete_Writings"
}