{
  "title": "National Trust Book Of The Coast",
  "description": "Book of the week Mail on Sunday, May 2015 Many of our happiest memories are made at the coast. And little wonder whether we head there for a bucket-and-spade holiday, a blustery walk along a coastal path or a day s sailing around a choppy headland, the British coast has plenty of opportunities for mood-boosting pleasure. It s where we go to get away from the frenetic pace of modern life, to stare at the horizon and stride out on a long stretch of sand, a dog scampering before us. Fifty years ago the National Trust launched Enterprise Neptune, a landmark campaign to protect our coast. Today, thanks to the Neptune Coastline Campaign, the Trust looks after some of the most beautiful and important coastline across England, Wales and Northern Ireland. This book is a celebration of those places; a book for all those who love the British coast, from the wide sweep of Northumberland s dunes to the drama of the Giant s Causeway. It s the place to discover the endless sandy beaches of the Gower Peninsula, the secluded coves of Cornwall and the iconic white cliffs of Dover. As well as paying homage to Britain s coastline, this is an inspirational and practical guide on everything from beach coming and wild swimming to birdwatching and geology. There are spotters guides to coastal wildlife, together with suggestions for local accommodation, popular walking paths and nature trails, and nearby National Trust properties to head to once you ve shaken the sand from your shoes. Whether you re an armchair explorer or keen to get out there yourself, this is a vivid picture of the landscape, history and wildlife of our dynamic coastline. National Trust Neptune Campaign Established in May 1965 the Neptune Coastline Campaign has been backed by tens of thousands of people, enabling the National Trust to acquire 550 miles of coastline in England, Wales and Northern Ireland. From the first ever site acquires with Neptune funds at Whitford Burros on Gower to the most recent acquisition of a one-mile stretch of the White Cliffs of Dover, Neptune has allowed the Trust to buy and care for special coastal places loved by millions of people in the UK",
  "genres": [],
  "author": "Clare Gogerty",
  "average_rating": "4.63",
  "url": "https://www.goodreads.com/book/show/28060988-national-trust-book-of-the-coast"
}