{
  "title": "A Gathering of Dreams",
  "description": "Mount Taishan, China 1486 BCE  Humanity’s first recorded comet, Lao-Tien-Yeh 老天葉 finally reaches Earth. Estimated today, to have been four times brighter than the full moon. An old monk climbs Mount Tai to greet the coming star. An insignificant reunion with something along the way introduces the monk to what will become the tenets behind Universal Truth. Principles that later form the foundation of Buddhism. He won’t have the chance to tell anyone though, for ancient forces once again stir.She was the last of her kind. Awakened by the nightless day, she guards an isolated valley claimed in battle from an earlier emperor. She still has the scars. The comet has all but vanquished her protection of nightfall. The ten tails that followed behind were another worry. They mirrored what appeared the night Taishan was born. An omen. A prophecy. A disaster. In that scenario, no one wins. She was determined to die here. Her unborn would die with her unless the old monk can change their destiny. Not everything is as it’s seen. There are moments when you realize how fragile life is; How sacred the vows of compassion are. For a soul to be designated 'compassionate' it has to be earned. A lifetime of helping others is the only way to get there.It takes a thousand years for the Buddhist doctrine to be discovered again.Hanalei Bay, Hawaii Three Days Ago... While caring for a recently rescued kitten, an accident occurs that blurs the delicate lines between imagination and reality. Everything that has ever visited Calvin in dreams has come home. Every Grumpmuffin, Goblin, Adamsville Fairy and Menehune expect to have their say. It has been a long time since a human has been in a position to have a conversation and they intend to make the most of it. Harsh questions will be asked. Secrets will be shared. Truths will be revealed. Calvin's childhood promise weaves through time. It collects an old man, a grandfather, a ragged old cat... Clotho is the sister to the Fates who spins the threads of life and destiny. This time she has placed a single strand to connect them all. Harsh questions will be asked. Secrets will be shared. Truths will be revealed. But, like the Chinese monk before him, Calvin won't have the chance to tell anyone. Once again, an ancient force stirs.Although Twain, Tesla, Barrie, Warhol, The Apollo 12/Intrepid Landing Module, Perun--the Slavic God of Thunder, Some Quantum Foam and a wee bit of lost faith all make appearances ... it may not be enough. Comet Lao-Tien-Yeh 老天葉 is now designated 12P/Pons-Brooks, and it is fast approaching. Evergreen, Colorado Now ‘Shhhh... it is September. Love blooms in the softer sunlight. Changing colors float along with the wisps of chimney smoke and beckon the gentler souls out into the starlight. The Magic of Elysium begins in the cool darkened evenings of Autumn.' ~ G.A. Sarna",
  "genres": [],
  "author": "James Qualls",
  "average_rating": "4.80",
  "url": "https://www.goodreads.com/book/show/28065049-a-gathering-of-dreams"
}