{
  "title": "Lingo",
  "description": "Six thousand years. Sixty languages. One \"brisk and breezy\" whirlwind armchair tour of Europe \"bulg[ing] with linguistic trivia\" (The Wall Street Journal). Take a trip of the tongue across the continent in this fascinating, hilarious and highly edifying exploration of the many ways and whys of Euro-speaks--its idiosyncrasies, its histories, commonalities, and differences. Most European languages are descended from a single ancestor, a language not unlike Sanskrit known as Proto-Indo-European (or PIE for short), but the continent's ever-changing borders and cultures have given rise to a linguistic and cultural diversity that is too often forgotten in discussions of Europe as a political entity. Lingo takes us into today's remote mountain villages of Switzerland, where Romansh is still the lingua franca, to formerly Soviet Belarus, a country whose language was Russified by the Bolsheviks, to Sweden, where up until the 1960s polite speaking conventions required that one never use the word \"you.\" \"In this bubbly linguistic endeavor, journalist and polyglot Dorren thoughtfully walks readers through the weird evolution of languages\" (Publishers Weekly), and not just the usual suspects--French, German, Yiddish, irish, and Spanish, Here, too are the esoteric--Manx, Ossetian, Esperanto, Gagauz, and Sami, and that global headache called English. In its sixty bite-sized chapters, Dorret offers quirky and hilarious tidbits of illuminating facts, and also dispels long-held lingual misconceptions (no, Eskimos do not have 100 words for snow). Guaranteed to change the way you think about language, Lingo is a \"lively and insightful . . . unique, page-turning book\" (Minneapolis Star Tribune).",
  "genres": [
    "Nonfiction",
    "Language",
    "Linguistics",
    "History",
    "Travel",
    "Science",
    "Essays"
  ],
  "author": "Gaston Dorren",
  "average_rating": "3.92",
  "url": "https://www.goodreads.com/book/show/28046464-lingo"
}