{
  "title": "So Sexy So Soon: The New Sexualized Childhood, and What Parents Can Do to Protect Their Kids",
  "description": "Thong panties, padded bras, and risqué Halloween costumes for young girls. T-shirts that boast “Chick Magnet” for toddler boys. Sexy content on almost every television channel, as well as in books, movies, video games, and even cartoons. Hot young female pop stars wearing provocative clothing and dancing suggestively while singing songs with sexual and sometimes violent lyrics. These products are marketed aggressively to our children; these stars are held up for our young daughters to emulate–and for our sons to see as objects of desire.Popular culture and technology inundate our children with an onslaught of mixed messages at earlier ages than ever before. Corporations capitalize on this disturbing trend, and without the emotional sophistication to understand what they are doing and seeing, kids are getting into increasing trouble emotionally and socially; some may even to engage in precocious sexual behavior. Parents are left shaking their heads, wondering: How did this happen? What can we do?So Sexy So Soon is an invaluable and practical guide for parents who are fed up, confused, and even scared by what their kids–or their kids’ friends–do and say. Diane E. Levin, Ph.D., and Jean Kilbourne, Ed.D., internationally recognized experts in early childhood development and the impact of the media on children and teens, understand that saying no to commercial culture–TV, movies, toys, Internet access, and video games–isn’t a realistic or viable option for most families. Instead, they offer parents essential, age-appropriate strategies to counter the assault. For instance:• Help your children expand their imaginations by suggesting new ways for them to play with toys–for example, instead of “playing house” with dolls, they might send their toys on a backyard archeological adventure.• Counteract the narrow gender stereotypes in today’s media: ask your son to help you cook; get your daughter outside to play ball.• Share your values and concerns with other adults–relatives, parents of your children’s friends–and agree on how you’ll deal with TV and other media when your children are at one another’s houses.Filled with savvy suggestions, helpful sample dialogues, and poignant true stories from families dealing with these issues, So Sexy So Soon provides parents with the information, skills, and confidence they need to discuss sensitive topics openly and effectively so their kids can just be kids.From the Hardcover edition.",
  "genres": [
    "Parenting",
    "Nonfiction",
    "Psychology",
    "Sociology",
    "Feminism",
    "Gender",
    "Education"
  ],
  "author": "Diane E. Levin",
  "average_rating": "3.51",
  "url": "https://www.goodreads.com/book/show/2807292-so-sexy-so-soon"
}