{
  "title": "Yaser and Yasmeen: A Novel In Verse/ An Epic Poem",
  "description": "Yaser and his friends sacrificed their lives not only for love, but to redeem the whole world. There were no lengths they hadn't gone through to attain the needed goal of happiness. They had lost everything in their lives. After witnessing the whole world descend to darkness, they took it upon themselves to be saviors of humanity. Besides being a love story between Yaser and Yasmeen, it is also a tale of how four friends were able not only to inspire love into the Earth, but also to redeem the people of all layers of Hell into Heaven. By doing so, they've angered not only the police force on Earth, but also all the demons in the afterlife. The four friends went on massively crazy adventures, breaking rules whatever they were. They sought out pleasure despite boredom, and joy despite sorrow. Eventually, they formed a musical cult with odd rituals and customs. After spending much time in this cult, they eventually expanded it to spray paint slogans of love all throughout the city of Abu Dhabi, United Arab Emirates. An Excerpt: This Giant Mist And so the heralds of the world end up becoming dead When it is contained in the words they’ve sincerely said That they wished to appeal to God’s intentions up above It seems that they would be killed for preaching love And the world will always be disconnected without love, and so will there be unrest And even though all heralds of fate do try their best To promote this state of unity, amongst both sides It seems that such heralds would have surely died We’ve always had this side quest, to inspire ways to invoke upon the world construction Throughout the world, to avoid a world war three’s destruction Yet apathy prevails, when hope seems to never exist And so nothing will remove from the world this giant mist",
  "genres": [
    "Poetry"
  ],
  "author": "Saleh M. Radaideh",
  "average_rating": "4.68",
  "url": "https://www.goodreads.com/book/show/28080536-yaser-and-yasmeen"
}