{
  "title": "Taming Riki Vol 1, Part 2",
  "description": "Riki the Dark: proud, defiant, and unapologetically vulgar and rude. The angry mongrel has vowed to submit to no one, least of all his Master, the illustrious Iason Mink. What will it take to tame the notorious wild boy of Midas? After over a year and a half of discipline and training, Iason has still not managed to turn the heart of the infamous mongrel from the slums. Or has he? Note from the Author: Thank you to Rachel Livingston from DMP for permission to publish Taming Riki. Rieko Yoshihara and DMP retain the copyright for the original series Ai no Kusabi, which Kira highly recommends you read prior to, or in conjunction with, Taming Riki. This is not the same book as Ai no Kusabi, the original inspiration or idea for the series. The world and characters of Taming Riki are vastly different, and the book contains a Glossary of Terms and a Guide to Taming Riki to help you keep track of the characters. The book is also quite graphic. But this is more than just a smut novel; there is a story here. Part of the appeal and popularity of Taming Riki is its use of vivid descriptions and ability to make the world come alive. It will draw you into its world and you will not want to come back. PRINTING NOTE: These books are made available to you by a process called print on demand. Your book will be printed as soon as you order it and then delivered to you. Before, Taming Riki was only available at ridiculous prices like $100 on eBay. Now we are finally able to bring the series to you again in print at affordable prices. NOTE: This book is not intended for children. It contains adult content including intimate and graphic sexual encounters between males. It is of the genre called YAOI, which is especially popular with females, though is developing a following also among men. This book also includes elements of science fiction.",
  "genres": [
    "BDSM",
    "M M Romance",
    "Science Fiction",
    "Yaoi",
    "Abuse",
    "Erotica",
    "Manga"
  ],
  "author": "Kira Takenouchi",
  "average_rating": "4.31",
  "url": "https://www.goodreads.com/book/show/2807506-taming-riki-vol-1-part-2"
}