{
  "title": "Your Guide To Earth's Pivotal Years: A Direct Path To Enlightened Living",
  "description": "Earth’s Pivotal Years is a wonderful guide for anyone desiring a life of purpose during these unique times. The more who act upon the wisdom in this book, the faster we can create a peaceful and loving world – with people becoming agents of conscious evolution.” Barbara Marx Hubbard, author of Birth 2012 and Beyond The Earth is at a precipice; there is a sense of urgency about the world and our place in it. In Your Guide to Earth's Pivotal Years, author Selacia answers universal questions that are being asked about the future and our role. She addresses these times of great change, prophecies, our future, and the vital role of divine changemakers. Providing a big-picture view, Your Guide to Earth's Pivotal Years helps you accomplish the • Comprehend what the paradigm shift really means for you and everyone on Earth • Understand why this is the most important time you could be alive • Gain a new appreciation of Earth's pivotal years with your own take-action guide • Recognize the new, more heart-centered world in the making • Learn about those known as divine changemakers Through this process of discovery, you will find a new source of inspiration and courage for taking the next steps. Your Guide to Earth's Pivotal Years communicates practical tools for navigating change and advancing spiritually and describes specific options for powerfully creating a more light-filled world. This book has been endorsed by Barbara Marx Hubbard, author of Birth 2012 and “Earth’s Pivotal Years is a wonderful guide for anyone desiring a life of purpose during these unique times. The more who act upon the wisdom in this book, the faster we can create a peaceful and loving world – with people becoming agents of conscious evolution.”",
  "genres": [],
  "author": "Selacia",
  "average_rating": "3.92",
  "url": "https://www.goodreads.com/book/show/11770139-your-guide-to-earth-s-pivotal-years"
}