{
  "title": "Of Beards and Men: The Revealing History of Facial Hair",
  "description": "Beards—they’re all the rage these days. Take a look from hip urbanites to rustic outdoorsmen, well-groomed metrosexuals to post-season hockey players, facial hair is everywhere. The New York Times traces this hairy trend to Big Apple hipsters circa 2005 and reports that today some New Yorkers pay thousands of dollars for facial hair transplants to disguise patchy, juvenile beards. And in 2014, blogger Nicki Daniels excoriated bearded hipsters for turning a symbol of manliness and power into a flimsy fashion statement. The beard, she said, has turned into the padded bra of masculinity.Of Beards and Men makes the case that today’s bearded renaissance is part of a centuries-long cycle in which facial hairstyles have varied in response to changing ideals of masculinity. Christopher Oldstone-Moore explains that the clean-shaven face has been the default style throughout Western history—see Alexander the Great’s beardless face, for example, as the Greek heroic ideal. But the primacy of razors has been challenged over the years by four great bearded movements, beginning with Hadrian in the second century and stretching to today’s bristled resurgence. The clean-shaven face today, Oldstone-Moore says, has come to signify a virtuous and sociable man, whereas the beard marks someone as self-reliant and unconventional. History, then, has established specific meanings for facial hair, which both inspire and constrain a man’s choices in how he presents himself to the world.This fascinating and erudite history of facial hair cracks the masculine hair code, shedding light on the choices men make as they shape the hair on their faces. Oldstone-Moore adeptly lays to rest common misperceptions about beards and vividly illustrates the connection between grooming, identity, culture, and masculinity. To a surprising degree, we find, the history of men is written on their faces.",
  "genres": [
    "History",
    "Nonfiction",
    "Gender Studies",
    "Gender",
    "Sociology"
  ],
  "author": "Christopher Oldstone-Moore",
  "average_rating": "3.64",
  "url": "https://www.goodreads.com/book/show/28093708-of-beards-and-men"
}