{
  "title": "Sway",
  "description": "Evening Murray has worked hard her whole life and never minded being alone. Now, she's finally reached her goal with a position in the British Security Service's ultra-secret Department. Eve has always been interested in behind-the-scenes power and sway, and with her job in The Department she can truly make a difference. There's only one problem: She's completely fallen for her boss.  Ronan Blackwood is beyond brilliant, influential, mysterious, and devastatingly gorgeous. He's also distant, perfectly polite, controlled, and cold. Eve longs to find out what goes on behind his frosty blue eyes and what lies beneath his wintry exterior. It's all she can do to hide how badly she wants him, day in and day out.  When shots are fired during a daring attack, Ronan and Eve follow protocol and flee to an isolated safe house. There, Eve's iron will deserts her, and the two share a passion beyond her wildest dreams (which is saying something!) Eve begins to see a side of Ronan she never imagined existed, sensual, thoughtful, and unbelievably sexual. Being with Ronan awakens her, makes her feel alive, makes her giddy with desire, and all she wants is more.  But the road ahead for these two will not be easy. Not everyone is happy that Eve is spending time with the boss, and one of the other Department agent's jealousy swiftly turns poisonous, exposing Eve to grave danger. While the connection between Ronan and Eve grows ever hotter and stronger, Ronan realizes he will do anything to protect Eve and the feelings he is developing for her. But becoming closer to her means he must reveal the terrible secret that he harbors, a secret which will change both of their lives forever and threatens to tear them apart…  Sway is intended for Mature Audiences, 18+  Sway is an exciting, thrilling, sexy love story with a paranormal twist, featuring an intriguing alpha male hero and plucky, irreverent heroine who can't believe she could get this lucky...  Sway is currently a standalone novel, containing an entire story arc, and does not end in a cliff hanger! Instead of waiting for sequels you are getting the whole story in one volume, for one price. Although the main characters have hinted that they may need the author to write more of their adventures in the future, Sway is an entire story in one book.  \"Extremely detailed and incredibly erotic, Sway will leave you breathless\"",
  "genres": [
    "Romance",
    "Erotica",
    "Paranormal"
  ],
  "author": "Katherine Savage",
  "average_rating": "3.70",
  "url": "https://www.goodreads.com/book/show/28095490-sway"
}