{
  "title": "Red Dirt Christmas",
  "description": "Travis had been here at Sutton Station for just over a year. We were technically engaged, not that we’d told anyone. He was happy just knowin’ I’d said yes, and I had some head-clearin’ stuff to work through. Knowing I was good enough for Trav was one thing, but knowing if I was good enough to be a husband and father was somethin’ else entirely.Life at Sutton Station had never been better. Business was strong, Trudy and Bacon’s little baby, Gracie, was a few weeks old now and as cute as a button, Ma’s health was good, and my relationship with Laura and Sam was in a pretty good place. And Travis? Well, life with him was still all kinds of perfect.But, to Travis’s dismay, Christmas at the Station was just another day. Another day of getting up before the sun, feeding animals, fixin’ what needed fixin’, and checking water troughs all while tryin’ to keep out of the blistering heat.And this year weren’t much different. Only that it was Travis’s first Sutton Station Christmas. The fact we didn’t go all out with decorations and celebrations baffled him, and if I was bein’ truthful, it disappointed him too.Which was why I had to make it a special kind of Christmas…NOTE FROM THE AUTHOR:This book uses Australian English spelling and grammar. There will be words like brumbies (wild horses) Macca’s (McDonald’s) and a serious lack of g’s on most ing words. There are also run-on hyphenated sentences. It’s just how Charlie speaks.TIMELINE ACKNOWLEDGMENT:(beware of spoilers for book 4 below!)Anyone familiar with the Red Dirt Heart series, will know it spans the seasons. In RDH1 when Travis arrives, it’s summer, RDH2 is autumn/winter, RDH3 is spring and RDH4, being Trav’s pov, is back to summer and spans another year. Christmas in Australia is in summer, so according to the actual timeline of the series, Travis’ first Christmas falls between RDH3 and RDH4, though it is not mentioned.So, like a small snippet of something that didn’t technically happen, this Christmas story is of Travis’ first Christmas at Sutton Station, therefore falls between books 3 and 4. They’re not married, there’s no Milly.A small reminder of where the storyline was up to… Travis has asked Charlie to marry him, but they’ve not told anyone yet. Trudy and Bacon have just had their first baby, Gracie, and Nugget still steals every scene he’s in.",
  "genres": [
    "M M Romance",
    "Romance",
    "Christmas",
    "Contemporary",
    "Holiday",
    "Westerns",
    "LGBT"
  ],
  "author": "N.R. Walker",
  "average_rating": "4.37",
  "url": "https://www.goodreads.com/book/show/28096177-red-dirt-christmas"
}