{
  "title": "Poe's Children: The New Horror",
  "description": "From the incomparable master of horror and suspense comes an electrifying collection of contemporary literary horror, with stories from twenty-five writers representing today’s most talented voices in the genre.\n\nHorror writing is usually associated with formulaic gore, but New Wave horror writers have more in common with the wildly inventive, evocative spookiness of Edgar Allan Poe than with the sometimes-predictable hallmarks of their peers. Showcasing this cutting-edge talent, Poe’s Children now brings the best of the genre’s stories to a wider audience. Featuring tales from such writers as Neil Gaiman and Jonathan Carroll, Poe’s Children is Peter Straub’s tribute to the imaginative power of storytelling. Each previously published story has been selected by Straub to represent what he thinks is the most interesting development in our literature during the last two decades.Selections range from the early Stephen King psychological thriller “The Ballad of the Flexible Bullet,” in which an editor confronts an author’s belief that his typewriter is inhabited by supernatural creatures, to “The Man on the Ceiling,” Melanie and Steve Rasnic Tem’s award-winning surreal tale of night terrors, woven with daylight fears that haunt a family. Other selections include National Book Award finalist Dan Chaon’s “The Bees”; Peter Straub’s “Little Red’s Tango,” the legend of a music aficionado whose past is as mysterious as the ghostly visitors to his Manhattan apartment; Elizabeth Hand’s visionary and shocking “Cleopatra Brimstone”; Thomas Ligotti’s brilliant, mind-stretching “Notes on the Writing of Horror: A Story”; and “Body,” Brian Evenson’s disturbing twist on correctional facilities.Crossing boundaries and packed with imaginative chills, Poe’s Children bears all the telltale signs of fearless, addictive fiction.",
  "genres": [
    "Horror",
    "Short Stories",
    "Fiction",
    "Anthologies",
    "Fantasy",
    "Short Story Collection",
    "Gothic"
  ],
  "author": "Peter Straub",
  "average_rating": "3.43",
  "url": "https://www.goodreads.com/book/show/2808929-poe-s-children"
}