{
  "title": "Uninhibited: The Complete Series",
  "description": "The Complete Series  Inhibitions, Unrestricted, and Freed all bundled together with bonus chapters and a sneak peak at Fallacy, book one in Quinn and Alex's story.  Inhibitions  In the last six months, Ashley’s life has been one disappointment after another. She walked in on her boyfriend with another woman, leaving her needing a new place to live and a mountain of debt. As if that wasn’t enough, her ex convinces her that his infidelity is her fault for being unadventurous in bed. Deep down Ashley has always had the desire to be wild but has been held back by her own insecurities. She’s desperate to break free, but she's fearful of how people will judge her if they know her inner desires. She wants nothing more than to lose herself in sex that pushes her to the limit, but she hasn’t found anyone she trusts enough to take her there until she meets Tanner. Tanner doesn’t trust anyone outside of his inner circle easily. The infamous, media proclaimed playboy, quarterback is tired of people using him for money, connections and to get their fifteen minutes of fame. Determined to protect his image and himself, he makes sure to keep most people at arm’s length until Ashley is thrown into his life. He’s inexplicably drawn to her, and she needs his help in more than ways than one. But to help her, he’ll need to let her in. There’s an immediate attraction and connection that neither can deny, but can both of them get past their inhibitions and find what they are looking for in each other or will everything backfire in their faces?  Unrestricted  The Earning forgiveness isn’t easy. Especially when you can’t forgive yourself. How do you begin to right your wrongs? What do you do when you realize you love someone, but you’ve already pushed them away? What happens when one foolish decision alters your entire world forever? How can love recover after devastating heartbreak and betrayal? What happens when everything becomes unrestricted?   An UnInhibited Novella  The road to happily ever after hasn't been easy for the Garrisons. Blissfully married with a baby on the way, this should be the happiest time in their lives. Except, Ashley can't fully escape the dark shadows of their past. Will Ashley and Tanner be forced to endure more heartache or will they finally be freed?",
  "genres": [
    "Romance",
    "Sports"
  ],
  "author": "Kimberly Bracco",
  "average_rating": "4.36",
  "url": "https://www.goodreads.com/book/show/28097544-uninhibited"
}