{
  "title": "The Raven Mocker",
  "description": "Something evil has awakened beneath a forgotten ravine in the Great Smoky Mountains. After lying in peace for centuries, an ancient deity watches….David and Miriam Hobbs celebrate their fifteenth anniversary in Gatlinburg, unaware that a violent wraith, Allie Mae, will follow them home on a determined quest for vengeance. After surviving this harrowing experience, David’s new friend, John Running Deer, unwittingly aids the desecration of an ancient burial site while recovering Allie Mae’s remains from a sacred Cades Cove ravine.What John hoped would be the final gesture of peace in giving her a proper burial turns out to be a terrible mistake. Now something much worse than Allie Mae is on the loose. Teutates, the ancient Gallic entity unearthed, sets out on a murderous rampage. David is called upon once more to find a way to stop the angry demon before it leaves a trail of bloodshed from Denver to the sacred ancient hills of Tennessee.Acclaim for Aiden “Aiden James has written a deeply psychological, gripping tale that keeps the readers hooked from page one.”—Bookfinds review for THE FORGOTTEN EDEN“Not only is Aiden James a storyteller par excellence, but his material for his story is riveting.”—Huntress Reviews“The hook to this excellent suspense thriller is the twists that will keep readers wondering what is going on as nothing is quite what it seems. Adding to the excitement is that the audience will wonder whether the terror is an evil supernatural creature or an amoral human…Aiden James provides a dark thriller that grips fans from the opening.”—Harriet Klausner, Amazon’s #1 book reviewer for THE FORGOTTEN EDEN“Aiden James writing style flows very easily and I found that CADES COVE snowballed into a very gripping tale. Clearly the strengths in the piece were as the spirit's interaction became prevalent with the family… The Indian lore and ceremonies and the flashbacks to Allie Mae's (earthly) demise were very powerful. I think those aspects separated the work from what we've seen before in horror and ghost tales.”—Evelyn Klebert, author of A GHOST OF A CHANCE and DRAGONFLIES“Aiden James is insanely talented!”—J.R. Rain, author of MOON DANCE and THE BODY DEPARTED",
  "genres": [
    "Horror",
    "Paranormal",
    "Thriller",
    "Fiction",
    "Amazon",
    "Fantasy",
    "Supernatural"
  ],
  "author": "Aiden James",
  "average_rating": "3.86",
  "url": "https://www.goodreads.com/book/show/10188101-the-raven-mocker"
}