{
  "title": "Alternative 3: The 1978 Cult Sci-Fi Classic Republished with New Material",
  "description": "Truth, they say, is stranger than fiction and so it is with Alternative 3.  A television documentary broadcast nearly 40 years ago followed by the book Alternative 3 - a book so many wanted suppressed. The programme revealed that Earth was doomed, mankind faced destruction - Mass panic followed. The evidence....  The world was overheating - but no one had heard of global warming!   Strange weather patterns, floods, crops withering in the parched earth.   Scientists mysteriously vanishing.   Reports of kidnapping and brainwashing.   Russian and American, locked in a cold war on earth, were co-operating in space.   The programme never transmitted in Russia or America. Was is banned on political orders!   Strange activity on the moon.   Conspiracy theories abounded.  And then, the spin doctors went to work. Alternative 3 was described as a hoax, an April Fool's joke - the author savaged as a scare-mongering fantasist. Newspapers joined the attack. American author, Jim Keith, wrote two books to prove Alternative 3 was a fraud. And so the story ended. But did it?...  Alternative 3 revealed a conspiracy so fantastic it was easy to refute. But four decades later facts the author exposed have proven to be true.   Global warming is accepted as happening. Presidents Obama and Putin have met to discuss climate change.   Scientists continue to disappear.   In 2010 nearly 7000,000 people simply vanished in the USA but worse was to come. The number has increased to 900,000 in 2013.   Today, Russian and American are sharing space technology at an ever increasing rate. Despite the huge advances, no manned moon landings have been made public since Apollo17 in 1972.   After announcing to the world that Alternative 3 was not true, the author wrote, \"I have reason to suppose that my home telephone was being tapped and my contacts who were experienced in such matters were convinced that certain intelligence agencies considered that I probably knew too much.\" By then he'd emigrated to the far side of the world, moving between several continents.  Republished four decades later Alternative 3 is a detective story revealing a terrifying conspiracy. But is it true? Did a veteran newspaper journalist with years of experience have such a vivid imagination or was he got at, forced to disclaim the truth that is Alternative 3.  Download Alternative 3 today and learn the truth about the conspiracy.",
  "genres": [
    "Science Fiction",
    "Conspiracy Theories",
    "Fiction"
  ],
  "author": "Leslie Watkins",
  "average_rating": "3.81",
  "url": "https://www.goodreads.com/book/show/28098643-alternative-3"
}