{
  "title": "Bukowski in a Sundress: Confessions from a Writing Life",
  "description": "“Somewhere between Jo Ann Beard’s  The Boys of My Youth  and Amy Schumer’s stand-up exists Kim Addonizio’s style of storytelling . . . at once biting and vulnerable, nostalgic without ever veering off into sentimentality.”  —Refinery29“Always vital, clever, and seductive, Addonizio is a secular Anne Lamott, a spiritual aunt to Lena Dunham.”  — BooklistA dazzling, edgy, laugh-out-loud memoir from the award-winning poet and novelist that reflects on writing, drinking, dating, and more Kim Addonizio is used to being exposed. As a writer of provocative poems and stories, she has encountered success along with one critic dismissed her as “Charles Bukowski in a sundress.” (“Why not Walt Whitman in a sparkly tutu?” she muses.) Now, in this utterly original memoir in essays, she opens up to chronicle the joys and indignities in the life of a writer wandering through middle age.              Addonizio vividly captures moments of inspiration at the writing desk (or bed) and adventures on the road—from a champagne-and-vodka-fueled one-night stand at a writing conference to sparsely attended readings at remote Midwestern colleges. Her crackling, unfiltered wit brings colorful life to pieces like “What Writers Do All Day,” “How to Fall for a Younger Man,” and “Necrophilia” (that is, sexual attraction to men who are dead inside). And she turns a tender yet still comic eye to her her father, who sparked her love of poetry; her mother, a former tennis champion who struggled through Parkinson’s at the end of her life; and her daughter, who at a young age chanced upon some erotica she had written for  Penthouse . At once intimate and outrageous, Addonizio’s memoir radiates all the wit and heartbreak and ever-sexy grittiness that her fans have come to love—and that new readers will not soon forget.",
  "genres": [
    "Memoir",
    "Nonfiction",
    "Essays",
    "Writing",
    "Poetry",
    "Biography",
    "Books About Books"
  ],
  "author": "Kim Addonizio",
  "average_rating": "3.91",
  "url": "https://www.goodreads.com/book/show/28110067-bukowski-in-a-sundress"
}