{
  "title": "The City Baker's Guide to Country Living",
  "description": "A full-hearted novel about a big-city baker who discovers the true meaning of home—and that sometimes the best things are found when you didn’t even know you were lookingWhen Olivia Rawlings—pastry chef extraordinaire for an exclusive Boston dinner club—sets not just her flambéed dessert but the entire building alight, she escapes to the most comforting place she can think of—the idyllic town of Guthrie, Vermont, home of Bag Balm, the country’s longest-running contra dance, and her best friend Hannah. But the getaway turns into something more lasting when Margaret Hurley, the cantankerous, sweater-set-wearing owner of the Sugar Maple Inn, offers Livvy a job. Broke and knowing that her days at the club are numbered, Livvy accepts.Livvy moves with her larger-than-life, uberenthusiastic dog, Salty, into a sugarhouse on the inn’s property and begins creating her mouthwatering desserts for the residents of Guthrie. She soon uncovers the real reason she has been hired—to help Margaret reclaim the inn’s blue ribbon status at the annual county fair apple pie contest.With the joys of a fragrant kitchen, the sound of banjos and fiddles being tuned in a barn, and the crisp scent of the orchard just outside the front door, Livvy soon finds herself immersed in small town life. And when she meets Martin McCracken, the Guthrie native who has returned from Seattle to tend his ailing father, Livvy comes to understand that she may not be as alone in this world as she once thought.But then another new arrival takes the community by surprise, and Livvy must decide whether to do what she does best and flee—or stay and finally discover what it means to belong. Olivia Rawlings may finally find out that the life you want may not be the one you expected—it could be even better.",
  "genres": [
    "Fiction",
    "Romance",
    "Chick Lit",
    "Contemporary",
    "Christmas",
    "Food",
    "Audiobook"
  ],
  "author": "Louise  Miller",
  "average_rating": "3.78",
  "url": "https://www.goodreads.com/book/show/28110139-the-city-baker-s-guide-to-country-living"
}