{
  "title": "The Mannings: The Fall and Rise of a Football Family",
  "description": "NEW YORK TIMES BESTSELLER • From Lars Anderson comes a revealing portrait of the first family of American sports. What the Kennedys are to politics, the Mannings are to football. Two generations have produced three NFL Archie Manning, the Ole Miss hero–turned–New Orleans Saint; his son Peyton, widely considered one of the greatest quarterbacks ever to play the game; and Peyton’s younger brother, Eli, who won two Super Bowl rings of his own. And the oldest Manning child, Cooper—who was forced to quit playing sports after he was diagnosed at age eighteen with a rare spinal condition—might have been the most talented of them all. In The Mannings, longtime Sports Illustrated writer Lars Anderson gives us, for the first time, the never-before-told story of this singular athletic dynasty—a story that shows us how finding strength in the face of catastrophe can be the key to success on and off the playing field.   Growing up, the three Manning brothers dream of playing side by side on the gridiron at Ole Miss. But with Cooper forced to the bench before his prime, Peyton must fight to win glory for them both. Meanwhile, Eli is challenged by his college coach to stop trailing in the footsteps of others and forge his own path. With Archie’s achievements looming over them, the brothers begin the climb to football history. From the Manning family backyard to the bright lights of Super Bowl 50, The Mannings is an epic, inspiring saga of a family of tenacious competitors who have transfixed a nation.Praise for The Mannings“Anderson, an accomplished storyteller, writes about the Manning football legacy—warts and all—with style and verve, backed by an abundance of research and scholarship.” — Publishers Weekly“An expertly written impressionistic account of the first family of football.” — Library Journal“This is one of the most beautifully written and memorable books I’ve read in years—stunningly spectacular. I couldn’t put it down. Once again, Lars Anderson has shown why he is one of the seminal sportswriters of this generation. The Mannings is an absolute masterpiece.” —Paul Finebaum, ESPN college football analyst and New York Times bestselling author of My Conference Can Beat Your Conference “Lars Anderson drills to the core of the Manning family. I love this book because it’s not just about football; it’s about how to raise a family.” —Bruce Arians, head coach of the Arizona Cardinals “Anderson’s yarn never wobbles. . . . A winner for fans of modern football.” — Kirkus Reviews“Anyone who has paid attention to the NFL over the last five decades understands the significance of the Mannings. They are to America’s best-loved game what the Holbeins are to portraiture, what the Bachs are to classical music, what the Kardashians are to mindless reality television, an unsurpassed dynasty. In  The Mannings,  Lars Anderson delivers an incisive, honest, and thorough chronicle of the first family of football.” —Jeremy Schaap,  New York Times  bestselling author of  The Untold Story of Jesse Owens and Hitler’s Olympics",
  "genres": [
    "Sports",
    "Football",
    "Nonfiction",
    "Biography",
    "Audiobook",
    "Memoir",
    "Biography Memoir"
  ],
  "author": "Lars Anderson",
  "average_rating": "4.02",
  "url": "https://www.goodreads.com/book/show/28109878-the-mannings"
}