{
  "title": "Pull Me Under",
  "description": "Elle 's 33 Best Books of the YearA Searing Debut Novel from One of the Most Imaginative Minds in Fiction Chizuru Akitani is the twelve-year-old daughter of the famous violinist and Japanese “Living National Treasure” Hiro Akitani. Overweight and hafu (her mother is white), she is tormented by her classmates and targeted by the most relentless bully of them all, Tomoya Yu. When Chizuru’s mother dies suddenly her father offers her no comfort and she is left feeling alone and unmoored. At school, her bully’s cruelty intensifies, and in a moment of blind rage, Chizuru grabs a Morimoto letter opener from her teacher’s desk and fatally stabs Tomoya Yu in the neck. For the next seven years, Chizuru is institutionalized. Her father visits her just twice before ultimately disowning her. Upon release, Chizuru flees Japan for a new identity and life in the United States. Determined to outrun her murderous past, she renames herself Rio, graduates from nursing school, marries a loving man, and soon has a daughter. But when a mysterious package arrives on her doorstep in Boulder, Colorado, announcing the death of her father, Rio feels compelled to return to Japan for the first time in twenty years, leaving her husband and her daughter confused and bereft. Going back to her homeland, and to the scene of her complicated past, feels like stepping into a strange and familiar dream. When she unexpectedly reconnects with Miss Danny, who had been her beloved teacher at the time of the stabbing, long-kept secrets are unearthed, forcing Rio to confront her past in ways she never imagined, and to decide if she will reveal to her family who she once was. Full of atmospheric and illuminating descriptions of Japan and its culture, Pull Me Under is an affecting exploration of home, identity, and the limits of forgiveness. Kelly Luce has written a bold and psychologically complex first novel that grips and dazzles from start to finish.",
  "genres": [
    "Fiction",
    "Contemporary",
    "Japan",
    "Literary Fiction",
    "Asia",
    "Adult",
    "Adult Fiction"
  ],
  "author": "Kelly Luce",
  "average_rating": "3.57",
  "url": "https://www.goodreads.com/book/show/28116773-pull-me-under"
}