{
  "title": "The Peculiar Miracles of Antoinette Martin",
  "description": "In the spirit of Vanessa Diffenbaugh’s The Language of Flowers--and with a touch of the magical--The Peculiar Miracles of Antoinette Martin is a spellbinding debut about a wondrously gifted child and the family that she helps to heal.   Sisters Rose and Lily Martin were inseparable when growing up on their family’s Kentucky flower farm yet became distant as adults when Lily found herself unable to deal with the demands of Rose’s unusual daughter. But when Rose becomes ill, Lily is forced to return to the farm and to confront the fears that had driven her away. Rose’s daughter, ten-year-old Antoinette, has a form of autism that requires constant care and attention. She has never spoken a word, but she has a powerful gift that others would give anything to harness--she can heal with her touch. She brings wilted flowers back to life, makes a neighbor’s tremors disappear, and even changes the course of nature on the flower farm. Antoinette’s gift, though, comes at a price, since each healing puts her own life in jeopardy. As Rose--the center of her daughter’s life--struggles with her own failing health and Lily confronts her anguished past, the sisters, and the men who love them, come to realize the sacrifices that must be made to keep this very special child safe. Written with great heart and a deep understanding of what it feels like to be different, The Peculiar Miracles of Antoinette Martin is a novel about what it means to be family and about the lengths to which people will go to protect the ones they love. “This is the kind of book that invites you home, sits you down at the kitchen table, and feeds you something delicious and homemade. You will want to stay in this world where new relationships bloom out of broken ones, sisters find one another again, and miracles really do occur.” —Tiffany Baker",
  "genres": [
    "Fiction",
    "Magical Realism",
    "Fantasy",
    "Contemporary",
    "Historical Fiction",
    "Book Club",
    "Adult"
  ],
  "author": "Stephanie Knipper",
  "average_rating": "3.93",
  "url": "https://www.goodreads.com/book/show/28110864-the-peculiar-miracles-of-antoinette-martin"
}