{
  "title": "His Favorite Color Is Blood: Coffin Nails MC",
  "description": "--- When life gives you blood, make mayhem. ---Grim. Assassin. Leather-clad sex god. Has the most unusual taste in men.Misha. Mutilated. Afraid. Will never trust again.Grim is a bloodthirsty killer, and he owns it. Gay in a world of outlaw bikers, he firmly stands his ground if anyone dares to cross him. He takes pleasure in showing homophobes their place and fucking his way through a life of carnage. But there is a part of him always aching for something he cannot get. When by chance he saves the most perfect guy he’s ever met, he is not about to let him go. Even if it means he needs to smother his broken bird.When a masked, bloodstained man rescues Misha from captivity, he doesn’t know if he should thank the menacing stranger or stab him and run. Grim is not the kind of man who takes no for an answer, and Misha might now be in more danger than when he was trapped as a sex slave.Misha cannot deny though that Grim is as alluring as he is frightening, and once Misha realizes what power his body holds over Grim, he understands that taming the beast of a man could be within his reach. But any possibility of a future together is like a house of cards when Zero, the sadistic crime lord who destroyed Misha’s life, sets out to get him back.Will the ruthless biker assassin at Misha’s side be enough to conquer the monsters from his past?POSSIBLE SPOILERS:Themes: Outlaw motorcycle club, organized crime, assassin, chase, disability (amputee), devotee, revenge, redemption, kidnapping, road trip, fear, hurt/comfort, past abuseGenre: M/M dark erotic romance, thrillerLength: ~110,000 words (STANDALONE novel)WARNING: This book contains adult content that might be considered taboo. Strong language, violence and torture. Reader discretion advised.",
  "genres": [
    "M M Romance",
    "Dark",
    "Disability",
    "Romance",
    "Contemporary",
    "Abuse",
    "Dark Romance"
  ],
  "author": "K.A. Merikan",
  "average_rating": "3.95",
  "url": "https://www.goodreads.com/book/show/28111327-his-favorite-color-is-blood"
}