{
  "title": "Copping A Lot Of Sin",
  "description": "Sequel to Get Off My CaseCan be read as standaloneSin's life was totally turned upside down when he learned about the existence of shifters and Fated Mates just six months before. That was when he met and fell head over heals in lust, and then love, with a young wolf shifter named Ben. In the six months that followed he moved house, and now shares his life with the small Stockton pack, and his bed with Ben. He thinks things are going well. That is until his Alpha tells him that Ben is having problems and apparently Sin is to blame.Ben is unhappy, but it's not something he can talk to Sin about. He tried once, and got shot down, big time. He adores the man, loves him more than life but Sin is human and a rampant Dominant. While Sin confines his dominance to the bedroom, outside of it both men are too busy living normal everyday lives to actually talk about what is going with their mating. Ben's struggling to keep his wolf under control- his wolf that wants to claim Sin in the way of his kind. But unless Sin changes his ways, Ben might be reduced to taking drastic measures. He's certainly thinking about it.With a claiming night that has unexpected repercussions, a serial killer on the lose that smells like a bear and who is targeting young men who look just like Ben, life starts to get more complicated. A random meeting with Gabriel brings even more surprises to both Sin and Ben - and neither of them are quite sure how to cope with the sexy man.A wedding to plan, a killer to find, a bear in a wolf pack? What is going on in the Stockton pack and will Sin, Ben and Gabriel stay alive long enough to explore their own budding relationship? This book is a ménage (M/M/M) and contains coarse language, sexually explicit scenes between men and some violence. This is a complete story with no cliff-hangers, although a teaser for the next book is mentioned in the epilogue. As with all of my books an HEA is guaranteed.",
  "genres": [
    "M M Romance",
    "Shapeshifters",
    "Paranormal",
    "Menage",
    "Romance",
    "M M M",
    "Audiobook"
  ],
  "author": "Lisa Oliver",
  "average_rating": "4.12",
  "url": "https://www.goodreads.com/book/show/28111415-copping-a-lot-of-sin"
}