{
  "title": "Virtual Horrors: Ingress",
  "description": "The book Virtual Horrors is composed of five short stories:Virtual Nightmares (Deadly Treatments)A new virtual system is created to tap into people’s minds as they sleep and provide them with virtual dreams sporadically or as part of a specified program designed by dream therapy specialist working for Virtual Realities Inc. Four professionals participate in the program as part of their work development programs to make them more creative. The further they delve into the alternative reality however they soon find their dreams starting to manifest in their real lives, as more and more strange events occur, they soon find they are being hunted by an entity called The Glitch that can manipulate reality, virtual reality and consciousness as they slip into a nightmarish existence.Virtual Death (Death Test)Five medical students obsessed with exploring death, participate on a program to explore death through a virtual reality program that allows them to experience smell, touch and pain. They explore different types of deaths so they can better assist dying patients and delve in and out of a fictitious afterlife, but when they suddenly start to die in real life through various accidents and health conditions, they have to fight for survival as their lives start to mimic in reality the virtual deaths they have explored. The horrifying parallels to their existence, that are the direct result of their experimentation, starts to put their lives in jeopardy as they meet their past, present and futures in traumatic and terrifying scenario's. A shadowy figure in the background called The Glitch is somehow also woven into their deaths as they attempt to battle a predator, they have absolutely no comprehension off.Deadly Memories (Remember to Forget)A virtual reality consultant forms a new technology providing clients with memory therapy through virtual reality. However he soon realizes fixing people is not as simple as fixing technology issues. As logic battles with emotion he tries to find a pragmatic approach to heal some of his clients and restore his faith in himself.The situation is further complicated when some of his clients start to suddenly die in real life in strange, inexplicable circumstances and as he struggles to overcome their problematic histories he ventures into unfamiliar territory as he grapples with a mysterious, illusive, predatory foe known only as The Glitch.Fatal Futures (All Roads Lead to Doom)The two men develop a predictive virtual environment with the help of a tarot card reader/fortune teller that allows users to live their future virtually, before it actually manifests in real life. Five young college students decide to gamble with their futures and try it out and as they negotiate their participation they are also given the chance to trade futures with each other and change their destinies. At first the results are amazingly pleasing but as strange things start to happen, they begin to realize a strange entity called The Glitch, is tracking each of them in the real world and attempting to end the futures they are attempting to enjoy.Time Tour Trap (Catch Them Kill Them)Three eager explorers take part in a virtual time tour, which allows them to revisit points in time in history and participate in events that have occurred. Problems start to arise however as they realize they can no longer return to the present and as they leap around the past attempting to find a way out, a mysterious presence called The Glitch starts to hunt them down.Horrific Intentions Breed Horrific Results!The second book which is planned for the future will integrate the stories of the surviving protagonists as they join forces to fight the Glitch.",
  "genres": [],
  "author": "Jill Thrussell",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/28115067-virtual-horrors"
}