{
  "title": "Dragonfire Dreams",
  "description": "FAST TIMES, FIERY LIVES… Peter Skyler and his indie rock band are about to begin the biggest gig of their career when a gunman bursts into the club and lets loose with a pistol. It is Skyler’s girlfriend, Shannon Youngblood, who is almost killed when the bullets go flying. She too is the one to make headlines after a clip of the shooting takes news shows by storm. When a self-styled “shock artist” subsequently edits the clip, sets it to music and gives it an overtly erotic twist, the video goes viral over the Internet, becoming a YouTube sensation and an utter nightmare for the striking beauty.FATES STRANGELY ENTANGLED… What happens next stuns everyone, for a man in New York City begins to copycat the violent episode. When he inadvertently kills two people, his grisly misdeed sparks a police manhunt of epic proportions. As he subsequently eludes his pursuers, the unrepentant figure brashly reinvents himself as a self-styled shock artist too, calling himself “Vlad the Imp” and enthralling people all around the planet with his “stunt punk gun fun” as the police manhunt heats up to an absolutely feverish pitch. Finally, with the whole world hanging on his every move, the increasingly psychotic felon perpetrates a series of devious exploits meant to ensure his criminal notoriety forever, including a blasphemous sacrilegious act intended to insult the God that he feels has abandoned him. To that end, he succeeds in cleverly outfoxing the police and making off with Shannon, the woman of his dreams, for a sizzling night of passion to which she must submit or else…♠ ♠ ♠ ♠ ♠“DRAGONFIRE DREAMS is a rocking, rolling, esoteric thunderfest of myth, magic, murder and mayhem. In this psychological thriller, Wayne Saalman delivers an exotic mix of searing emotional fiction which makes for a spellbinding page-turner with a demonic character that is entirely believable: tortured, dark, a truly disturbing portrait that at times made the hair stand up at the back of my neck. The tale is not only about malevolence and horror, however, for around this bitter, evil figure, the author weaves in an exhilarating cross country road trip that pays homage to Kerouac and the Beats, and brings with it some steamy escapades and uplifting laughs, as well as a serious quest for enlightenment, not only through the ancient Hermetic wisdom traditions, but also through the myriad religious and socio-political movements of the globalist power-brokers who have shaped our modern world. Reader, put on your thinking cap, strap yourself in and prepare to tame a T-bird for the ride of your life.”– Michael HayesAuthor of The Hermetic Code in DNA",
  "genres": [],
  "author": "Wayne Saalman",
  "average_rating": "4.33",
  "url": "https://www.goodreads.com/book/show/28111068-dragonfire-dreams"
}