{
  "title": "Dust Bowl Girls: The Inspiring Story of the Team That Barnstormed Its Way to Basketball Glory",
  "description": "A thrilling, cinematic story. I loved every minute I spent with these bold, daring women whose remarkable journey is the stuff of American legend. Karen Abbott, New York Times bestselling author of Liar, Temptress, Soldier, Spy The Boys in the Boat meets A League of Their Own in this true story of a Depression-era championship women s team. In the early 1930s, during the worst drought and financial depression in American history, Sam Babb began to dream. Like so many others, this charismatic Midwestern basketball coach wanted a reason to have hope. Traveling from farm to farm near the tiny Oklahoma college where he coached, Babb recruited talented, hardworking young women and offered them a chance at a better life: a free college education in exchange for playing on his basketball team, the Cardinals.  Despite their fears of leaving home and the sacrifices that their families would face, the women joined the team. And as Babb coached the Cardinals, something extraordinary happened. These remarkable athletes found a passion for the game and a heartfelt loyalty to one another and their coach--and they began to win. Combining exhilarating sports writing and exceptional storytelling, Dust Bowl Girls takes readers on the Cardinals intense, improbable journey all the way to an epic showdown with the prevailing national champions, helmed by the legendary Babe Didrikson. Lydia Reeder captures a moment in history when female athletes faced intense scrutiny from influential figures in politics, education, and medicine who denounced women s sports as unhealthy and unladylike. At a time when a struggling nation was hungry for inspiration, this unlikely group of trailblazers achieved much more than a championship season.\"",
  "genres": [
    "Nonfiction",
    "History",
    "Sports",
    "Book Club",
    "Biography",
    "Basketball",
    "Audiobook"
  ],
  "author": "Lydia Reeder",
  "average_rating": "3.76",
  "url": "https://www.goodreads.com/book/show/28110849-dust-bowl-girls"
}