{
  "title": "Cannibalism: A Perfectly Natural History",
  "description": "For centuries scientists have written off cannibalism as a bizarre phenomenon with little biological significance. Its presence in nature was dismissed as a desperate response to starvation or other life-threatening circumstances, and few spent time studying it. A taboo subject in our culture, the behavior was portrayed mostly through horror movies or tabloids sensationalizing the crimes of real-life flesh-eaters. But the true nature of cannibalism--the role it plays in evolution as well as human history--is even more intriguing (and more normal) than the misconceptions we've come to accept as fact. In Cannibalism: A Perfectly Natural History, zoologist Bill Schutt sets the record straight, debunking common myths and investigating our new understanding of cannibalism's role in biology, anthropology, and history in the most fascinating account yet written on this complex topic. Schutt takes readers from Arizona's Chiricahua Mountains, where he wades through ponds full of tadpoles devouring their siblings, to the Sierra Nevadas, where he joins researchers who are shedding new light on what happened to the Donner Party--the most infamous episode of cannibalism in American history. He even meets with an expert on the preparation and consumption of human placenta (and, yes, it goes well with Chianti). Bringing together the latest cutting-edge science, Schutt answers questions such as why some amphibians consume their mother's skin; why certain insects bite the heads off their partners after sex; why, up until the end of the twentieth century, Europeans regularly ate human body parts as medical curatives; and how cannibalism might be linked to the extinction of the Neanderthals. He takes us into the future as well, investigating whether, as climate change causes famine, disease, and overcrowding, we may see more outbreaks of cannibalism in many more species--including our own.Cannibalism places a perfectly natural occurrence into a vital new context and invites us to explore why it both enthralls and repels us.",
  "genres": [
    "Nonfiction",
    "Science",
    "History",
    "Anthropology",
    "Nature",
    "Biology",
    "Audiobook"
  ],
  "author": "Bill Schutt",
  "average_rating": "3.89",
  "url": "https://www.goodreads.com/book/show/28110850-cannibalism"
}