{
  "title": "No Mercy: A Journey Into the Heart of the Congo",
  "description": "Lit with humor, full of African birdsong and told with great narrative force, No Mercy is the magnum opus of \"probably the finest writer of travel books in the English language,\"  as Bill Bryson wrote in Outside, \"and certainly the most daring.\"  Redmond O'Hanlon has journeyed among headhunters in deepest Borneo with the poet James Fenton, and amid the most reticent, imperilled and violent tribe in the Amazon Basin with a night-club manager. This, however, is his boldest journey yet. Accompanied by Lary Shaffer--an American friend and animal behaviorist, a man of imperfect health and brave decency--he enters the unmapped swamp-forests of the People's Republic of the Congo, in search of a dinosaur rumored to have survived in a remote prehistoric lake.The flora and fauna of the Congo are unrivalled, and with matchless passion O'Hanlon describes scores of rare and fascinating eagles and parrots, gorillas and chimpanzees, swamp antelope and forest elephants. But as he was repeatedly warned, the night belongs to Africa, and threats both natural (cobras, crocodiles, lethal insects) and supernatural (from all-powerful sorcerers to Samalé, a beast whose three-clawed hands rip you across the back) make this a saga of much fear and trembling. Omnipresent too are ecological depredations, political and tribal brutality, terrible illness and unnecessary suffering among the forest pygmies, and an appalling waste of human life throughout this little-explored region.An elegant, disturbing and deeply compassionate evocation of a vanishing world, extraordinary in its depth, scope and range of characters, No Mercy is destined to become a landmark work of travel, adventure and natural history. A quest for the meaning of magic and the purpose of religion, and a celebration of the comforts and mysteries of science, it is also--and above all--a powerful guide to the humanity that prevails even in the very heart of darkness.",
  "genres": [
    "Travel",
    "Africa",
    "Nonfiction",
    "Adventure",
    "Memoir",
    "Biography",
    "Animals"
  ],
  "author": "Redmond O'Hanlon",
  "average_rating": "4.01",
  "url": "https://www.goodreads.com/book/show/281111.No_Mercy"
}