{
  "title": "You Play the Girl: On Playboy Bunnies, Stepford Wives, Train Wrecks, & Other Mixed Messages",
  "description": "In this smart, funny, impassioned call to arms, a pop culture critic merges memoir and commentary to explore how our culture shapes ideas about who women are, what they are meant to be, and where they belong.Who is \"the girl\"? Look to movies, TV shows, magazines, and ads and the message is both clear and not: she is a sexed up sidekick, a princess waiting to be saved, a morally infallible angel with no opinions of her own. She's whatever the hero needs her to be in order to become himself. She's an abstraction, an ideal, a standard, a mercurial phantom. From the moment we’re born, we're told stories about what girls are and they aren’t, what girls want and what they don’t, what girls can be and what they can’t. \"The girl\" looms over us like a toxic cloud, permeating everything and confusing our sense of reality. In You Play the Girl, Carina Chocano shows how we metabolize the subtle, fragmented messages embedded in our everyday experience and how our identity is shaped by them.  From Bugs Bunny to Playboy Bunnies, from Flashdance to Frozen, from the progressive ’70s through the backlash ’80s, the glib ’90s, and the pornified aughts—and at stops in between—Chocano blends formative personal stories with insightful and emotionally powerful analysis. She explains how growing up in the shadow of “the girl” taught her to think about herself and the world and what it means to raise a daughter in the face of these contorted reflections. In the tradition of Roxane Gay, Rebecca Solnit, and Susan Sontag, Chocano brilliantly shows that our identities are more fluid than we think, and certainly more complex than anything we see on any kind of screen.",
  "genres": [
    "Nonfiction",
    "Feminism",
    "Essays",
    "Pop Culture",
    "Sociology",
    "Womens",
    "Gender"
  ],
  "author": "Carina Chocano",
  "average_rating": "3.89",
  "url": "https://www.goodreads.com/book/show/28114600-you-play-the-girl"
}