{
  "title": "Rannigan's Redemption: Part 1: Resisting Risk",
  "description": "Brilliant Manhattan attorney Michael Rannigan has his life arranged exactly the way he likes it. As a founding partner at the law firm of Murphy, Rannigan, & Metheny, he can let his underlings do the legwork on the high profile defense cases his exclusive 50th floor division handles. He prefers to simply breeze in and do what he does best: dazzle juries and charm the press. His private life is well-ordered, too. Michael doesn’t have the time or the patience for relationships. Instead, he has a contact list of hot blondes who meet his needs at any given moment, whether it’s a date to a gallery opening or awards show. Or he just wants to get laid. Some people would call him shallow. But they’re just envious. Maggie Flynn has her life mapped out as well. After she graduates from law school she plans to take a job with the Prosecutor’s Office where she interned. But when she attends a job fair and meets Michael Rannigan, her plans change. She’s studied his cases, even heard him speak once. He’s smart and sexy and she can’t resist interviewing with him. Michael hires Maggie and has her assigned to his elite 50th floor team. He knows smart when he sees it. He also sees the spark in her eyes. She wants him. And having her nearby strokes his ego. It’s not like anything will come of it, she’s so far from his type. But there’s something unsettling about Mary Margaret Flynn, like she can see through his bullshit in a way no one else ever bothered to do. Maggie realizes that her crush on Michael is all but hopeless. He’s a self-absorbed womanizer. But beneath that cool exterior, she’s seen the man he can be and she’s sure that love can bring that out. In the meantime, she’s content to work with him. What would happen if they ever crossed that line?",
  "genres": [
    "Romance"
  ],
  "author": "Pandora Spocks",
  "average_rating": "4.13",
  "url": "https://www.goodreads.com/book/show/28121775-rannigan-s-redemption"
}