{
  "title": "A Nurse's Story: Life, Death and In-Between in an Intensive Care Unit",
  "description": "The team of nurses that Tilda Shalof found herself working with in the intensive care unit (ICU) of a big-city hospital was known as “Laura’s Line.” They were a bit wild: smart, funny, disrespectful of authority, but also caring and incredibly committed to their jobs. Laura set the tone with her quick remarks. Frances, from Newfoundland, was famous for her improvised recipes. Justine, the union rep, wore t-shirts emblazoned with defiant slogans, like “Nurses Care But It’s Not in the Budget.” Shalof was the one who had been to university. The others accused her of being “sooo sensitive.”They depended upon one another. Working in the ICU was both emotionally grueling and physically exhausting. Many patients, quite simply, were dying, and the staff strove mightily to prolong their lives. With their skill, dedication, and the resources of modern science, they sometimes were almost too successful. Doctors and nurses alike wondered if what they did for terminally-ill patients was not, in some cases, too extreme. A number of patients were admitted when it was too late even for heroic measures. A boy struck down by a cerebral aneurysm in the middle of a little-league hockey game. A woman rescued – too late – from a burning house. It all took its toll on the staff.And yet, on good days, they thrived on what they did. Shalof describes a colleague who is managing a “crashing” patient: “I looked at her. Nicky was flushed with excitement. She was doing five different things at the same time, planning ahead for another five. She was totally focused, in her element, in control, completely at home with the chaos. There was a huge smile on her face. Nurses like to fix things. If they can.”Shalof, a veteran ICU nurse, reveals what it is really like to work behind the closed hospital curtains. The drama, the sardonic humour, the grinding workload, the cheerful camaraderie, the big issues and the small, all are brought vividly to life in this remarkable book.",
  "genres": [
    "Nonfiction",
    "Nursing",
    "Medical",
    "Memoir",
    "Medicine",
    "Biography",
    "Health"
  ],
  "author": "Tilda Shalof",
  "average_rating": "4.07",
  "url": "https://www.goodreads.com/book/show/1177520.A_Nurse_s_Story"
}