{
  "title": "Fallout",
  "description": "The novels of Harry Turtledove show history balancing on single One act of folly. One poor decision. One moment of rage. In this astounding new series, the unthinkable has come to pass. The Cold War turns hot—and the United States and the Soviet Union unleash their nuclear arsenals upon each other. Millions die. Millions more are displaced. Germans battle side by side with Americans, Polish freedom fighters next to Russian fascists. The genie is out of the bottle. And there’s no telling what fresh hell will come next.   At the heart of Fallout are Harry Truman and Josef Stalin. Even as Joe McCarthy rises in power, the U.S. president is focused elsewhere, planning to cut off the head of the Soviet threat by taking out Stalin. It’s a daring gambit, but the Soviets have one of their own. Meanwhile, Europe’s weak sisters, France and Italy, seem poised to choose the winning side, while China threatens to overrun Korea. With Great Britain ravaged and swaths of America in ruins, leaders are running out of options. When the United States drops another series of bombs to slow the Russian advance in Europe, Stalin strikes back—with horrifying results.   These staggering events unfold through the eyes of a sprawling cast of a Holocaust survivor in a displaced persons camp in Washington; the wife of a bomber pilot and her five-year-old daughter starting a new existence; a savage Soviet fighter waging war by his own rules; a British pub owner falling in love with an American pilot. In the masterly hands of Harry Turtledove, this epic chronicle of war becomes a story of human struggle. As the armies of the world implode, the next chapter will be written by the survivors—those willing to rise up for an uncertain future.   From the Hardcover edition.",
  "genres": [
    "Alternate History",
    "Fiction",
    "Science Fiction",
    "Historical Fiction",
    "War",
    "Post Apocalyptic",
    "Fantasy"
  ],
  "author": "Harry Turtledove",
  "average_rating": "3.82",
  "url": "https://www.goodreads.com/book/show/28149017-fallout"
}