{
  "title": "The Phantom of the Earth, Books 1-5",
  "description": "Herbert's DUNE meets Banks' THE PLAYER OF GAMES in The Phantom of the Earth, a spellbinding science fiction epic set deep underground after the fall of civilization on Earth's surface.Here are the five thought-provoking postapocalyptic stories that lovers of science fiction can't stop talking about, gathered together in one volume for the first time. The futuristic theories, conspiracies, political maneuvering, and characters within these visionary tales will stay with you long after you finish.In the Great Commonwealth of Beimeni, a subterranean civilization in North America, expansion long ago gave way to peace and prosperity in the face of the history's most devastating plague. Immortality is the reward for service and loyalty in Beimeni, a place where the physical blends with the metaphysical and power consolidates in the hands of those with a genetic edge. The fissures first spread slowly, then swiftly, until now the Great Commonwealth finds itself on the brink of economic devastation, challenged by forces from within that know its secrets and its crimes.At the center of the conflict lie the Selendias of Piscator, founders of the resistance with an uncanny connection to the zeropoint field; and the Barão Strike Team, three researchers tasked with finding a cure to the Reassortment Strain, the plague that nearly wiped humanity from the Earth. Traveling from the uninhabitable but pristine surface to the habitable but inhospitable underground, this is a story about dedication to dreams, battle for survival, discovery and connection, song and celebration, undoing past misdeeds, and sacrifice for the greater good.",
  "genres": [
    "Science Fiction",
    "Apocalyptic",
    "Fiction",
    "Amazon",
    "Post Apocalyptic",
    "Dystopia",
    "Fantasy"
  ],
  "author": "Raeden Zen",
  "average_rating": "3.65",
  "url": "https://www.goodreads.com/book/show/28152465-the-phantom-of-the-earth-books-1-5"
}