{
  "title": "Love Me To Death",
  "description": "It takes no more than a glance, a slight tilting of her lips into a smile, a certain look in her bright, blue eyes ... and Colin is aching with a need that transcends anything he's ever known.  He wants to drown in her body, to immerse himself in every soft inch of her delicate skin.  Colin wants what can never be. His semen will kill the human female he loves.  Vampires and humans are forbidden to be intimate, and Colin is very much a vampire living in a human world. In love with a human woman he can never have, he must leave soon before he loses control and takes the one thing he wants more than his own existence. Just one droplet of his seed on her body is lethal and Colin wants nothing more than to bury himself inside Sophie and stay there until the last beat of his ancient heart.  But he loves her more than he wants her ... because his most intimate touch will mean her death. And that he cannot allow.  When vampires turn into ravenous, lustful monsters intent on devouring the woman he loves, Colin fights his own raging need to find out why Sophie is suddenly attracting all of this unwanted and dangerous attention.  Leaving Sophie alone is no longer an option.  Soon, they are on a collision course with a vengeful vampire king and his dangerous witch-wife. Amidst the sinful lights of Las Vegas, Colin and Sophie seek answers from a family of vampires, where someone holds the key to releasing hell on Earth.  Love Me to Death is the first book in the Blood & Magic Series, but can be read as a stand-alone even though there is a story arc that expands over the series. It has an HEA, no cheating, possessive love, action, suspense, a little dose of humor, possessive need, a secret, and hot sexy time. Love Me to Death is intended for readers 18+ years of age due to strong language and sexual situations.",
  "genres": [],
  "author": "Deborah Bogart",
  "average_rating": "0.00",
  "url": "https://www.goodreads.com/book/show/28151053-love-me-to-death"
}