{
  "title": "Spectrum: Detour of Wrong",
  "description": "A female technological scientist creates a unique invention that blends technology and science in order to allow consumers to explore emotional journeys in fictitious settings but in the pursuit of perfection as she ventures through her own emotional capacity, she struggles to maintain the very real love of her real life as reality rapidly fades into a dull, inferior substitute. The price of perfection requires a lot of personal sacrifices from Leah and as she starts to test out her invention, prior to its potential sale, she engages in an actual exploration of the various emotional landscapes, multitude of hybrid creatures and fictitious guides that she has formulated and created. However, Leah's creation she swiftly discovers, not only pushes the boundaries of science and technology but also starts to stretch the boundaries of her own relationship as she starts to view and inspect her life through the lens of dissatisfaction and the microscope of her own discontent.During Leah's exploration as she dips her toes into her own artificial reality, her love and loyalties are swiftly put to the test by her own creation and as Leah's relationship slips down the ladder of priorities as fictitious entities sway her heart and mind, the future of Leah's own real life and heart start to hang in the balance. A desperate attempt is made to try and resuscitate the last strands of love and Leah’s relationship which is on its last heartstrings but as she rapidly discovers, there are a few surprises in store for her because somehow, her secret, fictitious betrayals have followed her back into reality and the very creation that she created and gave life to that was supposed to usher in a great destiny and future, is in fact that same creation that will perhaps destroy it.When a bidding war erupts and as Spectrum's sale looms upon the horizon of Leah's life as she revels in the multitude of offers that she receives, her invention seems to develop a real personality of its own that spills out into reality as a judge and jury to her simulated conduct and real life which now seem to be under scrutiny. However, as Leah rapidly discovers, justice doesn't appear to be on her side because the real ramifications from her fictitious exploration of Spectrum, suddenly threaten to jeopardize her real future due to her own fragments of betrayal which could destroy the very future that her invention was supposed to usher in, lubricate and actually provide.Some desires can cost us absolutely everything....The Glitches Series explores the possible facilitation of technology and things that can potentially go wrong when technology behaves in unexpected manner due to Glitches, it also has an underlying exploration of how humanity control and interact with that technology when 'the end justifies the means' approach is applied to technological developments and their implementation and examines how that can result in both negative and positive outcomes.",
  "genres": [],
  "author": "Jill Thrussell",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/28150264-spectrum"
}