{
  "title": "Mission Pack 2: Missions 5-8",
  "description": "Just because every job we pull goes supernova doesn’t mean this one will.Captain Carl Ramsey and the crew of the Mobius are constantly on the run from one bad decision to the next. Every time it looks like they might score big, something goes wrong. But no one ever got ahead by quitting, and the only alternative is honest work. There are always more jobs to pull, more schemes to hatch, and more authorities to evade.Mission 5: Alien RacerA race contest turns into a heist when Carl can’t keep his greed in check. But will he be able to pull it off with billions of holovid viewers watching?Mission 6: Retro VersionA relaxing getaway on a nostalgic colony sounds like a nice break for the Mobius crew. But easy living and keeping a low profile aren’t in their DNA.Mission 7: Siege of MortaniaMort’s past catches up with him, and the crew of the Mobius are caught in the wizardly crossfire.Mission 8: Moon of OdysseusOne of Carl’s old squadron mates has stumbled onto the location of a salvage prize unlike any the Mobius crew has ever a lost Earth Navy battleship. The only problem is the survivors of the crash aren’t too welcoming of visitors.Bonus Short Pinball WizardryFor Esper Theresa Richelieu, it’s time to graduate from apprentice to wizard. But the final exam isn’t exactly what she had in mind.Black Ocean is a science fantasy series set in the 26th century. Do you wish there had been a second season of Firefly ? Do you love the irreverent fun of Guardians of the Galaxy ? Have you ever wondered how Star Wars would have turned out if Luke and Obi-wan had ditched the rebellion to become smugglers with Han and Chewie? Then Black Ocean is the series for you!Pick up your copy and aim to misbehave with the crew of the Mobius !",
  "genres": [
    "Science Fiction",
    "Science Fiction Fantasy",
    "Audiobook",
    "Fantasy",
    "Space Opera"
  ],
  "author": "J.S. Morin",
  "average_rating": "4.26",
  "url": "https://www.goodreads.com/book/show/28153032-mission-pack-2"
}