{
  "title": "Headlock",
  "description": "“Nicely written dialog, choice humor, and a slowly evolving plot makes this first mystery in a new series a real winner”—Library Journal\"The kind of novel that mesmerizes. Barer delivers tight, muscular prose, a laconic hard-boiled PI, and a plot that is as slippery as a well-oiled chicane. An utterly compelling narrative that will not disappoint.\"--Richard Godwin, author of Apostle Rising and Savage HighwayA paranoid recluse lures private eye author Jeff Reynolds into a complex web of deception where delusions are deadly, life after death can be hell and all roads lead to the McFeely Tavern. Several popular mystery writers, including G.M. Ford and Tony Fennelly, make cameo appearances in this clever and captivating private eye caper set in Walla Walla, Washington. Edgar Award winner Burl Barer brings us a private eye mystery unique and wondrous from the opening paragraph to the spectacular cinematic climax featuring one of the best plot twists in PI history.\"Clever, quirky, and often outrageous\"-Lee Goldberg, NYT best-selling author of numerous Mr. Monk mysteries\"Undeniable talent, pizazz and imagination”-Jack Olsen, NYT best-selling author\"A 100% dazzling debut of what could be the best new series in mystery fiction\"-Prof. Gerry Graber\"...a detective as hard boiled as a twenty-minute egg, and wisecracks as sharp as a new Gillette!\"-Dale Furutani, Anthony and Macavity winning author of the Ken Tanaka and Samurai Mystery series\"Barer is obviously twisted. `Headlock' is a hoot. I couldn't turn the pages fast enough!\"-G.M. Ford, author of The Deader the Better, Last Ditch, Bum's Rush, and Slow Burn\"Brilliant and hilarious!\"-Tony Fennelly, author of The Glory Hole Murders, and 1-900-DEAD\"Burl Barer's new action-packed novel had me laughing my ass off, gasping for breath, and cursing his talent!\"-Sparkle Hayter, author of Revenge of the Cootie Girls, and The Last Manly Man",
  "genres": [
    "Mystery"
  ],
  "author": "Burl Barer",
  "average_rating": "4.27",
  "url": "https://www.goodreads.com/book/show/28148867-headlock"
}