{
  "title": "About a Certain Return",
  "description": "It is a surreal fantasy. The key to this story is not the replay. Explanations appear at the end, although the meaning may be questionable.The scene is underground. Underground? Somewhere appears a plausible explanation of the human civilization becoming, also speculated by modern prophets. But it is not a science fiction. Although it seems illogical, delirious, the story makes sense. It is a narrative written at first person, which allows the character to manifest directly, without being characterized by others. Everything goes through the filter of his appreciation, thought, philosophy, limits, etc. Playback features change action, impossible in real life, an improvement or a lifting level, explanations, visions, another perspective.The subject is built in the style of a musical work. There is an initial theme maintained until the end. It's the quiet life of a low middle class family in a city, somewhere, of an ordinary man took out of his way. In that domestic atmosphere suddenly appear relatively changing themes, disturbing the common sense. I will attempt a brief statement of a difficult exposing story.The man whom all happens by accident (though, according to the said, nothing is accidental), launches the adventure with a dream which seems somehow ominous, before beginning his day as he always did – breakfast, browse the journal, little bites with daughter and the usual way to his everyday job. Hence the natural things change. Anyway, no matter how improbable, serious, dangerous, these events are continually harass him, it always ends with a return to his family, life as we know it, though looks like he forgets some details, but recovers. It is, as I said, the main and stable theme of this work. Let’s continue along this line. Man is dismissed by the employer and is required by law to re-engage immediately, this time to a position of public commissionaire, his only concern is to bring any packages to some special characters, items containing books. Connection with these characters is reviewed and complicated a lot, but nothing stops him here. Further, the day course has a double branching, one for his literary work, his hobby, that explain the imagination or intellectual reflections appetite, the other towards the party which ends the day, finalized in both cases (because this day is reviewed with significant changes) through a capital event.I introduce you a tree. We talked about the root, look at stem and its strong branches. From inside the main theme insinuate other topics. The hero of the book slips into parallel worlds. He does not enter voluntarily into them. Is attracted, pushed, there he must to come. Have you heard of people wearing the sign, in other words meaning Marked? They have an exceptional destiny. Their mission is to become notorious. Their path is chosen so that they are called Chosen Ones. By whom are they chosen? In the world of Mr. M. (a possible name) is creeping a ... God. This secondary character grows the tree, give its strength. Although his influence is important in a subconscious world, his power is also manifested in what we consider as reality. We quickly notice that \"reality\" is not reality that we, who we are, feel, but beyond it happens something more unusual. Let's return to our hypothetical cabalistic tree. In \"reality\", that God manifests himself mystical, through fraternities, inspirations, visions, possession, strange theories, tempting and enticing. Any implication claim initiation and neophyte path is not simple. That's the way called \"Temptation\". Then geniuses’ earth world arises. The world of \"dwarfs\" is a deviation or potential output, although we perceive as a place of damnation. The Output from this world is the \"Furnace\". There are also variations, it’s just a mystical world... I'd say that these \"dwarfs\" produce embryos of life, but not too sure. It is a transparent world that is lost or becomes god worshipers crowd that longs on ... M. This god that changes, transforms, his subjects, has supporters and strong opponents. The sneak of the patriarchal god in a matriarchal society cannot be done without fight. We see at branch tip increasing a teacher of the old moral, beyond a witch with multiple functions, and above all, from the mist, raising the pyramid temple of the god, with a masterly bird of prey on top.Mr. M. is not only the target of this god who wants supremacy but is discovered by a group of true light source hunters. With them he will go into a new spiritual adventure, to the knowledge of necessary truth. This goal creates and reinforces positive heroes. On top head of tree stands the Light of Truth. The light is hidden by an (almost) impenetrable dome. To breakthrough from inside is allowed a method...Further, mystical world is wasted... The hidden things are touched by specialists light. \"Where are we really?\" asks M. to the end, like many of us ask ourselves. Do we feel the light?It is a tale about man and his way of looking for a credible truth, about the hidden world of dream and its influence, less Freudian, in inspiration, creation, aspirations, culture and old, ancestral nightmares, (located where we are now, before our birth). It is a story that pulsates, constantly seeking its way, receiving information from real life – even if the information is false, it actually exists – and, here is the paradox, what we know is deliberately falsified, the reality is known in wrong. That’s why time came for riots and is strongly looking the light – at least in the other world, the realm of beyond... We (or Mr. M) are some investigators of the unknown and we exist as long as we keep the hope that it can be found something valuable in our way.",
  "genres": [],
  "author": "Samuel Trenton",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/28151216-about-a-certain-return"
}