{
  "title": "Upon This Rock",
  "description": "Previous cover edition for ASIN B018ZZ23PQFor alternate cover edition see hereGods and demons seducing mortals. A war for Eden. Hot dark fantasy and reverse harem romance. Beneath the Vatican hides an ancient portal to alien worlds where gods and demons wait for the gate to open. Only Ashley Rowan can wield the key. Mithra has worked for centuries to find that rare human with the Nephilim genetics necessary to activate the key and open the sealed gateway.“Your patience is rewarded. I crossed rivers of time and space for you.”Ashley Rowan has no one in her life but the voice in her head, the sultry whispers of Mithra. He haunts her nightly dreams.“Pledge absolute devotion to me and I promise you the key to the universe.”Empowered by Mithra, Ashley must embrace her destiny as the gatekeeper before his enemies take control of her and the portal. Dark forces move against the gate, but Mithra vows to protect Ashley at any cost, even if it means a war between worlds.“I once believed demons were a psychosis of the mind. Now I see they walk and talk, bearing wings of polished steel dipped in the blood of sinners.”Joined by deadly vampires and a fallen angel, Ashley will stop at nothing to reach the Vatican to open the portal and meet her god and lover Mithra… on the far side of the universe.But who will protect Earth from the demon hordes? Greco Roman gods and demonic creatures collide in this fantasy and futuristic romance series from New York Times bestselling author Travis Luedke.Scroll up and buy now to see if Ashley can activate the key to the universe and finally be united with her God and lover.Also available on Kindle Unlimited: DANTE’S ROAD, book 2 of the Demons of Eden series.",
  "genres": [
    "Paranormal Romance",
    "Fantasy",
    "Demons",
    "Vampires",
    "Science Fiction",
    "Romance",
    "Paranormal"
  ],
  "author": "Travis Luedke",
  "average_rating": "3.96",
  "url": "https://www.goodreads.com/book/show/28142441-upon-this-rock"
}