{
  "title": "Emma",
  "description": "BookDoors’ EMMA is the most richly annotated edition of Jane Austen’s novel available in print or online. Designed as an eBook, this and the other BookDoors In Context editions of the Austen novels offer you swift, seamless access to information and commentary. The modest price underscores BookDoors' mission to make these works accessible to an audience of widely different experience and expectations. The “Literature in Its Context” series aspires to provide today’s reader with the knowledge an informed reader of 1815 possessed and that Austen took for granted. As you read you'll have, should you wish, an interpretive discussion of EMMA, Austen’s finest and subtlest novel. You’ll also find illustrations, an Austen Glossary of some 1000 words, a time-line that includes cultural, scientific, and technological developments from 1770 to 1817, a selective bibliography, and a brief biography of Austen.Austen observes in EMMA, \"Seldom, very seldom, does complete truth belong to any human disclosure; seldom can it happen that something is not a little disguised, or a little mistaken.\" That's true of EMMA itself, and now, nearly two centuries later, \"a little mistaken\" and \"a little disguised\" understate the challenge a reader faces.First, words, themselves, have changed or disappeared. “Nice” in Austen means precise or scrupulous, and a \"barouche-landau\" is the Rolls-Royce convertible of its day. Some of the novel’s words are arcane, such as the first chapter’s \"valetudinarian\" and \"rencontre,\" or now uncommon, such as \"desultory.\"Second, the annotations explain the historical context in which Austen sets the novel, including her life and its convergences with her fiction, and the novel’s social and cultural context. For instance, just who and how many were the landed gentry in a society of close to eleven million and what portion of England’s land and wealth did they possess? What constituted a \"gentleman,\" which with \"respectable\" is one of EMMA'S freighted words? How “rich” (the novel’s sixth word) does Emma’s £30,000 make her in today’s dollars? What income did that generate and what could she buy with it? Emma's father is a hypochondriac (like Austen's mother) and a melancholic. But he’s no depression and suicide appeared so widespread that foreigners visiting England referred to them as \"the English disease.\" Yet even hypochondriacs die, and the average age of death then was 44.8 years; hence a man of forty in EMMA is called \"old.\"A third level addresses EMMA as a complex work of the literary imagination describing a young woman’s moral coming of age. Emma always intends to practice the piano, to read more, and to be a better, kinder person; Austen practiced and as a child had free run of her father’s 500-book library, works to which she often alludes. She’s fully aware that EMMA itself is joining \"this age of literature.\" A comprehensive annotation explores just what that phrase meant to her. The commentary addresses the novel’s diction, structure, motifs, characters, sub-texts, and presiding ideas. Incidentally, the annotations never divulge or anticipate the plot yet to unfold.Austen writes of Emma what’s true of all her their two supreme moral strengths are discernment (to see what's actually there) and judgment (what to make of what’s there). Austen expects no less from her readers, but promises that the reward for our keener, braver discernment will be our far greater pleasure.",
  "genres": [
    "Fiction",
    "Historical Fiction",
    "Literature",
    "Audiobook",
    "Historical",
    "19th Century",
    "Classic Literature"
  ],
  "author": "Jane Austen",
  "average_rating": "4.05",
  "url": "https://www.goodreads.com/book/show/11777011-emma"
}