{
  "title": "Hitler Out Of Time",
  "description": "The Nazis invent a time machine in 1945 and send Hitler forward in time, where he is hunted by secret agent Norton Blake. But Hitler goes back in time and the Nazis win WW2, creating a nightmare world in which Norton is trapped. Can it all be put back to how things were?\nWhat if the Nazis had invented a time machine during World War Two and Adolf Hitler had used that to travel in time to change the course of the war? But what if the time machine was not quite perfected and the unintended result was that Hitler ended up in a different time to what he expected? And what if he then managed to accomplish what he needed to do by finding a way to go back in time and change history? And what if only two people realised what had happened and were the only ones who could stop this new alternate reality? What-if stories always appeal to us because they allow us to explore a different world, one where things turned out differently because of a few people making different decisions. The idea of the Nazis winning World War Two and ruling the world is nothing new, and it is exciting to explore this idea, up to a certain extent, to see what would have happened. It should make us more grateful that in reality the Nazis did not win World War Two and did not create the thousand-year Reich that Hitler had wanted. So we explore what might have been, not because we wished it had been that way (in fact we are glad it was not that way), but because we have to see both sides of the coin, as it were. To see what would have happened if the Allies had sat back and allowed Hitler to take over Europe, or if the Nazis had been just a bit more powerful and quicker to develop and implement the atomic bomb. It seems like we avoided a great disaster for the world in defeating Germany in World War Two, but that is not to say that it could not happen again. So a what-if story can also warn us of the possibilities of such a thing happening in the future. Things might not be exactly as in this story, but the way the world is going we can only wonder as to where events are taking us. We shall to wait and see what happens, but if we look at how things might be different we can at least be prepared for a different and less-pleasant world to happen. Some people are amazed at the great evil of the Nazis; how could human beings do such depraved things? How could they murder millions of people in concentration camps or just through warfare? Human nature has its good side and its bad side. In the right environment the bad side can easily come to dominate and make things bad for all around. This book also has its own website at http://www.hitleroutoftime.com and a Facebook fan page at http://www.hitleroutoftime.com/facebook and the main character Norton Blake has his own Twitter feed @nortonblakepi — https://twitter.com/nortonblakepiSo when you are ready to read it, head on over to Amazon to buy a copy. You can get a sample on your Kindle first, and if you have Kindle Unlimited then you can read it for free. Just go to http://www.hitleroutoftime.com/amazon",
  "genres": [],
  "author": "David Avoura King",
  "average_rating": "3.60",
  "url": "https://www.goodreads.com/book/show/28169346-hitler-out-of-time"
}