{
  "title": "Sung Under the Silver Umbrella",
  "description": "From the FOREWORD:THE making of poems for childhood is a very delicate undertaking. It is like domesticating a creature of the wild. The creature domesticated is a mood or impression; it is the poet's wonder, his discovery that what he has been looking at is unique. I dwell on the word domesticated, for the poem made for childhood has to be lived with more familiarly than the poem made for grown-up people; the mood or the impression has to be made completely domestic. The old nursery rhymes did this perfectly:Goosey-goosey gander, Where do you wander?Upstairs and downstairsAnd to my ladys chamber. Here the inquiring and exploring aimlessness which is goosiness in its essence is given in swift, bold strokes. And it is idle for us to exclaim that one does not enter into conversation with a goose one meets on a stairway, and that if one does he does not get such a well-worded answer. The wonder has been felt, the impression rendered; that wild, winged thing, the goose of all time, has been domesticated completely. In an enormous lot of verse intended for childhood there is a fault - it domesticates the domestic. Plates and clocks and pinafores are just plates and clocks and pinafores; the impression ofthem as unique things has not been rendered in arresting measures. The makers of them have not been aroused to a discovery as has one of the poets represented here by hearing how hens talk before they go to sleep:One of them moved, and, turned around, Her feathers made a ruffled sound,A ruffled sound, like a bushful of birds, And she said her little asking words. One of the merits of this collection is that it does not domesticate the domestic. Poetry exists that we may have an accompaniment to our thoughts - something rhythmical, liberated, of another dimension going along with our accustomed toil, pastime and distraction. At all periods of our lives we have need of this accompaniment; we have particular need of it, judging by the way we demand it then, in the period of infancy and childhood. Hence \"Ring-a-ring-a-rosy\" and \"Oranges, oranges, four for a penny\", and all the play-rhymes that children who have not been brought up in solitude know; hence the universality and immortality of Mother Goose's rhymes. Of course these are to be distinguished from poetry - Mother Goose's are rhymes merely. But they do for our unreflective days what high poetry should do for our reflective days - they make an accompaniment for the thoughts of childhood, they put alongside the active and practical lives of children the rhythmical, liberated accompaniment. There is a stage in our lives when knowledge of the world and types of human character have to come to us as a legend, as a piece of mythology, and it is natural and fitting that they should come to us in rhyme:The King was in his counting-house,Counting out his money, The Queen was in her parlorEating bread and honey. Kings and Queens should exist for us in this handsomeness and opulence before they exist for us as heads of states, and the rhyming way is surely the proper way of introduction to such personalities. Then, too, there is an oral stage in our lives when our minds are receptive to words, when words naturally take the form of rhymes, and when rhymes become a favorite possession. Rhymes that give some impression, that hold some mood, should be around us then - poems of the kind that can enter the mind of a child and remain one of its possessions...",
  "genres": [
    "Poetry"
  ],
  "author": "International Association for Childhood Education",
  "average_rating": "4.38",
  "url": "https://www.goodreads.com/book/show/2816256-sung-under-the-silver-umbrella"
}