{
  "title": "Orgoglio e preveggenza",
  "description": "«È cosa nota e universalmente riconosciuta che uno scapolo in possesso di un solido patrimonio debba essere in cerca di moglie.» Ed è una verità cui non si sottrae Mr. Frederick Parrish, ricco e affascinante gentiluomo americano, che sta per convolare a nozze con Caroline Bingley. Un’atmosfera di festa avvolge i fidanzati e il matrimonio pare suggellare la promessa di una vita serena e felice. Ma presto la gioia s’incrina e la coppia è turbata da una serie di strani episodi: fenomeni di sonnambulismo, cavalli imbizzarriti senza una ragione, uno spaventoso incendio e misteriosi incidenti. Qualcuno sta perseguitando i Parrish, ma la pericolosità della situazione pare sfuggire a tutti. A tutti tranne a Elizabeth e Darcy, amici della giovane donna e anch’essi sposi novelli, che mettono da parte i progetti per la luna di miele per aiutare Caroline. Un innamorato respinto? Un socio d’affari tradito? Un parente invidioso? O un eccentrico seguace del paranormale? Chi si cela dietro questa trama sinistra che sembra trascinare Caroline come un gorgo verso la follia?Primo di una serie di «mystery romantici» dedicata a una delle coppie letterarie più amate di sempre, Orgoglio e preveggenza ci introduce a due nuovi investigatori: Elizabeth e Fitzwilliam, Mr. e Mrs. Darcy, gl’indimenticabili protagonisti di Orgoglio e pregiudizio di Jane Austen. Combinando magistralmente atmosfere settecentesche e suggestioni gotiche, Carrie Bebris ci regala un romanzo di grande piacevolezza, che rende un intelligente omaggio allo stile austeniano e i cui personaggi si muovono all’interno di una società elegante e regolata da rigide convenzioni, facendoci rivivere la magia e le emozioni dei romanzi della grande scrittrice inglese.",
  "genres": [
    "Mystery",
    "Historical Fiction",
    "Fiction",
    "Historical",
    "Historical Mystery",
    "Regency",
    "Cozy Mystery"
  ],
  "author": "Carrie Bebris",
  "average_rating": "3.56",
  "url": "https://www.goodreads.com/book/show/28159259-orgoglio-e-preveggenza"
}