{
  "title": "13 Ways of Looking at a Fat Girl",
  "description": "“This book sparkles with wit and at the same time comes across as so transparent and genuine—Awad knows how to talk about the raw struggles of female friendships, sex, contact, humanness, and her voice is a wry celebration of all of this at once.” —Aimee Bender, author of The Particular Sadness of Lemon Cake  “Hilarious and cutting . . . Mona Awad has a gift for turning the everyday strange and luminous, for finding bright sparks of humor in the deepest dark. She is a strikingly original and strikingly talented new voice.” —Laura van den Berg, author of Find Me and The Isle of Youth    Growing up in the suburban hell of Misery Saga (a.k.a. Mississauga), Lizzie has never liked the way she looks—even though her best friend Mel says she’s the pretty one. She starts dating guys online, but she’s afraid to send pictures, even when her skinny friend China does her makeup: she knows no one would want her if they could really see her. So she starts to lose. With punishing drive, she counts almonds consumed, miles logged, pounds dropped. She fights her way into coveted dresses. She grows up and gets thin, navigating double-edged validation from her mother, her friends, her husband, her reflection in the mirror. But no matter how much she loses, will she ever see herself as anything other than a fat girl?    In her brilliant, hilarious, and at times shocking debut, Mona Awad simultaneously skewers the body image-obsessed culture that tells women they have no value outside their physical appearance, and delivers a tender and moving depiction of a lovably difficult young woman whose life is hijacked by her struggle to conform. As caustically funny as it is heartbreaking, 13 Ways of Looking at a Fat Girl introduces a vital new voice in fiction.",
  "genres": [
    "Fiction",
    "Short Stories",
    "Contemporary",
    "Feminism",
    "Canada",
    "Literary Fiction",
    "Adult"
  ],
  "author": "Mona Awad",
  "average_rating": "3.08",
  "url": "https://www.goodreads.com/book/show/28174589-13-ways-of-looking-at-a-fat-girl"
}