{
  "title": "The Tiniest Elf",
  "description": "Christmas Stories, Jokes, Games, and More! Twinkletoes is the tiniest elf in all of the North Pole. Have you ever heard that big gifts come in small packages? Well... that's the case with Twinkletoes. He may be the tiniest elf, but he spreads the most Christmas cheer. He loves Christmas more than anyone!\n~ Read for FREE with Kindle Unlimited ~\n \n   5 cute Christmas stories \n   Funny Christmas jokes for kids \n   Just for fun activities that kids will love \n   Santa Claus mazes and puzzles \n   An entire bundle of Christmas fun \n \n\nThis book is especially great for bedtime stories, traveling, waiting rooms, and reading aloud with friends and family!\n\nAre you looking for a children's book that is highly entertaining, great for early readers, and is jam-packed with fun Christmas stories, jokes, games, and more? This children's storybook has it all!Story List & Activities: \n   FREE GIFT! \n   Bath Time for Christmas \n   A New Kitten for Christmas \n   Just for Fun Activity \n   Decorating the Christmas Tree \n   Just for Fun Activity \n   Rusty’s Christmas Present \n   Be Good, Rusty \n   Funny Christmas Jokes \n   Santa Claus Maze 1 \n   Santa Claus Maze 2 \n   Santa Claus Maze 3 \n  Best-Selling Children's Book Author Uncle Amon has created over 100 children's books and counting! He has had several #1 best-sellers and finds most of his inspiration from his readers. Uncle Amon began his career with a vision. It was to influence and create positive change in the world through children's books. Whether it be an important lesson or just creating laughs, Uncle Amon provides insightful stories that are sure to bring a smile to your face! His unique style and creativity stand out from other children's book authors, because often times he uses his life experiences to tell a tale of imagination and adventure.\"I always shoot for the moon. And if i miss? I'll land in the stars.\" -Uncle Amon\nScroll up and click 'buy' and spend some quality time with your child!\ntags: christmas books, kids christmas books, children christmas books, christmas books for kids, christmas books for children, christmas stories, christmas stories for kids, christmas stories for children, christmas books for kids 2015, elf, christmas elf, elves, books for kids, christmas jokes, funny christmas jokes, christmas jokes for kids, christmas activities, christmas",
  "genres": [],
  "author": "Uncle Amon",
  "average_rating": "4.57",
  "url": "https://www.goodreads.com/book/show/28164681-the-tiniest-elf"
}