{
  "title": "Betrayal By Treaty",
  "description": "They had a deal. She promised to protect him.Jaden forfeited rank and freedom to serve as tribute to the Qui Empress and save Earth. A devoted lover, Jaden’s iron will won the love of the Empress, but his backbone and loyalty to Earth breeds mistrust. On a diplomatic mission to Earth, a Surashan connection is revealed and tension runs high within the Qui Court. Humanity has unwittingly become a gateway for the enemy, at the center of a treacherous plot to strike at the Empress herself.There is no peace for a tribute who commands the heart of an Empress.She promised to protect Jaden, and now his life and Earth’s fate rest on an impossible decision. The Empress must choose between love and duty. Both demand sacrifice.Betrayal By Treaty is a bold, fast-paced adventure of alien shapeshifter erotic romance with a strong alpha hero who will strike a deal with the devil to save the Empress he loves.This sexy romance is the sequel to Under By Treaty and the sixth story in the Qui Treaty Collection inspired by Under By Treaty. Each alien shapeshifter romance is a standalone story set in the Qui galactic empire, with annihilation of mankind held at bay only through the Treaty consummated between the Qui Empress and the human consort abducted under its terms. Although Betrayal By Treaty is standalone, this sequel to Under By Treaty is set within a wider saga that continues with Books 1-5 of the Qui Treaty Collection. For maximum enjoyment, it is recommended to read the collection in order:The complete Qui Treaty Collection:#0 UNDER BY TREATY (prequel)#1 RELEASE BY TREATY#2 RESTRAIN BY TREATY#3 HUNTED BY TREATY#4 SUBMIT BY TREATY#5 OBSESSION BY TREATY#6 BETRAYAL BY TREATY (sequel to Under By Treaty)Reader please note: Kayla Stonor’s romance can be dark and edgy, hot and wicked, punishing and uplifting. If you find certain themes uncomfortable reading, these stories may not be for you. Readers are advised this novel contains graphic language and violence including torture. Sexual scenes are explicit with mature themes including bondage, corporal punishment, some m/m & menage, domination & submission.",
  "genres": [
    "Science Fiction",
    "Romance",
    "Space Opera",
    "Erotica",
    "Dark Romance",
    "Aliens",
    "BDSM"
  ],
  "author": "Kayla Stonor",
  "average_rating": "4.13",
  "url": "https://www.goodreads.com/book/show/28162978-betrayal-by-treaty"
}