{
  "title": "Dodging Satan: My Irish/Italian sometimes awesome, but mostly creepy, childhood",
  "description": "In this humorous coming-of-age story, Bridget Flagherty, a student at St. Michael’s Catholic school outside Boston in the 60s and 70s, takes refuge in her wacky misunderstandings of Bible Stories and Catholic beliefs to avoid the problems of her Irish/Italian family life. Her musings on sadistic nuns, domestic violence, emerging sexuality, and God the Father’s romantic life will delight readers. Bridget creates glorious supernatural worlds—with exorcisms, bird relics, Virgin Martyrs, time travel, Biblical plagues, even the ‘holy’ in holy water—to cope with a family where leather handbags and even garlic can cause explosions. An avid Bible reader who innocently believes everything the nuns tell her, Bridget’s saints, martyrs, and boney Christs become alive and audible within her. While the nuns chide her sinful ‘mathematical pride’ and slow eating habits, God answers her prayers instantly by day, but the devil visits nightly in the dark. Scenes run the gamut from laugh-out-loud Catholic brainwashing of children, to heart-wrenching abuse, to riveting teenage excursions toward sex. Young Bridget tries to make sense of a world of raging men and domestically subjugated women and carve a future for herself, wrestling with how God and men treat women. Her Italian female relatives—glamorous Santa Anna, black-and-blue Aunt Maria, sophisticated Eleanor with a New York ‘Fellini pageboy’—offer sensual alternatives to the repression of her immediate family. She prays fervently that “despite God’s bizarre treatment of married women... some [girls] might still discover ways to have a great time without being a nun.” Dodging Satan is the flip-side of l'Histoire d'une Âme by Saint Thérèse of Lisieux authored by a twentieth century American girl chomping on a blue-gum cigar while she talks to a confidant about God and sex.",
  "genres": [
    "Drama",
    "Contemporary",
    "Novels",
    "Book Club",
    "Fiction"
  ],
  "author": "Kathleen Zamboni McCormick",
  "average_rating": "4.28",
  "url": "https://www.goodreads.com/book/show/28160805-dodging-satan"
}