{
  "title": "Rude Boy USA",
  "description": "Say good-bye to the era of godfathers. The Chimera Group has put a new face on organized crime.Mob boss Bernie Banks and his associates—John, Ben, and Jerome—differ from your ordinary Sicilian and Irish mob families. Two white, two black, they style themselves after the Rude Boy culture made popular in Jamaica.Operating as a shell investment company supported by illegal activities, the Chimera Group hopes to become as powerful as other crime families and gain respect from the Cosa Nostra. Bernie, a war veteran of Jewish and Greek descent, begins his business in his apartment and grows it into a multimillion-dollar empire. He and his crew resemble a more sophisticated subculture of urban street gangsters with their Ray-Ban sunglasses, loafers, and debonair style. But they want fear and admiration.Their efforts draw the attention of the rival Ambrosino family, and they face internal strife when one of the associates begins dating a former Playboy Club waitress who wants in on the group.Will they make it to the top, or will they fall?******************************************************************************************Reviewed by Romuald Dzemo for Readers' FavoriteA story that begins with someone spitting in another’s face and getting tortured and killed for a secret he can’t reveal immediately raises a lot of interest and curiosity in readers, but the grim fun is yet to begin. Rude Boy USA by Victoria Bolton is a riveting story of an unquenchable thirst for power and terror, featuring characters that will draw powerful emotions from readers. Bernie Banks has slowly but surely established himself as a powerful gangster with unusual but ruthless methods of operating. At a time he and his boys are sure to get on the top of the game, a powerful rival joins the game and a waitress causes a distraction that could break the solid Chimera Group. The big question is: who’ll make it to the top in this game of power where no one accepts defeat?Victoria Bolton’s Rude Boy USA will take readers deep into the psychology of kingpins and the mechanics of the game of power. Bolton writes with unwavering confidence and grace, unveiling a plot that is laced with unusual turns and sudden surprises, a pace that quickens with the reader’s heartbeat. The characters are as real as they are compelling, sometimes funny and at times very, very nasty. The language is blunt, so blunt the reader can squirm at times at what they hear. The dialogue comes off the pages naturally and draws readers in as the plot progresses to a rocket-like climax. This is a book I will gladly recommend to fans of thrillers and crime fiction. An enjoyable read indeed.",
  "genres": [],
  "author": "Victoria Bolton",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/28160711-rude-boy-usa"
}