{
  "title": "Familiar Taste Of Poison",
  "description": "PLEASE NOTE THAT THIS BOOK SHOULD BE READ AFTER Nothing Girl!Last year, Todd met a girl and fell in love. He found a passion that he never knew existed. It was incredible, perfect even, he finally met someone who could touch his unfeeling heart. He honestly believed that he'd found the one, his other half. His soulmate. But that was before she ran from his life and destroyed him. Now all he feels for her is hatred, that and a familiar taste of poison he'd sworn never to experience again. Once more, Todd vows he'll never let anyone under his skin. He's going to keep the hate he feels right over his heart to always remind him that no good can come of love. That shouldn’t be too difficult, right? Then in the same place, he encounters her again and the hate he's sure he feels is shattered by a turn of events that neither of them had anticipated. Can Todd make Beth change her mind? Will she ever feel for him what he does for her? Can Todd settle for having less than all of her? Will they ever find out who set out to destroy them? Most importantly, though, can Todd save Beth from herself and give them both the happy ever after they deserve?  In Nothing Girl, (The Only Exception #1) we heard how Beth fell for an obnoxious domineering American boy. How he pursued her relentlessly and forced her to see herself as the beautiful woman she is. The way he sees her. Todds little Tink, a girl who is worthy of love, regardless of being raised to believe she was nothing. But just as she dared to believe him, reality stepped in to bitchslap her in the face. That slap almost destroyed them both reminding her of the nothing girl she truly is.  Now It’s Todd’s turn to be heard, only this time, he’s not going to go quietly into the night. He’s got too much to lose. Can Todd and Beth finally get their Happy ever after? Find out in Familiar Taste Of Poison, the concluding part of The Only Exception series.",
  "genres": [
    "Second Chance",
    "Contemporary Romance"
  ],
  "author": "Dani Kermon",
  "average_rating": "3.98",
  "url": "https://www.goodreads.com/book/show/28177335-familiar-taste-of-poison"
}