{
  "title": "The Complete Orsinia: Malafrena / Stories and Songs",
  "description": "In a career spanning half a century, Ursula K. Le Guin has produced a body of work that testifies to her abiding faith in the power and art of words. She is perhaps best known for imagining future intergalactic worlds in brilliant books that challenge our ideas of what is natural and inevitable in human relations—and that celebrate courage, endurance, risk-taking, and above all, freedom in the face of the psychological and social forces that lead to authoritarianism and fanaticism. It is less well known that she first developed these themes in the richly imagined historical fiction collected in this volume, which inaugurates the Library of America edition of her works.The Complete Orsinia gathers for the first time the entire body of work set in the imaginary central European nation of Orsinia: the early novel Malafrena, begun in the 1950s but not published until 1979, the related stories originally published in Orsinian Tales (1976), and additional stories and songs. In a new introduction written for this volume, Le Guin describes the breakthrough that led to her first novel: “Most of what I read drew me to write about Europe; but I knew it was foolhardy to write fiction set in Europe if I’d never been there. At last it occurred to me that I might get away with it by writing about a part of Europe where nobody had been but me.” So Orsinia was established, a country, like its near neighbors Czechoslovakia, Poland, and Romania, with a long and vivid history of oppression, art, and revolution.An epic meditation on the meaning of hope and freedom, love and duty, Malafrena takes place from 1825 to 1830, when Orsinia is a part of the Austrian empire. Itale Sorde, the idealistic heir to Val Malafrena, an estate in the rural western provinces, leaves home against his father’s wishes to work as a journalist in the cosmopolitan capital city of Krasnoy, where he plays an integral part in the revolutionary politics that are roiling Europe.Thirteen additional stories trace the history of Orsinia from the twelfth century, when it first emerges as an independent kingdom, to 1989, when its repressive Stalinist government falls in an Orsinian Velvet Revolution. The poem “Folksong from the Montayna Province,” Le Guin’s first published work, joins two never before published songs in the Orsinian language.The volume also features a newly researched chronology of Le Guin’s life and career, and detailed notes. The beautiful full-color endpaper map of Orsinia is drawn by Le Guin herself.",
  "genres": [
    "Fiction",
    "Fantasy",
    "Historical Fiction",
    "Short Stories",
    "Alternate History",
    "Collections",
    "Science Fiction"
  ],
  "author": "Ursula K. Le Guin",
  "average_rating": "4.03",
  "url": "https://www.goodreads.com/book/show/28186399-the-complete-orsinia"
}