{
  "title": "Since the Sirens",
  "description": "A hundred years ago, the Spanish Flu inoculated the world from the zombie apocalypse.During the next century, those with immunity slowly died off.Today, only those over 100 retain it.Liam Peters is a young man obsessed with video games, texting his friends, and wearing down his parents' sanity. He made some bad choices and now must spend a long summer time-out with his great-grandmother.Marty Peters is a pixie-sized woman who, despite being 104, maintains her routines with the help of a live-in nurse. Though fiercely independent for her age, she invites Liam into her home for a few months to help his mom and dad.When tornado sirens herald the beginning of a pandemic, Liam and Marty put their family ties to the test. She knows she'll slow him down, so she begs him to leave her. He could go faster without her, but is it the right thing to do?Once into the city with the rest of the fleeing population, every decision Liam makes will affect their chances of making it out alive, but his youthful decisions might also determine the fate of humanity.Marty saw the Spanish Flu. She recognizes this is a hundred times worse.Praise for Since the \"Love this series. Can't wait to read more! A truly unique take on end of the world themes.\"\"This was the first book where after I finished reading it, I went on Facebook and started following the author and even messaged the author.\"\"Echoes of King's \"The Stand\" vaguely coming through but in no way ripping off any story lines.\"\"Not a big fan of zombie books, but the author is such a good storyteller I got sucked right into it.\"\"From \"Slow Burn\" to \"Whiskey Tango Foxtrot\", this novel sets a mood of action, distinct imagery and likable characters.\"Collectively, all seven books combine to over 400 4+ star ratings on Amazon. Here are some reviews from book 6, so you know this isn't a trap!\"I can't wait until the next book comes out I'm obsessed with this series! This was the best one yet.\"\"Loved this series!!!!! If you are a fan of end of the world as we know it scenarios, buy this! Can't wait for more of his books!!!\"\"OMG! You have got to be kidding me! I have to wait for the next book? I might go crazy waiting for the next one!\"",
  "genres": [
    "Zombies",
    "Horror",
    "Apocalyptic",
    "Post Apocalyptic",
    "Science Fiction",
    "Paranormal",
    "Fiction"
  ],
  "author": "E.E. Isherwood",
  "average_rating": "4.12",
  "url": "https://www.goodreads.com/book/show/28184373-since-the-sirens"
}