{
  "title": "All Debts, Public And Private",
  "description": "How far will you go when betrayed by people you thought you knew?  An inexperienced sheriff working his first kidnapping. A lottery-winning grandmother determined to handle things in her own savage way. And the ruthless party-girl in the middle of it all.  Sheriff Billy Keene is in way over his head. He knows it and so does everyone else in the small town of Caulfield. So when the spoiled granddaughter of a local-lottery winner is kidnapped, everyone is telling Billy how to do his job. Or, worse, not telling him anything at all.  Newly-rich Arlita Hardy’s certainly not saying much and why should she?  Rather than leave her granddaughter's life in the hand's of a lawman as green as Billy, Arlita decides to use her money and a local thug to rescue her granddaughter — and punish the kidnappers.  And in the middle of it all: Sharla Ricketts.  As usual, she’s drinking and drugging, playing one side against the other and lying to the liars. But Sharla’s life has gotten out of hand since we last saw her in Getaway. She doesn’t realize that this time all her craziness may cost her more than she's willing to pay.  With time running out and the meth-head kidnappers growing more brutal each day, Billy scrambles to be the first to find Arlita’s missing granddaughter. But Billy’s always a step behind Arlita…and his next step might just get him killed.  With All Debts, Public And Private, the first crime novel in The Billy Keene Stories, award-winning crime fiction author Chad Sanborn gives readers a welcome addition to the American crime fiction tradition of Elmore Leonard, Jim Thompson and Joe R. Lansdale.  Get All Debts, Public And Private to take the first wild ride in this twisting, darkly wry and riveting series!   WHAT AMAZON READERS ARE SAYING ABOUT ALL DEBTS, PUBLIC AND PRIVATE:  “The tale is twisted, funny and most important, HUMAN”  “Twists and turns you don't see coming”  “…like a mashup of a Jim Thompson novel with a John Hiatt song…cunning, funny, human, and brutal, often at the exact same time”  “I definitely stayed up too late several nights just to read ‘one more chapter’”  “(Billy Keene) is not what one would expect as sheriff…He's not macho, but he sure is human”  “What a fun book! Really enjoyable read. Give this book a try”  “(Billy Keene) is no super-sleuth or clichéd ‘plays by his own rules’ tough guy, and his humanity is what makes us root for him all the more”  “I didn't want to put it down”  “I read fiction books with action…authors like Vince Flynn, David Baldacci, James Patterson, Patricia Cornwall( Kay Scarpita series),Tom Clancy and others….I will be a fan of the Billy Keene series and anything else Mr. Chad Sanborn choses to gift us with”    PRAISE FOR CHAD SANBORN:  Chad’s writing is “exceptionally light on its feet, striking exactly the right note without appearing to try too hard.\" — Michael Harvey, author of The Chicago Way and We All Fall Down   “…strong voice, assured prose…&qu",
  "genres": [
    "Mystery",
    "Suspense"
  ],
  "author": "Chad Sanborn",
  "average_rating": "3.80",
  "url": "https://www.goodreads.com/book/show/28182758-all-debts-public-and-private"
}