{
  "title": "The Spawning Grounds",
  "description": "The long-awaited new novel by the two-time Giller-shortlisted author is full of the qualities Gail Anderson-Dargatz's fans it's an intimate family saga rooted in the Thompson-Shuswap region of British Columbia, and saturated with the history of the place. A bold new story that bridges Native and white cultures across a bend in a river where the salmon run.On one side of the river is a ranch once owned by Eugene Robertson, who came in the gold rush around 1860, and stayed on as a homesteader. On the other side is a Shuswap community that has its own tangled history with the river--and the whites. At the heart of the novel are Hannah and Brandon Robertson, teenagers who have been raised by their grandfather after they lost their mother. As the novel opens, the river is dying, its flow reduced to a trickle, and Hannah is carrying salmon past the choke point to the spawning grounds while her childhood best friend, Alex, leads a Native protest against the development further threatening the river. When drowning nearly claims the lives of both Hannah's grandfather and her little brother, their world is thrown into chaos. Hannah, Alex, and most especially Brandon come to doubt their own reality as they are pulled deep into Brandon's numinous visions, which summon the myths of Shuswap culture and tragic family stories of the past.    The novel hovers beautifully in the fluid boundary between past and present, between the ordinary world and the world of the spirit, all disordered by the human and environmental crises that have knit the white and Native worlds together in love, and hate, and tragedy for 150 years. Can Hannah and her brother, and Alex, find a way forward that will neither destroy the river nor themselves?",
  "genres": [
    "Fiction",
    "Canada",
    "Historical Fiction",
    "Book Club",
    "Magical Realism",
    "Historical",
    "Adult Fiction"
  ],
  "author": "Gail Anderson-Dargatz",
  "average_rating": "3.71",
  "url": "https://www.goodreads.com/book/show/28185966-the-spawning-grounds"
}