{
  "title": "Unwanted: A Murder Mystery of the Gilded Age",
  "description": "A Sensational Crime and Trial that Confronted Racism, Sexism, and Privilege as America Took to the World StageOn the foggy, cold morning of February 1, 1896, a boy came upon what he thought was a pile of clothes. It was soon discovered to be the headless body of a young woman, brutally butchered and discarded. She was found just across the river from one of the largest cities in the country, Cincinnati, Ohio. Soon the authorities, the newspapers, and the public were obsessed with finding the poor girl’s identity and killer. Misinformation and rumor spread wildly around the case and led authorities down countless wrong paths. Initially, it appeared the crime would go unsolved. An autopsy, however, revealed that the victim was four months pregnant, presenting a possible motive. It would take the hard work of a sheriff, two detectives, and the unlikely dedication of a shoe dealer to find out who the girl was; and once she had been identified, the case came together. Within a short time the police believed they had her killers—a handsome and charismatic dental student and his roommate—and enough evidence to convict them of first-degree murder. While the suspects seemed to implicate themselves, the police never got a clear answer as to what exactly happened to the girl and they were never able to find her lost head—despite the recovery of a suspicious empty valise. Centering his riveting new book, A Murder Mystery of the Gilded Age , around this shocking case and how it was solved, historian Andrew Young re-creates late nineteenth- century America, where Coca-Cola in bottles, newfangled movie houses, the Gibson Girl, and ragtime music played alongside prostitution, temperance, racism, homelessness, the rise of corporations, and the women’s rights movement. While the case inspired the sensationalized pulp novel Headless Horror , songs warning girls against falling in love with dangerous men, ghost stories, and the eerie practice of random pennies left heads up on a worn gravestone, the story of an unwanted young woman captures the contradictions of the Gilded Age as America stepped into a new century, and toward a modern age.",
  "genres": [
    "True Crime",
    "History",
    "Nonfiction",
    "Mystery",
    "Book Club",
    "Crime"
  ],
  "author": "Andrew      Young",
  "average_rating": "3.44",
  "url": "https://www.goodreads.com/book/show/28189945-unwanted"
}