{
  "title": "The Perfect Mess",
  "description": "Landon Bright was two months away from a new job in a new city when an encounter with an old friend changes everything. Despite common sense telling him it's a bad idea, Landon gives in and goes on a blind date.   Ben Marshall is completely over men and dating but gives in when his sister's boyfriend insists he has the perfect guy for Ben and agrees to be set up. Not only is Landon the perfect guy, but Ben has the best night of his life. The only fault he can find is that Landon is moving in a few months.   For a moment, Landon was sure Ben was going to kiss him and he tilted his head forward as he held his breath. There was a soft clink on the counter and Landon had to blink several times to get his eyes to focus. He pulled them away from Ben’s lips and the bartender gestured at their drinks.  “Want to get a table?” Ben asked. His voice had gone deep and smokey and Landon nodded as he reached for their glasses and handed one to Ben.  “Definitely,” he said then waved toward the booths across the room. Ben turned and Landon’s eyes fell to Ben’s ass as he followed and he wondered if it was too soon to offer his face as a seat. Jesus, slow down! He scolded as they reached the table. Landon watched as Ben sat then quickly scooted onto the bench next to him before he had a chance to overthink it. “I hope you don’t mind,” he said as he stretched his arm along the back of the seat behind Ben’s shoulders. Ben smiled as he shook his head.  “Not at all,” Ben murmured as he turned sideways so he could face Landon. “I hate when you have to talk loud or strain to hear someone and this place looks like it could get really busy later,” he replied and Landon smiled as he raised his glass and sipped. He swallowed and took a deep breath and Ben’s soft scent made Landon dizzy. He smelled rich and warm, like sandalwood, vanilla and fabric softener. Landon leaned closer and inhaled again.  “You smell incredible, I can’t get enough of it,” he admitted and Ben choked on his drink. Landon scrubbed his hand over his eyes and swore under his breath. “I’m sorry. I don’t know why I’m coming on so strong. I’m nervous and out of practice. And I wasn’t prepared for you to be so…” His voice died when Ben’s hand wrapped around his thigh. “Hot,” Landon whispered hoarsely as heat washed over him. Ben chuckled as his head tilted forward.  “I like it.” Ben’s breath was warm and a sweet blend of whiskey and mint against Landon’s lips. “I’m a lot more nervous than I expected too,” he admitted and the heat spilled lower and pooled in Landon’s groin. Landon’s heart beat hard against his ribs and his eyes felt heavy as his lips tingled. It was taking every ounce of strength he had not to press them against Ben’s. He swallowed past the knot in his throat then coughed softly to clear it.  “Could we maybe…” Landon licked his lips and Ben’s parted. “I think it would be a lot easier for me to concentrate if we got the first one over with,” he murmured.  “The first what?” Ben asked quietly as his hand tightened around Landon’s thigh.  “Kiss,” Landon breathed and Ben’s head nodded faintly as it lowered.  The first brush of their lips was gentle and tentative. Landon gasped as the lush softness and warmth of Ben’s lips sent a ripple of giddiness through him. Ben exhaled and Landon could taste it. He moaned as he angled his head and pressed his lips firmly against Ben’s as his tongue slid into the sweetness of Ben’s mouth.",
  "genres": [],
  "author": "K. Sterling",
  "average_rating": "3.93",
  "url": "https://www.goodreads.com/book/show/28194615-the-perfect-mess"
}