{
  "title": "Just Medicine: A Cure for Racial Inequality in American Health Care",
  "description": "An innovative plan to eliminate inequalities in American health care—and save the lives they “Highly engaging and worthwhile reading.” ―Health Affairs Over 84,000 black and brown lives are needlessly lost each year due to health the unjust and avoidable differences between the quality and quantity of health care provided to Americans who are members of racial and ethnic minorities and care provided to whites. Health disparities have remained stubbornly entrenched in the American system—and in Just Medicine Dayna Bowen Matthew finds that they principally arise from unconscious racial and ethnic biases held by physicians, institutional providers, and their patients. Implicit bias is the single most important determinant of health and health care disparities. Because we have missed this fact, the money we spend on training providers to become culturally competent, expanding wellness education programs and community health centers, and even expanding access to health insurance will have only a modest effect on reducing health disparities. We will continue to utterly fail in the effort to eradicate these disparities unless we enact strong, evidence-based legal remedies that accurately address implicit and unintentional forms of discrimination, to replace the weak, tepid, and largely irrelevant legal remedies currently available. Our continued failure to purge the effects of implicit bias from American health care, Matthew argues, is morally untenable. In this book, she unites medical, neuroscience, psychology, and sociology research on implicit bias and health disparities with her own expertise in civil rights and constitutional law to confront the issues keeping the health care system from providing equal treatment to all.   “Necessary reading for all who envision a society in which health equity is a moral imperative. I would place Matthew’s contributions on the scale of Michelle Alexander’s transformational book, The New Jim Crow.” ―Political Science Quarterly",
  "genres": [
    "Medicine",
    "Nonfiction",
    "Medical",
    "Social Justice",
    "Race",
    "Health Care",
    "Anti Racist"
  ],
  "author": "Dayna Matthew",
  "average_rating": "3.91",
  "url": "https://www.goodreads.com/book/show/28198137-just-medicine"
}