{
  "title": "Galileo Galilei – A Short Biography: Father of Modern Science and Physics",
  "description": "Galileo Galilei grew up in a time when nearly everyone thought the Earth was the center of the universe and the Sun and the planets revolved around the Earth. His intellectual world was dominated by the work of the ancient philosopher Aristotle. Science as we know it today was just starting to emerge from the dark ages and it was blended with religion so that the two were hard to distinguish between. -- Galileo’s work included a radial improvement in a parlor toy called a spyglass, which he turned into a working instrument of astronomy, the military, and mariners. With his small telescope he opened up the night sky and discovered the Moon is not smooth but rather covered with peaks and valleys similar to the Earth, that the planet Jupiter had moons that orbited the planet, and that the planet Venus showed phases as it orbited the Sun — similar to the phases of the Moon. --Once the local clergy got wind of Galileo’s heretical views that the Earth was not the center of the universe, he was under intense scrutiny from the Church. He traveled to Rome, not once but twice, to defend his views on the cosmos. -- Escaping the penalty of imprisonment or being burnt at the stake, he was given house arrest for the remainder of his life. Working under house arrest, he was able to complete some the most important work of his life and he had his work smuggled out of Italy to be published without censorship. Take a short journey into the world of this amazing man and understand how he changed the world. 30 Minute Book Series Welcome to the first book in the 30 Minute Book Series. Each book in the series is fast paced, well written, accurate, and covers the story in as much detail as a short book allows. In less than an hour, you can read or listen to the book — a perfect companion for a lunch hour or a nice distraction for a train ride home from work. About the Author Doug West is a retired engineer, small business owner, and an experienced non-fiction writer with several books to his credit. His writing interests are general, with special expertise in science, biographies, numismatics, and “How To” topics. Doug has a Ph.D. in General Engineering from Oklahoma State University.",
  "genres": [],
  "author": "Doug West",
  "average_rating": "4.10",
  "url": "https://www.goodreads.com/book/show/28198072-galileo-galilei-a-short-biography"
}