{
  "title": "Corruption of Power",
  "description": "OUTSTANDING THRILLER OF 2016, IAN BOOK OF THE YEAR AWARDSMEDAL WINNER AT THE INDEPENDENT PUBLISHERS BOOK AWARDS 2016 MEDAL WINNER AT THE eLIT BOOK AWARDS 2016. NOMINATED AS A FINALIST IN IAN BOOK OF THE YEAR AWARD 2016Russia's sights are set on expansion. The prospect of a new cold war is inconsequential . . . .The Russian President is intent on restoring his country to its former glory by regaining much of the territory that it lost when the Soviet Union broke up. His experience in Crimea has taught him that the West won’t fight to defend these territories, but it will impose damaging economic sanctions. As a result, he resolves to switch Russia’s economic focus to the East with the objective of minimizing the impact of these sanctions when they inevitably follow his incursions into neighbouring countries. One element of this strategy involves developing new markets in the East for his Russia’s massive oil and gas deposits.A major component of the plan involves building an oil pipeline through Turkmenistan and Afghanistan to access the Eastern markets, but when this goes wrong, it threatens to bring the conflagration currently raging in the Middle East right inside Russia’s own borders. The President turns to independent troubleshooter, ALEX LEKSIN, to put the plan back on course.Leksin’s task is made more difficult by the fact that the company responsible for implementing the pipeline project is now run by oligarch’s daughter, Vika Usenko, to whom Leksin had once been engaged. Worse still, responsibility for the pipeline itself rests with her embittered, resentful brother.Against a backdrop of political corruption, state sponsored terrorism, and increased Taliban insurgency, Leksin’s investigation takes him from Moscow to Turkmenistan, one of the world's most sinister countries right at the heart of Central Asia. Wherever he goes, someone tries to kill him; people who may be able to help him are assassinated; and information turns to misinformation. When at last he discovers the truth, he is no longer sure whom he can trust.",
  "genres": [
    "Thriller"
  ],
  "author": "G.W. Eccles",
  "average_rating": "4.15",
  "url": "https://www.goodreads.com/book/show/28192570-corruption-of-power"
}