{
  "title": "Girl Mans Up",
  "description": "Like Julie Anne Peters’ Keeping You a Secret, Girl Mans Up is a totally engrossing portrayal of a gay teen’s coming of age. Pen is only comfortable dressing like a boy, but it’s confusing to her friends and unacceptable to her family. And then one day she meets Blake, and little by little, it all begins to make sense.Pen Oliviera is sort of chunky, an amazing gamer and a girl. Mistaken for a boy in restaurants, bathrooms and everywhere else—all she wants is to be the kind of girl she is.“So, you’re like, a girl?” Avery asks. “Like a gay girl?”“Uh…” I say, staring back at her, pulling the straw in and out of my cup, making it squeak against the plastic lid. Colby takes a drag, and exhales liquid smoke in swirls.“I just didn’t want to assume…” Avery says, frowning.“Assume I’m a girl? I am, so that’s cool,” I say.“Do your parents know?”“That I’m a girl?”Colby snorts a laugh.“That you’re gay,” Avery says.“I don’t really know. I guess it’s obvious,” I say, but I don’t think of myself as being gay, because that word sounds like it belongs to some guy. And lesbian sounds like it’s some forty-year-old woman’s. And queer feels like it can mean anything, but like, am I queer because I like girls, or because I look the way I do? Maybe I don’t know enough words.Pen is used to catching hell for looking and acting like a boy—especially from her parents—but in the Canadian suburbs where she lives, there’s nowhere to escape to. No Greenwich Village. No Castro. No LGBT club at school. No one to talk to, either. Her pal Colby, from two doors down, gave Pen respect from the first time he met her playing hockey when they were small, but Colby has become conflicted about Pen’s value to him, and he’s really nasty. Lucky for Pen—she’s met Blake—also a gamer, and a girl who Pen says “wins everything.” Can Pen manage to respect Colby’s “loyalty code” even though his jealousy of her has become cruel and toxic? Pen has to man up and figure it out.",
  "genres": [
    "LGBT",
    "Young Adult",
    "Contemporary",
    "Queer",
    "Fiction",
    "Romance",
    "Realistic Fiction"
  ],
  "author": "M.E. Girard",
  "average_rating": "3.97",
  "url": "https://www.goodreads.com/book/show/28217802-girl-mans-up"
}