{
  "title": "What Happened to Tom",
  "description": "Fiction. Women's Studies. Inspired by Judith Jarvis Thomson's philosophical thought experiment \"The Violinist,\" WHAT HAPPENED TO TOM? is a psychological and philosophical thriller. Plan B became available without a prescription well after Viagra became so very popular. No surprise then, that Tom, like many men, assumes that since pregnancy is a natural part of being a woman, it's no big deal: a woman finds herself pregnant, she does or does not go through with it, end of story. But then Tom wakes up to find his body's been hijacked and turned into a human kidney dialysis machine. He has to stay connected to Simon for nine months or Simon will die. Much of the novel is written as dialogue between Tom and the female doctor who did this to him (they met in a bar and he remembers nothing more); Tom and his friend Steve; his girlfriend, Beth; and, eventually, the violinist named Simon. Tom finds he is powerless to take legal or medical action to deal with the situation and loses everything. Considering this situation analogous to an unwanted pregnancy, this book draws out the ethical dimension of a pro-choice position. WHAT HAPPENED TO TOM? is ultimately a feminist allegory about women's reproductive rights.“This powerful book plays with the gender gap to throw into high relief the infuriating havoc unwanted pregnancy can wreak on a woman’s life. Once you’ve read What Happened to Tom, you’ll never forget it.”—Elizabeth Greene, author of Understories and Moving\"Peg Tittle’s What Happened to Tom takes a four-decades-old thought experiment and develops it into a philosophical novella of extraordinary depth and imagination. Tittle uses Judith Jarvis Thompson’s famous violinist illustration from her 1971 essay “A Defense of Abortion” as the inspiration for this story of Tom who is kidnapped and surgically attached to a famous violinist. Tittle adds multiple nuances to Thomson’s original scenario, and the novel takes dark, unexpected turns as Tom desperately tries to extract himself from his dire situation. Part allegory, part suspense (perhaps horror) novel, part defense of bodily autonomy rights (especially women’s), Tittle’s book will give philosophers and the philosophically minded much to discuss.\"—Ron Cooper, author of Hume’s Fork and other philosophical novels as well as Heidegger and Whitehead: A Phenomenological Examination into the Intelligibility of Experience; Professor, College of Central Florida",
  "genres": [],
  "author": "Peg Tittle",
  "average_rating": "4.22",
  "url": "https://www.goodreads.com/book/show/28215030-what-happened-to-tom"
}