{
  "title": "Healing Spiritual Wounds: Reconnecting with a Loving God After Experiencing a Hurtful Church",
  "description": "An effective plan to help those suffering from wounds inflicted by the church find spiritual healing and a renewed sense of faith.Raised as a conservative Christian, minister and author Carol Howard Merritt discovered that the traditional institutions she grew up in inflicted great pain and suffering on others. Though she loved the spirituality the church provided, she knew that, because of sexism, homophobia, and manipulative religious politics, established religious institutions weren’t always holy or safe. Instead of offering refuge, these institutions have betrayed people’s hearts and souls. “People have suffered religious abuse,” she writes, “which can be different from physical injury or psychological trauma.”Though participation and affiliation in traditional religious institutions is waning, many people still believe in God. Merritt contends that many leave the church because they have lost trust in the institution, not in God. Healing Spiritual Wounds addresses the church’s dichotomous image—as a safe space and as a dangerous place—and provides a way to restore personal faith and connection to God for those who have been hurt or betrayed by established institutions of faith. Merritt lays out a multistage plan for moving from pain to spiritual rebirth, from recovering theological and emotional shards to recovering communal wholeness.Merritt does not sugarcoat the wrongs institutions long seen as trustworthy have inflicted on many innocent victims. Sympathetic, understanding, and deeply positive, she offers hope and a way to help them heal and reclaim the spiritual joy that can make them whole again.",
  "genres": [
    "Religion",
    "Nonfiction",
    "Spirituality",
    "Christianity",
    "Faith",
    "Theology",
    "Christian"
  ],
  "author": "Carol  Howard",
  "average_rating": "4.05",
  "url": "https://www.goodreads.com/book/show/28217793-healing-spiritual-wounds"
}