{
  "title": "Raymond Pettibon: Homo Americanus",
  "description": "\"Raymond Pettibon: Homo Americanus\" presents over 600 works from every part of the artist's career, the majority of which have never been published before. Arranged thematically in 32 chapters, it charts the appearance and development of the themes that have defined Pettibon's oeuvre. Sections are introduced with excerpts from interviews with the artist, and are further discussed in an appendix by curator Ulrich Loock. Also featured are biographical notes compiled by Lucas Zwirner. This catalogue is the first to tackle Pettibon's work as a whole-as a kind of hive-mind of American culture whose various branches constantly address and reinterpret one another. Of particular interest are Pettibon's own readings of individual works in the book. In excerpts paired with corresponding images, Pettibon guides readers through his complex turns of thought, inviting readers to enter more deeply into his thinking. Published for a major Pettibon retrospective in Europe, the book includes a complete facsimile of his first artist's book, \"Captive Chains\"-unavailable for decades-plus early drawings completed with his nephew, record covers, flyers and sections dedicated to collages and drawings from the 1980s to today. This is the definitive Pettibon volume for novices and experts alike. Born in 1957 in Tucson, Arizona, Raymond Pettibon grew up in Hermosa Beach and graduated with a degree in economics from the University of California, Los Angeles, in 1977. Pettibon's work has been exhibited widely throughout the US and abroad. Prominent venues which have held recent solo exhibitions include the MoCA San Diego, La Jolla, California; and the Whitney Museum, New York (both 2005). In 1998, he had his first American museum presentation, organized by The Renaissance Society at the University of Chicago in collaboration with the Philadelphia Museum of Art, which traveled to The Drawing Center, New York, and the MOCA, Los Angeles.",
  "genres": [
    "Art",
    "Music"
  ],
  "author": "Raymond Pettibon",
  "average_rating": "4.35",
  "url": "https://www.goodreads.com/book/show/28215736-raymond-pettibon"
}