{
  "title": "Stephen Hawking On Trial: Confronting the Big Bang",
  "description": "The wee Doctor behind the electronic voice on trial? Stephen Hawking's influence was significant. Nonetheless, renowned cosmologists have detected serious errors in his Grand Design theory of the universe. Stephen Hawking On Trial documents the flaws in the final theory of an elder physicist. Inconsistencies in Hawking’s  • Hypotheses vital to his theory lack supportive data • Three major questions he glossed over deserve real answers • What we factually know, but more importantly, what Hawking's theory fails to explain Critical roadblocks in today's cosmology 1. \"Theoretical physics is at a crossroads right now…In a sense we’ve entered a very deep crisis.” Neil Turok PhD – Director of the Perimeter Institute for Theoretical Physics 2. Cosmology doesn’t thrive on uncertainty. Hawking's Grand Design thesis increased the uncertainty factor. That's why independent investigators legitimately “Can we have a look at your data?” Verifying theories is the basis of the scientific method. No human is perfect, hence all theories and research must face exacting scrutiny. Evidence must be beyond reasonable doubt - the rationale jurors, scientists, and logical people use to settle an issue. 3. the Most Common Force in Nature. Stephen Hawking On Trial analyzes how Dr. Hawking misapplied gravity and utilized unproven hypotheses to support his Grand Design theory. It was scientifically unjustifiable because hypotheses are simply ideas, hopes, and aspirations. 4. Dark matter and dark energy are two unknown forces that govern 96% of the universe. Thus, every physicist concedes that science understands only 4% of the cosmos. Most physicists agree that our knowledge of the laws of physics are far from settled. Despite the evidence, Professor Hawking declared on a national TV “The scientific account is complete.\" Can a 4% understanding represent a complete account of the universe? \"I would rather have questions that can't be answered than answers that can't be questioned.\" Richard Feynman PhD – eminent physicist acclaimed for his work in quantum electrodynamics and particle physics 5. Although Prof. Hawking portrayed his Grand Design theory as scientific (i.e. supported by data) most of his \"evidence\" turned out to be clouds of caveats and probabilities. Few of his ideas were supported by genuine data. “As a scientist and as an educator, I like the idea that we believe things because there’s evidence.” Richard Dawkins PhD – Oxford University Professor & Bestselling Author \"Stephen Hawking On Trial is compelling reading for anyone with an interest in physics and cosmology. It may challenge your beliefs, or maybe not, but it's a fascinating read in either case.\" J. Chambers – Amazon Top 10 Reviewer Unfortunately, some Hawking followers are rudely attacking the author of this book. Of course, ad hominem defamation only reveals an inability to address logical arguments.",
  "genres": [
    "Science"
  ],
  "author": "Pierre St. Clair",
  "average_rating": "3.46",
  "url": "https://www.goodreads.com/book/show/28218269-stephen-hawking-on-trial"
}