{
  "title": "The Preah Secrets",
  "description": "The PREAH SecretsMore is going on than meets the eye in the Port Royal Exotic Animal Hospital, a state-of-the-art facility in a wealthy community in southwest Florida. Dr. Carston Spencer and his wife Madison, who own the hospital, are prominent residents in Port Royal, but few know the skeletons in their closets. Carston kicked a drug addiction that cost his former wife and children, although he's stayed sober for 14 years, and Madison is considering an affair with a hot young cowboy who works at the hospital, although she'd prefer to wait until her divorce is final.A trial over who killed a staff member's father may put even more pressure on those at the hospital as rumors of an incestuous affair involving two sisters and their father lie at the heart of their self-defense claim. Friendships and deals between prominent doctors, a high-powered real estate agency, state's attorney, sheriff's deputy, businessmen, ranch hands, and an exotic bird breeder mean anything can happen.The PREAH Secrets, inspired by real events, takes readers on a wild ride of secrets, sex, murder and deceit, with one twist after another until the dramatic conclusion.AUTHOR BIOAuthor K.B. Beaumaaks grew up in the Midwest in a closeknit Catholic family. She spread her wings by being the first in her family to leave the state to attend college. K.B. moved to Europe and traveled the world, thanks to a military spouse, before marrying her husband Allan, an F-16 pilot with the Royal Danish Air Force. She spent more than 30 years in medicine before starting The PREAH Secrets, her first novel, which details some of the crazy relationships and experiences she's had.She and Allan own three pizza restaurants. He's now a commercial pilot and she's a director of patient care. Their life in Florida includes rescue dogs: a pug named Mushey and an English Bulldog named Maggie Moo.",
  "genres": [],
  "author": "K.B. Beaumaaks",
  "average_rating": "4.41",
  "url": "https://www.goodreads.com/book/show/28210590-the-preah-secrets"
}