{
  "title": "Replica",
  "description": "Two girls, two stories, one epic novelFrom Lauren Oliver, New York Times bestselling author of Before I Fall and the Delirium trilogy, comes an epic, masterful novel that explores issues of individuality, identity, and humanity. Replica is a “flip book\" that contains two narratives in one, and it is the first in a duology. Turn the book one way and read Lyra's story; turn the book over and upside down and read Gemma's story. The stories can be read separately, one after the other, or in alternating chapters. The two distinct parts of this astonishing novel combine to produce an unforgettable journey. Even the innovative book jacket mirrors and extends the reading experience.Lyra's story begins in the Haven Institute, a building tucked away on a private island off the coast of Florida that from a distance looks serene and even beautiful. But up close the locked doors, military guards, and biohazard suits tell a different story. In truth, Haven is a clandestine research facility where thousands of replicas, or human models, are born, raised, and observed. When a surprise attack is launched on Haven, two of its young experimental subjects—Lyra, or 24, and the boy known only as 72—manage to escape.Gemma has been in and out of hospitals for as long as she can remember. A lonely teen, her life is circumscribed by home, school, and her best friend, April. But after she is nearly abducted by a stranger claiming to know her, Gemma starts to investigate her family's past and discovers her father's mysterious connection to the secretive Haven research facility. Hungry for answers, she travels to Florida, only to stumble upon two replicas and a completely new set of questions.While the stories of Lyra and Gemma mirror each other, each contains breathtaking revelations critically important to the other story. Replica is an ambitious, thought-provoking masterwork.",
  "genres": [
    "Young Adult",
    "Science Fiction",
    "Fiction",
    "Dystopia",
    "Fantasy",
    "Mystery",
    "Contemporary"
  ],
  "author": "Lauren Oliver",
  "average_rating": "3.63",
  "url": "https://www.goodreads.com/book/show/28219385-replica"
}