{
  "title": "Bones",
  "description": "When it comes to writing deftly layered, tightly coiled novels of suspense, #1 New York Times bestselling author Jonathan Kellerman reigns supreme as “master of the psychological thriller” (People). Now, Kellerman has worked his magic again in this chilling new masterpiece.The anonymous caller has an ominous tone and an unnerving message about something “real dead . . . buried in your marsh.” The eco-volunteer on the other end of the phone thinks it’s a prank, but when a young woman’s body turns up in L.A.’s Bird Marsh preserve no one’s laughing. And when the bones of more victims surface, homicide detective Milo Sturgis realizes the city’s under siege to an insidious killer. Milo’s first move: calling in psychologist Alex Delaware. The murdered women are prostitutes–except the most recent victim; a brilliant young musician from the East Coast, employed by a wealthy family to tutor a musical prodigy, Selena Bass seems out of place in the marsh’s grim tableau. Conveniently–perhaps ominously–Selena’s blueblood employers are nowhere to be found, and their estate’ s jittery caretaker raises hackles. But Milo’s instincts and Alex’s insight are too well-honed to settle for easy answers, even given the dark secrets in this troubled man’s past. Their investigation unearths disturbing layers–about victims, potential victims, and suspects alike–plunging even deeper into the murky marsh’s enigmatic depths.Bizarre details of the crimes suggest a devilish serial killer prowling L.A.’s gritty streets. But when a new murder deviates from the pattern, derailing a possible profile, Alex and Milo must look beyond the suspicion of madness and consider an even more sinister mind at work. Answers don’t come easy, but the darkest of drives and desires may fuel the most devious of foes.Bones is classic Kellerman–relentlessly peeling back the skin and psyches of its characters and revealing the shadows and sins of the souls beneath. With jolt after jolt of galvanizing suspense, it drives the reader through its twists and turns toward a climax as satisfying as it is shattering.",
  "genres": [
    "Mystery",
    "Fiction",
    "Thriller",
    "Crime",
    "Mystery Thriller",
    "Audiobook",
    "Suspense"
  ],
  "author": "Jonathan Kellerman",
  "average_rating": "3.87",
  "url": "https://www.goodreads.com/book/show/2821680-bones"
}