{
  "title": "The Kindness of Strangers",
  "description": "Wall Street Journal bestseller...Featured on Oprah...The inspirational account of one man's continental leap of faith--and the country that caught himWhat would you do if you had to journey penniless across America, depending only on the kindness of those you met along the way? If you're Mike McIntyre, you might meet...A biker-turned-minister who shares faith, food, and self-defense tips with a stranger on the road...A lady firefighter who used to be a man...A lonely woman who offers a place to spend the night, and in the morning feels the loss of yet another man who leaves her...Stuck in a job he no longer found fulfilling, journalist Mike McIntyre felt his life was quickly passing him by. So one day he hit the road to trek from one end of the country to the other with little more than the clothes on his back and without a single penny in his pocket.Through his travels, he found varying degrees of kindness in strangers from all walks of life--and discovered more about people and values and life on the road in America than he'd ever thought possible.The gifts of food and shelter he received along the way were outweighed only by the touching gifts of the heart--the willingness of many he met to welcome a lonely stranger into their homes...and the discovery that sometimes those who give the most are the ones with the least to spare.\"A truly heartening book, one that restores one's faith not just in the road, but in the openness and humanity of the people of this country.\"--Salon\"A superb writer...Something about McIntyre and his quest makes people want to feed him, pray for him, reveal their innermost torments to him.\"--Los Angeles Times\"Captivating.\"--San Jose Mercury News\"An incredible journey.\"--CBS News",
  "genres": [
    "Travel",
    "Nonfiction",
    "Memoir",
    "Biography",
    "Adventure",
    "Biography Memoir",
    "American"
  ],
  "author": "Mike  McIntyre",
  "average_rating": "3.97",
  "url": "https://www.goodreads.com/book/show/117801.The_Kindness_of_Strangers"
}