{
  "title": "Tuesday's Child",
  "description": "What she doesn’t want...is exactly what he needs.  Shunned and ridiculed all her life for something she can’t control, Samantha Blair hides her psychic abilities and lives on the fringes of society. Against her will, however, she’s tapped into a killer—or rather, his victims. Each woman’s murder, blow-by-blow, ravages her mind until their death releases her back to her body. Sam knows she must go to the authorities, but will the rugged, no-nonsense detective in charge of tracking down the killer believe her?  Detective Brandt Sutherland only trusts hard evidence, yet Sam’s visions offer clues he needs to catch a killer. The more he learns about her incredible abilities, however, the clearer it becomes that Sam’s visions have put her in the killer’s line of fire. Now Brandt must save her from something he cannot see or understand…and risk losing his heart in the process.  As danger and desire collide, passion raises the stakes in a game Sam and Brandt don’t dare lose.  Length - 90,000 words. Excerpt  Agony. Pain. Terror. A voice whispered through the blackness of her mind, so odd, so different it caught her attention. She strained to hear the words. “Let go. It’s time to let go.” Sam stared through the flames, stunned. Let go of what? She couldn’t hear over the roaring fire and could barely see, but knowing that someone was there stirred her survival instinct, and she fought with the seatbelt buckle jammed at her side. She was saved. Just another minute and they’d open the door and pull her free. She’d be fine. “Please hurry,” she cried out. “Let go. You don’t need to be in there. Let it all go, and come with me.” She peered through the golden orange windshield to see a strange male face peering at her through the flames. He smiled. “Come with me.” “I want to, damn it. Can’t you see I’m trapped?” she screamed, her vocals crisping in the heat. “Release yourself. Come with me. Say yes.” The pain hit a crescendo. She twisted against it, hearing her spine splinter. The car seat melted into her skin. So much pain, she couldn’t breathe. Blackness crowded into her mind, blessed quiet, soothing darkness. She reached for it. “Let it go. You don’t need to go through this. Hurry.” She started. Why wasn’t he opening the door or getting others to help? He should be trying to save her. Shouldn’t he? Sam, so confused and so tired, she could barely feel the pain overtaking her body. Where had he gone? She tried to concentrate. His face was now only a vague outline that rippled with the heat waves. A soft smile played at the corner of his mouth. The flames burned around him, weird as they centered him in the warm glow. She wanted to be with him. To live. “Here, take my hand.” Dazed and on the brink of death, Sam focused on the hand reaching for her. She struggled to raise the charred piece of flesh that had been her arm and reached out to grasp his. She was free. Overwhelmed, she turned to hug her savior, her head just reaching his shoulder. He stood beside her, the same radiant beaming look on his face. His blond hair glowed, and he had the brightest teeth. She sighed. This beautiful man pointed to her right arm. Confused, Sam glanced down at her burned arm, realizing she could feel none of her injuries. Just like her other one, her broken arm had miraculously healed – whole, smooth and soft. Her skin hadn’t looked this good in ten years. She spun around to find a massive fireball below. What the hell? She had to be dead.",
  "genres": [
    "Paranormal",
    "Romance",
    "Mystery",
    "Fantasy",
    "Suspense",
    "Romantic Suspense",
    "Fiction"
  ],
  "author": "Dale Mayer",
  "average_rating": "3.96",
  "url": "https://www.goodreads.com/book/show/11780557-tuesday-s-child"
}