{
  "title": "Les Parisiennes: How the Women of Paris Lived, Loved, and Died Under Nazi Occupation",
  "description": "What did it feel like to be a woman living in Paris from 1939 to 1949? These were years of fear, power, aggression, courage, deprivation and secrets until – finally – renewal and retribution. Even in the darkest moments of Occupation, glamour was ever present. French women wore lipstick. Why?It was women who came face to face with the German conquerors on a daily basis – perhaps selling them clothes or travelling alongside them on the metro, where a German soldier had priority over seats. By looking at collaborators to resisters, actresses and prostitutes, as well as teachers and writers, including American women and Nazi wives, spies, mothers, mistresses, fashion and jewellery designers – Anne Sebba shows that women made life-and-death decisions every day, and, in an atmosphere where sex became currency, often did whatever they needed to survive. Her fascinating cast includes both native Parisian women and those living in Paris temporarily: American women and Nazi wives, spies, mothers, mistresses, and fashion and jewellery designers. Some like the heiress Béatrice Camondo or novelist Irène Némirovsky, converted to Catholicism; others like lesbian racing driver Violette Morris embraced the Nazi philosophy; only a handful, like Coco Chanel, retreated to the Ritz with a German lover.In enthralling detail Sebba explores the aftershock of the Second World War. How did women who survived to see the Liberation of Paris come to terms with their actions and those of others? Although politics lies at its heart, Les Parisiennes is the first in-depth account of the everyday lives of women and young girls in this most feminine of cities.",
  "genres": [
    "History",
    "Nonfiction",
    "France",
    "World War II",
    "War",
    "Womens",
    "Historical"
  ],
  "author": "Anne Sebba",
  "average_rating": "3.83",
  "url": "https://www.goodreads.com/book/show/28220943-les-parisiennes"
}