{
  "title": "Euphonics For Writers: Professional Techniques for Fiction Authors",
  "description": "Learn how to touch your readers' subconscious with subtle tricks. Certain sounds have certain effects on the psyche. By using words which include those sounds, you influence how the reader feels. Euphonic techniques are popular in poetry, but seldom used in prose. This guide shows how you can apply them to make your prose fiction sparkle. For the purpose of this book, I define euphonics as the use of sound devices for prose writing. Poets, musicians and special effects engineers have their own definitions. I'll show you which sounds to apply to manipulate your reader's psyche the way you want. You'll learn how to impress your readers with power, how make their hearts race with urgency, how to creep them out and how let them linger in a sensual scene. Part 1 is a thesaurus of sound effects where you can look up the best sounds to enhance the mood of your scene. In Part 2, you'll learn how and when to apply the sounds and how to combine them with rhythm for best effect. This book isn't meant as a definitive scholarly tome for academics, but a practical kit for working authors who want to refine their voice. I'll avoid literary theory and grammatical jargon. Instead, I'll give you useful tools. Novice writers can have inspiring fun playing with euphonics. In the hands of skilled writers - for whom this guide is intended - euphonics are power tools. Euphonics can't replace basic fiction crafting skills, but they can add impact and polish to a well-written piece. In print, the effects are very subtle, serving only to enhance what’s already there, and need to be combined with other techniques. But if you plan to perform author readings or release an audiobook, the euphonics will hold listeners enthralled with poetic power. I'm writing in British English. Some spellings, grammatical rules and word choices differ from American English, but the euphonic effects are the same. Now open your manuscript draft to give it that special polish.",
  "genres": [
    "Writing",
    "Nonfiction",
    "Reference",
    "Crafts"
  ],
  "author": "Rayne Hall",
  "average_rating": "4.30",
  "url": "https://www.goodreads.com/book/show/28223758-euphonics-for-writers"
}