{
  "title": "The Prophet's Eyes",
  "description": "From the international bestselling author Saxon Andrew, comes the second book in the Death Prophecies series. Earth and the Bosrean have managed to hide from the Traugh Empire by deceiving them into believing that the ship that destroyed their Governing Planet came from the Andromeda Galaxy. The Traugh are now ready to go and find the enemy in Andromeda and they send two major fleets to find and destroy the civilization that caused so much destruction. However, what they discover will not only put their empire at risk but also put Earth and Bosrean in danger of being found and destroyed by a new threat. The Prophet has gone home and the only thing that stands between Earth and destruction is an invisible warship that was built for the Prophet and named the Prophet’s Eyes. Hiding is no longer an option and the number of warships threating the Milky Way is beyond comprehension and sitting in the middle of Andromeda is a Darkness that threatens all life in both galaxies. The action continues and the only possible salvation must come from what the Prophet’s Eyes can do to stop this new enemy. Following the Death Prophecies may not be an option and Earth may be forced to violate the first Death Prophecy to save the two planets. Excerpt from the Prophet’s Eyes: Groh was getting the communication links downloaded into his ship’s database when he heard his communication Leader say, “I have a call from one of the Mororat Dictators.” “Send it to my chair. He saw the button start flashing and he pressed it, “Groh, I’ve been thinking about what you said during the meeting.” “I said a lot. Is there anything in particular?” “You mentioned going out to find any possible threats in that spiral galaxy.” “I did.” Well, my family and I were discussing that and the younger Director said something that made me start thinking about doing that.” “What did he say?” “He laughed and said, ‘What if that galaxy we’re about to attack also has a darkness at the core. It will probably come out and kill everything including our fleets.” Groh’s heart almost stopped. The Mororat tilted it head, which Groh would have wagered was an impossible move for his species, “Would it stop there or follow our ships back to the halo and punish us for violating its space?” “That is a scary thought.” “I know.” Groh shook his head, “I’m contacting the others and telling them what you just told me. We will destroy that civilization and leave. We could make the same mistake not knowing what’s going on in that galaxy.” “I agree with your decision. I think I might be able to sleep again now.” The display went dark and Groh wondered if he would sleep after this conversation, the possibility was terrifying.  Visit me on Facebook at saxonandrewsuniverse@facebook.com",
  "genres": [
    "Science Fiction"
  ],
  "author": "Saxon Andrew",
  "average_rating": "4.51",
  "url": "https://www.goodreads.com/book/show/28226677-the-prophet-s-eyes"
}