{
  "title": "The Playwright's Murder",
  "description": "A murder mystery set at the dawn of the 1900's with a twist you won't see coming.  Not so much a, 'Who done it?' As 'Who did what to whom and why?' Alex Winter, a struggling London playwright and teacher, is trapped in a depressing life with only one spark of happiness, his fiancée. When he arrives home to discover he has lost her to his rich cousin it is almost more than he can bear. Filled with rage, he storms out of the house and walks along the canal path that leads to the nearby train station. On his approach to a short tunnel, he spies his cousin coming from the opposite direction. The two men enter the tunnel, but only one emerges. Under a false identity he flees to America, but instead of lying low as commonsense would dictate, he becomes involved with a famous theater actress. When diligent detective, Silas Mortimer, picks out the man on his criminal radar, he begins to investigate and one by one unravels the clues. As he feels the noose growing ever tighter, the fleeing man soon discovers there is nowhere he can run where his past won't follow. A story of deceit, false identities, the theater, stolen money, revenge, murder, people trying to escape their past and an unexpected twist.  Alex Winter Mystery Thriller eBook Categories: - Thriller Action - Detective Thrillers - Detective Romance - Romantic Suspense - Murder Fiction - Mystery Action - Mystery Adventure  Paperback Book Jacket Blurb: This is a murder mystery set at the dawn of the 1900's. An era when huge steam driven beasts thundered along railway lines, when a transatlantic crossing would be aboard a luxury passenger liner and when Henry Ford's forward thinking produced cars affordable to the masses. A time when a criminal leaving behind no obvious evidence, not caught in the act or witnessed, had a good chance of escaping punishment. Those breaking the law were caught by diligent detectives seeking out the smallest clue. The finest detectives of the day had aspects from the fictionalized characters of Sherlock Holmes and Columbo. The detective of this story, Silas Mortimer, is such a man, intelligent, resourceful and possessed with a stubbornness that when his senses detected a foul crime has been committed refused to let him quit until the culprit had been apprehended. When Alex Winter, a struggling playwright and a man on the run, flees to America to become caught on Detective Mortimer's criminal radar, he soon discovers there is nowhere he can run where his past won't follow.",
  "genres": [],
  "author": "Alex  Winter",
  "average_rating": "3.40",
  "url": "https://www.goodreads.com/book/show/28227113-the-playwright-s-murder"
}