{
  "title": "No Pants Required",
  "description": "I, Makayla Alexander, am on a mission to reinvent myself. So when a super hot guy boards the plane and flashes his rock hard abs, I pay attention. When he sits next to me and offers me his nuts, I can’t resist. But when I choke on them and he tells me I need to work on my gag reflex, I realize I might be in over my head. Before I know it we’re in the lavatory and attempting to join the Mile High Club. Let me just say this...anyone who tells you it’s easy to get it on at 37,000 feet isn’t telling you the truth. After the flight attendant busts us for getting frisky in the air, the only thing that can ease my total and complete mortification is the simple fact that I am never going to see him again. Hours later, I can’t help but wonder if fate will ever allow me to become a new version of myself. Because Fate, she’s a fickle bitch. Case in point...my seatmate is my new next-door neighbor. Even with the whole fate thing we have going on, we are so not meant to be together. He’s all cool and sexy in that make love not war kind of way. Guys like him are dangerous. With that bring-you-to-your-knees body, that handsome-as-hell face, and that dirty, dirty mouth, I guarantee one glance from him wets every girl's bikini bottoms. And then there’s me…the quirky girl looking to find herself in California. All I want to do is learn to let loose. Say words like peace and groovy. Bury my toes in the sand. Who knows, maybe even have sex on the beach. Unable to get him out of my head, I entertain the thought of being more than just friends. I know the idea is absurd. And yet, I go with it. You see Camden Waters gets me. Really gets me. Like no other guy has before.On this 7-mile stretch of paradise, I decide to keep things simple and just have fun...that is until fate decides to screw with me, again. Can two people hell-bent on finding themselves realize the search should have ended the day they met? Find out in No Pants Required—a sexy, funny, romantic stand-alone, that will have you hurrying to grab your bathing suit and rushing to the beach to check out every lifeguard on duty. ***Want more of the men of Laguna? You can find Keen in Bedwrecker and Brooklyn in Hollywood Prince. These books can be read as stand-alones or as a series.",
  "genres": [
    "Romance",
    "New Adult",
    "Contemporary",
    "Humor",
    "Contemporary Romance",
    "Erotica",
    "Adult"
  ],
  "author": "Kim Karr",
  "average_rating": "3.92",
  "url": "https://www.goodreads.com/book/show/28229319-no-pants-required"
}