{
  "title": "Beyond the Shadow of War",
  "description": "The long awaited sequel to Diane Moody's bestselling Of Windmills and War.When the war finally ended in May of 1945, Lieutenant Danny McClain made good on his promise to come back for Anya in Holland. He expected her to put up a fight, but instead found her exhausted and utterly broken. Maybe it was unfair, asking her to marry him when she was so vulnerable. But this much he he would spend a lifetime helping to make her whole again.The war had taken everything from Anya--her family, her friends, her home, her faith. She clung to the walls she'd fortressed around her heart, but what future did she have apart from Danny? At least she wouldn't be alone anymore.Or so she thought. When the American troops demobilize, Danny is sent home, forced to leave Anya behind in England. There she must wait with the other 70,000 war brides for passage to America. As England picks up the pieces of war's debris in the months that follow, Anya shares a flat with three other war brides in London and rediscovers the healing bond of friendships.Once again, Danny and Anya find themselves oceans apart, their marriage confined to little more than the handwritten pages of their letters while wondering if the shadow of war will ever diminish.What readers are saying about Beyond the Shadows of \"Since I enjoyed the first book so much I read the second...I'm so happy I did. Excellent.\"\"So informative and the characters are so real. I could not stop reading as it was like being transported back in time to an era I have often wondered about. The feelings of each character make them come alive on the pages of this book.\"\"One of the best stories I have read in the longest time. This was as great as the first book Of Windmills and War.\"\"Didn't think the author could top the first book, but she did. My emotions ran the gauntlet. HIGHLY recommend this series.\"\"Beautiful story. Side of war not often told. Touching. Tender. Perfect.\"\"I could feel myself in history. I cried. What a beautiful story brought to life by the pen of Diane Moody.\"\"This was even better than Of Windmills of War. It is unusual to enjoy the second book more than the first in a series, but in this case it is true. I had a difficult time putting it down.\"",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "World War II",
    "Christian Fiction",
    "Historical",
    "War",
    "Romance"
  ],
  "author": "Diane Moody",
  "average_rating": "4.23",
  "url": "https://www.goodreads.com/book/show/28229524-beyond-the-shadow-of-war"
}