{
  "title": "Scorpio Rising",
  "description": "A criminal profiler using astrology and palmistry investigates the killing of a New York City heiress, only to discover that her death is linked to two other murders on the same day: a dot-com millionaire in San Francisco, and the team leader of a CIA counter- terrorist project in Los Alamos, New Mexico.~~~~~In the space of one hour, three strangers die violent deaths. A hit-and-run vehicle kills a dot-com millionaire jogging in San Francisco. A car bomb obliterates the team leader of a CIA counter-terrorism project in Los Alamos, New Mexico. An assailant ambushes a New York heiress walking home from Broadway and forces her own pepper spray down her throat.In all three cases, investigators reach an immediate impasse. Each victim leaves an estate of millions, but their beneficiaries all have perfect out-of-town alibis. Theories swirl around the victims like flies on a corpse – a contract killing for financial gain, a lover’s quarrel spiraled out of control, a domestic al-Qaeda strike…? The police are stymied and the FBI is worried.Axel Crowe, criminal psychologist, is summoned to New York by the brother of the woman who was murdered. Crowe is a man with an obscure past but a brilliant reputation. Occasionally he consults as a profiler for the police. More commonly, he is a finder of wayward people and stolen possessions. Despite initial stonewalling from the NYPD, Crowe profiles the killer in his own unique way – using astrology, palmistry and other unconventional techniques.His investigation follows a tangled trail of illicit relationships – from one suspect to another and, eventually, yet another. Ultimately, he learns that all three victims were killed in the space of one hour. But is it coincidence or conspiracy?Facts are gross, but the truth is subtle, Crowe’s guru used to tell him. And although the truth lies buried in the past, Crowe is relentless until he uncovers it.",
  "genres": [
    "Mystery",
    "Fiction"
  ],
  "author": "Alan Annand",
  "average_rating": "4.31",
  "url": "https://www.goodreads.com/book/show/11781745-scorpio-rising"
}