{
  "title": "The Sutherlands",
  "description": "The One Family Saga, 11 Sexy StoriesTwenty percent of the royalties earned will go to the Reach Out and Read charity.Meet the Sutherlands, a Texas oil family that doesn't break the rules...they make their own. Preorder this box set of sizzling hot, never before published full-length novels and novellas about the Sutherland family alpha heroes and kickass heroines that are sure to melt your e-reader and help you find your next book boyfriend. But act fast—this set will only be available until April 15, so pre-order yours today!Inside The Sutherlands you’ll Shadow Ranch by USA Today best selling author Robin Covington - Passion and secrets thrive in the dark…Wrecked by Wall Street Journal best selling author Terri Osburn - Revenge is always personal…Bound to Damage by Avril Ashton - When protecting you heart is no longer an option…protect your neck.Foolish Expectations by Alison Bliss - Forever is the last thing they expected…Under the Evening Star by Shyla Colt - They must choose between the past that hunts and a love that can heal…Brazen by Avery Flynn - This bad boy boxer just met his match…Screwed by Kelly Jamieson - The only time losing is more fun than winning is when you’re fighting temptation…Stripped by Abby Niles - She’s going to strip him bare…Not the Marrying Kind by Julie Particka - Faking it never felt so good…Lust and Loathing by Joya Ryan - Sometimes loathing your boss turns into the best kind of lust…Sweet Surrender by Naima Simone - The price of surrender is passion…Twenty percent of the royalties earned from each copy of The Sutherlands sold will go to help Reach Out and Read, which gives young children a foundation for success by incorporating books into pediatric care and encouraging families to read aloud together.",
  "genres": [
    "Romance",
    "Anthologies",
    "Contemporary Romance",
    "Family"
  ],
  "author": "Robin Covington",
  "average_rating": "4.38",
  "url": "https://www.goodreads.com/book/show/28248050-the-sutherlands"
}