{
  "title": "La paradoja CANE",
  "description": "Daniel Cane, un físico esquizoide y depresivo, cuya escasa vida sentimental transcurre entre su cátedra universitaria y su familia, sufre una pérdida que no puede su hijo Carl muere en un accidente de tránsito donde estuvo presente. Culpa a un mendigo que cruzaba por la calle. Ademas la relación con su hijo no es buena. Entre su ansiedad y depresión, no encontraba palabras para dirigirse a su hijo. Luego de ello entra en una depresión fuerte. Su esposa lo abandona al ver que seguía obsesionado con el accidente. Su único refugio era las escasas conversaciones con su amigo Lou. Hacía meses que no se bañaba. Hasta que fruto de su persistencia inventa una fórmula para poder viajar al pasado. Pero esto conllevará que varias agencias gubernamentales se fijen en su trabajo. Sólo un benefactor sale al rescate del proyecto de Daniael, el magnate Duncan Hershell. Para esto Duncan y Daniel tenían una mala relación desde la escuela pública de la infancia. Duncan pone a su disposición todos los recursos materiales para que Damiel y Lou concreten su trabajo.Luego de ello, nuestros protagonistas se ven atrapados en una vorágine de hechos reales que llevan al sufrimiento y la alegría.Se puede añadir que La paradoja Cane es una novela que inicia una saga de ciencia ficción peruana. Sus escenarios saltan desde Filadelfia, Mexico, Senegal, el triangulo de las Bermudas, Sumatra, hasta la inexpugnable fosa de las Marianas. Para muchos críticos fue calificada como obra de ciencia ficción. A ella se ha sumado la segunda parte \"La paradoja Cane : Las guerras por el tiempo\", que es la continuación de las aventuras de Daniel, Lou y Ububa.Pocos personajes han sido tan entrañables para este autor como el pirata Ububa Zingá.Además, este libro sirvió para dos libros tipo spin \"La saga de los azules\", y \"La extraña vida Phillip Troseau\".Carlos Vera Scamarone ha llevado a la literatura libros de cuento como \"Cartas para un éxodo\", \"Mi robot depresivo\" (ganador del concurso de cuentos del colegio médico del Perú) y Watayrunasunqui. Además también ha escrito ensayo como \"Una mirada al universo de Star Wars\". En novela destaca La paradoja Cane y Supay. Además ha participado en numerosas antologías nacionales e internacionales.Uno de sus cuentos ha sido traducido al inglés, con lo cual la carrera de Carlos Vera Scamarone, en la literatura crece con cada día que pasa. Recientemente ha sido reseñado por la Universidad de Lima en \"Un panorama de la ciencia ficción peruana\" al lado de Cesar Vallejo y Abraham Valdelomar.Tomando en cuenta la profesión del autor, médico psiquiatra (no es lo mismo que psicólogo) es lógico que se encuentre tanta variedad psicológica en su obra. Personajes depresivos como Daniel, psicópatas como Ububa, histéricos como Lou, feroces como Cecile, oportunistas como Amelia, y destructivos como Duncan. Cada cual está perfilado de tal manera que nos veamos reflejados en ellos, en cada una de sus hipérboles y abismos. La paradoja es el reflejo de la vida misma, un viento que envuelve a todos. Por ello, la clasificación de ciencia ficción a veces queda corta pues es una novela humanista, donde se explora al ser humano en su integridad, desde sus errores hasta sus aciertos. Se les invita a leer estos párrafos. Y recuerden que en Perú también escribimos buena ciencia ficción.Gracias por leer.",
  "genres": [],
  "author": "Carlos Jesús Vera Scamarone",
  "average_rating": "4.50",
  "url": "https://www.goodreads.com/book/show/28241852-la-paradoja-cane"
}