{
  "title": "And Justice There Is None",
  "description": "Award-winning author Deborah Crombie has elevated the modern mystery novel to new heights of human drama and multilayered suspense with her critically acclaimed tales of intrigue featuring Scotland Yard Detective Superintendent Duncan Kincaid and Sergeant Gemma James. In their latest outing, Kincaid and his former partner--and soon-to-be roommate--follow a twisting trail of rage and retribution whose buried roots are about to exact a deadly toll on the living.And Justice There is NoneGemma James is adjusting to professional and personal changes that include her eagerly sought promotion to the rank of inspector--and a future now intricately entwined with Duncan Kincaid. But her new responsibilities are put to the test when she is placed in charge of a particularly brutal The lovely young wife of a wealthy antiques dealer has been found murdered on fashionable Notting Hill.Dawn Arrowood was six weeks pregnant. Her lover, Alex Dunn, a porcelain dealer in London’s bustling Portobello Market, appears absolutely devastated by her death, but Gemma’s the main focus of investigation is soon Karl Arrowood, who had the most powerful motive for killing his unfaithful wife. But this case sets off warning bells for it’s far too similar to an unsolved murder in which an antiques dealer was killed in precisely the same way and when the escalating violence claims yet another victim, he and Gemma find themselves at increasing odds with each other--as two separate investigations become linked in the most startling of ways. Their hunt for a killer will traverse the teeming stalls of the city’s antiques markets to a decades-in-the-making vendetta of history and hatred that has been honed to a flawless, deadly point. To solve this case, Gemma and Duncan must walk a merciless razor’s edge through a place where true justice will be a long time coming.",
  "genres": [
    "Mystery",
    "Fiction",
    "Audiobook",
    "Mystery Thriller",
    "Crime",
    "British Literature",
    "Detective"
  ],
  "author": "Deborah Crombie",
  "average_rating": "4.11",
  "url": "https://www.goodreads.com/book/show/1178207.And_Justice_There_Is_None"
}