{
  "title": "Above the Sky",
  "description": "\"5 Stars!!!!!! Unputdownable!! My new favorite book. If YOU love a good dystopian + romance, then you need this book in your life.\" -- Megan, i fall in love book blog ★★★★★Eighteen-year-old Seven and her best friend, Ten, live in a world where all is peaceful ... except for the violent war raging above the sky. But there are strict rules and breaking them can have severe consequences.Seven and Ten have been secretly disobeying the rules for years. They sneak into places where people are forbidden to go. And sometimes, when they're alone together, they allow their bodies to touch, even though touching each other is strictly prohibited.Every year, on Assignment Day, each eighteen-year-old officially becomes an adult, and the path of their life is laid out by the Decision Makers. Some are given the jobs for which they have shown exceptional aptitude and are \"paired\" for mating. The others are sent off to fight in The War and never return.When Assignment Day comes for Seven, the assignments shatter everything she has ever believed. For the first time in her life, she is certain that the Decision Makers have made a terrible mistake.But the only way to right this wrong is to do something absolutely unthinkable.If you like mystery, suspense, adventure, best-friends-to-lovers forbidden romance, and jaw-dropping twists and turns, don't miss this must-read novel!What readers are saying about ABOVE THE SKY:\"This book is incredible! Imaginative ... fast paced ... full of action ... filled with a lot of twists and turns ... and the world building is truly fantastic. 5 Brilliant Stars.\" -- Karen Jo, Sincerely Karen Jo ★★★★★\"I didn't want to put it down the entire time I was reading. I still can't stop thinking about it.\" -- Megan, Starky Reviews ★★★★★\"An amazing read. Most stories seem predictable at some point but this one surprised me. At only one single point was I able to say, yep I see what's going to happen next. Yeah, right. I was totally wrong.\" -- Amanda, Goodreads ★★★★★ABOVE THE SKY is book one in a completed series of three novels.ABOVE THE SKY can be enjoyed as a standalone.Books in the ABOVE THE SKY TRILOGY:Book 1: ABOVE THE SKYBook 2: RETURN TO THE SKYBook 3: SHATTER THE SKYRETURN TO THE SKY and SHATTER THE SKY are sold separately.",
  "genres": [
    "Dystopia",
    "Science Fiction",
    "Young Adult",
    "Romance",
    "Fiction",
    "Fantasy",
    "Young Adult Science Fiction"
  ],
  "author": "J.W. Lynne",
  "average_rating": "4.10",
  "url": "https://www.goodreads.com/book/show/28256831-above-the-sky"
}