{
  "title": "The Rosary Girls",
  "description": "In his sleek, visceral novels Deviant Way, Kiss of Evil, and The Violet Hour, Richard Montanari slammed into the suspense field like a force of nature. Now Montanari has written an astounding novel that pits two besieged detectives against a fiercely intelligent serial killer.Sprawling beneath the statue of William Penn, Philadelphia is a city of downtrodden crack houses and upscale brownstones. Somewhere in this concrete crazy quilt, one teenage Catholic girl is writing in her diary, another is pouring her heart out to a friend, and yet another is praying. And somewhere in this city is a man who wants these young women to make his macabre fantasy become reality. In a passion play of his own, he will take the girls–and a whole city–over the edge.Kevin Byrne is a veteran cop who already knows that edge: He’s been living on it far too long. His marriage failing, his former partner wasting away in a hospital, and his heart lost to mad fury, Byrne loves to take risks and is breaking every rule in the book. And now he has been given a rookie partner. Jessica Balzano, the daughter of a famous Philly cop, doesn’t want Byrne’s help. But they will need each other desperately, since they’ve just caught the case of a lifetime: Someone is killing devout young women, bolting their hands together in prayer, and committing an abomination upon their otherwise perfect bodies.Byrne and Balzano spearhead the hunt for the serial killer, who leads them on a methodically planned journey. Suspects appear before them like bad dreams–and vanish just as quickly. And while Byrne’s sins begin to catch up with him, and Balzano tries to solve the blood-splattered puzzle, the body count rises. Meanwhile, the calendar is approaching Easter and the day of the resurrection. When the last rosary is counted, a madman’s methods will be revealed, and the final crime will be the one that hurts the most.Relentlessly paced and vividly told, The Rosary Girls is a smart, emotionally complex, fiercely gripping thriller from an author who takes chances, breaks new ground, and leaves readers haunted and moved long after the last page is turned.",
  "genres": [
    "Thriller",
    "Mystery",
    "Crime",
    "Fiction",
    "Mystery Thriller",
    "Suspense",
    "Detective"
  ],
  "author": "Richard Montanari",
  "average_rating": "4.03",
  "url": "https://www.goodreads.com/book/show/1178310.The_Rosary_Girls"
}