{
  "title": "There Will Be War Volume X: History's End",
  "description": "Created by the bestselling SF novelist Jerry Pournelle, THERE WILL BE WAR is a landmark science fiction anthology series that combines top-notch military science fiction with factual essays by various generals and military experts on everything from High Frontier and the Strategic Defense Initiative to the aftermath of the Vietnam War. It features some of the greatest military science fiction ever published, such Orson Scott Card’s “Ender’s Game” in Volume I and Joel Rosenberg’s “Cincinnatus” in Volume II. Many science fiction greats were featured in the original nine-volume series, which ran from 1982 to 1990, including Robert Heinlein, Arthur C. Clarke, Philip K. Dick, Gordon Dickson, Poul Anderson, John Brunner, Gregory Benford, Robert Silverberg, Harry Turtledove, and Ben Bova.  25 years after the end of the Cold War and the publication of the ninth volume, Dr. Pournelle has revived his classic science fiction series with Castalia House. THERE WILL BE WAR Volume X continues the tradition of combining top-notch military science fiction with first-rate real-world analysis by military experts. The Cold War may have ended, but as recent events everywhere from Paris to Syria have demonstrated, war has not.  THERE WILL BE WAR Volume X is edited by Jerry Pournelle and features 18 stories, articles, and poems. Of particular note are “Battle Station” by Ben Bova, “Flashpoint: Titan” by Cheah Kai Wai, \"What Price Humanity?\" by David VanDyke, and the eerily prescient \"The Man Who Wasn't There” by Gregory Benford. Volume X also includes timely essays on \"War and Migration\" by Martin van Creveld, \"The 4GW Counterforce\" by William S. Lind and LtCol Gregory A. Thiele, USMC, and \"The Deadly Future of Littoral Sea Control\" by CDR Phillip E. Pournelle, USN, which was awarded the 2015 Literary Award by the Surface Navy Association for \"the best professional article in any publication addressing Surface Navy or surface warfare issues.\"",
  "genres": [
    "Science Fiction",
    "Fiction",
    "Short Stories",
    "Anthologies",
    "Military Fiction"
  ],
  "author": "Jerry Pournelle",
  "average_rating": "4.02",
  "url": "https://www.goodreads.com/book/show/28251392-there-will-be-war-volume-x"
}