{
  "title": "The Alloy of Law",
  "description": "From #1 New York Times bestselling author Brandon Sanderson, the Mistborn series is a heist story of political intrigue and magical, martial-arts action.Three hundred years after the events of the Mistborn trilogy, Kelsier and Vin have passed into the realm of history and myth, and the world of Scadrial is on the verge of modernity. In the frontier lands known as the Roughs, the old magics are a crucial tool for those who establish order and justice.One such is Waxillium Ladrian, a rare Twinborn, who can Push on metals with his Allomancy and use Feruchemy to become lighter or heavier at will. After twenty years in the Roughs, tragedy has driven Wax back to the metropolis of Elendel. Now he must reluctantly put away his guns and assume the duties of the head of a noble house. But when a gang of Allomancers turn to train robbery and kidnapping, Wax will soon learn that the mansions and elegant tree-lined streets of the city can be more dangerous than the dusty plains of the Roughs.Other Tor books by Brandon SandersonThe CosmereThe Stormlight ArchiveThe Way of KingsWords of RadianceEdgedancer (novella)OathbringerDawnshard (novella)Rhythm of WarThe Mistborn SagaThe Original TrilogyMistbornThe Well of AscensionThe Hero of AgesWax and WayneThe Alloy of LawShadows of SelfThe Bands of MourningThe Lost MetalOther Cosmere novelsElantrisWarbreakerTress of the Emerald SeaYumi and the Nightmare PainterThe Sunlit ManCollectionArcanum The Cosmere CollectionThe Alcatraz vs. the Evil Librarians seriesAlcatraz vs. the Evil LibrariansThe Scrivener's BonesThe Knights of CrystalliaThe Shattered LensThe Dark TalentBastille vs. the Evil Librarians (with Janci Patterson)Other novelsThe The Many Lives of Stephen LeedsThe Frugal Wizard’s Handbook for Surviving Medieval EnglandOther books by Brandon SandersonThe ReckonersSteelheartFirefightCalamitySkywardSkywardStarsightCytonicSkyward Flight (with Janci Patterson)DefiantAt the Publisher's request, this title is being sold without Digital Rights Management Software (DRM) applied.",
  "genres": [
    "Fantasy",
    "Fiction",
    "Audiobook",
    "Steampunk",
    "High Fantasy",
    "Epic Fantasy",
    "Adult"
  ],
  "author": "Brandon Sanderson",
  "average_rating": "4.20",
  "url": "https://www.goodreads.com/book/show/11783190-the-alloy-of-law"
}