{
  "title": "The Girl with the Golden Bouffant: An Original Jane Bond Parody",
  "description": "Another hilarious Bond parody in the shape of THE GIRL WITH THE GOLDEN BOUFFANT. James Bond′s out of commission and his sister Jane must step once more into his shoes, his smoking jacket, and his girlfriend′s bedroom... When James Bond lands in hospital as the result of a nasty facial burn - while lighting a bird′s cigarette, his hair pomade explodes -- Jane Bond, his lesbian twin sister and occasional impersonator, once again dons suit and scars to masquerade as her infamous brother. Her the annual spy convention in the glamorous Las Vegas of the Rat Pack era. Her to keep her brother′s reputation intact through a carefully plotted program of gambling, boozing, and womanising. Along for the ride are British Secret Service Agent Cedric Pumpernickel, Jane′s only ally in the male spy world, and glamorous girlfriend, and G.E.O.R.G.I.E. agent, Bridget St Claire, who finds herself the unwilling love interest of a scrawny lounge singer who, along with his pack of friends, begins a campaign to bed her.The relatively ordinary convention - featuring the latest in jet pack transportation and stylish decoder rings - becomes the scene for murder when someone tosses an Estonian secret agent off the observation deck of Hoover Dam. Days spent at the blackjack table - and nights in the arms of her beautiful girlfriend - come to an abrupt end as Jane uncovers a nefarious plot to eliminate all the best spies of the western world. Complicating the plot is a romance gone an affair between Agent Pumpernickel and musical sensation Liberace has ended badly, and when Pumpernickel takes to his bed with a box of chocolates and a copy of Queen magazine, Jane must become England′s top-action man and stop the killer before he stops her.",
  "genres": [
    "Mystery",
    "Fiction",
    "Queer",
    "Lesbian Fiction",
    "LGBT",
    "Humor"
  ],
  "author": "Mabel Maney",
  "average_rating": "3.52",
  "url": "https://www.goodreads.com/book/show/282573.The_Girl_with_the_Golden_Bouffant"
}