{
  "title": "Paying the Price: College Costs, Financial Aid, and the Betrayal of the American Dream",
  "description": "If you are a young person, and you work hard enough, you can get a college degree and set yourself on the path to a good life, right?   Not necessarily, says Sara Goldrick-Rab, and with Paying the Price, she shows in damning detail exactly why. Quite simply, college is far too expensive for many people today, and the confusing mix of federal, state, institutional, and private financial aid leaves countless students without the resources they need to pay for it.   Drawing on an unprecedented study of 3,000 young adults who entered public colleges and universities in Wisconsin in 2008 with the support of federal aid and Pell Grants, Goldrick-Rab reveals the devastating effect of these shortfalls. Half the students in the study left college without a degree, while less than 20 percent finished within five years. The cause of their problems, time and again, was lack of money. Unable to afford tuition, books, and living expenses, they worked too many hours at outside jobs, dropped classes, took time off to save money, and even went without adequate food or housing. In many heartbreaking cases, they simply left school—not with a degree, but with crippling debt. Goldrick-Rab combines that shocking data with devastating stories of six individual students, whose struggles make clear the horrifying human and financial costs of our convoluted financial aid policies.   America can fix this problem. In the final section of the book, Goldrick-Rab offers a range of possible solutions, from technical improvements to the financial aid application process, to a bold, public sector–focused “first degree free” program. What’s not an option, this powerful book shows, is doing nothing, and continuing to crush the college dreams of a generation of young people.",
  "genres": [
    "Nonfiction",
    "Education",
    "Sociology",
    "Politics",
    "Economics",
    "School",
    "Teaching"
  ],
  "author": "Sara Goldrick-Rab",
  "average_rating": "4.12",
  "url": "https://www.goodreads.com/book/show/28255180-paying-the-price"
}