{
  "title": "Olav Audunszoon op Hestviken",
  "description": "De Noorse schrijfster Sigrid Undset kreeg in 1928 de Nobelprijs, met name voor haar historische romans. Van deze romans is die over Olav Audunszoon minder bekend, maar daarom niet minder boeiend dan die over Kristin Lavransdochter. Het feit dat het in 1982 honderd jaar geleden is dat Sigrid Undset geboren werd, heeft er waarschijnlijk toe bijgedragen dat de al in 1930 in het Nederlands verschenen vertaling van de roman over Olav Audunszoon, wel in een gewijzigde spelling, nu in de Scandinavische reeks van Meulenhoff is opgenomen. Het verhaal over Olav en zijn geliefde Ingunn en over hun strijd tussen het eigen ik en de door het middeleeuwse katholieke geloof opgelegde plicht zal vele lezers blijven boeien, mede doordat het realistisch is beschreven en een cultuur-historisch rijk en betrouwbaar beeld geeft van het 13e eeuwse Scandinavië.In Olav Audunszoon schildert Sigrid Unset de ontluikende liefde tussen Olav, zoon van Augun, en Ingunn Steinfinnsdochter, de bezwaren die tegen deze verbintenis worden ingebracht en het plotselinge vertrek van Olav wanneer hij naar Denemarken moet vluchten. Ingunn blijft alleen achter en is afhankelijk van haar familie. Dit was in die tijd een slechte situatie, bijna als van een in de steek gelaten meisje, een vrouw zonder rechten overgeleverd aan de welwillendheid van haar familie. Even voor Olav terugkeert - even plotseling als hij vertrokken is - wordt Ingunn verleid door een amoureuze IJslander. Op prachtige wijze verteld Sigrid Undset de moeite, die het Olav kost om dit kind van een ander als zijn zoon te accepteren, de moord op de IJslander die nooit wordt opgelost en ook Olavs eigen ontrouw met de vurige Thornhild Björnsdochter.In deze uitgave zijn de volgende delen te vinden: Olav Audunszoon treedt in het huwelijk ~ Ingunn Steinfinnsdochter ~ Olav Audunszoons geluk.",
  "genres": [
    "Historical Fiction",
    "Scandinavian Literature",
    "Historical",
    "Classics",
    "Fiction"
  ],
  "author": "Sigrid Undset",
  "average_rating": "4.06",
  "url": "https://www.goodreads.com/book/show/28257960-olav-audunszoon-op-hestviken"
}