{
  "title": "Intimations: Stories",
  "description": "From the celebrated author of You Too Can Have a Body Like Mine, this new book is a thought-provoking, often unsettling story collection that consists, broadly, of narrative diagrams of the three main stages in a human birth, life, and deathAlexandra Kleeman’s debut novel You Too Can Have a Body Like Mine earned her comparisons to Thomas Pynchon, Don DeLillo, Ben Marcus, and Tom Perrotta. It was praised by the New York Times as “a powerful allegory of our civilization’s many maladies, artfully and elegantly articulated, by one of the young wise women of our generation.” In her second book, a collection of twelve stories irresistibly seductive in their strangeness, she explores human life from beginning to the distress of birth into a world already formed; the brief and confusing period of “living” where we understand what is expected of us and struggle to do it; and the death-y period toward the end where we sense it is ending and will end only partially understood, at best.The title is taken from one of the stories (“Intimation”), but is also a play on Wordsworth's “Intimations of Immortality”—only in this case it’s not clear exactly what is being intimated, but it’s nothing so gleaming and good as Immortality. The middle, “Living” section of the book, is fleshed out with a set of stories that borrow more from traditional realist fiction to illustrate the inner lives of the characters. At once familiar and mysterious, these stories have an eerie resonance as its characters find themselves in new and surprising situations. An unnamed woman enters a room with no exit and a ready-made life; the disappearance of people, objects, and memory creates an apocalypse; the art of dance is used to try to tame a feral child; the key to surviving a house-party lies in knowing the difference between fake and real blood. Elegant, surprising, wondrous, and haunting, Intimations is an utterly transporting collection from one of our most ingenious and brilliant young writers.",
  "genres": [
    "Short Stories",
    "Fiction",
    "Contemporary",
    "Audiobook",
    "American",
    "Feminism",
    "Collections"
  ],
  "author": "Alexandra Kleeman",
  "average_rating": "3.49",
  "url": "https://www.goodreads.com/book/show/28257667-intimations"
}