{
  "title": "Badass The Complete Series",
  "description": "The Complete Bestselling Badass Series  Includes:  Prequel When you grow up getting everything you want, it's hard to give everything you have.  Billionaire playboy Link Duffy dumps his parent-approved girlfriend hours after he walks across the stage. Hell, he's over it. Goodbye. Good riddance.  Now he’s free to do anything he wants.  A crazy graduation night party ends with the ultimate hookup. It’s just him and the girl of his dreams.  Then the unthinkable happens. A huge mistake. A brutal cost. A price even his rich daddy can’t pay.  Welcome to the prequel of the Badass series. Discover the defining moments that transformed Link Duffy into the ultimate billionaire military badass.  Collision Course Badboy Billionaire Link Duffy is a man now. Making his own decisions and choosing his own path. An elite Delta Force warrior, his only commitment is to his country and his team. Everyone else be damned … especially women.  In a small East Tennessee town, Grace Johnson is on a mission for herself. They say ‘what doesn’t kill you makes you stronger’. Well, yeah, screw that. She’s making her own decisions and choosing her own path. Everyone else be damned … especially men.  Two lives.  Two worlds.  As different as night and day.  But fate has spoken and they’re on a collision course. But be warned. When two worlds collide, you better bring a broom.  Destinies Collide Grace loves her new life as a traveling therapist and nurse. She's in charge and is relishing in the freedom. She's seeing the country, meeting new people and doing new things. She's happy. Almost.  Imagine her surprise when she's called for an interview in California. Overlooking the ocean. In a mansion. No, not a mansion, a compound with guest cottages bigger than a normal person's house. She knows she'll love the job, if she can pass the interview with the queen of all bitches and her husband, a famous billionaire.  Then she meets their son. Link Duffy. He's tough, bitter, and seeking revenge. His entire life was changed in an instant, and he's hurt and mad as hell. But there's something about him. Something so raw and fierce. And vulnerable. And sexy as hell. And when he looks at her, she knows their destinies collided for a reason.  Hidden Danger When you're dead, living is easy. When you’re playing dead, it's a lot more complicated.  Link and Grace survive the initial onslaught. But by who? And why?  A jealous ex-husband doesn't have this kind of power. Of course, obsession has very strange bedfellows. And Link’s a ghost. Aren’t ghosts supposed to already be dead?  Destiny brought them together. Fate joined their hands. Love would be their ultimate weapon … if the world played fair. But it doesn’t. Not even close. So where do they go, where do they hide, how do they stay together when there are hidden dangers around every corner?  Shattered In the movies, when you're on the run, you always survive. Truth prevails and the good guys win. Real life isn't that simple.  After escaping to the safe house, Grace and Duffy discover that safe is in the eye of the beholder. The enemy is out there and wants them dead. With extreme prejudice. No questions asked.  Duffy has a different plan, but to fulfill it, he's forced to make an impossible decision. Promises are broken.",
  "genres": [
    "Romance",
    "Contemporary",
    "Amazon",
    "Military Fiction"
  ],
  "author": "Leslie  Johnson",
  "average_rating": "4.60",
  "url": "https://www.goodreads.com/book/show/28252386-badass-the-complete-series"
}