{
  "title": "Wake Up America: The Nine Virtues That Made Our Nation Great—and Why We Need Them More Than Ever",
  "description": "The Instant New York Times Bestseller!America was built on nine distinct virtues which shaped the character of our nation and made it great. Grit, manliness, individualism, merit, profit and providence, dominion over our environment, thrift, and above all pride in our country—these qualities define us, and are the reason that hundreds of millions of people worldwide look to America for hope, inspiration, and opportunity.But it’s precisely these virtues that now are under attack by the radical Left of Barack Obama, Hillary Clinton, Bernie Sanders, and their followers. America as we know it is eroding before our eyes and becoming what Fox News Channel personality and co-host of “The Five” Eric Bolling calls a “politically correct nanny state.” The rewards for individual achievement and hard work, our basic constitutional rights, religious faith, national identity, and capitalism itself, are being replaced by a dangerous socialistic ideology that is the polar opposite of what our Founding Fathers intended America to be. It’s time for us to wake up and heed the clear-cut warning signs that America is heading in the wrong direction--before we’re too far gone. Eric Bolling knows firsthand what makes America great. Raised in a struggling blue-collar family in Chicago, his parents showed him that hard work and firm values can get you far in life. Those values drove him as a young baseball player to being drafted by the Pittsburgh Pirates, then success as a New York Mercantile Exchange trader, and now his daily role on Fox News Channel. A celebration of America that is informed by Bolling’s personal story, Wake Up America is a much-needed call to arms for America’s citizens to preserve and protect our country's present and future.",
  "genres": [
    "Politics",
    "Nonfiction",
    "History",
    "Political Science"
  ],
  "author": "Eric Bolling",
  "average_rating": "4.23",
  "url": "https://www.goodreads.com/book/show/28260226-wake-up-america"
}