{
  "title": "Narrative of My Captivity Among the Sioux Indians",
  "description": "Fanny Kelly (1845-1904) was a Kansas pioneer woman captured by the Sioux and freed five months later. She later wrote a book about her experiences called Narrative of My Captivity among the Sioux Indians in 1871.  THIS is the title of a very interesting narrative of the capture of Mrs. Fanny Kelly, in 1864, who was en route with her husband and a little adopted daughter with a small band of other emigrants to the Far West. They were surrounded just at nightfall by a troop of Sioux Indians, who at first feigned friendship, but very soon, notwithstanding they were treated with kindness and liberality by the unfortunate party, began a murderous attack, killing several, and taking Fanny, her adopted daughter, and a Mrs. Larimer prisoners. Mrs. Larimer got away the second night, but our authoress remained for five months- the victim of cruelty, exposure, fear, and despair, but having an opportunity to see and know much of Indian life. The work abounds in sketches of scenery, and the wild eventful lifetraits of the Indians of the Northwest.  Fanny was captured from an emigrant train some distance from Fort Laramie on the Platte River, in Wyoming, by a band of Ogallala Sioux Indians. This tribe of Indians were the best fighters of all the Indians. They were of good physique and were rich in horses and traveled very rapidly. At the time of her capture Fanny was but nineteen years of age, and during her career with the Indians she was subjected to more blood-curdling experiences than the ordinary woman could withstand. After carrying her into the Dakotas, the Big Chief spared her life because she showed so much skill in dressing the wounds of their wounded and made herself useful. More severe than the long marches must have been the witnessing of the battles in which her own people were killed, and the fiendish acts of the blood-thirsty warriors.  It was on May 17, 1864, that Josiah S. Kelly, his young wife, and their adopted little daughter, Mary, left their home in Geneva, Kansas, and with other emigrants started for the golden fields of Idaho, with high wrought hopes of future prosperity and pleasant anticipations of a romantic and delightful journey across the plains. They experienced no disturbances from Indians, safely crossed the Platte River, until July 12, 1864, when they came into the Little Box Elder Valley, 12 miles from Deer Creek Station. When suddenly without warning, the bluffs before them were covered with a party of about two hundred Indians. Gaudily painted, uttering their wild war-whoops, firing a volley of guns and revolvers, they descended on the train of emigrants. In the massacre that followed, Josiah succeeded in making a miraculous escape. Favored by the fast approaching darkness, he hid himself in the tall grass and sage brush.  Fanny's narrative covers the succeeding events that led to her eventually being reunited with her husband; Congress later voted to give her $5,000 for her efforts which save a fort from attack.  This book originally published in 1871 has been reformatted for the Kindle and may contain an occasional imperfection; original spellings have been kept in place.",
  "genres": [
    "History",
    "Nonfiction",
    "Biography",
    "Memoir",
    "Native American",
    "Autobiography",
    "Westerns"
  ],
  "author": "Fanny Kelly",
  "average_rating": "3.88",
  "url": "https://www.goodreads.com/book/show/28263710-narrative-of-my-captivity-among-the-sioux-indians"
}