{
  "title": "One Woman Three Men: A Novel About Modern Love and Sex",
  "description": "Loosely based on the author's real life story, this is a provocative, titillating, and intelligent novel about a strong, independent woman (Elizabeth) who, following a divorce, decides that the modern paradigm of love needs a revolution. Given that infidelity is rampant and that 40% of first marriages end in divorce, she decides that trying to get all of her needs fulfilled by a single man just doesn't work in today's world. What she needs is 3 men ―one for conversation, one for sex, and one handyman to do work around her house. What follows is a riveting, sexy, saucy tale about her search for 3 men willing to play those roles.Set in Copenhagen, Elizabeth advertises on a dating website–and men reply to her by the droves. Over the course of a year, Elizabeth experiments with her new model of love and sex, dating many men, and discovering how she often can't decide which role they will play–but nor can the men. Most guys reply to her that they are her \"perfect\" sex partner, and a few offer to be her conversational partner (with sex) or her handyman (with sex). One promising date turns out to be like a B&D character from 50 Shades of Grey, another guy pretends to be a successful entrepreneur, while another is an army General who secretly wears dresses.Elizabeth finally meets someone who intrigues her beyond all others–a unique man of intellect and savoir-vivre. He invites her into a \"secret society\" of men who adore and worship women. He neither wants to own her or control her–exactly what Elizabeth is looking for. He might be a \"3 in 1.\" It turns out that 2 other men in her life are friends of his. When all 3 men meet Elizabeth one night for a special dinner in a castle, Elizabeth gets to experience 3 men all at once in a way she never imagined.But that night gives Elizabeth a new impetus to reconsider her model of love. When another man courts her, she comes to realize that, perhaps, romance between 1 man and 1 woman is not entirely an outmoded idea. It may actually be the true way that men and women can love, though she remains convinced that women need to be equal partners in a relationship and question the romantic stereotypes of love they are lulled into believing. Modern love and sex still need a revolution.",
  "genres": [],
  "author": "Pouline Middleton",
  "average_rating": "4.14",
  "url": "https://www.goodreads.com/book/show/28269084-one-woman-three-men"
}