{
  "title": "So Many Books: Reading and Publishing in an Age of Abundance",
  "description": "\"Gabriel Zaid's defense of books is genuinely exhilarating. It is not pious, it is wise; and its wisdom is delivered with extraordinary lucidity and charm. This is how Montaigne would have written about the dizzy and increasingly dolorous age of the Internet. May So Many Books fall into so many hands.\"—Leon Wieseltier\"Reading liberates the reader and transports him from his book to a reading of himself and all of life. It leads him to participate in conversations, and in some cases to arrange them…It could even be said that to publish a book is to insert it into the middle of a conversation.\"—from So Many BooksJoin the conversation! In So Many Books, Gabriel Zaid offers his observations on the literary condition: a highly original analysis of the predicament that readers, authors, publishers, booksellers, librarians, and teachers find themselves in today—when there are simply more books than any of us can contemplate.\"With cascades of books pouring down on him from every direction, how can the twenty-first-century reader keep his head above water? Gabriel Zaid answers that question in a variety of surprising ways, many of them witty, all of them provocative.\"—Anne Fadiman, Author of Ex-Libris\"A truly original book about books. Destined to be a classic!\"—Enrique Krauze, Author of Mexico: Biography of Power, Editor of Letras Libres\"Gabriel Zaid's small gem of a book manages to be both delectable and useful, like chocolate fortified with vitamins. His rare blend of wisdom and savvy practical sense should make essential and heartening reading for anyone who cares about the future of books and the life of the mind.\"—Lynne Sharon Schwartz, Author of Ruined by Reading: A Life in Books\"Gabriel Zaid is a marvelously elegant and playful writer—a cosmopolitan critic with sound judgment and a light touch. He is a jewel of Latin American letters, which is no small thing to be. Read him—you'll see.\"—Paul Berman\"'So many books,' a phrase usually muttered with despair, is transformed into an expression of awe and joy by Gabriel Zaid. Arguing that books are the essential part of the great conversation we call culture and civilization, So Many Books reminds us that reading (and, by extension, writing and publishing) is a business, a vanity, a vocation, an avocation, a moral and political act, a hedonistic pursuit, all of the aforementioned, none of the aforementioned, and is often a miracle.\"—Doug Dutton\"Zaid traces the preoccupation with reading back through Dr. Johnson, Seneca, and even the Bible ('Of making many books there is no end'). He emerges as a playful celebrant of literary proliferation, noting that there is a new book published every thirty seconds, and optimistically points out that publishers who moan about low sales 'see as a failure what is actually a blessing: The book business, unlike newspapers, films, or television, is viable on a small scale.' Zaid, who claims to own more than ten thousand books, says he has sometimes thought that 'a chastity glove for authors who can't contain themselves' would be a good idea. Nonetheless, he cheerfully opines that 'the truly cultured are capable of owning thousands of unread books without losing their composure or their desire for more.'\"—New YorkerGabriel Zaid's poetry, essays, social and cultural criticism, and business writings have been widely published throughout the Spanish-speaking world. He lives in Mexico City with the artist Basia Batorska, her paintings, three cats, and ten thousand books.Natasha Wimmer is an editor and a translator in New York City. Her recent translations include The Savage Detectives and 2666 by Roberto Bolaño andThe Way to Paradise by Mario Vargas Llosa.",
  "genres": [
    "Nonfiction",
    "Books About Books",
    "Essays",
    "Writing",
    "Literature",
    "Reference",
    "Business"
  ],
  "author": "Gabriel Zaid",
  "average_rating": "3.71",
  "url": "https://www.goodreads.com/book/show/282626.So_Many_Books"
}