{
  "title": "Powerful Prayers in the War Room",
  "description": "I Wanted to Pray Powerful Prayers…But I Didn’t Know HowDo you struggle to find the right words to speak in the presence of Almighty God? Praying to God may feel foreign or like a ritual, and adding to that frustration, you worry that God isn’t listening. Even if He hears, will He reply? This book will show you God not only listens but also answers.Or you already pray regularly and are looking for a tune up for your prayer life. This book is for you, too. You already know that war room prayer is a powerful weapon in spiritual warfare.God is waiting to pour out blessings on your life, if only you will ask Him. God wants you to be a powerful prayer warrior and help you as you pray for the prayer requests on your war room wall.Author Dan Lancaster was struck by the power of the prayers answered during his twelve years as an international missionary in Southeast Asia. These answered prayers brought glory to God and helped advance His Kingdom on Earth. THOSE are the prayers we need in our broken world, and the direction this book will guide you. You can pray more strategically when you have a war room battle plan for prayer.Prayer was never intended to be complicated. The truth is that Jesus showed His disciples how to pray and He wants to show you how to pray too. Learn how to use The Lord’s Prayer as a prayer guide.In this book, you will learn four ingredients of fervent prayer that will help you prayers for healing and recoveryprayers for strength and confidenceprayers about peace and serenityprayers for your spouse and forgivenessprayers for anxiety and depressionThe author brings 40 years of his personal ministry experience to the pages of this book, but most importantly, he looks to the Word to unearth what Jesus prayed about and how. With beautiful simplicity, Dr. Lancaster offers tangible methods to reshape your prayer life beginning today.By opening your heart to these simple steps, you will begin to experience the true power of prayer in your relationship with God, in your community, and in ways you could never have imagined.Click the Buy Now button and take your war room prayers to a new level.",
  "genres": [
    "Christian",
    "Prayer",
    "Nonfiction",
    "Spirituality",
    "Faith",
    "Inspirational",
    "Christian Non Fiction"
  ],
  "author": "Daniel B. Lancaster",
  "average_rating": "4.52",
  "url": "https://www.goodreads.com/book/show/28286911-powerful-prayers-in-the-war-room"
}