{
  "title": "Time Traveler's Rock: Bonus Edition",
  "description": "Three books in one! This is a bonus edition for the Time Traveler's Rock series written by Rick Heiman. This edition contains the first two books, Flaming Eagle and White Buffalo along with a series teaser. Flaming It's 2065, but retired computer programmer James finds himself transported back in time five hundred years. Suddenly he is living the life of a ten-year-old Indian child named Baby Bird. His life is flipped upside down once he is taken away by an uncle he has never met to a village where he is not easily accepted. Here he must learn to build canoes alongside his uncle, while keeping ideas and concepts from the future-his own time-secret. With the help of his uncle, two quiet sisters, an old man, and his new friend Phoenix, Baby Bird slowly finds his place his new home, with a few challenges and adventures along the way, including the ceremonial ritual to become a man. Will Baby Bird find his way back to his own village, and will James return back to 2065? Time Traveler's Flaming Eagle is a story that weaves the past and future together with action and adventure, drawing in children and young adult readers. White Ever since James, retired computer programmer, came back in time from an American Indian village in the 1500's, he frequents the time traveler's rock, an area where time travel became possible, with high hopes of returning into the life of Flaming Eagle. But everything changes one day when James is transported back in time again; however, this time as a teenage American Indian boy named Bo. Experiencing the life of young Bo, he saves a rare white buffalo, is sent on a journey, dodges dangerous animals, and a man, who is trying to kill him. What will this mysterious man, an old woman, and a girl named Fever impart on him and the buffalo as he ventures forth on a long journey? You’ll find out in Time Traveler's White Buffalo as it is the second book in series and weaves the past and present together to form a tale of action, adventure, and mystery. Permit The series teaser gives you a glimpse into other adventures in store for James as he is sent 500 years into the further and tried for time traveling without a permit.",
  "genres": [],
  "author": "Rick Heiman",
  "average_rating": "0.00",
  "url": "https://www.goodreads.com/book/show/28278423-time-traveler-s-rock"
}