{
  "title": "The Trigger",
  "description": "What would happen if someone invented a device that could render guns and bombs virtually harmless? What would be the effect on crime, on terrorism, on international relations? Would it mean the end of war--or a whole new kind of war?Here is a breathtaking new novel by the legendary Arthur C. Clarke, bestselling author of 2001: A Space Odyssey and creator of the Rama series, that is equal parts real-life scientific speculation and edge-of-your-seat thriller. In collaboration with Michael Kube-McDowell, Clarke tells a riveting, heart-stopping tale in which the fate of humankind depends on whose finger is on... The Trigger .They dubbed it the Trigger, and in a world where violence had reached epidemic proportions it offered the one true promise for a civilized peace. For the first time it would be possible to take the guns out of the hands of armies, dictators, and thugs. Yet, like those who once believed that nuclear weapons would be the ultimate deterrent to war, could the scientists who invented the Trigger also be mistaken? Would this new technology bring peace, or chaos?It was a question that haunted Dr. Jeffrey Horton, the brilliant young physicist responsible for the Trigger's development. His was a discovery with the potential to transform the world, but the road to a better future was anything but clear. Who should control this technology? How could its potential be realized? Horton and his team understood the danger of letting the American government know about the Trigger--as well as the danger of trying to keep it from them.But not even Horton could foresee the fierce struggle that would erupt among Washington's power elite both to possess and to destroy the Trigger. Before long it becomes clear that science is being held hostage to politics and that no one can be trusted--not even Horton's own dedicated colleagues nor his long-time hero and mentor, the brilliant Nobel Prize-winning physicist Dr. Karl Brohier. Someone has already betrayed the project. Others will do anything to stop it--or co-opt it for their own ends. Too many people have a stake in the business of violence to give peace a chance. And the greatest enemy of all may be those with the best intentions.",
  "genres": [
    "Science Fiction",
    "Fiction",
    "Thriller",
    "Fantasy",
    "Speculative Fiction",
    "Novels"
  ],
  "author": "Arthur C. Clarke",
  "average_rating": "3.78",
  "url": "https://www.goodreads.com/book/show/117844.The_Trigger"
}