{
  "title": "The Hunter Bride",
  "description": "Five years ago, a band of outlaws murdered Josephine Shafter's parents and younger brother. Desperate for vengeance, Jo has spent every day since serving the law as a bounty hunter. But the trouble with justice served is that now that her family's killer has been brought in, she has nothing to do and no one to hunt. She decides it may be time for a new life and a fresh start. She longs for the arms of a strong man around her, and for a child of her own. But the Chicago dandies don't know how to kiss a woman who is tougher than they are. Jo decides her best chance at happiness is to head out West, to the wild Montana territory, to start a new life as a mail order bride.Sam Longworth has been the Sheriff of Hope's Crossing, Montana for two miserable years. He was much happier roaming the untamed plains as a bounty hunter, bringing outlaws to justice. But that was no life for a husband or father, and his wife wanted him home, safe and sound, every night. Forced into marriage, theirs had never been a love match, but he thought warming her bed every night would be enough. Instead she left him and took a stagecoach to rendezvous with her childhood sweetheart. She vowed never to return, and died on the journey. Plagued by guilt over her death, Sam doesn't need a woman's love, he just needs a wife. He orders a mail order bride, a woman who won't make too many demands, who can build a home and give him children. Josephine fits his life perfectly, until danger follows her to her new home and he realizes she's keeping secrets that could get them both killed.Trust is a hard road for two lost souls used to keeping secrets, and their new and fragile love might not be strong enough to survive what's coming.",
  "genres": [
    "Romance",
    "Historical Romance",
    "Westerns",
    "Historical",
    "Western Romance",
    "Historical Fiction",
    "Western Historical Romance"
  ],
  "author": "Cynthia Woolf",
  "average_rating": "3.87",
  "url": "https://www.goodreads.com/book/show/28282519-the-hunter-bride"
}