{
  "title": "Tears of the Silenced: A True Crime and an American Tragedy; Severe Child Abuse and Leaving the Amish",
  "description": "Misty Griffin's story ─ Surviving child abuse, parental betrayal, sexual assault, and Amish cruelty.A true crime memoir: When Misty was six years old her family started to live and dress like the Amish. Misty and her sister were kept as slaves on a mountain ranch where they were subjected to almost complete isolation, sexual abuse and extreme physical violence. Their step-father kept a loaded rifle by the door at all times to make sure the young girls were too terrified to try to escape. They also knew that no rescue would ever come because only a couple of people even knew they existed and did not know them well enough to care.Amish Sexual abuse: When Misty reached her teens, her parents feared she and her sister would escape and took them to an Amish community where they were adopted and became baptized members. Misty was devastated to once again find herself in a world of fear, animal cruelty and sexual abuse. Going to the police was severely frowned upon. A few years later, Misty was sexually assaulted by the bishop. As Misty recalls, \"Amish sexual abusers are only shunned by the church for six weeks, a punishment that never seems to work. After I was assaulted by the bishop I knew I had to get help and one freezing morning in early March I made a dash for a tiny police station in rural Minnesota. After reporting the bishop I left the Amish and found myself plummeted into the strange modern world with only a second-grade education and no ID or social security card. To all abuse survivors out there, please be encouraged, the cycle of abuse can be broken. Today, I am a nursing student working towards my master's degree and a child abuse awareness activist. This is my story.\"\nIf you have read Scared Selfless, A Child Called It, The Sound of Gravel, or Etched In Sand, then Tears of the Silenced is a must read.",
  "genres": [
    "Nonfiction",
    "True Crime",
    "Memoir",
    "Amish",
    "Audiobook",
    "Religion",
    "Biography"
  ],
  "author": "Misty Griffin",
  "average_rating": "4.28",
  "url": "https://www.goodreads.com/book/show/28280863-tears-of-the-silenced"
}