{
  "title": "Unnatural Voices:  Extreme Narration in Modern and Contemporary Fiction",
  "description": "Brian Richardson presents a study that explores in depth one of the most significant aspects of late modernist, avant-garde, and postmodern narrative. Unnatural Voices analyzes in depth the creation, fragmentation, and reconstitution of experimental narrative voices that transcend familiar first- and third-person perspectives. Going beyond standard theories that are based in rhetoric or linguistics, this book focuses on what innovative authors actually do with narration. Richardson identifies the wide range of unusual narrators, acts of narration, and dramas with the identity of the speakers in late modern, avant-garde, and postmodern texts that have not previously been discussed in a sustained manner from a theoretical perspective. He draws attention to the more unusual practices of Conrad, Joyce, and Woolf as well as the work of later authors like Beckett and recent postmodernists. Unnatural Voices chronicles the transformation of the narrator figure and the function of narration over the course of the twentieth century and provides chapters on understudied modes such as second-person narration, \"we\" narration, and multiperson narration. It explores a number of distinctively postmodern strategies, such as unidentified interlocutors, erased events, the collapse of one voice into another, and the varieties of postmodern unreliability. It offers a new view of the relations between author, implied author, narrator, and audience and, more significantly, of the \"unnatural\" aspects of fictional narration. Finally, it offers a new model of narrative that can embrace the many non- and anti-realist practices discussed throughout the book. Brian Richardson is professor of English at the University of Maryland.",
  "genres": [
    "Nonfiction",
    "Writing"
  ],
  "author": "Brian  Richardson",
  "average_rating": "4.21",
  "url": "https://www.goodreads.com/book/show/2834259-unnatural-voices"
}