{
  "title": "Similar Transactions: A True Story",
  "description": "Similar Transactions is the dramatic, literary award-winning true story of the author’s seven-year quest to solve a 20-year-old murder.In 1987, Michelle Anderson, a teenage girl from the author's neighborhood and a classmate of her children, goes missing. The author, S. R. (Sasha) Reynolds, a professional social worker, knows the detective assigned to the case and is concerned that he isn't fully investigating Michelle’s disappearance. Then Reynolds moves out of state. Yet the case continues to haunt her.Ten years later she's watching a forensic show on TV and there is Michelle's story. Her skeletal remains had been found two years after she'd gone missing, but the case remains unsolved. The Knoxville PD investigation has been inactive for many years; people have retired. Then, as fate would have it, in the fall of 2007, Reynolds runs into her old professor, famed forensic anthropologist Dr. Bill Bass, who was the forensic examiner on the case. He sends Reynolds his nearly-20-year-old report and some related info, and her own investigation begins.She seeks out and meets with surviving victims and former investigators who worked on the case. A picture begins to form. A pattern appears. Reynolds picks up the long-cold trail of a power rapist and his other victims and finds herself caught up in a real-life drama. As she presses neglected pieces of the puzzle into place, she unearths a string of brutal kidnappings and rapes across the South, crimes that span decades. All evidence points to one convicted sex offender Larry Lee Smith.As a result of Reynolds' efforts, the Knoxville Police Department reopens the cold-case of Michelle's disappearance, but Larry Lee is about to be released from a Georgia prison, where he is serving time for a related crime--a \"similar transaction.\" Prison means nothing more to Larry Lee Smith than waiting until he can repeat his actions. This is an amazing true story of a cold case turned hot.Reynolds writes a gripping account of how victims, former police and FBI investigators, and a savvy prosecutor come together on a mission to get justice for Michelle.Similar Transactions is the recipient of the IAN Outstanding True Crime Book of the Year Award, the 2017 eLit Gold Award for True Crime, and is among the top five books named The Best of Everything Nonfiction 2016 by author, critic, and screenwriter Emilio Corsetti III. Hundreds of reader reviews and ratings are on Goodreads and Amazon.",
  "genres": [
    "True Crime",
    "Nonfiction"
  ],
  "author": "S.R.   Reynolds",
  "average_rating": "4.18",
  "url": "https://www.goodreads.com/book/show/28321709-similar-transactions"
}