{
  "title": "On Beyond Yoga: A novel of adventure, romance, and transformation",
  "description": "Frustrated with the superficiality of contemporary yoga, three yoga students join their “half-enlightened” teacher on a two week, magical-mystical tour through India's spiritual capitals hoping to find answers.∞Egon is a romantic, happy go lucky, Bavarian enraptured by the exotic and material aspects of modern-day yoga. He is ecstatic when his teacher invites him to an Indian yoga retreat hoping it will be an extension of the spiritual shopping-spree he started with his first yoga class eight years hence.Franz, a successful, German businessman has a horde of physical disorders caused by his consuming desire to excel in the corporate world of materialism. After experiencing a radical reversal of pain through yoga, Franz decides the yoga retreat might offer answers to a few of the deeper questions that have plagued him since he started his mid-life crisis.Lisette is a beautiful, Dutch dancer turned yoga teacher who also decided to join the three men on a trip to three of India's holiest cities.Soon after their arrival, Egon discovers a growing erotic attraction to Franz as Franz develops a passionate feeling of love for Lisette. Lisette only has eyes for her mentor and celibate yoga teacher, Joshua, who has an ongoing hate/love relationship with God he hopes to reconcile in India.This “love square” irons itself out on their journey through the sacred cities of Rishikesh, the current yoga capital of the world; Varanasi, the oldest inhabited city of earth; and Tiruvannamalai, a holy city at the seat of Arunachala, one of India's most sacred mountains.Through a series of philosophical discourses steeped in the Vedic principles of “A Course in Miracles” and filtered through the sutras of Patanjali, the ancient sage of yoga, Joshua leads his three students through variety of strange and mystical experiences, extraordinary encounters and profound revelations that leaves each of them wondering about the true nature of reality.",
  "genres": [
    "M M Romance"
  ],
  "author": "Eric William Brown",
  "average_rating": "4.30",
  "url": "https://www.goodreads.com/book/show/28320470-on-beyond-yoga"
}