{
  "title": "Go Ask Ogre: Letters from a Deathrock Cutter",
  "description": "Teenage hell has never been captured with such intense honesty as these actual letters sent in the late ‘80s from a suicidal girl to the singer of her favorite band. Go Ask Ogre peers into the world of a misfit \"cutter\" who lives with an abusive mother in the rust belt. A tailspin of suicidal depression and self-injury leads her to write Ogre, front man for the industrial rock band Skinny Puppy. Soon he receives a flood of elaborately illustrated letters and journals filled with Jolene’s most intimate thoughts—from her most painful secrets to hilarious observations and lucid realizations about her life and those around her. At a concert, Ogre confides to Jolene that he has saved all her letters. Nine years later, a box from Ogre arrives at Jolene’s door. Re-examining the documents, she realizes that writing these letters had saved her life. Go Ask Ogre compiles Jolene Siana's actual letters, artwork, illustrations, and ephemera into a unique and powerful story of an extremely troubled teen who made it through the worst years of her life, and, through the power of music and art, transformed herself in the process. It is heavily illustrated and full color throughout. Critical \"Pure, lucid and engaging...more authentic for a new generation of young women than, say, the 1971 cautionary tale about drugs, Go Ask Alice .\"—Susan Carpenter, LA Time s \"Dark, funny and touching...\"— boingboing.net \"Cringingly confessional, persistently desperate, yet often uproariously funny. All rendered and packaged in labor-intensive psychedelic outsider graphic design. An overdue riposte to the bludgeoning morality of the fabricated Go Ask Alice .\"—Doug Harvey, LA Weekly \"By turns fierce, funny, heartbreaking and wise, Jolene Siana's Go Ask Ogre burns onto the page in an intense collage of words and images that together create a portrait of a gifted young woman fighting to hang on to her own life and choosing an unlikely—but strangely suitable—ally for her battle.\"—Caroline Kettlewell, author of Skin Game \"Amidst the cultural and political corruption of the late 1980s, seeking and artistic teens like Jolene Siana found cathartic solace in aggressive and so-called 'morbid' bands like Skinny Puppy. That she persevered with the help of music that parents, preachers, and politicians condemned, but rarely tried to understand, is a moving lesson.\"—Alan Rapp, editor of The Journey is the The Journals of Dan Eldon and Dan The Art of Life",
  "genres": [
    "Music",
    "Nonfiction",
    "Memoir",
    "Goth"
  ],
  "author": "Jolene Siana",
  "average_rating": "4.04",
  "url": "https://www.goodreads.com/book/show/283308.Go_Ask_Ogre"
}