{
  "title": "Brazen Femme: Queering Femininity",
  "description": "Brazen Femme: Queering Femininity is a manifesto for the unrepentant bitch, straddling the furious and fantastic. Undeniably celebratory and deeply troubling, this sharp-edged collection (of fiction, prose poetry, personal essay, photographs, and illustration) figures the un-hyphenated femme experience emerging in performance, betrayal, violence, humor and survival.Brazen Femme recognizes femme as an identity in flux and in motion, as constantly being reinvented. This mutability sets the stage for creative and thoughtful representation featuring critically acclaimed writers including Michelle Tea, Camilla Gibb, Sky Gilbert, Amber Hollibaugh and Anurima Banerji. The collection includes the entertaining and challenging work of writers and artists whose stories are missing from existing explorations of femme that exclude experiences of men, transsexual women, and sex workers.Whether by choice or necessity, these frenzied femmes each explore their desires to make (and remake) femininity fit their own queer frames. Darlings, drag queens, whores and action heroes . . . a femme by any other name is spectacular.With writings by Debra Anderson, Anurima Banerji, T.J. Bryan, Anna Camilleri, Daniel Collins, Lisa Duggan and Kathleen McHugh, Camilla Gibb, Sky Gilbert, Tara Hardy, Amber Hollibaugh, Suzann Kole, Heather Mc-Callister, Elaine Miller, Kathryn Payne, Leah Piepzna-Samarasinha, Elizabeth Ruth, Trish Salah, Abi Slone and Allyson Mitchell, Michelle Tea, Zoe Whittal and Karin Wolf.With photographs by Chloë Brushwood Rose, and Daniel Collins, and illustrations by comic artists Sandi Rapini, Suzy Malik and Allyson Mitchell.Chloë Brushwood Rose and Anna Camilleri have been collaborating in Toronto as curators, editors and art-makers for the past four years. Anna co-founded the interdisciplinary performance troupe Taste This, who collaborated on the acclaimed Boys Like Her.",
  "genres": [
    "Queer",
    "Feminism",
    "Nonfiction",
    "Gender",
    "LGBT",
    "Poetry",
    "Sexuality"
  ],
  "author": "Chloë Brushwood Rose",
  "average_rating": "3.92",
  "url": "https://www.goodreads.com/book/show/283473.Brazen_Femme"
}