{
  "title": "Dark Blood",
  "description": "From John Meaney, the author of Bone Song and “the most important new SF writer of the 21st century,”* comes a new novel, Black Blood . In it he offers his intoxicating blend of futuristic noir and gothic fantasy in a thriller that carries a cop with a personal vendetta across the barrier between life and death. Here, in a morbidly lush necropolis, he must stop a conspiracy of killers whose power is fueled by spilling…He’s lucky to be alive. That’s what everyone tells him. Except Tristopolitan police lieutenant Donal Riordan doesn’t feel lucky and he isn’t really alive. In one horrific moment not even death can erase from memory, Donal lost the woman he loved even as her ultimate sacrifice saved his life. Now it’s literally her heart that beats in his chest and her murder that Donal “lives” to avenge.While being a zombie cop has its upsides—including inhuman reaction time and razor-sharp senses—Donal’s new undead status makes him the target of Tristopolis’s powerful Unity Party, whose startling rise to power is built on a platform of antizombie paranoia and persecution. The Party is no friend, to be sure—but it’s the secret cabal known as the Black Circle and their stranglehold on the city’s elite that consume Donal’s black heart. For at the center of this ring of evil is the man responsible for his lover’s murder—a man Donal has already had to kill once before.Now, with ominous reports of white wolf sightings throughout the city and a dangerous sabotage attempt at police headquarters, all signs indicate that the Black Circle is planning a magical coup d’état. And the terror will begin with a political assassination triggered by a necroninja already hidden… in a place no one expects.For Donal, it’s no longer a matter of life and death but something far more serious. How can he stop a killer who won’t stay dead and an evil that death only makes stronger?* Times (London)",
  "genres": [
    "Fantasy",
    "Horror",
    "Urban Fantasy",
    "Science Fiction",
    "Fiction",
    "Dark Fantasy",
    "Crime"
  ],
  "author": "John Meaney",
  "average_rating": "3.93",
  "url": "https://www.goodreads.com/book/show/2833033-dark-blood"
}