{
  "title": "Writing Vivid Dialogue: Professional Techniques for Fiction Authors",
  "description": "Do you want to write fast-paced, exciting, sizzling dialogue?  This book reveals professional dialogue technique to characterise the speaker, carry the plot forward and entertain your readers.  This is not a beginner's guide. I assume that you have mastered the basics of fiction writing, and you don't need an explanation what dialogue is and why it matters for your story. But your dialogue isn't as strong as your story deserves. Perhaps it drags, perhaps the characters all sound the same, and perhaps it lacks tension, wit or sparkle.  I'll offer you a toolbox filled with techniques. These are not 'rules' every writer must follow, but tricks you can try. Pick, mix and match them to suit your characters and your story.  Some of these tools work for all kinds of dialogue, others solve specific problems - how to create male and female voices, how to present foreign languages and accents, how to present historical dialogue and flirtatious banter, how to write dialogue for alpha characters, for children and for liars.  I suggest you read once through the whole book to discover the tools in this kit, then return to the specific chapters which address the challenges of your current project.  You can apply the techniques to write new dialogue scenes, or to revise sections you've already written. When revising, you may want to compare the 'before' and 'after' versions. You'll be amazed how your dialogue scenes come to life.  I won't weigh this book down with literary theory. Sometimes I'll use examples - mostly from my own books, for copyright reasons - but in essence, this is about your writing, your stories, your dialogue.  If you like you can use this book as an advanced dialogue writing course, working your way through each chapter, doing the exercises in the chapter and the assignments at the end of each chapter. or you can simply read the whole book to get a feel for what's in it, then choose the techniques you want to study and apply for the chapter you want to write or revise.",
  "genres": [
    "Writing",
    "Nonfiction",
    "Reference"
  ],
  "author": "Rayne Hall",
  "average_rating": "4.21",
  "url": "https://www.goodreads.com/book/show/28353260-writing-vivid-dialogue"
}