{
  "title": "Trafficked to Hell: A trafficked daughter's plight. A mother's fight to find her.",
  "description": "In the heart of the desert is a city of skyscrapers and unbelievable wealth, but beneath its glossy surface lies the misery of sex trafficking, violence and ruined lives. A brutal world Elena willingly enters to rescue her daughter, placing herself in jeopardy and risking everything for a mother’s love.Kristina travels thousands of miles for the job of her dreams, only to find that she has been betrayed. Trapped and forced to work as a prostitute; under constant fear of a brutal assault from Ponytail Ari, a vicious man employed to keep the girls in line, she finds herself alone, lost and helpless in this strange land.When all official enquiries to find Kristina come to nought, her mother, Elena, who has borrowed money beyond her means to send Kristina out, determines to find her and ends up in the hands of the traffickers herself.Nikki, a hardened con artist and streetwise prostitute arrives in Almina to start a new life and make money. She befriends Elena and together they take on the traffickers with consequences neither expected or were prepared for......The book is a work of fiction but is based on real stories. Whilst the people, places, companies, cities and countries are all figments of the author’s imagination the events are all true and have happened to someone somewhere.Human Trafficking is said to be the second biggest International crime after the drugs trade and has an annual value of 31.6 billion US Dollars. An International Labour Organization report states that 2.5 million people are victims of human trafficking each year with 1.4 million of these being for sexual purposes. These victims are mostly women. To put this into perspective, it is equivalent to the entire female population of Albania or Jamaica being forced or coerced to leave and made to work overseas as prostitutes - each and every year.",
  "genres": [
    "Feminism",
    "Gender",
    "Nonfiction",
    "Gender Studies"
  ],
  "author": "R.J. Flo",
  "average_rating": "4.40",
  "url": "https://www.goodreads.com/book/show/28368870-trafficked-to-hell"
}