{
  "title": "Just Breathe Trilogy Box Set",
  "description": "THE JUST BREATHE SERIES is being revised, re-edited and will have new covers in 2022!Complete ebook series of the Just Breathe trilogy by Martha Sweeney.The Just Breathe series is about a twenty-four-year-old woman named Emma Peterson who has made sure to have as much control over her life as she can since the death of her parents that occurred when she was sixteen. A fear of loss dominates Emma’s mindset when it comes to relationships of all types, especially when it comes to men and dating. Emma doesn’t date. Rather, she uses men for sex.She’s created eight golden rules to keep herself at a distance from men, particularly the men she sleeps with;1. no dating or going out on dates,2. never let them know where she lives,3. never pick up a guy in a particular social setting that she may frequently attend or sleep with a man whom she may have the chance of running into on a regular basis,4. never have a guy over to her apartment for any reason (her gay best friends are the only exceptions),5. always end things before the guy starts to want more,6. always use protection,7. never sleep over at their place after sex, and8. always have more than one exit strategy.When Emma’s best friend, Maggie, becomes involved with a new boyfriend, Emma’s world changes radically. Maggie’s relationship with Henry moves very quickly; faster than any of her previous relations and Emma is not excited about the newcomer to the group. On top of that, Henry’s best friend, Joe Covelli, is the first man Emma has ever met who makes her call her own rules into question.Emma embarks on a journey that tests her beyond the temptation of breaking her rules. She discovers that there’s more to life than having control.**Please Note: the Just Breathe series contains sexually explicit scenes and is suggested for audiences 18+.",
  "genres": [],
  "author": "Martha Sweeney",
  "average_rating": "4.32",
  "url": "https://www.goodreads.com/book/show/28351366-just-breathe-trilogy-box-set"
}