{
  "title": "The Tao of Bill Murray: Real-Life Stories of Joy, Enlightenment, and Party Crashing",
  "description": "Reading The Tao of Bill Murray is like spending time with Bill, but probably safer.  Danny Rubin, screenwriter of Groundhog Day.  This collection of the most epic, hilarious, and strange Bill Murray stories, many of which have never before been reported, spotlights the star's extraordinary ability to infuse the everyday with surprise, absurdity, and wonder. No one will ever believe you. New York Times bestselling author Gavin Edwards, like the rest of us, has always been fascinated with Bill Murray in particular the beloved actor's adventures off-screen, which rival his filmography for sheer entertainment value. Edwards traveled to the places where Murray has lived, worked, and partied, in search of the most outrageous and hilarious Bill Murray stories from the past four decades, many of which have never before been reported. Bill once paid a child five dollars to ride his bike into a swimming pool. The star convinced Harvard's JV women's basketball team to play with him in a private game of hoops. Many of these surreal encounters ended with Bill whispering, No one will ever believe you into a stranger's ear. But The Tao of Bill Murray is more than just a collection of wacky anecdotes. This volume puts the actor's public clowning into a larger context, as Edwards distills Murray's unique way of being into a set of guiding principles. A sideways mix of comedy and philosophy, full of photo bombs, late-night party crashes, and movie-set antics, this is the perfect book for anyone who calls themselves a Bill Murray fan which is to say, everyone. Praise for The Tao of Bill Murray  When confronted by life's challenges and opportunities, we should all be asking ourselves, What would Bill Murray do? This book actually has the answers.  Jay Duplass, writer, director, actor, fan of Bill Murray  [Gavin Edwards] captures Murray's enigmatic, comic genius.  The Washington Post Rib-tickling.  Newsday If you are among the multitudes who have a Bill Murray story (viz: I was in the airport bar, and who sat down next to me but Bill Murray? ), The Tao of Bill Murray will speak to you.  Elle  Murray is an endless delight, and his knack for bons mots and non sequiturs will keep readers laughing before revealing an unexpectedly poignant vision for happiness. . . . A fun and revealing look behind the charm and mythos of Bill Murray that will only strengthen his legend.  Kirkus Reviews  This book is bursting with anecdotes that underline Murray's unconventional and fun-loving life. . . . Murray's fans are sure to savor [it] and walk away with a deeper appreciation of the actor and his work.  Publishers Weekly(starred review)  I just can't fathom how anyone could not like the man. He lives as much as possible by his own rules; this is a guy who doesn't buy round-trip airline tickets because he prefers to make decisions on the fly. That old question of the three people you'd most like to have dinner with? I'd pick Bill Murray and leave the other two chairs empty just to see who he pulls over to join us. . . . You will love The Tao of Bill Murray. Period.  GeekDad  A hilarious read occasionally heartwarming, sometimes head-scratching. . . . Sure to please Murray fans.  Library Journal\"",
  "genres": [
    "Nonfiction",
    "Biography",
    "Humor",
    "Comedy",
    "Biography Memoir",
    "Philosophy",
    "Memoir"
  ],
  "author": "Gavin Edwards",
  "average_rating": "3.54",
  "url": "https://www.goodreads.com/book/show/28363975-the-tao-of-bill-murray"
}