{
  "title": "Alien General's Chosen",
  "description": "This general doesn't play fair...  This is a 70 k full scifi romance novel featuring a BBW human heroine and a growly alpha male Brion warrior general. It can and should be read as a standalone and has a guaranteed HEA ending!  Leiya has a secret. Trouble is, even she doesn't know it. One of the most promising singers Briolina has to offer, no one could know that the bright star is actually a human, a Terran from Earth. But when the most dangerous Brion in the universe marks her as his own, Leiya has more than hidden secrets to worry about. She thought she was ready for the love of her life, but the general is far more than she could have been prepared for! And no one's supposed to deny their chosen... but what if she has compelling reasons to do so, even if her body can't fathom the idea?  Faren is not a simple man. Seemingly devoid of emotions, rational to a fault, he is a monster on the battlegrounds and his reputation far precedes him. But after losing his brother, the only demon who could match him, Faren is aimless. When the binding hits him like a spear to the chest, making him recognize the innocent, curvy Leiya as his true mate, he finally sees a glimmer of a purpose. A goal. Her safety, her heart, and her body.  He will have her, the right way, even if it kills him and everyone around him. Nothing could stop the Monster of Briolina. But it seems like the whole universe is going to try like hell, both to get him as well as kill the human woman he has sworn his heart to. The universe doesn't know the power of an alien general who can only be controlled by the woman he loves...  Will Leiya trust to love the man who is the epitome of everything she despises, or will fate have to make the decision for her?",
  "genres": [
    "Science Fiction",
    "Romance",
    "Aliens",
    "Science Fiction Romance",
    "Fantasy Romance",
    "Warriors",
    "Futuristic"
  ],
  "author": "Vi Voxley",
  "average_rating": "3.99",
  "url": "https://www.goodreads.com/book/show/28378968-alien-general-s-chosen"
}