{
  "title": "Hideous Kinky",
  "description": "This novel is semi-autobiographical and based on the author's own experience of traveling with her mother Bernadine Coverley, in North Africa, between the ages of four and six. Weaving between the vivid descriptions of life on the move, the desert, and its cast of exotic characters, is a deeply moving and poignant tale of what it's like, as a child, to be part of an unconventional family. For Freud herself, daughter of the artist Lucien, and great-granddaughter of the famed Sigmund, childhood was unlikely ever to be normal. The novel beautifully evokes the bohemian life that she and her sister, the fashion designer Bella Freud, unwittingly witnessed as children, while all the while craving a more stable upbringing.Hideous Kinky is the story of Julia, a hippie mother, and a her daughters Lucia and Bea, who travel to Morocco. Early on in the trip the girls decide that many of the sights they witness are best described in the words of the title. Events are narrated through the voice of five-year-old Lucia, who observes their exotic surroundings with mixed emotions. One moment she is seduced by the vast desert skies and the magic of colorful street markets, but the next she is craving a normal, English upbringing, complete with childhood staples such as regular school and set bedtimes. As their mother immerses herself in Sufism, in her quest for personal fulfillment and spiritual enlightenment, the girls' longing for stability amidst the shifting desert sands intensifies. In this, her first novel, Freud not only paints a vivid and compelling picture of a country that was the Mecca of the hippie movement of the 1970's, but also tells a touching story about childhood, with a simplicity and lightness, which both moves and enchants.",
  "genres": [
    "Fiction",
    "Travel",
    "Africa",
    "Morocco",
    "Contemporary",
    "Novels",
    "Family"
  ],
  "author": "Esther Freud",
  "average_rating": "3.51",
  "url": "https://www.goodreads.com/book/show/283787.Hideous_Kinky"
}