{
  "title": "Cured: The Tale of Two Imaginary Boys",
  "description": "\"On our first day of school, Robert and I stood at the designated stop at Hevers Avenue with our mothers, and that's when we met for the very first time. We were five years old.\"So began a lifelong friendship that fourteen years later would result in the formation of The Cure, a quintessential post-punk band whose albums-such as Three Imaginary Boys, Pornography , and Kiss Me, Kiss Me, Kiss Me -remain among the best-loved and most influential of all time.As two of the first punks in the provincial English town of Crawley, Lol Tolhurst and Robert Smith didn't have it easy. Outsiders from the start, theirs was a friendship based initially on proximity and a shared love of music, from the punk that was raging in nearby London to the groundbreaking experimentation of David Bowie's \"Berlin Trilogy.\" First known as The Easy Cure, they began playing in pubs and soon developed their own unique style and approach to songwriting, resulting in timeless songs that sparked a deep sense of identification and empathy in listeners, songs like \"Boys Don't Cry,\" \"Just Like Heaven,\" and \"Why Can't I Be You?,\" spearheading a new subculture dubbed \"Goth\" by the press. The music of The Cure was not only accessible but also deeply subversive, challenging conventional notions of pop music and gender roles while inspiring a generation of devoted fans and a revolution in style.Cured is not only the first insider account of the early days of the band, it is a revealing look at the artistic evolution of the enigmatic Robert Smith, the iconic lead singer, songwriter, and innovative guitarist at the heart of The Cure. A deeply rebellious, sensitive, tough, and often surprisingly \"normal\" young man, Smith was from the start destined for stardom, a fearless non-conformist and provocateur who soon found his own musical language through which to express his considerable and unique talent.But there was also a dark side to The Cure's intense and bewildering success. Tolhurst, on drums and keyboards, was nursing a growing alcoholism that would destroy his place in The Cure and nearly end his life. Cured tells the harrowing and unforgettable story of his crash-and-burn, recovery, and rebirth.Intensely lyrical and evocative, gripping and unforgettable, Cured is the definitive story of a singular band whose legacy endures many decades hence, told from the point of view of a participant and eyewitness who was there when it happened-and even before it all began.",
  "genres": [
    "Music",
    "Nonfiction",
    "Biography",
    "Memoir",
    "Audiobook",
    "Biography Memoir",
    "Goth"
  ],
  "author": "Lol Tolhurst",
  "average_rating": "4.05",
  "url": "https://www.goodreads.com/book/show/28369597-cured"
}