{
  "title": "Storm Holt",
  "description": "Would you sell your soul to save the world? The Storm Holt—the ultimate Wizard’s Reckoning, where all who enter must face their greatest demons. No woman has entered and survived since the Ancients split the magic apart eons ago. Plagued by demons and visions of a strange white spear, Issa must take the Reckoning to find her answers and fight for her soul to prove her worth to the most powerful magic wielders upon Maioria. Rejected by Issa, Asaph lusts after the enchanting pale woman who stalks him, but her allure is foreboding and her power deadly. The Cursed King and his Banished Legion return to end their curse, but all around them is bloody chaos and sorrow and all seems hopeless. Without the help of the Shadow Demons, Issa cannot hope to survive the Storm Holt—and without the help of the Raven Queen, the Shadow Demons will be destroyed. If Issa does not make a pact with the demons, then both Maioria and the Murk are doomed. Storm Holt is the third novel in The Goddess Prophecies bestselling fantasy epic. This series is being hailed as one of the best high fantasy series in years, drawing on all the appeal of Tolkien’s deep and soulful characters, Robert Jordan’s sweeping worlds, and Marion Bradley's unyielding heroines. This is a saga full of spirit, determination and resilience. What reviewers and readers are saying: ★★★★★ \"My 2nd favorite author. Tolkien is my first.\" ★★★★★ \"Your books are better than David Eddings\" ★★★★★ \"Superbly written epic fantasy.\" ★★★★★ \"I loved this book!\" ★★★★★ \"Made me cry a few times but this is what makes a great book.\" ★★★★★ \"Couldn't put it down, highly recommended.\" ★★★★★ \"Love. Finding strength. Dragons. High Magic. Intrigue.\" ★★★★★ \"Definitely not your cliché fantasy novel. A book with a difference.\" ★★★★★ \"Deep, moving, a great read!\" ★★★★★ \"Incredibly inspiring.\" ★★★★★ \"The series is my all-time favourite fantasy series now (and I have read an awful lot of them!). Beautiful and evocative writing, great characters, a fantastic cosmology, and truly epic world-building that is breathtaking in scope. Well done indeed!\" ★★★★★ \"Like the fulfilling high fantasy stories of old, this book is filled with the best the genre has to offer; swords, dragons, witches and wizards, shapeshifters, and epic battles - with a touch of romance...\"",
  "genres": [],
  "author": "Araya Evermore",
  "average_rating": "4.49",
  "url": "https://www.goodreads.com/book/show/28374093-storm-holt"
}