{
  "title": "The Cancer Cure That Worked: 50 Years of Suppression",
  "description": "A detailed account of Rife's inventions and discoveries is the subject of The Cancer Cure That Worked. This startling book documents events from 1913 to the time of Rife's death in 1972. Rife was an optical engineer and technician of great skill. His first success was the building of the Universal Microscope in the late 1920s. With it he was able to view the living cancer virus -- a feat our modern, high-powered electron microscopes still cannot do. His microscope used many quartz prisms and lenses, placed to compensate for losses of refraction due to air. This enabled him to view far tinier particles than had ever been seen before.Using the Universal Microscope which he invented, he observed cancer viruses as they changed their size and form. He discovered that exposing a virus to certain frequencies of radio waves killed it quickly. Years of experimentation led to Rife's invention of the Frequency Instrument, a device that produced the exact frequencies needed to destroy various viruses.In 1934 at the clinic in California, diseased people were exposed to the exact same frequencies that had been seen (through the microscope) to destroy the virus causing their illness. Treatments lasted only three minutes. The person would wait three days before another exposure giving the lymph system time to cleanse the dead virus from their bodies. Unlike the chemotherapy treatments currently in use, Rife's therapy was 100 percent effective and engendered no adverse symptoms.Yet, 53 years after the arrival of Rife's Frequency Instrument, hundreds of thousands of people still die each year of diseases that Royal Raymond Rife cured.The above is excerpted from a book review written by Deki and Jon C. Fox.",
  "genres": [
    "Health",
    "Science",
    "Medicine"
  ],
  "author": "Barry Lynes",
  "average_rating": "3.96",
  "url": "https://www.goodreads.com/book/show/283791.The_Cancer_Cure_That_Worked"
}