{
  "title": "69 Bottles: The Complete Box Set",
  "description": "THIS IS A BOXSET that contains 6 FULL Length Novels about the Rock Band 69 Bottles. $24.00 worth of books bundled into ONE! PLUS!! An Exclusive 5 Chapter Sneak Peak into Zoey’s Upcoming Release: Aryn’s Desire - A Bold Security Novel — A Spinoff of 69 Bottles! The Trio’s Trilogy: Claiming Addison, Craving Talon, Redeeming Kyle - Books 1-3 in the 69 Bottles SeriesFor Addison Beltrand, PR rep for Bold International, Inc. climbing the corporate ladder is all that matters in life. Her hard work is finally rewarded with the promotion she’s worked her ass off to earn—but the gig comes at a price. She leaves in two days for a twelve-week tour with America’s hottest alternative rock band, 69 Bottles. Two men. One dilemma. Talon is wild, reckless and loves control. Kyle is calm, collected and loves passion. The perfect balance…or Addison’s ultimate undoing? Talon and Kyle push their boundaries and Addison’s, but can they throw their reservations to the wind and claim her together? Two men. One woman. A rock band. A tour bus. One Wild Ride… Dex & Raine Duo: Taming Dex and Devouring Raine - Books 4-5 in the 69 Bottles SeriesDex Harris, Drummer for America's Hottest Alternative Rock Band 69 Bottles, has never gone looking for love—for good reason. After an ill-fated night after a tour stop in Phoenix, his wicked demons resurface. Is he strong enough to resist falling back into the black hole that was once his life or will he let addiction consume him? Defining US: The Calvin & Eric Story: Book #6 in the 69 Bottles Series. Loving someone completely means giving them your heart, soul, body and mind. What happens when your heart and soul love someone, but your mind and body refuse to follow? For Calvin Caldwell, being the lead guitarist of America’s hottest rock band 69 Bottles has its perks. Performing night after night with his closest friends, he finds peace with a guitar in his hands. Playing music wipes away his unimaginable past, albeit temporarily. He struggles not only with who he is as a person, but with who he wants to become and what he is hiding. *** CONTENT WARNING *** Read this book if… you enjoy unconventional relationships, reading one handed and you’re ready to dive into the rock god world that is 69 Bottles. This massive box set contains the following: M/F, M/F BDSM, F/F, M/M, M/M/F, M/F/M, and some fun female on male action. It also includes BDSM, rough sex, fun as hell sex, and sex scenes that may have you reaching for your vibrator. Batteries are not included. Defining US may also contain triggers and stories of abuse, neglect and conversion therapy and it’s aftermath.",
  "genres": [
    "M M F",
    "M M Romance",
    "Menage",
    "Contemporary",
    "Erotica",
    "BDSM",
    "Friends To Lovers"
  ],
  "author": "Zoey Derrick",
  "average_rating": "4.34",
  "url": "https://www.goodreads.com/book/show/28374335-69-bottles"
}