{
  "title": "The Gene: An Intimate History",
  "description": "The #1 NEW YORK TIMES Bestseller  The basis for the PBS Ken Burns Documentary The An Intimate History \nNow includes an excerpt from Siddhartha Mukherjee\n’s new book Song of the Cell! From the Pulitzer Prize–winning author of The Emperor of All Maladies—a fascinating history of the gene and “a magisterial account of how human minds have laboriously, ingeniously picked apart what makes us tick” (Elle). “Sid Mukherjee has the uncanny ability to bring together science, history, and the future in a way that is understandable and riveting, guiding us through both time and the mystery of life itself.” —Ken Burns“Dr. Siddhartha Mukherjee dazzled readers with his Pulitzer Prize-winning The Emperor of All Maladies in 2010. That achievement was evidently just a warm-up for his virtuoso performance in The An Intimate History, in which he braids science, history, and memoir into an epic with all the range and biblical thunder of Paradise Lost” (The New York Times). In this biography Mukherjee brings to life the quest to understand human heredity and its surprising influence on our lives, personalities, identities, fates, and choices. “Mukherjee expresses abstract intellectual ideas through emotional stories…[and] swaddles his medical rigor with rhapsodic tenderness, surprising vulnerability, and occasional flashes of pure poetry” (The Washington Post). Throughout, the story of Mukherjee’s own family—with its tragic and bewildering history of mental illness—reminds us of the questions that hang over our ability to translate the science of genetics from the laboratory to the real world. In riveting and dramatic prose, he describes the centuries of research and experimentation—from Aristotle and Pythagoras to Mendel and Darwin, from Boveri and Morgan to Crick, Watson and Franklin, all the way through the revolutionary twenty-first century innovators who mapped the human genome. “A fascinating and often sobering history of how humans came to understand the roles of genes in making us who we are—and what our manipulation of those genes might mean for our future” (Milwaukee Journal-Sentinel), The Gene is the revelatory and magisterial history of a scientific idea coming to life, the most crucial science of our time, intimately explained by a master. “The Gene is a book we all should read” (USA TODAY).",
  "genres": [
    "Science",
    "Nonfiction",
    "History",
    "Biology",
    "Medicine",
    "Audiobook",
    "Genetics"
  ],
  "author": "Siddhartha Mukherjee",
  "average_rating": "4.36",
  "url": "https://www.goodreads.com/book/show/28371575-the-gene"
}