{
  "title": "Eight to Midnight: Episode 1",
  "description": "A Best Friends Romance Sara can't believe it when her friends Harrison, Jasmine, and Matt actually agree to try \"The Challenge\" one drunken, moonlit night. The four close friends and Seattle neighbors figure it's a positively inspired way to jog them out of their romantic ruts. All they have to do is have sex with each other for four hours every week and the rest of the time they will carefully preserve the sanctified friend zone and nobody will be hurt. Right? Wrong...Eight to Midnight is a steamy, sizzling New Adult romance that contains two friends-to-lovers romances--Jasmine and Matt's story and Sara and Harrison's story. The story is told in five episodes in serial format. The episodes have cliffhanger endings. Episodes 2-5 each contain a full eight-to-midnight Challenge night for both couples. THIS IS EPISODE 1.\"MANWHORE\" MATTWith his babe-magnet looks and stress-free approach to life, Matt spends his days blogging about toys and shagging women. Not even his best friends suspect that his careless, commitment-free lifestyle hides dark secrets that he's determined to keep in the dark. \"GEEKY\" HARRISONClueless about women, Harrison wonders why the ladies who adore him for his hottie looks just as quickly turn around and leave him. He suspects it has something to do with the way he prefers reading Dostoyevsky to dating. Keeping his friendship with Sara intact is a number one priority, but when the Challenge starts, he struggles to keep looking at her as the sister he never had...\"ICY\" JASMINECool, controlled Jasmine has been tempted by her best male friend, Matt, for years, but she's never taken his casual flirtations seriously. Sure, he might be the only one to get her frozen blood pumping, but she somehow knows the moment she lets down her guard with Matt, he'll be way more dangerous than the spoiled rich boys she dates. \"AVERAGE\" SARASara knows she's the last person her good friend Harrison would ever look at twice in the romance department. Geek he might be, but he's also Greek-god hot, plus a logical, ambitious PhD student who always treats Sara as a platonic friend--while Sara's a mere office grunt of average intelligence with a compassion and impulsiveness that often get her into trouble. If only she could get him to stop viewing her as a little kid in need of rescue. Which is why she's sure the Challenge is such a good idea...Mature content for readers 18+",
  "genres": [],
  "author": "Karen Harley",
  "average_rating": "4.17",
  "url": "https://www.goodreads.com/book/show/28383335-eight-to-midnight"
}