{
  "title": "How to Save a Life",
  "description": "Josephine Clark is trapped. A harrowing past haunts her every time she looks in the mirror, and she can't escape the violence of her everyday life. More and more, her thoughts turn to Evan Salinger, the boy she knew in high school. The boy they called a mental case. A loner. A freak. The boy who seemed to know things no one could know. For a few short weeks, Jo had found perfect solace in Evan's company, sneaking every night to meet him at the local pool. In the cool of the water and the warmth of Evan's arms around her, Jo had tasted something close to happiness. Cruel circumstances tore them apart, and four years later, the sweet memory of their time together is dissolving under the punishing reality of Jo's life now. Evan seems like a fading dream...until he reappears at the moment she needs him most. Guided by Evan's strange intuition, they flee her small Louisiana town, on the run from the police, and Jo begins to suspect there is something more to his sudden return than he admits. Over twelve days across America's heartland, deep secrets come to light, buried pasts are unearthed, and the line between dreams and reality is blurred as Evan and Jo fight to hold on to their soul-deep love, and discover that there is more than one way to save a life. How to Save a Life is a complete second-chance STANDALONE novel with shades of the paranormal. It carries the characters from high school through to their early twenties. It is not YA; mature subject matter and sexual situations. TRIGGER some domestic violence (on the page) and mentions of sexual abuse (off the page) For readers 18 years and up. Also by Emma Scott Full Tilt (Full Tilt #1) All In (Full Tilt #2) RUSH Endless Possibility (a RUSH novella)",
  "genres": [
    "Romance",
    "New Adult",
    "Paranormal",
    "Abuse",
    "Contemporary",
    "Contemporary Romance",
    "Fantasy"
  ],
  "author": "Emma   Scott",
  "average_rating": "4.02",
  "url": "https://www.goodreads.com/book/show/28398690-how-to-save-a-life"
}