{
  "title": "Dark Horde Rising",
  "description": "A thousand years have passed since the Elder Kingdoms were lost. Once the Elder races ruled all the northern lands and their knowledge and power were legend. What calamity befell them, none now know. Centuries on and the north is a land where fell beasts and evil creatures roam unchecked, save in one place, the Wildlands of Darylor. Here mankind has slowly begun to explore and settle where once the Elder ruled, and within those lands, built amidst the ruins of a lost Elder city, lies the College of Magic. Inside, mankind seeks to rediscover the lost magics of old, but in secret one man desires the power to rule all and will stop at nothing to achieve his dream. Meanwhile, in the city of Shandrilos, in the shadow of the College of Magic, a groups of friends come together. Jon 'Bear' Madraig, fighter and mage, and his best friend the roguish swordsman and knight, Darin of Kenarth come to meet old friends and relive past adventures. The master mage, Arkadi Talcost and the beautiful druid, Rebba Korran, seek only to relax and enjoy some time away from the demands of their work and the College. For these friends, this is merely a reunion. However, for Zara Halven, the notorious Whore of Ostia, and for the monk, Garon Vale, the visit to Shandrilos is more; for one it is a chance for redemption and for the other it is a test of faith. Yet for the last of the friends, the visit to Shandrilos is the most important of all. For the huntress, Nat Bero it is a chance for forgiveness... and for revenge. These friends will be caught up in events that will change their lives forever, for the secret behind the destruction of the Elder is about to come to light... \"The fate of all can be decided by the actions of one who the gods guide to the right place at the right time. Do not underestimate the power of even the lowest to affect the paths of the mighty...\" The words of the seeress, Ry'Ina White Eyes If you are a reader of epic fantasy this is what you are looking for. If you liked Terry Brook's Shanara novels, Raymond E. Feist's Midkemia books, Harry Potter, Game of Thrones or Lord of the Rings then this is a book for you. In the same vein as the Wheel of Time and akin to the gaming fantasy of the Dragonlance books, Dark Horde Rising will propel you into a detailed new world of magic and mystery while introducing you to a whole range of new and interesting characters.",
  "genres": [
    "Epic",
    "Fiction",
    "Book Club",
    "Contemporary"
  ],
  "author": "Iain Hope",
  "average_rating": "4.34",
  "url": "https://www.goodreads.com/book/show/28391654-dark-horde-rising"
}