{
  "title": "The Lion of St. Mark",
  "description": "The first book in an adventurous trilogy  The House of Ziani and the House of Soranzo had been enemies ever since their grandfathers' joint business venture had collapsed more than forty years before. Then, they had chosen not to resolve their differences in the courts. Instead, they each sought to prevail in their rivalry by investing, trading, and manipulating as each battled to dominate and ultimately ruin the other. The fathers passed this legacy on to their sons.... A sleek Venetian fleet plows through stormy November seas, bearing reinforcements to help defend the fabled city of Constantinople against an impending siege by Ottoman Turks. Rescue plans are jeopardized, however, when an age-old bitter conflict flares between two Venetian nobles The brave naval Captain Giovanni Soranzo thirsts for revenge against the proud marine officer, Antonio Ziani. These two men will survive the sacking of Constantinople and will find their lives bound together in a heroic struggle to save their beloved city.The year is 1452, and while Italy glories in the Renaissance, Venice is on the verge of an epic war of survival against the powerful Turks, who are intent on conquering Venetian lands, possessing her riches, and utterly destroying the city forever. Now these two patricians, both patriots, must temper their hostility toward each other with loyalty to their beloved republic. Fighting each other when they can, fighting together when they must, Ziani and Soranzo risk their lives to defend Venice---and their honor.Much more than a war story, this is a tale of Venice, when she was the greatest city on earth and the world's only republic. It is a tale, too, of her people, whose fortunes and very lives were dependent on her success. Admired, envied, hated, and feared, but with her vast wealth and vaunted navy, always respected, she is La Serenissima---the Serene Republic of Venice---and this is her story.Thomas Quinn combines his expertise on Venice with explosive, page-turning action to give readers an epic novel of struggle and survival.",
  "genres": [
    "Historical Fiction",
    "Italy"
  ],
  "author": "Thomas      Quinn",
  "average_rating": "3.69",
  "url": "https://www.goodreads.com/book/show/284023.The_Lion_of_St_Mark"
}