{
  "title": "Call Me... Vengeance",
  "description": "Call Me... Vengeance Book 1 in the Vengeance MC series ~ Boss and Beth's story ~  Plagued by demons long since dead, Jackson ‘Boss’ Carr has worked tirelessly to steer his MC away from the illegal guns and drug trade, but it was proving to be difficult to say the least. All Boss wanted was for his brothers was for them to have a future paved in gold, not bathed in the blood of innocents. He’d spent years saving his family from the wreckage and devastation of rival MC’s.  With plans to move his MC out of the past and into the future, Boss refused to allow his goals to be compromised, regardless of the cost to him personally. As far as he was concerned it was time to usher in a new era…The era of the newly overhauled, Vengeance MC.  Bethany Leanne Miller hated the life she led before taking steps to break free of her parent’s suffocating hold over her. Lured to, Furnace, Colorado by her old friend and fellow tattooist, Jonas, with the promise steady work and a whole new way of life, Bethany in under the delusion that things might just be starting to look up. That is until she realizes that, Furnace is not your normal sleepy mountain town, and the man she meets within days of arriving isn’t only handsome, charming, and powerful, but capable of turning her life upside down in an instant.  Faced with a choice between the people he’s obligated to love, and the woman who owns his heart, Boss is caught in a classic game of tug of war involving his family, and the woman he believes has committed the ultimate betrayal against him.  However, nothing is what it seems when you begin with an MC on the verge of changes the likes they have never seen, and you add to that a rival MC who would like nothing more than to see them fail. When you throw in a woman who unintentionally ends up impacting everything and everyone around her, and you have a recipe for disaster that has, Boss and Vengeance MC scrambling to make headway through the obstacles they are now faced with.  ***Authors Note*** As of the 4th of February, 2016 the content of this book has been re-edited, and as such, the new version has been uploaded for your reading pleasure.  *~*COMING SOON*~* ~ Fury ~ Jonas ~ Gage ~ Cash ~ Sly ~ Dirty  ***This book is intended for readers over the age of 18. It contains coarse language, mature content, sex scenes, material and situations that may offend some readers. ***",
  "genres": [
    "Romance",
    "Abuse",
    "Dark",
    "Contemporary",
    "Erotic Romance"
  ],
  "author": "Natasha Thomas",
  "average_rating": "4.14",
  "url": "https://www.goodreads.com/book/show/28406361-call-me-vengeance"
}