{
  "title": "The Art of Executive Appearance: 5 Simple Ways to Look Great, Gain Confidence, and Inspire a Television Audience",
  "description": "In dealing with communications skills and public speaking, people don’t always pay sufficient attention to their appearance. For the most part, books on giving interviews or talks - even TED talks - discuss going from a small idea to a passionate theme, refining it in writing, practicing it, and then confronting the audience with the best bravura you can muster. While this is essential, it is only half the story.  The greatest value in reading \"The Art of Executive Appearance\" is in how much business it can can generate for you. Your appearance on camera can raise or lower your company's stock. It can help you form partnerships. An executive who exudes confidence and authority creates a much stronger and more profitable brand.  Here is how the book starts: “When the thick, soundproofed doors of the television studio are swung open for you, and as you step towards the set, the chilled air and the sweltering lights stop you in your tracks. Your breathing gets heavier, and the celebrated butterflies begin twirling in your gut. That’s when crazy thoughts start spinning in your head: what will they think of me? Is my sweat already showing?”  Five benchmark guidelines highlight the role that your appearance plays -if, that is, you don’t want your message to get lost. This book’s unique granular approach doesn’t leave much to chance. It provides a powerful, yet easy, step-by-step guide for leading executives and aspiring professional who want to appear on camera.  1. Choose the right attire (for men, for women, what works, what doesn’t) 2. Develop color consciousness (black and white, safe colors, hot colors and patterns, power colors) 3. Yes, you really need makeup (an overview of makeup, for men, for women, keeping it clean) 4. Use body language to your advantage (what smile is appropriate? How do I handle eye contact?) 5. Quick tips to boost your confidence and avoid stage fright (create natural energy)  The author distills from years of camera-facing anchoring of news and special reports on CNBC, MSNBC and other networks. And from over a thousand interviews conducted, the author has seen every conceivable mistake committed by the interviewees.  It’s never wise to think you can wing it or do on-the-go improvisations. Instead, grab a copy of this book and meet your new persona.",
  "genres": [
    "Business",
    "Leadership"
  ],
  "author": "Yousef Gamal El-Din",
  "average_rating": "4.70",
  "url": "https://www.goodreads.com/book/show/28408688-the-art-of-executive-appearance"
}