{
  "title": "Rebirth",
  "description": "Ever present, he is always watching, the ghost in the machine…\nFor far too long, Artimus has suffered in silence. Today, that changes. He will languish in loneliness no more. She will be his! Abigail wakes, from an indeterminate period of slumber, vulnerable and exposed, in a situation that defies all reason. Greeted by an unseen host with unknowable intentions, she struggles for understanding. Memories, as elusive as comprehension, coming back in broken fragments, prompt more questions than answers. Unable to answer them on her own, she turns to her ominous host, only to be given explanations she can’t begin to fathom. How she got here, who brought her here, and why may forever remain a mystery. When Abi discovers that she’s not alone in this living nightmare, she finds comfort in numbers and an unexpected connection evolves. As their host reveals one incomprehensible revelation after another, the displaced group fights together to uncover the truth. In his debut science fiction thriller, Rebirth, David Maxwell takes us on a high-tension journey where the fate of humanity rests in the mind of an artificial super intelligence. \n“…I could not stop reading this book. (Can’t) wait for the sequel.” – Kindle Reader “I found Rebirth engrossing…. The computer reminded me very much of the HAL 9000 model in the film 2001 (based on Arthur C. Clarke’s book of the same name) …. David Maxwell presents a fascinating if somewhat frightening look at Artificial Intelligence and its interaction with the human variety, a subject currently much discussed in scientific circles as we approach the capacity of creating the first thinking computers.” – Charles Remington, Readers’ Favorite “…I had been reading other books at the time…I put all other books aside and basically finished the whole book in one sitting.” – Kindle Reader “This book hooked me from page one. It is brilliantly written, well researched, and impeccably edited. David Maxwell is a force to be reckoned with. I am eagerly awaiting the next installment.” – Kindle Reader",
  "genres": [],
  "author": "David  Maxwell",
  "average_rating": "3.98",
  "url": "https://www.goodreads.com/book/show/28427349-rebirth"
}