{
  "title": "Life Re-Scripted: Find Your Purpose and Design Your Dream Life Before The Curtains Close",
  "description": "How would your life story change if I told you there was no such thing as what you’re \"supposed\" to do?What if you didn't have to live by the script that was handed down to you? What if you could create a life on your own terms?This insightful and inspirational book will guide you through the process of rewriting your life story and starting to live a life of adventure and purpose.After leaving the 9-5 corporate world to become an entrepreneur, I quickly realized that there is more to life than creating an income or a savings account. I'm sure you can relate - perhaps you feel lost or unsure of what to do next with your life. Are you stuck?If you feel compelled to live by the wash, rinse and repeat cycle that was passed down to you, then you’re in the right place.Go to college, get a degree, find a job, go to work, get married, have kids, retire, hopefully leave a legacy. Deep down, you know there has to be more to life.It's time to get off the hamster wheel.But how?How can you leave a legacy behind when the rules have been written by someone else, limited by their fears, dictated by their failures and their experiences? More importantly, what if you could deploy the principles in Life Re-Scripted to discover your purpose in life right now?Life Re-Scripted is a tool that will transform your fears and inspire you to redesign your story.Life Find Your Purpose And Design Your Dream Life Before The Curtains Close gives you the foundation to change your life number one strategy for determining your life purpose and how you can start a new path todayThe 5X Life Hack Rule for accomplishing your dreams and designing life on your own terms five times faster (this is how I took my life from 0 to 60 in less than 6 months)The ultimate solution for fear and how you can leverage it right now to make this your best year yetAnd so much moreFollow the advice in this book and you will find that you can make changes to your life in as little as an afternoon.So how will your story end?It’s your choice. Rescript your life. Do it for you.",
  "genres": [
    "Business"
  ],
  "author": "Zephan Moses Blaxberg",
  "average_rating": "4.32",
  "url": "https://www.goodreads.com/book/show/28427090-life-re-scripted"
}