{
  "title": "Noble Vision",
  "description": "Beautiful, strong-willed ballerina Nicole Hudson, who rose to Broadway stardom from a heartbreaking childhood, finds her life shattered by a head injury that leaves her blind. Her only hope lies in an experimental procedure pioneered by young Manhattan neurosurgeon David Lang.But David’s revolutionary treatment---a way of re-growing damaged nerves to cure brain and spinal cord injuries---requires the approval of New York’s health system, CareFree. Wracked with budget overruns and other priorities, CareFree is skeptical of David’s claims and rejects the new technique.Moved by Nicole’s desperate pleas for the treatment, David does the unthinkable. Believing his procedure safe to try on humans, he performs the first of two brain surgeries on Nicole. A second operation must follow within weeks, if she is to regain her sight.David’s defiance of CareFree unleashes a firestorm. His license is suspended, and he is ordered to discontinue Nicole’s treatment or face jail. He implores the one man who can bend the rules to allow Nicole’s treatment, the head of CareFree---his father. But the father is running for lieutenant governor, and an act of favoritism would foil his vast political ambitions.Pulled together in the turbulence are David and Nicole. He vows to complete her treatment, no matter what price he must pay. She, mortified at the trouble she is causing him, refuses to continue her treatment, no matter what price she must pay. Will she ever see again?A visionary doctor, a courageous patient, an intense family conflict, and an exciting medical discovery converge in one explosive case.This novel won two national awards: ForeWord magazine’s Book of the Year and Writer’s Digest’s 13th Self-published Book Awards. The author, a former pharmaceutical chemist, offers a romantic thriller and insider’s look at the conflicts we face in healthcare today.",
  "genres": [
    "Fiction",
    "Romance",
    "Politics",
    "Thriller",
    "Suspense",
    "Philosophy"
  ],
  "author": "Gen LaGreca",
  "average_rating": "4.12",
  "url": "https://www.goodreads.com/book/show/2843051-noble-vision"
}