{
  "title": "Healing Love",
  "description": "Saints Protection & Investigation A private investigation business, pulling together men from the CIA, FBI, ATF, DEA, Border Patrol, SEALs, and police, devoted to the missions that no one else wanted or could solve.Cam Perez left his juvenile deliquent years behind to become an undercover detective and then accepted a job with Saints Protection & Investigations. When a friend’s sister, a Red Cross nurse, was kidnapped, Cam eagerly stepped up to take on the rescue mission. The right man for the job, he was focused on what needed to be done… until he lay eyes on her. And then not only saving her life but winning her heart became the new mission. Miriam Delaro had become discontent in her hospital job, so the chance to go to Mexico to work for the Red Cross when an earthquake struck was the perfect career change. Then she and three other nurses were kidnapped by a drug cartel, who needed their services to aid the cartel’s wounded. She tended the ill by day, but at night prayed for a deliverer, wondering if escape was possible. Then he came… disguised as a lowly, wounded worker. Their meeting was only the beginning. Having to escape the guards, travel by canoe in a storm, and cross miles of perilous Mexican cartel country to get to the ocean where the Saints could pick them up was their goal. Falling in love was their reward. ****Due to scenes of an explicit sexual nature and language that some consider crude, please be warned - for 18+ only! If you do not like alphas with heart who fall instantly in love with strong female characters while dealing with real life issues... again be warned!!***** **This version has the corrected Spanish endearment in it!**",
  "genres": [
    "Romance",
    "Romantic Suspense",
    "Contemporary",
    "Military Fiction",
    "Suspense",
    "Contemporary Romance",
    "Mystery Thriller"
  ],
  "author": "Maryann Jordan",
  "average_rating": "4.41",
  "url": "https://www.goodreads.com/book/show/28420531-healing-love"
}