{
  "title": "Altamont: The Rolling Stones, the Hells Angels, and the Inside Story of Rock's Darkest Day",
  "description": "In this breathtaking cultural history filled with exclusive, never-before-revealed details, celebrated rock journalist Joel Selvin tells the definitive story of the Rolling Stones’ infamous Altamont concert, the disastrous historic event that marked the end of the idealistic 1960s.In the annals of rock history, the Altamont Speedway Free Festival on December 6, 1969, has long been seen as the distorted twin of Woodstock—the day that shattered the Sixties’ promise of peace and love when a concertgoer was killed by a member of the Hells Angels, the notorious biker club acting as security. While most people know of the events from the film Gimme Shelter, the whole story has remained buried in varied accounts, rumor, and myth—until now.Altamont explores rock’s darkest day, a fiasco that began well before the climactic death of Meredith Hunter and continued beyond that infamous December night. Joel Selvin probes every aspect of the show—from the Stones’ hastily planned tour preceding the concert to the bad acid that swept through the audience to other deaths that also occurred that evening—to capture the full scope of the tragedy and its aftermath. He also provides an in-depth look at the Grateful Dead’s role in the events leading to Altamont, examining the band’s behind-the-scenes presence in both arranging the show and hiring the Hells Angels as security.The product of twenty years of exhaustive research and dozens of interviews with many key players, including medical staff, Hells Angels members, the stage crew, and the musicians who were there, and featuring sixteen pages of color photos, Altamont is the ultimate account of the final event in rock’s formative and most turbulent decade.",
  "genres": [
    "Music",
    "History",
    "Nonfiction",
    "True Crime",
    "Audiobook",
    "Crime",
    "Cultural"
  ],
  "author": "Joel Selvin",
  "average_rating": "4.20",
  "url": "https://www.goodreads.com/book/show/28435534-altamont"
}