{
  "title": "The Babe Ruth Deception",
  "description": "“David O. Stewart is rapidly becoming one of our best new writers of historical mysteries . . . [Fraser and Cook] have plenty of fraught challenges, but none more engaging and human than the swaggering, generous, profligate Great Bambino.”—Washington Times, September 22, 2016As the Roaring Twenties get under way, corruption seems everywhere—from the bootleggers flouting Prohibition to the cherished heroes of the American Pastime now tarnished by scandal. Swept up in the maelstrom are Dr. Jamie Fraser and Speed Cook . . .Babe Ruth, the Sultan of Swat, is having a record-breaking season in his first year as a New York Yankee. In 1920, he will hit more home runs than any other team in the American League. Larger than life on the ball field and off, Ruth is about to discover what the Chicago White Sox players accused of throwing the 1919 World Series are learning—baseball heroes are not invulnerable to scandal. With suspicion in the air, Ruth’s 1918 World Series win for the Boston Red Sox is now being questioned. Under scrutiny by the new baseball commissioner and enmeshed with gambling kingpin Arnold Rothstein, Ruth turns for help to Speed Cook—a former professional ballplayer himself before the game was segregated and now a promoter of Negro baseball—who’s familiar with the dirty underside of the sport.Cook in turn enlists the help of Dr. Jamie Fraser, whose wife Eliza is coproducing a silent film starring the Yankee outfielder. Restraint does not come easily to the reckless Ruth, but the Frasers try to keep him in line while Cook digs around.As all this plays out, Cook’s son Joshua and Fraser’s daughter Violet are brought together by a shocking tragedy. But an interracial relationship in 1920 feels as dangerous as a public scandal—even more so because Joshua is heavily involved in bootlegging. Trying to protect Ruth and their own children, Fraser and Cook find themselves playing a dangerous game . . .Once again masterfully blending fact and fiction, David O. Stewart delivers a nail-biting historical mystery that captures an era unlike any America has seen before or since in all its moral complexity and dizzying excitement.PRAISE FOR DAVID O. STEWART AND THE WILSON DECEPTION“The book’s fun part is its name game, as familiar historic figures mingle with made up-characters.  The story line’s dangling threads are braided into a tight, clever finish, worthy of a vintage spy caper.”—The Washington Post“Stewart deftly depicts the mood of an era and the colorful figures who shaped it.”—Publishers WeeklyAND PRAISE FOR THE LINCOLN DECEPTION“More than enough to satisfy any reader of historical whodunits.”—The Washington Post“Historian Stewart’s debut novel is dense with detail and intrigue, making a hearty read for conspiracy addicts.”—Library Journal“A little-known aspect of Lincoln assassination lore makes a gripping thriller and historical inquiry.”—The Roanoke Beacon“Most Lincoln fiction is dreadful. This fast-paced and smartly researched first novel is astonishingly good, complete with sharp and colorful characters, nicely drawn by Stewart.” —Bloomberg News, 6 Best Books of 2013",
  "genres": [
    "Fiction",
    "Mystery",
    "Sports",
    "Baseball",
    "Historical Fiction"
  ],
  "author": "David O. Stewart",
  "average_rating": "3.40",
  "url": "https://www.goodreads.com/book/show/28439386-the-babe-ruth-deception"
}