{
  "title": "The Battle for Sanskrit: Is Sanskrit Political or Sacred, Oppressive or Liberating, Dead or Alive?",
  "description": "There is a new awakening in India that is challenging the ongoing westernization of the discourse about India. The Battle for Sanskrit seeks to alert traditional scholars of Sanskrit and Sanskriti - Indian civilization - concerning an important school of thought that has its base in the US and that has started to dominate the discourse on the cultural, social and political aspects of India. This academic field is called Indology or Sanskrit studies. As the author avers, from their analysis of Sanskrit texts, the scholars of this field are intervening in modern Indian society with the explicitly stated purpose of removing 'poisons' allegedly built into these texts. They hold that many Sanskrit texts are socially oppressive and serve as political weapons in the hands of the ruling elite; that the sacred aspects need to be refuted; and that Sanskrit has long been dead. The traditional Indian experts would outright reject or at least question these positions, he says.The start of Rajiv Malhotra's exploration of where the new thrust in Western Indology goes wrong, and his defense of what he considers the traditional, Indian approach, began with a project related to the Sringeri Sharada Peetham in Karnataka, one of the most sacred institutions for Hindus. There was, as he saw it, a serious risk of distortion of the teachings of the peetham, and of sanatana dharma more broadly.Whichever side of the fence one may be on, The Battle for Sanskrit offers a spirited debate marshalling new insights and research. It is a valuable addition to an important subject and, in a larger context, on two ways of looking. Is each view exclusive of the other, or can there be a bridge between them? Readers can judge for themselves.",
  "genres": [
    "Nonfiction",
    "India",
    "History",
    "Politics",
    "Hinduism",
    "Philosophy",
    "Language"
  ],
  "author": "Rajiv Malhotra",
  "average_rating": "4.36",
  "url": "https://www.goodreads.com/book/show/28432017-the-battle-for-sanskrit"
}