{
  "title": "The Last Painting of Sara de Vos",
  "description": "“Written in prose so clear that we absorb its images as if by mind meld, “The Last Painting” is gorgeous wry, playful, and utterly alive, with an almost tactile awareness of the emotional contours of the human heart. Vividly detailed, acutely sensitive to stratifications of gender and class, it’s fiction that keeps you up at night — first because you’re barreling through the book, then because you’ve slowed your pace to a crawl, savoring the suspense.” —Boston GlobeA New York Times Bestseller\nA New York Times Book Review Editor's Choice\nA RARE SEVENTEENTH-CENTURY PAINTING LINKS THREE LIVES, ON THREE CONTINENTS, OVER THREE CENTURIES IN THE LAST PAINTING OF SARA DE VOS, AN EXHILARATING NEW NOVEL FROM DOMINIC SMITH.Amsterdam, 1631: Sara de Vos becomes the first woman to be admitted as a master painter to the city’s Guild of St. Luke. Though women do not paint landscapes (they are generally restricted to indoor subjects), a wintry outdoor scene haunts She cannot shake the image of a young girl from a nearby village, standing alone beside a silver birch at dusk, staring out at a group of skaters on the frozen river below. Defying the expectations of her time, she decides to paint it.New York City, 1957: The only known surviving work of Sara de Vos, At the Edge of a Wood, hangs in the bedroom of a wealthy Manhattan lawyer, Marty de Groot, a descendant of the original owner. It is a beautiful but comfortless landscape. The lawyer’s marriage is prominent but comfortless, too. When a struggling art history grad student, Ellie Shipley, agrees to forge the painting for a dubious art dealer, she finds herself entangled with its owner in ways no one could predict.Sydney, 2000: Now a celebrated art historian and curator, Ellie Shipley is mounting an exhibition in her field of female painters of the Dutch Golden Age. When it becomes apparent that both the original At the Edge of a Wood and her forgery are en route to her museum, the life she has carefully constructed threatens to unravel entirely and irrevocably.",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Book Club",
    "Art",
    "Historical",
    "Audiobook",
    "Mystery"
  ],
  "author": "Dominic Smith",
  "average_rating": "3.87",
  "url": "https://www.goodreads.com/book/show/28443427-the-last-painting-of-sara-de-vos"
}