{
  "title": "Britt-Marie Was Here",
  "description": "The bestselling author of A Man Called Ove and My Grandmother Asked Me to Tell You She’s Sorry returns with an irresistible novel about finding love and second chances in the most unlikely of places.Britt-Marie can’t stand mess. A disorganized cutlery drawer ranks high on her list of unforgivable sins. She begins her day at 6 a.m., because only lunatics wake up later than that. And she is not passive-aggressive. Not in the least. It's just that sometimes people interpret her helpful suggestions as criticisms, which is certainly not her intention. She is not one to judge others—no matter how ill-mannered, unkempt, or morally suspect they might be.But hidden inside the socially awkward, fussy busybody is a woman who has more imagination,bigger dreams, and a warmer heart that anyone around her realizes. When Britt-Marie walks out on her cheating husband and has to fend for herself in the miserable backwater town of Borg—of which the kindest thing one can say is that it has a road going through it—she is more than a little unprepared. Employed as the caretaker of a soon-to-be demolished recreation center, the fastidious Britt-Marie has to cope with muddy floors, unruly children, and a (literal) rat for a roommate. She finds herself being drawn into the daily doings of her fellow citizens, an odd assortment of miscreants, drunkards, layabouts—and a handsome local policeman whose romantic attentions to Britt-Marie are as unmistakable as they are unwanted. Most alarming of all, she’s given the impossible task of leading the supremely untalented children’s soccer team to victory. In this small town of big-hearted misfits, can Britt-Marie find a place where she truly belongs?Funny and moving, observant and humane, Britt-Marie Was Here celebrates the unexpected friendships that change us forever, and the power of even the gentlest of spirits to make the world a better place.",
  "genres": [
    "Fiction",
    "Contemporary",
    "Audiobook",
    "Book Club",
    "Humor",
    "Adult",
    "Adult Fiction"
  ],
  "author": "Fredrik Backman",
  "average_rating": "4.09",
  "url": "https://www.goodreads.com/book/show/28436716-britt-marie-was-here"
}