{
  "title": "The Waco Siege: An American Tragedy",
  "description": "During fifty one days in early 1993 one of the most tragic events in American crime history unfolded on the plains outside Waco, Texas. An obscure and heavily armed religious sect called the Branch Davidians was barricaded inside their commune and outside were hundreds of law enforcement angry because the former had killed four ATF agents in a botched raid. Open the pages of this book and go on an engaging and captivating ride to examine one of the most important true crime stories in recent decades. Read the shocking true story of how a man the government considered a psychopath, but whose followers believed to be a prophet, led a breakaway sect of the Seventh Day Adventist Church into infamy.You will follow the meteoric rise of the Branch Davidians’ charismatic leader, David Koresh, as he went from an awkward kid in remedial classes to one of the most infamous cult leaders in world history. But the story of the Waco Siege begins long before the events of 1993. At the core of the conflict between the Branch Davidians and the United States government were ideas and interpretations of religious freedom and gun ownership, which as will be revealed in the pages of this book, a considerable philosophical gulf existed between the two sides. David Koresh and the Branch Davidians carried on a long tradition in American and Texas history of religious dissent, but in 1993 that dissent turned tragically violent.You will find that beyond the standard media portrayals of the Waco Siege was an event comprised of complex human characters on both sides of the firing line and that perhaps the most tragic aspect of the event was that the extreme bloodshed could have been avoided.The pages of this book will make you angry, sad, and bewildered; but no matter the emotions evoke, you will be truly moved by the events of the Waco Siege.",
  "genres": [
    "Nonfiction",
    "History",
    "True Crime",
    "Audiobook",
    "Cults",
    "Crime",
    "Religion"
  ],
  "author": "Jack Rosewood",
  "average_rating": "3.42",
  "url": "https://www.goodreads.com/book/show/28434676-the-waco-siege"
}