{
  "title": "Spaceman: An Astronaut's Unlikely Journey to Unlock the Secrets of the Universe",
  "description": "Have you ever wondered what it would be like to find yourself strapped to a giant rocket that’s about to go from zero to 17,500 miles per hour? Or to look back on the earth from outer space and see the surprisingly precise line between day and night? Or to stand in front of the Hubble telescope, wondering if the emergency repair you’re about to make will inadvertently ruin humankind’s chance to unlock the universe’s secrets? Mike Massimino has been there, and in Spaceman he puts you inside the suit, with all the zip and buoyancy of life in microgravity.Massimino’s childhood space dreams were born the day Neil Armstrong set foot on the moon, but his journey to realizing those dreams was as unlikely as it is captivating. Growing up in a working-class Long Island family, Massimino catapulted himself to Columbia and then MIT, only to flunk his qualifying exams and be rejected twice by NASA before making it to the final round of astronaut selection—where he was told his poor eyesight meant he’d never make the cut. But even that couldn’t stop him from finally earning his wings, making the jump to training in T-38 Air Force jets and preparing his body—and soul—for the journey to the cosmos.Taking us through the surreal wonder and beauty of his first spacewalk, the tragedy of losing friends in the Columbia shuttle accident, and the development of his enduring love for the Hubble telescope—which he’d be tasked with saving on his final mission— Massimino has written an ode to never giving up and the power of teamwork to make anything possible. Spaceman invites us into a rare, wonderful world where the nerdiest science meets the most thrilling adventure, and pulls back a curtain on just what having “the right stuff” really means.",
  "genres": [
    "Nonfiction",
    "Space",
    "Science",
    "Biography",
    "Memoir",
    "Audiobook",
    "Autobiography"
  ],
  "author": "Mike Massimino",
  "average_rating": "4.53",
  "url": "https://www.goodreads.com/book/show/28439264-spaceman"
}