{
  "title": "The Landscape of History: How Historians Map the Past",
  "description": "What is history and why should we study it? Is there such a thing as historical truth? Is history a science? One of the most accomplished historians at work today, John Lewis Gaddis, answers these and other questions in this short, witty, and humane book. The Landscape of History provides a searching look at the historian's craft, as well as a strong argument for why a historical consciousness should matter to us today.Gaddis points out that while the historical method is more sophisticated than most historians realize, it doesn't require unintelligible prose to explain. Like cartographers mapping landscapes, historians represent what they can never replicate. In doing so, they combine the techniques of artists, geologists, paleontologists, and evolutionary biologists. Their approaches parallel, in intriguing ways, the new sciences of chaos, complexity, and criticality. They don't much resemble what happens in the social sciences, where the pursuit of independent variables functioning with static systems seems increasingly divorced from the world as we know it. So who's really being scientific and who isn't? This question too is one Gaddis explores, in ways that are certain to spark interdisciplinary controversy.Written in the tradition of Marc Bloch and E.H. Carr, The Landscape of History is at once an engaging introduction to the historical method for beginners, a powerful reaffirmation of it for practitioners, a startling challenge to social scientists, and an effective skewering of post-modernist claims that we can't know anything at all about the past. It will be essential reading for anyone who reads, writes, teaches, or cares about history.",
  "genres": [
    "History",
    "Nonfiction",
    "Philosophy",
    "School",
    "Grad School",
    "World History",
    "Historical"
  ],
  "author": "John Lewis Gaddis",
  "average_rating": "3.74",
  "url": "https://www.goodreads.com/book/show/28437.The_Landscape_of_History"
}