{
  "title": "Fracture: Barack Obama, the Clintons, and the Racial Divide",
  "description": "Barack Obama's speech on the Edmund Pettus Bridge to mark the fiftieth anniversary of the Selma to Montgomery marches should have represented the culmination of Martin Luther King Jr.'s dream of racial unity. Yet, in  Fracture , MSNBC national correspondent Joy-Ann Reid shows that, despite the progress we have made, we are still a nation divided—as seen recently in headline-making tragedies such as police killings of Black citizens and uprisings across the country.  With President Obama's election, Americans expected an open dialogue about race but instead discovered the irony of an African American president who seemed hamstrung when addressing racial matters, leaving many of his supporters disillusioned and his political enemies sharpening their knives. To understand why that is so, Reid examines the complicated relationship between Barack Obama and Bill and Hillary Clinton, and how their varied approaches to the race issue parallel the challenges facing the Democratic party the disparate parts of its base and the whirl of shifting allegiances among its power players—and how this shapes the party and its hopes of retaining the White House.Fracture traces the party's makeup and character regarding race from the civil rights days to the Obama presidency. Filled with key political players such as Shirley Chisholm, Jesse Jackson, John Lewis, and Al Sharpton, it provides historical context while addressing questions arising as we head into the next national Will Hillary Clinton's campaign represent an embrace of Obama's legacy or a repudiation of it? How is Hillary Clinton's stand on race both similar to and different from Obama's, or from her husband's? How do minorities view Mrs. Clinton, and will they line up in huge numbers to support her—and what will happen if they don't? Veteran reporter Joy-Ann Reid investigates these questions and more, offering breaking news, fresh insight, and experienced insider analysis, mixed with fascinating behind-the-scenes drama, to illuminate three of the most important figures in modern political history, and how race can affect the crucial 2016 election and the future of America itself.",
  "genres": [
    "Politics",
    "History",
    "Nonfiction",
    "Race",
    "Government",
    "American History"
  ],
  "author": "Joy-Ann Reid",
  "average_rating": "4.03",
  "url": "https://www.goodreads.com/book/show/28448152-fracture"
}