{
  "title": "The Forever War",
  "description": "Series Info:This is the first part of the \"Forever War\" series, however it can be read as a standalone.Book Description:Twenty-five years ago, Joe Haldeman became an instant presence in the science fiction field with the publication of The Forever War, which went on to win both the Hugo and Nebula awards for Best Novel. The Forever War is an ingenious, complex account of soldiers whose lives have been brutally disrupted by the combined effects of relativity and interstellar war. It has remained in print continuously since its initial appearance, and has recently given rise to some unexpected new offshoots. In 1997, Avon Books released an amended version of the text that restored the middle section -- a downbeat novella published independently as You Can Never Go Back -- to its originally intended place. In early 1999, Haldeman contributed a second related novella --A Separate War -- to Robert Silverberg's anthology, Far Horizons. Most recently, Haldeman reversed his own frequently stated position by publishing a novel-length sequel titled Forever Free. It seems appropriate, in light of this creative flurry, to return to the source -- The Forever War itself -- and take another look.The Forever War was Joe Haldeman's second novel. His first, War Year, was published in 1972, and was a realistic, frankly autobiographical account of its author's experiences as a combat soldier in Vietnam. These experiences, radically reconfigured, also found their way into The Forever War, which is very much a reflection of the lingering effects of the \"seemingly endless\" war in Vietnam. Haldeman's version of that conflict begins in 1996, just one generation after the withdrawal of American troops from Vietnam. In that year, the combined forces of Earth declare war against an apparently hostile race of aliens known as Taurans. As part of the military response to the Tauran threat, William Mandella, the narrator-hero, is drafted and placed in an elite combat unit composed of the best and brightest members of his own generation. In order to engage the remote, enigmatic Taurans, Mandella and his cohorts must travel through a series of \"collapsars,\" anomalous gateways in the fabric of quantum space. Passage through these gateways results in a relativistic phenomenon known as \"time dilation.\" By the end of Mandella's first, bloody campaign (which covers about two years of subjective time), more than 25 years have elapsed on his home planet. He returns to Earth to find himself a stranger in a very strange land, where he knows almost no one and where the patterns of day-to-day life have changed beyond recognition. Unable to cope with these changes, he reenters the barbarous but familiar society of the army, accompanied by his friend, lover, and fellow soldier, Marygay Potter. Back in uniform, Mandella finds himself trapped, once again, in an endless cycle of violence and temporal displacement. He endures (and barely survives) a series of lethal, faceless encounters with an enemy that no one, least of all the political and military leaders of Earth, can begin to understand. In the resulting chaos, the one constant in Mandella's life is his relationship with Marygay. Finally, even that is taken away, and he is left with nothing but the prospect of dying for an incomprehensible cause.Throughout this process, relativity continues to impose its distortions. As the war carries Mandella and his fellow soldiers toward an increasingly remote series of battlefields, centuries roll by on Earth. In the course of these centuries, populations rise and fall, historical epochs flower and fade, and humanity evolves in unexpected directions. Eventually, at the tail end of a pointless, infinitely protracted war, Mandella returns -- a young/old man of barely 30 -- to a radically altered society he can neither recognize nor live in. In the end, he is forced to confront the fundamental irony of his thousand-year military career: Having left his home to do battle with aliens, he himself has now become the alien, and has no place in the world he fought to preserve.The Forever War is very much concerned with alienation, which assumes a cruel and quite literal form during the course of the story. And though, like all good novels, it is many things at once -- acerbic portrait of the military mentality; imaginative extrapolation of the principles of relativity; meditation on the future of warfare in a technologically advanced society -- it derives much of its power from its compelling portrait of disenfranchised soldiers detached, by the very nature of their experiences, from the social mainstream. In a way, The Forever War serves as an extravagant metaphor for the actual condition of the soldiers who fought in Vietnam, and who returned home to a divided society that failed, almost completely, to acknowledge their efforts or honor their sacrifices.After more than a quarter of a century, The Forever War continues to matter, continues to engage our sympathy for the individual men and women caught in the movement of huge, impersonal forces. Like Catch-22, to which it bears a familial resemblance, The Forever War is a novel about the desperate search for sanity in an unreasoning world, and the universality of its concerns makes it as fresh and relevant today as it was in 1975, when the national nightmare of Vietnam was still raw and recent. Literary prognostication may be a fool's game, but the betting here is that The Forever War will endure well into the newly arrived millennium. Its energy, compassion, and bitter, hard-won wisdom are timeless qualities that should, by rights, continue to speak to new generations of readers.\n\n--Bill Sheehan",
  "genres": [
    "Science Fiction",
    "Fiction",
    "War",
    "Space Opera",
    "Classics",
    "Science Fiction Fantasy",
    "Military Fiction"
  ],
  "author": "Joe Haldeman",
  "average_rating": "4.14",
  "url": "https://www.goodreads.com/book/show/117897.The_Forever_War"
}