{
  "title": "Double Dragons Boxed Set",
  "description": "Three hot and sexy dragon ménage romances... \n\n\nWelcome to the world of dragons, fire-breathing enforcers of the shifter world who possess special powers and do everything in pairs. Strong, sexy and unimaginably wealthy, the only thing these dragons need is a sexy mate to complete their triads. Enjoy all three complete and separate stories! \n\n\n\n\nDouble Dragons \n\n\nRan and Draven need a mate now. As the black and gold dragons of their region, their very lives depend on finding the right woman to complete their triad. And when they find and rescue Melissa, a quiet librarian who has gotten in way over head trying to do the right thing, they know she’s the one. If she agrees to be their mate, she’ll have full access to the men’s hearts, wealth, and incredibly generous love-making. But in return, she’ll have to put everything on the line, including her own life, as she enters the dangerous world that the dragons call home...\n\n\n\nDesired By Dragons \n\n\nWhen Tara jumped into icy water to save a drowning child, she was expecting to die. Instead, she wakes up to find that two tall, beautiful men with rare powers want her for their own. Tara's intrigued by the dragons and the off-the-charts sexual chemistry she feels with them, and agrees to spend a week figuring out if she can really belong in their world of magic and adventure. But the dragons aren't the only ones who want Tara forever, and an obsessed ex from her past may bring the dragons the biggest challenge they've ever faced. Drake and Quill will have to put the past aside and learn to work together if they want to attain their most important goal: protecting their mate!\n\n\nDestined Dragons \n\nSterling and Gentry are the powerful leaders of the New York dragons and still looking for the perfect mate. From the moment they meet the brave, independent, and curvy Roxy, they’re sure she’s the one for them. Now they just have to show her all the reasons she should be the mate of two sexy, capable dragon shifters who live for nothing but to please her, while keeping her safe from the men still stalking her. But while things quickly get hot between Roxy and her sexy shifters, evil forces are also building to mount an attack. If the dragons want to protect Roxy from the most dangerous foes they’ve ever faced, they may have to make choices that could lose her forever!\nWarning: Each of the Dragon books is a standalone novel with no cliff-hangers and two sexy, stubborn dragons who might just light your fire. However, each also contains adult-level sexiness and some intense action scenes and is meant for mature readers only. Enjoy!",
  "genres": [],
  "author": "Terry Bolryder",
  "average_rating": "4.43",
  "url": "https://www.goodreads.com/book/show/28449011-double-dragons-boxed-set"
}