{
  "title": "Pęknięte odbicie",
  "description": "Zapadająca w pamięć historia, w której ożywają najgorsze lęki każdej świeżo upieczonej matki…Tony bardzo się martwi. Jego żona Anna nie radzi sobie z opieką nad ich nowo narodzonym synkiem. Tak bardzo pragnęła dziecka, a kiedy Jack wreszcie przyszedł na świat, oboje z mężem wprost nie posiadali się ze szczęścia. Ze szpitala wrócili już jako pełna rodzina. Od tamtego momentu Anna nie jest jednak sobą. W jednej chwili płacze, w następnej wręcz tryska optymizmem. To pewnie normalne po urodzeniu dziecka, dochodzi do wniosku Tony, po prostu Anna musi się przyzwyczaić. A on miał przecież ostatnio tyle pracy. Ale wszystko powinno się jakoś ułożyć. Tyle że Anna i Jack znikają bez wieści. A Tony czuje, że coś jest naprawdę nie w porządku…Czy problem depresji poporodowej jest poruszany wystarczająco często?Czy łatwiej wybaczyć komuś, kto nie działał w pełni sił umysłowych?Jak, i czy w ogóle można, pogodzić się ze śmiercią dziecka?Niezwykła historia choroby psychicznej i rozpaczy opowiedziana z odwagą i współczuciem.„Newtown Review of Books”Skłaniająca do refleksji, chwytająca za serce, choć niełatwa opowieść wyszła spod pióra debiutantki, której nie sposób odmówić znajomości tematu i empatii.„The Hoopla”Zachwycający debiut.„Tasmanian Times”Autorka opowiada tragiczną historię z niesamowitym wyczuciem, a wiedza medyczna pozwala jej rzucić światło na temat, który za sprawą powszechnych stereotypów niewielu potrafi zrozumieć.„Sydney Morning Herald”[Opowieść] równie wciągająca co przerażająca.„Sunday Life”Zapierająca dech w piersiach powieść – po części psychologiczny thriller, po części dramat rodzinny. Świetny wybór dla klubów książki.„Bookseller & Publisher”Pasjonująca lektura.„The Weekend West”Poruszająca powieść obyczajowa w najlepszym wydaniu.„Gold Coast Eye”",
  "genres": [
    "Contemporary",
    "Fiction",
    "Thriller",
    "Mystery",
    "Womens Fiction",
    "Book Club",
    "Australia"
  ],
  "author": "Dawn Barker",
  "average_rating": "3.83",
  "url": "https://www.goodreads.com/book/show/28450526-p-kni-te-odbicie"
}