{
  "title": "A Life Everlasting: The Extraordinary Story of One Boy's Gift to Medical Science",
  "description": "A donor mother’s powerful memoir of grief and rebirth that is also a fascinating medical science whodunit, taking us inside the world of organ, eye, tissue, and blood donation and cutting-edge scientific research. When Sarah Gray received the devastating news that her unborn son Thomas was diagnosed with anencephaly, a terminal condition, she decided she wanted his death—and life—to have meaning. In the weeks before she gave birth to her twin sons in 2010, she arranged to donate Thomas’s organs. Due to his low birth weight, they would go to research rather than transplant. As transplant donors have the opportunity to meet recipients, Sarah wanted to know how Thomas's donation would be used. That curiosity fueled a scientific odyssey that leads Sarah to some of the most prestigious scientific facilities in the country, including Harvard, Duke, and the University of Pennsylvania. Pulling back the curtain of protocol and confidentiality, she introduces the researchers who received Thomas’s donations, held his liver in their hands, studied his cells under the microscope. Sarah’s journey to find solace and understanding takes her beyond her son’s donations—offering a breathtaking overview of the world of medical research and the valiant scientists on the horizon of discovery. She goes behind the scenes at organ procurement organizations, introducing skilled technicians for whom death means saving lives, empathetic counselors, and the brilliant minds who are finding surprising and inventive ways to treat and cure disease through these donations. She also shares the moving stories of other donor families. A Life Everlasting is an unforgettable testament to hope, a tribute to life and discovery, and a portrait of unsung heroes pushing the boundaries of medical science for the benefit of all humanity.",
  "genres": [
    "Nonfiction",
    "Science",
    "Memoir",
    "Medicine",
    "Medical",
    "Parenting",
    "Health"
  ],
  "author": "Sarah   Gray",
  "average_rating": "3.93",
  "url": "https://www.goodreads.com/book/show/28448337-a-life-everlasting"
}