{
  "title": "Moon, Moon",
  "description": "This is the 35th Annivesary Edition of the orignal classic book with a new introduction from the author. “This book was amazing. Every page answered a question I had about the moon… pictures of ancient moon goddesses, moon mythology and folklore in other countries, the ancient feminine connection to the moon and her cycles. What a joy to read.” imnotwiccan.blogspot.com “The book succeeds in conjuring a shimmering image of the White Goddess in many of her lost forms. In the hands of Rush and her colleagues, she shines on.” Carolly Erickson, San Francisco Review of Books “The book is best read in a quiet, contemplative mood. Moon, Moon invites you to treat it as a kaleidoscope of images, to turn its pages as an old and treasured scrapbook, pausing briefly at images or words that catch your eye…. As I began rereading the sections on the moon goddess, I realized that Rush had set before me a feast of images, not scholarship, but evocations of the many faces of the Moon Mother. Suddenly (Navajo) Changing Woman came alive for me and I saw her sitting peacefully at the place of all beginnings…. I recommend Moon, Moon highly to women who are willing to give it the time and space it deserves, who wish to feel the energy and power of the moon rhythms flowing in their own bodies and minds.” Carol P. Christ, Plexus “Since ancient times the moon has been a symbol of the female, and in this book Anne Kent Rush has gathered an impressive compendium of moon lore.” Los Angeles Times “Moon, Moon is a wondrous offering to the women of the world. It is whimsical and playful at times, and yet absolutely serious and certain of its political ramifications. As Jean Mountaingrove writes in Womanspirit, ‘It is a major reference book for feminists’.” Chellis Glendinning, Runes “An early ripple in the New Wave of feminism.” Publishers Weekly, 1976 “An in-depth exploration of lunar legend, mythology, history and philosophy through the ages. Richly illustrated.” San Francisco Sunday Examiner & Chronicle",
  "genres": [
    "Nonfiction",
    "Goddess",
    "Religion"
  ],
  "author": "Anne Kent Rush",
  "average_rating": "4.06",
  "url": "https://www.goodreads.com/book/show/2845512-moon-moon"
}