{
  "title": "The Mail Order Brides of Boot Creek Anthology",
  "description": "The Mail Order Brides of Boot Creek AnthologyWretched ChastityFleeing New York and her creditors, Chastity Donovan arrives in Boot Creek to marry an alcoholic miner, with a murderous bent. The promise of a new life quickly evaporates, but outlaw Lucian Ellison presents an interesting dilemma. He is determined to not only find the gold that is owed him, but also steal Chastity for his own.Desperate LolaLola Parsons is a runaway, determined to escape the clutches of her stepfather. Being a mail order bride will solve all of her problems, as Mrs. Hershey has connected her to one of the wealthiest cattle barons in the territory. But her new husband won’t tolerate lies, and trouble looms from the threat of a business rival. To compound matters, Lola’s worst fears are realized when her stepfather kidnaps her, throwing everything into chaos.Shameful CeliaAfter Celia’s husband dies in a freak accident, she is forced to answer a mail order bride ad, hoping to wed quickly. After arriving in Boot Creek, her fiancé, Earnest Hobart, is shocked to learn that not only has she been married before, but Celia’s also heavily pregnant. Pastor Nicolas Kinsley must step in to help, offering the mother-to-be a place to stay in the Men’s Emporium, where he lives. He falls hard for Celia, but a secret from his past threatens to destroy any chance of happiness.Spoiled EvelynA woman of means, Evelyn Warner refuses to marry the man her family insists upon, fleeing with her maid, Tory, to the New Mexico Territory. Believing she has successfully escaped, hiding under the guise of a mail order bride, Evelyn is hesitant to marry Percy Vanguard, although he is from a respectable family and kindhearted. A chance encounter with Boot Creek’s most notorious bachelor, Chuck Brittle, in a stairwell, stuns Evelyn, especially when he takes her in his arms and kisses her. Trouble is never far behind, though, and the past is about to catch up with her.",
  "genres": [],
  "author": "Carré White",
  "average_rating": "4.30",
  "url": "https://www.goodreads.com/book/show/28465036-the-mail-order-brides-of-boot-creek-anthology"
}