{
  "title": "Death: An Exploration: Learning To Embrace Life's Most Feared Mystery",
  "description": "WINNER of the 5th Annual Beverly Hills Book Awards  Discover Insights about Coping with Life's Most Feared Mystery  This book will help anyone who is interested in learning more about death, coping with a loss, approaching death, or explaining death to a child. It is an exploratory journey that includes multiple viewpoints, including Steve Jobs’s embrace of his death, Ray Kurzweil’s striving for immortality, and Joseph Campbell’s view of death as the “ornament of life.” The book looks at death from the perspectives of atheists, Christians, and Tibetan Buddhists, among many others. Interestingly, it considers the often unexplored aspects such as the curious relationship between death and ayahuasca. It is a guidebook, offering insights and comfort on a topic that many find frightening or macabre.  The author grew up with a skeleton in his living room, and surrounded by other symbols of death. His unusual upbringing makes him uniquely qualified to serve as guide. As you join him in discovering more about death, you will find yourself enjoying a fuller life.   Highlights of what you will learn...    Theories from Great Contemporary Minds   Spiritual Insights   Scientific Discoveries   Personal Reflections     Reviews   “In Loren Mayshark’s Death: An Exploration: Learning to Embrace Life’s Most Feared Mystery, he writes, 'experiencing death has dragged me into emotional pits and has also compelled me to deep contemplation. This journey has filled me with wonderment as well as remorse.' I found those sentences to be humble ones which transmit the abstract premise of his book into something we can explore in a concrete way. His narrative voice is at the same time both scholarly and personal. It lets the reader join him in trying to figure out what this concept of death is. His observations emerge out of his curious youth, grow to an adolescent’s pondering, and then further mature with the wise citations of well-researched information from philosophers, scientists, and other distinguished thinkers.  The author makes no definite assertions in his book, allowing the reader to stay open to nuance. Like Mayshark, we are all immature in answering death’s puzzling question.” –Peter Hamilton, author of The Devil Hates a Coward  “In Death: An Exploration: Learning to Embrace Life’s Most Feared Mystery, Loren Mayshark shares his personal inquiry of what death is or could be in the stories of others as they faced the inevitable and find solace in religion, science, nature, spiritual guidance. But the exploration doesn't stop there. While knowing and understanding death often remains a conundrum, this exploratory primer suggests what is separate can be whole; what defines death, defines life. Death: An Exploration: Learning to Embrace Life’s Most Feared Mystery is a terrific read for those embarking on their pursuit of the illusive, the contrary, the inescapable: death... and life.” -Linda A. Lavid, author of The Dying Of Ed Mees",
  "genres": [
    "Nonfiction"
  ],
  "author": "Loren Mayshark",
  "average_rating": "3.66",
  "url": "https://www.goodreads.com/book/show/28459339-death"
}