{
  "title": "How an iPhone Made Me the Youngest Billionaairee",
  "description": "Destiny conspires with hard-work to create what he deserved. Based on a true story where the author incurs many failures in life but believes that failure comes to those who deserve something bigger. He continuously fails in many entrepreneurial ventures but his attitude towards great sayings keeps him going. Despite not having the best of qualifications, he defies the rule and the common notion that only qualified make it large. Common beliefs of the masses have been challenged at every point.The mention of the business ventures he undertakes while in college and the problems solved by his early philosophical knowledge. Despite being discouraged by the non-entrepreneurial environment, he dares to rise against the wind. He has done something worth writing and written something worth reading! \"Awesome book. Very well written. I recommend this book to every teenager as it would surely transform their lives and it will help them to create opportunities for themselves. We need young entrepreneurs in India.\"- Verified Purchase on Amazon.in\"Amazing book.. i have no words in praise of this book..everyone should read this.. must read for everyone..i assure you, this will change your life..\" Verified Purchase on Amazon.inAbout The AuthorK Sraff is an entrepreneur. He has undertaken various profit, non-profit ventures, most of which have been mentioned in the book. He has highlighted on a philosophy that \"When you help others, the universe conspires to help you...!\" which also sets the core theme of the book. How an iPhone Made Me the Youngest Billionaairee has sold thousands of copies in India and abroad. Widely appreciated with over 200+ ratings in Goodreads, 100+ reviews on Amazon. The book speaks not just about dreams, change, but urges the readers to implement what they conceive!",
  "genres": [
    "Business",
    "Nonfiction"
  ],
  "author": "K SARAFF",
  "average_rating": "4.51",
  "url": "https://www.goodreads.com/book/show/28476490-how-an-iphone-made-me-the-youngest-billionaairee"
}