{
  "title": "Exposed: The Toxic Chemistry of Everyday Products and What's at Stake for American Power",
  "description": "Winner of the 2008 NAUTILUS SILVER AWARD in the category of Ecology/Environment/Sustainability and Conscious Media/Journalism New evidence seems to arrive daily--from stories about tainted pet food to toxic toys--of the dangerous consequences that lax environmental policies are having on the consumer products that we, and our children, use every day thanks to lobbying efforts by the U.S. chemical industry.Meanwhile, the European Union is forcing these global corporate giants to chart a new path that, by requiring safe products, is revamping how businesses can create safe products and make money.In The Toxic Chemistry of Everyday Products and What's at Stake for American Power investigative journalist Mark Schapiro takes the reader inside the corridors of global power where tectonic battles are occurring that will impact the health of ourselves and the planet.Schapiro's expos© shows how laws adopted by the European Union--where stricter consumer-safety standards are in place--have forced multinationals into manufacturing safer products. And, short of such strong government action the United States will lose its claim of economic and environmental supremacy.Increasingly, products developed and sold in the United States are equated with serious health hazards, and many of those products are soon to be banned from Europe and other parts of the world.Schapiro's revelations in this thought-provoking work will change the way American consumers think about everyday products--from plastic softeners that can contribute to sexual malformations to lipstick additives that are potential toxins to the brain, liver, kidneys, and immune system. And it will stir them into forcing our government to take the lead of others, including the European Union, China, and countries in Central and South America.Exposed is a revealing and fascinating look at global markets, everyday products, and the toxic chemicals that bind them. It will shock, inform, and warn American businesses and government leaders about the risks of being left behind in the international marketplace.Schapiro's book shines a light on Europe's evolving search for higher standards that places Brussels, not Washington, at the center of global market innovation.",
  "genres": [
    "Nonfiction",
    "Politics",
    "Science",
    "Sustainability"
  ],
  "author": "Mark Schapiro",
  "average_rating": "3.86",
  "url": "https://www.goodreads.com/book/show/1179165.Exposed"
}