{
  "title": "Wakker Zijn in een slapende wereld",
  "description": "Je leeft in de spannendste tijd ooit. De verschuiving van de 3e naar de 5e Dimensie waarover al zo lang gesproken wordt vindt nu plaats. Jij bent hier niet 'toevallig'. En dit boek heeft niet 'toevallig' zijn weg naar jou gevonden. Wanneer je dit boek in je handen hebt ben je een Pionier - je weet dat deze verschuiving gaande is. Via dit boek biedt je jezelf de gelegenheid om op een prettige manier om te gaan met alle veranderingen die plaatsvinden. 'Wakker zijn in een slapende wereld' geeft antwoorden op de vragen die spelen bij Pioniers. Hoe ga je om met mensen die nog helemaal niet bezig zijn met 'wakker worden'? En met het steeds grotere contrast in de wereld? Waar is dat gevoel van eenheid en van liefde waar zoveel over wordt gepraat? De kans is groot dat je je alleen voelt staan en dat de eenzaamheid groeit. Je hebt behoefte aan mensen om je heen die denken zoals jij. Hoe ga je daarmee om? Ben je bezig met wakker worden, dan kom je -vroeg of laat - terecht in deze moeilijke fase van het wakker worden. Het is onderdeel van de transformatie naar een nieuwe beschaving. Met 'Wakker Zijn in een slapende wereld' nemen Tom, Robell en ander niet-fysiek bewustzijn jou mee naar een veel breder perspectief, in de richting van de perceptie van de 5e Dimensie.'Wakker Zijn in een slapende wereld' is een boeiend boek dat geruststelt, uitdaagt en wakker maakt. Met grensverleggende inzichten van een 'wakker' mens, zich bewust van de werkelijkheid van zichzelf, deze realiteit en het Alles-dat-is. Dit boek staat garant voor diepgaande inzichten en transformatie voor wie daar klaar voor is. Hét boek voor iedereen die bezig is met wakker worden: voor de Pioniers van de nieuwe tijd! Over Tom de KokDoor de jaren heen gaf Tom meer dan 700 workshops en lezingen over wie en wat we zijn, de werking van de mens en ons bestaan. Met 'Wakker Zijn in een slapende wereld' draagt hij bij aan de verschuiving naar een volledig nieuwe beschaving, die wordt gekenmerkt door eenheid, liefde en vrijheid.Over RobellRobell is het collectief van niet-fysiek bewustzijn van waaruit Tom als projectie is ontstaan. Dit collectief bevindt zich in de 5e Dimensie en daarbuiten en legt vanuit die positie uit wat de verschuiving is, wat wakker worden betekent, wat je werkelijk bent en hoe deze realiteit, de 5e Dimensie en het Alles-dat-Is functioneren.",
  "genres": [],
  "author": "Tom de Kok",
  "average_rating": "4.20",
  "url": "https://www.goodreads.com/book/show/28495338-wakker-zijn-in-een-slapende-wereld"
}