{
  "title": "Angel of Harlem",
  "description": "Inspired by the extraordinary events of Dr. May Chinn’s life, Angel of Harlem is a deeply affecting story of love and transcendence. Weaving seamlessly scenes from the battlefields of the Civil War, during which her father escaped from slavery, to the Harlem living rooms and kitchen tables where May is sometimes forced to operate on her patients, this fascinating novel lays bare the heart of a woman who changed the face of medicine.A gifted, beautiful young woman in the 1920s, May Edward Chinn dreams only of music. For years she accompanies the famed singer Paul Robeson. However, a racist professor ends her hopes of becoming a concert pianist. But from one dashed dream blooms another: May would become a doctor instead–-the first black female physician in all of New York.Giddy with the wonder of the Harlem Renaissance and fueled by firebrand friends like Langston Hughes and Zora Neale Hurston, May doggedly pursues her ambitions while striving to overcome the pains of her past: the death of a fiancé, a lost child, and a distant father ravished by the legacy of slavery. With every grief she encounters, a resilient piece of herself locks into place. At times risking her life–attending to men stabbed in their homes and women left to die in filthy alleys–May struggles to carve out a place for herself within a medical world that still teaches that a “Negro” brain is not anatomically wired for higher thinking. Yet against the odds, she achieves her goal, starts her own practice, and becomes one of the first cancer specialists in the city.Alive with the pulse of black unrest in 1920s New York, this beautifully textured novel moves with fearlessness and grace through a history that is by turns ugly and sublime. With Angel of Harlem, critically acclaimed author Kuwana Haulsey gives poetic voice to the story of a remarkable woman who had the courage to dream and live beyond her era’s limitations.From the Hardcover edition.",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "African American",
    "Novels",
    "New York"
  ],
  "author": "Kuwana Haulsey",
  "average_rating": "3.99",
  "url": "https://www.goodreads.com/book/show/284914.Angel_of_Harlem"
}