{
  "title": "The Love Series Box Set: The Love Series - The Complete Box Set",
  "description": "Available for a limited time in a box set, all 4 novels of The Love Series for only $.99! Over 1000 pages of former Navy SEALs, a mob boss & his henchman in one delicious series.Silent LoveFormer Navy SEAL Sean Millen has been perfectly fine with his bachelorhood until recently. He longs to find a woman he could spend his nights beside.Four years ago, Beth Connors' world was entirely altered. Each night she sheds grief-filled tears over the former life she once led but will never be able to regain. When Beth literally runs into Doctor Sean Millen, a force of nature, he takes an immediate interest in her. But Beth's natural instinct to push Sean away to save herself and him from the difficult task of adjusting their lives to her shortcomings is always front and center. Yet, Beth secretly longs for love.Can Sean push past Beth's concrete walls that she refuses to destroy? Or will Beth's shocking revelation of her past prevent them from finding the love they both deserve? Or will a tragic accident pull Sean and Beth apart permanently?Unexpected LoveRyan Millen, notorious playboy, loves his one-night-stands and single status without any desire to settle down into a permanent relationship. To be in a relationship requires work and sacrifice. Why torture himself?Lynn can't find a job and can't afford to pay the bills after her ex dumped her while she'd been in middle of nursing school. Now she's on her brother's doorstep, begging for a place to stay so maybe she can find a way to crawl out of the hole she's been swallowed by. Embarrassed by her situation, she vows never to become dependent on a man again.Ryan's world is turned upside down when a wrench is thrown into his perfect single life. His life spins out of control, about to lose his job and his mind.An opportunity crosses Lynn's path that she'd never considered and can't refuse-to possibly gain financial independence.Will Ryan's new world destroy him or can he move forward and embrace it, opening his heart for an unexpected surprise. Can Lynn save Ryan from himself? Can she trust again? What happens when they push against the natural draw they have toward one another? And what happens when Ryan's past reappears, set out for revenge?Dangerous LoveDerk Forester is a man who's used to getting what he wants when he wants in all aspects of his life - work and play. Years embedded deep in the mob and a sour taste for relationships, he has zero desire to find a permanent partner to make a home with. His carefree lifestyle leaves him with a long list of inconsequential, bed-rocking, no-strings-attached women. Until he meets...her. The one woman who could bring him to his knees and be used against him.Mackenzie Hiland's life is a dismal list of horrible choices and even worse consequences. Yet, Mackenzie can't help but to be lured in by the dangerous man, who is blatant in his desire to get her into his bed. Despite the fact she tries to distance herself, he refuses her rejections. Will Derk become another addition to the long list of regretful decisions she's made? Could Derk possibly be the man possibly be the man that doesn't screw her over? Or will Derk be the one choice that finally takes her to a point of no return?Taken LoveSmith has worked for the powerful and ruthless organized crime Murphy family for years. He spends his days and nights with only one goal, to get through to the next day, watching his boss's back. A past he avoids at all costs leaves him with a cold, lonely bed and no possibility of future relationships. Until she needs his help.Cara O'Hara has lived a hard life. But nothing prepares her for the threat that Cara's mother has now hindered her with, a debt she finds herself fighting to stay alive. Can Smith help save Cara from an early grave? Will Cara's presence distract Smith from the life he's created for himself? What happens when both their worlds collide? Will he be able to save her?",
  "genres": [],
  "author": "Casey Clipper",
  "average_rating": "4.24",
  "url": "https://www.goodreads.com/book/show/28502570-the-love-series-box-set"
}