{
  "title": "The Ancestors: A Tale from Outside Time & Space",
  "description": "Reporting on an extraterrestrial sighting and their message for mankind, a renowned journalist clashes with those who oppose the story, unaware that the real battle is for his own soul.  After the loss of a close friend, journalist Zach Miller spirals into depression, suffering from writers block for the first time in his career. Battling to regain his passion to write, he is approached by an esoteric group who promises him a story of historical magnitude, one that will forever change the way we look at life. Taken to a secluded ranch, Zach is completely stunned as he comes face to face with extraterrestrials. These galaxy travelers inform him that they are distant ancestors of mankind and will be coming back soon to rescue humanity from their current path of destruction. They have chosen Zach to relay their message of hope and how they plan to bring about the peace and spiritual harmony that all men long for.  While Zach and millions of others around the world embrace the news, his sister Vanessa finds the account disturbing. For years, her religious faith has been a source of irritation for Zach and he scoffs at her suggestion that these aliens may have sinister motives. Unlike her confusing Christian dogma which has only caused division over the centuries, the Ancestors offer a creed that seeks to unify and provides him a deeper knowledge into many of life’s mysteries. Infused with a real sense of purpose, Zach remains steadfast to overcome any obstacles that keep him from sharing this newfound wisdom.  But nothing he has learned can possibly prepare him for The Day.  Thrust into the most cataclysmic event in modern times, Zach is forced to reevaluate everything he has heard and confront the troubling questions about the true nature of the Ancestors. With his back up against an overwhelming wall of fear and doubt, his only chance to survive hinges upon discovering the real truth in time.",
  "genres": [],
  "author": "W.M. Barnard",
  "average_rating": "3.00",
  "url": "https://www.goodreads.com/book/show/28495957-the-ancestors"
}