{
  "title": "3096 Dage",
  "description": "Den sande historie om Natascha Kampusch, den østrigske pige der blev kidnappet på åben gade i 1998 og først slap fri efter 8 år, kan få det til at gyse i enhver. Hun var på vej til skole, havde netop skændtes med sin mor og var gået uden at sige farvel, da hun blev grebet af en mand som kastede hende ind i sin varevogn og kørte væk med hende. De næste par år tilbragte hun i et specialkonstrueret rum på få kvadratmeter i mandens kælder, indtil han havde knækket hende så grundigt, at han kunne tage hende op i huset. Her måtte hun arbejde som hans slave. Han sultede hende, tæskede hende og misbrugte hende. Men en sommerdag i 2006, da han havde sat hende til at støvsuge bilen uden for huset, så hun sit snit til at stikke af. Nu har hun skrevet sin historie, og det er rystende læsning. Men det er også, på en bagvendt facon, opløftende læsning. Der er ingen tvivl om, at Natascha Kampusch er en uhyre begavet kvinde. Hendes beskrivelse af sine prøvelser er aldrig \"ulækre\" eller hadske, men til gengæld præget af en dyb trang til forståelse, dels af hvad det vil sige for et barn at blive frarøvet sin identitet på den måde, og dels af, hvad det var for et menneske, hun kom i kløerne på - og som var hendes eneste, absolut eneste, menneskelige kontakt mens hun voksede op. Ikke mindst beretningen om tiden efter hendes flugt er øjenåbnende læsning. Natascha Kampusch opførte sig aldrig som folk forventede af et \"offer\" - hun har hele tiden forsøgt på at være herre over sin egen historie og ikke lade sig udnytte, og hun har været kontroversiel i sine udtalelser om sin kidnapper og i sin insisteren på, at sandheden aldrig er sort og hvid. At læse Natascha Kampuschs beretning er en oplevelse, man ikke havde ventet. Den er en enestående personlig historie, men den er også en almengyldig beretning om de sider af den menneskelige natur, vi ikke har lyst til at se i øjnene. I menneskelig indsigt kan den måle sig med de største.",
  "genres": [
    "Nonfiction",
    "True Crime",
    "Biography",
    "Memoir",
    "Crime",
    "Biography Memoir",
    "Autobiography"
  ],
  "author": "Natascha Kampusch",
  "average_rating": "3.96",
  "url": "https://www.goodreads.com/book/show/11792651-3096-dage"
}