{
  "title": "Murder Most Horrid",
  "description": "Dip into the world of the Witches of Crystal Cove. A charming cozy mystery set in an idyllic small town off the coast of Maine. Mount Crystal Island is already shrouded in mystery and rumors of witches but now things are about to get really crazy. When this idyllic town is shaken to the core by a murder, Jane Summers and her two sisters must race against time to discover who the killer is before they strike again. That might be easy, if her childhood crush, Max Wayland hadn't returned to Crystal Cove and taken a position with the local Police Department and her father wasn't on her case about using spells in public. Now she must navigate her way around obstacles, mixed feelings, secrets, lies and twists before her friend is charged with the murder. She will need to use more than her charm, wits and sisters to solve this case. She's going to be forced to use a touch of magic.  Join secret witch and cafe store owner, Jane Summers and her sisters in the mysterious town of Crystal Cove. Every book contains great characters, lots of magic and an intriguing mystery.  Read all thirteen books in the Crystal Cove Mystery Series: Witches of Crystal Cove: Murder Most Horrid: Book 1 Witches of Crystal Cove: Murder Most Peculiar: Book 2 Witches of Crystal Cove: Murder Most Sudden: Book 3 Witches of Crystal Cove: Murder Most Foul: Book 4 Witches of Crystal Cove: Murder Most Twisted Book 5 Witches of Crystal Cove: Murder Most Odd: Book 6 Witches of Crystal Cove: Murder Most Mysterious: Book 7 Witches of Crystal Cove: Murder Most Ghastly: Book 8 Witches of Crystal Cove: Murder Most Frightful: Book 9 Witches of Crystal Cove: Murder Most Grim: Book 10 Witches of Crystal Cove: Murder Most Spiteful: Book 11 Witches of Crystal Cove: Murder Most Wicked: Book 12 Witches of Crystal Cove: Murder Most Devious: Book 13",
  "genres": [
    "Witches",
    "Cozy Mystery"
  ],
  "author": "Emma Watts",
  "average_rating": "3.81",
  "url": "https://www.goodreads.com/book/show/28507940-murder-most-horrid"
}