{
  "title": "Letting Go of the Person You Used to Be: Lessons on Change, Loss, and Spiritual Transformation",
  "description": "The beloved American Lama, a spiritual leader whose inimitable light and lively universal teaching style has awakened the spirituality of thousands, now shares an enlightened approach to change and loss, dealing with difficult emotions such as fear, grief, and anger, and the role of crisis in uncovering our authentic selves. For many people, recent years have been characterized by profound change, whether it relates to financial upheaval, political shifts, or even massive losses of life to disease and violence. Even on the personal level each person must confront the curves life throws his or her way. Buddhism has a great deal to say about change and impermanence and how to meaningfully deal with it. Change--whether on a large or small scale--provides our most important opportunity for learning about ourselves and the nature of reality. From this essential insight Lama Surya Das has crafted a fulfilling and important path to understanding and healing ourselves and finding peace. Full of personal stories, anecdotes, practical exercises, guided meditations and reflections, and pithy original aphorisms, Letting Go of the Person You Used to Be addresses life's most universal difficulties in a way that is accessible to all. By using memorable concepts such as The Virtues of Adversity, The Pearl Principle (\"No inner irritation, no pearl\"), and Gaining through Loss, Surya reminds readers that hiding from change and loss is futile. Learning to consciously accept and embrace change leads to a better understanding of ourselves and our own innate divine light. About The Author: About The Author: A voice of clarity in difficult times, Surya Das offers timeless wisdom in a timely message of hope helpful for us today and tomorrow. An authorized lama in the Dzogchen lineage of Tibet, SURYA DAS is a sought-after spiritual teacher and meditation master, poet, and spokesperson for the emerging American Buddhism. Founder of the Dzogchen Center, he is also the author of several pop",
  "genres": [
    "Buddhism",
    "Spirituality",
    "Nonfiction",
    "Self Help",
    "Psychology",
    "Religion",
    "Philosophy"
  ],
  "author": "Surya Das",
  "average_rating": "3.91",
  "url": "https://www.goodreads.com/book/show/285059.Letting_Go_of_the_Person_You_Used_to_Be"
}