{
  "title": "Lucky Dog Lessons: Train Your Dog in 7 Days",
  "description": "The celebrity dog trainer and Emmy-winning star of the CBS show Lucky Dog shares his training system to transform any dog—from spoiled purebred puppy to shelter-shocked rescue—into a model companion in just seven days.Each week on Lucky Dog, Brandon McMillan rescues an untrained, unwanted, \"unadoptable\" shelter dog. In the days that follow, these dogs undergo a miraculous transformation as they learn to trust McMillan, master his 7 Common Commands, and overcome their behavior problems—ultimately becoming well-mannered pets and even service dogs. With his labor of love complete, McMillan unites each dog with a forever family. Now, in his first book, McMillan shares the knowledge he has gained working with thousands of dogs of every breed and personality to help readers turn their own pets into well-trained Lucky Dog graduates.Lucky Dog Lessons begins with the basics—building trust, establishing focus and control, and mastering training techniques. From there, McMillan explains his playful, careful, and kind approach to training the 7 Common Commands he teaches every dog: SIT, STAY, DOWN, COME, OFF, HEEL, and NO. Next, McMillan provides solutions to common canine behavior problems, including house training issues, door dashing, chewing, barking, and common mealtime misbehaviors. Lucky Dog Lessons includes easy-to-follow steps, illustrative examples, tried-and-true tips and tricks, and photographs to demonstrate each technique. Throughout the book, McMillan shares inspiring stories about his favorite students and gives fans a behind-the-scenes look at the show and some of his most unique and challenging canine encounters, including some never-before-seen outtakes.Brandon McMillan believes that no dog is beyond saving, and the loving, positive, successful methods he offers will work wonders with even the most challenging dog. Create the happy pet family you want with Lucky Dog Lessons.",
  "genres": [
    "Nonfiction",
    "Dogs",
    "Animals",
    "Audiobook",
    "Self Help",
    "Reference",
    "Adult"
  ],
  "author": "Brandon McMillan",
  "average_rating": "4.22",
  "url": "https://www.goodreads.com/book/show/28512769-lucky-dog-lessons"
}