{
  "title": "Wake Me Up",
  "description": "\"If you enjoyed The Lovely Bones by Alice Sebold - you'll LOVE Wake Me Up by Justin Bog.\"--Melissa FlickingerA small college town's populace is tied, complicitly, to the brutal, bullying, attack of a teenage boy by four of his classmates. Soon, heated rumors of a possible hate crime surface. Injustice is a hungry beast.AN ADULTEROUS FATHER IS HAUNTED BY HIS PAST -- HIS WIFE LIVES HER LIFE IN A RIGID SHELL -- THEIR SON, UNTETHERED, DISCOVERS THE SECRET THEY SHARE WITH DEEPIKA, A VISITOR TO THEIR TOWN FROM NORTHERN INDIA.\"I see all of these people. They're living and breathing and acting on their basest impulses. I lay in a coma. They live. I hover over all of them, all at once. I can see my body, motionless, wired up, adrift. And I can find out why this happened. This is my story and I won't remember any of it when--if--I wake up. But I'll try to remember--I'll try damn hard.\"MIDDLETON, MONTANA --OCTOBER 2004--AN ELECTION YEARWhile Chris Bullet remains unresponsive in a coma, his skull shattered, he floats above dire circumstance. In this phantom state, compelled to witness his past once more, the family's darkest secrets, hidden over generations, will be aired.\"Although Justin Bog is a member of International Thriller Writers group and his new book Wake Me Up is a crime story in general, it's not an easy-going page-turner about catching and bringing criminals to justice . . . The story unfolds from a very unusual point-of-view: from the depth of Chris' coma, the narrator is Chris himself. This is an original approach to tell such a complex and intricate story!\"---Portland Book Review\"A Kafkaesque literary trip through the brain of a brutally assaulted teenage boy whose supercharged perceptions expose the secret sins of those he wants to love and hopes to believe in . . . The genius of author Justin's Bog's first full-length novel is that though everything Chris \"knows\" and recounts in his inner monologue is mysterious, maybe mystical, there is no hint of hocus-pocus, nor of the vague disjointed dream sequences one might expect from an unconscious protagonist . . . In the brief lead-up and denouement we see reality clearly: the attack and the aftermath. In between, everything that \"happens\" to Chris in his shut-off state is just as real and just as believable-but impossible. It would be hard to identify a literary precedent for this method of construction--Franz Kafka, perhaps, meets Lewis Carroll.\"---Chanticleer Book Reviews",
  "genres": [
    "Fiction"
  ],
  "author": "Justin Bog",
  "average_rating": "4.53",
  "url": "https://www.goodreads.com/book/show/28514046-wake-me-up"
}