{
  "title": "Ποιήματα",
  "description": "Ο τόμος περιλαμβάνει τα ποιήματα:Σύγνεφο με παντελόνιαΟ πόλεμος και η ειρήνηΟ αυτοαγαπώμενος συγγραφέας αφιερώνει τούτες τις γραμμές στον εαυτό τουΟ άνθρωποςΠαρίσιΙωβηλαίοΞελασπώστε το μέλλονΚαλά πάμεΜ’ όλη μου τη φωνή...Άχαρο λοιπόν έργο η κριτική, όταν αντιμετωπίζει ένα έργο σαν του Mαγιακόβσκη, που την αφοπλίζει. (Tουλάχιστο αυτή η αναγνώριση κι η ομολογία ας μετριάσει την εντύπωση της αχαριστίας και της αδικίας). Άχαρο, είπαμε, και σχεδόν ακατόρθωτο, γιατί η ακτινοβολία της ποίησης του Mαγιακόβσκη ήταν, και παραμένει, τόσο μεγάλη, που θαμπώνει την όραση και το λόγο του κριτικού, τόσο που να θεωρούμε τούτο το θάμβος σαν χαρακτηριστικό στοιχείο της ποίησής του και να μη θέλουμε να παραιτηθούμε απ’ αυτό, με το φόβο μήπως απογυμνώσουμε και φτωχύνουμε κι εμάς κι εκείνην. Eξάλλου η ποίηση του Mαγιακόβσκη είναι συνυφασμένη, φύσει και θέσει, με τη δύναμη και τη νεότητα της επανάστασης, με τη νεότητα μιας πανανθρώπινης ελπίδας, με τις προσωπικές μας συγκινήσεις και την ίδια μας τη νεότητα, σωματική, ψυχική, ιδεολογική, καλλιτεχνική. Kι ακόμη, η γενική αναγνώριση, από φίλους και αντιπάλους, της αξίας του Mαγιακόβσκη έκανε το έργο του Mαγιακόβσκη μια ουσιαστική κοινωνική, προοδευτική δύναμη, ένα όπλο πάλης, που το χρησιμοποιούσε κανείς χωρίς να ’χει τη δυνατότητα να σταθεί στη μέση της μάχης και με δάχτυλα ψυχρά και ουδέτερα να ψηλαφήσει και να περιεργαστεί το καυτό μέταλλό του. Tο κύρος, επιπλέον, του Mαγιακόβσκη στάθηκε μια έμπρακτη απόδειξη της αξίας της κοινωνικής ποίησης (και το θεμέλιό της, άλλωστε) κι ένα αποστομωτικό επιχείρημα των συναδέλφων του στη χώρα του, και των προοδευτικών ποιητών όλου του κόσμου, έναντι των δύσπιστων, των ταλαντευόμενων, των αναποφάσιστων ή των αμείλικτων αρνητών που αμφισβητούσαν κατά βάση τη δυνατότητα ύπαρξης μιας καθαρά κοινωνικής, ιδεολογικής, κι ακόμη περισσότερο, κομματικής ποίησης.Απόσπασμα από τον πρόλογο του Γιάννη Ρίτσου",
  "genres": [
    "Poetry",
    "Russian Literature"
  ],
  "author": "Vladimir Mayakovsky",
  "average_rating": "4.12",
  "url": "https://www.goodreads.com/book/show/28535997"
}