{
  "title": "Bound, Spanked and Loved: Fourteen Kinky Valentine's Day Stories",
  "description": "***14 ALL-NEW novellas! Available for a limited time only!***Bound, Spanked and Loved: Fourteen Kinky Valentine's Day Stories is the HOTTEST box set of the season, brought to you by fourteen New York Times, USA Today, and international bestselling authors of BDSM and spanking romance. Lose yourself in a whole lotta naughty with this sexy collection of ALL-NEW, standalone novellas sure to set your e-reader ablaze and leave you breathlessly panting for more.Publisher's Note: The stories included in this smoking hot collection are MF, MFM, and MMMF pairings. Some contain taboo subjects and no-holds barred BDSM and spanking scenes. All will make you blush hard. ***over 700 pages of brand new stories***From the Back CoverSlab Hands by Annabel Joseph ~ Christine's always been curious about spanking, and the bouncer at the bottom of the stairs has a magnificent set of hands. Once he learns about her secret disciplinary fantasies, he's more than happy to put those hands to use...Master Class: Initiation by Sierra Cartwright ~ When wanna-be sub Jennifer Berklee calls him Master and begs him to flog her, PI Logan Powell knows all his military training won't be enough to keep his jaded heart safe. He intends to claim this sexy, innocent woman for his own...no matter the cost.Theirs to Punish by Renee Rose ~ When a billionaire's daughter-turned-ninja picked Casino Magnifico for a heist, she didn't take into account one thing--actually--two. Twin owners Joe and Alex Jamison won't hesitate to employ a little corporal punishment to bring the virgin socialite in line...Lust Angel by Cari Silverwood ~ On good days, what falls from the heavens may be a naked woman. As an ex-SAS soldier, now private contractor, Adam is used to the unexpected, but nothing in life has prepared him for a fallen angel with a craving for spanking, bondage, and punishment.Stepbrother Jerk by Natasha Knight ~ To buy her stepbrother's silence, Lisa agrees to submit to his discipline, even though she has no idea what she's in for. But Jace knows exactly what his stepsister needs and a bare bottom spanking is only the beginning.His Runaway Valentine by Sue Lyndon ~ When a handsome stranger rides out of nowhere to rescue Nora from slavers, the runaway bride is shocked to learn he's the very man to whom she was betrothed. There's no escaping the arranged marriage now, and Luke is quick to make Nora understand that he expects not only obedience, but her absolute surrender.Rose's Are Red by Ashe Barker ~ Rose has had a crush on Iain McCain for years and when she spots her sexy ex-teacher with a whip in his hand at her favourite BDSM club her heart stills. Dare she approach him? A Valentine's Day card might earn her the spanking she craves if she delivers it personally...on her knees.His to Take by Kallista Dane ~ On the now-sexless, sterile Planet Earth, Dr. Selena Reston saves the life of Haldor, a Viking warrior from another world. His savage lovemaking shocks her and awakens her wild side. Though she craves his domination, can she build a life with him halfway across the galaxy?Stepping It Up by Cara Bristol ~ Ariel had crushed on her stepbrother Hunter for years. But if he expects to win back her heart in one wicked weekend, he'll have to step it up and take her in hand...the Rod and Cane Society way.Claiming Chloe by Korey Mae Johnson ~ When she is left alone on Valentine's Day, Chloe takes matters into her own hands. But going out exploring on her own on an alien planet turns out not to be the best idea she ever had, and when her three handsome alien mates end up having to rescue her, Chloe's bare bottom will pay the price for her naughtiness.Maud and the Secret Society of Saint Valentine by Emily Tilton ~ Maud has decided that the new boyfriend she's crazy about can't be serious when he tells her she needs a firm hand in the bedroom and everywhere else. The Secret Society of Saint Valentine begs to differ, and summons her to a tribunal where she'll learn just how serious David is.Dancing With a Dom by Katherine Deane ~ What do ballroom dancing, hard spankings, and mind-blowing orgasms have in common? I guess it depends who your dance partner is. The man smiling down at me, with his hand on my waist... he's a Dom. And he wants to be mine this Valentine's Day.Taking the Human by Trent Evans ~ For Lukanos, a muscle bound, seven foot tall alien, abducting the beautiful human female was the easy part. Winning her heart--and not breaking his own--was something else entirely.Sweet Birdie Blue by Alta Hensley ~ Rem Langston has no choice but to save the feisty Birdie Bluebell, whether she wants saving or not. Their icy beginning soon turns to a passion hot enough to melt the blizzard outside, but will Birdie accept Rem into her heart?",
  "genres": [
    "BDSM"
  ],
  "author": "Annabel Joseph",
  "average_rating": "4.10",
  "url": "https://www.goodreads.com/book/show/28529284-bound-spanked-and-loved"
}