{
  "title": "Closer to the Chest",
  "description": "New York Times-bestselling author Mercedes Lackey's Herald Spy series, set in the beloved fantasy world of ValdemarHerald Mags, the King of Valdemar’s Herald-Spy, has been developing a clandestine network of young informants who operate not only on the streets of the capital city of Haven, but also in the Great Halls and kitchens of the wealthy and highborn. In his own established alternate personas, Mags observes the Court and the alleys alike, quietly gathering information to keep Haven and the Kingdom safe.His wife Amily, is growing into her position as the King’s Own Herald, though she is irritated to encounter many who still consider her father, Herald Nikolas, to be the real King’s Own. Nonetheless, she finds it increasingly useful to be underestimated, for there are dark things stirring in the shadows of Haven and up on the Hill.Someone has discovered many secrets of the women of the Court and the Collegia—and is using those secrets to terrorize and bully them. Someone is targeting the religious houses of women, too, leaving behind destruction and obscene ravings.But who? Someone at the Court? A disgruntled Palace servant? One of the members of the Collegia? Someone in the patriarchal sect of the god Sethor? Could the villain be a woman? And what is this person hoping to achieve? It isn’t blackmail, for the letters demand nothing; the aim seems to be the victims’ panic and despair. But why?Mags and Amily take steps to minimize the damage while using both magic and wits to find the evildoer. But just as they appear to be on the verge of success, the letter-writer tires of terror and is now out for blood.Mags and Amily will have to track down someone who leaves few clues behind and thwart whatever plans have been set in motion, and quickly—before terror turns to murder.",
  "genres": [
    "Fantasy",
    "Fiction",
    "Magic",
    "Science Fiction Fantasy",
    "High Fantasy",
    "Young Adult",
    "Adventure"
  ],
  "author": "Mercedes Lackey",
  "average_rating": "4.17",
  "url": "https://www.goodreads.com/book/show/28534084-closer-to-the-chest"
}