{
  "title": "The Enchantment of Abigail Brown",
  "description": "The Enchantment of Abigail Brownby Mark WatersAbigail Brown is a smart girl: academically brilliant and bullied at school. Even at the tender age of almost thirteen, she knows there is more to this existence than following the daily grind. Walking home from school, after breaking up for the summer holidays, she comes across a fat tabby cat called Arnold, who, much to her surprise, introduces himself.This event is the catalyst that guides Abigail to return to the ‘real world’, a world in which she was born, a world in which she belongs, a world where she is princess and heir to the throne, a world that is completely unknown to her. Discovering a door in her father’s study, Abigail is joined by her faithful dog Apollo, her new companion Arnold and her best friend Tom. Together they travel into the realm of Nousidia; a land where nature lives in co-existence with all life: man, beast or dragon.Upon entering this world, Abby’s three companions experience an extraordinary change; each as remarkable as the next, and equally unique, returning to their true forms. Apollo becomes a tall, youthful soldier with long golden hair, Arnold a lumbering warrior, having the torso of a bear and the majestic head of a lion, and Tom aging tenfold into withered old man, his true age becoming only too apparent.Abby finds her homeland in the grip of an evil tyrant, her aunt Belladora, who is holding her father, the true king, prisoner. She vows to release him and embarks on an adventure into the real world: the world of Nousidia. They travel across the kingdom, reuniting with friends, family and places long forgotten, discovering the true nature of the planet we call Earth.Along this journey the slumbering power of natural magic awakens inside her, allowing communication with all in her kingdom, and with it the strength to unite them against their common foe. With this magic comes the quickening, a state in which one becomes of age: a process that takes Abby quite by surprise, as she finds herself suddenly in womanhood.Abby discovers that this is the real world; the human perception being created by ancient magic to contain those who renounce the ways of nature, allowing a fragile balance between good and evil. It is an imbalance in this status quo that has allowed the seasons to change: the daylight hours of summer, the time of good, shortening, whilst the time of evil, the winter of night, has gained strength, the interim period, known as dusk, when both are present, becoming an all consuming battle for supremacy.Abby’s return to Nousidia generates unrest amongst the outcast tribes, bringing rebellion to the witch Belladora’s door, and uniting the lost people once more. The ancient battle between good and evil is rekindled, bringing war to Nousidia: a war in which neither side can truly conquer: an uprising that produces an unexpected hero.The Enchantment of Abigail Brown is a journey into the real world; a journey of discovery, myth and magic, a journey most only dream of …",
  "genres": [],
  "author": "Mark Waters",
  "average_rating": "4.20",
  "url": "https://www.goodreads.com/book/show/11795817-the-enchantment-of-abigail-brown"
}