{
  "title": "Snatched",
  "description": "What would you do if you discovered a dead body? Would you investigate? Try to solve the case before the police arrive?  Would you prattle on about theories regarding the murder, realizing you know almost too much about it? Would you put the handsome detective off balance so that he then accuses you of being the murderer? All before 9AM? No… surely no one would do that?  Clearly, you haven’t met Diana Hunter.  When embarking on an early morning run, Diana notices a man sitting on the ground reading a book. When she returns, she finds he hasn’t moved a muscle since she left her house. She checks him over and discovers that he is stone cold. Once the emergency services arrive, all equipped with a very good-looking, but pompous detective, Peter Hopkinson, she has to continually prove to the detective why she is not the killer while trying to solve the murder herself.  Will Diana find the murderer before the detective does, or will they both discover that something a lot more sinister is going on at Royal Bay Beach?   Interview with the Author of the Series  Q - So, what makes the Diana Hunter series special?  A - When I set out to write these books, I wanted to create something that mirrored exactly the kind of books I like to read. My top picks are always mystery novels, especially featuring female protagonists with attitude. Diana is badass and I can’t tell you how many readers tell me she reminds them of themselves. She makes you feel you can do anything!  The Diana Hunter books are a great mix of genres. There is nothing graphic or gratuitous in these books. Your Aunt Martha could definitely read them. But they are not “roses around the cottage door” –type mysteries. They are more hard-boiled with some romantic tension, suspense and thriller action to keep things interesting!  Overall, the Diana Hunter series is designed to keep you turning the pages - and I've made sure there's never a dull moment.  Q - In what order should I read the books?  A - The Diana Hunter mysteries can be read and enjoyed in any order, however, Hunted is a prequel to the other books in the series. Unlike the other books, it is not a complete mystery. It relates the events that create the backdrop to the series and fills in some of Diana’s personality and motivations. You don’t have to have read the prequel to make sense of the later books but it helps.  I’ve made sure not to include any spoilers for those who are new to the characters and any existing fans of Diana’s adventures will still find plenty of fresh action and mystery as well as perhaps a few answers. All in all, there is something for everyone. The events in this prequel take place a few years before Snatched, the first book in the Diana Hunter series of mysteries.  If you do want to read them in order, I'd suggest the following sequence:  - Hunted (prequel) - Snatched - Stolen - Chopped  Q - So, why should readers give these books a try?  A - Because the Diana Hunter series is a fast, fun, thrill-ride that takes no prisoners! Our heroine is kicks butt but has a soft center. We want her to win out even when she’s making poor decisions and alienating those who can, and want, to help her. I think most women will see a little, or a lot, of themselves in Diana Hunter.  Ultimately, readers who enjoy lightning-fast pacing with a plot that twists and turns all the way to the end will get a kick out of this series.",
  "genres": [
    "Mystery",
    "Amazon",
    "Mystery Thriller",
    "Thriller",
    "Fiction",
    "Suspense"
  ],
  "author": "Alison Golden",
  "average_rating": "3.93",
  "url": "https://www.goodreads.com/book/show/28534228-snatched"
}