{
  "title": "Not a Self-Help Book: The Misadventures of Marty Wu",
  "description": "Fiction. Asian & Asian American Studies. Semi-Finalist, Thurber Prize for American Humor. Marty Wu, compulsive reader of advice manuals, would love to come across as a poised young advertising professional. Instead she trips over her own feet and blurts out inappropriate comments. The bulk of her brain matter, she decides, consists of gerbils \"spinning madly in alternating directions.\" Marty hopes to someday open a boutique costume shop, but it's hard to keep focused on her dream. First comes a spectacular career meltdown that sends her ricocheting between the stress of New York and the warmth of supportive relatives in Taiwan. Then she faces one domestic drama after another, with a formidable mother who's impossible to please, an annoyingly successful and well- adjusted brother, and surprising family secrets that pop up just when she doesn't want to deal with them. Mining the comedic potential of the 1.5-generation American experience, NOT A SELF-HELP BOOK is an insightful and witty portrait of a young woman scrambling to balance familial expectations and her own creative dreams. \"A breezy and charming tale ... Anyone who's grown up immersed in a profoundly rich old-world culture and feels its constant pull will commiserate--and be entertained.\"--Cheryl Lu-Lien Tan, author of A Tiger in the Kitchen: A Memoir of Food and Family \"Marty is a wonderful character who learns to stand up for herself and discovers what she really wants in life.\"--Booklist \"An expert combination of humor and deep feeling... Digs deep into the particular challenges of defining and asserting an artistic identity in the world.\"--PANK Magazine \"Ceaselessly surprising and entertaining... Lai's debut is an unexpectedly radical book on our deeply complicated relations with parents.\"--Hyphen Magazine: Asian America Unabridged",
  "genres": [
    "Fiction",
    "Humor"
  ],
  "author": "Yi Shun  Lai",
  "average_rating": "4.01",
  "url": "https://www.goodreads.com/book/show/28562611-not-a-self-help-book"
}