{
  "title": "Una And Her Paupers: Memorials of Agnes Elizabeth Jones",
  "description": "The biography of the woman who became the first trained Nurse Superintendent of Liverpool Workhouse Infirmary, and who died at the tender age of 35 from typhus fever (probably contracted as a result of overwork). Florence Nightingale said of Agnes Elizabeth Jones, 'She overworked because others underwork … I looked upon hers as one of the most valuable lives in England in the present state of the Poor Law and of Workhouse nursing..' From the age of seven, Agnes longed to be a missionary. As she grew older, her heart beat with working among the poor. 'Oh, for a heart burning with love for Jesus...to shine in His reflected light as to attract some to Him, and not repel them from Him!' Her desire was offering practical help along with words of spiritual comfort, Agnes became renowned amongst the poor of her native Northern Ireland. People were coming many miles across the mountains to Agnes for medical care. Wishing to become more useful to 'her poor,' Agnes attendedKaiserswerth in Germany, the very same Nurse's training school as Florence Nightingale had attended some years before her. Miss Nightingale on hearing of Agnes' skill and dedication, requested her to Superintend an English hospital for the poor. Agnes, however, humbly felt she needed to learn more, and gain more life and leadership experience before taking this proffered position. After a brief spell working as a 'Bible-woman' evangelist in the East End of London, Agnes entered St. Thomas's Hospital as a Nightingale probationer for one year's further nurse training. Then followed a short period as superintendent of a small hospital in Bolsover Street, and then at the Great Northern Hospital. In 1865, Agnes took charge of the Liverpool Workhouse Infirmary and its 1350 patients. She took with her twelve other Nightingale nurses; and over her three years in Liverpool she trained up many other nurses. She successfully turned a disorganized and unruly institution into something that was so disciplined, even the police were amazed. She had to manage and persuade the patients to sleep three and four in two beds; sometimes eight children had to be put in one bed . Nurse Agnes was loved and respected by staff and patients alike with a unique love that shone through her every action. When she died, prostitutes, hardened criminals, orphans, politicians, clergymen and the Poor Law Board alike wept for England and Ireland's great loss.",
  "genres": [],
  "author": "Anonymous",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/2855980-una-and-her-paupers"
}