{
  "title": "The Centurion",
  "description": "The Centurions, warriors who know no equal in all of Ares live for the chance to fight in great battles and prove their worth through blood and slaughter. Cursed to live not one day past the age of forty, the cruelties of life has taught these perfect soldiers to live without regrets or concern for tomorrow, and to live each moment with untamable passion. Out of all the people in Ares only one race has the power to leash the hearts of these pinnacle fighters and that is the gentle hand of men called Legatio who, cursed themselves, long ago turned their backs to the love offered them by their warrior cousins. All but one that is, Jason, Argot, rightful ruler of the Kingdom of Qul Tos, was born outside the bounders of the Centurion's Empire, Domus. While kept prisoner by his mother, the Queen Regent, he has grown into manhood without being raised by his fellow Legatio, lacking the hatred and prejudices his people have toward their Centurion protectors. In fact Jason has no knowledge of any man, living a life of naive innocence in a tower high in the mountains, the path protected by a deadly maze called the Labyrinth. Jason does know one thing however. Above everything he could ever wish for it is love he desires above all else. With legions of Centurions coming to rescue this one young man from the cruelties of his mother neither Jason not his Centurion rescuers know that the path they will walk together is the one foretold in legends and prophecies, a time of great turmoil and love.##Born in 1976 in Kansas City, Kansas, James Higuchi was the middle son born into a family with a rich history in academia. Soon after being born the family moved down south to the wonderful city of San Antonio. Growing up, and much to his mother's disappointment, he became to be a fan of science fiction and fantasy with writers such a J.R.R Tolkien, Isaac Asimov, C.S. Lewis, and Stephen R. Donaldson among his favorites. Before leaving for summer camp he would make sure to take his favorite books with them or make sure they were well hidden while his mother used his absence \"to make shelf space.\" On graduating from high school he was faced with the choice of either Boston College or Baylor University. This proved to be a critical decision on his part for by picking the conservative Baylor he ensured he would live the next four years buried in the closest.#",
  "genres": [
    "Fantasy"
  ],
  "author": "James Higuchi",
  "average_rating": "3.47",
  "url": "https://www.goodreads.com/book/show/2855363-the-centurion"
}