{
  "title": "Bin Laden's Bald Spot & Other Stories",
  "description": "Welcome to the peculiar and headlong world of Brian Doyle’s fiction, where the odd is happening all the time, reported upon by characters of every sort and stripe. Swirling voices and skeins of story, laughter and rage, ferocious attention to detail and sweeping nuttiness, tears and chortling—these stories will remind readers of the late giant David Foster Wallace, in their straightforward accounts of anything-but-straightforward events; of modern short story pioneer Raymond Carver, a bit, in their blunt, unadorned dialogue; and of Julia Whitty, a bit, in their willingness to believe what is happening, even if it absolutely shouldn’t be. Funny, piercing, unique, memorable, this is a collection of stories readers will find nearly impossible to forget:... The barber who shaves the heads of the thugs in Bin Laden’s cave tells cheerful stories of life with the preening video-obsessed leader, who has a bald spot shaped just like Iceland.... A husband gathers all of his wife’s previous boyfriends for a long day on a winery-touring bus.... A teenage boy drives off into the sunset with his troubled sister’s small daughters…and the loser husband locked in the trunk of the car.... The late Joseph Kennedy pours out his heart to a golf-course bartender moments before the stroke that silenced him forever.… A man digging in his garden finds a brand-new baby boy, still alive, and has a chat with the teenage neighbor girl whose son it is.... A man born on a Greyhound bus eventually buys the entire Greyhound Bus Company and revolutionizes Western civilization.... A mountainous bishop dies and the counting of the various keys to his house turns… tense.... A man discovers his wife having an affair, takes up running to grapple with his emotions, and discovers everyone else on the road is a cuckold too.And many others.",
  "genres": [
    "Short Stories",
    "Fiction",
    "Literature"
  ],
  "author": "Brian  Doyle",
  "average_rating": "4.03",
  "url": "https://www.goodreads.com/book/show/11796291-bin-laden-s-bald-spot-other-stories"
}