{
  "title": "The Merry Millionaire",
  "description": "The Thirties, a decade of decadence and depression, ending in war. This hardly has an effect on Ron and Mervyn, our intrepid pleasure seekers. Disregarding the rumblings of war in Europe, and dancing to a dying tune, they join the waning fast-set, cruising the Norwegian fjords on luxury ocean liners and sailing up the Nile on serene feluccas. Explore the bygone age of first class sea travel and luxury oriental hotels, summer on the glaciers, and the heat of Cairo’s social season. All seen through the eyes of Ron and Mervyn, the gayest pair of lotus-eaters you will ever encounter. J.A.Wells has succeeded in painting a dense, yet frivolous view, of a time now lost to the journals of debutants and dowager duchesses. In the first of his duology, J.A.Wells uses his rich imagination, creating a colourful cast of living and breathing characters. We will wonder what may become of the pairing of Ron and Mervyn, poles apart in age and class, yet similar in inclination.Author’s In most circumstances, at this point the author writes a disclaimer declaring that his or her characters bear no resemblance to people living or dead. However, in this case, most of the persons you will encounter in the story, once lived, but their names have been changed for reasons of expediency. I hope that by including them in this work of fiction I have given them the justice they deserve and have not sullied their reputations in any way. Throughout this fictional memoir of a millionaire, using the voice of Captain Ronald Fry, ex army captain, scout master, philanthropist and benefactor, I tell how it was to be gay in the 1930’s, when homosexuality was against the law and punishable with years of hard labour. To show one’s true feelings, one ran the risk of blackmailers, entrapment, robbery, violence, and even murder.",
  "genres": [],
  "author": "J.A. Wells",
  "average_rating": "3.71",
  "url": "https://www.goodreads.com/book/show/28543298-the-merry-millionaire"
}