{
  "title": "The Mammoth Book of Vampire Romance",
  "description": "The biggest names in paranormal romance have created a fascinating array of 30 short stories of hot blood and inhuman passions that will leave you thirsting for more. Authors include Sherri Erwin, Caitlin R. Kiernan, Jenna Black, Jenna Maclaine, Raven Hart, Delilah Devlin, Keri Arthur, Kimberly Raye, Alexis Morgan, Lilith Saintcrow, C.T. Adams, Cathy Clamp, Susan Sizemore, Dina James, Colleen Gleason, Barbara Emrys, Savannah Russe, Shiloh Walker, Vicki Pettersson, Rebecca York, Rachel Vincent, Amanda Ashley, Karen Chance, and Nancy Holder. These ain’t your mother’s vampires!*** \"Fade to Black\" - Sherri Erwin - A professor's tryst with a gorgeous student brings a whole new meaning to `unsafe sex' when he infects her with the `vampire' virus.*** \"Ode to Evdard Munch\" - Caitlin Kiernan - A man shares his blood with a mysterious vamp for a piece of her dreams.*** \"Fangs for Hire\" - Jenna Black - When a vampire hit woman finds her oh so sexy prey is not what he seems, she just might have to consider rewritting her `contract'.*** \"The Righteous\" - Jenna Maclaine - A sorceress and a King put events in play to establish a group of vampires to police their own, which is the catalyst to bring a vampire and a woman who stakes them together in Paris.*** \"Knowledge of Evil\" - Raven Hart - An ancient vampire with a passion for learning meets a gorgeous professor who shares his thirst for knowledge.*** \"Viper's Bite\" - Delilah Devlin - A solitary vampire and a lonely woman connect but he must steal her memories to keep her safe.*** \"Dreams\" - Keri Arthur - Arthur's Riley Jensen and her sometimes lover vampire Quinn share dreams and danger.*** \"Love Bites\" - Kimberly Raye - From her Dead End Dating world, a hereditary vampire slayer flunks her final test when instead of finishing off the vampire she's staked she takes him her home to heal.*** \"What's at Stake\" - Alexis Morgan - A legal enforcer must either prove the innocence of the vampire she's secretly loved or she must put him to death.*** \"Coming Home\" - Lilith Saintcrow - Dante Valentine's foster daughter Liana is hired by the Nichtvahren who broke her teenage heart to kill his maker.*** \"To Ease the Rage\" - CT Adams & Cathy Clamp - A police officer will join with her undead partner to find the strength to protect her city from vamps that threaten the peace.*** \"Dancing with the Star\" - Susan Sizemore - A vampire's dreams of a dancing movie star may signal the end of her loneliness.*** \"Play Dead\" - Dina James - A vampire finds his soulmate and challenges the leaders of his clan for the right to choose his own bride.*** \"In Which a Masquerade Ball Unmasks an Undead\" - Colleen Gleason - Gleason's vampire hunting debutante Victoria tries to persue her attraction to Rockley while fighting off vamps at a masquerade ball with a little help and snide remarks from Max. *** \"A Temporary Vampire\" - Barbara Emrys - A vampire discovers a captivating `vampire' actress in New Orleans.*** \"Overbite\" - Savannah Russe - A vampire patient gives a dentist a chance to expand his practice to the undead and to pursue his secret fantasies.*** \"Hunter's Choice\" - Shiloh Walker - Seems like a spinoff from her series the leading man is a vampire and a 'hunter'. A grieving/vengeful woman turned vamp-slayer must reexamine her beliefs about vamps to keep the star of her passionate dreams when they meet again.*** \"The Sacrifice\" - Rebecca York - A princess becomes a willing sacrifice to a `monster' to save her father's kingdom under seige and gains not only her kingdom's freedom but her own salvation.*** \"Remember the Blood\" - Vicki Petterson - Two vampires are reborn without memories each year but strive to bring forward clues to `remember' each other and their love.*** \"The Midday Mangler Meets his Match\" - Rachel Vincent - An ordinary everyday vampire teen and her younger sister discover a use for their vestigal fangs when they have a run in with a killer.*** \"The Music of the Night\" - Amanda Ashley - A phantom of the opera obssesed woman gets a chance to star in her favorite fantasy when she meets her own phantom.*** \"The Day of the Dead\" - Karen Chance - From the Cassandra Palmer series, vampire Thomas seeks to rid the world of his evil former master and to aide a magical mercenary with a forbidden power to save her missing brother from the evil vamps yearly human hunt.*** \"Vampire Unchained\" - Nancy Holder - A return to Holder's House of the Blood/Shadows/Flame/Phoenix world. Vampire Liam's secret negotiations with the House of Phoenix cause him to be accused of treason against his clan, his punishment is imprisonment with his human lover as the only source of blood, but their love holds the key that may free them.*** \"A Stand-up Dame\" - Lilith Saintcrow - A soft touch for a dame in danger, this PI returns from the dead to solve his case.*** \"Untitled 12\" - Cailtlin R. Kiernan - A sick woman searches until a vampire finds her.",
  "genres": [
    "Anthologies",
    "Fantasy",
    "Urban Fantasy",
    "Adult",
    "Paranormal Romance",
    "Fiction",
    "Collections"
  ],
  "author": "Trisha Telep",
  "average_rating": "3.57",
  "url": "https://www.goodreads.com/book/show/2855252-the-mammoth-book-of-vampire-romance"
}