{
  "title": "Savage Highway",
  "description": "Women are disappearing on the highway, a drifter hunts the men who raped her, and a journalist discovers law has broken down in the area.On a remote highway in Arizona women are disappearing at truck stops. Journalist Johnny Sullivan travels to the area to investigate. He encounters hitchhiker Patty, who is being hunted by violent trucker Red. Patty tells Johnny of the local myth of the maniac trucker. Johnny also meets Valentino de La Cruz, a mysterious Mexican who is looking for his missing sister. Valentino is having an affair with Natasha, the wife of recently murdered businessman, Theodore Mills, whose wealth funds the corrupt police force in the area. The local Highway Patrol is run by sexually sadistic Sam Roche and Franklin Norman and they want to put an end to Johnny’s snooping. Marshall Simmons knows a lot about the goings on in the area, and has a young woman captive in a house. He is reprogramming her identity. Meanwhile Johnny discovers that years previously serial killer Donald Lake disappeared in the area while in transit between prisons. And it seems he had police help. But what is being done to the women? And who is running the criminal organisation that controls the area? Savage Highways is about lawlessness and the hunt for justice in a no man’s land. Pedal to the floor all the way, the narrative speeds towards its stunning and unforeseeable conclusion.\"The road novel from hell ... a surrealist inferno that makes Dante's version look like a Rotary breakfast.\" -- Castle Freeman Jr., author of THE DEVIL IN THE VALLEY\"Exceptional writer ... crackling dialogue ... dazzling. Read him.\" -- Luke Rhinehart, author of bestselling The Dice Man\"One of those irresistible hard-boiled reads that’s reminiscent of old school black and white noir. ... A riveting story, this is classic Godwin.\" -- Vincent Zandri, New York Times and USA Today Bestselling Author of Orchard Grove.",
  "genres": [
    "Fiction",
    "True Crime",
    "Thriller"
  ],
  "author": "Richard Godwin",
  "average_rating": "4.34",
  "url": "https://www.goodreads.com/book/show/28544021-savage-highway"
}