{
  "title": "The Politics of Change in Georgia: A Political Biography of Ellis Arnall",
  "description": "This biography of Ellis Arnall follows the life and political career of the former governor from his rural Georgia upbringing through his service as state representative, attorney general, and governor to his subsequent political exile.Arnall assumed the governorship of Georgia in 1943, becoming the youngest person in the United States ever elected to that position. In his single term (1943-1947) he initiated a series of remarkable reforms that elevated Georgia above its Tobacco Road image and stood it alongside North Carolina, then the South's most progressive state. Unlike most of his colleagues, Arnall refused to \"play it safe\" in the state's political arena. Though still a segregationist and a traditionalist in many ways, Arnall had no patience for provincialism and cared deeply about Georgia and how it was viewed by the rest of the nation. Boldly confronting the demagoguery of his predecessor Eugene Talmadge, Arnall, who called himself \"a democrat with a small 'd',\" united the state's liberal and conservative factions to deliver the promise of the New South to all of Georgia's biracial voting, government reform, economic development, and an improved standard of living.So sweeping and farsighted were Arnall's accomplishments that, to a great extent, the structure of Georgia's present-day government evolved under his guidance and has changed little since. In 1985, a Georgia Association of Historians survey ranked Arnall's leadership, responsiveness to issues, and national reputation the highest among governors who served from 1943-1983. Successful as it was, his career, begun a decade earlier in the state house of representatives, was cut short. Many Georgians felt that Arnall was too liberal and, worse, that he had catered to the national media, enhancing his own image by discussing the state's problems with outsiders. By Arnall's own estimation, his political career ended when he decided to abide by a 1945 federal court decision that invalidated Georgia's white-voters-only primary elections. Arnall left politics in 1947, returning briefly in 1966 for a spirited, but unsuccessful, primary bid for governor.Written with Ellis Arnall's full cooperation and filled with fascinating details of the final days of Old South politics, this book recounts the political career of one of the region's most accomplished and energetic leaders. The Politics of Change in Georgia is based on the former governor's speeches and public writings, critical and supportive newspapers accounts, and interviews both with Arnall and with other prominent Georgians such as Herman E. Talmadge, S. Ernest Vandiver, Jr., Lester G. Maddox, Carl E. Sanders, Jr., James H. Gray, Sr., Howard H. Callaway, and Ivan Allen, Jr.",
  "genres": [
    "History",
    "Biography"
  ],
  "author": "Harold Paulk Henderson",
  "average_rating": "4.13",
  "url": "https://www.goodreads.com/book/show/2856413-the-politics-of-change-in-georgia"
}