{
  "title": "Western Palaces",
  "description": "Family. The ties that bind. The veins that fuse. The blood that spills. Picking up where ENJOY ME left off, WESTERN PALACES returns us, kicking and screaming, to Luke’s world of zombies, bipedal crickets, ghosts, and debilitating fear. All on the streets of San Francisco, where storm drains back up with body parts and giant balls of intestines patrol the hills. But that’s just fine because Luke’s longtime obsession, Cameron, has finally accepted him. She and her son offer Luke the family he always wanted. But something isn’t right. Something is never right. It could have something to do with the body in the closet. Who knows. Friendless, jobless, and always ready to vomit, Luke is just beginning to learn to trust when he recognizes there isn’t a solitary thing worth trusting in his world. And just when he was discovering his softer side. In WESTERN PALACES, Luke is ever-desperate to find his place in the world. He’s getting to the point, though, where a simple acknowledgment of his existence would suffice. Luke is a man-child that just wants to be a boy, a real boy. Unfortunately, he may just discover his worst fears aren’t even close—this roller coaster is always going to veer way off into the darkest part of the ether. And you’re welcome to join Luke, puking and laughing the whole livelong way. WESTERN PALACES, like ENJOY ME, is a collection of linked stories, telling the horrific, surreal, bizarre, and often hilarious tales of Luke, a down and out writer just trying to get by while stewing in his own misanthropy, loneliness, and self-loathing. Thirteen stories comprise this sequel, including Molotov Cocktails, Everything Is Going To Be OK, Serene Moments, Picture This, Last Call, Christmas In Tenderloin, We Have Breadsticks, The Gift, San Francisco Beached, Glass Eye, Not Syd, Funereal, and Western Palaces.",
  "genres": [
    "Fiction",
    "Horror",
    "Science Fiction"
  ],
  "author": "Logan Ryan Smith",
  "average_rating": "4.41",
  "url": "https://www.goodreads.com/book/show/28577418-western-palaces"
}