{
  "title": "By the Numbers",
  "description": "Jen and Jack’s marriage is magical — in more ways than one  But that doesn't mean that something isn't missing When they were young, Jack and Jen fought and won a war, and came out heroes. Then they got married, got jobs, raised kids, and lived, for the most part, happily ever after.But Jen’s childhood best friend has been missing for nearly twenty years, and Jen’s beginning to give up hope.A game of very adult let’s-pretend leads to a discovery that is very magical indeed, but that could destroy Jen’s life.Or could lift it to a whole new plane.What happens when rediscovering your youth leads to discovering new about yourself?(Novel-length contemporary fantasy ménage, FFM threesome) Extract:  \n  She rolled swiftly on top of him and stared down. “One more year.”  He peered up at her quizzically.  “If she hasn’t turned up by her birthday, next Halloween,” — her fortieth — “if there isn’t some new clue to where she is, we can put the house on the market. And… And put up a headstone for her. One more year.”  Jack smiled and caressed her ear with his thumb. “You still miss her, I know.”  Jen nodded. It was hard to explain — Bridgid and Jen had known each other since Brigid’s family moved to Elysium, but when they had all woken up from the nightmare of their twelfth-grade year at the Mountain, it had been Bridgid who had held Jen together. As much as Jack had saved Jen — had become her lover, and so much more — Bridgid was the one who brought her back to the land of the living. How could anyone so lonely be so loving and lovely? “She was wonderful. She is.”  Jack’s grin broadened. “She was. She is.” He pushed up onto one elbow and kissed her, and for a few minutes, Jen felt very young, and very alive, and very whole.  After some time, Jen leaned up from him, grinning herself down at her husband who was looking very self-satisfied there on the lacy bedspread, embroidered unicorns and phoenixes, eagles and dragons gamboling around his head. “You look pleased with yourself, Phalen.”  “Well,” Jack answered, “who wouldn’t, getting to look up at a sight as beautiful as you?”  “Flatterer,” she laughed, pleased. “Want to see more?” Before he could answer or she could stop herself, she pulled the tattered racing jersey she wore for cleaning over her head.",
  "genres": [
    "Erotica",
    "Menage"
  ],
  "author": "K.D. West",
  "average_rating": "3.59",
  "url": "https://www.goodreads.com/book/show/28567303-by-the-numbers"
}