{
  "title": "Nimravid",
  "description": "It's Harry Potter meets T-1000 in a game of cat and mouse, with a very BIG cat. What do you get the 6’ 6” mercenary with wizard class powers and an axe to grind? The Hell out of his way… Our story begins when anti-hero Mack, is targeted by a cadre of local St. Louis vampires, one, a clan elder. Outnumbered and still raw after the brutal murder of a young girl he was hired to rescue, Mack’s in no mood to play. After a pitched battle, things go very badly… for the vampires. A string of unsolved murders and a couple angry demons later, things really start to get messy. Nimravid is the story Alexander Macfade Yoshida a half human, half extra-dimensional saber-tooth with extraordinary abilities and a nasty temper. Life could never be considered easy for Mack, a magic wielding sword for hire, especially in modern times. Being St. Louis’ only half human/half Nimravid, (an Ancient race of cat-like humanoids) a notorious head cracker and a “person of interest” to local authorities, all create their own set of challenges. Now throw in a past in the Yakuza, one beautiful district attorney, a tiny precocious teenage girl and sprinkle generously with assassination attempts by supernatural powerhouses. All this put together and it makes Mack’s life pretty interesting—and grows his list of enemies. Contract work is supposed to be simple. You take a contract; do what is asked of you and you get paid, right? Wrong—some contracts are the gifts that keep on giving. The only child of a local mobster has been abducted and Mac is the only man who can find her, with the help of an adolescent ghost and a powerful sorceress who shares his consciousness, known simply as M.A.I. So how did Mac end up enraging the local clan of vampires and getting roped into tracking down a racist serial killer, only to have the whole shebang reveal a hideous secret from his past to everyone he loves? When you figure it out, let him know. He lived through everything it, and still has no idea how he survived. Nimravid is an action packed thrill ride that takes each curve of the track with a panorama of diverse antagonists, heartwarming moments and humor. It tells the story, in vivid detail, of what happens when a clan of vampires and pair of demons crosses the wrong superhuman badass.",
  "genres": [
    "Fantasy"
  ],
  "author": "D.L. Greeley",
  "average_rating": "4.10",
  "url": "https://www.goodreads.com/book/show/28572804-nimravid"
}