{
  "title": "The Fourth Industrial Revolution",
  "description": "World-renowned economist Klaus Schwab, Founder and Executive Chairman of the World Economic Forum, explains that we have an opportunity to shape the fourth industrial revolu­tion, which will fundamentally alter how we live and work.Schwab argues that this revolution is different in scale, scope and complexity from any that have come before. Characterized by a range of new technologies that are fusing the physical, digital and biological worlds, the developments are affecting all disciplines, economies, industries and governments, and even challenging ideas about what it means to be human.Artificial intelligence is already all around us, from supercomputers, drones and virtual assistants to 3D printing, DNA sequencing, smart thermostats, wear­able sensors and microchips smaller than a grain of sand. But this is just the beginning: nanomaterials 200 times stronger than steel and a million times thinner than a strand of hair and the first transplant of a 3D printed liver are already in development. Imagine “smart factories” in which global systems of manu­facturing are coordinated virtually, or implantable mobile phones made of biosynthetic materials.The fourth industrial revolution, says Schwab, is more significant, and its ramifications more profound, than in any prior period of human history. He outlines the key technologies driving this revolution and discusses the major impacts expected on government, business, civil society and individu­als. Schwab also offers bold ideas on how to harness these changes and shape a better future—one in which technology empowers people rather than replaces them; progress serves society rather than disrupts it; and in which innovators respect moral and ethical boundaries rather than cross them. We all have the opportunity to contribute to developing new frame­works that advance progress.",
  "genres": [
    "Business",
    "Nonfiction",
    "Economics",
    "Technology",
    "Science",
    "Politics",
    "History"
  ],
  "author": "Klaus Schwab",
  "average_rating": "3.58",
  "url": "https://www.goodreads.com/book/show/28570175-the-fourth-industrial-revolution"
}