{
  "title": "The Abstract Wild",
  "description": "If anything is endangered in America it is our experience of wild nature—gross contact. There is knowledge only the wild can give us, knowledge specific to it, knowledge specific to the experience of it. These are its gifts to us.How wild is wilderness and how wild are our experiences in it, asks Jack Turner in the pages of The Abstract Wild . His not very wild. National parks and even so-called wilderness areas fall far short of offering the primal, mystic connection possible in wild places. And this is so, Turner avows, because any managed land, never mind what it's called, ceases to be wild. Moreover, what little wildness we have left is fast being destroyed by the very systems designed to preserve it.Natural resource managers, conservation biologists, environmental economists, park rangers, zoo directors, and environmental Turner's new book takes aim at these and all others who labor in the name of preservation. He argues for a new conservation ethic that focuses less on preserving things and more on preserving process and \"leaving things be.\" He takes off after zoos and wilderness tourism with a vengeance, and he cautions us to resist language that calls a tree \"a resource\" and wilderness \"a management unit.\"Eloquent and fast-paced, The Abstract Wild takes a long view to ask whether ecosystem management isn't \"a bit of a sham\" and the control of grizzlies and wolves \"at best a travesty.\" Next, the author might bring his readers up-close for a look at pelicans, mountain lions, or Shamu the whale. From whatever angle, Turner stirs into his arguments the words of dozens of other American writers including Thoreau, Hemingway, Faulkner, and environmentalist Doug Peacock.We hunger for a kind of experience deep enough to change our selves, our form of life, writes Turner. Readers who take his words to heart will find, if not their selves, their perspectives on the natural world recast in ways that are hard to ignore and harder to forget.",
  "genres": [
    "Nature",
    "Nonfiction",
    "Ecology",
    "Philosophy",
    "Science",
    "Essays",
    "Environment"
  ],
  "author": "Jack Turner",
  "average_rating": "4.30",
  "url": "https://www.goodreads.com/book/show/285741.The_Abstract_Wild"
}