{
  "title": "Taken by the Admiral",
  "description": "Since she was a child, Lia has longed to be free from the confines of the great worldship which has been the last refuge of the human race for generations, but being snatched from the only home she has ever known by aliens was not exactly what she had in mind. When she learns that the admiral of the alien fleet plans to claim her as his mate—regardless of her thoughts on the matter—her surprise turns to fury.The huge and intimidating yet undeniably handsome admiral is unmoved by her protests, however, and her defiance merely earns her a trip over his knee for a sound spanking on her bare bottom. To make matters worse, the painful, embarrassing chastisement brings about a helpless, shameful arousal unlike anything she has ever felt before.Having grown up in a society which abandoned sexual contact as a means of procreation long ago, Lia is deeply humiliated by the intimate, thorough medical exam she receives from the ship’s doctor in the admiral’s presence, and her failure to cooperate results in a stern punishment from her future mate. To cap it all off, with her bottom still burning and her cheeks blushing crimson she is brought to a shattering climax right there on the examination table to confirm her sexual responsiveness.Though Admiral Cavvik hadn’t planned on taking a human female as his mate, he was left with little choice after one look into Lia’s eyes called up primal instincts that could not be denied. But when it becomes clear that some among his people are violently opposed to his choice of companion, will he stand his ground and protect the little human he has quickly grown to love?Publisher’s Taken by the Admiral is an erotic romance novel that includes spankings, sexual scenes, medical play, anal play, and more. If such material offends you, please don’t buy this book.",
  "genres": [
    "BDSM",
    "Science Fiction",
    "Romance",
    "Erotica",
    "Science Fiction Romance",
    "Aliens",
    "Paranormal"
  ],
  "author": "Sue Lyndon",
  "average_rating": "3.78",
  "url": "https://www.goodreads.com/book/show/28581900-taken-by-the-admiral"
}