{
  "title": "The General vs. the President: MacArthur and Truman at the Brink of Nuclear War",
  "description": "From master storyteller and historian H. W. Brands, twice a finalist for the Pulitzer Prize, comes the riveting story of how President Harry Truman and General Douglas MacArthur squared off to decide America's future in the aftermath of World War II. At the height of the Korean War, President Harry S. Truman committed a gaffe that sent shock waves around the world. When asked by a reporter about the possible use of atomic weapons in response to China's entry into the war, Truman replied testily, \"The military commander in the field will have charge of the use of the weapons, as he always has.\" This suggested that General Douglas MacArthur, the willful, fearless, and highly decorated commander of the American and U.N. forces, had his finger on the nuclear trigger. A correction quickly followed, but the damage was done; two visions for America's path forward were clearly in opposition, and one man would have to make way.Truman was one of the most unpopular presidents in American history. Heir to a struggling economy, a ruined Europe, and increasing tension with the Soviet Union, on no issue was the path ahead clear and easy. General MacArthur, by contrast, was incredibly popular, as untouchable as any officer has ever been in America. The lessons he drew from World War II were absolute: appeasement leads to disaster and a showdown with the communists was inevitable--the sooner the better. In the nuclear era, when the Soviets, too, had the bomb, the specter of a catastrophic third World War lurked menacingly close on the horizon.The contest of wills between these two titanic characters unfolds against the turbulent backdrop of a faraway war and terrors conjured at home by Joseph McCarthy. From the drama of Stalin's blockade of West Berlin to the daring landing of MacArthur's forces at Inchon to the shocking entrance of China into the war, \" The General and the President vividly evokes the making of a new American era.\"",
  "genres": [
    "History",
    "Nonfiction",
    "American History",
    "Biography",
    "Politics",
    "Military Fiction",
    "Presidents"
  ],
  "author": "H.W. Brands",
  "average_rating": "4.18",
  "url": "https://www.goodreads.com/book/show/28587968-the-general-vs-the-president"
}