{
  "title": "Catching the Light",
  "description": "A compelling and heart warming set of four short stories by Mary Grand, author of ‘Free to Be Tegan’.The New ArrivalRachel has moved to the Isle of Wight determined to become invisible. Hiding a shameful secret she cultivates a ‘cold polite smile as effective as an electric fence.’ However, unexpectedly, into her life comes a loving, crazy, individual: Lottie the cocker spaniel. Everything is about to change.Catching the LightErin thinks she has found her fairytale prince. However, the honeymoon in a remote cottage in Wales shatters the dream. For the first time in her life Erin discovers the mystical world of fairies.BelongingMegan works in a Theatre for the Deaf. She is Deaf. Her language is British Sign Language. One evening she meets John, who is hearing, and two worlds collide. This is the story of the struggles, joys and tears of their remarkable relationship.The OutingThis was to be the most important day of Kay’s life. However her mission to be free from years of guilt reveals so much more than she could possibly imagine.Free to Be TeganAlso included is an excerpt from the author’s full length novel ‘Free to Be Tegan’.Tegan, aged twenty seven, is cast out of the cult, rejected by her family and the only life she has known. She is vulnerable and naïve but she also has courage and the will to survive. She travels to Wales, to previously unknown relations in the wild Cambrian Mountains.Reviews of Free to Be Tegan“An excellent debut novel, can’t wait for the next one.”“Powerful and beautifully written and I look forward to reading further books from Mary Grand.”“Loved the book …. I was gripped and couldn't put it down.”“It was very thought provoking and emotional with lots of plot twists to keep you on your toes. I highly recommend this book.”",
  "genres": [
    "Short Stories",
    "Fiction",
    "Chick Lit"
  ],
  "author": "Mary Grand",
  "average_rating": "3.45",
  "url": "https://www.goodreads.com/book/show/28583739-catching-the-light"
}