{
  "title": "The Nazi Hunters",
  "description": "More than seven decades after the end of the Second World War, the era of the Nazi Hunters is drawing to a close. Their saga is finally told in this “deep and sweeping account of a relentless search for justice that began in 1945 and is only now coming to an end” (The Washington Post).After the Nuremberg trials and the start of the Cold War, most of the victors in World War II lost interest in prosecuting Nazi war criminals. “Absorbing” (Kirkus Reviews) and “fascinating” (Library Journal), The Nazi Hunters focuses on the men and women who refused to allow their crimes to be forgotten. The Nazi Hunters reveals the experiences of the young American prosecutors in the Nuremberg and Dachau trials, Benjamin Ferencz and William Denson; the Polish investigating judge Jan Sehn, who handled the case of Auschwitz commandant Rudolf Höss; the Mossad agent Rafi Eitan, who was in charge of the Israeli team that nabbed Eichmann; and Eli Rosenbaum, who sought to expel war criminals who were living in the United States. But some of the Nazi hunters’ most controversial actions involved the more ambiguous cases, such as former UN Secretary-General Kurt Waldheim’s attempt to cover up his wartime history. Or the fate of concentration camp guards who have lived into their nineties, long past the time when reliable eyewitnesses could be found to pinpoint their exact roles. The story of the Nazi hunters is coming to a natural end. It was unprecedented in so many ways, especially the degree to which the initial impulse of revenge was transformed into a struggle for justice. The Nazi hunters have transformed our fundamental notions of right and wrong, and Andrew Nagorski’s “vivid, reader-friendly account of how justice was done…is comprehensively informative and a highly involving read” (The Wall Street Journal).",
  "genres": [
    "History",
    "Nonfiction",
    "World War II",
    "War",
    "Holocaust",
    "Crime",
    "Politics"
  ],
  "author": "Andrew Nagorski",
  "average_rating": "3.85",
  "url": "https://www.goodreads.com/book/show/28585424-the-nazi-hunters"
}