{
  "title": "The Plot to Kill Hitler: Dietrich Bonhoeffer—Pastor, Spy, Unlikely Hero",
  "description": "Perfect for fans of suspenseful nonfiction such as books by Steve Sheinkin, this is a page-turning narrative about Dietrich Bonhoeffer, a pastor and pacifist who became an unlikely hero during World War II and took part in a plot to kill Hitler. Written by two-time National Book Award finalist Patricia McCormick, author of Sold and Never Fall Down and coauthor of the young reader’s edition of I Am Malala.It was April 5, 1943, and the Gestapo would arrive any minute. Dietrich Bonhoeffer had been expecting this day for a long time. He had put his papers in order—and left a few notes specifically for Hitler’s men to see. Two SS agents climbed the stairs and told the boyish-looking Bonhoeffer to come with them. He calmly said good-bye to his parents, put his Bible under his arm, and left. Upstairs there was proof, in his own handwriting, that this quiet young minister was part of a conspiracy to kill Adolf Hitler.This compelling, brilliantly researched account includes the remarkable discovery that Bonhoeffer was one of the first people to provide evidence to the Allies that Jews were being deported to death camps. It takes readers from his privileged early childhood to the studies and travel that would introduce him to peace activists around the world—eventually putting this gentle, scholarly pacifist on a deadly course to assassinate one of the most ruthless dictators in history. The Plot to Kill Hitler provides fascinating insights into what makes someone stand up for what’s right when no one else is standing with you. It is a question that every generation must answer again and again.With black-and-white photographs, fascinating sidebars, and thoroughly researched details, this book should be essential reading.",
  "genres": [
    "Nonfiction",
    "History",
    "Biography",
    "World War II",
    "Middle Grade",
    "Historical",
    "War"
  ],
  "author": "Patricia McCormick",
  "average_rating": "4.04",
  "url": "https://www.goodreads.com/book/show/28594377-the-plot-to-kill-hitler"
}