{
  "title": "The Star Trek Encyclopedia, Revised and Expanded Edition: A Reference Guide to the Future",
  "description": "In celebration of the 50th anniversary of the classic show, a fully authorized revision of the popular reference companion: a two-volume encyclopedia featuring a completely new design, stunning new full-color photographs and illustrations, and 300 pages of new entries, packaged in a specially designed and shrink-wrapped deluxe slipcase.When it debuted in 1966, the Star Trek series quickly became a pop culture phenomenon, inspiring six spin-off series and thirteen films—including Star Trek Beyond, opening July 22, 2016—as well as books, comics, games, toys, and more. One of the largest franchises of all time, Star Trek’s overall box office revenue totals more than $1.93 billion to date.Since it’s initial publication twenty-five years ago, The Star Trek Encyclopedia has been the go-to source for everything related to the franchise’s canon. Packed with highly detailed information, including brief episode and film synopses, no other book has come close to offering the same wealth of insight into the Star Trek universe. Now, The Star Trek Encyclopedia has been thoroughly revised and redesigned for a new generation of fans. This updated and expanded edition includes 300 more pages, information, photographs and illustrations, and offers exhaustively researched and detailed entries on the characters, ships, and events from the last fifteen years of Star Trek television shows and films, including Star Trek: Voyager seasons 4-7, Star Trek: Enterprise seasons 1-4, and Star Trek Nemesis. It also features material detailing the recent big-screen films Star Trek (2009) and Star Trek: Into Darkness.Packaged in a stunning deluxe slipcase, this two-volume set is a must-have for every Star Trek fan’s library.",
  "genres": [
    "Star Trek",
    "Science Fiction",
    "Reference",
    "Fiction",
    "Tv",
    "Science Fiction Fantasy",
    "Fantasy"
  ],
  "author": "Michael Okuda",
  "average_rating": "4.30",
  "url": "https://www.goodreads.com/book/show/28595025-the-star-trek-encyclopedia-revised-and-expanded-edition"
}