{
  "title": "Going Solo: The Extraordinary Rise and Surprising Appeal of Living Alone",
  "description": "A revelatory examination of the most significant demographic shift since the Baby Boom - the sharp increase in the number of people who live alone - that offers surprising insights on the benefits of this epochal change. In 1950, only 22 percent of American adults were single. Today, more than 50 percent of American adults are single, and 31 million, roughly one out of every seven adults, live alone. People who live alone make up 28 percent of all U.S. households, which makes them more common than any other domestic unit, including the nuclear family. In Going Solo, renowned sociologist and author Eric Klinenberg proves that these numbers are more than just a passing trend. They are, in fact, evidence of the biggest demographic shift since the Baby Boom: we are learning to go solo, and crafting new ways of living in the process.Klinenberg explores the dramatic rise of solo living, and examines the seismic impact it’s having on our culture, business, and politics. Though conventional wisdom tells us that living by oneself leads to loneliness and isolation, Klinenberg shows that most solo dwellers are deeply engaged in social and civic life. In fact, compared with their married counterparts, they are more likely to eat out and exercise, go to art and music classes, attend public events and lectures, and volunteer. There’s even evidence that people who live alone enjoy better mental health than unmarried people who live with others and have more environmentally sustainable lifestyles than families, since they favor urban apartments over large suburban homes. Drawing on over three hundred in-depth interviews with men and women of all ages and every class, Klinenberg reaches a startling conclusion: in a world of ubiquitous media and hyperconnectivity, this way of life can help us discover ourselves and appreciate the pleasure of good company.With eye-opening statistics, original data, and vivid portraits of people who go solo, Klinenberg upends conventional wisdom to deliver the definitive take on how the rise of living alone is transforming the American experience. Going Solo is a powerful and necessary assessment of an unprecedented social change.",
  "genres": [
    "Nonfiction",
    "Sociology",
    "Psychology",
    "Audiobook",
    "Relationships",
    "Self Help",
    "Society"
  ],
  "author": "Eric Klinenberg",
  "average_rating": "3.38",
  "url": "https://www.goodreads.com/book/show/11797459-going-solo"
}