{
  "title": "Narcopolis",
  "description": "Shortlisted for the 2012 Man Booker PrizeJeet Thayil’s luminous debut novel completely subverts and challenges the literary traditions for which the Indian novel is celebrated. This is a book about drugs, sex, death, perversion, addiction, love, and god, and has more in common in its subject matter with the work of William S. Burroughs or Baudelaire than with the subcontinent’s familiar literary lights. Above all, it is a fantastical portrait of a beautiful and damned generation in a nation about to sell its soul. Written in Thayil’s poetic and affecting prose, Narcopolis charts the evolution of a great and broken metropolis.Narcopolis opens in Bombay in the late 1970s, as its narrator first arrives from New York to find himself entranced with the city’s underworld, in particular an opium den and attached brothel. A cast of unforgettably degenerate and magnetic characters works and patronizes the venue, including Dimple, the eunuch who makes pipes in the den; Rumi, the salaryman and husband whose addiction is violence; Newton Xavier, the celebrated painter who both rejects and craves adulation; Mr. Lee, the Chinese refugee and businessman; and a cast of poets, prostitutes, pimps, and gangsters.Decades pass to reveal a changing Bombay, where opium has given way to heroin from Pakistan and the city’s underbelly has become ever rawer. Those in their circle still use sex for their primary release and recreation, but the violence of the city on the nod and its purveyors have moved from the fringes to the center of their lives. Yet Dimple, despite the bleakness of her surroundings, continues to search for beauty—at the movies, in pulp magazines, at church, and in a new burka-wearing identity.After a long absence, the narrator returns in 2004 to find a very different Bombay. Those he knew are almost all gone, but the passion he feels for them and for the city is revealed.",
  "genres": [
    "Fiction",
    "India",
    "Indian Literature",
    "Historical Fiction",
    "Asia",
    "Novels",
    "Literary Fiction"
  ],
  "author": "Jeet Thayil",
  "average_rating": "3.44",
  "url": "https://www.goodreads.com/book/show/11797473-narcopolis"
}