{
  "title": "The Wall of Darkest Shadow",
  "description": "Fifth in an ongoing Fantasy Series, 'The Wall of Darkest Shadows' continues with another story of violent action, foul-mouthed wisecracking heroine tougher than Conan, and oddball mages with a penchant for mass destruction. Following in the steps of the Gray Mouser, Elric, Druss, and many more heroes of Sword and Sorcery, the elf called Nysta will carve her own epic path.  And that path will be bloody.  ---  “I think you'll manage, 'lock,” Nysta said, finally sheathing her blades. “You, too,” he said, not showing any amusement. “I told you before that my kind aren't wanted here. If the Mage Tower found out what I could do, they'd kill me. And not in a friendly way. That ork out there is an Imperial Guard. Which means we're going to see her. The Imperial Princess. Her and the Mage Tower never saw eye-to-eye, but there's still no telling what she'd do if she found out what we could really do. Be careful, Nysta. Please.” The elf raised an eyebrow. “Imperial, huh? Should be easily convinced, then,” she said with a dismissive wave of her hand. “Just tell them you ain't the spellslingers they're looking for.”  ---  In darkness, there is always death...  In the shadow of the Doomgate, a Caspiellan army has massed. Their weapons crave Fnordic blood. Their voices cry for the freedom of their abducted Queen.  On the other side, the defenders are split by betrayal when one of their own seeks to open the Doomgate for Rule. And he's got himself a cleric. On top of that, goblins infest the Wall itself and have turned its warped innards into a trap of death for those who try to enter.  But when everything looks lost, the defenders will be united by a woman. A woman whose fury cannot be contained. Whose spirit refuses to yield. She will crush the fledgling rebellion and lead the Empire's loyal forces in battle against the infamous Black Blades of Cornelia. And she'll kill them all.  Or die trying.",
  "genres": [],
  "author": "Lucas Thorn",
  "average_rating": "4.52",
  "url": "https://www.goodreads.com/book/show/28604598-the-wall-of-darkest-shadow"
}