{
  "title": "Toru: Wayfarer Returns",
  "description": "Revolutionary young samurai take on the West in this alternate history steampunk techno-fantasy set in 1850's samurai-era Japan.In Japan of 1852, the peace imposed by the Tokugawa Shoguns has lasted 250 years. Peace has turned to stagnation, however, as the commoners grow impoverished and their lords restless. Swords rust. Martial values decay. Foreign barbarians circle the island nation's closed borders like vultures, growing ever more demanding.Toru, a shipwrecked young fisherman rescued by American traders and taken to America, defies the Shogun's ban on returning to Japan, determined to save his homeland from foreign invasion. Can he rouse his countrymen in time? Or will the cruel Shogun carry out his vow to execute all who set foot in Japan after traveling abroad? Armed only with his will, a few books, dirigible plans and dangerous ideas, Toru must transform the Emperor's realm before the Black Ships come.Toru: Wayfarer Returns is the first book in the Sakura Steam Series, an alternate history of the tumultuous period from the opening of Japan in 1853 to the Meiji Restoration in 1868. This volume covers the year prior to the American Commodore Perry's arrival in Japan and follows the hero and his young allies as they lead Japan through a massively compressed industrial revolution, dramatically altering that pivotal moment in history.While Toru and his dirigibles are fictional, the story unfolds against the backdrop of the 'real' Japan of that period, with historical figures and their political environment woven into the tale, staying true to their motivations and agendas even as the alternate history warps their actions, history and a few laws of physics. Underpinning the adventure plot is a young man's yearning for his father's approval and an honorable place in his world.Readers who enjoy steampunk alternate histories more typically set in Victorian England or the American Wild West may enjoy this steampunk story made fresh by the Japanese samurai setting, as well as readers who enjoy historical fiction set in Japan. Awards and Recognition for \"Toru: Wayfarer Returns\" :-- Finalist, Fantasy category, 2016 Next Generation Indie Book Awards-- Bronze Medal Award, Multicultural Fiction category, 2016 eLit Book Awards-- Awesome Indies Approved-- Indie B.R.A.G Medallion Award-- Shortlisted (winners TBD), Science Fiction and Speculative Fiction, 2016 Cygnus Awards",
  "genres": [
    "Fantasy",
    "Steampunk",
    "Alternate History",
    "Historical Fiction",
    "Science Fiction",
    "Historical",
    "Adventure"
  ],
  "author": "Stephanie R. Sorensen",
  "average_rating": "3.87",
  "url": "https://www.goodreads.com/book/show/28605284-toru"
}