{
  "title": "All In: The Education of General David Petraeus",
  "description": "General David Petraeus is the most transformative leader the American military has seen since the generation of Marshall. In the New York Times bestseller All In , military expert Paula Broadwell examines Petraeus's career, his intellectual development as a military officer, and his impact on the U.S. military. Afforded extensive access by General Petraeus, his mentors, his subordinates, and his longtime friends, Broadwell reported on the front lines of fighting and at the strategic command in Afghanistan to chronicle the experiences of this American general as they were brought to bear in the terrible crucible of war. All In draws on hundreds of hours of exclusive interviews with Petraeus and his top officers and soldiers to tell the inside story of this commander's development and leadership in war.When Petraeus assumed command in Afghanistan in July 2010, the conflict looked as bleak as at any moment in America's nine years on the ground there. Petraeus's defining idea—counterinsurgency—was immediate put to its most difficult the hard lessons learned during the surge in Iraq were to be applied in a radically different theater. All In examines the impact in Afghanistan of new counterinsurgency as well as counterterrorism strategies through the commands of several Petraeus protégés.Broadwell examines his evolution as a solider from his education at West Point in the wake of Vietnam to his earlier service in Central America, Haiti, Kuwait, Bosnia, and Iraq. All In also documents the general's role in the war in Washington, going behind the scenes of negotiations during policy reviews of the war in Afghanistan in Congress, the Pentagon, and the White House.Broadwell ultimately appraises Petraeus's impact on the entire U.S. Thanks to this man's influence, the military is better prepared to fight using a comprehensive blend of civil-military activities. As America surveys a decade of untraditional warfare, this much is The career of General David Petraeus profoundly shaped our military and left an indelible mark on its rising leaders.",
  "genres": [
    "Biography",
    "Military Fiction",
    "History",
    "Nonfiction",
    "Leadership",
    "War",
    "Politics"
  ],
  "author": "Paula Broadwell",
  "average_rating": "3.23",
  "url": "https://www.goodreads.com/book/show/11797455-all-in"
}