{
  "title": "Vodou in the Haitian Experience: A Black Atlantic Perspective",
  "description": "One glaring lacuna in studies of Haitian Vodou is the scarcity of works exploring the connection between the religion and its main roots, traditional Yoruba religion. Discussions of Vodou very often seem to present the religion in vacuo, as a sui generis phenomenon that arose in Saint-Domingue and evolved in Haiti, with no antecedents. What is sorely needed then is more comparative studies of Haitian Vodou that would examine its connections to traditional Yoruba religion and thus illuminate certain aspects of its mythology, belief system, practices, and rituals. This book seeks to bridge these gaps.Vodou in the Haitian Experience studies comparatively the connections and relationships between Vodou and African traditional religions such as Yoruba religion and Egyptian religion. Such studies might enhance our understanding of the religion, and the connections between Africa and its Diaspora through shared religious patterns and practices. The general reader should be mindful of the transnational and transcultural perspectives of Vodou, as well as the cultural, socio-economic, and political context which gave birth to different visions and ideas of Vodou.The chapters in this collection tell a story about the dynamics of the Vodou faith and the rich ways Vodou has molded the Haitian narrative and psyche. The contributors of this book examine this constructed narrative from a multicultural voice that engages critically the discipline of ethnomusicology, drama, performance, art, anthropology, ethnography, economics, literature, intellectual history, philosophy, psychology, sociology, religion, and theology. Vodou is also studied from multiple theoretical approaches including queer, feminist theory, critical race theory, Marxism, postcolonial criticism, postmodernism, and psychoanalysis.",
  "genres": [
    "Religion"
  ],
  "author": "Celucien L. Joseph",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/28628429-vodou-in-the-haitian-experience"
}