{
  "title": "Red Brick, Black Mountain, White Clay: Reflections on Art, Family, and Survival",
  "description": "New York Times 100 Notable Books of 2012\"Beautiful, haunted, evocative and so open to where memory takes you. I kept thinking that this is the book that I have waited where objects, and poetry intertwine. Just wonderful and completely sui generis.\"  (Edmund de Waal, author of The Hare with Amber Eyes )An unforgettable voyage across the reaches of America and the depths of memory, Red Brick, Black Mountain, White Clay follows one incredible family to discover a unique craft tradition grounded in America¹s vast natural landscape. Looking back through the generations, renowned critic Christopher Benfey unearths an ancestry--and an aesthetic--that is quintessentially American. His mother descends from colonial explorers and Quaker craftsmen, who carved new arts from the trackless wilds of the frontier. Benfey¹s father escaped from Nazi Europe--along with his aunt and uncle, the famed Bauhaus artists Josef and Anni Albers--by fleeing across the Atlantic and finding an eventual haven in the American South.Bricks form the backbone of life in North Carolina¹s rural Piedmont, where Benfey¹s mother was raised among centuries-old folk potteries, tobacco farms, and clay pits. Her father, like his father before him, believed in the deep honesty of brick, that men might build good lives with the bricks they laid. Nurtured in this red-clay world of ancient craft and Quaker radicalism, Benfey¹s mother was poised to set out from home when a tragic romance cracked her young life in two. Salvaging the broken shards of his mother¹s past and exploring the revitalized folk arts resisting industrialization, Benfey discovers a world brimming with possibility and creativity.Benfey¹s father had no such foundation in his young life, nor did his aunt and uncle. Exiled artists from Berlin¹s Bauhaus school, Josef and Anni Albers were offered sanctuary not far from the Piedmont at Black Mountain College. A radical experiment in unifying education and art, Black Mountain made a monumental impact on American culture under Josef¹s leadership, counting Robert Rauschenberg, John Cage, and Buckminster Fuller among its influential students and teachers. Focusing on the natural world, innovative craftsmanship, and the physical reality of materials, Black Mountain became a home and symbol for an emerging vision of American art.Threading these stories together into a radiant and mesmerizing harmony, Red Brick, Black Mountain, White Clay is an extraordinary quest to the heart of America and the origins of its art.",
  "genres": [
    "Art",
    "Nonfiction",
    "History",
    "Memoir",
    "Biography",
    "Literature",
    "Essays"
  ],
  "author": "Christopher E.G. Benfey",
  "average_rating": "3.78",
  "url": "https://www.goodreads.com/book/show/11797470-red-brick-black-mountain-white-clay"
}