{
  "title": "First Born",
  "description": "Fantasy/Contemporary/Adventure/Young AdultAt nineteen-years-old, Tarian Prescott is under attack for the immortal DNA he didn’t know he possessed. Audrey, his Cadet Sergeant, rescues him from an air strike on the Entente Military Academy. She takes him to the magical Guardians of Dare village, where he discovers his true identity. It is here that he learns about the secret society of immortals that run the government and keep the Entente of Nations safe. But the immortals are mysteriously dying, and Tarian’s miraculous birth nineteen years ago may be the link to their survival. Being the first immortal to be born in over five hundred years, his DNA holds the answer to the reproduction of his kind. But in the wrong hands, his existence may lead to something far more destructive. While his superiors debate over his role as the First Born, he seeks only revenge. His father was the first immortal killed by Death Serum. Now that Tarian knows the truth about himself and his dad, he will find the murderous traitor and bring him to justice. But Tarian is young, and his immortal gifts have not matured. With the help and guidance of Audrey, he may have a chance.Tarian’s journey is both a physical challenge as well as an emotional coming of age enlightenment. His path of self-identity braids through the mortal and immortal world. With breath catching character revelations turning enemies into friends and friends into enemies, he must fight to save his loved ones and secure the two worlds he has come to love. First Born mixes fantasy with action adventure set in a near-future North America on the brink of a Border War offering a unique twist on an immortal tale. Interesting historical facts weave cleverly throughout the narrative providing extensive character background and playful speculation. Combining romantic fantasy with aggressive action think the All Souls trilogy meets the Divergent Trilogy.",
  "genres": [
    "Young Adult",
    "Dystopia"
  ],
  "author": "Janelle Gabay",
  "average_rating": "4.01",
  "url": "https://www.goodreads.com/book/show/28604534-first-born"
}