{
  "title": "By Ox Team to California: A Narrative of Crossing the Plains in 1860",
  "description": "Lavinia Honeyman Porter, 1836–1910, was born in West Virginia in 1836, moved to Missouri in childhood, married in 1854, and went overland in 1860.  Lavinia writes: \"It WAS in the fall and winter of eighteen fifty-nine that my husband and I decided to emigrate to the far West. Imprudent speculations and other misfortunes had embarrassed us financially to such an extent that our prospects for the future looked dark and forbidding; we then determined to use the small remnant of our fortune to provide a suitable outfit for a lengthy journey toward the setting sun. We were both young and inexperienced, my husband still in his twenties, and I a young and immature girl scarce twenty years of age.  \"A journey across the plains of the West was considered a great event in those early days. It was long thought of and planned seriously with and among the various members of the family to which the would be traveler belonged. Whoever had the temerity to propose turning their backs on civilized life and their faces toward the far-off Rocky mountains were supposed to be daring with a boldness bordering on recklessness. Emigration then meant the facing of unknown dangers in a half-savage country.  \"After many lengthy debates over the manner of transportation, and a diversified quantity of advice from our numerous friends, as to the merits of horses, mules or oxen, we at last decided (and it proved to be a wise decision) to purchase three yoke of strong, sturdy oxen and a large well-built emigrant wagon; roomy enough to hold all we wanted to take with us, and in which we might travel with some degree of comfort.\"  CONTENTS CHAPTER I. Preparations For A Journey—Bidding Farewell—The Start  CHAPTER II. Camping In Kansas— A Novice With Camp Fires —Marching On Foot  CHAPTER III. Fire And Fuel—Storm Bound—Fellow Emigrants—Settlers In Nebraska  CHAPTER IV. Buffalo Country—Returning Gold Seekers—Our Whiskey Barrel  CHAPTER V. Indians  CHAPTER VI. Trials Of The Spirit —Thirsting For Water—Gathering Buffalo Chips—Sick On The Desert—Bay Rum, Bergamont, And Castor Oil—Mirage  CHAPTER VII. Infant Denver—Hanging By The Vigilance Committee—An Indian And His Scalps—The Parting With My Brother—A Sale Of Glassware—On To California  CHAPTER VIII Toward Laramie—Fording A Dangerous Stream—celebrating The Fourth Of July—Entertaining Strangers—An Indian Village On The Move  CHAPTER IX. The Rocky Mountains—Cheyenne Pass—Lost Cattle Restored—Crossing The Chugwater—Shoeing Lame Oxen—Arriving At Fort Laramie  CHAPTER X. The Overland Road—Joining Company With A Band Of Emigrants—A Threatened Attack Of Indians—A Night Of Storm And Suspense Deserting The Company Of Emigrants—Independence Rock—Mormon Emigrants—Meeting Fellow Travelers Who Passed On To Destruction—Money Giving Out—Philip  CHAPTER XI. In Mormon Land—The Trading Post—Discarded Possessions—The Pony Express—Our Indian Protector—Amusing The Children .  CHAPTER XII. Salt Lake City—Disappointment At Fort Bridger—Letters From Home—An Old Acquaintance;—Mormon Women  CHAPTER XIII. The Deserts—Indescribable Sunsets—Alkau Dust—Chance Acquaintances—The Welcome Sunday Morning Flap-jack—Salt Well—Fish Springs—Willow Springs—T",
  "genres": [
    "History",
    "Travel",
    "Nonfiction",
    "19th Century",
    "Memoir",
    "Biography",
    "Westerns"
  ],
  "author": "Lavinia Honeyman Porter",
  "average_rating": "4.23",
  "url": "https://www.goodreads.com/book/show/28630011-by-ox-team-to-california"
}