{
  "title": "My Dirty Detour",
  "description": "A dominant leader flees the mafia, looking for a fresh start in a small town. He put all his effort into starting a business and resigned himself to a life without love. A neurotic germaphobe lives vicariously through the books she reads, preferring to play it safe in real life and hide behind her sarcastic remarks. “I am NOT that neurotic! I just have germ issues and I tend to over-analyze things. Sure, I second guess myself all the time and have a tendency to freak out over the small stuff. I’ll admit that I do ask a lot of “what if…?” questions. Fine. I’m neurotic.” One fateful day, the simple act of taking a wrong turn leads Violet right into Rocky’s life and completely turns it upside down. Accustomed to his orders being obeyed immediately and without question, Rocky doesn’t appreciate Violet challenging his authority at every opportunity. “I don’t like being told what to do. Especially when some arrogant tough guy thinks he can boss me around. I might have argued with him just to keep him close. He smelled like heaven. Although with a body like his, I knew he was no angel. Violet charmed her way into his heart with her quick wit and stubbornness, causing Rocky to fail at his many attempts to resist her. “He’d never met anyone like me before. I trash talk, curse like a sailor, and pretty much say whatever’s on my mind. Life is too short to pretend to be something that you’re not.” Rocky tries to keep his violent past hidden from Violet, but it suddenly catches up to him and he can no longer deny who he really is. Will Rocky turn his back on the life he built or stay and fight for what’s his? When Violet is faced with situations that rival anything she’s merely read about, will she be able to face her fears and work together with Rocky or will the truth tear them apart? “It’s one hell of a wild ride! Take a look inside the first few pages and I’ll tell you all about it.” Follow the journey of Rocky and Violet as they take a dirty detour… Please note: As is often the case after “Boy Meets Girl” but before “Happily Ever After,” Steamy Bedroom Scenes will occur. Well….some of the steamy scenes actually take place outside the bedroom. You’ll have to read the book to find out more! This is a full length, stand-alone novel with no cliffhangers.",
  "genres": [
    "Romance",
    "Contemporary Romance",
    "Contemporary",
    "Humor",
    "Comedy",
    "Romantic Comedy",
    "Fiction"
  ],
  "author": "Grace Risata",
  "average_rating": "3.88",
  "url": "https://www.goodreads.com/book/show/28644712-my-dirty-detour"
}