{
  "title": "Isis: Inside the Army of Terror",
  "description": "A newly updated and revised edition of the New York Times bestselling and highly praised book on ISIS—with fresh revelations on Russia’s campaign, how ISIS has evolved, and the failure of America’s policy.Initially dismissed by US President Barack Obama, along with other fledgling terrorist groups, as a “jayvee squad” compared to al-Qaeda, the Islamic State of Iraq and Syria (ISIS) has shocked the world by conquering massive territories in both countries and promising to create a vast new Muslim caliphate that observes the strict dictates of Sharia law.In ISIS: Inside the Army of Terror, American journalist Michael Weiss and Syrian analyst Hassan Hassan explain how these violent extremists evolved from a nearly defeated Iraqi insurgent group into a jihadi army of international volunteers who behead Western hostages in slickly produced videos and have conquered territory equal to the size of Great Britain. Beginning with the early days of Abu Musab al-Zarqawi, the founder of ISIS’s first incarnation as “al-Qaeda in Iraq,” Weiss and Hassan explain who the key players are—from their elusive leader Abu Bakr al-Baghdadi to the former Saddam Baathists in their ranks—where they come from, how the movement has attracted both local and global support, and where their financing comes from. Political and military maneuvering by the United States, Iraq, Iran, and Syria have all fueled ISIS’s astonishing and explosive expansion. Drawing on original interviews with former US military officials and current ISIS fighters, the authors also reveal the internecine struggles within the movement itself, as well as ISIS’s bloody hatred of Shiite Muslims, which is generating another sectarian war in the region. Just like the one the US thought it had stopped in 2011 in Iraq. Past is prologue and America’s legacy in the Middle East is sowing a new generation of terror.",
  "genres": [
    "Nonfiction",
    "History",
    "Politics",
    "Terrorism",
    "War",
    "Religion",
    "Islam"
  ],
  "author": "Michael Weiss",
  "average_rating": "3.68",
  "url": "https://www.goodreads.com/book/show/28649758-isis"
}