{
  "title": "Tomorrow's Cthulhu: Stories at the Dawn of Posthumanity",
  "description": "Super science. Madness. Transhumanism.  This is the dawn of posthumanity. Some things can’t be unlearned.  Gleaming labs whir with the hum of servers as scientists unravel the secrets of the universe. But as we peel away mysteries, the universe glances back at us. Even now, terrors rise from the Mariana Trench and drift down from the stars. Scientists are disappearing—or worse. Experiments take on minds of their own. Some fight back against the unknown, some give in, some are destroyed, and still others are becoming… more.  The human and inhuman are harder and harder to distinguish. Mankind is changing, whether it wants to or not, with brand new ways of thinking. What havoc is wreaked by those humans trying to harness and control their discoveries? As big science progresses and the very fundamentals of this universe are understood, what stories are being hushed up?  Of course, the Old Ones laugh at our laws, scientific and otherwise.  These are transhumanist near-future science fiction tales of the Cthulhu Mythos. These are tales of more than merely cosmic dread. They exist in our world of the next couple years. This is the era of big science and—what is that? We’ll be right back...  Authors: Desirina Boskovich, Lynda Rucker, Samantha Henderson, Daria Patrie, Kaaron Warren, Richard Byers, Damien Angelica Walters, Spencer Leary, Joshua L. Hood, Jeff C. Carter, Simon Bestwick, Matt Maxwell, Shannon Fay, Adam Heine, Mike Allen, Darrell Schweitzer, Cody Goodfellow, Bruce R. Cordell, Pete Rawlik, A.C. Wise, Robert Brockway, Nate Southard, Molly Tanzer, Joshua Alan Doetsch, Thomas M. Reid, Clinton J. Boomer, L.A. Knight, Lizz-Ayn Shaarawi, J.M. Rozanski",
  "genres": [
    "Horror",
    "Lovecraftian",
    "Fiction",
    "Short Stories",
    "Science Fiction",
    "Anthologies",
    "Cthulhu Mythos"
  ],
  "author": "Scott Gable",
  "average_rating": "3.81",
  "url": "https://www.goodreads.com/book/show/28648930-tomorrow-s-cthulhu"
}