{
  "title": "Predator on the Diamond:The Boston Red Sox Youth Molestation Story",
  "description": "Tavares Entertainment, LLC. has published and released a powerful and eye-opening novel by Gary G. Tavares. It is entitled “Predator of the The Boston Red Sox Youth Molestation Story.” Gary is a Screenwriter, Playwright, Author, Poet, Publisher, Filmmaker and Speaker. This novel is based on actual events. The events occurred in Winter Haven, Florida, between 1971 and 1991. The Boston Red Sox had their spring training facility there at that time. The facility was called the Chain of Lakes ballpark. There was a Caucasian man named Donald Fitzpatrick who worked in the organization as their clubhouse manager. He was called Fitzy for short. During that time, Fitzy is believed to have molested as many as a dozen black boys, who worked under him at the facility as clubbies. He pleaded guilty in 2002 but never served time. He was given a ten-year suspended sentence and fifteen years probation. Fitzy died in 2005 but the stories of the victims have never been told…. Until now. “Predator on the The Boston Red Sox Youth Molestation Story” could be the most thought-provoking and compelling untold story of child molestation within a sports organization in sports history. You will see how the circumstances of these young African-American boys, who were mostly poor and fatherless, were used to take advantage of them. Take a look into the mind of the predator and see how he uses his position of power to control and manipulate these young victims. Look into the minds of the actual young victims and see some of the signs of abuse which parents can often overlook. We send them to various professional sports organizations to work with some of the biggest athletes of our time, and we assume they are safe. However, how many Penn State scandals are waiting to emerge? How do we protect our youth? The answers to these questions may be more complex than we know, but this story may help to bring awareness to this issue.",
  "genres": [],
  "author": "Gary Tavares",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/28649396-predator-on-the-diamond"
}