{
  "title": "Pomp and Circumstance",
  "description": "In this second book of his duology, J.A.Wells utilises his finely tuned sense of period and historical fact to transport us to a world of caleches, feluccas, mummies and mosques, through which his masterfully drawn characters cavort with gay abandon, caring little for what might be around the corner and naively ignorant of the catastrophe which would end a decade of decadence and depression. Played against a backdrop of spy-ridden Egypt, pre war England, abdicating Kings and unexpected coronations, we continue to share further travel adventures with our intrepid explorers, Ron and Mervyn, as they discover far more than simply the mysteries of the orient. After a venturesome jaunt up the Nile, back in Cairo we find Ron and Mervyn at Shepheard’s Hotel, where the fascinating Lee Miller has invaded the Long Bar. A flamboyant party at Baron Empain’s Palais Hindou serves to whet their appetites for the supernatural. Then joining the luxury ship that will take them home, they rub shoulders with Egyptian royalty, learning more than they should regarding the secrets of the palace. Using his newly found entrepreneurial skills, Ron organises an on board concert, Mervyn’s angelic voice and good looks stealing the show. Ghosts are on the agenda once more at an overnight stay at London’s Great Western Hotel. What may become of the pairing of Ron and Mervyn, poles apart in age and class, yet similar in inclination?  Author’s Note: In most circumstances, at this point the author writes a disclaimer declaring that his or her characters bear no resemblance to people living or dead. However, in this case, most of the persons you will encounter in the story, once lived, but their names have been changed for reasons of expediency. I hope that by including them in this work of fiction I have given them the justice they deserve and have not sullied their reputations in any way. Throughout this fictional memoir of a millionaire, using the voice of Captain Ronald Fry, ex army captain, scout master, philanthropist and benefactor, I tell how it was to be gay in the 1930’s, when homosexuality was against the law and punishable with years of hard labour. To show one’s true feelings, one ran the risk of blackmailers, entrapment, robbery, violence, and even murder.",
  "genres": [],
  "author": "J.A. Wells",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/28647663-pomp-and-circumstance"
}