{
  "title": "The Oxford Dictionary of Humorous Quotations",
  "description": "Mark Twain once noted that Adam had a unique advantage--\"When he said a good thing he knew nobody had said it before.\" But once our primordial ancestors began quoting one another--perhaps to show off their keen humor and erudition--the habit became part of what makes us human. And though weoften quote sage advice and learned homilies, by far our favorite quote is the one that makes us, and our audience, laugh.Now, in The Oxford Dictionary of Humorous Quotations , noted writer and satirist Ned Sherrin has gathered nearly 5,000 quotations in a rollicking collection drawn from an international cast of humorists and pundits, ranging from Shakespeare, Jane Austen, and Oscar Wilde to Groucho Marx, MontyPython, and Roseanne. Arranged in themes, from Actors and Acting (including Dorothy Parker's famous barb on Katherine Hepburn's Broadway debut, \"She ran the whole gamut of the emotions from A to B\") to Parents (P. J. O'Rourke, \"Because of their size, parents may be difficult to disciplineproperly\"), to Youth (Georges Courteline, \"It's better to waste one's youth than to do nothing with it at all\"), Sherrin has left no turn unstoned to collect the sharpest, the wittiest, the wryest in quips, put-downs, and one-liners.Here is Senator Wyche Fowler's come-back when asked if he had smoked marijuana in the permissive sixties (\"Only when committing adultery\"), William Faulkner on Henry James (\"One of the nicest old ladies I ever met\"), George Bush on boredom (\"What's wrong with being a boring sort of guy?\"), S. J.Perelman on God (\"Whom you doubtless remember as that quaint old subordinate of General Douglas MacArthur\"), and Adlai Stevenson on Republicans (\"If they will stop telling lies about Democrats, we will stop telling the truth about them\"). The wits of stage and screen are here--including Woody Allen(\"I don't want to achieve immortality through my work...I want to achieve it by not dying\"), Noel Coward, Cole Porter, Mae West, Will Rogers, and George Bernard Shaw--as are the literary wags from Kingsley Amis and Saul Bellow to Evelyn Waugh and Gore Vidal (on Eisenhower in 1964, \"reading a speechwith his usual sense of discovery\"). Each quotation comes with details of who said it, where, and when, while separate keyword and author indices mean the reader will never have to wonder \"whose line is it anyway?\"With quotations courtesy of comedians and playwrights, novelists and producers, cartoonists and moguls, soldiers and lawyers, and displaying all shades of humor, from dry to sly, subtle to wacky, and even unintended, The Oxford Dictionary of Humorous Quotations will be the perfect resource forpublic speakers, writers and anyone else who enjoys a sparkling line, a clever pun, or a wickedly clever after all, says W. Somerset Maughm, \"Impropriety is the soul of wit.\"",
  "genres": [
    "Reference",
    "Humor",
    "Nonfiction",
    "Language",
    "Literature",
    "Writing"
  ],
  "author": "Ned Sherrin",
  "average_rating": "3.71",
  "url": "https://www.goodreads.com/book/show/2863371-the-oxford-dictionary-of-humorous-quotations"
}