{
  "title": "Shingwauk's Vision: A History of Native Residential Schools",
  "description": "With the growing strength of minority voices in recent decades has come much impassioned discussion of residential schools, the institutions where attendance by Native children was compulsory as recently as the 1960s. Former students have come forward in increasing numbers to describe the psychological and physical abuse they suffered in these schools, and many view the system as an experiment in cultural genocide. In this first comprehensive history of these institutions, J.R. Miller explores the motives of all three agents in the story. He looks at the separate experiences and agendas of the government officials who authorized the schools, the missionaries who taught in them, and the students who attended them.Starting with the foundations of residential schooling in seventeenth-century New France, Miller traces the modern version of the institution that was created in the 1880s, and, finally, describes the phasing-out of the schools in the 1960s. He looks at instruction, work and recreation, care and abuse, and the growing resistance to the system on the part of students and their families. Based on extensive interviews as well as archival research, Miller's history is particularly rich in Native accounts of the school system.This book is an absolute first in its comprehensive treatment of this subject. J.R. Miller has written a new chapter in the history of relations between indigenous and immigrant peoples in Canada.Co-winner of the 1996 Saskatchewan Book Award for nonfiction.Winner of the 1996 John Wesley Dafoe Foundation competition for Distinguished Writing by CanadiansNamed an 'Outstanding Book on the subject of human rights in North America' by the Gustavus Myer Center for the Study of Human Rights in North America.",
  "genres": [
    "History",
    "Canada",
    "Indigenous",
    "Nonfiction"
  ],
  "author": "J.R.      Miller",
  "average_rating": "4.22",
  "url": "https://www.goodreads.com/book/show/2864217-shingwauk-s-vision"
}