{
  "title": "Darkmage",
  "description": "There are always consequences to the choices we make. These consequences define our destiny.Welcome to the Rhenwars Saga, the dark epic fantasy series that chronicles the turbulent battles between two conflicting ideologies of magic and the moral imperatives that drive them.The Past: A thousand years ago, darkmage Zavier Renquist created the Well of Tears to unleash the hosts of chaos in an attempt to save his world's legacy of magic. The result was the cataclysmic destruction of the kingdom of Caladorn, which was reduced to a charred wasteland now known only as the Black Lands. To safeguard against such a tragedy from ever occurring again, all mages of Aerysius were charged with an Oath of Harmony, binding them with a strict code of pacifism.The Present: A thousand years later, the moral fetters of the Oath of Harmony are starting to chafe. Aerysius, city of the mages, lies destroyed. The Well of Tears has been unsealed by a rogue mage, unleashing Zavier Renquist and his hosts of chaos into the world to bolster the strength of the ancient Enemy. There is only one Sentinel left alive who can protect his homeland from this sinister threat: Darien Lauchlin, a mage Bound by the Oath of Harmony.Darien has already lost everything. Now, the only thing he has left to lose is his soul. As the Enemy masses in numbers never before seen, Darien is faced with an impossible decision: either remain steadfast to his Oath and watch everything he loves fall around him--or abandon his vow and become the most destructive force his world has ever known. Accompanied by his acolyte Kyle Archer and Naia, a priestess of Death, Darien embarks upon a harrowing journey that will lead him toward a path of utter self-destruction.Will Darien hold fast to the moral constraints that shackle him? Or will he abandon his principles and become a darkmage?In DARKMAGE, the themes of romance and tragedy combine to create a provocative dark and epic saga full of suspense that is sure to remain on the mind long after the tale has been told.",
  "genres": [
    "Fantasy",
    "Epic Fantasy",
    "Fiction",
    "Dark Fantasy",
    "Magic",
    "High Fantasy",
    "Science Fiction Fantasy"
  ],
  "author": "M.L. Spencer",
  "average_rating": "3.78",
  "url": "https://www.goodreads.com/book/show/28667219-darkmage"
}