{
  "title": "Attention-Deficit Disorders and Comorbidities in Children, Adolescents, and Adults",
  "description": "The incidence of attention-deficit/hyperactivity disorder (ADHD), with an estimated 5% of the population affected, is on the rise. Of those 5%, more than half must also cope with one or more comorbid disorders of learning, emotion, and behavior-complicating ADHD diagnosis and treatment.The challenge for clinicians is to treat not just ADHD, but also the psychiatric disorders and comorbid disorders that often accompany it. Edited by a leading researcher and practitioner, \"Attention-Deficit Disorders and Comorbidities in Children, Adolescents, and Adults\" brings together the work of 25 distinguished contributors-all on the cutting edge of ADHD research.The past decade of research and clinical experience has shown that ADHD is far from the simple disorder, starting in childhood and remitting in adulthood, it was once thought to be. Divided into two main sections, this volume includes a chapter on each of the psychiatric disorders and comorbidities that often occur with ADHD. In the first section, \"ADDs With Comorbidities,\" the editor introduces readers to ADHD by talking about our emerging understanding of and the latest genetic research on ADHD. The author of each subsequent chapter shows how ADHD interacts with mood and anxiety disorders, oppositionality and aggression, obsessive-compulsive disorder, learning disorders, substance abuse disorders, sleep disturbances, Tourette syndrome, and developmental coordination disorder.This section concludes with two final chapters: one on assessing and treating ADDs in preschoolers and the other on different treatment outcomes as reported in existing longitudinal studies of ADDs.The second section, \"Assessments and Interventions for ADDs,\" includes in-depth chapters on clinical assessment and diagnosis, pharmacotherapy, psychosocial and educational interventions, and a cognitive therapy perspective on ADHD.This section wraps up by emphasizing the importance of tailoring treatment to the individual as a whole, considering not only comorbidities but also family and social settings.Heavily annotated and written with practical implications for both clinicians and educators in mind, this comprehensive volume demonstrates a scope and depth unparalleled within the current literature. As such, it will find its way into the libraries of professionals and interested laypersons alike: clinical psychiatrists and psychologists; pediatricians, family practitioners and other primary care physicians who treat children, adolescents, and adults; education professionals, including school nurses, special education teachers and administrators, and college and university disability services personnel; and juvenile justice system professionals, including clinical and social workers and administrators.",
  "genres": [
    "Adhd"
  ],
  "author": "Thomas E. Brown",
  "average_rating": "4.67",
  "url": "https://www.goodreads.com/book/show/2865722-attention-deficit-disorders-and-comorbidities-in-children-adolescents"
}