{
  "title": "Stepping Off the Edge: Learning & Living Spiritual Practice",
  "description": "WHEN YOUR INNER VOICE SPEAKS,DO YOU LISTEN? STEPPING OFF THE LEARNING & LIVING SPIRITUAL PRACTICE was written by Sandy Nathan, a Santa Ynez, California author and horsewoman. Follow Sandy as she confronts issues that many of us face in the modern world.Got an on-line addiction? Trying to fit in rather than be who you are? Join Sandy as she finds her roots and battles an eBay addiction--and wins. Her story is uplifting, and inspiring.Sandy had always been aware of the voice of spirit, she just chose to ignore it some of the time. While struggling to find her spiritual path and manage her challenges, Sandy forgot to look at was in front of her life.Until things got too bad. During an intense few years when almost everything happened, that inner voice that grew loud enough to drop kick her in the direction she needed to go. This voice yanked her out of self-defeating patterns and propelled her to the Gathering, a Native American spiritual retreat. It made her realize that her life was her spiritual Handling what was in front of her was what she needed to do to achieve her spiritual goals.Now you can benefit from Sandy's experiences. This book is a combination of memoir and self-help that reads like a novel. The author's adventures, awareness, and awakenings help us gain insight into what is possible in life.The book contains an abundance of simple, fun, practical techniques to enhance our search for Self. This is a book that will leaves us knowing that we can hear the voice of Spirit every moment of every day. And it gives us some tangible things we can do to get to the place of trust. Is it simple? Yes. Is it easy? Not exactly.It's a lot like stepping off the edge.",
  "genres": [
    "New Age",
    "Spirituality",
    "Memoir",
    "Self Help",
    "Nonfiction"
  ],
  "author": "Sandy Nathan",
  "average_rating": "3.79",
  "url": "https://www.goodreads.com/book/show/2866033-stepping-off-the-edge"
}