{
  "title": "His Ruthless Bite",
  "description": "The Lord Vampire of Rochester doesn’t do a favor without a price. And now it’s time to collect.  Gavin Drake, Baron of Darkwood is being pestered by nosy neighbors and matchmaking mothers of the mortal nobility. To escape their scrutiny, he concludes that it’s time to take a wife. After witnessing the young vampire Lenore’s loyalty to the Lord of London, he decides she is sufficient for the role.  After surviving kidnapping and abuse from rogue vampires, Lenore Graves wants to help other women recover from their inner wounds. She befriends physician John Elliotson and uses her vampire powers to aid him in using mesmerism on his patients. When the Lord  Vampire of London declares that Lenore is the price the Lord Vampire of Rochester demands for aiding him in battle the previous year, she is terrified. Will all of her healing and hard work be destroyed by Ruthless Rochester? And yet, she can’t suppress stirrings of desire at the memory of their potent encounter.  After Gavin assures her that the marriage will be in name only, Lenore reluctantly accepts Gavin’s proposal rather than face potential animosity from her new lord. Determined to continue her work, she invites John Elliotson to Rochester. As they help women recover from traumas, Lenore explores her own inner turmoil and examines her attraction to her husband.  Gavin quickly realizes his marriage is a mistake. His new baroness’s involvement with the mesmerist is damaging his reputation among mortals and vampires alike. He knows he should put a stop to Lenore’s antics— yet her tender heart is warming his own and tempting him to make her his bride in truth.  As Lenore and Gavin’s relationship blossoms, the leader of a gang of rogue vampires embarks on a quest for vengeance against Gavin… using Lenore as his key.",
  "genres": [
    "Paranormal Romance",
    "Paranormal",
    "Historical Romance",
    "Vampires",
    "Romance",
    "Historical",
    "Amazon"
  ],
  "author": "Brooklyn Ann",
  "average_rating": "3.92",
  "url": "https://www.goodreads.com/book/show/28677958-his-ruthless-bite"
}