{
  "title": "A Dream of Wessex",
  "description": "The western democracies are disintegrating, scarred by violence and gripped with fear of terrorist attacks. Trying to find solutions to today's problems, Julia Stretton and other specialists at the Wessex Project have created a virtual reality projection of a utopian future where all current issues have been resolved - how did they achieve it? But on entering Wessex, they lose all memory of their 'real' lives outside, and as they move back and forth the lines between dream and reality become obscured. When Julia's ex-lover, the sadistic Paul Mason, joins the project, he has a sinister plan to take the Wessex projection to a new and terrifying level ... Christopher Priest's fifth novel, A Dream of Wessex (1977), is a classic of science fiction that will keep readers guessing until the startling, mind-bending conclusion. Priest's novels The Space Machine, The Affirmation, and The Separation are also available from Valancourt.REVIEWS'[An] excellent and intriguing novel ... the characters and their emotions are real, the concepts fascinating, and the sense of foreboding almost unbearable.' - Library Journal 'This fine novel about time-unravellers has hallucinatory powers ... Priest is a novelist of real distinction.' - The Times (London) 'Christopher Priest is one of our most gifted young writers of science fiction. I recommend A Dream of Wessex. I can best convey its quality by saying that I think not only H.G. Wells but Thomas Hardy himself would have enjoyed and approved of it.' - John Fowles, author of The Magus 'It is a strange novel, technically very assured in its shifts of time and handling of place-in-time, sketching in the edges of the dream with considerable vividness. A fine, exciting novel - SF if you want a label, but an enrichment not only of the sub-genre, but the whole genre too.' - The Guardian",
  "genres": [
    "Science Fiction",
    "Fiction",
    "Science Fiction Fantasy",
    "British Literature",
    "Classics",
    "Speculative Fiction",
    "Novels"
  ],
  "author": "Christopher Priest",
  "average_rating": "3.72",
  "url": "https://www.goodreads.com/book/show/28673146-a-dream-of-wessex"
}