{
  "title": "The Last Riders: First Four Votes Collection",
  "description": "The Last Riders are a Motorcycle Club created by eight ex Navy SEALS, that make no excuses for the life they have chosen to lead. These men fight hard and f**k harder. Get your first four votes from Razer, Viper, Knox and Shade. Razer’s Ride: Book OneBeth Cornett is the town good girl, so staying out of the way of the motorcycle club’s dangerous members was a no brainer. Unfortunately, she manages to catch the eye of Razer, who has every intention of tempting her to take him on despite her misgivings. When her worst fears are realized, she is left heartbroken, determined to forget her walk on the wild side. Razer was not going to change for any woman, not even Beth. Their lifestyles were too different; betrayed she ran. Realizing his mistake too late; she was not about to forgive and forget. It takes a killer intent on targeting Beth to bring her back to him and The Last Riders for protection. Razer may have learned his lesson, but this time, as long as she is at the club, she has to play by their rules. Viper’s Run: Book TwoWinter Simmons received the surprise of her life when she discovered the man she had been dating for the last two years was actually Viper, president of the Last Riders. A high school principal, Winter has no intention of ruining her reputation in the community to be with a man who betrayed her trust. Unforgiving, she turns her back on him, only to find that Viper is not the gentleman he portrayed. Determined to find his brother’s killer, Loker James kept his identity as President of The Last Riders a secret from Winter. When the truth comes out, he is determined to make her see the real man who can control not only a group of dangerous bikers, but a woman whose life is a rulebook. Unable to prevent herself from being drawn into the very club she despises, Winter is about to lose everything important to her, unless Viper can prove she’s more than a moonlight run.Knox’s Stand: Book ThreeKnox, a former Navy Seal, has been in several dangerous situations, but nothing compares to dealing with Diamond Richards. Framed for murder, he needs the passionless lawyer to prove his innocence. But when he no longer needs her help, he’s going to show her the passion she’s capable of and walk away a free man. Diamond plans on earning her huge fee to prove Knox is innocent, but she had no idea the muscled biker could bring out the passion she kept hidden behind her designer clothes. Trying to find a murderer is easier than dealing with The Last Riders and Knox’s sexcapades. He’s going to find out there is one woman worth standing and fighting for, despite his desire for freedom.Shade’s Fall: Book FourShade is everything Lily doesn't want in a man. He's rude, obnoxious and he's definitely not a cowboy. The tattooed enforcer for The Last Riders is a mystery Lily doesn't want to solve. He's too much for her to handle, especially with the nightmares from her past constantly threatening her sanity.Lily is everything Shade wants in a woman. She's sweet, kind and submissive. When she discovers the truth about The Last Riders, it threatens to tear apart every relationship within the club. Her rebellion causes the predatory instincts to rise in the ex Navy SEAL sniper.When The Last Riders are threatened by another motorcycle club just as determined to claim Lily, Shade is her only hope of surviving the approaching confrontation. Could their passion be Shade's downfall?",
  "genres": [],
  "author": "Jamie Begley",
  "average_rating": "4.72",
  "url": "https://www.goodreads.com/book/show/28676154-the-last-riders"
}