{
  "title": "Skeleton Jim: A Short Story",
  "description": "Meet Jim—a walking, talking skeleton.With no gun, no shoes—heck, no pants—Jim the Skeleton has a wry sense of humor, an eye for the ladies, and a nose for solving crime.He’s also got internet fans, a cult following, and no explanation for what he is or how he was created. He seems to be just bare bones held together by wires—and yet, he lives, thinks and feels… and works as a private investigator in Seattle.Jim’s newest client is blonde bombshell Lucy Newman, a rich woman with a dead husband and two blackmail demands that arrive twelve years apart.Can Skeleton Jim solve this case and save Lucy from her past? Or will the truth come crashing down around them in a pile of bones?What Readers are ★★★★★ “Great short story! Would love to see as a book. Skeleton Jim by J.R. Rain is a fun short story about a skeleton that just came alive in a science class one day. From then on, he’s a walking, talking and alarming character in town. Then he became a private eye. Very unique and clever.” —Amazon review★★★★★ “Not only is this a good story, but it is also funny. I really enjoyed reading about Skeleton Jim. He makes a good character and he seems very real.” —Amazon review★★★★★ “A skeleton private investigator sounds like a ridiculous concept until you remember J.R. Rain is telling this story. Then it becomes completely acceptable, and he makes it seem so effortless. He shares Jim’s origins while solving Lucy’s case in this short story. The prose is solid and JR’s sense of humor shines in this one. You’re going to love it! The bigger mystery, who was he before landing inside a college skeleton display, is never answered. Jim is a fully fleshed out and completely lovable character, even if he has no padding. Hopefully, he will visit J.R.’s mind again soon so we can learn more!” —Amazon review★★★★★ “Loved it! You almost think while reading that Skeleton Jim is real. Would love to meet him. Lol. This is a quick and fun read.” —Amazon review★★★★★ “Skeleton Jim is a great story! But just as important, Skeleton Jim is a great character! J.R. Rain doesn’t miss with this one! Wow, was I surprised to find that this character is all bones. But don’t let that throw you off. Skeleton Jim is a fully fleshed out fellow, and this story carefully leads us through his origins while he solves a particularly entangled case. I didn’t put my Kindle down until the story had come to its conclusion, and then all I could think was, ‘I wonder when the next one will be out?’ Definitely a must read!” —Amazon review★★★★★ “Original and brilliant! J.R. Rain never disappoints! Whether it’s a full length book or in this case a short story, he always does am amazing job! Who would have thought of writing about a skeleton PI?! Skeleton Jim has just the right amount of mystery and intrigue.” —Amazon reviewClick BUY NOW or READ FOR FREE!",
  "genres": [
    "Fantasy"
  ],
  "author": "J.R. Rain",
  "average_rating": "3.91",
  "url": "https://www.goodreads.com/book/show/28678067-skeleton-jim"
}