{
  "title": "Beyond Engagement: A Guide to Building Healthy and Successful Organizations",
  "description": "Monthly potluck lunches. Company pep rallies. Focus groups. Birthday parties.  If you are not seeing any results from these and want to drive your organization to higher levels of health and performance, you need Beyond Engagement.  Jadedness for satisfaction and engagement surveys are on the rise. Team members are no longer interested in hollow solutions and lip service to their morale and needs. Beyond Engagement takes readers through a look at the role of your human resources function and how their recruitment philosophies and interviewing processes have a dramatic impact on organizational culture and engagement. \"You catch what you go fishing for\" is the line that will resonate with you for a long time.  Tim Schneider then takes us on an updated and workplace specific view of Maslow's Hierarchy of Needs. In Beyond Engagement, this needs pyramid assumes a new meaning and we see how meeting needs, at work, becomes a significant factor in organizational health. From the basics of providing for a team member's survival through creating satisfying and meaningful work, these sections provide solutions to many common organizational morale challenges.  Beyond Engagement continues with new views, supported by validated science, into real input. You will never conduct another brainstorming session again after reading this section and concentrate on providing your team members with real voice in the organization.  One of the most common failures in traditional engagement strategies is not having leaders that are truly people focused. Beyond Engagement tackles this issue in a straightforward manner and reasserts that leadership is a people function. Another important section deals with transparency and how an organization relays information in an honest and open way.  Schneider connects ethics, and specifically ethical congruence, to team member morale, spirit and engagement. Most engagement experts have not ventured down this path but Beyond Engagement takes it head on. Consistency in ethical practices, how team members are treated and the equal application of rules, will have substantive power in keeping morale, engagement and performance at high levels.  A final area of consideration is the adoption and execution of a service based culture. This section in Beyond Engagement is not the tired and worn discussion of how to treat customers but rather a critical look at how internal service providers like finance, information technology and human resources interact with your team members. Beyond Engagement connects those interactions directly with team performance and spirit.  Beyond Engagement is a powerful tool in building real performance through healthy organizational practices and motivating a world-class workforce.",
  "genres": [],
  "author": "Tim  Schneider",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/28677024-beyond-engagement"
}