{
  "title": "Getting His Wolf",
  "description": "Gay Werewolf Alpha/Omega RomanceNever in Nathan’s wildest nightmares had he ever imagined that he’d be here, tied to a pole, about to watch two werewolves fight to the death….Alpha werewolf Max Hudson has always used his strength and speed to serve the needs of his pack – no matter what they are. But after refusing an order from his sadistic packmaster to kill a young pup who strayed into their territory, Max has no choice but to go on the run, or be killed for his disobedience. But he never expected that his escape would lead him headlong into an encounter with the mate he never thought he’d find – or that his mate would take the form of clean-cut Mountie Nathan Sutherland. Raised from birth to distrust cops, Max finds himself unwillingly disarmed by Nathan’s kindness and honesty, and allows himself to spend the night with him – only to realize that by doing so, he’s also put Nathan in deadly danger. After finding a troubled and devastatingly handsome stranger injured and alone, Nathan’s first instinct is to help. Despite the fact he realizes that he and Max sit on opposite sides of the law, he can’t deny the powerful attraction between the two of them. Though sleeping with Max goes against all his better judgment, neither does he seem capable of resisting it. What he doesn’t know is that by doing so, he’s taking his first step into the dangerous world of wolf packs and shifters – a world he never thought could possibly exist, and a world he can’t help but be drawn to.With the brutal packmaster closing in, Nathan and Max don't have much time to decide what’s important to them – or Max to figure out just how far he’ll go to protect what’s his.Getting His Wolf is a 58,000-word standalone novel with alpha/omega romance, werewolf shifters, HEA and no cliffhangers. It contains steamy m/m scenes and is not intended for readers under the age of 18.",
  "genres": [
    "Shapeshifters",
    "M M Romance",
    "Romance",
    "Paranormal",
    "Werewolves",
    "LGBT"
  ],
  "author": "Isabelle Arden",
  "average_rating": "3.52",
  "url": "https://www.goodreads.com/book/show/28673599-getting-his-wolf"
}