{
  "title": "The Book of YES: The Ultimate Real Estate Agent Conversation Guide",
  "description": "The Book of YES In Kevin Ward's book, you will find the most powerful scripts in the real estate industry today. If you’re tired of the same old sales scripts or if you’ve done away with them all together, I know how you feel because I’ve been there. I was tired of seeing the same B.S.(bad sales) approaches and I wanted something that felt more natural for me. So I started creating my own scripts, for the simple reason that I hated being told, “No.” For me nothing was worse than that feeling of rejection. I was determined to figure out the perfect thing to say in every situation, and how to say it in a way that would cause sellers and buyers to want to say “Yes!” to me every time. This book is the result of that quest. And I’ve broken it in two unique parts so you can spend less time reading it, and more time using the life changing scripts inside. Part 1 will give you the foundation for making the scripts work for you. Not just some of the time, but every time! You’ll master how to inspire sellers to say “YES” to you giving you the magic key to unlock the success you want as a real estate agent. Part 2 Is the actual scripts that allow you to have smooth, choreographed conversations that lead you down the path to more success and more income. included in this section are… Prospecting Scripts for sellers that lead up to the listing appointment. My Unique Listing Presentation Scripts with examples of exactly how to deliver them for maximum impact. The Buyer Scripts that I’ve personally used for years to build my own real estate business from scratch. The Objection Scripts that will show you how to overcome any objection with ease and never be scrambling for words when a client throws you a curveball. In all there are 27 scripts in this book that will show you how to handle any situation, conversation, and objection that might come your way. And each script has been tested, tweaked and perfected. How do I know this? Because I’ve used each and every one of them to close millions of dollars worth of real estate in my nearly 2 decade career. I’ve also taken the time to include things I’ve picked up over my career that will help take you beyond the scripts… How to identify resistance and influence triggers so you can naturally use the right words and phrases that gets more clients saying YES to you. My practice techniques for memorizing and using these scripts to their full impact. You won’t just be pulling words from your memory, you’ll be speaking from the heart so you come across as genuine. The “tiny tweaks” that turn a regular script into something powerful. These seemingly little differences can have a huge impact in the way a prospect or client responds to what you say. The 9 Keys to more powerful conversations that go way beyond just the words you say to a client. I’ve mastered all 9 of these techniques and each one has made a huge difference in how I present myself to clients. The Book of YES is an action guide, not a book of theory. Think of it as YOUR PLAY BOOK for the key conversations you have with sellers and buyers.",
  "genres": [
    "Business",
    "Nonfiction",
    "Self Help"
  ],
  "author": "Kevin Ward",
  "average_rating": "4.13",
  "url": "https://www.goodreads.com/book/show/28675440-the-book-of-yes"
}