{
  "title": "A Gift for the King",
  "description": "For an ordinary twenty-two-year-old college student like Lana, the idea of being kidnapped from Earth by aliens would have sounded absurd… until the day it happened. As Lana quickly discovers, however, her abduction is not even the most alarming part of her situation. To her shock, she soon learns that she is to be stripped naked and sold as a slave to the highest bidder.When she resists the intimate, deeply humiliating procedures necessary to prepare her for the auction, Lana merely earns herself a long, hard, bare-bottom spanking, but her passionate defiance catches the attention of her captor and results in a change in his plans. Instead of being sold, Lana will be given as a gift to Dante, the region’s powerful king.Dante makes it abundantly clear that he will expect absolute obedience and that any misbehavior will be dealt with sternly, yet in spite of everything Lana cannot help feeling safe and cared for in the handsome ruler’s arms. Even when Dante’s punishments leave her with flaming cheeks and a bottom sore from more than just a spanking, it only sets her desire for him burning hotter.But though Dante’s dominant lovemaking brings her pleasure beyond anything she ever imagined, Lana fears she may never be more than a plaything to him, and her fears soon lead to rebellion. When an escape attempt goes awry and she is captured by Dante’s most dangerous enemy, she is left to wonder if her master cares for her enough to come to her rescue. Will the king risk everything to reclaim what is his, and if he does bring his human girl home safe and sound, can he find a way to teach Lana once and for all that she belongs to him completely?Publisher’s Note: A Gift for the King is an erotic romance novel that contains spankings, sexual scenes, anal play, elements of medical play, elements of BDSM, and more. If such material offends you, please don’t buy this book.",
  "genres": [
    "Romance",
    "Aliens",
    "BDSM",
    "Science Fiction",
    "Erotica",
    "Fantasy",
    "Adult"
  ],
  "author": "Sara  Fields",
  "average_rating": "3.64",
  "url": "https://www.goodreads.com/book/show/28677741-a-gift-for-the-king"
}