{
  "title": "Tempting Mr. Townsend",
  "description": "Beauty - and the Beast? When rough diamond Anthony Townsend, who also happens to be one of the richest men in England, bursts into Lady Fenella’s house and demands she hand over his runaway nephew, this dashing widow embarks on a breathtaking adventure that might just end in exciting new love. Beauty… Fenella, Lady Deerham, has rejoined society after five years of mourning her beloved husband’s death at Waterloo. Now she’s fêted as a diamond of the first water and London’s perfect lady. But beneath her exquisite exterior, this delicate blond beauty conceals depths of courage and passion nobody has ever suspected. When her son and his school friend go missing, she vows to find them whatever it takes. Including setting off alone in the middle of the night with high-handed bear of a man, Anthony Townsend. Will this tumultuous journey end in more tragedy? Or will the impetuous quest astonish this dashing widow with a breathtaking new love, and life with the last man she ever imagined? And the Beast? When Anthony Townsend bursts into Lady Deerham’s fashionable Mayfair mansion demanding the return of his orphaned nephew, the lovely widow’s beauty and spirit turn his world upside down. But surely such a refined and aristocratic creature will scorn a rough, self-made man’s courtship, even if that man is now one of the richest magnates in England. Especially after he’s made such a woeful first impression by barging into her house and accusing her of conniving with the runaways. But when Fenella insists on sharing the desperate search for the boys, fate offers Anthony a chance to play the hero and change her mind about him. Will reluctant proximity convince Fenella that perhaps Mr. Townsend isn’t so beastly after all? Or now that their charges are safe, will Anthony and Fenella remain forever opposites fighting their attraction?",
  "genres": [
    "Historical Romance",
    "Romance",
    "Historical",
    "Novella",
    "Regency",
    "Regency Romance",
    "British Literature"
  ],
  "author": "Anna Campbell",
  "average_rating": "3.95",
  "url": "https://www.goodreads.com/book/show/28689765-tempting-mr-townsend"
}