{
  "title": "Lured In",
  "description": "The O’Donnell brothers continue to cast their lines and find love in this alluring romance from the bestselling author of Off the Hook (“A must-read for fans of second-chance love stories.”—Lauren Layne). Seasick. That’s how Jessie Todd feels when her best friend and boss, Finn O’Donnell, tells her that the Buoys will be featured on a popular fishing program—which just so happens to be hosted by a guy she used to date. She’s still friendly with her ex, but her new feelings for Finn are making things . . . complicated. His life is out on the sea, and though Jessie works at the resort, her paralyzing phobia of water keeps her on land, where she’s safe. To take a shot with Finn, she’ll need to face her fears—and her innermost desires—head-on.Finn has been nursing a crush on Jess for a long time, so when she suddenly asks for swimming lessons, he dives right in. Holding her shaking hand as she steps into the ocean makes his heart swell—despite the sinking feeling that she’s just doing it to impress that smarmy TV host. Finn doesn’t trust anyone with his bruised and battered heart, but he’ll be forced to lay it all on the line to keep Jess from being the one that got away.Praise for Off the Hook“A must-read for fans of second-chance love stories, Off the Hook is the perfect balance of sweet, sexy, and wonderfully romantic.”—USA Today bestselling author Lauren Layne“Laura Drewry struck the right balance between the heavier, more serious or emotional parts with humor and heat. . . . Fans of Kimberly Lang, Jenna Sutton, and Marie Force will enjoy Off the Hook.”—Harlequin Junkie“Drewry kicks off another sweet, fun and sexy series. Off the Hook is a second-chance romance filled with emotion, easy-to-relate-with characters, witty dialogue and a smooth-flowing plot that had me hooked.”—TJ Loves to ReadIncludes a special message from the editor, as well as an excerpt from another Loveswept title.",
  "genres": [
    "Romance",
    "Contemporary",
    "Contemporary Romance",
    "Friends To Lovers",
    "New Adult",
    "Chick Lit",
    "Canada"
  ],
  "author": "Laura Drewry",
  "average_rating": "4.04",
  "url": "https://www.goodreads.com/book/show/28686773-lured-in"
}