{
  "title": "The Mark of Wu",
  "description": "-China, 519 B.C.  State of Chu warrior Yuan stands front and center on his chariot, reins in hand, holding at bay a spirited tug from his team of eager steeds. He watches the battle unfold distantly before him, on the Huai River floodplain near Ch’ifu, anxious for a chance to unleash his rage on the invading barbarians. Yuan's eyes fix enviously on a fellow soldier, a halberdier who reaches his hooked weapon over the shoulder of a boor who desperately sprints away from the charging beasts. He knows the result before it happens. The wicked blade rips through flesh and muscle, then sinks into the enemy’s collar bone; his screams echo off the Dabie Shan Mountains.\tYuan glances toward Field Marshall Fong, thirsting for the order to charge into the fray. He needs this fight. He must have a victory if he is going to restore his family’s honor. But on the march to engage battle with the State of Wu, their brilliant General dies, and the far less capable Fong snatches control.\tPrince Kiang of Wu leads the opposing forces. The beast tattooed on his face instills stark fear in the hearts of his enemies. Kuang’s much smaller army outmaneuvers the overconfident Fong, sending Chu into a humiliating retreat and dashing Yuan’s hopes for vindication.\tEver since the Emperor lost his grip on the feudal States, brutal rivalries, both new and old, rule life. Individual States constantly collide. And Noblemen must rise in power to overcome the crushing will of others. Ambitions of clever men aren’t always tempered by righteousness; some are driven by pure evil. There are only two possible outcomes from a clash in this tumult--prevail or perish.Yuan, a young Chu nobleman, finds himself catapulted into the throes of such chaos. He is a soldier at his core, having demonstrated battlefield prowess early on that was later honed, making him a killing machine. He will need that skill and superior cunning to stay alive due to his friendship with Prince Chien, the exiled Heir Apparent, who lost in a rivalry with his father King Ping.\tThe conniving Prime Minister Nang Wa plays King Ping like a flute, manipulating him to order the execution of Yuan and his family. Yuan is blindsided by Nang Wa’s assault and must fight his way out of an ambush, then flee for his life. He searches for a safe haven within the Northern Alliance, but is unwittingly ensnared by multiple conspiracies with disastrous fallout. Now, two more States want him dead. His journey of survival sends him through a heavily guarded city, dangerous mountain passes and across war torn territory, all the while chased by cutthroats with orders to kill him on sight. The odds against him are tremendous, even for this superior warrior, but his flight to find safety is more heavily burdened with Chien’s 8-year-old son, whose life Yuan has been entrusted with protecting at all costs to himself.\tKing Ping’s ruthlessness is matched only by his greed, and his interest in Yuan’s demise pales in comparison to his appetite for conquest. He covets access to the sea and sets his eyes on the enemy coastal State of Wu. But Prince Kuang is unbeatable at every battle.\tKuang’s own rise to preeminence is suddenly hijacked by treachery upon his return from the victory at Ch’ifu, and he is embroiled in a fight for his life against a hidden enemy within his own province. Kuang was expecting a hero’s welcome only to be met with an attempt on his life by a hired assassin.\tMortal enemies Yuan and Kuang are unaware that the corruption in their respective homelands puts them on a collision course.",
  "genres": [
    "Historical Fiction",
    "China"
  ],
  "author": "Stephen M. Gray",
  "average_rating": "4.42",
  "url": "https://www.goodreads.com/book/show/28690080-the-mark-of-wu"
}