{
  "title": "Magical Destinations of the Northeast: Sacred Sites, Occult Oddities & Magical Monuments",
  "description": "Every state in America has sacred sites—places that change you, heal you, and make you feel alive. Magical Destinations of the Northeast details more than 300 spiritual destinations perfect for meditation, magic, and just plain fun. This hands-on guidebook also includes spells and rituals and provides tips for the magical uses of official state plants, flowers, gems, minerals, and trees.There are pockets of magic to be found everywhere—places that make you stop in your tracks as powerful energies speak to your soul. This book is filled with awe-inspiring destinations, featuring little-known gems, natural landscapes, and manmade creations, as well as Native American and African American heritage sites. With everything from witch’s temples to Druid circles, spiritualist communities to mysterious stones, this book will make your next trip a truly magical journey.Features more than 300 destinations in:• Maine • Vermont • New Hampshire • Massachusetts • Rhode Island Connecticut • District of Columbia • Maryland • Delaware • Pennsylvania • New Jersey • New YorkPraise: “A comprehensive, entertaining, and insightful guide to the sacred, magical, and mystical destinations of the Northeast.” —Judika Illes, author of Encyclopedia of Witchcraft“Magical Destinations of the Northeast includes both famous sites as well as those that are comparatively unknown. Although I’m a longtime dedicated reader of travel books, within these pages I discovered numerous places that were new to me. Magical Destinations is perfect for both armchair and actual travelers; NatalieZaman is a brilliant tour guide: her fresh and thoughtful perspectives make this book more than just another travel guide. Looking forward to future installments with great anticipation!”—Judika Illes, author of the, The Big Book of Practical Spells and Encyclopedia of Witchcraft“A fascinating and comprehensive book that is sure to become the go-to guide for anyone wanting to visit magical places in the Northeast United States. I can’t wait to begin exploring all the wonders this book reveals.”—Deborah Blake, author of Everyday Witchcraft and The Witch’s Broom\"Many of us American witches and Pagans probably think we need a passport to discover places full of magical significance. Natalie Zaman leads the reader on a magical pilgrimage to the American Northeast showing us travel destinations through magical eyes. She proves time and time again within this very entertaining and well-researched book that places of power are much closer to home than we ever knew. Even if you’ve never been to the east coast, this book will surely awaken your wanderlust to visit the amazing locations wonderfully described with Zaman’s inspiring travel guide.\"—Mickie Mueller, author of The Witch’s Mirror “The world is enchanted and with this book, Natalie becomes your magical tour guide, leading you to discover sacred spaces and secret places. We love her style!”—Amy Zerner and Monte Farber, authors of The Psychic Circle and The Enchanted Tarot\"The world is full of magic and although you can journey to the far corners of the Earth to find places of wonder, you can also find them nearer than you’d imagine possible. Magical Destinations of the Northeast is like a hidden scroll, a treasure map, and a mysterious compass that let’s you find the enchanted places that are near to your home and hearth. Because these are closer, you may have the opportunity to visit them again and again so you can build a sacred relationship with each place. If you are not from the Northeast of the USA, then the listings are your key to visiting locations and meeting people that you might never see without this guide to the magic that is hidden in plain sight.” Ivo Dominguez Jr., author of Practical Astrology for Witches and Pagans\"America is blessed to have such a wonderfully witchy archivist out in the field! Written with intelligence and compassionate insight, readers are introduced to a wide variety of sacred Northeastern sites, suggestions for spiritual visitors, spells, meditations, and a solid dose of history. Natalie Zaman expertly documents all things curious, ancient, and otherwise magical in this impressive collection—I can't wait for the rest of the series!”—Raven Digitalis, author of Esoteric Empathy and Goth Craft",
  "genres": [
    "Nonfiction",
    "Travel",
    "Local History",
    "Witchcraft",
    "Magic"
  ],
  "author": "Natalie Zaman",
  "average_rating": "3.91",
  "url": "https://www.goodreads.com/book/show/28700186-magical-destinations-of-the-northeast"
}