{
  "title": "Israel: A Concise History of a Nation Reborn",
  "description": "Winner of the Jewish Book of the Year AwardThe first comprehensive yet accessible history of the state of Israel from its inception to present day, from Daniel Gordis, \"one of the most respected Israel analysts\" (The Forward) living and writing in Jerusalem.Israel is a tiny state, and yet it has captured the world’s attention, aroused its imagination, and lately, been the object of its opprobrium. Why does such a small country speak to so many global concerns? More pressingly: Why does Israel make the decisions it does? And what lies in its future?We cannot answer these questions until we understand Israel’s people and the questions and conflicts, the hopes and desires, that have animated their conversations and actions. Though Israel’s history is rife with conflict, these conflicts do not fully communicate the spirit of Israel and its people: they give short shrift to the dream that gave birth to the state, and to the vision for the Jewish people that was at its core. Guiding us through the milestones of Israeli history, Gordis relays the drama of the Jewish people’s story and the creation of the state. Clear-eyed and erudite, he illustrates how Israel became a cultural, economic and military powerhouse—but also explains where Israel made grave mistakes and traces the long history of Israel’s deepening isolation.With Israel, public intellectual Daniel Gordis offers us a brief but thorough account of the cultural, economic, and political history of this complex nation, from its beginnings to the present. Accessible, levelheaded, and rigorous, Israel sheds light on the Israel’s past so we can understand its future. The result is a vivid portrait of a people, and a nation, reborn.",
  "genres": [
    "History",
    "Nonfiction",
    "Israel",
    "Politics",
    "Jewish",
    "Audiobook",
    "Judaism"
  ],
  "author": "Daniel Gordis",
  "average_rating": "4.30",
  "url": "https://www.goodreads.com/book/show/28693693-israel"
}