{
  "title": "Incredible Survival Stories: Tales of Death-Defying Treks across the Globe",
  "description": "Scale the world’s highest peaks, plunge to the depths of the ocean, wade through the dense jungles of the Amazon, and cross every terrain in between in Incredible Survival Stories . Featuring more than a dozen firsthand accounts from celebrated explorers and adventurers, this collection includes some of the most perilous accounts of man versus nature ever to be penned. Prepare to be amazed, as within these pages you’• Join Theodore Roosevelt’s standoff with an African lion• Fight in the heat of battle with Ulysses S. Grant• Battle a sandstorm in the Gobi Desert with Sven Hedin• Discover uncharted American territory with Lewis and Clark• Follow Ernest Shackleton’s perilous Antarctic voyage• Circumnavigate the globe with Sir Francis Drake• And tag along on more than a dozen more adventures!With more than three dozen photographs and illustrations that help bring these astounding tales to life, Incredible Survival Stories is a must-have for every armchair adventurer and aspiring explorer.Skyhorse Publishing, as well as our Sports Publishing imprint, is proud to publish a broad range of books for readers interested in sports—books about baseball, pro football, college football, pro and college basketball, hockey, or soccer, we have a book about your sport or your team.In addition to books on popular team sports, we also publish books for a wide variety of athletes and sports enthusiasts, including books on running, cycling, horseback riding, swimming, tennis, martial arts, golf, camping, hiking, aviation, boating, and so much more. While not every title we publish becomes a New York Times bestseller or a national bestseller, we are committed to publishing books on subjects that are sometimes overlooked by other publishers and to authors whose work might not otherwise find a home.",
  "genres": [],
  "author": "Graham Moore",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/28695316-incredible-survival-stories"
}