{
  "title": "Only the Dead Know Burbank",
  "description": "“Classic horror buffs will race through this novel that blends historical fiction with uncanny elements of the gothic. A perfect read for Halloween.” —BookPage With Lon Cheney and Boris Karloff among its characters, this sweeping and stylish love letter to the golden age of horror cinema tells the wonderful, tragic story of Maddy Ulm. It takes readers through her rise from the complicated shadows of Berlin’s first experiments with expressionist cinema to the glamorous deserts of Hollywood. For Maddy has a secret. A secret that has given her incredible insight into the soul of horror. A secret that has a terrible price as well. A young girl awakens in a hastily dug grave—vague memories of blood and fever, her mother performing a mysterious ceremony before the world went away. Germany has lost the first great war and Europe has lost millions more to the Spanish Flu epidemic. But Maddy has not only survived, she has changed. No longer does she eat, sleep, or age. No longer can she die. After taking up with a pair of street performers, she shocks and fascinates the crowds with her ability to survive outrageous traumas. But at a studio in Berlin, Maddy discovers her true film. With her intimate knowledge of fear, death, and realms beyond the living, she practically invents the modern horror genre on the spot. Before long, she travels to California and insinuates herself in Hollywood as the genius secretly behind The Phantom of the Opera, Dracula, and Frankenstein . And yet she must remain in the shadows—a chilling apparition suspended eternally between worlds. Clever, tragic, and thoroughly entertaining, Only the Dead Know Burbank introduces readers to one of the most unique, unforgettable characters in fiction.",
  "genres": [
    "Horror",
    "Fiction",
    "Historical Fiction",
    "Fantasy",
    "Novels",
    "Adult Fiction",
    "Speculative Fiction"
  ],
  "author": "Bradford Tatum",
  "average_rating": "3.44",
  "url": "https://www.goodreads.com/book/show/28694501-only-the-dead-know-burbank"
}