{
  "title": "Deadbeat Dad",
  "description": "Hard-boiled police detective Richelle Dadd is back. And in a whole world of fresh trouble. Still... well, dead as the result of a Gypsy curse, she must now face life as a single mom. Not only does Richelle have to worry about all the usual stuff—her baby’s health and well-being and keeping a roof over their heads by working a precarious dead-end job—there’s also her homicidal ex-boyfriend to fear, the father of her child, stalking them both day and night with the avowed intent of kidnapping baby Tamara. Not to mention a mysterious Russian agent hell-bent on “recruiting” Richelle into a suspiciously perfect overseas job, plus there’s a vicious Ripper-style killing to investigate, one that ties in with the Black Rose Murders that terrorized the city nearly ninety years ago. Throw in the increasingly bizarre behavior of Richelle’s ex-husband Devon and the fact that somebody’s bugged every inch of Richelle’s house—and it all adds up to a recipe for disaster… But once again, just as in the Dead Detective, the first book in the series, some very off-beat characters come to her aid. There’s her love-sick ex-detective partner Malena Ayon, for one, and the long-dead ghost cop Bull McGuinness for another. And Richelle’s equally dead new boyfriend, a dreamy World War I vet cut down in the prime of his youth. Last but hardly least, the roguish old Irish Traveler and scam artist Dicky Dadd, who claims to be Richelle’s vanished father, but who may be something else entirely; a half-Gypsy wizard sent to watch over her by the kriss, or Romani High Council. On the eve of a second ‘Ripper’ murder at a nearby theme park, Richelle and Malena must race to save an innocent victim’s life—along with that of Tamara—while battling shadowy forces both real and supernatural, as the story builds to a shattering and unexpected climax.",
  "genres": [
    "Paranormal",
    "Fantasy",
    "Mystery",
    "Audiobook",
    "Fiction",
    "Detective",
    "Thriller"
  ],
  "author": "J.R. Rain",
  "average_rating": "4.11",
  "url": "https://www.goodreads.com/book/show/28695019-deadbeat-dad"
}