{
  "title": "I'm Judging You: The Do-Better Manual",
  "description": "Comedian, activist, and hugely popular culture blogger at AwesomelyLuvvie.com, Luvvie Ajayi, serves up necessary advice for the common senseless in this hilarious book of essays. \"This truth-riot of a book gives us everything from hilarious lectures on the bad behavior all around us to the razor sharp essays on media and culture\" (Shonda Rhimes, New York Times best-selling author of Year of Yes and executive producer of Scandal and Grey's Anatomy) \"I don't know how Luvvie Ajayi got so smart so young about so many things, from feminism to social media, from the pervasiveness of rape culture to the excellence of Red Lobster's Cheddar Bay Biscuits. I'm just grateful she has chosen to share her wisdom with the rest of us...\" (Jennifer Weiner, number-one New York Times best-selling author of Best Friends Forever) \"You will love Luvvie Ajayi's I'm Judging You, and you will argue with it, laugh hysterically at it, shout 'AW HELL YES' at it, and carry parts of it in your heart to dissect or inspire... Perfect for starting important and meaty discussions about all of the topics your mama told you never to bring up at polite dinner parties.\" (Jenny Lawson, New York Times best-selling author of Furiously Happy) With over 500,000 readers a month at her enormously popular blog, AwesomelyLuvvie.com, Luvvie Ajayi has become a go-to source for smart takes on pop culture. I'm Judging You is her debut book of humorous essays that dissects our cultural obsessions and calls out bad behavior in our increasingly digital, connected lives—from the importance of the newest Shonda Rhimes television drama to serious discussions of race and media representation to what to do about your fool cousin sharing casket pictures from Grandma's wake on Facebook. With a lighthearted, razor-sharp wit and a unique perspective, I'm Judging You is the audiobook the world needs, doling out the hard truths and a road map for bringing some \"act right\" into our lives, social media, and popular culture.",
  "genres": [
    "Nonfiction",
    "Humor",
    "Essays",
    "Audiobook",
    "Feminism",
    "Self Help",
    "Memoir"
  ],
  "author": "Luvvie Ajayi",
  "average_rating": "3.69",
  "url": "https://www.goodreads.com/book/show/28696602-i-m-judging-you"
}