{
  "title": "Sofies Welt",
  "description": "Das Buch von Jostein Gaarder ist ein Juwel in der Masse der Neuerscheinungen. Ganz unscheinbar kommt es als Jugendbuch daher -- natürlich nicht irgendeines. Nimmt man es zunächst einmal abschätzend in die Hand, um darin zu blättern, erstaunt die Dicke des Wälzers. Welcher Jugendliche hat schon die Geduld und die Lust, sich durch 614 Seiten durchzukämpfen? Kaum ein Erwachsener will sich das zumuten. Noch dazu, wenn es sich um ein so trockenes Gebiet wie die Philosophie handelt. Und doch. Viele Leser werden den fetten Schmöker erst dann aus der Hand legen, wenn sie Sofies Welt erkundet haben. Geht es doch dabei um nichts geringeres als die großen Fragen der Menschheit. Sofie ist ein junges Mädchen, das im Sommer seinen 15. Geburtstag feiert und aus heiterem Himmel merkwürdige Briefe erhält, mit so komischen Fragen wie zum Beispiel: \"Wer bist du?\", \"Woher kommt die Welt?\" oder \"Gibt es ein Leben nach dem Leben?\". Aber es kommen auch Briefe an ein anderes Mädchen namens Hilde, das bei Sofie wohnen soll. Sofie macht sich auf, Hilde zu suchen und begegnet dabei Alberto Knox, der ihr einen Philosophiekurs anbietet. Dabei lernt Sofie in kürzester Zeit mehr, als in einem Jahr an der Schule. Noch dazu ist es hochinteressant, was Alberto über die Zeit der Mythen zu berichten weiß. Er erzählt von den Griechen, legt einen rasanten Streifzug durchs Mittelalter ein, beschreibt Renaissance, Barock und die wichtigsten Denker der Aufklärung und arbeitet sich an exemplarischen Beispielen wie Freud und Sartre bis zur Gegenwart durch. Sofies Welt ist kein trockenes Lehrbuch, das einen seitenlang langweilt und nur mit dem Fremdwörterbuch genießbar ist. Nein, die Philosophie wird vom Autor in eine pfiffige Geschichte verpackt, wobei er sowohl mit seinen Figuren als auch mit dem Leser während der Lektüre spielt. Ganz nebenbei erfährt man eine ganze Menge Fakten über die Anfänge des Denkens. Jostein Gaarder stellt die zentralen philosophischen Fragen einer Epoche immer in ihren historischen Kontext. So gelingt es ihm, daß der Leser am Ende des Buches nicht nur eine vergnügliche Geschichte gelesen hat, sondern auch einen roten Faden in der Hand hält, mit dem er selbst die Entwicklung der Philosophie betrachten kann, ohne von einem Wust an Fakten erschlagen zu werden, die nicht mehr zuordenbar sind. Wer Lust bekommt, das eine oder andere Kapitel nach einiger Zeit noch einmal zu lesen, dem hat es der Autor leicht gemacht, da ein umfangreiches Stichwortregister am Ende des Buches das gezielte Nachschlagen ermöglicht. Jostein Gaarder, geboren 1952, lebt in Norwegen und, wie kann es anders sein, lehrt Philosophie. Er zeigt in seinem Buch überzeugend, daß es Spaß macht, Fragen zu stellen, Antworten auszuprobieren, denn gerade die komischen Antworten in der Geschichte und die falschen Lösungsansätze in der Philosophie führen oft zu den interessanteren, neuen Fragen. Kurz gesagt: Denken macht Spaß -- man sollte es mal wieder ausprobieren. --Manuela Haselberger",
  "genres": [
    "Fiction",
    "Classics",
    "Young Adult",
    "Novels",
    "Fantasy",
    "Literature",
    "Contemporary"
  ],
  "author": "Jostein Gaarder",
  "average_rating": "3.97",
  "url": "https://www.goodreads.com/book/show/118019.Sofies_Welt"
}