{
  "title": "Time Trippers: The Nights of the Round Table",
  "description": "Two kids and their grandfather take a trip to New York to tour the city and see a Yankee's game. Not in the present, but thanks to Harry Houdini's lost magic wand that accidentally turned up on Ebay, they travel back in time to the last week of September, 1927 to see Babe Ruth hit his record-breaking 60th home run that Friday and experience life in the Jazz Age. Staying at the Algonquin Hotel, thanks to the grand daughter's love of Harpo Marx of the Marx Brothers, a regular of the hotel's world famous Round Table lunch group, they befriend him, Dorothy Parker, the poetess, critic, queen of the putdown and a thoroughly modern woman and humorist Robert Benchley. While touring the city, they run into other famous and soon-to-be-famous people, including F. Scott Fitzgerald, James Cagney, Ben 'Bugsy' Siegel and a certain Japanese Navy Midshipman to name but a few. These chance encounters and seemingly innocent trip in time unleashes a series of events that begin to spin out of control. Speakeasies, bootleggers, gangsters, kidnapping and a desperate rescue attempt lead to potential historical mayhem. The reputation of one of the greatest baseball players of all time, the outcome of World War Two and the future as we know it is in serious danger. Based on actual events, this carefully researched tale is an educational, historically accurate 'snapshot' of life in the Jazz Age highlighting manners and morals, Prohibition, Wall Street, technology, transportation, (rail, ship and air), entertainment, sports and world affairs in the last week of September, 1927, the decade when women experienced their first true liberation and when modern America was born. All the characters were or plausibly could have been in New York at that time. So take a walk back in time with them to 1927 as if you were there. Take a ride in the cab of a fast steam locomotive, visit famous ocean liners, travel to Chicago on the 20th Century Limited, fly on Northwest Airways, take a tour of the battleship New York, hang out with wisecracking Dorothy Parker, have a drink with her friend F. Scott Fitzgerald in a speakeasy and attend the two Yankees games in the golden age of baseball and enjoy other adventures on this trip in time.",
  "genres": [],
  "author": "Michael Alan Mayer",
  "average_rating": "3.91",
  "url": "https://www.goodreads.com/book/show/11802717-time-trippers"
}