{
  "title": "Lone Wolf and Cub, Vol. 24: In These Small Hands",
  "description": "Holy hand grenades! Edo is flooded, and by flooded, we mean crazy-flooded. Bridges are crumbling, rivers are washing past retaining walls, and everything in Edo is floating away, including our vengeful ronin, his foe, and his little boy. In an ironic show of samurai respect, little Cub Daigoro gets saved by the conniving Retsudo Yagyu. And proving he can lend a hand, too, Lone Wolf Ogami pulls someone to safety as well &mdash; but maybe he should have let him drown. Eventually, the two opposing master swordsmen dry off and go head to head in a sword fight of a thousand stances and couple of days length. This seems like it could be the deciding bout between the two, unless that nasty, Abeno Kaii gets in the way, and he seems to do that a lot lately.The true meaning of Bushido, the warrior code, oozes from every page of this volume. A little boy desperately attempts to drag his ronin father to safely, even if it costs him his own life; that same wandering samurai and his mortal enemy work together to save the frostbitten fingers of the same little boy, knowing they will eventually match swords again in a battle to the death; another samurai bites his own tongue, killing himself and locking a dark secret in his grave. The code of the samurai is complex and rich with irony, which is why so few carry this code through life. But as we draw closer to the conclusion of this epic struggle, the true bushi are stepping forth and showing their colors. It will truly be a fight to the finish. So, in these final days, a ronin and his young boy will visit the grave of their murdered wife and mother. It just might be the last Spring the two will share, like the many petals falling from branches.This volume contains the following stories: Child of the Fields In These Samll Hands Kaii Triumph The Last Cherry Blossoms Stone Upon Stone",
  "genres": [
    "Manga",
    "Comics",
    "Graphic Novels",
    "Fiction",
    "Historical Fiction",
    "Japan",
    "Historical"
  ],
  "author": "Kazuo Koike",
  "average_rating": "4.54",
  "url": "https://www.goodreads.com/book/show/287258.Lone_Wolf_and_Cub_Vol_24"
}