{
  "title": "The Night Villa",
  "description": "An evocative tale of intrigue, romance, and treachery, Carol Goodman’s spellbinding new novel, The Night Villa , follows the fascinating lives of two remarkable women centuries apart.The eruption of Italy’s Mount Vesuvius in A.D. 79 buried a city and its people, their treasures and secrets. Centuries later, echoes of this disaster resonate with profound consequences in the life of classics professor Sophie Chase.In the aftermath of a tragic shooting on the University of Texas campus, Sophie seeks sanctuary on the isle of Capri, immersing herself in her latest scholarly project alongside her colleagues, her star pupil, and their benefactor, the compelling yet enigmatic business mogul John Lyros.Beneath layers of volcanic ash lies the Villa della Notte–the Night Villa–home to first-century nobles, as well as to the captivating slave girl at the heart of an ancient controversy. And secreted in a subterranean labyrinth rests a cache of antique documents believed lost to the a prize too tantalizing for Sophie to resist. But suspicion, fear, and danger roam the long-untrodden tunnels and chambers beneath the once sumptuous estate–especially after Sophie sees the face of her former lover in the darkness, leaving her to wonder if she is chasing shadows or succumbing to the siren song of the Night Villa. Whatever shocking events transpired in the face of Vesuvius’s fury have led to deeper, darker machinations that inexorably draw Sophie into their vortex, rich in stunning revelations and laden with unseen menace.Praise for The Night Villa“Visit The Night Villa : Carol Goodman’ s luminous prose and superb storytelling will keep you entertained into the late hours.” —Nancy Pickard“The pleasure of a Carol Goodman novel is in her enviable command of the classical canon–and the deft way she [writes] a book that’s light enough for a weekend on the beach but literary enough for a weekend in the Hamptons.” — Chicago Tribune",
  "genres": [
    "Mystery",
    "Fiction",
    "Historical Fiction",
    "Italy",
    "Historical",
    "Suspense",
    "Mystery Thriller"
  ],
  "author": "Carol Goodman",
  "average_rating": "3.66",
  "url": "https://www.goodreads.com/book/show/2872301-the-night-villa"
}