{
  "title": "Ignite",
  "description": "Ben wants a baby, and for five hundred years, he’s been searching for the one man who can give him that: his fated mate.Dragon shifters have split souls, and when they find their other half, they bond for life. They also have the ability to impregnate the human men they mate with, and even though Ben knows that fate can’t be rushed, watching his two best friends, Maks and Dane, settle down with their own mates has him feeling restless… and impatient to finally find the man he’s waited a lifetime for.When dragon shifters from Europe attack his friends, Ben jumps at the opportunity to move overseas to help contain the threat. And he can’t help wondering if he’ll finally find what he’s been looking for while he’s there. He does… but it turns out that his mate isn't at all what he expected.Zander is a loong, a wingless Chinese dragon and the child of fated mates himself. He’s young for a dragon, and idealistically determined to change the legacy of dragonkind. He’s convinced that it’s his duty to use his dragon's power to right the wrongs against humanity that his kind have been responsible for.Zander is passionate about bringing social change to the people he calls his own, and regardless of fate’s intentions, he’s not at all sure he’s ready to be tied down to a mate and child. When his territory and everything he’s worked for is threatened, Zander will be faced with losing everything… and finally deciding what matters most.Ignite is the the third book in the Dragon’s Destiny: Fated Mates series. It is a standalone novel with a HEA ending, a satisfying epilogue, and NO CLIFFHANGERS!Series Spoilers: Although it’s not necessary to read this series in order, Ignite contains “spoilers” for the first two books in the series.Content Alert: This book is a steamy gay romance of approximately 60,000 words that contains male pregnancy, or Mpreg.",
  "genres": [
    "M M Romance",
    "Dragons",
    "Paranormal",
    "Shapeshifters",
    "Romance",
    "Fantasy",
    "Paranormal Romance"
  ],
  "author": "Wolf Specter",
  "average_rating": "4.08",
  "url": "https://www.goodreads.com/book/show/28765938-ignite"
}