{
  "title": "Embodying Forgiveness: A Theological Analysis",
  "description": "A topic unjustly neglected in contemporary theology, forgiveness is often taken to be either too easy or too difficult. On the one hand is the conception of forgiveness that views it mainly as a move made for the well-being of the forgiver. On the other hand, forgiveness is sometimes made too difficult by suggestions that violence is the only effective force for responding to injustice.In this exciting and innovative book, L. Gregory Jones argues that neither of these extreme views is appropriate and shows how practices of Christian forgiveness are richer and more comprehensive than often thought. Forgiveness, says Jones, is a way of life that carries with it distinctive concepts of love, community, confession, power, repentance, justice, punishment, remembrance, and forgetfulness.In Part 1 of Embodying Forgiveness Jones first recounts Dietrich Bonhoeffer's own struggle against the temptation to make forgiveness either too easy or too difficult in his thought and, even more, in his life and death at the hands of the Nazis. Jones then considers each of these temptations, focusing on the problem of \"therapeutic\" forgiveness and then forgiveness's \"eclipse\" by violence. Part 2 shows why a trinitarian identification of God is crucial for an adequate account of forgiveness. In Part 3 Jones describes forgiveness as a craft and analyzes the difficulty of loving enemies. He deals particularly with problems of disparities in power, impenitent offenders, and the relations between forgiveness, accountability, and punishment. The book concludes with a discussion of the possibility of certain \"unforgiveable\" situations.Developing a strong theological perspective on forgiveness throughout, Jones draws on films and a wide variety of literature as well as on Scripture and theological texts. In so doing, he develops a rich and comprehensive exploration of what it truly means to embody Christian forgiveness.",
  "genres": [
    "Theology",
    "Nonfiction",
    "Christian",
    "Philosophy",
    "Spirituality",
    "Christian Living"
  ],
  "author": "L. Gregory Jones",
  "average_rating": "4.03",
  "url": "https://www.goodreads.com/book/show/287678.Embodying_Forgiveness"
}