{
  "title": "Cate's Catastrophe",
  "description": "Clean American mail order bride historical Western romance novelette.\nThis series is about four young brides from the East Coast looking for love in the beautiful Black Hills of South Dakota. The stories are about their challenges, their test of faith, and their triumphs of discovering true love and real men.Meet Cate, she came from a well-off family in Michigan. She doesn't know any household chores as they have plenty of servants. However, she had the best education and even knows 3 different languages. When their father died, they have lost all of their wealth, and the pastor of their church suggested she marry one of the men who had written to him seeking for a wife. \nCan Cate move to a new town away from everything she knew and loved?Will Luke regret having a wife that doesn't know anything about keeping a house?Can Cate and Luke find true love in spite of their miles-apart differences?\nGrab your horse and go for a ride over to the Black Hills in the lovely, hot and dusty county of South Dakota. Hang out with the patient and understanding Luke, meet the kind and loving Oberfeld family and also get to know Cate, our heroine who's struggling to learn to cook, clean and take care of the animals in the hopes of finding true love.\n     \"This is a story about tragedy, fear, faith, triumph and true love.\"\nWhile this book is part of a series, it can definitely be read as a standalone book.Katie Wyatt:\n#1 Best Seller in New Release Romance #1 Best Seller in 90 Minute Short Reads#1 Best Seller in Frontier and Pioneer Western Fiction#1 in Western & Frontier Christian Romance#1 Best Seller in Christian Westerns\nFREE with Kindle Unlimited or Amazon Prime.\n\nA clean novelette American mail order bride Western historical romance book, click above to start enjoying now.",
  "genres": [
    "Westerns",
    "Mail Order Brides",
    "Historical",
    "Romance"
  ],
  "author": "Katie Wyatt",
  "average_rating": "4.10",
  "url": "https://www.goodreads.com/book/show/28787465-cate-s-catastrophe"
}