{
  "title": "Blood at the Root: A Racial Cleansing in America",
  "description": "A gripping tale of racial cleansing in Forsyth County, Georgia, and a harrowing testament to the deep roots of racial violence in America.Forsyth County, Georgia, at the turn of the twentieth century was home to a large African American community that included ministers and teachers, farmers and field hands, tradesmen, servants, and children. Many black residents were poor sharecroppers, but others owned their own farms and the land on which they’d founded the county’s thriving black churches.But then in September of 1912, three young black laborers were accused of raping and murdering a white girl. One man was dragged from a jail cell and lynched on the town square, two teenagers were hung after a one-day trial, and soon bands of white “night riders” launched a coordinated campaign of arson and terror, driving all 1,098 black citizens out of the county. In the wake of the expulsions, whites harvested the crops and took over the livestock of their former neighbors, and quietly laid claim to “abandoned” land. The charred ruins of homes and churches disappeared into the weeds, until the people and places of black Forsyth were forgotten.National Book Award finalist Patrick Phillips tells Forsyth’s tragic story in vivid detail and traces its long history of racial violence all the way back to antebellum Georgia. Recalling his own childhood in the 1970s and ’80s, Phillips sheds light on the communal crimes of his hometown and the violent means by which locals kept Forsyth “all white” well into the 1990s.Blood at the Root is a sweeping American tale that spans the Cherokee removals of the 1830s, the hope and promise of Reconstruction, and the crushing injustice of Forsyth’s racial cleansing. With bold storytelling and lyrical prose, Phillips breaks a century-long silence and uncovers a history of racial terrorism that continues to shape America in the twenty-first century.",
  "genres": [
    "History",
    "Nonfiction",
    "Race",
    "American History",
    "Politics",
    "Audiobook",
    "Social Justice"
  ],
  "author": "Patrick Phillips",
  "average_rating": "4.31",
  "url": "https://www.goodreads.com/book/show/28789644-blood-at-the-root"
}