{
  "title": "Shirley Jackson: A Rather Haunted Life",
  "description": "This historically engaging and relevant biography establishes Shirley Jackson as a towering figure in American literature and revives the life and work of a neglected master.Still known to millions primarily as the author of the The Lottery, Shirley Jackson (1916-1965) has been curiously absent from the mainstream American literary canon. A genius of literary suspense and psychological horror, Jackson plumbed the cultural anxiety of postwar America more deeply than anyone. Now, biographer Ruth Franklin reveals the tumultuous life and inner darkness of the author of such classics as The Haunting of Hill House and We Have Always Lived in the Castle.Placing Jackson within an American gothic tradition that stretches back to Hawthorne and Poe, Franklin demonstrates how her unique contribution to this genre came from her focus on \"domestic horror.\" Almost two decades before The Feminine Mystique ignited the women's movement, Jackson's stories and nonfiction chronicles were already exploring the exploitation and the desperate isolation of women, particularly married women, in American society. Franklin's portrait of Jackson gives us \"a way of reading Jackson and her work that threads her into the weave of the world of words, as a writer and as a woman, rather than excludes her as an anomaly\" (Neil Gaiman).The increasingly prescient Jackson emerges as a ferociously talented, determined, and prodigiously creative writer in a time when it was unusual for a woman to have both a family and a profession. A mother of four and the wife of the prominent New Yorker critic and academic Stanley Edgar Hyman, Jackson lived a seemingly bucolic life in the New England town of North Bennington, Vermont. Yet, much like her stories, which channeled the occult while exploring the claustrophobia of marriage and motherhood, Jackson's creative ascent was haunted by a darker side. As her career progressed, her marriage became more tenuous, her anxiety mounted, and she became addicted to amphetamines and tranquilizers. In sobering detail, Franklin insightfully examines the effects of Jackson's California upbringing, in the shadow of a hypercritical mother, on her relationship with her husband, juxtaposing Hyman's infidelities, domineering behavior, and professional jealousy with his unerring admiration for Jackson's fiction, which he was convinced was among the most brilliant he had ever encountered.Based on a wealth of previously undiscovered correspondence and dozens of new interviews, Shirley Jackson―an exploration of astonishing talent shaped by a damaging childhood and turbulent marriage―becomes the definitive biography of a generational avatar and an American literary giant.",
  "genres": [
    "Biography",
    "Nonfiction",
    "Biography Memoir",
    "Memoir",
    "Horror",
    "History",
    "Writing"
  ],
  "author": "Ruth Franklin",
  "average_rating": "4.02",
  "url": "https://www.goodreads.com/book/show/28789677-shirley-jackson"
}