{
  "title": "The Hidden Alpha",
  "description": "This complete edition contains all 3 books of The Hidden Alpha. It’s the full story of Amelia, raised and educated to become a shifter bride, and her hot fox-shifter, Seth. No cliffhangers! The Hidden Alpha is a sequel to Sold to the Alpha (BBW Wolf-Shifter Romance). Although it can be read as a standalone, it is highly recommended that you start with Sold to the Alpha to get familiar with the universe. Find the complete edition here: http://www.amazon.com/gp/product/B014...  Sexy, sassy and intelligent, Amelia is one of the few shifter-brides who have nothing against the peace treaty that was signed a century ago between humans and shape-shifters. She was in an orphanage when the headmistress of the Alma Venus Boarding School decided to take her in and prepare her to become the bride of a fox-shifter. The year she turned 18, Amelia became eligible to be sold to the highest bidder, and there was nothing she wanted more.  Seth of Clan Sylfur is in search of a bride for his future Alpha. Roman Sylfur, the Alpha of the most powerful fox clan in the world, is dying and his son, Blake, will soon take his place. The second he sees Amelia, Seth knows she is the perfect woman… for him, not for Blake.  Amelia is torn between her feelings for the hot, hunky Seth and her responsibility as a shifter-bride. But how could she stay away from the Beta fox when her mysterious husband won’t even bother to see her and welcome her to her new home? How could she possibly be faithful to a stranger? Her husband is hiding something from her, and that makes Amelia run to Seth. What they’re doing is dangerous, but she feels safe in his arms.  This books contains explicit language and sizzling hot scenes that might set your Kindle on fire. Intended for readers 18+.",
  "genres": [
    "Shapeshifters",
    "Romance",
    "Paranormal Romance",
    "Paranormal",
    "Adult"
  ],
  "author": "Cara Wylde",
  "average_rating": "4.33",
  "url": "https://www.goodreads.com/book/show/28789604-the-hidden-alpha"
}