{
  "title": "Mary Astor's Purple Diary: The Great American Sex Scandal of 1936",
  "description": "In 1965, a young, up-and-coming illustrator by the name of Edward Sorel was living in a $97-a-month railroad flat on Manhattan’s Upper East Side. Resolved to fix up the place, Sorel began pulling up the linoleum on his kitchen floor, tearing away layer after layer until he discovered a hidden treasure: issues of the New York Daily News and Daily Mirror from 1936, each ablaze with a scandalous child custody trial taking place in Hollywood and starring the actress Mary Astor. Sorel forgot about his kitchen and lost himself in the story that had pushed Hitler and Franco off the front pages.At the time of the trial, Mary Astor was still only a supporting player in movies, but enough of a star to make headlines when it came out that George S. Kaufman, then the most successful playwright on Broadway and a married man to boot, had been her lover. The scandal revolved around Mary’s diary, which her ex-husband, Dr. Franklyn Thorpe, had found when they were still together. Its incriminating contents had forced Mary to give up custody of their daughter in order to obtain a divorce. By 1936 she had decided to challenge the arrangement, even though Thorpe planned to use the diary to prove she was an unfit mother. Mary, he claimed, had not only kept a tally of all her extramarital affairs but graded them—and he’d already alerted the press. Enraptured by this sensational case and the actress at the heart of it, Sorel began a life-long obsession that now reaches its apex.Featuring over sixty original illustrations, Mary Astor's Purple Diary narrates and illustrates the travails of the Oscar-winning actress alongside Sorel’s own personal story of discovering an unlikely muse. Throughout, we get his wry take on all the juicy details of this particular slice of Hollywood Babylon, including Mary's life as a child star—her career in silent films began at age fourteen—presided over by her tyrannical father, Otto, who \"managed\" her full-time and treated his daughter like an ATM machine. Sorel also animates her teenage love affair with probably the biggest star of the silent era, the much older John Barrymore, who seduced her on the set of a movie and convinced her parents to allow her to be alone with him for private \"acting lessons.\"Sorel imbues Mary Astor's life with the kind of wit and eye for character that his art is famous for, but here he also emerges as a writer, creating a compassionate character study of Astor, a woman who ultimately achieved a life of independence after spending so much of it bullied by others.Featuring ribald and rapturous art throughout, Mary Astor's Purple Diary is a passion project that becomes the masterpiece of one of America’s greatest illustrators.",
  "genres": [
    "Nonfiction",
    "Biography",
    "History",
    "Film",
    "Graphic Novels",
    "Memoir",
    "Comics"
  ],
  "author": "Edward Sorel",
  "average_rating": "3.54",
  "url": "https://www.goodreads.com/book/show/28789689-mary-astor-s-purple-diary"
}