{
  "title": "Wunderkind",
  "description": "Life in Sofia, Bulgaria, in the late 1980s is bleak and controlled. The oppressive Communist regime bears down on all aspects of people’s lives much like the granite sky overhead. In the crumbling old building that hosts the Sofia Music School for the Gifted, inflexible and unsentimental apparatchiks drill the students like soldiers—as if the music they are teaching did not have the power to set these young souls on fire.Fifteen-year-old Konstantin is a brash, brilliant pianist of exceptional sensitivity, struggling toward adulthood in a society where honest expression often comes at a terrible cost. Confined to the Music School for most of each day and a good part of the night, Konstantin exults in his small rebellions—smoking, drinking, and mocking Party pomp and cant at every opportunity. Intelligent and arrogant, funny and despairing, compassionate and cruel, he is driven simultaneously by a desire to be the best and an almost irresistible urge to fail. His isolation, buttressed by the grim conventions of a loveless society, prevents him from getting close to the mercurial violin virtuoso Irina, but also from understanding himself.Through it all, Konstantin plays the piano with inflamed he is transported by unparalleled explorations of Chopin, Debussy, and Bach, even as he is cursed by his teachers’ numbing efforts at mind control. Each challenging piano piece takes on a life of its own, engendering exquisite new revelations. A refuge from a reality Konstantin detests, the piano is also what tethers him to it. Yet if he can only truly master this grandest of instruments—as well as his own self-destructive urges—it might just secure his passage out of this broken country.Nikolai Grozni—himself a native of Bulgaria and a world-class pianist in his youth—sets this electrifying portrait of adolescent longing and anxiety against a backdrop of tumultuous, historic world events. Hypnotic and headlong, Wunderkind gives us a stunningly urgent, acutely observed, and wonderfully tragicomic glimpse behind the Iron Curtain at the very end of the Cold War, reminding us of the sometimes life-saving grace of great music.",
  "genres": [
    "Music",
    "Bulgaria",
    "Fiction",
    "Bulgarian Literature",
    "Historical Fiction",
    "Literary Fiction",
    "Unfinished"
  ],
  "author": "Nikolai Grozni",
  "average_rating": "4.03",
  "url": "https://www.goodreads.com/book/show/11804258-wunderkind"
}