{
  "title": "In Such Good Company: Eleven Years of Laughter, Mayhem, and Fun in the Sandbox",
  "description": "In this New York Times bestseller, comedy legend Carol Burnett tells the hilarious behind-the-scenes story of her iconic weekly variety series, The Carol Burnett Show. In In Such Good Company, Carol Burnett pulls back the curtain on the twenty-five-time Emmy-Award winning show that made television history, and she reminisces about the outrageously funny and tender moments that made working on the series as much fun as watching it. Carol delves into little-known stories of the guests, sketches and improvisations that made The Carol Burnett Show legendary, as well as some favorite tales too good not to relive again. While writing this book, Carol rewatched all 276 episodes and screen-grabbed her favorite video stills from the archives to illustrate the chemistry of the actors and the improvisational magic that made the show so successful. Putting the spotlight on everyone from her costars to the impressive list of guest stars, Carol crafts a lively portrait of the talent and creativity that went into every episode. With characteristic wit and incomparable comic timing, she details hiring Harvey Korman, Vicki Lawrence, Lyle Waggoner, and Tim Conway; shares anecdotes about guest stars and close friends, including Lucille Ball, Roddy Mcdowell, Jim Nabors, Bernadette Peters, Betty Grable, Steve Lawrence, Eydie Gorme, Gloria Swanson, Rita Hayworth, and Betty White; and gives her take on her favorite sketches and the unpredictable moments that took both the cast and viewers by surprise.This book is Carol's love letter to a golden era in television history through the lens of her brilliant show. Get the best seat in the house for \"eleven years of laughter, mayhem, and fun in the sandbox.\"",
  "genres": [
    "Nonfiction",
    "Memoir",
    "Biography",
    "Humor",
    "Audiobook",
    "Biography Memoir",
    "Comedy"
  ],
  "author": "Carol Burnett",
  "average_rating": "3.84",
  "url": "https://www.goodreads.com/book/show/28796789-in-such-good-company"
}