{
  "title": "Ballad of the Whiskey Robber: A True Story of Bank Heists, Ice Hockey, Transylvanian Pelt Smuggling, Moonlighting Detectives, and Broken Hearts",
  "description": "Ladies and gentlemen, meet Attila Ambrus, the Robin Hood of Eastern Europe. He's the one-time pelt smuggler, professional hockey goalie (possibly the worst in the sport's history), pen salesman, Zamboni driver, gravedigger, church painter, roulette addict, building superintendent, whiskey drinker, and native of Transylvania who's decided that the best thing to do with his time is to rob as many banks as possible.His rival: Lajos Varjú, the Inspector Clouseau of the Iron Curtain, whose knowledge of police work comes from Hungarian-dubbed episodes of Columbo. His deputy is nicknamed \"Mound of Asshead\" because of his propensity for crashing police cars. His forensics expert, known as \"Dance Instructor\" for his lucrative side career teaching ballet, wears a top hat and tails on the job.Welcome to Julian Rubinstein's uproariously funny and unforgettable account of crime in the heart of the new Europe. With a supporting cast that includes car wash owners, exotic dancers, drunk army generals, cocaine-snorting Hungarian rappers, the Johnnie Cochran of Budapest, and a hockey team that seems to spend as much time breaking the law as it does practicing, Ballad of the Whiskey Robber gives us the most charming outlaw-hero since the Sundance Kid—and the Sundance Kid didn't play hockey.As the Eastern bloc slips off its communist skin and replaces it with leopard-skin hot pants, Ballad of the Whiskey Robber is here to screw in the pink lightbulbs. Part Unbearable Lightness of Being, part Pink Panther, and part Slap Shot, Julian Rubinstein's tale is a spectacular literary debut—and a story so outrageous that it could only be true.",
  "genres": [
    "Nonfiction",
    "True Crime",
    "History",
    "Biography",
    "Crime",
    "Humor",
    "Audiobook"
  ],
  "author": "Julian Rubinstein",
  "average_rating": "4.01",
  "url": "https://www.goodreads.com/book/show/28805.Ballad_of_the_Whiskey_Robber"
}