{
  "title": "Unspoken Words",
  "description": "Camryn Townsend and Jamieson Banks have been the best of friends forever. Every important memory includes the other. From learning to play catch and first kisses, high school dances and college acceptances, they’ve always been there for one another. Without realizing it, the love they’ve always felt for one another evolves into something more. But when Camryn moves across country, they leave the words that could risk their lifelong friendship unspoken.Life goes on, and years go by before work brings Camryn back home. Opportunity smiles on them and both realize this may be their only chance. A chance for two friends to make new memories, and risk what they’ve always had to discover a love beyond their imaginations. To have everything their heart desires. But when the unthinkable happens, it threatens to shatter the delicate new connections Jamie and Camryn have made.When two lifelong friends are put to the test, can they come out on the other side as lifelong partners … or will those words forever remain unspoken?***Content Warning***This book contains a dark scene with graphic violence which may be a trigger. Reader discretion is advised.Editorial Reviews\"Beautifully written, emotional and so realistic. I loved it.\"  ~ Katy Evans, New York Times and USA Today bestselling author“H.P. Davenport delivers a beautiful, heart-warming, friends to lovers story in her debut novel, Unspoken Words, with a touch of suspense that causes you to tear through the pages.”  ~ Michelle Lynn, USA Today bestselling author\"Camryn and Jamieson's story will take up a part of my heart forever. H.P. Davenport weaves her words into gallant emotion that literally pours off every page and straight into your soul. I laughed out loud, winced and cried and grew to love not only these two characters, but the whole cast, within moments of opening this book. This love story will raise the bar for every one you read after it. Stunning.\"  ~ Michelle Kemper Brownlow, Author“This is the debut book of H.P. Davenport. And I have to say she really knows how to pull out the emotional roller coaster for her first book! This book has it all. Swoon worthy moments, hot mess moments, and moments where you cannot put the book down because you need to know what is going to happen next.”  ~ Karrie, Panty Dropping Book Blog  “H.P. Davenport has taken my heart on a rollercoaster ride of emotions.”  ~ Tami, The Book Enthusiast",
  "genres": [
    "Romance",
    "New Adult",
    "Contemporary",
    "Friends To Lovers",
    "Contemporary Romance"
  ],
  "author": "H.P. Davenport",
  "average_rating": "4.11",
  "url": "https://www.goodreads.com/book/show/28801660-unspoken-words"
}