{
  "title": "Big Bear Mountain - The Complete Series",
  "description": "*** The entire Big Bear Mountain series in one huge, action packed volume! ***\n\nBig Bear Mountain, where big, sexy, bear-shifter mountain men find the sassy, curvy girls who can handle them.\nIf you like sexy bear shifters, steamy love scenes, page turning suspense, plenty of action and adventure with a dash of mystery, then this full length, stand-alone bear shifter novel of 66,000 words is for you!Bear RescueHigh Mountain Ranger, Jarrad, isn’t looking for a mate. Women are a complete mystery to him. Every time he opens his mouth to speak to one, it leads to a big misunderstanding. Or a huge argument.But his bear gets other ideas after they rescue a feisty and spirited city girl from the slopes of the treacherous and unforgiving Big Bear Mountain.Curvy, junior executive, Elle needs to get away from the city in a hurry. A big hurry. Finding out her boss is a money laundering crook doesn’t leave her with too many options, especially when the cartel find out how much she knows about their operation.They’re coming after her and a quick getaway into the mountains seems like a pretty good plan.When her car is hanging over the edge of a cliff, though – not so much.Bear JusticeBig Bear Mountain erupts when a blazing female PI clashes with the hot-as-sin town sheriff.Medically discharged after being injured during a covert operation, Jack Raven tries to adjust to post army life as the Sheriff of Big Bear Mountain. His bear is quite at home, but in his human form, Jack’s finding small town law enforcement challenging, to say the least.And challenges don’t come much greater than the audacious and bossy private investigator, Cassie Hunter who has come to town to claim her inheritance while conducting a covert operation of her own.If Jack isn’t finding it hard enough to deal with her, his bear has locked sights on the curvaceous and outlandish woman as his mate.Assassins, bombs, kidnappers, guns and a mystery more than a century old – that’s what Cassie brings to Jack’s quiet mountain town.Bear AmbushFormer Navy pilot Lt Jim ‘Spider’ Webb has been far too busy saving lives on Big Bear Mountain to look for a mate for his bear. But finding that elusive fated mate means everything to the bear.Erin Parker is on a mission. The curvy, sassy reporter is snooping around the mountain for a big career making scoop. She’s in the wrong place, for sure and it’s definitely the wrong time.The cartel is back and this time they’ve come in force, hell bent on vengeance.Can Spider save his fellow shifters and protect Erin from the wrath of the cartel? Or is there more to this inquisitive and high-spirited girl than meets the eye?Unexpected Mate (Dragon Shifter Romance)*** A 20,000 word standalone bonus story with no cliffhanger ***#1 Best Seller in Superhero Fantasy eBooksDeclanDisgraced and outcast from his dragon shifter clan for refusing to enter into an arranged coupling, Declan roams the city as a motorcycle vigilante; dispatching ruthless justice as only a dragon can. A dragon needs more to do than just guard his enormous treasure hoard.Declan has given up on ever finding his perfect mate, his princess. But sometimes fate takes a hand in unexpected ways and in unexpected places. OliviaA sassy, curvy girl who’s been fooled once already by an enigmatic and handsome bad-boy biker who told her he loved her and adored her soft curves.",
  "genres": [
    "Paranormal"
  ],
  "author": "Bianca  James",
  "average_rating": "4.29",
  "url": "https://www.goodreads.com/book/show/28794676-big-bear-mountain---the-complete-series"
}