{
  "title": "Faulty Trilogy Complete Bundle: Faulty Family / Faulty Love / Faulty Fate",
  "description": "Get the complete bundle of Kaleb Kilton's Faulty Trilogy, which has been hailed as \"unique, mysterious, erotic, romantic, and addictively entertaining.\"This bundle includes the following FAULTY FAMILNina is a gorgeous stay-at-home MD, who gave up her medical career to be a dedicated full-time mother to her children. So was everyone led to believe. She has secretly been resenting the lost dreams and meaning for life as her grown children leave home to go to school. The new-found freedom and a new addition to the family, an international student matched to be her son's college roommate, introduce passion and possibilities in the otherwise stale and dull life in Edina, MN. Can she explore and rekindle the thrills of her youth and reclaim her life force without risking her comfortable and secure life?When Daniel arrives in America to begin his undergraduate education, he was looking to break from an upbringing in isolation at a missionary school, and maybe even learn something - or anything at all - about his father, the international man of mystery. He soon discovers America surpasses his expectations as he is introduced to the full range of freedoms afforded by his new environment. A faulty family he ran away from is substituted with a host family of peculiar benefits. Meanwhile a new revelation threatens to shatter his treasured hopes about his father, risking everything he has gained, tasted, and loved in the new country.FAULTY LOVEThe forbidden love journey continues as Nina and Danny discover freedom and love come at a high cost that neither of them would anticipate. They must wrestle with adversities at home and beyond to keep the searing hope for revival and their flaming love alive.The cast of colorful characters that surround them experience their own journey of love and intimacy with all its bliss and blemishes. Secrets are revealed and hidden agendas uncovered. Individual and political stakes are high as conflicting motivations crash in a battle of will. Each character experiences love inspired by a unique desire for self-exploration and discovery culminating into a mixture of human drama, heightened suspense, and intrigue.FAULTY FATEThe sprawling forbidden love story of the Faulty Trilogy concludes with this epic tale of family, love, and fate.Nina finds herself trapped in life before she meets the dazzling international student, Danny, setting off an exploration of forbidden love that changes both their lives. Theirs isn't the only love story. A web of fortuitous encounters result in intriguing and complex relationships interlinking those around them.A gripping, suspenseful, passionate, emotional, and romantic journey ensues. Family, loyalty, and fate are tested in the pursuit of love. A mix of political intrigue and conflicting love interests come in the way posing formidable challenges that neither Nina nor Danny would anticipate. To keep their love alive, they must strengthen their commitment to each other as others around them pursue their own self-interest.When it seems that they have what it takes to overcome all obstacles, conspiracies rage instilling fear of losing one another and concern about the future. Can they all find their happily ever after without losing all?Get ready for a suspenseful, wild, and steamy ride!Happy reading!",
  "genres": [],
  "author": "Kaleb Kilton",
  "average_rating": "4.80",
  "url": "https://www.goodreads.com/book/show/28803111-faulty-trilogy-complete-bundle"
}