{
  "title": "Type 2 Diabetes The Owner's Manual",
  "description": "Type 2 Diabetes The Owner's Manual can be your step-by-step guide on how to control your disease.  Let this book help you manage Type 2 Diabetes rather than letting the disease manage you.Daryl Wein discovered he was among the millions of patients with Type 2 Diabetes while studying to become a Physician Assistant. That's when he found out that, despite Type 2 Diabetes making up the vast majority of cases, most of the reading material he could find was most appropriate for patients with Type 1 Diabetes.  Type 2 Diabetes The Owner's Manual is his way of fixing that.This handbook is an easy-to-read guide on how to manage your blood sugar primarily through diet.  It is written clearly and concisely, explaining the difference between the two diseases in a way that is easy to grasp.  Wein includes concrete examples of what to eat and what to avoid.  He talks about the importance of exercise and provides information about medicines in a way that the layman can comprehend without needing to know medical terminology.The book also includes a very useful question-and-answer section that covers a variety of specifics about Type 2 Diabetes to help you make sense of it all.Wein knows about the frustration and fear diabetics feel, because he's been there.  As he explains in the book, when he experienced blurred vision and other health problems while studying to become a Physician Assistant, he discovered that he was among the millions diagnosed each year with Type 2 Diabetes.  \"There was no mistake: I was now a diabetic!\" he writes.  \"I sat down and started crying, not something I would ordinarily allow myself to do.\"  He goes on to describe how a mentor told him that diabetes can usually be managed easily.  He made sure to explain that failing to control it can lead to serious health problems including blindness, kidney failure, and limb amputations.  He offered hope.  Wein's book offers the same message of hope, along with a somber reminder that failing to control diabetes can lead to premature death.  He provides readers with the right information to help make sure they understand that this doesn't have to happen to them.\"My intent in writing this book is to finally provide a source of information geared specifically for you and me, along with the millions of others with this disease and the many millions who have it but don't yet know it,\" he writes.  \"This book is designed primarily to provide clear guidance for patients.\"  You don't have to be a health expert to manage the disease.",
  "genres": [
    "Health",
    "Cookbooks"
  ],
  "author": "Daryl Wein",
  "average_rating": "4.35",
  "url": "https://www.goodreads.com/book/show/28797379-type-2-diabetes-the-owner-s-manual"
}