{
  "title": "Love Ain't No Soap Opera",
  "description": "A Christian Contemporary Romance seasoned with humor and Southern charm.It's Mayberry meets Daytime Drama...Selah Morgan, Southern screw-up, is having a hard time facing the plus-sized woman in the mirror or believing that God cares about her or her life. The thirty-something computer consultant longs for the passion and excitement enjoyed by the young, rich, and skinny on her favorite daytime drama, The Winds of Change. Selah is stuck in her hick hometown, Shadybrook, Virginia, working out of a closet in her parents' dilapidated house, losing clients, and trying to avoid her childhood bullies and her gambling father's bill collectors. Rather than risk a tempestuous marriage like her parents' or date the scary rednecks who troll their family diner, Good Company, she vows to spend her life single, showering her love on her dog and daydreaming about soap bad boy, Cane Ashton. At the soap's fan club weekend in New York City, Selah stumbles into her dream job as SoaperFan, a stunt to save the soon-to-be-canceled show. Selah takes the job despite her guilt about leaving her ailing momma at home to clean up her father's messes. Momma warns her that real life and real love ain't no soap opera where a billionaire tycoon whisks you away in his private jet and makes your dreams come true. But, when she meets Cane, those soulful eyes, that six-pack, and that smile melt her defenses like Hershey's ice cream under a molten flow of hot fudge in the diner. Cane is being eaten alive by guilt. Years ago, he shattered his family and his burgeoning NFL career, collateral damage from his deadly mistakes. He's reinvented himself as a soap star on a daytime drama and, at thirty-five, is ready to leave his playboy past behind and start a family with someone real. Selah Morgan, all curves and laughter, is a breath of fresh air. In fifteen years in show business, he has never met anyone like the klutzy SoaperFan, whose sweetness and Southern drawl are as big as her hair.In an industry that idealizes physical beauty, Selah is out of her league. She must draw on her Southern charm and hometown values to turn the head of the brooding heartthrob and win over his catty co-star and Selah's cranky head writer boss. As her confidence in herself and God's love for her grows, she discovers that true beauty isn't found in the mirror. But will her lingering insecurities, her meddling Momma, and Cane's dark secrets threaten their chance at love in the afternoon? When this soap fan gets her fantasy soap hunk, will he live up to her fantasies or is he the kind of man Momma warned her about?Love Ain't No Soap Opera will appeal to women of all ages, especially those from their teens to their thirties who struggle with their self-worth and body image and wonder if they'll ever be good enough or hot enough for Prince Charming. ***For fans of daytime drama--a dream come true.******Fans of Kristin Billerbeck & Meg Cabot will enjoy the humor, romance, & pop culture references in Love Ain't No Soap Opera***",
  "genres": [],
  "author": "Connie Kuykendall",
  "average_rating": "4.19",
  "url": "https://www.goodreads.com/book/show/28803996-love-ain-t-no-soap-opera"
}