{
  "title": "One Good Turn / Case Histories/  When Will There Be Good News?",
  "description": "This box set contains three of Kate Atkinson's bestselling books, now dramatised for the BBC as Case Histories and starring Jason Isaacs as Jackson Brodie.Case  Cambridge is sweltering, during an unusually hot summer. To Jackson Brodie, former police inspector turned private investigator, the world consists of one accounting sheet - Lost on the left, Found on the right - and the two never seem to balance.Surrounded by death, intrigue and misfortune, his own life haunted by a family tragedy, Jackson attempts to unravel three disparate case histories and begins to realize that in spite of apparent diversity, everything is connected...One Good  It is summer, it is the Edinburgh Festival. People queuing for a lunchtime show witness a road-rage incident - a near-homicidal attack which changes the lives of everyone involved. Jackson Brodie, ex-army, ex-police, ex-private detective, is also an innocent bystander - until he becomes a murder suspect.As the body count mounts, each member of the teeming Dickensian cast's story contains a kernel of the next, like a set of nesting Russian dolls. They are all looking for love or money or redemption or but what each actually discovers is their own true self.When Will There Be Good News?:In a quiet corner of rural Devon, a six-year-old girl witnesses an appalling crime. Thirty years later the man convicted of the crime is released from prison.In Edinburgh, sixteen-year-old Reggie, wise beyond her years, works as a nanny for a G.P. But her employer has disappeared with her baby, and Reggie seems to be the only person who is worried.Across town, Detective Chief Inspector Louise Monroe is also looking for a missing person, unaware that hurtling towards her is a former acquaintance - Jackson Brodie - himself on a journey that is about to be fatally interrupted.",
  "genres": [],
  "author": "Kate Atkinson",
  "average_rating": "4.12",
  "url": "https://www.goodreads.com/book/show/11805107-one-good-turn-case-histories-when-will-there-be-good-news"
}