{
  "title": "Litany of the Long Sun",
  "description": "Litany of the Long Sun contains the full texts of Nightside the Long Sun and Lake of the Long Sun, that together make up the first half of The Book of the Long Sun. This great work is set on a huge generation starship in the same future as the classic Book of the New Sun.Gene Wolfe's Book of the Long Sun tetralogy ranks as one of the greatest literary achievements of 20th-century science fiction. Litany of the Long Sun, comprising the first two books in the series, is suffused with looming transcendence and theophany. Wolfe takes familiar speculative fiction tropes and embeds them in a tale so complex and wonderful that readers may find themselves wondering whether what they're reading is science fiction, fantasy, or something different altogether. Or whether it matters.The story of Patera Silk, a devout priest whose destiny is wrapped up with the gods he serves, takes place within the Whorl, a vast, cylindrical starship that has traveled for generations and is crumbling into disrepair. Through a strange and amazing series of events, Silk finds himself descending to base thievery, running afoul of a notorious crime lord, befriending a cyborg soldier, and encountering at least one of the gods of Mainframe.But when Silk encounters the Outsider, who may be a God of a very different sort, all his beliefs are shaken to the core, and his life swiftly takes a messianic turn. In a rousing climax, Silk becomes the reluctant leader of a political rebellion against the corrupt Ayuntamiento, who rule the city-state of Viron.It is not necessary to have read Wolfe's Book of the New Sun series, which takes place many centuries earlier, to enjoy the Long Sun novels, but keen-eyed readers will find many clues as to the origin of the Whorl and its gods in those stories. Further, although Wolfe's reputation for literary precision and trickery is well deserved, the Long Sun series (which continues in Epiphany of the Long Sun) is one of the more accessible places to start appreciating the author's treasures.--Therese Littleton",
  "genres": [
    "Science Fiction",
    "Fantasy",
    "Fiction",
    "Science Fiction Fantasy",
    "Novels",
    "Literature",
    "Speculative Fiction"
  ],
  "author": "Gene Wolfe",
  "average_rating": "4.25",
  "url": "https://www.goodreads.com/book/show/288132.Litany_of_the_Long_Sun"
}