{
  "title": "Walk Through Walls: A Memoir",
  "description": "“I had experienced absolute freedom—I had felt that my body was without boundaries, limitless; that pain didn’t matter, that nothing mattered at all—and it intoxicated me.”In 2010, more than 750,000 people stood in line at Marina Abramović’s MoMA retrospective for the chance to sit across from her and communicate with her nonverbally in an unprecedented durational performance that lasted more than 700 hours. This celebration of nearly fifty years of groundbreaking performance art demonstrated once again that Marina Abramović is truly a force of nature.The child of Communist war-hero parents under Tito’s regime in postwar Yugoslavia, she was raised with a relentless work ethic. Even as she was beginning to build an international artistic career, Marina lived at home under her mother’s abusive control, strictly obeying a 10 p.m. curfew. But nothing could quell her insatiable curiosity, her desire to connect with people, or her distinctly Balkan sense of humor—all of which informs her art and her life. The beating heart of Walk Through Walls is an operatic love story—a twelve-year collaboration with fellow performance artist Ulay, much of which was spent penniless in a van traveling across Europe—a relationship that began to unravel and came to a dramatic end atop the Great Wall of China.Marina’s story, by turns moving, epic, and dryly funny, informs an incomparable artistic career that involves pushing her body past the limits of fear, pain, exhaustion, and danger in an uncompromising quest for emotional and spiritual transformation. A remarkable work of performance in its own right, Walk Through Walls is a vivid and powerful rendering of the unparalleled life of an extraordinary artist.",
  "genres": [
    "Art",
    "Nonfiction",
    "Memoir",
    "Biography",
    "Biography Memoir",
    "Audiobook",
    "Autobiography"
  ],
  "author": "Marina Abramović",
  "average_rating": "4.56",
  "url": "https://www.goodreads.com/book/show/28814918-walk-through-walls"
}