{
  "title": "The Quilter's Kitchen",
  "description": "In The Quilter’s Kitchen, Anna Del Maso revisits the kitchens of Elm Creek Manor, past and present. As she records beloved recipes and creates original dishes seasoned with love, she rediscovers how the gifts of the table bring friends and family closer than ever.Anna Del Maso had known that she wanted to be a chef since she was in the seventh grade. “Somehow everything in my life ends up being about food,” she realizes, as she begins the latest of her food-themed quilts. Her twin passions have converged in a brand-new position as head chef for Elm Creek Quilts, Waterford, Pennsylvania’s popular quilting retreat.As she joins the circle of quilters at historic Elm Creek Manor, Anna is eager to preserve the manor’s culinary heritage, dating to 1858, while also celebrating the new favorites of their many guests. Yet as Master Quilter Sylvia Bergstrom Compson well knows, the manor’s kitchen, last updated in the 1940s, can’t create food that compares to the state-of-the-art quilting instruction for which Elm Creek Quilts is renowned.A full renovation of the kitchen must be completed by the start of the new camp season. Though the task is daunting, Anna is assured in her belief that “A kitchen is the heart of a home.” As she and Sylvia begin to dismantle the old to make way for the new, Sylvia’s reminiscences remind them both of just how many of the manor’s traditions have involved food and celebrations. Whether the feast is one of the holiday menus prepared and enjoyed by generations of Bergstroms, or one of the Welcome Banquets and Farewell Breakfasts that have become hallmarks of Elm Creek Quilt Camp, there is a story for every recipe, and a recipe for every story.",
  "genres": [
    "Fiction",
    "Quilting",
    "Chick Lit",
    "Cookbooks",
    "Cooking",
    "Food",
    "Historical Fiction"
  ],
  "author": "Jennifer Chiaverini",
  "average_rating": "3.51",
  "url": "https://www.goodreads.com/book/show/2881228-the-quilter-s-kitchen"
}