{
  "title": "Play It Loud: An Epic History of the Style, Sound, & Revolution of the Electric Guitar",
  "description": "The inspiration for the Play It Loud exhibition at the Metropolitan Museum of Art \"Every guitar player will want to read this book twice. And even the casual music fan will find a thrilling narrative that weaves together cultural history, musical history, race, politics, business case studies, advertising, and technological discovery.\" --Daniel Levitin, Wall Street JournalFor generations the electric guitar has been an international symbol of freedom, danger, rebellion, and hedonism. In Play It Loud, veteran music journalists Brad Tolinski and Alan di Perna bring the history of this iconic instrument to roaring life. It's a story of inventors and iconoclasts, of scam artists, prodigies, and mythologizers as varied and original as the instruments they spawned.Play It Loud uses twelve landmark guitars--each of them artistic milestones in their own right--to illustrate the conflict and passion the instruments have inspired. It introduces Leo Fender, a man who couldn't play a note but whose innovations helped transform the guitar into the explosive sound machine it is today. Some of the most significant social movements of the twentieth century are indebted to the guitar: It was an essential element in the fight for racial equality in the entertainment industry; a mirror to the rise of the teenager as social force; a linchpin of punk's sound and ethos. And today the guitar has come full circle, with contemporary titans such as Jack White of The White Stripes, Annie Clark (aka St. Vincent), and Dan Auerbach of The Black Keys bringing some of the earliest electric guitar forms back to the limelight.Featuring interviews with Les Paul, Keith Richards, Carlos Santana, Eddie Van Halen, Steve Vai, and dozens more players and creators, Play It Loud is the story of how a band of innovators transformed an idea into a revolution.",
  "genres": [
    "Music",
    "Nonfiction",
    "History",
    "Audiobook",
    "Art",
    "Cultural"
  ],
  "author": "Brad Tolinski",
  "average_rating": "4.27",
  "url": "https://www.goodreads.com/book/show/28814725-play-it-loud"
}