{
  "title": "Positive Thinking: 7 Secret Words That Unlock Happiness",
  "description": "They Can Change Your Destiny. You don't have to wait for the secret of happiness or waste time trying to stumble on happiness. Think positive thinking is tough or a waste of time? These 7 secret words turn positive thinking into happiness... immediately.Yearning for happiness is at the root of most pursuits in life. What would you be doing this instant in your life right now if you were living the life you imagined? If you were happy? What stands in the way of that life and your path to true happiness? Approval, courage, time, excuses, fear or is it something deeper? Inside is the way to give YOUR self help.A certain kind of positive thinking moves the secret of happiness out of a single core love. In fact, love, peace and happiness are tied together. You cannot find inner peace without love. You cannot find authentic love without also finding inner peace and happiness.What if you felt a deep love for yourself and for life that awakened your ability to achieve the things you want in your life? This particular way of positive thinking can do that.Not just the love for yourself you show the world to “prove” you love yourself. You know, “the mask.” Rather, a complete, all-encompassing, unconditional love for yourself and life that resonates deep in your soul.That inner critic that looks for your flaws in the mirror instead of the wonderfully beautiful unique person you are. What if the little voice didn't just nag, nag, nag all the time giving you all the reasons you are not worthy of love. What if you knew how to love that little voice into silence? It can be difficult to keep positive thoughts going and practice positive thinking if at your core you don't genuinely love yourself.Are you trying so hard to be perfect in everyone's eyes that you have lost and buried yourself and maybe your dreams?You will discover step-by-step details of two simple techniques you can use to not only feel loved and stop the critical voice but to love it into silence and learn to love yourself infinitely. Those seven secret words changed both their lives. Now they can change yours.Get Instantly Inspired. Start reading \"Positive Thinking With The 7 Secret Words That Unlock Happiness\" now and in less than an hour you can start experiencing the joy of not only the gift of the seven words, but also the \"Instant Happiness Technique.\"Positive Thinking Happiness, Positive Thinking and Happiness, Positive Thinking, Happiness, Self Help Books, Self Help Books for Women, Love Yourself, Spontaneous Happiness, Depression Self Help, Self Help, Self Help for Women, Secret of Happiness, Power of Positive Thinking, Positive Thinking for Women",
  "genres": [],
  "author": "P.J. Wilder",
  "average_rating": "4.22",
  "url": "https://www.goodreads.com/book/show/28816844-positive-thinking"
}