{
  "title": "Hanoi Rocks: All Those Wasted Years",
  "description": "Suomen rockhistorian suurin, kaunein ja legendaarisin saa vihdoin arvoisensa elämäkerran!Glamkuninkaallisten tarina on vihdoin saatu yksien kansien väliin! Ari Väntäsen, Andy McCoyn ja Michael Monroen Hanoi Rocks ei jätä kiveäkään kääntämättä vaan kertoo kaiken glampunkmessiaiden noususta, uhosta, ulkomaanrundeista, loputtomista bileistä, Razzlen kuolemasta, unelmien murskautumisesta, huumehuuruista ja siitä sammumattomasta liekistä, joka on saanut bändin jäsenet nousemaan tragedioiden tuhkista kerran toisensa jälkeen. Teos keskittyy ennen kaikkea Hanoin myyttisiin vuosiin 1979-1985.Raa´alla energiallaan ja suorasukaisella seksuaalisuudellaan hämmentänyt häirikköretkue valloitti Aasiaa ja Eurooppaa silloin, kun muut suomirokkarit vielä pitivät nuorisotalokeikkoja suuren maailman meininkinä, ilotulitti glamestetiikalla aikana, jolloin miehen korvakoru tiesi takuuvarmaa turpakeikkaa nakkikioskijonossa, ja räjäytti kertaheitolla suomalaisen rockin lasiseinät seuraavan sukupolven maailmanvalloittajien tieltä.Teos repii auki vanhat haavat ja puskee vereslihalla läpi vuosikymmenten.Hanoi Rocks (1979-1985, 2001-2009) on nimi, jota kumartavat musiikkimaailman dinosaurukset Guns N´ Rosesista ja Mötley Crüesta aina Manic Street Preachersiin ja Dave Grohliin – HIMistä, Negativesta ja muista kotoisista sankareista puhumattakaan. Sen vaikutusta suomalaiseen rockiin voisi havainnollistaa vain lanseeraamalla käsitteet “ehr.” ja “jhr.”, aika ennen ja jälkeen Hanoi Rocksin.Hanoi Rocks soittaa viimeiset keikkansa keväällä 2009, ja kirja julkaistaan niiden yhteydessä 1.4.Ari Väntänen on toimittaja ja muusikko, joka toimii Suomen painosmäärältään suurimman musiikkilehden Suen toimituspäällikkönä. Hanoi Rocksin kitaristi Andy McCoy ja laulaja Michael Monroe ovat eläviä legendoja.",
  "genres": [
    "Music",
    "Biography",
    "Nonfiction"
  ],
  "author": "Ari Väntänen",
  "average_rating": "4.07",
  "url": "https://www.goodreads.com/book/show/11805752-hanoi-rocks"
}