{
  "title": "Dangerous Deceptions",
  "description": "Lavenham has been waiting for its new Earl. Crippling debts and years of neglect have transformed the once genteel mansion into a crumbling ruin. If its heir doesn’t come home soon, there will be little but the title for him to claim.  Sent to Jamaica as punishment for attempted murder, Lord Edward Ellesworth had a lot to learn about himself and his beyond arrogant attitude. Now, standing on Lavenham’s imposing doorstep, where there once stood a plump and pompous prig, five years of almost unendurable misery and overwhelming responsibility have changed him beyond recognition. But have they changed him into the Earl he was always meant to become, or could the unconditional love of a mute, orphaned boy, change him even more?  With treasure hunters and kidnappers beating a path to his door, Edward knows he must find the strength to fight his tormented emotions and leave his young companion in a place of safety, but though his feelings are so wrong, the barren void left in his heart is almost too high a price for him to bear.  Simon hadn’t meant to love Edward, but taking the flogging meant for himself had secured far more than Simon’s everlasting devotion. He only needed to open his mouth and tell the man the truth. A truth he’d kept well hidden under ragged and baggy garments for almost seven years. His only friend on the Jamaican plantation had warned him to trust no one. Now installed in the adjacent bedroom at Lavenham, can Simon entrust the new Earl with his secrets as well as his heart?  He might not have a choice. Seven years of near starvation might once have meant his clothes swamped his slender frame, but since returning to England’s welcoming shores and eating three good meals a day, his body was changing in certain important areas at an extraordinarily alarming rate, and his previously capacious shirt was unquestionably loose no longer!  Dangerous Deceptions is an endearing love story suitable for anyone age 16 and upwards. As part of the Unrivalled Regency series, Dangerous Deceptions is a stand-alone story, but the series is best read in order to fully appreciate the depth of the characters and previous situations.  Silence of Scandal (Unrivalled Regency book 1) A Murderous Masquerade (Unrivalled Regency book 2) A Gallant Gamble (Unrivalled Regency book 3)",
  "genres": [
    "Historical",
    "Historical Romance"
  ],
  "author": "Jackie Williams",
  "average_rating": "3.91",
  "url": "https://www.goodreads.com/book/show/28821065-dangerous-deceptions"
}