{
  "title": "Shameless",
  "description": "In Regency England, a beautiful young woman finds her life thrown into turmoil by the arrival of a handsome scoundrel. Lady Elizabeth, the youngest and most headstrong of the three Banning sisters, has been engaged three times, and has most scandalously broken off all three engagements. Her fear of becoming any man’s property has kept her from marriage and earned her a reputation in the ton as a heartbreaking flirt. Neil Severin is a wicked rogue, black of heart and black of reputation. A man of no morals, devoid of compassion, he is a governmentsanctioned assassin. And his newest target is a man Beth holds dear. When the flame-haired beauty thwarts his plan, Neil exacts his own brand of spicy revenge. Beth despises him. Neil doesn’t care. But circumstances most unexpectedly throw them together, and with Beth’s life in danger, Neil finds himself in the unexpected role of hero, racing to save her before it’s too late. What he never expects is the twist fate hands him: instead of his saving her, Beth winds up saving him. When the ruthless organization he works for turns its agents loose on him, only Beth stands between him and a death he thought he didn’t fear. In a fight for their lives, Neil and Beth travel the British countryside, fleeing the ruthless killers out for Neil’s blood, the men after Beth, and their growing attraction to each other. Can Neil forgive himself for his past and accept Beth’s love? Can Beth overcome her fear and trust Neil? Will she have to choose between him and her family? And most important, can they both survive long enough to begin a new life together? The third in the Banning Sisters trilogy that began with the New York Times bestsellers Scandalous and Irresistible, Shameless marks a dazzling return to historical fiction for Karen Robards.",
  "genres": [
    "Historical Romance",
    "Romance",
    "Historical",
    "Historical Fiction",
    "Fiction",
    "Regency",
    "Regency Romance"
  ],
  "author": "Karen Robards",
  "average_rating": "3.84",
  "url": "https://www.goodreads.com/book/show/288188.Shameless"
}