{
  "title": "Before Sexuality: The Construction of Erotic Experience in the Ancient Greek World",
  "description": "A dream in which a man has sex with his mother may promise him political or commercial success--according to dream interpreters of late antiquity, who, unlike modern Western analysts, would not necessarily have drawn conclusions from the dream about the dreamer's sexual psychology. Evidence of such shifts in perspective is leading scholars to reconsider in a variety of creative ways the history of sexuality. In these fifteen original essays, eminent cultural historians and classicists not only discuss sex, but demonstrate how norms, practices, and even the very definitions of what counts as sexual activity have varied significantly over time. Ancient Greece offers abundant evidence for a radically different set of sexual standards and behaviors from ours. Sex in ancient Hellenic culture assumed a variety of social and political meanings, whereas the modern development of a sex-centered model of personality now leads us to view sex as the key to understanding the individual. Drawing on both the Anglo-American tradition of cultural anthropology and the French tradition of les sciences humaines, these essays explore the iconography, politics, ethics, poetry, and medical practices that made sex in ancient Greece not a paradise of liberation but an exotic locale hardly recognizable to visitors from the modern world. In addition to the editors, the contributors to this volume are Peter Brown, Anne Carson, Franoise Frontisi-Ducroux, Maud W. Gleason, Ann Ellis Hanson, Franois Lissarrague, Nicole Loraux, Maurice Olender, S.R.F. Price, James Redfield, Giulia Sissa, and Jean-Pierre Vernant.-- \"The Times Literary Supplement\"",
  "genres": [
    "History",
    "Nonfiction",
    "Sexuality",
    "Academic",
    "Classics",
    "Queer",
    "Essays"
  ],
  "author": "David M. Halperin",
  "average_rating": "3.60",
  "url": "https://www.goodreads.com/book/show/288266.Before_Sexuality"
}