{
  "title": "Unsportsmanlike Conduct: College Football and the Politics of Rape",
  "description": "\"Jessica Luther studied history and the classics before marshaling her writing talent toward of-the-moment topics like sexual assault and college sports culture. Now she's an investigative journalist, working from her adopted hometown, Austin, Tex., in what is perhaps the nation's most college-obsessed state. Ms. Luther's new book, Unsportsmanlike Conduct , examines the 'programmatic manner' in which sexual assaults are swept under the rug by institutions both on campus and in the media.\"-- New York Times \"Not to reckon with Luther's book would be an abdication not only of one's moral faculty but also of one's fandom...Luther does't just want to save future victims; she wants to save college football.\"-- New York Times Book Review \"A significant and riveting look at how one of the greatest cultural tragedies of the millennial generation--the silencing of sexual violence against women on campus--is nurtured by a system of cover-ups and corporatized crises management.\"-- Playboy.com \"In Unsportsmanlike Conduct , [Luther] draws on years of research and reporting to outline what she calls the 'playbook'--all the standard, predictable ways that football programs, universities, the NCAA, and sports media typically respond when athletes are accused of rape or assault. It's an infuriating, exhaustively researched catalogue of problems, from denial and toothless language to ignoring or discrediting the victim.\"-- Elle.com \"The most important sports book of the year.\"-- Booklist , Starred Review \"Jessica Luther is a Texas-based investigative reporter who broke the story of Sam Ukwuachu, a football player at Baylor University who was then on trial for sexual assault. Since then she's kept track of the dozens of sexual-assault claims made against college football players every year. Here, she looks at the relationship between football and sexual assault, the people and systems that perpetuate it, and how we can change the narrative going forward.\"-- New York Magazine \"Investigative journalist Luther catalogues the abuses created and enabled by college football programs and suggests workable reforms.\"-- Boston Globe , One of the Best Sports Books of 2016 The latest from Akashic's Edge of Sports imprint. Football teams create playbooks, in which they draw up the plays they will use on the field. Playbooks are how teams work and why they win. This book is about a different kind of the one coaches, teams, universities, police, communities, the media, and fans seem to follow whenever a college football player is accused of sexual assault. It's a deep dive into how different institutions--the NCAA, athletic departments, universities, the media--run the same plays over and over again when these stories break. If everyone runs his play well, scrutiny dies down quickly, no institution ever has to change how it operates, and the evaporation of these cases into nothingness looks natural. In short, this playbook is why nothing ever changes. Unsportsmanlike Conduct unpacks this societal playbook piece by piece, and not only advocates that we destroy the old plays, but also suggests we replace them with ones that will force us to finally do something about this issue. Political sportswriter and Edge of Sports imprint curator Dave Zirin (the Nation) has never shied away from criticizing that which die-hard sports fans hold dear. The Edge of Sports titles will address issues across many different sports--football, basketball, swimming, tennis, etc.--and at both the professional and nonprofessional/collegiate levels. Furthermore, Zirin brings to the table select stories of athletes' journeys and what they are facing and how they evolve both in their sport as well as against the greater backdrop of one's life's odyssey.",
  "genres": [
    "Nonfiction",
    "Sports",
    "Feminism",
    "Politics",
    "Football",
    "Sociology",
    "History"
  ],
  "author": "Jessica Luther",
  "average_rating": "4.26",
  "url": "https://www.goodreads.com/book/show/28818693-unsportsmanlike-conduct"
}