{
  "title": "Dead Europe",
  "description": "Dead Europe sets sharp realism against folk tale and fable, a world of hauntings and curses against a fiercely political portrait of a society. The energy in the writing, the pure fire in the narrative voice and the fearlessness of the tone make the novel immensely readable, as well as fascinating and original, and establish Christos Tsiolkas in the first rank of contemporary novelists.' Colm Toibin Isaac is a photographer in his mid-thirties, travelling through Europe. It is the post-Cold War Europe of a united currency, illegal immigration and of a globalised homogenous culture. In his mother's mountain village he encounters a Balkan vampire. Subsequently, as his journey continues across Italy, Eastern Europe and Britain he discovers that ghosts keep appearing in the photographs he takes, providing clues to a family secret and tragedy. Parallel to Isaac's story we are in the Greece of World War II. A peasant family is asked to provide protection to a Jewish boy fleeing the Germans. It is this boy who will become the vampire. From the mountains of Greece to the inner-city streets of 1960s Melbourne, we trace the journey of this malevolent force as it feeds on generation after generation of Isaac's family, seeking revenge and justice. FROM CHRISTOS TSIOLKAS: 'In attempting to trace back through the mythologies, lies and truths of history, I want to examine how the legacies of the past still actively disturb our sleep in the present. Isaac's story is written in a contemporary idiom, in the first person, as he reflects on his alienation from Europe, on what it means to be an artist, to be a man in love, to be an ethical human in a supposedly post-ideological age...I am also attempting to understand the longest standing of all European racial legacies: anti-Semitism. The vampire is not only the restless spirit of a dead boy. It is also the golem, the Christ Killer, the killer of children. It is this legacy that Isaac must face.",
  "genres": [
    "Fiction",
    "Horror",
    "Australia",
    "Historical Fiction",
    "Fantasy",
    "Book Club",
    "Literary Fiction"
  ],
  "author": "Christos Tsiolkas",
  "average_rating": "3.25",
  "url": "https://www.goodreads.com/book/show/2883972-dead-europe"
}