{
  "title": "The Willow Lake Group",
  "description": "Love, Friendship, Poetry, Obsession and a Magical Cookbook - they can all be found at The Willow Lake Group. Gavin Ramsay (a 42 year old man with a checkered past) travels to Willow Lake - a sleepy town somewhere in New England - to complete a carpentry contract. On the way he meets Liam Strindberg, a 27 year old hipster who is reeling after his fiance left him on the morning of their wedding day. When they arrive at Willow Lake, they go their separate ways - only to be reunited at the Willow Lake Bookstore - where they meet the colorful characters in the bookstore's literary group. There's William - the proprietor of the bookstore - a 68 year old widower who pines for his dear, departed wife. Then there's Beth and Delia - two lovers in their 50's, who settled in Willow Lake after an eon of persecution from their families. April is in her forties - quiet as a shadow - with a backbone stronger than anyone could have imagined.Alan - fast approaching 60 - is considered a carbon-copy of Ernest Hemingway, with his love of women, fishing and the Beat generation. Everyone adores Stanley - who's 52 and fabulously flamboyant - with his deeply closeted heart on his sleeve. Then of course there's Sondra - the 40 year old witch who prepares the sumptuous meals that delight the members of the Willow Lake Group. Space cadet Mena (20) and self-styled \"Goth/Viking/Vampire\" Lars (25) are the youngest members - who weave in and out of the group - dancing to their own tune, having escaped terrible abuse as children. Finally, Gavin has found the family he's been searching for his whole life. The icing on the cake (including the cherry on top!) is the love that soon develops between Gavin and Sondra. As for Liam - he never expected to fall in love with a woman's handwriting - which leads him through a dark path of obsession and soul-searching. Gavin is surprised to learn that the handwriting belongs to his beloved Sondra. As all their lives become entangled - the Willow Lake Group find it more and more difficult to retain the peace. All Sondra wants is Gavin - and the successful completion of her Wiccan cookbook. All Gavin wants is Sondra - and for Liam to disappear. All Liam wants is Sondra - at any cost.",
  "genres": [],
  "author": "Kelly Proudfoot",
  "average_rating": "4.38",
  "url": "https://www.goodreads.com/book/show/28845948-the-willow-lake-group"
}