{
  "title": "Alien General's Fated",
  "description": "This general will never lose...This is a full 100 k sci-fi romance novel, featuring a growly Alien Alpha general and a feisty, curvy human woman going against all the odds. It is part of a series but can and should be read as a standalone novel! No cheating and a guaranteed HEA! NB! The file has been correctly updated and any readers with updates turned on can now view the right book file!Aria Harris has been fighting for recognition all her life. A curvy, confident Earth woman, she's made it to the upper echelons of her profession, working as an Ambassador for the Galactic Union itself! Well, Ambassador... on a trial period, anyway. Having to prove herself is nothing new for Aria and when she's tasked to keep a Brion general on a leash during his trip to the seat of the union, it seems like another challenge to face. But she couldn't have been prepared for the general... Not only may she have met her match, but the man might very well be the most compelling, infuriating, sexy and despicable being she's ever laid her eyes on. Shame she can't look away, then. And that she has to make sure he won't blow up the entire seat of the Union before the day's through!Ryden won his spot through sweat and blood and as far as he's concerned, that's the only way to live. Existing in a brutal reality of combat and conquest, the newest Brion general to join the ranks has no time or patience for weak politicians, petty tasks or wasting his time. Being sent to babysit the Galactic Union from a force they're clearly not equipped to deal with feels like all three at the same time. Despite looming threat and ever-lingering death, Ryden can't help but keep noticing the feisty woman who seems to fight him on every step. So is it so wrong to want to conquer her too, then, even if fate seems to not be co-operating at all?Not only is Ryden in jeopardy of losing the Union to a force far more treacherous than anticipated, but he might be losing his heart to the fiery-eyed little Terran too. What's a man to do but make sure then that he's the last man standing, and that Aria would be right there by his side. The fact that the universe doesn't seem to quite agree with his plan is of little consequence. No one can stop this general, no one but her...Will Aria learn to trust anyone but herself, and will Ryden come to know that there's more to existing than conquest? You know you want to find out!",
  "genres": [
    "Science Fiction",
    "Aliens",
    "Romance",
    "Science Fiction Romance",
    "Military Fiction",
    "Paranormal"
  ],
  "author": "Vi Voxley",
  "average_rating": "4.21",
  "url": "https://www.goodreads.com/book/show/28844629-alien-general-s-fated"
}