{
  "title": "Upriver, Downriver",
  "description": "Masters Biscuit, Turnaround, Forrester, and the Lady Neptune say 'hi' and 'how's it going' from their home in the ever-cozy Sarpsis Valley. Nestled in the heart of nowhere and lovingly hugging the great and bounteous Sarpsis River, we here in the valley think that this is the best damn place there could ever be in all the world! We got fishing, we got hunting––we got nothing but friends and well-wishers for neighbors and heroes and scholars for family. Maybe our criteria for \"best\" and \"possible\" is narrowed, what with so much of the world blown up and the rest of it loud and wounding and Fussy. And sure, maybe none of us has even been past the mountains or beyond the Withergrounds––but that's besides the point. Yes, friends, by process of elimination, by virtue of forfeit by all contenders, the Sarpsis Valley is the best damn place there could possibly be. Well, at least it was…Hasn't rained in a few years. And uh––river's shrinking a bit. Ground's kinda dry. But any day now it's gonna rain! Right around the corner! Biscuit's wings are twitching cause he thinks he feels a wetness on the wind, and all eight of Turnaround's eyes are peeled for clouds. Yep. Any day now it's gonna rain and everything is gonna to be all right––so mount the oars, hoist a sail, and fill your pockets full of worms because any day now the fishing is gonna be as good as it was, and all the best spots'll be taken.P.S. The funniest thing's just happened! Some people came from up in The Fuss, and you know what, they don't seem so bad after all! They made it rain, and they got these seeds that grow to plants in less than an afternoon! Some people are jittery about it, but hell, Biscuit says this is no world for cowards. Forrester thinks the people from upriver look at at the strange kids funny, that they look at Biscuit's wings like candy and at Blonde John's digging claws like they're a present or something. But anyway––it's damn good to see things getting back on track, however it has to happen.P.P.S. Some more new people came from up the river, and they said they came to help too! People from upriver sure are helpful. Valley's getting a bit crowded, but hell––you're still invited.P.P.P.S. We changed our minds. Keep out. Keep the hell out!",
  "genres": [],
  "author": "Aaron  Ward",
  "average_rating": "4.50",
  "url": "https://www.goodreads.com/book/show/28854703-upriver-downriver"
}