{
  "title": "The Martian General's Daughter",
  "description": "Welcome to the End of Empire.Set over two hundred years from now, in a world very much like Imperial Rome, this is the story of General Peter Black, the last decent man, as told through the eyes of his devoted (and illegitimate) daughter, Justa.Raised on battlefields, more comfortable in the company of hard men of war than with women or other children, Justa must keep the truth of her birth hidden. Her father regards her as an embarrassment, a reminder of his one and only indiscretion. Yet she is a remarkable woman, one whose keen mind wins her an education at the feet of Emperor Mathias the Glistening himself.All his life, General Black served the noble emperor, and, out of loyalty to the father, continues to serve his son after Mathias's death, even as the son's reign degenerates into an insane tyranny worthy of Nero or Caligula. As the rule of the empire passes from father to son with disastrous results, a strange metal plague begins slowly destroying the empire's technology, plunging the realm into chaos and the world into war. Amid the destruction and upheaval, General Black must decide whether to turn his back on the men and institutions who never loved him nearly as much as he did them, or whether to save his most trusted ally and adviser, his best friend and only real family.The Martian General's Daughter is a gripping tale of a world at war; of cunning strategies and vile politics; of bravery, foolishness, and excess. It is at once a stirring military adventure, a cautionary tale of repeating history, a cutting satire, and a heartbreaking examination of the joys and pain inherent in the love between a father and child. Judson's previous novel was selected in multiple best-of-the-year lists. With The Martian General's Daughter, he offers another must-read epic destined to take its place in the canon of science fiction, and sure to appeal to readers of everything from Orson Scott Card to Walter M. Miller, Jr.",
  "genres": [
    "Science Fiction",
    "Fiction",
    "Steampunk",
    "Fantasy",
    "Dystopia",
    "Science Fiction Fantasy"
  ],
  "author": "Theodore Judson",
  "average_rating": "3.43",
  "url": "https://www.goodreads.com/book/show/2884981-the-martian-general-s-daughter"
}