{
  "title": "The Pomegranate Tree",
  "description": "After receiving an ancient ruby clasp from her long dead grandmother, Hannah Wilson decides to visit Masada, supposedly the place where this gift was given to one of her ancestors. Travelling with her is Max Vallier, her best friend, who was already going to Herod’s fortress in the desert, as part of an archaeological excavation team. Once there, Hannah is disturbed by strange visions. Visions, which seem to revolve around the AD66 attack by Zealot rebels, on the Roman garrison based at the fortress. As her two worlds begin to entwine, Hannah realises that she is experiencing the events of the past as they unfold, events, that so far she has only dreamed about. Pulled into the ancient world, she tends to three Roman soldiers who survived the attack, but who are now captives. Back in the modern world, she finds artefacts that tie her to her ancient counterpart. Meanwhile, her relationship with Max takes an interesting turn, but just as they admit their feelings for each other, a tragic accident tears them apart. Fate intervenes and Hannah slips into the world of Ancient Masada. There, away from all modern trappings, she must rely on her wits and instincts to deal with the challenges of her alternate life. A life in which she, an unmarried Hebrew woman, is a healer - a trained physician fighting to keep alive the men under her care. This life becomes more complicated as she realises she is falling in love with one of the Roman soldiers, a love that could have deadly consequences. Unsure whether she will ever be able to return to the modern world, Hannah accepts her destiny, rising to the challenges of living on an isolated fortress and, believing that she has a chance to save those she loves by using the knowledge she has brought with her from two thousand years in the future. The knowledge that, eventually, Jerusalem will fall and, that those escaping the city will make their way to this outpost, followed by an avenging Roman army intent on destruction. Will Hannah escape? Will she ever see Max again, or is she doomed to die along with hundreds of others as Masada falls - and what does any of this have to do with an ancient ruby clasp?",
  "genres": [],
  "author": "Rosie Chapel",
  "average_rating": "4.24",
  "url": "https://www.goodreads.com/book/show/28870619-the-pomegranate-tree"
}