{
  "title": "Where Are the Customers' Yachts?: or A Good Hard Look at Wall Street",
  "description": "\"Once I picked it up I did not put it down until I finished. . . . What Schwed has done is capture fully-in deceptively clean language-the lunacy at the heart of the investment business.\"-- From the Foreword by Michael Lewis, Bestselling author of Liar's Poker \". . . one of the funniest books ever written about Wall Street.\"-- Jane Bryant Quinn, The Washington Post \"How great to have a reissue of a hilarious classic that proves the more things change the more they stay the same. Only the names have been changed to protect the innocent.\"-- Michael Bloomberg \"It's amazing how well Schwed's book is holding up after fifty-five years. About the only thing that's changed on Wall Street is that computers have replaced pencils and graph paper. Otherwise, the basics are the same. The investor's need to believe somebody is matched by the financial advisor's need to make a nice living. If one of them has to be disappointed, it's bound to be the former.\"-- John Rothchild, Author, A Fool and His Money , Financial Columnist, Time magazine Humorous and entertaining, this book exposes the folly and hypocrisy of Wall Street. The title refers to a story about a visitor to New York who admired the yachts of the bankers and brokers. Naively, he asked where all the customers' yachts were? Of course, none of the customers could afford yachts, even though they dutifully followed the advice of their bankers and brokers. Full of wise contrarian advice and offering a true look at the world of investing, in which brokers get rich while their customers go broke, this book continues to open the eyes of investors to the reality of Wall Street.",
  "genres": [
    "Finance",
    "Business",
    "Economics",
    "Nonfiction",
    "Money",
    "Personal Finance",
    "Audiobook"
  ],
  "author": "Fred Schwed Jr.",
  "average_rating": "3.89",
  "url": "https://www.goodreads.com/book/show/288897.Where_Are_the_Customers_Yachts_"
}