{
  "title": "Alien: Taken - Human Test Subject",
  "description": "~Brestille of Aiyrn~ They’ve been raiding our planet for generations, but I didn’t believe the rumors about twins being bad luck – at least not until the day Gvynette and I were taken. The Terrans snatched us from our home world, brought us to this remote planet, and turned us into guinea pigs, poking and prodding us for their own purposes. I know now that we can never go home. I might have just given up if it hadn’t been for the strange new alien I met here. There’s something that intrigues me about him. The connection we share is special – that much was clear from the moment we met – or else the scientists are up to more dirty tricks and all of this is just simulated. I don’t know who to trust anymore.  ~Derresch of Belor~ I wasn’t supposed to be taken. I should be fighting the Terrans – in a year’s time I would have finished my training and been off to war. But now I’m trapped here on this XenoStation with all of the primitive races that are usually the ones being subjected to this kind of inhumane experimentation. I was ready to go down in a blaze of glory, to take as many Terrans with me as I could, but then I met this tough little Aiyurna girl – naïve as you please but strong, defiant even – who made me feel oddly protective. I don’t know if I can help her – or if she’ll even want me once she finds out what I really am, but she’s made me want to go on living, and for now that’s enough.  In the last chapter you will encounter the biggest twist yet. All the buildup of the previous two chapters will come to a jaw-dropping end.  ♥ WARNING: Alien: Taken is a standalone 60K+ novel with no cliffhangers. However, it also contains adult-level sexiness and some intense action scenes and is meant for mature readers only. Enjoy!  BONUS ★★★★★  5+ Surprise Bonus Stories included!  * * * Introductory Price * * * LIMITED TIME ONLY! GRAB YOUR COPY NOW!",
  "genres": [],
  "author": "Clara A. Tobin",
  "average_rating": "2.84",
  "url": "https://www.goodreads.com/book/show/28870366-alien"
}