{
  "title": "State of Mind 2.0: 11 Lessons of the Most Productive People on the Planet",
  "description": "Dream Big!!!You have a big idea and you want to shock the world. But, you’ve tried to get yourself going and constantly get sidetracked. Or, you’re trying to expand your business to go global, but you can’t seem to break through the barriers to entry. Or, you’re a business leader, but you don’t seem to command the level of respect that you need in order to make the kind of impact that you want. In State of Mind 2.0 executive coach Christopher Pinckley explains the secret formula that creates the type of individual who will achieve any goal, command the utmost respect as a leader, and has the ability to create a global impact. You’ll learn Use the principle of singularity and become effective by focusing on one goal at a timePut a cast iron shield around your time and energy so you get more doneObsessively self manage yourself so that you prioritize taking action-steps that create resultsArrange your action-steps so that they build, one upon the other, to support your goals and build your amazing visionTune out the chaos and become immune to outside influences that could distract you from your missionBe consistent by disciplining yourself with a daily regiment that sets you light years apart from all but the absolute best of the bestHarness the full power of your mind to become unstoppable under any circumstance no matter whatWalk the road that few have the courage to and become one of the most productive people on the planetIf you want to achieve uncommon success, make the biggest possible contribution to humanity that are potentially capable of, and take up your own page in the history books, then you need to think differently than every single person around you. You need tune out the noise and maintain the type of focus that is beyond obsessive. You need to learn how to trust yourself beyond trust. You need to learn how to become ultra productive.Now you have a road map like no other.“This remarkable book collects proven tactics from some the most successful people of our day and presents them in concise, authoritative language that’s suitable for anyone looking to advance!” - Marshall Goldsmith – The Thinkers 50 #1 Leadership Thinker in the World.",
  "genres": [
    "Business",
    "Psychology"
  ],
  "author": "Christopher A. Pinckley",
  "average_rating": "4.38",
  "url": "https://www.goodreads.com/book/show/28870945-state-of-mind-2-0"
}