{
  "title": "A Girl Named Willow Krimble",
  "description": "So, you’ve just discovered that the person who has tormented, mocked and humiliated you for the past three years is lying in the school parking lot, bleeding internally from a hit and run accident. No one else is around and you need to get to a life-and-death family emergency of your own before it is too late. What would you do? Oh, did I mention you have the secret ability to heal others just by touching them? This is just one of the many situations 13-year-old Willow Krimble must face in this Web Novel, A Girl Named Willow Krimble. Willow lives with her mother and older brother, Wyatt; she loves hanging out with her best friend, the feisty and sarcastic Razzel Fiora, and she has a close relationship with her grandmother. Seems pretty normal, right? It might be if the two most popular girls in middle school, Shayla Stergus and Snella Burenbine, did not taunt and remind her, on a daily basis, that she was born without her left leg. Forced to maneuver through obstacles most teenagers would not need to tackle, Willow is suddenly blessed (or cursed?) with the unusual power to heal others through touch. Ever selfless, Willow’s desire to help the injured and sick thrusts her into a world where she is given immense responsibility, putting the needs of others before her own, all the while trying to maintain her secret. Willow’s adolescent journey takes her through an emotional cyclone where she finds joy and purpose in helping an array of patients, from an old man with Alzheimer’s, to a mauled animal in a pet store. But Willow soon finds out there are limitations to her ability and, no matter how hard she might try, she cannot save everyone. Through the intermingling of joy and pain, Willow is repeatedly tested to discover just how strong she can be, how strong she has been her entire life, and how everyone possesses the ability to effect another person’s world, with or without a secret power.",
  "genres": [
    "Young Adult",
    "Magical Realism"
  ],
  "author": "Giuseppe Bianco",
  "average_rating": "4.29",
  "url": "https://www.goodreads.com/book/show/11809389-a-girl-named-willow-krimble"
}