{
  "title": "Journey Into Beatledom: The Beatles as Prophets, Peaceniks & Holy Writ",
  "description": "When Cavern DJ Bob Wooler said of The Beatles 'I don't think anything like them will happen again' - he hit the nail square on the head. Being both ordinary lads from Liverpool and extraordinary, dare I say it, sacred icons from the realm of the beatific and bizarre, in their fetid, subterranean, beatnik haunts, they very quickly were able to turn shit into sonorific shinola. Find out just how they did this in the pages that follow, and why The Beatles hometown of Liverpool is described here as a ‘quantum’ City. Why their songs are brimful of an inherent ‘strangeness’ which borders on the sacred. Why too The Beatles were curiously viewed by some as quasi-supernatural beings from the beyond. Still others said that since you can view the whole world in a grain of sand, in many of The Beatles songs, you can (if you are looking), glean a whole quantum universe.For example, McCartney's Here There And Everywhere describes the superposition of a quantum state, Lennon's lyric 'Nothing is real' is a paraphrase of a quote from Quantum physicist Niels Bohr, and Maxwell's Silver Hammer refers to two forerunners of Quantum Theory, - James Maxwell Clerk and Thomas Edison. Other songs, Tomorrow Never Knows, Within You, Without You, Penny Lane, There's a Place, Think For Yourself, The Word and Fool On The Hill - cover related themes.The Beatles’ historical and spiritual legacy too was informed by their Liverpudlian upbringing and close knit coterie of friends and supporters. All this eventually influenced a whole range of subjects such as the generation gap, political freedom, gender and sexuality, globalization and even the fall of The Soviet Union.Musical alchemists extraordinaire, they were somehow innately able to suss out a hit from a miss, tell a smash from the trash, as they plucked 'something from nothing' out of the ether of Beatledom and turned it all into Silver, Gold, Platinum and much more.The Beatles many messages of peace and love in their songs represent the 'coming together' of the discrete and the continuum, (particles and waves in the quantum realm), a form of Monism (oneness), which underlines the gestalt nature of The Beatles ability to appear to be 'two opposite things at the same time', (Lewisohn), and 'unacknowledged legislators of populist revolt', (MacDonald). It was Macdonald too who asserted that these 'Pop' Prophets from beyond were somehow subliminally, (even magically), orchestrating 'sixties events 'through their records'. The hidden power of 'that piece of plastic' as Ringo Starr had called it, has never been so potently demonstrated.",
  "genres": [
    "Music"
  ],
  "author": "Joe  Robinson",
  "average_rating": "4.90",
  "url": "https://www.goodreads.com/book/show/28919076-journey-into-beatledom"
}