{
  "title": "Raw and Dirty",
  "description": "Raw and Dirty (Bad Boys MC Trilogy #1) - a full-length motorcycle club romance with no cliff-hanger, a sexy British bad boy president and a sense of humor Risky and Wild (#2) releases March 2016 *** Make nice with the President of the Alpha Wolves Motorcycle Club.  Yeah right.  It was what my job description called for—I just never realized exactly how nice I needed to be. I certainly never expected to find myself twisted up and tangled in the raw, dirty world of an outlaw motorcycle club … or in the sexy, tattooed hands of the man in charge.  Royal McBride is a jerk—but a jerk with a swoon worthy accent, a big bike, and big … well, other things.  I didn't think falling in love with him would threaten my life. His life. That we'd both risk losing everything we hold dear.  The mayor's daughter … an outlaw MC president. It's a match made in heaven … a match tested in hell. *** ALSO BY VIOLET BLAZE -Stepbrother Inked (a bad boy romance about a hot tattoo artist) -Stepbrother Thief (an alpha male romance about a sexy jewelry thief) -Biker Rockstar Billionaire CEO Alpha (coming soon!) *** RAW AND DIRTY EXCERPT  “Baby,” he says, pushing up against me so I can feel his c**k straining against the tight seams of his leather riding pants. “Trust me. I'm going to work you harder than you've ever been worked before. You'll need that food in there just to recover enough strength to stand.”  Royal shoves me back suddenly, pinning my body against the living room wall with his much larger frame, leaving just enough room between us to reach up and take hold of the zipper on my leather jacket.  My breath catches.  “Only downside to all this riding gear,” he says as he pulls the zipper down at an agonizingly slow pace, “is that it's a b***h to take off.” I watch his fingers, mesmerized by the color on his skin, the art that he wears so well, the roses and the vines and the pistols. Guess I'll finally get to see what he's hiding under that shirt of his.  But I don't move to touch him, not yet.  He isn't saying anything, but I can feel him taking control of the encounter, forcing me to relax and let go a little. I never really liked being submissive during sex, but … with Royal, I can see the appeal. Right now, I'd let him do anything he wanted. I don't want to have to think about what I'm doing or if I'm making a fool out of myself. I just want to feel him, all of him.  Once the jacket's unzipped, he slides it from my shoulders with that same careful slowness, his fingertips brushing against my bare arms as he tosses it aside and cups my face in his hand.  “I don't know what it is about you, my dear sweet Deputy Mayor,” Royal says, his voice dark and deep and hungry. I feel my tongue sliding across my lower lip. “But I want you. Bad. I want to make you mine.”  He caresses my chin, the power in his grip astounding, but he holds back enough that it doesn't hurt, not at all.  “It's a shame you're so prim and proper or I might be tempted to make you my old lady.” He slides his thumb over my lower lip and instead of telling him off or how we'd never work together, how this is only for one night, I bite it.  Royal's brows come up and his mouth quirks into a grin.  I think we're both enjoying this fantasy. “Naughty girl,” he says sliding his hand down, trailing his fingers across my throat, over my breasts, until he finds the bottom of my tank top. “I feel like you deserve to be punished for that.”",
  "genres": [
    "Romance",
    "Adult",
    "Contemporary Romance",
    "Contemporary",
    "Erotica",
    "Dark Romance",
    "Adult Fiction"
  ],
  "author": "Violet Blaze",
  "average_rating": "3.95",
  "url": "https://www.goodreads.com/book/show/28899334-raw-and-dirty"
}