{
  "title": "Brutal Need: Lawyers and the Welfare Rights Movement, 1960-1973",
  "description": "During the 1960s a new breed of \"poverty lawyers\"―in collaboration with welfare recipient activists―mounted a legal campaign to create a constitutional right to welfare. The collaboration worked significant changes in the social welfare system of the United States and in the scope of individual constitutional rights. In this book, Martha F. Davis tells the behind-the-scenes story of the strategies, successes, failures, and frustrations of that important campaign.Drawing on interviews with many of the people who participated in the welfare rights movement, as well as on original sources, Davis traces the historical and philosophical connections among welfare rights lawyers, the settlement house movement of the late nineteenth and early twentieth centuries, and the civil rights movement, and she shows how the legal campaign for the poor followed and built on the litigation strategies developed by the NAACP Legal Defense and Educational Fund's earlier effort to desegregate the public schools. She outlines the creation of welfare law in the 1960s and provides the first detailed account of the strategy to use law as a mechanism for organizing and expanding the rights of welfare recipients. She vividly describes seminal cases and individual lawyers and activists, including Edward Sparer, the lawyer acknowledged as the father of welfare law; George Wiley, founder of the National Welfare Rights Organization; and Charles Reich, whose theories were crucial to the formulation of the plaintiffs' position in Goldberg v. Kelly , the landmark case that argued that welfare benefits were protected by the due process clause and should not be terminated without a hearing. Even though 1960s welfare rights litigation was ultimately unsuccessful in broadly reforming the welfare system, Davis shows the important role legal strategies and lawyers themselves have played in this social movement of the poor.",
  "genres": [
    "Law",
    "History"
  ],
  "author": "Martha F. Davis",
  "average_rating": "3.88",
  "url": "https://www.goodreads.com/book/show/2890973-brutal-need"
}