{
  "title": "Death of a Kitchen Diva",
  "description": "Welcome to Bar Harbor, Maine, one of New England's most idyllic coastal towns. But as new food writer Hayley Powell is about to find out, the occasional murder can take a bite out of seaside bliss. . .Single mom Hayley Powell is barely keeping her leaking roof over her head when her boss at the Island Times gives her a new assignment--taking over the paper's food column. Hayley's not sure she has the chops--she's an office manager, not a writer, even if her friends clamor for her mouth-watering potluck dishes. But the extra income is tempting, and Hayley's chatty first column is suddenly on everyone's menu--with one exception.When rival food writer Karen Appelbaum is found face-down dead in a bowl of Hayley's creamy clam chowder, all signs point to Hayley. To clear her name, she'll have to enlist some help, including her BFFs, a perpetually pregnant lobster woman, and a glamorous real estate agent. As she whips up a list of suspects, Hayley discovers a juicy secret about the victim--and finds herself in a dangerous mix with a cold-blooded killer.Includes seven delectable recipes from Hayley's kitchen!\"What a delicious debut mystery!\" -Laura Levine\"A delicious read that I ate up in one sitting.\" -Isis CrawfordMore Mouth-Watering Praise For Lee Hollis And Hayley Powell!\"Sleuth Hayley Powell slides down as easily as one of her Lemon Drop Martinis (recipe included) and readers will be calling for a second round from author Lee Hollis.\" --Leslie Meier, author of Chocolate Covered Murder\"Delicious and satisfying. Another course, please.\" -Carolyn HartMore Mouth-Watering Praise For Lee Hollis And Hayley Powell!\"Sleuth Hayley Powell slides down as easily as one of her Lemon Drop Martinis (recipe included) and readers will be calling for a second round from author Lee Hollis.\" --Leslie Meier, author of Chocolate Covered Murder",
  "genres": [
    "Mystery",
    "Cozy Mystery",
    "Cozy",
    "Fiction",
    "Romance",
    "Mystery Thriller",
    "Food"
  ],
  "author": "Lee Hollis",
  "average_rating": "3.66",
  "url": "https://www.goodreads.com/book/show/11810080-death-of-a-kitchen-diva"
}