{
  "title": "Red Audrey and the Roping",
  "description": "“This is a literary gem . . . one of the best books I’ve read this year.”—Ellen Hart\n\"This raw and convincing first novel is narrated by a woman who can’t help testing the limits of her ability to endure pain in her intimate relationships with men and women... the vivid characters and potent emotions keep the pages turning.\"—The Advocate\nOccasionally a debut novel comes along that rocks its readers back on their heels. Red Audrey and the Roping is one of that rare and remarkable breed. With storytelling as accomplished as successful literary novelists like Margaret Atwood and Sarah Waters, Jill Malone takes us on a journey through the heart of Latin professor Jane Elliot.\nSet against the dramatic landscapes and seascapes of Hawaii, this is the deeply moving story of a young woman traumatized by her mother’s death. Scarred by guilt, she struggles to find the nerve to let love into her life again. Afraid to love herself or anyone else, Jane falls in love with risk, pitting herself against the world with dogged, destructive courage. But finally she reaches a point where there is only one danger left worth facing. The sole remaining question for Jane is whether she is willing to accept her history, embrace her damage, and take a chance on love.\nAs well as a gripping and emotional story, Red Audrey and the Roping is a remarkable literary achievement. The breathtaking prose evokes setting, characters, and relationships with equal grace. The dialogue sparks and sparkles. Splintered fragments of narrative come together to form a seamless suspenseful story that flows effortlessly to its dramatic conclusion.\nWinner of the Bywater Prize for Fiction, Red Audrey and the Roping is one of the most memorable first novels you will ever read.",
  "genres": [
    "Fiction",
    "Lesbian",
    "LGBT",
    "Queer"
  ],
  "author": "Jill Malone",
  "average_rating": "3.42",
  "url": "https://www.goodreads.com/book/show/2889966-red-audrey-and-the-roping"
}