{
  "title": "Leviathan: A Brief Story At the End of the World",
  "description": "The planet is dying. In this bleak world, only two people remain-- a father and child. They eke out a meager existence on the shore of a dead, oil-slicked sea, haunted by memories of what once was. Not wondering what might be. Just waiting for the final ending to arrive.One windless night, the child hears the ghostly call of a creature long-presumed to be extinct. Is it a sign of hope for the world, or evidence of their shared guilt, a ghost tormenting their final days? Determined to find out, the child sets out alone in a rickety boat on a journey of self-discovery.\"Leviathan\" is a haunting story about the end of everything as we know it. If you are a fan of Cormac McCarthy's The Road , you'll find this story as equally compelling. Appropriate for readers of all ages. In 2014, the World Wildlife Fund (WWF) reported that the levels of over 10,000 representative animal species — indicators of environmental health — had declined by more than 50 percent since 1970. In just that forty year span, we lost half of the world's animal biomass. Based on these trends, we can expect to see a further halving by the middle of the current century. But it's not just overall numbers of individuals that are dropping. Species diversity is falling, as well. This is beyond it is, in fact, a doomsday scenario.While the debate about the human impact on climate change wages on, scientists are nearly unanimous in their agreement that human activity is directly responsible for the extinction of hundreds of animal and plant species and have indirectly caused the disappearance of possibly thousands more in what is now being described as a Sixth Global Extinction. The event is so significant in the natural history of our planet that a new geologic age has been proposed to acknowledge humanity's impact on the globe— the Anthropocene . We stand at the threshold of that era peering into an uncertain future. What will it look like? Will it be a world entirely devoid of all animal life?\" Leviathan \" is a work of speculative fiction; it takes the current trajectory of our planet to its absurd extreme. While I personally believe that total global extinction is an exceedingly unlikely scenario, at least as the direct consequence of our reckless behavior, the threat to our own species is far more real. Why? Because many of the plant and animals species we depend upon for food, medicine, and other uses are at terrible risk. The earth will adapt to the changes we are causing it, of that I have no doubt. Given enough time, physical and biological systems will find a new equilibrium. As a biological scientist, I have faith that life, in some form, will find ways to occupy it. But how will humanity? Reflecting the uncertain nature of our own future, the ending to \"Leviathan\" was intentionally left open to multiple interpretations, ranging from the horrific to the hopeful. I leave it to you, Dear Reader, to decide which one you prefer to imagine.For more climate fiction (clifi) from Saul, check out his SCORCHED EARTH - A CLIMATE COLLAPSE SERIES . He is also the author of the award-winning short story, \" The Cloud Weaver's Song ,\" which can be found in the anthology Climate Fiction for Future Ancestors , published by Grist (available Feb 2023) (To find out more about Saul's writings, and for a free multi-book starter library, visit him at tanpepperwrites.com.",
  "genres": [
    "Apocalyptic"
  ],
  "author": "Saul W. Tanpepper",
  "average_rating": "3.79",
  "url": "https://www.goodreads.com/book/show/28923474-leviathan"
}