{
  "title": "Bioshock: Rapture Şehri",
  "description": "Dünyanın en çok satan bilgisayar oyunlarından Bioshock'ın başlangıç hikâyesi… Su altı şehri Rapture'ın bilinmeyen gerçekleri… Bir ütopyanın adım adım distopyaya dönüşmesi… II. Dünya Savaşı'nın sonuydu. Franklin D. Roosevelt'in Yeni Düzen'i, Amerika siyasetinin gidişatını değiştirmişti. Vergiler hiç olmadığı kadar yüksekti. Hiroşima ve Nagazaki'ye atılan atom bombaları, tüm dünyaya toplu bir ölüm korkusu saldı. Hükümetlerin gizli ajanlıklarının ve birimlerinin yükselişi, dikkatleri üzerine çekiyordu. Amerika'nın özgürlük anlayışı yok oluyordu ve pek az insan özgürlüklerini kazanmak için savaşmaya hazırdı. Ancak bu insanlar arasındaki bir hayalperest, zorlu yollardan gelen bir mülteciyken dünyanın en zengin ve en hayranlık uyandırıcı adamlarından birine dönüştü. İşte o adam: Andrew Ryan! Ve kendisi, insanların hep daha iyisini hak ettiğine inanıyor. Bu yüzden dünya üzerinde bir ütopya yaratıp imkânsızı gerçekleştirmeye kararlı. Öyle bir ütopya ki devletten, sansürden, bilim üzerindeki ahlaki sınırlamalardan uzak, emeklerinizin karşılığını aldığınız bir yer. İşte bu fikirle Rapture ortaya çıktı; denizin altındaki o parıltılı şehir… Ancak bu ütopya büyük bir trajediyle yüzleşti. İşte her şey böyle başladı… her şey böyle son buldu.\"Ben Andrew Ryan ve size bir soru sormak için buradayım: Bir insan kendi alınterinde hak sahibi olamaz mı? Hayır, der Washington'daki adam. O ter, fakirlere aittir. Hayır, der Vatikan'daki adam. O ter, Tanrı'ya aittir. Hayır, der Moskova'daki adam. O ter, herkese aittir. Bu cevapları reddettim. Bunlar yerine, başka bir şeyi seçtim. Ben imkânsızı seçtim. Ben… Rapture'ı seçtim. Sanatçıların sansürden korkmayacağı bir şehir. Biliminsanlarının gereksiz bir ahlakla sınırlandırılmadığı bir şehir. Mükemmelin, değersizler tarafından sınırlanmadığı bir şehir... ve alınterinizle, Rapture sizin de şehriniz olabilir.\"(Tanıtım Bülteninden)",
  "genres": [
    "Science Fiction",
    "Fiction",
    "Fantasy",
    "Video Games",
    "Horror",
    "Dystopia",
    "Steampunk"
  ],
  "author": "John Shirley",
  "average_rating": "3.99",
  "url": "https://www.goodreads.com/book/show/28931624-bioshock"
}