{
  "title": "Orpheum",
  "description": "Alternate cover edition of ASIN B01B4Y8034I always knew music was powerful. Even though I rebelled against the marathon forced practice sessions that turned my adolescence into a prison camp, there were moments--even in the mechanical repetition of practice--where I stopped being a robot and felt a kind of transcendence, a connection to something deeper. But that was before I learned what music really was, and that it was capable of more than just pretty feelings. That it was a weapon, which could cause great pain and destruction; that it was deeper and older than humanity; and that there were forces in the world that wanted to reclaim it for themselves. And there's something beyond the music, something darker and more violent. Something waiting to be invited, something only I can control. I'm more powerful than I ever could have imagined, but the price is something - and someone - I can't bear to lose.(This is PART ONE of the first book in the series.)Orpheum is a young adult dark fantasy romance based on Eastern European history, the myths and literature of Orpheus and Pythagoras' theory of the music of the spheres. Readers who loved This Savage Song and Strange the Dreamer will love this hypnotic mythological thriller.  ♬☠♪♩♫♬☠♪♫♩☠♬☠♪♫♩☠♬☠♪♩♫I spent a decade becoming the best violinist in my state - but a single letter dashed my hopes of a musical career. Desperate to escape my sheltered existence, I took a mysterious offer from a music school in Bulgaria. The culture and my new classmates seemed magical at first... a little too magical. My blood runs dark and hot as new emotions awaken within me, along with supernatural abilities that take my music farther than I'd ever imagined. They tell me I'm the key to everything, but only if I can keep my head.That should have been easy. Instead, I follow my heart and kill everyone I loved.Now I'm going to get them back.Orpheum is a young adult dark fantasy romance based on Eastern European history, the myths Apollo and Dionysus, and an alchemical magic based on planetary music. Readers who loved This Savage Song and Strange the Dreamer will love this hypnotic mythological thriller.A gripping dark fantasy romance for anyone who loves...music and stories with violinsepic stories full of history and mythologymagical powers and supernatural creaturesGothic themes and literaturetragic romancesThis book was updated in 2018 and now contains the FULL novel.Read the epic conclusion now!",
  "genres": [
    "Fantasy",
    "Young Adult",
    "Paranormal",
    "Mythology",
    "Paranormal Romance",
    "Fiction",
    "Magic"
  ],
  "author": "D.S. Murphy",
  "average_rating": "3.81",
  "url": "https://www.goodreads.com/book/show/28933298-orpheum"
}