{
  "title": "7 Cups for the Searching Soul",
  "description": "Ready to change your life? Learn simple-yet-powerful concepts from the largest mental health community in the world. CEO, founder and psychologist Dr. Glen Moriarty and the 7 Cups community share what they’ve learned help people most. Feeling stuck? Depressed? Anxious? In this free self-help book, 7 Cups for the Searching Soul, the 7 Cups community and founder and psychologist Glen Moriarty have combined all the knowledge they’ve gained in working with those in need daily, including proven research and healing traditions, into an easy-to-read and implement 7-step program. Learn why you feel the way you do and how to break free from thoughts and emotions that keep you stuck. Improve your relationships and your life in seven steps, or “cups”: Cup 1: Open - Share what’s on your heart Cup 2: Attune - Attune to love Cup 3: Practice - Practice skills to increase calm Cup 4: Live - Sleep, eat, and exercise well Cup 5: Accept - Accept what life brings you Cup 6: Care - Care for others that need support Cup 7: Commit - Live according to what is important “An easy yet very informative and eye-opening read. Some of the information consisted of ideas that had never been explained to me by counselors or doctors. Reasons for your emotions and feelings were outlined as well as ideas to help with ones that feel unpleasant or negative...I know I will refer back to this book often.” - Jimilyn “It does open your eyes to see things in a different light.” -- Theresa S. “It can be a real lifesaver to anyone who reads it.” -- MarkFleshman I have been extremely depressed & was searching for something. Reading this opened me up to possibilities.” -- Renee Jolley Learn the secrets to a more fulfilling life from the world’s largest emotional support network, the 7 Cups community, as told by CEO and Founder Glen Moriarty, PsyD. By the end of 7 Cups for the Searching Soul, you will be empowered to move beyond worry and fear toward the life your heart desires.",
  "genres": [
    "Self Help",
    "Psychology",
    "Nonfiction"
  ],
  "author": "7Cups community",
  "average_rating": "4.09",
  "url": "https://www.goodreads.com/book/show/28930126-7-cups-for-the-searching-soul"
}