{
  "title": "A Good Woman",
  "description": "From the glittering ballrooms of Manhattan to the fires of World War I, Danielle Steel takes us on an unforgettable journey in her new novel—a spellbinding tale of war, loss, history, and one woman’s unbreakable spirit....\n\n\nNineteen-year-old Annabelle Worthington was born into a life of privilege, raised amid the glamour of New York society, with glorious homes on Fifth Avenue and in Newport, Rhode Island. But everything changed on a cold April day in 1912, when the sinking of the Titanic shattered her family and her privileged world forever. Finding strength within her grief, Annabelle pours herself into volunteer work, nursing the poor, igniting a passion for medicine that would shape the course of her life. But for Annabelle, first love, and a seemingly idyllic marriage, will soon bring more grief—this time caused by the secrets of the human heart. Betrayed, and pursued by a scandal she does not deserve, Annabelle flees New York for war-ravaged France, hoping to lose herself in a life of service. There, in the heart of the First World War, in a groundbreaking field hospital run by women, Annabelle finds her true calling, working as an ambulance medic on the front lines, studying medicine, saving lives. And when the war ends, Annabelle begins a new life in Paris—now a doctor, a mother, her past almost forgotten…until a fateful meeting opens her heart to the world she had left behind. Finding strength in the most unlikely of friendships, pulling together the broken fragments of her life, Annabelle will return to New York one more time—this time as a changed woman, a woman of substance, infused with life’s experience, building a future filled with hope…out of the rich soil of the past. Filled with breathtaking images and historical detail, Danielle Steel’s new novel introduces one of her most unique and fascinating characters: Annabelle Worthington, a remarkable woman, a good woman, a true survivor who triumphs against overwhelming odds. For Annabelle’s story is more than compelling fiction, it is a powerful celebration of life, dignity, and courage—and a testament to the human will to survive.",
  "genres": [
    "Romance",
    "Fiction",
    "Historical Fiction",
    "Historical",
    "Chick Lit",
    "Drama",
    "Novels"
  ],
  "author": "Danielle Steel",
  "average_rating": "4.07",
  "url": "https://www.goodreads.com/book/show/2892420-a-good-woman"
}