{
  "title": "The Scarlet Thread",
  "description": "An alternate cover edition exists here.My name Kaidance Monroe, and sometimes when I touch people, I see how they die. After I saw my little brother’s death but failed to stop it, my parents abandoned me to a juvenile detention facility. I don’t let people touch me anymore. Not my fingertips, not my skin, not my heart. I make my own clothes by stitching together the donations we get; usually a bunch of crap that fits like a parachute. My sweater is a patchwork of different shades of inky, dark squares. I make plain gray skirts that hang to my knees, with cute or funny T-shirts sewed in. They clash ironically with my unsmiling face. My Allstar high-tops are black and frayed, like my soul. I also wear a chunk of brightly colored legos around my neck. My little brother was working on it the day he died. The day I failed to save him. It’s unfinished, so I’ll never know what it was meant to be. Most days, I just try to get by. But then I got a visit from a cute guy, who tricked me into giving up my secrets. He said I was special. That he needed me. For a while, I believed him. But once I found out what I could really do, I learned everybody wanted the power I possessed. The power to destroy deities. To kill gods. To end the world... or to save it. My heart is torn, and those I loved most betrayed me. I'm trying so hard to do what's right, but nobody can tell me what that is anymore, and the moral boundaries I'd always let define my life have been shattered. Whose rules should I obey now? Or do I have to make my own? The Scarlet Thread is a dark fantasy for fans of Greek mythology and Gothic romance. Fans of Fallen and Percy Jackson will be captivated by this mashup of fallen angels and forgotten gods.",
  "genres": [
    "Fantasy",
    "Paranormal",
    "Young Adult",
    "Mythology",
    "Urban Fantasy",
    "Magic",
    "Romance"
  ],
  "author": "D.S. Murphy",
  "average_rating": "3.72",
  "url": "https://www.goodreads.com/book/show/28932875-the-scarlet-thread"
}