{
  "title": "Doorway of the Triquetra",
  "description": "Through the ancient power of the medallion, Mira is the next Jaguar Witch, bound by the blood of the Jaguar, to find the Doorway of the Triquetra where her past lives are bound--to four immortal men.On the misty streets of Saint Louis, late at one night, Mira spots something she could not possibly be seeing on these city streets. When she peeks to see it has come after her, an old woman stands before her, long, black hair, threaded with black fur, and shot through with silver, falls down the old woman's back. She cannot get a sense of her age. Mira senses the jaguar she'd spotted, only moments before, in the movements of this old woman before her. One moment, she appears very old, the next, strong and supple. Her eyes have a strange mixture of yellow-gold, and dark gray. She hands Mira a large, silver disk. Mira looks down at the ancient disk, to find she is holding some kind of medallion, engraved with Hebrew lettering, and when she looks up, the old woman is gone.The answers to the medallion lead her on a journey to find the Doorway of the Triquerta and revelations of her kin, the Jaguar people, the ancient shapeshifters. Before the doorway stands an old dragon. He is the keeper of the doorway. Once the doorway is open, she can see across the veil. There is no turning back. There is no shutting the door, once it's opened. Mira must find a way to go through the doorway. She is kin to the Jaguar People. She must walk the dangerous path of the Way of the Stone and live to write the book, a key to those who can perceive that which they cannot see. But she must journey into the underworld and learn ancient mysteries to be the living key--and there are those who do not want this book written--and will do anything to stop her.The old woman's words lead Mira to Denver, Colorado where she finds herself at a huge, gothic mansion and meets a handsome man, by the name of Micah, who shows her how the paths she has taken, in her past lives, have led her to this place, now, in her current life. She must learn to integrate her past lives to succeed in taking her rightful place as the next Jaguar Witch to walk the Way of the Stone. Mira also meets a man in silver and white, named Lucius, and two other men, named Roman and Caesar, named after the lifetimes they had led in Rome. These four men have come to awaken her, to help her remember her past lives, and the part they will play now.Mira must come into her next power to stop forces, who will do anything to stop her. The old woman comes to her, again, and teaches her the magic of shape-shifting. She is part of an ancient clan of shape-shifters, the Jaguar People. Magic presses in on her everywhere. She must fight old fears, taught to her by the church, and remember knowledge of things she does not want to remember, things that will bring back an evil sorcerer, who has destroyed her before. Forces of chaos press in on her. Behind every corner hides another attempt on her life, and she does not know what power lies waiting to destroy her, in this lifetime, too, if she should fail, yet again. Not everything is as it seems.",
  "genres": [
    "Fantasy",
    "Urban Fantasy",
    "Magic"
  ],
  "author": "Lenore Wolfe",
  "average_rating": "3.58",
  "url": "https://www.goodreads.com/book/show/11813417-doorway-of-the-triquetra"
}