{
  "title": "Crown of Blood: The Deadly Inheritance of Lady Jane Grey",
  "description": "\"Good people, I am come hither to die, and by a law I am condemned to the same.” These were the heartbreaking words of a seventeen-year-old girl, Lady Jane Grey, as she stood on the scaffold awaiting death on a cold February morning in 1554. Minutes later her head was struck from her body with a single stroke of a heavy axe. Her death for high treason sent shockwaves through the Tudor world, and served as a gruesome reminder to all who aspired to a crown that the axe could fall at any time.Jane is known to history as \"the Nine Days Queen,\" but her reign lasted, in fact, for thirteen days. The human and emotional aspects of her story have often been ignored, although she is remembered as one of the Tudor Era’s most tragic victims. While this is doubtlessly true, it is only part of the complex jigsaw of Jane’s story. She was a remarkable individual with a charismatic personality who earned the admiration and affection of many of those who knew her. All were impressed by her wit, passion, intelligence, and determined spirit. Furthermore, the recent trend of trying to highlight her achievements and her religious faith has, in fact, further obscured the real Jane, a young religious radical who saw herself as an advocate of the reformed faith—Protestantism—and ultimately became a martyr for it.Crown of Blood is an important and significant retelling of an often-misunderstood tale: set at the time of Jane’s downfall and following her journey through to her trial and execution, each chapter moves between the past and the “present,” using a rich abundance of primary source material (some of which has never been published) in order to paint a vivid picture of Jane’s short and turbulent life. This dramatic narrative traces the dangerous plots and web of deadly intrigue in which Jane became involuntarily tangled—and which ultimately led to a shocking and catastrophic conclusion.",
  "genres": [
    "History",
    "Nonfiction",
    "Biography",
    "Tudor Period",
    "Historical",
    "British Literature",
    "Audiobook"
  ],
  "author": "Nicola Tallis",
  "average_rating": "3.99",
  "url": "https://www.goodreads.com/book/show/28943771-crown-of-blood"
}