{
  "title": "Terms of Denouncement",
  "description": "In this third episode of the TERMS series, Lazarous, the empathic dragon who protected Jarvis and Telos in Terms Defilement, has the foresight and experience to see that history is repeating itself. He is haunted by memories of a past failure and driven to protect in others what he believes he cannot have himself; connection and affection. But the Church of Saxony stands in Lazarous’s way of living quietly. Even while he joins Jarvis in preparing for war against those plotting genocide of non-human races, Lazarous struggles to protect Jarvis’s relationship with Telos by denying his own loneliness and need for their strength and devotion. Wearing down on his own empathy is the unsatisfied blood bond between the three of them.Telos, with his empathy blossoming and haunted by visions of a man in gray, refuses to be left behind as Jarvis and Lazarous return to danger. Jarvis wants to leave Telos behind in the safety of the vampire court but Telos fights back, struggling to be seen as more than a fragile kitten. He is willing to face the risk of crossing the warlock who tore apart his mind to stay with the men he loves and respects. Should he fail to show his strength, the young shape-shifter will loose more than his self-respect but also his mind. The angry ljosalfr queen continues to prowl on the edges of his awareness.Jarvis, without the empathy that Lazarous and Telos share, is unaware of the invisible struggle. As a warrior and a protector, he is seeking both the truth beneath the lies of the Saxony church and the warlock who tortured Telos. War between Saxony and the vampire queen appears inevitable. The warlock has not been idle. More than the truth hangs in the scales as Jarvis resolves to return to Saxony. Failure to play the game of intrigue, politics, and religion will end in the destruction of those he has sworn to protect.",
  "genres": [],
  "author": "Ciara Darren",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/28947792-terms-of-denouncement"
}