{
  "title": "Rose of Prophecy: A Beauty and the Beast Novella",
  "description": "She is afraid. Not because she is alone. Not because thick roiling clouds obscure the moon. Not because the wind rushes through the forest like a wild dragon. She is afraid because she is late. And to be late means death.  Her life had been happy once.  Despite the destruction wreaked by Tauscher, traitor to the King. Despite the distant war led by the Prince and fought with the help of her three brothers. Despite her own poorly-chosen nickname of Beauty, she'd enjoyed life.  Of course, that was also before her father left home on a hopeful errand but returned weary and ill, bearing a velvety scarlet rose which he claimed would never wither. But even life in the ancient hall, tucked away in the center of Mosswood, surrounded by roses of every description, overshadowed with mystery and home to a scarred figure who was more beast than man, wasn't too bad after a time.  But now...now, in a flash of light, Beauty finally glimpses the truth. And the cost. The price which must be paid, or the sacrifice which must be made.  It is a curse which even love alone may not be able to break.  Writing in the Light Publishing presents the first of nine novellas in  The Legends of Light series!  \nRose of Prophecy,\na fantasy seeped retelling of Beauty and the Beast containing an ancient promise, an invisible spy, and the legendary Stieg der, is more than a mere retelling of a favorite fairy tale.  Each novella focuses on one of the nine aspects of the Fruit of the Spirit while also following the conflict between the Prince and Tauscher and expertly retelling and twisting some popular, as well as several lesser known, fairy tales.",
  "genres": [
    "Fantasy",
    "Beauty and The Beast",
    "Christian",
    "Young Adult",
    "Romance",
    "Fairy Tale Retellings",
    "Retellings"
  ],
  "author": "Hope Ann",
  "average_rating": "4.07",
  "url": "https://www.goodreads.com/book/show/28942618-rose-of-prophecy"
}