{
  "title": "Survival",
  "description": "Warning: This story is for mature adults only. It contains violence, mature and explicit content and non-consensual/dubious, graphic sexual activity that some readers may find upsetting. This is a dark erotic thriller, not to be confused with a dark romance. HER I'm usually brutally honest. I don't like to sugar coat shit or beat around the bush. But this time, I couldn't want to run further from my own destructive truth. I'd been sold. Sold. Like some kind of dog to a man born of cruelty and carnage. A man who rules a criminal organization on a global scale, and now... rules my body but, most importantly... my freedom. I dreaded my days back in the warehouse; caged, beaten, awaiting a fate I had no control over. All thanks to his billion-dollar industry in human trafficking and God knows what other line of bullshit he runs. And now, I belong to him. Forced to live under his roof and his rules, I now live a life of fear and constraint. I don't want to believe it but...it's getting harder and harder to fight him, especially when his touch can burn so painfully good when I finally surrender to it. My body may want him, but my mind and my heart are far more calculating. I haven't lost hope...no matter what he does to me. I refuse to break. I will escape him and his reign of terror over me. Whether its tomorrow or five years from now, I won't stop until I have him cold and dead at my feet. And that's the real fucking honest truth. HIM I never thought I could be this fucking consumed by another person - captivated in such a way that it borders on obsession. Jaden is mine now and the truth of that makes my blood run hot and fast in my veins. The feel of her perfect body under mine is like pure ecstasy, even when she's fighting me...or herself. She can try to deny it all she wants, but she can't hide from me. I know desire when I see it, even when its shadowed by resistance and then ultimately guilt. That fire in her eyes burns me from the inside out, and it just makes me crave her more. I know she's fighting for her freedom, calculating her escape, but in time, she will bend to my will until she finally breaks - until she realizes there is no freedom from me, no escape. Period. She's mine and I won't stop until it’s so deeply embedded into her mind that the mere thought of denying it brings her physical pain...because it will. I have big plans for my little warrior princess and I can't wait for the impending pleasurable eternity of it all. *NOTE: For every book that is sold, a portion of the proceeds will be donated to a charity that benefits victims of human trafficking.*",
  "genres": [
    "Dark",
    "Dark Romance",
    "BDSM",
    "Abuse",
    "Contemporary",
    "Erotica",
    "Suspense"
  ],
  "author": "Jay Marie",
  "average_rating": "4.36",
  "url": "https://www.goodreads.com/book/show/28941478-survival"
}