{
  "title": "Thames Valley Tales",
  "description": "Thames Valley Tales is a light-hearted yet thought-provoking collection of 15 short stories by UK-based author Tim Walker. These original stories are based on the author's experience of living in London and Thames valley towns, and combine contemporary tales with the rich history and mythology of an area stretching from London beyond Oxford into the heart of rural England. The collection includes 'Maidenhead Thicket', selected as short story of the month by a US-based online magazine - described as a very nicely rendered story, and features the ghost of the legendary highwayman, Dick Turpin. 'The White Horse' is a story built around the famous white horse carving on the Berkshire Downs, recently dated as being 1000 years older than previously thought. 'Murder at Henley Regatta' is an intriguing whodunit, and 'The Colnbrook Caper' is a pacey crime thriller. 'The Grey Lady' is a historical ghost story, and 'The Merry Women of Windsor' is an updating of Shakespeare's classic comedy play. Thames Valley Tales is a light-hearted and at times humorous collection of stories ideally suited to bedtime or holiday reading that will amuse, delight and, hopefully, inform the reader about the rich history of the Thames Valley as it winds 215 miles from the Gloucestershire countryside through London and out to the North Sea. The book also has a factual chapter and map of the Thames Valley and the towns through which the 184 mile Thames Path passes. It is a walk through history and the natural beauty of England that can be completed in 4-5 days. Other stories include 'Runnymede Rebellion' which reflects on the legacy of Magna Carta and the true meaning of personal freedom; 'The Devil's Highway' deals with a section of the Roman road from London to Bath; 'The Seesaw Sea of Fate' follows two former work mates on a pub crawl through London, with many literary references along the way. Each story has been thoughtfully constructed and the historical and factual references have been carefully researched. These stories were written over a three year period from 2012-2015, when the author was in a reflective mood at home whilst battling various medical problems including cancer. A common theme - life along the Thames valley - became apparent to the author in early 2015 when he started knocking it into shape. I hope you enjoy the book, and please leave a reference rating and comment.",
  "genres": [],
  "author": "Tim  Walker",
  "average_rating": "3.89",
  "url": "https://www.goodreads.com/book/show/28936481-thames-valley-tales"
}