{
  "title": "Lean Thinking: Banish Waste and Create Wealth in Your Corporation",
  "description": "Expanded, updated, and more relevant than ever, this bestselling business classic by two internationally renowned management analysts describes a business system for the twenty-first century that supersedes the mass production system of Ford, the financial control system of Sloan, and the strategic system of Welch and GE. It is based on the Toyota (lean) model, which combines operational excellence with value-based strategies to produce steady growth through a wide range of economic conditions.  In contrast with the crash-and-burn performance of companies trumpeted by business gurus in the 1990s, the firms profiled in Lean Thinking -- from tiny Lantech to midsized Wiremold to niche producer Porsche to gigantic Pratt & Whitney -- have kept on keeping on, largely unnoticed, along a steady upward path through the market turbulence and crushed dreams of the early twenty-first century. Meanwhile, the leader in lean thinking -- Toyota -- has set its sights on leadership of the global motor vehicle industry in this decade.  Instead of constantly reinventing business models, lean thinkers go back to basics by asking what the customer really perceives as value. (It's often not at all what existing organizations and assets would suggest.) The next step is to line up value-creating activities for a specific product along a value stream while eliminating activities (usually the majority) that don't add value. Then the lean thinker creates a flow condition in which the design and the product advance smoothly and rapidly at the pull of the customer (rather than the push of the producer). Finally, as flow and pull are implemented, the lean thinker speeds up the cycle of improvement in pursuit of perfection. The first part of this book describes each of these concepts and makes them come alive with striking examples.  Lean Thinking clearly demonstrates that these simple ideas can breathe new life into any company in any industry in any country. But most managers need guidance on how to make the lean leap in their firm. Part II provides a step-by-step action plan, based on in-depth studies of more than fifty lean companies in a wide range of industries across the world.  Even those readers who believe they have embraced lean thinking will discover in Part III that another dramatic leap is possible by creating an extended lean enterprise for each of their product families that tightly links value-creating activities from raw materials to customer.  In Part IV, an epilogue to the original edition, the story of lean thinking is brought up-to-date with an enhanced action plan based on the experiences of a range of lean firms since the original publication of Lean Thinking.  Lean Thinking does not provide a new management \"program\" for the one-minute manager. Instead, it offers a new method of thinking, of being, and, above all, of doing for the serious long-term manager -- a method that is changing the world.",
  "genres": [
    "Business",
    "Nonfiction",
    "Management",
    "Leadership",
    "Buisness",
    "Productivity",
    "Entrepreneurship"
  ],
  "author": "James P. Womack",
  "average_rating": "3.92",
  "url": "https://www.goodreads.com/book/show/289467.Lean_Thinking"
}