{
  "title": "The Vanishing Velázquez: A 19th-Century Bookseller's Obsession with a Lost Masterpiece",
  "description": "From one of the world’s most expert art critics, the incredible true story—part art history and part mystery—of a Velázquez portrait that went missing and the obsessed nineteenth-century bookseller determined to prove he had found it.When John Snare, a nineteenth-century provincial bookseller, traveled to a liquidation auction, he stumbled on a vivid portrait of King Charles I that defied any explanation. The Charles of the painting was young—too young to be king—and yet also too young to be painted by the Flemish painter to which the work was attributed. Snare had found something incredible—but what?His research brought him to Diego Velazquez, whose long-lost portrait of Prince Charles has eluded art experts for generations. Velázquez (1599–1660) was the official painter of the Madrid court, during the time the Spanish Empire teetered on the edge of collapse. When Prince Charles of England—a man wealthy enough to help turn Spain’s fortunes—ventured to the court to propose a marriage with a Spanish princess, he allowed just a few hours to sit for his portrait. Snare believed only Velázquez could have met this challenge. But in making his theory public, Snare was ostracized, victim to aristocrats and critics who accused him of fraud, and forced to choose, like Velázquez himself, between art and family.A thrilling investigation into the complex meaning of authenticity and the unshakable determination that drives both artists and collectors of their work, The Vanishing Velázquez travels from extravagant Spanish courts in the 1700s to the gritty courtrooms and auction houses of nineteenth-century London and New York. But it is above all a tale of mystery and detection, of tragic mishaps and mistaken identities, of class, politics, snobbery, crime, and almost farcical accident. It is a magnificently crafted page-turner, a testimony to how and why great works of art can affect us to the point of obsession.",
  "genres": [
    "Art",
    "Nonfiction",
    "History",
    "Art History",
    "Biography",
    "Mystery",
    "Audiobook"
  ],
  "author": "Laura Cumming",
  "average_rating": "3.82",
  "url": "https://www.goodreads.com/book/show/28945933-the-vanishing-vel-zquez"
}