{
  "title": "The Revolution's Last Men: The Soldiers Behind the Photographs",
  "description": "The Stories of the Final Six Surviving Soldiers Who Fought in the American RevolutionDuring the Civil War that threatened to tear the United States apart came the realization that only a handful of veterans of the American Revolution still survived—men who had fought the war that created the nation. Six of these men were photographed and interviewed for a book by Reverend E. B. Hillard that appeared late in 1864. Their images have captivated generations since then; but—through a combination of faded memories and the interviewer’s patriotic agenda—the biographies accompanying these amazing photographs were garbled and distorted, containing information that ranged from inaccurate to implausible. Now for the first time the military careers of these men have been researched in detail using a wide range of primary sources. The result is a new perspective on the actual service of these soldiers, from enlistment to discharge, along with new details of their relatively quiet postwar lives. The Revolution’s Last Men presents the original biographical interviews published in 1864, pension depositions and other first-hand accounts given by each man later in life, and an up-to-date biography examining each soldier’s service and discussing the inaccuracies and uncertainties of the previously published accounts. To complement the photographs taken in 1864, original drawings depict the men as they may have appeared when they were soldiers, using current research on military artifacts and material culture. Also included are additional photographs of some of the men that were not part of the 1864 collection but taken when their status as the last known survivors of the American Revolution made them celebrities. While the photographs of these aged veterans continue to inspire, this book puts their service into perspective and allows these men to be appreciated for who they really were and for their great and unique service to their country.",
  "genres": [
    "History",
    "American Revolution",
    "Nonfiction",
    "American Revolutionary War",
    "Biography",
    "American History"
  ],
  "author": "Don N. Hagist",
  "average_rating": "4.06",
  "url": "https://www.goodreads.com/book/show/28956777-the-revolution-s-last-men"
}