{
  "title": "All American Boys",
  "description": "A 2016 Coretta Scott King Author Honor book, and recipient of the Walter Dean Myers Award for Outstanding Children’s Literature.In this New York Times bestselling novel, two teens—one black, one white—grapple with the repercussions of a single violent act that leaves their school, their community, and, ultimately, the country bitterly divided by racial tension.A bag of chips. That’s all sixteen-year-old Rashad is looking for at the corner bodega. What he finds instead is a fist-happy cop, Paul Galluzzo, who mistakes Rashad for a shoplifter, mistakes Rashad’s pleadings that he’s stolen nothing for belligerence, mistakes Rashad’s resistance to leave the bodega as resisting arrest, mistakes Rashad’s every flinch at every punch the cop throws as further resistance and refusal to STAY STILL as ordered. But how can you stay still when someone is pounding your face into the concrete pavement?There were Quinn Collins—a varsity basketball player and Rashad’s classmate who has been raised by Paul since his own father died in Afghanistan—and a video camera. Soon the beating is all over the news and Paul is getting threatened with accusations of prejudice and racial brutality. Quinn refuses to believe that the man who has basically been his savior could possibly be guilty. But then Rashad is absent. And absent again. And again. And the basketball team—half of whom are Rashad’s best friends—start to take sides. As does the school. And the town. Simmering tensions threaten to explode as Rashad and Quinn are forced to face decisions and consequences they had never considered before.Written in tandem by two award-winning authors, this four-starred reviewed tour de force shares the alternating perspectives of Rashad and Quinn as the complications from that single violent moment, the type taken directly from today’s headlines, unfold and reverberate to highlight an unwelcome truth.",
  "genres": [
    "Young Adult",
    "Fiction",
    "Realistic Fiction",
    "Contemporary",
    "Banned Books",
    "Audiobook",
    "Race"
  ],
  "author": "Jason Reynolds",
  "average_rating": "4.29",
  "url": "https://www.goodreads.com/book/show/28954063-all-american-boys"
}