{
  "title": "Param Dharm",
  "description": "Official website : http://www.paramdharm.orgParam Dharm was written in the morning dawn (Brahm Muhurt) on the first Thursday of spring season in the year 2007 by Param Pujya Adhyatmik Neta Krishna Mohan Shankar Yogi in the state of ecstacy (samadhi). “Param Dharm” is the origin of Dharm. “Param Dharm” is that innate form of Dharm which people have forgotten. Life is full of pleasure and happiness. “Param Dharm” gives us the direction for living a prosperous life. “Param Dharm” makes the way for living of standard and life of standard together.“Param Dharm” is not a bunch of thousands of words. It is not a vast description and analysis. “Param Dharm” is the briefest Granth but contains everything about a real spritual life. Once you do 'paath' of \"PARAM DHARM\" in full concentration, a very beautiful image of life will be generated in your mind.Usually people believe dharm as a part of life by which god is made happy or a life that is very simple, away from all kinds of comforts and luxuries. You will find it very difficult to accept if we say that a person, who gives importance to his desires, likes and dislikes, eats and dresses well and has all kinds of comforts , may be a saint . Perhaps saints wear simple yellow or white clothes only. They eat while sitting on the floor only(suits better if pattal is there), vermilion on forehead is very important, long beard will famous them soon as a saint or babaji. Very lengthy and attractive lectures lead them to a higher position of 'mahant' from saint. His popularity depends upon his taletelling abilities.But we believe that this is not what a saint means. Then what is dharm? what a saint means ? why only dharm is the origin of life?we have said before in the beginning that by doing 'paath' of \"PARAM DHARM\" a very beautiful movie of life begins to run in mind . This life is the root form of dharm . All the misunderstandings about dharm have vanished of those people who have listened its 'paath'. They have got the simplest way of living a beautiful life.Mostly people get messed up with the ways of living. Some get excited in the name of culture and some show off their knowledge by explaining beautiful sayings of great philosophers . People, who talks about culture, emphasizes on the orthodox rituals and forgets about the bad things that these rituals has given us in our legacy. So many beliefs are present which can depressed a person . Absolute opposite to it, some people favours the way of full freedom just for the sake of mind and it is accepted as a status symbol.People have tendency to research on mind. Their most loving work is to find out the most satisfying condition of their mind. If you ever noticed it that if joy is provided to it in a great amount, then it feels unsatisfaction and emptiness more. Due to excess of joy and pleasures people feel more unsatisfied and they get attracted towards philosophy. But here, they get only hollowness in the name of dharm and spirituality.None has the right way of living life after all kinds of research work. freedom of thoughts is there, what else is needed for visionaries? After researching different aspects of their mind, they present their incomplete thoughts (nonsense) in front of all . Between all these thoughts, simple life wishing people are confused so badly, that their miserable condition can be seen all around.\"PARAM DHARM\" has entered in this earth for directing people the supreme way of prosperous living. \"PARAM DHARM\" is not just a book written by thoughts evolved in mind, but it is a 'granth' scripted in the state of ecstacy (samaadhi). Therefore there is not any kind of trap of thoughts. \"PARAM DHARM\" is so simple that even a ten years old child can also understand it by listening its 'paath'.",
  "genres": [],
  "author": "Adhyatmik Neta Krishna Mohan Shankar Yogi",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/28954686-param-dharm"
}