{
  "title": "Frosted Cowboy",
  "description": "Laney Delaney was living the dream. She had a fabulous fiancé and a career as a couture wedding dress designer. But after catching her (not-so-fabulous) fiancé cheating and being accused of upstaging one of her brides at a wedding, Laney finds herself with no boyfriend, no job and no plan.  After some serious soul searching, Laney is determined to start over. She embarks on a design career that takes her from a Rodeo Drive boutique to a flea market stall, but it's worth it—even if it means she has to suck up to her childhood nemesis for help.  At the same time, three very different men vie for her attention: a masseuse/screenwriter with an unfortunate reputation, a stable fireman who just doesn't spark a romantic flame, and the fireman's ridiculously hot co-worker whose illicit under-the-mistletoe kiss still burns Laney's lips.  Professionally and romantically, Laney is on the verge of reinventing her life and finding her true passion—but can she learn to trust again and believe in herself?  If you're looking for funny chick lit or a romantic comedy, Frosted Cowboy by Charlene Ross (a breakout voice in chick lit) is a must-read! You'll never look at one night stands the same again!   Interview with the Author  Q. What was your inspiration to write Frosted Cowboy? A. In a writing class, the teacher had us pull an adjective and a verb from a hat. I got frosted and cowboy. \"What the heck am I going to do with that?\" I thought, so I just wrote, \"'I'll have a Frosted Cowboy,' I said to the bartender.\" I wrote two pages and turned it in; my teacher loved it and wanted more. So I developed it into the story of a woman whose Plan A didn't work out when she had never even considered a Plan B. At the time, my own Plan A was failing, and I had never really considered a Plan B. My story is nothing like Laney's, but I wanted to see where her story would go.  Q. It seems your book could fit into several genres. How would you categorize it? A. Laney Delaney is a lovable heroine who finds herself in ridiculous dating and work situations, so I'd categorize it as chick lit or romantic comedy. There's a light-hearted romance and of course some sex, but I wouldn't say this is a sexy romance novel; more a romantic comedy novel. Anyone looking for love, or could use a laugh, will enjoy this book!  Q. How is Laney's story different from other chick lit? A. Wait, are you saying a chick lit heroine who catches her fiancé cheating on her and then loses her job and has to start over again isn't original?! I'm kidding of course. What sets Laney apart is she's sassy, yet not cool. I liked the idea of a fashion designer who was talented and creative, but not very fashionable. She's a fish out of water, but doesn't know how to jump in the pool, or even if she wants to. In business and in love, she's searching for her true passion and struggles to reconcile what she thinks she needs with what she thinks she wants.  Q. Do you have any more books planned? A. Yes. I don't want to say too much because I'm a bit superstitious, but I'm in the early stages of writing a book intersecting present-day lives of people who share a past. There might be a love triangle. And a little sex. And hopefully a lot of laughter.  If you enjoy fun, light reads with a touch of funny romance, you'll enjoy Frosted Cowboy. Thanks for reading!   Categories  Chick Lit Romantic Comedy Humor: Love, Sex & Marriage Women's Fiction  For readers interested",
  "genres": [
    "Romance",
    "Chick Lit",
    "Contemporary Romance"
  ],
  "author": "Charlene Ross",
  "average_rating": "4.08",
  "url": "https://www.goodreads.com/book/show/28948998-frosted-cowboy"
}