{
  "title": "God's Secret Agents: Queen Elizabeth's Forbidden Priests and the Hatching of the Gunpowder Plot",
  "description": "One evening in 1588, just weeks after the defeat of the Spanish Armada, two young men landed in secret on a beach in Norfolk, England. They were Jesuit priests, Englishmen, and their aim was to achieve by force of argument what the Armada had failed to do by force of arms: return England to the Catholic Church.Eighteen years later their mission had been shattered by the actions of the Gunpowder Plotters -- a small group of terrorists who famously tried to destroy the Houses of Parliament -- for the Jesuits were accused of having designed \"that most horrid and hellish conspiracy.\" In an unusual turn of events, the future of every Catholic they had hoped to save would soon come to depend on the silence of one Oxford carpenter, a man being tortured in the Tower of London for building priest holes, those bunkers in which the Catholic clergy hid from English authorities.Using contemporary documents, Alice Hogge's brilliant new book pieces together a deadly game of cat-and-mouse between priests and government spies, as Queen Elizabeth and her ministers fought to defend the state, and English Catholics fought to defend their souls. It follows the priests -- God's Secret Agents -- from their schooling on the Continent, through their perilous return journeys and their lonely lives in hiding, to the scaffold, where a gruesome death awaited them. To their government they were traitors; to their fellow Catholics they were glorious martyrs. It was a distinction that the Gunpowder Plot would put to the test. Ultimately God's Secret Agents is the story of men who would die for their cause undone by men who would kill for it.",
  "genres": [
    "History",
    "Nonfiction",
    "Religion",
    "Biography",
    "16th Century",
    "17th Century",
    "Catholic"
  ],
  "author": "Alice Hogge",
  "average_rating": "3.90",
  "url": "https://www.goodreads.com/book/show/118137.God_s_Secret_Agents"
}