{
  "title": "Witch: Unleashed. Untamed. Unapologetic.",
  "description": "A compelling book urging modern women to reconnect with their inborn femimine powers.Reclaim your inner witch with the magical rituals, divination tools, spells and ancient wisdom in this revolutionary book.A witch is a woman in her power. She's wise, a healer, someone who is aligned with the cycles of Mother Nature and the phases of the Moon. Yet for so long, the word 'witch' has had negative connotations - being used as an insult, a slur and to perpetuate fear. In this book, third generation hereditary witch Lisa Lister explains the history behind witchcraft, why in past centuries the word 'witch' has led women to be tortured, drowned and burned at the stake, and why the witch is now waking once again in women across the world today.This book will help women to remember, reconnect and reclaim the word 'witch' and its power. It explores the many different versions of witchcraft and their core principles and practices, and shares ancient wisdom made relevant for waking witches, including how · Align your energy with the wheel of the year, the sabbats and the cycles of the Moon· Connect with and trust your intuition· Use divination tools such as oracle cards, scrying and rune reading· Cast circles, create altars and set sacred space· Work with the elements of nature and use herbs and crystals· Discover and work with five different aspects of the the Force of Nature, the Creatrix, the Healer, the Oracle and the Sorceress· Rediscover your powers and manifest your reality with spell castingLisa also shares her own journey to reclaiming the word 'witch', along with personal, hands-on rituals and spells from her family lineage of gypsy witch magic.",
  "genres": [
    "Nonfiction",
    "Witchcraft",
    "Spirituality",
    "Feminism",
    "Witches",
    "Wicca",
    "Self Help"
  ],
  "author": "Lisa Lister",
  "average_rating": "3.58",
  "url": "https://www.goodreads.com/book/show/28956873-witch"
}