{
  "title": "ONE WEEK 1",
  "description": "BeckyA one-week stand with the man I’ve lusted after for years? I’d be a fool to go for it, but a fool is just what he makes me.My brother’s wedding is basically turning into my worst nightmare. I can live with his soon-to-be mother-in-law and her crazy, weeklong “wedding games.” I can push away the thoughts of my passive-aggressive coworkers and my aggressive-aggressive boss. I can enjoy the time with my family and ignore the underlying tension.What I can’t do? Tolerate a week with my old schoolgirl crush.Devon Baxter, one of my brother’s dearest friends, has always had the power to render me tongue-tied and sick with nerves. I mean, the man is a walking hunk of delicious fantasy fuel, and he’s never looked twice at me. Asshole.But why would he? I mean, I guess I’m pretty…pretty dumpy. Pretty plain. Pretty inexperienced in matters of the bedroom. If he shows any kind of interest in me, I know it’s just temporary insanity.The worst part is, I might be okay with that.Yeah…he’s that delectable.DevonI can’t give myself to her long-term, but I can’t stop myself taking her for the short-term. The question is…will one week be enough?I’m a self-made billionaire, one of the hottest bachelors of the year—and still more to come if I have my way. I know how to handle women and give them what they need while taking what I want.And what do I want right now? Imp, my best friend’s little sister. Oh, but he’d have my head if I laid a finger on her. I know, because he told me so years ago, when he caught me…noticing her.But I’m not sure I can resist, not with an entire week spent at her side, with her beautiful hourglass figure tantalizing me left and right, the way it always has. I know she harbors a gigantic crush on me (adorable), and it’s going to be quite a struggle to stop myself taking advantage of that.Short story. Cliffhanger ending. Part 1 of 3. (Very) Adult content.",
  "genres": [],
  "author": "Kristina Weaver",
  "average_rating": "3.82",
  "url": "https://www.goodreads.com/book/show/28959668-one-week-1"
}