{
  "title": "Inside Story: Everyone's Guide to Reporting and Writing Creative Nonfiction",
  "description": "Inside Story\n tackles the myriad approaches to the burgeoning genre of creative nonfiction—from memoir to criticism to literary journalism to the lyric essay—by deeply exploring each stage of the generation, reportage, writing and editing of stories. Drawing on and integrating examples and advice from diverse practitioners in the field, Inside Story extends beyond idea and inspiration with practical advice, examples and exercises geared toward everyone from writing students, citizen journalists, bloggers and working writers. Inside Story provides a keen focus on the fundamental aspects of reporting, including interviewing and researching, while also offering advice and exercises toward writing nonfiction dialogue, devising structure and creating a sense of people and place from the ground-up. The book also explores the ethical implications of writing in the real world, providing insight and humor at each step of the way.“Fellow journalists and memo writers, here is a book to keep close at hand. Not only does Goldberg nail all the ingredients of good writing and reporting, but she also provides an illuminating set of examples from the very best in the industry. It reads the way a book on writing should read.”—Erik Wemple, media critic, the Washington Post\"Who needs a four-year journalism degree or a two-year master's when you have this book? Julia's tome distills the wisdom, wit, fearlessness, judiciousness and sheer joy that all great nonfiction writers need in easy-to-read prose and with great case studies. If you don't win a Pulitzer after reading Inside Story, then you didn't read it close enough.\"—Gustavo Arellano, editor of OC Weekly and author of ¡Ask a Mexican!\"Digital disruption, creative destruction, revolutionary technology, the fall and rise of old and new journalism and publishing paradigms—amid all this noise and opportunity, good writing and honest, well-crafted reporting endure. Julia Goldberg's transcendently intelligent guide offers any fact writer who aspires to navigate the 21st century a beautifully stocked toolbox of advice, strategies, craft wisdom, encouraging examples, and hard-won perspectives on getting the job done right. Beyond its up-to-date practical wealth, Inside Story inspires by being the kind of stylish, authoritative, and vividly alive creative nonfiction it will empower its readers to make.\"—Hal Espen, former editor of Outside magazine",
  "genres": [
    "Writing",
    "Nonfiction",
    "Journalism",
    "Teaching"
  ],
  "author": "Julia Goldberg",
  "average_rating": "4.46",
  "url": "https://www.goodreads.com/book/show/28957362-inside-story"
}