{
  "title": "Deep Run Roots: Stories and Recipes from My Corner of the South",
  "description": "Vivian Howard, star of PBS's A CHEF'S LIFE, celebrates the flavors of North Carolina's coastal plain in more than 200 recipes and stories.This new classic of American country cooking proves that the food of Deep Run, North Carolina--Vivian's home--is as rich as any culinary tradition in the world. Organized by ingredient with dishes suited to every skill level--from beginners to confident cooks--DEEP RUN ROOTS features time-honored simple preparations, extraordinary meals from her acclaimed restaurant Chef and the Farmer, and recipes that bring new traditions to life. Home cooks will find photographs for every single recipe.As much a storybook as it is a cookbook, DEEP RUN ROOTS imparts the true tale of Southern food: rooted in family and tradition, yet calling out to the rest of the world.Ten years ago, Vivian opened Chef and the Farmer and put the nearby town of Kinston on the culinary map. But in a town paralyzed by recession, she couldn't hop on every new culinary trend. Instead, she focused on rural development: If you grew it, she'd buy it. Inundated by local sweet potatoes, blueberries, shrimp, pork, and beans, Vivian learned to cook the way generations of Southerners before her had, relying on resourcefulness, creativity, and the old ways of preserving food.DEEP RUN ROOTS is the result of those years of effort to discover the riches of Eastern North Carolina. Like The Fannie Farmer Cookbook, The Art of Simple Food, and The Taste of Country Cooking before it, this is landmark work of American food writing.Recipes include:Family favorites like Blueberry BBQ Chicken, Creamed Collard-Stuffed Potatoes, Fried Yams with Five-Spice Maple Bacon Candy, Chicken and Rice, and Country-Style Pork Ribs in Red Curry-Braised Watermelon,Crowd-pleasers like Butterbean Hummus, Tempura-Fried Okra with Ranch Ice Cream, Pimiento Cheese Grits with Salsa and Pork Rinds, Cool Cucumber Crab Dip, and Oyster Pie,Show-stopping desserts like Warm Banana Pudding, Peaches and Cream Cake, Spreadable Cheesecake, and Pecan-Chewy Pie,And 200 more quick breakfasts, weeknight dinners, holiday centerpieces, seasonal preserves, and traditional preparations for all kinds of cooks.---Interior photographs by Rex Miller. Jacket photograph by Stacey Van Berkel Photography. Illustrations by Tatsuro Kiuchi.",
  "genres": [
    "Cookbooks",
    "Cooking",
    "Nonfiction",
    "Food",
    "Memoir",
    "Reference",
    "Southern"
  ],
  "author": "Vivian Howard",
  "average_rating": "4.49",
  "url": "https://www.goodreads.com/book/show/28962990-deep-run-roots"
}