{
  "title": "Perfume: The Story of a Murderer",
  "description": "The year is 1738; the place, Paris. A baby is born under a fish-monger’s bloody table in a marketplace, and abandoned. Orphaned, passed over to the monks as a charity case, already there is something in the aura of the tiny infant that is unsettling. No one will look after him; he is somehow too demanding, and, even more disturbing, something is as his wet nurse tries to explain, he doesn’t smell the way a baby should smell; indeed, he has no scent at all.Slowly, as we watch Jean-Baptiste Grenouille cling stubbornly to life, we begin to realize that a monster is growing before our eyes. With mounting unease, yet hypnotized, we see him explore his powers and their effect on the world around him. For this dark and sinister boy who has no smell himself possesses an absolute sense of smell, and with it he can read the world to discover the hidden truths that elude ordinary men. He can smell the very composition of objects, and their history, and where they have been, he has no need of the light, and darkness is not dark to him, because nothing can mask the odors of the universe.As he leaves childhood behind and comes to understand his terrible uniqueness, his obsession becomes the quest to identify, and then to isolate, the most perfect scent of all, the scent of life itself.At first, he hones his powers, learning the ancient arts of perfume-making until the exquisite fragrances he creates are the rage of Paris, and indeed Europe. Then, secure in his mastery of these means to an end, he withdraws into a strange and agonized solitude, waiting, dreaming, until the morning when he wakes, ready to embark on his monstrous to find and extract from the most perfect living creatures—the most beautiful young virgins in the land— that ultimate perfume which alone can make him, too, fully human. As his trail leads him, at an ever-quickening pace, from his savage exile to the heart of the country and then back to Paris, we are caught up in a rising storm of terror and mortal sensual conquest until the frenzy of his final triumph explodes in all its horrifying consequences.Told with dazzling narrative brilliance and the haunting power of a grown-up fairy tale, Perfume is one of the most remarkable novels of the last fifty years.",
  "genres": [
    "Fiction",
    "Classics",
    "Historical Fiction",
    "Horror",
    "Thriller",
    "Mystery",
    "Crime"
  ],
  "author": "Patrick Süskind",
  "average_rating": "4.04",
  "url": "https://www.goodreads.com/book/show/2897.Perfume"
}