{
  "title": "The Life & Teachings of Carlos Castaneda",
  "description": "The Life & Teachings of Carlos Castaneda demystifies what Castaneda sought to hide and delivers a detailed portrait of an enigmatic, driven seeker that passes beyond mere description to the very assemblage point of Carlos Castaneda. It is the first book published since Castaneda's death in 1998 to assess the meaning of his life both as a person and a Nagual, and, more importantly, to examine his ideas and their unrecognized primary source.Drawing on an original reading of texts and research, as well as his thirty years study and practice of esotericism, William Patrick Patterson uncovers the underlying threads that weave themselves like snakes through the fledgling Peruvian anthropologist's life, ones which led him to forsake his European intellectual membership for that of the dark world of sorcery and \"break the human mold\" to become a Nagual. Explored, too, are the questions of who don Juan really was and what actually happened with the jump into the abyss. The main ideas salted throughout Castaneda's ten major books are succinctly summarized and then compared idea-for-idea with those of an ancient, esoteric teaching to show how Castaneda disguised his source by giving the ideas a sorceric twist. Carlos Castaneda's books, particularly his early ones, showed a great narrative gift, often poetic, verging on the archetypal. His descriptions of his sorceric relationship with don Juan touched the hearts and minds of millions of readers. Patterson does justice to this and Castaneda's seriousness, intent and courage, but he also depicts Castaneda's descent in which he, the arch trickster, tricked himself into believing that the inner silence and attention of the Nagual had emptied him of his person.Self-blinded to his ambivalence toward women, fear of men and need for total power, Castaneda sought to control all aspects of his students lives, creating a rigid hierarchy, cultivating jealousies and secrecy and playing sexual power games, all in the name of breaking the human mold which would free them to travel to inorganic worlds. When Castaneda's death, the so-called trigger event, occurred, three of the four witches disappeared, the remains of one only recently found in Death Valley. The other two are assumed to have also committed suicide. There is much to be learned from the many aspects and phases of Castaneda's life that every sincere seeker could long ponder.Hardcover, chronology, notes, index, appendices.",
  "genres": [
    "Magick"
  ],
  "author": "William Patrick Patterson",
  "average_rating": "3.88",
  "url": "https://www.goodreads.com/book/show/2898191-the-life-teachings-of-carlos-castaneda"
}