{
  "title": "J. K. Rowling: From Welfare To Billionaire",
  "description": "J. K. From Welfare To BillionaireRowling has lived a \"rags to riches\" life story, in which she progressed from living on state benefits to billionaire status within five years. She is the United Kingdom's best-selling living author, with sales in excess of £238m. The 2008 Sunday Times Rich List estimated Rowling's fortune at $1.1 Billion, ranking her as the twelfth richest woman in the United Kingdom. Forbes ranked Rowling as the 48th most powerful celebrity of 2007, and Time magazine named her as a runner-up for its 2007 Person of the Year, noting the social, moral, and political inspiration she has given her fans. In October 2010, Rowling was named the \"Most Influential Woman in Britain\" by leading magazine editors. She has supported charities including Comic Relief, One Parent Families, Multiple Sclerosis Society of Great Britain and Lumos.In 1995, Rowling finished her manuscript for Harry Potter and the Philosopher's Stone on an old manual typewriter. Upon the enthusiastic response of Bryony Evens, a reader who had been asked to review the book's first three chapters, the Fulham-based Christopher Little Literary Agents agreed to represent Rowling in her quest for a publisher. The book was submitted to twelve publishing houses, all of which rejected the manuscript. A year later she was finally given the green light by editor Barry Cunningham from Bloomsbury, a publishing house in London. The decision to publish Rowling's book owes much to Alice Newton, the eight-year-old daughter of Bloomsbury's chairman, who was given the first chapter to review by her father and immediately demanded the next. Although Bloomsbury agreed to publish the book, Cunningham says that he advised Rowling to get a day job, since she had little chance of making money in children's books. Soon after, in 1997, Rowling received an £8000 grant from the Scottish Arts Council to enable her to continue writing.In June 1997, Bloomsbury published Philosopher's Stone with an initial print run of 1,000 copies, 500 of which were distributed to libraries. Today, such copies are valued between £16,000 and £25,000. Five months later, the book won its first award, a Nestlé Smarties Book Prize. In February, the novel won the British Book Award for Children's Book of the Year, and later, the Children's Book Award. In early 1998, an auction was held in the United States for the rights to publish the novel, and was won by Scholastic Inc., for US$105,000. Rowling said that she \"nearly died\" when she heard the news. In October 1998, Scholastic published Philosopher's Stone in the US under the title of Harry Potter and the Sorcerer's Stone, a change Rowling says she now regrets and would have fought if she had been in a better position at the time. Rowling moved from her flat with the money from the Scholastic sale, into 19 Hazelbank Terrace in Edinburgh.jk rowling biography, jk rowling biography kindle, jk rowling book, jk rowling dvd, magic beyond words, jk rowling autobiography, jk rowling new book",
  "genres": [],
  "author": "Alexander Blair",
  "average_rating": "3.20",
  "url": "https://www.goodreads.com/book/show/28966554-j-k-rowling"
}