{
  "title": "In the Great Green Room: The Brilliant and Bold Life of Margaret Wise Brown",
  "description": "The extraordinary life of the woman behind the beloved children’s classics Goodnight Moon and The Runaway Bunny comes alive in this fascinating biography of Margaret Wise Brown. Margaret’s books have sold millions of copies all over the world, but few people know that she was at the center of a children’s book publishing revolution. Her whimsy and imagination fueled a steady stream of stories, book ideas, songs, and poems and she was renowned for her prolific writing and business savvy, as well as her stunning beauty and endless thirst for adventure.Margaret started her writing career by helping to shape the curriculum for the Bank Street School for children, making it her mission to create stories that would rise above traditional fairy tales and allowed girls to see themselves as equal to boys. At the same time, she also experimented endlessly with her own writing. Margaret would spend days researching subjects, picking daisies, cloud gazing, and observing nature, all in an effort to precisely capture a child’s sense of awe and wonder as they discovered the world.Clever, quirky, and incredibly talented, Margaret embraced life with passion, lived extravagantly off of her royalties, went on rabbit hunts, and carried on long and troubled love affairs with both men and women. Among them were two great loves in Margaret’s life. One was a gender-bending poet and the ex-wife of John Barrymore. She went by the stage name of Michael Strange and she and Margaret had a tempestuous yet secret relationship, at one point living next door to each other so that they could be together. After the dissolution of their relationship and Michael’s death, Margaret became engaged to a younger man, who also happened to be the son of a Rockefeller and a Carnegie. But before they could marry Margaret died unexpectedly at the age of forty-two, leaving behind a cache of unpublished work and a timeless collection of books that would go on become classics in children’s literature.In In the Great Green Room , author Amy Gary captures the eccentric and exceptional life of Margaret Wise Brown, and drawing on newly-discovered personal letters and diaries, reveals an intimate portrait of a creative genius whose unrivaled talent breathed new life in to the literary world.",
  "genres": [
    "Biography",
    "Nonfiction",
    "Biography Memoir",
    "Books About Books",
    "History",
    "Memoir",
    "LGBT"
  ],
  "author": "Amy Gary",
  "average_rating": "3.61",
  "url": "https://www.goodreads.com/book/show/28965132-in-the-great-green-room"
}