{
  "title": "Pretense",
  "description": "All dressed up in a fresh new cover, Pretense, the bestselling novel from Lori Wick is ready for a brand new generation of readers.Marrell, a happily married army wife, adores her family, but throughout her life she’s felt something missing. When she discovers that the void is spiritual, she is afraid to tell her husband. Will he understand that he cannot meet all of her needs, and that she cannot meet all of his?Covering the lives of Marrell and her two daughters, Mackenzie and Delancey, from the 1970s to the 1990s, Pretense is a character–rich novel written from Lori’s heart that shows the patient love of God and the promise of His forgiveness for all who seek Him.This bestselling, character-rich novel--now reissued for a brand-new generation of readers--features the Bishop sisters, whose unexpected difficulties threaten their world. Will their life-changing experiences bring them together or tear them apart?- PublisherMeet the Bishop sisters -- Two women at the crossroads of life On the outside, the Bishop girls appear as different as sisters can be. Mackenzie is a mahogany-haired beauty who's inherited the determined nature of her Army officer father. Her infectious sense of humor and rare gift of imagination are often hidden by a reserved manner. Radiant, blond Delancey views the world through an artist's eyes, drawing what she sees with wide sweeps of emotion. Her charming and trusting personality easily wins friends and admirers, but also leaves her sensitive heart vulnerable to hurt. As the girls grow, unexpected difficulties threaten their world. Will their life-changing experiences bring them together or tear them apart? Where will they find the love they seek?- Publisher",
  "genres": [
    "Christian Fiction",
    "Christian",
    "Romance",
    "Fiction",
    "Christian Romance",
    "Contemporary",
    "Inspirational"
  ],
  "author": "Lori Wick",
  "average_rating": "4.10",
  "url": "https://www.goodreads.com/book/show/289745.Pretense"
}