{
  "title": "Flirts! 5 Romantic Short Stories",
  "description": "Flirts! 5 Romantic Short Stories to squeeze into your busy life. Fun, flirty, sweet and sassy—always with the perfect happy ending.The stories include:“The Hot Girl’s Friend” How can a plain Jane find love when her best friend is a curvy blonde man magnet? Jane usually busies herself during a night on the town, fending off the men lusting after her gorgeous friend Miranda. When Brady the bartender overhears her inspired, ludicrous excuses, he resolves to hook up Jane with his friends. But Jane would be quite happy with him. Pine along as Jane tries to find her own happily ever after.“Wrong Place, Right Guy”She’s in the wrong place at the wrong time. Can the guy who saves her be Mr. Right? Or will his past keep them apart?When Kristen is jumped in a parking lot, Tony jumps in to save the day. While she thinks her hero could also be her heartthrob, Tony’s worried his past is reason to stay apart. Will the good guy get the girl in the end?“Not You” One night with a stranger…gets even stranger the next day.Single, lonely Carly thinks the best way to handle her mother’s third wedding is by throwing her own bachelorette-party-for-one the night before. What’s the harm in her first one-night stand ever? She’ll find out the next day.“Desperately Seeking Cupid” Does she finally have the key for finding love?Brianna has tried everything to find love—with no luck. So she’s turning to feng shui to bring romance to her world. Too bad the guy she’s after thinks its bunk. Will her formula for love work—or blow up in her face?“Never Been Dumped”It’s a relationship with an expiration date and it’s going to go bad.Rachel hates breaking hearts. She’s never been dumped, and she’s tired of being the one to walk away. But a handsome stranger in town for the summer promises he’ll dump her after their summer fling. Will they be able to say goodbye?",
  "genres": [
    "Romance",
    "Short Stories",
    "Contemporary",
    "Anthologies",
    "Contemporary Romance",
    "Fiction",
    "Chick Lit"
  ],
  "author": "Lisa  Scott",
  "average_rating": "3.87",
  "url": "https://www.goodreads.com/book/show/11815579-flirts-5-romantic-short-stories"
}