{
  "title": "Seducing the Bride",
  "description": "After a night of gambling at London’s most famous gaming hell, Lord Beckett Thornby and his friend, Lord Alfred Weston, make a shocking discovery. They come across a beautiful young woman—clad only in a nightdress—laying unconscious in a rubbish heap. Worried for her safety and famous for his habit of taking in strays, Beckett takes the mysterious girl home and puts her to bed, intent on calling a doctor the next day. But his good intentions go awry when his mother and solicitor make an unplanned visit the next morning, and all hell breaks loose.When the impoverished viscount learns he is now heir to a wealthy earldom, Beckett must quickly take a bride. Having been jilted by his former fiancée, he no longer believes in love… but Beckett does believe in the heated desire this “mysterious angel” stirs within him. He vows to make the voluptuous beauty his wife.Isobel Hampton is on the run from a villainous nobleman who will stop at nothing until he possesses both her and her family estate. The strong-minded miss makes a break for freedom and disappears into the night, but Sir Harry Lennox vows to find her. When she awakens in the bed of a handsome viscount, Isobel demands to know how she got there. But something in Lord Thornby’s eyes makes her want to trust the handsome lord. When he proposes a marriage of convenience, it could be the solution to all of Isobel’s problems… or just the beginning of them.For though Beckett and Isobel have sworn to a marriage in name only, the flame of passion burns hot between them. As they engage in a dangerous dance of seduction, the last place they expect to find true love is in each other’s arms.Originally published as The Marriage Bargain in 2000 - Seducing The Bride is a newly revised and updated edition.",
  "genres": [
    "Romance",
    "Historical Romance",
    "Historical",
    "Historical Fiction",
    "Regency",
    "Regency Romance",
    "Amazon"
  ],
  "author": "Michelle McMaster",
  "average_rating": "3.88",
  "url": "https://www.goodreads.com/book/show/28966016-seducing-the-bride"
}