{
  "title": "The Making of a Racist: A Southerner Reflects on Family, History, and the Slave Trade",
  "description": "In this powerful memoir, Charles Dew, one of America's most respected historians of the South--and particularly its history of slavery--turns the focus on his own life, which began not in the halls of enlightenment but in a society unequivocally committed to segregation.Dew re-creates the midcentury American South of his childhood--in many respects a boy's paradise, but one stained by Lost Cause revisionism and, worse, by the full brunt of Jim Crow. Through entertainments and \"educational\" books that belittled African Americans, as well as the living examples of his own family, Dew was indoctrinated in a white supremacy that, at best, was condescendingly paternalistic and, at worst, brutally intolerant. The fear that southern culture, and the \"hallowed white male brotherhood,\" could come undone through the slightest flexibility in the color line gave the Jim Crow mindset its distinctly unyielding quality. Dew recalls his father, in most regards a decent man, becoming livid over a black tradesman daring to use the front, and not the back, door.The second half of the book shows how this former Confederate youth and descendant of Thomas Roderick Dew, one of slavery's most passionate apologists, went on to reject his racist upbringing and become a scholar of the South and its deeply conflicted history. The centerpiece of Dew's story is his sobering discovery of a price circular from 1860--an itemized list of humans up for sale. Contemplating this document becomes Dew's first step in an exploration of antebellum Richmond's slave trade that investigates the terrible--but, to its white participants, unremarkable--inhumanity inherent in the institution.Dew's wish with this book is to show how the South of his childhood came into being, poisoning the minds even of honorable people, and to answer the question put to him by Illinois Browning Culver, the African American woman who devoted decades of her life to serving his family: \"Charles, why do the grown-ups put so much hate in the children?\"",
  "genres": [
    "Nonfiction",
    "History",
    "Memoir",
    "Race",
    "American History",
    "African American",
    "Politics"
  ],
  "author": "Charles B. Dew",
  "average_rating": "3.96",
  "url": "https://www.goodreads.com/book/show/28967009-the-making-of-a-racist"
}