{
  "title": "Conspiracy of Ravens",
  "description": "Supernatural creatures create chaos across an unforgiving western landscape in the second book of a propulsive and cinematic fantasy adventure series that began with Wake of Vultures. \"I don't care what else you've seen in the bookstore today. Buy this book because it's the thrilling, delightfully written, and important one you've always wanted to read.\"―Kevin Hearne, New York Times bestselling author on Wake of VulturesNettie Lonesome made a leap―not knowing what she'd become. But now her destiny as the Shadow is calling.A powerful alchemist is leaving a trail of dead across the prairie. And Nettie must face the ultimate side with her friends and the badge on her chest or take off alone on a dangerous mission that is pulling her inexorably toward the fight of her life.When it comes to monsters and men, the world isn't black and white. What good are two wings and a gun when your enemy can command a conspiracy of ravens?Praise for the Shadow \"Bowen's writing is as sharp and superior as ever - her examination of Rhett's growing and complex sexuality and gender identity is wondrous, and is a topic that is truly not being explored anywhere else.\"―RT Book Reviews\"Nettie Lonesome kicks major ass. There is something strange and wonderful going on in Lila Bowen's head. It's the weird west fantasy that I never knew I've always wanted to read. Now I need more!\" ―Wesley Chu, New York Times bestselling author\"Wake of Vultures is, quite simply, brilliant. A mind-bending mix of history, fantasy and folklore, it's a wild bronco of a read that'll leave you breathless for more.\"―Rachel Caine, New York Times bestselling authorThe Shadow Wake of VulturesConspiracy of RavensMalice of CrowsTreason of Hawks",
  "genres": [
    "Fantasy",
    "Westerns",
    "Young Adult",
    "Paranormal",
    "Fiction",
    "Historical Fiction",
    "LGBT"
  ],
  "author": "Lila Bowen",
  "average_rating": "3.86",
  "url": "https://www.goodreads.com/book/show/29007321-conspiracy-of-ravens"
}