{
  "title": "The Reindeer People: Living with Animals and Spirits in Siberia",
  "description": "Since the last Ice Age, the reindeer's extraordinary adaptation to cold has sustained human life over vast tracts of the earth's surface, providing meat, fur, and transport. Images carved into rocks and tattooed on the skin of mummies hint at ancient ideas about the reindeer's magical ability to carry the human soul on flights to the sun. These images pose one of the great mysteries of the \"reindeer revolution,\" in which Siberian native peoples tamed and saddled a species they had previously hunted.Drawing on nearly twenty years of field work among the Eveny in northeast Siberia, Piers Vitebsky shows how Eveny social relations are formed through an intense partnership with these extraordinary animals as they migrate over the swamps, ice sheets, and mountain peaks of what in winter is the coldest inhabited region in the world. He reveals how indigenous ways of knowing involve a symbiotic ecology of mood between humans and reindeer, and he opens up an unprecedented understanding of nomadic movement, place, memory, habit, and innovation.The Soviets' attempts to settle the nomads in villages undermined their self-reliance and mutual support. In an account both harrowing and funny, Vitebsky shows the Eveny's ambivalence toward productivity plans and medals and their subversion of political meetings designed to control them. The narrative gives a detailed and tender picture of how reindeer can act out or transform a person's destiny and of how prophetic dreaming about reindeer fills a gap left by the failed assurances of the state.Vitebsky explores the Eveny experience of the cruelty of history through the unfolding and intertwining of their personal lives. The interplay of domestic life and power politics is both intimate and epic, as the reader follows the diverging fate of three charismatic but very different herding families through dangerous political and economic reforms. The book's gallery of unforgettable personalities includes shamans, psychics, wolves, bears, dogs, Communist Party bosses, daredevil aviators, fire and river spirits, and buried ancestors. The Reindeer People is a vivid and moving testimony to a Siberian native people's endurance and humor at the ecological limits of human existence.",
  "genres": [
    "Nonfiction",
    "Anthropology",
    "Russia",
    "History",
    "Travel",
    "Animals",
    "Nature"
  ],
  "author": "Piers Vitebsky",
  "average_rating": "4.03",
  "url": "https://www.goodreads.com/book/show/290449.The_Reindeer_People"
}