{
  "title": "Misogyny: The Male Malady",
  "description": "\"Yes, women are the greatest evil Zeus has made, and men are bound to them hand and foot with impossible knots by God.\"—Semonides, seventh century B.C. Men put women on a pedestal to worship them from afar—and to take better aim at them for the purpose of derision. Why is this paradoxical response to women so widespread, so far-reaching, so all-pervasive? Misogyny, David D. Gilmore suggests, is best described as a male malady, as it has always been a characteristic shared by human societies throughout the world. The Male Malady is a comprehensive historical and anthropological survey of woman-hating that casts new light on this age-old bias. The turmoil of masculinity and the ugliness of misogyny have been well documented in different cultures, but Gilmore's synoptic approach identifies misogyny in a variety of human experiences outside of sex and marriage and makes a fresh and enlightening contribution toward understanding this phenomenon. Gilmore maintains that misogyny is so widespread and so pervasive among men that it must be at least partly psychogenic in origin, a result of identical experiences in the male developmental cycle, rather than caused by the environment alone. Presenting a wealth of compelling examples—from the jungles of New Guinea to the boardrooms of corporate America—Gilmore shows that misogynistic practices occur in hauntingly identical forms. He asserts that these deep and abiding male anxieties stem from unresolved conflicts between men's intense need for and dependence upon women and their equally intense fear of that dependence. However, misogyny, according to Gilmore, is also often supported and intensified by certain cultural realities, such as patrilineal social organization; kinship ideologies that favor fraternal solidarity over conjugal unity; chronic warfare, feuding, or other forms of intergroup violence; and religious orthodoxy or asceticism. Gilmore is in the end able to offer steps toward the discovery of antidotes to this irrational but global prejudice, providing an opportunity for a lasting cure to misogyny and its manifestations.",
  "genres": [
    "Nonfiction",
    "Feminism",
    "History",
    "Anthropology",
    "Sociology",
    "Gender"
  ],
  "author": "David D. Gilmore",
  "average_rating": "3.49",
  "url": "https://www.goodreads.com/book/show/290483.Misogyny"
}