{
  "title": "Adopted Son: Washington, Lafayette, and the Friendship that Saved the Revolution",
  "description": "They were unlikely comrades-in-arms. One was a self-taught, middle-aged Virginia planter in charge of a ragtag army of revolutionaries, the other a rich, glory-seeking teenage French aristocrat. But the childless Washington and the orphaned Lafayette forged a bond between them as strong as any between father and son. It was an unbreakable trust that saw them through betrayals, shifting political alliances, and the trials of war.Lafayette came to America a rebellious youth whose defiance of his king made him a celebrity in France. His money and connections attracted the favor of the Continental Congress, which advised Washington to keep the exuberant Marquis from getting himself killed. But when the boy-general was wounded in his first battle, he became a hero of two countries. As the war ground on, Washington found in his young charge the makings of a courageous and talented commander whose loyalty, generosity, and eagerness to please his Commander in Chief made him one of the war’s most effective and inspired generals. Lafayette’s hounding of Cornwallis’s army was the perfect demonstration of Washington’s unconventional “bush-fighting” tactics, and led to the British surrender at Yorktown.Their friendship continued throughout their lives. Lafayette inspired widespread French support for a struggling young America and personally influenced Washington’s antislavery views. Washington’s enduring example as general and statesman guided Lafayette during France’s own revolution years later.Using personal letters and other key historical documents, Adopted Son offers a rare glimpse of the American Revolution through the friendship between Washington and Lafayette. It offers dramatic accounts of battles and intimate portraits of such major figures as Alexander Hamilton, Benedict Arnold, and Benjamin Franklin. The result is a remarkable, little-known epic of friendship, revolution, and the birth of a nation.From the Hardcover edition.",
  "genres": [
    "History",
    "American Revolution",
    "Biography",
    "American History",
    "Nonfiction",
    "American Revolutionary War",
    "Historical"
  ],
  "author": "David A. Clary",
  "average_rating": "3.96",
  "url": "https://www.goodreads.com/book/show/2901816-adopted-son"
}