{
  "title": "In Stitches",
  "description": "'Despite the headlines, actually the NHS has just had its best year ever.' Patricia Hewitt, Secretary of State for Health, eulogising to the BBC, 22nd April 2006. 'Despite what the politicians say, things seem to have gone a bit tits-up recently.' Dr Nick Edwards, A&E doctor, ranting to his mates down the pub, 22nd April 2006.Dr Nick Edwards is an Accident and Emergency (A&E) doctor working in the UK and a passionate believer in the NHS. However the reforms, political correctness and the Anglo-Saxon culture of binge drinking and fighting and the resulting A&E visits are a strain on his sanity. So to keep up his morale, he began writing down his feelings - a form of literary cathartic therapy - the results of which make up this book. From dealing with cardiac arrests and car accidents, to people with 'Arrest Avoidance Syndrome' and others who haven't quite read the big red sign above their heads as they walk into A&E, In Stitches paints a vivid picture of what it's really like working at the sharp end of the NHS today. It's funny, it's heartbreaking and it's infuriating. It's also more informative than any government press release. So join Dr Nick Edwards as he describes the frustrations and joys of working in the NHS. The traumas and tragedies, the patients and colleagues and most of all the successes and humour that make up life at the frontline of medical care.Note to reader: ever-conscious of meaningless targets, the author would like it to be known that 98% of the stories contained in this book were written in under 4 hours.Dr Nick Edwards is an Accident and Emergency doctor working in the UK. He kept a blog under the name of Angry Doctor for a while until his criticisms of the management of the NHS drew unwanted attention and for the sake of his career he removed it from the web.",
  "genres": [
    "Nonfiction",
    "Medical",
    "Medicine",
    "Biography",
    "Autobiography",
    "Memoir",
    "Humor"
  ],
  "author": "Nick  Edwards",
  "average_rating": "3.75",
  "url": "https://www.goodreads.com/book/show/1181743.In_Stitches"
}