{
  "title": "Relentless Pursuit: A Year in the Trenches with Teach for America",
  "description": "A revealing look inside a national phenomenon, Teach For America, which, since its founding in 1990, has pursued one of the most daring—and controversial—strategies for closing the educational achievement gap between the richest and poorest students in the country.The story is set in South Los Angeles at Locke High School, an institution founded in 1967 in the spirit of renewal that followed the devastating Watts riots but that, four decades on, has made frustratingly little progress in lifting the fortunes of the area’s mostly black and Latino children. Into this place, which resembles a prison as much as a school, are dropped a group of “recruits” from Teach For America, the fast-growing organization devoted to undoing generations of disadvantage through a fiercely regimented selection and deployment of America’s best and brightest. Nearly twenty thousand top college graduates apply for two thousand slots. Then, with only a summer of training, the lucky ones are sent to face the most desperate of classroom environments.Giving us a year in the life of Locke through the absorbing experiences of four TFA corps members—Rachelle, Phillip, Hrag, and Taylor—Donna Foote recounts the progress of their idealistic but unorthodox mission and shares its results, by turns exhausting, exhilarating, maddening, and unforgettable. As the four struggle to negotiate the expectations of their Locke colleagues (most conventionally trained, many skeptical) and the relentlessly exacting demands of the overseers at TFA headquarters (to say nothing of the typical stresses of youth), we see these young people assume a level of responsibility that might crush a seasoned educator. Limited training must often be supplemented with improvisation in a school where Rachelle’s special ed biology students prove to need remedial reading more urgently than lab work, while Taylor’s ninth-grade English classes show themselves equal to discussing Shakespeare. Through it all, these teachers are sustained not only by the missionary fervor of their cause but also by the intermittent evidence that they can make a tangible difference.Without romanticizing the successes or minimizing the failures, Relentless Pursuit relates, through the experiences of these four new teachers, the strengths, the foibles, and the peculiarities of an operation to accomplish what no government program has yet managed — to overcome one of the most basic and vexing of social inequities, a problem we can no longer afford to ignore.",
  "genres": [
    "Education",
    "Nonfiction",
    "Teaching",
    "Memoir"
  ],
  "author": "Donna Foote",
  "average_rating": "3.74",
  "url": "https://www.goodreads.com/book/show/2906693-relentless-pursuit"
}