{
  "title": "The Secret History of the World and How to Get Out Alive",
  "description": "From Book 1: Previously published as Ancient Science, Secret History contains 150 pages of new material. It is the definitive edition in a new format. The Secret History of The World and How To Get Out Alive is the definitive book of the real answers where Truth is more fantastic than fiction. Laura Knight-Jadczyk, wife of internationally known theoretical physicist, Arkadiusz Jadczyk, an expert in hyperdimensional physics, draws on science and mysticism to pierce the veil of reality. Due to the many threats on her life from agents and agencies known and unknown, Laura left the United States to live in France, where she is worked closely with Patrick Riviere, student of Eugene Canseliet, the only disciple of the legendary alchemist Fulcanelli.With sparkling humour and wisdom, she picks up where Fulcanelli left off, sharing over thirty years of research to reveal, for the first time, The Great Work and the esoteric Science of the Ancients in terms accessible to scholar and layperson alike.Conspiracies have existed since the time of Cain and Abel. Facts of history have been altered to support the illusion. The question today is whether a sufficient number of people will see through the deceptions, thus creating a counter-force for positive change - the gold of humanity - during the upcoming times of Macro-Cosmic Quantum Shift. Laura argues convincingly, based on the revelations of the deepest of esoteric secrets, that the present is a time of potential transition, an extraordinary opportunity for individual and collective a quantum shift of awareness and perception which could see the birth of true creativity in the fields of science, art and spirituality. The Secret History of the World allows us to redefine our interpretation of the universe, history, and culture and to thereby navigate a path through this darkness. In this way, Laura Knight-Jadczyk shows us how we may extend the possibilities for all our different futures in literal terms.With over 850 pages of fascinating reading, The Secret History of The World and How to Get Out Alive is rapidly being acknowledged as a classic with profound implications for the destiny of the human race. With painstakingly researched facts and figures, the author overturns long-held conventional ideas on religion, philosophy, Grail legends, science, and alchemy, presenting a cohesive narrative pointing to the existence of an ancient techno-spirituality of the Golden Age which included a mastery of space and the Holy Grail, the Philosopher's Stone, the True Process of Ascension. Laura provides the evidence for the advanced level of scientific and metaphysical wisdom possessed by the greatest of lost ancient civilizations - a culture so advanced that none of the trappings of civilization as we know it were needed, explaining why there is no 'evidence' of civilization as we know it left to testify to its existence. The author's consummate synthesis reveals the Message in a Bottle reserved for humanity, including the Cosmology and Mysticism of mankind Before the Fall when, as the ancient texts tell us, man walked and talked with the gods. Laura shows us that the upcoming shift is that point in the vast cosmological cycle when mankind - or at least a portion of mankind - has the opportunity to regain his standing as The Child of the King in the Golden Age.If ever there was a book that can answer the questions of those who are seeking Truth in the spiritual wilderness of this world, then surely The Secret History of the World and How to Get Out Alive is it.",
  "genres": [
    "History",
    "Nonfiction",
    "Alternate History",
    "Psychology"
  ],
  "author": "Laura Knight-Jadczyk",
  "average_rating": "4.25",
  "url": "https://www.goodreads.com/book/show/29051.The_Secret_History_of_the_World_and_How_to_Get_Out_Alive"
}