{
  "title": "Horsemen of the Esophagus: Competitive Eating and the Big Fat American Dream",
  "description": "“To be up on stage, shoving food in your face, beats everyday existence for most people.” —David “Coondog” O’Karma, competitive eater“Hungry” Charles Hardy. Ed “Cookie” Jarvis. Sonya “The Black Widow” Thomas. Joey “Jaws” Chestnut. Will such names one day be looked back upon as the pioneers of a new manifestation of the irrepressible American appetite for competition, money, fame, and self-transformation? They will if the promoters of the newly emerging sport of competitive eating have their way. In Horsemen of the Esophagus , Jason Fagone reports on the year he spent in the belly of this awakening beast.Fagone’s trek takes him to 27 eating contests on two continents, from the World Grilled Cheese Eating Championship in Venice Beach, California, to Nagoya, Japan, where he pursues an interview with the legendary Takeru Kobayashi, perhaps the most prodigious eater in the world today, and to the Nathan’s Famous Hot Dog Eating Contest at Coney Island, the sport’s annual grand finale, where Kobayashi has eaten more than 50 dogs in 12 minutes. Along the way, Fagone discovers an absurd, sometimes troubling subculture on the make, ready to bust out of its county fair and neighborhood-fat-guys niche and grab a juicy piece of the big-time television sports/Vegas spectacle jackpot.Fagone meets promoters like George Shea, the P. T. Barnum of the International Federation of Competitive Eating (aka IFOCE, “the governing body of all stomach-centric sport”) and enters the lives of three “gurgitators”: David “Coondog” O’Karma, a fiftyish, six-two house painter from Ohio who’s “not ready to become invisible”; Bill “El Wingador” Simmons, the Philly Wing Bowl legend who is shooting for a fifth chicken-eating championship despite the fact that it may be killing him; and Tim “Eater X” Janus, a lean young Wall Street trader who takes a seriously scientific and athletic approach to the pursuit of ingesting mountains of food in record-breaking times. Each in his own way feels as if he has lost or not yet found something essential in life, and each is driven by the desperate hope that through consumption he may yet find redemption, that even in the junkiest of America’s junk culture, true nourishment might be found. After all, as it says on the official IFOCE In Voro Veritas (In Gorging, Truth).With forays into the gastrointestinal mechanics of the alimentary canal (“it’s what unbuilds the world to build you,” but, hey, you can skip that part if you like), the techniques and tricks of the experienced gurgitators (pouring a little club soda on top of high-carb foods makes them easier to swallow), and the historical roots of the competitive eating phenomenon, Horsemen of the Esophagus gives the French something else to dislike about America. And it gives the rest of us food for thought about the bizarre and unlikely places the American Dream can sometimes lead.Also available as an eBook",
  "genres": [
    "Nonfiction",
    "Food",
    "Sports",
    "Foodie",
    "Food Writing"
  ],
  "author": "Jason Fagone",
  "average_rating": "3.39",
  "url": "https://www.goodreads.com/book/show/290631.Horsemen_of_the_Esophagus"
}