{
  "title": "The Murder of Helen Jewett: The Life and Death of a Prostitute in Nineteenth-Century New York",
  "description": "In 1836, the murder of a young prostitute made headlines in New York City and around the country, inaugurating a sex-and-death sensationalism in news reporting that haunts us today. Patricia Cline Cohen goes behind these first lurid accounts to reconstruct the story of the mysterious victim, Helen Jewett. From her beginnings as a servant girl in Maine, Helen Jewett refashioned herself, using four successive aliases, into a highly paid courtesan. She invented life stories for herself that helped her build a sympathetic clientele among New York City's elite, and she further captivated her customers through her seductive letters, which mixed elements of traditional feminine demureness with sexual boldness.But she was to meet her match--and her nemesis--in a youth called Richard Robinson. He was one of an unprecedented number of young men who flooded into America's burgeoning cities in the 1830s to satisfy the new business society's seemingly infinite need for clerks. The son of an established Connecticut family, he was intense, arrogant, and given to posturing. He became Helen Jewett's lover in a tempestuous affair and ten months later was arrested for her murder. He stood trial in a five-day courtroom drama that ended with his acquittal amid the cheers of hundreds of fellow clerks and other spectators.With no conviction for murder, nor closure of any sort, the case continued to tantalize the public, even though Richard Robinson disappeared from view. Through the Erie Canal, down the Ohio and the Mississippi, and by way of New Orleans, he reached the wilds of Texas and a new life under a new name. Through her meticulous and ingenious research, Patricia Cline Cohen traces his life there and the many twists and turns of the lingering mystery of the murder. Her stunning portrayals of Helen Jewett, Robinson, and their raffish, colorful nineteenth-century world make vivid a frenetic city life and sexual morality whose complexities, contradictions, and concerns resonate with those of our own time.From the Hardcover edition.",
  "genres": [
    "History",
    "True Crime",
    "Nonfiction",
    "Crime",
    "Biography",
    "American History",
    "Mystery"
  ],
  "author": "Patricia Cline Cohen",
  "average_rating": "3.72",
  "url": "https://www.goodreads.com/book/show/290594.The_Murder_of_Helen_Jewett"
}