{
  "title": "Alpha Feud Book 1",
  "description": "A BBW Paranormal Shifter Romance Story An unyielding human with deadly skills from generations of training versus a dangerous werewolf with a heart of compassion. Who wins over Eliza’s heart?\n***Due to sexually graphic content and language that some may find offensive, this book is intended for mature readers only***\nEliza lives in the quiet town of Birkbridge, Indiana, where nothing big ever seems to happen. As the daughter of a legendary wartime correspondent, Eliza feels as though she has large shoes to fill. Sadly, her own career as a reporter at the local news station is beginning to feel dull, and her once-ambitious boss, Jim, is failing to live up to his former appeal in the industry. Instead, he sends Eliza to report on boring, crowd-pleasing events, like their country livestock fair. As if Midwestern life wasn’t boring enough already…With the arrival of two handsome brothers, the lives of Eliza and her best friend, Melissa, are shaken to the core. For Eliza, the arrival of this new man, Hayden, becomes a test of her relationship with her current boyfriend, Andrew, who she’s been happily living with for over six years. To make matters worse, Eliza also suspects that her mysterious admirer may have more secrets than his calm demeanor reveals. Eliza struggles to negotiate her professional and private life, while also dealing with an adversary from her past. When the opportunity to investigate Hayden’s past arises, Eliza simply can’t resist; she leaves the normality of her comfortable life behind and takes a leap into the unknown. Does Hayden, a complete stranger, really wield the power to make Eliza reconsider her relationship with Andrew?Download this book to find out.",
  "genres": [
    "Paranormal",
    "Paranormal Romance",
    "Fantasy",
    "Romance",
    "Amazon",
    "Werewolves"
  ],
  "author": "Darla Dunbar",
  "average_rating": "3.61",
  "url": "https://www.goodreads.com/book/show/29067683-alpha-feud-book-1"
}