{
  "title": "Break Free From Corporate: Be Your Own Boss",
  "description": "How would you like to fire your boss and start living life on your terms, doing what you are passionate about and pursuing your dreams? This book is bound to challenge the way you think and may be confronting; however the ideas presented will save you countless hours and thousands of dollars in the long run, by avoiding common mistakes made when starting up a new business.In this book you’ll — A winning formula to maximise all areas of your life with any business opportunity— Essential tips to learning limited beliefs so that you can get started the right way— Sure-fire customer acquisition strategies used by successful business entrepreneurs— The biggest pitfalls to avoid that cripple most other businesses— Critical reasons to surround yourself with other like-minded successful entrepreneurs— And more…\"Gavin Sequeira has put together an excellent read, which beautifully covers the fundamentals needed to succeed in your own business. So start reading now and discover how to turn your dreams into reality.\"— Dale Beaumont, Best-Selling Author & MD, Business Blueprint\"If you’re planning your escape from corporate into your own business, don’t do it alone! Gavin Sequeira has eloquently mapped out everything you’ll need to succeed in creating the life you really desire.\"— John Di Natale, Founder & MD, BIGthink! Business Booster“I wish this book was available when I transitioned from working in corporate to being an entrepreneur. I would have saved a lot of time, sweat and tears, and fast-tracked my results. Gavin’s book is a fusion of mental preparation, practical action items, together with personal stories infused with humour and valuable insights. A must-read for any entrepreneur launching their business.”— Liza Choa, Founder & Managing Director of Content Maximiser“The foray from the security of a corporate job to an entrepreneurial lifestyle can be fraught with anxiety and costly mistakes. Gavin has drawn on his own accomplishments and journeys, as well as those of other successful corporate escapees, so his book is loaded with practical wisdom to empower others to escape from the matrix easily and successfully.”— Simone Novello, Founder & Managing Director of PartnerUp\"The toughest part of making the transition from corporate land to your own business is the reduced level of support. Previously, you were surrounded by teams of people, now you’re almost on your own. ‘Break Free From Corporate’ is your new best friend. Gavin knows what you’re going through and captures the key learnings that most people face during this transition.\"— Geoff McDonald, Founder & MD, Ideas Architect",
  "genres": [],
  "author": "Gavin Sequeira",
  "average_rating": "4.50",
  "url": "https://www.goodreads.com/book/show/29061833-break-free-from-corporate"
}