{
  "title": "The Hurried Child: Growing Up Too Fast Too Soon",
  "description": "Often with the very best intentions, Americans expose their children to overwhelming pressures, pressures that can lead to low self-esteem, to teenage pregnancy, and even to teenage suicide. By blurring the boundaries of what is age appropriate, by expecting—or imposing—too much too soon, we force our kids to grow up too fast, to mimic adult sophistication while secretly yearning for innocence.With the first edition of The Hurried Child, David Elkind emerges as the voice of reason, calling our attention to the crippling effects of hurrying. But in the decade since this book first appeared, a new generation of parents has inadvertently stepped up the assault on childhood, misled by the new and comforting rhetoric of childhood ”competence.”Now Dr. Elkind has thoroughly revised this enormously successful book to debunk the notion of ”competence” tha thas children racing off to early enrichment programs, burdened by the pressure to ”achieve,” and coming home alone to an empty house after school. He sees ”sompetence” as a notion meant to rationalize the needs of adults, not to serve the genuine needs of kids, a notion that has fourth graders dieting to fit into designer jeans and children of divorce asked to be the confidants of their troubled parents.In updating this new edition, Dr. Elkind takes a detailed and up-to-the-minute look at the world of today's kids in terms of education, movies, television, rock & roll, and social trends, to see where the hyrrying occurs and why. And as before, he offers parents and teachers insight, advice, and hope for encouraging healthy development while protecting the joy and feedom of childhood.",
  "genres": [
    "Parenting",
    "Nonfiction",
    "Psychology",
    "Education",
    "Childrens",
    "Mental Health",
    "Sociology"
  ],
  "author": "David Elkind",
  "average_rating": "3.79",
  "url": "https://www.goodreads.com/book/show/2905542-the-hurried-child"
}