{
  "title": "Half Share",
  "description": "SIX MONTHS IN THE DEEP DARK. FOUR VERY DIFFERENT WOMEN. ONE MAN DISCOVERS WHAT IT MEANS TO BE A SPACER.It's a time of change on the Lois McKendrick. Sarah Krugg joins the mess deck and Ishmael Wang moves to the environmental section. Just after getting accustomed to life aboard a solar clipper, Ishmael must learn a whole new set of skills, face his own fears and doubts, and try to balance love and loss in the depths of space.Both Ish and Sarah must learn to live by the mantra, \"Trust Lois.\" For Sarah, there is the hope of escaping a horrifying past. For Ish, he must discover what type of man he wants to become and learn the consequences of his choices.Return with the crew of the SC Lois McKendrick, as you set sail in the next installment of the Trader Tales of the Solar Clipper Series. All your favorites Ish, Pip, Cookie, Brill, Diane, and Big Bad Bev. You might even discover some new friends as you travel among the stars.TRADER TALE BOOKS IN THE GOLDEN AGE OF THE SOLAR CLIPPERQuarter ShareHalf ShareFull ShareDouble ShareCaptain's ShareOwner's ShareSHAMAN TALE BOOKS IN THE GOLDEN AGE OF THE SOLAR CLIPPERSouth CoastCape Grace**ForthcomingREVIEWS\"This is a thoroughly enjoyable coming of age story that had me deciding, three-quarters of the way through, to buy the second book in the series, as I wished to follow Ishmael's journey to becoming a full share (and beyond) crew member aboard a space trader.\"\"This story has no major conflict, no vilian, no drama, no surprises...I couldn't put it down. Story of life on a deep space freighter with good characters.\"\"For me this book brought up shades of Robert Heinlein to me. The scrappy characters fighting to get ahead make you want to root for them. This is not your typical space aliens conquer the universe book. Nathan Lowell takes a seemingly mundane thing (trade and business) and makes it into something you want to learn about.\"\"I'm not the first to say there's a connection here to the works of Robert Heinlein, but the shoe fits. Lowell's writing is crisp and his future is vivid; it's a place you'd like to live.\"\"The story just flows well...I couldn't put the book down until I finished. And then right when I finished (at 1 AM in the morning) I was back on Amazon's site looking for the next book in the series.\"\"I just want to add to all the praise for Lowell, this book was an excellent read, and if you are a fan of SciFi, definitely recommended.\"",
  "genres": [
    "Science Fiction",
    "Space Opera",
    "Fiction",
    "Audiobook",
    "Space",
    "Science Fiction Fantasy",
    "Fantasy"
  ],
  "author": "Nathan Lowell",
  "average_rating": "4.15",
  "url": "https://www.goodreads.com/book/show/2906048-half-share"
}