{
  "title": "Dark Planet Warriors: Invasion",
  "description": "Abbey  Some scary looking aliens have just boarded Fortuna Tau, our little asteroid mining station. Kordolians, by the looks of things. What the hell do they want with this floating rust bucket? What are they even doing here?In the grand scheme of things, Earth is a total backwater, and the Solar System is the galactic equivalent of Hicksville. That’s why aliens rarely bother to come to this corner of the universe. And Kordolians are usually too busy conquering the important parts of the nine galaxies to bother with us.But it looks as if their battle cruiser is broken. Probably shot up in a firefight. They’re going to use every means necessary to fix it, even if it means putting Fortuna Tau on lockdown. I just hope they don’t decide to enslave us and ship us off to some remote alien planet.Come to think of it, I’ve never seen a Kordolian up close before. They’re huge, with strange, silver skin and pointed ears. They have freaky nano-armor. And they’re packing a serious arsenal. Our human technology has no chance against their weapons.When I encounter their General, I find him insufferable. Arrogant. Domineering. He won’t tell me anything.I guess that’s what happens when your race is kicking ass across the nine galaxies. You get pigheaded.So why do I keep running into him? Why is he looking at me funny? And what’s with this weird feeling I get when he’s around? I really hope these guys fix their ship and go away soon, because I get the feeling they could be major trouble.  Tarak  Sucked into a wormhole during a fierce skirmish with an enemy ship. Spat out near a human mining station in a remote corner of the nine galaxies. Stuck with weak humans who operate with inferior metals and technology. This mission couldn’t get any worse. We need to fix our craft before the wormhole collapses. We need to hunt the cursed Xargek monsters that have infiltrated this human rust-bucket. And these infernal headaches of mine are getting worse. I don’t really care about these humans. Their existence makes no sense to me. All I care about is killing Xargek and getting back to my home planet, Kythia. This situation is tiresome. The light of the star humans call the Sun burns my eyes. I crave Kythia’s darkness. So why has this crazy human female captured my attention? She’s messy, awkward and she babbles nonsense half the time. These humans are crazy. I don’t understand them at all. Especially this female. Why do I keep coming back to her? I need to leave this place before I go insane.   Dark Planet Warriors is a 3-book serial. Each book is an episode of Abbey and Tarak's story, just like a TV series. A new installment will be released every two weeks.  Books in series: Book one: InvasionBook two: Taken Book three: Escape Due to violence, swearing and steamy sex scenes, these books are recommended for readers aged 18 years and over.",
  "genres": [
    "Science Fiction"
  ],
  "author": "Anna Carven",
  "average_rating": "3.91",
  "url": "https://www.goodreads.com/book/show/29082269-dark-planet-warriors"
}