{
  "title": "The Essential Cuisines of Mexico",
  "description": "More than twenty-five years ago, when Diana Kennedy published The Cuisines of Mexico, knowledge and appreciation of authentic Mexican cooking were in their infancy. But change was in the air. Home cooks were turning to Julia Child for an introduction to French cuisine and to Marcella Hazan for the tastes of Italy. Through Diana Kennedy they discovered a delicious and highly developed culinary tradition they barely knew existed. The Cuisines of Mexico, Mexican Regional Cooking, and The Tortilla Book became best-sellers, and Diana Kennedy was recognized as the authority on Mexican food.Now a new generation has discovered that Mexican food is more than chimichangas, that they can find fresh hierbas de olor (pot herbs, including marjoram and Mexican bayleaf) and chilacas in their markets. The book that will become indispensable in their kitchens is The Essential Cuisines of Mexico.Diana has combined her three classic books in one volume, refining recipes when possible, bringing them up to date without losing the spirit of their generation. Old friends will be delighted to revisit these refreshed classics and to find more than thirty new recipes from different regions of Mexico. Among these discoveries are the very popular arroz a la tumbada (rice with seafood) from Veracruz, a pico de gallo with peaches from the state of Mexico, and tasty snacks from the cantinas of Mérida. Newcomers will delight in Diana's \"word pictures\" -- descriptions of her travels and discoveries -- and in her off-the-cuff comments. Whether they turn to this book for the final word on tamales, recipes for tasty antojitos to serve with drinks, or superb tacos, they will find there is no better teacher of Mexican food. How enviable to attempt for the first time Calzones del Diablo (yes, the Devil's Pants), and what a pleasure to succumb to Diana's passion for Mexican food.",
  "genres": [
    "Cookbooks",
    "Cooking",
    "Food",
    "Nonfiction",
    "Reference",
    "Foodie",
    "Food and Drink"
  ],
  "author": "Diana Kennedy",
  "average_rating": "4.37",
  "url": "https://www.goodreads.com/book/show/290797.The_Essential_Cuisines_of_Mexico"
}