{
  "title": "Blood Revealed",
  "description": "To save their world, vampires and humans must fight together…against the deadliest enemy ever unleashed.\n\nNial, leader of the vampires, assembles his loyal followers yet again—and this time they must not fail. For the mythic Blood Stone has been broken and doomsday evil unleashed upon the world of humans in the form of The Others. To save the innocents, Nial and his kind must lift a centuries’ old veil of secrecy, revealing who they truly are.  This has never gone well in the past—will it be different this time? Maybe, if three unlikely heroes can be convinced to join the fight. When an action movie star, a deaf empath and an ex-soldier join forces, the action explodes—both on the battle front and in the bedroom.  Patrick Sauvage, Hollywood A-list actor, ‘comes out’ as a vampire. Good thing he’s learned a few extra skills as an action star—because he needs a new career. What actress wants to star opposite a guy who gives new meaning to the term ‘drop dead gorgeous’?  Dominic Castellano lost his hearing in a freak accident—and everything he loved along with it. But he has other talents to wield in the coming war—he can now sense what others can’t. And his charisma casts a spell on both Patrick and the third member of their triad.  Blythe Murray, LA single mom and ex-soldier, would rather forget her military service—but she’ll resurrect it when The Others invade their city. She’ll give her all to fight evil, and protect her children.  But no human woman can withstand the powerful and instant bond between her, Patrick and Dominic. The world is at war, the future uncertain, the enemy nearly unstoppable—so why fight the best thing they’ve ever found? The three can only hope it will be enough to carry them through the devastation to come.",
  "genres": [
    "M M F",
    "Vampires",
    "Menage",
    "Paranormal Romance",
    "Fantasy",
    "Romance"
  ],
  "author": "Tracy Cooper-Posey",
  "average_rating": "4.34",
  "url": "https://www.goodreads.com/book/show/29079671-blood-revealed"
}