{
  "title": "No Ivory Tower",
  "description": "\"Some are called to serve in schools. Some are called to write. Davenport is called to both\" -Annie Dillard. Praise for Saving Miss Oliver's, Book One Of The Miss Oliver's School For Girls saga.No Ivory Tower has been named one of the 2016 summer must-reads by the National Association Of Independent SchoolsNo Ivory Tower When a beleaguered headmaster is forced to resign from Miss Oliver's School for Girls, the youthful Chair of Science Rachel Bickham finds herself tapped as the first African-American head of school. The board warns her to surround herself with the right people, or she won't succeed. But she's not worried; she will put the much more experienced, legendary teacher, Francis Plummer at her right hand, as Dean of Academics. Together, they will yank the school, beloved by the alumnae for its empowering of young women, out of the jaws of insolvency.But before she's able to make that appointment, Mitch Michaels, the father of sophomore Amy Michaels, strides in and makes an ultimatum only a rabid conservative talk show host can deliver kick Amy's friend and dorm-mate, Claire Nelson, out of the school so she won't continue to corrupt his daughter, or he'll broadcast to the world the secret that Claire has been hiding. The scandal, he promises, will shut the nearly bankrupt school down.Michaels is proxy for every insult to women, real or imagined, since time began, and Rachel fights him with a daring strategy that puts her job on the line. Meanwhile, bank loans come due, the choices of emotionally charged teen agers and adults threaten to unravel the school, a cabal of alumnae tries to unseat Rachel, and, most alarming of all, Francis Plummer's performance in the classroom begins to falter.And it is not as if Rachel doesn't have a personal a marriage to sustain with a husband whose job is just as consuming as hers, and a hunger to become a mother.Gripping, funny in some places, sad in others, this is the story of what a feisty, young and idealistic woman learns as she struggles to do the right thing in an environment which is, indeed, no ivory tower.",
  "genres": [
    "Fiction"
  ],
  "author": "Stephen Davenport",
  "average_rating": "3.73",
  "url": "https://www.goodreads.com/book/show/29073035-no-ivory-tower"
}