{
  "title": "The Detective's Pleasure",
  "description": "An alternate cover for this ASIN can be found here.“You’ll kneel for me without me having to tell you to. And when you do, you’ll feel so much better. Trust me.” - Detective Sam RobertsOfficer Ryan Bennett: Ambitious and smart, Ryan Bennett is a young officer on Houston’s police force. He’s pursuing his dream of being promoted to the city’s elite SWAT team with a single mindedness that won’t accept any outcome but success. But that isn’t his only dream. Ryan wants more than a coveted position on SWAT. He wants to be owned by a strong Dominant. To give himself up to a Dom who will make him shudder with pleasure beneath a firm yet loving hand. Unfortunately, Ryan has had nothing but failure in that part of his life. Now, he’s hidden that dream away from everyone, including himself. And he refuses to let anyone close enough to see what he truly desires, and who he truly is. Detective Sam Roberts: Cool and calm, Detective Sam Roberts is good at reading people, during the day as a detective and at night as a Dom. He easily sees past the hard layer of arrogance surrounding Officer Ryan Bennett to the hurt submissive hiding beneath. He wants to help Ryan, even though the stubborn young man resists him. But Sam isn’t one to back down from a challenge. He’s determined to help Ryan embrace the soft, giving nature of his submissive side. Using both a gentle hand and the sting of the whip, he’ll work to coax Ryan’s submission free. But what will Sam do if he’s successful? Let Ryan go as promised? Or give the young officer the very thing he’s wanted for so long? The Detective’s Pleasure is Book Two in the Cuffs, Collars, and Love series and is the follow up to the best-selling m/m romance, The Sergeant. If you love romance that is epic, emotional and erotic, you’ll want to give this series a read!Approximate word-length: 105,000",
  "genres": [
    "BDSM",
    "M M Romance",
    "Romance",
    "Contemporary",
    "Erotica",
    "Contemporary Romance",
    "Mystery"
  ],
  "author": "Christa Tomlinson",
  "average_rating": "4.18",
  "url": "https://www.goodreads.com/book/show/29073420-the-detective-s-pleasure"
}