{
  "title": "Dianetics: The Modern Science of Mental Health",
  "description": "Dianetics has remained a bestseller for more than 50 years. And with over 20 million copies in print, generating a movement that spans over 100 nations, it’s indisputably the most widely read and influential book ever written about the human mind.Here is the anatomy and full description of the reactive mind, the previously unknown source of nightmares, unreasonable fears, upsets and insecurities which enslave Man. This book shows you how to get rid of it, and so achieve something Man has previously only dreamed of: the State of Clear.Among the discoveries herein:The Goal of Man The Dynamic Principle of Existence—the one word that motivates all living things The Four Dynamics—the drives upon which all of life is compartmented The Descriptic Graph of Survival—revealing one’s true potential and how to achieve it The discovery of and complete anatomy of the reactive mind The painful experiences—engrams—contained in the reactive mind which command one to act irrationally against their own wishes and goals The impact of prenatal engrams—what took place before you were born and how it’s influenced you ever since The complete Dianetics procedure to discover and eradicate these harmful experiences so they never affect you again, revealing the one person you’ve always wanted to know—you.WHAT'S HOLDING YOU BACK?If you've ever felt there was something holding you back in life, ruining your plans and stopping you from being who you want to be, you were right.The fact is, there is a single source of all your unhappiness, problems, stress and self-doubt. It's called the reactive mind — the hidden part of your mind that stores all painful experiences, then uses them against you.Dianetics gets rid of the reactive mind. It's the only thing that does.With over 20,000,000 copies in 50 languages, and used in more than 150 nations, Dianetics brings dramatic and permanent improvement to people all over the world.Dianetics: The Modern Science of Mental Health - quality   paperback edition, which gives the complete anatomy of the single source of all unhappiness, stress and negative feelings, and the technology to get rid of it.There's only one way to find out if the Dianetics procedure is everything millions of people say it is.  Read the book!Dianetics can help you achieve:* Higher intelligence* Creative imagination* Amazing vitality* Good memory* Strong willpower* Radiant health* Magnetic personality* Good self-control RESULTS FROM APPLICATION:\"I suffered for years, ever since I was a kid, from sinus pressure. It would get so bad, I couldn't even bend over to pick up a pencil!\"And as a result, I'd have migraine headaches.\"Dianetics handled the source of my headaches - the reactive mind.\"I can't explain the feeling that I had at that time. The pressure just blew. I could feel it come off my face and it was such a relief.\"I walked around for months thinking, 'Okay, when is it going to come back?When is it going to start?' It never did. It was just gone.\"- K. F.\"My marriage was headed for divorce. And even though we loved each other, something had come between us and we didn't know what it was.\"We tried everything. We went to a marriage counselor, we even went to a psychiatrist and the end result was we still were headed for divorce.\"So just when I was about to file the final papers, a close friend of ours insisted, absolutely insisted, that we try Dianetics.\"And that was when we knew what had come between us - it was the reactive mind.\"So not only did Dianetics give us the tools to save and rebuild our marriage, but we love each other more today than the day we got married.\"C. L. \"Dianetics enabled me to realize my potentials and find the success I had always sought.\"K.B., Top Investment Counselor \"When I was 14 my life  became an uphill struggle.  A severe injury left me with a crippling back pain 24 hours a day.  I was told I would require treatment for the rest of my life and I wold have to live with the pain.  Over the next 12 years, I Iooked everywhere for a solution.  I even became a Doctor  of Chiropractic, but still nothing could make the pain stop.   Finally, I tried Dianetics, and I found that the pain was being caused by the reactive mind.  Within a few hours I stood up and, for the first time in 12 years, the pain was gone.   Dianetics has the answers!\"S.P., Doctor of Chiropractic \"I had a terrible accident and fractured my neck, and as a result was in a terrific amount of pain.  The doctors did everything that they could to try and handle it, and while my neck did heal, the pain persisted.  I began to take drugs to suppress the pain, and I became hooked on drugs.   That was the end of my motorcycle racing career.\"Then I found Dianetics and I found that the pain was in fact  coming from the reactive mind, because Dianetics handled it.  And I was no longer hooked on drugs when the pain was gone. \"I started racing motorcycles again - this was ten years after the accident - and I went right to the top in racing motorcycles here in the United States.  Then I began training others and in fact I've trained ten of the last twelve national superbike champions.  None of this would ever have happened it it wasn't for Dianetics.\"K.C., Champion Motorcycle Racing Instructor",
  "genres": [
    "Religion",
    "Nonfiction",
    "Psychology",
    "Philosophy",
    "Self Help",
    "Spirituality",
    "Science"
  ],
  "author": "L. Ron Hubbard",
  "average_rating": "2.57",
  "url": "https://www.goodreads.com/book/show/2908935-dianetics"
}