{
  "title": "Househusband",
  "description": "Lincoln Menner is finding out just how hard it is to be a woman. When his wife Jo was offered her dream job, Linc supported her wholeheartedly, leaving his thriving landscape business in Los Angeles and moving to Rochester, New York. This was a chance to escape the cloying needs and atrocious tastes of his celebrity clientele, start over in fresh surroundings, and spend a little quality time with their three-year-old daughter, Violet. But Linc had no idea what it really meant to be a househusband: To stay home every day, folding laundry, cleaning soap scum, and teaching his little girl to use the potty. To be ignored at parties by his wife's colleagues who see him as just a homemaker. To be looked upon with suspicious eyes by the neighborhood women who can't understand what sort of man would choose to stay home. And with each new day, Linc is sure that the next load of whites will be the one that sends him off the deep end.Though he has the house humming, Linc misses the outside world, longing to carry on an adult conversation with adult friends (the electrician and the UPS guy are starting to avoid him). Most of all he misses Jo, who is working all hours of the day and night and barely notices the fabulous dinners he slaves over, much less the husband who cooked them. And then there is Marilyn, the attractive next-door neighbor, who has been so friendly and supportive. . . .Now the only thing Linc knows for sure is that something's got to give. Should he go back to work and leave Violet in the hands of someone who is sure to be less competent? Or should he give in and embrace his role as househusband extraordinaire? At turns funny, neurotic, and endearingly vulnerable, Linc Menner will win your heart-- and make you wish you had a househusband all your own. (and you'll love the recipes!).",
  "genres": [
    "Fiction",
    "Book Club",
    "Chick Lit",
    "Adult Fiction",
    "Contemporary",
    "Humor"
  ],
  "author": "Ad Hudler",
  "average_rating": "3.28",
  "url": "https://www.goodreads.com/book/show/1182035.Househusband"
}