{
  "title": "Water Tossing Boulders: How a Family of Chinese Immigrants Led the First Fight to Desegregate Schools in the Jim Crow South",
  "description": "A generation before Brown v. Board of Education struck down America’s “separate but equal” doctrine, one Chinese family and an eccentric Mississippi lawyer fought for desegregation in one of the greatest legal battles never toldOn September 15, 1924, Martha Lum and her older sister Berda were barred from attending middle school in Rosedale, Mississippi. The girls were Chinese American and considered by the school to be “colored”; the school was for whites. This event would lead to the first US Supreme Court case to challenge the constitutionality of racial segregation in Southern public schools, an astonishing thirty years before the landmark Brown v. Board of Education decision.Unearthing one of the greatest stories never told, journalist Adrienne Berard recounts how three unlikely heroes sought to shape a new South. A poor immigrant from southern China, Jeu Gong Lum came to America with the hope of a better future for his family. Unassuming yet boldly determined, his daughter Martha would inhabit that future and become the face of the fight to integrate schools. Earl Brewer, their lawyer and staunch ally, was once a millionaire and governor of Mississippi. When he took the family’s case, Brewer was both bankrupt and a political pariah—a man with nothing left to lose.By confronting the “separate but equal” doctrine, the Lum family fought for the right to educate Chinese Americans in the white schools of the Jim Crow South. Using their groundbreaking lawsuit as a compass, Berard depicts the complicated condition of racial otherness in rural Southern society.In a sweeping narrative that is both epic and intimate, Water Tossing Boulders evokes a time and place previously defined by black and white, a time and place that, until now, has never been viewed through the eyes of a forgotten third race. In vivid prose, the Mississippi Delta, an empire of cotton and a bastion of slavery, is reimagined to reveal the experiences of a lost immigrant community. Through extensive research in historical documents and family correspondence, Berard illuminates a vital, forgotten chapter of America’s past and uncovers the powerful journey of an oppressed people in their struggle for equality.",
  "genres": [
    "History",
    "Nonfiction",
    "Education",
    "Historical",
    "Asian Literature",
    "Race",
    "Audiobook"
  ],
  "author": "Adrienne Berard",
  "average_rating": "3.77",
  "url": "https://www.goodreads.com/book/show/29092981-water-tossing-boulders"
}