{
  "title": "Winning Heather",
  "description": "Full-length standalone novel with a guaranteed HEA and no cliffhanger.  I am about to ruin my perfectly good life... HeatherI can't stop thinking about Mark. It started out as a harmless fantasy, something I can easily control.It's not like anything is ever going to happen between us. I am his boss. He is the most eligible bachelor bad boy in town and he has plenty to occupy his attention anyway. He is not the type that can bring stability into my life. I am also the last person he would ever be interested in.I can't lose control. I am not that type of a woman. I make do with the wild erotic dreams. Until he decides to turn my world upside down and everything falls apart.... And he is going to take everything away from me.MarkMy father is a billionaire. It doesn't mean anything to me yet. I need to prove my mantle of leadership to show him that I am ready to take over. He prods me into a challenge he thinks I cannot win. All I need to do is become the CEO of a company on my own merit. I have identified my target. It will be easy. I am in the business of winning. All I do is win in the boardroom and bedroom. Men envy me. Women drool over me as I ruin them for their husbands. That is who I am. So, I cannot lose this challenge.Heather doesn't know about any of this. She will in due time. After I take over her job, I will take over her. I will claim her. I will rescue her. I will liberate the arrested beauty in her.Here is the problem: Heather does something to me. She makes me want to love a woman, for the first time in my life. I can't lose the mission. I don't want to lose her. I need to win on both counts. May be all I need to do is change the order of business? NOTES:Winning Heather a full-length standalone hot and steamy contemporary romance novel with a happily ever after and no cliffhangers. This is not your typical bad boy billionaire romance. This is over 95,000 words of bad boy exploits, billionaire privilege, and improbable romance. Get ready for a steamy ride with a sexy Alpha hero and a strong and feisty heroine! Oh... and be forewarned, this book is intended for mature audiences.Happy reading!",
  "genres": [],
  "author": "Kaleb Kilton",
  "average_rating": "3.83",
  "url": "https://www.goodreads.com/book/show/29097351-winning-heather"
}