{
  "title": "In the Zone 1-3: On the Surface / Across the Line / Out of the Game",
  "description": "Fall in love with the San Diego Barracudas. Get the first three In the Zone hockey romances, now available in one box set!ON THE SURFACENHL player Tim Hollander lost his temper one time and threw a water bottle at an abusive fan. After \"Bottlegate,\" he's traded to the San Diego Barracudas, where he'll need to keep the bad publicity to a minimum while proving he can still compete with the younger guys on the ice. When pediatric nurse Erin Collier is threatened by an obnoxious fan, Tim rushes to defend the pretty stranger, throwing a punch in the process. The chemistry between Tim and Erin is palpable, but unless he can convince her to see beyond the hockey-thug surface to the good guy underneath, their relationship won't last longer than a single season.ACROSS THE LINECalder Griffin needs to get back in shape. Sidelined last season by a knee injury, he's determined to get back on the ice and play the best hockey of his career. Becca Chen has poured all her energy into the restaurant she owns, desperate to prove that she can succeed in the career of her choice, not her parents'. But one five-hour plane ride flirting with charming, magic-on-the-ice Calder and suddenly she can't keep her hands off him. They live on opposite coasts, and they're both too devoted to their careers. It can't last. All they have to do is prevent their feelings from crossing the line from lust to love…OUT OF THE GAMEAlex Sullivan may be the San Diego Barracudas' resident playboy, but he hasn't been able to forget the woman who kissed him like her life depended on it ten months ago. When he sees her again at a teammate's wedding, he can't think of anything but spending more time with her. Preferably naked. Claire Marzano lost years to an overbearing husband, and she's not going to answer to anyone ever again. A hot fling is just what she needs to get back in the game, and that's exactly what sexy Alex offers—one wild long weekend away, no promises or obligations. Until a surprise announcement and an on-ice accident threaten to derail everything…or cause Alex to finally ditch his old ways and become the man Claire needs him to be.",
  "genres": [],
  "author": "Kate Willoughby",
  "average_rating": "4.46",
  "url": "https://www.goodreads.com/book/show/29105986-in-the-zone-1-3"
}