{
  "title": "Unashamed: Drop the Baggage, Pick up Your Freedom, Fulfill Your Destiny",
  "description": "Bestselling author, speaker, and activist Christine Caine helps you overcome past guilt and live an unashamed life.Shame can take on many forms. It hides in the shadows of the most successful, confident and high-achieving woman who struggles with balancing her work and children, as well as in the heart of the broken, abused and downtrodden woman who has been told that she will never amount to anything. Shame hides in plain sight and can hold us back in ways we do not realize. But Christine Caine wants readers to know we can all be free.\"I know. I've been there,\" writes Christine. \"I was schooled in shame. It has been my constant companion from my very earliest memories. I see shame everywhere I look in the world, including in the church. It creeps from heart to heart, growing in shadowy places, feeding on itself so that those struggling with it are too shamed to seek help from shame itself.\"In Unashamed, Christine reveals the often-hidden consequences of shame--in her own life and the lives of so many Christian women--and invites you to join her in moving from a shame-filled to a shame-free life.In her passionate and candid style, Christine leads you into God's Word where you will see for yourself how to believe that God is bigger than your mistakes, your inadequacies, your past, and your limitations. He is not only more powerful than anything you've done but also stronger than anything ever done to you. You can deal with your yesterday today, so that you can move on to what God has in store for you tomorrow--a powerful purpose and destiny he wants you to fulfill.Join the journey. Lay ahold of the power of Jesus Christ today and step into the future--his future for you--a beautiful, full, life-giving future, where you can even become a shame-lifter to others. Live unashamed!Dive deeper into the Unashamed message with the Unashamed video study and study guide. Available now.",
  "genres": [
    "Christian",
    "Nonfiction",
    "Faith",
    "Christian Living",
    "Self Help",
    "Religion",
    "Spirituality"
  ],
  "author": "Christine Caine",
  "average_rating": "4.30",
  "url": "https://www.goodreads.com/book/show/29105784-unashamed"
}