{
  "title": "Kurt Seyt & Shura",
  "description": "First official English publication of the acclaimed international best-seller...An instant best seller since its debut in 1992, Nermin Bezmen's Kurt Seyt & Shura is a classic of contemporary Turkish literature, a sweeping romantic drama set around the time as the splendor of Imperial Russia is obliterated in the wake of the Great War. Bezmen tells the story of two star-crossed lovers fleeing the wave of devastation wreaked by the Bolshevik Revolution-- and does so with great sensitivity: one half of this couple who sought refuge in the capital of the dying Ottoman Empire was her grandfather.Translated into 12 languages, Kurt Seyt & Shura inspired a sumptuous T.V. series that continues to enchant millions of viewers across the world.With the publication of this novel in the United States, English-speaking fans will now be able to read the true story of this great love affair, which triumphed over so much adversity yet failed to overcome human fallibility.Kurt Seyt: The son of a wealthy Crimean nobleman, is a dashing first lieutenant in the Imperial Life Guard. Injured on the Carpathian front and later sought by the Bolsheviks, he makes a daring escape across the Black Sea. Too proud to accept payment for the boatful of arms he hands over to the Nationalists, he faces years of struggle to make a new life in the Turkish Republic rising from the embers of the dying Ottoman Empire. All he has is his dignity and love.Shura: An innocent sixteen-year-old beauty enchanted by Tchaikovsky's music and Moscow's glittering lights, falls in love with Seyt. A potential victim of the Bolsheviks due to her family's wealth and social standing, she is determined to follow her heart and accompanies Seyt on his perilous flight over the Black Sea. Their love is the only solace to their crushing homesickness for a land and family they will never see again, two lovers among hundreds of thousands of White Russian émigrés trying to eke out a living in occupied Istanbul.",
  "genres": [
    "Historical Fiction",
    "Romance",
    "Turkish Literature",
    "Turkish",
    "Historical",
    "Fiction",
    "Historical Romance"
  ],
  "author": "Nermin Bezmen",
  "average_rating": "4.16",
  "url": "https://www.goodreads.com/book/show/2910527-kurt-seyt-shura"
}