{
  "title": "Stepbrother, Where Art Thou? Collection",
  "description": "The COMPLETE collection of Aya Fukunishi stepbrother novels. THREE scorching Amazon top 100 bestsellers together in a single volume for the first time. Click 'Read more' for full details of this bestseller boxed set.                                             ~ STEPBROTHER FALLEN ~Everything is going great for Madison Moriarty. She's got nice parents, good friends, and she's headed to UCLA at the end of the summer, the first step on an exciting journey towards becoming a world famous author, just like her late father.OK, so she may dress like she survived an explosion at an uptight, buttoned up Martha's Vineyard branch of Tommy Hilfiger, but she's a good girl, damn it, from her boring top-siders to her preppy sweaters right down to her stupid My Little Pony laundry day panties.Rafe Stone... well, Rafe Stone is an asshole, and he's going to fucking jail. That's what happens when you steal your foster parents' Camry and drive it halfway across Colorado, the passenger seat strewn with empty beer cans and a homemade bong. He's been lucky so far, but this time the judge won't be satisfied with a slap on the wrist... unless Maddy's stepfather takes him in.This is what happens when two worlds collide.This is what happens when a nice, polite little princess gets thrown in with the stepbrother she never knew she had, a tattooed thug with a tight t-shirt, torn jeans, a pack of smokes and a bad attitude.This is a story of love, hate and David Fucking Bowie.You're gonna love it.                                    ~ STEPBROTHER, WHERE ART THOU? ~ They say love and hate are just two sides of the same coin; two poles of the exact same emotion. They say a lot of stuff - whoever they are - and it's mostly grade A bull****, but on this point they're bang on the money. The distance between cold, icy hatred and burning, head-over-heels, yell-it-from-the-rooftops love is but the thickness of a shadow, and you wouldn't believe how easy it is to switch from one to the other.Even - especially - when you really don't want to.Ryan was everything shy, awkward scholarship girl Sophia despised: a callous, confident, wealthy ladies man who went through girls faster than she went through gum. It wasn't easy to hate him... it's never easy to hate a guy who looked like Ryan, with his tight abs, chiseled jaw and perfect mess of tousled brown hair, but Sophia managed it.When Sophia's mother announced her intention to marry Ryan's father she thought her life was over. Even after graduation she couldn't escape this infuriating jackass, and now she'd have to sleep in the room next to his. Could life get any worse?Maybe, but it might also get much, much better.You see, Ryan has been hiding a shocking secret for two years, and Sophia is about to learn that she's much more important to him than she could ever understand...Stepbrother, Where Art Thou? is the hot, steamy, fast-paced opening novella to the Stepbrother, Where Art Thou? series.",
  "genres": [],
  "author": "Aya Fukunishi",
  "average_rating": "3.69",
  "url": "https://www.goodreads.com/book/show/29103761-stepbrother-where-art-thou-collection"
}