{
  "title": "Things I've Been Silent About",
  "description": "I started making a list in my diary entitled Things I Have Been Silent About. Under it I wrote: “Falling in Love in Tehran. Going to Parties in Tehran. Watching the Marx Brothers in Tehran. Reading Lolita in Tehran. I wrote about repressive laws and executions, about public and political abominations. Eventually I drifted into writing about private betrayals, implicating myself and those close to me in ways I had never imagined.--From Things I Have Been Silent AboutAzar Nafisi, author of the beloved international bestseller Reading Lolita in Tehran, now gives us a stunning personal story of growing up in Iran, memories of her life lived in thrall to a powerful and complex mother, against the background of a country’s political revolution. A girl’s pain over family secrets; a young woman’s discovery of the power of sensuality in literature; the price a family pays for freedom in a country beset by political upheaval–these and other threads are woven together in this beautiful memoir, as a gifted storyteller once again transforms the way we see the world and “reminds us of why we read in the first place” (Newsday).Nafisi’s intelligent and complicated mother, disappointed in her dreams of leading an important and romantic life, created mesmerizing fictions about herself, her family, and her past. But her daughter soon learned that these narratives of triumph hid as much as they revealed. Nafisi’s father escaped into narratives of another kind, enchanting his children with the classic tales like the Shahnamah, the Persian Book of Kings. When her father started seeing other women, young Azar began to keep his secrets from her mother. Nafisi’s complicity in these childhood dramas ultimately led her to resist remaining silent about other personal, as well as political, cultural, and social, injustices. Reaching back in time to reflect on other generations in the Nafisi family, Things I’ve Been Silent About is also a powerful historical portrait of a family that spans many periods of change leading up to the Islamic Revolution of 1978-79, which turned Azar Nafisi’s beloved Iran into a religious dictatorship. Writing of her mother’s historic term in Parliament, even while her father, once mayor of Tehran, was in jail, Nafisi explores the remarkable “coffee hours” her mother presided over, where at first women came together to gossip, to tell fortunes, and to give silent acknowledgment of things never spoken about, and which then evolved into gatherings where men and women would meet to openly discuss the unfolding revolution. Things I’ve Been Silent About is, finally, a deeply personal reflection on women’s choices, and on how Azar Nafisi found the inspiration for a different kind of life. This unforgettable portrait of a woman, a family, and a troubled homeland is a stunning book that readers will embrace, a new triumph from an author who is a modern master of the memoir.",
  "genres": [
    "Nonfiction",
    "Memoir",
    "Iran",
    "Biography",
    "Biography Memoir",
    "History",
    "Womens"
  ],
  "author": "Azar Nafisi",
  "average_rating": "3.72",
  "url": "https://www.goodreads.com/book/show/2910034-things-i-ve-been-silent-about"
}