{
  "title": "King of Campus",
  "description": "Roan King.The uncrowned king of Barnett University. He's like a freaking celebrity around here. It's totally ridiculous. People, by which I mean grown women, actually stalk him on the internet. And around campus. Apparently he's god's gift to both football and the ladies (I'm using that term loosely). All he has to do is smile and girls just fall right onto their backs before spreading their legs nice and wide. I've heard that he's already plowed his way through half the female population here at Barnett. I'm sure he'll work his way through the second half before he gets drafted to the NFL later this year.Yeah... I don't plan to be one of them. The guy is nothing more than a conceited player. You know the type—a steroid infused meathead jock coasting through college on his football prowess.Ugh.I have three words for you—avoid, avoid, avoid.Need I say more?I don't think so.I've had the sad misfortune of running into him on campus. Literally. As in—I literally slammed into him before spilling my iced coffee drink all over that wide rippling chest of his (did I just say that?). What I learned from the experience is that Roan King is one hell of a cocky son of a—I also learned that he has the most spectacular chest...And don't even get me started on those abs... I could probably cut diamonds on them.Unfortunately for me, Operation Avoid-Roan-King isn't going so well. Everywhere I go, there he is. If he wasn't so ridiculously hot, he would be a hell of a lot easier to forget. With his dark hair, shocking turquoise colored eyes and (damn him) buff body, he's easily the most gorgeous guy I've ever laid eyes on.Crap... see what I mean?Why do I suddenly have the bad feeling that Roan King is going to lead to my utter ruin and downfall?This is a mature New Adult novel with strong language and sexual situations intended for readers over the age of 18.",
  "genres": [
    "Romance",
    "College",
    "Sports",
    "Sports Romance",
    "New Adult",
    "Contemporary",
    "Football"
  ],
  "author": "Jennifer Sucevic",
  "average_rating": "3.80",
  "url": "https://www.goodreads.com/book/show/29103015-king-of-campus"
}