{
  "title": "A Matter of Honor: Pearl Harbor: Betrayal, Blame, and a Family's Quest for Justice",
  "description": "On the seventy-fifth anniversary, the authors of Pulitzer Prize finalist The Eleventh Day unravel the mysteries of Pearl Harbor to expose the scapegoating of the admiral who was in command the day 2,000 Americans died, report on the continuing struggle to restore his lost honor—and clear President Franklin D. Roosevelt of the charge that he knew the attack was coming. The Japanese onslaught on Pearl Harbor on December 7, 1941 devastated Americans and precipitated entry into World War II. In the aftermath, Admiral Husband Kimmel, Commander-in-Chief of the Pacific Fleet, was relieved of command, accused of negligence and dereliction of duty—publicly disgraced. But the Admiral defended his actions through eight investigations and for the rest of his long life. The evidence against him was less than solid. High military and political officials had failed to provide Kimmel and his Army counterpart with vital intelligence. Later, to hide the biggest U.S. intelligence secret of the day, they covered it up. Following the Admiral’s death, his sons—both Navy veterans—fought on to clear his name. Now that they in turn are dead, Kimmel’s grandsons continue the struggle. For them, 2016 is a pivotal year. With unprecedented access to documents, diaries and letters, and the family’s cooperation, Summers’ and Swan’s search for the truth has taken them far beyond the Kimmel story—to explore claims of duplicity and betrayal in high places in Washington. A Matter of Honor is a provocative story of politics and war, of a man willing to sacrifice himself for his country only to be sacrificed himself. Revelatory and definitive, it is an invaluable contribution to our understanding of this pivotal event. The book includes forty black-and-white photos throughout the text.",
  "genres": [
    "History",
    "World War II",
    "Nonfiction",
    "Biography",
    "Military History",
    "Naval History",
    "American History"
  ],
  "author": "Anthony Summers",
  "average_rating": "4.30",
  "url": "https://www.goodreads.com/book/show/29100241-a-matter-of-honor"
}