{
  "title": "Krazy: George Herriman, a Life in Black and White",
  "description": "In the tradition of Schulz and Peanuts, an epic and revelatory biography of Krazy Kat creator George Herriman that explores the turbulent time and place from which he emerged—and the deep secret he explored through his art.The creator of the greatest comic strip in history finally gets his due—in an eye-opening biography that lays bare the truth about his art, his heritage, and his life on America’s color line. A native of nineteenth-century New Orleans, George Herriman came of age as an illustrator, journalist, and cartoonist in the boomtown of Los Angeles and the wild metropolis of New York. Appearing in the biggest newspapers of the early twentieth century—including those owned by William Randolph Hearst—Herriman’s Krazy Kat cartoons quickly propelled him to fame. Although fitfully popular with readers of the period, his work has been widely credited with elevating cartoons from daily amusements to anarchic art.Herriman used his work to explore the human condition, creating a modernist fantasia that was inspired by the landscapes he discovered in his travels—from chaotic urban life to the Beckett-like desert vistas of the Southwest. Yet underlying his own life—and often emerging from the contours of his very public art—was a very private secret: known as \"the Greek\" for his swarthy complexion and curly hair, Herriman was actually African American, born to a prominent Creole family that hid its racial identity in the dangerous days of Reconstruction.Drawing on exhaustive original research into Herriman’s family history, interviews with surviving friends and family, and deep analysis of the artist’s work and surviving written records, Michael Tisserand brings this little-understood figure to vivid life, paying homage to a visionary artist who helped shape modern culture.",
  "genres": [
    "Biography",
    "Comics",
    "Nonfiction",
    "History",
    "Art",
    "Biography Memoir",
    "Comix"
  ],
  "author": "Michael Tisserand",
  "average_rating": "4.22",
  "url": "https://www.goodreads.com/book/show/29099896-krazy"
}