{
  "title": "Against Empathy: The Case for Rational Compassion",
  "description": "New York Post Best Book of 2016. We often think of our capacity to experience the suffering of others as the ultimate source of goodness. Many of our wisest policy-makers, activists, scientists, and philosophers agree that the only problem with empathy is that we don’t have enough of it. Nothing could be farther from the truth, argues Yale researcher Paul Bloom. In Against Empathy, Bloom reveals empathy to be one of the leading motivators of inequality and immorality in society. Far from helping us to improve the lives of others, empathy is a capricious and irrational emotion that appeals to our narrow prejudices. It muddles our judgment and, ironically, often leads to cruelty. We are at our best when we are smart enough not to rely on it, but to draw instead upon a more distanced compassion. Basing his argument on groundbreaking scientific findings, Bloom makes the case that some of the worst decisions made by individuals and nations—who to give money to, when to go to war, how to respond to climate change, and who to imprison—are too often motivated by honest, yet misplaced, emotions. With precision and wit, he demonstrates how empathy distorts our judgment in every aspect of our lives, from philanthropy and charity to the justice system; from medical care and education to parenting and marriage. Without empathy, Bloom insists, our decisions would be clearer, fairer, and—yes—ultimately more moral. Brilliantly argued, urgent and humane, Against Empathy shows us that, when it comes to both major policy decisions and the choices we make in our everyday lives, limiting our impulse toward empathy is often the most compassionate choice we can make.",
  "genres": [
    "Psychology",
    "Nonfiction",
    "Philosophy",
    "Science",
    "Sociology",
    "Audiobook",
    "Self Help"
  ],
  "author": "Paul Bloom",
  "average_rating": "3.58",
  "url": "https://www.goodreads.com/book/show/29100194-against-empathy"
}