{
  "title": "Labyrinths: Emma Jung, Her Marriage to Carl, and the Early Years of Psychoanalysis",
  "description": "A sensational, eye-opening account of Emma Jung’s complex marriage to Carl Gustav Jung and the hitherto unknown role she played in the early years of the psychoanalytic movement. Clever and ambitious, Emma Jung yearned to study the natural sciences at the University of Zurich. But the strict rules of proper Swiss society at the beginning of the twentieth century dictated that a woman of Emma’s stature—one of the richest heiresses in Switzerland—travel to Paris to \"finish\" her education, to prepare for marriage to a suitable man. Engaged to the son of one of her father’s wealthy business colleagues, Emma’s conventional and predictable life was upended when she met Carl Jung. The son of a penniless pastor working as an assistant physician in an insane asylum, Jung dazzled Emma with his intelligence, confidence, and good looks. More important, he offered her freedom from the confines of a traditional haute-bourgeois life. But Emma did not know that Jung’s charisma masked a dark interior—fostered by a strange, isolated childhood and the sexual abuse he’d suffered as a boy—as well as a compulsive philandering that would threaten their marriage. Using letters, family interviews, and rich, never-before-published archival material, Catrine Clay illuminates the Jungs’ unorthodox marriage and explores how it shaped—and was shaped by—the scandalous new movement of psychoanalysis. Most important, Clay reveals how Carl Jung could never have achieved what he did without Emma supporting him through his private torments. The Emma that emerges in the pages of Labyrinths is a strong, brilliant woman, who, with her husband’s encouragement, becomes a successful analyst in her own right.",
  "genres": [
    "Biography",
    "Psychology",
    "Nonfiction",
    "History",
    "Biography Memoir",
    "Psychoanalysis",
    "Philosophy"
  ],
  "author": "Catrine Clay",
  "average_rating": "3.78",
  "url": "https://www.goodreads.com/book/show/29100060-labyrinths"
}