{
  "title": "Trazo de tiza",
  "description": "¿DE QUE VA? Despues de una tormenta, en medio de un caluroso verano, un joven viajero perdido llega con su barco a una pequena isla del atlantico que no aparece en ningun mapa. Una isla en la que solo hay una pequena posada (regentada por una mujer y su hijo), un faro que no funciona y un embarcadero con un muro repleto de mensajes escritos por multitud de viajeros que han pasado por la isla. Alli se encontrara con una joven y elusiva mujer que tambien estaba de paso en la isla, esperando a alguien... SOBRE EL COMIC Trazo de tiza es la obra mas conocida y que ha tenido mayor repercusion del autor gallego Miguelanxo Prado, uno de los historietistas espanoles de mayor prestigio internacional. Trazo de tiza tambien fue la primera historia larga del autor, cuya obra se componia hasta entonces de historietas de corta extension. Trazo de tiza cosecho una larguisima lista de premios a nivel internacional, entre los que destacaremos el Premio Alph Art en Angoulême 1994 y el de Mejor Obra Salo del Còmic de Barcelona 1994. Otros premios recibidos fue Mejor libro de la Asociacion de Libreros Especializados de Francia 1993, Premio de Honor del Festival de Amadora (Portugal), 1994 Premio al Mejor Libro del Ano del Festival de Hyères (Francia) 1993 y Premio de la critica al Mejor Libro del Ano en Austria 1994. Prado tambien estuvo nominado por la edicion inglesa de Trazo de Tiza en los dos Premios mas importantes de EEUU, los Premios Eisner (en la categoria de Mejor Pintor) y en los Premios Harvey (en la categoria de Mejor Obra Extranjera), ambos en su edicion de 1995. A small streak of an island in the Atlantic. On no map. In heavy summer heat. Memories and messages graffitied on the pier wall. A chance encounter with a beautiful elusive woman. A murder. Or was it? Nothing seems completely real. Only the graffitied memories are constant. This is a dream-like, experimental and beautifully colored \"impossible\" story about a man on an island, who can't distinguish dream and reality, or the present and the past.",
  "genres": [
    "Comics",
    "Graphic Novels",
    "Bande Dessinée",
    "Spanish Literature",
    "Fiction",
    "Drama",
    "Comics Bd"
  ],
  "author": "Miguelanxo Prado",
  "average_rating": "3.81",
  "url": "https://www.goodreads.com/book/show/1182159.Trazo_de_tiza"
}