{
  "title": "Muffy: or A Transmigration of Selves",
  "description": "\"Muffy: or a Transmigration of Selves\" is the thin, zigzagging, three dimensional line between brilliance and insanity. Gulik, a man who claims to be an enlightened immortal cockroach in the service of the Goddess of chaos, is an interesting blend of equal parts Tom Robbins, Robert Anton Wilson, and Jhonen Vasquez. He uses the theme of love as self destruction to form an eloquent crash course in the fundamentals of quantum mechanics. The story is original and every bit as funny as it is disturbing. It's the type of book that a young Countess Bathory might have kept in her bathroom. Gulik plays with taboos like a cat with a small snake and questions a number of axioms which are rarely addressed, if ever, in this PC nightmare which we have made for ourselves. This book is beautiful, depraved, thought provoking, bizarre, and absolutely not for children. This is transgressive literature at its best.\" - Claire Ashton, Society for the Debasement of Society. Muffy is the daughter of an extremely wealthy and powerful captain of industry and a famous lawyer. Fineries and privilege permeate her existence. Though publicly her life is perfect she lives in her own private hell; repeatedly raped by her father, ignored by her mother, and condemned to a life of meaningless acquaintances. One day she decides that it might be interesting to be raped by someone who she's not related to. She leaves home in search of adventure and is almost immediately captured by a female artist/serial killer who she quickly falls in love with. Soon she is plunged into the festering sore on the underbelly of society pursued by CIA, police, and Illuminati assassins. Her metaphysical crusade for truth, freedom, and love turns to carnage due to the unfortunate reality that she is completely insane.",
  "genres": [
    "Bizarro Fiction"
  ],
  "author": "S.T. Gulik",
  "average_rating": "3.57",
  "url": "https://www.goodreads.com/book/show/2913741-muffy"
}