{
  "title": "Women Heroes of World War II―the Pacific Theater: 15 Stories of Resistance, Rescue, Sabotage, and Survival",
  "description": "After glamorous American singer Claire Phillips opened her own night club in Manila, using the proceeds to secretly feed starving American POWs, she also began working as a spy, chatting up Japanese military men and passing their secrets along to local guerilla resistance fighters. Australian Army nurse Vivian Bullwinkel, stationed in Singapore then shipwrecked in the Dutch East Indies, became the sole survivor of a horrible massacre by Japanese soldiers. She hid for days, tending to a seriously wounded British soldier while wounded herself. Humanitarian Elizabeth Choy lived the rest of her life hating only war, not her tormentors, after enduring six months of starvation and torture by the Japanese military police.  In these pages, readers will meet these and other courageous women and girls who risked their lives through their involvement in the Pacific Theater of Operations during World War II. Fifteen suspense-filled stories unfold across China, Japan, Mayala, Singapore, the Dutch East Indies, and the Philippines, providing an inspiring reminder of women and girls’ refusal to sit on the sidelines around the world and throughout history.   These women — whose stories span from 1932 through 1945, the last year of the war, when U.S. Marines landed on Iwo Jima — served in dangerous roles as spies, medics, journalists, resisters, and saboteurs. Nine of the women were American; seven were captured and imprisoned by the Japanese, enduring brutal conditions. Author Kathryn J. Atwood provides appropriate context and framing for teens 14 and up to grapple with these harsh realities of war. Discussion questions and a guide for further study assist readers and educators in learning about this important and often neglected period of history.",
  "genres": [
    "Nonfiction",
    "History",
    "World War II",
    "Historical",
    "War",
    "Biography",
    "Feminism"
  ],
  "author": "Kathryn J. Atwood",
  "average_rating": "4.19",
  "url": "https://www.goodreads.com/book/show/29145416-women-heroes-of-world-war-ii-the-pacific-theater"
}