{
  "title": "Christy Miller Collection, Vol. 3",
  "description": "The first twelve books in the popular Christy Miller series are now available in four treasured volumes!Bestselling author Robin Jones Gunn packs each one with enough action, romance, and drama to keep you reading and wanting more. It all starts the summer Christy vacations on a California beach and meets two friends who change her life forever. But after moving across the country with her family, Christy must begin her sophomore year of high school uncertain where she'll fit in. A red-headed new best friend, a try at cheerleading, a job at a pet store, and expectations for the prom fill Christy's high school years with a string of laughter-and-tears moments. Fireball Katie keeps everyone guessing what she'll do next, and surfer Todd keeps showing up while popular Rick has determined to get her full attention! As these memorable years unfold, Christy and her God-loving friends find out what it means to be a \"peculiar treasure.\" Follow Christy Miller as she stays true to her identity in Christ, drawing closer to God for help in realizing her dreams and dealing with her disappointments.Whether you're meeting her for the first time or have known her for years--Christy Is a Forever FriendTrue FriendsWhat is a true friend? Christy Miller knows she has two of Todd and Katie. To show how much she appreciates them, she writes to Todd, who's off surfing in Hawaii, and she agrees to join the ski club with Katie...even though she's scared of skiing! Fortunately, Christy and Katie can laugh as they bumble their way around the bunny slopes at Lake Tahoe. But Christy finds herself caught between new friends and her loyalty to Katie. Will Christy find a way to be a true friend when it counts most? And will she ever hear from Todd?Starry NightIt's Christmastime, and Christy Miller has so much going family time, work, and maybe, just maybe, going to the Rose Bowl Parade with a bunch of friends. If only she could answer Uncle Bob's tough questions. Todd's buddy Doug gives her some insight, and she starts to appreciate him in a whole new way. Rick Doyle shows up again...but is he pursuing Christy or the cutest elf at the mall? Through it all, will Christy find someone special to count the stars with?Seventeen WishesIt's summer, and that means the beach and other adventures. And Christy Miller's best friend, Katie, is always full of ideas. They'll be camp counselors! But when Katie can't go, Christy is bewildered and overwhelmed by her fifth-grade girls, who have boundless energy for anything except what Christy wants them to do. Do they even hear a word she says? Soon they're playing matchmaker between Christy and Jaeson, a handsome counselor...and he doesn't seem to mind. When Christy's seventeenth birthday arrives later in the summer, just what will she be wishing for?Story Behind the Book\"The Christy Miller series began when a group of thirteen year-old girls challenged me to write a novel. I'd been questioning the content of their favorite books when they said, 'Why don't you write a book for us?' I told them no, I only wrote picture books. But they 'How hard could it be? We'll even tell you what to write! We want a love story with teenagers at the beach.' It took two years to write  Summer Promise  but once it was published I continued writing about Christy. There are now over 40 books about Christy and Todd and their Forever Friends.\" --Robin Jones Gunn",
  "genres": [
    "Christian Fiction",
    "Christian",
    "Young Adult",
    "Romance",
    "Fiction",
    "Contemporary",
    "Childrens"
  ],
  "author": "Robin Jones Gunn",
  "average_rating": "4.54",
  "url": "https://www.goodreads.com/book/show/291438.Christy_Miller_Collection_Vol_3"
}