{
  "title": "Elephant Complex: Travels in Sri Lanka",
  "description": "No one sees the world quite like John Gimlette. As The New York Times once noted, “he writes with enormous wit, indignation, and a heightened sense of the absurd.” Writing for both the adventurer and the armchair traveler, he has an eye for unusually telling detail, a sense of wonder, and compelling curiosity for the inside story. This time, he travels to Sri Lanka, a country only now emerging from twenty-six years of civil war. Delving deep into the nation’s story, Gimlette provides us with an astonishing, multifaceted portrait of the island today. His travels reveal the country as never before. Beginning in the exuberant capital, Colombo (“a hint of anarchy everywhere”), he ventures out in all to the dry zones where the island’s 5,800 wild elephants congregate around ancient reservoirs; through cinnamon country with its Portuguese forts; to the “Bible Belt” of Buddhism—the tsunami-ravaged southeast coast; then up into the great green highlands (“the garden in the sky”) and Kandy, the country’s eccentric, aristocratic Shangri-la. Along the way, a wild and often desperate history takes shape, a tale of great colonies (Arab, Portuguese, British, and Dutch) and of the cultural divisions that still divide this society. Before long, we’re in Jaffna and the Vanni, crucibles of the recent conflict. These areas—the hottest, driest, and least hospitable—have been utterly devastated by war and are only now struggling to their feet.But this is also a story of friendship and remarkable encounters. In the course of his journey, Gimlette meets farmers, war heroes, ancient tribesmen, world-class cricketers, terrorists, a former president, old planters, survivors of great massacres—and perhaps some of their perpetrators. That’s to say nothing of the island’s beguiling elephants, crocodiles, snakes, storks, and the greatest concentration of leopards on Earth.             Here is a land of extravagant beauty and profound devastation, of ingenuity and catastrophe, possessed of both a volatile past and an uncertain future—a place capable of being at once heavenly and hellish—all brought to vibrant, fascinating life here on the page.",
  "genres": [
    "Travel",
    "Nonfiction",
    "History",
    "Asia",
    "Travelogue",
    "Memoir",
    "Cultural"
  ],
  "author": "John Gimlette",
  "average_rating": "3.93",
  "url": "https://www.goodreads.com/book/show/29114247-elephant-complex"
}