{
  "title": "Happy Chasing Happy",
  "description": "Winner for \"Best Autobiography/Biography\" - Next Generation Indie Book Awards 2016\nWinner for \"Best Autobiography\" - \nNational Indie Excellence Awards 2016\nRunner Up for \"E-Book Non Fiction\" - Next Generation Indie Book Awards 2016\nRunner Up for \"Biography/Autobiography\" - \nGreat Southeast Book Festival 2016\n\nHonorable Mention for \"General Non Fiction\" -\n Los Angeles Book Festival 2016\n\nAn escape route from feeling trapped to freedom has been spelled out by retired Mixed Martial Arts fighter, Jerome \"Jay\" Isip, a success first in business and then as an author, who has published his second book focusing on a darker time in his life when alcohol and drugs ruled.Although he is now a well-recognized author with several entrepreneurial ventures on his professional resume, he is no stranger to the feelings of self-doubt, depression, and lack of direction that many people---young and old, male and female--- struggle with at one point or another in life. This candid, autobiographical book tells of Jay's journey to find his identity and his own version of \"happy\" in early adulthood through self-destructive means like alcohol, a myriad of drugs, and other risky behavior, and how he pulled himself back from the edge of the abyss, finding himself in an aimless chase to happiness; along discovering his addiction to MMA fighting (hence \"Volume 1: Fight Addiction\").That story is told in Isip's second book, Happy Chasing Happy: An Aimless High to Happiness (Volume 1 Fight Addiction) which is the no-holds barred memoir of an MMA fighter who got back up after defeat and found a worthwhile, successful life outside the ring. \"Happy Chasing Happy is my new book series about my journey to happiness,\" says Isip.\"Readers will enjoy the colorful, hilarious, and emotional roller-coaster of events and lessons. I am no stranger to chasing 'happy.' Caught in the exciting, yet dangerous, cycle of seeking higher highs and lower lows and pushing the limits of my body, mind and spirit with drugs, alcohol and life experiences, I made the journey to the abyss and survived to tell the tale.\" Inside the candid biography, this conversational, authentically-written book tells the story of a man on a mission to find his own version of happy in a way that only a kid from the streets of New Jersey could attempt.Packed with vivid true stories, funny metaphors, and obscure pop-culture references, Happy Chasing Happy is a humorous, insightful, informative, and inspiring book that will entertain readers and find some hope for happiness.",
  "genres": [],
  "author": "Jerome Isip",
  "average_rating": "4.67",
  "url": "https://www.goodreads.com/book/show/29107167-happy-chasing-happy"
}