{
  "title": "Christy Miller Collection, Vol. 2",
  "description": "The first twelve books in the popular Christy Miller series are now available in three treasured volumes! Bestselling author Robin Jones Gunn packs each one with enough action, romance, and drama to keep you reading and wanting more. It all starts the summer Christy vacations on a California beach and meets two friends who change her life forever. But after moving across the country with her family, Christy must begin her sophomore year of high school uncertain where she’ll fit in. A red-headed new best friend, a try at cheerleading, a job at a pet store, and expectations for the prom fill Christy’s high school years with a string of laughter-and-tears moments. Fireball Katie keeps everyone guessing what she’ll do next, and surfer Todd keeps showing up while popular Rick has determined to get her full attention! As these memorable years unfold, Christy and her God-loving friends find out what it means to be a “peculiar treasure.” Follow Christy Miller as she stays true to her identity in Christ, drawing closer to God for help in realizing her dreams and dealing with her disappointments. Whether you’re meeting her for the first time or have known her for years— Christy Is a Forever Friend Surprise Endings Cheerleading tryouts are coming up, and Christy Miller is giving it all she’s got. The competition is tough and some of the girls are just rude, but Christy thinks she has a good chance to make the squad. Meanwhile prom is just around the corner, and Christy hopes her parents will make an exception to their “no dating until sixteen” rule. She’d love to go with Todd to his prom! But nothing turns out as Christy had planned. As the surprises keep coming, can Christy respond with grace...and maybe even spring a surprise of her own? Island Dreamer Christy Miller is spending her sixteenth birthday on Maui with her family, Todd, and Paula, her best friend from Wisconsin! What could be better? But Christy soon finds that she and Paula don’t have as much in common anymore. Paula’s obsessed with having a boyfriend...even if it means stealing Todd from Christy! Will he choose Paula over her? Or will the islands send Christy dreaming in new directions? A Heart Full of Hope Christy Miller is sixteen, and that means she can finally date! Rick has waited months for this, and he has a whole list of dates planned. He’s not happy about her early curfews and weekend job, but Christy knows her parents aren’t about to negotiate on those points. Really, she’s dazzled to be pursued by such a thoughtful guy. So why does she feel overwhelmed? Where does Todd fit into her life now? And can any guy really fulfill all her hopes? Story Behind the Book “The Christy Miller series was actually born when a group of thirteen-year-olds challenged me to write a novel. I’d been questioning the content of their favorite books when they said, ‘Why don’t you write a book for us?’ I told them no, I only wrote picture books. But they ‘How hard could it be? We’ll even tell you what to write! We want a love story with teenagers at the beach.’ And there you go. Summer Promise first released seventeen years ago and is now translated into five languages. I continue to hear from readers all over the world, many girls saying that they gave their life to Christ after reading Summer Promise . I love that!” —Robin Jones Gunn",
  "genres": [
    "Christian",
    "Christian Fiction",
    "Young Adult",
    "Romance",
    "Fiction",
    "Contemporary",
    "Childrens"
  ],
  "author": "Robin Jones Gunn",
  "average_rating": "4.51",
  "url": "https://www.goodreads.com/book/show/291439.Christy_Miller_Collection_Vol_2"
}