{
  "title": "The Collected Works of Billy the Kid",
  "description": "Not a story about me through their eyes then. Find the beginning, the slight silver key to unlock it, to dig it out. Here then is a maze to begin, be in. (p. 20)Funny yet horrifying, improvisational yet highly distilled, unflinchingly violent yet tender and elegiac, Michael Ondaatje’s ground-breaking book The Collected Works of Billy the Kid is a highly polished and self-aware lens focused on the era of one of the most mythologized anti-heroes of the American West. This revolutionary collage of poetry and prose, layered with photos, illustrations and “clippings,” astounded Canada and the world when it was first published in 1969. It earned then-little-known Ondaatje his first of several Governor General’s Awards and brazenly challenged the world’s notions of history and literature.Ondaatje’s Billy the Kid (aka William H. Bonney / Henry McCarty / Henry Antrim) is not the clichéd dimestore comicbook gunslinger later parodied within the pages of this book. Instead, he is a beautiful and dangerous chimera with a driven and kinetic, he also yearns for blankness and rest. A poet and lover, possessing intelligence and sensory discernment far beyond his life’s 21 year allotment, he is also a resolute killer. His friend and nemesis is Sheriff Pat Garrett, who will go on to his own fame (or infamy) for Billy’s execution. Himself a web of contradictions, Ondaatje’s Garrett is “a sane assassin sane assassin sane assassin sane assassin sane assassin sane” (p. 29) who has taught himself a language he’ll never use and has trained himself to be immune to intoxication. As the hero and anti-hero engage in the counterpoint that will lead to Billy’s predetermined death, they are joined by figures both real and imagined, including the homesteaders John and Sallie Chisum, Billy’s lover Angela D, and a passel of outlaws and lawmakers. The voices and images meld, joined by Ondaatje’s own, in a magnificent polyphonic dream of what it means to feel and think and freely act, knowing this breath is your last and you are about to be trapped by history.I am here with the range for everythingcorpuscle muscle hairhands that need the rub of metalthose senses thatthat want to crash things with an axethat listen to deep buried veins in our palmsthose who move in dreams over your women nightnear you, every paw, the invisible hoovesthe mind’s invisible blackout the intricate neverthe body’s waiting rut.(p. 72)",
  "genres": [
    "Poetry",
    "Fiction",
    "Historical Fiction",
    "Westerns",
    "Canada",
    "Literary Fiction",
    "Literature"
  ],
  "author": "Michael Ondaatje",
  "average_rating": "3.95",
  "url": "https://www.goodreads.com/book/show/2916377-the-collected-works-of-billy-the-kid"
}