{
  "title": "My Junior Year of Loathing",
  "description": "Junior year is supposed to be tough. Exams, term papers, homework, college tours, and participation in extra-curricular activities can all add up to non-stop stress. But Melinda Banner has goals to achieve and dreams to make real. This year, she’ll be unstoppable. But even over achievers need a break.While walking in the woods to take a break from the stress of it all, Melinda meets a boy named Connor. After a few more run-ins, the two settle into an uneasy friendship, if you can even call it that. But Connor's closed and mysterious. Whenever Melinda asks too many questions, he suddenly has to go or is no longer interested in talking. When they’re together, she’s torn between wanting him to open up and running away as fast as she can. Still she can't seem to shake her budding interest in him.Connor has his own way of looking at the world, and his views often conflict with Melinda’s practical nature. Can you like someone and loathe them at the same time? Is he even worth the emotional tug on her heartstrings or distraction from all things Junior year?And, as if she needs another project right now, Melinda starts to obsess over the abandoned estate she passes on the way to school each day. Between Connor and the old estate, Melinda's beginning to think she's taking on too much.But Melinda's smart. She finds a way to indulge her interest in the estate and fulfill her obligations. She will uncover the truth behind the aging edifice for an epic article in the school newspaper. But when her investigation reveals a connection between Connor and a tragedy long-since forgotten, Melinda has a choice: put off her junior year achievements to save a local landmark and a boy who constantly pushes her away or put them both out of her mind for good and focus on making the grade.",
  "genres": [
    "Young Adult",
    "Contemporary",
    "Romance"
  ],
  "author": "Jennifer DiGiovanni",
  "average_rating": "4.05",
  "url": "https://www.goodreads.com/book/show/29151390-my-junior-year-of-loathing"
}