{
  "title": "Oxygen",
  "description": "With the compassion of Jodi Picoult and the medical realism of Atul Gawande, Oxygen is a riveting new novel by a real-life anesthesiologist, an intimate story of relationships and family that collides with a high-stakes medical drama. Dr. Marie Heaton is an anesthesiologist at the height of her profession. She has worked, lived and breathed her career since medical school, and she now practices at a top Seattle hospital. Marie has carefully constructed and constricted her life according to empirical truths, to the science and art of medicine. But when her tried-and-true formula suddenly deserts her during a routine surgery, she must explain the nightmarish operating room disaster and face the resulting malpractice suit. Marie's best friend, colleague and former lover, Dr. Joe Hillary, becomes her closest confidante as she twists through depositions, accusations and a remorseful preoccupation with the mother of the patient in question. As she struggles to salvage her career and reputation, Marie must face hard truths about the path she's chosen, the bridges she's burned and the colleagues and superiors she's mistaken for friends.A quieter crisis is simultaneously unfolding within Marie's family. Her aging father is losing his sight and approaching an awkward dependency on Marie and her sister, Lori. But Lori has taken a more traditional path than Marie and is busy raising a family. Although Marie has been estranged from her Texas roots for decades, the ultimate responsibility for their father's care is falling on her.As her carefully structured life begins to collapse, Marie confronts questions of love and betrayal, family bonds and the price of her own choices. Set against the natural splendor of Seattle, and inside the closed vaults of hospital operating rooms, Oxygen climaxes in a final twist that is as heartrending as it is redeeming.",
  "genres": [
    "Fiction",
    "Book Club",
    "Medical",
    "Mystery",
    "Medicine",
    "Contemporary",
    "Adult Fiction"
  ],
  "author": "Nettie A. Holbrook",
  "average_rating": "3.76",
  "url": "https://www.goodreads.com/book/show/2916001-oxygen"
}