{
  "title": "Stories About Me: Short Stories for Kids",
  "description": "As an elementary teacher for thirty years, I would like to emphasize two things that parents/guardians can do to prepare children for success in school. First, read aloud daily to your child from infancy through elementary school. This puts the correct flow of language into your child’s mind, improves vocabulary, imparts knowledge, and helps your child practice visualization, a skill vital for future reading comprehension. In addition, recent research has shown that reading aloud produces good changes in your child’s brain! Regular story time is so important! Second, provide your child with experiences in real life math. Some examples of this are in the Fun and Learning stories in this book. Measure things at home with rulers, yardsticks, and meter sticks, play games with dice, weigh things, and count money. Activities like these can help prepare your child for academics and even give him/her a head start!Stories About Me is a fun, educational book that's designed to be read aloud. It contains sixteen unique short stories in which your child is the main character! He or she will go on adventures, have fun, and learn new things!Stories About Me is divided into three sections. In the first section, the Fun and Learning stories entertain your child while demonstrating basic math activities involving fractions, measurement, simple addition, and more. In addition to reading the stories, you may choose to do the activities with your child. The goal is always exposure to the skill; you are building background and vocabulary. Some stories suggest giving the child an item like a ruler or a set of measuring spoons to hold and observe while you read aloud. Pictures of some items are included in the stories. The Safety section allows your child to visualize himself/herself learning or choosing safe behavior in various situations. In the Just for Fun stories, your child will see himself/herself riding a zip line, playing with friends at a birthday party, and more.",
  "genres": [],
  "author": "Sara Alice",
  "average_rating": "3.00",
  "url": "https://www.goodreads.com/book/show/29171111-stories-about-me"
}