{
  "title": "Paige's Warriors",
  "description": "**Paige's Warriors is set in the Bondmates Universe and can be read as a stand alone, though for the most enjoyment the series should be read in order**After a lifetime of war, Commander Trenzent has left behind the bloody battlefields of the Bel'Tan galaxy and traveled to Earth in the hopes of finding his bondmate. He can only pray that the one woman in the universe who can save his battered soul can look past his scarred exterior to the man within. Unfortunately for Tren, his potential bride is terrified of men thanks to years of abuse at the hands of her father and won't be easy to seduce.Paige Grant is pretty sure she's losing her mind obsessing about a man who doesn't exist. Ever since the night a wormhole opened up next to Jupiter she's had these intense dreams about a terrifying, damaged man who awakens a passion inside of her she never knew existed. Despite his grim exterior, he makes her feel safe and cherished, something she desperately needs.But Trenzent isn't the only Kadothian warrior who believes Paige is his bondmate. An old political enemy and one time lover of Tren's, Lord Rell Thantos, also believes the sweet and shy young Earth woman holds the missing part of his soul. He will do whatever it takes to win her heart, even if it means being bonded to the same woman with a man who hates him.The men will have to find a way to get past their anger and work together to protect Paige against an unknown enemy who is determined to keep the women of Earth out of the Bel'Tan Galaxy forever.Warning- This story is set in the Bel'Tan galaxy where polyamorous relationships are the norm and love in all of its forms is accepted including M/M, M/M/F, M/M/M/F, M/M/F+M/M sexual situations hot enough to melt your panties.Bondmates Series OrderCasey's WarriorsJaz's Warriors(novella)Paige's WarriorsRoxie's Warriors(coming late 2016)",
  "genres": [
    "Menage",
    "Science Fiction",
    "Aliens",
    "M M F",
    "Romance",
    "Erotica",
    "Reverse Harem"
  ],
  "author": "Ann Mayburn",
  "average_rating": "4.07",
  "url": "https://www.goodreads.com/book/show/29200211-paige-s-warriors"
}