{
  "title": "The Jack & Jill Series",
  "description": "END OF DAY (Book 1) Earth to earth, ashes to ashes, dust to dust; in the sure and certain hope of the Resurrection to eternal life.  Four caskets. Two bodies.  Jessica and Jude Day witness their funeral and that of their parents a few yards away from mourning family and friends. Stripped of the only life they’ve ever known, the Days say goodbye to San Francisco forever.  Six months later, two thirty-year-old misfits with elite self-defense skills and penchants for alcohol, sex, and trouble arrive like an earthquake to Peaceful Woods, a retirement community in Omaha, Nebraska, that thrives on rules and gossip. Welcome home, Jackson and Jillian Knight.  Jackson celebrates his new beginning by embracing his job and wiping his cavalier past clean with a temporary oath of celibacy. But Jillian’s past is branded into her soul—the deaths, the insanity, Dr. Luke Jones, and the need to make her lovers bleed. Her chance for redemption comes in the form of a next door neighbor, one Senior Master Sergeant Monaghan. He’s sexy, dangerously alluring, and riddled with emotional issues from years of service. He’s also … So. Damn. Grumpy.  Their mission is simple: Let go, start over, don't kill anyone, and pray that nobody wakes the dead.  MIDDLE OF KNIGHT (Book 2) The living seek forgiveness. The dead seek revenge.  A first love. A last breath. A haunting past.  Armed with a sinful past and an equally sinful body, Jackson Knight absolves his vow of celibacy to pursue Sergeant Monaghan’s unsuspecting—older—housekeeper.  Ryn Middleton, on the cusp of turning forty with a snarky daughter, a killer dog, and an abusive ex-husband, finds Jackson’s advances humorous and unbelievable. After intense negotiations including Vera Wang, Ed Sheeran, and sex four times a day, Ryn accepts Jackson’s marriage proposal on their first date.  What could possibly go wrong?  While struggling to lay claim to the woman of the dreams he never had, Jackson is forced to deal with a grief-stricken Jillian trying to hold on to her past without letting go of her future—the doctor who took her heart and the Sergeant who gave her a new one.  Beyond the hope for light, lies the middle of darkness, the illusion of truth, and a haunting past.  DAWN OF FOREVER (Book 3) ’til death do us part.  Aric James Monaghan promised Jillian Knight Portland. With a heavy heart and a light bag, she travels to the West Coast for the man she loved. In a blink her worlds collide, holding her hostage to a past filled with lies, deceit, and revenge.  Four Caskets Two Bodies It all started with a boy and a girl—their tragic love story is shared through the eyes of the enemy.  Every word fades dreams and shatters memories as life slips away. Jillian needs a Knight, Jessica needs a miracle, and together they need a savior.   *WARNING : This series contains explicit language, sexual content, and abusive scenarios that could be a trigger for certain individuals. 18+",
  "genres": [
    "Romance",
    "Dark Romance",
    "Contemporary",
    "Dark",
    "Suspense",
    "Contemporary Romance",
    "Second Chance"
  ],
  "author": "Jewel E. Ann",
  "average_rating": "4.67",
  "url": "https://www.goodreads.com/book/show/29217104-the-jack-jill-series"
}