{
  "title": "Alpha Bear Princes Box Set",
  "description": "These four sexy billionaires don’t know they’re brothers … or long lost princes. And an evil lurking in the shadows is determined to keep it that way. Destiny is calling the princes back to the throne, but not until they win the heart of their mate.*************************This box set includes all four books of the Alpha Bear Princes series plus exclusive bonus content available nowhere else.Alpha Bear Princes 1: \nPrince Hudson\nBillionaire bear shifter Hudson Royce has learned to keep women at arms-length. He’s been used before, and protecting his privacy is a top priority. Besides, he’s too busy running one of the most powerful corporations in Chicago to waste his time on real relationships. But when a chance encounter with a bold, curvaceous stranger has him believing in fated love, he’ll stop at nothing to make her his. Ballsy businesswoman Kay Hennessy wasn’t sure she’d ever set foot back in Chicago after her ex cheated on her and broke her heart. When she finally revives her courage, she returns to the city only to be courted by the man who once devastated her. Chase wants her back, and she’s ready to consider his proposal until she meets a sexy billionaire who may have a few extra talents she didn’t even know were possible. Little do either of them know that Hudson is really a shifter prince who can’t take the throne without a mate. And an opposing clan will do anything to keep him away … even if it means killing the person he loves most.Alpha Bear Princes 2: \nPrince Samuel\nBillionaire architect Samuel Ryan has hidden the fact that he’s a bear shifter his whole life—especially from women. Now he’s building a second home near Mt. Hood where he can get away from his busy career and shift anytime he wants. When he meets his new, voluptuous construction supplier, he knows she’s his mate immediately. But will she accept him if she learns the truth? Most men think of Francesca “Frankie” Thompson as buddy, not a woman. And Frankie has a hard time not thinking of herself the same way. She’s a curvy, down-to-earth girl who’s happy running her family’s building supply business, and doesn’t expect much more from life. But when Sam shows up and sees her in a whole new light, Frankie suddenly finds herself wanting more from the sexy stranger … and hoping it’s not all a cruel joke. But unbeknownst to them both, Sam is actually a shifter prince who can’t take the throne without a mate. And someone wants very much to prevent that from happening. The easiest way? Make sure his mate wants nothing to do with him. Alpha Bear Princes 3: \nPrince Elliott\nBad boy film producer Elliott Regan has left a pile of broken hearts behind him almost as big as his billionaire inheritance. Now his playboy behavior has landed him in low-budget movie hell with a new, inexperienced director. Except for the woodsy setting that’ll let him shift into his bear form easier than in LA, he’s sure it’ll be his worst nightmare. But the moment he sees his stunning, curvy mate, he knows all his old ways are behind him. As both a minority and a first-time film director, Laila Marks knows she can’t waste her one shot to make it in Hollywood. And the last thing she needs is a bear shifter on her set. Laila grew up around shifters and knows all about bossy alpha bears - and what can happen when a good bear goes bad. But Elliott is persistent … and sexy as hell. She might change her mind if Elliott can prove himself trustworthy. There’s only one problem. Elliott has no idea he’s a shifter prince who can’t take the throne without a mate. And someone lurking in the shadows is bent on making sure he never does … by destroying his credibility with Laila. Alpha Bear Princes 4: \nPrince Maxwell\nEx-Navy SEAL and billionaire bear shifter Maxwell Rex just discovered he’s a prince. Not only that, he’s next in line for the shifter throne. The problem is, he doesn’t want it. His mother, the Empress, sent him away when he was just a kid, and he has no loyalty to her or the crown. When Maxwell spots his mate, all he wants is to make a life with Annika off the grid and never think about his royal ancestry ever again. Polar bear shifter Annika Zoltag couldn’t choose the clan she was born into. Youngest daughter of the man who’s hunting the lost princes, she’s being used as his pawn to steal the throne in exchange for her freedom. But she never expected that her father’s plan might work. When Maxwell bonds to her as his mate, she’ll have to choose between finally winning her independence from the Zoltag clan, or risking her life to save Maxwell. Annika may be the only person who can convince Maxwell to take his rightful place on the throne. But with her father close at their heels, the two will soon discover that love can be a very powerful weaponEach of the sexy books in the Alpha Bear Princes series includes a fated love story with a happily-ever-after; curvy, smart BBW heroines; and steamy billionaire heroes with heart-melting powers. (WARNING: These naughty princes might just melt your Kindle too!)",
  "genres": [
    "Paranormal"
  ],
  "author": "Lily Cahill",
  "average_rating": "4.37",
  "url": "https://www.goodreads.com/book/show/29220867-alpha-bear-princes-box-set"
}