{
  "title": "In Black and White: The Life of Sammy Davis, Jr.",
  "description": "He was, for decades, one of the most recognizable figures in the cultural landscape, his image epitomizing a golden age of American show business. His career spanned a lifetime, but for years he has remained hidden behind the persona he so vigorously generated, and so fiercely protected. Now, in this surprising, illuminating, and compulsively readable biography, we are taken beyond the icon, into the extraordinary, singular life of Sammy Davis, Jr. In scrupulous detail and with stunning powers of evocation, Wil Haygood takes us back to the era of vaudeville, where it all began for four-year-old Sammy who ran out onstage one night and stole the show. From then on it was a motherless childhood on the road, singing and dancing his way across a segregated America with his father and the formidable showman Will Mastin, struggling together to survive the Depression and the demise of vaudeville itself. With an ambition honed by poverty and an obsessive need for applause, Sammy drove his way into the nightclub circuit of the 1940s and 1950s, when, his father and Mastin aging and out of style, he slowly began to make a name for himself, hustling his way to top billing and eventually to recording contracts. From there, he was to stake his claim on Broadway, in Hollywood, and, of course, in Las Vegas. Haygood brings Sammy’s showbiz life into full relief against the backdrop of an America in the throes of racial change. Sammy grew up trapped between the worlds of blacks and whites, with so much invested in both. He made his living entertaining white people but was often denied service in the very venues he played. Drafted into a newly integrated U.S. Army in the 1940s, he saw up close the fierce tensions that seethed below the surface. Dragged into the civil rights movement, he witnessed a hatred that often erupted into violence. In his broad and varied friendships and alliances (with Frank Sinatra; Martin Luther King, Jr.; Richard Nixon; Sidney Poitier; Marilyn Monroe, to name just a few), not to mention his romances (his relationship with Kim Novak and his marriage to the blond beauty May Britt drew death threats), he forged uncharted paths across racial lines. Admired and reviled by both blacks and whites, he was tormented all his life by raging insecurities, and never quite came to terms with his own skin. Ultimately, his only true sense of his identity was as a performer.Based on painstaking research and more than 250 interviews, Wil Haygood brings us a sweeping and vivid cultural history of the twentieth century, chronicling black entertainment from its beginnings and the birth of popular culture as we know it. In Black and White transcends simple biography to become an important record, both celebratory and elegiacal, of a vanished America and its greatest entertainer.",
  "genres": [
    "Biography",
    "Nonfiction",
    "Music",
    "Biography Memoir"
  ],
  "author": "Wil Haygood",
  "average_rating": "4.03",
  "url": "https://www.goodreads.com/book/show/292212.In_Black_and_White"
}