{
  "title": "Rosset: My Life in Publishing and How I Fought Censorship",
  "description": "Genet…Beckett…Burroughs…Miller…Ionesco, Ōe, Duras. Harold Pinter and Tom Stoppard. Hubert Selby Jr. and John Rechy. The legendary film I Am Curious (Yellow). The books that assaulted the fort of propriety that was the United States in the 1950s and ’60s, Lady Chatterley’s Lover and The Tropic of Cancer. The Evergreen Review. Victorian “erotica.” The Autobiography of Malcolm X. A bombing, a sit-in, and a near-fistfight with Norman Mailer. The common thread between these disparate elements, a number of which reshaped modern culture, was Barney Rosset.Rosset was the antidote to the trope of the “gentleman publisher” personified by other pioneering figures of the industry such as Alfred A. Knopf, Bennett Cerf and James Laughlin. If Barney saw a crowd heading one way—he looked the other. If he knew something was forbidden, he regarded it as a plus. Unsurprisingly, financial ruin, along with the highs and lows of critical reception, marked his career. But his unswerving dedication to publishing what he wanted made him one of the most influential publishers ever.Rosset began work on his autobiography a decade before his death in 2012, and several publishers and a number of editors worked with him on the project. Now, at last, in his own words, we have a portrait of the man who reshaped how we think about language, literature—and sex. Here are the stories behind the filming of Norman Mailer’s Maidstone and Samuel Beckett’s Film; the battles with the US government over Tropic of Cancer and much else; the search for Che’s diaries; his romance with the expressionist painter Joan Mitchell, and more.At times appalling, more often inspiring, never boring or conventional: this is Barney Rosset, uncensored.",
  "genres": [
    "History",
    "Nonfiction",
    "Memoir",
    "Literary Fiction"
  ],
  "author": "Barney Rosset",
  "average_rating": "3.92",
  "url": "https://www.goodreads.com/book/show/29220200-rosset"
}