{
  "title": "Led by Faith: Rising from the Ashes of the Rwandan Genocide",
  "description": "For three months in the spring of 1994, the African nation of Rwanda descended into one of the most vicious and bloody genocides the world has ever seen. Immaculée Ilibagiza, a young university student, miraculously survived the savage killing spree that left most of her family, friends, and a million of her fellow citizens dead. Immaculée’s remarkable story of survival was documented in her first book, Left to Discovering God Amidst the Rwandan Holocaust.In Led By Faith, Immaculée takes us with her as her remarkable journey continues. Through her simple and eloquent voice, we experience her hardships and heartache as she struggles to survive and to find meaning and purpose in the aftermath of the holocaust. It is the story of a naïve and vulnerable young woman, orphaned and alone, navigating through a bleak and dangerously hostile world with only an abiding faith in God to guide and protect her. Immaculée fends off sinister new predators, seeks out and comforts scores of children orphaned by the genocide, and searches for love and companionship in a land where hatred still flourishes. Then, fearing again for her safety as Rwanda’s war-crime trials begin, Immaculée flees to America to begin a new chapter of her life as a refugee and immigrant—a stranger in a strange land.With the same courage and faith in God that led her through the darkness of genocide, Immaculée discovers a new life that was beyond her wildest dreams as a small girl in a tiny village in one of Africa’s poorest countries.It is in the United States, her adopted country, where Immaculée can finally look back at all that has happened to her and truly understand why God spared her life . . . so that she would be left to tell her story to the world.",
  "genres": [
    "Nonfiction",
    "Memoir",
    "Biography",
    "Africa",
    "Catholic",
    "Religion",
    "Autobiography"
  ],
  "author": "Immaculée Ilibagiza",
  "average_rating": "4.43",
  "url": "https://www.goodreads.com/book/show/2921701-led-by-faith"
}