{
  "title": "J.P.P. McLeggins & the Buggin' Out World",
  "description": "J.P.P. McLeggins is just a simple spider girl, living in a buggin' out kind of a world. She has survived through the other stages of young spiderhood and made it to Young Arachnihood. Her most difficult days, however, are yet to come. Working part time at a Spiderware store (a place for all insect home remedy and DIY-bug projects!), having her three best friends leading lives of their own, and still at home with her aging and ailing parents ... J.P.P.'s got to figure out which one of her eight legs to step out with next, and in what direction.Little does she know the adventure about to befall her, when her buggin out world REALLY bugs out! An unexpected and mysterious break in to her parents house, and her father's kidnapping, has her webbing out!Was it the golden larvae class? Or Golen Adams, the suspected and shadowy Terrorpest the bugthorities suspected and informed her about, that did this to her parents and home? She had to find out, and had to find her father!Luckily she had her old friend Whitey, the homeless and wise Praying Mantis, whom she had befriended to give her counsel and advice since high school. But when McLeggins finds him missing too, she simply doesn't know what to do...In the midst of all this ... a new world, a new vision of what Insect-o-ciety, of what all BugKind should and could be, dawns upon the young spider girl. She ends up traveling the whole InsectWorld over with Eric, the robber fly who is Whitey's roommate in their secret dumpster den dwelling, to recruit help and find answers on how to help fix her beloved Spider Country. She will have to travel to BeeMerica, Moskeetland, Caterfrica, Prayland and the Red Colony to find these answers and recruit this help. Will she and Eric make it back from their journey? Will J.P.P. McLeggins be able to save Whitey and her dad and find out what is REALLY going on in the BugWorld? And finally, will she come back with the solutions and resources needed to help fix Spider Country for everybuggy?Come on this journey, that is sometimes scary, sometimes funny, always harrowing and full of surprises, and see if, with J.P.P. McLeggins, you can see what's so 'buggin' out' about the buggin out world.",
  "genres": [],
  "author": "M.J.K",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/29228889-j-p-p-mcleggins-the-buggin-out-world"
}