{
  "title": "Worlds Before Adam: The Reconstruction of Geohistory in the Age of Reform",
  "description": "In the late eighteenth and early nineteenth centuries, scientists reconstructed the immensely long history of the earth—and the relatively recent arrival of human life. The geologists of the period, many of whom were devout believers, agreed about this vast timescale. But despite this apparent harmony between geology and Genesis, these scientists still debated a great many Had the earth cooled from its origin as a fiery ball in space, or had it always been the same kind of place as it is now? Was prehuman life marked by mass extinctions, or had fauna and flora changed slowly over time?The first detailed account of the reconstruction of prehuman geohistory, Martin J. S. Rudwick’s Worlds Before Adam picks up where his celebrated Bursting the Limits of Time leaves off. Here, Rudwick takes readers from the post-Napoleonic Restoration in Europe to the early years of Britain’s Victorian age, chronicling the staggering discoveries geologists made during the the unearthing of the first dinosaur fossils, the glacial theory of the last ice age, and the meaning of igneous rocks, among others. Ultimately, Rudwick reveals geology to be the first of the sciences to investigate the historical dimension of nature, a model that Charles Darwin used in developing his evolutionary theory.Featuring an international cast of colorful characters, with Georges Cuvier and Charles Lyell playing major roles and Darwin appearing as a young geologist, Worlds Before Adam is a worthy successor to Rudwick’s magisterial first volume. Completing the highly readable narrative of one of the most momentous changes in human understanding of our place in the natural world, Worlds Before Adam is a capstone to the career of one of the world’s leading historians of science.",
  "genres": [
    "Science",
    "History",
    "History Of Science",
    "Nonfiction",
    "Geology"
  ],
  "author": "Martin J.S. Rudwick",
  "average_rating": "4.63",
  "url": "https://www.goodreads.com/book/show/2923069-worlds-before-adam"
}