{
  "title": "The Witch's Trinity",
  "description": "“A gripping, well-told story of faith and truth.”—Khaled Hosseini, bestselling author of The Kite Runner“A disturbingly effective historical novel.”— Boston Globe“Beautifully written, nary a word out of place, and with a few moments that throw you beyond—the way good books do ... deeply satisfying.”— San Francisco ChronicleA San Francisco Chronicle Notable Book of 2007In 1507, when a severe famine strikes a small town in Germany, a friar arrives from a large city, claiming that the town is under the spell of witches in league with the devil. He brings with him a book called the Malleus Maleficarum—“The Witch’s Hammer”—a guide to gaining confessions of witchcraft, and promises to identify the guilty woman who has brought God’s anger upon the town, burn her, and restore bounty. Güde Müller suffers stark and frightening visions—recently she has seen things that defy explanation. No one in the village know this, and Güde herself worries that perhaps her mind has begun to wander—certainly she has outlived all but one of her peers in Tierkinddorf. Yet of one thing she is absolutely She has become an object of scorn and a burden to her son’s wife. In these desperate times her daughter-in-law would prefer one less hungry mouth at the family table. As the friar turns his eye on each member of the tiny community, Güde dreads what her daughter-in-law might say to win his favor. Then one terrible night Güde follows an unearthly voice and the scent of charred meat into the snow-filled woods. Come morning, she no longer knows if the horror she witnessed was real or imagined. She only knows that if the friar hears of it, she may be damned in this life as well as the next. The Witch’s Trinity beautifully illuminates a dark period of history; it is vividly imagined, elegantly written, haunting, and unforgettable.",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Witches",
    "Historical",
    "Fantasy",
    "Horror",
    "Germany"
  ],
  "author": "Erika Mailman",
  "average_rating": "3.59",
  "url": "https://www.goodreads.com/book/show/2922755-the-witch-s-trinity"
}