{
  "title": "Christopher: A Tale of Seduction",
  "description": "“Either he’s channeling Truman Capote’s spirit, or Allison Burnett has created, all by himself, one of the more assured narrative voices in recent memory. His B. K. Troop is a pitch-perfect bitchy-funny with a twist of rue.” —Louis Bayard, author of Fool’s Errand and Endangered Species“ Christopher is the literary equivalent of sparkling banter whose aftermath is trenchant poignancy. The deep, sad truths of this slyly funny novel continue to gather force long after you’ve finished reading.” —Kate Christensen, author of In the Drink and Jeremy ThraneThe delicious debut of a hilarious new voice in fiction. It’s Oscar Wilde meets Nabokov meets something entirely new.Unemployed, middle-aged, bipolar, gay, bitingly witty, erudite, unattractive, and lonely, B. K. Troop, the narrator of Christopher , isn’t exactly looking forward to a life of exciting prospects—until he meets his new neighbor. Christopher Ireland is a twenty-five-year-old idealist and aspiring novelist still reeling from a bitter divorce. Even though B.K. knows full well that Christopher is hopelessly heterosexual, he wants nothing more than to seduce him, so he sets about his self-appointed mission with all the cunning and zeal of the Big Bad Wolf.Christopher recounts B.K’s year long attempt to consummate his lust, with hilarious results. But it also charts the coming of age of Christopher who, like all true idealists, throws himself body and soul into the quest for a meaningful life. He develops a crush on a married waitress, gets involved in politics, enrolls in a New Age workshop, struggles to begin his first novel, and battles to free himself from the clutches of his monstrous mother. Thankfully, all of this is seen through B.K’s eyes and narrated in his deliciously incisive and witty voice.As often happens in tales of seduction, the seducer winds up being seduced by his prey, and that is precisely what, to his horror, B.K. discovers as his feelings turn more tender than predatory. Both darkly ironic and poignantly romantic, Christopher is a remarkable debut by a brave, acerbic, and original new writer.",
  "genres": [
    "LGBT",
    "Fiction",
    "Gay"
  ],
  "author": "Allison Burnett",
  "average_rating": "3.81",
  "url": "https://www.goodreads.com/book/show/1182522.Christopher"
}