{
  "title": "Royals & Rogues Anthology",
  "description": "Sexy and we know it! They’re on the hunt after your heart. Discover 5 brand new passionate tales of royals, rogues, dreams, passion and conflict. Escape with these modern tales, where happily ever after takes hard work, determination, and some good, old fashioned royal luck.Discover the passionate Royals and Rogues with Shelli Stevens, Carole Mortimer, Susan Stephens, Heather Long and J.C Makk/Angelique Armae.Warning: Contains royal heroes and heroines, tempestuous passion, second chances, roguish competition, and family ties binding them together. Sometimes a royal’s greatest challenge is love…TITLES INCLUDE: Her Marine Prince by Heather Long Princess Francesca “Frankie” Grace has no interest in scandal or pomp and circumstance. Her desire for a military career puts her on a collision course with retired Marine Hugh Dillon.Alexandre by Carole MortimerBillionaire ruler of a Mediterranean principality, Prince Alexandre of Androcco took one look at Anastazia Carmichael and knew he wanted her. And he’s determined to have her. In his arms. In his bed. Any way he can get her.Seducing the Princess by Susan Stephens Angel: The first time I met Gideon Black, I was a teen who hated him with a passion that kept me awake at night. Gideon: A tease at sixteen, Angel has grown into an irresistible, kick-ass woman. I know exactly what I want to do to her—how thoroughly, and for how long.Corrupted by the Prince by Shelli Stevens On the heels of his worst scandal yet, Prince Kostas of Mykorini decides to keep a low profile at his American beach home in the Hamptons. Taking a lover isn't part of his plan until he meets Eva. Evelynn Fairchild knows she should be wary of the bad boy prince, especially when she's considered the levelheaded one in her high profile family. But one earth shattering kiss makes her wonder if she should ditch her virginity status in what surely will be a one-night stand.His Royal Redemption by J.C. Makk/Angelique ArmaeSir Antony Richarden is determined to win the King’s Favor, a prize which will save his family estate and secure his nieces’ future. His only obstacle? Princess Estelle of Dirksbee, the woman he left at the altar is going to make this competition more than difficult. Never mind the fact he still has feelings for Estelle…",
  "genres": [
    "Anthologies",
    "Contemporary Romance",
    "Romance",
    "Contemporary"
  ],
  "author": "Heather Long",
  "average_rating": "4.06",
  "url": "https://www.goodreads.com/book/show/29231827-royals-rogues-anthology"
}