{
  "title": "The Time Stream",
  "description": "She Championed Love Against Science! Here is the rarely reprinted and highly-acclaimed classic, a stunning mixture of passionate romance and scientific adventure, that The Science Fiction Encyclopedia calls, \"one of the outstanding products of the early sf magazines * an elaborate time-travel adventure which helped extend the horizon of pulp sf.\" Some time in the far past or distant future, in the advanced, scientific world of Eos, which just might be Earth, the woman Cheryl demands the right to marry the man she loves, even though genetic analysis shows any children they produce will have less than desirable genes. In a world of perfect freedom, Cheryl is free to do what she pleases. But then one of her four closest friends discovers that before Eos, an even mightier civilization flourished on their world, one that was destroyed then the \"beast\" was let out in human kind. Her friend thinks this \"beast\" could uncontrolled human passion and warns Cheryl's that her choice might somehow threaten their own world. When she demands proof, her four friends set off on a quest across their planet, and deep into its history and science, in search of answers. But wait, that's not where the story starts. It starts pages earlier, on our Earth, in the 20th century, when a woman who is also named Cheryl and her four friends enter the river of time as part of an experiment whose end they can not foresee. But have they been swept backward or forward? As the stream buffets them, they are sometimes on Eos, sometimes on Earth, sometimes on unnamed worlds that may be the future or the past. On all these worlds Cheryl stands firm for her right to the man she loves, convinced that love shows the right path. But does her intransigence spell the end or the beginning for the human race? Critic and historian E. F. Bleiler hailed John Taine's The Time Stream as one of the \"all time classics of science fiction * Taine's finest work * adult science fiction at its best.\"",
  "genres": [
    "Science Fiction",
    "Fiction",
    "Time Travel"
  ],
  "author": "John Taine",
  "average_rating": "3.33",
  "url": "https://www.goodreads.com/book/show/2923292-the-time-stream"
}