{
  "title": "Forsaken",
  "description": "When Simon Mason, the world’s best-known televangelist, receives threats from Muslim terrorists, he hires Taylor Pasbury, a beautiful former Secret Service agent, to take charge of his security. Taylor is thrilled to receive the high-profile assignment, but she has no idea that Simon already knows more about her than she could imagine.When the terrorists strike, making a demand of the pastor that would shake the most steadfast saint, Taylor draws on all of her hard-knock toughness and training as she fights to save Simon and his daughter. Along the way, she discovers that she is not the only one who has done things she would like to forget—and she is not the only one who understands that some things are more important than living.\"James David Jordan pens a fascinating tale that is more than a suspense novel. An intimate exploration of the soul’s need for acceptance and belonging, it touches the nerves of some of our most sensitive fears and longings. Forsaken is a moving and relevant saga of faith on a collision course with the brutalities of our world.\"Endorsements:\"James David Jordan pens a fascinating tale that is more than a suspense novel. An intimate exploration of the soul’s need for acceptance and belonging, it touches the nerves of some of our most sensitive fears and longings. Forsaken is a moving and relevant saga of faith on a collision course with the brutalities of our world.\"—Jill Elizabeth Nelson, author of Reluctant Burglar and Reluctant Smuggler\"Entertaining, action packed, and thought provoking. I couldn’t put it down. Forsaken is a must read.\"—Patricia Rushford, author of Deadly Aim and As Good as Dead\"With more twists and turns than a rip-roaring rollercoaster ride, Forsaken will keep you guessing right to final page. You’ll find no easy answers here but many to consider.\"—Ken Abraham, New York Times bestselling author\"I have read many enthralling suspense novels, meaningful love stories, and books that challenged my thinking and purpose, but never has a novel combined all three elements with such adeptness as Forsaken.\"—RelzReviews",
  "genres": [
    "Christian Fiction",
    "Mystery",
    "Christian",
    "Suspense",
    "Fiction",
    "Contemporary",
    "Terrorism"
  ],
  "author": "James David Jordan",
  "average_rating": "3.92",
  "url": "https://www.goodreads.com/book/show/2923199-forsaken"
}