{
  "title": "Secret Service Dogs: The Heroes Who Protect the President of the United States",
  "description": "In an age fraught with terrorism, United States Secret Service canine teams risk their lives to safeguard the president, vice president, their families, visiting heads of state, and a host of others. Unprecedented access to these heroic dog teams has allowed a fascinating first-time-ever look at a very special breed of heroes.Wherever the president goes, there will be dogs. They’ll be there no matter what the country or state. They’ll be there regardless of the political climate, the danger level, the weather, or the hour. “If you let down your guard on the job,” says Special Agent Bill G., canine program manager, “it can change the history of the world.” It’s a burden Secret Service dog handlers take extremely seriously regardless of their specialty. Tactical dog handlers on the White House lawn, handlers whose dogs sniff for explosives around the world, and those who walk their amiable floppy-eared dogs up and down Pennsylvania Avenue all live one common mantra: Not on my watch. Or my dog’s.Secret Service Dogs immerses readers into the heart of this elite world of canine teams who protect first families, popes, and presidential candidates: the selection of dogs and handlers, their year-round training, their missions around the world, and, most important, the bond—the glue that holds the teams together and can mean the difference between finding bombs and terrorists or letting them slip by. “These animals will gladly run into a hail of gunfire,” says '\"Stew,\" a Secret Service ERT tactical canine unit supervisor. “All they ask in return is for their handlers to throw the ball with them, pet them, and talk to them in an embarrassingly high voice.” Secret Service Dogs celebrates the Secret Service’s most unforgettable canine heroes. It is a must-read for fans of Maria Goodavage, anyone who wants a rare inside view of the United States Secret Service, or just loves dogs.",
  "genres": [
    "Nonfiction",
    "Animals",
    "Dogs",
    "History",
    "Politics",
    "Chapter Books",
    "American"
  ],
  "author": "Maria Goodavage",
  "average_rating": "3.99",
  "url": "https://www.goodreads.com/book/show/29236598-secret-service-dogs"
}