{
  "title": "How Everything Became War and the Military Became Everything: Tales from the Pentagon",
  "description": "The first serious book to examine what happens when the ancient boundary between war and peace is erased.Once, war was a temporary state of affairs—a violent but brief interlude between times of peace. Today, America’s wars are everywhere and our enemies change constantly and rarely wear uniforms, and virtually anything can become a weapon. As war expands, so does the role of the US military. Today, military personnel don’t just “kill people and break stuff.” Instead, they analyze computer code, train Afghan judges, build Ebola isolation wards, eavesdrop on electronic communications, develop soap operas, and patrol for pirates. You name it, the military does it.Rosa Brooks traces this seismic shift in how America wages war from an unconventional perspective—that of a former top Pentagon official who is the daughter of two anti-war protesters and a human rights activist married to an Army Green Beret. Her experiences lead her to an urgent When the boundaries around war disappear, we risk destroying America’s founding values and the laws and institutions we’ve built—and undermining the international rules and organizations that keep our world from sliding towards chaos. If Russia and China have recently grown bolder in their foreign adventures, it’s no accident; US precedents have paved the way for the increasingly unconstrained use of military power by states around the globe. Meanwhile, we continue to pile new tasks onto the military, making it increasingly ill-prepared for the threats America will face in the years to come.By turns a memoir, a work of journalism, a scholarly exploration into history, anthropology and law, and a rallying cry, How Everything Became War and the Military Became Everything transforms the familiar into the alien, showing us that the culture we inhabit is reshaping us in ways we may suspect, but don’t really understand. It’s the kind of book that will leave you moved, astonished, and profoundly disturbed, for the world around us is quietly changing beyond recognition—and time is running out to make things right.",
  "genres": [
    "Nonfiction",
    "Politics",
    "History",
    "Military Fiction",
    "War",
    "American History",
    "Military History"
  ],
  "author": "Rosa Brooks",
  "average_rating": "3.93",
  "url": "https://www.goodreads.com/book/show/29238798-how-everything-became-war-and-the-military-became-everything"
}