{
  "title": "Tea and Crumpet",
  "description": "Raise your rainbow umbrellas high and celebrate!Enjoy this enchanting, entertaining and thought-provoking collection, a heartfelt expression of what it means to be queer in Britain, past and present. All these stories reflect the iconic sights and national character of the British a taste of our idiosyncrasies and eccentricities, but also an unashamed representation of the love, loyalty and laughter of our people.Including a wide range of style and subject, this is the perfect way to sample different authors and to find both existing and new favourites. Follow the British way of life from historic villages to modern cities, from the countryside to the sea, through history and with a fantasy twist, in gardens, churches, campus and the familiar, much-loved local pub.The stories cover universal themes of romance, desire, remembrance and reconciliation. The authors range from multi-published to up-and-coming, and they all share a passion for their characters, whether through great drama, erotic excitement, humour -- or a combination of all three!Contributors Alex Beecroft, Jennie Caldwell, Stevie Carroll, Charlie Cochrane, Lucy Felthouse, Elin Gregory, Mara Ismine, Clare London, Anna Marie May, JL Merrow, Josephine Myles, Zahra Owens, Jay Rookwood, Chris Smith, Stevie Woods, Lisa Worrall, and Serena Yates. Edited UK MAT (UK Meet Acquisitions Team).This anthology is a souvenir of the 2011 UK Meet, an occasion for GLBTQ supporters to get together in a relaxed setting to celebrate and chat about the fiction community they love. Funds from the sale of this anthology will go towards future UK Meets, to which all are welcome. Please visit the website for details, or contact UK MAT through the publisher.",
  "genres": [
    "Anthologies",
    "M M Romance",
    "Romance",
    "Contemporary",
    "LGBT",
    "Short Stories",
    "Historical"
  ],
  "author": "Josephine Myles",
  "average_rating": "3.81",
  "url": "https://www.goodreads.com/book/show/11826101-tea-and-crumpet"
}