{
  "title": "The Best of Lucy Felthouse",
  "description": "Described as 'a true mistress of the erotic word,' this collection of Lucy Felthouse's work is sure to get you tingling in all the right places. Contains five titillating tales selected from Lucy's many popular short stories.Fantasy AssignmentShe loves a man in uniform, so being sent to write a feature about life in an army camp leaves Charlene feeling all her Christmases have come at once. Her guide round the barracks is the very sexy Corporal Matt Stokes, and as soon as she sets eyes on him, Charlene can’t wait to see his privates on parade.A Lucky ManIt's an awful lot like Christmas, isn't it? That's usually the time when you just cannot decide whether you'd really prefer a leg, or a nice mouthful of breast. And even admiring a round and firm parson's nose only distracts you all the more, making it difficult for you to try and explain why you feel so bad about having to choose just the one to enjoy.Posh BoyAccents make her horny, particularly posh ones. So when our narrator calls a friend to wish him a happy birthday and hears Nathan's dulcet tones in the background, the fun really begins. The pair exchange telephone numbers and chat regularly. Soon the talk turns dirty, and what starts as smoking hot phone sex ends with a promise to meet up and make their fantasies into reality.E620Sometimes, the best way to get through a boring lecture is to entertain yourself with a spicy fantasy. This erotica-writing student has a vivid imagination and a lust for her fellow student, Karl, and when the two combine, the result is sizzling sex in the classroom.Beach BabeMegan’s relaxing, yet uneventful beach holiday on a secluded island hots up when she meets a sex god. He's a gorgeous guy and Megan would definitely like to see what he's hiding under those shorts. The trouble is, he doesn't speak a word of English. Undeterred, Megan decides she's just going to have to use body language to get what she wants. A squirt of sun cream later and the fun really begins... These stories have also been published in the following Xcite Books anthologies:Fantasy Assignment also appeared in Seriously Sexy 3The Lucky Man appeared in Ultimate CurvesPosh Boy appeared in Temptations Vol 2E620 appeared in Sex, Love and ValentinesBeach Babe appeared in Red Hot Reads 2",
  "genres": [],
  "author": "Lucy Felthouse",
  "average_rating": "4.17",
  "url": "https://www.goodreads.com/book/show/11826008-the-best-of-lucy-felthouse"
}