{
  "title": "The Weight Loss Cure They Don't Want You to Know About",
  "description": "An absolute cure for obesity was discovered almost fifty years ago by a British medical doctor. Tens of thousands of people used this simple, inexpensive, safe medical treatment and achieved miraculous, fast, and permanent weight loss. Stubborn area fat deposits melted away. Body reshaping of the hips, thighs, buttocks, and waist was so dramatic it appeared as if the patients received liposuction! Amazingly, this medical breakthrough has been debunked, discredited, and suppressed by the American Medical Association, the Food and Drug Administration, and other medical establishments throughout the world. Now, for the first time in fifty years, this revolutionary breakthrough discovery, which permanently cures the condition of obesity, is being released to the public.The main problems that overweight people deal with are massive, intense, constant physical hunger; food cravings and uncontrollable urges to eat when not hungry; low metabolism; and an abnormally high amount of fat stored in stubborn secure problem areas such as the hips, thighs, buttocks, and waist. This “weight loss cure protocol” has been proven to be virtually 100% successful in correcting these conditions, thus curing the individual of obesity for life! Read the fascinating true story of how this discovery was made and, more importantly, how this miracle weight loss breakthrough has been hidden from the public so that drug companies can make billions of dollars selling their expensive drug treatments and surgical procedures for obesity. You’ll be amazed to read how the food manufacturers actually have a financial incentive to make you fat! This is the book that answers all the questions about why people today are continually getting fatter and fatter. The good news is this book gives you the cure that can solve your overweight condition once and for all.",
  "genres": [
    "Health",
    "Self Help",
    "Nonfiction"
  ],
  "author": "Kevin Trudeau",
  "average_rating": "2.94",
  "url": "https://www.goodreads.com/book/show/29249.The_Weight_Loss_Cure_They_Don_t_Want_You_to_Know_About"
}