{
  "title": "Axe's Fall",
  "description": "The first time Axe saw her at his friend’s wedding, he knew she’d have her long legs wrapped around his waist, moaning and begging for more.  A member of the Insurgents Motorcycle Club, Axe has the tattoos, the ripped body, and the badass attitude. He’s great in bed and always leaves women pleading for more. But…  Don’t ask him to commit. Don’t ask for a phone call. Don’t expect anything but wild, mind-blowing sex.  That’s the way he rolls…. Until he meets her.  It was a one-night stand. He was gone before she woke up. Finished. Done. Moved on.  Except he can’t stop thinking about her.  What the f*&k?!  Baylee Peters has thrown herself obsessively into her career vying for the brass ring of partnership at one of the most prestigious architecture firms in Denver.   Not wanting any distractions, she has shelved romance. Nothing can stand in her way.  Until she meets him. The dark-haired man with the smoldering eyes and tatted, chiseled body who makes her insides melt.  It was just for one night. So what if the sex was incredible?  Then work takes her to Pinewood Springs. And to him. Her ordered world explodes.  As if she didn’t have enough trouble with a sexy, bad boy biker whom she can’t stop drooling over, her memory of the night her mother was murdered is coming back, and the killer is waiting to make sure no one knows what she remembers.  Can Baylee trust Axe enough to let him into her life and take control? Can he save her before a determined killer takes away Axe’s one chance at happiness?   Axe vows to protect her, and he will stop at nothing until he makes her his woman.  The Insurgents MC series are standalone romance novels. This is Axe and Baylee’s love story. This book contains violence, strong language, and steamy/graphic sexual scenes. It describes the life and actions of an outlaw motorcycle club. If you are sensitive to this type of story, do not read the book. HEA. No cliffhangers! The book is intended for readers over the age of 18.",
  "genres": [
    "Romance",
    "Contemporary",
    "Suspense",
    "Erotica",
    "Crime",
    "Contemporary Romance",
    "Dark"
  ],
  "author": "Chiah Wilder",
  "average_rating": "4.31",
  "url": "https://www.goodreads.com/book/show/29247841-axe-s-fall"
}