{
  "title": "Exquisite Karma",
  "description": "~Author's Note-Exquisite Karma is part 2 of Beach and Sarah's story. Part 1, Exquisite Redemption, should be read first for the most enjoyment.~SarahLife as the old lady of Carlos 'Beach' Rodriguez, National President of the Iron Horse MC, was everything I never knew I wanted. Not only did I have a good man who treated me like a queen and loved me like crazy, I also had a vast-extended family of rough and tumble bikers who accepted and welcomed me into their world without judgement. Unfortunately, good things don't last for a girl like me and just when I finally felt like I'd found my happily ever after my psychopath of a mother had to show up and destroy it. She betrayed me, betrayed the club, and put everyone I've ever loved in mortal danger. Our only chance of surviving this is for me to find her and recover the weapons that Iron Horse was moving for the Russian and Israeli mafia that she helped steal. I can only hope that Beach can forgive me for her sins. BeachI should have known Sarah would never betray me, would never work with her junkie mom to steal from the club, but I let my temper run my mouth and now my woman's gone. Normally I'd go after her, but the Russian and Israeli mafias want their merchandise back and if we don't find it they'll wipe us off the face of the earth. To make matters worse, there are traitors in the Iron Horse MC that are feeding our every move to our enemies, kidnapping our women and children, and killing our men. I have to stay here in Austin and try to save our people while Sarah is out there, somewhere, alone, hunting down some of the most dangerous men in the world. I can only pray that God takes mercy on my wicked soul and protects my baby girl from those seeking to cash in on the massive bounty on her head before I can find her. 'Cause if they find her first death would be a mercy compared to the nightmare her life will become.",
  "genres": [
    "Romance",
    "BDSM",
    "Contemporary Romance",
    "Erotica",
    "Abuse",
    "Suspense",
    "Crime"
  ],
  "author": "Ann Mayburn",
  "average_rating": "4.30",
  "url": "https://www.goodreads.com/book/show/29250050-exquisite-karma"
}