{
  "title": "Goden en mythen van Noord-Europa",
  "description": "This is a pre-ISBN bookBinnenflap:Het is merkwaardig dat de oud-Germaanse mythologie veel minder in de kunst en de literatuur van West-Europa is overgegaan dan die van het Middellandse-zeegebied. Meestal kent men slecht enkele hoofdzaken uit het relaas dat de IJslandse schrijver Snorri er in de 13e eeuw in zijn Edda van gaf, als christen, om iets van de heidense oudheid voor het nageslacht te bewaren. Archeologische en mythologische onderzoekingen hebben in de laatste tijd nieuwe gegevens aan de traditionele kennis toegevoegd. Dr. Ellis Davidson, reeds jaren specialiste op dit gebied, heeft zich erop toegelegd de oude stof en de nieuwe inzichten te bewerken in een overzicht dat wetenschappelijk verantwoord en tevens voor alle belangstellenden goed leesbaar is. Zij beschrijft systematisch de diverse goden en hun functies, in de strijd en het onweer, in de vruchtbaarheid van de aarde, in de zee en in het dodenrijk, alsook de meest raadselachtige figuren van het Noorse pantheon als Heimdal, Baldur en Loki. Zij laat zien hoe de cultus van deze godheden in de dagen van de Vikingen verband hield met het dagelijkse leven, en zij maakt duidelijk waarom deze religieuze praktijk op een bepaalde tijd moest wijken voor het christelijk geloof. Het boek is een studiewerk voor de beoefenaars van geschiedenis en archeologie, van godsdienst wetenschap en culturele wetenschappen; het is tevens een prettig leesboek voor allen die belang stellen in de mythologie van het Noorden.Achterkant:Hilda Roderick Ellis Davidson, geboren in 1914 te Bebington in Engeland, ontving haar schoolopleiding in Cambridge en studeerde daar aanvankelijk Engels en archeologie. Na drie jaar onderzoek van de oude heidense religie van Scandinavië onder leiding van prof. en mevr. Chadwick verwierf zij de graad van doctor in de filosofie. Zij was een tijdlang bij het onderwijs werkzaam; sinds 1955 legt zij zich geheel toe op het wetenschappelijk onderzoek en op het publiceren daarover. Naast vele artikelen in tijdschriften en in de Encyclopedia Brittanica schreef zij The Road to Hell (1943), The Golden Age of Northumbria (1958) en The Sword in Saxon England (1962).",
  "genres": [
    "Mythology",
    "History",
    "Nonfiction",
    "Religion",
    "Folklore",
    "Paganism",
    "Medieval"
  ],
  "author": "H.R. Ellis Davidson",
  "average_rating": "4.08",
  "url": "https://www.goodreads.com/book/show/2926408-goden-en-mythen-van-noord-europa"
}