{
  "title": "Rachael Ray's Big Orange Book",
  "description": "In the 10 years since she served up her first 30-minute meal—and thousands of delectable dinners later— Rachael Ray has learned just about all there is to know about getting a great tasting meal on the table in a hurry, whether it is one of her patented 30-minute miracles or something just a tad more involved for a special gathering. Rachael’s Big Orange Book is the ultimate resource for busy cooks. Need kitchen inspiration? It’s all here and it’s all new—and bigger than ever!Just one for dinner tonight? Forget the cold cereal. Rach has a chapter of recipes that make dining on your own a thoroughly civilized occasion, with great meals that won’t leave you with a fridge full of leftovers. Vegetarians on the guest list? No problem! Choose from dozens of meat-free meals that are every bit as satisfying as your tried-and-true standards and savory enough to please the carnivores in your crowd. Observing a Kosher menu? Check out the selection of menus just for Kosher cooks, all ready in less than, you guessed it, 30 minutes. There's even a mother lode of burger recipes for fans of the bun—so many options you could make a different burger every day for a full month!In addition to her latest 30-minute creations, Rachael has put together an array of menus and recipes for easy entertaining, from quick snacks to serve for game night and easy hors d’oeuvres, to soup-to-nuts menus for her favorite holidays and special occasions. Whip up a pasta buffet for a special mom on Mother’s Day, please a crowd with a super-simple Oscar party menu, and give thanks for not one but four fantastic menus that keep holiday stress to a minimum by getting you out of the kitchen in record time. Best of all, these recipes have all the huge flavors you’ve come to expect from Rachael, with something to please every taste—and every food budget. You’ll even find the treasured family recipes that Rachael and her husband, John, have enjoyed for years; see if they don’t become beloved family traditions in your home as well. Whether this is your first introduction to cooking the 30-minute way or you are a long-time convert, you’ll find irresistible new recipes here to make the most of every second you spend in the kitchen.",
  "genres": [
    "Cookbooks",
    "Cooking",
    "Nonfiction",
    "Food",
    "Reference"
  ],
  "author": "Rachael Ray",
  "average_rating": "3.89",
  "url": "https://www.goodreads.com/book/show/2925652-rachael-ray-s-big-orange-book"
}