{
  "title": "Dying and Living in the Neighborhood: A Street-Level View of America’s Healthcare Promise",
  "description": "Have neighborhoods been left out of the seismic healthcare reform efforts to connect struggling Americans with the help they need? Even as US spending on healthcare skyrockets, impoverished Americans continue to fall ill and die of preventable conditions. Although the majority of health outcomes are shaped by non-medical factors, public and private healthcare reform efforts have largely ignored the complex local circumstances that make it difficult for struggling men, women, and children to live healthier lives. In Dying and Living in the Neighborhood , Dr. Prabhjot Singh argues that we must look beyond the walls of the hospital and into the neighborhoods where patients live and die to address the troubling rise in chronic disease. Building on his training as a physician in Harlem, Dr. Singh draws from research in sociology and economics to look at how our healthcare systems are designed and how the development of technologies like the Internet enable us to rethink strategies for assembling healthier neighborhoods. In part I, Singh presents the story of Ray, a patient whose death illuminated how he had lived, his neighborhood context, and the forces that accelerated his decline. In part II, Singh introduces nationally recognized pioneers who are acting on the local level to build critical components of a neighborhood-based health system. In the process, he encounters a movement of people and organizations with similar visions of a porous, neighborhood-embedded healthcare system. Finally, in part III he explores how civic technologies may help forge a new set of relationships among healthcare, public health, and community development. Every rising public health leader, frontline clinician, and policymaker in the country should read this book to better understand how they can contribute to a more integrated and supportive healthcare system.",
  "genres": [
    "Health",
    "Nonfiction"
  ],
  "author": "Prabhjot Singh",
  "average_rating": "3.71",
  "url": "https://www.goodreads.com/book/show/29274562-dying-and-living-in-the-neighborhood"
}