{
  "title": "The Field of Fight: How We Can Win the Global War Against Radical Islam and Its Allies",
  "description": "The Instant New York Times BestsellerTen years ago we found evidence that al-Qaeda was far more organized and adept than we had previously given them credit for. It took us nearly that long to locate and execute their leader, Osama bin Laden, and we are far from finished. Al-Qaeda has morphed into a much more dangerous, menacing threat: ISIS. A war is being waged against us by radical Islamists, and, as current events demonstrate, they are only getting stronger. This book aims to inform the American people of the grave danger we face in the war on terror—and will continue to face—until our government takes decisive action against the terrorists that want nothing more than to destroy us and our way of life. Lt. General Michael T. Flynn spent more than 33 years in Army intelligence, working closely with Generals Stanley McChrystal and David Petraeus, Admiral Mike Mullen, Director of National Intelligence James Clapper, and other policy, defense and intelligence community, and war-fighting leaders. From coordinating on-the-ground operations in Iraq, Afghanistan, and elsewhere, to building reliable intelligence networks, to preparing strategic plans for fighting terrorism, Flynn has been a firsthand witness to government screw-ups, smokescreens, and censored information that our leaders don’t want us to know. A year before he was scheduled to retire, Flynn was sacked as Director of the Defense Intelligence Agency for, among other things, telling a Congressional Committee that the American people are in more danger than we were just a few years ago. Why? The Field of Fight succinctly lays out why we have failed to stop terrorist groups from growing, and what we must do to stop them. The core message is that if you understand your enemies, it’s a lot easier to defeat them—but because our government has concealed the actions of terrorists like bin Laden and groups like ISIS, and the role of Iran in the rise of radical Islam, we don’t fully understand the enormity of the threat they pose against us.A call to action that is sensible, informed, and original, The Field of Fight asserts that we must find a way to not only fight better, but to win.",
  "genres": [
    "Politics",
    "Nonfiction",
    "Military Fiction",
    "Islam",
    "Terrorism",
    "History",
    "War"
  ],
  "author": "Michael T. Flynn",
  "average_rating": "3.63",
  "url": "https://www.goodreads.com/book/show/29285034-the-field-of-fight"
}