{
  "title": "MacLaren's Bride",
  "description": "From award winning author Debra Dier comes a tale of lost love and second chances. MacLaren’s Bride is set in the Scottish Highlands soon after Waterloo.  This edition includes substantial revisions to characters and plot. Book 2 in The Heiresses Series. Each book in the series can be enjoyed as a stand-alone novel.  Ms. Dier has written a thoroughly enjoyable novel that readers will love! Combine a wild Scottish warrior and an English ice queen and you get a passionate romance sure to enthrall readers! Magical! A wonderful story from the pen of Debra Dier! A fast-paced, romantic tale! Debra Dier will woo many readers with her gift for story telling! Kristina Wright — Copyright © Literary Times, Inc. All rights reserved — From Literary Times  Meg Drummond was known as the Snow Queen, a challenge to the gentlemen of the ton, for it was said she could freeze a man with a single glance of her green eyes. No one knew the icy castle walls were built to protect the vulnerable girl within. Meg didn’t trust easily, not after witnessing the fiery destruction of her parents’ marriage. Since she was a child she had only ever thought of one man in terms of happily ever after, and he had never returned her regard.  After leaving the Highlands, Meg managed to change from an awkward hoyden into the elegant lady her English mother expected her to be. Though she allowed her estranged father to believe she would marry an Englishman to spite him, she had no intention of ever allowing any man close enough to hurt her, until Alec MacLaren charged back into her life. She has loved the charming rogue since she was a child. Yet can she trust the wicked Highlander with her heart?  A hero of Waterloo, Alec owed Meg’s father his life. Although he had no desire for an arranged marriage, Alec kidnapped and married Meg out of his debt to Robert Drummond. Once he held Meg in his arms he realized there just might be something more to this marriage than he had expected. A suspicious tragedy had made him Earl of Dunleith. Alec doesn’t realize a murderer lurks in the shadows waiting to take everything from him.  After years of war Alec longs for a home and family. He knows he must break through the wall of ice surrounding Meg’s heart, gain her trust, and awaken her desire to truly make her his bride.  “Debra Dier always brings something new and special to the genre…”—RT Reviews  Visit debradier.com to read the first four chapters of the book.",
  "genres": [
    "Historical Romance",
    "Romance",
    "Historical"
  ],
  "author": "Debra Dier",
  "average_rating": "3.81",
  "url": "https://www.goodreads.com/book/show/29283677-maclaren-s-bride"
}