{
  "title": "Evolution and Conversion: Dialogues on the Origins of Culture",
  "description": "Presented as a series of conversations, Evolution and Conversion is a thorough discussion of the major tenets of Girard's thought.René Girard is one of the most brilliant and striking intellectuals of the 20th century. His theory on the imitative nature of desire and on the violent origin of culture has been at the centre of the philosophical and theoretical debate since the publication in 1971 of his seminal book: Violence and the Sacred. His reflection on the relationship between violence and religion is one of the most original and persuasive and, given the urgency of this issue in our contemporary world, demands a reappraisal.Girard, who has been hailed by Michel Serres as \"the Charles Darwin\" of human sciences, is in fact one of the few thinkers in the humanities and social sciences that takes into full consideration an evolutionary perspective to explain the emergence of culture and institutions. The authors draw out this aspect of his thought by foregrounding ethological, anthropological and evolutionary theories.Methodological and epistemological systematization has also been lacking in Girard's previous books, and by questioning him on the issue of evidence and truth, the authors provide a convincing framework for further inquiries. In the last chapters, Girard proposes a provocative re-reading of the Biblical texts, seen as the culmination of an enduring process of historical awareness of the presence and function of collective violence in our world. In fact, Girard's long argument is a historical spiral in which the origin of culture and archaic religion is reunited with the contemporary world by means of a reinterpretation of Christianity and its revelation of the intrinsic violent nature of the human being.",
  "genres": [
    "Philosophy",
    "Anthropology",
    "Sociology",
    "Science",
    "Nonfiction",
    "Theology",
    "Religion"
  ],
  "author": "René Girard",
  "average_rating": "4.08",
  "url": "https://www.goodreads.com/book/show/2930212-evolution-and-conversion"
}