{
  "title": "The Best Alternate History Stories of the 20th Century",
  "description": "Explore fascinating, often chilling “ what if ” accounts of the world that could have existed—and still might yet . . .Science fiction’s most illustrious and visionary authors hold forth the ultimate alternate history collection. Here you’ll experience mind-bending tales that challenge your views of the past, present, and future, • “The Lucky Strike”: When the Lucky Strike  is chosen over the Enola Gay  to drop the first atomic bomb, fate takes an unexpected turn in Kim Stanley Robinson’s gripping tale.• “Bring the Jubilee”: Ward Moore’s novella masterpiece offers a rebel victory at Gettysburg which changes the course of the Civil War . . . and all of American history.• “Through Road No Wither”: After Hitler’s victory in World War II, two Nazi officers confront their destiny in Greg Bear’s apocalyptic vision of the future.• “All the Myriad Ways”: Murder or suicide, Ambrose Harmon’s death leads the police down an infinite number of pathways in Larry Niven’s brilliant and defining tale of alternatives and consequences.• “Mozart in Mirrorshades”: Bruce Sterling and Lewis Shiner explore a terrifying era as the future crashes into the past—with disastrous results.. . . as well as  “The Winterberry” by Nicholas A. DiChario • “Islands in the Sea” by Harry Turtledove • “Suppose They Gave a Peace” by Susan Shwartz • “Manassas, Again” by Gregory Benford • “Dance Band on the Titanic ” by Jack L. Chalker • “Eutopia” by Poul Anderson • “The Undiscovered” by William Sanders • “The Death of Captain Future” by Allen Steele • and “Moon of Ice” by Brad LinaweaverThe definitive fourteen seminal alternate history tales drawing readers into a universe of dramatic possibility and endless wonder.",
  "genres": [
    "Alternate History",
    "Science Fiction",
    "Short Stories",
    "Fiction",
    "Anthologies",
    "Historical Fiction",
    "Fantasy"
  ],
  "author": "Harry Turtledove",
  "average_rating": "3.60",
  "url": "https://www.goodreads.com/book/show/293299.The_Best_Alternate_History_Stories_of_the_20th_Century"
}