{
  "title": "A Warrior's Path",
  "description": "Librarian Note: Alternate Cover Edition for ISBN-10: 0991127617 / ISBN-13: 9780991127610.Two millennia ago, a demon thundered into the skies of Arisa, casting down the First World. She was Suwraith, the Bringer of Sorrows. And on the same night as Her arrival, there rose about the world's great cities the Oases, a mysterious means by which Humanity lies protected and huddled against the might of the Sorrow Bringer. It is a temporary respite. Throughout the rest of Arisa, Suwraith’s Chimeras boil across the Wildness, the wide swaths of land beyond the boundaries of the few, far-flung cities, killing any unfortunates in their path and ruling all in Her name. But always She seeks more: Humanity’s utter extinction. Into this world is born Rukh Shektan, a peerless young warrior from a Caste of warriors. He is well-versed in the keen language of swords and the sacred law of the seven Castes: for each Caste is a role and a Talent given, and none may seek that to which they were not born. It is the iron-clad decree by which all cities maintain their fragile existence and to defy this law means exile and death. And Rukh has ever been faithful to the teachings of his elders. But all his knowledge and devotion may not save him because soon he must join the Trials, the holy burden by which by which the cities of Humanity maintain their slender connection with one another, and the only means by which a warrior can prove his worth. There in the Wildness, Rukh will struggle to survive as he engages in the never-ending war with the Chimeras, but he will also discover a challenge to all he has held to be true and risk losing all he holds dear. And it will come in the guise of one of Humanity’s greatest enemies – perhaps its greatest allies. Worse, he will learn of Suwraith’s plans. The Sorrow Bringer has dread intentions for his home. The city of Ashoka is to be razed and her people slaughtered.",
  "genres": [
    "Fantasy",
    "Audiobook",
    "Epic Fantasy",
    "Fiction",
    "Science Fiction Fantasy",
    "Magic",
    "High Fantasy"
  ],
  "author": "Davis Ashura",
  "average_rating": "4.06",
  "url": "https://www.goodreads.com/book/show/29337219-a-warrior-s-path"
}