{
  "title": "Strangers and Pilgrims",
  "description": "Sewn signatures, printed on 130gsm acid-free paper, and bound by Bath Press in grey wibalin cloth stamped in gold, with a silk ribbon marker and head and tailbands. 500 copies. Contents: Introduction, A:B:O., The Moon's Miracle, The Riddle, The Giant, The Quincunx, The Pear-Tree, The Bird of Travel, Seaton's Aunt, The Vats, Promise at Dusk, The Creatures, Miss Jemima, The Looking-Glass, Out of the Deep, Winter, The Green Room, The Scarecrow, Alice's Godmother, Mr Kempe, A Recluse, All Hallows, The Game At Cards, Crewe, The House, 'What Dreams May Come', Strangers and Pilgrims, A Revenant, The Guardian, An Anniversary, Music, Bad Company, Bibliographical Information.'Walter de la Mare's stories have a claim to be the most subtle and strangely powerful depictions of the supernatural in English fiction of the twentieth century.' So says Mark Valentine in his introduction to these thirty-one uncanny tales. Amongst this selection are some of the best known of de la Mare's stories: 'Seaton's Aunt', 'Out of the Deep', 'All Hallows', and also some of the more obscure: 'Miss Jemima', 'A Game at Cards', Alice's Godmother'. All illustrate the writer's enigmatic relationship with alternative layers of existence and a sense of the unknown, conveyed in beautifully restrained prose. There are few overt exterior forces encountered; de la Mare's characters 'do not have to face monstrosities of any sort: but they are haunted nevertheless; by loneliness, by lovelessness, by loss.' This concentration on 'queerness and quiet tragedy' is tempered by the writer's poetic powers of description, particularly his depiction of the English countryside. Strangers and Pilgrims is the definitive collection of de la Mare's supernatural and psychological stories.",
  "genres": [
    "Horror",
    "20th Century",
    "Weird Fiction",
    "Fiction"
  ],
  "author": "Walter de la Mare",
  "average_rating": "4.68",
  "url": "https://www.goodreads.com/book/show/2933081-strangers-and-pilgrims"
}