{
  "title": "Buffy the Vampire Slayer: Dark Congress",
  "description": "Since the beginning of time, the demonic races have gathered every century to resolve conflicts among them and to determine the course of their future. This centennial event was called the Dark Congress.In the second century b.c., however, the Dark Congress failed to resolve their conflicts. Instead, the Congress ignited into a war that drove wedges between the various demon races from that time until now. And all of it began as a result of Kandida, the great North African river demon, being nearly killed by forces in the Congress and magically entombed in the riverbank.But now, Kandida is free, and for the first time in centuries, the Dark Congress is being called again. All demon races and other varieties of supernatural creatures have been called to gather at the Hellmouth in Providence, Rhode Island. Some gather in hopes of resolution, some in favor of war, and Kandida is tasked to broker a treaty and guide the Congress to peace, wherein everyone might simply agree to disagree. And so the demons gather under a banner of a truce.But the demons still harbor many bitter disagreements with one another. The Congress must have an arbiter of these conflicts, and that someone is Buffy Summers.Buffy is horrified and disgusted to be included. After all, she is not a demon...is she? She knows so little about her powers that she cannot say for certain where they truly spring from. How can she spend so much time wallowing in the darkness without becoming part of it? Can she possibly agree to a truce with all the horrors of the world, and allow them to come Providence without any attempt to stop them? And does she have a choice?",
  "genres": [
    "Buffy The Vampire Slayer",
    "Fantasy",
    "Vampires",
    "Fiction",
    "Supernatural",
    "Urban Fantasy",
    "Media Tie In"
  ],
  "author": "Christopher Golden",
  "average_rating": "4.10",
  "url": "https://www.goodreads.com/book/show/293361.Buffy_the_Vampire_Slayer"
}