{
  "title": "Rabbed!",
  "description": "Rabbed! That’s what they jokingly termed it when Rab and his gang preyed on the weaker lads in the prison and used them for rough and violent sex. Ten Years later, this horny big stud is a reformed married man, but he still has a temper that can easily flare up. The telephone engineers experience it when they turn up late for a job, and one of them had the audacity to give Rab some cheek. Rab let’s loose, but he’s taken by surprise when the guy fights back with martial arts skill. Its the start of a train of event that will see Rab bound to the bed, and all the horrors that he used to inflict when in prison, now come back to haunt him.“So who is getting Rabbed today?”“Well that would be you, Mr. McAlister! You and your cherry ass!”Extract“But you did fuck them,” Barry persisted as he joined Rab on the bed, sitting on the edge and grinning down at the big hunk who looked so sexy with his spent cock softening slightly and his face smeared with his own cum. “Don’t say you didn’t. A horny big bully like you, of course you fucked some of the weaker ones. You and a few other bruisers, pinning some smaller lad down, taking it in turns – that’s how you described it. You’ve had your share of men, I bet.”Rab continued to glare, annoyed at the awful truth that was being presented.“Yeah, you’ve fucked plenty of men, haven’t you, Rab! I’m not the first bloke you’ve fired a load of spunk into... not by a long, long, chalk. But did any of them ever enjoy it like I did? And I did enjoy it, Rab... you might not want to own up to how good it was, but I seriously enjoyed sucking you off.”Rab threw him more daggers, refusing to comment.“Did you ever try to please them, Rab? Or did you just hump them hard and make them suffer? I suppose that made it all right – taking without giving.”Rab burned him with his eyes. How did this man know him so well? Everything he said was spot on the mark.“How did it make you feel, Rab? That sense of power – taking another person in violence – another man.”Rab wasn’t enjoying this in the slightest – it was like the Englishman was looking into his soul and all his darkest secrets were getting dragged out into the light. It reminded him of those horrendous days when as a child he was forced to go to confession – a Catholic upbringing based on guilt and instilling so much repression. Only in the jail, paying for his crime, did he find some momentary relief. Now the freedom he’d known in a place of confinement was being cruelly used against him - the sin coming back like the prodigal son to taunt and haunt him.“Few people ever get to experience that,” Barry continued, prodding at the raw nerve he knew he had found. “Of course some blokes do it to their women, smack them about then fuck them. But that’s not you, is it Rab? You were brought up to show more respect – only weak men slap women about.”Rab felt like he was caught in the glare of Barry’s words. He wanted to deny them but had no power to speak. All he could do was lie in impotent silence as the cocky bastard delivered verbal blow after blow.“Sex and violence – it’s a potent mix. God, it must have given you such a rush. And it was socially acceptable in the jail – all you were doing was satisfying a need – fucking a piece of meat. Without any women at your disposal, that would have made it okay. You could ride a bloke and not be gay. And not only that...",
  "genres": [
    "BDSM",
    "Romance",
    "Erotica",
    "M M Romance",
    "Short Stories"
  ],
  "author": "Jack Brighton",
  "average_rating": "3.22",
  "url": "https://www.goodreads.com/book/show/11828877-rabbed"
}