{
  "title": "Sea Dragon",
  "description": "A blind dragon who just wants to be left alone…Sir Hrardorr was once the mightiest of fighters. Now he’s blind and useless. His knight is dead and he can’t even go into proper mourning because he needs help just to get around. Part sea dragon, he decides to go to the Southern Lair to rusticate by the coast. He can fly out over the open water and dive into the sea, where he still has at least some ability to hunt on his own. He doesn’t expect to meet a human woman out on the water, fishing in her small sailboat, but he does, and unexpectedly, they become friends.A young man who gave up the sword to help the Lair’s healer…Seth grew up in the Lair and has long had a crush on the most beautiful girl in the town, Livia. But she is the famous sea captain’s daughter, and far, far above him. It’d be one thing if he was a knight or at least a candidate to be one, but Seth gave up all dreams of knighthood when he chose to apprentice himself to the Lair’s elderly healer—the closest thing to a grandmother he’d ever had. His gentle heart has changed the course of his entire life and he’s not sure it’s for the better, but he sees no other option.A newly made knight who doesn’t know how to be one…Sir Gowan is a warrior. He was a teacher of fighting when he caught the dragoness’s eye and she chose him as her new knight. Genlitha is a stubborn female and though Gowan tried to refuse, he found he could not turn down the magnificent dragoness, even though he knows nothing about being a knight. They have come to the Southern Lair so Genlitha can teach young fliers how to best navigate the tricky winds off the ocean, and to gain time for Gowan to learn how to be her proper partner.Three humans. Two dragons. Attraction that cannot be denied…Both Seth and Gowan are drawn to the lovely Livia, and Genlitha finds the attraction she had for Hrardorr when they were still both dragonets has only grown stronger over the years, but there are obstacles. Hrardorr has sworn to never choose another knight. Seth has sworn to be a healer, even though it’s not his true calling. Gowan is just trying to figure out how to survive in this new world of knights and dragons.And then they are attacked from the sea by a mighty fleet with dragon-killing weapons, and the town and Lair find themselves totally unprepared to fight. It will be up to the five of them to save the town…if they can. It seems impossible, but they have to at least try.",
  "genres": [
    "Dragons",
    "Fantasy",
    "Romance",
    "Paranormal",
    "Menage",
    "Paranormal Romance",
    "Erotica"
  ],
  "author": "Bianca D'Arc",
  "average_rating": "4.30",
  "url": "https://www.goodreads.com/book/show/29345864-sea-dragon"
}