{
  "title": "Depression, Anxiety, and the Brain in Your Gut: How Thought, Emotion and Behavior Work and How to Get Back to Normal",
  "description": "Alternate cover for this ASIN B01C4VW77G can be found here: Depression, Anxiety, and the Brain in Your Gut: How Thought, Emotion and Behavior Work and How to Get Back to NormalThis New Mental Health Standard Defines Normal, Eliminates Labels and Measures Outcomes Most people are stunned when informed there is not a definition for normal in mental health. This absence of a definition leaves the client subject to labeling via diagnosis, getting drug through the junk yard of their past, and caught in a perpetual cycle of therapy and medication without any measurable outcomes. All of this leads to being unnecessarily stigmatized. When normal is defined a clear objective can be established, outcomes can be measured and diagnosis and labeling are no longer necessary. All of this leads to a higher level of scrutiny of the practitioner and begins the elimination of stigma. The complete elimination of stigma is done simply by being honest about the term used when seeking treatment. People seek out psychologists and psychiatrists because they want to change the way they feel not because they are mentally ill and by definition a thought process cannot be an illness or disease. Therefore, changing mental health and mental illness to Emotional Wellness brings integrity and a sense of focus to what is now called mental health.With over 100 medical references the Burris Process represents a scientific breakthrough in Emotional, Spiritual and Mental Health and it does this without a diagnosis, personal history or meds.Regardless of whether you suffer from depression, PTSD, addiction, substance abuse, alcoholism, bipolar disorder, ADHD, an eating disorder or simply want to be successful with a diet, fitness and weight loss or weight maintenance program, you must have tools which will enable you to take control of how you feel every day.•\tLearn How to Define Normal and How to Get and Keep Yourself within a Normal Range •\tLearn How Thought, Emotion and Behavior Work and How to Take Control•\tLearn How Motivation Works and How to Stay Up, On Centered and Focused •\tLearn Why the Term Mental Illness Must Be Changed to Emotional Wellness •\tLearn Why Emotional and Gut Health Measurement is Imperative for Optimum Emotional, Spiritual and Mental Health •\tLearn to Distinguish Between a Psychological and Physiological issueYour Normal•\tEmotional Measurement™ Gives You a Personal Yardstick to Calibrate Normal •\tYour Normal is When You Judge for Yourself That Your Emotional State is Under Control •\tThis Personal Yardstick Means You Can Accurately Record Improvements The Brain in Your Gut With over 500 million neurons (brain cells) in the gut and bidirectional communication with the brain via the vagus nerve gut health must not only be considered in Emotional Wellness (mental health) but must also be measured.  In Chapter 6 and 7 we examine the latest in gut health and present how to know if you are suffering from a psychological issue, physiological issue or both.  We take a close look at the effect the gut has on everything from the central nervous system to emotion and behavior and how to correct it for the ultimate personal transformation.",
  "genres": [
    "Nonfiction",
    "Health"
  ],
  "author": "Kelly Burris",
  "average_rating": "4.29",
  "url": "https://www.goodreads.com/book/show/29341167-depression-anxiety-and-the-brain-in-your-gut"
}