{
  "title": "Blood Oath",
  "description": "Outlander meets post-Civil War unrest in this nonstop sequel to Sawbones.Laura Elliston and William Kindle are on the run -- from the Army and from every miscreant in the West eager to claim the $500 bounty for Laura's capture as their own. But the danger isn't just from those pursuing them. Laura and Kindle have demons of their own and a past that won't stay dead. Exhausted, scared, scarred and surrounded by enemies, neither realize the greatest danger is yet to come.\"Packs a big punch with grit and raw passion. There is mystery, murder, Indians, bounty hunters and intrigue. The women are brave, intelligent and don't take crap from anyone. Lenhardt is a talented, creative writer; she has a grand slam out of the park with Sawbones.\" -- RT Book Reviews (Top Pick!) 4.5 stars\"Raw, gritty and sometimes graphic, Melissa Lenhardt has crafted a page-turner. In Sawbones, the women are smart, brave and at times 'incorrigible.' The plot twists, unique characters and intriguing story of passion and betrayal make this a book well worth discovering.\"\t-- Jane Kirkpatrick, New York Times bestselling author of A Light in the Wilderness\"Absolutely loved it! I couldn't tear myself away from Sawbones. An epic story of love and courage that sweeps from east to west, Sawbones will rip right through you.\" - Marci Jefferson, author of Girl on the Golden Coin\"You will fall in love with Catherine, as I did, as she struggles to assert herself in a violent and treacherous world, fighting not only prejudice but evil.\"-- Sandra Dallas, New York Times bestselling author\"Sawbones is a thoroughly original, smart and satisfying hybrid, perhaps a new the feminist Western.\" -- Lone Star Literary LifeLaura Elliston novelsSawbonesBlood Oath Badlands",
  "genres": [
    "Historical Fiction",
    "Westerns",
    "Historical",
    "Romance",
    "Fiction",
    "Audiobook",
    "19th Century"
  ],
  "author": "Melissa Lenhardt",
  "average_rating": "3.93",
  "url": "https://www.goodreads.com/book/show/29349315-blood-oath"
}