{
  "title": "Called Home",
  "description": "The national bestselling author of the Orchard Mysteries presents this short prequel that started Meg Corey's mysterious adventures on the apple orchard in the small town of Granford, Massachusetts.Out of a job and living alone in a drafty Colonial house, Meg Corey is supposed to be fixing the house up to sell, but now she's got the flu and she's freezing and she feels very sorry for herself. Then Deborah Warren shows up to distract her—but is Deborah a ghost, or just the product of Meg's feverish imagination?Choosing to believe that Deborah really is a ghost, Meg sets out to discover the truth of why she's been around for 200 years when all she wants is to go home.About the collecting too many degrees and exploring careers ranging from art historian to investment banker to professional genealogist, Sheila Connolly began writing mysteries in 2001, and is now a full-time writer. She wrote her first mystery series for Berkley Prime Crime under the name Sarah Atwell, and the first book, Through a Glass, Deadly (March 2008), was nominated for an Agatha Award for Best First Novel; Pane of Death followed in November 2008, and Snake in the Glass in September 2009. Under her own name, her Orchard Mystery Series (Berkley Prime Crime) debuted in 2008 with One Bad Apple, followed by Rotten to the Core in July 2009, Red Delicious Death in March 2010, A Killer Crop in December 2010, and Bitter Harvest in August 2011.Her new series, the Museum Mysteries (Berkley Prime Crime), set in the Philadelphia museum community, opened with Fundraising the Dead in October 2010, followed by Let's Play Dead in July 2011.She is currently planning a new series set in Ireland, which will debut in 2012/13.Her first short story, \"Size Matters,\" was published by Level Best Books in 2011, and was nominated for an Agatha Award.Sheila is a member of Sisters in Crime, Mystery Writers of American and Romance Writers of America. She is currently President of Sisters in Crime New England, and cochair for the 2011 New England Crime Bake conference.",
  "genres": [
    "Mystery",
    "Cozy Mystery",
    "Fiction",
    "Cozy",
    "Adult",
    "Paranormal",
    "Short Stories"
  ],
  "author": "Sheila Connolly",
  "average_rating": "3.72",
  "url": "https://www.goodreads.com/book/show/11828637-called-home"
}