{
  "title": "The Black Widow",
  "description": "‘Allon is the 21st century Bond’ Daily MailNo. 1 New York Times bestselling author Daniel Silva delivers another stunning thriller in his latest tale of high-stakes international intrigue featuring the inimitable Gabriel Allon.Legendary spy and art restorer Gabriel Allon is poised to become the chief of Israel’s secret intelligence service. But on the eve of his promotion, events conspire to lure him into the field for one final operation. ISIS has detonated a massive bomb in the Marais district of Paris, and a desperate French government wants Gabriel to eliminate the man responsible before he can strike again.They call him Saladin …He is a terrorist mastermind whose ambition is as grandiose as his nom de guerre, a man so elusive that even his nationality is not known. Shielded by sophisticated encryption software, his network communicates in total secrecy, leaving the West blind to his planning – and leaving Gabriel no choice but to insert an agent into the most dangerous terrorist group the world has ever known. She is an extraordinary young doctor as brave as she is beautiful. At Gabriel’s behest, she will pose as an ISIS recruit in waiting, a ticking time bomb, a black widow out for blood.Praise for Daniel ‘It is Silva’s creative genius that keeps it all moving, as well as his mastery of storytelling that keeps the intense momentum of the plot ever pushing forward’ Huffington Post'Sexily brooding Allon… must be the most famous superspy not played by Daniel Craig' Daily Telegraph‘Fascinating, suspenseful, and bated-breath exciting’ Publishers Weekly‘A fitting final mission for one of fiction’s greatest spies… A dark thriller for difficult times’ Kirkus Review‘A truly talented writer’ Sun‘elegantly paced, subtle and well-informed.’ Daily Mail‘Silva builds tension with breathtaking double and triple turns of the plot’ People‘A world class practitioner of spy fiction’ Washington Post‘Silva is a master of suspense’ Barbara Taylor Bradford, The Week",
  "genres": [
    "Fiction",
    "Thriller",
    "Mystery",
    "Espionage",
    "Mystery Thriller",
    "Suspense",
    "Audiobook"
  ],
  "author": "Daniel Silva",
  "average_rating": "4.33",
  "url": "https://www.goodreads.com/book/show/29346387-the-black-widow"
}