{
  "title": "The Voyage of the Star Wolf",
  "description": "Who will keep the starways safe when bioengineered superhumans make war on the human race? Executive Officer Jonathan Thomas Korie and the crew of Alliance Liberty Ship LS-1187 made the mistake of surviving an ambush by the Morthan Solidarity. The attack had come without warning., devastating the Alliance fleet. For although Alliance technology was more advanced, the Morthans—a Militaristic culture of bioengineered superhumans—were master strategists, and destroyers like their Dragon Lord were equipped with more firepower than any Alliance vessel.  His captain dead, his ship barely functioning, Korie and his crew slowly made their way home, But the Alliance needed a scapegoat on which to blame the disaster and the LS-1187 filled the bill. Instead of being hailed as heroes, they were treated as Jonahs.  Consigned to drydock for repairs, the LS-1187 and its crew seemed to have been conveniently forgotten by top Alliance officials. Then Captain Hardesty came aboard and everything changed.  Hardesty's reputation as the toughest, most terrifying warhorse in the military was an understatement. Still, he and his new senior officers—including a Morthan Tyger, who Korie could only hope was loyal to the Alliance—might prove just what the LS-1187 needed. For Hardesty's only interest was in turning a wreck back into a functioning warship manned by a crew capable of performing at his inhumanly high standards.  As executive Officer, Korie became Hardesty's main target, a situation which made him feel that if he could survive Hardesty he could survive anything. The Alliance—and the Morthans—would soon give him the opportunity to find out if he was right. —From the dust jacket flaps",
  "genres": [
    "Science Fiction",
    "Fiction",
    "Space Opera",
    "Military Fiction",
    "Military Science Fiction",
    "Science Fiction Fantasy",
    "War"
  ],
  "author": "David Gerrold",
  "average_rating": "3.86",
  "url": "https://www.goodreads.com/book/show/293417.The_Voyage_of_the_Star_Wolf"
}