{
  "title": "Dark Planet Warriors: Taken",
  "description": "Abbey  So I wake up and find myself on a Military Space Station, just off Kythia, the home planet of the Kordolians. General Tarak wants me to stay put, but there’s no way I’m sitting around in his claustrophobic quarters. I need to be looking for a way to get back home. Fortuna Tau is being overrun by disgusting, oversized insects, and I’m stuck here, at the other end of the universe. On the upside, at least my injuries are healed. The General is being a big, arrogant jerk. He won’t tell me anything. He’s walking around his quarters half-dressed, unaware that his bare, sculpted torso is a bit too distracting. And the food on this station leaves a lot to be desired. Kordolians obviously haven’t discovered the glory of nachos yet. At this rate I don’t know if I’ll ever get to taste chocolate again. When I ask when he’s going to take me back, he gets evasive. I don’t like that. So when he has to leave me alone to attend to some official business, I decide to explore. Sneaking around this huge, floating station, I soon realize that not all Kordolians are as, uh, friendly as the General. To some of them, I’m nothing more than a giant, walking lab rat. I really have to find a way to get back home. Before I end up on a dissection table.  Tarak  To my relief, the nanograft is a success. The female has healed, and she’s probably even physically stronger than before. It’s too bad the High Council have been informed of her presence. Apparently, Humans are reproductively compatible with our species. They want her. They demand I hand her over. Absolutely not. She’s mine. The infernal High Council can go rot in one of Kaiin’s hells, for all I care. When I return to the Fleet Station, I find she hasn’t obeyed my orders. I told her to stay in my quarters. Stubborn female. I need to find her before those idiotic scientists get to her. And if any Kordolian dares to harm her, they will answer to me.  Dark Planet Warriors is a 3-book serial. Each book is an episode of Abbey and Tarak's story, just like a TV series. A new installment will be released every few weeks.  Books in series: Book one: InvasionBook two: TakenBook three: Escape Due to violence, swearing and steamy sex scenes, these books are recommended for readers aged 18 years and over.",
  "genres": [
    "Aliens"
  ],
  "author": "Anna Carven",
  "average_rating": "4.03",
  "url": "https://www.goodreads.com/book/show/29354606-dark-planet-warriors"
}