{
  "title": "Into His Command",
  "description": "The Cimarron Series books can be read as stand-alones, though some readers might enjoy the continuity of secondary characters by reading the series in order. Every novel in the series is a complete story with a happy ending. Into His Command is Book 2 of the series.It's here! Book 2 of Angel Payne's sensual series, highly anticipated by reviewers and readers alike, is the emotional, unforgettable story of Samsyn Cimarron and Brooke Valen...A hero worshipped.Brooke Valen has resigned herself to a life of adoring Samsyn Cimarron from afar. The massive warrior has been her knight in shining armor since the night her family arrived on the island of Arcadia, forced to blend into the strange new land to avoid a terrorist’s bounty. Though Brooke has grown into a woman and devoted herself to earning Syn’s respect, she doubts he’ll ever see her as anything more than a scrawny teen with stars in her eyes.A prince scarred.To Samsyn Cimarron, true love is a concept best left to story books. Syn likes things he can control better, like the secrets he must keep to ensure his country’s security—and a long string of one-night lovers. But when Brooke is wounded helping to defend the kingdom, all his careful mandates are shattered—and fleeting passion with her doesn’t feel like enough. Brooke affects him like no other lover…A fate sealed.Suddenly, Arcadia’s security hinges on Samsyn and Brooke uniting as more than “friends with benefits”—much to Syn’s conflict. Can he fight the new sensations that come with having her all to himself? There’s a dark side of his desire—and exposing it may turn Brooke from him forever.A love realized?Though sharing a bed with the man of her dreams, Brooke has never felt more alone. Is the love in her soul strong enough to reach the beast in Syn’s, or will she have to prove her devotion by confronting Arcadia’s most vile enemy?",
  "genres": [
    "Romance",
    "Erotica"
  ],
  "author": "Angel Payne",
  "average_rating": "4.44",
  "url": "https://www.goodreads.com/book/show/29352685-into-his-command"
}