{
  "title": "The Man Who Knew: The Life and Times of Alan Greenspan",
  "description": "The definitive biography of the most important economic statesman of our time Sebastian Mallaby's magisterial biography of Alan Greenspan, the product of over five years of research based on untrammeled access to his subject and his closest professional and personal intimates, brings into vivid focus the mysterious point where the government and the economy meet. To understand Greenspan's story is to see the economic and political landscape of the last 30 years--and the presidency from Reagan to George W. Bush--in a whole new light. As the most influential economic statesman of his age, Greenspan spent a lifetime grappling with a momentous shift: the transformation of finance from the fixed and regulated system of the post-war era to the free-for-all of the past quarter century. The story of Greenspan is also the story of the making of modern finance, for good and for ill.  Greenspan's life is a quintessential American success story: raised by a single mother in the Jewish émigré community of Washington Heights, he was a math prodigy who found a niche as a stats-crunching consultant. A master at explaining the economic weather to captains of industry, he translated that skill into advising Richard Nixon in his 1968 campaign. This led to a perch on the White House Council of Economic Advisers, and then to a dazzling array of business and government roles, from which the path to the Fed was relatively clear. A fire-breathing libertarian and disciple of Ayn Rand in his youth who once called the Fed's creation a historic mistake, Mallaby shows how Greenspan reinvented himself as a pragmatist once in power. In his analysis, and in his core mission of keeping inflation in check, he was a maestro indeed, and hailed as such. At his retirement in 2006, he was lauded as the age's necessary man, the veritable God in the machine, the global economy's avatar. His memoirs sold for record sums to publishers around the world. But then came 2008. Mallaby's story lands with both feet on the great crash which did so much to damage Alan Greenspan's reputation. Mallaby argues that the conventional wisdom is off base: Greenspan wasn't a naïve ideologue who believed greater regulation was unnecessary. He had pressed for greater regulation of some key areas of finance over the years, and had gotten nowhere. To argue that he didn't know the risks in irrational markets is to miss the point. He knew more than almost anyone; the question is why he didn't act, and whether anyone else could or would have. A close reading of Greenspan's life provides fascinating answers to these questions, answers whose lessons we would do well to heed. Because perhaps Mallaby's greatest lesson is that economic statesmanship, like political statesmanship, is the art of the possible. The Man Who Knew is a searching reckoning with what exactly comprised the art, and the possible, in the career of Alan Greenspan.",
  "genres": [
    "Biography",
    "Economics",
    "Finance",
    "Business",
    "Nonfiction",
    "History",
    "Biography Memoir"
  ],
  "author": "Sebastian Mallaby",
  "average_rating": "4.32",
  "url": "https://www.goodreads.com/book/show/29358555-the-man-who-knew"
}