{
  "title": "YO, EL TITIRITERO DE MIS ESTADOS DE ÁNIMO: Tomando el control de mis emociones",
  "description": "Estás con tu pareja o un amigo, y ante la primer opinión que emite, con la que no estás de acuerdo, sientes que “se te sube la sangre hasta la cabeza”. Piensas: “Hay mucha gente que está equivocada y YO tengo la razón”. Cualquier evento o discusión afecta tus estados de ánimo. Te dejas llevar por sentimientos de rabia, dolor y frustración… reaccionando de una manera que no te hace bien. Pareciera que llevas una bestia dentro, y esto te trae tristeza, porque parece que tus estados de ánimo son los que de cierta forma dirigen tu vida, puesto que dependes de elementos externos para estar bien. Sucede que nunca antes nos han enseñado a llevar el control sobre uno mismo. En este libro puedes conocer la forma de no dejarte dominar por tus emociones. Muchas veces ni nos damos cuenta que podemos hacer algo al respecto. Que el mancharte la ropa, que alguien te diga algo desagradable, o si tuviste alguna equivocación; no sean estas mínimas situaciones las que determinen tu humor y tu día.  Se lee muchas veces: “deja de lado tu ego”, “atrae energía positiva”. Pero en realidad es difícil comprender y peor aún el saber cómo exactamente podemos ponerlo en práctica en nuestra cotidianidad. Gracias a la búsqueda espiritual de la autora, su encuentro con la actuación, el teatro y diversas disciplinas corporales como el Yoga y el Qi qong (chi qong), ha podido experimentar la forma de apaciguar los estados de molestia, ira y preocupación tanto para poder interpretar en la escena (teatral), como para traer calma a su vida cotidiana y hacer de cada momento una experiencia para disfrutar, evitando que pequeños o grandes enojos sean los que determinen los momentos o sus días. Al seguir las primicias que se desarrollan en este libro puedes cambiar de perspectiva ante “los problemas” que tienes, descubrir que hay una alternativa antes de explotar, puedes decidir hacer de tu día (o tu vida) un(a) día (vida) de preocupación y tristeza, o un(a) día (vida) para disfrutar. Puedes obtener tiempo de donde creías que no tenías. Y es porque desperdiciamos demasiado nuestro tiempo quedándonos estancados en emociones negativas. Mucha gente se pasa la vida creyendo que vinimos a sufrir o que el sufrimiento es parte de la vida. Y sí, existen acontecimientos que nos pueden llevar a la tristeza, pero depende de uno cómo responder a cada acontecimiento. En realidad podemos ser mucho más felices de lo que creemos, a través de estas páginas puedes descubrir que existe la forma de tomar el control de lo que nos pasa en el interior para manifestarlo en el exterior. Sólo que nunca antes te lo habían contado de forma tan sencilla, tangible y puesta en práctica. En cada capítulo se desarrolla amena y concretamente como encararte a ti mismo. Que estos problemas cotidianos de insatisfacción no te persigan por años, cuando puedes hacer algo hoy al respecto.",
  "genres": [],
  "author": "Carola Urioste",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/29359300-yo-el-titiritero-de-mis-estados-de-nimo"
}