{
  "title": "The Red Bandanna: A Life. A Choice. A Legacy.",
  "description": "The inspirational story of Welles Crowther, whose decision, determination and sacrifice in the terror of 9/11 have inspired millions, and whose short life offers a lasting lesson on character, calling, and courage--in how we live, and in the legacy we choose to leave behind  When Welles Crowther was a young boy in Nyack, NY, his father gave him a red handkerchief to keep in his back pocket, in case he ever needed it. He kept it with him on the way to church that day and nearly every day after. It was a fixture as he grew up, tucked in jeans or wrapped around his head as he played lacrosse for Boston College. The bandanna was a signature, long before it became a symbol.   Welles was like a lot of us, if just a bit better - an honors student, but not the valedictorian; a Division I athlete, but not a star; kindhearted but not saintly. He wanted the stuff of a good life and was willing to work for it. Fresh from college, he came to New York City for a job on Wall Street. His office was on the 104th floor of the World Trade Center.    But Welles wasn't entirely fulfilled by his desk job. He'd grown up volunteering at the local fire department in Nyack and loved the necessity and camaraderie, the meaning of the role. And so, shortly before 9/11, he called his father to say he was thinking of quitting finance and applying to be a firefighter with the FDNY. His father, a fellow banker and volunteer firefighter, was stunned.   When the World Trade Center fell, Welles' parents, like the families of so many who were lost in the attacks, had no idea what happened to him. In the unbearable days and weeks that followed, they came to accept that he would never come home. But the mystery of his final hours lingered painfully.   Eight months after the attacks, however, Welles' mother would read another news account that would yet again change the family's lives. A survivor from the attacks, who'd been badly hurt on the 78th floor of the South Tower, said she and others had been led to safety by a stranger, carrying a woman on his back, down nearly twenty flights of stairs. When they emerged from the stairwell, firefighters took them the rest of the way out. But the young man turned around and went back up the stairs. He would make the trip up and down again and again, taking a group with him each time. The survivor never asked his name and couldn't see his face. But she remembered one detail clearly: he was wearing a red bandanna.   Welles' parents knew they'd found their son. They sent the woman a picture of Welles, and she confirmed: it was him. The story spread. Welles was honored as an FDNY fireman, the first time in its history the New York City Fire Department had named a civilian to its ranks as an officially recognized member. Year after year, first at Boston College and now around the country, there are Red Bandanna days and races to honor Welles' sacrifice. When President Barack Obama spoke at the opening of the 9/11 Museum at Ground Zero, he chose to tell the story of one life lost: Welles Crowther.    Tom Rinaldi's The Red Bandanna is about a fearless choice, about the crucible of terror and the indomitable spirit to answer it. It travels Crowther's path to purpose and the journey his family has been on in the days and years since. Examining one decision in the gravest situation, it celebrates the difference one life can make. It is the story of a new symbol for strength, and how a bandanna has become the red badge of courage for a new time.",
  "genres": [
    "Nonfiction",
    "Biography",
    "History",
    "Book Club",
    "Memoir",
    "Biography Memoir",
    "Audiobook"
  ],
  "author": "Tom Rinaldi",
  "average_rating": "4.26",
  "url": "https://www.goodreads.com/book/show/29358561-the-red-bandanna"
}