{
  "title": "Through Innocent Eyes: The Chosen Girls of the Hitler Youth",
  "description": "Landjahr Lager (Country Service Year Camp) taught the girls courage, confidence, and built their moral character in a friendly and fun atmosphere through the power of camaraderie. This elite rural educational program provided the fundamental building blocks which would stay with them the rest of their lives. Their education went beyond the traditional home economics and child rearing as we have all come to believe. Through a myriad of enriching experiences, these girls developed their interpersonal mental, physical, and spiritual skills. Their challenging assignments included thought provocative discussions, problem-solving activities, and team-building experiences, which ended in their daily prayer. By the time these girls graduated at the age of 14, they could move into their chosen vocation from agriculture, hospitality, retail, office work, or full home management and child care. They had an exact understanding of their responsibility and duties to their state and in their work place. It was a great honor to be chosen for Landjahr Lager.\"This is the most authentic book I have read about the girls in the Hitler Youth. You capture the essence in detail.\" Irmgard M. Nagengast\"To be alive today and see a book written about our time in Landjahr Lager Seidorf brings back wonderful memories.\" Eleanor (Nelly) Mohler Landjahr Madel\"What a beautiful tribute to your mother. I will always remember our time together in Landjahr as if it were yesterday.\" Steffi Pucks Landjahr Madel\"Your book gives an intimate accounting of the Hitler Youth girls as seen through a child's eyes. This book takes me right back in time.\" Ellie Musial Landjahr Madel\"",
  "genres": [
    "History",
    "Nonfiction",
    "World War II",
    "Germany",
    "Memoir",
    "European History",
    "Holocaust"
  ],
  "author": "Cynthia A. Sandor",
  "average_rating": "4.39",
  "url": "https://www.goodreads.com/book/show/29354842-through-innocent-eyes"
}