{
  "title": "Peak: Unleashing Your Inner Champion Through Revolutionary Methods for Skill Acquisition and Performance Enhancement in Work, Sports, and Life",
  "description": "“This book is a breakthrough, a lyrical, powerful, science-based narrative that actually shows us how to get better (much better) at the things we care about.”—Seth Godin, author of Linchpin“Anyone who wants to get better at anything should read [Peak]. Rest assured that the book is not mere theory. Ericsson’s research focuses on the real world, and he explains in detail, with examples, how all of us can apply the principles of great performance in our work or in any other part of our lives.”—Fortune Anders Ericsson has made a career studying chess champions, violin virtuosos, star athletes, and memory mavens. Peak distills three decades of myth-shattering research into a powerful learning strategy that is fundamentally different from the way people traditionally think about acquiring new abilities. Whether you want to stand out at work, improve your athletic or musical performance, or help your child achieve academic goals, Ericsson’s revolutionary methods will show you how to improve at almost any skill that matters to you.  “The science of excellence can be divided into two before Ericsson and after Ericsson. His groundbreaking work, captured in this brilliantly useful book, provides us with a blueprint for achieving the most important and life-changing work to become a little bit better each day.”—Dan Coyle, author of The Talent Code  “Ericsson’s research has revolutionized how we think about human achievement. If everyone would take the lessons of this book to heart, it could truly change the world.”—Joshua Foer, author of Moonwalking with Einstein",
  "genres": [
    "Psychology",
    "Nonfiction",
    "Self Help",
    "Science",
    "Productivity",
    "Business",
    "Personal Development"
  ],
  "author": "K. Anders Ericsson",
  "average_rating": "4.21",
  "url": "https://www.goodreads.com/book/show/29369213-peak"
}