{
  "title": "Phantom Africa",
  "description": "One of the towering classics of twentieth century French literature, Phantom Africa is a singular and ultimately unclassifiable work: a book composed of one man’s compulsive and constantly mutating daily travel journal—by turns melodramatic, self-deprecating, ecstatic, and morose—as well as an exhaustively detailed account of the first French state-sponsored anthropological expedition to visit sub-Saharan Africa. In 1930, Michel Leiris was an aspiring poet drifting away from the orbit of the Surrealist movement in Paris when the anthropologist Marcel Griaule invited him to serve as the “secretary-archivist” for the Mission Dakar-Djibouti, a major collecting and ethnographic journey that traversed the African continent between May 1931 and February 1933. Leiris, while maintaining the official records of the Mission, documenting the team’s acquisitions, and participating in the research, also kept a diary where he noted not only a given day’s activities and events but also his impressions, his states of mind, his anxieties, his dreams, and even his erotic fantasies. Upon returning to France, rather than compiling a more conventional report or ethnographic study, Leiris decided simply to publish his diary, almost entirely untouched aside from minor corrections and a smattering of footnotes. The result is an extraordinary book: a day-by-day record of one European writer’s experiences in an Africa inexorably shaded by his own exotic delusions and expectations, on the one hand, and an unparalleled depiction of the paradoxes and hypocrisies of conducting anthropological field research at the height of the colonial era on the other. Never before available in English translation, Phantom Africa is an invaluable document. If the book is “a stone marking a bend on a path that is entirely personal,” as Leiris himself described it years later, it is also a book whose broad canvas bears witness to the full range of social and political forces reshaping the African continent in the period between the World Wars.",
  "genres": [
    "Anthropology",
    "Africa",
    "France",
    "Travel",
    "Ethnography",
    "History",
    "Social Science"
  ],
  "author": "Michel Leiris",
  "average_rating": "3.62",
  "url": "https://www.goodreads.com/book/show/29362546-phantom-africa"
}