{
  "title": "Forged of Fire",
  "description": "This book contains extreme graphic content and is not intended for readers under 18. Please be advised. Reader's discretion is advised.Ash LaGoryen was the second son, born of nobility into the Ushum bloodline- House of the Dragon in the year 776. History claims in every generation a child of royal blood is born to the four elemental houses possessing “The Gift” - an ability to bend their chosen element. Ash was this child and fire was his gift. But...Possessing such a skill was a dangerous thing and fate had other plans for the young boy of only seven summers...Present dayAsh has spent the last twelve hundred years staying under the radar of the monster that ransacked his homelands as a boy and later, after years of torture, turned him into the thing he hated most. A Vampire... The polished gentleman that stands before Ash in the mirror now, conducts his business during daylight hours and enjoys his lush, reclusive life as one of the worlds wealthiest empire moguls.Vastly different from the young immortal that escaped the pits of Hell all those years ago, Ash has zero interest of returning to the station of his royal birth. But, when an ancient prophecy comes to light he finds himself being dragged right back into the world of his ancestral bloodline. When the foretold \"Chosen One\" with the power to unite the realms, turns out to be a beautiful young mortal, Ash is faced with a whole new set of challenges as an impending war looms around them. He will have to weigh his choices carefully as the demons of his past rise up to threaten his future.Forged of Fire takes us on a hypnotic journey that challenges our deepest beliefs. What exactly defines our notions of Heaven and Hell and what separates folklore from reality? A masterful adventure where, Angels, Vampires, Elemental-benders and Dragons spin a world full of mystery, intrigue, dark fantasy and romance.",
  "genres": [
    "Fantasy",
    "Paranormal",
    "Dragons",
    "Romance",
    "Vampires",
    "Magic",
    "Fantasy Romance"
  ],
  "author": "Stacy Von Haegert",
  "average_rating": "4.05",
  "url": "https://www.goodreads.com/book/show/29371179-forged-of-fire"
}