{
  "title": "Friday Night Brides",
  "description": "Four women. Twenty years. Five hundred bridal fashion shows.They’ve been friends since they were five, and modeling for Enchanted Bridal has been as much of a part of their lives as their friendship has. And this season has them seeing more than new wedding trends.Hailey’s family owns Enchanted Bridal and she knows there’s a possibility that someday it will be hers. She’s not sure that’s the path she wants to take, but she does know that she’s been hopelessly crushing on the perfect man and bridal show model Logan Baxter III. While failing to gain Logan’s attention, she can’t seem to get rid of the less-than-perfect man – and model – Jackson Carr. He’s big and bold and tattooed – pretty much everything Hailey despises. And yet…there’s something about him that has Hailey questioning her definition of perfect.Becca’s got a knack for dating the wrong kind of guys. When her current boyfriend publicly dumps and humiliates her, she’s devastated. Wanting to run and hide, she’s mortified that the stranger who had witnessed the entire scene is now part of the Enchanted Bridal family. But when Max Abrams offers her comfort and tells her that he thinks she’s beautiful, she has to wonder if maybe getting dumped by Mr. Wrong has finally led her to her very own Mr. Right.Angie’s loud and feisty and completely fearless. That is until she gets dumped by the one guy she really had feeling for. It opens her up to insecurities she didn’t know she had and she’s not sure what to do about it. But when Sean Patterson comes back into her life in a big way, she’s not sure she’s ready to forgive and forget quite so easily. His persistence and her stubbornness make for an exciting chase, however, but at the end of the season, it’s ultimately up to her if she’s ready to quit running.Ella’s been planning her perfect wedding to Dylan Graham since she was twelve. Together for thirteen years, Ella’s beginning to wonder if that number really is bad luck. She can’t focus on all that’s right in her life because all she can think about is what she may be missing. Their parents have taken over their wedding, her friends all seem to be in crisis and Dylan’s just not listening to her fears. Not one to ever make waves, she suddenly finds that that’s exactly what she’s doing and turning everyone’s life upside down in the process. The life that she once considered boring is now the one she longs for, but it may be too late. Four friends.Four crossroads.Four possibilities for happily ever after.",
  "genres": [
    "Romance",
    "Contemporary",
    "Contemporary Romance",
    "Audiobook",
    "Chick Lit",
    "Fiction",
    "Adult"
  ],
  "author": "Samantha Chase",
  "average_rating": "3.91",
  "url": "https://www.goodreads.com/book/show/29366677-friday-night-brides"
}