{
  "title": "The Black Muldoon",
  "description": "\"Brand practices his art to something like perfection.\" --The New York Times \"Max Brand is the Shakespeare of the Western range.\" --Kirkus ReviewsIn \"When Iron Turns to Gold,\" the sequel to Brand's novel Iron Dust, a pardon exonerates Andrew Lanning of any crime he may have committed during his time as an outlaw. Marshal Hal Dozier, instrumental in obtaining that pardon, has urged Andy to return to Martindale and his former life there as a blacksmith. However, the residents of Martindale will not accept Andy back, fearing that he'll break the law again. To make things worse, Larry la Roche and the members of the Allister gang are prepared to commit a bold robbery in Martindale and frame Andy for the crime if he refuses to rejoin them.Jimmy Bristol is the titular character in \"The Two-Handed Man,\" with a reputation of being able to fire a six-gun accurately using either hand. Bristol is on the dodge when he stops briefly at the Graney Ranch to rest his horse. There, he meets Joe Graney and his daughter, Margaret, who tell Bristol about the thefts they have suffered at the hands of Dirk van Wey and his gang. Despite being pursued by the law himself, Bristol decides he will take a hand against van Wey.On a stormy night in \"The Black Muldoon,\" a notorious outlaw shows up at the home of the storekeeper, Jefferson Peters. The Black Muldoon has a strange cargo, an infant boy whom he wants to leave with Peters so that he can be raised by Peters and his wife as their son. As young Jerry Peters grows up, he turns out to be exceptional at everything he tries, and as an adult manhunter, it is Jerry who takes to the trail to capture the Black Muldoon.Skyhorse Publishing is proud to publish a broad range of books for readers interested in fiction that takes place in the old West. Westerns--books about outlaws, sheriffs, chiefs and warriors, cowboys and Indians--are a genre in which we publish regularly. Our list includes international bestselling authors like Zane Gray and Louis L'Amour, and many more. While not every title we publish becomes a New York Times bestseller or a national bestseller, we are committed to books on subjects that are sometimes overlooked and to authors whose work might not otherwise find a home.",
  "genres": [
    "Westerns"
  ],
  "author": "Max Brand",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/29368439-the-black-muldoon"
}