{
  "title": "Fair to Middling: a love story",
  "description": "about Fair to Middling...  What do a world-famous opera singer, a wealthy investment banker, a casual day-trip to an exclusive island, and a middle school soccer match have in common? These and many other people and events swirl around the rich and complex lives of a pair of young friends. Simon Fair and Robert Moorehead have been close since before they can remember. Now fourteen, they find themselves in the throes of adolescence and embroiled in the world of Meadowbrooke Middle School. Both are brilliant, Simon quite exceptionally so; musical, with Simon again far in the lead although some surprises await both; athletic, Simon on the swim team and Robbie the soccer team; and popular, especially with Sarah Fennimore and her best friend, Nevia Joyce. Surrounded by a close group of friends at school they have also become the unwitting targets of a trio of troublemakers: Mark, Chip, and Bo. Surprising changes take place though for each of these three, particularly the big, muscular Bo, and unlikely friendships develop. Simon and Robbie also make unexpected new friends in other places, Robbie in the hospital after an accident and Simon at the music conservatory where he studies piano. Like most adolescents, Simon and Robbie have been experimenting a bit with sex but it is becoming evident that it means something different for one of them. Their incredible, primordial closeness astonishes everyone who witnesses it, from their parents to their friends to even the taunting threesome. Can it withstand their burgeoning sexuality especially as they are destined to follow different paths for that aspect of their lives? Is one of them gay? Are they, at their tender age, lovers? Will Bo stand up to his father and get himself out from under Mark's thumb? Will Mark learn that nice is easier and more productive than nasty? Will Chip ever experience any emotions at all? Will Simon's mother figure out why she is afraid? Will the varied and complex relationships among the faculty at Meadowbrooke develop . . . into anything?  Warning: this book contains a fair amount of explicit sex . . . and also a lot of talk about classical music. The latter may be more alarming to some readers than the former but neither should deter anyone from following these boys' emotion-packed lives.",
  "genres": [],
  "author": "Michael Scherperel",
  "average_rating": "4.05",
  "url": "https://www.goodreads.com/book/show/29364599-fair-to-middling"
}