{
  "title": "The Carnival Campaign: How the Rollicking 1840 Campaign of \"Tippecanoe and Tyler Too\" Changed Presidential Elections Forever",
  "description": "Americans have come to expect that the nation’s presidential campaigns will be characterized by a carnival atmosphere emphasizing style over substance. But this fascinating account of the pivotal 1840 election reveals how the now-unavoidable traditions of big money, big rallies, shameless self-promotion, and carefully manufactured candidate images first took root in presidential politics.Pulitzer Prize–nominated former Wall Street Journal reporter Ronald G. Shafer tells the colorful story of the election battle between sitting president Martin Van Buren, a professional Democratic politician from New York, and Whig Party upstart William Henry Harrison, a military hero who was nicknamed “Old Tippecanoe” after a battlefield where he fought and won in 1811. Shafer shows how the pivotal campaign of “Tippecanoe and Tyler Too” marked a series of firsts that changed presidential politicking the first presidential campaign as mass entertainment, directed at middle- and lower-income voters; the first “image campaign,” in which strategists painted Harrison as an everyman living in a log cabin sipping hard cider (in fact, he was born into wealth, lived in a twenty-two-room mansion, and drank only sweet cider); the first campaign in which a candidate, Harrison, traveled and delivered speeches directly to voters; the first one influenced by major campaign donations; the first in which women openly participated; and the first involving massive grassroots rallies, attended by tens of thousands and marked by elaborate fanfare, including bands, floats, a log cabin on wheels, and the world’s tallest man.Some of history’s most fascinating figures—including Susan B. Anthony, Charles Dickens, Abraham Lincoln, Edgar Allan Poe, Thaddeus Stevens, and Walt Whitman—pass through this colorful story, which is essential reading for anyone interested in learning when image first came to trump ideas in presidential politics.",
  "genres": [
    "History",
    "Politics",
    "Nonfiction",
    "American History",
    "Presidents",
    "Biography",
    "Audiobook"
  ],
  "author": "Ronald G. Shafer",
  "average_rating": "3.92",
  "url": "https://www.goodreads.com/book/show/29363021-the-carnival-campaign"
}