{
  "title": "Thirty-six Years in the White House",
  "description": "A book of recollections of a personal character that came under Mr. Pendel's attention. It is very interesting and throws many sidelights on the life of the White House.  Pendel writes: \"In 1861, or 1862, the Metropolitan Police was established by Congress at the Capital, and I made application for and received an appointment on the force. I made the first arrest, with the assistance of \"Buck\" Essex. The case was that of a fellow named Grady, one of the English Hill toughs. A roundsman said to us, \"Boys, you take a walk down Seventh Street, and if you see anything going on, take a hand in it.\" Just as we got opposite the Patent Office, this Grady had assaulted, or rather was assaulting, a young fellow with a whip. I went up and grabbed him and put him under arrest, then took him to Squire Dunn's court and preferred charges against him. The Squire was busy writing for some time. When he got through he handed me the paper he was writing, and I was so green at the business I did not know what it was, so said: \"What is this, Squire?\" He replied, \"Why, that is the paper of commitment for this fellow. Take him to jail.\"  \"On November 3, 1864, Sergeant John Cronin, Alfonso Dunn, Andrew Smith, and myself were ordered to report at the First Precinct, in the old City Hall, at one o'clock in the afternoon. We supposed we were to be detailed for detective work in New York City on account of the great riot then on there, especially as we were ordered to report in citizens' clothes, to conceal our revolvers, and to be sure to have them all clean and in good order. We arrived at the City Hall, and then were told where we were to go, which was to the President's Mansion, there to report to Marshal Lanham, at that time United States Marshal of the District of Columbia, and a bosom friend of Abraham Lincoln.  \"These were days that tried men's hearts, and women's, too. Men were falling at the front by hundreds, both in the Union and in the Confederate armies. There was weeping and mourning all over the land. Our nation was trembling with anxiety; we were all hoping that the great strife was over or soon to be.  \"Marshal Lanham took us upstairs and into the President's office, where we were introduced to him and to his two secretaries, Mr. Nicolay and Mr. Hay, the latter now being Secretary of State. We were then instructed to keep a sharp lookout in the different parts of the house, more particularly in the East Room and at the door of the President's office. \"  CONTENTS I — Under President Lincoln II — Under President Johnson III — Under President Grant IV — Under President Hayes V — Under President Garfield VI — Under President Arthur VII — Under President Cleveland VIII — Under President Harrison IX — Cleveland's Second Administration X— Under President McKinley XI — Furniture in Executive Mansion   Originally published in 1902; reformatted for the Kindle; may contain an occasional imperfections; original spellings have been kept in place.",
  "genres": [],
  "author": "Thomas Franses Pendel",
  "average_rating": "3.93",
  "url": "https://www.goodreads.com/book/show/29371983-thirty-six-years-in-the-white-house"
}