{
  "title": "Girl on the Run",
  "description": "When a fairytale fantasy night becomes a nightmare, Chessa Paxton must run for her life...but will the truth set her free? Chessa Paxton, an event planner in Lake Tahoe, celebrates a successful night at the Happily Ever After Ball, but her dream quickly becomes a nightmare when she wakes up beside the body of her dead husband. Nauseous and confused, feeling as if she's been drugged, she can't explain to the sheriff why her princess costume is bloodied. With her father already a convicted murderer, she feels invisible shackles ratcheting onto her wrists and ankles. She runs! But she can't escape vivid flashes of a massacre in a meadow; men and women in fairy tale costumes; Snow White’s dead body shielding her from bullets. Though Chessa is a former costumer and a master of disguise, she quickly learns that hiding while trying to prove herself innocent is the most difficult task imaginable. Especially when the sheriff wants to throw her in jail and the real killer wants to silence her forever. “With a compelling, savvy and sympathetic protagonist, Gerber skillfully weaves a masterful plot with enough twists and turns to keep you guessing right until the explosive finale. A real page-turner and a satisfying read. “ ~ Hannah Dennison, The Honeychurch Hall Mysteries, The Vicky Hill Mysteries “GIRL ON THE RUN never lets you catch your breath. With a heart-pounding pace and twists you'll never see coming, it's guaranteed to keep you on the edge of your seat.” ~ Hilary Davidson, Anthony Award-winning Author of Blood Always Tells “Spellbound from start to finish. This author grabbed my attention and wouldn’t let go. A fantastic debut into the suspense genre.” ~ Escape With Dollycas Into A Good Book",
  "genres": [
    "Mystery",
    "Suspense",
    "Fiction",
    "Thriller",
    "Mystery Thriller"
  ],
  "author": "Daryl Wood Gerber",
  "average_rating": "4.12",
  "url": "https://www.goodreads.com/book/show/29386803-girl-on-the-run"
}