{
  "title": "Cursor's Fury",
  "description": "Since the Second Battle of Calderon, only the courage, determination and sacrifice of loyal subjects of the realm of Alera have prevented the unthinkable—a civil war that could leave Alera in ruins, devestated and vulernable to its enemies. Loyal Alerans have given their blood and lives to preserve the realm.It was not enough. Though the insurrection of the High Lords against the First Lord, Gaius Sextus, has been delayed for several years, it has only been the calm before the storm.Civil war shatters the realm.Now, the power-hungry High Lord of Kalare has launched a merciless, devastating rebellion against Gaius. Caught off guard by the sheer power of Kalare’s attack, Gaius Primus and the loyal forces of Alera must fight for the survival of the realm, beside the most dangerous of allies—the equally rebellious and power-hungry High Lord and Lady of Aquitaine.Trapped in the besieged city of Ceres, Isana of Calderon survives the attack of Kalare’s assassins, and must fight to save the life of the wounded slave, Fade, poisoned while defending Isana from her attackers. The secrets of her past loom large in deed and memory, as she at last confronts the dark truths of her own past.Countess Amara, Cursor to the First Lord, must carry out a desperate rescue operation, freeing hostages taken by Kalare and held against the military neutrality of loyal High Lords. The survival of the realm could hinge on the success of her mission: but is her ally, Lady Aquitaine, sincere in her efforts to assist—or will she betray the young Cursor and the First Lord she serves?Sent away from the theater of the civil war by a protective First Lord, young Tavi of Calderon joins the newly formed First Aleran Legion as its juniormost officer under an assumed name as a spy for the First Lord—but when civil war erupts, Tavi’s captain learns that Kalare has done the unthinkable; allied himself to the Canim, a merciless, terrifying enemy of the realm, who have arrived in numbers more vast than any in history. When treachery from within its ranks destroys the command structure of the First Aleran, the young Cursor finds himself in command. The First Aleran is friable, undertrained, poorly equipped; and it is the only force standing between the Canim horde and the heart of war-torn Alera.",
  "genres": [
    "Fantasy",
    "Fiction",
    "Epic Fantasy",
    "High Fantasy",
    "Audiobook",
    "Magic",
    "Adventure"
  ],
  "author": "Jim  Butcher",
  "average_rating": "4.37",
  "url": "https://www.goodreads.com/book/show/29394.Cursor_s_Fury"
}