{
  "title": "All Things Made New: The Reformation and Its Legacy",
  "description": "The most profound characteristic of Western Europe in the Middle Ages was its cultural and religious unity, a unity secured by a common alignment with the Pope in Rome, and a common language - Latin - for worship and scholarship. The Reformation shattered that unity, and the consequences are still with us today. In All Things Made New, Diarmaid MacCulloch, author of the New York Times bestseller Christianity: The First Three Thousand Years, examines not only the Reformation's impact across Europe, but also the Catholic Counter-Reformation and the special evolution of religion in England, revealing how one of the most turbulent, bloody, and transformational events in Western history has shaped modern society.The Reformation may have launched a social revolution, MacCulloch argues, but it was not caused by social and economic forces, or even by a secular idea like nationalism; it sprang from a big idea about death, salvation, and the afterlife. This idea - that salvation was entirely in God's hands and there was nothing humans could do to alter his decision - ended the Catholic Church's monopoly in Europe and altered the trajectory of the entire future of the West.By turns passionate, funny, meditative, and subversive, All Things Made New takes readers onto fascinating new ground, exploring the original conflicts of the Reformation and cutting through prejudices that continue to distort popular conceptions of a religious divide still with us after five centuries. This monumental work, from one of the most distinguished scholars of Christianity writing today, explores the ways in which historians have told the tale of the Reformation, why their interpretations have changed so dramatically over time, and ultimately, how the contested legacy of this revolution continues to impact the world today.",
  "genres": [
    "History",
    "Religion",
    "Nonfiction",
    "Theology",
    "Church History",
    "Christianity",
    "European History"
  ],
  "author": "Diarmaid MacCulloch",
  "average_rating": "3.85",
  "url": "https://www.goodreads.com/book/show/29386702-all-things-made-new"
}