{
  "title": "Never Kiss an Outlaw",
  "description": "ONE KISS CAN RUIN A GIRL, OR MAKE HER WHOLE AGAIN...CORANever kiss an outlaw, they said. Easy advice, until the day my father's dirty secrets made me property of the Deadly Pistols Motorcycle Club.Easy, until I came face-to-face with the beautiful bastard who makes me burn with every glance. Firefly.I tried to fight it. Threw every insult in the world his way, hoping to hide how bad my lips were begging to be kissed.Now, I'm losing the battle. Completely.I turned his life upside down. His cocky, unbelievable promises are flipping mine right-side up.He says he's going to make me his. I'm going to love it. And he isn't taking no for an answer.I should slap him upside the head. Instead, I'm becoming a believer in his caveman promises because I can't keep my hands off him...FIREFLYNo more games. I cut Cora a hundred kinds of slack when she landed in my world, one that's too twisted for a sheltered spitfire.I laughed at the sass and smears coming out of her mouth 'til the day the Prez made me her bodyguard. Then I put an end to her crap.I protected her. I laid down the law.One raging kiss shut her up for good. Never expected what came next, this urge to rip off her clothes, throw her on my bike, and own her.The monsters coming after her, they're already dead. It's the future that counts, and there's only one I'll live.Cora, she'll get my ink on her skin. She'll wear my ring. She'll have my kid.I'm taking what's mine, taking her night after night, and she's gonna get used to my lips on hers forever.The Outlaw Love books are stand alone romance novels featuring unique lovers and happy endings. No cliffhangers! This is Firefly and Cora's story in the Deadly Pistols MC series.",
  "genres": [
    "Romance",
    "Audiobook",
    "Erotica",
    "Contemporary",
    "Contemporary Romance",
    "Dark",
    "Suspense"
  ],
  "author": "Nicole Snow",
  "average_rating": "4.03",
  "url": "https://www.goodreads.com/book/show/29387470-never-kiss-an-outlaw"
}