{
  "title": "That Summer: Part Two",
  "description": "This is an alternate cover edition - ASIN: B011SIANZ4WARNING: I don't write about fairy tales and as much as I love Disney... I don't promise my readers or guarantee my characters a 'Happy Ever After...' Happy endings are harmonious but they're not always real life. I'm a sucker for bittersweet endings so please prepare yourself for one of them before purchasing one of my novels. Hearts and flowers won't be found in my writing and neither will perfect conclusions to my stories.\"Are you ready to continue, Serena?\" My therapist asks me, leaning forward in her seat with a compassionate and understanding expression on her face.\"I suppose so.\" I reply brusquely, close to hating her for making me carry on with this when she knows how much pain it is causing me.\"Is it alright with you if we pick up where we left off yesterday?\" She asks me gently.\"I guess.\" I answer curtly, folding my arms across my chest in a defensive manner.\"Now we've already covered how you came to meet Cole and how the two of you first started your relationship. You have also discussed with me what happened when you both found out that you share the same father as well as the circumstances which lead you to run away with him.\" She exhales slowly, pausing for a moment so I can have the opportunity to respond to her statement.“I remember.” I reply coldly, staring at her intently.\"What I want us to talk about today is the reason that you're here and the reason it's no longer safe for you to approach Cole.\"\"He despises me.” I state firmly. “And I can't say that I blame him.\"\"Serena, all of us say and do things we don't mean sometimes...\"\"Oh, he meant it.\" I assure her with certainty. \"He looked me in the eyes when he told me that he despises me. He told me he won’t rest until he's made my life as miserable as I've made his. He said I ruined him and he intends to destroy me like I destroyed him.\"\"When did he say this to you?\" She inquires gently.\"About six months ago.” I answer truthfully.“Serena, before we talk about what happened, we need to discuss the events which took place when you first ran away with him. I need to know what happened between you both when you left everything behind so you could be with him. Where did you go? What did you do? And how long were you together before the two of you were found?\"“You mean before I called the police?\" I demand angrily.\"Yes.\" She replies patiently.\"Five days.” I whisper softly, my anger decreasing when I remember those final days I spent with Cole. “We spent five days together before they caught up with us and before they took him away from me.\"\"And how long was it before you saw him again after that?\"\"Three years.” I murmur quietly. “That's how long it took for him to find me.\"\"And now he's searching for you again?\" She prompts me.\"He's always searching and I know he’s never going to stop.\" I remind myself, lowering my gaze towards the plush carpet beneath my feet.\"And how do you know that?\" She enquires softly.\"Because he swore to me that he wouldn't and I believe him. He won't rest until I'm found and he won't find peace until he captures me again.\"\"But what about you?” She asks, emphasising the importance of my own self and what I need. “What about your peace?\"\"Cole is my soul mate.” I state coldly, narrowing my eyes at her as I do so. “He's the other half of myself and I know it will be impossible for me to find completion until we're together again.\"\"Even though the consequences of a life with him may be catastrophic?” She asks me incredulously, struggling to conceal the look of astonishment on her face. I take a moment to process what my therapist has just asked me. I close my eyes and try to picture the next few decades of my life alongside Cole. I then try to imagine the rest of my life without him and realise right away that there is no contest between the two.\"Despite the misery I face with him, I still want him.” I say, speaking clearly and without fear. \"I don't need a happy ending… all I need is Cole.\"*** This novel contains mature themes, scenes of violence, strong language and sexual citations. Recommended readers 18+***",
  "genres": [
    "Young Adult"
  ],
  "author": "Lauren  Crossley",
  "average_rating": "3.42",
  "url": "https://www.goodreads.com/book/show/29378871-that-summer"
}