{
  "title": "The Apocalypse Guard",
  "description": "Over a decade ago, people started manifesting strange, incredible powers. One side effect of this was an awareness of alternate dimensions—some of these powers could reach into other realities, other versions of Earth. Though infinite dimensions are present, most of these are unstable, existing only as vague possibilities.A few of these worlds, however, are stable. These real, alternate versions of Earth are sometimes very, very different from the one we know. And a bizarrely large number of them, it turns out, are doomed. And so the Apocalypse Guard was founded: an organization of thousands of scientists, engineers, and extraordinary individuals who save planets.They comb the dimensions searching for stable worlds to contact. When they find one that is facing some kind of cataclysm, the Guard either finds a way to save the planet, or evacuates it. The process can take years, but so far the Guard has saved some dozen planets—though it has lost half as many to utter destruction.Emma is the Guard’s coffee girl. On summer internship at mission control, she gets to witness—from a safe distance—their activities. During the events surrounding the rescue of a planet, however, a shadowy group attacks the Guard and throws it into chaos. Emma finds herself cast through dimensions to be stranded on a doomed planet the Guard had been planning to save. Cut off from mission control, woefully inexperienced, Emma has to try to meet up with the Guard or find another way off the planet before cataclysm befalls it.In the tradition of the Reckoners, The Apocalypse Guard is a fast-paced, action-oriented story with roots in comic book traditions. This one is a little more science fiction and fantasy than it is superhero, and it will dig deeper into the mythology begun in the Reckoners. It is not a sequel to the Reckoners, in that it has new characters and a new story, but it might help answer some questions left by the end of Calamity.",
  "genres": [
    "Fantasy",
    "Science Fiction",
    "Young Adult",
    "Fiction",
    "Young Adult Fantasy",
    "Novels",
    "Action"
  ],
  "author": "Brandon Sanderson",
  "average_rating": "3.38",
  "url": "https://www.goodreads.com/book/show/29384742-the-apocalypse-guard"
}