{
  "title": "La dieta MIND, alimentación que ayuda a prevenir la enfermedad de Alzheimer: Tu cerebro puede estar sufriendo sin que te des cuenta",
  "description": "Most likely your brain is suffering at this very moment and you have no way of knowing or finding out, until you start to notice irreversible signs of decline.Our current diet is leading to all kinds of health problems: obesity, cancer, diabetes and cardiovascular disease, with increasing evidence that it also triggers Alzheimer’s disease, now seen by some researchers as another form of diabetes, an issue addressed in this book.What can we do? Awareness campaigns for healthy diets have achieved limited success. Many continue to follow fad diets, but most do it for aesthetic reasons or health problems.Some popular diets like the Mediterranean and DASH diets are specifically focused on preventing cardiovascular disease and hypertension.And what about the brain? We have left it to the mercy of our bad eating habits, preservatives in processed foods, excess sugar and fat, and environmental contaminants. All this happens because our brain does not complain – it does not have pain receptors – so we are not aware of its suffering and deterioration until it is too late.It is time to take care of our brain and prevent it from failing before the rest of our body by following a healthy diet that maintains its health and proper functioning.In \"The MIND Diet, Nutrition to Help Prevent Alzheimer's Disease,” you will discover what Alzheimer’s is and its causes and symptoms, among other topics, including a nutritional strategy for your daily life – all with a simple and direct style, addressed to the general public.As an easy-to-follow diet based on the latest scientific studies, the MIND diet can improve your overall health and dramatically reduce your risk of getting Alzheimer's disease.",
  "genres": [
    "Nutrition",
    "Neuroscience",
    "Medicine",
    "Health"
  ],
  "author": "Víctor R. Ramos",
  "average_rating": "4.57",
  "url": "https://www.goodreads.com/book/show/29398647-la-dieta-mind-alimentaci-n-que-ayuda-a-prevenir-la-enfermedad-de-alzhei"
}