{
  "title": "Tender",
  "description": "And now, the long-awaited TENDER, Book 1 in The Trelawneys of Williamsburg Series: Rachel Sheppard is running from a forgotten past. She arrives in Colonial Williamsburg with her best friend, Camisha, and soon learns that the man who raised her has been keeping a dark secret from her for twenty years and blackmailing Camisha. Now, he'll do everything to stop Rachel from revealing his secret. An endearing couple dressed in colonial clothing shelter the young women at Rosalie, an historic estate that was once a tobacco plantation. That evening, while a thunderstorm crashes outside, she hears the legends of Rosalie, including the story of Grey Trelawney and his young daughter Emily, who died at a fire at Rosalie in the 18th century. As she dresses for bed, she looks out the window and finds a little girl - Emily Trelawney - begging for her help. Could the child be a ghost? She races after the child into the ruins of the original plantation house, and as lightning strikes, she collapses. She awakens in the arms of Grey Trelawney, the wealthy plantation owner who has a dark secret of his own. She learns that secret when she discovers that Camisha, too, has traveled back to the year 1746 - with disastrous results. Will Rachel ever remember what happened in her childhood that wiped away her most treasured memories? How can a man as contemptible as Grey not only awaken in her the most tender passions, but also hold the key to restoring those memories? Can she prevent the fire that killed both the man and the child she now loves? How can she keep Camisha safe in a time and place so dangerous for her? This latest steamy time-travel romance from Anne Meredith is a sweeping drama of treachery, friendship, and redemption, set on a backdrop of forbidden love and overflowing with the history of the era. It will take you away, make you think, and leave you hungry for Book Two in The Trelawneys of Williamsburg Series by Anne Meredith.",
  "genres": [
    "Time Travel",
    "Romance",
    "Historical Fiction",
    "Historical",
    "Historical Romance",
    "Time Travel Romance"
  ],
  "author": "Anne Meredith",
  "average_rating": "3.99",
  "url": "https://www.goodreads.com/book/show/29406861-tender"
}