{
  "title": "Feeling White: Whiteness, Emotionality, and Education",
  "description": "Discussing race and racism often conjures up emotions of guilt, shame, anger, defensiveness, denial, sadness, dissonance, and discomfort. Instead of suppressing those feelings, dubbed \"emotionalities of whiteness,\" they are, nonetheless, important to identify, understand, and deconstruct if one ever hopes to fully commit to racial equity.Feeling White: Whiteness, Emotionality, and Education delves deeper into these white emotionalities and other latent ones. It provides theoretical and psychoanalytic analyses to determine where these emotions stem from, how they operate, and how they perpetuate racial inequities in education and society. The author beautifully weaves in creative writing with theoretical work to artistically illustrate how these emotions operate while also engaging the reader in an emotional experience in and of itself, claiming one must feel to understand.This book does not rehash former race concepts; rather, it applies them in novel ways that get at the heart of humanity, thus revealing how feeling white ultimately impacts race relations. Without a proper investigation on these underlying emotions, that can both stifle or enhance one's commitment to racial justice in education and society, the field of education denies itself a proper emotional preparation so needed to engage in prolonged educative projects of racial and social justice. By digging deep to what impacts humanity most--our hearts--this book dares to expose one's daily experiences with race, thus individually challenging us all to self-investigate our own racialized emotionalities.Cheryl E. Matias, Ph.D., is an assistant professor in the School of Education and Human Development at the University of Colorado Denver. She is a mother-scholar of three children, including boy-girl twins.",
  "genres": [
    "Nonfiction",
    "Anti Racist",
    "Race"
  ],
  "author": "Cheryl E. Matias",
  "average_rating": "4.31",
  "url": "https://www.goodreads.com/book/show/29404699-feeling-white"
}