{
  "title": "قصص الأنبياء",
  "description": "قصص الأنبياء في القرآن الكريم هي قصص لصفوة الخلق وخيرتهم على الإطلاق، فهم هداة العالمين ورحمة الله للناس أجمعين، وما كان الله قص ما قص من قصص في قرآن الكريم للتسلية والتلهي، وإنما جاء عظة وعبرة لأولي الألباب، وجاء يثير في النفس التأمل والتفكر في سنن الحياة وقواعد الاجتماع البشري وسيرة الناس عبر الزمان والمكان. وإن كان ربنا، تبارك وتعالى، أنعم علينا بنعمة قصص طائفة من حكايات الأنبياء وأقوامهم فإنه يلفت النظر إلى أن المهم في تاريخ هؤلاء العظماء أ نقف عند حد العظة والعبرة. ولقد تمثل المفسر الحافظ ابن كثير منهجاً علمياً بديعاً في عرض هذا القصص القرآني، حاول فيه الابتعاد عن خرافات الإسرائيليات وخزعبلات القصاص وأكاذيب بعض المؤرخين.ويمكن تحديد معالم هذا المنهج على النحو التالي: أولاً التزامه بإيراد كل ما يتعلق بالنبي صاحب القصة من كتاب الله تعالى، وأخبار القرآن في هذا السياق هي الأخبار المجزوم يصدقها على وجه اليقين من دون تردد. ولم يكتف المؤلف بذلك بل وقف مع الآيات محللاً لها، مفسراً لمعانيها، متعمقاً في مغازيها، وهو المفسر الواعي بدقائق التفسير.ثانياً عنايته عناية كبيرة بالأخبار والآثار المروية بشأن هؤلاء الأنبياء على عدة مستويات، فالأحاديث يعنى بعزوها إلى مصادرها، منبهاً على صحيحها وسقيمها في كثير من الأحيان، والإسرائيليات إذا وردت في النص، فإنه يرويها في حذر المحدث الواعي بالمرويات، مبيناً الغث منها وما يمكن أن يكون في إطار المقبول، والآثار يتتبع ما يلقي على النص شيئاً من الضوء لإيضاح غامض أو توضيح مبهم. ثالثاً العناية باللغة إلى حد معقول فيفسر ما نبا من مفردات، ويشرح ما ثقل فهمه من نصوص، وهو يحمل في ذهنه عقلية لغوية بليغة. رابعاً بالإضافة إلى ذلك كله التسلسل المنهجي المنطلق مع الأحداث، مع شيء من الاستطراد المقبول بهدف استخراج العظة والوقوف مع فائدة هنا، أو شاردة هناك.وكتاب قصص الأنبياء الذي هو بين يدي القارئ هو جزء من كتاب ابن كثير \"البداية والنهاية\"، انتزعه كل طبع الكتاب مستقلاً منه، فليس هو مصنفاً مستقلاً في أصل تأليف ووضعه. ولأهميته تمّ الاعتناء به على هذا النحو: أولاً: العناية بإخراج النص إخراجاً صحيحاً بعيداً عن الأخطاء ما أمكن ذلك، ثانياً: تخريج الآيات القرآنية، مع استعراض غريب المفردات التي توجد في الآيات، ثالثاً: تخريج المرويات المتعددة، رابعاً: شرح المفردات الغريبة في النص كله تيسيراً للفهم وتحقيقاً لهدف تبسيط النص، خامساً: وضع عناوين جانبية لكل فكرة جديدة، ليسهل على القارئ متابعة تسلسل الأحداث والاستفادة بما في الكتاب من فوائد علمية متنوعة.",
  "genres": [
    "Religion",
    "Nonfiction",
    "History",
    "Biography",
    "Reference",
    "Unfinished",
    "Spirituality"
  ],
  "author": "Ibn Kathir",
  "average_rating": "4.50",
  "url": "https://www.goodreads.com/book/show/2939484"
}