{
  "title": "Unbarred Innovation: A Pathway to Greatest Discoveries",
  "description": "Winner of Reader's Favorite 2016 International Book Award Contest in Non-Fiction - Business/Finance category. Visit : readersfavorite.com/book-review/unbar... *** Winner of 2016 Northern California Book Festival Award in Business Category *** Finalist in the 5th Annual Beverly Hills International Book Awards 2016 *** Mayur Ramgir, an innovator, entrepreneur and an International Award Winning Author, puts his Sherlock hat on and picks up Watson’s pen to retrace a story of success and jot it down for the others to follow. He tells the story of how successful people found their pathway to discoveries that took them to the heights where we now see them. He tells the tale, not just of achievements, but also of failures, and more importantly, of getting back on the feet after those failures. Unbarred A Pathway to Greatest Discoveries is written as a source of inspiration for those who doubt the destiny. Ramgir narrates the story of great innovators with the intention of helping readers find out that those are the people they can relate to, and their achievements are nothing but the result of unwavering determination and efforts. Those are the people who take failure an opportunity to overcome the flawed and feeble aspects of their strategies. They improve and strengthen themselves after every stumble, rising up stronger and better than ever before. He explores the element that differentiates them from everyone else. Is it genetic superiority or a gift of opportunities? Is it really something they are born with, or is it something they take from what they observe and experience? With his belief in the latter theory, Ramgir inspects their lives to identify the difference of a whole new level. His own journey to success is based on what he had been learning from the lives of people who inspire him. From Larry Ellison to Li Ka-shing, he had put the lives of these living giants under the microscope to understand what they do different and how they fostered the innovator in themselves. The book is a detailed account of Ramgir’s learning. Like Seven Habits of Highly Effective People by Stephen Covey, Ramgir’s story is also more than just words of inspiration. He writes his book as a guide that takes the reader on the path to self-discovery. From philosophy to believes and from perception to action, follow Ramgir as he uncovers the secret lifestyle that successful people live by. Understand the idea of Unbarred Innovation and how it can help you join the league of modern innovators regardless of your current circumstances and challenges. Find out how you can take the smallest idea out of your mind, polish it, and present it to the world in a way that changes everything, not just for the world but also for you. Be the modern day innovator, raise future innovators, and find out how innovation can pave way to entrepreneurship. It is important to note that all the proceeds generated by this book will be donated for charitable causes such as providing education, shelter, food and basic needs for underprivileged children, eradicating poverty, hunger and solving social and global issues.",
  "genres": [
    "Nonfiction",
    "Business"
  ],
  "author": "Mayur Ramgir",
  "average_rating": "4.17",
  "url": "https://www.goodreads.com/book/show/29397329-unbarred-innovation"
}