{
  "title": "1777: Tipping Point at Saratoga",
  "description": "1777: Tipping Point at Saratoga covers the history of the thirty-three days of the Saratoga campaign. Utilizing historical archaeology and the words of the men and women that served in both armies, words taken directly from their letters, journals, diaries, and memoirs, of which many remain unpublished, Snow weaves an intimate and personal telling of the battles. It was for both sides a story of endurance. The Americans fielded an improvised and inexperienced army under Horatio Gates to face the highly trained British and German forces led by John Burgoyne. In addition to these initial inequalities were the advantages of short distances, regular supply, and fresh reinforcements enjoyed by the Americans and the disadvantages of long inadequate supply lines and thinning ranks endured by the British and German forces. There were painful losses on both sides, tragic deaths, and the combination of relief and protracted pain that always accompanies armed conflict. But in the end, the stark fact remained that one of the world's finest armies had been beaten by a force of amateurs, changing the direction of the American insurrection and making eventual independence inevitable.The skein of personal stories that comprise the bigger story of Saratoga has many threads, including that of Benedict Arnold, whose flawed personality was not yet fully evident. The contrasting personalities and fates of the commanding generals, Gates and Burgoyne, are better known, but these are but a few of the threads that form the larger story of Saratoga. By bringing together the stories of both the famous and the anonymous on both sides, Snow's narrative presents a thorough micro-history of the battles that tipped the balance of the American War of Independence.",
  "genres": [
    "History",
    "American Revolution",
    "American Revolutionary War",
    "Nonfiction",
    "American History",
    "War",
    "18th Century"
  ],
  "author": "Dean Snow",
  "average_rating": "4.18",
  "url": "https://www.goodreads.com/book/show/29417484-1777"
}