{
  "title": "Devil’s in the Details",
  "description": "Victoria Bancroft is a decorated war hero now teaching naval history and leading a simple solitary life in the suburbs, at least by outwards appearances. In truth her military professorship is a front setup to provide the anonymity necessary to work as a paid assassin for Voltaire, a deep undercover government agency. Paid to eliminate undesirable targets across the globe as inconspicuously as possible, Victoria is considered one of the Voltaire’s best assets. Meticulous and driven, Victoria is always sure not to draw attention to herself, that is until one fateful night on a metro station when Victoria feels compelled to intervene as she witnesses the brutal attack on the woman with remarkable eyes and haunting beauty. Dispatching her attackers with deadly accuracy, she drops the woman off at the nearest hospital with no intentions of ever seeing her again. Brutally assaulted on a metro station, ER Nurse Alexandra Ivers barely escapes with her life thanks to the decisive actions of a complete stranger. Through her slow and painful recovery, Alex feels compelled to search out and thank the woman who saved her. With little to go on, Alex slowly pieces the puzzle together that leads her to Victoria Bancroft, a mysterious Good Samaritan. That is until Alex walks into Victoria’s office months later and changes everything. Slowly the women develop a friendship that quickly transforms into simmering attraction. Determined to protect Alex from the truth of who she is, Victoria tries unsuccessfully to push her away, only to find that their desire for each other overrides every obstacle she puts into place. Surrendering her heart and soul to Alex, Victoria is faced with having to decide how much of her dual life she can reveal to Alex without losing her. As Voltaire draws a noose around them, Victoria must fight to keep the love of her life safe whilst finding a way out of Voltaire. Caught in the cross fire, Alex must decide whether she can reconcile her feelings for the woman she loves and who she really is, whilst running from an organization determined to eradicate them both. Even if they survive the odds, can they survive the collateral damage to their relationship or lose everything? Devil’s in the Details is the second exciting novel by Sydney Gibson. Her first novel, Redemptio Animae, was heralded as an action pack love story that left many breathless and wanting more. Sydney returns to that same formula, offering intrigue, suspense, romance and a page turning story.",
  "genres": [
    "Lesbian",
    "LGBT",
    "Lesbian Romance",
    "Thriller",
    "Crime",
    "Military Fiction",
    "Queer"
  ],
  "author": "Sydney Gibson",
  "average_rating": "4.37",
  "url": "https://www.goodreads.com/book/show/29410628-devil-s-in-the-details"
}