{
  "title": "The Black Tower",
  "description": "Vidocq. The name strikes terror in the Parisian underworld of 1818. As founder and chief of a newly created plainclothes police force, Vidocq has used his mastery of disguise and surveillance to capture some of France’s most notorious and elusive criminals. Now he is hot on the trail of a tantalizing mystery—the fate of the young dauphin Louis-Charles, son of Marie-Antoinette and King Louis XVI. Hector Carpentier, a medical student, lives with his widowed mother in her once-genteel home, now a boardinghouse, in Paris’s Latin Quarter, helping the family make ends meet in the politically perilous days of the restoration. Three blocks away, a man has been murdered, and Hector’s name has been found on a scrap of paper in the dead man’s pocket: a case for the unparalleled deductive skills of Eugène François Vidocq, the most feared man in the Paris police. At first suspicious of Hector’s role in the murder, Vidocq gradually draws him into an exhilarating—and dangerous—search that leads them to the true story of what happened to the son of the murdered royal family. Officially, the Dauphin died a brutal death in Paris’s dreaded Temple—a menacing black tower from which there could have been no escape—but speculation has long persisted that the ten-year-old heir may have been smuggled out of his prison cell. When Hector and Vidocq stumble across a man with no memory of who he is, they begin to wonder if he is the Dauphin himself, come back from the dead. Their suspicions deepen with the discovery of a diary that reveals Hector’s own shocking link to the boy in the tower—and leaves him bound and determined to see justice done, no matter the cost. In The Black Tower, Bayard deftly interweaves political intrigue, epic treachery, cover-ups, and conspiracies into a gripping portrait of family redemption—and brings to life an indelible portrait of the mighty and profane Eugène François Vidocq, history’s first great detective.",
  "genres": [
    "Historical Fiction",
    "Mystery",
    "Fiction",
    "Historical",
    "Historical Mystery",
    "France",
    "Audiobook"
  ],
  "author": "Louis Bayard",
  "average_rating": "3.75",
  "url": "https://www.goodreads.com/book/show/2942664-the-black-tower"
}