{
  "title": "The Pitchfork 500: Our Guide to the Greatest Songs From Punk to the Present",
  "description": "FROM THE BRAIN TRUST BEHIND PITCHFORKMEDIA. COM -- THE WEBSITE THE LOS ANGELES TIMES DECLARED \"AN ESSENTIAL PART OF THE IPO D GENERATION'S LEXICON, A MUST-READ\" -- A FRESH GUIDE TO THE 500 BEST SONGS OF THE PAST THIRTY YEARS.Named the \"best site for music criticism on the web\" by The New York Times Magazine, Pitchforkmedia.com has become the leading independent resource for music journalism, the place people turn to find out what's happening in new music. Founded in 1995, Pitchfork has developed one of the web's most devoted followings, with more than 1.6 million readers monthly who tune in for daily reviews, news, features, videos, and interviews.In The Pitchfork 500: Our Guide to the Greatest Songs from Punk to the Present, Pitchfork offers up their take on the 500 best songs of the past three decades. Focusing on indie rock (Arcade Fire, the Shins), hiphop (Public Enemy, Jay-Z), electronic (Daft Punk, Boards of Canada), pop (Madonna, Justin Timberlake), metal (Metallica, Boris), and experimental underground music (Suicide, Boredoms), it features all-new essays and reviews written with the sharp wit and insight for which the site is known.Kicking it off in 1977 with the birth of punk and independent music, The Pitchfork 500 runs chronologically, with each chapter representing a distinct period and offering a narrative of how the musical landscape of the day influenced its artists. The book opens with David Bowie, Lou Reed, Iggy Pop, Kraftwerk, and Brian Eno, the \"art-rock godfathers\" who set the tone and tenor for the next thirty years, and wraps up in the present, when bands connect with new audiences through social networking sites and prime-time TV placements -- and when a single mp3 can turn a niche indie artist into a global sensation. Sidebars like \"Yacht Rock,\" \"Runaway Trainwrecks,\" \"Nanofads,\" and \"Career Killers\" call out some far-from-classic musical trends and identify the guiltiest offenders.Modernizing the music-guide format, The Pitchfork 500 reflects the way listeners are increasingly processing music -- by song rather than by album. These 500 tracks condense thirty years of essential music into the ultimate chronological playlist, each song advancing the narrative and, by extension, the music itself.",
  "genres": [
    "Music",
    "Nonfiction",
    "Reference",
    "History"
  ],
  "author": "Scott Plagenhoef",
  "average_rating": "3.71",
  "url": "https://www.goodreads.com/book/show/2942566-the-pitchfork-500"
}