{
  "title": "Scarred Survival",
  "description": "This is an alternate cover edition for B00RW8WSQM Gemma’s long awaited love story.  She’s been a civilian for two years but only now does she realize that she’s been ‘one of the boys’ for far too long. Her prosthetic arm isn’t helping with her shattered self-esteem either. Things that never bothered her before are certainly bothering her now and that’s even before the arrival of the temperamental new guest at the rehabilitation centre.  She’s there to do a job and she’s determined to succeed. She’s a survivor, a fighter, certainly not a quitter, but even she can’t understand the way her emotions ebb and flow as swiftly as the tides in the beautiful bay of Roscoff.  Aqua-eyed flight-god, Aaron Thomas is an angry man. His life has been pulled apart, turned upside down and now he’s about to have his career ripped out from under his cockpit seat. He needs to concentrate on the truth, needs to make a plan, needs to get through the next few weeks without losing his mind or his job, but he hasn’t reckoned on the delightful distraction of the stunning, dark-eyed beauty who greets him at the centre’s door.  She’s there to help these wonderful, brave men find their place in the world now that their injuries have thrown them from their intended course. When Aaron’s being his most irritable, she is still determined to help him, but even he is surprised at the lengths to which she will go when he is confronted by an exceedingly suspicious Major Patrick Reeves VC for the first time.  Throw in a mixture of determined amputees, a wax wielding beautician, an over-abundance of silk dresses and several bowls of chocolate mousse and Gemma can see her life going rapidly downhill from here on in.  Will Gemma finally let down the walls that have guarded her heart for so long? Can Aaron face the truth even if it means that he will lose the only woman he's ever wanted to be with?  Scarred Survival is book 5 in the Scarred Series. It can be read alone, but is probably best enjoyed in conjunction with the rest of the series due to previous character involvement.  All the books are easy read romance with plenty of humour, some typical army guy language and a few sensual sex scenes. All the books are suitable for ages 17 and up.  Running Scarred, Patrick’s story (book 1) Scarred Beginnings, How it all began (Yes, this is book 2) Forever Scarred, Joe’s chance for love (book 3) Scarred Horizon, Will Paul ever see what stands right in front of him? (book 4)",
  "genres": [
    "Military Fiction",
    "Romance",
    "Contemporary"
  ],
  "author": "Jackie Williams",
  "average_rating": "3.80",
  "url": "https://www.goodreads.com/book/show/29422131-scarred-survival"
}