{
  "title": "Believe Me: A Memoir of Love, Death, and Jazz Chickens",
  "description": "Critically acclaimed, award-winning British comedian and actor Eddie Izzard details his childhood, his first performances on the streets of London, his ascent to worldwide success on stage and screen, and his comedy shows which have won over audiences around the world.Over the course of a thirty-year career, Eddie Izzard has proven himself to be a creative chameleon, inhabiting the stage and film and television screen with an unbelievable fervor. Born in Yemen, and raised in Ireland, Wales and post-war England, he lost his mother at the age of six. In his teens, he dropped out of university and took to the streets of London as part of a two-man escape act; when his partner went on vacation, Izzard kept busy by inventing a one-man act, and thus a career was ignited. As a stand-up comedian, Izzard has captivated audiences with his surreal, stream-of-consciousness comedy--lines such as \"Cake or Death?\" \"Death Star Canteen,\" and \"Do You Have a Flag?\" have the status of great rock lyrics. As a self-proclaimed \"Executive Transvestite,\" Izzard broke the mold performing in full make-up and heels, and has become as famous for his advocacy for LGBT rights as he has for his art. In Believe Me, he recounts the dizzying rise he made from street busking to London's West End, to Wembley Stadium and New York's Madison Square Garden. Still performing more than 100 shows a year--thus far in a record-breaking twenty-eight countries worldwide--Izzard is arguably one of today's top Kings of Comedy. With his brand of keenly intelligent humor, that ranges from world history to pop culture, politics and philosophy, he has built an extraordinary fan base that transcends age, gender, and race. Writing with the same candor and razor-sharp insight evident in his comedy, he reflects on a childhood marked by unutterable loss, sexuality and coming out, as well as a life in show business, politics, and philanthropy. Honest and generous, Izzard's Believe Me is an inspired account of a very singular life thus far.",
  "genres": [
    "Nonfiction",
    "Memoir",
    "Biography",
    "Audiobook",
    "Humor",
    "Autobiography",
    "Biography Memoir"
  ],
  "author": "Eddie Izzard",
  "average_rating": "3.86",
  "url": "https://www.goodreads.com/book/show/29430067-believe-me"
}