{
  "title": "Retrieving for All Occasions: Foundations for Excellence in Gun Dog Training",
  "description": "They Challenge the Dog World with Unique Book on Positive Gun Dog Training New Book on Force-Free Gun Dog Training by two Swedish authors. Just now an appealing and accessible book on positive gun dog training has been published. The book focuses both on explaining the exercises in a clear and pedagogical way and on the experience for the reader with nice photographs and colorful layout. The book contains over 100 exercises on how to train an excellent gun dog. - We want to show the world that dog training without physical or verbal corrections is possible, something that previously has been considered almost necessary in gun dog training, says Elsa Blomster, dog instructor and author. Together with her colleague, Lena Gunnarsson, she has written a book on gun dog training using only reward based training Retrieving for All Occasions. - Dog training should be enjoyable for both dog and trainer, and that is what we are describing in our book, says Lena Gunnarsson. Rough training methods on TV gains enormous impact and many ordinary dog owners believe that is the only way to train a dog. The book presents alternatives to these methods. The book is for all dog owners that have a gun dog, for example a Golden Retriever, a Labrador Retriever or a Flat Coated Retriever as well as all the spaniel breeds such as Cocker Spaniel and Springer Spaniel, but also such as Vorstehs and Setters. In the US there are 78 million dogs. Spaniels and retrievers are among the most popular breeds. These breeds were originally bred to help the hunter find and retrieve small game. The breeding has also made them very friendly and eager to learn, thus also making them much appreciated family dogs. The book is primarily for beginners who want to train and compete with their dog and for those who want to activate their dog in a fun way. Elsa Blomster and Lena Gunnarsson are dog instructors in Gothenburg, Sweden, and base all their training on the clicker philosophy. They train and compete with their spaniels and retrievers in obedience, agility, rally obedience, tracking and field trials. Elsa and Lena published the book in Swedish in 2012 and it sold over 1200 copies in its first five months. Now, they ve widened their market by introducing the book to the Englishspeaking market. To find out more about the book, just visit There you ll also find more dog training information. Do you want to know more? Elsa Blomster",
  "genres": [
    "Self Help",
    "21st Century",
    "Dogs",
    "Nonfiction",
    "Education",
    "Personal Development",
    "New Adult"
  ],
  "author": "Elsa Blomster",
  "average_rating": "4.26",
  "url": "https://www.goodreads.com/book/show/29421058-retrieving-for-all-occasions"
}