{
  "title": "Circling the Sun",
  "description": "NEW YORK TIMES BESTSELLER • NAMED ONE OF THE BEST BOOKS OF THE YEAR BY NPR, BOOKPAGE, AND SHELF AWARENESS • “Paula McLain is considered the new star of historical fiction, and for good reason. Fans of The Paris Wife will be captivated by Circling the Sun, which . . . is both beautifully written and utterly engrossing.”—Ann Patchett, Country LivingPaula McLain, author of the phenomenal bestseller The Paris Wife, now returns with her keenly anticipated new novel, transporting readers to colonial Kenya in the 1920s. Circling the Sun brings to life a fearless and captivating woman—Beryl Markham, a record-setting aviator caught up in a passionate love triangle with safari hunter Denys Finch Hatton and Karen Blixen, who as Isak Dinesen wrote the classic memoir Out of Africa.Brought to Kenya from England as a child and then abandoned by her mother, Beryl is raised by both her father and the native Kipsigis tribe who share his estate. Her unconventional upbringing transforms Beryl into a bold young woman with a fierce love of all things wild and an inherent understanding of nature’s delicate balance. But even the wild child must grow up, and when everything Beryl knows and trusts dissolves, she is catapulted into a string of disastrous relationships.Beryl forges her own path as a horse trainer, and her uncommon style attracts the eye of the Happy Valley set, a decadent, bohemian community of European expats who also live and love by their own set of rules. But it’s the ruggedly charismatic Denys Finch Hatton who ultimately helps Beryl navigate the uncharted territory of her own heart. The intensity of their love reveals Beryl’s truest self and her fate: to fly.Set against the majestic landscape of early-twentieth-century Africa, McLain’s powerful tale reveals the extraordinary adventures of a woman before her time, the exhilaration of freedom and its cost, and the tenacity of the human spirit.Praise for Circling the Sun“In McLain’s confident hands, Beryl Markham crackles to life, and we readers truly understand what made a woman so far ahead of her time believe she had the power to soar.”—Jodi Picoult, author of Leaving Time“Enchanting . . . a worthy heir to [Isak] Dinesen . . . Like Africa as it’s so gorgeously depicted here, this novel will never let you go.”—The Boston Globe“Famed aviator Beryl Markham is a novelist’s dream. . . . [A] wonderful portrait of a complex woman who lived—defiantly—on her own terms.”—People (Book of the Week)“Circling the Sun soars.”—Newsday“Captivating . . . [an] irresistible novel.”\n—The Seattle Times\n“Like its high-flying subject, Circling the Sun is audacious and glamorous and hard not to be drawn in by. Beryl Markham may have married more than once, but she was nobody’s wife.”\n—Entertainment Weekly\n“[An] eloquent evocation of Beryl’s daring life.”—O: The Oprah Magazine“Markham’s life is the stuff of legend. . . . McLain has created a voice that is lush and intricate to evoke a character who is enviably brave and independent.”—NPR“Bold, absorbing fiction.”—New York Daily News“Paula McLain has such a gift for bringing characters to life. I loved discovering the singular Beryl Markham, with all her strengths and passions and complexities.”—Jojo Moyes, author of Me Before YouFrom the Hardcover edition.",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Book Club",
    "Africa",
    "Historical",
    "Audiobook",
    "Romance"
  ],
  "author": "Paula McLain",
  "average_rating": "3.94",
  "url": "https://www.goodreads.com/book/show/29429321-circling-the-sun"
}