{
  "title": "Self-Made Man: One Woman's Journey Into Manhood and Back Again",
  "description": "Having gone where no woman (who wasn't an aspiring or actual transsexual) has gone for any significant length of time, let alone eighteen months, Norah Vincent's surprising account is an enthralling reading experience and a revelatory piece of anecdotally based gender analysis that is sure to spark fierce and fascinating conversation.A journalist's provocative, spellbinding account of her eighteen months spent undercover will transform the way we think about what it means to be a man Following in the tradition of John Howard Griffin (Black Like Me) and Barbara Ehrenreich (Nickel and Dimed), Norah Vincent absorbed a cultural experience and reported back on what she observed incognito. For more than a year and a half she ventured into the world as Ned, with an ever-present five o'clock shadow, a crew cut, wire-rim glasses, and her own size 11 1/2 shoes—a perfect disguise that enabled her to observe the world of men as an insider. The result is a sympathetic, shrewd, and thrilling tour de force of immersion journalism that's destined to challenge preconceptions and attract enormous attention. With her buddies on the bowling league she enjoyed the rough and rewarding embrace of male camaraderie undetectable to an outsider. A stint in a high-octane sales job taught her the gut-wrenching pressures endured by men who would do anything to succeed. She frequented sex clubs, dated women hungry for love but bitter about men, and infiltrated all-male communities as hermetically sealed as a men's therapy group, and even a monastery. Narrated in her utterly captivating prose style and with exquisite insight, humor, empathy, nuance, and at great personal cost, Norah uses her intimate firsthand experience to explore the many remarkable mysteries of gender identity as well as who men are apart from and in relation to women. Far from becoming bitter or outraged, Vincent ended her journey astounded—and exhausted—by the rigid codes and rituals of masculinity. Having gone where no woman (who wasn't an aspiring or actual transsexual) has gone for any significant length of time, let alone eighteen months, Norah Vincent's surprising account is an enthralling reading experience and a revelatory piece of anecdotally based gender analysis that is sure to spark fierce and fascinating conversation.",
  "genres": [
    "Nonfiction",
    "Memoir",
    "Gender",
    "Feminism",
    "Sociology",
    "Biography",
    "Psychology"
  ],
  "author": "Norah Vincent",
  "average_rating": "3.42",
  "url": "https://www.goodreads.com/book/show/29434.Self_Made_Man"
}