{
  "title": "Attending: Medicine, Mindfulness, and Humanity",
  "description": "The first book for the general public about mindfulness and medical practice, a groundbreaking, intimate exploration of how doctors think and what matters most—safe, effective, patient-centered, compassionate care—from the foremost expert in the field.As a third-year Harvard Medical School student doing a clinical rotation in surgery, Ronald Epstein watched an error an experienced surgeon failed to notice his patient’s kidney turning an ominous shade of blue. In that same rotation, Epstein was awestruck by another surgeon’s ability to avert an impending disaster, slowing down from autopilot to intentionality. The difference between these two doctors left a lasting impression on Epstein and set the stage for his life’s work—to identify the qualities and habits that distinguish masterful doctors from those who are merely competent. The secret, he learned, was mindfulness.In Attending , his first book, Dr. Epstein builds on his world-renowned, innovative programs in mindful practice and uses gripping and deeply human clinical stories to give patients a language to describe what they value most in health care and to outline a road map for doctors and other health care professionals to refocus their approach to medicine. Drawing on his clinical experiences and current research, and exploring four foundations of mindfulness—Attention, Curiosity, Beginner’s Mind, and Presence—Dr. Epstein introduces a revolutionary by looking inward, health care practitioners can grow their capacity to provide high-quality care and the resilience to be there when their patients need them.The commodification of health care has shifted doctors’ focus away from the healing of patients to the bottom line. Clinician burnout is at an all-time high. Attending is the antidote. With compassion and intelligence, Epstein offers a crucial, timely book that shows us how we can restore humanity to medicine, guides us toward a better overall quality of care, and reminds us of what matters most.",
  "genres": [
    "Medicine",
    "Nonfiction",
    "Medical",
    "Science",
    "Health",
    "Self Help",
    "Psychology"
  ],
  "author": "Ronald Epstein",
  "average_rating": "3.97",
  "url": "https://www.goodreads.com/book/show/29430776-attending"
}