{
  "title": "Being a Dog: Following the Dog Into a World of Smell",
  "description": "*A New York Times Bestseller * A Science Friday and Library Journal Best Science Book of the Year *From the #1 bestselling author of Inside of a Dog and The Year of the Puppy —“an incredible journey into the olfactory world of man’s best friend” ( O, The Oprah Magazine ), Alexandra Horowitz’s follow-up to her New York Times bestseller explains how dogs experience the world through their most spectacular organ—the nose.To a dog, there is no such thing as “fresh air.” Every breath of air is loaded with information. In fact, what every dog—the tracking dog, of course, but also the dog lying next to you, snoring, on the couch—knows about the world comes mostly through his nose.In Being a Dog , Alexandra Horowitz, a research scientist in the field of dog cognition and the author of the runaway bestseller Inside of a Dog , unpacks the mystery of a dog’s worldview as has never been done before.With her family dogs, Finnegan and Upton, leading the way, Horowitz sets off on a quest to make sense of scents, combining a personal journey of smelling with a tour through the cutting edge and improbable science behind the olfactory powers of the dog. From revealing the spectacular biology of the dog snout, to speaking to other cognitive researchers and smell experts across the country, to visiting detection-dog training centers and even attempting to smell-train her own nose, Horowitz covers the topic of noses—both canine and human—from surprising, novel, and always fascinating angles.As we come to understand how complex the world around us appears to the canine nose, Horowitz changes our perspective on dogs forever. Readers will finish this book feeling that they have smelled into a fourth dimension—breaking free of human constraints and understanding smell as never before; that they have, however fleetingly, been a dog.",
  "genres": [
    "Nonfiction",
    "Dogs",
    "Science",
    "Animals",
    "Audiobook",
    "Nature",
    "Biology"
  ],
  "author": "Alexandra Horowitz",
  "average_rating": "3.75",
  "url": "https://www.goodreads.com/book/show/29430796-being-a-dog"
}