{
  "title": "Young and Damned and Fair: The Life of Catherine Howard, Fifth Wife of King Henry VIII",
  "description": "Written with an exciting combination of narrative flair and historical authority, this interpretation of the tragic life of Catherine Howard, fifth wife of Henry VIII, breaks new ground in our understanding of the very young woman who became queen at a time of unprecedented social and political tension and whose terrible errors in judgment quickly led her to the executioner’s block.On the morning of July 28, 1540, as King Henry’s VIII’s former confidante Thomas Cromwell was being led to his execution, a teenager named Catherine Howard began her reign as queen of a country simmering with rebellion and terrifying uncertainty. Sixteen months later, the king’s fifth wife would follow her cousin Anne Boleyn to the scaffold, having been convicted of adultery and high treason.The broad outlines of Catherine’s career might be familiar, but her story up until now has been incomplete. Unlike previous accounts of her life, which portray her as a naïve victim of an ambitious family, this compelling and authoritative biography will shed new light on Catherine Howard’s rise and downfall by reexamining her motives and showing her in her context, a milieu that goes beyond her family and the influential men of the court to include the aristocrats and, most critically, the servants who surrounded her and who, in the end, conspired against her. By illuminating Catherine's entwined upstairs/downstairs worlds as well as societal tensions beyond the palace walls, the author offers a fascinating portrayal of court life in the sixteenth century and a fresh analysis of the forces beyond Catherine’s control that led to her execution—from diplomatic pressure and international politics to the long-festering resentments against the queen’s household at court.Including a forgotten text of Catherine’s confession in her own words, color illustrations, family tree, map, and extensive notes, Young and Damned and Fair changes our understanding of one of history’s most famous women while telling the compelling and very human story of complex individuals attempting to survive in a dangerous age.",
  "genres": [
    "History",
    "Nonfiction",
    "Biography",
    "Tudor Period",
    "Historical",
    "British Literature",
    "Audiobook"
  ],
  "author": "Gareth Russell",
  "average_rating": "4.15",
  "url": "https://www.goodreads.com/book/show/29430787-young-and-damned-and-fair"
}