{
  "title": "Small Admissions",
  "description": "For fans of The Nanny Diaries and Sophie Kinsella comes a whip-smart and deliciously funny debut novel about Kate, a young woman unexpectedly thrust into the cutthroat world of New York City private school admissions as she attempts to understand city life, human nature, and falling in love.Despite her innate ambition and Summa Cum Laude smarts, Kate Pearson has turned into a major slacker. After being unceremoniously dumped by her handsome, French “almost fiancé,” she abandons her grad school plans and instead spends her days lolling on the couch, watching reruns of Sex and the City, and leaving her apartment only when a dog-walking gig demands it. Her friends don’t know what to do other than pass tissues and hope for a comeback, while her practical sister, Angela, pushes every remedy she can think of, from trapeze class to therapy to job interviews.Miraculously, and for reasons no one (least of all Kate) understands, she manages to land a job in the admissions department at the prestigious Hudson Day School. In her new position, Kate learns there’s no time for self-pity or nonsense during the height of the admissions season, or what her colleagues refer to as “the dark time.” As the process revs up, Kate meets smart kids who are unlikable, likeable kids who aren’t very smart, and Park Avenue parents who refuse to take no for an answer.Meanwhile, Kate’s sister and her closest friends find themselves keeping secrets, hiding boyfriends, dropping bombshells, and fighting each other on how to keep Kate on her feet. On top of it all, her cranky, oddly charming, and irritatingly handsome downstairs neighbor is more than he seems. Through every dishy, page-turning twist, it seems that one person’s happiness leads to another’s misfortune, and suddenly everyone, including Kate, is looking for a way to turn rejection on its head, using any means necessary—including the truly unexpected.",
  "genres": [
    "Fiction",
    "Chick Lit",
    "Contemporary",
    "Audiobook",
    "Humor",
    "Romance",
    "Adult"
  ],
  "author": "Amy Poeppel",
  "average_rating": "3.68",
  "url": "https://www.goodreads.com/book/show/29432747-small-admissions"
}