{
  "title": "Cracking the Cube: Going Slow to Go Fast and Other Unexpected Turns in the World of Competitive Rubik's Cube Solving",
  "description": "A journalist and aspiring “speedcuber” attempts to break into the international phenomenon of speedsolving the Rubik’s Cube—think chess played at the speed of Ping-Pong—while exploring the Cube’s rise to iconic status around the globe and the lessons that can be learned through solving it.When Hungarian professor Ernő Rubik invented the Rubik’s Cube (or, rather, his Cube) in the 1970s out of wooden blocks, rubber bands, and paper clips, he didn’t even know if it could be solved, let alone that it would become the world’s most popular puzzle. Since its creation, the Cube has become many things to many one of the bestselling children’s toys of all time, a symbol of intellectual prowess, a frustrating puzzle with 43.2 quintillion possible permutations, and now a worldwide sporting phenomenon that is introducing the classic brainteaser to a new generation.In Cracking the Cube , Ian Scheffler reveals that cubing isn’t just fun and games. Along with participating in speedcubing competitions—from the World Championship to local tournaments—and interviewing key figures from the Cube’s history, he journeys to Budapest to seek a meeting with the legendary and notoriously reclusive Rubik, who is still tinkering away with puzzles in his seventies.Getting sucked into the competitive circuit himself, Scheffler becomes engrossed in solving Rubik’s Cube in under twenty seconds, the quasi-mystical barrier known as “sub-20,” which is to cubing what four minutes is to the the difference between the best and everyone else. For Scheffler, the road to sub-20 is not just about memorizing algorithms or even solving the Rubik’s Cube. As he learns from the many gurus who cross his path, from pint-sized kids to engineering professors, it’s about learning to solve yourself.",
  "genres": [
    "Nonfiction",
    "Puzzles",
    "Biography"
  ],
  "author": "Ian Scheffler",
  "average_rating": "3.88",
  "url": "https://www.goodreads.com/book/show/29430754-cracking-the-cube"
}