{
  "title": "A Great Place To Have A War: America in Laos and the Birth of a Military CIA",
  "description": "The untold story of how America’s secret war in Laos in the 1960s transformed the CIA from a loose collection of spies into a military operation and a key player in American foreign policy.In 1960, President Eisenhower was focused on Laos, a tiny Southeast Asian nation few Americans had ever heard of. Washington feared the country would fall to communism, triggering a domino effect in the rest of Southeast Asia. So in January 1961, Eisenhower approved the CIA’s Operation Momentum, a plan to create a proxy army of ethnic Hmong to fight communist forces in Laos. While remaining largely hidden from the American public and most of Congress, Momentum became the largest CIA paramilitary operation in the history of the United States. The brutal war, which continued under Presidents Kennedy and Nixon, lasted nearly two decades, killed one-tenth of Laos’s total population, left thousands of unexploded bombs in the ground, and changed the nature of the CIA forever.Joshua Kurlantzick gives us the definitive account of the Laos war and its central characters, including the four key people who led the operation—the CIA operative who came up with the idea, the Hmong general who led the proxy army in the field, the paramilitary specialist who trained the Hmong, and the State Department careerist who took control over the war as it grew.The Laos war created a CIA that fights with real soldiers and weapons as much as it gathers secrets. Laos became a template for CIA proxy wars all over the world, from Central America in the 1980s to today’s war on terrorism, where the CIA has taken control with little oversight. Based on extensive interviews and CIA records only recently declassified, A Great Place to Have a War is a riveting, thought-provoking look at how Operation Momentum changed American foreign policy forever.",
  "genres": [
    "History",
    "Nonfiction",
    "War",
    "Asia",
    "Politics",
    "American History",
    "Military Fiction"
  ],
  "author": "Joshua Kurlantzick",
  "average_rating": "3.90",
  "url": "https://www.goodreads.com/book/show/29430865-a-great-place-to-have-a-war"
}