{
  "title": "Some Lucky Woman: Jana's Story",
  "description": "Some lucky women meet the man of their dreams and live happily ever after. Some lucky women focus on a career and make their own happily ever after. And then some women wake up after fifteen years of marriage and discover that their luck just ran out ... right into the arms of another woman.Jana Embers isn't one to sit back, though. The first thing Jana realizes she needs to do is empty the joint bank account, then she's thinking she might take a tire iron to her soon-to-be-ex-husband's truck. After that, she's not sure what she'll do ... Maybe she'll adopt a cat.After her divorce and a few too many crummy dates, Jana decides she doesn't need a man. A perfectly sized and shaped device and writing about the perfect hero will more than suffice. Determined to share her philosophy, she pens You Don't Need a Man, encouraging women everywhere to go out and experience life instead of waiting for a man to complete them.Three years later, Jana has a New York Times bestseller and a contract for a movie adaptation, but she also has a shoulder injury, which has put a crimp in her new carefree lifestyle. Worse yet, she can't write. Her only hope is Dr. Adrian Kijek, a renowned physical therapist who hates her simply because she wrote a book about not needing a man, or so she thinks ...WARNING: Although there are many adult situations in Some Lucky Woman, if say ... something crazy happened and a famous producer adapted this contemporary women's fiction into a movie, it would have a PG-13 rating. There are no erotic scenes, no graphic violence, and while there are a few allowed-on-TV curse words, there aren't a plethora of gratuitous foul words. Oh, and if you were looking for a cliffhanger, you won't find that here either. Please proceed at your own risk.",
  "genres": [
    "Romance",
    "Contemporary",
    "Contemporary Romance",
    "Amazon",
    "Audiobook",
    "Chick Lit"
  ],
  "author": "Carmen DeSousa",
  "average_rating": "3.87",
  "url": "https://www.goodreads.com/book/show/29435056-some-lucky-woman"
}