{
  "title": "Seeing Stars Anthology",
  "description": "Enjoy six Sci-Fi stories of the erotic kind all in one volume!\"Bodies of Light\" by Lisabet Sarai\nLove travels faster than light.\nPhysicist Dr. Christine Monroe has devoted her lonely life to research on hyper-space travel.Her continued failure leads her to sign on to the Archimedes, a sub-light-speed mission aimed at establishing a colony in the Sirius B system. Waking from suspended animation, she discovers that the ship is wildly off course and the rest of the crew are dead due to equipment failure.At first she thinks the two handsome strangers who show up on the ship are figments of her imagination - erotic hallucinations created by isolation and stress. However, Alyn and Zed are solid, real, and ready to sacrifice their lives for the strong woman they’ve found stranded in deep space.As her ship begins to disintegrate, Christine must choose between the planet she was sent to save and the two alien beings she’s come to cherish.Reader Advisory: This book contains ménage and anal sex.---\"The Sevarian Way\" by Justine ElyotIn space, no-one can hear you scream. So you can spank as hard as you like.Commander Azed Paul and Ensign Suka Demontel are space anthropologists in a future civilisation where kink is illegal. Both have learned to repress their natural sexuality, but Suka's undergraduate work on the ancient practice of BDSM has captured Paul's professional attention, and his less academic interest too.This makes her the perfect crew member to accompany him to the surface of Paladium Three, a dead planet where old-fashioned service and discipline were woven into the fabric of life.There might not be any life forms left there, but what Paul and Suka discover is fascinating evidence of a culture that both realise might have suited them very well...The temptation to experiment, risk-free, with the kinks they have been denied all their adult lives, proves too much for the space explorers and they give their fantasies free rein.But will this be a unique, never-to-be-repeated experience, or will Paul and Suka find a means to fully embrace the Sevarian Way?Reader Advisory: This book contains BDSM.---\"Europa Europa\"by KS AugustinThe Company appreciates its genetically modified humans . . . as long as they don't get any smart ideas.Salvia is a genetically modified human, at home in the oceans of Jupiter's moon, Europa. Intelligent, young, lonely, she demands that the mysterious \"company\" that employs her send a companion or she'll never work for them again. With no choice, the company creates Rhus, a young brash male. But a relationship that begins with mistrust ends up forging deep links between the pair and they look forward to a happy life together.Unfortunately, Salvia's tactic of holding the company to ransom was not well received. While they may have introduced Rhus to Europa, the company are mulling over other options. Options that include the very real possibility of death for Salvia. Or Rhus. Or both.Reader Advisory: This book is best read in a hot-tub! Preferably, with some company.---\"Star Struck\"by Buffi BeCraftSmart girls know two things . . . Don't pick up hitch-hikers - and - avoid dangerous men.Down-on-her-luck trader captain, Drew Roberts’ fascination for dangerous men is equal to her need for a crew. When the sexy alien kith pair, Ashwin and Kormec wanders onto her ship with the offer of passage for repairs, she knows trouble is not far behind. But a girl’s gotta do, what a girl’s gotta do—And getting back at her rival, the kith Captain Larissa by taking these two on, seems like a pretty good idea at the time.On the run, Ashwin and Kormec, know that the best way to avoid a political marriage is one of another kind. Is Drew Roberts ‘the one’ for them? Can she survive an encounter with Ashwin’s mother, the fierce Captain Larissa? The three of them may generate enough heat to power a sun, but question is, will they survive it?Reader Advisory: This book contains scenes of M/F/M intimacy, M/M play, and ménage sex.---\"To Bed A Goddess\"by Lizzie Lynn LeeSometimes, a Goddess is more human than a human is . . .Chosen by Gods and cursed by fate, Amaranth, the sacred virgin of the Sun Temple, is destined to consort the ruthless warlord Shanrakhan, as his war prize. But before Shanrakhan could take her virginity, his enemies kidnap Amaranth and pierce her heart with the Star of Hecave, an ancient amulet that freezes her in a dreamless slumber for thousands of years…Graeme Darin, an ex-admiral of Imperial Arcova Fleet is on the run when he realises the ship he and his crew stole carries a secret archaeological relic—a tomb of a fabled goddess. Out of curiosity, Graeme removes the amulet. To his surprise, the cold body of the goddess springs back to life.With the Imperial Armada on their tail, Graeme faces problematic dilemmas between keeping his crew safe and his growing attraction to Amaranth. But can a mortal man resist a Goddess’ seduction?---\"Captain Kate\" by Sophie AngmeringCaptain Kate Thorn makes a habit of bending the rules to suit her purposes, but then she meets two men who simply break them to get what they want.Captain Katherine Thorn has one of the toughest reputations in the Galaxy Elite Fleet. Her problems start when she mistakes two powerful diplomats for Rim pirates, and attempts to ensure their silence regarding their rescue by using sexual blackmail.But Kate has never come across anyone like these two men before, two men who are prepared to use every method at their disposal to ensure payback, and they want to get her back in their power and in their bed.Reader Advisory: This book contains scenes of M/M intimacy, spanking, questionable consent, and ménage sex.",
  "genres": [
    "Anthologies",
    "Science Fiction",
    "Science Fiction Romance"
  ],
  "author": "Lisabet Sarai",
  "average_rating": "3.97",
  "url": "https://www.goodreads.com/book/show/11834802-seeing-stars-anthology"
}