{
  "title": "Spirits of the Bayou",
  "description": "EVIL HAS A FACE Someone is taking the children of New Orleans. For the last eight months on the night of the full moon there has been an abduction. No bodies have been found. No ransom demands made. Poor or Rich. Black or White. Boy or Girl. The kidnapper does not play favorites. PRAY In this prequel to Spirits Among Us, nineteen year-old Jon-Luc Boudreaux is trying to manage his gift. He’s a psychic medium, in other words he sees the dead. They appear to him like living breathing people. At times it’s hard to know the difference. One night he is visited by the ghost of a young girl named Charlotte. Her message is simple; Save the children. THAT EVIL Jon-Luc has no idea how to do that. He’s not a cop. He knows nothing about finding missing kids. He tries to ignore her, but Charlotte won’t leave him alone until he promises to help. Since her visits started, he’s had some very disturbing visions. When the signs begin to point toward Voodoo, he has no choice but to find an expert. DOES NOT Celestine Glapion is a Voodoo Priestess and a descendant of the great Marie Luveau. The minute Jon-Luc walks into her family’s shop she remembers him, but he has no memory of her. So when Mama Arelia tells her she must help with this crisis, she’s reluctant to work side-by-side with Jon-Luc. But she’ll do anything for the sake of those innocent lives. FIND YOU Their journey takes them to the underbelly of New Orleans where dark magic lives. Jon-Luc escapes death not once, but twice and still he pushes on. Knowing time is running out, the kidnapper speeds up the schedule. Now the children’s lives hang in the balance and only Jon-Luc holds the key to their survival. Can he rescue them in time?",
  "genres": [
    "Horror",
    "Romance",
    "Mystery",
    "Thriller",
    "Paranormal",
    "Ghosts",
    "Fiction"
  ],
  "author": "Morgan Hannah MacDonald",
  "average_rating": "4.24",
  "url": "https://www.goodreads.com/book/show/29454777-spirits-of-the-bayou"
}