{
  "title": "EUROPA Awakenings",
  "description": "Second Edition: Significant changes were made from the first edition. When the Oonocks sank their golden city of Atlantis beneath the ocean, only the words of Plato gave testimony of its existence. Now learn a new thought of who the Atlantians were and why they had to sink their city that eventful night. Find out why 6000 years ago, a race known as the Oonocks left their beautiful lilac, waters of Jupiter's ice moon Europa to begin a new life on Earth. Discover the real Atlantians. Europa is a nineteen year old human female who has never heard of the Oonocks. And, although she's heard of the legend of Atlantis, she's never giving the story much thought. Europa: Awakenings begins with Queen Medaron's departure to the world above, to the land of air and land. She is with child and no Oonock child has survived past the age of ten for almost a thousand years. So King Enok and Queen Medaron make the difficult decision that their daughter, Europa, will be born on land as a human, never to know the truth of who she is. Twenty years have passed since Queen Medaron came above, and Europa is fast approaching her twentieth birthday. Her life has been fairly normal, as normal as any royal child's can be. But her safety is an illusion, for their enemy has returned and is stalking the future queen, waiting for his chance to end her life. The day after her birthday, Europa's perfect world is destroyed when JeffRa assassinates her mother, believing she was Europa. She discovers a secret attic above her mother's bedroom where she finds picture of her parents hundreds of years old. But the most terrifying find is her mother's diary. Inside, Queen Medaron wrote that Europa would be born human and never know who she really was. Europa embarks on a journey of discovery, a journey of many dangers as JeffRa chases her, determined to personally end her life. Along the way, Europa will lose almost everyone and everything she loves. Somehow she must discover the truth of her past and the queen inside her. She must learn and accept the true story of Atlantis, the Oonock race and what lives beneath Europa's ice if she is to survive.",
  "genres": [],
  "author": "P.R. Garcia",
  "average_rating": "3.89",
  "url": "https://www.goodreads.com/book/show/29447390-europa-awakenings"
}