{
  "title": "Wyckyd Heart",
  "description": "In a world just centuries recovered from a nigh-forgotten apocalypse now only called 'the dark days', humans and the shifters they created struggle to co-exist as they seek a balance between civilization and animal nature...  Danni Wyck hates being an omega. What is supposed to be a gift—a powerful empathy that allows him to see into the hearts of other wolves, and even project his own feelings there—has been nothing but a curse since he was sixteen years old, when his blossoming gift and youthful naivety cost him dearly. Now eighteen and free of the city life, he finally has the chance to live among the supposedly more civilized shifters enrolled at Silver State University, a nearly exclusively shifter college that boasts the motto Bestiam Ascendentem Desuper—Rising Above the Beast. But no matter how progressive the college may be, not everyone believes that a shifter can be more than his nature and Danni may find the past repeating itself in a house full of hormonal, rowdy and raunchy beta wolves who seem to see little Danni Wyck as fresh meat in their midst. The only exception among them seems to be the fraternity’s current president, alpha wolf Cam Heartford, who makes Danni’s heart race from the moment they meet. But how can Danni trust his own feelings, or anyone else’s, when Cam doesn’t even know what Danni really is?  Cam Heartford struggles daily against the hard-wired aggression of his high strung alpha wolf. Even with the training afforded by the University, his path back to the reservation to take over for his father as alpha of the Silver River Pack seems to be closing in on him, and he’s beginning to think it may be his only real option in life. That is until he meets the newest member of Delta Rho Tau fraternity, little Danni Wyck; a runt of a beta that Cam feels an immediate instinct to protect from the hungry jaws of his horny beta frat brothers. But there’s something strange about Danni. Cam’s attraction to the little wolf barely makes sense to him; nor does the strange, rare peace he feels in Danni’s presence. When Danni’s nature reveals itself, Cam finds himself torn between his nature and his destiny, unsure which will win out or if he can even trust his own feelings.  While these two circle one another, each struggling against their natures and their pasts, the principles that they hope to transcend may be the very things that draw them inexorably together as passions run hot in this 48,000 words paranormal romance by debut author Remiel Kane.",
  "genres": [
    "Romance",
    "Shapeshifters"
  ],
  "author": "Remiel Kane",
  "average_rating": "3.33",
  "url": "https://www.goodreads.com/book/show/29450305-wyckyd-heart"
}