{
  "title": "Quinton's Crucible",
  "description": "As it so often was, my choice was obedience, or pain.When they held the whip, or the cane, or the crop, my eyes always focused on the hands. The way the fingers caressed the braided leather of a handle, the way a maroon painted nail would catch the light as the cane sliced through the air, my bound body waiting to be reacquainted with its old friend agony.I knew what they wanted, what they expected. But I never cooperated. They’d never make me give it to them.I always chose the pain. No matter how bad it was — and there had been times that it was awful — it still paled next to the bitterness of obedience, of bowing.To her.Never.Equally wordlessly, they would string me up by the wrists, and I would wait, in silence, whether gagged or not.They liked to make me wait. But it wouldn’t work either. I would endure, and I would prevail.The door to my cell opened, the subtle zephyr of air across my chilled skin bringing me back to the present. I straightened my back, raising my chin. It was an unspoken expectation that I was to look at the floor in their presence, but I wasn’t about to meekly conform to their insane demands. It would cost me, I knew, but nothing came without cost in this place. I would show them I was no cowering dog.I would endure.The sound of the heels on the smooth concrete always echoed, and as a result I could never tell how many of them had entered, how many would witness my ordeal, participate in it, savor it.Then the heels appeared in the circle of light shining down upon me. So, it was to be only one tormentor this time. I dreaded it when it was only one, for oddly, it always lasted longer, the pain was always worse.But I would endure.“Do you know how long you’ve been in this hole?”My blood ran cold at the sound of the silky smooth voice, the cool confidence, the edge in her slightly clipped cadence. It was her. I was certain of it.Anna.I was afraid, but she'd never know it. She might make me cry out as the fire slashed across my flesh, but I’d never let her see my fear.The cane struck without warning. It was her way. I’d come to know it well.I would cry out before the end, a seething mass of marks burning across my skin, my back striped with fire. As always, I'd try to hold back the tears. I wouldn’t let her see them. Not ever. I would not scream. I would not break.I would endure.My punishment was always merciless, but that wasn’t the worst of it. It was what happened afterward.Those words.She whispered them against my welted skin, as my muscles trembled and spasmed, pain wracking my shoulders, the stripes upon my back like flames licking my flesh.It wasn’t the lash that I feared.They were the words she spoke to me, before leaving me to my agony, my solitude. Each time, they threatened to undo me — and each time I heard them, they were more seductive.“Surrender to me.”---Finally, the harrowing story of Quinton Trask's ordeal can be told. This dark erotic romance can be read as a stand-alone, but the experience will be much richer if the reader has previously read Her Troika , Book #2 in the Dominion Trust series.",
  "genres": [
    "BDSM",
    "Erotica",
    "Dark",
    "Dark Romance"
  ],
  "author": "Trent Evans",
  "average_rating": "4.35",
  "url": "https://www.goodreads.com/book/show/29450972-quinton-s-crucible"
}