{
  "title": "Back to Black: Amy Winehouse's Only Masterpiece",
  "description": "(Book). Be a fly on the wall of sound: get the inside history and behind-the-scenes events in the making of a masterpiece. In this refreshing book which focuses solely on Amy Winehouse's musical artistry, stylistic influences, and creative collaborations with great producers and musicians, instead of her personal problems Donald Brackett explores pertinent questions about the importance of pop music in contemporary culture. In this incisive and fascinating study of Amy Winehouse's second, and last, album (released in 2006), Back to Black, he opens the door not only to the full experience of this great record but also explores the seductive sonic hook that pop artists always strive for and unearths what makes the record unique, influential, and unforgettable. He reveals the creative steps in its inception and production, the technical virtuosity that makes it special, and why it deserves to be considered a pop classic. In an album that continually strips down the branches of popular music to draw from its muscular trunk, Amy Winehouse (with significant help from producers Mark Ronson and Salaam Remi) used the deep longing of '60s girl-group pop, such as the Ronettes, to fuel the torch sound she perfected in her debut. Brackett fully considers Winehouse's legacy ten years after her multi-Grammy winning album exploring the origins of a global cultural phenomenon by examining her roots as a storyteller; studying her swift arrival as a demonic pop diva; the crucially important creative role played by her gifted producers in the studio; the historical musical influences on her style; the soul magic of her superb backup band, the Dap-Kings;; her live performance style onstage; and her magnetic public image as a video star. Back to Black is also explored song by song in an appreciation of its status as a true pop-art artifact. In the end, it's the songs that make up Back to Black which go far beyond our potentially prurient fascination with the unique singer's early demise five years ago and instead bring vibrantly to life the surprising pop majesty she personified.",
  "genres": [
    "Music"
  ],
  "author": "Donald Brackett",
  "average_rating": "3.42",
  "url": "https://www.goodreads.com/book/show/29448096-back-to-black"
}