{
  "title": "122 Rules",
  "description": "The assassin lines her up in his crosshairs. He gently eases back on the trigger.Just one more question before he completes this assignment: If he kills her, will he also be killing himself?In his black-and-white world, Sam Bradford—former Marine turned government assassin—finally sees a speck of gray. He has always followed orders without question, but his latest assignment threatens to disrupt the precision of his universe and may either sever or redeem his last remaining sliver of humanity.Using his mastery of the 122 Rules of Psychology, Sam hunts down everyone The Agency sends him to find and eliminates them. Just as he has his rifle scope focused on his latest victim, Monica Sable, a SoCal girl entangled with the mob, his long-dormant conscience reappears for a final performance—one last-ditch effort to save the sinking ship of Sam’s soul. He’s killed innocents before but tarries on pulling the trigger this time.When Monica escapes his crosshairs and fumbles her way across the country in a pathetic attempt to elude capture, Sam gives chase. But he’s not the only one after her. Ruthless henchmen, hired by the mob, froth like bloodhounds and nip at Monica’s heels. Now Sam is faced with a choice: turn his back on the rules and jeopardize his way of life by helping her, or join the pack and rip her to shreds.What readers on Amazon and Goodreads are saying:★★★★★ \"Deek Rhew might be some bizarre love child of a sexy Alfred Hitchcock and a funny Robert Ludlum.” ★★★★★ \"122 Rules is a fast-paced thrill-ride, filled with rich characters living in an expertly woven world of mystery and suspense.\" ★★★★★ \"The perfect, fast-paced novel for fans of kick-butt heroines, creepy killers, and getting caught in the wrong place at the wrong time. An absolute must-read!\" ★★★★★ \"This is a moment in your life without comparison or equal because you are about to embark on a journey that will undoubtedly become one of those memorable experiences you tell all your friends about.\" ★★★★★ \"With a pinch of humor and multiple twists of violent action, 122 RULES is a page-turning thriller.\" ★★★★★ \"Eloquent novel of suspense, danger, romance, friendship, crisis, emotional blackmail, and adventure.\" ★★★★★ \"This thriller kept me glued to the pages with a likable heroine, great dialogue, villain that totally creeped me out.”★★★★★ \"What a wild ride!” ★★★★★ \"Wow, wow, wow! Rhew's story grips you from the start and doesn't let go.” ★★★★★ \"I could not put this book down.” ★★★★★ \"This book was absolutely riveting - a political thriller, a psychological thriller, a mystery, and so much more.” ★★★★★ \"Simply Unputdownable...” ★★★★★ \"Worth reading countless times.” ★★★★★ \"A nitro-crazy car ride from beginning to end.” ★★★★★ \"Will grab you and take you for a wild ride!” ★★★★★ \"Lock and load people, strap on your protective vest, and open this book with extreme care.” ★★★★★ \"There is danger, romance, friendship, adventure and explosions! It doesn't get much better than that!”",
  "genres": [],
  "author": "Deek Rhew",
  "average_rating": "4.15",
  "url": "https://www.goodreads.com/book/show/29457248-122-rules"
}