{
  "title": "Tranny: Confessions of Punk Rock's Most Infamous Anarchist Sellout",
  "description": "ONE OF BILLBOARD'S \"100 GREATEST MUSIC BOOKS OF ALL TIME\"The provocative transgender advocate and lead singer of the punk rock band Against Me! provides a searing account of her search for identity and her true self. It began in a bedroom in Naples, Florida, when a misbehaving punk teenager named Tom Gabel, armed with nothing but an acoustic guitar and a headful of anarchist politics, landed on a riff. Gabel formed Against Me! and rocketed the band from its scrappy beginnings-banging on a drum kit made of pickle buckets-to a major-label powerhouse that critics have called this generation's The Clash. Since its inception in 1997, Against Me! has been one of punk's most influential modern bands, but also one of its most divisive. With every notch the four-piece climbed in their career, they gained new fans while infuriating their old ones. They suffered legal woes, a revolving door of drummers, and a horde of angry, militant punks who called them \"sellouts\" and tried to sabotage their shows at every turn. But underneath the public turmoil, something much greater occupied Gabel-a secret kept for 30 years, only acknowledged in the scrawled-out pages of personal journals and hidden in lyrics. Through a troubled childhood, delinquency, and struggles with drugs, Gabel was on a punishing search for identity. Not until May of 2012 did a Rolling Stone profile finally reveal it: Gabel is a transsexual, and would from then on be living as a woman under the name Laura Jane Grace. Tranny is the intimate story of Against Me!'s enigmatic founder, weaving the narrative of the band's history, as well as Grace's, with dozens of never-before-seen entries from the piles of journals Grace kept. More than a typical music memoir about sex, drugs, and rock 'n' roll-although it certainly has plenty of that-Tranny is an inside look at one of the most remarkable stories in the history of rock.",
  "genres": [
    "Nonfiction",
    "Music",
    "Memoir",
    "Queer",
    "LGBT",
    "Transgender",
    "Biography"
  ],
  "author": "Laura Jane Grace",
  "average_rating": "4.32",
  "url": "https://www.goodreads.com/book/show/29467305-tranny"
}