{
  "title": "Midnight",
  "description": "Sister Souljah, the hip-hop generation's number one author and most compelling storyteller, delivers a powerful story about love and loyalty, strength and family. In her bestselling novel, The Coldest Winter Ever, Sister Souljah introduced the world to Midnight, a brave but humble lieutenant to a prominent underworld businessman. Now, in a highly anticipated follow-up to her million-selling masterpiece, she brings readers into the life and dangerously close to the heart of this silent, fearless young man.  Raised in a wealthy, influential, Islamic African family, Midnight enjoys a life of comfort, confidence, and protection. Midnight's father provides him with a veil of privilege and deep, devoted love, but he never hides the truth about the fierce challenges of the world outside of his estate. So when Midnight's father's empire is attacked, he sends Midnight with his mother to the United States.  In the streets of Brooklyn, a young Midnight uses his Islamic mind-set and African intelligence to protect the ones he loves, build a business, reclaim his wealth and status, and remain true to his beliefs.  Midnight, a handsome and passionate young man, attracts many women. How he interacts and deals with them is a unique adventure. This is a highly sensual and tremendous love story about what a man is willing to risk and give to the women he loves most. Midnight will remain in your mind and beat in your heart for a lifetime.  Her \"raw and true voice\" (Publishers Weekly) will both soothe and arouse you. In a beautifully written and masterfully woven story, Sister Souljah has given us Midnight, and solidified her presence as the mother of all contemporary urban literature.",
  "genres": [
    "Fiction",
    "African American",
    "Urban",
    "Romance",
    "Young Adult",
    "Adult Fiction",
    "Drama"
  ],
  "author": "Sister Souljah",
  "average_rating": "4.13",
  "url": "https://www.goodreads.com/book/show/2945983-midnight"
}