{
  "title": "Griddles: Coded Coloring Pages for KIDS of All Ages",
  "description": "Lorraine Brodek has put together some of the most entertaining and challenging coloring books. Each page is a game, a puzzle, and a design (3 kinds of fun in 1) that you create by following the code and filling in the blank grid . . . thus a grid riddle (hence, \"Griddle\").For the benefit of kids, \"chart art\" pulls them away from electronic screens, both big and small. They can enjoy pencils and colors in their hands, while they create pictures that evolve on paper. \"Griddles\" will get their thought process going, along with problem solving, and discovery - not to mention hand-eye coordination and motor development. It's also a learning tool for numbers and letters on the printed page.For adults who enjoy a variety of art projects, chart art is like watching a picture come to life. They will become engrossed and focused while following the codes and clues to solve the colorful \"Griddles.\" But wait! There's more - the finished designs can also be translated into many types of stitchery activities. And, for seniors, chart art is a type of cognitive therapy for concentration, it's good for dexterity, and it's just plain fun. Plus, the books make great gifts for grandchildren!There are blank pages included between designs that absorb ink or gel in case you like to use pens, and the extra paper is a great way to test your colors. In addition, there are some extra blank grids in the back, as well as a line guide to help you follow the grids, along with black and white solutions, but try not to peek. Vol. 1 (older kids' small-grid version) has 20 designs, and Vol. 2 (younger kids' large-grid version) has 22 designs. Together, they provide fun for the entire family.I'd love it if you'd be willing to provide a review. Thank you so much for becoming a \"Griddler!\"",
  "genres": [],
  "author": "Lorraine Holnback Brodek",
  "average_rating": "4.25",
  "url": "https://www.goodreads.com/book/show/29460532-griddles"
}