{
  "title": "Band Fags!",
  "description": "\"Ever since I first heard that Lionel Richie and Diana Ross song, 'Endless Love, ' all I've wanted is to find The One. Someone to love. Who will love me back.\" September, 1982. John Cougar's \"Jack and Diane\" is on endless radio rotation, and Dallas and Dynasty rule the ratings. Jack Paterno is a straight-A student living in the Detroit suburb of Hazel Park, with his own Atari 5200, a Beta VCR, and everything a seventh-grader could ask for. The only thing he has in common with foul-mouthed Brad Dayton, who lives on the gritty south side near 8 Mile, is that both are in Varsity Band. Or maybe that's not the only thing. Because Jack is discovering that while hanging around with girls in elementary school was perfectly acceptable, having lots of girl friends (as opposed to girlfriends) now is getting him and Brad labeled as Band Fags. And Jack is no fag. Is he?As Jack and Brad make their way through junior high and then through Hazel Park High School, their friendship grows deeper and more complicated. From stealing furtive glances at Playgirl to discussing which celebrities might be like that, from navigating school cliques to dealing with crushes on girls and guys alike, Jack is trying to figure out who and what he is. He wants to find real, endless love, but he also wants to be popular and \"normal.\" But, as Brad points out, this is real life--not a John Hughes movie. And sooner or later, Jack will have to choose.Filled with biting wit and pitch-perfect observations, Band Fags is an exhilarating novel about lust and love, about the friendships that define and sometimes confine us, and about coming of age and coming to terms with the end of innocence and the beginning of something terrifying, thrilling, and completely unpredictable.Advance praise for Band Fags! \"For those of us who came of age in the 80s, reading Frank Anthony Polito's novel is like being teleported back to high school. Filled with pop culture references that will have you saying, 'I remember that!, ' this is a love letter to a time when happiness was a pair of Calvin Klein jeans, and every heartbreak could be fixed by listening to your Bonnie Tyler or REO Speedwagon albums. Most important, though, it is a portrait of a friendship between two boys struggling to find themselves without losing each other.\"--Michael Thomas Ford, author of Last Summer \"With the Motor City running on empty in Reagan's America, Frank Anthony Polito's characters dance their mystery dance of teenage longing as if Motown never left for California. Sexy, funny, and wiser than it wants to be, Band Fags! pulses with a ragged beauty and bounces to its beat. I give it a 98.6.\" --Thorn Kief Hillsbery, author of What We Do Is Secret\"More than just a novel, Band Fags! is a virtual time machine that transports you smack dab into the cheesy heart of the 80's. It's like a queer Wonder Years as it follows Brad and Jack's memorable journey through high school hell. Screamingly funny, surprisingly charming and, ultimately, truly moving, it's a fresh take on the importance of friendship during the worst/best years of your life.\" --Brian Sloan, A Really Nice Prom Mess and Tale of Two Summers\"A consistently hilarious story of the best-friendship we all seem to have had, set in a time we can never seem to forget -- the totally awesome '80s -- Band Fags! never misses a beat in its affectionate, moment-by-moment chronicling of the complicated journey we take from cradle to closet to what lies beyond.\" --Matthew Rettenmund, author of Boy Culture\"Band Fags! is like the gay teen flick John Hughes never got around to making. Let's face it, there's a Band Fag in all of us and Frank Anthony Polito has his on speed dial. This book is a sweet, funny, deeply felt valentine to the wonder/horror of coming of age in the 1980's. You might just pee your parachute pants.\" --Den",
  "genres": [
    "LGBT",
    "Young Adult",
    "Gay",
    "Fiction",
    "Queer",
    "M M Romance",
    "Historical"
  ],
  "author": "Frank Anthony Polito",
  "average_rating": "3.78",
  "url": "https://www.goodreads.com/book/show/2946318-band-fags"
}