{
  "title": "Tales from the Lake Vol. 2",
  "description": "The new breed of legends continues…If you came here to read short stories about tranquil lakes, run to the nearest exit. Run as far away as you can from Ramsey Campbell, Jack Ketchum, Edward Lee, and our array of international voices.Tales from The Lake volume two also includes the three winners from Crystal Lake Publishing’s Tales from The Lake Horror Writing 1 Descending by John Whalen2 Forever Dark by Jonathan Winn3 Ripperscape by Vincenzo BilofBeneath this lake you’ll find nothing but mystery and suspense, horror and dread. Not to mention death and misery – tales to share around the campfire or living room floor. Dive beneath a frozen lake with Rena Mason’s “Winter’s Dollhouse”; allow Tim Lebbon to introduce you to “The God of Rain”; don’t go into the lake when Jim Goforth takes you to the haunting sit of “Lago de los Perdidos”; and never get in an elevator again with John Whalen’s award-winning “Descending.”So dive on in.The water’s just…right.Interview with the So what makes Tales from The Lake so special?Ben As a Legends and up-and-comers in the field of horror consistently knock each volume out of the ball park. It’s a great anthology. As a Aside from sharing the pages with some of the best writers in the biz? The open-theme affords me a broader canvas to write. And, of course, the recognition!Raven Publisher Joe Mynhardt and his team of genre enthusiasts strive to bring the reader only the highest quality short fiction in the Tales From The Lake series. Whether the author is well established name or a bright future star, excellence and innovation is always foremost. This is a publishing house with great integrity and passion, a deep-rooted love of horror and total respect for both writer and reader. And no…I do not work for their PR department! This is my genuine experience as both contributor and reader of Crystal Lake books.Tell us more about your story?Lisa It was inspired by two separate 1) I enjoy weird westerns and wanted to try one; and 2) I was interested in writing something about a succubus, and I had this would a gay man be affected by a supernatural temptress who presents as an exotic woman? I started doing a little research on the Old West (train lines, towns, gunslingers, etc.), and the story started to coalesce from there.Why should readers give this series a try?Ben Everyone loves an end of the world story, right?Raven The best reason of all, meticulously produced books packed with intriguing stories from an international collection of great writers. There are many horror anthologies available now, with a resurgence of enthusiasm for short fiction. Sadly not all are worth bothering with, to be brutally honest! A reader is in safe hands with a Tales from The Lake volume. Crystal Lake is fast becoming synonymous for high quality production and wonderful story telling.Proudly brought to you by Crystal Lake Publishing - Tales from the Darkest DepthsTales from The Lake eBook Horror short storiesHorror anthologiesDark FictionSpeculative Fiction",
  "genres": [
    "Horror",
    "Short Stories",
    "Anthologies"
  ],
  "author": "Emma Audsley",
  "average_rating": "3.91",
  "url": "https://www.goodreads.com/book/show/29481260-tales-from-the-lake-vol-2"
}