{
  "title": "Golda",
  "description": "The first female head of state in the Western world and one of the most influential women in modern history, Golda Meir was a member of the tiny coterie of founders of the State of Israel, the architect of its socialist infrastructure, and its most tenacious international defender. Her uncompromising devotion to shaping and defending a Jewish homeland against dogged enemies and skittish allies stunned political contemporaries skeptical about the stamina of an elderly leader, and transformed Middle Eastern politics for decades to follow. A blend of Emma Goldman and Martin Luther King Jr. in the guise of a cookie-serving grandmother, Meir was a tough-as-nails politician who issued the first prescient warnings about the rise of international terrorism, out-maneuvered Richard Nixon and Henry Kissinger at their own game of realpolitik, and led Israel through a bloody war even as she eloquently pleaded for peace. A prodigious fundraiser and persuasive international voice, Golda carried the nation through its most perilous hours while she herself battled cancer. In this masterful biography, critically acclaimed author and Pulitzer Prize–nominated journalist Elinor Burkett looks beyond Meir's well-known accomplishments to the complex motivations and ideals, personal victories and disappointments, of her charismatic public persona. Beginning with Meir's childhood in virulently anti-Semitic Russia and her family's subsequent relocation to the United States, Burkett places Meir within the framework of the American immigrant experience, the Holocaust, and the single-mindedness of a generation that carved a nation out of its own nightmares and dreams. She paints a vivid portrait of a legendary woman defined by an iron resolve coupled with magnetic charm, an utter ordinariness of appearance matched to extraordinary achievements, a kindly demeanor that disguised a stunning hard-heartedness, and a complete dedication to her country that often overwhelmed her personal relationships. To produce this definitive account of Meir's life, Burkett mined historical records never before examined by any researcher, and interviewed members of Meir's inner circle, many going on record for the first time. The result is an astounding portrait of one of the most commanding political presences of the twentieth century—a woman whose uncompromising commitment to the creation and preservation of a Jewish state fueled and framed the ideological conflicts that still define Middle Eastern relations today.",
  "genres": [
    "Biography",
    "Nonfiction",
    "History",
    "Politics",
    "Israel",
    "Jewish",
    "Womens"
  ],
  "author": "Elinor Burkett",
  "average_rating": "4.01",
  "url": "https://www.goodreads.com/book/show/2948312-golda"
}