{
  "title": "Mary Fields aka Stagecoach Mary",
  "description": "This is the story of Mary Fields, 'Stagecoach Mary', who got her nickname at the turn of the 20th Century. She earned this nickname by working for the United States Postal System delivering the United States Mail through adverse conditions that would have discouraged the most hardened frontiersmen of that period. All by herself, she never missed a day for 8 years, carrying the U. S. Mail and other important documents that helped settle the wild open territory of central west Montana. Mary had no fear of man, nor beast, and this sometimes got her into trouble. She delivered the mail regardless of the heat of the day, cold of night, wind, rain, sleet, snow, blizzards, Indians and Outlaws.Mary was 6 feet tall, and weighed over 200 pounds, and even with 'those' extraordinary extremes, there were two more facts that made 'her' history. Mary was the second woman in 'history' to carry the U. S. Mail, however, even that was a matter of simplicity, for a fact, she was a Negro Woman, and the only 'Negro', for hundreds and hundreds of miles when she first arrived in Montana.This feature story covers Mary's colorful life, from the plantation where she was born a slave in 1832, to the famous Steamboat race between the \"Robert E. Lee\" and the \"Natchez\" on the Mississippi River, to her death in Cascade, Montana, 1914.Stagecoach Mary was a cigar smoking, shotgun and pistol toting Negro Woman, who even frequented saloons drinking whiskey with the men, a privilege only given to 'her', as a woman. However, not even this fact, sealed the credentials given to her, her credentials boasted that, 'she could knock out any man with one punch', who stepped upon her womanhood, a claim she proved true.Author_Erich Hicks, founder of Alpha Wolf Productions Inc., is an acclaimed Special Effects Coordinator, Producer and Writer, with over 20 years of experience in the entertainment industry. The company is an independent production outlet that develops, writes, and produces feature film and television content. Historically, Erich is the first African-American/Black to receive a Special Effects Pyrotechnic Operator's 1st class Master's License in the Motion Picture Industry. Thus, he is expertly qualified to produce and direct action sequences, stunts and explosions to achieve a realistic scene.As a writer, Erich's first novel, Rescue at Pine Ridge, released in December 2008. The novel is a historical narrative, depicting the all-Black 9th Calvary. Known as the US military's famed 'Buffalo Soldiers', which helped settle the American West in the late 1800's. Erich has completed an accompanying screenplay for a TV mini-series, Trilogy, and Epic Feature, and has garnered support from some of HOLLYWOOD'S acclaimed Industry Producers/Directors/and Actors. Dedicated to exploring the history of African-Americans/Blacks and shattering stereotypes, his Alpha Wolf Productions, Inc. has also developed a feature film documentary, Soul on a Wave which exposes the life and times of surfers of color.Please visit the webpage for more information alphawolfprods.com and for a comprehensive resume at imdb.com/name/nm0902436 Mary Fields, Mail, African American, Black History, Montana, Stagecoach, Outlaws, Cowboys, Postal System, Historical, 1914, 1832",
  "genres": [
    "Biography"
  ],
  "author": "Erich Martin Hicks",
  "average_rating": "3.96",
  "url": "https://www.goodreads.com/book/show/29484418-mary-fields-aka-stagecoach-mary"
}