{
  "title": "The Guns of August / The Proud Tower",
  "description": "One of the best-known historians of her time, Barbara W. Tuchman distilled the complex interplay of personalities and events into gripping narratives that combine lucid scholarship with elegant literary art. A shrewd portraitist, she laid bare the all-too-human failures of leaders caught in the pull of historical currents and often tragically blinded by biases of culture and temperament.Nowhere are her talents more brilliantly on display than in her Pulitzer Prize–winning bestseller The Guns of August (1962), a riveting account of the outbreak of World War I and the weeks of fighting leading up to the First Battle of the Marne in September 1914. Tuchman dramatizes the diplomatic debacles that precipitated the war and the intransigence of the German and French armies as they dogmatically adhered to their battle plans, with disastrous consequences. Interwoven with her vivid re-creation of the German march through Belgium into France and the fierce fighting on the Eastern Front are astute characterizations of the conflict’s key military and political leaders, among them French General Joseph Joffre, German Kaiser Wilhelm II, and British First Lord of the Admiralty Winston Churchill. The Guns of August can also be read as a cautionary study in the perils of brinksmanship, and Tuchman’s searching observations about the irrational escalation of conflict among states made a deep impression on President John F. Kennedy, who famously drew on the book for insight during the Cuban Missile Crisis. In a deluxe reader’s edition for the first time in more than a generation, The Guns of August is presented here with ten fully restored color maps and sixteen pages of photographs.Some of Tuchman’s finest writing graces her next book, The Proud Tower: A Portrait of the World Before the War, 1890–1914 (1966). She brings to life the disparate worlds of the self-satisfied English aristocracy and the miserable poor whose conditions gave rise to international anarchism; revisits the national madness of the Dreyfus Affair in France; considers the naiveté and cynicism of the varied participants in the international peace conferences at The Hague; mounts a dazzling foray into cultural criticism with a meditation on the operas of Richard Strauss; and creates unforgettable portraits of such political titans as Thomas B. Reed, longtime Speaker of the U.S. House of Representatives, and French Socialist leader Jean Jaurès. Honoring the historian’s ideal to envision life “as it really was,” Tuchman paints a fin-de-siècle world “bursting with new tensions and accumulated energies.” The present volume reproduces the original endpaper illustrations from the first edition of The Proud Tower, plus a thirty-two page insert of illustrations. And as a special coda, it presents “How We Entered World War I,” a 1967 essay that appeared in The New York Times Magazine in which Tuchman explores the genesis of U.S. involvement in the Great War.",
  "genres": [
    "History",
    "Nonfiction",
    "World War I",
    "Classics",
    "War",
    "European History",
    "World History"
  ],
  "author": "Barbara W. Tuchman",
  "average_rating": "4.40",
  "url": "https://www.goodreads.com/book/show/11837308-the-guns-of-august-the-proud-tower"
}