{
  "title": "Dark Planet Warriors: Escape",
  "description": "Abbey  Ever since we left the Fleet Station, Tarak has been his usual cryptic self. For some reason, he’s keeping everything very low-key, to the extent that we’re trying to sneak in to Kythia. Something’s up, and he’s not telling me anything. Every time I try to get answers, he distracts me with his stupid sexiness. Stupid sexy, silver, stubborn, insistent alien. Why can’t he just keep his damn hands to himself? And why do I suck at resisting his advances? There’s something he’s not telling me. He’s up to something shady, and I don’t like it. I guess I have no choice but to stick with him for now, because half of Kythia is out to get me, and who better to have by your side than the most lethal soldier in the Kordolian military? We’ll just have to work on his communication skills, a little, that’s all.  Tarak  Kythia is a dangerous place for a Human, but I must go there. The safest place in the universe for Abbey right now is by my side, so she comes with me. She will not enjoy the trip, but I aim to keep it brief. Besides, I cannot keep my hands off her. She mystifies and perplexes me, and yet I find myself addicted to her warmth, her scent, and her sweet taste. She does not know the extent of the danger facing us. The High Council want my head. They may send assassins after us. The barren wastelands of the Vaal, where we must go, are cold and harsh and completely disconnected from civilization. But I must find the tortured Prince, and drag him back to reality. There are plans I wish to put in place to ensure the survival of our race, and he, just like my precious Human, is an integral part of them. We may be returning to Earth sooner than she thinks.  Dark Planet Warriors is a 3-book serial. Each book is an episode of Abbey and Tarak's story, just like a TV series.  Books in series: Book one: Invasion Book two: Taken Book three: Escape  Due to violence, swearing and steamy sex scenes, these books are recommended for readers aged 18 years and over.",
  "genres": [
    "Aliens"
  ],
  "author": "Anna Carven",
  "average_rating": "4.15",
  "url": "https://www.goodreads.com/book/show/29490584-dark-planet-warriors"
}