{
  "title": "Simulations (Semiotext",
  "description": "Baudrillard's bewildering thesis, a bold extrapolation on Ferdinand de Saussure's general theory of general linguistics, is in fact a clinical vision of contemporary consumer societies where signs don't refer anymore to anything except themselves. They all are generated by the matrix. Simulations never existed as a book before it was \"translated\" into English. Actually it came from two different bookCovers written at different times by Jean Baudrillard. The first part of Simulations, and most provocative because it made a fiction of theory, was \"The Procession of Simulacra.\" It had first been published in Simulacre et Simulations (1981). The second part, written much earlier and in a more academic mode, came from L'Echange Symbolique et la Mort (1977). It was a half-earnest, half-parodical attempt to \"historicize\" his own conceit by providing it with some kind of genealogy of the three orders of the Counterfeit attached to the classical period; Production for the industrial era; and Simulation, controlled by the code. It was Baudrillard's version of Foucault's Order of Things and his ironical commentary of the history of truth. The book opens on a quote from Ecclesiastes asserting flatly that \"the simulacrum is true.\" It was certainly true in Baudrillard's book, but otherwise apocryphal.One of the most influential essays of the 20th century, Simulations was put together in 1983 in order to be published as the first little black book of Semiotext(e)'s new Foreign Agents Series. Baudrillard's bewildering thesis, a bold extrapolation on Ferdinand de Saussure's general theory of general linguistics, was in fact a clinical vision of contemporary consumer societies where signs don't refer anymore to anything except themselves. They all are generated by the matrix.In effect Baudrillard's essay (it quickly became a must to read both in the art world and in academe) was upholding the only reality there was in a world that keeps hiding the fact that it has none. Simulacrum is its own pure simulacrum and the simulacrum is true. In his celebrated analysis of Disneyland, Baudrillard demonstrates that its childish imaginary is neither true nor false, it is there to make us believe that the rest of America is real, when in fact America is a Disneyland. It is of the order of the hyper-real and of simulation. Few people at the time realized that Baudrillard's simulacrum itself wasn't a thing, but a \"deterrence machine,\" just like Disneyland, meant to reveal the fact that the real is no longer real and illusion no longer possible. But the more impossible the illusion of reality becomes, the more impossible it is to separate true from false and the real from its artificial resurrection, the more panic-stricken the production of the real is.",
  "genres": [
    "Philosophy",
    "Nonfiction",
    "Theory",
    "Sociology",
    "France",
    "Politics",
    "Academic"
  ],
  "author": "Jean Baudrillard",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/118378.Simulations_Semiotext"
}