{
  "title": "Hard Candy",
  "description": "Hero Sandwich\n by Angela Knight: Take two handsome superheroes, add one bad girl gone good--and stand back while the sparks fly! Meg Jennings is more than a photographer-- she's Paparazzi, superhero shutterbug. Using the suit that gives her the ability to fly and turn invisible, she takes photos of superheroes in combat with their deadliest enemies. Some of Meg's subjects aren't exactly delighted with her work. Cougar and his sidekick Lynx, for example, find themselves the butt of the late-night talk show circuit because of one of Meg's photos.They decide to take erotic revenge, and soon Meg finds herself in a delicious hero sandwich. \nCandy for her Soul\n by Sheri Gilmore: There's a reason mama always said not to take candy from a stranger. Natalie Pesqua accepts candy from a persuasive stranger, never guessing she's traded her soul to the devil. In exchange for her soul, he grants the desire of her heart: two men to fulfill her every erotic fantasy. Love wasn't part of the bargain. \nFortune's Star\n by Morgan Hawke: In the heart of the Imperial Stars, past and future collide, as ghosts converge in battle for a fortune-teller's soul ... on Port Destiny Station. Luxi Emery was perfectly happy with her position as the receptionist for Armored Media Corp. Then her hidden talent for seeing the future awakened--and exposed a black-mailing con-artist haunted by a malevolent ghost. It was a lose-lose situation, and Luxi had only a single shred of hope. Her future awaits on Port Destiny Station. A future intertwined with Amun, the handsome diplomatic telepath, and Leto, a ghost-haunted cyborg with very human carnal appetites. If they can resolve a few ...intimate ... details. Yet a darker future is chases Luxi: they are not alone, and Leto's is not the only hungry ghost. [Publisher's Note: This book contains BDSM themes and content, menage, and same-sex sexual practices.]",
  "genres": [
    "Romance",
    "Erotica",
    "Menage",
    "Science Fiction",
    "Anthologies",
    "Fantasy",
    "Paranormal"
  ],
  "author": "Angela Knight",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/29489.Hard_Candy"
}