{
  "title": "Dead Cold Brew",
  "description": "\"A fabulous diamond, blackmail, embezzlement, surpriseinheritances, murder, and a decades-old family scandal...with lusciously richrecipes.\" -- Publishers Weekly From Cleo Coyle, the  New York Times  bestselling author of  Dead to the Last Drop,  comes a gripping new entry in the \"highly satisfying\"* Coffeehouse Mystery series. (* Publishers Weekly )THE PERFECT PROPOSAL LEADS TO A CHILLING COLD CASE...  Coffeehouse manager Clare Cosi sheds tears of joy when her NYPD detective boyfriend surprises her with an engagement ring. But her bridal bliss is put on hold when a chilling mystery brings a wave of deadly danger to those she holds dear... After everything Clare and Mike have been through, they deserve a little bit of happily ever after. So when Mike decides to put a ring on Clare's finger, Clare's eccentric octogenarian employer is there to help. She donates the perfect coffee-colored diamonds to include in the setting and the name of a world-famous jeweler who happens to be an old family friend. But while the engagement is steeped in perfection, the celebration is not long lived. First, a grim-faced attorney interrupts their party with a mysterious letter bequeathing a strange, hidden treasure to Clare's daughter. Next, the renowned jeweler who designed Clare's ring is found poisoned in his shop. Both events appear to be connected to a cold case murder involving a sunken ship, an Italian curse, a suspiciously charming jewel thief, and a shocking family secret. With deadly trouble brewing, Clare must track down clues in some of New York's most secret places before an old vendetta starts producing fresh corpses. With recipes to die for, including how to make cold-brew coffee at home!",
  "genres": [
    "Mystery",
    "Cozy Mystery",
    "Fiction",
    "Cozy",
    "Audiobook",
    "Romance",
    "Mystery Thriller"
  ],
  "author": "Cleo Coyle",
  "average_rating": "4.05",
  "url": "https://www.goodreads.com/book/show/29496467-dead-cold-brew"
}