{
  "title": "I Am Brian Wilson",
  "description": "For the first time in his own words, the legendary musical genius of The Beach Boys reflects on his tumultuous life and astonishing 21st-century comeback to live performance and renewed creativity.Brian Wilson was the driving creative force behind The Beach Boys, a band that defined an era and charted nine consecutive gold albums and hit after unstoppable hit. But he was derailed in the 1970s by mental illness, drug use, and the shifting fortunes of the band he'd helped to create. In the late 1980s, while still under the thumb of a disreputable therapist, he reemerged as a solo artist, though his living conditions made that unsustainable. Amazingly, he persisted. He found the right support network, including his second wife, Melinda, the right doctors and the right medication and, with their help, he found his way back to the foundation of his creativity. In the 2000s, for the first time ever, Wilson became a viable solo performance artist. And he was at last able to complete Smile , the unfinished Beach Boys record that had become both the symbol of his genius and of his destabilization.I Am Brian Wilson is the story of Brian Wilson's life, told by Brian Wilson. But he's not the same man who had a nervous breakdown on an airplane in 1964 or the one who ballooned to 300 pounds and couldn't get out of bed in the 1970s. This Brian Wilson is older, calmer, filled with perspective regarding his extraordinary accomplishments and forgiveness for the people who complicated those accomplishments, and his life. Wiser, more measured, though still possessed of the youthful spark that helped him rise to the top of the rock and roll world, Wilson relates his life with a level of emotional honesty that has eluded authors of scores of previous works on Brian and The Beach \"Telling my story honestly means remembering things I sometimes prefer to forget. I would like people to get to know what I've gone through, and I hope that my story will give them strength.\"",
  "genres": [
    "Music",
    "Biography",
    "Nonfiction",
    "Memoir",
    "Autobiography",
    "Audiobook",
    "Biography Memoir"
  ],
  "author": "Brian Wilson",
  "average_rating": "3.78",
  "url": "https://www.goodreads.com/book/show/29496189-i-am-brian-wilson"
}