{
  "title": "American Individualism",
  "description": "American Individualism is a book written by Herbert Hoover that explores the concept of individualism in American society. Hoover, who served as the 31st President of the United States, argues that individualism is a fundamental value that has shaped the country since its inception. He examines the historical roots of individualism in America, tracing it back to the country's founding and the ideals of the Enlightenment. The book also explores the role of individualism in American democracy and its impact on economic and social progress. Hoover argues that individualism has been a driving force behind America's success, allowing individuals to pursue their own interests and achieve their full potential. He also discusses the challenges that individualism faces in modern society, including the rise of collectivism and the erosion of personal responsibility. Throughout the book, Hoover offers insights and observations on American society and the importance of individualism in maintaining a free and prosperous society. He draws on his own experiences as a businessman and politician to provide practical examples and advice for individuals seeking to live a life of independence and self-reliance. Overall, American Individualism is a thought-provoking and insightful exploration of one of America's core values, written by one of its most prominent leaders. It offers a unique perspective on the role of individualism in American society and its importance for the future.1922. A slim volume from the 31st President of the United States, espousing Hoover's philosophy, a blend of both national progress and traditional individualism. American Individualism; Philosophic Grounds; Spiritual Phases; Economic Phases; Political Phases; and The Future. A fascinating read!This scarce antiquarian book is a facsimile reprint of the old original and may contain some imperfections such as library marks and notations. Because we believe this work is culturally important, we have made it available as part of our commitment for protecting, preserving, and promoting the world's literature in affordable, high quality, modern editions, that are true to their original work.",
  "genres": [
    "Politics",
    "History",
    "Philosophy"
  ],
  "author": "Herbert Hoover",
  "average_rating": "3.67",
  "url": "https://www.goodreads.com/book/show/2949200-american-individualism"
}