{
  "title": "A Risky Assignment: Finding the Ponygirls",
  "description": "It seemed like such a great idea at the time. Cindy had been chasing down a story about people forced into becoming ponygirls. Once she got past the fantasy people and the urban legends, there was still something there. She knew it would be a great story.It took some doing, but she convinced her editor to let her follow the lead, but, he would only agree if she did it by going under cover. Going under cover meant allowing herself to be enslaved and trained as a ponygirl. But it will all be ok because he will be keeping tabs on her and all she has to do is make a phone call when she has the story, or can't take it any more, and they will get her out of there (wherever there happens to be.)Simple – right? Not so simple. Cindy goes in, but she is not prepared for what she finds. From the very beginning she finds herself completely restrained and controlled. But that is ok, because she can put up with being trained as a pony for a while, can’t she? So what if she is restrained in a harness that holds her hands and arms helplessly behind her, and so what if she is not allowed to speak (ponies don’t talk) and usually bitted so that even if she tried she could not. Well, she can handle that – or can she? And does she have any choice? How do you make a phone call when you are a tightly restrained pony locked in a stable?The training is dehumanizing and painful. Instant and complete obedience is not just expected, it is demanded and anything less, well, and it does not take long for Cindy’s buttocks and thighs to be well marked.How will this adventure end? Can Cindy survive her time as a ponygirl? How can she get out? And, is there even a way out if she stays for all the training? With no control of any kind, what if she is not released? Can she deal with that?This book contains explicit depictions of non-consensual and severe bondage together with corporal punishment. It depicts physical and psychological control and abuse. Cover art by Andy LaRoy",
  "genres": [
    "BDSM"
  ],
  "author": "I. Binder",
  "average_rating": "4.03",
  "url": "https://www.goodreads.com/book/show/29485896-a-risky-assignment"
}