{
  "title": "A Common Struggle: A Personal Journey Through the Past and Future of Mental Illness and Addiction",
  "description": "** New York Times Bestseller****Now with an updated resource guide and a national platform for mental illness**Patrick J. Kennedy, the former congressman and youngest child of Senator Ted Kennedy, details his personal and political battle with mental illness and addiction, exploring mental health care's history in the country alongside his and every family's private struggles.On May 5, 2006, the New York Times ran two stories, “Patrick Kennedy Crashes Car into Capitol Barrier” and then, several hours later, “Patrick Kennedy Says He'll Seek Help for Addiction.” It was the first time that the popular Rhode Island congressman had publicly disclosed his addiction to prescription painkillers, the true extent of his struggle with bipolar disorder and his plan to immediately seek treatment. That could have been the end of his career, but instead it was the beginning. Since then, Kennedy has become the nation’s leading advocate for mental health and substance abuse care, research and policy both in and out of Congress. And ever since passing the landmark Mental Health Parity and Addiction Equity Act--and after the death of his father, leaving Congress--he has been changing the dialogue that surrounds all brain diseases.A Common Struggle weaves together Kennedy's private and professional narratives, echoing Kennedy's philosophy that for him, the personal is political and the political personal. Focusing on the years from his 'coming out' about suffering from bipolar disorder and addiction to the present day, the book examines Kennedy's journey toward recovery and reflects on Americans' propensity to treat mental illnesses as \"family secrets.\"Beyond his own story, though, Kennedy creates a roadmap for equality in the mental health community, and outlines a bold plan for the future of mental health policy. Written with award-winning healthcare journalist and best-selling author Stephen Fried, A Common Struggle is both a cry for empathy and a call to action.",
  "genres": [
    "Nonfiction",
    "Memoir",
    "Biography",
    "Mental Health",
    "Politics",
    "Mental Illness",
    "Psychology"
  ],
  "author": "Patrick J. Kennedy",
  "average_rating": "3.80",
  "url": "https://www.goodreads.com/book/show/29496454-a-common-struggle"
}