{
  "title": "Isolation Ward",
  "description": "Straight out of today’s hospitals and labs–and tomorrow’s headlines–comes a frightening, scalpel-sharp thriller from medical insider Joshua Spanogle. In an astounding debut, Spanogle takes us on an all-too-real race against time…as a young doctor enters the dark side of scientific research, desperate to stop a terrifying epidemic before it is too late….In Baltimore’s St. Raphael’s Hospital, three newly admitted patients are among society’s most helpless citizens: female residents of Baltimore’s group homes for the mentally impaired, their bodies racked by a virus the likes of which no one at St. Raphael’s has ever seen.Dr. Nathaniel McCormick is one of the first on the scene. A young investigator from the Centers for Disease Control, Nate is paid to explore the bizarre, the exotic, and the baffling–from superviruses to bioterrorism. But as soon as Nate begins to investigate the lives and habits of the victims, he knows something is terribly wrong. Using all his skills as a medical detective, Nate soon zeroes in on the “vector”–the one person who had sexual contact with the first victims. And when that suspect is found murdered, Nate fears that the disease he’s chasing may not be an act of nature, but of man.With his brash style angering his superiors and fellow investigators alike, Nate turns to an old colleague and former lover, Dr. Brooke Michaels, for help. Together the two investigators follow a twisting trail of clues to a discovery that is at once groundbreaking and unspeakable. And as a circle of treachery tightens around him, Nate is about to confront the most chilling revelation of all–and a past Nate himself has been trying to escape.At once a taut medical thriller and a riveting psychological portrait of a young doctor on the edge, Isolation Ward is a tale of runaway tension–with a brilliant “what-if” premise that is harrowing…heartbreaking…and impossible to wrench from your imagination.From the Hardcover edition.",
  "genres": [
    "Thriller",
    "Fiction",
    "Mystery",
    "Suspense",
    "Audiobook",
    "Medical",
    "Science Fiction"
  ],
  "author": "Joshua Spanogle",
  "average_rating": "3.55",
  "url": "https://www.goodreads.com/book/show/295049.Isolation_Ward"
}