{
  "title": "Cause of All Nations",
  "description": "When Abraham Lincoln delivered the Gettysburg Address in 1863, he had broader aims than simply rallying a war-weary nation. Lincoln realized that the Civil War had taken on a wider significance -- that all of Europe and Latin America was watching to see whether the United States, a beleaguered model of democracy, would indeed \"perish from the earth.\"In The Cause of All Nations , distinguished historian Don H. Doyle explains that the Civil War was viewed abroad as part of a much larger struggle for democracy that spanned the Atlantic Ocean, and had begun with the American and French Revolutions. While battles raged at Bull Run, Antietam, and Gettysburg, a parallel contest took place abroad, both in the marbled courts of power and in the public square. Foreign observers held widely divergent views on the war -- from radicals such as Karl Marx and Giuseppe Garibaldi who called on the North to fight for liberty and equality, to aristocratic monarchists, who hoped that the collapse of the Union would strike a death blow against democratic movements on both sides of the Atlantic. Nowhere were these monarchist dreams more ominous than in Mexico, where Napoleon III sought to implement his Grand Design for a Latin Catholic empire that would thwart the spread of Anglo-Saxon democracy and use the Confederacy as a buffer state.Hoping to capitalize on public sympathies abroad, both the Union and the Confederacy sent diplomats and special agents the South to seek recognition and support, and the North to keep European powers from interfering. Confederate agents appealed to those conservative elements who wanted the South to serve as a bulwark against radical egalitarianism. Lincoln and his Union agents overseas learned to appeal to many foreigners by embracing emancipation and casting the Union as the embattled defender of universal republican ideals, the \"last best hope of earth.\"A bold account of the international dimensions of America's defining conflict, The Cause of All Nations frames the Civil War as a pivotal moment in a global struggle that would decide the survival of democracy.",
  "genres": [
    "History",
    "Civil War",
    "Nonfiction",
    "American Civil War",
    "American History",
    "Politics",
    "War"
  ],
  "author": "Don H. Doyle",
  "average_rating": "4.33",
  "url": "https://www.goodreads.com/book/show/29502341-cause-of-all-nations"
}