{
  "title": "Why They Do It: Inside the Mind of the White-Collar Criminal",
  "description": "Rarely does a week go by without a well-known executive being indicted for engaging in a white-collar crime. Perplexed as to what drives successful, wealthy people to risk it all, Harvard Business School professor Eugene Soltes took a remarkable journey deep into the minds of these white-collar criminals, spending seven years in the company of the men behind the largest corporate crimes in history--from the financial fraudsters of Enron, to the embezzlers at Tyco, to the Ponzi schemers Bernie Madoff and Allen Stanford. Drawing on intimate details from personal visits, letters, and phone calls with these former executives, as well as psychological, sociological, and historical research, Why They Do It is a breakthrough look at the dark side of the business world.Soltes refutes popular but simplistic explanations of why seemingly successful executives engage in crime. White-collar criminals, he shows, are not merely driven by excessive greed or hubris, nor do they usually carefully calculate the costs and benefits before breaking the law and see it's worth the risk. Instead, he shows that most of these executives make decisions the way we all do--on the basis of their intuitions and gut feelings. The trouble is, these gut feelings are often poorly suited for the modern business world.Based on extensive interaction with nearly fifty former executives--many of whom have never spoken about their crimes--Soltes provides insights into why some saw the immediate effects of misconduct as positive, why executives often don't feel the emotions (angst, guilt, shame) most people would expect, and how acceptable norms in the business community can differ from those of the broader society.",
  "genres": [
    "Nonfiction",
    "Business",
    "True Crime",
    "Psychology",
    "Crime",
    "Audiobook",
    "Economics"
  ],
  "author": "Eugene Soltes",
  "average_rating": "3.82",
  "url": "https://www.goodreads.com/book/show/29502353-why-they-do-it"
}