{
  "title": "Witches in West Memphis: The West Memphis Three and Another False Confession",
  "description": "This might be the most unjust prosecution in U.S. legal history. If you think what happened to Steven Avery in the true crime film Making a Murderer was shocking, you will be completely appalled by what happened to three little boys and three teens in Arkansas in 1993. Three 8-year-old boys vanished from their West Memphis neighborhood one sunny afternoon. A day later their mangled, nude bodies are found in a drainage ditch. Police and prosecutors believe the killings are related to the occult. Three teens are arrested one month later. Damien Echols, Jason Baldwin, and Jessie Misskelley Jr. are convicted. There’s only one problem. Overwhelming scientific evidence proves they’re innocent and witness after witness has come forward to admit lies were told in court during the original trials. Award-winning journalist George Jared takes readers inside one of the most famous criminal cases in U.S. legal history. Witches in West Memphis gives a comprehensive insiders’ view into the West Memphis Three case. No journalist has written more stories about the case than Jared. The author recounts his firsthand court coverage, interviews with witnesses, research, and other information he gathered in the case. Those interviews include a Death Row interview with Damien Echols, interviews with Jason Baldwin, and Jessie Misskelley Jr., and interviews with other suspects, including Terry Hobbs. He’s been credited in numerous documentaries including the Academy Award nominated film Paradise Lost III: Purgatory and the New York Times best seller Life After Death. Witches graphically recounts how three Boy Scouts – Stephen “Stevie” Branch, Michael Moore, and Christopher Byers – rode their bikes after school on a bright afternoon. Their bodies are found in a wooded area near their homes the next day. The manner of death and the way they were bound, ankle to wrist, made authorities think Satanists might have sacrificed the children. Echols, a troubled teen with a seedy past, was immediately identified as a possible suspect. His best-friend, Jason Baldwin, and another teen known to them, Jessie Misskelley Jr., are arrested June 3, 1993. They are charged with murder. No real evidence tied the teens to the crime, but an error-riddled confession by Misskelley was the proof used to seal the verdicts in the case. Read how they, referred to as the West Memphis Three, toiled in prison for years as their case stagnated in the Arkansas judicial system. As time passed, overwhelming scientific evidence was discovered. Witnesses changed their statements. New suspects rose to the surface. No author, documentary filmmaker, or journalist has had more access in this case. Witches is written in an easy to read, narrative-style form. Grab a copy today.",
  "genres": [
    "True Crime",
    "Nonfiction"
  ],
  "author": "George Jared",
  "average_rating": "4.06",
  "url": "https://www.goodreads.com/book/show/29499703-witches-in-west-memphis"
}