{
  "title": "The Black Prince of Florence: The Spectacular Life and Treacherous World of Alessandro de' Medici",
  "description": "Ruler of Florence for seven bloody years, 1531 to 1537, Alessandro de' Medici was arguably the first person of color to serve as a head of state in the Western world. Born out of wedlock to a dark-skinned maid and Lorenzo de' Medici, he was the last legitimate heir to the line of Lorenzo the Magnificent. When Alessandro's noble father died of syphilis, the family looked to him. Groomed for power, he carved a path through the backstabbing world of Italian politics in a time when cardinals, popes, and princes vied for wealth and advantage. By the age of nineteen, he was prince of Florence, inheritor of the legacy of the grandest dynasty of the Italian Renaissance.Alessandro faced down family rivalry and enormous resistance from Florence's oligarchs, who called him a womanizer-which he undoubtedly was--and a tyrant. Yet this real-life counterpart to Machiavelli's Prince kept his grip on power until he was assassinated at the age of 26 during a late-night tryst arranged by his scheming cousins. After his death, his brief but colorful reign was criticized by those who had murdered him in a failed attempt to restore the Florentine republic. For the first time, the true story is told in The Black Prince of Florence .Catherine Fletcher tells the riveting tale of Alessandro's unexpected rise and spectacular fall, unraveling centuries-old mysteries, exposing forgeries, and bringing to life the epic personalities of the Medicis, Borgias, and others as they waged sordid campaigns to rise to the top. Drawing on new research and first-hand sources, this biography of a most intriguing Renaissance figure combines archival scholarship with discussions of race and class that are still relevant today.",
  "genres": [
    "History",
    "Nonfiction",
    "Biography",
    "Italy",
    "European History",
    "Politics",
    "16th Century"
  ],
  "author": "Catherine Fletcher",
  "average_rating": "3.78",
  "url": "https://www.goodreads.com/book/show/29522042-the-black-prince-of-florence"
}