{
  "title": "Bite Somebody",
  "description": "“Do you want to be perfect?”  That’s what Danny asked Celia the night he turned her into a vampire. Three months have passed since, and immortality didn’t transform her into the glamorous, sexy vamp she was expecting, but left her awkward, lonely, and working at a Florida gas station. On top of that, she’s a giant screw-up of an immortal, because the only blood she consumes is from illegally obtained hospital blood bags.  What she needs to do—according to her moody vampire friend Imogene—is just … bite somebody. But Celia wants her first bite to be special, and she has yet to meet Mr. Right Bite. Then, Ian moves in next door. His scent creeps through her kitchen wall and makes her nose tingle, but insecure Celia can’t bring herself to meet the guy face-to-face.  When she finally gets a look at Ian’s cyclist physique, curly black hair, and sun-kissed skin, other parts of Celia tingle, as well. Could he be the first bite she’s been waiting for to complete her vampire transformation? His kisses certainly have a way of making her fangs throb.  Just when Celia starts to believe Ian may be the fairy tale ending she always wanted, her jerk of a creator returns to town, which spells nothing but trouble for everyone involved.  Winner of the 2017 Imadjinn Award for Best Paranormal Romance! \"Witty banter and hot sexy-times make BITE SOMEBODY sparkle in all the right ways.\" —Beth Cato, author of The Clockwork Dagger series  \"Bite Somebody is the Pretty in Pink of vampire stories; fun, self-consciously retro, and not afraid to be goofy. I'll never get the phrase 'Woodsy BO' out of my head. Sara Dobie Bauer knows how to keep a reader smiling.\" —Christopher Buehlman, author of Those Across the River  \"BITE SOMEBODY is sexy, funny, and A-positively alive with colorful characters. Celia is perfectly imperfect and insecure; adorable sexy human, Ian, sparkles more than any undead ever could; and Imogene is the kind of bad-influence friend we all need in our lives. Bursting with tasty giggles, devilish guffaws, and swoony sighs, BITE SOMEBODY is an absolute pleasure to sink your teeth into.\" —Jennifer Scott, author of The Accidental Book Club",
  "genres": [
    "Vampires",
    "Paranormal",
    "Romance",
    "Urban Fantasy",
    "Fantasy",
    "Paranormal Romance",
    "Humor"
  ],
  "author": "Sara Dobie Bauer",
  "average_rating": "4.02",
  "url": "https://www.goodreads.com/book/show/29518618-bite-somebody"
}