{
  "title": "The Victory with No Name: The Native American Defeat of the First American Army",
  "description": "In 1791, General Arthur St. Clair led the United States army in a campaign to destroy a complex of Indian villages at the Maumee River in northwestern Ohio. Almost within reach of their objective, St. Clair's 1,400 men were attacked by about one thousand Indians. The U.S. force was decimated, suffering nearly one thousand casualties in killed and wounded, while Indian casualties numbered only a few dozen. But despite the lopsided result, it wouldn't appear to carry much significance; it involved only a few thousand people, lasted less than three hours, and the outcome, which was never in doubt, was permanently reversed a mere three years later. Neither an epic struggle nor a clash that changed the course of history, the battle doesn't even have a name.Yet, as renowned Native American historian Colin Calloway demonstrates here, St. Clair's Defeat--as it came to be known-- was hugely important for its time. It was both the biggest victory the Native Americans ever won, and, proportionately, the biggest military disaster the United States had suffered. With the British in Canada waiting in the wings for the American experiment in republicanism to fail, and some regions of the West gravitating toward alliance with Spain, the defeat threatened the very existence of the infant United States. Generating a deluge of reports, correspondence, opinions, and debates in the press, it produced the first congressional investigation in American history, while ultimately changing not only the manner in which Americans viewed, raised, organized, and paid for their armies, but the very ways in which they fought their wars.Emphasizing the extent to which the battle has been overlooked in history, Calloway illustrates how this moment of great victory by American Indians became an aberration in the national story and a blank spot in the national memory. Calloway shows that St. Clair's army proved no match for the highly motivated and well-led Native American force that shattered not only the American army but the ill-founded assumption that Indians stood no chance against European methods and models of warfare. An engaging and enlightening read for American history enthusiasts and scholars alike, The Victory with No Name brings this significant moment in American history back to light.",
  "genres": [
    "History",
    "American History",
    "Native American",
    "Military History",
    "Native American History",
    "Nonfiction",
    "Westerns"
  ],
  "author": "Colin G. Calloway",
  "average_rating": "3.86",
  "url": "https://www.goodreads.com/book/show/29509908-the-victory-with-no-name"
}