{
  "title": "Ghosts of Mateguas",
  "description": "The body of a young girl, found floating in the icy waters of Scarborough Marsh... Six men, over a span of thirty-five years, disappear without a trace... A harbinger of evil, so ancient it defies memory, surfaces on the rocky shores of Mateguas... Journey, with Karen and her family, back to the mythos, passion, and magic, and join her as she seeks to finally lay to rest the ... GHOSTS OF MATEGUAS. GHOSTS OF MATEGUAS is the third full-length novel in highly acclaimed, award-winning, MATEGUAS ISLAND SERIES. 2017 FINALIST IN \"THRILLERS,\" Book Excellence Awards 2017 FINALIST IN HORROR/SUSPENSE - IAN Book of the Year Awards.. \"Ghosts of Mateguas joins others in the Mateguas Island saga in providing the third novel in a series that excels in blending supernatural forces with a family's relationships and the lure of an island which has changed all their lives ... Ghosts of Mateguas offers a compelling saga of grief, guilt, and perseverance that deftly combines suspense with supernatural intrigue. Prior fans of the series, especially, will find the further interactions between the characters to be engrossing and satisfying, staying true to prior events while adding deeper insights and tension and intrigue to the mix and adding a dose of revelations and truths that draw together prior events in a satisfying new story just as well-crafted as its predecessors.\" ~ Diane Donovan, Senior Reviewer, MIDWEST BOOK REVIEW \"...a vivid and poetic read that beautifully channels modern supernatural melodrama ... Watkins plays to some deeply apparent strengths in this series, and Ghosts of Mateguas is another home-run of a title. Anyone looking for something different along the lines of Shirley Jackson or Stephen King, your prayers have been answered. Ghosts of Mateguas stands as a spellbinding exemplar of modern Gothic Americana.\" ~ SELF-PUBLISHING REVIEW \"Linda Watkins’ supernatural suspense novel, Ghosts of A Mateguas Island Novel, is dark, fast-paced and intense ...I had a grand time reading Ghosts of Mateguas and hope the author decides to write a fourth book in this terrifying and suspenseful series. It’s most highly recommended.\" ~ Jack Magnus for READERS' FAVORITE (5-Star Review) \"Those who love stories with some touch of mystery will not be disappointed with this one ... Watkins writes with moving simplicity, a kind of prose that tantalizes and is difficult to put down, because it rings with an eloquence that is akin to the spell of the ghosts sauntering along the rocky shores of Mateguas. It can be difficult to believe a story told about humans and ghosts, but when that story is told by Watkins, it becomes as convincing as it is real ... The story is fast paced; the suspense is so skillfully built into the story to have the reader turning the pages, and the characters are solid enough that any reader will care about what happens to them. One would say that Ghosts of Mateguas comes with a spell that makes the book impossible to put down. Beautifully written by a writer of a rare caliber.\" ~ Romuald Dzemo for READERS' FAVORITE (5-Star Review) \"I found Ghosts of Mateguas to be a quick-paced psychological thriller/horror story. The various stories that made up the tapestry of the whole were equally engaging, and kept me turning the pages. If you enjoy books similar to Stephen King and Dean Koontz, be sure to check out the Mateguas Island books!\" ~ J. Aislynn d'Merricksson for READERS FAVORITE (5-Star Review)",
  "genres": [],
  "author": "Linda  Watkins",
  "average_rating": "4.43",
  "url": "https://www.goodreads.com/book/show/29510419-ghosts-of-mateguas"
}