{
  "title": "The Coming Generational Storm: What You Need to Know about America's Economic Future",
  "description": "How to avoid a fiscal crisis in the next generation -- and how to protect yourself if the government acts too late: policy recommendations and individual strategies to protect against skyrocketing tax rates, drastically reduced health and retirement benefits, high inflation, and a ruined currency.In 2030, as 77 million baby boomers hobble into old age, walkers will outnumber strollers; there will be twice as many retirees as there are today but only 18 percent more workers. How will America handle this demographic overload? How will Social Security and Medicare function with fewer working taxpayers to support these programs? According to Laurence Kotlikoff and Scott Burns, if our government continues on the course it has set, we'll see skyrocketing tax rates, drastically lower retirement and health benefits, high inflation, a rapidly depreciating dollar, unemployment, and political instability. The government has lost its compass, say Kotlikoff and Burns, and the current administration is heading straight into the coming generational storm.But don't panic. To solve a problem you must first understand it. Kotlikoff and Burns take us on a guided tour of our generational imbalance, first introducing us to the baby boomers -- their long retirement years and \"the protracted delay in their departure to the next world.\" Then there's the \"fiscal child abuse\" that will double the taxes paid by the next generation. There's also the \"deficit delusion\" of the under-reported national debt. And none of this, they say, will be solved by any of the popularly touted remedies: cutting taxes, technological progress, immigration, foreign investment, or the elimination of wasteful government spending.So how can the United States avoid this demographic/fiscal collision? Kotlikoff and Burns propose bold new policies, including meaningful reforms of Social Security, and Medicare. Their proposals are simple, straightforward, and geared to attract support from both political parties. But just in case politicians won't take the political risk to chart a new direction, Kotlikoff and Burns also offer a \"life jacket\" -- guidelines for individuals to protect their financial health and retirement.This paperback edition of The Coming Generational Storm has been revised and updated and includes a new foreword by the authors.",
  "genres": [
    "Economics",
    "Nonfiction",
    "Business",
    "History",
    "Politics",
    "Finance",
    "Sociology"
  ],
  "author": "Laurence J. Kotlikoff",
  "average_rating": "3.68",
  "url": "https://www.goodreads.com/book/show/295085.The_Coming_Generational_Storm"
}