{
  "title": "The Trouble with His Lordship's Trousers",
  "description": "In Regency London, Georgiana Hathaway has no intention of falling into the conventional trap of marriage and motherhood. She has so much more to do with her life, and a few tortuous years at 'The Particular Establishment for the Advantage of Respectable Ladies' has done nothing to change her mind. In fact, she's already taken the first steps to carve out a career, by anonymously crafting a scandalous, satirical column, called His Lordship's Trousers, for her father's newspaper. But as the misadventures of her comical rake become the most talked-about story in London, and the naughty column earns greater popularity, it is also bound to gain critics. How much trouble can \"His Lordship's Trousers\" get her into? She's about to find out. Meanwhile, \"Dead Harry\" Thrasher eagerly reads that wicked column every week. It is one of the few things— other than the obituaries— that make him laugh out loud these days. He lives vicariously through that fictional rake's antics, because his own life is suspended in time and he sees no reason to move forward. After all, when a man's obituary has been printed in the newspaper, not once but twice, he has a tendency to believe it. What's the point of a life over which man has no control? What, exactly, has he been saved so many times for? He's about to find out. When Dead Harry meets Miss Hathaway, they will both find their worlds, and their long-ingrained opinions, at risk. She does not want to fall in love with a man when everybody knows the male animal only gets in the way of a girl's ambitions. And Harry may have survived a \"mortal\" wound, and eight hundred and fifty days stranded alone on an uncharted island, but can the very private life of this semi-recluse survive the reckless curiosity and impertinent sauce of Miss Georgiana Hathaway? He's a naval war hero— even if he does have an aversion to decent clothing and polite behavior— so if this young woman thinks to conquer him and put his life in order, she'd better have a battle strategy. It's been a while since he enjoyed a skirmish at sea, but Harry has a feeling he'll love every moment of this one.",
  "genres": [
    "Historical",
    "Historical Romance",
    "Romance",
    "Regency",
    "Humor",
    "British Literature"
  ],
  "author": "Jayne Fresina",
  "average_rating": "4.05",
  "url": "https://www.goodreads.com/book/show/29518868-the-trouble-with-his-lordship-s-trousers"
}