{
  "title": "Been There, Done WHAT!: ROMANTIC ESCAPADES AND OTHER MISADVENTURES IN CHINA, THAILAND, VIETNAM, LAOS, AND AUSTRALIA",
  "description": "Australian born John Smith never accepted the status quo. Sociable, charming and a compulsive writer of amusing emails to long-term friends, he left home at 21 with £65 ($200) and a ticket to Hong Kong with no immediate job prospects. From there worked his way around the world, primarily in advertising in South Africa, Europe, Canada, achieving award winning financial success in the USA, sharing his life with beautiful women and stray dogs. Returned home at 36 to become a papaya farmer, dabbled in real estate and retired at 50 to live in Noosa, Queensland.    In 2009, at 69, he decides to settle down and find a wife and is suddenly diagnosed with early-stage prostate cancer. Realizing that life is short, he decides to seize the day. He pursues an internet romance with a doctor in China, marries there in January 2010 and returns to Australia but separates 3 years later. Then, despite some deterioration in his health, goes to Thailand, Vietnam and Laos, finds a new companion, and brings her home in 2013 to another unfortunate relationship.    The book is based upon fascinating emails, many with comic overtones, detailing a senior citizen’s observations, adventures, and misadventures seeking romance in the Far East such as:  Honeymooning in Guangzhou and remote Chinese country villages Fending off assertive prostitutes as he was “looking for a partner. Not a professional” Encountering exotic faces, exotic places, exotic food Foiling a Conman in Pattaya trying to take him for a costly and perilous ride Living among poorly paid workers and poverty stricken women, men and boys enticed into the sex trade. John writes compassionately of their lives and criticizes Western exiles who exploit their poverty Being adopted by and caring for stray dogs in Pattaya and Phuket Discovering romance with a new partner, visiting her parents’ extraordinarily primitive farm in Laos, enjoying their gracious hospitality. Describes daily life, assists with farm chores, has fun shoveling manure, etc. Returning home, February 2014, with his Laotian friend who finds it difficult to adjust to the Australian way of life. She returned to Laos when her 6 month visa expired.   John also writes about:  Other adventures and misadventures around the world such as sailing an out-of-control Sampan in Hong Kong Harbor into a US Aircraft Carrier; arriving in South Africa, giving his travel-stained clothes to a washerwoman who never returned, driving a tour bus in Europe, exploring Majorca with his mother on a motor scooter, and writing a book in Mexico  Growing up in Australia and comic military training, then years later after his return: camping in the outback, extreme sailing offshore and other dangerous boating experiences, a family tragedy, surreptitiously burying his mother’s ashes, serious health issues in 2014 faced with fortitude and humor, kayaking with crocodiles.   The last lines of John’s initial Acknowledgements and his book state: ”Friends are true riches” and he names over 60 friends in 13 countries, several friends for over 50 years and many regular correspondents who encouraged him to write this book and share his adventures.    John ends his book telling of a most unusual close romantic but platonic 17 year friendship with Michi, a very special married friend... She is a twice-a-week ballroom dancing partner, frequent walking companion, a participant in many adventurous events while hiking and kayaking and always on call and available to help when most needed.",
  "genres": [],
  "author": "John Cameron Smith",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/29532063-been-there-done-what"
}