{
  "title": "Die Elfen",
  "description": "Nachdem sich Markus Heitz und Stan Nichols schon mit großem Erfolg der Zwerge und der Orks angenommen haben, widmen sich Bernhard Hennen und James Sullivan nun einer dritten Spezies, die nicht aus der Fantasy wegzudenken den Elfen. Von allen Wesen, die herkömmliche Fantasywelten bevölkern, sind die Elfen die geheimnisvollsten und unnahbarsten. Sie scheinen dem Traum des Menschen nach ewiger Jugend und Schönheit entsprungen zu sein. Doch haftet ihnen auch ein Hauch von Tragik und Vergänglichkeit an. Diese Elemente nutzen Hennen und Sullivan für ihren 900-Seiten-Schmöker Die Elfen, der den Leser unterhaltsam durch ein Universum bekannter Klischees und neuer Einfälle führt. Die Elfenwelt wird von einem Dämon bedroht. Die beiden Elfen Nuramon und Farodin, denen sich der Nordländer Mandred aus der Menschenwelt anschließt, ziehen gegen das Ungeheuer zu Felde. Doch vor allen Dingen suchen sie nach einem Weg, ihre gemeinsame Geliebte, die Zauberin Noroelle, zu befreien, die Opfer des Dämons geworden ist und auf ewig in eine triste Parallelwelt verbannt wurde. Verzweifelt stürzen sie sich ins Abenteuer und versuchen, sie zurückzuholen. Dabei wird so manches Geheimnis gelüftet, eine Schlacht geschlagen und das Schicksal der Elfenwelt besiegelt.Die Elfen ist weder die definitive Geschichte zum Thema Elfen -- wie der Klappentext verspricht --, noch ein Werk mit besonders viel Tiefgang. Aber es ist erstklassige, temporeiche Unterhaltung, die die Atmosphäre unterschiedlicher Feen- und Elfenmärchen geschickt aufzunehmen weiß. Action und Abenteuer vermisst man ebenso wenig wie Humor und große Gefühle. Die Darstellung der Jahrhunderte währenden Liebe der Elfen ist herzwärmender Edelkitsch. Besonders schön ist der Einfall, Zitate aus fiktiven Legenden einzuflechten, in denen die Romanhandlung aus der Sicht der Nachwelt erzählt wird. So rückt das ganze Geschehen immer wieder in eine ferne Sagenwelt, in die man sich an grauen Herbsttagen durch die Lektüre von Die Elfen nur allzu gerne entführen lässt. --Simon Weinert",
  "genres": [
    "Fantasy",
    "Fiction",
    "High Fantasy",
    "German Literature",
    "Audiobook",
    "Epic Fantasy",
    "Magic"
  ],
  "author": "Bernhard Hennen",
  "average_rating": "4.10",
  "url": "https://www.goodreads.com/book/show/2952808-die-elfen"
}