{
  "title": "Amarna: The Complete Series",
  "description": "\"An impressively ingenious reframing of the chaotic domino effect caused by King Tut's death & the tantalizing possibility of his line's survival.\"------------------This compilation edition includes all three books in the Amarna Series: Ida, Hawara & Raia.AMARNA I: Book of IdaThe last living male descendant of the Amarna line, Pharaoh Tutankhamun, has died suddenly under mysterious circumstances. His wife, Queen Ankhesenamen, is left without a male heir. The ambitious vipers Ay and Horemheb are nipping at her heels in their bid to seize power. Queen Ankhe has but one hope to maintain her hold on the throne - an alliance with the Hittites.AMARNA II: Book of HawaraKing Mursili II’s only hope to restore his own Hittite Kingdom to greatness is to restore the Amarna line to power in Egypt, to atone for the sins of his father. Yet, with those closest to him being sacrificed in the process and the tide continuing to rise against them, how far is King Mursili prepared to go to see the prophecy fulfilled?AMARNA III: Book of RaiaHell hath no fury like a spider caught in its own web. It’s all or nothing. Either the prophecy is fulfilled and both Egypt & Hatti find salvation or Mursili and his allies fail - plunging both kingdoms into indescribable darkness. Behold, even in the terrible deafening silence of their abandonment, the gods had never been more clear. The time has come for judgment.----------------------------------------------Amarna is a ridiculously, historically accurate drama set in Ancient Egypt, Hattusa & Syria that is centered around the strange but true events surrounding the battle for the throne of Egypt following Pharaoh Tutankhamun's death and the interconnected events that took place in the Hittite empire.It includes an end matter feature that details what did and didn't really happen (at least as far as historians believe).",
  "genres": [
    "Historical Fiction"
  ],
  "author": "Grea Alexander",
  "average_rating": "3.77",
  "url": "https://www.goodreads.com/book/show/29532817-amarna"
}