{
  "title": "Francis Bellamy Biography - Edward Bellamy, Rex Curry exposing Nazi salutes, Socialism, Fascism, Nazism",
  "description": "Francis Bellamy, author of the Pledge of Allegiance to the Flag, was the origin of the Nazi salute and Nazi behavior. This book reveals why public schools will not teach students about his life. Astounding discoveries (from the historian Dr. Rex Curry) are explained in this biography of Bellamy. Learn the tragic impact of Bellamy's dogma of \"Christian Socialism\" and \"Military Socialism\" all over the world. Find out why, if the truth were taught about Bellamy, then all students would refuse to perform the 12-year daily ritual of chanting that Bellamy promoted. Author Ian Tinny with the Pointer Institute shows the connections to Socialism, Fascism, Nazism, and more. Known for its lively, clear prose as well as its scholarly research, this biography of Francis Bellamy is the only volume to tell America's story from the point of view of anarcho-capitalism. Tinny writes with an enthusiasm rarely encountered in the leaden prose of academic history, and his text is studded with telling quotations from history's forgotten luminaries. There are vivid descriptions of events that are usually ignored (e.g. the Pledge of Allegiance as the origin of the Nazi salute and Nazi behavior). Ian Tinny's work on Francis Bellamy (author of the Pledge of Allegiance), exposing the dogma of \"military socialism,\" should be read by every student. Instead, it is banned in government schools (socialist schools). Before becoming a full-time writer, Tinny was a mental health counselor working with the United States Probation Office, federal judges, and various sociopathic criminals in the justice system. Tinny's work led to the arrest, trial, conviction, and imprisonment of America's Dumbest Criminals (and the foreclosure of their homes, along with victim restitution liens, and criminal forfeiture judgments, in amounts totaling millions of dollars). Tinny has collaborated with the Dead Writer's Club (“DWC” -the famous author's group) to produce multiple books, and assists the Pointer Institute for Media Studies to provide remedial education to journalists about history, economics, and government. Micky Barnetti is a philologist and a forensic fraud analyst. Matt Crypto is an investigative journalist, free thinker, researcher, and ardent opponent of authoritarianism.",
  "genres": [],
  "author": "Ian Tinny",
  "average_rating": "4.33",
  "url": "https://www.goodreads.com/book/show/29524968-francis-bellamy-biography---edward-bellamy-rex-curry-exposing-nazi-salu"
}