{
  "title": "The Astral Codex: Using Dreams and Out-of-Body Experiences on a Spiritual Journey",
  "description": "A Guide to Using Out-of-Body Experiences for Spiritual DevelopmentThe Astral Codex is an effective, practical, and comprehensive guide to what out-of-body experiences are, what to see and do in the astral plane, how it fits into the structure of life, and how to use it for spiritual development.Throughout history, seekers of spiritual wisdom have traveled beyond the body into other dimensions to explore a wider reality. Their experiences formed the basis of otherworldly accounts found in many of the world's sacred teachings. Drawing on decades of out-of-body experiences, Belsebuub explains how someone can use astral travel to seek out spiritual knowledge today.The Astral Codex is based on the popular \"A Course in Astral Travel and Dreams\" by Belsebuub—a course created in 2001 that was studied online and in-person, and taken by tens of thousands of people worldwide. Of the people surveyed who took the course, 67 percent reported having an out-of-body experience as a result of it. The Astral Codex includes sections with detailed Q&As from the course. Find out what lucid dreaming and astral projection is. Learn about the multidimensional nature of reality. Learn about what the astral plane is and how to travel there. Discover what dreams mean and how to remember them. Learn how to explore destinations in the astral plane. Discover how to become successful at astral projection. Overcome common obstacles to conscious astral travel. Find out how the mind and emotions affects our ability to perceive other dimensions. Learn about how we leave our body every night with sleep. Discover how dreams and the astral plane are connected. Learn about the different ways someone can have an out-of-body experience (OBE). Discover the stages and sensations of having an OBE. Learn exercises to help train the mind to stay focused on astral techniques. Find out why we have bad dreams and nightmares and where they come from. Discover the reasons why science is limited in its studies on OBEs. Learn how to use astral travel for gaining spiritual knowledge. Learn about the symbolic language of higher dimensions and how to interpret it. And much, much more...About the authorBelsebuub is the author of a number of books on spirituality, out-of-body experiences, dreams, self-discovery, and esoteric knowledge. He has appeared on radio and television programs internationally, and writes from decades of spiritual and mystical experience.Visit belsebuub.com for more information.",
  "genres": [
    "Spirituality"
  ],
  "author": "Belsebuub",
  "average_rating": "4.55",
  "url": "https://www.goodreads.com/book/show/29524747-the-astral-codex"
}