{
  "title": "Becoming the Narcissist’s Nightmare: How to Devalue and Discard the Narcissist While Supplying Yourself",
  "description": "Although clinical research has been conducted on narcissism as a disorder, less is known about its effects on victims who are in toxic relationships with partners with Narcissistic Personality Disorder. Individuals with this disorder engage in chronic devaluation and manipulation of their partners, a psychological and emotional phenomenon known as \"narcissistic abuse.\" Unfortunately, the full extent of what narcissistic abuse entails is not taught in any psychology class or diagnostic manual. Since pathological narcissists are unlikely to seek treatment for their disorder, it is difficult to pinpoint what exactly makes a narcissistic abuser tick and the manipulative tactics they use, which are likely to differ from those of other types of abusers as they are more covert and underhanded. What is even more baffling is the addiction we form with our narcissistic abusers, created by biochemical bonds and trauma bonds that are also unlike any other relationship we experience. In this book, survivors will •The red flags of narcissistic behavior and covert manipulation tactics, including subtle signs many survivors don't catch in the early stages of dating a narcissist. •The motives behind narcissistic abuse and techniques to resist a narcissist's manipulation. •Why abuse survivors usually stay with a narcissist long after incidents of abuse occur. •How our own brain chemistry locks us into an addiction with a narcissistic or toxic partner, creating cravings for the constant chaos of the abuse cycle. •Traditional and alternative methods to begin to detach and heal from the addiction to the narcissist, including eleven important steps all survivors must take on the road to healing. •Methods to rewrite the narratives that abusers have written for us so we can begin to reconnect with our authentic selves and purpose. •How to rebuild an even more victorious and empowering life after abuse. Narcissistic partners employ numerous stealthy tactics to devalue and manipulate their victims behind closed doors. These partners lack empathy and demonstrate an incredible sense of entitlement and sense of superiority which drives their exploitative behavior in interpersonal relationships. Their tactics can include verbal abuse and emotional invalidation, stonewalling, projection, taking control of every aspect of the victim’s life, gaslighting and triangulation. Due to the narcissistic partner’s “false self,” the charismatic mask he or she projects to society, the victim often feels isolated in this type of abuse and is unlikely to have his or her experiences validated by friends, family and society. Using the latest scientific research as well as thousands of survivor accounts, this book will explore how the emotional manipulation tactics of narcissistic and antisocial partners affect those around them, particularly with regards to its cumulative socioemotional and psychological effects on the victim. It will also address questions such What successful techniques, tools and healing modalities (both traditional and alternative) are available to survivors who have been ridiculed, manipulated, verbally abused and subject to psychological warfare? What can survivors do to better engage in self-love and self-care? How can they forge the path to healthier relationships, especially if they've been a victim of narcissistic abuse by multiple people or raised by a narcissist? Most importantly, how can they use their experiences of narcissistic abuse to empower themselves towards personal development? What can their interactions with a narcissistic abuser teach them about themselves,their relationship patterns and the wounds that still need to be healed in order to move forward into the happy relationships and victorious lives they do deserve?",
  "genres": [
    "Psychology",
    "Self Help",
    "Nonfiction",
    "Mental Health",
    "Relationships",
    "Audiobook",
    "Abuse"
  ],
  "author": "Shahida Arabi",
  "average_rating": "4.19",
  "url": "https://www.goodreads.com/book/show/29528716-becoming-the-narcissist-s-nightmare"
}