{
  "title": "Driftwood Cove Trilogy: Complete Series",
  "description": "Driftwood Cove is an exciting thriller series that follows the erotic adventures of Linda St. John.Book I: Watch MeAs the young mayor's widow in a small coastal town, she was known for beauty, intelligence and wealth. But as mistress to a secret club filled with unspoken pleasures, falling in love was the last thing Linda St. John ever wanted. When a brash, uninvited new subject finds his way aboard her private yacht, Linda becomes dangerously involved in an affair that could expose her voyeuristic secrets to the entire town. The unforgettable first erotic novella from the Driftwood Cove series, Watch Me begins with the unexpected excitement of domination and climaxes with the wicked resolve of discipline.Book II: Dangerous AffairOn the run to avoid arrest and exposure, Linda St. John sails to find protection within the arms of the only man she believes she can still trust: her first love. Their journey began with the optimism of youth, but now as the arm of a major drug cartel, Derek could be a gamble far greater than Linda is prepared for. An adventure of disciplined exploration, Dangerous Affair tests the limits of Linda's control in a deadly game of cat and mouse. Book III: FallenAfter fleeing a disastrous affair in the Mexican Riviera, Linda St. John vows never to let herself fall in love again. She abandons the voyeuristic trappings of her secret pleasures club and finds a quiet new home in the seaside hills of Driftwood Cove for her self-imposed exile. When Jacob and his motorcycle roar back into her life seeking the affections she once denied him, Linda tests her resolve to enjoy the young man's sexual passions while remaining detached from the love he so desperately wants. It is a bold venture that blinds her from the terrifying secret that Jacob has been keeping from Linda since she abandoned him in Puerto Vallarta. A story of secrets and lies, Fallen races from innocent flirtation to devious climax.",
  "genres": [],
  "author": "E.C. Towers",
  "average_rating": "3.67",
  "url": "https://www.goodreads.com/book/show/29543249-driftwood-cove-trilogy"
}