{
  "title": "Command Decision",
  "description": "New York Times and USA TODAY Bestselling author of Science Fiction, Urban Fantasy, and Paranormal Romance brings another action, adventure, and suspense-filled story to transport readers out of this world. In a world gone crazy, it is often the humans who are at fault, seeking answers to questions we are not yet ready to understand... Lt. Commander Joshua Manson's focus on his career has taken him to many places, just not the one he has always dreamed of going into space. His sometimes controversial methods during missions have given him the reputation of being a soldier who doesn't always play by the rule book. A summons to Washington, D.C. after a challenging mission leaves him questioning if he'll have a career at all; but once there, Josh is surprised when he is offered the chance of a lifetime, to command a mission in space to investigate an unknown object. The more he learns, the more determined he is to lead it, even if it means a one way ticket. Cassa de Rola's family has lived for centuries in the quiet valley where they farm. Her family has tried to remain untouched by the growing unrest between the intergalactic military forces fighting for control over their planet. All of that changes when an unusual object falls from the sky and Cassa finds a strange male in the container. She knows that taking him in will endanger the lives of everyone close to her, but she can't leave him defenseless. Now, the military forces on both sides want to discover the origins of the container and its missing contents. When the fight between the Legion and the Gallant Order escalates to all-out war, a new rebel leader emerges from the stars that will change the galaxy, and Cassa's life, forever.",
  "genres": [
    "Science Fiction",
    "Romance",
    "Aliens",
    "Fantasy",
    "Audiobook",
    "Action",
    "Science Fiction Romance"
  ],
  "author": "S.E. Smith",
  "average_rating": "3.90",
  "url": "https://www.goodreads.com/book/show/29539347-command-decision"
}