{
  "title": "Unfaithful",
  "description": "DESPERATE DECISIONSA Secret that Should Never Have Been RevealedA dark reality lies hidden under our very eyes.Since their creation, the Màsala have enforced the destiny of humankind on Earth through the Subterraneans, Angels condemned to carry the weight of death on their shoulders in order to please Fate. Evan, a Subterranean, has denied his own nature in order to protect Gemma, the girl he was sent to kill and with whom he has fallen hopelessly in love.But what are the consequences of cheating Death?Five months have gone by since her last encounter with Death, and in spite of having experienced the most intense period of happiness in her life at Evan's side, Gemma's instinct reminds her that the game is far from over. Evan, overconfident, lets his guard down, revealing an unmentionable secret—an error that can be paid for only with blood. Death returns to claim Gemma, sending its faithful servants to kill her. Desperate, Evan will do anything to save her, but the menace will seek them out even where they feel safest . . . The challenge between passion and death will pit the protagonists against each other. In the face of jealousy, betrayal, and emotional devastation, Evan and Gemma find it isn’t easy to escape their fate.Join the Touched Saga Newsletter. Be the first to know when Unfaithful will be released!http://eepurl.com/bR8EuTTouched Saga Reading Order:1. Touched - The Caress of Fate2. Unfaithful - The Deception of Night (April, 2016)3. Brokenhearted - The Power of Darkness4. Expiation - The Whisper of Death Short Stories (you can read them before or after Touched):Gemma's Prequel : The Shadow of FateEvan's Prequel: The Mark of Fate (May, 2016)",
  "genres": [
    "Fantasy",
    "Angels",
    "Young Adult",
    "Romance",
    "Paranormal",
    "Paranormal Romance",
    "Urban Fantasy"
  ],
  "author": "Elisa S. Amore",
  "average_rating": "4.30",
  "url": "https://www.goodreads.com/book/show/29543118-unfaithful"
}