{
  "title": "Don't Call Me Brother: A Ringmaster's Escape from the Pentecostal Church",
  "description": "Austin Miles has been a well-known circus ringmaster for most of his adult life. It was, he found, good preparation for his experiences with PTL and the Assemblies of God churches. Miles is the first ordained Assembly of God minister to leave the movement and write an in-depth book revealing the inner workings of this sect. This is not rumor, not innuendo. It is fact, seen first-hand, and fully described for the first time. Don't Call Me Brother is not a book written by an outside observer - Austin Miles was an active participant in the evolution of the PTL Club.- Austin Miles was on intimate terms with the entire cast of PTL's characters and the high-tech world of Christian movers and Jim Bakker, Tammy Faye Bakker, Pat Robertson, Charles and Frances Hunter, Richard Dortch, John Wesley Fletcher, Christian celebreties such as Pat Boone and Ephram Zimbalist, Jr., and many others.- Austin Miles opened the door on the steam room where Jim Bakker was cavorting - in the nude - with three other men.- Austin Miles was there when televangelism hatched its super-successful fund-raising schemes, and he participated in the staged \"financial crisis\" telethon, during which millions of dollars poured into the coffers of the PTL Club.- Austin Miles watched the development of Jim Bakker's violent mood swings and saw the chilling possibility that Jim Bakker could have become another Jim Jones.- Austin Miles was there when Jim Bakker started a fist fight with his producer over the favors of the current Miss America.Austin Miles had fame, wealth, and a wonderful family. But by the time he finally broke free of the fanatic world of the religious right, he had lost everything. Don't Call Me Brother is his story. A poignant, outrageous, sometimes hilarious drama peopled with colorful real-life characters. Building to a climax with a surprise double-twist ending, this story is tough but fair, a must-read for those who want to know what really happens in the world of America's media-glitzed charismatic religions.",
  "genres": [
    "Nonfiction"
  ],
  "author": "Austin Miles",
  "average_rating": "3.61",
  "url": "https://www.goodreads.com/book/show/1183998.Don_t_Call_Me_Brother"
}