{
  "title": "Alien General's Beloved",
  "description": "Only one general can stand between an ancient nightmare and the safety of his people...  This is a 100 k full scifi romance novel featuring a BBW human heroine and a growly alpha male Brion warrior general. It can and should be read as a standalone and has a guaranteed HEA ending! Grab it now for 99 Cents for a limited time!  Lana Cormac is a woman with a mission. As the captain of a scouting vessel for the Galactic Union, the curvy woman has always put her crew first and herself second. But when two men more myth than reality bursts into her life, she needs to step back and wonder whether she's been doing things the wrong way all along. Stuck between two Brion generals, both convinced that she can be his and only his, Lana needs to walk a tightrope between keeping a fleet of innocent people alive while subsequently coming to grips with what fate has in store for her.  Could it truly be a Brion general and if so, couldn't he have picked a less horrible time to show up!?  Corden is a Brion general unlike any other. He is the guardian, the keeper of order for all of the generals, though there are few who know this. Defeat is not a word he recognizes, yet when something out of the darkness of Brion culture comes back to haunt him, even Corden needs to consider the option. But what he isn't prepared for is that his greatest enemy might come from within, even when the worst nightmare he could imagine is staring him in the eye.  With Lana's heart and safety on the line, Corden has no option but to win. Even the psychotic fervor of a general long thought dead and gone cannot stand in his way, especially when the man wants to claim Corden's chosen!  Will Lana learn to consider the needs of her own heart and will Corden save not only her and the universe, but himself as well?",
  "genres": [
    "Science Fiction",
    "Aliens",
    "Romance",
    "Science Fiction Romance",
    "Fantasy",
    "Futuristic"
  ],
  "author": "Vi Voxley",
  "average_rating": "4.26",
  "url": "https://www.goodreads.com/book/show/29548560-alien-general-s-beloved"
}