{
  "title": "Highvern Ascension",
  "description": "Ivar Trouvé is a fifteen-year-old boy like any other – interested only in messing around with his best friend Enzo and getting up to no good.  In 1939 in Eastern France, a continent finds itself in the midst of catastrophic war. But, this is nothing compared to an even greater and invisible threat – the apex of an age-old inter-dimensional struggle, waged between two ancient races living beyond our known Universe.  Ivar's life changes forever when he is scouted as an unknowing saviour for the superhuman race known as the 'Vlearns.' The mysterious and opulent tower of the Highvern becomes the training ground for a gruelling campaign, as the Vlearns prepare for a final stand against an enigmatic foe. But, not all is as it seems, as Ivar's sense of reality - and the lines between right and wrong - become increasingly hazed.  The stakes are immense, as the greatest evil the Universe has ever known pushes towards their ultimate victory. Ivar, Enzo and his new-found friends must band together, but will it be enough to overcome immeasurable odds?  ~  Highvern Ascension comes from fantasy/ sci-fi author Brett Walker, telling the story of Ivar Trouvé and his search for identity in a strange and fantastical new world. While primarily a science-fiction/ fantasy tale, Highvern Ascension is multi-themed, incorporating intriguing magical and historical elements grounded in realistic, contemporary scientific concepts.  Ivar's adventure with the Vlearns is recommended for any keen reader of young-adult sci-fi, fantasy, magical and supernatural fiction.  ~  Brett Walker was born and raised in Brisbane, Australia, the world-renowned home of young-adult sci-fi/ magical realism and (often) unbearable humidity. He lives with his beautiful wife, Steph, and is excited to finally share his pride and joy, Highvern Ascension, with the inhabitants of the endless nothingness of the Universe.",
  "genres": [],
  "author": "Brett  Walker",
  "average_rating": "4.30",
  "url": "https://www.goodreads.com/book/show/29556369-highvern-ascension"
}