{
  "title": "Stealing America",
  "description": "WHY HILLARY, OBAMA, AND THE ENTIRE DEMOCRATIC PARTY ARE NO BETTER THAN A GANG OF THIEVES\nIn the fall of 2014, outspoken author and filmmaker Dinesh D’Souza found himself hauled into federal court for improperly donating money to an old friend’s Senate campaign. D’Souza pleaded guilty and was sentenced to eight months in a state-run confinement center.  There he lived among hardened criminals—drug dealers, thieves, gangbangers, rapists, and murderers. Now the bestselling author explains how this experience not only changed his life, but fundamentally transformed his view of his adopted country.Previously, D’Souza had seen America through the eyes of a grateful immigrant who became successful by applying and defending conservative principles. Again and again, D’Souza made the case that America is an exceptional nation, fundamentally fair and just. In book after book, he argued against liberalism as though it were a genuine movement of ideas capable of being engaged and refuted.But his prolonged exposure to the criminal underclass provided an eye-opening education in American realities. In the view of hardened criminals, D’Souza learned, America is anything but fair and just. Instead, it is a jungle in which various armed gangs face off against one another, with the biggest and most powerful gangs inhabiting the federal government. As for American liberalism, it is not a movement of ideas at all but a series of scams and cons aimed at nothing less than stealing the entire wealth of the nation, built up over more than two centuries: the total value of the homes, the lifelong savings of the people, the assets of every industry, and all the funds allocated to health and education and every other service, both public and private. “The thieves I am speaking about want all of it.”And who are the leading figures in this historically ambitious scam that has turned the federal government into a vast and unprecedented shakedown scheme? Why, none other than Barack Obama and Hillary Clinton – the current leaders of the Democratic Party. This pair of smooth-talking con artists, trained in the methods of radical activist Saul Alinsky, have taken his crude but effective political shakedown techniques to a level even he never dreamed of.As the nation approaches a crucial election in 2016, Stealing America is an urgent wakeup call for all Americans who want to prevent this theft from being completed by eight more years of Democratic rule.",
  "genres": [
    "Politics",
    "Nonfiction",
    "History",
    "Biography",
    "American",
    "Political Science",
    "Crime"
  ],
  "author": "Dinesh D'Souza",
  "average_rating": "4.27",
  "url": "https://www.goodreads.com/book/show/29552940-stealing-america"
}