{
  "title": "What Women Really Want from Men: A Step-by-Step Dating Manual",
  "description": "This book offers a road map for smart, straight men who’d like to find and establish ongoing, satisfying relationships with attractive women they enjoy and respect. Based on interviews with women, the author shares exactly what women want from men at each step in the dating process. Although written for men, women are finding the book helpful too.  • Key points are presented in “Dos” and “Don’ts” boxes with bulleted lists. • The range of what women want is illustrated in boxes of “Quotes” from interviewees. • The “Mastery Topics” help readers fine-tune their dating skills and troubleshoot to reach their goals. • A detailed Table of Contents makes it simple to jump directly to any subject of interest. • The book is color-coded and formatted graphically to make it easy to find just what you need.  Although the first audience for the book is men, the author believes many women will find it helpful – to give to male friends or family members, boyfriends or partners – or to read themselves. She says:  “Women sometimes don’t know what to expect or do when they re-join the dating world after a break. I know I didn’t. What Women Really Want from Men helps women learn from other women what they might anticipate at different stages in the dating process. Lots of women also have a hard time understanding where men are coming from – and how guys experience dating and relationships differently – just like men have a hard time understanding how women think and feel about dating and relationships.  Much of this information can help people who are already in relationships, since the things that make men and women feel good during dating need to keep happening during a relationship in order for it to be successful. I hope this book will serve as a bridge between men and women, helping with the process of ‘cross-cultural communication,’ so that everyone wins.”  Rubin began work on this book after several years of dating following the end of a long-term relationship. Her intention and hope was to cultivate a better understanding of dating for herself – and, in the process, to help others with dating success – both men and women.  The idea for the book came out of a conversation with a guy friend when they were discussing the trials and tribulations of dating. He said: “I don’t want to read another book written by a man about dating. Why don’t you write one?” Rubin decided to do just that.",
  "genres": [],
  "author": "Melanie Rubin",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/29555551-what-women-really-want-from-men"
}