{
  "title": "They Were Like Family to Me: Stories",
  "description": "*Finalist for the 2016 Story Prize*Honorable Mention for the 2017 ALA Sophie Brody Medal for Achievement in Jewish Literature*A Spring 2016 Discover Great New Writers selection at Barnes & Noble“An absolutely dazzling triumph…A singularly inventive collection” (Jewish Book Council) of linked stories set in a German-occupied town in Poland during World War II, where tales of myth and folklore meet the real-life monsters of the Nazi invasion.1942. With the Nazi Party at the height of its power, Hitler’s SS fires up the new crematorium at Auschwitz and the occupying army empties Poland’s towns and cities of their Jewish citizens. As neighbor turns on neighbor and survival depends on unthinkable choices, Poland has become a moral quagmire, a place of shifting truths and blinding ambiguities. “Filled with rich attention to the details of flora and fauna and insightful descriptions of the nuances of rural and small-town life” (Pittsburgh Post-Gazette). Helen Maryles Shankman shows us the people of Wlodawa, a remote Polish town at a crossroads: we meet an SS officer dedicated to rescuing the creator of his son’s favorite picture book; a Messiah who announces that he is quitting; a Jewish girl who is hidden by an outspoken anti-Semite—and his talking dog. And walking among these tales are the enigmatic Willy Reinhart, Commandant of the forced labor camp who has grand schemes to protect “his” Jews, and Soroka, the Jewish saddlemaker and his family, struggling to survive. “Moving and unsettling...Like Joyce’s Dubliners, this book circles the same streets and encounters the same people as it depicts the horrors of Germany’s invasion of Poland through the microcosm of one village....A deeply humane demonstration of wringing art from catastrophe” (Kirkus Reviews), They Were Like Family to Me (originally called In the Land of Armadillos) is a testament to the persistence of humanity in the most inhuman conditions.",
  "genres": [
    "Short Stories",
    "Historical Fiction",
    "Fiction",
    "Holocaust",
    "Magical Realism",
    "World War II",
    "War"
  ],
  "author": "Helen Maryles Shankman",
  "average_rating": "4.45",
  "url": "https://www.goodreads.com/book/show/29562625-they-were-like-family-to-me"
}