{
  "title": "Seven Stories",
  "description": "Save the WordsWhile waiting for his flight, a chat window opens on a man’s laptop. A ladyfriend from Ecuador he’s met only on the net starts describing his dress? He is flabbergasted and starts searching frantically for a lady with a laptop…but finds none. Who could it be…?Nude PortraitA man discovers a nude portrait of his wife in an art gallery? He is shattered and confronts her for having posed in the nude for some unknown lover in her past. But she never posed!Drifting ShadowAn ex-Army officer turned artist takes up residence with an old lady in a posh area of Bombay. Deserted by her daughter as a consequence of her indiscretion, the lady lives alone. Having had an abortive relationship with a married woman, the army-man finds himself in a similar situation. The two coexist peacefully until harassed by the land mafia, resulting into relocation into the pristine hills of Lonavala. There they open a resort, and are surprised when visited by unexpected guests.The Seven WoodShattered by the infidelity of his wife, a man devices an ingenious plot to get rid of the lover, his subordinate, without leaving a trace.Lady with Long HairA beautiful girl in distress, in a running train, seeks the help of an ex-military man to hide her jewellery from the clutches of her greedy mother-in-law, who plans to gift it to her daughter. The girl has managed to replace the original box with a dummy. Does she get away with it?The Great EscapeThe murder of a prosperous jeweler in a running train leaves five passengers in a rail car suspecting each other in total confusion. No one could’ve come from outside. The jeweler's briefcase containing precious jewels is missing. The culprit, the least suspected, has ingeniously put away the briefcase out of sight. Before the police arrive at the next station, pretending to release his bladder, the crook walks away with the briefcase never to be seen again.The Last PuffA young fighter pilot shares a cigarette with a friend before dashing away for a dual sortie. Within minutes there’s an explosion. The cigarette he shared is still smoking in the ashtray!",
  "genres": [],
  "author": "Ravi Bedi",
  "average_rating": "3.86",
  "url": "https://www.goodreads.com/book/show/29561850-seven-stories"
}