{
  "title": "Hockey Wives Box Set",
  "description": "Hockey Wives Romance Boxed Sets! 4 Steamy Hot Sports Romance Bestsellers In 1!  Book 1: Power Play  Angela finds herself in a deep depression when her friend Carol suggests they attend a hockey game. She figures a simple night out with her best friend will help cheer her up. So what if she doesn't like hockey?  Paul is the captain of the Boston hockey team as he provides veteran leadership to a young talented club. To the outsider, the rugged defenceman appears to have it all. He is rich and has a beautiful sexy wife. His team is in first place and is the prime contender for the Cup. Unfortunately things aren't as rosy as they appear. Paul is having troubles at home and even more trouble keeping his stick in his pants on long lonely road trips.  When Boston falls behind early to one of the worst teams in the league, Paul flies off the handle and rips into one of the team’s young stars. Will Paul's outburst help the team right the ship or further alienate him from the team’s young core? Will Paul behave himself after the game when he notices Angela blushing every time he meets her gaze?  Book 2: Game Misconduct  Enraged to find her husband with another woman, Vanessa tries to attack Angela in the hotel room. With help from Paul, Angela manages to escape, but feels traumatized by the experience.  Vanessa and Paul return to Boston with their marriage in shambles and full of uncertainty. Vanessa decides that she still loves Paul and wants to keep their marriage together, but cannot rid herself of the rage she feels because of his betrayal. Nothing she does can alleviate her pain, until the idea comes to her that revenge will cure everything. The chance comes when a Swedish goaltender on the Montreal is traded to Boston. Will Vanessa give in to her vengeful tendencies? Will revenge save her?  In Columbus, Angela struggles with her feelings for Paul after their unforgettable one night stand. By chance, she meets a new arrival to the Columbus Blazers hockey team. Can he make her forget about her experience with his hockey rival?  Book 3: Face Off  The Smith’s marriage is falling apart. Paul slept with Angela in Columbus and Vanessa had an affair with Daniel, the goaltender on Paul’s team. As Vanessa tries to keep her infidelity a secret, Paul meets with an attractive sports psychologist who can either save his marriage or destroy it.  In Columbus, Angela has been seeing a hot hockey star named Luc who has invited her to come to Boston to watch him play. The only problem is that Angela will run the risk of seeing Paul again. She thinks Luc is the perfect man, but she’s scared that she might still have feelings for Paul. What’s worse, and even more frightening for her, is that she might run into Vanessa.  Can Vanessa and Paul ever tell each other the truth and be happy together again? Can Angela continue her relationship with Luc even with her past with Paul looming over her?  Book 4: Interference  Angela feels out of her league when her rich and talented boyfriend, Luc, takes her to Boston to watch his hockey team in the playoffs. Luc seems like the perfect guy, but around every corner there is something that could bring their relationship to an end. Angela must prove to others that she and Luc belong together while fighting off other desires of her own that might arise along the way.  At the same time, Vanessa and Paul try to rebuild their relationship after she admitted to sleeping with the charming Swedish goaltender on Paul's team. Paul may know what the right thing to do is.",
  "genres": [],
  "author": "S.M. Kingdom",
  "average_rating": "2.77",
  "url": "https://www.goodreads.com/book/show/29551854-hockey-wives-box-set"
}