{
  "title": "You, on a Diet: The Owner's Manual for Waist Management",
  "description": "For the first time in our history, scientists are uncovering astounding medical evidence about dieting -- and why so many of us struggle with our weight and the size of our waists. Now researchers are unraveling biological secrets about such things as why you crave chocolate or gorge at buffets or store so much fat.Michael Roizen and Mehmet Oz, America's most trusted doctor team and authors of the bestselling \"YOU\" series, are now translating this cutting-edge information to help you shave inches off your waist. They're going to do it by giving you the best weapon against fat: knowledge. By understanding how your body's fat-storing and fat-burning systems work, you're going to learn how to crack the code on true and lifelong waist management.Roizen and Oz will invigorate you with equal parts information, motivation, and change-your-life action to show you how your brain, stomach, hormones, muscles, heart, genetics, and stress levels all interact biologically to determine if your body is the size of a baseball bat or of a baseball stadium. In \"YOU: On a Diet,\" Roizen and Oz will redefine what a healthy figure is, then take you through an under-theskin tour of the organs that influence your body's size and its health. You'll even be convinced that the key number to fixate on is not your weight, but your waist size, which best indicates the medical risks of storing too much fat.Because the world has almost as many diet plans as it has e-mail spammers, you'd think that just about all of us would know everything there is to know about dieting, about fat, and about the reasons why our bellies have grown so large. \"YOU: On a Diet\" is much more than a diet plan or a series of instructions and guidelines or a faddish berries-only eating plan. It's a complete manual for waist management. It will show you how to achieve and maintain an ideal and healthy body size by providing a lexicon according to which any weight-loss system can be explained. \"YOU: On a Diet\" will serve as the operating system that facilitates future evolution in our dieting software. After you learn about the biology of your body and the biology and psychology of fat, you'll be given the YOU Diet and YOU Workout. Both are easy to learn, follow, and maintain. Following a two-week rebooting program will help you lose up to two inches from your waist right from the start.With Roizen and Oz's signature accessibility, wit, and humor, \"YOU: On a Diet -- The Owner's Manual for Waist Management\" will revolutionize the way you think about yourself and the food you consume, so that you'll diet smart, not hard. Welcome to your body on a diet.",
  "genres": [
    "Health",
    "Nonfiction",
    "Self Help",
    "Diets",
    "Reference",
    "Nutrition",
    "Food"
  ],
  "author": "Michael F. Roizen",
  "average_rating": "3.65",
  "url": "https://www.goodreads.com/book/show/29571.You_on_a_Diet"
}