{
  "title": "Walking Well Again: Neutralize the Hidden Causes of Pain",
  "description": "For millions of Americans living with chronic pain, Walking Well Again is the pathway to rapid recovery. It provides clear guidance for both patients and clinicians to properly investigate symptoms that may be severe, but are often easy to resolve without medicine, injections, or surgery. The most common symptoms addressed include back pain, knee and hip arthritis, and foot and leg pain. They make it difficult for people to walk well, stand comfortably, sleep comfortably, sit or get up from a seated position without pain, and bend over to pick things up. These symptoms are most often attributed to Arthritis, Spinal Stenosis, Fibromyalgia, Diabetic Neuropathy, Poor Circulation, Painful Swollen Legs, or Restless Leg Syndrome. Even if present for years or decades, symptoms can resolve within 1-2 days of proper treatment. Within the practice of the author, patients with these complaints rapidly improve over 70% of the time. Less frequently, he also sees improvement in neck pain, headaches, balance problems, and depression, as is addressed within the book. Over 85 stories of individual patients are included in the book, to help the reader best understand the evaluation techniques that identify the hidden causes of pain, along with tools properly manage them. These 85 are among the over 3500 patients that have enjoyed great relief of chronic symptoms under the care of the author, Dr. Stuart Goldman. Video interviews of over 120 patients, many from the stories within the book, are included on the web site WalkingWellAgain.com. Most of the information is presented so that it can be followed by non medical people without difficulty. Several sections are labeled \"For the Clinician and the Very Curious,\" and have information in greater detail than would be needed by individual patients seeking help. Even those sections are written in a layman's language, with explanation of medical vocabulary. The book includes 28 chapters, and is formally divided into 4 sections. The first section provides a path to understanding symptoms, which are often mistakenly thought to be from common medical diseases or even the normal aging process. The second section focuses on Spinal Stenosis and PseudoStenosis, which are most often the hidden causes of pain. PseudoStenosis is an original classification of the author, who has published many articles related to the subjects of the book. The second section presents the classic understanding and treatment of Spinal Stenosis, Dr. Goldman's original Positional Management approach, and also provides great detail into the importance and management of PseudoStenosis. The third section focuses on common causes and patterns of chronic pain, and facilitates reevaluation of the symptoms and presents paradigms for management, based upon the use of information from Section 2. Conditions specifically addressed include Peripheral Neuropathy, Peripheral Artery Disease (poor circulation), Painful Swollen Legs, Arthritis including Fibromyalgia (two chapters), Shortness of Breath, Restless Leg Syndrome and night time symptoms, Balance problems, Depression, and the resumption of playing Sports. The fourth section has two chapters. Chapter 27 includes 40 stories that either provide new specific insights or reinforce essential concepts through the power of the tale. Chapter 28 provides an overview with direction for larger scale research, and the potential benefits of such research. Finally, there are two appendixes, and an index. In addition to many articles published in Podiatry, Diabetes, and Family Practice journals between 1997 and 2013, Dr. Goldman has also lectured at many Podiatry state and national scientific meetings. He is eager to share the information with both patients and clinicians, and is therefore pleased to present this book with a one month money back guarantee.",
  "genres": [
    "Medicine"
  ],
  "author": "Stuart M. Goldman",
  "average_rating": "4.75",
  "url": "https://www.goodreads.com/book/show/29571072-walking-well-again"
}