{
  "title": "Hoopty Time Machines",
  "description": "HOOPTY TIME MACHINES: fairy tales for grown ups is a collection of forty-five fantastical stories filled with peculiar journeys and wild awakenings, with fairytale heroines, introspective superheroes, and a whole menagerie of monsters—each one deeply human, and a little bit heartbreaking.One of the \"most anticipated small press books of 2016\" (John Madera, Big Other).REVIEWS:\"Funny and devastating.\" – Jennifer Messner, Books, Personally\"The literary equivalent of a perfect mix tape... There are doorstop novels out there that fail to achieve the emotional impact DeWan can generate with a single honest, well-crafted sentence.\" – Laura Garrison, Jersey Devil Press\"Imaginative and terrifying.... Be warned, reader, there is danger here, and you will certainly welcome it.\" – The Wild HuntADVANCE PRAISE:\"There are hints of Barthelme, Vonnegut, and Calvino to be found here, but make no mistake: DeWan is something gloriously new.\" – Nathan Ballingrud, author of North American Lake Monsters\"Like Barry Yourgrau went on tour with sad, lyrical stand-up routines—funny, sharp, playful zingers of stories that reach right out to grab a reader.\" – Aimee Bender, author of The Particular Sadness of Lemon Cake\"Hoopty Time Machines is much like a bag of M&M's, in that it's nearly impossible, once you've opened it, not to consume it down to the last morsel, and fast. It is less like a bag of M&M's in that you never know what you'll find beneath the candy coating: a peanut or an amphetamine, a rosary bead or a thumbtack.\" – Kevin Brockmeier, author of The Illumination\"Christopher DeWan's Hoopty Time Machines is that rare story collection that is both a total blast to read and a complete philosophical package. These abrupt, funny, vigorous stories—involving urban legends, minotaurs, little mermaids, chupacabras, and changelings—contain in their brevity vast depth and import. These are stories to read, reread, and perennially enjoy.\" – Sharma Shields, author of The Sasquatch Hunter's Almanac\"An absolute delight from the first page to the last: it's like that scene in Singin' in the Rain, only with ideas instead of puddles.\" – Ben Loory, author of Stories for Nighttime and Some for the Day\"Sometimes funny, often tragic, usually bizarre, and always interesting.\" – Ramona Ausubel, author of Sons and Daughters of Ease and Plenty",
  "genres": [
    "Short Stories",
    "Fiction",
    "Fantasy"
  ],
  "author": "Christopher DeWan",
  "average_rating": "4.67",
  "url": "https://www.goodreads.com/book/show/29564518-hoopty-time-machines"
}