{
  "title": "Geeks & Greeks",
  "description": "== STORY ==Geeks & Greeks is Good Will Hunting meets Animal House in graphic novel format. In this high-tech battle royale two of MIT's smartest students square off in an escalating war of pranks and egos. Jim Walden is an underachieving freshman with a knack for mischief and a secret that could end his career before it begins. Luke Bardolf is a gruff alpha-nerd senior on a mission to pull the ultimate prank and maintain dominance over his fraternity. When their rivalry comes to a head, it will take all of Jim's creativity and resourcefulness to save his scholarship, his friendships, his girlfriend, and his dream of becoming an astronaut.== INSPIRED BY ACTUAL EVENTS ==Geeks & Greeks was written by humorist Steve Altes and is based on MIT's world-famous hacking culture and real-life hazing incidents Altes witnessed as an MIT student. At MIT a hack is a clever, humorous, technically sophisticated prank, such as building a life-size campus police car replica atop the Institute's 150-foot-high \"Great Dome\" under the cover of night.This extensively researched 182-page coming-of-age story includes over 100 endnotes providing colorful background details on true aspects of the story as well as revealing numerous Easter eggs which will delight readers of all stripes. These endnotes divulge the many scientific, literary, and pop cultural allusions the creators have embedded in the graphic novel.== SMART HUMOR ==How many graphic novels can make jokes out of Schubert's last symphony, Archimedes' Principle, supernovas, cryogenics, kinematic viscosity, Shakespearean characters, and Einstein's theory of relativity and still keep things fully accessible to the general public? According to Steve Altes, \"You don't need to be a genius to understand Geeks & Greeks, but you'll feel like a genius after you read it.\"== THEMES ==Geeks & Greeks explores many themes that are relevant to techies, college students, and fans of young adult literature: geek as hero, hazing, college pranks as a form of civil disobedience or performance art, Emersonian notions of self-reliance and non-conformism (\"imitation is suicide\"), role of mischief-making in male bonding, and credentialism (raw talent vs. institutional pedigree).",
  "genres": [
    "Fiction"
  ],
  "author": "Steve  Altes",
  "average_rating": "3.78",
  "url": "https://www.goodreads.com/book/show/29571090-geeks-greeks"
}