{
  "title": "The Purple Diaries: Mary Astor and the Most Sensational Hollywood Scandal of the 1930s",
  "description": "One of Hollywood s first scandals was nearly its last.  1936 looked like it would be a great year for the movie industry. With the economy picking up after the Great Depression, Americans everywhere were sitting in the dark watching the stars and few stars shined as brightly as one of America's most enduring screen favorites, Mary Astor. But Astor's story wasn't a happy one. She was born poor, and at the first sign that she could earn money, her parents grabbed the reins and the checks. Widowed at twenty-four, Mary Astor was looking for stability when she met and wed Dr. Franklyn Thorpe. But the marriage was rocky from the start; both were unfaithful, but they did not divorce until after Mary Astor gave birth to little Marylyn Thorpe.  What followed was a custody battle that pushed The Spanish Civil War and Hitler's 1936 Olympic Games off of the front pages all over America. Astor and Thorpe were both ruthless in their fight to gain custody of their daughter, but Thorpe held a trump card: the diaries that Mary Astor had been keeping for years. In these diaries, Astor detailed her own affairs as well as the myriad dalliances of some of Hollywood's biggest names. The studio heads, longtime controllers of public perception, were desperate to keep such juicy details from leaking.  With the complete support of the Astor family, including unlimited access to the photographs and memorabilia of Mary Astor's estate, The Purples Diaries is a look at Hollywood s Golden Age as it has never been seen before, as Egan spins a wildly absorbing yarn about a scandal that threatened to bring down the dream factory known as Hollywood.\"",
  "genres": [
    "Nonfiction",
    "Biography",
    "History",
    "Film",
    "Audiobook",
    "Biography Memoir",
    "Media Tie In"
  ],
  "author": "Joseph  Egan",
  "average_rating": "3.77",
  "url": "https://www.goodreads.com/book/show/29584835-the-purple-diaries"
}