{
  "title": "A History of Medicine in 50 Objects",
  "description": "Praise for A History of Music in 50 Instruments , also in this \"Wilkinson's history unfolds like a symphonic work with instrument makers, composers and virtuosic performers picking up these incredible creations and exposing their beauty and capability. To open it up is to be instantly hooked.\"-- Publishers Weekly A History of Medicine in 50 Objects takes readers on a 12,000-year journey to explore significant items that have advanced medical knowledge and practice. The fifty objects range from the everyday (a bottle of Aspirin) to singular medical advances (heart transplant pioneer Christian Bernard on the cover of TIME magazine). The objects are presented chronologically and described in two to four pages with illustrations, 150 beautiful archive images in all. Fact boxes note Location, Date, and Field, for example, epidemiology. Engaging text describes the artifacts in their social and cultural context, as well as their role in disease treatment and prevention. Centuries of invention and risk-taking have saved lives and advanced life expectancy. The first object is a Neolithic skull (ca 10,000 BCE) showing evidence of trephination, a hole deliberately cut into the skull of a living person and likely the first surgical practice. It was done widely well into the Renaissance, with surprising success, and is still done today, though rarely. The last object, like many others, was borne of tragedy. It is the protective gear designed for medical workers during the 2014 Ebola virus outbreak. The objects come in all shapes and sizes -- an X-ray diffraction image of a DNA molecule; the first tuberculosis sanatorium. They are the everyday and the extraordinary -- a thermometer; a thought-controlled prosthetic limb. They are of society and of controversy -- cigarette package health warnings; Sigmund Freud's couch. All have a fascinating and entertaining story to tell about medicine as it unfolded over millennia. A History of Medicine in 50 Objects is an essential choice for general and specialty collections. Like the other titles in The History of... series, it is an exceptional selection for reluctant readers.",
  "genres": [
    "History",
    "Nonfiction",
    "Science",
    "Medicine",
    "Health",
    "Medical",
    "Historical"
  ],
  "author": "Gill Paul",
  "average_rating": "3.86",
  "url": "https://www.goodreads.com/book/show/29598680-a-history-of-medicine-in-50-objects"
}