{
  "title": "First Kiss",
  "description": "The time has finally come for Sang Sorenson to be formally introduced to the Academy. Protocol dictates the boys keep the details of Sang’s official introduction to the Academy a secret from her. The only thing they can advise her to do is to work on what will become her mantra: She is determined to stay with her team, no matter what.  Despite her wishes, however, the boys are second-guessing her place with them, concerned for her safety. With dangers all around and threats closing in, some of the boys are questioning if this is the right time to bring her to meet the Academy at all.  Sang is challenged with being the brave face among them and instilling the confidence needed to keep her with them. However, in order to appear compliant with the Academy’s rules, she has to be willing to listen and try their suggestions. As the boys have suspected and feared, the council wants to see how she’ll work with a different team. An all-girl team. She has no choice but to go along with the proposal or risk losing a shot at the Academy.  But when the Academy’s inner world is revealed to her, Sang knows that she’s finally found her place—somewhere she belongs—and she sees a future with them. The deeper she gets, the more she sees how she can make a difference. Learning what she is capable of and the impact she can have, she feels obligated to help. There’s so few girls, and they need her.  The guys try to stick to their plan, but every team must pay their debts, and the cost of keeping her might be more than any of them can afford.  It’s up to Sang alone to prove to the Academy where she truly belongs—but can she resist the call of a new team that needs her?  The Academy, Inside",
  "genres": [
    "Reverse Harem",
    "Romance",
    "Young Adult",
    "Contemporary",
    "High School",
    "Slow Burn",
    "Fiction"
  ],
  "author": "C.L. Stone",
  "average_rating": "4.46",
  "url": "https://www.goodreads.com/book/show/29579309-first-kiss"
}