{
  "title": "Rumo & Die Wunder im Dunkeln",
  "description": "Im fünften Kapitel seiner 13 1/2 Leben nahm Käpt'n Blaubär als Navigator des vagabundierenden Rettungssauriers Mac an einer folgenschweren Aktion Er befreite Dutzende kleiner, herzzerreißend jaulender Wolpertingerwelpen aus einem Haus, das nur Sekundenbruchteile später von einem Bolloghintern zerquetscht werden sollte. Sieben Leben später begegnete er einem dieser Welpen wieder, der inzwischen zu einem ausgewachsenen Raubtier im Dienste des Lügentycoons Volzotan Smeik herangewachsen war. Aus Dankbarkeit befreite der Wolpertinger Blaubär aus den Klauen seines Chefs. Sein Name war Rumo. Zu Beginn des neuen Zamonien-Romans ist Rumo noch ein kleiner, schutzbedürftiger Welpe, der von Fhernhachenzwergen auf einem Bauernhof aufgezogen und verhätschelt wird. Diese Idylle hat jedoch bald ein Eine Horde bösartiger Teufelszyklopen überfällt das Anwesen und verschleppt alles, was sich bewegt. Und so verbringt Rumo seine intensivste Wachstumsphase in der Speisekammer auf den Teufelsfelsen, einer schwimmenden Insel. Dort halten die Zyklopen ihre lebendige Nahrung, und mit Gier und Begeisterung sehen sie zu, wie Rumo immer größer und appetitlicher wird. Glücklicherweise findet der verängstigte Wolpertinger unter den Gefangenen bald einen Die Haifischmade Volzotan Smeik -- genau, der spätere Lügentycoon -- nimmt den Welpen unter seine Fittiche. Er erzählt ihm Geschichten und bringt ihm viel Wissenswertes über das Leben in Zamonien bei, bis Rumo zu seiner endgültigen Größe herangewachsen ist und die beiden Fluchtpläne schmieden können. Bald erleben die Teufelszyklopen ihr blaues Wunder! So weit nur das erste der zahlreichen neuen Abenteuer aus der fantastischen Welt Zamoniens. Neben einer ganzen Reihe von Figuren aus den 13 1/2 Leben und Ensel und Krete hat Walter Moers viele neue ungewöhnliche Gestalten ersonnen. Auch Rumo ist eine eigenwillige und eigenständige Hauptfigur, die Moers zu gänzlich neuen Betrachtungen Anlass bietet. Ein Geschenk des Himmels für Zamonien-Fans also, ein dicker Schmöker voll schräger Ideen und abgefahrener Zeichnungen. Computer abschalten und den Telefonstecker ziehen -- und den Nachbarn Bescheid sagen, dass lautes, lang anhaltendes Gelächter kein Anzeichen aufkeimenden Wahnsinns ist. Der neuen Moers ist eben erschienen. --Hannes Riffel",
  "genres": [
    "Fantasy",
    "Fiction",
    "Humor",
    "German Literature",
    "Audiobook",
    "Adventure",
    "Young Adult"
  ],
  "author": "Walter Moers",
  "average_rating": "4.52",
  "url": "https://www.goodreads.com/book/show/296044.Rumo_Die_Wunder_im_Dunkeln"
}