{
  "title": "365 Days of Clean Eating Recipes",
  "description": "Eating over-processed food or junk food can have a negative impact on your mind and body over time. Your body can become sluggish and your mind can stop functioning properly as well – fatigue, not being able to focus properly, all of these are effects of a diet that lacks nutrients. Your body and mind failing on you is the worst feeling ever!But it’s time to get back on track! Change your lifestyle today by eating food that it’s close to its natural state, food that has more nutrients than chemicals. This book contains everything you need to get you started on that! From an easy-to-understand explanation of what clean eating is, to a whole range of recipes, the information found between these pages is enough to offer you a good start towards an improved health, more energy and better state of mind.Wait no more! Get your copy today and enjoy recipes like: overnight chia pudding, quinoa crusted quiche, creamy avocado soup, bouillabaisse, tomato fish bake, chimichurri salmon or apricot galette and amaretto baked pears!Eating over-processed food or junk food can have a negative impact on your mind and body over time. Your body can become sluggish and your mind can stop functioning properly as well – fatigue, not being able to focus properly, all of these are effects of a diet that lacks nutrients. Your body and mind failing on you is the worst feeling ever!But it’s time to get back on track! Change your lifestyle today by eating food that it’s close to its natural state, food that has more nutrients than chemicals. This book contains everything you need to get you started on that! From an easy-to-understand explanation of what clean eating is, to a whole range of recipes, the information found between these pages is enough to offer you a good start towards an improved health, more energy and better state of mind. Wait no more! Get your copy today and enjoy recipes like: overnight chia pudding, quinoa crusted quiche, creamy avocado soup, bouillabaisse, tomato fish bake, chimichurri salmon or apricot galette and amaretto baked pears!",
  "genres": [
    "Cookbooks",
    "Nonfiction",
    "Health",
    "Reference"
  ],
  "author": "Emma Katie",
  "average_rating": "3.84",
  "url": "https://www.goodreads.com/book/show/29610468-365-days-of-clean-eating-recipes"
}