{
  "title": "Codebreakers: The Inside Story of Bletchley Park",
  "description": "Familiar to anyone versed in the history of World War II or interested in the study of modern intelligence work, Bletchley Park was arguably the most successful intelligence operation in world history, the top secret workplace of the remarkable people who cracked Germany's vaunted Enigma Code. Almost to the end of the war, the Germans had firm faith in the Enigma ciphering machine, but in fact the codebreakers were deciphering nearly 4,000 German transmissions daily by 1942, reaping a wealth of information on such important matters as the effort to resupply Rommel's army in North Africa and the effect of Allied attempts to mislead the Germans about the location of D-Day landings. Indeed, Winston Churchill hailed the work of Bletchley Park as the \"secret weapon\" that won the war.Only now, nearly half a century since the end of the Second World War, have any of the men and women in this group come forward to tell this remarkable story in their own words--a story that an oath of secrecy long prevented them from revealing. In Codebreakers , F.H. Hinsley and Alan Stripp have gathered together twenty-seven first-hand accounts of one of the most amazing feats in intelligence history. These engaging memoirs, each written by a different member of the codebreakers team, recount the long hours working in total secrecy and the feelings of camaraderie, tension, excitement, and frustration as these men and women, both British and American, did some of the most important work of the war. These talented people share not only their technical knowledge of cryptography and military logistics, but also poignant personal recollections as well. Walter Eytan, one of a handful of Jews at Betchley Park, recalls intercepting a message from a German vessel which reported that itcarried Jews \" en route for Piraeus zur Endlosung (for the final solution).\" Eytan writes \"I had never heard this expression before, but instinctively, I knew what it must mean, and I have never forgotten that moment.\" Vivienne Alford tells of her chilling memory of hearing that the atomic bomb had been dropped on Hiroshima, and the stillness that came over her and her co-workers in Naval Section VI. And William Millward confides that he is still haunted by the work he did in Hut 3 nearly fifty years ago. \"I sometimes wonder, especially during the night, how many sailors I drowned.\"Few readers will finish this book without feeling that the codebreakers were essential to the outcome of the war--and thereby of major importance in helping to shape the world we live in today.",
  "genres": [
    "History",
    "Nonfiction",
    "World War II",
    "Espionage",
    "War",
    "Military Fiction",
    "Science"
  ],
  "author": "F.H. Hinsley",
  "average_rating": "3.73",
  "url": "https://www.goodreads.com/book/show/29609.Codebreakers"
}