{
  "title": "The Tuscan Secret: A tangle of love and war in the Italian Apennines",
  "description": "If you love Italy, you will enjoy this passionate historical fiction based on real lives. \"Tuscan Roots\", (or \"The Tuscan Secret\") is described by Ingenue Magazine as \"a love letter to Italy\". In 1943, in occupied, war-torn Italy, Ines Santini's sheltered existence is turned upside down when she meets Norman, an escaped British POW.In 1999, Anna Swilland, their daughter, starts to unravel Italian war stories from diaries left to her after her mother's death. She travels to the breathtakingly beautiful Tuscan Apennines, where the family saga and romance unfolds.In researching her parents' past, she will discover secrets about the war, her parents' hardship and herself, which will change her life forever...\"Petch nicely combines fictional characters with the real background through her Italian family connections and living in a present-day Tuscan home (Il Mulino - The Mill). [There} she has studied oral, visual and written sources that give the novel convincing authenticity...\" Sam Merry.The tale alternates between the present and the past, which finally come together in a surprising twist.The central hero is always Italy and the spirit of its people against the slumbering ghost of Mussolini's war. \"But always the beautiful countryside and warmth of its people bubble up through every page, haunting the story's duality of love and hate... this story is ultimately about human hope and by the end, you will have fallen in love with Italy. You may even be desperate to visit Angela Petch's 'Il Mulino' in the beautiful Apennines, where you may take a holiday.\" Sam Merry\"Tuscan Roots\" (or \"The Tuscan Secret\") is more than a love story. Those who love Italy, its geography and culture, will hopefully be drawn to this book as will readers with a curiosity for how war can both divide and unite people of differing backgrounds.",
  "genres": [
    "Historical Fiction",
    "Italy",
    "Fiction",
    "World War II",
    "Romance",
    "War",
    "Book Club"
  ],
  "author": "Angela Petch",
  "average_rating": "4.19",
  "url": "https://www.goodreads.com/book/show/29614380-the-tuscan-secret"
}