{
  "title": "Defeating Jihad: The Winnable War",
  "description": "Now a New York Times bestseller!America is at war. The fight against global jihad has cost 7,000 American lives and almost $2 trillion, and yet, most Americans do not understand what is at stake. The public lacks knowledge and safety because two presidents and their administrations neglected the most basic strategic who is the enemy?Presidents Bush and Obama both named the global jihadi movement-a movement with an intent to destroy the West-“violent extremism.” Their tidy term was an attempt to maintain peace with the Muslim community. But when they failed to appropriately name the enemy, they failed to fully understand Islamic extremism. This failure is why the U.S. has been in Afghanistan for sixteen years with no end in sight.But this war is eminently winnable if we remove our ideological blinders, accurately name our enemy, and draw up a strategy to defeat the ideas that inspire terrorism. So says Dr. Sebastian Gorka, one of the most experienced and sought-after authorities on counterterrorism.Dr. Gorka has been one of the intelligence community’s go-to experts on counterterrorism since 9/11. He’s been called to brief Congress and the Marine Corps and was asked to analyze the Patriot’s Day Boston Marathon Bombing for the US government. Dr. Gorka’s report for the trial of Dzhokhar \"Jahar\" Tsarnaev was widely circulated in counterterrorism circles and the media because it accurately painted a picture, not of a teenager on the cover of Rolling Stone, but of a terrorist.Dr. Gorka is respected by peers because he understands our enemy is not \"terror\" or \"violent extremism.\" Our enemy is the global jihadi movement, a modern totalitarian ideology rooted in the doctrines and martial history of Islam whose goals are to build an empire, suppress “false Muslims,” and engage in guerilla warfare against infidels.Taking his cue from the formerly top-secret analyses that shaped the U.S. response to the communist threat, Dr. Gorka has produced a compelling profile of the jihadi movement-its mind and motivation-and a plan to defeat it.",
  "genres": [
    "Politics",
    "Nonfiction",
    "History",
    "Military Fiction",
    "War",
    "Terrorism",
    "Military History"
  ],
  "author": "Sebastian Gorka",
  "average_rating": "4.13",
  "url": "https://www.goodreads.com/book/show/29608402-defeating-jihad"
}