{
  "title": "American Dreamer: A Life of Henry A. Wallace",
  "description": "The great politician, agriculturalist, economist, author, and businessman―loved and reviled, and finally now revealed. The great politician, agriculturalist, economist, author, and businessman―loved and reviled, and finally now revealed. The first full biography of Henry A. Wallace, a visionary intellectual and one of this century's most important and controversial figures. Henry Agard Wallace was a geneticist of international renown, a prolific author, a groundbreaking economist, and a businessman whose company paved the way for a worldwide agricultural revolution. He also held two cabinet posts, served four tumultuous years as America's wartime vice president under FDR, and waged a quixotic campaign for president in 1948. Wallace was a figure of Sphinx-like paradox: a shy man, uncomfortable in the world of politics, who only narrowly missed becoming president of the United States; the scion of prominent Midwestern Republicans and the philosophical voice of New Deal liberalism; loved by millions as the Prophet of the Common Man, and reviled by millions more as a dangerous, misguided radical. John C. Culver and John Hyde have combed through thousands of document pages and family papers, from Wallace's letters and diaries to previously unavailable files sealed within the archives of the Soviet Union. Here is the remarkable story of an authentic American dreamer. A Washington Post Best Book of the Year. 32 pages of b/w photographs. \"A careful, readable, sympathetic but commendably dispassionate biography.\"―Arthur Schlesinger, Jr., Los Angeles Times Book Review \"In this masterly work, Culver and Hyde have captured one of the more fascinating figures in American history.\"―Doris Kearns Goodwin, author of No Ordinary Time \"Wonderfully researched and very well written...an indispensable document on both the man and the time.\"―John Kenneth Galbraith \"A fascinating, thoughtful, incisive, and well-researched life of the mysterious and complicated figure who might have become president...\"―Michael Beschloss, author of Taking Charge: The Johnson White House Tapes, 1963-1964 \"This is a great book about a great man. I can't recall when―if ever―I've read a better biography.\"―George McGovern\"[A] lucid and sympathetic portrait of a fascinating character. Wallace's life reminds us of a time when ideas really mattered.\"―Evan Thomas, author of The Very Best Men: The Early Years of the CIA\"Everyone interested in twentieth-century American history will want to read this book.\"―Robert Dallek, author of Flawed Giant \"[T]he most balanced, complete, and readable account...\"―Walter LaFeber, author of Inevitable Revolutions \"At long last a lucid, balanced and judicious narrative of Henry Wallace...a first-rate biography.\"―Douglas Brinkley, author of The Unfinished Presidency\"A fine contribution to twentieth-century American history.\"―James MacGregor Burns, author of Dead Center: Clinton-Gore Leadership and the Perils of Moderation \"[E]minently readable...a captivating chronicle of American politics from the Depression through the 1960s.\"―Senator Edward M. Kennedy \"A formidable achievement....[an] engrossing account.\"―Kai Bird, author of The Color of Truth: McGeorge Bundy & William Bundy, Brothers in Arms \"Many perceptions of Henry Wallace, not always favorable, will forever be changed.\"―Dale Bumpers, former US Senator, Arkansas 32 pages of black and white photographs",
  "genres": [
    "History",
    "Biography",
    "Politics",
    "American History",
    "Nonfiction",
    "American",
    "Biography Memoir"
  ],
  "author": "John C. Culver",
  "average_rating": "4.34",
  "url": "https://www.goodreads.com/book/show/118445.American_Dreamer"
}