{
  "title": "The Alpha's Light: A Paranormal Romantic Fantasy",
  "description": "The Prophesy has come true and the most powerful witch in the world is born. The unbeatable warrior chosen to fight against evil and uphold all that is good.But when her identity is exposed at the age of sixteen, she is forced to go on the run for her life. Hunted down by the forces of evil like an animal. The problem? She won’t receive her magical powers until she is twenty-one. Until then she is just like any other human being.Daniel Redmond’s uncle has had one of his visions. Daniel’s mate is missing. Without her, the world is doomed. And so, he sets out searching for her, but can she keep herself alive long enough for him to find her?But Daniel is told that it is not just her that he has to find, there is also a third mate as well. And he must find them both and bond before her twenty-first birthday or the powers she will receive will kill her.One year to go. Two mates to find. The whole world to search. A bonding to perform. Not much really, should be a piece of cake.But the forces of evil are relentless in their quest to capture his mate. And they’ve just found her again...\"Chloe could feel her whole body fill with dread. Oh god! She couldn’t stay in the truck, they would only force it open. She had to run for it again. Literally.So she inched her way back to the door and just grabbed her ‘emergency’ bag that only held a change of clothes and some food. She already had her money on her and her phone was in her bag too. As soon as she had all she needed, she turned and ran.Knowing that she would never lose them on a straight stretch of road she veered off and headed towards the forest.Another day, another forest. She thought to herself vaguely as she came to the edge of the trees and stopped. She looked back to find the pack of werewolves close now and stalking up to her.Hey, how bad can it be? And making up her mind, she turned back and carried on running into the trees only to trip straight over and land flat on her face in front of four very furry paws that were growling and snarling loudly.Oh, I had to ask didn’t I! When will I ever learn?\"  .",
  "genres": [],
  "author": "E.A. Turley",
  "average_rating": "3.80",
  "url": "https://www.goodreads.com/book/show/29619214-the-alpha-s-light"
}