{
  "title": "Hermaphrodites and the Medical Invention of Sex",
  "description": "Punctuated with remarkable case studies, this book explores extraordinary encounters between hermaphrodites--people born with \"ambiguous\" sexual anatomy--and the medical and scientific professionals who grappled with them. Alice Dreger focuses on events in France and Britain in the late nineteenth century, a moment of great tension for questions of sex roles. While feminists, homosexuals, and anthropological explorers openly questioned the natures and purposes of the two sexes, anatomical hermaphrodites suggested a deeper just how many human sexes are there? Ultimately hermaphrodites led doctors and scientists to another surprisingly difficult what is sex, really?Hermaphrodites and the Medical Invention of Sex takes us inside the doctors' chambers to see how and why medical and scientific men constructed sex, gender, and sexuality as they did, and especially how the material conformation of hermaphroditic bodies--when combined with social exigencies--forced peculiar constructions. Throughout the book Dreger indicates how this history can help us to understand present-day conceptualizations of sex, gender, and sexuality. This leads to an epilogue, where the author discusses and questions the protocols employed today in the treatment of intersexuals (people born hermaphroditic). Given the history she has recounted, should these protocols be reconsidered and revised?A meticulously researched account of a fascinating problem in the history of medicine, this book will compel the attention of historians, physicians, medical ethicists, intersexuals themselves, and anyone interested in the meanings and foundations of sexual identity.",
  "genres": [
    "History",
    "Nonfiction",
    "Science",
    "Gender",
    "Queer",
    "Medical",
    "LGBT"
  ],
  "author": "Alice Domurat Dreger",
  "average_rating": "4.16",
  "url": "https://www.goodreads.com/book/show/296200.Hermaphrodites_and_the_Medical_Invention_of_Sex"
}