{
  "title": "The Wreckage",
  "description": "Having achieved considerable success with his first novel, River Thieves , Michael Crummey has written a book that is equally stunning and compelling. The Wreckage is a truly epic, yet twisted, romance that unfolds over decades and continents. It engages readers on the austere shores of Newfoundland’s fishing villages and drags them across to Japanese POW camps during some of the worst events of the Second World War. Haunting, lyrical, and deeply intimate, Crummey’s language fully exposes his characters’ vulnerabilities as they struggle to come to terms with their guilt and regret over decisions made during their impulsive youths.In the fishing villages of Newfoundland we come across an itinerant Wish Furey. He’s a drifter and a projectionist, traveling from island to island bringing films to isolated communities. A Catholic in a staunchly Protestant community, working with an alcoholic, gambling partner, Wish is immediately labeled an outsider. On Little Fogo Island, he spots a desirable young woman in the audience and embarks on an unwavering mission to possess her. Mercedes Parsons – Sadie – is equally infatuated and yields to Wish's advances as much as her chaste upbringing will allow.Crummey masterfully captures the ferocity of the young romance, the coiled up sexual tension exploding in instances of pure pleasure and ending often in frustration. The pair can steal only scattered moments alone as Sadie’s mother puts up a formidable defense against Wish, whom she believes will bring only trouble. However intent he seems on winning Sadie, Wish's character remains mysteriously closed. He is painfully silent around her family, which only strengthens their mistrust. Crummey seems to purposefully disclose only the barest of Wish's intimate thoughts and motivations.While the romance intensifies, Crummey casts his lovers in a wider shadow. He brings to life the Newfoundland coastline, its unforgiving waters, the religious fervor and prejudice of its inhabitants, their ceaseless work, and the collective anxiety about the burgeoning war.Unable to defeat Sadie’s mother, and unable to quell his conscience after Sadie's breathless pleading, \"Don't make a whore of me,\" Wish flees to St. John’s and enlists in the British army. Sadie embarks on a frantic pursuit only to find him gone. Defying her family she stays in the capital, building a new life, the reality of Wish's disappearance – the acute, constant ache of it – gradually settling in.Wish lands somewhere in southeast Asia and then, finally, in a Japanese POW camp. He suffers agonizing torture under a particularly cruel guard known initially as the Interpreter. We have met the Interpreter already. Crummey has woven this man's narrative through the novel, slowly revealing the origins of his unique hatred toward the Canadian prisoners. Born in British Columbia, Nishino has experienced a harsh brand of discrimination. It is through Nishino that Crummey provides a chilling example of how prejudice can breed exceptionally brutal cycles of violence.Crummey unveils the depths of his characters’ personalities with slow deliberation. The layers of their pain, suffering, and love are peeled back with each recounted memory as the novel makes its transition into contemporary times. With each memory that is unleashed the reader comes closer to understanding the choices the protagonists made, the consequences they endured, and their subsequent feelings of frustration and guilt.Fifty years after Sadie’s flight from St. John’s, she returns to Newfoundland to scatter the ashes of her dead husband and collides with Wish whom she believed dead. Sadie reflects, “It was like being handed a photograph from a stranger’s collection, one more unexpected glimpse of that face when she thought her memories of it were complete.” Memories can be taken out, tampered with, much like the film of the projectionist.It is here that Crummey cracks open Wish's character. There is a flood of revelations; his sexual exploits as a teenager, the bet made that he could conquer Sadie, Nishino's murder, and his own troubling reaction to it. It's a narrative coup. The reader is left, as Sadie is, stunned and grappling with these revelations and how our perceptions of his character have been altered. Wish is angry, sullen, and paralyzed with guilt. Yet he is still capable of love and being loved and Sadie is the only one left to remind him.It is a testament to Crummey’s gifts as a novelist that he can flow quite easily through time, across landscapes, and between vastly different characters. He vividly captures the mental and physical anguish Wish experienced in the prison camps, and with calm lucidity explores the motives of a Japanese soldier whose actions seem inhumanly cold and calculating. Crummey toys with the readers’ sympathies, suggesting there are few distinctions between the enemy and us. He incorporates heartbreaking tragedy – the dropping of the atom bomb, lynchings in America, murderous revenge – to underscore the darker side of humanity. Crummey shows that we are capable of violence, but in the end he proves we are also capable of redemption, forgiveness, and can be led, unashamed, back to the ones we love.From the Hardcover edition.",
  "genres": [
    "Fiction",
    "Historical Fiction",
    "Canada",
    "War",
    "Historical",
    "Book Club",
    "Canadian Literature"
  ],
  "author": "Michael Crummey",
  "average_rating": "3.87",
  "url": "https://www.goodreads.com/book/show/296365.The_Wreckage"
}