{
  "title": "The Great Glowing Coils of the Universe",
  "description": "From the authors of the New York Times bestselling novel Welcome to Night Vale and the creators of the #1 international podcast of the same name, comes a collection of episodes from Season Two of their hit podcast, featuring a foreword by the authors, behind-the-scenes commentary, and original illustrations.In June of 2012, the creators of Welcome to Night Vale began airing twice-weekly podcasts, hoping to be heard by anyone outside their close circles. By the anniversary show a year later, the fanbase had exploded, vaulting the podcast into the #1 spot on iTunes. Since then, its popularity has grown by epic proportions, hitting more than 100 million downloads, and Night Vale has expanded to a successful live multi-cast international touring stage show and a New York Times bestselling novel. Now the first two seasons are available as books, offering an entertaining reading experience and a valuable reference guide to past episodes.In The Great Glowing Coils of the Universe we witness a totalitarian takeover of Night Vale that threatens to forever change the town and everyone living in it.The Great Glowing Coils of the Universe features a foreword by co-writer Jeffrey Cranor, behind-the-scenes commentary and guest introductions by performers from the podcast and notable fans, including Cecil Baldwin (Cecil), Mara Wilson (The Faceless Old Woman), Hal Lublin (Steve Carlsberg) among others. Also included is the full script from the Welcome to Night Vale live show, The Debate.  Beautiful illustrations by series artist Jessica Hayworth accompany each episode.The Great Glowing Coils of the Universe is an absolute must-have whether you’re a fan of the podcast or discovering for the first time the wonderful world of Night Vale.",
  "genres": [
    "Fantasy",
    "Horror",
    "Fiction",
    "Science Fiction",
    "Humor",
    "LGBT",
    "Paranormal"
  ],
  "author": "Joseph Fink",
  "average_rating": "4.54",
  "url": "https://www.goodreads.com/book/show/29634930-the-great-glowing-coils-of-the-universe"
}