{
  "title": "Frontier",
  "description": "New Novel from the Winner of the 2015 Best Translated Book Award Introduction by Porochista Khakpour. \"One of the most raved-about works of translated fiction this year\"―Jonathan Sturgeon, Flavorwire Frontier opens with the story of Liujin, a young woman heading out on her own to create her own life in Pebble Town, a somewhat surreal place at the base of Snow Mountain where wolves roam the streets and certain enlightened individuals can see and enter a paradisiacal garden. Exploring life in this city (or in the frontier) through the viewpoint of a dozen different characters, some simple, some profound, Can Xue's latest novel attempts to unify the grand opposites of life--barbarism and civilization, the spiritual and the material, the mundane and the sublime, beauty and death, Eastern and Western cultures. A layered, multifaceted masterpiece from the 2015 winner of the Best Translated Book Award, Frontier exemplifies John Darnielle's statement that Can Xue's books read \"as if dreams had invaded the physical world.\" Can Xue is a pseudonym meaning \"dirty snow, leftover snow.\" She learned English on her own and has written books on Borges, Shakespeare, and Dante. Her publications in English include The Embroidered Shoes , Five Spice Street , Vertical Motion , and The Last Lover , which won the 2015 Best Translated Book Award for Fiction. Karen Gernant is a professor emerita of Chinese history at Southern Oregon University. She translates in collaboration with Chen Zeping. Chen Zeping is a professor of Chinese linguistics at Fujian Teachers' University, and has collaborated with Karen Gernant on more than ten translations. Porochista Khakpour is the author of two novels, Sons and Other Flammable Objects and The Last Illusion .",
  "genres": [
    "Fiction",
    "China",
    "Magical Realism",
    "Asia",
    "21st Century",
    "Novels",
    "Chinese Literature"
  ],
  "author": "Can Xue",
  "average_rating": "3.56",
  "url": "https://www.goodreads.com/book/show/29633846-frontier"
}