{
  "title": "An Unexpected Love",
  "description": "When he was a mortal man many hands had restrained him as he was forced to watch them take from his wife Elisabeth,all she had to give then take her away her life. He learns he can revenge her death if he accepts the power of the night. The power allows him to search for her spirit when it is renewed and she returns to walk the earth again. Extended DescriptionWhen he was given the power of the night his revenge was sweet,as the men that took his love from him fell one by one. He also learned he could search for the spirit of Elizabeth when her spirit returned in a new body.For hundreds of years he had searched for her and now her call had brought him to St Louis Missouri in the year of 1868. He was late to understand her call and the distance was great so he was saddened to learn she had already married and started a family. This was sometimes the case and if she seemed content he never intervene in the natural life she had chosen.He learned she was about to head out on a wagon train and staying near her when he could, he became enthralled by the Americans and their excitement to head West. His need for the darkness would make it hard for him join in the adventure and his hope of finding travel was fading as the departure date grew close.However, he had under estimated the powerful forces that had brought him this far and they were ready to intervene.When he was nearing his rented room he cut through a back alley and he saw a large, round man, apparently attempting to force himself on a smaller, but capable woman. She looked to be somewhere in her early 30s and was for sure, giving him his due.So to not draw attention, he decided to just watch for a moment, since she seemed to be holding her own rather well.It could be a loves quarrel for all he knew. While the man sought to subdue the woman before him, little did he know from just beyond the dim light of the lantern steel blue eyes watch his every move.The eyes that silently watch and the power behind them were more deadly than even the legends of him described.Tonight the watcher holds no mechanical weapon but his six foot, three inch frame carries two hundred fifty pounds of solid muscle, tensed for a fight, the second he determines its time for the balance of power to rapidly shift.Things for the watcher were about to shift rapidly as well.Figuring since his love for this journey was busy with her own life, he may as well make the best of it.",
  "genres": [],
  "author": "Roger Delray",
  "average_rating": "4.75",
  "url": "https://www.goodreads.com/book/show/11847307-an-unexpected-love"
}