{
  "title": "Love Will",
  "description": "Love Will Guide You.  At 24, Will Rosser has finally seen evidence of love. He witnessed the loyalty between his older brother and sister-in-law once they moved back to New York, and he watched his younger brother fight societal conventions to be with the guy he loves. Will hopes that he, too, can find someone he can trust with his secrets who will appreciate his talents and forgive his many past transgressions.  Given an opportunity to escape New York and the routine that encouraged his bad behavior, Will chooses to leave his job to go on tour with his best friend's band.  Love Will Destroy You.  The examples Will saw growing up showed a different side of love. Love was cruel and manipulative; one-sided and false. It sure as hell wasn't what they wrote songs about. His parents were at odds from the moment he was born. While his dad spent years in and out of jail, his mother was more interested in alcohol than in raising her boys. When the two were finally together, they were toxic.  Will finally had a chance to experience real love for the first time when he was 16. He was smitten with his girlfriend–until he found out she'd been cheating on him. That was all it took to send him down a ruinous path of his own, disbelieving in this fairytale of love he'd almost bought into.  Love Will Find a Way.  Now an adult, Will relies on his uncompromising discipline to commit to a new way of life, even though temptations to stray are numerous and constant while on the road with Damon. He meets a woman who inspires him and believes in second chances. Shea is a breath of fresh air and challenges Will's despairing past with light and hope.  As Will works to accept his own dependencies and forgive himself for the mistakes he's made, the relationship becomes one that requires more trust than Shea first realized.  There's only one thing that will keep Will from self-destructing. There's only one thing that will keep Shea from running the other way.  Love Will.",
  "genres": [
    "Romance",
    "New Adult",
    "Contemporary"
  ],
  "author": "Lori L. Otto",
  "average_rating": "4.45",
  "url": "https://www.goodreads.com/book/show/29632424-love-will"
}