{
  "title": "Openings: A Memoir from the Women's Art Movement, New York City 1970-1992",
  "description": "A candid and generous color-illustrated account of women artists creating politically and personally effective art works, exhibitions, and actions over two tumultuous decadesThis abundantly illustrated personal narrative takes readers through twenty-two years of activism in the women's art movements in New York City during a period of great cultural change. Author Sabra Moore vividly recounts life in this era of social upheaval in which women artists responded to war, racial tension and reconciliation, cultural and aesthetic inequality, and struggles for reproductive freedom. We learn intimately how she and fellow women artists found ways to create politically and personally effective art works, exhibitions, actions, and institutions.The book features Moore's involvement in pivotal art organizations of this time and her own development as an artist, counterbalanced with her connections to family in rural East Texas and friends in New Mexico. Moore was a member of the Heresies Collective, an influential feminist activist group, became editor of their art and politics journal Heresies, and was president of the NYC/Women's Caucus for Art. She helped coordinate and curate many of the earliest large-scale exhibitions of women artists in NYC, including Views by Women Artists (1982), and the collaborative shows Reconstruction Project and Connections Project/Conexus. Moore was a principle organizer of the 1984 demonstration against MoMA over their lack of inclusion of women artists and was a member of various groundbreaking collaborative arts groups in the 1970s, including Atlantic Gallery and WAR (Women Artists in Revolution).While Openings is an historical narrative of women artists' actions, organizations, and ideas, it also candidly describes their periods of challenge, including the death of sculptor Ana Mendieta and the indictment of her husband and the author's own attempted murder by her former art teacher.The book is illustrated throughout by a treasure of 950 color and black & white images of the art from this momentous a valuable collection that is concurrently being archived by Barnard College along with papers, letters, show cards, posters, original artworks, and other documents.This eye-opening book includes forewords by renowned art critic Lucy Lippard and poet/activist Margaret Randall.",
  "genres": [
    "Memoir",
    "Nonfiction",
    "Art"
  ],
  "author": "Sabra Moore",
  "average_rating": "4.43",
  "url": "https://www.goodreads.com/book/show/29633889-openings"
}