{
  "title": "Mostly Void, Partially Stars",
  "description": "From the authors of the New York Times bestselling novel Welcome to Night Vale and the creators of the #1 international podcast of the same name, comes a collection of episodes from Season One of their hit podcast, featuring an introduction by the authors, behind-the-scenes commentary, and original illustrations.In June of 2012, the creators of Welcome to Night Vale began airing twice-weekly podcasts. By the anniversary show a year later, the fanbase had exploded, vaulting the podcast into the #1 spot on iTunes. Since then, its popularity has grown by epic proportions, hitting more than 100 million downloads, and Night Vale has expanded to a successful live multi-cast international touring stage show and a New York Times bestselling novel. Now the first two seasons are available as books, offering an entertaining reading experience and a valuable reference guide to past episodes.Mostly Void, Partially Stars introduces us to Night Vale, a town in the American Southwest where every conspiracy theory is true, and to the strange but friendly people who live there.Mostly Void, Partially Stars features an introduction by creator and co-writer Joseph Fink, a foreword by Cory Doctorow, and behind-the-scenes commentary and guest introductions by performers from the podcast and notable fans, including Cecil Baldwin (Cecil), Dylan Marron (Carlos), and Kevin R. Free (Kevin) among others. Also included is the full script from the first Welcome to Night Vale live show, Condos. Beautiful illustrations by series artist Jessica Hayworth accompany each episode.Mostly Void, Partially Stars is an absolute must-have whether you’re a fan of the podcast or discovering for the first time the wonderful world of Night Vale.",
  "genres": [
    "Fantasy",
    "Horror",
    "Fiction",
    "Science Fiction",
    "Humor",
    "LGBT",
    "Paranormal"
  ],
  "author": "Joseph Fink",
  "average_rating": "4.45",
  "url": "https://www.goodreads.com/book/show/29634931-mostly-void-partially-stars"
}