{
  "title": "The Wishing Year: A House, a Man, My Soul A Memoir of Fulfilled Desire",
  "description": "One New Year’s Day, Noelle Oxenhandler took stock of her life and found that she was alone after a long marriage, seemingly doomed to perpetual house rental and separated from the spiritual community that once had sustained her. With little left to lose, she launched a year’s experiment in desire, forcing herself to take the plunge and try the path of Putting It Out There. It wasn’t easy. A skeptic at heart, and a practicing Buddhist as well, Oxenhandler had grown up with a strong aversion to mixing spiritual and earthly matters. Still, she suspended her doubts and went for it a new love, a healed soul, and the 2RBD/1.5 BA of her dreams. Thus began her initiation into the art of wishing brazenly.In this charming, compelling, and ultimately joyful book, Oxenhandler records a journey that is at once comic and poignant, light and dark, earthy and spiritual. Along the way she Does wishing have power? Is there danger in wishing? Are some wishes more worthy than others? And what about the ancient link between suffering and desire? To answer her questions, she delves into the history of wishing, from the rain dance and deer song of primeval magic to modern beliefs about mind over matter, prosperity consciousness, and the law of attraction.As the months go by, Oxenhandler is humbled to discover the courage it takes to make a wish and thus open oneself to the unknown. She is surprised when her experiment expands to include other people and other places in ways she never imagined. But most of all, she is amazed to find that there is, indeed, both power and danger in the act of wishing. For soon her wishes begin to come true–in ways that meet, subvert, and overflow her expectations. And what started as a year’s dare turns into a way of life.A delightfully candid memoir, unfettered, poetic, and ripe with discovery, Oxenhandler’s journey into the art and soul of wishing will inspire even the most skeptical reader to search the skies for the next shooting star.Praise for THE WISHING YEAR\"This is a wonderful book, full of wisdom gleaned from a year of Noelle Oxenhandler's daring to embrace what she had previously denied herself--her own personal wishes. I highly recommend The Wishing Year for anyone wanting to learn more about what life has to offer when we pay attention to our heart's desires.\"– Sarah Susanka, author of The Not So Big Life\"Do you want to know how wishes come true? Then read The Wishing Year . It's a book that beautifully illuminates the art and mystery of wishing--and it does so in a way that is inspiring, funny, serious, honest, heartfelt, and irresistibly readable.\"–Jack Kornfield, author of After the Ecstasy, the Laundry\"The Wishing Year is an elegant exploration of the way thought shapes reality. Writing with great personal honesty and candor, Noelle Oxenhandler's exhilarating prose takes us deep into the pain and glory of being human.\"–Mark Epstein, M.D., author of Open to Desire“Oxenhandler's new book makes it okay to be a smart, sophisticated grow-up who also believes in magic. She dives beneath the new age veneer and deconstructs how wishes really come true.” –Susan Piver, author of How Not to Be Afraid of Your Own Life",
  "genres": [
    "Memoir",
    "Nonfiction",
    "Spirituality",
    "Psychology",
    "Inspirational",
    "Biography",
    "Self Help"
  ],
  "author": "Noelle Oxenhandler",
  "average_rating": "3.61",
  "url": "https://www.goodreads.com/book/show/2963833-the-wishing-year"
}