{
  "title": "Chronicle of the Murdered House",
  "description": "\"The book itself is strange—part Faulknerian meditation on the perversities, including sexual, of degenerate country folk; part Dostoevskian examination of good and evil and God—but in its strangeness lies its rare power, and in the sincerity and seriousness with which the essential questions are posed lies its greatness.\"—Benjamin Moser, from the introductionLong considered one of the most important works of twentieth-century Brazilian literature, Chronicle of the Murdered House is finally available in English.Set in the southeastern state of Minas Gerais, the novel relates the dissolution of a once proud patriarchal family that blames its ruin on the marriage of its youngest son, Valdo, to Nina—a vibrant, unpredictable, and incendiary young woman whose very existence seems to depend on the destruction of the household. This family’s downfall, peppered by stories of decadence, adultery, incest, and madness, is related through a variety of narrative devices, including letters, diaries, memoirs, statements, confessions, and accounts penned by the various characters.Lúcio Cardoso (1912–1968) turned away from the social realism fashionable in 1930s Brazil and opened the doors of Brazilian literature to introspective works such as those of Clarice Lispector—his greatest follower and admirer.Margaret Jull Costa has translated dozens of works from both Spanish and Portuguese, including books by Javier Marías and José Saramago. Her translations have received numerous awards, including the International IMPAC Dublin Literary Award. In 2014 she was made an Officer of the Order of the British Empire.Robin Patterson was mentored by Margaret Jull Costa, and has translated Our Musseque by José Luandino Vieira.",
  "genres": [
    "Fiction",
    "Brazil",
    "Classics",
    "Literature",
    "Novels",
    "Queer",
    "Latin American"
  ],
  "author": "Lúcio Cardoso",
  "average_rating": "4.28",
  "url": "https://www.goodreads.com/book/show/29633721-chronicle-of-the-murdered-house"
}