{
  "title": "The Creeper Village",
  "description": "Not all creepers want to blow up and hurt other mobs! There are friendly creepers who have their own village and stay away from humans and other mobs. What is it like living as a friendly creeper and how are they different from the other creepers. Read Mike's diary and find out how's life as a Creeper. Mike has lived his whole life in his quiet village on the mountain top. His village is secluded and peaceful. The only thing that makes his village different? It is full of creepers. The friendly creepers live away from the rest of the Over World and keep to themselves. In an attempt to save their village from the sudden attacks of wither skeletons coming from the Nether, Mike, together with his other fellow friendly creepers set out on a quest to seek for help. But with all the dangers they are about to face in such a strange place, can they really find what they are looking for? What kind of adventure awaits Mike’s group as they journey on towards the unknown? An Unofficial Minecraft Diary Book for Kids Ages 9 - 12 (Preteen / Thrilling Minecraft Adventure / Minecraft Novel THIS MINECRAFT ADVENTURE STORY IS A MUST READ FOR MINECRAFT FANS ESPECIALLY FOR KIDS AGE 5-7 , 6-8 , 8-10 , 9-12 , THIS EXCITING MINECRAFT BOOK IS MADE for ages 6, 7, 8, 9, 10, 11, 12 and older. MOTIVATE YOUR 8 YEAR OLD BOYS AND GIRLS OR MINECRAFT KIDS AGES 9-12 TO READ WITH THIS EXCITING STORY. THE PERFECT GIFT IDEA FOR MINECRAFT FANS! GET YOUR COPY NOW!!! This unofficial Minecraft book is not authorized, endorsed or sponsored by Microsoft Corp., Mojang AB, Notch Development AB or any other person or entity owning or controlling the rights of the Minecraft name, trademark or copyrights. All characters, names, places and other aspects of the game described herein are trademarked and owned by their respective owners. Minecraft/ /TM & 2009-2016 Mojang/Notch.",
  "genres": [
    "Childrens",
    "Fiction"
  ],
  "author": "Mark Mulle",
  "average_rating": "4.18",
  "url": "https://www.goodreads.com/book/show/29637572-the-creeper-village"
}