{
  "title": "Tangling with Bears",
  "description": "Tobias tells himself he's having fun. He has a great life as a beta in the Cloverleah Pack, and while danger still threatens the pack, he has his friend's wedding to look forward too, and the pleasures that come from hookups in random places. He'd like to meet his mate, just so he's not the odd one out in the inner circle, but it's not something he's expecting anytime soon. So when a hookup just before the wedding leaves Tobias with a permanent scar, he wonders where the heck his life went wrong. Especially when the man responsible for the wicked set of tooth marks, disappeared after the deed was done, to ring a man called Kurt. Kurt and Luke have been mated for three years. As bear shifters, Kurt has known from puberty that he will two mates and once he'd claimed Luke, his mama warned him to be on the look out for a human female. So when Luke rings him and lets him know he might have accidentally on purpose bitten a wolf shifter, from some town they'd never heard of, Kurt heads to Cloverleah to sort out the mess. Sorting out their mating is just one of the things the three men have to contend with. A magic user has stepped up his game and no where on packlands seems safe. When Tobias gets taken, Kurt and Luke are helpless to do anything about it. It's going to take the power of the pack before life will be safe again, for any of them. Contains scenes of M/M and M/M/M sex. It also contains a special kind of bear, his grumpy mate, and a wolf that just wants to be loved. HEA and no cheating guaranteed. While this book can be read as standalone, you will understand more about the secondary characters in the book, if you have read the others in the series.",
  "genres": [
    "Paranormal",
    "M M Romance",
    "Shapeshifters",
    "Romance",
    "Fantasy",
    "M M M",
    "Menage"
  ],
  "author": "Lisa Oliver",
  "average_rating": "4.36",
  "url": "https://www.goodreads.com/book/show/29636864-tangling-with-bears"
}