{
  "title": "The Guardians",
  "description": "From American Book Award-winning author Ana Castillo comes a suspenseful, moving new novel about a sensuous, smart, and fiercely independent woman. Eking out a living as a teacher’s aide in a small New Mexican border town, Tía Regina is also raising her teenage nephew, Gabo, a hardworking boy who has entered the country illegally and aspires to the priesthood. When Gabo’s father, Rafa, disappears while crossing over from Mexico, Regina fears the worst.After several days of waiting and with an ominous phone call from a woman who may be connected to a smuggling ring, Regina and Gabo resolve to find Rafa. Help arrives in the form of Miguel, an amorous, recently divorced history teacher; Miguel’s gregarious abuelo Milton; a couple of Gabo’s gangbanger classmates; and a priest of wayward faith. Between the ruthless “coyotes” who exploit Mexicans while smuggling them to America and the border officials who are out to arrest and deport the illegal immigrants, looming threat is a constant companion on the journey.Ana Castillo brilliantly evokes the beautiful, stark desert landscape and creates vivid characters with strong voices and resilient hearts. “Like Sandra Cisneros’s acclaimed The House on Mango Street ,” wrote Barbara Kingsolver when reviewing So Far from God, “Castillo’s writing is seasoned with Mexican aphorisms [and] rich symbolism. . . . Impossible to resist.” The Guardians serves as a remarkable testament to enduring faith, family bonds, cultural pride, and the human experience.“ The Guardians is a rollicking read, with jokes and suspense and joy rides and hearts breaking, mending and breaking again. It has…a deeply rooted urgency, expressed with a compelling mix of bruised indignation and bemused tenderness.... This smart, passionate novel deserves a wide audience. ” — Los Angeles Times“Timely and highly readable….Castillo’s most important accomplishment in The Guardians is to give a unique literary voice to questions about what makes up a ‘family,’ Mexican-American or otherwise, where an independent soul can find redemption, particularly in a hostile world, and how we can realistically find ‘faith,’ if we can find it at all, after we have suffered through our personal and political histories, and are still standing on this earth. This is a wonderful novel that does justice to life on the Mexican-American border .” — El Paso Times“Only a gifted storyteller could portray one family’s tragic struggle to overcome the barriers between nationality and dignity in a way that makes her cause own own. Does Castillo do this? Claro que si.” — New York Daily News“What drives the novel is its chorus of characters, all, in their own way, witnesses and guardian angels. In the end, Castillo’s unmistakable voice–earthy, impassioned, weaving a ‘hybrid vocabulary for a hybrid people’–is the book’s greatest revelation, even as the search for Rafa races to its dreaded conclusion.” — Time Out New York“From its lyrical first lines… The Guardians invites you into the story of Regina, a 50ish virgin-widow living in a small town on the border between the U.S. and Mexico; her neighbors; her family; and the dangerous forces that surround them — the narco traffickers, the Border Patrol, the coyotes and the ‘unmerciful desert’ itself. The novel is earning praise for its timeliness in addressing issues of immigration, and for what novelist Cristina Garcia calls its ‘literary magic.’” — Orange County Register“Castillo's topical, heartbreaking novel blooms from the rugged desert soil along the U.S.-Mexican border, in a small New Mexican town perched on the fault line of the immigration controversy…. [Castillo] allows her characters to speak poignantly to the harsh truths of border life....What if we didn't have passionate, lyrical writers to shine a beacon on injustice and cruelty or remind us of the dignity due all human beings? We would be poorer and more ignorant, indeed.” — Miami Herald “Forecast for Summer Reading”“The complex and perilous life along the border between the United States and Mexico is the timely subject of this impassioned novel. Castillo uses a classic storytelling format -- the search -- to provide an engaging tale narrated by a poor yet fearless and wise widow trying to find her brother….this spare, sometimes profane novel provides a powerful glimpse of border lives hanging in the everyday balance.” — Seattle Post Intelligencer (one of their “best of the 2007 releases from June, July and August”)“Castillo writes fiction and poetry of earthy sensuality, wry social commentary, and lyrical spiritualism that confront the cruel injustices accorded women and Mexicans in America, legal and otherwise….In this tightly coiled and powerful tale….At once shatteringly realistic and dramatically mystical, Castillo's incandescent novel of suffering and love traces life's movement toward the light even in the bleakest of places.” Booklist (starred review)“A nuanced, vibrant look at the American experience through Mexican-American eyes.” — Kirkus Reviews“The end of the month brings Ana Castillo's GUARDIANS (Random House), a fictional foray into the world of illegal immigration. The plot revolves around a Mexican man who goes missing during a crossing and his sister's efforts to track the coyotes who may have had a hand in it.”– Houston Chronicle “A Fictional Feast”\"THE GUARDIANS\" by Ana The author of \"Peel My Love Like an Onion\" takes on the many issues surrounding illegal immigration in a powerful new novel in which a family's faith is tested. \"Wonderful ... moving ... intimate ... epic,\" Oscar Hijuelos told Amazon.com.– San Antonio Express-News “New Summer Books”“The acclaimed author of Peel My Love Like an Onion tracks the perilous lives of Mexicans who illegally cross the the U.S. for work…Castillo writes convincingly in the voices of the canny, struggling Regina….the desirous Miguel; the passionately religious Gabo; and El Abuelo Milton, Miguel’s elderly grandfather…[she] takes readers forcefully into the lives of the neglected and abused.” — Publishers Weekly“Ana Castillo is one of those writers that I always expect not just the best of, but the best of the best of. She certainly doesn’t disappoint in her lyrical new book The Guardians….Castillo weaves into this intricately elegant story the Juarez murders of women, the Minutemen, the politics and the desert border town. It’s an amazing feat. She compels with each word, breathes magic into her words and we’re there.” Blogcritics.org“A wonderful and moving book that is both intimate and epic in its narrative.” — Oscar Hijuelos , author of The Mambo Kings Play Songs of Love“Ana Castillo gives America exactly what it needs - her vision of a border most people never see, and not the border they expect, and a story that will not let us go. Her voice is singular, and her talents are on full display here. Everyone needs to visit her world, and to understand her guardians of love and dignity.” — Susan Straight , author of A Million Nightingales“Ana Castillo is a fearless storyteller. In The Guardians , she addresses the key issues racking our immigrant nation and hemisphere. This brave, unflinching novel shows the tragic consequences that come from not facing what is happening in our communities to those without true guardians to protect them.” -- Julia Alvarez , author of Saving the World“Man, what a book.  Blood and awe, laughter and stark fear.  As soon as you see the earth ‘shivering’ in the opening sentences of this potent novel, you will know you are in the right place.  The characters are as real and quirky as your own neighbors, though you start to realize they are also people you have probably never met before.  A vital work of healing and astonishment from a medicine-woman at full power.  America needs to read this story.” — Luis Alberto Urrea , author of The Hummingbird’s Daughter\"THE GUARDIANS, a surprising and powerful novel, captures the vulnerability and stark beauty of life in a small, border town. Castillo instills the voices of her four main characters with such passion and humanity, their vitality practically crackles on the page. Unforgettable and timely,Castillo will charm you once again with her literary magic.\" — Cristina Garcia , author of A Handbook to Luck\"I’ve been waiting for years for this novel, in this voice. The Guardians is Ana Castillo’s most perfect novel, and one of her most politically significant. Through beautifully drawn characters and their engrossing stories, Castillo brings our government’s dirty little war on Latin American immigrants into our consciousness and demands that we choose sides.\"-- Ibis Gomez-Vega, Associate Professor, Northern Illinois University, author of Send My Roots Rain",
  "genres": [
    "Fiction",
    "School",
    "American",
    "Literary Fiction",
    "Literature",
    "Read For School",
    "Latin American"
  ],
  "author": "Ana Castillo",
  "average_rating": "3.72",
  "url": "https://www.goodreads.com/book/show/1184766.The_Guardians"
}