{
  "title": "Eagle in Exile",
  "description": "Perfect for fans of Bernard Cornwell, Steve Berry, Naomi Novik, and Harry Turtledove, Alan Smale’s gripping alternate history series imagines a world in which the Roman Empire has survived long enough to invade North America in 1218. Now the stunning story carries hero Gaius Marcellinus deeper into the culture of an extraordinary people—whose humanity, bravery, love, and ingenuity forever change his life and destiny.  In AD 1218, Praetor Gaius Marcellinus is tasked with conquering North America and turning it into a Roman province. But outside the walls of the great city of Cahokia, his legion is destroyed outright; Marcellinus is the only one spared. In the months and years that follow, Marcellinus comes to see North America as his home and the Cahokians as his kin. He vows to defend these proud people from any threat, Roman or Native.   After successfully repelling an invasion by the fearsome Iroqua tribes, Marcellinus realizes that a weak and fractured North America won’t stand a chance against the returning Roman army. Worse, rival factions from within threaten to tear Cahokia apart just when it needs to be most united and strong. Marcellinus is determined to save the civilization that has come to mean more to him than the empire he once served. But to survive the swords of Roma, he first must avert another Iroqua attack and bring the Cahokia together. Only with the hearts and souls of a nation at his back can Marcellinus hope to know triumph.  Praise for Alan Smale’s Clash of Eagles  “Epic, bloody, and hugely imaginative.”—John Birmingham, author of the Dave vs. the Monsters series   “Epic in its sweep, exciting in its narrative, and eyeball-kick-sharp in its details.”—Nancy Kress, Nebula and Hugo award-winning author of Beggars in Spain  “Authoritatively researched and compellingly told, Clash of Eagles is a modern masterpiece of what-if speculation.”—Stephen Baxter, Philip K. Dick Award–winning author of The Time Ships  “Alan Smale has done remarkable work with the world-building in Clash of Eagles. Yet what follows is more than a standard clash-of-cultures yarn, for there are other forces in play in this alternate North America. Can the determination and ingenuity of one man change the fate of a continent? I’m eager to find out.”—Harry Turtledove, New York Times bestselling author of How Few Remain  “Just when it seems there is nothing new in [alternate] history comes this debut.”—Library Journal (starred review)   “Intriguingly original.”\n—Kirkus Reviews",
  "genres": [
    "Historical Fiction",
    "Alternate History",
    "Fantasy",
    "Fiction",
    "Native American",
    "Science Fiction",
    "Historical"
  ],
  "author": "Alan Smale",
  "average_rating": "4.23",
  "url": "https://www.goodreads.com/book/show/29662150-eagle-in-exile"
}