{
  "title": "Divorced and Scared No More! Emotional Support for the Newly Divorced",
  "description": "Have you experienced Divorce?   Are you questioning what your future will be after your vows of \"I do\" turn into \"I do not\" along with the loss of all the dreams that never will be fulfilled?   Divorced and Scared No Emotional Support for the Newly Divorced   is the first installment of the three-part trilogy written to assist readers in post-divorce related matters while providing you the motivation you need to move on.Author Tasher speaks from personal experience; having gone through the many stages of relationships. This includes denial of a failed marriage, expressiveness needed to gain healing and how to remain emotionally grounded. You'll find ways to embrace your new found freedom and turn the lemons life threw at you into a Zesty Lemon Sorbet! \tTherapist and clinical author Justin Nutt, LSCSW, LAC consulted as a technical advisor for the series. Insuring everything presented be accurate and quality material while still being a comforting, easy-to-read guide to surviving divorce.Co-Author Tony Haynes is a practitioner of Acrostic Poetry -poetry where the first, last or other letters in a line spell out a particular word or phrase. At the end of each chapter, you can look forward to reading a clever poem from words found within the word DIVORCE .   These are poetic thoughts that ask  \"How did I get here?\" This rite of passage has everything to do with life and our stories affects each other because we are all connected .  Now it's time to peek inside and see how, where & why our lives intersect.There are so many insightful topics in the book, which will help you feel inspired to look inward and become aware of your needs to help you live again.  There is still life after emotional death ...  Isn't it time for you to be happily divorced and  Divorced and Scared NO More?",
  "genres": [],
  "author": "Tasher; Tony Haynes",
  "average_rating": "4.83",
  "url": "https://www.goodreads.com/book/show/29655250-divorced-and-scared-no-more-emotional-support-for-the-newly-divorced"
}