{
  "title": "Get a Life!",
  "description": "Get A Life! with the possible exception of \"Beam me up, Scotty,\" is clearly the most repeated catchphrase in the history of Star Trek®. Poking fun at Star Trek's gung-ho fans and conventions in a now infamous Saturday Night Live sketch, William Shatner's comic rallying cry has been indelibly emblazoned into the collective psyche of trekkers everywhere. Through the years, the phrase has spurred laughter, anger, controversy, and far more than its fair share of debate. It's now also given birth to an honest, sentimental, insightful book.Uncomfortable with speaking onstage, William Shatner had spent the better part of the previous quarter century steadfastly avoiding convention appearances. However, to publicize the release of Star Trek Generations, Shatner agreed to a rare series of speaking engagements at Star Trek conventions around the globe. He was jolted by an unavoidable dose of reality.Shatner was met with wild enthusiasm, love, and good humor at convention after convention. Touched and fascinated, he was overwhelmed with the realization that in almost three decades of starship hopping, he'd never really taken the time to enjoy or understand Star Trek's fans or their conventions. That's when the light bulb clicked on; that's when \"Captain Kirk\" dove headfirst into action.For the past several years, William Shatner has been treating each Star Trek convention like an enormous research project. Interviewing fans, dealers, fellow castmembers, convention organizers, and promoters -- even going undercover beneath alien makeup -- Shatner's been scouring convention floors. Having grilled trekkers and trekkies in all corners of the planet, Shatner's had his eyes opened and his mind boggled. He's amassed a small mountain of research material, and cultivated his findings in Get A Life!This is a first-person journey of discovery told with self-deprecating wit, unflagging honesty, and his trademark enthusiasm and humor. Get a Life! tells William Shatner's own story of how the actor who played the now deceased starship captain, James T. Kirk, can finally come to grips with his past, his fans, their love, and his own intergalactic legacy.",
  "genres": [
    "Nonfiction",
    "Biography",
    "Star Trek",
    "Autobiography",
    "Memoir",
    "Humor",
    "Audiobook"
  ],
  "author": "William Shatner",
  "average_rating": "3.71",
  "url": "https://www.goodreads.com/book/show/296486.Get_a_Life_"
}