{
  "title": "When Our Grown Kids Disappoint Us: Letting Go of Their Problems, Loving Them Anyway, and Getting on with Our Lives",
  "description": "How do today’s parents cope when the dreams we had for our children clash with reality? What can we do for our twenty- and even thirty-somethings who can’t seem to grow up? How can we help our depressed, dependent, or addicted adult children, the ones who can’t get their lives started, who are just marking time or even doing it? What’s the right strategy when our smart, capable “adultolescents” won’t leave home or come boomeranging back? Who can we turn to when the kids aren’t all right and we, their parents, are frightened, frustrated, resentful, embarrassed, and especially, disappointed?In this groundbreaking book, a social psychologist who’s been chronicling the lives of American families for over two decades confronts our deepest concerns, including our silence and self-imposed sense of isolation, when our grown kids have failed to thrive. She listens to a generation that “did everything right” and expected its children to grow into happy, healthy, successful adults. But they haven’t, at least, not yet—and meanwhile, we’re letting their problems threaten our health, marriages, security, freedom, careers or retirement, and other family relationships.With warmth, empathy, and perspective, Dr. Adams offers a positive, life-affirming message to parents who are still trying to “fix” their adult children—Stop! She shows us how to separate from their problems without separating from them, and how to be a positive force in their lives while getting on with our own. As we navigate this critical passage in our second adulthood and their first, the bestselling author of I’m Still Your Mother reminds us that the pleasures and possibilities of postparenthood should not depend on how our kids turn out, but on how we do!",
  "genres": [
    "Nonfiction",
    "Parenting",
    "Self Help"
  ],
  "author": "Jane  Adams",
  "average_rating": "3.88",
  "url": "https://www.goodreads.com/book/show/296961.When_Our_Grown_Kids_Disappoint_Us"
}