{
  "title": "Pyro",
  "description": "In his pulse-pounding thrillers, Earl Emerson takes readers into the heart of the world’s most dangerous profession, where the next alarm might bring sudden death. Based on stunning, actual events in the author’s life, this electrifying new novel is a frightening duel between a Seattle firefighter and a man who wants to burn him down. . . .To a firefighter, there’s nothing worse than a nuisance arsonist. His multiple fires keep a station up at night, running in circles, and more vulnerable at the next “real” call. And in Seattle, Lt. Paul Wollf of the Station Six’s ladder truck hates a pyro more than most. Two decades before, an arsonist’s fire killed Wolff’s firefighter father, sending his mother into a spiral of depression and triggering a chain of events that left his brother in jail for murder and Wollf alone, seething in anger and isolation.Already disciplined for punching out a superior officer, Wollf is now taking a young female firefighter under his wing. Despite the stationhouse leers and jokes, Wollf is only doing what comes naturally, helping out an underdog and bucking the system. But soon he and Cindy Rideout find themselves in a fierce political battle inside the department, just as a pyro starts to turn Seattle into his private little hell.With fires springing up across the city, Wollf begins to see a pattern. The fires being set are coming closer and closer to Station Six. And when a crucial piece of evidence turns up, Wollf suspects the this pyro has turned him into a fiery target.In Paul Wollf, Earl Emerson has created a hero on the brink. For when the pyro’s rampage puts Wollf in the public limelight, Wollf must choose between his burning rage and the chance to step back–for once–and see a shocking truth hidden beyond the heat.From the Hardcover edition.",
  "genres": [
    "Mystery",
    "Thriller",
    "Fiction",
    "Mystery Thriller"
  ],
  "author": "Earl Emerson",
  "average_rating": "3.81",
  "url": "https://www.goodreads.com/book/show/296912.Pyro"
}