{
  "title": "Captain Invincible and the Space Shapes",
  "description": "“Kids, young and old, fall in love with math when they see how real-life and effortless it becomes thanks to these books.” --Kimberly D. Mueller, Ed.D., First Grade Teacher, Ashbrook School, Lumberton NJ Captain Invicible and the Space Shapes is perfect for teaching 3-dimensional shapes to first, second, and third graders. Captain Invincible and his space-dog, Comet, are on a perilous journey back to Earth! Throughout their mission, the fearless captain and his canine sidekick encounter asteroids, poisonous gas, and alien beings. But will their knowledge of three-dimensional shapes, including cubes, cones, and pyramids, help our heroes navigate past these obstacles—and make it safely home?  Kids will love the story and the illustrations by Remy Simard. Parents and educators will love how the story and pictures make understanding the math concepts a breeze—as well as the concrete examples of how math works. The book contains activities for adults to do with kids to extend math into their own lives.  Math = Fun! Math skills are life skills, and the MathStart series supports success! MathStart's unique combination of stories, illustrations, and visual models helps teachers and parents in the teaching of math and provides all children with the opportunity to succeed. The math concepts taught in MathStart books conform to state and national standards. Level 1 is Pre-K–Kindergarten; Level 2 is Grades 1–3; Level 3 is Grades 2–4. The series follows math topics across grades so there is a foundational path to learning that runs through the levels. Help kids with their math skills  plus  their reading skills with the engaging and fun MathStart series!",
  "genres": [
    "Mathematics",
    "Picture Books",
    "Childrens",
    "Nonfiction",
    "Space",
    "School",
    "1st Grade"
  ],
  "author": "Stuart J. Murphy",
  "average_rating": "3.79",
  "url": "https://www.goodreads.com/book/show/296676.Captain_Invincible_and_the_Space_Shapes"
}