{
  "title": "The Religious Case Against Belief",
  "description": "A provocative, insightful explanation for why it is that belief—not religion—keeps us in a perilous state of willful ignoranceIn The Religious Case Against Belief, James Carse identifies the twenty-first century’s most forbidding villain: belief. In distinguishing religions from belief systems, Carse works to reveal how belief—with its restriction on thought and encouragement of hostility—has corrupted religion and spawned violence the world over. Galileo, Martin Luther, Abraham Lincoln, and Jesus Christ—using their stories Carse creates his own brand of parable and establishes a new vocabulary with which to study conflict in the modern world. The Religious Case Against Belief introduces three kinds of ignorance: ordinary ignorance (a mundane lack of knowledge, such as ignorance of tomorrow’s weather or the reason why your stove is malfunctioning), willful ignorance (an intentional avoidance of accessible knowledge), and finally higher ignorance (a learned understanding that no matter how many truths we may accumulate, our knowledge falls infinitely short of the truth). While ordinary ignorance is common to all people, Carse associates the strongest manifestation of willful ignorance with the most fervent (and dangerous) of believers. He points to the historic conflict between Martin Luther and Holy Roman Emperor Charles V both to reveal this seemingly religious collision as a clash of belief and to identify belief ’s inherently destructive characteristics. From Luther to the contemporary Christian right, we learn that believers construct identity by erecting boundaries and by fostering aggression between the believer and the other. This is why belief systems choose—at great cost—to remain locked in bloody conflict rather than to engage in dialogue, recognizing the great deal they have in common. This is willful ignorance. In fierce contrast to willful ignorance, higher ignorance is an acquired state enhanced by religion. Those traveling the path to higher ignorance recognize faith teachings (such as the Bible) as poetry intended to promote contemplation, interpretation, and a sense of wonder. For evidence of religion’s deeply embedded rejection of singular truth and its acceptance of diverse dialogue, Carse looks to the many faces of Jesus presented in the books of the Bible and elsewhere. Uncontaminated by belief systems, religion rejects the imagined boundaries that falsely divide people and ideas, working to expand horizons. The Religious Case Against Belief exposes a world in which religion and belief have become erroneously (and terrifyingly) conflated. In strengthening their association with powerful belief systems, religions have departed from their essential purpose as agencies of higher ignorance. Carse uses his wideranging understanding of religion to find a viable and vital path away from what he calls the Age of Faith II and toward open-ended global dialogue. Far from abstract philosophical musing, The Religious Case Against Belief is required reading for our age.",
  "genres": [
    "Philosophy",
    "Religion",
    "Nonfiction",
    "Spirituality",
    "Belief",
    "Theology"
  ],
  "author": "James P. Carse",
  "average_rating": "3.83",
  "url": "https://www.goodreads.com/book/show/2968424-the-religious-case-against-belief"
}