{
  "title": "Argonauts",
  "description": "Some called her a sorceress, though what she did was science. Medea was a genomancer, a programmer of human genetic code. She could extend someone’s life, turn an ugly duckling into a startling beauty, and cure the most stubborn of diseases. She’d have spent her life helping those who needed it, if only she could have.  But the Argo Corporation didn’t pay her to help people. It paid her to remake their warriors into the ultimate fighting machines. Men with claws, and teeth to match. Men with the reflexes of cats and the strength of a bear. What was once the stuff of fantasy was now real, and corporations the world over were all using genomancers to build armies of their own.  Medea was comfortable in her lab, and she would have stayed there given the choice. She was one of the few who still had a job, now that most of the world’s occupations had been automated away, and she lived a life of relative luxury. But she didn’t count on being pulled into the machinations of two of the biggest corporations on the planet.  And she didn’t count on meeting Jason.  Jason was a shareholder, one of the few, and wealthy beyond the wildest dreams of the masses. He was tall, handsome, and rich, and he could have lived an idle life of ease. He’d chosen to be a warrior instead. But his father had kept him from fighting any actual battles, and years of grueling training left him with disgust for anyone who’d stoop to using a genomancer to cut to the front of the line.  Now Jason’s father is dead, and things have changed. He’s been summoned by Pelias, the CEO of the Argo Corporation, and assigned to a dangerous mission in a strange land full of wonders. And he hasn’t been given a choice about who he’ll take with him: Medea. She was born in the city they’re heading to, and she’s indispensable to the mission. Now Jason is forced to protect someone he sees as a cheater, someone whose genetic shortcuts can only taint a warrior’s honor. He can’t stand her, and he can’t stand what she does for a living. But he’ll need her if he expects to survive the trials to come.  Can a warrior and a scientist find love despite the conflicts between them? How will the wonders of the past echo in the wonders of the future? What will people do to themselves when every bit of their genetic code can change in an instant? And will they still be human anymore when they're done?",
  "genres": [
    "Science Fiction",
    "Fantasy",
    "Dystopia",
    "Fiction",
    "Science Fiction Fantasy",
    "Mythology"
  ],
  "author": "Kevin Kneupper",
  "average_rating": "3.45",
  "url": "https://www.goodreads.com/book/show/29692124-argonauts"
}