{
  "title": "Hitler's Private Library: The Books That Shaped His Life",
  "description": "A brilliantly original exploration of some of the formative influences in Hitler’s life—the books he most revered, and how they shaped the man and his thinking.Hitler’s education and worldview were formed largely from the books in his private library. Recently, hundreds of those books were discovered in the Library of Congress by Timothy Ryback, complete with Hitler’s marginalia on their pages—underlines, question marks, exclamation points, scrawled comments. Ryback traces the path of the key phrases and ideas that Hitler incorporated into his writing, speeches, conversations, self-definition, and actions.We watch him embrace Don Quixote, Robinson Crusoe, and the works of Shakespeare. We see how an obscure treatise inspired his political career and a particular interpretation of Ibsen’s epic poem Peer Gynt helped mold his ruthless ambition. He admires Henry Ford’s anti-Semitic tract, The International Jew, and declares it required reading for fellow party members . We learn how his extensive readings on religion and the occult provide the blueprint for his notion of divine providence, how the words of Nietzsche and Schopenhauer are reborn as infamous Nazi catchphrases, and, finally, how a biography of Frederick the Great fired the destructive fanaticism that compelled Hitler to continue fighting World War II when all hope of victory was lost.Hitler’s Private Library, a landmark in the study of the Third Reich, offers a remarkable view into Hitler’s intellectual world and personal evolution. It demonstrates the ability of books to preserve in vivid ways the lives of their collectors, underscoring the importance of the tactile in the era of the digital.",
  "genres": [
    "History",
    "Nonfiction",
    "Biography",
    "Books About Books",
    "Politics",
    "Germany",
    "World War II"
  ],
  "author": "Timothy W. Ryback",
  "average_rating": "3.73",
  "url": "https://www.goodreads.com/book/show/2966587-hitler-s-private-library"
}