{
  "title": "Too Loud, Too Bright, Too Fast, Too Tight: What to Do If You Are Sensory Defensive in an Overstimulating World",
  "description": "With empathy, compassion, and practical tools, a developmental psychologist and sufferer of Sensory Defensive Disorder (SD) sheds light on a little known but common affliction in which sufferers react to harmless stimuli as irritating, distracting, or dangerousWe all know what it feels like to be irritated by loud music, accosted by lights that are too bright, or overwhelmed by a world that moves too quickly. But millions of people suffer from Sensory Defensive Disorder (SD), a common affliction in which people react to harmless stimuli not just as a distracting hindrance, but a potentially dangerous threat. Sharon Heller, Ph.D. is not only a trained psychologist, she is sensory defensive herself. Bringing both personal and professional perspectives, Dr. Heller is the ideal person to tell the world about this problem that will only increase as technology and processed environments take over our lives. In addition to heightening public awareness of this prevalent issue, Dr. Heller provides tools and therapies for alleviating and, in some cases, even eliminating defensiveness altogether.Until now, the treatment for sensory defensiveness has been successfully implemented in Learning Disabled children in whom defensiveness tends to be extreme. However, the disorder has generally been unidentified in adults who think they are either overstimulated, stressed, weird, or crazy. These sensory defensive sufferers live out their lives stressed and unhappy, never knowing why or what they can do about it. Now, with Too Loud, Too Bright, Too Fast, Too Tight, they have a compassionate spokesperson and a solution–oriented book of advice.",
  "genres": [
    "Nonfiction",
    "Psychology",
    "Self Help",
    "Health",
    "Autistic Spectrum Disorder",
    "Mental Health",
    "Parenting"
  ],
  "author": "Sharon Heller",
  "average_rating": "3.90",
  "url": "https://www.goodreads.com/book/show/29725.Too_Loud_Too_Bright_Too_Fast_Too_Tight"
}