{
  "title": "Collected Tales, Sketches, Speeches, & Essays 1891–1910",
  "description": "This Library of America book, with its companion volume, is the most comprehensive collection ever published of Mark Twain’s short writings — the incomparable stories, sketches, burlesques, hoaxes, tall tales, speeches, satires, and maxims of America’s greatest humorist. Arranged chronologically and containing many pieces restored to the form in which Twain intended them to appear, the volumes show with unprecedented clarity the literary evolution of Mark Twain over six decades of his career.This volume contains eighty pieces from the years 1891 to 1910, when Twain emerged from bankruptcy and personal tragedy to become the white-suited, cigar-smoking international celebrity who reported on his own follies and those of humanity with an unerring sense of the absurd. Some stories display Twain’s fascination with money and greed, such as “The Esquimau Maiden’s Romance” and “The Man That Corrupted Hadleyburg.” Other stories, written after the death of his daughter Susy in 1896, explore the outer limits of fantasy and psychic phenomena, including “Which Was the Dream?” “The Great Dark,” and “My Platonic Sweetheart.”The United States military involvement in Cuba, China, and the Philippines turned Twain’s attention to political satire and invective. “To the Person Sitting in Darkness,” “The United States of Lyncherdom,” “The Czar’s Soliloquy,” and “The War Prayer” are biting denunciations of European and American imperialism. Other political issues inspired articles and stories about the Jews, the notorious Dreyfus case, and vivisection. Twain’s increasingly unorthodox religious opinions are powerfully, often comically, expressed in “Extracts from Adam’s Diary,” “Eve’s Diary,” “Eve Speaks,” “Adam’s Soliloquy,” “A Humane Word from Satan,” “What is Man?” “Extract from Captain Stormfield’s Visit to Heaven,” and “Letters from the Earth.”“Against the assault of laughter,” he said, “nothing can stand.” Twain’s brilliant inventiveness continues to shine in such later comic masterpieces as “Fenimore Cooper’s Literary Offences,” “Italian Without a Master,” “Hunting the Deceitful Turkey,” and “My First Lie and How I Got Out of It.” A posthumous collection of proverbs and aphorisms (“More Maxims of Mark”) is included as an appendix.The publishing history of every story, sketch, and speech in this volume has been thoroughly researched, and in each instance the most authoritative text has been reproduced. This collection also includes an extensive chronology of Twain’s complex life, helpful notes on the people and events referred to in his works, and a guide to the texts.",
  "genres": [
    "Essays",
    "Literature",
    "Fiction",
    "Humor",
    "American",
    "Short Stories",
    "Classics"
  ],
  "author": "Mark Twain",
  "average_rating": "4.36",
  "url": "https://www.goodreads.com/book/show/2973.Collected_Tales_Sketches_Speeches_Essays_1891_1910"
}