{
  "title": "What Would Martin Say?",
  "description": "On April 4, 1968, the Reverend Martin Luther King Jr. was assassinated on the balcony of the Lorraine Motel in Memphis, Tennessee, depriving the world of one of the greatest moral authorities of the twentieth century. He was thirty-nine. King had achieved so much at such a young age that it is hard to believe that he has been gone longer than the brief time he spent on this earth. He spoke out not only on segregation and racism against African Americans, but about many other issues of the day, from police brutality and labor strikes to the Vietnam War. Given the current state of the world, we would all benefit from hearing Martin's voice, if only he were alive today. . . . If anyone would have insight into what Martin would say, it would be Clarence B. Jones, King's personal lawyer and one of his closest principal advisers and confidants. Jones—now seventy-seven, has chosen the occasion of this somber anniversary to break his silence—removing the mythic distance of forty years' time to reveal the flesh-and-blood man he knew as his friend, Martin. Jones ponders what the outspoken rights leader would say about the serious issues that bedevil contemporary Islamic terrorism and the war in Iraq, reparations for slavery, anti-Semitism, affirmative action, illegal immigration, and the vacuum of African American leadership. Delving deep into his memories of the man he worked closely beside, and with help from the King Institute at Stanford University and reams of formerly top-secret and now declassified FBI files, Jones offers the guidance and insight his friend and mentor would have provided for us in these troubled times. Many Americans today know of Martin Luther King only from video clips and history books. As Jones so aptly reminds us, this legendary figure was also a warm human being full of life—and more relevant now than ever.",
  "genres": [
    "History",
    "American History"
  ],
  "author": "Clarence B. Jones",
  "average_rating": "3.85",
  "url": "https://www.goodreads.com/book/show/2972404-what-would-martin-say"
}