{
  "title": "Die Archaeopteryx Saga: Das Rätsel Des Urvogels",
  "description": "1861 wurde das erste Fossil eines Archaeopteryx in den ergiebigen Steinbrüchen von Solnhofen entdeckt. Damit begann eine ebenso aufregende wie kuriose Zeit für Paläontologen und Ornithologen, aber auch für Abenteurer und Geschäftemacher. Doch der erbitterte Streit um den Archaeopteryx ist nicht auf die Vergangenheit beschränkt: Auch heute noch kämpfen sowohl Wissenschaftler als auch religiöse Kräfte um die Bedeutung dieses besonderen Tieres und der Funde, die man in jüngster Zeit machen konnte.  Paul Chambers -- er war unter anderem als wissenschaftlicher Berater für die BBC-Erfolgsserie Dinosaurier -- im Reich der Giganten tätig - erzählt die Geschichte des erstaunlichen Urvogels mit viel Witz und einem enormen Gespür für Dramatik. Die Geschichte beginnt mit dem glücklichen Fund des ersten Exemplars, das der Arzt Dr. Karl Häberlein mit allerlei Winkelzügen an den Meistbietenden verkaufte. Sofort stürzten sich Wissenschaftler verschiedenster Richtungen auf den Archaeopteryx, denn gerade hatte Darwin mit seinem Werk Die Entstehung der Arten durch natürliche Zuchtwahl Furore gemacht. Und der Urvogel schien der Beweis für seine Theorie zu sein, dass Arten durch Evolution aus anderen Arten entstehen. In der Folge kam es zu Intrigen und offenen Feindseligkeiten -- zuerst zwischen den Wissenschaftlern Owen und Huxley, später folgte der Knochenkrieg zwischen Cope und Marsh. Nicht wenige ruinierten sich finanziell und körperlich bei dem Versuch, ihre Sicht der Dinge zu beweisen.  Doch obwohl die Evolution selbst inzwischen nur noch von wenigen angezweifelt wird, gibt es auch heute noch erstaunliche Kämpfe und Ereignisse rund um den Archaeopteryx und neueste Funde zum Beispiel in China. So sorgte in den achtziger Jahren eine Fälschung, der Archaeoraptor, für Aufregung. Und ein neuer Vorfahr der Vögel ist eben erst entdeckt worden. Haben sich die Vögel aus den Dinosauriern entwickelt, oder gehen beide auf einen gemeinsamen Vorfahr zurück? Es bleibt spannend.  Die Geschichte des Archaeopteryx ist tatsächlich eine Saga mit allem, was dazu gehört: heißblütige Protagonisten, Intrigen, Kämpfe -- und jede Menge Überraschungen. Paul Chambers hat ein spannendes und verrücktes Stück Wissenschaftsgeschichte ebenso aufschlussreich wie unterhaltsam aufbereitet. Lesen! -- Gabi Neumayer",
  "genres": [
    "Science",
    "Evolution",
    "History",
    "Palaeontology",
    "Geology",
    "Nonfiction",
    "Birds"
  ],
  "author": "Paul Chambers",
  "average_rating": "3.86",
  "url": "https://www.goodreads.com/book/show/2971772-die-archaeopteryx-saga"
}