{
  "title": "The Knight and Knave of Swords",
  "description": "Ramsey Campbell, the highly regarded British horror author, called him: \"the greatest living writer of supernatural horror fiction\". Drawing many of his own themes from Shakespeare, Edgar Allen Poe, and H.P. Lovecraft, master manipulator Franz Leiber is a worldwide legend within the Fantasy genre, actually coining the term \"Sword and Sorcery\", which would describe the sub-genre he would more than help create.While Lord of the Rings took the world by storm, Leiber's fantastic but thoroughly flawed anti-heroes, Fafhrd and Grey Mouser, adventured and stumbled deep within the caves of Inner Earth as well, albeit a different one. They wondered and wandered to the edges of the Outer Sea, across the Land of Nehwon and throughout every nook and cranny of gothic Lankhmar, Nehwon's grandest and most mystically corrupt city.Lankhmar is Leiber's fully realized, vivid incarnation of urban decay and civilization's corroding effect on the human psyche. Fafhrd and Mouse are not innocents; their world is no land of honor and righteousness. It is a world of human complexities and violent action, of discovery and mystery, of swords and sorcery.\"Fritz Leiber's tales of Fafhrd and the Gray Mouser are virtually a genre unto themselves. Urbane, idiosyncratic, comic, erotic and human, spiked with believable action of a master fantasist!\" - William Gibson\"After too long a wait, the master story teller of us all returns with a huge, anecdotal adventure in the magic-drenched lives of Fafhrd and the Gray Mouser. Glowing imagination melds with gorgeous language to make this one of Leiber's very best... which is a better best than this poor world usually has to offer. Leiber's back: rejoice!\" - Harlan Ellison\"It's all Fritz Leiber's fault. If he weren't such a deadly fine fantasist I wouldn't be stopping everything to read his tales. And if he weren't such a master I wouldn't occasionally look out of the window and wish he'd interrupt my routine again, as he doesn't do it often enough. The Knight and Knave of Swords came into my life and took over an otherwise fully programmed afternoon. I stop everything when a new Fafhrd and Gray Mouser story comes into my hands.\" - Roger ZelaznyContents:9 · Sea Magic · ss The Dragon, December 1977 29 · The Mer She · nv Heroes & Horrors, Whispers Press, 1978 63 · The Curse of the Smalls and the Stars · na Heroic Visions, ed. Jessica Amanda Salmonson, Ace, 1983 117 · The Mouser Goes Below · na - portions first printed as “The Mouser Goes Below” (Whispers #23, 1987) and “Slack Lankhmar Afternoon Featuring Hisvet” (Terry’s Universe, ed. Beth Meacham, Tor, 1988)",
  "genres": [
    "Fantasy",
    "Sword and Sorcery",
    "Fiction",
    "Science Fiction Fantasy",
    "Short Stories",
    "Collections",
    "Science Fiction"
  ],
  "author": "Fritz Leiber",
  "average_rating": "3.79",
  "url": "https://www.goodreads.com/book/show/297387.The_Knight_and_Knave_of_Swords"
}