{
  "title": "The Suitable Inheritor",
  "description": "An inspirational journey to the extraordinary that spans CHICAGO and PERU with an INDIA connect. A fascinating saga of true love, exceptional success, self-discovery, sacrifice, and support. Michael Elliott is stirred from deep sleep by an early-morning dream—a beautiful woman leads him to the Pacific Ocean and whispers that the ocean will help him discover his true destiny. When Michael is then invited to Peru, he wonders if this is the path to that destiny. The journey of a lifetime, the energy of the majestic Pacific Ocean, a priceless philosophy for success and happiness, the sacrifice of a soul mate from Chicago, and the support of a special mate from India combine to make Michael the preeminent relationship coach for young people. Once he reaches that pinnacle, he is confronted with the most difficult choice he has ever made: in the pursuit of excellence, does sacrifice matter more than support; or without support, does no sacrifice count? Can Michael resolve this life-changing dilemma, discover his true destiny, and finally become The Suitable Inheritor?Book Reviews (Huffington Post, Readers Favorite, Midwest Book Review):Incredible Review by Huffington Post (Huffpost Books) - \"The Suitable Inheritor is an excellent read that will capture the reader’s interest and make them yearn for a sequel\" - http://www.huffingtonpost.com/stacey-...Book Review (5 Star) by Readers Favorite: \"The Suitable Inheritor by Pushpendra Mehta is an extraordinary tale of pure love, inspiration, enlightenment, and destiny. It is a truly compelling read with a beautiful story and invaluable lessons.\"Book Review by Suzie Housley, Midwest Book Review: \"THE SUITABLE INHERITOR will touch your heart, soul, and mind as you fall in love with all this novel offers.\"Book Review by Abhilasha Agarwal, co-author of the bestseller Rendezvous with God: \"A captivating story of sacrifice, excellence, love, passion, mistakes, and the yearning that each of us can relate to.\"",
  "genres": [
    "Fiction"
  ],
  "author": "Pushpendra Mehta",
  "average_rating": "4.05",
  "url": "https://www.goodreads.com/book/show/29738916-the-suitable-inheritor"
}