{
  "title": "The Triumph of the Sea Gods: The War against the Goddess Hidden in Homer's Tales",
  "description": "An investigation of the geographical incongruities in Homer’s epics locates Troy on the coast of Iberia, in a conflict that changed history• Cites the rise in sea level in 1200 B.C. as leading to the invasion and victory of the Atlantean sea people over the goddess-worshipping Trojans who ruled the coasts• Identifies Troia (Troy) as part of a tri-city area that later became Lisbon, PortugalIn The Triumph of the Sea Gods , Steven Sora argues compellingly that Homer’s tales do not describe adventures in the Mediterranean, but are adaptations of Celtic myths that chronicle an Atlantic coastal war that took place off the Iberian Peninsula around 1200 B.C. It was a war between the pro-goddess Celtic culture that presided over what is now Portugal and the patriarchal culture of the sea-faring Atlanteans. The invasion of the Atlantean sea peoples brought destruction to the entire region stretching from Western Europe’s Atlantic border to Egypt, Syria, and Turkey. This was a turning point not only politically but also spiritually. The goddess became demonized, as seen in myths such as Pandora’s Box in which woman was seen as the source of evil, not the origin of life, and Homer’s tale of the epic Greek and Trojan war, which was triggered by the abduction of a woman.The actual historical struggle described in Homer’s stories, Sora explains, occurred during what was the last in a series of rises in sea level that inundated various land masses (Atlantis) and permitted sea passage to areas previously accessible only by land. The “Sea Gods” (Atlanteans) attacked the tri-city region of Troia (Troy), near present-day Lisbon, which, shortly thereafter, fell victim to a devastating series of seaquakes and tsunamis. The war and the subsequent destructive weather broke the power of this seaboard civilization, leading to a wholesale invasion by the sea peoples and the rapid decline of the region’s goddess-worshipping culture that had reigned there since Neolithic times. Sora shows how Homer’s tales allow the modern world to glimpse this ancient conflict, which has been obscured for centuries.",
  "genres": [
    "Nonfiction",
    "History"
  ],
  "author": "Steven Sora",
  "average_rating": "4.04",
  "url": "https://www.goodreads.com/book/show/1185101.The_Triumph_of_the_Sea_Gods"
}