{
  "title": "Meetings with Remarkable Manuscripts",
  "description": "This is a book about why medieval manuscripts matter. Coming face to face with an important illuminated manuscript in the original is like meeting a very famous person. We may all pretend that a well-known celebrity is no different from anyone else, and yet there is an undeniable thrill in actually meeting and talking to a person of world stature.The idea for the book, which is entirely new, is to invite the reader into intimate conversations with twelve of the most famous manuscripts in existence and to explore with the author what they tell us about nearly a thousand years of medieval history - and sometimes about the modern world too. Christopher de Hamel introduces us to kings, queens, saints, scribes, artists, librarians, thieves, dealers, collectors and the international community of manuscript scholars, showing us how he and his fellows piece together evidence to reach unexpected conclusions. He traces the elaborate journeys which these exceptionally precious artefacts have made through time and space, shows us how they have been copied, who has owned them or lusted after them (and how we can tell), how they have been embroiled in politics and scholarly disputes, how they have been regarded as objects of supreme beauty and luxury and as symbols of national identity. The book touches on religion, art, literature, music, science and the history of taste.Part travel book, part detective story, part conversation with the reader, Meetings with Remarkable Manuscripts conveys the fascination and excitement of encountering some of the greatest works of art in our culture which, in the originals, are to most people completely inaccessible. At the end, we have a slightly different perspective on history and how we come by knowledge. It is a most unusual book.",
  "genres": [
    "History",
    "Nonfiction",
    "Art",
    "Medieval",
    "Books About Books",
    "Art History",
    "Medieval History"
  ],
  "author": "Christopher de Hamel",
  "average_rating": "4.42",
  "url": "https://www.goodreads.com/book/show/29744374-meetings-with-remarkable-manuscripts"
}