{
  "title": "The Never-Open Desert Diner",
  "description": "Listening Length: 10 hours and 14 minutesBEN JONES, the protagonist of James Anderson's haunting debut novel, The Never-Open Desert Diner is on the verge of losing his small trucking company. A single, thirty-eight-year-old truck driver, Ben s route takes him back and forth across one of the most desolate and beautiful regions of the Utah desert. The orphan son of a Native American father and a Jewish social worker, Ben is drawn into a love affair with a mysterious woman, Claire, who plays a cello in the model home of an abandoned housing development in the desert. Her appearance, seemingly out of nowhere, reignites a decades-old tragedy at a roadside café referred to by the locals as The Never-Open Desert Diner. The owner of the diner, Walt Butterfield, is an embittered and solitary old man who refuses to yield to change after his wife's death. Ben's daily deliveries along the atmospheric and evocative desert highway bring him into contact with an eccentric cast of characters that includes: John, an itinerant preacher who drags a life-sized cross along the blazing roadside; the Lacey brothers, Fergus and Duncan, who live in boxcars mounted on cinderblocks; and Ginny, a pregnant and homeless punk teenager whose survival skills make her an unlikely heroine. Ben s job as a truck driver is more than a career; it is a life he loves. As he faces bankruptcy and the possible loss of everything that matters to him, he finds himself at the heart of a horrific crime that was committed forty years earlier and now threatens to destroy the lives of those left in its wake. Ben discovers the desert is relentless in its grip, and what the desert wants, it takes.",
  "genres": [
    "Fiction",
    "Mystery",
    "Romance",
    "Thriller",
    "Literary Fiction",
    "Noir",
    "Adult Fiction"
  ],
  "author": "James          Anderson",
  "average_rating": "3.90",
  "url": "https://www.goodreads.com/book/show/29740104-the-never-open-desert-diner"
}