{
  "title": "بنت السلطان",
  "description": "قصة \"بنت السلطان\" شخصية رئيسية واحدة لا تحمل إسما.  القصة رائعة وستعجب محبي الأسلوب الخفيف في الكتابة. إنها قصة من الواقع المصري إذ أنها تلقي الضوء على مشاكل الشباب الراغبين في الزواج. تم تقديم البطل في الصفحة الأولى من القصة وهو يقف خلف القضبان ويطلب من القضاة السماح له بالدفاع عن نفسه قائلا \" لا أريد محامين، سأدافع عن نفسي\". البطل متهم بقتل عمته، وقد اعترف بقتلها. لم يقبض عليه البوليس، ولم يكن من بين المشتبه بهم، بل ذهب بنفسه إلى قسم الشرطة واعترف بجريمته.ما هو السبب الذي دفع البطل إلى قتل عمته؟اعتاد بطل \"بنت السلطان\" على زيارة عمته العانس توحيدة في شقتها الكائنة بحي شبرا الذي يعد من أكثر أحياء القاهرة اكتظاظا بالسكان، حيث تعيش مع اختها الأصغر منها فريدة. كانت توحيدة تعطف على ابن أخيها منذ طفولته. فكانت تعطيه المال والحلوى والملابس وكل ما يريد. وفي المقابل كان يشتري لها احتيجاتها من السوق. وكانت تقول له \"أنت راجلنا\". وبعد انتهائه من دراسته وحصوله على شهادة الدبلوم عثر البطل على وظيفة بسيطة العائد، وقرر أن يتزوج. وبعد الخطوبة طلبت منه عائلة خطيبته تأثيث شقة الزواج. تجول البطل في كل أنحاء العاصمة ودار بضواحيها ولكنه لم يعثر على شقة بالجنيهات القليلة التي كان يتقاضاها راتبا من وظيفته كل شهر. وقالت له خطيبته \"إذا لم تأت بشقة قريبا فإن أهلي سيفسخون الخطوبة ويقبلون عريسا آخر\". بعد تفكير عميق قرر الرجل أن يطلب من عمته أن تعطيه غرفة واحدة من الغرف الثلاثة التي تضمها شقتها ليتزوج فيها. رفضت عمته الطلب وأصابته بالإحباط. عاود البطل البحث عن شقة ولكن لم ينجح هذه المرة أيضا. مرضت عمته مرضا شديدا. فقد أصابها السرطان اللعين، وقال الأطباء إنها لن تعيش طويلا. أصبح البطل وأرحامه ينتظرون وفاتها بفارغ الصبر. لكنها لم تمت.وفي يوم من الأيام قام البطل بزيارة عمته. كان هادئا جدا. دخل غرفة نومها وشرح لها مشكلته.وطلب منها للمرة الأخيرة أن يعيش معها في الشقة. رفضت من جديد. كانت في الواقع تعاني معاناة شديدة من الألم وكانت تصرخ. أخذ الوسادة ووضعها على وجهها لمدة قصيرة حتى أصبحت جثة هامدة.طلب من الخادمة أن تستدعي الطبيب فورا. لم يشك الطبيب في شيء وقال إنها استراحت من الألم وأن الموت أفضل لها. وقالت الخادمة الشيء نفسه. دفنت عمته ولم يقع أي مكروه. توجه البطل إلى بيته وحبس نفسه في غرفته لمدة أسبوع. ولكنه لم يحتمل شعوره بالذنب، فسلم نفسه للبوليس واعترف بجريمته. وفي المحكمة طالب القضاة بتبرئته. وطالبهم بأن يضعوا في اعتبارهم عند الحكم عليه أزمة الإسكان. طلب منهم أن يتجولوا في الشوارع ويبحثوا عن شقة. فإن وجدوا شقة بسهولة فإنه مستعد للشنق.",
  "genres": [
    "Fiction",
    "Short Stories",
    "Literature"
  ],
  "author": "إحسان عبد القدوس",
  "average_rating": "3.70",
  "url": "https://www.goodreads.com/book/show/11852497"
}