{
  "title": "G-vites ~ Everyday Invitations From God: A Handbook for Practical Spirituality",
  "description": "G-vites: Everyday Invitations from God, by Patty Kogutek, is a handbook for practical spirituality to establish a relationship with the Creator through a progression of 27 ordinary invitations from God to find our why, survive adversity, and celebrate happiness. G-vites are invitations from God to connect with the divine in nontraditional ways. They appear in ordinary, everyday life, not Sunday mornings in church. For much of my life, I ignored these G-vites, choosing instead to focus on what others defined as the way to connect with God. As told in my memoir, A Change of Habit: A Spiritual Journey from Sister Mary Kateri to Sister Mary Vodka, my spiritual quest led me to search for God in a convent for seven years. After finding no joy in the convent, I departed, only to find equal unhappiness in the secular world until I discovered spirituality within and ordinary G-vites. G-vites is a culmination thus far of my searching for God. It contains ordinary tactics I’ve used to seek connection with my Creator and what has brought spiritual fulfillment to my life. Each of the book’s 27 chapters begins with a story from my life—some from my childhood in a Catholic family, others after I left serving God in the convent, and others from ordinary humorous situations. The chapter then introduces the G-vite coming from God through the incident to lead us toward a higher spirituality. Then, each chapter gives readers a takeaway or a practice to help weave spirituality into their lives. These 27 invitations aid readers with connecting with the divine, but without going to church or meeting with a minister or priest. The invitations help readers see how to meet God in everyday, ordinary ways. We can respond to the G-vites with one of two choices: We can accept the invitation to change, evolve, and move deeper into the human experience to meet God. Or we can remain in the safety of the status quo. What matters is how we RSVP to these vital invitations. G-vites shows how to connect with God.",
  "genres": [],
  "author": "Patty Ptak Kogutek",
  "average_rating": "4.38",
  "url": "https://www.goodreads.com/book/show/29758933-g-vites-everyday-invitations-from-god"
}