{
  "title": "The House That Lou Built",
  "description": "Lou Bulosan-Nelson is going to build her dream. She shares a room with her mom in her grandmother's house in San Francisco, and longs for a place of her own where she can escape her lovable but large extended Filipino family. Lou has a talent for woodshop class and creating projects, and plans to build a tiny house, 100 square feet, all her own, on land that she inherited from her dad, who died before she was born. Then Lou discovers it's not so easy to build one, but she won't give up on her dream—and her friends and family won’t either. This heartwarming coming-of-age story explores culture and family, forgiveness and friendship, and what makes a house a true home. ADVANCED PRAISE FOR THE HOUSE THAT LOU BUILT“Lou’s story gives voice to Filipino youth, addressing cultural differences, the importance of community, and the true meaning of home. This delightful debut welcomes readers in like a house filled with love.”★ Kirkus, starred review“Cheerful and hope-filled.”★ School Library Journal, starred review\"If this book were a house, the rooms would be filled with warmth, family, and friendship.\" —Erin Entrada Kelly, Newbery Medal-winning author of Hello, Universe“Endearing to the end.” —Rita Williams-Garcia, Newbery Honor-winning author of One Crazy Summer \"Warm, funny and affirming. As we get to know Lou, her extended Filipino family, and friends, the door opens into her life and, ultimately, her home.\" —Lisa Yee, author of Millicent Min and the DC Super Hero Girls series \"This story may be about a tiny house, but it has an enormous heart.\" —Kate Messner, author of The Exact Location of Home\"There couldn't be a hero more determined, resourceful or lovable.\" —Tricia Springstubb, author of Every Single Second",
  "genres": [
    "Middle Grade",
    "Realistic Fiction",
    "Fiction",
    "Contemporary",
    "Family",
    "Childrens",
    "Cultural"
  ],
  "author": "Mae Respicio",
  "average_rating": "3.94",
  "url": "https://www.goodreads.com/book/show/29752051-the-house-that-lou-built"
}