{
  "title": "Goodnight",
  "description": "Life is pain.  That is the reality Goodie has had to accept since she was nine years old. Even before the night her childhood shattered she was never normal: her mind can process people and situations at lightning speed, she has the ability to recall anything she sees or hears with perfect clarity, she can separate from herself if she needs to – making her difficult to torture, difficult to intimidate. In summary, she is the perfect mercenary. A life in the shadows where she can stay in darkness is fine by her. That is until he tries to pull her into the light.  Powerful, arrogant, filthy-rich men are, quite frankly, a pain in Goodie’s arse. She’d much rather take an extraction job in the depths of a Colombian jungle than have to deal with their bullshit. But sometimes the money is just too good to turn down, and this time someone important, who is actually doing something Goodie believes in, needs to be kept safe. Luckily, Goodie is an expert at maintaining an invisible presence, enabling her to keep any interaction with the egomaniacs she protects to a minimum … until she meets Nick Chambers.  Nick doesn’t seem to understand invisible presence, appropriate employer–employee protocol, security precautions, following instructions, or in fact just leaving her the fuck alone. Everything about him, from his ability to laugh at their situation to the perpetual smile on his gorgeous face complete with goddamn dimple, drives Goodie insane, and for some reason makes her feel threatened. Fear is weakness, and if Goodie’s life has taught her anything it’s that you never, ever show weakness.  But Nick is determined, and he’s used to getting what he wants. He’s been effortlessly charming the women in his life since he was five years old, so he knows it won’t be long before he has Goodie right where he wants her. Only some things are so dark, so horrific, they can’t be dragged into the light. Some people are beyond redemption, and Goodnight may be one of them.  This book is a full-length, stand-alone contemporary romance of approximately 85,000 words with no cliffhanger.  Warning This story does involve some swearing and violence from the outset.",
  "genres": [
    "Romance",
    "Contemporary Romance",
    "Contemporary",
    "Slow Burn",
    "Fiction",
    "Military Fiction",
    "Abuse"
  ],
  "author": "Susie Tate",
  "average_rating": "4.28",
  "url": "https://www.goodreads.com/book/show/29763038-goodnight"
}