{
  "title": "The Civil War Day By Day: An Almanac, 1861-1865",
  "description": "“In all the vast collection of books on the American Civil War there is no book like this one. It has been needed for a long time, both by the student and by the man who simply likes to read about the Civil War, but until now no one had the dedication or the encyclopedic knowledge to produce it. Here it is, at last—an almanac, or day-by-day recital down to the close conflict, written by Professor E. B. Long of the University of Wyoming. If there was a battlefield in the Civil War that this man has not visited personally, I do not know where it is; if there is an important collection of papers shedding light on the war that he has not examined, it would be hard to name it. It is no exaggeration whatsoever to say that this man knows more facts about the Civil War than any other man who ever lived. To know a subject thoroughly, of course, is one thing; to put the results of that knowledge into lucid prose of manageable compass is something else again. One does not need to examine many pages of this almanac to realize that Professor Long has succeeded admirably in the second task. Crammed into the margins of each page with facts, this book is never soporific. It is for the casual reader as well as for the specialist; it can even, as a matter of fact, be read straight through as a narrative, in which the dramatic and heart-stirring events of America’s greatest time of trial pass before the eye on a day-to-day basis. A book like this has been needed for a long time, but up to now no one was able to write it. It should have a long life, and no one will ever need to do it again. It belongs on the somewhat restricted shelf of Civil War books that will be of permanent value.”Bruce Catton, from his foreword",
  "genres": [
    "Civil War",
    "History",
    "American Civil War",
    "Nonfiction",
    "Historical",
    "Reference",
    "Military History"
  ],
  "author": "E.B. Long",
  "average_rating": "4.39",
  "url": "https://www.goodreads.com/book/show/297632.The_Civil_War_Day_By_Day"
}