{
  "title": "The Science of Planetary Signatures in Medicine: Restoring the Cosmic Foundations of Healing",
  "description": "A comprehensive guide to the cosmic influences that underlie health and how to apply them for profound health and healing• Examines how ancient and modern traditions of healing interconnect through the doctrine of signatures, “As above, so below”• Reveals how one’s astrological chart has implications for personal health and healing• Explains how each sign of the zodiac corresponds not only to parts of the body and its chakras but also to specific plants, herbs, colors, and emotions• Explores how to use sound healing to harmonize astrological imbalancesWhen we look at the vast and intricate cosmos--galaxies, planets, organisms, organs, cells, molecules, atoms--there is a fundamental order, a music or harmony of the spheres. Our cells reflect the images of galaxies seen through our telescopes. We are the microcosm, reflecting the macrocosm of the heavens. Our ancestors understood these patterns and connections between humanity and the universe and developed spiritual and healing traditions in line with these cosmic truths. Yet in the 19th century, knowledge of these connections was set aside as medical science sought to create the “one size fits all” approaches to healing that dominate modern medicine today.In this comprehensive exploration of the celestial influences that underlie health and healing, Jennifer Gehl, with Marc Micozzi, examines how ancient and modern traditions of healing interconnect through the doctrine of signatures, “As above, so below”. She reveals how one’s celestial nature--the arrangement of the cosmos at the moment of birth--has implications for personal health and how each sign of the zodiac corresponds to parts of the body, the chakras, and specific plants, herbs, colors, and emotions. She explains how sound re-arranges forms according to the principles of harmony, leveraging not only the human self-regulating capacity to restore health but also that of the Earth to restore balance and harmony. Also explored are the recurrence of geometric forms in nature and how to apply this knowledge in sound healing and medical astrology.Weaving together the threads of ancient science and spirit that formed the original tapestry of medicine, Gehl explains how to restore the cosmic foundations of healing for personal, planetary, and universal health and wellbeing.",
  "genres": [
    "Astrology"
  ],
  "author": "Jennifer T. Gehl MHS",
  "average_rating": "4.17",
  "url": "https://www.goodreads.com/book/show/29767577-the-science-of-planetary-signatures-in-medicine"
}