{
  "title": "Time: Wounds All Heal",
  "description": "The Skeptic: “If all this had truly been staged, people would’ve figured it out and demanded the government come out about it.” The Journalist: “It’s easy to fool a person— It’s quite another to convince them they’ve been fooled.”  Even with the blanket of tattoos that covered both his arms and most of his upper chest, or the face hidden under the hair that constantly fell over his eyes, Channing Maroussas was likely the most beautiful man Chris Sayer had ever met. He was thankful they were close friends as it excused him for any lingering glances. Channing was a bird of brightly lit feathers perched in a world of darkness. But his gift wasn’t just about being beautiful; it was what he could see. He could be in a room full of people, a field emptied of life, reading a newspaper, or overhearing a conversation on the bus— and what was unseen and unheard by others spoke volumes to him. Channing saw what the rest of the world never slowed down long enough to notice, though once pointed out, furies and passions flourished. It was voices like Channing’s that broke the silence of ignorance. His voice just happened to be recorded between the pages of TIME magazine.  Chris Sayer has known Channing for years. But not even that can broker some rules of silence. Chris’s government job is so secretive he can’t even tell his best friend who he works for, which doesn’t help his disagreement over Channing’s journalistic views on global current events. He likes it even less when he finds out Channing left for Syria to cover a story. After Channing accusing the leading presidential elective Nolan Prumpt of inciting hate mongering and fascism, a trip through the greatest hot zone on the planet was like wanting to wash a pill down with poison. But when news got out that Channing had gone missing, Chris knew better than to believe the accusations that his best friend may have changed sides and was now considered an enemy of the state. The one thing Chris did know was he needed to do everything in his power to find Channing before anyone else did. If for no other reason but to let him know how he feels about him. Time— it’s not long enough — yet with enough of it, wounds all heal.     ~ * ~ * ~ * ~ * ~ * ~  THE TEDDY BEAR COLLECTION Their Plane From Nowhere Teddy Bear & Big Spoon Ivan vs Ivan TIME: Wounds All Heal",
  "genres": [
    "Suspense"
  ],
  "author": "Tarian P.S.",
  "average_rating": "4.60",
  "url": "https://www.goodreads.com/book/show/29765171-time"
}