{
  "title": "Something the Cat Dragged In",
  "description": "For Professor Ungley, death isn't half as inconvenient as losing his toupee.An unpleasant man in every respect, university professor Herbert Ungley is exceedingly vain. One morning, his landlady catches her cat coming in with Ungley's hairpiece between its teeth. It's clear something has happened to the old grouch, because he would never be caught without his toupee.Ungley is found in the yard behind his social club, with his head bashed in and his baldness plain for the world to see. Although the police are content to call it an accident, sleuthing horticulturalist Peter Shandy is unconvinced, and finds there are too many unanswered questions. How did Ungley come to have such a bulging bank account? Who was Ungley's long-lost heir, and what did he have to do with the professor's lost hair? And whose is the second body in the woods? Shandy must answer these questions and more if he's to find who pulled the rug out from the balding corpse.Review Quotes:\"The epitome of the 'cozy' mystery.\" - Mostly Murder.\"MacLeod can be counted on for a witty, literate and charming mystery.\" - Publishers Weekly.\"Charm, wit, and Holmesian logic.\" - Audiofile.Biographical note:Charlotte MacLeod (1922-2005) was an internationally bestselling author of cozy mysteries. Born in Canada, she moved to Boston as a child, and lived in New England most of her life. After graduating from college, she made a career in advertising, writing copy for the Stop & Shop Supermarket Company before moving on to Boston firm N. H. Miller & Co., where she rose to the rank of vice president. In her spare time, MacLeod wrote short stories, and in 1964 published her first novel, a children's book called \"Mystery of the White Knight\". In \"Rest You Merry\" (1978), MacLeod introduced Professor Peter Shandy, a horticulturist and amateur sleuth whose adventures she would chronicle for two decades. \"The Family Vault\" (1979) marked the first appearance of her other best-known characters: the husband and wife sleuthing team Sarah Kelling and Max Bittersohn, whom she followed until her last novel, \"The Balloon Man\", in 1998.",
  "genres": [
    "Mystery",
    "Cozy Mystery",
    "Cozy",
    "Fiction",
    "Crime",
    "Humor",
    "Audiobook"
  ],
  "author": "Charlotte MacLeod",
  "average_rating": "3.97",
  "url": "https://www.goodreads.com/book/show/29762262-something-the-cat-dragged-in"
}