{
  "title": "Absolution",
  "description": "But what I felt most was the perfection of what these two men were giving me. And I knew in that moment that I would do anything to keep it. Anything. --Cole After four years abroad, artist Jonas Davenport has come home to start building his dream of owning his own art studio and gallery. But just as he's ready to put the darkness of his past behind him forever, it comes roaring back with a vengeance.The only thing keeping ex-cop Mace Calhoun from eating his own gun after an unthinkable loss is his role in an underground syndicate that seeks to get justice for the innocent by taking the lives of the guilty. Ending the life of the young artist who committed unspeakable crimes against the most vulnerable of victims should have been the easiest thing in the world. So why can't he bring himself to pull the trigger?After years of fighting in an endless, soul-sucking war, Navy SEAL Cole Bridgerton has come home to fight another battle - dealing with the discovery that the younger sister who ran away from home eight years earlier is lost to him forever. He needs answers and the only person who can give them to him is a young man struggling to put his life back together. But he never expected to feel something more for the haunted artist.Cole and Mace. One lives by the rules, the other makes his own. One seeks justice through the law while the other seeks it with his gun. Two men, one light, one dark, will find themselves and each other when they're forced to stand side by side to protect Jonas from an unseen evil that will stop at nothing to silence the young artist forever.But each man's scars run deep and even the strength of three may not be enough to save them... This book contains M/M/M sexual content and is intended for mature audiences. Trigger Warning : This book contains references to childhood sexual abuse.***This is Book 1 in the series, but can be read as a stand-alone story - no cliffhangers.***Book 1 - Absolution (M/M/M)Book 2 - Salvation (M/M)Book 3 - Retribution (M/M)Book 4 - Forsaken (M/M)",
  "genres": [
    "M M Romance",
    "Romance",
    "M M M",
    "Menage",
    "Contemporary",
    "Military Fiction",
    "Abuse"
  ],
  "author": "Sloane Kennedy",
  "average_rating": "4.06",
  "url": "https://www.goodreads.com/book/show/29761713-absolution"
}