{
  "title": "The Story's Writer",
  "description": "There are dark things hiding in well-lit places, waiting to change the hearts of men and women. They are strange and possessive things that may once have had a place in our world. They yearn for that old place and wait impatiently to find their way back. Amy is a loving mother, though lonely and recklessly navigating the world of late nights and one night stands. She is looking for something that will complete her, for someone to hold her and accept her young son as his own. When she meets Grant, a successful novelist who appears to have it all together, she seems to have found a man willing to fill both positions. Bailey is independent for his age, as competent at caring for his own daily needs as most children twice his age, but overweight and ailed by a lack of personal confidence. His reservations about meeting a new man are evident in his resistance of his mother’s demands, but he soon warms to the charming writer. Bailey sees an opportunity to gain not only a father, but a friend. Months later, after Bailey and his mother have taken up residence with this new man, odd behaviors begin to emerge as Grant researches the basis for his new novel. It’s a nonfiction manuscript, based on ghost stories originating at a local bar with a reputation for appearances from the other side. It’s a good book with a good story behind it, but it’s taking Grant down a path of hatred, violence, and ultimate destruction. When Amy begins helping Grant with his editing, she too falls victim to the effects of the story. Soon, Bailey sees the changes in his parents and becomes the focus of the story’s rage. Bailey’s only hope lies in the hands of his Aunt Deb and the manager of the very place it all started. They are racing against time to save a child whose survival depends on the unburying of old ghosts. Bailey doesn’t know how it can all end, sees the mixture of love and hate in his mother’s eyes as she types away at the growing manuscript, can only hope that someone will save him before the unthinkable can happen, because the story being written in his home has stopped mirroring the events at a remote bar, and has become the new terrorizing story of his life.",
  "genres": [
    "Horror"
  ],
  "author": "Wayne Lemmons",
  "average_rating": "4.22",
  "url": "https://www.goodreads.com/book/show/29760415-the-story-s-writer"
}