{
  "title": "Family Kink",
  "description": "First and foremost, this is a kinky love story written in the erotica genre. Unlike most romance erotica, the characters are everyday people who would go unnoticed by the casual observer. Our hero is not a billionaire corporate mogul who can have his way with any heroine who fits the Victoria's Secret image by making eye contact using his smoldering, lustful gaze that causes her nipples to harden and her pussy to gush. Gary is not repulsive, but no hot girl would give him a second glance because he's exceptionally average physically in all respects but one. Being a kind, considerate, caring, unassuming, hard working, totally left brained type of guy, no foxy babes have ever hit on him and asked him to “come up and see me, sometime.” If a middle-aged, twice divorced, plain-Jane, sexually repressed, marriage scheming mother hadn't flirted and flattered him, you wouldn't be reading this story, because he would never have had the courage to hit on her. When her coming of age, just turned 18, horny, definitely unhot daughter decides on a sex revenge plan of her own, to get back at her mother for perceived injustices throughout her teenage years, the hero gets caught in the crossfire as the deceptive plans unravel.  As luck would have it, the daughter's ability to quickly adapt to the rapidly shifting paradigm and re-prioritize her objective when she learns there is more to a lover than big pecs, a six pack and a tight butt, coupled with our hero's exceptional sexual prowess coupled with his all American Mr. Wonderful sensitive, supporting personality, and mom's family values pragmatism results in a grand unified plan that's way outside the box, but is a win-win for our kinky lovers.  Now that you've read the executive summary for the executive, MBA, political crony and hedge fund smutsters, this is what the story is about in layman's  You seduced your pregnant mother's latest husband, surrendering your virginity in order to spite her. You had mind-blowing sex and he impregnated you. Now you can't live without him because sex will never be the same with any other man. Can you convince everyone to live together as a single family with two mothers and one father.  Three related, normal, everyday people, living quiet lives of desperation, find love and kinky sexual fulfillment by creating a nurturing family that doesn't conform to modern cultural norms in any way, shape or form once they get past the artificially contrived shackles of monogamy and realize that love isn't all or nothing.  Or in the words of game Love Is Not A Zero-sum Game.  Warning to This is a short story in the erotica genre. It involves adult themes and describes explicit sexual acts and should only be read by adult readers, 18 or over. All the characters depicted are 18 or over. However, the sexual escapades and resulting kinky family structure could be considered illegal in certain states in the U.S. that have not emerged from the stone-age.",
  "genres": [],
  "author": "Jizze Belle",
  "average_rating": "4.33",
  "url": "https://www.goodreads.com/book/show/29774532-family-kink"
}