{
  "title": "Spectacles",
  "description": "Spectacles is the hilarious, creative and incredibly moving memoir from much loved comedian, writer and presenter Sue Perkins.When I began writing this book, I went home to see if my mum had kept some of my stuff. What I found was that she hadn't kept some of it. She had kept all of it - every bus ticket, postcard, school report - from the moment I was born to the moment I finally had the confidence to turn round and say 'Why is our house full of this shit?'Sadly, a recycling 'incident' destroyed the bulk of this archive. This has meant two things: firstly, Dear Reader, you will never get to see countless drawings of wizards, read a poem about corn on the cob, or marvel at the kilos of brown flowers I so lovingly pressed as a child. Secondly, it's left me with no choice but to actually write this thing myself.This, my first ever book, will answer questions such as 'Is Mary Berry real?', 'Is it true you wear a surgical truss?' and 'Is a non-spherically symmetric gravitational pull from outside the observable universe responsible for some of the observed motion of large objects such as galactic clusters in the universe?'Most of this book is true. I have, of course, amplified my more positive characteristics in an effort to make you like me.Thank you for reading.\nPraise for Spectacles\n'Drama, tears and laughs - Spectacles has got it all. A brilliant, touching memoir suffused with love, it reminds you that life is best lived at wonky angles. I ADORED it' Jessie Burton, bestselling author of The Miniaturist'Very funny . . . It seems there are two Sue Perkins: the TV one, who gabbles and pratfalls, and the sensitive one who aches. The first of course, exists to protect the second. They can both write. The first writes comedy, the second tragedy; in this sense, reading her memoir is very like meeting her'Sunday Times'It's a proper book . . . so well written. Tight & bright & full of inspiration'Chris Evans, Radio 2",
  "genres": [
    "Nonfiction",
    "Biography",
    "Memoir",
    "Autobiography",
    "Audiobook",
    "Humor",
    "LGBT"
  ],
  "author": "Sue  Perkins",
  "average_rating": "4.01",
  "url": "https://www.goodreads.com/book/show/29776971-spectacles"
}