{
  "title": "Under the Maginot",
  "description": "\"UNDER THE MAGINOT is a charming and thoughtful exploration of masculinity, love, and self-discovery in the face of a great and dangerous evil....A thread of bittersweet tragedy runs through the tale, the heavy knowledge of the horrors to come darkening the book, adding a harsh contrast and bringing an inevitable conclusion to the buoyant, romantic youth of the main characters. The story is short enough to be poetic, capturing a brief but crucial moment in Frankie's, and the world's, history in a vivid and dramatic fashion.\" - IndieReader In the spring of 1939, Frankie plans to enjoy his last summer before college, but he has no idea that his family and Europe will soon fall into violence and separation. Suddenly forced from his home by a bitter, alcoholic father and abandoned by his long-abused mother, Frankie has nowhere to go and loses faith in love. After falling asleep in the hold on a famous ocean liner, he finds himself an unintentional stowaway, bound for France from New York. By chance, Frankie escapes arrest, thanks to Raymond Spencer, the handsome and sophisticated (but lonely) son of the ship's owner. Ray also suffers from the pains of a damaged family. Through this, the two young men make an instant connection. Much of Ray's life and persona remain mysterious, though, and are only revealed in small, often heavily veiled portions at a time. As their friendship grows, Frankie finds himself naively drawn into what he thinks is a simple motorcycle trip across France to Nazi Germany. He, however, does not know that Ray's true goal is to bring back intelligence on the details of Hitler's plans to invade Poland to MI6. In trying to reach their destination, both men face a test of trust in each other and struggle to balance love with the importance of the mission and the mental scars left by their fathers. Before they know it, they're fighting just to get out of Germany alive, but the final threat is not one they expected.",
  "genres": [],
  "author": "Nicholas J Knowlton",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/29781187-under-the-maginot"
}