{
  "title": "Cotton",
  "description": "Cotton  Becoming President of the Satan’s Fury MC was a bittersweet moment for Cotton. When his Uncle Saul died, he passed the gavel down to him, and while Cotton took his death hard, he immediately assumed the role with integrity and pride. He considered leading his brothers an honor, and the MC quickly became his main focus… until the day Cassidy walked into his bar and became a distraction he could not deny. She captivated him in a way no other woman ever had. He tried to resist her—to keep his walls up—but it was futile. It always seemed like she saw right through him. All it took was one night of passion with her, and he knew he’d never be able to get enough. He was determined to have her.  He thought he had it all figured out. He thought he could let his walls down and have it all… until his past suddenly came crashing into his future.  Cassidy  When Cassidy walked into a room, all eyes were immediately drawn to her. She exuded a beauty and youthful energy that lit a spark in everyone she met. She was a woman who knew what she wanted and was willing to wait for it. The minute she met Cotton, she was drawn to him. He was older, more mature, and so good-looking he took her breath away. Where most people only saw a hardened MC president, she saw a man who lived his life with strength and determination, filled with an unwavering sense of loyalty, and who had earned the admiration and respect of his brothers. She longed for Cotton, to be close to him. So when he began to let her in, she didn’t hesitate.  She wanted him—all of him. In his arms, she felt safe and protected. She trusted him with her heart… until he broke it, nearly destroying her in the process.  Can she ever learn to trust him again?  Cotton is the fourth book in the Satan’s Fury MC series. It is intended for readers 18 and older due to bad language, violence, and explicit sex scenes.Cotton is a standalone romance, but you may also be interested in reading the other books in the series: Summer Storm, Maverick, and Stitch.Julia Goda - EditorMarci Ponce - Editor",
  "genres": [
    "Romance",
    "Contemporary",
    "Adult",
    "Contemporary Romance",
    "Motorcycle",
    "Erotica",
    "Fiction"
  ],
  "author": "L. Wilder",
  "average_rating": "4.16",
  "url": "https://www.goodreads.com/book/show/29777622-cotton"
}