{
  "title": "Masters of the Shadowlands Box Set: Books 1-4",
  "description": "In the exclusive Shadowlands BDSM club, the title “Master” is given to only the most powerful, experienced, and skilled Dominants.Enjoy the first four books in the series: Club Shadowlands, Dark Citadel, Breaking Free, and Lean on Me in this special offering, available as a box set for the very first time!This is a fabulous series. It’s erotic, it’s romantic, has wonderfully suspenseful plots, and amazing characters (including so many yummy sexy alpha men—I did say I LURVE them, didn’t I?). But even more than that, I think it’s a wonderful introduction to the BDSM genre of Erotica, or even the lifestyle.– The Romance ReviewsMasters of the Shadowlands 1: Club ShadowlandsHer car disabled during a tropical storm, Jessica Randall discovers the isolated house where she’s sheltering is a private bondage club. At first shocked, she soon becomes aroused watching the interactions between the Doms and their subs. But she’s a professional woman—an accountant—and surely isn’t a submissive …is she?Master Z hasn’t been so attracted to a woman in years. But the little sub who has wandered into his club intrigues him. She’s intelligent. Reserved. Conservative. After he discovers her interest in BDSM, he can’t resist tying her up and unleashing the passion she hides within.Masters of the Shadowlands 2: Dark CitadelAfter Kari breaks up with her date during Beginner’s Night at Club Shadowlands, she’s given the option to continue with an experienced dominant. Despite her steamy fantasies about BDSM, the inexperienced schoolteacher plans to simply observe. Yet under the unyielding hands of Master Dan, she not only participates, but gives him everything he asks for. There is nothing she can hide from him. Not her passion.or her love.Still mourning the death of his wife, Master Dan avoids getting involved with women and he never takes a sub twice. But this modest little beginner is such a sweetie, one night is far from enough. As he plumbs her responses, taking her ever deeper into the world of BDSM, the gentle submissive begins to show him how barren his life has become and what a dark citadel he’s made of his heart.During their three nights together, the teacher will learn to submit…can she teach the master to love?Masters of the Shadowlands 3: Breaking FreeA sadistic husband left Beth scarred, inside and out. Only at the Shadowlands BDSM club does she feel like a woman. But her fears limit her to Doms who won’t overwhelm her—the very ones who cannot arouse her. The Master of the Shadowlands gives her an ultimatum: accept the Dom he assigns or lose her membership. The last thing Beth wants is a ruthless, powerful Dom, but that’s just what she gets.Asked to take on a problem sub, Nolan sees the issue immediately—although truly submissive, the little redhead is too scared to relinquish control and her Doms have let her get away with it. That will change right now.As Master Nolan takes Beth under command, compelling her submission, she’s terrified, but the experienced Dom brings her pleasure, not pain. His only demand is that she never lie to him. Under his capable hands, her body comes alive, and she begins to heal. As he pushes her limits, she learns to trust…and then to love. And she realizes he is beginning to care for her in return.But now her cruel husband has found her, and Master Nolan discovers she’s been lying and lying and lying.",
  "genres": [
    "BDSM",
    "Erotica",
    "Romance",
    "Suspense",
    "Contemporary"
  ],
  "author": "Cherise Sinclair",
  "average_rating": "4.63",
  "url": "https://www.goodreads.com/book/show/29778555-masters-of-the-shadowlands-box-set"
}