{
  "title": "The Mermen Trilogy Boxed Set",
  "description": "From New York Times Bestseller Mimi Jean Pamfiloff… THE MERMEN TRILOGY BOXED SET: - MERMEN, Book 1 - MERMADMEN, Book 2 - MERCILESS, Book 3 ~~~~~~ MERMEN: Book 1 These Mermen Don’t Have Tails, They’re Deadly as Hell, and They’ve Got Something He Wants…  INFAMOUS BACHELOR and SELF-MADE BILLIONAIRE ROEN DORAN IS A BASTARD. Yes, he knows it. And no, he doesn’t care. He’s got money and power, and he depends on no one. But when his estranged father dies, willing him a secret island, Roen will come face to face with an even bigger secret: its occupants. And these savage, sea-obsessed warriors are quick to make their position clear: Leave now or die.  There’s only one problem. Nobody tells Roen what to do. Ever. Oh, and one other thing. He’s just met the island’s other new “guest” and something about her brings out his possessive side.  SOLE SHIPWRECK SURVIVOR LIV STRATTON had been adrift at sea for ten grueling days when salvation miraculously appeared: an uncharted island. Only, the deceivingly beautiful men who live there aren’t interested in saving her. No, not at all. Because they somehow believe she is their property, a gift from the ocean to do with as they please. This is not good.  Her only hope? Billionaire Roen Doran, of all people. A man who’s said to care for nothing and no one. But if he’s so heartless, then why is he about to risk everything to help her? ~~~~~~~~~~ MERMADMEN: Book 2 HE NEVER WANTED THIS. HE ONLY WANTED HER...  EVERYTHING ABOUT THE ISLAND OF EL CORAZÓN IS WRONG. The men are ruthless warriors who call themselves mermen but don't have any fish parts, the island isn't exactly an island, and the women...well, let's just say their story isn't pretty. More like a nightmare. Which is exactly why billionaire Roen Doran will do anything to protect the woman he can't live without from that violent place. Including becoming the island's leader and giving her up forever.  WHEN LIV STRATTON ESCAPED THAT TERRIFYING ISLAND in the North Pacific after being shipwrecked, she didn't just leave behind the horror, she left behind Roen Doran. A man she didn't know, but who risked everything to save her. And now her heart can't seem to move on. So part of her wonders if it's somehow her fault she's been taken against her will and locked inside a ship bound for El Corazón. But an even bigger part wonders if Roen will lift a finger to save her this time. After all, now he's one of them...  ~~~~~~~~~~ MERCILESS: Book 3 ONE GIRL. ONE EVIL ISLAND. AND A FIGHT TO THE LAST BREATH.  Liv Stratton has had enough of evil mermen and the psychotic living island they call home. She’s been kidnapped, caged, attacked by sea creatures, and nearly drowned. A nice small-town girl can only take so much.  But after beating the impossible odds, Liv is finally safe at home in Alaska, only to realize that everything she holds dearest in this world is still back on that crazy island. Possibly dead. And if she wants to know what has become of the man she loves and her sister, she’ll have to return and confront the one thing she’s been trying to get away from: the island herself.  Only this time, Liv isn’t the same frightened human she once was. This time, they’ve messed with the wrong girl.",
  "genres": [
    "Paranormal",
    "Fantasy",
    "Paranormal Romance"
  ],
  "author": "Mimi Jean Pamfiloff",
  "average_rating": "4.17",
  "url": "https://www.goodreads.com/book/show/29775681-the-mermen-trilogy-boxed-set"
}