{
  "title": "The New Yorker Festival: Global Warming: Confronting Climate Change",
  "description": "This panel discussion on global warming was recorded live at the 2006 New Yorker Festival in New York City.James Hansen is the longtime director of NASA's Goddard Institute for Space Studies. Since the late 1970s, he has worked on studies and computer simulations of the earth's climate. In the 80s, he testified before Congress on global warming and began issuing public warnings about the long-term threat of heat-trapping emissions. In 2001, he received the Heinz Award for the Environment.Martin Hoffert is a professor emeritus of physics at New York University and an advocate for the adoption of alternative energy sources in response to climate change. His proposals include a space-based solar-power system, a global electricity grid made up of superconductor cables, and mining platinum from asteroids to support hydrogen cars. He holds advanced degrees in astronautics and liberal studies.Robert Socolow is a professor of mechanical and aerospace engineering at Princeton University and the co-director of the university's Carbon Mitigation Initiative. His research is currently focused on global carbon management, the hydrogen economy, and fossil-carbon sequestration.Timothy E. Wirth was the State Department's Under-Secretary for Global Affairs during the Clinton Administration, and he worked with Vice President Al Gore on environmental and population issues. Previously, he served for 18 years in Congress as a representative, and then a senator, from Colorado. He is currently the president of the United Nations Foundation and the Better World Fund.Elizabeth Kolbert received an American Association for the Advancement of Science Journalism Award and a National Magazine Award for her 2005 three-part New Yorker series on global warming. The articles formed the basis for her book Field Notes from a Catastrophe, which was published in March 2006.",
  "genres": [],
  "author": "James  Hansen",
  "average_rating": "3.00",
  "url": "https://www.goodreads.com/book/show/11854679-the-new-yorker-festival"
}