{
  "title": "I Have Devoted My Life to the Clitoris",
  "description": "Elizabeth Hall began writing I HAVE DEVOTED MY LIFE TO THE CLITORIS in the summer of 2010 after reading Thomas Laqueur’s Making Sex. She was particularly struck by Laqueur’s bold assertion: “More words have been shed, I suspect, about the clitoris, than about any other organ, or at least, any organ its size.” How was it possible that Hall had been reading compulsively for years and never once stumbled upon this trove of prose devoted to the clit? If Lacquer’s claim was correct, where were all these “words”? And more: what did size have to do with it? Hall set out to find all that had been written about the clit past and present. As she soon discovered, the history of the clitoris is no ordinary tale; rather, its history is marked by the act of forgetting.ADVANCED PRAISE  In her marvelously researched and sculpted essay/memoir, Elizabeth Hall convinces me that clitoral stimulation is my birthright, a supreme act reaching back to the origins of sensation, connecting me to all my animal sisters: artist, poet, hyena, dolphin. What a thrilling world Hall constructs, her bulleted points rat-tat-tatting the patriarchy, strobing with pleasure. — Dodie Bellamy, author of When the Sick Rule the World and Cunt Norton The unfolding of relationships between, among many other details, Freud, terra cotta cunts, hyenas, anatomists, and Acker, mixed with a certain slant of light on a windowsill and a leg thrown open invite us into this intricately structured catalogue of clit. “I started with a question: what does the body want? And ended with: it wants.” The investigation does not stop there. Elizabeth Hall’s prose builds quietly into a denouement that is as cerebral and corporeal as it is bawdy and beautiful. — Wendy C. Ortiz, author of Excavation: A Memoir and Hollywood Notebook “I am never bored by a body,” says Elizabeth Hall, in this gorgeous little book about a gorgeous little organ. Hall’s restless unearthing of the clitoris’s hidden history mines discourses as varied as sexology, plastic surgery, literature and feminism to produce an eye-opening compendium, stitched together with wit, lyricism and desire. In this spirited collection of telling details and revelatory insights, the “tender button” finally gets its due. — Janet Sarbanes, author of People of the Pancake and Army of One “God this book is glorious. I’m so grateful to Elizabeth Hall for her devotion–scholarly and bodily– alive in this rigorous, lyrical exploration of a most under-written organ. In this far-ranging meditation and investigation, Hall moves elegantly from Marie Bonaparte to the female hyena to contemporary heroes like Kathy Acker and Holly Hughes, asking over and over again: what is it to have a body? How do we read our way into and through that body? Hall shows us how, in dizzying, thrilling detail; you will learn and laugh and wonder why it took you so long to find this book. ” — Suzanne Scanlon, author of Her 37th Year, An Index and Promising Young Women",
  "genres": [
    "Nonfiction",
    "Feminism",
    "Essays",
    "Poetry"
  ],
  "author": "Elizabeth   Hall",
  "average_rating": "4.50",
  "url": "https://www.goodreads.com/book/show/29775169-i-have-devoted-my-life-to-the-clitoris"
}