{
  "title": "Angel Of Mercy",
  "description": "Editorial ReviewAuthor Lisa Olsen gives us a sympathetic character in Mercy Renault.  Her quirky voice leads us through the twists and turns as Mercy tries to find her footing, merging her ordinary life with her newfound angelic abilities.  Samael, the introverted fallen angel who accidentally gives Mercy some of his power, is frustratingly literal-minded and little help in her quest to find out what she is.  Sexy bad boy Adam adds just the right amount of friction to her already complicated life and I wasn't sure if she should kiss him or smack him upside the head.  You might be tempted to cry at the end, but only because you've been so caught up in what comes next; it's a crime that the story is over.   The first in a series, we can only hope that the sequel ties up some of the burning questions we're left with.  Product DescriptionWhen Mercy wakes up in the hospital after a brutal stabbing, she has little recollection of the attack; only the blurred memories of a mysterious stranger with piercing blue eyes that haunts her dreams. After spotting the same man, that only she can see, Mercy follows him home, brazenly confronting him. (kids at home, never do that!) Her savior turns out to be less than human, or is it more?Samael is a fallen angel, bound to the Earth and living out his life among humans but apart from them. Unwilling to let an innocent die, Sam bestowed some of his Grace to Mercy, healing her wounds and imbuing her with some of his angelic powers.  Thrust into a world within her own where angels and demons coexist unseen by mortals, Mercy must learn to accept the fact that she is no longer strictly human; she is something new. Complicating things is Adamiel, the reckless fallen angel who is Sam's enigmatic friend. Equal parts information and aggravation, Sam and Adam help Mercy acclimate to her new life.  But now Mercy's eyes are opened to a whole new world beyond the human realm... and their eyes are opened to her.",
  "genres": [
    "Angels",
    "Paranormal",
    "Romance",
    "Paranormal Romance",
    "Urban Fantasy",
    "Fiction",
    "Amazon"
  ],
  "author": "Lisa Olsen",
  "average_rating": "3.91",
  "url": "https://www.goodreads.com/book/show/11856411-angel-of-mercy"
}