{
  "title": "Starved for Science: How Biotechnology Is Being Kept Out of Africa",
  "description": "Listen to a short interview with Robert Paarlberg Chris Gondek | Heron & Crane Heading upcountry in Africa to visit small farms is absolutely exhilarating given the dramatic beauty of big skies, red soil, and arid vistas, but eventually the two-lane tarmac narrows to rutted dirt, and the journey must continue on foot. The farmers you eventually meet are mostly women, hardworking but visibly poor. They have no improved seeds, no chemical fertilizers, no irrigation, and with their meager crops they earn less than a dollar a day. Many are malnourished. Nearly two-thirds of Africans are employed in agriculture, yet on a per-capita basis they produce roughly 20 percent less than they did in 1970. Although modern agricultural science was the key to reducing rural poverty in Asia, modern farm science—including biotechnology—has recently been kept out of Africa. In Starved for Science Robert Paarlberg explains why poor African farmers are denied access to productive technologies, particularly genetically engineered seeds with improved resistance to insects and drought. He traces this obstacle to the current opposition to farm science in prosperous countries. Having embraced agricultural science to become well-fed themselves, those in wealthy countries are now instructing Africans—on the most dubious grounds—not to do the same. In a book sure to generate intense debate, Paarlberg details how this cultural turn against agricultural science among affluent societies is now being exported, inappropriately, to Africa. Those who are opposed to the use of agricultural technologies are telling African farmers that, in effect, it would be just as well for them to remain poor.",
  "genres": [
    "Science",
    "Nonfiction",
    "Economics",
    "Politics",
    "Africa",
    "Food",
    "Social Issues"
  ],
  "author": "Robert Paarlberg",
  "average_rating": "3.86",
  "url": "https://www.goodreads.com/book/show/2979539-starved-for-science"
}