{
  "title": "The Framers' Coup: The Making of the United States Constitution",
  "description": "Americans revere their Constitution. Few, then, would describe the writing of it as a process fraught with highly improbable circumstances, coincidences, compromises, and largely unexpected outcomes. As Benjamin Franklin keenly observed, any assembly of men, no matter how talented, bring with them \"all their prejudices, their passions, their errors of opinion, their local interests and their selfish views.\" One need not deny that the Framers had good intentions in order to believe that—inevitably—they also had interests. Based on prodigious research and told largely through the voices of the participants, Michael Klarman's The Framers' Coup: The Making of the United States Constitution tells the story of how the Framers' interests shaped the constitution, and what that means for our use of the document today.The Philadelphia convention could easily have been a failure, or not happened at all. Without the heroic efforts of James Madison, George Washington's last-minute decision to attend, and the countless negotiations in the midst of debate and gridlock, the constitution we know today may never have been ratified. Had anything gone wrong and the convention been dissolved without consensus, any number of events may have occurred, such as a civil war, or reversion to monarchy. Klarman's narration of these events is full of colorful characters and riveting stories: the rebellion by debtor farmers in Massachusetts; the deal that induced John Hancock to support ratification; the secretive dealings of Alexander Hamilton and John Jay at the New York ratifying convention that produced an improbable victory. The constitution, he shows, was not created by rousing national consensus—an impractical concept at the time—but by the personal preferences of its creators. Moreover, the convention produced a constitution very different from what most Americans anticipated. How did the Framers convince Americans to approve a scheme so unrepresentative of national opinion? And to what extent should Americans rely on it today?Towards the end of his life, Thomas Jefferson noted that each generation has \"a right to choose for itself the form of government it believes most promotive of its own happiness,\" and that constitutions should not be deemed, \"too sacred to be touched.\" As Jefferson would have recognized, and as Klarman depicts in this captivating retelling of one of America's most famous stories, the Constitution is and has always been used as a tool to defend particular interests, and its sanctity should not go unchallenged.",
  "genres": [
    "History",
    "Politics",
    "American History",
    "Law",
    "Nonfiction",
    "American Revolution",
    "The United States Of America"
  ],
  "author": "Michael J. Klarman",
  "average_rating": "4.39",
  "url": "https://www.goodreads.com/book/show/29807130-the-framers-coup"
}