{
  "title": "The Bonfires of Beltane",
  "description": "It’s what the clan has always done. Since before anyone can remember, Taran’s celtic island people have sacrificed children to Crom Cruach, the dread sun god. Yet in his heart he knows it’s wrong. An escaped slave told him that in distant Britain they worship the One True God, a God who loves. A God so unlike the capricious, evil spirits that darken the souls of his people.Now Taran’s about to be inducted into his clan’s inner circle of leaders. He promised Laurna, his betrothed, that he’d keep quiet about his doubts. But on the night of his ceremony, beside Crom Cruach, the bent idol of gold, he cannot give allegiance to a lie. Before everyone he questions the druids’ rule. Then he blames the clan’s miserable fortunes, not on the lack of sacrifices, but on the idol itself. What’s worse, he calls it a demon.The druids are aghast. They meet in council, strip him of all honor, and order his banishment. Instead of a wedding with Laurna, there will be a tearful parting.As the clan gathers on shore and a storm darkens the horizon, Taran paddles through the waves. But his wee craft was made for the shoreline, not the vast, raging sea. He looks back on his beloved, his people, everything he’s ever known. What has he done?Thus begins Taran’s adventure in A.D. 432.Beyond the sea lies ancient Celtic Ireland. There wait the Roman evangelist, Patrick, and two kingdoms ruled by powerful kings and their pagan, druid advisors. It’s a proud land where tradition is everything, where safe passage through the forests and over the bog roads is reserved for nobility, druids, warriors, or bards. Slavery or death await the rest. And the druids will do anything to remain in power and prevent Patrick and his followers from changing their ancient ways.Will Taran find the spiritual truth he so desperately seeks? Will he escape wrathful kings and druid plots? Will he ever be able to return home, rescue his people, and rejoin his beloved Laurna?",
  "genres": [
    "Historical Fiction",
    "Christian",
    "Fiction",
    "Ireland",
    "Christian Fiction",
    "Historical"
  ],
  "author": "Mark E. Fisher",
  "average_rating": "4.25",
  "url": "https://www.goodreads.com/book/show/29806914-the-bonfires-of-beltane"
}