{
  "title": "For the Relief of Unbearable Urges",
  "description": "A work of stunning authority and imagination - a book that is as wondrous and joyful as it is wrenchingly sad, and that heralds the arrival of a profoundly gifted new storyteller.Already sold in eight countries around the world, these nine energized, irreverent stories from Nathan Englander introduce an astonishing new talent. In Englander's amazingly taut and ambitious \"The Twenty-seventh Man,\" a clerical error lands earnest, unpublished Pinchas Pelovits in prison with twenty-six writers slated for execution at Stalin's command, and in the grip of torture Pinchas composes a mini-masterpiece, which he recites in one glorious moment before author and audience are simultaneously annihilated. In \"The Gilgul of Park Avenue,\" a Protestant has a religious awakening in the back of a New York taxi. In the collection's hilarious title story, a Hasidic man incensed by his wife's interminable menstrual cycle gets a dispensation from his rabbi to see a prostitute. The stories in For the Relief of Unbearable Urges are powerfully inventive and often haunting, steeped in the weight of Jewish history and in the customs of Orthodox life. But it is in the largeness of their spirit-- a spirit that finds in doubt a doorway to faith, that sees in despair a chance for the heart to deepen--and in the wisdom that so prodigiously transcends the author's twenty-eight years, that these stories are truly remarkable. Nathan Englander envisions a group of Polish Jews herded toward a train bound for Auschwitz and in a deft imaginative twist turns them into acrobats tumbling out of harm's way; he takes an elderly wigmaker and makes her, for a single moment, beautiful. Again and again, Englander does what feels he finds, wherever he looks, a province beyond death's dominion.For the Relief of Unbearable Urges is a work of stunning authority and imagination--a book that is as wondrous and joyful as it is wrenchingly sad, and that heralds the arrival of a profoundly gifted new storyteller.",
  "genres": [
    "Short Stories",
    "Fiction",
    "Jewish",
    "Literature",
    "Judaism",
    "Literary Fiction",
    "Religion"
  ],
  "author": "Nathan Englander",
  "average_rating": "3.93",
  "url": "https://www.goodreads.com/book/show/29788.For_the_Relief_of_Unbearable_Urges"
}