{
  "title": "Alpha Marked Complete Series",
  "description": "All 6 Alpha Marked books in one volume!Thirty and single? Well, getcha butt to the Gathering!Mate Claimed - As a woman Marked to be the mate of an Alpha pair, she’s not going to find happiness anywhere other than in the arms of two Alpha werewolves. So, off she goes to the Gathering, with her sisters in tow, for some werewolf speed dating.Mate Seduced - Having a Mark on her arm means that Gabriella's one of the few human women destined to mate with not one, but two Alpha werewolves. Thank goodness werewolves don’t come in “ugly.”Mate Discovered - Whitney Wickham is at the darned annual werewolf Gathering all right. Only there’s one she doesn't have a scar and that's sorta necessary to mate an Alpha Pair. Unfortunately the gorgeous, drool worthy, magic-mojo-wielding Wardens don’t know why she’s been summoned to the Gathering any more than she does.Mate Hunted - Rebecca Twynham hates nature, loves a juicy steak, is not Marked, and thinks wolves come in one on four feet and with fur. So when she’s hauled to the annual werewolf Gathering by this scary as hell magical vortex, she’s pretty surprised to find out werewolves are real. Plus, she really wants to climb the gorgeous Alpha Pair, Aidan and Carson, like a tree.Mate Chased - At least Lorelei was kidnapped while she was at the gun range. Go Pink Pistol of Doom! So, they stole her, she stole a cell phone in return, and all is crazy in her new werewolf-laced world. It gets even crazier when, 1—she discovers her sisters have been kidnapped, too, and 2—werewolves are sexy as all get out. Lorelei is determined to come to her sisters’ rescue and well, see what Dylan and Zeke have to offer.Mate Saved - Paisley Twynham is over the whole werewolf thing. She's been kidnapped twice, had the crap beat out of her, managed to escape (twice), and then met two men who are supposed to be her mates. Yup, all kinds of “over” the Gathering.If you already own the books listed above, DO NOT purchase this book. There is NO new content in this boxed set/collection.",
  "genres": [],
  "author": "Celia Kyle",
  "average_rating": "4.26",
  "url": "https://www.goodreads.com/book/show/29806614-alpha-marked-complete-series"
}