{
  "title": "The Extra-Terrestrial Delivery",
  "description": "Nominated for the INTERNATIONAL DUBLIN LITERARY AWARD 2018!In this third episode of the 'Planet Hoola' Science Fiction Romance series, author Sudipta Das portrays vivid details of the ascent of the alien Hoo race, on a far away planet. In this work, the author has wonderfully combined the entire spectrum, from Physics to Metaphysics, and merged poetry into prose to intriguingly illustrate the Big Picture. His realisations are telling and connect easily.It is written in such a way that you do not require specialised knowledge of Science to enjoy its story. The surprisingly outlandish, yet detailed and vivid, plot of the captivating story-line simply transcends imagination.A celestial comet is horrendously hurled towards Hoola, on a direct collision course. The collision could potentially wipe out all life on the uniquely colourful planet, including the technologically advanced Hoos. The impending calamity notwithstanding, the Hoos find themselves faced with yet another predicament that creeps up from within themselves. Will the Hoos come around to overcome both the external and the internal obstacles that threaten their very existence? Or will they crumble under the weight of their own spectacular and vibrant, but often divisive, diversity?Meanwhile, silently blossoms love, finds expression in beautiful poetry. And selfishness soars to throttle love. Who will prevail, love or selfishness? As the events unfold, the fluidly portrayed characters play out their respective peculiar parts. The different aspects of the story eventually develop into a nail-biting spectacular dramatic climax that is befitting of a topnotch Hollywood movie. The anticlimax smoothly attenuates the vivid story-line. Surreal Poetry embedded in Sublime Prose, THE EXTRA-TERRESTRIAL DELIVERY by AUTHOR SUDIPTA DAS is much more than an action packed fascinating Fiction. The sheer scale of its expanse in space and time, from the bygone evolutionary past through the happening present to the vision for the future of an alien race, is huge. All these and more are encapsulated in the smooth form of a Science Fiction Romance that intriguingly illustrates the Big Picture. This book carries in its heart, and is potent to spread the seeds of, all-encompassing Harmony.",
  "genres": [],
  "author": "Sudipta   Das",
  "average_rating": "4.35",
  "url": "https://www.goodreads.com/book/show/29799923-the-extra-terrestrial-delivery"
}