{
  "title": "Poste restante",
  "description": "Les récits de voyage ont ceci de particulier qu’ils suscitent des réactions paradoxales. Pour le lecteur avide de découvertes et de dépaysement, les expériences vécues par un autre procurent à la fois plaisir et frustration, sympathie et envie. Les premières pages de Poste restante nous plongent immédiatement dans cet état d’esprit, dans cette fébrilité du départ vers l’inconnu. Nous sommes en 1976, le narrateur quitte Québec pour l’Europe avec, comme destination finale, l’Inde, où ses amis Bernard et François l’attendent dans la naissante et fascinante Auroville. À une époque où l’internet n’existe pas, où les appels téléphoniques sont incertains et où la poste demeure le seul moyen de rejoindre les siens, le voyageur vit un isolement que chaque page nous fait ressentir. C’est sans doute cette capacité à rendre compte très simplement de sa vulnérabilité, de son humilité même, qui fait de Louis Jolicoeur un auteur exceptionnel. Le voyage s’amorce à Londres, passe par la France, l’Allemagne, la Grèce, la Turl’Iran prérévolutionnaire et bien plus. En quelques phrases à peine Louis Jolicoeur nous a convaincus qu’il sera un compagnon de voyage sympathique, honnête, ouvert sur le monde, un peu naïf sans doute du haut de ses dix-neuf ans. Les rencontres se succèdent et on se prend à aimer avec lui les familles qui recueillent un jeune voyageur un soir de pluie, les vieilles dames qui l’hébergent et le dorlotent, les amis rencontrés au hasard des auberges de jeunesse, les restaurateurs généreux et les douaniers décontractés. Tranquillement, sans fioriture ni flafla, Louis Jolicoeur nous entraîne dans cette quête de l’Inde en solitaire, dans cette découverte de soi et des autres qui donne envie non pas seulement de partir, mais aussi de rêver. On ne peut s’empêcher de se demander si ce voyage au bout du monde et au bout de soi serait encore le même aujourd’hui, si le magnifique élan de la jeunesse des années 1970 ne s’est pas éteint pour laisser place au cynisme et à la lucidité précoce. À défaut de pouvoir tout laisser tomber pour suivre cet attachant voyageur, on pourra faire usage des technologies nouvelles pour (re)visiter à ses côtés et en quelques clics l’île de Crète, le King Trinity College de Cambridge, la place de la cathédrale d’Amiens ou les check points qui permettaient d’entrer et de sortir de Berlin. Poste restante n’évoque pas seulement la nostalgie d’un magnifique voyageur, d’un homme à l’humanité si généreuse, mais sans doute aussi le regret d’une époque fébrile où le monde était encore à refaire.",
  "genres": [],
  "author": "Louis Jolicoeur",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/29803383-poste-restante"
}