{
  "title": "Forced Submission Bundle 2",
  "description": "BONUS: Bundle includes never before seen epilogues for all three stories!  Taking What’s His  Driving a truck and hauling cargo from coast to coast can be lonely. Sly’s been looking for a pet to keep him company, and late one night on the side of the highway, he finds her.  Cameron is scared something bad is going to happen to her, but then he comes along, and she feels relieved. It isn’t until the door of his truck closes that the real fear takes root.  Sly has a new toy, and he’s having a hard time keeping his hands to himself. How long can he wait to take Cameron’s innocence? Because once he does, she’s his forever.  Taking What’s Wicked   On Halloween you’re supposed to dress up and have some naughty fun, but Sabrina’s costume has invited more wickedness than she expected. The guy at the bar seemed so nice until he got her out in the alley behind the bar and his friend joins in. That’s when she knew there was no escape.  Dante and Porter have been watching the little witch at the bar all night. They’ve decided to make her their toy for the evening, but she has no idea. They’ve been waiting for this moment, and now’s their chance.  This Halloween ménage is packed with filthy goodness and dark desire. Hold on to your broomsticks, and enjoy the ride!  Taking What’s Naughty  Damon, Remy, and Kellan have had their eyes on Leila from the day she started working at their law firm.  Leila’s been playing hard to get, and they’re not having it. It’s the night of the company Christmas party, and they’ve decided to take matters into their own hands.  Obsession has taken over, and forcing Leila to accept the three of them is the only way to get what they desire.  Warning: Obsession beyond control. These books contain situations involving forced submission and dubious consent. Nothing can stop them from having what they feel is theirs. These themes are triggers for some, but sweet candy for others. If you’re willing to hold off judgment until the last page, the ending is worth it, I promise.",
  "genres": [
    "Erotica",
    "Romance",
    "Contemporary",
    "BDSM",
    "Novella",
    "Dark",
    "Anthologies"
  ],
  "author": "Alexa Riley",
  "average_rating": "4.07",
  "url": "https://www.goodreads.com/book/show/29807198-forced-submission-bundle-2"
}