{
  "title": "Running Flat",
  "description": "If books can be digital, why not do new and interesting things only possible in digital format?Running Flat is a completed 75-chapter web novel combining story, art, music, poetry & web functionality to do things impossible to do on the printed page. www.runningflatnovel.comImmersed in the Story: Great writing immerses you in the world of the characters. Running Flat takes the next step. When the characters walk into a club where the Blue Method is playing, readers can literally hear the same music through the website the characters can hear in the story. When the characters are at an open mic, readers can hear the same poetry written and read by Pulitzer Prize winner Yusef Komunyakaa.Plus, the breathtaking photography of Tamara Ramos and the stunning illustration of Bethany Sellers brings you face to face with Jess, Maya, Jack, their circle of friends and those who would do them wrong. The Reader Shapes the Novel: On the website, you decide how to read the story. Each chapter will be sortable by character and plotline. So if you want to read only the parts of the story that have Amadeo D’Onofrio, the man who once beat a man to death with a bag of doorknobs, you can click on his name and read just about him. If you want to read only the story about two people falling in love, you can click on that and read just that part of the novel. If you want to read the whole thing, in chronological order, of course you can do that too.Synopsis:Jess Foley hasn’t given up on love, even if it has given up on her; Jack Baldwin has given up and is planning a graceful self-destruction; and Maya Hill is trying to escape her life working for Lito Avila and his team before it kills her. These friends struggle against the loss of love, overwhelming grief, and a man who once beat someone to death with a bag of doorknobs.",
  "genres": [],
  "author": "Eric Maywar",
  "average_rating": "4.80",
  "url": "https://www.goodreads.com/book/show/29806850-running-flat"
}