{
  "title": "A Bright Room Called Day",
  "description": "“One of the things that makes Kushner such a vibrant writer is the way he luxuriates in exuberance and sorrow, emotions that these intense Berliners have in spades. His intellectual characters are tremendously passionate and expressive, so it's hard not to care about what they care about, and what happens to them.” –Washington Post“A juggernaut of a play.” -San Francisco Weekly“Unabashedly political, thought-provoking, a little scary and frequently a good deal of theatrical fun… intoxicatingly visionary.” –Sid Smith, Chicago TribunePulitzer Prize-winning playwright Tony Kushner’s powerful portrayal of individual resolution, irresolution and dissolution in the face of political catastrophe, A Bright Room Called Day follows a group of artists and political activists struggling to preserve themselves in 1930s Berlin as the Weimar Republic surrenders to the seduction of fascism. Often exquisitely lyrical, always exhilaratingly intelligent, the poetic world of the play moves beyond the bounds of historical reality with the morally outraged outpourings of a contemporary New York woman. Her fury at the Reagan and British presidencies brings into stark relief the discomfiting similarities between then and now, and challenges us to remember that although evil may seem inevitable, it is never irresistible.Tony Kushner’s plays include Angels in America; Hydriotaphia, or the Death of Dr. Brown; The Illusion, adapted from the play by Pierre Cornelle; Slavs!; A Bright Room Called Day; Homebody/Kabul; Caroline, or Change, a musical with composer Jeanine Tesori; and The Intelligent Homosexual’s Guide to Capitalism and Socialism with a Key to the Scriptures. He wrote the screenplays for Mike Nichols’s film of Angels in America and for Steven Spielberg’s Munich and Lincoln. His books include The Art of Maurice Sendak: 1980 to the Present; Brundibar, with illustrations by Maurice Sendak; and Wrestling with Zion: Progressive Jewish-American Responses to the Israeli-Palestinian Conflict, co-edited with Alisa Solomon.Among many honors, Kushner is the recipient of a Pulitzer Prize, two Tony Awards, three Obie Awards, two Evening Standard Awards, an Olivier Award, an Emmy Award, two Oscar nominations, and the Steinberg Distinguished Playwright Award. He is a member of the American Academy of Arts and Letters. In 2012, he was awarded a National Medal of Arts by President Barack Obama. He lives in Manhattan with his husband, Mark Harris.",
  "genres": [
    "Plays",
    "Drama",
    "Fiction",
    "Theatre",
    "LGBT",
    "Historical Fiction",
    "College"
  ],
  "author": "Tony Kushner",
  "average_rating": "3.97",
  "url": "https://www.goodreads.com/book/show/298112.A_Bright_Room_Called_Day"
}