{
  "title": "The Extinction Cycle Series Box Set #1-3",
  "description": "For the first time ever get books 1-3 of the bestselling, award-winning, and top-rated Extinction Cycle. Over two hundred thousand copies sold and three thousand five star reviews on Amazon. \nContains Extinction Horizon, Extinction Edge, Extinction Age, and a special offer! \n_______________________________________________________________________ Book 1: Extinction Horizon The worst of nature and the worst of science will bring the human race to the brink of extinction...Master Sergeant Reed Beckham has led his Delta Force Team, codenamed Ghost, through every kind of hell imaginable and never lost a man. When a top secret Medical Corps research facility goes dark, Team Ghost is called in to face their deadliest enemy yet--a variant strain of Ebola that turns men into monsters.After barely escaping with his life, Beckham returns to Fort Bragg in the midst of a new type of war. The virus is already spreading... As cities fall, Team Ghost is ordered to keep CDC virologist Dr. Kate Lovato alive long enough to find a cure. What she uncovers will change everything.Total extinction is just on the horizon, but will the cure be worse than the virus?Book 2: Extinction Edge A new threat that will bring humanity to the edge of extinction...The dust from Dr. Kate Lovato's bioweapon has settled. Projections put death counts in the billions. Her weapon was supposed to be the endgame, but it turned a small percentage of those infected with the Hemorrhage Virus into something even worse.Survivors call them Variants. Irreversible epigenetic changes have transformed them into predators unlike any the human race has ever seen. And they are evolving.With the doomsday clock ticking, the fractured military plans Operation Liberty--a desperate mission designed to take back the cities and destroy the Variant threat. Master Sergeant Reed Beckham agrees to lead a strike team into New York City, but first he must return to Fort Bragg to search for the only family he has left.At Plum Island, Kate discovers Central Command may have considerably underestimated the Variant population in New York. As Operation Liberty draws closer, Kate warns Beckham that Team Ghost won't just face their deadliest adversary yet, they may be heading into a trap...Book 3: Extinction Age On the eve of extinction all seems to be lost, but there is still one final hope...Operation Liberty has failed. Humans are losing the war. With no other option, General Kennor decides to pull back the troops and give science a second chance.Trapped in the extensive sewer system beneath New York, Master Sergeant Reed Beckham and the survivors of 1st Platoon must battle through the tunnels--where they make a grisly discovery in their attempt to escape.At Plum Island, Dr. Kate Lovato is working on a new bioweapon to destroy the Variants. But when a derelict Navy Destroyer crashes into the Connecticut shoreline, she is forced to deal with a nightmare she thought had ended.As the doomsday clock ticks down and military bases fall across the country, the human race enters the age of extinction.",
  "genres": [
    "Audiobook",
    "Science Fiction",
    "Fiction",
    "Horror",
    "Post Apocalyptic",
    "Fantasy",
    "Science Fiction Fantasy"
  ],
  "author": "Nicholas Sansbury Smith",
  "average_rating": "4.28",
  "url": "https://www.goodreads.com/book/show/29841487-the-extinction-cycle-series-box-set-1-3"
}