{
  "title": "Tinselfish: The scripts from season one, Book 1",
  "description": "This novel is experimental fiction. The experiment is to determine whether the typical gay reader can read a novel written in a script format. Conventional wisdom says he can't; common sense says he can. (I read my first screenplay in 8th grade, how hard can it be?) If the typical reader automatically responds \"Oh I don't read scripts,\" he will miss out on a heartwarming story that is very funny in places and will prove the elite correct in thinking he's too dumb to understand scripts. If the typical reader does read the novel, positive reinforcement will reward him with an entertaining experience and an upgrade in his social status. The experiment has already begun. It isn't timed, so take your time and consider the options carefully.______Zeph's new in town. He finds a room in West Hollywood and shares the house with two ultrasleek gender illusionists who style themselves after classic movie goddesses Lauren Bacall and Rita Hayworth. A private investigator named O'Keefe stops by, and Zeph finds himself drawn into an investigation surrounding the disappearance of a porn-studio owner and one of his stars. The missing porn star is, not by coincidence, the boyfriend of one of Zeph's new housemates. Another investigation involves the drug-related murder of a club kid. O'Keefe is one of the suspects because he was the last person seen with the victim. A large, menacing drag queen, who took the rap for the murder of a dancer at a gay club in Miami, is now out on parole and is trying to track down her accomplice. She hires O'Keefe to find a \"lost love.\" The series continues in Book 2._____Duke University's Rare Book, Manuscript and Special Collections Library in 2008 included Tinselfish in its Drewey Wayne Gunn Collection of Gay Male Mysteries and Police Stories.The novel offers a look at gay West Hollywood in the early 00s. Cafes, bars, and club nights which no longer exist are mentioned and described.Book 1 includes a detailed, extensively researched account of a closeted Amish farmer's difficult coming-out process in Lancaster, Pennsylvania, in the 70s and 80s. It also includes a chapter which focuses on the gay scene in Philadelphia around Walnut and 13th in the late 80s.Both books extensively reference classic films noirs of the 40s and 50s and highlight the encrypted gay subtext of many of those films.Other chapters explore Hollywood history and examine Intolerance, Clara Bow, Busby Berkeley, and Sunset Blvd. and the different film technologies and styles prevalent in each era.\"A Preview of Season Two,\" an epilogue echoing the style of Arabian Nights in Book 2, weaves a story of near-future Baghdad and Cairo into the continuing present-day story in West Hollywood.Together, Books 1 and 2 feature 14 murders, 10 aggravated assaults, 18 sex scenes, 32 hot guys in their 20s, 14 chanteuse performances, 7 conversations about existentialism, 2 Amish weddings, a she-male call girl service, a sophisticated hacker, and a celebrity stalker.The reader will find Tinselfish an entertaining read, occasionally laugh-out-loud funny, but will also find it educational and enlightening in its exploration of different cultures, regions, time frames, topics, and genres.",
  "genres": [],
  "author": "John Evan Garvey",
  "average_rating": "0.00",
  "url": "https://www.goodreads.com/book/show/2983651-tinselfish"
}