{
  "title": "Persuasion",
  "description": "Persuasion, by Jane Austen, is part of the Barnes & Noble Classics series, which offers quality editions at affordable prices to the student and the general reader, including new scholarship, thoughtful design, and pages of carefully crafted extras. Here are some of the remarkable features of Barnes & Noble Classics:New introductions commissioned from today's top writers and scholarsBiographies of the authorsChronologies of contemporary historical, biographical, and cultural eventsFootnotes and endnotesSelective discussions of imitations, parodies, poems, books, plays, paintings, operas, statuary, and films inspired by the workComments by other famous authorsStudy questions to challenge the reader's viewpoints and expectationsBibliographies for further readingIndices & Glossaries, when appropriateAll editions are beautifully designed and are printed to superior specifications; some include illustrations of historical interest. Barnes & Noble Classics pulls together a constellation of influences—biographical, historical, and literary—to enrich each reader's understanding of these enduring works. In her final novel, as in her earlier ones, Jane Austen uses a love story to explore and gently satirize social pretensions and emotional confusion. Persuasion follows the romance of Anne Elliot and naval officer Frederick Wentworth. They were happily engaged until Anne’s friend, Lady Russell, persuaded her that Frederick was “unworthy.” Now, eight years later, Frederick returns, a wealthy captain in the navy, while Anne’s family teeters on the edge of bankruptcy. They still love each other, but their past mistakes threaten to keep them apart. Austen may seem to paint on a small canvas, but her characters contain the full range of human passion and moral complexity, and the author’s generous spirit renders them all with understanding, compassion, and humor.Susan Ostrov Weisser is a professor of English at Adelphi University, where she specializes in nineteenth-century literature and women’s studies. Weisser also wrote the introduction to the Barnes & Noble Classics edition of Jane Eyre.",
  "genres": [
    "Fiction",
    "Classics",
    "Historical Fiction",
    "Audiobook",
    "Historical",
    "Literature",
    "Book Club"
  ],
  "author": "Jane Austen",
  "average_rating": "4.15",
  "url": "https://www.goodreads.com/book/show/298150.Persuasion"
}