{
  "title": "Agnes Grey",
  "description": "An alternate cover edition can be found here.Drawing heavily from personal experience, Anne Brontë wrote Agnes Grey in an effort to represent the many 19th Century women who worked as governesses and suffered daily abuse as a result of their position.Having lost the family savings on risky investments, Richard Grey removes himself from family life and suffers a bout of depression. Feeling helpless and frustrated, his youngest daughter, Agnes, applies for a job as a governess to the children of a wealthy, upper-class, English family.Ecstatic at the thought that she has finally gained control and freedom over her own life, Agnes arrives at the Bloomfield mansion armed with confidence and purpose. The cruelty with which the family treat her however, slowly but surely strips the heroine of all dignity and belief in humanity.A tale of female bravery in the face of isolation and subjugation, Agnes Grey is a masterpiece claimed by Irish writer, George Moore, to be possessed of all the qualities and style of a Jane Austen title. Its simple prosaic style propels the narrative forward in a gentle yet rhythmic manner which continuously leaves the listener wanting to know more.Anne Brontë, the somewhat lesser known sister, was in fact the first to finish and publish Agnes Grey under the pseudonym of Acton Bell. Charlotte and Emily followed shortly after with Jane Eyre and Wuthering Heights.As Anne passed away from what is now known to be pulmonary tuberculosis at the age of just 29, she only published one further title; The Tenant of Wildfell Hall. As feminist in nature as Agnes Grey, Anne's brave voice resonates and permeates during one of the most prejudiced and patriarchal times of English history.",
  "genres": [
    "Classics",
    "Fiction",
    "Romance",
    "19th Century",
    "Victorian",
    "Historical Fiction",
    "Audiobook"
  ],
  "author": "Anne Brontë",
  "average_rating": "3.71",
  "url": "https://www.goodreads.com/book/show/298230.Agnes_Grey"
}