{
  "title": "Awakenings",
  "description": "ISBN-10: 1530368049 Alternate Cover EditionWhen the Oonocks sank their golden city of Atlantis beneath the ocean, only the words of Plato gave testimony of its existence. Now learn a new thought of who the Atlantians were and why they had to sink their city that eventful night. Find out why 6000 years ago, the race known as the Oonocks left their beautiful lilac waters of Jupiter's ice moon Europa to begin a new life on Earth. Discover the real Atlantians. Europa is a twenty year old human female who has never heard of the Oonocks. And although she's heard of the legend of Atlantis, she's never giving the story much thought. Her life has been fairly normal, as normal as any royal child's can be. The secret of who she really is has been kept from her, but she does know that she is of royal birth, the next leader of her people, that her great-great-great grandparents had to flee their country, which no longer exists, and that their enemy's descendants may still be hunting them. Therefore, she follows a strict set of security rules. Safe and happy, she lives on an isolated estate along the coast line in northern California. But her safety is an illusion, for their enemy has returned and is stalking the future queen, waiting for his chance to end her life. The day after her birthday, Europa's perfect word is destroyed when JeffRa assassinates her mother, thinking she was Europa. As she struggles to deal with her mother's death, Europa's world is turned upside down when she discovers a secret attic above her mother's bedroom. There, she finds picture of her parents hundreds of years old. But most terrifying of all is her mother's diary. Inside, Queen Medaron wrote that Europa would be born human and never know who she really was. Europa desperately searches for the answers as to who she is, as she flees before the assassin. Along the way, Europa will lose almost everyone and everything she loves. In order to survive she must find the queen inside her. She must learn and accept the true story of Atlantis and the Oonock race",
  "genres": [],
  "author": "P.R. Garcia",
  "average_rating": "3.89",
  "url": "https://www.goodreads.com/book/show/29837425-awakenings"
}