{
  "title": "Phantom of the Shroppie",
  "description": "Phantom of the Shroppie is a novel for those who love travel, history, romance and the notion that magic really can reside not just in the world around us, but within the human heart as well – even in those hearts so wearied by the track of life that hope has slipped away among the weeds.The book is about many things, among them love and lust, but Phantom of the Shroppie is not a typical romance. The story is told through the candid journals of four women who encounter a mysterious boatman in their journeys along the canals of England, especially the beautiful Shropshire Union Canal known by boaters and locals as \"the Shroppie.\" The boatman speaks at times as though he stepped out of the distant past, and his identity may be as shrouded with mist as the canal itself, but for one of the women who venture aboard his traditional narrowboat the temptation of his love proves too great.Excerpt:I was watching the canal intently by then, waiting for a bow to cut through the mist, from the south I figured, but it was hard to be sure with the fog playing its usual tricks with sound. Whatever was coming seemed to be whipping the mist up into a thick white wave that rose higher and higher until it rolled right over me, leaving sparkling drops in my hair and down along the cables of my cardigan.I stood up to brush them away and saw a darker shadow through the fog. Long and low, it stretched across the canal, not along it, and raised a tingle of anticipation in my chest. I think I must have been leaning forward, trying to figure out what it could possibly be, when the thumping sped up until it was obviously an engine revving hard as it swung the dark shape toward me. Nothing more than the bow of a black narrowboat, then – I let out the breath I’d been holding – and it was straight across from me in seconds, moving up the canal in the direction we would soon be travelling.I was straining to see the boat's name through the mist when my eyes were drawn to the tall figure standing at the tiller. He was wearing a boatman's cap and a dark sweater. His beard was darker still, but only when the fog thinned a little between us could I see his face. He was looking straight at me, as though he'd been watching my efforts to see him, and so intense was his gaze that I forgot to smile and wave when he lifted his cap a little and tipped his head my way. The gesture seemed to waft more of the mist away, and I saw the boat's name as the stern slipped past.“Phantom,” I whispered and felt a shiver pass through me.",
  "genres": [],
  "author": "Dawn Hammill",
  "average_rating": "4.88",
  "url": "https://www.goodreads.com/book/show/29826164-phantom-of-the-shroppie"
}