{
  "title": "Puck Bear Brides: Complete Series",
  "description": "These hockey bears are the furthest thing from ice cold...  A werebear is never complete without a mate and it has never been more true than with professional hockey bears, unleashed upon Shifter Grove on their path to claiming both victory and the women of their dreams. This box set follows a professional shifter hockey team as they fight through an endless series of challenges to both the title they desire as well as the curvy women destined to love them. If you want your bears hard, fast and ruthless and your heroines lush, loving and sassy, then don't miss out on this series of novellas!  Grab all four here for a discounted price of 4.99!  A Bear Victory  Cannon Wright's an irredeemable bad boy hockey star, or that's at least what the tabloids know. The star of the Chicago Bluehawks, the werebear playmaker has been living a life of adrenaline and victory for years now, but something's always been missing. There's only one thing that could make him happy - his mate. Good thing is, he already knows who she is. Bad thing is, she hates his guts.  Bear No Loss  Memphis Corley doesn't take anything for granted. So when he meets the most breathtaking woman he's ever known on an away game, this hockey bear knows he's going to have to fight to get his woman. Turning a one night stand into something lasting isn't so easy though, especially when there's someone constantly plotting against him, but this bear never loses and he doesn't intend to start now.  A Bear Goal  Heath Locklear's been a bad boy puck bear all his life and he doesn't intend to stop. But when one sassy as hell woman gives him a piece of her mind, he can't seem to get her out of his mind anymore and no one else will do. Hated by the team she roots for, Heath has to not only escape his wild reputation, but break through all the people who don't want him anywhere around the woman who might just be his mate. With a goal in sight, he can't stop...  Bear No Defeat  Jax Darmuth is everything his father didn't want him to be. The son of a billionaire, he chose a life of hockey and never looked back, but when his father becomes gravely ill, the polar bear shifter agrees to give his father one last thing. Marriage to the woman of his father's choosing. With an arranged marriage looming in the horizon, Jax is ill-prepared to actually find himself falling for the woman chosen for him. And when she makes a run for it, he will stop at nothing to get her back...",
  "genres": [
    "Sports"
  ],
  "author": "Anya Nowlan",
  "average_rating": "4.34",
  "url": "https://www.goodreads.com/book/show/29853453-puck-bear-brides"
}