{
  "title": "Lord Sinister",
  "description": "Abandoned and Alone… Amelia Jamison has lost everything.  She has no home, no money, and no way of taking care of her son.  Ten years ago, however, she had a wealthy family, many friends, and prominent young men wishing to court her.  Then she met Lord Julian Westland, Marquess of Amersleigh, who ruined her life.  She promptly fled England, abandoned and alone.  Now, to keep her son and herself from starving, she must accept the governess position offered to her.  That means returning to England.  Yet, fate yields another crushing blow, and Amelia is thrown back into the path of the very man she had never hoped to see again.   A Shocking Secret… Julian is surprised to see Amelia after ten years.  But when he catches sight of her son, he is shocked down to his core.  There’s no question Alex’s wavy dark hair and dove-gray eyes are an exact replica of his own.  That means Amelia’s cousin had lied to him all those years ago.  As his guilt soars, Julian will do whatever it takes to convince Amelia to accept his help.  The stubborn woman refuses all offers of assistance and forces him to take drastic steps.   Her Only Option… Just as Amelia begins to know happiness for the first time in many years, every dark secret comes to light, every lie is revealed, and the truth threatens her fragile new life.  Then her world comes crashing down when Julian is shot.  To save his life and the life of her son, Amelia must disappear once again.  This time, she can never come back.Lord Sinister is Book 3 of the Secrets & Scandals series.  Book 1, Innocence Lost, and Book 2, Duchess Beware, are currently available.  This series will continue with Book 4, Lord Black Heart, and Book 5, Lord Rogue, future releases.  If you would like to be informed about future releases and other exciting news, you are welcome to join Tiffany Green's mailing list at http://eepurl.com/buBnhj.  You may also wish to visit her website at: tiffanygreen.net.  Happy reading!",
  "genres": [
    "Historical",
    "Regency",
    "Second Chance"
  ],
  "author": "Tiffany Green",
  "average_rating": "4.14",
  "url": "https://www.goodreads.com/book/show/29846974-lord-sinister"
}