{
  "title": "Forever Girl",
  "description": "At sixteen Lyric has led a life of solitude. She’s never been shown love or affection by the one person that should love her more than anything or anyone, her mother. Everything changes for Lyric when Twins Dean and Delia (Nic) move in next door. Lyric comes out of her shell and falls in love with Dean. Dean and Nic leave in the middle of the day while Lyric’s at work. They disappear without a trace. Not long after the twins leave Lyric finds out she’s pregnant with twins of her own. She makes a vow to be a better mother to her children than her mother was to her. She leaves home at seventeen and a senior in high school to make it in the world on her own. Six years later Nic is taking over a Pediatric Practice. While meeting her patients and their parents Nic walks into an exam room to find Lyric and the twins waiting to be seen. Lyric and the twins’ lives change in the matter of seconds. Titan (Dean) left the girl that became his world six years ago. He fled to Harlan, Kentucky to do what he loved. He has made a name for himself in the Coal Mining Industry as well as being a member of the Bloody Harlan Saints Motorcycle Club. He has spent his time finishing school, building his company and partying hard. His life is about to change with one phone call. Titan and Lyric see each other again after all these years. The intense connection they share is still there. Lyric has to do what is best for her and her children. Dean has to prove that he is the man she needs him to be. Follow them on their journey. There are unexpected events that happen as well as truths and lies come to light. Wrongs made right and some twist and turns that will keep you on the edge of your seat and turning the page to find out what happens next.",
  "genres": [
    "Contemporary",
    "Second Chance",
    "Romance",
    "BDSM",
    "Motorcycle"
  ],
  "author": "M.M. Crow",
  "average_rating": "3.52",
  "url": "https://www.goodreads.com/book/show/29850947-forever-girl"
}