{
  "title": "Nebular Collection 1 - The Triton Base",
  "description": "NEBULAR, takes us into the year 2113 – a time when nationalistic interests and blind patriotism are things of the past. The scourge of international wars is no longer a threat. By combining resources and knowledge, Humanity has almost conquered disease and poverty. United as the Solar Union, Humanity faces the challenges of the last unknown realm – space! Thriving colonies on the Moon and Mars are part of everyday life. Around ten billion people live on Earth while two hundred and fifty million have settled in the Moon and Mars colonies. Scientific outposts are being established and operated on the moons of the gigantic outer planets. Human explorers have already encountered the ice deserts on Jupiter’s moon Europa, the dusty storms on Mars and the primeval hydro-carbon oceans on Titan. Prospectors search for crucial natural resources in the asteroid belts and manned spaceships fly not only between the planets but also to the outer edges of the solar system to further the reach of exploration. Humanity’s most distant outpost is on Neptune’s moon Triton, an ice-cold world, where scientists and private mining companies are braving the harsh conditions. About 2000 men and women of the Solar Union are part of the contingent, accepting a life of solitude, far away from home. They are exploring the outer regions of the solar system to find much needed raw materials for Earth and her colonies. Astrophysicists utilize the unique local undisturbed gravitational conditions on Triton, aligning the large antenna arrays of the new SETI project onto nearby stars. However, Humanity has not yet found alien life forms. Establishing contact with fellow alien civilizations is one of the greatest remaining objectives of these times. Unconsciously, most Humans hope these foreign cultures will be similar and that Humanity will be able to learn from these beings in a peaceful exchange of information. However, so far the SETI installation on Triton has been unsuccessful to intercept signals from an intelligent origin. It is as if alien civilizations don’t want to communicate with Humanity – but that doesn’t mean these aliens don’t exist … and haven’t been listening … and watching Humanity all along!",
  "genres": [
    "Science Fiction"
  ],
  "author": "Thomas Rabenstein",
  "average_rating": "4.15",
  "url": "https://www.goodreads.com/book/show/29851648-nebular-collection-1---the-triton-base"
}