{
  "title": "A Little Band of Red",
  "description": "Polly Jayne Lester’s life was falling apart. Between her cheating fiancé and her narcissistic boss, she could see no way out. That was until an unexpected lottery win changed everything. With millions in her bank account, PJ abandons her old life to start a new one in London. It’s there she finds her dream home on the banks of the Thames, and also her dream man—in a bondage club. But it’s the other man, watching from the shadows, who will ultimately claim her heart.Luke Monroe is tired of playing a role that has left him emotionally void and completely alone. For the past fourteen years, all he has known is sadism and control. But on the night he decides to walk away from everything, he sees her, in the club—the one woman that could change everything. The only problem is, she’s on her knees submitting to another man.Refusing to give up his last chance at finding happiness, Luke bides his time: waiting, plotting. Filled with trepidation and excitement, PJ returns to Bond Street, only to find herself at the mercy of a stranger. Master Luke is a fantasy, dominant and sexy, charismatic and passionate. Yet the illusion he so effortlessly created for her is shattered when she discovers he’s a sadist, known for his cold-hearted brutality. PJ flees. But when a phone call has her returning to the club, he’s waiting—her beautiful, blue-eyed nightmare. Luke is relentless as he charms his way back into her life. But why? PJ is not a masochist. She can see no future for them. Yet despite their irreconcilable differences, neither of them can deny the attraction that first brought them together. The question is, how much should love hurt?A Little Band of Red—A contemporary erotic, BDSM novel.94,000 words",
  "genres": [
    "BDSM",
    "Erotica",
    "Romance",
    "Contemporary Romance",
    "Contemporary",
    "Dark",
    "Adult"
  ],
  "author": "Lily Freeman",
  "average_rating": "4.27",
  "url": "https://www.goodreads.com/book/show/29854933-a-little-band-of-red"
}