{
  "title": "Toxicity: A Dystopian Thriller Novel",
  "description": "In the tradition of The Stand, The Man in the High Castle, and The Road, comes an epic story of struggle against tyranny in a future America....  The year is 2141. Islam controls most of the civilized world, including all that exists of the former United States. Climate change has made fresh drinking water a scarce, and valuable, commodity. Islamic states that once controlled the oil now control the largest fresh water deposit in the world, the American Great Lakes.  Washington D.C. and New York City are mere memories of the old world, as a new regime of Caliphs has ruled the eastern half of the country for the past century. The barren ‘no man’s land’ east of the Mississippi River is but an encroaching desert, and the realm of the Great Lakes—known as Al-hayat Miyaah—dictates life for the rest of the realm.  Jihadic allegiance and the Lakes’ bounty decide a person’s worth, where clean, drinkable water is far more precious than gold… and more valuable than the lives of infidels.  Aligned with a much smaller Muslim nation in Kentucky, the Caliphate seeks to steadily eradicate the less privileged southern states, collectively known as the Southern Lowlands. Forever viewed as the scourge of the new America, or Amreeka, the Fourth Caliph of the Bashir dynasty, Abdul-Muttalib Bashir, moves to cut off the Mississippi River’s flow to the south, as part of the Caliphate’s Centennial Celebration. The enormous dam at Cairo, Illinois was created for this very purpose. The perpetual hardships facing townships in Mississippi, Tennessee, and Alabama now worsens dramatically.  In this hostile environment, Joaquin Martinez and six others risk certain death, as fugitives crossing state lines to reclaim loved ones stolen from Hernando, Mississippi, and sold into slavery in Detroit. At the same time, survivalist Malcolm Foster and his daughter Renee begin a journey to Kentucky with other survivalists hoping to strike a blow to the Muslim empire. Lastly, in the heart of Al-hayat Miyaah, the youngest son of the Caliph, Abdul-Bari, sets out on a quest to determine the truth about infidels… their worthiness of scorn and indiscriminate death.  Much is at stake for them all, as a crossing of paths determines who inevitably is destined to win… and who must lose everything.   ****Disclaimer: The book is not a religious condemnation, although it supports none of them. The story is about the wickedness of human nature—a treatise, if you will, about mankind’s desire to subjugate others—especially when bad men are in control of that power.",
  "genres": [
    "Dystopia"
  ],
  "author": "Fiona Fraser",
  "average_rating": "4.11",
  "url": "https://www.goodreads.com/book/show/29850119-toxicity"
}