{
  "title": "Tail Gunner",
  "description": "‘One of the outstanding books of the war’ - Sunday Express This gripping story of one man’s involvement in RAF Bomber Command’s fledgling offensive was first published in 1943. Written only months after the events described, R. C. Rivaz provides a uniquely fresh and immediate perspective on some of the most harrowing episodes of the war. He was tail gunner to Leonard Cheshire, one of the most famous RAF pilots of the Second World War and flew in Whitleys with 102 Squadron and Halifaxes with 35 Squadron. Rivaz describes his experiences of night bombing attacks against heavily defended enemy targets like Duisburg, Dusseldorf and Essen, recording in captivating detail the sights and sounds of these dangerous night time raids. But he describes equally well the colour pallet of the setting sun from fifteen thousand feet, and his turbulent mind set as he prepares for each death defying mission. He relates a dramatic shoot-out with German fighters over La Rochelle in broad daylight and describes his near-death encounters with cool but honest detail. Rivaz also describes two agonizing crashes over the sea, one occasion of which he waits near frozen for seven hours, buffeted by stormy weather in a rubber dinghy. Tail Gunner is not only unrivalled in its immediacy and insight, but gripping and eminently readable. Richard Rivaz was born in Assam on 15th March 1908, son of a colonial official in the Indian Civil Service. He later returned to England and studied painting at the Royal College of Art. He became an accomplished artist in the 1930s, before training as a teacher and taking up an appointment at Collyer’s School in Sussex, where he taught art. Rivaz volunteered for pilot training in 1940 but was bitterly disappointed to learn that, at the age of thirty-two, he was too old to become a pilot. He commenced training as an air-gunner and saw first service with No. 102 Squadron. He survived many dangerous raids and crashes but was unfortunately killed at the end of the war, when his transport aircraft caught fire on take off from Brussels airport on 13 October 1945.",
  "genres": [
    "Nonfiction",
    "History",
    "World War II",
    "Military History",
    "Memoir",
    "Aviation"
  ],
  "author": "Richard C. Rivaz",
  "average_rating": "3.91",
  "url": "https://www.goodreads.com/book/show/29850537-tail-gunner"
}