{
  "title": "Jericho",
  "description": "Unexpectedly, Abe finds herself thrust alone into the world after escaping too many years kept in stasis – her aristocratic mother’s notion of keeping her daughter safe and pure. Now grown up and with little experience, Abe finds the world mysterious and fascinating, but also confusing and challenging. Even more so when she takes a whack to her head and briefly loses her memory only to be found by Jericho, a Jinn warrior, who is inexplicably drawn by her. All too soon, Jericho realizes he has plans for Abe and yet he is also at war with himself about snap decisions he’s making when it comes to this beautiful female - who dropped a bomb on him with her arrival in his life. By a simple tilt to her chin, she dares him to deny what she wants when she wants it. Not used to handling a strong female who knows what she wants – throws Jericho off balance. A powerful Jinn, he’s not used to the way Abe pushes him at every turn. All too soon, he realizes that no way is she easily malleable and somewhat pliable – as he wrongly assumed. Jericho learns fast that it isn’t about him, it’s about Abe, what she wants, how she wants it and to hell with the why. Sexual tension between them is irresistibly palpable. Jericho’s fantasies are all about him using his considerable skill to seduce her to his way of thinking so they can drop to the floor – any floor - and have raw sex. Yeah, he wants to work that angle. Except, Abe is tested in ways never expected – evil and violence threaten her first taste of true freedom, bringing Jericho to a hard, infallible conclusion. Will Abe succeed in a world she knows so very little about? Can she cope with having Jericho Sullivan - her ideal Fantasy 101 male – so close and not give in to what her mind and body crave? Will she ever be truly free?",
  "genres": [
    "Paranormal Romance"
  ],
  "author": "Nini Church",
  "average_rating": "4.25",
  "url": "https://www.goodreads.com/book/show/29851927-jericho"
}