{
  "title": "Forever and a Night",
  "description": "Nathan Davenport is being stalked by Isabella Ravini, the feral vampire who stole his human life over a hundred and sixty years ago. She made him her fledging, a slave for her dark, evil purposes—hunting humans. After a few years she released him, and Nathan reluctantly learned to accept the cursed life she’d foisted upon him. Over time he amassed a great fortune, which today has made him famous worldwide. Isabella decides she wants to be a part of this world of fame and fortune Nathan created for himself. She’s determined to marry him, and love has nothing to do with it. His money is her primary target, and the fame and prestige attached to being the wife of one of the richest men in the world wouldn’t be so bad either. In an effort to evade her until he can figure out how to stop her, he hides at a safe house he owns in New Orleans. One Saturday evening in NOLA, he decides to have dinner in the city. He chooses a quiet little Italian bistro, never imagining this night will change his life forever. The human woman who delivers his order isn’t a server, but the restaurant’s sous chef, a beautiful ethnic woman possessing the most delicious blood scent he’s ever encountered.The moment Mia Peebles arrives at his table with his plate, tasting her becomes an obsession. Mia wants nothing to do with him because of Nathan’s reputation as a playboy. So Nathan enchants her, feeds from her, but his lusts for her blood and body play havoc with his thinking.Nathan finds a way to bring her into his life as his personal chef and quickly falls in love with her. The trouble is Mia has no idea he’s a vampire because during the enchanting episodes, Nathan blocked her memories of those sensual encounters.How will Nathan tell her the truth without losing her and keep Isabella from finding him? Or worst yet, will Isabella discover how much Mia has come to mean to him?",
  "genres": [
    "Vampires",
    "Paranormal",
    "Romance",
    "Paranormal Romance"
  ],
  "author": "Lana Campbell",
  "average_rating": "4.59",
  "url": "https://www.goodreads.com/book/show/29844991-forever-and-a-night"
}