{
  "title": "The Crying Pennant",
  "description": "King Arthur, the conceited battle chieftain of legend, and his trusty Man-at-Arms Biggs, who resents his king and friend, encounter a dwarf through a mistake. Together they meet an effeminate elf, a Chinese children's entertainer, a monk of the short order and a Fully armoured war horse then accept a mission to rescue two princesses from a D'ark Lord, defeat him and slay a dragon. This would be quite straight forward if the pompous king and his band of chums took things seriously, which they don't! Be prepared for fun and silliness in this fantasy/science fiction novel, the first in the Arth Series.A Sample“Biggs, why have you come to this gloomy and dismal place, it is rumoured to be the haunt of dark and dire monsters,” Arthur quipped. “Stop quipping Arthur, you’re getting on my nerves,” muttered Biggs. “Well if you stopped muttering maybe I wouldn’t have to quip!” quipped Arthur again as he sidled up to Biggs. “That’s it, I can’t stand it when you sidle. Look at that you’ve sidled right up to my side. You side sidler you,” Biggs retorted to Arthur’s quipping and sidling. “You’ve got about as much courage in this place as a hypochondriac hamster, you filibustering philanthropist,” Arthur again quipped forcefully. “Stop getting verbose with me or I’ll take your quip off you,” Biggs parried, thrusted and came to rest upon a metaphor. “Just what kind of English do you think that is,” said Arthur, talking this time to the author. I did not wish to answer my creation so I continued typing, hoping that the latter could be as good as the former. “He’s just pig ignorant,” suggested Biggs, I resenting it as, even now, I typed it. “That fellow on the word processor has put us into this dark and dismal place and I don’t like it,” blubbed Biggs with a kind of big blubbing noise. I decided to speak up, “Look you two, I’m in charge of this book so just do what I type!” (I thought that would tell them.) “Of course you know we can read Mr. Author sir, so we know what you think on paper,” whined Arthur.     “Well he’s left a few lines free so maybe he’s not going to interject in our lives anymore,” Biggs said. Then Arthur said, “Okay then Biggs, let’s explore this dark and dismal place, have you got the lantern?” “Of course I’ve got the lantern,” Biggs struck the flint against the stone. “I wouldn’t strike the flint against the stone, my character just wouldn’t do such a silly thing,” said Biggs in a self righteous tone. “Don’t get all self righteous on us now Biggs. Just light the lamp in a common sense sort of way.” So in a common sense sort of way Biggs lit the lamp. “It’s dark.” “I know it’s dark.” “Even with the light on it’s dark.” A pause. “I’m getting muddled up with who’s spaking.” “Who’s spaking,” quibbled Biggs, “can’t you spell correctly Author?” “Correctly,” I typed. “That’s it Mr. Author sir, if you don’t stop trying to be funny I’m going to make a complaint to the funny characters union.” “Sorry,” I said.",
  "genres": [],
  "author": "Stephen Jennison-Smith",
  "average_rating": "4.60",
  "url": "https://www.goodreads.com/book/show/11858100-the-crying-pennant"
}