{
  "title": "L'uomo dal fiore in bocca",
  "description": "L'Uomo dal fiore in bocca L'uomo dal fiore in bocca è un atto unico di Luigi Pirandello, esempio di dramma borghese nel quale convergono i temi dell'incomunicabilità e della relatività della realtà. Fu rappresentato per la prima volta il 24 febbraio del 1922 al Teatro Manzoni di Milano. È un colloquio fra un uomo che si sa condannato a morire fra breve, e per questo medita sulla vita con urgenza appassionata, e uno come tanti, che vive un'esistenza convenzionale, senza porsi il problema della morte. Pirandello, anche in questo caso, trasse il testo teatrale da una novella scritta anni prima e intitolata La morte addosso. Il protagonista è un uomo malato di tumore (il fiore in bocca) e prossimo alla morte; questa sua situazione lo spinge a indagare nel mistero della vita e a tentare di penetrarne l'essenza. Per chi, come lui, sa che la morte è vicina, tutti i particolari e le cose, insignificanti agli occhi altrui, assumono un valore e una collocazione diversa. L'altro personaggio è un avventore del caffè della stazione, dove si svolge tutta la scena; un uomo qualsiasi, che la monotonia e la banalità della vita quotidiana hanno reso scialbo, piatto e vuoto a tal punto che il dialogo tra lui e il protagonista finisce col diventare un monologo, quando quest'ultimo gli rivela il suo terribile segreto. « Venga... le faccio vedere una cosa... Guardi, qua, sotto questo baffo... qua, vede che bel tubero violaceo? Sa come si chiama questo? Ah, un nome dolcissimo... più dolce d'una - Epitelioma, si chiama. Pronunzii, sentirà che epitelioma... La morte, capisce? è passata. M’ha ficcato questo fiore in bocca, e m’ha – «Tientelo, ripasserò fra otto o dieci mesi!» » La morte prevista e la morte imprevista. La vita non ha nessun valore in sé, ma quando l'individuo - sulla strada della morte - la osserva, anche i gesti quotidiani insignificanti acquistato un valore vitale. Immaginarsi simile alla stoffa significa affidarsi a cose che sembrano eterne. La vita non si conosce, però si sente il bisogno di viverla e a disprezzarla quando la morte è prevista, in modo da potersene andare con meno dolore.",
  "genres": [
    "Plays",
    "Italian Literature",
    "Theatre",
    "Classics",
    "20th Century",
    "Drama",
    "Nobel Prize"
  ],
  "author": "Luigi Pirandello",
  "average_rating": "4.13",
  "url": "https://www.goodreads.com/book/show/11858172-l-uomo-dal-fiore-in-bocca"
}