{
  "title": "In Another Country",
  "description": "The short story is about an ambulance corps member in Milan during World War I. Although unnamed, he is assumed to be Nick Adams, a character Hemingway made to represent himself. He has an injured knee and visits a hospital daily for rehabilitation. There the \"machines\" are used to speed the healing, with the doctors making much of the miraculous new technology. They show pictures to the wounded of injuries like theirs healed by the machines, but the war-hardened soldiers are portrayed as skeptical, and perhaps justifiably so.As the narrator walks through the streets with fellow soldiers, the townspeople hate them openly because they are officers. Their oasis from this treatment is Cafe Cova, where the waitresses are very patriotic.When the fellow soldiers admire the protagonist's medal, they learn that he is American, ipso facto not having to face the same struggles in order to achieve the medal, and no longer view him as an equal, but still recognize him as a friend against the outsiders. The protagonist accepts this, since he feels that they have done far more to earn their medals than he has. Later on, a major who is friends with the narrator, in an angry fit tells Nick he should get married but that his hopes and dreams will always be dashed, it being only a way to set one up for hurt. It is later revealed that the major's wife had suddenly and unexpectedly died of pneumonia. The major is depicted as far more grievously wounded, with a hand withered to the size of a baby's hand, and Hemingway memorably describes the withered hand being manipulated by a machine which the major dismisses as a \"damn thing.\" But the major seems even more deeply wounded by the loss of his wife.",
  "genres": [
    "Short Stories",
    "Classics",
    "Fiction",
    "Historical Fiction",
    "Read For School",
    "School",
    "War"
  ],
  "author": "Ernest Hemingway",
  "average_rating": "3.47",
  "url": "https://www.goodreads.com/book/show/11859107-in-another-country"
}