{
  "title": "The Fiduciary Delusion",
  "description": "“Rather than justice for all, we are evolving into a system of justice for those who can afford it. We have banks that are not only too big to fail, but too big to be held accountable.” -Joseph E. Stiglitz, Economist, winner of the Nobel Prize. A man's slow and terrifying ride into psychosis and his accidental discovery of a dastardly conspiracy to implode the world's financial system as a last ditch solution to consolidate power, come together in a character driven, mind warping novel of suspense and intrigue. Seen through the lenses of two main characters, life's intriguing themes of karma, breach of trust, false ambition, and the power paradox are thoroughly explored and provide the reader a psychological crime thriller with depth and plenty of food for thought. Kyle Pickens, a smart but laid back bounder and Jeremy Hughes, a sensible, academically focused introvert, surprisingly become best friends growing up in a lackluster suburban 1980s San Diego neighborhood. After a love triangle gone bad, they become estranged. Kyle's biggest success is writing a crime fiction story with the help of his Uncle Doug Gervais, V.P. of the Federal Reserve. He becomes a feature writer, but gets disillusioned. He spirals into depression, drugs, and is near death, but finds himself, goes to university, and meets up with his old friend Jeremy Hughes. They make amends. Kyle decides to go on an overseas adventure before opening up a brewpub in California. Although his family urge him to stay and commit to the project, his yearning and impetuous nature compels him to travel. In India: Kyle falls into states of intermittent psychotic delusions. He finds some files at a conference in Mumbai that confirm his deceptions about an economic conspiracy he's uncovered that will destroy the world as we know it. Can he get this information to his Uncle Doug at the Fed? Or, is his Uncle involved? Who are these strange men who keep following him? Who knows what? And how deep does this economic conspiracy go? Kyle is being pursued in reality and in his delusional mind. Is he using drugs again? Is he insane? Or is he really onto the most dastardly conspiracies of all time? Kyle seems to know so much inside information about the plot, but how? Kyle is eventually kidnapped by terrorists and pursued by Nikita Patel, a beautiful Indian intelligence agent who believes he's innocent... Yet, against all odds, only love and a true friend's faith can save both Kyle and the civilized world as we know it from the abusive power of evil.",
  "genres": [],
  "author": "John Molik",
  "average_rating": "4.67",
  "url": "https://www.goodreads.com/book/show/29866402-the-fiduciary-delusion"
}