{
  "title": "A SEAL's Pledge",
  "description": "NAVY SEALS WANTED: Join a planned eco-community. Must be knowledgeable about sustainability, committed to the goals of our organization, comfortable with being filmed for a reality television show documenting our progress-and willing to marry within the year. Wives provided for those lacking them.When Navy SEAL sniper Harris \"Hawk\" Wentworth stumbles on the ad calling for participants in a new sustainable community and TV show, he can't wait to join Base Camp in Chance Creek, Montana, and get started building a new future. After a lifetime of living on the fringes, always on the lookout for danger, he's ready to hang up his rifle and finally relax. And if someone else is willing to find him a bride, he's all for it. He's always been more at home behind enemy lines than talking to women. He can't wait to meet his wife to be. But it's not his turn yet. BACKUP BRIDE NEEDED: Are you female, single, between twenty-five and thirty-five years of age? Looking for a husband? Think you've got what it takes to join Base Camp? Follow the link below to apply now. Samantha Smith is willing to do anything to escape her long time job driving the tour bus for the band her parents and sister play for. She's ready for marriage, a settled home-and motherhood. And she wants them all right now. She knows she could be happy at Base Camp, so when an episode of the reality television series ends with a call for a backup bride for one of the participants, Sam applies for the position-no questions asked. She's ready for whatever adventure awaits her. So when Harris picks her up at the airport instead of Curtis Lloyd, the man she was told she was meant to marry, Sam assumes Harris is Curtis' replacement--and if she's honest she's relieved. The quiet, sexy sniper always caught her eye when he appeared on the show, and in person he's everything Sam's ever wished for in a husband. Harris has to make a choice, fast. Correct the mistake Sam's made about why he's picking her up at the airport--or elope with Curtis' bride. What's a Navy SEAL to do?",
  "genres": [
    "Romance",
    "Military Fiction",
    "Contemporary",
    "Contemporary Romance",
    "Military Romance",
    "Family",
    "Audiobook"
  ],
  "author": "Cora Seton",
  "average_rating": "4.45",
  "url": "https://www.goodreads.com/book/show/29859209-a-seal-s-pledge"
}