{
  "title": "High Couch of Silistra",
  "description": "One woman's mythic search for self-realization in a distant tomorrow...Her sensuality was at the core of her world, her quest beyond the civilized stars.Aristocrat. Outcast. Picara. Slave. Ruler.\"Engrossing characters in a marvelous adventure.\" - Charles N. Brown, Locus Magazine\"The amazing and erotic adventures of the most beautiful courtesan in tomorrow's universe\" - Frederik Pohl FOR ADVENTUROUS READERS ONLY\"Long ago the human colonists of Silistra waged a war so vicious that centuries later the planet has not recovered. Men and women alike suffer from infertility -- the deadliest legacy of that deadly war. Because the birth rate is so low, the Silistrans value above all the ability to bear children . . . and their social order is based on their fertility and sexual prowess.\"On a planet desperate for population, women hold the keys to power. These are the adventures of Estri, Well-Keepress of Astria and holder of the ultimate seat of control: the High Couch of Silistra.\" -- Jim Baen, publisher, Baen Books. \"The best single example of prostitution used in fantasy is Janet Morris' Silistra series... Estri's character is most like that of Ishtar who describes herself as \"'a prostitute compassionate am I'\" because she \"symbolizes the creative submission to the demands of instinct, to the chaos of nature ...the free woman, as opposed to the domesticated woman\". Linking Estri with these lunar and water symbols is not difficult because of the moon's eternal virginity (the strength of integrity) links with her changeability (the prostitute's switching of lovers). [...] Morris strengthens the moon imagery by having Estri as a well-keepress because wells, fountains, and the moon as the orb which controls water have long been associated with fertility, [...] In a sense, she is like the moon because she is apparently eternal, never waxing or waning except in her pursuit of the quest; she is the prototypical wanderer like the moon and Ishtar. She is the eternal night symbol of the moon in opposition to the Day-Keepers [...] At her majority (her three hundredth birthday), she is given a silver-cubed hologram letter from her mother, containing a videotape of her conception by the savage bronzed barbarian god from another world. [...] If Estri's mother then acts as a bawd, willing her lineage as Well-Keepress to her daughter, then Estri's great-grandmother Astria as foundress of the Well becomes a further mother-bawd figure when she offers her prophetic advice in her letter: \"Guard Astria for you may lose it, and more. Beware of one who is not as he seems. Stray not in the port city of Baniev ...",
  "genres": [
    "Fantasy",
    "Science Fiction",
    "Fiction",
    "Science Fiction Fantasy",
    "Post Apocalyptic",
    "Erotica",
    "Dystopia"
  ],
  "author": "Janet E. Morris",
  "average_rating": "3.58",
  "url": "https://www.goodreads.com/book/show/29866740-high-couch-of-silistra"
}