{
  "title": "I Can Hear You",
  "description": "Amber has always known she was different. From an early age, she could hear the thoughts of those around her. Once she realized that she was different from everyone around her, she tried to conceal her gift. This led to a life of isolation, being unable to form close relationships with the foster families she has lived with.  Finally, she found a home with a single woman named Sarah and she learned to keep her secret to herself. The only person who knows about her ability is her best friend Becky. As she approaches her 18th birthday, she starts to see visions of demon creatures and great warriors caught in a great battle.  Confused by these visions, she is unaware that she will play an integral part in the outcome of the war. As she explores her situation more, she finds that she does have a family and place in another realm. She never dreamed she could find her one true mate, and a home where she belongs. Teaser  I stood frozen in an unfamiliar alley surrounded by darkness as I watched swords clash together with the strength of ten men. Sparks flew and a thunderous noise had me covering my ears and hiding my face. I could feel my body shaking, worried for the dark-haired man as his muscles bulged with every swing. Evenly matched. As I tore my eyes from the swords, and the man that wielded it, I looked at his opponent and gasped with fear. Its eyes shot to mine and I saw his hate-filled red ones staring back at me. I couldn’t help but take a step backward. With his eyes on me, the dark-haired Greek god swung his sword true, taking the creature to its knees. When he delivered the final blow, his turquoise eyes turned on me, almost glowing. My heart stuttered before setting a rapid pace. The only thought that entered my mind; RUN! Drenched in sweat, I sat straight up in bed. What the hell was that? Never had my dreams seemed so real. I felt as if I was actually there. I had a bad feeling.",
  "genres": [
    "Fantasy"
  ],
  "author": "Hannah Davenport",
  "average_rating": "4.03",
  "url": "https://www.goodreads.com/book/show/29860119-i-can-hear-you"
}