{
  "title": "Rockstar Bodyguard: Still Getting Nowhere Fast",
  "description": "Still Getting Nowhere Fast! A witty Rockstar Bodyguard romance sequel!  Can an inexperienced female bodyguard again save her rock star lover from crazy fangirls and jealous ex-boyfriends?  A year has passed since Marley Silver walked away from her boyfriend, Crawl Jones. His job as lead singer of the rock band Nowhere Fast just didn’t work out for her. She got a steady job and he continued on tour. After a picture of him with some barely-dressed groupie surfaced, she called it off. Dating a normal guy, working a normal job, everything was going right for her. Until it wasn’t. She lost her job because of a security snafu that she refused to take credit for. Her sixth sense was messing up. Life was a wreck once again. On her last few dollars before she had to move in with her brother, he calls her back into his office. The last job that she could possibly want and it’s hers if she just agrees to take it. Guarding Nowhere Fast again. Just what she didn’t want, but can’t turn down.  Crawl Jones has been pissed off since the woman he loves decided for them that their relationship was over. Branded a cheater, unfairly, he’s been biding his time until he could finish up another tour and get back to her. She could think she was done with him all she wanted, but he wasn’t a man who took no for an answer without a fight. Everything comes to a standstill, however, when he comes face to face with a crazed man outside of a concert venue one night. Never one to back down from a fight, Crawl fights back. A gunshot wound and a worried band later, he’s about to be swamped in security. From experience, he knows that if he’s going to be surrounded by people who want to babysit him, he’d prefer it be a beautiful woman that can’t seem to keep her hands off of his body when they’re alone.  Marley shows up with a beat up confidence in her skills as a bodyguard and a racing heart. Coming face to face with her ex after a year isn’t what she had in mind. Seeing him with a gunshot wound is nearly her undoing. Even after a year, she can’t seem to turn off the part of her brain that wants Crawl. Guarding his body is going to be hard when she only has eyes for him. Plus, with her out of whack sixth sense, she’s taking down innocent people and missing potential threats to the rest of the band. At least the band isn’t on the road for a while. At a weeklong outdoor concert event, she’s sleeping in a tent and bathing from a sink. Her hair is a mess, she just wants to cry, and some gossip magazine called her trashy. On top of that, Crawl is being impossible to guard because he’s handsy and difficult. Will she be able to get her skills back to protect the man she once loved or will she have to say goodbye to him once more?",
  "genres": [],
  "author": "S.M. Kingdom",
  "average_rating": "3.62",
  "url": "https://www.goodreads.com/book/show/29867746-rockstar-bodyguard"
}