{
  "title": "Smooth Talker: Trail of Death",
  "description": "New From New York Times Bestselling True Crime Author Steve Jackson Three murders. Thirty years of dead ends. Until one rookie investigator began piecing it all together. One morning in July 1974, Anita Andrews, the owner and bartender at Fagiani’s Cocktail Lounge in Napa, California was found dead in her bar–raped, beaten, and stabbed to death in a bloody frenzy. She’d last been seen alive the night before talking to a drifter who sat at the end of the bar, playing cards and flirting with her. But the stranger, along with Anita’s Cadillac, had disappeared. Unable to locate a suspect, police investigators sadly watched the case grow cold over the years. \"Jackson writes with muscle and heart.--New York Times bestselling author Gregg Olsen Meanwhile a month after Anita’s murder, young Michele Wallace, was driving down a road in the mountains near Crested Butte, Colorado, when she gave two stranded motorists, Chuck Matthews and a man named Roy, a ride. Dropping Matthews off at a bar in Gunnison, she agreed to take “Roy” to his truck. She was never seen alive again, nor could a massive search of the mountains locate her remains. The trail leading to her killer also ran into deadends. Fourteen years later, Charlotte Sauerwin, engaged to be married, met a smooth-talking man at a Laundromat in Livingston Parish, Louisiana. The next evening, her body was found in the woods; she’d been raped, tortured, and her throat slashed. The police suspected her fiance, Vince LeJeune, though he proclaimed his innocence to anyone who would listen. Meanwhile, the man from the Laundromat couldn’t be located. The three murders would remain unsolved, eating at the hearts, minds and lives of the women’s families, friends and communities. Then in the early 1990s, a rookie Gunnison County sheriff’s investigator named Kathy Young began looking into the Wallace case and identified a suspect named Roy Melanson, a serial rapist from Texas. It would lead her and other investigators looking into murders and rapes in other states to a serial killer who struck again and again with seeming impunity. SMOOTH TALKER is the story of Melanson, his depredations, and the intrepid police work that went into bringing him to justice not just in Colorado, but California and Louisiana.",
  "genres": [
    "True Crime",
    "Nonfiction",
    "Crime",
    "Audiobook"
  ],
  "author": "Steve    Jackson",
  "average_rating": "4.04",
  "url": "https://www.goodreads.com/book/show/29860211-smooth-talker"
}