{
  "title": "Hoping to Help: The Promises and Pitfalls of Global Health Volunteering",
  "description": "Overseas volunteering has exploded in numbers and interest in the last couple of decades. Every year, hundreds of thousands of people travel from wealthier to poorer countries to participate in short-term volunteer programs focused on health services. Churches, universities, nonprofit service organizations, profit-making \"voluntourism\" companies, hospitals, and large corporations all sponsor brief missions. Hoping to Help is the first book to offer a comprehensive assessment of global health volunteering, based on research into how it currently operates, its benefits and drawbacks, and how it might be organized to contribute most effectively. Given the enormous human and economic investment in these activities, it is essential to know more about them and to understand the advantages and disadvantages for host communities.Most people assume that poor communities benefit from the goodwill and skills of the volunteers. Volunteer trips are widely advertised as a means to \"give back\" and \"make a difference.\" In contrast, some claim that health volunteering is a new form of colonialism, designed to benefit the volunteers more than the host communities. Others focus on unethical practices and potential harm to the presumed \"beneficiaries.\" Judith N. Lasker evaluates these opposing positions and relies on extensive research—interviews with host country staff members, sponsor organization leaders, and volunteers, a national survey of sponsors, and participant observation—to identify best and worst practices. She adds to the debate a focus on the benefits to the sponsoring organizations, benefits that can contribute to practices that are inconsistent with what host country staff identify as most likely to be useful for them and even with what may enhance the experience for volunteers. Hoping to Help illuminates the activities and goals of sponsoring organizations and compares dominant practices to the preferences of host country staff and to nine principles for most effective volunteer trips.",
  "genres": [
    "Medicine",
    "Nonfiction",
    "Health",
    "Medical",
    "Travel"
  ],
  "author": "Judith N. Lasker",
  "average_rating": "4.04",
  "url": "https://www.goodreads.com/book/show/29858781-hoping-to-help"
}