{
  "title": "Democracy Abroad, Lynching at Home: Racial Violence in Florida",
  "description": "Winner of the Florida Book Award for Florida Nonfiction, Bronze Winner of the Florida Historical Society’s Harry T. & Harriette V. Moore Award “Hobbs unearths four lynchings that are critical to the understanding of the origins of civil rights in Florida. The oral histories from the victims’ families and those in the communities make this a valuable contribution to African American, Florida, and civil rights history.”—Derrick E. White, author of The Challenge of Blackness “A compelling reminder of just how troubling and violent the Sunshine State’s racial past has been. A must read.”—Irvin D.S. Winsboro, editor of Old South, New South, or Down South? Florida is frequently viewed as an atypical southern state—more progressive and culturally diverse—but, when examined in proportion to the number of African American residents, it suffered more lynchings than any of its Deep South neighbors during the Jim Crow era.           Investigating this dark period of the state’s history and focusing on a rash of anti-black violence that took place during the 1940s, Tameka Hobbs explores the reasons why lynchings continued in Florida when they were starting to wane elsewhere. She contextualizes the murders within the era of World War II, contrasting the desire of the United States to broadcast the benefits of its democracy abroad while at home it struggled to provide legal protection to its African American citizens.           As involvement in the global war deepened and rhetoric against Axis powers heightened, the nation’s leaders became increasingly aware of the blemish left by extralegal violence on America’s reputation. Ultimately, Hobbs argues, the international implications of these four murders, along with other antiblack violence around the nation, increased pressure not only on public officials in Florida to protect the civil rights of African Americans in the state but also on the federal government to become more active in prosecuting racial violence.",
  "genres": [
    "History"
  ],
  "author": "Tameka Bradley Hobbs",
  "average_rating": "4.40",
  "url": "https://www.goodreads.com/book/show/29873350-democracy-abroad-lynching-at-home"
}