{
  "title": "Unleashed",
  "description": "All four volumes of Unleashed in one box set—plus a new bonus chapter!Declan I never thought I’d see her again. The one I couldn’t have, the one I’d never forget. When I met her I had nothing, a lowly ranch hand working on her daddy’s land. She was the golden girl up on the hill, sexy as hell but beyond my reach. Now, like all my fantasies realized, she’s come to me for help.I’m a bastard, ruthless in pursuit of my goals. My cold, hard drive has made me what I am today, amassing wealth and power. A good guy would help her, then send her on her way with a handshake and a smile. I’m not a good guy. I’m going to make a bargain and hold her to it.One week. I’ll bail her out, pay off all her debts, but only after she gives herself to me completely. Seven days and seven nights of no-holds-barred submission to my dominance. I’m a demanding man with dark, relentless appetites. She’s unleashed the beast in me and I won’t stop until I possess all of her. KaraSix years ago he broke my heart. Now, with nowhere else to turn, I’ve put myself at his mercy. He’s the ultimate alpha male, commanding and controlling, and I’ve agreed to let him use me as his plaything for a week. I’m terrified of how he’ll take me, what he’ll make me do to serve all of his needs.I’ve got to keep this week all business. It needs to stay a transaction, pure and simple, no emotions in play. I’m scared as hell about the power he wields over me. \tBecause I have a dirty secret. I’ve never gotten over him. I’ll fight hard to keep up all my defenses even as he melts them down. But the truth is that the thought of serving him has me panting, wet and practically begging for everything he has planned.  NOTE: Unleashed is the first, standalone story in the Beg for It series about the hot, alpha males in Declan's family and the battles they wage with the strong, sexy women who make them finally meet their match.",
  "genres": [
    "Contemporary Romance"
  ],
  "author": "Callie Harper",
  "average_rating": "4.06",
  "url": "https://www.goodreads.com/book/show/29888979-unleashed"
}