{
  "title": "Lucas e Nicolas",
  "description": "Lucas é um adolescente como qualquer outro: seu corpo cheio de hormônios o enche de desejos e sua cabeça de dúvidas. Na escola, Lucas é considerado um ‘loser’: tímido, péssimo nos esportes e muito inteligente, alvo constante de chacota dos alunos mais ‘populares’ e completamente inábil na arte da conquista amorosa. Mas, no caso de Lucas, algo mais o deixa vulnerável ao assédio dos colegas: ele é gay. E isso faz toda a diferença, principalmente em um ambiente conservador como na pequena cidade do interior paulista onde vive. A tanto sofrimento, soma-se uma novidade: recém-chegado da capital São Paulo, Nicolas é tudo o que ele não é: bonito, forte e popular. E é, talvez, justamente por isso, ou por algum outro motivo que ele não consegue identificar, que Lucas se apaixona pelo seu oposto – ou pelo seu complemento? Como lidar com isso? Pode-se considerar “Lucas e Nicolas”, lançamento do Fábrica231, um livro necessário. Com habilidade, o autor traça um perfil honesto de Lucas, um menino desprotegido e solitário em suas dúvidas e questionamentos acerca de sua orientação sexual. Sem interlocutores que possam ouvi-lo e orientá-lo, resta-lhe o sentimento de vergonha, deslocamento e medo. Afinal, o mundo parece não perdoar quem é diferente. Por conta disso, sofre toda sorte de agressões, verbais e físicas, numa homofobia que é negada conscientemente por seus perpetradores, mas muito presente na vida diária. Na impossibilidade de poder expressar seu afeto, Lucas corre para o abrigo da internet, onde faz um amigo, Matheus, gay assumido, mas que nunca viu ao vivo. Matheus é seu confidente e representa aquele jovem homossexual que tem orgulho de ser quem é. Assume seu caráter único e vive com intensidade toda uma cultura gay que se reflete em músicas, filmes e num linguajar muito peculiar. Ao desabafar sobre Nicolas, ele descobre com Matheus uma informação crucial sobre seu objeto de desejo. Nicolas é o típico aluno popular, forte, bonito e atlético. Mas, por trás de tanta fortaleza, esconde-se uma personalidade frágil, um menino com uma família desajustada, que o obriga a amadurecer cedo. Ele vem da capital para o interior, mas tem dificuldade de se adaptar. Sente saudades dos amigos de São Paulo, e de um em especial. Péssimo nos estudos, ele é obrigado a ter aulas particulares com o CDF do colégio: Lucas. E agora? “Lucas e Nicolas” é um livro necessário, e não apenas porque pode se tornar um espelho na identificação com leitores adolescentes e jovens. É um livro para ser lido por pais, professores e adultos, que muitas vezes – e na maior parte das vezes – não sabem como lidar com o despertar da sexualidade de seus filhos, alunos, sobrinhos e netos. Deixe seu preconceito de lado e acompanhe esta história hilária e (pouco/muito) romântica, embalada pelos (melhores/piores) momentos de nossas vidas!",
  "genres": [
    "LGBT",
    "Young Adult",
    "Romance",
    "Queer",
    "Drama",
    "Contemporary"
  ],
  "author": "Gabriel Spits",
  "average_rating": "3.02",
  "url": "https://www.goodreads.com/book/show/29891044-lucas-e-nicolas"
}