{
  "title": "No Outspan: A Boer Journal of Life after the War",
  "description": "“[A]n entertaining narrative of his activities … in the course of which he has succeeded in proving … that in spite of our quarrels, South Africa is a country of good temper and good will, with the hope of a united nation to come.” — General J. C. SmutsStanding as two pillars in his life, when Gens. Botha and Smuts stated their need for him back home the once-exiled Boer did not fully realise the turning point it would be.Deneys Reitz believed that South Africa’s safety lay with the Commonwealth, and its people’s unity was only attainable under its shelter, and on his return in 1919 he entered the political arena, joining Smuts’ South African Party.Although he returned to law and later travelled following Gen. Hertzog’s National Party’s rise to power in 1924, less than a decade later he returned as part of a “united” coalition.With the outbreak of WWII and Hertzog’s bid for neutrality failing, Reitz found himself appointed Smuts’ Deputy Prime his subsequent journeyings and encounters were no less extraordinary than any that had come before.Concluding the narrative of an extraordinary life, No Outspan recounts Reitz’s colourful adventures and endeavours as the long-drawn political struggle for South Africa continued.Deneys Reitz (1882-1944) was a Boer solider, lawyer, author and politician. From the day he enlisted in a commando to the Western Front and beyond, his life’s work would be devoted to South Africa. He married in 1920, and his wife would go on to become the first female member of the House of Assembly of South Africa. Commando and Trekking On are the first two volumes of his memoirs.For details of other books published by Albion Press go to the website at www.albionpress.co.uk.Albion Press is an imprint of Endeavour Press, the UK's leading independent digital publisher. For more information on our titles please sign up to our newsletter at www.endeavourpress.com. Each week you will receive updates on free and discounted ebooks. Follow us on @EndeavourPress and on Facebook via We are always interested in hearing from our readers. Endeavour Press believes that the future is now.",
  "genres": [
    "Africa",
    "Nonfiction",
    "History"
  ],
  "author": "Deneys Reitz",
  "average_rating": "4.40",
  "url": "https://www.goodreads.com/book/show/29894429-no-outspan"
}