{
  "title": "African Kaiser: General Paul von Lettow-Vorbeck and the Great War in Africa, 1914-1918",
  "description": "The incredible true account of General Paul von Lettow-Vorbeck and his exploits in World War I Africa with the legendary \"Schutztruppe.\" At the beginning of the twentieth century, the continent of Africa was a hotbed of international trade, colonialism, and political gamesmanship. So when World War I broke out, the European powers were forced to contend with one another not just in the bloody trenches, but in the treacherous jungle. And it was in that unforgiving land that General Paul von Lettow-Vorbeck would make history. With the now-legendary Schutztruppe (Defensive Force), von Lettow-Vorbeck and a small cadre of hardened German officers fought alongside their devoted native African allies as equals, creating the first truly integrated army of the modern age. African Kaiser is the fascinating story of a forgotten guerrilla campaign in a remote corner of Equatorial Africa in World War I; of a small army of loyal African troops led by a smaller cadre of rugged German officers—of white men and black who fought side by side. It is the story of epic marches through harsh, beautiful landscapes; of German officers riding bicycles to battle through the bush; of rhino charges and artillery duels with scavenged naval guns; of hunted German battleships hidden up unmapped river deltas teeming with crocodiles and snakes; of a desperate army in the wilderness cut off from the world, living off hippo lard and sawgrass flowers—enduring starvation, malaria, and dysentery. And of the singular intercontinental voyage of Zeppelin L59, whose improbable four-thousand-mile journey to the equator and back made aviation history.  But mostly it is the story of von Lettow-Vorbeck—the only undefeated German commander in the field during World War I and the last to surrender his arms.",
  "genres": [
    "History",
    "Africa",
    "Nonfiction",
    "Biography",
    "World War I",
    "Military History",
    "War"
  ],
  "author": "Robert Gaudi",
  "average_rating": "4.37",
  "url": "https://www.goodreads.com/book/show/29889349-african-kaiser"
}