{
  "title": "Paper Girls, Volume 1",
  "description": "From Brian K. Vaughan, #1 New York Times bestselling writer of SAGA, and Cliff Chiang, legendary artist of WONDER WOMAN, comes the first volume of an all-new ongoing adventure. In the early hours after Halloween of 1988, four 12-year-old newspaper delivery girls uncover the most important story of all time. Suburban drama and otherworldly mysteries collide in this smash-hit series about nostalgia, first jobs, and the last days of childhood. Collecting Issues #1-5 for only $9.99! \"Along with Paper Girls, Brian K. Vaughan is the writer/co-creator of the graphic novels Saga, The PrIvate Eye, We Stand On Guard, Y: The Last Man, Ex Machina, Runaways, Pride of Baghdad, The Hood, and The Escapists. His work has been recognized at the Hugo, Eisner, Harvey, Shuster, Eagle, and British Fantasy Awards. BKV sometimes dabbles in film and television work from Los Angeles, where he lives with his family and their loyal wiener dog Hamburger K. Vaughan. After graduating from the Kubert School JARED K. FLETCHER began working at DC Comics as part of their new in-house lettering department. A few years later, he left to pursue his freelance career as the proprietor of Studio Fantabulous. He spends his long days designing logos, books, t-shirts, art directing covers, and lettering comic books.CLIFF CHIANG began working in editorial for Vertigo Comics before making the leap into freelance illustration in 2000 and he hasn't looked back. He's best known for his work on Human Target, Green Arrow & Black Canary, and Wonder Woman. Cliff lives and works in Brooklyn, NY. MATT WILSON has been coloring comics since 2003, getting his start coloring for the comics coloring studio Zylonol Studios. After a few years in the studio, Matt eventually branched out on his own to color titles like Phonogram, Young Avengers, Thor, Daredevil, Wonder Woman, Swamp Thing, and The Wicked + The Divine. In 2015, Matt's work earned him Eisner Award and Harvey Award nominations.\"",
  "genres": [
    "Graphic Novels",
    "Comics",
    "Science Fiction",
    "Young Adult",
    "Fiction",
    "Graphic Novels Comics",
    "Fantasy"
  ],
  "author": "Brian K. Vaughan",
  "average_rating": "3.89",
  "url": "https://www.goodreads.com/book/show/29890100-paper-girls-volume-1"
}