{
  "title": "How To Tame Beasts And Other Wild Things",
  "description": "An artsy young woman, given the impossible task by her estranged father to score her widowed brother-in-law a wife, instead finds love, self-discovery and redemption.  “My name is Matilda Pearl. My life is a non-stop riddle I hope to one day solve.  I’ve learned to protect my heart; fate has dealt me more than a few shit cards in my twenty-two years. Invisibility tops my list, not to mention tragedy.  I was yanked out of a Paris-France life by my ass of a father, and thrown into a one year journey on a farm in Wisconsin. I’ve been assigned the impossible: Wife Catcher. Simply put, until I replace myself I’m Mary Poppins, the beast tamer, ringmaster of the unruly, complete with twin toddlers and a beast of a man. Ladies and Gentlemen, welcome to my three-ring circus. “The Beast – Balthazar Cox – is repulsive…as in that sexy, I-just-died-and-went-to-heaven sort of repulsive. He walks the earth like he owns it, with his tatted trunk of a body and chiseled-rough, blazing good looks. The beastly Brit – did I mention that he’s English? – also happens to be my widowed brother-in-law, a man haunted by betrayal and abandonment, and for whom I’m on task to find a wife. If I succeed I’ll be rewarded with my juicy trust fund. And, yes, it will happen. You can keep your diamonds and designer clothes…. With my bag of loot, I plan on becoming the Patron Saint of Lost and Found Animals. “When the past resurfaces more than once for both of us, all hell breaks loose. Can you be lost and found at once? In other words, sometimes lies can be cathartic. Some people heal us; some of us heal others.  “This is mostly a love story, an unlikely sexy romance with whiplash twists, boundaries that shouldn’t be crossed, and multiple risks of losing everything. It may have more heartache, and drama than some but in the end it’s about truth, discovery and forgiveness. Maybe it was wrong to fall for him. Or maybe the hole in his heart was always waiting for me to fill it. Now there’s a riddle for you.”Tender, textured, suspenseful and triumphant. A mind blowing, fast paced, sexually-tense passion, that is an emotional ride of second chances, healing and redemption. A full-length, standalone New Adult Contemporary Romance: Due to strong language and sexual content, and mature topics this book is not intended for readers under the age of 18.",
  "genres": [
    "Romance",
    "Contemporary Romance",
    "Contemporary",
    "Humor",
    "New Adult",
    "Erotic Romance"
  ],
  "author": "A. Wilding Wells",
  "average_rating": "4.08",
  "url": "https://www.goodreads.com/book/show/29883552-how-to-tame-beasts-and-other-wild-things"
}