{
  "title": "Time Travel and Warp Drives: A Scientific Guide to Shortcuts through Time and Space",
  "description": "To see video demonstrations of key concepts from the book, please visit this  press.uchicago.edu/sites/timewarp/ind.... Sci-fi makes it look so easy. Receive a distress call from Alpha Centauri? No punch the warp drive and you're there in minutes. Facing a catastrophe that can't be averted? Just pop back in the timestream and stop it before it starts. But for those of us not lucky enough to live in a science-fictional universe, are these ideas merely flights of fancy--or could it really be possible to travel through time or take shortcuts between stars?Cutting-edge physics may not be able to answer those questions yet, but it does offer up some tantalizing possibilities. In Time Travel and Warp Drives , Allen Everett and Thomas A. Roman take readers on a clear, concise tour of our current understanding of the nature of time and space--and whether or not we might be able to bend them to our will. Using no math beyond high school algebra, the authors lay out an approachable explanation of Einstein's special relativity, then move through the fundamental differences between traveling forward and backward in time and the surprising theoretical connection between going back in time and traveling faster than the speed of light. They survey a variety of possible time machines and warp drives, including wormholes and warp bubbles, and, in a dizzyingly creative chapter, imagine the paradoxes that could plague a world where time travel was possible--killing your own grandfather is only one of them!Written with a light touch and an irrepressible love of the fun of sci-fi scenarios--but firmly rooted in the most up-to-date science, Time Travel and Warp Drives will be a delightful discovery for any science buff or armchair chrononaut.",
  "genres": [
    "Science",
    "Nonfiction",
    "Physics",
    "Time Travel",
    "Space",
    "Research",
    "Popular Science"
  ],
  "author": "Allen Everett",
  "average_rating": "3.78",
  "url": "https://www.goodreads.com/book/show/11862075-time-travel-and-warp-drives"
}