{
  "title": "Death at St. Vedast",
  "description": "During the tempestuous reign of Henry VIII, London alchemist Bianca Goddard has seen up close what keeps a man alive and what can kill him. A good thing, for she will need all her knowledge to keep a friend away from the gallows . . . Bianca and her husband John are delighted to share in the glad fortune of their friend, Boisvert, the silversmith, who is to wed Odile, the wealthy widow of a goldsmith. But a pall is cast over the upcoming nuptials when the body of a pregnant woman is found beneath the bell tower of St. Vedast, the very church where the betrothed are to be married.  Tragedy strikes again at the couple s reception, when Odile suddenly drops dead in the middle of the wedding feast. The constable suspects Boisvert poisoned his new bride for her money, but there s not a trace of poison in her food or wine. Could the two deaths be connected? To prove their friend s innocence, Bianca will need to employ her knowledge of alchemy for if she can determine how the bride was killed, she may find the person responsible for her murder before another victim is added to the death toll . . . Praise for The Alchemist s Daughter Set during the twilight years of Henry VIII with vibrant characters, a compelling plot and accurate historical depictions, The Alchemist s Daughter brings the darkness and danger of Tudor London vividly to life as it weaves its suspenseful tale. This beautifully written addition to the medieval mystery genre is sure to delight all fans of the period. Sandra Worth, author of Pale Rose of England A smart, scientific sleuth Lawrence uses her enthusiasm for Elizabethan England to create an historical novel within a mystery. Portland MonthlyThe writing is terrific, with great period details. There are lots of red herrings and a surprising amount of action that will keep readers engaged until the very last page. San Francisco Book ReviewI absolutelyloved The Alchemist's Daughter - the characters, the authentic feel of the period, and of course the richly drawn story. Dorothy Cannell, author of Murder at MullingsLawrence proves herself to be an excellent storyteller with this grim tale of murder, mayhem and medicine.\" CentralMaine.com\n \n A realistic evocation of 16th century London s underside. The various strands of the plot are so skillfully plaited together. Fiona Buckley Captivating . . . just smart enough to be charming without being precious or terribly unrealistic. Library Journal  Well-written, enjoyable, and well-worth reading. New Mystery Reader\n\nPraise for Death of an AlchemistLawrence excels at exploring themes parent-child conflict, dreams of eternal life, and the limitations of medicine that have period and present-day resonance. Publishers WeeklyAnother exciting adventure on the back streets of 16th century London. RT Book ReviewsMary Lawrence is as sharp as ever this is an exciting and very satisfying historical mystery in Tudor London. Kennebec Journal\"",
  "genres": [
    "Historical Fiction",
    "Mystery",
    "Historical Mystery",
    "Fiction",
    "Tudor Period",
    "Historical",
    "Alchemy"
  ],
  "author": "Mary Lawrence",
  "average_rating": "3.92",
  "url": "https://www.goodreads.com/book/show/29901665-death-at-st-vedast"
}