{
  "title": "Be Careful What You Wish For",
  "description": "The Hellandbacks live the normal life of American teenagers until their parents send them to spend part of the summer with their great-grandmother in Scotland. Not only does their formidable Great-grandmother make an unforgettable impression on them, but so does her home—a one hundred-year-old hospital!Great-grandmother quickly sizes up the four teens and shows them to their rooms. Each room seems far-out, but suits the teen perfectly. Eleven-year-old Chris, who takes nothing seriously (except the big dog that chases him after school every day), gets to sleep on the table in a fully functional operating room. Petite, fourteen-year-old Trisha will sleep in a cozy coffin in the hospital chapel, which comes complete with a wedding dress to fulfill her dreams of marriage. Things get really interesting when twelve-year-old Brittany learns she will be sleeping in an isolation room for patients with contagious diseases, complete with a depressing mural of a plague. Ambitious fifteen-year-old Jon ends up on a Murphy bed in the administrative office.The strange rooms only hint at the events that overtake the four siblings during their first night in Scotland. Each teen falls asleep that night, only to wake in the midst of an individual adventure. Isolated at first, they soon learn that they must find a way to work together to survive their trials.Drawn into different worlds and times, the teens face frostbite, the Bubonic Plague, the cut-throat business world, and a true lady-killer. Their allies range from entirely unexpected creatures with dubious taste in food to raccoons, rats, personal assistants, eccentric professors and small boys with hidden talents. Odd gifts, hints and nudges from Great-grandmother help them along the way. In the end, though, only the siblings can save each other. Their adventures overlap, and they join together to defeat the architect of all their woes, the Grim Reaper himself.When the teens return safely to Great-grandmother’s hospital home, she smiles knowingly and puts them on the plane back home, transformed. During their visit, Chris found confidence and learned the value of focus and practice. Trisha learned that she needs to be a strong person herself, not just someone’s wife. Brittany learned the limits of science and the value of friends, while Jon learned that money cannot buy health, happiness or friends.When they return home, the siblings bicker much less. Their pleasantly surprised parents decide to enjoy it while it lasts!",
  "genres": [
    "Fantasy",
    "Childrens"
  ],
  "author": "L.L. Helland",
  "average_rating": "3.81",
  "url": "https://www.goodreads.com/book/show/11863277-be-careful-what-you-wish-for"
}