{
  "title": "A Beautiful Place to Die",
  "description": "Award-winning screenwriter Malla Nunn delivers a stunning and darkly romantic crime novel set in 1950s apartheid South Africa, featuring Detective Emmanuel Cooper -- a man caught up in a time and place where racial tensions and the raw hunger for power make life very dangerous indeed.In a morally complex tale rich with authenticity, Nunn takes readers to Jacob's Rest, a tiny town on the border between South Africa and Mozambique. It is 1952, and new apartheid laws have recently gone into effect, dividing a nation into black and white while supposedly healing the political rifts between the Afrikaners and the English. Tensions simmer as the fault line between the oppressed and the oppressors cuts deeper, but it's not until an Afrikaner police officer is found dead that emotions more dangerous than anyone thought possible boil to the surface.When Detective Emmanuel Cooper, an Englishman, begins investigating the murder, his mission is preempted by the powerful police Security Branch, who are dedicated to their campaign to flush out black communist radicals. But Detective Cooper isn't interested in political expediency and has never been one for making friends. He may be modest, but he radiates intelligence and certainly won't be getting on his knees before those in power. Instead, he strikes out on his own, following a trail of clues that lead him to uncover a shocking forbidden love and the imperfect life of Captain Pretorius, a man whose relationships with the black and coloured residents of the town he ruled were more complicated and more human than anyone could have imagined.The first in her Detective Emmanuel Cooper series, \"A Beautiful Place to Die\" marks the debut of a talented writer who reads like a brilliant combination of Raymond Chandler and Graham Greene. It is a tale of murder, passion, corruption, and the corrosive double standard that defined an apartheid nation. I",
  "genres": [
    "Mystery",
    "Africa",
    "Fiction",
    "Historical Fiction",
    "South Africa",
    "Crime",
    "Mystery Thriller"
  ],
  "author": "Malla Nunn",
  "average_rating": "3.89",
  "url": "https://www.goodreads.com/book/show/2991868-a-beautiful-place-to-die"
}