{
  "title": "Little Do We Know",
  "description": "Lifelong best friends and next-door neighbors Hannah and Emory have never gone a single day without talking. But now its senior year and they haven’t spoken in three months. Not since the fight, where they each said things they couldn’t take back. They’re aching to break the silence, but those thirty-six steps between their bedroom windows feel more like thirty-six miles.Then one fateful night, Emory’s boyfriend, Luke, almost dies. And Hannah is the one who finds him and saves his life.As Luke tries to make sense of his near-death experience, he secretly turns to Hannah, who becomes his biggest confidante. In Luke, Hannah finds someone she can finally talk to about all the questions she’s grappling with. Emory just wants everything to go back to normal–the way it was before the accident. She has no idea why her relationship is spiraling out of control. But when the horrifying reason behind Hannah and Emory’s argument ultimately comes to light, all three of them will be forced work together to protect the one with the biggest secret of all.In the follow-up to her New York Times bestseller, Every Last Word, Tamara Ireland Stone crafts a deeply moving, unforgettable story about love, betrayal, and the power of friendship. * 2019 NCIBA Golden Poppy Award Winner * Bank Street College Best Children’s Books of the Year *\"A beautiful testament to friendship and the intricate patterns we weave throughout each other's lives.\"―Robin Benway, National Book Award winning author of Far From the Tree \"Beautiful, heartfelt, deep, and real. This book broke my heart and I loved every minute of it.\"―Robyn Schneider, author of The Beginning of Everything \"Little Do We Know is a beautiful, affecting novel. Stone writes compellingly about the power of friendship, of love.\"―New York Times best-selling author Luanne Rice \"Touching on weighty issues, including sexual harassment, religious crises, friendship, and taboo love, Stone writes a thought-provoking novel that challenges conventional ideas.\" ― Publishers Weekly, starred review \"A realistic fiction novel for those who enjoy a dramatic romance; a must-have for most YA shelves.\" -- School Library Journal",
  "genres": [
    "Young Adult",
    "Contemporary",
    "Romance",
    "Fiction",
    "Realistic Fiction",
    "Young Adult Contemporary",
    "Friendship"
  ],
  "author": "Tamara Ireland Stone",
  "average_rating": "3.85",
  "url": "https://www.goodreads.com/book/show/29924360-little-do-we-know"
}