{
  "title": "The Broken Brooch",
  "description": "A fish out of water love story with a twist!   \n  When a brooch is broken, some of its magic is lost... \n**While this is not a time travel romance, the hero and heroine are taken out of their comfort zones and face many of the same challenges MacKlenna Family time travelers have confronted in previous brooch books.**When NYPD detective JL O’Grady is invited to be her brother’s plus-one at Montgomery Winery's end-of-harvest gala, she plans to enjoy a fabulous weekend in Napa drinking wine, enjoying sunset dinners on the veranda, and watching her brother's high school basketball tournament. Instead, she's pulled into a murder investigation hauntingly similar to a New York City racketeering and drug case that nearly ended her career.The local cops insist she steer clear of their investigation, but JL’s gut instincts - and fears for her brother's safety - drive her deeper into the case. With help from MacKlenna Corporation’s irresistibly handsome and charming CFO, Kevin Allen, she searches for a connection between the two cases, while at the same time her connection with Kevin rockets from mild to scorching in a New York minute.When another crime hits too close to her heart, the stakes escalate and endanger not only JL, but the entire MacKlenna Clan as well.Now it’s up to JL and Kevin - with a little help from David McBain, who is drowning in toddler hell - to solve the case. With time running out and danger closing in, JL and Kevin rush to discover the killer's identity before someone else is murdered, and while they're at it, they might just find what’s been missing from both their lives for far too long. ˃˃˃ Coming Next... JL and Kevin will join bestselling author Jack Mallory in an adventure back in time to find ESPN baseball commentator Amy Spalding. The adventure will take the time travelers to New York City in the early 1900s, a time of widespread racketeering and the corrupt Tammany Hall political machine. THE DIAMOND BROOCH will be available this Christmas. ˃˃˃ The Celtic Brooch Series THE RUBY BROOCH (Book 1): Time Travel Romance - Oregon Trail 1852 - Kit MacKlenna and Cullen Montgomery's love story. THE LAST MACKLENNA (Book 2): Contemporary Romance - Meredith Montgomery and Elliott Fraser's love story. THE SAPPHIRE BROOCH (Book 3): Time Travel Romance - Civil War, 1864-1865 - Charlotte Mallory and Braham McCabe's love story. THE EMERALD BROOCH (Book 4): Time Travel Romance - World War II, London, June 1944 - Kenzie Wallis-Manning and David McBain's love story.THE BROKEN BROOCH (Book 5): Contemporary Romance - Jenny Lynn \"JL\" O'Grady and Kevin Allen's love story. THE DIAMOND BROOCH (Book 6 Available Christmas 2016): Time Travel Romance - New York City 1909 - Amy Spalding and Jack Mallory's love story. \nScroll up and grab a copy today.",
  "genres": [
    "Time Travel",
    "Romance",
    "Historical Fiction",
    "Fiction",
    "Fantasy",
    "Audiobook",
    "Historical Romance"
  ],
  "author": "Katherine Lowry Logan",
  "average_rating": "4.55",
  "url": "https://www.goodreads.com/book/show/29923711-the-broken-brooch"
}