{
  "title": "As the Wolf Howls",
  "description": "Brossard takes on the '70s: a time of despair as the dreams and ideals of the '60s were cashed in for political opportunism and crass materialism. America's inglorious exit from Vietnam, the increasingly desperate actions of counterculture protest groups, the rise of repressive CIA operations, the commodification of the American way혰all this and more is captured here in Brossard's inimitable style.That style discards realism in favor of a free-form fiction that mixes French surrealism and theatrical absurdity with Beat improvisation and performance art confrontation. Brossard's avalanche of language is outrageous. A kind of verbal delirium possesses the text, which on one level may be the collective fantasy lives of a countercultural group in Paris; on another, the psychotic outpourings of a woman named Decca Aldridge; on yet another, a script by impresario Socks Peelmunder for a guerrilla theater performance; and on the final level, the gamy underside of America's subconscious혰a terrifying lava flow of provincial prejudices, racial fears, political paranoia, and sexist attitudes all speaking in tongues in a desperate attempt to bolt the door against the return of the repressed. Not since Naked Lunch has the American dream been assaulted with such ferocious verbal energy.  \"Great but messy fun awaits the nimble and not-too-fastidious reader of what is undoubtedly혰along with Robert Coover's The Public Burning and Pynchon's Gravity's Rainbow혰one of the last mad epics of the West. . . . Very much of its moment, the last thrashing throes of the Cold War mentality at its irrational peak, the book doesn't 'date' but instead appears at exactly the right time for that period to be shudderingly memorialized, an object lesson for the New World Order. It would be a shame to miss it.\" (Joseph Coates, Chicago Tribune 7-19-92)  \"Brossard is genuinely a subversive of the official order in a way only a handful of American writers in this century have been. He has never bothered with the reproduction of reality in his novels, but through absurdity, vulgarity and the literary effort of speaking in dozens of tongues, he has captured the surreal, secret history of the past forty years in America. Just open your ears and Brossard will pour the voices in.\" (Michael Perkins 1-11-93) \"Flotsam and jetsam of pop culture, snatches of his other books, goony puns, ruminations on art and literature and the 'utter . . . impossibility of a really progressive opposition in America,' stylized writing seminar prose jammed up to gritty noir realism . . . it's all . . . together in a principled disorder.\" (New York Press June 10-16 92)  \"The heavy profanity here will offend some readers, but the picaresque brilliance reminiscent of Pynchon, Bukowski, and Joyce will delight many others. Highly recommended.\" (Library Journal 2-15-92)",
  "genres": [
    "Fiction"
  ],
  "author": "Chandler Brossard",
  "average_rating": "4.32",
  "url": "https://www.goodreads.com/book/show/2993456-as-the-wolf-howls"
}