{
  "title": "The Courtship of Eva Eldridge: A Story of Bigamy in the Marriage Mad Fifties",
  "description": "Everyone got married in the 1950s, then moved to the suburbs to have the children of the soon-to-be-famous baby boom. For Americans who had survived the Great Depression and World War II, prosperous married life was a triumph. The unwed were objects of pity, scorn, even suspicion. And so in the 1950s, Eva Eldridge, no longer so young and marginally employed, was the perfect target for handsome Vick, who promised everything: storybook romance, marital respectability, and the lively social life she loved. When he disappeared not long after their honeymoon, she was devastated.Eva hadn’t always been so vulnerable. Growing up pretty and popular in rural Oregon, she expected to marry young and live a life much like that of her parents, farming and rearing children. But then the United States threw its weight into World War II and as men headed to battle, the government started recruiting women to work in their places. Eva, like many other young women, found that life in the city with plenty of money, personal freedom, and lots of soldiers and sailors eager to pay court was more exhilarating than life down on the farm. After the war, she was ambivalent about getting married and settling down—at least until Vick arrived.Refusing to believe her brand-new husband had abandoned her, Eva set about tracking down a man who, she now believed, was more damaged by wartime trauma than she had known. But instead of a wounded hero, she found a long string of women much like herself—hard-working, intelligent women who had loved and married Vick and now had no idea where—or even who—he was.Drawing on a trove of some eight hundred letters and papers, Diane Simmons tells the story of Eva’s poignant struggle to get her dream husband back, as well as the stories of the women who had stood at the altar with Vick before and after her. Eva’s remarkable life illuminates women’s struggle for happiness at a time when marriage—and the perfect husband—meant everything.",
  "genres": [
    "History",
    "Nonfiction"
  ],
  "author": "Diane  Simmons",
  "average_rating": "3.90",
  "url": "https://www.goodreads.com/book/show/29936726-the-courtship-of-eva-eldridge"
}