{
  "title": "Moonlight",
  "description": "The moon has always been a light in the darkness, a symbol of change and transformation to those who hunt the night. Moonlight, the third book in the Pact Arcanum series by Arshad Ahsanuddin, charts the next episode in the bloodthirsty war waged between humans, Nightwalkers, Sentinels, and Daywalkers. As man and vampire intertwine in love and loathing, that formidable moonlight may just illuminate old truths—and powerful new deceptions.The year is 2042. At the White House, Kevin Daniels, President of the United States, has a grave problem on his hands, and it takes the form of his daughter Andrea. As it stands, the two are getting along like wild fire. Now, a serious threat to Andrea materializes as her supernatural destiny is discovered, and puts him in the unenviable position of restricting her freedom just as she clamors for more of it. Luckily, he has just the solution: a newly designated bodyguard, Sentinel Toby Jameson, brother of Armistice leader Nicholas Magister Luscian.Toby, still trying to find a place within supernatural society after coming into his power the year before, has more on his mind—mainly his steamy, yet decidedly contentious relationship with Layla Magister Curallorn, leader of the Daywalkers. One thing is certain: their erotic clashes are taking the inherent violence of normal interaction between Sentinels and vampires to new levels.Soon, Toby’s connection with Andrea proves equally fraught with peril. A strong latent Sentinel and one of the future leaders of her race, Andrea is soon targeted by her enemies within the vampire community. When Vice President Alexander Collins reveals his cruel intentions toward her, the stakes are raised higher than ever.In a vicious, other-worldly battle for dominion, Moonlight again breathes life into a world both fierce and fantastic, where connections are forged that are as deep as the ages—and severed in murderous minutes.",
  "genres": [
    "M M Romance",
    "Fantasy",
    "Vampires",
    "Paranormal",
    "Science Fiction",
    "M F Romance",
    "Urban Fantasy"
  ],
  "author": "Arshad Ahsanuddin",
  "average_rating": "4.31",
  "url": "https://www.goodreads.com/book/show/11863837-moonlight"
}