{
  "title": "Vote Lincoln! the Presidential Campaign Biography of Abraham Lincoln, 1860; Restored and Annotated",
  "description": "In a major publishing event, this fascinating volume restores and explains the most decisive campaign biography in U.S. history. In 1860, the original book catapulted Abraham Lincoln to the White House by dramatically warning of slavery's threat to American democracy. More than a century later, the New York \"Times\" still praised the original campaign biography as \"most authoritative and influential.\" The book spawned an enduring legend: From poverty and tragic loss, a small boy rises to become a mighty crusader for justice.In this radiant expanded edition, Boston Hill Press skillfully restores and illustrates Mr. Lincoln's only major autobiographical effort. (He secretly wrote the initial manuscript. Under his direction, John Locke Scripps, a founder of the Chicago \"Tribune,\" polished and expanded it into a national bestseller.) This restored edition reveals the potent political messages and campaign strategies that the candidate slyly wove into the story of his life. This is no dusty reprint; pithy modern commentary provides often breathtaking insights. Dramatic campaign speeches reverberate again. Rare photographs and posters depict an intense, clean-shaven youthful candidate, as he was then, before he became the bearded sage of our history books. Readers gain fresh perspective on a heartbreaking childhood and an early career as a fearless moral crusader. (Of exceptional interest is a jaw-dropping campaign appearance before a potentially hostile crowd of 12,000 people. Against all odds, Mr. Lincoln brazenly defies incendiary race-baiting by his opponent, the formidable incumbent U.S. Senator Stephen Douglas.)Above all this remarkable book reminds us that Abraham Lincoln was a living legend well before his presidential deeds. He was the American experience incarnate: humble birth in a log cabin; Huck Finn boyhood; self-made man; proverbial country lawyer; passionate antiwar protester; hopelessly idealistic reformer; and hardened crusader for justice. This book implicitly addresses the central question of all elections: How do we recognize a great statesman, before the glory? As such, \"Vote Lincoln!\" is still mandatory reading for modern voters seeking \"the next Abraham Lincoln.\"This is a revised and expanded edition of the first restored edition released for the Lincoln Bicentennial Year of 2009. This expanded 2010 version contains more commentary and illustrations. The volume has over 75 black-and-white photographs, engravings, lithographs, and other illustrations. Several images depict Abraham Lincoln's famous tanned complexion, earned by riding horses as a country lawyer. Other images depict family, friends, opponents, and historical events.",
  "genres": [],
  "author": "John Locke Scripps",
  "average_rating": "4.80",
  "url": "https://www.goodreads.com/book/show/10196548-vote-lincoln-the-presidential-campaign-biography-of-abraham-lincoln-18"
}