{
  "title": "Hearts Across Time",
  "description": "Bestselling author Sherry Ewing presents this special edition novel combining Katherine and Riorden’s complete story from For All of Ever and Only For You in Hearts Across The Knights of Berwyck, A Quest Through Time Novel (Books One & Two).   Sometimes all you need is to just believe…  For All of Katherine Wakefield has dreamed and written of her knight in shining armor all her life until she and her three closest friends take a vacation to England. Yet, how could they have known they’d find themselves thrown back more than eight hundred years into the past? Riorden de Deveraux travels to Bamburgh answering the summons of King Henry. But nothing prepares him for the beautiful vision of a strangely clad ghost who first appears in his chamber. Centuries are keeping them apart until Time gives them a chance at finding love. Will the past of one consume what their future may hold, or will Time take the decision from them and hurdle Katherine forward to where she truly belongs?  Only For Katherine de Deveraux has it all but settling into her duties at Warkworth Castle is not easy & downright dangerous to her well-being. Consumed with memories of his father, Riorden must deal with his sire’s widow. Yet how could he know how far Marguerite will go to have the life she feels they were meant to live? Torn apart, Time becomes their true enemy while Marguerite continues her ploy to keep Riorden at her side. With all hope lost, will Katherine & Riorden find a way to save their marriage? Although Sherry’s book can be read as a stand-alone, there is a particular order to them as characters are introduced. They are as  If My Heart Could See You (a medieval romance) Hearts Across Time (or For All of Ever & Only For You sold individually) a medieval/time travel romance A Knight To Call My Own (a medieval romance)",
  "genres": [
    "Time Travel",
    "Romance",
    "Historical Romance",
    "Historical",
    "Fantasy",
    "Amazon",
    "Time Travel Romance"
  ],
  "author": "Sherry Ewing",
  "average_rating": "4.09",
  "url": "https://www.goodreads.com/book/show/29929463-hearts-across-time"
}