{
  "title": "The Parlour",
  "description": "Above all else Pascal Van Der Braack is a gentleman. Devastatingly debonair and seductively charming. Always styled and perfected.He is also a cad, scoundrel, rogue and kink empire founder. Tutored in the highest of society, having been born of royalty only to deny it, he found his solace in a world where rules need not apply. Where he chooses to ensure rules and duty do not apply. Some call him Sir, others call him Master and no one would dare risk his wrath unless they required the punishment he favourably delivers. No one except one, who has just strapped a collar around his throat. One he asked for. Now he needs to appropriate his businesses correctly for peace to ensue. He needs to find the correct path forward for everyone concerned, so he can relax, enjoy, and finally hand over the responsibility to someone else.Simple.But where comfort and a safety of sorts once dwelt, there is now uncertainty, and a feeling of longing he no longer understands. A need unfulfilled. As problems arise and allies scheme, he finds himself searching for answers in the most unlikely of places.LilahIt’s the same every day. I found it odd at first but I’m used to it now. I was so tired and weak when I got here that it was helpful really. That small woman comes in to help me wash and get dressed. I don’t know where the clothes come from, but they’re nice enough, and at least they’re clean and dry. Not like the rags I arrived in. They were taken from me the moment I took them off to get into the shower, the first shower I’d had in god knows how long. For nearly a year, I’d been running the streets. A year without a real bed or a home of any sort. There isn’t a long and awful story to tell about an abusive family member or a broken home. I suppose I just slipped through the cracks and got lost at some point. I lost my job first, then I couldn’t afford the bills or my apartment, so the landlord threw me out. I don’t blame him, he did the right thing for himself. And then it was just a long and never-ending road to nothingness.So, now I’m here, wherever here is.And I don’t know why…Note* This Trilogy is best read after The White Trilogy as a continuation/spin off as some of the elements to the story are part of a backstory. Although it can still be read as standalone. It begins shortly after The White Trilogy ends and involves old characters.",
  "genres": [
    "BDSM",
    "Erotica",
    "Dark",
    "M F Romance"
  ],
  "author": "Charlotte E. Hart",
  "average_rating": "4.43",
  "url": "https://www.goodreads.com/book/show/29940929-the-parlour"
}