{
  "title": "Glass House: The 1% Economy and the Shattering of the All-American Town",
  "description": "For readers of Hillbilly Elegy and Strangers in Their Own LandWINNER OF THE OHIOANA BOOK AWARDS AND FINALIST FOR THE 87TH CALIFORNIA BOOK AWARDS | NAMED A BEST/MOST ANTICIPATED BOOK OF 2017 New York Post • Newsweek • The Week • Bustle • Books by the Banks Book Festival • Bookauthority.comThe Wall Street \"A devastating portrait...For anyone wondering why swing-state America voted against the establishment in 2016, Mr. Alexander supplies plenty of answers.\"Laura Miller, Slate : \" This book hunts bigger game. Reads like an odd?and oddly satisfying?fusion of George Packer’s The Unwinding and one of Michael Lewis’ real-life financial thrillers.\"The New Yorker : \"Does a remarkable job.\"Beth Macy, author of Factory \" This book should be required reading for people trying to understand Trumpism, inequality, and the sad state of a needlessly wrecked rural America. I wish I had written it.\"In 1947, Forbes magazine declared Lancaster, Ohio the epitome of the all-American town. Today it is damaged, discouraged, and fighting for its future. In Glass House , journalist Brian Alexander uses the story of one town to show how seeds sown 35 years ago have sprouted to give us Trumpism, inequality, and an eroding national cohesion.The Anchor Hocking Glass Company, once the world’s largest maker of glass tableware, was the base on which Lancaster’s society was built. As Glass House unfolds, bankruptcy looms. With access to the company and its leaders, and Lancaster’s citizens, Alexander shows how financial engineering took hold in the 1980s, accelerated in the 21st Century, and wrecked the company. We follow CEO Sam Solomon, an African-American leading the nearly all-white town’s biggest private employer, as he tries to rescue the company from the New York private equity firm that hired him. Meanwhile, Alexander goes behind the scenes, entwined with the lives of residents as they wrestle with heroin, politics, high-interest lenders, low wage jobs, technology, and the new demands of American people like Brian Gossett, the fourth generation to work at Anchor Hocking; Joe Piccolo, first-time director of the annual music festival who discovers the town relies on him, and it, for salvation; Jason Roach, who police believed may have been Lancaster’s biggest drug dealer; and Eric Brown, a local football hero-turned-cop who comes to realize that he can never arrest Lancaster’s real problems.",
  "genres": [
    "Nonfiction",
    "Politics",
    "History",
    "Economics",
    "Business",
    "Sociology",
    "Social Issues"
  ],
  "author": "Brian  Alexander",
  "average_rating": "3.91",
  "url": "https://www.goodreads.com/book/show/29939240-glass-house"
}