{
  "title": "Everybody's Normal Till You Get to Know Them",
  "description": "Normal? Who’s Normal?Not you, that’s for sure! No one you’ve ever met, either. None of us are normal according to God’s definition, and the closer we get to each other, the plainer that becomes. Yet for all our quirks, sins, and jagged edges, we need each other. Community is more than just a word―it is one of our most fundamental requirements. So how do flawed, abnormal people such as ourselves master the forces that can drive us apart and come together in the life-changing relationships God designed us for?In Everybody’s Normal Till You Get to Know Them, teacher and best-selling author John Ortberg zooms in on the things that make community tick. You’ll get a thought-provoking look at God’s heart, at others, and at yourself. Even better, you’ll gain wisdom and tools for drawing closer to others in powerful, impactful ways. With humor, insight, and a gift for storytelling, Ortberg shows how community pays tremendous dividends in happiness, health, support, and growth. It’s where all of us weird, unwieldy people encounter God’s love in tangible ways and discover the transforming power of being loved, accepted, and valued just the way we are.The need for community is woven into the very fabric of our being. Nothing else can substitute for the life-giving benefits of connecting with others―not even God. He won’t preempt the way he himself has designed us to reflect his own intensely relational nature. But there’s a hitch in our experience of community, says John We’re all weird. Folks around us may seem normal enough, but just wait till we get to know them―and they get to know us. The unhealthy, sinful ways we respond to life in a fallen world are hardly God’s idea of “normal,” and they can make us as unhuggable as porcupines. We face the “porcupine dilemma,” says We need each other, but how do we get close without getting hurt? How do we get past all those quills and grow together in Christ?In Everybody’s Normal Till You Get to Know Them, Ortberg once again reveals his gift for sharing profound insights using a lighten-up approach. With winsome humor and a fondness for well-spun stories, he pops the myth of normalcy and hands us the keys to creating and sustaining relationships. “God’s dream for community encompasses the redemption of all spheres of life,” he says. Who doesn’t want like to be liked, to be wanted, to have solid, satisfying friendships! Ortberg shows what such relationships are made of. He reveals the benefits of authenticity―what it means to live with an “unveiled face,” as the Bible puts it. He encourages us to trade the stones it’s so easy to cast at others for acceptance. He opens our eyes and heart to empathy, the art of reading people. And he takes us through the ins and outs of conflict, forgiveness, confrontation, inclusion, and gratitude.The principles and discussion questions in this book are down-to-earth. They’re for real people living in a real world, and are intended to help us count the practical cost of relationship and then pay it―because in all the rewards and struggles of community, we’re investing in something beyond our comprehension. You could call it heaven. You could call it home. It’s the place where all of us are headed, all of us belong, and all of us will be normal at last.",
  "genres": [
    "Christian",
    "Christian Living",
    "Nonfiction",
    "Christianity",
    "Faith",
    "Relationships",
    "Self Help"
  ],
  "author": "John Ortberg",
  "average_rating": "4.06",
  "url": "https://www.goodreads.com/book/show/11865.Everybody_s_Normal_Till_You_Get_to_Know_Them"
}