{
  "title": "Venture Deals: Be Smarter Than Your Lawyer and Venture Capitalist",
  "description": "Praise for Venture Deals\"My biggest nightmare is taking advantage of an entrepreneur without even realizing it. It happens because VCs are experts in financings and most entrepreneurs are not. Brad and Jason are out to fix that problem with Venture Deals. This book is long overdue and badly needed.\"Fred Wilson, Managing Partner, Union Square Ventures\"Feld and Mendelson pack a graduate-level course into this energetic and accessible book.?The authors' frank style and incisive insight make this a must-read for high-growth company entrepreneurs, early-stage investors, and graduate students.?Start here if you want to understand venture capital deal structure and strategies.?I enthusiastically recommend.\"Brad Bernthal, CU Boulder, Associate Clinical Professor ofLaw, Technology Policy, Entrepreneurial Law\"A must-read book for entrepreneurs.?Brad and Jason demystify the overly complex world of term sheets and M&A, cutting through the legalese and focusing on what really matters.?That's a good thing not just for entrepreneurs, but also for venture capitalists, angels, and lawyers.?Having an educated entrepreneur on the other side of the table means you spend your time negotiating the important issues and ultimately get to the right deal faster.\"Greg Gottesman, Managing Director, Madrona Venture Group\"Venture Deals is a must-read for any entrepreneur contemplating or currently leading a venture-backed company. Brad and Jason are highly respected investors who shoot straight from the hip and tell it like it is, bringing a level of transparency to a process that is rarely well understood. It's like having a venture capitalist as a best friend who is looking out for your best interests and happy to answer all of your questions.\"Emily Mendell, Vice President of Communications,National Venture Capital Association\"The adventure of starting and growing a company can be exhilarating or excruciatingor both. Feld and Mendelson have done a masterful job of shedding light on what can either become one of the most helpful or dreadful experiences for entrepreneursaccepting venture capital into their firm. This book takes the lid off the black box and helps entrepreneurs understand the economics and control provisions of working with a venture partner.\"Lesa Mitchell, Vice President, Advancing Innovation, Kauffman Foundation",
  "genres": [
    "Business",
    "Entrepreneurship",
    "Finance",
    "Nonfiction",
    "Technology",
    "Buisness",
    "Economics"
  ],
  "author": "Brad Feld",
  "average_rating": "4.11",
  "url": "https://www.goodreads.com/book/show/11865558-venture-deals"
}