{
  "title": "The Meaning of Michelle: 16 Writers on the Iconic First Lady and How Her Journey Inspires Our Own",
  "description": "**One of The Huffington Post's 27 Nonfiction Books By Women Everyone Should Read in 2017****One of Glamour's Best Books to Read in 2017****One of Bustle's 17 of the Best Nonfiction Books of 2017****One of BookRiot's '11 Books to Help Us Make It Through a Trump Presidency'** Whenever I think about Michelle Obama, I think, When I grow up, I want to be just like her. I want to be that intelligent, confident, and comfortable in my own skin . Roxane Gay Even after eight years of watching them daily in the press, the fact that the most powerful man in the world is a Black man is still breathtaking to me. The fact that he goes home to a tight-knit, loving family headed by a Black woman is soul-stirring. That woman is Michelle. Michelle. That name now carries a whole world of meaning... From the Preface by Ava DuVernay Michelle Obama is unlike any other First Lady in American History. From her first moments on the public stage, she has challenged traditional American notions about what it means to be beautiful, to be strong, to be fashion-conscious, to be healthy, to be First Mom, to be a caretaker and hostess, and to be partner to the most powerful man in the world. What is remarkable is that, at 52, she is just getting started.While many books have looked at Michelle Obama from a fashion perspective, no book has fully explored what she means to our culture. The Meaning of Michelle does just that, while offering a parting gift to a landmark moment in American history. In addition to a tribute to Michelle Obama, this book is also a rollicking, lively dinner party conversation about race, class, marriage, creativity, womanhood and what it means to be American today.Contributors include: Ava DuVernay, Veronica Chambers, Benilde Little, Damon Young, Alicia Hall Moran and Jason Moran, Brittney Cooper, Ylonda Gault Caviness, Chirlane McCray, Cathi Hanauer, Tiffany Dufu, Tanisha Ford, Marcus Samuelsson, Sarah Lewis, Karen Hill Anton, Rebecca Carroll, Phillipa Soo, and Roxane Gay\"",
  "genres": [
    "Nonfiction",
    "Essays",
    "Feminism",
    "Politics",
    "Biography",
    "Audiobook",
    "History"
  ],
  "author": "Veronica Chambers",
  "average_rating": "3.85",
  "url": "https://www.goodreads.com/book/show/29939375-the-meaning-of-michelle"
}