{
  "title": "Good Friday on the Rez: A Pine Ridge Odyssey",
  "description": "Good Friday on the Rez follows the author on a one-day, 280-mile round-trip from his boyhood Nebraska hometown of Alliance to the Pine Ridge Indian Reservation in South Dakota, where he reconnects with his longtime friend and blood brother, Vernell White Thunder. In a compelling mix of personal memoir and recent American Indian history, David Hugh Bunnell debunks the prevalent myth that all is hopeless for these descendants of Crazy Horse, Red Cloud, and Sitting Bull and shows how the Lakota people have recovered their pride and dignity and why they will ultimately triumph.What makes this narrative special is Bunnell's own personal experience of close to forty years of friendships and connections on the Rez, as well as his firsthand exposure to some of the historic events. When he lived on Pine Ridge at the same time of the American Indian Movement's seventy-one-day siege at Wounded Knee in 1973, he met Russell Means and got a glimpse behind the barricades. Bunnell has also seen the more recent cultural resurgence firsthand, attending powwows and celebrations, and even getting into the business of raising a herd of bison.Substantive and raw, Good Friday on the Rez is for readers who care about the historical struggles and the ongoing plight of Native Americans, and in particular, that of the Lakota Sioux, who defeated the U.S. Army twice, and whose leaders have become recognized as among America's greatest historical figures.Good Friday on the Rez is a dramatic page-turner, an incredible true story that tracks the torment and miraculous resurrection of Native American pride, spirituality, and culture―how things got to be the way they are, where they are going, and why we should care.",
  "genres": [
    "Memoir",
    "Nonfiction",
    "History",
    "Native American",
    "Biography",
    "Native Americans",
    "Friendship"
  ],
  "author": "David Hugh Bunnell",
  "average_rating": "3.87",
  "url": "https://www.goodreads.com/book/show/29939038-good-friday-on-the-rez"
}