{
  "title": "Radical Candor: Be a Kickass Boss Without Losing Your Humanity",
  "description": "Now a New York Times and Wall Street Journal bestseller\"I raced through Radical Candor --It’s thrilling to learn a framework that shows how to be both a better boss and a better colleague. Radical Candor is packed with illuminating truths, insightful advice, and practical suggestions, all illustrated with engaging (and often funny) stories from Kim Scott’s own experiences at places like Apple, Google, and various start-ups. Indispensable.\" ― Gretchen Rubin author of New York Times bestseller The Happiness Project\"Reading Radical Candor will help you build, lead, and inspire teams to do the best work of their lives. Kim Scott's insights--based on her experience, keen observational intelligence and analysis--will help you be a better leader and create a more effective organization.\" ― Sheryl Sandberg author of the New York Times bestseller Lean In\"Kim Scott has a well-earned reputation as a kick-ass boss and a voice that CEOs take seriously. In this remarkable book, she draws on her extensive experience to provide clear and honest guidance on the fundamentals of leading others: how to give (and receive) feedback, how to make smart decisions, how to keep moving forward, and much more. If you manage people--whether it be 1 person or a 1,000--you need Radical Candor . Now.\" ― Daniel Pink author of New York Times bestseller DriveFrom the time we learn to speak, we’re told that if you don’t have anything nice to say, don’t say anything at all. When you become a manager, it’s your job to say it--and your obligation.Author Kim Scott was an executive at Google and then at Apple, where she worked with a team to develop a class on how to be a good boss. She has earned growing fame in recent years with her vital new approach to effective management, Radical Candor.Radical Candor is a simple idea: to be a good boss, you have to Care Personally at the same time that you Challenge Directly. When you challenge without caring it’s obnoxious aggression; when you care without challenging it’s ruinous empathy. When you do neither it’s manipulative insincerity.This simple framework can help you build better relationships at work, and fulfill your three key responsibilities as a leader: creating a culture of feedback (praise and criticism), building a cohesive team, and achieving results you’re all proud of.Radical Candor offers a guide to those bewildered or exhausted by management, written for bosses and those who manage bosses. Taken from years of the author’s experience, and distilled clearly giving actionable lessons to the reader; it shows managers how to be successful while retaining their humanity, finding meaning in their job, and creating an environment where people both love their work and their colleagues.",
  "genres": [
    "Business",
    "Leadership",
    "Nonfiction",
    "Management",
    "Self Help",
    "Audiobook",
    "Personal Development"
  ],
  "author": "Kim Malone Scott",
  "average_rating": "4.06",
  "url": "https://www.goodreads.com/book/show/29939161-radical-candor"
}