{
  "title": "B. S., Incorporated",
  "description": "\"I enjoyed the hell out of this book. It harpoons the bloated, mindlessly self-destructive tendencies of American corporations. But it's also a human story. Which is why--despite the absurdity and arrogance and plain ol' stupidity on display at BSI--I'd kind of like to work there. Are they hiring?\" - Bill Anderson, President, One Voice Creative MediaBusiness Solutions, Inc., is falling apart at the seams. While employees are killing time stalking free snacks and filming porn in the HQ stairwells, the company's co-CEOs bring in shadowy corporate consultants to shake up their business in ways even they don't understand.As the communications manager tasked with translating C-suite doublespeak, Will Evans is constantly torn between his blue-collar warehouse past and his white-collar future. When he is put in charge of rolling out a dubious strategy the consultants brand Optelligence, Will is thrust deep into a muddle of absurdity and responsibility he never expected. Enter Anna Reed, corporate mercenary with heels as high as her ambition. To her, BSI is just a stepping-stone to a better job at a smarter company. Demoted to Will's team on her first day, she's ready to steamroll anyone to get her career back on track.When BSI is pushed to the brink of bankruptcy, Will hatches a covert plan that just might save them all. But he needs Anna's cunning and courage to pull it off. Can Anna, the consummate job jumper, find a reason to go all-in on BSI? Or is she better off bailing and letting the company go down in flames?B.S., Incorporated was so laceratingly dead-on in its satire of corporate culture that it gave me nightmares. Jargon-filled, soulless nightmares. This book absolutely skewers its target. - Jilly Gagnon, coauthor of Choose Your Own Misery: The Office",
  "genres": [
    "Fiction",
    "Contemporary"
  ],
  "author": "Jennifer Rock",
  "average_rating": "4.09",
  "url": "https://www.goodreads.com/book/show/29956440-b-s-incorporated"
}