{
  "title": "No Wall Too High: One Man's Daring Escape from Mao's Darkest Prison",
  "description": "\"A masterpiece.\" ― The Washington Post \"It was impossible. All of China was a prison in those days.\"Mao Zedong’s labor reform camps, known as the laogai , were notoriously brutal. Modeled on the Soviet Gulag, they subjected their inmates to backbreaking labor, malnutrition, and vindictive wardens. They were thought to be impossible to escape―but one man did. Xu Hongci was a bright young student at the Shanghai No. 1 Medical College, spending his days studying to be a professor and going to the movies with his girlfriend. He was also an idealistic and loyal member of the Communist Party and was generally liked and well respected. But when Mao delivered his famous February 1957 speech inviting “a hundred schools of thought [to] contend,” an earnest Xu Hongci responded by posting a criticism of the party―a near-fatal misstep. He soon found himself a victim of the Anti-Rightist Campaign, condemned to spend the next fourteen years in the laogai . Xu Hongci became one of the roughly 550,000 Chinese unjustly imprisoned after the spring of 1957, and despite the horrific conditions and terrible odds, he was determined to escape. He failed three times before finally succeeding, in 1972, in what was an amazing and arduous triumph. Originally published in Hong Kong, Xu Hongci’s remarkable memoir recounts his life from childhood through his final prison break. After discovering his story in a Hong Kong library, the journalist Erling Hoh tracked down the original manuscript and compiled this condensed translation, which includes background on this turbulent period, an epilogue that follows Xu Hongci up to his death, and Xu Hongci’s own drawings and maps. Both a historical narrative and an exhilarating prison-break thriller, No Wall Too High tells the unique story of a man who insisted on freedom―even under the most treacherous circumstances.",
  "genres": [
    "History",
    "China",
    "Nonfiction",
    "Biography",
    "Memoir",
    "Politics",
    "Biography Memoir"
  ],
  "author": "Xu Hongci",
  "average_rating": "4.29",
  "url": "https://www.goodreads.com/book/show/29959015-no-wall-too-high"
}