{
  "title": "Steele",
  "description": "TRIGGER WARNING: This book deals with the sensitive subjects of surviving rape, trauma suffered during combat, child abuse, and possible sterility. If you have issues with these elements, this book might not be for you. Raped. Tortured. Beaten. Essie Santiago’s life fell apart when she was sixteen, and it’s taken eight years to put it back together. There are some pieces that can never be mended; it would take a miracle for her to get pregnant, and physical closeness is something that makes her shudder. Only her love of creating beauty in the form of fashion gets her through the worst of the darkness.When a mortar attack destroyed half his face and all of his life as he knew it, something vital died inside of former Marine, Ezekiel Steele. For years he’s felt nothing… until he sees Essie trying her best to be invisible. But the feisty spark inside the lovely fashion designer is too bright to be concealed, and like a moth to a flame, he’s helpless to resist her.Chicago’s premiere tattoo studio, House Of Payne, is taking the world of fashion by storm, holding a contest to find the best designer the city has to offer. Competition is fierce, but all Essie can concentrate on are Steele’s dirty-talking lessons in sex. But when the student surpasses the master when it comes to love, Steele’s inner demons get the better of him. If he can't face them down, he’ll lose Essie forever.123,000 words***This standalone, mildly erotic contemporary romance contains a dirty-talking Alpha with a penchant for having sex in public places. No cheating, no love triangles and no cliffhangers. Fairy tale HEA guaranteed. Due to adult language and sexual content, this book is not intended for people under the age of 18***",
  "genres": [
    "Contemporary",
    "Romance",
    "Abuse",
    "Contemporary Romance",
    "M F Romance",
    "Military Fiction",
    "Dark"
  ],
  "author": "Stacy Gail",
  "average_rating": "4.23",
  "url": "https://www.goodreads.com/book/show/29953934-steele"
}