{
  "title": "Instinctual",
  "description": "EVERY MAN WANTS HER. MANY WANT TO KILL HER.Good luck to them….In the second beautifully-crafted paranormal romance of this reverse harem epic fantasy series, author Auryn Hadley explores Sal’s gently-morphing relationship to the Black Blades—her comarades-in-arms and lovers (although very little is gentle about their mating). Meanwhile, Sal continues to fight tooth and nail, blades, pikes, and shields… to fiercely protect her newfound family—and to free her people.Now that Sal has won her place in the Black Blades, an elite special ops unit of a superpower race within the army of the Conglomerate of Free Citizens, she’s struggling a bit to navigate her unconventional arrangement with what can only be described as her harem: she has seven devoted warriors and potential lovers to choose from, all of whom would willingly submit to both her command—and her unquenchable desire. First there’s Blaec, Sal’s first lover, who does his best to guide her—with the full understanding that she will eclipse him, and that he must prepare her to do so. But his struggle is the opposite of Sal’s: he is only half iliri, and all-too-human. The salvation of the iliri race and the Conglomerate depends on his ability to walk in both worlds—and to guide Sal to trust her own instincts, to trust what comes naturally. For the matriarchal iliri, what is natural is that Sal is the undisputed leader of her pack. She makes everyone better; she especially makes everyone fight better. Which is welcome news as the Conglomerate faces unspeakably violent attacks from the Emperor of Terric, who wants to exterminate the entire iliri species and is moving to conquer every country between his own and the Conglomerate. All the while, Sal comes closer and closer to what she’s meant to become—the iliri’s only hope. Author Auryn Hadley toes a delicate line throughout Instinctual—it reads as much like an achingly sexy unconventional love story as it does an action-packed military epic (with a distinctly female bent).  And as in any great romance, it’s the developing relationships that shine in these pages—as does Sal herself, one of science fiction’s most ferocious heroines. You’ll fall in love with her a little more with every book you devour.Women readers will thrill to the reverse harem idea that pushes the boundaries of epic dark fantasy in this groundbreaking series that may remind some of Avatar without the scary beasts; or even Game Of Thrones, but happier, with more color—and starring a dazzling female protagonist. Fans of Anne McCaffrey’s Dragonriders of Pern will find Sal’s planet Ogun a thrilling destination for their next fantasy fix.Oh, and by the way: This is a complete novel, not a cliffhanger. Also--because of the exotic sexual instincts of the illiri, it may not be suitable for humans under 18.",
  "genres": [
    "Reverse Harem",
    "Fantasy",
    "Romance",
    "Paranormal",
    "Science Fiction",
    "Aliens",
    "Military Fiction"
  ],
  "author": "Auryn Hadley",
  "average_rating": "4.49",
  "url": "https://www.goodreads.com/book/show/29973951-instinctual"
}