{
  "title": "An Exchange Of Blood",
  "description": "“She was a captive of my desire, a prisoner of my desperate dreams, the only cure for my longing. I wanted her to know that... without doubt, beyond denial, and with all clarity.”\nMy name is Damian Cross.A biker. An outlaw. A one-percenter. The Demon of Rogue Town. You can call me whatever the f@#k you want, but none of them will reveal the full extent of the sins I have committed. I have tortured and killed people for my Club. I have punished everyone who disrespected my brothers. I have ruined a lot of lives just to teach those who opposed us a lesson they should never forget.And I have done these without question, without pity, without remorse.But that was then.Before an incident made me question the life I lived and the choices I made.Before the blood of an innocent tainted my hands.Before she came back to RoTo.Her name is Amy Jones. Years ago, we were lovers. Then, she left without saying goodbye, and I thought I’ve lost her forever.A week ago, she returned, but before we could even reconnect with each other, she was abducted by an enemy of the Club. I had to rescue her. But to do that, I had to seek the help of the Bratva, the Russian mob, the one crew in Rogue Town that our Club should never, ever deal with.I had no choice. Her life was at stake. I made a deal with the Russians without the Club’s knowledge and consent. Now, the Bratva wants us to return the favor, and the Club isn’t inclined to oblige.That’s a big problem.For in a town of rogues and tyrants, a favor owed is an oath scribbled in red... and a favor denied will always result in an exchange of blood.Loyalties will be tested. Relationships will burn. Tragedy will strike. And the secrets I have kept from her will start to unravel.And I begin to fear.Will she still love me once she finds out the truth?An Exchange Of Blood is the second book of the Bastards of Bedlam MC Saga. It is not a standalone story. It is a continuation of the tale started in the first book, A Town Of Rogues. Just like the previous entry, An Exchange Of Blood contains mature themes, scenes of extreme violence, and graphic descriptions of adult acts. If these are okay with you, then saddle up and enjoy the ride!",
  "genres": [],
  "author": "Ora Wilde",
  "average_rating": "3.69",
  "url": "https://www.goodreads.com/book/show/29965108-an-exchange-of-blood"
}