{
  "title": "Debunking Holocaust Denial Theories",
  "description": "DEBUNKING HOLOCAUST DENIAL THEORIES: Two Non-Jews Affirm the Historicity of the Nazi Genocide, by independent researchers and filmmakers James Morcan & Lance Morcan with a foreword by Holocaust survivor Hetty E. Verolme (author of The Children's House of Belsen), aims to end the denial once and for all by tackling the bizarre phenomenon head-on.Written in close consultation with Holocaust survivors and World War Two historians, no stone is left unturned in meticulously verifying the historical facts of the genocide. The Morcans present a wide array of sources including Nazi documentation, eyewitness accounts, scientific reports and shocking photographic evidence to shut down the debate deniers wish to create.One by one, the various arguments Holocaust deniers use to try to discredit wartime records are carefully scrutinized and then systematically disproven. Theories debunked include: the six million death toll figure being an exaggeration; gas chamber exterminations being fictitious; Adolf Hitler and the Third Reich being wrongly vilified; the analysis of Holocaust records being a taboo due to specific laws in Europe criminalizing deniers; “Evil Zionists” and Israel being so powerful that they can censor history. The Holocaust is shown in this book’s pages to be one of the most well-documented and most historically and forensically-proven crimes of the 20th Century. In the process, many of the world’s most infamous deniers, including disgraced British historian David Irving and the former President of Iran Mahmoud Ahmadinejad, are revealed to be nothing but anti-Semites seeking to further denigrate, undermine and demoralize the world’s Jewish population. In this enlightening read that covers more than two millennia of global history, anti-Semitism is shown not only to be the root cause of every form of Holocaust denial, but also the reason for the relentless persecution of the Jews since Biblical times. The authors quote verbatim the often sickening and always baseless comments of kings, emperors, politicians, popes, bishops and muftis about the Jews and why they chose to commit numerous genocides against them over the centuries. These historical quotes prove eerily similar to the vicious anti-Semitic statements made by Holocaust deniers of this era… If you wish to learn more about WW2 and the Nazi extermination camps, if you are confused by all the convoluted conspiracy theories circulating on the Internet about the Holocaust, or if you are currently a denier yourself, then DEBUNKING HOLOCAUST DENIAL THEORIES is a must read.",
  "genres": [
    "History",
    "Holocaust",
    "Nonfiction",
    "World War II",
    "War",
    "Portuguese Literature",
    "Jewish"
  ],
  "author": "James Morcan",
  "average_rating": "4.21",
  "url": "https://www.goodreads.com/book/show/29973978-debunking-holocaust-denial-theories"
}