{
  "title": "Agony of Being Me",
  "description": "New Release on Amazon * Kindle * PaperbackFor some girls, life is a romance novel; for others, a horror story. Zoe Channing has it all: beauty, brains, talent. She owns the heart of high school hottie, Jesse Sinclair. She’s the star of the school play, with love at her fingertips, but just before her sixteenth birthday, tragedy strikes, setting her on a solo course back from the hell that replaced her heaven. Can a soul withstand so much torment? A mind such terror? A body such physical agony?Agony of Being Me is Part One. Finding You, Part Two.*** Zoe is like a sudden storm that charges the air, leaving it sweet and fresh. Plain and simple, Zoe is pure energy.—Jesse And the moment is pure magic. I’m not Zoe. I’m someone like Claudette. I have no past. There’s just tonight. No party. No one else in the world. Just Jesse and me. Me and Jesse. And I’m about to be kissed like a woman. Made love to like I’m something precious. —Zoe The wheels in my head start spinning, I want to do so many things with her. To her. Kissing her within the next five minutes is exactly how I planon starting.—Jesse ***Warning: Contains one sexual assault scene. Two book set. You should read Agony of Being Me before reading the conclusion in Finding You.The bathroom door squeaks shut. Now I’ll have to walk into class like a loser, with everyone’s eyes on me, is the only thought plaguing my mind. I haven’t taken two steps when I feel the ominous presence behind me. Before I can spin to confront the danger, one massive hand comes around my waist, while the other slams over my mouth. My lips are crushed against my teeth. My head is jerked up, the involuntary movement almost snapping my neck. Bite! My mind screeches. Kick! Scream! But my mouth is sealed shut, so the only sound I can manage is a grunt. I can’t turn my head which is in a vice-like grip. I can’t move my arms, as they are suddenly pinned tightly to my sides. Oh God. What’s happening to me? Help me. Someone help me!",
  "genres": [
    "Young Adult"
  ],
  "author": "Victoria Valentine",
  "average_rating": "4.76",
  "url": "https://www.goodreads.com/book/show/29967628-agony-of-being-me"
}