{
  "title": "The Complete Judas Chronicles: Books One Through Seven",
  "description": "\"Out-freaking-standing-excellent!\" ~ Detra Fitch of Huntress Reviews***All SEVEN bestselling novels detailing the immortal Judas Iscariot's perilous adventures as William Barrow, in search of the blood coins paid to him long ago for betraying Jesus Christ.This collection contains the following supernatural 1) Immortal Plague2) Immortal Reign3) Immortal Destiny4) Immortal Dragon5) Immortal Tyranny6) Immortal Pyramid7) Immortal VictoryAcclaim for the novels of Aiden \"The intense writing style of Aiden James kept my eyes glued to the story and the pages seemed to fly by at warp speed. ...Twists, turns, and surprises pop up at random times to keep the reader off balance. It all blends together to create one of the best stories I have read all year.\"--Detra Fitch, Huntress Reviews for \"The Devil's Paradise\"\"Aiden James has written a deeply psychological, gripping tale that keeps the readers hooked from page one.\"--Bookfinds review for \"The Forgotten Eden\"\"Aiden James writing style flows very easily and I found that \"Cades Cove\" snowballed into a very gripping tale. Clearly the strengths in the piece were as the spirit's interaction became prevalent with the family... The Indian lore and ceremonies and the flashbacks to Allie Mae's (earthly) demise were very powerful. I think those aspects separated the work from what we've seen before in horror and ghost tales.\"--Evelyn Klebert, author of \"A Ghost of a Chance\" and \"Dragonflies\"\"Aiden James has a keen eye for detail and an uncanny knack for scaring the hell out of me. We are watching a master at work. \"The Raven Mocker\" is a nearly perfect thriller. Ghost stories don't get any better than this.\"--J.R. Rain, Bestselling author of the \"Vampire for Hire\" series\"As with the previous titles I have read by this author, I found the author's writing style to be silky smooth and the main plot line to be extremely creative. The fertile imagination of Aiden James definitely knows what today's readers want to see in their stories.\"--Detra Fitch, Huntress Reviews for \"The Vampires' Last Lover\"",
  "genres": [],
  "author": "Aiden James",
  "average_rating": "4.03",
  "url": "https://www.goodreads.com/book/show/29984035-the-complete-judas-chronicles"
}