{
  "title": "The Ugly Princess: The Legend of the Winnowwood",
  "description": "What would you give up to be beautiful? I don’t mean attractive, or pretty or any other term you could conjure up to describe that thing most women seek to be or most men seek to be with. I mean staggeringly beautiful, men falling at your feet with hopeless adoration as they gaze upon you dumbfounded. That beautiful. I could become that beautiful if I chose, but only with a steep price. Would you pay the price? Does that call to your heart?  It doesn’t call to mine. Yes, when I look at the girl in the mirror, I see a young woman of average height and slight build. I see her lovely emerald green eyes and I see her coarse, orange hair poking out in all directions like some unnatural haystack. I see the forty-seven warts that line her face, which accompany one large lump and two small boils. You’d probably think that I would be more than eager to trade for the great gift of beauty because I know some, if not all of you, would call me hideous. But I don’t think of myself as ugly.  I think of myself as powerful, strong and fierce – for I have magical powers – powers that amaze and terrify me at times. And today is the most important day of my life, because today my mother will say the words over me and seal my fate. For I, Olive, am the last of the Winnowwood and this is my story.   Based on the award winning screenplay of the same name, The Ugly Princess will take you on an amazing adventure filled with twists, turns and an ending that will take your breath away because it is also a love story of the most unusual, magical kind.  “In the tradition of The Princess Bride (with somewhat less whimsy) and The Girl Who Circumnavigated Fairyland in a Ship of Her Own Making, Smith’s debut is a fairy tale in a new world…. The twists along this charming road make for an enchanting journey.” -- Kirkus Reviews --",
  "genres": [
    "Fantasy",
    "Young Adult",
    "Romance",
    "Fiction",
    "Magic",
    "Fairy Tales",
    "Middle Grade"
  ],
  "author": "Henderson Smith",
  "average_rating": "4.17",
  "url": "https://www.goodreads.com/book/show/29983681-the-ugly-princess"
}