{
  "title": "Africa's Child",
  "description": "Discover a Heartfelt Memoir That Explores the Power of the Human Spirit Abandoned as an infant and raised in an orphanage in the Usambara Mountains of Tanzania, East Africa, Maria Nhambu suffered bullying, life-threatening illness, physical, emotional and sexual abuse, and racial discrimination for being a mixed-race child. Life in the orphanage was difficult and at times dangerous, yet Nhambu (she now goes by her African last name) did not let that break her soul. Instead, she made a vow to love and care for herself—a decision that radically changed her life. Growing up in the orphanage, Nhambu developed two great dance and the pursuit of formal education. Attracted by the music from the neighboring tribal village, Nhambu observed and felt the power of African dance. Although it was forbidden to dance the African way at the orphanage, she practiced in secret and used dance to nourish her spirit through years of loneliness, abandonment, and uncertainty about her identity. Her intense desire for education enabled her to continue in school despite the fact that schooling for girls at the time was not common. Nhambu recounts how she, at age nineteen, met a twenty-three-year-old American high school teacher who would bring her to the United States for university studies and a new life in the United States. Filled with tears, wisdom, warmth and laughter, Africa’s Child , the first book in the Dancing Soul Trilogy , gives readers an inspiring message of courage, faith, hope and resilience. Nhambu invites you on a journey through her tumultuous childhood, revealing how she triumphed over tragedy and found courage through the remarkable healing power of African dance and her profound belief in the power of loving oneself. America’s Daughter, the second book of the trilogy, reveals her encounter with life in the United States where she finds love and family and creates Aerobics With Soul®, a fitness program based on African dance. In Drum Beats, Heart Beats , she encounters the full mystery of her origins and deals with intense personal challenges. Her award-winning memoir, which offers a unique, international insight into prejudice and racism, has inspired readers worldwide.",
  "genres": [
    "Memoir",
    "Nonfiction",
    "Africa",
    "Race",
    "Contemporary",
    "Book Club",
    "Biography"
  ],
  "author": "Maria Nhambu",
  "average_rating": "4.30",
  "url": "https://www.goodreads.com/book/show/29977617-africa-s-child"
}