{
  "title": "The Gita Way- Secret Recipe to achieve the purpose of life",
  "description": "'The Gita Way' is an irreligious take on the tenets of the Bhagavad Gita. Without delving into either mythological or God-centric discourse, the book attempts to understand and explain various insights from the Gita through, in the author's words, derived theory and application. The Gita Way attempts to shed light on matters of self-realisation, and identifying and following the path to achieve the purpose of life. Within the framework of Vedic philosophy represented by Gita, this book explores:How to discover the swa-bhava, the inherent natural strength of our real-self?Is my profession aligned with my swa-bhava? What is my purpose of life?What is the real meaning of moksha, the liberation? How the realization of individual purpose leads us to attain supreme purpose we are born to achieve? Using the principles of Gita, this book presents innovative findings on theory of prarabdha, the luck or destiny, role of knowledge and karma, continuous improvement, yoga of universal harmony and yoga of devotion. To highlight few, in chapter combined discipline of knowledge and karma, authors introduce most important part of their research—Centring. Centring summarizes power of combined application of yoga of knowledge and karma along with simplified theory of spirit and supreme spirit. Chapter Vision of Universal Form and Yoga of Liberation simplifies the meaning of moksha, the state of liberation by linking it to the attainment of supreme purpose of life. Chapters on Yoga of Devotion and Continuous improvement focus on recipe of staying on the unique path of achieving individual goal. Unlike other books on Bhagavad Gita, the Gita Way is not a chapter wise discourse. Instead it presents deduced concepts in first place supported with relevant reference from the whole Gita. For example, in the first chapter of the Gita Way, you may get a reference of last chapter of Gita relevant to the topic of discussion.Contents:1. INTRODUCTION TO ‘THE GITA WAY’ 11Development of ‘The Gita Way’ 17 2. DEVELOPING A SENSE OF PURPOSE IN LIFE 25Goal 28Finding Unique Strength and Developing It 32Joy of the Self-Hobby vs Profession 35How to Set a Goal? 39Doubt in any form is the Biggest Enemyto Self-realisation 45The Story of Barbarika: Why was Barbarika Sacrificed? 47 3. YOGA OF KNOWLEDGE 51Knowledge of Self 54Elements of Self 56Consciousness of Self-Identity 57Intellect 60Primordial Matter 62Source of Perception and Action, One Mind and Five Senses 63Physical Body and Fitness 63False Goals such as Desire, Aversion and Pleasure 64Required Qualities in Self 64How Does One Achieve ‘Absolute Knowledge’? 67Lack of Knowledge is Ignorance which creates Fear 71 4. KARMA YOGA 74Prescribed Act and Prohibited Act 76Yoga and the Attributes of a Yogi 79How does One Achieve Equipoise? 80Desire-Entrap 84Hierarchy of Control 86Theory of Prarabdha or Destiny 88Butterfly Effect 90Hurdles in the Path of Karma-Yoga 93Vikarma 95Law of Growth 96Ultimate Dispassion: Nishkam Karma 97How to stay on the Path of Karma-Yoga? 99 5. COMBINED DISCIPLINE OF KNOWLEDGE AND KARMA 101Self-Realisation 102Wisdom 104Sacrifice 108Centring and Power of Real-Self 112Power of Real-self 113Centring 116Yoga of Self-Control 119 6. YOGA OF DEVOTION 121 The Cycle of Liberation 123How does devotion come to us? 127Devotion to Tame the Mind 129Relevance of Devotion to the Theory of Prarabdha 130Symptoms of Lack of Devotion 134 7. VISION OF THE UNIVERSAL FORM 136Universal Form of Goal 140Concept of Self 147Redirecting the Purpose of Desire 150 8. CONTINUOUS IMPROVEMENT ON THREE MODES OF NATURE 152Inner Purification by Knowing Sattva, Rajas and Tamas 159Sattva 159Rajas 161Tamas 164The Gita Way of Continuous Improvement 165Elimination of Waste 166 9. YOGA OF LIBERATION 170How is Sattva linked with the Supreme Goal? 173How does one attain sattva? 174Non-violence in thoughts and Action. 175Absence of Pride 175Internal and External Purity 176Steadfastness of Mind 176Control of Body, Mind and Senses 176Sincerity 177Forbearance 177Uprightness of Speech and Mind 177Devout Service to the Preceptor 177 Austerity of Mind 178Sattvika Intellect 178Sattvika Sacrifice 179Leadership by Creating Order Around 180 Yoga of Liberation 182",
  "genres": [
    "Spirituality",
    "Hinduism",
    "Religion",
    "Philosophy",
    "Mythology",
    "India",
    "Indian Literature"
  ],
  "author": "Shweta Chandra",
  "average_rating": "3.83",
  "url": "https://www.goodreads.com/book/show/29982186-the-gita-way--secret-recipe-to-achieve-the-purpose-of-life"
}