{
  "title": "insideout coaching",
  "description": "In this inspirational yet practical book, the man Parade called “the most important coach in America,” subject of the national bestseller Season of Life, Joe Ehrmann, describes his coaching philosophy and explains how sports can transform lives at every level of play, from the earliest years to professional sports.Coaches have a tremendous platform, says Joe Ehrmann, a former Syracuse University All-American and NFL star. Perhaps second only to parents, coaches can impact young people as no one else can. But most coaches fail to do the teaching, mentoring, even life-saving intervention that their platform provides. Too many are transactional coaches; they focus solely on winning and meeting their personal needs. Some coaches, however, use their platform. They teach the Xs and Os, but also teach the Ys of life. They help young people grow into responsible adults; they leave a lasting legacy. These are the transformational coaches. These coaches change lives, and they also change society by helping to develop healthy men and women.  InSideOut Coaching explains how to become a transformational coach. Coaches first have to “go inside” and articulate their reasons for coaching. Only those who have taken the InSideOut journey can become transformational. Joe Ehrmann provides examples of coaches in his life who took this journey and taught him how to find something bigger than himself in sports.He describes his own InSideOut experience, starting with the death of his beloved brother, which helped him understand how sports could transcend the playing field. He gives coaches the information and the tools they need to become transformational.  Joe Ehrmann has taken his message about the extraordinary power of sports all over the country. It has been warmly endorsed by NFL head coaches, athletic directors at major universities, high school head coaches, even business groups and community organizations. Now any parent-coach or school or community coach can read Ehrmann’s message and learn how to make sports a life-changing experience.",
  "genres": [
    "Sports",
    "Leadership",
    "Nonfiction",
    "Psychology",
    "Football",
    "Education",
    "Self Help"
  ],
  "author": "Joe Ehrmann",
  "average_rating": "4.25",
  "url": "https://www.goodreads.com/book/show/11868594-insideout-coaching"
}