{
  "title": "Tolstoy: Bir Rus Hayatı",
  "description": "Lev Nikolayeviç Tolstoy (1828-1910) roman sanatının en büyük yazarlarından ve tarihin en etkili aydınlarından biridir. Bundan başka anarşist düşünür, devrimci eğitimci, ateşli yardımsever, savaş muhabiri, uzman çiftçi, arıcı, hatta hatta peygamber gibi sıfatlar da rahatlıkla kendisine yakıştırılabilir. Uzun süren yaşamı boyunca sadece yazmakla kalmamış, örneğin Rusya’daki korkunç kıtlığa karşı mücadele başlatmış; adaletsizliğe, militarizme, çarlık rejimine ve kiliseye meydan okumuş, otoriteye ve her tür baskıcı rejime karşı gelerek, Gandhi, Martin Luther King gibi, tarihin seyrini değiştirecek liderlere esin kaynağı olmuştur. Rosamund Bartlett, bu çarpıcı Tolstoy biyografisinde, uçsuz bucaksız Rus topraklarına bile sığamayan bir devin ayak izlerini takip ediyor. Tolstoy’u, çarlık rejiminin sallantıda, dini kurumların çökmekte olduğu bir Rusya tablosunun içinde resmederek, romanlarını, düşüncelerini, inançlarını ve “pasif direniş” gibi görüşlerini bu bağlam içinde ele alıyor. Buna ek olarak, kısa süre önce halka açılan Sovyetler Birliği Arşivleri’nden faydalanıp, bir öğreti olarak “Tolstoyculuk” hakkında yepyeni ve oldukça çarpıcı bilgiler ortaya çıkarıyor. Çağdaş ekoloji anlayışını, doğayla uyumlu yaşam arayışlarını derinden etkileyen “Tolstoyculuk” öğretisinin geçmişini, Bolşevik devriminde oynadığı rolü ve –takipçilerinin yaşadığı onca baskı ve kıyıma rağmen– bugünlere gelişini gözler önüne seriyor. “Tolstoy'u okuduğum bütün biyografilerinden çok daha canlı resmediyor… Tolstoy'un hayatının her döneminde kendimizi devasa bir kişiliğin huzurunda hissediyoruz… Bartlett sabırla Rus toprağının, çayırlarının kokusunu burnumuza getirirken her sahneyi ince ince dokuyor.” A. N. Wilson, Financial Times“18. yüzyılın sonundan 20. yüzyıla, Rusya’nın sosyal ve kültürel tarihinin akıcı ve zekice anlatılmış öyküsü… Bartlett’ın yalın ve ince üslubu kitabın bütününde kendini hissettiriyor.” Mary Dejevsky, Independent “Yeni ayrıntılarla dolu, akıcı bir üslupla yazılmış muhteşem bir kitap. Rus yazarlarının en büyüğünü farklı bir bakış açısıyla ele alıyor.” Jay Parini, Son İstasyon’un yazarı",
  "genres": [
    "Biography",
    "Nonfiction",
    "History",
    "Russia",
    "Russian Literature",
    "Literature",
    "Russian History"
  ],
  "author": "Rosamund Bartlett",
  "average_rating": "4.16",
  "url": "https://www.goodreads.com/book/show/10196883-tolstoy"
}