{
  "title": "One by One from the Inside Out : Essays and Reviews on Race and Responsibility in America",
  "description": "America stands poised on the brink of an explosive period in race relations. Affirmative action, for a generation the major public-policy program aimed at reducing the disparity between blacks and whites, has been under strong intellectual and institutional attack by its critics and is very likely soon to be consigned to the dustbin of history. Glenn Loury views this crisis as an opportunity to move beyond our racial myopia, to assess our progress and take stock of our failures. In \"One by One from the Inside Out\", a pointed and often eloquent look at race in America, Loury calls on Americans of all races to break free of the rhetorical box created by obsession with preferential policies. In a gripping commentary that transcends the simplistic labels \"liberal\" and \"conservative\", Loury assails the appalling absence of candid discourse on sensitive racial issues.In an important opening chapter, Loury posits that black American history is defined by the conflict between two important ideas. One, advocated by Booker T. Washington, argues for blacks to earn equality and acceptance through achievement. The other, associated with W.E.B. Du Bois and adopted by the civil rights movement as well as black-power groups, urges blacks to demand and agitate for all legal, social, and economic rights. White acceptance, if it mattered at all, would follow. Seeking to rescue Washington's views from ignominy, Loury argues that it is now time to restore a balance between the two great traditions and to build a new civil rights consensus around the notion of black self-improvement.\"One by One from the Inside Out\" takes a hard and critical look at the controversies surrounding such issue as black-Jewish relations, welfare reform, the racial dimension in academic performance and in crime, black dependence on public assistance, the changing nature of family structure among blacks and whites, and the growing concern over \"hate speech\" on college campuses and elsewhere. Urging blacks to be more willing to compete on their very real merits-- and asking whites to overcome their obsession with \"color-blind\" and \"color-conscious\" policies-- Loury argues that we have failed as a nation to develop a consensus that would ensure equality of opportunity for black Americans while upholding the integrity of our democratic system.\"One by One from the Inside Out\" is one brave man's moving call for all Americans to rethink their attitudes toward race, and it presents a clear and compelling vision of how to heal our country's most divisive wound.",
  "genres": [
    "Nonfiction",
    "Race"
  ],
  "author": "Glenn C. Loury",
  "average_rating": "3.91",
  "url": "https://www.goodreads.com/book/show/299829.One_by_One_from_the_Inside_Out_"
}