{
  "title": "Hart's Desire",
  "description": "THIS IS BOOK 1 OF A 3 BOOK SAGA.\"With never a dull moment in the whole series, theses books were completely addicting and I found myself quite unable to put them down!\" ~The Silver Dagger ScriptoriumAn independent young lady meets a bold merchant captain pursued by a band of Caribbean pirates...what could possibly go wrong?After a daring escape, Captain Landon Hart sails the Desire to Charleston for repairs and to keep a mysterious appointment with a plantation owner. He meets a sword-wielding, fiery-haired temptress on the way, and he isn't prepared for the impact she has on his tightly guarded heart...nor the trouble she manages to attract.Keelan Grey had a solid plan that would save her from an arranged marriage to a cruel plantation owner until a deathbed confession from a loved one plunges her into a dark plot of deception and revenge. Desperate for help, Keelan finds an unlikely ally in the exasperating but irresistible sea captain. But while she trusts him with her life, can she trust him with her secrets?Hart's Desire is set just prior to the War of 1812, when privateers sailed the seas looking for enemy merchant ships to plunder. Hart's Desire is a story about a young woman from England, who's suddenly thrust into plantation life as the daughter of the plantation owner. Hart's Desire is rich with fascinating insights into the Low Country of Charleston, the food, the medicines and the lifestyles of the people of that time. Keelan is a very independent woman who is determined to avoid a marriage of convenience. Landon and his business partner dock their ships in the Charleston harbor for repairs. Weeks earlier the merchant fleet owner, Landon's mentor, set up a mysterious appointment with George Grey of Twin Pines plantation-Keelan's father. It is this meeting which forces Landon and Keelan's paths to cross.  Keelan has been well-tutored by her father's valet, and not only can she read, write and keep the accounts for the plantation, but she can also fence and defend herself with a dagger. Romance readers will love this spunky heroine and the scoundrel who can't help but fall in love with her!\"An absolutely breathtaking series!\"",
  "genres": [
    "Historical Romance",
    "Romance",
    "Pirates",
    "Historical",
    "Historical Fiction",
    "Suspense"
  ],
  "author": "Chloe Flowers",
  "average_rating": "3.98",
  "url": "https://www.goodreads.com/book/show/29991453-hart-s-desire"
}