{
  "title": "اختلاس",
  "description": "الناشر:\"اختلاس\" رواية تتحدث عن القضايا الحساسة في المجتمع السعودي بطلها صحافي سعودي يعيش في لندن ويرأس تحرير مجلة نسائية، يستلم رسائل غريبة من قارئة سعودية تكشف فيها الكثير من المخفي من حياتها، علاقاتها، وأفكارها هي تبحث عن طريقة تعبر فيها عن المكبوت في صدرها أمام مجتمع جاف أو مجحف مع المرأة. هي تريد أيضاً الاعتراف بفشلها، وبذنبها على خطيئة ربما رتكبتها مع سائقها.رئيس التحرير يستمتع بقراءة الرسائل، على أمل ان يتصل بعلاقة بكاتبتها يوماً ما... لكنه في الوقت ذاته يقيم علاقة مع فتاة إسبانية، ثم أخرى إيطالية، إلى أن يجد نفسه صورة هو الآخر عن الرجل الشرقي السعودي الذي تهرب منه كاتبة الرسائل. إنه باختصار يتعرى أمام نفسه، كما هي قارئته تتعرى أمام ذاتها.الرواية وإن كشفت جانباً مستوراً في المجتمع السعودي، فإنها عمل روائي ونص أدبي محض لا يستهدف الإثارة. حيث يعمد كثيرون إلى الخلط بين العمل الروائي الأدبي وبين العمل الاستفزازي في الكتابة، بحيث تصبح الإثارة هي الهدف لا العمل الأدبي بحد ذاته. وهذا ما يجب أن يؤخذ بعين الاعتبار عند قراءة رواية اختلاس. لأنها قائمة على قصة حقيقية لا يخالطها سوى ما يتفق أو تتطلبه الحبكة الروائية.\"اختلاس\" رواية تكشف أكثر من صورة أمام القارئ، العربي أو الغربي بعد صدور نسخة باللغة الإنجليزية في مطلع العام المقبل، إضافة إلى نسخة فرنسية.\"اختلاس\" تكشف كيف يفكر المجتمع السعودي بالنسبة للمرأة وكيف ينشأ الفكر الديني المتطرف وكيف هو البيت الواحد يكاد يكون مقسوماً على ذاته وإن بقيت هيكله متماسكاً.\"اختلاس\" تكشف أيضاً لماذا تكون هناك خيانة زوجية وكيف هي هذه الخيانة ومع من وكيف يدفع الزوج زوجه إلى هذا الطريق دون أن يدرك.تريد الرواية أن توجه رسالة إلى الرجل تقول له احذر من سوء تفكيرك. وتريد أن توجه رسالة للمرأة تقول لها: الرجال لا يختلفون أمام الخيانة، لكن المرأة تختلف. فهي إن ارتضت ظلم الرجل لها، وخيانته لها، فهي تستحق الظلم إذاً لأن هذا الأخير عمل اختياري. فمن ارتضي الظلم استحقه.المؤلف:كثيراً ما كنت أشعر أن الحياة تكرّر نفسها دون إرادة منا. أتخيل الله يهبنا الفرصة لإعادة اكتشاف أنفسنا، والتخلص من خطاينا، لنصبح أكثر نقاءً وقرباً منه.لكن ذلك لا يأتي دون الاعتراف بهذه الخطايا التي ستتكرر بدورها إن بقينا مختبئين وراء الممنوع بلا سبب، والحرام في غير حرمة!ربما يشاركنا الآخرون في الخطايا نفسها. لكن دورنا ليس إصلاح ثقوب الكرة الأرضية، بل إصلاح ثقوبنا نحنا وليصلح الآخرون ثقوبهم.هي محاولة للعلاج إذاً، لكني لن أكون الطبيب هنا، بل لعلني المريض أكثر مني الطبيب. وكلي ثقة أن المريض هو أفضل طبيب لدائه.كلّنا اليوم يختلس شيئاً من الآخر: قبلة، نظرة، أو ابتسامة رغبة.وبالنسبة إليّ أنا فقد اختلست روايتي من كل ذلك، وأيضاً، من قصص امتزج فيها الواقع بالخيال فأصبحت واقعاً محضاً، فمن قال إن نصف الواقع المحض ليس خيالاً محضاً؟",
  "genres": [
    "Novels",
    "Fiction"
  ],
  "author": "هاني نقشبندي",
  "average_rating": "3.20",
  "url": "https://www.goodreads.com/book/show/2998921"
}