{
  "title": "Napoleon in Egypt",
  "description": "“Europe is a molehill….”Everything here is worn out…tiny Europe has not enough to offer.We must set off for the Orient; that is where all the greatest glory is to be achieved.” —NapoleonNapoleon’s invasion of Egypt was the first Western attack in modern times on a Middle Eastern country. In this remarkably rich and eminently readable historical account, acclaimed author Paul Strathern reconstructs a mission of conquest inspired by glory, executed in haste, and bound for disaster.In 1798, Napoleon Bonaparte, only twenty-eight, mounted the most audacious military campaign of his already spectacular career. With 335 ships, 40,000 soldiers, and a collection of scholars, artists, scientists, and inventors, he set sail for Egypt to establish an Eastern empire in emulation of Alexander the Great. Like everything Napoleon ever attempted, it was a plan marked by unquenchable ambition, heroic romanticism, and not a little madness. Napoleon saw himself as a liberator, freeing the Egyptians from the oppression of their Mameluke overlords. But while Napoleon thought his army would be welcomed as heroes, he tragically misunderstood Muslim culture and grossly overestimated the “gratitude” he could expect from those he’d come to save. Instead Napoleon and his men would face a grim war of attrition against an ad hoc army of Muslims led by the feared Murad Bey. Marching across seemingly endless deserts in the shadow of the pyramids, suffering extremes of heat and thirst, and pushed to the limits of human endurance, they would be plagued by mirages, suicides, and the constant threat of ambush. A crusade begun in honor and intended for glory would degenerate toward chaos and atrocity.But Napoleon’s grand failure in Egypt also yielded vast treasures of knowledge about a culture largely lost to the West, and through the recovery of artifacts like the Rosetta Stone, it prepared the way for the translation of hieroglyphics and modern Egyptology. And it tempered the complex leader who believed it his destiny to conquer the world. A story of war, adventure, politics, and a clash of cultures, Paul Strathern’s Napoleon in Egypt is history at once relevant and impossible to put down.From the Hardcover edition.",
  "genres": [
    "History",
    "Nonfiction",
    "Egypt",
    "Africa",
    "France",
    "Military Fiction",
    "Biography"
  ],
  "author": "Paul Strathern",
  "average_rating": "4.18",
  "url": "https://www.goodreads.com/book/show/3001909-napoleon-in-egypt"
}