{
  "title": "Walking with Abel: Journeys with the Nomads of the African Savannah",
  "description": "Named a Top Summer Reading Pick by the\"Los Angeles Times, Playboy, Esquire, Christian Science Monitor, Vol 1. Brooklyn, \"BBC.com, and\"Mental Floss\" An intrepid journalist joins the planet s largest group of nomads on an annual migration that, like them, has endured for centuries. Anna Badkhen has forged a career chronicling life in extremis around the world, from war-torn Afghanistan to the border regions of the American Southwest. In \"Walking with Abel,\" she embeds herself with a family of Fulani cowboys nomadic herders in Mali s Sahel grasslands as they embark on their annual migration across the savanna. It s a cycle that connects the Fulani to their past even as their present is increasingly under threat from Islamic militants, climate change, and the ever-encroaching urbanization that lures away their young. The Fulani, though, are no strangers to uncertainty brilliantly resourceful and resilient, they ve contended with famines, droughts, and wars for centuries. Dubbed Anna Ba by the nomads, who embrace her as one of theirs, Badkhen narrates the Fulani s journeys and her own with compassion and keen observation, transporting us from the Neolithic Sahara crisscrossed by rivers and abundant with wildlife to obelisk forests where the Fulani s Stone Age ancestors painted tributes to cattle. As they cross the Sahel, the savanna belt that stretches from the Indian Ocean to the Atlantic, they accompany themselves with Fulani music they download to their cell phones and tales of herders and hustlers, griots and holy men, infused with the myths the Fulani tell themselves to ground their past, make sense of their identity, and safeguard their our future. \"From the Hardcover edition.\"\"",
  "genres": [
    "Nonfiction",
    "Travel",
    "Africa",
    "Memoir",
    "Mali",
    "History",
    "Cultural"
  ],
  "author": "Anna Badkhen",
  "average_rating": "3.63",
  "url": "https://www.goodreads.com/book/show/30008742-walking-with-abel"
}