{
  "title": "Red Harvest",
  "description": "When the last honest citizen of \"Poisonville\" was murdered, the Continental Op stayed on to punish the guilty—even if that meant taking on an entire town. The Op was in Personville, derogatory nickname aside, as the result of a letter to the Continental Detective Agency in San Francisco from Donald Willsson, publisher of the local paper, asking for an agent to visit. No other information. As soon as the OP arrives, the body count begins and it starts with his client! 'Red Harvest' is more than a superb crime novel; it is a classic exploration of corruption and violence in America and one of the greats of 20th century literature.Librarian's note #1: this entry relates to the novel 'Red Harvest.' Collections, and other Hammett stories can be found elsewhere on Goodreads.Librarian's note #2: the two serialized novels are: 1. The Cleansing of Poisonville (which later became Red Harvest), and 2. The Dain Curse.Librarian's note #3: there are a total of 28 Continental Op short stories plus one incomplete; they can be found by searching GR for: 'a Continental Op Short Story.' They are: 1. Arson Plus, 2. Crooked Souls, 3. Slippery Fingers, 4. It, 5. Bodies Piled Up, 6. The Tenth Clew, 7. Night Shots, 8. Zigzags of Treachery, 9. One Hour, 10. The House on Turk Street, 11. The Girl with the Silver Eyes, 12. Women, Politics & Murder, 13. The Golden Horseshoe, 14. Who Killed Bob Teal? 15. Mike or Alec or Rufus, 16. The Whosis Kid, 17. The Scorched Face, 18. Corkscrew, 19. Dead Yellow Women, 20. The Gutting of Couffignal, 21. Creeping Siamese, 22. The Big Knock-Over, 23. $106,000 Blood Money, 24. The Main Death, 25. This King Business, 26. Fly Paper, 27. The Farewell Murder, 28. Death and Company and, 29. Three Dimes (unfinished).",
  "genres": [
    "Mystery",
    "Fiction",
    "Crime",
    "Noir",
    "Classics",
    "Detective",
    "Thriller"
  ],
  "author": "Dashiell Hammett",
  "average_rating": "3.95",
  "url": "https://www.goodreads.com/book/show/30005.Red_Harvest"
}