{
  "title": "The Ladies of the Camellias",
  "description": "A Comedy for a cast of 7 men and 3 women. An hilarious farce about an imagined meeting in Paris, 1897, between the famous theater divas Sarah Bernhardt and Eleonora Duse. The two actresses—who were the biggest and most temperamental stars of their day—were scheduled to perform back-to-back productions of the play, The Lady of the Camellias, by Alexandre Dumas. Duse's production will be performing in Bernhardt's theater, and the two women are in their own dressing rooms at the theater, though they have yet to meet. The members of both acting companies expect huge fireworks between the two grand dames, and do what they can to avoid being in the way. Into this tense situation comes Ivan, a young Russian anarchist who threatens to blow up everyone in the theater—especially the two divas—unless his comrades are released from prison. Bernhardt and Duse must meet and greet each other for the first time as they are taken hostage by the armed Ivan, yet remain the ultimate theater professionals. Ivan's ranting aside, the anarchist seems to know an awful lot about the theater, raising suspicions amongst the actors. Indeed, Ivan turns out to be a new breed of theater person, someone who the actors and playwright deride as useless and as a passing a director. In a salute to the community of actors, Benoit Constant Coquelin, who is playing Cyrano De Bergerac, sneaks into the melee, and, in full costume, challenges Ivan to a duel. A rapier is no match for a gun and bomb, so it is theatrical dialogue they all must use to try and convince Ivan to let them go. When word arrives that the authorities will not trade the lives of even such famous actors for their prisoners, Sarah, feeling sorry for Ivan, offers to give him a letter of recommendation to a theater in a faroff country and show him how to escape through her secret passageway.",
  "genres": [
    "Plays"
  ],
  "author": "Lillian Garrett-groag",
  "average_rating": "3.87",
  "url": "https://www.goodreads.com/book/show/300182.The_Ladies_of_the_Camellias"
}