{
  "title": "No Straight Lines: Four Decades of Queer Comics",
  "description": "Queer cartooning encompasses some of the best and most interesting comics of the last four decades, with creators tackling complex issues of identity and a changing society with intelligence, humor, and imagination. This book celebrates this vibrant artistic underground by gathering together a collection of excellent stories that can be enjoyed by all.No Straight Lines showcases major names such as Alison Bechdel (whose book Fun Home was named Time Magazine's 2006 Book of the Year), Howard Cruse (whose groundbreaking Stuck Rubber Baby is now back in print), and Ralf Koenig (one of Europe's most popular cartoonists), as well as high-profile, cross-over creators who have dabbled in LGBT cartooning, like legendary NYC artist David Wojnarowicz and media darling and advice columnist Dan Savage. No Straight Lines also spotlights many talented creators who never made it out of the queer comics ghetto, but produced amazing work that deserves wider attention.Until recently, queer cartooning existed in a parallel universe to the rest of comics, appearing only in gay newspapers and gay bookstores and not in comic book stores, mainstream bookstores or newspapers. The insular nature of the world of queer cartooning, however, created a fascinating artistic scene. LGBT comics have been an uncensored, internal conversation within the queer community, and thus provide a unique window into the hopes, fears, and fantasies of queer people for the last four decades.These comics have forged their aesthetics from the influences of underground comix, gay erotic art, punk zines, and the biting commentaries of drag queens, bull dykes, and other marginalized queers. They have analyzed their own communities, and their relationship with the broader society. They are smart, funny, and profound. No Straight Lines will be heralded by people interested in comics history, and people invested in LGBT culture will embrace it as a unique and invaluable collection.",
  "genres": [
    "Graphic Novels",
    "Comics",
    "Queer",
    "LGBT",
    "Nonfiction",
    "History",
    "Anthologies"
  ],
  "author": "Justin Hall",
  "average_rating": "4.05",
  "url": "https://www.goodreads.com/book/show/11871319-no-straight-lines"
}