{
  "title": "Tears and Saints",
  "description": "By the mid-1930s, Emil Cioran was already known as a leader of a new generation of politically committed Romanian intellectuals. Researching another, more radical book, Cioran was spending hours in a library poring over the lives of saints. As a modern hagiographer, Cioran \"dreamt\" himself \"the chronicler of these saints' falls between heaven and earth, the intimate knower of the ardors in their hearts, the historian of God's insomniacs.\" Inspired by Nietzsche's Beyond Good and Evil , Cioran \"searched for the origin of tears.\" He asked himself if saints could be \"the sources of tears' better light.\"\"Who can tell?\" he wrote in the first paragraph of this book, first published in Romania in 1937. \"To be sure, tears are their trace. Tears did not enter the world through the saints; but without them we would never have known that we cry because we long for a lost paradise.\" By following in their traces, \"wetting the soles of one's feet in their tears,\" Cioran hoped to understand how a human being can renounce being human. Written in Cioran's characteristic aphoristic style, this flamboyant, bold, and provocative book is one of his most important—and revelatory—works.Cioran focuses not on martyrs or heroes but on the mystics—primarily female—famous for their keening spirituality and intimate knowledge of God. Their Christianity was anti-theological, anti-institutional, and based solely on intuition and sentiment. Many, such as Catherine of Siena, Teresa of Avila, and Saint John of the Cross, have produced classic works of mystical literature; but Cioran celebrates many more minor and unusual figures as well.Following Nietzsche, he focuses explicitly on the political element hidden in saints' lives. In his hands, however, their charitable deeds are much less interesting than their thirst for pain and their equally powerful capacity to endure it. Behind their suffering and their uncanny ability to renounce everything through ascetic practices, Cioran detects a fanatical will to power.\"Like Nietzsche, Cioran is an important religious thinker. His book intertwines God and music with passion and tears. . . . [ Tears and Saints ] has a chillingly contemporary ring that makes this translation important here and now.\"— Booklist",
  "genres": [
    "Philosophy",
    "Nonfiction",
    "Romanian Literature",
    "Romania",
    "Essays",
    "Christianity",
    "20th Century"
  ],
  "author": "Emil M. Cioran",
  "average_rating": "4.09",
  "url": "https://www.goodreads.com/book/show/300448.Tears_and_Saints"
}