{
  "title": "Never Have an Outlaw's Baby",
  "description": "WHEN HE FINDS OUT ABOUT OUR BABY...OH, GOD.SUMMERI didn't have an outlaw's baby. Honest.I didn't run, didn't hide our son, didn't suffer alone. There's not a bastard with a gun to my head, sending me running to the bad boy I left behind. Making me lie to everyone.Yeah, I'm full of it.Here's the truth – I'm frozen because I'm finally face-to-face with the wild, gorgeous man with the icy stare who lit me on fire three summers ago. Joker rocked me to my core, left me with a kid, and it's just a matter of time until he discovers everything.Never have an outlaw's baby. They're cute, but they come with serious strings attached.Like Joker's kiss. I can already taste it, the growl rising in his throat. Coming for my lips, coming for the truth, coming for me.JOKERPure hell tore my heart out one night three years ago. There ain't room in that hole for Summer, a lyin' spitfire I swore I'd never see again.I screamed, I shoved, I told her to get out, and stay out. Made myself numb so I'd forget about those lips I used to own, or having her between the sheets.Worked like a charm 'til...the kid.I know he's mine. Know something evil isn't adding up. Know he's the first light I've had in the darkness for years, and Summer's the second.If she hates me, I don't give a damn. This baby changes everything.She ain't running anymore. Neither am I.I'll put my name on her sweet skin. Hear her beg the way she used to. Remind her that a woman never has an outlaw's kid without sharing his bed, his bike, his brand. Always.The Outlaw Love books are stand alone romance novels featuring unique lovers and happy endings. No cliffhangers, no cheating, and a secret baby surprise! This is Joker and Summer's story in the Deadly Pistols MC series.",
  "genres": [
    "Romance",
    "Contemporary Romance",
    "Audiobook",
    "Motorcycle",
    "Contemporary",
    "Dark",
    "Erotica"
  ],
  "author": "Nicole Snow",
  "average_rating": "3.97",
  "url": "https://www.goodreads.com/book/show/30039249-never-have-an-outlaw-s-baby"
}