{
  "title": "For 100 Days",
  "description": "If you love the intensity of the Crossfire series and Fifty Shades of Grey, make the 100 Series your next binge read!I came to New York to escape my brutal past and create my art. I've worked hard all my life, but now I'm in over my head and sinking fast. To survive now I need a miracle. So when I'm offered the chance to house-sit at a posh Manhattan high-rise, I grab it like the life line it is. Suddenly, I'm living a Cinderella life of luxury . . . one that thrusts me into the path of an intense, dangerous man who is far from Prince Charming.Possessive. Dominant. Ruthlessly seductive. Billionaire Dominic Baine is a dark, carnal king in this city, ruling everything in his reach. He can have anyone, but the only woman he wants is me. Our attraction is immediate and all-consuming. I know he's going to ruin me, crack me wide open and leave me broken. I know I should be careful not to give him my heart as easily as I surrender my body to him.Because if I let him get too close, those searing blue eyes are going to see through me--right down to the secrets I would do anything to protect. And being careful is the last thing I want when Nick is holding me in his arms.-------------------------FOR 100 DAYS is the first novel in the scorching contemporary romance trilogy from New York Times and USA Today bestselling author Lara Adrian. Binge-read the complete 100 Series today! Each book available separately or save when you download the complete series box set.\"I wish I could give this more than 5 stars! Lara Adrian not only dips her toe into this genre with flare, she will take it over... I have found my new addiction, this series.\" --The Sub Club\"There are twists that I want to say that I expect from a Lara Adrian book, and I say that because with any Adrian book you read, you know there's going to be a complex storyline. Adrian simply does billionaires better.\" --Under the Covers\"FOR 100 DAYS is a sexy, sizzling, emotion-filled delight. It completely blew me away!\" --J. Kenner, NYT bestselling author of RELEASE ME\"For those of you looking for your next Fifty fix, look no further. I know - you have heard the phrase before - except this time it's the truth and I will bet the penthouse on it.\" --Mile High Book ClubReaders love FOR 100 ★★★★★ \"I should have read this series a lot sooner!\"★★★★★ \"For 100 Days truly sets the bar!\"★★★★★ \"I LOVE THIS STORY!!\"★★★★★ \"Holy hell this book is smoking HOT.\"★★★★★ \"Christian Grey has nothing on Dominic Baine!\"★★★★★ \"This book is amazing!!!\"★★★★★ \"If you loved Crossfire you will LOVE this series!\"★★★★★ \"Crossfire, Gabriel's Inferno, I could name them all, and they would not have anything over this series!\"Meet billionaire Dominic Baine and find out why contemporary romance readers are addicted to the steamy, suspenseful 100 Series! Will it hook you too? Download your copy today!",
  "genres": [
    "Romance",
    "Contemporary Romance",
    "Contemporary",
    "Erotica",
    "Audiobook",
    "Erotic Romance",
    "BDSM"
  ],
  "author": "Lara Adrian",
  "average_rating": "4.13",
  "url": "https://www.goodreads.com/book/show/30041007-for-100-days"
}