{
  "title": "One More Sunrise",
  "description": "Countless perils menaced the early settlers of the Wild West - and not the least of them was the lack of medical care. Dr. Dane Logan, a former street waif who has been adopted by a doctor's family in Cheyenne, puts his lifelong dream to work filling this need. His renown as a surgeon spreads throughout the frontier, even while his love grows for the beautiful Tharyn, an orphan he lost contact with when he left New York City as a child. Will happiness in love ever come to Dane - or will the roving Tag Moran gang bring his hopes to a dark end?Showdown in Cheyenne1880. The frontier is uneasy. Tag Moran and his vicious gang are roving the West, robbing banks and stagecoaches. Dr. Dane Logan, a former street waif adopted by a doctor’s family in Cheyenne, is gaining renown for his delicate surgical skill. Dane’s situation becomes precarious when an unfortunate death turns Tag into his bitter enemy. If outlaws come between the tall young surgeon and his childhood love, who’ll be left to see another sunrise?Story Behind the BookAlways planning ahead for what we will write for Multnomah Publishers, JoAnna and I decided to follow the ORPHAN TRAIN trilogy with one about a medical doctor in the Old West, so we came up with the idea of a trilogy called FRONTIER DOCTOR. We introduced a teenage boy in the final ORPHAN TRAIN book who has a burning desire to one day become a physician and surgeon. This first book in this trilogy keys in on this young prospective doctor. Seeing history through this young doctor’s eyes will deeply touch your heart and make these books impossible to set down. We also think you’ll find this new trilogy filled with our faith—gained from so many years of serving the Lord and trusting His written Word.",
  "genres": [
    "Historical Fiction",
    "Christian Fiction",
    "Fiction",
    "Christian",
    "Christian Historical Fiction",
    "Historical"
  ],
  "author": "Al & Joanna Lacy",
  "average_rating": "3.84",
  "url": "https://www.goodreads.com/book/show/300420.One_More_Sunrise"
}