{
  "title": "What Does it Mean to be White in America?: Breaking the White Code of Silence, A Collection of Personal Narratives",
  "description": "WHAT DOES IT MEAN TO BE WHITE IN AMERICA? BREAKING THE WHITE CODE OF SILENCE, A COLLECTION OF PERSONAL NARRATIVES, is a collection that asks just that. While the literature on whiteness has long been dominated by an academic point of view, editors Gabrielle David and Sean Frederick Forbes came to the realization that there was an unmet need for an anthology of personal narratives about race and culture from the perspective of white Americans. In this conception process, WHAT DOES IT MEAN TO BE WHITE IN AMERICA? was born.The first of its kind, this collection of 82 personal narratives reflects a vibrant range of stories from white Americans who speak frankly and openly about race, not only as it applies to people of color, but as it applies to themselves. In answering the question, some may offer viewpoints one may not necessarily agree with, but nevertheless, it is clear that each contributor is committed to answering it as honestly as possible.With an introduction by racial justice educator and writer, Debby Irving, and an afterword by award-winning poet, author and scholar, Tara Betts, the purpose of WHAT DOES IT MEAN TO BE WHITE IN AMERICA? is to, as Irving points out in her introduction, break the code of silence so that we can engage in frank conversations about race. An invaluable starting point that includes a glossary and a bibliography of suggested reading, WHAT DOES IT MEAN TO BE WHITE IN AMERICA? is highly recommended for students, teachers and anyone else interested in seeking a deeper and richer understanding of race in America. Visit the book's website at whiteinamerica.org to learn more about the book and the contributors.",
  "genres": [
    "Anthropology",
    "Essays"
  ],
  "author": "Gabrielle David",
  "average_rating": "3.77",
  "url": "https://www.goodreads.com/book/show/30032477-what-does-it-mean-to-be-white-in-america"
}