{
  "title": "I Prefer the Sunrise",
  "description": "Heartache is the only reality Alicia knows. But will she continue to careen self-destructively or can she learn to translate tragedy into triumph? The debut novel, I PREFER THE SUNRISE, by Anna Rae Aberle, is a poignant, compelling story about how life's challenges can either tear you down or lead you to triumph over adversity. I PREFER THE SUNRISE opens with a stunned, grieving Alicia Riverdale, revealing raw emotions as she recovers from a miscarriage and questions her miserable relationship with Joe; the man who never even wanted their child. Alicia, who has yet to put her college degree to use, has no direction and still follows Joe from her hometown in Colorado to California in misguided feelings of commitment. But resentment runs rampant in their relationship. Once she begins a fulfilling profession where she meets aspiring author and love interest, Gregory Vincent, Alicia finally disentangles herself from Joe's angry and bitter ways. But when Gregory dies tragically, her happiness abruptly squelched again, Alicia plummets further into grief and alcohol addiction leading to subsequent losses of her job, her closest friend, her home and ultimately, her dignity. The story follows Alicia's full descent into depression and alcoholism until she appears in state of desperation at the clinic of veterinarian Dr. David Dexter with her training-challenged new puppy. The handsome and engaging Dr. Dexter not only comes to her rescue with her misbehaving pup, but he charms her with hope of a new start and an end to her suffering and misdirection. Buoyed by the budding relationship with Dr. Dexter, conflict surfaces clawing at Alicia’s ability to fall in love again because of her tattered past. Alicia becomes tethered to her past, realizing her most vivid memories of Gregory are jeopardized so she leaps at the chance to continue his legacy—by completing his unfinished works —allowing her to reconcile the loss of the past with the promise of a new future. But will that radical decision compromise her progress and cause her to lose yet another crucial relationship? I PREFER THE SUNRISE has deep content, yet is an absorbing read with a message that we all hold our own power to conquer our demons and take control of our destiny. Set in San Francisco, amid the bustle of the city and the quiet hills of surrounding Marin County, the backdrop of the novel is a fitting landscape for the dynamic characters who struggle with matters of the heart . This debut novel is refreshing and new, not a variation on a theme of books already on the shelf. Readers will relish complex characters and circumstances that are unique yet relatable. The author subtly, but solidly integrates seemingly inconsequential moments throughout the book that become more meaningful as the story unfolds, up until the final page. Anna Rae Aberle has a superb writing style that hits an easy stride within the first few chapters, to deliver a powerful story with well-illustrated situations that will captivate your interest.",
  "genres": [],
  "author": "Anna Rae Aberle",
  "average_rating": "3.94",
  "url": "https://www.goodreads.com/book/show/11871494-i-prefer-the-sunrise"
}