{
  "title": "Buried Truths",
  "description": "***WARNING*** This book contains scenes of self-harm that may act as triggers for some people.  Sometimes, you have to let go of your past in order to find your future. Doctor Chase Schuyler’s entire life has been dictated by overbearing parents. His only effort to break free of those restraints failed years ago, leaving a trail of ruin and hurt in his wake. Now he toes the line to keep everyone happy. Everyone that is, but himself. Despite the realm’s new declaration of freedom to love whomever you choose, Chase crawls deeper into a hole of denial in order to avoid shaming his family. When a young, ever persistent soldier with the King’s army becomes hell bent on getting Chase’s attention, Chase enters into a battle of heart versus head as he tries to deny his ever growing attraction to the man. Aaron Pryor is a free spirit. Vibrant, funny, a little wild by nature with the heart of a lover and the soul of a child. Nothing is going to stand in his way of winning over the gorgeous city’s doctor. Nothing. His methods may be obscure, but his intentions are good. However, winning the doctor’s heart proves trickier than he anticipates. Just as their love begins to blossom and everything seems to be sailing along, they come to an abrupt, crashing halt. Chase closes the door on everything. He knew this would happen. History dictates he will only ever hurt the people he loves. Aaron is no different. Can Aaron find out the truth behind Chase’s rejection and convince the man to pursue his own happiness and stop living by everyone else’s standards? Or is Aaron’s carefree nature just a mask he uses to cover his own deeper problems? And what happens when the mask slips? With Edovia’s war efforts coming to a head and decisions around the future of the lands being made. Chase is faced with a potentially life altering decision that may make all other issues irrelevant. Both men need to battle the demons of their past to find answers, but sometimes the past is not so easily quelled. Sometimes, only the truth will set you free.  This is the second book in a trilogy. It can be read as a standalone, however, there are some aspects and characters that have carried over from the first book.",
  "genres": [
    "M M Romance",
    "Romance",
    "LGBT",
    "Historical"
  ],
  "author": "Nicky James",
  "average_rating": "4.03",
  "url": "https://www.goodreads.com/book/show/30058427-buried-truths"
}