{
  "title": "The Worlds of Herman Kahn: The Intuitive Science of Thermonuclear War",
  "description": "Herman Kahn was the only nuclear strategist in America who might have made a living as a standup comedian. Indeed, galumphing around stages across the country, joking his way through one grotesque thermonuclear scenario after another, he came frighteningly close. In telling the story of Herman Kahn, whose 1960 book On Thermonuclear War catapulted him into celebrity, Sharon Ghamari-Tabrizi captures an era that is still very much with us--a time whose innocence, gruesome nuclear humor, and outrageous but deadly serious visions of annihilation have their echoes in the \"known unknowns and unknown unknowns\" that guide policymakers in our own embattled world.Portraying a life that combined aspects of Lenny Bruce, Hitchcock, and Kubrick, Ghamari-Tabrizi presents not one Herman Kahn, but many--one who spoke the suffocatingly dry argot of the nuclear experts, another whose buffoonery conveyed the ingenious absurdity of it all, and countless others who capered before the public, ambiguous, baffling, always open to interpretation. This, then, is a story of one thoroughly strange and captivating man as well as a cultural history of our moment. In Herman Kahn's world is a critical lesson about how Cold War analysts learned to fill in the ciphers of strategic uncertainty, and thus how we as a nation learned to live with the peculiarly inventive quality of strategy, in which uncertainty generates extravagant threat scenarios.Revealing the metaphysical behind the dryly deliberate, apparently practical discussion of nuclear strategy, this book depicts the creation of a world where clever men fashion Something out of Nothing--and establishes Herman Kahn as our first virtuoso of the unknown unknowns.",
  "genres": [
    "History",
    "Biography",
    "War",
    "Science",
    "American History",
    "Nonfiction",
    "20th Century"
  ],
  "author": "Sharon Ghamari-Tabrizi",
  "average_rating": "3.88",
  "url": "https://www.goodreads.com/book/show/118723.The_Worlds_of_Herman_Kahn"
}