{
  "title": "Banana Muffins & Mayhem",
  "description": "From USA Today bestselling author Janel Gradowski comes her next to-die-for recipe for murder...Culinary competitor Amy Ridley is as excited as anyone in Kellerton, Michigan to have DIY Home Improvement star, Phoebe Plymouth, come to town for the first annual Cabin Fever Cure event. However the TV personality's sour attitude quickly curdles people's opinion of her. When she's found dead, at the business owned by Amy's husband, Alex, the heat is on to catch the killer before his professional reputation is ruined!When Amy seeks help in preparing for a vegan baking recipe contest, she also finds assistance from an unlikely team of sleuths who want to help her catch the murderer. But things go from bad to worse when Alex and his business suddenly suffer a series of less-than-random attacks. Are the murder and attacks related? Amy vows to figure it out before her and her husband's lives are ruined...or ended permanently!**Recipes Included!**Culinary Competition Mysteries:Pies & Peril (book #1)Chicken Soup & Homicide (book #2)Christmas Canapés & Sabotage (short story)Doughnuts & Deadly Schemes (book #3)Barbecue & Bad Juju (short story in the \"Killer Beach Reads\" collection)Fudge Brownies & Murder (book #4)Banana Muffins & Mayhem (book #5)What critics are saying about the Culinary Competition Mysteries:\"Janel Gradowski creates a deliciously enticing environment in FUDGE BROWNIES & MURDER...has definitely whetted my appetite, both for brownies and more of this fun series!\"~ Fresh Fiction\"PIES & PERIL is the perfect cozy to curl up with in your favorite chair or at the beach while enjoying some sun. It’s teeming with a lot of charm and great characters along with many tidbits of delectable goodies perfect for any foodie...sure to please any reader who loves their cozy mysteries!\"~ Peeking Between the Pages\"Gradowski is a well-oiled machine when it comes to merging attention-grabbing mystery and good old-fashioned storytelling.\"~ Long Island Book Reviews",
  "genres": [
    "Mystery",
    "Cozy Mystery",
    "Foodie"
  ],
  "author": "Janel Gradowski",
  "average_rating": "4.40",
  "url": "https://www.goodreads.com/book/show/30050412-banana-muffins-mayhem"
}