{
  "title": "Aku Melawan Teroris",
  "description": "Tangismu wahai bayi-bayi tanpa kepala…dibentur ditembok-tembok Palestina…jeritmu wahai bayi-bayi Afghanistan…yang memanggil-manggilku tanpa lengan…dieksekusi bom-bom jahannam…milik setan Amerika dan Sekutu…saat ayah bundamu menjalani Ramadhan!Ini aku,saudaramu…ini aku,datang dengan secuil bombing…kan kubalaskan sakit hatimu…kan kubalaskan darah-darahmu…darah dengan darah…nyawa dengan nyawa…qishash!!Itulah sepenggal puisi Imam Samudra. bait-bait yang mereflesikan apa, mengapa, kepada siapa,dan bagaimana ia melawan. Dari balik jeruji besi,sembari menunggu proses eksekusi atas ganjaran pidana mati, ia menorehkan catatan-catatan harian.Sebagai sebentuk pertangguhjawaban kepada publik atas apa yang ia dan kawan-kawannya lakukan di Bali pada 12 Oktober 2002.Apa yang ia dan kawan-kawannya lakukan di Bali,tak lain adalah bentuk reaksi perlawanan terhadap penindasan ; Amerika dan sekutunya. Bangsa yang oleh Amnesti Internasional dikarunia”penghargaan” sebagai pelanggar HAM terburuk selama 50 tahun terakhir. Bangsa yang oleh Human Right Report 2002 dan Human Right Watch dinobatkan sebagai pelanggar HAM terburuk dan terberat di dunia. Bangsa yang publik umum memahami sebagai biang teroris. Karenanya,buku ini berjudul, Aku Melawan Teroris.“Saya melakukan jihad pada titik-titik ikhtilaf.”demikian tulisannya. Sebuah ungkapan atas sebuah pilihan jalan dari ragam jalan perjuangan yang ditempuh oleh umat Islam.Ia sadar bahwa langkahnya kontrovesi.Meski demikian,ia menyakinkan jalan yang ditempuhnya. Dan keyakinan itu, didasarkan atas sebuah model pemahaman Islam yang ia anut. Apa itu? Ia menjelaskannya dalam buku ini.Terlepas kita setuju atau tidak,buku Imam Samudra, Aku Melawan Teroris, tetap menarik untuk dibaca. Sebagai upaya mengenal lebih jauh apa dan siapa Imam Samudra,termasuk jalan perjuangannya. Terlebih gaya penulisan yang bertutur, reflektif, gaul, kadang jenaka,menjadikan kita mudah mengikuti ‘gagasan ide’yang ia sampaikan.",
  "genres": [
    "Biography"
  ],
  "author": "Imam Samudra",
  "average_rating": "3.62",
  "url": "https://www.goodreads.com/book/show/3005730-aku-melawan-teroris"
}