{
  "title": "Hamilton's Curse: How Jefferson's Arch Enemy Betrayed the American Revolution--and What It Means for Americans Today",
  "description": "Two of the most influential figures in American history. Two opposing political philosophies. Two radically different visions for America. Thomas Jefferson and Alexander Hamilton were without question two of the most important Founding Fathers. They were also the fiercest of rivals. Of these two political titans, it is Jefferson—–the revered author of the Declaration of Independence and our third president—–who is better remembered today. But in fact it is Hamilton’s political legacy that has triumphed—–a legacy that has subverted the Constitution and transformed the federal government into the very leviathan state that our forefathers fought against in the American Revolution.How did we go from the Jeffersonian ideal of limited government to the bloated imperialist system of Hamilton’s design? Acclaimed economic historian Thomas J. DiLorenzo provides the troubling answer in Hamilton’s Curse.DiLorenzo reveals how Hamilton, first as a delegate to the Constitutional Convention and later as the nation’s first and most influential treasury secretary, masterfully promoted an agenda of nationalist glory and interventionist economics—–core beliefs that did not die with Hamilton in his fatal duel with Aaron Burr. Carried on through his political heirs, the Hamiltonian legacy:• Wrested control into the hands of the federal government by inventing the myth of the Constitution’s “implied powers” • Established the imperial presidency (Hamilton himself proposed a permanent president—–in other words, a king)• Devised a national banking system that imposes boom-and-bust cycles on the American economy• Saddled Americans with a massive national debt and oppressive taxation• Inflated the role of the federal courts in order to eviscerate individual liberties and state sovereignty• Pushed economic policies that lined the pockets of the wealthy and created a government system built on graft, spoils, and patronage• Transformed state governments from Jeffersonian bulwarks of liberty to beggars for federal crumbsBy debunking the Hamiltonian myths perpetuated in recent admiring biographies, DiLorenzo exposes an uncomfortable truth: The American people are no longer the masters of their government but its servants. Only by restoring a system based on Jeffersonian ideals can Hamilton’s curse be lifted, at last.",
  "genres": [
    "History",
    "American History",
    "Biography",
    "Politics",
    "Nonfiction",
    "Economics",
    "American Revolution"
  ],
  "author": "Thomas J. DiLorenzo",
  "average_rating": "4.04",
  "url": "https://www.goodreads.com/book/show/3004525-hamilton-s-curse"
}