{
  "title": "Marianna Mestre: Nothing's As It Seems",
  "description": "Middle-School Detective Marianna Mestre.Marianna can get to the bottom of most mysteries—there’s the case of a stolen laptop, the discovery of unearthed bones, and the quest to find the culprit of a cruel and hurtful adolescent prank. It’s the mysteries of life and adolescence that she finds challenging.Marianna Nothing’s As It Seems is narrated by Marianna, a precocious and inquisitive 12-year-old, whose love for solving mysteries is challenged by the distraction of middle-school drama. Raised by a single attorney father since she was six, Marianna prides herself on being a loner, relying only on the characters of books for friendships. That is until she meets Colin and Michael, two brothers who join Marianna on her detective escapades.Michael, the youngest brother, is not much of a talker and is described by adults as “high functioning.” Colin, who is in the same grade as Marianna, is headstrong, confident, and introduces Marianna to a new type of life—one that she is not quite ready for—filled with dances, hanging out with peers, and a potential new boyfriend.To navigate in these new waters, Marianna relies on the encouragement of Mrs. Henderson, a client of her father’s, who is suspected of murder and plagued with Alzheimer’s. This unexpected and unconventional friendship with Mrs. Henderson opens Marianna’s eyes to the realization that things are not always as they seem. Perceptions are subjective. Stereotypes can be misleading. And the ones who are hardest to love are often the ones who need love the most.This coming of age novel is reminiscent of Judy Blume’s Are You There God It’s Me Margaret and begs the are those that seem so different than us really that different? Marianna Nothing’s As It Seems tackles the subjects of bullying, adolescence, and socialization as seen through the eyes of a 12-year-old girl. With a mixture of suspense, romance, and tween angst, this middle-grade novel is a fun read for young females and males.",
  "genres": [],
  "author": "Kristin O'Ferrall",
  "average_rating": "4.09",
  "url": "https://www.goodreads.com/book/show/30055316-marianna-mestre"
}