{
  "title": "The Mating Destiny",
  "description": "The Mating Destiny  In all his 150 years as dragon, sexy, handsome Crown Prince Alexander d’Mateo de Drakon Tremaine has been treated with privilege and respect. And then he met a half-blood who turned his world upside down and made him see life in a new light. Alex would do anything for Emma, even fight to the last drop of his royal blood to keep her safe. But they can never be more than friends, for Alex is destined to marry and mate with a princess from a rival clan to unite their two kingdoms.  Half-blood dragon Emma Kantris is servant to Alex’s intended, and she knows his marriage will mean much-needed change for both dragon clans. Through his union with Princess Sabrina, Alex can finally eradicate the hated caste system that suppresses Emma and other half-bloods. Secretly, her heart longs for Alex, the dashing prince who has been a friend when all others deserted her, even though Emma has been warned to stay away. But when Emma is abducted by her enemies, it’s Alex who’s off to rescue her, and in doing so he may pay a price that could endanger them both…  BONUS CONTENT! Lovestruck: A Dragon Story  Fiery red dragon Anna Dixon knows what she wants – the sexy, handsome Michael Vincent as her mate. Once childhood friends, an undying passion now claims them both. But Michael is a black dragon belonging to a rival clan, and her father will never allow the match. Heartbroken, Anna is resigned to the fact that the hatred between their families will never cease and she must deny Michael for the sake of peace.  Michael has tried to put away memories of Anna, but can never forget the red dragon who aroused his passion and claimed his heart. When Xavier, the Crystal Wizard, sends Michael to gather rare Lumen seeds from land belonging to Anna’s clan, the two dragons consummate the desire burning between them. But after Michael is caught and his presence stirs old animosities, they are threatened with a dragon war in the skies that can claim everything Anna holds dear, including her beloved Michael…  (BONUS CONTENT! Containing the novella, Lovestruck, this is a 60,000 word book. Both stories should be read together. Both contain explicit sex.)",
  "genres": [
    "Shapeshifters",
    "Paranormal Romance"
  ],
  "author": "Bonnie Vanak",
  "average_rating": "4.38",
  "url": "https://www.goodreads.com/book/show/30062378-the-mating-destiny"
}