{
  "title": "Simply Dirac",
  "description": "“What a fantastic entrée into the life of Paul Dirac and the exotic world of Quantum Mechanics, of which he was one of the great pioneers. With its cast of some of the most important scientists of the modern age, this is both an entertaining and an enlightening read.”—Michael White, Bestselling author of 39 books including Isaac The Last Sorcerer Paul Dirac (1902–1984) was a brilliant mathematician and a 1933 Nobel laureate whose work ranks alongside that of Albert Einstein and Sir Isaac Newton. Although not as well known as his famous contemporaries Werner Heisenberg and Richard Feynman, his influence on the course of physics was immense. His landmark book, The Principles of Quantum Mechanics , introduced that new science to the world and his “Dirac equation” was the first theory to reconcile special relativity and quantum mechanics. Dirac held the Lucasian Chair of Mathematics at Cambridge University, a position also occupied by such luminaries as Isaac Newton and Stephen Hawking. Yet, during his 40-year career as a professor, he had only a few doctoral students due to his peculiar personality, which bordered on the bizarre. Taciturn and introverted, with virtually no social skills, he once turned down a knighthood because he didn’t want to be addressed by his first name. Einstein described him as “balancing on the dizzying path between genius and madness.” In Simply Dirac , author Helge Kragh blends the scientific and the personal and invites the reader to get to know both Dirac the quantum genius and Dirac the social misfit. Featuring cameo appearances by some of the greatest scientists of the 20th century and highlighting the dramatic changes that occurred in the field of physics during Dirac’s lifetime, this fascinating biography is an invaluable introduction to a truly singular man.Benefits of reading Simply Dirac :What's Buy Simply Dirac now and get a unique insight into the life of a truly extraordinary man!",
  "genres": [
    "Physics",
    "Biography",
    "Nonfiction",
    "Science"
  ],
  "author": "Helge Kragh",
  "average_rating": "3.97",
  "url": "https://www.goodreads.com/book/show/30064164-simply-dirac"
}