{
  "title": "The Dream Walker",
  "description": "Naomi’s life is simple, predictable, and about to explode into a universal adventure. A condemned criminal attempts to escape during a routine transfer, but his plan becomes botched, sending him and his guard, Deklyn, to an uncharted Earth. That turns out to be unfortunate for college student Naomi who ends up at the wrong place at the wrong time. In a desperate attempt to escape, the convict finds a way to leave Earth, with Naomi in his firm grasp. She becomes captive to a very determined alien who finds her blood is an addictive drug he can’t get enough of. In fact, he’ll risk everything to keep her. Deklyn has one thing on his mind- get the female species and return her back to that uncharted planet, somehow. That will prove to be difficult as she unwillingly becomes a pawn that could either prevent or cause a universal war. None of that will deter him. Deklyn’s not one to lose at anything and he never gives up. He knows the female is being tortured because of his mistake and he won't rest until she's safely home again. Naomi has been abducted into a world that will test her will to survive beyond anything she could have ever imagined. Nothing here is as it seems and she continues to find danger amidst the wonders of space. Despite the struggle, she has no plans of succumbing to the unbelievable mess she’s been thrust into. She forges friendships and learns adventure can be found in any circumstance. She is a feisty human who refuses to give up. Along the way, she finds an unexpected strength that will be the key to her survival. Naomi and Deklyn will find their struggles and adventures form a connection that can span a universe. But, will it be enough to keep Naomi alive or see her returned home? This book is recommended for 18 and up due to a few adult themes. This book is dedicated to all the weirdos out there like me that prefer things somewhat out of the ordinary, a bit unexpected and with a little romance tossed in. It's for those bored readers that say they can see the path to the end of the book by chapter two. I bet you can’t in this one. It’s got a twist… a big twist, a good twist or maybe bad. You’ll love it or hate it, but maybe you’ll stay up a few extra hours turning the page, then the next page, just to see what happens. This is a stand alone book with no cliff hanger.",
  "genres": [
    "Aliens"
  ],
  "author": "Wanda Harkins",
  "average_rating": "4.06",
  "url": "https://www.goodreads.com/book/show/30061032-the-dream-walker"
}