{
  "title": "Cobra and Maitreya",
  "description": "The late Severo Sarduy was one of the most outrageous and baroque of the Latin American Boom writers of the sixties and seventies, and here bound back to back are his two finest creations. Cobra (1972) recounts the tale of a transvestite named Cobra, star of the Lyrical Theater of the Dolls, whose obsession is to transform his/her body. She is assisted in her metamorphosis by the Madam and Pup, Cobra's dwarfish double. They too change shape, through the violent ceremonies of a motorcycle gang, into a sect of Tibetan lamas seeking to revive Tantric Buddhism.Maitreya (1978) continues the theme of metamorphosis, this time in the person of Luis Leng, a humble Cuban-Chinese cook, who becomes a reincarnation of Buddha. Through Leng, Sarduy traces the metamorphosis of two hitherto incomparable societies, Tibet at the moment of the Chinese invasion, and Cuba at the moment of revolution. Transgressing genres and genders, reveling in literal and figurative transvestism, these two novels are among the most daring achievements of postmodern Latin American fiction.  \"Maitreya [is] a mesmerizing literary mosaic fusing the memories of a Caribbean sense of place with a fluid existential state where transmigration is commonplace.\" (Juana Ponce de Leon, Voice Literary Supplement 5-94)  \"Maitreya's outrageous characters maneuver through endless passages and trapdoors, as if in a 'Tibetan Book of the Dead' recited by saucy drag queens. The dialogue can be as sharp as that of divas speculating cock size, but the sentences are sometimes as ornate as the spaces his characters inhabit, rambunctious as their makeup.\" (Lawrence Chua, Voice Literary Supplement 5-94)  \"Sarduy rendered the epiphany of the body luminous, where the pleasure of the void meets the furious fire of the world.\" (Washington Post Book World 7-31-95)  \"Hypnotic, poetic and challenging.\" (Gay Times 9-95)  \"Cobra is composed of jewel-like sentences that unfold like paper origami in convoluted proliferation. . . . Maitreya is one of the most radiant texts I have ever read, and the translation by Suzanne Jill Levine appears as seamless as a single ocean wave, spilling us from high elegance to low camp and back again without pause.\" (Bruce Benderson, Cups 7-12-95)",
  "genres": [
    "Spanish Literature",
    "Latin American",
    "LGBT",
    "Queer",
    "France",
    "Literature",
    "School"
  ],
  "author": "Severo Sarduy",
  "average_rating": "3.81",
  "url": "https://www.goodreads.com/book/show/1187256.Cobra_and_Maitreya"
}