{
  "title": "Simply Darwin",
  "description": "“An excellent sprint through the highlights of Darwin’s life and work. Ruse is a masterful writer who presents a clear account of who Darwin was and why he was important. It’s the connection to larger questions of our lives that makes this book a success. Well done, Ruse!”—Joe Cain, Professor of History and Philosophy of Biology, University College LondonSimply Darwin tells the story of Charles Robert Darwin (1809–1882) and his theory of evolution through natural selection. On one level, the book portrays a dedicated scientist who, through careful observation and brilliant insight, became convinced that organisms were the end product of a long, slow, and natural process of development. On another level, it is an account of a cataclysmic change in our ideas about ourselves—a conceptual upheaval that continues to generate aftershocks—and heated debates—to this day.In Simply Darwin, author Michael Ruse puts Darwin and his ideas in their proper context, clearly showing that, while the father of evolutionary biology was a true trailblazer, he was no rebel. He was simply following an evidentiary trail that led to an inevitable conclusion about the origin of species and natural selection. Eventually, as Darwin and his fellow scientists began to apply his ideas to humans, long-held notions about the nature and origins of religion, morality, race, sexuality, and much more, were called into question. Then, as now, some of us embraced these provocative ideas, while others reacted with horror and disbelief.In recounting this fascinating and inspiring story, Ruse doesn’t neglect the visual component that has always been an inherent part of evolutionary thought. Simply Darwin features copious illustrations, which provide an informative and captivating element to this riveting account.With Simply Darwin, readers will benefit A clear and compelling account of Darwin and his theory of evolutionA captivating exploration of how Darwin's ideas challenged long-held beliefs about religion, morality, race, sexuality, and moreA wealth of illustrations that bring the story to lifeSimply Darwin covers Darwin's life and work, his theory of evolution, its application to humans, and more. This book also contains a comprehensive range of illustrations for readers to explore. Buy now before the price changes!",
  "genres": [
    "Audiobook"
  ],
  "author": "Michael Ruse",
  "average_rating": "3.68",
  "url": "https://www.goodreads.com/book/show/30064159-simply-darwin"
}