{
  "title": "Life and Adventures of L. D. Lafferty: Being a True Biography of One of the Most Remarkable Men of the Great Southwest ...and Hairbreadth Escapes Upon the Frontier of Texas",
  "description": "\"An entire war party of 100 Cherokees...was killed in battle with the Osage... L. D. Lafferty...later escaped.\" - History of the Cherokee Indians (2013)\"Lorenzo Dow Lafferty, son of a Tennessee Indian trader...spent three of his teenage years (1815-1818) living in a Cherokee town on the White River.\" -Cherokee Pioneers in Arkansas (1997)\"Lafferty...commonly called 'the Rover'...went to Texas and there published a book...dealt largely with the romance of early Arkansas.\" - Pioneers and Makers of Arkansas (1908)\"L.D. Lafferty remembered encountering below the mouth of Little Red River a settlement of 30 or 40 African Americans.\" - The Lost History of the New Madrid Earthquakes (2013)When the Cherokee were forced from lands in Tennessee to a new home in Arkansas in 1810, \"Indian trader\" John Lafferty with his family, including 10-year-old Lorenzo Dow Lafferty, would follow Cherokee and settle near them in Arkansas. John would set up a trading post and run keel boats on the river.As a teenager, Lorenzo would live among the Cherokee for three years, joining them on their conflicts with established Native American tribes such as the Osage, Pawnee, and Kickapoo. In one battle, as of his Cherokee companions would be killed and Lafferty himself would be captured by the enemy Osage warriors.Later, Lafferty would move to nearby Texas where he would risk his life numerous times in the Texas Revolution and Indian wars.In 1885 Alexander Hamilton Abney (1822 – 1882), a veteran of the Mexican War and Texas Indian Wars, would take down and publish the life story of Lafferty's extraordinary true life adventures in a book titled \"Life and Adventures of L. D. Lafferty.\"In introducing the story of Lafferty, Abney \"Why a man possessed of such extraordinary powers has been so little known, our answer is When he first came to Texas, in 1818, he was uneducated, and had no ambition to acquire fame or notoriety; and as he never became a permanent citizen of Texas, during the days of the Republic, but merely fought as a volunteer during the several periods of revolution, from 1818 to 1832, returning to his home in Arkansas at intervals, he was not sufficiently known to attract special attention.\"And, furthermore, he had acquired, during his long residence among the Cherokee Indians, in early life, much of their peculiar habit of reserve and dignified retirement, and hence shrank from any public recognition of his services in behalf of the oppressed. Nor would he render himself conspicuous by thrusting into the public prints an account of his early contests with the Osage, Pawnee, and Kickapoo Indians. And it was not without much persuasion, as well as logical argument, that he finally consented to allow the leading adventures of his eventful life to appear in this volume.\"About the Alexander Hamilton Abney (1822 – 1882), was a veteran of the Mexican War and Texas Indian Wars Abney was a general agent for the Texas Military Board during the Civil War.In describing how he came to know Lafferty, Abney writes that he \"first met the subject of this sketch in Attascosa County, Texas, in the spring of 1869, at which time he learned the principal facts herein narrated. Though, at that time, he had no intention of preparing them for publication, yet a subsequent acquaintance with Mr. Lafferty, and frequent conversations with gentlemen of unquestioned honor who fully vouched for his veracity, induced the writer to undertake this work.\"",
  "genres": [],
  "author": "A.H. Abney",
  "average_rating": "3.33",
  "url": "https://www.goodreads.com/book/show/30078400-life-and-adventures-of-l-d-lafferty"
}