{
  "title": "Hillary the Other Woman: A Political Memoir",
  "description": "You think you know Hillary and Bill Clinton pretty well. After all, they have been in the public eye—from Arkansas to the White House and beyond—for over forty years. Dolly Kyle met former president Clinton (Billy as she calls him) on a Hot Springs golf course when she was eleven and he was almost thirteen. It was colpo de fulmine (the thunderbolt) at first sight. Their friendship grew throughout high school and college. It became a decades-long affair that lasted despite marriages and politics all the way to the threshold of the White House—when she became a political liability, and he threatened to destroy her, as Hillary had done to so many of his other women over the years. What you know about the Clintons is probably limited to the pleasantries that the mainstream media have chosen to share with you. Hillary the Other Woman pulls no punches in describing the way “media magic” makes Clinton stories disappear. Have you heard about • The RICO (Racketeering Influenced and Corrupt Organizations) federal lawsuit that Kyle filed against Clinton and cronies while he and co-president Hillary were in the White House? • The racial discrimination lawsuits filed by African-Americans against Clinton as governor of Arkansas? • Cinton’s orders for the Arkansas State Police to “stop and search” vehicles driven by Hispanics? • Thousands of young African-American men given long prison sentences under the “three strikes” laws pushed by co-presidents Bill and Hillary? • The co-president Clintons pandering to minorities with a subtle form of race baiting with their welfare agenda? • The racist names they call Jesse Jackson behind his back? Hillary the Other Woman is not only about the politics of the Arkansas gubernatorial years and the famous “two for the price of one” presidency. It also provides a perspective on Arkansas life that formed the backdrop and training ground for the Clintons in their later crimes, their gangster-like threats and intimidation of political enemies, and their arrogant belief that they are above the law. You will see the connection between Hillary’s current email scandal and her shredding of documents when they left the Arkansas governor’s mansion. You will realize that the Clinton Foundation is the new international version of the money laundering and bribes that you glossed over as “Cattlegate.” You will read clear, concise, entertaining accounts that put the multitude of Clinton scandals into everyday perspective. Finally, you will be privy to the Clinton “truth suppression” techniques that allowed them to get away with all of it. Until now…",
  "genres": [
    "Politics",
    "Nonfiction",
    "History",
    "Biography Memoir",
    "Biography",
    "Memoir"
  ],
  "author": "Dolly Kyle",
  "average_rating": "4.08",
  "url": "https://www.goodreads.com/book/show/30109111-hillary-the-other-woman"
}