{
  "title": "The Death of Satan: How Americans Have Lost the Sense of Evil",
  "description": "We live in the most brutal century in human history, but instead of stepping forward to take the credit, the devil has rendered himself invisible. The very notion of evil seems incompatible with modern life, from which the ideas of transgression and the accountable self are fast receding. Yet despite this loss of old words and moral concepts - Satan, sin, evil - we cannot do without some conceptual means for thinking about the universal human experience of cruelty and pain. My driving motive in writing this book has been the conviction that if evil, with all its insidious complexity, escapes the reach of our imagination, it will have established dominion over us all.'Americans once believed in God and in Satan; they were known to be obsessed with sin, and they pictured their own history as a struggle with evil. Today, however, while the repetoire of evil seems never to have been richer, as we daily encounter (and even relish) images of unimaginable horror, our grasp on the reality of evil seems weak and uncertain, our responses to it flustered and sometimes indifferent. How has this crisis of incompetence come about?In this important new book, the brilliant scholar Andrew Delbanco proposes a fresh, persuasive interpretation of the American past - and present - that offers a way to resolve this crisis of moral imagination. In a kind of spiritual biography of the American nation, he shows us how the writers of the past three centuries have depicted evil and how, by giving it form and meaning, they have tried to defy and subdue it. His nuanced and yet tough-minded analyses of religious leaders like Cotton Mather and Jonathan Edwards, political redeemers such as Jefferson and Lincoln, classic writers like Emerson and Melville, Thoreau and Whitman, and more recent figures, including Niebuhr and Trilling, Rachel Carson and Susan Sontag, show us the strategies by which these writers have recognized and done battle with evil.One way of talking about evil is to demonize and satanize it, depict it as the foreign \"other,\" a monstrous reality far from ourselves. This way of understanding evil as remote and alien seems to be on the rise again today. But as Mr. Delbanco's superb study shows us, Satan has sometimes had a very different meaning in our history - as a symbol of our own deficient love, our potential for envy and rancor toward creation. Americans have always been engaged in a contest between these two ways of understanding evil; and it remains a struggle in which nothing less than America's destiny is at stake.",
  "genres": [
    "Nonfiction",
    "Sociology",
    "Religion",
    "History",
    "Philosophy",
    "Psychology",
    "Theology"
  ],
  "author": "Andrew Delbanco",
  "average_rating": "3.65",
  "url": "https://www.goodreads.com/book/show/30098.The_Death_of_Satan"
}