{
  "title": "Together: A Journey for Survival",
  "description": "The only way they would survive, was if they stayed … TOGETHER Sala Schonwetter lived the perfect life. Married to the man of her dreams, mother to two beautiful children, and a member of one of the most respected families in town; she had it all. The year was 1939, and the world was about to change. In a heartbreaking instant, she had to trade her life of security, family, and simple pleasures--for one of unspeakable loneliness, hardship, and danger. Nothing more than hunted prey, she relied on her inner strength and indomitable will to keep her children alive. But would it be enough? How far would she have to go, and did she have the resolve to get there? One thing she knew for sure ...she and her children would live or die one way …. TOGETHER. Manek was six years old when his world began to collapse. At first, his young eyes failed to see it, but reality came quickly into focus, when his loving gentle mother was forced to beat him in order to save his life. That is when he realized the Nazis wanted to kill him. Suddenly thrust into a new role as man of the house, would he be able to help keep his family safe? Was he strong enough to protect them? He knew only one thing ... they would survive if they could stay …TOGETHER. In A Journey for Survival, Ann Arnold shares her family's journey through Poland's countryside as a war of nations thunders around them. The story displays the magnificent strength of a mother's love and the incredible courage of good people during the worst of times. \"An important work. Ann Arnold's effort to both tell their tale of her family's survival during the Holocaust while being a part of encouraging the next generation to embrace tolerance is inspiring.\" -Michael Cohen, The Simon Wiesenthal Center \"A fascinating story that takes a reader inside an already wounded family toiling through horrific difficulty in the pursuit of life itself. .. it forces readers to ask themselves if they could endure a struggle or whether they might support another person in a life or death battle. This angle makes the book valuable for teachers to use and beneficial for students to read at the high school level.” -Lawrence M. Glaser, N.J. Commission on Holocaust Education “Incredible Story” –Northern Valley Press \"Arnold’s perspective is colored not only by those non-Jews who saved her father’s family but also by her experience visiting Brzostek as an adult.\" –New Jersey Jewish News",
  "genres": [
    "Holocaust",
    "Nonfiction",
    "World War II",
    "Memoir"
  ],
  "author": "Ann  Arnold",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/30102736-together"
}