{
  "title": "Nagasaki: The Massacre of the Innocent and Unknowing",
  "description": "Using contemporary diaries and letters, mainly translated from Japanese, we follow a group of Nagasaki residents, (including several Australian POWs) from the early morning of the day of the bombing of Hiroshima to midnight on the day of the second bombing in Nagasaki. The war was coming to an end at last. The people of Nagasaki knew this as they desperately tried to survive each day's shortages of food and warmth - ordinary people going about their lives as normally as they could manage. People like Nagai, the doctor who'd just been told he had leukemia; Father Tamaya, the obliging Catholic priest, who'd agreed to postpone a return to his rural parish; and Koichi, the mobilised tram driver, who secretly watched the Noguchi sisters sobbing behind the company toilet block. Because the bombing of Hiroshima had been so devastating and there was severe media censorship, they knew nothing of what had befallen that city except for the unbelievable stories told by a few survivors who had just now arrived. Beyond Japan, forces they could never have imagined were mustering as the Americans prepared to drop their next atomic bomb on the armaments manufacturing city of Kokura. Bad weather, however, sent the pilots and their terrible load to Nagasaki, where a small group of 169 POWs, including 24 Australians, were digging air-raid shelters and repairing bridges near what became the bomb's epicentre. And, above the heads of them all, the machinery of wartime politics stumbled on towards its catastrophic finale. In this compelling narrative - based on eye-witness accounts, contemporary diaries, letters and interviews - Craig Collie collects up the stories of the many levels of devastation suffered on that fateful day. We come as close as history will allow us to being there when 80,000 people died as a result of the bomb, half of that number instantaneously. The world had changed forever and the shock waves would ripple right up to the present day, as we continue to contemplate the terrible power of a nuclear future",
  "genres": [
    "History",
    "Nonfiction",
    "World War II",
    "Japan"
  ],
  "author": "Craig Collie",
  "average_rating": "4.26",
  "url": "https://www.goodreads.com/book/show/11876268-nagasaki"
}