{
  "title": "We Knew They Were Coming",
  "description": "Note, this is not a politically correct novel. Mankind's oldest question is, 'Are we alone' has been answered. A typing error changes the area of space NASA's Kepler probe searches for Earth-like planets. It records a very bright light, an anomaly that doesn't match anything in NASA's files. It records something heading towards Earth at a speed so high as to be unbelievable. Earth has just over four years to prepare. The outgoing US President spends months before he believes there really is something heading to Earth. NASA's code word for the object is unicorn. The mythical horned horse is coming. The President forms a committee to figure out what to do, he hands the hot potato to his successor who takes the leaders of only six other countries into his. confidence. The unicorn committee begins preparations, they decide to build shelters and arm the military with the most advanced weapons they can design and build in four years. Supply shortages ripple through the economy, rumors spread across the web. The government decides to take a drastic act in order to control the flow of information. As the unicorn speeds towards Earth, the government tries a unique way to spread what they hope is lifesaving information to the population, they hire survivalists, without telling them why, to spread information that something is coming and everyone needs to prepare. An amateur stargazer captures the bright light heading towards the planet. As the object draws closer, it begins to slow down, the bright light becomes additional lights, more than a single ship is coming. Panic spreads across the world. Everyone with a grievance attacks their enemies. When the objects arrive at Jupiter to refuel, their first act is to clear everything orbiting the planet, increasing the stress when GPS, communications, intelligence and debris is destroyed, leaving everyone on Earth without a lot of their toys. Their second act is to turn the world’s grid off. The United States President decides to attack the aliens with ground-based rail guns, striking a couple of the ships orbiting the planet, the alien’s respond by shutting off all electrical energy, including batteries. Earth is slapped back two hundred years. A small group of survivalists tries to apply their knowledge to build a new life. This is book 1 of a new series. It tells the story of the unicorn sighting, arrival, attack and the beginning of the rebuilding.",
  "genres": [
    "Science Fiction"
  ],
  "author": "Ira Tabankin",
  "average_rating": "3.93",
  "url": "https://www.goodreads.com/book/show/30122448-we-knew-they-were-coming"
}