{
  "title": "The Warrior’s Pet",
  "description": "Giselle didn't know how long she lay near catatonic willing the terrible headache to go away. She sat up as one of the reptilian aliens entered. Giselle backed up and looked around realizing she was alone in a gilded cage. \"What's going on?\" She stammered. \"If you're wise you'll keep quiet, pets don't speak on this planet.\" The creature admonished. A pet? Giselle's eyes widened. She hadn't misheard. Her cage was moved into a large tent. There were hundreds of aliens gathered for the auction, and these creatures were the largest yet. Their flesh was red like some kind of demon might be, with hair a uniform dark black. From what Giselle could see their eyes were a stone cold obsidian hue. Giselle noticed the fearsome creatures had long tails that rose out from what looked like chain mail kilts. Giselle shrunk back when she saw the creatures also had sharp fangs. How in the hell could she get out of this and if she did how could she possibly survive on an alien planet?  Kagan beheld his pet. Nothing like her kind had ever set foot on Cadi. Kagan wondered where in the universe her unique species hailed from. Giselle refused to behave and even enjoyed his attempts to rebuke her, reveling in the rough handling a male usually held back with females. Giselle was brave instead of meek, standing up for herself in a sea of foreigners. Kagan had at first insisted that Giselle understand her place in Cadi society. But something more valuable than precious metal or jewels would be lost if Giselle was forced into the role everyone thought she belonged.  Can Giselle find acceptance and love on an alien planet or will she always be nothing more than a warrior's pet?This book has adult content and may have triggers for some.",
  "genres": [
    "Aliens",
    "Science Fiction",
    "Romance",
    "Erotica",
    "Fantasy",
    "Science Fiction Romance",
    "Paranormal Romance"
  ],
  "author": "Stephanie  West",
  "average_rating": "4.01",
  "url": "https://www.goodreads.com/book/show/30115279-the-warrior-s-pet"
}