{
  "title": "Muscle: Luca's Story",
  "description": "***NOW GET LUCA'S STORY IN ONE AWESOME VOLUME!***  Luca Cassano is off-limits, hard-to-reach, and hotter than hell.  After the turf war that almost got Luca killed, a job in Miami working as a bodyguard sounds like just what the doctor ordered; sun, sand, and a completely straightforward job.  But as soon as he lays eyes on Isabel, he knows that being the hired muscle will be more a lot more complicated than he imagined.  Isabel Fuentes knows people think she’s spoiled and callous. Being the daughter of a notorious drug lord will do that to a girl, and things have only gotten worse since her father’s death. Now his drug empire is run by her brother, Diego, and while their father might have been a man without a conscious, Diego is a more dangerous animal entirely.  At first, Isabel thinks Luca is just another hired gun. Someone to keep her from pulling the wild stunts that remind her she’s still alive — that there’s still hope for something else. But it doesn’t take long to realize there’s more than meets the eye under Luca’s very hot facade.  And that is a complication she doesn’t need.  But when Diego reveals a nefarious reason for keeping Isabel close, she’s forced to rely on Luca instead of keeping her distance. Now he may be the only one who can save her — and the one man who can bring her alive with his touch.  ***Formerly published as a three part serial, The Muscle: The Complete Story includes all three parts as a standalone of approximately 420 pages.***   \"Romantic and intriguing. A gripping read!\" - NYT and USA Today Bestselling Author Lauren Blakely  \"Dark, seductive, compelling, and hot as HELL.\" - USA Today Bestselling Author Lili Valente  Hot sensuality and gripping suspense. Brace yourself for a perfect romantic journey!\" - NYT and USA Today Bestselling Author Angel Payne",
  "genres": [
    "Romance",
    "Abuse"
  ],
  "author": "Michelle St. James",
  "average_rating": "4.03",
  "url": "https://www.goodreads.com/book/show/30120366-muscle"
}