{
  "title": "Alrin",
  "description": "Perhaps the highest tragedy is that the one thing we all share is our greatest divide — the void within that drives us. Our insatiable desire for greatness is shadowed only by our overwhelming hatred for complacency. Whether for fame or fortune, aware of it or not, we strive for the highest rung only for our grasp to instantly crave the next ladder. Yet still we reach, for the void must always be filled.  Seventeen-year-old Alrin Turner lives in a place where power is everything, and pursuing it is the only thing that seems to ebb the burning desire. Each person is born with three numbers on their hand that show the might of their strength, magic and intellect, so seeing the full extent of one’s power is as simple as glancing in the mirror.  In a world teeming with such illustrious competition, qualities like kindness and humility are in short supply, and Alrin knows it all too well. He cares nothing of power and holds firm to the belief that there is more to life than what is found on your hand, despite the relentless insults he receives for it. While hunting in the woods with his brother, a selfless act forces Alrin off the edge of a cliff only for him to stop feet above the ground by a flash of brilliant light and a mysterious symbol that appears over his hand.  The source of this power intrigues a sudden benefactor, who takes Alrin under his wing to train him in his magic guild—an honor never before given to someone so insignificant. When mighty warriors start to appear in his town, Alrin not only learns that the power that saved him has been sought out for thousands of years, but like it or not, he has fallen into a story much larger than himself. Everyone he loves is either taken or cursed and Alrin is faced with an impossible task: delve deeper into the realm of power to unlock the riddle of the void and save his family, yet somehow cling to the part of himself that was worthy of power at the start.",
  "genres": [
    "Fantasy"
  ],
  "author": "Kyle  King",
  "average_rating": "3.89",
  "url": "https://www.goodreads.com/book/show/30111561-alrin"
}