{
  "title": "Shaman's Blood",
  "description": "A spell gone wrong in a Queensland burial cave accidentally bonds a Quinkan, a shadow demon from the Australian Dreamtime, to a wicked mixed-blood shaman named Cadjer Harrow. Through his carelessness, the half-aboriginal conjure man has unwittingly cursed his entire family for centuries to come, and now there will be hell to pay. Treating the Quinkan as a familiar, when the shaman tugs on the demon’s spirit cord the shapeshifter must follow, even if it means dropping a gutted meal in mid-swallow. Glued to the shaman’s bloodline, the bloodthirsty Quinkan haunts its generations in maliciously inventive ways while seeking release from its black magic bondage. Young Ned spends his childhood in the north Florida swamps with his mother, a snake-handling root doctor. Unfortunately for Ned, his innate magic is much more powerful than his mother’s, leading to her death in a wall of flame. But as Ned is to discover, fleeing his heritage is one thing he will never be allowed to do. The rest of his life will be spent trying to undo the curse holding him and his bloodline hostage. Alice Waterston, arts curator for a private North Florida museum specializing in global native cultures, knows all about Dreamtime legends. But when the Quinkan of legend suddenly confronts her in the waking world, Alice begins to question her sanity. The suspicious death of her uncle and the secrets surrounding her father’s disappearance in the Outback lead her to unearth some very disturbing local history involving a certain Rev. Harrow. Alice begins to see connections she can’t ignore, but is horrified to face. As Alice and her psychic daughter Margaret uncover more clues leading back to the origin of the curse, the furious demon gives them an ultimatum – find a way to break the centuries-old spell or die!\"Anne Petty's Wandjina's fantasies feature some marvelously drawn characters from modern Florida in collision with the world of Australian aboriginal dreamtime, via a collection of art and family mysteries. Readers of contemporary fantasy and horror will find an interesting freshness in these compelling tales.\" —Tolkien scholar and modern fantasy literary critic Douglas Anderson, The Annotated Hobbit; Tales Before Tolkien; Tales Before Narnia\"Petty delivers again. In Shaman's Blood, the followup novel to Thin Line Between, Petty picks up where she left off with an engaging and suspenseful tale. This sequel furthers a storyline with vivid characters and descriptive settings. Petty has proven to be a major player in the horror/suspense genre.\" —Horror writer & Bram Stoker nominee Daniel N. Shields, Seasons, Switching Channels",
  "genres": [],
  "author": "Anne C. Petty",
  "average_rating": "3.64",
  "url": "https://www.goodreads.com/book/show/11875885-shaman-s-blood"
}