{
  "title": "The Melodeon",
  "description": "A Christmas Gift is a reprint of a novel first published as The Melodeon by Doubleday in 1977. Glendon Swarthout later realized he'd given this holiday tale the wrong title and it was reissued in 1992 by St. Martin's Press with the missing \"Christmas\" in its title. This story was also made into a CBS Television movie in 1978, retitled yet again as A Christmas To Remember, starring Joanne Woodward and Jason Robards. That's were most readers have seen this story when it replays occasional winter holidays on TV. Very confusing to fans, though, with 3 different titles for this exact same Christmas story.This novella did make the New York Times bestseller list when first published and was very well received. It became a Reader's Digest Condensed book and was also condensed in Good Housekeeping magazine in December, 1992. Obviously A Christmas Gift has become a classic holiday tale with all these different editions and titles and a TV-Movie made from it, too.The season is Christmas, the place a remote Michigan farm during the Great Depression, and the miracles are many and wondrous, from a city boy's initiation into the marvels of nature to a thrilling journey that leads to a strange encounter with an ancestor long dead. A Christmas Gift is a remembrance of the American rural past and of the love, sacrifice, and devotion that unite four generations of a remarkable family. On a stormy Christmas Eve, young James and his old grandfather decide to give the family's heirloom melodeon (a small pump organ) to their impoverished local church so that, on Christmas morning, the congregation can sing to the accompaniment of inspiring music. But how are they to haul the heavy instrument through the most violent blizzard of the year? How? With fierce determination and the dubious help of four rambunctions girls -- and the intervention of the myserious Christmas \"cavalryman\" who will transform their lives. I challenge any reader to make it through this story's last poignant, memorable chapter without shedding a tear. No one has yet.",
  "genres": [
    "Christmas",
    "Fiction",
    "Historical Fiction",
    "Drama",
    "Historical",
    "Book Club",
    "Holiday"
  ],
  "author": "Glendon Swarthout",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/3011433-the-melodeon"
}