{
  "title": "Companion Huskies, Understanding, Training and Bonding with your Dog",
  "description": "Everything you need to know about Huskies in one concise publication! This book explores all aspects of husky ownership from puppy-hood to maturity. It encourages you to consider your husky’s natural behaviour and to channel their instincts into positive activities, and reveals why stimulating your dog’s mind has many behavioural and physical benefits. This comprehensive book includes a socialisation program that will help your puppy develop into a well adjusted, confident and well behaved adult and house training tips that get fast results. Fundamental information on how dogs learn and canine social behaviour will help you to understand what makes your dog 'tick' and will enable you to train your husky more effectively.You will find detailed instructions on how to teach all the basic obedience commands using various different positive training techniques, so that you can choose the method that best suits you and your dog. Included in this book are many suggestions for games that increase mental stimulation, fun sports and activities that you can enjoy with your husky that will strengthen your relationship and make training easier. Some common behavioural problems are covered in detail, explaining the causes, prevention and solutions, as well as a general problem solving guide, with a checklist to help you diagnose the cause of problems, with suggestions for what action may be needed in order to resolve them. All versions contain stunning photographs with bonus video links included in the Kindle edition. Watch huskies howling, playing, working and enjoying fun activities with their owners!Companion Huskies, Understanding, Training and Bonding with your Dog written by professional dog trainer and canine behaviourist Karen Davison, is essential reading for all new husky owners, and a valuable source of information for those of us who want to get the best out of our relationship with our them.",
  "genres": [],
  "author": "Karen Davison",
  "average_rating": "4.14",
  "url": "https://www.goodreads.com/book/show/30137873-companion-huskies-understanding-training-and-bonding-with-your-dog"
}