{
  "title": "Remember Me Always",
  "description": "NOW AVAILABLE ON AMAZON AND FREE ON KINDLE UNLIMITED!PENNY  Five years ago, I left for college in New York, leaving behind my hometown and my high school sweetheart. I had a plan after I graduated; but somewhere along the way, my train, which was on a one-way trip to happily ever after, somehow got derailed. And so I'm back in Willowbrook, Alabama for one reason and one reason only --- to confront Colton Crawford, the guy who broke my heart and a lot of promises. But instead of getting the answers I'm looking for, I only end up with even more questions.  Colton doesn't remember me, and I suddenly lost the most important person in my life in the blink of an eye. I don't know if I can win back his heart, but I'm going to try with every fiber of my being to bring Colton back to me.  COLTON  Everything changed five years ago, and my memory was basically wiped clean. A clean slate was exactly what I needed since I wasn't able to save my brother in the accident that almost claimed my own life. Bringin' up the past just makes me realize how much I've lost, and so forgettin' is what gets me through the day. Not wantin' to remember wasn't really a problem until a pretty blonde by the name of Penny Preston shows up in my bar demandin' answers…answers that I can't give her.  I try to ignore the longin' in my heart, but it's almost impossible. Somethin' keeps drawin' me back to her…no matter how hard I try to push her away. Even though my brain can't remember her, my heart just can't seem to forget.  **Remember Me Always is a 95,000-word stand-alone contemporary romance novel. It contains adult language and situations and is not intended for anyone under the age of 18.**",
  "genres": [
    "Contemporary",
    "Romance",
    "Second Chance",
    "Contemporary Romance",
    "New Adult",
    "Small Town Romance",
    "Love"
  ],
  "author": "Angela Snyder",
  "average_rating": "4.17",
  "url": "https://www.goodreads.com/book/show/30124543-remember-me-always"
}