{
  "title": "Will & Patrick Wake Up Married serial, Episodes 1 - 6: Wake Up Married / Meet the Family Do the Holidays / Fight Their Feelings / Meet the Mob / Happy Ending",
  "description": "Join the fun in this romantic comedy serial by best-selling author Leta Blake and newcomer Alice Griffiths!Episode One: Will & Patrick Wake Up MarriedAfter a drunken night of hot sex in Vegas, strangers Will Patterson and Dr. Patrick McCloud wake up married. A quickie divorce is the most obvious way out—unless you’re the heir of a staunchly Catholic mafia boss with a draconian position on the sanctity of marriage. Throw their simmering attraction into the mix and all bets are off!Episode Two: Will & Patrick Meet the FamilyMeeting the family is challenging for every new couple. But for Will and Patrick, the awkward family moments only grow more hilarious--and painful--when they must hide the truth of their predicament from the people they care about most. Throw in the sexual tension flaring between them and you've got a recipe for madcap laughs and surprisingly heartwarming feels.Episode Three: Will & Patrick Do the HolidaysA couple’s first holiday season is always a special time. Thanksgiving, Christmas, and New Year’s Eve are magical when you’re in love. Too bad Will and Patrick’s marriage is a sham and they’re only faking their affection for each other. Or are they? Sparks fly in this episode of the Wake Up Married serial. Will the sexual tension between Will and Patrick finally explode in a needy night of passion? Or will they continue to deny their feelings?Episode Four: Will & Patrick Fight Their FeelingsWill and Patrick have embraced adding hot sexy-times to their fake marriage, but as their emotions deepen, they confront whether or not they want to be more than friends-with-benefits. The heat is high (and occasionally kinky) as Will and Patrick struggle to accept their mutual affection.Episode Five: Will & Patrick Meet the MobPatrick has finally accepted that he's in love with Will, but his newfound determination to do something about that runs up against his father-in-law's mobster plans. Will must face the truth about his family before he can fully come to terms with his feelings for Patrick. And Patrick has to decide if this whackadoodle world is something he truly wants to be part of forever.Episode Six: Will & Patrick's Happy EndingSure, Will and Patrick are in love now, but they weren’t when they got married in Vegas. For Patrick, that’s no problem, but Will can’t shake his doubts that a relationship started through coercion can ever become the real deal. Since the Molinaro crime family has reversed their position on divorce, Will and Patrick have a chance to rectify their drunken mistake. But is divorce the right choice for them?",
  "genres": [
    "M M Romance",
    "Romance",
    "Contemporary",
    "LGBT",
    "Audiobook",
    "Queer",
    "Humor"
  ],
  "author": "Leta Blake",
  "average_rating": "4.25",
  "url": "https://www.goodreads.com/book/show/30127307-will-patrick-wake-up-married-serial-episodes-1---6"
}