{
  "title": "Sesso, erba e disastri vari",
  "description": "Bestseller thriller /romanzi rosa italiano! Più di 20.000 copie vendute!Quattro ragazzi, che tra una festa e l’altra, cercano di inseguire ognuno il proprio sogno, e di trovare la persona giusta.50 GIORNI nella Top 100 E book/ Primo in romanzi rosa italiani ,Ebooks online digitali LoveIl protagonista è Liam, un ragazzo che vuole diventare un pittore famoso, e si trasferisce in una grande città dopo la morte dei suoi genitori. Andrà a vivere con Jessa, hacker sessualmente disinibita e che fuma marijuana tutto il giorno, e Blaine, ragazzo sarcastico e pieno di sè che vuole sfondare nel mondo della musica.Questi sono i personaggi principali, insieme ad Hannah, la ragazza di Liam, aristocratica con crisi di rabbia, e Ellie, la zia di quest’ultimo, divorziata quarantenne che fa sesso con un partner diverso ogni sera.Le vicende dei protagonisti si snodano tra voglia di emergere, ricerca dell’identità sessuale, e tanto divertimento.\"Amo i romanzi rosa in italiano, quando non sconfinano nel patetico. Questo è pieno di elementi erotici, ma anche di colpi di scena, cosa difficile da trovare nei romanzi erotici rosa italiani. Davvero interessante, un pò bad boy e un pò bad love\"Ugo Eldori\" Leggere libri d'amore spesso è deludente, spesso se sono italiani, perchè spesso in questi ultimi manca verve ed originalità. In questo romanzo on line, scaricato su kindle ad un prezzo tra l'altro anche basso, c'è tutto: emozioni, originalità, e divertimento!!Lo consiglierei a chi cerca la qualità di un libro italiano che però non sia solo romantico ma anche avvincente, cosa rara nei romanzi rosa italiani \"Floriana Perecchi\" Davvero bello questo ebook ita, prende subito grazie a personaggi davvero ben strutturati! Non capita spesso nei romanzi rosa che si possono scaricare in pdf di trovare belle storie, perchè spesso su kindle le storie sono banali. Questa decisamente no!\"Federica Maccioniromanzi rosa italiano, romanzi erotici, libri erotici, libri per ragazzi, bad boy, bad love, thriller, dash, dark romance italiano, una perfetta sconosciuta, un amore senza fine\"Quanti romanzi rosa in italiano ho letto recentemente! E ne avessi trovato uno che valga la pena di finire....poi mi sono imbattuta in questo....per carità, gli elementi di amore ci sono, il classico bad boy pure, ma la cosa che ho adorato sono tutte le sovrastrutture. Si arrivano a conoscere i protagonisti come fossero i nostri migliori amici, cosa per niente scontato in un libro erotico thriller! Lo consiglio a chiunque voglia una lettura leggera ma coinvolgente, in stile bad love, per ragazzi dai diciotto in su direi!\"Eleonora Vettiromanzi rosa italiano, romanzi erotici, libri erotici, libri per ragazzi, bad boy, bad love, thriller, dash, dark romance italiano, una perfetta sconosciuta, un amore senza fine\" Jessa è in assoluto il mio personaggio preferito. E' sicura di sè, simpatica, e completamente fuori di testa, un pò come me. Mi piace un sacco, e fornisce tridimensionalità anche agli altri. Adoro questo romanzo thriller, anche se ha toni da romanzo rosa non è per niente melenso, come molti libri italiani, specialmente quando si parla di dark romance italiano. Lo considero uno dei migliori che abbia letto, un thriller con le palle, diciamo!\"Fabrizio Rocchi\" Un bel thriller, con elementi di romanzi erotici rosa in italiano.",
  "genres": [],
  "author": "Federico Calafati",
  "average_rating": "4.82",
  "url": "https://www.goodreads.com/book/show/30131499-sesso-erba-e-disastri-vari"
}