{
  "title": "Kings of the Fire Box Set",
  "description": "The four Dragomir brothers have been on the run since childhood, desperate to hide their true identity as the last dragon shifters after their parents were murdered in a bloody political coup. Now they are ready to retake their rightful place as leaders of the magical world, but only if they can find their fated mates.Witches, shifters, fae folk, and humans will have to come together to fulfill the prophecy that will bring peace to the magical world. But there are evil forces standing in their way. Can love overcome the odds?*************************This box set includes all four books of the Kings of the Fire series plus exclusive bonus content available nowhere else.Kings of the Fire 1: \nThe Dragon's Temptation\nFelicity Valdez just wants a simple life. She’s turned her back on her family legacy and escaped to a tiny Pennsylvania town. She’s even changed her name to cut all ties between herself and the powerful Valdez family, who rules the magical world. All she wants is to run her shop, a place where she can brew up potions and a damn fine cup of coffee. And maybe flirt with the gorgeous guy who keeps coming in to see her. But there’s more to Damien than meets the eye, and Felicity is soon caught up in intrigue that could shatter her simple life forever. Damien Dragomir has been on the run for decades. As the last dragon ruler of the magical world, he has sheltered his brothers from the Valdez family, usurpers who murdered his parents and would do the same to him if they could find him. Damien’s drive in life has been the safety of his family, but that was before he met Felicity. He can’t stop thinking about the beautiful witch who makes the killer coffee. Is the fire he feels for Felicity enough to trump his hatred of the Valdez name? Love is supposed to conquer all, but can it overcome their history?Kings of the Fire 2: \nThe Dragon's Conquest\nBlayze Dragomir never liked hiding. Now that he and his brothers have been exposed as the last of the dragon shifters, he's determined to make the most of this temporary fame. He's looking for fast women and fast money, but what he finds is no-nonsense private eye Ramona Jones. He has a special project that needs investigating ... and he might just need her in his life, permanently. Ramona Jones swore off dating long ago. She's content with building her business until Blayze Dragomir shows up, looking for help solving the mystery of who poisoned his sister-in-law. Taking the case will put her in danger from drug dealers and criminals, neither of which scares her. It's the way she feels about Blayze that frightens her to the bone.Kings of the Fire 3: \nThe Dragon's Undoing\nFor most of her life, Joy Valdez has never been anything but a frivolous party girl. After a brush with death, she's determined to turn her life around--even if life on the straight and narrow isn't as much fun. Then she meets brooding genius Vincent Dragomir, and he does something to her that's better than any party. Can Joy prove to Vincent--and herself--that she's the one for him? Vincent Dragomir has always felt more comfortable as a dragon than a man. He's witnessed first-hand what envy can do to men, and he wants nothing to do with that kind of greed and excess. Then he meets notorious party-girl Joy Valdez, and she sparks a flame in him that makes Vincent want to embrace his own humanity. When he and Joy cross paths with a vengeful witch, he wants nothing more than to protect her … but can he protect his heart?Kings of the Fire 4: \nThe Dragon's Redemption\nMarta Petrenko's life is complicated. She's an empathic witch who is able to channel the emotions of others, which is really helpful to her nursing career ... and not so helpful for her love life. Keeping people at a distance is painful, but necessary for her own sanity. Then she meets reclusive dragon shifter Arryn Dragomir. Suddenly, she just can't stay away. Arryn Dragomir has never been comfortable being a dragon. His second form is savage, and he tries to restrain that part of him as much as possible. But then he meets Marta, and the sizzling connection between them burns his restraint to ash. When an evil witch threatens their new love, Arryn will have to unleash the beast inside him to protect Marta ... and the rest of the magical world. The odds are against them, and time is running out. Can they join together to complete the prophecy and bring peace to the magical world?",
  "genres": [
    "Romance",
    "Paranormal",
    "Dragons",
    "Fantasy",
    "Anthologies",
    "Paranormal Romance"
  ],
  "author": "Lily Cahill",
  "average_rating": "4.21",
  "url": "https://www.goodreads.com/book/show/30132432-kings-of-the-fire-box-set"
}