{
  "title": "First Sight",
  "description": "NEW YORK TIMES BESTSELLERParis, L.A., and the world of ready to wear fashion provide rich backdrops for Danielle Steel’s deeply involving story of a gifted designer whose talent and drive have brought her everything—except the ability to erase her past and trust relationships.  FIRST SIGHT   New York. London. Milan. Paris. Fashion Week in all four cities. A month of endless interviews, parties, and unflagging work and attention to detail at the semiannual ready to wear fashion shows—the famous prêt-à-porter. At the center of the storm and avalanche of work is American Timmie O’Neill, whose renowned line, Timmie O, is the embodiment of casual chic, in fashion and for the home. She has created a business that inspires, fills, and consumes her life.    With an unerring instinct for what the next trend will be, an innate genius for business, tireless labor, and sheer fearlessness, starting from nothing, over two decades Timmie has built an international empire that has brought her enormous satisfaction and success. In a world where humility and compassion are all too rare, her humor, kindness, integrity, and creativity are inspirational. Yet as blessed as she feels by her success, Timmie harbors the private wounds of a devastating childhood and past tragedy. She is too smart, too experienced, and too hurt to want much in her personal life beyond a succession of convenient, very limited relationships. Always willing to take risks in business, she never risks her heart.   But despite her well-ordered and highly controlled world, it turns out that Timmie O’Neill is not immune to magic when it strikes. And it strikes in Paris during Paris Fashion Week, when an intriguing Frenchman comes into her life when she gets sick. At first, Timmie and Jean-Charles Vernier are only patient and physician. They become confidants and friends, corresponding at a safe distance between Paris and Los Angeles once she goes home. There is every reason why they must remain apart. But neither can deny their growing friendship and the electricity that sparks whenever they meet.  First Sight is as complex and compelling as modern life itself. Careers, families, histories, losses, duty, obligation, and fear of losing control and getting hurt. It is a tale of daring to take risks, and losing control just enough to have a life, when the opportunity presents itself. When two very different worlds and strong-willed people collide, everything changes in an instant, as they confront the age-old question of whether to lay oneself bare and risk intimacy—or not. Are they brave enough to face what comes next? And will they do it together or apart?",
  "genres": [
    "Romance",
    "Fiction",
    "Chick Lit",
    "Contemporary",
    "Adult Fiction",
    "Contemporary Romance",
    "Fashion"
  ],
  "author": "Danielle Steel",
  "average_rating": "3.81",
  "url": "https://www.goodreads.com/book/show/3013700-first-sight"
}