{
  "title": "Saying NO: 5 Customers You Need to AVOID to Make More Money",
  "description": "Do you feel like you’re always dealing with TERRIBLE customers?  Have you spent days or even weeks trying to make-it-work with a particular client, with no success?  Or maybe you’re starting to hate your job because you’re tired of working with clients who don’t respect your time and hard work?  This conversational and how-to oriented book is for professionals who want to bring their career to the next level (or simply make more money without begging for new clients), but for their whole life, have been stuck babysitting those TERRIBLE clients.  This Is For You If…  You don’t know when you’ll get the next new customer, and you force yourself to take on any possible customers (or projects), even if you absolutely hate working with them.  Every time someone walks through your door, you’re desperation took over, and your customer just know they’ve got you cornered.  You know how it goes.  You just terminated a terrible relationship with an old customer. You’ve been complaining and suffering for weeks during the time you were serving him (or her). You told yourself that NO WAY will you work with him (or her) again, matter of fact, not anyone like him (or her) ever.  Then…  You find yourself signing ANOTHER new contract with this awful customer. You have no idea why you’re doing it. Two second after you have the contract signed, you want to bang your head against the wall.  You know who you should be working for. In fact, you have a clear picture of the ideal prospect which will make your life so much easier, but you’re terrified to tell those bad customers, “I’m sorry. I won’t be able to help you right now. Perhaps I can recommend you to a trusted friend of mine.”  There are TONS of excuses, myths, and flat-out lies you use to persuade yourself to continue to take on the bad (or wrong) customers and accept any of their unreasonable requests.  Saying NO reveals those excuses and lies, and challenges everything you’ve been told about customer acquisition－urging you to say NO to unqualified and unreasonable customers.  This book is structured with proven formulas, solutions, and action plans that every service provider needs to know－no matter what specific professional.  What You’ll Discover In This Book  Saying NO gives you the foundation for your first book through: •The 5 types of customers you absolutely need to avoid. •The 2 types of requests you should be refusing. •How to identify your sweet spot and find the ideal prospect you can serve. •Why price doesn’t matter as much as you believe. •How to raise a positive NO to your customer without burning the bridge. •Simple strategies for creating scarcity for your service, building customer retainer, providing the absolute best service, and maximizing your customer lifetime value.  Follow the tips and advices given in this book and by the end, after putting what I have layout into action, you will bring your career to the next level.  Best of all, you will actually be getting more customers and making more money when you say NO more often.  This book shows how you can continue to do what you love most, free from the trouble of terrible customers you hate.  Before you buy the book, I have one question for you:  What’s stopping you from turning the job you hate into an amazing journey with great customer relationship faster than you ever thought",
  "genres": [],
  "author": "Wuyen Hsu",
  "average_rating": "4.60",
  "url": "https://www.goodreads.com/book/show/30134255-saying-no"
}