{
  "title": "The Stars of Constantinople: Stories",
  "description": "For many years Olafur Johann Sigurdsson was Iceland's premier writer. Prolific in a number of genres, he was the author of nine novels, five volumes of short stories, five books of poems, and several books for children. In 1976 he was the first Icelander to receive the Nordic Council Prize, which is given annually to the author of the most outstanding work of literature in all the Nordic countries. Sigurdsson was born in 1918, when Iceland was still a poor, predominantly rural land of farmers and fishermen. But during his lifetime he witnessed his country's swift transformation into a largely urban, technologically advanced society. The tensions between Iceland's traditional past and modern present are a signature theme in much of his work and are in strong evidence in The Stars of Constantinople.The twelve stories collected here, the first comprehensive sampling of Sigurdsson's writing available in English, were published in Iceland over a period of some thirty-five years and provide an excellent introduction to his fiction. They embrace a range of emotions and experiences, from the innocence of childhood in the isolation of the countryside, to the loneliness of life in a growing town, to the frustrations of old age. The two long stories with which the collection begins, \"The Changing Earth\" and \"Pastor Bodvar's Letter,\" represent the two poles of that range. In the first the effects of the revolving seasons on the Icelandic countryside form a backdrop to the coming-of-age of a farm youth who experiences first disillusionment and then a new sense of freedom as he matures and begins to appreciate the nature of love. \"Pastor Bodvar's Letter\" offers an ironic portrait of an aging, largely content man who, as he nears the end of his days, must come to terms with his life's disappointments.Many of the stories, particularly those told from the point of view of children, have the quality of fables. In the title story a boy is seduced by the boundless possibilities of a more exotic world represented by the trinkets proffered by a pair of wayfarers. In another, a child, inspired by an itinerant carpenter who has come to work at his family's farm, dreams of building a pyramid. Other stories are concerned with the fragility of human connections in an ever more impersonal society. In \"The Hand\" a solitary man and an old woman, lodgers in the same house, forge a tentative yet important bond. In \"The Blind Boy\" a composer, unable to complete his commissions, nonetheless is able to create beautiful music that soothes a sightless child.All twelve of these accomplished, elegantly written stories are testaments to Sigurdsson's remarkable talent and his highly personal, yet universal, vision.",
  "genres": [
    "Short Stories"
  ],
  "author": "Ólafur Jóhann Sigurðsson",
  "average_rating": "4.08",
  "url": "https://www.goodreads.com/book/show/3013810-the-stars-of-constantinople"
}