{
  "title": "Thom Harinck: Godfather of Muay Thai Kickboxing in the West",
  "description": "Memoirs of Thom Harinck, Kickboxing and Muay Thai LegendCelebrity kickboxing coach of countless national and international champions and mastermind behind three K-1 championships. Thom Harinck trained world champions such as Peter Aerts, Branko Cikatić, Gilbert Ballantine, Badr Hari and Hesdy Gerges, and has coached masses of students in his dojos in Amsterdam, Brazil and Japan. Harinck invented his own style of chakuriki, which is a unique mix of techniques from kyokushin karate, judo, boxing, jujutsu and wrestling.In Thom Harinck, Godfather of Muay Thai Kickboxing in the West, the 72-year-old coach candidly tells of the highs and the lows, the struggles and hard-won victories on his journey to becoming a living legend in the world of martial arts. He looks back on 40+ years of a remarkable career as a kickboxing coach, sharing anecdotes about his life as a bouncer, martial arts apprentice, stuntman and trainer.The book contains fascinating stories from the world of kickboxing, some of which have never been published before. Harinck relates the thrill of fighting in international tournaments, including intense battles in Thailand, the home of Muay Thai. We read about the sensei (teacher) of the Chakuriki dojo running barefoot with his students through the streets of Amsterdam at night, and about the deep friendships between Harinck and his fighters. His memoirs are filled with the Amsterdam tongue-in-cheek wit and wisdom of a man who has truly lived his life as an intrepid spirit, and to the fullest.The life of Harinck-san, as he is often called, has been anything but a quiet one. Although he announced his retirement in April 2013, he picked up training again in early 2016. The blood creeps where it cannot go, as the Dutch expression goes.“Thom Harinck is one of the finest kickboxing coaches ever on record. The list of great champions he has trained is long and full of superb fighters. Harinck's book is essential reading for all reality-based martial arts fans.” - Bob \"O'Hara\" Wall, American karate champion and co-star of Enter the Dragon.The book is illustrated with photos from Thom Harinck’s archive, documenting his life from humble beginnings as a shy Amsterdam kid to the celebrity coach of the present day. A selection of students and champions appear throughout the book, Richard Ploos, Iwan de Randamie, Saskia van Rijswijk, Rik van de Vathorst, Stuart Ballantine, Branko Cikatić, Tekin Donmez, Kenneth Plak, Corinne Geeris, Patrik Eriksson, Perry Ubeda, Nobu Hayashi, Peter Aerts, Badr Hari, Hesdy Gerges, Satoshi Ishii, Jérôme Le Banner, Menno Dijkstra, Amir Zeyada, and Gilbert Ballantine.The memoirs are based on numerous interviews with Harinck, keeping the style conversational and easy to digest.A must-read. Get your copy now.",
  "genres": [],
  "author": "Thom Harinck",
  "average_rating": "4.41",
  "url": "https://www.goodreads.com/book/show/30126768-thom-harinck"
}