{
  "title": "The Price for Their Pound of Flesh: The Value of the Enslaved, from Womb to Grave, in the Building of a Nation",
  "description": "Groundbreaking look at slaves as commodities through every phase of life, from birth to death and beyond, in early AmericaIn life and in death, slaves were commodities, their monetary value assigned based on their age, gender, health, and the demands of the market. The Price for Their Pound of Flesh is the first book to explore the economic value of enslaved people through every phase of their lives--including preconception, infancy, childhood, adolescence, adulthood, the senior years, and death--in the early American domestic slave trade. Covering the full \"life cycle,\" historian Daina Ramey Berry shows the lengths to which enslavers would go to maximize profits and protect their investments. Illuminating \"ghost values\" or the prices placed on dead enslaved people, Berry explores the little-known domestic cadaver trade and traces the illicit sales of dead bodies to medical schools.This book is the culmination of more than ten years of Berry's exhaustive research on enslaved values, drawing on data unearthed from sources such as slave-trading records, insurance policies, cemetery records, and life insurance policies. Writing with sensitivity and depth, she resurrects the voices of the enslaved and provides a rare window into enslaved peoples' experiences and thoughts, revealing how enslaved people recalled and responded to being appraised, bartered, and sold throughout the course of their lives. Reaching out from these pages, they compel the reader to bear witness to their stories, to see them as human beings, not merely commodities.A profoundly humane look at an inhumane institution, The Price for Their Pound of Flesh will have a major impact how we think about slavery, reparations, capitalism, nineteenth-century medical education, and the value of life and death.",
  "genres": [
    "History",
    "Nonfiction",
    "Race",
    "Economics",
    "American History",
    "Anti Racist",
    "Social Justice"
  ],
  "author": "Daina Ramey Berry",
  "average_rating": "4.32",
  "url": "https://www.goodreads.com/book/show/30152578-the-price-for-their-pound-of-flesh"
}