{
  "title": "Redstone",
  "description": "Delve deeper into the captivating world of The Ammolite Adventures with Redstone, an enthralling sequel that unveils new layers of mystery and adventure. Join Emily as she embarks on an epic quest across the enchanting realm of Acacia, where danger and magic intertwine. Having crossed the portal to Acacia in Bluestone, Emily now finds herself within the grand walls of Angkor, a magnificent castle nestled amidst this parallel world. Mounted on the awe-inspiring Bronte, a horse of impressive prowess, she sets out on a journey like no other. Accompanied by Pendon, a wise and reliable companion, Emily's path is fraught with challenges and discoveries. In her quest for knowledge and self-discovery, Emily aspires to become a powerful mage, capable of harnessing the depths of magic within her. Her determination to unlock her true potential propels her forward, despite the looming presence of Cyril—an archmage with dark intentions. Cyril's enigmatic influence adds an air of mystery and suspense to Emily's adventure, testing her resolve and resilience. As Emily's powers grow and her destiny unfolds, she sets her sights on a prestigious school of magic located on the mysterious Island of Bashan. Here, she must undergo a series of trials that will test her mettle and push her abilities to their limits. Alongside her loyal bondsmate, Xena, Emily strives to master the arcane arts and emerge as a force to be reckoned with. Redstone immerses readers in a world where magic reigns supreme and danger lurks around every corner. With its compelling blend of mystery, adventure, and the timeless themes of self-discovery and resilience, this captivating novel appeals to readers of all ages. Join Emily on her spellbinding journey as she unravels secrets, forms unbreakable bonds, and confronts the forces that threaten to shatter her dreams.",
  "genres": [
    "Fantasy"
  ],
  "author": "C.E.  Johnson",
  "average_rating": "4.63",
  "url": "https://www.goodreads.com/book/show/30150701-redstone"
}