{
  "title": "The Pure And The Hated",
  "description": "From The Acclaimed Author of SAVAGE HIGHWAY and APOSTLE RISING comes his latest thrilling noir mystery\"Godwin writes intelligent noir from a unique psychological perspective, delving deep into the nobler motives and emotions of his engaging characters while examining the darkest corners of the human heart. The faceless villain in this chiller is as real as a razor cut. THE PURE AND THE HATED is a story of love, generosity, betrayal, courage, evil, and hope. All set against a beautifully-rendered backdrop of Vermont. Before you sit down on a cool dark night to enjoy this one, make sure the doors and windows are locked.\"--Phil Bowie, author of the John Hardin suspense seriesA man takes a stranger into his house only to unleash a savage lesson from the past.Shepherd Butler and his wife Mary are grieving the death of their son Felton to a hunting accident in Vermont. When Shepherd finds a stranger freezing in the forest he offers him a home. The man, Maxwell Heed has suffered personal tragedy when his fiancée was murdered. He becomes part of the family and Shepherd’s nieces, Marigold and Joyce, and his sister Holly, instantly take to Maxwell, who is a sincere and religious man, seeking to understand the nature of forgiveness. The father of Shepherd’s nieces, Dwight Fisher, ran off years ago and Shepherd takes an active part in their lives. Maxwell feels like another family member. He tells Shepherd and Mary of the man who killed his fiancée.Temple Jones is a dangerous psychopath who preys on women. He has escaped justice. Maxwell fears he has followed him to Vermont. Shepherd tries to allay Maxwell’s fears. Maxwell disappears leaving a note saying he has seen Temple Jones. Then Temple Jones turns up.Using the natural beauty of Vermont as a backdrop to the action, the novel explores forgiveness and our understanding of one another. It explores family relations and the mind of a psychopath. A psychological crime novel about the past, the nature of justice, family secrets, the nature of forgiveness, revenge, identity, hunting and predation.\"A master of the noir genre ... Godwin is like finding a brilliant gem stone in a vast wasteland of sand and rock. A writer to watch for the decades to come.\"--Vincent Zandri, New York Times and USA Today Bestselling Author of The Remains and Orchard Grove\"An exceptional writer with an extraordinarily fine mind. ... His novels are always good with crackling dialogue. Read him.\"Luke Rhinehart, bestselling author of The Dice Man",
  "genres": [],
  "author": "Richard Godwin",
  "average_rating": "3.88",
  "url": "https://www.goodreads.com/book/show/30150877-the-pure-and-the-hated"
}