{
  "title": "Mermaid Jewels",
  "description": "WHEN AN EX-CON IS FRAMED FOR MURDER HE'S FORCED TO RETURN TO HIS LIFE OF CRIME TO FIND THE REAL KILLER.  Mike Fitzgerald is an ex-jewel thief trying to go straight, but since his release from prison someone has been committing robberies and making it look like he did them.  Mike finally gets a break when a wealthy couple hire him to draw a mural at their mansion, but his dreams of success soon dissolve when the wife is murdered in a botched robbery of jewels worth ten million dollars. Of course, Mike is the prime suspect and this leaves him with only two choices. Find the real killer, or spend the rest of his life on the run. At first, Mike runs for it, but in the Mexican border town of Rosarito Beach he comes across a crooked cop who convinces him that he can help find the real killer if Mike pays him a substantial bribe. Mike agrees and they return to the United States in search of the killer.As they search,  Mike discovers that he has been a puppet on a string ever since his release from prison, and the puppet master is about to cut the strings.WHAT OTHER AUTHORS ARE SAYING ABOUT MERMAID JEWELS.  \"MERMAID JEWELS is a gritty, tough tour de force that moves along at a breakneck pace. Grady's characters are hardcore and realistic. Hang on to your seat as he takes you on a ride you'll long remember.\" Vaughn C. Hardacker author of SNIPER, THE FISHERMAN, and THE BLACK ORCHID \"...Frank Grady makes us truly empathize with an ex-con turned artist who has to fall back on his original skill set to nab the real criminal who pins a crime on him. A truly fun, twisting mystery.\" C. Hope Clark, author of The Carolina Slade Mysteries and The Edisto Island Mysteries, Bell Bridge Books. \"Readers looking for a hard-boiled, edge-of-the seat action thriller are advised to grab Frank J. Grady's MERMAID JEWELS, then hold on tight for an adrenaline-pumping ride that doesn't ease upon the thrills until the last page.\" Harold Schechter, author of  THE SERIAL KILLER FILES.\" \"IMPRESSIVE DEBUT CRIME THRILLER!  Be prepared to lose a chunk of your life, because once you start reading this book, there is no way you'll be able to stop.\" John Benedict MD, best-selling author of Fatal Complications. \"... this book is full of surprises and unexpected twists.\" --Albert Ashforth, author of the spy thriller, The Rendition. \"Grady deftly hands us an ex con we can really care about as he fights for his life against corrupt cops and murderous medicos.\" Caroline Taylor, author of Jewelry from a Grave. \"You'll find yourself cheering for an ex-con determined to beat the odds.\" Gail Oust, author of the Spice Shop Mysteries \"Murder, manipulation and millions of dollars in stolen jewels add up to a gem of a first novel by Frank Grady.\" Glenn Ickler, author of One Death Too Many and many other mystery novels. \"A murderous collage of art and intrigue.\"  Mario Acevedo, author of Rescue From Planet Pleasure. \"In Frank Grady's debut novel, Mermaid Jewels, he's created a beguiling main character in ex-con Mike Fitzgerald.\" Michael Haskins, author of the Mick Murphy Key West Mystery Series \"Fasten your seat belts and prepare for a tense and haunting version of rehabilitation.\" Michael A. Kahn, award-winning author of The Sirena Quest and the Rachel Gold mystery series.\" \"Get ready for a wild ride with an ex-con and jewel thief who must run for his life and return to his old profession to survive bad cops on both sides of the US-Mexico border when set up for murder.\" Mike Befeler, author of Murder on the Switzerland Trail, and the Paul Jacobson Geezer-lit Mystery Series \"Get ready to be enthralled. Frank Grady's debut novel, MERMAID JEWELS, is guaranteed to keeps its readers riveted in page-turning suspense.\" Judith Marks-White, author of Seducing Harry and Bachelor Degree, Random House/Ballantine",
  "genres": [],
  "author": "Frank  Grady",
  "average_rating": "4.88",
  "url": "https://www.goodreads.com/book/show/30162079-mermaid-jewels"
}