{
  "title": "The Last Road Home",
  "description": "\"This novel is sure to join the rich canon of Southern literature.\" --Anna Jean Mayhew, author of The Dry Grass of AugustFrom Pushcart Prize nominee Danny Johnson comes a powerful, lyrical debut novel that explores race relations, first love, and coming-of-age in North Carolina in the 1950s and '60s.At eight years old, Raeford \"Junebug\" Hurley has known more than his share of hard lessons. After the sudden death of his parents, he goes to live with his grandparents on a farm surrounded by tobacco fields and lonesome woods. There he meets Fancy Stroud and her twin brother, Lightning, the children of black sharecroppers on a neighboring farm. As years pass, the friendship between Junebug and bright, compassionate Fancy takes on a deeper intensity. Junebug, aware of all the ways in which he and Fancy are more alike than different, habitually bucks against the casual bigotry that surrounds them--dangerous in a community ruled by the Klan.On the brink of adulthood, Junebug is drawn into a moneymaking scheme that goes awry--and leaves him with a dark secret he must keep from those he loves. And as Fancy, tired of saying yes'um and living scared, tries to find her place in the world, Junebug embarks on a journey that will take him through loss and war toward a hard-won understanding.At once tender and unflinching, The Last Road Home delves deep into the gritty, violent realities of the South's turbulent past, yet evokes the universal hunger for belonging.Advance praise for The Last Road Home\"In this intense and well?written debut novel, Danny Johnson probes deep into the cauldron of racial relations in the 1960's South.  The Last Road Home  introduces an exciting new voice in Southern Literature.\" --Ron Rash, author of Above the Waterfall\"In The Last Road Home , Danny Johnson evokes a South that in many ways may be gone, thank the Lord. Yet Johnson's compelling and heartfelt rendering of Junebug and Fancy couldn't be more charged and alive. The long dramatic arc of their deep and ever evolving relationship traces a time and a place giving way to change in violent fits and starts. Yet this is no sociological treatise. It's a flesh and blood story about two people, who risk just about everything time and time again, for nothing more and nothing less than to love each other.\" --Tommy Hays, author of In The Family Way\" The Last Road Home  took me straight into the heart of a wounded boy who becomes a complicated man. By the end of this stunning novel, I felt I'd come to understand humans better than I had before, how we come to be the way we tender and full of fury. I don't recall having such a reaction to a novel.  Author Danny Johnson shrinks from nothing. I read it!\" --Peggy Payne, author of Cobalt Blue\"Johnson's moving novel beautifully portrays the ways in which his young characters struggle to overcome the history that has so fully shaped their lives.\" --John Gregory Brown, author of Decorations in a Ruined Cemetery",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Book Club",
    "Coming Of Age",
    "Adult Fiction",
    "Literary Fiction"
  ],
  "author": "Danny  Johnson",
  "average_rating": "4.18",
  "url": "https://www.goodreads.com/book/show/30179357-the-last-road-home"
}