{
  "title": "Inside Job: Unmasking the 9/11 Conspiracies",
  "description": "The 9/11 Official Story...or Inside Job? Find out in this startling analysis by a leading investigative journalist.A Sobering Look at 9/11 as an Inside JobThe official story about 9/11 is discredited. That is the sobering conclusion reached by millions of Americans, all across the political spectrum, who have sifted through the evidence uncovered by hundreds of independent researchers. Many honest citizens are now forced, with sadness and reluctance, to make an almost unthinkable Powerful US officials must have had foreknowledge of the planned attacks, and then acted from the inside thwart efforts to prevent 9/11, remove or cover up criminal evidence, and hamper inquiries into what happened.Were the horrific events of September 11, 2001 truly an inside job? This book will help you decide for yourself. In this work, world-renowned conspiracy theorist Jim Marrs makes a compelling case that 9/11 marks the intersection of several conspiracies at once, each based on overlapping political agendas. Support for his thesis comes from this sampling of the many disturbing anomalies, cited by • Standard air defense mechanisms systematically failed, simultaneously.• Interceptor jets were scrambled too late, too slowly, and from the wrong locations.• President Bush proceeded with a \"photo op\" long after he knew we were under attack.• Fires could not have caused the free-fall collapse of the World Trade Center towers.• The collapse of Building 7 in the complex was later admitted to be a demolition.• Vital physical evidence was either removed or has never been released to investigators. • Key officials claimed warnings never came, despite massive evidence to the contrary.Inside Job is the definitive journalistic account of the hidden role of the Bush administration in failing to prevent the 9/11 attacks. The author provides heavy documentation of his findings, plus extensive appendices that include perspectives from families of 9/11 victims, and excerpts from the RICO Act lawsuit filed by 9/11 widow Ellen Mariani.",
  "genres": [
    "Conspiracy Theories",
    "Nonfiction"
  ],
  "author": "Jim Marrs",
  "average_rating": "3.93",
  "url": "https://www.goodreads.com/book/show/301805.Inside_Job"
}