{
  "title": "Nana Du Ký",
  "description": "Với con người, thăm thú chỗ này, gặp gỡ người kia, đều là chuyện thường chẳng đáng nhắc đến. Với mèo lại khác. Chẳng có mấy con mèo cả gan vượt ra ngoài lãnh thổ bé xíu của mình, chứ đừng nói tới việc du lịch đây đó. Thế nhưng, Nana với cái đuôi cong cong hình số 7 may mắn lại là một chú mèo đặc biệt… Vốn là mèo hoang, được một anh cuồng mèo nhặt về nuôi và đặt tên Nana (vì đuôi nó cong như số 7). Anh ấy yêu nó mê mệt, và Nana dĩ nhiên cũng mến thương anh sâu sắc. Một ngày nọ, anh chủ gặp cảnh ngộ không may, không thể nuôi Nana được nữa, bèn tính toán chốn nương thân cho nó. Một người một mèo, vậy là rong ruổi trên chiếc ô tô màu xám bạc, lần lượt tìm đến những người quen cũ yêu mèo để xem ai phù hợp thì gửi gắm. Và ở mỗi chặng thì Nana lại đưa ra những nhận định sắc sảo về những điều nó trải nghiệm. Sinh vật bé nhỏ kêu meo meo ấy là điểm nhấn của câu chuyện này, với tất cả những điềm tĩnh, kiên cường, quyết đoán, tinh tế, biết ơn đền ơn công bằng của nó. Nhưng bên cạnh đó, hoặc bao trùm đó, đây là câu chuyện thuần hậu êm ái hiếm thấy, tôn vinh lòng nhân hậu và tinh thần lành mạnh lạc quan kiểu Nhật, một tinh thần cuộn dày và rõ nét dần lên theo mỗi chặng hành trình của người và mèo, qua núi Phú Sĩ trắng toát, qua đồng cúc dại tím sẫm, qua rặng thanh lương trà đỏ thắm, qua cả những biến đổi huy hoàng của thiên nhiên ôn đới trên quần đảo núi lửa này. Cùng với nhau, người và mèo đã tạo nên một chuyến hành trình màu nhiệm. Màu nhiệm, không chỉ bởi được khám phá những điều mới lạ, hoặc chứng kiến những cảnh sắc rung động tâm hồn, hay gặp gỡ những người những vật đa sầu đa cảm. Màu nhiệm, còn bởi chuyến đi ấy đã làm thay đổi không chỉ một mà nhiều số phận. Và hơn hết màu nhiệm, vì ngập tràn yêu thương. Mà yêu thương, với mèo hay với người, cũng đều là điều thiêng liêng không dễ gì đánh đổi. Có thể bạn sẽ khóc nức nở, cũng có thể sẽ mỉm cười. Nhưng chắc sẽ muốn nuôi một con mèo sau khi đọc xong Nana du ký đấy, nếu chưa nuôi.",
  "genres": [
    "Fiction",
    "Contemporary",
    "Japan",
    "Animals",
    "Cats",
    "Japanese Literature",
    "Literary Fiction"
  ],
  "author": "Hiro Arikawa",
  "average_rating": "4.33",
  "url": "https://www.goodreads.com/book/show/30177276-nana-du-k"
}