{
  "title": "A Ring of Endless Light",
  "description": "Book four of the Austin Family Chronicles, an award-winning young adult series from Madeleine L’Engle, author of A Wrinkle in Time , about a girl who experiences the difficulties and joys of growing up.A Newbery Honor Book“L'Engle has the magic storytelling gift that makes it a pleasure to lose yourself in her spell.” ― NewsweekAfter a tumultuous year in New York City, the Austins are spending the summer on the small island where their grandfather lives. He's very sick, and watching his condition deteriorate as the summer passes is almost more than Vicky can bear. To complicate matters, she finds herself as the center of attention for three very different boys.Zachary Grey, the troubled and reckless boy Vicky met last summer, wants her all to himself as he grieves the loss of his mother. Leo Rodney has been just a friend for years, but the tragic loss of his father causes him to turn to Vicky for comfort―and romance. And then there's Adam Eddington. Adam is only asking Vicky to help with his research on dolphins. But Adam―and the dolphins―may just be what Vicky needs to get through this heartbreaking summer.Praise for A Ring of Endless Light :“With customary grace and firm control of an intricate plot, L'Engle has created another irresistible novel about familiar characters, the Austin family. Vicky, 16, narrates the climactic events with Grandfather Eaton on a New England island, where he is living his last days.” ― Publishers Weekly“L'Engle has the magic storytelling gift that makes it a pleasure to lose yourself in her spell.” ― Newsweek“L'Engle writes eloquently about death and life with provocative passages that linger in the thoughts of the perceptive.” ― Booklist, s tarred reviewBooks by Madeleine L'EngleA Wrinkle in Time QuintetA Wrinkle in TimeA Wind in the DoorA Swiftly Tilting PlanetMany WatersAn Acceptable TimeA Wrinkle in The Graphic Novel by Madeleine L'Engle; adapted & illustrated by Hope LarsonIntergalactic P.S. 3 by Madeleine L'Engle; illustrated by Hope A standalone story set in the world of A Wrinkle in Time .The Austin Family ChroniclesMeet the Austins (Volume 1)The Moon by Night (Volume 2)The Young Unicorns (Volume 3)A Ring of Endless Light (Volume 4) A Newbery Honor book!Troubling a Star (Volume 5)The Polly O'Keefe booksThe Arm of the StarfishDragons in the WatersA House Like a LotusAnd Both Were YoungCamillaThe Joys of Love",
  "genres": [
    "Young Adult",
    "Fiction",
    "Fantasy",
    "Childrens",
    "Romance",
    "Science Fiction",
    "Classics"
  ],
  "author": "Madeleine L'Engle",
  "average_rating": "4.17",
  "url": "https://www.goodreads.com/book/show/3017901-a-ring-of-endless-light"
}