{
  "title": "Rule by Secrecy: The Hidden History that Connects the Trilateral Commission, the Freemasons & the Great Pyramids",
  "description": "What connects the Great Pyramids, Masons & the Council on Foreign Relations? Journalist Jim Marrs examines the world's most closely guarded secrets, tracing the history of clandestine societies & the power they've wielded--from the ancient mysteries to modern conspiracy theories. He gives evidence that the movers & shakers of the world collude covertly to start & stop wars, manipulate stock markets, maintain class distinctions & censor the news. Rule by Secrecy offers a worldview that may explain who we are, where we came from & where we're going.A question of conspiracy; Rule by the few; A view from the few--Modern secret societies. The Trilateral Commission; Council on Foreign Relations; Bilderbergers; Rockefellers; Morgans; Rothschilds; Secrets of money & the Federal Reserve System; Empire building; The Royal Institute of Internat'l Affairs: round tables; Rhodes & Ruskin; Skull & Bones; Tax-exempt foundations & alphabet agencies; It's news to us; Commentary--The fingerprints of conspiracy. Report from Iron Mountain; Persian Gulf; Who pays the tab?; Vietnam; JFK opposed globalists; All the way with LBJ; Trading with the enemy; Korea; Rise of the Nazi cult; Theosophists, Thulists & other cultists; The Leader arrives; Hitler's support group; Hitler's fortune turns; Japan against the wall; WWII; Business as usual; WWI; A stimulus for war; The Russian Revolution; The rise of communism; Commentary--Rebellion & revolution. War between the States; Secret society agitation; Preemptive strikes; The Anti-Masonic movement; The French Revolution; Jacobins & Jacobites; Sir Francis Bacon & the New Atlantis; The American Revolution; The Illuminati; Freemasonry; Count Saint-Germain & other magicians; Masonic plots; Freemasonry vs Christianity; Rosicrucians; Commentary--Elder secret societies. Knights Templar; Assassins; Templar bankers & builders; Cathars; The Albigensian Crusade; The Templars' demise; The Priory of Sion; Merovingians; A far-reaching web; Commentary--Ancient mysteries. The road to Rome; The Cabala; Ancient secrets & mysteries; Was there more to Moses?; All roads lead to Sumer; The Anunnaki; Floods & wars; Commentary",
  "genres": [
    "Conspiracy Theories",
    "History",
    "Nonfiction",
    "Politics",
    "Occult",
    "Science",
    "Religion"
  ],
  "author": "Jim Marrs",
  "average_rating": "3.94",
  "url": "https://www.goodreads.com/book/show/301801.Rule_by_Secrecy"
}