{
  "title": "The Devil's Due",
  "description": "A country at war. A man on the run. A woman left behind. Can an innocent man ever go home?Guilty of a crime he didn’t commit, IRA soldier Frank Kelleher flees through the streets of war-torn Ireland with both the British and the Irish Republican Army trying to put a bullet in his head. He makes his way to America under an assumed name and with a forged passport, as the war in Ireland rages on. Settling in a new land, he finds he can’t let go of his past. Haunted by the fiancée he was forced to leave behind, by the deaths of three friends at his own hand, and by the country he was forced to abandon, Frank struggles to make his way in 1920s New York. As much as he can’t let go of Ireland, he finds that Ireland can’t let go of him—and his past has a way of finding him, thousands of miles and an ocean away. After a chance encounter leaves him bruised and shaken, he realizes he’s no longer safe, not even in America. He dreams of going home but knows that it could get him killed. Then an anonymous letter brings news about his fiancée Kathleen and he realizes that he no longer has a choice. A cease-fire is declared and Frank sails home with dreams of finding Kathleen, putting his past behind him, and starting a new life. When he arrives, he finds that the Ireland he dreamed of was just that—a dream. With British soldiers withdrawing, long-standing feuds resurface, and his fellow countrymen begin choosing sides. As the country teeters on the brink of another war, Frank learns that his sins will not be easily forgiven, and that he and Kathleen will never be safe unless he can clear his name. If the looming war doesn’t kill him, trying to right the wrongs of his past just might.Best Selling Author L.D. Beyer delivers a suspenseful drama that will “…push him to the top of the heap of contemporary thriller/historic fiction writers.”",
  "genres": [
    "Fiction",
    "Historical",
    "Thriller",
    "Mystery Thriller"
  ],
  "author": "L.D. Beyer",
  "average_rating": "3.92",
  "url": "https://www.goodreads.com/book/show/30198416-the-devil-s-due"
}