{
  "title": "The Beta's Test",
  "description": "A werewolf who's spent his life without a pack meets a werewolf whose pack is the only reason he's alive. When these opposites attract, they both find out what they've been missing all along.Brody Marshall's parents never thought they needed any more pack than each other--but when they died and left Brody orphaned, he had no pack at all. Raised by a human foster mother, Brody has grown up into a geek who hides his wolf nature and is about to score his dream job. At his interview he meets genius programmer (and omega werewolf) Sam Hurley, and soon finds out that although Sam has a mate and a pack at home, he has more to offer Brody than just a job. Nick Bellici has been a werewolf for a little over a month, since his best friend (and alpha werewolf) Rusty rescued him from his downward spiral by bringing him to California to join Rusty's pack. Unfortunately, wolf shifting abilities and sharing a bed with three hot werewolves haven't magically cured all of Nick's problems. He's still struggling to find his place in the pack when Rusty's mate, Sam, brings home Brody--a beta werewolf, just like Nick. When Nick meets Brody, the attraction is instantaneous, but Nick has more scars than the ones that show on his skin, and when it comes to loving Brody, he's got to get it right without (much) help from his pack. Brody wants Nick, but when it comes to life with a pack who share everything and building something with Nick that's just between the two of them, he knows he's out of his depth. When these two betas join forces, will they sink or swim? The Beta's Test is a steamy m/m (and m/m/m/m/m) werewolf romance featuring a sexy geek and a scarred veteran finding love and lots of happy endings with each other and with their pack!",
  "genres": [
    "M M Romance",
    "Paranormal",
    "Romance",
    "Shapeshifters",
    "Menage",
    "Fantasy",
    "Erotica"
  ],
  "author": "Dessa Lux",
  "average_rating": "3.83",
  "url": "https://www.goodreads.com/book/show/30197823-the-beta-s-test"
}