{
  "title": "Touched by Time",
  "description": "What if answering a strange-looking ad in the newspaper made it so you traveled back in time to 1892?In a world where time travel is an unexpected reality, Kimberly finds herself at a crossroads. Trapped in a job where her boss thrives on making her miserable, she yearns for a change. It's during a casual perusal of the classifieds that an intriguing ad catches her attention, beckoning her towards an extraordinary journey.Victoria, a resourceful widow with a hidden secret, resides in the year 1892. Determined to stay occupied and extend her helping hand, she begins matchmaking, placing ads for men who want a mail-order bride. Little does she know, her path will intersect with Kimberly's, altering the course of their lives forever.Patrick, a contented rancher, craves companionship but struggles to find it in the secluded Rocky Mountains. Seeking assistance from Victoria's unconventional service, he dreams of finding a woman who can embrace his way of life. Unbeknownst to him, Victoria contemplates sending someone from the future—Kimberly, the unsuspecting candidate.As Kimberly and Patrick are thrown together across the chasm of time, they must confront their differences and learn to embrace acceptance. Will their connection be strong enough to forge a new path, allowing them to create a family of their own?If you enjoy sweet time travel and western romances, this series is for you!100% Recommended. Enjoyed very much. Fantastic. Kindle CustomerI made the mistake of starting to read this book as I went to bed. Big Mistake!!! I couldn’t stop reading. Very hard to put down.This is a great time travel novel and the beginning of a great series. OTHER BOOKS IN THIS Book 1: Touched by TimeBook 2: River of TimeBook 3: Winds of TimeBook 4: Secrets of TimeBook 5: Changed by TimeBook 6: Christmas in Time",
  "genres": [
    "Time Travel",
    "Romance",
    "Time Travel Romance",
    "Westerns",
    "Fantasy",
    "Historical Romance",
    "Historical"
  ],
  "author": "Zoe Matthews",
  "average_rating": "4.02",
  "url": "https://www.goodreads.com/book/show/30188590-touched-by-time"
}