{
  "title": "Hammers on Bone",
  "description": "Cassandra Khaw bursts onto the scene with Hammers on Bone, a hard-boiled horror show that Charles Stross calls \"possibly the most promising horror debut of 2016.\" A finalist for the British Fantasy award and the Locus Award for Best Novella!John Persons is a private investigator with a distasteful job from an unlikely client. He’s been hired by a ten-year-old to kill the kid’s stepdad, McKinsey. The man in question is abusive, abrasive, and abominable.He’s also a monster, which makes Persons the perfect thing to hunt him. Over the course of his ancient, arcane existence, he’s hunted gods and demons, and broken them in his teeth.As Persons investigates the horrible McKinsey, he realizes that he carries something far darker. He’s infected with an alien presence, and he’s spreading that monstrosity far and wide. Luckily Persons is no stranger to the occult, being an ancient and magical intelligence himself. The question is whether the private dick can take down the abusive stepdad without releasing the holds on his own horrifying potential. Finalist für den British Fantasy Award und den Locus AwardCharles  »Das möglicherweise vielversprechendste Horrordebüt des Jahres.«Alle fünf Bände der 24er-Ausgabe von Cemetery Dance Germany SELECT sind von Vincent Chong illustriert, haben illustrierte Vor- und Nachsatzpapiere sowie 3 Innenillustrationen.HINWEIS Gesamtausgabe & Die fünf Bände von Cemetery Dance Germany SELECT '24 - LOVECRAFTIAN VIBES sind ebenfalls als Gesamtausgabe im Sammlerschuber erhältlich. Die Hardcover der ersten Auflage der Gesamtausgabe werden einen digitalen Farbschnitt erhalten. Ein bestehendes CDG-SELECT-Abo (direkt beim Verlag) zählt ebenfalls in Bezug auf die erste Auflage der Gesamtausgabe mit Farbschnitt.",
  "genres": [
    "Horror",
    "Fantasy",
    "Novella",
    "Fiction",
    "Urban Fantasy",
    "Mystery",
    "Lovecraftian"
  ],
  "author": "Cassandra Khaw",
  "average_rating": "3.62",
  "url": "https://www.goodreads.com/book/show/30199328-hammers-on-bone"
}