{
  "title": "Soundscape",
  "description": "“Set the music free!” Welcome to Soundscape—where the Red States rule… pot is legal, but owning a Beatles album can get you arrested… and 20-foot walls surround the last remnants of liberal America. It's the final days of summer in the year 2024: For eight years, ever since a nuclear terror scare swept Republican President Tom Ballinger into office over Hillary Clinton, the GOP's conservative wing has controlled the nation. Now, with a Presidential election two months away and sitting Vice President William Acton well ahead in the polls, they're poised to tighten their grip. Democratic presidential candidate Maxwell Fish is committed to rolling back America's growing inequality and reversing the nation's conservative tide—but as he sits trapped in his Manhattan apartment, under house arrest by the ruling Republican authorities, his chances of defeating Acton and winning the White House are slipping away. The liberal Municipal Alliance has a plan that could turn the election around, but its success depends on the breakthrough invention of Blake Hawkes, a 26-year-old physicist and music aficionado. The problem: Hawkes is on the run from the U.S. government—hunted by Homeland Security and the Culture Hygiene police, who want to arrest him for possession of illegal rock music recordings. Hawkes has disappeared into the Urban Zone, an alternate inner-city universe that is the last refuge for the nation's few remaining rock musicians and what's left of the progressive movement. After he joins forces with the UZ's renegade world of sex, drugs and rock and roll, Hawkes finds himself in a race against time, with America's political future hanging in the balance. Soundscape is infused by classic rock and roll, quantum mechanics and a political showdown between the nation's Red States and Blue Cities. It includes original song lyrics by the author, and a climax that no reader will soon forget! Soundscape—where hearing is believing.",
  "genres": [],
  "author": "Royce Flippin",
  "average_rating": "4.67",
  "url": "https://www.goodreads.com/book/show/30191783-soundscape"
}