{
  "title": "Gunmetal Gray",
  "description": "Mark Greaney, the #1 New York Times bestselling co-author of Tom Clancy's Jack Ryan novels, delivers another breakneck thriller following the world's deadliest assassin the Gray Man.\nAfter five years on the run Court Gentry is back on the inside at the CIA. But his first mission makes him wish he had stayed on the outs when a pair of Chinese agents try to take him down in Hong Kong. Normally the Chinese prefer to stay eyes-only on foreign agents. So why are they on such high alert?Court's high stakes hunt for answers takes him across Southeast Asia and leads to his old friend, Donald Fitzroy, who is being held hostage by the Chinese. Fitzroy was contracted to find Fan Jiang, a former member of an ultra-secret computer warfare unit responsible for testing China's own security systems. And it seems Fan may have been too good at his job because China wants him dead.The first two kill teams Fitzroy sent to find Fan have disappeared and the Chinese have decided to supervise the next operation. What they don't know is that Gentry's mission is to find Fan first and get whatever intel he has to the US.After that, all he has to do is get out alive...“I Love the Gray Man.”—#1 New York Times bestselling author Lee Child“Bourne for the new millenium.”—New York Times bestselling author James Rollins“Mark Greaney reigns as one of the recognized masters of action and adventure. Back Blast is no exception.”—New York Times and #1 internationally bestselling author Steve Berry“Fast-paced [and] tightly written...A great ride.”—New York Times bestselling author Larry Bond“Punches with bone-busting power…Flesh-and-blood priceless.”—New York Times bestselling author Stephen Templin“Greaney’s unraveling of the Back Blast mystery is masterly, but it’s the Gray Man’s ability to outthink and outgun...that will keep readers glued to the pages.”—Publishers Weekly (starred review)“[A] high-energy thriller...Clancy fans will have a blast.”—Kirkus Reviews",
  "genres": [
    "Thriller",
    "Fiction",
    "Audiobook",
    "Action",
    "Espionage",
    "Mystery Thriller",
    "Mystery"
  ],
  "author": "Mark Greaney",
  "average_rating": "4.46",
  "url": "https://www.goodreads.com/book/show/30189669-gunmetal-gray"
}