{
  "title": "The Rural Setting Thesaurus: A Writer's Guide to Personal and Natural Places",
  "description": "Within the pages of a book exists a world drawn from a writer’s deepest imaginings, one that has the ability to pull readers in on a visceral level—but only if the realm and its inhabitants can be described well. This can be achieved by providing readers with a unique sensory experience via the setting. So much more than stage dressing, the setting can build mood, convey meaning through symbolism, drive the plot by creating challenges that force the hero to fight for what he wants, and trigger emotions which will reveal his most intimate feelings, fears, and desires. Inside The Rural Setting Thesaurus, you’ll find: •\tA list of the sights, smells, tastes, textures, and sounds for over 100 settings revolving around school, home, and nature•\tPossible sources of conflict for each location to help you brainstorm ways to naturally complicate matters for your characters•\tAdvice on the many effective ways to build mood, helping you steer both the character’s and readers’ emotions in every scene•\tInformation on how the setting directly influences the plot by acting as a tuning fork for what a character needs most and by testing his dedication to his goals •\tA tutorial on figurative language and how different descriptive techniques can bring settings alive for readers while conveying a symbolic message or deeper meaning•\tA review of the challenges that arise when writing description, as well as special considerations that apply specifically to rural and personal settings•\tDownloadable tools that encourage a deeper sensory and emotional exploration of each settingThe Rural Setting Thesaurus takes “show-don’t-tell” to new heights. It offers writers a roadmap to creating fresh setting imagery that impacts the story on multiple levels while keeping readers engaged from the first page to the last.",
  "genres": [
    "Writing",
    "Nonfiction",
    "Reference",
    "Research",
    "Crafts",
    "Education"
  ],
  "author": "Angela Ackerman",
  "average_rating": "4.66",
  "url": "https://www.goodreads.com/book/show/30193438-the-rural-setting-thesaurus"
}