{
  "title": "When the Screaming Stops: The Dark History of the Bay City Rollers",
  "description": "This unflinching book exposes the sinister undercurrents and dark truths behind ‘Rollermania’, the pioneering boy band fad that gripped the UK in the seventies and spread across the world as the Edinburgh lads scored number one international hits. For the first time, former lovers, band members, and record industry insiders have been interviewed to build up the shocking story of the boy band that became immersed in the cult-like world of their Svengali, Tam Paton, a man who oversaw a culture of stalking, sackings, routine sexual abuse and career-furthering prostitution. Former band leader Paton controlled his charges and promoted them as clean-living teetotalers while subjecting them to various forms of sexual abuse. In Paton, the industry cliché of the manipulative and venal pop manager found its most grotesque expression. Dazzled by sudden global fame and corrupted by Paton’s unquenchable sexual appetites, The Bay City Rollers soon became part of his world of depravity, victimhood, crime and psychosis. Tragedies bedevilled every aspect of The Bay City Rollers' career. A 12-year-old girl was left brain damaged in an accident outside Paton's fortified home. A 15-year-old was shot in the head at the home of the lead singer, Les McKeown, who only months earlier had knocked over and killed a woman while behind the wheel of a super-charged sports car he could barely control. Homes were burned down, a policeman killed, a fan committed suicide and two band members claimed that Paton raped them. Nervous breakdowns and suicide attempts were commonplace. One band member was convicted of possessing child pornography and accused of sex with a 13-year-old. Band members became hooked on drugs, and their fall was almost as rapid as their rise, leaving them penniless and emotionally destroyed. Three years after they fired Paton in 1979 he was finally imprisoned, convicted of gross indecency with teenage boys. Predictably, the millions of pounds promised by Paton simply disappeared. The band spent a decade in litigation with Sony Records. Paton, who died in 2009, emerged from eventual imprisonment for gross indecency to become a major gangster who ran a huge drug business. The legacy of one of pop's cruellest scandals is still being felt. When The Screaming Stops – a milestone of relentless investigative writing and uncompromising exposure – is hardly a comfortable read but today more than ever it's an essential one.That such exploitation could have happened to one of the world’s most famous boy bands is a brutal reminder that conspiracies of silence about sexual exploitation were once the norm in the music and entertainment business. When The Screaming Stops is a no-holds-barred exposé of sex, drugs and financial mismanagement based on over 500 hours of interviews with many of The Bay City Rollers’ closest associates, including former band members. * Includes previously unseen photographs ‘An impressive work with some truly fantastic set pieces’ Johnny Rogan, author, Starmakers and Svengalis ‘Unrelenting behind-the-scenes darkness’ Bookseller ‘Lifts the lid on the squeaky clean 70s teenyboppers’ Writing",
  "genres": [
    "Music",
    "Biography",
    "Nonfiction"
  ],
  "author": "Simon Spence",
  "average_rating": "3.71",
  "url": "https://www.goodreads.com/book/show/30195217-when-the-screaming-stops"
}