{
  "title": "The Ukrainian and Russian Notebooks: Life and Death Under Soviet Rule",
  "description": "Written and illustrated by an award-winning artist and translated into English for the first time, Igort’s The Ukrainian and Russian Notebooks is a collection of two harrowing works of graphic nonfiction about life under Russian foreign rule.After spending two years in Ukraine and Russia, collecting the stories of the survivors and witnesses to Soviet rule, masterful Italian graphic novelist Igort was compelled to illuminate two shadowy moments in recent the Ukraine famine and the assassination of a Russian journalist. Now he brings those stories to new life with in-depth reporting and deep compassion. In The Russian Notebooks, Igort investigates the murder of award-winning journalist and human rights activist Anna Politkovskaya. Anna spoke out frequently against the Second Chechen War, criticizing Vladimir Putin. For her work, she was detained, poisoned, and ultimately murdered. Igort follows in her tracks, detailing Anna’s assassination and the stories of abuse, murder, abduction, and torture that Russia was so desperate to censor. In The Ukrainian Notebooks, Igort reaches further back in history and illustrates the events of the 1932 Holodomor. Little known outside of the Ukraine, the Holodomor was a government-sanctioned famine, a peacetime atrocity during Stalin’s rule that killed anywhere from 1.8 to twelve million ethnic Ukrainians. Told through interviews with the people who lived through it, Igort paints a harrowing picture of hunger and cruelty under Soviet rule. With elegant brush strokes and a stark color palette, Igort has transcribed the words and emotions of his subjects, revealing their intelligence, humanity, and honesty—and exposing the secret world of the former USSR.",
  "genres": [
    "Graphic Novels",
    "History",
    "Nonfiction",
    "Russia",
    "Comics",
    "Ukraine",
    "Politics"
  ],
  "author": "Igort",
  "average_rating": "4.30",
  "url": "https://www.goodreads.com/book/show/30189519-the-ukrainian-and-russian-notebooks"
}