{
  "title": "Wolves",
  "description": "Bestselling author D. J. Molles delivers a carefully woven novel of violence and redemption, bringing to life a devastating portrait of a man pushed to the edge of his own humanity. They took everything -- killed his wife, enslaved his daughter, destroyed his life. Now he's a man with nothing left to lose ... and that's what makes him so dangerous. Ten years after the collapse, Huxley had built a good life again. He had a loving wife, a farm with fields of golden barley, and a daughter with a strange and wonderful gift. Then the slavers came. Working out in the fields during the attack, Huxley returns too late. His daughter has been taken and his wife is bleeding out, her last whispered words about a man with a scorpion tattoo on his neck.Where do the slavers go? Huxley has no idea. He only knows that they headed east and so will he, setting out on foot across the desert of the Wastelands. Eighteen months into his journey, he has no hope of ever seeing his daughter alive. Dying of thirst in the open desert, he doesn't even expect to see another day. Then a man appears out of the desert and offers Huxley water from his canteen, an unheard of kindness in these savage times. Jay is an odd man, full of violence and guided by his hatred of the slavers, but he helps Huxley survive. And he gives Huxley a new nothing can bring back the dead, but we can chase down the slavers and make them bleed. Together, Huxley and Jay carve a path of destruction across the remains of a once-great land. The slavers are brutal, but they have no idea what's coming for them. Huxley has found something to live for blood and vengeance. In his most powerful work yet , New York Times bestselling author D. J. Molles delivers a carefully woven novel of violence and redemption, bringing to life a devastating portrait of a man pushed to the edge of his own humanity .",
  "genres": [
    "Post Apocalyptic",
    "Dystopia",
    "Science Fiction",
    "Fiction",
    "Audiobook",
    "Apocalyptic",
    "Thriller"
  ],
  "author": "D.J. Molles",
  "average_rating": "4.10",
  "url": "https://www.goodreads.com/book/show/30191422-wolves"
}