{
  "title": "During the Rains & Flowers in the Shade: Two Novellas",
  "description": "Nagai Kafu was one of the most important Japanese writers of fiction during the first half of the twentieth century. He is best known for his evocative descriptions of the moods and fancies of its gardens and canals, its streets and alleys, its people, and above all its women - especially the kept women, geisha, and prostitutes.During the Rains and Flowers in the Shade, which appear here in English for the first time, are set in the Tokyo of the 1930's. Most of the seedy neighborhoods that Kafu so lovingly describes have long since vanished, either in the bombing raids of 1945 or in the rebuilding that followed. Kafu's sympathies are clearly with the women that figure in these stories. A man wedded to the past, happy only in retrospect, Kafu saw in the world of the demimondaine the last tattered vestiges of the old Tokyo, when it was called Edo. He also saw in their day-to-day life the only honest way to live, the love with the least falsehood, in a materialistic, hypocritical society.During the Rains (1931) is the story of the vicissitudes of an amiable and lascivious Ginza cafe girl. It is considered to be among Kafu's masterpieces by many writers, critics, and scholars, including Donald \"One of Kafu's finest achievements....The exceptional praise that During the Rains won from discriminating critics was occasioned chiefly by the novelistic interest. The detached analysis of a group of people makes the story read like a work of French Naturalism, though a few passages...evoke the beauty of place and season in the typical Kafu manner.\"Flowers in the Shade might almost be called a continuation of During the Rains. Its hero, kept by a wealthy woman in his student days, ends up in his forties being supported by a prostitute. Donald Keene says that Kafu \"makes us see and all but smell the dingy rooms he describes, without ever allowing us to pass judgment on them or their inhabitants. Kafu neither approves or disapproves of his characters, and if he tells us in detail about their past it is not in order to demonstrate how environment and heredity have determined their lives...but to assuage our curiosity as to how Jukichi came to live off women, how a particular woman happened to become a prostitute or a procuress, and so on.\"The present volume contains a Preface by the translator that briefly summarizes Kafu's life and career.",
  "genres": [
    "Japanese Literature",
    "Japan",
    "Short Stories",
    "Fiction"
  ],
  "author": "Kafū Nagai",
  "average_rating": "3.73",
  "url": "https://www.goodreads.com/book/show/1188249.During_the_Rains_Flowers_in_the_Shade"
}