{
  "title": "First Awakenings",
  "description": "Internationally acclaimed, New York Times and USA TODAY bestselling author of Science Fiction, Urban Fantasy, and Paranormal Romance, S.E. Smith, brings another action, adventure, and suspense-filled story to transport readers out of this world!Lieutenant Commander Ashton “Ash” Haze has always embraced two things in his life: adventure and women, but when he awakens on an alien planet, there’s no time for anything other than survival – or so he thinks. Kella Ta’Qui is one of the Turbinta – a guild that discards their genetic identities in favor of what they train to become: assassins. Kella has been honing this deadly skill set since she was taken from her home as a child to train. Her first mission is to find and kill whatever was inside the unusual capsule that landed on Tesla Terra, but predator becomes prey when she is wounded by her target. Dazed and confused, she stumbles into a group who plan to sell her to the highest bidder – until a rescuer appears. Ash has always been a trouble-maker, and his Navy training ensured that he was able to handle almost anything thrown his way in the past. But when he enters a city in the middle of the desert and discovers a wounded alien woman, nothing could have prepared him for how she affects him. He soon learns that she knows where his fellow crew member might be located, and that knowledge unwittingly thrusts him into the middle of a local civil war. The fight begins and the race is on to find the other members of Project Gliese 581g crew before the Legion does. Can an easy-going Navy pilot and an alien assassin work together to reach the location of one of the other capsules on the cutthroat Turbintan planet, or will Ash find himself served up to the Legion for the highest number of credits? Whatever happens, the war has begun with the first awakening of the resistance – a resistance that Ash unwittingly volunteered to fight for.",
  "genres": [
    "Romance",
    "Science Fiction",
    "Audiobook",
    "Erotica",
    "Aliens",
    "Science Fiction Romance"
  ],
  "author": "S.E. Smith",
  "average_rating": "4.32",
  "url": "https://www.goodreads.com/book/show/30209462-first-awakenings"
}