{
  "title": "The Coelho Medallion",
  "description": "WINNER 2016 SHELF UNBOUND AWARD The adventure begins in the first Dan Kotler archaeological thriller! This edition has been revised to correct editing errors after an earlier draft was mistakenly uploaded. An ancient medallion is unearthed in Pueblo, Colorado, revealing a secret that will rewrite the history of North America—the Vikings somehow made it to the continent's interior, centuries before Columbus made landfall, and there they built a city of gold. But today the COELHO MEDALLION has been stolen, and a linguist and researcher has been abducted in connection with the crime. Could the abductors be after the fabled city of gold? Or do they have a more sinister plot in mind? DAN KOTLER is an independent researcher who often finds himself in more trouble than he was expecting. But when his colleague is abducted he finds himself being investigated by the FBI, he must use all of his brilliance and expertise to find her and absolve himself. ANWAR ADHAM has plans for a terrorist action on U.S. soil, and information from the Pueblo research site can give him everything he needs to put his plans in motion. Unless Adham is stopped, thousands and possibly millions will die. Whoever wins this contest of wits and wills will hold the fate of thousands in his hands, and will also lay claim to the fabled city of gold. It's an adventure that can redefine the history of America as we know it. Kotler finds himself facing off against both the FBI and Adham's terrorist network as he struggles to solve the mystery of Vikings in Colorado, to rescue Evelyn and stop Adham's plans before it's too late. “Kevin has crashed onto the action-thriller scene as only an action-thriller author with provocative plot lines, unforgettable characters, and enough adrenaline to keep you awake all night.” —Nick Thacker, author of 'The Enigma Strain' — HERE'S WHAT READERS ARE SAYING ABOUT KEVIN TUMLINSON'S ★★★★★ “[Kevin Tumlinson] is what every writer should be—entertaining and thought-provoking.” — Shana Tehan, Press Secretary, U.S. House of Representatives ★★★★★ “There was something so fascinating about [Citadel] and the cast of characters [Kevin Tumlinson] put together.” — Leah Petersen, Author of Fighting Gravity ★★★★★ \"I discovered Kevin Tumlinson from The Creative Penn podcast and immediately got his novel, Evergreen. I read it in like 3 seconds. It's the most fast paced story I've encountered.\" —R.D. Holland, Independent Reviewer ★★★★★ \"[Sawyer Jackson and the Long Land] was a great read! I love these style of books—magic, science fiction, alternate reality. I couldn't put it down.\" —S., Independent Reviewer",
  "genres": [
    "Thriller",
    "Mystery",
    "Adventure",
    "Fiction",
    "Action",
    "Archaeology",
    "Suspense"
  ],
  "author": "Kevin Tumlinson",
  "average_rating": "4.22",
  "url": "https://www.goodreads.com/book/show/30199643-the-coelho-medallion"
}