{
  "title": "No Man's Land: A Novel",
  "description": "Inspired by the real-life experiences of his grandfather, J. R. R. Tolkien, during World War I, Simon Tolkien delivers a perfectly rendered novel rife with class tension, period detail, and stirring action, ranging from the sharply divided society of northern England to the trenches of the Somme.Adam Raine is a boy cursed by misfortune. His impoverished childhood in turn-of-the-century London comes to a sudden and tragic end when his mother is killed in a workers' protest march. His father, Daniel, is barely able to cope with the loss. But a job offer in the coal mining town of Scarsdale presents one last chance, so father and son head north. The relocation is hard on the local boys prove difficult to befriend, and he never quite fits in. Meanwhile tensions between the miners and their employer, Sir John Scarsdale, escalate, and finally explode with terrible consequences.     In the aftermath, Adam's fate shifts once again, and he finds himself drawn into the opulent Scarsdale family home where he makes an enemy of Sir John's son, Brice, who subjects Adam to a succession of petty cruelties for daring to step above his station. However, Adam finds consolation in the company of Miriam, the local parson's beautiful daughter with whom he falls in love. When they become engaged and Adam wins a scholarship to Oxford, he starts to feel that his life is finally coming together—until the outbreak of war threatens to tear everything apart.     From the slums of London to the riches of an Edwardian country house; from the hot, dark seams of a Yorkshire coal mine to the exposed terrors of the trenches in France; Adam's journey from boy to man is set against the backdrop of a society violently entering the modern world.",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "World War I",
    "Historical",
    "War",
    "Audiobook",
    "Fantasy"
  ],
  "author": "Simon Tolkien",
  "average_rating": "4.06",
  "url": "https://www.goodreads.com/book/show/30211962-no-man-s-land"
}