{
  "title": "Never Say Die: Stories of The Zombie Apocalypse",
  "description": "Family, friends, lovers…  Those are just a few examples of the strong bonds that hold humanity together. But when the dead begin living, and the living start to die, who will remain connected, and who will be torn apart?  Never Say Die: Stories of The Zombie Apocalypse, explores how different relationships are put to the ultimate test when the end of the world comes crashing down around them.  Some will live, some will die, but one thing is for certain: Some bonds don’t break.  Jack: Years after the zombie outbreak decimates the population, Jack’s sister is mysteriously taken. Will he be able to find his sister, or better yet, once he finds her, will he be able to accept what she has become?  Gordon and Elena: The morning of an estranged couple’s divorce is about to get a lot more stressful when a mysterious illness turns out to be more dangerous than anyone expected. Will the two be able to set their differences aside before their journey’s end?  Patient 63: After a terrorist attack, civilization crumbles when a lab-created virus infects over half the world’s population. Dr. Henrick Kennedy has found the vaccine in his sixty-third patient, a former infected, but his intentions are anything but good. Graham, a lonely janitor, has fallen in love with the imprisoned Patient 63. But is love enough to save the world, or will love be the means to its end all over again? (Previously released in At Hell’s Gates, Volume 2: Origins of Evil)  Rosie: A little girl is given a vaccine to protect her from the impending zombie apocalypse, but when things don’t go as planned, Rosie and her mom must find a way to escape their home and make it to the evacuation zone alive. The human race may depend on it.  Trevor: A troubled young man makes the decision to end his life, but when the dead come back to life and his city is overrun, Trevor has suddenly found the will to live again, only this time he realizes he has a found a new purpose in life: Revenge.",
  "genres": [
    "Zombies"
  ],
  "author": "Stevie Kopas",
  "average_rating": "4.13",
  "url": "https://www.goodreads.com/book/show/30201147-never-say-die"
}