{
  "title": "High Performance Habits: How Extraordinary People Become That Way",
  "description": "THESE HABITS WILL MAKE YOU EXTRAORDINARY.Twenty years ago, author Brendon Burchard became obsessed with answering three 1. Why do some individuals and teams succeed  more quickly  than others and  sustain  that success over the long term?2. Of those who pull it off, why are some  miserable  and others consistently  happy  on their journey?3. What motivates people to reach for higher levels of success in the first place, and what practices help them improve the mostAfter extensive original research and a decade as the world’s leading high performance coach, Burchard found the answers. It turns out that just six deliberate habits give you the edge. Anyone can practice these habits and, when they do, extraordinary things happen in their lives, relationships, and careers.Which habits can help you achieve long-term success and vibrant well-being no matter your age, career, strengths, or personality? To become a high performer, you must  seek clarity, generate energy, raise necessity, increase productivity, develop influence,  and  demonstrate courage . The art and science of how to do all this is what this book is about.Whether you want to get more done, lead others better, develop skill faster, or dramatically increase your sense of joy and confidence, the habits in this book will help you achieve it faster. Each of the six habits is illustrated by powerful vignettes, cutting-edge science, thought-provoking exercises, and real-world daily practices you can implement right now.If you’ve ever wanted a science-backed, heart-centered plan to living a better quality of life, it’s in your hands. Best of all, you can measure your progress. A link to a free professional assessment is included in the book.",
  "genres": [
    "Self Help",
    "Personal Development",
    "Nonfiction",
    "Business",
    "Productivity",
    "Psychology",
    "Leadership"
  ],
  "author": "Brendon Burchard",
  "average_rating": "4.13",
  "url": "https://www.goodreads.com/book/show/30227731-high-performance-habits"
}