{
  "title": "Failure of Justice: A Brutal Murder, An Obsessed Cop, Six Wrongful Convictions",
  "description": "Feb. 5, 1985 marked one of the coldest nights on record that winter in the small Nebraska town of Beatrice. That evening, tenants in one downtown three-story apartment building hunkered down for a night of restful sleep. The next day, they were horrified as police cars lined along their otherwise peaceful street. The police found Helen Wilson, a widow in her late sixties, bound, raped and slain inside apartment Unit 4.The local Beatrice police force made a gallant effort to identify the killer-rapist who seemed to have been targeting vulnerable older women since two summers ago. A specially trained FBI profiler, Peter Klismet Jr., was flown into Nebraska to determine the killer's traits. After all, Helen Wilson was one of her tight-knit town's nicest ladies. She enjoyed bingo. She baby-sat the children at her Methodist church. Who would want to harm her, everyone wondered?At the time of the murder, Burt Searcey was a hog farmer who had worked for six years on the Beatrice police force. He quickly became obsessed with solving the case, though his theory would be a complete contradiction to the detailed profile developed by the FBI. Meanwhile, the murder investigation turned cold at the Beatrice Police Department to the enormous frustration of Helen Wilson's family, who wanted their loved one's killer brought to justice.By 1989, Searcey was a local sheriff's deputy and he got permission to take over his former city police colleagues' case with the blessing of the sheriff. His investigation took him to Alabama, North Carolina and Colorado. He accomplished the miraculous. That year, Searcey secured the convictions of six loosely connected lost souls for the widow's savage rape and murder.Searcey became a hometown hero. Gage County nominated Searcey for the VFW's annual J. Edgar Hoover Award given to the country's top law enforcement officer. As the years rolled by, Helen Wilson's murder faded from the community's memory.Then, many years later, Nebraska faced a conundrum. One of the convicted murderers, Joseph White, pleaded for a chance to allow new DNA testing of old evidence. Would the DNA tests cement his guilt or lead to a shocking new revelation: that Helen Wilson's twisted rapist and killer was actually someone else, somebody still unidentified?",
  "genres": [
    "True Crime",
    "Nonfiction",
    "Audiobook",
    "Crime",
    "History"
  ],
  "author": "John Ferak",
  "average_rating": "3.95",
  "url": "https://www.goodreads.com/book/show/30221852-failure-of-justice"
}