{
  "title": "Destin's Hold",
  "description": "New York Times and USA TODAY Bestselling author of Science Fiction, Urban Fantasy, and Paranormal Romance brings another action, adventure, and suspense-filled story to transport readers out of this world. Destin Parks will do whatever it takes to rebuild the city he calls home, even if it means working with the new alien ambassador sent to oversee the project. His encounter with her predecessor left him hesitant to trust the alien diplomats assigned to Chicago s rebuilding. The problem is, if he doesn't work with them, they will try to replace him and that is not going to happen without a fight. Jersula Ikera was assigned to Earth by the Alliance Council. The Council hopes her cool logic and calm demeanor will resolve the upheaval caused by the last ambassador. Jersula has fought hard for her position, and while not pleased with her current assignment as a liaison to the humans, she will do her best to help rebuild the world its inhabitants have destroyed. What she does not anticipate is her reaction to the hardheaded male that she has been assigned to. His ability to get under her skin and ignite a flame inside her leaves her confused and mystified. Danger undermines Jersula's efforts when she uncovers another alien cartel's plans to traffic human women and children. A near fatal attack leaves her trusting no one except the one man who has sworn to protect them. Together, Destin and Jersula race to stop the traffickers before the women and children are taken off-planet. What they don t realize is that the traffickers are not the only ones they are fighting against; the Waxian and Drethulan forces have also targeted Earth. Can Destin and Jersula stop the traffickers and prevent the deadly forces of the Waxians and Drethulans from destroying the progress they have made? Will the Alliance be able to protect Destin when the enemy discovers his connection to a powerful Alliance family? The battle for Earth has just turned personal.",
  "genres": [
    "Aliens",
    "Science Fiction",
    "Romance",
    "Science Fiction Romance",
    "Paranormal",
    "Audiobook",
    "Paranormal Romance"
  ],
  "author": "S.E. Smith",
  "average_rating": "4.28",
  "url": "https://www.goodreads.com/book/show/30221885-destin-s-hold"
}