{
  "title": "La Sumida",
  "description": "Dans la forte et subtile étude dont il fait suivre son excellente traduction du roman de Nagaï Kafû, Pierre Faure définit ainsi le sens de La Sumida : déploration d'\"un Meiji qui n'a pas tenu les promesses de ses débuts et qui, en voulant greffer un corps étranger sur un tronc qu'il a déraciné, a engendré une crise profonde qui est le drame du Japon moderne ; c'est ce déchirement de l'être japonais moderne que l'on peut deviner ainsi entre les lignes de La Sumida et qui confère à ses accents une résonance si désolée\". D'où l'organisation de cette histoire délicate, ténue, mais très savamment bâtie, à la japonaise. Afin d'exprimer formellement son refus d'un Meiji pour qui le bouc de Napoléon III et la discipline prussienne représentaient la civilisation, Nagaï Kafû construit son livre sur le retour cyclique des saisons (ce que reprendra plus tard Kawabata dans son Kyôto), un peu comme le poème des saisons : le haïku ou haïkaï. En outre, dans ses descriptions des paysages de Tôkyô, il évoque les estampes japonaises, celles de Hiroshige et de Kunisada, notamment, dont il était alors un des rares là-bas à priser la valeur. C'est aussi le roman de l'adolescence, de l'éveil, dans une société en crise grave, dévorée déjà par la technique, le rendement, et qui relègue au second plan la poésie, la galanterie, le théâtre de kabuki, où le héros verrait les seuls recours contre ce monde âpre et hideux. Nous lisons ici la complainte romanesque d'une civilisation moribonde, celle d'Edo que Tôkyô va supplanter sur place. Sachons incidemment admirer en Nagaï Kafû un homme qui, ayant appris en France à goûter aux libertés, refusera toujours d'entrer dans l'association des écrivains japonais, d'orientation fasciste, et souhaitera être enterré au cimetière des prostituées (satisfaction que lui refusera une famille contre laquelle il s'était d'emblée révolté). Bien que La Sumida remonte à 1909, Nagaï Kafû a donc beaucoup à nous dire aujourd'hui.",
  "genres": [
    "Japanese Literature",
    "Fiction",
    "Japan",
    "Classics"
  ],
  "author": "Kafū Nagai",
  "average_rating": "3.34",
  "url": "https://www.goodreads.com/book/show/1188252.La_Sumida"
}