{
  "title": "The Book of the Dead",
  "description": "First published in 1939 and extensively revised in 1943, The Book of the Dead , loosely inspired by the tale of Isis and Osiris from ancient Egypt, is a sweeping historical romance that tells a gothic tale of love between a noblewoman and a ghost in eighth-century Japan. Its author, Orikuchi Shinobu, was a well-received novelist, distinguished poet, and an esteemed scholar. He is often considered one of the fathers of Japanese folklore studies, and The Book of the Dead is without a doubt the most important novel of Orikuchi’s career—and it is a book like no other.  Here, for the first time, is the complete English translation of Orikuchi’s masterwork, whose vast influence is evidenced by multiple critical studies dedicated to it and by its many adaptations, which include an animated film and a popular manga. This translation features an introduction by award-winning translator Jeffrey Angles discussing the historical background of the work as well as its major the ancient origins of the Japanese nation, the development of religion in a modernizing society, and the devotion necessary to create a masterpiece. Also included are three chapters from The Mandala of Light by Japanese intellectual historian Andō Reiji, who places the novel and Orikuchi’s thought in the broader intellectual context of early twentieth-century Japan. The Book of the Dead focuses on the power of faith and religious devotion, and can be read as a parable illustrating the suffering an artist must experience to create great art. Readers will soon discover that a great deal lies hidden beneath the surface of the story; the entire text is a modernist mystery waiting to be decoded.",
  "genres": [
    "Japan",
    "Japanese Literature",
    "Fiction",
    "Fantasy",
    "Historical",
    "Gothic",
    "Historical Fiction"
  ],
  "author": "Shinobu Orikuchi",
  "average_rating": "3.45",
  "url": "https://www.goodreads.com/book/show/30227631-the-book-of-the-dead"
}