{
  "title": "The Wettest County in the World",
  "description": "Based on the true story of Matt Bondurant's grandfather and two granduncles, \"The Wettest County in the World\" is a gripping tale of brotherhood, greed, and murder. The Bondurant Boys were a notorious gang of roughnecks and moonshiners who ran liquor through Franklin County, Virginia, during Prohibition and in the years after. Forrest, the eldest brother, is fierce, mythically indestructible, and the consummate businessman; Howard, the middle brother, is an ox of a man besieged by the horrors he witnessed in the Great War; and Jack, the youngest, has a taste for luxury and a dream to get out of Franklin. Driven and haunted, these men forge a business, fall in love, and struggle to stay afloat as they watch their family die, their father's business fail, and the world they know crumble beneath the Depression and drought. White mule, white lightning, firewater, popskull, wild cat, stump whiskey, or rotgut -- whatever you called it, Franklin County was awash in moonshine in the 1920s. When Sherwood Anderson, the journalist and author of \"Winesburg, Ohio\", was covering a story there, he christened it the \"wettest county in the world\". In the twilight of his career, Anderson finds himself driving along dusty red roads trying to find the Bondurant brothers, piece together the clues linking them to \"The Great Franklin County Moonshine Conspiracy,\" and break open the silence that shrouds Franklin County.In vivid, muscular prose, Matt Bondurant brings these men -- their dark deeds, their long silences, their deep desires -- to life. His understanding of the passion, violence, and desperation at the center of this world is both heartbreaking and magnificent.",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Crime",
    "Historical",
    "Book Club",
    "True Crime",
    "Mystery"
  ],
  "author": "Matt Bondurant",
  "average_rating": "3.77",
  "url": "https://www.goodreads.com/book/show/3023836-the-wettest-county-in-the-world"
}