{
  "title": "The Alps: A Human History from Hannibal to,and Beyond",
  "description": "For centuries the Alps have seen the march of armies, the flow of pilgrims and Crusaders, the feats of mountaineers, and the dreams of engineers?and some 14 million people live among their peaks today. In The Alps, Stephen O’Shea takes readers up and down these majestic mountains, battling his own fear of heights to journey through a 500-mile arc across France, Italy, Switzerland, Liechtenstein, Germany, Austria, and Slovenia.O’Shea, whose style has been hailed for its “engaging combination of candid first-person travel writing and absorbing historical narrative” (Chicago Sun-Times), whisks readers along more than 2,000 years of Alpine history. As he travels pass-by-pass through the mountains, he tells great stories of those (real and imagined) who have passed before him, from Hannibal to Hitler, Frankenstein’s monster to Sherlock Holmes, Napoleon to Nietzsche, William Tell to James Bond. He explores the circumstances behind Hannibal and his elephants’ famous crossing in 218 BCE; he reveals how the Alps have profoundly influenced culture from Heidi to The Sound of Music; and he visits iconic sites, including the Reichenbach Falls, where Arthur Conan Doyle staged Sherlock Holmes’s death scene with Professor Moriarty; Caporetto, the bloody site of the Italians’ retreat in World War I; and the Eagle’s Nest, Hitler’s aerie of a vacation home.O’Shea delves into Alpine myths and legends, such as the lopsided legs of the dahu, the fictitious goatlike creature of the mountains, and reveals why the beloved St. Bernard dog is so often depicted with a cask hanging below its neck. Throughout, he immerses himself in the communities he visits, engagingly recounting his adventures with contemporary road trippers, watchmakers, salt miners, cable-car operators, and yodelers.",
  "genres": [
    "Travel",
    "History",
    "Nonfiction",
    "France",
    "Italy",
    "Germany",
    "Audiobook"
  ],
  "author": "Stephen O'Shea",
  "average_rating": "3.51",
  "url": "https://www.goodreads.com/book/show/30231759-the-alps"
}