{
  "title": "Sex Crimes: Then and Now: My Years on the Front Lines Prosecuting Rapists and Confronting Their Collaborators",
  "description": "Sequel plus    After being fired from her post as Chief of the Special Victims Unit for refusing to \"go along to get along,\" Alice Vachss published the incendiary Sex Crimes, described as \"a stark, passionate closing argument in [her] broader case against the criminal justice system\" by the NY Times, which named it as a Notable Book of the Year. Nick (Goodfellas) Pileggi called it \"the single best book about prosecuting sex crimes in America, period.\" Now, twenty years later, Alice Vachss becomes Special Prosecutor for Sex Crimes in a new environment ... on the opposite coast, in a small rural community. And asks the critical What has changed? Sex Then and Now shreds the myths about sex crime prosecution in America, revealing that the passage of time and a different locale are mere window dressing for horrors America has yet to face. For those who want something more than press releases and Trash-TV \"coverage,\" this no-compromises ebook offers the brutal truth.    In Sex Crimes Then, (included free in this two-book package) the woman the press described as one of America's toughest prosecutors grippingly recounts her career and in the process offers a searing indictment of our justice system. Included are close-ups of her most harrowing cases, among them the predatory pedophile who headed a boy's club to get closer to victims; the serial rapist who terrorized the city as \"The Stalker\": and the violent incest offender who tortured his \"property\" (his own daughter.)    \"My first lesson about sex crimes prosecution,\" Vachss writes, \"was that perpetrators were not the only enemy.\" She shows how the system is heavily weighted against victims. In what has come to be her trademarked term, she brands as \"rape collaborators” police officers and judges whose ingrained attitudes aid and comfort criminals; elected officials and attorneys concerned only with their political futures; fickle juries seemingly impervious to compelling evidence; and a legal system skeptical of cries of rape.    Asked in a 2007 interview in The Guardian “Does she miss putting rapists in prison? ‘Hell, yes,’ says Vachss. Would she return to the front line? ‘Am I willing to put up with the politics of running for office, or the backstabbing and infighting of being an employee of an elected official? That's a much tougher question.’\" [Julie Bindel, \"The rapists' enemy\"]    Sex Crimes Now finds Alice Vachss, still the same, back in the trenches insisting to a \"I don't have to prove motive. The motive for rape is rape,\" and battling a system hell-bent on freeing a monster. Inevitably, Vachss reached a point of no return, “Years before, Richard A. Brown’s response when he was asked why he fired me was that I’d done an excellent job. Ever-aware of the politics of prosecution, Brown had waited until he was elected, not simply appointed, before taking it upon himself to decide how much weight ‘doing an excellent job’ would or would not carry in his office. All these years later this new DA was about to make the same decision.”",
  "genres": [
    "True Crime",
    "Nonfiction"
  ],
  "author": "Alice Vachss",
  "average_rating": "4.31",
  "url": "https://www.goodreads.com/book/show/30230979-sex-crimes"
}