{
  "title": "Into the Outside",
  "description": "Librarian Note: Alternate Cover Edition for ISBN-10: 151480011X / ISBN-13: 9781514800119.Into the Outside is a thought provoking YA post-apocalyptic science fiction romance, set in a world that projects vivid imagery and conveys powerful emotions that draws the reader in and rivets his attention. Fifty years ago the Earth died. The Earth is now a fertile but dangerous jungle world. Wildlife has prospered although often in oddly altered forms. Survivors live in underground shelters waiting generations for the environment to become safe enough to emerge. Above ground, the radiation and poison has mutated the few humans that are left, but they do their best to survive for the 20 to 22 years they might live before the toxic planet or disease kills them. 16-year-old Isabella has grown up believing mutants are sub-human, stupid and would eat every shelter person if they had the chance, until she spies a wandering mutant tribe through the glass bottom swimming pool that is her shelter’s only light source. Isabella is fascinated by them, but it’s their 17-year-old leader, Malcolm, who truly captivates her – ebony skin, straw-colored hair, rippling muscles, four fingers on one hand and six on the other. Night after night she sneaks out of her shelter to watch the tribe, dressed in her grandfather’s chemical/radiation suit. When Malcolm discovers her, they are wary of each other at first but eventually become friends and then lovers. Isabella finally leaves the safety of her shelter to follow Malcolm into the perilous Outside. Isabella knows the government plans to exterminate the mutants once it is safe for the shelter-folk to come Outside, and she expects radiation and disease, but no one in the tribe is prepared for cannibals! Isabella’s family mourns for their lost daughter, knowing that she will die Outside, but Grandfather refuses to search for her. Even if they found her, he knows that she will not return without the mutants, and he will not allow them into the shelter. But everything changes when her brother, Luke, learns of Colonel Ericssen’s deadly plan for the mutants. Luke defies their grandfather and leaves the shelter to track down Isabella and warn her of the threat she knows nothing about. But he is no more prepared for the dangers Outside than she is. Hunted and finally captured by the military, Luke must escape their grasp, find Isabella, and save her life. Battling the cannibal Eaters, taking on orphan children and trying to convince mutant tribes about the dangers they must prepare for makes Isabella question her decision to leave her shelter. She dreamed of making a difference in the lives of those Outside, but now she isn’t certain has the courage and strength do it.",
  "genres": [
    "Young Adult",
    "Science Fiction",
    "Dystopia",
    "Audiobook",
    "Science Fiction Fantasy",
    "Romance",
    "Fiction"
  ],
  "author": "Lynda Engler",
  "average_rating": "3.95",
  "url": "https://www.goodreads.com/book/show/30232828-into-the-outside"
}