{
  "title": "Abducted",
  "description": "Abducted is Book 1 in my Alien Mate Index series. It is a plus-sized novel--140,000 words long My name is Zoe McKinley. I have a boring life, an awful job, and a boss that throws staplers at my head. What could be worse?  How about being abducted by Aliens?  Being dragged through a mirror, naked and screaming, onto an extraterrestrial ship was bad. Finding out I had been sold to a huge alien male who looks like the Devil was worse. But learning he wanted to trade me to an intergalactic petting zoo was the worst of all!  Now I'm whizzing through the galaxy with a robot butler, a trio of nib-nibs (they're like tiny green monkeys) and one huge, muscular, and very grumpy alien. The clothing they gave me shows all my lady-bits, the food-sim makes banana cream pie that tastes like sauerkraut, and Sarden, my captor, is too hot to stay mad at, even if he is a jerk.  In fact, I think I might be falling for him.  What's a girl to do? It's all in a day's work when you've been... Abducted.  The Alien Mate Index--Learn more From the pen of Evangeline Anderson, the writer who brought you Brides of the Kindred, comes a new race of Alien warriors… twelve races, to be exact.  Everyone thinks that life just evolved on Earth — Wrong. Our planet, and twelve others, all capable of supporting Terran life, was seeded by the Ancient Ones. Then Earth was locked away, kept safe in the cocoon of our ozone layer. But now there’s a gaping hole in our security blanket and guess who’s coming to dinner? That’s right—the Alien warriors of the Twelve Peoples - also descended from the Ancient Ones, are looking for mates and Earth girls are their first choice.  The Vorn are feared throughout the galaxy. Savage, horned warriors, these males can be surprisingly gentle to the females they choose to bond with.Denarins come in pairs—two muscular males who share a psychic bond... and feel the need to share one woman as well. The Majorans worship their females as goddesses, the very color of their skin changing with their bonded mate’s mood.Braxians are savage with black-on-white eyes that can see every spectrum of light. They will defend their females to the last drop of blood in their huge, blue bodies.  And there are more… so many more Alien warriors to pick from.Which type of male would you choose? Too bad you won’t have a choice, because thanks to the Alien Mate Index, an agency that abducts Earth brides for alien males, you could be snatched at any time and turned into a massive warrior’s mate or concubine.So the real question is - who will choose you?",
  "genres": [
    "Aliens",
    "Science Fiction",
    "Romance",
    "Science Fiction Romance",
    "Paranormal",
    "Paranormal Romance",
    "Fantasy"
  ],
  "author": "Evangeline Anderson",
  "average_rating": "3.91",
  "url": "https://www.goodreads.com/book/show/30230346-abducted"
}