{
  "title": "Flavor: The Science of Our Most Neglected Sense",
  "description": "Can you describe how the flavor of halibut differs from that of red snapper? How the taste of a Fuji apple differs from a Spartan? For most of us, this is a difficult task: flavor remains a vague, undeveloped concept that we don’t know enough about to describe—or appreciate—fully. In this delightful and compelling exploration of our most neglected sense, veteran science reporter Bob Holmes shows us just how much we’re missing.Considering every angle of flavor from our neurobiology to the science and practice of modern food production, Holmes takes readers on a journey to uncover the broad range of factors that can affect our appreciation of a fine meal or an exceptional glass of wine. He peers over the shoulders of some of the most fascinating food professionals working today, from cutting-edge chefs to food engineers to mathematicians investigating the perfect combination of pizza toppings. He talks with flavor and olfactory scientists, who describe why two people can experience remarkably different sensations from the same morsel of food, and how something as seemingly unrelated as cultural heritage can actually impact our sense of smell.Along the way, even more surprising facts are revealed: that cake tastes sweetest on white plates; that wine experts’ eyes can fool their noses; and even that language can affect our sense of taste. Flavor expands our curiosity and understanding of one of our most intimate sensations, while ultimately revealing how we can all sharpen our senses and our enjoyment of the things we taste.Certain to fascinate everyone from gourmands and scientists to home cooks and their guests, Flavor will open your mind—and palette—to a vast, exciting sensory world.",
  "genres": [
    "Nonfiction",
    "Food",
    "Science",
    "Cooking",
    "Audiobook",
    "Food and Drink",
    "Food Science"
  ],
  "author": "Bob Holmes",
  "average_rating": "3.97",
  "url": "https://www.goodreads.com/book/show/30231813-flavor"
}