{
  "title": "Why?: Explaining the Holocaust",
  "description": "Featured in the PBS documentary, \"The US and the Holocaust\" by Ken Burns, Lynn Novick and Sarah Botstein\"Superbly written and researched, synthesizing the classics while digging deep into a vast repository of primary sources.\" ―Josef Joffe, Wall Street Journal Despite the outpouring of books, movies, museums, memorials, and courses devoted to the Holocaust, a coherent explanation of why such ghastly carnage erupted from the heart of civilized Europe in the twentieth century still seems elusive even seventy years later. Numerous theories have sprouted in an attempt to console ourselves and to point the blame in emotionally satisfying directions―yet none of them are fully convincing. As witnesses to the Holocaust near the ends of their lives, it becomes that much more important to unravel what happened and to educate a new generation about the horrors inflicted by the Nazi regime on Jews and non-Jews alike. Why? dispels many misconceptions and answers some of the most basic―yet vexing―questions that remain: why the Jews and not another ethnic group? Why the Germans? Why such a swift and sweeping extermination? Why didn’t more Jews fight back more often? Why didn’t they receive more help? While responding to the questions he has been most frequently asked by students over the decades, world-renowned Holocaust historian and professor Peter Hayes brings a wealth of scholarly research and experience to bear on conventional, popular views of the history, challenging some of the most prominent recent interpretations. He argues that there is no single theory that “explains” the Holocaust; the convergence of multiple forces at a particular moment in time led to catastrophe. In clear prose informed by an encyclopedic knowledge of Holocaust literature in English and German, Hayes weaves together stories and statistics to heart-stopping effect. Why? is an authoritative, groundbreaking exploration of the origins of one of the most tragic events in human history. 5 illustrations",
  "genres": [
    "History",
    "Nonfiction",
    "Holocaust",
    "Jewish",
    "World War II",
    "Audiobook",
    "War"
  ],
  "author": "Peter  Hayes",
  "average_rating": "4.41",
  "url": "https://www.goodreads.com/book/show/30231795-why"
}