{
  "title": "Fangs Rule: A Girls Guide to Being a Vampire",
  "description": "FANGS RULE a girls guide to being a vampire …. is a young Adult book for anyone between Puberty and Senility as it takes a close up look at life as a female teenage vampire in easy to follow A to Z advice for the reader, the book is also full of manga art which helps show the human world what life is like in a vampire world………. Giving helpful advice such as how to explain to your Mom that as a teenage blood curdling denizen of the night you would like to paint your cave bedroom black without having a shouting match over why you don’t like the way she painted the stalagmites bright pink to go with the large stuffed pink bats hanging from the ceiling. Everything is explained from how to polish your fangs to fashion tips and ways of climbing across a ceiling wearing a nightdress without showing your underwear. Fangs Rule is a must for every teenage vampire and from these pages you will see why Amy says “Vampires Don’t Sparkle! …. They Bite! Hi! My name is Amy Mah Vampire and here are some helpful hints from my Fangs A Girls Guide to Being a Vampire Going out on a Yes we all go thought the same difficulties of what to wear, the wardrobe will not shut but I still do not have anything suitable, so after hours of searching in the end I decide to wear black as it will match my comfy shoes, ok so I have more shoes than a dictators wife but only one comfy pair and they are black, why comfy shoes? Well I have no idea where we are going so what the heck should I wear! Now comes the date bag, why can’t a girl just go out, and when I say a girl I mean me, why do I have to look like I’m going for a 10 day vacation and not just a night out. So lets open the date bag and check if everything is there. 1. Cell phone fully charged. 2. Spare cash and credit card. 3. Packet of mints for after eating smelly food….er…………foreigners 4. Chap stick ….well you may kiss him and …….. it goes with the mints ok? 5. Make up mirror, why take a mirror you ask, ..er …well if I get ship wreaked I can use it to signal for help, look it is just needed ok! 6. Packet of tissues just in case you can not find a washroom when out. 7. Keys large bunch and no I do not know why luggage keys are on the same ring with my house keys. 8. Sun glasses, hat and 100% sun block just in case you stay out early. 9. A spare pair of panties in case I sleep over ……… er not that I am planning to sleep over … er forget it ok! Look I said stop giggling and forget it!!!! 10. Precautions and protection, nowadays it is not just a boys reasonability for protection and so a girl should also take her own protection if needed, personally I take a can of Mace and a 10 inch kitchen knife and if that fails I sink my teeth into the neck! The author Amy Mah (Vampire) is a well known blogger, that writes and blogs as a cynical teenage Being a vampire sounds like it should be a cool thing to be as a teenage girl, like sleeping during the day and enjoying a night life with friends, huh, no one had warned me that it also meant having to suffer Teenage Hormones for so long! I am stuck as a teenager the years may pass but I am the same age! And as to the rules, so many rules, and vampire uniforms! Guys have long fancy cloaks that they are always tripping over and as to the Girls uniform, it is a 18th C Nightdress! The old male vampires expect a girl to walk about wearing just a see through nightdress with no underwear on!! as if that is ever going to happen!,",
  "genres": [
    "Vampires",
    "Manga",
    "Paranormal",
    "Fantasy",
    "Graphic Novels",
    "Fiction"
  ],
  "author": "Amy Mah",
  "average_rating": "4.10",
  "url": "https://www.goodreads.com/book/show/11883980-fangs-rule"
}