{
  "title": "Interspecies, Volume 1",
  "description": "A science fiction shared-universe anthology, The Inlari Sagas: Aliens and humans struggle for supremacy in post-apocalyptic Australia and New Zealand. Fifty years after first contact with the inlari, war ravaged the Earth, leaving New Zealand and Australia the victors and survivors, but at a devastating cost. As human and inlari factions compete against each other in the struggle for power and resources, some seek zealotry and dominance. Others strive for peace and unity—and with them, hope still lives. Four stories of transformation, survival, and the eternal search for meaning and purpose in a chaotic and turbulent world. Can inlari and humans alike bridge the gap created by their prejudices? Or will one species forever rule the other?Contents: Foreword by Samuel Peralta *The Memoriam / by M. J. Kelley: Kene, a young inlari disciple, learns his people’s dark and complex history through direct memory transfer with his mentor. Kene’s head fills with the memories and lives of the dead, as he’s groomed to be the keeper of the rememberance. He’s also charged with carrying out peace between the inlaris and the last free human city on New Zealand, but can he cope with the onslaught of memory? Can he survive his government’s extremists and his ancient order’s shameful secrets? *Underground Intelligence / by Elaine Chao: An-tíng is a hei-kè, one of the few technical experts in a human military group focused on gathering enough data to overthrow the inlari occupation. But a routine mission—one she wasn’t even supposed to be on—takes a surprising turn, making her reevaluate her place in society and the fragile relationship between humans and inlaris. *Transmission Interrupted / Dana Leipold: Quinette Alteiri’s father has disappeared, and there’s no hope that he will return. Her mother, the leader of the inlari nation on New Zealand’s North Island, has also suffered painful losses at the hands of humans, leaving her bitter and vengeful. Quinette finds solace in the arms of a human slave even though she knows it is forbidden, and it would shatter her mother. When Quinette and her lover find a mysterious device, Quinette sets off a series of events that eventually force her to make a decision: follow her destiny or forge a new future. *Babylon’s Song / Wolf Dietrich: At nine-years-old, Samantha Babylon’s innocence is violently torn from her as she and her sister find themselves in New Zealand, now home to the inlari nation. Separated from her sister on arrival, a storm of guilt and fear threatens to rip Samantha apart as she clings to the fragile hope of uniting with her sibling, escaping the island, and returning to their beloved Barren Mountain in New South Wales..",
  "genres": [
    "Science Fiction",
    "Short Stories"
  ],
  "author": "Ally Bishop",
  "average_rating": "4.40",
  "url": "https://www.goodreads.com/book/show/30241421-interspecies-volume-1"
}