{
  "title": "The Stone of the Eklektos",
  "description": "Rose Foster is just your typical, smart-mouthed, socially awkward genius from a family full of felons. Okay, fine, so maybe there’s nothing typical about her. But she’d at least maintained a semblance of normalcy in her life until the night a ghost-like man gave her a strange, red stone and disappeared without a trace.Rose suddenly finds herself hunted by monsters that she never believed existed. One monster, named Theron, is particularly interested in killing her. Her only hope of survival is to work with Kallias, a cynical, ancient Greek vampire with the ability to read and control minds. As a vampire, he hardly seems trustworthy to her, but he has his own reasons for wanting Theron dead, and that works in her favor.With the help of Kallias, Rose finds unlikely allies among an unusual group of vampires. The only problem is… Rose is almost positive these vampires are hiding an important detail about what she is. In her quest to defeat Theron and the vampires that follow him, Rose must face the possibility that she might, in fact, be an even darker monster than the ones that are trying to kill her...—About the Creatures of Darkness Series:The Creatures of Darkness series is a dark fantasy series, centered around Rose Foster—the perpetually sarcastic, bisexual protagonist—and an unlikely group of vampires who begrudgingly try to save the world.There’s also a bit of queer romance going on in the midst of the chaos—especially once seductive, Viking warrior, Kara Unnarsdóttir, comes into the picture in The Tomb of Blood.Follow Rose and her companions as they fight to stop a nefarious plan that was set into motion thousands of years ago, and as Rose unravels the mystery of what she really is.The fourth and final book of the series, The Reign of Darkness, is available now!",
  "genres": [
    "Fantasy",
    "LGBT",
    "Vampires",
    "Bisexual",
    "Lesbian",
    "Paranormal",
    "Queer"
  ],
  "author": "Britney Jackson",
  "average_rating": "4.01",
  "url": "https://www.goodreads.com/book/show/30241341-the-stone-of-the-eklektos"
}