{
  "title": "Player of Life",
  "description": "I don’t just have the entire package—looks, stamina, and a smile that makes girls weak at the knees—I am the entire package. My name is Nicholas Holt—or “The Player” to those who know me best. I was the man your mother warned you about. The self-described playboy who had no intentions of settling down. I partied hard, I f*cked harder, and the wall I built around my heart was the hardest of them all.But like all good tales, a story can’t be unraveled without a few gut-twisting hairpins from the rollercoaster we call life. A pretty blonde with dazzling blue eyes and tiny facial features was one terrifying hairpin I never saw coming. Against screaming protests and a vast strength of resistance, she forced the wheels of my rollercoaster to skid off the tracks.Her name is Jenni—or “The Player Slayer” as I like to refer to her. With a killer smile and an ability to deflect my wooing charm, she was the first women in a long time to secure my utter devotion. Don’t misread my admission, it wasn’t just her tempting body that obtained my attention. It was her eyes.Just one look into her soul-bearing eyes guaranteed that the ride we were commencing wasn’t just going to be long, tortuous and hair-raising, it was also going to be epic, like nothing I’ve ever experienced. It was. It was the best ride of my life.But like all rollercoasters, the ride eventually stopped and the participants were advised to exit via stage left. Will a player have what he needs to convince the woman who brought him to his knees back into the cart? Or will the hairpins of lies, deception and stalkers cause one too many dips in the craziest ride of all—the ride of love?If you have loved the Perception series thus far, you’re going to love this next rock-star, groupie stalking installment.Don’t assume you already know Nick and Jenni’s story; you haven’t even scratched the surface yet.Author Warning: contains sexual references and adult content, such as swear words and violent scenes. Although this book is number four in the Perception series, it can be read as a complete standalone.",
  "genres": [
    "Music",
    "Romance"
  ],
  "author": "Shandi Boyes",
  "average_rating": "4.37",
  "url": "https://www.goodreads.com/book/show/30244672-player-of-life"
}