{
  "title": "Fortune's Rising",
  "description": "Fortune has a secret.Humanity, in its struggle to escape its own planet's demise, began sending colony ships from Earth almost seven hundred years ago in the desperate hope a handful would find some place habitable to human life and be able to continue our species. Only one ship survived.It only survived because it found a vast swath of alien planets, all terraformed, all utterly abandoned. Alien megastructures cold and lifeless. Alien vehicles left in panicked lines, sealed from the inside, no corpses within. Empty space stations, with no one to run them but the dust. Resources everywhere, ripe for the taking.But Fortune is different. Of all the planets colonized by humans after the chaos of Migration, this single, jungle-infested colony on the very edge of the known universe holds the key to the alien collapse…and to humanity’s survival. Everywhere else, advanced alien ruins mar every surface, every planetoid, every debris ring and asteroid, but of the creatures that made them, there is no sign. On Fortune, something survives…Unfortunately for humanity, while time is running out, a rebellion is brewing, one that could save our species—or consign it to dust like the aliens that came before us. Now, seven hundred years after our first brush with extinction, the fate of the human race once again rests on the shoulders of a a seven-year-old sociopath and her combat-gifted big sister, a man who’s dreamed of the future, an infamous smuggler, and a Coalition pilot sworn to destroy the rebel cause.This time, however, the stakes are higher. For lurking on Fortune is a secret.An epic, post-apocalyptic science fiction adventure that will make you hold your breath, cry, curse the powers that be, and in the end question what, exactly, it means to be human. *FOR CURRENT FANS OF THE OUTER BOUNDS This is the THIRD edition of Outer Bounds 1: Fortune's Rising. To celebrate the return of the Outer Bounds' series to its creator, Sara King added a bonus 17,500 word novella to this edition detailing Anna's rescue of Milar from the Nephyrs, as well as some fantastic book-derived art by bestselling graphic artist Lance MacCarty. It also has timeline fixes and minor edits to better synch it with the rest of the series. Plus it just looks cooler.",
  "genres": [
    "Science Fiction",
    "Fiction",
    "Fantasy",
    "Romance",
    "Science Fiction Fantasy",
    "Audiobook",
    "Aliens"
  ],
  "author": "Sara  King",
  "average_rating": "4.13",
  "url": "https://www.goodreads.com/book/show/30246244-fortune-s-rising"
}