{
  "title": "The Aftermath",
  "description": "What if you had to spend one year face-to-face with the biggest mistake of your life? Daniel Rhodes is looking for an anonymous night of fun with his fake ID in the big city, an hour away from his tiny hometown in rural Washington.  \n“You play pool?” Daniel asks the stranger, eyeing him. “Uh, yeah. I do,” the man says in a clipped, cocky way. “Do \nyou play pool?”  But when an intriguing stranger flirts with Daniel, he’s desperate not to lose the man’s attention. The man is smooth, older, and funny — dark and handsome with a physical presence that has Daniel’s blood running hot. Without thinking about it, Daniel starts hustling him.  \n“A little,” Daniel lies. “You up for a game?” “You’re damned right I am.”\n  What starts as a simple con changes as their chemistry crackles. Daniel wants this tattooed stranger, and he’s willing to bend the rules to get him on his knees. The young hustler makes the bet of a lifetime — getting him exactly what he wants.  But the anonymous fun becomes a nightmare when Daniel meets the stranger in his hometown days later, thrown into a situation that leaves them no choice but to work together.  . . .  On the advice of his friends, perpetual loner Wilson Morrow has quit his job at a state university to accept an offer in the small town of Chewelah. The university is all he’s known since he escaped a turbulent childhood in Alabama, and Will spent his twenties forgetting the memories of what happened there.  But his fresh start in a new town is a disaster from the start... Because staring at him on the first day of his promising new job is the biggest mistake of his entire life: Daniel Rhodes. They both know that with a single word, Daniel could ruin Will’s whole career.  . . .  They want to hate each other for what they are and the dishonest way they met. But as they’re forced to work together, Daniel finds that Will is changing the way he views himself, literature, and the future before him. In the gregarious and hot-tempered Daniel, Will finds someone he cannot help but care about — but he knows that the best thing he can do for Daniel Rhodes is to leave him alone.  Try as they might, something bigger than themselves always pushes the two of them together.  Nothing stays the same for either man as they navigate the minefield of a love they must keep secret. For the first time in either man’s life, they begin to build rather than repair, to forge their own future instead of treading in a wake, and to create something more important than simple survival in the aftermath of a chance encounter.  (The Aftermath is an erotically-charged emotional romance with hurt/comfort, no cheating, and a happily ever after ending.)",
  "genres": [
    "M M Romance",
    "Contemporary",
    "Romance",
    "LGBT",
    "Young Adult",
    "Gay",
    "M M Contemporary"
  ],
  "author": "Kay Simone",
  "average_rating": "3.94",
  "url": "https://www.goodreads.com/book/show/30242144-the-aftermath"
}