{
  "title": "A Life in Death",
  "description": "WINNER - PEOPLE'S BOOK PRIZE 2017  “Fascinating. Highly recommended.” For the Love of Books blog  “I was so absorbed by this book and found it such an easy read that I knocked it over in two days. Venables does a magnificent job of hitting the appropriate tone with a difficult and somewhat unpalatable topic.” The Bookshelf Gargoyle  “I absolutely loved this book, it is a fabulous insight into what goes on behind the scenes of murders and disasters that result in tragic loss of life. I found it gripping and very interesting. Very well written. A great book.” Netgalley  “Very interesting. If you ever want to satisfy your macabre curiosity as to how the police identify victims involved in a disaster without getting too much into the science, then this is the book for you. It never lets you forget the sensitivity and the human element of working in a field which deals with tragedy after tragedy. Richard Venables has a unique perspective to deliver an account of how Disaster Victim Identification has progressed from the ’80s to now, as he pretty much invented the process for the UK, and worked on a multitude of national and international disasters.” Love is a State of Mind blog  “An invaluable insight into the actual workings of Disaster Victim Identification teams, which will pull at every human emotion. An incredible read.\" Detective Superintendent Graham Yip (rtd), Merseyside Police.  “Although the subject matter - the police’s response in the face of tragedy - is tough, his story is both fascinating and uplifting, revealing how the human spirit never fails to shine through in the darkest of times.” Detective Chief Superintendent Rich Kerman (rtd)  “It is a sincere reflection of the fate that can befall some unfortunate people but how those dealing with disasters can make such a tremendous difference by the way their loved ones are cared and treated with respect and dignity… Through his work Richard became a worldwide expert on DVI and is held in the highest esteem by those in the field.” DR N D Chapman DL, Coroner of Nottinghamshire (rtd) & President of BAHID (British Association of Human Identification)  Detective Inspector Richard Venables (QPM, rtd.) has helped identify thousands of bodies all over the world, piecing together fragments from tsunamis, transport and other disasters to return the victims to their loved ones.  A world-renowned expert in Disaster Victim Identification who was a member of the UK Police’s Major Disaster Advisory Team, Richard’s destiny was shaped in part by his presence as a uniformed sergeant at the 1989 Hillsborough Disaster.  In A Life in Death, Richard tells his extraordinary story, of how death came to be a key feature of his personal as well as professional life, as well as how he coped with the biggest challenge of his life: the 2004 Asian Tsunami, the deadliest event of its kind ever experienced by human civilization, claiming 230,000 lives.  Upon his retirement from the Police in 2006, Richard was awarded the Queen’s Police Medal in recognition of his distinguished service. In A Life in Death, Richard takes us behind the scenes of extraordinary events, explaining with compassion and searing honesty the absolute necessity of his work, his life’s passion.",
  "genres": [
    "Nonfiction",
    "True Crime",
    "History",
    "Crime",
    "Autobiography",
    "Memoir",
    "Science"
  ],
  "author": "Richard Venables",
  "average_rating": "4.09",
  "url": "https://www.goodreads.com/book/show/30242544-a-life-in-death"
}