{
  "title": "Star Wars: The Truce at Bakura",
  "description": "No sooner has Darth Vader's funeral pyre burned to ashes on Endor than the Alliance intercepts a call for help from a far-flung Imperial outpost. Bakura is on the edge of known space and the first to meet the Ssi-ruuk, cold-blooded reptilian invaders who, once allied with the now dead Emperor, are approaching Imperial space with only one goal: total domination. Princess Leia sees the mission as an opportunity to achieve a diplomatic victory for the Alliance. But it assumes even greater importance when a vision of Obi-Wan Kenobi appears to Luke Skywalker with the message that he must go to Bakura—or risk losing everything the Rebels have fought so desperately to achieve. Even as the Alliance arrives, the aliens have almost overcome the Bakura Imperial garrison, whose desperate commander will accept help from any quarter—even Rebel—against an insidious foe that enslaves Human minds to pilot their invincible machines of war and destruction. While marshalling the tattered Imperial forces, Luke, Han Solo, and Princess Leia must win the trust and cooperation of the Bakurans. For although Imperial Governor Nereus has granted the Rebels temporary amnesty there is the possibility of treachery among those whose first allegiance lies with the Empire. On the eve of the final explosive onslaught, Rebel and Imperial forces must finally come to terms with each other…or lose the entire galaxy to the hideous servitude promised by a victorious alien enemy. Capturing the sweep and excitement of the original Star Wars saga, The Truce at Bakura plants a seed of hope for peace, sees the formation of a timeless love, and stands witness to a Jedi's undying sacrifice to defend Humanity against an alien nemesis.",
  "genres": [
    "Star Wars",
    "Science Fiction",
    "Fiction",
    "Fantasy",
    "Science Fiction Fantasy",
    "Space Opera",
    "Media Tie In"
  ],
  "author": "Kathy Tyers",
  "average_rating": "3.46",
  "url": "https://www.goodreads.com/book/show/302618.Star_Wars"
}