{
  "title": "Own It: The Power of Women at Work",
  "description": "Picking up the women and success conversation where Sheryl Sandberg left off, Krawcheck shows women how to take their careers to the next level....by playing by a new set of rules that build on their natural strengths.   So much career advice for women addresses how to succeed in the static business world of yesterday and today. But that world, says former Wall Street powerhouse-turned entrepreneur Sallie Krawcheck, is changing - and fast. In fact, we are on the brink of what Krawcheck calls the Fourth Wave of feminism, one that will usher in unprecedented opportunities for women in business.  This all is being driven by the fact that the business world is evolving in ways that play to women's strengths. Because in the increasingly complex and connected world of tomorrow - one in which communication and collaboration rule the day - the skills and qualities needed for success are ones that women inherently possess. And by owning and investing in those qualities women have more power than ever.   Here Krawcheck draws on her experiences at the highest levels of business, both as one of the lone women at the top rungs of the biggest boy's club in the world, and as an entrepreneur, to show how women can tap into this growing power to elevate their careers: from getting the raise, to new takes on networking and mentoring, to navigating career breaks and curveballs to avoiding the biggest career mistake that most women don't know they are making.  At the same time, women have the opportunity to play a more significant role than they know in shaping their companies into places they want to work - or leave to start their own: by initiating the -courageous conversations- about true flexibility and diversity in the workplace, forging non-traditional career paths, and more.  Lighting the path to complete the revolution ignited by Gloria Steinem, Krawcheck shows how each one of us can ride the wave of this revolution to own our careers and our futures. From the Hardcover edition.",
  "genres": [
    "Business",
    "Nonfiction",
    "Leadership",
    "Feminism",
    "Self Help",
    "Buisness",
    "Finance"
  ],
  "author": "Sallie Krawcheck",
  "average_rating": "4.03",
  "url": "https://www.goodreads.com/book/show/30255672-own-it"
}