{
  "title": "Chuck Noll: His Life's Work",
  "description": "Chuck Noll won four Super Bowls and presided over one of the greatest football dynasties in history, the Pittsburgh Steelers of the ‘70s. Later inducted into the Pro Football Hall of Fame, his achievements as a competitor and a coach are the stuff of legend. But Noll always remained an intensely private and introspective man, never revealing much of himself as a person or as a coach, not even to the players and fans who revered him.            Chuck Noll did not need a dramatic public profile to be the catalyst for one of the greatest transformations in sports history. In the nearly four decades before he was hired, the Pittsburgh Steelers were the least successful team in professional football, never winning so much as a division title. After Noll’s arrival, his quiet but steely leadership quickly remolded the team into the most accomplished in the history of professional football.  And what he built endured well beyond his time with the Steelers – who have remained one of America’s great NFL teams, accumulating a total of six Super Bowls, eight AFC championships, and dozens of division titles and playoff berths.            In this penetrating biography, based on deep research and hundreds of interviews, Michael MacCambridge takes the measure of the man, painting an intimate portrait of one of the most important figures in American football history. He traces Noll’s journey from a Depression-era childhood in Cleveland, where he first played the game in a fully integrated neighborhood league led by an African-American coach and then seriously pursued the sport through high school and college.  Eventually, Noll played both defensive and offensive positions professionally for the Browns, before discovering that his true calling was coaching.  MacCambridge reveals that Noll secretly struggled with and overcame epilepsy to build the career that earned him his place as “the Emperor” of Pittsburgh during the Steelers’ dynastic run in the 1970s, while in his final years, he battled Alzheimer’s in the shelter of his caring and protective family.            Noll’s impact went well beyond one football team. When he arrived, the city of steel was facing a deep crisis, as the dramatic decline of Pittsburgh’s lifeblood industry traumatized an entire generation. “Losing,” Noll said on his first day on the job, “has nothing to do with geography.” Through his calm, confident leadership of the Steelers and the success they achieved, the people of Pittsburgh came to believe that winning was possible, and their recovery of confidence owed a lot to the Steeler’s new coach. The famous urban renaissance that followed can only be understood by grasping what Noll and his team meant to the people of the city. The man Pittsburghers could never fully know helped them see themselves better.            Chuck His Life’s Work tells the story of a private man in a very public job. It explores the family ties that built his character, the challenges that defined his course, and the love story that shaped his life. By understanding the man himself, we can at last clearly see Noll’s profound influence on the city, players, coaches, and game he loved. They are all, in a real sense, heirs to the football team Chuck Noll built.",
  "genres": [
    "Football",
    "Sports",
    "Biography",
    "Nonfiction",
    "Leadership"
  ],
  "author": "Michael MacCambridge",
  "average_rating": "4.55",
  "url": "https://www.goodreads.com/book/show/30254691-chuck-noll"
}