{
  "title": "Embrace the Beast",
  "description": "Nate Landry is living a whopper of a lie. He’s an otter shifter, that much is true. Folks say he’s the best river guide in the region, with an uncanny knack for finding the hottest fishing spots. And he has a good friend again, a guy he likes more than he probably should. Everything will be fine, as long as nobody—especially Mac—finds out he used to be Charlie Beauchamp, an elite Coast Guard rescue swimmer who failed to save the one person he loved most. Then the real Nate Landry shows up and drags Charlie’s grief and shame out of the depths.  McKinley Greer knows how to keep a secret. Like where a bear shifter might find the best honey trees. Or why he brews beer but doesn’t drink a drop of it. Or that most of his favorite porn features guys who look a helluva lot like his best friend. But suddenly Nate isn’t Nate—he’s a freaking hero named Charlie—and when he begins to share his own secrets, Mac knows it’s only a matter of time before all the things he’s stashed in the darkest den of his heart get hauled into the light.  EMBRACE THE BEAST is the 3rd book (33,000 words) of GRIZZLY RIM, a steamy paranormal romance series featuring M/M heroes of all stripes: 1. LAUNCH THE HUNT 2. SURRENDER THE CHASE 3. EMBRACE THE BEAST  GRIZZLY RIM Series The men of Grizzly Rim are a lot of things, but always human isn’t one of them. These shifters landed in this remote Alaska village for different reasons, but the same thing keeps them there: a massive wilderness where they can soar, lope, paddle, and hide.  But nature doesn’t play fair. A horny shifter can change form without warning, and nothing amps the libido like the extremes of the northern sun. Throw in feverish auroras, strange tides, and unexpected visitors, and this year’s brew is more potent than ever.  For the shifters of Grizzly Rim, one thing is becoming achingly clear: no matter where you hole up, eventually your secrets will catch your scent.",
  "genres": [
    "M M Romance",
    "Paranormal",
    "Shapeshifters",
    "Fantasy",
    "Romance",
    "Friends To Lovers",
    "Paranormal Romance"
  ],
  "author": "Mia West",
  "average_rating": "4.08",
  "url": "https://www.goodreads.com/book/show/30255185-embrace-the-beast"
}