{
  "title": "Racing the Devil",
  "description": "On the eve of the bloody Battle of the Somme, a group of English officers having a last drink before returning to the Front make a promise to each other: if they survive the battle ahead—and make it through the war—they will meet in Paris a year after the fighting ends. They will celebrate their good fortune by racing motorcars they beg, borrow, or own from Paris to Nice.In November 1919, the officers all meet as planned, and though their motorcars are not designed for racing, they set out for Nice. But a serious mishap mars the reunion. In the mountains just north of their destination, two vehicles are nearly run off the road, and one man is badly injured. No one knows—or will admit to knowing—which driver was at the wheel of the rogue motorcar.Back in England one year later, during a heavy rainstorm, a driver loses control on a twisting road and is killed in the crash. Was it an accident due to the hazardous conditions? Or premeditated murder? Is the crash connected in some way to the unfortunate events in the mountains above Nice the year before? If it was foul play, was it a case of mistaken identity? Or was the dead man the intended victim after all?Investigating this perplexing case, Scotland Yard Inspector Ian Rutledge discovers that the truth is elusive—and that the villages on the South Downs, where the accident happened, are adept at keeping secrets, frustrating his search. Determined to remain in the shadows, this faceless killer is willing to strike again to stop Rutledge from finding him. This time, the victim he chooses is a child, and it will take all of Rutledge’s skill to stop him before an innocent young life is sacrificed.",
  "genres": [
    "Mystery",
    "Historical Fiction",
    "Fiction",
    "Historical Mystery",
    "Historical",
    "British Literature",
    "Audiobook"
  ],
  "author": "Charles Todd",
  "average_rating": "4.15",
  "url": "https://www.goodreads.com/book/show/30255946-racing-the-devil"
}