{
  "title": "The Unexpected Enlightenment of Rachel Griffin",
  "description": "THIS IS A REVISED AND EXTENDED EDITIONRachel Griffin wants to know everything. As a freshman at Roanoke Academy for the Sorcerous Arts, she has been granted to opportunity to study both mundane and magical subjects.But even her perfect recollection of every book she has ever read does not help her when she finds a strange statue in the forest—a statue of a woman with wings. Nowhere—neither in the arcane tomes of the Wise, nor in the dictionary and encyclopedia of the non-magic-using Unwary—can she find mention of such a creature.What could it be? And why are the statue’s wings missing when she returns?When someone tries to kill a fellow student, Rachel soon realizes that, in the same way her World of the Wise hides from mundane folk, there is another, more secret world hiding from everyone—which her perfect recall allows her to remember. Her need to know everything drives her to investigate.Rushing forward where others fear to tread, Rachel finds herself beset by wraiths, magical pranks, homework, a Raven said to bring the doom of worlds, love’s first blush, and at least one fire-breathing teacher.Curiosity might kill a cat, but nothing stops Rachel Griffin!“The Unexpected Enlightenment of Rachel Griffin, a plucky band of children join forces to fight evil, despite the best efforts of incompetent adults, at a school for wizards. YA fiction really doesn’t get better than that.”—Jonathan Moeller, author of The Ghosts series“Rachel Griffin is curious, eager and smart, and ready to begin her new life at Roanoke Academy for the Sorcerous Arts, but she didn’t expect to be faced with a mystery as soon as she got there. Fortunately she’s up to the task. Take all the best of the classic girl detective, throw in a good dose of magic and surround it all with entertaining, likeable friends and an intriguing conundrum, and you’ll have The Unexpected Enlightenment of Rachel Griffin, a thrilling adventure tailor-made for the folks who’ve been missing Harry Potter. Exciting, fantastical events draw readers into Rachel’s world and solid storytelling keeps them there.”—Misty Massey, author of Mad Kestrel",
  "genres": [
    "Fantasy",
    "Young Adult",
    "Urban Fantasy",
    "Magic",
    "Fiction",
    "Childrens",
    "Amazon"
  ],
  "author": "L. Jagi Lamplighter",
  "average_rating": "3.88",
  "url": "https://www.goodreads.com/book/show/30261069-the-unexpected-enlightenment-of-rachel-griffin"
}