{
  "title": "The Sanctum",
  "description": "\"Pamela King Cable has created an unforgettable heroine in Neeley McPherson, a remarkable young woman of such courage and spunk that she dares to stand against unspeakable abuse and injustice not only for herself but also for her beloved caretaker, Gideon. Fleeing a horrendous life, Neeley discovers the true meaning of family, forgiveness, and love in a wolf sanctuary, which becomes a central metaphor for the difficult journey we all must undertake to find our way home. Thoroughly enjoyable book!\" ~ Cassandra King Conroy (Pat's wife) - Bestselling author of Moonrise, The Same Sweet Girls, and The Sunday Wife “This inspirational tale thrills with a tight plot, lyrical scene descriptions, and complex characters. Pamela Cable leaves readers aching for more.” ~ Julie Cantrell, New York Times bestselling author.\"I would compare The Sanctum to Harper Lee's To Kill A Mockingbird . Set in the deep south during the Civil Rights Era, this book tackles such issues as racial discrimination and abuse.\" ~ Kimberly A. Liston-McCabeOn a November day in 1951 Neeley McPherson turned five ... and accidentally killed her parents. Thrown into the care of her scheming and alcoholic grandfather, she survives by her quick wit, and the watchful eye of an elderly black man, Gideon. In 1959, as equal rights heats up the South, authorities accuse Gideon of stealing a watch and using a Whites Only restroom. Neeley, now thirteen, determines to break him out of jail.When the infamous Catfish Cole, Ku Klux Klan Grand Dragon of the Carolinas, discovers their courageous escape, he pursues Neeley and Gideon into the frozen Blue Ridge Mountains to a wolf sanctuary. But will Neeley's actions lead to tragedy again? Or will she finally find the love of family she lost as a child?Set during a volatile time in America, The Sanctum bestows sanctuary and invokes the power of second chances.Written for the General Market (G) (I) : Contains little or no; sexual dialogue or situations, or strong language. May also contain some violent content and words which some readers may find offensive. Similar novels in this genre may be categorized racism in America books, Southern fiction novels, historical fiction, and Civil Rights movement books.",
  "genres": [
    "Fiction",
    "Historical Fiction",
    "Historical",
    "Christian",
    "Christian Fiction"
  ],
  "author": "Pamela King Cable",
  "average_rating": "4.46",
  "url": "https://www.goodreads.com/book/show/30255179-the-sanctum"
}