{
  "title": "Jim Butcher's The Dresden Files: Wild Card",
  "description": "INSIDE COVER:WILD CARDAn uneasy peace has settled over Chicago, where an array of supernatural factions frequently battle for supremacy. Thanks to the city's only Wizard for Hire, Harry Dresden, a plot targeting magical practitioners was stopped, and the White Court of Vampires' part in it exposed. 'Gentleman' Johnny Marcone, the town's most powerful and ruthless mob boss, was made a freeholding Baron under the Unseelie Accords, a set of decrees governing the actions of the magical world's major powers, in return for his help in ending the threat. Son after, Marcone once again aided Harry and his apprentice, Molly Carpenter, this time helping them take down a mad wizard bent on making Chicago his personal playground.However, the gangster remains a dangerous criminal who, whatever his motivations, is wholly focused on cultivating his own power. The White Court, led by Lara Raith, is the dominant supernatural faction and sees the city's citizens as nothing more than a source of sustenance and pleasure.Things are calm now, but tension between these rivals boils beneath the surface...Jim Butcher's The Dresden Files saga continues in this original and in-continuity graphic novel, featuring a never-before-told story set after the bestselling novel White Night and graphic novel Down Town! A bizarre double murder draws the interest of Chicago's only wizard-for-hire. But as Harry Dresden begins his investigation, the clues lead to troubling conclusions about the possible perpetrator, and set him on a path that will place him in the middle of a conflict between the city's three most powerful factions -- a conflict that could engulf all of Chicago! REVIEWS:\"If you re already a fan of Harry and his ragtag band of hooligans and ne'er-do-wells, this latest offering from the folks at Dynamite could very well be a great way to pass the time while you wait for the next book.\" - The Pullbox\"Every panel is exciting to read, and Carlos Gomez really knows his way around a pencil.\" - The Outhousers \"Dark, gritty, mysterious, and full of magic.\" - AIPT\"Great art and solid writing.\" - Critical Blast\"An interesting premise and well written characters.\" - Project Nerd\"Step into this tale and you will feel richly rewarded.\" - Big Comic Page\"Good amounts of levity and seriousness.\" - Bounding Into Comics",
  "genres": [
    "Fantasy",
    "Graphic Novels",
    "Urban Fantasy",
    "Comics",
    "Magic",
    "Fiction",
    "Mystery"
  ],
  "author": "Jim  Butcher",
  "average_rating": "4.03",
  "url": "https://www.goodreads.com/book/show/30272306-jim-butcher-s-the-dresden-files"
}