{
  "title": "The Wisdom of Not Knowing: Discovering a Life of Wonder by Embracing Uncertainty",
  "description": "A deeply affirming exploration of the challenges and possibilities of the unknown--with meditations and exercises that can help transform the fear and uncertainty of \"not knowing\" into a sense of openness, curiosity, and bravery. For most of us the unknown is both friend and foe. At times it can be a source of paralyzing fear and uncertainty, and at other times it can be a starting point for transformation, creativity, and growth. The unknown is a deep current that runs throughout all religions and mystical traditions, and it is also the nexus of contemporary psychotherapeutic thought and practice and a key element in all personal growth and healing. InThe Wisdom of Not Knowing, psychotherapist Estelle Frankel shows us that our psychological, emotional, and spiritual health is radically influenced by how comfortable we are at navigating the unknown and uncertain dimensions of our lives. Drawing on insights from Kabbalah, depth psychology, Buddhism, Christianity, Hinduism, and ancient myth, Frankel explores how we can grow our souls by tapping into the wisdom of not knowing. She also includes case studies of individuals who have grappled with their fears of the unknown and, as a result, have come out wiser, stronger, and more resilient. Each chapter includes experiential exercises and/or meditations for befriending the unknown. These exercises help convey how we must be willing to \"not know\" in order to gain knowledge and be able to bear uncertainty so we can be free to enjoy a healthy sense of adventure and curiosity.\"“This book inspires as it delights. Estelle Frankel’s graceful and authoritative voice--fluent and informed as it seamlessly weaves together religion, psychoanalytic theory, literature, philosophy and modern science—recasts the ‘unknown’ from, a situation of dread to an invitation to ever more liberating awareness.”—Sylvia Boorstein, author of Happiness is an Inside Job: Practicing for a Joyful Life“Drawing on insights from the Jewish mystical tradition, as well as Buddhism and psychoanalysis, Estelle Frankel demonstrates the surprisingly positive value of ‘not knowing.’ This book is profound and clear. It will enable you to become more intimate with your own experience, to overcome fear, and to overcome the mental and emotional challenges of daily life.”—Daniel Matt, author of The Essential Kabbalah, God and the Big Bang, and The Zohar: Pritzker Edition“This book bristles with depth and insight, practical stories, and humor as Estelle Frankel takes us on a deep and necessary journey into the via negativa, the land of unknowing. She urges us in a time of darkness and uncertainty to learn from the dark and to grow our courage and our creativity in the process.”—Rev Dr. Matthew Fox, author of A Way to God",
  "genres": [
    "Spirituality",
    "Nonfiction",
    "Psychology",
    "Self Help",
    "Judaism",
    "Personal Development"
  ],
  "author": "Estelle Frankel",
  "average_rating": "3.98",
  "url": "https://www.goodreads.com/book/show/30278899-the-wisdom-of-not-knowing"
}