{
  "title": "The Vegetarian",
  "description": "FROM HAN KANG, WINNER OF THE 2024 NOBEL PRIZE IN LITERATURE “[Han Kang writes in] intense poetic prose that . . . exposes the fragility of human life.”—from the Nobel Prize citation WINNER OF THE INTERNATIONAL BOOKER PRIZE • “Kang viscerally explores the limits of what a human brain and body can endure, and the strange beauty that can be found in even the most extreme forms of renunciation.”—Entertainment WeeklyOne of the New York Times’s 100 Best Books of the 21st Century“Ferocious.”—The New York Times Book Review (Ten Best Books of the Year)“Both terrifying and terrific.”—Lauren Groff“Provocative [and] shocking.”—The Washington PostBefore the nightmares began, Yeong-hye and her husband lived an ordinary, controlled life. But the dreams—invasive images of blood and brutality—torture her, driving Yeong-hye to purge her mind and renounce eating meat altogether. It’s a small act of independence, but it interrupts her marriage and sets into motion an increasingly grotesque chain of events at home. As her husband, her brother-in-law and sister each fight to reassert their control, Yeong-hye obsessively defends the choice that’s become sacred to her. Soon their attempts turn desperate, subjecting first her mind, and then her body, to ever more intrusive and perverse violations, sending Yeong-hye spiraling into a dangerous, bizarre estrangement, not only from those closest to her, but also from herself.  Celebrated by critics around the world, The Vegetarian is a darkly allegorical, Kafka-esque tale of power, obsession, and one woman’s struggle to break free from the violence both without and within her.A Best Book of the Year: BuzzFeed, Entertainment Weekly, Wall Street Journal, Time, Elle, The Economist, HuffPost, Slate, Bustle, The St. Louis Dispatch, Electric Literature, Publishers Weekly",
  "genres": [
    "Fiction",
    "Horror",
    "Contemporary",
    "Literary Fiction",
    "Book Club",
    "Audiobook",
    "Mental Health"
  ],
  "author": "Han Kang",
  "average_rating": "3.63",
  "url": "https://www.goodreads.com/book/show/30269102-the-vegetarian"
}