{
  "title": "Running in Heels: A Memoir of Grit and Grace",
  "description": "Readers who praised this story of coming of age -- and coming into grace -- will love this new book club edition!More than a memoir, this book is a promise of hope for anyone who was abandoned as a child, to anyone who woke up hungry and went to bed hungrier every day, for every wife who has loved a husband who left bruises on her heart and on her body.Somewhere between stealing cold cuts from stray cats and watching a stranger leave her mother's bed after breaking in through their bedroom window, Mary figured out that her family was dirt poor. Worse than her empty stomach, she was hungry for acceptance and love. She thought she found it when her baby sister was born and she became her \"mommy,\" taking care of her needs as best as she could at the age of seven. Then she had to say goodbye over a small white casket.Mary's grandparents, first-generation immigrants from Puerto Rico, took her in and gave her a glimpse of faith and stability. For a brief, shining spell, she had a real home--until they decided that Mama needed her.They may have been right, but Mama needed more than a little girl could give, and Mary lost her way again.Just out of Juvy Hall, Mary found a knight in shining armor to take her away. She became a teenage bride to a man twice her age -- a man as deeply enslaved to booze as every stepdad she'd had as a child. She loved him anyway and wore the bruises he gave her, even when she tried to leave him to give their children a better life.Despite her fear and loneliness, she never imagined it would take a gunshot in the middle of the night to teach her courage. She was even more surprised when her rediscovered faith paved the path to forgiveness after so many years of pain.Running in Heels is an autobiography of the grit and grace that carried a young girl through the shadows of her mother's choices and on through an abusive marriage. Mary A. PErez narrates an incredible story of survival in the face of hopelessness, and learning to forgive against all odds.Now with \"Questions and Topics for Discussion\" for your book club!",
  "genres": [
    "Memoir",
    "Nonfiction"
  ],
  "author": "Mary A. Pérez",
  "average_rating": "4.41",
  "url": "https://www.goodreads.com/book/show/30281023-running-in-heels"
}