{
  "title": "Terror, Love and Brainwashing: Attachment in Cults and Totalitarian Systems",
  "description": "Written by a cult survivor and renowned expert on cults and totalitarianism, Terror, Love and Brainwashing draws on the author’s 25 years of study and research to explain how almost anyone, given the right set of circumstances, can be radically manipulated to engage in otherwise incomprehensible and often dangerous acts. Illustrated with compelling stories from a range of cults and totalitarian systems, from religious to political to commercial, the book defines and analyses the common and identifiable traits that underlie almost all these groups. It focuses on how charismatic, authoritarian leaders control their followers’ attachment relationships via manipulative social structures and ideologies so that, emotionally and cognitively isolated, they become unable to act in their own survival interests. Using the evolutionary theory of attachment to demonstrate the psychological impact of these environments, and incorporating the latest neuroscientific findings, Stein illustrates how the combined dynamic of terror and ‘love’ works to break down people’s ability to think and behave rationally. From small local cults to global players like ISIS and North Korea, the impact of these movements is widespread and growing. This important book offers clarity and a unique perspective on the dynamics of these systems of control, and concludes with guidance to foster greater awareness and prevention. It will be essential reading for mental health professionals in the field, as well as policy makers, legal professionals, cult survivors, and their families, as well as anyone with an interest in these disturbing groups. Students of social and developmental psychology will also find it fascinating.",
  "genres": [
    "Nonfiction",
    "Psychology",
    "Cults",
    "Politics",
    "Religion",
    "History",
    "Philosophy"
  ],
  "author": "Alexandra Stein",
  "average_rating": "4.01",
  "url": "https://www.goodreads.com/book/show/30269417-terror-love-and-brainwashing"
}