{
  "title": "See Something, Say Nothing: A Homeland Security Officer Exposes the Government's Submission to Jihad",
  "description": "One day after a prominent U.S. Muslim leader reacted to the November 2015 Paris attacks with a declaration that the Islamic State, also known as ISIS, has nothing to do with Islam, President Obama made the same assertion.Who exactly is the enemy we face, not only in the Middle East but also within our borders? Is it \"murderers without a coherent creed\" or \"nihilistic killers who want to tear things down,\" as some described ISIS after 130 people were brutally slain and another 368 injured in a coordinated attack on Western soil that authorities say was organized with help from inside France's Muslim communities.After the Paris attacks, Obama, himself, described ISIS as \"simply a network of killers who are brutalizing local populations.\"But how much do words and definitions really matter? According to the legendary military strategist Sun Tzu, if \"you do not know your enemies but do know yourself, you will win one (battle) and lose one; if you do not know your enemies nor yourself, you will be imperiled in every single battle.\"When the Department of Homeland Security was founded in 2003, its stated purpose was \"preventing terrorist attacks within the United States and reducing America's vulnerability to terrorism.\" The Bush administration's definition of the enemy as a tactic, terrorism, rather than a specific movement, proved consequential amid a culture of political correctness. By the time President Obama took office, Muslim Brotherhood-linked leaders in the United States were forcing changes to national security policy and even being invited into the highest chambers of influence. A policy known as Countering Violent Extremism emerged, downplaying the threat of supremacist Islam as unrelated to the religion and just one among many violent ideological movements.When recently retired DHS frontline officer and intelligence expert Philip Haney bravely tried to say something about the people and organizations that threatened the nation, his intelligence information was eliminated, and he was investigated by the very agency assigned to protect the country. The national campaign by the DHS to raise public awareness of terrorism and terrorism-related crime known as If You See Something, Say Something effectively has become If You See Something, Say Nothing.In See Something, Say Nothing, Haney – a charter member of DHS with previous experience in the Middle East – and co-author Art Moore expose just how deeply the submission, denial and deception run. Haney's insider, eyewitness account, supported by internal memos and documents, exposes a federal government capitulating to an enemy within and punishing those who reject its narrative.In this well-documented, first-person account of his unique service with DHS, Haney shows why it's imperative that Americans demand that when they see something and say something, the servants under their charge do something to prevent a cunning, relentless enemy from carrying out its stated aim to \"destroy Western Civilization from within.\"",
  "genres": [
    "Politics",
    "Nonfiction",
    "Terrorism",
    "Islam"
  ],
  "author": "Philip Haney",
  "average_rating": "4.22",
  "url": "https://www.goodreads.com/book/show/30270328-see-something-say-nothing"
}