{
  "title": "Lincoln in the Bardo: A Novel",
  "description": "7 hours, 29 minutesThe long-awaited first novel from the author of Tenth of December a moving and original father-son story featuring none other than Abraham Lincoln, as well as an unforgettable cast of supporting characters, living and dead, historical and inventedFebruary 1862. The Civil War is less than one year old. The fighting has begun in earnest, and the nation has begun to realize it is in for a long, bloody struggle. Meanwhile, President Lincoln's beloved eleven-year-old son, Willie, lies upstairs in the White House, gravely ill. In a matter of days, despite predictions of a recovery, Willie dies and is laid to rest in a Georgetown cemetery. \"My poor boy, he was too good for this earth,\" the president says at the time. \"God has called him home.\" Newspapers report that a grief-stricken Lincoln returns, alone, to the crypt several times to hold his boy's body.From that seed of historical truth, George Saunders spins an unforgettable story of familial love and loss that breaks free of its realistic, historical framework into a supernatural realm both hilarious and terrifying. Willie Lincoln finds himself in a strange purgatory where ghosts mingle, gripe, commiserate, quarrel, and enact bizarre acts of penance. Within this transitional state--called, in the Tibetan tradition, the bardo--a monumental struggle erupts over young Willie's soul.Lincoln in the Bardo is an astonishing feat of imagination and a bold step forward from one of the most important and influential writers of his generation. Formally daring, generous in spirit, deeply concerned with matters of the heart, it is a testament to fiction's ability to speak honestly and powerfully to the things that really matter to us. Saunders has invented a thrilling new form that deploys a kaleidoscopic, theatrical panorama of voices to ask a timeless, profound question: How do we live and love when we know that everything we love must end?The 166-person full cast features award-winning actors and musicians, as well as a number of Saunders' family, friends, and members of his publishing team, including, in order of their appearance:Nick Offerman as HANS VOLLMAN David Sedaris as ROGER BEVINS III Carrie Brownstein as ISABELLE PERKINS George Saunders as THE REVEREND EVERLY THOMAS Miranda July as MRS. ELIZABETH CRAWFORD Lena Dunham as ELISE TRAYNOR Ben Stiller as JACK MANDERS Julianne Moore as JANE ELLIS Susan Sarandon as MRS. ABIGAIL BLASS Bradley Whitford as LT. CECIL STONE Bill Hader as EDDIE BARON Megan Mullally as BETSY BARON Rainn Wilson as PERCIVAL \"DASH\" COLLIER Jeff Tweedy as CAPTAIN WILLIAM PRINCE Kat Dennings as MISS TAMARA DOOLITTLE Jeffrey Tambor as PROFESSOR EDMUND BLOOMER Mike O'Brien as LAWRENCE T. DECROIX Keegan-Michael Key as ELSON FARWELL Don Cheadle as THOMAS HAVENS and Patrick Wilson as STANLEY \"PERFESSER\" LIPPERT with Kirby Heyborne as WILLIE LINCOLN,  Mary Karr as MRS. ROSE MILLAND,  and Cassandra Campbell as Your NarratorPraise for the audiobook\"Lincoln in the Bardo\" sets a new standard for cast recordings in its structure, in its performances, and in its boldness. Now, let's see who answers the challenge.\" - Chicago Tribune\"Like the novel, the audiobook breaks new ground in what can be accomplished through a story. It helps that there's not a single bad note in the cast of a whopping 166 people. It's also the rare phenomenon of an audiobook being a completely different experience compared to the novel. Even if you've read the novel, the audiobook is worth a listen (and vice versa). The whole project pushes the narrative form forward.\" - A.V. Club  \"The result is an auditory experience unlike any other, where the awareness of individual voices disappears while the carefully calibrated soundscape summons a metaphysical masterpiece. This is a tour de force of audiobook production, and a dazzling realization of Saunders' unique authorial structure.\"--Booklist\"The finished audiobook's tapestry of voices perfectly mirrors the novel.\"--Entertainment WeeklyPraise for George Saunders\"No one writes more powerfully than George Saunders about the lost, the unlucky, the disenfranchised.\"--Michiko Kakutani, The New York Times\"Saunders makes you feel as though you are reading fiction for the first time.\"--Khaled Hosseini\"Few people cut as hard or deep as Saunders does.\"--Junot Diaz\"George Saunders is a complete original. There is no one better, no one more essential to our national sense of self and sanity.\"--Dave Eggers\"Not since Twain has America produced a satirist this funny.\"--Zadie Smith\"There is no one like him. He is an original--but everyone knows that.\"--Lorrie Moore\"George Saunders makes the all-but-impossible look effortless. We're lucky to have him.\"--Jonathan Franzen\"An astoundingly tuned voice--graceful, dark, authentic, and funny--telling just the kinds of stories we need to get us through these times.\"--Thomas Pynchon",
  "genres": [
    "Fiction",
    "Historical Fiction",
    "Audiobook",
    "Book Club",
    "Fantasy",
    "Literary Fiction",
    "Historical"
  ],
  "author": "George Saunders",
  "average_rating": "3.75",
  "url": "https://www.goodreads.com/book/show/30268062-lincoln-in-the-bardo"
}