{
  "title": "American Sniper: The Autobiography of the Most Lethal Sniper in U.S. Military History",
  "description": "He is the deadliest American sniper ever, called “the devil” by theenemies he hunted and “the legend” by his Navy SEAL brothers . ..From 1999 to 2009, U.S. Navy SEAL Chris Kyle recorded the most careersniper kills in United States military history. The Pentagon hasofficially confirmed more than 150 of Kyles kills (the previousAmerican record was 109), but it has declined to verify theastonishing total number for this book. Iraqi insurgents feared Kyleso much they named him al-Shaitan (“the devil”) and placed a bountyon his head. Kyle earned legendary status among his fellow SEALs,Marines, and U.S. Army soldiers, whom he protected with deadlyaccuracy from rooftops and stealth positions. Gripping andunforgettable, Kyle’s masterful account of his extraordinarybattlefield experiences ranks as one of the great war memoirs of alltime. A native Texan who learned to shoot on childhood hunting tripswith his father, Kyle was a champion saddle-bronc rider prior tojoining the Navy. After 9/11, he was thrust onto the front lines ofthe War on Terror, and soon found his calling as a world-class sniperwho performed best under fire. He recorded a personal-record2,100-yard kill shot outside Baghdad; in Fallujah, Kyle braved heavyfire to rescue a group of Marines trapped on a street; in Ramadi, hestared down insurgents with his pistol in close combat. Kyle talkshonestly about the pain of war—of twice being shot and experiencingthe tragic deaths of two close friends. American Sniper also honorsKyles fellow warriors, who raised hell on and off the battlefield.And in moving first-person accounts throughout, Kyles wife, Taya,speaks openly about the strains of war on their marriage andchildren, as well as on Chris. Adrenaline-charged and deeplypersonal, American Sniper is a thrilling eyewitness account of warthat only one man could tell.",
  "genres": [
    "Nonfiction",
    "Biography",
    "Military Fiction",
    "History",
    "War",
    "Memoir",
    "Autobiography"
  ],
  "author": "Chris Kyle",
  "average_rating": "4.03",
  "url": "https://www.goodreads.com/book/show/11887018-american-sniper"
}