{
  "title": "Go Clown - #AccheDin for Comedy",
  "description": "When Baby Kiriti arrived in this world, he was like a lost butterfly in a sea of white. A baby who is born and thrust into the huge sea of humanity called India, rides and steers his destiny ship, as he constantly grapples with the Clown inside him, who meanwhile brings out his own set of funny oars in these troubled waters. The Clown's journey continues on from a Karma-Guru to a trader of special water from Europe (thanks to his Made-in-China friend!), and from a music director (the Bad-Boy theme!) to the founder of a school, and a dirty sock to a sex-crazed, horny bunch of young fellas. The colors of the Clown's comedy are different but he always plays to the circus of life. As Kiriti encounters a wide array of characters from the length and breadth of India, a land as rich as its flavours, the carefree years full of joy and young hopes come to an end, with the sweet smell of Ganja still lingering under the starry nights. The philosophy of Meaning is preached, after a session of holy smokes, on the sides of a dusty highway which sees blood and grime daily. And finally with the Mystical Game which casts a shadow on Kiriti's life having been won, everything is laid to rest under a blanket of white, only to be stumbled upon by a Sherpa on the peaks of the mighty Himalayas that wakes up something inside of his adorable son! Is it a Thief, his Dream or the Clown? And there is a 2000 year old Surprise Gift with the Novel! (Any Guesses?)The Following are Reviews from Amazon India & Amazon (International):http://www.amazon.in/dp/9384439835One Five Star Review\"This Novel 'Go Clown'- #AccheDin for Comedy, was sent to one of my colleagues for a possible review and I picked it up as I remember reading the author's words somewhere online (who apparently contributes to Times of India, Faking News & Huffington Post) - 'Life is like a meandering stream, and I am like a free butterfly hovering around it.'Anyway coming to the book 'Go Clown'. It was a blast! Fasten your seat belts and get ready for this hilarious ride! I would especially recommend the train scene (Nirvana in Indian Railways!), the weed/Ganja scene, the College part, the NRI Stuff, the ad and on and on which I could so well relate to. It was reliving my collage days and the fond and the occasional bitter memories. You are going to Laugh and then cry (again with Laughter!)The story and the way the magical realism turns out is plain amazing. And nothing which has ever been written has described the colours of an Indian Life so closely and in such a comedic way. And the free gift in the novel was a pleasant surprise (the Go game)! As someone interested in geopolitics and strategies I took an instant liking for the game.After Amish and Chetan everyone has been trying to directly or indirectly copy a fantasy theme or a love story. They have mass produced thousands of such books killing the Indian Readers taste. I think 'Go Clown\", a comedy, has added some new tinge to Indian fiction.Disclaimer: In this generation of authors getting reviews from friends and family I would suggest you better read their free excerpt/Sample chapter on their website so you figure it out on your own!No wonder they proclaim on their website that they got 5000 hits for their sample on the first day it was put up, and 2,50,000 views for their official trailer on Facebook & YouTube.\"One Four Star Review:\"A copy of the novel \"GoClown - AccheDin for Comedy\" was sent to our college literary club which a friend suggested I read. So I took it on flight to spend time when travelling from Darjeeling to Delhi. On the flight I started laughing hysterically. An elderly woman seated beside me initially gave a stern look as if I was being deliberately loud. I explained to her that it was the book.This book is like the sweet smell of earth after the first rains (a line from GoClown - #AccheDin for Comedy). My #AccheDin did start! The college part left me in tears (with laughter), and not to forget the passion scene (GoClown also explains the body's reaction in a very comedic way!).Above all it is like an ocean of Comedy with islands in it, all of which are in shapes of different letters, that sum up to form a brilliant story! The Game and the strategy was mind-blowing!\"One Five Star Review\"Go Clown is an hilarious Odyssey spanning across two continents Asia and America.Kiriti the protagonist and The Clown his true \"side kick\" speak to every human soul , for such is its universality.This blissful tale can be juxtaposed in any setting. Be it Boston, Berlin, Beijing , Bangalore or Bogota.Go Clown is set in the theater of Life where Charles Dickens works with Mark Twain, to present a mirthful narrative to the reader.A must read.\"",
  "genres": [],
  "author": "Shatrugna Vadwlas",
  "average_rating": "3.67",
  "url": "https://www.goodreads.com/book/show/30289588-go-clown---acchedin-for-comedy"
}