{
  "title": "بيل ونبيل: حكايات ساخرة",
  "description": "بيل ونبيل كتاب جديد للكاتب السعودي نبيل فهد المعجل وتكمن أهمية هذا الكتاب بمضمونه الجديد والمبتكر ويحمل تجربة خيالية كتبت بطريقة فنية حرفية ساخرة وبأسلوب سهل الهضم. من الصعب أن تتمالك نفسك عند قراءة الكثير من المواقف التي تدفعك للدخول في وصلات من الضحك. \"بيل و نبيل\" خليط جميل من الدراما والكوميديا.. مواقف مضحكة مبكية يصنعها خيال المؤلف عن صداقته مع بيل غيتس مؤسس وصاحب شركة مايكروسوفت أكبر إمبراطورية برمجيات في العالم يرافق بها القارئ في جولات جميلة تارة في مدينته الدمام وتارة يذهب إليه في زيارة خاصة في أميركا وأخرى وهما يتحدثان على الهاتف وانتهاءً بقضاءهما إجازة راحة واستجمام. أيضا يتضمن الكتاب حكايات أخرى تسخر من الواقع الاجتماعي والديني والسياسي في الوطن العربي فيتطرق الى الرومانسية الزوجية وذكرياته الجريئة وهو يسردها بكل سخرية عندما كان طالباً في المرحلة المتوسطة. يتضمن الكتاب أيضاً إنتقاداً لاذعاً للعديد من الممارسات الاجتماعية واستخدام الدين ذريعة للتفوق والسيطرة وتسويق مفاهيم بالية أكل عليها الدهر وشرب. كتب مقدمة الكتاب الأستاذان اللامعان الإعلامي السعودي تركي الدخيل والكاتب الساخر جعفر عباس. بعض ما قاله تركي عن الكتاب: \"هذا الكتاب الساخر (نبيل)، ليس للاسترخاء، فقط، بل هو للرخاء الفكري واللفظي، فاستمتعوا بنبيل... الأكثر وفاء، وسخرية!\". أما الكاتب جعفر عباس فينصح القراء بأن لا يشتروا هذا الكتاب.. ويسرد لهم الأسباب منها عدم وفاء الكاتب بنسبة مئوية من عائدات مبيعات الكتاب، ويعترف-على مضض-بأنه لفت انتباهه بكتاباته التي تنم عن ذكاء وقوة ملاحظة وروح مرحة. ويمضي يقول أن أهم إضافة لنبيل المعجل في مجال الكتابة والنشر، هي أنه وكدارس متخصص في تقنية المعلومات، رفض استجداء الفرصة من الصحافة المكتوبة، وجعل من شبكة الانترنت منبراً يتواصل عبره مع القراء حتى صار \"شيخ طريقة\"، وله مريدون ومريدات.. وقد كتب عنه مقالاً في جريدة \"اليوم\" السعودية، يقول فيه إنه سيأتي اليوم الذي تهرول فيه الصحف السعودية إلى نبيل المعجل، وحينها سيصبح اسمه \"نبيل المدلل\"، ومن حقه أن يتدلل،.. فهو كاتب متمكن لأنه قارئ متمكن. نبيل كاتب ساخر مطبوع وموهوب، وفي تقديري، فالكتابة الساخرة هبة ورزق من عند الله، وليس صنعة تكتسب بالممارسة والمران.. المهم أن نبيل رفض استجداء الفرص من الصحف الورقية فكان أول كاتب ينال جماهيرية واسعة بالتواصل مع القراء عبر الانترنت.",
  "genres": [
    "Nonfiction"
  ],
  "author": "نبيل فهد المعجل",
  "average_rating": "3.10",
  "url": "https://www.goodreads.com/book/show/3028423"
}