{
  "title": "The Fated Sky",
  "description": "Librarian note: Older cover of B01FKY8EBM.One man's fight against fate shapes the destiny of an entire world.Caer's breath hissed between his teeth. For some reason he had assumed that offworlders would be frail, with weak, puny bodies. From all he had heard they were feeble, using machines they had invented to do the work of their muscles. But this one was strong and his body was built like any ordinary man. His flesh carried several old scars and his muscles were clean and compact beneath the skin. The thought struck him that this man would fetch a fortune in the Alfor slave pens. The castellans would be scrambling over each other to purchase something so rare and exotic as a genuine offworlder. “See, he is a fighter, Captain. This and this - they were made by blades,” Zarul said, pointing at the scars. Caer nodded.“Well, if he lives, perhaps we shall find out what kind of fighter he is, this man from the stars.”Temsevar is an insignificant Periphery world on the very fringes of galactic civilisation. Settled long before the rise of faster-than-light technologies and left isolated for hundreds of years, its population have degenerated into the barbarism of a medieval culture. This primitive world has nothing the wealthy planets of the Coalition could want, until it becomes unwitting host to one of their most dangerous enemies - Avilon Revid.From the moment he wakes up in the caravan of the merchant-princess Alexa the Fair, Avilon has to fight simply to survive in a world where he is seen as alien and dangerous. It is a battle to obtain his freedom,that pushes his skills and resources to the limit,so he can find a way off-planet before his enemies in the Coalition track him down.But Temsevar has its own brutal conflicts being played out against the backdrop of its harsh and unforgiving climate. The society is dominated by a ruthless Warlord, intent on subduing the entire continent to his will and whose brilliant general - Jariq Zarengor - has earned a reputation for callous bloodshed. And then there is the enigmatic Durban Chola, trading information to whoever pays him for it, while playing his own, highly dangerous, game with fate.The Fated Sky is the first volume in a new series of character driven books, which combine the action and space opera of science-fiction classics with the intrigue and political duplicity of the fantasy and historical genres. If 'Game of Thrones' met 'Star Wars' - this is what their progeny might look like.",
  "genres": [
    "Science Fiction",
    "Fiction"
  ],
  "author": "E.M. Swift-Hook",
  "average_rating": "4.05",
  "url": "https://www.goodreads.com/book/show/30296607-the-fated-sky"
}