{
  "title": "Carmilla's Lament: A Vampire Tale",
  "description": "Newly Edited!A lonely young woman living on a remote estate is befriended by a beatiful young countess after what seems a chance encounter. Laura's gentle innocence prevents her from seeing the obvious, that her new friend Carmilla is a sexual demon of the highest order, and one who has fallen passionately in love with her. Over time Carmilla's lust for Laura and her soul overpower the creature's sensiblities and caution as she seeks to gain Laura for her own. The shadows grow darker leaving Laura tense and wary as she delves into sexual exploration never seeing the danger at hand. As Laura slips deeper into lust, the death toll mounts around her and she must decide her future without truly knowing what is at stake.Carmilla's Lament is a tale of lust, love and sacrifice that is best read late at night and alone. Draw the curtains, pull up the covers and enjoy! Prior to purchase please feel free to enjoy a sample.Recent By Darkowl \"Darkowl\" (London) - See all my reviewsAmazon Verified Purchase(What's this?)This review is Carmilla's A Vampire Tale (Kindle Edition)Being a Le Fanu fan and an avid reader of \"dark\" novels, I came across this little tale and thought for the money, why not? The author has crafted an erotic version of the Carmilla story, whilst remaining true to Le Fanu's characterization.The author is undoubtedly talented and I would give her future books another go, but I only hope her ability to edit her work improves, so as not to detract from the excellent stories she is capable of delivering. In conclusion, Carmilla's Lament is worth a read.By ecogeek - See all my reviewsThis review is Carmilla's A Vampire Tale (Kindle Edition)Great book, especially if you like your sexy scenes with a literary backdrop. I don't know about reading it alone at night, however. You might want to make sure that there is a special someone close by. One, because it can get a little scary at times (I slept with the light on!) and two, because after reading the naughty bits you will want a play mate. Enjoy this one, I certainly did.89, 754 wordsAll Rights Reserved.Carmilla’s Dark Horse Publishing Copyright ©2011 Catherine Grey",
  "genres": [
    "LGBT",
    "Vampires",
    "Fantasy"
  ],
  "author": "Catherine Rose",
  "average_rating": "3.08",
  "url": "https://www.goodreads.com/book/show/11887337-carmilla-s-lament"
}