{
  "title": "Broken Compass",
  "description": "Broken Compass is a spinoff within the Supernatural Prison World. Told in dual POVs from Maximus Compass and Mischa Lebron. This is full length and standalone. You do not need to read the Supernatural Prison trilogy first.Maximus Compass is a vampire without direction. Without heart. And without soul. He lost his true mate in the great battle against the dragon king, and now must face life alone.And yet … something is happening to his agony. It’s fading away, leaving him with barely a memory of the female he believed to be his one and only.As his mind clears he starts to wonder if the mate bond had been nothing more than a manufactured ploy? This suspicion explodes within him right around the time he runs back into a certain wolf shifter.Mischa Lebron is a complication he doesn’t need in his life. He can’t erase her from his mind though, and while memories of his supposed true mate continue to fade into mere shadows, his one night with Mischa is blazingly strong. But they’re not of the same supernatural race, so there’s no way for a a true bond to exist between them.Right?When an old threat rips apart their pack, Maximus will come to realize that he would do anything to save Mischa. That the mate he thought was perfect and precious was nothing on the shifter he walked away from. Now Maximus truly has everything to lose.Teaser (SPOILER ALERT FROM DRAGON MATED!) Mischa: Dark blue eyes followed my movements, and Braxton's concern was barely concealed. He was shrewdly watching me, but every now and then his eyes would dart back to his brother.I wanted to ask them what they were fighting about, but instead decided to act like it was normal. No big deal. Which for supes, it probably was.Needing some relief from the tension I moved closer to Braxton and murmured: \"Jessa is out of cake.\" Which was our code for, “Jessa is out of cake, get her some freaking cake, she's actually going to kill someone if she doesn’t get some cake.”The dragon shifter's eyes widened and a tendril of what looked like panic fluttered across the dark depths. I could see he was torn about leaving straight away to find his mate, but in the end he remained where it was. He must have decided he couldn't leave me with Maximus, in his current state of mega-pissed vampire.Before I could think up anything else as a distraction, the furious vampire super-speeded toward me and suddenly I couldn’t ignore Maximus Compass any longer. I lost my breath as he towered over me. His broad shoulders filled the space, and his presence sucked all remaining oxygen from around me. I worked extra hard to keep a calm face.Maximus’ hands twitched at his side as he finally growled out. “Who do I need to kill? Whose baby is this, Mischa?”",
  "genres": [
    "Paranormal",
    "Fantasy",
    "Romance",
    "Vampires",
    "Paranormal Romance",
    "Dragons",
    "Supernatural"
  ],
  "author": "Jaymin Eve",
  "average_rating": "4.33",
  "url": "https://www.goodreads.com/book/show/30286325-broken-compass"
}