{
  "title": "The Beta Male Revolution: Why Many Men Have Totally Lost Interest in Marriage in Today's Society",
  "description": "If you are a man reading this, what is the difference between your definition of a 'good girl' vs. your definition of a 'kinky slut?'If you are a woman reading this, what is the difference between your definition of a 'nice guy' vs. your definition of a 'bad boy'?There are some men who women love engaging in multiple episodes of short-term and/or non-monogamous 'casual' sex, but they would publicly categorize those men as 'jerks' who would never be qualified to be a woman's husband or faithful boyfriend.Similarly, there are some women who men love engaging in many episodes of casual sex, but realistically, they would never, ever entertain the thought of having that woman become their next long-term girlfriend or future wife.What about the men and women on the opposite end?What about those men and women who seem to have a lot to offer members of the opposite sex when it comes to their very friendly, accommodating, and entertaining personalities ... but many of these same men and women are perceived as 'boring' and unsatisfying sexually?If any woman believes that men want to choose between the monogamy-oriented 'good girl' type and the kinkier and more promiscuous 'slut' type, they are being naive. Many men want BOTH types in their life.Similarly, if any man believes that all women want to choose between the friendly, personable, and financially generous 'gentleman' or 'nice guy' type and the kinkier, more erotically dominant and seductive 'bad boy' type, they are also being very naive. A good number of women in society want BOTH types in their life.In the middle of the 20th Century, it was the women who were primarily frustrated with the deceitful and sexually duplicitous ways of men, and their response was The Second Wave of Feminism and the Sexual Revolution.Now, in the first two decades of the New Millennium, it is now men who are very angry and frustrated with the deceitful, manipulative, and sexually duplicitous ways of women, and their response is what Author Alan Roger Currie refers to as \"THE BETA MALE REVOLUTION.\"Currie asserts that 21st Century dating rituals are vastly different than the dating rituals our ancestors engaged in during the 19th Century and the first half of the 20th Century.The appeal of entering into a strictly monogamous marriage has diminished significantly among both men and women, and in today's society, many single men and women have given in to their more promiscuous and/or polyamorous tendencies, and avoid long-term monogamous relationships and strictly monogamous marriages altogether. Currie categorizes this book as somewhat of a 'prequel' to his other popular books, which includes 'Mode One: Let the Women Know What You're REALLY Thinking' and 'Oooooh . . . Say it Again: Mastering the Fine Art of Verbal Seduction and Aural Sex'Read this book and find out where we are as a society, and where we seem to be headed regarding the institution of marriage and the concept of traditional monogamous relationships.In addition to being a book author, Currie tours the country as a public speaker who discusses issues related to developing better interpersonal communication skills between men and women, erotic dominance and submission, and date-rape and sexual assault prevention. Currie has also spoken in Berlin, Germany and London, England.Currie is an alumnus of Indiana University in Bloomington, Indiana and has appeared on local, regional, and national television and has been interviewed numerous times on local, regional, and national talk radio programs.",
  "genres": [
    "Psychology",
    "Nonfiction",
    "Sexuality",
    "Self Help",
    "Relationships"
  ],
  "author": "Alan Roger Currie",
  "average_rating": "4.04",
  "url": "https://www.goodreads.com/book/show/30292229-the-beta-male-revolution"
}