{
  "title": "A Dog's Head",
  "description": "Jean Dutourd's A Dog's Head is a wonderful piece of magical realism, reminiscent of Voltaire, Borges and Kafka. With biting wit, Dutourd presents the story of Edmund Du Chaillu, a boy born, to his bourgeois parents's horror, with the head of a spaniel. Edmund must endure his school-mates' teasing as well as an urge to carry a newspaper in his mouth. This is the story of his life, trials, and joys as he searches for a normal life of worth and love. \"Dutourd is a fine craftsman, whose work has the classic virtues of brevity, lucidity, and concentration. He has written a sardonic divertissement that concerns itself with fundamental problems of man's existence-a tale that is sad-eyed, witty, and often very funny.\"—Charles J. Rolo, New York Times Book Review\"A tiny masterpiece in the French classical tradition. . . . Stylish, elegant and witty, and told with an apparent lightheartedness that points to rather than obscures the hero's essential tragedy.\"—P. L. Travers, New York Herald Tribune\"Wit, a good deal of shrewd classical allusion, and a Voltarian satire are the book's assets.\"—Edmund Fuller, Chicago Tribune\"The work of an expert craftsman and of a careful writer of prose, ending with the rarest gift in modern letters: the comic spirit.\"—Henri Peyre, The Saturday Review\"Dutourd might well have dropped his story at this point, had it been his intention simply to excoriate the human race for its treatment of those who are physically afflicted. Instead, he presses on in his terse, deadpan prose to teach a lesson to the afflicted of the world as well.\"—Time\"A Dog's Head is one of the most curious, most beautifully conceived and written fantasies you've ever come across.\"—J. H. Jackson, San Francisco Chronicle\"A Dog's Head is an excellent joke in the worst possible taste, and its author, M. Jean Dutourd, is a satirist of the first rank.\"—New Yorker",
  "genres": [
    "Fiction",
    "French Literature",
    "Animals",
    "France"
  ],
  "author": "Jean Dutourd",
  "average_rating": "3.54",
  "url": "https://www.goodreads.com/book/show/1188731.A_Dog_s_Head"
}