{
  "title": "The House in Prague: How a Stolen House Helped an Immigrant Girl Find Her Way Home",
  "description": "A cherished house, the family it sheltered, and the true meaning of home 1939: the Nazis have invaded Prague. Little Anna huddles with her doll in the corner of a train car while a German officer shrieks, “You are Jews!” Fleeing for their lives, her family has abandoned their elegant house near Prague Castle, bringing their life of privilege to an abrupt halt. In this memoir that reads like a novel, we meet Anna’s shining and beautiful opera singer mother, her prominent lawyer father, and their circle of friends that includes Albert Schweitzer and the family of Czech President Thomas Masaryk. Through Anna’s eyes, we relive magical Christmases, summers in the country, and a terrifying trip to Nazi Dresden that changes everything. We witness the family’s escape and voyage to Ellis Island, and Anna's struggle to become an American girl in a city teeming with immigrants and prejudice. Post-war life brings cherished Holocaust survivors and their harrowing stories. After the Velvet Revolution of 1989, Anna’s family sues for the return of their house in Prague. But will they prevail? And if they do, what then? The House in Prague is richly illustrated with pictures from the author’s family archive. Written with straightforward, lyrical clarity, her family members and the many famous musicians, authors, and poets that pass through their lives come alive for the reader. A gripping story on its own merits, this tale of war, love, and loss dares us to think about the immigrant experience in fresh ways. Index included. \"An exquisite rumination on history, loss, and love. Anna Perlberg's voice is a luminous guide to the heart of home - hers, but also, as is true of all great stories, ours.\" ( Caroline Heller, author of Reading A Memoir in Two Parts )",
  "genres": [
    "Biography",
    "World War II",
    "Memoir",
    "History",
    "European History"
  ],
  "author": "Anna Nessy Perlberg",
  "average_rating": "3.88",
  "url": "https://www.goodreads.com/book/show/30307655-the-house-in-prague"
}