{
  "title": "Life, Life: Selected Poems",
  "description": "LIFE, SELECTED POEMS BY ARSENY TARKOVSKY A book of poetry by Russian poet Arseny Tarkovsky, translated by Virginia Rounding. Includes many poems used in Arseny's son's films (Andrei Tarkovsky). With a bibliography of both Arseny and his son Andrei Tarkovsky, and illustrations from Tarkovsky's movies. This is one of the very few translations in English of poetry by Arseny Tarkovsky available. FROM THE Arseny Aleksandrovich Tarkovsky was was born in June 1907 in Elizavetgrad, later named Kirovograd. He studied at the Academy of Literature in Moscow from 1925 to 1929, and also worked in the editorial office of the journal Gudok. He was well respected as a translator, especially of the Oriental classics, but was little known as a poet for most of his life, being unable to get any of his own work published during the Stalinist era. His poems did not begin to appear in book form until he was over fifty. His son, the film director Andrei Tarkovsky, made extensive use of his father's in some of his films, and certain of his diary entries indicate the esteem in which the poet was held in the Soviet Union towards the end of his life. An entry written after Andrei had given a talk at the Moscow Physical Institute in 1980, for instance, reproduces the following note from a member of the 'An enormous number of people in this hall admire Arseny Aleksandrovich Tarkovsky as a great Russian poet. Please convey our respects to him.' One of the few recorded public appearances of Arseny Tarkovsky was at the funeral of Anna Akhmatova; he was one of three writers deputed to accompany her coffin from Domodedovo to Leningrad, and he read both at her funeral in Komarovo and at the first evening held in her memory in Moscow. He died in 1989 and is now beginning to be recognised as one of the many significant Russian poets of the twentieth century. From the poem ‘Ignatyevo Forest': The last leaves' embers in total immolation Rise into the sky; this whole forest Seethes with irritation, just as we did That last year we lived together. Illustrated. With bibliography and notes. ISBN 978186171144. www.crmoon.com",
  "genres": [
    "Poetry",
    "Russian Literature",
    "Russia"
  ],
  "author": "Arseny Tarkovsky",
  "average_rating": "4.01",
  "url": "https://www.goodreads.com/book/show/302986.Life_Life"
}