{
  "title": "Small Town Justice",
  "description": "Small Town Justice A Janice Berne Mystery A small town lawyer takes on an unpopular murder case that leaves her client in fear for his life. With the sheriff refusing to investigate any further and her client facing a second degree murder charge, Janice Berne discovers secrets lurking in her town of Connerston, Indiana. With her paralegal Andy and private investigator Justin, she seeks out the truth before Stevie Evans’ time runs out. In a town of 9,000 surrounded by Midwestern cornfields, Janice Berne is all that stands between a corroding justice system and her clients’ rights. Known by her neighbors and friends as a laid-back, charming, attractive woman prone to sarcastic banter, she spends her days in court fighting for her clients and her nights at home curled up with her notes and a glass of her favorite wine. Upon receiving news of a murder, the first ever in Connerston’s proud history, she rushes to the jail to meet with her long-time client Stevie Evans. However, when she arrives she finds a client too terrified to tell her much of anything, and complicating the case even further is the fact that the victim’s son is the deputy on duty in the jail when Stevie is booked, and he is not taking the news well at all according to the bruises on Stevie’s face. Along the way, Janice and her team race against a 48 hour deadline from the prosecutor on the case, ASA Cody Brynte, who wants to make a plea agreement that will leave Stevie serving some hard time in prison. Stevie is insistent on taking the deal unless Janice and her office can work something out before then. There’s more than meets the eye at first glance in this murder. Some witnesses may be reluctant to testify, and others just may not be who they seem. There are upstanding public officials, lovable older ladies, officers of the law, low-level criminals, and all types of characters in the middle filling this town and complicating matters in trying to figure out just what happened to George Dunn. How do you make the law work in a town where the establishment is all against you? How do you live with the same people you’re fighting in court every day? How do you make peace with the fact that most of the leaders in town cross the street when they see you coming? Most importantly, just who did shoot George Dunn? In a quiet town of only 9,000 people, one of them is now a murderer. It’s up to Janice to prove it wasn’t her client Stevie, but it’s going to be a pretty tough case with the police and State’s Attorney against her. She’s spent years defending drunks and drug addicts, but nothing like this. Nobody in Connerston ever thought they’d have a murder on their hands. Now only Janice can make sure her client doesn’t become the scapegoat of the town. She’s facing the biggest case she’s ever seen. Little does she know this case is only the beginning of the fight of her career...and her life.",
  "genres": [],
  "author": "Emily S Webster",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/30302829-small-town-justice"
}