{
  "title": "How We Became Posthuman: Virtual Bodies in Cybernetics, Literature, and Informatics",
  "description": "In this age of DNA computers and artificial intelligence, information is becoming disembodied even as the \"bodies\" that once carried it vanish into virtuality. While some marvel at these changes, envisioning consciousness downloaded into a computer or humans \"beamed\" Star Trek-style, others view them with horror, seeing monsters brooding in the machines. In How We Became Posthuman, N. Katherine Hayles separates hype from fact, investigating the fate of embodiment in an information age.Hayles relates three interwoven stories: how information lost its body, that is, how it came to be conceptualized as an entity separate from the material forms that carry it; the cultural and technological construction of the cyborg; and the dismantling of the liberal humanist \"subject\" in cybernetic discourse, along with the emergence of the \"posthuman.\"Ranging widely across the history of technology, cultural studies, and literary criticism, Hayles shows what had to be erased, forgotten, and elided to conceive of information as a disembodied entity. Thus she moves from the post-World War II Macy Conferences on cybernetics to the 1952 novel Limbo by cybernetics aficionado Bernard Wolfe; from the concept of self-making to Philip K. Dick's literary explorations of hallucination and reality; and from artificial life to postmodern novels exploring the implications of seeing humans as cybernetic systems.Although becoming posthuman can be nightmarish, Hayles shows how it can also be liberating. From the birth of cybernetics to artificial life, How We Became Posthuman provides an indispensable account of how we arrived in our virtual age, and of where we might go from here.",
  "genres": [
    "Philosophy",
    "Nonfiction",
    "Science",
    "Theory",
    "Technology",
    "Academic",
    "History"
  ],
  "author": "N. Katherine Hayles",
  "average_rating": "4.07",
  "url": "https://www.goodreads.com/book/show/303065.How_We_Became_Posthuman"
}