{
  "title": "To Follow My Heart",
  "description": "Bestselling author, Sherry Ewing, brings you the next installment of her Knights of Berwyck series, To Follow My Heart. Love is a leap. Sometimes you need to jump…After a gut wrenching break up with her fiancé, Jenna Sinclair heads to the coast to do a little soul searching. To say everything is subject to change is putting it mildly. Her world is not only turned upside down, but pretty much torn asunder when she is pulled through a time gate on the beach beneath the Cliff House and transported more than eight hundred years into the past.Fletcher Monroe, captain of the garrison knights at Berwyck Castle, has wasted too much time pining for a woman who will never be his. When he finally decides to move on with his life and focus on his duties, he is suddenly confronted with a woman who magically appears at his feet. This could either be the best thing that has ever happened to him or another cursed event in a string of many. He soon finds he is wildly attracted to her, but she’s scared to death of him ─ not a very encouraging beginning.From the shores of California to twelfth century England and back again, Jenna and Fletcher must find a way to reconcile their two different worlds before Time forever tears them apart. Although Sherry's novels can be read as standalones, there is a particular order to read them as characters are introduced. They are as Medieval/Time To Love A Scottish Laird: De Wolfe Pack Connected WorldTo Love an English Knight: De Wolfe Pack Connected WorldIf My Heart Could See You: The A Medieval Romance (Book One)For All of Ever: The Knights of Berwyck, A Quest Through Time (Book One)Only For You: The Knights of Berwyck, A Quest Through Time (Book Two)Hearts Across Time (a special edition novel of For All of Ever & Only For You)A Knight To Call My Own: The MacLarens, A Medieval Romance (Book Two)To Follow My Heart: The Knights of Berwyck, A Quest Through Time (Book Three)The Piper's Lady: The MacLarens, A Medieval Romance (Book Three)Love Will Find You: The Knights of Berwyck, A Quest Through Time (Book Four)One Last Kiss: The Knights of Berwyck, A Quest Through Time (Book Five)Regency'A Kiss For Charity: A De Courtenay Novella (Book One)The Earl Takes A Wife: A De Courtenay Novella (Book Two)Before I Found  A De Courtenay Novella (Book Three) in Storm & Shelter, A Bluestocking Belles Collection with FriendsNothing But Time: A Family of Worth (Book One)One Moment In Time: A Family of Worth (Book Two)Under the MistletoeA Second Chance at Love: A Frost Fair Regency Romance",
  "genres": [
    "Time Travel",
    "Historical Romance",
    "Romance",
    "Science Fiction",
    "Historical",
    "Fantasy",
    "Fiction"
  ],
  "author": "Sherry Ewing",
  "average_rating": "4.31",
  "url": "https://www.goodreads.com/book/show/30308495-to-follow-my-heart"
}