{
  "title": "Thomas Jefferson: Writings",
  "description": "Now fully represented in this Library of America volume is the most comprehensive testimony of the writings of our third president and foremost spokesperson for democracy. Thomas Jefferson, a brilliant political thinker, is perhaps best known for the Declaration of Independence, but he was a man of extraordinarily wide interests.He was exceptionally controversial in his own time, and many of his ideas remain the subject of national debate. In his arguments for a system of general education, for local rather than central authority, for caution in international affairs, for religious and intellectual freedom, and for economic and social justice, Jefferson defined the issues that still direct our national political life centuries after the nation's formation. This volume will give readers the opportunity to reassess one of our most influential presidents.Jefferson's First Inaugural Address is a resounding statement of faith in a democracy of enlightened people. His Notes on the State of Virginia (1785) is an invaluable record of the landscape, inhabitants, life, and daily customs of America in the Revolutionary and early national eras. His letters, more than two hundred and fifty of which are gathered here, are brilliant urbane missives to such men as Patrick Henry, Thomas Paine, Lafayette, John Adams and James Madison. His slim Autobiography (1821), written \"for my own more ready reference, and for the information of my family,\" hardly hints at the influence and impact he had as Secretary of State under George Washington, Minister to France, opposition-party Vice President to John Adams, and, after leaving the presidency, founder of the University of Virginia.His public papers and addresses fully demonstrate both the breadth of his interests and the power of his expressive mind. Extensively read (his personal library of ten thousand volumes became the foundation of the Library of Congress) and widely traveled, Jefferson wrote with ease and spontaneity about science, archaeology, botany and gardening, religion, literature, architecture, education, the habits of his fellow citizens, and, of course, his beloved home, Monticello.Jefferson's prose has an energy, clarity, and charming off-handedness, consistent with his conviction that style in writing should impose no barrier between the most educated and the most common reader. For those who want a renewed sense of the opportunity for human freedom that the United States represented to its founders, this is an indispensable book.",
  "genres": [
    "History",
    "Politics",
    "Biography",
    "American History",
    "Nonfiction",
    "Philosophy",
    "American Revolution"
  ],
  "author": "Thomas Jefferson",
  "average_rating": "4.23",
  "url": "https://www.goodreads.com/book/show/303162.Thomas_Jefferson"
}