{
  "title": "Stealing Fire: How Silicon Valley, the Navy SEALs, and Maverick Scientists Are Revolutionizing the Way We Live and Work",
  "description": "NATIONAL BESTSELLER CNBC and Strategy + Business Best Business Book of 2017It’s the biggest revolution you’ve never heard of, and it’s hiding in plain sight. Over the past decade, Silicon Valley executives like Eric Schmidt and Elon Musk, Special Operators like the Navy SEALs and the Green Berets, and maverick scientists like Sasha Shulgin and Amy Cuddy have turned everything we thought we knew about high performance upside down. Instead of grit, better habits, or 10,000 hours, these trailblazers have found a surprising short cut. They're harnessing rare and controversial states of consciousness to solve critical challenges and outperform the competition.New York Times bestselling author Steven Kotler and high performance expert Jamie Wheal spent four years investigating the leading edges of this revolution—from the home of SEAL Team Six to the Googleplex, the Burning Man festival, Richard Branson’s Necker Island, Red Bull’s training center, Nike’s innovation team, and the United Nations’ Headquarters. And what they learned was stunning: In their own ways, with differing languages, techniques, and applications, every one of these groups has been quietly seeking the same thing: the boost in information and inspiration that altered states provide.Today, this revolution is spreading to the mainstream, fueling a trillion dollar underground economy and forcing us to rethink how we can all lead richer, more productive, more satisfying lives. Driven by four accelerating forces—psychology, neurobiology, technology and pharmacology—we are gaining access to and insights about some of the most contested and misunderstood terrain in history. Stealing Fire is a provocative examination of what’s actually possible; a guidebook for anyone who wants to radically upgrade their life.",
  "genres": [
    "Nonfiction",
    "Psychology",
    "Business",
    "Self Help",
    "Science",
    "Personal Development",
    "Audiobook"
  ],
  "author": "Steven Kotler",
  "average_rating": "3.94",
  "url": "https://www.goodreads.com/book/show/30317415-stealing-fire"
}