{
  "title": "Tragic Magic: The Life of Traffic's Chris Wood",
  "description": "Traffic was the most enigmatic British band of their day. Formed in early 1967 by Chris Wood, Steve Winwood, Jim Capaldi and Dave Mason, they rejected the bright lights of London, in favor of a run-down, supposedly haunted, cottage in the country – a place to live communally and write music. With Chris especially intent on channeling the vibes of England’s landscape into their sound, days would be spent getting high, exploring, playing and working in varying proportions. Against all odds this eccentric model paid off – songs such as “Dear Mr. Fantasy” and “John Barleycorn Must Die” would lift Traffic into the upper echelons of the rock world. As they brushed shoulders with Jimi Hendrix, The Beatles and the Grateful Dead, and with Dave dropping in and out of the band, Traffic’s music evolved from a synthesis of Steve’s innate musicality, Jim’s atmospheric lyrics and Chris’s special brand of congenial mysticism. Record sales boomed and tours carried them back and forth across the Atlantic, everything seemed to be going to plan – a dreamlike fairy tale come true. But for Chris, a toll would be exacted. Amid the clashing egos, wearing road trips, stressful break ups and a complex personal life, he vacillated precariously between bursts of exquisite creativity and torrents of self-destruction; a paradoxical dance which continued until his death in 1983. For a man who found artistic expression everything, and for whom suffering for it was an expectation, Chris would stare fully into the Medusa’s face of the music industry, paying a higher price than perhaps any of his contemporaries. Researched and written over a ten-year period, “Tragic Magic” offers the only definitive account of Traffic’s story and Chris Wood’s quietly extraordinary life. Please this Kindle version of Tragic Magic does not contain the photographs found in the print version.",
  "genres": [
    "Music"
  ],
  "author": "Dan Ropek",
  "average_rating": "4.32",
  "url": "https://www.goodreads.com/book/show/30314756-tragic-magic"
}