{
  "title": "Ice Baron: A Post-Apocalyptic Romance Series",
  "description": "A forbidden love. A treacherous marriage proposal. Anya's icy world is about to explode...\nAnya has loved Joshua for years. Unfortunately, as her Protector, he is the one man she is forbidden to marry.Baron Joshua Van Heisman is honor bound to find a good match for Anya. When their mortal enemy Onred offers to marry her, promising an end to generations of war, Joshua accepts the bargain against his gut instincts.Should Anya accept her fate? Can Onred be trusted? Or is he a madman, who will drive their world to the brink of destruction? “...a fast-paced story filled with action, suspense and incredible sexual tension...” – Merrylee, Two Lips Reviews  Buy Ice Baron to step into a thrilling love story today!Excerpt: \nPitch black had settled in outside.\n With it, a deep, biting cold swirled into the cave. She really should put out the fire. But it was so warm and friendly. And Anya felt so alone. Put it out. It was time to get going. Although the cave entrance was partially blocked, someone at the perfect angle might see the light. Maybe that one, last, persistent pilot--although she hadn't heard the craft since noon. He must have given up, too. For now. Unfolding her trowel, Anya chipped up a mound of frozen ice and mud and cast it onto the fire. It flickered, but didn't go out.  \"Don't put it out on my account.\" The low, rough voice made her gasp, and she whipped out her laser.Joshua. He seemed to fill the entrance. The elite, cream military parka made his shoulders seem wider, his body more solid and forbidding.  \"You.\" Hands trembling, she lowered the weapon.  \"Of course it's me. I'm your protector. Who did you think would come for you?\" Palpable fury simmered in him, deep and hot, yet tightly leashed, as were every one of his emotions, always. In the past, she had wished that just once she could break through the impenetrable shell he enclosed around himself. Just once, she'd like to see him snap, to glimpse the true man underneath all the medals and the power that fit him like a glove. To especially see beyond the shiny honor of hero worship with which she'd clothed him when they had first met. She had always wanted to please him. No more.Third Place, Global eBook AwardsGenre: Science Fiction romance, Futuristic romance, Military romance, clean and wholesome romance",
  "genres": [
    "Science Fiction",
    "Romance",
    "Paranormal Romance"
  ],
  "author": "Jennette Green",
  "average_rating": "3.88",
  "url": "https://www.goodreads.com/book/show/11889395-ice-baron"
}