{
  "title": "Roommates",
  "description": "Ethan Fitzell has been avoiding his stepsister Jenny since their parents got married, but when she shows up at his apartment uninvited, he's forced to face the fact that her absence has only made his heart grow fonder...JennyI always liked him. But when our parents got married, things got confused. As if being a teenager isn't confusing enough. All I knew was that the feelings I had for him weren't okay.I’ll never forget the anxiety I felt the night I ran into him at a party that had gotten out of control. I saw him standing around with the popular kids as soon as I walked in the door. And he saw me, too. He always saw me. It was talking to me that he avoided. I watched his buddy spin an empty wine bottle on the butcher block while my friend Brandi rummaged in her oversized purse for the two bottles of hard lemonade her older sister gave us. When the spinning bottle stopped, I realized everyone was staring at me. “Looks like you’ve gotta kiss Jen,” some jock said to Ethan. I felt the color drain from my face, taking the moisture in my mouth with it as a suffocating panic grew in my chest. I was going to be found out. Ethan laughed it off. “Yeah, that’s not happening. She’s my sister.” “Not really, though,” his buddy insisted. The eruption of laughter and jeering sounds made the dim kitchen feel like a jungle full of predators, and I was sure my cheeks were going to burst into flames. “Don’t be stupid,” Ethan said, tilting a can of beer over his mouth. When his friend spun the bottle again, Ethan glanced back at me one more time and wiped the back of his hand across his lips. I’ve been wondering what it would be like to kiss him ever since. **Author's note: This is a full-length, standalone romance novel with no cliffhanger and no cheating. It is intended for a mature audience and has an ending that will leave you smiling so hard it hurts.",
  "genres": [
    "Romance",
    "New Adult",
    "Contemporary",
    "Contemporary Romance",
    "Erotica",
    "Adult",
    "Forced Proximity"
  ],
  "author": "Hazel Kelly",
  "average_rating": "3.72",
  "url": "https://www.goodreads.com/book/show/30333351-roommates"
}