{
  "title": "Hillary Clinton: A Legacy of Lies",
  "description": "In 1996, as the Whitewater investigation into the Clintons' real estate scandal was reaching its climax, the renowned author and columnist, William Safire, called Hillary Clinton \"a congenital liar\" (New York Times, 1996). He added, \"She is in the longtime habit of lying; and she has never been called to account for lying herself or in suborning lying in her aides and friends.\" This new book by James Beresford, with its hard-punching facts and the personal testimonies of people close to the Clintons, may be the last chance for rational thinkers in America to call Hillary to account, and stem the litany of lies that has become her legacy. And Beresford serves up a plethora of reasons why her Presidency of the United States would be an utter disaster.Hillary Clinton: A Legacy of Lies brings into sharp focus how the Clintons have, by their unsavoury morals and perfidious, self-serving actions, created a new standard for younger generations in their understanding of what is right and wrong. Beresford believes that William Safire's use of the word \"congenital\" was misapplied since congenital implies something derived from birth—a sickness if you will. But in Hillary Clinton's case, Beresford believes her actions are not congenital (\"... that would be too forgiving ...\") but deliberately cunning and egomaniacal.\"There are those,\" says Beresford, \"who might think this book, released in the freakish election year of 2016, might be some gambit by the unbridled Trump campaign to smear Hillary Clinton. But I could just as easily write a book on Donald Trump and why he, too, cannot be trusted.\"This book is of course one person's opinion. Yet it presents facts and assertions in an easy-to-follow format with credible citations and references.\"It is my sincere hope,\" says Beresford, \"that even those who have so far been admirers of Hillary Clinton will take a step back from her flock of fawning acolytes, and observe clearly this disingenuous, duplicitous individual for who she really is, who cares for nobody but herself, and who has for too long been indulged by those who should know better.\"",
  "genres": [],
  "author": "James Beresford",
  "average_rating": "2.00",
  "url": "https://www.goodreads.com/book/show/30332790-hillary-clinton"
}