{
  "title": "The Arrangement 22:  The Ferro Family",
  "description": "THE SERIES WITH OVER 12 MILLION COPIES SOLD Volume 22 in the New York Times Bestselling Arrangement Series Everything has come to this one moment, this one night. The plan is ready to be executed. The sexy, dark billionaire Sean Ferro is at my side and in my bed. As the erotic tension between us deepens, I see the man he could be—the man he’s becoming. Sean has me in every possible way and swears to protect me from my enemies. But there’s one thing he can’t save, one thing that’s fracturing inside of me and falling apart. My heart is dying in my chest as my demons plague me without warning. The darkness is vanishing from Sean's eyes and reappearing in mine. The monster within is feeding, ready to rear its head as I wait in horror, disgusted with the woman I’m becoming. If I go through with this, if I cause the deaths of these people, there will be nothing left of me. But if I don’t fight back, I die. I don’t want to fight anymore, but there’s a tiny reason urging me on, a secret I’ve known for a while giving me strength to see this through. Genre: New Adult Romance, approx 125 pgs ea ~The Arrangement Vol 1-21 are on sale now. ~23 books total in this series~ THE FERRO FAMILY The Arrangement (Sean & AVery) Damaged (Peter & Sidney) Stripped (Jon & Cassie) The Proposition (Bryan & Hallie) Easy (Joscyln Ferro) Broken Promises (Trystan & Mari) The Wedding Contract (Nick & Sky) Secrets & Lies (Kerry) H.M. WARD'S NEW YORK CITY LOVE STORIES Secrets (Cole & Anna) Scandalous (Jack & Abby) A Little Christmas Romance (Chris & Brooke) Christmas Kisses (Ryan & Holly) You can interact with this bestselling author at: www.facebook.com/AuthorHMWard. Text HMWARD to 24587 and get a text reminder on release & sale days.",
  "genres": [
    "Romance",
    "Erotica",
    "Suspense",
    "New Adult Romance",
    "Young Adult",
    "Contemporary"
  ],
  "author": "H.M. Ward",
  "average_rating": "4.22",
  "url": "https://www.goodreads.com/book/show/30340836-the-arrangement-22"
}