{
  "title": "Cries of the Forgotten",
  "description": "John Burdett, internationally best-selling mystery author of Bangkok 8 (Sonchai Jitpleecheep Series), The Last Six Million Seconds and A Personal History of Thirst calls Cries of the Forgotten, \"A moving insight into Zulu shamanism and Christian forgiveness in today's troubled South Africa.\"  From a new, powerful voice in the post-apartheid South African canon of authors, comes Cries of the Forgotten, a murder mystery that explores the scars left by the inner war of a nation.  A seemingly ordinary man with an extraordinary secret…  One day, Tshepo Nonyane, a mild-mannered government statistician walks into the Johannesburg Metro Police Department and confesses to the brutal rapes and murders of several women. He describes his crimes in grisly detail, even as his clean-cut, sincere appearance completely belies the violent man he claims to be.  As Detective Eloff Mueller and her police partner, Joseph Langa, investigate Nonyane’s horrifying confessions, they find themselves pulled into a world where appearance and reality are blurred beyond recognition. They could never have prepared for what is uncovered along with the skeletons of the long-dead and forgotten victims of South Africa’s epidemic violence against women.  Tshepo, the son of one of the country’s most powerful sangomas (medicine men), has long-denied his heritage and believes he has gone mad from refusing to follow his ancestral calling. His madness has led him to murder and brutality…or so he believes. Along with the visions of his unthinkable crimes, the act of confession opens up long-forgotten wounds and secrets he has been keeping from himself. Unlocking the depths of his soul leads to consequences he, and everyone else in his beloved South Africa, could never have imagined in a million lifetimes.  Part murder mystery, part social statement and part spiritual journey, Cries of the Forgotten is one man’s odyssey to protect and heal the nation he loves from its self-inflicted wounds. With a cast of characters who yearn for justice in a nation where men and women have long been at war against themselves and each other, Cries of the Forgotten explores the pressing question of what it will take for the violence to end, once and for all.",
  "genres": [],
  "author": "Percy Makhuba",
  "average_rating": "4.38",
  "url": "https://www.goodreads.com/book/show/30355506-cries-of-the-forgotten"
}