{
  "title": "The Last Prophecy",
  "description": "Saxon Andrew’s The Last Prophecy is the final book in the Death Prophecies Series. Humanity is facing the most dangerous civilization to ever threaten it. One-by-one the other would be conquers have been defeated or have fled the giant Flasher Warships. The Colonies have developed new technology to confront the giant warships on an equal footing but the number of advanced warships using it are pitifully few against the vast fleets facing them. And the Flashers intend to quickly use their huge advantage in numbers to find the Colonies’ Fleet and eliminate it.  Scott and Amy Hart have retired from the military and have left the colonies to spend their retirement years on Earth. Amy is unaware that three major Flasher War Fleets have been dispatched to attack Earth in the hopes of drawing the Colony Fleet out of hiding; the Flashers intend to trap it in a deadly crossfire above Earth. The Colonies only have a few thousand advanced warships to stop the orbital bombardment and Admiral Connor knows they aren’t enough. But he just can't stand by and watch Earth die.  The Last Prophecy starts fast and picks up speed moving toward a climax of epic proportions. Time is working against humanity and there doesn’t appear to be much hope of surviving the coming Flasher invasion. Earth is going to be attacked and Admiral Amy Hart and Scott are on the planet’s surface. Timmy Hart is determined to prevent his mother’s death no matter the cost. The consequences of that decision will be devastating.  Excerpt: The Last Prophecy  Scott and Amy were staring at him from the boat next to the entry port, “GET ON BOARD…NOW!!” Amy’s eyes were narrow as she said, “What’s going on Timmy, we have to put the boat away and…” “SHUT UP AND GET ON BOARD!!!” Timmy screamed. The boat was right next to the open port and Amy started to speak again but Timmy grabbed the handle next to the port, reached out and grabbed his mother by the front of her shirt, and snatched her into the port. He extended his hand and Scott grabbed it and jumped into the port. Timmy slammed the port shut and ran to the command chair. Tim had thrown his mother into the port and she landed on the floor and slid six feet, “TIMMY!!!” Timmy buckled into the command chair and yelled as he gripped the controls of the Attack Fighter, “BUCKLE IN TIGHT!!” He activated the lower bow thruster and the nose of the Attack Fighter lifted and went vertical. Scott lifted Amy off the floor and walked her to one of the chairs as she was screaming at Timmy. He went to the other chair and started pulling the belts around him as Amy continued to yell at her son. Suddenly, a brilliant light lit up the inside of the Attack Fighter as a mile wide, brilliant, red beam came out of the sky and hit the Crystal River Nuclear Power Station six miles away. Timmy pushed the thruster handle fully forward and energized the DE Force Field. The small ship leapt forward slamming Amy into her chair’s cushions as Timmy flew it directly away from the giant shockwave that was screaming into the atmosphere above the blasted power station and directly toward them at the speed of sound. Amy was struck silent by the brilliant light that came through the forward viewport. She felt the ship rock violently as the air moving at hurricane force in front of the advancing shockwave blew past them. She looked quickly through the rear viewport and saw the giant blast behind them roll out from the power plant and blow away the towns of Crystal River and Homosassa. A moment later, the armor shielding covered the viewports forcing her to look at the three wall monitors to see what was happening.",
  "genres": [],
  "author": "Saxon Andrew",
  "average_rating": "4.54",
  "url": "https://www.goodreads.com/book/show/30351570-the-last-prophecy"
}