{
  "title": "Two Alone",
  "description": "Two Alone\nDamn her. His body was still on fire. Damn her, why had she responded that way? So honestly. With no coyness. No affectation. Her mouth had been so receptive. Her kisses so generous. Her breasts so soft…Only two survive the small plane crash in the Canadian wilderness miles from civilization: Rusty Carlson, a real estate agent from Beverly Hills, who has never faced anything more perilous than L.A.’s rush hour traffic; and Cooper Landry, an embittered Vietnam veteran, who has endured the horrors of warfare and a POW camp.Rusty wouldn’t have believed herself capable of dragging her unconscious fellow passenger from the wreckage, but that was only the first challenge confronting her. The man himself is as hostile and unforgiving as the mountainous terrain in which they’re stranded. If they had a choice, they would go their separate ways. But they don’t. If they want to live, they must stay together.Teamed against the harsh elements, injury, and a pair of conniving cutthroats, Rusty and Cooper must rely on each other in order to survive. In a one room cabin they find shelter. . .but, as winter closes in, they have no protection against the sexual attraction that becomes the real test of their fortitude.Within those four rough walls, Rusty discovers that Cooper’s brusqueness arises from immeasurable heartache, and, to Cooper’s dismay, his credo of No romance, no love, no thanks becomes his desperate chant to ward against Rusty’s allure.************************************************************************************\nDois Estranhos\nMaldita seja. Seu corpo ainda estava em chamas. Maldita seja, por que ela respondeu daquela maneira? Então, honestamente. Sem nenhuma timidez. Sem afetação. Sua boca tinha sido tão receptiva. Seus beijos tão generosos. Seus seios são tão macios…Apenas dois sobreviveram ao acidente de pequeno avião no deserto canadense, a quilômetros da civilização: Rusty Carlson, um corretor de imóveis de Beverly Hills, que nunca enfrentou nada mais perigoso do que o trânsito da hora do rush de Los Angeles; e Cooper Landry, um veterano amargurado do Vietnã, que suportou os horrores da guerra e de um campo de prisioneiros de guerra.Rusty não teria se acreditado capaz de arrastar seu companheiro inconsciente dos destroços, mas esse foi apenas o primeiro desafio que ela enfrentou. O próprio homem é tão hostil e implacável quanto o terreno montanhoso em que estão presos. Se tivessem escolha, seguiriam caminhos separados. Mas eles não. Se quiserem viver, devem ficar juntos.Juntos contra os elementos agressivos, os ferimentos e um par de assassinos coniventes, Rusty e Cooper devem confiar um no outro para sobreviver. Em uma cabana de um cômodo eles encontram abrigo. . .mas, à medida que o inverno se aproxima, eles não têm proteção contra a atração sexual que se torna o verdadeiro teste à sua coragem.Dentro dessas quatro paredes ásperas, Rusty descobre que a brusquidão de Cooper surge de uma dor de cabeça imensurável e, para consternação de Cooper, seu credo de Sem romance, sem amor, sem agradecimento torna-se seu canto desesperado para se proteger contra o fascínio de Rusty.",
  "genres": [
    "Romance",
    "Contemporary Romance",
    "Contemporary",
    "Survival",
    "Fiction",
    "Romantic Suspense",
    "Harlequin"
  ],
  "author": "Sandra       Brown",
  "average_rating": "3.74",
  "url": "https://www.goodreads.com/book/show/30358.Two_Alone"
}