{
  "title": "He Is Poison",
  "description": "Alternate cover edition--- Love like butterfly knives in the stomach. ---Domenico Acerbi. The Villani Family’s best assassin. Ruthless. Vicious. With no patience for weakness.Seth Villani. The Don’s son. Clueless. Stubborn. In dire need of someone to keep him in line.Domenico Acerbi grew up ready to give his life for the Family. Ready to follow orders and exceed expectations. A proud man of honor.The last thing he wants to deal with is training the Don’s son for his future role within the organization. Lazy, annoying, spoiled, and as hot as a Sicilian summer, Seth Villani is no mafia material. But a man who could never become a threat might just be what Domenico needs. Seth Villani wants nothing to do with the mafia. Unfortunately, he doesn’t get a say when he’s pulled back into the fold. Thrown into a den of serpents otherwise known as the Villani Family, Seth has to find a way to navigate the maze of lies. But when Domenico Acerbi, the most vicious snake of them all, sinks his fangs into Seth, letting go becomes impossible. If Seth is doomed to follow in his father's footsteps, he might as well enjoy himself with the most intoxicating man he’s ever met. Maybe he can even fool himself into believing that Domenico isn’t a handsome sociopath who kills for a living. POSSIBLE SPOILERS:Themes: Enemies to lovers, mafia, homophobia, assassin, organized crime, forced proximityWARNING: Adult content. Sizzling hot scenes. If you are easily offended, this book is not for you. ‘Guns n’ Boys’ is a gritty story of extreme violence, offensive language, abuse, and morally ambiguous protagonists. Behind the morbid facade, there is a splash of inappropriate dark humor, and a love story that will crawl under your skin.",
  "genres": [
    "M M Romance",
    "Dark",
    "Romance",
    "Contemporary",
    "Enemies To Lovers",
    "Crime",
    "Dark Romance"
  ],
  "author": "K.A. Merikan",
  "average_rating": "3.70",
  "url": "https://www.goodreads.com/book/show/30357450-he-is-poison"
}