{
  "title": "How Two Love: Making your relationship work and last",
  "description": "Getting together with a partner may be easy, but staying together is anything but. So how do you keep a loving relationship alive, and your sexual intensity fully charged? How do you grow as a partnership, rather than grow apart? 'How Two Love' sets out with a bold ambition; to offer the tools and guidance you need to solve these problems, turning the practice of love into an art. 'How Two Love' is a celebration of our relationships, not as a formula, but as a work in progress, messy and complex and wonderful. With a transparency that refreshes, and a lightness that will leave you smiling, internationally respected author and educator Jan Resnick turns his extensive experience of psychotherapy and couples counselling into a series of charmingly recounted stories from his consulting room. He brings together surprisingly connected themes and lessons learned from a career that spans three continents and four decades. Described as “the book that, now in my sixties, I wish I had read in my twenties”, by psychiatrist and author Richard A. Chefetz, MD, 'How Two Love' doesn’t seek to diagnose or judge. It isn’t a textbook reserved for specialists and professionals. Resnick’s audience is far broader. As Psychoanalytic Psychotherapist and author Nancy McWilliams wrote, 'How Two Love' is for “anyone who has ever been in love, wanted to be in love, lost a love, or suffered for love”. The first offering in his Meaningful Living Book Series, 'How Two Love' is a powerful and transformative guide made for two, a reminder that, in love, every wound, every mistake, and every missed opportunity is an occasion to heal, to grow and to learn. In its pages, Resnick has deftly created a detailed roadmap, revealing how you can avoid the pitfalls that lead to breakdown and emotional injury; while raising the deeper issues of desire, the loving sexuality of a long-term partnership, and, most importantly, what makes love work over time.",
  "genres": [],
  "author": "Jan Resnick",
  "average_rating": "4.46",
  "url": "https://www.goodreads.com/book/show/30353864-how-two-love"
}