{
  "title": "Native: Dispatches from an Israeli-Palestinian Life",
  "description": "Sayed Kashua has been praised by the New York Times as \"a master of subtle nuance in dealing with both Arab and Jewish society.\" An Israeli-Palestinian who lived in Jerusalem for most of his life, Kashua started writing in Hebrew with the hope of creating one story that both Palestinians and Israelis could relate to, rather than two that cannot coexist. He devoted his novels and his satirical weekly column published in Haaretz to exploring the contradictions of modern Israel while also capturing the nuances of family life in all its tenderness and chaos.Over the last decade, Kashua's humorous essays have been among the most widely read columns in Israel. He writes about fatherhood and marriage, the Jewish-Arab conflict, encounters with prejudice, his professional ambitions, and his love of literature. With an intimate tone fueled by deep-seated apprehension and a razor-sharp ironic wit, he has documented his own life as well as that of society at large—from instructing his daughter on when it's appropriate to speak Arabic (everywhere, anytime, except at the entrance to a mall) to navigating security at Ben Gurion airport (in a Citroen that he'd bought especially for checkpoints: \"God in heaven, who ever saw an Arab driving a Citroen?\") to opening a Facebook account during the Arab Spring (so that he wouldn't miss the next revolution).From these events of his everyday life, Kashua brings forth a series of brilliant, caustic, wry, and fearless reflections on social and cultural dynamics as experienced by someone who straddles two societies. Amusing and sincere, Native—a selection of his popular columns—is comprised of unrestrained, profoundly thoughtful personal dispatches.",
  "genres": [
    "Nonfiction",
    "Memoir",
    "Israel",
    "Essays",
    "Politics",
    "Journalism",
    "Biography"
  ],
  "author": "Sayed Kashua",
  "average_rating": "4.01",
  "url": "https://www.goodreads.com/book/show/30358491-native"
}