{
  "title": "Tropical Africa",
  "description": "Rev. Henry Drummond (1851 – 1897) was a Scottish evangelist, writer, traveler, and lecturer who wrote \"Tropical Africa.\"  \"Tropical Africa\" is the most delightfully artistic melange of travel and natural history in Africa that has yet been published. \"Tropical Africa\", by the author of \"Natural Law in the Spiritual World\", tells of his experiences in the course of a journey he took up the Zambesi and Shire to the mission-stations of Scotland, and along the plateau between Tanganyika and Nyassa, and to a certain extent also embodies the experiences of other travellers, and may well become the most popular and beloved work on the subject that has been issued. After the numerous and enormous volumes which have been written upon Africa, it is a genuine treat to find Professor Drummond going to the heart of his subject in a volume of a little over two hundred pages.  As already hinted, this volume is eminently artistic. Whoever has read Natural Law in the Spiritual World knows that its author is a remarkable writer as well as a remarkable thinker. Most African travellers have not been literary artists, and so Professor Drummond has an advantage over them. The word \"charming,\" alike in its proper and in its afternoon-tea sense, is the correct adjective to apply to Tropical Africa.   Professor Drummond has humour, but it also is in danger of losing in fibre. When he was travelling on the Nyassa-Tanganyika plateau, some of his men deserted him. He summoned others (who didn't understand English) who were on the point of doing likewise to his tent:— \"Like the Judge putting on the black cap, I drew my revolver from under my pillow, and laying it before me, proceeded to address them. Beginning with a few general remarks on the weather, I first sketched the geology of Africa, and then broke into an impassioned defence of the British Constitution. The three miserable sinners—they had done nothing in the world—quaked like aspens. I then followed up my advantage by intoning, in a voice of awful solemnity, the enunciation of the forty-seventh proposition of Euclid, and then threw my all into a blood-curdling Quod erat demonstrandum. Scene two followed, when I was alone; I turned on my pillow and wept for shame. \"  What can be a more appropriate criticism on this than, \"How very dreadful of you, Professor Drummond! Was it necessary that you should weep after so very innocuous—and so very elaborate—a practical joke? Should you not have indulged in a hearty laugh?\"  Tropical Africa is quite a multum in parvo. It gives us travel in the chapters on the water-route to the heart of Africa by the Zambesi and Shire (which Professor Drummond prefers, and for good reasons, to the Zanzibar route), the East African Lake country, and wanderings on the Nyassa-Tanganyika plateau; sociology and moral pathology in the chapters on \"The Aspect of the Heart of Africa\" and \"The Heart Disease of Africa;\" science in \"The White Ant,\" \"The Ways of African Insects,\" \"A Geological Sketch,\" and \"A Meteorological Note;\" and politics in \"A Political Warning.\"  The most stirring chapter in Professor Drummond's book is that which treats of the slave-trade, which he calls \"the heart-disease of Africa.\" \"The White Ant\" is perhaps the most fascinating chapter of a fascinating book.  After reading a score or two of books on Africa, one could easily declare that ‘ Tropical Africa ’ supplants them all, and is livelier, brighter and wittier than most of them. The Professor must be a jolly travelling-companion (though he travelled alone, except for black porters), and his pages crackle and sparkle with fun.",
  "genres": [],
  "author": "Henry Drummond",
  "average_rating": "3.40",
  "url": "https://www.goodreads.com/book/show/30362382-tropical-africa"
}