{
  "title": "Immortal Justice",
  "description": "Immortal Executioners Over a millennium ago, Highlander Darach MacRath was murdered. Resurrected by the Archangel Michael to fight demons as an Immortal Executioner, Darach now opposes all evil in the mortal world. His life is solitary—but when he rescues a young woman who not only sees demons but battles them herself, he is captivated by her courage and beauty. Abigail Dupree is not looking for love. But when a tall, dark demon fighter with a sexy brogue intervenes in her hunt, she’s fascinated. She should run away—but then his gentle yet sizzling touch ensnares her heart. When a demon from Darach’s past sets his sights on Abby, Darach will do anything to protect her—but for Abby, losing him would be worse than death. Together they must fight the demons of past and present, and the possibility that evil could destroy them both, before they find the gift of love.  Excerpt: “Ye willna be needing a weapon, I will protect ye.” His statement irritated Abby, but at the same time a part of her was just a tiny bit thrilled. It seemed immortal or not, a man always had the attitude of protecting the little woman—whether they needed it or not. Of course to be fair, he had saved her butt from the demon, but he needed to know she wasn’t some frightened babe in the woods.“I beg to differ. If I’d had a knife I could have done some serious damage, and besides, you can’t protect me twenty-four-seven, Darach.” “Ye will be protected at all times, Abby.” “You’re missing the point. Maybe I don’t need a keeper. I have managed to take care of myself for over…” Abby decided he didn’t really have to know she was over thirty. “And what about when you’re asleep? You do sleep don’t you?” Darach frowned, but answered, “Aye, I do sleep, but ’tis usually during the daylight hours. However now I will be sleeping at night in your bed with ye.”",
  "genres": [
    "Romance",
    "Paranormal"
  ],
  "author": "Faith V. Smith",
  "average_rating": "3.94",
  "url": "https://www.goodreads.com/book/show/11891159-immortal-justice"
}