{
  "title": "Dark Sexy Knight",
  "description": "From New York Times bestselling author Katy Regnery comes another timeless tale of love everlasting!Loosely inspired by the legend of Camelot, Dark Sexy Knight tells the story of dinner theater knight Colt Lane, who meets down-on-her-luck Verity Gwynn on the worst day of her life. Evicted from their home, Verity and her special-needs brother, Ryan, must find jobs or risk being separated. Colt, who is the furthest-possible thing from a white knight in real life, comes to their unlikely rescue, quickly cementing his place in Verity's heart.Colt has dark, deeply buried secrets that keep his smile hidden and his eyes down, which has kept people away . . . until he meets Verity, who seems immune to his gruff manners and taciturn ways. The more time Colt spends with her, the more he longs for her sweetness in his life and yearns to be the knight in shining armor she so desperately needs. Certain he will lose her if she learns the truth about his past, he must decide if he can trust her with his yesterday in order to build a beautiful tomorrow.**Contemporary Romance. Due to profanity, mild violence and very strong sexual content, this book is not intended for readers under the age of 18.**All novels in the ~a modern fairytale~ collection are written as fundraisers.Dark Sexy Knight is part of the ~a modern fairytale~ collection, which includes six standalone, completely unrelated novels inspired by beloved fairy tales:The Vixen and the Vet (Beauty & the Beast) - available nowNever Let You Go (Hansel & Gretel) - available nowGinger's Heart (Little Red Riding Hood) - available nowDark Sexy Knight (Camelot) - available nowDon't Speak (The Little Mermaid) - available 2017Swan Song (The Ugly Duckling) - available 2017.",
  "genres": [
    "Romance",
    "Contemporary Romance",
    "Contemporary",
    "New Adult",
    "Retellings",
    "Audiobook",
    "Disability"
  ],
  "author": "Katy Regnery",
  "average_rating": "4.01",
  "url": "https://www.goodreads.com/book/show/30352053-dark-sexy-knight"
}