{
  "title": "Arica's Inferno",
  "description": "Arica awoke to find herself trapped in Hell marked by the devil. She is horrified to learn Satan intends to sacrifice her to escape the chains that bind him in the bitter ninth ring. While trying to thwart Satan's plans and divert the destruction of creation, Arica is swept off her feet by the most unexpected knight in tarnished armor, Lucifer. Follow Arica and the misunderstood Fallen Angel on their journey, where in the end even the damned deserve to find love.   Caution: This book contains mature content. There are scenes featuring dubious consent, biting, anal sex and other erotic acts. If such content offends you please reconsider.  Arica There were hundreds of people jostling, pushing Arica towards a dimly lit lone boat by a river. The dock looked rickety as hell until she noticed the condition of the pathetic boat. The ferryman was a frightening figure. He wore a cloak that was positively filthy. The dirt was probably the only thing holding the threadbare garment together. All Arica could see of the captain's face was a matted beard that appeared to be writhing with maggots. When the man looked up his hood fell back exposing pointed jackal-like ears, a hooked nose and eyes that shone like jets of fire. Arica trembled before the monstrous man, if he was even a man at all. \"Coin!\" He demanded. The beastly ferryman shoved his oar into the stagnant water and began to push away from the shore. Arica was pretty sure a piteous moan rose up from the water but it was overshadowed by the creaking groan the boat made. The ferryman had a taxi medallion featuring his picture and letters she couldn't read. As Arica stared at it the word transformed to spell Charon. \"OH FUCK! FUCKITY, FUCK, FUCK.\" Something was seriously wrong here! Charon was the ferryman for the dead, transporting damned souls into Hell.  Lucifer It was apparent the more time Lucifer spent with Arica that she didn't truly belong in Hell. Satan was up to something. \"I'm not Satan. Sataniel is an evil prick. Whereas I just disagreed with God about man possessing the knowledge of good and evil. Don't get me wrong I'm not as clean as the driven snow. I can be a nasty bastard, but I don't get off on being evil.\" Lucifer explained to Arica. Sataniel was bound so tight in the ninth ring of the Pit he rarely had opportunity to break free. However every millennia his chains weakened enough for him to make an attempt. Lucifer just had to hold off Armageddon till Sataniel's bonds renewed. Lucifer really hoped he didn't screw all this up. Being in essence the warden of Sheol, the prison of the damned, the fate of the world depended on him. The pressure of it all got pretty intense sometimes. Everyone thought he had it out for mankind, but it was completely the opposite. Lucifer had the greatest hope for man. People had the potential to be excessively cruel, but on the other hand they also had the potential for monumental acts of kindness.",
  "genres": [
    "Paranormal Romance"
  ],
  "author": "Stephanie  West",
  "average_rating": "3.98",
  "url": "https://www.goodreads.com/book/show/30355390-arica-s-inferno"
}