{
  "title": "Feast",
  "description": "The human race hangs by a thread the thickness of a single RC-714. The gene, which unlocks the millennia of genetic traits stored in junk DNA, gives crops the ability to rapidly evolve and thrive in any environment. But RC-714 is passed on when consumed. Any creature—mammal, reptile, fish or insect—that eats the genetically modified crops becomes a slave to the Change. Bodies morph into unrecognizable abominations. Intellect takes a back seat to ravenous hunger. And all the world’s species eat each other toward extinction.Racing against this impending outcome, Peter Crane and his family attempt to reach a laboratory in Boston, where a slim hope of saving the human race from extinction exists. But before heading northeast, they must visit the swamps of South Carolina’s Hellhole Bay to find a scientist who can help undo the damage done by ExoGen, the corporation that created and unleashed RC-714. Upon reaching Hellhole, the family is captured by a man named Mason, who not only survived the Change, but managed to keep a small community alive as well—a community that is subject to his every carnal desire and whim.Trapped in the clutches of a man whose heart is as twisted as the monsters that roam the Earth, Peter, Ella, Jakob, Anne and Alia, must fight for their freedom from a literal hellhole. Danger lurks behind every door, stalks beneath the swampy waters and descends from the sky. As enemies—both human and ExoGenetic—close in, surviving will be harder than ever, and for some, impossible.In 2015, Jeremy Robinson (writing as Jeremiah Knight) introduced another knockout novel into the horror/sci-fi scene with his Top 100 bestselling Hunger. Combining the speculative science of Crichton with the twisted scares of King, Feast continues the story that made Hunger the #1 post-apocalyptic novel.",
  "genres": [
    "Science Fiction",
    "Horror",
    "Apocalyptic",
    "Thriller",
    "Audiobook",
    "Fiction",
    "Action"
  ],
  "author": "Jeremiah Knight",
  "average_rating": "4.23",
  "url": "https://www.goodreads.com/book/show/30359048-feast"
}