{
  "title": "Seasmoke Friends",
  "description": "From bestselling & award-winning author Kelly Moran comes two heartwarming stories of love, friendship, and the ties that bind.Featuring both Seasmoke Friends books Summer's Road and Winter's Path in one set.\"An emotional journey that is very funny, engaging and full of charm. A story that makes you laugh, love and cry. In the course of the story you just might realize some things about yourself.\"~Romancing the Book, Top Review HonorsSummer's RoadAfter her father's death, Summer Quinn is alone in the world. With no family to fill the void, she finds comfort among friends. But her boyfriend wants to take their relationship to the next level, and suddenly there's an unexpected attraction building between her and her best friend, Ian Memmer--a man who's never settled for one woman. And now her estranged mother has reappeared. As secrets from her family's past and Ian's true feelings emerge, she's faced with choices she's not sure she can make. Happiness hinges on forgiveness and opening herself to love, even if it's not where she expected to find it.Winter's PathJenny Winter's life hasn't been all sunshine and roses. As a young girl, she witnessed her mother die of an overdose and now the grandfather who raised her barely recognizes her. Forced to watch his memory slowly fade, she's at an impasse on what to do with his tavern and her life. Her only escape is her music and her best friend, Matt Holcomb. He's always been her support system, but she's also harbored a crush on him for years. And he's never shown signs he reciprocates those feelings. Then a moment changes everything, and she starts to wonder if his carefully constructed control isn't a ruse to hide his own attraction. Yet something happened to him once that won't allow him to engage, and if she wants her ever-after, she just might have to take fate into her own hands. Lovers of M. Robinson's Good Ol Boys series or Corinne Michaels' Salvation series will want to check out Seasmoke Friends!",
  "genres": [],
  "author": "Kelly Moran",
  "average_rating": "4.50",
  "url": "https://www.goodreads.com/book/show/30368194-seasmoke-friends"
}