{
  "title": "صندوق النقد الدولي: قوة عظمى في الساحة العالمية",
  "description": "من الناحية الرسمية، تكمن وظيفة الصندوق الأساسية في العمل على استقرار النظام المالي، وفى مساعدة البلدان المأزومة على تلافي ما تعاني من مشكلات، إنما كل تلك التدخلات تشبه في واقعها غزوات جيوش متحاربة،فهو في تدخلاته ينتهك سيادة هذه الدولة أو تلك، ويجبرها على تنفيذ إجراءات ترفضها الأغلبية العظمى من المواطنين، وتخلّف وراءها مساحة عريضة من خراب اقتصادي واجتماعي.في كل تلك التدخلات، لم يستخدم الصندوق أسلحة وجنودا، بل كان يستعين بوسيلة غاية في البساطة، وبوحدات من آليات النظام الرأسمالي، ونعني بها عمليات التمويل.وبالنظر إلى كونه على مستوى العالم أجمع الملاذ الأخير للتزود بالسيولة، لذا ليس أمام حكومات البلدان المأزومة في الأحوال العامة غير قبول عرض الصندوق، وتنفيذ شروطه، وإن ترتب على ذلك السقوط أكثر فأكثر في فخ مديونية لا فرار منه.وبالنسبة إلى البسطاء من مواطني الدول المعنية ها هنا، نعني الدول المتدنية الدخول أصلا، تترك هذه السياسة في الحالات العامة نتائج وخيمة جدا، فجميع الحكومات في هذه البلدان تتصرف وفق نهج لا اختلاف فيه، إنها تُحمّل الجماهير العاملة وفقراء المواطنين تبعات التقشف المالي.وعلى هذا النحو تسببت برامج صندوق النقد الدولي في خسارة ملايين العمال لفرص عملهم وباتوا محرومين من رعاية صحية فعالة، ونظام تعليمي مناسب، ومسكن يراعي كرامة الإنسان. في المقابل، وإذا ما أمعنا النظر في نتائج هذه البرامج بالنسبة لــ الطرف الآخر من السلم الاجتماعي، فإن الحقيقة التي لا خلاف عليها هي أن سياسة الصندوق جعلت بمستطاع حفنة من الأغنياء؛ يعجز المرء عن وصف رخائهم، أن تراكم ثرواتها بلا انقطاع، حتى في أزمنة الأزمات، إن الإجراءات المدعومة من قبل صندوق النقد الدولي كانت عاملا جوهريا في بلوغ العدالة الاجتماعية في العالم أجمع، مستويات لا مثيل لها في تاريخ البشرية أبدا. لكن كيف كان هذا؟ وبأي وجه يحق لمؤسسة أن تتسبب في تعريض بني البشر لمصائب لا توصف، ورزايا لا نهاية لها، أن تواصل نشاطها بلا عقوبة،وأن تحظى مستقبلا أيضا بمساندة القوى صاحبة السلطان في زمننا هذا؟ ولمصلحة من يا ترى؟ إن الحصول على الجواب الشافي عن كل هذه الأسئلة هو الهدف الذي يسعى هذا الكتاب إلى تحقيقه",
  "genres": [
    "Economics",
    "Politics",
    "History"
  ],
  "author": "Ernst        Wolff",
  "average_rating": "3.99",
  "url": "https://www.goodreads.com/book/show/30364728"
}