{
  "title": "Emancipation Betrayed: The Hidden History Of Black Organizing And White Violence In Florida From Reconstruction To The Bloody Election Of 1920",
  "description": "Throws a powerful light on the struggle of Black Floridians to create the first statewide civil rights movement against Jim Crow.Concentrating on the period between the end of slavery and the election of 1920, Emancipation Betrayed vividly demonstrates that the decades leading up to the historic voter registration drive of 1919-20 were marked by intense battles during which African Americans struck for higher wages, took up arms to prevent lynching, forged independent political alliances, boycotted segregated streetcars, and created a democratic historical memory of the Civil War and Reconstruction.Contrary to previous claims that African Americans made few strides toward building an effective civil rights movement during this period, Ortiz documents how black Floridians formed mutual aid organizations—secret societies, women's clubs, labor unions, and churches—to bolster dignity and survival in the harsh climate of Florida, which had the highest lynching rate of any state in the union. African Americans called on these institutions to build a statewide movement to regain the right to vote after World War I. African American women played a decisive role in the campaign as they mobilized in the months leading up to the passage of the 19th Amendment. The 1920 contest culminated in the bloodiest Election Day in modern American history, when white supremacists and the Ku Klux Klan violently, and with state sanction, prevented African Americans from voting.Ortiz's eloquent interpretation of the many ways that black Floridians fought to expand the meaning of freedom beyond formal equality and his broader consideration of how people resist oppression and create new social movements illuminate a strategic era of U.S. history and reveal how the legacy of legal segregation continues to play out to this day.",
  "genres": [
    "History",
    "Nonfiction",
    "American History",
    "Race",
    "Book Club",
    "Labor",
    "Politics"
  ],
  "author": "Paul Ortiz",
  "average_rating": "4.16",
  "url": "https://www.goodreads.com/book/show/303644.Emancipation_Betrayed"
}