{
  "title": "Lucifer's Angel",
  "description": "Bestselling author R WK Clark delivers a classic occult thriller—with a twist.Sarah Hathaway is the sweetest, kindest person you’d ever hope to meet. Her life is perfect. She has everything she could ever hope for. But when multiple tragedies strike, she turns away from the church, pursuing instead the life of a witch. At the end of the day, witchcraft seems to make her life better. But what’s lurking just behind Sarah?Now that she’s discovered what spells can do, the misfortunes in her life don’t seem all that natural anymore… Will she realize in time for her life to be saved?An unforgettable and terrifying classic of modern American horror from the undisputed master, R WK Clark.Author Commentary‘Lucifer’s Angel’ is a book that tells the tale of a young girl raised in a very religious home. Everything in her life is perfect, and she is completely unprepared for the series of tragedies that take place.For me, the best thing about writing ‘Lucifer’s Angel’ was the freedom I had to add as many twists and surprises as I saw fit. This is an unpredictable book, and I like it that way. But what I have to say is that the nature of this book is the perfect breeding ground for such surprise, and without it, this would not have come anywhere near making the point I intended it to make.First, it is safe to say that we should never dabble in something we know nothing about. Hidden dangers lurk around every last corner in this world, and matters of spirituality are no exception. Whether you are a religious person or not, this is a fact, and Sarah learns this terrifyingly and painfully.Secondly, pain is a part of life. All of us go through doubt about our own beliefs and abilities. Sarah’s doubt happens to run so deep, and her heart is so broken, that she chooses to turn to witchcraft almost strictly out of a sense of revenge toward God. ‘If you won’t give me my way, I’ll find someone who will,’ is essentially her thought process. Of course, she is hurting, but we all do, and no one is exempt. No amount of revenge or fit throwing will change the fact that bad things happen every single day.I also try to convey the fact that it is terribly dangerous to give others too much trust. But we all know too well that everyone is human, and human beings are selfish by nature, not to mention capable of horrible things, no matter what their title or position is. This is especially true if there is something valuable to gain.Yes, once again, I have added surprises. Yes, I have twisted things in all the right places. But as I said above, this type of thing would be the nature of the black arts anyway; don’t be surprised. Unfortunately, Sarah’s anger and decisions are her own worst enemy, and ultimately and sadly, this plays out in her life for you to read.",
  "genres": [],
  "author": "R.W.K. Clark",
  "average_rating": "3.41",
  "url": "https://www.goodreads.com/book/show/30367503-lucifer-s-angel"
}