{
  "title": "Salt Hendon Collection Boxed Set",
  "description": "Because you asked, it's all here…This special edition brings together two of Lucinda’s best-loved books, SALT BRIDE and its sequel SALT REDUX. These books have sold nearly half a million copies and averaged over 4.4 stars from thousands of combined bookseller ratings and reviews worldwide. If you’re new to Lucinda’s books, this is a great introduction to her richly authentic 18th century world.For this boxed set edition, we listened to reader requests and reinstated the original SALT BRIDE prologue. We also included a 20,000-word bonus novella SALT ANGEL an expanded version of the short story FAIRY CHRISTMAS, which was published in A Timeless Romance Silver Bells Collection.Connecting BooksEnjoy Lucinda’s meticulously researched 18th century world, where characters, places, and events all intertwine.Salt Hendon Series 1763 SALT BRIDE (Magnus and Jane) 1767 SALT REDUX (Antony and Caroline) SALT HENDON COLLECTION — boxed set with bonus novellaRoxton Foundation Series August 1745 NOBLE SATYR (Renard and Antonia) October 1746 HIS DUCHESS (Family life in Versailles) November 1746 HER DUKE (Domesticity disrupted) November 1746 THEIR GRACES (Scandal at Court)Roxton Family Saga 1740s NOBLE SATYR (Renard and Antonia) 1760s MIDNIGHT MARRIAGE (Julian and Deb) 1770s AUTUMN DUCHESS (Antonia and Jonathon) 1770s DAIR DEVIL (Dair and Rory) 1770s PROUD MARY (Mary and Christopher) 1780s SATYR’S SON (Henri-Antoine and Lisa) 1743–77 ETERNALLY YOURS (Roxton Letters Vol. 1) 1772-87 FOREVER REMAIN (Roxton Letters Vol. 2)Alec Halsey Mystery Series Spring 1763 DEADLY ENGAGEMENT (Country house murder and mayhem) Autumn 1763 DEADLY AFFAIR (A poisoned vicar and the mysterious Miranda) Winter 1763 DEADLY PERIL (Bloody intrigue abroad) Summer 1764 DEADLY KIN (Murderous family secrets) Winter 1764 DEADLY DIPLOMACY (Lies, levées, and lovers) In progress",
  "genres": [
    "Historical Romance",
    "Audiobook",
    "Romance",
    "Historical Fiction",
    "Historical",
    "Novella",
    "Mystery"
  ],
  "author": "Lucinda Brant",
  "average_rating": "4.36",
  "url": "https://www.goodreads.com/book/show/30371812-salt-hendon-collection-boxed-set"
}