{
  "title": "The Journey of Peter McCall",
  "description": "Blake Crouch's Pines and Wayward, the first two books of the famous Wayward Pines trilogy, tells the story of Secret Service Agent Ethan Burke's arrival in the friendliest town on earth. He's there to investigate the disappearance of two federal agents. The story follows Ethan's investigation which turns up more questions than answers. It also follows his search for the truth, and the uncovering of a deception that is unlike anything the world has ever seen.  Many years before Ethan Burke first appeared on the scene in Wayward Pines, a Montana man named Peter McCall is struggling to find answers to some of those very same questions. Peter flies to L.A. for a business trip in 2001. He meets and seduces a beautiful woman. They engage in a wild tryst filled with alcohol, cocaine and sex in a posh Santa Monica hotel, falling asleep in the wee hours of the morning. When Peter wakes up, he finds that his world has changed forever. He is no longer in Santa Monica. He is in Wayward Pines.  His wallet and credit cards are missing and he has no idea how he got there. One of the first people he meets is Kate Ballinger, one of the missing federal agents Burke would eventually be sent to find. She tells Peter what she knew about Wayward Pines, including the most shocking news of all; that once you arrive, you will never contact anyone you know, you will never leave, and that violation of the town's rules carries dire consequences.  Peter joins Kate Ballinger and a small underground group determined to find a way out of Wayward Pines. After years of surviving torture and brainwashing at the hands of Nurse Pam, Sheriff Arnold Pope and Dr. Jenkins, Peter McCall discovers that Ethan Burke has arrived.  Pines and Wayward detail the early days of Ethan Burke's arrival through Ethan's own eyes, as a newcomer to Wayward Pines. Mark Len Mayfield's The Journey of Peter McCall describes another man's story in Wayward Pines years before Ethan's arrival, and then retells Ethan's early days from Peter's unique perspective as a long time citizen.",
  "genres": [],
  "author": "Mark Len Mayfield",
  "average_rating": "4.27",
  "url": "https://www.goodreads.com/book/show/30365676-the-journey-of-peter-mccall"
}