{
  "title": "Witches Immortal",
  "description": "Witches Immortal is the highly anticipated second book in R WK Clark’s DeSai Trilogy—a unique quest as Rasia sets out to find the elusive vampire.Witches were bestowed with the power to fulfill dreams, but they had a major defect: They were doomed to die. The black witch Rasia Engres has been taught by the writings of her Grandmother Anfisa that if a witch were to sustain a vampire bite she would not only live eternally, but she would have power unsurpassed as well. Enjoy this enthralling masterpiece of mayhem and terror, an unforgettable story filled with relentless wicked enchantment, and the most horrible of secrets.Author Commentary‘Witches Immortal’ is the second installment in my DeSai Trilogy. Essentially, this series is a vampire tale, but in this, book two, the main character, Rasia Engres, is also a witch. The entire point, besides being an entertaining work of fiction, is to find out about the woman in book one on a much more personal level.Rasia is a witch through and through, and she really doesn’t have an ounce of love in her soul. This is something I wanted to make clear in ‘In the Depths’, but even more so here. The most effective way to do that, in my opinion, was to let the readers get to know her. By having an understanding of the many circumstances that made her who she is. Excuses aside, the woman is evil to the core.So, as readers get to know Rasia, they will also get the scoop on Cyril DeSai from a differing perspective of that given in the first book. Now things are all about the woman in his life and how she came to know who and what he was. She is crafty and conniving, and she won’t think twice about causing pain to another for whatever reason. Rasia Engres is also a very beautiful woman; her high intelligence level is simply the icing on the cake.",
  "genres": [
    "Horror"
  ],
  "author": "R.W.K. Clark",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/30367266-witches-immortal"
}