{
  "title": "Free Speech Isn't Free: How 90 Men Stood Up Against The Globalist Establishment – And Won",
  "description": "Free speech may be your right, but unless you fight for it, you'll lose it. That is the message of Free Speech Isn't Free, which chronicles how organizing a lecture tour for masculine men inserted Roosh Valizadeh into an unexpected free speech fight spanning several continents, putting both him and his family in danger from the globalist establishment and their mob of deranged social justice warriors.  After becoming activated by mass-scale media distortions and mayoral denouncements, the SJW mob in Canada rose up against Roosh and his followers to halt his tour. Roosh refused to cancel and set out to hold the lectures in secret. He shares how he fought back against the mob while trying to come to terms with the globalist agenda that they're controlled by. The well-informed men he met throughout the tour were critical in sharing hidden knowledge that put the agenda's puzzle pieces into place.  Even after the lecture, when Roosh tried to conduct happy hour meetings for his followers, a bigger worldwide outrage befell him, leading to the doxing of his family and threats to burn their house to the ground. Free Speech Isn't Free shares that story for the first time in a special epilogue, and what was going through the mind of a man who was the number one target for a 1984-inspired \"two minutes of hate\" that took place worldwide.  How far will you go if the establishment attacks you for what you believe in? Are you ready to defend yourself if they come after your reputation, your job, and your family? Free Speech Isn't Free shows what one man did when powerful groups tried to silence him, along with everything he learned during the most momentous months of his life that will help others be able to identify and defend against attacks within their own lives.  Bonuses included are the transcript of the \"dangerous\" speech that started it all, The State Of Man, and an important new article explaining how to keep yourself safe from social justice attacks.",
  "genres": [],
  "author": "Roosh V.",
  "average_rating": "4.06",
  "url": "https://www.goodreads.com/book/show/30372452-free-speech-isn-t-free"
}