{
  "title": "Relativity, Thermodynamics and Cosmology",
  "description": "This landmark study by a distinguished physicist develops three important a coherent and inclusive account of Einstein’s theory of relativity; the extension of thermodynamics to special and general relativity; and the applications of relativistic mechanics and relativistic thermodynamics in the construction and interpretation of cosmological models.The first three chapters cover the special theory of relativity, in particular the kinematical, mechanical, and electrodynamic consequences of the two postulates of special relativity. Chapter IV develops the close relationships between special relativity and electromagnetic theory, while Chapter V explores less familiar consequences of the theory, including the effect of relativity in providing a natural starting-point for the energy content of thermodynamic systems.Chapter VI considers the general theory of relativity together with some of its more elementary applications. Included are the principle of covariance, the principle of equivalence, and the hypothesis of Mach, along with other topics. Chapter VII, on relativistic mechanics, is divided into two parts — general mechanical principles and solutions of the field equations. Chapter VIII discusses relativistic electrodynamics, presenting further extensions to general relativity both for the Lorentz electron theory and for the Minkowski macroscopic theory.Chapter IX deals with relativistic thermodynamics and considers the extension of thermodynamics from special to general relativity, together with its applications. Finally, in Chapter X, the author takes up the application of relativistic mechanics and relativistic thermodynamics to cosmological models.Among the important features of this study, which set it apart from older texts on relativity, are the extensions of thermodynamics to general relativity, the material on non-static models of the universe, and the treatment of gravitational interaction of light rays and particles.Throughout, stress is on the physical nature of assumptions and conclusions and the physical significance of their interconnection, rather than mathematical generality or rigor. Several helpful appendices complete the book, including formulae for vector and tensor analysis, useful constants, and symbols for quantities.",
  "genres": [
    "Physics",
    "Textbooks",
    "Astronomy",
    "Science"
  ],
  "author": "Richard C. Tolman",
  "average_rating": "3.88",
  "url": "https://www.goodreads.com/book/show/3037275-relativity-thermodynamics-and-cosmology"
}