{
  "title": "Maratón",
  "description": "El origen de la Maratón fue en el año 409 a.C. cuando el soldado griego Filípides recorrió la distancia de 40 kilómetros desde Maratón hasta Atenas para anunciar la victoria sobre el ejército persa. Posteriormente, la Maratón formó parte de las competencias de los Juegos Olímpicos en Grecia en 1896. Con el tiempo la distancia oficial fue de 42 Km 195 m.La Maratón es el equivalente a esfuerzo, disciplina y gloria, sobre todo al cruzar la meta.La Maratón es vencerse a sí mismo.La novela trata acerca de una deportista, llamada Sami, quien, con 37 años y después de sufrir varias caídas en su vida, como la obesidad y el alcoholismo, producto de las secuelas que dejó el divorcio, se entrena para participar por primera vez en la Maratón de una ciudad llamada “Lorena la Bella”, ciudad mítica que emerge del mar cada vez que se efectúa este evento y en donde los corredores pueden escuchar, si se da el momento y la suerte, la voz de Neil Armstrong cantando su famosa “What a wonderful world”, ya que fue éste cantante quien estuvo presente en la primera edición de esta competencia.Bajo este argumento aparentemente sencillo (el de correr una Maratón) se dibuja todo un mundo interno. Sami, a través de culminar una Maratón, tratará de rehacerse a sí misma. La novela no cuenta con capítulos, sino que se desarrolla en kilómetros. A través de los mismos se alternan dos secuencias. lo que acontece en la Maratón el ambiente, la emoción, el desgaste físico, los puntos de agua, la lucha de otros competidores, los que se van quedando en el camino, los desconocidos que aparecen de repente para dar ánimo, los líderes de la carrera y los problemas que tiene Sami para seguir, su dolor en la pantorrilla, el ingreso al mítico kilómetro 35, denominado \"el muro\", su caída en el asfalto, etc. los recuerdos de Sami, la maratonista. El recorrido mental de su vida. Por un lado, los aspectos los detalles del fracaso de su vida amorosa, su alcoholismo y obesidad, ambos superados con esfuerzo, su lucha por seguir adelante. Por otro, los positivos, las evocaciones que la impulsan a no renunciar, sus motivaciones (la historia de su padre -entrenador de caballos-, sus consejos, los momentos con la mejor amiga de la infancia, y las proezas, triunfos y derrotas de un caballo de carreras denominado \"Niño Lindo\", que aparece en la obra como un ángel de la guarda que la empuja a seguir, a no rendirse).Finalmente, la novela Maratón, trata de la historia de los héroes de las maratones. Abebe Bikila, Stocker, Sporidon, Zatopek, Kathy Switzer, Gabriela Anderson, entre otros. Sami, no busca el pódium en esta Maratón de \"Lorena la Bella\" sino llegar a la meta. A su meta personal porque allí radica el verdadero triunfo.(La obra obtuvo en el año el Premio Nacional de Literatura Aurelio Espinosa Pólit, de la Pontificia Universidad Católica del Ecuador en el año 2009. El jurado estuvo integrado por los escritores Alicia Ortega Caicedo, Francisco Proaño Arandi y Carlos Aulestia y señaló en su decisió \"Se trata de una novela de original temática, con un ritmo narrativo ágil que se sostiene hasta el final y un lenguaje muy cuidado, que se corresponde con la historia narrada\".",
  "genres": [],
  "author": "Hans Behr Martínez",
  "average_rating": "3.67",
  "url": "https://www.goodreads.com/book/show/30364952-marat-n"
}