{
  "title": "The History of Rome: The Republic",
  "description": "THE ROMAN EMPIRE STANDS as the greatest political achievement in the history of Western civilization. From its humble beginnings as a tiny kingdom in central Italy, Rome grew to envelope the entire Mediterranean until it ruled an empire that stretched from the Atlantic to Syria and from the Sahara to Scotland. Its enduring legacy continues to define the modern world. Mike Duncan chronicled the rise, triumph, and fall of the Roman Empire in his popular podcast series \"The History of Rome\". Transcripts of the show have been edited and collected here for the first time. Covering episodes 1-46, The History of Rome Volume I opens with the founding of the Roman Kingdom and ends with the breakdown of the Roman Republic. Along the way Rome will steadily grow from local power to regional power to global power. The Romans will triumph over their greatest foreign rivals and then nearly destroy themselves in a series of destructive civil wars. This is the story of the rise of Rome.  Mike Duncan is one of the foremost history podcasters in the world. His award winning series \"The History of Rome\" chronologically narrated the entire history of the Roman Empire over 189 weekly episodes. Running from 2007-2012, \"The History of Rome\" has generated more than 65 million downloads and remains one of the most popular history podcasts on the internet. The enduring popularity of \"The History of Rome\" earned it aniTunes Best of 2015 award and forms the basis for his forthcoming book “The Storm Before The Storm: The Beginning of the End of the Roman Republic” (Public Affairs Press). Duncan has continued this success with his ongoing series \"Revolutions\" — which so far has explored the English, American, French, and Haitian Revolutions. Since debuting in September 2013, \"Revolutions\" has generated more than 18 million downloads. Thanks to the worldwide popularity of his podcasts, Duncan has led fans on a number of sold-out guided tours of Italy, England and France to visit historic sites from Ancient Rome to the French Revolution. Duncan also collaborates with illustrator Jason Novak on informative cartoons that humorously explain the historical context for current events. Their work has been featured in The New Yorker, The Paris Review, The Awl, and The Morning News. He lives in Madison, Wisconsin.",
  "genres": [
    "History",
    "Nonfiction",
    "Ancient History",
    "Audiobook",
    "Historical",
    "Politics",
    "War"
  ],
  "author": "Mike     Duncan",
  "average_rating": "4.59",
  "url": "https://www.goodreads.com/book/show/30370669-the-history-of-rome"
}