{
  "title": "Chancers: Addiction, Prison, Recovery, Love: One Couple's Memoir",
  "description": "In this powerful memoir of addiction, prison, and recovery, a reporter and a photographer tell their gripping story of falling in love, the heroin habit that drove them apart, and the unlikely way a criminal conviction brought them back together.Books for a Better Life Award Finalist • LitHub Best Book of the Month When Susan Stellin asked Graham MacIndoe to shoot her author photo for an upcoming travel book, she barely knew him except for a few weekends with mutual friends at a summer house in Montauk. He was a gregarious, divorced Scotsman who had recently gotten sober; she was an independent New Yorker who decided to take a chance on a rough-around-the-edges guy. But their relationship was soon tested when Susan discovered that Graham still had a drug habit he was hiding. From their harrowing portrayal of the ravages of addiction to the stunning chain of events that led to Graham’s arrest and imprisonment at Rikers Island, Chancers unfolds in alternating chapters that offer two perspectives on a relationship that ultimately endures against long odds. Susan follows Graham down the rabbit hole of the American criminal justice system, determined to keep him from becoming another casualty of the war on drugs. Graham gives a stark, riveting description of his slide from brownstone Brooklyn to a prison cell, his gut-wrenching efforts to get clean, and his fight to avoid getting exiled far away from his son and the life he built over twenty years. Beautifully written, brutally honest, yet filled with suspense and hope, Chancers will resonate with anyone who has been touched by the heartache of addiction, the nightmare of incarceration, or the tough choice of leaving or staying with someone who is struggling on the road to recovery. By sharing their story, Susan and Graham show the value of talking about topics many of us are too scared to address.Praise for Chancers“Stellin and MacIndoe, in entries sometimes akin to fighters in the ring, tell the story of their lives as MacIndoe rides a roller-coaster life of drug addiction and prison. . . . [Chancers] grabs in a voyeuristic way and propels page-turning to find out what happens next in a saga no soap opera could create.”—The Buffalo News “Emotionally resonant and evenly structured, their tandem chronicle resists overly romanticizing their bittersweet interactions to focus on the dedication and devotion necessary to make their already-complicated relationship survive the fallout of critical hardships. An emotionally complex and intensely personal binary memoir of addiction and sustainable love.”—Kirkus Reviews",
  "genres": [
    "Memoir",
    "Nonfiction",
    "Autobiography",
    "Biography",
    "Literary Fiction"
  ],
  "author": "Susan Stellin",
  "average_rating": "3.88",
  "url": "https://www.goodreads.com/book/show/30367021-chancers"
}