{
  "title": "Discovery Illustrated: Pictures from Captain Scott's First Antarctic Expedition",
  "description": "Illustrated by polar explorer Edward Wilson, this work from Reardon Publishing featured over 400 pictures from one of the great Antarctic expeditions, as led by Captain Scott. All royalties are to be donated to support the work of the Scott Polar Research Institute.Discovery Illustrated is the story - primarily in pictures - of the Royal Research Ship 'Discovery' and the British National Antarctic Expedition in 1901-1904. 'Discovery' was built specifically for Antarctic journeying and captained by the young Commander Scott; this was the first major scientific exploration of the Antarctic continent. There are literally hundreds of photographs here, taking by several expedition members - mostly by Reginald Skelton, the Chief Engineer but also including Ernest Shackleton - and amazing paintings by Edward Wilson, alongside many drawings and other illustrations.There is enough in the way of historical background and maps to follow the journey but the story is really told through the journal entries of Skelton and Wilson. Their contrasting styles makes for fascinating reading - Skelton blowing off steam in a private diary whilst Wilson describes things for the benefit of the new wife he has left behind. Skelton the old sea-dog barely mentions the crossing of the Equator whilst Wilson, never having left Europe before, is initiated by King Neptune.Once they reach the Antarctic, there are pictures of all they see as they explore along the Great Ice Barrier, take the first Antarctic balloon trip (remember, this is before the Wright Brothers!), and set up their winter quarters. They travel on long sledge journeys: Scott, Wilson and Shackleton traveling to over 82 degrees south, a new Furthest South; whilst Skelton joins a geologising journey to the new mountain ranges. There is also scientific work done throughout, learning about the weather, describing the animals, measuring gravity and seeking the South Magnetic Pole. In between, life on the ship is described, Shackleton editing the South Polar Times through the winter and all the crew participating in theatre and playing games on the ice.The quality of the photographs is amazing - many look as if they were taken yesterday - and cover the spread from the first ever photograph taken of an Emperor Penguin chick to pictures of the land discovered to snaps of the sledge dogs' puppies and of sailors in costume for their theatricals. The line drawings vary from brief sketches to extracts from the scientific reports. Wilson's paintings are fabulous - from close-ups of an open-mouthed Albatross to other-worldly landscapes. The whole book is in date order, from the laying down of the ship's hull to their triumphant return to England, combining journal entries with photographs and paintings often on the same page. This gives the volume something of a 'scrap book' feel, a flavour of the excitement and adventure of scientific and geographical discovery. There is a final chapter which offers an assessment of the results and heritage of the expedition - and a reminder that you can visit the ship itself even now, a hundred years later, back in the Scottish city where it was built.This book is a great 'coffee table' book and a good introduction to a largely forgotten Antarctic expedition",
  "genres": [],
  "author": "David M.  Wilson",
  "average_rating": "4.21",
  "url": "https://www.goodreads.com/book/show/1189387.Discovery_Illustrated"
}