{
  "title": "Cosmology and Controversy",
  "description": "For over three millennia, most people could understand the universe only in terms of myth, religion, and philosophy. Between 1920 and 1970, cosmology transformed into a branch of physics. With this remarkably rapid change came a theory that would finally lend empirical support to many long-held beliefs about the origins and development of the entire the theory of the big bang. In this book, Helge Kragh presents the development of scientific cosmology for the first time as a historical event, one that embroiled many famous scientists in a controversy over the very notion of an evolving universe with a beginning in time. In rich detail he examines how the big-bang theory drew inspiration from and eventually triumphed over rival views, mainly the steady-state theory and its concept of a stationary universe of infinite age.In the 1920s, Alexander Friedmann and Georges Lemaître showed that Einstein's general relativity equations possessed solutions for a universe expanding in time. Kragh follows the story from here, showing how the big-bang theory evolved, from Edwin Hubble's observation that most galaxies are receding from us, to the discovery of the cosmic microwave background radiation. Sir Fred Hoyle proposed instead the steady-state theory, a model of dynamic equilibrium involving the continuous creation of matter throughout the universe. Although today it is generally accepted that the universe started some ten billion years ago in a big bang, many readers may not fully realize that this standard view owed much of its formation to the steady-state theory. By exploring the similarities and tensions between the theories, Kragh provides the reader with indispensable background for understanding much of today's commentary about our universe.",
  "genres": [
    "Science",
    "Physics",
    "Nonfiction",
    "History",
    "Astronomy",
    "History Of Science",
    "Popular Science"
  ],
  "author": "Helge Kragh",
  "average_rating": "3.96",
  "url": "https://www.goodreads.com/book/show/3037346-cosmology-and-controversy"
}