{
  "title": "The Bitter Road to Freedom: A New History of the Liberation of Europe",
  "description": "Americans are justly proud of the role their country played in liberating Europe from Nazi tyranny. For many years, we have celebrated the courage of Allied soldiers, sailors, and aircrews who defeated Hitler's regime and restored freedom to the continent. But in recounting the heroism of the \"greatest generation,\" Americans often overlook the wartime experiences of European people themselves -- the very people for whom the war was fought. In this brilliant new book, historian William I. Hitchcock surveys the European continent from D-Day to the final battles of the war and the first few months of the peace. Based on exhaustive research in five nations and dozens of archives, Hitchcock's groundbreaking account shows that the liberation of Europe was both a military triumph and a human tragedy of epic proportions.Hitchcock gives voice to those who were on the receiving end of liberation, moving them from the edge of the story to the center. From France to Poland to Germany, from concentration-camp internees to refugees, farmers to shopkeepers, husbands and wives to children, the experience of liberation was often difficult and dangerous. Their gratitude was mixed with guilt or resentment. Their lives were difficult to reassemble.This strikingly original, multinational history of liberation brings to light the interactions of soldiers and civilians, the experiences of noncombatants, and the trauma of displacement and loss amid unprecedented destruction. This book recounts a surprising story, often jarring and uncomfortable, and one that has never been told with such richness and depth.Ranging from the ferocious battle for Normandy (where as many French civilians died on D-Day as U.S. servicemen) to the plains of Poland, from the icy ravines of the Ardennes to the shattered cities and refugee camps of occupied Germany, \"The Bitter Road to Freedom\" depicts in searing detail the shocking price that Europeans paid for their freedom.Today, with American soldiers once again waging wars of liberation in faraway lands, this book serves as a timely and sharp reminder of the terrible human toll exacted by even the most righteous of wars.",
  "genres": [
    "History",
    "Nonfiction",
    "World War II",
    "War",
    "European History",
    "Military History",
    "Germany"
  ],
  "author": "William I. Hitchcock",
  "average_rating": "3.90",
  "url": "https://www.goodreads.com/book/show/3038079-the-bitter-road-to-freedom"
}