{
  "title": "Thursday's Child: A Novel",
  "description": "With forty-four New York Times bestselling novels to her credit, Sandra Brown is one of romance’s best-loved authors. She has been hailed by Rendezvous magazine as an author whose “larger than life heroes and heroines make you believe all the warm, wonderful, wild things in life.”Sexy, funny, and wonderfully romantic, here is the unforgettably sensuous story of a woman too smart to fall in love — and the man determined to prove her wrong.Thursday’s ChildAllison Leamon knew that pretending to be her identical twin sister was a bad idea. For although the two redheads looked exactly alike, they couldn’t be more different. How could a no-nonsense scientist like Allison possibly fool anyone into thinking that she was the bubbly, vivacious Annie?Trading her sensible shoes for strappy sandals, her eyeglasses for contacts, and her lab smock for a chiffon dress, Allison was determined to try her best. Her first challenge was a dinner date with Annie’s fiancé, Davis. But what Allison didn’t expect was the presence of Davis’s best friend.Allison was far too logical to believe in love at first sight, but there was nothing logical about the way she was responding to Spencer Raft. The dark-haired, blue-eyed mystery man had an assurance that Allison found positively maddening.And by the end of the evening, she couldn’t help feeling that Spencer had been attracted to a carefully constructed illusion. She was certain that the handsome adventurer wouldn’t give her a second look if he knew her as she really was.But Spencer Raft was a man of many talents — and seeing below the surface of things was one of them. He sensed the flesh-and-blood woman beneath the elaborate charade, and after years of wandering the world in search of excitement, he knew he had finally found what he had been looking for.But first this incurable romantic had to convince an intractable skeptic that there was more to love than what she could study in a laboratory. And what better way than to propose a passionate experiment of his own?On board his yacht, Spencer and Allison would fulfill their wildest fantasies and deepest desires; but when their blissful idyll was over, would it all prove to be no more than a pleasant interlude — or the real thing?",
  "genres": [
    "Romance",
    "Contemporary Romance",
    "Contemporary",
    "Fiction",
    "Chick Lit",
    "Mystery",
    "Drama"
  ],
  "author": "Sandra       Brown",
  "average_rating": "3.63",
  "url": "https://www.goodreads.com/book/show/30389.Thursday_s_Child"
}