{
  "title": "Slaves of Dark Haven 2: Sharon Loring adjusts to life in Dark Haven Finishing School for Young Ladies, a strange reformatory where the cane and the strap rule supreme. BDSM Erotic Fiction.",
  "description": "‘Welcome to Dark Haven Finishing School for Young Ladies’, read the old sign. Beneath the inscription, presented like a rather frightening crest, was a hand-painted picture of a riding crop and a school cane, crossed like a pair of fencing swords.  Sharon Loring soon discovers that nothing in Dark Haven is as it first seems.  From the book:  She carried the box to the bed, a fluttering feeling in her tummy, and opened it. To her surprise, it contained very little; just a pair of white high heeled strappy sandals, a pair of stay-up stockings of similar colour, and a folded note.  ‘Sharon, Along with the sandals and stockings supplied, you will wear a white bra and white panties from the collection in the wardrobe. Nothing else is to be worn. You will make your way via last night’s route to the base of the main staircase, where you will be collected at exactly 10 a.m. Be punctual.  Headmistress Meriman.’  Sharon frowned. Just underwear, she thought. This was going to be pretty discomforting. Nonetheless, she followed the directions to the letter, and at nine forty-five she was standing exactly where she had been instructed to. The minutes dragged by, as, all the while, Sharon’s apprehensions grew. By the time the clock pealed, she was in a state of barely suppressed panic. On the tenth chime, she heard the door above opening, and the sound of footsteps. Ann-Marie Rabbitte descended, smiling broadly. Her outfit today was in stark contrast to her pink and girly attire of the previous evening, and Sharon’s eyes widened in wonder. Black, thigh-length, latex boots—zipped at the back—created the base upon which this personification of dominance walked. The belted mini-dress of the same colour and material was short and figure-hugging; the top half doubling as a breast-raising corset that emphasized the girl’s ample curves to the maximum. Around her neck, she wore a black silk choker, a silver letter ‘R’ adorning its front. Matching fingerless gloves completed the outfit perfectly. In her hand, she carried a long riding crop. “Like it?” she grinned, a sadistic look in her eyes. “Just arrived this morning. Got it online.” She swished it in front of the wide-eyed girl. It cut the air with a whistle, and Sharon could only fearfully guess at what a stroke from an item like that would feel like. She hoped she would never have to find out.   Welcome to Dark Haven … where nothing is as it first seems.  This is Book 2 of the ‘Dark Haven Series’ These tales are intended for mature readers only (18+) as they contain themes of a sexual nature. You have been warned!",
  "genres": [],
  "author": "Marian Wilder",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/30373150-slaves-of-dark-haven-2"
}