{
  "title": "Inventing Ireland: The Literature of the Modern Nation",
  "description": "Just as Ireland has produced many brilliant writers in the past century, so these writers have produced a new Ireland. In a book unprecedented in its scope and approach, Declan Kiberd offers a vivid account of the personalities and texts, English and Irish alike, that reinvented the country after centuries of colonialism. The result is a major literary history of modern Ireland, combining detailed and daring interpretations of literary masterpieces with assessments of the wider role of language, sport, clothing, politics, and philosophy in the Irish revival.In dazzling comparisons with the experience of other postcolonial peoples, the author makes many overdue connections. Rejecting the notion that artists such as Wilde, Shaw, Yeats, Joyce, and Beckett became modern to the extent that they made themselves \"European,\" he contends that the Irish experience was a dramatic instance of experimental modernity and shows how the country's artists blazed a trail that led directly to the magic realism of a García Márquez or a Rushdie. Along the way, he reveals the vital importance of Protestant values and the immense contributions of women to the enterprise. Kiberd's analysis of the culture is interwoven with sketches of the political background, bringing the course of modern Irish literature into sharp relief against a tragic history of conflict, stagnation, and change.Inventing Ireland restores to the Irish past a sense of openness that it once had and that has since been obscured by narrow-gauge nationalists and their polemical revisionist critics. In closing, Kiberd outlines an agenda for Irish Studies in the next century and detects the signs of a second renaissance in the work of a new generation of authors and playwrights, from Brian Friel to the younger Dublin writers.",
  "genres": [
    "Ireland",
    "History",
    "Nonfiction",
    "Literary Criticism",
    "Irish Literature",
    "Literature",
    "Academic"
  ],
  "author": "Declan Kiberd",
  "average_rating": "4.29",
  "url": "https://www.goodreads.com/book/show/303782.Inventing_Ireland"
}