{
  "title": "Ethan Allen: Frontier Rebel",
  "description": "Controversial then and now, the powerful, brawling, tempestuous Ethan Allen is generally conceded to have played a dominant role in the affairs of early Vermont and the American Republic. Allen was a man of many parts who, whether fighting the British, frustrating the Yorkers, or exploring the mysteries of God, and the Universe, invariably gave a good account of himself. This lively biography, based on sound but unobtrusive scholarship, examines and assesses that many-faceted career. Under Allen’s belligerent leadership the farmers of the New Hampshire Grants formed a militant guerilla band in 1770 known as the Green Mountain Boys to protect their holdings in lands that were the subject of disputes between New York and New Hampshire. Upon the outbreak of the American Revolution, the farmer-fighters turned with enthusiasm against the British. Under the official command of Benedict Arnold, but actually obeying only their boisterous leader, Allen, the little band took Fort Ticonderoga in a bold engagement. Allen’s unwise and unlucky attack on Montreal resulted in his capture by the British. Finally released three years later, he was commissioned a brevet Colonel by the Continental Congress. Professor Jellison examines with particular care Ethan Allen’s political activities following his return home, especially his “treasonous” dealings with the British, his vigorous support of the new self-declared Republic of Vermont, and his role in the continuing rivalries—into which Massachusetts and Connecticut had entered—over the New Hampshire Grants. After the close of the Revolution, Allen retired to his lands in Burlington to farm and to write. True to character even in his career s author, Allen produced a book that was the subject of many hot Reason the Only Oracle of Man , later called “Allen’s Bible.” Allen’s Life ended in 1789, but his legend continues to this day. The book contains a two-page map, extensive bibliographical notes for each chapter, and a complete index.",
  "genres": [],
  "author": "Charles Albert Jellison",
  "average_rating": "3.63",
  "url": "https://www.goodreads.com/book/show/3037514-ethan-allen"
}