{
  "title": "Collected Poems of Emily Dickinson",
  "description": "The Collected Poems of Emily Dickinson, by Emily Dickinson, is part of the Barnes & Noble Classics series, which offers quality editions at affordable prices to the student and the general reader, including new scholarship, thoughtful design, and pages of carefully crafted extras. Here are some of the remarkable features of Barnes & Noble Classics:New introductions commissioned from today's top writers and scholarsBiographies of the authorsChronologies of contemporary historical, biographical, and cultural eventsFootnotes and endnotesSelective discussions of imitations, parodies, poems, books, plays, paintings, operas, statuary, and films inspired by the workComments by other famous authorsStudy questions to challenge the reader's viewpoints and expectationsBibliographies for further readingIndices & Glossaries, when appropriateAll editions are beautifully designed and are printed to superior specifications; some include illustrations of historical interest. Barnes & Noble Classics pulls together a constellation of influences—biographical, historical, and literary—to enrich each reader's understanding of these enduring works. Born in Amherst, Massachusetts in 1830, Dickinson began life as an energetic, outgoing young woman who excelled as a student. However, in her mid-twenties she began to grow reclusive, and eventually she rarely descended from her room in her father’s house. She spent most of her time working on her poetry, largely without encouragement or real interest from her family and peers, and died at age fifty-five. Only a handful of her 1,775 poems had been published during her lifetime. When her poems finally appeared after her death, readers immediately recognized an artist whose immense depth and stylistic complexities would one day make her the most widely recognized female poet to write in the English language.Dickinson’s poetry is remarkable for its tightly controlled emotional and intellectual energy. The longest poem covers less than two pages. Yet in theme and tone her writing reaches for the sublime as it charts the landscape of the human soul. A true innovator, Dickinson experimented freely with conventional rhythm and meter, and often used dashes, off rhymes, and unusual metaphors—techniques that strongly influenced modern poetry. Dickinson’s idiosyncratic style, along with her deep resonance of thought and her observations about life and death, love and nature, and solitude and society, have firmly established her as one of America’s true poetic geniuses.Includes an index of first lines.",
  "genres": [
    "Poetry",
    "Classics",
    "Fiction",
    "Literature",
    "American",
    "19th Century",
    "Feminism"
  ],
  "author": "Emily Dickinson",
  "average_rating": "4.23",
  "url": "https://www.goodreads.com/book/show/303866.Collected_Poems_of_Emily_Dickinson"
}