{
  "title": "Play Dirty",
  "description": "#1 New York Times bestselling author Sandra Brown is back with a gripping story of obsession and its deadly consequences.  After five long years in federal prison, Griff Burkett is a free man. But the disgraced Cowboys quarterback can never return to life as he knew it before he was caught cheating. In a place where football is practically a religion, Griff committed a cardinal sin, and no one is forgiving.  Foster Speakman, owner and CEO of SunSouth Airlines, and his wife, Laura, are a golden couple. Successful and wealthy, they lived a charmed life before fate cruelly intervened and denied them the one thing they wanted most -- a child. It's said that money can't buy everything. But it can buy a disgraced football player fresh out of prison and out of prospects.  The job Griff agrees to do for the Speakmans demands secrecy. But he soon finds himself once again in the spotlight of suspicion. An unsolved murder comes back to haunt him in the form of his nemesis, Stanley Rodarte, who has made Griff's destruction his life's mission. While safeguarding his new enterprise, Griff must also protect those around him, especially Laura Speakman, from Rodarte's ruthlessness. Griff stands to gain the highest payoff he could ever imagine, but cashing in on it will require him to forfeit his only chance for redemption...and love.  Griff is now playing a high-stakes game, and at the final whistle, one player will be dead.  Play Dirty is Sandra Brown's wildest ride yet, with hairpin turns of plot all along the way. The clock is ticking down on a fallen football star, who lost everything because of the way he played the game. Now his future -- his life -- hinges on one last play.",
  "genres": [
    "Romance",
    "Romantic Suspense",
    "Suspense",
    "Mystery",
    "Fiction",
    "Thriller",
    "Contemporary"
  ],
  "author": "Sandra       Brown",
  "average_rating": "4.06",
  "url": "https://www.goodreads.com/book/show/30403.Play_Dirty"
}