{
  "title": "The Embassy: A Story of War and Diplomacy",
  "description": "In a distant war, in a city under siege, U.S. Ambassador John W. Blaney faced a terrible choice: abandon the mission or risk the lives of his team to give diplomacy a last chance...In 2003, Liberia was one of the most dangerous and isolated countries in the world. President Charles Taylor, a feared warlord, presided over a fractured state and countless unruly militiamen and child soldiers as two rebel armies marched to depose him. When an international court indicted Taylor for war crimes, the rebels attacked the capital and months of vicious fighting ensued.With Washington split on how to respond and pressure mounting to shutter the chancery once and for all, the Ambassador kept the flag flying. The U.S. embassy served as a rallying point for international efforts to save Liberia. West African peacekeepers backed by U.S. forces prepared to deploy, but a final, merciless attack by the rebels left the capital split and Taylor's forces dug in for a last, blood-soaked stand. With no margin for error, the Ambassador and his team made three forays across the front lines in a desperate bid to broker a local ceasefire that would lift the siege, stop the killing, and give space for peace to take root.The Embassy is a graphic, cinematic retelling of the harrowing climax of the Liberian civil war and the U.S. and West African role in ending it. Through interviews with the Ambassador and key members of the country team, as well as with peacekeepers, U.S. troops, relief workers, foreign correspondents, senior Liberian officials and rebel leaders, Dante Paradiso reconstructs the violence and chaos of those times to create an enduring portrait of a U.S. embassy under fire and the kind of daring frontline diplomacy that can change the fate of a nation.The views expressed in this book are the author's own and not necessarily those of the United States Department of State or the United States Government.",
  "genres": [
    "Africa",
    "Nonfiction",
    "History"
  ],
  "author": "Dante Paradiso",
  "average_rating": "4.25",
  "url": "https://www.goodreads.com/book/show/30423097-the-embassy"
}