{
  "title": "Queen Zixi of Ix: or the Story of the Magic Cloak",
  "description": "When the renowned author of the wonderful Oz stories surpasses himself with a full-blown fairy tale, complete with magic wishes, palace life, an evil hag, and a poor boy and girl, we know we are in for something exceptional in storytelling. \"In some ways,\" Baum confided to his son, \" Queen Zixi is my best effort.\" The critic Edward Wagenknecht goes further, terming it flatly one of the best fairy tales ever written by anyone.The master tale-spinner captures suspenseful attention at once with a magic wishing cloak which the fairies decide to give to the first unhappy mortal — man, woman, or child — their emissary chance to meet. At the same time, the King of Noland has died without heir, and the law says the new King shall be the forty-seventh person who happens to pass through the city gates that day. In the neighboring kingdom of Ix, malevolent Queen Zixi, six hundred and eighty-three years old and smug in the secrets of witchcraft, craves that magic cloak with all her evil heart. And that morning, a humble ferryman's son, Bud, happens to be on his way to the city with his pretty sister Fluff …All who know the enchantment that a real fairy tale can hold for a child will recognize here the ingredients of a spellbinder. Add to them the well-known gifts of the author in creating captivating characters, sparkling fantasy, rich humor, and inventive absurdity, and a true classic of juvenile literature emerges to fascinate both child and parent. An added delight is the inclusion of all 90 of the original illustrations by Frederick Richardson, straight from the pages of St. Nicholas Magazine , where this tale was originally serialized.",
  "genres": [
    "Fantasy",
    "Childrens",
    "Fiction",
    "Classics",
    "Young Adult",
    "Middle Grade",
    "Fairy Tales"
  ],
  "author": "L. Frank Baum",
  "average_rating": "3.89",
  "url": "https://www.goodreads.com/book/show/1189939.Queen_Zixi_of_Ix"
}