{
  "title": "Shut Up!: The Bizarre War that One Public Library Waged Against the First Amendment",
  "description": "What bad things could possibly be happening in your local public library? In SHUT UP! The Bizarre War that One Public Library Waged Against the First Amendment, citizen sleuths Megan Fox and Kevin DuJan expose the pattern of censorship, intimidation, harassment, bullying, and retaliation that the Orland Park Public Library engaged in (with help from the American Library Association (ALA), the Orland Park Police, and the Village of Orland Park) to chill free speech, trample civil rights, destroy a safe space, stifle debate, and frighten away critics. This one wayward public library in the affluent Chicago suburbs had for years willfully covered up dangers to children and unreported crimes...and its staff and library board trustees used every dirty trick they could think of (including weaponizing the police and engaging in lawfare with a SLAPP suit) to silence parents and patrons who complained about sexual activity, a hostile work environment, and rampant spending waste in a spare-no-expense public building with all the bells and whistles (but little accountability for public employees who blatantly ignored Illinois state library and transparency laws). The library committed itself to shutting up Fox & DuJan at all costs, in what became a war of proxy between the lobbyists of the ALA's Office for Intellectual Freedom and the rights of citizens to petition government bodies for change and redress of grievances. A public library that insisted men have a First Amendment right to sexually arouse themselves in a building full of children became obsessed with eradicating the public's First Amendment right to address and correct dangers to children in the one place that everyone always assumed was safe for kids: the local public library. This is the story of how a suburban Chicago scandal became so outrageous that it made national headlines (and even ended up on Saturday Night Live).",
  "genres": [],
  "author": "Megan  Fox",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/30415965-shut-up"
}