{
  "title": "DONE! How to Stop Your Anxiety Now and Start Living Your Life",
  "description": "Why not stop worrying and get rid of your anxiety now? Life is too precious, so start living your life to the full. And yes, it can be DONE! Stop your panic attacks, and end excessive worries today.Pieter Frijters offers MindTuning®, an innovative technique that delivers an amazingly effective and fast solution for overcoming irrational fears and anxieties. Rather than relying on medications or spurious and expensive methods, this Dutch top trainer shows that you can do it yourself. By using your own initiative and willpower you can achieve the liberating results you seek and radically improve your quality of life.Through MindTuning, Frijters has overcome not only his own anxieties and burnout, but has coached countless others to develop the skills required to recognize and rid themselves of the sensory and physical blockages that create irrational fears and phobias. The technique is not difficult to learn; you will be amazed by the instant and lasting results.One of his clients: “This is the first time I was relaxed during a presentation. No trembling legs, clammy hands, pounding heart, or heavy breathing. Simply wonderful!\"You are guided through the revolutionary visual method with a series of actions to 'retune’ your mind - it will transform your life.With numerous exercises and ideas, real-life examples and practical information, this how-to practical guide offers proven steps for anyone who wants to be released from their fears such as:agoraphobiasocial anxietyclaustrophobiaarachnophobiahypochondriaPieter Frijters is an experienced coach with years of practice perfecting the MindTuning® method. He is one of Holland’s top trainers with extensive experience in delivering workshops on the topic of anxiety relief.",
  "genres": [],
  "author": "Pieter Frijters",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/30412767-done-how-to-stop-your-anxiety-now-and-start-living-your-life"
}