{
  "title": "Old Gods Almost Dead: The 40-Year Odyssey of the Rolling Stones",
  "description": "The acclaimed, bestselling rock-and-roll biographer delivers the first complete, unexpurgated history of the world’s greatest band.The saga of the Rolling Stones is the central epic in rock mythology. From their debut as the intermission band at London’s Marquee Club in 1962 through their latest record—setting Bridges to Babylon world tour, the Rolling Stones have defined a musical genre and experienced godlike adulation, quarrels, addiction, legal traumas, and descents into madness and death_while steadfastly refusing to fade away. Now Stephen Davis, the New York Times bestselling author of Hammer of the Gods and Walk This Way, who has followed the Stones for three decades, presents their whole story, replete with vivid details of the Stones’ musical successes_and personal excesses.Born into the wartime England of air-raid sirens, bombing raids, and strict rationing, the Rolling Stones came of age in the 1950s, as American blues and pop arrived in Europe. Among London’s most ardent blues fans in the early 1960s was a short blond teenage guitar player named Brian Jones, who hooked up with a lorry driver’s only son, Charlie Watts, a jazz drummer. At the same time, popular and studious Michael Philip Jagger–who, as a boy, bawled out a phonetic version of “La Bamba” with an eye-popping intensity that scared his parents–began sharing blues records with a primary school classmate, Keith “Ricky” Richards, a shy underachiever, whose idol was Chuck Berry. In 1962 the four young men, joined by Bill Perks (later Wyman) on bass, formed a band rhythm and blues band, which Brian Jones named the “the Rollin’ Stones” in honor of the Muddy Waters blues classic. Using the biography of the Rolling Stones as a narrative spine, Old God Almost Dead builds a new, multilayered version of the Stones’ story, locating the band beyond the musical world they dominated and showing how they influenced, and were influenced by, the other artistic movements of their era: the blues revival, Swinging London, the Beats, Bob Dylan’s Stones-inspired shift from protest to pop, Pop Art and Andy Warhol’s New York, the “Underground” politics of the 1960s, Moroccan energy and European orientalism, Jamaican reggae, the Glam and Punk subcultures, and the technologic advances of the video and digital revolution. At the same time, Old Gods Almost Dead documents the intense backstage lives of the Stones: the feuds, the drugs, the marriages, and the affairs that inspired and informed their songs; and the business of making records and putting on shows. The first new biography of the Rolling Stones since the early 1980s, Old Gods Almost Dead is the most comprehensive book to date, and one of the few to cover all the band’s members. Illustrated throughout with photos of pivotal moments, it is a celebration of the Rolling Stones as an often courageous, often foolish gang of artists who not only showed us new worlds, but new ways of living in them. It is a saga as raunchily, vibrantly entertaining as the Stones themselves.From the Hardcover edition.",
  "genres": [
    "Music",
    "Biography",
    "Nonfiction",
    "Rock N Roll",
    "History",
    "Biography Memoir"
  ],
  "author": "Stephen Davis",
  "average_rating": "3.97",
  "url": "https://www.goodreads.com/book/show/304430.Old_Gods_Almost_Dead"
}