{
  "title": "Good Night, Mr. James and Other Stories",
  "description": "Strange, poignant tales of life on tomorrow’s Earth and in outer space from multiple Hugo Award–winning Grand Master of Science Fiction Clifford D. Simak. Virtually every major author from science fiction’s fabled golden age—including Poul Anderson, Isaac Asimov, and Robert A. Heinlein—agreed that Clifford D. Simak was one of the greatest among them. Named Grand Master by the Science Fiction Writers of America, the award-winning author created enduring visions of future worlds, perilous space explorations, and weird alien encounters as rich in emotion and humanity as they are in ingenious invention. This is an essential collection of short fiction from the remarkable mind and heart of a true giant of twentieth-century speculative fiction, featuring powerful examples of literary science fiction at its very best.   Beginning with the unforgettable title story—a wry and chilling horror tale about cloning and alien invasion that inspired the classic teleplay “The Duplicate Man” from the television series The Outer Limits—Simak propels the reader on a breathtaking journey across the galaxies and into the future. He then enthralls us with the strange chronicle of twin siblings, one tied to the Earth, the other drawn to the stars; imaginings of a volatile reunion of two former enemies who must join forces on Jupiter’s moon or face extinction; and the story of a house in the middle of nowhere that serves as a gateway back to prehistoric times.   With his wondrous tales of a journalist’s miraculous discovery of fairies and sprites in the world, a census three centuries in the making that uncovers an unknown leap forward in human evolution, and the nightmare realities of future elder care, Simak demonstrates once again that he is not only one of the greatest science fiction writers of the twentieth century, but also one of the greatest of all time.",
  "genres": [
    "Short Stories",
    "Science Fiction",
    "Fiction"
  ],
  "author": "Clifford D. Simak",
  "average_rating": "4.30",
  "url": "https://www.goodreads.com/book/show/30476996-good-night-mr-james-and-other-stories"
}