{
  "title": "Liturgy and Personality",
  "description": "The principal point of the book you are about to read is that the liturgy of the Church decisively shapes a healthy personality. Hildebrand insists throughout the text that the primary purpose of the liturgy is not to form the personality but to give proper praise to God, the supreme value. Nevertheless, precisely by ordering human beings to thoroughly to God, the liturgy does in fact, as a derivative effect, contribute to their flourishing. -Bishop Robert Barron From the Foreword\"Dietrich von Hildebrand spent a life rich in wonder, and he invites us here to marvel with him as he considers the ways that liturgy shapes us as persons. Liturgy is our key to understanding God, ourselves, and the whole world. It uniquely prepares us to approach life with a workable hierarchy of values — true to creation because it is true to the Creator. Liturgy makes us fully human, reconciled with the past and with eternity. Liturgy leads us to our true selves. Here is truth and wisdom, profound and practical.\" – Scott Hahn\"This is a life-changing book. It shows, in totally convincing ways, the incomparable power of the Catholic liturgy to form our personalities into those of saints—which is the whole meaning of life—and with a minimum of struggle and a maximum of joy on our part to boot. Reading this book inevitably elicits the 'value response' von Hildebrand speaks of more than almost any other, viz. gratitude—gratitude as a thinking as well as a feeling. (Thinking and thanking are as interpenetratingly close to each other as Adam and Eve.) As the liturgy thanks and praises God and von Hildebrand thanks and praises the liturgy, we thank and praise von Hildebrand for this tremendous gift.\" – Peter Kreeft",
  "genres": [
    "Theology",
    "Religion",
    "Catholic",
    "Philosophy",
    "Nonfiction",
    "Spirituality",
    "Christianity"
  ],
  "author": "Dietrich von Hildebrand",
  "average_rating": "4.56",
  "url": "https://www.goodreads.com/book/show/30514286-liturgy-and-personality"
}