{
  "title": "Tipping the Velvet",
  "description": "The heroine of Sarah Waters's audacious first novel knows her destiny, and seems content with it. Her place is in her father's seaside restaurant, shucking shellfish and stirring soup, singing all the while. \"Although I didn't long believe the story told to me by Mother - that they had found me as a baby in an oyster-shell, and a greedy customer had almost eaten me for lunch - for eighteen years I never doubted my own oysterish sympathies, never looked far beyond my father's kitchen for occupation, or for love.\" At night Nancy Astley often ventures to the nearby music hall, not that she has illusions of being more than an audience member. But the moment she spies a new male impersonator - still something of a curiosity in England circa 1888 - her years of innocence come to an end and a life of transformations begins. Tipping the Velvet, all 472 pages of it, is as saucy, as tantalizing, and as touching as the narrator's first encounter with the seductive but shame-ridden Miss Kitty Butler. And at first even Nancy's family is thrilled with her gender-bending pal, all but her sister, best friend, and bedmate, Alice, \"her eyes shining cold and dull, with starlight and suspicion.\" Not to worry. Soon Nancy and Kitty are off to London, their relationship close though (alas for our heroine) sisterly. We know that bliss will come, and it does, in an exceptionally charged moment. A lesser author would have been content to stop her story there, but Waters has much more in mind for her buttonholing heroine, and for us. In brief, her Everywoman with a sexual difference goes from success onstage to heartbreak to a stint as a male prostitute (necessity truly is the mother of invention) to keeping house for a brother and sister in the Labour movement. And did I mention her long stint as a plaything in the pleasure palace of a rich Sapphist extraordinaire? Diana Lethaby is as cruel as she is carnal, and even the well-concealed Cavendish Ladies' Club isn't outré enough for her. Kitting Nancy out in full, elegant drag, she dares the front desk to turn them away. \"We are here,\" she mocks, \"for the sake of the irregular.\" Only after some seven years of hard twists and sensual turns does Nancy conclude that a life of sensation is not enough. Still, Tipping the Velvet is so entertaining that readers will wish her sentimental - and hedonistic - education had taken twice as long. --Kerry Fried",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "LGBT",
    "Queer",
    "Romance",
    "Historical",
    "Lesbian"
  ],
  "author": "Sarah Waters",
  "average_rating": "4.05",
  "url": "https://www.goodreads.com/book/show/305004.Tipping_the_Velvet"
}