{
  "title": "Earth for Inspiration and Other Stories",
  "description": "From tales of alien invasions and intergalactic war to visions of dystopian tomorrows, an astonishing collection from one of literary science fiction’s all-time greats, Hugo Award winner Clifford D. Simak. The twentieth century’s so-called golden age of science fiction produced many great writers—including Isaac Asimov, Ray Bradbury, Arthur C. Clarke, and Robert Heinlein—yet none is greater than Clifford D. Simak, named Grand Master by the Science Fiction Writers of America. His bold visions of and ingenious speculations about humankind’s future, always enriched with empathy and a deep understanding of human strengths, foibles, and failings, have stood the test of time, remaining powerful, affecting, and relevant.   This sterling collection of fantastic stories by the multiple Hugo and Nebula Award– winning master showcases some of Simak’s finest short fiction, from his earliest published tales to his later masterworks. In the wry and wonderful title story, a science fiction writer of the far future returns to a nearly abandoned Earth in search of inspiration—and finds that the dying planet holds more wonder than he bargained for. The interdimensional invasion Simak imagines in “Hellhounds of the Cosmos” displays a conceptual ingenuity not typically seen in speculative fiction prior to World War II. And other tales in this marvelous compendium offer a wide range of wonders, from the surrender terms dictated by a cute and cuddly alien enemy and a get-rich-quick real-estate scam originating from another galaxy to the truth behind a series of strange disappearances on Jupiter and an explosion of ladybugs in a salesman’s suburban home—an infestation quite possibly not of this Earth.   Whether he’s rocketing us to another galaxy, leading us through the otherworldly shadows of small-town America, or preparing us for a Wild West shootout, every literary outing with Simak is an excursion to remember.",
  "genres": [
    "Short Stories",
    "Science Fiction"
  ],
  "author": "Clifford D. Simak",
  "average_rating": "4.25",
  "url": "https://www.goodreads.com/book/show/30476999-earth-for-inspiration-and-other-stories"
}