{
  "title": "The Solar House: Passive Heating and Cooling",
  "description": "Passive solar heating and passive cooling—approaches known as natural conditioning—provide comfort throughout the year by reducing, or eliminating, the need for fossil fuel. Yet while heat from sunlight and ventilation from breezes is free for the taking, few modern architects or builders really understand the principles involved. Now Dan Chiras, author of the popular book The Natural House, brings those principles up to date for a new generation of solar enthusiasts. The techniques required to heat and cool a building passively have been used for thousands of years. Early societies such as the Native American Anasazis and the ancient Greeks perfected designs that effectively exploited these natural processes. The Greeks considered anyone who didn't use passive solar to heat a home to be a barbarian! In the United States, passive solar architecture experienced a major resurgence of interest in the 1970s in response to crippling oil embargoes. With grand enthusiasm but with scant knowledge (and sometimes little common sense), architects and builders created a wide variety of solar homes. Some worked pretty well, but looked more like laboratories than houses. Others performed poorly, overheating in the summer because of excessive or misplaced windows and skylights, and growing chilly in the colder months because of insufficient thermal mass and insulation and poor siting. In The Solar House, Dan Chiras sets the record straight on the vast potential for passive heating and cooling. Acknowledging the good intentions of misguided solar designers in the past, he highlights certain egregious—and entirely avoidable—errors. More importantly, Chiras explains in methodical detail how today's home builders can succeed with solar designs. Now that energy efficiency measures including higher levels of insulation and multi-layered glazing have become standard, it is easier than ever before to create a comfortable and affordable passive solar house that will provide year-round comfort in any climate. Moreover, since modern building materials and airtight construction methods sometimes result in air-quality and even toxicity problems, Chiras explains state-of-the-art ventilation and filtering techniques that complement the ancient solar strategies of thermal mass and daylighting. Chiras also explains the new diagnostic aids available in printed worksheet or software formats, allowing readers to generate their own design schemes.",
  "genres": [
    "Architecture",
    "Nonfiction",
    "Construction",
    "Sustainability",
    "Green",
    "How To"
  ],
  "author": "Daniel D. Chiras",
  "average_rating": "3.91",
  "url": "https://www.goodreads.com/book/show/305015.The_Solar_House"
}