{
  "title": "Beyond the Break",
  "description": "FROM THE BESTSELLING AUTHOR OF RED WATER\nWhat if the forbidden could heal you?\nWhen Hazel Duval moves with her husband Oren to the oceanside town of Conch Garden and secures her dream job playing violin with the local orchestra, she thinks she may have finally left her traumatic past behind her. She even makes a new friend—a friend who turns out to be a little more than she bargained for.Beautiful, brilliant, and wild, Claire makes love to the sand with her toes, focuses intensely without wrinkling her forehead, and makes a cello sing like nothing Hazel has ever heard. She also listens to Hazel's most painful secrets without judgment or expectation. It isn't long before Hazel finds herself thinking about Claire in ways she has never thought of another woman. Fantasizing. Wanting. Longing.But Hazel is married, and so is Claire. Indulging in this fantasy is not an option. Hazel must bury her lust despite her ever-growing infatuation with Claire and the mountain of shame that comes along with it. Still, there is no denying that her feelings for Claire have awakened something primal in her--for the first time in her life, Hazel feels alive. And now the two women are flying off to Italy to perform at a music festival, where they'll be sharing an apartment.Alone.As their friendship deepens, Hazel learns from Claire that there is more than one type of love and that salvation comes in many forms. But is Hazel's relationship with Claire really saving her, or is it only leading to the inevitable destruction of the life she's worked so hard to build?A haunting story of unexpected love in the aftermath of a brutal trauma, Beyond the Break will take you on a journey that will leave you questioning everything you thought you knew about friendship, sexuality, and love. If you enjoyed Carol by Patricia Highsmith or The Gravity Between Us by Kristen Zimmer, you'll love Beyond the Break.",
  "genres": [
    "LGBT",
    "Romance",
    "Lesbian",
    "Slow Burn",
    "Bisexual",
    "Fiction"
  ],
  "author": "Kristen Mae",
  "average_rating": "4.13",
  "url": "https://www.goodreads.com/book/show/30523272-beyond-the-break"
}