{
  "title": "Bailey's Saving Grace",
  "description": "Bailey I grew up in the Wild Kings MC. My dad and brother are both members. Since I was a girl, I wanted to do everything my brother and his friends did and prove to them that I could do it better than they did. Everything changed for me when I started having feelings for Grim. He became the love of my life. Even though I am hurt on a daily basis by his need for club girls, I can’t just shut my feelings off for him. Brock ‘Gage’ Wilson is the President of a different chapter of the Wild Kings MC. I’ve known him my whole life and we started having a friends with benefits relationship. Am I using him to try to get over my love for Grim? In a way, yes. But, he has his own demons he’s fighting. That is until tragedy strikes and we suffer a tremendous loss. Grim I am the President of the Wild Kings MC. My dad was in the club and I decided early on to follow in his footsteps. There’s nothing like knowing you have a group of men, family, that have your back and will do anything to support you. Growing up with Joker, Cage, Irish, and Glock they quickly became my best friends and I would lay down my life for them. Bailey, Joker’s little sister, was always trying to copy everything we did. So, I took it upon myself to make sure she didn’t get in trouble and didn’t get hurt. In doing that, I started to have feelings for her that I have no business feeling. I don’t want an old lady. Never have, never will! Club girls know what I want and don’t pressure me for more. A different one every time ensures that they won’t get attached. That all changes when Bailey suffers a tragic loss. She pushes me away and my heart shatters. I don’t know if I can live with Bailey gone and I don’t know what to do to make all the pain I’ve caused better. Can Bailey get past her pain and move on? Is Grim too late to fix his mistakes? Will more danger tear them apart for good? Or can Grim and Bailey find a way to come together?  This book is intended to be read by individuals 18 and over. There are some triggers in this story of losing a child, sex, and offensive language.",
  "genres": [
    "Contemporary",
    "Romance",
    "Suspense",
    "Death"
  ],
  "author": "Erin Osborne",
  "average_rating": "4.29",
  "url": "https://www.goodreads.com/book/show/30516249-bailey-s-saving-grace"
}