{
  "title": "You Don't Know Me",
  "description": "The sexy spin off standalone to the bestselling, You Don't Own me (The Russian Don series) is available now. You do not have to read 'You Don't On me' books 1 & 2 as this Bad Boy Mafia Romance is Noah's story and can be read as a complete standalone and has guaranteed HEA.TashaTashaI knew Noah Abramovich was trouble the first time our eyes locked. I was sixteen that summer. Sitting by the pool eating an ice-cream I can still remember how it melted over my fingers and dripped onto my thighs as I stared back at him. It wasn't just his Greek god looks, the animalistic Alpha attitude, or his tall, powerful muscled body - it was the aura around him that screamed, Don't fuck with me.At sixteen I wanted him with the passion of a woman, but mine was a world of unwritten rules. Rules that are worth more than a man's life. I didn't need anyone to tell me that he was everything I could not have.He never looked at me again, but I watched him from afar. I could tell there were deep secrets that kept his smile hidden. Dark and mysterious he seemed to fear no one, not even my father. A man he should have. One I feared greatly. As the years passed, the afternoon when time stilled became as unreal as a dream.I am twenty-two now and in six months I will be married to a man my father chose. I will do my duty and bring respectability to my father's dynasty, but before I give myself to that man, I must have a taste of the forbidden. Just one night with the man of my darkest fantasies, so I don't lie on my deathbed, and regret that I never reached out and took the one thing I wanted most in life.But what if it's everything I imagined and more. What if one taste is not enough?Noah.In the Mafia world, your past is never far behind. If you are careless, it seeps into your future and gets you killed. Just when I had fooled myself into believing I'd stepped away from it all, it suddenly appeared in my office.Tasha Evanoff: She is what original sin must have looked like. Blonde, beautiful, voluptuous, and with secretive sapphire eyes that see right into my tainted soul.She comes offering one bite of the red apple.If I had any sense I'd shut the door on her, and send her back to her father, a psychopath of the highest degree. But that's not who I am. If the pretty princess has the courage to walk into the lion's den, I'm sure as fuck not going to pass on a challenge. I'll take one bite of her apple. Why the fuck wouldn't I? I've been lusting after it for years. I will spread her wide and ravage her delicate flesh. I will leave her aching and sore and ruin her for any other man. She naively thinks everything will go back to what it was before, but I know what she doesn't. You can never have just one night of raw passion. The body will always crave more. She'll be back and I'll play it cool. But who am I fooling, I'm never letting go...",
  "genres": [
    "Romance",
    "Dark",
    "Suspense",
    "Contemporary Romance",
    "Erotica",
    "Adult",
    "Drama"
  ],
  "author": "Georgia Le Carre",
  "average_rating": "4.31",
  "url": "https://www.goodreads.com/book/show/30529950-you-don-t-know-me"
}