{
  "title": "Barefoot at Sunset",
  "description": "Introducing Barefoot Bay Timeless…a new trilogy celebrating the sexy silver fox hero! Set on the sun-washed sands of Barefoot Bay, these contemporary novels tell stories of second chances and redemption.  Barefoot at Sunset  When forty-eight year old widower Mark Solomon arrives in Barefoot Bay for his high school reunion, he’s not quite prepared for the onslaught of memories or the attention from interested single women who’ve gathered for the annual event on the beach. He’s ready to ditch the whole thing and resume his life as an adventure-seeking world traveler until he discovers a woman sobbing on his doorstep…and has an idea.  By her own admission, advertising copywriter Emma DeWitt is jaded, jilted, and jobless, but she goes over the edge when she learns that the resort villa that was supposed to be the site of her romantic honeymoon is occupied by a single man. But when the sexy silver fox who's staying in the villa surprises her with an irresistible offer to pose as his fake fiancée, Emma sees a way to have her week in paradise and begin healing her broken heart.  Mark believes every person has only one soul mate…and he’s met, married, and buried his. Emma believes that love is a marketing concept created to sell fairy tales and expensive weddings. What if they are both wrong…and completely right for each other?  Don’t miss a minute in Barefoot Bay!  Barefoot Bay Timeless  Barefoot at Sunset Barefoot at Moonrise Barefoot at Midnight  Barefoot Bay Undercover  Barefoot Bound Barefoot With a Bodyguard Barefoot With a Stranger Barefoot With a Bad Boy  Barefoot Bay Brides  Barefoot in White Barefoot in Lace Barefoot in Pearls  Barefoot Bay Billionaires  Secrets on the Sand Seduction on the Sand Scandal on the Sand",
  "genres": [
    "Romance",
    "Contemporary Romance",
    "Contemporary",
    "Amazon",
    "Audiobook",
    "Fiction",
    "Adult"
  ],
  "author": "Roxanne St. Claire",
  "average_rating": "4.31",
  "url": "https://www.goodreads.com/book/show/30524421-barefoot-at-sunset"
}