{
  "title": "The New Strong: Stop Fixing Yourself -- And Actually ACCELERATE Your Personal Growth! (Rules & Tools for Thriving in the Age of Awakening\")",
  "description": "Has \"working on yourself\" become an ongoing, never-ending project?Does negative energy from others bother you more than it used to?Are you experiencing more and more episodes of \"brain fog\"?The 1980s saw the start of a seismic shift in human awareness of energy in ourselves and others. Prior to that, what people did and said mattered to us more than the energy behind those actions. Then came December 21, 2012. Obviously—despite predictions—the world didn't end on that date, but there was a huge energetic change.Before December 21, 2012, the \"veil\" (that made it hard for humans to sense energies) was thinning. On December 21, 2012 it disappeared completely. Now, in everyday human interactions, we're able to effortlessly shift awareness to the \"vibes\" and subconscious motivations of those we interact with. The potential to accelerate spiritual and psychological growth is dazzling.Welcome to The Age of Awakening. It's a new era, with a whole new set of vibrational rules that few people are even aware of, which explains why spending more and more time on \"personal-growth\" work is bringing fewer results.Yet it's surprisingly easy to learn to live productively in the Age of Awakening...Enter The New Strong, by world-renowned aura-reading, energy-healing expert, Rose Rosetree. With a clarity that moves beyond today's often unproductive \"energy talk,\" Rosetree offers a PROGRAM FOR EASY VIBRATIONAL BALANCE. You'll learn...• A practical understanding of the different vibrational frequencies • How to have energy awareness enhance your life, not take over your life• Targeted strategies for keeping your personal energies strong Your investment? Far less time than you're spending now on self-improvement.What will you gain?A MORE POWERFUL SENSE OF SELF:  Come to understand yourself better than ever. (And you may be pleasantly surprised to discover how much you like what you find.)GREATER PRODUCTIVITY: Develop more confidence for solving problems your way, versus waiting 'till \"things feel right\" or \"spirit guides show the way.\"BETTER RELATIONSHIPS:  A new psychological stability can help you enjoy relationships more. And without having to work on your issues—or the other person's....Want to feel more alive and connected, humanly? Ready to stop working so hard to \"fix yourself,\" energetically? Let this groundbreaking book help you use a clearer \"energy awareness\" to enhance your life—not become your life!",
  "genres": [
    "Spirituality"
  ],
  "author": "Rose  Rosetree",
  "average_rating": "4.79",
  "url": "https://www.goodreads.com/book/show/30553113-the-new-strong"
}