{
  "title": "Middletown, America: One Town's Passage from Trauma to Hope",
  "description": "The single event that we know as 9/11 is over, but the shock waves continue to radiate outward, generated by orange alerts, terrorism lockdowns, and the shrinking of personal liberties we once took for granted. The stories in this book, of real people faced with extraordinary trauma and gradually transcending it, are the best antidote to our fears. Middletown, America is a book of hope.All Americans were hit with some degree of trauma on September 11, 2001, but no place was hit harder than Middletown, New Jersey. Gail Sheehy spent the better part of two years walking the journey from grief toward renewal with ﬁfty members of the community that lost more people in the World Trade Center than any other outside New York City. Her subjects are the women, men, and children who remained after the devastation and who are putting their lives back together.Sheehy tells the story of four widowed moms from New Jersey who started out scarcely knowing the difference between the House and the Senate, yet turned their sorrow and anger into action and became formidable witnesses to the failures of the country’s leadership to connect the dots before September 11. Sheehy follows the four moms as they ﬁght White House attempts to thwart the independent commission investigating 9/11 and expose efforts at a cover-up.What would become of the young wives carrying children their husbands would never see, wives who had watched their dreams literally go up in smoke in that amphitheater of death across the river? Amazingly, each ﬁnds her own door to the light. Here, too, is the story of the widow and widower who met in the waiting room of a mental-health agency and brought each other back from the brink of despair across a bridge of love. Sheehy also reveals how bereft mothers who will never have another son or daughter found reasons to recommit to life. And she follows in the footsteps of the robbed children, documenting the incredible resilience of four-year-olds, the anger of teenagers, the courage of sisters and brothers.Sheehy follows survivors who escaped the burning towers only to ﬁnd themselves trapped inside a tower of inner torment, from which it took love, family, and faith to free themselves. She is taken into the conﬁ-dence of the night crew at Ground Zero, police ofﬁcers who worked in that pit for eight months straight and then faced the “returning home” phenomenon. She recounts the confessions of religious leaders who struggled to explain the inexplicable to their ﬂocks. Mental-health professionals conﬁde in her, as do corporate chiefs, educators, friends and neighbors, town ofﬁcials, and volunteers who rose to the occasion and committed themselves to healing their wounded community.As a journalist who conducted more than nine hundred interviews, Gail Sheehy is an impeccable researcher. As a writer with a novelistic gift, she weaves the individual stories into a compelling narrative. Middletown, America illuminates every stage of a tumultuous passage—from shock, passivity, and panic attacks, to rising anger and deep grieving, and on to the secret romances and startling relapses, the realignment of faith, the return of a capacity to love and be loved, and, ﬁnally, the commitment to constructing new lives.",
  "genres": [
    "Nonfiction",
    "History",
    "Historical"
  ],
  "author": "Gail Sheehy",
  "average_rating": "3.86",
  "url": "https://www.goodreads.com/book/show/305470.Middletown_America"
}