{
  "title": "Beast Lord: Beauty and the Beast",
  "description": "Book 3 (A twisted, tangled, romantic retelling of the fairy tale Beauty and the Beast.)  The curse of the de Bar siblings continues as Stefan de Bar, eldest of the seven, takes a small group of his brother's soldiers and goes on a search for his missing sister, Rapunzel. The witch, Hecuba, has stolen his sister and they have been spotted near Breckenridge Castle. Stefan's cautious nature and hesitance to make a decision is the cause of what turns into a deadly ambush. Bloodied and bruised, Stefan manages to take the castle, but in the process suffers severe damage to his face. He finds and confronts the witch, but this time she curses him, and it is possibly worse than the curses she's previously bestowed upon his twin brothers. He needs to love a woman and be loved in return before the last petal falls from a rose, or the beast that is emerging within him will consume him forever.  Bonnibel of Breckenridge returns home after 15 years to marry a man of her father's choosing that she's never even met. But when she gets to Breckenridge Castle, her father is missing, most his men are dead, and a beastly man named Sir Stefan de Bar has claimed the castle as his own. Thinking she'll gain his favors, she stitches up his face, but the man's anger is out of control and it causes his body to start to change into that of a beast. While all she wants to do is run, something deep in Stefan's eyes makes her want to stay. However, she has no choice when Stefan takes her as his prisoner.  Can Bonnibel not only find her father and a way to escape, but look past Stefan's outward appearance and learn to love the real man deep inside before it's too late? And will Stefan realize that love can't be forced but has to be earned and given freely from the heart? A battle of good and evil grows within a man who wants nothing more than to love a beautiful young maiden and be loved in return . . . before the last petal falls.",
  "genres": [
    "Romance",
    "Fantasy",
    "Beauty and The Beast",
    "Amazon",
    "Retellings",
    "Paranormal",
    "Shapeshifters"
  ],
  "author": "Elizabeth Rose",
  "average_rating": "3.79",
  "url": "https://www.goodreads.com/book/show/30556581-beast-lord"
}