{
  "title": "Ghost Walk",
  "description": "Grace Rivera just wants to be normal. She’s the only member of her spell-casting, fortune-telling family who isn’t hunting unicorns or trying to discover the lost recipe for Troll Powder. Trained as a crime scene investigator, she believes in science and cold, hard facts. And right now, the cold, hard facts are telling Grace that she’s lost her mind. It started last July, when she “hallucinated” that she traveled back in time to relive a crime before it had even happened. Her resulting breakdown cost Grace her forensics job, so now she’s stuck working as a tour guide in her Revolutionary War themed hometown. After a year of rebuilding her life, she’s finally convincing herself that she might just have a chance to be normal, again. …Until a handsome, sarcastic, and really real seeming ghost shows up on her Ghost Walk, anyway.  Captain James Riordan was unjustly hanged for murder on July 4th 1789. Ever since then, he’s been haunting the streets on Harrisonburg, Virginia, trying to find some way to clear his name. Unfortunately, it’s impossible to prove his innocence as an incorporeal ghost, so mostly he whiles away his un-life watching teen soaps on TV and tagging along on Harrisonburg’s nightly Ghost Walk. The tour is supposed to tell visitors spooky stories about the historic town. On this particular night, though, there’s a new tour guide leading the group. She’s terrible at waving scary tales. She looks like a Sunday school teacher. She’s spreading slanderous lies about him. …And she’s the first person in centuries that can actually see him.  Now Grace and Jamie are working together to solve a two hundred year old crime. From the eighteenth century and back again, the two of them are determined to clear Jamie’s name and set history right. Even if it means some time-traveling forensics work. Even if it means Grace has to listen to Jamie lament his lost pirate’s treasure (a lot) and Jamie is frustrated because he can’t physically touch the one person in the world he’s sure is his. Even if it means dealing with Grace’s stalking ex-boyfriend, her crazy relatives, and the Rivera’s lost recipe for Troll Powder. …And especially if it means a scoundrel of a ghost and girl who just wants to be normal somehow fall in love along the way.",
  "genres": [
    "Romance",
    "Fantasy",
    "Paranormal",
    "Time Travel",
    "Ghosts",
    "Paranormal Romance",
    "Historical"
  ],
  "author": "Cassandra Gannon",
  "average_rating": "4.02",
  "url": "https://www.goodreads.com/book/show/30531713-ghost-walk"
}