{
  "title": "The Mermaid's Daughter",
  "description": "A modern-day expansion of Hans Christian Andersen’s The Little Mermaid, this unforgettable debut novel weaves a spellbinding tale of magic and the power of love as a descendent of the original mermaid fights the terrible price of saving herself from a curse that has affected generations of women in her family.Kathleen has always been dramatic. She suffers from the bizarre malady of experiencing stabbing pain in her feet. On her sixteenth birthday, she woke screaming from the sensation that her tongue had been cut out. No doctor can find a medical explanation for her pain, and even the most powerful drugs have proven useless. Only the touch of seawater can ease her pain, and just temporarily at that.Now Kathleen is a twenty-five-year-old opera student in Boston and shows immense promise as a soprano. Her girlfriend Harry, a mezzo in the same program, worries endlessly about Kathleen's phantom pain and obsession with the sea. Kathleen's mother and grandmother both committed suicide as young women, and Harry worries they suffered from the same symptoms. When Kathleen suffers yet another dangerous breakdown, Harry convinces Kathleen to visit her hometown in Ireland to learn more about her family history.In Ireland, they discover that the mystery—and the tragedy—of Kathleen’s family history is far older and stranger than they could have imagined.  Kathleen’s fate seems sealed, and the only way out is a terrible choice between a mermaid’s two sirens—the sea, and her lover. But both choices mean death… Haunting and lyrical, The Mermaid’s Daughter asks—how far we will go for those we love? And can the transformative power of music overcome a magic that has prevailed for generations?",
  "genres": [
    "Fantasy",
    "Mermaids",
    "Retellings",
    "Fiction",
    "LGBT",
    "Fairy Tales",
    "Romance"
  ],
  "author": "Ann Claycomb",
  "average_rating": "3.71",
  "url": "https://www.goodreads.com/book/show/30531873-the-mermaid-s-daughter"
}