{
  "title": "In the Service of Dragons",
  "description": "In the Service of Dragons is the continuation of Robert Stanek's multilayered epic fantasy adventure for young adults that began with The Kingdoms and the Elves of the Reaches and continued through The Kingdoms and the Elves of the Reaches 2, 3, and 4. In his acclaimed The Kingdoms and the Elves of the Reaches books, he introduced us to the story of Ruin Mist, an extraordinary world of magic, adventure, and intrigue. Now in the eagerly awaited follow-up, he once again proves himself a wonderful storyteller with a gift for fast pacing and believable storylines. Already hailed as a classic, Robert Stanek's powerful series has been enjoyed by readers all over the world. The Elves of the Reaches returned from exile, bringing grave news. War came to the Kingdoms, and many perished in the turmoil and unrest. An attempt was made to kidnap a princess and assassinate a king. Now, from the ancient past a dark power returns. \"The Fourth Wind blows across the mountain tops,\" they say. And the Twelve Clans emerge from myth and memory. As prophecy becomes reality, the factions struggle for control only to further divide the lands. Some would say that it was foolish for King Andrew Alder to support the Elves of the Reaches and send men to aid their cause when Men in all lands were being put to the test of steel. In the North, men back their words with action. Against a backdrop of treachery and intrigue, murder and mayhem, the price of freedom is high. Many will pay with their lives. Many will succumb to imprisonment and enslavement; for when alliances shatter, old hatreds rise anew and the plotting and scheming begin. Bold, inventive, brilliantly imagined, In the Service of Dragons is a novel of magic and wonder-a tale of pure excitement you will not soon forget.",
  "genres": [
    "Fantasy",
    "Dragons"
  ],
  "author": "Robert Stanek",
  "average_rating": "2.89",
  "url": "https://www.goodreads.com/book/show/1002619.In_the_Service_of_Dragons"
}