{
  "title": "Choose To Be Happy: A Guide to Total Happiness",
  "description": "This wonderful new self-help book expands on the concept of The Secret that positive thoughts bring positive results. Ms. Rudner welcomes readers into her life and makes them feel at home. She shares new insights that can lead to inner-peace and provides Happiness Tools that make this book a must read for anyone who wants to improve the quality of their lives. Choose to Be Happy is based on the scientific studies that prove that 50% of one's happiness is genetic and that we all return to our genetic set-point no matter what happens to us. Readers find out how to reverse the self-defeating habits and behaviors that are sabotaging their joy of life. Ms. Rudner shows readers how to re-program their inner-thoughts by using her 15% Principle and Wait 24-Hours Rule. She stresses getting rid of the toxic people that sabotage one's happiness and taking control of the steering wheel of one's own life. For those who feel stuck and are constantly searching for answers, the author teaches her readers how to stop wishing something good will happen and how to make it happen. She stresses that happiness is not about what happens in one's life, but one's attitude about what happens in one's life. This easy-to-read, casual, and often humorous book is rich with examples and advice that can transform unhappy lives in joyful adventures. Rudner provides a list of razor sharp Happiness Rules in the final pages of the book to be used as a happiness jump start every morning. Choose to Be Happy helps readers regain their self-esteem, overcome guilt, fears and worries, triumph over failure and frustration, and let go of past hurt and blame. Sadness is replaced with joy, hate turns into love, and negatives into positives. Readers discover their inner-beauty, purpose, and authentic selves.",
  "genres": [
    "Self Help"
  ],
  "author": "Rima Rudner",
  "average_rating": "3.67",
  "url": "https://www.goodreads.com/book/show/3057521-choose-to-be-happy"
}