{
  "title": "Chronicle of Ages",
  "description": "traci Harding returns to the Ancient Future trilogy which ended with the ࢨosen leaving Earth for the further reaches of space. Earth must follow its own path for a time while the gods battle elsewhere. Noah, storyteller and chronicler, tutors the children born after colonisation and must explore the past to fill in the gaps in his written histories. tory, Maelgwn and Rhun recall their life and times in ancient Britain when Maelgwn reigned as High King of the Britons and tory was a student of time travel and immortality under taliesin. Rhun became King of Gwynned after Maelgwn. When Vortipor, High King of the Britons, dies, there is a bloody four day skirmish over who should succeed him. Sir Bryce is killed in the action and Rhun is forced to abdicate. Noah finds himself on a celestial journey through the ethers, space and time as the missing years in his Chronicle of Ages unfold.traci Harding returns to the Ancient Future trilogy which ended with the ࢨosen߬eaving Earth for the further reaches of space. Earth must follow its own path for a time while the gods battle elsewhere. Noah, storyteller and chronicler, tutors the children born after colonisation and must explore the past to fill in the gaps in his written histories. tory, Maelgwn and Rhun recall their life and times in ancient Britain when Maelgwn reigned as High King of the Britons and tory was a student of time travel and immortality under taliesin. Rhun became King of Gwynned after Maelgwn. When Vortipor, High King of the Britons, dies, there is a bloody four day skirmish over who should succeed him. Sir Bryce is killed in the action and Rhun is forced to abdicate.Noah finds himself on a celestial journey through the ethers, space and time as the missing years in his Chronicle of Ages unfold.",
  "genres": [
    "Fantasy",
    "Time Travel",
    "Science Fiction",
    "Audiobook",
    "Magic",
    "Fiction",
    "Science Fiction Fantasy"
  ],
  "author": "Traci Harding",
  "average_rating": "4.01",
  "url": "https://www.goodreads.com/book/show/3059694-chronicle-of-ages"
}