{
  "title": "قصص من التاريخ",
  "description": "وقد حدثنا المؤلف في مقدمة الكتاب عن أسلوبه في كتابة هذه القصص فقال: \"لم تُكتب هذه الفصول في يوم واحد، بل كُتبت في أزمان متباعدات؛ لذلك كان ما ترون من الاختلاف بين أساليبها. وفي بعضها أثرٌ مِن أساليب مَن كنت مولعاً بهم يومئذ؛ ففي قصص الحجاج (هجرة معلم، وليلة الوداع، ويوم اللقاء) أثر من أسلوب معروف الأرناؤوط، وفي قصة \"عالم\" أثر من أسلوب الرافعي، وسائرها مكتوب بأسلوبي\".ثم يتحدث عن منهجه في هذه القصص: \"ولم أتعمد أن أجعلها قصصاً كما جاء في عنوان الكتاب، ولم أتقيّد بقيود القصة وأقفْ عند حدودها، بل كنت آخذ الخبر أقعُ عليه فأديره في ذهني وأتصوّر تفاصيله، ثم أحاول أن أعرضه موسعاً واضحاً، فكان ما أجيء به يقترب من القصة حيناً، ويكون أشبه بالعرض (الريبورتاج) حيناً. وربما غلبت عليّ الرغبة بالتحليل النفسي فأطيل، وربما وقفت عند الحقائق فأقصر. ولو رجعتم إلى أصول هذه الفصول في التاريخ لوجدتم أن أكثرها لا يجاوز بضعة أسطر جاءت متوارية في حاشية من الحواشي أو زاوية من الزوايا، لا يتنبه إليها القارئ ولا يقف عليها\".أما القصص التي حواها الكتاب فهي ثلاث وعشرون قصة، ولقد كُتبت بأسلوب بثّ فيها الحياة حتى ليستدرّ -أحياناً- الدمع من عين قارئها، وحتى ليخال المرء أنه واحد من أبطالها وشخصياتها، يروح معهم ويجيء، ويأْلم معهم ويفرح، بل ليكاد يحيا معهم ويموت!وهي منتقاة من أزمنة متباينة تمتد ما بين أيام الجاهلية وحتى القرن الماضي؛ ففيها قصص من العصر الجاهلي (النابغة الذبياني)، ومن الطائف في آخر أيام الجاهلية وأول أيام الإسلام (ابن الحب)، ومن الحجاز في أول العصر الأموي (ثلاثون ألف دينار، وعلى أبواب المدينة، وليلة الوداع، ويوم اللقاء)، ومن سمرقند أيام الفتوح الأولى (قضية سمرقند)، ومن الشام في آخر أيام بني أمية فيها (سيدة من بني أمية)، ثم منها في القرن الثامن (في صحن الأموي)، ومن مكة في وسط القرن الثالث (حكاية الهميان)، ومن بغداد في أيام المأمون (وديعة الله)، ومن فلسطين في أيام صلاح الدين (في بيت المقدس، وهيلانة ولويس)، ومن الأندلس في آخر القرن الخامس (عشية وضحاها)، ثم منها في ساعات الوداع قبيل سقوط غرناطة بيد النصارى في آخر القرن التاسع (آخر أبطال غرناطة)، ثم منها بعد السقوط (محمد الصغير)، وأخيراً ها هي ذي قصة \"عالِم\" من دمشق في عام 1831. وفي الكتاب مشهد مسرحي واحد عنوانه \"أبو جهل\".رابط التحميل:http://www.waqfeya.com/book.php?bid=278",
  "genres": [
    "History",
    "Nonfiction",
    "Literature",
    "Religion",
    "Historical",
    "Islam",
    "Short Stories"
  ],
  "author": "علي الطنطاوي",
  "average_rating": "4.18",
  "url": "https://www.goodreads.com/book/show/3057098"
}