{
  "title": "Glass: A World History",
  "description": "Picture, if you can, a world without glass. There would be no microscopes or telescopes, no sciences of microbiology or astronomy. People with poor vision would grope in the shadows, and planes, cars, and even electricity probably wouldn't exist. Artists would draw without the benefit of three-dimensional perspective, and ships would still be steered by what stars navigators could see through the naked eye.In Glass: A World History, Alan Macfarlane and Gerry Martin tell the fascinating story of how glass has revolutionized the way we see ourselves and the world around us. Starting ten thousand years ago with its invention in the Near East, Macfarlane and Martin trace the history of glass and its uses from the ancient civilizations of India, China, and Rome through western Europe during the Renaissance, Enlightenment, and Industrial Revolution, and finally up to the present day. The authors argue that glass played a key role not just in transforming humanity's relationship with the natural world, but also in the divergent courses of Eastern and Western civilizations. While all the societies that used glass first focused on its beauty in jewelry and other ornaments, and some later made it into bottles and other containers, only western Europeans further developed the use of glass for precise optics, mirrors, and windows. These technological innovations in glass, in turn, provided the foundations for European domination of the world in the several centuries following the Scientific Revolution.Clear, compelling, and quite provocative, Glass is an amazing biography of an equally amazing subject, a subject that has been central to every aspect of human history, from art and science to technology and medicine.",
  "genres": [
    "History",
    "Nonfiction",
    "Microhistory",
    "Technology",
    "Science",
    "Art"
  ],
  "author": "Alan Macfarlane",
  "average_rating": "3.49",
  "url": "https://www.goodreads.com/book/show/306053.Glass"
}