{
  "title": "Prescription for Natural Cures: A Self-Care Guide for Treating Health Problems with Natural Remedies Including Diet and Nutrition, Nutritional Supplements, Bodywork, and More",
  "description": "The all-in-one natural health resource your family can trustDr. James Balch coauthored Prescription for Nutritional Healing, which became the first major popular guide to the healing power of foods and nutritional supplements, selling more than 8 million copies in all its editions. Now, Dr. Balch and Dr. Mark Stengler present a new natural health resource that you can't afford to be without--a comprehensive reference of natural remedies for common ailments, * acne* allergies* arthritis* asthma* back pain* cancer* depression* fibromyalgia* heart disease* hypothyroidism* influenza* irritable bowel syndrome* menopause* osteoporosis* stroke* Syndrome X* varicose veins, and more--almost 200 health problems and conditions in all.Prescription for Natural Cures provides a complete natural Rx for each condition, giving you a proven, natural, customized prescription that may include supplements, herbal medicine, homeopathy, aromatherapy, Chinese medicine, hydrotherapy, bodywork, natural hormones, and other natural cures in addition to nutritional advice. Organized by problem from A to Z, this invaluable guide * The unique Super Seven Prescriptions for each condition, which provide specific and practical remedies to help heal your problem. You have never seen natural health advice as helpful, targeted, and accessible as this* Clear, authoritative guidance on dietary changes, healing foods, nutritional supplements, and recommended tests* Easy-to-understand discussions of the symptoms and root causes of each health problem* Down-to-earth descriptions of each natural remedy* A resource guide to holistic practitionersThis breakthrough book is indispensable if you want to get better--naturally",
  "genres": [
    "Health",
    "Nonfiction",
    "Reference",
    "Self Help",
    "Research",
    "Food",
    "Medicine"
  ],
  "author": "James F. Balch",
  "average_rating": "4.30",
  "url": "https://www.goodreads.com/book/show/3062.Prescription_for_Natural_Cures"
}