{
  "title": "The Professional Chef",
  "description": "The Professional Chef , the official text of The Culinary Institute of America's culinary degree program, has taught tens of thousands of chefs the techniques and fundamentals that have launched their careers. Now in a revolutionary revision, The Professional Chef, Seventh Edition not only teaches the reader how, but is designed to reflect why the CIA methods are the gold standard for chefs. With lavish, four-color photography and clear, instructive text, The Professional Chef, Seventh Edition guides culinary students--professional aspirants and serious home cooks, alike--to mastery of the kitchen. Over 660 classic and contemporary recipes, with almost 200 variations, were chosen especially for their use of fundamental techniques. These techniques and recipes form a foundation from which a professional chef or home cook can build a personal repertoire. From mise en place (preparation) to finished dishes, the book covers Stocks, Sauces, and Soups; Meats, Poultry, Fish, and Shellfish; Vegetables, Potatoes, Grains, and Legumes, Pasta and Dumplings; Breakfast and Garde Manger; Baking and Pastry. In addition to a comprehensive treatment of techniques and recipes, The Professional Chef, Seventh Edition teaches readers other critical elements of the professional chef's domain--much of it universally applicable to any kitchen. From \"An Introduction to the Professional,\" to the identification of tools and ingredients, to nutrition, food science and food and kitchen safety, the book is a wealth of beautifully presented information useful for any cook. The Culinary Institute of America has been hailed as \"The nation's most influential training school for professional cooks\" by Time magazine. The Professional Chef, Seventh Edition , the cornerstone of its program in book form, belongs on the shelf of every serious cook.",
  "genres": [
    "Cookbooks",
    "Cooking",
    "Food",
    "Reference",
    "Culinary",
    "Nonfiction",
    "Gastronomy"
  ],
  "author": "Culinary Institute of America",
  "average_rating": "4.28",
  "url": "https://www.goodreads.com/book/show/306235.The_Professional_Chef"
}