{
  "title": "Sleepy Time Girls: A Three Story Bundle",
  "description": "Sleepy Time Girls includes three erotic stories of young, sexy girls being violated while they sleep at a discounted price! All stories feature sleepy, sexy women with toned bodies that beg to be touched and teased while they sleep. Stories may include scenes of anal play, humiliation, girl on girl, virgin breeding and more! Detailed book descriptions can be found below.Secretly Breeding my Virgin Best FriendAllie just can't bring herself to find a boyfriend. She is beautiful and smart, but every time she talks to a guy, she has a panic attack.But when her best friend Heather gets pregnant, she calls on Allie to make good on a promise. A promise to be pregnant together. And when Allie refuses to get knocked up, Heather decides to take drastic measures.Now Heather has a plan to get Allie pregnant, even if Allie doesn't want it. It involves a wild night at a frat party where booze, beats, and drugs flow like water. And she won't let her timid friend leave the party until there is a baby in her belly!This story contains scenes of reluctant breeding, girl on girl, virgin sex, menage, mind altering drugs, and a shy but sexy virgin who is about to bare it all!Sleeping BeautiesAfter a mix-up at the housing office puts Aaron into an apartment with Shae and Laura, two of the hottest girls on campus, the shy freshman doesn't know what to do. And when the girls find out he gets nervous whenever they're around, the two beauties go out of their way to tease him.And when he finds them both asleep on the couch one night, Aaron can't help but stare at the busty couple, half naked on the sofa.But when Shae wakes up and corners Aaron in the kitchen, she decides to have some fun with him. With his shaky hands on her body in the naughtiest of places, Shae makes Aaron a deal he can't pass up. If he sleeps with Laura while she slumbers, she will ride him all night long!But when Aaron does everything Shae asks and she goes back on her word, something snaps in him. Now he's turning the tables and taking control. And by the end of the night, Aaron will have taken everything he wants from his sleeping beauties!This 8,000 story contains hair pulling, humiliation, threesomes, sleeping girls, and a night of hot, wild sex!Breeding my Sleeping Virgin RoommatePeter has a problem. His roommate Katie, a sexy college co-ed, keeps teasing him to get him to do things.Katie has a problem too. She wants Peter to ask her out, but she is too afraid to make the first move.So when Katie gets drunk at a party and calls Peter to pick her up, the sexual tension is high. And when Katie falls asleep in Peter's bed, sparks will fly.And before the night is over, Katie will let Peter take her in every hole, whether she is awake to enjoy it or not!This book contains hot scenes of hardcore oral, anal and vaginal sex, virgin breeding, dubious consent, and sleep sex.",
  "genres": [],
  "author": "Cindel Sabante",
  "average_rating": "0.00",
  "url": "https://www.goodreads.com/book/show/30623369-sleepy-time-girls"
}