{
  "title": "Murder at an Irish Wedding",
  "description": "The O Sullivan clan of County Cork, Ireland, are thrilled to be catering the matrimonial affairs of a celebrity couple until a cunning killer turns an Irish wedding into an Irish wake . . . \"Any wedding is a big deal in the small village of Kilbane even more so when the bride is a famous fashion model. It s also good for business. Not only has customer traffic picked up at Naomi s Bistro, Siobhan O Sullivan and her five siblings have a full plate catering for the three-day affair. And Siobhan s own beau, local garda Macdara Flannery, gladly steps in as best man after the groom s first choice makes a drunken arse out of himself. Even if he hadn t been disinvited to the wedding, the original best man wouldn t have been able to show. He s been found murdered in the woods, casting a pall over the nuptials. And when a second member of the wedding party is poisoned by a champagne flute engraved with Macdara s name, the garda goes from being best man to prime suspect. With a killer at large and a string of robberies plaguing Kilbane, Siobhan feels more than a little protective of her village. She vows to clear Macdara s name, but the suspect list is as long as the guest list. Like the bride walking down the aisle, Siobhan needs to watch her step. For as she gets closer to unveiling the truth, the murderer is planning a very chilly reception for her . . . PRAISE FOR \"MURDER IN AN IRISH VILLAGE\" \"\" If Janet Evanovich and Maeve Binchy wrote a book together, \"Murder in an Irish Village\"would be the result. This one isdelicious fun. Laurien Berenson, author of\"Live and Let Growl\"  A lively debut . . . The cheeky and close-knit O Sullivans are sure to appeal to cozy fans, who will also appreciate the warmth and spirit of the people of Kilbane. \"Publishers Weekly\"  A smart whodunnit in an idyllic locale. I dare you not to be charmed by sleuth Siobhan and her siblings, the O Sullivan Six. Barbara Ross, author of\"Fogged Inn\" \"\" This entertaining combination of Maeve Binchy s old-world Irish charm and Janet Evanovich s roguish humor is a smart, fast-paced read. Devotees of the Hibernian mysteries of Dicey Deere and M.C. Beaton will toast this debut with a pint of Guinness. Slainte! \"Library Journal\"",
  "genres": [
    "Mystery",
    "Cozy Mystery",
    "Fiction",
    "Audiobook",
    "Ireland",
    "Cozy",
    "Crime"
  ],
  "author": "Carlene O'Connor",
  "average_rating": "3.87",
  "url": "https://www.goodreads.com/book/show/30618554-murder-at-an-irish-wedding"
}