{
  "title": "Beltane",
  "description": "When Zoe Rose stays at Anam Cara - a guest house in Glastonbury, a town steeped in magic and myth - she dreams of a handsome stranger. The next day she meets him. Tall with untidy brown hair and grey eyes, Finn is funny and intelligent but doesn’t open up easily. Instantly drawn to him, Zoe doesn’t initially recognise him as the man from her dream. When Finn finds out where Zoe is staying he warns her not to trust Maeve, the healer who owns Anam Cara. His enigmatic comments fuel Zoe’s growing unease about what’s happening at Anam Cara. What power does Maeve have over the minds of the other guests? Is it coincidence that they become ill after she’s given them healing? Why does the stone table in the garden provoke memories of blood and terror? And how did the Green Man, carved on a tree in the garden, disappear during a thunderstorm? Finn’s torn between wanting to protect Zoe from his world and a strong desire to be with her. And the more time they spend together the harder it is for him to keep his secrets from her. As they uncover the dark, supernatural secrets of Anam Cara, they grow closer and Zoe’s forced to accept that her dreams reveal the future and Finn is not all he seems. For Finn is a druid, connected by magic to the earth, and the old scores between Finn and Maeve are about to put Zoe’s life in danger. If you love Deborah Harkness or the Stonewylde books you'll love this gripping fantasy romance. “You will be hooked until the very end as the witchcraft and sorcery unfold in this gripping urban fantasy. A very well told novel; thoroughly enjoyable” – Rosie Amber’s Book Blog “Alys West certainly knows how to tell a story” – Alison Williams, author of The Black Hours “Opening with a terrific prologue which grabbed my interest immediately, Beltane has a lot of factors I love in a book – including a handsome druid, magic and Glastonbury” – Between the Lines Book Blog",
  "genres": [
    "Fantasy",
    "Paranormal",
    "Fiction",
    "Urban Fantasy"
  ],
  "author": "Alys West",
  "average_rating": "4.19",
  "url": "https://www.goodreads.com/book/show/30634615-beltane"
}