{
  "title": "In Trump We Trust: E Pluribus Awesome!",
  "description": "Donald Trump isn't a politician -- he's a one-man wrecking ball against our dysfunctional and corrupt establishment. Now Ann Coulter, with her unique insight, candor, and sense of humor, makes the definitive case for why we should all join his revolution. The three biggest news stories of the 2016 election have been Trump, Trump, and Trump. The media have twisted themselves in knots, trying to grasp how he won over millions of Republicans, whether he really has a shot in November, and what he'd be like as President. But Ann Coulter isn't puzzled. She knows why Trump was the only one of 17 GOP contenders who captured the spirit of our time. She gets the power of addressing the pain of the silent majority and saying things the PC Thought Police considers unspeakable. She argues that a bull in the china shop is exactly what we need to make America great again. In this short but powerful book, Coulter explains why conservatives, moderates, and even disgruntled Democrats should set aside their doubts and embrace Trump:·He's flipped the GOP from a globalist party to a nationalist party, just when it's essential that we put America first in our trade deals and alliances.·He's abandoned the GOP's decades-long commitment to a bellicose foreign policy, at a time when the entire country is sick of unnecessary wars.·He's ended GOP pandering to Hispanics with his hard line on immigration. Working class Americans finally have a champion against open borders and cheap immigrant labor.·He's broken the power of identity politics. It turns out you don't need to act religious to win the Evangelical vote; or talk about your dad the bartender to win the blue collar vote; or have served in the military to win the military vote.·He's overturned the media's traditional role in setting the agenda and defining who gets to be considered \"presidential.\"·He's exposed political consultants as grifters and hacks, most of whom don't know real voters from a hole in the ground.If you're already a Trump fan, Ann Coulter will help you defend and promote your position. If you're not, she might just change your mind.From the Hardcover edition.",
  "genres": [
    "Politics",
    "Nonfiction",
    "Audiobook",
    "21st Century",
    "Humor",
    "Biography",
    "History"
  ],
  "author": "Ann Coulter",
  "average_rating": "3.79",
  "url": "https://www.goodreads.com/book/show/30634922-in-trump-we-trust"
}