{
  "title": "Know Thy-Self",
  "description": "The book is about a few Sadhakas and Swami. The Swami is a Sthitaprajna. The book grows as the discussion between the various aspirants and Swami grows. It is a dialogue. The aspirants have their own problems—social, philosophical and religious. The Swami provides them an opportunity to find out solutions to their problems by themselves.The dialogue touches on various topics from Psychology, Philosophy, Religion, Sociology and Culture. Each of the aspirants is depicted as a model—belonging to the upper middle class—who is neither agnostic nor the faithful, but keen on knowing more about God, Soul, Freedom, Bondage, Sadhana, Bhakti, Jnana, Karma, Vairagya, Peace, Conflict, Time, Space and Cause etc... Their approach is that of an enquirer.The title of the book “KNOW THY-SELF” is really very significant. Each one has to find out for himself who he is. No Guru or Swami can do that for them. It is the self-analysis which leads to self-knowledge. The author has propagated Jnanamarga for self-realisation. This self-realisation is not to be sought anywhere outside one’s self. It is not search for the lost, as nothing is lost. It is not attainment.Enlightenment is “seeing into one’s own self nature”. One’s own nature is Prajna, Bodhi or Consciousness. It is one’s Swarupa. This is us. Each one of us. This self-nature is not beyond. Hence, there is no journey. This is not lost. Hence there is no search. It is nothing new, as it is awareness of one’s self as oneself; hence there is no achievement. For this, there is no gate, for who can be there behind it? And where can one enter and which is the exit? It is not looking within, for there is nothing like “without” it. It is—we were unaware of it. We are aware and it is again.It is thus uncovering, removing the ignorance, a discovery. Whenever this happens, it is NOW-WHERE. In fact all languages become analogical and alogical in our attempt to state what it is and it always raises problems. The NOW-HERE is not to be reached, for it is the seeker-sans-seeker. It is Existence, it is Awareness. We are too full to know it. We must empty ourselves, to find ourselves FULL. We find what we had never lost. We have reached NOW-HERE without moving. Shri Pradhan’s book will be a good guide in this respect to all aspirants.",
  "genres": [
    "Philosophy"
  ],
  "author": "G.K. Pradhan",
  "average_rating": "4.51",
  "url": "https://www.goodreads.com/book/show/30632746-know-thy-self"
}