{
  "title": "Priddy’s Tale",
  "description": "What doesn’t kill you sometimes makes you wish it had…Priddy’s a lost soul in a part of Cornwall the tourists don’t get to see. He’s young, sweet-natured and gorgeous, but that’s not enough to achieve escape velocity from his deadbeat village and rotten family life.He’s a drifter and a dreamer, and self-preservation isn’t his strong suit. An accidental overdose of a nightclub high leaves him fractured, hallucinating, too many vital circuits fried to function in a tough world. When a friend offers him winter work in a lighthouse – nothing to do but press the occasional button and keep the windows clean – he gratefully accepts.His plans to live quietly and stay out of trouble don’t last very long. A ferocious Atlantic storm washes a stranger to Priddy’s lonely shore. For a shipwrecked sailor, the new arrival seems very composed. He’s also handsome as hell, debonair, and completely unconcerned by Priddy’s dreadful past.Priddy has almost given up on the prospect of any kind of friendship, and a new boyfriend – let alone a six-foot beauty with eerily good swimming skills – out of the question entirely. But Merou seems to see undreamed-of promise in Priddy, and when they hit the water together, Priddy has to adapt to Merou’s potentials too, and fast. His lover from the sea might be a mere mortal from the waist up, but south of that line…Far-flung west Cornwall has a hundred mermaid tales. Priddy’s loved the stories all his life. Now he has to face up to a wildly impossible truth. Merou’s life depends upon his courage and strength, and if Priddy can only find his way in the extraordinary world opening up all around him, all the ocean and a human lifetime needn’t be enough to contain the love between merman and mortal.",
  "genres": [
    "Fantasy",
    "M M Romance",
    "Romance",
    "Paranormal",
    "Audiobook",
    "LGBT",
    "Shapeshifters"
  ],
  "author": "Harper Fox",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/30635592-priddy-s-tale"
}