{
  "title": "An Outlaw and a Lady: A Memoir of Music, Life with Waylon, and the Faith that Brought me Home",
  "description": "Renowned songwriter, singer, and wife of Waylon Jennings writes an intimate, enormously entertaining memoir of American music, of life with Waylon and the Outlaws, and of faith lost and found.The daughter of a Pentecostal evangelist and a race-car driver, Jessi Colter played piano and sang in church before leaving Arizona to tour with rock-n-roll pioneer Duane Eddy, whom she married. Colter became a successful recording artist, appearing on American Bandstand and befriending stars such as the Everly Brothers and Chet Atkins, while her songs were recorded by Nancy Sinatra, Dottie West, and others. Her marriage to Eddy didn’t last, however, and in 1969 she married the electrifying Waylon Jennings. Together, they made their home in Nashville which in the 1970s, was ground zero for roots music, drawing Bob Dylan, Johnny Cash, Willie Nelson, Kris Kristofferson, Shel Silverstein, and others to the Nashville Sound. And Jessi was at the center of it all, the only woman on the landmark Wanted: The Outlaws album, the record that launched the Outlaw Country genre and was the first country album to go platinum. She also tasted personal commercial success with the #1-single “I’m Not Lisa.”But offstage, life was a challenge, as Waylon pursued his addictions and battled his demons. Having drifted from the church as a young woman, Jessi returned to her faith and found in it a source of strength in the turmoil of living with Waylon. In the 1980s, Waylon helped launch the super group The Highwaymen with Willie Nelson, Johnny Cash, and Kris Kristofferson, and the hits kept rolling, as did Waylon’s reckless living. Amid it all, Jessi faithfully prayed for her husband until finally, at Thanksgiving 2001, Waylon found Jesus, just months before he died. An Outlaw and a Lady is a powerful story of American music, of love in the midst of heartache, and of faith that sustains.",
  "genres": [
    "Music",
    "Memoir",
    "Nonfiction",
    "Biography",
    "Autobiography",
    "History",
    "Christian"
  ],
  "author": "Jessi Colter",
  "average_rating": "4.14",
  "url": "https://www.goodreads.com/book/show/30649407-an-outlaw-and-a-lady"
}