{
  "title": "Asharas Rückkehr",
  "description": "Zufällig kehrt Margaret Alton nach Darkover zurück, dem Planeten ihrer Geburt, den sie im Alter von sechs Jahren verließ. Die junge Musikwissenschaftlerin weiß nichts mehr von ihrer Kindheit oder den komplizierten Sitten ihrer Heimat. Es dauert nicht lange, bis Margaret -- oder Marguerida, wie sie die Einheimischen nennen -- von der Vergangenheit eingeholt wird. Nicht nur ist sie die Erbin der Domäne und wird in die Politik der Comyn verwickelt, sie verfügt auch über \"Laran\", die telepathische Begabung der Altons. Aber in ihrer Jugend wurde ihr Geist manipuliert und ihre Gabe unterdrückt, eine Gabe, die Marguerida jetzt umzubringen droht. Sie muss das Geheimnis der Vergangenheit lösen. Asharas Rückkehr ist zugleich die Rückkehr Marion Zimmer Bradleys (MZB) zu ihrer wohl bekanntesten Schöpfung, dem Planeten Darkover. Der Roman ist der Beginn des Marguerida-Alton-Zyklus, der sich aus drei Bänden zusammensetzt. Geschickt knüpft die Autorin an den Roman Sharras Exil an, in dem Margarets Vater Lew Alton eine wichtige Rolle spielte, und erzählt die Geschichte weiter. Die junge Frau, die fast ihr ganzes Leben in den Weiten des Terranischen Imperiums verbracht hat, wird auf Darkover mit ihrer Vergangenheit konfrontiert. Der Roman lebt von diesem Konflikt, und MZB stellt auf spannende und eindrucksvolle Weise dar, wie sich ihre Heldin notgedrungen mit ihrem Erbe auseinander setzen muss, ohne dabei ihre Identität zu verlieren. Diese deutsche Erstveröffentlichung führt nach einer langen Pause in diesem und den beiden noch folgenden Bänden die Geschichte Darkovers fort. Es ist ein gelungener Roman, der nicht nur für die Fans der Serie ungelöste Rätsel der Vergangenheit löst, sondern auch für neue Leser geeignet ist, die sich für das Werk der mittlerweile verstorbenen Autorin interessieren. --Andreas Decker",
  "genres": [
    "Fantasy",
    "Science Fiction",
    "Fiction",
    "Science Fiction Fantasy",
    "Romance",
    "Paranormal",
    "Sci Fi Fantasy"
  ],
  "author": "Marion Zimmer Bradley",
  "average_rating": "4.05",
  "url": "https://www.goodreads.com/book/show/3064905-asharas-r-ckkehr"
}