{
  "title": "The Simple Path to Wealth: Your road map to financial independence and a rich, free life",
  "description": "This book grew out of a series of letters to my daughter concerning various things - mostly about money and investing - she was not yet quite ready to hear.Since money is the single most powerful tool we have for navigating this complex world we've created, understanding it is critical.\"But Dad,\" she once said, \"I know money is important. I just don't want to spend my life thinking about it.\" This was eye-opening. I love this stuff. But most people have better things to do with their precious time. Bridges to build, diseases to cure, treaties to negotiate, mountains to climb, technologies to create, children to teach, businesses to run.Unfortunately, benign neglect of things financial leaves you open to the charlatans of the financial world. The people who make investing endlessly complex, because if it can be made complex it becomes more profitable for them, more expensive for us, and we are forced into their waiting arms.Here's an important truth: Complex investments exist only to profit those who create and sell them. Not only are they more costly to the investor, they are less effective.The simple approach I created for her and present now to you is not only easy to understand and implement, it is more powerful than any other.Together we'll explore:•Debt: why you must avoid it and what to do if you have it•The importance of having f-you money•How to think about money, and the unique way understanding this is key to building your wealth•Where traditional investing advice goes wrong and what actually works•What the stock market really is and how it really works•Why the stock market always goes up and why most people still lose money investing in it•How to invest in a raging bull or bear marketSpecific investments to implement these strategies•The Wealth Building and Wealth Preservation phases of your investing life and why they are not always tied to your age•How your asset allocation is tied to those phases and how to choose it•How to simplify the sometimes confusing world of 401(k), 403(b), TSP, IRA, and Roth accountsTRFs (target retirement funds), HSAs (health savings accounts), and RMDs (required minimum distributions)•What investment firm to use and why the one I recommend is so far superior to the competition•Why you should be very cautious when engaging an investment advisor and whether you need to at all•Why and how you can be conned, and how to avoid becoming prey•Why I don't recommend dollar cost averaging•What financial independence looks like and how to have your money support you•What the Four Percent Rule is and how to use it to safely spend your wealth•The truth behind Social Security•A case study on how this all can be implemented in real life",
  "genres": [
    "Finance",
    "Personal Finance",
    "Nonfiction",
    "Money",
    "Business",
    "Self Help",
    "Economics"
  ],
  "author": "JL Collins",
  "average_rating": "4.43",
  "url": "https://www.goodreads.com/book/show/30646587-the-simple-path-to-wealth"
}