{
  "title": "Batman: Nosferatu",
  "description": "Under Clarc and Lois' enlightened rule, Metropolis has begun to progress. However, some resist that progress, such as Dr. Arkham, the head of an asylum, who holds \"psychomantic\" seances for the entertainment of the depraved rich of Metropolis. The star of these is the \"Laughing Man\", a white-faced, murderous creature, a prototype cyborg built by Lutor from one of Arkham's patients. Many other patients in the asylum are also experiments of Lutor, driven mad by his work. When Eschevin Gordon tries to close Arkham down, the doctor sends the Laughing Man to kill him. Attorney Dirk Grayson becomes suspicious of Arkham, but he, too, is killed by the Laughing Man. Dirk's friend, Bruss Wayne, and their mutual love-interest Barbera Gordon, are then drawn to investigate Arkham, after being turned down by the police and apparently ignored by the Super-Man and Lois, who have greater concerns that require his attention.Wayne discovers Arkham is in league with the new Chancellor, Henderson, and that the two are manipulating the city's aristocrats via knowledge of their secrets and the shows in the cabinet. He also hears the two plotting to kill both himself and Barbera with the Laughing Man. But, during an attempted escape by the inmates in the asylum, he is captured and thrown into a great pit, at the bottom of which lie vast, sentient computers who once built Metropolis and still sustain it and watch over humanity. They turn Wayne into the \"Nosferatu\" and send him back to the city above.The Nosferatu saves Barbera and kills the Laughing Man, before attacking Arkham in his asylum. As he fights the orderlies, the inmates hail him as \"the Master.\" While confronting both Dr. Arkham and Henderson, the latter armed with a gun scavenged from Lutor's old lair and powered by the green stone taken from Lutor's chest, the Super-Man appears to investigate at Wayne-son's behest and is wounded by the weapon before the Nosferatu hurls Hender-son from the tower.He is then confronted by the Superman, who believes there is no place for creatures of shadow in his city of light, while the Nosferatu calls him naïve and claims the inmates as his responsibility. They fight, eventually falling down into the underworld. Their battle is inconclusive, with each mortally wounding the other. However, the ancient machines reveal themselves to the Superman and he realizes that there can be no light without shadows. The Nosferatu's job is to catch these shadows. The machines restore both combatants, and the Superman accepts his control over the dark. Bruss Wayne ends up in charge of the asylum where Arkham is now a prisoner, trying to convince anyone who will listen that the new director is the Nosferatu.",
  "genres": [
    "Comics",
    "Batman",
    "Dc Comics",
    "Graphic Novels",
    "Horror",
    "Vampires",
    "Superheroes"
  ],
  "author": "Jean-Marc Lofficier",
  "average_rating": "3.19",
  "url": "https://www.goodreads.com/book/show/1190903.Batman"
}