{
  "title": "An Amish Home",
  "description": "A Cup Half Full\n by Beth Wiseman—Sarah Lantz always dreamed of the perfect home, the perfect husband, the perfect family. When she married Abram, she knew she was on her way to securing her perfect life. All of that changes in one moment when an accident leaves her unable to walk and confined to a wheelchair, dashing all of her dreams. As Abram starts to transform their home, Sarah begins a transformation in her spirit, and she begins, once again, to see her cup as half full.\nHome Sweet Home\n by Amy Clipston—Down on their luck and desperate after they are evicted from their small apartment, Chace and Mia O’Conner reluctantly take Chace’s Amish boss up on his offer to rent them the daadihaus located on his property. They are certain they will never feel at home in the rustic cabin without any modern conveniences, and they start to blame each other for their seemingly hopeless situation. But with the help of their new Amish friends, Chace and Mia begin to enjoy their cozy cabin and realize that home really is where the heart is.\nBuilding Faith\n by Kathleen Fuller—Faith Miller knows that carpentry is an unlikely hobby for a young Amish woman, but she loves the work and it keeps the memory of her grandfather alive. So when her cousin asks Faith to build the cabinets in her new home, Faith is only too happy to take on the job, even if it is the most ambitious project she has ever taken on. The only catch is that she has to work with her ex-fiance, Silas. As they work to build Martha’s kitchen, can they put the past behind them and start to build faith in one another again?\nA Flicker of Hope\n by Ruth Reid—Fifteen years ago, Thomas and Noreen King were blissful newlyweds. Young, naive, and in love, life was rosy . . . for a while. Then trials and tribulations rocked their foundation, shattering them emotionally, and soon, their marriage was in shards. All hope for restoring their previously unshakable union seems lost. When fire destroys their home, Thomas and Noreen are left to sift through the rubble. As uncovered items from the remains of the house shake loose memories of the past, Thomas and Noreen begin to draw closer and a flicker of hope—and love—is re-ignited.",
  "genres": [
    "Amish",
    "Christian Fiction",
    "Amish Fiction",
    "Romance",
    "Fiction",
    "Christian",
    "Contemporary"
  ],
  "author": "Beth Wiseman",
  "average_rating": "4.32",
  "url": "https://www.goodreads.com/book/show/30649385-an-amish-home"
}