{
  "title": "From Darkness to Dynasty: The First 40 Years of the New England Patriots",
  "description": "Love them or hate them, what the New England Patriots have been able to do over the past fifteen years is nothing short of remarkable. In addition to their four Super Bowl championships, the Patriots have the best coach in the league, a smart and savvy front office, and a future Hall of Fame quarterback who is internationally recognized as the face of the NFL. The longer the Patriots continue to dominate on the field as well as in the media and the American pop culture landscape, the harder it becomes for anyone to remember them as something other than a model franchise and the ultimate paradigm of success and accomplishment.Anyone, that is, except for Jerry Thornton. It wasn’t always sunshine and roses for the Patriots; in fact, for the bulk of their existence, it was exactly the opposite. Though difficult to fathom now, the New England Patriots of old weren’t just bad—they were laughably bad. Not so long ago, the Pats were the laughingstock of not only the NFL but also the entire sporting world.From Darkness to Dynasty tells the unlikely history of the New England Patriots as it has never been told before. From their humble beginnings as a team bought with rainy-day money by a man who had no idea what he was doing to the fateful season that saw them win their first Super Bowl, Jerry Thornton shares the wild, humiliating, unbelievable, and wonderful stories that comprised the first forty years of what would ultimately become the most dominant franchise in NFL history.Witty, hilarious, and brutally honest, From Darkness to Dynasty returns to the thrilling, perilous days of yesteryear—a welcome corrective for those who hate the Patriots and a useful reminder for those who love them that all glory is fleeting.",
  "genres": [
    "Sports",
    "Football",
    "Nonfiction",
    "History",
    "Audiobook"
  ],
  "author": "Jerry Thornton",
  "average_rating": "4.42",
  "url": "https://www.goodreads.com/book/show/30645112-from-darkness-to-dynasty"
}