{
  "title": "Black Detroit: A People's History of Self-Determination",
  "description": "NAACP 2017 Image Award Finalist2018 Michigan Notable Books honoreeThe author of Baldwin’s Harlem looks at the evolving culture, politics, economics, and spiritual life of Detroit—a blend of memoir, love letter, history, and clear-eyed reportage that explores the city’s past, present, and future and its significance to the African American legacy and the nation’s fabric.Herb Boyd moved to Detroit in 1943, as race riots were engulfing the city. Though he did not grasp their full significance at the time, this critical moment would be one of many he witnessed that would mold his political activism and exposed a city restless for change. In Black Detroit, he reflects on his life and this landmark place, in search of understanding why Detroit is a special place for black people.Boyd reveals how Black Detroiters were prominent in the city’s historic, groundbreaking union movement and—when given an opportunity—were among the tireless workers who made the automobile industry the center of American industry. Well paying jobs on assembly lines allowed working class Black Detroiters to ascend to the middle class and achieve financial stability, an accomplishment not often attainable in other industries.Boyd makes clear that while many of these middle-class jobs have disappeared, decimating the population and hitting blacks hardest, Detroit survives thanks to the emergence of companies such as Shinola—which represent the strength of the Motor City and and its continued importance to the country. He also brings into focus the major figures who have defined and shaped Detroit, including William Lambert, the great abolitionist, Berry Gordy, the founder of Motown, Coleman Young, the city’s first black mayor, diva songstress Aretha Franklin, Malcolm X, and Ralphe Bunche, winner of the Nobel Peace Prize.With a stunning eye for detail and passion for Detroit, Boyd celebrates the music, manufacturing, politics, and culture that make it an American original.",
  "genres": [
    "History",
    "Nonfiction",
    "Race",
    "African American",
    "Politics",
    "Urban Studies",
    "Social Justice"
  ],
  "author": "Herb Boyd",
  "average_rating": "3.76",
  "url": "https://www.goodreads.com/book/show/30653851-black-detroit"
}