{
  "title": "Drowned Tomb",
  "description": "War is coming. The summer heat is sweltering, and the young changeling, Robin Fellows, awaits further training. He has gained much skill in the Shard of Air, but what is coming next? After his previous tutor was revealed to be an agent of the mortal enemy of all Fae, Lady Eris, Robin is assigned a new mentor to continue his magical learning. Enter Calypso, a water nymph and member of the race of Panthea that also inhabit the mysterious, enchanted Netherworlde. Her job: to instruct Robin in the Shard of Water, a powerful magic with which the user can cast huge bolts of ice and command entire oceans to bear down his or her will. But all is not well at Erlking Hall, and war is fast approaching the Netherworlde. More agents of Lady Eris are in pursuit of young Robin, the Scion of the Arcania and last Changeling in the world. They’re out for the Shard of Water as well. And they’ll stop at nothing to find it, no matter who gets in their way… What follows is a spellbinding journey, as Robin and company navigate once more the enchanting and at times terrifying Netherworlde. The Drowned Tomb is the mesmerizing second instalment of James Fahy’s bestselling Changeling series. Perfect for fans of High Fantasy storytelling and fae mythology, this sequel to Isle of Winds is a must have. James lives in the North of England, close to wild moors and adjacent to a haunted wind farm, with his extremely patient and long-suffering family and a very old cat named Gargoyle. When the cat dies, James plans to buy a raven and name it Quoth. He is the author of the Changeling fantasy series, following the adventures of Robin, a seemingly unremarkable boy who is swept up into a war between our world, and the Netherworlde, a shadowy realm which lies beyond our own. In addition to fantasy, James also writes Science Fiction, Urban Gothic and Steampunk, for people old enough to know better.",
  "genres": [
    "Fantasy",
    "Young Adult",
    "Magic",
    "Fiction"
  ],
  "author": "James Fahy",
  "average_rating": "4.45",
  "url": "https://www.goodreads.com/book/show/30656121-drowned-tomb"
}