{
  "title": "Glowing Genes: A Revolution In Biotechnology",
  "description": "Marc Zimmer has written the first popular science book on an amazing new area of biotechnology that will help fight cancer, create new products, improve agriculture, and combat terrorism. For more than one hundred and sixty million years, green fluorescent protein has existed in one species of jellyfish. In 1994 it was cloned, giving rise to a host of useful and potentially revolutionary applications in biotechnology. Today researchers are using this ancient glowing protein to pursue exciting new discoveries, from tracking the process of bacterial infection to detecting chemical and biological agents planted by terrorists.A recognized expert in this field, Zimmer begins with an overview of the many uses of these glowing genes to kill and image cancer cells, monitor bacterial infections, and light up in the presence of pollution. He then discusses the biological reasons that glowing proteins first evolved in jellyfish and fireflies, and looks at the history of bioluminescence and the dedicated scientists who devoted their careers to explaining this phenomenon. The story of how \"glowing genes\" were located, cloned, and then mass-produced is in itself a fascinating tale.Zimmer next turns to the serious, and not-so-serious, uses of fluorescent proteins. In agriculture it may soon be possible to produce crops that signal dryness by glowing. In industry a red fluorescent protein originally found in corals may find a use in sheep as a substitute for environmentally harmful wool dyes.Furthermore, the glowing gene revolution has led to significantly more humane treatment of laboratory animals. No longer must animal lives be sacrificed to understand disease processes; now researchers can observe the spread of cancer and infections by treating animals with green fluorescent genes and similar proteins.In the fight against terrorism a glowing gene has been created that lights up in the presence of anthrax spores, chemical warfare agents, and landmines. And in a completely different arena, we have already seen the emergence of \"transgenic art\" in Alba, the fluorescent bunny rabbit.Glowing Genes is a highly informative, fascinating, and entertaining read about a burgeoning area of biotechnology that promises soon to revolutionize our world.",
  "genres": [
    "Genetics",
    "Science",
    "Nonfiction"
  ],
  "author": "Marc Zimmer",
  "average_rating": "3.55",
  "url": "https://www.goodreads.com/book/show/1190972.Glowing_Genes"
}