{
  "title": "Firebrand",
  "description": "Zachary Davriel Hillander, High King of Sacoridia, rues how much he has had to give up to lead his realm, including the freedom to live and love as he chooses. When an embassy from Eletia arrives to propose a joint venture between their realms to seek out an old ally in the north, he is dismayed to learn that the one Sacoridian they have in mind to accompany their guide is the woman he truly loves but cannot have: Green Rider Karigan G'ladheon.Karigan has only just returned from a dark future where Sacoridia has been conquered and is ruled by a despotic emperor, and she has not recovered in heart or mind. As if that is not enough, the castle ghosts won't leave her alone. Though Zachary is loath to part from her so soon after her return, he knows she is the best choice to undertake the mission to the north.Each step on their journey places Karigan and her companions closer to enemy territory and danger, for northward lie the forces of Second Empire, Sacoridia's longtime foe, and Grandmother, the necromantic leader of Second Empire, has not been idle. She uses her magic to summon a wild elemental spirit to wreak havoc upon Zachary and his wife, Queen Estora.At first the Sacoridians succeed in fending off the creature, but it so covets Estora that it can't stay away. It abducts Zachary, assuming his form and his place at Estora's side--but when it is finally ousted, Zachary is still missing. Estora, alone and heavy with twins, must prepare her realm for the coming conflict from the confines of her bedchamber.Meanwhile, the danger only deepens for Karigan and her companions as they journey north. When she finds herself caught in the midst of a clash between forces, Karigan must rescue and protect her king before she falls into a trap set by Grandmother--a trap that could give Second Empire the power to control the dead and all the demons of the hells.",
  "genres": [
    "Fantasy",
    "Fiction",
    "High Fantasy",
    "Magic",
    "Epic Fantasy",
    "Adventure",
    "Audiobook"
  ],
  "author": "Kristen Britain",
  "average_rating": "4.30",
  "url": "https://www.goodreads.com/book/show/30688516-firebrand"
}