{
  "title": "Daddy's Gone A-Hunting",
  "description": "Robert Skinner has written three books in a series that takes place during the Depression in New Orleans. He selected the Depression because of stories family members told him about living during that time and how it affected them. To him, \"\"the '30s represent America's last romantic age.' Even so he is cognizant of how difficult this time period was for those at the low end of the economic spectrum.Because his books are hard-boiled, protagonist Wesley Farrell had to be an outsider. So Skinner made Farrell a black man passing for white, something that was unacceptable in New Orleans at the time. In the first book of the series, SKIN DEEP, BLOOD RED, the reader learns about his deception in the denouement. But Farrell continues to hide his race from almost everyone. He wants to help other blacks, but he also fears losing everything he has.Farrell is a gambler and bon vivant. He gets involved in a very complex series of problems partly because he is depressed. Savanna Bealieu, the woman he would like to love, has left for California, and Farrell goes looking for trouble to put her out of his mind. He lives on the \"\"borderland between the respectable and the criminal.' He responds to cries for help but there is violence at the core of his soul and he is ambivalent about his race. Outwardly comfortable in both the black and white worlds, he is, in reality, uncertain about where he wants to be. He dreams of marrying Savanna, but knows he would lose everything if he did. So the violence of New Orleans suits him just fine.First a prominent black businessman is murdered and then a man who has served 10 years in prison for armed robbery returns to town. The situation grows morecomplicated as another black businessman disappears and the black owner of a club asks Farrell to help him fend off a gangster who wants to take it over. There are several subplots in this book which all come together in an electrifying climax.",
  "genres": [
    "Mystery"
  ],
  "author": "Robert Skinner",
  "average_rating": "3.56",
  "url": "https://www.goodreads.com/book/show/3066500-daddy-s-gone-a-hunting"
}