{
  "title": "She Needed Me",
  "description": "Walter Kirn \"should be sentenced to a lifetime writing fiction,\" proclaimed The New York Times Book Review about his short story collection, My Hard Bargain. The Christian Science-Monitor praised his \"engaging blend of deadpan humor and genuine empathy\"; \"Thankfully,\" said The Philadelphia Inquirer, \"Kirn never abandons his theme of uncertainty when observing modern angst.\" Now Walter Kirn has fashioned She Needed Me, a moving, surprising, and darkly comic novel whose sympathetic portrait of a disillusioned generation is mercifully uncynical. Weaver Walquist and Kim Lindgren first meet outside a St. Paul, Minnesota, abortion clinic. Kim - twenty-three, pregnant, with no money to finish junior college - is about to walk inside. Weaver is lying in front of the door. At twenty-six, he is a Bible-carrying member of the Conscience Squad, a fanatical right-wing protest group...yet readers of all minds will be drawn to this gentle, questing soul as he struggles with his feelings for Kim and his subsequent sexual desire for her; his crumbling devotion to the church; and his waning loyalty to his employer, Sanipure, a Christian soap and cosmetics company that calls sales \"fellowship moments.\" But Weaver was not always devout. The only child of a widowed, highly successful Wisconsin liquor store owner, he tried to ward off teenage isolation with a mixture of pot and pills, vodka, sex and heavy metal music, until born-again Christian Lucas Boone found him half dead on the floor of a Greyhound station men's room. As Weaver tries to persuade Kim to have her baby, they embark upon a journey that brings them into contact with a cast of keenly drawn characters: Chuck and Dixie Lindgren, Kim's parents, who made more money in one hot Las Vegas weekend than they ever earned from their North Dakota farm; charismatic, paranoid Lucas Boone, popping anti-depressant pills like candy; Kim's disaffected brother, Ricky, who makes a modest living burglarizing his relatives' homes; and fin",
  "genres": [
    "Fiction"
  ],
  "author": "Walter Kirn",
  "average_rating": "3.39",
  "url": "https://www.goodreads.com/book/show/30682.She_Needed_Me"
}