{
  "title": "Thin Is the New Happy",
  "description": "“Val Frankel is a woman of amazing insight. . . . Read this, weep, and heal.” —Stacy London, cohost of What Not to Wear You’ve heard the phrase “the mirror is not your friend.” For Valerie Frankel, the mirror was so much more than “not a friend.” It was the mean girl who stole her lunch money, bitch-slapped her in the ladies’ room, and cut the hair off her Barbie. If you’re like 99.9 percent of women, the war you wage with yourself over your body image begins at the ripe age of eight, and the skirmishes are fought for the next eight decades. Sometimes you don’t even know when you’ve won. (How many of us have taken out a photo from high school and thought, “Hey! I looked great—why didn’t I know it?”) This book is for anyone who has spent most of her life on—or thinking about being on—a diet. It’s for anyone who ever wished for candlelight in dressing rooms. It’s for anyone who has ever owned a pair of “fat pants.” In short, this book is for anyone who ever felt good or bad about themselves based on how they look. Valerie Frankel, like most women, has spent most of her conscious life on a diet, thinking about a diet, ignoring a diet, or failing on a diet. At age eleven, her mother put Val on her first weight-loss program. As a teen, she was enrolled in Weight Watchers (for which she invented creative ditching methods). As a young woman, her world felt right only when she was able to zip a certain pair of jeans. Not wanting to pass this legacy on to her own daughters, Valerie set out to cleanse herself of her obsession. Thin Is the New Happy is the true story of one woman’s quest to exorcise her bad body-image demons, to uncover the truths behind what put them there, and to learn how to truly love herself. It’s a poignant, hilarious, and all-out honest account of one woman’s struggle with body image—the filter through which she’s always seen the world—and the way she ultimately overcame it.",
  "genres": [
    "Memoir",
    "Nonfiction",
    "Chick Lit",
    "Biography",
    "Health",
    "Humor",
    "Biography Memoir"
  ],
  "author": "Valerie Frankel",
  "average_rating": "3.30",
  "url": "https://www.goodreads.com/book/show/3066636-thin-is-the-new-happy"
}