{
  "title": "Untangling My Chopsticks: A Culinary Sojourn in Kyoto",
  "description": "Two years out of college and with a degree from Le Cordon Bleu in Paris, Victoria Riccardi left a boyfriend, a rent-controlled New York City apartment, and a plum job in advertising to move to Kyoto to study kaiseki , the exquisitely refined form of cooking that accompanies the formal Japanese tea ceremony. She arrived in Kyoto, a city she had dreamed about but never seen, with two bags, an open-ended plane ticket, and the ability to speak only sushi-bar Japanese. She left a year later, having learned the language, the art of kaiseki, and what was truly important to her.Through special introductions and personal favors, Victoria was able to attend one of Kyoto’s most prestigious tea schools, where this ago-old Japanese art has been preserved for generations and where she was taken under the wing of an American expatriate who became her mentor in the highly choreographed rituals of this extraordinary culinary discipline.During her year in Kyoto, Victoria explored the mysterious and rarefied world of tea kaiseki, living a life inaccessible to most foreigners. She also discovered the beguiling realm of modern-day Japanese food—the restaurants, specialty shops, and supermarkets. She participated in many fast-disappearing culinary customs, including making mochi (chewy rice cakes) by hand, a beloved family ritual barely surviving in a mechanized age. She celebrated the annual cleansing rites of New Year’s, donning an elaborate kimono and obi for a thirty-four-course extravaganza. She includes twenty-five recipes for favorite dishes she encountered, such as Chicken and Egg Rice Bowl, Japanese Beef and Vegetable Hotpot, and Green-Tea Cooked Salmon Over Rice.Untangling My Chopsticks is a sumptuous journey into the tastes, traditions, and exotic undercurrents of Japan. It is also a coming-of-age tale steeped in history and ancient customs, a thoughtful meditation on life, love, and learning in another land.",
  "genres": [
    "Japan",
    "Food",
    "Travel",
    "Nonfiction",
    "Memoir",
    "Foodie",
    "Cooking"
  ],
  "author": "Victoria Abbott Riccardi",
  "average_rating": "3.70",
  "url": "https://www.goodreads.com/book/show/306776.Untangling_My_Chopsticks"
}