{
  "title": "Blood & Rust",
  "description": "Butler’s quest for redemption collides with Tania’s gutsy revolutionOnce upon a time Butler and Tania hated each other\"Jerk!\"\"Ice queen!\"Now in their 40s, they both return to their hometown for a second chance at self-respect and a new life. And what simmers between them is nothing less than shockingHonesty and real friendship? YeahHot attraction? Overwhelming, unfortunatelyActual emotions? Dammit, how did this happen?For all their determination, Butler and Tania's timing is alllll wrong. Yet through it all, an undeniable, red hot passion blazes between them that they both know isOnceInALifetimeBut Meager, South Dakota has become a minefield of risky choices and deep regrets. Bold ambitions and dark secrets between rival motorcycle clubs explode one by one throwing Tania and Butler onto an outlaw battlefield.Will their worlds be torn apart or will their newfound trust and deep feelings for each other bond them before it’s too late?* Blood & Rust is a second chance, enemies to friends to lovers tale! * - Butler -\"The bad boy.The fuck up.The thief.That was me.Once a king,Now a wanderer.I’d thrown the best parts of me away, over and over again.I was reckless.Still am.I’d been exiled.Twice.I did my time.I’ve cleaned up.Well, sort of.I got plans.Yeah, good ones.Then I ran into her.A bolt of lightningStartlingUnsettlingBreathtakingAnd so out of reach.The woman I once scorned years agois now the woman I can’t stop thinking about, dreaming about.I need what I didn’t think I’d ever need again.I want and want and want. And it’s torture.Now she’s the epicenter of the war I’ve triggered,and the battle in my rusted heart.I may be as reckless as I ever was,but I’m determined as f*ck.To hell with it.I want it all.\"1 - Lock & Key2 - Random & Rare3 - Iron & Bone4 - Blood & RustSeries spinoff - FuryThe Lock & Key series is a 4 book motorcycle club romance saga with hot alpha anti-heroes. These romantic suspense / romantic adventure / small town romance / biker romance / second chance romance / women's fiction novels contain adult language, sex, violence and are intended for mature audiences.",
  "genres": [
    "Romance",
    "Contemporary Romance",
    "Audiobook",
    "Dark",
    "Romantic Suspense",
    "Contemporary",
    "Dark Romance"
  ],
  "author": "Cat Porter",
  "average_rating": "4.39",
  "url": "https://www.goodreads.com/book/show/30699642-blood-rust"
}