{
  "title": "Giving It All",
  "description": "Christi Barth’s smoking-hot contemporary romance series continues as the five best friends who survived a tragedy as teenagers take to their Naked Men podcast to open up about women. In Giving It All, the group’s globe-trotting hunk discovers that you need to go home to find love.   Logan Marsh never stays in one place for long. Through his family’s foundation, Logan spends his days traveling to the world’s most dangerous places to deliver disaster relief, which really puts a damper on his sex life—until he reconnects with his high-school crush. Stranded together in the Caribbean, they enjoy a steamy fling that awakens feelings Logan has ignored for too long. But family drama calls him away from her sweet embrace . . . or so he thinks.   Brooke Gallagher loved being a home economics teacher and cheerleading coach. Then an unexpected tragedy forced her to take some time off. Now she’s back in D.C. and despite the intensity of her tropical encounter with Logan, she’s shocked to bump into him again. Logan’s dealing with his own issues (including a newly discovered half-sister) and he’s itching to get back on the road. More than anything, Brooke wants to be there for him. But first, he has to decide if love is enough to keep him in one place.   Praise for Christi Barth’s Risking It All \n \n “The perfect escapist read—sweet and sexy, with an ending that will remind you of all the reasons you love romance.”—USA Today bestselling author Lauren Layne   “Smart, sexy, and flat-out fun, Risking It All is one story readers will have a hard time putting down. Christi Barth’s heroes will make you laugh, sigh, and swoon—what could be better?”—USA Today bestselling author Kimberly Kincaid  “Barth writes the perfect blend of humor, pathos, and romance.”—Library Journal   Includes a special message from the editor, as well as an excerpt from another Loveswept title.",
  "genres": [
    "Romance",
    "Contemporary",
    "Contemporary Romance",
    "Friends To Lovers",
    "Fiction",
    "Adult"
  ],
  "author": "Christi Barth",
  "average_rating": "4.12",
  "url": "https://www.goodreads.com/book/show/30737699-giving-it-all"
}