{
  "title": "Jerry's Passion",
  "description": "The first time Jerry saw Kylie, he was taken by her beauty and innocence, but he stayed away because she was too young. A member of the Insurgents MC, Jerry’s life revolves around the club, his Harley, and easy sex. Women clamor for the rugged, tatted outlaw’s attention, and he obliges, but his sights are set on the pretty, young blonde who is all grown up now—sweet curves and all….  Kylie fills his thoughts, and he dreams of his fingers tangling in her glossy hair, her legs wrapping tightly around his waist, her full lips quivering as she comes.  Only problem is he can’t have her.  But… he can’t stop himself from craving her, and if he acts, it’ll surely cost him everything. His resistance is waning….  Kylie McDaniels is the pretty daughter of Banger—President of the Insurgents MC. She grew up in the outlaw biker world, but her father shielded her from the dark side of it, and she still has an innocence he prefers she keep. Banger is very protective of his daughter, and he’s made up his mind that she won’t fall in love with a biker, especially Jerry.  She’d listen to her father, but the hot, muscular biker makes her want to do some not so innocent things.  Her insides melt, and her brain turns to mush whenever he looks at her with his hungry, brown eyes.  Damn. Why does he have to be so sexy?  As Kylie maneuvers her budding sexuality and attraction to Jerry while trying to stay on the good side of her dad, someone is out there watching her, waiting to make his move. He’s come for retribution, and Kylie is the pawn in his scheme. Will Jerry be able to stop the madman before he strikes?  Can their forbidden love survive the chaos of the world around them?  The Insurgents MC series are standalone romance novels. This is Jerry and Kylie’s love story. This book contains violence, sexual assault (not graphic), strong language, and steamy/graphic sexual scenes. It describes the life and actions of an outlaw motorcycle club. If any of these issues offend you, please do not read the book. HEA. No cliffhangers! The book is intended for readers over the age of 18.",
  "genres": [
    "Romance",
    "Dark",
    "Suspense",
    "Contemporary",
    "Erotica",
    "Contemporary Romance",
    "College"
  ],
  "author": "Chiah Wilder",
  "average_rating": "4.34",
  "url": "https://www.goodreads.com/book/show/30734324-jerry-s-passion"
}