{
  "title": "Story of L",
  "description": "\"This book has heart. Readers will be drawn into the story, immersed in Liv’s journey. The story feels real with rich description and straight-forward narrative.\" --Guilty Indulgence Book Club (5 Chocolate-Dipped Strawberries- A Definite Good Read)Liv called her hunger The Void. She thought she knew it - and herself.Until a night with Cassandra silenced it. And brought out something in Liv she didn't think submission.One taste of that, and Liv wanted more.But Cassandra isn't an easy dominant. She expects Liv to earn her way into her good graces. And her demands aren't simple.How many hurdles will Liv need to jump before she can kneel before Cassandra? Before Cassandra chooses to claim her? Just what will it take to become Cassandra's \"L?\" And will the outcome be all she hopes for - and needs?Find out in a timeless tale, retold. Find out in Story of L.\"You get the sense that Debra has truly done her homework, and that she has a true passion for the characters and the lifestyle. Physically and emotionally satisfying, this is definitely a story worth exploring.♥ \" --Bibary Book LustLOOKING FOR MORE… in BDSM? Check out these painfully good titles from Ravenous Romance!LOVE ME TENDER by Marsha PhilitasAn anthology for those who prefer a gift of chains from their sweetheart to a dozen roses, and who and say, \"I love you,\" with a full-throttle spanking. LOVE ME TENDER is the anthology for the romantic in every BDSM master or mistress!SPANKALICIOUS by D.L. KingWant a little more sting to your swing? Check out SPANKALICIOUS, a spanking anthology so good it hurts!POWER AN ANTHOLOGY by Jamaica LayneThere's nothing sexier than power, and nothing more powerful than politics. Explore all the ways to swing your vote in these 12 stories of sex and politics!BLIND SEDUCTION by Debra HydeLeslie expected to slip in to something sweet and silky on her 10th anniversary weekend; instead, her husband decides he likes her better in a blindfold, chastity belt, and handcuffs. Will this couple's experimental weekend renew their vows and their sex life? Or will a full dose of bondage and discipline go more than just skin-deep?MASTERING THE MARCHIONESS by EM BrownVale Montressor Aubrey, the Marquess of Dunnesford, meets an unlikely partner at Madam Botreaux's Cavern of Pleasures--his wife. As he dons his mask, he uncovers hers, and it's a side he's not sure he can handle. Will he be able to tame her to his will before an unsuspected danger takes them both?",
  "genres": [
    "BDSM",
    "Erotica",
    "Romance",
    "Lesbian",
    "Queer",
    "LGBT",
    "Lesbian Fiction"
  ],
  "author": "Debra Hyde",
  "average_rating": "3.58",
  "url": "https://www.goodreads.com/book/show/11913721-story-of-l"
}