{
  "title": "Sandcastle and Other Stories",
  "description": "“Pardon my French, but you are one darn major American writer!”—Richard Bach The twelve literary, suspense tales and dark vignettes collected in Sandcastle and Other Stories are nothing short of an adventure through a roiling sea of emotion. You’ll listen as an old man twisted by fate and a lost love shares his life’s journey . . . marvel at a young girl playing on the ocean shore as she becomes entangled in nets of a mercurial god . . . witness a divorced man become mired in troubles after he's coerced into taking a singles cruise . . . follow a Hollywood actor in a television drama who’s always typecast as the bad boy . . . struggle along with a child kept awake by night terrors, and, most shockingly, observe a woman who hides her secretive personality from everyone on the beach one sunny day. The genuine voices of the characters, mixed with a clear-eyed tonal directness, make this a series with mesmerizing psychological interaction. Sandcastle and Other Stories spans a broad depth of human understanding and builds a bridge between the deepest chasms of human frailty, and, by the last tale, the highest portal of redemption. Read and stand witness to unspeakable hate sitting with cozy wile, right beside unconditional love—a provocative and compelling mirror on the human condition. “Bog has a keen eye for what makes people tick, especially when their clockwork is decidedly rusty and the urges it drives are less than ideal. These stories take a microscopic view at the ordinary that, in turn, molds it into something uncanny. The underlying darkness takes different forms with each one, but never is it absent, and never does it feel anything less than utterly natural.”—Josh Black, horror novel reviews",
  "genres": [
    "Short Stories",
    "Fiction",
    "Anthologies"
  ],
  "author": "Justin Bog",
  "average_rating": "4.36",
  "url": "https://www.goodreads.com/book/show/30738644-sandcastle-and-other-stories"
}