{
  "title": "The Bourbon Series #1-4",
  "description": "Meghan Quinn has put together her beloved Bourbon Series (Jett Girl Series) in a box set for HALF THE PRICE. And as a bonus, you will also receive \"Repentance\" the spin-off novel that portrays Kace Haywood's story. **BOOK ONE - Becoming a Jett Girl**How did I start the Lafayette Club? Well, I’m in the business of saving tarnished souls. I hand pick girls from the street who have no options left in life and give them an opportunity they can’t possibly refuse. They come to work in the Lafayette Club which is full of EXQUISITE DEBAUCHERY, where influential men come to conduct business and lap dances are considered a fine art. The girls are trained, they are morphed, they are educated, they follow the rules of the club and they know to submit to me. They live by my motto, no relationships, no love, just sex. They are never touched, only by me, they are never completely naked, only with me, and their personas are entirely anonymous. The only person who knows who they truly are, is me, Jett Colby. If these girls were ever seen on the streets of New Orleans, you would never know they were a Jett Girl**BOOK TWO - Being a Jett Girl**How did I become a Jett Girl? Hell if I know, one moment I’m working at the premiere spot for creepy men and sloppy drunks and the next, I’m being whisked away by a moody ex-boxer and a mysterious man in a suit that overlooks his girls from the third floor of the Lafayette Club. It wasn’t easy but now that I’m a Jett Girl, there is only one thing on my mind and that is Jett Colby. He has captured me, stolen my heart and entwined my soul into his at such an alarming rate that it seems almost difficult to breathe without him holding me, touching me, kissing me... He won’t give me his heart though, he won’t let me own every last inch of him and not because he doesn’t want to, but because he doesn’t want to jeopardize my ambiguity. Because of this, there is only one thing standing in my way when it comes to completely and utterly living my life with Jett Colby and it’s called Lot 17.**BOOK THREE - Forever a Jett Girl**Justice. Faith. Power The words I live my life by, the three keys to my success, the foundation I built my entire empire on and now Goldie holds them all in the palm of her hands. She once was a Jett Girl, a piece of me, a safety net I grew to depend on. She once was mine…heart, body and soul. But now she’s gone. I fell for a girl I should have left alone. I let her consume my life, control my feelings and own every aspect of my being. I tried to keep her, to make her see what she was doing to me, to clue her in that breathing was impossible without her around. But she ran, she gave up and she returned the one thing that claimed her as mine, she gave me back her collar. This is the story of a desperate man who lost everything that ever mattered to him… my little one.**BONUS SPIN OFF - Repentance: The Story of Kace Haywood**Every choice you make in life comes with a consequence, which dictates the outcome of your future. I was once on top, I was living the life I dreamt of, I had everything I could possibly hope for. I was happy, satisfied, content…until one night. One off day. One moment in time I wish I could take back. My biggest regret.",
  "genres": [],
  "author": "Meghan Quinn",
  "average_rating": "4.44",
  "url": "https://www.goodreads.com/book/show/30735753-the-bourbon-series-1-4"
}