{
  "title": "Virgin",
  "description": "*Each book in the \"A Real Man\" series stand on their own. The only thing connecting each book in the series is they feature real men claiming their women.*She will be the only one he’ll ever want.He was the first boy she fell in love with.QuinnI met Isabel when I was ten.I fell in love with her before I even knew what that meant.I knew from the moment I saw her she was it for me. No one else compared to her, and I’d do anything to make her mine. But I was afraid of losing the friendship we have, so I've kept my mouth shut.But she's leaving me, and I know I can't keep how I feel inside any longer.Saving myself for the girl I loved isn't a hardship, but something I'm proud of. When it comes to Isabel giving her my virginity, and making her see we belong together, is all that matters.IsabelQuinn is like the other half of my soul, the one person I can talk to about anything. He has the bad boy thing going on but is also respectful as much as he is a rebel.He is the first and only boy I will ever love.Being forced to move across the country, and leave him behind is like leaving a piece of myself in the process. But telling Quinn, I am madly in love with him could put a strain on our friendship. I didn’t know if that’s something I can handle or risk.QuinnNothing can keep me from Isabel. She is it for me, and I mean that in every conceivable way. Nothing can keep me from her. I hope she's ready because there isn't anything or anyone that will stop me from having her as mine.Warning: This story is quick and dirty, and filled with a virgin hero that wants his heroine to be his one and only. It's drama-free and has insta-everything going on, so be prepared to have an overload of sugary virgin goodness.",
  "genres": [
    "Romance",
    "Friends To Lovers",
    "Novella",
    "Erotica",
    "Contemporary",
    "Contemporary Romance",
    "New Adult"
  ],
  "author": "Jenika Snow",
  "average_rating": "3.62",
  "url": "https://www.goodreads.com/book/show/30738664-virgin"
}