{
  "title": "Gertrude and Toby Save the Gingerbread Man",
  "description": "Farmer Sam and his son Ryan are taking their prize pig to the county fair. Gertrude and Toby decide they have plenty of time to sneak off the farm for an extra adventure. But Gertrude and Toby soon discover that a giant has captured their friend, the Gingerbread Man! Gertrude and Toby come up with a plan to save him. But the giant, who is sleeping nearby, wakes up during their rescue!Book 2 in the Gertrude and Toby fairy tale adventure book seriesFrom the Publisher:Gertrude and Toby Save the Gingerbread Man is an exciting adventure story for children who are transitioning from beginning readers to chapter books. This is the perfect book for the child who has been tasked with the usual 30-minutes-per-night reading homework. From the standpoint of reading progression, this title fills a specific niche that represents a gap in the children's book market--longer illustrated children's books that are more complex and challenging than typical picture books.Gertrude and Toby Save the Gingerbread Man is also a fairy-tale adaptation. Many of the characters in Gertrude and Toby Save the Gingerbread Man are traditional fairy-tale characters and will be immediately recognizable to most young readers. These characters include Hansel and Gretel, a flying carpet, an evil witch, the giant and the magic vine from Jack and the Beanstalk, and of course, the Gingerbread Man. The presence of these fairy-tale characters adds familiarity for young readers and keeps alive the old tales (e.g., those by the Brothers Grimm) that we have all come to know and love.The first and third books in the series, Gertrude and Toby s Friday Adventure and Gertrude and Toby Meet the Wolf, follow the same approach of adapting fairy-tale tropes using fairy-tale characters in a contemporary setting. These modern stories have more complex plots and wording than those of standard picture books, but without the daunting word count of typical beginning chapter books.We hope you love Gertrude and Toby and their series of adventure books as much as we do. Happy reading!",
  "genres": [
    "Childrens",
    "Picture Books",
    "Adventure"
  ],
  "author": "Shari Tharp",
  "average_rating": "4.41",
  "url": "https://www.goodreads.com/book/show/30752315-gertrude-and-toby-save-the-gingerbread-man"
}