{
  "title": "The Black Wolves of Boston",
  "description": "Book One in a new saga by the Romantic Times Sapphire award winning author of the Internationally Best-Selling Elfhome series.REBUILD A LIFE, SAVE A CITY Silas Decker had his world destroyed when he was attacked by vampires outside of New Amsterdam. He rebuilt his life a dozen times in the last three hundred years—each time less and less successfully. Now he lives alone, buried under a hoarding habit, struggling to find some reason to wake up with the setting of the sun. Eloise is a Virtue, pledged to hunting evil.  What she doesn’t know is how to live alone in a city full of strangers who know nothing about monsters. Seth is the sixteen-year old Prince of Boston, ward of the Wolf King.  Now he is left in a city that desperately needs his protection with enemies gathering all around.  Joshua believes he is a normal, college-bound high school senior.  His life is shattered when he wakes up in a field, covered with blood, and the prom committee scattered in pieces about him like broken dolls.   These four must now come together to unravel a plot by Wickers, witches who gain power from human sacrifices and have the power to turn any human into their puppet. Four people who lost everything struggle to save Boston by saving each other.About Wen Spencer's Elfhome series: “Spencer's intertwining of current Earth technology and otherworldly elven magic is quite ingenious.” —Booklist \"The melange of science fiction and fantasy tropes, starships rubbing shoulders with proud elf warriors, is uncommon but tasty. Established fans will enjoy this installment, and those unfamiliar with the series or Spencer may find it an intriguing introduction to her work.\"—Publishers WeeklyAbout Wen Spencer: “Wit and intelligence inform this off-beat, tongue-in-cheek fantasy. . . . Furious action . . . good characterization, playful eroticism and well-developed folklore. . . . lift this well above the fantasy average. . . . Buffy fans should find a lot to like in the book's resourceful heroine.”—Publishers Weekly on series debut Tinker  About Wen Spencer's Eight Million Gods:Eight Million Gods is a wonderfully weird romp through Japanese mythology, culture shock, fan culture and the ability to write your own happy ending. It is diverting and entertaining fantasy.\"—Galveston County Daily News",
  "genres": [
    "Fantasy",
    "Urban Fantasy",
    "Fiction",
    "Vampires",
    "Werewolves",
    "Paranormal",
    "Horror"
  ],
  "author": "Wen Spencer",
  "average_rating": "4.29",
  "url": "https://www.goodreads.com/book/show/30753493-the-black-wolves-of-boston"
}