{
  "title": "The Totally Unscientific Study of the Search for Human Happiness",
  "description": "“A remarkable journey. I laughed. I cried. I got another cat.”  —Lily Tomlin“Paula Poundstone is the funniest human being I have ever known.” —Peter Sagal, host of Wait Wait . . . Don’t Tell Me! and author of The Book of Vice“Is there a secret to happiness?” asks comedian Paula Poundstone. \"I don’t know how or why anyone would keep it a secret. It seems rather cruel, really . . . Where could  it be? Is it deceptively simple? Does it melt at a certain temperature? Can you buy it? Must you suffer for it before or after?” In her wildly and wisely observed book, the comedy legend takes on that most inalienable of rights—the pursuit of happiness.Offering herself up as a human guinea pig in a series of thoroughly unscientific experiments, Poundstone tries out a different get-happy hypothesis in each chapter of her data-driven search. She gets in shape with taekwondo. She drives fast behind the wheel of a Lamborghini. She communes with nature while camping with her daughter, and commits to getting her house organized (twice!). Swing dancing? Meditation? Volunteering? Does any of it bring her happiness? You may be laughing too hard to care.  The Totally Unscientific Study of the Search for Human Happiness is both a story of jumping into new experiences with both feet and a surprisingly poignant tale of a single working mother of three children (not to mention dozens of cats, a dog, a bearded dragon lizard, a lop-eared bunny, and one ant left from her ant farm) who is just trying to keep smiling while living a busy life.The queen of the skepticism-fueled rant, Paula Poundstone stands alone in her talent for bursting bubbles and slaying sacred cows.Like George Carlin, Steve Martin, and David Sedaris, she is a master of her craft, and her comedic brilliance is served up in abundance in this book. As author and humorist Roy Blount Jr. notes, “Paula Poundstone deserves to be happy. Nobody deserves to be this funny.”",
  "genres": [
    "Humor",
    "Nonfiction",
    "Audiobook",
    "Memoir",
    "Self Help",
    "Comedy",
    "Biography"
  ],
  "author": "Paula Poundstone",
  "average_rating": "3.70",
  "url": "https://www.goodreads.com/book/show/30753999-the-totally-unscientific-study-of-the-search-for-human-happiness"
}