{
  "title": "Temporary People",
  "description": "Winner of The Restless Books Prize for New Immigrant WritingWinner of The Hindu PrizeBest Books of 2017: Booklist, Kirkus, San Francisco Chronicle\"Guest workers of the United Arab Emirates embody multiple worlds and identities and long for home in a fantastical debut work of fiction, winner of the inaugural Restless Books Prize for New Immigrant Writing.… An enchanting, unparalleled anthem of displacement and repatriation.\" —Kirkus Reviews, Starred ReviewIn the United Arab Emirates, foreign nationals constitute over 80 percent of the population. Brought in to construct and serve the towering monuments to wealth that punctuate the skylines of Abu Dhabi and Dubai, this labor force is not given the option of citizenship. Some ride their luck to good fortune. Others suffer different fates. Until now, the humanitarian crisis of the so-called “guest workers” of the Gulf has barely been addressed in fiction. With his stunning, mind-altering debut novel Temporary People, Deepak Unnikrishnan delves into their histories, myths, struggles, and triumphs. Combining the linguistic invention of Salman Rushdie and the satirical vision of George Saunders, Unnikrishnan presents twenty-eight linked stories that careen from construction workers who shapeshift into luggage and escape a labor camp, to a woman who stitches back together the bodies of those who’ve fallen from buildings in progress, to a man who grows ideal workers designed to live twelve years and then perish—until they don’t, and found a rebel community in the desert. With this polyphony of voices, Unnikrishnan maps a new, unruly global English and gives personhood back to the anonymous workers of the Gulf.",
  "genres": [
    "Short Stories",
    "Fiction",
    "Magical Realism",
    "Asia",
    "Contemporary",
    "India",
    "Adult"
  ],
  "author": "Deepak Unnikrishnan",
  "average_rating": "3.44",
  "url": "https://www.goodreads.com/book/show/30753477-temporary-people"
}