{
  "title": "Traveling with Ghosts: A Memoir",
  "description": "From grief to reckoning to reflection to solace, a marine biologist shares the solo journey she took—through war-ravaged Eastern Europe, Israel, and beyond—to find peace after her fiancé suffered a fatal attack by a box jellyfish in Thailand.In the summer of 2002, Shannon Leone Fowler, a twenty-eight-year-old marine biologist, was backpacking with her fiancé and love of her life, Sean. Sean was a tall, blue-eyed, warmhearted Australian, and he and Shannon planned to return to Australia after their excursion to Koh Pha Ngan, Thailand. Their plans, however, were devastatingly derailed when a box jellyfish—the most venomous animal in the world—wrapped around Sean’s leg, stinging and killing him in a matter of minutes as Shannon helplessly watched. Rejecting the Thai authorities attempt to label Sean’s death a “drunk drowning,” Shannon ferried his body home to his stunned family—a family to which she suddenly no longer belonged.Shattered and untethered, Shannon’s life paused indefinitely so that she could travel around the world to find healing. Travel had forged her relationship with Sean, and she hoped it could also aid in processing his death. Though Sean wasn’t with Shannon, he was everywhere she went—among the places she visited were Oświęcim, Poland (the site of Auschwitz); war-torn Israel; shelled-out Bosnia; poverty-stricken Romania; and finally to Barcelona, where she first met Sean years before. Ultimately, Shannon had to confront the ocean after her life’s first great love took her second great love away.Cheryl Strayed’s Wild meets Helen Macdonald’s H Is for Hawk in this beautiful, profoundly moving memorial to those we have lost on our journeys and the unexpected ways their presence echoes in all places—and voyages—big and small.",
  "genres": [
    "Memoir",
    "Nonfiction",
    "Travel",
    "Grief",
    "Biography Memoir",
    "Death",
    "Biography"
  ],
  "author": "Shannon Leone Fowler",
  "average_rating": "4.02",
  "url": "https://www.goodreads.com/book/show/30753783-traveling-with-ghosts"
}