{
  "title": "The Good at Heart",
  "description": "Based on the author’s discoveries about her great-grandfather, this stunning debut novel takes place over three days when World War II comes to the doorstep of an ordinary German family living in an idyllic, rural village near the Swiss border.When World War II breaks out, Edith and Oskar Eberhardt move their family—their daughter, Marina; son-in-law, Franz; and their granddaughters—out of Berlin and into a small house in the quiet town of Blumental, near Switzerland. A member of Hitler’s cabinet, Oskar is gone most of the time, and Franz begins fighting in the war, so the women of the house are left to their quiet lives in the picturesque village.But life in Blumental isn’t as idyllic as it appears. An egotistical Nazi captain terrorizes the citizens he’s assigned to protect. Neighbors spy on each other. Some mysteriously disappear. Marina has a lover who also has close ties to her family and the government. Thinking none of them share her hatred of the Reich, she joins a Protestant priest smuggling Jewish refugees over the nearby Swiss border. The latest “package” is two Polish girls who’ve lost the rest of their family, and against her better judgment, Marina finds she must hide them in the Eberhardt’s cellar. Everything is set to go smoothly until Oskar comes home with the news that the Führer will be visiting the area for a concert, and he will be making a house call on the Eberhardts.Based on the author’s discoveries about her great-grandfather, this extraordinary debut, full of love, tragedy, and suspense, is a sensitive portrait of a family torn between doing their duty for their country and doing what’s right for their country, and especially for those they love.",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "World War II",
    "Historical",
    "War",
    "Adult Fiction",
    "Adult"
  ],
  "author": "Ursula Werner",
  "average_rating": "3.79",
  "url": "https://www.goodreads.com/book/show/30753683-the-good-at-heart"
}