{
  "title": "Unraveled by You",
  "description": "Rafaela Valenti is a beautiful, brilliantly talented violinist who comes home one evening from a concert to find the woman who raised her brutally murdered in a violent home invasion. In the days that follow, there are more attempted break-ins. She finds herself being followed late one night after a musical engagement. Unhappy with the police department's handling of the case, her aunt and uncle convince her to hire a professional investigator.  Husband and wife team, Mackenzie Doyle and Jack Quinn (Indomitable Heart) operate a successful private security and investigtion firm that hires ex Force Recon Marines who have served under the unique command of Nick Kelly (Waiting...On You). Like Trace Tanner (If Not for You), they have all been honorably discharged after being seriously wounded. These battle-hardened warriors are exactly the people D/Q needs to get the job done.  After the loss of his hand and leg, Gabriel Harper struggles with the changes he must make in his life.He is despondent and anchorless until his friends and family direct him toward the bionic limb replacement project that the VA and Defense Department's DARPA program are conducting. The former intelligence officer finds new purpose in volunteering to test the lastest advancements in prosthetics.  As D/Q's newest investigator, he is assigned to protect Rafaela. He arrives on her doorstep only to discover that she is the woman he has been crossing paths with on the bus for weeks. He's done nothing more than watch the extraordinary Italian beauty. He has mentally labeled her the Ice Queen. Despite his fascination wih her, he has reminded himself that beautiful women are nothing but trouble.  To his surprise, the real Rafaela shatters his initial misconceptions. Besides being shy and awkwardly uncomfortable in social situations, she is also sitting on a family secret that makes her extremely vulnerable. Though neither of them know what it is, someone else does, and they want back inside the San Diego home in the worst way to find it.  Aided by his friends at D/Q, Gabe must unravel a complicated family history that has been buried for fifteen years and mostly kept from his client for her own protection. The puzzling case resurrects the violent death of Rafaela's parents and the the scandal that nearly cost the family their business. Even more frightening, it prompts the reappearance of deadly foes.  Digging up the details and protecting Rafaela becomes more than a job for Gabe. His professional detachment is destroyed by a woman who fascinates him ways he never expected. She sees past his challenges, and he encourages her to step onto center stage. The chemistry that sizzles between them may have no future, though, if Gabe cannot meet a desperate adversary's final demand.",
  "genres": [],
  "author": "S.A. Monk",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/30747167-unraveled-by-you"
}