{
  "title": "Capturing Pixie",
  "description": "\"Pic of you now, in three minutes. Wherever you are,\" - John Martz How far would you be willing to go for love? \"Capturing Pixie\" unveils an unprecedented window into an explosive Dominant/Submissive relationship between Chelle Mueller, a fiery retired computer engineer and Dr. John Martz, a mild mannered psychologist, and the husband of her online friend Lesa. From its unlikely inception through a brief Facebook message until the devastating implosion three months later, the \"Daddy After Dark\" series chronicles a personal journey into the fringes of human sexuality Never has a memoir series offered such an uncensored look at an alternative intimate relationship. Built around the actual chat logs and emails, volume one of the Daddy After Dark series, \"Capturing Pixie,\" follows the development of an emotionally consuming BDSM bond. After weeks of friendly emails, chats and phone conversations, the virtual relationship between Dr. Martz and Chelle Mueller takes a sudden turn into uncharted territory as \"Daddy\" and his \"Pixie Girl\" tumble down an emotional avalanche of mutual need. As his grip on the mind of \"Pixie\" tightens the worlds of Dr. Martz, an unassuming, straight laced, psychologist by day and passionate Daddy Dom by night, collide in an internal war over his deepest nature. \"What are you? Who are you? I keep peeking around the corners, trying to get a glimpse that will tell me.\" - Chelle Mueller Interspersed with narratives through the eyes of Chelle Mueller, the chat sessions provide a neutral vantage point to pose serious questions about the nature of alternative relationships online, the boundaries of consent, and the growing power of social medium as a platform for human bonding. Recommended for adult audiences due to graphic language, adult situations and relationships, and explicit sexual content.",
  "genres": [],
  "author": "Chelle Mueller",
  "average_rating": "3.50",
  "url": "https://www.goodreads.com/book/show/30748469-capturing-pixie"
}