{
  "title": "Three Minutes to Doomsday: An Agent, a Traitor, and the Worst Espionage Breach in U.S. History",
  "description": "An intense cat-and-mouse game played between two brilliant men in the last days of the Cold War, this shocking insider’s story shows how a massive giveaway of secret war plans and nuclear secrets threatened America with annihilation.In 1988 Joe Navarro, one of the youngest agents ever hired by the FBI, was dividing his time between SWAT assignments, flying air reconnaissance, and working counter-intelligence. But his real expertise was “reading” body language. He possessed an uncanny ability to glean the thoughts of those he interrogated.So it was that, on a routine assignment to interview a “person of interest”—a former American soldier named Rod Ramsay—Navarro noticed his interviewee’s hand trembling slightly when he was asked about another soldier who had recently been arrested in Germany on suspicion of espionage. That thin lead was enough for the FBI agent to insist to his bosses that an investigation be opened.What followed is unique in the annals of espionage detection—a two-year-long battle of wits. The dueling an FBI agent who couldn’t overtly tip to his target that he suspected him of wrongdoing lest he clam up, and a traitor whose weakness was the enjoyment he derived from sparring with his inquisitor. Navarro’s job was made even more difficult by his adversary’s not only did Ramsay possess an authentic photographic memory as well as the second highest IQ ever recorded by the US Army, he was bored by people who couldn’t match his erudition. To ensure that the information flow would continue, Navarro had to pre-choreograph every interview, becoming a chess master plotting twenty moves in advance.And the backdrop to this mental tug of war was the dissolution of the Soviet Union and the very real possibility that its leaders, in a last bid to alter the course of history, might launch a devastating attack. If they did, they would have Ramsay to thank, because as Navarro would learn over the course of forty-two mind-bending interviews, Ramsay had, by his stunning intelligence giveaways, handed the Soviets the ability to utterly destroy the US.The story of a determined hero who pushed himself to jaw-dropping levels of exhaustion and who rallied his team to expose undreamed of vulnerabilities in America’s defense, Three Minutes to Doomsday will leave the reader with disturbing thoughts of the risks the country takes even today with its most protected national secrets.",
  "genres": [
    "Nonfiction",
    "History",
    "True Crime",
    "Espionage",
    "Audiobook",
    "Military Fiction",
    "Crime"
  ],
  "author": "Joe Navarro",
  "average_rating": "4.02",
  "url": "https://www.goodreads.com/book/show/30753744-three-minutes-to-doomsday"
}