{
  "title": "Rebel Mother: My Childhood Chasing the Revolution",
  "description": "“Thoroughly engrossing” — The New York Times Book Review“Luminous” — Publishers Weekly (starred review)“Those who enjoyed Jeannette Walls’s The Glass Castle will find much to admire here.” — Booklist (starred review)The intimate true story of a boy on the run with his mother, as she abducts him to South America in search of the revolution.Carol Andreas was a traditional 1950s housewife from a small Mennonite town in central Kansas who became a radical feminist and Marxist revolutionary. From the late sixties to the early eighties, she went through multiple husbands and countless lovers while living in three states and five countries. She took her youngest son, Peter, with her wherever she went, even kidnapping him and running off to South America after his straitlaced father won a long and bitter custody fight.They were chasing the revolution together, though the more they chased it the more distant it became. They battled the bad “isms” (sexism, imperialism, capitalism, fascism, consumerism), and fought for the good “isms” (feminism, socialism, communism, egalitarianism). They were constantly running, moving, hiding. Between the ages of five and eleven, Peter attended more than a dozen schools and lived in more than a dozen homes, moving from the comfortably bland suburbs of Detroit to a hippie commune in Berkeley to a socialist collective farm in pre-military coup Chile to highland villages and coastal shantytowns in Peru. When they secretly returned to America they settled down clandestinely in Denver, where his mother changed her name to hide from his father.This is an extraordinary account of a deep mother-son bond and the joy and toll of growing up with a radical mother in a radical age. Andreas is an insightful and candid narrator whose unforgettable memoir gives new meaning to the old saying, “the personal is political.”",
  "genres": [
    "Memoir",
    "Nonfiction",
    "Biography Memoir",
    "History",
    "Politics",
    "The United States Of America",
    "Book Club"
  ],
  "author": "Peter Andreas",
  "average_rating": "4.07",
  "url": "https://www.goodreads.com/book/show/30753747-rebel-mother"
}