{
  "title": "Origins Of The Magdon: Vercovicium: Volume 1",
  "description": "Welcome to the world we have forgotten. A place where the myths of history that have been omitted from history still linger in the shadows. I challenge you to dare and enter the darkness, tread along forgotten paths for I promise they lead to a world of adventure. Introducing the “Origins Of” The Magdon Series. A collection of five novelette length stories charting the key events in the life of Archy who at the age of sixteen is thrust upon a path of adventure, discovery and excitement. Book 1 “Vercovicium” takes place at Hadrian's Wall, Summer 1911. Archy is given the chance to spend his summer at the excavation of a Roman Fort called Vercovicium. One fateful day Archy stumbles across a buried tomb. Braving the dark Archy sets off in exploration and discovers a long forgotten part of history. The events of that summer open a new adventure to Archy that will change him forever. Although short in length these episodic instalments focus on Archy in a way that makes the story accessible across all levels of reading. Aimed at 8+ readers, it is my hope that these stories can be ones that encourage a sense of adventure in future generations and rekindle that same sense in adults too. By limiting the length to between 10,000-12,000 words I hope that each story will slowly develop upon the mythology of The Magdon and also create a story that everyone can immerse themselves in and enjoy. These stories were born from a white-lie I told my own children and whilst it would be easy to create a full length novel from the premise I wanted to ensure the story could reach all ages, all imaginations and all levels. Every story, when separated, will give you a little more insight into the shadowy depths of forgotten beasts and lay the foundation of a bigger world. The story grows with the reader and with the main character Archy. My hope is that each instalment will offer you just enough to feel satisfied but leave you wanting more as I pick five key events of Archy’s life from the tie he first rediscovers The Magdon, aged sixteen, until his inevitable test some twenty-one years later. To find out more you may want to visit the official author gmsfootprints.wixsite.com/tobeyalexander Or else visit the official Facebook site facebook.com/TheMagdon Thank you for trusting your imagination into my hands and rest assured The Magdon myth has a lot more in store beyond Archy’s adventures.",
  "genres": [],
  "author": "Tobey Alexander",
  "average_rating": "4.44",
  "url": "https://www.goodreads.com/book/show/30747658-origins-of-the-magdon"
}