{
  "title": "The Ghost Ship",
  "description": "What if you could go back to 1921 and climb aboard a great five-masted schooner on her maiden voyage?You’d be a witness to history; you’d be on her decks when her keel smashed into an Outer Banks shoal. You’d get to know the villains who caused the tragedy. Was it pirates, Russians, rumrunners? Or something else?Would you dare?Ann Gavrion did and her life was never the same.The history:One cold, foggy morning in January, 1921, a five-masted schooner in full sail plowed into Diamond Shoal in the infamous Graveyard of the Atlantic. Known to history as The Ghost Ship, her officers and crew were not on board and their bodies never washed ashore. The only living thing on board was a six-toed cat. Also, her anchors and lifeboats were missing. Six agencies investigated the mystery, but it was never solved.The novel:Ninety years later, Ann Gavrion travels to Cape Hatteras to get over the loss of her fiancé in an airplane crash. She meets the enigmatic, yet charming, Lawrence Curator on the beach.Behind her she hears the cries of villagers. “Shipwreck!”A surfman runs up and shouts that the missing schooner, her sails set, is aground on the shoal. Ann recognizes the enormous ship from a photograph she’d seen the night before.So begins her journey back to 1921 with the man the Navy sent to investigate the grounding of the great ship.When Lawrence and Ann solve the mystery, Ann must return to her world. On the very beach where she’d begun her voyage with Lawrence, she meets his great-grandson, Rod. Exhausted, wet, she spills an account of her fabulous sea adventure. He calls her a charlatan and accuses her of using his famous ancestor to write a first person account of the tragedy for her magazine. How many times, how many ways, must she prove that her voyage was real to Rod and the unbelievers of the world?",
  "genres": [
    "Paranormal",
    "Fiction",
    "Romance",
    "Mystery",
    "Fantasy",
    "Historical",
    "Science Fiction"
  ],
  "author": "Gerrie Ferris Finger",
  "average_rating": "3.50",
  "url": "https://www.goodreads.com/book/show/11914833-the-ghost-ship"
}