{
  "title": "Ice Rift",
  "description": "Humans have always looked to the stars for signs of Extraterrestrials. They have been looking in the wrong place. They are already here, entombed in a spaceship beneath Antarctic ice for thousands of years. The ice is melting and they will soon be free. A huge rift in the ice is discovered in Antarctica that stretches for 18 miles, (29 km) and 820 feet (250 meters) apart at its widest point. When environmental scientists enter the ice rift to check out an anomaly on NASA's satellite scans of the area, they discover something far more life threatening than the raging blizzard trapping them in the rift. They are unarmed and unprepared for their ensuing fight for survival. Though Ice Rift - Salvage, is a continuation of the story from Ice Rift, it was brought about by readers feedback saying they would like to read a follow on book. Ice Rift can be read as a complete story. There is no cliffhanger or abrupt ending. Ice Rift plot  Action Adventure Survival Horror Science fiction First Contact Aliens Spacecraft Exploration First  \"An exciting adrenaline rush that rarely lets you stop for a breather.\" \"The story quickly draws you in and refuses to let go until the last page. An excellent adventure set in Antarctica. 10/10.\" \"The imaginative mind of the author has produced a thrilling action adventure horror filled with atmosphere and claustrophobic locations. I dreaded each time the characters opened another door. Highly enjoyable read.\" \"Atmospheric locations and a cleverly written plot full of surprises. Richard was my favourite character. It was easy to imagine myself exploring the spacecraft with them. I liked the way the scientists had no weapons to defend themselves with, but had to rely on their wits to survive. It made a change from the usual gung-ho hero machinegun killing scenarios.\"",
  "genres": [
    "Horror",
    "Science Fiction",
    "Thriller",
    "Aliens",
    "Monsters",
    "Fiction",
    "Adventure"
  ],
  "author": "Ben Hammott",
  "average_rating": "3.79",
  "url": "https://www.goodreads.com/book/show/30761689-ice-rift"
}