{
  "title": "The Warden's Daughter",
  "description": "From Newbery Medalist Jerry Spinelli (Maniac Magee, Stargirl) comes the \"moving and memorable\" (Kirkus Reviews, starred) story of a girl searching for happiness inside the walls of a prison.   Cammie O'Reilly lives at the Hancock County Prison--not as a prisoner, she's the warden's daughter. She spends the mornings hanging out with shoplifters and reformed arsonists in the women's excercise yard, which gives Cammie a certain cache with her school friends.But even though Cammie's free to leave the prison, she's still stuck. And sad, and really mad. Her mother died saving her from harm when she was just a baby. You wouldn't think you could miss something you never had, but on the eve of her thirteenth birthday, the thing Cammie most wants is a mom. A prison might not be the best place to search for a mother, but Cammie is determined and she's willing to work with what she's got.\"Jerry Spinelli again proves why he's the king of storytellers\" (Shelf Awarenss, starred) in this tale of a girl who learns that heroes can come in surprising disguises, and that even if we don't always get what we want, sometimes we really do get what we need.\"This book is never boring and never predictable. Fame, good and bad fortune, friendship and mental illness all make their way into [Cammie's] narrative.\"--The New York Times Book ReviewPraise for the works of Jerry \"Spinelli is a poet of the prepubescent. . . . No writer guides his young characters, and his readers, past these pitfalls and challenges and toward their futures with more compassion.\" --The New York Times\"It's almost unreal how much the children's book still resonates.\" --Bustle.com on Maniac Magee",
  "genres": [
    "Historical Fiction",
    "Middle Grade",
    "Fiction",
    "Young Adult",
    "Realistic Fiction",
    "Family",
    "Juvenile"
  ],
  "author": "Jerry Spinelli",
  "average_rating": "3.69",
  "url": "https://www.goodreads.com/book/show/30760299-the-warden-s-daughter"
}