{
  "title": "The Arbitrator",
  "description": "“Was there a pang of remorse for his actions in his mind? Possibly, but what choice did he have? If he wanted to survive, he had no room for weakness. Max Nowaz’s science fiction novel, The Arbitrator, follows the story of 153 year-old Jim Brown, a former highly successful administrator who is now rotting in jail, for tax fraud. However, in reality, he is there for taking revenge and killing several people on the planet Levita, after meeting the beautiful Narissa... In prison, he has acquired a drug habit, which is killing him slowly and his only chance of survival is a very expensive renewal process, which will make him young again and cure his drug habit. After ten years in jail, he is suddenly given a reprieve and offered a chance to redeem himself. He is sent as the ‘Arbitrator’ to ‘Pirrus’ in another solar system, to try and stop a rebellion and bring matters under control. Will he complete the mission successfully to earn enough funds for his regeneration? Only time will tell. This novel tries to portray realistically, the darker side of colonisation, where a population is ruthlessly exploited in the guise of bringing them civilisation. Brown, a well-oiled cog in such a system prides himself on being ruthlessly efficient in his tyrannical task of keeping the population down, has a change of heart after meeting Gina, a girl he uses as his plaything.He then slowly embarks on a path of self-emancipation in trying to better the lot of the people under his charge. He is not only up against his own government, the EPA, but also against other forces trying to overthrow him. He also discovers a plot by some external powers trying to invade the planet and is hurled into an epic adventure in a game of survival.This novel may not be everybody's cup of tea, because of its complex political undertones as it tries to show the insidious underbelly of an autocratic form of colonisation, though it can be enjoyed simply as a great Sci-Fi adventure story.",
  "genres": [
    "Science Fiction",
    "Fiction",
    "Space Opera",
    "Novels",
    "Science Fiction Fantasy",
    "Space",
    "Adventure"
  ],
  "author": "Max Nowaz",
  "average_rating": "4.25",
  "url": "https://www.goodreads.com/book/show/30760409-the-arbitrator"
}