{
  "title": "100 Things Successful People Do: Little Exercises for Successful Living",
  "description": "Do you have what it takes to succeed in life, in work and in your relationships?100 Things Successful People Do is a guidebook to achieving success in any aspect of your life. 'Inspiring and practical' Marshall Goldsmith, bestselling author of TRIGGERSThis is your guide to realizing your dreams, from the large and audacious to the small and mundane.100 Things Successful People Do is packed with great ideas for working smart and living well, all carefully chosen to help you achieve any kind of success you can imagine. You will discover the habits that are common to successful people and find out how to use them in your own life.Every chapter features a new idea that will help you get closer to your goals. Mixing simple descriptions with activities and exercises, you will learn the optimal mindset and habits you need to succeed in work and life.100 Things Successful People Do is your guide to successful living.'Inside these pages you'll find a powerful reminder of the many ways you can make your life - and other people's lives - more successful. It will help you identify what success means to you and give you the building blocks for making that success a reality. This is your chance to overcome whatever obstacles are stopping you. Read it, act on it and experience the difference' From the Foreword by MARSHALL GOLDSMITH PH.D., bestselling author of TRIGGERSYou will discover the habits that are common to successful people and find out how to adopt them into your own life so that you can be successful too. Mixing simple instructions with activities to get you started, whether you are looking to succeed in your family life, at work, in sports, at school or in retirement, you will find, mindsets, habits and techniques here that will help you get the results you want.",
  "genres": [
    "Self Help",
    "Nonfiction",
    "Personal Development",
    "Psychology",
    "Business",
    "Productivity",
    "Philosophy"
  ],
  "author": "Nigel Cumberland",
  "average_rating": "3.88",
  "url": "https://www.goodreads.com/book/show/30762282-100-things-successful-people-do"
}