{
  "title": "American Prometheus: The Triumph and Tragedy of J. Robert Oppenheimer",
  "description": "American Prometheus is the 1st full biography of J. Rbt Oppenheimer, \"father of the atomic bomb,\" the charismatic physicist who led the effort to capture the sun's fire for his country in time of war. Immediately after Hiroshima, he became the most famous scientist of his generation-one of the iconic figures of the 20th century, an embodiment of modern man confronting the consequences of scientific progress. He was author of a radical proposal to place internat'l controls over atomic materials-an idea still relevant. He opposed development of the hydrogen bomb & criticized the USAF's plans for nuclear war. In the hysteria of the early 50s, his ideas were anathema to powerful advocates of a massive nuclear buildup, &, in response, Atomic Energy Commission chairman Lewis Strauss, Hbomb advocate Edward Teller & FBI director J. Edgar Hoover worked behind the scenes to have a hearing board decide he couldn't be trusted with nuclear secrets. American Prometheus details his life & times. Exhaustively researched, it's based on thousands of records & letters gathered from archives in America & abroad, on FBI files & on almost a hundred interviews with friends, relatives & colleagues. We follow him from his education at the turn of the 20th century at NY's Ethical Culture School, thru personal crises at Harvard & Cambridge. Then to Germany, where he studied quantum physics with the world's most accomplished theorists; & to Berkeley, where he established, during the 30s, the leading US school of theoretical physics, & where he became deeply involved with social justice causes & their advocates, many of whom were communists. Then to Los Alamos, where he transformed a bleak mesa into earth's most potent nuclear weapons lab-& where he himself was transformed. Finally, to the Institute for Advanced Study in Princeton, which he directed from '47 to '66. This book is an evocation of America at midcentury, a portrait of a brilliant, ambitious, complex & flawed man profoundly connected to its major events-the Depression, WWII & the Cold War. Both biography & history, it's essential for understanding the recent past & future choices.",
  "genres": [
    "Biography",
    "History",
    "Nonfiction",
    "Science",
    "Audiobook",
    "Politics",
    "Biography Memoir"
  ],
  "author": "Kai Bird",
  "average_rating": "4.32",
  "url": "https://www.goodreads.com/book/show/30756922-american-prometheus"
}