{
  "title": "Mark of the Dragon",
  "description": "Mark of the Dragon is the conclusion of Robert Stanek's multilayered epic fantasy adventure begun with Keeper Martin's Tale, continued with Kingdom Alliance, and last told in Fields of Honor. In his acclaimed Keeper Martin's Tale, he introduced us to the story of Ruin Mist, an extraordinary world of magic, adventure and intrigue. Now in the eagerly awaited follow-up to Fields of Honor, he once again proves himself a wonderful storyteller with a gift for fast pacing and believable storylines.Already hailed as a classic, Robert Stanek's powerful series has been enjoyed by readers all over the world. The Elves of the Reaches returned from exile, bringing grave news. War came to the Kingdoms. Many perished in the turmoil and unrest. An attempt was made to kidnap a princess and assassinate a king. Now, from the ancient past a dark power returns. \"The Fourth Wind blows across the mountain tops,\" they say. The Twelve Clans emerge from myth and memory.As prophecy becomes reality, the factions struggle for control, only to further divide the lands. Some would say that King Andrew Alder foolishly agreed to support the Elves of the Reaches, sending men to aid their cause when the causes of all Men in all lands were being put to the test of steel. And in the North, men back their words with action. Against a backdrop of treachery and intrigue, murder and mayhem, the price of free will is high. Many will pay with their lives. Many will succumb to imprisonment and enslavement. When alliances shatter, old hatreds rise anew and the plotting and scheming begin. Bold, inventive, brilliantly imagined, Mark of the Dragon is a novel of magic and wonder-a tale of pure excitement you will not soon forget. The official reading order of the Ruin Mist Chronicles is Keeper Martin's Tale, Kingdom Alliance, Fields of Honor, and Mark of the Dragon. Elf Queen's Quest is the first Ruin Dark Path story--an alternate version of the story.",
  "genres": [
    "Fantasy"
  ],
  "author": "Robert Stanek",
  "average_rating": "2.69",
  "url": "https://www.goodreads.com/book/show/1002620.Mark_of_the_Dragon"
}