{
  "title": "Six-Legged Soldiers: Using Insects as Weapons of War",
  "description": "The emir of Bukhara used assassin bugs to eat away the flesh of his prisoners. General Ishii Shiro during World War II released hundreds of millions of infected insects across China, ultimately causing more deaths than the atomic bombs dropped on Japan. These are just two of many startling examples found in Six-legged Soldiers , a brilliant portrait of the many weirdly creative, truly frightening, and ultimately powerful ways in which insects have been used as weapons of war, terror, and torture.Beginning in prehistoric times and building toward a near and disturbing future, the reader is taken on a journey of innovation and depravity. Award-winning science writer Jeffrey A. Lockwood begins with the development of \"bee bombs\" in the ancient world and explores the role of insect-borne disease in changing the course of major battles, ranging from Napoleon's military campaigns to the trenches of World War I. He explores the horrific programs of insect warfare during World War II: airplanes dropping plague-infested fleas, facilities rearing tens of millions of hungry beetles to destroy crops, and prison camps staffed by doctors testing disease-carrying lice on inmates. The Cold War saw secret government operations involving the mass release of specially developed strains of mosquitoes on an unsuspecting American public--along with the alleged use of disease-carrying and crop-eating pests against North Korea and Cuba. Lockwood reveals how easy it would be to use ofinsects in warfare and terrorism today: In 1989, domestic ecoterrorists extorted government officials and wreaked economic and political havoc by threatening to release the notorious Medfly into California's crops.A remarkable story of human ingenuity--and brutality-- Six-Legged Soldiers is the first comprehensive look at the use of insects as weapons of war, from ancient times to the present day.",
  "genres": [
    "History",
    "Nonfiction",
    "Science",
    "Military History",
    "Biology",
    "Animals",
    "Natural History"
  ],
  "author": "Jeffrey A. Lockwood",
  "average_rating": "3.78",
  "url": "https://www.goodreads.com/book/show/3080235-six-legged-soldiers"
}