{
  "title": "Kicked",
  "description": "***This edition of KICKED also contains two full-length bonus books in the back! Kicked: A Dirty, Flirty Football Romance  Obsession.  I know the feeling well. I'm the top draft prospect for the NFL, voted All-American last year, and a God at the University of Oregon.  I didn't get here by fucking around or chasing fantasies—and I'll never forget where I came from. A guy like me only gets one chance to get out, to make something of himself.  Passion.  I thought football was my passion. But Teagan Fletcher, she's my obsession.  My childhood friend is now a woman with curves for days and hair like fire. But she also hates me—and I don't blame her.  I want her. But I can't have her. I need her. But I don't know how to let go.  One way or another, I'll have it all: football … and Fletcher.  ***KICKED is a standalone new adult sports romance with a happy ending and no cliffhanger. To celebrate the release of this bad boy, there are two free bonus books in the back: STEPBROTHER INKED and RAW AND DIRTY, both from C.M.'s pen name, Violet Blaze. All three are full-length novels, full of bad boys and tattoos, and loaded with hot, hot, hotness. Enjoy!  EXCERPT FROM \"KICKED\":  “What are we doing?” Teagan asked as I forced her to jog after me towards the tunnel. “Where are we going?” Her voice was breathy and patchy, and she panted as she ran after me, but she kept going, following me into the pitch blackness and down, down, down.  At the halfway mark, I stopped, turned, shoved her back into the wall.  “Tyce,” Teagan said, her voice high and reedy, like she was about to come in her panties just from looking at me. I reached up and tore my helmet from my head, tossing it aside and letting it bounce along the pavement beneath our feet. I was panting so goddamn hard in that moment, sucking in breath after anxious breath as my eyes flicked over her face, down her throat, across the full swell of her chest.  I stepped forward and cupped the back of her head with a golden glove, leaned down and captured her mouth with mine. I kissed her hard and fast, frantic with time and need and desire. Less than five minutes. I bruised Teagan's mouth with my own, slid our tongues together, made her dizzy when I pulled back and looked her straight in the face.  “We have five minutes,” I said and then we were working together to shove her pants down one leg, over her sneakers. Mine were next, pushed down halfway off my a**, my c*** springing free from my cup. I lifted Teagan up against that stone wall, slammed her back into the cool cement and let her curl her fingers in my sweaty hair. It was stuck to my forehead, probably a hot mess, but she looked at me like I was a god. I felt like a god there in that tunnel in the dark with thousands of fans screaming and pounding the pavement above our heads. In an instant, my coach or a security guard or one of the boys, they could come down here and find us screwing.  I didn't care.  Seriously. I didn't give a s***.",
  "genres": [
    "Sports",
    "Romance",
    "College",
    "New Adult",
    "Contemporary",
    "Sports Romance",
    "Football"
  ],
  "author": "C.M. Stunich",
  "average_rating": "3.96",
  "url": "https://www.goodreads.com/book/show/30796104-kicked"
}