{
  "title": "Reporting World War II: American Journalism 1938–1944",
  "description": "This Library of America volume is the first of a unique two-volume anthology. Drawn from original newspaper and magazine reports, radio transcripts, and wartime books,  Reporting World War II  captures the intensity of the war’s unfolding drama as recorded by the best of a remarkable generation of journalists, whose talents, sense of purpose, and physical courage remain unsurpassed in the annals of war reporting. Here in one collection, over eighty writers, famous and forgotten alike, confront the crucial events of those years in writing of exceptional skill and emotional force.The first volume traces the buildup to war and the first years of the Munich crisis, Kristallnacht, the fall of Poland and France, Pearl Harbor and Bataan, Guadalcanal and Salerno. William L. Shirer, Sigrid Schulz, and Howard K. Smith observe Nazi Germany from the inside; Edward R. Murrow and Ernie Pyle report from London during the Blitz; A.J. Liebling chronicles the Tunisian campaign; Margaret Bourke-White casts her eye on the Russian and Italian fronts. In a time when public perceptions were shaped mainly by the written word, correspondents like these were often as influential as politicians and as celebrated as movie stars.Writers who covered the home front are included as E.B. White at a bond rally in Maine, Brendan Gill on gas rationing, James Agee’s caustic reviews of Hollywood war movies. And so are the famous literary figures who covered the Gertrude Stein in occupied France, John Steinbeck on a troopship bound for Italy. Here too are writers on aspects of the war still often George S. Schuyler and other African-American journalists attacking racism and segregation in the armed forces; Mary Heaton Vorse on the women working in the defense industries; a firsthand account of the internment of Japanese-Americans.This volume contains a detailed chronology of the war, historical maps, biographical profiles of the journalists, explanatory notes, a glossary of military terms, and an index. Also included are thirty-two pages of photographs of the correspondents, many from private collections and never seen before. A companion volume covers 1944–1946.LIBRARY OF AMERICA  is an independent nonprofit cultural organization founded in 1979 to preserve our nation’s literary heritage by publishing, and keeping permanently in print, America’s best and most significant writing. The Library of America series includes more than 300 volumes to date, authoritative editions that average 1,000 pages in length, feature cloth covers, sewn bindings, and ribbon markers, and are printed on premium acid-free paper that will last for centuries.",
  "genres": [
    "History",
    "Nonfiction",
    "World War II",
    "American History",
    "Journalism",
    "War",
    "Military History"
  ],
  "author": "Library Of America",
  "average_rating": "4.52",
  "url": "https://www.goodreads.com/book/show/307813.Reporting_World_War_II"
}