{
  "title": "Francis Parkman: France and England in North America, Volume 1",
  "description": "This Library of America volume, along with its companion, incorporates, for the first time in compact form, all seven titles of Francis Parkman’s monumental account of France and England’s imperial struggle for dominance on the North American continent. Parkman conceived the project in 1841, when he was a Harvard sophomore, and persisted in it despite chronic disorders that affected his eyes. The last volume of what he called his “history of the American forest” appeared almost thirty years after the first. Deservedly compared as a literary achievement to Gibbon’s The Decline and Fall of the Roman Empire, Parkman’s accomplishment is hardly less awesome than the explorations and adventures he so vividly describes. His own indomitable spirit is reflected in two of the history’s most fiercely resolute figures: La Salle, obsessed with colonizing the Mississippi Valley, and Frontenac, determined to bolster France’s tottering position in the New World. He tells a story of great empires maneuvering in an unfamiliar and hostile terrain with all the guile, sophistication, and ingenuity learned from centuries of European rivalry.Pioneers of France in the New World (1865) begins with the early and tragic settlement of the French Huguenots in Florida, then shifts to the northern reaches of the continent and follows the expeditions of Samuel de Champlain up the St. Lawrence River and into the Great Lakes as he mapped the wilderness, organized the fur trade, promoted Christianity among the natives, and waged a savage forest campaign against the Iroquois.The Jesuits in North America in the Seventeenth Century (1867) traces the zealous efforts of the Jesuits and other Roman Catholic orders to convert the Native American tribes of North America. Jean de Brébeuf, Isaac Jogues, Marguerite Bourgeoys, Marie de l’Incarnation, and Joseph Bressani represent only a few of that resolute company, many of whom suffered captivity, torture, and martyrdom in the far corners of the wilderness.La Salle and the Discovery of the Great West (1869) records that explorer’s voyages on the Ohio and Mississippi Rivers and his treks, often alone, across the vast western prairies and through the labyrinthine swamps of Louisiana. Although he won the respect and admiration of the Native Americans, La Salle often distrusted and alienated his associates. He survived two attempts to poison him before he was finally assassinated by his own men in a lonely Texas outpost.The Old Régime in Canada (1874) recounts the political struggles among the religious sects, colonial officials, feudal chiefs, royal ministers, and military commanders of Canada. Their bitter fights over the monopoly of the fur trade, the sale of brandy to the natives, the importation of wives from the orphanages and poorhouses of France, and the bizarre fanaticism of religious extremists and their “incessant supernaturalism” animate this pioneering social history of early Canada.Parkman’s chronicle of nearly two and a half centuries of conflict will permanently transform our image of the American landscape. Written with verve, suppleness, and wit, this grand narrative history of political and theological conflict, of feats of physical endurance, of courtly manners practiced with comic disproportion against the backdrop of a looming wilderness, is itself one of the still-undiscovered treasures of our national and of world literature.",
  "genres": [
    "History",
    "American History",
    "Nonfiction",
    "Classics",
    "American",
    "Canada",
    "19th Century"
  ],
  "author": "Francis Parkman",
  "average_rating": "4.27",
  "url": "https://www.goodreads.com/book/show/307880.Francis_Parkman"
}