{
  "title": "Slater's Enchanting Mate",
  "description": "Wounded and hidden for years, LeeLee never thought she'd get a happily ever after, until she met an alpha male who claimed her for his own.When you stir a hornet’s nest…you should always be prepared for what might come out. In LeeLee and Slater’s case, they’re totally unprepared for the reality they step into. One where the people who should love and protect, are those who are out to kill for their own gain. Wounded and hidden for years… LeeLee had found acceptance within her wolf. She learned firsthand the harsh reality of never being loved, and vowed to protect her heart, and body from suffering the same pain ever again. Never one to back down…Slater O’Neil loves life. When he meets his mate in wolf form, he never thought claiming her would be quite so hard. Yet he'll gladly battle an unknown evil more sinister than the horror movies he enjoys. After finally finding the other half of his soul, he’ll pay any price to protect the woman meant to be his. True love doesn’t always come easy… For these two shifters, they’ll need more than just love to make it work. LeeLee was just a child when she witnessed a horror no child should, but revisiting old hurts don’t always heal old wounds. When you stir a hornet’s nest— you should always be prepared for what might come out. In LeeLee and Slater’s case, they are totally unprepared to step into a whole different reality. One where the ones who should love and protect, are the ones out to kill for their own gain. ***Warning…contains a sexy alpha male and a female who will bring out all your protective instincts. ~Guilty Pleasures Review~ Elle knows how to write a story from start to finish. She doesn’t keep you hanging and she thoroughly entertains you. She writes wonderful stories that will always have you going back for more. I am not usually surprised with a book by Elle Boon. But, she surprised me with Slater and LeeLee’s story. In a good way. Night Owl Review Top Pick~Magical and mysterious come together in this paranormal romance that will have you believing anything is possible. There is a mix of shifters, fey and humans that bring about a tale that is pure fantasy.",
  "genres": [
    "Shapeshifters",
    "Paranormal",
    "Romance",
    "Paranormal Romance",
    "Contemporary",
    "Supernatural",
    "Fae"
  ],
  "author": "Elle Boon",
  "average_rating": "4.30",
  "url": "https://www.goodreads.com/book/show/30798568-slater-s-enchanting-mate"
}