{
  "title": "City of God",
  "description": "\"City of God,\" the latest installment in Beverly Swerling's gripping saga of old New York, takes readers to Manhattan's clamorous streets as the nation struggles to find a compromise between slave and free, but hears the drums of war. This is New York when one synagogue is no longer adequate for thousands of Jewish immigrants, when New Evangelicals rouse complacent Protestants with the promise of born-again salvation, and when it first sees Catholic nuns and calls them whores of Satan. It is New York when ships bring the fabulous wealth of nations to its wharves and auction houses, while a short distance away rival gangs fight to the death with broken bottles and teeth filed to points.Into this churning cauldron comes young Dr. Nicholas Turner. Nick knows that the discoveries of antisepsis and anesthesia promise medical miracles beyond the dreams of ages. He learns that to make such progress reality he must battle the city's corrupt politics and survive the snake pit that is Bellevue Hospital, all while resisting his love for the beautiful Carolina Devrey, his cousin's wife. Sam Devrey, head of the shipping company that bears his name and a visionary who believes the future will be ushered in by mighty clipper ships spreading acres of sail, battles demons of his own. The life he lives with Carolina in the elegant brownstone on newly fashionable Fifth Avenue is a charade meant to disguise his heart's true home, the secret downtown apartment of the exquisite Mei-hua, his Chinese child-bride. The worlds of all four are imperiled when Sam must rely on Nick's skills to save the woman he loves, and only Nick's honor guards Sam's secret. On a night when promises of hellfire seem to become reality and the city nearly burns to the ground, Carolina and Mei-hua confront the truth of their duplicitous marriages. Rage and revenge join love and passion as driving forces in a story played out against the background of the glittering New York that rises from the ashes, where Delmonico's and the Astor House host bejeweled women and top-hatted men, both with the din of commerce in their ears and the glint of gold in their eyes.As always, Swerling has conjured a dazzling cast of characters to people her city. Among those seeking born-again salvation are Addie Bellingham, befriended by the widow Manon Turner but willing to betray her, and Lilac Langton, who confesses her sins but avoids mentioning that she's a skilled abortionist in a city that has recently made abortion a crime. Ben Klein, a brilliant young physician, must balance devotion to his mentor and dedication to research with duty to the Jewish community. Wilbur Randolf, Carolina's father, indulges her in everything but fails her when she needs him most. Jenny Worthington, Wilbur's longtime mistress, is driven by avarice to make common cause with Fearless Flannagan, a member of a New York police force as corrupt as the city it serves. Ah Chee, Mei-hua's devoted servant, struggles through Manhattan's streets on bound feet and burns incense to the kitchen god in this place of foreign devils. They are all here, heroines and saints, villains and victims, and a vanished New York made to live again in an intricate tale of old debts and new rivalries.",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Historical",
    "New York",
    "Medicine",
    "American"
  ],
  "author": "Beverly Swerling",
  "average_rating": "4.14",
  "url": "https://www.goodreads.com/book/show/3079074-city-of-god"
}