{
  "title": "The American Revolution: Writings from the War of Independence 1775–1783",
  "description": "Drawn from letters, diaries, newspaper articles, public declarations, contemporary narratives, and private memoranda, this Library of America volume brings together over 120 pieces by more than seventy participants and eyewitnesses to create a unique literary panorama of the War of Independence. Beginning with Paul Revere’s own narrative of his legendary ride in April 1775 and ending with a moving account of George Washington’s resignation from the command of the Continental Army in December 1783, the volume contains writing that describes the major events of the conflict—the early battles of Lexington, Concord, and Bunker Hill; the failed American invasion of Canada; the 1776 campaign in New York and New Jersey; the crucial battle of Saratoga; the bitter fighting in the South and along the western frontier; and the decisive triumph at Yorktown.Included are writings by famous figures—Washington Franklin, Jefferson, Benedict Arnold, John and Abigail Adams—and by lesser known participants: Samuel Blachley Webb describing courage and panic at Bunker Hill; Sarah Hodgkins writing longingly to her absent soldier husband; Jabez Fitch recounting the last hours of a wounded American officer in Brooklyn; Albigence Waldo chronicling the privations and miseries of Valley Forge; Otho Holland Williams recording with appealing candor American defeats and victories in South Carolina. The volume also contains writings by American Loyalists and by British officers and officials serving in America that provide provocative insights into the losing side of an epochal conflict. All selections are written by people who were in America at the time of the conflict.The American Revolution also includes a chronology of events, biographical and explanatory notes, and an index.",
  "genres": [
    "History",
    "American History",
    "American Revolution",
    "Nonfiction",
    "Politics",
    "Military History",
    "American Revolutionary War"
  ],
  "author": "John Rhodehamel",
  "average_rating": "4.19",
  "url": "https://www.goodreads.com/book/show/307796.The_American_Revolution"
}