{
  "title": "The Roll",
  "description": "From the back of the book: “Cora Saint James is a lot of things and more often than not, I can't quite figure her out, which I have to admit adds to her allure. She's one part kooky, voodoo-medicine woman, one part free-spirit, pagan-hippie, and one part Mississippi-Delta mud queen; not to mention she is the most intelligent person I have ever met. Yet while these personas may add to the eccentricities that validate her as a radical, revolutionary performer, it is what eventually emerges off the stage that is altogether more tangible and significant. Ask Cora and she will tell you that as she continues to struggle and evolve in a life that's rooted in heartache and despair, she remains at her core, a mystical Chicago soul child from the South Side, who truly suffers from the blues - nothing more, nothing less.” The Roll is an adventure for all music lovers as it follows a band on tour, taking the reader from the dank subway stations in New York City, down to the raucous jook joints of the Mississippi Delta, back up to the subterranean jazz clubs on the South Side of Chicago, before heading west across mountain and desert highways toward the musical Promised Land of Los Angeles, California. Along the way, the rock n’ roll romance between veteran drummer Kam Rodgers and transcendent lead-singer Cora Saint James is tested, as the road proves to be a realm where past ghosts linger, passions collide, and destinies are chosen. Full Description: Kam Rodgers has spent the last decade of his life behind a drum kit chasing rock n’ roll immortality. After a succession of near misses with ill-fated bands, he eventually finds himself past thirty years-old, homeless and bucket-drumming in the subway stations of New York City. There, he crosses paths with Cora Saint James, an NYU student from the South Side of Chicago whose superior musical prowess transcends that of any musician Kam has ever seen. Upon convincing Cora to start a band with him, they immediately develop an attraction toward one another that fuels their chemistry on-stage and leads to a passionate love affair off it. As their band experiences an unprecedented amount of success, mainly predicated on Cora’s mesmerizing performances, they look to capitalize on their growing fame by embarking on a coast to coast summer tour. Convinced that he has been granted one final chance at achieving his rock n’ roll dreams, Kam relentlessly pushes Cora and her talent to the limit as they travel from the eastern cities along the Atlantic coast, down to the raucous jook joints of the Mississippi Delta, back up to the subterranean jazz clubs on the South Side of Chicago, before heading west across mountain and desert highways toward the musical Promised Land of Los Angeles, California. Along the way, Kam’s domineering drive takes its toll on Cora, ultimately bringing their relationship to its breaking point as the road proves to be a realm where past ghosts linger, passions collide, and destinies are chosen.",
  "genres": [
    "Music"
  ],
  "author": "Joe Hnida",
  "average_rating": "4.67",
  "url": "https://www.goodreads.com/book/show/30807685-the-roll"
}