{
  "title": "Women Who Work: Rewriting the Rules for Success",
  "description": "NEW YORK TIMES BESTSELLER!Ivanka is donating the unpaid portion of her advance and all future royalties received from Women Who Work to the Ivanka M. Trump Charitable Fund, a donor advised fund that will make grants to organizations that empower and educate women and girls.* \"This is a chatty step-by-step guide to living a happy life and getting ahead in a career.\" —USA Today  \"The advice is spot-on for everyone, not just women.\" —Tony Hsieh, CEO of Zappos.com and author of Delivering Happiness   I believe that when it comes to women and work, there isn’t one right answer. The only person who can create a life you’ll love is you.    Our grandmothers fought for the right to work. Our mothers fought for the choice to be in an office or to stay at home. Our generation is the first to fully embrace and celebrate the fact that our lives are multidimensional. Thanks to the women who came before us and paved the way, we can create the lives we want to lead—which look different for each of us.     I’ve been fortunate to be able to build my career around my passions, from real estate to fashion. But my professional titles only begin to describe who I am and what I value. I have been an executive and an entrepreneur, but also—and just as importantly—a wife, mother, daughter, and friend. To me, “work” encompasses my efforts to succeed in all of these areas.     After appearing on The Apprentice years ago and receiving a flood of letters from young women asking for guidance, I realized the need for more female leaders to speak out publicly in order to change the way society thinks and talks about “women who work.” So I created a forum to do just that. This book evolves the conversation that started on IvankaTrump.com, where so many incredible women (and men!) have shared their experiences, advice, ambitions, and passions.     Women who work lead meetings and train for marathons. We learn how to cook and how to code. We inspire our employees and our children. We innovate at our current jobs and start new businesses.     Women Who Work will equip you with the best skills I’ve learned from some of the amazing people I’ve met, on subjects such as identifying opportunities, shifting careers smoothly, negotiating, leading teams, starting companies, managing work and family, and helping change the system to make it better for women—now and in the future. I hope it will inspire you to redefine success and architect a life that honors your individual passions and priorities, in a way only you can.    * The Ivanka M. Trump Charitable Fund (the “Fund”) is a donor advised fund that supports the economic empowerment of women and girls. Ivanka Trump is the grant advisor to the Fund and sole member of IT WWW Pub, LLC (the “LLC”), which receives royalties from the publication of Women Who Work. The LLC will contribute a minimum $425,000 to the Fund, which is the unpaid portion of the advance, net of expenses. In addition, the LLC will contribute all future royalties it receives that are in excess of the advance to the Fund during the period from May 1, 2017 to May 1, 2022.",
  "genres": [
    "Nonfiction",
    "Business",
    "Self Help",
    "Biography",
    "Memoir",
    "Politics",
    "Autobiography"
  ],
  "author": "Ivanka Trump",
  "average_rating": "2.94",
  "url": "https://www.goodreads.com/book/show/30814745-women-who-work"
}