{
  "title": "The Eagle Has Landed, Touch the Devil, and Confessional",
  "description": "Three New York Times–bestselling thrillers take IRA gunman Liam Devlin from WWII to the Cold War to a terrorist plot in Northern Ireland.  In The Eagle Has Landed, the inspiration for the film starring Donald Sutherland, an audacious Nazi plan to kidnap Winston Churchill threatens to tip the scales of World War II. In November 1943, an elite team of Nazi paratroopers descends on British soil with a diabolical Abduct Winston Churchill and cripple the Allied war effort. The mission, ordered by Hitler himself and planned by Heinrich Himmler, is led by ace agent Kurt Steiner and aided on the ground by IRA gunman Liam Devlin.   As the deadly duo executes Hitler’s harrowing plot, only the quiet town of Studley Constable stands in their way. Its residents, including a beautiful widow, are the lone souls aware of the impending Nazi plan, and they must become the most unlikely of heroes as the fate of the war hangs in the balance.   In Touch the Devil, in the shadow of the Cold War, two rugged IRA veterans must crush a ruthless mercenary before his deadly scheme can bring Europe to its knees. Terrorist-for-hire Frank Barry has been wreaking havoc in Germany and France with backing from the KGB. But his next mission might be his Barry plans to steal a state-of-the-art missile and sell it to the highest bidder.   Only Barry’s longtime rivals, retired IRA gunman Liam Devlin and his ally Martin Brosnan, can prevent the missile from falling into the wrong hands. But first, Devlin must stage a thrilling jailbreak to free Brosnan before the men set off on a gripping race against the clock to eliminate Barry and end his reign of terror.   In Confessional, a rogue terrorist in Northern Ireland prepares for his final deadly strike. Trained by the KGB, the assassin known as Cuchulain has cut a path of violence throughout the region for over two decades, leaving a trail of bodies in his wake. Now he has set his audacious sights on his highest profile target the pope.   Desperate to stop the terrorist, British Intelligence enlists an enemy Irish gunman, Liam Devlin, to accomplish what they never could. He must put an end to Cuchulain, once and for all.   Jack Higgins is, without a doubt, “the master” (Tom Clancy) of well-crafted World War II espionage thrillers. These three novels featuring Liam Devlin are required reading for lovers of intrigue, action, suspense, and adventure.",
  "genres": [
    "Fiction",
    "Historical Fiction",
    "Mystery"
  ],
  "author": "Jack Higgins",
  "average_rating": "4.41",
  "url": "https://www.goodreads.com/book/show/30818005-the-eagle-has-landed-touch-the-devil-and-confessional"
}