{
  "title": "Known and Strange Things: Essays",
  "description": "A blazingly intelligent first book of essays from the award-winning author of Open City and Every Day Is for the Thief   With this collection of more than fifty pieces on politics, photography, travel, history, and literature, Teju Cole solidifies his place as one of today’s most powerful and original voices. On page after page, deploying prose dense with beauty and ideas, he finds fresh and potent ways to interpret art, people, and historical moments, taking in subjects from Virginia Woolf, Shakespeare, and W. G. Sebald to Instagram, Barack Obama, and Boko Haram. Cole brings us new considerations of James Baldwin in the age of Black Lives Matter; the African American photographer Roy DeCarava, who, forced to shoot with film calibrated exclusively for white skin tones, found his way to a startling and true depiction of black subjects; and (in an essay that inspired both praise and pushback when it first appeared) the White Savior Industrial Complex, the system by which African nations are sentimentally aided by an America “developed on pillage.”   Persuasive and provocative, erudite yet accessible, Known and Strange Things is an opportunity to live within Teju Cole’s wide-ranging enthusiasms, curiosities, and passions, and a chance to see the world in surprising and affecting new frames.  Advance praise for Known and Strange Things  “A bold, honest, and controversially necessary read.”—Kirkus Reviews (starred review)“[Teju] Cole is a literary performance artist, his words meticulously chosen and deployed with elegance and force. To read, see, and travel with him is to be changed by the questions that challenge him.”—Publishers Weekly “The forms of resistance depend on the culture they resist, and in our era of generalizations and approximations and sloppiness, Teju Cole’s precise and vivid observation and description are an antidote and a joy. This is a book written with a scalpel, a microscope, and walking shoes, full of telling details and sometimes big surprises.”—Rebecca Solnit, author of Men Explain Things to MeFrom the Trade Paperback edition.",
  "genres": [
    "Essays",
    "Nonfiction",
    "Art",
    "History",
    "Photography",
    "Politics",
    "Race"
  ],
  "author": "Teju Cole",
  "average_rating": "4.06",
  "url": "https://www.goodreads.com/book/show/30812740-known-and-strange-things"
}