{
  "title": "The Morelville Mysteries Collection: Books 1-8",
  "description": "A boxed set of all 8 complete, full length Morelville Mysteries novels featuring Sheriff Mel Crane and Agent Dana Rossi. You get:  Book 1: Relic – Cases collide for two star crossed ladies of law enforcement! Customs Special Agent Dana Rossi spends life on the road, moving from one case to another until one day when runs run right into the path of Sheriff Mel Crane. The feisty, sexy butch cop is as determined to uncover a counterfeiting ring in her county as Agent Rossi is to find and stop a ring of smugglers bringing high end designer knock-offs into the states.  Book 2: Busy Bees – Romance and Murder Mix in the Latest Story Featuring Sheriff Mel Crane and Special Agent Dana Rossi! Special Agent Dana Rossi is down but not out after being shot and seriously injured during her previous assignment. Will romance blossom or will sparks fly when she agrees to shack up in Morelville with the beautiful butch Sheriff Melissa ‘Mel’ Crane and her extended family while she recovers?  Book 3: Dana’s Dilemma – Elections and Old Loves Combine with Deadly Results in the Newest Romantic Mystery Featuring Sheriff Mel Crane and Special Agent Dana Rossi! What happens when Mel runs for Sheriff, an Amish girl runs away from home and Dana runs – er, limps - for cover? Can anything else possibly go wrong for these two ladies of law enforcement? Sure it can…and it will!  Book 4: Hitched and Tied – Mel and Dana attempt to bring their growing relationship full circle but family, duty and family duties all conspire to get in the way. A victim with close ties to the Cranes escapes a deadly assault with his life only to die from his injuries minutes later. Mel has few clues to find the fighter turned murderer and the further she goes with her investigation, the more the situation deteriorates. Meanwhile, Dana’s trying to plan their wedding but the family is resisting both her efforts and the wishes of the couple while focusing more on her sister and her traditional relationship.  Book 5: Viva Mama Rossi! - A delayed honeymoon getaway takes a deadly turn for newlyweds Mel and Dana; meanwhile, two meddling mothers won't let sleeping fisherman lie in the latest Morelville Mystery. Does an unsolved shooting death far away from Morelville have local ties? Did a fisherman really drown or was there something more sinister afloat?  Book 6: A Crane Christmas - Is it the Christmas season or the ‘silly season’? All Sheriff Mel wants to do is close out the year and spend a joyful first Christmas with Dana and with their extended families. She’s even hired a new detective, Janet Mason, to ease some of the workload for her and her only other detective, Shane Harding. Things were shaping up great for her and Dana for a relaxing holiday season. Too bad it just wasn’t meant to be…  Book 7: Mad for Mel Rival gangs will stop at nothing to gain sole control of the drug trade in Muskingum County and they’ve picked Valentine’s week to create a firestorm of murder and mayhem as they battle each other for supremacy. Sheriff Mel Crane is blindsided by looting, murdering and marauding bikers at a time of year when most Harley’s are tucked safely away from the effects of Ohio winters that come rife with snow and ice. They’re rolling out, they’re out of control and she can’t stop them.  Book 8: Hannah’s Hope: A young mother with a troubled past seeks help from Mel and Dana but is their effort to assist her too little, too late? Hannah Yoder appears",
  "genres": [
    "Romance",
    "Crime",
    "Mystery",
    "LGBT",
    "Lesbian Romance",
    "Lesbian Fiction",
    "Lesbian"
  ],
  "author": "Anne Hagan",
  "average_rating": "4.27",
  "url": "https://www.goodreads.com/book/show/30822304-the-morelville-mysteries-collection"
}