{
  "title": "Blood Will Tell",
  "description": "From the New York Times, USA Today, and Wall Street Journal Bestselling author... What would you do if you were born to be a predator? Would you fight your natural instincts or give in to your nature? Eden is a soul eater closing in on her Awakening. Her family has convinced her that soon she will have to take a life in order to save her own. It’s a decision Eden doesn’t want to deal with even as her hunger for souls grows stronger every day. To complicate her impossible position, new guy in school Noah Valois’ determination to befriend her puts Eden in touch with a humanity she’s never known. Addicted to his company, his friendship and affection, she becomes more and more terrified that giving into her hunger will mean losing him forever. But when she discovers that Noah is not what he seems, his betrayal forces her to face two choices. One will offer her revenge and the destruction of a boy she loved. The other may offer her a life of eternal redemption… REVIEWS “I loved the mythology about the Blessed and the Warriors of Neith and Ankh. Oh, did I mention the heart-pounding action yet? No? Well, there is a ton of that!... Blood Will Tell is another fantastic book from Samantha Young… I can’t wait to get my hands on the next books in the Warriors of Ankh series!” Electrifying Reviews “Okay, so this book has become my new obsession. This review is going to be short and simple, I loved it! Every single minute of it! I've never read anything like it and I promise you that you won't find another book similar to this one. It's so original with strong characters and a great story! 5 out of 5 Stars!” Good Choice Reading Reviews \"Samantha delivers another great beginning to a sure to be phenomenal series...Blood Will Tell is a great read and I totally recommend reading it.\" Once Upon a Twilight Reviews \"Blood Will Tell is a great start to Samantha Young's new YA series... Eden is a kick ass character.. and Noah just makes me swoon so much.\" YA Indie Princess Reviews",
  "genres": [
    "Young Adult",
    "Paranormal",
    "Fantasy",
    "Romance",
    "Mythology",
    "Paranormal Romance",
    "Urban Fantasy"
  ],
  "author": "Samantha Young",
  "average_rating": "3.91",
  "url": "https://www.goodreads.com/book/show/11918173-blood-will-tell"
}