{
  "title": "Crystal Traveler",
  "description": "A love story stretching across time, Crystal Traveler takes the reader from the present day to the last days of Atlantis, then forward again through myth and history. Modern scientist Ta-rel, caught in a mysterious crystal generated time portal, finds himself thrust into the midst of plots and intrigues within a society far removed from the world he knew. Trying to discover how and why he was teleported back through time, Ta-rel must first learn to operate within a society with amazing similarities yet very different gifts and challenges than his time. Ta-rel finds support and guidance from Lyra, High Priestess of the Temple of the Moon, and together they grow and discover their soul’s connection and their destiny, falling in love in the process. As the world of Atlantis begins to disintegrate around them, they rush to merge Ta-rel’s scientific understanding with Atlantian vibrational technology to arrive at an answer with profound history-changing implications, for both Atlantis and today’s world. But can Ta-rel and Lyra together outwit the political intrigue and celestial interference that plagues Atlantis during its final days? What are the implications to our world if Ta-rel and Lyra succeed? Crystal Traveler engages the reader in the epic story of the final days of Atlantis, with uncanny parallels and lessons for today’s world. Modern and classical research are combined with the authors’ personal visions and past life memories to create a believable, compelling, and detailed account of this period of global upheaval and change, sweeping the reader into a world of intrigue, mystery, and expanded consciousness. This first book of the Crystal Message Chronicles series will fill you with the wonders of a forgotten age, and take you into the challenges of a postdiluvian world related in Crystal Rescue, the next installment of this exciting series.",
  "genres": [],
  "author": "R.B. Breighton",
  "average_rating": "4.80",
  "url": "https://www.goodreads.com/book/show/30826327-crystal-traveler"
}