{
  "title": "The Necromancer's Dilemma",
  "description": "Even love can die without trust.  Angel’s brother, Isaac, has returned home, and the pair begins to make slow and awkward attempts back to each other. Learning how to be a brother to a grown man instead of a parental figure has Angel adjusting his behaviors and habits, and Isaac still remains a mystery. Was it merely entering adulthood that turned Isaac away from an overprotective Angel, or does Isaac carry a secret that will keep them from finally being a real family?  Daniel Macavoy, Angel’s new apprentice, is torn between his bond with Angel and the grasping machinations of his father. Dealing with a traumatized apprentice with dangerous holes in his magical education, saving Daniel may be harder than Angel first thought—especially since the biggest problem is not revenge, but guilt.  The one shining beacon in his life is Simeon, Elder vampire of Boston’s only Bloodclan. Four hundred years old and sexy as sin, Simeon is warrior and sage, patient and cunning. The strength Angel draws from Simeon’s devotion and the newborn mate-bond between them is steadfast and true…and the fount of death magic that animates the undead lord places Angel in the midst of a power struggle for control over himself, his lover, and his family.  Through it all, Angel is beleaguered by the unwanted attention of a troll-hybrid, the adventures of a dragon in the city, and a serial killer has decided to hunt the back alleys and midnight streets of Boston.   **72k words. Contains bonus short story at the end, \"The Necromancer's Birthday Surprise\", written for Crystal's Many Reviewers, March 2016. Book TWO in a series. Not standalone.  **Contains male/male sexual content. Violence, gore, sex, vampires. A cute dragon and some snark. Okay, lots of snark.",
  "genres": [
    "M M Romance",
    "Paranormal",
    "Fantasy",
    "Vampires",
    "Urban Fantasy",
    "Magic",
    "Romance"
  ],
  "author": "S.J. Himes",
  "average_rating": "4.38",
  "url": "https://www.goodreads.com/book/show/30831212-the-necromancer-s-dilemma"
}