{
  "title": "8 Secrets of Tao Te Ching",
  "description": "Tao Te Ching is a philosophical book written by Lao-tzu 2,600 years ago. It consists of about five thousand words with 800 Chinese characters.The title “Tao Te Ching” can be translated as “The Book of Tao and Te”. Tao is the first cause of the universe. What causes Tao? Author Lao-tzu says he doesn’t know and therefore Tao is undefined. Te is the use of Tao.The basic idea of Tao Te Ching is that everything can ultimately be explained by one thing – Tao. Tao is the complete explanation of space, time, energy, life, consciousness, human intelligence, thoughts, and all visible and invisible aspects of reality. Tao is the beginning and ending of all reality in the Universe. Tao manifests itself in different forms and laws in the Universe.Te is the use of Tao. Fish have obtained Te so that they can live in water. Birds have obtained Te so that they can fly in air. Humans have obtained Te so that we can live on land. All living creatures have obtained Te so that they can become living creatures. In a broader sense, all things, including non-living things, have obtained Te so that they become what they are.The purpose of Tao Te Ching is to teach the world to live harmoniously through the Tao of natural long life. Tao Te Ching sets out to answer eight important questions: Where do we come from and where are we going? Can the opposite of a profound truth also be true? What is the invisible action wuwei (Can a flap of the wings of a butterfly in one place cause a tornado in another)? What happens when we reach total silence? Are we born enlightened beings? Is there cosmic justice? What is enough? Are we altruistic in nature?According to the answers to the above questions, Tao Te Ching can be grouped into eight principles: 1. Tao; 2. Oneness; 3. Action; 4. Silence; 5. Life; 6. Peace; 7. Contentment; 8. Love.The principles of Tao Te Ching have been applied to religion, science, politics, commerce, medicine, education, sports, arts, and kung fu.",
  "genres": [
    "Philosophy"
  ],
  "author": "Luke Chan",
  "average_rating": "4.17",
  "url": "https://www.goodreads.com/book/show/30824367-8-secrets-of-tao-te-ching"
}