{
  "title": "Baited Truth",
  "description": "BrookeNothing about my life has been easy, but that hasn’t stopped me from living it. So when someone sets out to steal that life from me, they better come heavily armed and with an army close behind, because nothing short of nuclear warfare is going to stop me from protecting what’s mine. When my mom gets taken, I set out to find her and missing pieces of a puzzle I didn’t even know existed start to fall into place.I might end up paying the price for someone else’s sins, but there’s no turning back now. I’m far too invested in this now - in finding my mom, in untangling the web of lies surrounding me, and more than anything else, I’m far too invested in the sexy, secretive and seriously annoying man helping me.GrantAs an ex-SEAL that’s seen and endured horrors the majority of civilians think only exist in Hollywood, I really thought there wasn’t much that could surprise me anymore.Then Jack, my boss and closest thing I have to a dad, goes missing.He goes missing on the same day a pint-sized little spitfire that makes waterboarding sound relaxing compared to her relentless persistence shows up. She shows up someplace she doesn't belong and claims to be looking for her mom, who was abducted the same day Jack went missing.Her arrival starts looking less and less like a coincidence and more like karma looking to punish me for decades of sins I didn't even know I'd committed.She fights me at every turn. Challenges me in the worst ways. And turns me on like no woman has before.Not that I have any plans of hooking up with the nuisance who lives to make my life difficult. I'd have to be a giant dumbass to get into bed with her before knowing if she's friend or foe.Apparently I'm a giant dumbass.",
  "genres": [
    "Romance",
    "Suspense",
    "Romantic Suspense",
    "Contemporary",
    "Military Fiction",
    "Contemporary Romance",
    "Mystery"
  ],
  "author": "Jenn Hype",
  "average_rating": "4.08",
  "url": "https://www.goodreads.com/book/show/30842140-baited-truth"
}