{
  "title": "Herpes: 50 Ultimate Herpes Cures: How to eliminate Herpes for life and never suffer from outbreaks again",
  "description": "Use This Personal Guide To Eliminate Herpes For Life!This book contains proven steps and strategies on how to defeat Herpes and keep it under control and all this can be done by using natural cures. How many of you would love to eliminate Herpes outbreaks for life? Pretty much everybody I am sure. Well, look no further. This book will give you the right solution. I made it! 1 year without outbreaks and counting! You can do the same thing! Doing the massive research and being affected by Herpes myself I felt the need to share the experience with people who are in the same situation like me. Not all of us are having the same symptoms but I am quite sure that all are having the same bad experience and we all have the same question on how to solve this problem. The fact is Herpes is curable and anybody can learn how to do it. I remember one day I felt some strange tingling sensation in my genital area and spotted some blisters which looked like pimples. I decided to let it go, it was only a small thing. But it took almost 14 days to disappear. I ended up at the medical center trying to figure out what was it. To my surprise doctor said right away that it was the virus called Herpes. I was using a condom all along and knew about STD’s but it would never occur to me that I might catch some of it. Well, it did happen and I started thinking how and where did I get this. I had a new girlfriend and we started getting more close to each other. She was getting pushier to sleep with me and I would always come up with some excuses like I had to do something else or we have to wait a bit more etc. It was so difficult for me to tell her especially now that we are dating not even a month. I started to like her more and was so afraid that she will leave. I mean, how can you say to another person that we can’t have sex because you have Herpes. After many excuses, I was forced to tell her the truth. She didn’t leave…she stayed with me and today she is my wife. 10 years later we are still together and happily married. Everything changed for me when I got Herpes and I know how uncomfortable this can be especially if you have to share with someone else. I know how difficult it is to know that it’s part of you and there is nothing you can do. I was happy to share this with my wife because she helped me to overcome this condition and to beat this disease. Cures found in this book are the product of a long research in battling Herpes and they helped me in overcoming this condition with success. Now is on to you to win this battle too and have a normal and happy life. This is my gift to you and hope you will find it useful.Here is A Preview of What You'll Learn...",
  "genres": [],
  "author": "Tim Stanson",
  "average_rating": "2.50",
  "url": "https://www.goodreads.com/book/show/30846296-herpes"
}