{
  "title": "Born Both: An Intersex Life",
  "description": "From one of the world's foremost intersex activists, a candid, provocative, and eye-opening memoir of gender identity, self-acceptance, and love.My name is Hida Viloria. I was raised as a girl but discovered at a young age that my body looked different. Having endured an often turbulent home life as a kid, there were many times when I felt scared and alone, especially given my attraction to girls. But unlike most people in the first world who are born intersex--meaning they have genitals, reproductive organs, hormones, and/or chromosomal patterns that do not fit standard definitions of male or female--I grew up in the body I was born with because my parents did not have my sex characteristics surgically altered at birth.It wasn't until I was twenty-six and encountered the term intersex in a San Francisco newspaper that I finally had a name for my difference. That's when I began to explore what it means to live in the space between genders--to be both and neither. I tried living as a feminine woman, an androgynous person, and even for a brief period of time as a man. Good friends would not recognize me, and gay men would hit on me. My gender fluidity was exciting, and in many ways freeing--but it could also be isolating.I had to know if there were other intersex people like me, but when I finally found an intersex community to connect with I was shocked, and then deeply upset, to learn that most of the people I met had been scarred, both physically and psychologically, by infant surgeries and hormone treatments meant to \"correct\" their bodies. Realizing that the invisibility of intersex people in society facilitated these practices, I made it my mission to bring an end to it--and became one of the first people to voluntarily come out as intersex at a national and then international level.Born Both is the story of my lifelong journey toward finding love and embracing my authentic identity in a world that insists on categorizing people into either/or, and of my decades-long fight for human rights and equality for intersex people everywhere.",
  "genres": [
    "Nonfiction",
    "Memoir",
    "LGBT",
    "Intersex",
    "Queer",
    "Biography",
    "Gender"
  ],
  "author": "Hida Viloria",
  "average_rating": "3.87",
  "url": "https://www.goodreads.com/book/show/30841979-born-both"
}