{
  "title": "Blindspot",
  "description": "“Tis a small canvas, this Boston,” muses Stewart Jameson, a Scottish portrait painter who, having fled his debtors in Edinburgh, has washed up on America’s far shores. Eager to begin anew in this new world, he advertises for an apprentice, but the lad who comes knocking is no lad at all. Fanny Easton is a lady in disguise, a young, fallen woman from Boston’s most prominent family. “I must make this Jameson see my artist’s touch, but not my woman’s form,” Fanny writes, in a letter to her best friend. “I would turn my talent into capital, and that capital into liberty.”Liberty is what everyone’s seeking in boisterous, rebellious Boston on the eve of the American Revolution. But everyone suffers from a kind of blind spot, too. Jameson, distracted by his haunted past, can’t see that Fanny is a woman; Fanny, consumed with her own masquerade, can’t tell that Jameson is falling in love with her. The city’s Sons of Liberty can’t quite see their way clear, either. “Ably do they see the shackles Parliament fastens about them,” Jameson writes, “but to the fetters they clasp upon their own slaves, they are strangely blind.”Written with wit and exuberance by longtime friends and accomplished historians Jane Kamensky and Jill Lepore, Blindspot weaves together invention with actual historical documents in an affectionate send-up of the best of eighteenth-century fiction, from epistolary novels like Richardson’s Clarissa to Sterne’s picaresque Tristram Shandy. Prodigiously learned, beautifully crafted, and lush with the bawdy, romping sensibility of the age, Blindspot celebrates the art of the Enlightenment and the passion of the American Revolution by telling stories we know and those we don’t, stories of the everyday lives of ordinary people caught up in an extraordinary time.",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Mystery",
    "Historical",
    "Romance",
    "Art",
    "18th Century"
  ],
  "author": "Jane Kamensky",
  "average_rating": "3.57",
  "url": "https://www.goodreads.com/book/show/3085271-blindspot"
}