{
  "title": "Borrowed Time",
  "description": "Third in the Kindle Top-25 bestselling FATED LOVES collection from USA-Today bestselling author Edie Claire.You can't run away from your past. But in some cases, it's worth a try.Sarah Landers’ parents were killed in a plane crash when she was seventeen; her only sister committed suicide days after. Now, nearly a decade later, Sarah assures everyone that she is perfectly fine. Never mind her quiet aloofness, her intensity at work, her seeming neglect of any social life. Only Sarah knows the whole story. Only she is aware of the dark memories that plague her with guilt -- of the fear of discovery that paralyzes her soul.When an enigmatic illness forces the normally self-sufficient Sarah to depend on someone, namely the charming do-gooder of a neighbor, Adam, whom she has been trying desperately to avoid -- her carefully built cocoon begins to crumble. Her family’s home in Alabama, left vacant since the tragedy, still holds the grim evidence of her nightmares and is slated for imminent demolition. With the horror of her past swiftly catching up to her, Sarah’s malady begins to look less like a catastrophe and more like her only way out.But the (rather irreverent) reverend Adam Carmassi refuses to let Sarah go. Not when she is the first woman who has ever truly touched his heart, and not when he is so certain he can help her. With the end of Sarah's life looming in more ways than one, Adam wages a desperate campaign to convince her that no matter what tortured secrets she insists on hiding, her life is worth living -- and their chance of a future together, however slim, is a dream worth fighting for.Praise for the Fated Loves LONG TIME COMING“A remarkably well blended romance and mystery, with fascinating shades of the paranormal. The way each layer of Joy's discovery of her forgotten past is revealed is deftly done and exceptionally suspenseful. The relationship between Joy and her parents is heartwarming. This one will have you hooked from the first page.” December 2003 Top Pick -- Romantic Times Bookclub Magazine“An abundance of charm… Joy’s perky first-person narration carries readers along to a warm, gratifying conclusion.” -- Publisher’s Weekly“Emotionally gripping, suspenseful and superb… I was held in wonderment over much of this story and realized early on to expect the unexpected. This is a story of trust, love, friendship and healing. Ms. Claire is an author I hope to see more of in the future. If Long Time Coming is any indication of her writing talent, I will be first in line at the bookstores to get more of her work. This is a positively splendid tale from start to finish and is highly recommended.” Reviewer’s Choice Award -- Road to Romance“Two words. ABSOLUTELY FANTASTIC! Edie Claire has written a wonderful novel about friendship, love, guilt and death… Utterly riveting.” 10/10 -- Contemporary Romance WritersMEANT TO BE“A marvelous story that skillfully interweaves romance with the mystery... Claire makes each element of this terrific tale count.” June 2004 Top Pick -- Romantic Times Bookclub Magazine“One of the best books I have read this year... An element of suspense runs through the pages, and the endearing tale builds to a crescendo of excitement and thrill while warming the heart. Meant To Be is a powerful story of love, healing, discovery and truth... Ms.",
  "genres": [
    "Romance",
    "Fiction",
    "Contemporary",
    "Mystery",
    "Mystery Thriller"
  ],
  "author": "Edie Claire",
  "average_rating": "4.04",
  "url": "https://www.goodreads.com/book/show/11920258-borrowed-time"
}