{
  "title": "Hit Makers: The Science of Popularity in an Age of Distraction",
  "description": "Nothing \"goes viral.\" If you think a popular movie, song, or app came out of nowhere to become a word-of-mouth success in today's crowded media environment, you're missing the real story. Each blockbuster has a secret history--of power, influence, dark broadcasters, and passionate cults that turn some new products into cultural phenomena. Even the most brilliant ideas wither in obscurity if they fail to connect with the right network, and the consumers that matter most aren't the early adopters, but rather their friends, followers, and imitators--the audience of your audience.In his groundbreaking investigation, The Atlantic senior editor Derek Thompson uncovers the hidden psychology of why we like what we like and reveals the economics of cultural markets that invisibly shape our lives. Shattering the sentimental myths of hit-making that dominate pop culture and business, Thompson shows that quality is insufficient for success; nobody has \"good taste\"; and some of the most popular products in history were one bad break away from utter failure. It may be a new world, but there are some enduring truths to what audiences and consumers want. People love a familiar surprise: a product that is bold yet sneakily recognizable.Every business, every artist, every person looking to promote themselves and their work wants to know what makes some works so successful while others disappear. Hit Makers is a magical mystery tour through the last century of pop culture blockbusters and the most valuable currency of the twenty-first century--people's attention. From the dawn of impressionist art to the future of Facebook, from small Etsy designers to the origin of Star Wars, Thompson leaves no Pet Rock unturned to tell the fascinating story of how culture happens and why things become popular.",
  "genres": [
    "Nonfiction",
    "Business",
    "Psychology",
    "Science",
    "Sociology",
    "Music",
    "Audiobook"
  ],
  "author": "Derek   Thompson",
  "average_rating": "3.90",
  "url": "https://www.goodreads.com/book/show/30901608-hit-makers"
}