{
  "title": "The Gargoyle Hunters",
  "description": "Hilarious and poignant, The Gargoyle Hunters is a love letter to a vanishing city, and a deeply emotional story of fathers and sons. Intimately portraying New York's elbow-jostling relationship with time, the novel solves the mystery of a brazen and seemingly impossible architectural heist: the theft of an entire historic Manhattan building that stunned the city and made the front page of The New York Times in 1974. With both his family and his city fracturing, thirteen-year-old Griffin Watts is recruited into his estranged father's illicit and dangerous architectural salvage business. Small and nimble, Griffin is charged with stealing exuberantly expressive nineteenth-century architectural sculptures gargoyles right off the faces of unsung tenements and iconic skyscrapers all over town. As his father explains it, these gargoyles, carved and cast by immigrant artisans during the city's architectural glory days, are an endangered species in this era of sweeping urban renewal.Desperate both to connect with his father and to raise cash to pay the mortgage on the brownstone where he lives with his mother and sister, Griffin is slow to recognize that his father s deepening obsession with preserving the architectural treasures of Beaux Arts New York is also a destructive force, imperiling Griffin's friendships, his relationship with his very first girlfriend, and even his life.As his father grows increasingly possessive of both Griffin's mother and his scavenged touchstones of the lost city, Griffin must learn how to build himself into the person he wants to become and discover which parts of his life can be salvaged and which parts must be let go. Maybe loss, he reflects, is the only thing no one can ever take away from you. Tender, funny, and achingly sad, The Gargoyle Hunters introduces an extraordinary new novelist.",
  "genres": [
    "Fiction",
    "Historical Fiction",
    "Coming Of Age",
    "New York",
    "Literary Fiction",
    "Adult",
    "Historical"
  ],
  "author": "John Freeman Gill",
  "average_rating": "3.66",
  "url": "https://www.goodreads.com/book/show/30901607-the-gargoyle-hunters"
}