{
  "title": "Embracing the Wide Sky: A Tour Across the Horizons of the Mind",
  "description": "Owner of \"the most remarkable mind on the planet,\" (according to \"Entertainment Weekly\") Daniel Tammet captivated readers and won worldwide critical acclaim with the 2007 \"New York Times\" bestselling memoir, \"Born On A Blue Day,\" and its vivid depiction of a life with autistic savant syndrome. In his fascinating new book, he writes with characteristic clarity and personal awareness as he sheds light on the mysteries of savants' incredible mental abilities, and our own. Tammet explains that the differences between savant and non-savant minds have been exaggerated; his astonishing capacities in memory, math and language are neither due to a cerebral supercomputer nor any genetic quirk, but are rather the results of a highly rich and complex associative form of thinking and imagination. Autistic thought, he argues, is an extreme variation of a kind that we all do, from daydreaming to the use of puns and metaphors.\"Embracing the Wide Sky\" combines meticulous scientific research with Tammet's detailed descriptions of how his mind works to demonstrate the immense potential within us all. He explains how our natural intuitions can help us to learn a foreign language, why his memories are like symphonies, and what numbers and giraffes have in common. We also discover why there is more to intelligence than IQ, how optical illusions fool our brains, and why too much information can make you dumb.Many readers will be particularly intrigued by Tammet's original ideas concerning the genesis of genius and exceptional creativity. He illustrates his arguments with examples as diverse as the private languages of twins, the compositions of poets with autism, and the breakthroughs, and breakdowns, of some of history's greatest minds. \"Embracing the Wide Sky\" is a unique and brilliantly imaginative portrait of how we think, learn, remember and create, brimming with personal insights and anecdotes, and explanations of the most up-to-date, mind-bending discoveries from fields ranging from neuroscience to psychology and linguistics. This is a profound and provocative book that will transform our understanding and respect for every kind of mind.",
  "genres": [
    "Nonfiction",
    "Science",
    "Psychology",
    "Autistic Spectrum Disorder",
    "Biography",
    "Brain",
    "Memoir"
  ],
  "author": "Daniel Tammet",
  "average_rating": "3.76",
  "url": "https://www.goodreads.com/book/show/3091640-embracing-the-wide-sky"
}