{
  "title": "The Night Ocean",
  "description": "From the award-winning author and New Yorker contributor, a riveting novel about secrets and scandals, psychiatry and pulp fiction, inspired by the lives of H.P. Lovecraft and his circle. Marina Willett, M.D., has a problem. Her husband, Charlie, has become obsessed with H.P. Lovecraft, in particular with one episode in the legendary horror writer's life: In the summer of 1934, the \"old gent\" lived for two months with a gay teenage fan named Robert Barlow, at Barlow's family home in central Florida. What were the two of them up to? Were they friends--or something more? Just when Charlie thinks he's solved the puzzle, a new scandal erupts, and he disappears. The police say it's suicide. Marina is a psychiatrist, and she doesn't believe them.A tour-de-force of storytelling, The Night Ocean follows the lives of some extraordinary people: Lovecraft, the most influential American horror writer of the 20th century, whose stories continue to win new acolytes, even as his racist views provoke new critics; Barlow, a seminal scholar of Mexican culture who killed himself after being blackmailed for his homosexuality (and who collaborated with Lovecraft on the beautiful story The Night Ocean); his student, future Beat writer William S. Burroughs; and L.C. Spinks, a kindly Canadian appliance salesman and science-fiction fan -- the only person who knows the origins of The Erotonomicon, purported to be the intimate diary of Lovecraft himself.As a heartbroken Marina follows her missing husband's trail in an attempt to learn the truth, the novel moves across the decades and along the length of the continent, from a remote Ontario town, through New York and Florida to Mexico City.The Night Ocean is about love and deception -- about the way that stories earn our trust, and betray it.",
  "genres": [
    "Fiction",
    "Horror",
    "Mystery",
    "Historical Fiction",
    "Contemporary",
    "Literary Fiction",
    "Novels"
  ],
  "author": "Paul La Farge",
  "average_rating": "3.31",
  "url": "https://www.goodreads.com/book/show/30901609-the-night-ocean"
}