{
  "title": "Sirena Selena vestida de pena",
  "description": "According to Puerto Rican author Mayra Santos-Febres, theorist, poet, and award-winning writer, \"for many years the Caribbean has been a desire factory for the rest of the World.[.]\", thus her writing seeks to \"include those issues considered exotic and reveal them as a different kind of there is laughter, joy, a way of imagining desire and experiencing the body differently that is unique.There is where I place myself, because I do not want to be anything but Caribbean.\" The result is one of the most original and powerful voices in contemporary Latin American fiction. Not surprisingly her first novel explores the world of Puerto Rican drag queens. Sirena Selena vestida de pena (\"Syren Selena, dressed in sorrow\" might be a fair translation) tells the story of the title character -Sirena Selena- and his/her Puerto Rico drag queen cabaret-owner mentor -Miss Martha Divine- as they travel, glamour and all, to the still chaste Dominican Republic to present his/her bolero singing drag performance. The author embues the main character the author with the enigma of seduction, both beautiful and monstrous, and what could be considered an opposition between Truth and Reality. Leocadio, formerly a drug addicted child -owner of an extraordinary bolero singing voice- has been rescued from the streets of Puerto Rico and transformed by his rescuer into Sirena Selena, the mesmerizing trans vestite singer-entertainer, both characters setting their respective hopes in making a fortune to escape a haphazard life. To Martha Divine the child must \"become who she really is\", a Caribbean bolero singing drag queen, because the only way she will be able to harmonize his/her interior and exterior self is by being reborn as the diva Sirena Selena. Ironically truth and harmony stem from the bifurcated nature of a mythical figure -half human, half monster- unstoppable in its seduction. The tragic aspect arises from Sirena Selena's awareness that his/her attraction resides equally in the awesome perfection of her presence and in the knowledge that it is merely a performance, the dramatization of a gender identity that simultaneously is and is not essentially hers. The fluent and musical Spanish prose of Sirena Selena constitutes a rare reading pleasure on many different levels, including that of the casual reader who, like the audience in the cabaret, will succumb to the mysterious and seductive divas, as well as on a level of sharp literary critique that will find in the identity creating \"protectress\" a twin soul in the process of concealing desires under layers of quotes and counter-quotes. In this edition the foreword by prof. Debra A. Castillo discloses these clever mechanisms, while her footnotes help readers to enjoy this intelligent and intrinsically poetic text.",
  "genres": [
    "Fiction",
    "LGBT",
    "Queer",
    "Literature",
    "Literary Fiction",
    "Spanish Literature",
    "Contemporary"
  ],
  "author": "Mayra Santos-Febres",
  "average_rating": "3.88",
  "url": "https://www.goodreads.com/book/show/3090376-sirena-selena-vestida-de-pena"
}