{
  "title": "Brains, Trains & Video Games",
  "description": "Brains, Trains & Video Living The Autism Life details the emotional, humorous and often profoundly insightful journey of an everyday family raising a child with autism. This is a book about life with Ewan—the center of one family's universe and the gravity that holds them together. Far from being the stressor that causes this family to disintegrate, autism has made this family what it is today. A family that laughs more than it cries, and a family that eagerly awaits for the next Ewanism to spring forth from the lips of this solar system’s sun. Over the years we have built a bridge between his world and ours, his brain and ours, and his perspective and ours. Join us on the journey we’ve taken to help create a world of possibility for our son—a world filled with words, thoughts, ideas, and love. Alicia Hart, author of Brains, Trains & Video Games, is a wife, mother and advocate for children and adults with autism spectrum disorder. She has worked for various autism related agencies, early intervention programs, and has consulted with schools, hospitals, and other programs regarding autism spectrum disorders, feeding aversions, and augmentative and alternative communication. Alicia continues to write and has planned a series of books surrounding the autism life. The first book, Brains, Trains & Video Games, details their life through infancy, early intervention, augmentative and alternative communication, feeding problems, medical care and preschool. The next book in the series, Foods, Moods & Isms, is about a single year in the life of this family--a year of great change, difficult obstacles and an ever changing view of life. Foods, Moods & Isms was released on March 8, 2013. For more updates, please visit The Autism Life or the Alicia Hart -- Author Facebook page.",
  "genres": [
    "Nonfiction",
    "Autistic Spectrum Disorder",
    "Parenting",
    "Biography",
    "Memoir"
  ],
  "author": "Alicia  Hart",
  "average_rating": "3.78",
  "url": "https://www.goodreads.com/book/show/11921591-brains-trains-video-games"
}