{
  "title": "One True God: Historical Consequences of Monotheism",
  "description": "Western history would be unrecognizable had it not been for people who believed in One True God. There would have been wars, but no religious wars. There would have been moral codes, but no Commandments. Had the Jews been polytheists, they would today be only another barely remembered people, less important, but just as extinct as the Babylonians. Had Christians presented Jesus to the Greco-Roman world as ''another'' God, their faith would long since have gone the way of Mithraism. And surely Islam would never have made it out of the desert had Muhammad not removed Allah from the context of Arab paganism and proclaimed him as the only God.The three great monotheisms changed everything. With his customary clarity and vigor, Rodney Stark explains how and why monotheism has such immense power both to unite and to divide. Why and how did Jews, Christians, and Muslims missionize, and when and why did their efforts falter? Why did both Christianity and Islam suddenly become less tolerant of Jews late in the eleventh century, prompting outbursts of mass murder? Why were the Jewish massacres by Christians concentrated in the cities along the Rhine River, and why did the pogroms by Muslims take place mainly in Granada? How could the Jews persist so long as a minority faith, able to withstand intense pressures to convert? Why did they sometimes assimilate? In the final chapter, Stark also examines the American experience to show that it is possible for committed monotheists to sustain norms of civility toward one another.A sweeping social history of religion, One True God shows how the great monotheisms shaped the past and created the modern world.",
  "genres": [
    "Nonfiction",
    "Religion",
    "History",
    "Sociology",
    "Philosophy",
    "Christian",
    "Cultural Studies"
  ],
  "author": "Rodney Stark",
  "average_rating": "3.61",
  "url": "https://www.goodreads.com/book/show/30950.One_True_God"
}