{
  "title": "The Pill That Steals Lives - One Woman's Terrifying Journey to Discover the Truth About Antidepressants",
  "description": "While going through a divorce, documentary filmmaker Katinka Blackford Newman took an antidepressant. Not unusual – except that things didn't turn out quite as she expected. She went into a four-day toxic psychosis with violent hallucinations, imagining she had killed her children, and in fact attacking herself with a knife.Caught up in a real-life nightmare when doctors didn't realise she was suffering side effects of more pills, she went into a year-long decline. Soon she was wandering around in an old dressing gown, unable to care for herself, and dribbling. She nearly lost everything, but luck stepped in; treated at another hospital, she was taken off all the medication and made a miraculous recovery within weeks.By publicising her story, Katinka went on to make some startling discoveries. Could there really be thousands around the world who kill themselves and others from these drugs? What of the billions of dollars in settlements paid out by drug companies? Could they really be the cause of world mass killings, such as the Germanwings pilot who took an airliner down, killing 150, while on exactly the same medication as the author when she became psychotic? And how come so many people are taking these drugs when experts say they are no more effective than a sugarcoated pill for people like her, who are distressed rather than depressed?Moving, frightening and at times funny, this is the story of how a single mum in Harlesden, North-West London, juggles life and her quest for love in order to investigate Big Pharma.For more information visit www.thepillthatsteals.com",
  "genres": [
    "Nonfiction",
    "Memoir",
    "Mental Health"
  ],
  "author": "Katinka Blackford Newman",
  "average_rating": "3.55",
  "url": "https://www.goodreads.com/book/show/30955794-the-pill-that-steals-lives---one-woman-s-terrifying-journey-to-discover"
}