{
  "title": "شاى بالنعناع",
  "description": "يوم انسكب على يدى فنجان الشاى بالنعناع وأحرقها تماما ظللت طويلا انظر الى الحرق والنار المتصاعدة منه وأنا أتساءل فى وجع كيف بإمكان الاشياء التى نحبها بشدة أن تبالغ فى أذيتنا الى هذا الحد ؟يومها توصلت بحزن الى أن الشاى بالنعناع الذى أحببته حد القداسة لا يبادلنى اى حبيمكنكم الآن الحصول على الكتاب في القاهرة من الأماكن التالية :- مكتبة ابجدية .. 12 شارع طلعت حرب الدور الأول-يوسف بوك استورز .. 1 شارع طلعت حرب .- مكتبة فرجن - سيتي ستارز مول - مدينة نصر- مكتبة الدار العربية - امتداد شارع الطيران في الحي السابع - مدينة نصر- مكتبة بانوراما - شارع مكرم عبيد - مدينة نصر- مكتبة عمر بوك ستور : 15 ش طلعت حرب، أعلى مطعم فلفلة- مكتبة البلد .. أمام الجامعة الأمريكية .. 31 شارع محمد محمود التحرير- مكتبة كيان : 151 شارع الفلكي - باب اللوق.. وسط البلد- مكتبة نفرو .. وسط البلد-مكتبة ليلى ..17 شارع جواد حسني من شارع قصر النيلكما تتواجد اصداراتنا في محافظات : الأسكندرية - المنصورة - كفر الشيخ - الإسماعيلية - بورسعيد - السويس .. طنطا* منافذ التوزيع في الأسكندرية :- مكتبة فكرة، في سان ستيفانو مول- مكتبة روايات الشباب : 67 ش مسلم بن الوليد – ت : 0121731008 - 5759865- معرض الكتاب الدائم، شارع صفية زغلول - محطة الرمل- مكتبة الحلواني، أول شارع صفية زغلول - محطة الرمل- مكتبة أحمد الأبيض، محطة ترام الرملبمناطق سيدي بشر والمندرة والعصافرة ...منطقة (1)========================منطقة العصافرة ...محطة قطار العصافرة بحري السكةمنطقة العصافرة...مكتبة كشك ش حسني للمشويات على ش جمال عبد الناصرمنطقة العصافرة .....أمام أسواق الشريفمنطقة المندرة ...على محطة قطار المندرةمنطقة المندرة .... أمام جامع عبد الحليم محمود ش وهرانمنطقة سيدي بشر .....أمام حي المنتزةمنطقة سيدي بشر ....على محطة سيدي بشر القطار* منافذ التوزيع في المنصورة :- مكتبة الصحافة، بميدان المحطة - أول شارع السكة الحديد- مكتبة أبو جلال، أمام بنك ناصر- مكتبة عماد سليمان، بأول شارع جيهان* طنطامكتبة طنطا بوك هاويس* منافذ التوزيع في كفر الشيخ :- مكتبة فرج - ميدان المحطة أول شارع سعد - مدينة دسوقت : 0103508388* منافذ التوزيع في الإسماعيلية :- مكتبة إدور الممر – سور السكة الحديد، أمام قهوة المثلث.-مكتبة الأخبار العلمية .. شارع عرابي بجوار الهنيدي ستيل* منافذ التوزيع في بورسعيد :- مكتبة محمد درغام \"ناصية العالم\" : 2 شارع صفية زغلول - تقاطع الجمهورية مع صفية زغلول أمام باباىت : 0186698581* منافذ التوزيع في السويس :- مكتبة سويس لايف، 44 شارع خالد بن الوليد - أمام مدرسة الفرنسيسكان",
  "genres": [],
  "author": "دعاء شعبان",
  "average_rating": "3.68",
  "url": "https://www.goodreads.com/book/show/11922284"
}