{
  "title": "Stalking Irish Madness: Searching for the Roots of My Family's Schizophrenia",
  "description": "In this powerful, sometimes harrowing, deeply felt story, Patrick Tracey journeys to Ireland to track the origin and solve the mystery of his Irish-American family's multigenerational struggle with schizophrenia.For most Irish Americans, a trip to Ireland is often an occasion to revisit their family's roots. But for Patrick Tracey, the lure of his ancestral home is a much more powerful need: part pilgrimage, part investigation to confront the genealogical mystery of schizophrenia–a disease that had claimed a great-great-great-grandmother, a grandmother, an uncle, and, most recently, two sisters. As long as Tracey could remember, schizophrenia ran on his mother's side, seldom spoken of outright but impossible to ignore. Devastated by the emotional toll the disease had already taken on his family, terrified of passing it on to any children he might have, and inspired by the recent discovery of the first genetic link to schizophrenia, Tracey followed his genealogical trail from Boston to Ireland's county Roscommon, home of his oldest-known schizophrenic ancestor. In a renovated camper, Tracey crossed the Emerald Isle to investigate the country that, until the 1960s, had the world's highest rate of institutionalization for mental illness, following clues and separating fact from fiction in the legendary relationship the Irish have had with madness. Tracey's path leads from fairy mounds and ancient caverns still shrouded in superstition to old pubs whose colorful inhabitants are a treasure trove of local lore. He visits the massive and grim asylum where his famine starved ancestors may have lived. And he interviews the Irish research team that first cracked the schizophrenic code to learn how much–and how little–we know about this often misunderstood disease. Filled with history, science, and lore, Stalking Irish Madness is an unforgettable chronicle of one man's attempt to make sense of his family's past and to find hope for the future of schizophrenic patients.",
  "genres": [
    "Psychology",
    "Nonfiction",
    "Memoir",
    "Mental Illness",
    "Mental Health",
    "Ireland",
    "History"
  ],
  "author": "Patrick Tracey",
  "average_rating": "3.48",
  "url": "https://www.goodreads.com/book/show/3097553-stalking-irish-madness"
}