{
  "title": "The Orphan Trilogy",
  "description": "Twenty-three orphans with numbers for names from 1 to 23.Number Nine wants to escape from 'the orphanage'.Read the highly-rated international conspiracy thriller series in full. Three novels spanning over 1,000 explosive pages... Book One: THE NINTH ORPHANBook Two: THE ORPHAN FACTORYBook Three: THE ORPHAN UPRISINGMeet Number Nine - an orphan, a spy, a lover...a master of disguise, an assassin, a shapeshifter...a freedom fighter, a human chameleon, a reformed contract killer. He's all of the above. He's none of the above. Nine is enslaved by the Omega Agency, a shadowy organization seeking to create a New World Order. When he tries to break free and live a normal life, Nine is hunted by his mentor and father figure, and by a female orphan he spent his childhood with. On the run, his life becomes entwined with his beautiful French-African hostage and a shocking past is revealed...A past that involves the mysterious Pedemont Orphanage in Chicago, Illinois. Standing in the way of Nine's freedom are his fellow orphans - all elite operatives like himself - who are under orders to terminate him. Nine finds himself in a seemingly infinite maze of cloak and dagger deception. Time and again, he must call on all his advanced training to survive.But can the ninth-born orphan ever get off the grid? To find out you'll need to go on a tumultuous journey around the world to such far-flung locations as the Arctic, Asia, Europe, the Amazon, Africa and South Pacific islands. The frenetic cat-and-mouse chase moves from airports to train stations and hidden torture prisons, taking the reader on a page turning, frightening non-stop action ride into the world of corrupted power that goes beyond conspiracy theories to painful reality. Fast-paced, totally fresh and original, filled with deep and complex characters, The Orphan Trilogy is a controversial, high-octane thriller series with an edge. Merging fact with fiction, it illuminates shadow organizations rumored to actually exist in our world. The three novels explore a plethora of conspiracies involving real organizations like the CIA, MI6, and the UN, and public figures such as President Obama, Queen Elizabeth II as well as the Clinton, Marcos and Bush families. The Orphan Trilogy exposes a global agenda designed to keep the power in the hands of a select few. Nine's oppressors are a shadow government acting above and beyond the likes of the White House, the FBI, the Pentagon and the NSA. One of the Omega Agency's black ops employs MK-Ultra mind control technology on genetically engineered agents to facilitate the agendas of those in power. When Nine successfully deprograms himself from MK-Ultra, all hell breaks loose. But to gain his freedom he must bust out of the Pedemont Orphanage and break into Omega's other orphanages and underground medical laboratories around the world. In the process he uncovers chilling scientific experiments taking place on children. Could something like this ever take place? Or, is it already taking place somewhere in the world right now?",
  "genres": [
    "Thriller",
    "Fiction",
    "Mystery",
    "Young Adult",
    "Spy Thriller",
    "Science Fiction",
    "Conspiracy Theories"
  ],
  "author": "James Morcan",
  "average_rating": "3.93",
  "url": "https://www.goodreads.com/book/show/30975049-the-orphan-trilogy"
}