{
  "title": "Above the Sky Trilogy",
  "description": "\"5 MILLION STARS!!!!! My new all-time favorite series. Heart-stopping. Jaw-dropping. You need to read these books.\" -- Megan, i fall in love book blog ★★★★★Eighteen-year-old Seven and her best friend, Ten, live in a world where all is peaceful ... except for the violent war raging above the sky. But there are strict rules and breaking them can have severe consequences.Seven and Ten have been secretly disobeying the rules for years. They sneak into places where people are forbidden to go. And sometimes, when they're alone together, they allow their bodies to touch, even though touching each other is strictly prohibited.Every year, on Assignment Day, each eighteen-year-old officially becomes an adult, and the path of their life is laid out by the Decision Makers. Some are given the jobs for which they have shown exceptional aptitude and are \"paired\" for mating. The others are sent off to fight in The War and never return.When Assignment Day comes for Seven, the assignments shatter everything she has ever believed. For the first time in her life, she is certain that the Decision Makers have made a terrible mistake.But the only way to right this wrong is to do something absolutely unthinkable.If you like books with captivating suspense, thrilling mystery, forbidden romance, and jaw-dropping twists and turns, don't miss this gripping must-read series!Books in the ABOVE THE SKY TRILOGY:Book 1: ABOVE THE SKYBook 2: RETURN TO THE SKYBook 3: SHATTER THE SKYNote that the Above the Sky series has been repackaged from a 4-book series into a trilogy.Original series:Book 1: ABOVE THE SKYBook 2: RETURN TO THE SKYBook 3, Part 1: PART OF THE SKYBook 3, Part 2: BEYOND THE SKYWhat readers are saying about the ABOVE THE SKY TRILOGY:\"Every time I thought I had figured something out, the story took yet another twist and I was left re-thinking everything I had come to believe! This is a series that I will definitely be re-reading. I cannot recommend it enough!\" -- Ashleigh, Goodreads ★★★★★\"Wonderful. Exciting. Full of twists & turns, intrigue, suspense & originality. Complex, contrasting, conflicted protagonists. It's a page turner!\" -- James, Amazon ★★★★★\"I read A LOT, and I've learned how to pick books that I will almost certainly enjoy, but I was completely blown away by how much I loved this. If I could recommend one series to anyone, this would be it.\" -- Megan, Amazon ★★★★★",
  "genres": [
    "Dystopia",
    "Science Fiction",
    "Young Adult",
    "Futuristic",
    "Young Adult Romance",
    "Teen",
    "Suspense"
  ],
  "author": "J.W. Lynne",
  "average_rating": "4.06",
  "url": "https://www.goodreads.com/book/show/30969318-above-the-sky-trilogy"
}