{
  "title": "Age of Anger: A History of the Present",
  "description": "A New York Times Notable Book of 2017 • Named a Best Book of the Year by Slate and NPR • Longlisted for the Orwell PrizeOne of our most important public intellectuals reveals the hidden history of our current global crisisHow can we explain the origins of the great wave of paranoid hatreds that seem inescapable in our close-knit world—from American shooters and ISIS to Donald Trump, from a rise in vengeful nationalism across the world to racism and misogyny on social media? In Age of Anger, Pankaj Mishra answers our bewilderment by casting his gaze back to the eighteenth century before leading us to the present.He shows that as the world became modern, those who were unable to enjoy its promises—of freedom, stability, and prosperity—were increasingly susceptible to demagogues. The many who came late to this new world—or were left, or pushed, behind—reacted in horrifyingly similar with intense hatred of invented enemies, attempts to re-create an imaginary golden age, and self-empowerment through spectacular violence. It was from among the ranks of the disaffected that the militants of the nineteenth century arose—angry young men who became cultural nationalists in Germany, messianic revolutionaries in Russia, bellicose chauvinists in Italy, and anarchist terrorists internationally.Today, just as then, the wide embrace of mass politics and technology and the pursuit of wealth and individualism have cast many more billions adrift in a demoralized world, uprooted from tradition but still far from modernity—with the same terrible results.Making startling connections and comparisons, Age of Anger is a book of immense urgency and profound argument. It is a history of our present predicament unlike any other.",
  "genres": [
    "Nonfiction",
    "History",
    "Politics",
    "Philosophy",
    "Sociology",
    "Essays",
    "India"
  ],
  "author": "Pankaj Mishra",
  "average_rating": "3.64",
  "url": "https://www.goodreads.com/book/show/30989285-age-of-anger"
}