{
  "title": "2005 - Thanks for the Vodka",
  "description": "If you only read one book this year, make it this oneYou won’t find another book like this anywhere elseThere are books that discuss mental illness and there are books that discuss self-harm, but only from a clinical viewpoint; as in what to do if your child is one of these ‘Emo children, making pathetic little cat scratches on their arms and flaunting what they’re doing to the rest of the world.’You may even find a few fiction books, mostly in the Young Adult genre, whereby the hero or heroine cuts themselves due to home or school issues or even peer pressure.But nobody, ever, has had the bravery – until now – to tell it like it really is. Nobody has discussed the deep shame, the reasons behind self-mutilation and how this way of confronting emotional pain, acute anger or resentment is reasoned.It’s not a joke. Neither is mental illness or depression. You wouldn’t say ‘snap out of it’ to somebody with cancer, diabetes or heart disease, so what makes people feel its okay to say the same to those with depression?Previous comments on Harpie’s writing are that she “reveals her innermost thoughts, slashing a metaphoric vein and bleeding onto the page.” And those words were chosen for a reason. Harpie writes with her heart on her sleeve. She is emotionally transparent. Her feelings are as clear as the scars on her arms and legs. But the message here is that there are some scars that are never seen.This book’s not all messed up. It’s a year in the life of a working class hero who’s come to be loved by many of her fans. In ‘2005 – Thanks for the Vodka’ Harpie describes her sexual liaisons, bullying, court dates, her career as a zoo keeper, the NHS and those beautiful people who some regard as mentally unstable. And she does all this with that charming, self-deprecating sense of humour synonymous of her style of writing.As always when Harpie writes, this is a book of raw emotion …. And it bleeds",
  "genres": [],
  "author": "Harpie",
  "average_rating": "3.93",
  "url": "https://www.goodreads.com/book/show/30992254-2005---thanks-for-the-vodka"
}