{
  "title": "A People's History of the United States",
  "description": "Superwriter and Supermodel Lin Xun (that's Lin as the covergirl) is the author of this full frontal exposure of the USA. Find out what is taught in the schools of other countries that the USA doesn't teach in its schools. Xun teaches the USA's history to students in China (and other countries), including facts hidden in the USA's classrooms such as: (1) that the \"Pledge of Allegiance to the Flag\" was the origin of the Nazi salute and Nazi behavior; (2) Swastikas represented crossed \"S\" letter shapes for \"socialist\" under Hitler (two of the many astounding discoveries by Sociologist Dr. Rex Curry). Xun reveals all on flag bikinis, flag fetishism, flag propaganda, and more.  Each book is personally handled, wrapped, and posted by Lin Xun (in the nude). Or by CreateSpace, depending on who's available.  What do other countries think about the USA's Pledge of Allegiance today? Xun tells all as she joins forces with the Dead Writers Club in this eye-popping page-turner. Learn how the USA and its pledge inspired police states globally.  Will America escape the madness? Will you? Save yourself from the cult of the ominpotent state!  The book \"A People's History of the United States\" introduces readers to Anarchaeology, Misanthropology, and the Socialist Crusades, the Latest Socialist Dark Age, and the Modern Socialist Inquisitions, which resulted in the Wholecaust (of which the Holocaust was a part). Adolf Hitler, Joseph Stalin, Mao Zedong and other socialists are exposed along with the influence of socialists in the United States upon those dictators. As part of the Dead Writers Club (DWC), Lin Xun has collaborated with the authors Micky Barnetti and Matt Crypto. Another volume by the Dead Writers Club is the self-titled \"Dead Writers Club\" and \"Drug Detection Dog Training -Libertarian Lawyers Fight Police State USA.\" The DWC collaborated on the groundbreaking book “Pledge of Allegiance & Swastika Secrets.” It is a semi-biographical work about the nation’s leading authority on the Pledge of Allegiance and his many discoveries about its bizarre past and present. The DWC also assisted with a classic science fiction tale revealing an amazing discovery about time travel.",
  "genres": [
    "Nonfiction"
  ],
  "author": "Lin Xun",
  "average_rating": "4.33",
  "url": "https://www.goodreads.com/book/show/30982099-a-people-s-history-of-the-united-states"
}