{
  "title": "More: Population, Nature, and What Women Want",
  "description": "In the capital of Ghana, a teenager nicknamed “Condom Sister” trolls the streets to educate other young people about contraception. Her work and her own aspirations point to a remarkable shift not only in the West African nation, where just a few decades ago women had nearly seven children on average, but around the globe. While world population continues to grow, family size keeps dropping in countries as diverse as Switzerland and South Africa. The phenomenon has some lamenting the imminent extinction of humanity, while others warn that our numbers will soon outgrow the planet’s resources. Robert Engelman offers a decidedly different vision—one that celebrates women’s widespread desire for smaller families. Mothers aren’t seeking more children, he argues, but more for their children. If they’re able to realize their intentions, we just might suffer less climate change, hunger, and disease, not to mention sky-high housing costs and infuriating traffic jams. In More , Engelman shows that this three-way dance between population, women’s autonomy, and the natural world is as old as humanity itself. He traces pivotal developments in our history that set population—and society—on its current trajectory, from hominids’ first steps on two feet to the persecution of “witches” in Europe to the creation of modern contraception. Both personal and sweeping, More explores how population growth has shaped modern civilization—and humanity as we know it. The result is a mind-stretching exploration of parenthood, sex, and culture through the ages. Yet for all its fascinating historical detail, More is primarily about the choices we face today. Whether society supports women to have children when and only when they choose to will not only shape their lives, but the world all our children will inherit.",
  "genres": [
    "Nonfiction",
    "Womens",
    "Science",
    "History",
    "Environment",
    "Sociology"
  ],
  "author": "Robert Engelman",
  "average_rating": "3.98",
  "url": "https://www.goodreads.com/book/show/3098606-more"
}