{
  "title": "Beyond the Light: What Isn't Being Said About Near-Death Experience",
  "description": "\"Atwater is earnest, helpful, boldly honest.\" --East West Journal P. M. H. Atwater is unique in this world. As both a near-death survivor and a near-death researcher, she brings a remarkable perspective to her work. Her first book, Coming Back to Life caused a major controversy in the field of near-death studies, and Beyond the Light promises to do the same. It presents the most in-depth and comprehensive look at the near-death phenomenon, its after-effects and implications. She challenges the stereotype of the \"amazing grace\" near-death experience of a tunnel of light accompanied by a feeling of well-being. Atwater has provocative evidence of many different types of experiences, including those that are hell-like as well as transcendent. She also discusses and contrasts the experiences of those people who were dead for several days and then revived, those who attempted suicide, and the similarities and differences between near-death experiences and hallucinations. Atwater was the first near-death researcher to find that the experience changed the brain's physiology, actually altering its structure. While she was criticized for this bold assertion, subsequent findings have proved her correct. Beyond the Light provocatively probes the \"electrical sensitivity\" that follows near-death episodes as well as the now-acknowledged \"brain-shifts,\" and considers how these findings might change our very notion of mortality. Atwater has interviewed hundreds who have experienced near-death and their loved ones and friends. Her conclusions and observations will challenge our assumptions about what we consider life, death, and the existence and evolution of the individual soul. Like almost everyone who has experienced near-death, Atwater has come away spiritually charged with a mission to share her perceptions and sensations. Beyond the Light is about nightmares as well as miracles, joy as well as deep despair. Atwater makes a compelling case that near-death provides us with a fascinating window on one of life's greatest unknowns and sets the stage for our re-examination of what it means to be alive . . . and dead. Beyond the Light also contains a thorough and exhaustively researched resource section for those looking for further reading and guidance to an understanding of this fascinating field of study. P. M. H. Atwater experienced three near-death experiences in 1977. She has been exploring this phenomenon ever since. She lives and works in Charlottesville, Virginia.",
  "genres": [
    "Spirituality",
    "Metaphysics"
  ],
  "author": "P.M.H. Atwater",
  "average_rating": "3.64",
  "url": "https://www.goodreads.com/book/show/1002636.Beyond_the_Light"
}