{
  "title": "The Promise Girls",
  "description": "In an emotionally rich and captivating new novel, New York Times bestselling author Marie Bostwick reunites three sisters whose deep bond is rooted in an unconventional past. Every child prodigy grows up eventually. For the Promise sisters, escaping their mother's narcissism and the notoriety that came with her bestselling book hasn't been easy. Minerva Promise claimed that her three \"test tube\" daughters--gifted pianist Joanie, artistic Meg, and storyteller Avery--were engineered and molded to be geniuses. In adulthood, their modest lives fall far short of her grand ambitions. But now, twenty years after the book's release, she hopes to redeem herself by taking part in a new documentary. Meg, who hasn't picked up a paintbrush in years, adamantly refuses to participate, until a car accident leaves her with crushing medical bills. While she recuperates in Seattle, the three sisters reluctantly meet with filmmaker Hal Seeger, another former prodigy. Like them, he's familiar with the weight of failed potential. But as he digs deeper, he uncovers secrets they've hidden from each other--and a revelation that will challenge their beliefs, even as it spurs them to forge their own extraordinary lives at last. \"Reading Marie Bostwick is like wrapping yourself up in a warm, hand-crafted quilt. Her books, rich in character and plot, are stitched together by a skilled wordsmith.\" --Debbie Macomber, #1 New York Times bestselling author \"THE PROMISE GIRLS is a beautiful story about the ties that bind--love, laughter, memories, even secrets kept so long they become a part of the fabric of a family. Marie Bostwick exquisitely tells the tale of the three Promise girls, former child prodigies who learn to heal the scars of a bitter past so that they can love--and forgive--again.\" --Melanie Benjamin, New York Times Best Selling author of The Swans of Fifth Avenue",
  "genres": [
    "Fiction",
    "Chick Lit",
    "Contemporary",
    "Book Club",
    "Audiobook",
    "Family",
    "Womens Fiction"
  ],
  "author": "Marie Bostwick",
  "average_rating": "3.88",
  "url": "https://www.goodreads.com/book/show/31077374-the-promise-girls"
}