{
  "title": "Duplicity",
  "description": "In Jane Haseldine's new novel of riveting suspense, Detroit newspaper reporter Julia Gooden is up against the city's most devious criminal--and her own painful past. Julia Gooden knows how to juggle different lives. A successful crime reporter, she covers the grittiest stories in the city while raising her two young boys in the suburbs. But beneath that accomplished facade is another Julia, still consumed by a tragedy that unfolded thirty years ago when her nine-year-old brother disappeared without a trace.Julia's marriage, too, is a balancing act, as she tries to rekindle her relationship with her husband, Assistant District Attorney David Tanner, while maintaining professional boundaries. David is about to bring Nick Rossi to trial for crimes that include drug trafficking, illegal gambling, and bribery. But the story becomes much more urgent when a courthouse bomb claims several victims--including the prosecution's key witness--and leaves David critically injured.Though Julia is certain that Rossi orchestrated the attack, the case against him is collapsing, and his power and connections run high and wide. With the help of Detective Raymond Navarro of the Detroit PD, she starts following a trail of blackmail, payback, and political ambition, little imagining where it will lead. Julia has risked her career before, but this time innocent lives--including her children's--hang in the balance, and justice may come too late to save what truly matters...\"Haseldine has a gift for atmosphere, setting, and suspense, and the many twists and turns will keep readers guessing.\" --Library Journal\"Haseldine uses her experience as a crime reporter to bring authenticity to this exciting and gritty tale.\" --Kirkus Reviews Praise for the first Julia Gooden Mystery THE LAST TIME SHE SAW HIM\"A sharp, breathless thriller. From the opening scene to the last, The Last Time She Saw Him, kept me flipping the pages. I loved it! Jane Haseldine is one to watch!\" --Lisa Jackson, #1 New York Times bestselling author\"So visually written and chilling, with such real, believable characters and twists that shocked. A gripping story that I read in one night--I could not put it down...\" --Debbie Howells, author of The Bones of You \"Haseldine's first novel is a solid read that fans of Debbie Howells, Julia Dahl, and Laura Lippman will appreciate.\" --Library Journal \"Terrific! Suspenseful, poignant, and completely surprising. Jane Haseldine's riveting story of love, danger, paranoia, and family is powerfully and emotionally authentic--and deserves a standing ovation.\" --Hank Phillippi Ryan, Agatha, Anthony, and Mary Higgins Clark award-winning author",
  "genres": [
    "Mystery",
    "Fiction",
    "Suspense",
    "Thriller",
    "Mystery Thriller",
    "Audiobook",
    "Crime"
  ],
  "author": "Jane Haseldine",
  "average_rating": "3.69",
  "url": "https://www.goodreads.com/book/show/31077367-duplicity"
}