{
  "title": "الطريق إلى الدولة الصومالية",
  "description": "\"الطريق إلى الدولة الصومالية\" كتاب يسلِّط الضوء حول العوامل المسببة للأزمة السياسية في الصومال، والتداعيات المانعة لإعادة تكوين الدولة الصومالية. وفي هذا العمل يقدم نخبة من المثقفين العرب والمسلمين أوراق بحثية فيما خصَّ الشأن الصومالي في محاولة لتتبع مسيرة الدولة الصومالية في إطارها التاريخي والسياسي والاجتماعي مروراً بمرحلة الاستعمار والحركة الوطنية فالاستقلال وتبعاته، إلى وقتنا الحاضر لتلمس الحل الأنسب للمعضلة الصومالية. حيث تتناول ورقة الدكتور \"محمد حسين معلم\"، ملامح من التاريخ السياسي والثقافي والاجتماعي والاقتصادي للصومال في المرحلة التي سبقت الاستعمار. وتتناول ورقة الدكتور \"محمد نور جعل\"، الأوضاع السياسية في الصومال تحت ظل الاستعمار. وتناقش الورقة الثالثة الأسباب وراء انهيار الدولة الصومالية الحديثة، بشقيها الداخلي والخارجي، وهي من إعداد السفير \"محمد شريف محمود\" الذي عاصر معظم الأحداث التي تناولتها ورقته، ومن خلالها ينقل إلينا شهادات حيّة من أحداث وملابسات انهيار الدولة الصومالية. أما الورقة الرابعة فهي من إعداد الدكتور \"إبراهيم قاسم فارح\" أستاذ العلاقات الدولية بجامعة نيروبي. وتتناول الورقة المصالحات الصومالية والعقبات التي واجهتها، وهي عبارة عن تقييم لجهود المصالحة وما تخللها من عيوب ينبغي تفاديها في المستقبل. وتستعرض الورقة الخامسة، المجتمع الصومالي ودوره في بناء الدولة الصومالية. أما السادسة فتناقش المجتمع الدولي ودوره في إعادة كيان الدولة في الصومال، وكلتاهما من إعداد الكاتب الصحفي والباحث في الشؤون الصومالية، الأستاذ \"عبد القادر محمد عثمان\". والورقة السابعة أعدّها الأستاذ \"بشير معلم عبد القادر\"، أستاذ الإدارة في المعهد الصومالي للتنمية الإدارية \"سيمد\"، وتتناول التحديات التي تقف أمام الجهود المبذولة في إعادة كيان الدولة الصومالية، وتستعرض الاستراتيجيات المستخدمة في إعادة بناء مؤسسات الدولة بعد الحرب، والعقبات التي تواجه هذه الاستراتيجيات، وسبل تجاوزها، كما تستعرض الورقة الجدل الدائر حول المركزية واللامركزية في الصومال، وإيجابيات وسلبيات كل نظام، بالإضافة إلى الخيارات المتاحة للحكومة الانتقالية الحالية التي تنتهي ولايتها في آب/أغسطس 2012. الجدير بالذكر أن كتاب \"الطريق إلى الدولة الصومالية\" هو العدد الثاني، ديسمبر 2010 وجاء تحت عنوان \"كتاب الشاهد\" بعد أن صدر العدد الأول في يناير 2010 باسم \"الشاهد الدوري\" وكان تحت عنوان \"الإسلاميون الصوماليون.. من الهامش إلى مركز الأحداث\".",
  "genres": [],
  "author": "Various",
  "average_rating": "4.33",
  "url": "https://www.goodreads.com/book/show/11925669"
}