{
  "title": "Against the Tide",
  "description": "Join the adventures and M/M romantic exploits of the students at Ridgemont University in this exciting new series.  M/M gay character driven sweet romance  Darryn Fredericks is an 18-year-old swimming wunderkind who has received a scholarship to study at the prestigious Ridgemont University. He comes from the wrong side of the tracks, and he’s determined to work hard to make life better for himself and his family, especially his young brother who suffers from psychological problems and needs special care. He is on track to be recruited for the national swimming team, if he can only stay focused and not let himself get distracted.  Unfortunately, his rival on the swim team, JP Terreblanche, seems intent on making his life a living hell. JP is one of the rich, privileged students at Ridgemont, and he sees Darryn as a threat to his own swimming success. JP especially can’t stand the way Darryn judges him because of his wealth, because there is so much more to his life than just his money. Besides, JP’s grandfather puts intense pressure on him to live up to the family name. But Darryn doesn’t seem to see that.  Their bitter rivalry leads to struggles for both of them, especially when JP’s thuggish friend Peet sets out to ruin Darryn’s life. But in the midst of all of their competitiveness and misunderstandings, feelings start to develop, feelings neither of them could have anticipated…  Will Darryn be able to overcome the hurdles Peet puts in his way and support his struggling family? Will JP be able to forge his own path and break free from the expectations of his grandfather? And who will be triumphant in the finals of the Ridgemont University swimming championships?  The Ridgemont University series follows the M/M gay romances of students at the fictional Ridgemont University in Cape Town, South Africa. The books are crammed full of flirty, fun and sweet romantic moments and complex characters that will make you care about them deeply (and maybe even have them tug at your heartstrings). The romances are organic and realistic, and even though the books are mostly light reading, they have enough substance for you to really dig into and think about long after you turn the last page. Give Ridgemont University a try; the boys might just steal your heart.",
  "genres": [
    "M M Romance",
    "Sports",
    "Contemporary",
    "College",
    "Romance",
    "LGBT",
    "Own"
  ],
  "author": "Meredith Taylor",
  "average_rating": "3.40",
  "url": "https://www.goodreads.com/book/show/31067909-against-the-tide"
}