{
  "title": "Krazy and Ignatz, 1929-1930: A Mice, a Brick, a Lovely Night",
  "description": "This volume is one in a long-term plan to chronologically reprint the entirety of the 28-year run of Krazy Kat's breathtaking Sunday page, most of which has not seen print since originally running in newspapers 75 years ago. Each volume is painstakingly edited by the San Francisco Cartoon Art Museum's Bill Blackbeard, the world's foremost authority on early 20th Century American comic strips, and designed by Jimmy Corrigan author Chris Ware. In addition to the 104 full-page black-and-white Sunday strips from 1929 and 1930 (Herriman did not use color until 1935), the book includes an introduction by Blackbeard and reproductions of rare Herriman ephemera from Ware's own extensive collection, as well as annotations and other notes by Ware and Blackbeard.Of special note to collectors, this is the period when Herriman was again liberated from the \"grid\" constraints of the mid-'20s and was able to compose his pages far more creatively, resulting in richer, more complex, more eye-pleasing compositions. Krazy Kat is a love story, focusing on the relationships of its three main characters. Krazy Kat adored Ignatz Mouse. Ignatz Mouse just tolerated Krazy Kat, except for recurrent onsets of targeting tumescence, which found expression in the fast delivery of bricks to Krazy's cranium. Offisa Pup loved Krazy and sought to protect \"her\" (Herriman always maintained that Krazy was gender-less) by throwing Ignatz in jail. Each of the characters was ignorant of the others' true motivations, and this simple structure allowed Herriman to build entire worlds of meaning into the actions, building thematic depth and sweeping his readers up by the looping verbal rhythms of Krazy & Co.'s unique dialogue.",
  "genres": [
    "Comics",
    "Humor",
    "Art",
    "Fiction",
    "Graphic Novels",
    "Comic Strips",
    "20th Century"
  ],
  "author": "George Herriman",
  "average_rating": "4.54",
  "url": "https://www.goodreads.com/book/show/311036.Krazy_and_Ignatz_1929_1930"
}