{
  "title": "أرض ورماد",
  "description": "\"ركضت نحو المنزل فوق غيمة من اللهب والدخان. على الطريق، رأيت والدة ياسين. كانت تركض عارية بالكامل... لم تكن تصرخ، بل تضحك وكأنها مجنونة تركض في جميع الاتجاهات. كانت في الحمام حين سقطت القذيفة... انفجر الحمام... ماتت بعض النساء، ودفن البعض الآخر وهنّ أحياء... لكن كنتي... لو فقدت عيني لحظتها كي لا أراها في عراها هذا. أردت التقاطها لكنها اختفت في اللهب. لا أعرف كيف وجدت المنزل لم يبق منه شيء لقد تحول إلى قبر لزوجتي، لابني الآخر، لزوجته وأطفاله. حلقك على شفير الانفجار. تسيل دمعة. تذهب لاستقبالها على عينيك بذيل عمامتك. من ثم تتابع! لم يبق سوى هذا الحفيد على قيد الحياة، ولا يستطيع أن يسمعني. اشعر كأنني أكلم حجراً. يحطم ذلك قلبي... لا يكفي الكلام يا أخي، إذا لم يسمعك أحد، إنه لا يفيد بشيء، مثل الدموع..\".كانت الحقيقة عند الروحانيين الفرس؛ بمثابة مرآة مهشمة، كل إنسان يمر من أمامها، يستل منها قطعة إذ يؤمن أنها تحتوي الحقيقة كلها. أفغانستان-التي كانت فيما مضى وحتى العهد القريب أرض الصوفيين والروحانيين تبدو اليوم لهذه المرآة. حطمتها الفصائل المتحاربة فيما بينها، بعد نضالها ضد جيش \"الاتحاد السوفياتي\" كما حولتها إلى بقاع متعادية، إذ نجد كلّ فصيل وقد أسس-في الجزء الذي ارتضاه لنفسه وبسط سيطرته عليه-حكمه.ولد \"عتيق رحيمي\" مؤلف هذه الرواية في كابول وهو يعيش ويعمل اليوم في باريس بعد أن طلب اللجوء السياسي إليها.. وقد اصدر مؤخراً روايته هذه \"أرض ورماد\" وهي الأولى في ترجمة فرنسية وفيها يروي قصة رحلة عبور الرجل العجوز الذي يدعي \"داستاغور\" وحفيده \"ياسين\" الذي أصيب بالصمم في أفغانستان.فالعجوز يرغب في الذهاب لطعن ابنه \"مراد\" والد ياسين بشفرة الحزن، رغب في أن يخبره عن موت والدته وزوجته وأخيه وعن عاهة ابنه. كان مراد يعمل في منجم فحم، يتعلّم فيه. أن يصبح بروليتاريا مثالياً كي يستطيع النظام الشيوعي أن يعتمد عليه وأن يؤسس من خلاله أفغانستان الجديدة. وعلى الرغم من أن الرجال في أفغانستان، لا يبكون أبداً، إلا أن العجوز ترك دموعه تنساب-وهو يروي القصة-بهدوء لتعبر عن آلامه. ترك دموعه تتدحرج في الغبار، وتسيل ببطء وهدوء لغاية صدره الذي هشمه الحزن وألم الفراق.",
  "genres": [
    "Fiction",
    "Novels",
    "Historical Fiction",
    "Asia",
    "War",
    "Short Stories",
    "Asian Literature"
  ],
  "author": "Atiq Rahimi",
  "average_rating": "3.63",
  "url": "https://www.goodreads.com/book/show/3111531"
}