{
  "title": "Translucid",
  "description": "Emé isn't who she thinks she is. She's something else. Something far more dangerous. She can't prove it because she doesn't remember her past, but she's certain she's not the simple security officer people tell her she is. She has knowledge and skills the average PAC officer doesn't. Whoever she is, she's far more important than the people around her realize. In the process of figuring out who she really is, she falls down a rabbit hole of conspiracy and espionage that threatens to light her entire galaxy on fire. Her problem is only a symptom of something far bigger.Anyone could be a part of the conspiracy, leaving her with no one she can trust. Not even the stranger she's apparently married to.Who can she depend on? Until she discovers what's real, she can't identify her true enemy, much less wage war against it. Somewhere within her is the key to it all. If she can unlock her true identity and purpose, she'll have everything she needs to unleash fury on those who betrayed her. If you enjoy intrigue, adventure, action, humor, and complex characters, you'll love this series. Grab this page-turning adventure today!Books in the Dragonfire Station universe in written order:Each series stands alone and need not be read in written order.Dragonfire Station Book 1: TranslucidDragonfire Station Book 2: FragmentsDragonfire Station Book 3: Coalescence(series complete)Intersections: Dragonfire Station Short StoriesMercenary Warfare Book 1: Selling OutMercenary Warfare Book 2: Blood MoneyMercenary Warfare Book 3: Hell to PayMercenary Warfare Book 4: Calculated RiskMercenary Warfare Book 5: Going for Broke(series complete)Chains of Command Book 1: New BloodChains of Command Book 2: Blood and BoneChains of Command Book 3: Cut to the BoneChains of Command Book 4: Out for Blood",
  "genres": [
    "Science Fiction",
    "LGBT",
    "Mystery",
    "Space Opera",
    "Lesbian",
    "Queer",
    "Thriller"
  ],
  "author": "Zen DiPietro",
  "average_rating": "4.07",
  "url": "https://www.goodreads.com/book/show/31120224-translucid"
}