{
  "title": "Evacuation",
  "description": "The Russian Mercenary known as Boris has always been a conundrum for governments the world over. His visage never changes, his capabilities never understood.  The Russian government gets word he has been killed on a mercenary mission in America, allowing agents to come in and attack the villages Boris has been protecting. Using a fanatical military sub-group in the Russian military, the atrocities start.  The only problem? Boris isn't dead, and now he has help.  Boris won't allow his people to go unprotected, and now the Queen Bitch herself has accepted his oath of fealty.  Russia doesn't have a clue what they have started when this Bear comes back from the Dead.  ***  **Please note, as mentioned in a review on a book in the main series, there is flagrantly foul language in these novels. The main character does not have a problem with cussing, just uninspired cussing.   THE BORIS CHRONICLES  Evacuation - The Boris Chronicles 01  Coming Soon: Revolution - The Boris Chronicles 02 Revelation - The Boris Chronicles 03 Restitution - The Boris Chronicles 04   The Kurtherian Gambit Main Series includes:  Death Becomes Her - The Kurtherian Gambit 01 Queen Bitch - The Kurtherian Gambit 02 Love Lost - The Kurtherian Gambit 03 Bite This - The Kurtherian Gambit 04 Never Forsaken - The Kurtherian Gambit 05 Under My Heel - The Kurtherian Gambit 06 Kneel or Die - The Kurtherian Gambit 07 We Will Build - The Kurtherian Gambit 08 It's Hell To Choose - The Kurtherian Gambit 09 Release The Dogs of War - The Kurtherian Gambit 10 Sued For Peace - The Kurtherian Gambit 11 Coming Soon  Short Stories Tied in to the Main Series include:  You Don't Mess with John's Cousin - Frank Kurns Stories of the UnknownWorld 01 Bitch's Night Out - Frank Kurns Stories of the UnknownWorld 02",
  "genres": [
    "Science Fiction",
    "Urban Fantasy",
    "Fantasy",
    "Paranormal",
    "Vampires",
    "Shapeshifters"
  ],
  "author": "Paul C. Middleton",
  "average_rating": "4.27",
  "url": "https://www.goodreads.com/book/show/31125645-evacuation"
}