{
  "title": "Blame It on the Shame Part 1",
  "description": "I never wanted anything of his...until her. Shame. It wounds us. It damages us.Or, for the few poor souls out there like me...it defines us.I'm the son of the devil himself—the most feared mob boss who ever lived.I was cursed from the moment I took my first breath.I hate him...and I never wanted to become him.And I sure as hell never wanted anything of his.Until her.My name is Ricardo DeLuca. There are two things you need to know about me. The first is—I'm in love with the girl who belongs to my father. The second is—it turns out I am my father's son after all.My name is Lou-Lou, and you probably think I'm a bitch.You would be right—because I am.You think you know all there is to know about me because of the man I belong to.What you don't know—is my past, because I'll never tell you. What you don't know is my shame.Because if you did—you'd be worse off than dead.You'd be broken.There are two sides to every story...this is ours. Warning: Due to strong language, some violence, explicit sexual content, and some dark elements, this book is not intended for readers under the age of 18.Trigger Warning: This series contains elements of emotional, sexual, and physical cruelty. Any readers with sensitivity to the above topics should proceed with caution, and at their own risk.Author's Note: This is part one of a three book series. (Blame It on the Shame: Lou-Lou and Ricardo's story.)However, in order to truly enjoy Lou-Lou and Ricardo's story, it is advised you read 'Blame It on the Pain' first.*Please be advised that Part 1 in this series (featuring a different couple) take place before any of the events in 'Blame It on the Pain' do. It is considered a 'prequel'. *This is a full-length novel: 67,000 + words.",
  "genres": [
    "Dark",
    "Abuse",
    "Romance",
    "Dark Romance",
    "Contemporary",
    "Audiobook",
    "Mafia Romance"
  ],
  "author": "Ashley Jade",
  "average_rating": "4.23",
  "url": "https://www.goodreads.com/book/show/31135635-blame-it-on-the-shame-part-1"
}