{
  "title": "Tainted Doves Trilogy",
  "description": "Girls, guns, grit and grace. Tainted Doves Trilogy is a collection of three historical western novellas where women run untamed and unbranded.  Whiskey's Women~  When three women living in the Arizona territory learn of the death of the famed gambler and ladies’ man Whiskey Logan, they take it upon themselves to travel to his funeral each believing that they are his only grieving widow. Their encounter over his dead body turns into a drunken brawl that ends with their un-holy alliance for revenge against his killer. Plotting revenge ain’t cheap, and since Whiskey left them with nothing but broken hearts and empty pockets, the women turn to breaking the law to become the first gang of lady outlaws in the territory. As they learn survive in the brutal west, they find that real love begins from within. But they won't stop until they take that last shot for Whiskey.   The Dust Garden~  Her name is Temptation—and Temptation is her curse. She hasn’t seen a living soul for five years. Her only companions are her children that are laid to rest in graves right outside her cabin—except for today, today there is a cowboy that fell face down in the dust next to the graves… He is begging for her help.   She’s terrified, but she's armed to survive.   The Gambler's Passion~  Beautiful Tawdry Summers is determined to fulfill her mother's dying wish and realize her dreams—even if it means she has to dance at the rowdy Bare Backed Belle’s, cheat at high-stakes poker, or run from bullets with a man she's given her innocence to. She'd do it all, and over again, to find love and keep her promise.  Jace Forrester gets a thrill living a double life—preacher's son by day, card hustler by night. Always after the big win, he can’t resist Tawdry’s ultimate challenge. He may lose more than he bargains for.",
  "genres": [],
  "author": "Elle Marlow",
  "average_rating": "4.60",
  "url": "https://www.goodreads.com/book/show/31129695-tainted-doves-trilogy"
}