{
  "title": "Lost Chronicles of the Maya Kings",
  "description": "Over the last two centuries explorers have made the most remarkable discoveries in the tropical forests of Central America. Across much of present-day Mexico, Guatemala, Belize and Honduras dozens of cities - some with populations of well over 100,000 - have been unveiled, and every year fresh reports emerge of the findings of unknown Maya ruins - great temples, palaces, towering stone pyramids and the tombs of the Maya kings. What these spectacular discoveries indicate is the former presence of an exceptionally advanced, sophisticated and complex society. Recently, major developments made in the decipherment of Maya hieroglyphics have revealed that alongside the material achievements of the Maya ran intellectual accomplishments in astronomy, maths and calendrics, seemingly tied to the complexities of Maya religion, that were remarkable for a society technically in the Stone Age. From reliefs on temple walls, from magnificent hieroglyphic stairways and from stone stelae planted by Maya rulers in the plazas of their cities has come written the Chronicles of the Maya Kings. In this fascinating book, David Drew brings to life this extraordinary civilisation. He answers questions about why they constructed their cities in the hostile setting of the jungle, the exact age of their ruins, the strange human images depicted in elaborate costume at so many Maya sites, and he asks why at the time of the Spanish conquest, all knowledge of the Mayas had been lost. He looks at their history, art, architecture, political systems, religion, and, finding that the Maya are not in fact a lost or dead people - there are still five million descendants living in Mexico - considers the ways in which their society today illuminates that of their ancestors.",
  "genres": [
    "History",
    "Nonfiction",
    "Anthropology"
  ],
  "author": "David Drew",
  "average_rating": "3.76",
  "url": "https://www.goodreads.com/book/show/311250.Lost_Chronicles_of_the_Maya_Kings"
}