{
  "title": "The Card Counter",
  "description": "Note: This is an alternate cover for the edition with ASIN B00H39Y6ZQ.Jake Walker has pressures coming at him from all sides. A long-time homicide detective for the city, he’s also a divorced father of three kids. With the kind of work he does, family life often takes a back seat. This is certainly the case when the bodies of the most outstanding players on the State University football team start being discovered brutally murdered. Why would anyone want to murder these guys? Detective Walker has to put family and everything else aside to solve these crimes before anybody else falls victim to this vicious killer who the press is now calling “The Card Counter”. As each victim turns up, the case becomes more traumatic and bizarre. The killer clearly has a point to make, and will continue to make people pay with their lives . . . until Walker and the rest of the city gets it! Find out who is murdered next, and follow Detective Walker until he uncovers the truth behind these killings, and the twisted motive for this murderous rampage. ***** A summary of reader reviews of ‘The Card Counter’: “…great romantic thriller with mystery and financial crimes with suspense, fraud and women sleuths...” “…good mystery book and suspense thriller with romantic suspense…” “...best mystery book, suspense thriller which is quite different from your typical thriller and mystery series and crime fiction new releases…” “…suspense and mystery combine to make this a novel worthy of staying up late for...great for fans of mystery and thriller…” “…a great suspense romance mystery and mystery series ….a great suspense thrillers and mysteries book…” \"…love the women sleuths role…a must read for any mystery lover…\" \"…wonderful mystery thriller suspense…amongst the best thriller books…\" “…enjoyed this crime and punishment series from the mystery genre….” “...the writing is true to formula for romantic thrillers, mystery romance novels...”“…bought this best mystery book 2015 for my dad who is a great fan of murder mystery best sellers...” “…one of the best and most suspenseful mystery thrillers and crime beat novels…” “...riveting mystery and thrillers ...with romantic suspense and a web of deceit and fraud...” “…great mystery series with romance and suspense...”",
  "genres": [
    "Mystery",
    "Amazon",
    "Thriller",
    "Fiction",
    "Serial Killer",
    "Mystery Thriller"
  ],
  "author": "James Kipling",
  "average_rating": "3.84",
  "url": "https://www.goodreads.com/book/show/31133043-the-card-counter"
}