{
  "title": "The Conservative Case for Trump",
  "description": "<!--[if gte mso 9]> <![endif]--> “As a tribute to the late, great Phyllis Schlafly, I hope everybody can go out and get her latest book, The Conservative Case for Trump .” —Donald Trump Phyllis Schlafly passed away on September 5, 2016, the day before the release of this book. In it, she addresses her fellow conservatives with a passionate plea to ignore establishment kingmakers and support controversial GOP presidential candidate Donald Trump. “The stakes are unmistakably high,” Schlafly writes in the introduction. “I know that some well-meaning conservatives find Trump puzzling or even offensive, but I trust that this book—the culmination, for me, of more than seventy years of active involvement in Republican politics—might help sway them.” Schlafly, the conservative icon whose celebrated classic A Choice Not An Echo (over 3 million copies sold) upended the 1964 Republican Convention, persuasively argues that Donald Trump is worthy of every conservative’s vote. Joined by Ed Martin, the former head of the Missouri Republican Party, and Brett Decker, formerly an editorial writer with the Wall Street Journal and the Washington Times , Schlafly presents the real Trump, the Trump she and her colleagues have met with and interviewed, the Trump who is far more conservative than you think.In The Conservative Case for Trump , Schlafly 1. How Trump’s appointees to the Supreme Court (on which Schlafly advised him) could be the most consequential in a century2. How, unlike any other Republican, Trump could actually fix the nation’s immigration mess3. Why his economic platform could spark an economic revival on the scale of the Reagan boom of the 1980s (it is based on much the same plan)4. How Trump will defend the First Amendment—guaranteeing freedom of speech and religion—against an ever more dictatorial Left5. Why Trump’s fresh thinking on defense and foreign policy is long overdue—and could send terrorism into rapid retreatDonald Trump is the most controversial Republican presidential candidate since Barry Goldwater, and could be the most conservative and successful president since Ronald Reagan. In her very last contribution to the conservative movement, Phyllis Schlafly, the “sweet-heart of the Silent Majority,” makes an irrefutable case that needs to be shared with every wavering voter. Nothing less than the future of our country is at stake. <!--[if gte mso 9]> Normal 0 false false false EN-US X-NONE X-NONE <![endif]--><!--[if gte mso 9]> <![endif]--><!--[if gte mso 10]> /* Style Definitions */ table.MsoNormalTable {\"Table Normal\"; \"\"; 5.4pt 0in 5.4pt; %; \"Calibri\",sans-serif; } <![endif]-->",
  "genres": [
    "Nonfiction",
    "Political Science",
    "Politics",
    "History"
  ],
  "author": "Phyllis Schlafly",
  "average_rating": "3.73",
  "url": "https://www.goodreads.com/book/show/31142946-the-conservative-case-for-trump"
}