{
  "title": "Holy War: How Vasco da Gama's Epic Voyages Turned the Tide in a Centuries-Old Clash of Civilizations",
  "description": "A sweeping historical epic and a radical new interpretation of Vasco da Gama’s groundbreaking voyages, seen as a turning point in the struggle between Christianity and IslamIn 1498 a young captain sailed from Portugal, circumnavigated Africa, crossed the Indian Ocean, and discovered the sea route to the Indies and, with it, access to the fabled wealth of the East. It was the longest voyage known to history. The little ships were pushed beyond their limits, and their crews were racked by storms and devastated by disease. However, their greatest enemy was neither nature nor even the sheer dread of venturing into unknown worlds that existed on maps populated by coiled, toothy sea monsters. With bloodred Crusader crosses emblazoned on their sails, the explorers arrived in the heart of the Muslim East at a time when the old hostilities between Christianity and Islam had risen to a new level of intensity. In two voyages that spanned six years, Vasco da Gama would fight a running sea battle that would ultimately change the fate of three continents.An epic tale of spies, intrigue, and treachery; of bravado, brinkmanship, and confused and often comical collisions between cultures encountering one another for the first time; Holy War also offers a surprising new interpretation of the broad sweep of history. Identifying Vasco da Gama’s arrival in the East as a turning point in the centuries-old struggle between Islam and Christianity—one that continues to shape our world—Holy War reveals the unexpected truth that both Vasco da Gama and his archrival, Christopher Columbus, set sail with the clear purpose of launching a Crusade whose objective was to reach the Indies; seize control of its markets in spices, silks, and precious gems from Muslim traders; and claim for Portugal or Spain, respectively, all the territories they discovered. Vasco da Gama triumphed in his mission and drew a dividing line between the Muslim and Christian eras of history—what we in the West call the medieval and the modern ages. Now that the world is once again tipping back East, Holy War offers a key to understanding age-old religious and cultural rivalries resurgent today.",
  "genres": [
    "History",
    "Nonfiction",
    "Religion",
    "European History",
    "Portugal",
    "Travel",
    "India"
  ],
  "author": "Nigel Cliff",
  "average_rating": "4.13",
  "url": "https://www.goodreads.com/book/show/11928994-holy-war"
}