{
  "title": "Death Warmed Over: Funeral Food, Rituals, and Customs from Around the World",
  "description": "You'll think you've died and gone to heaven when you sample the delicious fare laid out in DEATH WARMED OVER, a unique collection of 75 recipes typically served at funeral ceremonies, alongside descriptions of rituals and traditions from cultures around the world. One part sociological study and one part cookbook, DEATH WARMED OVER explains the background and proper timing for such culinary rituals as passing a hen and a loaf of bread over a grave as dirt is shoveled onto the coffin, serving chocolate caskets and skull-shaped cakes at a funeral, and baking up a Funeral Pie to acknowledge the passing of a loved one. Whether you've been asked to provide food for a funeral feast or wish to bring an appropriate culinary contribution for the extended mourning period, look no further than DEATH WARMED OVER. A unique cookbook that shows you how to incorporate long-standing ethnic and cultural traditions-from the Amish and Eskimo to Greek and Polish-into the planning of a well-rounded celebration of life. With detailed mail-order resources for specialty and ethnic foods. Features suggestions for ways to incorporate recipes and traditions into nonfuneral parties or gatherings. Cover image title, \"Post-Mortem Club with Past Member\" (August 3, 1934). The Post-Mortem Club, an organization of naprapaths, held its annual breakfast with all chapter members present although the president, J. M. McAdou, founder, had died during the past year. One of the rules of the club is that each member will his skeleton to it, for atttendence to club meetings despite death.\"Lisa Rogak's recipe-enriched approach to funeral customs around the world reminds us that these rites are for the living. Digging into her slow-cooked jambalaya dish meant to be served after a New Orleans jazz funeral would make anyone feel happy to be alive.\"-Barbara Haber, author of From Hardtack to Home Fries: An Uncommon History of American cooks and Meals",
  "genres": [
    "Nonfiction",
    "Cookbooks",
    "Death",
    "Food",
    "History",
    "Religion",
    "Cultural"
  ],
  "author": "Lisa Rogak",
  "average_rating": "3.54",
  "url": "https://www.goodreads.com/book/show/311378.Death_Warmed_Over"
}