{
  "title": "The Missing Piece: Solving the Puzzle of Self",
  "description": "A decade has passed since Claudia Black's million-copy bestseller, It Will Never Happen to Me, set countless individuals on the path to self-discovery. Now, in The Missing Piece, Black teams up with therapist and lecturer Leslie Drozd to give you the courage, practical information, and the loving guidance to take the next step on your journey to wholeness.In this new book, Black and Drozd explore the life crisis experienced by individuals consumed with the nagging feeling that \"something's missing.\" These vague, unsettling feelings often take the form of unexplained anger or fear, a sense of inadequacy or ambivalence, the inability to commit, or depression that comes and goes. They trace this condition to the conflicting and often disowned pieces of self in all of us that compete for attention and critic, pusher, judge, victim, spiritual seeker, perfectionist, nurturer, protector, aggressor, and procrastinator, among others. Only by defining and embracing all aspects of the self--both good and bad--can we find \"the missing piece\" that truly liberates and empowers us.The journey is not a guided tour. This dynamic book engages you in a series of inspiring and challenging questionnaires, exercises, and dialogues. It's an active process in which you will learn how to assemble a complex self-portrait of all your parts--the owned, the disowned, and the unknown.Understanding all the aspects of your self is the first step. But this path must also include moving from questions to answers, and then from answers to actions. In the final section, you'll learn how to forge lasting bonds between all the competing aspects of your self, to achieve a sense of balance between your inner and outer worlds, and to dare to live the truth about yourself.",
  "genres": [
    "Psychology"
  ],
  "author": "Claudia Black",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/311430.The_Missing_Piece"
}