{
  "title": "HOT SEAL Rescue",
  "description": "Navy SEAL Cody “Cowboy” McCormick is in Las Vegas for a little R & R before his friend’s wedding when a beautiful blonde jams a gun in his side and abducts him from a casino in broad daylight. He could stop her, but he plays along because he’s intrigued—plus he’s convinced she’s in danger.CIA agent Miranda Lockwood’s life is on the line when an undercover operation goes wrong. Little does she know when she sashays up to the biggest, baddest looking dude in the casino lobby that she’s kidnapping a Navy SEAL—or that she’ll be unable to resist his charm when he turns up the heat.When the CIA labels her a rogue agent, Miranda’s faith in everything she believes in is shaken to the core. Cody’s the only one she can trust to help her find the traitor in the agency. But even though she’s forced to betray him, she can’t get over the SEAL who made her feel safe in his arms. Miranda will have to fight harder than she’s ever fought for anything if she wants his forgiveness—but Cody’s not in a forgiving mood in spite of the sparks that still fly when he’s forced to team up with her again.When disaster strikes and they’re caught in the line of fire, Cody will do everything in his power to keep them both alive. Because if he doesn’t, he’ll never get to hold Miranda close again…  NOTE: If you read the first part of this story in SEALs of Summer 3, this is the complete book.  HOT SEAL TEAM SERIES: Book 1: HOT SEAL (Dane & Ivy) Book 2: HOT SEAL Lover (Remy & Christina) Book 3: HOT SEAL Rescue (Cody & Miranda)  THE HOSTILE OPERATIONS TEAM SERIES: Book 1: HOT Pursuit (Matt & Evie) Book 2: HOT Mess (Sam & Georgie) Book 3: HOT Package (Billy & Olivia) Book 4: Dangerously HOT (Kev & Lucky) Book 5: HOT Shot (Jack & Gina) Book 6: HOT Rebel (Nick & Victoria) Book 7: HOT Ice (Garrett & Grace) Book 8: HOT & Bothered (Ryan & Emily) Book 9: HOT Protector (Chase & Sophie) Book 10: HOT Addiction (Dex) ~ Coming soon! Book 11: HOT Valor (Mendez) ~ Coming soon!  Reviews:  \"...one of those must read black ops series that is as good as Maya Banks & Cindy Gerard!\" -- Just Plain Sassy  \"Seriously is there a hotter series out there in this genre? Because if there is, I don't know about it. I have loved these books from book 1 and they are only getting better and better not to mention hotter!!!\" -- Goodreads  \"So, one of my favorite series (HOT) just got an infusion of new blood...SEAL blood. That's right, HOT SEALs!\" -- Saved by Suspense  \"Another awesome effort and A+ read in this world of the maybe-mythed-but-oh-my-they-do-exist Hostile Operations Team.\" -- Mignon Mykel Reviews  \"As for Navy SEAL Dane “Viking” Erikson? Well if the man doesn't melt the panties off of you, I just don't know if we're reading the same book.\" -- Dirty Girl Romance  Want to chat about the HOT guys? Join Lynn's Facebook Readers and Fans Group at on.fb.me/1cyN8Xt (copy and paste into your browser). To sign up for Lynn's newsletter--where you'll be kept up to date about all of Lynn's books--text the word HOTTIES to 33733 or copy and paste this link into your browser: http://bit.ly/LRHNews",
  "genres": [
    "Military Fiction",
    "Romantic Suspense",
    "Romance",
    "Contemporary Romance",
    "Suspense",
    "Military Romance",
    "Contemporary"
  ],
  "author": "Lynn Raye Harris",
  "average_rating": "4.44",
  "url": "https://www.goodreads.com/book/show/31140089-hot-seal-rescue"
}