{
  "title": "The Merriweather Sisters Books 1-3",
  "description": "alternate cover edition of ASIN B01HYRTXQSRead the first three books in the medieval time travel romance series: A Knight to Remember, Knight Moves, Lonely Is the Knight, in this special offering.Book 1: A Knight to RememberFall through time...Vacation to England. Check. Haunting castle ruins. Check.Proper English lord for a boyfriend.Well, almost check. Be careful what you wish for…Lucy Merriweather’s supposedly perfect boyfriend attempted to murder her during a visit to Blackford Castle. Falling through time to 1300s medieval England, she lands in a tangled heap at the feet of a tarnished grumpy knight with secrets of his own and no time to spare for a crazy damsel in distress.Book 2: Knight MovesLose yourself in time…A missing sister and totally fishy story.Check.A haunting castle in England.Check.Finding out news that rocks your world.Check. And double check.Be careful when you go searching for answers…Melinda Merriweather’s sister vanished on a trip to England. When someone tries to kill Melinda Merriweather, she knows there’s more to the story of her missing sister. Determined to find out what happened, Melinda lands in England, only to get more than she bargained for.A picture she can’t explain. A wrong turn leading to Falconburgh Castle and a whopper of a storm. Falling through time to 1300s medieval England, she finds herself staring at the pointy end of a wicked-looking sword. A weary knight swoops in and rescues Melinda, only to find out she’s no swooning damsel in distress. Now Melinda’s greatest fear is falling in love and never finding out what happened to her sister.Book 3: Lonely Is the KnightTravel through time... Both sisters lost to the mists of time.Check.Attempted murder.Check.Actually traveling through time to medieval England?Triple check.Beware ghosts trying to help…Charlotte Merriweather didn’t plan to steal the gorgeous low-slung sports car. But in her defense it was just sitting there running, with the door open, beckoning her. A terrible accident sends her traveling through time to 1330 England. Surely the handsome knight of the castle will aid her in the search to find her missing sisters?Henry Thornton has sworn never to marry. Even if he is enchanted by the odd woman he finds washed up on the shore. He'll aid her and send the lady on her way.Or not. As the castle falls under siege trapping Charlotte and Henry within the stone walls, will they risk everything for a chance at a love meant to last forever? The series picks up with the Thornton Brothers in Darkest Knight with four books in that series and more to come!Book 1: A Knight to RememberBook 2: Knight MovesBook 3: Lonely Is the KnightBook 4: Darkest KnightBook 5: Forever KnightBook 6: First Knight Book 7: Last KnightBook 8: coming soon",
  "genres": [
    "Time Travel",
    "Romance",
    "Historical Romance",
    "Historical",
    "Paranormal",
    "Fantasy",
    "Historical Fiction"
  ],
  "author": "Cynthia Luhrs",
  "average_rating": "4.25",
  "url": "https://www.goodreads.com/book/show/31160367-the-merriweather-sisters-books-1-3"
}