{
  "title": "Yes, You're Pregnant, But What About Me?",
  "description": "At fifty-three, Kevin Nealon thought he had it a massive international celebrity with legions of loyal fans; a fabulous modeling career; hundreds of millions of dollars in the bank; and the most recognizable face on the planet. Nealon had accomplished the a thirty-year career in show business with only limited trips to rehab. But just like every other celebrity, he felt that was not enough. The perpetually insatiable Nealon wanted more, and for him \"more\" meant a little addition that drooled, burped, and pooped (no, not a Pomeranian). Now, in his first-ever book, Nealon tells the outrageous story of how he battled through aching joints, Milano cookie cravings, and a rapidly receding hairline to become a first-time dad at an age when most fathers are packing their kids off to college. Offering hysterical commentary about his fickle, often hormonal, road to belated and bloated fatherhood, Nealon guides you through the delivery room and beyond, discussing how his past, his wife, and his neuroses all converged in a montage of side-splitting insecurities during the months leading up to the birth of his son. In Yes, You're Pregnant, But What About Me? , Nealon details his trip through all the emotional stages of pregnancy—uncomfortable, denial, hungry, sleepy, self-conscious, hungrier, confused, cranky, not-quite-as-hungry but still craving something, sweaty, covered in cookie crumbs—all while struggling to keep his blood pressure down and find the time to read the latest issue of the AARP Bulletin . Wrestling with the dilemmas and fears that fathers have been dealing with for centuries (Can I duct-tape a crib together? How often can I reuse a disposable diaper? What if the baby looks like me and not my wife?) , Nealon never fails to entertain with the frequent lunacy and inevitable joy that punctuate his story about parenthood. Laugh-out-loud funny and remarkably poignant, Nealon's entertaining perspective and his wealth of sarcasm provide a take on fatherhood that is as fresh as it is universal, always reminding you that half the fun of being a parent is getting there.",
  "genres": [
    "Humor",
    "Nonfiction",
    "Memoir",
    "Parenting",
    "Comedy",
    "Audiobook",
    "Autobiography"
  ],
  "author": "Kevin Nealon",
  "average_rating": "3.39",
  "url": "https://www.goodreads.com/book/show/3117336-yes-you-re-pregnant-but-what-about-me"
}