{
  "title": "Troubling a Star",
  "description": "In book five of the award-winning Austin Family Chronicles young adult series from Madeleine L’Engle, author of A Wrinkle in Time , a girl experiences the difficulties and joys of growing up.The Austins have settled back into their beloved home in the country after more than a year away. Though they had all missed the predictability and security of life in Thornhill, Vicky Austin is discovering that slipping back into her old life isn't easy. She's been changed by life in New York City and her travels around the country while her old friends seem to have stayed the same. So Vicky finds herself spending time with a new friend, Serena Eddington―the great-aunt of a boy Vicky met over the summer.Aunt Serena gives Vicky an incredible birthday gift―a month-long trip to Antarctica. It's the opportunity of a lifetime. But Vicky is nervous. She's never been away from her family before. Once she sets off though, she finds that's the least of her worries. She receives threatening letters. She's surrounded by suspicious characters. Vicky no longer knows who to trust. And she may not make it home alive.Books by Madeleine L'EngleA Wrinkle in Time QuintetA Wrinkle in TimeA Wind in the DoorA Swiftly Tilting PlanetMany WatersAn Acceptable TimeA Wrinkle in The Graphic Novel by Madeleine L'Engle; adapted & illustrated by Hope LarsonIntergalactic P.S. 3 by Madeleine L'Engle; illustrated by Hope A standalone story set in the world of A Wrinkle in Time .The Austin Family ChroniclesMeet the Austins (Volume 1)The Moon by Night (Volume 2)The Young Unicorns (Volume 3)A Ring of Endless Light (Volume 4) A Newbery Honor book!Troubling a Star (Volume 5)The Polly O'Keefe booksThe Arm of the StarfishDragons in the WatersA House Like a LotusAnd Both Were YoungCamillaThe Joys of Love",
  "genres": [
    "Young Adult",
    "Fiction",
    "Fantasy",
    "Mystery",
    "Adventure",
    "Childrens",
    "Teen"
  ],
  "author": "Madeleine L'Engle",
  "average_rating": "3.86",
  "url": "https://www.goodreads.com/book/show/3118443-troubling-a-star"
}