{
  "title": "Candles on The Ganges",
  "description": "Following the tragic death of his young son and armed only with a basic belief in life after death the author set off on a six year search for his son. The journey was to take him deep into the spiritual world of mediumship and meditation and as he trained in these, other doors opened, with those higher spiritual beings we call angels intervening in his life and guiding him on his journey to understanding.The author tells the story of this inner journey as he travels through the holy places of India seeking a rishi to take him to a higher level during meditation so that he can once again feel his son's presence and know that he is happy. As he travels, the loving people he meets, with their innocence and joyful laughter, warm his heart while his little son sits, just out of sight saying, \"I am here with you dad!\" Ultimately he finds what he is searching for in a most unexpected place and from a completely unexpected source.As you follow the author on his journey he gives clear, logical explanations for much of what we would call the occult or the mystic; from ghosts and poltergeists to levitation and psychometry, and as he delves into the blurred boundary where science and religion come together he even explains his theory on eternal life.Candles on The Ganges is about the illusion that we call life and the reality that lies beyond it. It is a book of spiritual growth and understanding wrapped up in an enthralling journey through India.Page 1: \"Sir, I am a fortune teller and a yogi and I must tell you that a lot of love comes to you on April 21st.\"The words struck me in the heart. The bustling street scene vanished from view and for that moment there was no one in the universe but the yogi and myself with Michael hovering magically but unseen between us. April 21st was Michael's birthday, my dear little boy whose death, six years before, had started me on the spiritual journey which now dominated my life and had finally brought me to this Indian marketplace in the back streets of Delhi. I had only been in India 36 hours and already he had found a way to let me know that he was here with me.In search of Michael I had devoted every spare moment in the years since his death to training as a medium. I had read every book I could find that might increase my spiritual understanding, had meditated, prayed, and raged, and was now in India searching for a guru or rishi who could take me that higher step which had so far proved elusive. Rather than having to rely on the reassurances and messages that came through other mediums, I wanted to feel his living presence and know for myself that Michael was happy.I shouldn't have been surprised that Michael had come with me to India. He had been back to communicate with us through mediums on so many occasions, always letting us know that he knew exactly what we had been up to, reassuring us that he was more alive than he had ever been and so very happy. Michael was such a clever little boy that he never lost a chance to pop in and announce his presence. Just the previous week while I was at work as a London taxi driver one of my passengers said to me in the middle of our, otherwise everyday conversation, \"Since I was a child I have always been able to see spirit people and right now there is a little boy with blond hair and blue eyes sitting next to you in the front of the taxi\"Yet it was an extra special joy to hear from him now at the start of my trip when I was alone in a strange country and about to embark on a journey into the unknown.",
  "genres": [
    "Nonfiction",
    "Grief",
    "Spirituality",
    "Paranormal",
    "Memoir"
  ],
  "author": "Peter E. Upton",
  "average_rating": "4.19",
  "url": "https://www.goodreads.com/book/show/31180496-candles-on-the-ganges"
}