{
  "title": "The Baller's Secret Baby",
  "description": "He may be a player, but this stud’s not shooting blanks.\n​\nNICK\nI'm nobody's baby daddy.I don't care how many stunning women throw themselves at me, looking to turn one hot night into an eighteen-year paycheck.I've got way too much on the line to throw it away for one night of pleasure.Ball is life, and basketball is my first priority.I've got a championship to win.But when I see that familiar face shaking her pom-poms on the sidelines, I’m transported back to childhood,Back to the days before a fiery plane crash ripped us apart, forcing us to grow up overnight.Those were the days when Eden Evans stole my heart.This time, I might be ready to give it right back to her.\nEDEN\nI have no interest in a man who comes with groupies.With a rock legend for a father, I’ve seen the toll fame takes on a marriage.The last thing I need is a guy with more Twitter followers than Justin Beiber.So when Nick Barnes dribbles his way back into my life, my heart and head go into battle.I can't fight my desire for the sexy baller with his eight-pack abs and panty-dropping charm.And when that little stick shows an unmistakable plus sign, suddenly, everything is on the line.\n\nWith a secret baby on the way, will Nick realize that having the home court advantage is what he's wanted all along?\n\n\nThis is a standalone romance novel with a HEA and no cliffhangers. Light on basketball and heavy on steamy romance, this is the first book featuring members of the Barnes family. To celebrate this new release, for a limited time, this edition of The Baller’s Secret Baby also includes the first TWO BOOKS of the Web Master Trilogy as a special free bonus – Her Web Master and Tested by Her Web Master.",
  "genres": [
    "Sports",
    "Romance",
    "Sports Romance",
    "Contemporary Romance",
    "Audiobook",
    "Contemporary",
    "Basketball"
  ],
  "author": "Normandie Alleman",
  "average_rating": "3.59",
  "url": "https://www.goodreads.com/book/show/31179399-the-baller-s-secret-baby"
}