{
  "title": "Georgia Cooking in an Oklahoma Kitchen: Recipes from My Family to Yours",
  "description": "Trisha Yearwood, host of Food Network’s Trisha’s Southern Kitchen, is adored by fans as one of country music’s top stars, but among family and friends, Trisha Yearwood is best known for another talent: cooking. Throughout her life–from her humble roots in Georgia to her triumphant recording years in Nashville and a fulfilling married life with husband Garth Brooks in Oklahoma–Trisha has always enjoyed feeding those she loves. Now she dishes up a collection of more than 120 of her go-to recipes in a tribute to both home-grown cooking and family traditions. Trisha believes a recipe always tastes better when it has a memory attached to it. Here, she teams up with her mother and sister to share their family’s best-loved recipes. This is the kind of classic comfort food you’ll want at the heart of your own family’s mealtime memories. Inside is a full menu of Southern fare with a contemporary twist. But you don’t have to be a Southerner to enjoy Yearwood family favorites such as: Trisha’ s Chicken Tortilla Soup Gwen’s Fried Chicken with Milk Gravy Stuffed Pork Chops Breakfast Sausage Casserole Blackberry Cobbler Banana Pudding Along with the recipes for inviting soups, textural salads, home-style family entrées, colorful side dishes, and irresistible desserts, Trisha shares everything from charming personal anecdotes to practical advice, time-saving tips, and creative ingredient substitutions to accommodate all tastes. With full-color photographs taken in and around Trisha’s homes and a foreword by Garth Brooks, this soul-warming slice of Southern life will delight country music fans and home cooks alike. Best of all, this is un-pretentious food that is easy to put together, satisfies even big country appetites, and tastes like home. Trisha’ s warm evocations of pre-paring food for loved ones will transport you back to your own childhood. These are recipes you’ll enjoy with your family for years to come.",
  "genres": [
    "Cookbooks",
    "Cooking",
    "Nonfiction",
    "Reference",
    "Southern",
    "Food"
  ],
  "author": "Trisha Yearwood",
  "average_rating": "4.29",
  "url": "https://www.goodreads.com/book/show/3117744-georgia-cooking-in-an-oklahoma-kitchen"
}