{
  "title": "The Moon by Night",
  "description": "Book two of the Austin Family Chronicles, an award-winning young adult series from Madeleine L’Engle, author of A Wrinkle in Time , about a girl who experiences the difficulties and joys of growing up.“Everyone who remembers Meet the Austins as a delightful family story will want to read . . . this wise, beautifully written novel.” ― Chicago TribuneAs if simply being fourteen-years-old weren't bad enough―what with the usual teenage angst and uncertainty, Vicky Austin's always comforting and reliable home life is changing completely. Her brother John is going off to college in the fall. Maggy, an orphan taken in by the Austins two years ago, has gone to live with her legal guardian. And the rest of Vicky's family is moving from their quiet house in the country to the heart of New York City.But before the big move, the entire Austin family is taking a meandering trip across the country in their station wagon, stopping to camp along the way, with no set schedule and not a single night of camping experience among them.Wild animal attacks. Life-threatening natural disasters. Cute boys on the prowl. Anything can happen in the great outdoors.Praise for The Moon by Night :“Idealistic and wise, this is also absorbing reading and very much a story of today.” ― The Horn Book Magazine“Everyone who remembers Meet the Austins as a delightful family story will want to read its successor. . . . Vicky, groping painfully for answers, finding help from many sources, will strike chords of sympathy and understanding in her contemporaries, who are certain to find comfort and satisfaction in this wise, beautifully written novel.” ― Chicago Tribune“The Austin family spends the summer on a cross-country camping trip . . . Vicky, now ‘almost 15,' tells the story, and the reader feels a strong personal identification with the thoughts and emotions of this age group through her story.” ― School Library Journal“With natural dialogue and good characterization, this story of an intelligent, lifelike family is far superior to the average fare for the early teens.” ― BooklistBooks by Madeleine L'EngleA Wrinkle in Time QuintetA Wrinkle in TimeA Wind in the DoorA Swiftly Tilting PlanetMany WatersAn Acceptable TimeA Wrinkle in The Graphic Novel by Madeleine L'Engle; adapted & illustrated by Hope LarsonIntergalactic P.S. 3 by Madeleine L'Engle; illustrated by Hope A standalone story set in the world of A Wrinkle in Time .The Austin Family ChroniclesMeet the Austins (Volume 1)The Moon by Night (Volume 2)The Young Unicorns (Volume 3)A Ring of Endless Light (Volume 4) A Newbery Honor book!Troubling a Star (Volume 5)The Polly O'Keefe booksThe Arm of the StarfishDragons in the WatersA House Like a LotusAnd Both Were YoungCamillaThe Joys of Love",
  "genres": [
    "Young Adult",
    "Fiction",
    "Fantasy",
    "Childrens",
    "Romance",
    "Middle Grade",
    "Classics"
  ],
  "author": "Madeleine L'Engle",
  "average_rating": "3.81",
  "url": "https://www.goodreads.com/book/show/3118441-the-moon-by-night"
}