{
  "title": "Spark",
  "description": "Warning: This story is for mature adults only. It contains violence, mature and explicit content and non-consensual/dubious, graphic sexual activity that some readers may find upsetting. This is a dark erotic thriller, not to be confused with a dark romance. HERThere are not enough words to describe my internal torment. I knew there would be consequences for what I did. I knew this would be hard. But it’s so much harder than I ever want to admit. Physically broken, mentally drained, and legally dead, I now find myself wasting away on an island in the middle of the Bahamas. Darren has left me in isolation for my own recovery and the only thing I can be grateful for is the fact that my isolation includes him. But I know he won’t be able to stay away for long. Eventually he’ll be back to reclaim what’s his and remind me of all the things I hate about him. How he’s able to twist fear with pleasure to create the most destructive combination, how it rushes through my blood and simmers under my skin, making me come alive and burn for more. Sometimes I don’t know who I hate more, him or myself? After everything that’s happened, after everything I’ve allowed myself to feel, I deserve a little self-hatred. I can feel my will to continue fighting diminishing, the fire in my heart barely more than embers, but I promised Jason I would find him. I promised my family I would find a way back to them. Darren may own me, but he doesn’t own my intentions. And even though he may have broken my body, he will never break my will to survive. I’ll find a way. Somehow, I’ll find my way out of the dark, even if it’s with the tiniest little spark.HIMNothing plagues my mind more than that goddamn, stubborn ass redhead. Too often, I find myself thinking of nothing else, and no matter how many miles I put between us to focus on my work, Jaden still finds a way to kick the damn door down and pull me under. I may not have been able to keep her out of my head, but I was able to keep her hidden away on my private island in the Bahamas. I wanted to ensure her recovery would remain uninterrupted from other potential distractions. It would be pretty tough to escape from an island in the middle of the ocean, surrounded by guards with broken bones and a broken ego. Jaden wasn’t going anywhere, not this time, not until I was ready to take her back with me. She had a lot to prove until then. I knew she was more than physically damaged. Her confidence in herself shattered the night I crushed her in my arms and I had a feeling it was going to take a lot of inner strength for her to put it back together. But that was the one thing I knew she had a never-ending supply of. Her strength was admirable and I was confident she’d find it again. I just had to make sure it lacked one thing when we eventually returned home – her desire to kill me. There were two ways I could accomplish that – positive reinforcement or negative reinforcement. I suppose the technique would depend on Jaden’s ability to adapt, but knowing her, I was going to have to fight this at every angle … and didn’t I always love a good fight.*NOTE: For every book that is sold, a portion of the proceeds will be donated to a charity that benefits victims of human trafficking.*",
  "genres": [
    "Dark",
    "Dark Romance",
    "Contemporary",
    "BDSM",
    "Abuse",
    "Erotica",
    "Thriller"
  ],
  "author": "Jay Marie",
  "average_rating": "4.41",
  "url": "https://www.goodreads.com/book/show/31179672-spark"
}