{
  "title": "The Hidden Genes of Professor K",
  "description": "A medical breakthrough. A greedy pharmaceutical magnate. A brutal double-murder. One tangled web of lies.World-renowned scientist, Professor K is close to a ground-breaking discovery. He’s also dying. With his last breath, he anoints Dr Alexandra Delacroix his successor and pleads with her to carry on his work. But powerful forces will stop at nothing to possess the research, unwittingly plunging Delacroix into a treacherous world of unbridled ambition and greed. Desperate and alone, she turns to celebrated author and journalist, Jack Rogan.Rogan must help Delacroix while also assisting famous rock star Isis in the seemingly unrelated investigation into the brutal murder of her parents. With the support of Isis’ resourceful PA, a former police officer, a tireless campaigner for the destitute and forgotten, and a gifted boy with psychic powers, Rogan exposes a complex web of fiercely guarded secrets and heinous crimes of the past that can ruin them all and change history.Will the dreams of a visionary scientist with the power to change the future of medicine fall into the wrong hands, or will his genius benefit mankind and prevent untold misery and suffering for generations to come? The Hidden Genes of Professor K is Book 3 in Jack Rogan Mysteries Series but can be enjoyed as a stand-alone novel.“Outstanding Thriller” of 2017Independent Author Network Book of the Year Awards\"The Hidden Genes of Professor K combines imagination, history, and knowledge of the leading edge of medical science to weave an epic tale of greed and intrigue. It takes the reader into the recesses of the human psyche, the hidden corners of history, and the dark matter of the human genome. The secrets are all there.\" Professor John Mattick AO FAA, Executive Director of the Garvan Institute of Medical Research, Sydney, Australia\n What readers are saying about The Hidden Genes of Professor K\nA fast-paced thriller that delves into the exciting world of DNA and genome research ~ Sally AsnicarA complex mystery with an intricate plot. ~ Saundra WrightThis is a fantastic book. There are so many twists & turns ... ~ S M R SARMAAnother amazingly well researched and written book. This time a medical mystery. Amazing is the only word for it!  ~ Dixie BeeI would recommend this to absolutely everybody who loves a medical suspense ... ~ Emmie ZeelieAn amazing read! Gabriel takes you on another enthralling journey ~ Ian Sanford A definite Dark, Disturbing Medical Thriller - Prepare for Intense Intrigue!  - Charla White",
  "genres": [
    "Mystery",
    "Thriller"
  ],
  "author": "Gabriel Farago",
  "average_rating": "4.42",
  "url": "https://www.goodreads.com/book/show/31193811-the-hidden-genes-of-professor-k"
}