{
  "title": "Culture Is The Bass: 7 Principles For Developing A Culture That Works!",
  "description": "Can you imagine going to a music performance tonight, (any type will do) and the musicians are not playing together?Each of them buried in their own musical performance with sound canceling headphones on. They are not in sync with either tempo or volume. Each of them playing every note perfectly. Does this sound like something you would want to spend your evening listening too?Every day companies fail to compete in the market and grow because of a poor Project Portfolio Management culture.Culture Is The 7 Principles For Developing A Culture That Works, walks you through how organizations can achieve balance, harmony or a unified vision. Where everyone understands the big picture and are not buried in their own processes.Culture is the Bass helps organizations create a true competitive advantage that delivers a standard of excellence in strategy implementation and execution that consistently produces and exceeds stakeholder expectations.Creating a culture that works is a multi-step process, and Culture Is The Bass covers the seven principles in an insightful and unique way combining the author’s experience and expertise as a professional musician and certified Portfolio Management Professional (PfMP).Inside, you’ll •How companies can perform like a World Class Orchestra and receive a standing ovation from its employees and customers.•How to create a shared vision for your team.•An 8 step process for implementing change and creating buy-In.•A 9 step process for developing stories that will touch your staff’s heart, head, and hands.“Love the analogy/metaphor of music being compared to business. There are lots of similarities, as you show us. As a musician myself, I've often thought about how the two are similar - and how interesting it would be to create a speech, or in your case a book, around the topic.” Shep Hyken - Customer Service Expert, Keynote Speaker & New York Times and Wall Street Journal Best-Selling Author of Amaze Every Customer Every Time and The Amazement Revolution“I've had the privilege of hearing Gerald Leonard speak half a dozen times, and his ideas are insightful, actionable, and energizing. I think the analogy with music works very well in this new book, and it adds a new perspective to looking at PPM.” Mitzi Perdue – Author of TOUGH MAN, TENDER CHICKEN, Business and Life Lessons from Frank Perdue“Gerald, I enjoyed reading the metaphor of how a great culture is like an orchestra. You can't make beautiful music and enjoy harmony without a commitment from all to play their part. You must have the right leadership, and the right players, playing to their strengths.” Shirley Davis, Ph.D., CSP, SPHR, SHRM-SCP President of SDS Global Enterprises, Inc.; Business Executive; Workforce Management Expert, Author of Reinvent Strategies for Achieving Success in Every Area of Your Life",
  "genres": [],
  "author": "Gerald Leonard",
  "average_rating": "3.67",
  "url": "https://www.goodreads.com/book/show/31195920-culture-is-the-bass"
}