{
  "title": "The Pen and the Sword",
  "description": "Destiny’s Crucible:  Joe Colsco boarded a flight from San Francisco to Chicago to attend a national chemistry meeting. Through a freak accident, he never sets foot on Earth again. He is unaware he has been poured into a crucible, where time and trials will transform him in ways unimagined, and that will send him and his descendants to a destiny beyond one planet.  Book I: Cast Under an Alien Sun  On planet Anyar, Joe was found unconscious on a beach of a large island (Caedellium) inhabited by humans where the level of technology is similar to Earth circa 1700. He awoke amidst strangers speaking an unintelligible language, and despaired losing his previous life. He used knowledge of chemistry to introduce new knowledge—but not too advanced of the planet’s technology to avoid being labelled a demon. He found a place in the society and developed new friendships, male and female.  But all was not idyllic. Joe was dropped into a clash between the people who cared for him, and a military power from elsewhere on the planet, a power with designs on conquest. Joe survived his first experience in deadly conflict but knows it was only a foretaste of what was coming.  Book II: Pen and the Sword  The Narthani, a militant realm who believe their manifest destiny is to rule the entire planet, Anyar, plan to absorb Caedellium into their empire and crush any resistance. Yozef Kolsko (aka Joe Colsco) works to find ways to increase the chances of his, and the society which has accepted him, ability to resist the Narthani’s planned conquest.  Complicating his life is attraction to a brilliant daughter of an island leader, and his uncertainty of his own mind, hers, or intricacies of Caedellium customs.  Despite his desire to devote himself to introducing new knowledge Yozef is drawn more and more into developing weapons and giving tactical and strategic advice—things he knows he’s unqualified to give. The enemy is coming. The odds seem overwhelming, and it will take all Yozef can do, the courage of his new people, and luck, to survive.",
  "genres": [
    "Fantasy",
    "Science Fiction",
    "Fiction",
    "Audiobook",
    "Military Fiction",
    "Alternate History",
    "Action"
  ],
  "author": "Olan Thorensen",
  "average_rating": "4.29",
  "url": "https://www.goodreads.com/book/show/31197530-the-pen-and-the-sword"
}