{
  "title": "سعادة السفير",
  "description": "رواية سياسيةالنيل والفرات:\"شكراً سعادة السفير... أودّ أن أبدأ بسؤال عن أصحاب المفاتيح الحقيقية للقوة. كيف يستطيع الدبلوماسي معرفتهم؟ يفكر يوسف قليلاً، ثم يجيب: للأسف، لا توجد طريقة سهلة. وللأسف، لن تجد كتاباً يشرح لك الطريقة، بعض هؤلاء المهمين يعرفهم الجميع. لا شك في ذهن أحد أن أقوى رجل في بريطانيا اليوم هو رئيس الوزراء ثم وزير الخزانة، وهلمّ جرا. أحياناً تنشر الصحف والمجلات قوائم بأسماء الأشخاص المهمين، أهم مئة شخص أو أهم مئتي شخص. هذه القوائم تعكس رأي المطبوعة ولا تعكس، بالضرورة، الواقع. المشكلة الحقيقية هي معرفة الأشخاص الذين لا يتردد اسمهم في وسائل الإعلام، وليست لديهم مناصب سياسي. هنا لا بد أن يستعمل السفير كل وسيلة متاحة لمعرفة هؤلاء الأشخاص. بمجرد قدومي إلى بريطانيا طلبت من ثلاث شركات متخصصة في العلاقات العامة السياسية، في \"اللوبي\" بعبارة أخرى، أن تعدّ لي قائمة بأهم ألف شخص في بريطانيا. بعض هذه الأسماء تكرّر في القوائم الثلاث، وبعضها لم يتكرر. أحياناً، يوجد نفوذ هائل في مكان لا يتوقعه أحد. سكرتيرة رئيس الوزراء، هارولد ولسون، كانت، في سنوات حكمه الأخيرة، أهم من عدد من الوزراء. أيام الملك فاروق كان الخادم الخاص الذي يعنى بملابسه يعيّن الوزراء ويعفيهم. أيام الرئيس جمال عبد الناصر كان صحفي، تعرفونه جميعاً، أهم من غالبية الوزراء. هناك من يقول أنه كان الرجل الثاني في النظام ولكن هذه مبالغة بعيدة عن الواقع. عندما كنت سفيراً في النهروان اكتشفت حلاقاً لديه نفوذ أكبر من نفوذ بعض الوزراء. لعلكم عرفتهم زبون هذا الحلاّق... سعادة السفير! وماذا يحدث عندما ينجح السفير في معرفة أصحاب المفاتيح كما سميتهم؟..\".عندما نطأ بأعيننا بلاط سعادة السفير، بدون وسائط أو استجداءات، ومن خلال إذن دخول عام ممنوع من قبل سعادة السفير، ندور في عالمه الدبلوماسي، نطلع على ما وراء المشاهد، ونسمع ما خلف الحوارات. إنه عالم بقدر ما تحلم بالاقتراب منه لتكون كائناً فيه، بقدر ما تبتعد عنه هارباً عنه ومن كائناته التي تمثل الوجه اللاإنساني في الإنسان.يطلعك غازي القصيبي على أسرار عالم السفراء، بحكم امتلاكه لها، ويأخذك معه، مع استقراءاته إلى عالم السياسة. ينسج لك حكاية سعادة السفير وينسج لك شخصيات الحكاية بحنكة الروائي وبدرية السفير، ويقدم رمزاً يتيح له قول المحظور وإفشاء الأسرار. لن يقف فكرك مشدوهاً أمام الواقع المؤلم الذي يصوره القصيبي بأسلوبه الرائع الذي يمزج بين السخرية والألم، بين الضحك والبكاء، وبين الحلم والحقيقة وبين الخيال والواقع، ترحل مع القصيبي بفكرك بمشاعرك وبإنسانيتك باحثاً في ثنايا سطوره، عن تلك المعاني الأكثر عمقاً من الحدث والتي تفلسفه إلى حدّ الإبداع.",
  "genres": [
    "Novels",
    "Fiction",
    "Politics"
  ],
  "author": "Ghazi A. Algosaibi",
  "average_rating": "3.54",
  "url": "https://www.goodreads.com/book/show/3120034"
}