{
  "title": "Hearts of Darkness",
  "description": "Vampires, shifters, demons, witches and ghosts… Ten delicious tales of paranormal romance just in time for Halloween. Get your calorie-free tricks or treats before this boxed set disappears. Those who dare the darkness will find the true heart of supernatural love. Your Lycan Or Mine? ~ Michele Bardsley Ash the Destroyer, the only soul shifter in existence, walked away from the Convocation and never looked back. Jarod Dante, the world’s last therianthrope, works for the new Convocation. When the Vedere psychics predict the end of mankind if Ash doesn’t defeat the demon queen Lilith, Jarod must convince the fearsome beauty to forget the past and save the future. Chasing Magic ~ Gena Lutz Anika Webb finds herself battling a volatile spell, where all bets are off, and magic will fly. VIKTOR: Heart of Her King ~ Julia Mills One has a chance for revenge, the other a chance for redemption. Together they must make a choice. Together they hold the key. Together only they can save the heart of her king. Memory’s Kiss ~ Sharon Kay As part of the elite Watcher fighting force, Raul relishes taking down enemies and restoring peace to the realm. When summoned for a rescue op, he encounters a most unexpected woman among the captives. Imprisoned on a desolate mountaintop, Daphne has no hope of escape. Until surprise freedom comes in the form of a Watcher team…and the boy who’d left her home village years ago. Grown up and lethal, Raul is more handsome than Daphne remembered. Never-forgotten memories of their first kiss rekindle into searing passion. But is there room in her quiet life for a warrior who thrives on danger? Under Her Skin ~ Margo Bond Collins Lindi Parker works hard at being human, not an easy task for a snake shifter. She has no desire to search for other weresnakes—until she realizes she might be next on a killer's list. In order to save herself and the abused children she works with, must team up with Dr. Kade Nevala, a member of the shifter tribe responsible for eradicating weresnakes—and the most attractive man Lindi's ever met. Rise Of The Fallen ~ Donya Lynne Micah Black has lost his second mate and is on a fast track to destruction. When he seeks an end to his life by offering himself up to his enemies, the last thing he expects is exotic dancer and former Army medic Samantha Garrett thwarting his death wish and becoming his reason to live—and love—again. Now his enemies have Sam in their sights, and he’ll do anything to protect her, even if it means defying the king’s law. Fall Into Darkness ~ Valerie Twombly A warrior angel is stripped of his wings, until he learns compassion for humanity. He fails, until he meets a beautiful woman hiding from life, and carrying a secret within her that only he recognizes. Together, they will be a pair capable of reckoning even with Lucifer himself. Nights Angel ~ Lisa Kessler Colin Flynn, the immortal Night Walker, is not the protector he had once been. Juliana is a survivor, but her prophetic dreams warn her of coming death. As an ancient enemy emerges and threatens her safety, Colin will need to learn Juliana's secret to overcome his wounds, but falling for a mortal could be the greatest risk of all. A Vhampier’s Forbidden Wolf ~ P.T. Macias A spoiled, sexy and wild young wolf loves the chase. She loves to stir it up and watch the fireworks. She comes to a complete stop when she meets a vhampier that rocks her world. The mature Vhampier, the royal assassin, falls under her spell. He goes against the supernatural council, family, and royal decree. The unexpected threat to their lives bring them together, exposing their love. Eternal Service ~ Regina Morris Vampire Raymond Metcalf's life is spinning out of control. As if working with a team of vamps to protect the President isn’t enough, he must deal with his rebellious half-breed son, save the President from crazed vampires, and break in his team's new director.",
  "genres": [
    "Paranormal Romance",
    "Anthologies",
    "Paranormal",
    "Fantasy",
    "Demons",
    "Romance"
  ],
  "author": "Michele Bardsley",
  "average_rating": "4.24",
  "url": "https://www.goodreads.com/book/show/31198472-hearts-of-darkness"
}