{
  "title": "Blood Bound",
  "description": "Love can be heaven. Or it can hurt like hell.  For exiled angel Jessie, falling for Eden Reece has been her salvation. When she discovers that her angel tears, used to heal Eden, are actually poisoning him the burden of guilt is crushing.  Jessie is determined to make things right and, with Eden by her side, they are a formidable team. But with Blackthorn surrounded by an impenetrable barrier and the army of Sirius Throme closing in, their mission is a desperate one. When Jessie discovers they are up against her own kind too, it looks impossible.  Eden and Jessie don’t just need a cure, they need a way out – and have less than 48 hours to find both.  Eden will fight to the last to protect Jessie, but when they are captured and separated, demons from his past return to haunt him. Suddenly, Jessie is forced to question everything she knows about the man she loves.  Yet the most shattering twist is still to come. Because what you care about most can be your biggest weakness.  For Blackthorn to survive, either Jessie or Eden will have to make the greatest sacrifice of all…  The thrilling penultimate story in the Blackthorn series will leave you breathless.   What readers are saying about Lindsay J. Pryor…  ‘I don’t think I have read such a finely executed dark PNR world before…This series truly surprised me. I didn’t think I would love it that much or be intrigued by it. I couldn’t stop thinking about these books once I was done with them… The world-building is spectacular. The characters are enthralling and addicting… Plain fabulousness.’ Gaga Over Books  ‘I am completely enthralled with this paranormal series. You get so wrapped up in the story and characters that you lose track of time… This is one of my favorite series so far this year!’ Paranormal Book Club  ‘This is a paranormal universe like none you have encountered before… There are stories that are so powerful, so intense that I do not believe anyone should warn you about what is to come… I truly do feel that if you love the Paranormal genre and have not yet discovered Lindsay J. Pryor or these novels then you need to read them, experience them firsthand.’ Keeper Bookshelf  ‘I am officially addicted to this series. Why, you ask? Because Lindsay Pryor is my kind of fearless author. She isn’t afraid to “go there”, to create characters and situations that challenge me as a reader.’ The Demon Librarian  ‘Not only are Pryor’s characters and fathomlessly dark love stories fabulous, but her continual world building of Blackthorn blows me away.’ Gravetells.com  ‘If you’re looking for a new PNR series that has a dark world and complicated characters, then you’ll want to grab a copy of this. I can’t wait to read the next book.’ FictionVixen.com  ‘She writes paranormal romance mixed with urban fantasy the way I like it – clever world-building, intense characters and no easy options for them to take.’ Nocturnal Book Reviews  The Blackthorn series reading order: 1. BLOOD SHADOWS 2. BLOOD ROSES 3. BLOOD TORN 4. BLOOD DEEP 5.",
  "genres": [
    "Paranormal Romance",
    "Paranormal",
    "Vampires",
    "Dystopia",
    "Fantasy",
    "Romance",
    "Angels"
  ],
  "author": "Lindsay J. Pryor",
  "average_rating": "4.56",
  "url": "https://www.goodreads.com/book/show/31197156-blood-bound"
}