{
  "title": "Blind Side",
  "description": "Can you ever truly know someone? And what if you suspect the unthinkable?  London, five months before 7/7. Georgie, a young woman wary of relationships after previous heartbreak, gives in and agrees to sleep with close friend Julian. She’s shocked when Julian reveals he’s loved her for a long time.  But Georgie can’t resist her attraction to Nikolai, a Russian former soldier she meets in a pub. While Julian struggles to deal with her rejection, Georgie realises how deeply war-time incidents in Chechnya have affected Nikolai. She begins to suspect that the Russian is hiding something terrible from her.  Then London is attacked...  Blind Side explores love and friendship, guilt and betrayal, secrets and obsession. An explosive, debate-provoking thriller that confronts urgent issues of our times and contemplates some of our deepest fears.  ***  “Jennie Ensor’s writing is graceful, poetic, intelligent and captivating. She builds suspense brilliantly, and is a master at dialogue that communicates the accents and personalities of the characters. BLIND SIDE is a wonderful debut, an exciting story about three flawed and fascinating people living in dangerous times.” — Gail Cleare, author of DESTINED and THE TASTE OF AIR  “... a gripping tale. Whilst not the light-read that this genre usually pitches itself at,this complex tale was an immensely satisfying read.” — Cleopatra Loves Books  “For a debut novel this is a brave topic as [is] the time it is set in, but what Jennie Ensor brings is a thrilling psychological story that I really enjoyed and raced through. If you enjoy a thriller with a number of themes running through the story, then Blind Side is one not to be missed.” — The Last Word Book Review  “Blind Side is a superb debut novel from the pen of Jennie Ensor. From the opening prologue to the very last page, I was completely immersed in Georgie's story as we are transported back to London, 2005 - set before, during and after the 7/7 bombings. The book opens with a short prologue that made the hairs on the back of my neck stand up and I simply couldn't read fast enough to find out what had happened. Jennie Ensor cleverly keeps us in suspense as we have a whole lot of story to get through before my curiosity could be satisfied. ...There are so many subjects and issues to discuss in Blind Side, that I think it would be excellent for book groups. ...Blind Side is an absolutely stunning debut from Jennie Ensor; so thought-provoking and profound that every reader will get something different out of reading it. I'm so excited to read the psychological thriller than Jennie is working on next. If it's half as good as Blind Side it will be a cracker!” — The Book Magnet  “This isn’t a straight-up book by any means as the author builds on many themes such as terrorism, immigration, family and sexual relationships, trauma, secrets, guilt and regret. The pace and the writing in this book was easy to become caught up in and I read this book over the course of the day without putting it down once. It’s a powerful and engaging novel, thought-provoking and difficult to forget once you’ve reached the end.” ... “Blind Side both surprised and captivated me. It was tense and suspenseful at times, with some thrilling themes, so I can understand the psychological thriller branding but I think it’s probably going to be a fair bit different to what you’re expecting. I suppose it feels more real and believable, not to mention more human, and I could buy into this story much more than many other psychological thrillers.",
  "genres": [
    "Thriller",
    "Fiction",
    "Psychological Thriller"
  ],
  "author": "Jennie Ensor",
  "average_rating": "3.99",
  "url": "https://www.goodreads.com/book/show/31200537-blind-side"
}