{
  "title": "The Seed, Birth of the Fallen",
  "description": "You knew it. Something is wrong. It's very, very wrong. You can feel it in the depths of your soul. Joey and Mara felt it too; they knew something was simply not right. But what? They begin to learn when they had to face the shadows that chased them through the dark woods. . .It happens during the worst thunderstorm of the year. Their enemy is both seen and unseen. The wrong move could be their last. Welcome to Joey and Mara's biblically apocalyptic world. They run for their lives in this action packed, Christian suspense, mystery thriller, adventure novel, guaranteed to elevate your pulse until you find the answers they seek. Every tormented, blistered step, every action brings a decision point that affects the natural and supernatural realms. Who can they trust? Can they even trust each other? Do all their relationships, that culminated on this night, represent friends or fiends? Time is against them as they are plunged into one twist and turn after the next. Their plight is bad enough, but then they discover what's really at stake. They learn that the fate of the world hangs in the balance in this all out spiritual warfare novel. Their journey foreshadows the ruthless rise of pure evil against the backdrop of hope and redemption. Can they remember their tortured past as the key to understand the future? Can they ferret fiction fromfantasy? Will Joey and Mara find Christ. . . or the antichrist? Find out with them.This novel is an ideal blend of several genres thriller, suspense, action, mystery, and yes. . . even a little romance.It is book one in the projected series, painting a picture of apocalyptic doom within the broader frame of ultimate redemption. The work is a fictional look at the backdrop to today's headlines which will provoke thought and discussion.Fair this book is not for the squeamish! But then, neither are the books of Daniel and Revelation in the Christian Bible! This end times Christian novel is gripping in content. It is a wild ride that is sure to grab your attention from the very beginning and convert you, the reader, into the proverbial page turner!Conspiracy theory? No! See if you think it is based on conspiracy fact.And beyond all that, it's just plain entertaining!Table of ContentsProloguePart I – RunningPart II - SearchingPart III – FindingPart IV – Culminating Christian Suspense Thriller, Christian Mystery, Christian Action, Christian Adventure, Christian Fantasy, Christian Novel, Spiritual Warfare fiction, Nephilim, demons, demonic, Satanic, apocalypse, apocalyptic, end times",
  "genres": [],
  "author": "T.O. Faith",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/31196669-the-seed-birth-of-the-fallen"
}