{
  "title": "Gallows Pole",
  "description": "Everything comes with a price.  In 1716, a capital crime costs a man nothing short of his head. If the condemned can't come to the hangman, there's no need to worry: Old Jack Ketch will come to him.  Emmat Bird does what she must to keep her parents under a solid roof and her fool brother out of trouble, even if those things are dangerous and most days illegal. Today, that involves forging a stay of execution from Judge Couch and racing it to the gallows before her brother's neck stretches. A fine mess, indeed, but the only solution she can think of to keep her parents from disowning her once and for all. She just has to get the executioner to buy it.  Bartholomew Vane travels his country circuit, meting out punishments demanded by the law. Shunned to live on the fringes for the taint of death surrounding his post, he cares very little for the wants of others. Why should he? The world shows him no mercy, and he sees fit to return the favor. When the third rider in the same grey morning appears at the foot of Gallows Hill attempting to stay the noose of the witless convict he's about to hang, the executioner finds himself losing patience.  But then the pieces fall together. The flaming red hair, the name. He knows who the final rider is. Reason leaves him, and in its place, a terrible plan takes shape. The hangman makes a bargain.  Against her better judgment, Emmat accepts.  Follow award-winning author Eris Adderly off the beaten path where outcasts do what they must, and urges long-contained rise up to take what they want. Let her decadent, filthy prose sweep you into the past, into the unyielding arms of the hangman.  This dark erotic romance novella twists across the page with graphic descriptions of sexual acts, and is intended for mature readers only.",
  "genres": [
    "Historical Romance",
    "Historical",
    "Romance",
    "Dark",
    "Novella",
    "Dark Romance",
    "Enemies To Lovers"
  ],
  "author": "Eris Adderly",
  "average_rating": "3.68",
  "url": "https://www.goodreads.com/book/show/31206680-gallows-pole"
}