{
  "title": "Wahhabi Islam: From Revival and Reform to Global Jihad",
  "description": "Before 9/11, few Westerners had heard of Wahhabism. Today, it is a household word. Frequently mentioned in association with Osama bin Laden, Wahhabism is portrayed by the media and public officials as an intolerant, puritanical, militant interpretation of Islam that calls for the wholesale destruction of the West in a jihad of global proportions. In the first study ever undertaken of the writings of Wahhabism's founder, Muhammad Ibn Abd al-Wahhab (1702-1791), Natana DeLong-Bas shatters these stereotypes and misconceptions. Her reading of Ibn Abd al-Wahhab's works produces a revisionist thesis: Ibn Abd al-Wahhab was not the godfather of contemporary terrorist movements. Rather, he was a voice of reform, reflecting mainstream 18th-century Islamic thought. His vision of Islamic society was based upon a monotheism in which Muslims, Christians and Jews were to enjoy peaceful co-existence and cooperative commercial and treaty relations. Eschewing medieval interpretations of the Quranand hadith (sayings and deeds of the prophet Muhammad), Ibn Abd al-Wahhab called for direct, historically contextualized interpretation of scripture by both women and men. His understanding of theology and Islamic law was rooted in Quranic values, rather than literal interpretations. A strong proponent of women's rights, he called for a balance of rights between women and men both within marriage and in access to education and public space. In the most comprehensive study of Ibn Abd al-Wahhab's interpretation of jihad ever written, DeLong-Bas details a vision in which jihad is strictly limited to the self-defense of the Muslim community against military aggression. Contemporary extremists like Osama bin Laden do not have their origins in Wahhabism, she shows. The hallmark jihadi focus on a cult of martyrdom, the strict division of the world into two necessarily opposing spheres, the wholescale destruction of both civilian life and property, and the call for global jihad are entirelyabsent from Ibn Abd al-Wahhab's writings. Instead, the militant stance of contemporary jihadism lies in adherence to the writings of the medieval scholar, Ibn Taymiyya, and the 20th century Egyptian radical, Sayyid Qutb. This pathbreaking book fills an enormous gap in the literature about Wahhabism by returning to the original writings of its founder. Bound to be controversial, it will be impossible to ignore.",
  "genres": [
    "Islam",
    "Religion",
    "Politics",
    "History"
  ],
  "author": "Natana J. Delong-Bas",
  "average_rating": "3.25",
  "url": "https://www.goodreads.com/book/show/1193346.Wahhabi_Islam"
}