{
  "title": "Theatre of the Imagination Volume Two",
  "description": "Come to the stage between two worlds―come to the Theatre of the Imagination . On this six-part live performance series, bestselling author and beloved cantadora (keeper of the old stories) Clarissa Pinkola Estés shares the work of her myths, tales, and poetry with the power to nourish and heal.Contained within Theatre of the Imagination are the great universal themes―tales of loss and resurrection; of love and sacrifice; of the courage to survive―yet it is as if Dr. Estés is speaking only to you. With words that weave in and out of the interior and exterior worlds, she creates an amazing fabric of the purest wisdom―fought for, won, and preserved to teach all generations―that which is most worth knowing.You will hear more than 40 original poems, archetypal insights, and dozens of strengthening stories from Dr. Estés' own family's oral traditions. Dr. Estés teaches that each story holds a key to a deeper \"Stories cut fine wide doors in previous blank walls, openings that lead to the dreamland, that lead to love and learning that lead us back to our own real lives.\"Presented in her one-of-a-kind lyrical style, Theatre of the Imagination seats you in the front row at these performances of a lifetime. More than five hours of signature stories, plus earthy and wise advice, archetypal insights, poetry, and much more.Six Healing Stories Las Tres Osas Viejas (The Three Old Ones)• The Fisherman's Wife• Skeleton Woman• The Crescent Moon Bear• Sealskin/Soulskin• WolfenLearn More The cycles of life and death• How the language of symbols translates into everyday life• Community and healing the homesickness within the soul• How to stop your destructive inner critic• Reclaiming the bodies we were born with• Facing the cycles of change in a relationship• Agelessness and the aerial view of the elder• How to awaken the 1,000 eyes of your intuition• Transformation through the four vital steps to forgiveness• The power of the Divine Child• Finding courage and the sacred center of the psyche• When others try to silence how to claim your strength",
  "genres": [
    "Psychology",
    "Nonfiction",
    "Self Help",
    "Audiobook"
  ],
  "author": "Clarissa Pinkola Estés",
  "average_rating": "4.69",
  "url": "https://www.goodreads.com/book/show/31211.Theatre_of_the_Imagination_Volume_Two"
}