{
  "title": "Scared Selfless: My Journey from Abuse and Madness to Surviving and Thriving",
  "description": "Michelle Stevens has a photo of the exact moment her childhood was stolen from her. In it, she's only eight years old and posing for her mother's beguiling boyfriend, Gary Lundquist an elementary school teacher, neighborhood stalwart, and brutal pedophile. Later that night, Gary locks Michelle in a cage, tortures her repeatedly, and uses her to quench his voracious and deviant sexual whims.Michelle can also pinpoint the moment she reconstituted the splintered pieces of her life. Just a few years after being confined to a mental hospital and at the mercy of an alternate personality who kept trolling for sadistic men, she's in cap and gown receiving her Ph.D. in psychology and the university's award for best dissertation. The distance between these two points is the improbable journey from torture, loss, and mental illness to recovery that is Michelle Stevens' powerful memoir, Scared Selfless.Gary Lundquist kept Michelle as his sex slave for six years. During that time, he waged a campaign of unimaginable cruelty. He pimped her out to countless men for prostitution and forced her to perform in kiddie porn when it was legal and shown in Times Square.It took fifteen years, three hospitalizations, and multiple suicide attempts for Michelle to work through Gary's dark legacy. She suffered from post-traumatic stress disorder (PTSD), anxiety, depression, and developed multiple personalities. There was Chelsey, the rebellious teenager who told her boss to shove it; Vicious, a tween with homicidal rage; and Sarah, a sweet little girl who brought her teddy bear on a first date.In this harrowing yet unflinching look at her own experience, Michelle, who was inspired to help others heal by becoming a psychotherapist, sheds light on the all-too-real threat of child sexual abuse and the psychological effects on its victims and best methods for healing, based on her own struggle with PTSD and dissociative identity disorder (more commonly known as multiple personality disorder). Scared Selfless is an examination at the extraordinary and inexplicable feats of the mind in the face of unspeakably horrifying trauma and the story of Michelle's courageous road to healing, recovery, and triumph.",
  "genres": [
    "Memoir",
    "Nonfiction",
    "Psychology",
    "Mental Health",
    "Biography",
    "Abuse",
    "Self Help"
  ],
  "author": "Michelle   Stevens",
  "average_rating": "4.30",
  "url": "https://www.goodreads.com/book/show/31226381-scared-selfless"
}