{
  "title": "Unwarranted: Policing Without Permission",
  "description": "“At a time when policing in America is at a crossroads, Barry Friedman provides much-needed insight, analysis, and direction in his thoughtful new book. Unwarranted illuminates many of the often ignored issues surrounding how we police in America and highlights why reform is so urgently needed. This revealing book comes at a critically important time and has much to offer all who care about fair treatment and public safety.” —Bryan Stevenson, founder and Executive Director of the Equal Justice Initiative and author of Just A Story of Justice and RedemptionIn June 2013, documents leaked by Edward Snowden sparked widespread debate about secret government surveillance of Americans. Just over a year later, the shooting of Michael Brown, a black teenager in Ferguson, Missouri, set off protests and triggered concern about militarization of law enforcement and discriminatory policing. In Unwarranted, Barry Friedman argues that these two seemingly disparate events are connected—and that the problem is not so much the policing agencies as it is the rest of us. We allow these agencies to operate in secret and to decide how to police us, rather than calling the shots ourselves. And the courts, which we depended upon to supervise policing, have let us down entirely.Unwarranted tells the stories of ordinary people whose lives were torn apart by policing—by the methods of cops on the beat and those of the FBI and NSA. Driven by technology, policing has changed dramatically. Once, cops sought out bad guys; today, increasingly militarized forces conduct wide surveillance of all of us. Friedman captures the eerie new environment in which CCTV, location tracking, and predictive policing have made suspects of us all, while proliferating SWAT teams and increased use of force have put everyone’s property and lives at risk. Policing falls particularly heavily on minority communities and the poor, but as Unwarranted makes clear, the effects of policing are much broader still. Policing is everyone’s problem.Police play an indispensable role in our society. But our failure to supervise them has left us all in peril. Unwarranted is a critical, timely intervention into debates about policing, a call to take responsibility for governing those who govern us.",
  "genres": [
    "Nonfiction",
    "Politics",
    "Race",
    "Law",
    "Social Justice",
    "Police",
    "Sociology"
  ],
  "author": "Barry Friedman",
  "average_rating": "4.14",
  "url": "https://www.goodreads.com/book/show/31216093-unwarranted"
}