{
  "title": "Gemstone of Paradise: The Holy Grail in Wolfram's Parzival",
  "description": "The story of the Grail, usually identified as some kind of mystical vessel, has gripped the imaginations of millions since it first appeared in several medieval romances. Of these, Wolfram von Eschenbach's Middle High German Parzival (c. 1210) is generally recognized as the most complex and beautiful. Strangely, in Parzival, the Grail is identified as a stone rather than a cup or dish. This oddity is usually seen as just another mystery, further evidence of the difficulty of discerning the true sources of the Grail legend. In this groundbreaking study, G. Ronald Murphy seeks to illuminate this mystery and to enable a far better appreciation of Wolfram's insight into the nature of the Grail and its relationship to the Crusades. The Grail, container of the sacred body and blood of Christ, Wolfram was saying, was where God said it would be: on the altar at the consecration of the Mass. Wolfram's \"sacred stone\" was none other than a consecrated altar, precious by virtue of the sacrament but also, Murphy argues, by virtue of the material from which it was made: a green gem, one of the precious stones associated with the rivers of Paradise. Murphy explores what it signifies for the Grail to be a translucent gemstone and an altar made portable only by a woman. Wolfram's stone is a sacramental reference to the stone the Crusaders fought to obtain - the Holy Sepulchre. Parzival, Murphy believes, was intended as an argument against continued efforts by Latin Christians to recover the Holy Sepulcher in Jerusalem by force of arms. In Wolfram's story, warring Christian and Muslim brothers are brought together in peace by the power of Wolfram's Holy Grail--a stone Murphy believes still exists. Murphy's investigation of the spiritual nature and meaning of the Grail is thus accompanied by his quest for and wondrous discovery of the actual altar stone that inspired Wolfram's work. Offering an entirely original reading of Wolfram's famous text, this engrossing and accessible book appeals not only to scholars and students of medieval literature but to anyone who is drawn to the lasting mystery of the Holy Grail.",
  "genres": [
    "Arthurian",
    "Literary Criticism",
    "Nonfiction"
  ],
  "author": "S. J. G. Ronald Murphy",
  "average_rating": "4.17",
  "url": "https://www.goodreads.com/book/show/119346.Gemstone_of_Paradise"
}