{
  "title": "Burned to a Crisp",
  "description": "From USA Today bestselling author Catherine Bruns comes the next sinfully delicious Cookies & Chance Mystery...  Just when things appear to be going well for baker and sometime sleuth Sally Muccio, life turns up the heat again.  It’s summertime, and the living is easy for the Muccio clan. Sal’s wedding to her beloved fiancé is rapidly approaching, Mom’s won a beauty contest, and sister Gianna is now a licensed public defender. But when the bakery Sal’s worked so hard for goes up in smoke—along with her dreams!—she’s not sure how much more she can stand. Even worse, the man found dead in the bakery’s back room is none other than Gianna’s latest client, Bernardo Napoli.  The dough really hits the fan for Sal and Josie when they’re forced to temporarily relocate their bakery to the crazy Muccio home. Trouble is quickly stirred up as the best friend team must now contend with Sal’s father and his new mortuary business “undertakings,” a middle aged mother parading around customers in bikinis, and an Italian family hell bent on revenge. For Sal, several questions demand answers. Where has Gianna disappeared to? What role did she play in Bernardo’s death? What secret is Sal’s fiancé hiding from her? Sal is determined to find answers...before she gets burned once again!  **Recipes Included!**  The Cookies & Chance Mysteries: Tastes Like Murder (book #1) Baked to Death (book #2) A Spot of Murder (short story in the \"Killer Beach Reads\" collection) Burned to a Crisp (book #3)  What critics are saying:  \"Catherine Bruns has whipped up another delicious treat with this delightful cozy. . If you like your mysteries to taste sweet this one is a good choice.\" —Night Owl Reviews, Top Pick!  \"I want to visit more with all of the quirky characters just to see what crazy and outrageous things they will do next!\" —Fresh Fiction  \"The delightful whodunit kept me guessing until the end, and the tasty treats had my mouthwatering from start to finish! A fantastic culinary mystery in the vein of Joanne Fluke and Diane Mott Davidson!\" —Gemma Halliday, New York Times & USA Today bestselling mystery author  \"Catherine Bruns has found a winning recipe for an exciting mystery mixed with a dash of humor and a heap of danger. Add in a little romance for spice, and you get one sweet reading treat.\" —Mary Marks, bestselling author of the Quilting Mystery series.",
  "genres": [
    "Cozy Mystery",
    "Mystery",
    "Cozy",
    "Romance"
  ],
  "author": "Catherine Bruns",
  "average_rating": "4.12",
  "url": "https://www.goodreads.com/book/show/31222690-burned-to-a-crisp"
}