{
  "title": "A Heartwarming Holiday",
  "description": "This holiday season, warm your heart with 15 connected sweet, clean & wholesome holiday romances set in Christmas Town from 15 Harlequin Heartwarming authors who are USA Today, national bestselling, and award-winning authors. There are five connected books in A Heartwarming Holiday. That means each set of three novellas shares characters and storylines! This collection of PG-rated holiday romances are all set in Christmas Town, Maine, a location introduced in the 2014 Harlequin Heartwarming release Christmas, Actually. A Heartwarming Holiday will bring you laughter, tears, and happily-ever-afters (no cliffhangers), for more than 1200 pages. Book 1: Once Upon a Holiday by Anna Adams, Anna J Stewart & Melinda Curtis: Three former college roommates start a business to bring the magic of the holidays to everyone in Christmas Town. Novella 1: Once Upon a Thanksgiving by Anna Adams, award-winning, USA Today bestselling, Harlequin Heartwarming author Novella 2: Once Upon a Christmas by Anna J Stewart, award-winning, USA Today bestselling, Harlequin Heartwarming author Novella 3: Once Upon a New Year’s Eve by Melinda Curtis, award-winning, USA Today bestselling, Harlequin Heartwarming author Book 2: Holiday Heroes by Leigh Riker, Tara Randel & Cari Lynn Webb: Three former Navy SEALs come together to restore an outdated resort. Novella 1: Thankfully Yours by Leigh Riker, award-winning, USA Today bestselling, Harlequin Heartwarming author Novella 2: Cooking Up Christmas by Tara Randel, Barnes and Noble bestselling, USA Today bestselling, Harlequin Heartwarming author Novella 3: Countdown to Romance by Cari Lynn Webb, USA Today bestselling, Harlequin Heartwarming author Book 3: 24 North Pole Lane by Carol Ross, Amy Vastine & Cheryl Harper: Romance is being delivered to 24 North Pole Lane this holiday season. Novella 1: Hers by Thanksgiving by Carol Ross, USA Today bestselling, Harlequin Heartwarming author Novella 2: Peace, Love, and Baby Joy by Amy Vastine, USA Today bestselling, Harlequin Heartwarming author Novella 3: Never Say Never on New Year’s by Cheryl Harper, USA Today bestselling, Harlequin Heartwarming author Book 4: Magic Moments by Tara Taylor Quinn, Shirley Hailstock & Liz Flaherty: Three different times, three different stories. They all bring magic to Christmas Town. Novella 1: Christmas Past by Tara Taylor Quinn, USA Today bestselling, Harlequin Heartwarming author Novella 2: It Only Happens in Christmas Town by Shirley Hailstock, Harlequin Heartwarming author Novella 3: The Magic Stocking by Liz Flaherty, USA Today bestselling, Harlequin Heartwarming author Book 5: Nutcracker Sweethearts by Dana Mentink, Roz Denny Fox, & Amie Denman: As the stage production of the Nutcracker unfolds in Christmas Town, three couples find love with the help of a little holiday magic! Novella 1: Thanksgiving Duet by Dana Mentink, Harlequin Heartwarming author Novella 2: Christmas Curtain Call by Roz Denny Fox, Harlequin Heartwarming author Novella 3: Set for New Year’s by Amie Denman, Harlequin Heartwarming author If this boxed set appeals to you, look for our previous holiday anthology: A Heartwarming Christmas.",
  "genres": [
    "Christmas",
    "Romance",
    "Holiday",
    "Anthologies",
    "Novella",
    "Contemporary Romance",
    "Contemporary"
  ],
  "author": "Anna Adams",
  "average_rating": "4.48",
  "url": "https://www.goodreads.com/book/show/31223319-a-heartwarming-holiday"
}