{
  "title": "A Druid's Herbal for the Sacred Earth Year",
  "description": "EARTH RELIGIONS / HERBAL MEDICINES For the ancient Druids, the healing and magical properties of herbs were inseparable from the larger cycles of the seasons, the movements of the planets, and the progression of a human life. A Druid’s Herbal shows the reader how to use herbs when creating rituals to celebrate festivals and significant life passages such as births, house blessings, weddings, funerals, and naming ceremonies. Drawing on extensive research and a deep personal experience with Pagan traditions, Ellen Evert Hopman explores the history and folklore surrounding the eight major Celtic festivals: Samhain, Winter Solstice, Imbolc, Spring Equinox, Beltaine, Summer Solstice, Lugnasad, and Fall Equinox. Included in each discussion are complete instructions on the medicinal and magical uses of the herbs associated with each celebration. Using these Celtic traditions as examples, the author suggests ways to incorporate the symbolic and magical power of herbs into personal rituals that honor all phases of life from childbirth to last rites. Also included are chapters on how to prepare herbal tinctures, salves, and poultices; herbs used by the Druids; herbal alchemy and the planets; and the relationships between herbs and sacred places. Filled with practical information and imaginative suggestions for using herbs for healing, ceremony, and magic, this book is an indispensable and comprehensive guide to age-old herbal practices. A master herbalist, psychotherapist, and lay homeopath, Ellen Hopman is the author of Tree Medicine, Tree Magic and the video Gifts of the Healing Earth, and co-author of People of the Earth: The New Pagans.",
  "genres": [
    "Nonfiction",
    "Herbs",
    "Spirituality",
    "Paganism",
    "Reference",
    "Mythology",
    "Nature"
  ],
  "author": "Ellen Evert Hopman",
  "average_rating": "4.09",
  "url": "https://www.goodreads.com/book/show/312296.A_Druid_s_Herbal_for_the_Sacred_Earth_Year"
}