{
  "title": "Echo Chamber: Rush Limbaugh and the Conservative Media Establishment",
  "description": "Rupert Murdoch's recent multibillion-dollar purchase of the Wall Street Journal made international news. Yet it is but one more chapter in an untold the rise of an integrated conservative media machine that all began with Rush Limbaugh in the 1980s.Now Kathleen Hall Jamieson and Joseph Cappella--two of the nation's foremost experts on politics and communications--offer a searching analysis of the conservative media establishment, from talk radio to Fox News to the editorial page of the Wall Street Journal . Indeed, here is the firstserious account of how the conservative media arose, what it consists of, and how it operates. To show how this influential segment of the media works, the authors examine the uproar that followed when Senator Trent Lott seemed to endorse Strom Thurmond's segregationist past. Limbaugh called theremarks \"utterly indefensible,\" but added that a \"double standard\" was in play. That signaled a broad counterattack by the conservative media establishment, charging the mainstream media with hypocrisy (yet using its reports when convenient), creating a knowledge base (a set of facts or allegationsfor partisans to draw upon), and fostering an in-group identity. By analyzing such cases, together with survey data, Jamieson and Cappella find that Limbaugh, Fox News, and the Wall Street Journal opinion pages create a self-protective enclave for conservatives, shielding them from other informationsources, and promoting strongly negative associations with political opponents. Limbaugh in particular, they write, fuses the roles of party leader and opinion leader in a fashion reminiscent of the nineteenth century's partisan newspaper editors.The rise of conservative media has fundamentally changed American politics. This thoughtful study offers the most authoritative and insightful account of this revolutionary phenomenon available today.",
  "genres": [
    "Politics",
    "Nonfiction",
    "Research"
  ],
  "author": "Kathleen Hall Jamieson",
  "average_rating": "3.42",
  "url": "https://www.goodreads.com/book/show/3124379-echo-chamber"
}