{
  "title": "Exploding: The Highs, Hits, Hype, Heroes, and Hustlers of the Warner Music Group",
  "description": "That's how Vanity Fair described the record business turmoil of the 1990s, which moved the Warner Music Group -- the world's number one record company -- from the entertainment pages to the front pages. Suddenly, decades of riotous fun and booming business went splat. Top music executives got evicted from their offices, some escorted by company guards. Why? The answers are in Exploding -- the most insightful and delightful book about the record business ever written. In the rock explosion of the Sixties and Seventies, Warner Bros., Atlantic, and Elektra Records dominated the business as the Warner Music Group. But by the Nineties, the success of WMG was shaken by egos and corporate politics that left the company struggling for identity in a dramatically changing industry. This is the story of that long, strange trip. Your host is the ultimate Stan Cornyn, a key creative force behind the Warner Music Group's stunning rise. During more than thirty years at the company, Cornyn went through what the news media could never uncover. In a freewheeling, vastly entertaining narrative, Cornyn takes us behind the scenes, seats us in the conference rooms, and shows us the interactions between the stars and the suits -- using the same irreverent wit that produced the marketing campaigns that helped put Warner on the map. Exploding is populated by music stars like Frank Sinatra, Ray Charles, the Doors, Jimi Hendrix, Lil' Kim, Dr. Dre, the Grateful Dead, Queen, Madonna, Ice-T, Joni Mitchell, Frank Zappa, Neil Young, Alice Cooper, and dozens more, even the legendary supergroup Scorpio. (Never heard of Scorpio? You'll find out why.) And it introduces you to the most colorful businesspeople hyperintense record sellers who shave their heads; throw doves off a roof; send pig heads through the mail; provide the money, meds, and mammaries -- anything -- to get their records on the air. Here is the music business as you've never seen at its wildest, in its wackiest fifty years, bursting with hits and cash, until, by the end, it's just plain Exploding.",
  "genres": [
    "Music",
    "Nonfiction",
    "Business",
    "Biography"
  ],
  "author": "Stan Cornyn",
  "average_rating": "3.82",
  "url": "https://www.goodreads.com/book/show/3124528-exploding"
}