{
  "title": "So Far from God",
  "description": "The beloved feminist classic of Chicano literature that \"could be the offspring of a union between One Hundred Years of Solitude and General Hospital : a sassy, magical, melodramatic love child who won’t sit down―and the reader can hope―will never shut up…As readable as a teen-aged sister’s secret diary―and as impossible to resist\" (Barbara Kingsolver, Los Angeles Times Book Review ).\"Wacky, wild, y bien funny.\" ―Sandra Cisneros, author of The House of Mango Street and Women Hollering Creek\"Castillo is una storyteller de primera… So Far from God is the novel that wasn’t there before but which I’d been missing.” ―Julia Alvarez, author of How the García Girls Lost Their Accents In Tome, a small, seemingly sleepy New Mexico hamlet, Sofia and her four fated daughters reveal a world of marvels where the comic and horrific, past and present, real and fantastic coexist and collide. Over two crowded decades, Sofia tries to hold things together following the disappearance of her husband, Domingo, he of the Clark Gable mustache and the uncontrollable gambling habit. Adventurous Esperanza, Chicana campus radical turned television news reporter, travels farthest from home only to be reeled back in spirit. Beautiful Caridad, a nurse who dulls the pain of being jilted with nightly bouts of alcohol and anonymous sex finally finds love again―and a sharp drop off a tall cliff. Practical Fe, dutiful bank worker who wishes more than anything for stability, upon being dumped by her fiancé, lets out a year-long primal scream. And mysterious La Loca, dies (maybe?) and is resurrected at age three, leaving her both attuned to higher spiritual frequencies and allergic to human touch. Exuberant and powerful, funny and profound, So Far from God is “a hymn to the endurance of women, both physical and spiritual” ( Washington Post Book World ).",
  "genres": [
    "Fiction",
    "Magical Realism",
    "Fantasy",
    "Feminism",
    "Contemporary",
    "Literature",
    "Novels"
  ],
  "author": "Ana Castillo",
  "average_rating": "3.89",
  "url": "https://www.goodreads.com/book/show/312435.So_Far_from_God"
}