{
  "title": "Making Out Like a Virgin: Sex, Desire & Intimacy After Sexual Trauma",
  "description": "Making Out Like a Sex, Desire & Intimacy After Sexual Trauma is a unique and moving collection of personal nonfiction essays that detail how each writer has moved beyond mere survival of sexual trauma to unapologetically discover a sexually and emotionally thriving life.Making Out Like a Virgin is not a collection of victim narratives, nor a healing workbook. Instead, this book is a bold new addition to generations of stories told by survivors. The mission of these writers is not to recount their individual trauma but to detail what has helped them reclaim both body and sexual desire. “Making out like a virgin” serves as a metaphor, giving permission to sizzle and seize the moment. By telling their stories, these writers share their strength and successes found somewhere between the big shifts and small intimate moments, inspiring others while furthering their own healing.The anthology features 17 contributor—women, men, and transgender—from 5 countries; ranging in age from their mid-20s to their late 60s; hailing from Dubai, Cairo, Dublin, Toronto, Melbourne, and from across the United States. These writers offer answers ·       What does it mean to not just survive, but to flourish?·       Is it possible to ever again feel powerful and confident in one's own body and within relationships?·       Can someone move beyond being limited or controlled by a tragic event?“Making Out Like a Virgin is the collective power of a community of people who have refused to let the circumstances of their younger selves dictate the course of the rest of their lives. The individuals in this community have found the strength to become sexually and emotionally whole—a healing that transcends gender and orientation.” (from the foreword by Sue William Silverman, author, Love One Woman’s Journey Through Sexual Addiction)Edited and introduced by Catriona McHardy and Cathy Plourde with a foreword by Sue William Silverman . Paperback, audio and eBook formats will release simultaneously. The audiobook edition is performed by award-winning narrator Tavia Gilbert.Making Out Like a Sex, Desire & Intimacy After Sexual Trauma is the inaugural publication of Portlyn Media, an imprint of Animal Mineral Press. Animal Mineral is the parent company for a set of publishing imprints that cover different aspects of sex, sexuality, and relationships, including non-fiction, faith-based romance, erotica, and other fiction for youth, new adults, and adults.",
  "genres": [
    "Nonfiction",
    "Self Help",
    "Psychology"
  ],
  "author": "Catriona McHardy",
  "average_rating": "4.14",
  "url": "https://www.goodreads.com/book/show/31244714-making-out-like-a-virgin"
}