{
  "title": "Monty Python's Tunisian Holiday: My Life with Brian",
  "description": "In 1978, Kim “Howard” Johnson ran away to join the circus---Monty Python’s Flying Circus, that is. The Pythons converged on Tunisia to film their timeless classic, Life of Brian, and Howard found himself in the thick of it, doubling for nearly all the Pythons, playing more roles in the film than John Cleese, and managing to ruin only one shot. He became the unit journalist, substitute still photographer, Roman soldier, peasant, Biggus Dickus’s double, near-stalker, and, ultimately, friend and confidant of the comedy legends. He also kept a detailed journal of what he saw and heard, on set and off, throughout those six weeks.     The result is a unique eyewitness account that reveals the Pythons at work and at play in a way that nothing else written about them could do. Now, for the first time ever, the inside story of the making of the film is revealed through the fly-on-the-castle-wall perspective. Even the most diehard fans will get a fresh take on the comedy greats through some never-before-revealed nuggets of Python brilliance: what John Cleese offered to exchange for suntan lotion; Terry Jones directing in drag; Michael Palin’s secret to playing revolutionaries and peasants; Graham Chapman gets naked; Terry Gilliam gets filthy; Eric Idle haggles; the secret of the Thespo-Squat; Mrs. Pilate; talk of George Harrison; the cake-flinging that jeopardized the production; badminton, impromptu cricket, and erotic frescoes; and the first-ever presentation of “Always Look on the Bright Side of Life.”      Here, uncensored, are the legendary Pythons in their prime. It was a period of comedy history that will never be duplicated, and Monty Python’s Tunisian Holiday captures the wit, the genius, and the sheer silliness of the six men that comprised Python.",
  "genres": [
    "Nonfiction",
    "Biography",
    "Film",
    "Audiobook",
    "Humor",
    "Memoir",
    "Comedy"
  ],
  "author": "Kim Howard Johnson",
  "average_rating": "3.30",
  "url": "https://www.goodreads.com/book/show/3124166-monty-python-s-tunisian-holiday"
}