{
  "title": "Insane Consequences: How the Mental Health Industry Fails the Mentally Ill",
  "description": "This well-researched and highly critical examination of the state of our mental health system by the industry's most relentless critic presents a new and controversial explanation as to why--in spite of spending $147 billion annually--140,000 seriously mentally ill are homeless, 390,000 are incarcerated, and even educated, tenacious, and caring people can't get treatment for their mentally ill loved ones. DJ Jaffe blames the mental health industry and the government for shunning the 10 million adults who are the most seriously mentally ill--mainly those who suffer from schizophrenia and severe bipolar disorder--and, instead, working to improve \"mental wellness\" in 43 million others, many of whom are barely symptomatic. Using industry and government documents, scientific journals, and anecdotes from his thirty years of advocacy, Jaffe documents the insane consequences of these industry-driven psychiatric hospitals for the seriously ill are still being closed; involuntary commitment criteria are being narrowed to the point where laws now require violence rather than prevent it; the public is endangered; and the mentally ill and their families are forced to suffer.Insane Consequences proposes smart, compassionate, affordable, and sweeping reforms designed to send the most seriously ill to the head of the line for services rather than to jails, shelters, prisons, and morgues. It lays out a road map to spend less on mental \"health\" and more on mental \"illness\"--replace mission creep with mission control and return the mental health system to a focus on the most seriously ill. It is not money that is lacking; it's leadership. This book is a must-read for anyone who works in the mental health industry or cares about the mentally ill, violence, homelessness, incarceration, or public policy.",
  "genres": [
    "Nonfiction",
    "Psychology",
    "Mental Health",
    "Mental Illness",
    "Science",
    "Social Work",
    "Health"
  ],
  "author": "D.J. Jaffe",
  "average_rating": "3.69",
  "url": "https://www.goodreads.com/book/show/31258834-insane-consequences"
}