{
  "title": "The Burning Claw",
  "description": "Jacque’s mind wandered as she hovered somewhere between life and death. Her body longed to let go, to sink into the peaceful abyss, to the place where she didn’t have to worry about rabid, child-snatching vampires and the carnage they’d caused to so many innocent families. But something kept her here, tethered to this world, something she couldn’t quite remember hovered just on the edge of her consciousness, something vital. It wasn’t Fane, he would be with her on the other side, she knew that. If she died, he died too and he wouldn’t have it any other way. She could feel Peri’s presence in her body. The fae was fighting, expending every ounce of her energy to keep her and Fane alive and the strain was taking its toll on the fae. But why? Why was the fae fighting as if her own life depended upon Jacque’s survival? Jacque was starting to remember someone else—someone that depended on her. A brand new life, precious and perfect…her son.Costin’s best friend lay as if sleeping, clinging to life by a mere thread, held at the other end by the powerful fae. But the thread holding Costin to his own sanity was just as feeble. Sally, his world, his light, his brown-eyes, the only thing that keeps the darkness at bay, was gone. Simply vanished. Costin didn’t know how or where, and it was tearing him up inside. The young boy, Titus, his adopted son, was the only thing that kept his wolf from taking over completely. Costin would be strong for the boy for as long as he could, but he wasn’t sure how long he could keep the feral would at bay.Bethany, the brave young girl that had been rescued from the clutches of the vampire coven to which she’d served as food for the past seven years, was now sharing a room with her true mate, with absolutely no understanding of what that meant. Though the girl had proven to be resilient, she had no idea how to handle the huge dominating werewolf that had staked his claim on her. Drake was past the point of feral when he’d found her, and that kind of darkness doesn’t let go without a fight. The strongest of alpha females, raised with a full understanding of pack law and the power of the mate bond, would have had a tough time dealing with the wolf. Bethany, a dormant, who had no idea who or what she was, didn’t stand a chance.",
  "genres": [
    "Fantasy",
    "Paranormal",
    "Young Adult",
    "Werewolves",
    "Romance",
    "Shapeshifters",
    "Paranormal Romance"
  ],
  "author": "Quinn Loftis",
  "average_rating": "4.55",
  "url": "https://www.goodreads.com/book/show/31278375-the-burning-claw"
}