{
  "title": "An American Sickness: How Healthcare Became Big Business and How You Can Take It Back",
  "description": "An Advance Reader Copy exists here.Award-winning New York Times reporter Dr. Elisabeth Rosenthal reveals the dangerous, expensive, and dysfunctional American healthcare system, and tells us exactly what we can do to solve its myriad of problems.  It is well documented that our healthcare system has grave problems, but how, in only a matter of decades, did things get this bad? Dr. Elisabeth Rosenthal doesn't just explain the symptoms; she diagnoses and treats the disease itself. Rosenthal spells out in clear and practical terms exactly how to decode medical doublespeak, avoid the pitfalls of the pharmaceuticals racket, and get the care you and your family deserve. She takes you inside the doctor-patient relationship, explaining step by step the workings of a profession sorely lacking transparency. This is about what we can do, as individual patients, both to navigate a byzantine system and also to demand far-reaching reform.  Breaking down the monolithic business into its individual industries--the hospitals, doctors, insurance companies, drug manufacturers--that together constitute our healthcare system, Rosenthal tells the story of the history of American medicine as never before. The situation is far worse than we think, and it has become like that much more recently than we realize. Hospitals, which are managed by business executives, behave like predatory lenders, hounding patients and seizing their homes. Research charities are in bed with big pharmaceutical companies, which surreptitiously profit from the donations made by working people. Americans are dying from routine medical conditions when affordable and straightforward solutions exist.  Dr. Rosenthal explains for the first time how various social and financial incentives have encouraged a disastrous and immoral system to spring up organically in a shockingly short span of time. The system is in tatters, but we can fight back. An American Sickness is the frontline defense against a healthcare system that no longer has our well-being at heart.",
  "genres": [
    "Nonfiction",
    "Health Care",
    "Health",
    "Medicine",
    "Politics",
    "Medical",
    "Business"
  ],
  "author": "Elisabeth Rosenthal",
  "average_rating": "4.30",
  "url": "https://www.goodreads.com/book/show/31258172-an-american-sickness"
}