{
  "title": "Tempted By The Lion Shifters: A Menage Shifter Erotic Romance (The Ward Pride",
  "description": "Alice Benson moved back to her home town after college for the quiet life. She just wants to be left alone to spend time with her family and run her business. When she meets , alpha lion shifters Lucas Ward and his cousin Nick , she's irritated by his caveman-like behaviour, but can't stop thinking about him. About them both . Will she be able to ignore this strange infatuation and move on with her life? Or will she begin to spiral into a world of lust and sensuality she never imagined existed at the hands of these two alpha lion shifters?Lucas Ward is moody, arrogant and oh so handsome, with the kind of natural charisma that Hollywood stars would kill for. Forced to come back to his hometown and take over the family business after his father's death, he's in no mood to be crossed, and Alice's snarky behaviour and luscious curvy figure puts her squarely in his sights, even though his pride laws forbids relationships with humans.Nick Ward is Lucas' younger cousin, but growing up together has made them more like brothers. Nick is everything Lucas wishes he could be - cheerful, carefree and easy to get along with. Their bond is more than blood, and they share everything. Will Alice be willing to accept her attraction to both of them ? Or will her shyness drive her away?When these three cross paths, sparks will fly; warring prides will threaten Alice's family, and Lucas and Nick will be called on to make difficult, possibly pride changing decisions. Will Alice be able to resist the irresistible charisma of the Ward men? Will the Ward's break centuries old rules to help a lowly human? Can Alice survive her involvement with the prides? This story is the first in a series of lion shifter menage stories. This is an erotic romance series. While there is more plot than an erotic novel, the erotic scenes are extremely graphic.",
  "genres": [],
  "author": "Leona Bloom",
  "average_rating": "4.40",
  "url": "https://www.goodreads.com/book/show/31286102-tempted-by-the-lion-shifters"
}