{
  "title": "The Roanoke Girls",
  "description": "Listening time 10 hours 41 minutesVowing to discover the fate of her missing cousin, a woman returns to her family’s Kansas estate where she spent one haunting summer as a teen, and where she discovered the dark heart of the Roanoke clan that left her no choice but to run.Lane Roanoke is fifteen when she comes to live with her maternal grandparents and fireball cousin, Allegra, at the Roanoke family estate in rural Osage Flats, Kansas, following the suicide of her mother. Lane knows little of her mother’s family, other than the fact that her mother ran away years before and cut off all contact with her parents. Allegra, abandoned by her own mother at birth and raised by her grandparents, introduces Lane to small-town life and the benefits of being one of the rich and beautiful Roanoke girls. But there is darkness at the heart of the Roanoke family, and when Lane discovers its insidious pull she has no choice but to run, as far and as fast as she can.Eleven years later, Lane is scraping by in Los Angeles when her grandfather calls with the news that Allegra has gone missing. “Come home,” he beckons. Unable to resist his pleas, Lane returns to Osage Flats, determined to find her cousin and assuage her own guilt at having left Allegra behind all those years ago. Her return might mean a second chance with Cooper, the boyfriend whom she loved and destroyed that fateful summer. But it also means facing the terrible secret that made her flee, one she may not be strong enough to run from again.As it weaves between the summer of Lane’s first arrival and the summer of her return, The Roanoke Girls shocks and tantalizes, twisting its way through revelation after mesmerizing revelation, exploring the secrets families keep and the fierce and terrible love that both binds them together and rips them apart.",
  "genres": [
    "Mystery",
    "Fiction",
    "Thriller",
    "Mystery Thriller",
    "Contemporary",
    "Audiobook",
    "Adult"
  ],
  "author": "Amy Engel",
  "average_rating": "3.72",
  "url": "https://www.goodreads.com/book/show/31285121-the-roanoke-girls"
}