{
  "title": "Mated to the Beast",
  "description": "After two of her brothers are killed in battle with the relentless alien menace that threatens the entire Interstellar Coalition, Sarah Mills volunteers to join the fight in an effort to bring home her last surviving brother. When she is mistakenly processed as a bride rather than a soldier, however, she rejects the match. But her mate has other ideas…  Dax is an Atlan warlord, and like all the men of his race, a primal beast lurks within him, ready to emerge in the fury of battle or the heat of the mating fever. When he learns that his bride has chosen to fight on the front lines rather than share his bed, he sets out to track her down and take what the beast demands.  Sarah is none too pleased when a massive brute claiming to be her mate arrives suddenly in the midst of a battle, and her displeasure turns to fury when Dax’s presence disrupts her mission and leads to the capture of her brother. But after her commanding officer refuses to authorize a rescue mission, Sarah’s best hope of saving the only family she has left is to accept Dax’s offer to help, even if that means giving herself to him in return.  Though he is thrilled to have located his wayward bride, Dax quickly discovers that Sarah is nothing like the meek, submissive women of his world. If he wants her, he will have to tame her, with a firm hand applied to her bare bottom if necessary. But Dax doesn’t just want Sarah, he needs her. Can she satisfy the fearsome beast within him before he loses control completely?  Publisher’s Note: Mated to the Beast is a stand-alone book set in the same world as Assigned a Mate, Mated to the Warriors, Claimed by Her Mates, and Taken by Her Mates. It is an erotic romance novel that includes spankings, sexual scenes, elements of BDSM, and more. If such material offends you, please don’t buy this book.",
  "genres": [
    "Romance",
    "Science Fiction",
    "Aliens",
    "Audiobook",
    "Erotica",
    "Paranormal Romance",
    "BDSM"
  ],
  "author": "Grace  Goodwin",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/31290852-mated-to-the-beast"
}