{
  "title": "The Found",
  "description": "Witness to a murder. Kidnapped by a monster. Life hanging on a whim. Willow Armitage’s world was already falling apart; between getting fired and caring for her chronically ill father, she’s had little room for anything but survival. But that survival hangs in the balance the night she stumbles into a back alley – and watches a stranger die at the hands of the most beautiful man she’s ever seen.Lethal. Powerful. Unstable. Terrifying. The contract killer known only as Priest is a dangerous unknown, and when Willow wakes tied to a chair in his hideout, the only thing she sees in his fox-gold eyes is death. Yet for Priest, Willow is a dilemma: an innocent, a saint among the sinners he cuts down in the streets of Crow City. His code of honor forbids shedding innocent blood. Releasing her will send her straight to the police. The only answer is a warped game, and his promise: that he will find the darkness inside her, expose it, and prove that deep down, everyone is just as monstrous as he…and just as worthy of death.Yet he unearths not a monster, but a smoldering and secret desire – one that has always terrified Willow, and may be her undoing. His touch sets her alight. His strength burns through her like flame. And his control melts her each time he binds her virgin body, possesses her, teaches her the strength in weakness and the passion in submission. But that passion may be her damnation, and in the end Willow must choose: Priest’s love, or her own life.When his every kiss is pure sin…can she resist damnation long enough for Priest to find his way to redemption?TRIGGER WARNING 18+: This story contains content centered around non-consent, bodily autonomy, sexual assault, bodily functions, and violence. Please focus on self-care above all, and don't be afraid to put the book down if you need to in order to protect yourself. You come first, always.",
  "genres": [
    "Dark",
    "BDSM",
    "Erotica",
    "Suspense",
    "Romance",
    "Military Fiction",
    "M F Romance"
  ],
  "author": "Cole McCade",
  "average_rating": "4.03",
  "url": "https://www.goodreads.com/book/show/31291756-the-found"
}