{
  "title": "Prison Planet - Swastikas were \"S\" letter shapes for \"SOCIALIST\"; Fascist behavior & the Third Reich's stiff-armed gesture came from the USA",
  "description": "PRISON You are incarcerated. What can you do to escape? The Pointer Institute points the way out with this new blockbuster from the author Ian Tinny and the famous Dead Writers Club. Revelations that TV, radio, newspapers, public schools, and public officials will never tell you or anyone -1. Fascist behavior and the Third Reich's stiff-armed gesture originated in the USA's Pledge of Allegiance to the flag and in government schools (socialist schools). 2. Swastikas, although they were ancient symbols, were altered by Adolf Hitler and used to represent crossed \"S\" letter shapes for \"SOCIALISM.\"Every page explains the mind-blowing work of that rock star of historical research, Dr. Rex Curry, also known as the \"Libertarian Lawyer.\" Discover secrets about how to fight the police state and its constant spread. Learn how to protect yourself. Don't pledge Declare your independence. Tell the so-called \"You are a public servant. I am not.\" The key to your cell door is hidden inside this book, along with written instructions about the plan. Your getaway car awaits if you trick the vicious dogs and evade the police. End your punishment! This whirlwind examines agnotology (the study of the spread of ignorance). Agnotology is the study of wilful acts to spread confusion and deceit, usually to steal more money (taxation) or to increase the size of government (socialism). Learn how politicians and government spread ignorance and obfuscate knowledge. They engage in the deliberate propagation of ignorance. Ian Tinny explores how powerful statists promote ignorance to sell their socialism. Ignorance is power… and agnotology is about the deliberate creation of ignorance. When you look into agnotology, you discover a secret world of classified science, and thought historians should give this more attention.Learn the truth. That government and news outlets overflow with shameless liars is not only a reflection on them, it is also a reflection on us. When people want fiction, then only liars can suffice. When stupid people do something they are ashamed of, they always declare that it is their patriotic duty.Each of the 32 chapters is filled to the brim with jaw-dropping news - Table of Contents 51 Prison Planet 112 Police State Origins 223 America’s 3rd Riech 324 Pledge of Allegiance Fascism 395 USA & Confederacy Vexillology 426 Freemasons & Authoritarians 477 USA’s Prison in Deutschland 568 Swastikas as \"S\" letters & VW, SS 599 Holocaust & Wholecaust Deaths 7310 Mein Kampf Word Analysis 8411 Hitler's Socialist Signature 9412 Mussolini’s Prison Planet 10313 America’s August Landmesser 11114 Bellamy Goose Steps in the U.S. 11415 Analysis of the Prison Planet 12016 Fight the Prison 12717 Uncovering Police Dog Fraud 13218 Narcotics Dog Training 14119 Illinois’ Prison Planet 14620 Sniffer Dog Research 14921 Guns & the Prison Planet 15322 To Not See Nazi Socialism 15823 Training Dogs & Lizards 16124 Socialist Programs 16425 Woodman Spare that $10 Tree 16726 Tree Laws Kill Trees 17527 Cops in the Prison Planet 17828 Prison Schools 18229 Triangle Shirtwaist Factory Fire 18430 Soviet Socialist Poetry 18831 Capitalist Pearls 18932 Democracy = Dumbocracy 190Ian Tinny is a mental health counselor working with the United States Probation Office, federal judges, and various sociopathic criminals in the justice",
  "genres": [],
  "author": "Ian Tinny",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/31285484-prison-planet---swastikas-were-s-letter-shapes-for-socialist-fascis"
}