{
  "title": "Out of the Blue",
  "description": "If you want a dose of escapism, then look no further than bestselling author Belinda Jones's sparkling and sizzlingly seductive comedy set on the island of Crete. Fans of Jo Thomas, Lindsey Kelk, Sophie Kinsella and Paige Toon will not be disappointed!'A cut above most romantic comedies...a gem' -- Woman's Own'Perfect summer fun' - Sun'This zippy tale is the perfect read for anyone who likes their food tasty and their men even tastier' - Cosmopolitan'Absolutely loved this book...Belinda Jones never fails to deliver' -- ***** Reader review'Had me hooked from the start and couldn't put it down' -- ***** Reader review'I read this book every summer and have lent it out to all my friends. Such a lovely story. You will find yourself totally besotted. It's my favourite book' -- ***** Reader review'This book is definitely worth a read as it cheers you up on a rainy day and really does make you feel like you have gone on holiday' -- ***** Reader review********************************************************************************HOME IS WHERE THE HEART IS...BUT WHAT IF YOU DON'T KNOW WHERE YOUR HOME IS?Selena Harper has always thought she has the perfect working on a luxury cruise ship, she's whisked around the world from Alaska to Zanzibar with excitement and adventure awaiting her in every port.But as she prepares for her latest shore-leave, she finds herself unexpectedly deserted by her newly-engaged best friend and begins to wonder if life on the ocean wave really is her dream come true.Why is she the only one who isn't settling down? And how can she be feeling homesick when she has no home?On a whim, she agrees to spend a week on the idyllic island of Crete , in the company of Alekos , a man she's convinced is an incorrigible womaniser. Steeped in mythology, the island soon starts to work its magic on Selena - and, more worryingly, so does Alekos.Is he really the cad she thinks he is? Or could he be just what she needs?",
  "genres": [
    "Chick Lit",
    "Romance",
    "Fiction",
    "Contemporary Romance",
    "Greece",
    "Contemporary"
  ],
  "author": "Belinda Jones",
  "average_rating": "4.02",
  "url": "https://www.goodreads.com/book/show/3128472-out-of-the-blue"
}