{
  "title": "A Country Christmas",
  "description": "Three Regency Romance novellas by Josi S. Kilpack, Carla Kelly, and Jennifer Moore.SAINTS AND SINNERS by Josi S. Kilpack. When Neville Franklin’s best friend Burke wants to wager who can kiss Eloise first, Neville puts a stop to it. Eloise has been his friend since childhood, and, well, she’s off-limits. Especially to Burke. As Burke pursues Eloise and claims that she has a tendre for him, Neville becomes more and more protective of the girl he grew up with. On the night of the Christmas ball when Eloise appears in a dress that clearly shows that she is no longer a girl, but a beautiful woman, Neville realizes that his protective feelings toward Eloise have turned into something greater. But now, Neville’s best friend stands in his way.THE CHRISTMAS ANGLE by Carla Kelly. Sailing Master Able Six is on half-pay with the British navy, biding his time during the uneasy Peace of Amiens and the resumption of war. Meanwhile, he’s invited to teach young pupils at the home of a vicar outside of Plymouth. There, he unexpectedly meets Meridee, the spinster sister-in-law of the vicar. From the moment Able sees Meridee, he’s entranced. When she asks him about his past and discovers his remarkable yet troublesome gift, he realizes he’s finally found someone who can care for all of him. Sadly, Able’s low station and half-pay gives him no way to provide for a wife. Meridee’s lack of dowry and dependence on relatives makes their union impossible at best. But isn’t Christmas a season of hope?THE PERFECT CHRISTMAS by Jennifer Moore. Archie Clawson wants nothing more than to give Jane the perfect Christmas. Since her troubled childhood, she’s not experienced a Christmas with all the trimmings. To top off the perfection, he also plans to ask her to marry him on Christmas Eve. But as he and his friends, including Jane, travel to his country home, they are caught in a snowstorm and discover that notice of their arrival did not get through to the house staff. Worried over the disappointment he must be causing Jane and the complete shift in their planned Christmas, Archie fears that he’s misinterpreted her kindness towards him and lost her favor forever.",
  "genres": [
    "Christmas",
    "Romance",
    "Regency",
    "Historical Fiction",
    "Historical Romance",
    "Historical",
    "Anthologies"
  ],
  "author": "Josi S. Kilpack",
  "average_rating": "3.95",
  "url": "https://www.goodreads.com/book/show/31290539-a-country-christmas"
}