{
  "title": "Wicked Rivals",
  "description": "A LORD WITH LEGENDARY CONTROL…  Merciless and powerful, Ashton Lennox is a wealthy man because he puts business before everything else, especially love. As a member of the infamous League of Rogues, he’s no stranger to scandal. His bedroom conquests are as legendary as his fortune. As he searches for a way to bring down an old enemy bent on destroying the lives of his friends, the last thing he needs is a Scottish widow getting in his way.  A FIERY WOMAN WHO WON’T BACK DOWN…  The daughter of a Scottish lord with a dark and treacherous past, Rosalind Melbourne has spent years distancing from her past. After escaping her tyrannical father and marrying an aging English lord, she has become a powerful widow with a business empire at her command. Her business dealings are everything to her, leaving her no time for love. Especially not with her business rival Ashton, a man with a scandalous reputation as striking as his blue eyes.  A GAME OF WITS TURNS TO A GAME OF SEDUCTION…  Ashton is fascinated by the strong-willed, intelligent and sensual lady who, up until now, had outsmarted him at every turn. Rosalind wishes she could deny she is falling for the brooding, handsome baron. How can she possibly trust him when doing so could cost her what she values most—her freedom? When Ashton discovers Rosalind might hold the key to saving the League of Rogues, he knows he will do anything to woo his wicked lass. As their pasts return to haunt them and dark forces rise to keep them from exposing a deadly spymaster, their game of love turns to a game of survival…  Warning: This book includes a brooding baron who’s wild in bed, a crafty Scottish lass who never knows when to quit, a wicked game of strip chess, and a merry band of rogues whose first instinct is to run they hear wedding bells ring.",
  "genres": [
    "Historical Romance",
    "Romance",
    "Historical",
    "Enemies To Lovers",
    "Audiobook",
    "Historical Fiction",
    "Regency"
  ],
  "author": "Lauren   Smith",
  "average_rating": "4.15",
  "url": "https://www.goodreads.com/book/show/31286807-wicked-rivals"
}