{
  "title": "Robin Hood Existed",
  "description": "Hollywood likes to make money out of Robin Hood, but the truth about him should not be allowed to fail. The existence of everyone’s favourite outlaw has been questioned for years, but the truth is that this is all based on historical misplacement. We don’t have to tell our children untruths about this son of Sherwood, have that awkward moment when we break it to them that he might not have existed, or even embellish the tale for the sake of the telling. Robin Hood did exist! Understanding why the storytelling has become so murky is key to re-enlightening our culture on what exactly he meant and means to the nation. There are currently multiple Robin Hood movies in production, none of which give any indication that they are focused on historical research in order to construct a story. However, for those who go looking, it is possible to find something authentic – more than just a legend or myth. The only difficulty is knowing where to start, which historians to reject or pay attention to, and learning which avenues of the story are false. Michael Reuel’s research gets to the core of the Robin Hood we should know, by sifting through the evolution of the folklore to achieve a clear definition of his origins, while establishing which historical approaches are the most fruitful when studying the life of a medieval outlaw. As popular culture continues to evolve, the original tales of our folkloric heroes need to be cherished more than ever. Because the more false myths that are allowed to form around a man like Robin Hood, the further away from the original tales the storytelling gets. There is, in fact, such a thing as a definitive take on the original Robin Hood tales. Even a blueprint for telling the story as it was originally envisioned to be told, providing we understand what context to view the earliest texts. Robin Hood Existed provides that context, shedding light on what kind of man Hood was, his lifestyle, his culture and his worldview. The result is far more down to earth and brutal than that of the dispossessed nobleman we are often introduced to, but fear not. The original Robin was certainly heroic; a deeply principled man whose affections for the ordinary folk led him to live a life that does indeed fit the mold of the hero who robbed from the rich to give to the poor. There’s just so much more to it than that.",
  "genres": [
    "History"
  ],
  "author": "Michael Reuel",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/31290182-robin-hood-existed"
}