{
  "title": "At the Bottom of the World",
  "description": "New York Times bestselling authors Bill Nye the Science Guy and Gregory Mone take middle-grade readers on a scientific adventure in the launch of an exciting new chapter book series, Jack and the Geniuses. The perfect combination to engage and entertain readers, the series features real-world science along with action and a mystery that will leave kids guessing until the end, making these books ideal for STEM education.   In the series opener, Jack and the Geniuses: At The Bottom of The World, readers meet Jack and his foster siblings, Ava and Matt, who are orphans. But they’re not your typical kind of orphans—they’re geniuses. Well, Ava and Matt are, which sometimes makes life difficult for twelve-year-old Jack. Ava speaks multiple languages and builds robots for fun, and Matt is into astronomy and a whiz at math. As for Jack, it’s hard to stand out when he’s surrounded by geniuses all the time.   When the kids try to spy on Dr. Hank Witherspoon, one of the world’s leading scientists, they end up working for him in his incredible laboratory. Soon, Hank and the kids travel to Antarctica for a prestigious science competition, but they find that all is not as it seems: A fellow scientist has gone missing, and so has any trace of her research. Could someone be trying to use her findings to win the contest? It’s up to Jack, Ava, and Matt to find the missing scientist and discover who’s behind it all—before it’s too late.   Integrating real science facts with humor and suspense, and featuring an ensemble cast of loveable boy and girl characters, this uniquely engaging series is an irresistible chemical reaction for middle-grade readers. With easy-to-read language presented in a fun, motivating, and accessible way, this series opener is a great book for both inquisitive kids and reluctant readers. The book also includes information about the science discussed and used to solve the mystery, as well as a cool science project about density that kids can do at home or in the classroom. Bill Nye's brand new talk show series for Netflix, \"Bill Nye Saves the World\" is set to launch in Spring 2017.",
  "genres": [
    "Mystery",
    "Middle Grade",
    "Adventure",
    "Childrens",
    "Science",
    "Juvenile",
    "Chapter Books"
  ],
  "author": "Bill Nye",
  "average_rating": "3.95",
  "url": "https://www.goodreads.com/book/show/31305496-at-the-bottom-of-the-world"
}