{
  "title": "Dead on the Water",
  "description": "A NEW BREED OF ZOMBIEAn innocent child, injured.A family, in peril.The Fantasy Lines is known all throughout America as one of the best ways to have a family- friendly vacation. Why wouldn't it be a perfect choice? A voyage out to sea, docking in exotic locales, sampling cuisines from around the world… all while out in the crystal-clear waters as you take in some world-class entertainment. Belize, renowned for its breathtaking marine life and lush landscapes, an obvious selection as a stop for Fantasy Lines. Until now.A strange lab is harboring secrets deep within the confines of Belize.Atrocities that have cruelly been labeled “experiments” are being performed.One of the many families aboard the Fantasy Lines is headed into town to do a bit of shopping. Regrettably, a stray dog foraging for food winds up dining on some genetically altered rats, and the meal changes him for the worse. The family's young daughter, little Ariana, is suddenly nipped by the infected dog, and, soon, she is back on board and out to sea.It's a new breed of zombie – zombies that can organize, zombies that can plan, zombies that can think. Now, the Fantasy Lines cruise ship has become the rowboat heading down the river, with drooling demons craving flesh. Bands of drunken frat boys are now muscled marauders, howling for human meat. The puppetmaster of all these sins against humanity is none other than the captain of the ship himself. It's up to the few remaining survivors to do all they can to fight off the hordes of zombies.Then… there's the lab in Belize.Something there has gone wrong, terribly wrong.While the cruise passengers are fighting for their lives, a courageous lab assistant and members of the CDC are doing all they can to contain the virus.Will the courage of the passengers be a match for the cold, calculating undead?Can the secret coalition in Belize stop a world-ending catastrophe?",
  "genres": [
    "Zombies",
    "Horror"
  ],
  "author": "R.W.K. Clark",
  "average_rating": "3.35",
  "url": "https://www.goodreads.com/book/show/31299347-dead-on-the-water"
}