{
  "title": "Progeny",
  "description": "A MISSING BROTHERA MYSTERIOUS ISLANDAND AN ANCIENT EVIL PULLING THE STRINGS...It has been months since John Carter's estranged brother, Henry, has gone missing. When last heard from, he was sailing off to Bermuda in search of an author whose books deal with the esoteric traditions of past ages.Reluctantly, John joins Henry's old Special Forces Teammates on a trip to Bermuda, hoping to discover the truth behind Henry's disappearance. But not all is as it seems in Bermuda, and the puzzle that awaits John on the small island paradise will prove to be more sinister than anything the world has seen in a very long time.As the fingers of an ancient evil seek to draw him into another world - a world where all of Hell is trying to break loose - John must confront the truth of his own past...and pray that he might survive its revelation......that the world might survive its revelation.Described as \"Dan Brown meets Lost meets Left Behind,\" Progeny takes the reader through the heart of the Bermuda Triangle and drops them in a world where biblical legends and ancient mythologies - the similarities of which Hopkins \"describes with academic dexterity\" - reign terrifyingly supreme. Buckle up! Progeny is \"equal parts religious thriller and action-packed roller coaster ride!\"\"A well-researched and fast-paced thriller!\" - Larry Enright, best-selling author of 12/21/12 and Four Years From Home\"Will make you question what you believe!\" - Doug Dorow, best-selling author of The Ninth District\"This is a meaty meal of thrills!\" - Ryne Douglas Pearson, best-selling author of Simple Simon and screenwriter of the box-office hit, Knowing.\"Cussler, Brown, Hopkins!\" - Heidi Ruby Miller, Ambasadora\"DaVinci Code meets Stargate...a gritty, bloody tale that will make you think, question, and cringe from one page to the next!\" - Christopher Starr, The Road To Hell",
  "genres": [
    "Horror",
    "Fiction",
    "Paranormal",
    "Thriller",
    "Fantasy",
    "Action",
    "Christian Fiction"
  ],
  "author": "Shawn Hopkins",
  "average_rating": "3.45",
  "url": "https://www.goodreads.com/book/show/11938097-progeny"
}