{
  "title": "مقتل بائع الكتب",
  "description": "قراءة ..لرواية مقتل بائع الكتب ..  بقلم الاستاذ حميد المختار ..لعب الروائي سعد محمد رحيم في روايته الجديدة ( مقتل بائع الكتب) على أكثر من مدونة حيث استحضر المذكرات والرسائل والتأملات والمواضيع الأخرى التي لها مساس مباشر بحياة بطل الرواية ( محمود المرزوق) هذه الشخصية المركبة التي تحمل في طياتها ملفات كثيرة وحياة إشكالية ملتبسة فضلاً عن علاقاته الكثيرة التي أضفت على أجواء الرواية لوناً عالمياً إضافة الى روحها المحلية الخالصة (محمود المرزوق) الذي يعود بالخطأ إلى العراق وتتوالى سلسلة الأخطاء في حياته، حتى موته لم يكن هو المقصود في عملية الاغتيال إنما شخص آخر. لكن حادث اغتياله هو الذي فجر كل هذا التاريخ السري ومن خلالها عاد بنا الروائي إلى البدايات، كما لو انه عاد ليشكل مشهد بدايات الخليقة أو بدايات نشوء الأوطان والممالك. أحسست وأنا أقرأ الرواية أنني أعرف المرزوق أو انني ربما التقيت به في حياتي الثقافية مع مثقفي العراق فهو رسام وعاشق للموسيقى والأدب واللغات والكتب والجمال والعلاقات الإنسانية الحميمة. أنا شخصيا وجدت فيه ذاتي مجسدة كل معاني الحياة المتشابكة التي يعيشها المثقف والمبدع العراقي، لذلك اختصر هذا البطل تاريخا حافلا بالوعي والنضال سواء داخل العراق أو خارجه مؤسسة حالة إنسانية رأيناها في حيواتنا الكثيرة التي غامرنا بولوج تجاربها القاسية على اختلاف اتجاهاتنا وأفكارنا، لذلك وان كان البطل يساريا لكنني كما قلت رأيت فيه نفسي ومن هنا تأتي قدرة الروائي المتمكن حين يرسم ملامح شخصيته الرئيسة بحيث انها تندغم مع الواقع وتتلاشى فيه ويتمثل في هذا الواقع بكل عقده وثورات غضبه وانتفاضاته (مقتل بائع الكتب) واحدة من الروايات التي تؤسس لما أسميه بتاريخ الكتب من خلال توظيف المكتبة والشخصيات كما في رواية (فهرس) لسنان انطون وكذلك رواية خضير فليح الزيدي (فندق كوستيان) سواء شارع المتنبي أو سرد لحياة مكتبة وتاريخ الكتبيين الذين بدؤوا يؤسسون لدور نشر ومؤسسات ثقافية ذات شأن واضح. اذن فرواية (مقتل بائع الكتب) تحمل في طياتها ملمحا تأسيسيا يدخل تحت مسمى رواية ما بعد الدكتاتورية. هذا المصطلح الذي بات متداولا في الأوساط الثقافية والسردية لما له من أهمية واضحة في إضافة خطوة جديدة وواثقة وقادرة على فعل التأسيس والتجاوز. والروائي سعد محمد رحيم واحد من الروائيين العراقيين المقتدرين الذين حققوا عبر أكثر من خطوة روائية شكلا لتجربة ناضجة ومقدرة سردية مهمة أضافت للسردية العراقية بعدا جماليا واضحا.",
  "genres": [
    "Novels",
    "Fiction",
    "Mystery",
    "Historical Fiction",
    "Audiobook",
    "Crime"
  ],
  "author": "سعد محمد رحيم",
  "average_rating": "3.09",
  "url": "https://www.goodreads.com/book/show/31311605"
}