{
  "title": "Magellan: Conqueror of the Seas",
  "description": "Portuguese explorer Ferdinand Magellan (1480-1521), the first to circumnavigate the globe, sailed on behalf of the Spanish monarch from the Atlantic to the Pacific Ocean, and discovered the straights that now bear his name and the Philippines.  “Magellan is written in a tone of astonished wonder... a persuasive and crisp portrait of Magellan... Stefan Zweig brings the story of Magellan to life.” — Charles Poore, The New York Times  “[A]n extremely well-written narrative, fired by a keen sense of justice, and with its dramatic and emotional qualities well sustained... [Zweig’s] own passion for his subject carries the story well.” — R. L. Duffus, The New York Times  “A superb piece of reconstruction, intensely interesting first as a record of one of the greatest achievements in human history, and second, as a live picture of a tragic figure, Magellan, lonely and misunderstood and cheated at the end of the reward in recognition of the stupendous and courageous task he had envisioned and achieved. Fascinating reading, and enlightening as a minutely detailed picture of the problems faced and met, from the first step to the last. A book which will last...” — Kirkus Review  “Zweig’s story opens with a fascinating chapter on spices. He explains the reasons for Magellan’s sailing under a Spanish flag after a youth spent in the service of Portugal. Such matters as the making of Magellan’s will, the absurd circumstances of his death, the reception of the 18 who returned, the corruption at court, are told in the light of present-day psychology and with an understanding of human nature that makes this tale of an adventurer excellent and provocative reading.” — The English Journal  “Zweig’s accumulated historical and cultural studies, whether in essay or monograph form, remain a body of achievement almost too impressive to take in... Full-sized books on Marie-Antoinette, Mary Stuart, and Magellan were international best sellers.” — Clive James, Cultural Amnesia",
  "genres": [
    "History",
    "Biography",
    "Nonfiction",
    "Travel",
    "Classics",
    "Adventure",
    "German Literature"
  ],
  "author": "Stefan Zweig",
  "average_rating": "4.41",
  "url": "https://www.goodreads.com/book/show/31316676-magellan"
}