{
  "title": "The Goddess Prophecies #1-3",
  "description": "When Darkness Falls, A Heroine Will Rise 1000s of copies sold. 1000000s of pages read. Over 70 five star reviews. Start this soulful, epic fantasy series today!NIGHT GODDESS (Book 1)  A world plunging into darkness. An exiled Dragon Lord struggling with his destiny. A young woman terrified of an ancient prophecy she has set in motion. He came through the Dark Rift hunting for those who had escaped his wrath. Unchecked, his evil spread. Now, the world hangs on a knife-edge and all seems destined to fall. But when the dark moon rises a goddess awakens, and nothing can stop the prophecy unfolding.  The Dread Dragons came when the sun set, hunting for the one of prophecy. Her homeland razed and her family murdered, Issa alone escapes the slaughter. Fleeing from the undead hordes of Baelthrom, she is thrown helplessly into the battle for the fate of the world. But when a forgotten goddess speaks to her, she discovers she has magical powers beyond her wildest dreams… or worst nightmares.  Asaph, exiled prince of a lost kingdom and last of the mighty, shapeshifting Dragon Lords, has dreamed of Issa his whole life. Even as he struggles against the dragon awakening within him, he must find the woman who haunts him, or die trying.THE FALL OF CELENE (Book 2)  Impossible Odds, Terrifying Powers The battle for Maioria has begun. Issa faces a deadly enemy as the Immortal Lord’s attention turns fully in her direction. Nothing will stand in Baelthrom’s way—he must destroy this new power that grows with the rising dark moon… or assimilate it.Hameka, a cunning, ruthless and brilliant commander, takes his savage fleet of undead to the tranquil shores of Celene. Cirosa, her plans thwarted, hungers for revenge.Issa’s enemies are many and few seek to join her cause as she struggles to survive against those who would enslave her. The warrior within is awakening but only by embracing the Raven Queen of prophecy can she hope to face the darkness that threatens to consume her.STORM HOLT (Book 3) Would you sell your soul to save the world?  The Storm Holt—the ultimate Wizard’s Reckoning, where all who enter must face their greatest demons. No woman has entered and survived since the Ancients split the magic apart eons ago. Plagued by demons and visions of a strange white spear, Issa must take the Reckoning to find her answers and fight for her soul to prove her worth to the most powerful magic wielders upon Maioria.Rejected by Issa, Asaph lusts after the enchanting pale woman who stalks him, but her allure is foreboding and her power deadly. The Cursed King and his Banished Legion return to end their curse, but all around them is bloody chaos and sorrow and all seems hopeless.Without the help of the Shadow Demons, Issa cannot hope to survive the Storm Holt—and without the help of the Raven Queen, the Shadow Demons will be destroyed. If Issa does not make a pact with the demons, then both Maioria and the Murk are doomed.  GODDESS AWAKENING (A Prequel) Daughter of a Seer, Chosen by a Goddess  Discover Issa's origins in this brand new epic prequel available for FREE with the boxed set.  An epic fantasy adventure series that draws on all the appeal of Tolkien’s deep and soulful characters, Robert Jordan’s sweeping worlds, and the ancient romance of Arthurian mythology. This is a saga full of spirit, determination and resilience.",
  "genres": [
    "Fantasy"
  ],
  "author": "Araya Evermore",
  "average_rating": "4.13",
  "url": "https://www.goodreads.com/book/show/31341685-the-goddess-prophecies-1-3"
}