{
  "title": "Chopped",
  "description": "★★★★★ “Start reading Chopped only when you can devote time to read it thru. This is a can’t put it down book.” A grisly corpse. An enemy from the past. Has Diana Hunter finally met her match? Diana Hunter’s keen analytical mind made her the most skilled operative in the Canadian Security Intelligence Service. But the young agent’s brilliant reputation attracted a deadly enemy. Ten years ago, Diana was captured by the elusive assassin known only as ‘Surgeon.’ She barely survived the ordeal. Now, years later, the amateur sleuth is still haunted by the shadowy psychopathic genius. Two days before the anniversary of her kidnapping, a dead body turns up in the streets of Vancouver. Diana knows it can’t be coincidence. Surgeon has claimed another victim and left her a ghastly calling card. Desperate to bring the psychopath to justice, Diana dangles herself as bait for this ruthless, arrogant killer. She thinks she can read his every move. But what happens if her plan goes horribly wrong? Chopped is an electrifying game of cat and mouse, played against an opponent whose obsessive mind always seems to be one step ahead. Can Diana and her handsome partner, Detective Peter Hopkinson, outwit this brilliant killer? Or will Surgeon make the final move in their deadly little game? Chopped is the third in this thrilling series featuring a feisty, fearless, female protagonist who is sometimes her own worst enemy. No bad language, graphic sex or violence, just plenty of excitement and suspense. \"Peter and Diana have a great chemistry.\" Praise for the Diana Hunter \"Diana Hunter stories combine detective and spy stories in a delightful way.\"\"On the edge of my seat...\"\"Page turner\" Books in the Diana Hunter Hunted (Prequel)SnatchedStolenChoppedExposed Buy Chopped and watch Diana Hunter match wits with her deadliest enemy!",
  "genres": [
    "Thriller",
    "Mystery",
    "Mystery Thriller",
    "Fiction"
  ],
  "author": "Alison Golden",
  "average_rating": "4.31",
  "url": "https://www.goodreads.com/book/show/31343568-chopped"
}