{
  "title": "Sidelined",
  "description": "From the USA Today Bestselling Authors, A.M. Hargrove and Terri E. Laine comes a new standalone sexy sports romance, Sidelined – A Wilde Players Dirty Romance.  Cassidy   I hate him… I love him… He destroyed me… and now He needs me.  Fletcher Wilde, a gorgeous quarterback in the NFL, is the man I should have married. He’s the one that walked away, choosing football over me. He shouldn’t be back, especially not looking that good. And not sitting in my waiting room chair with a bum leg and confident cocky grin that sets my insides on fire.  It’s impossible to forget how he rocked my world both in and out of the bedroom. Keeping things professional won’t be easy, especially given our history. My mission, however, is getting him back on the field—the place he loved more than me, while not losing myself in him all over again.  Fletcher  Cassidy Miller is the only physical therapist in town. And after a potential career ending injury, she’s my ticket back on the field or my NFL career is over. Unfortunately, she’s the same Cassidy who ripped my heart to shreds when I thought we were a team.  Sexy and intelligent, she’s the last person I thought I’d see again. As it turns out, she looks better than ever, making me want that smart mouth of hers doing things to me that would drive a sane man crazy.  Lucky for me, my determination is legendary. Winning is in my blood, which makes me number one on the field. Being a single-minded man, my focus is to get her back and this time for good.  *Don’t go looking for a lot of football in this book, although there will be several touchdowns. This quick, sexy, second chance love story will ignite your e-reader. Be prepared to sweat a little when you read this hot, fast and frivolous erotic love story!  **Story will end at fifty percent because we’ve added sneak peeks of our latest novels for your reading pleasure.",
  "genres": [
    "Sports",
    "Romance",
    "Sports Romance",
    "Football",
    "Contemporary",
    "Second Chance",
    "Contemporary Romance"
  ],
  "author": "A.M. Hargrove",
  "average_rating": "3.67",
  "url": "https://www.goodreads.com/book/show/31333913-sidelined"
}