{
  "title": "Mrs. Fix It Mysteries: The Complete 15-Books Cozy Mystery Series",
  "description": "Kate Flaherty has a knack for fixing things...and getting caught in the middle of murder investigations. Enjoy all of the following books in this collection:  HAMMERED The day Scott York returned to his hometown to become the new sheriff, his old high school girlfriend knew her life would be changed. Kate Flaherty is Rock Ridge’s handywoman. A mom struggling to put her twin boys through college, Kate takes every job she is offered…even the one that comes from Scott.  SCREWED DOWN MURDER Against the warning of police Chief Scott York to stay uninvolved, Kate cannot help but search for the murderer at the request of a suspect she believes is innocent.  A VENEER OF MURDER Another life has been unjustly taken. Her hometown has been threatened by anarchists. Kate’s husband is still missing. Mrs. Fixit is back and more determined than ever to solve Rock Ridge’s many mysteries.  DRILLED IN MURDER Kate's skills range from laying tiles to painting houses and everything in-between, but can she crack a burgeoning conspiracy that threatens to destroy RockRidge?  CHISELED When resident handywoman, Kate Flaherty shows up at a house to attach a doorknob, she finds one of Rock Ridge's finest dead on the floor. NAILED DOWN MURDER Kate discovers the local baker dead in her car. It's night. There's no one around. And Cookie Halpert didn't die of natural causes.  PAINT IT DEAD When a local ex-con with deep roots in this town winds up dead in the parking lot of Daisy's diner, a world of trouble emerges that once again pits Kate against her Police Chief husband.  CLAMPED ON MURDER Another dead body turns up in Rock Ridge, this time in a quaint room at the local inn. Rather than call the police, the innkeeper, Amelia knows just who can fix this: Kate Flaherty.  TOOL KIT CLUES When a plucky reporter by the name of Jenna Johansen is shot dead, it would seem the reporters aren't just covering the news, but causing it. And Kate will have to use every tool in her kit to catch the killer.  WRENCHED IN MURDER The prison warden, Grant Conover has been shot in the head and when Kate barges into his office ready to demand answers she knows he can supply, she is struck with the irreparable truth: her son, Jason might very well end up behind bars.  KILLER FOUNDATION Two calm years have passed since local handy woman, Kate Flaherty has seen a dead body, but all that changes when she's hired to renovate an old Victorian house where a woman has lain dead in the foundation for the past fifteen years.  DEAD AS A DOORNAIL Seven months pregnant and muscling her way through a prolonged bout of coffee withdrawal, Kate Flaherty is making it work and couldn't be happier. But when she stops in the local library and finds the grouchy librarian has been strangled dead, Kate's world is suddenly pitched into a deadly game of cat and mouse.  BODY ON THE BALCONY As Kate investigates the strange circumstances surrounding her employee's death, an unbelievable truth emerges, but if she tells her Police Chief husband, the next person to die could very well be her.  ROOFTOP KILLER When Kate is hired to repair a roof for a brand new customer, she witnesses a brutal murder.",
  "genres": [],
  "author": "Belle Knudson",
  "average_rating": "4.24",
  "url": "https://www.goodreads.com/book/show/31342404-mrs-fix-it-mysteries"
}