{
  "title": "The Two-Term Jinx!: Why Most Presidents Stumble in Their Second Terms, and How Some Succeed - Volume 1, George Washington-Theodore Roosevelt",
  "description": "The Two-Term Jinx!: Why Most Second-Term Presidents Stumble, and How Some Succeed, Volume 1, is a popular account of the wild presidencies of the two-term Chief Executives, from George Washington to Theodore Roosevelt. It details how most two termers have had unsuccessful or unlucky second terms. Lincoln and McKinley were both assassinated early in their second terms. George Washington was afflicted by ill health, by pirates, and by Alexander Hamilton's departure. James Madison fled to Virginia as British invaders burned his capital down. After the success of his first-term Louisiana Purchase, Thomas Jefferson imposed an ill-fated trade embargo in his second, while his former Vice-President Aaron Burr committed treason. Grover Cleveland was afflicted by cancer, and saw the economy collapse. In filling out Lincoln's second term, Andrew Johnson was impeached. This intriguing book supplies many examples that the so-called second-term curse is not legend at all, but real. As well as instances of some Presidents, such as Teddy Roosevelt, Andrew Jackson, and James Monroe, who managed to beat the second-term fall. It provides insights into how second-term woes can be avoided which can prove useful to any executive, or office worker or student, in any field or career. The book outlines the rivals and colleagues, and political viewpoints, of these famous figures. And the astonishing events and issues-the nation's founding, the naval wars with France and Britain, the Aaron Burr conspiracy, the War of 1812, the Monroe Doctrine, slavery, the role of federal banks and tariffs, the Civil War, Reconstruction, industrialization and the rise of unions and corporations, financial panics and recessions, the Spanish-American War, the Panama Canal, and more-with which they grappled. Volume 2 of The Two-Term Jinx!, also due out in 2016, will look at the two-term Presidents from Woodrow Wilson to Barack Obama. This work, although based on rigorous scholarship, is aimed more at a popular audience than an academic one. It tells the story of two-term presidents in a straight-forward, journalistic way. Its main market is the educated lay reader, with a particular interest in history and politics. Moreover, its many specific niche markets include students and teachers in the social sciences, U.S. and presidential politics, the school textbook market, and historians and journalists. Another target audience is readers of how-to business books, with this work providing lessons in successful and unsuccessful executive management at the highest level.",
  "genres": [],
  "author": "Edward P. Moser",
  "average_rating": "4.50",
  "url": "https://www.goodreads.com/book/show/31334429-the-two-term-jinx"
}