{
  "title": "Stolen",
  "description": "A survivor. A fighter. A threat.When Vancouver's elite convenes in the prestigious Four Seasons Hotel to celebrate and fund the new British Columbia Children's Hospital, it is a night of free flowing champagne, high class regalia and more flash than a museum could house - until suddenly everyone realizes all their precious jewels and baubles are gone.In the space of one moment the night turns from joy to confusion.... How did it happen? How were they all robbed, at once... without anyone seeing a thing?Diana Hunter works for a news and crime magazine, yet her past experience and impressive, Sherlock Holmes-like skills mark her as an asset only the government could have trained.Those skills are soon put to the test when the Superintendent of the Vancouver Police Department calls her in to work the case. Thrown together with a talented group, Diana must unravel the clues before the ghost like bandits strike again. With two successful heists behind them, Diana begins to fear the bigger picture and realizes that these 'robberies' may not just be robberies after all....Interview with the Author of the seriesQ - So, what makes the Diana Hunter series special?A - When I set out to write these books, I wanted to create something that mirrored exactly the kind of books I like to read. My top picks are always mystery novels, especially featuring female protagonists with attitude. Diana is badass and I can't tell you how many readers tell me she reminds them of themselves. She makes you feel you can do anything!The Diana Hunter books are a great mix of genres. There is nothing graphic or gratuitous in these books. Your Aunt Martha could definitely read them. But they are not \"roses around the cottage door\" -type mysteries. They are more hard-boiled with some romantic tension, suspense and thriller action to keep things interesting!Overall, the Diana Hunter series is designed to keep you turning the pages - and I've made sure there's never a dull moment.Q - In what order should I read the books?A - The Diana Hunter mysteries can be read and enjoyed in any order, however, Hunted is a prequel to the other books in the series. Unlike the other books, it is not a complete mystery. It relates the events that create the backdrop to the series and fills in some of Diana's personality and motivations. You don't have to have read the prequel to make sense of the later books but it will help to understand the sub plot more clearly.I've made sure not to include any spoilers for those who are new to the characters and any existing fans of Diana's adventures will still find plenty of fresh action and mystery as well as perhaps a few answers. All in all, there is something for everyone. The events in this prequel take place a few years before Snatched, the first book in the Diana Hunter series of mysteries.If you do want to read them in order, I'd suggest the following sequence:Hunted (prequel) Snatched Stolen (coming soon) Chopped (coming soon) Q - So, why should readers give these books a try?A - Because the Diana Hunter series is a fast, fun, thrill-ride that takes no prisoners! Our heroine kicks butt but has a soft center. We want her to win out even when she's making poor decisions and alienating those who can, and want, to help her. I think most women will see a little, or a lot, of themselves in Diana Hunter.Ultimately, readers who enjoy lightning-fast pacing with a plot that twists and turns all the way to the end will get a kick out of this series.Thanks for reading!",
  "genres": [
    "Mystery",
    "Mystery Thriller",
    "Fiction",
    "Suspense"
  ],
  "author": "Alison Golden",
  "average_rating": "4.04",
  "url": "https://www.goodreads.com/book/show/31334462-stolen"
}