{
  "title": "قصص من الحياة",
  "description": "وهذه قصصٌ من الحياة، سماها مؤلفها كذلك لأن الحياة ألّفتها. وهل تؤلف الحياة قصصاً؟ نعم (كما يقول في المقدمة): \"إن الحياة تؤلف قصصاً يعجز أبرع أهل الفن عن توهُّم مثلها، ولكنها لا تذيع \"مؤلفاتها\" ولا تعلن عنها، فتبقى \"مخطوطة\" مخبوءة لا يصل إليها ولا يقرؤها إلا رجل حديد البصر، طويل اليد، ذو جَلَدٍ على البحث وصبرٍ على التنقيب. ولست ذلك الرجل، ولا أنا من عشّاق المخطوطات وروّاد المباحث، ولكن الأيام ألقت هذه القصة في طريقي فوجدتها مطويَّةً في سجلات محكمة من المحاكم، مقطَّعةَ الأوصال، مفرَّقةَ الأجزاء، فألصقتُ أوصالها وجمعتُ أجزاءها، ونشرتها في \"الرسالة\" وما لي فيها إلا الرواية\".ومما يلاحَظ في هذه الأقاصيص أن أكثرها قصير؛ فهي لا تكاد تتجاوز الصفحات العشر طولاً، وكثير منها في حدود الخمس أو الست الصفحات، باستثناء واحدة تُجاوز الثلاثين. هذا من حيث الشكل، أما من حيث المحتوى فيجمع أكثرَها أنها تعالج مشكلات اجتماعية أو أخلاقية. ففي أول قصص الكتاب، \"اليتيمان\"، تصوير مؤثر لواحدة من المشكلات المنتشرة بين الناس: الزوجة الثانية التي تظلم أبناء زوجها -من زوجته السابقة- وتنسى أن في الكون عدلاً وبعد الموت حساباً وفي الآخرة جنة للمحسنين وناراً للظالمين. وفي قصة \"الكأس الأولى\" نتعرف إلى عبد المؤمن أفندي، وهو شرطي بسيط يعمل في مخفر في قرية صغيرة قرب الشام، راتبه الشهري مئة ليرة لا تكاد تكفيه وأسرتَه الصغيرة لضرورات الحياة، فضلاً عن كمالياتها. ثم تأتيه الفرصة ليحصل على راتب مئة شهر في ضربة واحدة، ولكنها كسب محرم وهو لم يمدَّ إلى الحرام يداً طَوال أربعين عاماً، فماذا سيفعل الآن؟وفي: \"طبق الأصل\" و\"من صميم الحياة\" و\"في حديقة الأزبكية\" دعوة ظاهرة إلى الفضيلة وتحذير من أسباب الرذيلة والفاحشة يبلغ أوجَهُ في قصة \"الخادمة\": \"هكذا كان يفكر الأبوان المحترمان. وضُربا بالعمى عن حقيقةٍ لا تخفى على عاقل؛ هي أن الرجل والمرأة حيثما التقيا وكيفما اجتمعا: معلماً وتلميذة، وطبيباً وممرضة، ومديراً وسكرتيرة، وشيخاً ومريدة، فإنهما يبقيان رجلاً وامرأة\"! أما \"قصة أب\" فجرس إنذار يقرعه علي الطنطاوي عالياً يكاد يصمّ الآذان تنبيهاً لمن يدلّل أولاده -من الآباء والأمهات- دلالاً يجاوز الحد فيقود إلى أسوأ العواقب في الدنيا والآخرة.وفي الكتاب \"لوحات\" اجتماعية تاريخية هي أقرب إلى التراث الشعبي فيما تقدمه من أوصاف وصور، منها \"في شارع ناظم باشا\" و\"نهاية الشيخ\" و\"العجوزان\". وفيه قصة من الأدب الرمزي هي \"قصة بردى\" التي تحكي سيرة حياة النهر بأسلوب روائي رمزي كما تُحكى سيرة رجل من الناس.وأخيراً، ففي الكتاب قصتان من الأدب الوطني الصارخ الذي يستنهض الهمم وينفخ الحياة في الأموات: \"جبل النار\" و\"بنات العرب في إسرائيل\". وهذه الأخيرة كان يمكن أن تكون صرخةَ \"وامعتصماه\" جديدةً لو كان في الأمة رجال يسمعون، ولكنها صرخةٌ ضاعت في واد مقفر وصيحةٌ تلاشت في أرضٍ فضاء: \"قالت: وجعلتُ أعدو حافية -وقد سقط الحذاء من رجلي- على التراب والشوك حتى لحقوا بي... لقد أراقت دم عفافها لأن رجال قومها لم يريقوا دماء أجسادهم دفاعاً عن الأرض والعرض\"!إنها قصص من الحياة. ولأنها كذلك، ولأنها تسعى إلى تقويم ما في الحياة من عيوب وعلاج ما فيها من أمراض، فقد اضطر مؤلفها أن يصف العيب أو يجهر بتشخيص \"المرض\" في بعض المواقف، وهو أمرٌ ساءه فاعتذر منه في مقدمة الطبعة الأولى من الكتاب، وفيها يخبرنا أنه تردد طويلاً قبل أن يأذن بنشر هذه القصص، ثم علّل دافعه إلى نشرها في مقدمة الطبعة الأخيرة التي جاء فيها: \"مَن نظر في المرآة فرأى وجهه مصفرّاً ولونه حائلاً فلا يَلُم المرآة على اصفرار وجهه وتحوّل حاله. والأديب مرآة الأمة ولسانها الذي يبدي المكنون في أفئدة أهلها، ولكل أمة مزايا وعيوب، فمَن نبّه إلى عيبٍ فيها استحق الشكر لا العتب والغضب\".",
  "genres": [
    "Nonfiction",
    "Short Stories",
    "Essays",
    "Literature",
    "Islam",
    "History",
    "Sociology"
  ],
  "author": "علي الطنطاوي",
  "average_rating": "4.05",
  "url": "https://www.goodreads.com/book/show/3134553"
}