{
  "title": "The Man Who Hated Work and Loved Labor: The Life and Times of Tony Mazzocchi",
  "description": "A CIA-connected labor union, an assassination attempt, a mysterious car crash, listening devices, and stolen documents--everything you'd expect from the latest thriller. Yet, this was the reality of Tony Mazzocchi, the Rachel Carson of the U.S. workplace; a dynamic labor leader whose legacy lives on in today's workplaces and ongoing alliances between labor activists and environmentalists, and those who believe in the promise of America. In The Man Who Hated Work and Loved The Life and Times of Tony Mazzocchi , author and labor expert Les Leopold recounts the life of the late Oil, Chemical, and Atomic Workers Union leader. Mazzocchi's struggle to address the unconscionable toxic exposure of tens of thousands of workers led to the passage of the Occupational Safety and Health Act and included work alongside nuclear whistleblower Karen Silkwood. His noble, high-profile efforts forever changed working conditions in American industry--and made him enemy number one to a powerful few. As early as the 1950s, when the term \"environment\" was nowhere on the political radar, Mazzocchi learned about nuclear fallout and began integrating environmental concerns into his critique of capitalism and his union work. An early believer in global warming, he believed that the struggle of capital against nature was the irreconcilable contradiction that would force systemic change. Mazzocchi's story of non-stop activism parallels the rise and fall of industrial unionism. From his roots in a pro-FDR, immigrant family in Bensonhurst, Brooklyn, through McCarthyism, the Sixties, and the surge of the environmental movement, Mazzocchi took on Corporate America, the labor establishment and a complacent Democratic Party. This profound biography should be required reading for those who believe in taking risks and making the world a better place. While Mazzocchi's story is so full of peril and deception that it seems almost a work of fiction, Leopold proves that the most provocative and lasting stories in life are those of real people.",
  "genres": [
    "Labor",
    "Biography",
    "History",
    "Politics",
    "Environment",
    "Nonfiction"
  ],
  "author": "Les Leopold",
  "average_rating": "4.30",
  "url": "https://www.goodreads.com/book/show/1194248.The_Man_Who_Hated_Work_and_Loved_Labor"
}