{
  "title": "Geeks: How Two Lost Boys Rode the Internet Out of Idaho",
  "description": "“A story of triumph, friendship, love, and above all, about being human and reaching for dreams in a hard-wired world.”— Seattle Times “Too often, writing about the online world lacks emotional punch, but Katz’s obvious love for his ‘lost boys’ gives his narrative a rich taste.”— The New York Times Book ReviewJesse and Eric were geeks: suspicious of authority figures, proud of their status as outsiders, fervent in their belief in the positive power of technology. High school had been an unbearable experience and their small-town Idaho families had been torn apart by hard times. On the fringe of society, they had almost no social lives and little to look forward to. They spent every spare cent on their computers and every spare moment online. Nobody ever spoke of them, much less for them.But then they met Jon Katz, a roving journalist who suggested that, in the age of geek impresario Bill Gates, Jesse and Eric had marketable skills that could get them out of Idaho and pave the way to a better life. So they bravely set out to conquer Chicago—geek style. Told with Katz’s trademark charm and sparkle,  Geeks  is a humorous, moving tale of triumph over adversity and self-acceptance that delivers two irresistible heroes for the digital age and reveals the very human face of technology. Praise for  Geeks“Ultimately,  Geeks  is not a story about the Internet or computers or techies. It is a story about personal bonds, optimism, access to opportunity, and the courage to dream.” — Salon“An uplifting and hugely compassionate book.” — Philadelphia Inquirer “A story of friendship, optimism, social despair, and an updated version of that American icon, the tinkerer.” — USA Today",
  "genres": [
    "Nonfiction",
    "Technology",
    "Biography",
    "Science",
    "Biography Memoir",
    "Cultural",
    "Adult"
  ],
  "author": "Jon Katz",
  "average_rating": "3.61",
  "url": "https://www.goodreads.com/book/show/313449.Geeks"
}