{
  "title": "The Management Secrets of T. John Dick",
  "description": "He's never wrong-- never makes a mistake. And don't bother him with petty details like what his company actually makes. He's a man of vision, preoccupied with the big picture. And he's a man of supreme confidence in his own abilities, invisible to all but himself. Transferred from corporate HQ in Boston to a newly acquired company in a sleepy North Carolina town, bumbling marketing executive T. John Dick wastes no time in applying his unique management style to his hapless colleagues. But it's not easy being the only true professional in a company full of incompetents. Why will nobody observe his elaborate new Meeting Room Reservation Procedure? Why does the company's biggest customer threaten to set his dogs on him if he ever comes near him again? And why does his arch-rival seem to be winning the race for the company's top job despite T.J.'s obviously superior qualifications? T.J.'s unique management style leads him into a series of hilarious and occasionally fatal mishaps. Who else could inadvertently dispatch the company chairman during a celebration of two million accident free work hours - or lock his successor in the bathroom for hours in a misguided attempt to impress him? Should he have had that plate of shrimps before an important presentation? Why is he discovered naked with a maintenance man during the company's annual sales meeting? And what is that smoke coming from his golf pants? When he's not exasperating his colleagues, or applying his management techniques to his marriage, T. J. lets us in on some of his management secrets -- how to achieve the streamlined desk of an executive with vision, stress management through performance reviews and the important psychological impact of having doughnuts at your meetings. No wonder the book carries a guarantee that it will teach you nothing of any value!",
  "genres": [],
  "author": "Augustus Gump",
  "average_rating": "3.78",
  "url": "https://www.goodreads.com/book/show/3135120-the-management-secrets-of-t-john-dick"
}