{
  "title": "Black Bread: Poems, After the Holocaust",
  "description": "The Holocaust was - and remains - an incomprehensible event in human history. Only through the stories of survivors - the minutest detail, the retelling a single moment of that horrorcan one begin to fathom the enormity of it. Only through fragments of their memories can one dimly comprehend the separations, the indignities, the pain, as well as the courage, caring and life affirming impulses of those who lived and died inside that whirlwind. Many of the poems in this book are based on vignettes that survivors shared with the author, and Greenberg lovingly dedicates this book to them.But this book is not only about survivors' lives and memories. It is also about the life and emotions of an American born Jew, a woman whose awareness of the Holocaust came much after the historical event. Like so many others who grew up on safe shores far distant from the cataclysm, Blu Greenberg was internally transformed by knowledge of the event. She calls it the Holocaust factor, a consciousness that springs autonomously into action, injecting itself into the most ordinary moments of life, interpreting and coloring everyday experience - taking a shower, riding a bus, unexpectedly coming upon a child sitting cross legged on the living room sofa, flying to Winnipeg, eating black bread. The reader, who shares this same range of ordinary experiences, will undoubtedly find great resonance here.Yet there is another level at which these poems can be read. The Holocaust raises the most profound and terrifying questions, unanswerable questions, questions that can barely be asked - about God, spirituality, good and evil in the world, chosenness, tradition and faithfulness, relations between Jews and non-Jews, the efficacy of prayer, and more. The medium of poetry has the ability to evoke thoughts without speaking them. Many of these potent issues are raised in this collection, with subtlety and restraint, and without straying from the personal and the narrative.",
  "genres": [],
  "author": "Blu Greenberg",
  "average_rating": "3.00",
  "url": "https://www.goodreads.com/book/show/313525.Black_Bread"
}