{
  "title": "The Tripods Attack!",
  "description": "Sixteen-year-old Gilbert Chesterton is orphaned and friendless, stuck working a menial job in grimy turn-of-the-century London. Then one night strange lights fill the sky, and a hail of giant meteors crashes into a field outside the city. The next day Gilbert is amazed to find himself hired by a newspaper and rushed out to investigate the scene. Is it a harmless natural phenomenon, or the first wave of a Martian invasion? Gilbert soon learns he s not the only one asking that question, and he's joined by three strangers with their own interest in the fantastic *Herb Wells, journalist for a rival paper. Affable, streetwise, and selfconfident, Herb's only too happy to teach young Gilbert the ways of the world. But when it comes to getting the story (and the fame) he warns it s every man for himself. *An enigmatic bearded man known only as the Doctor. He's suave, cultured, and friendly maybe too friendly. And he knows things about the cosmic visitors. . .things no ordinary man should know. How much he's hiding is anybody's guess. *Father Brown, a short, mild, middle-aged priest with an extraordinary talent for solving mysteries. Gilbert doesn't know much about Christ or the Church, but Father Brown will teach him lessons of faith, love, and courage. The companions fly frantically from danger to danger, battling street thugs from London's underworld and mechanical creatures from another world. As Gilbert is drawn deeper into the threat of the mysterious tripods, he unveils a sinister conspiracy that may hold the key not only to the fate of mankind, but to the accident that took his parents life. And so with only his friends, his wits, and a tattered holy card to help him, Gilbert must race to save the world all the while struggling to reconcile his troubling past with his budding faith in God. The Tripods Attack! is the first volume of the Young Chesterton Chronicles, a delightfully inventive fiction series for teens to adults that re-imagines the famous Catholic author as a young man living in an alternative Edwardian age of steam-driven wonders.",
  "genres": [
    "Science Fiction",
    "Fiction",
    "Catholic",
    "Steampunk",
    "Science Fiction Fantasy",
    "Young Adult"
  ],
  "author": "John McNichol",
  "average_rating": "4.02",
  "url": "https://www.goodreads.com/book/show/3135743-the-tripods-attack"
}