{
  "title": "Prince Albert and the Doomsday Device",
  "description": "KIRKUS (STARRED REVIEW)\"An urchin, a prince and the prince’s guards protect Victorian England from a threat to its monarchy in this debut novel.In a small village in 1851, there are no parents, having been forced to abandon their children by order of the Queen. Jack, the oldest of the children, takes it upon himself to travel to London in search of his father, a metallurgist, like many of the village’s missing residents. The boy’s simple journey to the heart of England becomes a grand adventure, as he eventually must make his way on foot and with no money. Along the way, Jack befriends a French engineer named Jules and makes an unlikely ally in Prince Albert. The prince and the five guards who constitute the PRG (Prince’s Royal Guard) seek a device in the hands of Sir Derek Gilman, the secretary of the army, and his son, Sir Daniel, not fully aware of the clandestine group known as the Prime and its nefarious plot. An abundance of steampunk machinery takes center stage, some of it detailed and some pure enigma, including the device; its true design largely unknown. The PRG and even the prince himself display great strength and unfaltering spirit—one of the guards is Milena, a girl a mere 16 years of age—but Jack shines brightest, with the curiosity of a child and the courage of a giant.Author London’s book seems aimed at young adult readers, but it’s free of condescension and is wholly gratifying rather than stripped of components in an effort to achieve simplicity. The novel concludes by teasing a subsequent book with Prince Albert and Jack, both characters whose return would be most welcome.Lyrically descriptive and unabashedly steampunk; the first of what promises to be a rewarding series of novels.\"ABOUT PRINCE ALBERT and the DOOMSDAY DEVICEJack has been wondering about the disappearance of his father for over a year now. Tucked away in the remote village of Rothchild, all the children have been living on their wits since their parents were carted away by order of the Queen. When a passing stranger entrusts him with stabling his horse for the night, Jack takes the opportunity to ride as fast and far as he can out of town and toward London. His plan is to find his father, but with no money and little knowledge of the world, he finds danger and adventure instead. It doesn't help that the closer he comes to finding his father, the closer he comes to uncovering a ruthless plot to overthrow the monarchy. What begins as a simple journey quickly turns into a swashbuckling adventure of epic proportions as Jack is joined by none other than Prince Albert himself. With the help of the Prince's royal bodyguards and Jack's own scrappy courage, they just might be able to uncover the truth of the plot against the throne, Jack's missing father, and the mysterious Doomsday Device that threatens them all.",
  "genres": [
    "Steampunk",
    "Fantasy",
    "Young Adult"
  ],
  "author": "Clive London",
  "average_rating": "4.04",
  "url": "https://www.goodreads.com/book/show/11942270-prince-albert-and-the-doomsday-device"
}