{
  "title": "On the Edge of the Cliff: Short Stories by V.S. Pritchett",
  "description": "This is an alt. cover edition for ISBN 0394504852.An old (70-ish) man in love with a loving young (25) woman -- jealous when she strays but too fine a fellow to show it. A philanderer's angry wife descending on her hubby's latest paramour. Middle-class couples drifting into adultery . . . No, these aren't novel notions, nor are most of the others in this collection of nine stories -- but V.S. Pritchett hardly needs arresting premises to grab anyone's attention; timeworn situations take on a first-time fascination when lavished with his shrewdly chosen details, his understanding of the little ways in which the mind and heart get out of sync, his seductive shifts from one finely shaded viewpoint to another. The best tales here are the simplest: \"\"The Fig Tree,\"\" which infuses an adulterous triangle with tenderness on all sides -- and with the unforced resonance that comes from everyone's passion for the growing and tending of plants (the wife's lover owns a nursery); and \"\"On the Edge of the Cliff,\"\" that superbly economical study of a May-November romance, wondrous in isolation but tormented whenever the outside world (a grim county fair, for example) intrudes. And Pritchett farce is here too in two stories (as opposed to Pritchett wit, which is never absent): the philanderer's angry wife fastens the right evidence on the wrong mistress (her husband has many); a Vice-Consul in a tropical outpost must deal with accusations re stolen dentures. True, Pritchett's impeccable ease tightens up just slightly when he takes on more schematic designs: there's the slightly overdrawn tale of a retired gent's obsession with the writer who used to live in his villa, and two class-conscious parables -- an elderly gentlewoman's kindness to a common lad, repaid with robbery; the unlikely romance between an anti-intellectual widower-tradesman and his lady-professor nemesis. And one story, \"\"The Worshippers,\"\" almost doesn't work at all, saddling a British-garment-district character study with rather too much socio-psychological baggage, But even when slightly askew, Pritchett is graceful, wise, and cozy; and when he is on target, as he is most often here, the combination of high style and deep thought is incomparable. (Kirkus)",
  "genres": [
    "Short Stories",
    "Fiction"
  ],
  "author": "V.S. Pritchett",
  "average_rating": "3.46",
  "url": "https://www.goodreads.com/book/show/31368393-on-the-edge-of-the-cliff"
}