{
  "title": "The Lincolns: Portrait of a Marriage",
  "description": "The first full-length portrait of the marriage of Abraham and Mary Todd Lincoln in more than fifty years, The Lincolns is a fascinating new work of American history by Daniel Mark Epstein, an award-winning biographer and poet known for his passionate understanding of the Civil War period. Although the private lives of political couples have in our era become front-page news, the true story of this extraordinary and tragic first family has never been fully told. The Lincolns eclipses earlier accounts with riveting new information that makes husband and wife, president and first lady, come alive in all their proud accomplishments and earthy humanity. Epstein gives a fresh close-up view of the couple’s life in Springfield, Illinois (of their twenty-two years of marriage, all but six were spent there). We witness the troubled courtship of an aristocratic and bewitching Southern belle and a struggling young lawyer who concealed his great ambition with self-deprecating humor; the excitement and confusion of the newlyweds as they begin their marriage in a small room above a tavern, and the early signs of Mary’s instability and Lincoln’s moodiness; their joyful creation of a home on the edge of town as Lincoln builds his law practice and makes his first forays into politics. We discover their consuming ambition as Lincoln achieves celebrity status during his famed debates with Stephen A. Douglas, which lead to Lincoln’s election to the presidency. The Lincolns’ ascent to the White House brought both dazzling power and the slow, secret unraveling of the couple’s unique bond. The Lincolns dramatizes certain well-known events with stunning new immediacy: Mary’s shopping sprees, her defrauding of the public treasury to increase her budget, and her jealousy, which made enemies for her and problems for the president. Yet she was also a brilliant hostess who transformed the shabby White House into a social center crucial to the Union’s success. After the death of their little boy, not a year after Lincoln took office, Mary turned for solace to spirit mediums, but her grief drove her to the edge of madness. In the end, there was little left of the Lincolns’ relationship save their enduring devotion to each other and to their surviving children.Written with enormous sweep and striking imagery, The Lincolns is an unforgettable epic set at the center of a crucial American administration. It is also a heartbreaking story of how time and adversity can change people, and of how power corrupts not only morals but affections. Daniel Mark Epstein’s The Lincolns makes two immortal American figures seem as real and human as the rest of us.",
  "genres": [
    "History",
    "Biography",
    "Nonfiction",
    "American History",
    "Civil War",
    "Audiobook",
    "Presidents"
  ],
  "author": "Daniel Mark Epstein",
  "average_rating": "4.04",
  "url": "https://www.goodreads.com/book/show/3136652-the-lincolns"
}