{
  "title": "The Sweetest Sin",
  "description": "THE SWEETEST SIN When the only thing you have left to lose is your heart... Fate has not been kind to Lady Henrietta Harrow. Exiled to the country after a fire killed her parents and left her scarred, Hen’s brother has brought her to London to find a husband and a happy life. Unfortunately, Hen’s scars make her a target for stares and whispers and one lady in particular—Lady Susan St. John—is determined to ruin Hen in retaliation for a believed transgression. Lady Susan’s threats force Hen to make a bold move—she proposes to the very proper Lord Walkerton. Experience has taught the widowed Alexander St. John, Marquess of Rothbury and future Duke of Franklyn that love equals loss. But as the only remaining male heir in the St. John line, Alex must remarry. He needs not only a son but also a woman to curb his daughter’s unruly behavior. This time, however, his marriage will be a business transaction, nothing more. After his first wife’s betrayal, love has no place in his world. When Alex returns to London, his intentions of finding a marriage of convenience are tested as Hen arouses his passions in ways he never imagined possible. As cracks show in Alex’s hard façade, Hen realizes a good man still exists beneath the debris of loss. Soon, Hen and Alex are overcome by desire, but Hen’s proposal to another man and old secrets from the past impede any future happiness. Can Hen and Alex conquer these destructive threats, or will they forever ruin their chance at happiness? The Sins & Scandals Series While there are those who spend their time in modest pursuits, upholding propriety befitting the lords and ladies of the ton, it would seem that for others scandal is just a sin away… #1 AN INVITATION TO SCANDAL #2 A SCANDALOUS PASSION #3 A SINFUL TEMPTATION #4 THE LADY'S SINFUL SECRET #5 SURRENDER TO SCANDAL #6 A SINNER NO MORE #7 THE SWEETEST SIN #8 A MOST SCANDALOUS CHRISTMAS #9 A HINT OF SCANDAL",
  "genres": [
    "Historical Romance",
    "Romance",
    "Regency Romance",
    "Historical"
  ],
  "author": "Kelly Boyce",
  "average_rating": "4.21",
  "url": "https://www.goodreads.com/book/show/31370517-the-sweetest-sin"
}