{
  "title": "The Song of the Stork",
  "description": "‘Stephan Collishaw takes your hand and leads you into a world of tragic beauty, inspiring strength and delicate kindness in the midst of horror’ Aiste DiržiuteFifteen-year-old Yael is on the run. The Jewish girl seeks shelter from the Germans on the farm of the village outcast. Aleksei is mute and solitary, but as the brutal winter advances, he reluctantly takes her in and a delicate relationship develops.As her feelings towards Aleksei change, the war intrudes and Yael is forced to join a Jewish partisan group fighting in the woods.Torn apart and fighting for her life, The Song of the Stork is Yael's story of love, hope and survival. It is the story of one woman finding a voice as the voices around her are extinguished.What Reviewers and Readers Say:'An elegantly crafted, beautifully written novel about love, survival and hope against all the odds- The Song of the Stork is a reading experience to savour.' William Ryan'At once tightly written and suspenseful, Collishaw's historical novel is a darkly compassionate fable of human endurance in absolute extremity' Stevie Davies'The subtle melody of The Song of the Stork caught my soul with its first notes and didn't leave me until the very last ones. Stephen Collishaw takes your hand and leads you into a world of tragic beauty, inspiring strength and delicate kindness in the midst of horror and through this journey he reminds you of the sound of hope.' Aiste Diržiute'A harrowing novel about a Jewish girl abandoned in World War 2 and forced to fend for herself in a landscape crawling with sexual ambiguity and brutal violence. It’s a dark jewel that holds up for examination the proximity of terror and savagery to innocence and love. Yet The Song of The Stork is as much about the future as the past. Stephan Collishaw warns us how the times we live in might end up: with an oafish peasantry drunk on Brexit chasing children through the woods, just because their parents voted Remain.' Guy Kennaway' …a masterly work of condensed fiction that synthesises the art of a great writer with the knowledge of a keen researcher who has become immersed in the first-hand sources of the period… A beautiful book that will go down as one of the classics of the literature of the anti-Nazi partisans in the forests around Vilna during the Holocaust.' David Katz'The prose is sparse and understated and it reminded me at times of The Secret Diary of Anne Frank, which hints at the barbaric events going on in the world without ever displaying them in all their technicolour horror... The writing is hauntingly beautiful and poetic.' Madhouse Family Reviews'It is a refreshing read that is full of so much love and hope... I really loved this book, and is one that I have already been recommending.' The Reading Lodge'There are so many beautiful moments in the story, acts of kindness and small mercies that show human nature at its best... he gets under the skin of his characters and brings them fully to life on the page.' One More Page blog'The Song of the Stork is a beautifully written and poignant novel about a young girl in Poland during the Second World War… a moving read about an awful period in history, which is in fact troublingly relevant in the current political climate.' A View from the Balcony blog'Collishaw has done a fine job of balancing historical reality with the license of fiction, the grim facts of the holocaust with the poignancy of love, and through all it, he manages to offer a sense of optimism.' Words and Leaves blog",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "World War II",
    "Historical",
    "War",
    "Romance",
    "Literary Fiction"
  ],
  "author": "Stephan Collishaw",
  "average_rating": "3.63",
  "url": "https://www.goodreads.com/book/show/31390515-the-song-of-the-stork"
}