{
  "title": "Just Do It: How One Couple Turned Off the TV and Turned On Their Sex Lives for 101 Days",
  "description": "Outside of her family and close friends, Annie had not mentioned the sexathon to anybody, which probably was the best way to go. I, however, had blathered on about the endeavor to anybody with ears. It was the whole Heisman Trophy thing. On this, my first day back in the office after kicking off the sexpedition, my boss blushed when she saw me. Another boss reddened as well. Yet another beheld me, took a few steps back, and asked, “Uh, how’s it going?” He actually circumnavigated me after I answered, like I’d morphed into some hellion driven by fierce, feral loin power . . . I felt stronger. I felt suave. I felt—gasp—Mediterranean. I’d instantly become an objectified sexual That man had sex last night! He is going to do it again tonight! Wow!—From Just Do ItCreeping into middle-age and saddled with work deadlines, child-rearing, homemaking, and fourteen years of togetherness, an ordinary, happy but harried couple set an outlandish to have sex for 101 consecutive days—no excuses (not even the flu, late-night child wanderings, or flat-out exhaustion).What ensued is by turns hilarious, tender, and seductive, including sexual romps in hotels (both cheap and classy), at an ashram, in a basement, atop boulders and unstable easy chairs, but most often in their own bedroom, which they dubbed the “sex den.” As Doug and Annie Brown literally screwed their way through months of a cold Colorado winter, they turned up the heat by attending the Adult Entertainment Expo in Vegas (the Oscars of the porn world); taking Bikram “hot” yoga to get limber; and stocking up on candles, Viagra (just in case), lube, lingerie, and sex toys galore.But besides the awe in their ability to get it on day after day—and actually enjoy it—they were more surprised and touched by how much closer they became, relishing conversations, holding hands, hanging out in hip coffee shops together instead of in the aisles of Target, and firming up (no pun intended) a relationship that already seemed as good as it could get.Seeking out babysitters, getting fit, and dressing up, these two forty-year-olds began courting each other the way they did when they first met in their twenties, only seven moves and two pregnancies later. As Doug Brown lays everything bare—from his triumphs to his tanks (yes to making love on an exercise ball; no to Tantric sex tricks), we get an inside look at the male mind and discover that a good husband and a good dad can also be one hell of a lover.The jolt that every marriage needs and longs for, Just Do It proves that even when it feels like there’s never enough time or energy, trust Annie and Doug...THERE IS.",
  "genres": [
    "Nonfiction",
    "Sexuality",
    "Self Help",
    "Memoir",
    "Reference"
  ],
  "author": "Douglas Brown",
  "average_rating": "3.36",
  "url": "https://www.goodreads.com/book/show/3137987-just-do-it"
}