{
  "title": "Personalities on the Plate: The Lives and Minds of Animals We Eat",
  "description": "In recent years, scientific advances in our understanding of animal minds have led to major changes in how we think about, and treat, animals in zoos and aquariums. The general public, it seems, is slowly coming to understand that animals like apes, elephants, and dolphins have not just brains, but complicated inner and social lives, and that we need to act accordingly. Yet that realization hasn’t yet made its presence felt to any great degree in our most intimate relationship with at the dinner table. Sure, there are vegetarians and vegans all over, but at the same time, meat consumption is up, and meat remains a central part of the culinary and dining experience for the majority of people in the developed world. With Personalities on the Plate , Barbara King asks us to think hard about our meat eating--and how we might reduce it. But this isn’t a polemic intended to convert readers to veganism. What she is interested in is why we’ve not drawn food animals into our concern and just what we do know about the minds and lives of chickens, cows, octopuses, fish, and more. Rooted in the latest science, and built on a mix of firsthand experience (including entomophagy, which, yes, is what you think it is) and close engagement with the work of scientists, farmers, vets, and chefs, Personalities on the Plate is an unforgettable journey through the world of animals we eat. Knowing what we know--and what we may yet learn--what is the proper ethical stance toward eating meat? What are the consequences for the planet? How can we life an ethically and ecologically sound life through our food choices? We could have no better guide to these fascinatingly thorny questions than King, whose deep empathy embraces human and animal alike. Readers will be moved, provoked, and changed by this powerful book.",
  "genres": [
    "Nonfiction",
    "Animals",
    "Science",
    "Food",
    "Vegan",
    "Psychology"
  ],
  "author": "Barbara J. King",
  "average_rating": "3.72",
  "url": "https://www.goodreads.com/book/show/31374500-personalities-on-the-plate"
}