{
  "title": "Junkyard Wisdom: Resisting the Whisper of Wealth in a World of Broken Parts",
  "description": "Junkyard Wisdom is an honest exploration of the tension between wealth and poverty, and between faithfulness and temptation, facing followers of Jesus in the developed world. Roy Goble grew up working in his father's junkyard, where he learned to take apart absolutely anything and to evaluate everything for the value of its parts. Later, as he met with success in the real estate industry, Roy experienced the complexity of creating wealth while pursuing what Jesus was calling him to be and do, beginning a decades-long quest for a way to understand his place in God's kingdom and in a global society. Like Roy, most of us live a life of unprecedented abundance. No matter what our income level, walls of security and distraction inevitably insulate us from the poor or anyone else who might threaten our comfortable life. Yet despite our trappings of wealth-or perhaps because of them-we continue to experience a spiritual hunger for something deeper and more meaningful. In a surprising solution to that hunger, God invites us to utilize our wealth and our talents to create kingdom relationships, beginning right in our own communities. We can only enjoy this meaningful life when we break down the walls and live as Jesus calls us to live. This means more than serving meals in a homeless shelter once a month or even flying to a remote region of the world on a mission trip. Instead, the way of Jesus requires genuine relationships with people who are different than us. Until we stop and remember the poor in all of our decisions, and until we intentionally break down the walls that divide us from those whom Jesus loves, we will never experience the abundance of God's love. In such relationships we will discover an exchange of hope between ourselves and the poor. We are commissioned to be ambassadors for Jesus, beginning where we live and reaching the other side of the planet. Junkyard Wisdom is the story of Roy Goble's response to that commission-from the junkyard to Silicon Valley to house churches in Myanmar to Belizean rainforests-as he searches for ways to build authentic relationships of love, faith, and hope. Here, he reveals what's waiting for us on the other side of comfort and complacency-an abundant future we can only reach together.",
  "genres": [
    "Money"
  ],
  "author": "Roy Goble",
  "average_rating": "4.22",
  "url": "https://www.goodreads.com/book/show/31391082-junkyard-wisdom"
}