{
  "title": "A Kiss for a Dead Film Star and Other Stories",
  "description": "Isaac Rubinstein has no choice but to kill himself.He’s in love with Rudolf Valentino, and now Valentino is dead. His acolytes are committing suicide all over the city. The window to definitively display his devotion is closing, and for once the New York tenement apartment he shares with his mother, his grandmother, and his siblings is quiet. It has to be now. Unless he doesn’t, because his grandmother calls out for him right before the blade touches his skin. Unless he does, and the cuts bleed away his heart’s blood. In Karen M. Vaughn’s romantic and darkly funny melodrama, Isaac Rubinstein does both. Dies, and is united with his beautiful Valentino. Lives, and finds a reason to live. A Kiss for a Dead Film Star is an astonishing debut collection of stories that inspire weird love and uncover surprising caches of eroticism. A museum T-Rex fossil awakens and contemplates his existential crisis. A devoted and loving wife copes with the inevitable loss of her handsome husband with an unusual provenance when he grows scales and a tail before her desperate eyes. A woman at the nadir of a breakup hears a song in a dingy bar and becomes rapturously, gloriously pregnant with a child made from song.  A lemon grove that has sheltered a family of migrant workers reveals their secrets when their small daughter removes her own arm. Polyamory, the cosmos, and the end of the world serve as the angel of death for a wry scientist at the end of her life. Psycho-medical-magical realism intertwines with old and new New York City, epic love stories, and tales best told in the smoky alleys behind bars or beneath the covers. Karen Vaughn’s capacious imagination and remarkable voice glitter—this collection is a comet that comes around rarely.",
  "genres": [],
  "author": "Karen M. Vaughn",
  "average_rating": "4.71",
  "url": "https://www.goodreads.com/book/show/31391358-a-kiss-for-a-dead-film-star-and-other-stories"
}