{
  "title": "Graced 1943",
  "description": "Welcome to Gracestone, the Grace family's luxury estate in Miami Beach, Florida.The year is 1943, and the Grace family members and their friends are enmeshed in World War II. The have special skills, called \"Graces,\" that they use to solve problems.Some Graces are simple. A Navigator never gets lost or needs a map.Others are more remarkable. A Waterwitch, also known as a Frog, can stay under water indefinitely.Graced people gravitate towards one another, and Graces run in families. People who are Graced attract wealth, which is fortunate, because they also attract trouble.The story begins with Annelisa Grace-Betterman, 25, sneaking out of the hospital, where she was recovering from rheumatic fever, to rescue her infant son from kidnappers. She is Graced as Locator, and can find people by listening for their heartbeats.It continues on with no shortage of adventure. The Grace family members want to mind their own business, but they attract trouble in the forms of a serial arsonist, ill-intentioned Time Gypsies, and a race of people called Atherlings who have no consciences and threaten the family's well-being.They also are magnets for those seeking to exploit others. The Grace family produces Midasian Multiplyers, who can Multiply wealth. Any business venture they touch performs beyond anyone's wildest expectations. This makes their family vulnerable to all sorts of crooks, and even politicians seeking to fatten the U. S. federal government's treasury.The presence of Midasian Multiplyers, particularly when the Grace appears in a small child, is dangerous for everyone associated with Gracestone, as the greedy will use loved ones to get to the person who can produce the wealth. Annelisa and her mother realize they must find a way to protect the family when villains present themselves.Throughout the book, they work on this project. The family owns an uncharted private island off the coast of Miami called Cinq Terras. The two women call upon Graced relatives and friends, and a few who know how to use Seminole magic and Louisiana voodoo, to secure Cinq Terras and make it impermeable to intruders.Of course, with the war going on, there are rescue missions galore all over the world: Lima, Leningrad, Berlin. Closer to home, there is heartache. Characters suffer from the aftermath of adultery, the misery of knowing a loved one is lost forever, and the horror of finding out about a child's most painful secret.Still, there are good times. The Grace family loves to celebrate, although they try to keep it low-key, of course, due to the war. The book ends with a Christmas Ball, and the characters learn that when Seers and Russian Protectors advise against having hundreds of people over due to security risks, it might not hurt to listen.Of course, it does not really end there. Graced 1943 is the first book in a series, and it has a cliffhanger ending. The story spills right over into the second book, The Atherlings 1944, due out shortly.",
  "genres": [],
  "author": "Courtney Williamson Milford",
  "average_rating": "3.90",
  "url": "https://www.goodreads.com/book/show/31395841-graced-1943"
}