{
  "title": "المستطرف في كل فن مستظرف",
  "description": "نبذة النيل والفرات:يعد كتاب \"محمد بن أحمد أبي الفتح الأشبيهي\" المستطرف في كل فن مستظرف\" من أهم الكتب التي ألفها الأبشيهي وأوسعها انتشاراً، فهو كتاب ممتع، وسمير مؤنس يشدّك إليه، ويأخذ بمجامع قلبك، فلا تجد سبيلاً للخلاص من رفقته ومعاشرته، لأنه يجمع بين دفتيه ما ينقّي الروح، ويهذّب الأخلاق، ويصقل الفكر والضمير، وكل ما تعلقه النفس وتتمسك به وترتاح إليه.ثم إنّه كتاب موسوعي شامل لأطراف متباينة من فنون الأدب والحكمة والقول، ولا يرتكز إلى موضوع واحد وفكرة محدّدة، إلا أن ذلك لا يعني أنّه كتاب مشتت الأفكار والموضوعات فاقد الصلاة والحلقات، لأن مؤلفه حين وضعه كان يهدف إلى غاية معينة، وهي تنمية الفضائل الإنسانية في النفوس، بعد أن فقدت في عصره الذي عاش فيه كثيراُ من مقدّمات وأسس بنائها بفعل الظروف التي ساعدت على التهتك والمجون والتحلل من القيم الإسلامية الخيرة، فضلاً عن شيوع كثير من العادات والتقاليد التي لا تمت إلى العقيدة السماء بصلة، ولذلك فإن صاحب المستطرف قد حاول بكل جهد أن يجمع ويرتب الكثير مما استهدفه ضمن أبواب شاملة لجوامع الكلم، بحيث نرى الباب يبتدئ إما بذكر آيات من القرآن الكريم تتناسب وموضوعه، ثم يتبعها بأحاديث للرسول صلى الله عليه وسلم ولا تشذ عن مضمونها ويلحق بها بعد ذلك كثيراً من الحكم والقصص والأشعار والنكات الطريفة التي لا تخاف المغزى المقصود من إثباته، والغاية التي يرمي إلى إبرازها من خلاله.وقد خالف المؤلف كثير من التوفيق في أكثر أبوابه، وإن كنا نلمح في بعض الأحيان استطرادات أو تعليقات قد يمجّها الذوق وتنفر منها الطباع لأنها تخرج عن الروح التي يفتتح المؤلف بها أبوابه وموضوعاته إلا أننا نستطيع أن نفسر ذلك ونعيده إلى السمّات الغالبة على أكثر كتاب ذلك العصر، وهي أن الواحد منهم كان يرمي غلى جعل مؤلفه شاملاً يضم أكثر الحقائق والمعلومات بحيث نجده ينقب عنها في نطاقها فينتزعها من مكانها ويحشدها جميعاً منسّقة منمقة ومرتبة تحت رايتها المشتركة وفكرتها الواحدة فتبدوا كلاً مترابط الأجزاء، موثق العرى متماسك الحلقات مسبوكاً في قالب تأليفي منظم، ناطقاً بجهود مؤلفه وبشخصية مزوداً بتسجيلاته الخاصة وآرائه المبتكرة أو نقداته المعلّلة، وما هذه الاستطرادات والتعليقات سوى بعض من هذه الحلقات التي أراد الكاتب من خلالها إضفاء المتعة والهزل بعد الجدّ والرصانة، فهو يهدف من إثباتها بالترويح عن النفس وإبعاد الملل عن القارىء، ولأهمية هذا الكتاب اعتنى الدكتور مفيد محمد قميحة بتحقيق مادة هذا الكتاب وبشرح نصه وبوضع هوامشه وفهرسة المخصص لتبيان أبواب الكتاب المتعددة.",
  "genres": [
    "History",
    "Nonfiction",
    "Religion",
    "Literature",
    "Poetry",
    "Classics",
    "Philosophy"
  ],
  "author": "شهاب الدين محمد بن أحمد الأبشيهي",
  "average_rating": "4.08",
  "url": "https://www.goodreads.com/book/show/3139705"
}