{
  "title": "The Consequences Series Box Set",
  "description": "FIRST TIME EVER - All FIVE Consequences novels together in one set! Aleatha Romig, New York Times bestselling author, took the world by storm with Anthony Rawlings, Claire Nichols, and her acclaimed Consequences Series. It has been branded “as a genre of its own” with “masterful storytelling that will keep you biting your nails and furiously flipping the pages to finally get to the emotional, jaw-dropping conclusion.”For the first time EVER...this box set includes the following FIVE full-length Claire Nichols wakes in an unfamiliar mansion and discovers that she’s at the mercy of billionaire Anthony Rawlings. To the rest of the world he’s charismatic and generous. It doesn’t take Claire long to learn that something more sinister lies beneath his polished façade. As time passes, Claire survives, and her strength penetrates Tony’s veneer, igniting passion where only fear had existed. As the pieces of the puzzle come together, the question becomes clear...Is anything as it appears? After enduring Anthony Rawlings’ vendetta, Claire is faced with the consequences of her new freedom. With the help of old and new friends, she strategizes to rebuild her life and learn the truth of the past. Secrets are revealed, true foes are exposed, and Tony admits his true feelings. Claire must decide who she believes—who is telling the TRUTH? Facing her oldest fear, Claire learns the true meaning of isolation. Who can rescue her from this nightmare? Tony? Harry? Phil? Or perhaps a more unlikely savior? Will it happen in time, or will the consequences of the revealed truths be more than she or anyone can handle? As the cards are played, who will win the game? THE MISSING YEARS The complete showing of the missing years as told by Tony, Phil, Harry, John, and Brent. Experience Tony's consequences for his role in the past.This is NOT a companion, but a full length novel.BEYOND THE The consequences have been paid, dearly by some. Enjoy a look into the future of the Rawlings world.**This box set is a significant savings over buying Consequences, Truth, Convicted, Revealed, and Beyond the Consequences individually.***The Behind His Eyes Companions are not included in the box set. It contains the FIVE full length novels. Enjoy the Consequences!",
  "genres": [
    "Dark",
    "Mystery Thriller",
    "BDSM",
    "Romance",
    "Mystery",
    "M F Romance",
    "Erotica"
  ],
  "author": "Aleatha Romig",
  "average_rating": "4.40",
  "url": "https://www.goodreads.com/book/show/31393846-the-consequences-series-box-set"
}