{
  "title": "Sirens and Other Daemon Lovers: Magical Tales of Love and Seduction",
  "description": "A stunning anthology of sensuous short fiction and magical erotica explores the seductive world of mysterious, mythic sirens--men and women--who draw readers into a forbidden zone of fantasy and desire, in works by Jane Yolen, Joyce Carol Oates, Michael Swanwick, Tanith Lee, and other outstanding writersA Wife of Acorn, Leaf, and Rain • (1998) • short story by Dave SmedsAshes on Her Lips • (1998) • short story by Edward BryantAttachments • (1998) • short story by Pat MurphyBird Count • (1998) • short story by Jane YolenBroke Heart Blues • (1998) • short story by Joyce Carol OatesHeat • (1998) • poem by Melissa Lee ShawIn the Season of Rains • (1998) • novelette by Ellen SteiberIntroduction (Sirens and Other Daemon Lovers) • (1998) • essay by Terri WindlingMidnight Express • (1998) • short story by Michael SwanwickMirrors • (1998) • short story by Garry KilworthMy Lady of the Hearth • (1998) • short story by Storm ConstantineNo Human Hands to Touch • (1998) • short story by Elizabeth E. WeinO for a Fiery Gloom and Thee • (1998) • short story by Brian StablefordPersephone or, Why the Winters Seem to Be Getting Longer • (1998) • short fiction by Wendy FroudPrivate Words • (1998) • novelette by Mark W. TiedemannTaking Loup • (1998) • short story by Bruce GlasscoTastings • (1998) • short story by Neil GaimanThe Eye of the Storm • (1998) • novelette by Kelley EskridgeThe Faerie Cony-Catcher • (1998) • short story by Delia ShermanThe House of Nine Doors • (1998) • short story by Ellen KushnerThe Light That Passes Through You • (1998) • short story by Conrad WilliamsThe Sweet of Bitter Bark and Burning Clove • (1998) • novelette by Doris EganWolfed • (1998) • short story by Tanith Lee",
  "genres": [
    "Fantasy",
    "Short Stories",
    "Anthologies",
    "Erotica",
    "Romance",
    "Horror",
    "Paranormal"
  ],
  "author": "Ellen Datlow",
  "average_rating": "3.60",
  "url": "https://www.goodreads.com/book/show/314258.Sirens_and_Other_Daemon_Lovers"
}