{
  "title": "Keeping the Beat",
  "description": "It was supposed to be the best summer of her life. Instead, seventeen-year-old Lucy finds her best friend, Harper, shot dead in an LA swimming pool. How did things ever go so wrong? The story circles back to trace the steps that led to this disaster.Only Harper McKenzie could have taken five girls from their school and reinvented them as Crush, the top prospect to win the international talent contest Project Next. As soon as the band finds its footing, it scores a huge win in the UK semifinal. Next stop, LA! The girls will spend a luxurious summer in Hollywood, living as reality TV stars while they prepare for their performance in the Project Next final. With a mansion to themselves, they’re the toast of the town … living every girl’s dream come true. It’s way too late when Lucy discovers that Harper’s heart has never been in Project Next at all. Joining the competition was just part of Harper’s elaborate ruse to reconnect with her no-good ex-boyfriend. Harper will risk anything — from her friendships to the band’s reputation — to get him back. Meanwhile, the other members of Crush are throwing themselves headfirst into sex, drugs and rock and roll. With the band in crisis and the final approaching, Lucy must decide whether she wants to play to Harper’s beat or set the rhythm for the rest of the band. This fast-paced story takes unexpected twists, unraveling the mystery of Harper’s murder and exploring the complicated relationships among members of the band. Writing team Marie Powell and Jeff Norton — with many years in the entertainment business between them — deliver one-part wish fulfillment and one-part cautionary tale as they go behind the scenes to reveal what no one sees on “reality” TV.",
  "genres": [
    "Young Adult",
    "Music",
    "Fiction",
    "Realistic Fiction",
    "Contemporary",
    "Romance",
    "Friendship"
  ],
  "author": "Bridget Tyler",
  "average_rating": "3.71",
  "url": "https://www.goodreads.com/book/show/31423682-keeping-the-beat"
}