{
  "title": "How Does It Feel to Be a Problem?: Being Young and Arab in America",
  "description": "The story of how young Arab and Muslim Americans are forging lives for themselves in a country that often mistakes them for the enemyArab and Muslim Americans are the new, largely undiscussed “problem” of American society, their lives no better understood than those of African Americans a century ago. Under the cover of the terrorist attacks, the wars in Afghanistan and Iraq, and the explosion of political violence around the world, a fundamental misunderstanding of the Arab and Muslim American communities has been allowed to fester and even to define the lives of the seven twentysomething men and women whom we meet in this book. Their names are Rami, Sami, Akram, Lina, Yasmin, Omar, and Rasha, and they all live in Brooklyn, New York, which is home to the largest number of Arab Americans in the United States.We meet Sami, an Arab American Christian, who navigates the minefield of associations the public has of Arabs as well as the expectations that Muslim Arab Americans have of him as a marine who fought in the Iraq war. And Rasha, who, along with her parents, sister, and brothers, was detained by the FBI in a New Jersey jail in early 2002. Without explanation, she and her family were released several months later. As drama of all kinds swirls around them, these young men and women strive for the very things the majority of young adults desire: opportunity, marriage, happiness, and the chance to fulfill their potential. But what they have now are lives that are less certain, and more difficult, than they ever could have imagined: workplace discrimination, warfare in their countries of origin, government surveillance, the disappearance of friends or family, threats of vigilante violence, and a host of other problems that thrive in the age of terror.And yet How Does It Feel to Be a Problem? takes the raw material of their struggle and weaves it into an unforgettable, and very American, story of promise and hope. In prose that is at once blunt and lyrical, Moustafa Bayoumi allows us to see the world as these men and women do, revealing a set of characters and a place that indelibly change the way we see the turbulent past and yet still hopeful future of this country.",
  "genres": [
    "Nonfiction",
    "Race",
    "Anti Racist",
    "Politics",
    "Social Justice",
    "Sociology",
    "Religion"
  ],
  "author": "Moustafa Bayoumi",
  "average_rating": "3.95",
  "url": "https://www.goodreads.com/book/show/3142153-how-does-it-feel-to-be-a-problem"
}