{
  "title": "Against Therapy",
  "description": "Zablode psihoterapije (1988) predstavljajo eno najodmevnejših del J. M. Massona, zgodovinarja in nekdanjega psihoanalitika, ki je s svojimi deli o psihoterapiji in njenih začetnikih zbudil izjemen javni in strokovni odziv. S to kontroverzno knjigo je Masson zamajal temelje moderne psihoterapije, lotil se je tako Freuda kot Junga, odločno pa je izpodbijal tudi Perslove in Rodgersove terapevtske metode. Kot projektni direktor Arhivov Sigmunda Freuda je imel dostop do vse dokumentacije tega intrigantnega dunajskega terapevta, z izsledki zgodovinskih zapisov pa je razkril številne nepravilnosti celotne psihoterapevtske stroke. Zavzeto in jasno poziva strokovnjake in laike k prepoznavanju napak in h kritičnemu odnosu do psihoterapevtskih metod, ki v svoji osnovi hočejo spreminjati človeka. Angažirano razmišlja o številnih zlorabah pacientov, ki nastanejo kot posledica neizogibne premoči terapevtov nad nemočnimi žrtvami in na podlagi analiz dokazuje, da je psihoterapija v svojem bistvu škodljiva in da so skoraj vse njene oblike potencialno nezdrave. Z uvodom priznane britanske psihologinje Dorothy Rowe in v slovenskem primeru dodanim zaključkom dveh domačih strokovnjakov, dr. Perka in dr. Ruglja, knjiga kar kliče k »spremembi mišljenja« in v svojem izvirniku velja za enega temeljnih dokumentov o zgodovini psihoterapije, zaradi česar je njen prevod izjemen doprinos k slovenskemu družboslovju in humanistiki.S to kontroverzno knjigo je J. M. Masson, profesor sanskrta in nekdanji psihoanalitik, zamajal temelje moderne psihoterapije. Odločno se je lotil tako Freudovega dela kot Junga, resno pa je izpodbijal tudi Perlsove in Rogersove terapevtske metode. Kot dolgoletni projektni direktor Arhivov Sigmunda Freuda je imel dostop do vse dokumentacije tega dunajskega terapevta, z izsledki zgodovinskih zapisov pa je razkril številne nepravilnosti celotne psihoterapevtske stroke. V knjigi zavzeto poziva strokovnjake in laike k prepoznavanju napak in kritičnemu odnosu do psihoterapevtskih metod, ki v svoji osnovi hočejo spreminjati človeka. Angažirano razmišlja o številnih zlorabah pacientov, ki nastanejo kot posledica neizogibne premoči terapevtov nad nemočnimi žrtvami, in na podlagi analiz dokazuje, da je psihoterapija v svojem bistvu škodljiva in da so skoraj vse njene oblike potencialno nezdrave. Z daljšim uvodom priznane britanske psihologinje Dorothy Rowe in v slovenski izdaji dodanim zaključkom dveh domačih ­strokovnjakov, dr. Perka in dr. Ruglja, knjiga kar kliče k »spremembi mišljenja« in v svojem izvirniku velja za enega temeljnih dokumentov o zgodovini psihoterapije, zaradi česar je njen prevod izjemen prispevek k slovenskemu družboslovju in humanistiki.Renate Štrucl",
  "genres": [
    "Psychology",
    "Nonfiction",
    "Counselling",
    "Psychiatry"
  ],
  "author": "Jeffrey Moussaieff Masson",
  "average_rating": "3.88",
  "url": "https://www.goodreads.com/book/show/314238.Against_Therapy"
}