{
  "title": "Joan of Arc and the Hundred Years War",
  "description": "When in Henry II of England married Eleanor of Aquitaine of France in 1154 A.D., he became at once the reigning sovereign over a vast stretch of land extending across all of England and half of France―and yet, according to the feudal hierarchy of the times, a vassal to the King of France. This situation, which placed French and English borders in such a tenuous position, solidified the precarious ground on which the Hundred Years War was to be fought 183 years later. This epic border conflict―which was contemporaneous with the age of popular uprisings and the Bubonic Plague, fought according to enduring notions of chivalry and the budding pride of nationality, and which numbered among its participants Richard II, the Black Prince of Wales, Henry IV, Henry V, and Charles of Navarre―ultimately depended upon a peasant woman, Joan of Arc, to reinforce the French ideal of a sacred kingdom, swing the pendulum once more in the direction of the French, and bring this perennial conflict to an end.When in 1154 A.D. Henry II of England married Eleanor of Aquitaine of France, he became at once the reigning sovereign over a vast stretch of land extending across all of England and half of France, and yet, according to the feudal hierarchy of the times, a vassal to the King of France. This situation, which placed French and English borders in such a tenuous position, solidified the precarious ground on which the Hundred Years War was to be fought 183 years later. This epic border conflict―which was contemporaneous with the age of popular uprisings and the Bubonic Plague, fought according to enduring notions of chivalry and the budding pride of nationality, and which numbered among its participants Richard II, the Black Prince of Wales, Henry IV, Henry V, and Charles of Navarre―ultimately depended upon a peasant woman, Joan of Arc, to reinforce the French ideal of a sacred kingdom, swing the pendulum once more in the direction of the French, and bring this perennial conflict to an end.Topics of the theme essays have been selected to show the diversity of this complex war, and include discussions the origins of the war; the age of popular rebellion; chivalry's effect on 14th and 15th century warfare; the religion of the monarchy and the role of sacred kingship in the building of the French monarchy; and Joan of Arc's understanding of the war. An annotated timeline and a chronology of French and English Kings provide readers with an easy-to-follow overview of the Hundred Years War and the rulers who presided over it. Nineteen biographical sketches of key French and English figures lend a human aspect to historic names; and 14 annotated primary documents breathe fresh life into the topic, and provide students and readers with a new look at the period. The book concludes with an annotated bibliography and index.",
  "genres": [
    "History",
    "Nonfiction",
    "War"
  ],
  "author": "Deborah A. Fraioli",
  "average_rating": "2.91",
  "url": "https://www.goodreads.com/book/show/314204.Joan_of_Arc_and_the_Hundred_Years_War"
}