{
  "title": "The Head That Wears The Crown",
  "description": "\"The Head That Wears The Crown\" is the gritty story of Darius King –― a 23 year old CEO from the tough streets of Atlanta –― who finds himself in an all-out war to save everything and everyone that belongs to him, while also discovering the truth about his past.   Darius became a millionaire overnight when he was only eighteen years old. After his highly successful father, whom he never had the opportunity to know, passed away, Darius found out that he was left a multi-million dollar investment firm in his father's will. From that day forward Darius was groomed by those who helped his father build the company to take over as the legitimate CEO of Kingdom Enterprises, the way that his father intended. But there are many vultures who intend to take his father's fortune, and they will get Darius out of the picture by any means necessary.  His personal life proves to be just as hectic as Darius finds himself torn between three women. Kenya was his high school sweetheart and he has continued to see her on and off over the years. Darius has no desire for a committed relationship, that is until he meets Natalie. Natalie is beautiful, intelligent, sophisticated, and everything that he would want in a woman. But getting her to see him in a positive light seems to be harder than expected in the beginning. Then there’s Juanita, his personal assistant who has been trying to seduce him for the past five years. In spite of being warned of the consequences of mixing business with pleasure, Darius is finding it virtually impossible to resist Juanita’s sensuality and provocative ways.  Darius solicits the help of the streets as his business and personal life clash in the midst of a war that is meant to destroy him for good. He struggles to know who he can and cannot trust as everyone appears to have a hidden motive behind why they want to be connected to him. Among those with intentions of bringing him to his knees is his half-brother whom Darius never knew existed. Darius is finally beginning to see just how weighty the crown is, and he eventually realizes that the plot to take him out reaches even further than he could have ever imagined.",
  "genres": [],
  "author": "D.D. Bridges",
  "average_rating": "4.42",
  "url": "https://www.goodreads.com/book/show/31429677-the-head-that-wears-the-crown"
}