{
  "title": "Black Boy",
  "description": "A special 75th anniversary edition of Richard Wright's powerful and unforgettable memoir, with a new foreword by John Edgar Wideman and an afterword by Malcolm Wright, the author’s grandson. When it exploded onto the literary scene in 1945, Black Boy was both praised and condemned. Orville Prescott of the New York Times wrote that “if enough such books are written, if enough millions of people read them maybe, someday, in the fullness of time, there will be a greater understanding and a more true democracy.” Yet from 1975 to 1978, Black Boy was banned in schools throughout the United States for “obscenity” and “instigating hatred between the races.” Wright’s once controversial, now celebrated autobiography measures the raw brutality of the Jim Crow South against the sheer desperate will it took to survive as a black boy. Enduring poverty, hunger, fear, abuse, and hatred while growing up in the woods of Mississippi, Wright lied, stole, and raged at those around him—whites indifferent, pitying, or cruel and blacks resentful of anyone trying to rise above their circumstances. Desperate for a different way of life, he may his way north, eventually arriving in Chicago, where he forged a new path and began his career as a writer. At the end of Black Boy , Wright sits poised with pencil in hand, determined to “hurl words into this darkness and wait for an echo.” Seventy-five year later, his words continue to reverberate. “To read Black Boy is to stare into the heart of darkness,” John Edgar Wideman writes in his foreword. “Not the dark heart Conrad searched for in Congo jungles but the beating heart I bear.” One of the great American memoirs, Wright’s account is a poignant record of struggle and endurance—a seminal literary work that illuminates our own time.",
  "genres": [
    "Classics",
    "Nonfiction",
    "Memoir",
    "Biography",
    "African American",
    "Race",
    "Autobiography"
  ],
  "author": "Richard Wright",
  "average_rating": "4.09",
  "url": "https://www.goodreads.com/book/show/31437.Black_Boy"
}