{
  "title": "Defiance",
  "description": "HER ONLY CHOICE IS TO CHANGE HER WORLD…\n\nSalryc Luxx has come a long way in just four years, from slave to conscript, to elite Black Blade assassin, rising rapidly as her extraordinary abilities are revealed. Promoted to lieutenant after capturing a valuable shipment of metals and laying waste to the invading force, she and Cyno, her partner (in war and love), have been entrusted with a dangerous mission: to assassinate the King of Anglia and the five nobles in line for the throne, leaving the path to ascension clear for their own leader.That’s one side of the story. The other is that she and Cyno have been assigned this suicide mission as Parliament’s first pass at removing the iliri taint from the military. Either way, without the strength of allies, the Conglomerate of Free Citizens cannot turn back the invaders, whose goal is to wipe out the whole iliri species, so Sal and Cyno are the only hope of ending the continental war devastating their species. Traveling for months, they are so far away from their home base that they’re beyond the mental link that connects the pack. They remain committed to their mission—and to each other, but… unhappily disturbed. They can only hope their separation from the pack bring them closer together. But the danger is, in the absence of the pack, their bond will wither.A kind deed, helping what they take to be a wounded animal, leads to the discovery of their true nature, to strengthening and re-energizing their pack, and to a surprising alliance that offers hope for the future. The wounded animal, they learn, is a graour wolf, a species of ferocious warriors with language and traits nearly identical to iliri. When two of them ask to join her pack, Sal recruits them as Black Blades and the iliri are no longer the only dog in the fight for iliri freedom.But Anglia is nothing like the Conglomerate of Free Citizens. Anglians discriminate based on gender, not species. Iliri are thought to be just a myth--until Sal shows her face. To convince the king and his council that yes, a woman really can be a soldier, she's going to have to make her own rules. The enemy is moving. She doesn't have time to deal with outdated court manners.\nAs the defiance of an entire species rises up in her, she really has no choice—she’ll just have to change the world.\n\nWomen readers will thrill to the reverse harem idea that pushes the boundaries of epic fantasy in this second world series that may remind some of Avatar without the scary beasts; or even Game Of Thrones, but happier, with more color—and a dazzling female protagonist. Fans of Anne McCaffrey’s Dragonriders of Pern will find Sal’s planet Ogun a thrilling destination for their next fantasy fix.\nLike all the books on this series, Defiance is a complete novel, not a cliffhanger. And because the illiri have insatiable and exotic sexual instincts, the smoking hot sex may make it unsuitable for humans under 18.",
  "genres": [
    "Reverse Harem",
    "Fantasy",
    "Romance",
    "Science Fiction",
    "Paranormal",
    "Military Fiction",
    "Aliens"
  ],
  "author": "Auryn Hadley",
  "average_rating": "4.60",
  "url": "https://www.goodreads.com/book/show/31441927-defiance"
}