{
  "title": "Wishing You Were Here",
  "description": "WISHING YOU WERE HERE Deluxe Edition contains the young adult time travel novel WISHING YOU WERE HERE (Soul Mates, Book 1) , PLUS the sequel, LOST WITHOUT YOU , a young adult historical romance novella.WISHING YOU WERE HEREFinalist for the Romantic Writers of America Golden Heart® Award in Young Adult Romance.She's out of place.He's out of time.When an accidental wish sends a college bound radio intern back in time to 1957 to save a teen idol from death, she finds her well-intentioned meddling just may leave him better off dead.Callie Reinard thought rock music pioneer Joey Tempo deserved a chance to show the world he was more than a footnote in music history, but her attempt to give him a new future causes one catastrophe after another. The worst disaster of all -- she's falling for this charismatic musician, who's fifty years out of her league, and at risk of losing her own carefully-planned future in the process.LOST WITHOUT YOU, a Soul Mates NovellaLOST WITHOUT YOU picks up where events left off back in 1957 in the small town of Shelby Falls at the end of WISHING YOU WERE HERE, and follows Sable Courtney as she mourns the loss of her fiancé and tries to build a new life for herself.Locked into a Future She Didn't Want...Fighting for the One She Deserves...Joey Tempo's fiancée Sable Courtney thinks her world has just ended with his fatal plane crash, but around the corner, waiting to be discovered, is the future she was destined to have all along.Watch Sable as she breaks free of the role she's been forced to play since childhood--that of a meek, obedient female expected to marry well and rear children--and finds the courage to forge a new path for herself, on her own terms. And she just might find her true soul mate along the way.WISHING YOU WERE HERE and LOST WITHOUT YOU are sweet young adult romances, appropriate for ages 12 and up.",
  "genres": [
    "Time Travel",
    "Romance",
    "Young Adult",
    "Historical Fiction",
    "Fiction",
    "Young Adult Romance",
    "Music"
  ],
  "author": "Catherine Chant",
  "average_rating": "3.92",
  "url": "https://www.goodreads.com/book/show/31441788-wishing-you-were-here"
}