{
  "title": "The Vanquished: Why the First World War Failed to End, 1917-1923",
  "description": "'This war is not the end but the beginning of violence. It is the forge in which the world will be hammered into new borders and new communities. New molds want to be filled with blood, and power will be wielded with a hard fist.' Ernst Jünger (191\n\n8)\n\nFor the Western allies 11 November 1918 has always been a solemn date - the end of fighting which had destroyed a generation, and also a vindication of a terrible sacrifice with the total collapse of their principal enemies: the German Empire, Austria-Hungary and the Ottoman Empire. But for much of the rest of Europe this was a day with no meaning, as a continuing, nightmarish series of conflicts engulfed country after country. In this highly original, gripping book Robert Gerwarth asks us to think again about the true legacy of the First World War. In large part it was not the fighting on the Western front which proved so ruinous to Europe's future, but the devastating aftermath, as countries on both sides of the original conflict were wrecked by revolution, pogroms, mass expulsions and further major military clashes. If the War itself had in most places been a struggle purely between state-backed soldiers, these new conflicts were mainly about civilians and paramilitaries, and millions of people died across central, eastern, and south-eastern Europe before the USSR and a series of rickety and exhausted small new states came into being.  Everywhere there were vengeful people, their lives racked by a murderous sense of injustice, and looking for the opportunity to take retribution against enemies real and imaginary. Only a decade later, the rise of the Third Reich and other totalitarian states provided them with the opportunity they had been looking for.",
  "genres": [
    "History",
    "Nonfiction",
    "World War I",
    "War",
    "European History",
    "Politics",
    "Military History"
  ],
  "author": "Robert Gerwarth",
  "average_rating": "4.17",
  "url": "https://www.goodreads.com/book/show/31439610-the-vanquished"
}