{
  "title": "Lincoln's Greatest Journey: Sixteen Days that Changed a Presidency, March 24–April 8, 1865",
  "description": "From a New York Times-bestselling author, \"a vivid account of Lincoln's sixteen days at the front in Virginia\" (James McPherson, Pulitzer Prize-winning author of Battle Cry of Freedom).March 1865: The United States was at a crossroads and, truth be told, Abraham Lincoln was a sick man. I am very unwell, he confided to a close acquaintance. A vast and terrible civil war was winding down, leaving momentous questions for a war-weary president to address. A timely invitation from Gen. Ulysses S. Grant provided the impetus for an escape to City Point, Virginia, a journey from which Abraham Lincoln drew much more than he ever expected. This book offers the first comprehensive account of a momentous time in his presidency.Lincoln made the trip to escape the constant interruptions in the capital that were draining his vitality, and to make his personal amends for presiding over the most destructive war in American history in order to save the nation. Lincoln returned to Washington sixteen days later with a renewed sense of purpose, urgency, and direction that would fundamentally shape his second-term agenda.This was his longest break from the White House since he had taken office, and until now little has been known about it. Lincoln's Greatest Journey represents the most extensively researched and detailed story of these decisive sixteen days at City Point, in a narrative laden with many previously unpublished accounts that fill in gaps and clear up misconceptions. A fresh, more complete picture of Lincoln emerges, set against a dramatically new narrative of what really happened during those last weeks of his life.",
  "genres": [
    "History",
    "Civil War",
    "Nonfiction",
    "American Civil War",
    "American History",
    "Biography",
    "Presidents"
  ],
  "author": "Noah Andre Trudeau",
  "average_rating": "4.27",
  "url": "https://www.goodreads.com/book/show/31448527-lincoln-s-greatest-journey"
}