{
  "title": "Shattered",
  "description": "Over a span of twenty years, four boys have been kidnapped from their bedrooms, suffocated, and buried nearby in a shallow grave. Serial killer or coincidence?That’s the question investigative reporter Maxine Revere sets out to answer when an old friend begs her to help exonerate his wife, who has been charged with their son’s recent murder. But Max can do little to help because the police and D.A. won’t talk to her—they think they have the right woman. Instead, Max turns her attention to three similar cold cases. If she can solve them, she might be able to help her friend.Justin Stanton was killed twenty years ago, and his father wants closure—so he is willing to help Max with her investigation on one condition: that she work with his former sister-in-law— Justin’s aunt, FBI Agent Lucy Kincaid. Trouble is, Max works alone, and she’s livid that her only access to the case files, lead detective and witnesses depends on her partnering with a federal agent on vacation. She wants the career-making story almost as much as the truth—but if she gets this wrong, she could lose everything.Haunted by Justin’s death for years, Lucy yearns to give her family—and herself—the closure they need. More important, she wants to catch a killer. Lucy finds Max’s theory on all three cases compelling—with Max's research added to Lucy’s training and experience, Lucy believes they can find the killer so justice can finally be served. But the very private Lucy doesn’t trust the reporter any more than Max trusts her.Max and Lucy must find a way to work together to untangle lies, misinformation, and evidence to develop a profile of the killer. But the biggest question is: why were these boys targeted? As they team up to find out what really happened the night Justin was killed, they make a shocking discovery: Justin’s killer is still out there … stalking another victim … and they already may be too late.",
  "genres": [
    "Mystery",
    "Suspense",
    "Thriller",
    "Fiction",
    "Crime",
    "Audiobook",
    "Mystery Thriller"
  ],
  "author": "Allison Brennan",
  "average_rating": "4.28",
  "url": "https://www.goodreads.com/book/show/31450644-shattered"
}