{
  "title": "El salvaje",
  "description": "\"Y sí, la muerte irrumpió en mi vida y la devastó. Pero estuve resuelto a no permitir que me remolcara con ella.\" Esta ambiciosa novela confirma a Arriaga como uno de los escritores más potentes, intensos y originales de la literatura contemporánea.A sus diecisiete años Juan Guillermo se ha quedado huérfano y completamente solo. Tres años atrás, Carlos, su hermano mayor, ha sido asesinado por unos fanáticos religiosos; abatidos por el pesar, sus padres y su abuela mueren. En el extremo de la rabia y la desesperación, Juan Guillermo jura vengarse. El problema es que los jóvenes religiosos están muy bien organizados, gozan del respaldo de gente poderosa, portan armas, han entrenado artes marciales y, para colmo, están coludidos con Zurita, un comandante de la policía judicial. Con esta permanente sensación de vendetta convive una entrañable historia de amor que impide que el protagonista se deslice hacia el vórtice de la autodestrucción.En paralelo corre la historia de Amaruq, un hombre que en los helados bosques del Yukón se obsesiona en perseguir a un lobo y cuya travesía lo conduce hacia las profundidades de la locura y la muerte.ENGLISH DESCRIPTIONJuan Guillermo is a teenager who in a matter of a few months looses his brother Carlos, his grandmother, and his parents. The culprits are a group of fundamentalist Catholics that are convinced that is their purpose in life, to rid the world of society's scum. They are conspiring with Captain Zurita who was upset with Carlos for not giving him a share of the earnings from his illegal businesses.So, they drowned him, and once his parents returned all they found was a casket. But Juan Guillermo decides to take vengeance...",
  "genres": [
    "Fiction",
    "Thriller",
    "Novels",
    "Book Club",
    "Drama",
    "Historical Fiction",
    "Literature"
  ],
  "author": "Guillermo Arriaga",
  "average_rating": "4.43",
  "url": "https://www.goodreads.com/book/show/31447858-el-salvaje"
}