{
  "title": "Becoming Cliterate: Why Orgasm Equality Matters—And How to Get It",
  "description": "We’ve been thinking about sex all wrong. Mainstream media, movies, and porn have taught us that sex = penis + vagina, and everything else is just secondary. Standard penetration is how men most reliably achieve orgasm. The problem is, women don’t orgasm this way. We’ve separated our most reliable route to orgasm—clitoral stimulation—from how we feel we should orgasm—penetration. As a result, we’ve created a pleasure gap between women and men:50% of 18-35-year-old women say they have trouble reaching orgasm with a partner64% of women vs 91% of men said they had an orgasm at their last sexual encounter55% of men vs. 4% of women say they usually reach orgasm during first-time hookup sexIn Becoming Cliterate, psychology professor and human sexuality expert Dr. Laurie Mintz exposes the broader cultural problem that’s perpetuating this gap, and what we can do about it. Pulling together evidence from biology, sociology, linguistics, and sex therapy into one comprehensive, accessible, and prescriptive book, Becoming Cliterate features:Cultural & historical analysis of female orgasm (spoiler: the problem’s been going on for ages)An anatomy section (it’s all custom under the hood)Proven techniques for cliterate sex (it starts with training the sex organ between your ears)A comprehensive final chapter for men (because you don’t have to have a clitoris to be cliterate)By dispelling the lies, misunderstandings, and myths that have been holding us back, Becoming Cliterate tackles both personal and political problems and replaces them with updated outlooks and practical skills needed to change our collective perspective on sex. It’s time to finally inform women and men on how to have satisfying experiences in bed that benefit both parties.The revolution is cuming—and Becoming Cliterate offers a radical, simple solution to progress and pleasure for all.",
  "genres": [
    "Nonfiction",
    "Sexuality",
    "Feminism",
    "Self Help",
    "Health",
    "Psychology",
    "Relationships"
  ],
  "author": "Laurie Mintz",
  "average_rating": "4.27",
  "url": "https://www.goodreads.com/book/show/31448995-becoming-cliterate"
}