{
  "title": "In the Country of the Blind",
  "description": "Michael Flynn has won widespread acclaim for his Firestar series - Harry Turtledove \"As Robert A. Heinlein did and all too few have done since, Michael Flynn writes about the near future as if he'd been there and was bringing back reports of what he'd seen.\" But Flynn doesn't need the flash of futurity to write an exciting story, as he demonstrated in this, his first novel.Set primarily in the present, with tantalizing flashbacks to the 1800s, In the Country of the Blind concerns a small group of American idealists who manage to actually build the Analytical Engine designed by Charles Babbage and use it to develop mathematical models that could chart the likely course of the future. When their calculations predicted a united Germany armed with unimaginably powerful bombs by 1939, the Charles Babbage Society kept it from ever happening. Soon they were working to alter history's course to their own liking in other ways. By the 1990s the Society has become the secret master of the world. But no secret can be kept forever, at least not without drastic measures. When her plans for some historic real estate lead developer and ex-reporter Sarah Beaumont to stumble across the Society's existence, it is just the first step into a baffling and deadly maze of conspiracies.Originally published in the 1980s as a paperback original, In the Country of the Blind has been revised and updated for this new edition and now includes Flynn's article from Analog , \"An Introduction to Cliology,\" about the ideas underlying the book. We are pleased to bring it to hardcover for the first time for those who have discovered his work in the years since its first appearance in print.",
  "genres": [
    "Science Fiction",
    "Fiction",
    "Alternate History",
    "Thriller",
    "Fantasy",
    "Steampunk",
    "Mystery"
  ],
  "author": "Michael Flynn",
  "average_rating": "3.53",
  "url": "https://www.goodreads.com/book/show/3144280-in-the-country-of-the-blind"
}