{
  "title": "Noteworthy",
  "description": "A cappella just got a makeover. Story about a teenage Chinese-American scholarship girl attending a privileged East Coast boarding school for performing arts. It's the start of Jordan Sun's junior year at the Kensington-Blaine Boarding School for the Performing Arts, and, she's hopeful that this will be her time: the year she finally gets cast in the school musical. She's in the theatre stream but constantly missing out on parts in performances because of her low voice. Unfortunately, she's an Alto 2, which, in the musical theatre world, is sort of like being a vulture in the wild: she has a spot in the ecosystem, but nobody's falling over themselves to express their appreciation. But her low Alto 2 voice gets her shut out for the third straight year, threatening her future at Kensington-Blaine and jeopardizing her college applications.But then the school gets a mass email: a spot has opened up in the Sharpshooters, Kensington's elite a cappella octet, worshiped…revered…all male, for a voice within her range. Desperate to prove herself, she’s forced to consider nontraditional options. Jordan auditions in her most convincing drag, and it turns out that Julian Sun, Tenor 1, is exactly what the Sharps are looking for. After nailing the audition she realises she's going to have to live a double life alternating between her two identities as Jordan, the theatre girl and Julian the a cappella boy. Jordan finds herself enmeshed in a precarious juggling act: making friends, alienating friends, crushing on a guy, crushing on a girl, and navigating decades-old rivalries. At first she thought life would be less complicated as a boy but soon realises that boys have complicated feelings and personal issues too but that through pretending to be someone else she can finally become the person she wants to be. With her secret growing heavier every day, Jordan pushes beyond gender norms to confront what it means to be a girl (and a guy) in a male-dominated society, and, most importantly, what it means to be herself.",
  "genres": [
    "Young Adult",
    "Contemporary",
    "LGBT",
    "Romance",
    "Fiction",
    "Queer",
    "Music"
  ],
  "author": "Riley Redgate",
  "average_rating": "4.04",
  "url": "https://www.goodreads.com/book/show/31447601-noteworthy"
}