{
  "title": "Savage Things",
  "description": "Zeth  At the eye of a violent storm, everything is calm. It’s only when the storm shifts that your life explodes into chaos.  The $#*& is finally about to hit the fan for Zeth. After months of blissful quiet, the wolves are at his door, teeth bared and snarling, baying for blood, and the sinister elements of the Seattle underground are closing in tight. In other words, things are about to get bad. Real fucking bad.  Zeth Mayfair isn’t your average criminal, though.  If the New York mob wants his allegiance, they’re gonna have to force him to submit. If the cops want his ass in chains, they’re gonna have to catch him first.  He’ll kill the wolves. He’ll ride out the storm. He’ll make his enemies suffer. Zeth Mayfair is about to crown himself ruler of the city, and fuck anyone who dares to take on the king.  They will obey, or they will fall.  The choice is theirs.   Sloane  Death is a bitch.  Sloane Romera sees death every day, looks it square in the eye, and she does not flinch. When Mason Reeves brings his little sister into St. Peter’s emergency room, a dark cloud hangs over the kid—one Sloane recognizes all too well. Millie is gravely ill, but it's not too late. Sloane's determined to do everything in her power to help her, regardless of the cost, regardless of how many rules she must break in the process.  Mason’s struck a deal with the devil, though. A deal that has painted a huge target on Sloane’s back. There’s every chance she’ll be dead by morning, and the man she loves might not be able to save her this time.  If there’s one thing Sloane knows, it’s that you can’t cheat death. When the Grim Reaper demands a life, a life must be given. Bargaining won’t work. Begging is futile.  A life for a life.  The debt must be paid in full.",
  "genres": [
    "Dark",
    "Romance",
    "Dark Romance",
    "Erotica",
    "Contemporary Romance",
    "Suspense",
    "Erotic Romance"
  ],
  "author": "Callie Hart",
  "average_rating": "4.51",
  "url": "https://www.goodreads.com/book/show/31454314-savage-things"
}