{
  "title": "Ten Candles",
  "description": "Ten Candles is a storytelling game of tragic horror designed for one-shot sessions. It is played by the light of ten tea light candles which provide atmosphere, act as a countdown timer for the game, and allow you to literally burn your character sheet away as you play. Ten Candles is described as a \"tragic horror\" game rather than survival horror for one main reason: in Ten Candles there are no survivors. In the final scene of the game, when only one candle remains, all of the characters will die. In this, Ten Candles is not a game about \"winning\" or beating the monsters. Instead, it is a game about what happens in the dark, and about those who try to survive within it. It is a game about being pushed to the brink of madness and despair, searching for hope in a hopeless world, and trying to do something meaningful with your final few hours left. Ten Candles may be played with any number of players and one gamemaster. It takes between 2-4 hours for an average session. While there are some components that need to be gathered to run a game (such as ten tea light candles), the game requires no addition preparation by the gamemaster. The setting of Ten Candles will change game to game as the gamemaster selects different \"modules\" to run for an ever-changing lineup of doomed characters and scenarios for them to play within. The antagonists of the game also change, leaving you to fight nightmares in one session only to fight sentient shadows, bloodthirsty clowns, or the gods themselves in the next. Every session of Ten Candles is unique and will present an entirely new tragic story for you to tell.The standard setting of Ten Candles is this: Ten days ago the world went dark. The sky betrayed you. The sun vanished. The fall into chaos was sudden and predictable. The world was filled with riots and fear. You were told that the sun was not gone, and that it was still out there beyond that black sky. Order returned. Five days ago, They came. Now the lights flicker low and the dark is where They hunt. Now you can hear the screams. Now They're coming for you. Keep moving. Don't lose hope. And stay in the light.",
  "genres": [
    "Role Playing Games",
    "Horror",
    "Reference",
    "Gaming",
    "Games"
  ],
  "author": "Stephen Dewey",
  "average_rating": "4.60",
  "url": "https://www.goodreads.com/book/show/31454371-ten-candles"
}