{
  "title": "Reckless Daughter: A Portrait of Joni Mitchell",
  "description": "\"She was like a storm.\" —Leonard CohenJoni Mitchell may be the most influential female recording artist and composer of the late twentieth century. In Reckless Daughter, the music critic David Yaffe tells the remarkable, heart-wrenching story of how the blond girl with the guitar became a superstar of folk music in the 1960s, a key figure in the Laurel Canyon music scene of the 1970s, and the songwriter who spoke resonantly to, and for, audiences across the country.A Canadian prairie girl, a free-spirited artist, Mitchell never wanted to be a pop star. She was nothing more than “a painter derailed by circumstances,\" she would explain. And yet, she went on to become a talented self-taught musician and a brilliant bandleader, releasing album after album, each distinctly experimental, challenging, and revealing. Her lyrics captivated listeners with their perceptive language and naked emotion, born out of Mitchell's life, loves, complaints, and prophecies. As an artist whose work deftly balances narrative and musical complexity, she has been admired by such legendary lyricists as Bob Dylan and Leonard Cohen and beloved by such groundbreaking jazz musicians as Jaco Pastorius, Wayne Shorter, and Herbie Hancock. Her hits—from “Big Yellow Taxi\" to “Both Sides, Now\" to “A Case of You\"—endure as timeless favorites, and her influence on the generations of singer-songwriters who would follow her, from her devoted fan Prince to Björk, is undeniable.In this intimate biography, drawing on dozens of unprecedented in-person interviews with Mitchell, her childhood friends, and a cast of famous characters, Yaffe reveals the backstory behind the famous songs—from Mitchell's youth in Canada, her bout with polio at age nine, and her early marriage and the child she gave up for adoption, through the love affairs that inspired masterpieces, and up to the present—and shows us why Mitchell has so enthralled her listeners, her lovers, and her friends. Reckless Daughter is the story of an artist and an era that have left an indelible mark on American music.",
  "genres": [
    "Music",
    "Biography",
    "Nonfiction",
    "Biography Memoir",
    "Memoir",
    "Womens",
    "History"
  ],
  "author": "David Yaffe",
  "average_rating": "3.76",
  "url": "https://www.goodreads.com/book/show/31450894-reckless-daughter"
}