{
  "title": "Peak Performance: Elevate Your Game, Avoid Burnout, and Thrive with the New Science of Success",
  "description": "A few common principles drive performance, regardless of the field or the task at hand. Whether someone is trying to qualify for the Olympics, break ground in mathematical theory or craft an artistic masterpiece, many of the practices that lead to great success are the same. In Peak Performance, Brad Stulberg, a former McKinsey and Company consultant and journalist who covers health and the science of human performance, and Steve Magness, a performance scientist and coach of Olympic athletes, team up to demystify these practices and demonstrate how everyone can achieve their best.The first book of its kind, Peak Performance combines the inspiring stories of top performers across a range of capabilities - from athletic, to intellectual, to artistic - with the latest scientific insights into the cognitive and neurochemical factors that drive performance in all domains. In doing so, Peak Performance uncovers new linkages that hold promise as performance enhancers but have been overlooked in our traditionally-siloed ways of thinking. The result is a life-changing book in which readers will learn how to enhance their performance by a myriad of ways including: optimally alternating between periods of intense work and rest; developing and harnessing the power of a self-transcending purpose; and priming the body and mind for enhanced productivity.In revealing the science of great performance and the stories of great performers across a wide range of capabilities, Peak Performance uncovers the secrets of success, and coaches readers on how to use them. If you want to take your game to the next level, whatever \"your game\" may be, Peak Performance will teach you how.",
  "genres": [
    "Self Help",
    "Nonfiction",
    "Psychology",
    "Productivity",
    "Personal Development",
    "Business",
    "Audiobook"
  ],
  "author": "Brad Stulberg",
  "average_rating": "4.17",
  "url": "https://www.goodreads.com/book/show/31450959-peak-performance"
}