{
  "title": "Pets in Space",
  "description": "Even an alien needs a pet…Join the adventure as nine pet loving sci-fi romance authors take you out of this world and pull you into their action-packed stories filled with suspense, laughter, and romance. The alien pets have an agenda that will capture the hearts of those they touch. Follow along as they work side by side to help stop a genetically-engineered creature from destroying the Earth to finding a lost dragon; life is never the same after their pets decide to get involved. Can the animals win the day or will the stars shine just a little less brightly?New York Times, USA TODAY, Award Winning, and Bestselling authors have nine original, never-released stories that will capture your imagination and help a worthy charity. Come join us as we take you on nine amazing adventures that will change the way you look at your pet!10% of profits from the first month go to Hero-Dogs.org. Hero Dogs raises and trains service dogs and places them free of charge with US Veterans to improve quality of life and restore independence.A MATE FOR MATRIX: CYBORG PROTECTION UNIT By S.E. Smith (New York Times/USA TODAY Bestselling Author)Matrix Roma is a member of the elite Zion military Cyborg Protection Unit. Matrix gets more than he bargains for when his cyborg partner, a hybrid Wolfhound named K-Nine, goes missing and ends up finding a mate for Matrix in the middle of a deadly mission on an unknown planet called Earth.STRAYBy Susan Grant (New York Times/USA Today Bestselling, and RITA Award Winning Author)Interplanetary Marine Lt. Lukas Frank has a lot in common with a street dog named Bang-Bang; they both started off as scrappy orphans fighting to survive—and beat the odds. Things change when Bang-Bang leads Lukas to starpilot Capt. Carlynn Riga. The tough war hero learns what it means to surrender — his heart. Lukas’s struggles with PTSD threaten to tear the three of them apart, but nothing threatens them more than when Carlynn goes missing on a mission. Can a scarred marine and his unlikely canine partner find Carlynn and bring her home, or will he lose everything he’s finally found worth fighting for?SPARK OF ATTRACTIONBy Cara Bristol (USA TODAY Bestselling Author)Memory: intact. Cognitive function: enhanced. Emotion: erased. After becoming a cyborg, Captain Dante Stone didn’t think he’d ever feel again, until a traumatized young woman and a ball of synthetic fur named Sparky helped him to love.STAR CRUISE: STOWAWAYBy Veronica ScottCargo Master Owen Embersson is shocked when the Nebula Zephyr’s ship’s cat and her alien sidekick, Midorri, alert him to the presence of a stowaway. He has no idea of the dangerous complications to come – nor does he anticipate falling hard for the woman whose life he now holds in his hands. Life aboard the Nebula Zephyr has just become more interesting – and deadly.THE REAL DRAGONBy Pauline Baird JonesEmma Standish didn’t think her day could get any worse. Her dad is marrying his boss, her dragon suddenly came back talking and typing, and it’s her fault the Earth, or at least ten square miles of Texas, is going to be destroyed. That’s what happens when you forget something very, very important. Luckily for her, she’s got the love of her life that she can’t remember and her dragon by her side. Who needs to worry when you’re having a day like this?STARDOGBy Laurie A. GreenNavigator Taro Shall has a mission no one wants – find a way to eradicate snakes on a starship. He never expects to find the answer to his problem in a charming street vendor named Adini. His already unusual mission becomes more complicated when he suddenly acquires an adorable StarDog that soon sweeps him and Adini into the maw of a brewing insurrection.SPIKEBy Alexis Glynn LatnerYoung Roboticist Ten Jaxdown has to deploy, and possibly sacrifice, the swarm of investigative robots that he has invented and cares about more than anything else in the star system. It may be the only hope for those depending on him and his robots to save them. Yet, even as frantic preparations for the unprecedented deep-space rescue mission are set in motion, it could all be threatened by sabotage.Anastasia Steed is an intrepid young mission designer. She steps forward with an idea that can improve the odds of the mission. Neither she nor Ten expect the assistance they receive from a very unusual pet. A pet that will bring together two alienated human beings who didn’t realize they needed each other. Can Ten and Anastasia discover who is behind the sabotage, save the mission, and discover what is evolving between them? With a little bit of unusual help, anything is possible.SPACE RANGERBy Lea KirkGraig Roble is the Senior Commander of security for the Guardian Fleet. His expertise as a weapons specialist and combat master is his world, what he was born to do – or so he thought until he finds his resolve and focus inexplicably wavering. Even returning to his position aboard the Atlantis can’t save him; if anything, it has left him questioning his own motives. He never thought that could happen until he met Simone Campbell.Simone’s focus is on her home world – Earth. She thought her life was full with her research as a botanist. After all, she always believed that helping the people of her world become self-sufficient should take all of her concentration – except it doesn’t. There is one man that keeps pulling her attention, and her heart, away from her job.Graig’s gift of a puppy to keep her company does more than that, it keeps him in her dreams. How can such a simple gift bring her comfort and make her long for more? Graig and Simone are about to find out that sometimes love can blossom from the smallest, furriest ties.ESCAPE RUNBy Carysa LockeTeegan’s job as a hunter is to track down the Talented, those driven insane by their gifts. She and Ember, her psychically gifted fox, have tracked dozens of people for Cole, the man who works to rehabilitate and recover these troubled souls. When one of Cole’s most dangerous patients escapes, Teegan and Ember are on a hunt that could prove fatal if she doesn’t keep her focus on her mission. Unfortunately, Cole is proving one distraction that might make this her last hunt if she can’t do that.Can Teegan keep her heart and mind in the game long enough to save an entire planet’s population, or will her distraction lead to heartache – and possibly death for everyone?",
  "genres": [
    "Romance",
    "Science Fiction",
    "Anthologies",
    "Science Fiction Romance",
    "Short Stories",
    "Paranormal",
    "Aliens"
  ],
  "author": "S.E. Smith",
  "average_rating": "3.97",
  "url": "https://www.goodreads.com/book/show/31452375-pets-in-space"
}