{
  "title": "Scars of Independence: America's Violent Birth",
  "description": "A magisterial new work that rewrites the story of America’s foundingThe American Revolution is often portrayed as an orderly, restrained rebellion, with brave patriots defending their noble ideals against an oppressive empire. It’s a stirring narrative, and one the founders did their best to encourage after the war. But as historian Holger Hoock shows in this deeply researched and elegantly written account of America’s founding, the Revolution was not only a high-minded battle over principles, but also a profoundly violent civil war—one that shaped the nation, and the British Empire, in ways we have only begun to understand.In Scars of Independence, Hoock writes the violence back into the story of the Revolution. American Patriots persecuted and tortured Loyalists. British troops massacred enemy soldiers and raped colonial women. Prisoners were starved on disease-ridden ships and in subterranean cells. African-Americans fighting for or against independence suffered disproportionately, and Washington’s army waged a genocidal campaign against the Iroquois. In vivid, authoritative prose, Hoock’s new reckoning also examines the moral dilemmas posed by this all-pervasive violence, as the British found themselves torn between unlimited war and restraint toward fellow subjects, while the Patriots documented war crimes in an ingenious effort to unify the fledgling nation.For two centuries we have whitewashed this history of the Revolution. Scars of Independence forces a more honest appraisal, revealing the inherent tensions between moral purpose and violent tendencies in America’s past. In so doing, it offers a new origins story that is both relevant and necessary—an important reminder that forging a nation is rarely bloodless.",
  "genres": [
    "History",
    "Nonfiction",
    "American History",
    "American Revolution",
    "War",
    "American Revolutionary War",
    "Military Fiction"
  ],
  "author": "Holger Hoock",
  "average_rating": "3.87",
  "url": "https://www.goodreads.com/book/show/31453065-scars-of-independence"
}