{
  "title": "The Island",
  "description": "On a small island off the Carolina coast, there lives a beautiful woman whose life is marred by grief and tragedy. Her world is dark and full of sorrow. Her marriage, such as it is, is loveless and miserable. The pain of losing her only child is overwhelming. It is more pain than one person should bear alone but her husband couldn't care less and views her mental state as an embarrassment. Every day she lives with the guilt of believing that her baby's accidental death was somehow her fault. Her pain is as real as the ocean that surrounds her and she has long made peace with the idea of throwing herself into the ocean and drowning in its waters. For her dying this way would bring closure to her all-encompassing grief. Committing suicide would bring the misery to an end. Nothing's stopping her and with each passing day, suicide seems to be a reasonable solution to the pain and sorrow she lives with. And then a chance encounter with an uninspired writer turns romantic and although she's married, she allows this stranger to sweep her off her feet with promises of a Summer full of delights she will never forget. It doesn't take much to bring her back to life and for a time, they find themselves caught up in a whirlwind romance tinged by the sins of the island; sex, drugs, and money. They revel in the pleasures of their affair. The heat of Summer and the beauty of white sand beaches brings a life of excitement and pleasure awaits them at every turn. Their affair is all consuming and for a time they willingly share their darkest secrets. During one such conversation, she lets slip the fact that her husband supplies the island with the cocaine that fuels its nightlife. He is a cold, heartless man sitting on millions of illegal dollars, orchestrating an island network of dealers and enforcers. For him, cocaine is a huge business and for the island, it is the drug of choice. Tourist choose to vacation there every year for two simple reasons; cheap cocaine and a never ending flow of alcohol. Once he learns of their affair we swears his revenge and they suddenly find themselves in great danger. As more and more details of their secret affair emerge her husband's contempt boils into a rage he can not contain. He makes it clear that their disappearance would be nothing more than passing gossip and the question is not if he will seek his revenge but when. She knows that he is capable and so merciless that with a single word they will simply vanish, never to be heard from or seen again. However, for her ruthless husband ordering a hit on his wife and her lover is too easy. To be satisfied with his revenge he must kill them with his own hands and in the end there is nobody that can stop him.",
  "genres": [],
  "author": "Stephen E. Crockett",
  "average_rating": "3.60",
  "url": "https://www.goodreads.com/book/show/31460520-the-island"
}