{
  "title": "A Gentleman's Wager",
  "description": "Rivals clash over the man they both intend to claim, resulting in scandal worthy seduction. \nWhen Miss Bella Rushdale sets out to win Viscount Marlinscar’s hand in marriage, she doesn’t expect her main rival to be another man. Vaughan, the decadent Marquis of Pennerley, has loved Lucerne for years, and now, at remote Lauwine Hall on the wild Yorkshire Moors, scandalously intends to claim him.A passionate struggle results between the debauched rakehell and the wilfully improper young lady determined not to be cheated out of an advantageous match. Ultimately, it will be up to Lucerne to choose the victor, though he wonders if there isn’t another—admittedly forbidden—far sweeter arrangement they could agree upon that would satisfy all their desires.A Gentleman’s Wager is a Regency historical romance that includes blistering heat, strong language, and lashings of forbidden MF, MM and MMF interactions. Readers ill-disposed to lewd and crude rakish behaviour or ladies disinclined to swoon as a result are advised to look the other way.This 20th anniversary edition is a re-envisioning of the original story published in 2003, which has been completely rewritten and now contains approximately 50K of additional material.‘Explicit, romantic and flawlessly authored… A sizzling, refreshingly unconventional love triangle… passionate power struggles and absolutely searing bisexual sex.’ GOOD VIBRATIONS“Excessively naughty- Jane Austen and the Bronte sisters would have fainted dead away.” Goodreads Reviewer.“Intense, subtle, and heartfelt.” Author Lisabet Sarai, for ERWA.‘Forbidden passion, risqué love, & smouldering desires – A GENTLEMAN’S WAGER had it all!’ Romance Junkies.",
  "genres": [
    "Erotica",
    "Historical",
    "Romance",
    "Historical Romance",
    "Menage",
    "M M F",
    "Audiobook"
  ],
  "author": "Madelynne Ellis",
  "average_rating": "3.50",
  "url": "https://www.goodreads.com/book/show/3146791-a-gentleman-s-wager"
}