{
  "title": "Tommyland",
  "description": "Now in paperback, the New York Times bestseller in which rock and roll's most notorious bad boy bares it all and boy is there a lot to bare!I am Tommy Lee, born Thomas Lee Bass in Athens, Greece, on October 3, 1962, and raised in a suburb of California by an American father and a Greek mother. At seventeen, I joined Mötley Crüe and we became one of the baddest-ass rock bands in history. We sold over 40 million albums, we wreaked havoc, we scared parents, and we titillated too many fathers' daughters. I've been married three times: once for just a few days to a Penthouse Pet, for seven years to Heather Locklear, and then for five years to Pamela Anderson, with whom I have two beautiful sons. I've gotten into a lot of fights and I've been to jail a few times.But this book isn't your typical journey in a straight line from day one to day now. I'm more interested in revealing what's most important about my life, like how I cook my steaks; what I think of the tabloids, the truth, my ex-wives, my ex-band, my music; and what an innocent observer might find hanging around my house any given Sunday. You'll get plenty of facts and I'll tell you a story, but my real mission here is to paint you a picture of my life. I want to show you how my memories smell.I'd like to get into it now, so please take your seats. I advise you to keep your arms and legs inside the car at all times. If you have a pacemaker, a heart condition, or if you are pregnant or too damn short to reach the safety bar, I ask that you turn back immediately. Those with weak stomachs, strict morals, or chronic indigestion should put the book down now. For the rest of you, there's one truth that's real across the board: What you send out is what you get back. Send out the good, people, and it will come back to you. There's another thing I've learned over the years, in court, in fights, and in arguments with people I love: There isn't one truth, there are many. This book is my truth.",
  "genres": [
    "Music",
    "Biography",
    "Nonfiction",
    "Memoir",
    "Autobiography",
    "Biography Memoir",
    "Rock N Roll"
  ],
  "author": "Tommy Lee",
  "average_rating": "3.69",
  "url": "https://www.goodreads.com/book/show/314584.Tommyland"
}