{
  "title": "Autobiography as Activism: Three Black Women of the Sixties",
  "description": "Angela Davis, Assata Shakur (a.k.a. JoAnne Chesimard), and Elaine Brown are the only women activists of the Black Power movement who have published book-length autobiographies. In bearing witness to that era, these militant newsmakers wrote in part to educate and to mobilize their anticipated readers.In this way, Davis's Angela An Autobiography (1974), Shakur's Assata (1987), and Brown's A Taste of A Black Woman's Story (1992) can all be read as extensions of the writers' political activism during the 1960s.Margo V. Perkins's critical analysis of their books is less a history of the movement (or of women's involvement in it) than an exploration of the politics of storytelling for activists who choose to write their lives. Perkins examines how activists use autobiography to connect their lives to those of other activists across historical periods, to emphasize the link between the personal and the political, and to construct an alternative history that challenges dominant or conventional ways of knowing.The histories constructed by these three women call attention to the experiences of women in revolutionary struggle, particularly to the ways their experiences have differed from men's. The women's stories are told from different perspectives and provide different insights into a movement that has been much studied from the masculine perspective. At times they fill in, complement, challenge, or converse with the stories told by their male counterparts, and in doing so, hint at how the present and future can be made less catastrophic because of women's involvement.The multiple complexities of the Black Power movement become evident in reading these women's narratives against each other as well as against the sometimes strikingly different accounts of their male counterparts.As Davis, Shakur, and Brown recount events in their lives, they dispute mainstream assumptions about race, class, and gender and reveal how the Black Power struggle profoundly shaped their respective identities.",
  "genres": [
    "Feminism",
    "Race",
    "Social Justice",
    "Nonfiction"
  ],
  "author": "Margo V. Perkins",
  "average_rating": "4.23",
  "url": "https://www.goodreads.com/book/show/3146249-autobiography-as-activism"
}