{
  "title": "Red River",
  "description": "P. G. Nagle, \"author of some of the best fiction written about Texas history\" (Edward T. Cotham, Jr., author of Battle on the The Civil War Struggle for Galveston), writes with power and poignancy of a bloody campaign little chronicled but of great strategic to both North and South. Nagle tells the story of the struggle for dominance among the bayous and rivers of the Mississippi basin in an authoritative narrative both unflinching and compassionate, adding yet another memorable chapter to the chronicle of the Civil War fought in the Far West. The port city of Galveston has been reclaimed by the confederacy, and Jamie Russell's battalion, the Valverde Battery, is growing in respect and recognition. Jamie is sent to Louisiana on the shores of the Red River, a Confederate controlled waterway which leads into Texas. With the confederacy holding strong, it appears that Jamie might finally see some quiet.But Union General Nathaniel Banks has other ideas. Setting his sights on the river in order to disrupt confederate supply routes as well as to gain a foothold in Texas, Banks orders a two-pronged attack on the soldiers holding the Red River. His plan moves one force of Union soldiers down from Arkansas while a fleet of ironclads and steamers makes its way up the river itself.The Confederates, meanwhile, have secretly beached the huge steamer New City Falls across the river, each end touching shore, so the ship forms an unmovable blockade. By digging canals to reroute the water from the river, the rebels make sure the Red is low when the union ships arrive. Unable to move forward or retreat through the shallow water, the union troops are helpless under the fire of the rebels, including the Valverde Battery.The Confederates seem to have won, but the Union soldiers aren't going to give up that easily. When the rebel commander falls to the federal artillery, and the Union begins to set up dams to divert water for an escape, it is the rebels who must fight to keep their heads above the water. But the Confederate forces on the Red River face a still rougher path. For the North has elsewhere begun to turn the tide of war, making the Valverde battery's future uncertain.",
  "genres": [
    "Historical Fiction",
    "Civil War",
    "War",
    "Adventure",
    "American Civil War"
  ],
  "author": "P.G. Nagle",
  "average_rating": "3.78",
  "url": "https://www.goodreads.com/book/show/3146477-red-river"
}