{
  "title": "I Believe in Yesterday: My Adventures in Living History",
  "description": "In 1989, Tim Moore moved into the last house in Chiswick with an outside toilet. Intrigued by a subsequent encounter with an elderly former resident, and shamed to confess the phobic haste with which he demolished this facility, he finds himself inspired to travel back to the land before now, experiencing the horny-handed hardships and homespun pleasures enjoyed and endured by Moores gone by.The journey that follows takes him through the world of historical re-enactment, sitting at the bare and grubby feet of retromaniacs who have seen their future in the past, and learning their singular ways. Living on bramble leaves, Johnny cake and porridge, Moore travels from the Iron Age to the Steam Age, sharing straw beds and daft hats with period obsessives driven by socio-historical curiosity, disillusionment with the pampered fecklessness of the modern world, or a simple nostalgia for campfires, flatulence and brutality.As a Roman legionary, Moore is put to the Gaulish sword twelve times a day for the entertainment of the Danish public; as master of a Tudor manor's domestic staff, he works his young charges to heatstroked collapse, and serves up moat-drowned hare to the sneering gentry. He crosses the snake-happy Kentucky wilderness with a Vietnam veteran and his ox-drawn wagon, gets arrested as a Yankee spy in the Louisiana no man's land, and lets a party of taunting French schoolchildren have it with a medieval bazooka. Along the way he meets living historians for whom authenticity means pulling their own teeth out and dyeing outfits in urine, and those who stride back through time with a Nokia and a packet of fags stuffed down their codpiece.I Believe in Yesterday is an odyssey through 2,000 years of filth and fury, where men were men, the nights were black, the world was your outside toilet and everything tasted faintly of leeks.",
  "genres": [
    "Nonfiction",
    "Travel",
    "History",
    "Humor",
    "Memoir"
  ],
  "author": "Tim Moore",
  "average_rating": "3.47",
  "url": "https://www.goodreads.com/book/show/3149234-i-believe-in-yesterday"
}