{
  "title": "Safe With Me",
  "description": "Thirteen years ago someone did something very bad to Anna. Now it’s her turn to get even …Anna lives a solitary existence, taking solace in order and routine. Her only friend is the lonely old lady next door. She doesn’t like to let people to get too close – she knows how much damage they can do.Then one ordinary day Anna witnesses a devastating road accident and recognises the driver as Carla, the woman who ruined her life all those years ago. Now it’s Anna’s chance to set things straight but her revenge needs to be executed carefully …First she needs to get to know Liam, the man injured in the accident. She needs to follow the police investigation. She needs to watch Carla from the shadows…But as Anna’s obsession with Carla escalates, her own secrets start to unravel. Is Carla really dangerous or does Anna need to worry about someone far closer to home?A compelling, gripping psychological thriller, perfect for fans of The Girl on the Train and The Sister.What everyone's saying about SAFE WITH 'Holy Hell what a jaw dropper!.....Just need a moment to lift my jaw back off the floor, what a fantastic debut!' Chelle's Book Reviews'First let me say, just WOW. It has been a long time since I read a book this good. I was completely spellbound by this psychological thriller and could hardly put it down... Safe With Me went far beyond my expectations in every way ...There are so many secrets, backstories, and undercurrents, and this wonderful feeling of dread throughout, it is like nectar for the reader. I highly recommend this book for anyone who loves a psychological thriller. I am looking forward to the next book from K.L. Slater. She has knocked this one out of the proverbial park' Shelf Knowledge'Oh my gosh! What a belter of a debut! Safe With Me is totally brilliant' The Little Bookworm'Sublimely dark and all-consuming, Slater has written a novel so gripping, so captivatingly exciting that I found myself shushing everyone and ignoring everything simply so I could carry on reading.' Becca's Books 'This one will keep you up at night, flipping the pages ...One word of caution, prepare to be surprised & shocked more than once.' First to Read'Freakin' awesome...you need to start this book on a day when you have nothing else to do, because believe me you will not want to put this down once you start it.' I Love Reading'WOW,I'm going to have to catch up with the housework tomorrow because I have just spent the last two days devouring this jaw droppingly brilliant debut psychological thriller. 'Nicki's Life of Crime'Thoroughly enjoyed this book. Lots of twists in the story kept me guessing right to the end. Very well written.' Book Attic Confessions'I was totally captivated by this book from the start, it is truly a gripping read with some gobsmacking twists that will leave you breathless!' Emma the little Bookworm'You know how some books declare 'It'll leave you on the edge of your seat\", I swear I almost fell off mine more than once ... this is a gem of a read, hugely enjoyable in a perverse making yourself feel on-edge kind of way!' Woman Reads Books",
  "genres": [
    "Thriller",
    "Fiction",
    "Mystery",
    "Psychological Thriller",
    "Audiobook",
    "Suspense",
    "Mystery Thriller"
  ],
  "author": "K.L. Slater",
  "average_rating": "3.71",
  "url": "https://www.goodreads.com/book/show/31489055-safe-with-me"
}