{
  "title": "Dakota Dawn: The Decisive First Week of the Sioux Uprising, August 17-24, 1862",
  "description": "In August of 1862, hundreds of Dakota warriors opened without warning a murderous rampage against settlers and soldiers in southern Minnesota. The vortex of the Dakota Uprising along the Minnesota River encompassed thousands of people in what was perhaps the greatest massacre of whites by Indians in American history. To read about the fast paced and unpredictable flood of killing and destruction is to discover heartrending emotion, irony, tragedy, cowardice, and heroism from unexpected quarters. Previous attempts to sort out individual experiences and place the events in a coherent chronological and geographical order have enjoyed little success. Award-winning author Gregory F. MichnoOCOs Dakota Dawn: The Decisive First Week of the Sioux Uprising, August 17OCo24, 1862 offers an essential clarity and vivid portrait that readers will find refreshing and invigorating.Dakota Dawn focuses in great detail on the first week of the killing spree, a great paroxysm of destruction when the Dakota succeeded, albeit fleetingly, in driving out the white man. During those seven days at least 400 white settlers were killed, the great majority innocent victims slaughtered in the most shocking manner. Nowhere else in the Western United States was there a record of such sustained attacks against a fort (Ridgely) or upon a town (New Ulm). After soldiers put down the uprising, hundreds of Dakotas were captured and put before military tribunals with little or no opportunity to present a fair defense; 38 were hanged on one massive gallows on December 26, 1862.MichnoOCOs research includes select secondary studies and 2,000 pages of primary sources including recollections, original records, diaries, newspaper accounts, and other archival records. One seldomused resource is the Indian Depredation Claim files. After the uprising, settlers filed nearly 3,000 claims for damages in which they itemized losses and set forth their experiences. These priceless documents paint firsthand slices of the life of a frontier people, their cabins, tools, clothes, crops, animals, and cherished possessions. Many of these claims have never been incorporated into a book; MichnoOCOs use of them allows him to more fully expound on various episodes and correct previous misconceptions. Richly illustrated with 42 contemporary and modern photos and illustrations and accompanied by 19 original maps, Dakota Dawn now stands as the definitive account of one of the most important and previously misunderstood events in American history.About the Author: Award-winning author Gregory F. Michno is a Michigan native and the author of three dozen articles and ten books dealing with World War II and the American West, including Lakota Noon; Battle at Sand Creek; The Encyclopedia of Indian Wars; The Deadliest Indian War in the West; and Circle the Wagons. Greg helped edit and appeared in the DVD history The Great Indian Wars: 1540-1890. He lives in Colorado, with his wife Susan.",
  "genres": [
    "History"
  ],
  "author": "Gregory F. Michno",
  "average_rating": "4.04",
  "url": "https://www.goodreads.com/book/show/31497982-dakota-dawn"
}