{
  "title": "The Queen of Storm and Shadow",
  "description": "The Queen of Storm and Shadow is the fourth and final novel in the spellbinding fantasy epic, The Elven Ways.  The world of Kerith has reached a pivotal moment in its history, as rival factions are forced to band together against both known enemies and an unexpected invasion force.  Life, Death, and the elemental Gods have awakened in the lands of Kerith after a cataclysmic collision with Trevalka, home of Vaelinar ambition, lies, and magic. Only a handful of the bravest and most foolhardy left standing dare to face the consequences of these two worlds meeting. Unwillingly thrust through space and time, the Vaelinars have made the most of their exile and woven the threads of their magic deep into the fabric of Kerith. Makers and masters of the Elven Ways, now they, and the Gods, must choose their final paths.  Rivergrace and her partner Sevryn have no choice but to cross the treacherous divide between worlds in pursuit of Quendius and his army of Undead. They are determined to risk everything to prevent the Death Master from joining forces with the queen of lost Trevalka, a tyrant who has risen to power by draining the energies of those around her. Cut off from all their allies and friends, Rivergrace and Sevryn may have to sacrifice their magic, their love, and their very existence to save the world they left behind.  Back on Kerith, the Warrior Queen Lariel awakens from an assassination attempt to find her people on the brink of civil war. Lariel's heirs--Nutmeg Farbranch's children--have been kidnapped, and Nutmeg will risk anything for their safe return. As primal forces rise in judgment, Dwellers, Kernans, Galdarkans, and Vaelinars alike must pick allies carefully if any of them are to survive.",
  "genres": [
    "Fantasy",
    "High Fantasy",
    "M M Romance",
    "LGBT",
    "Romance",
    "Fairies",
    "Fae"
  ],
  "author": "Jenna Rhodes",
  "average_rating": "3.91",
  "url": "https://www.goodreads.com/book/show/31522447-the-queen-of-storm-and-shadow"
}