{
  "title": "The Baine Chronicles #1-3",
  "description": "“Magic and I have a complicated relationship. I can’t live without it, but it’s bound and determined to be the death of me.” This is the boxed set of the first three books in the highly rated Baine Chronicles Series by New York Times Bestselling Author Jasmine Walt. This kick-ass urban fantasy series has been compared to books by Ilona Andrews, Patricia Briggs, Karen Marie Moning, and more. You're sure to enjoy it if you like spunky heroines, kick-ass fight scenes, wild new worlds and sizzling, slow-building romance. Book Burned by  In the city of Solantha, mages rule absolute, with shifters considered second-class citizens and humans something in between. No one outside the mage families are allowed to have magic, and anyone born with it must agree to have it stripped from them to avoid execution. Sunaya Baine, a shifter-mage hybrid, has managed to keep her unruly magic under wraps for the last twenty-four years. But while chasing down a shifter-hunting serial killer, she accidentally loses control of her magic in front of witnesses, drawing the attention of the dangerous and enigmatic Chief Mage. Locked up in the Chief Mage’s castle and reduced to little more than a lab rat, Sunaya resists his attempts to analyze and control her at every turn. But she soon realizes that to regain her freedom and catch the killer, she must overcome her hatred of mages and win the most powerful mage of all to her side. Book Bound by Magic With the silver murders solved and her training as a mage underway, Sunaya figured her life would get easier. But between the Chief Mage’s packed schedule and the grunt work demanded of her as an apprentice mage, magic lessons are few and far between. Worse, her apprenticeship leaves little time for her job as an Enforcer, and without bounties Sunaya’s money pouch is drying up — fast. But when Shiftertown Inspector Boon Lakin asks for Sunaya’s help digging deeper into the murder of a fellow Enforcer, Sunaya has no trouble making room in her life to help him, even if it means incurring the Chief Mage’s wrath. The trail leads them to a series of crimes victimising shifters for the entertainment of vicious humans. Sunaya and her friends race to identify the perpetrators and free the survivors, and the stakes are heightened when she discovers one of the victims has a connection to her. But if Sunaya is not careful, she may end up a very dead shifter herself… Book Hunted by Magic With the sudden disappearance of Iannis, the Chief Mage, Solantha has erupted into pandemonium. Citizens are rioting in the streets, the Mages Guild is on a misguided warpath, and shifters and humans are fleeing the city in droves. Ridden with guilt, Sunaya defies the Mages Guild and goes off in search of Iannis, trekking into dangerous, uncivilized territory to try and make things right. But Sunaya’s relationship with Iannis isn’t the only thing at stake — if she doesn’t find him soon, the Resistance might just succeed in plunging the Northia Federation into a devastating and bloody civil war. Additional books continuing the series and not included in this  Marked by Magic (book 4) Betrayed by Magic (book 5) Deceived by Magic (book 6) Scorched by Magic (book 7) Future titles yet to be announced Scroll up and grab your copy today!",
  "genres": [
    "Fantasy",
    "Paranormal",
    "New Adult",
    "Urban Fantasy",
    "Romance"
  ],
  "author": "Jasmine Walt",
  "average_rating": "4.32",
  "url": "https://www.goodreads.com/book/show/31523557-the-baine-chronicles-1-3"
}