{
  "title": "Who Lives By The Sword",
  "description": "Niall Dubhain, celebrated mercenary and Laird of a Highland clan, has always been content to leave his past and his people to themselves; until the death of comrade brings him home, into the path of an Innkeeper's daughter. Faith MacDolwyn dreamed of a life beyond the small kitchen of her father's inn but finds more than she had bargained for when she is offered work on a distant Highland estate; drawn to its rough and troubled Laird. Set against the backdrop of the beautiful and wild Highlands in the year 1800, Who Lives is a story of love, mystery, murder, and second-chances. Are we defined by the past, by those who have come before us and our own mistakes, or are we free at every moment to redefine the future? Who Lives is a sweet, intelligent romance that touches on the historical themes of the Napoleonic Wars and the Highland Clearances. He was not the handsomest man—perhaps among them—but a more powerful man, she had never seen. It seemed silly to ascribe such a characteristic to someone she didn’t know. Yet power such as a storm has, that bursts the banks of the river and sets trees ablaze—that dangerous temperament radiated from him. A Highlander. Who else was so like the stones and earth? He seemed coiled, ready to spring at the slightest provocation; shoulders so wide he could have been yoked with oxen to plow the fields, as some of the poorer farmers did, and found it no burden. Thief or turncoat he might be, she thought, but possessed with an even tone and fine mouth to match...She leaned her cheek against the banister, watching him. Could it be that he was the one in trouble? Was it possible such a man needed aid of her family?\" \"The entrance opened into a foyer and, from there, into part of the old castle, the great hall. The hall largely appeared as it had for centuries and it seemed as if it had been almost as long since it was properly cleaned—what one could see. There were no torches or fire lit. The four candelabras which hung from the vaulted ceiling were draped with dust and webs. Dim light filtered down through high windows on one side, and everywhere was the smell of stale beer...A tapestry had apparently caught fire at some past date, been extinguished and left hanging. At the far end of the room, a screen-hall painted with hounds and flowers separated the servant’s walkway to the kitchen, with curtained entrances at either end. As they entered, a pig burst through the curtain and ran in, squealing. Niall arrested on the spot, his head half-turned. The pig took refuge under one of the trestle tables, snorting indignantly. A robust woman emerged from the same end of the screen hall, carrying a tray set for tea. She was looking down at her tray, muttering. “Och, those children—“ As if called into manifestation, a shriek rent the air. A girl with auburn curls and a turned-up nose skidded into the room. The dishes clattered on the tray. “Bride,” the white-haired woman gasped. “Mathair!” The girl cried and showed an arm peppered with welts. “You must stop them! They’re—“ She broke off and dived behind her mother as three flushed and sweaty boys burst into the room. “You little sneak!” hissed the oldest of the bunch resentfully when he saw his sister had enlisted aid of an adult. Impatient with the commotion, Niall stepped forward, drawing the gazes of the rambunctious group. As the woman’s eyes lit on them, the tray spilled from her hands, crashing against the floor. “God save!” She cried as she pressed her hands atop her ample bosom. “Guard our souls—!” “Quiet!” Niall interrupted curtly. The woman abruptly ceased her unearthly moan. She squinted at him in disbelief. “Niall?” Her voice lowered. “Heaven and the saints, it is ye! Ye look the verra ghost of your father. O—“ If possible, she looked even more frightened than before. “What a foolish woman I am. I only meant—“ “I know what ye meant,” Niall interrupted in a softer voice.",
  "genres": [],
  "author": "Amy Jean Lemco",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/31520545-who-lives-by-the-sword"
}