{
  "title": "The Age of Anxiety: A History of America's Turbulent Affair with Tranquilizers",
  "description": "Anxious Americans have increasingly pursued peace of mind through pills and prescriptions. In 2006, the National Institute of Mental Health estimated that 40 million adult Americans suffer from an anxiety disorder in any given year: more than double the number thought to have such a disorder in 2001. Anti-anxiety drugs are a billion-dollar business. Yet as recently as 1955, when the first tranquilizer—Miltown—went on the market, pharmaceutical executives worried that there wouldn’t be interest in anxiety-relief. At mid-century, talk therapy remained the treatment of choice.But Miltown became a sensation—the first psychotropic blockbuster in United States history. By 1957, Americans had filled 36 million prescriptions. Patients seeking made-to-order tranquility emptied drugstores, forcing pharmacists to post signs reading “more Miltown tomorrow.” The drug’s financial success and cultural impact revolutionized perceptions of anxiety and its treatment, inspiring the development of other lifestyle drugs including Valium and Prozac.In The Age of Anxiety, Andrea Tone draws on a broad array of original sources—manufacturers’ files, FDA reports, letters, government investigations, and interviews with inventors, physicians, patients, and activists—to provide the first comprehensive account of the rise of America’s tranquilizer culture. She transports readers from the bomb shelters of the Cold War to the scientific optimism of the Baby Boomers, to the “just say no” Puritanism of the late 1970s and 1980s.A vibrant history of America’s long and turbulent affair with tranquilizers, The Age of Anxiety casts new light on what it has meant to seek synthetic solutions to everyday angst.",
  "genres": [
    "History",
    "Psychology",
    "Nonfiction",
    "Mental Health",
    "Medicine",
    "Science",
    "American History"
  ],
  "author": "Andrea Tone",
  "average_rating": "3.88",
  "url": "https://www.goodreads.com/book/show/3152641-the-age-of-anxiety"
}