{
  "title": "Là-Bas",
  "description": "This novel is the classic of Satanism. It caused a sensation when it first appeared in 1891 because of its extraordinarily detailed and vivid descriptions of the Black Mass. These descriptions are also authentic, for J. K. Huysmans, who has been called the greatest of the French decadents, had firsthand knowledge of the satanic practices, witch cults, and the whole of the occult underworld thriving in late nineteenth-century Paris.At its center is Durtal, a writer obsessed with the life of one of the blackest figures in history, Gilles de Rais. The legendary crimes, trial, and confession of this grotesque fifteenth-century child murderer, sadist, necrophile, and practitioner of all the black arts unfold in episode after horrifying episode. Mystical thematic threads connect this greatest of all revelers in evil with Durtal's own passionate pursuit, the reflection of a religious quest that was to lead Huysmans from uncertain agnosticism back to Catholicism.Durtal, the mouthpiece for the strange personality of Huysmans, leads a hermit-like existence cloistered from his fashionable contemporaries. Surrounding him are others equally cut off, sharing a nostalgic longing for the Middle Ages. There is a simply religious bell-ringer, a learned astrologer, a medical doctor versed in homeopath and occult lore, and a fourth person — a sheltered, unsatisfied bourgeois by day and mysterious succubus by night. They take refuge where they can from the forces of modern times — in a bell tower, in abstruse knowledge, and in diabolism.Huysmans' ability to mesmerize his readers with torrents of sound and image is itself suspiciously akin to the magic arts. His intoxication with the abominable and the depraved is magnified by his extreme sensitivity. He combines grimly realistic detail with esoteric knowledge, and searches relentlessly for the divine in the depths of evil and in the furthest reaches of human experience. The republication of this novel, along with the previous publication of Against the Grain, will make his works accessible to the larger audience that will surely find them both important and fascinating, as have Oscar Wilde, Havelock Ellis, and many other major literary figures.",
  "genres": [
    "Fiction",
    "Horror",
    "Classics",
    "France",
    "French Literature",
    "Gothic",
    "Literature"
  ],
  "author": "Joris-Karl Huysmans",
  "average_rating": "3.96",
  "url": "https://www.goodreads.com/book/show/315298.L_Bas"
}