{
  "title": "Diablo Nights",
  "description": "Alternate cover edition for ASIN: B00LCPG8PIA religious relic lures Emilia Cruz, Acapulco’s first and only female police detective, into a labyrinth of drug cartel smuggling and revenge killings in DIABLO NIGHTS, the third novel in the explosive Emilia Cruz Mexico mystery series. The relic, from Mexico’s Cristero War, also surfaces a long-hidden personal secret that Emilia cannot share with the man in her life, hotel manager Kurt Rucker. The relic’s authenticity is in doubt, however, as Emilia and her partner, senior detective Franco Silvio, find a murder victim aboard a cruise ship. The victim’s pockets are lined with Ora Ciega, a rare heroin strain from Colombia that promises more drug war violence for Acapulco’s already bloody streets. The Ora Ciega trail leads Emilia to a second body; that of Yolanda Lata, the mother of a girl for whom Emilia has been searching; as well as to a dead Customs official who had valuable information about the cruise ship murder. When stalkers shadow Emilia, the only conclusion is that she’s getting close to the Ora Ciega smugglers. Meanwhile, she's assigned to train a rookie detective with friends in high places. The destinies of Ora Ciega, the religious relic, the rookie, and the missing girl merge into a fateful trip into the hills above Mexico’s Costa Chica coast south of Acapulco. In a lonely place where vigilante groups have replaced civil authority and the crash of surf competes with gunshots, Emilia will face the biggest challenge of her police detective career. But it’s nothing compared to the shocking climax waiting for her back in Acapulco. Carmen Amato’s fans have been impatient for DIABLO NIGHTS, the third novel in the Emilia Cruz mystery series that goes inside Mexico's drug war with a fearless style and a woman who is hard to forget. It follows HAT DANCE, and CLIFF DIVER, the novel that Kirkus Reviews called “Consistently exciting . . . A clever Mexican detective tale that will leave readers eager for the series’ next installment.” Readers agree that Acapulco police detective Emilia Cruz joins John Rebus, Harry Hole, Arkady Renko, and Guido Brunetti as the international mystery genre’s most memorable crime fighters. MEET EMILIA CRUZ Detective Emilia Cruz is a good liar, a fast thinker, a determined investigator, and a mean kickboxer. An Acapulco native forced to grow up too fast, she’s been a cop for nearly 12 years and a detective for two; a strong woman in a squadroom that didn’t want her and is still trying to break her. But Emilia isn’t afraid to defend herself and get what she’s rightfully earned. She’s a Latina who knows that many women in Mexico don’t get the chances she’s had. The proof is in a log she tracks of women who have gone missing. But she doesn’t know how to handle gringo Kurt Rucker, the manager of a luxury hotel in Acapulco. A former U.S. Marine, he has the confidence and leadership qualities she admires. A triathlete, he’s calm under pressure and knows what he wants. But does Emilia?",
  "genres": [
    "Mystery",
    "Fiction",
    "Mystery Thriller",
    "Thriller",
    "Crime"
  ],
  "author": "Carmen Amato",
  "average_rating": "4.26",
  "url": "https://www.goodreads.com/book/show/31554201-diablo-nights"
}