{
  "title": "Finding Jaime",
  "description": "\"If I'd stood up for what I knew to be right, and not allowed myself to be bullied into suppressing who I really am, then I wouldn't be the huge fucking mess I am today. Well, I'm setting that straight. Now I don't give a damn because I know who I am. I know who I love is nobody's business but my own, and if anybody has a problem with it, then that's theirs, not mine. I can't change who I am any more than you can change the color of your eyes. You might be able to cover them up and make them appear different, but they're still the same underneath no matter what you do.\"Jaime knows deep down that there's something different about herself. Something that has been suppressed since childhood. Keeping her true feelings pressed down causes her to lead an unhappy life, with empty experiences that mean nothing to her.One night, all of that changes.Stumbling upon a secret club called 'House' introduces her to a world she's never given a single thought to. However, there she quickly understands that there's more to the club than meets the eye.She has the chance to learn how to be herself and to explore her own sexuality without the risk of others finding out before she's ready.One person is there for her every step of the way. A beautiful and mysterious woman known only as Butterfly guides her through her journey of self-discovery.But, when Jaime is ready to admit to her feelings, an accidental discovery sends her reeling.Will she forgive the betrayal from the one person she thought she could trust, or will she hang up her mask and hide away from her true self once more?Warning.This book contains scenes unsuitable for any person under the age of 18 years due to graphic sexual content, and bad language.",
  "genres": [
    "BDSM",
    "Romance",
    "Lesbian",
    "Erotica",
    "LGBT",
    "Contemporary",
    "Novella"
  ],
  "author": "P. Dawn",
  "average_rating": "4.22",
  "url": "https://www.goodreads.com/book/show/31553816-finding-jaime"
}