{
  "title": "The Black Sheep and The Rotten Apple",
  "description": "“How does one start a relationship with another man when it is forbidden?”“One needs to decide that the other man is worth dying for.”Cornwall, 1785Sir Evan Penhart. Baronet. Highwayman. Scoundrel. Julian Reece. Writer. Wastrel. Penniless.No one forces Julian Reece to marry. Not his father, not his brother. No one. When he is thrust into a carriage heading for London to meet his future bride, his way out comes in the form of an imposing highwayman, riding a horse as black as night. Julian makes a deal with the criminal, but what he doesn’t expect is that despite the title of baronet, the robber turns out to be no gentleman.Sir Evan Penhart is pushed into crime out of desperation, but the pact with a pretty, young merchant’s son turns out to have disastrous consequences. Not only is Evan left broke, but worse yet, Julian opens up a Pandora’s box of passions that are dark, needy, and too wild to tame. With no way to lock them back in, rash decisions and greedy desire lead to a tide that wrecks everything in its way.But Julian might actually like all the sinful, carnal passion unleashed on him. How can he admit this though, even to himself, when a taste of the forbidden fruit could have him end up with a noose around his neck? And with highway robbery being a hanging offense and the local constable on their back, Julian could lose Evan before he can decide anything about the nature of his desires.POSSIBLE SPOILERS:Themes: highwayman, abduction, ransom, forbidden love, self-discovery, danger, crime, Genre: Dark romance, historicalErotic content: Explicit scenesLength: ~140,000 words (standalone novel)WARNING: Adult content. Contains violence, distressing scenes, abuse, offensive language, and morally ambiguous protagonists.",
  "genres": [
    "Historical",
    "M M Romance",
    "Romance",
    "Historical Romance",
    "Historical Fiction",
    "Enemies To Lovers",
    "M M Historical Romance"
  ],
  "author": "K.A. Merikan",
  "average_rating": "3.90",
  "url": "https://www.goodreads.com/book/show/31554913-the-black-sheep-and-the-rotten-apple"
}