{
  "title": "The German Girl",
  "description": "Alternate cover edition of ASIN B01CO34EC0A young girl flees Nazi-occupied Germany with her family and best friend, only to discover that the overseas refuge they had been promised is an illusion in this debut novel.Before everything changed, young Hannah Rosenthal lived a charmed life. But now, in 1939, the streets of Berlin are draped with red, white, and black flags; her family’s fine possessions are hauled away; and they are no longer welcome in the places that once felt like home. Hannah and her best friend, Leo Martin, make a pact: whatever the future has in store for them, they’ll meet it together.Hope appears in the form of the S.S. St. Louis, a transatlantic liner offering Jews safe passage out of Germany. After a frantic search to obtain visas, the Rosenthals and the Martins depart on the luxurious ship bound for Havana. Life on board the St. Louis is like a surreal holiday for the refugees, with masquerade balls, exquisite meals, and polite, respectful service. But soon ominous rumors from Cuba undermine the passengers’ fragile sense of safety. From one day to the next, impossible choices are offered, unthinkable sacrifices are made, and the ship that once was their salvation seems likely to become their doom.Seven decades later in New York City, on her twelfth birthday, Anna Rosen receives a strange package from an unknown relative in Cuba, her great-aunt Hannah. Its contents will inspire Anna and her mother to travel to Havana to learn the truth about their family’s mysterious and tragic past, a quest that will help Anna understand her place and her purpose in the world.The German Girl sweeps from Berlin at the brink of the Second World War to Cuba on the cusp of revolution, to New York in the wake of September 11, before reaching its deeply moving conclusion in the tumult of present-day Havana. Based on a true story, this masterful novel gives voice to the joys and sorrows of generations of exiles, forever seeking a place called home.",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "World War II",
    "Historical",
    "Book Club",
    "Holocaust",
    "War"
  ],
  "author": "Armando Lucas Correa",
  "average_rating": "3.81",
  "url": "https://www.goodreads.com/book/show/31550413-the-german-girl"
}