{
  "title": "The House at Lobster Cove",
  "description": "He was Boston's largest taxpayer with little interest in civic affairs. He was listed in the Blue Book but joined no clubs. His magnificent dining room at Kragsyde, his house at Lobster Cove, rarely entertained visitors. If George Nixon Black was mentioned at all, it was almost as rumor. His greenhouses boasted rare plants, his collection of antiques and paintings were extraordinary and his patronage of the arts favored unknown female artists. Each winter he quietly boarded a luxury European-bound steamship with a man eighteen years his junior. Despite a privileged youth marred by violence and uncertainty, contrasted with the danger his lifestyle and secrets placed him in, his ability to obtain happiness and be himself was remarkable. While Black was probably content to slip away unnoticed, Kragsyde was to have no such fate. Garnering much attention when it was first built, and adored by architects and scholars ever since, the famous shingle-style house has made it impossible for Black to fully disappear. In The House at Lobster Cove, you will see behind the doors of Kragsyde, the house that sheltered and shaped him, and continued to tell his story long after both were gone. Using characters, letters and events from history, Jane Goodrich's first novel is part family saga and part love story, as well as an engaging personal journey for the author. Although Kragsyde was demolished in 1929, it was later rebuilt, in every detail, by Goodrich and her husband, doing all the work themselves on an island in Maine. A special feature of this edition is the letterpress printed cover and title page, hand printed on 100% cotton paper at the author's studios at Saturn Press in Maine.",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Book Club",
    "LGBT",
    "Architecture"
  ],
  "author": "Applewood Books",
  "average_rating": "4.23",
  "url": "https://www.goodreads.com/book/show/31546280-the-house-at-lobster-cove"
}