{
  "title": "The Big Spill",
  "description": "Mother Earth needs help, but at what cost?Experience the suspense and mystery of the latest in the best selling legal thriller series from the award winning author critics hail \"One of the strongest thriller writers on the scene.\" After a large oil spill threatens the coastline of Santa Barbara, Lawyer Brent Marks' girlfriend Rebecca takes on the big oil companies. Initial victories in her class action case lead to her all-out declaration of war against fossil fuels. When she turns up missing, a suspected victim of foul play, Brent finds himself questioning whether to continue with the case.What critics are saying about this action-packed legal \"Few writers in this legal thriller genre can match Kenneth Eade's creative ability to present facts in a way that with the help of his main character Brent Marks we can catch a glimpse in the legal intricacies around us. Said once and said again, Kenneth Eade is one of our strongest thriller writers on the scene and the fact that he draws his stories from the contemporary philosophical landscape is very much to his credit.\" Grady Harp, Amazon Hall of Fame, Top 100 and Vine Voice \"Eade, a lawyer by profession, weaves legal dialogue, corruption and international action to create a pacey read with echoes of Grisham, Baldacci and Clancy nipping at his writing heels. Law issues as well as forensics and police procedures are clearly explained with such authority as to add gritty realism in and out of the courthouse, but it's within the court drama that Eade really packs some punch. SPR ReviewWhat readers are saying about lawyer Brent Eade excels at the two most important aspects of writing, character development & the story line. To compare him to Grisham, Michael Connelly, Robert Crais, to name a few of my favorites, is not an understatement. The complexity of his characters & story lines in his novels is every bit as good as these \"big boys\" of the legal courtroom/ police procedural genres.\" Kristine Lovas \"Held my attention from the first page to the last. I would highly recommend this book and any others by Kenneth Eade.\" Diane G \"Expect the unexpected as the author takes you on one thrilling ride of plots, murder in this legal thriller that you won’t be able to put down.\" Cyn \"The twists and turns and the wondering who was guilty, guessing and second quessing at times. A great whodunnit novel.\"",
  "genres": [],
  "author": "Kenneth Eade",
  "average_rating": "3.93",
  "url": "https://www.goodreads.com/book/show/31553109-the-big-spill"
}