{
  "title": "The Thrice Cursed Mage: Volumes 1-3: Cursed, Marked, and Burned",
  "description": "This box set contains the first three novels in New York Times Bestselling Author, J.A. Cipriano's the Thrice Cursed Mage Series: Cursed, Marked, and Burned.Book 1: CursedMy name is Mac Brennan and that's the only thing I can remember about myself. Not why I woke up in a dumpster. Not why my right arm is as black as pitch and covered in glowing red tattoos, and certainly not why a vicious death cult is after me.Actually, that last part isn't true. I know why the death cult is after me. It's because I saved that damned girl from them. I didn't know who she was at the time, but I'd have done it anyway. I just don't like it when girls get beat up, call me old fashioned.Still, I can tell she's hiding something behind those devilish eyes, and if I want to find out what it is, I'll have to help her.My name is Mac Brennan. I have no memory, and I'm a werewolf-hunting, hellfire-flinging version of Faust himself.Book 2: MarkedPierce Ambrose. That was the name of the man I'd been sent to kill. The man I'd failed to kill. I have one day left to make good on my contract before the thugs holding my sister and her son start sending me pieces of them.Pierce Ambrose. A man with a secret I didn't uncover until it was too late to turn back, too late to give up on trying to kill him.Now, if I want to see my sister and nephew again, I have to try one last time.My name is Mac Brennan, and this time, I'm playing for keeps.Book 3: Burned My name is Mac Brennan, and I'm getting pretty sick of demons. For one, they're jerks. For two, they're ugly. For three, see points one and two.I should have known making a deal with a devil would end with me getting double-crossed, but what can I say, I'm an idiot who wanted his family back.That demon may have put an army between me and my family, but if I've learned anything these last few days, it's that you can kill anything if you shoot it enough times.And I've got a whole lot of bullets.*Book 1: Cursed (ASIN: B01BK6PW6Y) is on sale for only $0.99!**Book 4: Seized (ASIN: B01GGQF13C) is on sale for only $3.99!*",
  "genres": [],
  "author": "J.A. Cipriano",
  "average_rating": "4.60",
  "url": "https://www.goodreads.com/book/show/31556664-the-thrice-cursed-mage"
}