{
  "title": "Libertarian History",
  "description": "Supermodel (that's her on the cover) and Superwriter Lin Xun bares all in this book about history and the never-ending fight for liberty. She exposes anti-freedom schemes, including these (1) that the \"Pledge of Allegiance to the Flag\" was the origin of the Nazi salute and Nazi behavior; (2) that the military salute was the origin of the Nazi salute (via the military salute's use in the original Pledge of Allegiance) and; (3) Swastikas represented crossed \"S\" letter shapes for \"socialist\" under Hitler (three of the many astounding discoveries by avant-garde Political Scientist Dr. Rex Curry. The government calls Dr. Curry \"the man who knows too much\"). Each book is personally handled, wrapped, and mailed by Lin Xun (in the nude). Or by the publisher, depending on who's available. In this book, Lin spanks history's bottom, leaving red hand prints. Like a true patriot fashionista, she uses the flag as her own personal butt floss. The flag never objected. With a forward by the socialist Kim Jong-un, the book \"Libertarian History\" introduces readers to Anarchaeology, Misanthropology, and the Socialist Crusades, the Latest Socialist Dark Age, and the Modern Socialist Inquisitions, which resulted in the Wholecaust (of which the Holocaust was a part). Adolf Hitler, Joseph Stalin, Mao Zedong and other socialists are exposed along with the influence of socialists in the United States upon those criminals. Author Lin Xun is part of the Pointer Institute for Media Studies, as well as the Dead Writer's Club (\"DWC\" -an author's group). Lin and the Pointer Institute provide remedial education to journalists about history, economics, government, and more. They untangle those twelve years of brainwashing that cripples news reporters. In their fight against media incompetency, the DWC joined with the Pointer Institute in 2016 to shut down the Tampa Tribune Newspaper. As part of the Dead Writers Club (DWC), Lin has collaborated with the authors Micky Barnetti and Matt Crypto. Another volume by the Dead Writers Club is \"Drug Detection Dog Training -Libertarian Lawyers Fight Police State USA.\" It is also available where fine books are sold. Lin \"Students in government schools (socialist schools) should not drink the Kool-Aid every morning.\" For those who have, Lin's book contains the antidote. In her star-spangled writing, Lin shows you how to save yourself from the cult of the omnipotent state! [dramatic musical flourish]",
  "genres": [],
  "author": "Lin Xun",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/31561218-libertarian-history"
}