{
  "title": "And Still She Laughs: Defiant Joy in the Depths of Suffering",
  "description": "Kate Merrick examines the Bible’s gritty stories of resilient women as well as her own experience losing a child—a journey followed by more than a million on prayfordaisy.com—to reveal the reality of surprising joy and deep hope even in the midst of heartache. Is it possible live fully—even joyfully—in the middle of overwhelming pain? In the excruciating aftermath of her young daughter’s death from cancer, Kate Merrick struggled to find a way to live. Not just to survive or go through the motions, but to live fully. Faithfully. With real joy amid inevitable tears. To discover how, Kate delved into the stories in the Bible of real women who suffered deeply and emerged somehow joyful. How did Sarah, after twenty-five years of achingly empty arms, learn to laugh without bitterness? How did Bathsheba, defiled by the king who then had her husband killed, come to walk in strength and dignity, to smile without fear of the future? In her encounters with these heroines of the faith, Kate discovered how to have contentment—and even joy—whatever the circumstances. By turns heartbreaking and humorous, And Still She Laughs reveals the secret to finding hope in the midst of devastation. In the end, no matter what hardships we face, we can smile, cry, and come away full—laughing without fear and eagerly looking for what is to come. “ And Still She Laughs is the terrifying, tearful, heartbreaking, heart healing and humorous, definitive true story of survival and triumph.” —Kathy Ireland, chair of Kathy Ireland Worldwide “Kate Merrick is one of those women that I always wish I had more time with—her honesty, sincerity, and messy straightforwardness are different, in the very best way. Her book, And Still She Laughs , is the same way. It’s one of those books I will keep coming back to it for truth and inspiration.” —Lindsey Nobles, COO of the",
  "genres": [
    "Christian",
    "Nonfiction",
    "Faith",
    "Memoir",
    "Biography Memoir",
    "Biography",
    "Spirituality"
  ],
  "author": "Kate Merrick",
  "average_rating": "4.37",
  "url": "https://www.goodreads.com/book/show/31563922-and-still-she-laughs"
}