{
  "title": "I'd Die for You and Other Lost Stories",
  "description": "A collection including the last complete unpublished short stories by F. Scott Fitzgerald, the iconic American writer of The Great Gatsby who is more widely read today than ever.I’d Die For You is a collection of the last remaining unpublished and uncollected short stories by F. Scott Fitzgerald, edited by Anne Margaret Daniel. Fitzgerald did not design the stories in I’d Die For You as a collection. Most were submitted individually to major magazines during the 1930s and accepted for publication during Fitzgerald’s lifetime, but were never printed. Some were written as movie scenarios and sent to studios or producers, but not filmed. Others are stories that could not be sold because their subject matter or style departed from what editors expected of Fitzgerald. They date from the earliest days of Fitzgerald’s career to the last. They come from various sources, from libraries to private collections, including those of Fitzgerald’s family.Readers will experience Fitzgerald writing about controversial topics, depicting young men and women who actually spoke and thought more as young men and women did, without censorship. Rather than permit changes and sanitizing by his contemporary editors, Fitzgerald preferred to let his work remain unpublished, even at a time when he was in great need of money and review attention.“I’d Die For You,” the collection’s title story, is drawn from Fitzgerald’s stays in the mountains of North Carolina when his health, and that of his wife Zelda, was falling apart. With the addition of a Hollywood star and film crew to the Smoky Mountain lakes and pines, Fitzgerald brings in the cinematic world in which he would soon be living. Most of the stories printed here come from this time period, during the middle and late1930s, though the collection spans Fitzgerald’s career from 1920 to the end of his life.The book is subtitled And Other Lost Stories in recognition of an absence until now. Some of the eighteen stories were physically lost, coming to light only in the past few years. All were lost, in one sense or another: lost in the painful shuffle of the difficulties of Fitzgerald’s life in the middle 1930s; lost to readers because contemporary editors did not understand or accept what he was trying to write; lost because archives are like that, and good things can wait patiently in libraries for many centuries sometimes. I’d Die For You And Other Lost Stories echoes as well the nostalgia and elegy in Gertrude Stein’s famous phrase “a lost generation,” that generation for whom Fitzgerald was a leading figure.Written in his characteristically beautiful, sharp, and surprising language, exploring themes both familiar and fresh, these stories provide new insight into the bold and uncompromising arc of Fitzgerald’s career. I’d Die For You is a revealing, intimate look at Fitzgerald’s creative process that shows him to be a writer working at the fore of modern literature—in all its developing complexities.",
  "genres": [
    "Short Stories",
    "Classics",
    "Fiction",
    "American",
    "Adult Fiction",
    "Literature",
    "American Fiction"
  ],
  "author": "F. Scott Fitzgerald",
  "average_rating": "3.75",
  "url": "https://www.goodreads.com/book/show/31572168-i-d-die-for-you-and-other-lost-stories"
}