{
  "title": "Semi-Twisted",
  "description": "Dying really has a way of making a girl rethink her life choices. Mischa Bartone was a runner. Running from anything that made her feel too much was kind of her thing. But not even an expert runner like Mischa could escape death. And when the only man who’d ever made her consider not running brought her back as a vampire…well, let’s just say she didn’t exactly handle it gracefully. Giving the love of his life immortality didn’t go exactly as Hunter had hoped. As if having her push him away wasn’t punishment enough, he also ended up in prison for turning her without her written consent. And after months on the inside with no contact, he could only assume she was well and truly over him. So what if the memory of her consumed his every waking thought? That was his problem; he’d deal with it. Time to stop chasing Mischa Bartone once and for all. But when Mischa and Hunter are thrown together on a case for a very pregnant Harper Hall, sparks fly—and it doesn’t take Mischa long to realize that letting Hunter go had been a huge mistake, the biggest of her life (er, undeath?). Time to stop running and fight for what—and who—she wants. So, all she has to do is go undercover in the Miss Eternity vampire beauty pageant, find a couple of missing former contestants, stop a sicko stalker with a penchant for floral metaphors, complete her court-mandated vampire therapy sessions, and win back the man (er, vampire) she loves. In heels. And a skeezy pageant swimsuit. Easy, right? Yeah, not so much. Semi-Twisted works best if read as part of the Harper Hall Investigations series (Book 1: Semi-Charmed; Book 2: Semi-Human). This book is intended for mature audiences. This book is not intended for anyone who doesn’t enjoy smart, potty-mouthed heroines and dark, brooding heroes, and who doesn’t appreciate a plethora of nerdy pop culture references. For the rest of you: happy reading!",
  "genres": [
    "Paranormal",
    "Romance",
    "Urban Fantasy",
    "Vampires",
    "Fantasy",
    "Humor",
    "Enemies To Lovers"
  ],
  "author": "Isabel Jordan",
  "average_rating": "4.24",
  "url": "https://www.goodreads.com/book/show/31557748-semi-twisted"
}