{
  "title": "An Economic History of the World since 1400",
  "description": "Length: 24 hrs and 29 minsMost of us have a limited understanding of the powerful role economics has played in shaping human civilization. This makes economic history - the study of how civilizations structured their environments to provide food, shelter, and material goods - a vital lens through which to think about how we arrived at our present, globalized moment.Designed to fill a long-empty gap in how we think about modern history, these 48 lectures are a comprehensive journey through more than 600 years of economic history, from the medieval world to the 21st century. Aimed at the layperson with only a cursory understanding of the field, An Economic History of the World since 1400 reveals how economics has influenced (and been influenced by) historical events and trends, including the Black Death, the Age of Exploration, the Industrial Revolution, the European colonization of Africa, the collapse of the Soviet Union, and the birth of personal computing. Professor Harreld has crafted a riveting, centuries-long story of power, glory, and ideology that reveals how, in step with history, economic ideas emerged, evolved, and thrived or died.Along the way, you'll strengthen your understanding of a range of economic concepts, philosophies, trends, treaties, and organizations, including the mercantile system, Adam Smith's The Wealth of Nations, Marxist economics, African independence movements, and the formation of economic organizations including the European Union. You'll also consider provocative questions about the intersection of history and economics. What did the economies of Roosevelt's America and Hitler's Germany have in common? What does history tell us about how nations should dictate economic policy? Can we say that free trade is truly free?Marvel at just how much we still have to learn about the economic forces that have dictated our past - and that will dictate our future.Listening Length: 24 hours and 29 minutes",
  "genres": [
    "History",
    "Economics",
    "Nonfiction",
    "Audiobook",
    "Finance",
    "Business",
    "The World"
  ],
  "author": "Donald J. Harreld",
  "average_rating": "3.88",
  "url": "https://www.goodreads.com/book/show/31572231-an-economic-history-of-the-world-since-1400"
}