{
  "title": "Hercules My Shipmate",
  "description": "Reissued by Creative Age Press in 1945 as Hercules, My Shipmate, a novel about the voyage of the Argo. Written with ideas on The White Goddess as a cultural/anthropological backdrop to the ancient Greek tale. What the Golden Fleece really was—a cloak tossed to earth by a drunken Zeus, a sheepskin book of alchemic secrets or the gilded epidermis of a young human sacrifice named Mr. Ram—nobody knows. But Graves is quite sure that, whatever the Golden Fleece was, the voyage of Jason & his Argonauts really happened. His story shows the legendary cruise as one of the bawdiest, bloodiest, most boisterous expeditions of all time.  In I, Claudius & its Claudius the God sequel, Graves brought the teeming life of Claudian Rome so vividly alive that they became bestsellers. In the not-so-successful Wife to Mr. Milton, his blend of imagination & scholarship projected his readers into 17th-Century England & the bedchamber temper tantrums of the blind poet-politician.  With Hercules & shipmates, Graves becomes an ancient Greek, moving among demigods & goddesses, myths & monsters with an easy familiarity & a wealth of erudite detail. Both sometimes seem too much of a good thing. Atomic-age readers, ill-attuned to the leisurely, formal talk of myth-age Greeks, may find themselves skipping some of the longer speeches.  Most of the Argo's 50-oar crew were princes, each with a special talent & gift of the gods. The only woman aboard was a princess: Atalanta of Calydon, a virgin huntress who could outrun any man in Greece. Argus, who built the Argo, was the world's finest shipwright. Castor & Pollux, sons of Leda & Zeus-as-swan, were champion prizefighters. Nauplius, Poseidon's son, was an unrivaled navigator. Orpheus could make sticks & stones dance to his lyre. Hercules of Tiryns was the world's strongest man. He would've captained the Argonauts were it not that in moments of insanity he murdered friend & foe alike.  Captaincy devolved on Jason of lolcos—a man nobody liked or trusted, but who had a power denied to all the others: women instantly fell in love with him. Even surly Hercules agreed it a quality worth all the rest.  Backed by divine blessings & equinoctal winds, the Argonauts set sail. On the Island of Lemnos, peopled solely by women, they generously stopped off to help out with spring sowing. Nine months later, 200 children were born, of whom no less than 60 were said to be the spitting image of Hercules.  On Samothrace, they were initiated into the sacred mysteries. The Goddess of All Being mated with the Serpent Priapus to be delivered of a bull. Then the sacred nymphs leapt on them & scratched & bit until even Hercules passed out. Thereafter, the Argonauts glowed with \"a faint nimbus of light.\"  The Argonauts boldly pushed on thru the dread Hellespont & entered the Black Sea. To their dismay, Hercules deserted, summoned home to perform another of his mighty labors. \"Holy Serpents!\" he growled. \"Tell me what this time?\" The job—cleaning the Augean Stables—didn't take long. He stayed around afterwards with the Lydian high priestess—who in due time bore male triplets. In gratitude, she taught him to spin, tying up his hair in blue braids. He was crazy about it, admitting confidentially he'd always wanted to be a woman. The Argonauts went on without Hercules. Reaching Colchis, Aphrodite won the Fleece for them. She made her son Eros wait behind a pillar with his bow until handsome Jason strode into the King of Colchis' palace. Eros shot Medea thru the heart, & the smitten princess helped to get the Fleece from her father's temple. Mythology's most famous voyage had reached its goal, but Graves takes 150 more pages to wind things up.",
  "genres": [
    "Mythology",
    "Historical Fiction",
    "Fiction",
    "Classics",
    "Fantasy",
    "Greek Mythology",
    "Greece"
  ],
  "author": "Robert  Graves",
  "average_rating": "4.06",
  "url": "https://www.goodreads.com/book/show/3157203-hercules-my-shipmate"
}