{
  "title": "Beartown",
  "description": "From the New York Times bestselling author of A Man Called Ove, My Grandmother Asked Me To Tell You She’s Sorry, and Britt-Marie Was Here, comes a poignant, charming novel about a forgotten town fractured by scandal, and the amateur hockey team that might just change everything.Winning a junior ice hockey championship might not mean a lot to the average person, but it means everything to the residents of Beartown, a community slowly being eaten alive by unemployment and the surrounding wilderness. A victory like this would draw national attention to the ailing town: it could attract government funding and an influx of talented athletes who would choose Beartown over the big nearby cities. A victory like this would certainly mean everything to Amat, a short, scrawny teenager who is treated like an outcast everywhere but on the ice; to Kevin, a star player just on the cusp of securing his golden future in the NHL; and to Peter, their dedicated coach whose own professional hockey career ended in tragedy.At first, it seems like the team might have a shot at fulfilling the dreams of their entire town. But one night at a drunken celebration following a key win, something happens between Kevin and the coach’s daughter—and the next day everything seems to have changed. Accusations are made and, like ripples on a pond, they travel through all of Beartown, leaving no resident unaffected. With so much riding on the success of the team, the line between loyalty and betrayal becomes difficult to discern. At last, it falls to one young man to find the courage to speak the truth that it seems no one else wants to hear.Fredrik Backman knows that we are forever shaped by the places we call home, and in this emotionally powerful, sweetly insightful story, he explores what can happen when we carry the heavy weight of other people's dreams on our shoulders.",
  "genres": [
    "Fiction",
    "Contemporary",
    "Book Club",
    "Audiobook",
    "Sports",
    "Literary Fiction",
    "Adult"
  ],
  "author": "Fredrik Backman",
  "average_rating": "4.29",
  "url": "https://www.goodreads.com/book/show/31572155-beartown"
}