{
  "title": "Finishing Machine",
  "description": "The true story of UFC fighter veteran Gerald “The Finishing Machine” Strebendt, who in 2014 shot and killed an unarmed man after a minor traffic accident. Police called it road rage. Gerald’s attorneys called a press-conference, taking a unique step in a high-profile case in changing the narrative. Within days, self-defense became the key media issue and Gerald awaited a charging decision by the Oregon prosecutor. Charge: Murder with a Firearm, and thus began the next stage of Gerald’s life. He had served the Marine Corps proudly as a Marine sniper. He had done two tours of duty in Afghanistan as a Blackwater mercenary. He had fought mixed martial arts professionally and had a successful MMA-training gym. However, the next stage of his life was a fight for justice and a fight for his life. Was it going to be a murder conviction and a life in prison? Many in the community wanted that, claiming that a trained killer like Gerald Strebendt couldn’t possibly need to shoot an unarmed 55-year-old man. But the truth was much more nuanced.“Finishing Machine” is a book about choices. Gerald made choices in his life to fight and compete. Some of these instincts carried on in his post-Blackwater life when he was accused of years of prior road rage incidents that the Oregon prosecutor wanted to introduce as evidence at his trial. His attorneys, Mike Arnold and Emilia Gardner, set out to disprove these allegations and get to the truth with science. Gerald also made a choice that night to shoot rather than to run or fight. Written from the perspective of Gerald’s lead counsel Mike Arnold, the authors’ book takes the reader on a journey of the goings-on in a defense attorney’s mind. Does he doubt his client’s story? How does he deal with surprising evidence? Can he stay the impartial advocate? Does the judge’s gag order turn the case into a secret tribunal at Gerald’s detriment or does it allow him access to the justice the law requires? Does science say it was a minor traffic accident or a dramatic crash caused by a crazy man? And if so, who was the crazy man, Gerald or his victim?Live the tension of the attorneys and the accused yourself by stepping into the mind of a criminal defense attorney and into the mind of the Finishing Machine.",
  "genres": [
    "Nonfiction"
  ],
  "author": "Mike  Arnold",
  "average_rating": "4.07",
  "url": "https://www.goodreads.com/book/show/31566732-finishing-machine"
}