{
  "title": "Dogs, Dog Food, and Dogma",
  "description": "Recent research suggests that obesity is deadlier for a dog than a lifetime of smoking is for a human being. And yet, incredibly, more than half of the dogs in America today are overweight. We love our dogs as never before in history, but we're still allowing millions of them to die every year from this completely preventable disease.How in the world could that be? Who is to blame? And what can be done to stop the epidemic?Those questions and more are examined in Dogs, Dog Food, and Dogma, Daniel Schulof’s rigorous and in-depth investigation of America’s canine obesity epidemic. With clarity and care, Schulof dissects the published scientific literature on canine obesity and explains why so much of what the veterinary community thinks it knows about the topic has in fact been manipulated by the pet food industry and cast into doubt through fascinating new scientific research.Schulof documents his investigation in an engrossing memoir-style narrative, one featuring all the joy and heartbreak that ordinarily accompanies pet ownership in America today. With his Rottweiler Kody in tow, he takes readers along to some fascinating places—the wilds of Montana where biologists study grey wolves, the factories where corn and animal byproducts are transformed into pet foods, the world championships of canine athletics competitions, and the classrooms where rising veterinarians are taught nutrition using textbooks written by dog food manufacturers—in a quest to uncover the truth about this deadly and perplexing epidemic.A must-read for any smart, scientifically minded pet-owner, Dogs, Dog Food, and Dogma is a first-of-its-kind exposé of one of the most pressing, scandalous, and underappreciated animal welfare crises of our time. It is a book certain to permanently alter the culture of dog ownership in America.",
  "genres": [
    "Nonfiction",
    "Animals"
  ],
  "author": "Daniel Schulof",
  "average_rating": "4.80",
  "url": "https://www.goodreads.com/book/show/31575105-dogs-dog-food-and-dogma"
}