{
  "title": "Throttle's Seduction",
  "description": "Throttle, Road Captain of the Insurgents Motorcycle Club, likes his women willing, stacked, and no strings attached.   His life and needs are simple: riding his Harley, bedding as many women as can fit in his bed, and scorching his throat with whiskey. The tall, rugged outlaw is a magnet for women who love life on the wild and dangerous side. They know not to expect anything from the tattooed biker but sheer pleasure.  Life couldn’t be better.  Until he meets Kimber. The black-haired mechanic at Hawk’s bike shop. What the f@#k? In his world, the only thing a woman should do on a Harley is spread her pretty legs wide.  She is sassy-mouthed, aggravating, and not his type at all. And he doesn’t need any woman—let alone a chick in mechanic coveralls—messing with his head.  It’s a shame all he can think about is doing nasty things to her on his motorcycle.  Kimber Descourts has had to fight to be accepted in a man’s world and she is not a quitter. Always attracted to the bad boy biker, she has had her share of unfaithful, jerk boyfriends. Swearing off all bikers since her last boyfriend made her his punching bag, she’s content with working on Harleys, taking a few business classes, and being blissfully alone.  Then she meets Throttle.  He’s a cocky, chauvinistic bastard. Oh yeah… he’s also incredibly handsome, built, and sexy as all hell. He’s exactly her type. She should run far away from him, but her body wants him in the worst way.  They say opposites attract, but when a hardened biker and a tough free-spirit ignite, their world combusts. Will their differences bring them together or pull them apart?  In the midst of Throttle and Kimber’s tug of war, a Peeping Tom has been creeping around Pinewood Springs watching ladies behind the shadows of the night. He spots Kimber Descourts and is drawn to her. And he’s beginning to grow bored of just watching….  Can Kimber put her pride aside and ask for Throttle’s help? Is Throttle ready to let the feisty mechanic melt his icy heart?  The Insurgents MC series are standalone romance novels. This is Throttle and Kimber’s love story. This book contains violence, sexual assault (not graphic), strong language, and steamy/graphic sexual scenes. It describes the life and actions of an outlaw motorcycle club. If any of these issues offend you or are triggers, please do not read the book. HEA. No cliffhangers! The book is intended for readers over the age of 18.",
  "genres": [
    "Romance",
    "Contemporary Romance",
    "Suspense",
    "BDSM",
    "Dark",
    "Contemporary",
    "Erotica"
  ],
  "author": "Chiah Wilder",
  "average_rating": "4.38",
  "url": "https://www.goodreads.com/book/show/31578892-throttle-s-seduction"
}