{
  "title": "The Big Fat Duck Cookbook [Import Edition]",
  "description": "In this enormous, beautiful book, we hear the full story of the meteoric rise of Heston Blumenthal and The Fat Duck, birthplace of snail porridge and bacon-and-egg ice cream, and encounter the passion, perfection and weird science behind the man and the restaurant. Heston Blumenthal is widely acknowledged to be a genius, and The Fat Duck has twice been voted the Best Restaurant in the World by a peer group of top chefs. But he is entirely self-taught, and the story of his restaurant has broken every rule in the book. His success has been borne out of his pure obsession, endless invention and a childish curiosity into how things work - whether it's how smell affects taste, what different flavours mean to us on a biological level, or how temperature is distributed in the centre of a souffle. In the first section of The Big Fat Duck Cookbook, we learn the history of the restaurant, from its humble beginnings to its third Michelin star (the day Heston received the news of this he had been wondering how exactly he would be able to pay his staff that month). Next we meet 50 of his signature recipes - sardine on toast sorbet, salmon poached with liquorice, hot and iced tea, chocolate wine - which, while challenging for anyone not equipped with ice baths, dehydrators, vacuum pumps and nitrogen on tap, will inspire home cooks and chefs alike. Finally, we hear from the experts whose scientific know-how has contributed to Heston's topsy-turvy world, on subjects as diverse as synaesthesia, creaminess and flavour expectation. With an introduction by Harold McGee, incredible colour photographs throughout, illustrations by Dave McKean, multiple ribbons, real cloth binding and a gorgeous slip case, The Big Fat Duck Cookbook is not only the nearest thing to an autobiography from the world's most fascinating chef, but also a stunning, colourful and joyous work of art.",
  "genres": [
    "Cookbooks",
    "Cooking",
    "Food",
    "Culinary",
    "Reference",
    "Nonfiction"
  ],
  "author": "Heston Blumenthal",
  "average_rating": "4.58",
  "url": "https://www.goodreads.com/book/show/3158083-the-big-fat-duck-cookbook-import-edition"
}