{
  "title": "Crevice",
  "description": "Christian Themes and Edge-Of-Your-Seat Suspense Make Up Book One In The 'Earth Hunters' SeriesDesperate to save her family’s gold mine, Elery Hearst gives an order that results in the tragic death of one of her men. But before she can come to terms with the guilt consuming her, her brother disappears. To find him, she must find the legendary Lost Dutchman gold mine. And the one person who can help, Lucan Milner, has every reason to want her to fail; he’s the twin brother of the miner who died. He holds the secret to finding Elery’s brother, but sharing it with her not only rips open his grief-stricken heart, it puts both of them in the path of a killer.For more great WildBlue Press reads, visit our website at wildbluepress.comAn intriguing and modern tale around the legend of the Lost Dutchman Mine. This debut novel has adventure, romance, and an insightful spiritual thread that readers will enjoy. — Marissa Shrock, author of THE FIRST PRINCIPLE and THE LIBERATION\"Vivid geological details and a hundred-year-old legacy of heartache tie together two wounded souls on a rescue mission through the treacherous beauty of the Arizona desert. A scavenger hunt of clues leads the unlikely pair on a journey of faith, forgiveness, and love all infinitely more valuable than the fabled gold mine they seek. Refreshingly original, Boekhoff's treasure hunt of legends and intrigue will leave you tantalizingly infected with gold fever! An adventure not to be missed! —Amy Leigh Simpson, author of the Girl Next Door SeriesGet ready for an emotional, action-packed adventure through the Arizona desert. Part rescue mission, part treasure hunt, Crevice weaves local legend with modern day greed in this story of forgiveness and redemption. Boekhoff keeps the tension high until the nail-biting ending. A stunning debut! —Jill Kemerer, author of HER SMALL-TOWN ROMANCE and UNEXPECTED FAMILYAuthor Janice Boekhoff is a former Research Geologist who pours her love of science and the outdoors into her suspense novels. She is a three-time finalist in the ACFW Genesis Contest. She writes from Iowa, where she lives with her amazing husband and three feisty kids.",
  "genres": [
    "Mystery",
    "Thriller"
  ],
  "author": "Janice Boekhoff",
  "average_rating": "4.48",
  "url": "https://www.goodreads.com/book/show/31587653-crevice"
}