{
  "title": "THE GREAT TRANSFORMATION : The World in the Time of Buddha, Socrates, Confucius and Jeremiah",
  "description": "\"In the ninth century BCE, the peoples of four distinct regions of the civilized world created the religious and philosophical traditions that have continued to nourish humanity to the present day: Confucianism and Daoism in China, Hinduism and Buddhism in India, monotheism in Israel, and philosophical rationalism in Greece. Later generations further developed these initial insights, but we have never grown beyond them. Rabbinic Judaism, Christianity, and Islam, for example, were all secondary flowerings of the original Israelite vision. Now, in The Great Transformation, Karen Armstrong reveals how the sages of this pivotal \"Axial Age\" can speak clearly and helpfully to the violence and desperation that we experience in our own times.\" \"Armstrong traces the development of the Axial Age chronologically, examining the contributions of such figures as the Buddha, Socrates, Confucius, Jeremiah, Ezekiel, the mystics of the Upanishads, Mencius, and Euripides. All of the Axial Age faiths began in principled and visceral recoil from the unprecedented violence of their time. Despite some differences of emphasis, there was a remarkable consensus in their call for an abandonment of selfishness and a spirituality of compassion. With regard to dealing with fear, despair, hatred, rage, and violence, the Axial sages gave their people and give us, Armstrong says, two important pieces of advice: first there must be personal responsibility and self-criticism, and it must be followed by practical, effective action.\" In her introduction and concluding chapter, Armstrong urges us to consider how these spiritualities challenge the way we are religious today. In our various institutions, we sometimes seem to be attempting to create exactly the kind of religion that Axial sages and prophets had hoped to eliminate. We often equate faith with doctrinal conformity, but the traditions of the Axial Age were not about dogma. All insisted on the primacy of compassion even in the midst of suf",
  "genres": [
    "Religion",
    "History",
    "Nonfiction",
    "Philosophy",
    "Spirituality",
    "Theology",
    "Judaism"
  ],
  "author": "Karen Armstrong",
  "average_rating": "4.04",
  "url": "https://www.goodreads.com/book/show/3157377-the-great-transformation"
}