{
  "title": "Academia of the Beast",
  "description": "NY Times bestselling author, K.N. Lee presents a dark twist on a classic fairy-tale that asks the question: what if the beauty was the mortal enemy of the beast? Raised in fear of her power. Sold and betrayed by her lover. Allyn escaped the hunters once before. As a witch, she risks capture every day. Now, she lives in the slums of the opulent kingdom of Elastria, where the Winter Winds are brutal, and force everyone into their homes for the entire season. When one of her best friends receives an invitation to the end of season Winter Ball, Allyn would rather sulk about her boyfriend leaving her instead of partying at the most exclusive club in the kingdom.  A chance encounter with the crown prince of Elastria sparks hope for a brighter future, one where she might find true love. All hopes are dashed when she's tricked by her ex-boyfriend and turned in for the bounty on her head. Now, a prisoner in an eerie castle where the servants are...peculiar, the walls whisper, and the prince's mysterious twin brother struggles with the decision to keep or kill the witch he's hunted and once lost, Allyn struggles with the desire to tame the beast within the prince, or escape to freedom. The curse of the castle is strong. But, the magic hiding inside Allyn might be more powerful than she or the prince realized. Discover an enchanted world of witches and a cursed prince in this steamy modern retelling of Beauty and the Beast Praise for Academia of the Beast: \"Wow, I think is the best interpretation of Beauty and the Beast I have ever read.\" Kristin, Amazon Reviewer  \"Since I am no longer a child and have not been for many years I am all for adult stories of my favorite ones. Both times the show has been on I have watched it so when I run across versions I grab them. This one intrigued me the most so far.\" Denise Van Plew- Top Amazon Reviewer  \"Forget what you've known about the beauty and the beast, this story takes a twist, a great one,and makes it into a much better version. Magic, fairies, wolves, ghosts,and witches, what more could you ask for? How about a woman dead set on making it through the whole ordeal?\" Katie Perry Rogers Scroll up and buy a copy today! **WARNING: Contains explicit adult situations and dark imagery not suitable for children**",
  "genres": [
    "Fantasy",
    "Romance",
    "Beauty and The Beast",
    "Adult",
    "Paranormal",
    "Fairy Tales",
    "Retellings"
  ],
  "author": "K.N. Lee",
  "average_rating": "3.38",
  "url": "https://www.goodreads.com/book/show/31624762-academia-of-the-beast"
}