{
  "title": "Living Well: Six Pillars for Living Your Best Life",
  "description": "Living Well  is written for many types of readers. At the most basic level (or if you're really pressed for time!), you could jump toward the end of each chapter where I give a \"Prescription.\" This would give you all the reasoning and background information, but the recommendations would still work. Others may be interested in the intriguing science behind the recommendations and the many finer points. I've done my best to keep the information accessible and not too technical. At the same time, there are some amazing revelations about how our bodies really work. So, for those readers who, like me, are fascinated by how our bodies work and revel in understanding more, I've tried to strike a balance with telling the real story. Often there are fine points in the details that may be more applicable to one reader's goals and circumstances than another's.  This book also includes a reference guide of sources that you can read in full. Most of these are easily accessible over the Internet. Throughout the book, I carefully document the scientific studies that inform my opinions. The vast majority of the references in this book are from scientific research studies published in peer-reviewed scientific or medical journals. These primary sources are the gold standard in research. Additionally, there are references to articles in highly respected publications such as  The New York Times ,  The Guardian , and  Salon.com . All references are listed in the reference section and nearly all of them are available online, just a Google search away. If you have any questions about a given citation--or just want to learn more about the fascinating topics, these are easy to access from a web browser. In these pages, you'll find prescriptive actions that you can adopt into your life. Several of these key take-aways are summarized in colorful graphics at the chapter's end. These are in part inspired by the some of the people I have met through my nutrition practice and in stores across the country and around the world. These proactive people range all over the demographic map - an otherwise healthy 75 year old woman with osteoporosis who wants to stay out of a wheelchair, a 16 year old young man desperate to put on some muscle to make the team, a 24 year old woman anxious to have a healthy baby, a collegiate triathlete currently ranked #2 who wants to make the Olympic team, a 52 year old guy who gets up too many times at night - but they share a common thread. They had a goal and weren't sitting around waiting for someone else to do something for them. They were systematically and proactively figuring out their own prescription for living well. Finally, I've included a section at the end of some of the Pillars called \"Supplement Support\" that discusses nutritional supplements that can support the area the chapter covers. I've spent my entire working career working to advance nutrition products with clinical support for specific health benefits, a fascinating field that is still in its infancy and developed hundreds of science-based nutrition products from infant formula additives to clinical nutrition products in a hospital setting to dietary supplements to consumer products such as functional beverages. However, I have been extremely judicious in the supplements that I recommend in this book. Some readers who are already living clean and eating well may not need supplements. When I do recommend nutritional supplements, it is to share some compelling research on micro-nutrition as it relates to specific health benefits. As you read the book,you'll see many areas where the science and recommendations of one Pillar overlap into those of another. That's because our health and well being relies on many interrelated factors.",
  "genres": [],
  "author": "Greg  Horn",
  "average_rating": "3.60",
  "url": "https://www.goodreads.com/book/show/31626402-living-well"
}