{
  "title": "The Defenestration of Bob T. Hash III",
  "description": "In a picture-postcard town, in the sunny suburban home of Bob T. Hash III, something altogether strange and amazing has An African gray parrot (and beloved pet) named Comenius has suddenly and unexpectedly transformed into a man. It seems this unassuming exotic bird, heretofore content to mind its own business, has miraculously metamorphosed into the spitting image of his unsuspecting master, Bob T. Hash III–right down to the smartly pressed suit, dashing necktie, and sensible horn-rims.As luck (or some darker design?) would have it, no one witnesses this astonishing feat of shapeshifting. And in a serendipitous twist of fate (luck’s fickle cousin), the genuine Bob T. Hash III–having apparently absconded to Acapulco with his charming assistant–is conveniently AWOL. Thus the coast is clear for the puzzled (but not entirely displeased) parrot to exit the wings and do what parrots do imitate their owners–a charade the avian impostor rises to effortlessly, slipping with nary a misstep into the shoes, the career, and even the marital bed (!) of Bob T. Hash III. But when, having taken the reins as CEO of the Acme International Institute of Languages, he stumbles upon a heinous act of corporate (and grammatical) sabotage, Comenius begins to suspect he’s being stalked–by himself–and it suddenly looks as if his best laid plans might just be heading south.Think Kafka, inverted, upended, and gleefully reverse-engineered by Monty Python. Think Borges, deconstructed by Lewis Carroll and reassembled with spare parts scavenged from The New Yorker and MAD. Analogies abound, yet nothing can truly compare to the comic broadsides, dazzling wordplay, cheeky wit, and wholly original flights of imagination working their magic in David Deans’s inventive new novel.",
  "genres": [
    "Fiction",
    "Humor"
  ],
  "author": "David Deans",
  "average_rating": "2.66",
  "url": "https://www.goodreads.com/book/show/3161243-the-defenestration-of-bob-t-hash-iii"
}