{
  "title": "Scythe",
  "description": "Previous cover edition for ASIN 9781945723049For alternate cover edition go hereTruth time. I go to a Learning Squirrel High School. Don’t judge. On second thought, judge away. Learning Squirrel is one step above attending class in a junkyard. But what do you expect? Everything’s made out of garbage these days. At least, I have my freelance work to keep Mom and me housed, clothed, and fed. How? I’m your regular high school science geek for hire… only my work manipulates space-time. These gigs pay really well, but the government wants people like me dead. Good thing I’m super careful about hiding from their detection systems.Then I screw up a job. Badly. My house slips into two-dimensional space-time. It only lasts for a few seconds, but the move still sets off about a dozen government alarms. If they track me down, Mom and I are good as dead. Long story short, I need to pay someone off, hide the evidence, and keep us safe.Unfortunately, that means asking the Scythe for help. He runs the local underground crime scene and has absolutely no conscience. Or I’m pretty sure he doesn’t. It’s hard to think straight when a guy’s that hot in an evil Mafioso kingpin kind of way. More importantly, he’s a crime lord who can conceal my slip-up with a few clicks on his minion’s computer keyboards. But the Scythe has his price. In this case, he wants me to finish a certain dimensional prototype for him in twenty-four hours. I can do it, but it might mean Learning Squirrel High gets blown up in the process.I’ve gotten out of worse scrapes. Maybe.A NEW SERIES THAT'S PERFECT FOR: fans of urban fantasy, action & adventure, cool science, evil corporations, forbidden romance and hot new classmates who may or may not be aliens.DIMENSION DRIFT WORLDS1. Dimension Drift2. UmbraDIMENSION DIFT1. Alien Minds 2. ECHO Academy",
  "genres": [
    "Young Adult",
    "Fantasy",
    "Science Fiction",
    "Romance",
    "Dystopia",
    "Aliens",
    "Paranormal"
  ],
  "author": "Christina Bauer",
  "average_rating": "3.94",
  "url": "https://www.goodreads.com/book/show/31624878-scythe"
}