{
  "title": "The Judge",
  "description": "“Powell opens her novel with a bang, depicting the abduction almost as soon as the narrative begins. The story is impressive in the way it shifts readers’ sympathies … a gem of a legal thriller, full of plot twists and juicy secrets.” —Kirkus Reviews “Powell’s third novel, a legal thriller, reveals the complexities and tragedies of our criminal justice system. It shows how a series of unexpected events can force a law abiding individual to choose a criminal path. The story in this fast-paced novel will stay with the reader forever.” —Focus On Women Magazine From the courtroom to the kidnappers’ lair, Powell keeps the excitement in tune with a pitch-perfect delivery of realistically motivated characters and a nonstop series of powerfully tense situations. There is no lag in the book, from the opening pages depicting the kidnapping to the thrilling conclusion. ROSE GARRETT —Clarion Reviews As Judge Walter McNeil heads home from Washington, DC’s Superior Court, he is preoccupied with the triple-murder case assigned to him. But everything changes when a car pulls up next to him and a man asks for directions. Seconds later, McNeil is pushed into the backseat of the car, knocked unconscious, and whisked away into uncertainty. McNeil’s kidnappers are three ex-convicts whose lives have been ruined by the judge’s harsh sentences. Out for revenge, they feed the judge drugs, repeatedly threaten his life, and then imply they have his teenage daughter, Daphne, who disappeared four years earlier. After they tell him at gunpoint that he must rule favorably on a defense attorney’s motions in the triplemurder case, McNeil has no idea his ordeal is just beginning. Before it is over, the judge’s life will be turned upside down. Now it is up to criminal defense attorney Amanda Perkins and detective Aristo Manfredi to partner together in a race against time to unravel the clues and hopefully save the judge from a fate he never could have imagined. In this legal thriller, a judge is kidnapped and thrust into the midst of a twisted web that intertwines him with the lives of three ex-convicts and the mystery surrounding his missing daughter.",
  "genres": [],
  "author": "Farin Powell",
  "average_rating": "4.16",
  "url": "https://www.goodreads.com/book/show/31617547-the-judge"
}