{
  "title": "Poet Of The Wrong Generation",
  "description": "“It’s not that I don’t love you, and my tears are yet to dry. But you can’t go back and forth forever and we’ve already said goodbye.”Through these words, a young poet unearths his musical soul while severing ties with the woman he loves after her stunning betrayal. Unknowingly, in writing this ballad of liberation, he will soon evolve as one of the fastest rising stars on the pop music landscape.The year is 1991; the place, New York City. Here we meet Johnny Elias, a college student from Brooklyn with boundless adoration for two things in life: timeless popular music, and the heart of a sweet, complicated young woman who is clearly out of his league.Megan Price not only is the object of Johnny’s affection, but also the only daughter of New York’s most powerful PR woman: the indomitable Katherine Price.Projecting that her daughter’s boyfriend will never live up to the family standard, Katherine cleverly perpetrates a series of duplicitous schemes to rid Johnny from her high-class world. But in her callous disregard, she inadvertently sets him on a determined course to his improbable musical destiny - while sending her own daughter spiraling down a path of devastation.Poet of the Wrong Generation tells the symmetrical story of a lovable underdog and his meteoric rise to stardom, his humiliating downfall and his unprecedented attempt to reclaim his place as the unlikely musical spokesman for his generation. At the heart of Poet is a tale of star-crossed lovers and their struggle with unforeseen success and disillusionment, in an attempt to rediscover lasting harmony.Uniquely integrating a variety of original song compositions, Poet projects the epic clash between true contentment and the fable of stardom’s rewards; a nostalgic journey through the major events of the 1990s, with a cherished cast of characters and a stunningly unpredictable conclusion.",
  "genres": [
    "Music",
    "Rock N Roll",
    "Suspense",
    "Fiction",
    "Love Story",
    "Contemporary Romance",
    "Romantic Suspense"
  ],
  "author": "Lonnie Ostrow",
  "average_rating": "4.82",
  "url": "https://www.goodreads.com/book/show/31675691-poet-of-the-wrong-generation"
}