{
  "title": "A Blindefellows Chronicle",
  "description": "A Blindefellows Chronicle is a comic novel, comprising thirteen interconnected stories that take place over forty years. Its setting is Blindefellows, a second rate public school in the West Country, founded as a charity school for poor, blind boys, but long since converted into an ‘elite’ educational institution for anyone who can pay.The novel runs chronologically from 1974 to 2014. In the first story ‘The Fair Filles of France’ we see the arrival of Sedgewick who starts his first teaching job at Blindefellows after an unsuccessful stint in shoe sales. Japes, who has been at Blindefellows for a few years following a career in the Royal Engineers, senses the younger man’s inexperience and determines to help remedy it by taking him on the school’s annual World Wars trip to France. Once they arrive in Bayeux, it quickly becomes apparent that the trip is a means for Japes to cavort with one of his many girlfriends.Throughout the novel, Japes, an older chap, regularly attempts to imbue the younger Sedgewick with his worldly experience and takes it upon himself to introduce Sedgewick to womankind as a means of giving the naïve fellow some sort of fulfilling experience in life. He’s repeatedly thwarted by the timorous Sedgewick, however, who throws his energies into his love of History as a means of sating his rather watery appetite. An unlikely hero through and through, Sedgewick repeatedly finds himself driven to save the day, such as in the next story, ‘The Guardians of The Flock’ where Sedgewick tries to diffuse a siege and is himself taken hostage.In ‘Of Art and Cheese’, out of necessity, Sedgewick thrusts himself into the role of entrepreneur. Blindefellows’ loathsome Librarian, Francis Fairchild, proposes that the strapped for cash school do away with The Flock, the school’s mascot. Sedgewick comes up with a plan to make them pay their way by establishing a creamery which he will attempt to run, much to the ridicule of the others who hear he needs to read a book on dairy farming to learn how to milk a teat.In the fourth story it is 1984, the year of the 400th anniversary of the founding of the school, and English master, Tony Tree, bombastic descendant of Beerbohm Tree, has penned ‘A Blindefellows Chronicle’, a multi-media extravaganza to mark the great day, with Sedgewick dubiously in charge on the technical front. Meanwhile, Japes, who has been given responsibility for the social side of the event to distract him from his mid-life crisis, gets entangled in twin flings with the caterer and decorator he has hired, whom he unsuccessfully tries to keep out of sight of one another.Later, Sedgewick finds himself in a predicament after inadvertently sputtering what is taken to be a proposal by the school’s dowdy receptionist, Yvonne. Advised by Japes to wriggle out of it, Sedgewick tries to pluck up the courage to do the deed. Her ramshackle family farm and her frightening father urge him on until he is touched by the way Yvonne tends to an abused donkey. From that point, he finds himself unable to act on his cold feet and marriage is on the cards.Other members of the school’s bachelor community feature in the form of Toby and Les, Japes’ colleagues in the Science department. In ‘The Man in the Brown Suit’, Japes and Toby attempt to cure Les, their lab technician, of his imaginary allergies with near disastrous consequences. ‘Toby and the Tree People’ is the story that follows, set in 1989, the year of the White Paper, ‘Roads for Prosperity’. Nature-loving Toby attempts to block the razing of a favourite patch of woodland by inhabiting a tree. The Tree People of the title are a gaggle of itinerant protesters who turn up to help him, but who prove exceedingly trying.Bachelorettes are key elements too with the landmark arrival of the first female Head of Department half way through the novel in 1994 in “The Fraulein from Brazil”. Matron Ridgeway, Japes’ female equivalent in philandering, is the clear-headed Tiresias of the novel who has to go through her own baptism of fire in chapter two when she starts work at the male-dominated Blindefellows as the school nurse.",
  "genres": [
    "Short Stories",
    "Fiction"
  ],
  "author": "Auriel Roe",
  "average_rating": "4.14",
  "url": "https://www.goodreads.com/book/show/31674522-a-blindefellows-chronicle"
}