{
  "title": "Albinus on Anatomy",
  "description": "This beautiful, enthralling book represents the rarest of human a work of great scientific merit that is a magnificent work of art as well. Bernard Siegfried Albinus was the greatest descriptive anatomist of the eighteenth century. Over a period of twenty years, he produced two volumes of drawings, Tables of the Skeleton and Muscles of the Human Body and Tables of the Human Bones, that have long been revered for their beauty, skill, artistry, and anatomical accuracy. This finely made edition makes them available to the general public at an easily affordable price for the first time since their publication in 1747.All 80 of the original copperplate engravings, containing over 230 individual illustrations, have been painstakingly reproduced for this edition. The muscles and bones of the human body are rendered individually and in related groups from varying perspectives, enabling art students to compare the forms; to analyze their size, shape, direction, and attachments; and to observe with absolute clarity the shape and position of bodily forms. Eighty modern diagrams matching each plate identify each bone and muscle in the most common medical terms.The eminent medical historian Charles Singer praised Albinus' brilliant \"He introduced a new standard of accuracy into practical anatomy and of accuracy and beauty into anatomical illustrations.\" Singer \"These illustrations, with their finely wrought ornamental backgrounds, were intended for artists as well as for physicians, and no finer work of their type has ever been executed.\"Introductory essays by the well-known artist and art educator Terence Coyle — including a new introduction to the Dover edition — engagingly explore Albinus' life and work. Following these, Robert Beverly Hale, one of America's best-known teachers of figure drawing and anatomy, brilliantly appraises Albinus' technique and demonstrates how artists today can use his anatomical studies to draw from life, a special feature that makes this magnificent book truly indispensable for artists and art students at every level.",
  "genres": [
    "Art",
    "Nonfiction",
    "Science",
    "Art Design",
    "Reference",
    "Drawing"
  ],
  "author": "Robert Beverly Hale",
  "average_rating": "4.48",
  "url": "https://www.goodreads.com/book/show/1195455.Albinus_on_Anatomy"
}