{
  "title": "Identical Strangers: A Memoir of Twins Separated and Reunited",
  "description": "Imagine a slightly different version of you walks across the room, looks you in the eye and says “hello” in your voice. You discover that she has the same birthday, the same allergies, the same tics, and the same way of laughing. Looking at this person, you are able to gaze into your own eyes and see yourself from the outside. This identical individual has the exact same DNA as you and is essentially your clone.We don’t have to imagine.Elyse Schein had always known she was adopted, but it wasn’t until her mid-thirties while living in Paris that she searched for her biological mother. When Elyse contacted her adoption agency, she was not prepared for the shocking, life-changing news she received: She had an identical twin sister. Elyse was then hit with another bombshell: she and her sister had been separated as infants, and for a time, had been part of a secret study on separated twins.Paula Bernstein, a married writer and mother living in New York, also knew she was adopted, but had no inclination to find her birth mother. When she answered a call from the adoption agency one spring afternoon, Paula’s life suddenly divided into two starkly different periods: the time before and the time after she learned the truth. As they reunite and take their tentative first steps from strangers to sisters, Paula and Elyse are also left with haunting questions surrounding their origins and their separation. They learn that the study was conducted by a pair of influential psychiatrists associated with a prestigious adoption agency. As they investigate their birth mother’s past, Paula and Elyse move closer toward solving the puzzle of their lives.In alternating voices, Paula and Elyse write with emotional honesty about the immediate intimacy they share as twins and the wide chasm that divides them as two complete strangers. Interweaving eye-opening studies and statistics on twin science into their narrative, they offer an intelligent and heartfelt glimpse into human nature. Identical Strangers is the amazing story of two women coming to terms with the strange and unbelievable hand fate has dealt them, an account that broadens the definition of family and provides insight into our own DNA and the singularly exceptional imprint it leaves on our lives.",
  "genres": [
    "Nonfiction",
    "Memoir",
    "Biography",
    "Adoption",
    "Biography Memoir",
    "Book Club",
    "Psychology"
  ],
  "author": "Elyse Schein",
  "average_rating": "3.67",
  "url": "https://www.goodreads.com/book/show/1020312.Identical_Strangers"
}