{
  "title": "Bad Boy Navy",
  "description": "Taylor was a wealthy and smart girl from a good family. Having attended Harvard and studied law there she now spent most of her time with her family in Connecticut attending social galas and spending time with important people. When she attended the Christmas military ball she had no idea she was embarking on the journey of a lifetime. It was there that she met Alex, a tall, dark and handsome navy seal who was highly decorated and had seen lots of combat. Alex was in his 30s, Taylor in her late 20s.  When Taylor saw Alex from across the room she knew immediately that this was the man of her dreams. He was exactly what she was looking for. And when Alex met her gaze and his own heart skipped a beat, he also knew that they were going to be romantic partners with one another.  After making an excuse to talk to him, Taylor and Alex struck up a passionate conversation. They talked about their dreams and fears, and what trials and tribulations they had each already been through. A few cocktails later, and they were making their way to an empty ball room to be alone. Alex took Taylor in his arms and kissed her very deeply. The two made out for several minutes before deciding to head back to Alex's loft in the city.  Their romance continued over the next several weeks until Alex was abruptly called overseas to serve in a peacekeeping mission in some third world country. Taylor was heart-stricken but was determined to make the best of it. Would Taylor ever see Alex again? And under what circumstances?   Note: Contains Explicit Scenes of Passion and Desire. Intended For Adult Eyes Only!        Tags: Romance Short Taboo BDSM Pleasure Forbidden Stories Adult Discipline Submission Menage Sport Valentine Dating Druid Stepbrother LGBT BBW Billionaire Romance, billionaire obsession bachelors baby unmasked brothers, Alpha male romance erotic billionaire omega lgbt, Adult sex books romance with sex adultery new age druid Celtic, Forbidden series fruit love romance pleasures billionaire, New Adult romance contemporary college paranormal with sex fantasy fiction, Short Stories Sport reads romance divorce gay military inspirational clean ghost vampire werewolf cowboy doctor highlander pirate politician viking beach gambling baby pregnancy second chance vacation wedding divorce office workplace amnesia new year christmas angel devil demon fbi police dark fun theft murder noir dog cat food craft hitman conspiracy financial london ireland scottish druid wales sweden denmark angels demons dragons elf shapeshifter aliens clones corporations pirates robots horror mystery thriller coming of age superhero sword magic invasion cyberpunk contact empire genes fleet troop exploration bisexual transgender gay lesbian time travel action adventure spy historical fantasy wizard warlock zombies spanish life application inspire papal christian historical jesus self help self-help catholic hebrew woman women haunted house metaphysical guru conduct of life death family man men mystic healing transformation ancient medieval renaissance aging childhood youth death depression alcohol abuse, drug abuse family life friendship immigration, immigrant politics, politician love marriage religion, religious, spiritual travel, voyage military & war career, workplace, working, office parenting, parent and children dating, relationships singlehood, single women sister wedding short story highland Menage Threesome humor comedy",
  "genres": [],
  "author": "Smanta Howard",
  "average_rating": "4.10",
  "url": "https://www.goodreads.com/book/show/31675711-bad-boy-navy"
}