{
  "title": "Hitler's Commando: The Daring Missions of Otto Skorzeny and the Nazi Special Forces",
  "description": "Otto Skorzeny, Germany's top commando in the Second World War, is one of the most famous men in the history of special forces. His extraordinary wartime career was one of high risk and adventure and here he tells the full story. Skorzeny quickly proved his worth in Yugoslavia and then Russia. In 1942 he was awarded the Iron Cross, and in April 1943 he was promoted to captain and named \"Chief of Germany's Special Troops, Existing or to be Created in the Future.\"When Mussolini was imprisoned in Italy in 1943, it was Skorzeny who successfully led the daring glider rescue, winning the Knight's Cross and promotion as a result. Skorzeny's talents were brought into play again when he was sent to Budapest to stop the Hungarian regent Admiral Horthy from signing a peace with Stalin in 1944. Now dubbed \"the most dangerous man in Europe\" by the Allies he was awarded the German Cross in Gold. A few months later he took a critical role in the Ardennes offensive with a controversial plan to raise a brigade disguised as Americans with captured Sherman tanks. His captured colleagues spread a false rumor that he was planning to assassinate Eisenhower, who was consequently confined to his headquarters under guard for protection.Skyhorse Publishing, as well as our Arcade imprint, are proud to publish a broad range of books for readers interested in history--books about World War II, the Third Reich, Hitler and his henchmen, the JFK assassination, conspiracies, the American Civil War, the American Revolution, gladiators, Vikings, ancient Rome, medieval times, the old West, and much more. While not every title we publish becomes a New York Times bestseller or a national bestseller, we are committed to books on subjects that are sometimes overlooked and to authors whose work might not otherwise find a home.",
  "genres": [
    "History",
    "Biography",
    "World War II",
    "Nonfiction",
    "War",
    "Military History",
    "Military Fiction"
  ],
  "author": "Otto Skorzeny",
  "average_rating": "4.01",
  "url": "https://www.goodreads.com/book/show/31678061-hitler-s-commando"
}