{
  "title": "The Pill Bugs of Time",
  "description": "Book 2 in the Offbeat Crimes series Relationship and communication issues plague Officer Vikash Soren, but those are nothing compared to facing stick-throwing tumbleweeds, pill bugs and…time travel? Vikash Soren, the perfect police officer except for his odd paranormal ability, never seems to lose his temper. Always serene and competent, he’s taken on the role of mediator in a squad room full of misfits. But on the inside, he’s a mess. Unable to tell his police partner that he loves him, Vikash struggles silently, terrified of losing Kyle as a lover, partner and friend. But life in the 77th Precinct doesn’t leave much room for internal reflection. A confrontation with a stick-throwing tumbleweed in Fairmount Park leads to bizarre consequences involving pill bugs, statues and…time travel? If Vikash manages to survive the week and stay in one point in time, he might be able to address normal things like relationship problems. He just needs Kyle to have a little more patience. Maybe a few centuries’ worth. About Angel Martinez The unlikely black sheep of an ivory tower intellectual family, Angel Martinez has managed to make her way through life reasonably unscathed. Despite a wildly misspent youth, she snagged a degree in English Lit, married once and did it right the first time, (same husband for almost twenty-four years) gave birth to one amazing son, (now in college) and realized at some point that she could get paid for writing. Published since 2006, Angel's cynical heart cloaks a desperate romantic. You'll find drama and humor given equal weight in her writing and don't expect sad endings. Life is sad enough. She currently lives in Delaware in a drinking town with a college problem and writes Science Fiction and Fantasy centered around gay heroes.",
  "genres": [
    "Paranormal",
    "M M Romance",
    "Romance",
    "Urban Fantasy",
    "Fantasy",
    "Mystery",
    "Time Travel"
  ],
  "author": "Angel  Martinez",
  "average_rating": "3.94",
  "url": "https://www.goodreads.com/book/show/31657145-the-pill-bugs-of-time"
}