{
  "title": "Helen Keller: A Life",
  "description": "Dorothy Herrmann's powerful biography of Helen Keller tells the whole story of the controversial and turbulent relationship between Helen and her teacher, Annie Sullivan. Herrmann also chronicles Helen's doomed love affair, her struggles to earn a living, her triumphs at Radcliffe College, and her work as an advocate for the disabled. Helen Keller has been venerated as a saint or damned as a fraud, but Herrmann shows her to have been a beautiful, intelligent, high-strung, and passionate woman whose life was transformed not only by her disabilities but also by the remarkable people on whose help and friendship she relied.\"Fascinating. . . . Stripping away decades of well-meaning sentimentality, Herrmann presents a pair of strong-willed women, who struggled to build their own lives while never forgetting their dependence on each other.\"—Ron Charles, Christian Science Monitor\"We meet an entirely unexpected Helen Keller—a woman with deep if concealed ambivalence toward her self-sacrificing teacher; a political radical; and a woman longing for romantic love and the fulfilled sexual life of a woman.\"—Joan Mellen, Philadelphia Inquirer\"Herrmann's portrait of Keller is both fully embodied and unflinchingly candid.\"—Mary Loeffelholz, Boston Sunday Globe\"This well-proportioned biography of the deaf and blind girl who became a great American crusader rescues its subject from the shackles of sainthood without destroying her as an American hero.\"—Dennis Drabelle, Cleveland Plain Dealer\"Herrmann's engrossing biography helps us see beyond the public's fascination with how Keller dealt with her disabilities to discover the woman Keller strived to be.\"—Nancy Seidman, Atlanta Journal-Constitution\"Perhaps the most intimate biography [of Helen Keller]. [Herrmann] gives her back her sexuality [and] imbues her with a true humanity. . . . Helen Keller: A Life has some of the texture and the dramatic arc of a good novel.\"—Dinitia Smith, New York Times",
  "genres": [
    "Biography",
    "Nonfiction",
    "History",
    "American History",
    "Disability",
    "Memoir",
    "Historical"
  ],
  "author": "Dorothy Herrmann",
  "average_rating": "4.18",
  "url": "https://www.goodreads.com/book/show/316583.Helen_Keller"
}