{
  "title": "Out of My Life and Thought",
  "description": "\" Out of My Life and Thought shatters the old myth and allows us to glimpse the real Albert Schweitzer, a man whose moral example is as relevant and compelling in the 1990s as it was in the 1930s on first publication. Eloquent and heartfelt.\"― Los Angeles Times Of the many highly esteemed books Albert Schweitzer penned in his life, he valued his autobiography the most. He had become a legend and he wanted to remind readers that he was just a man, and a man who had learned from many others. He had been fortunate to be in the right places at the right times, to meet people of thought and sympathy. He wanted to report his debts to them. He wanted to clarify his reasons and methods for his undertakings and to respond to some of his critics. And, he wished to honor something greater than he was―reverence for life. Reverence for Life became his life's motto, and it brought him pain as well as joy as he sought to respect how precious and unique each life is. Schweitzer believed there was a way to live in the world, accept it, take joy from it―and who could know this better than a man who had placed himself so much in it, given so much for it, and had been ready to receive experience as a gift to be thankful for. In addition to a preface by Rhena Schweitzer Miller and Antje Bultmann Lemke, this translation incorporates revisions and additions Schweitzer made for the French translation of 1960 and those he made for thirty years in his own copy of the original German edition. \"This fascinating volume is the autobiography of the world-famous missionary doctor, organist, philosopher, theologian, and Nobel Peace Prize-winner, newly translated, researched, and corrected on the basis of recently discovered material.\"― Booklist \"An authentic twentieth-century classic. Few books in our time have had a greater impact on the life and values of untold numbers of people.\"―Norman Cousins",
  "genres": [
    "Biography",
    "Philosophy",
    "Nonfiction",
    "Memoir",
    "Autobiography",
    "Religion",
    "Medicine"
  ],
  "author": "Albert Schweitzer",
  "average_rating": "3.97",
  "url": "https://www.goodreads.com/book/show/316796.Out_of_My_Life_and_Thought"
}