{
  "title": "Documents on the Rape of Nanking",
  "description": "The Japanese Army's invasion of China in 1937 was the first step toward a hemispheric war that would last until the atomic bombing of Hiroshima and Nagasaki in 1945. What ended in one atrocity began with the savage military takeover of China's capital city, which quickly became known as the Rape of Nanking. The Japanese Army's conduct from December 1937 to February 1938 constitutes one of the most barbarous events not just of the war but of the century. The violence was documented at the time and then redocumented during the war crimes trial in Tokyo after the war. This book brings together materials from both moments to provide the first comprehensive dossier of primary sources on the Rape.Part 1, \"The Records,\" includes two sources written as the Rape was underway. The first is a long set of documents produced by the International Committee for the Nanking Safety Zone, a group of foreigners who strove to protect the Chinese residents. The second is a series of letters that American surgeon Dr. Robert Wilson wrote for his family during the same period. These letters are published here for the first time.The evidence compiled by the International Committee and its members would be decisive for the indictments against Japanese leaders at the International Military Tribunal for the Far East in Tokyo. Part 2, \"The Judgments,\" reprints portions of the tribunal's 1948 judgment dealing with the Rape of Nanking, its judicial consequences, and sections of the dissenting judgment of Justice Radhabinod Pal.These contemporary records and judgments create an intimate firsthand account of the Rape of Nanking. Together they are intended to stimulate deeper reflection than previously possible on how and why we assess and assign the burden of war guilt.Timothy Brook is Professor of Chinese History and Associate Director of the Joint Centre for Asia Pacific Studies, University of Toronto, and is coeditor of Nation Asian Elites and National Identities and Culture and The Shaping of Capitalism in Eastern Asia , both published by the University of Michigan Press.",
  "genres": [
    "History",
    "Nonfiction",
    "China",
    "Japan",
    "Gender Studies",
    "Gender",
    "War"
  ],
  "author": "Timothy Brook",
  "average_rating": "4.59",
  "url": "https://www.goodreads.com/book/show/31683.Documents_on_the_Rape_of_Nanking"
}