{
  "title": "Aimée & Jaguar: Eine Liebesgeschichte, Berlin 1943",
  "description": "Im Jahre 1991 lernt die Schriftstellerin und Journalistin Erica Fischer die damals 78jährige Lilly Wust kennen. Die außerordentliche Biographie dieser alten Frau beeindruckt und fasziniert sie so sehr, daß sie beschließt, aus den nur so hervorsprudelnden Erzählungen der Lilly Wust ein Buch zu schreiben. Bis zum Jahr 1942 führt die 29jährige Lilly Wust das - soweit in Kriegszeiten möglich - unbeschwerte Leben einer ganz normalen deutschen Hausfrau und Mutter dieser Zeit. Sie heiratet, bringt in kürzester Zeit vier Kinder zur Welt, erhält das Mutterkreuz und ist damit beschäftigt, den Haushalt mit den zugewiesenen Lebensmittelkarten so gut wie möglich zu führen, während ihr Mann - ein kleiner Bankbeamter - an der Front ist. In der Wohnung hängt, wie in vielen anderen Wohnungen, ein Porträt Adolf Hitlers und ihr Weltbild ist hauptsächlich durch die regelmäßige Lektüre des Völkischen Beobachters geprägt. So ist sie sich ganz sicher, daß sie einen Juden schon von weitem riechen kann, denn die sind sowieso an allem Unglück schuld. Diese Einstellung erstaunt ihr Pflichtjahrmädchen Inge Wolf sehr. Hat sie doch bei sich zuhause die untergetauchte Jüdin Felicitas Schragenheim versteckt. Felicitas darf sich bei Tag nirgends sehen lassen, da sie zwischenzeitlich steckbrieflich gesucht wird. Doch die Erzählungen von Inge Wolf aus dem Haushalt der Wusts amüsieren sie so, daß sie es einfach wissen will. So besucht die elegante Felicitas die Familie Wust. Was vorher niemand ahnen kann geschieht: Lilly und Felicitas verlieben sich unsterblich ineinander. Lilly ist bereit, ihren Mann und die Kinder Hals über Kopf zu verlassen, um ein gefährliches und unsicheres Leben an der Seite von Felicitas, ihrer geliebten \"Jaguar\", zu führen. Der Liebe der beiden Frauen ist jedoch nur eine kurze Zeit gegönnt. Am 21. August 1944 werden die beiden Frauen in ihrer Wohnung von der Gestapo erwartet. Felicitas wird in das KZ Theresienstadt gebracht und findet in Auschwitz den Tod. Nach dem Krieg heiratet Lilly zwar noch einmal - ihr Mann ist im Krieg gefallen - doch die zweite Ehe war eine reine Zweckgemeinschaft und hielt nicht lange. Bis heute lebt Lilly Wust ihre große Liebe zu Felicitas; sie kann sie nicht vergessen. In zwei großen Koffern bewahrt sie alle Briefe, Gedichte, Tagebücher und Fotos von Felicitas auf. Aus diesem Material hat die Autorin Erica Fischer ein wunderbares Zeitdokument geschaffen. Sie hat neben Lilly Wust noch andere Zeitzeugen zu Wort kommen lassen: Die Kinder Lillys, Freunde, Tagebuchnotizen, Fotos und Berichte aus der Tagespresse. Natürlich hat die Autorin auch immer wieder der verstummten Stimme Felicitas Schragenheims Worte verliehen. Vor allem mit Felicitas kann sich Erica Fischer besonders gut identifizieren. Eine Schwierigkeit lag beim Schreiben des Romans mit Sicherheit an der verständlichen Glorifizierung, die Lilly mit dem Andenken und dem Nachlaß von Felicitas betreibt. Den feinen Unterschied zwischen Dichtung und Wahrheit zu ermitteln, war kein leichtes Unterfangen. Die lang vergangene Zeit hat das ihre dazugetan, die Erinnerung nicht mehr so verläßlich zu machen. Darüber hinaus hat Felicitas ein Leben geführt, das sie Lilly vollständig verborgen hat. Zu ihrem Schutz hat ihr Felicitas gar nichts über ihre Tätigkeit im Untergrund erzählt. Aimée und Jaguar ist ein vielstimmiges Buch, das von einer großen Liebe zwischen zwei Frauen erzählt und den unendlichen Schwierigkeiten, diese Liebe zu leben unter den argwöhnischen Blicken von pflichtversessenen Nachbarn und einer Umgebung, die im Chaos versinkt. Es vermittelt ein sehr genaues Bild des Berliner Kriegsalltags und die Nöte und Sorgen der untergetauchten Juden. Diese hatten sich nicht nur vor den linientreuen Nazis zu fürchten, sondern auch vor der berüchtigten Jüdin Stella, die untergetauchte Juden an die Gestapo verriet, um die eigene Familie zu retten. Erst am 22. September 1981 erhielt Lilly Wust das Bundesverdienstkreuz am Bande, weil sie von 1942 bis 1945 vier Jüdinnen in ihrer Berliner Wohnung versteckt hielt und versorgt hatte. Drei davon überlebten. Die Wirklichkeit ist phantastischer als jede Fiktion. --Manuela Haselberger",
  "genres": [
    "LGBT",
    "Queer",
    "Nonfiction",
    "History",
    "Biography",
    "Lesbian",
    "Romance"
  ],
  "author": "Erica Fischer",
  "average_rating": "4.04",
  "url": "https://www.goodreads.com/book/show/316828.Aim_e_Jaguar"
}