{
  "title": "Rough Trade: A Shocking True Story of Prostitution, Murder and Redemption",
  "description": "From The Classic True Crime Library of New York Times Bestselling Author Steve Jackson Early one morning in May 1997, a young couple on their way to work in the mountains of Colorado spotted a man dragging a body up a secluded trail. The beautiful, densely wooded area off a dirt road seemed such an incongruous place for a violent crime that at first the couple had a hard time believing what they were seeing. It was all too real; the man fled, leaving behind a bloody, dying woman. Indeed the investigation into the death of young street walker Anita Paley would lead from that idyllic spot to the seamy underbelly of Denver and a world of prostitution, drug dealers and violent criminals. And it would expose the lives of two of that world’s inhabitants, the suspect, Robert Riggan, and Anita’s friend, Joanne Cordova, a former cop-turned-crack addict and hooker. In the past, Cordova had submitted to violent sex with Riggan in exchange for drugs; it was just part of her life on the mean streets. But when her friend Anita was murdered, Joanne had to make a choice. She could go to her former colleagues on the police department and tell them what she suspected, which would put her own life in danger as “a snitch.” Or she could look the other way, and let a suspected killer walk free and continue his violent attacks on women. ROUGH TRADE by New York Times bestselling author Steve Jackson is more than the recounting of a murder, an investigation, and the prosecution of a suspect. It’s also the story of two people from the seething criminal underworld of Denver, Colorado and how their paths crossed on the streets and in the courtroom. There was Riggan, who was raised in his own private hell that included rape, incest and extreme abuse to become a violent sexual predator. And there was Cordova, who had to summon the courage, and suffer the humiliation, in order to pull herself out of the abyss into which she'd fallen to testify against the man she believed killed her friend. And in doing so, find her own personal redemption.",
  "genres": [
    "True Crime",
    "Nonfiction",
    "Audiobook",
    "Crime"
  ],
  "author": "Steve    Jackson",
  "average_rating": "4.10",
  "url": "https://www.goodreads.com/book/show/31679824-rough-trade"
}