{
  "title": "American Goddess at the Rape of Nanking: The Courage of Minnie Vautrin",
  "description": "The Japanese army's brutal four-month occupation of the city of Nanking during the 1937 Sino-Japanese War is known, for good reason, as \"the rape of Nanking.\" As they slaughtered an estimated three hundred thousand people, the invading soldiers raped more than twenty thousand women--some estimates run as high as eighty thousand. Hua-ling Hu presents here the amazing untold story of the American missionary Minnie Vautrin, whose unswerving defiance of the Japanese protected ten thousand Chinese women and children and made her a legend among the Chinese people she served.Vautrin, who came to be known in China as the \"Living Goddess\" or the \"Goddess of Mercy,\" joined the Foreign Christian Missionary Society and went to China during the Chinese Nationalist Revolution in 1912. As dean of studies at Ginling College in Nanking, she devoted her life to promoting Chinese women's education and to helping the poor.At the outbreak of the war in July 1937, Vautrin defied the American embassy's order to evacuate the city. After the fall of Nanking in December, Japanese soldiers went on a rampage of killing, burning, looting, rape, and torture, rapidly reducing the city to a hell on earth. On the fourth day of the occupation, Minnie Vautrin wrote in her diary: \"There probably is no crime that has not been committed in this city today. . . . Oh, God, control the cruel beastliness of the soldiers in Nanking.\"When the Japanese soldiers ordered Vautrin to leave the campus, she replied: \"This is my home. I cannot leave.\" Facing down the blood-stained bayonets constantly waved in her face, Vautrin shielded the desperate Chinese who sought asylum behind the gates of the college. Vautrin exhausted herself defying the Japanese army and caring for the refugees after the siege ended in March 1938. She even helped the women locate husbands and sons who had been taken away by the Japanese soldiers. She taught destitute widows the skills required to make a meager living and provided the best education her limited sources would allow to the children in desecrated Nanking.Finally suffering a nervous breakdown in 1940, Vautrin returned to the United States for medical treatment. One year later, she ended her own life. She considered herself a failure.Hu bases her biography on Vautrin's correspondence between 1919 and 1941 and on her diary, maintained during the entire siege, as well as on Chinese, Japanese, and American eyewitness accounts, government documents, and interviews with Vautrin's family.",
  "genres": [
    "History",
    "China",
    "Biography",
    "War",
    "World War II",
    "Nonfiction",
    "Asia"
  ],
  "author": "Hua-Ling Hu",
  "average_rating": "4.15",
  "url": "https://www.goodreads.com/book/show/31688.American_Goddess_at_the_Rape_of_Nanking"
}