{
  "title": "Chemistry",
  "description": "Praised by Ha Jin as \"a genuine piece of wise, humorous, and moving,\" and perfect for readers of Lab Girl and Celeste Ng's Everything I Never Told You,  a luminous coming-of-age novel about a young female scientist who must recalibrate her life when her academic career goes off track.Three years into her graduate studies at a demanding Boston university, the unnamed narrator of this nimbly wry, concise debut finds her one-time love for chemistry is more hypothesis than reality. She's tormented by her failed research--and reminded of her delays by her peers, her advisor, and most of all by her Chinese parents, who have always expected nothing short of excellence from her throughout her life. But there's another, nonscientific question the marriage proposal from her devoted boyfriend, a fellow scientist, whose path through academia has been relatively free of obstacles, and with whom she can't make a life before finding success on her own. Eventually, the pressure mounts so high that she must leave everything she thought she knew about her future, and herself, behind. And for the first time, she's confronted with a question she won't find the answer to in a What do I really want? Over the next two years, this winningly flawed, disarmingly insightful heroine learns the formulas and equations for a different kind of chemistry--one in which the reactions can't be quantified, measured, and analyzed; one that can be studied only in the mysterious language of the heart. Taking us deep inside her scattered, searching mind, here is a brilliant new literary voice that astutely juxtaposes the elegance of science, the anxieties of finding a place in the world, and the sacrifices made for love and family.",
  "genres": [
    "Fiction",
    "Contemporary",
    "Literary Fiction",
    "Audiobook",
    "Adult",
    "Novels",
    "Book Club"
  ],
  "author": "Weike Wang",
  "average_rating": "3.74",
  "url": "https://www.goodreads.com/book/show/31684925-chemistry"
}