{
  "title": "Taking The Human",
  "description": "He took everything from her … and she found the only thing she ever really needed.\nFor Alisse Southwick, the problem wasn't just the musclebound 8 foot tall alien who'd taken her from everything she'd ever known. No, the problem was she was seriously contemplating trading the knowledge that unlocked the secrets of the universe, in exchange for her freedom — sexual and otherwise. She was a woman of science, yes, but why did the alien holding her captive have to look like something out of her darkest wet dreams?From the moment he'd set eyes on her​,​ Lukanos knew only one thing: he had to have her. But there was ​one minor problem — she was​ ​a human. To even show himself to a human — ​let alone abducting one — was against every law of his people. But each time he looked at her, those sparkling, keen eyes, the long, sable hair, and the lush, shapely body human females were notorious — and celebrated — for, his resolve to follow the law, to obey his people's sacred Directive, was in serious danger of crumbling. He knew he wasn't supposed to want her — but he knew somehow, someway, she would be his — whether she was ready for it or not.Taking a human being was much more than an abduction though — it was a taboo act. Fearing he'd lose more than his commission in the Survey Corps, Lukanos quickly learned he was far from the only one of his people obsessed with human females. He wasn't the only one keeping a female slave.The repercussions for capturing humans were serious, but Lukanos was prepared to endure them. He'd endure almost anything to make the gorgeous human his, in every way.But what's a captor supposed to do when he begins to fall for his captive? Does he keep her as the only thing she'll ever be on his world — a sexual plaything? Or must he — for the first time in his life — do the right thing?Publisher's Warning: This science fiction dark erotic romance is intended only for mature audiences. 18 and over only!This novel contains the following themes or activities: pervasive BDSM, capture fantasy, intense and explicit sex, spanking, anal play, TPE, and other acts of unequal power dynamics. If any of these might be offensive to you, please do not buy or read this book.Word Count: 70,57​8 words​Note: This title was originally published as a short novella (21K words) in the USA Today best​-​selling anthology, Bound, Spanked, and Loved.The story has since been GREATLY expanded from 21k words to over 70k words. For readers who read the original story, this is a much deeper, richer story and in many respects is essentially a new book.",
  "genres": [
    "Aliens",
    "Erotica",
    "BDSM",
    "Romance",
    "Science Fiction",
    "Fantasy",
    "Dark"
  ],
  "author": "Trent Evans",
  "average_rating": "3.59",
  "url": "https://www.goodreads.com/book/show/31683018-taking-the-human"
}