{
  "title": "Penelope and Prince Charming",
  "description": "Welcome to Nvengaria, a land where magic happens, shape-shifters are real, and fairy tales come true.England 1819Wallflower Penelope Trask believes nothing will ever happen in her village of Little Marching, Oxfordshire. Handsome princes only sweep in and carry off innocent maidens in the fairy tales she collects, never in real life.Prince Damien of Nvengaria is tired of living inside a fairy tale. His entire life has been ruled by prophecy, magic, and avoiding being assassinated by his mad father and the head of the Council of Dukes. When his father dies, he inherits a kingdom divided, his opposition led by Grand Duke Alexander, who will do anything to keep the monster's son from ruling Nvengaria.To make good his claim to the throne, Damien must fulfill a prophecy that reunites the lines of the original two princes of Nvengaria, best friends who'd carved a kingdom out of wild lands near the Transylvanian mountains. Damien's task--to bring back the Princess of Nvengaria, her line lost centuries ago. The price of disappointing the people, Alexander promises, will be Damien's execution.Damien tracks down the long-lost princess to the village of Little Marching in England, where nothing remotely interesting ever happens. He will have to convince the lovely Penelope that he is no charlatan, and that Damien's life and his kingdom depends on her facing danger with him. Along the way, the prophecy says, they will fall in love. And the prophecy is never wrong ...Note that the Nvengaria series is a paranormal historical, the books loosely based on well-known fairy Penelope and Prince Charming--CinderellaThe Mad, Bad Duke--Beauty and the BeastHighlander Ever After--Snow White and the Seven ... HighlandersThe Longest Night--Little Red Riding Hood (and the Big, Bad Wolf)",
  "genres": [
    "Historical Romance",
    "Romance",
    "Historical",
    "Fantasy",
    "Paranormal",
    "Paranormal Romance",
    "Regency"
  ],
  "author": "Jennifer Ashley",
  "average_rating": "3.66",
  "url": "https://www.goodreads.com/book/show/31687814-penelope-and-prince-charming"
}