{
  "title": "Seeing Things as They Are: G. K. Chesterton and the Drama of Meaning",
  "description": "The jovial journalist, philosopher, and theologian G. K. Chesterton felt that the world was almost always in permanent danger of being misjudged or even overlooked, and so the pursuit of understanding, insight, and awareness was his perpetual preoccupation. Being sensitive to the boundaries and possibilities of perception, he was always encouraging his audience to find a clear view of things. His belief was that it really is possible, albeit in a limited way, to see things as they are. This book, which marries Chesterton's unique perspective with the discipline of philosophical hermeneutics, aims to outline what Chesterton can teach us about reading, interpreting, and participating in the drama of meaning as it unfolds before us in words and in the world.Strictly speaking, of course, Chesterton is not a hermeneutic philosopher, but his vast body of work involves important hermeneutic considerations. In fact, his unique interpretive approach seems to be the subtext and implicit fascination of all Chesterton scholarship to date, and yet this book is the first to comprehensively focus on the issue. By taking Chesterton back to his philosophical roots--via his marginalia, his approach to literary criticism, his Platonist-Thomist metaphysics, and his Catholic theology--this book explicitly and compellingly tackles the philosophical assumptions and goals that underpin his unique posture towards reality.\"Philosophically sophisticated but readily accessible, this highly original study shows what it was that made Chesterton so excellent a reader both of texts and of the world as a whole.\"--Aidan Nichols, Prior, Blackfriars Cambridge, UK\"What trait do we most admire in Chesterton? I submit it is his vision, his ability to see things as they are. In this remarkably thorough and well-documented book, Reyburn transfers Chesterton's pince-nez to our own noses. He conveys not just a description of Chesterton's hermeneutic, but gives us a rewarding experience of it. A welcome romp with Chesterton, the ocular athlete.\"--David W. Fagerberg, Professor, University of Notre Dame\"In this work on Chesterton's drama of meaning, he shines forth as characteristically holistic, sane, joyous, and alert--at once wary of any easy 'self-evident' access to the way things are and yet hopeful in presenting ways to see the world more clearly. Reyburn's book, both scholarly and accessible, is more lively than any work about philosophical hermeneutics has the right to be.\"--Christopher Ben Simpson, Professor of Philosophical Theology, Lincoln Christian University; Author, The Truth Is the Kierkegaard's Theologia Viatorum\"Of the many books on G. K. Chesterton, Duncan Reyburn's deserves its own special place. Indeed it is unique. For the first time, those wishing to dig deep into the mind of Chesterton, the master of paradox, can follow the hermeneutic path that Reyburn ploughs, in which, page after page, he churns up the surface of Chesterton's wit that he might get to the heart of the wisdom that lies beneath.\"--Joseph Pearce, Author, Wisdom and A Life of G. K. Chesterton; Director, Center for Faith and Culture, Aquinas College\"For far too long Chesterton has been undervalued as a philosopher, and the radicalism of his thought unacknowledged. Duncan Reyburn's superb exploration of the dramatic nature of his hermeneutics is thus a timely and original contribution to Chesterton studies, revealing on what resilient theological basis the sparkling epigrams depend.\"--Alison Milbank, Department of Theology and Religious Studies, University of Nottingham; Author, Chesterton and Tolkien as The Fantasy of the RealDuncan Reyburn a Senior Lecturer at the Department of Visual Arts at the University of Pretoria, South Africa.",
  "genres": [
    "Philosophy"
  ],
  "author": "Duncan Reyburn",
  "average_rating": "4.11",
  "url": "https://www.goodreads.com/book/show/31698654-seeing-things-as-they-are"
}