{
  "title": "The Family Made of Dust",
  "description": "(ISBN: 978-0982239919, New Cover Edition)WINNER OF TWO NATIONAL AWARDSA generation, stolen. A life, devastated.Forty-five year old Gabriel Branch is a man displaced. Growing up a biracial Australian Aborigine, his only attempt to contact the family he was ripped from was a failed attempt to view his adoption records, files that were destroyed decades ago.Now his best friend, Ian McCabe, has disappeared in the red desert of the Outback, forcing him away from his home on the Queensland coast. His only clue is a Message Stick, an aboriginal artifact Ian sent him before his disappearance.As he searches the now alien landscape for the last true connection he had, memories of a life forgotten return unbidden. Memories of the uncle who swung him up into a tree and called him Little Breeze. Memories of the mother he lost. Memories of the candy that lured him and his brother to the bitter orphanage where the two were separated, first by beds and then by families. Haunted by these images, Gabe struggles to deny them. It’s the only thing preserving the fragile peace he has made with that long-ago loss.But Dana Pukatja, the head of a black market smuggling ring, also begins to haunt him. A Pitjantjatjara shaman with a broken moral compass, Dana uses the traditional methods of a karadji, or ritual executioner, to stalk Gabe through the outback. Gabe’s carefully constructed psychological defenses begin to crumble.Armed with a totem animal and the sorcerer's own tricks, Gabe must learn the fate of his friend before Dana destroys him.The Family Made of Dust is a remarkable story about the special relationships families can have even when they have been broken apart…and how a spare and beautiful landscape imbued with the mystical energy of the Dreamtime can resurrect that which we hold so dear. If you’re a fan of Sara Gruen’s Like Water for Elephants or Sue Monk Kidd’s The Secret Life of Bees, then you’ll welcome this eerily gripping, poignant and deeply moving debut novel ranked alongside Pulitzer greats William Styron and Horton Foote.",
  "genres": [
    "Fiction"
  ],
  "author": "Laine Cunningham",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/31692655-the-family-made-of-dust"
}