{
  "title": "The Corpse: The Menace In The Mirror",
  "description": "WHO… OR WHAT...IS THE CORPSE???Is he the Living Dead, come to kill us all? Or is he a soldier of Justice, condemned to walk the face of the Earth, fighting a never-ending mission against law breakers, so that society may function?He dances on the brink of death and tumbles back, looking like a rotting zombie, but possessing the strength of great multitudes. Striking fear into the hearts of the criminal underworld and the general public alike, he walks the night, looking to crush evil. Always decaying, but never dying. Never able to rest but always willing to fight on. Chronically misunderstood by almost all,but fiercely dedicated to his task.Is he dead or alive? Man or superman? Friend or foe? Monster or Master? Angel or devil? Vigilante or Victim? Plague or Gift?He is all of these things, and none of them.He is… T H E C O R P S E !THE MANIFESTO OF THE CORPSEI create this, my manifesto, my oath and my pledge. Upon these words I swear to build my long and painful road to justice.I died today.My enemies wanted to wipe me off their lists. Obliterate me, make me vanish. So they killed me. But I didn’t die.They subjected me to the foulest possible tortures of mind, body and soul. Assaulted me with chemicals, electricity, powerful pharmaceutical compounds and surgical implements. And in the end, they were able to wipe my name off their lists.But it was only by dying that I could live yet again. Somehow, contrary to every goal they had worked for, the combination of insidious plagues heaped upon me by my bitterest foes transformed me into something of great power.Now, I am rock-solid proof of the that which does not kill me only serves tomake me stronger. For I have gone through, and beyond, life, and death. Penetratedfear. Absorbed all pain. Disconnected all my conscious thought processes. I have forged a wordless, seamless communication with the veryatoms around me. These very atoms can bend to my will, making my every thought a reality.They wanted to deform me, cripple me, destroy me. They wanted to make me a corpse. So that is what I will become for an insidious, regretless corpse. I will forever walk the endless night, cursingthe hearts of the unjust with paranoia and pain; always decaying but neverdying; unable to rest, but ever able to go on. For my charge is not ended. And it will never end as long as terror stalks this restless, churning world.Now, and from this day forward, the armies of evil will know fear. They will swallow madness. They will beg forgiveness, all to no avail. No pity will come to them. Ever. They will suffer in a manner that befits them. They will feel the same panic and despair and hopelessness they once forced upon others.But above and beyond all else, they will, now and forever, taste the hideous eternal wrath of...THE CORPSE!",
  "genres": [],
  "author": "Scott Mercer",
  "average_rating": "0.00",
  "url": "https://www.goodreads.com/book/show/31696104-the-corpse"
}