{
  "title": "Ferris' Bluff",
  "description": "Ace is on the run from everyone, it seems. He’s running from a busted Witness Protection Program assignment, an international collection of gangsters and arms merchants he pissed off working undercover, and worst of all—from his own scarred self-image and the nightmares that haunt him.After two lonely years on the road he risks a short visit with his old friend, Granville Tubbs, who lives in the sleepy small town of Ferris’ Bluff, Arkansas. He hasn’t even had a tingle that anyone has been on his trail for almost a year. What could go wrong in a few days?Plenty, it turns out. But some things go right, too…shotgun ambushes aside.The ultimate loner, Ace is soon brought under the spell of the quirky small town and its residents. As he tries to help Tubbs, all the while jealously guarding his alias, the friendliness of the townsfolk chips away at the wall of solitude he’s built. It’s as if Leets and Dicky and Art Drury are determined to become his new friends. And the pretty widow, Annie Travers—well, try as he might he can’t deny the growing mutual attraction between the two of them.He runs smack up against the dark side of Ferris’ Bluff in no time. The greedy lawyer, Tremont, and his slutty wife, Reena, are after something in Tubbs’ estate. The local mechanic, Pink, is out to mess him up, too. Ace is soon enmeshed in a battle of wits and wills with some of the locals.And if that ain’t thorny enough, Russian arms dealers who Ace hurt badly on his last assignment have been keeping a loose watch on Tubbs. When he discovers that Annie’s husband’s accident wasn’t an accident at all and Dicky Stover, the victim of a brutal beating, is killed while in the hospital, hitting the road is no longer an option.Ferris’ Bluff, a thriller with a smokin’ hot romance tucked inside!",
  "genres": [
    "Romance",
    "Mystery",
    "Fiction",
    "Thriller",
    "Suspense",
    "Amazon",
    "Romantic Suspense"
  ],
  "author": "Fred Limberg",
  "average_rating": "3.97",
  "url": "https://www.goodreads.com/book/show/11957507-ferris-bluff"
}