{
  "title": "The Breakup Support Group",
  "description": "After four years of first love bliss, Isla Rush just got dumped. Any hope she has of winning her ex-boyfriend back is shattered when the town rezones her neighborhood, forcing her to spend senior year at a wealthy high school in the next town over. With a broken heart consuming her soul, Isla can’t focus on anything, except maybe Emory Underwood—a ridiculously hot guy who dates a new girl almost every day. She can’t help but crush on him, even though it’s wrong. When memories of her ex make her cry in second period, the school counselor sends Isla to a club that meets during lunch. The Break-Up Support Group is a collection of broken-hearted misfits who are all helping each other heal. Just when Isla’s heart is finally on the mend, Emory shows up, forced to atone for all the broken hearts he’s caused over the years. While hiding her massive crush, she helps him understand the seriousness of breaking a heart. In turn, Emory offers to help Isla get back on the dating scene by agreeing to be her fake date for the homecoming dance. Isla gladly accepts the ruse, because if anyone can make her into a desirable girlfriend, Emory can! There's just one small problem.Isla's little crush on Emory might be exactly full blown. And a homecoming fake date with him could push her over the edge to possibly uttering the \"L Word!\"Isla can't afford another heartbreak so soon after the last one. She will have to resist his charms, refuse to look into those dreamy eyes, and above all else, not make the mistake of letting him kiss her. If only she hadn't let her guard down at the end of the night, under the light of her porch in a toe-curling kiss moment of weakness. And now, after months of Break-Up Support Group therapy, and with a heart fully on the mend, Isla has just handed it over to a guy who knows full well just how to break it.",
  "genres": [
    "Young Adult",
    "Contemporary",
    "Romance",
    "Young Adult Romance",
    "Young Adult Contemporary",
    "Contemporary Romance",
    "High School"
  ],
  "author": "Cheyanne Young",
  "average_rating": "3.98",
  "url": "https://www.goodreads.com/book/show/31697039-the-breakup-support-group"
}