{
  "title": "The Gallows Murders",
  "description": "In the summer of 1523, the weather has turned hot and the sweating sickness has returned to London to provide a fertile breeding ground for terrible murders and the most treasonable conspiracies. King Henry VIII has moved the court to Windsor, where he slakes his lusts while the kingdom is being governed by his first minister, Cardinal Thomas Wolsey. Wolsey, however, is not having an easy time. Someone is sending the king threatening letters from the tower, despatched under the name and seal of Edward, one of the princes supposedly murdered there, and demanding that great amounts of gold be left in different parts of London. If the orders are not carried out, proclamations will be published throughout the capital which, coinciding with the outbreak of plague, may make it look as though the hand of God has turned against the Tudors for usurping the throne. Henry VIII is truly terrified - and also intrigued by the mysterious and grisly murders occurring among the hangmen of London, whose guild also happens to meet in the tower. Wolsey has only two people to turn to: his beloved nephew, Benjamin Daunbey, and Daunbey's faithful servant, Roger Shallot, who reluctantly agree to go to London to unmask the blackmailer and end the macabre murders among the hangmen. Benjamin and Roger first meet with disaster in the murky Tudor underworld. They also become immersed in the ghastly world of the Gallowsmen, the royal executioners, many of whom are dying the same hideous deaths that they have meted out to others. And at the same time they must confront the mystery of the princes of the tower - an ancient murder that still haunts the English throne. When King Henry threatens that Shallot will hang from the highest scaffold in the kingdom unless the mysteries are resolved, the pressure mounts for Benjamin and Roger to find the answers - whether they be in London's foul alleyways or among the gorgeous splendor of the Tudor court.",
  "genres": [
    "Mystery",
    "Historical Fiction",
    "Historical Mystery",
    "Historical",
    "Fiction",
    "Crime",
    "Detective"
  ],
  "author": "Michael Clynes",
  "average_rating": "4.27",
  "url": "https://www.goodreads.com/book/show/1020337.The_Gallows_Murders"
}