{
  "title": "Christmas in America",
  "description": "The celebration of Christmas is a magical time for love. A new anthology filled with America's rich history and Christmas traditions from four of your favorite historical romance authors. “Christmas at Mount Holly” by Donna Thorland The Jerseys, December 23rd, 1776 - The American Revolution is on the brink of total collapse. The Rebels have lost New York, the Continental Army has endured a disastrous retreat through New Jersey, and Washington is about to lose what remains when enlistments expire on New Year’s Eve. The cause needs a miracle, but Christmas is a time for wonders: as Angela Ferrers—the woman known to history as the Widow of Mount Holly—will discover when she sets a honey trap for Hessian Colonel Count Carl Emil Urich von Donop, only to find herself ensnared in mutual attraction. “Miracle on Ladies’ Mile” by Joanna Shupe New York, 1895 - After losing his beloved wife, department store owner Alexander Armstrong seems incapable of anything other than work, despite his ache to be a better father to his daughter. When the pair encounters Grace, a charming shop girl designing the store’s Christmas window displays, he struggles to accept that perhaps miracles do happen in the most unlikely of places… “The Cowboy’s Christmas” by Piper Huguley Smithson, Oklahoma Territory, 1893 - Postponing her missionary trip to Africa, apprentice teacher Serena Newcomb must travel west to face the unrequited love of her past -- rebel cowboy Baxter Smithson. Banished from his Georgia home for the crime of falling in love with the wrong woman, Baxter is surprised that his Christmas gift is a grown-up Serena, ready to confront him for ignoring his duty and to show him that the true meaning of Christmas is love. “Into the Evermore” by Holly Bush (67 pages)Virginia, 1842 - Eleanor McManus, upright daughter of a minister, is rescued from kidnappers somewhere in the deep forest wilderness by a rough and tumble fur trader, Beauregard Gentry. With his help, Eleanor makes her way back to her intended groom who declares her soiled, and she finds herself alone, pressured to make life decisions without benefit of family or others she can trust. Beauregard and Eleanor agree to begin a life together, build their legacy together, and their growing devotion to each other is witnessed one cold, crisp Christmas morning.",
  "genres": [],
  "author": "Holly  Bush",
  "average_rating": "3.67",
  "url": "https://www.goodreads.com/book/show/31694019-christmas-in-america"
}