{
  "title": "Shape Shifter Storm of Sex",
  "description": "Kiki Woods –FMF Menage Werewolf RomanceWhen billionaire Abe McKenna hires Jim Cooper and ‘Buzz’ Lattier to track down an unknown creature, the pair have little idea of what awaits then in the deep woods, a hundred miles from any town.But McKenna knows the forest contains at least one prized specimen that he is determined to recapture—a shifter capable of killing a full-grown grizzly.Little does he realize that he has sent the hunters into the clutches of not one, but two shifter women, both of whom are determined to avoid capture at all costs.But will their unique need to mate regularly with humans leave them vulnerable? Will Jim and Buzz give in to the women’s demands, or will they resist and fulfill their mission to capture the pair and return them to McKenna unharmed?Shifting Wood is a tale of untamed lust among the creatures of the deep forest, and those who live in the twilight between the world of humans and animals.Her Bearing –BBW Werebear RomanceWhen Cara Hawthorne goes into the Alaskan wilds to finish her late husband’s nature documentary, the last thing she expects is to fall in love with a strange man she finds injured in the forest. Having just woken from a near-death grizzly bear encounter, Cara tries to help the man by taking him back to her tent.While trying to healing the man’s wounds, she can’t help but gawk at his perfectly muscular body. It’s not her fault that the man was nude when she found him—but the half-conscious man’s muscles and skin are just begging Cara to cleanse them.Cara gives into her temptations with the acceptance of the man, who introduces himself as Garth. After their brief time together, Cara’s camp is attacked by the grizzlies from earlier, and Garth must protect her yet again. What was supposed to be a casual rescue mission on Garth’s behalf turns into a romantic liaison that will challenge him to reclaim his title as king of the forest.Mistress Vanessa's Pets Episode 2-Lesbian Threesome FFM Werewolf RomanceTrapped in Mistress Vanessa’s dungeon, Marla watched in horror as the vile witch magically transported away, abducting her werewolf lover Jason, and the traitor Janet’s wife. Before she can even think of planning a rescue, Marla must come to terms with Janet, and find a way to release her alien love Laird from his encasing stasis field.Their journey takes them from the lonely forests of Maine to an ancient palace in the Syrian Desert. On her quest, Marla compels the assistance of a talking android head, is seduced into a lesbian affair, reunites with a love-struck sex-shifting alien, and is forced to pleasure a licentious celebrity werewolf.But when a sassy young Japanese princess becomes her thrall, Marla faces a final betrayal which will force her and her companions into slavery as Mistress Vanessa’s Pets.Quarterback Dances –BWWM Football and Werebear RomanceRosalina Parks is a great dancer; some would even say an amazing dancer. However, for the past five months she’s been stuck in a dead end relationship and hesitant to get out of it. Awkward social situations just aren’t her forte. When her friend comes to her with proof that her boyfriend is cheating on her, all bets are off.Enter Owen Marshal, a star football quarterback slash bear shifter in a serious rut. His team barely made it to the Superbowl and it was mostly his fault. Frankly, he’s lost his drive, and everyone is suffering for it. In a desperate bid to get him back up to par, his teammates take him to a dance club. The same club Rosalina just happened to be at the right time.Download for FREE with Kindle Unlimited This eBook contains mature language and content intended for 18+ readers only!",
  "genres": [],
  "author": "P.N. Books",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/31697282-shape-shifter-storm-of-sex"
}