{
  "title": "The Company Town: The Industrial Edens and Satanic Mills That Shaped the American Economy",
  "description": "Company The very phrase sounds un-American. Yet company towns are the essence of America. Hershey bars, Corning glassware, Kohler bathroom fixtures, Maytag washers, Spam -- each is the signature product of a company town in which one business, for better or worse, exercises a grip over the population. In The Company Town, Hardy Green, who has covered American business for over a decade, offers a compelling analysis of the emergence of these communities and their role in shaping the American economy, beginning in the country's earliest years.From the textile mills of Lowell, Massachusetts, to the R&D labs of Corning, New York; from the coal mines of Ludlow, Colorado, to corporate campuses of today's major tech America has been uniquely open to the development of the single-company community. But rather than adhering to a uniform blueprint, American company towns represent two very different strands of capitalism. One is socially benign -- a paternalistic, utopian ideal that fosters the development of schools, hospitals, parks, and desirable housing for its workers. The other, \"Exploitationville,\"; focuses only on profits, at the expense of employees\"; well-being.Adeptly distinguishing between these two models, Green offers rich stories about town-builders and workers. He vividly describes the origins of America's company towns, the living and working conditions that characterize them, and the violent, sometimes fatal labor confrontations that have punctuated their existence. And he chronicles the surprising transformation underway in many such communities today. With fascinating profiles of American moguls -- from candyman Milton Hershey and steel man Elbert H. Gary to oil tycoon Frank Phillips and Manhattan Project czar General Leslie B. Groves -- The Company Town is a sweeping tale of how the American economy has grown and changed, and how these urban centers have reflected the best and worst of American capitalism.",
  "genres": [
    "History",
    "Nonfiction",
    "Economics",
    "American History",
    "Historical",
    "Labor"
  ],
  "author": "Hardy Green",
  "average_rating": "3.32",
  "url": "https://www.goodreads.com/book/show/11957538-the-company-town"
}