{
  "title": "Undercover Amish",
  "description": "She left the Amish to become a police officer, but she never thought her most difficult case would be in her former community.Detective Olivia Mast swore she’d never return to Unity, Maine, where she lost her entire family to a fire and killed her abusive husband in self-defense. She’d rather run through gunfire than go back there, but she has her orders.The community refuses to seek justice after a murder, so Olivia must don her prayer kapp once more to investigate undercover. She’s the only one in her unit able to blend in as one of the Amish and get information from them.Because she’s going undercover, she has to deceive her community and family by letting them think she wants to rejoin the Amish and come home for good.To top it all off, she must also covertly protect the man she dated as a teenager, Isaac Troyer, who somehow looks even better now than he did back then. But that’s beside the point. They aren’t the teenagers they used to be.When Olivia returns to Unity, Isaac Troyer believes he’s getting a second chance at love.Though a plain cabinet maker, he’s a target. And he has no idea Olivia is now an undercover detective carrying a 9mm under her skirts.When Olivia realizes she needs Isaac's help most of all because of his connections to the suspect, she must tell him the truth. Will Isaac be willing to break sacred Amish rules in order to help Olivia stop the murderer?Undercover Amish was a finalist in Maine Romance Writers Strut Your Stuff Competition 2015 where it received 26 out of 27 points!\"Buy this book! It's a five-star read in my opinion. Whether you have ever read Amish detective stories before or not, I know you'll like this one and be totally engaged from start to finish. The characters are well-developed, unique, quirky and three-dimensional. I enjoyed the author giving her readers an inside view of the Amish community, especially during dangerous and unpredictable times. I eagerly await the sequel to this novel!\"-Wendy Pearson, moderator of The Write PracticeThis is book 1 in the Covert Police Detectives Unit Series, and this series can be read in any order.In this AmishAmish Under FireAmish AmnesiaAmish AssassinAmish AliasAmish AccidentAmish IdentityAmish Espionage",
  "genres": [
    "Amish",
    "Mystery",
    "Christian",
    "Christian Fiction",
    "Fiction",
    "Romance",
    "Amish Fiction"
  ],
  "author": "Ashley Emma",
  "average_rating": "4.16",
  "url": "https://www.goodreads.com/book/show/31705897-undercover-amish"
}