{
  "title": "The New Thought Police: Inside the Left's Assault on Free Speech and Free Minds",
  "description": "Our freedom to speak our minds is under attack. Like the Thought Police of George Orwell's 1984, powerful special interest groups on the Left are mounting a withering assault on our rights in the name of \"social equality.\" Liberty has been turned on its ear as the rights of the few restrict the freedom of everyone. From rigid speech codes on college campuses to the knee-jerk use of such labels as \"racist,\" \"sexist,\" and \"homophobe\" in an attempt to socially ostracize people with opposing viewpoints, speaking one's mind today has become increasingly dangerous.Until now.In The New Thought Police, author Tammy Bruce, a self-described lesbian feminist activist, cuts through the deluge of politically correct speech and thought codes to expose the dangerous rise of left-wing McCarthyism. After spending several years as a prominent civil-rights activist and in leadership positions at NOW—an organization she currently decries as a foot soldier in the war against free speech—Ms. Bruce has experienced first-hand the campaigns from the Left against our fundamental freedom of expression. Threats to silence radio and television hosts, book and newspaper burnings, expulsions of students for utterances offensive to select groups—all are common practices in a long line of attacks on people whose opinions do not conform with the agendas championed by national feminist, racial, and gay organizations. Ms. Bruce leaves no sacred cow of the Left untouched, and you'll be surprised to find how what you see, hear, say, and think has been influenced by the bullies on the Left.Provocative and persuasive, The New Thought Police is a clarion call to anyone interested in preserving liberty.",
  "genres": [
    "Politics",
    "Nonfiction",
    "Cultural",
    "Adult",
    "Feminism",
    "Language"
  ],
  "author": "Tammy Bruce",
  "average_rating": "3.81",
  "url": "https://www.goodreads.com/book/show/1195788.The_New_Thought_Police"
}