{
  "title": "The Mighty Queens of Freeville: A Mother, a Daughter, and the People Who Raised Them",
  "description": "Amy Dickinson has made a career out of helping others, through her internationally syndicated advice column \"Ask Amy.\" Readers love her for her honesty, her small-town values, and for the fact that her motto is \"I make the mistakes so you don't have to.\" In The Mighty Queens of Freeville, Amy Dickinson shares those mistakes and her remarkable story. This is the tale of Amy and her daughter and the people who helped raise them after Amy found herself a reluctant single parent. Though divorce runs through her family like an aggressive chromosome, the women of her family taught her what family is about. They helped her to pick up the pieces when her life fell apart and to reassemble them into something new. It is a story of frequent failures and surprising successes, as Amy starts and loses careers, bumbles through blind dates and adult education classes, travels across the country with her daughter and their giant tabby cat, and tries to come to terms with the family's aptitude for \"dorkitude.\" Though they live in London, D.C., and Chicago, all roads lead them back to her hometown of Freeville (pop. 458), a tiny village where Amy's family has tilled and cultivated the land, tended chickens and Holsteins, and built houses and backyard sheds for more than 200 years. Most important, though, her family members all still live within a ten-house radius of each other. With kindness and razor-sharp wit, they welcome Amy and her daughter back weekend after weekend, summer after summer, offering a moving testament to the many women who have led small lives of great consequence in a tiny place.",
  "genres": [
    "Memoir",
    "Nonfiction",
    "Biography Memoir",
    "Book Club",
    "Biography",
    "Humor",
    "Autobiography"
  ],
  "author": "Amy Dickinson",
  "average_rating": "3.66",
  "url": "https://www.goodreads.com/book/show/3170683-the-mighty-queens-of-freeville"
}