{
  "title": "Lottie and Lisa",
  "description": "Two nine year old girls meet at a holiday home. The movie The Parent Trap was based on this book.Es ist lange her, daß mir Luise und Lotte begegnet sind. Allerdings erinnere ich mich noch genau, daß ich die Situation, in der sich die beiden kennenlernten, sehr gut nachvollziehen konnte, denn ich war selbst schon einige Male, angeblich zu meinem Besten, zur Erholung in ein Ferienheim gesteckt worden. Schon damals war mir, ähnlich wie Lotte, nicht klar, wovon ein Kind sich erholen sollte. So treffen sich die beiden ungleichen Mädchen also im wunderschönen Seebühl am Bühlsee im Ferienheim. Übrigens, die Sprachspielereien von Erich Kästner, die er für seine jungen Leser eingestreut hat, habe ich mit Begeisterung aufgenommen, so wie ich es auch geliebt habe, am Beginn jedes Kapitels von ihm ein bißchen neugierig gemacht zu werden, wenn er einen kleinen Ausblick gibt, was auf den nächsten Seiten geschehen wird. Sicher, es sind Kleinigkeiten, aber wegen diesen kleinen, wichtigen Nichtigkeiten wurde Erich Kästners Das doppelte Lottchen zu einem Lieblingsbuch vieler Kinder -- bis heute. Die Geschichte der grundverschiedenen Zwillinge ist schnell erzählt. Nachdem sie sich erstaunt betrachten und feststellen, daß sie sich wie ein Ei dem anderen gleichen, ist der nächste Schritt nicht schwer. Sie entdecken, daß sie dieselben Eltern haben, die sich vor vielen Jahren scheiden ließen, und beschließen, möglichst bald ihre Elternteile wieder zusammenzuführen. Dazu tauschen sie die Rollen. Die unordentliche, eher lockere Luise reist nach München, um dort den Haushalt der überlasteten, berufstätigen Mutter zu übernehmen. Das Hausmütterchen Lotte fährt zum Vater nach Wien, der die so sorgfältig planende, ordentliche Tochter nach den Ferien gar nicht mehr wiedererkennt. Selbst der geliebte Palatschinken scheint ihr nicht mehr zu schmecken. Als 1949 das Buch erstmals nach dem Krieg erschien, war es ein Skandal, denn die Hüter der Schriften für Kinder wollten das Thema Scheidung nicht im Kinderbuch thematisiert wissen und stuften deshalb Kästners Roman für Kinder als \"Nicht empfehlenswert\" ein. Gott sei Dank haben die Meinungen der vielen kleinen Leser mehr Gewicht, die mit heißen Ohren bei den Abenteuern der Zwillinge mitgefiebert haben. --Manuela Haselberger",
  "genres": [
    "Childrens",
    "Classics",
    "German Literature",
    "Fiction",
    "Middle Grade",
    "Young Adult",
    "Germany"
  ],
  "author": "Erich Kästner",
  "average_rating": "4.14",
  "url": "https://www.goodreads.com/book/show/1195796.Lottie_and_Lisa"
}