{
  "title": "Jaded Hearts",
  "description": "Book 1 of The Jaded Hearts Club: *This book contains content of a graphic nature. 18 and over suggested.*1. JadedThe end result of having a steady flow of negative experiences, disappointment, and unfulfillment, fed into a person where they get to the point where their anger circuits just sort of burn out and they accept disillusionment.****************************************************************************************************************************Jaded Hearts is not a typical love story. It's Jade's story, filled with moments of love, lust, heartache, and confusion. She has been jaded, by certain circumstances in her life, but she is determined to find her way. This is a tale of her coming of age. It may not always be pretty, but you won't want to look away! *****************************************************************************24 year-old Jade Spencer is at a crossroads. She has spent her entire life living under the shadow of someone else's rule. First, her controlling grandmother, who unwillingly inherited the job of raising her and her brother Drew. Then, her fiance Evan, who was also controlling. Notice a theme? Now she is ready to live life by her own rules. She breaks it off with her shady fiance, and packs her bags for good. What better place to follow your dreams and desires than New York City? With help from her Aunt Vivian; her cousin Jackie; a new place; new job, and new experiences waiting, she intends to live life to the fullest. But, things turn tricky when two fated encounters both lead to powerful emotions. Julian Garza is the most desirable, and haunting man Jade has ever met. He sets her on fire from their very first chance encounter. Jade finds him totally irresistible, and promptly falls under his spell. But there is a dark shadow attached to Julian that leaves Jade hesitant, and has her aunt telling her to run. John Benson is the perfect man. A handsome, successful lawyer; John provides a friendship like no other, and a love that Jade has never known. For the first time she feels truly loved, but we all know there is no such thing as perfect. So you have a not so classic love triangle, with a hint of mystery. What could possibly be the problem? Jade doesn't believe in love, and lives by denial. Being abandoned by her mother at a young age has left her with a hard shell around her heart, an an even harder time letting her feelings show. As she tries to find herself through her new relationships, Jade learns the hard way that sometimes intentions mean everything, and nothing at all. Will she find love or will she leave a trail of jaded hearts? Love, secrets, and lies are all on the menu.****************************************************************************Join the Jaded Hearts Club on Facebook:https://www.facebook.com/groups/Jaded...",
  "genres": [
    "Erotica",
    "Romance",
    "Interracial Romance"
  ],
  "author": "Olivia Linden",
  "average_rating": "3.88",
  "url": "https://www.goodreads.com/book/show/31748983-jaded-hearts"
}