{
  "title": "1960--LBJ vs. JFK vs. Nixon: The Epic Campaign That Forged Three Presidencies",
  "description": "It was the election that would ultimately give America “Camelot” and its tragic aftermath, a momentous contest when three giants who each would have a chance to shape the nation battled to win the presidency.Award-winning author David Pietrusza does here for the 1960 presidential race what he did in his previous book, 1920: the Year of the Six Presidents—which Kirkus Reviews selected as one of their Best Books of 2007. Until now, the most authoritative study of the 1960 election was Theodore White’s Pulitzer Prize-winning The Making of the President, 1960. But White, as a trusted insider, didn’t tell all. Here’s the rest of the story, what White could never have known, nor revealed. Finally, it’s all out—including JFK’s poignant comment on why LBJ’s nomination as vice president would be inconsequential: “I’m 43 years old. I’m not going to die in office.”Combining an engaging narrative with exhaustive research, Pietrusza chronicles the pivotal election of 1960, in which issues of civil rights and religion (Kennedy was only the second major-party Roman Catholic candidate ever) converged. The volatile primary clash between Senate Majority leader LBJ and the young JFK culminated in an improbable fusion ticket. The historic, legendary Kennedy-Nixon debates followed in its wake. The first presidential televised debates, they forever altered American politics when an exhausted Nixon was unkempt and tentative in their first showdown. With 80 million viewers passing judgment, Nixon’s poll numbers dropped as the charismatic Kennedy’s star rose. Nixon learned his lesson—resting before subsequent debates, reluctantly wearing makeup, and challenging JFK with a more aggressive stance—but the damage was done.There’s no one better to convey the drama of that tumultuous year than Pietrusza. He has 1,000 secrets to spill; a fascinating cast of characters to introduce (including a rogue’s gallery of hangers-on and manipulators); and towering historical events to chronicle. And all of it is built on painstaking research and solid historical scholarship. Pietrusza tracks down every lead to create a winning, engaging, and very readable account.With the 2008 elections approaching, politics will be on everyone’s mind, and 1960: LBJ vs. JFK vs. Nixon will transform the way readers see modern American history. A sampling of what Theodore White couldn’t chronicle—and David Pietrusza does:·     Richard Nixon’s tempestuous Iowa backseat blowup, and his  bizarre Election Day road trip·     The full story of a sympathetic call from JFK to Coretta Scott King·      John Ehrlichman’s spy missions on the Nelson Rockefeller and Democratic    camps·      The warnings before Election Day that Chicago’s mayor Daley would try to fix the race’s outcome·       JFK’s amphetamine-fueled debate performance",
  "genres": [
    "History",
    "Politics",
    "Nonfiction",
    "American History",
    "Presidents",
    "Biography",
    "Us Presidents"
  ],
  "author": "David  Pietrusza",
  "average_rating": "4.14",
  "url": "https://www.goodreads.com/book/show/3173939-1960--lbj-vs-jfk-vs-nixon"
}