{
  "title": "An Unseen Angel: A Mother's Story of Faith, Hope, and Healing After Sandy Hook",
  "description": "“From the deepest pain a mother can imagine, comes a beautiful book whose message of redemption and healing touches all of us. A testament to the best parts of human nature and the power of resilience.\" ―Lee Woodruff – Contributing Reporter for CBS This Morning and New York Times Best-selling author \"Alissa Parker's personal journey brings you out from the depths of that fateful day at Sandy Hook Elementary School to lessons applicable to everyone on how to rise above the evil and hardships faced in our lives.\" ―Mark Shriver, bestselling author and president of Save the Children Action Network As the mother of one of the children who died at Sandy Hook school in Newtown, Connecticut, in 2012, Alissa Parker had her world shattered by a mass murderer's rampage. She was left to make sense of her daughter's life and death and to rebuild, seeking a deeply spiritual path to carry on with her life and find new meaning and purpose.As a co-founder of SafeandSoundSchools.org, a touring national advocacy group that helps people take action to make schools safer, Alissa has talked to hundreds of parents around the country about her ordeal and how she was able to endure the unspeakable horror of Sandy Hook.An Unseen Angel takes readers though Alissa's complete journey, chronicling the moment-by-moment account of the day that began with every parent's worst hearing, \"There's been a shooting at your child's school.\" It follows her faith-filled spiritual path to coping, healing, forgiving, and eventually feeling gratitude for the life and love of her daughter Emilie. She describes a bond of love between a mother and daughter that is so profound it transcends the physical body and touches Alissa and the people who loved Emilie who feel her presence every day. And she articulates her deep Christian faith, which guided the answers to Alissa's gut-wrenching, post-tragedy This is the first book about the school-shooting tragedies with a focus on faith and spirituality. As we learn Alissa's story, we are introduced to a special little girl who was wise beyond her years and whose lessons about life and the transcendent power of love continued even after she had passed away.\"",
  "genres": [
    "Nonfiction",
    "Memoir",
    "Biography",
    "Book Club",
    "Lds",
    "Religion",
    "Christian"
  ],
  "author": "Alissa Parker",
  "average_rating": "4.60",
  "url": "https://www.goodreads.com/book/show/31747186-an-unseen-angel"
}