{
  "title": "La strada bianca: Storia di una passione",
  "description": "Una manciata di minuscole sculture giapponesi ha ispirato Edmund de Waal. E una manciata di candidi detriti raccolta sul monte Kao-Ling, in Cina, spinge l’autore a esclamare «Questo è il mio inizio».L’inizio di un viaggio sulle tracce dell’«oro bianco», per raccontare la storia della porcellana. Qui lo seguiamo da Jingdezhen a Venezia, a Versailles, a Dublino, a Dresda, fino alle colline della Cornovaglia e ai monti Appalachi del South Carolina, mentre racconta la storia di una vera e propria ossessione per «il bianco perfetto». Lungo la strada incontra i testimoni della creazione della porcellana: tutti quelli che da quel bianco sono stati ispirati, arricchiti o afflitti; e dei tanti che hanno avuto la vita, il corpo e la mente spezzati dall’affanno della ricerca. L’autore percorre un millennio per arrivare ad alcuni dei momenti più tragici della storia contemporanea. Eroi o vittime dell’invenzione e della produzione del prezioso materiale, i personaggi più disparati: dagli imperatori cinesi ai loro schiavi; dall’elettore di Sassonia e re di Polonia Augusto II al piccolo alchimista da lui imprigionato perché produca quel materiale «semitraslucido e latteo, come i petali di un narciso»; dal farmacista quacchero che esplora le colline della Cornovaglia distratto solo dalla morte della giovane moglie; a Lenin e al suo intervento al Congresso dei lavoratori del vetro e della porcellana: «Questo bianco è una rivoluzione»; a Himmler, che allestisce a Dachau un laboratorio per la fabbricazione di statuine da regalare ai membri del cerchio magico di Hitler.In parte memoir, in parte racconto storico, in parte detective story, evoca la mappa di un desiderio legato all’arte, alla ricchezza e alla purezza. Con uno stile avvincente Edmund de Waal, ceramista di fama mondiale, racconta la sua passione per «l’oro bianco», cercando di capire come il fascino misterioso della porcellana, la sua fragilità e il suo colore abbiano ossessionato e condizionato per secoli le sorti di uomini, regni e filosofie.",
  "genres": [
    "Nonfiction",
    "History",
    "Art",
    "Memoir",
    "Travel",
    "Biography",
    "Art History"
  ],
  "author": "Edmund de Waal",
  "average_rating": "3.81",
  "url": "https://www.goodreads.com/book/show/31747842-la-strada-bianca"
}