{
  "title": "The Potlikker Papers",
  "description": "A people's history of Southern food that reveals how the region came to be at the forefront of American culinary culture and how issues of race have shaped Southern cuisine over the last six decadesTHE POTLIKKER PAPERS tells the story of food and politics in the South over the last half century. Beginning with the pivotal role of cooks in the Civil Rights movement, noted authority John T. Edge narrates the South's journey from racist backwater to a hotbed of American immigration. In so doing, he traces how the food of the poorest Southerners has become the signature trend of modern American haute cuisine. This is a people's history of the modern South told through the lens of food.Food was a battleground in the Civil Rights movement. Access to food and ownership of culinary tradition was a central part of the long march to racial equality. THE POTLIKKER PAPERS begins in 1955 as black cooks and maids fed and supported the Montgomery Bus Boycott and it concludes in 2015 as a Newer South came to be, enriched by the arrival of immigrants from Lebanon to Vietnam to all points in between.Along the way, THE POTLIKKER PAPERS tracks many different evolutions of Southern identity --first in the 1970s, from the back-to-the-land movement that began in the Tennessee hills to the rise of fast and convenience foods modeled on Southern staples. Edge narrates the gentrification that gained traction in North Carolina and Louisiana restaurants of the 1980s and the artisanal renaissance that reconnected farmers and cooks in the 1990s and in the 00s. He profiles some of the most extraordinary and fascinating figures in Southern food, including Fannie Lou Hamer, Colonel Sanders, Edna Lewis, Paul Prudhomme, Craig Claiborne, Sean Brock, and many others.Like many great provincial dishes around the world, potlikker is a salvage food. During the antebellum era, masters ate the greens from the pot and set aside the left-over potlikker broth for their slaves, unaware that the broth, not the greens, was nutrient-rich. After slavery, potlikker sustained the working poor, black and white. In the rapidly gentrifying South of today, potlikker has taken on new meanings as chefs have reclaimed the dish.Over the last two generations, wrenching changes have transformed the South. THE POTLIKKER PAPERS tells the story of that change--and reveals how Southern food has become a shared culinary language for the nation.Music Copyright (c) 2012, Lee Bains III",
  "genres": [
    "Food",
    "History",
    "Nonfiction",
    "Cookbooks",
    "Cooking",
    "Audiobook",
    "American History"
  ],
  "author": "John T. Edge",
  "average_rating": "3.81",
  "url": "https://www.goodreads.com/book/show/31750994-the-potlikker-papers"
}