{
  "title": "Night Shadow",
  "description": "The passion and suspense of Cherry Adair’s latest killer trilogy, begun in Night Fall and continued in Night Secrets, now reaches its explosive conclusion in Night Shadow, as mismatched international agents take on evil head-to-head–and each other heart-to-heart.Aside from working for the international anti-terrorism agency T-FLAC (and having the same last name), Lexi Stone and Alex Stone are polar opposites, right down to Lexi’s mere mortality and Alex’s paranormal powers. While straight-arrow Lexi pushes paper at an Internal Affairs desk, renegade Alex is busy pushing the envelope as he pursues the most dangerous global criminals. And though Lexi disdains his rule-breaking bravado and cowboy tactics, she can’t deny Alex’s skills when it comes to getting his man (not to mention any number of women)–just as she can’t ignore how his roguish charm makes her heart race and her temperature rise.But Lexi’s secret desires clash head-on with her duties when suspicions arise that Alex is poised to switch sides–and join forces with a European terrorist cell. Tapped for her first field mission, Lexi finds herself assigned to shadow Alex’s every move, and if necessary, terminate him. Despite her feelings, Lexi’s willing and able to carry out her orders, as long there’s proof that Alex is a traitor. But getting the goods–and the drop–on her superagent quarry becomes an even tougher task when Lexi and Alex suddenly find themselves partners on an emergency mission in Russia. When terrorists seize a busy Moscow railway station for ransom, then abruptly massacre their hostages and vanish into thin air, the agents realize they’re facing adversaries possessing of the same paranormal abilities as Alex’s elite T-FLAC/psi unit. But after Lexi kills an armed suspect during a breathless rooftop chase, she makes a series of shocking discoveries about the enemy T-FLAC is facing, the troubling truth Alex has been concealing, and the terrifying plot of a treacherous mastermind that could spell the downfall of T-FLAC’s most powerful and valued operatives. To save precious lives and stop the rise of a superhuman terrorist threat, Lexi and Alex must work as a well-oiled team in a race across the globe–and against time–with lethal shadows looming behind them, and no one to trust but each other.From the Hardcover edition.",
  "genres": [
    "Romantic Suspense",
    "Romance",
    "Paranormal",
    "Paranormal Romance",
    "Suspense",
    "Audiobook",
    "Contemporary"
  ],
  "author": "Cherry Adair",
  "average_rating": "3.93",
  "url": "https://www.goodreads.com/book/show/3176532-night-shadow"
}