{
  "title": "Motherhood: Lost and Found",
  "description": "Lost and Found takes the reader on a journey where Alzheimer’s disease and infertility intersect. At age 33, award-winning author and poet Ann Campanella returns to her home state of North Carolina ready to build a horse farm and start a family. Ann’s foundation is shaken when she experiences multiple miscarriages at the same time her mother spirals into Alzheimer’s. The author’s devotion to her family and her horse Crimson sustain her as her mother’s illness progresses and her own window of potential motherhood begins to close. The voice in Ann’s memoir has been called constant and abiding, her imagery indelible. Her graceful, exacting language rises above the grief of infertility and the struggle to care for aging parents, connecting the reader ultimately to the heartbeat and resilience of the human experience. This memoir was a finalist in the Next Generation Independent Book Awards, the world’s largest not-for-profit independent book awards. Praise for Lost and “Ann Campanella’s Lost and Found is a chronicle of family tragedy and triumph told in some of the most truly lyrical writing you’ll ever encounter. She writes of grief and loss with heart wrenching honesty but without sentimentality then adds humor in such unexpected places I found myself laughing and crying all on the same page. This is the best memoir I’ve read in years....”- Judith Minthorn Stacy, author of Maggie Sweet, winner of the Carolina Novel Award “The book is about ... the love of a family ... and how that love sustained them during a long and painful crisis, and how Ann’s relationship with her husband Joel was deepened and enriched by that crisis, and how three generations are better than two. Lost and Found has much to teach us all as human beings.”- Anthony (Tony) Abbott, Professor Emeritus at Davidson College, author of Leaving Maggie Hope, winner of the Novello Festival Press Book Award “A sensitive, in-depth study of one woman’s slow descent into Alzheimer’s as detailed by her daughter, Lost and Found involves us in the dynamic of a multi-generational family as well as the author’s own horses, poetry, three terrible miscarriages, and in her 41st year, a final miracle.” - Maxine Kumin, Pulitzer Prize winning poet “Ann Campanella’s Lost and Found records the ordinary and extraordinary courage of those who must endure debilitating, even crushing illness and those who must suffer with them while they do so. Here is bravery, patience, reconciliation, and -- at long last -- hope. I found this story valuable in an intensely personal way. I think others readers will find it so too.”- Fred Chappell, former Poet Laureate of North Carolina “I was so deeply touched by this memoir. Anyone with children or aging parents will be moved by this searingly honest story. Ann struggled with infertility at the same time she was trying to care for her mother with Alzheimer's. In a clear-eyed way, she explores how her family navigated the suffering caused by her mother's illness, and her own heartbreak of multiple miscarriages. Every sentence is beautifully crafted, with a poet's attention to detail. The images are indelible, and in the end, the reader is completely uplifted by love and hope.” - Lisa Willliams Kline, award-winning author About the Author Formerly a magazine and newspaper editor, Ann Campanella writes creative nonfiction and poetry. After a chain of personal hardships, including a series of miscarriages and her mother becoming ill with Alzheimer’s, she felt compelled to share her story.",
  "genres": [
    "Memoir",
    "Nonfiction"
  ],
  "author": "Ann Campanella",
  "average_rating": "4.14",
  "url": "https://www.goodreads.com/book/show/31751667-motherhood"
}