{
  "title": "A Composition in Murder",
  "description": "“Cherry Tucker is a strong, sassy, Southern sleuth who keeps you on the edge of your seat.” – Tonya Kappes, USA Today Bestselling Author“Anyone who likes humorous mysteries will also enjoy local author Larissa Reinhart, who captures small town Georgia in the laugh-out-loud escapades of struggling artist Cherry Tucker.” – Fayette Woman Magazine“The tone of this marvelously cracked book is not unlike Sophie Littlefield’s brilliant A Bad Day for Sorry, as author Reinhart dishes out shovelfuls of ribald humor and mayhem.” – Mystery Scene Magazine (on Portrait of a Dead Guy)“The hilariously droll Larissa Reinhart cooks up a quirky and entertaining page-turner! This charming mystery is delightfully Southern, surprisingly edgy, and deliciously unpredictable.” – Hank Phillippi Ryan, Agatha Award-Winning Author of Truth Be Told (on Still Life in Brunswick Stew)“Artist and accidental detective Cherry Tucker goes back to high school and finds plenty of trouble and skeletons…Reinhart's charming, sweet-tea flavored series keeps getting better!” – Gretchen Archer, USA Today Bestselling Author of the Davis Way Crime Caper Series (on Death in Perspective)At Halo House, Cherry Tucker finds the tea deadly sweet…With a new art teaching gig at Halo House—Halo, Georgia’s posh independent living home—and Halo society scrutinizing her family and her love life, Cherry Tucker needs to stay out of trouble. However, her sleuthing skills are sought out by Halo House’s most famous resident: Belvia Brakeman, the ninety-year-old, blind CEO and founder of Meemaw’s Tea. Belvia confides in Cherry that the family tea empire is in jeopardy. The CEO suspects her daughter, the COO, has been murdered and she might be next. Her offer is hard to refuse, but will have Cherry treading on Forks County Sheriff toes, namely her personal Deputy Heartache, Luke Harper.Amid her town troubles, can Cherry put her reputation, romance, and life on the line for the final request of a sweet tea tycoon? While she juggles senior citizen shenanigans, small-town politics, and corporate family scandals, Cherry finds the sweet tea business cutthroat in more ways than one.",
  "genres": [
    "Cozy Mystery",
    "Mystery",
    "Amateur Sleuth",
    "Cozy",
    "Whodunit",
    "Southern",
    "Murder Mystery"
  ],
  "author": "Larissa Reinhart",
  "average_rating": "4.54",
  "url": "https://www.goodreads.com/book/show/31752204-a-composition-in-murder"
}