{
  "title": "Loving Frank",
  "description": "NEW YORK TIMES BESTSELLER • From the author of The House of Lincoln , an “enthralling” novel that brings “the buried truths of the ill-starred relationship of Mamah Borthwick Cheney and Frank Lloyd Wright to light” ( The New York Times Book Review ).“Masterful.”— People“A fascinating love story.”— San Francisco Chronicle“Truly artful fiction.”— The New York Times“I have been standing on the side of life, watching it float by. I want to swim in the river. I want to feel the current.”So writes Mamah Borthwick Cheney in her diary as she struggles to justify her clandestine love affair with Frank Lloyd Wright. Four years earlier, in 1903, Mamah and her husband, Edwin, had commissioned the renowned architect to design a new home for them. During the construction of the house, a powerful attraction developed between Mamah and Frank, and in time the lovers, each married with children, embarked on a course that would shock Chicago society and forever change their lives.  Drawing on years of research, Horan weaves little-known facts into a compelling narrative, vividly portraying the conflicts and struggles of a woman forced to choose between the roles of mother, wife, lover, and intellectual. Mamah’s is an unforgettable journey marked by choices that reshape her notions of love and responsibility, leading inexorably to this novel’s stunning conclusion.Elegantly written and remarkably rich in detail, Loving Frank is a fitting tribute to a courageous woman, a national icon, and their timeless love story. Winner of the James Fenimore Cooper Prize for Best Historical Fiction • One of the Best Books of the Year: The Washington Post, The Chicago Tribune, Minneapolis Star Tribune, The Christian Science Monitor",
  "genres": [
    "Historical Fiction",
    "Book Club",
    "Fiction",
    "Historical",
    "Architecture",
    "Romance",
    "Adult Fiction"
  ],
  "author": "Nancy Horan",
  "average_rating": "3.77",
  "url": "https://www.goodreads.com/book/show/3180931-loving-frank"
}