{
  "title": "Justifiable Homicide: A Novel of Intrigue and Adventure",
  "description": "Brad Morris, an ex-army officer, met his future wife, Rachel Duncan, at an Australian army specialist training faculty. Both held black belts in karate and were experts in weaponry and marksmanship. They soon became friends, started dating, and fell in love.  Rachel, finding army life too restricting, left the army and joined the Australian Federal Police force. Brad, to be closer to Rachel, resigned from the army and joined the AFP. Two months after his AFP appointment, they were married. The next year, Rachel gave birth to a daughter, whom they named Mia. Due to medical reasons, Rachel was denied any future children, and their consolidated family of three was bonded on togetherness and love. When Mia was three years old, they hired a permanent babysitter, and Rachel went back to work as a specialist trainer with the AFP.  Brad Morris, as a specialist agent of the AFP, was sent to overseas countries for several monthly training sessions to study new law enforcement techniques. Included in one his previous overseas assignments was being an undercover agent for the British police in Hong Kong. Following that assignment, he had further training at Scotland Yard in London. Because of his achievements, he was sent on a specialized training course to study at the American FBI headquarters in Washington DC. For the three months duration of the Washington training course, he was granted a special request that allowed him to be accompanied by his wife, Rachel, and daughter, Mia. Due to his previous experience with the Hong Kong underworld, the FBI signed him on as one of their undercover agents in Hong Kong, after approval from the head of AFP, to take part in a secret mission investigating the suspicious deaths of American tourists that occurred in British-controlled Hong Kong. The FBI considered that Brad, with his prior knowledge of the two most prominent crime lords operating in Hong Kong, namely Jimmy Lee and Sammy Lui, would be valuable. Both these gang lords were cunning, ruthless, and capable adversaries who would wantonly kill to control their own individual criminal kingdoms. His mission was to take place in March 1997, a few months prior to the British handing back the colony of Hong Kong to the Republic of China. Due to the limited amount of time remaining before the Chinese took over the control of the colony, the British administration and police force, prior to the hand over date, had purposely cut back their law enforcement activities. With the lack of total police involvement, this situation left the criminal element unlimited opportunities to commit major crimes. Terry Long, the head of Hong Kong's MI5 division, was virtually playing a lone hand in controlling the spiraling crime wave. To initiate their involvement, the FBI had set up undercover headquarters at an export import company in Hong Kong. Brad would join three other FBI agents, Nancy Ho, Bobby Reed, and Tony Pallino, at the export import company, operating under the leadership of a senior FBI agent named Bill Johns together with two Republic of China agents, Chen Zhang and Delun Huang, who both agreed, by whatever means it took, to ensure that all Hong Kong criminal elements were either behind bars or nonfunctional when the handover to the Republic of China was official. Each day, in their quest to bring the ruthless crime lords to justice, Brad's family and his fellow agents' lives were constantly under threat. This story takes you on the Morris family's journey from Hong Kong in 1997 up to the present time.",
  "genres": [],
  "author": "Don Collins",
  "average_rating": "4.67",
  "url": "https://www.goodreads.com/book/show/31806977-justifiable-homicide"
}