{
  "title": "Adam Frankenstein: A Collection of Short Stories",
  "description": "What if the Frankenstein creature didn't die in a fire,a crumbling castle or on a glacier? What if he never died at all? Adam Frankenstein, a product of science and magic. A creature of horror, come-to-life. In this re-imagining of Mary Shelley's famous creature, Adam is still alive and his stories are that of legend. A lonely and reluctant hero looking for redemption and salvation through the ages. Four stories, through the years, follow Adam as he struggles to understand his place in a world of men who would reject him, kill him. He looks to create humanity in himself while questioning those who were born with it. Mary Shelley's League of Supernatural Hunters: Origins of Adam Mary Shelley learns of supernatural creatures and real meaning of the word monster as she encounters a man unlike any other. A creature not born of woman, but created from the body of a circus strongman killed while trying to save a lion tamer. She must decide who to trust, the vampire, the witch, the mad scientist or the creature. Either way, Mary's seen enough to know she will need an army to fight those things not easily killed. Frankenstein's Companion 19th century England, friendless and alone in the world, Adam Frankenstein, the creation of a mad scientist and his witch lover, becomes an assassin for hire. When a powerful mage hires him to find his kidnapped daughter and kill the man who took her, Adam strikes a bargain of his own. The mage has an immortal dog and Adam will do anything to own it. The Therapist and the Dead Brooklyn, New York in the 1980's was a place where monsters could blend in. Life has been long and cruel, so Adam keeps his appointment with Dr. Stein, the most expensive and sought after psychologist in the city, to talk of immortality and murder. Adam Frankenstein, U.S. Marshal Adam joins the 21st Century, and takes up residence in Houston, Texas. While waiting for his next mission from the League of Supernatural Hunters, he becomes Adam Frank, U.S. Marshal. His new partner is Marshal Rebecca Hughes, a by-the-book woman with a non-nonsense approach to life, with no idea who he really is, but that’s all about to change. When he wakes up dead and learns someone has stolen his dog, Texas may not be big enough to hold his wrath.",
  "genres": [
    "Short Stories"
  ],
  "author": "Sheila English",
  "average_rating": "4.53",
  "url": "https://www.goodreads.com/book/show/31791049-adam-frankenstein"
}