{
  "title": "The Anatomical Exercises: De Motu Cordis and De Circulatione Sanguinis in English Translation",
  "description": "El Prof. Dr. J. J. Izquierdo nació en 1893, hizo los estudios preparatorios y de medicina, y obtuvo el título profesional (1917) en la ciudad de Puebla. A poco de iniciado en las tareas de la fisiología en las Escuelas de Medicina Universitaria y Médico Militar, como desde 1920 reconociera que requerían especialización, de 1927 a 1930 fue a buscarla a los Estados Unidos, a Inglaterra, y a Alemania.A su regreso, con apoyo en su libro Curso de Fisiología de Laboratorio (1929) quizo iniciar en México la correspondiente reforma, pero la viva oposición que encontró, lo obligó a definir y defender tal reforma, con base en sus antecedentes histórico-evolutivos, en la obra, Balance Cuatricentenario de la Fisiología en México (1934).También para promoverla, publicó las obras: Harvey iniciador del método experimental (1936), cuyo contenido en parte vuelve a ser presentado en este volumen; Análisis experimental de los fenómenos fisiológicos fundamentales (1939): Bernard creador de la Medicina Científica (1942). Esta última, con su versión castellana de la famosa Introducción al estudio de la Medicina Experimental, reapareció en el tomo 21 de esta misma colección.El sostenido propósito de señalar las bases históricas, científicas y filosóficas de la línea de pensamiento a que venía sirviendo, permitió al Dr. Izquierdo revelar aspectos antes desconocidos, o no analizados, ni interpretados, del pasado de las ciencias mexicanas, en las obras: Raudón cirujano poblano de 1810 (1949: Montaña y los orígenes del movimiento social y científico de México (1955); El Brownismo en México (1956); El Hipocratismo en México (1957); y La primera Casa de las Ciencias en México (1958).El actual Departamento de Fisiología, de la Facultad de Medicina, en la Ciudad Universitaria, fue creado y organizado de acuerdo con un proyecto original presentado por Izquierdo en 1950.Al serle otorgado recientemente, el grado de Profesor Emérito, se le calificó (Gaceta Universitaria, 21, dic. 1964) de \"el precursor más ilustre que ha tenido la línea de pensamiento que tiende a que la medicina mexicana descanse sobre bases cada vez más científicas\".",
  "genres": [
    "Science",
    "Classics",
    "Nonfiction",
    "Philosophy",
    "Biology",
    "Medicine",
    "History"
  ],
  "author": "William Harvey",
  "average_rating": "3.70",
  "url": "https://www.goodreads.com/book/show/318093.The_Anatomical_Exercises"
}