{
  "title": "The Vampire Hunter's Academy: The Darkness",
  "description": "Built centuries ago, shortly after the construction of the First Christian Church, The Vampire Hunters Academy is responsible for the training of the world’s best of the those possessing gifts within the realms of the supernatural for use of defending humanity. Situated in Vatican City, the school has been recognized as the Light’s best kept secret in the war against The Darkness. The Academy’s purpose however, is not only to prepare future Guardians for the task of defending humanity against Evil, but to specially train the select for the highest esteem to protect and stand with the Most High’s top weapon known as the Akhkharu Alal, better known as the Huntress. Born every thousand years as humanity’s sole protector against the armies of Darkness, a prophecy long foretold the coming of a new breed of slayers that will soon lead the armies of Light against the Unnamed One. Destiny was written in the name of Sanaya Scott, the newest and most powerful Slayer born in this millennium and the first ever of her kind to be admitted into The Academy. Street smart, independent and a bit of a loner, Sanaya’s abilities are developing too quickly for her Guardians to keep up with. Not to mention the typical teenaged woes of being the new girl on the block, her abilities leave her isolated among her peers as a bit of a freak-with the exception of her best friend, Maya. As more truths are revealed about Sanaya’s future, relationships are created and tested, especially when a Master Vampire decides to try his luck with the school. Sanaya is faced with balancing coming into her own, while trying to protect those she was destined to protect and manage life as teenaged huntress. With the help of Maya, and some new friends, Sanaya learns she does not have to fight the fight against evil alone.",
  "genres": [
    "Paranormal"
  ],
  "author": "Delizhia D. Jenkins",
  "average_rating": "4.25",
  "url": "https://www.goodreads.com/book/show/31816305-the-vampire-hunter-s-academy"
}