{
  "title": "Between Citizens and the State: The Politics of American Higher Education in the 20th Century",
  "description": "This book tracks the dramatic outcomes of the federal government's growing involvement in higher education between World War I and the 1970s, and the conservative backlash against that involvement from the 1980s onward. Using cutting-edge analysis, Christopher Loss recovers higher education's central importance to the larger social and political history of the United States in the twentieth century, and chronicles its transformation into a key mediating institution between citizens and the state. Framed around the three major federal higher education policies of the twentieth century--the 1944 GI Bill, the 1958 National Defense Education Act, and the 1965 Higher Education Act--the book charts the federal government's various efforts to deploy education to ready citizens for the national, bureaucratized, and increasingly global world in which they lived. Loss details the myriad ways in which academic leaders and students shaped, and were shaped by, the state's shifting politicalagenda as it moved from a preoccupation with economic security during the Great Depression, to national security during World War II and the Cold War, to securing the rights of African Americans, women, and other previously marginalized groups during the 1960s and '70s. Along the way, Loss reappraises the origins of higher education's current-day diversity regime, the growth of identity group politics, and the privatization of citizenship at the close of the twentieth century. At a time when people's faith in government and higher education is being sorely tested, this book sheds new light on the close relations between American higher education and politics.",
  "genres": [
    "Education",
    "History",
    "Political Science"
  ],
  "author": "Christopher P. Loss",
  "average_rating": "3.73",
  "url": "https://www.goodreads.com/book/show/11961077-between-citizens-and-the-state"
}