{
  "title": "The Potlikker Papers: A Food History of the Modern South",
  "description": "\"The one food book you must read this year.\"--Southern Living One of Christopher Kimball's Six Favorite Books About FoodA people's history that reveals how Southerners shaped American culinary identity and how race relations impacted Southern food culture over six revolutionary decadesLike great provincial dishes around the world, potlikker is a salvage food. During the antebellum era, slave owners ate the greens from the pot and set aside the leftover potlikker broth for the enslaved, unaware that the broth, not the greens, was nutrient rich. After slavery, potlikker sustained the working poor, both black and white. In the South of today, potlikker has taken on new meanings as chefs have reclaimed it. Potlikker is a quintessential Southern dish, and The Potlikker Papers is a people's history of the modern South, told through its food. Beginning with the pivotal role cooks and waiters played in the civil rights movement, noted authority John T. Edge narrates the South's fitful journey from a hive of racism to a hotbed of American immigration. He shows why working-class Southern food has become a vital driver of contemporary American cuisine.Food access was a battleground issue during the 1950s and 1960s. Ownership of culinary traditions has remained a central contention on the long march toward equality. The Potlikker Papers tracks pivotal moments in Southern history, from the back-to-the-land movement of the 1970s to the rise of fast and convenience foods modeled on rural staples. Edge narrates the gentrification that gained traction in the restaurants of the 1980s and the artisanal renaissance that began to reconnect farmers and cooks in the 1990s. He reports as a newer South came into focus in the 2000s and 2010s, enriched by the arrival of immigrants from Mexico to Vietnam and many points in between. Along the way, Edge profiles extraordinary figures in Southern food, including Fannie Lou Hamer, Colonel Sanders, Mahalia Jackson, Edna Lewis, Paul Prudhomme, Craig Claiborne, and Sean Brock.Over the last three generations, wrenching changes have transformed the South. The Potlikker Papers tells the story of that dynamism--and reveals how Southern food has become a shared culinary language for the nation.",
  "genres": [
    "Food",
    "History",
    "Nonfiction",
    "Cookbooks",
    "Cooking",
    "Audiobook",
    "American History"
  ],
  "author": "John T. Edge",
  "average_rating": "3.81",
  "url": "https://www.goodreads.com/book/show/31812079-the-potlikker-papers"
}