{
  "title": "Inseparable",
  "description": "DISASTER! THE BLACK BLADES DISBANDED, AN ALLIANCE IN TURMOIL... \nThe intersecting worlds of the iliri, grauori, and men collide when an alliance is declared, and the humans renege. In the midst of offering an olive branch to other races, they seem secretly hellbent on destroying them all—and they begin by putting Sal on trial and disbanding the Black Blades. Auryn Hadley offers up deft commentary on racism between communities—melded with fantastical action-adventure in a world at war, and passionate erotic romance in this fourth installment of the Rise of the Iliri.True to its title, in Inseparable, on the world of Ogun, it’s the connections between all beings—human and otherwise—that will save or destroy them.Her recent mission a success, fearless (and irresistibly arousing) iliri warrior Lieutenant Salryc Luxx gets thanks in the form of imprisonment by the Conglomerate of Free Citizens. Sal’s not even sure what she’s accused of, but she suspects it’s the color of her pale skin—not her actions—that’s really on trial.Kinetry, an old comrade and ally of the Black Blades now forced to hold Sal, warns her that a rash of anti-iliri sentiment is sweeping Parliament and the military. In fact, it seems men don’t care for any race but their own. But Kinetry doesn’t know that the King of Anglia is on his way to the military stronghold. Nor does he know the King is bringing  with him thousands of grauori soldiers, members of a race of formerly hidden human-like wolves whose hunting and battle skills are unmatched.If the King arrives before Sal’s trial is resolved, he’ll learn something in the courtroom that may destroy all hope of the intended alliance. Torn between truth and treason, Sal must navigate political sensitivities to hold the three races together. And just when she seems to get somewhere, the Conglomeration disbands the Black Blades.The most psychologically complex and emotionally stirring of the Iliri tales, Inseparable delves deep into relationships: the connections between the iliri, grauori, and humans in increasingly uncertain and dangerous times, and the connections between comrades and lovers in all their grit and glory. Everyone knows Sal is irresistible to males, that’s part of what makes her such a brilliant assassin, but it’s her unbreakable devotion to her tribe that keep her alive—and the steamy interactions with her mates—old, new, and surprising—that keep the pages turning.",
  "genres": [
    "Reverse Harem",
    "Fantasy",
    "Romance",
    "Science Fiction",
    "Paranormal",
    "Military Fiction",
    "Aliens"
  ],
  "author": "Auryn Hadley",
  "average_rating": "4.62",
  "url": "https://www.goodreads.com/book/show/31814777-inseparable"
}