{
  "title": "Carnage",
  "description": "Between love and savagery, only one can survive - and only one will prove stronger than death.  ALPHA TEAM LOOKS THE DEVIL IN THE EYE After recovering Patient Zero, Alpha must escape Africa to end the ZA once and for all. But they can feel the hot breath of a reinforced and vengeful Spetsnaz team on their necks – and there can be no escaping the reckoning of an ultimate sniper showdown between Ali and Vasily, and an incomparably brutal iron-cage Texas deathmatch between Predator and Misha. For the first time, all the teams will come together and must fight as brothers, for any chance of making it back to Britain. And only one thing is certain – not everyone is walking away from this one…  ONE TROOP RALLIES AGAINST DECIMATION AND DEFEAT After rescuing Aliyev, One Troop is pinned down in Red Square between a surging singularity and the merciless killers of Spetsnaz Alfa Group. They’re about to lose their second aircraft, they still don’t have the zombie-killing MZ, and the clock is ticking down on their pinhole of escape. Only the most vicious and desperate gambit can give them a chance of saving London, not to mention themselves – but Jameson refuses to fail…  THE CREW OF THE KENNEDY BATTLES BACK With the bridge and most critical stations held by the world’s deadliest maritime commando force, and Dr. Park pinned down by a smash-mouth battle and last stand in the ship’s hospital, time is running out for the shellshocked and outgunned crew of the JFK to fight back. The ultimate heroism and sacrifice of everyone from storekeepers all the way up to Commander Drake himself will be required to fight their way back from the brink…  Defiance. Valor. Consecration. CARNAGE   ARISEN Hope Never Dies.",
  "genres": [
    "Horror",
    "Zombies",
    "Fiction",
    "Post Apocalyptic",
    "Audiobook",
    "Science Fiction",
    "Apocalyptic"
  ],
  "author": "Michael Stephen Fuchs",
  "average_rating": "4.52",
  "url": "https://www.goodreads.com/book/show/31806903-carnage"
}