{
  "title": "Mindhealer",
  "description": "“In the Watchers series, Saintcrow writes stories that are almost always nonstop action from beginning to end. Her women are kick-ass strong, her men ruggedly handsome and dedicated to the women they serve. It isn’t a bad combination at all.” —CJReading The The attacks are brutal, leaving the victims unconscious and broken. A powerful Mindhealer might be able to piece together what's happening to these crushed bodies and shattered minds, so Caroline Robbins is pulled away from her relatively quiet life. A Mindhealer is incredibly vulnerable to the Dark—and Caro refuses even the idea of having a Watcher. She won’t have another man die in front of her, and that’s that. Unfortunately, the Watcher she just ran into has other ideas . . . The Caro, the witch Merrick rescues from the dogs of the Dark, is obnoxiously stubborn, infuriating, and seemingly determined to throw herself into every dangerous situation possible. It’s enough to drive a man insane, and definitely enough to make a Watcher frustrated. How is he supposed to protect her, especially when she insists she doesn’t need a Watcher? But Caro is going to need all of Merrick’s skill and strength sooner than anyone guesses. The attacks haven’t stopped, and the closer Caro gets to solving the mystery, the more danger she’s in. Because she’s the next victim—unless Merrick can save her. And Merrick just might die in the line of fire if Caro can’t find a way to keep her Watcher safe. Bounced around the world as a military brat, Lilith Saintcrow fell in love with writing in second grade and never looked back. She currently resides in Vancouver, Washington, with two children, a menagerie, and books. Find her on the web at lilithsaintcrow.com.",
  "genres": [
    "Paranormal",
    "Paranormal Romance",
    "Urban Fantasy",
    "Romance",
    "Fantasy",
    "Magic",
    "Witches"
  ],
  "author": "Lilith Saintcrow",
  "average_rating": "3.81",
  "url": "https://www.goodreads.com/book/show/3182567-mindhealer"
}