{
  "title": "Luces en el Mar",
  "description": "\"Luces en el Mar de Miquel Reina es una historia absolutamente encantadora y hermosa, con una calidad de ensueño y fábula. A los fans de La Vida de Pi les encantará esta novela \". - Kristin Hannah, autora bestseller de \"El Ruiseñor\" «Fue un rayo el desencadenante de todo…». Así empieza Luces en el mar, una emocionante novela que cuenta la historia de Harold y Mary Rose Grapes, un matrimonio que, tras la trágica muerte de su hijo, dejó a un lado sus sueños de juventud y se resignó a vivir en una isla remota, alejados de todo. Ahora, el destino les vuelve a poner a prueba y se ven forzados a abandonar su hogar de una manera que nunca habrían imaginado. Justo la noche antes de ser desahuciados, por un problema de delimitación de costas, mientras Harold y Rose duermen, se desata una fuerte tormenta y un rayo hace que la casa se desprenda del acantilado y caiga al mar con ellos dentro. De la forma más inesperada, los Grapes se convierten en dos náufragos a la deriva sobre una casa flotante. Comienza así un extraordinario viaje en el que deberán luchar juntos frente a las adversidades si quieren sobrevivir. Olvidarse de los fantasmas y frustraciones del pasado es imprescindible. \"Una novela escrita como un cuento de fantasía exquisitamente escrito.\"   – Kirkus Reviews“Esta hermosa e inusual novela explora el poder curativo del amor y la magia que existe en nuestra vida cotidiana, incluso cuando no sabemos cómo encontrarla”   – Jill Santopolo, autora bestseller de \"La Luz que Perdimos\" \"Luces en el Mar de Miquel Reina es una historia absolutamente encantadora y hermosa, con una calidad de ensueño y fábula. A los fans de La Vida de Pi les encantará esta novela \". - Kristin Hannah, autora bestseller de \"El Ruiseñor\"",
  "genres": [
    "Fiction",
    "Fantasy",
    "Magical Realism",
    "Spanish Literature",
    "Adventure",
    "Contemporary",
    "Adult"
  ],
  "author": "Miquel Reina",
  "average_rating": "3.95",
  "url": "https://www.goodreads.com/book/show/31822076-luces-en-el-mar"
}