{
  "title": "The Girl from Rostov",
  "description": "He stood there watching him, smoking a cigarette, silently waiting. “Where is my money?” he asked. He spoke softly, as if scolding a child for his misbehaviour, trying not to come across as too harsh. “I swear to you, I didn’t take it. I would never betray you,” the man sitting across from him replied. He was tied to a chair, unable to move, the rope cutting into his wrists. He took two steps forward, towering over the man in the chair, well within his personal space. He smacked him hard across the face. The man and the chair were both knocked to the floor. He caught hold of his collar and pulled the chair with him still in it back onto its feet. He took two steps back. “Now, shall we do this again?” THE GIRL FROM ROSTOV is a crime thriller/love story, but more importantly it is also a story of loss and the range of human emotions that a person goes through following it. The orphaned niece of a Russian gangster/international spy and arms dealer must find out who killed her uncle and why. She teams up with the son of a millionaire who has his own set of demons from the past. * A couple of chapters in the beginning of the book are situated in Russia while most of the other scenes take place in India.Editorial ReviewsFrom the AuthorBeing my first book, The Girl From Rostov will always have a special place in my heart. It's a story, not about the girl from rostov a.k.a Maya herself but of the people who surround her, the people who shelter her and guide her. It's about the people who shape her world. It's tough to imagine a world without the ones you love but such a world is often our reality. The pain of an orphan, the love of a mentor, the pangs of heartbreak and the misdeeds borne of greed are all things that we all have witnessed at some point or the other. This book has it all, violence and death, despair and heartbreak, but the thing is that even in the face of all this it is a life shadowed by death and not death itself that haunts the souls of innocents.From the Inside Flap\"He loved me more than anything in the world you know. He would have done anything for me. I never really missed my parents with him around. I was happy. People were scared of him but I could never understand why. He was always so gentle with me. I know he was a criminal, that he made many unforgivable mistakes. But he was not a bad man. He did what he had to do, what he thought was right, and somehow I think that ought to be respected.\"",
  "genres": [],
  "author": "Shitij Sharma",
  "average_rating": "3.53",
  "url": "https://www.goodreads.com/book/show/31821952-the-girl-from-rostov"
}