{
  "title": "Twisted World: A Broken World Novel",
  "description": "Twenty years ago a deadly virus swept the globe, ravaging the population. People died and came back as monsters, and through the tragedy that rocked the world survivors were born. Megan James is the product of survivors. Her parents crossed hundreds of miles of dangerous countryside to reach Atlanta, and the promise of a real future.  Now, two decades later, Meg is facing a crisis of her own. Her father has vanished and is presumed dead, and her mom is teetering on the edge of insanity, but all Meg really wants is to return to the safe world she always thought she was living in. Only Atlanta isn’t everything her parents thought it would be. The slums have grown and corruption is rampant, and despite the promise of democracy the new government has been slow to change. Through it all, the only consistency seems to be the zombies. Decayed and barely more than skeletons, there is no reason they should still be moving. But they are.  Facing the harsh world alone, Meg gets a job in the entertainment district of Atlanta where she meets convict fighter Donaghy. Angry at the world and his circumstances, all the fighter really wants is to be left alone. But when he gets swept up in Meg’s problems, he finds it impossible to turn his back on her.  When a mysterious note resurrects old rumors about what the CDC is really doing, Meg can’t help wondering if her father might have met the same fate that her uncle did twenty years earlier. With the help of Donaghy, she will search for the truth among the darkness that has settled over Atlanta, where they’ll soon discover that the mutated virus has brought forth creatures nobody could have imagined, and the evil intentions of the men in charge are much more sinister than anyone ever thought possible, making the future look harsher than ever before.  ***This novel is the first book in a new zombie/dystopian series, set twenty years after the final book in the Broken World series. While reading the first seven books will be helpful, it is not necessary to follow the plot of Twisted World.",
  "genres": [
    "Zombies",
    "Horror",
    "Romance",
    "Apocalyptic",
    "Dystopia",
    "Post Apocalyptic",
    "Science Fiction"
  ],
  "author": "Kate L. Mary",
  "average_rating": "4.46",
  "url": "https://www.goodreads.com/book/show/31819732-twisted-world"
}