{
  "title": "The Queen's Cross",
  "description": "A Biographical Romance of Queen Isabella of SpainIn Queen Isabella of Spain, Lawrence Schoonover has found his perfect heroine. Known as Isabella the Catholic. she was in many ways the Spanish Joan of Arc, and was unquestionably one of the great queens in all European history. A passionate and beautiful woman - a devoted wife who forgave even when she could not forget - a loving mother - Isabella was at the same time a strong administrator and a military genius. Lawrence Schoonover brings Isabella to life in all her glory, with a host of intriguing people in her retinue including the handsome, brave, but philandering Ferdinand, whose weakness Isabella nobly tried to hide from the world by giving him credit where none was due; the scheming, unscrupulous Queen Juana, who attempted to palm off her bastard child as the Infanta, in spite of her husband's nickname - Henry the Impotent; Torquemada, Isabella;s early tutor and later Spain's Grand Inquisitor, the man who aroused her interest in a world wider than Europe, a world which one day might be circled by men in ships; the sickly heir apparent, Alfonso, whose death affected Spain's future far more than his own life, for it left the way open for Isabella's accession to the crown.Here is the pulse-quickening flavor of the ancient Spanish cities - Barcelona, Seville, Granada, Santa Fe. Here is color and pageantry, violence and intrigue, passion and brutality. But above all, here is Isabella - a great queen who subordinated her personal sorrows and disappointments to a greater cause - the woman who wrested Granada from the Moorish hold of seven centuries and thereby filled out the map of modern Spain - the woman who grasped the significance of Columbus' ambitious project after most of the courts of Europe had turned him down - the woman who became a queen to capture the imagination of all the Western world.",
  "genres": [
    "Historical Fiction",
    "Historical",
    "Fiction"
  ],
  "author": "Lawrence Schoonover",
  "average_rating": "3.68",
  "url": "https://www.goodreads.com/book/show/3182094-the-queen-s-cross"
}