{
  "title": "Take a Shot",
  "description": "Two hockey players. One woman. Secret crushes. Three hearts are on the line.  True love isn’t a game. Games have rules, and this romance breaks them all.  Scott Sharpe has a secret. Starting a new life in Chicago is going to help him leave his past in the dust, right beside his life-long dream of being a superstar hockey player. Ever since his career-ending knee injury sidelined him, Scott was left drifting and aimless. He’s never been the type of guy to settle down. Love? That doesn’t happen for players like him. Falling for his best friend’s girlfriend is not an option. Neither is falling for his best friend.  Life is on track for Blake Hawkins. He’s starting a great career with the Chicago Stormers, he’s just bought his first home, and he’s moving in with his girlfriend. His best friend coming to town should be icing on the cake. But when Scott shows up, he rocks Blake’s world in ways he never saw coming. Blake will do almost anything to protect what he has going for him. But this time, following the rules might the riskiest move he could make.  Lora Berry is all about stability. Her relationship with her long-term boyfriend is going well. Finally moving in with Blake is a big step in the right direction. She knows where they’re heading as a couple. Until Scott comes to stay and everything changes. After one hot night that she’ll never forget, Lora is determined not to lose the kind of love she didn’t even know she was missing. But it’s not that easy when you have two very stubborn guys on your hands. When she tries to get everyone together, three hearts are on the line.  This is a standalone mmf bisexual romance without a cliffhanger.      Take a Shot is a hot mmf romance, perfect for fans of Nicole Stewart and Elle Everton.",
  "genres": [
    "Romance",
    "M M F",
    "Menage",
    "Hockey"
  ],
  "author": "Bianca Vix",
  "average_rating": "3.63",
  "url": "https://www.goodreads.com/book/show/31824158-take-a-shot"
}