{
  "title": "The Poverty of Progress: Latin America in the Nineteenth Century",
  "description": "From the Preface by Bradford Burns:If this essay succeeds, it will open an interpretive window providing a different perspective of Latin America's recent past. At first glance, the view might seem to be of the conventional landscape of modernization, but I hope a steady gaze will reveal it to be far vaster and more complex. For one thing, rather than enumerating the benefits accruing to Latin America as modernization became a dominant feature of the social, economic, and political life of the region, this essay regards the imposition of modernization as the catalyst of a devastating cultural struggle and as a barrier to Latin America's development. Clearly if a window to the past is opened by this essay, then so too is a new door to controversy. After most of the nations of Latin America gained political independence, their leaders rapidly accelerated trends more leisurely under way since the closing decades of the eighteenth century: the importation of technology and ideas with their accompanying values from Western Europe north of the Pyrenees and the full entrance into the world's capitalistic marketplace. Such trends shaped those new nations more profoundly than their advocates probably had realized possible. Their promoters moved forward steadfastly within the legacy of some basic institutions bequeathed by centuries of Iberian rule. That combination of hoary institutions with newer, non-Iberian technology, values, and ideas forged contemporary Latin America with its enigma of overwhelming poverty amid potential plenty. This essay emphasizes that the victory of the European oriented ruling elites over the Latin American folk with their community values resulted only after a long and violent struggle, which characterized most of the nineteenth century. Whatever advantages might have resulted from the success of the elites, the victory also fastened two dominant and interrelated characteristics on contemporary Latin America: a deepening dependency and the declining quality of life for the majority.",
  "genres": [
    "History",
    "Nonfiction",
    "World History"
  ],
  "author": "E. Bradford Burns",
  "average_rating": "3.63",
  "url": "https://www.goodreads.com/book/show/318375.The_Poverty_of_Progress"
}