{
  "title": "Mainio pikku sota – Brittilentäjät Suomessa vuonna 1919",
  "description": "Historiamme vaiettu vaihe vuonna 1919 oli talvisodan alkusoittoKesäkuussa 1919 Englannin kuninkaallisen laivaston osasto ankkuroitui Koiviston kirkonkylän edustalle Suomenlahdella – julkisuudessa sen tiedotettiin olevan vain vierailulla. Kun risteilijöiden, hävittäjien, miinanraivaajien ja sukellusveneiden määrä alkoi lähennellä kolmeakymmentä ja kun englantilaisten merisotilaita oli paikalla tuhansia, ymmärsivät ainakin paikalliset asukkaat, ettei kyse ollut pelkästä vierailusta.Heinäkuussa Koivistonlahdelle lipui brittiläinen lentotukialus mukanaan yli satamiehinen kuninkaallisten ilmavoimien RAF:n osasto. Opettaja Roihan perunamaalle raivattiin lentokenttä ja läheiseen Sudensaareen perustettiin tukikohta vesitasoille. Pian lentokoneiden moottoreiden pauke kaikui Koivistonlahdella, ja sitten kirkkomaalle kaivettiin jo ensimmäiset englantilaisten sankarihaudat. RAF pommitti Suomesta käsin Neuvosto-Venäjää lumentuloon saakka.Mainio pikku sota kertoo, miksi Englanti pommitti Kronstadtia ja Petrogradin ympäristöä, vaikka maiden välillä ei ollut sotaa ja vaikka Britannia oli viisivuotisen maailmansodan loppuun uuvuttama? Keitä RAF:n lentäjät olivat ja millaista oli heidän arkensa Koivistolla? Millaista yhteistyötä britit tekivät Suomen ilmavoimien kanssa? Entä miten Neuvosto-Venäjä ja sen puolesta taistelleet punaiset suomalaislentäjät vastasivat?Brittilentäjien operaatio oli vain pieni luku Englannin 1900-luvun historiassa, mutta sen merkitys Suomelle oli suurempi. Tapahtumat polttivat Stalinin ja neuvostojohdon mieleen perustellun epäilyksen siitä, että suurvallat voivat jatkossakin käyttää Suomea sillanpääasemana hyökätessään Neuvostoliittoon. Niinpä talvisodan alkusoitto soitettiin Koivistolla vuonna 1919.Suomen Akatemian ohjelmapäällikkö Mikko Ylikangas (s. 1963) on aiemmin kirjoittanut kirjan Unileipää, kuolonvettä, spiidiä, joka oli Tieto-Finlandia-ehdokkaana vuonna 2009 ja joka sai Tiedonjulkistamisen valtionpalkinnon sekä Vuoden tiedekirja -palkinnon.",
  "genres": [
    "History"
  ],
  "author": "Mikko Ylikangas",
  "average_rating": "4.13",
  "url": "https://www.goodreads.com/book/show/31842235-mainio-pikku-sota-brittilent-j-t-suomessa-vuonna-1919"
}