{
  "title": "Warnings Unheeded",
  "description": "The firsthand account of an active-shooter incident and military aviation disaster—told by the Security Forces Airman who ended the killing spree.\n In one week, two fatal tragedies struck the community of Fairchild Air Force Base. On 20 June 1994, a gunman opened fire in the base hospital. Just four days later, a B-52 bomber crashed outside of Fairchild's Nuclear Weapon Storage Area.  In a compelling narrative, Staff Sergeant Andy Brown shares the eye-witness accounts of the people who experienced the tragedies—the first responders, the victims, and the survivors. The narrative also tells the story of the people who recognized the signs of impending tragedy.  For several months, Fairchild's mental-health clinic struggled to find help for a dangerous patient. When they were unable to convince others of the threat, the hospital became the target of a vengeful gunman and a victim of deep-set bureaucracy.  The pilot of the ill-fated aircraft had a history of flying the airliner-sized bomber like an aerobatic stunt plane. The rogue pilot's maneuvers caused aircrews to fear for their lives. They risked their careers by refusing to fly with him. When the chain-of-command failed to act, one brave commander made the ultimate sacrifice to save his men.  Brown shares how he had prepared for the lethal force encounter and vividly describes his gunfight with the active shooter. He candidly relates his experience with the aftermath and offers a unique insight into the hidden cost of becoming a \"hero.\"  Warnings Unheeded is part of Brown's ongoing effort to share the stories of two preventable tragedies and the lessons contained within them. \nIf you like military biographies, true-crime storytelling, or learning from history—read this true story of mass murder and aviation disaster.\n \"In vivid and thoroughly researched detail, Andy Brown masterfully weaves two tragic stories ... this is an important and well-written read.\" —Gregory K. Moffatt, Ph.D., author of Blind-Sided: Homicide Where it is Least Expected  \"Profoundly valuable for anyone who wants to understand violence and mental illness in our society today.\" —Lt Col Dave Grossman, author of On Combat and On Killing  \"There are specific lessons in this book that can help us to prevent lethal tragedy.\" —From the Foreword by Massad Ayoob \n***Contains more than 70 photographs and images.***",
  "genres": [
    "Nonfiction",
    "True Crime",
    "History",
    "Military Fiction",
    "Military History",
    "Audiobook",
    "Aviation"
  ],
  "author": "Andy   Brown",
  "average_rating": "4.34",
  "url": "https://www.goodreads.com/book/show/31843168-warnings-unheeded"
}