{
  "title": "Tamil Nadu – The Land of Vedas",
  "description": "This is one of the major academic contribution to the study of Tamil culture. It shows all the great Tamil kings of the Sangam age performed Vedic sacrifices as seen from Puranānūru poems. They also followed prescriptions of Dharma Sāstra. The Patiṛṛupattu poems point out that the ancient Tamil kings studied Vedas, Vedāngas, and performed daily Vedic rites mentioned as Pañca Mahā Yajñas in Vedic tradtion. Avvai the greatest poet of Sangam age praises the three crowned Tamil kings for performing Vedic sacrifices. In birth rites, death rites, in marriage rites etc the ancient Tamils followed Vedic injunctions. The kings appointed Vedic scholars as their Chief ministers and presented them with lands called Brahma dāyas.The most ancient Tamil grammar Tolkāppiyam followed Bharata's Nātya Śāstra in division of landscape as aintinaikaḷ. The division of poetry into Aham and Puram based on Śriṅgāra and Tāṇdava (Āviddham) - puram of Nātya Śāstra. The Sangam poems could be dated to first-second cent AD. The famous text Silappadikāram is a Nāṭaka Kāvyam (dramatic composition) based on Nātya Śāstra. This was composed to glorify Karpu (chaste) form of marriage prescribed in Vedic system. Kaṇṇaki the heroine was married as per the Vedic rites. Saint Jñānasambandar who was the greatest contributor to Tamil Music and devotional literature was a Chaturvedi who was performing daily Vedic rites. Saint Appar was an agriculturist, who has rendered several passages from Veda, especially Śrī Rudram into delightful Tamil. Nammaḻvār's Thiruvāymoḻi is so replete with Vedic passages. His poems are called \"Vedas rendered in Tamil\"The epigraphical wealth of Tamilnad shows the Sabha system of Vedic tradition was widely spread throughout Tamilnadu that points out \"Tamilnad continues to be the Land of the Vedas. (வேதம் நிறைந்த தமிழ் நாடு — பாரதி)\" The process of elections to Village Assemblies, the subcommittees called Vāriyams, and paruṭai (pariṣad) system were the backbone of village life. The Vedic Dharma Śāstras like Manu and Yñanavalkhya were the most followed Judicial texts. The technical language of these texts are used verbatim in judicial pronouncements are from Tamil records from earlier to 7th cent. Even selection of judges were made after a pass in an examination on Dharma Śāstras. All the chola kings studies Vedas and established Vedic colleges. There individual grhya sutra texts like Āpastamba and Bodhāyana were the guiding principles of the family life.The Cholas recognized that the country was mainly based on Rural economy and so entrusted the revenue administration of the village in the hands of Officers belonging to cultivators family of Veḷḷālas, confered with the title Mūvendavelārs. The Chola kings established several Nallur as exclusive Cultivators' villages in addition to Brahmadeyas of Vedic Brāhmanas. It is also seen that it was the duty of Brāhmans to interpret law to the villagers.The Vedas have been the perennial spring of Indian and the whole of South East Asian civilization, for the past 3500 years in all most all fields of human culture. In the fields of History, Art, Architecture, Music, Dance, Administration, Judiciary, Law, Social life and so on. The Rulers of Thailand, Cambodia, Vietnam, Indonesia, Laos and other parts, besides all parts of India and its North West, have been following the Vedic laws (the smiritis) and personally observing codes of life which are specifically mentioned in hundreds of ancient records through the centuries. The monumental holdings like the great temples of Ankhorwat, Ankhor thom, Bantai Sri of Cambodia and the temples Prāmbanam Indonesia and others were mainly inspired by great Vedic Scholars. Tamilnad equally benefitted from the very beginning from the riches of Vedic lore. Sankarā's contribution to the outlook of Tamil temple movement is discussed as seen from an inscription in a chola temple. Śankara argues that every induvidual has the capacity and right to knowledge (ātma vidyā different from veda vidyā) irrespective of caste, creed, space and is eligible for liberation in this life jīvan mukti. This is the Advaita approach which he calls \"ātma jñāna yoga\".",
  "genres": [
    "History",
    "Religion",
    "Hinduism"
  ],
  "author": "R. Nagaswamy",
  "average_rating": "4.39",
  "url": "https://www.goodreads.com/book/show/31840415-tamil-nadu-the-land-of-vedas"
}