{
  "title": "The Qur'an: A New Translation",
  "description": "The Qur'an is the supreme authority in Islam. It is the fundamental and paramount source of the creed, rituals, ethics, and laws of the Islamic religion. It is the book that ‘differentiates’ between right and wrong, so that nowadays, when the Muslim world is dealing with such universal issues as globalization, the environment, combating terrorism and drugs, issues of medical ethics, and feminism, evidence to support the various arguments is sought in the Qur'an. This supreme status stems from the belief that the Qur'an is the word of God, revealed to the Prophet Muhammad via the archangel Gabriel, and intended for all times and all places.The Qur'an was the starting point for all the Islamic sciences: Arabic grammar was developed to serve the Qur'an, the study of Arabic phonetics was pursued in order to determine the exact pronunciation of Qur'anic words, the science of Arabic rhetoric was developed in order to describe the features of the inimitable style of the Qur'an, the art of Arabic calligraphy was cultivated throughwriting down the Qur'an, the Qur'an is the basis of Islamic law and theology; indeed, as the celebrated fifteenth-century scholar and author Suyuti said, ‘Everything is based on the Qur'an’. The entire religious life of the Muslim world is built around the text of the Qur'an. As a consequence of the Qur'an, the Arabic language moved far beyond the Arabian peninsula, deeply penetrating manyother languages within the Muslim lands––Persian, Turkish, Urdu, Indonesian, and others. The first sura (or section) of the Qur'an, al-Fatiha, which is an essential part of the ritual prayers, is learned and read in Arabic by Muslims in all parts of the world, and many other verses and phrases in Arabic are also incorporated into the lives of non-Arabic-speaking Muslims.Muslim children start to learn portions of the Qur'an by heart in their normal schooling: the tradition of learning the entire Qur'an by heart started during the lifetime of the Prophet and continues to the present day. A person attaining this distinction becomes known as a hafiz, and this is still a prerequisite for admission to certain religious schools in Muslim countries. Nowadays the Qur'an is recited anumber of times daily on the radio and television in the Muslim world, and some Muslim countries devote a broadcasting channel for long hours daily exclusively to the recitation and study of the Qur'an. Muslims swear on the Qur'an for solemn oaths in the law-courts and in everyday life.",
  "genres": [
    "Islam",
    "Religion",
    "Nonfiction",
    "Spirituality"
  ],
  "author": "Anonymous",
  "average_rating": "4.40",
  "url": "https://www.goodreads.com/book/show/31828265-the-qur-an"
}