{
  "title": "The World's Best Superfoods",
  "description": "Dive into the world of superfoods with Lonely Planet Food, the world's leading travel publisher's new food imprint. Unlock the long-held secrets of health-boosting diets from every culture of the globe. Discover which super ingredients will boost your energy, stave off illness, reduce your chance of diseases, make your hair shine, your skin glow and turbocharge your brain power. Better still, learn how to harness the benefits for yourself with a myriad of tasty recipes from around the world, all containing naturally nutrient-rich ingredients that will improve your energy, digestion, heat, immune system, and longevity. Travel can transform your cooking, exposing you to new flavours and powerfully health-boosting ingredients that you may not even have heard of before. But, when there is so much world to explore in terms of food, The World's Best Superfoods is there with a hand-selected collection of the world's most exciting culinary experiences and healthiest secrets served directly to your kitchen. With recipes ranging from Mexico's chia fresca (a refreshing beverage) and Japan's wakame seaweed salad, to Bolivia's quinoa stew and England's revolutionary pungent-smelling but silky-textured plankton risotto, eating well has never been so delicious! Each of the 66 recipes includes easy-to-use instructions and mouth-watering photography plus an 'origins' section detailing how the dish has evolved. There are also tasting notes that explain how best to sample each dish - whether that's at dawn by a Vietnamese street stall, or in the zen calm of a Japanese tea ceremony - to truly give you a flavour of the place and help you reap the benefits of sampling nutritious superfood in its natural habitat. Recipes SEEDS AND NUTS LEGUMES GRAINS & CEREALS FRUITS VEGETABLES Plus many more exhilarating recipes! About Lonely Planet Food and drink is a huge part of the travel experience, and Lonely Planet has been scouring the globe for over 40 years to find the best places to sample authentic dishes and beverages when on the road. From street food to Michelin-starred restaurants, Lonely Planet's experts have tried it all. Now, through Lonely Planet Food, we're sharing our knowledge and passion for genuine local cuisine with food-lovers everywhere, bringing a taste of the world into your kitchen.",
  "genres": [
    "Food",
    "Cookbooks"
  ],
  "author": "Lonely Planet Food",
  "average_rating": "4.36",
  "url": "https://www.goodreads.com/book/show/31848459-the-world-s-best-superfoods"
}