{
  "title": "The Path of the Spiritual Sun",
  "description": "In the cycles of the sun and stars, in the movements of the earth and the cosmos, the message of a journey to enlightenment is written.Many thousands of years ago, ancient seers understood this—revering the sun as the highest symbol of divine consciousness, and its light the spiritual source of creation. Its major stages at the solstices and equinoxes became the dominant alignment of sacred sites all over the world, as well as central events in the lives of many spiritual figures. Today, as Belsebuub writes in The Path of the Spiritual Sun, these ancient remains can still be decoded to reveal their message of spiritual enlightenment.The roots of this knowledge trace to a distant time before a global cataclysm destroyed a prior civilization. After this disaster, mysterious sages are recorded as traveling the world on a divine mission to establish this cosmic knowledge anew and initiate the spiritual beginnings of our current human age. They oversaw the building of some of the most enigmatic sacred sites on the planet, and gave rise to a civilization of the sun that extended across much of the earth.However, over time, strife and persecution took its toll, and after a while it was lost—left in scattered fragments that echo a bygone era of great spiritual knowledge. The Path of the Spiritual Sun by Belsebuub aims to restore this lost knowledge—exploring the sites, symbols, and sacred texts connected to the ancient spirituality of the sun—and provide celebrations and ceremonies to re-enliven its transformative practice once more.ABOUT THE AUTHORBelsebuub is the author of a number of books on spirituality, out-of-body experiences, dreams, self-discovery, and ancient knowledge. He has appeared on radio and television programs internationally, and writes from decades of spiritual and mystical experience.From the Book:\"Solstices and equinoxes are a time of connection between the heavens and the earth, the personal and the divine, the inner and the outer, the material and the spiritual, and even a time when contact through mystical experiences is made more possible.\"~ Belsebuub",
  "genres": [
    "Spirituality"
  ],
  "author": "Belsebuub",
  "average_rating": "4.70",
  "url": "https://www.goodreads.com/book/show/31851820-the-path-of-the-spiritual-sun"
}