{
  "title": "Abandoned by the Vatican: My Clandestine Journey to Support Secret Priests Behind the Iron Curtain",
  "description": "ABANDONED BY THE VATICAN (An Analytical Memoir)By Jack DohertyMy Clandestine Journey to Support Secret Priests Behind the Iron CurtainIf you love gripping intrigue and adventure and hate betrayal and hypocrisy, you’ll be both rewarded and disgusted by reading Abandoned by the Vatican.Accompany the author as he crosses over the Iron Curtain, the dead man’s land of mine fields, electrified fences and shooting fields. He prowls through the back alleys of Prague dodging the communist security police to meet secret priests waiting to tell the story of their years in prison and concentration camps, their interrogation and torture, hunger, hard labor, and now a life sentence as ex-convicts. In their atheistic police state the secret priests and their underground churches try to preserve basic human values and morals by their example. The 1968 Prague Spring reaction to Russian oppressive rule over its satellite countries brings a few years of limited freedom. Asked what they need? “News, information, books about our Catholic faith,” they reply.On another trip behind the Iron Curtain the author meets more secret priests in dilapidated huts, state-built cold-water flats, university back rooms, cars, alleyways and crowded restaurants. He is shadowed by communist security police. When he reaches the border to leave the country, he is detained, questioned and strip searched. Months later on another trip he is refused entry behind the Iron Curtain, declared a persona non grata, and placed on Communism’s black list. Regardless, the author with the help of United States military parishioners stationed in Germany establishes an information and book network that ships thousands of books to communist countries.Pope Saint John Paul II, then Cardinal of Krakow, Poland, wrote to the author to express “my thankfulness and appreciation for the great undertaking of the book project.”But Pope John Paul II would not appreciate the author’s condemnation of his and the Vatican’s treatment of the secret priests, when Communism fails, the Cold War ends, and the secret priests can function publically. Now judged as a threat to the structure of the institutional church, they become the other innocent victims of clerical abuse at the hands of Vatican bureaucrats, the Czechoslovakian bishops, and the state-licensed priests who collaborated with communist governments.The author is singularly able through personal experience, research, and letters from secret bishops and priests to tell the true story, largely unknown in the English-language world:•\tThe facts on the valid ordination of secret bishops and priests;•\tThe existence of married and female priests;•\tThe inner workings of the underground churches defying communist security police;•\tThe bishops and priests who betrayed the Catholic church and became spies;•\tThe Vatican’s worldwide spy and counterespionage network;•\tThe chilling Vatican hypocrisy in appeasing the communists;•\tThe rampant corruption in the Vatican as the Mafia and the Masons control the Vatican Bank, laundering money and counterfeiting stocks;•\tAnd important for the survival of the Catholic Church: the legacy of the secret priests.Abandoned by the Vatican is an addition to the great Catholic tradition of analyzing the words and behavior of the Vatican, its popes, cardinals, and bishops in the manner of such authors as George Weigel, Carl Bernstein, Jason Berry, and Gary Wills.",
  "genres": [
    "History"
  ],
  "author": "Jack Doherty",
  "average_rating": "4.43",
  "url": "https://www.goodreads.com/book/show/31859737-abandoned-by-the-vatican"
}