{
  "title": "Bussola",
  "description": "Un romanzo maestoso, erudito e appassionante su un tema di grandissima attualità: i nostri rapporti con le civiltà orientali, islamiche, turche, persiane, siriane.La doppia storia di due amori impossibili: la prima tra un timido orientalista austriaco e un’affascinante collega francese lungo le strade di Turchia, Siria, Persia; e la seconda tra Occidente e Oriente nel corso della Storia.Vincitore del Premio Goncourt 2015.Con questo straordinario romanzo-fiume uno dei più raffinati autori francesi ha vinto il Premio Goncourt nel 2015. Bussola è la storia d’amore tra Franz, uno specialista dell’Oriente, e Sarah, anch’essa studiosa delle civiltà orientali, un amore che dura anni e si snoda attraverso Europa, Iran, Siria e Turchia. Ma è anche la storia di un altro amore tormentato: quello tra l’occidente e l’oriente. Un amore raccontato attraverso le centinaia di storie di coloro, donne e uomini europei, che nel corso dei secoli hanno dedicato le loro vite (e spesso le hanno perse tragicamente) all’inseguimento di questa passione “impossibile”.Con un’erudizione impressionante che non offusca mai il piacere della lettura, Enard racconta le vite avventurose e appassionate di scrittori, avventurieri, musicisti, viaggiatrici che si sono lasciate ammaliare dall’esotismo e dalla sensualità di luoghi come la Persia, Costantinopoli, Palmira; luoghi di questa passione divisa tra miraggio e illusione da una parte e vite reali e ben concrete dall’altra. Cos’è stato l’orientalismo? Un miraggio del deserto favorito dai fumi dell’oppio, dai profumi delle spezie e dalle mire coloniali dell’Europa, o un vero incontro tra culture diverse ma complementari, l’una bisognosa dell’altra, alla continua ricerca dell’Altro che ci completa?",
  "genres": [
    "Fiction",
    "France",
    "French Literature",
    "Novels",
    "Literary Fiction",
    "Literature",
    "Contemporary"
  ],
  "author": "Mathias Énard",
  "average_rating": "3.79",
  "url": "https://www.goodreads.com/book/show/31844917-bussola"
}