{
  "title": "The Forevers",
  "description": "\"I don't know how old I am. We don't need to know. But I know I'm at least nineteen. I'll be nineteen forever. My name, Paige, means youthful assistant. All of us Forevers have names that mean young or youthful and we wear a tattoo of two golden apples on our left wrist that shows we belong to IDunaCorp. I want to know more. I want to know why I'm here and what's out there beyond the compound. But they tell us it's dangerous outside. Because everyone wants what we have and they'll tear us apart to get it.\" Paige is a forever, genetically altered to stay nineteen forever and live in the secret Iduna Corp compound, a place where age reversal and immortality has been perfected. Forevers are told to live for the moment. Be what you want to be for a while and when you get sick of it - be something else. But when her friends start disappearing Paige suspects there's a darker side to their luxurious prison. The official word is they've been kidnapped by criminals on the outside who want to use them as feeders. Feeders have a short and brutal life - kept in captivity and sucked dry of all their youth cells so the Crime Lords can enjoy eternal youth.Her friend Junius involves her in planning a daring escape from the compound so they can infiltrate the IdunaCorp organization and find out what's really happening to their missing friends. They're joined by the charismatic and musical Chale, a Keener whose attraction to Paige causes tension between her and Junius. What will they find on the outside? How has the quest for immortality changed humanity?The journey becomes so dangerous Paige is forced to push herself to the limits of her endurance and to make tough decisions about who she can trust - Junius or Chale.",
  "genres": [
    "Dystopia",
    "Young Adult",
    "Science Fiction",
    "Amazon",
    "War"
  ],
  "author": "Marjorie DeLuca",
  "average_rating": "3.45",
  "url": "https://www.goodreads.com/book/show/31859822-the-forevers"
}