{
  "title": "The Story of John Nightly",
  "description": "This debut novel by Tot Taylor explores 'extreme creativity' – at the level of 'genius' - in this tale of a young singer-songwriter from the 1970s. With a painting by Bob & Roberta Smith adorning its cover, the book's 900 pages recount a life-story from childhood to . . . oblivion. John Nightly (b. Cambridge 1948) finds his dimension in the world of pop music - the art form of his time. In previous decades, he might have been a novelist or poet, a painter or a playwright. In previous centuries, a grand chef or gardener, astronomer or plant-hunter, when these occupations were revered as highly as that of ‘Artist’. We follow his rise and fall, his growing up and development as a musician, the tragedy of his ambition and his success, followed by his subsequent withdrawal from everyday life. John Nightly’s creative period, his ‘spirit-wind’, lasts a mere five summers. John Nightly’s ability is spotted early, his LP 'Ape Box Metal'  becoming the third best-selling record of 1970. But success turns out to have side effects and he disappears into a thirty year void of missed opportunities and unfinished projects. We meet him as a child prodigy in late 1950s Cambridge, finding fame in the Carnaby Street music scene of the mid-60s then supermaxed at various retreats in Los Angeles during the 70s. John Nightly sleeps through the 1980s until after too many lost years, he moves to his ‘saven-heer’ at Carn Point on the coast of Cornwall.In 1982, John begins a new life as a cultivator and exporter of exotic plants until his past comes back to haunt him via the rediscovery by a superfan of his magnum opus, the 'Mink Bungalow Requiem' - a proto-quasi-rock-opera cum pseudo-requiem eco-mass which he failed to complete thirty years before. Premiered in 1970, the 'Mink Bungalow Requiem' still holds the all-time record for the most performers on a public stage at any one time. Just before his meltdown, John Nightly toured the world with it backed by two symphony orchestras, a thirty-piece rock band, a dance company, three school choirs and sixteen articulated trucks. Meeting this teenage saviour dude, can the Master be brought back to life again? A tangled love story, the recording-studio as creative hub, the music industry as dramatic backdrop, astronomical tables, Methodist hymnals and surfer mags as well as some serious gardening notes also play important parts in this one thousand page novel.",
  "genres": [
    "Music",
    "Novels",
    "Fiction"
  ],
  "author": "Tot Taylor",
  "average_rating": "3.73",
  "url": "https://www.goodreads.com/book/show/31850342-the-story-of-john-nightly"
}