{
  "title": "From Cairo, With Love",
  "description": "From the publisher of the USA TODAY bestselling & #1 Amazon bestselling Timeless Romance Anthology series in Clean & Wholesome Romance, comes the Timeless Romance Singles line.  FROM CAIRO, WITH LOVE: A brand new historical romance novella from bestselling author Nancy Campbell Allen. Valentine Baker longs for adventure, so when the opportunity comes to travel to Venice and be a companion for the unconventional Contessa, she takes it--but they don’t stay in Venice long. Valentine finds herself on a ship bound for Cairo so the Contessa can hunt down a thief at one of her archaeological digs there. Before they ever get close to the coast of Egypt, however, the ship is threatened by a violent storm and someone has an ulterior motive for sticking close to the Contessa and her traveling companions.Mr. Maxwell is assigned to protect the Contessa and the charming Valentine. He tries to keep his distance, but her warm nature and easy laugh draw him in. He soon comes to cherish their time together, until someone attempts to drug him, and the aftermath reveals serious consequences for Valentine. He’ll do anything to keep her safe and her reputation intact, yet with treachery on board and his heart at stake, Mr. Maxwell must make a choice that will change his life forever. Can he win the woman of his dreams or will whoever wants to hurt them get close enough to take away his one chance for love? More Timeless Romance Singles:Sophia's Leap-Year Courtship by Kristin Holt  Other books by Nancy Campbell Allen: My Fair Gentleman Beauty and the Clockwork Beast Autumn Masquerade (Timeless Regency Collection) European Collection (A Timeless Romance Anthology)",
  "genres": [
    "Romance",
    "Historical Fiction",
    "Novella",
    "Historical",
    "Regency",
    "Clean Romance",
    "Historical Romance"
  ],
  "author": "Nancy Campbell Allen",
  "average_rating": "4.29",
  "url": "https://www.goodreads.com/book/show/31851730-from-cairo-with-love"
}