{
  "title": "The Road to Reveille",
  "description": "A coming-of-age Western adventure of greed, violence and retribution, THE ROAD TO REVEILLE centers on the clash between a rugged old rancher and a dangerous, young Irish street thug. The novel ranges from the rough streets of early 20th-century Manhattan to the vast expanses and treacherous intrigues of life in Wyoming cattle country. Nineteen-year-old Tom Callaghan agrees reluctantly to leave New York for Wyoming to avoid a stretch in Sing Sing prison — accompanied by Will Sherman, the same man he assaulted. At Sherman's Box T ranch in the Wind River basin, Tom immediately clashes with Will's headstrong daughter, Ellen, who views Tom as the usurper of her late brother's place. She is consumed with guilt over her role in her younger brother's death by the untamed black stallion, Caliban. And Tom quickly finds himself facing the enemies of his benefactor, Will Sherman, in a deadly reckoning. McLain’s screenplay, based on his novel, was a finalist in the international Writers Digest Screenwriting Competition. ACCLAIM FOR THE ROAD TO WESTERN WRITERS OF AMERICA — “This is a beautifully written novel with a strong sense of place and complex characters. A good read for a winter’s evening.” DAYTONA BEACH NEWS-JOURNAL — “McLain deftly describes the sights, sounds and even the smells of this odd couple’s turn-of-the-century odyssey from the big city to the Wild West in a narrative style reminiscent of Caleb Carr’s tense, gloomy murder mystery, The Alienist. McLain’s characters are multi-dimensional and interesting, especially the baseball-card-collecting Crow Indian Albert Redwolf. It should appeal to those who enjoy plenty of action, romance, traditional plot lines and historically accurate fiction with an Old West flavor.” Author PAT MULLAN, Ireland Chair of International Thriller Writers, Inc. and member of Mystery Writers of America, County Galway, Ireland — “When I was in my teens in Ireland, I devoured every Zane Grey western that I could find. When the movies came to town I was riding, in my imagination, alongside Hopalong Cassidy, John Wayne, Rory Calhoun, Alan Ladd, Roy Rogers, Guy Madison. Later in life my reading interests changed. I haven't read a western in years until this book. I won't reprise the story or the plot in this review. No, I just want to convey my satisfaction to John McLain for a most absorbing read, for a Western better than those of my youth, for a real story of The West, truly of the America of my youth and of my imagination...enough then to have started my romance with America, to lead eventually to my pioneering journey to America, to lead to becoming an American. Yes, it is totally believable, superbly well-written, absorbing to read, a classic of the genre.” BOB SPEARS, HEARTLAND REVIEWS — “This is one of the better historical coming of age books I've read in a while. The author is a very competent writer. The plot was excellent, leaving the reader hanging until the very last sentence. The pace moved quickly and setting, characters and dialogue were most descriptive and unique. This is a good book for lovers of westerns, historical novels, and especially young adults who learn how it's possible to rise above an abusive past and a life of street crime. We rated this book a high 4 hearts.” T.D. WALSH, AUTHOR, KEENE, NH — “I like the people in this novel, and that's one of the main tests of a book for me—whether or not I care what happens to the characters. John McLain has written a very strong story of love, fear, pain, and hope, and he's done so with an extremely strong eye for detail (especially interesting given the time in which the action takes place), a",
  "genres": [],
  "author": "John McLain",
  "average_rating": "4.50",
  "url": "https://www.goodreads.com/book/show/11963942-the-road-to-reveille"
}