{
  "title": "The Heart of Stone",
  "description": "Mercenary. Murderer. Monster. Task has been called many names in his time.“Echoes of Brandon Sanderson and Scott Lynch.”– SFF World“Grimdark with heart and soul.”– Anna Smith Spark, author of The Empires of Dust Trilogy“A very, very good read.\"– Fantasy Faction“A brutal delight with thrilling action and heart, rowdy and wise, bloody and tender at the same time.\"– Dyrk Ashton, author of The Paternus TrilogyBest Self-Published Fantasy Novel– 2017 Booknest Fantasy Awards———Golems are built for war and little else. In centuries past, they were a terrifying staple of the battlefield. Empires were conquered on the backs of golems. Now, time and fear have whittled their kind down to a precious few, kept only by kings and warlords.Task of Wind-Cut is one such machine of war.Task was built to kill. Built to win. Thousands have died at his stone hands. He cared once, perhaps, but far too many years have passed and too much blood has been spilled. Task has become numb to the chaos he wreaks for his masters. A slave to the spells that bind him.Now, Task has a new master to serve and a new war to endure. In the far reaches of the Realm, Hartlund is in the grip of civil war, tearing itself in two over coin and crown. This time, Task will fight for a boy king and a general bent on victory.Beneath his formidable stone, Task longs for change. For an end to this cycle of warfare. For proof of light and good amongst the foul darkness of humanity and war. It will take the mind of an unusual stable-girl to change his.———ABOUT THE HEART OF STONEPacked with action and yet emotionally charged, The Heart of Stone is an epic military fantasy novel that explores the facets of human nature and the roots of warfare and conflict. Told through the eyes of Task, a five hundred year-old golem, this standalone fantasy is perfect for fans of Brandon Sanderson, Mark Lawrence, Scott Lynch and Joe Abercrombie.———MORE PRAISE FOR THE HEART OF STONE“From the fascinating world-building to the intriguing, colorful and memorable characters, The Heart of Stone is a pleasure to read.”– BookNest“Dark, brutal and violent, and packed with heart and emotional depth, The Heart of Stone is an intriguing novel.”– Alan Baxter, author of The Alex Caine Series“This is Ben’s best book yet. Plain and simple.”– Michael R. Miller, author of The Dragon’s Blade Trilogy\"A solidly written and fascinating dark fantasy.\"– BiblioSanctum",
  "genres": [
    "Fantasy",
    "Fiction",
    "High Fantasy",
    "Dark Fantasy",
    "Magic",
    "Epic Fantasy",
    "Military Fiction"
  ],
  "author": "Ben Galley",
  "average_rating": "4.10",
  "url": "https://www.goodreads.com/book/show/31844202-the-heart-of-stone"
}