{
  "title": "65 Great Tales of Horror",
  "description": "CONTENTSVilliers de L’isle Adam – The Salvationists (The Torture Of hope)Honore de Balzac – The Mysterious MansionE. F. Benson – Negotium PerambulansCharles Birkin – Text For TodayRobert Bloch – Return To The SabbathSydney J. Bounds – HothouseRay Bradbury – The October GameJoseph Payne Brennan – The Horror At Chilton CastleAnthony Burgess – An American OrganThomas Burke – The BirdHortense Calisher – HeartburnTruman Capote – MiriamR. Chetwynd-Hayes – The MonsterAgatha Christie – The Last SeanceJohn Collier – De MortuisWilliam Wilkie Collins – A Terribly Strange BedR. C. Cook – Green FingersRoald Dahl – The LandladyMary Danby – Nursery TeaMonica Dickens – Activity TimeArthur Conan Doyle – The Brazilian CatStanley Ellin – The Speciality Of The HouseA. E. Ellis – If Thy Right Hand Offends TheeH. H. Ewers – The SpiderElizabeth Fancett – Someone In The RoomWilliam Faulkner – A Rose For EmilyC. S. Forester – The Man Who Didn’t Ask WhyJane Gaskell – JaneTerry Gisbourne – The Quiet ManJohn B. L. Goodwin – The CocoonPatricia Highsmith – The Snail-WatcherFanny Hurst – GuiltyHenry James – The Romance Of Certain Old ClothesGerald Kersh – Comrade DeathHenry Kuttner – The Salem HorrorDavid Langford – Cold SpellL. A. Lewis – The Meerschaum PipeH. P. Lovecraft – The HoundPhilip MacDonald – Our Feathered FriendsRoger Malisson – The Thirteenth KestrelFrederick Marryat – The WerewolfRichard Matheson – No Such Thing As A VampireGuy de Maupassant – The HandClive Pemberton – The Will Of Luke CarloweHal Pink – The Screaming PlantEdgar Allan Poe – The Black CatSeabury Quinn – The House Of HorrorJane Rice – The RefugeeRobert Silverberg – Back From The GraveFrances Stephens – ClawsBram Stoker – Dracula [extract]Theodore Sturgeon – ItTerry Tapp – See How They RunBernard Taylor – Pat-a-Cake, Pat-a-CakeWilliam F. Temple – The Whispering GalleryHarry E. Turner – Now Showing At The RoxyR. E. Vernede – The Finless DeathEvelyn Waugh – The Man Who Liked DickensPhilip Welby – BuffyH. G. Wells – Pollock And The Porroh ManEdward Lucas White – LukundooT. H. White – The TrollHenry S. Whitehead – The LipsAngus Wilson – Mummy To The RescueAlexander Woollcott – Moonlight Sonata",
  "genres": [
    "Horror",
    "Short Stories",
    "Anthologies",
    "Fantasy",
    "Fiction"
  ],
  "author": "Mary Danby",
  "average_rating": "3.77",
  "url": "https://www.goodreads.com/book/show/1196376.65_Great_Tales_of_Horror"
}