{
  "title": "Unmet Needs of Entrepreneurship",
  "description": "What needs of entrepreneurs are met by meeting the unmet needs of the customer? Do market conditions attract a person to take up entrepreneurship or is there a characteristic in us that attracts us to opportunities of a specific kind that is most likely to result in successful business ventures and aligned to who we are? Why do businesses exist? How to discover a customer's met and unmet needs? What is the role of needs in building a nurturing and growth oriented work culture in an organization? What is its impact on the personal life of the entrepreneur? Needs play an important role as a motivating force that enables people to move into action. It impacts many areas of entrepreneurship. This book is an attempt to provide perspectives on the impact of \"needs\" on various aspects of a business. The journey to understanding customer needs starts by framing a complete needs statement (CNS) and a complete unmet needs statement (CUNS). A model has been provided to help the reader frame these two important statements. Together, the two of them can be a useful tool in the hands of anyone working with a customer. In the chapter Customer Needs Discovery Process and Logical Levels the model is extended and linked to the “neurological levels” of Dr Robert Dilts. Dilts's logical levels have been used extensively to categorize the meaning of needs, consequences, customer profiling and decision making criteria. Emotional Intelligence (EI) has started to gain prominence in business organizations. The ABCDE model (Rational Emotive Behavioural Therapy) of Dr Albert Ellis is illustrated through examples. This model is useful in building EI in individuals and organizations. The disconnect between the desire for immediate action and the long term needs of an organization is analysed, and the application of the OFNR model (used in Non Violent Communication) is illustrated as well. The chapter titled \"Perceived Reality, Innovation and New Ideas Generation\" has been dedicated to the need for innovation and new ideas generation. The chapter focuses on breakout innovation, its characteristics and the skills that one can develop to generate new ideas. Entrepreneurs often face the question, \"Do I want to be a pioneer or a follower?\" To bring clarity, I have analysed different decision making patterns that people employ in the chapter titled \"Entrepreneurial Dilemma: Pioneer or Follower\". Growth, inclusiveness and the challenges of creating a motivated team are also explored in this chapter. The reader is introduced to the FROG model of motivation. This model highlights the role of catalysts in providing the momentum required to achieve one's goals. The role of empathy in building a nurturing, compassionate organization is explored in the chapter titled \"Connectedness and Empathy\". How to connect to people, improve one's life and use language that is life enriching is illustrated using the model of Non-Violent Communication (NVC). The book begins with the chapter \"Getting Started in Entrepreneurship\", which analyses the real reasons people are reluctant to taking up entrepreneurship. It also explores the attractiveness of the entrepreneurial journey, what you can learn from entrepreneurship, the brass tacks of starting a new venture, the desired characteristics of the startup team and the process of defining a mission and goals. When businesses fail, the usual focus is on various numerical analyses. Seldom is there any focus on the personal challenges that entrepreneurs face and how they cope with failures. The last chapter, \"Coping with Business Failures\", deals with exactly this. I have explored strategies at the level of beliefs, emotions and behaviour. I have illustrated many of the concepts using examples, real life excerpts and cartoons. Examples have been provided spanning the personal and professional life of an entrepreneur that highlights the application of the ideas to various contexts.",
  "genres": [],
  "author": "S.  Parthasarathy",
  "average_rating": "4.17",
  "url": "https://www.goodreads.com/book/show/31856458-unmet-needs-of-entrepreneurship"
}