{
  "title": "High Adventure: The True Story of the First Ascent of Everest",
  "description": "Fear lives among Everest's mighty ice-fluted faces and howls across its razor-sharp crags. Gnawing at reason and enslaving minds, it has killed many and defeated countless others. But in 1953, Edmund Hillary and Tenzing Norgay stared into its dark eye and did not waver. On May 29, they pushed spent bodies and aching lungs past the achievable to pursue the impossible. At a terminal altitude of 29,028 feet, they stood triumphant atop the highest peak in the world.With nimble words and a straightforward style, New Zealand mountaineering legend Hillary recollects the bravery and frustration, the agony and glory that marked his Everest odyssey. From the 1951 expedition that led to the discovery of the Southern Route, through the grueling Himalayan training of 1952, and on to the successful 1953 expedition led by Colonel John Hunt, Hillary conveys in precise language the mountain's unforgiving conditions. In explicit detail he recalls an Everest where chaotic icefalls force costly detours, unstable snow ledges promise to avalanche at the slightest misstep, and brutal weather shifts from pulse-stopping cold to fiendish heat in mere minutes.In defiance of these torturous conditions, Hillary remains enthusiastic and never hesitates in his quest for the summit. Despite the enormity of his and Norgay's achievement, he regards himself, Norgay, and the other members of his expedition as hardworking men, not heroes. And while he never would have reached the top without practiced skill and technical competence, his thrilling memoir speaks first to his admiration of the human drive to explore, to understand, to risk, and to conquer.",
  "genres": [
    "Adventure",
    "Nonfiction",
    "Mountaineering",
    "History",
    "Memoir",
    "Travel",
    "Biography"
  ],
  "author": "Edmund Hillary",
  "average_rating": "4.14",
  "url": "https://www.goodreads.com/book/show/318754.High_Adventure"
}