{
  "title": "Jameson",
  "description": "Jameson O'Rourke owns the primo tattoo shop in town, one he's worked hard to build. And in his industry, he's the current 'it' boy, the reigning King of Ink. His career is on fire, so hot television has even come calling. And as a result, the town bad-boy has now become the town's favored son.  Ava Hightower needs his face on her flyers, if she is to have any hope of her charity gala and bachelor auction being a success. Unfortunately, they get along like oil and water. He's a hardheaded, controlling jerk, and she's already had one run-in with the man. Asking him, of all people, for help is the last thing she wants to do.  Not exactly a match made in heaven.  Jameson doesn't think too highly of Miss Hightower, either.  To him, she's just an uptight, stuck-up know-it-all; a little Miss Goody-two-shoes. Not in a million years was she the type that he'd have anything to do with. Unfortunately she is also on the city council, and therefore has the ability to screw with his business.  He needed her help once before, and she shot him down.  Now the tables are turned, and she needs his help. Well, my, my, sweetheart, karma can be a cold-hearted bitch.  But, hey, maybe he could work this to his advantage.  You scratch my back, I'll scratch yours, and all that crap.  So they cut a deal. One he has no intention of ever having to fulfill, because he plans to make it impossible for her to keep her end of it.  She thought she could outlast him. Guess again, sweet thing. She may be a stubborn woman, but she's met her match. And he has no intention of letting her win this game.  Be warned, sweetheart, because the King of Ink has plans to push your limits in ways you've never imagined.  This new series from Nicole James, author of the Evil Dead MC series biker romance is a new addition to the bad boy romance genre with her hot, alpha, dominant men.",
  "genres": [
    "Romance",
    "Contemporary Romance",
    "Contemporary",
    "Enemies To Lovers",
    "Erotica",
    "Drama",
    "Adult"
  ],
  "author": "Nicole  James",
  "average_rating": "4.31",
  "url": "https://www.goodreads.com/book/show/31867525-jameson"
}