{
  "title": "Unearthed",
  "description": "Love. The most powerful force in existence, but also the most ruthless. Cunning and deceptive. Man’s greatest Achilles heel. Leaving all who embrace it weak and vulnerable. At least that’s how Dom-for-hire Max Kelley sees it, after the love of his life knocked him on his ass. A brutal blow that not only stole his breath, but decimated his ability to trust. Turning him cold and cynical. The TKO he never saw coming. Love. A mistake Max won’t ever make again. Meaning no more relationships—not exactly a hardship. Just the thought of dating makes him queasy, and one of the reasons he doms for a living. To sexually engage without the poison of intimacy. The other reason? To keep his demons sated. With whips and chains, and scandalous kink. A fiery mix that always hits the spot. That is, until a bright-eyed beauty walks into his life and refuses to leave. Sean Matthews. College senior and flirt extraordinaire. Max’s newest—and greenest—client sub. Man, is he delicious; able to push Max’s buttons, able to make him crave the things he knows he shouldn’t. Sound the alarm, this can only mean trouble. Unfortunately, deterring Sean proves virtually impossible, and now Max finds himself at a crossroads. Man up and kick his favorite sub to the curb… or succumb to his own caged desires. ** Warning: Contains references to sensitive matters involving teens, as well as mentions pertaining to child abuse, that some might find disturbing.This BDSM romance also contains intensely explicit scenes both inside and out of the dungeon.** Note from the author: While this duology can be considered a stand alone, I highly recommend readers visit the prior series (Upending Tad: A Journey of Erotic Discovery) first for two reasons: It was the chemistry of Tad and Scott that started it all and won these books such a devoted following. But also, the love interests in Unearthed (Max and Sean) were first featured in the previously mentioned series, giving the reader a unique first impression of them from Tad and Scott's POV. Most readers would agree that Max definitely made his mark in a very striking way long before Unearthed ever came to be.",
  "genres": [
    "BDSM",
    "M M Romance",
    "Romance",
    "Erotica",
    "Contemporary",
    "College",
    "LGBT"
  ],
  "author": "Kora Knight",
  "average_rating": "4.25",
  "url": "https://www.goodreads.com/book/show/31883576-unearthed"
}