{
  "title": "Don't Hassel the Hoff: The Autobiography",
  "description": "The Los Angeles Times called him a \"counterculture icon,\" and TV Guide dubbed him one of \"TV's Ten Most Powerful Stars,\" but true aficionados simply call him \"The Hoff.\"   Don't Hassel the Hoff follows David Hasselhoff's phenomenal career, from his earliest childhood role in Peter Pan to his latest adventure, starring in Mel Brooks's Tony award-winning musical, The Producers.  There is no better time to celebrate Hasselhoff's life and a career that continues to grow and thrive. As the star of the extremely popular classic television shows, \"Baywatch\" and \"Knight Rider,\" Hasselhoff is an international mega-star, with platinum album sales and starring roles on Broadway and London's West End. As this fascinating memoir reveals, there's more to this handsome superstar than great hair, and legs that look good while running down a beach. \"The Hoff\" is also a smart, caring man with a huge heart.  \"This book is my opportunity to print something from my heart, to tell the truth about what happened to me on the long and winding road from Baltimore to Baywatch to Broadway - and beyond.  And the truth is not to be found in tabloid stories but in my actions: I am a good father and tried to be a good husband.  I love people and the emotional rollercoaster that goes with human relationships. I love all the bewildering, crazy and wonderful things that life has to offer. This book is about my successes and my failures, my strengths and my weaknesses.  And, above all, it is about the hope contained in the Knight Rider slogan: \"One man can make a difference.\" --David Hasselhoff Full of behind-the-scenes looks at Hasselhoff's television series, celebrations of his proudest moments, and the truths about his struggles with relationships and alcohol, Don't Hassel the Hoff is both highly entertaining and deeply personal, making this an engrossing page-turner from start to finish.   Long live \"The Hoff.\"",
  "genres": [
    "Biography",
    "Nonfiction",
    "Autobiography"
  ],
  "author": "David Hasselhoff",
  "average_rating": "3.23",
  "url": "https://www.goodreads.com/book/show/318824.Don_t_Hassel_the_Hoff"
}