{
  "title": "Orygun: Poems",
  "description": "Ms. Tyner's recall is so sensory, her imagination so rooted, her language so up front, and her sensibility so rounded, that she has no need of the merely fanciful. There is no glitz for looks here, no trading on fragility. This book will knock your socks off.―Marvin Bell, National Book Award Winner for Poetry, Guggenheim Fellowship for Creative Arts, WinnerJessica Tyner masterfully evokes the gut-punch of human existence, wielding sharply crafted words that bound like a familiar melody threatening to bend out of tune with every revelation.―Jared Goode, Playwright Orange is the New MusicalORYGUN takes you home, marrying confessional poetry, while tapping deep into the reader’s cravings for a full literary experience. This collection of narrative poems touch on how the landscapes that helped raise us also shape us, the intricacies of love with ourselves and others, and shared human struggles of hope and desire, as we teeter on ever-changing, emotional edges.We invite you to enjoy powerfully evocative and beautifully written poems from Jessica's third book of poetry, ORYGUN.Why ORYGUN? “It’s Ory-gun, not Ora-gone.” Native Oregonians―or those who have assimilated impressively well―have given this admonishment numerous times. How a person pronounces “Oregon” tells you if they’re a local or not. Jessica Tyner, born and raised in Oregon, grew up seeing the famous ORYGUN bumper stickers. As you meander father north towards Portland, you’ll spot a peppering of “It’s Willamette, dammit!” stickers mixed in with the requisite “Keep Portland Weird” commands. Yes, Oregon is a state thick with cities, streets and rivers with unusual, often Native American-inspired, names and pronunciations from Couch (“Cooch”) to The Dalles (not “Dallas”―that’s another city in Oregon!).For Oregonians, correct pronunciation of the gorgeously green state is more than a matter of pride. It’s a slight nod to the rich Native American history of the region, and also a bit like a secret password to a very exclusive club.",
  "genres": [],
  "author": "Jessica Tyner",
  "average_rating": "0.00",
  "url": "https://www.goodreads.com/book/show/31863524-orygun"
}