{
  "title": "In Their Lives: Great Writers on Great Beatles Songs",
  "description": "The perfect gift for any Beatles fan, In Their Lives is an anthology of essays from a chorus of twenty-nine luminaries singing the praises of their favorite Beatles songs.The Beatles’ influence—on their contemporaries, on our cultural consciousness, and on the music industry ever after—is difficult to overstate. We all have a favorite song from the band that made us want to fall in love, tune in, and follow our dreams. Arranged chronologically by the date of the song’s release, these essays highlight both the Beatles’ evolution as well as the span of generations their music affected. Whether they are Beatlemaniacs who grew up listening to the iconic albums on vinyl or new fans who stream their favorite songs on their phones, all of the contributors explore that poignant intersection between Beatles history and personal history.With contributions from twenty-nine authors and musicians—Roz Chast on “She Loves You,” Jane Smiley on “I Want to Hold Your Hand,” Rosanne Cash on “No Reply,” Gerald Early on “I’m a Loser,” Rick Moody on “The End,” Maria Popova on “Yellow Submarine,” David Duchovny on “Dear Prudence,” Chuck Klosterman on “Helter Skelter,” David Hajdu on “You Know My Name (Look Up the Number),” and more—the breadth of the band’s impact is clear. From musings on young love and family strife to explorations of racial boundaries and identity, these essays pay tribute to a band that ran the gamut of human experience in a way no musical group has done before or since.Timed for the fiftieth anniversary of the release of Sgt. Pepper’s Lonely Hearts Club Band , this anthology captures the full spectrum of reasons fans still love the Fab Four after all these years.  “ In Their Lives is full of pleasant surprises.”— New York Times",
  "genres": [
    "Music",
    "Nonfiction",
    "Essays",
    "History",
    "Art",
    "Short Stories",
    "Rock N Roll"
  ],
  "author": "Andrew Blauner",
  "average_rating": "3.61",
  "url": "https://www.goodreads.com/book/show/31868677-in-their-lives"
}