{
  "title": "Dark Elves: Taken",
  "description": "TAKENEveryone's heard tales of the Dark Forest, tales of entire bands entering the depths of the forest and simply disappearing, then the bones of some of the victims showing up neatly arranged toward the safer outskirts of the forest. Bones of the male victims. The females simply... disappear.After being robbed and left unconscious, Diana is determined to hunt down the thief and recover her money, and sets off after him...through the Dark Forest. She and her friend Gala soon learn the secret of the Dark Forest, home to black-skinned, white-haired, sex-oozing devils. These elves instinctively know more about sexual pleasure than any human ever could. Captured,taken, Diana is brought to the heights of ecstasy by Commander Salin, but still won't submit...Never has a woman been so much trouble. Never has a woman so ?red Salin's blood. He will have her. He must.MASTEREDSuzana has lost all she held dear. Her family dead at sea, she, a musical mage of noble birth, has been taken by slavers. But then the traders' caravan is overtaken in the Dark Forest by the mysterious raedjour who are determined to take the one thing she still calls her own: her body.Suzana's capture is cause for celebration amongst the raedjour. Virgins are highly prized, and a tournament is held for the honor of taking her maidenhead. And once it is taken, she will be passed to a different warrior every nine days until she finds her truemate.From the moment he saw her, Krael knew Suzana was his to conquer. Her soft body incites the lust he's honed over many cycles to pleasure and train women. He'll have her body, but he has no interest in being her truemate...until Krael's king is determined to take her. Only then does Krael grow determined to master her for his very own.Have you ever wondered what it would be like to be used... pleasured... Taken... Mastered?Publisher's note: This book contains explicit sexual content, graphic language, and situations that some readers may find objectionable: Bondage, domination/submission, dubious consent, male/male sexual practices, and multiple partners.",
  "genres": [
    "Erotica",
    "Fantasy",
    "Paranormal Romance",
    "Romance",
    "Paranormal",
    "BDSM",
    "Erotic Romance"
  ],
  "author": "Jet Mykles",
  "average_rating": "3.73",
  "url": "https://www.goodreads.com/book/show/3187965-dark-elves"
}