{
  "title": "America's Secret War: Inside the Hidden Worldwide Struggle Between America and Its Enemies",
  "description": "George Friedman delivers the geopolitical story that the mainstream media has been unable to uncover — the startling truth behind America’s foreign policy and war effort in Afghanistan, Iraq, and beyond .Friedman, founder of Stratfor, one of the world’s most respected private global intelligence firms, and Geopolitical Futures, has an unmatched ability to provide clear perspective on the current geopolitical map. In America's Secret War, George Friedman identifies the United States’ most dangerous enemies, delves into presidential strategies of the last quarter century, and reveals the real reasons behind the attack of 9/11—and the Bush administration’s motivation for the war in Iraq. It describes in eye-opening detail America’s covert and overt efforts in the global war against Not only are U.S. armies in combat on every continent, but since 9/11 the intelligence services of dozens of nations have been operating in close partnership with the CIA.Drawing on his vast information-gathering network, Friedman presents an insightful picture of today’s world that goes far beyond what is reported on television and in other news media.Al Qaeda’s war plans and how they led to 9/11The threat of a suitcase nuclear bomb in New York and how that changed the course of the war.The deal the U.S. made with Russia and Iran which made the invasion of Afghanistan possible – and how those deals affect the United States today.How fear and suspicion of the Saudis after 9-11 tore apart the Bush-Saudi relationship and why Saudi Arabia’s closest friends in the administration became the Saudi’s worst enemies.The real reasons behind George W. Bush’s invasion of Iraq and how WMD became the cover for a much deeper game.How the CIA miscalculated about Saddam Hussein’s and Iran’s real plans, leaving the U.S. bogged down in the war.How the war in Iraq began with a ruse, pretending that a “target of opportunity” attack on Saddam Hussein had presented itself.The real story about why the U.S. raises and lowers its alert status and why the United States can’t find and destroy al Qaeda.The strategic successes that are slowly leading the United States to victoryAmerica's Secret War is an unprecedented look at the new world war being waged behind-the-scenes today. It is sure to stir debate and capture headlines around the world.",
  "genres": [
    "History",
    "Politics",
    "Nonfiction",
    "War",
    "Military Fiction",
    "Audiobook",
    "Espionage"
  ],
  "author": "George Friedman",
  "average_rating": "3.86",
  "url": "https://www.goodreads.com/book/show/318659.America_s_Secret_War"
}