{
  "title": "Anarquistas, Graças a Deus",
  "description": "Publicado em 1979 e transformado em minissérie da rede Globo em 1984, Anarquistas, graças a Deus é o livro de estréia de Zélia Gattai e seu primeiro grande sucesso.Filha de anarquistas chegados de Florença, por parte do pai Ernesto, e de católicos originários do Vêneto, da parte da mãe Angelina, a escritora trazia no sangue o calor de seus livros. Trinta e quatro anos depois de se casar com Jorge Amado, a sempre apaixonada Zélia abandona a posição de coadjuvante no mundo literário e experimenta a própria voz para contar a saga de sua família.É assim que ficamos conhecendo a intrépida aventura dos imigrantes italianos em busca da terra de sonhos, e o percurso interior da pequena Zélia na capital paulista - uma menina para quem a vida, mesmo nos momentos mais adversos ou indecifráveis, nunca perdeu o encanto. A determinação de seu Ernesto e a paixão pelos automóveis, a convivência diária com os irmãos e dona Angelina, os sábios conselhos da babá Maria Negra, as idas ao cinema, ao circo e à escola, as viagens em grupo, o avanço da cidade e da política - nestas crônicas familiares, vida e imaginação se embaralham, tendo como pano de fundo um Brasil que se moderniza sem, contudo, perder a magia.Exímia contadora de histórias, Zélia as transforma em instrumento privilegiado para o resgate da memória afetiva. Foi Jorge Amado quem, um dia, lendo um conto de qualidade duvidosa que Zélia rascunhava, pescou essa veia documental. Apontou-lhe o caminho e mostrou que ela se alimentava de sua rica ascendência familiar. Surge assim a Zélia memorialista, para quem a literatura provém não tanto da invenção, mas do trato apurado da memória e do desfiar cuidadoso, mas sem melindres, da intimidade.Em suas mãos, a literatura se torna, mais que confissão, auscultação do mundo. É tendência para o registro e o testemunho, que cimentam não só um estilo quase clínico de observar a existência, mas uma maneira de existir. Pois é da persistência do espanto que Zélia, em resumo, trata. Se Jorge Amado foi uma espécie de biógrafo involuntário do Brasil, Zélia Gattai se afirma como a grande narradora de nossa história sentimental.",
  "genres": [
    "Nonfiction",
    "Biography",
    "Portuguese Literature",
    "Brazil",
    "Classics",
    "Literature"
  ],
  "author": "Zélia Gattai",
  "average_rating": "4.24",
  "url": "https://www.goodreads.com/book/show/3191565-anarquistas-gra-as-a-deus"
}