{
  "title": "Illumine",
  "description": "THE ELECTRIFYING BEGINNING TO THE AMAZON BESTSELLING ILLUMINE SERIES! Winner for Paranormal Book of the Year by Turning Pages!Every action comes with a price. Let the flames begin.For the past five months Essallie Hanley has been trying to forget about the frightening murder of her boyfriend. Haunted by vivid nightmares and hallucinations of the event she does anything she can to pretend she's like every other normal girl in High School. Only Essallie is far from normal. Able to conjure blue fire and a shimmering silhouette of wings from her body, she seeks the only known solace left to her name; her first home in Belfast, Maine. But she soon realizes that her return home is only the beginning of a long and twisted road taking her as far from her humanity as possible, with Kayden, the demon originally summoned to slaughter her, leading the way. Unable to touch her but oddly curious, he joins Essallie in her search to find out just what she is. But neither of them were prepared for the secrets they've begun to unravel, secrets that will change Essallie and everyone around her forever.Fans of Nevermore  and Sweet Evil  will love the twisting mysteries and dark ties of love in The Illumine Series! Praise for Illumine, book one in The Illumine Series :\"A fabulous YA read, full of many different surprises at every turn! You don't know what, or who you'll run into next!\" - Uniquely Moi Books\"... Illumine  is a fast paced, action packed paranormal which will keep sinking its teeth into you until you've reached the last page!\" - Bellebooks\"I will definitely be reading the next book in the series to find out more!\" - BookStacksOnDeck\"If you like YA books about a little bit of magic, angels, and demons, I think you should give this book a try!\" - Synchronized Reading\"... If you're looking for a fast supernatural read, this one is perfect!\" - I Read Indie Book Blog\"Can't wait for the second book in this series to come out this summer. Hurry up summer! I've got some reading to do!\" - Nat's Book Nook\"... [ESSALLIE & KAYDEN'S] witty banter, their smoldering hidden feelings, all of it meshed beautifully and I was smitten.\" - Hopelessly Devoted Bilbliophile\"... The overriding story arc of a girl who had been kept in the dark as to who she is or what she can do and has to seek advice from a creature that has tormented her nightmares is compelling.\" - Reading The Paranormal\"This is surely to have a sequel that I myself will be looking forward to reading.\" - Jacquie Talento\"Alivia Anders' books must be read; they capture the reader from the start.\" - Leigh Kern\"I really felt like Essallie was telling her story, the emotions and characters that were concentrated on only made me want to know more as I began to connect with them. The reality spliced with fantasy was the perfect mix for laying out in the beach sun and forgetting about reality.\" - Katie Quinn\"If you enjoy Angels/Demons with various supernatural creatures thrown in the mix, you should enjoy this story!\" - Willow Cross, author of Birthright\"PERFECT YA FICTION.\" - Alex Rimany\"Essie... Was great as a protagonist, and dutifully stubborn. Her personality made for an interesting story, as well as the personalities of the people closest to her... Illumine was a fun, quick read that besides leaving me anxiously awaiting the second in the story, left me smiling.\" - Mera's YA Book Blog\"I absolutely loved this because even though it was a fast read, I never wanted it to end ever. The future can only tell what is in store with Essallie and where her journey will lead.\" - Silent T's Book Blog",
  "genres": [
    "Fantasy",
    "Paranormal",
    "Young Adult",
    "Angels",
    "Demons",
    "Romance",
    "Magic"
  ],
  "author": "Alivia Anders",
  "average_rating": "3.68",
  "url": "https://www.goodreads.com/book/show/11966330-illumine"
}