{
  "title": "Lyric and Lingerie",
  "description": "From New York Times Bestselling author Tracy Wolff and International Bestselling author Katie Graykowski comes a sexy tale of love, laughter and lingerie …  Lyric Wright is an off-beat astrophysicist whose life is falling apart around her. After losing her fiancé to a hula dancing astrologer and losing her dress to an ill-fated leap of faith, she’s sure there’s nowhere for her life to go but up. At least until she sits down on a trans-Pacific flight next to the one man she never wanted to see again—the boy she’d lost her heart and her virginity too back before she’d learned that friendship and football don’t equal true love.  Broken down quarterback Heath Montgomery is on a plane ride to nowhere. Dodging the phone call he’s certain will end his professional football career for good, he might be Texas bound, but he knows there’s nowhere for him to go but down. But that’s before his childhood best friend and confidante plops back into his life wearing nothing but duct tape and a bad attitude. Determined not to lose her again (especially since he isn’t sure why he lost her the first time) and desperate to outrun his own shadowy future, Heath sets out to take Lyric on the ride of her life. Too bad she only dates men who actually know what her butterfly nebula is … and can find it without the help of a star chart.  Add in one passive-aggressive flight attendant with delusions of couture, a cherry red car with a crush on Neil Diamond, an over-protective sister with a black belt in Krav Maga, two parents determined to marry their spinster daughter off to the hometown hero no matter the cost, and a whole lot of lingerie popping up in all the right places at all the wrong times and you’ve got an unforgettable love story that fans of Susan Elizabeth Phillips and Rachel Gibson won’t want to miss!",
  "genres": [
    "Sports",
    "Romance",
    "Contemporary",
    "Football",
    "Second Chance",
    "Contemporary Romance",
    "Humor"
  ],
  "author": "Tracy Wolff",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/31921673-lyric-and-lingerie"
}