{
  "title": "The Traitor's Emblem",
  "description": "THE #1 INTERNATIONAL BESTSELLER . In the vein of Dumas' and Zafón's masterpieces, Juan Gómez-Jurado's  The Traitor's Emblem  is an epic novel spanning decades of family betrayal, impossible love and the high price of vengeance. Set against the dark and menacing streets of Depression-era Munich and the cruel rise of Nazism, Gómez-Jurado's spellbinding thriller proves again that he is a master of narration.The Straits of Gibraltar, 1940. In the heart of a storm at sea, Captain GonzÁlez rescues a group of German castaways. When the torrent subsides, the leader of the survivors gratefully offers the captain a strange-looking emblem made of gold and diamonds, in exchange for safe passage to the coast of Portugal. Decades later, in 2002, the son of captain GonzÁlez receives a substantial offer for the emblem. He does not sell it, but the buyer reveals an astounding story behind that mysterious it holds the key to Paul Reiner's lifelong quest... Munich, 1919. After his family fall into disgrace, 15-year-old Paul Reiner and his mother work as servants in the palace of Baron Von Schroeder. Unhappy and full of despair, Paul dreams of the heroic father he never knew. But one night, seconds before committing suicide, Paul's cousin reveals a terrible secret. Paul's father didn't die in the First World War, as he had always been told. He was killed by someone very close to him, and for unclear reasons. This discovery turns Paul's world upside down and from that moment, Paul sacrifices everything to discover the truth behind his father's death, even his love for Alys Tannenbaum, a Jewish-American photographer who helps him on his dangerous pursuit.Visit TheTraitorsEmblem.com",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Thriller",
    "Mystery",
    "Historical",
    "Germany",
    "Spanish Literature"
  ],
  "author": "Juan Gómez-Jurado",
  "average_rating": "3.86",
  "url": "https://www.goodreads.com/book/show/10204213-the-traitor-s-emblem"
}