{
  "title": "The Big Squeeze: Tough Times for the American Worker",
  "description": "The Big Squeeze takes a fresh, probing, and often shocking look at the stresses and strains faced by tens of millions of American workers as wages have stagnated, health and pension benefits have grown stingier, and job security has shriveled.Going behind the scenes, Steven Greenhouse tells the stories of software engineers in Seattle, hotel housekeepers in Chicago, call center workers in New York, and janitors in Houston, as he explores why, in the world’s most affluent nation, so many corporations are intent on squeezing their workers dry. We meet all kinds of white collar and blue collar, high tech and low tech, middle income and low income; employees who stock shelves during a hurricane while locked inside their store, get fired after suffering debilitating injuries on the job, face egregious sexual harassment, and get laid off when their companies move high-tech operations abroad. We also meet young workers having a hard time starting out and seventy-year-old workers with too little money saved up to retire.The book explains how economic, business, political, and social trends—among them globalization, the influx of immigrants, and the Wal-Mart effect—have fueled the squeeze. We see how the social contract between employers and employees, guaranteeing steady work and good pensions, has eroded over the last three decades, damaged by massive layoffs of factory and office workers and Wall Street’s demands for ever-higher profits. In short, the post–World War II social contract that helped build the world’s largest and most prosperous middle class has been replaced by a startling corporate profits, economic growth, and worker productivity have grown strongly while worker pay has languished and Americans face ever-greater pressures to work harder and longer.Greenhouse also examines companies that are generous to their workers and can serve as models for all of corporate Costco, Patagonia, and the casino-hotels of Las Vegas among them. Finally, he presents a series of pragmatic, ready-to-be-implemented suggestions on what government, business, and labor should do to alleviate the squeeze.A balanced, consistently revealing exploration of a major American crisis.",
  "genres": [
    "Economics",
    "Nonfiction",
    "Labor",
    "Politics",
    "Sociology",
    "Business",
    "History"
  ],
  "author": "Steven Greenhouse",
  "average_rating": "3.93",
  "url": "https://www.goodreads.com/book/show/3192448-the-big-squeeze"
}