{
  "title": "Exquisite Innocence",
  "description": "This is the fifth book in the Iron Horse MC series, with Lyric and Hustler's story . . .LyricI've spent my entire life on my parent's isolated religious compound, sheltered and cut off from the rest of the world. It left me ill prepared to face the evil that invaded my home, and after a horrific encounter with demons masquerading as men, I fled. Some might say that my refuge is even worse than the prison I grew up in, but the men and women of the Iron Horse MC have been better to me than my own family. Unfortunately, the trouble I thought I left behind is still hunting me for reasons I don’t understand. Hustler has been assigned to be my guardian, but to my foolish heart he may be the biggest threat of all. Everything inside of me tells me we belong together, that I’ve been put on this earth to be his, but he insists we’ll never be anything more than friends.HustlerFor as long as I can remember the Iron Horse MC has been my family. I've fought, bled, and sacrificed a piece of my soul for my brothers, but I've been set up, labeled a traitor by those I trusted most. My only hope comes in the form of a naïve young girl I've been tasked with protecting, a woman who’s haunted both my heart and dreams. She’s everything good and beautiful in this world, and while I’ll never allow her to tarnish herself by loving me, I’ll do everything I can to make sure she survives.*-*Author's notes: ~ This unconventional MC series is one that SHOULD be read in series order, for the most enjoyment . . .~ This book, \"Exquisite Innocence\" is the first part of two, telling the story of Lyric and Hustler, with a 'Happy For Now' ending. Their HEA follows in \"Exquisite Sin\", the sixth, and final book in the series.\nIron Horse MC series\nReading order:Book 1: Exquisite Trouble (Swan & Smoke, Pt #1)Book 2: Exquisite Danger (Swan & Smoke, Pt #2)Book 3: Exquisite Redemption (Sarah & Beach, Pt #1)Book 4: Exquisite Karma (Sarah & Beach, Pt #2)Book 5: Exquisite Innocence (Lyric & Hustler, Pt #1)Book 6: Exquisite Sin (Lyric & Hustler, Pt #2)",
  "genres": [
    "Romance",
    "BDSM",
    "Contemporary Romance",
    "Erotica",
    "Contemporary",
    "Suspense"
  ],
  "author": "Ann Mayburn",
  "average_rating": "4.10",
  "url": "https://www.goodreads.com/book/show/31928212-exquisite-innocence"
}