{
  "title": "Le Plongeur",
  "description": "Nous sommes à Montréal au début de l’hiver 2002. Le narrateur n’a pas vingt ans. Il aime Clive Barker et Lovecraft, le métal, les comic books et les romans de science-fiction des années soixante et soixante-dix que lui prête son père. Étudiant en graphisme, il dessine depuis toujours et veut devenir bédéiste et illustrateur, comme ses idoles Moebius et Tibor Csernus. Mais depuis des mois, il évite ses amis, ment, s’endette, aspiré dans une spirale qui menace d’engouffrer sa vie entière : c’est un joueur. Il joue aux loteries vidéo et tout son argent y passe, de même que celui qu’il emprunte à sa copine Marie-Lou et à son cousin Malik. L’hiver installé, il se retrouve à bout de ressources, sans appartement.Il devient plongeur au restaurant La Trattoria, projeté dans un rush dès le premier soir. Le cuisinier qui l’accueille et lui donne son training accéléré, c’est Bébert, ogre infatigable au bagou de rappeur, encore jeune à vingt-cinq ans mais qui a travaillé partout, déjà usé par l’alcool et le speed. Pendant un mois et demi, ils enchaîneront ensemble les shifts de soir et les doubles, et Bébert tiendra auprès du plongeur le rôle de mentor malgré lui et de flamboyant Virgile de la nuit. On découvre ainsi le train survolté d’un restaurant à l’approche des fêtes et sa galerie mouvante de personnages, propriétaire, chef, sous-chefs, cuisiniers, maîtres d’hôtel, serveuses, busboys et suiteurs.Si certains d’entre eux semblent plus grands que nature, tous sont dépeints au plus près des us du métier, avec une rare justesse. C’est en leur bruyante compagnie que, débordé de toutes parts, le plongeur tente de juguler son obsession pour les machines de vidéopoker, traversant les cercles d’une saison chaotique rythmée par les rush, les luttes de pouvoir et les décisions néfastes. Œuvre de nuit qui brille des ors illusoires du jeu, Le plongeur raconte un monde où chacun dépend des autres pour le meilleur et pour le pire. Roman d’apprentissage et roman noir, poème sur l’addiction et chronique saisissante d’une cuisine vue de l’intérieur, Le plongeur est un magnifique coup d’envoi, à l’hyperréalisme documentaire, aussi héritier du Joueur de Dostoïevski, de L’homme au bras d’or de Nelson Algren et du premier récit d’Orwell, celui d’un plongeur dans le Paris des années vingt.",
  "genres": [
    "Fiction",
    "France",
    "Canada",
    "Roman",
    "Contemporary",
    "Novels",
    "Book Club"
  ],
  "author": "Stéphane Larue",
  "average_rating": "4.18",
  "url": "https://www.goodreads.com/book/show/31931045-le-plongeur"
}