{
  "title": "Waylon: Tales of My Outlaw Dad",
  "description": "From the Foreword by Ken Mansfield\"There are many stories about Waylon . . . the family man, the creative genius man, the quiet man, the king-of-the-six-day-roar-man, the uncommon man, the legendary man, the bad-ass man . . . they are all in this book.\"In a signed copy of his autobiography, Texas-born country \"Outlaw\" icon Waylon Jennings penned a personal note to his son Terry: \"I did my best. Now it's your turn.\" Two decades later, Terry Jennings finally completes the true story of his father's remarkable, unvarnished life with Waylon: Tales of My Outlaw Dad. Born when Waylon was only nineteen, Terry came of age just as Waylon's career hit the stratosphere with hits like \"I've Always Been Crazy\" and \"Good Hearted Woman,\" one of his famous Willie Nelson duets. Terry dropped out of high school and joined his dad on tour, and the two became more like brothers than father and son. On the road, they toured with legends like Nelson, Johnny Cash, Kris Kristofferson, and Jessi Colter, Waylon's fourth and final wife. Together father and son led a hard-partying lifestyle centered around music, women, and drugs. Waylon's success--critical acclaim, bestselling albums, sold-out tours, and even TV stardom on The Dukes of Hazzard--was at times eclipsed by his demons, three divorces, crippling debt, and a depression that Terry traces to the premature death of Buddy Holly. (Waylon was supposed to be on Holly and Ritchie Valens's doomed flight.) Through it all, Terry worked on the touring crew, helped manage Waylon's career, and became one of his father's closest confidantes. Debunking myths and sharing incredible never-before-told stories, this book is a son's loving and strikingly honest portrait of his father, \"the greatest Outlaw country musician to grace this earth\" and an unlikely but devoted family man. Waylon: Tales of My Outlaw Dad will resonate for generations of fans.",
  "genres": [
    "Music",
    "Biography",
    "Nonfiction",
    "Memoir",
    "History",
    "Autobiography"
  ],
  "author": "Terry Jennings",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/31934021-waylon"
}