{
  "title": "Jane Crow: The Life of Pauli Murray",
  "description": "Throughout her prodigious life, activist and lawyer Pauli Murray systematically fought against all arbitrary distinctions in society, channeling the discrimination she faced to make America a more democratic country. In this definitive biography, Rosalind Rosenberg offers a poignant portrait of a figure who played pivotal roles in both the modern civil rights and women's movements. A mixed-race orphan, Murray grew up in segregated North Carolina, before escaping to New York, where she attended Hunter College and became a labor activist in the 1930s. When she applied to graduate school at the University of North Carolina, where her white great-great-grandfather had been a trustee, she was rejected on account of her race. Deciding to become a lawyer, she graduated first in her class at Howard Law School, only to be rejected for graduate study at Harvard University on account of her sex. Undaunted, Murray forged a singular career in the law. In the 1950s, her legal scholarship helped Thurgood Marshall challenge segregation frontally in the landmark Brown v. Board of Education case. When appointed by Eleanor Roosevelt to the President's Commission on the Status of Women in 1962, she advanced the idea of Jane Crow, arguing that the same reasons used to condemn race discrimination could be used to battle gender discrimination. In 1965, she became the first African American to earn a JSD from Yale Law School and the following year persuaded Betty Friedan to found an NAACP for women, which became NOW. In the early 1970s, Murray provided Ruth Bader Ginsburg with the argument Ginsburg used to persuade the Supreme Court that the Fourteenth Amendment to the Constitution protects not only blacks but also women--and potentially other minority groups--from discrimination. By that time, Murray was a tenured history professor at Brandeis, a position she left to become the first woman ordained a priest by the Episcopal Church in 1976.Murray accomplished all this while struggling with issues of identity. She believed from childhood she was male and tried unsuccessfully to persuade doctors to give her testosterone. While she would today be identified as transgender, during her lifetime no social movement existed to support this identity. She ultimately used her private feelings of being \"in-between\" to publicly contend that identities are not fixed, an idea that has powered campaigns for equal rights in the United States for the past half-century.",
  "genres": [
    "History",
    "Nonfiction",
    "Biography",
    "Feminism",
    "LGBT",
    "Race",
    "Politics"
  ],
  "author": "Rosalind Rosenberg",
  "average_rating": "4.24",
  "url": "https://www.goodreads.com/book/show/31927918-jane-crow"
}