{
  "title": "Autopsy of an Engine: and Other Stories from the Cadillac Plant",
  "description": "“ Autopsy of an Engine is the most surprising love story I’ve read all year. The workers in the Cadillac factory who populate this book may not be related, but in the hands of the amazing Lolita Hernandez they become one moving multicultural family. Writing with tenderness and humor she gives voice to the piston crew and the timing chain women, the foremen and the chassis line. Some of these stories just break your heart. I stayed up all night reading and for weeks afterward Abbie, who brought a ghost factory back to life, haunted my dreams. This is a passionate cry from the factory floor, a story you can’t forget from a voice that has not been heard before.”—Ruth Reichl Full of magic and soul, these 12 stories bring to life the spirits that populated Detroit’s Clark Street Cadillac factory until its last smokestack was airlifted out in 1994. Each story is a tribute to the grit, passion and bravado that transformed Detroit into the Motor City and the Cadillac into America’s premier luxury car. They are also a heartbreaking testament to the decline of the auto industry and the loss of jobs that turned Motown inside out, creating a haunted landscape of abandoned factories and decaying boulevards. Told from the diverse perspective of unionized assembly line workers and management, janitors and engineers, payroll clerks and retirees, these stories capture the raw and vibrant hum of humanity that found its way into every piston, spark plug and belt, even as the last Fleetwood rolled off the line, its engine purring into the Detroit night. They are about family, friendship, resilience, loyalty, and letting go, but mostly they are about the dreams and magic created in the strangest city of all—Detroit’s last Cadillac factory. In Hernandez’s stories, you will meet America—full of love, loss, pride, sweat, dreams, music, comfort food and engine oil—and, in them, you will recognize yourself. Lolita Hernandez ’s writing is greatly influenced by the rhythms and language of her Trinidad and St. Vincent ancestors, and is tempered by over 30 years as a UAW worker, 21 of them at the Cadillac Plant in Detroit. Her poetry has been widely anthologized and stories from this collection have appeared",
  "genres": [
    "Fiction",
    "Short Stories"
  ],
  "author": "Lolita Hernandez",
  "average_rating": "3.78",
  "url": "https://www.goodreads.com/book/show/319320.Autopsy_of_an_Engine"
}