{
  "title": "The Genius of Muhammad",
  "description": "Although the biography of Prophet Muhammad, Peace Be Upon Him (PBUH), has been the subject of many studies, books, references, and commentaries, the book written in Arabic by the Author, Abbas Mahmoud Al-Akkad, remains unique in the way it has addressed the personality of the Prophet (PBUH), producing such an elegant thesis. This book is not a mere citation of the acts and traditions of Prophet Muhammad (PBUH); rather, Al-Akkad opted to dive deeply into the traits and attributes underlying the Prophet’s legacy as a manifestation of his genius, still as a human being. According to Al-Akkad, Prophet Muhammad (PBUH) had naturally practiced all facets of genius and greatness, because he was gifted by the talents that had made him the best preacher, politician, manager, warier, friend, and father. The Author illustrated how the Prophet (PBUH) had such lively heart, soul, and conscience that enabled him to register the irrefutable genius in every creation around him, subtle or obvious, from the air lifting of a single grain of sand to the ever-glowing sun and moon. It was such lively elements instilled in the Prophet that prepared him for the divine call and enabled him to endure the struggle associated with receiving the ‘heavy’ message and delivering it successfully to all mankind. And in the way the Prophet reflected upon the genius of all creations around us is a strong message to every human being to search, ponder, and listen to the wonders of Allah’s creation. The Author succeeded in presenting Prophet Muhammad (PBUH) as a human being whose human nature made him appreciative of people’s weaknesses, needs, and aspirations, while catering for these astonishingly during his delivery of the message of Islam. Al-Akkad proved how the Prophet (PBUH) persisted and persevered in his call to make it a success despite all the odds, barriers, and challenges; a message to be emulated by every individual who has goals to pursue and achieve in this life and in the hereafter. The Author also showed that during only 23 years, the duration of Prophet Muhammad’s mission, the world has changed forever; thanks to this one single man. Yet this change would have never been possible without the special qualities that were inculcated in the Prophet. It is these qualities that every person should strive to acquire and act upon, notwithstanding the divine preparation that qualified Prophet Muhammad for the most serious mission in history. In the course of guidance and aspiration to mankind, the way the Author presented the genius traits of the Prophet (PBUH) inspires individuals to strive for nobility and justice, societies to aim for reforms and prosperity, and nations to establish and maintain order and peace. Finally, the book shows how the Prophet (PBUH) spent all his life expending his skills, talents, and genius for the benefit of mankind, entertaining none of life’s glamour; a fact that characterized all prophets before him. But in return, people will always celebrate his contribution to mankind until the end of time. Mostafa Ismail Perth 2016",
  "genres": [
    "Religion",
    "Biography",
    "History",
    "Nonfiction",
    "Audiobook",
    "Spirituality",
    "Islam"
  ],
  "author": "عباس محمود العقاد",
  "average_rating": "4.13",
  "url": "https://www.goodreads.com/book/show/31941758-the-genius-of-muhammad"
}