{
  "title": "Learning to Drive into the Now:PRND",
  "description": "If you have ever desired to become a more attentive, compassionate, and liberated human being...NOW is the time.​In the pages of this book you will learn to overcome your egoic mind patterns, and discover the path to finding your True Self. You will develop a practice of mindful driving in the current moment with dynamic awareness, and reveal the Truth of your Higher Self. By applying the techniques and practices illustrated by Solan McClean in \"Learning to Drive into the Now:PRND\", you will not only learn to drive with more attention, serenity, and compassion, but you will learn how to use your experiences to transform your life outside of your car.​\"Learning to Drive into the Now: PRND\" is a great program for those who are new to self discovery, meditation, and practicing mindful awareness. If you've ever tried sitting meditation and couldn't put together a meaningful practice because you didn't have the time, were bored, or didn't feel you were getting results...this is the practice for you! If you already have a meditation practice, you will find \"Learning to Drive\" a great addition to your learning library.Solan McClean has developed the practice of present moment awareness through the experience of driving to help others with the anxiety of everyday life and especially the negative experiences that some of us encounter on the road. By discovering the Truth through present moment awareness, Solan seeks to help the evolution of mankind, and help others to become intelligent agents of the ever advancing creation.​By introducing practitioners to the Truth about themselves through their driving practice, using the PRND (Practice, Relax, Now, Drive) method, he believes that both our roads and our world can know truth, compassion, and serenity.",
  "genres": [],
  "author": "Solan Mcclean",
  "average_rating": "3.90",
  "url": "https://www.goodreads.com/book/show/31942882-learning-to-drive-into-the-now"
}