{
  "title": "ME: A Novel",
  "description": "\"In Hoshino's dystopia, identities are fluid and any one is as good as another. . .Hoshino's ambitious novel is pleasingly uncomfortable.\"-- Publishers Weekly \"Hoshino's latest-in-translation (rendered by De Wolf) begins as black comedy and devolves into an antisolipsistic treatise on the impossibility of individual identity.\"--Booklist Online \"Part existential fable, part 'Night of the Living Dead,' Mr. Hoshino's inventive novel, accessibly translated by Charles De Wolf, paints a nightmare vision of Japan's rootless millennials, who work grinding dead-end jobs that leave them little time for family or individual passions...At first Hitoshi and his fellow MEs are happy to band together against an uncaring world. But the camaraderie doesn't last, since every time one reveals a character flaw the others take it as an indictment of themselves. As the MEs' failures and weaknesses become intolerably magnified onto the 'living but useless rabble' they're gripped by a suicidal impulse that unleashes a crazed murder spree. The frenetic, knife-wielding finale reaches its climax in--a McDonald's, of course. None of them can think of any place else to eat.\"-- Wall Street Journal , included in Best New Fiction column \"A Kafkaesque journey of a lonely narrator being absorbed by an impersonal system.\"-- Los Angeles Review of Books \"The imaginative story of a rather unimaginative camera salesman, ME features Hitoshi Nagano; his troubles begin with his impulsive theft of a cell phone from another customer at a McDonalds. They end with a post-apocalyptic future for everyone in Japan.\"-- New York Journal of Books \"[Some passages] surpass even Kobo Abe. . .The author has leaped to a higher level.\"-- Kenzaburo Oe , Nobel Prize-winning author of The Silent Cry , from the afterword With an afterword by Kenzaburō Ōe. Translated from Japanese by Charles De Wolf. This novel centers on the \"It's me\" telephone scam--often targeting the elderly--that has escalated in Japan in recent years. Typically, the caller identifies himself only by saying, \"Hey, it's me,\" and goes on to claim in great distress that he's been in an accident or lost some money with which he was entrusted at work, etc., and needs funds wired to his account right away. ME 's narrator is a nondescript young Tokyoite named Hitoshi Nagano who, on a whim, takes home a cell phone that a young man named Daiki Hiyama accidentally put on Hitoshi's tray at McDonald's. Hitoshi uses the phone to call Daiki's mother, pretending he is Daiki, and convinces her to wire him 900,000 yen. Three days later, Hitoshi returns home from work to discover Daiki's mother there in his apartment, and she seems to truly believe Hitoshi is her son. Even more bizarre, Hitoshi discovers his own parents now treat him as a stranger; they, too, have a \"me\" living with them as Hitoshi. At a loss for what else to do, Hitoshi begins living as Daiki, and no one seems to bat an eye. In a brilliant probing of identity, and employing a highly original style that subverts standard narrative forms, Tomoyuki Hoshino elevates what might have been a commonplace crime story to an occasion for philosophical reflection. In the process, he offers profound insights into the state of contemporary Japanese society. Charles De Wolf, PhD, professor emeritus, Keio University, is a linguist by training, though his first love was literature. Multilingual, he has spent most of his life in East Asia and is a citizen of Japan. His translations include Mandarins , a selection of short stories by Ryunosuke Akutagawa (Archipelago Books) and collections of folktales from Konjaku Monogatari-shu . He has written extensively about The Tale of Genji ; and is currently working on his own translation of the work.",
  "genres": [
    "Fiction",
    "Japan",
    "Japanese Literature",
    "Literary Fiction",
    "Science Fiction",
    "Asian Literature",
    "Dystopia"
  ],
  "author": "Tomoyuki Hoshino",
  "average_rating": "3.08",
  "url": "https://www.goodreads.com/book/show/31945034-me"
}