{
  "title": "Oakland Noir",
  "description": "\"Wonderfully, in Akashic's Oakland Noir , the stereotypes about the city suffer the fate of your average noir character―they die brutally. Kudos to the editors, Jerry Thompson and Eddie Muller, for getting Oakland right. All those outsize statistics don’t reveal a real city, but this collection of local voices―both established and new―brings it thrumming to life. . .Readers who know the city will relish its sense of place, and those who only know the stereotypes will be in for a pleasing eye-opener.”― San Francisco Chronicle “From the Oakland hills to the heart of downtown, each story brings Oakland to life.\"― The Mercury News “Oakland is a natural for the series, with its shadowy crimes and disgruntled cops.”-- Zoom Street Magazine \"San Francisco's grittier next-door neighbor gets her day in the sun in 16 new stories in this tightly curated entry in Akashic's Noir series. The hardscrabble streets of Oakland offer crime aplenty. . .Thompson and Muller have taken such pains to choose stories highlighting Oakland's diversity and history that the result is a volume rich in local culture as well as crime.\"― Kirkus Reviews \"The legendarily tough California city of Oakland finally gets an entry in the Akashic noir series.\"― Publishers Weekly Brand-new stories Nick Petrulakis, Kim Addonizio, Keenan Norris, Keri Miki-Lani Schroeder, Katie Gilmartin, Dorothy Lazard, Harry Louis Williams II, Carolyn Alexander, Phil Canalin, Judy Juanita, Jamie DeWolf, Nayomi Munaweera, Mahmud Rahman, Tom McElravey, Joe Loya, and Eddie Muller. In the wake of San Francisco Noir, Los Angeles Noir, and Orange County Noir ―all popular volumes in the Akashic Noir Series―comes the latest California installment, Oakland Noir. Masterfully curated by Jerry Thompson and Eddie Muller (the \"Czar of Noir\"), this volume will shock, titillate, provoke, and entertain. The diverse cast of talented contributors will not disappoint. From the Jerry Discovering the wang-dang-doodle jams of the Pointer Sisters shifted my entire focus. Stunning black women were scatting and bebopping all the way into my soul. I think what we've put together in Oakland Noir is a volume where this city is a character in every story. He's a slick brother strutting over a bacon-grease bass line and tambourine duet. She's a white chick with a bucket of hot muffins heading to farmer and flea markets, to sell crafts and get hooked up with some fine kat with dreadlocks and a criminal record. And it's in the faces of young fearless muthafuckers pounding keyboards and snapping fingers, lips, Snapchats, and Facebook timelines. It's the core of not only Black Lives Matter but all lives matter. We are the children of fantasy and of the funk. . . Eddie These days, writers and readers aren't denying the darker parts of our existence as much as they used to, especially in crime fiction. Some writers just do it for fun, because it's become the fashionable way to get published. You know, \"gritty violence\" and all that bullshit. The genuine darkness in noir stories comes from two places―the cruelty of the world's innate indifference, and the cruelty that people foster within themselves. If you're not seriously dealing with one, the other, or both, then you're not really writing noir.",
  "genres": [
    "Short Stories",
    "Mystery",
    "Fiction",
    "Noir",
    "Anthologies",
    "Thriller",
    "Crime"
  ],
  "author": "Jerry Thompson",
  "average_rating": "3.76",
  "url": "https://www.goodreads.com/book/show/31944809-oakland-noir"
}