{
  "title": "Indecent",
  "description": "“Revelatory…As intimate and immediate as a whispered secret. Vogel’s play thrums with music, desire, and fear, and it’s shrewd about the ways in which America isn’t free, and about how art does and doesn’t transcend the perilous winds of history.” — New Yorker “Superbly realized… Indecent , the powerful play by Paula Vogel, sheds an eye-opening light on a little-known time when theatrical history, Jewish culture, and the frank depiction of homosexuality intersected, with explosive results.” — New York Times “Gorgeous. Illuminating and heartbreaking. Rich in sympathy and humor, Indecent has the scope of an epic but the intimacy of a chamber piece…It celebrates and illustrates the power of theater.” — Time Out New York “A moving and fascinating play…A singular achievement… The historical perspective is vast and knowing…Has there ever been anything quite like Indecent , a play that touches—I mean deeply touches—so much rich emotion about history and the theater, anti-Semitism, homophobia, censorship, world wars, red-baiting, and oh, yes, joyful human passion?...An extraordinary play.” — Newsday “ Indecent is more than a play about forbidden It’s about theater as a life force.” — New York Post When Sholem Asch wrote God of Vengeance in 1907, he didn’t imagine the height of controversy the play would eventually reach. Performing at first in Yiddish and German, the play’s subject matter wasn’t deemed contentious until it was produced in English, when the American audiences were scandalized by the onstage depiction of an amorous affair between two women. Paula Vogel’s newest work traces the trajectory of the show’s success through its tour in Europe to its abrupt and explosive demise on Broadway in 1923—including the arrest of the entire production’s cast and crew. Paula Vogel is the Pulitzer Prize–winning author of How I Learned to Drive . Her other plays include Don Juan Comes Home from Iraq, A Civil War Christmas, The Long Christmas Ride Home , and The Baltimore Waltz , among others. She has also had a distinguished career as a teacher and mentor to younger playwrights, first at Brown University and then at the Yale School of Drama.",
  "genres": [
    "Plays",
    "Theatre",
    "Drama",
    "LGBT",
    "Queer",
    "Historical Fiction",
    "Read For School"
  ],
  "author": "Paula Vogel",
  "average_rating": "4.45",
  "url": "https://www.goodreads.com/book/show/31945149-indecent"
}