{
  "title": "Beginnings",
  "description": "EPISODE 1SERIES PRAISE: \"A thoughtful look at empowerment for women.\" \"A rollicking trip into a fantasy world complete with dragons, love and strength, and ideas that really get you thinking.\" \"Highly recommended for all ages.\" SERIES AWARDS: - Reader's Favorite - Gold Medal Winner -Young Adult - Fantasy - Epic - CIPA EVVY Book Awards - 2nd Place - Fiction - MythologySERIES DESCRIPTION:Morgan is a dreamer, change maker and art lover. She is a feisty, slightly preachy, romantic feminist full of contradictions and insecurities. Morgan uncovers a world where women have the power, and where magic is no longer just a figment of her wild imagination. Sounds like a dream, but it may, in fact, turn into a nightmare. The world of the Ahe'ey challenges and subverts her views about gender, genes, and nature versus nurture.The strong and uninvited chemistry between her and the dashing Gabriel makes matters even more complicated. His stunning looks keep short-circuiting her rational mind. QUOTES - EPISODE 1:\"She believed in magic—the magic of places, the magic of people, the magic of coincidences, serendipity, and fortune. She enjoyed wandering through the world with the open mind and curiosity of a four-year-old child. In her world the mystical, mythical, and magical inhabited the same space and time as the ordinary and the practical. At Bethesda Terrace, she always felt close to a source of magic and creativity. It was as if she were tapping into the place where dragons, angels, gods, sorceresses, and demons came to life.\"\"the pursuit and preservation of purity can drive prejudice and hate. Many crimes against humanity have been committed in its name. Purity is best applied to water.”“Like the bronze statue of the Angel of the Waters, those who pursue perfection find themselves paralysed by the possibility of flaw, fault or failure.”\"She killed him instantly. The young woman plunged her hand into his wound and licked the blood. Once again, she dipped her hand into the blood and used four fingers to paint stripes on her face. Sky’s defiant eyes locked on Iblis.\"\"Away from the Sacred House, from his family, and from the comforts and privileges of the royal apparatus, the boy relied only on himself and on the few Ange’el that watched over them. The densest and most remote valley of the Ahe’ey forest was now their home—a haven from the devastating war that ravaged the land.\"EDITORIAL REVIEWS - COMPLETE SERIES\"In this romantic tale, a champion of women's empowerment stumbles on a hidden--and seemingly perfect--society. A bracing mix of emotionally and intellectually honest fantasy.\" - Kirkus Reviews\"A compelling and creative work of paranormal romance. Le Fey takes her characters to places seldomly seen in fantasy fiction that readers will find empowering and prescient. Ahe'ey is a fairly polarizing book. As an example of feminist fantasy fiction, you won’t find much better than this. Ahe’ey is an impressively thought-out story, with many original touches and a fairy-like romance that will deeply satisfy readers of the genre.\" Self-Publishing Review, ★★★★ \"This book is a thoughtful look at empowerment for women. At the same time, it's a rollicking trip into a fantasy world complete with dragons, love and strength, and ideas that really get you thinking. This book is highly recommended for all ages.\" - HUGEOrange\"They're flawed, real, and honest characters that can be easily related to. Ahe'ey is the kind of novel society needs to read, to create inspiration and to make people think. Ahe'ey is daring, complex, and honest. A must-read novel that tackles heavy and real topics with a mix of serious and humorous, charm and tragedy.\" - Reader's Favorite - ★★★★★ \"Ahe'ey contains a richly imagined world that raises complicated and timely questions about our own. Jamie Le Fay's Ahe'ey is an action-packed love story that puts forth a nuanced vision of gender stereotypes, body politics, and the dark side of seeking perfection.\" - Foreword Clarion - ★★★★OTHER PRAISE\"Jamie is a fine writer with a rich imagination and is able to convey her strong feelings about women’s rights, feminism, gender equality and other important matters of injustice, primarily because she keeps us involved with the characters of her strong story.” - Grady Harp, Amazon Hall of Fame Top 100 Reviewer, Vine Voice - ★★★★★ \"As a liberal and committed feminist who is increasingly frustrated by the simplistic self-righteousness of my own side, and the belief that all that is needed is for a few smart people to start a revolution, I found \"Ahe'ey\" to be refreshingly multi-sided, while also maintaining its core beliefs.” - E.P. Clark, Author - ★★★★",
  "genres": [
    "Fantasy",
    "Amazon",
    "Feminism",
    "Fiction"
  ],
  "author": "Jamie Le Fay",
  "average_rating": "3.50",
  "url": "https://www.goodreads.com/book/show/31943050-beginnings"
}