{
  "title": "Henry David Thoreau: A Life",
  "description": "“Walden. Yesterday I came here to live.” That entry from the journal of Henry David Thoreau, and the intellectual journey it began, would by themselves be enough to place Thoreau in the American pantheon. His attempt to “live deliberately” in a small woods at the edge of his hometown of Concord has been a touchstone for individualists and seekers since the publication of Walden in 1854. But there was much more to Thoreau than his brief experiment in living at Walden Pond. A member of the vibrant intellectual circle centered on his neighbor Ralph Waldo Emerson, he was also an ardent naturalist, a manual laborer and inventor, a radical political activist, and more. Many books have taken up various aspects of Thoreau’s character and achievements, but, as Laura Dassow Walls writes, “Thoreau has never been captured between covers; he was too quixotic, mischievous, many-sided.” Two hundred years after his birth, and two generations after the last full-scale biography, Walls restores Henry David Thoreau to us in all his profound, inspiring complexity. Walls traces the full arc of Thoreau’s life, from his early days in the intellectual hothouse of Concord, when the American experiment still felt fresh and precarious, and “America was a family affair, earned by one generation and about to pass to the next.” By the time he died in 1862, at only forty-four years of age, Thoreau had witnessed the transformation of his world from a community of farmers and artisans into a bustling, interconnected commercial nation. What did that portend for the contemplative individual and abundant, wild nature that Thoreau celebrated? Drawing on Thoreau’s copious writings, published and unpublished, Walls presents a Thoreau vigorously alive in all his quirks and the young man shattered by the sudden death of his brother; the ambitious Harvard College student; the ecstatic visionary who closed Walden with an account of the regenerative power of the Cosmos. We meet the man whose belief in human freedom and the value of labor made him an uncompromising abolitionist; the solitary walker who found society in nature, but also found his own nature in the society of which he was a deeply interwoven part. And, running through it all, Thoreau the passionate naturalist, who, long before the age of environmentalism, saw tragedy for future generations in the human heedlessness around him. “The Thoreau I sought was not in any book, so I wrote this one,” says Walls. The result is a Thoreau unlike any seen since he walked the streets of Concord, a Thoreau for our time and all time.",
  "genres": [
    "Biography",
    "Nonfiction",
    "History",
    "Philosophy",
    "Biography Memoir",
    "Nature",
    "American History"
  ],
  "author": "Laura Dassow Walls",
  "average_rating": "4.48",
  "url": "https://www.goodreads.com/book/show/31939387-henry-david-thoreau"
}