{
  "title": "How it Works: The Cat",
  "description": "THE PERFECT GIFT for those who value elegance, affection, cold hearted killing and expensive, clawed to death furniture. __________________________________'A pet can be great fun.Cats are warm and fluffy, like cuddly toys, and their owners give them lots of time and affection. And, just like cuddly toys, they do very little in return.'__________________________________'Over thousands of years, we have developed a special relationship with the animals that share our homes.Dogs have evolved to serve many sorts of human needs.And humans have evolved to serve many sorts of cat food.'__________________________________This delightful book is the latest in the series of Ladybird books which have been specially planned to help grown-ups with the world about them. The large clear script, the careful choice of words, the frequent repetition and the thoughtful matching of text with pictures all enable grown-ups to think they have taught themselves to cope. Featuring original Ladybird artwork alongside brilliantly funny, brand new text. 'Hilarious' StylistOther new titles for Autumn 2017:How it The BrotherHow it The SisterThe Ladybird Book of the ExThe Ladybird Book of the NerdThe Ladybird Book of the New YouThe Ladybird Book of BallsThe Ladybird Book of the Big Night OutThe Ladybird Book of the Quiet Night InPeople at The Rock Star Previous titles in the Ladybirds for Grown Ups How it The HusbandHow it The WifeHow it The MumHow it The DadThe Ladybird Book of the Mid-Life CrisisThe Ladybird Book of the HangoverThe Ladybird Book of MindfulnessThe Ladybird Book of the ShedThe Ladybird Book of DatingThe Ladybird Book of the HipsterHow it The StudentHow it The CatHow it The DogHow it The Grandparent The Ladybird Book of Red TapeThe Ladybird Book of the People Next DoorThe Ladybird Book of the SickieThe Ladybird Book of the Zombie ApocalypseThe Ladybird Book of the Do-Gooder",
  "genres": [
    "Nonfiction",
    "Humor",
    "Cats",
    "Animals",
    "Comedy",
    "Picture Books",
    "21st Century"
  ],
  "author": "Jason A. Hazeley",
  "average_rating": "3.85",
  "url": "https://www.goodreads.com/book/show/31940171-how-it-works"
}