{
  "title": "This Is the Noise That Keeps Me Awake",
  "description": "\"This title is an honest and in-depth account of the story of an uncompromising, experimental, never boring band...Through a first-person narrative, an abundance of photos, and solid data (including an extensive discography and list of tour dates) these musicians have produced the template for rock (auto) biography. This is unmitigated Garbage. Refuse to settle for anything less.\"--Library Journal (starred review) \"In the book, [Shirley] Manson is seen with a bob cut and smudged black eyeliner, power posing for magazines and shredding guitar solos onstage. You'll also find candid interviews, cocktail recipes (one reads 'fill your glass with garbage'), and hundreds of archival photos from the road.\"--The Cut/New York Magazine \"Look at the band's just released funny, engaging and defiant coffee table book, This Is The Noise That Keeps Me Awake. Written with journalist Jason Cohen, the tableau tells the story of the band's rise to success to the tune of more than 17 million albums sold and the ups and downs that came with that, mixed in with the group's custom cocktail recipes, sidebars on the worst foodborne illnesses they have had, Manson's love for the San Antonio Spurs and the rest of the band's affinity for the Green Bay Packers and celebrity encounters like Bono and Bill Clinton.\"--Forbes \"Garbage will release a coffee-table book full of artifacts, photos, and anecdotes that capture their long pages of lyrics with penciled-in edits, cocktail recipes--like one for 'Vodka With Anything'--and snapshots from a forgotten era where Manson wore her hair boy-short and platinum blonde.\"--The Cut/New York Magazine, from a feature on Shirley Manson \"With input from all four of the band's members, the book looks at Garbage's musical process and how they’ve coexisted as a band for over two decades.\"--Dazed \"This Is the Noise That Keeps Me Awake is ultimately a tale of survival. The band fought constantly against record companies, illnesses, trends, and a million other headaches to become an international success...Against the odds, Garbage has remained one of the only survivors of the post-grunge era, one that continues to push their own boundaries and explore what they're capable of.\"--Noisey/VICE \"All I know is, if you call yourself Garbage, you’re going to start hanging out with garbage, and the next thing you know, you will be garbage.\"Carrie Elizabeth Erickson (1920-2012) to her son Douglas \"Duke\" Erikson, 1995 Garbage are known around the world for songs that mix pop sweetness with the dour thunder of industrial music and the rhythmic punch of hip-hop. Now, for the first time, the four band members tell the story of that music in their own words. Packed with rare photos and personal snapshots, this book examines how Garbage make their music, and how they've kept it together (or not) for more than twenty years. The beautifully designed, large-format coffee-table book is bound with an embossed cloth hardcover and finished with a dust jacket. The edges of the text pages, printed on luxurious matte art paper in six colors, are finished with a stunning pink spot color. This Is the Noise That Keeps Me Awake is a must-have (and perfect gift) for Garbage's fans. Excerpt (In the words of Butch Vig, drummer): \"It was 1995, we were finishing our debut album, and I was stressed. A lot of music business people had told me it was a mistake to give up full-time music production to start a band. So I ignored them all and took a leap of faith. The simplest reason was that I just wanted to be in a band with my friends. I'd been playing with Duke and Steve for several years, and now we had a new beginning with an X a Scottish singer named Shirley. She seemed like a good fit for our little club of misfits. So we all took that leap.\"",
  "genres": [
    "Music",
    "Nonfiction",
    "Biography"
  ],
  "author": "Garbage",
  "average_rating": "4.63",
  "url": "https://www.goodreads.com/book/show/31945042-this-is-the-noise-that-keeps-me-awake"
}