{
  "title": "What to Say Next",
  "description": "Sometimes a new perspective is all that is needed to make sense of the world. From New York Times bestselling author Julie Buxbaum comes a charming and poignant story about two struggling teenagers who find an unexpected connection just when they need it most. For fans of Sophie Kinsella, Jennifer Niven, and Rainbow Rowell. Kit: I don’t know why I decide not to sit with Annie and Violet at lunch. I can feel their eyes on me as I pass right by our usual table, which is in the perfect spot because you can see everyone from there. But the truth is I no longer want to be in the center of things. Suddenly it feels like no one here gets what I’m going through. How could they? I don’t even understand it. David: In the 622 days I’ve attended Mapleview High, Kit Lowell is the first person to sit at my lunch table. I always sit alone, and when I say always, I don’t mean that in the exaggerative vernacular favored by my classmates. I mean I’ve never once sat with someone until now. “So your dad is dead,” I say to Kit, because this is a fact I’ve recently learned about her.  When an unlikely friendship is sparked between relatively popular Kit Lowell and socially isolated David Drucker, everyone is surprised, most of all Kit and David. Kit appreciates David’s blunt honesty—in fact, she finds it bizarrely refreshing at a time when everyone else is tiptoeing around her. David welcomes Kit’s attention and her inquisitive nature. When she asks for his help figuring out the how and why of her dad’s tragic car accident, David is all in. But neither of them can predict what they’ll find. Will it be a welcome relief for Kit? Or a devastating shock? And can their friendship survive the truth?From the Hardcover edition.",
  "genres": [
    "Young Adult",
    "Romance",
    "Contemporary",
    "Fiction",
    "Realistic Fiction",
    "Audiobook",
    "Young Adult Contemporary"
  ],
  "author": "Julie Buxbaum",
  "average_rating": "3.95",
  "url": "https://www.goodreads.com/book/show/31941431-what-to-say-next"
}