{
  "title": "Philosophy and the Mirror of Nature",
  "description": "\"Philosophy and the Mirror of Nature\" hit the philosophical world like a bombshell. Richard Rorty, a Princeton professor who had contributed to the analytic tradition in philosophy, was now attempting to shrug off all the central problems with which it had long been preoccupied. After publication, the Press was barely able to keep up with demand, and the book has since gone on to become one of its all-time best-sellers in philosophy. Rorty argued that, beginning in the seventeenth century, philosophers developed an unhealthy obsession with the notion of representation. They compared the mind to a mirror that reflects reality. In their view, knowledge is concerned with the accuracy of these reflections, and the strategy employed to obtain this knowledge--that of inspecting, repairing, and polishing the mirror--belongs to philosophy. Rorty's book was a powerful critique of this imagery and the tradition of thought that it spawned. He argued that the questions about truth posed by Descartes, Kant, Hegel, and modern epistemologists and philosophers of language simply couldn't be answered and were, in any case, irrelevant to serious social and cultural inquiry. This stance provoked a barrage of criticism, but whatever the strengths of Rorty's specific claims, the book had a therapeutic effect on philosophy. It reenergized pragmatism as an intellectual force, steered philosophy back to its roots in the humanities, and helped to make alternatives to analytic philosophy a serious choice for young graduate students. Twenty-five years later, the book remains a must-read for anyone seriously concerned about the nature of philosophical inquiry and what philosophers can and cannot do to help us understand and improve the world.",
  "genres": [
    "Philosophy",
    "Nonfiction",
    "History",
    "Theory",
    "Politics",
    "Metaphysics",
    "Classics"
  ],
  "author": "Richard Rorty",
  "average_rating": "4.03",
  "url": "https://www.goodreads.com/book/show/31947.Philosophy_and_the_Mirror_of_Nature"
}