{
  "title": "Born a Crime: Stories from a South African Childhood",
  "description": "The compelling, inspiring, and comically sublime story of a young man’s coming-of-age, set during the twilight of apartheid and the tumultuous days of freedom that followed   Trevor Noah is one of the comedy world’s brightest new voices, a light-footed but sharp-minded observer of the absurdities of politics, race, and identity, sharing jokes and insights drawn from the wealth of experience acquired in his relatively young life. As host of The Daily Show with Trevor Noah, he provides viewers in America and around the globe with their nightly dose of biting satire, but here Noah turns his focus inward, giving readers a deeply personal, heartfelt, and humorous look at the world that shaped him.   Noah was born a crime, the son of a white Swiss father and a black Xhosa mother, at a time when such a union was punishable by five years in prison. Living proof of his parents’ indiscretion, Trevor was kept mostly indoors for the first years of his life, bound by the extreme and often absurd measures his mother took to hide him from a government that could, at any moment, take him away. Finally liberated by the end of South Africa’s white rule, Trevor and his mother set forth on a grand adventure, living openly and freely and embracing the opportunities won by a centuries-long struggle.   A collection of eighteen personal essays, Born a Crime tells the story of a mischievous young boy who grows into a restless young man as he struggles to find himself in a world where he was never supposed to exist. Born a Crime is equally the story of that young man’s fearless, rebellious, and fervently religious mother—a woman determined to save her son from the cycle of poverty, violence, and abuse that ultimately threatens her own life.   Whether subsisting on caterpillars for dinner during hard times, being thrown from a moving car during an attempted kidnapping, or just trying to survive the life-and-death pitfalls of dating in high school, Noah illuminates his curious world with an incisive wit and an unflinching honesty. His stories weave together to form a moving and searingly funny portrait of a lovable delinquent making his way through a damaged world in a dangerous time, armed with only a keen sense of humor and a mother’s unconventional, unconditional love.",
  "genres": [
    "Nonfiction",
    "Memoir",
    "Biography",
    "Audiobook",
    "Book Club",
    "Humor",
    "Autobiography"
  ],
  "author": "Trevor Noah",
  "average_rating": "4.49",
  "url": "https://www.goodreads.com/book/show/31948742-born-a-crime"
}