{
  "title": "Hitler's American Model: The United States and the Making of Nazi Race Law",
  "description": "How American race law provided a blueprint for Nazi GermanyNazism triumphed in Germany during the high era of Jim Crow laws in the United States. Did the American regime of racial oppression in any way inspire the Nazis? The unsettling answer is yes. In Hitler's American Model, James Whitman presents a detailed investigation of the American impact on the notorious Nuremberg Laws, the centerpiece anti-Jewish legislation of the Nazi regime. Contrary to those who have insisted that there was no meaningful connection between American and German racial repression, Whitman demonstrates that the Nazis took a real, sustained, significant, and revealing interest in American race policies.As Whitman shows, the Nuremberg Laws were crafted in an atmosphere of considerable attention to the precedents American race laws had to offer. German praise for American practices, already found in Hitler's Mein Kampf, was continuous throughout the early 1930s, and the most radical Nazi lawyers were eager advocates of the use of American models. But while Jim Crow segregation was one aspect of American law that appealed to Nazi radicals, it was not the most consequential one. Rather, both American citizenship and antimiscegenation laws proved directly relevant to the two principal Nuremberg Laws—the Citizenship Law and the Blood Law. Whitman looks at the ultimate, ugly irony that when Nazis rejected American practices, it was sometimes not because they found them too enlightened, but too harsh.Indelibly linking American race laws to the shaping of Nazi policies in Germany, Hitler's American Model upends understandings of America's influence on racist practices in the wider world.",
  "genres": [
    "History",
    "Nonfiction",
    "Politics",
    "Race",
    "Law",
    "American History",
    "Germany"
  ],
  "author": "James Q. Whitman",
  "average_rating": "3.92",
  "url": "https://www.goodreads.com/book/show/31951513-hitler-s-american-model"
}