{
  "title": "Asphodel",
  "description": "\"DESTROY,\" H.D. had pencilled across the title page of this autobiographical novel. Although the manuscript survived, it has remained unpublished since its completion in the 1920s. Regarded by many as one of the major poets of the modernist period, H.D. created in Asphodel a remarkable and readable experimental prose text, which in its manipulation of technique and voice can stand with the works of Joyce, Woolf, and Stein; in its frank exploration of lesbian desire, pregnancy and motherhood, artistic independence for women, and female experience during wartime, H.D.'s novel stands alone.A sequel to the author's HERmione, Asphodel takes the reader into the bohemian drawing rooms of pre-World War I London and Paris, a milieu populated by such thinly disguised versions of Ezra Pound, Richard Aldington, May Sinclair, Brigit Patmore, and Margaret Cravens; on the other side of what H.D. calls \"the chasm,\" the novel documents the war's devastating effect on the men and women who considered themselves guardians of beauty. Against this riven backdrop, Asphodel plays out the story of Hermione Gart, a young American newly arrived in Europe and testing for the first time the limits of her sexual and artistic identities. Following Hermione through the frustrations of a literary world dominated by men, the failures of an attempted lesbian relationship and a marriage riddled with infidelity, the birth of an illegitimate child, and, finally, happiness with a female companion, Asphodel describes with moving lyricism and striking candor the emergence of a young and gifted woman from her self-exile.Editor Robert Spoo's introduction carefully places Asphodel in the context of H.D.'s life and work. In an appendix featuring capsule biographies of the real figures behind the novel's fictional characters, Spoo provides keys to this roman à clef .",
  "genres": [
    "Fiction",
    "Poetry",
    "Literature",
    "Classics",
    "LGBT",
    "20th Century",
    "Queer"
  ],
  "author": "H.D.",
  "average_rating": "3.40",
  "url": "https://www.goodreads.com/book/show/320170.Asphodel"
}