{
  "title": "You Will Pay",
  "description": "In a fast-paced, brilliantly twisted novel of suspense from #1 New York Times bestselling author Lisa Jackson, the deadly secrets of a long-ago summer stir to life once more.It starts as a prank a way to blow off steam after a long summer at Camp Horseshoe. Among the teen counselors, tensions and hormones are running high. No wonder the others agree when Jo-Beth Chancellor suggests they scare Monica O Neal a little .or a lot. Monica has it coming, and no one will really get hurt. What could go wrong?Everything.Twenty years later, Lucas Dalton, a senior detective with the sheriff s department, is investigating the discovery of human remains in a cavern at what used to be Camp Horseshoe. Lucas knows the spot well. His father, a preacher, ran the camp, and Lucas worked there that infamous summer when two girls went missing. One is believed to have been killed by a convict on the loose. Monica O Neal is thought to have drowned and been washed out to sea.Lucas knows he should step down from such a personal case. He s already jeopardized his career by removing evidence of his involvement. But maybe it s time to uncover the whole truth at last. That s why five former female counselors are coming back to the small Oregon town among them, Bernadette Warden, the woman Lucas has never forgotten. Each one knows something about that terrible night. Each promised not to tell. And as they reunite, a new horror unfolds. First come notes containing a personal memento and a simple, terrifying message: You will pay. Then, the murders begin.It started years ago. But it will end here as a web of lust, greed, and betrayal is untangled to reveal a killer waiting to enact the perfect revenge.",
  "genres": [
    "Mystery",
    "Thriller",
    "Fiction",
    "Mystery Thriller",
    "Suspense",
    "Romantic Suspense",
    "Crime"
  ],
  "author": "Lisa  Jackson",
  "average_rating": "3.67",
  "url": "https://www.goodreads.com/book/show/32019356-you-will-pay"
}