{
  "title": "Ashes to New",
  "description": "Ashes to New is a story about the fiercest kind of love. It's about enduring. Surviving. And never giving up. Elsbeth and Forest are two teenagers trapped within an abusive foster home. They endure tragedy, but find there is light in the darkest places. With hope is as limitless as the summer sky, all they need is the love of one another to survive.  \"You're beautifully broken, and you were my summer sky, my light in the darkness.\"  This quote sends chills down my spine.  Elsbeth and Forrest are two seventeen year old foster children, who met at the age of twelve, when they were given into the care of an unfeeling, deranged monster who hides behind the mask of a well known, philanthropic lawyer.  Trained in total submission from the first day, these two children face horrific nightmares that becomes their new reality. Sexually abused, tortured and whipped, they cling to one another as their only constant in a roiling sea of agony and uncaring fate. It isn't just their foster father that abuses them; he has several \"friends\" that avail themselves of the children as well. Treated as less than a pet, they are subjected to the abuse over and over and over. However, they are expected to maintain a decorous attitude and appearance at their school, and to excel in their studies, so as to reflect well on their \"father\".  Through it all, Elsbeth clings to a single strand of golden hope; that at eighteen, both she and Forrest will no longer be in the foster care system, and will be able to escape their foster father and his \"friends\". Elsbeth hopes to someday become a doctor and help people; to heal. Forrest has an uncanny knack for computer coding, and has developed several programs on his own. Each tries to help the other, to keep hope alive and to strive to free themselves from this pit of degradation and abuse; that is, until \"Master John\" comes to visit....  ***This book is graphic with triggers; it's not for the faint of heart*** Intro to the Angel Fire Rock Romance Series",
  "genres": [
    "Dark",
    "Romance",
    "Contemporary",
    "High School",
    "Abuse"
  ],
  "author": "Ellie Masters",
  "average_rating": "4.50",
  "url": "https://www.goodreads.com/book/show/31980557-ashes-to-new"
}