{
  "title": "The Fated Sky: Astrology in History",
  "description": "In a horoscope he cast in 1647 for Charles I, Wm Lilly, a noted English astrologer, noted the following: 'Luna is with Antares, a violent fixed star, which is said to denote violent death, & Mars is approaching Caput Algol, which is said to denote beheading.' Two years later the king's head fell on the block. 'Astrology must be right,' wrote the American astrologer Evangeline Adams, claimed descendant of John Quincy Adams, in a challenge to skeptics in 1929. 'There can be no appeal from the Infinite.' The Fated Sky explores both the history of astrology & the controversial subject of its historical influence. It's the 1st serious book to fully engage astrology in this way. Astrology is the oldest occult sciences, also the origin of science itself. Astronomy, mathematics & other disciplines arose in part to make possible the calculations necessary in casting horoscopes. For 5000 years, the influence of the stars has been viewed as shaping the course of affairs. According to recent polls, at least 30% of Americans believe in it, tho modern astrology is utterly different from the doctrine of the stars that won the respect & allegiance of the greatest thinkers, scientists & writers--Greek, Roman, Egyptian, Arab & Persian--of earlier days. Statesmen, popes & kings once embraced it. Th Aquinas found it compatible with Xian faith. There are some 200 allusions to it in Shakespeare's plays, all their predictions fulfilled. The great astronomers of the scientific revolution--Copernicus, Tycho Brahe, Kepler--were adherents. Newton's appetite for mathematics was whetted by an astrological text. Prominent figures such as Churchill, deGaulle & Reagan have consulted astrologers, heeding their advice. Universities as diverse as Oxford & Spain's Univ. of Zaragoza offer courses in the subject, fulfilling Jung's prediction that astrology would again become the subject of serious discourse. Whether astrology actually has the powers ascribed to it is open to debate. But there's no doubt that it maintains a hold on the human mind. The Fated Sky gives a comprehensive account of this subject & its enduring influence on history & the history of ideas.",
  "genres": [
    "Astrology",
    "History",
    "Nonfiction",
    "Science",
    "Witchcraft",
    "Spirituality",
    "Microhistory"
  ],
  "author": "Benson Bobrick",
  "average_rating": "3.76",
  "url": "https://www.goodreads.com/book/show/319949.The_Fated_Sky"
}