{
  "title": "The Devil's Dance",
  "description": "Cherry Clark is a spoiled brat, unappreciative of the good fortune she's experienced throughout her life. She is also a solitary sex addict, experiencing her vicarious desires through her imagination and Internet porn. Her closet desire to be a submissive is shrouded in fear; and her mouthy attitude only gets her into trouble. One night after work, she finds a flier stuck to her car, advertising a mysterious club, Sheol's Fringe. Her interest is aroused, she decides to go, unaware that her life is about to change forever. Sameal, the hot looking bartender and Sheol's owner, is also a \"devil\", and a member of the Board of Directors for Devil Corp, an organization that brokers in human pleasures through the use of a 'Dream Journal' service. The journal itself allows the user to experience whatever fantasy they write about while in a sleep-like trance. Sameal gives her a dream journal of her own, through which Cherry lives out her deepest and darkest fantasies. Her desires take some shocking twists. Even more frightening, they tend to manifest themselves in unusual physically forms. She's a rare breed, able to immerse herself in fantasy to the point of changing her own reality. From scenes as a sexy \"puppy\" to a down-on-her-luck white-trash whore who gets used hard, the shallow young woman is soon to discover that despite her open resistance, she has a strong desire to submit. As her relationship with Sameal deepens, she becomes his. It's under his stern hand that she discovers the joy of being spanked and punished, as her bratty side is paddled into submission for the first time in her life. However, Cherry still wars with her submissive self. And when she decides she wants her freedom, Sameal grants her request. But without his ownership and guidance, she feels empty; and now she's fair game for other members of the club, who have their own designs on the sexy Cherry. Some painful lessons await her as she attempts to navigate her elusive quest for sexual gratification without the powerful Sameal. Can Cherry live without him? Will she find her way back? Or will there be a new master ready to take this needy submissive in hand? Contemporary BDSM Fantasy, (with paranormal elements) featuring male domination.",
  "genres": [
    "BDSM",
    "Erotica",
    "Paranormal",
    "Fantasy",
    "Paranormal Romance",
    "Dark",
    "Contemporary"
  ],
  "author": "Johnny Stone",
  "average_rating": "3.54",
  "url": "https://www.goodreads.com/book/show/11969550-the-devil-s-dance"
}