{
  "title": "Christmas in Bermuda: The Purple Grumblies",
  "description": "Old Pete, Leader of the Purple Grumblies had some good news! The Purple Grumblies had been invited to a surprise Christmas Circus in Bermuda!In no time, the voyage was organized thanks to Percy the Dreaded Sea-Monster agreeing to pull his love Bumboo the Efelant on a raft, with Gertie hitched behind in her Royal Bathtub. Charlie's helicopter Rattletrap took care of parasailing the others.It was a \"Bermuda or Bust\" trip, but they landed safely, and couldn't believe how beautiful the pink sand and turquoise waters looked. \"The sand is like powder! It's really PINK! It makes my toes tingle,\" exclaimed Gancy.Gertie decided to try the free donkey ride but was kicked to the ground when she made the mistake of pulling the donkey's tail. Everyone laughed, except Mr. Fleabag, the owner of the circus. Mr Fleabag thought it would be a good idea to capture Gertie, put her in a cage, and force her to act as a clown in his circus. But he was in for a surprise!All of a sudden, it was SHOWTIME under the Big Top. Santa's Christmas presents had been hung in a huge net at the top of the tent, ready for release only when Santa arrived. The children waited patiently for Santa to arrive. Towards the end of the show, MARKO the elephant was brought into the ring. Bumboo was watching through the flaps of the tent when she gasped! It wasn't MARKO, it was BINGO, her long lost brother!Bumboo charged into the ring, grabbed her brother, and they raced down to the beach where Percy and the raft awaited them.Meanwhile, Mr. Fleabag had made the mistake of trying to capture Gertie with a big butterfly net. But he had chosen the wrong Grumblie! Gertie was outraged and suddenly faced him, the sharp end of her umbrella poking at his large tummy. He dropped the net and ran as fast as he could. Gertie picked up the net and gave cruel Mr. Fleabag a lesson he'll never forget!Back at the circus tent, Santa arrived and released the presents. The children went wild. Grumpy Jack and three others won a ride in Santa's sleigh, and they flew straight through a Bermuda Moongate, and made a wish. Below them, the other Grumblies were about to go for a sail in Bermuda's Tall Ship, the Spirit of Bermuda. They shouted to Grumpy Jack to come down and join them. Without thinking Grumpy Jack jumped out of the sleigh using his umbrella as a parachute. But half way down his grumbrella blew inside out and Grumpy Jack fell like a stone.What happened next would give someone else a shock to remember!",
  "genres": [],
  "author": "Mike Marsh",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/32022099-christmas-in-bermuda"
}