{
  "title": "Toys Come Home: Being the Early Experiences of an Intelligent Stingray, a Brave Buffalo, and a Brand-New Someone Called Plastic",
  "description": "“A bit like the great movie  Toy Story  and a bit like the wonderful Kate DiCamillo book  The Miraculous Journey of Edward Tulane . This is a great family book.” — The Washington Post  on  Toys Go Out,  the companion to  Toys Come Home Here is the final book in the highly acclaimed Toys trilogy, which includes the companion books  Toys Go Out and  Toy Dance Party  and chronicles the unforgettable adventures of three brave and loving toys. Fans of the series, as well as newcomers, will happily discover how Lumphy, StingRay, and Plastic came to live with the Girl. In six linked adventures, readers will also learn how the one-eared Sheep became one-eared, watch a cranky toy meet an unfortunate end, and best of all, learn why it’s okay for someone you truly love to puke on you. This is perhaps the most charming of three inimitably charming books destined to become classics.A  Wall Street Journal  Best Children’s Book of the YearA Bank Street College of Education Best Children’s Book of the YearA Junior Library Guild Selection \"A timeless story of adventure and friendship to treasure aloud or independently. Wholly satisfying, this may well leave readers expecting to see the Velveteen Rabbit peeking in the bedroom window and smiling approvingly.\" — Booklist,  Starred“The best talking toy stories since  Winnie-the-Pooh. ” — Kirkus Reviews\"A book destined to be read to children at bedtime for decades (nay, centuries?) to come. It is rare that prequels exceed the books they are meant to simply introduce, but this is one of the few.\" —Betsy Bird,  A Fuse #8 Production",
  "genres": [
    "Fantasy",
    "Chapter Books",
    "Childrens",
    "Fiction",
    "Picture Books",
    "Juvenile",
    "Humor"
  ],
  "author": "Emily Jenkins",
  "average_rating": "4.25",
  "url": "https://www.goodreads.com/book/show/10204844-toys-come-home"
}