{
  "title": "The Curse of Tempest Gate",
  "description": "Clarity Shaw, a reporter for Unbelievable Finds, seeks answers concerning the curse of Tempest Gate Cemetery. Warnings from the Bed and Breakfast’s receptionist and an old man only make her more curious. Determined to get her story, Clarity ventures into the old cemetery.Even though she is tied to the legends surrounding Tempest Gate through her ancestry, Clarity does not believe in the paranormal. She intends to collect the local versions of the stories, take some photos, and be on her way.A beautiful sculpture in the cemetery, a stone angel warrior, draws her attention and her admiration. Could this be the Archangel Michael? Then she finds out more than she bargains for when she sits in the devil’s chair on the eve of Halloween. Two entities need her for their own personal reasons, but only one will demand her heart.Ramsey's Book \"In all my years of reading I have never come across a story written quite like this one. The Curse of Tempest Gate is like finding a needle in a haystack. As I came to the end this fantastic tale, I was left with a tear in my eye and a sense of satisfaction and pleasure. Karen Michelle Nutt is truly gifted in her craft of weaving a tale.\" – AmyCoffee Time \"A well-wrought ghost story, this tale of angels and demons trapped in a cemetery to battle for all time will have the reader flipping the pages to see if the curse is broken. ...the passion between these two characters is believable and wrapped up nicely. I would love to read more of these characters as the author left it open in a way that suggests other stories about the writers of Unbelievable Finds.\" – Virginia, Reviewer at Coffee Time Romance\"The storyline was good, and I enjoyed the curse aspect of this, especially when Nutt added in a conversation with a ghost. Gotta love that.\" ~Ghost Writer Literary Reviews",
  "genres": [],
  "author": "Karen Michelle Nutt",
  "average_rating": "4.40",
  "url": "https://www.goodreads.com/book/show/11969346-the-curse-of-tempest-gate"
}