{
  "title": "Taking It to the Streets: The Social Protest Theater of Luis Valdez and Amiri Baraka",
  "description": "The performances of Luis Valdez's El Teatro Campesino, the farmworkers' theater, and Amiri Baraka's (LeRoi Jones's) Black Revolutionary Theater (BRT) during the 1960s and 1970s, offer preeminent examples of social protest theater during a momentous and tumultuous historical juncture. The performances of these groups linked the political, the cultural, and the spiritual, while agitating against the dominant power structure and for the transformation of social and theatrical practices in the U.S. Founded during the Delano Grape Pickers' Strike and Black Power rebellions of the mid-1960s, both El Teatro and the BRT professed cultural pride and group unity as critical corollaries to self-determination and revolutionary social action.Taking It to the Streets compares the performance methodologies, theories, and practices of the two groups, highlighting their cross-cultural commonalties, and providing insights into the complex genre of social protest performance and its interchange with its audience. It examines the ways in which ritual can be seen to operate within the productions of El Teatro and the BRT, uniting audience and performers in subversive, celebratory protest by transforming spectators into active participants within the theater walls --and into revolutionary activists outside. During this critical historical period, these performances not only encouraged community empowerment, but they inculcated a spirit of collective faith and revolutionary optimism. Elam's critical reexamination and recontextualization of the ideologies and practices of El Teatro and the BRT aid in our understanding of contemporary manipulations of identity politics, as well as current strategies for racial representation and cultural resistance.\"A major contribution to our understanding of how social protest came to be so strong and how Black and Chicano theatre contributed to the synergy of those times.\" --Janelle Reinelt, University of California, DavisHarry J. Elam, Jr., is Associate Professor of Drama and Director of the Committee on Black Performing Arts, Stanford University.",
  "genres": [],
  "author": "Harry J. Elam Jr.",
  "average_rating": "4.18",
  "url": "https://www.goodreads.com/book/show/320016.Taking_It_to_the_Streets"
}