{
  "title": "The Cynn Cruors Bloodline Series Books 1-5",
  "description": "WELCOME TO THE DARK AND MYSTERIOUS (YET EXTREMELY EROTIC) WORLD OF THE CYNN CRUORS--—A race of brooding, immortal human/werewolf/vampire warriors bred by an ancient alchemist, they're  fierce, heroic, passionate protectors--each one sexier than the last. For every Cynn Cruor we meet here, there's an irresistible love object—a human female. Mix a beautiful, wholly unique leading lady with a supernatural warrior and inescapable twists of fate (not to mention burning hot attraction), and you have a surefire cocktail of passion! Lovers of steamy romance will adore this extremely hot 5-part series of erotic adventures, as will anyone who loves paranormal romance, werewolves, vampires, and ancient magick in the otherworldly Scottish countryside--now available at the unbeatable price of  9.99! Rapture at Midnight Finn Qualtrough is an alluring Cynn Cruor sniper. Eirene Spence is an insomniac hacker with a reckless penchant for midnight walks in a moonlit Manchester park. In the midst of a long night of programming Eirene decides to take a stroll in the park under the full moon ... and is assaulted by a gang of supernatural villains. Just when she fears she's about to die, she's rescued by Finn —a handsome, provocative stranger whose touch ignites a hunger inside her that only he can satisfy. Forever at Midnight When Roarke—a handsomely brooding, supernatural Cynn Cruor warrior—catches a glimpse of Deanna—a beautiful Scottish maiden he pledged his undying love to eons ago—he thinks he's lost his mind. Because, unlike him, she's human. Roarke met Deanna over 500 years ago. The night they vowed their undying love to one another, Deanna was murdered by the Scatha Cruors. And Roarke buried her himself. Now he needs to know why she’s hidden herself from him all these years. And he needs to make her his again. Midnight's Atonement Cynn Cruor warrior Graeme Temple never meant to meet Kate Corrigan—an alluring investigative journalist trying to expose a human trafficking ring—but she kindles in Graeme a devouring lust, a desire to possess, and a need to protect. And Kate never meant to fall so quickly for such a mysterious—not to mention extremely hot—hero, whose attraction she can’t deny, no matter how hard she tries. Midnight's Fate Zac McBain is on a mission to find the source of the Specus Argentum—mystic silver that just so happens to be the only element that can destroy the Cruors. Meanwhile deep in the rainforests of Honduras, Faith Hannah is on a mission of her own.  A brilliant doctor in the field, she has a medical mission prompted by her wish to escape the problems that assail her in London. She never expected to be kidnapped and discover a whole supernatural world —and she certainly didn't expect to feel such a sudden, intense need and longing for one of them... The passion fate has decreed between Zac and Faith begins to consume them in a steamy, erotic romance sure to make any reader weak in the knees. My Haven, My Midnight For Amaryllis Hart, it’s just one thing after the other. After escaping an abusive uncle, she finds herself working a sinister human who betrays her and sells her without hesitation to the evil shape-shifting Scatha Cruors.  But Cynn Cruor warrior Colin Butler is fated to rescue Amaryllis, the violet-eyed beauty he longs to do so much more for. She makes his blood curdle with desire…and she heals his soul. ***CONTENT WARNING: This story contains adult language and sexual situations and is intended for audiences 18+ ONLY",
  "genres": [],
  "author": "Isobelle Cate",
  "average_rating": "4.91",
  "url": "https://www.goodreads.com/book/show/31986184-the-cynn-cruors-bloodline-series-books-1-5"
}