{
  "title": "Stolen Lightning: Social Theory of Magic",
  "description": "Dust jacket \"Within the broad sweep of intellectual history a truly revolutionary book must address itself to the educated general reader as well as to the specialist; such were the major works of Frazer, Max Weber, Spengler, Toynbee and Freud. And such is Daniel O'Keefe's magisterial study of magic. This is a book that has drawn upon research in many disciplines to produce a truly general (and hence explanatory) theory of magic - a theory which will interest scholars in philosophy, sociology, religion, anthropology, history, psychology and other fields. But even more, this is a book that will appeal to every educated layperson who wants to understand magic's persistence. Here he will learn that magic was at one time the province of much of human understanding and that magical roots remain alive in many institutions of modern life; that magic once helped the human self to emerge and later shaped the institutions of the individual which still support that self; that a full understanding of the human experience even today requires a systematic explanation of magic; that without such understanding we may succumb in regression to a dangerous remedy which once helped us to advance. Through magic humanity has forever rebelled and then enslaved itself anew in structures of alienation of its own making. This is the story of the human past. It is also the record of the secular present, when even in a scientific age magical protest serves to remind us of the transcendent in everyday life. Yet, concomitantly and perennially, magic's Pyrrhic victories obscure man's native understanding that this transcendence is partly of his own making. This darkening of vision is evident in the current rash of escapist cults and mechanical rituals for transforming the self and the world. However, as this book emphasizes, even in less exotic forms the influence of magic remains pervasive....\"",
  "genres": [
    "Nonfiction",
    "Sociology",
    "Religion",
    "Occult",
    "Anthropology",
    "Magic",
    "History"
  ],
  "author": "OKEEFE,",
  "average_rating": "3.88",
  "url": "https://www.goodreads.com/book/show/3203321-stolen-lightning"
}