{
  "title": "The Woman Who Smashed Codes: A True Story of Love, Spies, and the Unlikely Heroine who Outwitted America's Enemies",
  "description": "Joining the ranks of Hidden Figures and In the Garden of Beasts, the incredible true story of the greatest codebreaking duo that ever lived, an American woman and her husband who invented the modern science of cryptology together and used it to confront the evils of their time, solving puzzles that unmasked Nazi spies and helped win World War IIIn 1916, at the height of World War I, brilliant Shakespeare expert Elizebeth Smith went to work for an eccentric tycoon on his estate outside Chicago. The tycoon had close ties to the U.S. government, and he soon asked Elizebeth to apply her language skills to an exciting new venture: code-breaking. There she met the man who would become her husband, groundbreaking cryptologist William Friedman. In The Woman Who Smashed Codes, Jason Fagone chronicles the life of Elizebeth Smith who played an integral role in our nation's history for forty years. After World War I, Smith used her talents to catch gangsters and smugglers during Prohibition, then accepted a covert mission to discover and expose Nazi spy rings that were spreading like wildfire across South America, advancing ever closer to the United States. As World War II raged, Elizebeth fought a highly classified battle of wits against Hitler's Reich, cracking multiple versions of the Enigma machine used by German spies. Meanwhile, inside an Army vault in Washington, William worked furiously to break Purple, the Japanese version of Enigma--and eventually succeeded, at a terrible cost to his personal life.Fagone unveils America's code-breaking history through the prism of Smith's life, bringing into focus the unforgettable events and colorful personalities that would help shape modern intelligence.",
  "genres": [
    "Nonfiction",
    "History",
    "Biography",
    "Book Club",
    "World War II",
    "Audiobook",
    "Historical"
  ],
  "author": "Jason Fagone",
  "average_rating": "4.09",
  "url": "https://www.goodreads.com/book/show/32025298-the-woman-who-smashed-codes"
}