{
  "title": "Beyaz Kedi",
  "description": "Her ailenin korkunç bir sırrı vardır.Öyle bir dünya düşünün ki bazı insanlarda, sadece genetik yolla kazanılabilen bir yetenek var: tek bir dokunuşla duygularınızla, anılarınızla oynayabiliyor, kemiklerinizi kırabiliyor, size şans verebiliyor, sizi öldürebiliyorlar ve buna Lanet İşleyiciliği deniyor. Lanet İşleyiciliği insanlara yarar sağlayabildiği kadar zarar da verebildiği için bu genetik yeteneğe sahip kişiler toplumdan dışlanmış durumdalar, en ağır işlerde çalıştırılıyor ya da yasadışı yollara zorlanıyorlar. Üstelik ölümcül dokunuşlarının kontrol altında tutulabilmesi için eldiven giymek zorundalar. Eldiven, onları toplumda işaretleyen kötü bir leke gibi.Cassel de böyle bir aileden geliyor, ailesinin tümü –mecburen– lanet işleyici yeteneklerini kullanarak dolandırıcılıkla geçimini sağlıyor, mafyayla yakın ilişki kuruyor. Cassel hariç. Cassel, ailedeki boyalı kuş. Kuşaklar boyunca genetik yolla geçen lanet yeteneği Cassel’de yok. Büyülü dokunuşa sahip olmadığı için kendi ailesi tarafından bile dışlanmış. O, yozlaşmış bir ailede, dürüst kalmaya çalışan bir savaşçı. Yalnız tek bir sorun var: Cassel, üç yıl önce en yakın arkadaşı Lila’yı öldürdü.O korkunç günden beri Cassel, ailesine rağmen normal bir hayat sürmeye çalışıyor. Ancak bütün bu çaba, bir gece gördüğü bir kâbustaki beyaz kedinin ona bir şeyler anlatmaya çalışmasıyla son buluyor. Bundan sonra ailesindeki tuhaf davranışlar, yeni başlayan uyurgezerlik ve bazı şeyleri hatırlamakta zorlanması, tek bir şeye işaret ediyor: ailesi, Cassel’e çok fena bir oyun oynuyor. Cassel’in şimdi ailesine karşı savaş verip bütün oyunu bozması gerek –bir de kâbuslarındaki beyaz kediyi bulması.Vampirleri, melekleri ve kurtadamları unutun, bambaşka bir fantastik dünyaya adım atmak üzeresiniz. Özgün bir fikrin, usta bir hikaye anlatıcısının ellerinde nasıl tutku dolu ve sürükleyici bir maceraya dönüştüğüne şahit olacaksınız.",
  "genres": [
    "Fantasy",
    "Young Adult",
    "Urban Fantasy",
    "Paranormal",
    "Magic",
    "Fiction",
    "Mystery"
  ],
  "author": "Holly Black",
  "average_rating": "3.79",
  "url": "https://www.goodreads.com/book/show/11971097-beyaz-kedi"
}