{
  "title": "I Live Here",
  "description": "I Live Here is a paper documentary–an intimate journey to humanitarian crises in four corners of the world: war in Chechnya, ethnic cleansing in Burma, globalization in Mexico, and AIDS in Malawi.~THE BOOK~I Live Here is a visually stunning narrative — told through journals, stories, images, and graphic novellas — in which the lives of refugees and displaced people become at once personal and global. Bearing witness to stories that are too often overlooked, it is a raw and intimate journey to crises in four corners of the world: war in Chechnya, ethnic cleansing in Burma, globalization in Mexico, and AIDS in Malawi. The voices we encounter are those of displaced women and children, in their own words or in stories told in text and images by noted writers and artists. The stories unfold in an avalanche: An orphan goes to jail for stealing leftovers. A teenage girl falls in love in a city of disappeared women. A child soldier escapes his army only to be saved by the people he was taught to kill. Mia Kirshner’s journals guide us through a unique paper documentary brought vividly to life in collaboration with J.B. MacKinnon, Paul Shoebridge, and Michael Simons, with featured works by Joe Sacco, Ann-Marie MacDonald, Phoebe Gloeckner, Chris Abani, Karen Connelly, Kamel Khelif, and many others.~THE JOURNEYS ~IngushetiaThe border of the Russian republic of Ingushetia is not even fifty miles from Grozny, the capital city of Chechnya. Today, some 15,000 Chechen refugees live in Ingushetia. Mia Kirshner and Joe Sacco traveled here together, returning with first-person accounts, video, photographs, and other materials gathered in Nazran and Moscow. The chapter includes journals by Mia Kirshner, the story of a young refugee as told by J.B. MacKinnon, the story of a young piano virtuoso as told by Ann-Marie Macdonald, and a graphic novella of Chechen refugees by Joe Sacco.BurmaEthnic cleansing by the Burmese military has displaced an estimated 500,000 to 1 million people; over 100,000 live in refugee camps along the Thailand-Burma border. Burma is also believed to be home to more child soldiers than any other country in the world. Mia Kirshner and Michael Simons took separate trips to the region; this chapter is based on their interviews, photos, and video, as well as writing by sex workers and Karen refugees. It includes journals by Mia Kirshner, as well as work by Chris Abani, Karen Connelly, J.B. Mackinnon, and a graphic novella by Kamel Khélif.Juárez Ciudad Juárez is a large industrial border city in Mexico across the Rio Grande from El Paso, Texas. Since 1993, young women, many of them employees of Juárez’s more than three hundred maquiladoras, or global trade zone factories, have been disappearing from the streets. Mia Kirshner and Phoebe Gloeckner made independent journeys to this region; this book is informed by the stories and images they brought home. It includes journals, a story of one of the victims by Lauren Kirshner, and a graphic novella by Phoebe Gloeckner. MalawiMalawi is one of the world’s poorest countries, and has an AIDS rate close to twenty percent. The disease touches every aspect of daily life in the African nation, introducing immense chaos, particularly in the case of orphan children. Mia Kirshner and J.B. MacKinnon made the trip to Malawi and returned with interviews, photographs, writing, and artworks. This book includes journals, a children’s story by J.B. MacKinnon with art by Julie Morstad, and the stories and artwork of boys in a local prison.",
  "genres": [
    "Nonfiction",
    "Graphic Novels",
    "Politics",
    "Comics",
    "War",
    "Memoir",
    "History"
  ],
  "author": "Mia Kirshner",
  "average_rating": "4.25",
  "url": "https://www.goodreads.com/book/show/3203556-i-live-here"
}