{
  "title": "The Rogue's Omega",
  "description": "Kyle is an omega, one of the rare and precious male shifters that exist in wolf packs. Born capable of breeding like a female, he was raised in the cruel environment of his sire, Haldon’s, pack. He’s spent his entire short life dreading the time when he’d be expected to breed as many pups as possible. His fears are realized one night when Haldon hands him over to the frightening, yet sexy, alpha of the new Rogue Pack. A few minutes in the virile alpha’s company triggers Kyle’s first heat. At first, he assumes the Rogue alpha will breed him then toss him to his pack for sport. The male surprises him by taking him as his mate instead. Having become the reluctant leader of an unusual wolf pack, Alpha Lorcan simply wants to build a settlement for his ragtag group of shifters. Each of them is either a runaway or an undeserving outcast from packs that treated them badly. They call themselves the Rogue Pack, and instead of turning dangerous and predatory, they have found a new sense of belonging under Lorcan’s guidance.Lorcan wasn’t looking for a mate just yet, but the beautiful omega male thrust in front of him as part of a treaty with Haldon changes his mind. With his new lands secured, he wants to increase his pack and nothing accomplishes that quicker or better than an alpha siring pups. Although still emotionally scarred from his own sire’s cruelty, he is determined to be a good alpha. Doing so by mating with Kyle allows him to mix unwanted duty with unplanned pleasure.As Lorcan and Kyle work to form a bond as a mated pair, outside forces threaten to come between them. If their lives together are to become more than mere duty, each of them will have to overcome his painful past and learn to trust and love.",
  "genres": [
    "M M Romance",
    "Shapeshifters",
    "Omegaverse",
    "Paranormal",
    "Romance",
    "Werewolves",
    "Fantasy"
  ],
  "author": "Samantha Cayto",
  "average_rating": "3.57",
  "url": "https://www.goodreads.com/book/show/32062499-the-rogue-s-omega"
}