{
  "title": "The JFK Assassination Debates: Lone Gunman versus Conspiracy",
  "description": "Who killed JFK? Ever since that Dallas day, theories about the murder have proliferated, running the gamut from the official \"lone gunman\" verdict to both serious & screwy conspiracy theories. Kurtz, an historian who has plumbed this case's crevices for over 30 years, sums up & critiques four decades of debate, offering provocative new perspectives. He presents an accounting of what's actually known & not known about the assassination, underlining both the logic & the limitations of major theories about the case. He then offers unique interpretations of the physical & forensic evidence & of existing areas of controversy, leading to conclusions readers will find hard to dismiss. He shows how the official investigation's egregious mishandling of the crime-scene evidence-related to virtually every aspect of the case-is largely responsible for the lone gunman/conspiracy schism. Those responsible for that investigation (FBI, Dallas police, Warren Commission) failed so miserably in their efforts that they would have been laughed off the air if they had been portrayed on any CSI series. One of the few experts writing on the subject who actually met Oswald, he also provides new information about the accused assassin's activities around the time of the assassination & about his double life, analyzing Oswald's ties to the intelligence community, to organized crime & to both anti- & pro-Castro Cuban activists. Mustering documentation-including exclusive interviews with key figures & materials declassified by the Assassination Records Review Board-he both confirms & alters much previous speculation about Oswald & other aspects of the case. Who really killed JFK? Most Americans feel they don't know the truth, that government isn't telling the whole story. Kurtz offers a corrective to the most recent \"final verdicts\", establishing a sound baseline for future research.PrefaceAcknowledgmentsThe assassination & its aftermathConflict: the evidence Conflict: the case for the lone assassinConflict: the case for conspiracyConsensus: the factsLee Harvey Oswald The intelligence connection The organized crime connectionConclusionNotesSelected BibliographyIndex",
  "genres": [
    "History",
    "Nonfiction",
    "American History",
    "Politics",
    "True Crime",
    "Crime"
  ],
  "author": "Michael L. Kurtz",
  "average_rating": "3.49",
  "url": "https://www.goodreads.com/book/show/320731.The_JFK_Assassination_Debates"
}