{
  "title": "The Illuminati: The Secret Society That Hijacked the World",
  "description": "A deep dive into the origins, history, members, and workings of the Illuminati from a well-known and respected expert. Chilling initiations. Big banks and money manipulations. Possible links to the Rockefellers, Rothschilds, Adamses, and Bushes. Reviewing the evidence, documents, and connections, The The Secret Society That Hijacked the World by award-winning journalist and author Jim Marrs shines a light on the history, workings, continuing influence, and pernicious and hidden power of this secret order. Surveying experts―from those who dismiss the Illuminati as a short-lived group of little consequence to skeptics who dare question the government's accounts and pronouncements―Marrs cuts through the wild speculation and the attempts to silence critical thinkers to tell the true story of this secret cabal. Gnosticism, mystery schools, the Roshaniya, Knights Templar, assassins, Rosicrucians, Skull and Bones, Knights of Malta, whistle blowers, the revolutions in France, Russia, and America, and the structure, symbols, and theology of the Illuminati are all covered. Marrs takes a broad look at the group and their workings, investigating their origin as “The Ancient and Illuminated Seers of Bavaria,” the depiction on the United States one-dollar bill of an all-seeing eye and pyramid on the reverse of the Great Seal of the United States, and the Protocols ―or procedures―for usurping national governments and gaining world domination, as well as the Illuminati symbolism found in today's international corporate logos. Wealth, power, and intrigue come together in this in-depth exposé on the Illuminati, their history, connections to influential people, and their place in modern America. The Illuminati lifts the cloaks of secrecy protecting the powerful.",
  "genres": [
    "History",
    "Nonfiction",
    "Conspiracy Theories",
    "Audiobook",
    "Politics",
    "Occult"
  ],
  "author": "Jim Marrs",
  "average_rating": "3.77",
  "url": "https://www.goodreads.com/book/show/32073127-the-illuminati"
}