{
  "title": "The Secrets in My Scowl",
  "description": "Sparks ignite and tempers flare when a sexy, optimistic wedding planner, moves his business in across the hall from a jilted, divorce lawyer’s practice.“Look smart ass. This is the last time I’m going to remind you about breaking sections of the lease. If there’s a next time, I won’t stop until you and your frilly, white wedding shit is thrown out of here. Do you got it?!”Wylde looked in Jacob’s pained eyes and answered in his deep voice. “Yeah, counselor. I got it.”From high school, up until he became a successful attorney Jacob Snowden was convinced that love had it out for him. “Everyone left,” were the words he lived by. His mother, his high school sweetheart, his father, and his fiancé, all left Jacob just when he felt it was safe to let down his guard. Not any longer. Jacob was a determined man, set at keeping people at a distance. If his six foot one, military-made body didn’t scare people off, his permanent scowl surely did. At almost forty, Jacob’s social life was non-existent, but he told himself his work fulfilled him. He helped people get out of their loveless marriages. Jacob Snowden was one of the best divorce lawyers on the east coast and was damn proud of it. So, imagine his disdain when a wedding planner moves into the suite directly adjacent to his… an insanely masculine, male wedding planner.Wylde Sterling had made quite a name for himself in his hometown of Roanoke, Virginia, working for a wedding planner that catered to the elite. He was known for his charm and impeccable taste. Yep, he was incredible at giving couples the wedding of their dreams. But he wanted nothing more than to plan his own. After striking out in love more times than he cared to admit, Wylde decided to start his own business in a new city, hoping Richmond would give him a fresh start. Things started out wonderfully – until he started to piss off the angry divorce attorney next door. Wylde could see past Jacob’s mean scowl, knowing there was a reason for it. It was the man’s defense mechanism, his means of keeping people away. Everything in Wylde told him to stay away, but he believed Jacob just needed to meet a man who had been hurt as badly as he had.Standalone gay romance that ends in an HEA and no cliffhanger",
  "genres": [
    "M M Romance",
    "Contemporary",
    "Romance",
    "Audiobook",
    "Enemies To Lovers",
    "Gay",
    "LGBT"
  ],
  "author": "A.E. Via",
  "average_rating": "4.12",
  "url": "https://www.goodreads.com/book/show/32072126-the-secrets-in-my-scowl"
}