{
  "title": "Radio Okapi Kindu: The Station that Helped Bring Peace to the Congo",
  "description": "One of Africa's largest radio stations operating in one of the continent's most politically unstable countries sets the stage for a touching and thought-provoking story that illustrates how peace is a process, and how the spectrum between war and peace is more nuanced than people think.In early 2004, Jennifer, a young journalist from Nova Scotia, Canada, arrives in the Congolese capital of Kinshasa with rose-colored prejudice abounding. After seven years of brutal warfare involving eight neighboring countries and several million deaths, hostile factions have just agreed to a ceasefire. A new transitional government is in place.Jennifer travels 1,500 miles up the Congo River to the small city of Kindu to manage a regional station of Radio Okapi, a year-old station funded by the U.N. and a Swiss NGO. She joins a hard-working team of local reporters―six men and one woman who are determined to cover their country’s rapid march towards elections. Armed only with facts, they set about to tirelessly, unceremoniously chip away at the rampant rumors, misinformation and conjecture that have long polarized the Congo.When a public lynching is followed by an outbreak of violence, Jennifer realizes how little she understands Congolese politics―and how little she has at stake compared to her Congolese colleagues. Maintaining the rigor of Radio Okapi’s editorial line suddenly seems like a matter of life or death. Can one small station known as the “frequency of peace” stand the strain?Radio Okapi Kindu is an honest, unvarnished account of a young journalist's steep learning curve, and a love song to a poor but astonishingly beautiful country whose broadcasting record bears lessons for media consumers everywhere.",
  "genres": [
    "Africa",
    "Nonfiction",
    "Memoir",
    "Historical",
    "Biography Memoir",
    "History",
    "Democratic Republic Of The Congo"
  ],
  "author": "Jennifer Bakody",
  "average_rating": "3.88",
  "url": "https://www.goodreads.com/book/show/32073183-radio-okapi-kindu"
}