{
  "title": "The Siege of Mecca: The Forgotten Uprising in Islam's Holiest Shrine and the Birth of al-Qaeda",
  "description": "On November 20, 1979, worldwide attention was focused on Tehran, where the Iranian hostage crisis was entering its third week. The same morning—the first of a new Muslim century—hundreds of gunmen stunned the world by seizing Islam’s holiest shrine, the Grand Mosque in Mecca. Armed with rifles that they had smuggled inside coffins, these men came from more than a dozen countries, launching the first operation of global jihad in modern times. Led by a Saudi preacher named Juhayman al Uteybi, they believed that the Saudi royal family had become a craven servant of American infidels, and sought a return to the glory of uncompromising Islam. With nearly 100,000 worshippers trapped inside the holy compound, Mecca’s bloody siege lasted two weeks, inflaming Muslim rage against the United States and causing hundreds of deaths.Despite U.S. assistance, the Saudi royal family proved haplessly incapable of dislodging the occupier, whose ranks included American converts to Islam. In Iran, Ayatollah Khomeini blamed the Great Satan—the United States —for defiling the shrine, prompting mobs to storm and torch American embassies in Pakistan and Libya. The desperate Saudis finally enlisted the help of French commandos led by tough-as-nails Captain Paul Barril, who prepared the final assault and supplied poison gas that knocked out the insurgents. Though most captured gunmen were quickly beheaded, the Saudi royal family responded to this unprecedented challenge by compromising with the rebels’ supporters among the kingdom’s most senior clerics, helping them nurture and export Juhayman’s violent brand of Islam around the world.This dramatic and immensely consequential story was barely covered in the press in the pre-CNN, pre–Al Jazeera days, as Saudi Arabia imposed an information blackout and kept foreign correspondents away. Yaroslav Trofimov now penetrates this veil of silence, interviewing for the first time scores of direct participants in the siege, including former terrorists, and drawing on hundreds of documents that had been declassified on his request. Written with the pacing, detail, and suspense of a real-life thriller, The Siege of Mecca reveals how Saudi reaction to the uprising in Mecca set free the forces that produced the attacks of 9/11, and the harrowing circumstances that surround us today.",
  "genres": [
    "History",
    "Nonfiction",
    "Islam",
    "Politics",
    "Religion",
    "Terrorism",
    "20th Century"
  ],
  "author": "Yaroslav Trofimov",
  "average_rating": "4.20",
  "url": "https://www.goodreads.com/book/show/320657.The_Siege_of_Mecca"
}