{
  "title": "The Other End of the Leash: Why We Do What We Do Around Dogs",
  "description": "The Other End of the Leash shares a revolutionary, new perspective on our relationship with dogs, focusing on our behavior in comparison with that of dogs. An applied animal behaviorist and dog trainer with more than twenty years experience, Dr. Patricia McConnell looks at humans as just another interesting species, and muses about why we behave the way we do around our dogs, how dogs might interpret our behavior, and how to interact with our dogs in ways that bring out the best in our four-legged friends.After all, although humans and dogs share a remarkable relationship that is unique in the animal world, we are still two entirely different species, each shaped by our individual evolutionary heritage. Quite simply, humans are primates and dogs are canids (like wolves, coyotes, and foxes). Since we each speak a different native tongue, a lot gets lost in the translation.The Other End of the Leash demonstrates how even the slightest changes in your voice and the way you stand can help your dog understand what you want. Once you start to think about your own behavior from the perspective of your dog, you’ll understand why much of what appears to be doggy-disobedience is simply a case of miscommunication. Inside you will learnHow to use your voice so that your dog is more likely to do what you ask.Why “getting dominance” over your dog is a bad idea.Why “rough and tumble primate play” can lead to trouble–and how to play with your dog in ways that are fun and keep him out of trouble.How dogs and humans share personality types–and why most dogs want to live with benevolent leaders rather than “alphawannabees!”In her own insightful, compelling style, Patricia McConnell combines wonderful true stories about people and dogs with a new, accessible scientific perspective on how they should behave around each other. This is a book that strives to help you make the most of life with your dog, and to prevent problems that might arise in that most rewarding of relationships.",
  "genres": [
    "Dogs",
    "Nonfiction",
    "Animals",
    "Psychology",
    "Science",
    "Audiobook",
    "Nature"
  ],
  "author": "Patricia B. McConnell",
  "average_rating": "4.39",
  "url": "https://www.goodreads.com/book/show/119723.The_Other_End_of_the_Leash"
}