{
  "title": "More Celtic Fairy Tales",
  "description": "Book \"A fairy (also fey or fae or faerie; collectively, wee folk, good folk, people of peace, and other euphemisms) is the name given to an alleged metaphysical spirit or supernatural being.The fairy is based on the fae of medieval Western European (Old French) folklore and romance. Fairies are often identified with related beings of other mythologies (see list of beings referred to as fairies). Even in folklore that uses the term \"fairy,\" there are many definitions of what constitutes a fairy. Sometimes the term is used to describe any magical creature, including goblins or at other times, the term only describes a specific type of more ethereal creature.Fairies are generally described as human in appearance and as having magical powers. Their origins are less clear in the folklore, being variously the dead, or some form of angel, or a species completely independent of humans or angels. Folklorists have suggested that their actual origin lies in a conquered race living in hiding, or in religious beliefs that lost currency with the advent of Christianity. These explanations are not always mutually incompatible, and they may be traceable to multiple sources.Much of the folklore about fairies revolves about protection from their malice, by such means as cold iron (fairies don't like iron and will not go near it) or charms of rowan and herbs, or avoiding offense by shunning locations known to be theirs. In particular, folklore describes how to prevent the fairies from stealing babies and substituting changelings, and abducting older people as well. Many folktales are told of fairies, and they appear as characters in stories from medieval tales of chivalry, to Victorian fairy tales, and up to the present day in modern literature.\" (Quote from wikipedia.org)Table of Publisher's Preface; Preface; The Fate Of The Children Of Lir; Jack The Cunning Thief; Powel, Prince Of Dyfed; Paddy O'kelly And The Weasel; The Black Horse; The vision Of Macconglinney; Dream Of Owen O'mulready; Morraha; The Story Of The Mcandrew Family; The Farmer Of Liddesdale; The Greek Princess And The Young Gardener; The Russet Dog; Smallhead And The King's Sons; The Legend Of Knockgrafton; Elidore; The Leeching Of Kayn's Leg; How Fin Went To The Kingdom Of The Big Men; How Cormac Mac Art Went To Faery; The Ridere Of Riddles; The Tail; Notes And ReferencesAbout the Forgotten Books is a publisher of historical writings, such Philosophy, Classics, Science, Religion, Esoteric and Mythology. www.forgottenbooks.orgForgotten Books is about sharing information, not about making money. All books are priced at wholesale prices. We are also the only publisher we know of to print in large sans-serif font, which is proven to make the text easier to read and put less strain on your eyes.",
  "genres": [
    "Mythology",
    "Folklore",
    "Fantasy",
    "Fiction",
    "Fairy Tales",
    "Folk Tales",
    "Short Stories"
  ],
  "author": "Joseph Jacobs",
  "average_rating": "3.91",
  "url": "https://www.goodreads.com/book/show/3206602-more-celtic-fairy-tales"
}