{
  "title": "Player's Handbook",
  "description": "The Dungeons & Dragons core rulebook has been revised and updated for clarity and content. Each revision integrates user feedback received since the original product release so as to address the specific wants and needs of the player and Dungeon Master audiences. The overall rules system remains intact, with changes targeted specifically at elements of game play that were considered under-powered or incomplete. These revised editions also contain bonus content, such as new feats, that are exclusive to these editions. In addition, the new and revised content instructs players on how to take full advantage of the tie-in D&D miniatures line planned to release in Fall 2003 from Wizards of the Coast, Inc. Overall changes to all the titles include making complex combat easier to understand and provide more information on interacting with and summoning monsters. Specific changes include the following: the Player's Handbook received revisions to character classes to make them more balanced, and there are revisions and additions to spell lists. Amazon.com ReviewThe Dungeons & Dragons 3rd Edition Player's Handbook contains all the rules you need to create characters and begin adventuring with the world's most popular role-playing game. Newcomers to the game will appreciate this book's clear explanations, effective examples, pleasing layout, elegant rules, and brilliant art. It's never been easier to create and role-play a heroic human ranger, cunning elf wizard, or any other fantasy character from the game's 7 races and 11 classes.Old-school players will likewise be pleased, as the outdated AD&D rules system has been given a thorough overhaul. Gone are almost all the old restrictions on race and alignment. Halfling sorcerers, half-orc paladins, dwarf barbarians, and gnome monks are now possible. THACO, negative armor class, funky saving throws, inflated ability scores, heat-based infravision, and just about every other needlessly complex rule has been reworked into a faster, more consistent, and more fun system. Players can choose unique special abilities for their characters as they gain levels, which means that even two fighters of the same race and class can have very different abilities. The end result of all these changes is a dynamic game with more customized characters.Almost every page has some form of new artwork, and the art almost always serves to explain a concept or illustrate a point. The book is filled with example montages that help to show the difference between human, half-elf, and elf, or relative size differences between creatures, or what the various levels of cover and concealment look like. These illustrations make the rules much more clear. The style of the artwork is consistent throughout the book and is a definite departure from older editions of AD&D. Instead of the classic medieval artwork of Larry Elmore, the new book has the spiky, leathery, Mad Max-meets-Renaissance look of the Magic: The Gathering card game.We would have preferred less radical artistic changes, but we love everything else that Wizards of the Coast has done with Dungeons & Dragons. The rules are fast and clear, and the characters--including the new sorcerer class and the return of the monk, barbarian, and half-orc--are fabulous. If you're new to the D&D game, then this rule book is the perfect introduction. And if you're an old-school gamer who played D&D back in the day, then welcome to the new era of D&D.",
  "genres": [
    "Role Playing Games",
    "Fantasy",
    "Gaming",
    "Dungeons and Dragons",
    "Games",
    "Reference",
    "Fiction"
  ],
  "author": "Wizards of the Coast",
  "average_rating": "3.89",
  "url": "https://www.goodreads.com/book/show/320695.Player_s_Handbook"
}