{
  "title": "A History of the United States in Five Crashes: Stock Market Meltdowns That Defined a Nation",
  "description": "In this absorbing, smart, and accessible blend of economic and cultural history, Scott Nations, a longtime trader, financial engineer, and CNBC contributor, takes us on a journey through the five significant stock market crashes in the past century to reveal how they defined the United States todayThe Panic of 1907: When the Knickerbocker Trust Company failed, after a brazen attempt to manipulate the stock market led to a disastrous run on the banks, the Dow lost nearly half its value in weeks. Only billionaire J.P. Morgan was able to save the stock market.Black Tuesday (1929): As the newly created Federal Reserve System repeatedly adjusted interest rates in all the wrong ways, investment trusts, the darlings of that decade, became the catalyst that caused the bubble to burst, and the Dow fell dramatically, leading swiftly to the Great Depression.Black Monday (1987): When \"portfolio insurance,\" a new tool meant to protect investments, instead led to increased losses, and corporate raiders drove stock prices above their real values, the Dow dropped an astonishing 22.6 percent in one day.The Great Recession (2008): As homeowners began defaulting on mortgages, investment portfolios that contained them collapsed, bringing the nation's largest banks, much of the economy, and the stock market down with them.The Flash Crash (2010): When one investment manager, using a runaway computer algorithm that was dangerously unstable and poorly understood, reacted to the economic turmoil in Greece, the stock market took an unprecedentedly sudden plunge, with the Dow shedding 998.5 points (roughly a trillion dollars in valuation) in just minutes.The stories behind the great crashes are filled with drama, human foibles, and heroic rescues. Taken together they tell the larger story of a nation reaching enormous heights of financial power while experiencing precipitous dips that alter and reset a market where millions of Americans invest their savings, and on which they depend for their futures. Scott Nations vividly shows how each of these major crashes played a role in America's political and cultural fabric, each providing painful lessons that have strengthened us and helped us to build the nation we know today.A History of the United States in Five Crashes clearly and compellingly illustrates the connections between these major financial collapses and examines the solid, clear-cut lessons they offer for preventing the next one.",
  "genres": [
    "History",
    "Economics",
    "Finance",
    "Business",
    "Nonfiction",
    "Audiobook",
    "Politics"
  ],
  "author": "Scott Nations",
  "average_rating": "3.90",
  "url": "https://www.goodreads.com/book/show/32075479-a-history-of-the-united-states-in-five-crashes"
}