{
  "title": "Thief of His Heart",
  "description": "M/M; Shapeshifter; Paranormal Novel (87,612)Crnswar placed a large hand, each finger tipped in razor-sharp talons, upon Seth’s chest. “So afraid,” he said. “Your heart is ready to leap from your chest, but you must like that. You have to. Is it like this when you steal? When you’ve infiltrated someone’s defenses, broken their feelings of security and made away with your prize? Is this how it feels? Is this what you like?”The Basti lord had to have the darkest eyes that Seth had ever seen. Black, unforgiving, abysmal. They didn’t show the slightest bit of sympathy. They filled him with fear, those eyes, fear and something else. Humility.Crnswar moved his hand from Seth’s chest and put his deadly claws against Seth’s throat. “Is this what you were looking for?”The tip of Crnswar’s nails pressed against his flesh, and Seth didn’t dare move. His body reacted to the danger, still upon the surface and wildly excited beneath. It had to be wrong, to be so excited by such a threatening situation. Yet he could feel his arousal stirring. “No. Not this. Not like this,” he stammered.Crnswar looked at him through narrowed eyes. “But isn’t it a rush? The kind that makes your heart jerk within your chest?”It was. Trapped by those onyx eyes, Seth felt vulnerable to the beast before him. And damned if he wasn’t hard as hell. His cock pressed adamantly against the fabric of his pants, and the feel of the cat lord’s nails moving over his carotid made him all the more aware of his racing pulse.“How much can you take?” Crnswar asked, leaning forward. “I think a great deal. I think that you are stronger than you know. You could stand for something, believe in something, be something, if only you knew what you wanted to become.”Seth knew little more than the shape of Crnswar’s mouth, the smooth, full lips, parted, succulent.“I doubt you know what you want, to be or otherwise. Am I wrong?”He didn’t have time to think, to ponder the question, because just then Crnswar gave him something that he realized he did want.Covering Seth’s lips with his own, the Basti lord claimed him. He possessed Seth’s mouth with a kiss that demanded submission, grasping the back of Seth’s closely shorn scalp and holding him in place for the assault.Seth couldn’t breathe, couldn’t even move. Crnswar had him by the waist, brought him flush against hard muscle. He could feel the iron-like hardness of the male’s cock prodding his stomach, smell nothing more than the heady, strong musk of the beast. There was little room for breathing, none for participation, and not even his tongue could evade being sucked between Crnswar’s lips.Crnswar took him as if he were a feast to be gorged upon, and he did not back down, not even after fangs drew blood and flavored both of their mouths.It was unlike any rush he had ever had, supernatural or no. Hell, Seth doubted that stealing the accursed Hope Diamond itself would have garnered such excitement as what ran lava-like in his veins. He was light-headed and liquid limbed, but he did not, could not fight the wanting for more.As far as his hands could dare, Seth gripped the cat lord’s waist and thought of never breathing again. If only he could have Crnswar’s tongue bathing with his in the pool of their saliva, hot and alive, then little else mattered.Just as the pressure threatened to build too high, dangerously high, Crnswar released him.Panting like a bellows fueling a forge, Seth noticed his own blood coloring Crnswar’s lips in a smear of crimson.",
  "genres": [
    "M M Romance",
    "Paranormal",
    "Shapeshifters",
    "Fantasy",
    "Romance",
    "Gay",
    "Paranormal Romance"
  ],
  "author": "Mya Lairis",
  "average_rating": "3.65",
  "url": "https://www.goodreads.com/book/show/10204995-thief-of-his-heart"
}