{
  "title": "The All-True Travels and Adventures of Lidie Newton",
  "description": "Six years after her Pulitzer Prize-winning best-seller, A Thousand Acres, and three years after her witty, acclaimed, and best-selling novel of academe, Moo, Jane Smiley once again demonstrates her extraordinary range and brilliance.Her new novel, set in the 1850s, speaks to us in a splendidly quirky voice--the strong, wry, no-nonsense voice of Lidie Harkness of Quincy, Illinois, a young woman of courage, good sense, and good heart. It carries us into an America so violently torn apart by the question of slavery that it makes our current political battlegrounds seem a peaceable kingdom.Lidie is hard to scare. She is almost shockingly alive--a tall, plain girl who rides and shoots and speaks her mind, and whose straightforward ways paradoxically amount to a kind of glamour. We see her at twenty, making a good marriage--to Thomas Newton, a steady, sweet-tempered Yankee who passes through her hometown on a dangerous mission. He belongs to a group of rashly brave New England abolitionists who dedicate themselves to settling the Kansas Territory with like-minded folk to ensure its entering the Union as a Free State.Lidie packs up and goes with him. And the novel races alongside them into the Territory, into the maelstrom of \"Bloody Kansas,\" where slaveholding Missourians constantly and viciously clash with Free Staters, where wandering youths kill you as soon as look at you--where Lidie becomes even more fervently abolitionist than her husband as the young couple again and again barely escape entrapment in webs of atrocity on both sides of the great question.And when, suddenly, cold-blooded murder invades her own intimate circle, Lidie doesn't falter. She cuts off her hair, disguises herself as a boy, and rides into Missouri in search of the killers--a woman in a fiercely male world, an abolitionist spy in slave territory. On the run, her life threatened, her wits sharpened, she takes on yet another identity--and, in the very midst of her masquerade, discovers herself.Lidie grows increasingly important to us as we follow her travels and adventures on the feverish eve of the War Between the States. With its crackling portrayal of a totally individual and wonderfully articulate woman, its storytelling drive, and its powerful recapturing of an almost forgotten part of the American story, this is Jane Smiley at her enthralling and enriching best.",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Westerns",
    "Historical",
    "Novels",
    "Adventure",
    "Book Club"
  ],
  "author": "Jane Smiley",
  "average_rating": "3.58",
  "url": "https://www.goodreads.com/book/show/32096.The_All_True_Travels_and_Adventures_of_Lidie_Newton"
}