{
  "title": "The Brother Gardeners: Botany, Empire and the Birth of an Obsession",
  "description": "One January morning in 1734, cloth merchant Peter Collinson hurried down to the docks at London’s Custom House to collect cargo just arrived from John Bartram, his new contact in the American colonies. But it was not reels of wool or bales of cotton that awaited him, but plants and seeds…Over the next forty years, Bartram would send hundreds of American species to England, where Collinson was one of a handful of men who would foster a national obsession and change the gardens of Britain forever, introducing lustrous evergreens, fiery autumn foliage and colourful shrubs. They were men of wealth and taste but also of knowledge and experience like Philip Miller, author of the bestselling Gardeners Dictionary, and the Swede Carl Linnaeus, whose standardised botanical nomenclature popularised botany as a genteel pastime for the middle-classes; and the botanist-adventurer Joseph Banks and his colleague Daniel Solander who both explored the strange flora of Tahiti and Australia on the greatest voyage of discovery of modern times, Captain Cook’s Endeavour.This is the story of these men – friends, rivals, enemies, united by a passion for plants – whose correspondence, collaborations and squabbles make for a riveting human tale which is set against the backdrop of the emerging empire, the uncharted world beyond and London as the capital of science. From the scent of the exotic blooms in Tahiti and Botany Bay to the gardens at Chelsea and Kew, and from the sounds and colours of the streets of the City to the staggering vistas of the Appalachian mountains, The Brother Gardeners tells the story of how Britain became a nation of gardeners.",
  "genres": [
    "History",
    "Nonfiction",
    "Gardening",
    "Nature",
    "Science",
    "Biography",
    "Plants"
  ],
  "author": "Andrea Wulf",
  "average_rating": "4.21",
  "url": "https://www.goodreads.com/book/show/3209054-the-brother-gardeners"
}