{
  "title": "Bang Gang",
  "description": "It’s one thing knowing your ex-boyfriend is a bit of a player, but it’s another thing altogether to find out he’s pimping himself out to anyone who’ll pay good money for it.Not just himself, either. That would be far too regular for Darren Trent. Darren Trent – my teenage sweetheart and father to my two young girls – is not just whoring himself out. Oh no. Darren Trent pimps himself out alongside four of his mechanic friends – all of them at the same time. Five hot, sweaty mechanics at your service.They call themselves the Bang Gang… you can imagine. In a village our size I should keep my head down and hope the scandal blows over before the girls or my poor old Nanna catch wind of it. Only it’s not blowing over. Far from it. It seems every woman in the village wants themselves a five-mechanic sandwich.They make no qualms about it, either. Just rock on up to my café counter and ask how they can book themselves in for a Bang Gang special. Like I would know. I definitely wouldn’t know. I hardly even know Darren Trent anymore. We split up a lifetime ago.I definitely don’t think about him late at night. Don’t think about five mechanics and me as much as every other woman in this village. And even if I did, I wouldn’t act on it. I wouldn’t draw the money from my savings account and have a go for myself.And even if I did that, I definitely, definitely wouldn’t fall for him. Not again. Not after everything we went through. Not after splitting up the first time nearly brought me to my knees.Not after settling into a decent routine, the girls and me, with no drama, no heartbreak, no crazy passions to rock the calm little boat we’re sailing on. I mean, who would be stupid enough to risk all that over a hot, sweaty, oily bit of rough like Darren Trent?",
  "genres": [
    "Romance",
    "Menage",
    "Erotica",
    "Second Chance",
    "Contemporary",
    "Second Chance Romance",
    "Reverse Harem"
  ],
  "author": "Jade West",
  "average_rating": "3.97",
  "url": "https://www.goodreads.com/book/show/32079766-bang-gang"
}