{
  "title": "Belvedor and the Four Corners",
  "description": "HEALER. CREATOR. AGRARIAN. WARRIOR.—Welcome to the Four Corners—Arianna Belvedor has never known a world outside of this cold and cruel region, but she’s always dreamed of the freedom beyond. Per the King’s decree to weed out the weak, all children must excel in one of four special skills and survive a rigorous test to earn citizenship—win or die.As #22 of Warrior’s District, Arianna has become notable with her swords. She’s confident she’ll survive the ultimate battle. But everything changes when she learns a secret about King Devlindor’s long-standing reign… before these dark times, the world had been filled with magic.There had once been a thriving Golden Age where magic was for all to claim. Dwarves, mermaids, elves, and even dragons roamed the land. Then, the King’s greed and iron grip thrust the world into darkness.Arianna must now make a choice: ignore the enchanted truth and abide by the King’s laws or use her swords to carve out a new path to freedom.Does she have what it takes to follow the magic?__________________________The Belvedor Saga is a completed YA Epic Fantasy Adventure series—perfect for fans of the Throne of Glass series by Sarah J. Maas.The third edition of Belvedor and the Four Corners was released in October 2020, with added and expanded scenes!Note from the author:Arianna Belvedor is a heroine you will love to follow, but she’s not one to give her heart away easily. Don’t expect much romance on this daring quest—her magic comes from within.__________________________\"Belvedor and the Four Corners is a great read! It's one of those books that will keep you hooked till the end. It's up there with The Hunger Games and Harry Potter with its combination of the magical world and the fight for your life. I can't wait to see what happens the rest of the series.\" - From Nikola ★★★★★\"It's a novel filled with magic, sorcery, swords, bows and arrows, knives, magical creatures, oppression, freedom, and pure excitement ... I'm in love with all the main characters. Ms. Bello takes you on a remarkable adventure and you'll wish for more...” - From PixiePassion ★★★★★Read all the Belvedor Books!\nThe Belvedor Saga by Ashleigh Bello\nBelvedor and the Four CornersBelvedor and the King’s CurseBelvedor and the Desert of SecretsBelvedor and the Trail of FireBelvedor and the Golden Rule",
  "genres": [
    "Fantasy",
    "Young Adult",
    "Romance",
    "Magic",
    "Ghosts",
    "Adult",
    "Dystopia"
  ],
  "author": "Ashleigh Bello",
  "average_rating": "4.10",
  "url": "https://www.goodreads.com/book/show/32079337-belvedor-and-the-four-corners"
}