{
  "title": "The Fact of a Body: A Murder and a Memoir",
  "description": "Before Alex Marzano-Lesnevich begins a summer job at a law firm in Louisiana, working to help defend men accused of murder, they think their position is clear. The child of two lawyers, they are staunchly anti-death penalty. But the moment convicted murderer Ricky Langley’s face flashes on the screen as they review old tapes—the moment they hear him speak of his crimes -- they are overcome with the feeling of wanting him to die. Shocked by their reaction, they dig deeper and deeper into the case. Despite their vastly different circumstances, something in his story is unsettlingly, uncannily familiar.Crime, even the darkest and most unsayable acts, can happen to any one of us. As Alex pores over the facts of the murder, they find themself thrust into the complicated narrative of Ricky’s childhood. And by examining the details of Ricky’s case, they are forced to face their own story, to unearth long-buried family secrets, and reckon with a past that colors their view of Ricky's crime.But another surprise awaits: They weren’t the only one who saw their life in Ricky’s.An intellectual and emotional thriller that is also a different kind of murder mystery, THE FACT OF A BODY is a book not only about how the story of one crime was constructed -- but about how we grapple with our own personal histories. Along the way it tackles questions about the nature of forgiveness, and if a single narrative can ever really contain something as definitive as the truth. This groundbreaking, heart-stopping work, ten years in the making, shows how the law is more personal than we would like to believe -- and the truth more complicated, and powerful, than we could ever imagine.",
  "genres": [
    "Nonfiction",
    "True Crime",
    "Memoir",
    "Crime",
    "Audiobook",
    "Mystery",
    "Biography"
  ],
  "author": "Alexandria Marzano-Lesnevich",
  "average_rating": "3.80",
  "url": "https://www.goodreads.com/book/show/32076678-the-fact-of-a-body"
}