{
  "title": "A Primer on Samatha Meditation",
  "description": "2,500 years ago, aspiring meditators had to scale treacherous mountains to find a guru who might guide them to spiritual awakening. Today’s spiritual practitioners have a much different The marketplace is supersaturated with books, blogs, teachers, centers, and workshops—all who seem to champion a proprietary set of authentic meditative practices. With a limited amount of time, money, and energy, how is anyone supposed to know how to take the first steps? A Primer on Samatha Meditation offers a solution to this unique problem. This short guide is provided to help aspiring mystics take the initial steps on the path to awakening, healing, and quite often, both. Whether this is your first time on a meditation cushion or you have previously experimented with meditation (but aren’t sure if you’re doing it “right”), this general map will quickly help you get your bearings. The primer • A history of the practice • A definition of samatha meditation • The purpose of the practice • Recommended resources • Technical instructions • An overview of predictable obstacles • Tips to advance in the practice • Resources for further study Kyle Parton has surveyed, deconstructed, and practiced the core meditative techniques found in the major spiritual traditions of the world. He’s boiled them down to the technical details that can be immediately and directly practiced—regardless of your religious tradition. You no longer need to be overwhelmed by the dozens of techniques and traditions available to you. While it’s true that a teacher is eventually needed to progress in meditative practice, this guide clarifies the specific preliminary steps you can take today. Take this helpful guide with you onto the meditation cushion as you establish (or repair) a solid foundation for your contemplative practice. It will serve as a sound companion until you find your guru at the top of whatever mountain you climb.",
  "genres": [
    "Spirituality"
  ],
  "author": "Kyle Parton",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/32089662-a-primer-on-samatha-meditation"
}