{
  "title": "All Creatures Great and Small / All Things Bright and Beautiful",
  "description": "The first two memoirs in the New York Times-bestselling series from an English veterinarian--and the basis for the Masterpiece series on PBS.All Creatures Great and Small: In the rolling dales of Yorkshire--a simple, rural region of Northern England--a young veterinarian from Sunderland joins a new practice. A stranger in an unfamiliar land, James Herriot must quickly learn the odd dialect and humorous ways of the locals, master outdated equipment, and do his best to mend, treat, and heal pets and livestock alike.All Things Bright and Beautiful: After his first day on the job, Herriot's mentor warns him that the life of a country veterinarian is full of small triumphs and big disasters, but that he'd never be bored. From night visits to drafty barns during freezing Northern England winters to the beautiful vitality of rural life in the summertime to the colorful menagerie of animals--and their owners--that pass through his office, Herriot experiences new challenges and joys every day. In these pages, Herriot trains under his eccentric boss in a rustic English village, courts the woman that becomes his wife, and meets the people he would come to write about for a lifetime.This witty and heartwarming collection, based on the author's own experiences, became an international success, winning over animal lovers everywhere. Perhaps better than any other writer, Herriot reveals the ties that bind us to the creatures in our lives.Praise for All Creatures Great and Small: \"One of the funniest and most likeable books around.\" --The Atlantic\"Refreshingly original . . . Hilarious, touching, athletic and warming . . . Dr. Herriot's characters . . . rival any from British fiction.\" ―Los Angeles Times",
  "genres": [
    "Nonfiction",
    "Classics",
    "Animals",
    "Memoir",
    "Biography",
    "Humor",
    "Biography Memoir"
  ],
  "author": "James Herriot",
  "average_rating": "4.34",
  "url": "https://www.goodreads.com/book/show/32087.All_Creatures_Great_and_Small_All_Things_Bright_and_Beautiful"
}