{
  "title": "Venetia",
  "description": "Twenty-five-year-old Venetia Lanyon's beauty is rivaled only by her sensibility. Intelligent and independent, her future seems safe and predictable. Lovely Venetia despairs of ever meeting the handsome hero of her romantic dreams but is nearly resigned to spinsterhood, thanks to the enormous amount of responsibility she inherited with a Yorkshire estate and an invalid but precocious brother, Aubrey. She lives in comfortable seclusion in rural Yorkshire, she has never been further than Harrogate, nor enjoyed the lackluster attentions of any but her two wearisomely persistent suitors. She can not accept to marry the respectable but dull Edward Yardley - she will only marry for love.Then her long-absent neighbor, thirty-eight-year-old Lord Jasper Damerel, returns home to Yorkshire. In one extraordinary encounter, she meets the infamous neighbor, who she knows only by reputation - a gamester, a shocking rake, and a man of sadly unsteady character - and before she knows better, she finds friendship with a libertine whose way of life has scandalised the North Riding for years. Lord Damerel finds Venetia to be the most truly engaging and wittily perverse female he has encountered in all his life and determined to woo and win her, he pursues her with a passionate abandon that is soon the talk of the ton. And after her encounter with the dashing, dangerous rake, Venetia's well-ordered life is turned upside down, and she embarks upon a courtship with him that scandalises and horrifies the whole community.But Venetia has no intention of losing her heart to the rakish lord until she is sure that beneath his swashbuckling ways and shocking manners lies a tender heart belonging to her. And Lord Damerel would marry her in a heartbeat if he did not think it would ruin her. Then she discovers a shocking family secret that changes everything ... It was therefore particularly provoking to find that occasion, Lord Damerel could make up his mind to be idiotically noble....",
  "genres": [
    "Romance",
    "Historical Fiction",
    "Historical Romance",
    "Regency",
    "Historical",
    "Fiction",
    "Classics"
  ],
  "author": "Georgette Heyer",
  "average_rating": "4.11",
  "url": "https://www.goodreads.com/book/show/32102.Venetia"
}