{
  "title": "The Case against Perfection: Ethics in the Age of Genetic Engineering",
  "description": "Listen to a short interview with Michael SandelHost: Chris Gondek | Producer: Heron & Crane Breakthroughs in genetics present us with a promise and a predicament. The promise is that we will soon be able to treat and prevent a host of debilitating diseases. The predicament is that our newfound genetic knowledge may enable us to manipulate our nature--to enhance our genetic traits and those of our children. Although most people find at least some forms of genetic engineering disquieting, it is not easy to articulate why. What is wrong with re-engineering our nature? The Case against Perfection explores these and other moral quandaries connected with the quest to perfect ourselves and our children. Michael Sandel argues that the pursuit of perfection is flawed for reasons that go beyond safety and fairness. The drive to enhance human nature through genetic technologies is objectionable because it represents a bid for mastery and dominion that fails to appreciate the gifted character of human powers and achievements. Carrying us beyond familiar terms of political discourse, this book contends that the genetic revolution will change the way philosophers discuss ethics and will force spiritual questions back onto the political agenda. In order to grapple with the ethics of enhancement, we need to confront questions largely lost from view in the modern world. Since these questions verge on theology, modern philosophers and political theorists tend to shrink from them. But our new powers of biotechnology make these questions unavoidable. Addressing them is the task of this book, by one of America's preeminent moral and political thinkers.",
  "genres": [
    "Philosophy",
    "Nonfiction",
    "Science",
    "Genetics",
    "Politics",
    "Biology",
    "Law"
  ],
  "author": "Michael J. Sandel",
  "average_rating": "3.83",
  "url": "https://www.goodreads.com/book/show/320993.The_Case_against_Perfection"
}