{
  "title": "How to Have Confidence and Power in Dealing with People",
  "description": "“Si no utiliza su sonrisa más a menudo, usted es como aquel millonario que tiene millones de dólares en el banco pero no tiene ninguna chequera para sacar provecho de su dinero”. Hace más de 50 años, Les Giblin nos enseñó cómo mediante el sabio manejo de los principios básicos del comportamiento humano es viable asegurar el éxito en el mundo profesional, —y en cualquier faceta de la vida. En la actualidad, como miles de lectores lo afirman, su filosofía es más vigente hoy que nunca antes. En este valioso libro el lector hallará acertadas técnicas para desarrollar confianza en sus relaciones interpersonales, de negocios y sociales, las cuales van desde pequeños trucos de lenguaje corporal que rara vez notamos en nosotros mismos (pero casi siempre en los demás) hasta el acertado manejo de sus mejores habilidades. Cómo tener confianza y seguridad en las relaciones interpersonales le ayuda a obtener lo que usted en realidad necesita y quiere en el trato con quienes le rodean de manera íntegra y sin complicaciones. Las técnicas probadas de Les Giblin le enseñarán cómo:    Descubrir los secretos esenciales que se encuentran en la naturaleza humana para influenciar a los demás.   Controlar las actitudes y expectativas de otros a través de su comportamiento.  Desarrollar tres de los secretos más efectivos para atraer a la gente.    Considerado uno de los pioneros de la industria del desarrollo personal, Leslie T. Giblin fue premiado como Vendedor Nacional del Año en 1965 y en 1968 escribió su clásico Skill With People. Trascendiendo generaciones, el mensaje siempre vigente de Les Giblin acerca de tener “don de gentes” como una de las habilidades esenciales para la vida adquiere un nuevo significado en esta era de comunicación impersonal.",
  "genres": [
    "Self Help",
    "Business",
    "Nonfiction",
    "Communication",
    "Psychology",
    "Personal Development",
    "Leadership"
  ],
  "author": "Les Giblin",
  "average_rating": "4.27",
  "url": "https://www.goodreads.com/book/show/320817.How_to_Have_Confidence_and_Power_in_Dealing_with_People"
}