{
  "title": "Paul Revere's Ride",
  "description": "Paul Revere's midnight ride is a legendary event in American history - yet it has been largely ignored by scholars, and left to patriotic writers and debunkers. Now one of the foremost American historians offers the first serious study of this event - what led to it, what really happened, what followed - uncovering a truth more remarkable than the many myths it has inspired. In Paul Revere's Ride, David Hackett Fischer has created an exciting narrative that offers new insight into the coming of the American Revolution. From research in British and American archives, the author unravels a plot that no novelist would dare invent - a true story of high drama and deep suspense, of old-fashioned heroes and unvarnished villains, of a beautiful American spy who betrayed her aristocratic British husband, of violent mobs and marching armies, of brave men dying on their doorsteps, of high courage, desperate fear, and the destiny of nations. The narrative is constructed around two thematic lines. One story centers on the American patriot Paul Revere; the other, on British General Thomas Gage. Both were men of high principle who played larger roles than recent historiography has recognized. Thomas Gage was not the Tory tyrant of patriot legend, but an English Whig who believed in liberty and the rule of law. In 1774 and 1775, General Gage's advice shaped the fatal choices of British leaders, and his actions guided the course of American events. Paul Revere was more than a \"simple artizan, \" as his most recent biographer described him fifty years ago. The author presents new evidence that revolutionary Boston was a world of many circles - more complex than we have known. Paul Revere and his friend Joseph Warren ranged more widely through those circles than any other leaders. They became the linchpins of the Whig movement. On April 18th, 1775, Paul Revere played that role in a manner that has never been told before. He and William Dawes were not the only midnight riders to ca",
  "genres": [
    "History",
    "American History",
    "American Revolution",
    "Nonfiction",
    "Biography",
    "American Revolutionary War",
    "War"
  ],
  "author": "David Hackett Fischer",
  "average_rating": "4.15",
  "url": "https://www.goodreads.com/book/show/32080.Paul_Revere_s_Ride"
}