{
  "title": "How to Bake: Complete Guide to Perfect Cakes, Cookies, Pies, Tarts, Breads, Pizzas, Muffins,",
  "description": "How To Bake is as necessary and essential as a good oven; it is the most comprehensive and accessible guide to baking available in English. In a single, illustrated volume, Nick Malgieri, one of America's preeminent bakers and baking teachers, leads cooks through the simple art of creating an international assortment of delicious sweet and savory baked goods. Here are the best recipes for breads, including such quick ones as Buttermilk Corn Bread, Irish Soda Bread, Classic Southern Biscuits, and Currant Tea Scones, as well as such delicious yeast-risen breads as Italian Bread Rings, Swiss Rye Bread, Challah, and English Muffins. Malgieri also offers recipes for savory treats like Old-Fashioned Chicken Pie, Pepper and Onion Frittata Tart, Cheese Quiche, and Rosemary Focaccia; and for sweet pastries ranging from puff pastries--Apple Turnovers, Banana Feuilletés with Caramel Sauce, Brioches, Strawberry Savarin, and Croissants--to pies and tarts, cobblers, and cookies of every stripe--drop, bar, rolled, and filled; brownies, macaroons, and rugelach. Cakes, too, are here, from layered to rolled, from angel to devil's food. The recipes in How to Bake are clear and methodical. Master recipes explain all the steps to making a classic dish. They are frequently followed by creative variations so that the baker's palate and skills will always be accommodated and challenged. Start out with a simple spice cake, for example, and transform it, under Malgieri's reassuring guidance, into a lavishly decorated celebration cake. In addition to an exhaustive and tempting selection of recipes, Malgieri offers clear, detailed instructions, interweaving techniques and helpful how to make a pastry bag out of parchment paper; what baking pans to buy; mastering pie and cake toppings; learning to decorate a cake so it looks as if it came from the bakery; and scores of other helpful tips. All this is punctuated with precise explanatory illustrations and thirty-two pages of luscious color photographs to inspire and guide the baker. How to Bake is a one-volume \"bible\" for bakers.",
  "genres": [
    "Cookbooks",
    "Cooking",
    "Nonfiction",
    "Food",
    "Reference"
  ],
  "author": "Nick Malgieri",
  "average_rating": "4.16",
  "url": "https://www.goodreads.com/book/show/119745.How_to_Bake"
}