{
  "title": "Nightmare Town: Stories",
  "description": "Introduced by Colin Dexter, one of England's greatest writers of detective fiction, here are twenty long-unavailable stories by Dashiell Hammett, the author of The Maltese Falcon and one of the finest writers of the twentieth century.In the title story, a man on a bender enters a small town and ends up unravelling the dark mystery at its heart. A woman confronts the brutal truth about her husband in the chilling story, The Ruffian's Wife. His Brother's Keeper is a half-wit boxer's eulogy to the brother who betrayed him. The Second Story Angel recounts one of the most novel cons ever devised. In seven stories, the tough and taciturn Continental Op takes on a motley collection of the deceitful, the duped, and the dead, and once again shown his uncanny ability to get at the truth. In three stories, Sam Spade confronts the darkness in the human soul while rolling his own cigarettes. And the first study for The Thin Man sends John Guild on a murder investigation in which almost every witness may be lying.In Nightmare Town, Dashiell Hammett, America's poet laureate of the dispossessed, shows us a world where people confront a multitude of evils. Whether they are trying to right wrongs or just trying to survive, all of them are rendered with Hammett's signature gifts for sharp-edged characters and blunt dialogue.Hammett said that his ambition was to elevate mystery fiction to the level of art. This collection of masterful stories clearly illustrates Hammett's success, and shows the remarkable range and variety of the fiction he produced.As a novelist of realistic intrigue, Hammett was unsurpassed in his own or any day. - Ross MacDonaldA legend of a different kind: exemplary, not only of a certain kind of American fiction, but also of a certain kind of American life - Margaret AtwoodCover photograph: Mark Adams",
  "genres": [
    "Mystery",
    "Fiction",
    "Short Stories",
    "Noir",
    "Crime",
    "Detective",
    "Hard Boiled"
  ],
  "author": "Dashiell Hammett",
  "average_rating": "4.05",
  "url": "https://www.goodreads.com/book/show/321270.Nightmare_Town"
}