{
  "title": "Athens Burning: The Persian Invasion of Greece and the Evacuation of Attica",
  "description": "The gripping story of how the Athenians survived the Persian invasion of their homeland—one of the central events in ancient Greek history.Winner of the CHOICE Outstanding Academic Title of the Choice ACRLBetween June 480 and August 479 BC, tens of thousands of Athenians evacuated, following King Xerxes’ victory at the Battle of Thermopylae. Abandoning their homes and ancestral tombs in the wake of the invading Persian army, they sought refuge abroad. Women and children were sent to one safe haven, the elderly to another, while all men of military age were conscripted into the fleet. During this difficult year of exile, the city of Athens was set on fire not once, but twice. In Athens Burning, Robert Garland explores the reasons behind the decision to abandon Attica, the peninsular region of Greece that includes Athens, while analyzing the consequences, both material and psychological, of the resulting invasion.Garland introduces readers to the contextual background of the Greco-Persian wars, which include the famous Battle of Marathon. He describes the various stages of the invasion from both the Persian and Greek point of view and explores the siege of the Acropolis, the defeat of the Persians first by the allied Greek navy and later by the army, and, finally, the return of the Athenians to their land.Taking its inspiration from the sufferings of civilians, Athens Burning also works to dispel the image of the Persians as ruthless barbarians. Addressing questions that are largely ignored in other accounts of the conflict, including how the evacuation was organized and what kind of facilities were available to the refugees along the way, Garland demonstrates the relevance of ancient history to the contemporary world. This compelling story is especially resonant in a time when the news is filled with the suffering of nearly 5 million people driven by civil war from their homes in Syria. Aimed at students and scholars of ancient history, this highly accessible book will also fascinate anyone interested in the burgeoning fields of refugee and diaspora studies.",
  "genres": [
    "History",
    "Greece",
    "Nonfiction",
    "War"
  ],
  "author": "Robert Garland",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/32139850-athens-burning"
}