{
  "title": "The Essential Tales and Poems",
  "description": "\"The Essential Tales and Poems of Edgar Allan Poe,\" by Edgar Allan Poe, is part of the \"Barnes & Noble Classics\"\" \"series, which offers quality editions at affordable prices to the student and the general reader, including new scholarship, thoughtful design, and pages of carefully crafted extras. Here are some of the remarkable features of \"Barnes & Noble Classics\" New introductions commissioned from today's top writers and scholars Biographies of the authors Chronologies of contemporary historical, biographical, and cultural events Footnotes and endnotes Selective discussions of imitations, parodies, poems, books, plays, paintings, operas, statuary, and films inspired by the work Comments by other famous authors Study questions to challenge the reader's viewpoints and expectations Bibliographies for further reading Indices & Glossaries, when appropriateAll editions are beautifully designed and are printed to superior specifications; some include illustrations of historical interest. \"Barnes & Noble Classics \"pulls together a constellation of influences--biographical, historical, and literary--to enrich each reader's understanding of these enduring works. Creator of the modern detective story, innovative architect of the horror genre, and a poet of extraordinary musicality, Edgar Allan Poe remains one of America's most popular and influential writers. His tales and poems brim with psychological depth, almost painful intensity, and unexpected--and surprisingly modern--flashes of dark humor and irony. This anthology offers an exceptionally generous selection of Poe's short stories. It includes his famed masterpieces, such as \"The Murders in the Rue Morgue\" and \"The Purloined Letter,\" featuring Poe's great detective, Dupin; his insightful studies of madness \"The Black Cat\" and \"The Tell-Tale Heart\"; \"The Gold-Bug,\" his delightful exercise in \"code-breaking\"; and important but lesser-known tales, such as \"Bon-Bon,\" \"The Assignation,\" and \"King Pest.\" Also included are some of Poe's most beloved poems, haunting lyrics of love and loss, such as \"Annabel Lee,\" nightmare phantasmagories such as \"The Raven,\" and his grand experiment in translating sound into words, \"The Bells.\"Benjamin F. Fisher, Professor of English, University of Mississippi, is a longtime enthusiast of the works of Poe. He has published books, articles, and notes about Poe, and in American, Victorian, and Gothic studies, and serves on editorial boards for several professional journals. He has also been acclaimed for outstanding teaching.",
  "genres": [
    "Classics",
    "Poetry",
    "Fiction",
    "Horror",
    "Short Stories",
    "Collections",
    "Literature"
  ],
  "author": "Edgar Allan Poe",
  "average_rating": "4.32",
  "url": "https://www.goodreads.com/book/show/3210711-the-essential-tales-and-poems"
}