{
  "title": "Cairo: My City, Our Revolution",
  "description": "Over the past few months I have delivered lectures, presentations and interviews on the Egyptian Revolution. I have had overflowing houses everywhere, been stopped by old ladies in the street and had my hand shaken by numerous taxi drivers and shopkeepers. And all because I'm Egyptian and the glitter of Tahrir is upon me. They wanted me to talk to them, to tell them stories about it, to tell them how, on the 28th of January when we took the Square and The People torched the headquarters of the hated ruling National Democratic Party, The (same) People formed a human chain to protect the Antiquities Museum and demanded an official handover to the military; to tell them how, on Wednesday, February 2nd, as The People defended themselves against the invading thug militias and fought pitched battles at the entrance to the Square in the shadow of the Antiquities Museum, The (same) People at the centre of the square debated political structures and laughed at stand-up comics and distributed sandwiches and water; to tell them of the chants and the poetry and the songs, of how we danced and waved at the F16s that our President flew over us. People everywhere want to make this Revolution their own, and we in Egypt want to share it. Ahdaf Soueif - novelist, commentator, activist - navigates her history of Cairo and her journey through the Revolution that's redrawing its future. Through a map of stories drawn from private history and public record Soueif charts a story of the Revolution that is both intimately hers and publicly Egyptian. Ahdaf Soueif was born and brought up in Cairo. When the Egyptian Revolution of 2011 erupted on January 25th, she, along with thousands of others, called Tahrir Square home for eighteen days. She reported for the world's media and did - like everyone else - whatever she could.",
  "genres": [
    "Nonfiction",
    "Egypt",
    "History",
    "Politics",
    "Memoir",
    "Africa",
    "Biography Memoir"
  ],
  "author": "Ahdaf Soueif",
  "average_rating": "3.84",
  "url": "https://www.goodreads.com/book/show/3213051-cairo"
}