{
  "title": "Mama's Babies",
  "description": "\"By the time I was nine years old I had begun to doubt that Mama Pratchett, the woman with whom I had lived for as long as I could remember, was in fact my mother...\" So begins Gary Crew's chilling fictionalized account of a \"baby farmer\" who, for profit, takes in unwanted children that later mysteriously disappear. Based on the facts revealed at the criminal trials of three women during the 1890s, Crew presents the story of young Sarah and her horrific realization. Sarah is the eldest child in the Pratchett family and finds herself treated more as a maid than as a daughter. She looks after her younger brothers and sisters -- all under the age of five -- cooking their meals, washing their diapers, and generally keeping them out of the way of Mama Pratchett. Mama is a stern woman and doesn't like children who are \"all full of beans.\" She guards her family closely from the prying eyes of strangers, moving from town to town every few months. Her meager earnings as a seamstress do little to keep the children fed and clothed, and they often go to bed with rumbling tummies, their mattresses padded with old newspaper to keep out the drafts. Mama, however, always seems to have enough for her own little luxuries. Sarah is made suspicious by the sudden appearance of a new baby following one of Mama's visits to the train station. Shortly afterwards, young Robbie, only a toddler himself, falls mysteriously ill and dies while Sarah and her siblings are away on a rare outing from the house. But Robbie is not the only child of Mama Pratchett's to disappear. With the help of her friend Will, Sarah finds the courage to testify in court against Mama Pratchett on the charge of murder. In a simple and telling introduction, Gary Crew describes the social background of the late-nineteenth century that led unwed mothers to give up their babies to unscrupulous strangers. Tragically, Crew's story is derived from real in the 1890s, Amelia Dyer in England, Minnie Dean in New Zealand, and Frances Knorr in Australia were sentenced to death for murder, following the testimony of teenage girls.",
  "genres": [
    "Historical Fiction",
    "Crime",
    "Fiction",
    "Young Adult",
    "Mystery"
  ],
  "author": "Gary Crew",
  "average_rating": "3.61",
  "url": "https://www.goodreads.com/book/show/321179.Mama_s_Babies"
}