{
  "title": "A Naked View of the Trans-Pacific Partnership: An Unbiased Informational Review in Plain English",
  "description": "The TPP is a free trade agreement between 12 counties within the Asia pacific region, and more importantly, excludes China and India (the two most populated nations on earth). The 12, clockwise from North America, are Canada, United States, Mexico, Peru, Chile, New Zealand, Australia, Brunei, Singapore, Malaysia, Vietnam and Japan. The TPP covers more elements than any other agreement, including key fields such as the environment, labor laws and corruption, as well as removing over 18,000 taxes and trade barriers on American products.The majority, if not all of the written material currently available on the TPP, being government reports, senate debates, discussion on business networks and other federal agencies, are not designed for the average American to study or understand. One example is the 788-page report published in May 2016 by the U.S. International Trade Commission. This is a great report for industry and trade professionals, however, the  Naked View of the Trans-Pacific Partnership  is written in plain English, to allow everyday business owners, executives, students, academics and any other interested party an opportunity to understand the largest international trade agreement in the history of the United States, and its impacts. The book travels from the beginning of trade, covering key moments in time, and how trade developed into the 21st century. Including free trade agreements, and how they have evolved over time, and how a simple bi-lateral agreement between Singapore and New Zealand, gave birth to the Trans-Pacific Partnership. A deep dive into specific industries including case studies on a few key companies. However, this book also includes view points from other key nations, both within the TPP group of countries, but also from China, a major exclusion within the TPP.The goal of this book is not to persuade the readers thinking, rather it is to educate and provide facts and opinions from all sides, with the goal to ensure the reader makes their own informed opinion, regardless if they decide to agree or oppose it.",
  "genres": [],
  "author": "Timothy Barnes",
  "average_rating": "4.33",
  "url": "https://www.goodreads.com/book/show/32163379-a-naked-view-of-the-trans-pacific-partnership"
}