{
  "title": "Chocolat",
  "description": "When the exotic stranger Vianne Rocher arrives in the old French village of Lansquenet and opens a chocolate boutique called “La Celeste Praline” directly across the square from the church, Father Reynaud identifies her as a serious danger to his flock. It is the beginning of Lent: the traditional season of self-denial. The priest says she’ll be out of business by Easter.To make matters worse, Vianne does not go to church and has a penchant for superstition. Like her mother, she can read Tarot cards. But she begins to win over customers with her smiles, her intuition for everyone’s favourites, and her delightful confections. Her shop provides a place, too, for secrets to be whispered, grievances aired. She begins to shake up the rigid morality of the community. Vianne’s plans for an Easter Chocolate Festival divide the whole community. Can the solemnity of the Church compare with the pagan passion of a chocolate éclair?For the first time, here is a novel in which chocolate enjoys its true importance, emerging as an agent of transformation. Rich, clever, and mischievous, reminiscent of a folk tale or fable, this is a triumphant read with a memorable character at its heart.Says Harris: “You might see [Vianne] as an archetype or a mythical figure. I prefer to see her as the lone gunslinger who blows into the town, has a showdown with the man in the black hat, then moves on relentless. But on another level she is a perfectly real person with real insecurities and a very human desire for love and acceptance. Her qualities too - kindness, love, tolerance - are very human.” Vianne and her young daughter Anouk, come into town on Shrove Tuesday. “Carnivals make us uneasy,” says Harris, “because of what they represent: the residual memory of blood sacrifice (it is after all from the word \"carne\" that the term arises), of pagan celebration. And they represent a loss of inhibition; carnival time is a time at which almost anything is possible.”The book became an international best-seller, and was optioned to film quickly. The Oscar-nominated movie, with its star-studded cast including Juliette Binoche (The English Patient) and Judi Dench (Shakespeare in Love), was directed by Lasse Hallstrom, whose previous film The Cider House Rules (based on a John Irving novel) also looks at issues of community and moral standards, though in a less lighthearted vein.The idea for the book came from a comment her husband made one day while he was immersed in a football game on TV. “It was a throwaway comment, designed to annoy and it did. It was along the lines of...Chocolate is to women what football is to men…” The idea stuck, and Harris began thinking that “people have these conflicting feelings about chocolate, and that a lot of people who have very little else in common relate to chocolate in more or less the same kind of way. It became a kind of challenge to see exactly how much of a story I could get which was uniquely centred around chocolate.” Rich with metaphor and gorgeous writing...sit back and gorge yourself on Chocolat.",
  "genres": [
    "Fiction",
    "Romance",
    "Magical Realism",
    "France",
    "Fantasy",
    "Contemporary",
    "Historical Fiction"
  ],
  "author": "Joanne Harris",
  "average_rating": "3.96",
  "url": "https://www.goodreads.com/book/show/321574.Chocolat"
}