{
  "title": "The Cook's Illustrated Guide To Grilling And Barbecue",
  "description": "The definitive grilling encyclopedia for novices and experts alikeThe Cook’s Illustrated Guide to Grilling and Barbecue is a comprehensive nuts and bolts volume that thoroughly examines outdoor cooking—starting with the basics. The 12-page introduction to grilling, \"Outdoor Cooking 101,\" walks you step-by-step through the essentials of grilling, grill-roasting, and barbecuing using both charcoal and gas grills. And since outdoor cooking requires just the right tools and equipment, the editors of Cook's Illustrated share the results of their product tests in an extensive buyers guide where charcoal grills, gas grills, grill brushes, tongs, instant-read thermometers, and more are rated. At a glance, you will know which brands we recommend (and why) and which to avoid. Armed with the right equipment and instructions, you’ll be ready to tackle just about any recipe from a simple and perfectly cooked burger to succulent pulled pork and restaurant-perfect grilled tuna. You’ll find more than 450 recipes for all your favorites—steak tips, ribs, and barbecued chicken as well as some that will expand your repertoire—from Thai-Grilled Chicken and Skirt Steak Tacos to Grilled Corn with Spicy Chili Butter and Bruschetta with Fresh Herbs.The Cook’s Illustrated Guide to Grilling and Barbecue also contains more than 300 step-by-step illustrations that walk you through the basics of food preparation, such as how to cut beef for kebabs, trim beef tenderloin, and grill-roast a turkey. Whether you’re a novice outdoor cook or aspiring grill-master, this encyclopedic examination of one of America’s favorite pastimes will be your guide to foolproof grilling and barbecuing.",
  "genres": [
    "Cookbooks",
    "Cooking",
    "Reference",
    "Food",
    "Nonfiction"
  ],
  "author": "Cook's Illustrated",
  "average_rating": "4.35",
  "url": "https://www.goodreads.com/book/show/32157.The_Cook_s_Illustrated_Guide_To_Grilling_And_Barbecue"
}