{
  "title": "Dangerous Grounds",
  "description": "Somethings hot in Seattle, and its not just the espresso.The Seattle Steam series. Madisons needs are simple. All she wants are two Make Ooo La Latt the newest trend in espresso, and seduce the sexiest cop in Seattle. But things arent going exactly as planned. First, Gabes a little hung up on the fact that shes his best friends little sister, and hes determined to keep his hands off. Second, her shop gets robbed by the increasingly violent Espresso Bandit, and now shes the only one who can identify him. Gabe whisks her into hiding for her own protection, but soon finds his heart is under assault by the lusciousand persistentMadison. But no matter where they hide, danger follows. On such dangerous grounds, the trick will be to live long enough to keep the flame alive.Excerpt. © Reprinted by permission. All rights reserved.It took almost another hour before she slipped into a light sleep, and instead of being comforted, she found herself reliving the robbery. Except this time, the robber pulled the trigger.She jerked upright with a cry, dragging the sheets around her. A moment later her door burst open and Gabe's silhouette filled the doorway.\"Maddie?\" He shut the door and came over to the bed. \"What's wrong? I heard you cry out.\"She turned her head away before he could see the shine of tears in her eyes.The dream had been too real.\"Did you dream about him?\" Gabe asked, his voice soft. \"It's all right, Maddie. It's normal. I haven't seen you break down once yet.\"\"I'm not the type to break down,\" she mumbled. She urged herself to regain control and not lose it. But the back of her throat burned from choking back the tears, and soon she stopped fighting.The tears ran down her cheeks and she kept her face averted, trying to hide them.\"Maddie...\" He pulled her unresisting body into his arms, sliding back against the bedpost to support them. She buried her head against his chest.\"It's just sexual tension combined with the post-traumatic stress.\" She tried to laugh and it came out choked. \"Nothing to worry about. It'd all go away if you'd just have sex with me.\"\"You don't need to make it a joke, Maddie,\" he murmured. \"It's nothing to be ashamed or embarrassed about.\"Wasn't it? She hated that she was crying on Gabe's shoulder. He was always so controlled and seemed so kept together. And now, in between pathetic attempts to seduce him, she sat here bawling her eyes out on his chest. His naked chest. Hmm. She hadn't noticed that before.She blinked the last of her tears away and became quite aware of the rapid pounding of Gabe's heart.Maybe he wasn't as controlled as he'd have her believe.She kept her head against his chest. \"You're not immune to me, Gabe.\"His hand that had been stroking her hair stilled, and then resumed its comforting movements.\"I never said I was.\"\"Then why--\"\"Just sleep, Maddie,\" he interrupted, his voice gentle. \"I'll stay here with you, if you'd like. But only to sleep.\"Madison considered her options. Having Gabe in bed with her would be a major temptation to attempt to seduce him again. It'd be better just to send him back to his own bed. But then the thought of being alone, with the possibility of more nightmares, made it an obvious choice.\"I'd like you to stay, and I promise not to touch you. Tonight. Deal?\"He gave a soft laugh and maneuvered them so that they were lying down next to each other.\"Deal.\"",
  "genres": [
    "Erotica",
    "Romantic Suspense",
    "Erotic Romance",
    "Suspense",
    "Mystery",
    "Amazon",
    "Fiction"
  ],
  "author": "Shelli Stevens",
  "average_rating": "3.72",
  "url": "https://www.goodreads.com/book/show/3216767-dangerous-grounds"
}