{
  "title": "Holly Anna Paladin Mysteries Book Bundle, Books 1-3: Plus a Bonus Christmas Novella!",
  "description": "The first three books in the Holly Anna Paladin mystery series, plus a bonus Christmas novella, all for the low price of $6.99!  Random Acts of Murder: When Holly Anna Paladin is given a year to live, she embraces her final days doing what she loves most—random acts of kindness. But one of her extreme good deeds goes horribly wrong, implicating Holly in a string of murders. Holly is suddenly in a different kind of fight for her life.  Only two other people know Holly was at the site of the murder, and one of them is the killer. Making matters stickier is the fact that the detective assigned to the case is her old high school crush and present day nemesis.  The clock is ticking as Holly is forced to play a dangerous game. Will Holly find the killer before he ruins what’s left of her life? Or will she spend her final days alone and behind bars?  Random Acts of Deceit: \"Break up with Chase Dexter, or I’ll kill him.”  Holly Anna Paladin never expected such a gut-wrenching ultimatum. But the man threatening her makes it clear he’s dead serious. With home invasions, hidden cameras, and bomb threats, Holly must make some serious choices.  Whatever Holly decides, the consequences will either break her heart or break her soul. She tries to match wits with the masked man, but he’s always a step ahead of her. The more she fights, the deeper she’s drawn into the perilous situation.  Dealing with the ultimatum, her sister’s wedding problems, and riots that have broken out in the city, Holly’s nearly at her breaking point. She must discover the identity of this mystery man before someone she loves dies. But the deceit is threatening to pull her under . . . six feet under.  Random Acts of Malice: When Holly Anna Paladin’s boyfriend, police detective Chase Dexter, says he’s leaving for two weeks and can’t give any details, she wants to trust him. But when she discovers Chase may be involved in some unwise and dangerous pursuits, she’s compelled to intervene.  Holly gets a run for her money as she’s swept into the world of horseracing. The stakes turn deadly when a dead body surfaces and suspicion is cast on Chase. At every turn, more trouble emerges, making Holly question what she holds true about her relationship and her future.  Just when she thinks she’s on the homestretch, a dark horse arises. Holly might lose everything in a nail-biting fight to the finish.  Random Acts of Scrooge: Christmas is supposed to be the most wonderful time of the year, but a real-life Scrooge is threatening to ruin the season’s good will.  Holly Anna Paladin can’t wait to celebrate Christmas with family and friends. She loves everything about the season—celebrating the birth of Jesus, singing carols, and baking Christmas treats, just to name a few. But when a local family needs help, how can she say no?  Holly’s community has come together to help raise funds to save the home of Greg and Babette Sullivan, but a Bah-Humburgler has snatched the canisters of cash. Holly and her boyfriend, police detective Chase Dexter, team up to catch the Christmas crook.  Will they succeed in collecting enough cash to cover the Sullivans’ overdue bills? Or will someone succeed in ruining Christmas for all those involved?",
  "genres": [
    "Christian Fiction",
    "Mystery"
  ],
  "author": "Christy Barritt",
  "average_rating": "4.56",
  "url": "https://www.goodreads.com/book/show/32162377-holly-anna-paladin-mysteries-book-bundle-books-1-3"
}