{
  "title": "Ghosts of the Golden Triangle",
  "description": "After Rigs infiltrated her former employer’s operations center, she found out she wasn’t alone… the hard way. Slicer heard the attack through the gang’s encrypted channel, but Rigs’ vitals had disappeared and there was nothing he could do to stop it. Next, the termination attempts on Eclipse came fast and furious. The gang had to hide or die alongside Rigs. Two years pass before one of them makes a lethal mistake. Now exposed to The Company’s vengeance, a murderous manhunt for the members of Eclipse begins. Things go from bad to much, much worse… quickly. What ensues is an unnerving, frightening look at our own bleak future. OUR WORLD— a dystopia where technological ghosts rule. Whether you’re new to Tales of Eclipse or a returning reader, grab your CaliCobra, plug in your P-Pin, and ride for ruin in the highly anticipated sequel to Ghosts of San Francisco. You won’t want to miss this exciting new novel from 2016 Silver Falchion Finalist & 2014 Dan Poynter’s Silver Medalist. As reality crumbles around them, Eclipse defies inevitable doom, fighting tooth and nail in the highly anticipated sequel to award-winning novel GHOSTS OF SAN FRANCISCO. It's a nail-biting follow up to Mord McGhee's intense, science fiction/horror thrill fest as the TALES OF ECLIPSE series resumes where readers left off. In Volume 2, author Mord McGhee has written a relentless, suspenseful adventure which chronicles an unprecedented apocalyptic war where technology trumps the supernatural. Inventive, unique, masterful prose, and scary insight into the human condition. Dark, futuristic landscapes set against the industrial past of Pittsburgh, Pennsylvania. It's not dystopia to think history will repeat itself.Tales of Eclipse Vol.2 picks up where Ghosts of San Francisco and Murder Red Ink leave off...",
  "genres": [],
  "author": "Mord McGhee",
  "average_rating": "4.71",
  "url": "https://www.goodreads.com/book/show/32181673-ghosts-of-the-golden-triangle"
}