{
  "title": "Looking for Lincoln: The Making of an American Icon",
  "description": "In honor of the bicentennial of Abraham Lincoln’s birth, an extensively researched, lavishly illustrated consideration of the myths, memories, and questions that gathered around our most beloved—and our most enigmatic—president in the years between his assassination and the dedication of the Lincoln Memorial in 1922. A sequel to the enormously successful Lincoln: An Illustrated Biography, Looking for Lincoln picks up where the previous book left off, examining how our sixteenth president’s legend came into being.Availing themselves of a vast collection of both published and never-before-seen materials, the authors—the fourth and fifth generations of a family of Lincoln scholars—bring into focus the posthumous portrait of Lincoln that took hold in the American imagination, becoming synonymous with the nation’s very understanding of itself. Told through the voices of those who knew the man—Northerners and Southerners, blacks and whites, neighbors and family members, adversaries and colleagues—and through stories carefully selected from long-forgotten newspapers, magazines, and family scrapbooks, Looking for Lincoln charts the dramatic epilogue to Lincoln’s extraordinary life when, in a process fraught with jealousy, greed, and the struggle for power, the scope of his historical significance was taking shape.In vibrant and immediate detail, the authors chart the years when Americans struggled to understand their loss and rebuild their country. Here is a chronicle of the immediate aftermath of the assassination; the private memories of those closest to the slain president; the difficult period between 1876 and 1908, when a tired nation turned its back on the former slaves and betrayed Lincoln’s teachings; and the early years of the twentieth century when Lincoln’s popularity soared as African Americans fought to reclaim the ideals he espoused.Looking for Lincoln will deeply enhance our understanding of the statesman and his legacy, at a moment when the timeless example of his leadership is more crucial than ever.",
  "genres": [
    "History",
    "Nonfiction",
    "Civil War",
    "Biography",
    "Presidents",
    "Historical",
    "American History"
  ],
  "author": "Philip B. Kunhardt III",
  "average_rating": "4.31",
  "url": "https://www.goodreads.com/book/show/3218735-looking-for-lincoln"
}