{
  "title": "Lockout",
  "description": "Over the Atlantic in the dark of night, the electronic brain of Pangia Airlines Flight 10 quietly and without warning disconnects all the cockpit controls and reverses course on its own.The crew of the huge Airbus 330 at first sense nothing, the flight displays still showing them on course to New York. But with puzzled passengers reporting stars on the wrong side and growing alarm over the sudden failure of all their radios – and when armed fighters pull alongside to force them to land – the confused pilots discover that Flight 10 is streaking back toward the hyper-volatile Middle East and there is nothing they can do about it.With an alphabet soup of federal agencies struggling for answers and messages flying between Washington, and Tel Aviv where the flight began, the growing supposition that Flight 10 may be hijacked is fueled by the presence of a feared and hated former head of state sitting in first class, a man with an extreme Mid East agenda who may somehow be responsible for the Airbus A-330’s loss of control. As frantic speculation spreads, the possibility that the unresponsive airliner could be the leading edge of a sophisticated attack on Iran designed to provoke a nuclear response drives increasingly desperate decisions.As time and fuel runs low, flying at full throttle toward a hostile border ahead, Captain Jerry Tollefson and First Officer Dan Horneman have to put their personal animosities aside and risk everything to wrest control from the electronic ghost holding them – and perhaps the world – on a course to certain disaster.And in the “Hole” – as the war room in Tel Aviv is called – the interim Prime Minister of Israel grapples with a horrifying choice in the balance between 300 airborne lives and the probability of nuclear war.",
  "genres": [
    "Thriller",
    "Fiction",
    "Mystery",
    "Aviation",
    "Mystery Thriller",
    "Audiobook",
    "Suspense"
  ],
  "author": "John J. Nance",
  "average_rating": "4.18",
  "url": "https://www.goodreads.com/book/show/32194838-lockout"
}