{
  "title": "Predators, Prey and Other Kinfolk: Growing Up in Polygamy",
  "description": "The abduction of teenager Elizabeth Smart by a fundamentalist Mormon preacher placed a renewed focus on renegade offshoots of the Church of Latter Day Saints and the culture surrounding the religion in the state of Utah (which, like the church, formally opposes polygamous marriage, though state and religious leaders both seem well aware that the practice continues, and they often turn a blind eye toward it). Like Natalie R. Collins's 2003 novel SisterWife, Dorothy Allred Solomon's Predators, Prey, and Other Kinfolk couldn't seem more topical, but it is an even more powerful book because it has the weight of truth behind it. \"I am the daughter of my father's fourth plural wife, twenty-eight of forty-eight childrena middle kid, you might say,\" her frank memoir begins, and Solomon (a freelance writer who now lives in a happily monogamous marriage in Park City, Utah) maintains a similarly gripping and poignant tone through the book. Her family's story is a fascinating one: Her father, the physician Rulon Allred, was also a fundamentalist preacher and a closet polygamist who went to great lengths to keep his plural marriages and sprawling family a secret from society at large. In 1977, he was shot to death by assassins from a rival fundamentalist sect, the bloody end to a misguided lifestyle that had already taken a severe emotional toll on many around him. His daughter does not hesitate to expose the violent and sexist behavior that permeates many of these cultish offshoots of the Mormon Church, but she does not reduce the believers to one-dimensional caricatures, either, and in the process of sharing a very personal tale, she often steps back to place it all in the much broader context of religion and society, charting the history of the Mormons and the contradictions between ideals and actions on the part of both church and state. --Jim DeRogatis",
  "genres": [
    "Memoir",
    "Nonfiction",
    "Cults",
    "Polygamy",
    "Religion"
  ],
  "author": "Dorothy Allred Solomon",
  "average_rating": "3.43",
  "url": "https://www.goodreads.com/book/show/11976890-predators-prey-and-other-kinfolk"
}