{
  "title": "Bad Play",
  "description": "Axel I’m a once-in-a-generation, super-star quarterback. Bad Plays? I don’t make bad plays.  But when Miranda Bach, a.k.a. ‘little Randy’, walks back into my life, my whole world changes in an instant. She was my best friend’s little sister. We practically grew up together.  But now that she’s standing in front of me with the same fiery-red-curls I remember and her sexy as hell yoga pants—she’s anything but ‘little Randy’ anymore. She’s a full grown woman.  And irresistible at that.  Now as my massage therapist, she’s the one in charge of getting me through an injury and back on the field. But when she puts her hands all over me, a million tempting emotions course through my body. Now I only want one thing  Her.  But this is a dangerous game we’re playing. If we get caught it’s a breach of both of our contracts.  Bad Plays? I’m starting to think this might be the worst play of all…  Miranda I never thought I’d see him again. The man who ushered me through my boy-crazed teenage years and countless nights of fantasies. He was everything a girl like me wanted.  And boy did I hate him.  His constant teasing and the way he called me ‘little Randy’ always had me in near tears. So you can imagine my racing heart when I saw him banging on my office door. Now I’m forced to confront all of my old teenage emotions again.  He still seems like the same old jerk I remember him being—arrogant, rude, and all he cares about is money. The last thing I need is to let feelings get involved. I’m a professional.  Sleeping with the league’s most famous quarterback would ruin my career.  Emotions? I’ll bury them deep and do whatever it takes to get the job done…  There’s no way in hell I’ll let Axel Montgomery ruin my life.  Bad Play is a full-length romance novel with a Happily-Ever-After and no cliffhanger. As a thank you to my readers, it comes with a free bonus novel—Fourth Down and Dirty. Because of the bonus novel, Bad Play will end at about the 50% mark on your reading device.",
  "genres": [
    "Football",
    "Sports",
    "Sports Romance",
    "Contemporary Romance"
  ],
  "author": "Kristen Flowers",
  "average_rating": "2.96",
  "url": "https://www.goodreads.com/book/show/32185592-bad-play"
}