{
  "title": "The Sound of Love",
  "description": "Be careful what you wish for!  What if the person you fell in love with is not the one you imagined, but you are too blind to realize you are only chasing an image, the mere \"sound of love\"? How long can you hold on to your values and beliefs when the world around you slowly shatters into pieces?   It is the nineties, the decade of boy bands. Every girl is in love with the Funky Guys, the most famous boy band of them all, dominating the charts worldwide.  Nina Bains is a normal schoolgirl from Southampton. She lives the life of every teenager going to school, hanging out with her friends and fantasizing about Chris Mulligan, one of the charismatic lead singers of the Funky Guys.  Until one day by sheer coincidence Nina has the chance to get to know Chris personally. They fall in love and their two worlds collide with such a force that Nina is knocked out of her everyday life before she even realizes what is happening. As she is drawn more and more into Chris' world, she suddenly finds herself on tour with a boy band phenomenon in a whirlwind of fancy hotels, tour buses, venues, fans, groupies and music. Soon she realizes all that glitters is not gold and she has to question everything she once believed in.  Will Nina survive life on the road? Is her love for Chris worth risking everything? And above all: Does Chris even understand the meaning of love?   \"The Sound of Love is not one of those stories about pure teenage love, this love story is dark, destructive, and definitely not innocent. And that’s why every girl, who dreams about a handsome guy from the poster in her bedroom has to read this book!\" - Dana Kaledin  **********  Author's note: The book contains some explicit scenes and is not intended for audiences under the age of 16.   < BOOK CAN BE READ AS STANDALONE>",
  "genres": [
    "Romance"
  ],
  "author": "Maria Watts",
  "average_rating": "3.84",
  "url": "https://www.goodreads.com/book/show/32185159-the-sound-of-love"
}