{
  "title": "The Rest I Will Kill: William Tillman and the Unforgettable Story of How a Free Black Man Refused to Become a Slave",
  "description": "A surprising work of narrative history and detection that illuminates one of the most daring―and long-forgotten―heroes of the Civil War. Independence Day, 1861. The schooner S. J. Waring sets sail from New York on a routine voyage to South America. Seventeen days later, it limps back into New York’s frenzied harbor with the ship's black steward, William Tillman, at the helm. While the story of that ill-fated voyage is one of the most harrowing tales of captivity and survival on the high seas, it has, almost unbelievably, been lost to history. Now reclaiming Tillman as the real American hero he was, historian Brian McGinty dramatically returns readers to that riotous, explosive summer of 1861, when the country was tearing apart at the seams and the Union army was in near shambles following a humiliating defeat at the First Battle of Bull Run. Desperate for good news, the North was soon riveted by reports of an incident that occurred a few hundred miles off the coast of New York, where the Waring had been overtaken by a marauding crew of Confederate privateers. While the white sailors became chummy with their Southern captors, free black man William Tillman was perfectly aware of the fate that awaited him in the ruthless, slave-filled ports south of the Mason-Dixon Line. Stealthily biding his time until a moonlit night nine days after the capture, Tillman single-handedly killed three officers of the privateer crew, then took the wheel and pointed it home. Yet, with no experience as a navigator, only one other helper, and a war-torn Atlantic seaboard to contend with, his struggle had just begun. It took five perilous days at sea―all thrillingly recounted here―before the Waring returned to New York Harbor, where the story of Tillman's shipboard courage became such a tabloid sensation that he was not only put on the bill of Barnum’s American Museum but also proclaimed to be the \"first hero\" of the Civil War. As McGinty evocatively shows, however, in the horrors of the war then engulfing the nation, memories of his heroism―even of his identity―were all but lost to history. As such, The Rest I Will Kill becomes a thrilling and historically significant work, as well as an extraordinary journey that recounts how a free black man was able to defy efforts to make him a slave and become an unlikely glimmer of hope for a disheartened Union army in the war-battered North. 8 pages of illustrations",
  "genres": [
    "Nonfiction",
    "History",
    "African American",
    "Civil War",
    "Military Fiction",
    "War",
    "American Civil War"
  ],
  "author": "Brian McGinty",
  "average_rating": "3.48",
  "url": "https://www.goodreads.com/book/show/32191720-the-rest-i-will-kill"
}