{
  "title": "We the Corporations: How American Businesses Won Their Civil Rights",
  "description": "We the Corporations chronicles the astonishing story of one of the most successful yet least well-known “civil rights movements” in American history. Hardly oppressed like women and minorities, business corporations, too, have fought since the nation’s earliest days to gain equal rights under the Constitution—and today have nearly all the same rights as ordinary people.Exposing the historical origins of Citizens United and Hobby Lobby, Adam Winkler explains how those controversial Supreme Court decisions extending free speech and religious liberty to corporations were the capstone of a centuries-long struggle over corporate personhood and constitutional protections for business. Beginning his account in the colonial era, Winkler reveals the profound influence corporations had on the birth of democracy and on the shape of the Constitution itself. Once the Constitution was ratified, corporations quickly sought to gain the rights it guaranteed. The first Supreme Court case on the rights of corporations was decided in 1809, a half-century before the first comparable cases on the rights of African Americans or women. Ever since corporations have waged a persistent and remarkably fruitful campaign to win an ever-greater share of individual rights.Although corporations never marched on Washington, they employed many of the same strategies of more familiar civil rights struggles: civil disobedience, test cases, and novel legal claims made in a purposeful effort to reshape the law. Indeed, corporations have often been unheralded innovators in constitutional law, and several of the individual rights Americans hold most dear were first secured in lawsuits brought by businesses.Winkler enlivens his narrative with a flair for storytelling and a colorful cast of characters: among others, Daniel Webster, America’s greatest advocate, who argued some of the earliest corporate rights cases on behalf of his business clients; Roger Taney, the reviled Chief Justice, who surprisingly fought to limit protections for corporations—in part to protect slavery; and Roscoe Conkling, a renowned politician who deceived the Supreme Court in a brazen effort to win for corporations the rights added to the Constitution for the freed slaves. Alexander Hamilton, Teddy Roosevelt, Huey Long, Ralph Nader, Louis Brandeis, and even Thurgood Marshall all played starring roles in the story of the corporate rights movement.In this heated political age, nothing can be timelier than Winkler’s tour de force, which shows how America’s most powerful corporations won our most fundamental rights and turned the Constitution into a weapon to impede the regulation of big business.",
  "genres": [
    "Nonfiction",
    "History",
    "Politics",
    "Law",
    "Business",
    "Economics",
    "American History"
  ],
  "author": "Adam Winkler",
  "average_rating": "4.17",
  "url": "https://www.goodreads.com/book/show/32191667-we-the-corporations"
}