{
  "title": "The History of New Innovations in Modern Medicine",
  "description": "Throughout history, people in general have had a hard time accepting new ideas or unusual theories, or anything contrary to modern orthodox thought. Whether it is the stubbornness of man, angry at something he doesn't know- or understand-or his hatred towards things that are new , foreign or unprofitable, the results can often be disastrous. For example, Philo Farnsworth, born in 1906, invented the television, contributing to the designs that are visible in shops today. When the president of RCA offered to buy his patents for $100,000, Farnsworth refused. Consequently, a long and lengthy legal battle ensued with RCA and other seeking his patents, which ultimately led to his belongings repossessed: the IRS locking him out of his lab for unpaid taxes; depression; alcohol abuse; and, finally, death from pneumonia on March 11, 1971.Another example is Galileo, an Italian astronomer, engineer and philosopher whose theories were at odds with the authorities of his time. In Rome, 1615 AD, the \"Roman Inquisition\" tried him and found him \"vehemently suspect of heresy.\" Once they forced Galileo to recant, he was forced to spend the rest of his life under house arrest until his death in 1642.In the same way, not much has changed with medical \"heretics\" who dare to question the status quo of traditional medical thought.In \"The History of New Innovations in Modern Medicine\" this same \"rein of terror\" is exposed involving the medical community going all the way back to the time of Galen in 200 AD. Even then, in antiquity, Galen was run out of town for coming into conflict with local, jealous physicians.The same thing happened to Dr. Wilheim Kolff, the inventor of the dialysis machine. His invention was considered an \"abomination\" and professionals mocked him as a \"rogue\". Kolff's artificial kidney went on to save millions of lives. Dr. William Harvey, who discovered the actual way blood circulates in the body totally reversed the traditional English theory of blood circulation in opposition to 1500 years of medical theory founded by the Greek physician Galen. Harvey was considered an enemy by all medical practitioners alive during his lifetime. He was viciously attacked by critics who believed in the theories of Galen. Without Harvey's discovery we would have no idea how the heart helps circulate the blood, and there would be no cardiovascular medicine as we know it today.And the list goes on and on. Hopefully, the exposure of this syndrome of intolerance and fear of the new shown in this book, and understanding what causes it, will help influence more people to accept the next important innovation in modern medicine.",
  "genres": [],
  "author": "James D. Okun",
  "average_rating": "4.94",
  "url": "https://www.goodreads.com/book/show/32190707-the-history-of-new-innovations-in-modern-medicine"
}