{
  "title": "Underbelly Hoops: Adventures in the CBA - A.K.A. The Crazy Basketball Association",
  "description": "\"The hoops answer to Ball Four. By turns funny and poignant -- and always self aware -- this book allows fans into the locker room and huddle, yes, but also into the cortex of a professional basketball player. If Carson Cunningham could have jumped, run and created his shot off the dribble as masterfully as he writes and observes, he'd be starring in the NBA.\"-L. Jon Wertheim, senior writer for SPORTS ILLUSTRATED \"During my nine years coaching in the CBA, I thought I'd witnessed every possible scenario in that zany league, yet Carson Cunningham's Underbelly Hoops was a delightful revelation. Most impressive were his observations of the on- and off-court experiences of such a wide range of fascinating characters--from Chris Daleo, the over-the-top manic coach of the Rockford Lightning, to teammate Keith Closs, a free-spirited 7'3\" shot-blocker with a big heart but a big vice. At turns hilarious and infuriating, Cunningham's memoir is also enriched by his lively writing style, his profound understanding of America's basketball culture, and his unadorned honesty. The result is a bountiful triple-double for Cunningham and a must read for hoop-o-philes of every persuasion.\"-Charley Rosen A top college basketball player for Oregon State and Purdue and a native of Hoosierland Indiana who believed he could one day play in the NBA, Carson Cunningham came close. Well – sort of close. He ended up in the minor leagues of professional basketball instead, in the storied and now defunct CBA, a league that has turned out a record-setting number of NBA players and coaches, such as Phil Jackson and George Karl. It wasn’t glamorous, in fact the playing conditions in the CBA were pretty grim; near-empty arenas, interminable bus rides to nowheresville, oddball coaches, little loyalty from management, meager pay, these were a few realities of CBA life. And yet, even as it chipped away at your dignity and made little economic sense to remain, the CBA drew you in with the allure of action and the prospect of an NBA call-up. And it could inspire, like when you and your teammates caught a rhythm that made you remember why basketball is such a beautiful game, or when you saw guys continue to strive, to persevere, even if their dreams weren't fully realized. Carson writes honestly, hilariously and often touchingly of his running and gunning days as a CBA also-ran, with flash backs to his college days where the future seemed brighter than a new pair of Nikes. A top recruit with superior ballhanding and shooting skills along with a sixth basketball sense, in 1997 Carson was a Sporting News All-American freshman who broke Gary Payton's freshman scoring record and a few years later helped his team at Purdue get within a game of the Final Four.",
  "genres": [
    "Sports",
    "Basketball",
    "Nonfiction",
    "Memoir"
  ],
  "author": "Carson Cunningham",
  "average_rating": "3.84",
  "url": "https://www.goodreads.com/book/show/11976968-underbelly-hoops"
}