{
  "title": "Village Atheists: How America's Unbelievers Made Their Way in a Godly Nation",
  "description": "A compelling history of atheism in American public lifeA much-maligned minority throughout American history, atheists have been cast as a threat to the nation's moral fabric, barred from holding public office, and branded as irreligious misfits in a nation chosen by God. Yet, village atheists—as these godless freethinkers came to be known by the close of the nineteenth century—were also hailed for their gutsy dissent from stultifying pieties and for posing a necessary secularist challenge to majoritarian entanglements of church and state. Village Atheists explores the complex cultural terrain that unbelievers have long had to navigate in their fight to secure equal rights and liberties in American public life.Leigh Eric Schmidt rebuilds the history of American secularism from the ground up, giving flesh and blood to these outspoken infidels, including itinerant lecturer Samuel Porter Putnam; rough-edged cartoonist Watson Heston; convicted blasphemer Charles B. Reynolds; and atheist sex reformer Elmina D. Slenker. He describes their everyday confrontations with devout neighbors and evangelical ministers, their strained efforts at civility alongside their urge to ridicule and offend their Christian compatriots. Schmidt examines the multilayered world of social exclusion, legal jeopardy, yet also civic acceptance in which American atheists and secularists lived. He shows how it was only in the middle decades of the twentieth century that nonbelievers attained a measure of legal vindication, yet even then they often found themselves marginalized on the edges of a God-trusting, Bible-believing nation.Village Atheists reveals how the secularist vision for the United States proved to be anything but triumphant and age-defining for a country where faith and citizenship were—and still are—routinely interwoven.",
  "genres": [
    "Religion",
    "History",
    "Politics",
    "Nonfiction",
    "Atheism",
    "American History"
  ],
  "author": "Leigh Eric Schmidt",
  "average_rating": "3.66",
  "url": "https://www.goodreads.com/book/show/32184710-village-atheists"
}