{
  "title": "Paper: Paging Through History",
  "description": "Paper is one of the simplest and most essential pieces of human technology. For the past two millennia, the ability to produce it in ever more efficient ways has supported the proliferation of literacy, media, religion, education, commerce, and art; it has formed the foundation of civilizations, promoting revolutions and restoring stability. One has only to look at history’s greatest press run, which produced 6.5 billion copies of Máo zhuxí yulu, Quotations from Chairman Mao Tse-tung (Zedong)—which doesn’t include editions in 37 foreign languages and in braille—to appreciate the range and influence of a single publication, in paper. Or take the fact that one of history’s most revered artists, Leonardo da Vinci, left behind only 15 paintings but 4,000 works on paper. And though the colonies were at the time calling for a boycott of all British goods, the one exception they made speaks to the essentiality of the material; they penned the Declaration of Independence on British paper.Now, amid discussion of “going paperless”—and as speculation about the effects of a digitally dependent society grows rampant—we’ve come to a world-historic juncture. Thousands of years ago, Socrates and Plato warned that written language would be the end of “true knowledge,” replacing the need to exercise memory and think through complex questions. Similar arguments were made about the switch from handwritten to printed books, and today about the role of computer technology. By tracing paper’s evolution from antiquity to the present, with an emphasis on the contributions made in Asia and the Middle East, Mark Kurlansky challenges common assumptions about technology’s influence, affirming that paper is here to stay. Paper will be the commodity history that guides us forward in the twenty-first century and illuminates our times.",
  "genres": [
    "History",
    "Nonfiction",
    "Microhistory",
    "Audiobook",
    "Books About Books",
    "Science",
    "Technology"
  ],
  "author": "Mark Kurlansky",
  "average_rating": "3.82",
  "url": "https://www.goodreads.com/book/show/32191697-paper"
}