{
  "title": "Words Are My Matter: Writings About Life and Books, 2000-2016",
  "description": "\"Hard times are coming, when we’ll be wanting the voices of writers who can see alternatives to how we live now, can see through our fear-stricken society and its obsessive technologies to other ways of being, and even imagine real grounds for hope. We’ll need writers who can remember freedom — poets, visionaries — realists of a larger reality. . . .\"Words Are My Matter collects talks, essays, introductions to beloved books, and book reviews by Ursula K. Le Guin, one of our fore- most public literary intellectuals. Words Are My Matter is essential reading. It is a manual for investigating the depth and breadth of con- temporary fiction — and, through the lens of deep considerations of contemporary writing, a way of exploring the world we are all living in.\"We need writers who know the difference between production of a market commodity and the practice of an art. Developing written material to suit sales strategies in order to maximise corporate profit and advertising revenue is not the same thing as responsible book publishing or authorship.” *Le Guin is one of those authors and this is another of her moments. She has published more than sixty books ranging from fiction to nonfiction, children’s books to poetry, and has received many lifetime achievement awards including the Library of Congress Living Legends award. This year her publications include three survey collections: The Found and the Lost: The Collected Novellas; The Unreal and the Real: The Selected Short Stories; and The Complete Orsinia: Malafrena, Stories and Songs (Library of America).* From “Freedom” A speech in acceptance of the National Book Foundation Medal for Distinguished Contribution to American Letters.",
  "genres": [
    "Nonfiction",
    "Essays",
    "Writing",
    "Books About Books",
    "Memoir",
    "Literary Criticism",
    "Feminism"
  ],
  "author": "Ursula K. Le Guin",
  "average_rating": "4.01",
  "url": "https://www.goodreads.com/book/show/32204349-words-are-my-matter"
}