{
  "title": "Spirits of Seacliff Manor",
  "description": "EVIL LIVES HERE   While restoring an old estate the darkest malevolence known to man is unleashed. Again.  Brandon Barnett has been given the promotion of a lifetime. There’s just one problem; he can’t afford to buy a house in Southern California. Even the apartments cost more than his mortgage. Then a miracle occurs; a letter arrives informing him he’s inherited the home of his dreams. His grandmother regaled him with stories of summers spent there as a child. Brandon has seen old photographs, the place is magical. It even has a name; Seacliff Manor.  BE CAREFUL WHAT YOU WISH FOR  It’s love at first sight for Brandon, not so much for his wife, Alyssa. The humongous estate needs more than a little TLC to make it inhabitable, but he convinces her they can turn into a Bed & Breakfast. The money will help with the upkeep.  Alyssa Barnett couldn’t wait to move to San Diego. From everything she’d heard it’s paradise on earth; it’s on the ocean and the sun shines year round. She just isn’t keen on living in the monstrosity her husband inherited, but he adores it so she’ll try to make it work.  ALWAYS TRUST YOUR INSTINCTS  The problems mount daily; faucets turn on by themselves, the lights flicker, and there’s rats in the walls. Workmen disappear. Alyssa’s nights are restless; she wakes with tearstained cheeks, but no memory of why. With her husband traveling for work, that leaves Alyssa to tackle the renovations on her own. She’s thrilled when her sister comes for a visit, but her enthusiasm is short lived when Courtney tries to convince Alyssa the old place is haunted.  A hidden room is discovered, along with it clues to the home’s dark past. Things quickly go from bad to worse. Alyssa begins sleepwalking. When she wakes she finds herself in the most peculiar places with no idea how she got there or what she may have done. Then a horrifying supernatural event occurs that can not be ignored. They have no choice but to call an investigative team.  NO ONE IS SAFE  Jane Spencer and Tim Reeves have been doing paranormal research for many years. When Tim barely escapes with his life, Jane calls The Thibodeux Foundation for assistance. They send Jake Spaulding (A demonologist) and Sara Crow (born with the gift of psychometry- she receives visions when holding certain items.) Together they unearth the deadly truth buried at Seacliff Manor, but can this team banish the evil before someone else is murdered?   ALL THE BOOKS IN THIS SERIES STAND ALONE. NO NEED TO READ THEM IN ORDER. THANK YOU.",
  "genres": [
    "Paranormal",
    "Mystery"
  ],
  "author": "Morgan Hannah MacDonald",
  "average_rating": "4.43",
  "url": "https://www.goodreads.com/book/show/32219663-spirits-of-seacliff-manor"
}