{
  "title": "The Plot to Hack America: How Putin's Cyberspies and WikiLeaks Tried to Steal the 2016 Election",
  "description": "Published a full month prior to the divisive Trump vs. Clinton 2016 presidential election, this book exposed the Russian hacking while the CIA was drafting their own report. In April 2016, computer technicians at the Democratic National Committee discovered that someone had accessed the organization’s computer servers and conducted a theft that is best described as Watergate 2.0. In the weeks that followed, the nation’s top computer security experts discovered that the cyber thieves had helped themselves to everything: sensitive documents, emails, donor information, even voice mails.Soon after, the remainder of the Democratic Party machine, the congressional campaign, the Clinton campaign, and their friends and allies in the media were also hacked. Credit cards numbers, phone numbers, and contacts were stolen. In short order, the FBI found that more than twenty-five state election offices had their voter registration systems probed or attacked by the same hackers.Western intelligence agencies tracked the hack to Russian spy agencies and dubbed them the “Cyber Bears.” The media was soon flooded with the stolen information channeled through Julian Assange, the founder of WikiLeaks. It was a massive attack on America but the Russian hacks appeared to have a singular goal—elect Donald J. Trump as president of the United States.Malcolm Nance’s fast paced real-life spy thriller takes you from Vladimir Putin’s rise through the KGB from junior officer to spymaster-in-chief and spells out the story of how he performed the ultimate political manipulation—convincing Donald Trump to abandon seventy years of American foreign policy including the destruction of NATO, cheering the end of the European Union, allowing Russian domination of Eastern Europe, and destroying the existing global order with America at its lead.The Plot to Hack America is the thrilling true story of how Putin’s spy agency, run by the Russian billionaire class, used the promise of power and influence to cultivate Trump as well as his closest aides, the Kremlin Crew, to become unwitting assets of the Russian government. The goal? To put an end to 240 years of free and fair American democratic elections.",
  "genres": [
    "Politics",
    "Nonfiction",
    "History",
    "Russia",
    "Audiobook",
    "Technology",
    "True Crime"
  ],
  "author": "Malcolm W. Nance",
  "average_rating": "4.09",
  "url": "https://www.goodreads.com/book/show/32202585-the-plot-to-hack-america"
}