{
  "title": "Washington's Farewell: The Founding Father's Warning to Future Generations",
  "description": "“A vivid portrait…and thoughtful consideration of George Washington’s wisdom that couldn’t be timelier” ( Kirkus Reviews , starred review). A revealing look at the first President’s Farewell Address, a still-relevant warning against partisan politics and foreign entanglements.George Washington’s Farewell Address was a prophetic letter he wrote to his fellow citizens and signed from a “parting friend,” addressing the forces he feared could destroy our hyper-partisanship, excessive debt, and foreign wars. In it, Washington called for unity among “citizens by birth or choice,” advocated moderation, defended religious pluralism, proposed a foreign policy of independence (not isolation), and proposed that education is essential to democracy. He established the precedent for the peaceful transfer of power.Washington’s urgent message was adopted by Jefferson after years of opposition and quoted by Lincoln in defense of the Union. Woodrow Wilson invoked it for nation-building; Eisenhower for Cold War; Reagan for religion. Once celebrated as civic scripture, more widely reprinted than the Declaration of Independence, the Farewell Address is now almost forgotten. Yet its message remains starkly relevant today. In Washington’s Farewell , John Avlon offers a stunning portrait of our first president and his battle to save America from self-destruction.Washington’s Farewell “brings to light Washington’s goodbye by elucidating what it meant not only during the early days of the republic, but its lasting effect through the centuries” ( Library Journal , starred review). Now the Farewell Address may inspire a new generation to re-center their politics and reunite our nation through the lessons rooted in Washington’s shared experience.",
  "genres": [
    "History",
    "Nonfiction",
    "Politics",
    "Biography",
    "Historical",
    "American History",
    "Presidents"
  ],
  "author": "John P. Avlon",
  "average_rating": "4.20",
  "url": "https://www.goodreads.com/book/show/32198433-washington-s-farewell"
}