{
  "title": "The Rights Of War And Peace: Three Volume Set",
  "description": "Since the nineteenth century, Hugo Grotius’s \nRights of War and Peace\n has been the classic work in modern international law, laying the foundation for a universal code of law. However, in the seventeeth century and during the Enlightenment, it was considered a major defense of the rights of states and private persons to use their power to secure themselves and their property.Book I examines the question of whether any war is just and who may lawfully make war. The causes of war; the implications of contracts, oaths, and promises; and the moral strictures of punishments are the subjects of Book II. The third book discusses what is lawful in war, the various kinds of peace and agreements given, and the treatment and ransoming of prisoners.The Liberty Fund edition is based on the classic English text of 1738, with extensive commentary by Jean  Barbeyrac. It also includes the Prolegomena to the first edition, a document never before translated into English.Hugo Grotius is one of the most important thinkers in the early-modern period. A great humanistic polymath—lawyer and legal theorist, diplomat and political philosopher, ecumenical activist and theologian—his work was seminal for modern natural law and influenced the moral, political, legal, and theological thought of the Enlightenment, from Hobbes, Pufendorf, and Locke to Rousseau and Kant, as well as America’s Founding leaders.Richard Tuck is a Fellow of Jesus College, Cambridge, and Professor of Government at Harvard University.Knud Haakonssen is Professor of Intellectual History and Director of the Centre for Intellectual History at the University of Sussex, England.",
  "genres": [
    "Philosophy",
    "Politics",
    "Law",
    "Nonfiction",
    "Classics",
    "War",
    "International Relations"
  ],
  "author": "Hugo Grotius",
  "average_rating": "3.83",
  "url": "https://www.goodreads.com/book/show/322222.The_Rights_Of_War_And_Peace"
}