{
  "title": "The Free Sea",
  "description": "The freedom of the oceans of the world and coastal waters has been a contentious issue in international law for the past four hundred years. The most influential argument in favor of freedom of navigation, trade, and fishing was that put forth by the Dutch theorist Hugo Grotius in his 1609 Mare Liberum (\nThe Free Sea\n).\nThe Free Sea\n was originally published in order to buttress Dutch claims of access to the lucrative markets of the East Indies. It had been composed as the twelfth chapter of a larger work, De Jure Praedae (Commentary on the Law of Prize and Booty), which Grotius had written to defend the Dutch East India Company’s capture in 1603 of a rich Portuguese merchant ship in the Strait of Singapore.Liberty Fund’s new edition of \nThe Free Sea\n is the only translation of Grotius’s masterpiece undertaken in his own lifetime, left in manuscript by the English historian, Richard Hakluyt (1552–1616). It also contains William Welwod’s critique of Grotius (reprinted for the first time since the seventeenth century) and Grotius’s reply to Welwod. These documents provide an indispensable introduction to modern ideas of sovereignty and property as they emerged from the early-modern tradition of natural law.Hugo Grotius is one of the most important thinkers in the early-modern period. A great humanistic polymath—lawyer and legal theorist, diplomat and political philosopher, ecumenical activist and theologian—his work was seminal for modern natural law and influenced the moral, political, legal, and theological thought of the Enlightenment, from Hobbes, Pufendorf, and Locke to Rousseau and Kant, as well as America’s Founding leaders.David Armitage is the Lloyd C. Blankfein Professor of History at Harvard University. He is the author of The Ideological Origins of the British Empire and The Declaration of Independence: A Global History; the editor of Theories of Empire, 1450–1800; and the co-editor of The British Atlantic World, 1500–1800, Shakespeare and Early Modern Political Thought, and The Age of Revolutions in Global Context, c. 1760–1840.Richard Hakluyt (d. 1616) was a geographer, editor, and translator of travel literature.Knud Haakonssen is Professor of Intellectual History and Director of the Centre for Intellectual History at the University of Sussex, England.",
  "genres": [
    "Philosophy",
    "History",
    "Politics",
    "Law",
    "Classics",
    "Nonfiction"
  ],
  "author": "Hugo Grotius",
  "average_rating": "3.84",
  "url": "https://www.goodreads.com/book/show/322226.The_Free_Sea"
}