{
  "title": "In the Shadow of the White House: A Memoir of the Washington and Watergate Years, 1968-1978",
  "description": "For her first forty years, Jo Haldeman’s life followed a conventional path. While her husband, Bob, built his career in advertising, Jo comfortably settled into her role as mother of four, housewife, and community volunteer.In 1968, Jo’s world changed dramatically. Richard Nixon was elected President of the United States, and Bob was offered the job of a lifetime—White House Chief of Staff. As Jo and Bob discussed the opportunities and challenges that this move would entail, little did she anticipate the course that her life, and her relationship with Bob, would take over the next ten years.In this insightful, poignant, and guileless memoir of those ten years, Jo shares her story as the wife of H. R. Haldeman, often referred to as the second most powerful person in the White House. She offers a window into the world of trips on Air Force One, weekends at Camp David, and events at the White House, as well as family vignettes and the growing stresses of her husband’s demanding job.Then a bungled burglary at the Watergate erupted into a national scandal. The news began to feature the Haldeman name. Blaring headlines and vicious political cartoons accompanied new revelations of a cover-up. Multiple investigations and Senate hearings followed. Criminal proceedings loomed.Jo’s compelling account takes the reader on her journey from the heady heights of Washington life through an excruciating public resignation and trial to her husband’s conviction and imprisonment. In a true period piece, Jo illuminates the story of the “woman behind the man” and personalizes the Watergate experience. Enhanced by her personal photographs and the immediacy of her present tense delivery, In the Shadow of the White House is a fascinating work of nonfiction that reads like a novel.",
  "genres": [
    "History",
    "Memoir",
    "Nonfiction",
    "Presidents",
    "Biography",
    "American History",
    "Politics"
  ],
  "author": "Jo Haldeman",
  "average_rating": "4.20",
  "url": "https://www.goodreads.com/book/show/32202652-in-the-shadow-of-the-white-house"
}