{
  "title": "Esferas I: Burbujas - Microsferología",
  "description": "Esperada con verdadera expectación en Alemania, la trilogía Esferas es, sin duda, el opus magnum de Peter Sloterdijk. Esferas comienza convocando los sentidos, las sensaciones y el entendimiento de lo cercano; aquello que la filosofía suele pasar por alto: el espacio vivido y vivenciado. La experiencia del espacio siempre es la experiencia primaria del existir. Siempre vivimos en espacios, en esferas, en atmósferas. Desde la primera esfera en la que estamos inmersos, con «la clausura en la madre», todos los espacios de vida humanos no son sino reminiscencias de esa caverna original siempre añorada de la primera esfera humana. Sloterdijk analiza la conexión entre crisis vitales y los intentos fracasados de conformar espacios habitables; examina las catástrofes, cuando estalla una esfera, como sucedió con el giro copernicano, que hizo saltar las cubiertas imaginarias del cielo en el que habían vivido durante siglos los seres humanos. También la Modernidad comienza con una nueva experiencia del espacio, con el espanto que le produce a Pascal «el silencio eterno de los espacios infinitos». Con gran talento literario, erudición y brillantez, Sloterdijk desarrolla un nuevo tipo de fenomenología y ontogénesis de los espacios humanos, repasando sus aventurados vericuetos por el imaginario de la historia, el arte, la literatura, la música pop, la mitología, la patrística, la medicina magnetopática, la psicología analítica, la mística, la filosofía... Si Heidegger había empezado la búsqueda de un lenguaje para el espacio vivido, como dice Safranski, «no es exagerado decir que Sloterdijk ha elevado a un nivel completamente nuevo la filosofía de la coexistencia en el espacio común» de la intimidad a las macrosferas sociales.",
  "genres": [
    "Philosophy",
    "Nonfiction",
    "History",
    "Theory",
    "Religion",
    "Psychology",
    "Anthropology"
  ],
  "author": "Peter Sloterdijk",
  "average_rating": "4.33",
  "url": "https://www.goodreads.com/book/show/322337.Esferas_I"
}