{
  "title": "The Prince's Plan",
  "description": "In the tragic aftermath of a weekend in Lima, Peru, singer Danny Roland, loses more than just his reputation. He reemerges two years later in New York City, physical unscathed, but emotionally shattered and his heart permanently closed to vacancies. Danny vows to turn his life around by dipping back into the world of prying paparazzi and vengeful exes searching for fame, fortune and salvation.Marnie Ducello is an ex-prostitute, with her own set of scars, and together Danny and Marnie bond over what they won’t speak on. As they work together, Marnie is swept into the glitz and glamour of showbiz as Danny whisks her around the world. With Marnie’s help Danny begins to see the world in a new light, one where love is possible. But Marnie herself is a mystery. Danny needs to know more about the woman he’s falling for.On a layover in Chicago, Danny plans a surprise for Marnie. But the surprise uncovers a long-buried secret that jeopardizes everything they’ve worked so hard to build. Marnie must come to terms with the painful secrets that haunt her or she’ll risk losing Danny forever.They’re both broken…but maybe together they can be unbreakable.What readers are saying about the Prince's Plan...\" Deeply engrossing. Made my day!\"\"With The Prince's Plan, E. M. Youman presents you a fresh and delightful story. A book that will be read by you more than once.\"\"I kind of knew what to expect going into this book. But at the same time, it was a complete mystery. Both characters have . . . issues and sufferings. The author is very clear and gives detail straight forward when expressing them. Danny's character had me reeling. Marnie's dark past was heartbreaking. To be straight honest, I teared up at some parts.\"\"If you want some tough and gritty drama, real characters and situations with a romance that finally ends in a HEA then try this.\"",
  "genres": [
    "Romance",
    "Dark",
    "Mental Illness",
    "Contemporary"
  ],
  "author": "E.M. Youman",
  "average_rating": "3.62",
  "url": "https://www.goodreads.com/book/show/32263729-the-prince-s-plan"
}