{
  "title": "Upon a Midnight Clear",
  "description": "The holidays are a special time, when shining eyes melt the chill of a winter's night, when hearts overflow with love.... Now, embrace the passion and romance of the season with this dazzling, all-new treasury of stories. New York Times bestselling authors Jude Deveraux and Linda Howard are joined by Margaret Allison, Stef Ann Holm and Mariah Stewart in a delightful celebration of the heart's greatest gifts.... \n\n\nJude Deveraux - The Teacher (Legend, Colorado #2)\n\nA spirited Irishwoman, Kathryn de Longe, comes to a rugged Colorado town to govern a young ruffian and her worst student, Zachary Jordan, son of the arrogant Cole, who decides that he wants to be the teacher's pet. However, she and her son are in hiding and a relationship is not what she needs, even if love is the prize and learns a love lesson from the boy's father: there is more to the man than meets the eye....\n\nMariah Stewart - If Only In My Dreams\n\nQuinn Hollister and Cale McKenzie were once sweethearts. Now a blizzard forces the lonely pair to share a close proximity to each other.\n\nMargaret Allison - Christmas Magic\n\nArtist Kim Risson and her father have barely talked to each other over the years. However, when he becomes ill, she runs home to see him. Soon, Kim finds herself being pulled between a father she never had and his handsome doctor.\n\nStef Ann Holm - Jolly Holly\n\nJohn Wolcott and Isabel Burche are two lonely people, who are down on their luck. Both enter a holly berry collecting contest, in the California hills, in dire need of winning the first prize of cash, which brings two determined hearts together for the greatest prize of all: a true and lasting love....\n\nLinda Howard - White Out\n\nHope Bradshaw saves the life of Price Tanner when he is caught in a blizzard near her isolated cabin. Price insists that he is a law enforcement official even if it appears that he is not. Still, love grows during their \"White Out\". Now, if trust could only quickly follow, a relationship could bloom...\n\nThese unforgettable tales capture the heart's timeless holiday spirit - and love's blissful joys that can last the whole year through.",
  "genres": [
    "Romance",
    "Anthologies",
    "Christmas",
    "Historical Romance",
    "Contemporary Romance",
    "Short Stories",
    "Fiction"
  ],
  "author": "Jude Deveraux",
  "average_rating": "3.88",
  "url": "https://www.goodreads.com/book/show/322610.Upon_a_Midnight_Clear"
}