{
  "title": "Rush Revere and the Presidency",
  "description": "Join Rush Revere on another action-packed journey! Rush and his friends head back in time to the early days of our independent nation to watch the early American presidents George Washington, John Adams, and Thomas Jefferson in action!Hey there, young readers! Rush Revere here. I can’t wait to rush, rush, rush to history with our next a trip back in time to the first days of our country on its own two legs, free from British rule—What’s that, Liberty? Liberty wants me to say on its own four legs. Anyway, as I was saying—free from British rule and creating a new government for the people, by the people. When one of the time-traveling crew from Manchester Middle School decides to run for student-body president, I take them back to meet our first three presidents and first ladies.So, join us as we head back to those amazing and important first years, when we got to make all the decisions. Turns out, it’s pretty hard to lead a whole new country! We had to make new rules for America and set the path for the country we would grow up to be. And who better to be our first-ever leader than the general who won the war—George Washington!He was the father of our country and made some incredible decisions that still affect how we live our lives today! But even so, President Wash­ington knew that he couldn’t stay president forever or we might end up with a king, just like England.We’ll watch as he makes his tough decision to step down to spend more time with Martha Washington and his adopted grandchildren, Nelly and Wash.Then we’ll saddle up and ride into the presidency of John Adams, who followed in some very big footsteps with the help of his accomplished wife, Abigail. Then we’ll rush, rush, rush to the year 1803, when Thomas Jefferson continues the mission of creating America by making a risky decision to buy a lot of land from the French in the Louisiana Purchase, which more than doubles our size!Using advice from the early presidents, first ladies, and a former U.S. congressman, the crew works to defeat an old nemesis. The question is— will it be enough?What are you waiting for? Bring your curiosity and let’s giddyup!",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Childrens",
    "Historical",
    "American History",
    "Time Travel",
    "Middle Grade"
  ],
  "author": "Rush Limbaugh",
  "average_rating": "4.34",
  "url": "https://www.goodreads.com/book/show/32282999-rush-revere-and-the-presidency"
}