{
  "title": "Hocus Pocus in Focus: The Thinking Fan's Guide to Disney's Halloween Classic",
  "description": "The Hocus Pocus \"BoooOOOoooK\" Fans Have Been Waiting For... In the first and only book ever written about the beloved 1993 Halloween movie, Aaron Wallace takes readers deep into the world of Hocus Pocus to learn everything they never knew. He provides a lighthearted but scholarly look at the film in its all spooky-kooky glory.You'll learn: - The fascinating history behind \"Come, Little Children (Sarah's Song)\" and \"I Put a Spell on You\" - How Steven Spielberg shaped the movie - Why there's all that talk about yabbos and virgins - How Hocus Pocus got away with being the edgiest Disney movie ever made - Whether a sequel could really happen - And much, much moreFeaturing a foreword by Golden Globe nominee Thora Birch (Hocus Pocus's Dani), afterword by Mick Garris (the film's writer and producer), and the largest collection of Hocus Pocus fun facts and trivia ever assembled, this is the ultimate unofficial fan guide for Halloween and movie lovers everywhere. Finally, Hocus Pocus is celebrated as the classic it's become. You'll love the movie more than you ever knew you could.About the Author Aaron Wallace is a bestselling author, entertainment critic, and attorney with a particular interest in the artistic output of The Walt Disney Company.His critical interest in entertainment began at The University of North Carolina at Chapel Hill, where he earned a Bachelor of Arts degree in both Communication Studies (with a concentration in Media Studies) and English. While there, he taught a recitation course in analyzing children's literature, with an emphasis on Disney's adaptations in theme parks and film.Wallace later pursued an interest in law, earning a Juris Doctorate from Wake Forest University. Additionally, he is a professional entertainment critic, having published more than two hundred movie, television, and music reviews to an audience of millions. Since 2004, he's been a part of the writing staff at DVDizzy.com, one of the internet's most accessed sites for entertainment journalism.In addition to writing, Aaron hosts Zip-A-Dee-Doo-Pod, the web's longest-running podcast dedicated to all things Disney. Apple has recognized the show as one of its \"Featured Travel Podcasts,\" and Zip-A-Dee-Doo-Pod can often be found among the top-ranking downloads on the iTunes Travel charts. Aaron also appears as a regular co-host on The Hub Podcast, another popular show devoted to having fun with Disney.The author's website is available at www.AaronWallaceOnline.com.",
  "genres": [
    "Nonfiction",
    "Halloween",
    "Film"
  ],
  "author": "Aaron Wallace",
  "average_rating": "3.73",
  "url": "https://www.goodreads.com/book/show/32284999-hocus-pocus-in-focus"
}