{
  "title": "Imagine Harmony: How to Evolve From Stress to Gratitude",
  "description": "Imagine Harmony - How to Evolve from Stress to Gratitude is about Stress Management and Conscious Control of the Mind/Body and Gene Expression. It is an enjoyable stress management program that begins with an explanation of stress, its devastating effects, and progresses through a series of six lessons (Part I through Part VI) beginning with relaxation and culminating in conscious control of physiological and psychological responses to daily life without the risks associated with pharmaceuticals. Skills instead of pills. We start with the breath and progress on to psychophysiological functions that have long been deemed autonomic. It's about realizing that we are not victims of heredity or controlled by outside forces and circumstances, that we can take control and then learn to operate the controls effectively. If we cannot find the circumstances we need, we make them. Our thirty-year quest to find the path and evolve from stress to gratitude and harmony involved hundreds of books, experts, courses and seminars, three trips to the Orient, and thousands of research and study hours. It could have been accomplished in a matter of a few weeks if this book had been available to us. This book brings together recent scientific data and documented ancient wisdom to focus awareness on a latent but innate capacity. The physical body will respond to the human mind, and this is the manual. With the recent discoveries in quantum physics, psychoneuroimmunology, and epigenetics, science is beginning to reconcile with spirituality and turn Newtonian physics on its ear. We have condensed and integrated these studies into a practical path of stress management and harmony that leads to a clear understanding of How to Evolve from Stress to Gratitude and sustain Perfect Health, Happiness, Vitality, Longevity, and Harmony. We explore the reality of adversity, its cause and cure, Dr. Herbert Bensons Relaxation Response and the Faith Factor, a progression of breath and meditation skills, the parasympathetic nervous system, a defined 'Worthy Purpose' in life, a written mission statement, the Seven Principles of Harmony, cognitive reframing, and redefine POSSIBLE. The Imagine Harmony program expands perceptions, develops conscious control, and promotes harmony in thought, feeling, and behavior; emotionally, physically, mentally, and spiritually; in mind, body, and soul. We discuss the relationship between science and spirituality, how they actually support one another, and how both are used to begin our evolution. We show how the mind, body, and soul work together and how they handle thoughts and use wisdom. The program integrates the uniquely human gifts of conscious awareness, reason, imagination, and the power of belief to create a synergistic response that seems as miraculous as safely flying to the moon and back would have been a hundred years ago. With adaptation, imagination, and belief, all things are possible. The journey from an unhealthy, stressed mind and body to gratitude, happiness, peace of mind, and control over the mind/body and gene expression is truly a major advance in our evolution. However, taken one step at a time, it is simple, easy, and enjoyable. It is a bit like walking through a beautiful six level garden to get home after being lost in the desert. When we get to the top level of Harmony and look back, we wonder why we didn't see it before. From the bottom level, however, the ultimate objective cannot be seen or even easily imagined, like not being able to see the beautiful meadow and sweet water brook beyond the great forest. Imagine Harmony points the direction so all we need to do is take it one step at a time and as we get closer, the view will become clearer. All profits go to the Child Welfare League of America.",
  "genres": [
    "Nonfiction",
    "Self Help",
    "Academic"
  ],
  "author": "Dale R. Duvall",
  "average_rating": "3.97",
  "url": "https://www.goodreads.com/book/show/32297627-imagine-harmony"
}