{
  "title": "Caught in Time: A Time Travel Romance",
  "description": "Recovering from the trauma of a sexual assault, PR professional Elizabeth Landry travels to South Carolina, where a ride on the famous Herschell-Spillman carousel takes her back to 1948 Myrtle Beach, a previous incarnation as Charleston debutante Elizabeth Delacroix, and a fiancé (Nate Harmon) who is puzzled by the habits and values of the “new” Elizabeth. As the days turn into weeks, she realizes that the memories of her life as Elizabeth Landry are fading and that she is, in reality, morphing into Elizabeth Delacroix. Gripped by the fear of losing her original identity, Elizabeth returns to Myrtle Beach, where she finds her way back to the present day and stockbroker partner Aidan Calway, only to learn upon her return that she is pregnant. But pregnant with whose child? Her assailant? Nate? Aidan? The novel moves in parallel step with the NYPD investigation that uncovers a host of suspects and unravels the mystery of her assault, which turns out to be quite different from what anyone imagined. The plot line draws upon theories related to time travel, reincarnation, psychic phenomena, and mediumship. Despite a small amount of graphic content, the book has an overall gentle tone laced with numerous moments of lighthearted humor when the earlier edition of Elizabeth returns to New York City with a penchant for Creole cooking, classical piano, and vintage furniture—talents and habits that confuse her contemporary partner almost as much as the ring in her belly button and a surprise appearance as Catwoman at a church Halloween party confuse her 1940s partner. Sherry Devereaux Ferguson has published 10 books, with sometimes multiple editions, with Oxford University Press (NY and Toronto), Sage Publications (CA), Greenwood Publishing Group (CA), Transaction Publishers (NJ), Irwin Professional Publishing (later merged with McGraw-Hill, NY), and others. You can find her books in libraries around the world. Born in 1943 and married to a Scot who flew Lancaster bombers for the Royal Air Force (Britain) in World War II, the author has a personal and acquired knowledge of the post-war years that allows her to bring the reader into intimate contact with the spirit of the times. At the same time, her years of growing up in the southern United States (South Carolina, Mississippi, Louisiana, and Texas) allow her to speak in an authentic and often nostalgic voice in this time travel romance. Dragonfly Spirit Press.387 pp.",
  "genres": [],
  "author": "Sherry Devereaux Ferguson",
  "average_rating": "4.20",
  "url": "https://www.goodreads.com/book/show/32313455-caught-in-time"
}