{
  "title": "ConneXions",
  "description": "Eleven women have been strangled in Montreal. While homicide investigators seek their man, a copycat killer has found the perfect cover-up. Kyle uses a popular dating site to target his prey - \"attached\" women seeking intimate encounters.  STEPHANIE - Trapped in a loveless marriage to a corporate lawyer, she's looking for more than a brief affair. Kyle appears to be the man of her dreams - charismatic and sensitive to her needs. Only losing everything she holds dear forces her to face the addiction that's eroding her life.  JENNY - Her high-pressure career is straining her days and she's tired of spending her nights alone. After two failed relationships, she masquerades as a married woman on the system to avoid commitment.  DANA is studying why women have affairs for a thesis in psychology, and arranges interviews with women through ConneXions. She links the killer to the dating site. To prove her theory, she, too, must play his game.EDITORIAL REVIEW by Venita Naylor for Readers' Favorite:\"Women, if you are looking for a nail-biting book on the essence of online dating, you must read ConneXions, which takes place in Montreal. Thelma Mariano takes you on a ride of murder and suspense as you look through the eyes of Kyle, a bartender. Ever since Lori left Kyle and their marriage of seven years, he has been on a quest to make women pay. He does this by seeking out other wives who are unfaithful to their husbands. Kyle believes it is his earthly duty to rid the world of these women. Will his plan work? Will he slip up and be found out? \"From the first page of reading, this story had me. I looked at ConneXions as I would eHarmony, Christian Mingle or Match.com, which are a few of the popular online dating sites taking over traditional dating. As I watched the lives of Jenny, a successful single woman who needs some spice in her life, and Stephanie, an unhappily married woman, unfold in ConneXions, I began to think about the old adage of 'the grass is greener on the other side' that so many people believe, especially when hitting a bumpy road in their relationships. Both these women feel they have met the man of their dreams, someone that can help them overcome their insecurities, feelings of being unloved, loneliness, and the hopelessness they are experiencing. They crave the attention that Kyle gives them during their intimate encounters.\"Enter Dana, who is working on her thesis about women who are having affairs. She begins her quest by registering on ConneXions. While on the dating site, things take a turn. Will Stephanie, Jenny, and Dana all be a part of Kyle's plan, or will one of the women be too much of a match for him?\"Source: https://readersfavorite.com/book-revi...",
  "genres": [
    "M M Romance"
  ],
  "author": "Thelma Mariano",
  "average_rating": "3.76",
  "url": "https://www.goodreads.com/book/show/32313219-connexions"
}