{
  "title": "Churchill and Orwell: The Fight for Freedom",
  "description": "From #1 New York Times bestselling author Thomas E. Ricks, a dual biography of Winston Churchill and George Orwell, whose farsighted vision and inspired action preserved democracy from the threats of authoritarianism, from the left and right alike.Both George Orwell and Winston Churchill came close to death in the mid-1930s—Orwell shot in the neck in a trench line in the Spanish Civil War, and Churchill struck by a car in New York City. If they'd died then, history would scarcely remember them. At the time, Churchill was a politician on the outs, his loyalty to his class and party suspect. Orwell was a mildly successful novelist, to put it generously. No one would have predicted that by the end of the 20th century they would be considered two of the most important people in British history for having the vision and courage to campaign tirelessly, in words and deeds, against the totalitarian threat from both the left and the right. In a crucial moment, they responded first by seeking the facts of the matter, seeing through the lies and obfuscations, and then acting on their beliefs. Together, to an extent not sufficiently appreciated, they kept the West's compass set toward freedom as its due north.It's not easy to recall now how lonely a position both men once occupied. By the late 1930s, democracy was discredited in many circles and authoritarian rulers were everywhere in the ascent. There were some who decried the scourge of communism, but saw in Hitler and Mussolini men we could do business with, if not in fact saviors. And there were others who saw the Nazi and fascist threat as malign but tended to view communism as the path to salvation. Churchill and Orwell, on the other hand, had the foresight to see clearly that the issue was human freedom—that whatever its coloration, a government that denied its people basic freedoms was a totalitarian menace and had to be resisted.In the end, Churchill and Orwell proved their age's necessary men. The glorious climax of Churchill and Orwell is the work they both did in the decade of the 1940s to triumph over freedom's enemies. And though Churchill played the larger role in the defeat of Hitler and the Axis, Orwell's reckoning with the menace of authoritarian rule in Animal Farm and 1984 would define the stakes of the Cold War for its 50-year course and continues to give inspiration to fighters for freedom to this day. Taken together, in Thomas E. Ricks' masterful hands, their lives are a beautiful testament to the power of moral conviction and to the courage it can take to stay true to it, through thick and thin.",
  "genres": [
    "History",
    "Biography",
    "Nonfiction",
    "Politics",
    "Biography Memoir",
    "Audiobook",
    "World War II"
  ],
  "author": "Thomas E. Ricks",
  "average_rating": "4.06",
  "url": "https://www.goodreads.com/book/show/32301946-churchill-and-orwell"
}