{
  "title": "How to Treat Black Magic and Demonic Possession",
  "description": "There is a sinister force in our midst today that is dominating and snatching away the minds of us humans. Black Magic permeates society through media, music, the education system, radio broadcast, popular culture, Horoscopes, advertisements, and in the daily language of people, taking a hold of society. Occultic systems have gained control in the culture. The existence of magic is an undeniable fact. Magic is so powerful at this time and we have been in a state of religious decline as we have been unable to stop the falsehood and Satanism that is in our midst, from growing and we have been unable to protect ourselves from the evil tentacles that are fastened around the hearts and minds. Therefore there has been no challenge mounted to witchcraft, sorcery and magic. Anything against magic is viewed as discriminating in pluralist multicultural society against those that freely choose to practice their religion. The society we are living in is at war with itself. All religions have been given equal footing as freedom and all types of earthly titles that are pleasing to the ears of the people. Due to a desire for certainty and hope, people are looking at sorcery and witchcraft and back magic with great interest. Anything that can’t directly be held by the six senses of the human experience is rejected which is compounded by the fact that they see Islam divided amongst the orthodox and the many cults. But magic is like a revolutionary tool to set oneself free from all boundaries and represents a revolt against the system and organised religion and suppression of human rights. People are very interested in magic because of the power and strength it has in the face of weakness. Many turn to it for the guarantee that it seems to give of absolute power and that it eliminates weakness. People have dived headlong into becoming witches and sorcerers in order to feel a sense of independence that they themselves have strength over their own lives. Those who have experienced unfair treatment, use magic as a way of empowering themselves and as a way for attaining what they desire. Popular culture dictates certain influences to the people and has made magic something to aspire to in life, as people see that the sorcerers are the winners in the movies and blockbusters shown all over the world. As it has gone from strength to strength within the last several decades, acts of sorcery have become decriminalised so that there can’t be any case in the limited human minds, except that magic will increase in its influence, strength, power and the scope that it has in our daily lives and daily conversations. Lets de-mystify it and bring it down to the level where we can understand the source of magic and how to heal it and stop its forces.",
  "genres": [],
  "author": "Danyal Nicholson",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/32332091-how-to-treat-black-magic-and-demonic-possession"
}