{
  "title": "La Dolce Vita",
  "description": "Someone powerful will fall. Someone greedy will die. Someone guilty will lose it all. Destiny has sealed their fate as husband and wife, but nothing has changed the Don. No evil will ever come between him and Mirabella again. Or so he thinks. Don Giovanni Battaglia has sacrificed all he intends to for la famiglia. The only obsession he has now is to preserve the love of his Bella Donna and protect his little brown, blue-eyed babies from his world. A vow he swore the Mafia could never divide. While she screams in the night from nightmares inflicted on her during her kidnapping and torture, he whispers new promises in her ear of la dolce vita. And his guilt driven by grief to cure her of the madness in her mind turns his inner demons on them both. They were to have a new beginning. The good life. But secrets both inside and outside of la camorra soon prove that love of family, love of la camorra, love of each other, may not be enough...  Don Armando Mancini, Giovanni’s sworn enemy since they were kids, now possesses evidence of Lorenzo’s betrayal. Will he use his power to destroy the Don or does he have an even deeper desire inside? Isabella believes the final trap is set to avenge her father’s death and kill the Don. But her arrogance and years of manipulations finally catch up to her. Lorenzo Battaglia’s lie and betrayals close in on him, and his pregnant wife will do anything to protect them both. Mirabella wishes to take her family to America. Share her painful past. In doing so she and her sister uncover secrets so deeply buried in their family, they can either destroy or free them both. Blood will spill, love will be the ultimate casualty as hate and revenge consume the Battaglias. The good life is what they all want. But staying alive, staying in love, staying a family, may not be the life they deserve.",
  "genres": [
    "Romance",
    "Interracial Romance",
    "Erotic Romance",
    "Contemporary Romance",
    "Mafia Romance",
    "Romantic Suspense",
    "Erotica"
  ],
  "author": "Sienna Mynx",
  "average_rating": "4.58",
  "url": "https://www.goodreads.com/book/show/32324227-la-dolce-vita"
}