{
  "title": "Atonement",
  "description": "“Once a fuck up, always a fuck up.”Words twenty-six-year-old Dante Thorne has had to live with for more years than he can count and a title he finally earned at the tender age of sixteen when one careless decision led to tragedy. And since he can’t deny the truth of the words, why not live by them instead? Fucking up, fucking, it doesn’t matter; as long as it feels good and makes him forget the day he failed the one person he’d always sworn to protect. A good philosophy to live by until Dante meets the one man who might actually having him wishing he was something more…At forty-one and with a distinguished twenty-year career as a Texas Ranger under his belt, Magnus DuCane should have been in the prime of his life. Instead, he’s mourning the loss of the daughter he couldn’t save and contemplating a future that looks nothing like the one he had planned. The only bright spot in his life is the young grandson whose suddenly been returned to him after going missing two years earlier and the new family of men that he’s been welcomed in to with open arms. But with his iron will, unfailing self-control and unflappable discipline, Magnus knows he can start a new chapter and get his life back on track…if he can just get past the disturbing, unexpected feelings one young man stirs in him.Because everything about Dante Thorne is wrong for Magnus. His arrogance, his cocky attitude, every single unfiltered word that falls unchecked out of his mouth and, of course, the fact that he’s a man.But when his well-meaning friends send Dante with him as a bodyguard when he returns to Texas to testify in a high-profile case, Magnus begins to see beyond the brash words and endless sexual innuendo. And when he starts to discover that what he sees isn’t all that bad, suddenly the fact that that Dante is a man instead of a woman no longer seems like such a big sticking point anymore…",
  "genres": [
    "M M Romance",
    "Romance",
    "Contemporary",
    "LGBT",
    "Enemies To Lovers",
    "Abuse",
    "Gay"
  ],
  "author": "Sloane Kennedy",
  "average_rating": "4.40",
  "url": "https://www.goodreads.com/book/show/32326933-atonement"
}