{
  "title": "The Mandibles: A Family, 2029-2047",
  "description": "With dry wit and psychological acuity, this near-future novel explores the aftershocks of an economically devastating U.S. sovereign debt default on four generations of a once-prosperous American family. Down-to-earth and perfectly realistic in scale, this is not an over-the-top Blade Runner tale. It is not science fiction.In 2029, the United States is engaged in a bloodless world war that will wipe out the savings of millions of American families. Overnight, on the international currency exchange, the “almighty dollar” plummets in value, to be replaced by a new global currency, the “bancor.” In retaliation, the president declares that America will default on its loans. “Deadbeat Nation” being unable to borrow, the government prints money to cover its bills. What little remains to savers is rapidly eaten away by runaway inflation.The Mandibles have been counting on a sizable fortune filtering down when their ninety-seven-year-old patriarch dies. Once the inheritance turns to ash, each family member must contend with disappointment, but also—as the U.S. economy spirals into dysfunction—the challenge of sheer survival.Recently affluent, Avery is petulant that she can’t buy olive oil, while her sister, Florence, absorbs strays into her cramped household. An expat author, their aunt, Nollie, returns from abroad at seventy-three to a country that’s unrecognizable. Her brother, Carter, fumes at caring for their demented stepmother, now that an assisted living facility isn’t affordable. Only Florence’s oddball teenage son, Willing, an economics autodidact, will save this formerly august American family from the streets.The Mandibles is about money. Thus it is necessarily about bitterness, rivalry, and selfishness—but also about surreal generosity, sacrifice, and transformative adaptation to changing circumstances.",
  "genres": [
    "Fiction",
    "Dystopia",
    "Science Fiction",
    "Book Club",
    "Economics",
    "Novels",
    "Literary Fiction"
  ],
  "author": "Lionel Shriver",
  "average_rating": "3.71",
  "url": "https://www.goodreads.com/book/show/32320174-the-mandibles"
}