{
  "title": "Numenon: A Tale of Mysticism & Money",
  "description": "Will Duane has it all. Head of Numenon, the vast, multinational corporation he founded, Will is the richest man on the planet and makes more money with every breath. Still in his prime at 63, he has everything he needs to be on top of the world.But a force he cannot identify pursues Will Duane.The stalker.Driven by his need to win back the love of a mysterious woman, Will takes his top executives to a week long spiritual retreat in the New Mexico desert.His caravan of five RVs makes its way to the retreat site at the Mogollon Bowl. On this sacred land, perhaps the strongest power spot on earth, the ageless shaman known as Grandfather will lead the retreat.As Will and his team progress toward the site, all hell breaks loose. When the caravan becomes stalled, the unknown stalker strikes. Out of a horrifying attack, a new possibility is born ... and evil takes a new form.The survivors realize that they are approaching a reality beyond anything they can imagine. They must face their own terrors and weaknesses as they come face-to-face with what awaits them at the Mogollon Bowl.TESTIMONIALS & NUMENON is superbly written, and beautifully weaves a treasure-trove of spiritual and intellectual wisdom into the story. I am totally enthralled. Where's the sequel?----ILENE DILLON, MSW. Host, Full Power LivingFIVE STARS! A fantasy set in the real world to draw readers in and never let them go, NUMENON is highly recommended to readers seeking modern fiction with fantastical elements.-- MIDWEST BOOK REVIEWThe collision of commerce and spirit, the world's richest man and an ancient Native American shaman, a global corporation larger than any other and the quiet strength at the core of the natural world this is thriller and metaphor and life lesson in the hands of a writer who has journey'd through both worlds.--GERALD DiPEGO, Screenwriter, Phenomenon, Instinct, Message in a Bottle NUMENON HAS WON SIX NATIONAL AWARDS",
  "genres": [
    "Contemporary",
    "Philosophy",
    "Book Club",
    "Science Fiction Fantasy",
    "Fantasy",
    "Science Fiction",
    "Fiction"
  ],
  "author": "Sandy Nathan",
  "average_rating": "3.81",
  "url": "https://www.goodreads.com/book/show/3232771-numenon"
}