{
  "title": "Butterfly Politics",
  "description": "The minuscule motion of a butterfly's wings can trigger a tornado half a world away, according to chaos theory. Under the right conditions, small simple actions can produce large complex effects. In this timely and provocative book, Catharine A. MacKinnon argues that the right seemingly minor interventions in the legal realm can have a butterfly effect that generates major social and cultural transformations.Butterfly Politics brings this incisive understanding of social causality to a wide-ranging exploration of gender relations. The pieces collected here many published for the first time provide a new perspective on MacKinnon's career as a pioneer of legal theory and practice and an activist for women s rights. Its central concerns of gender inequality, sexual harassment, rape, pornography, and prostitution have defined MacKinnon's intellectual, legal, and political pursuits for over forty years. Though differing in style and approach, the selections all share the same motivation: to end inequality, including abuse, in women s lives. Several mark the first time ideas that are now staples of legal and political discourse appeared in public for example, the analysis of substantive equality. Others urge changes that have yet to be realized.The butterfly effect can animate political activism and advance equality socially and legally. Seemingly insignificant actions, through collective recursion, can intervene in unstable systems to produce systemic change. A powerful critique of the legal and institutional denial of reality that perpetuates practices of gender inequality, Butterfly Politics provides a model of what principled, effective, socially conscious engagement with law looks like.",
  "genres": [
    "Feminism",
    "Nonfiction",
    "Politics",
    "Philosophy",
    "Feminist Theory",
    "Womens",
    "Law"
  ],
  "author": "Catharine A. MacKinnon",
  "average_rating": "4.42",
  "url": "https://www.goodreads.com/book/show/32336636-butterfly-politics"
}