{
  "title": "Trick",
  "description": "A forced sentence leads to a reckless passion…….HadleyWhen my husband walked out on me over a year ago, it devastated me. When the divorce papers came, it killed me. When we had to sell our house, it broke me. But then he moved in with his new flavor of the month and told our daughter his new woman wasn’t into children. That pissed me off.Now Riley feels abandoned, and I can’t make it better; no matter how hard I try. I’m desperate to help her adjust to the loss of a male figure in her life. The companion program that matches adults up with children who have loneliness and abandonment issues is my last hope. The counselors tell me he’s doing community service hours, and I ask to sit in on his meetings with Riley. The minute I see him astride the matte black Harley, I know neither my nor Riley’s life will ever be the same again.TrickCommunity Service. Two words I should be thankful for, but I’m not. I resent the hours it’s away from building my business. The two previous kids I'd been paired up with didn’t work out because their mothers were more interested in getting in my bed. This next match with a little girl is my last hope. Unless this kid works out, I’m destined to serve time.When they push her into the room wearing pink converse with a black dress, her crazy curls barely held back by the barrette in her hair, and studious glasses on her face, I can tell she’s scared - of new people, of change, of being pushed aside. Something inside of me breaks, and I want this girl to feel wanted again.What I’m unprepared for is meeting her mom. The second our hands touch, there are fireworks, bright lights, and a picture of the future I could one day have. The future I’ve never allowed myself to wish for.Community service becomes more than a chore, more than time I resent for being taken away from me. In the months that follow, I realize they’re just like me: they’ve been abandoned, left behind by the world, forgotten by those who should love them.Thanks to the one last hope in both our lives - we found the light in the darkness we’d been searching for.",
  "genres": [
    "Romance",
    "Contemporary",
    "Contemporary Romance",
    "Childrens",
    "Audiobook",
    "Fiction",
    "Second Chance"
  ],
  "author": "Laramie Briscoe",
  "average_rating": "3.98",
  "url": "https://www.goodreads.com/book/show/32334421-trick"
}