{
  "title": "Full Metal Magic",
  "description": "Out of print. \n9 ALL NEW\n action packed stories from NYT & International Bestselling Urban Fantasy authors. THE BULL DEMON KING by J.A. Cipriano - Mac Brennan just wanted to take his girlfriend to the fair, but the Bull Demon King had other plans...\nTHE BLACK DOOR\n by Domino Finn - Cisco Suarez is dragged to the depths of the underground Miami nightlife, where seekers of arcane knowledge may just get their wish.\nDANCE OF THE DEAD\n by Sonya Bateman - Halloween in Manhattan gets weirder than usual for Gideon Black, who finds himself up against a powerful necromancer looking to raise a lot more than the dead.\nHARD ROW\n by Ambrose Ibsen - Demon-hearted brawler Lucian Colt prepares to trace a human trafficking operation to its fountainhead. But will he and his teammates prove a match for what awaits them in the seedy stretch of Hard Row?\nANGRY SPARK\n by Al K. Line - When an old vampire \"buddy\" calls you in the middle of the night, and asks for a favor, hang up on the them and stay the hell in bed. I was stupid. I got dressed, and nearly got dead soon after. \nFAMILY BUSINESS\n by Rob Cornell - Sorcerer Sebastian Light expects his first day as a demon hunter to go off without a hitch, but sometimes family issues are harder to slay than even the surliest of goblins.\nVALENTINE BLUES \nby James A. Hunter - As violence breaks out and people start dying, only Yancy Lazarus—bluesman, gambler, mage, and former wet-works man—can put things right. Well, he can try …\nA DRIVE IN THE COUNTRY\n by Craig Schaefer - For Daniel Faust, driving a condemned man to his death dredges up old memories and old ghosts. You can't outrun the past.\nCHASE THE DARK\n by Pippa DaCosta - New York’s sewers are infested with gators. As Ace Dante investigates, it becomes clear there’s something far worse beneath the streets, and it’s out for revenge.",
  "genres": [
    "Urban Fantasy",
    "Short Stories",
    "Fantasy",
    "Paranormal",
    "Magic",
    "Anthologies",
    "Mythology"
  ],
  "author": "J.A. Cipriano",
  "average_rating": "4.07",
  "url": "https://www.goodreads.com/book/show/32335076-full-metal-magic"
}