{
  "title": "White Heat",
  "description": "Never have the stakes been higher. Never have two people faced greater risks or grappled with deeper desire. Never has Cherry Adair–award-winning author of Hot Ice–burned the pages with so much blazing action and blistering passion. Professional art restorer Emily Greene is in no mood to see the devil-may-care Max Aries. She hasn’t forgotten–or forgiven–the way Max dropped into her life a year ago, stole her heart, then vanished without a word. Max hadn’t kept in touch with his father, Daniel, either. Daniel Aries had been a master of art restoration and reproduction, and not only Emily’s longtime mentor, but a trusted friend. His unexpected suicide devastates her. And when the prodigal playboy Max returns, her welcome is less than warm–even though his timely arrival in her bedroom saves her from a lethal intruder. But her fury gives way to fear when Max reveals that his father’s death was actually murder . . . and that Emily’s life is now in danger. Like it or not, to stay alive, Emily must put herself in Max’s hands. And once upon a time, that wasn’t such a bad place to be.But what killer would target professional restorers of Renaissance artworks? Max suspects that a pencil sketch found in his father’s studio, inscribed with a cryptic code, may hold the key. His hunch is confirmed when intel from his control at the counterterrorist organization T-FLAC reveals that the Black Rose terror cell is involved–a chilling revelation that elevates the threat level almost as high as the tension that’s bristling between Max and Emily. Max isn’t about to take his eyes off Emily–though only partly for professional reasons–and even Emily’s rage over Max’s take-charge attitude can’t compare to her anger at herself for so long denying the truer, deeper feelings she has for him. As they crisscross Europe, piecing together the shocking clues to an insidious international plot, dodging increasingly lethal traps, and passionately making up for too much lost time, they realize that–in more ways than one–they can’t live without each other. With no chance of turning back, Max and Emily must put their lives on the line, put their true feelings to the test . . . and get ready to take the heat.From the Hardcover edition.",
  "genres": [
    "Romantic Suspense",
    "Romance",
    "Suspense",
    "Contemporary Romance",
    "Contemporary",
    "Mystery",
    "Military Fiction"
  ],
  "author": "Cherry Adair",
  "average_rating": "4.01",
  "url": "https://www.goodreads.com/book/show/323884.White_Heat"
}