{
  "title": "Letorian Descendants",
  "description": "Librarian note: Older cover of B01LZ0P5ZL.Over 400 years ago, King Davalian, The Letorian King, protected the covens from the Pandions and townspeople during the days of the black plague and the witch hunts. Two very gifted sorcerers were part of his army and fought alongside him. One was a woman named Lily who not only helped him to victory, but won his heart. Lily was not at all interested in King Davalian. Her love was Connell, the other gifted sorcerer. During King Davalian’s rein, Lily discovered the secret to eternal life through a series of Talismans, a reborn vampire capable of having the powers of a vampire but the gift of age, death, and reborn back into the same family line. Lily first changed herself, Connell was to be next and they were to live out their lives, each generation, with each other. Except, that night, things went terribly wrong and even though both had been blessed with eternal life their bond was never completed. Instead, in a jealous rage, King Davalian cursed Connell and forced him to a life being controlled by the moon and to never forget his wrong. Connell was forced into a wolf and ran with the Pandions. Shortly after King Davalian was slayed and Lily became their Queen. King Davalian did leave her with one last gift, the devastating prophesy of her great granddaughter lingered over her and her descendants. Her great granddaughter would be slaughtered by the King to the Pandions; the talismans Lily created were to be found and they would be the demise to the Letorian Coven. The Pandions were destined to be the new ruling coven and destroy everything in its way to get there. The series begins with Lily’s great granddaughter, Casey Blane, a young girl of 16 who had constantly been made to move. She thought trying to fit in was her biggest problem. The Letorians thought it wise to keep her and her life hidden until the Pandions find her and what was prophesied begins to become a reality. What happens next will change her life forever.",
  "genres": [
    "Fantasy",
    "Young Adult",
    "Paranormal"
  ],
  "author": "Jodi Ann Fahey",
  "average_rating": "4.35",
  "url": "https://www.goodreads.com/book/show/32351984-letorian-descendants"
}