{
  "title": "The Eleventh Day: 9/11 - The Ultimate Account",
  "description": "Writing with access to thousands of recently released official documents, new interviews & perspectives coming from a decade of research & reflection, Anthony Summers & Robbyn Swan deliver the 1st panoramic, authoritative look at 9/11. For many Americans, 9/11/2001, is the darkest date in the nation's history. What exactly happened? Could it have been prevented? How & why did so much acrimony & bad information arise from the ashes of the World Trade Center, the Pentagon & a Pennsylvania field? What remains unresolved? What is certain: Discord & dissent continue to this day. Beginning with the 1st brutal actions of the hijackers of American Airlines Flight 11, The Eleventh Day tracks the sequence of events & introduces the players: pilots, terrorists, passengers & those who died on the ground. Drawing on previously classified records & raw transcripts, Summers & Swan investigate the response of President Bush & the military that day, & the failure to intercept the hijacked airliners. They document the untruths told afterward by US officials &, as counterpoint, consider the contentions of the 9/11 Truth movement. With meticulous research, they examine the personalities of those behind the onslaught, analyze their motives & expose the US intelligence blunders preceding the attacks. They note how afterward--without good evidence--the Bush administration tried to link 9/11 to Iraq. Finally, they confront the question the 9/11 Commission's report blurred: Were the terrorists backed by powerful figures in a foreign nation long viewed as a friend? Riveting, revelatory, thoroughly sourced & complete with extensive endnotes, The Eleventh Day is the essential one-volume work on a pivotal event.",
  "genres": [
    "History",
    "Nonfiction",
    "Terrorism",
    "Politics",
    "War",
    "American History",
    "The United States Of America"
  ],
  "author": "Anthony Summers",
  "average_rating": "4.10",
  "url": "https://www.goodreads.com/book/show/11983404-the-eleventh-day"
}