{
  "title": "نباح",
  "description": "النيل والفرات:\"كانت مجموعة الوفود لا تزال منغلقة فقوبلت جملته بالتحديق في وجهه من غير أن يجد رداً فأردف: نريد أن نخرج. ردّ مندوب الإعلام ضاحكاً: إلى أين يا أستاذ عمر.. إلى أي مكان فهنا الهواء ملعب… حاول المندوب الإعلامي أن يوازي بين كلماته: صنعاء ليست كالقاهرة أو بيروت، فصنعاء تنام باكراً. كل تكل الفتنة تنام مبكراً، هل يعقل أن ينام قصر غمدان والقليص، وعرش بلقيس والبردوني والمقالح وشجر القاتع وأن تأوي أسوار وقلاع الإمام للنوم بعد ثورة فتحت كل الأبواب، هل يعقل في هذه الساعة من غير أن تستذكر آلاف السنوات.. ألم تشبع من النوم الطويل في حضن الإمامية؟ الغياب لا يعني الإلغاء، نحن الذي نغيّب الأشياء ونستحضرها، نحن أقلام تكتب ما تشاء وتمحي ما تشاء، ثلاثة نساء استحضرهن دفعة واحدة: زوجتي ووفاء وسلوى.. تحضر اثنتان منهن، وتغيب سلوى مع أنها حاضرة أمامي لكنها غائبة في حضورها.. كانت تبحث في كل سنوات زواجنا عن تلك المرأة التي أحرقت مستقبلها برجل شاركها حياتها بنصف قلب محروق، كانت تبحث عن وسيلة تبقي هذا النصف حياً معها على أقل تقدير، وفي كل مرة تكتشف أنها استلمته كائناً منتهى الصلاحية. لماذا لا أكون معك في سفراتك المتلاحقة؟ في كل سفرة أحمل فيها حقائبي هرباً من هذه الأوتاد بحثاً عن سفينتها التي شقت البحار وتركتني كراكب أخرق نسيته على إحدى الموانئ من غير أن تفطن أنها نسيت قبطانها، أسعى في كل سفرة أن أكون وحيداً علني أجدها راسية في ميناء من الموانئ التي أجوبها بحثاً عنها.. لماذا لا أكون معك في سفراتك المتلاحقة؟ أثور عليهم فتعتصم بصمتها منكسة رأسها عابثة بأناملها أي شيء يجاورها. قبل عام تماماً انفجرت براكينها، قذفت بحممها في كل مكان. لم تعد تلك الساكنة التي تعبث بأناملها بأي شيء يجاورها غدت صورة لأمها، صورة مستفزّة تألب داخلي لأن يحرق كل الحطب الذي هيأه لإشعال جسد جعدة، كما كنت أشتهي دائماً، حملت سكيناً صغيراً في يدها، وأمسكت بثيابي مهددة. سأقتلك إن خرجت! دعيني أمضي فوقت الرحلة أزف. لن تمضي قبل أن أقتلك، أو تطلقين. طلقة رصاص تحتاج للضغط على الزناد فقط لتمضي مخترقة الأجساد والكون معاً… شددت شعرها بعنف: أنت طالق.. طالق!!.. الآن وكلما حزمت حقائب السفر أغلق باب شقتي بهدوء بعد أن أودع أطفالي عند جدتهم وأمضي نحو أمل يغوص في تضاريس اليمن. ها أنا في ميناء صنعاء، أتلفت في كل الوجوه علني أصطادها، وجبروتها ينز من كلماتها القديمة: أنا ابنة حضارة موغلة في الزمن أما أنت فجذورك رخوة. لماذا نرتد لمئات السنين فجأة.. نرقد للعروق بينما الأوراق متيبسة جافة... ها أنا في عمق الحضارة التي عنها ألاحق حنيناً قديماً وأهرب منه فيه..\".عندما يحتل داخلك الفراغ، يشكلك كيف شاء، تستطيل، تكبر تصبح هلامياً، تصبح عملاقاً، وتدور في دوامات، وتركض في الزمان، وتركض خارجه، وتركض في المكان، وتركض خارجه، هكذا يقنعك عبده خال بكل حالاته هذه، ففي لحظات انسياحاته الفراغية يرحل مع أفكار متشكلة بلا نمطية لطيفة، تتقاطع في مساحاتها واقعيات الحياة وأوهامها، السياسة والحنين، المشاكل الاجتماعية والخيال، الإرهاصات والذكريات الطفولة والنضج، الأماني والإخفاقات.. لن تقف للمبحث عن كل هذا وأنت تلتهم بجوارحك بمشاعرك وبفكرك استرسالات عبده خال من خلال شخصية روايته المحورية التي نسجها وتماهى معها، وربما تماهت معه.. الأمر سيّان، فالقارئ لا يملك إلا الاقتناع بوجود تلك الشخصية والأبعد من ذلك أنه جزء منها، أو أنها في بعض انحساراتها هي جزء منه.http://goo.gl/l3m3lm",
  "genres": [
    "Novels",
    "Fiction"
  ],
  "author": "عبده خال",
  "average_rating": "3.44",
  "url": "https://www.goodreads.com/book/show/3239208"
}