{
  "title": "Alpha's Feisty Mate",
  "description": "Book 1 of the multi-author series, Arcane Affairs AgencyThe Arcane Affairs Agency is ruled by four powerful beings and hidden from human eyes behind wards and spells. Agents are tasked with investigating and upholding paranormal law. Will the sexy heroes and delightful heroines discover love in the line of duty?Curvy Skye Watson is through with bad boys. For once in her life, she wants to meet a nice guy and have a serious, probably boring relationship. After three months of waiting for said nice guy, she can’t take it anymore. Out in the club with her sister, Nina, and their friends, she sets eyes on Aiden Ashwood, the new hunk in town. He’s tall, bulky in all the right places, covered in Norse tats, and his whole demeanor screams “danger!”. How could she possibly resist? A one-night stand never hurt anyone, right?Alpha wolf Aiden Ashwood is on a mission. The quiet town of Misty Falls is being terrorized by a rogue werewolf, and the townspeople aren’t even aware of the threat lurking in the shadows. The Arcane Affairs Agency sent him to investigate the three “animal attacks” in the past two weeks, and find the killer. Aiden has always been an efficient and focused agent. He closed all his cases without so much as breaking a sweat, and he expects this one to be no different. But then, hot, feisty Skye ends up in his bed, rocks his world, and leaves in the morning. He should have claimed her as his mate when he had the chance … Now he’s not even sure he’ll find her again.Soon, Aiden realizes the “animal attacks” are not the town’s only problem. Witches seem to be involved, and where there are witches, there’s always trouble. When he finds out one of the Watson girls might be a witch, he prays it’s not Skye. Alpha’s Feisty Mate is a full, standalone story. What to expect: a sassy, curvy beauty who might be lying about a couple of things, a hot Alpha who will do anything to protect her, and a sneaky villain who’s set on ruining them both.Note: Intended for readers 18+.",
  "genres": [
    "Romance",
    "Paranormal",
    "Shapeshifters",
    "Paranormal Romance",
    "Magic"
  ],
  "author": "Cara Wylde",
  "average_rating": "3.92",
  "url": "https://www.goodreads.com/book/show/32430327-alpha-s-feisty-mate"
}