{
  "title": "Dark Banquet: Blood and the Curious Lives of Blood-Feeding Creatures",
  "description": "For centuries, blood feeders have inhabited our nightmares and horror stories, as well as the shadowy realms of scientific knowledge. In Dark Banquet, zoologist Bill Schutt takes readers on an entertaining voyage into the world of some of nature’s strangest creatures—the sanguivores. Using a sharp eye and mordant wit, Schutt makes a remarkably persuasive case that vampire bats, leeches, ticks, bed bugs, and other vampires are as deserving of our curiosity as warmer and fuzzier species are—and that many of them are even ­worthy of conservation.Schutt takes us from rural Trinidad to the jungles of Brazil to learn about some of the most reviled, misunderstood, and marvelously evolved animals on our planet: vampire bats. Only recently has fact begun to disentangle itself from fiction concerning these remarkable animals, and Schutt delves into the myths and misconceptions surrounding them. Examining the substance that sustains nature’s vampires, Schutt reveals just how little we actually knew about blood until well into the twentieth century. We revisit George Washington on his deathbed to learn how ideas about blood and the supposedly therapeutic value of bloodletting, first devised by the ancient Egyptians and Greeks, survived into relatively modern times. Schutt also tracks the history of medicinal leech use. Once employed by the tens of millions to drain perceived excesses of blood, today the market for these ancient creatures is booming once again—but for very different reasons.Among the other blood feeders we meet in these pages are bed bugs, or “ninja insects,” which are making a creepy resurgence in posh hotels and well-kept homes near you. In addition, Dark Banquet details our dangerous and sometimes deadly encounters with ticks, chiggers, and mites (the ­latter implicated in Colony Collapse Disorder—currently devastating honey bees worldwide). Then there are the truly weird—vampire finches. And if you thought piranha were scary, some people believe that the candiru (or willy fish) is the best reason to avoid swimming in the Amazon.Enlightening, alarming, and appealing to our delight in the bizarre, Dark Banquet peers into a part of the natural world to which we are, through our blood, inextricably linked.From the Hardcover edition.",
  "genres": [
    "Nonfiction",
    "Science",
    "Nature",
    "Animals",
    "Biology",
    "Natural History",
    "History"
  ],
  "author": "Bill Schutt",
  "average_rating": "3.90",
  "url": "https://www.goodreads.com/book/show/3240640-dark-banquet"
}