{
  "title": "The Snow Lion and the Dragon: China, Tibet, and the Dalai Lama",
  "description": "Tensions over the \"Tibet Question\"―the political status of Tibet―are escalating every day. The Dalai Lama has gained broad international sympathy in his appeals for autonomy from China, yet the Chinese government maintains a hard-line position against it. What is the history of the conflict? Can the two sides come to an acceptable compromise? In this thoughtful analysis, distinguished professor and longtime Tibet analyst Melvyn C. Goldstein presents a balanced and accessible view of the conflict and a proposal for the future.Tibet's political fortunes have undergone numerous vicissitudes since the fifth Dalai Lama first ascended to political power in Tibet in 1642. In this century, a forty-year period of de facto independence following the fall of the Qing dynasty in 1911 ended abruptly when the Chinese Communists forcibly incorporated Tibet into their new state and began the series of changes that destroyed much of Tibet's traditional social, cultural, and economic system. After the death of Mao in 1976, the rise to power of Deng Xiaoping quickly produced a change in attitude in Beijing and a major initiative to negotiate with the Dalai Lama to solve the conflict. This failed. With the death of Deng Xiaoping, the future of Tibet is more uncertain than ever, and Goldstein argues that the conflict could easily erupt into violence.Drawing upon his deep knowledge of the Tibetan culture and people, Goldstein takes us through the history of Tibet, concentrating on the political and cultural negotiations over the status of Tibet from the turn of the century to the present. He describes the role of Tibet in Chinese politics, the feeble and conflicting responses of foreign governments, overtures and rebuffs on both sides, and the nationalistic emotions that are inextricably entwined in the political debate. Ultimately, he presents a plan for a reasoned compromise, identifying key aspects of the conflict and appealing to the United States to play an active diplomatic role. Clearly written and carefully argued, this book will become the definitive source for anyone seeking an understanding of the Tibet Question during this dangerous turning point in its turbulent history.",
  "genres": [
    "History",
    "China",
    "Nonfiction",
    "Politics",
    "Asia",
    "Buddhism"
  ],
  "author": "Melvyn C. Goldstein",
  "average_rating": "3.89",
  "url": "https://www.goodreads.com/book/show/323979.The_Snow_Lion_and_the_Dragon"
}