{
  "title": "Milk: The Surprising Story of Milk Through the Ages",
  "description": "Part cookbook—with more than 120 enticing recipes—part culinary history, part inquiry into the evolution of an industry, Milk is a one-of-a-kind book that will forever change the way we think about dairy products.Anne Mendelson, author of Stand Facing the Stove, first explores the earliest Old World homes of yogurt and kindred fermented products made primarily from sheep’s and goats’ milk and soured as a natural consequence of climate. Out of this ancient heritage from lands that include Greece, Bosnia, Turkey, Israel, Persia, Afghanistan, and India, she mines a rich source of culinary traditions.Mendelson then takes us on a journey through the lands that traditionally only consumed milk fresh from the cow—what she calls the Northwestern Cow Belt (northern Europe, Great Britain, North America). She shows us how milk reached such prominence in our diet in the nineteenth century that it led to the current practice of overbreeding cows and overprocessing dairy products. Her lucid explanation of the chemical intricacies of milk and the simple home experiments she encourages us to try are a revelation of how pure milk products should really taste.The delightfully wide-ranging recipes that follow are grouped according to the main dairy ingredient: fresh milk and cream, yogurt, cultured milk and cream, butter and true buttermilk, fresh cheeses. We learn how to make luscious Clotted Cream, magical Lemon Curd, that beautiful quasi-cheese Mascarpone, as well as homemade yogurt, sour cream, true buttermilk, and homemade butter. She gives us comfort foods such as Milk Toast and Cream of Tomato Soup alongside Panir and Chhenna from India. Here, too, are old favorites like Herring with Sour Cream Sauce, Beef Stroganoff, a New Englandish Clam Chowder, and the elegant Russian Easter dessert, Paskha. And there are drinks for every season, from Turkish Ayran and Indian Lassis to Batidos (Latin American milkshakes) and an authentic hot chocolate.\n\n\nThis illuminating book will be an essential part of any food lover’s collection and is bound to win converts determined to restore the purity of flavor to our First Food.",
  "genres": [
    "Food",
    "History",
    "Nonfiction",
    "Microhistory",
    "Food History",
    "Cooking",
    "Cookbooks"
  ],
  "author": "Anne Mendelson",
  "average_rating": "3.62",
  "url": "https://www.goodreads.com/book/show/3239059-milk"
}