{
  "title": "Peach Blossom Pavilion",
  "description": "In a sunny California apartment, a young woman and her fiancé arrive to record her great-grandmother's story. The story that unfolds of Precious Orchid's life in China, where she rises from a childhood of shame to become one of the most successful courtesans in the land, is unlike any they've heard before. . .When Precious Orchid's father is falsely accused of a crime and found guilty, he is executed, leaving his family a legacy of dishonor. Her mother's only option is to enter a Buddhist nunnery, so she gives her daughter over to the care of her sister in Shanghai.At first, life at Peach Blossom Pavilion feels like a dream. Surrounded by exotic flowers, murmuring fountains, colorful fishponds, and bamboo groves, Precious Orchid sees herself thriving. She is schooled in music, literature, painting, calligraphy, and to her innocent surprise, the art of pleasuring men. For the beautiful Pavilion hides its darker purpose as an elite house of prostitution. And even as she commands the devotion of China's most powerful men, Precious Orchid never gives up on her dream to escape the Pavilion, be reunited with her mother, avenge her father's death, and find true love. And as the richest, most celebrated Ming Ji or \"prestigious courtesan\" in all of China, she just might have her way even if it comes with a devastating price. . .Sweeping in scope and stunning in its evocation of China, Peach Blossom Pavilion is a remarkable novel with an unforgettable heroine at the heart of its powerful story. . . \"Riveting. . .a rare peek into an exotic culture that is thrilling, captivating, and moving.\" --Shobhan Bantwal, author of The Dowry Bride\"In the sure voice of Precious Orchid, Mingmei Yip recounts thirteen tumultuous years of Chinese history: vicious politics, pristine piety and heartrending scandal, framed in the classical arts. She writes with a painter's fastidious eye and the irresistible energy of grand storytelling. The pages just turn themselves.\" --Neal Chandler, Director, Creative Writing Program of Cleveland State University. \"Peach Blossom Pavilion, story of the last geisha in China, is told with amazing insight as if the author had lived in the tumultuous China of a century ago. Through her beautiful, lucid prose, Mingmei brings modern Western readers into the mysterious world of the cultivated courtesan.\" --Hannelore Hahn, Founder and Executive Director, International Women's Writing Guild.\"Peach Blossom Pavilion is a vivid account of the forgotten past.\" --Chun Yu, author of Little Green: Growing Up During the Chinese Cultural Revolution",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "China",
    "Asia",
    "Historical",
    "Asian Literature",
    "Romance"
  ],
  "author": "Mingmei Yip",
  "average_rating": "3.70",
  "url": "https://www.goodreads.com/book/show/3241816-peach-blossom-pavilion"
}