{
  "title": "The Band of Gypsies",
  "description": "As lush and colorful as a gypsy's scarf, The Band of Gypsies knits a haunting tale of youth and strife in Spain's Basque Country. In the turbulent Basque city of Bilbao, Jaime Aragon, a young foreign intern is mesmerized by a colleague, a mysterious American named Allison Flynn. She is beautiful, alluring, and haunted by a horrid past. Allison hints of a genuine interest in Jaime, but her close friendship with a charismatic young Spaniard, Francisco, who runs a secret ETA terrorist cell at the university complicates matters. His instincts scream for him to stay away from her. Still, he cannot help himself. Against the backdrop of Spanish fiestas and moonlit plazas sometimes marred by exploding Basque separatist bombs, Jaime pursues Allison. She is a complex woman; vulnerable, unpredictable, elusive. It is this very complexity that impels him toward her until he learns about a heart-rending secret that leaves his life in turmoil. Featuring a multicultural cast including French student Simone, Brazilian Elena, Scandinavian Bjorn, Californian Allison, and the novel's conflicted protagonist, Jaime, The Band of Gypsies takes readers on a journey of romance and intrigue that leads to eventual self-discovery. Sometimes humorous, often haunting, it explores the lives of college-age foreign interns lost in a faraway land.------------Bay Area author Enrico Antiporda has written a novel inspired by his life-changing experience as an AIESEC exchange intern (International Association of Students in Business and Economics). Within the framework of a love/adventure story and featuring a multicultural cast, The Band of Gypsies explores the lives of young foreign interns caught in the turbulence of the Basque separatist movement in Spain. The novel, loaded with cultural insights, was written as an inspiration for college students to participate in university-sponsored exchange programs. \"These programs are a great resource,\" the author notes. \"The benefits are not only academic, but also cultural. They prepare students for what has become a global economy by giving them an opportunity to live and work with people of other cultures. What an adventure.\" Antiporda adds, \"They housed us in four co-ed flats; sixteen interns from five continents, of different races, speaking different languages and getting along great. And in the middle of this were the intense clashes between the Basque Separatists and the Guardia Civil. It was unforgettable.\"",
  "genres": [
    "Romance",
    "Mystery"
  ],
  "author": "Enrico Antiporda",
  "average_rating": "3.61",
  "url": "https://www.goodreads.com/book/show/3242459-the-band-of-gypsies"
}