{
  "title": "Ve... Sonraki Hayattan Kırk Öykü",
  "description": "Guardian, Chicago Tribune, Scotsman ve Barnes and Noble 2009'un en iyi kitapları seçkilerinde\"Küçük bir büyük fikirler kitabı...Her öykü yeni bir Cennet.\" Brian Eno\"Eagleman gerçekten farklı. 'Ve...'yi okuyun, büyülenin. Tekrar okuyun, tekrar büyülenin.\" Time\"Bu nefis ve düşündürücü öykü derlemesi, son sayfa çevrildikten çok sonraları dahi okuyucunun zihnine musallat olmayı sürdüren o tuhaf, sınıflandırılması güç kitaplar kategorisine ait.\" Alexander McCall Smith, NY Times\"Şaşırtıcı derecede orijinal... Dudak uçuklatacak kadar dahice.\" Geoff Dyer, Observer\"'Ve...' dünyanızı ihtimaller ile zenginleştirecek ve bunu yaparken size bir insanın hayal gücünün ne kadar derin ve gizemli olabileceğini gösterecek.\" Mary Postgate, Scotsman\"Gerçekten muhteşem. Öykülerin yaratıcılığı, anlaşılırlığı ve zekiliği ile tüm kitaba hükmeden dinginlik birleşerek ortaya tamamen özgün bir yapıt çıkarıyor.\" Philip Pullman\"Bu yıl Eagleman'ın 'Ve...'sinden daha baş döndürücü bir kitap okuyamazsınız.\" Stephen FryÖldükten sonra başımıza neler gelir? Ve bu insanlığımız hakkında bize neler söyler?Sonraki hayatta Tanrı'nın bir bakteri boyutunda ve varlığınızdan tamamen bihaber olduğunu keşfedebilirsiniz ya da yanınızda yalnızca hatırladığınız insanları bulabilirsiniz. Kimi sonraki hayatlarda tüm yaşlarınıza ayrılmış halinizdesinizdir, kimisinde kredi kart kayıtlarınıza bakılarak yeniden yaratılırsınız, kimisindeyse aslında olabileceğiniz ama olmadığınız kişiliklerinizin moral bozucu varlıklarıyla birarada yaşamanız gerekir.Eagleman aynı anda hem komik, hem hüzünlü hem de sarsıcı olabilen kurmaca öyküleriyle geleneksel kavramlar kulesini yerle bir ediyor ve bizlere kendimizi 'burada' ve 'şimdide' görmemizi sağlayan, büyüleyici bir mercek sunuyor. Dudak uçuklatıcı bir hayal gücüne dayanan bu öykülerin kökleri bilime, romantizme ve gizemli varoluşumuza yönelik huşuya dek uzanıyor. Bu kitap, ölüm, ölümsüzlük, ümit, aşk, biyoloji ve insanlığımızın yepyeni çehrelerini ortaya çıkaran arzunun bir karışımı.YazarDAVID EAGLEMAN New Mexico'da büyüdü. Üniversite eğitimini İngiliz ve Amerikan Edebiyatı üzerine yaptıktan sonra sinirbilim dalında doktorasını tamamladı. Teksas, Houston'daki Baylor Tıp Fakültesi'nde, Algı ve Eylem Laboratuvarı'nın başında olan Eagleman, Sinirbilim ve Hukuk Teşebbüsü'nün de kurucu ve yöneticisi.",
  "genres": [
    "Fiction",
    "Short Stories",
    "Philosophy",
    "Fantasy",
    "Religion",
    "Science Fiction",
    "Death"
  ],
  "author": "David Eagleman",
  "average_rating": "4.12",
  "url": "https://www.goodreads.com/book/show/11984748-ve-sonraki-hayattan-k-rk-yk"
}