{
  "title": "On The Frontlines Of The Television War: A Legendary War Cameraman In Vietnam",
  "description": "“Tony Hirashiki was simply one of the best television cameramen to cover the Vietnam War. His soaring video, often acquired only at great personal risk, gave wings to even the most mundane narration. For those of us who worked with him he was also a source of gentleness and joy in a place where both were in terribly short supply.” - Ted Koppel, Former Nightline anchor ABCOn The Frontlines of the Television War is the story of Yasutsune \"Tony\" Hirashiki's ten years in Vietnam—beginning when he arrived in 1966 as a young freelancer with a 16mm camera but without a job or the slightest grasp of English and ending in the hectic fall of Saigon in 1975 when he was literally thrown on one of the last flights out.His memoir has all the exciting tales of peril, hardship, and close calls as the best of battle memoirs but it is primarily a story of very real and yet remarkable people: the soldiers who fought, bled, and died, and the reporters and photographers who went right to the frontlines to record their stories and memorialize their sacrifice. The great books about Vietnam journalism have been about print reporters, still photographers, and television correspondents but if this was truly the first “television war,” then it is time to hear the story of the cameramen who shot the pictures and the reporters who wrote the stories that the average American witnessed daily in their living rooms.An award-winning sensation when it was released in Japan in 2008, this book been completely re-created for an international audience. In 2008, the Japanese edition was published by Kodansha in two hardback volumes and titled \"I Wanted to Be Capa.\" It won the 2009 Oya Soichi Nonfiction Award-a prize usually reserved for much younger writers—and Kodansha almost doubled their initial print run to meet the demand. In that period, he was interviewed extensively, a documentary was filmed in which he returned to the people and places of his wartime experience, and a dramatization of his book was written and presented on NHK Radio. A Kodansha paperback was published in 2010 with an initial printing of 17,000 copies and continues to sell at a respectable pace.\"Tony Hirashiki is an essential piece of the foundation on which ABC was built. From the day he approached the Bureau Chief in Saigon with a note pinned to his shirt saying he could shoot pictures to the anxious afternoon of 9/11 when we lost him in the collapse of the Twin Towers (and he emerged covered in dust clutching his precious beta tapes,) Tony reported the news with his camera and in doing so, he brought the truth about the important events of our day to millions of Americans.\" David Westin, Former President of ABC NewsTable of ContentsForeword by Ted KoppelEditor’s NotePrefacePART I: GOOD LUCK OMIKUJI1.\tHappy Valley2.\tRookie3.\tTeacher4.\tHawks or Doves5.\tThe Bureau6.\tCon Thien7.\tMeet the Bosses8.\tIndependent Guy9.\tHe Loved Mozart10.\tSon of a Minister11.\tVeteran12.\tTuckner’s CrouchPART II: BAD LUCK OMIKUJI13.\tCompetition14.\tCharming Dictator15.\tReinforcements16.\tPhotographers17.\tAmerican Guy18.\tDocumentarian19.\tQuiet in Kontum20.\tRoger Returns21.\tBattle of An Loc22.\tQuang Tri23.\tSurvivor’s Guilt24.\tCeasefire25.\tFall of Cambodia26.\tFall of SaigonEpilogAcknowledgments and ThanksNotesIndex",
  "genres": [
    "Memoir",
    "History",
    "War",
    "Journalism",
    "Nonfiction"
  ],
  "author": "Yasutsune Hirashiki",
  "average_rating": "4.21",
  "url": "https://www.goodreads.com/book/show/32445362-on-the-frontlines-of-the-television-war"
}