{
  "title": "No Mercy",
  "description": "“I’m going to have you, baby,” he said gruffly. At the same time he roughly grabbed my panties and ripped them from my body. Rock’s the VP of Phantom Riders MC. Dangerous. Unpredictable. Ruthless. A killer who’ll stop at nothing to keep what’s his. Allie had given Rock her virginity, and then disappeared after she got pregnant. Club trouble doesn't stop him from showing up at her door seven years later, demanding his son, and claiming her. Excerpt - Lightning flashed throughout the room, causing me to wince at its closeness. The thunder that followed caused the windows to rattle. “You have no right−” “You keep saying that, babe.” He ran his lips up and down the side of my neck, causing goose bumps to cover my flesh. His hand moved to the hem of my dress. I panicked. “Rock−no!” He pulled the wet material until it was bunched at my thighs, and easily prevented my hand from removing his when I’d foolishly tried. “What do you think you’re doing?” I asked in a low tone. His low rumble against me stimulated certain needs in my body. My hand remained over his as he continued slowly until he’d reached the elastic to my panties. I held my breath, listening to his heavy breathing in my ear. His fingers teased the crease where the elastic rested, before flicking over the small triangle of silk covering my sex. I released a moan of pleasure, my knees buckling. “You like that.” He stated it as a fact, running his finger over the material. I knew I was wet, and not from the rain. “You always did.” His tongue, teeth, and lips were moving over my skin as he said the words in a tone designed to ramp up the heat. I arched my neck to the side so he had better access. He made a rough sound, taking the edge of my halter top in his teeth and pulling it down my shoulder. The louder the storm turned outside, the more intense the storm inside me became. NO CLIFFHANGERS! STANDALONG ROMANCE.",
  "genres": [
    "Contemporary",
    "Romance",
    "Crime",
    "Erotica"
  ],
  "author": "Tory Richards",
  "average_rating": "3.92",
  "url": "https://www.goodreads.com/book/show/32443561-no-mercy"
}