{
  "title": "The Tokaido Road: A Novel of Feudal Japan",
  "description": "So lonely am IMy soul is a floating weedSevered at the rootsThis is how Lady Asano has felt since the forced suicide execution of her father. Adrift in a dangerous world, Lady Asano vows to avenge her father's death and restore his name to honor. to do so, she will have to travel the Tokaido Road.Lucia St. Clair Robson is renowned for her beautifully written and carefully researched historical novels about the American Indian: The Washington Post proclaimed Walk in My Soul \"a richly detailed, rousingly good story\" and The Kirkus Reviews praised Light a Distant Fire for its \"brilliant word-portraits of memorable characters.\" Now, Robson has turned her remarkable storytelling gifts and her passion for historical accuracy to a place and time that have been long close to her heart, feudal Japan.As the novel opens, Lady Asano has transformed herself into Cat, a high-ranking courtesan, to support her widowed mother. Yet Cat's career is temporary; the powerful Lord Kira's campaign against her family is continuing and she must find Oishi, leader of the samurai of the Asano clan, weapons master, philosopher and Cat's teacher. Cat believes he is three hundred miles to the southwest in the imperial city of Kyoto.Disguising her loveliness in the humble garments of a traveling priest, Cat begins her quest. All she has is her samurai training - in Haiku and Tanka poetry, in the use of the deadly six-foot weapon, the naginata, and in Japanese Zen thought. And she will need them all, for a ronin has been hired to trail her.The ronin, a lordless samurai, is Tosa no Hanshiro. His weapon is the traditional longsword, a two-hundred-year old Kanesada blade. But he will find cunning adversaries in cat and her faithful traveling companion Kasane. A peasant girl, Kasane is simple, her poetry a little crude. But her devotion to cat runs deep.Both picturesque and tragic, filled with the grand poetry, chivalrous love, and rollicking goings-on of the era, The Tokaido Road is a stunning achivement by a novelist writing at the peak of her considerable powers.",
  "genres": [
    "Historical Fiction",
    "Japan",
    "Fiction",
    "Historical",
    "Adventure",
    "Romance",
    "Asia"
  ],
  "author": "Lucia St. Clair Robson",
  "average_rating": "4.13",
  "url": "https://www.goodreads.com/book/show/1198480.The_Tokaido_Road"
}