{
  "title": "Forced",
  "description": "Forced by the Greek Tycoon Jinna couldn’t understand how just one week before her wedding, she was ordered by her monstrous boss, Demetrio Zarakis, to call it off. He gave her another option—go to jail for robbing his personal safe. Jinna thought there must be a misunderstanding because her merciless boss would never fake a robbery to stop her from marrying somebody else . . . or would he? Driven by a desperate need for money, Jinna found herself trapped in a two-year contract as a PA to Demetrio Zarakis, the coldhearted Greek tycoon. After she accompanied him to Greece, it was no easy task keeping her body, soul, and personal life out of her dominant boss’s reach. Her instinct told her from the beginning that this man was a predator and that if she let him into her life in any way, he could devour her. After two years of keeping a strict distance between them, carefully rejecting his advances, and watching him change his colors from gentle courtship to menacing rage, a big bundle of fear settled in her heart, and this was before the contract period ended. Jinna was relieved that the contract was about to end, and she had numerous plans for a cheerful life outside of her intimidating boss’s presence. But this was all crushed when she learned the hard way how far Demetrio Zarakis would go to get what he wanted. “There’s no doubt you’re already in my power, Jinna, and you belong either by my side or under my feet.” But would it be possible for Jinna to get away from him even when her own heart didn’t seem to be on her side anymore? Seduction and Humiliation Known for his ultimate power and determination, Demetrio Zarakis is like a tornado. When he sets his mind on something, whatever stands in the way is either removed or crushed. What he wants this time is Jinna, a hardworking young woman, who has proved to be the most unattainable woman he ever met. For him ,Jinna is an obsession who has turned into an addiction. Whatever stands between the ruthless tycoon and his goal would be broken as usual,even if it's the spirit and will of the woman he loves. Through a devilish mixture of seduction and humiliation, the most lofty heads could be lowered ... couldn't they? Retribution Jinna's life was turned upside down. She was forced to break her engagement to the man she loved. She became a target of despise by her people and she was trapped into marrying Demetrio Zarakis, the tyrant behind all her misery. Jinna had always thought of Demetrio as invincible and ruthless, a man like him you could only try to survive not fight. Will Jinna dare to break free? PS. this story is not intended to be a soft romance, so, it can contain some violence and scenes that may be considered disturbing to some readers.",
  "genres": [],
  "author": "Julia Ban",
  "average_rating": "2.97",
  "url": "https://www.goodreads.com/book/show/32473262-forced"
}