{
  "title": "No Rest for the Wicked",
  "description": "Nicolas Docrenzov is an ex-con freshly released after serving eight years in Ogdensburg Correctional Facility. Trying to escape the brutal mistake that had landed him in prison, he moves to Los Angeles to begin anew. Shortly after his arrival, he’s offered a job at Venezia, a gentlemen’s club, run by the alluring Isabella Rossi and he starts to believe that fortune is finally starting to turn in his favor. As sparks begin to fly between the ex-con and his boss, Nico is even more hopeful that he will have the life he’s always craved.Harlan Colter, a determined and often times pig-headed Texan, is a detective with the Los Angeles Police Department. Originally a Texas Ranger, he lost everything, including his marriage, after he was pushed out for not letting sleeping dogs lie. After relocating to Los Angeles, the gruff Texan found his second chance at being a lawman and he’s determined to do what he can to keep his new home safe. No matter the cost Harlan Colter will not be stopped; he will not be deterred.Neither of these men could have foreseen what would bring them together. Just as Nicolas begins to settle into his life at Venezia, women associated with the club are being brutally, and impossibly, murdered one by one. As the case lands on Colter’s desk, all of the detective’s instincts tell him that somehow Nicolas is at the center of these terrible slayings despite the lack of any hard proof.Despite the lack of evidence indicating Nicolas as the murderer, as the murders and the subsequent investigation unfold it does become apparent that these murders are oddly connected to his past. A past that no one in Los Angeles knows anything about. A past that has caught up to him in ways that he could never have imagined.Can Nicolas not only prove his innocence, but discover who is perpetrating these terrible murders, and why? Will Detective Colter get his man, and continue protecting his new home? Will either man be able to live their lives on their own terms, or will they continue to be victims of their respective pasts?",
  "genres": [
    "Thriller"
  ],
  "author": "Vincent Alcaras",
  "average_rating": "4.13",
  "url": "https://www.goodreads.com/book/show/32454202-no-rest-for-the-wicked"
}