{
  "title": "Every Trick in the Rook",
  "description": "Julia Lanchester’s perch is knocked askew when murder hits a little too close to home in this delightful cozy mystery. “Marty Wingate’s Birds of a Feather mysteries provide a perfect blend of quirky characters and atmosphere.”—Christine Goff, bestselling author of the Birdwatcher’s Mystery series   Julia Lanchester is flying high. She’s nesting with her boyfriend, Michael Sedgwick, and she’s found her niche as manager of the tourist center in her picturesque British village. Thanks to all her hard work, visitor traffic was up—way up. Her reward is an even more hectic schedule. Michael’s busy, too, traveling all over as the personal assistant to Julia’s father, celebrity ornithologist Rupert Lanchester. With precious little time together, Julia’s romantic weekend with Michael can’t come soon enough.   But the getaway is spoiled when Julia’s ex-husband is found murdered on her boss’s estate. And after a witness reports seeing Michael near the scene of the crime, the press descends, printing lies and wreaking havoc. To protect Julia, Michael vanishes into thin air, leaving her to pick up the slack on Rupert’s show and track down the real killer—even if it means putting herself in the flight path of a vicious predator.   Don’t miss any of Marty Wingate’s charming Birds of a Feather  THE RHYME OF THE MAGPIE | EMPTY NEST | EVERY TRICK IN THE ROOK   And look for her captivating Potting Shed  THE GARDEN PLOT | THE RED BOOK OF PRIMROSE HOUSE | BETWEEN A ROCK AND A HARD PLACE | THE SKELETON GARDEN | THE BLUEBONNET BETRAYALPraise for Marty Wingate “Marty Wingate plants clever clues with a dash of romantic spice to satisfy any hungry mystery reader.”—Mary Daheim, bestselling author of the Emma Lord series",
  "genres": [
    "Mystery",
    "Cozy Mystery",
    "Cozy",
    "Audiobook",
    "Fiction",
    "British Literature",
    "Crime"
  ],
  "author": "Marty Wingate",
  "average_rating": "4.35",
  "url": "https://www.goodreads.com/book/show/32468817-every-trick-in-the-rook"
}