{
  "title": "Highlander's Shifter",
  "description": "Alternate cover edition of ASIN B01LXQWTYDNew York Times Bestselling Author Joanne Wadsworth brings you another bestselling Highlander time travel series blending the world of the faerie with the Clan Matheson bear shifters. Readers are loving it!He seeks the one his heart desires... With their fae-blooded clan teetering on the verge of extinction, Jamie Matheson finds himself battling a deep attraction to one of the few remaining unmated women within his clan, a woman he’s not permitted to touch unless a soul bond forms between them. Like his fellow clansmen, he must ensure her protection, even if that means from himself.Annabella wishes to forge a mated bond with only one man, yet when Jamie treks deep into the Highlands in order to put some distance between them, she soon discovers not all is as it seems, not when her very spirit calls out to Jamie’s from across the ages. It appears they’ve both lived in two separate times, here in the future and far in the past, and now if they ever wish to complete the bond and come together as one, they must first right the wrongs of their deadly past. It’s time to return to when they first discovered their mated bond began, the year 1211.Come and immerse yourself in this riveting historical time travel romance, one which crosses the centuries and brings together lost souls.Each book in this series is standalone, and can be enjoyed out of sequence.THE MATHESON BROTHERS SERIESHighlander's Desire, #1Highlander's Passion, #2Highlander's Seduction, #3Highlander's Kiss, #4Highlander's Heart, #5Highlander's Sword, #6Highlander's Bride, #7Highlander's Caress, #8Highlander's Touch, #9Highlander's Shifter, #10Highlander's Claim, #11Highlander's Courage, #12",
  "genres": [
    "Time Travel",
    "Paranormal",
    "Paranormal Romance",
    "Historical Romance",
    "Scotland",
    "Romance",
    "Warriors"
  ],
  "author": "Joanne Wadsworth",
  "average_rating": "4.07",
  "url": "https://www.goodreads.com/book/show/32454206-highlander-s-shifter"
}