{
  "title": "Ready to Roll",
  "description": "Suzanne Brockmann returns to the action-packed world of her bestselling Troubleshooters series with a new novella featuring U.S. Navy SEAL Izzy Zanella, his extended family, and his kickass teammates in SEAL Team Sixteen.  The only easy day is yesterday. BUD/S (Basic Underwater Demolition/SEAL) training is known for being the toughest, meanest, most physically punishing program in the entire U.S. Navy, and a new crop of tadpoles have arrived in Coronado eager to prove their worth—to make it through Hell Week, and become U.S. Navy SEALs.  Although Izzy prefers assignments out in the “real world,” he’s glad to be an instructor for the current BUD/S class, because it allows him to spend time at home with his wife, Eden, and her lively and lovable extended family.  Eden’s sixteen-year-old brother, Ben, is dealing with a new crush and a homophobic bully in his high school, but it soon appears that things are not as they seem.  Meanwhile, Eden’s other brother (and Izzy’s SEAL teammate and former frenemy) Danny Gillman and his wife Jenn have just had a baby who has colic and cries constantly.  As Ben deals with the type of too-serious high school drama that could involve a body count, and Danny and Jenn juggle a new baby, lack of sleep, and postpartum blues, Izzy is intrigued by “Boat Squad John,” a misfit team of young SEAL candidates all named John, including the intriguing young Seagull, his swim buddy Timebomb, and Seagull’s nemesis Hans.  Does Seagull have what it takes keep Boat Squad John still standing when the dust of BUD/S Hell Week settles or will they ring out?  Set in Coronado during BUD/S training Hell Week, in Ready to Roll Brockmann introduces the SEAL officer and instructor nicknamed Grunge—Lt. Peter Greene—as she delivers what she does best: a story celebrating the U.S. Navy SEALs—and the women (and sometimes men) who wholeheartedly love and support them. (About 56,000 words or 225 pages)  Note: Ready to Roll is the third installment in a trio of stories featuring Izzy Zanella that starts in Free Fall and continues in Home Fire Inferno (Burn Baby Burn) originally published in Way of the Warrior, a charity anthology of military romance stories with proceeds benefiting military veterans.",
  "genres": [
    "Romance",
    "Military Fiction",
    "Romantic Suspense",
    "Novella",
    "Audiobook",
    "Fiction",
    "Suspense"
  ],
  "author": "Suzanne Brockmann",
  "average_rating": "4.28",
  "url": "https://www.goodreads.com/book/show/32461568-ready-to-roll"
}