{
  "title": "American Dream: Interviews with Industry-Leading Professionals",
  "description": "Let's face Nobody becomes successful on his or her own. If you want to maximize your career potential, you have to find ways to stay inspired and motivated.This book includes six in-depth interviews with leading professionals from a variety of industries to provide you with the advice, inspiration, and motivation you need to achieve your goals.Peter MalloukPeter Mallouk is the president of Creative Planning, twice named the #1 Wealth Management Firm in America by CNBC. He has been personally featured three years in a row as the #1 Independent Advisor in America by Barron’s.Ben CaballeroBen Caballero has been the top-ranked real estate professional in America since 2013 in two categories — number of real estate sales transactions, and cumulative transaction (dollar) volume — as published by the Wall Street Journal and as independently confirmed by REAL Trends. His lifetime production exceeds 20,000 sales and $6 billion, making him the most productive real estate agent in history.B.J. ArmstrongThis top NBA sports agent, whose clients include Derrick Rose and Draymond Green, is a former athlete and three-time NBA champion who once shared the court with basketball greats including Michael Jordan.Shelly SunShelly is the CEO and co-founder of BrightStar Care, a national home care and medical staffing agency with 315 locations and $350 million in annual system-wide revenue. You may also recognize her from the popular TV show Undercover Boss .Scott GerberScott Gerber, principal and CEO of Gerber Group, is widely viewed as a leading entrepreneur in the hospitality/food and beverage industry, appearing on shows such as CNBC's Squawk on the Street , Fox News , and CBS’s Undercover Boss .Liz EltingLiz is the co-CEO and co-founder of TransPerfect, the world's largest privately held provider of language and technology solutions for global business, with over 4,000 employees in 90 cities worldwide.Whether you are looking to climb the corporate ladder, become a record-breaking professional athlete, or grow your own business from the ground up, you will find the inspiration you need within the pages of this book.",
  "genres": [
    "Business",
    "Nonfiction"
  ],
  "author": "Jason Navallo",
  "average_rating": "4.05",
  "url": "https://www.goodreads.com/book/show/32486296-american-dream"
}