{
  "title": "The One",
  "description": "Is following your heart worth having it broken?Seventeen year-old Chelsea Davenport is winding up the summer before her senior year at her sister Charley’s engagement party. Life is good and uncomplicated in the mountains. Her family is great. She is looking forward to starting school, applying to colleges, dancing again, and all the other things that go with high school…except the boys. Chelsea is sick of boys. And then Kyle Davis appears at the party and turns her world upside down.Kyle and Chelsea go way back as family friends, but he’s been away at prep school for a few years, playing football, trying to stay out of trouble, and away from the mess his family has become after his sister’s accidental death three years earlier, and then, more recently, his father’s suicide. The once arrogant and golden Kyle has returned, but he is not the Kyle she knew. Something about him has changed. He seems adrift in a sea of anger and depression, and she is riveted to him, wanting to understand and help. At first she doesn’t realize he is just as thunder-struck by her, but then his feelings become clear. Chelsea isn’t the only girl who wants football player Kyle, and the local mean girl, Elle, is armed for battle and ready to take on anyone to have Kyle for herself. So, who will win his heart? Can anyone unlock Kyle’s soul? Is the heartache over for Kyle, or is it just beginning? Can Chelsea get involved and stay true to what she believes about life and love?Set in the mountains of North Carolina, The One is a poignant contemporary story about family, self-discovery, and finding first love. In this time, when civility has all but disappeared from some of our lives, it is refreshing to remember there is another way to live…and love. Kyle and Chelsea’s story may cause readers to reminisce over their own first loves, or make them wish for one. Whatever the case, it’s a nice place to be!Look for the sequel, Second Time’s a Charm, coming in 2011.",
  "genres": [
    "Romance",
    "Young Adult"
  ],
  "author": "Mary Flinn",
  "average_rating": "4.14",
  "url": "https://www.goodreads.com/book/show/11986236-the-one"
}