{
  "title": "كهفي صديقي",
  "description": "للمعاينة والتحميلاستبدلنا كأس الخمر بالموبايلسَيْطَر اليهودُ في الماضي على الحانات وعُلَبِ الليل، وتقرَّبوا مِن صفوة المجتمعاتوأثريائها، يُجالسونهم وينتشرون بين المجتمعات بين الناس؛ لِيُعطوا لهم آراءهم ونصائحَهم،ويحكموا بينهم في النزاعات والتناحُرات، ثم اصبحوا هم اسياد وارباب المال والتجارةوصعدوا على مقاعد من تقربوا اليهم في السابق , بهدف نصحهم بعد ان اصبحوا هم اهلللرأي والمشورة , وبهذا نجحت افعتهم في الماضي بالتسلل الى مضاجع الاثرياء والسلاطينومعرفة دسائسهم واسرارهم ومكنونات قوتهم وضعفهم .أمَّا في الحاضر فقد اخترعوا التكنولوجيا والإنترنت، وكانوا خلْف تلك الطفْرة التكنولوجيةالمفاجئة، وصمَّموا المنتديات ومواقعَ التواصُل الاجتماعي، لكي يُراقِبوا كلَّ ما يحدُث للبشر.مِن أعلى نقطةٍ استحوَذوا عليها في الخفاء، لا يراهم أحد، ولا يعلم بوجودهم أحدوبذلك يؤلفون الخطط , ويوظفون العقول ويوجهون قطعان البشر نحو ما يريدونه , فإنارادوا ثورة بثوا الفوضى واخبار الفساد , وان ارادوا محو العادات والتقاليد وميزان الدينمن العقول بثوا العري والفحشاء , واخترعوا مبادئ وقيم جديدة تكون بديلة لما محوه من, العقول , ويجعلونها بين الناس من خلال مراكزهم على شبكة الانترنتومن خلال ذلك يتبع الناس افكارهم ويتناقلونها بينهم , دون ان يشعروا ان احد قام بخلقكل ذلك النظام , ووظف مقدراته لكي يصنع العقول من جديد , ويوجه الشعوب نحو مايريده هو في نهاية الامر .وبذلك استبدل اليهود الحانات بمواقع التواصل الاجتماعيواصبحوا كما في السابق هم اهل الرأي والنصح لكافة البشر , دون ان يراهم احد خلفالاحداث , بل كانوا دائما خلف الكواليس يبثوا ما يريدونه عبر صفحات تلك المواقع , عبر استطلاعاتالرأيوصور الكوميكس والمميز والصور المقولبة المضحكة والمقالات السياسية والاجتماعية وعبرتعليقات حسابات مجهولة واشخاص , قد وقفوا خلفهم وجعلوهم مع الوقت مشاهيرا لتلكالمواقع , ولهم محبين ومتابعين بالألاف وهؤلاء هم الاعلام الجديد والميديا الجديدة ,وهم اهل الرأي الجدد , يطلقون آرائهم في الاحوال السياسية والعسكرية والاجتماعيةوالثقافية ويتبع حديثهم الناس .ولم يفكر هؤلاء الناس ان من صنع عقول هؤلاء الشباب المتمدينين المتحررين من كل القيود , قد وضعفيها كل ما. يناقض الوحي الالهي، وكل ما يفسد علاقات البشر والمجتمعاتوبجهل الناس قد نجح هؤلاء ومن وقف خلفهم من فسدة اليهود، في استبدال مبادئ البشر.. وقيمهم ونظرتهم للحلال والحرام مع الوقت، دون ان يشعر الناس بذلك التغييروكما كان الناس يتراقصون في الحانات، ويتمايلون ويظهرون عورتهم ويضربون علىاجسادهم، أصبحوا بواسطة التكنولوجيا يفعلون أكثر من ذلك، واستبدلوا كأس الخمربالموبايل، ها نحن نعرض بيوتنا واسرارنا امام عامة الناس ويراها الكاره لنا قبل المحب،وانظر حولك وشاهد ما آلت اليه امورنا بعد هذا التقدم المفاجئ، وسترى عندها المحرك. الرئيسي لهذا التقدم ومدبر مساراته وخططه ومحرك عقول العامة بواسطتهاوفي هذا الكتاب نكشف بعض سموم افعتهم ونراقب مساراته.",
  "genres": [],
  "author": "على الطاهر",
  "average_rating": "3.44",
  "url": "https://www.goodreads.com/book/show/32489117"
}