{
  "title": "Highlander Ever After",
  "description": "Scotland 1820 When Zarabeth of Nvengaria is in danger, her cousin Prince Damien knows there's no safer place he can send her than to his old friend Egan MacDonald and his castle in the remote Scottish Highlands.  Egan has loved Zarabeth since the day she kissed him in her father’s house five years ago, his young friend having blossomed into a beautiful woman. Since then, Zarabeth married, but she recently discovered that her husband was a treacherous plotter, ready to overthrow her cousin Damien and take over Nvengaria. She slips away at great risk to herself and informs Damien, who sends her to Scotland, in the company of a half-logosh called Valentin to protect her, out of reach of her cruel and vengeful husband.  Egan finds Zarabeth a rigid shell of a woman. He undertakes to strip away the layers she’s been forced to wear, to expose the true, spirited, beautiful Zarabeth he’d known. At the same time, Zarabeth is determined to show Egan how much she cares for him—has always cared for him.  She also comes to life in the castle whose beams are likely to fall on her, and which is supposedly under a curse, where Egan’s cousins, sister, nephews, and neighbors swarm at will, returning joy and laughter to Zarabeth’s world. Egan’s nephew Jamie is determined to marry Egan off so Jamie won’t have to inherit, and recruits Zarabeth to help him. Zarabeth falls in love with Castle MacDonald and its inhabitants and never wants to leave—curse or no curse.  Zarabeth grows interested in the curse and its history—anything magical fascinates her. She herself has a magical gift, inherited from her Nvengarian mother—she can read thoughts, which was how she learned of her husband’s treachery.  But there is one person she’s never been able to read—Egan MacDonald, the Mad Highlander, the man she’d give her heart to, and her entire life if he wished it …  Nvengaria series, Book 3. This is a full-length novel.",
  "genres": [
    "Historical Romance",
    "Romance",
    "Historical",
    "Paranormal",
    "Paranormal Romance",
    "Fantasy",
    "Scotland"
  ],
  "author": "Jennifer Ashley",
  "average_rating": "3.92",
  "url": "https://www.goodreads.com/book/show/32489221-highlander-ever-after"
}