{
  "title": "Good Booty: Love and Sex, Black and White, Body and Soul in American Music",
  "description": "NPR Best Books of 2017In this sweeping history of popular music in the United States, NPR’s acclaimed music critic examines how popular music shapes fundamental American ideas and beliefs, allowing us to communicate difficult emotions and truths about our most fraught social issues, most notably sex and race.In Good Booty, Ann Powers explores how popular music became America’s primary erotic art form. Powers takes us from nineteenth-century New Orleans through dance-crazed Jazz Age New York to the teen scream years of mid-twentieth century rock-and-roll to the cutting-edge adventures of today’s web-based pop stars. Drawing on her deep knowledge and insights on gender and sexuality, Powers recounts stories of forbidden lovers, wild shimmy-shakers, orgasmic gospel singers, countercultural perverts, soft-rock sensitivos, punk Puritans, and the cyborg known as Britney Spears to illuminate how eroticism—not merely sex, but love, bodily freedom, and liberating joy—became entwined within the rhythms and melodies of American song. This cohesion, she reveals, touches the heart of America's anxieties and hopes about race, feminism, marriage, youth, and freedom.In a survey that spans more than a century of music, Powers both heralds little known artists such as Florence Mills, a contemporary of Josephine Baker, and gospel queen Dorothy Love Coates, and sheds new light on artists we think we know well, from the Beatles and Jim Morrison to Madonna and Beyoncé. In telling the history of how American popular music and sexuality intersect—a magnum opus over two decades in the making—Powers offers new insights into our nation psyche and our soul.",
  "genres": [
    "Music",
    "Nonfiction",
    "History",
    "Feminism",
    "Race",
    "Sociology",
    "Pop Culture"
  ],
  "author": "Ann Powers",
  "average_rating": "3.77",
  "url": "https://www.goodreads.com/book/show/32497584-good-booty"
}