{
  "title": "But Daddy!",
  "description": "But Daddy! is the heartwarming, true story of a year in the Buck household. It tells how one mother and one father bring up eleven bewitched, beguiling, bedeviling children.For Pat Buck pandemonium begins shortly after 6 a.m. As the mother of this ravenous broad of six boys and five girls, she must make a typical breakfast consisting of a half gallon of oatmeal, two dozen scrambled eggs, two pounds of bacon, and two loaves of toast. Along the way she helps dress the younger ones, inspects up to 110 fingernails, 22 hands and ears (behind and inside), and 11 necks, and hopefully gets the children off to school on time. On occasion Pat and the kids don't make it. At such times Pat says a rosary for the Pope to guide him to a practical decision on The Pill.But the fun has only just begun, like the time Daddy Buck almost landed in jail because Pat took the children on an innocent safari to buy shoes and underpants. Or the childless scoutmaster who prepared all the Scouts for earthquakes and floods but forgot to prepare them for going to bed on time, washing the dishes or the daddies' cars, or mowing the lawn. Or the day Pat set out for her annual vacation in the hospital and almost didn't get there because of the crush and excitement of her own kids, her neighbors' kids, two grandmothers, and an expectant father. Or Pat's secret formula for toilet training which could teach Dr. Spock a lesson but which misfired because bedlam struck again.In this charming, funny book, love, good sense, and a whacky zest for living reign together. Mothers and fathers of all 2.2 kid families will want to read But Daddy! to each other, providing their children or the grandparents do not grab it first. If you're old enough to remember Life with Father and Cheaper by the Dozen, then you're young enough to be enchanted by the most hilarious family story published in years.",
  "genres": [
    "Nonfiction",
    "Humor"
  ],
  "author": "Tom Buck",
  "average_rating": "4.21",
  "url": "https://www.goodreads.com/book/show/3249884-but-daddy"
}