{
  "title": "Trojan",
  "description": "This is an alternate Cover Edition for ISBN10: 099722570X/ ISBN13: 9780997225709.\nBefore the Hack of the US Election, there was Trojan. \nTrojan is based on an infiltration and takedown of the US Nuclear Armament and Defense Systems scenario, which a US Navy Information Technology Veteran envisioned while he attended the Navy and Marine Corps Computer Science School at Quantico, VA.While attending a computer internals class, an instructor removed the covers off a few of the systems in a computer lab and the student noticed that the tiny CPU chips, the brains of these machines, were all manufactured overseas somewhere. It shocked him and made him nervous that America’s nuclear defense capabilities could be dependent on foreign parts.It begged the question…What if an entity embedded rouge computer logic on those chips at the time they were manufactured, causing them to crash at a predetermined time, incapacitating America’s defense capabilities?That question spawned the idea for this story.Within Trojan, suddenly and without warning, all of America’s nuclear armament and defense systems crash - a complete meltdown. Star Wars, Air Force One, Doomsday Briefcase, and Guidance Systems, all rendered useless. Exposed, America is brutally attacked, major cities bombed.Amid this crisis, one man arises, Victor Walker. He holds the key to saving America, but there appears to be one small problem – there are those in the American Government who don’t want him to do it.Trojan is not a story written second-hand by someone who researched information technology and then penned the story. It’s written by a real-world Information Technology Veteran who provided services to the US Navy, the Department of the Navy, and various Fortune 100 companies.Now that the Hack of the US Election is no longer a debatable topic, Trojan is not only a possibility, it’s a plausible future reality. \n“Victor, who is comparable to an extremely patriotic Jason Bourne, is an intriguing hero.” - Clarion Review“Fans of the genre will be delighted with the book's well-crafted characters, excellent pacing, and plot.” - Publisher’s Weekly",
  "genres": [],
  "author": "David L.  Wallace",
  "average_rating": "4.03",
  "url": "https://www.goodreads.com/book/show/32499555-trojan"
}