{
  "title": "Dinner at Gorham's",
  "description": "Spies are made not born. Katerina Michailovna Obrazova was member of what passed post WW2 as an upper middle class family in St. Petersburg Russia. Her mother died from negligent medical care. Her father was a prominent mathematician who worked on Soviet, later Russian missiles. Her maternal grandmother was a decorated sniper with kills during the Battles of Stalingrad and Leningrad. Katya graduated from St. Petersburg University first in her computer class and gained a leadership job in the civil service. Shortly she upped stakes and for reasons unknown, even to herself, joined the Russian Intelligence Service. She underwent small arms and small unit military training. Overarching all were the habits and mindset of the clandestine world. Here she killed her first victim and conspired in the death of another. She learned many skills and a powefulbody. She received high marks at the end of the course. Katya was selected for English language training preliminary to an assignment in an English speaking country. She lived in a pseudo American house and wore American clothes. She used American soaps and kitchen ware. She was given an American name. Then Katya was sent to Denmark and Germany to test the tradecraft she had learned in training. In the Baltic she learned to sail for her duties in North East America and ultimately Nantucket. She excelled, returned to Russia for her orders and was exfiltrated to Copenhagen. She flew to Canada then hence to Massachusetts in order to begin her life as a wealthy orphan who yearned to start a professional life after years of idleness in Europe. She became Jillian Carlsson. Her espionage mission was to filch scientific information from a Harvard scientist. She becomes his mistress, gains access to his computers, swipes his results onto her sticks and sends them to the Center. All the while she comes to enjoy her new life and becomes an accepted member of the island’s society. She helps an island family through its tribulations. There is an angry wife here, but she is pushed aside and Jilly finds herself on the cusp of a permanent relationship with her professor. The Center congratulates her; their star pupil has succeeded without a blemish. An American interloper gets close to the operation and is disposed of. Jilly’s operation closes down with an unexpected bonus to her. She leaves for Rome to spend her vacation studying the works of Bernini.",
  "genres": [],
  "author": "David J. Kenney",
  "average_rating": "3.60",
  "url": "https://www.goodreads.com/book/show/32502594-dinner-at-gorham-s"
}