{
  "title": "A Commonwealth of Thieves: The Improbable Birth of Australia",
  "description": "It was 1786 when Arthur Phillip, an ambitious captain in the Royal Navy, was assigned the formidable task of organizing an expedition to Australia in order to establish a penal colony. The squalid and turbulent prisons of London were overflowing, and crime was on the rise. Even the hulks sifting at anchor in the Thames were packed with malcontent criminals and petty thieves. So the English government decided to undertake the unprecedented move of shipping off its convicts to a largely unexplored landmass at the other end of the world.Using the personal journals and documents that were kept during this expedition, historian/novelist Thomas Keneally re-creates the grueling overseas voyage, a hellish, suffocating journey that claimed the lives of many convicts. Miraculously, the fleet reached the shores of what was then called New South Wales in 1788, and after much trial and error, the crew managed to set up a rudimentary yet vibrant settlement. As governor of the colony, Phillip took on the challenges of dealing with unruly convicts, disgruntled officers, a bewildered, sometimes hostile native population, as well as such serious matters as food shortages and disease. Moving beyond Phillip, Keneally offers captivating portrayals of Aborigines, who both aided and opposed Phillip, and of the settlers, including convicts who were determined to overcome their pasts and begin anew.With the authority of a renowned historian and the narrative grace of a brilliant novelist, Thomas Keneally offers an insider’s perspective into the dramatic saga of the birth of a vibrant society in an unfamiliar land. A Commonwealth of Thieves immerses us in the fledgling penal colony and conjures up colorful scenes of the joy and heartbreak, the thrills and hardships that characterized those first four improbable years. The result is a lively and engrossing work of history, as well as a tale of redemption for the thousands of convicts who started new lives thousands of miles from their homes.",
  "genres": [
    "History",
    "Nonfiction",
    "Australia",
    "World History",
    "Audiobook",
    "Historical",
    "18th Century"
  ],
  "author": "Thomas Keneally",
  "average_rating": "3.68",
  "url": "https://www.goodreads.com/book/show/325092.A_Commonwealth_of_Thieves"
}