{
  "title": "Celestial Mechanics: A Tale for a Mid-Winter Night",
  "description": "CELESTIAL MECHANICS: A Tale for a Mid-Winter Night, the debut novel of famed Blue Highways author William Least Heat-Moon has received rave critical praise since its recent release in hardcover. Publishers Weekly “An elegant story of one man’s search for meaning in the cosmos. . . . This thought-provoking novel is rife with relatable and complex musings.” ALA Booklist calls it \"An elegant story of one man’s search for meaning in the cosmos. . . . This thought-provoking novel is rife with relatable and complex musings.” And The Proximal Eye raves, \"William Least-Heat Moon has taken a story of people making choices incompatible with their own desires and natures and given us a travelogue of the spirit. . . . a map of roads oft-traveled and too little remarked on the journey to hope.” CELESTIAL MECHANICS embarks on a journey through the mind and wrestles with life’s major questions, like the nature of the Cosmos, the value of knowledge, and the essence of truly being alive. Heat-Moon has already proven he is a master at taking readers on powerful journeys as shown in his initial release Blue Highways, which spent 42 weeks on the New York Times Bestseller list. Think of CELESTIAL MECHANICS as a Blue Highways of the soul, in which the author leads readers on a path unlike any other, offering new insight into finding one’s place in this universe we struggle to understand. In this novel of haunted love, the protagonist, an amateur astronomer, finds himself in a marriage descending toward darkness until the arrival of his sister-in-law and soon thereafter the appearance of a witching neighbor. In ways enigmatic, ghostly, and funny, the three women draw him into the equivocal nature of reality and dreams, leading him on a journey toward something vastly beyond himself.Just as Heat-Moon’s nonfiction employs many fictional narrative techniques, CELESTIAL MECHANICS draws upon nonfictional practices to build a story that crosses traditional boundaries between the two genres. It is a call of a generation to a generation wanting to believe rationality and spirituality can fruitfully coexist in a culture threatened by divisions. In a disaffected, disconnected nation that widely ignores the deep implications of both what is within and beyond us—the cosmic worlds revealed by the telescope and the realms opened by the microscope-—this tale is a quest for humanity’s deepest links with the universe and the ways those ties shape love and meaning. In CELESTIAL MECHANICS, the reader takes a journey into ways we behave with each other and how humans relate to the ultimate source of our being.",
  "genres": [
    "Fiction",
    "Literary Fiction",
    "Philosophy"
  ],
  "author": "William Least Heat-Moon",
  "average_rating": "3.72",
  "url": "https://www.goodreads.com/book/show/32508666-celestial-mechanics"
}