{
  "title": "Rising Wolf, the White Blackfoot: Hugh Monroe's Story of His First Year on the Plains",
  "description": "\"Rising Wolf\" is by the Plains veteran, J. W. Shultz, and is “real stuff,” vivid and exciting, with the value that comes from firsthand knowledge.    In all his fine Indian stories the author nowhere has produced a more Interesting narrative than this. In It he tells the true story of Hugh Monroe, who came to the Blackfoot country when he was 16. He took part in buffalo hunts, accompanied war parties, saw parts of the United States no white man had ever seen before and helped make peace between the Crows and Blackfeet. \"Rising Wolf\" is to be highly recommended.  This Indian story is a true one—which is so different. The author says that he was intimately acquainted with Hugh Munroe, or Rising Wolf, and that this story of his first experiences upon the Saskatchewan-Missouri River plains is put down just as it was told to him by the lodge fires of long ago. Rising Wolf was a white man among the Blackfoot Indians, and, as the author says, he had more adventures than most of the early men in the West. He died at ninety-eight and his body lies in Two Medicine Valley, \"in full sight of that great sky-piercing height of red rock on the north side of Two Medicine Lake, which we named Rising Wolf Mountain.\" The book is sure to engage the undivertable attention of those whose appetite for real adventure is never wholly satisfied.  In his famous book \"My Life as an Indian\", Schultz describes Rising Wolf as \"Early Hudson Bay man, typical trapper, trader, and interpreter of the romantic days of the early fur-trading period.\"   \"Rising Wolf\" is a thrilling account of life among the Indians in the early part of the last century, by a white boy who \"went West\" in- those early days and was adopted into the Blackfeet tribe. A stirring story for those who love true stories of guns, buffaloes, Indians, and combats with wild beasts and wild men.  Contents  I. With the Hudson's Bay Company II. The Sun-Glass III. Hunting with Red Crow IV. A Fight with the River People V. Buffalo Hunting VI. Camping on Arrow River VII. The Crows attack the Blackfeet VIII. In the Yellow River Country IX. The Coming of Cold Maker X. Making Peace with the Crows",
  "genres": [
    "History",
    "Nonfiction",
    "Adventure",
    "Biography",
    "Historical",
    "Audiobook",
    "Westerns"
  ],
  "author": "James Willard Schultz",
  "average_rating": "4.36",
  "url": "https://www.goodreads.com/book/show/32503238-rising-wolf-the-white-blackfoot"
}