{
  "title": "Moving In Series #1-3",
  "description": "The individual books have 100s of five star reviews. 10,000s of copies sold. 500+ pages of ghost filled suspense. MOVING IN (Book 1)  “Iron…and…salt,” whispers the old man. The dead old man. “Hurry or it will be too late…”  To escape the stress of living in the city and the anxiety of his high pressure job, Brian Roy moves his family to the country. His wife loves the easy living, but Brian hates it…especially when weird things start happening in the house. When he discovers a dead body in the woods and a burial ground in his basement, Brian could never imagine the shocking history of the house or its former occupants that comes to light.  As his life starts to unravel, Brian isn’t so sure living in the country is going to be the oasis of peace he and his wife expected. Lately, his home has become a haunting den of hell.   THE DUNEWALKERS (Book 2)   After the death of his Army comrade, William Engberg moves into a simple New Hampshire home against the backdrop of the turbulent foam crested waves of the Atlantic Ocean. It’s the ideal place to write and get on with his post-military life. Except for one thing. He has unwanted house guests—ghosts—and he wants them gone!  Determined to reclaim his home, William hires Brian, a ghostbusterpreneur, to clean house. Armed with knowledge from a rare journal on how to vanquish the dead, Brian goes to work only to discover his worst nightmare. Ready or not, Brian must deal with his own ghostly demons once and for all if he’s going to save William…and himself!    MIDDLEBURY SANITARIUM (Book 3)   Brian Roy is the brainchild behind the Leonidas Group, a ghostbusting organization with a track record of incomparable success for tracking down and annihilating ghosts. This time, however, Brian may have met his match with his latest job investigating Middlebury Sanitarium!  Occupied by a host of undeads, Middlebury Sanitarium has a history of drugging its residents to prevent them from entering the grounds at night and becoming a part of the “lost brigade” never to be heard from again. From a vengeful King who ruthlessly protects his royal domain, to Clyde a faceless soldier who's still fighting WWI—Brian’s got his hands full! And then there’s the boneyard…  Now, Brian teams up with an old vet caretaker, Ken Buckingham, to de-ghost the place. But the shrewd, kindly old man has a few secrets up his own sleeve that even Brian could have never anticipated.",
  "genres": [
    "Horror"
  ],
  "author": "Ron Ripley",
  "average_rating": "4.38",
  "url": "https://www.goodreads.com/book/show/32500306-moving-in-series-1-3"
}