{
  "title": "Intimacies: Poems of Love",
  "description": "From Nobel Laureate Pablo Neruda comes Intimacies—a beautiful companion to On the Blue Shore of Silence—showcasing some of Neruda's most extraordinary love poems, and once again married with Mary Heebner's earthy, evocative paintings.Neruda is celebrated the world over as a chronicler of love, and this vibrant addition to the revered master's canon offers readers a new interpretation on his writings about love and intimacy.The poems in this collection remind us that love is woven through all life, and that amorous love is only but the tip of such a powerful emotion. This collection presents Neruda at the height of his powers, with some of the most vibrant verses of the twentieth century.In a stunning package, with translations from acclaimed poet Alastair Reid, Intimacies is a book to be cherished and adored by both the most ardent Neruda fan and those new to the work of such an esteemed craftsman.Del Premio Nobel Pablo Nerudallega Intimismos—un bellísimo compañero paraA la orilla azul del silencio—presentando algunosde los poemas de amor más extraordinarios de Neruda, unidos una vez más a las pinturas telúricas y evocativas de Mary Heebner.Neruda es celebrado por el mundo entero como el cronista del amor. Esta brillante adición al canon del venerado maestro les ofrece a sus lectores una nueva interpretación de sus escrituras sobre el amor y el papel que juega en nuestras vidas.Los poemas de esta colección nos recuerdan que el amor se encuentra entretejido en toda la vida, y que el amor romántico no es más que una punta de tan poderosa emoción. Esta colección presenta a Neruda en la cúspide de su proeza, con algunos de los versos más vibrantes del siglo veinte.Esta edición estelar de Intimismos, con traducciones por el aclamado poeta Alastair Reid, será apreciada y adorada tanto por los apasionados admiradores de Neruda como por aquellos que son nuevos a la obra de este honrado artesano.",
  "genres": [
    "Poetry"
  ],
  "author": "Pablo Neruda",
  "average_rating": "4.48",
  "url": "https://www.goodreads.com/book/show/3254253-intimacies"
}