{
  "title": "Vis and Ramin",
  "description": "Vis and Ramin (Mage Publishers; $45; 576 pages) is one of the world's great love stories. It was the first major Persian romance, written between 1050 and 1055 in rhyming couplets. This remarkable work has now been superbly translated into heroic couplets (the closest metrical equivalent of the Persian) by the poet and scholar Dick Davis. Vis and Ramin had immense influence on later Persian poetry and is very probably also the source for the tale of Tristan and Isolde, which first appeared in Europe about a century later. The plot, complex yet powerfully dramatic, revolves around royal marital customs unfamiliar to us today. Shahru, the married queen of Mah, refuses an offer of marriage from King Mobad of Marv but promises that if she bears a daughter she will give the child to him as a bride. She duly bears a daughter, Vis, who is brought up by a nurse in the company of Mobad s younger brother Ramin. By the time Vis reaches the age of marriage, Shahru has forgotten her promise and instead weds her daughter to Vis s older brother, Viru. The next day Mobad s brother Zard arrives to demand the bride, and fighting breaks out, during which Vis s father is killed. Mobad then bribes Shahru to hand Vis over to him. Mobad s brother Ramin escorts Vis to her new husband and falls in love with her on the way. Vis has no love for Mobad and turns to her old nurse for help. . . . Told in language that is lush, sensual and highly inventive, Vis and Ramin is a masterpiece of psychological perceptiveness and Shahru is worldly and venal, the nurse resourceful and amoral (she will immediately remind Western readers of the nurse in Shakespeare's Romeo and Juliet ), Vis high-spirited and determined, Ramin impetuous and volatile. And the hopeless psychological situation of Vis s husband, Mobad, flickers wearily from patience to self-assertion to fury and back again. The origins of Vis and Ramin , are obscure. The story dates from the time of the Parthians (who ruled Persia from the third century bce to the third century ce), and certainly existed in oral and perhaps written form before the eleventh century Persian poet Fakhraddin Gorgani composed the version that has come down to us.",
  "genres": [
    "Poetry",
    "Classics",
    "Iran",
    "Literature",
    "Romance",
    "Medieval",
    "Epic"
  ],
  "author": "Fakhraddin Gorgani",
  "average_rating": "3.95",
  "url": "https://www.goodreads.com/book/show/3254120-vis-and-ramin"
}