{
  "title": "Anthem",
  "description": "He lived in the dark ages of the future. In a loveless world, he dared to fall in love. In an age that had lost all trace of science and civilization, he had the courage to seek and find knowledge. But these were not the crimes for which he would be hunted. He was marked for death because he had committed the unpardonable sin: standing out from the mindless human herd. Ayn Rand’s classic tale of a dystopian future of the great “We”—a world that deprives individuals of a name or independence—anticipates her later masterpieces, The Fountainhead and Atlas Shrugged.   This seventy-fifth anniversary edition of Anthem, celebrating the controversial and enduring legacy of its author, features an introduction by Rand’s literary executor, Leonard Piekoff, which includes excerpts from documents by Ayn Rand—letters, interviews, and journal notes in which she discusses Anthem. This volume also includes a complete reproduction of the original British edition with Ayn Rand’s handwritten editorial changes and a Reader’s Guide to her writings and philosophy.In Ayn Rand’s novels you have found more than great works of art—you have found a philosophy of reason.  “I had to originate a philosophical framework of my own, because my basic view of man and of existence was in conflict with most of the existing philosophical theories. In order to define, explain, and present my concept of man, I had to become a philosopher in the specific meaning of the term.”—Ayn Rand  Now available for further reading on Rand’s philosophy: Objective Communication by Leonard Piekoff.   Ayn Rand’s philosophy of Objectivism is increasingly influencing the shape of the world from business to politics to achieving personal goals. In Objective Communication, Peikoff explains how you can communicate philosophical ideas with conviction, logic, and, most of all, reason.  Also available from Penguin: an enhanced edition/app of Atlas Shrugged.",
  "genres": [
    "Fiction",
    "Classics",
    "Dystopia",
    "Philosophy",
    "Science Fiction",
    "School",
    "Literature"
  ],
  "author": "Ayn Rand",
  "average_rating": "3.61",
  "url": "https://www.goodreads.com/book/show/325488.Anthem"
}