{
  "title": "Her Own Hero: The Origins of the Women's Self-Defense Movement",
  "description": "The surprising roots of the self-defense movement and the history of women’s empowerment.At the turn of the twentieth century, women famously organized to demand greater social and political freedoms like gaining the right to vote. However, few realize that the Progressive Era also witnessed the birth of the women’s self-defense movement.It is nearly impossible in today’s day and age to imagine a world without the concept of women’s self defense. Some women were inspired to take up boxing and jiu-jitsu for very personal reasons that ranged from protecting themselves from attacks by strangers on the street to rejecting gendered notions about feminine weakness and empowering themselves as their own protectors. Women’s training in self defense was both a reflection of and a response to the broader cultural issues of the time, including the women’s rights movement and the campaign for the vote.Perhaps more importantly, the discussion surrounding women’s self-defense revealed powerful myths about the source of violence against women and opened up conversations about the less visible violence that many women faced in their own homes. Through self-defense training, women debunked patriarchal myths about inherent feminine weakness, creating a new image of women as powerful and self-reliant. Whether or not women consciously pursued self-defense for these reasons, their actions embodied feminist politics. Although their individual motivations may have varied, their collective action echoed through the twentieth century, demanding emancipation from the constrictions that prevented women from exercising their full rights as citizens and human beings. This book is a fascinating and comprehensive introduction to one of the most important women’s issues of all time.This book will provoke good debate and offer distinct responses and solutions.",
  "genres": [
    "Nonfiction",
    "History",
    "Feminism",
    "Sports",
    "Martial Arts",
    "Fitness",
    "Womens Studies"
  ],
  "author": "Wendy L.  Rouse",
  "average_rating": "4.08",
  "url": "https://www.goodreads.com/book/show/32561213-her-own-hero"
}