{
  "title": "Cruising the Library: Perversities in the Organization of Knowledge",
  "description": "Cruising the Library offers a highly innovative analysis of the history of sexuality and categories of sexual perversion through a critical examination of the Library of Congress and its cataloging practices. Taking the publication of Eve Kosofsky Sedgwick's Epistemologies of the Closet as emblematic of the Library's inability to account for sexual difference, Melissa Adler embarks upon a detailed critique of how cataloging systems have delimited and proscribed expressions of gender, sexuality, ethnicity, and race in a manner that mirrors psychiatric and sociological attempts to pathologize non-normative sexual practices and civil subjects.Taking up a parallel analysis, Adler utilizes Roderick A. Ferguson's Aberrations in Black as another example of how the Library of Congress fails to account for, and thereby \"buries,\" difference. She examines the physical space of the Library as one that encourages forms of governmentality as theorized by Michel Foucault while also allowing for its utopian possibilities. Finally, she offers a brief but highly illuminating history of the Delta Collection. Likely established before the turn of the twentieth century and active until its gradual dissolution in the 1960s, the Delta Collection was a secret archive within the Library of Congress that housed materials confiscated by the United States Post Office and other federal agencies. These were materials deemed too obscene for public dissemination or general access. Adler reveals how the Delta Collection was used to regulate difference and squelch dissent in the McCarthy era while also linking it to evolving understandings of so-called perversion in the scientific study of sexual difference.Sophisticated, engrossing, and highly readable, Cruising the Library provides us with a critical understanding of library science, an alternative view of discourses around the history of sexuality, and an analysis of the relationship between governmentality and the cataloging of research and information--as well as categories of difference--in American culture.",
  "genres": [
    "Nonfiction",
    "Library Science",
    "Queer",
    "LGBT",
    "History",
    "Books About Books",
    "Librarianship"
  ],
  "author": "Melissa Adler",
  "average_rating": "4.13",
  "url": "https://www.goodreads.com/book/show/32572298-cruising-the-library"
}