{
  "title": "A perspective on the Signs of Al-Quran: through the prism of the heart",
  "description": "KIRKUS REVIEW Malik approaches mystical lyricism in his eloquent devotional guide to Islamic spirituality. A semiconductors entrepreneur, Malik sees Islam not as a religion but as one path to spirituality--the difference being that any sincere faith leads to God. That reassuring inclusivity enlivens the book, as Malik presents what is unique about Islam but also what links it to other ways to God. For Muslims, the Quran is a living source of wisdom, giving timeless principles for conduct. As such, it is much more than a physical book; rather, it is a \" sea of signs \" that speaks to all. Arabic is inseparable from the Quran's beauty, so every quotation is given in both the original Arabic and in an English translation. Malik emphasizes that faith requires resting in uncertainty without abandoning rationality. Submission (the definition of \"Islam\") is a way of life that avoids the prison of dogma. \"Submission to God (Islam) is not exactly a 'religion, ' \" Malik says. \"It is both less and more.\" Indeed, Malik refutes dogmas that have long twisted the Abrahamic He proposes heaven and hell as states of mind rather than physical locations, and he argues that since Islam respects the sanctity of life, God never supports aggressors. Jihad is primarily a term for Muslims' struggle against oppression; usually this is an inner battle, but when it does take the form of outward action, it must be motivated by a desire for justice--\" Jihad cannot ever be a 'holy war, ' \" Malik says. A section on Muhammad as a historical figure goes into a level of detail that might not be necessary for a spiritual guidebook, but only occasionally does the mystical tone veer into New Ageism. For the most part, Malik sticks to practical, heartfelt scriptural commentary. One could even imagine the 100 names of Allah (comprising one-third of the text) serving any member of any faith in a devotional context, as a reminder of the often contradictory nature of the both \"The Giver of Life\" and \"The Giver of Death\"; \"outwardly Manifest\" yet \"inwardly Hidden.\" A useful, articulate spiritual commentary on the Quran.",
  "genres": [
    "Religion"
  ],
  "author": "Saeed Malik",
  "average_rating": "4.27",
  "url": "https://www.goodreads.com/book/show/11990797-a-perspective-on-the-signs-of-al-quran"
}