{
  "title": "The Shadow Roads",
  "description": "After the King of Ayr died without naming an heir, a century of enmity destroyed the one kingdom, as the mighty families of the Renn#233; and the Wills fought to determine the crown in a bitter storm of treachery and blood. But now the decades of hatred have woken the unquiet river spirits from their timeless sleep, andrevived a feud more deadly than any conflict of man.As alliances shift and loyalties are tested in the harsh civil war between the two great families, each determined to destroy the other, Toren Renn#233; still fights for peace, hoping to stop the age-old war. But betrayals and double crosses rack the Renn#233; and the Wills, even as a larger threat rises. For the dark knight Hafydd has made a sinister alliance that leads him to secrets hidden for eons, including one that could destroy them all.Only a brave few have managed to stand against Hafydd, and they are scattered throughout the land after a painful defeat: lost, separated, and weakened. Left for dead, the enigmatic wanderer Alaan must find his way through the treacherous, shifting southern lands, accompanied by the courageous Valeman, while Elise Wills, transformed by an eldritch bargain, pursues Hafydd herself as the nagar fight for revenge and the armies of the Renn#233; and the Wills clash for supremacy on the battlefield.But what began as a struggle for a crown hasbecome a fight far more perilous, for woken by the wars of man and nagar, even Death himself is preparing to leave his fell kingdom and walk the world again. And if the door to his dread domain cannot be shut, the feud between the Renn#233; and the Wills and even the ancient wars of the nagar will be as nothing compared to the coming doom.Lyrically written, dramatic yet poignant, the eagerly awaited The Shadow Roads concludes at long last the epic tale of the Swans' War, a triumph of literary achievement and the height of Sean Russell's acclaimed career to date.In the stunning conclusion to Russell's monumental fantasy trilogy The Swans' War, the war between the Renne and the Wills has nearly destroyed the one kingdom, but hope yet remains, as long as a few brave soul dares to oppose the dark knight of Haffyd.",
  "genres": [
    "Fantasy",
    "Epic Fantasy",
    "Fiction",
    "High Fantasy",
    "Science Fiction",
    "Science Fiction Fantasy",
    "Novels"
  ],
  "author": "Sean Russell",
  "average_rating": "3.75",
  "url": "https://www.goodreads.com/book/show/325640.The_Shadow_Roads"
}