{
  "title": "Her Perfect Revenge",
  "description": "Revenge is sweet… or is it?\nChristina Matteo had a humiliating prank pulled on her in high school by rich, party boy Bill Havenwood. It changed her whole life and she never forgot it—or him!Older, wiser and tougher, she meets him again years later and decides to get even. She wants revenge and comes up with a perfect plan. But things don't go her way when she stupidly crashes her car into his expensive sportscar while tailing him one day.Not recognizing her, Bill blackmails the cash-poor Christina into helping him stay in his billionaire father's good graces by pretending to be his fiancée for one month. Christina decides to go along with his ruse. After all, who knows what dirt she can find out about the jerk from the inside?But as Christina scams Bill and Bill scams his father—his father scams the both of them. William Havenwood Sr. knows all about their phony engagement and begins to push the couple to marry for real in order to get them to crack under pressure.And then Christina's little revenge plan begins to spiral out of control when she finds herself actually falling in love with her avowed enemy, Bill. It's enough to make a girl sick to her stomach! But can she really continue to go through with her plans to make him pay when she's so attracted to the creep? Christina is just stubborn enough to find out!HER PERFECT REVENGE is a story where its three strong and smart main characters—Christina, Bill and his father, William—find themselves engaged in a clever battle of wits where games, lies, secrets and deceptions rule the day. Who will win? And will Christina risk everything to get her payback?HER PERFECT REVENGE has also been released as a manga novel in Japan by Ohzora Publishing.Anna Mara is also the author of WHY ROMEO HATES JULIET & SIN & SAVAGE.",
  "genres": [
    "Romance",
    "Contemporary Romance",
    "Contemporary",
    "Chick Lit",
    "Enemies To Lovers",
    "Fiction",
    "Humor"
  ],
  "author": "Anna Mara",
  "average_rating": "3.85",
  "url": "https://www.goodreads.com/book/show/3256734-her-perfect-revenge"
}