{
  "title": "Chosen by a Dragon",
  "description": "Book Four of the bestselling Fallen Immortals series**START with KISS OF A DRAGON (Book 1)**LEONIDASI am a Dragon Prince of the House of Smoke… and I am cursed.Falling in love was never in the cards for me. An angry witch made sure of that—if I lose my heart, I lose my life. Only now, a treaty guaranteeing peace will die with me, unless I convince some hapless human to fall in love with me and bear my child—a dragonling born of magic and a Love that’s True. But I know nothing of love. Five hundred years of guarding my heart and opening my bed mean I’ve got zero chance at this. Yet if I fail, it won’t just be my death… but countless others.ROSALYNMy luck has never been good. Being a witch who can’t do magic sucks on most days—it’s even worse when your mother’s cancer can’t be cured. But I’ll do whatever it takes to turn our luck around, including stealing magic healing blood from a shifter. Besides, they owe me—a hot-as-sin shifter seduced my mother, got us thrown out of the coven, and ruined my life. One of them can bleed a little to make things right. And a dragon prince with his wacky Mating Game and blood ten times more powerful? The perfect mark. My luck might just be turning good after all.He needs her to love him without losing his heart; she wants nothing to do with his kind; and the fate of the mortal and immortal worlds depends on them not just opening their hearts, but surviving a Love that’s True…The FALLEN IMMORTALS series is a modern Beauty and the Beast story with flaming HOT dragon shifters, vengeful Dark Fae, and beguiling fallen angels.THE FALLEN IMMORTALS SERIESLucian and ArabellaKiss of a Dragon (Fallen Immortals 1)Heart of a Dragon (Fallen Immortals 2)Fire of a Dragon (Fallen Immortals 3)Leonidas and RosalynChosen by a Dragon (Fallen Immortals 4)Seduced by a Dragon (Fallen Immortals 5)Touched by a Dragon (Fallen Immortals 6)Leksander and ErelahLoved by a Dragon  (Fallen Immortals 7) Marked by a Dragon  (Fallen Immortals 8) Claimed by a Dragon  (Fallen Immortals 9)Of Bards and Witches: Leonidas's Story (Fallen Immortals 10)",
  "genres": [
    "Dragons",
    "Paranormal",
    "Romance",
    "Fantasy",
    "Paranormal Romance",
    "Shapeshifters",
    "Audiobook"
  ],
  "author": "Alisa Woods",
  "average_rating": "4.25",
  "url": "https://www.goodreads.com/book/show/32580608-chosen-by-a-dragon"
}