{
  "title": "Blown",
  "description": "Former CIA analyst Francine Mathews has created “one of the toughest female secret agents we’ve seen in a long time.”* Using her firsthand expertise of international espionage, Mathews offers another brilliantly realized suspense novel so intense, so authentic, it lethally blurs the line between fact and fiction. In Blown , Caroline Carmichael returns in a white-hot tale of terror on the streets of Washington, where one woman must gamble her life to save her country.As thousands of runners line up for the Marine Corps Marathon in Washington, D.C., no one suspects that in a matter of hours the event will become a race between life and death. CIA analyst Caroline Carmichael is about to tender her resignation, when the first reports of a terrorist attack pour in–and she instantly recognizes the hand of an enemy she’s battled for the 30 April Organization. The neo-Nazi group is alive and well and operating in the United States, assassinating top officials and abducting a vulnerable child from the front ranks of a state funeral. When Caroline’s husband, Eric, is arrested in Germany as a 30 April operative, Caroline has no choice but to take to the streets–and target the evil herself.Eric has worked as a “legend” for years–a false identity so perfect, the CIA believes he’s dead–and gone deep undercover within the terrorist group Caroline is determined to destroy. Now his cover’s been blown, and Eric’s intimate knowledge of 30 April’s plans makes him a target for both the killers he’s betrayed, and the American government he’s sworn to protect.Torn between a desire to save her husband and her duty to save her country, Caroline is drawn back into a treacherous labyrinth where trusting others is as good as suicide. For the enemy this time wears a familiar that of an American patriot, waving his flag alongside his gun. To stem disaster, Caroline has only one to betray everyone in which she believes–or everyone she loves.For an agent without cover–an agent who’s blown–is worse than she’s as good as dead.* USA Today",
  "genres": [
    "Thriller",
    "Fiction",
    "Espionage",
    "Mystery Thriller",
    "Mystery"
  ],
  "author": "Francine Mathews",
  "average_rating": "3.85",
  "url": "https://www.goodreads.com/book/show/1199126.Blown"
}