{
  "title": "The Divide: A Brief Guide to Global Inequality and its Solutions",
  "description": "For decades we have been told a story about the divide between rich countries and poor countries.We have been told that development is working: that the global South is catching up to the North, that poverty has been cut in half over the past thirty years, and will be eradicated by 2030. It’s a comforting tale, and one that is endorsed by the world’s most powerful governments and corporations. But is it true?Since 1960, the income gap between the North and South has roughly tripled in size. Today 4.3 billion people, 60 per cent of the world's population, live on less than $5 per day. Some 1 billion live on less than $1 a day. The richest eight people now control the same amount of wealth as the poorest half of the world combined.What is causing this growing divide? We are told that poverty is a natural phenomenon that can be fixed with aid. But in reality it is a political problem: poverty doesn’t just exist, it has been created.Poor countries are poor because they are integrated into the global economic system on unequal terms. Aid only works to hide the deep patterns of wealth extraction that cause poverty and inequality in the first place: rigged trade deals, tax evasion, land grabs and the costs associated with climate change. The Divide tracks the evolution of this system, from the expeditions of Christopher Columbus in the 1490s to the international debt regime, which has allowed a handful of rich countries to effectively control economic policies in the rest of the world.Because poverty is a political problem, it requires political solutions. The Divide offers a range of revelatory answers, but also explains that something much more radical is needed – a revolution in our way of thinking. Drawing on pioneering research, detailed analysis and years of first-hand experience, The Divide is a provocative, urgent and ultimately uplifting account of how the world works, and how it can change.",
  "genres": [
    "Economics",
    "Nonfiction",
    "Politics",
    "History",
    "Sociology",
    "Society",
    "Social Justice"
  ],
  "author": "Jason Hickel",
  "average_rating": "4.62",
  "url": "https://www.goodreads.com/book/show/32603498-the-divide"
}