{
  "title": "The Legends of Camber of Culdi Trilogy: Camber of Culdi, Saint Camber, and Camber the Heretic",
  "description": "Three fantasy novels of intrigue, betrayal, and magic in medieval Gwynedd by the New York Times–bestselling author of the Deryni series—bonus story also included.Camber of Culdi: Long before Camber was revered as a saint, he was a Deryni noble, one of the most respected of the magical race whose arcane skills set them apart from ordinary humans in the kingdom of Gwynedd. Now, the land suffers under the tyranny of King Imre, whose savage oppression of the human population weighs heavily on Camber’s heart—a heart that is about to be shattered by a tragic loss that will lead him to confront the usurpers whose dark magic haunts the realm.  Saint Camber: The yoke of tyranny has finally been lifted in Gwynedd, but Camber’s job remains unfinished. The dangerous remnants of a conquered enemy still mass at the borders, and the new ruler is desperately unhappy wearing the crown. With the stability of a fragile kingdom at stake, its greatest champion must make the ultimate sacrifice: Camber of Culdi must cease to exist.  Camber the Heretic: The king’s heir is a mere boy of twelve, and the malevolent regents who will rule until young Alroy comes of age are determined to eliminate all Deryni. Suddenly, the future of Gwynedd hangs in the balance, and Camber—once adored as a saint, but now reviled as a heretic—must find a way to protect his people before everything and everyone he loves is destroyed in the all-consuming flames of intolerance and hate.   Filled with mysticism and magic, these sagas reminds us that “Kurtz’s love of history lets her do things with her characters and their world that no non-historian could hope to do” (Chicago Sun-Times).",
  "genres": [
    "Fantasy",
    "Fiction",
    "Amazon",
    "Science Fiction",
    "Science Fiction Fantasy"
  ],
  "author": "Katherine Kurtz",
  "average_rating": "4.37",
  "url": "https://www.goodreads.com/book/show/32606096-the-legends-of-camber-of-culdi-trilogy"
}