{
  "title": "The Reluctant Queen",
  "description": "Everything has a spirit: the willow tree with leaves that kiss the pond, the stream that feeds the river, the wind that exhales fresh snow . . . And those spirits want to kill you.It’s the first lesson that every Renthian learns.\nNot long ago, Daleina used her strength and skill to survive those spirits and assume the royal throne. Since then, the new queen has kept the peace and protected the humans of her land. But now for all her power, she is hiding a terrible secret: she is dying. And if she leaves the world before a new heir is ready, the spirits that inhabit her beloved realm will run wild, destroying her cities and slaughtering her people. Naelin is one such person, and she couldn’t be further removed from the Queen—and she wouldn’t have it any other way. Her world is her two children, her husband, and the remote village tucked deep in the forest that is her home, and that’s all she needs. But when Ven, the Queens champion, passes through the village, Naelin’s ambitious husband proudly tells him of his wife’s ability to control spirits—magic that Naelin fervently denies. She knows that if the truth of her abilities is known, it will bring only death and separation from those she loves.But Ven has a single task: to find the best possible candidate to protect the people of Aratay. He did it once when he discovered Daleina, and he’s certain he’s done it again. Yet for all his appeals to duty, Naelin is a mother, and she knows her duty is to her children first and foremost. Only as the Queen’s power begins to wane and the spirits become emboldened—even as ominous rumors trickle down from the north—does she realize that the best way to keep her son and daughter safe is to risk everything. Sarah Beth Durst established a place of dark wonder in The Queen of Blood, and now the stakes are even higher as the threat to the Queen and her people grows both from within and beyond the borders of Aratay in this riveting second novel of the Queens of Renthia series.",
  "genres": [
    "Fantasy",
    "Young Adult",
    "Fiction",
    "Adult",
    "High Fantasy",
    "Magic",
    "Audiobook"
  ],
  "author": "Sarah Beth Durst",
  "average_rating": "4.02",
  "url": "https://www.goodreads.com/book/show/32600602-the-reluctant-queen"
}