{
  "title": "Rebellion",
  "description": "A luminous cross-generational story that recalls the works of Jane Smiley and Isabel Allende, this sweeping debut novel tells the stories of four women who dare to challenge the boundaries of their circumscribed livesIt’s 1958, and Hazel’s peaceful world has been upended by the tragic death of her husband. It’s harvest time and with two small children and a farm to manage on her own, this young mother is determined to keep her land and family intact. As she grows closer to the neighboring Hughes family, she realizes the tradeoff for some freedoms is more precious than she expected. In 1890, we see Hazel’s young mother, Louisa, recently married and relocated to Illinois to what will become her family’s farm. Life in the country is dictated by seasons, so too is Louisa ruled by her “weathers” of good and bad spells. What keeps her grounded is corresponding with her sister, Addie, a Christian missionary in China. The same adventurous spirit that brought Addie to China with her new husband now compels her to leave again. However, with the Boxer Rebellion underway, and violence erupting between Chinese and their unwelcome Christian intruders, Addie’s life takes a mysterious and haunting turn strongly felt by her sister, Louisa, back home. At the end of the twentieth century, Juanlan returns to her parents’ home in Heng’an after college. With her father falling ill, a new highway being built, and her sister-in-law soon to give birth, Juanlan feels frozen in place, though everyone and everything seems to be rapidly changing. In the search for an outlet for the live wire, a little burning blue coil she feels buried inside, she starts up a love affair with a high-ranking government official. From rural Illinois to the far reaches of China, these four women are interconnected by actions, consequence, and spirit, each brilliantly displaying the fleeting intensity of youth, the obligation of family, and the dramatic consequence of charting their own destiny. A vibrant story of compassion and discovery set against a century of complicated relations between China and America, Rebellion celebrates those who fight against expectation in pursuit of their own thrilling fate and introduces a rising literary star.",
  "genres": [
    "Fiction",
    "Historical Fiction",
    "China",
    "Adult Fiction",
    "Historical",
    "Adult",
    "Book Club"
  ],
  "author": "Molly Patterson",
  "average_rating": "3.56",
  "url": "https://www.goodreads.com/book/show/32600764-rebellion"
}