{
  "title": "All That Glitters",
  "description": "\"He has to go.\" The words echoed through the cavernous great-room that held my cage. I could have winced at the venom dripping from the Alpha's voice. I could have cried at the injustice of being sent away after the injuries already visited upon me. I did neither, I simply closed my eyes and tried to block out the hateful noise as I breathed against the searing pain in my abdomen. Captive or not, I would have preferred to stay in my human form – it was much more efficient at achieving a comfortable body temperature – but with neither clothing nor bedding provided in my cage to help me retain my body heat, I wouldn't have been much better off. Instead, I lay curled in my wrought iron cage, my tail wrapped tightly around my body, the tip hooked over my snout as I tried to retain every bit of warmth available in the damp, drafty castle. \"But he's an Omega,\" the dowager dragoness argued. \"That's rare in itself, but he's a jeweled dragon!\" She clucked to herself. \"A jeweled Omega! Do you know how rare a combination that is?\" \"Of course I do,\" the Alpha replied, exasperation seeping into his voice. \"But the bloodlines are useless if we can't control who breeds him.\" He huffed and I heard a brief sizzle as his fiery breath clearly got too close to something. \"Mother, he's a whore. Do you really wish to bring that type of breeding stock into the lineage?\" \"No, no. Of course not,\" she answered, sighing heavily. \"When Harold takes a mate, of course it should be one as pure as he or she is fertile.\" Another sigh. \"The children would have been beautiful, though. Where do you intend to send him?\" \"The Omega Auction,\" the Alpha said firmly. \"That's the only place I can think of to unload him without his virginity intact without cheating anyone.\" \"Of course, the auction,\" the dragoness said slowly. \"Yes, I suppose that's for the best. 5% of royalties received from the sale of Soul Mate for Sale are donated to The Trevor Project; the leading national organization providing crisis intervention and suicide prevention services to lesbian, gay, bisexual, transgender and questioning (LGBTQ) young people ages 13-24.",
  "genres": [
    "M M Romance",
    "Shapeshifters",
    "Paranormal",
    "Romance",
    "Dragons",
    "Omegaverse",
    "LGBT"
  ],
  "author": "Kian Rhodes",
  "average_rating": "3.92",
  "url": "https://www.goodreads.com/book/show/32609102-all-that-glitters"
}