{
  "title": "Sick: A Memoir",
  "description": "Boston Globe's 25 Books We Can't Wait to Read in 2018Buzzfeed's 33 Most Exciting New BooksBustle’s 28 Most Anticipated Nonfiction Books of 2018 listNylon’s 50 Books We Can’t Wait to Read in 2018Electric Literature’s 46 Books to Read By Women of Color in 2018Huffington Post’s 60 Books We Can’t Wait to Read in 2018Bitch’s 30 Most Anticipated Nonfiction Books of 2018The Rumpus’s What to Read When 2018 is Just Around the CornerVol.1 Brooklyn’s 23 for 2018: A Literary Preview for the Year to ComeThe Millions Most Anticipated 2018 ListAuto Straddle Most Anticipated 2018 PreviewThe Coil's Books We Can't Wait to Read in 2018 \nA powerful, beautifully rendered memoir of chronic illness, misdiagnosis, addiction, and the myth of full recovery.\nFor as long as author Porochista Khakpour can remember, she has been sick. For most of that time, she didn't know why. Several drug addictions, some major hospitalizations, and over $100,000 later, she finally had a diagnosis: late-stage Lyme disease. Sick is Khakpour's grueling, emotional journey—as a woman, an Iranian-American, a writer, and a lifelong sufferer of undiagnosed health problems—in which she examines her subsequent struggles with mental illness and her addiction to doctor prescribed benzodiazepines, that both aided and eroded her ever-deteriorating physical health. Divided by settings, Khakpour guides the reader through her illness by way of the locations that changed her course—New York, LA, Santa Fe, and a college town in Germany—as she meditates on the physiological and psychological impacts of uncertainty, and the eventual challenge of accepting the diagnosis she had searched for over the course of her adult life. A story of survival, pain, and transformation, Sick candidly examines the colossal impact of illness on one woman's life by not just highlighting the failures of a broken medical system but by also boldly challenging our concept of illness narratives.",
  "genres": [
    "Memoir",
    "Nonfiction",
    "Health",
    "Disability",
    "Biography",
    "Medical",
    "Mental Health"
  ],
  "author": "Porochista Khakpour",
  "average_rating": "3.34",
  "url": "https://www.goodreads.com/book/show/32600407-sick"
}