{
  "title": "Konan Destylator",
  "description": "Jakub Wędrowycz to przerażający wiekowy ochlapus, wiejski egzorcysta, bimbrownik i kłusownik, porażający otoczenie wyglądem, zapachem i kulturą osobistą – a raczej jej brakiem. W towarzystwie równie odrażających kumpli pije, produkuje samogon, wdaje się w awantury oraz wypełniając wolę przodków regularnie likwiduje przedstawicieli wrogiego rodu – Bardaków.W postaci Wędrowycza jak w soczewce skupiają się wszelkie możliwe polskie wady, przywary i stereotypy – ale jego chamstwo, wieśniactwo, buractwo, brak rozterek i hamulców moralnych oraz bogaty arsenał broni i materiałów wybuchowych zapewniają mu przewagę nad każdym przeciwnikiem.Tyle Wikipiedia, a Wy właśnie trzymacie w ręku najnowszy zbiór doprowadzających do łez, plugawych historii z życia pogromcy Wojsławic i terenów, gdzie dociera Pekaes z Chełma.Ogłoszenia drobne:„Klata goryla” – bezpośredni importer oferuje innowacyjny chiński preparat łączący sterydy ze środkiem na porost włosów.Nowo otwarta klinika „Gender Asylium” zaprasza na dyskretne operacje. Tylko u nas do wyboru pięć różnych płci!Poszukuję chirurga plastycznego. Informacje w redakcji na hasło „Mała syrenka”.Restauracja Sushi „Tu jest Nemo” zaprasza na wieczór kuchni węgierskiej.Bank odmówił ci kredytu? Urzędnik nie dał zezwolenia? Policja zatrzymała prawo jazdy? Ujawnij krzywdzicieli. My zrobimy resztę.Jedziesz na wakacje? Zaopiekujemy się twoim pupilem. Hotel dla psów Hot-dog.Esperal – zaszywanie, usuwanie, serwis. Haft gratis. Dla stałych klientów zniżki.Ekzaminy za pasem? Pomorzemy ci z ortokrafją!Salon masażu „Czarodziejka z Księżyca”. Dziewczyny nie z tej Ziemi.Nie masz mieszkania ani pieniędzy? Wkurza cię konieczność chodzenia do pracy? Zostań uchodźcą! Oferujemy paszporty Afganistanu i naukę języka pusztuńskiego. 50 godzin solarium w cenie kursu.Tylko u nas! Oryginalne ukraińskie jajka z niespodzianką. Zaskoczenie gwarantowane! Świeża dostawa prosto z Czarnobyla.Problemy żołądkowe? pomoże ci tylko KAPITAN KLOC„Siekiera karmi i ubiera” – sesja naukowa i kursy mistrzowskie dla drwali.",
  "genres": [
    "Fantasy",
    "Polish Literature",
    "Audiobook",
    "Fiction",
    "Comedy",
    "Humor",
    "Mine"
  ],
  "author": "Andrzej Pilipiuk",
  "average_rating": "3.80",
  "url": "https://www.goodreads.com/book/show/32607172-konan-destylator"
}