{
  "title": "Ruthless Tide: The Heroes and Villains of the Johnstown Flood, America’s Astonishing Gilded Age Disaster",
  "description": "“ Reads like a nail-biting thriller.” — Library Journal, starred review A gripping new history celebrating the remarkable heroes of the Johnstown Flood—the deadliest flood in U.S. history—from NBC host and legendary weather authority Al Roker Central Pennsylvania, May 31, 1889: After a deluge of rain—nearly a foot in less than twenty-four hours—swelled the Little Conemaugh River, panicked engineers watched helplessly as swiftly rising waters threatened to breach the South Fork dam, built to create a private lake for a fishing and hunting club that counted among its members Andrew Mellon, Henry Clay Frick, and Andrew Carnegie. Though the engineers telegraphed neighboring towns on this last morning in May warning of the impending danger, residents—factory workers and their families—remained in their homes, having grown used to false alarms. At 3:10 P.M., the dam gave way, releasing 20 million tons of water. Gathering speed as it flowed southwest, the deluge wiped out nearly everything in its path and picked up debris—trees, houses, animals—before reaching Johnstown, a vibrant steel town fourteen miles downstream. Traveling 40 miles an hour, with swells as high as 60 feet, the deadly floodwaters razed the mill town—home to 20,000 people—in minutes. The Great Flood, as it would come to be called, remains the deadliest in US history, killing more than 2,200 people and causing $17 million in damage. In Ruthless Tide , Al Roker follows an unforgettable cast of characters whose fates converged because of that tragic day, including John Parke, the engineer whose heroic efforts failed to save the dam; the robber barons whose fancy sport fishing resort was responsible for modifications that weakened the dam; and Clara Barton, the founder of the American Red Cross, who spent five months in Johnstown leading one of the first organized disaster relief efforts in the United States. Weaving together their stories and those of many ordinary citizens whose lives were forever altered by the event, Ruthless Tide is testament to the power of the human spirit in times of tragedy and also a timely warning about the dangers of greed, inequality, neglected infrastructure, and the ferocious, uncontrollable power of nature.",
  "genres": [
    "History",
    "Nonfiction",
    "American History",
    "Audiobook",
    "Historical",
    "Book Club",
    "Science"
  ],
  "author": "Al Roker",
  "average_rating": "3.95",
  "url": "https://www.goodreads.com/book/show/32600750-ruthless-tide"
}