{
  "title": "Vanishing New York: How a Great City Lost Its Soul",
  "description": "\"ESSENTIAL READING FOR FANS OF JANE JACOBS, JOSEPH MITCHELL, PATTI SMITH, LUC SANTE AND CHEAP PIEROGI.\"--VANITY FAIRAn unflinching chronicle of gentrification in the twenty-first century and a love letter to lost New York by the creator of the popular and incendiary blog Vanishing New York.For generations, New York City has been a mecca for artists, writers, and other hopefuls longing to be part of its rich cultural exchange and unique social fabric. But today, modern gentrification is transforming the city from an exceptional, iconoclastic metropolis into a suburbanized luxury zone with a price tag only the one percent can afford.A Jane Jacobs for the digital age, blogger and cultural commentator Jeremiah Moss has emerged as one of the most outspoken and celebrated critics of this dramatic shift. In Vanishing New York, he reports on the city’s development in the twenty-first century, a period of \"hyper-gentrification\" that has resulted in the shocking transformation of beloved neighborhoods and the loss of treasured unofficial landmarks. In prose that the Village Voice has called a \"mixture of snark, sorrow, poeticism, and lyric wit,\" Moss leads us on a colorful guided tour of the most changed parts of town—from the Lower East Side and Chelsea to Harlem and Williamsburg—lovingly eulogizing iconic institutions as they’re replaced with soulless upscale boutiques, luxury condo towers, and suburban chains.Propelled by Moss’ hard-hitting, cantankerous style, Vanishing New York is a staggering examination of contemporary \"urban renewal\" and its repercussions—not only for New Yorkers, but for all of America and the world.",
  "genres": [
    "Nonfiction",
    "History",
    "New York",
    "Cities",
    "Sociology",
    "Urban Studies",
    "Urbanism"
  ],
  "author": "Jeremiah Moss",
  "average_rating": "4.19",
  "url": "https://www.goodreads.com/book/show/32600748-vanishing-new-york"
}