{
  "title": "The Diplomat's Daughter",
  "description": "During the turbulent months following the 1941 bombing of Pearl Harbor, twenty-one-year-old Emi Kato, the daughter of a Japanese diplomat, is locked behind barbed wire in a Texas internment camp. She feels hopeless until she meets handsome young Christian Lange, whose German-born parents were wrongfully arrested for un-American activities. Together, they live as prisoners with thousands of other German and Japanese families, but discover that love can bloom in even the bleakest circumstances.When Emi and her mother are abruptly sent back to Japan, Christian enlists in the US Army, with his sights set on the Pacific front—and, he hopes, a reunion with Emi—unaware that her first love, Leo Hartmann, the son of wealthy of Austrian parents and now a Jewish refugee in Shanghai, may still have her heart.Fearful of bombings in Tokyo, Emi’s parents send her to a remote resort town in the mountains, where many in the foreign community have fled. Cut off from her family, struggling with growing depression and hunger, Emi repeatedly risks her life to help keep her community safe—all while wondering if the two men she loves are still alive.As Christian Lange struggles to adapt to life as a soldier, his unit pushes its way from the South Pacific to Okinawa, where one of the bloodiest battles of World War II awaits them. Meanwhile, in Japanese-occupied Shanghai, as Leo fights to survive the squalor of the Jewish ghetto, a surprise confrontation with a Nazi officer threatens his life. For each man, Emi Kato is never far from their minds. Flung together by war, passion, and extraordinary acts of selflessness, the paths of these three remarkable young people will collide as the fighting on the Pacific front crescendos. With her “elegant and extremely gratifying” (USA Today) storytelling, Karin Tanabe paints a stunning portrait of a turning point in history.",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Historical",
    "World War II",
    "Romance",
    "War",
    "Japan"
  ],
  "author": "Karin Tanabe",
  "average_rating": "3.88",
  "url": "https://www.goodreads.com/book/show/32620359-the-diplomat-s-daughter"
}