{
  "title": "Second Chance Season",
  "description": "Return to Liora Blake’s Grand Valley series with Second Chance Season, in which an avowed country boy meets an ambitious city girl who reminds him why dreaming big and taking a chance is worth the risk.Garrett Strickland is unapologetically country, fiercely loyal, and all about living in the present and not dwelling in the past—even if he was once on his way to a lofty agricultural sciences degree that would guarantee the brightest of futures, only to end up back home when his old man died, leaving behind a debt-ridden family farm that was impossible to keep afloat. After that, it was easy to see why dreaming big wasn’t worth the heartache of losing everything. And until he crosses paths with a city girl who’s hell-bent on kick-starting her own future, he’s sure that good enough is just that. Cara Cavanaugh is ready for more from life, even if that means changing everything; including dumping her longtime boyfriend, turning down a lucrative job at a major newspaper, and leaving behind the upscale suburbs of Chicago where she grew up. Now, she just has to pray that temporarily relocating to the middle of nowhere in Colorado will be the first step in building a career as a freelance writer—all she has to do is prove she’s got what it takes to make a name for herself. Unfortunately, her tony country day school is as close to country as she’s ever been. But when a goodhearted guy who looks like he just stumbled out of a country music video offers to help, she ends up falling hard…and discovering that the perfect story, as it turns out, is a love story. And it’s theirs.Second Chance Season, book two in the Grand Valley series, is a charming, feel-good romance, perfect for fans of Jennifer Probst and Kristan Higgins",
  "genres": [
    "Romance",
    "Contemporary",
    "Contemporary Romance",
    "New Adult"
  ],
  "author": "Liora Blake",
  "average_rating": "3.90",
  "url": "https://www.goodreads.com/book/show/32620314-second-chance-season"
}