{
  "title": "Into the Gray Zone: A Neuroscientist Explores the Border Between Life and Death",
  "description": "In this “riveting read, meshing memoir with scientific explication” (Nature), a world-renowned neuroscientist reveals how he learned to communicate with patients in vegetative or “gray zone” states and, more importantly, he explains what those interactions tell us about the working of our own brains.“Vivid, emotional, and thought-provoking” (Publishers Weekly), Into the Gray Zone takes readers to the edge of a dazzling, humbling frontier in our understanding of the brain: the so-called “gray zone” between full consciousness and brain death. People in this middle place have sustained traumatic brain injuries or are the victims of stroke or degenerative diseases, such as Alzheimer’s and Parkinson’s. Many are oblivious to the outside world, and their doctors believe they are incapable of thought. But a sizeable number—as many as twenty percent—are experiencing something different: intact minds adrift deep within damaged brains and bodies. An expert in the field, Adrian Owen led a team that, in 2006, discovered this lost population and made medical history. Scientists, physicians, and philosophers have only just begun to grapple with the implications.  Following Owen’s journey of exciting medical discovery, Into the Gray Zone asks some tough and terrifying questions, such as: What is life like for these patients? What can their families and friends do to help them? What are the ethical implications for religious organizations, politicians, the Right to Die movement, and even insurers? And perhaps most intriguing of all: in defining what a life worth living is, are we too concerned with the physical and not giving enough emphasis to the power of thought? What, truly, defines a satisfying life?  “Strangely uplifting…the testimonies of people who have returned from the gray zone evoke the mysteries of consciousness and identity with tremendous power” (The New Yorker). This book is about the difference between a brain and a mind, a body and a person. Into the Gray Zone is “a fascinating memoir…reads like a thriller” (Mail on Sunday).",
  "genres": [
    "Nonfiction",
    "Science",
    "Psychology",
    "Neuroscience",
    "Medical",
    "Medicine",
    "Health"
  ],
  "author": "Adrian Owen",
  "average_rating": "4.25",
  "url": "https://www.goodreads.com/book/show/32620337-into-the-gray-zone"
}