{
  "title": "Strays: A Lost Cat, a Homeless Man, and Their Journey Across America",
  "description": "For fans of A Street Cat Named Bob and The Small-Town Library Cat Who Touched the World , Strays is a compelling true story of a man who rescues a stray, injured cat and how they save each other.Homeless, alcoholic, and depressed, Michael King lives in a UPS loading bay on the wrong side of the tracks in Portland, Oregon. One rainy night, he stumbles upon a hurt, starving, scruffy cat and takes her in. Nursing her back to health, he names her Tabor and she becomes a bit of a celebrity in southeast Portland. When winter comes, they travel from Oregon to the beaches of California to the high plains of Montana, surviving blizzards and bears, angry steers and rainstorms. Along the way, people are drawn to the spirited, beautiful cat and moved to help Michael, who cuts a striking figure with Tabor riding high on his backpack or walking on a leash. Tabor comforts Michael when he’s down, giving Michael someone to love and care for, and inspiring him to get sober and to come to terms with his past family traumas and grief over the death of his life partner.As they make their way across the West Coast, the pair become inseparable, healing the scars of each other’s troubled pasts. But when Michael takes Tabor to a veterinarian in Montana, he discovers that Tabor has an identification chip and an owner in Portland who has never given up hope of finding his beloved cat, Michael makes the difficult choice to return to Portland and reunite Tabor with her owner. Now Michael must create a new purpose in his life after Tabor.The authentic tale of an adventurous and charismatic cat and her compassionate human admirers, Strays proves the healing power of love and the profound bond between humans and animals.",
  "genres": [
    "Animals",
    "Nonfiction",
    "Cats",
    "Biography",
    "Travel",
    "Audiobook",
    "Memoir"
  ],
  "author": "Britt     Collins",
  "average_rating": "4.03",
  "url": "https://www.goodreads.com/book/show/32620340-strays"
}