{
  "title": "Golden Hill: A Novel of Old New York",
  "description": "The spectacular first novel from acclaimed nonfiction author Francis Spufford follows the adventures of a mysterious young man in mid-eighteenth century Manhattan, thirty years before the American Revolution, in “a first-class period entertainment” (The Guardian).New York, a small town on the tip of Manhattan island, 1746. One rainy evening in November, a handsome young stranger fresh off the boat pitches up at a countinghouse door on Golden Hill Street: this is Mr. Smith, amiable, charming, yet strangely determined to keep suspicion shimmering. For in his pocket, he has what seems to be an order for a thousand pounds, a huge sum, and he won’t explain why, or where he comes from, or what he is planning to do in the colonies that requires so much money. Should the New York merchants trust him? Should they risk their credit and refuse to pay? Should they befriend him, seduce him, arrest him; maybe even kill him?Set thirty years before the American Revolution, author Francis Spufford captures an ancient iconography of New York not only in his depictions of the physical city and its diverse citizens, currencies, and costumes, but also in the clever and pungent language of his prose. Golden Hill is an update of eighteenth-century picaresque novels by the likes of Henry Fielding and entertains us with its savage wit, mystery, charismatic protagonist, and romantic storyline as it propels us toward a powerful revelation at the novel’s end. “Intoxicating” (The Financial Times) and “as good a historical novel as you could read” (The Times, London), Golden Hill shows us a city provokingly different from its later self; but subtly shadowed by the great icon to come, and already a place where a young man with a fast tongue can invent himself anew, fall in love—and find a world of trouble.",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Historical",
    "Book Club",
    "New York",
    "Mystery",
    "Audiobook"
  ],
  "author": "Francis Spufford",
  "average_rating": "3.78",
  "url": "https://www.goodreads.com/book/show/32620302-golden-hill"
}