{
  "title": "Storm of Passion: A Short Story",
  "description": "*Please notice that this is the short story edition, not the novella edition of the same title which is a sequel of the short story.\nDear Author,Jaime and Parker are best friends. Jaime is gay and knows he can never confess his true feelings for his straight best bud, Jaime joins the army right after high school. Ten years later he's come home and their friendship rekindles as if he had never left. Jaime knows he is still in love with Parker but he would rather die than tell him his true feelings. But the way Parker looks at him sometimes, makes him think maybe there is something more between them. Parker is so happy Jaime is back in town. He missed their friendship and all the things they used to do. But why is he all of a sudden having erotic dreams about Jaime? Parker's straight, isn't he? Can someone please help these two out???Photo Description: Pictures of two dark-haired muscular young men in shorts. The first sits in a wooden-paneled corner, arms braced on the seat, accentuating the size of his shoulders. There is something tentative in the expression of his dark eyes. The second holds a football cocked to throw. His features are strong, hair shaved, a single tattoo on his shoulder.This story was written as a part of the M/M Romance Group's \"Hot Summer Days\" event. Group members were asked to write a story prompt inspired by a photo of their choice. Authors of the group selected a photo and prompt that spoke to them and wrote a short story.Download the story, read it online or find it in Don't Read in the Closet, Volume 1.__________Genre: contemporaryTags: gay m/m, coming out, cop, first love, friends to lovers, police, soldierWord Count: 7,988",
  "genres": [
    "M M Romance",
    "Romance",
    "Friends To Lovers",
    "Short Stories",
    "Military Fiction",
    "Contemporary",
    "LGBT"
  ],
  "author": "Dustin Adrian Rhodes",
  "average_rating": "2.92",
  "url": "https://www.goodreads.com/book/show/11993080-storm-of-passion"
}