{
  "title": "The Philosopher's Flight",
  "description": "A thrilling debut from ER doctor turned novelist Tom Miller, The Philosopher’s Flight is an epic historical fantasy set in a World-War-I-era America where magic and science have blended into a single extraordinary art. Eighteen-year-old Robert Weekes is a practitioner of empirical philosophy—an arcane, female-dominated branch of science used to summon the wind, shape clouds of smoke, heal the injured, and even fly. Though he dreams of fighting in the Great War as the first male in the elite US Sigilry Corps Rescue and Evacuation Service—a team of flying medics—Robert is resigned to mixing batches of philosophical chemicals and keeping the books for the family business in rural Montana, where his mother, a former soldier and vigilante, aids the locals.When a deadly accident puts his philosophical abilities to the test, Robert rises to the occasion and wins a scholarship to study at Radcliffe College, an all-women’s school. At Radcliffe, Robert hones his skills and strives to win the respect of his classmates, a host of formidable, unruly women. Robert falls hard for Danielle Hardin, a disillusioned young war hero turned political radical. However, Danielle’s activism and Robert’s recklessness attract the attention of the same fanatical anti-philosophical group that Robert’s mother fought years before. With their lives in mounting danger, Robert and Danielle band together with a team of unlikely heroes to fight for Robert’s place among the next generation of empirical philosophers—and for philosophy’s very survival against the men who would destroy it.In the tradition of Lev Grossman and Deborah Harkness, Tom Miller writes with unrivaled imagination, ambition, and humor. The Philosopher’s Flight is both a fantastical reimagining of American history and a beautifully composed coming-of-age tale for anyone who has ever felt like an outsider.",
  "genres": [
    "Fantasy",
    "Historical Fiction",
    "Fiction",
    "Science Fiction",
    "Historical",
    "Alternate History",
    "Audiobook"
  ],
  "author": "Tom        Miller",
  "average_rating": "3.89",
  "url": "https://www.goodreads.com/book/show/32620364-the-philosopher-s-flight"
}