{
  "title": "The Party",
  "description": "It was supposed to be a celebration. How did it all go so wrong?'A tense and riveting story about one night gone horribly wrong, and the fallout within a family and a group of friends' Megan Miranda, author of All the Missing GirlsSweet sixteen. It's a coming of age, a milestone, a rite of passage. Of course Jeff and Kim Sanders will throw a party for their daughter, Hannah. She's a good kid with good grades and nice friends. And it isn't going to be a big, indulgent affair. Just four girls coming over for pizza and cake, movies and a sleepover. What could possibly go wrong?But things do go wrong, horrifically wrong. After a tragic accident, Jeff and Kim's flawless life in a wealthy San Francisco suburb begins to unravel. The injured girl's mother, Lisa, files a lawsuit that turns friends into enemies, reveals dark secrets in the Sanders' marriage, and exposes the truth about their perfect daughter, Hannah. Lisa's determination to make the Sanders pay stems from a fierce love for her only child and Lisa's own dark and damaged past.In The Party , Christos Tsiolkas's The Slap meets Liane Moriarty's Big Little Lies, taking us behind the façade of the perfect family, exploring the secrets, betrayals, and moral lapses the neighbors don't see.The Party uncovers the lies and duplicities that children and parents tell each other. And tell themselves.'A compulsive page-turner that mines the push-pull between basic impulses and doing the ‘right thing,’ The Party is a domestic drama that spins off the rails with hellish consequences' Erica Ferencik, author of The River at Night'Cleverly constructed and brilliantly paced, The Party is a raw telling of a family coming apart at the seams. Robyn Harding weaves a riveting tale that is impossible to put down' Bill Clegg, New York Times bestselling author of Did You Ever Have a Family",
  "genres": [
    "Fiction",
    "Thriller",
    "Mystery",
    "Contemporary",
    "Mystery Thriller",
    "Audiobook",
    "Adult"
  ],
  "author": "Robyn Harding",
  "average_rating": "3.39",
  "url": "https://www.goodreads.com/book/show/32620309-the-party"
}