{
  "title": "The Spear in the Sand",
  "description": "This is a novel of adventure so unusual that it defies comparison with any other, unless its quality be compared with that of a classic like W. H. Hudson's Green Mansions. But it goes even further in its imaginative flight, thanks to its modern understanding of man's capacity for adventure in the subconscious world.It is the story of Sausal, a young scientist, who goes on an expedition to chart an ocean current in the South Pacific, hoping to gain on the trip a fuller understanding of himself and the world. After feuds and storms wreck the expedition, he finds himself alone on a perfect, uninhabited island, and his whole focus of life is gradually narrowed down to this tiny universe.Time passes -- and there is time enough to see the things man seldom has time to see -- the colors in the grass and on the shells, the motion of the wave ripples, of cloud forms changing endlessly, shifting, turning into monsters, into humans, amorous, timorous, rapacious. There is time to watch the fish, the endless array of sea beauty and terror, to watch the life of the earth, the insects and flowers, the birth, growth and death of nature. There is time to sink into the water's caress, to be on the ground, to dream and feel.Sausal is alone, but the days and nights are too short for all he wants to do. So are the months, and finally the years. He changes with little knowledge of his changing; he grows older with little knowledge of his aging; he knows loneliness but he knows, too, the joys of loneliness. He could tell, if there were anyone to tell it to, of the failure of desire, the greater failure of success, of perfection as a living death, cruel, ruthless, splendidly stupefying.This is a strange and beautiful book, written with a skill that approaches fine poetry. It is a book that eludes time, that moves from our daily realities into a world of stronger, more lasting realities, and binds the reader, carries him with Sausal into a search for the meaning of man, of love, of friendship and of human responsibilities.",
  "genres": [
    "Fiction"
  ],
  "author": "Raoul C. Faure",
  "average_rating": "3.00",
  "url": "https://www.goodreads.com/book/show/32611824-the-spear-in-the-sand"
}