{
  "title": "The Power of a Transformed Wife",
  "description": "Are you in a difficult marriage that is failing to meet your expectations? Has your intimacy and closeness turned into angry words with smoldering discontent? In a world where Christian marriage and family is to be a beacon of love, faith, and hope, we find Christian marriages failing at an alarming rate. Like many Christian couples today, Lori Alexander and her husband, Ken, found themselves in a modern marriage partnership as two strong leaders who both loved each other, but could not find the oneness they knew God desired for their marriage. In The Power of a Transformed Wife, Lori bravely takes you with her on her 35-year journey of marriage showing the good and the bad as two strong people discover that doing things God’s ways produces exactly what God has promised. It is a journey out of the Christian feministic thinking that has infiltrated the Church and into the ever so simple concept that female equality does not mean that a modern day Christian wife cannot joyfully and willingly choose to submit to her husband as she submits to the Lordship of Christ in her life. If you are brave enough to challenge yourself with the simple message of marriage done God’s way, then you will have to walk past the few, but vocal dissenters, who will do all they can to shout down and drown out the plain teaching of the Bible. Lori Alexander has a large following of Christian women who chose to daily hear her common sense biblical approach to marriage and family. After regularly hearing from women around the world who have been touched by God’s simple transforming Word on marriage, Lori now gives a succinct summary of how she became a Transformed Wife. How she stepped out of the need to be right and in control of the marriage to trust God at His Word and in turn trust Ken. Her mission is to fulfill the biblical admonition for the older women to train the younger women how to love their husbands, love their children, and be keepers at home. “Wives submit to your husbands in everything,” is not for the fainthearted, but for the strong Christian woman who desires God’s blessings by doing things God’s ways. Thousands of Christian women are finding joy and closeness with their husbands by going back to a biblical marriage and family model that is rarely taught in the Church anymore. This frightens many feminists, and some Christians, to think that what women have seemingly gained over the past 50 years of feminism might be lost on a new generation of young Christian women who are going back to God’s Word for the answers to a fulfilling marriage and family life. The life of Jesus is one of love and sacrifice, and it is His life we must seek to follow no matter how counter-culture it may be, even when it may lead to ridicule or promised persecution. Dare to “be transformed by the renewing of your mind,” as this book challenges the Christian young woman, wife, and mother to be 100% biblical in how she is to live out her faith and marriage.",
  "genres": [
    "Christian",
    "Marriage",
    "Nonfiction"
  ],
  "author": "Lori   Alexander",
  "average_rating": "3.16",
  "url": "https://www.goodreads.com/book/show/32666506-the-power-of-a-transformed-wife"
}