{
  "title": "The Tribune's Curse",
  "description": "I was happier than any mere mortal has a right to be and I should have known better. The entire body of received mythology and every last Greek tragedy ever written have made one inescapable truth utterly clear: If you are supremely happy, the gods have it in for you. They don't like for mortals to be happy, and they will make you pay.In his extensive series featuring the detecting feats of Decius Caecilius Metellus the younger, set in the Rome of 70 BC, Roberts achieves a very believable modern feeling with his well-researched description of the stories' background. This seventh episode, however, combines a familiar view of the demands office-seeking makes on a candidate with a situation that is impossibly bizarre to us today. An entire city, versed in literature, music, and the other arts, ruled democratically, for its time, is thrown into panic by an enraged man's curse.The Consul Crassus, the wealthiest man in Rome, frustrated by the Senate's vote against his leading Rome in a war against Parthia, plans to march his private army to invade the country himself. Almost all of Rome turns out to watch him carry out his threat and lead his troops out of the city. But before he can, a t powerful tribune called Ateius leaps to the top of the city's gate and invokes all the gods to put a curse on Crassus and his army.Rome is terrified. Ateius has called down a forbidden curse -- the worst and most frightening blasphemy ever perpetrated. It seriously threatens the entire populace, and drastic steps to propitiate the gods must be taken immediately. Worse even, someone kills Ateius - perhaps in the vain hope that this will lighten the curse? It will not.After joining the other men of the city in a daylong cleansing ritual that left every able-bodied male citizen, Decius included, in a state of half-collapse, Decius learns that he has been chosen to uncover the person responsible for the murder. The culprit must be found in order to complete the cleansing, and there is no one better equipped to do that than Decius.Roberts skillfully blends the playboy and the serious sleuth in Decius just as he combines what we see as contradictions in the Rome of 80 BC. He spices his story with humor and suspense, with characters charming and wise and foolish and very much like we are today. And he presents readers with a look into another world that has them eagerly awaiting more.visits.",
  "genres": [
    "Historical Fiction",
    "Mystery",
    "Fiction",
    "Crime",
    "Historical",
    "Historical Mystery",
    "Roman"
  ],
  "author": "John Maddox Roberts",
  "average_rating": "4.14",
  "url": "https://www.goodreads.com/book/show/326847.The_Tribune_s_Curse"
}