{
  "title": "The Army of the Republic",
  "description": "In an America stretched by crisis to the breaking point, billionaire entrepreneur and government insider James Sands is riding high. Over the protests of civic groups and the increasing alienation of his wife, Anne, Sands is poised on the brink of an immensely risky and controversial deal that will give him control of all public water in the Pacific Northwest. But when his business partner is murdered by a radical group called The Army of the Republic, Sands finds himself losing control of his business and his life. Desperate, he turns to Whitehall Security, a private intelligence firm with far-reaching political connections. For a steep monthly fee, Whitehall will hunt down and eliminate any threats to Sands's enterprise. Meanwhile, in Seattle, a young guerrilla named Lando leads The Army of the Republic into a dangerous war of ideals. Charismatic and cunning, Lando is obsessed with the goal of saving the country from its corrupt ruling alliance by any means necessary. His reluctant ally is political organizer Emily Cortright, coordinator of a network of civil, religious, and labor groups. Bound together in a web of common aims and conflicting loyalties, the two plan a massive peaceful protest against a conference of national business leaders, which they hope will stagger the Regime. Beyond his control, through, Lando's Army of the Republic has already unleashed a chain of events that will electrify and frighten an uneasy nation. Hemmed in by their lethal compromises, Emily, Lando, James, and Anne struggle to redeem or destroy those whom they love most. Thrilling and unforgettable, The Army of the Republic is a brilliant, provocative novel about what it means to live in a democracy.",
  "genres": [
    "Fiction",
    "Science Fiction",
    "Dystopia",
    "Literature",
    "Thriller",
    "Politics"
  ],
  "author": "Stuart Archer Cohen",
  "average_rating": "3.72",
  "url": "https://www.goodreads.com/book/show/3268517-the-army-of-the-republic"
}