{
  "title": "Tobacco War: Inside the California Battles",
  "description": "Tobacco War charts the dramatic and complex history of tobacco politics in California over the past quarter century. Beginning with the activities of a small band of activists who, in the 1970s, put forward the radical notion that people should not have to breathe second-hand tobacco smoke, Stanton Glantz and Edith Balbach follow the movement through the 1980s, when activists created hundreds of city and county ordinances by working through their local officials, to the present--when tobacco is a highly visible issue in American politics and smoke-free restaurants and bars are a reality throughout the state. The authors show how these accomplishments rest on the groundwork laid over the past two decades by tobacco control activists who have worked across the U.S. to change how people view the tobacco industry and its behavior.Tobacco War is accessibly written, balanced, and meticulously researched. The California experience provides a graphic demonstration of the successes and failures of both the tobacco industry and public health forces. It shows how public health advocates slowly learned to control the terms of the debate and how they discovered that simply establishing tobacco control programs was not enough, that constant vigilance was necessary to protect programs from a hostile legislature and governor. In the end, the California experience proves that it is possible to dramatically change how people think about tobacco and the tobacco industry and to rapidly reduce tobacco consumption. But California's experience also demonstrates that it is possible to run such programs successfully only as long as the public health community exerts power effectively. With legal settlements bringing big dollars to tobacco control programs in every state, this book is must reading for anyone interested in battling and beating the tobacco industry.",
  "genres": [],
  "author": "Stanton A. Glantz",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/1199541.Tobacco_War"
}