{
  "title": "Science and Civilisation in China, Volume 1: Introductory Orientations",
  "description": "All Western-born men are aware of a touch of immaturity in their own self-consciousness and sufficiency when chance confronts them with notions about Chinese civilisation, a civilisation and a way of life reaching far back to the dawn of History, so unlike any other, so subtle, so simple-seeming, so imperturbable. And the Western mind, admitting its own vast ignorances, has been restless to invent and to entertain romantic and faulty conjectures.Great space divides us from China; the language itself, entirely self-contained, has sprung from quite other roots than ours; Chinese society, philosophy, art, religion, and custom, seem, at times, to exhibit no likenesses with ours. What then of science, from mathematics to technology? What did the Chinese do; and how different was it from the science of our own ancestors?The way to overcome such a separating desert of ignorance is, we know, to study; but there seemed to be no easy stages; to learn even the elements of so different a life of humanity demanded a greater labour than we were able to afford, longer time than we could hope to spare, for a reward we seemed very well able to do without. At some point (almost beyond imagination) in pre-history began a divergence between our human ancestors; each divergent branch stands ignorantly, comprehending little of the other. But in this book we are provided with a new footpath for would-be students to follow. A man of the West has trodden a path for us, and pioneering, has given us the possibility of reclaiming our world from a long-continued ignorance.This book is the Introductory Volume of a full run of seven, entitled \"Science and Civilisation in China\". To prepare his readers to study a complimentary human culture, Dr Joseph Needham begins by examining the structure of the Chinese language; he reviews the geography of China, and the long history of its people, and discusses the scientific contacts, which have occurred throughout the centuries, between Europe and East Asia.The whole work is completed in MS, and from now publication should go steadily on. Dr. Needham, a Fellow of the Royal Society, is a biologist renowned for his work in Biochemistry and Morphogenesis. he had the fortune to live and work for some years in China, enjoying opportunities which enabled him to discuss with many Chinese savants the roots of the great human problems of cultural diversity. To this theme he had felt impelled to devote years of thought and research.Needham's later volumes in this work deal in detail and in turn with Chinese Philosophy, with the development of Scientific Thought, with Mathematics, with Human Law and the Laws of Nature, with Astronomy, Meterology, Geography, Cartography, Geology, Physics, Engineering, Shipbuilding, Navigation, and the Arts of War; with Textiles, Paper, Printing, Chemistry, Ceramics, Metallurgy; and with the Biological Sciences, Agriculture and Medicine. this is followed by a survey of the particular characteristics of all Chinese science, illuminated by whatever was of significance in the Chinese social background.The survey of these many fields of enterprise, moreover, is based mainly upon primary sources in Chinese literature (sometimes now first translated here) and in Chinese archaeology. Throughout hie enquiries Dr Needham has had the research assistance of Mr Wang Ch'ing-Ning (of Academia Sinics and Trinity College, Cambridge) and has profited by criticism and advice from many scholars and experts.The books are fully illustrated, and each volume is equipped with its own bibliographies and indexes. Each volume, as it appears, will be separately available; though it is expected that the Introductory Volume will be wanted by general readers and specialists alike.",
  "genres": [
    "History",
    "China",
    "Science",
    "Nonfiction",
    "Asia",
    "Philosophy",
    "Historical"
  ],
  "author": "Joseph Needham",
  "average_rating": "4.26",
  "url": "https://www.goodreads.com/book/show/326804.Science_and_Civilisation_in_China_Volume_1"
}