{
  "title": "MindWar",
  "description": "Nick Hall returns in a riveting stand-alone thriller, set in a stunning future that is rapidly approaching.From the NY Times bestselling author whose books have been downloaded over a million times.Nick Hall has revolutionary electronics implanted in his brain that allow him to read minds--including thoughts, memories, and even intent. He can know the passwords, future strategies, and innermost secrets of anyone he chooses, making him the most formidable man alive. But his status as the only mind reader in the world is about to change . . .Soon Hall is fighting for his life as he races to stop an unimaginably despicable terror plot. But his problems are only beginning. Because when a member of his inner circle betrays him, and the secret to mind reading leaks out, he is forced to wage war against a merciless mind reader of nearly unequaled brilliance. One who will stop at nothing to kill Hall, his colleagues, and the woman he loves. And one who is intent on ushering in a dramatic transformation of the human species--even at the cost of billions of lives.Based on actual research on computer-assisted mind reading, MindWar is a roller-coaster ride of a thriller. One that raises a number of intriguing possibilities about a future that is just around the corner.\"Richards is a tremendous new talent\" (Stephen Coonts) who can \"keep you turning the pages all night long\" (Douglas Preston)\"Richards is a worthy successor to Michael Crichton\"(SF Book.com)Near Future Science Fiction Thrillers by Douglas E. Richards)WIRED (Wired 1)AMPED (Wired 2)MIND'S EYE (Nick Hall 1)BRAINWEB (Nick Hall 2)MINDWAR (Nick Hall 3)QUANTUM LENSSPLIT SECONDGAME CHANGERKids Science Fiction Thrillers (9 and up, enjoyed by kids and adults alike)TRAPPED (Prometheus Project 1)CAPTURED (Prometheus Project 2)STRANDED (Prometheus Project 3)OUT OF THIS WORLDTHE DEVIL'S SWORD",
  "genres": [
    "Science Fiction",
    "Fiction",
    "Thriller",
    "Audiobook",
    "Amazon",
    "Science Fiction Fantasy",
    "Action"
  ],
  "author": "Douglas E. Richards",
  "average_rating": "4.43",
  "url": "https://www.goodreads.com/book/show/32686435-mindwar"
}