{
  "title": "Under Water: A Natural Disaster Memoir",
  "description": "Watch the book trailer here: https://www.youtube.com/watch?v=5Nk4P...What was originally expected to be a typical Tennessee spring rainstorm in May of 2010 suddenly and swiftly churned into the fourth largest, non-hurricane natural disaster in American history. This memoir is the true, first-hand account of one man’s survival during the Nashville floods of 2010, as entire neighborhoods were submerged, streets ran like rapids, and lives were lost. Destruction in communities and businesses was both total and personal, as Owen Grimenstein lost his home, most of his possessions, and very nearly, his own life. But what would emerge triumphant from the depths of such profound darkness was a community of family, friends, and strangers far more steeped in love, hope, and kindness than they could ever possibly fathom… “Reliving the Nashville flood is painful but inspiring; no one tells the story better than Owen. [Under Water: A Natural Disaster Memoir] will be a key part of Nashville's history and a guide to our future. People like Owen make Nashville the envy of America.\" —U.S. Congressman Jim Cooper“The story of one couple's strength and spirit is told beautifully by Owen Grimenstein. Owen captures the fear and stress that occurs in a natural disaster but also captures the fortitude and courage that was the response of so many individuals and families.” —Former Nashville mayor Karl Dean\"Owen Grimenstein captures the will to survive, neighbors helping neighbors, strangers helping strangers. Under Water is a reliving of the pounding rain and rising water. It is also a reliving of how in a time of great need Nashville responded.\" —Bob Mueller, News 2 WKRN-TV anchor\"Mr. Grimenstein’s memoir masterfully recounts the historical and devastating flood of May 2010 that gravely impacted the Nashville area and how the community came together to build back all that nature destroyed.\" —Nancy Stephens, editor, The Fairview Observer“The author’s words inspire us towards resilience and perseverance. Under Water stirs us to choose hope when circumstances seem hopeless, to cherish our families, and to come alongside and give generously to our suffering neighbors.” —Bunny Bennett, author of God Thinks I’m Beautiful“Owen takes the reader on a perilous journey through one of [Nashville's] most difficult times. This is an account that everyone needs to read. Frankly, this book is so well written it should be recognized by Nashville’s mayor Megan Barry as an official historical document.” —Bob Williams, author of Music City MacabreCheck out Under Water: A Natural Disaster Memoir on the news here: http://www.wsmv.com/clip/13160418/flo...",
  "genres": [
    "History",
    "Nonfiction"
  ],
  "author": "Owen Grimenstein",
  "average_rating": "3.97",
  "url": "https://www.goodreads.com/book/show/32673932-under-water"
}