{
  "title": "ثلة من أسماء الإجرام",
  "description": "تغوص بك هذه الرواية داخل أعماق نفوس بشرية مشوهة، في هذه الرواية لم أدس يدي في جحر الأفاعي بل أحرقت الجحر واجبرت الحيات والثعابين على الظهور وسرد الرواية بأنفسهم، هذه الرواية سيسردها عليك احدى عشر شخصية اجرامية تتقاطع بهم دروب الحياة، وتتماس حيواتهم بشكل مباشر أو غير مباشر، وتتباين أصولهم الاجتماعية وقناعاتهم الفكرية، لكنهم يتشابهوا في صفة واحدة ألا وهي إجرامهم إما بحق أنفسهم، كالمدون، أو بحق الآخرين كباقي شخصيات الرواية، وبجانب تقنية السرد التقليدية التي استخدمتها في أغلب فصول الرواية، ستواجهك تقنية السرد الآني الغير تقليدية، والنادرة الاستخدام إلى حد ما خاصة في الروايات العربية، وتلك التقنية النادرة تصف لك ما يحدث بصيغة الزمن المضارع المستمر، حينها ستتعايش مع الأحداث كما لو كنت حاضرا داخلها، وربما أشعرتك تقنية السرد الآني بأنك تقرأ وكأنك تشاهد، وربما وجدت نفسك تشعر نحو شخوص الرواية بكراهية أو بألفة من نوع غريب كما لو كنت تعرفها بشكل أو بآخرستتعرف في الرواية على البلطجي «شوقي» خريج كلية التجارة الذي أجبرته الظروف ذات يوم على إرتكاب جريمة قتل وألقي القبض عليه، ثم إكتشف ان أسرته متواضعة الحال تربطها صلة قرابة بعيدة باللواء «كريم» القيادي الأمني النافذ الذي ساعد «شوقي» أولا في محنته، ثم استغله وحوله لتابع ومخلب قط، فقام «شوقي» عقب خروجه من السجن بالتعاون مع الداخلية والحزب الوطني لمنع الناخبين من دخول اللجان الانتخابية في ثلاثة انتخابات قبل ثورة يناير، ثم ساعد بشكل مباشر في وأد الثورة بكل الطرق، وأخيرا بعد فشل الثورة ورجوع النظام بأكمله، تحول شوقي لنشاط جديد وصار يبتز رجال الأعمال لصالح اللواء «كريم» القيادي الأمني، وستراه ينفذ عمليات عجيبة لإجبار رجل الاعمال «وديع برسوم» على دفع اتاوة لحمايته من التشهير، وستتعرف على الشيخ «عواض» السلفي الورع الذي يبرر بإستماته تضارب وتعارض أفكاره ومعتقداته التي يغيرها تبعا لمصلحته، وينتهج مبدأ ميكافيلي الشهير (الغاية تبرر الوسيلة)، وستتعرف على المذيعة اللعوب «تهاني» التي حرمت طويلا من الشهرة ثم باعت نفسها للواء «عادل» القائد الاستخباراتي، وستتعرف على «عثمان» الإرهابي الغبي الذي ضلله الشيخ «عواض» وتسبب في تعرضه للاعتقال والتعذيب، وأيضا ستتعرف على «زياد» ضابط أمن الوطن الذي يعذب المعتقلين دون أدنى وخز من ضميره، والذي ينبهر بالمقدم «وديع الحداد» قائد المجموعة القتالية السرية التي تنفذ مذابح ضد مواقع عسكرية دون أي اعتبار لزمالة أو انسانية ويسلم تقارير عملياته الى قائده اللواء «عادل»، وستعرف على اللواء «عادل» القائد الاستخباراتي الذي يتآمر على المجتمع بأريحية وبجاحة نادرة، ويتنافس مع ابن خالته «كريم» على الارتقاء والعلو، وستتعرف على «المعرص» الخمسيني الذي جعلت شخصيته مجهولة ولم أطلق عليه اسم ليعبر عن أمثاله من أعضاء حزب الكنبة مدمني الخضوع والعبودية لأي فرعون، و«المعرص» يضمر حقدا دفينا على جيل الشباب الذين يتفاخرون على جيله الخانع بتفجيرهم لشرارة ثورة يناير، التي نجحت في عزل مبارك الذي جثم على أنفاس مصر وشعبها لثلاثين عاما، سام خلالها المصريين الفقر والقمع، وعندما يتعرض «المعرص» لإنتقادات معارضي النظام، الذين يلومونه ويعايرونه بما فعله به النظام، حينها يختار «المعرص» بنذالة قواد متمرس أن يستميت لتبرير ظلم النظام لفلذة كبده، ثم يلجأ لطلب العون من «أدهم» الثورجي صديق ولده المحبوس ظلما، وستتعرف على الثورجي «أدهم» الذي إكتشف تآمر النظام على الثورة فقرر التحول من ثائر إلى ثورجي وانضم للمتآمرين معللا موقفه بأن مقالات المدون العنيد «رامي» كانت سببا في كفره بالثورة وسعيه للتربح منها، وستتعرف أيضا على «رامي» المدون العنيد الذي خسر وفقد احترامه لله، ولم يفقد عناده ولا عشقه للعدل، وفضح وواجه أعدائه بشجاعة من لا يخشى شيئا، وبرغم افكاره الجنونية عن الله الا ان رامي وهو الشخصية الوحيدة التي فشل اللواء «كريم» في إخضاعها، وستتعرف أيضا على اللواء «كريم» الذئب القاسي، الذي ستهتز ثقته في نفسه، عقب حادث مفجع، ورغم انه غير مؤمن بوجود إله، إلا انه يشعر بالخوار للمرة الأولى في حياته خشية تعرضه لجزاء دنيويبين أيديكم نص أدبي لحمته الخيال وسدته الإختلاق، وينبغي قراءته بمعزل عن الأديان والأيدلوجيات الفكرية، والهدف الأساسي للنص هو السرد الروائي الهاتك لأستار مكنون وجدان وأنفس ثلة من المجرمين دون أي مط أو تطويل، وقد حرصت على عدم إضاعة وقت القارئ في سرد عبثي لإطالة الرواية دون مبرر لكن هناك إطناب مبرر وقد أسهبت في عرض حقائق بعينها للتوكيد عليها، كما حرصت في ذات الوقت على التوسع قليلا في إثراء حصيلة القاريء اللغوية بأسلوب غير مزعجهذه تجربتي الروائية الأولى التي إستفدت فيها كثيرا من الأدباء الأجانب، خاصة مبدعي أمريكا اللاتينية العظام أمثال «إيزابيل الليندي»، و«باولو كويلو»، و«ماريو بارجاس يوسا»، و«كاميلو خوسيه ثيلا»، و«غابرييل جارسيا ماركيز»، بالاضافة للتركي «أورهان باموق»، والروسي «ايفان تورجنيف» وغيرهم من مبدعي الأدب العالمي، كما استفدت أيضا من حصيلة معارفي التاريخية، وأيضا من كتابات الأقدمين الأدبية خاصة «الجاحظ»، و«ابن المقفع»، و«أبو حيان التوحيدي»، و«سهل بن هارون»، و«ابن العميد»، و«بديع الزمان الهمذاني»، و«محمد الحريري»، و«القاضي الفاضل»، و«لسان الدين بن الخطيب»، وغيرهم من أوائل مبدعي النثر وفن المقامة العربيحسام السعيد عامر",
  "genres": [],
  "author": "حسام السعيد عامر",
  "average_rating": "3.78",
  "url": "https://www.goodreads.com/book/show/32702285"
}