{
  "title": "Behind the Mask: A Superhero Anthology",
  "description": "Behind the Mask is an exciting collection of short stories about the everyday lives of superheroes. Ranging from laugh-out-loud funny to deliciously dark, these stories are about the ordinary day-to-day challenges facing these extraordinary individuals growing up, growing old, relationships, parenting, coping with that age-old desire to fit in when, let s face it, they don't.“Ms. Liberty Gets a Haircut” by Cat Rambo, copyright © 2009 by Cat Rambo, originally published in Strange Horizons (October 26, 2009); “Destroy the City with Me Tonight” by Kate Marshall, copyright © 2017 by Kate Marshall; “Fool” by Keith Frady, copyright © 2017 by Keith Frady; “Pedestal” by Seanan McGuire, copyright © 2017 by Seanan McGuire; “As I Fall Asleep” by Aimee Ogden, copyright © 2017 by Aimee Ogden; “Meeting Someone in the 22nd Century or Until the Gears Quit Turning” by Jennifer Pullen, copyright © 2017 by Jennifer Pullen; “Inheritance” by Michael Milne, copyright © 2017 by Michael Milne; “Heroes” by Lavie Tidhar, copyright © 2016 by Lavie Tidhar, originally published in Strange Horizons (September 19, 2016); “Madjack” by Nathan Crowder, copyright © 2017 by Nathan Crowder; “Quintessential Justice” by Patrick Flanagan, copyright © 2017 by Patrick Flanagan; “The Fall of the Jade Sword” by Stephanie Lai, copyright © 2017 by Stephanie Lai; “Origin Story” by Carrie Vaughn, copyright © 2016 by Carrie Vaughn, LLC, originally published in Lightspeed Magazine (April 2016); “Eggshells” by Ziggy Schutz, copyright © 2017 by Ziggy Schutz; “Salt City Blue” by Chris Large, copyright © 2017 by Chris Large; “Birthright” by Stuart Suffel, copyright © 2017 by Stuart Suffel; “The Smoke Means It’s Working” by Sarah Pinsker, copyright © 2017 by Sarah Pinsker; “Torch Songs” by Keith Rosson, copyright © 2017 by Keith Rosson; “The Beard of Truth” by Matt Mikalatos, copyright © 2017 by Matt Mikalatos; “Over an Embattled City” by Adam R. Shannon, copyright © 2017 by Adam R. Shannon; “Origin Story” by Kelly Link, copyright © 2006 by Kelly Link, originally published in A Public Space (Winter 2006) and reprinted in Kelly Link’s Get in Trouble (Random House; 2015)",
  "genres": [
    "Short Stories",
    "Anthologies",
    "Superheroes",
    "Science Fiction",
    "Fiction",
    "Fantasy",
    "Dystopia"
  ],
  "author": "Tricia Reeks",
  "average_rating": "3.60",
  "url": "https://www.goodreads.com/book/show/32718087-behind-the-mask"
}