{
  "title": "The Eaters: Book Two: Return",
  "description": "So not your usual post-apocalyptic, clone vs. hybrid romance-adventure…fans of The Hunger Games looking for an authentic badass heroine will love Dr. Mina Brice in The Eaters trilogy. The Eaters is a character-driven, emotionally charged, action packed first person narrative trilogy, told by the strong but quirky woman protagonist , spanning 500 years, two galaxies, and three sentient species, bridging the genres of urban fantasy and sci-fi and appealing to women as well as men.Book Return continues the story.You didn’t really think things would stay the same, did you?For a while now, Mina has enjoyed domestic life in the peaceful city of Origin. For five years since the departure of the Travelers, Origin has known only peace and prosperity, and Mina’s biggest challenge seems to be protecting her genius daughter Lula from the schoolyard gripes of resentful non-clone mothers. Adjusting to her newly found prominence, Mina has happily returned to her work with her team in the jungle.Five years on, the Director out-maneuvered, the scourge of the Eaters ended, and the Travelers gone, the city of Origin is once more peaceful and it seems that Mina’s biggest problem is protecting her genius daughter Lulu from the vicious, suspicious schoolyard Super Moms while continuing her work in the jungle with bonobos and adjusting to her new-found prominence.But now it’s Jack who’s a little bit … distracted. Mina suspects he’s being unfaithful with his former Eater hunting partner, the sensuous, copper-haired Alyssa. But before Mina can get to the bottom of this new drama, parts of the world quite literally blow up. The Travelers take notice – and they’re coming back! Mina is forced to face her enemy once more. But her battles are only beginning there.The Travelers’ approach triggers a transformation in the former Eaters – returned to human form but still mistrusted and marginalized – into a “half-morph” state neither human nor Eater, further feeding the growing panic taking hold in the population.Now Mina has many battles on her hands – for Lulu’s safety, for Jack’s dignity, life, and love, for the political sanity of Origin, and for the survival of the planet. And once again fair is foul and foul is fair – and not everything is as it seems. You didn’t really think things would stay the same, did you?",
  "genres": [],
  "author": "Corrie Brundage",
  "average_rating": "4.25",
  "url": "https://www.goodreads.com/book/show/32714047-the-eaters"
}