{
  "title": "White Teeth",
  "description": "Barnes & Noble Discover Great New WritersSmith's debut has been described as \"precocious,\" and our volunteer readers eagerly anticipated the arrival of our reader's copies of this work. In fact, we had planned to highlight this amazing stew of a novel last season. But once we determined its May publication date, we decided that rather than promote a title a month in advance of its publication and frustrate readers who'd have to wait, we'd do so in July with our summer selections. One thing is clear: our claim of Zadie Smith as a \"great new writer\" is no longer a solo voice-she's since been mentioned in the same breath as Dickens and Rushdie, Proust, Hemingway and Forster (as in E.M.)!  In this remarkable novel set in postwar London, 24-year-old Smith has cleverly created an unlikely friendship between Archie Jones, a simple working-class Brit, and Samad Iqbal, a Muslim Bengali waiter in an Indian restaurant, who meet in the English army in WWII. After the war, the two commiserate over their lives and those of their children; their dreams, disappointments and expectations unfolding with riotous humor as the characters in both generations struggle to carve out their own cultural identities. As Samad himself says, \" you begin to give up the very idea of belonging. Suddenly, this thing, this belonging, it seems like some long, dirty lie.\" White Teeth is filled to bursting with all the sights, sounds, tastes and smells of London. Melding races and cultures with a near-perfect ear for dialogue and dialect, and weaving successfully (albeit uproariously) between themes of history, religion, faith and science, Zadie Smith's is a stunning, self-assured debut, and an unforgettable new voice in fiction.",
  "genres": [
    "Fiction",
    "Contemporary",
    "Literary Fiction",
    "Book Club",
    "Novels",
    "British Literature",
    "Historical Fiction"
  ],
  "author": "Zadie Smith",
  "average_rating": "3.79",
  "url": "https://www.goodreads.com/book/show/3271162-white-teeth"
}