{
  "title": "Hath No Fury",
  "description": "Mother. Warrior. Caregiver. Wife. Lover. Survivor. Trickster. Heroine. Leader.This anthology features 21 stories and six essays about women who defy genre stereotypes. Here, it's not the hero who acts while the heroine waits to be rescued; Hath No Fury's women are champions, not damsels in distress. Whether they are strong, bold warriors, the silent but powerful type, or the timid who muster their courage to face down terrible evil, the women of Hath No Fury will make indelible marks upon readers and leave them breathless for more.Contents:Foreword by Robin HobbIntroduction Margaret WeisRiding Ever Southward, In the Company of Bees by Seanan McGuireShe Tore by Nisi ShawlThe Scion by S.R. CambridgeHarriet Tubman by Melanie R. MeadorsCasting On by Philippa BallantineFor the Love of Etta Candy by Shanna GermainSome Enchanted Evening by Anton StroutBurning by Elaine CunninghamIt Ain’t Bad to Get Mad by Sarah KuhnA Dance with Death by Marc TurnerAda Lovelace by Melanie R. MeadorsPax Egyptica by Dana CameronA Wasteland of My Own Making by Bradley P. BeaulieuEchoes of Stone by Elizabeth VaughanAnger is a Friend to Love by Diana M. PhoThe Mark of a Mountain Poppy by Erin M. EvansSnakeskin by William C. DietzA Seed Planted by Carina BissettThe Book of Rowe by Carol BergChing Shih by Melanie R. MeadorsShe Keeps Crawling Back by Delilah S. DawsonA Hero of Grünjord by Lucy A. SnyderThe Unlikely Turncoat by Michael R. UnderwoodCraft by Lian HearnReconciling Memory by Gail Z. MartinThis Is Not Another “Why Presentation Is Important” Essay by Monica ValentinelliHeart of Clay by M.L. Brennan Last of the Red Riders  by Django WexlerChristine Jorgensen by Melanie R. MeadorsRise of the Bonecrushers by Eloise J. Knapp",
  "genres": [
    "Fantasy",
    "Anthologies",
    "Short Stories",
    "Urban Fantasy",
    "Adult",
    "Science Fiction",
    "Fiction"
  ],
  "author": "Melanie R. Meadors",
  "average_rating": "3.58",
  "url": "https://www.goodreads.com/book/show/32713866-hath-no-fury"
}