{
  "title": "The Christmas Club",
  "description": "Verna Lind expects Christmas of 1952 to be the best holiday she’s had since the war ended. But as she’s leaving the bank, a frigid wind off Lake Erie catches her hard-earned Christmas club savings, whisking the bills into the busy streets of downtown Cleveland and devastating her plans. Strangers come to her aid, though no one anticipates the power of their chance encounter or the seeds of happiness Verna’s lost money will sow.From Barbara Hinske, best-selling author of the Rosemont series, comes this heartwarming Christmas tale celebrating the generosity of the human spirit and the irresistible pull of love — an instant holiday classic for admirers of It’s a Wonderful Life and The Gift of the Magi.Interview with the Author Have you always wanted to be a writer? I'm an attorney and have done a lot of technical writing, but knew I wanted to write novels. I thought I'd find time when I retired. Fate stepped in, as it often does, and put me on this path sooner. I broke my neck in an auto accident and suffered from double vision for months. I couldn't read or watch TV, so I conceived the plot for my Rosemont series. Why did you decide to write a series? I prefer television series to movies. The longer format of television allows for deeper character development. The same holds true for series fiction. I like to fall in love with a character or hate a character (but root for them to change their ways). I feel like Mma Ramotswe and Mma Makutsi from Alexander McCall Smith's Ladies' Detective Agency series are old friends. I wanted to recreate that sort of connection in the Rosemont series. What other authors do you read or admire? I'm a fan of women's fiction, women's sagas, romantic suspense, domestic suspense, crime fiction, and romance. I love Rosamunde Pilcher's later trilogy -The Shell Seekers, Coming Home, and September. Jan Karon's Mitford series creates an enchanting world, as does Debbie Macomber's Cedar Cove. My Rosemont series is set in the current day, but I've tried to capture a feeling of camaraderie and connection (among the good guys) that takes us back to a slightly simpler time and place. What are your favorite books? In addition to the works I've already mentioned, I adored A Man Called One, The Guernsey Literary and Potato Peel Pie Society, and A Long Way from Chicago. Who has had the greatest influence on your author life? My dad--without question. He told me or read me a bedtime story every night of my childhood, often adding his own twists and turns to the plots or dialogue. He had an incredible, gentle sense of humor. He also wrote novels--who-done-its--when he retired. What are the high points of your author journey? There are 3 things I hold very 1) hearing from readers--especially newly blind adults--that my Guiding Emilyseries has given then hope and provided comfort, 2) having my novella The Christmas Club made into a Hallmark Channel movie of the same name (2019), and 3) seeing my name on the USA Today Bestseller List. What of your own interests have you written about in the Rosemont series? I love my home and all things related to cooking, gardening, decorating, and entertaining. I lovecelebrating all of the seasons and I change my decor for Easter, 4th of July, fall, Halloween, Thanksgiving, Christmas, and spring.",
  "genres": [
    "Christmas",
    "Fiction",
    "Holiday",
    "Historical Fiction",
    "Book Club",
    "Audiobook",
    "Romance"
  ],
  "author": "Barbara Hinske",
  "average_rating": "4.30",
  "url": "https://www.goodreads.com/book/show/32735570-the-christmas-club"
}