{
  "title": "LOG: The Legends of Genesis: Not Your Ordinary Heroes",
  "description": "The Legends of Genesis (Asian, African, and World mythology) (fantasy, super power, anime, super hero, wuxia, martial arts, philosophy, historical, romance, action, adventure, sci-fi, prehistoric)Imagine a world where people don't age past their prime. Where a person that would labeled as intellectually gifted on Earth is nothing more than average there. A place where the average person is even more powerful than your typical super hero. A place several times more vast and mysterious than earth . and home to over 50 non hybrid races. Just Imagine how far they would have advanced in the time that we have had. Then imagine how far they would have advanced given 10, 100, or even 1000 times longer than we had. Do you imagine large skyscrapers and flying cars as in your common sci fi flicks and novels. Well, they've advanced far past that even. What would their super heroes be like, and the villains that they have to combine forces to fight against. And how would the planet survive the battles between these people. Not to mention what would every day life be like? And with their powers would they feel as gods themselves and not have need to reverence them?In fact the heroes held a contest and after beating many Shenxian, kami, Orishas, and Immortals they believed they were indeed powerful enough to at least compete with the gods. They challenged the supreme gods and the realm gods. After loosing horribly they incurred the supreme goddess' wrath as punishment. However she was not satisfied with just punishing them, as she wanted to destroy them completely. However the supreme god felt that their punishment was enough and that they should be forgiven. Unable to agree they decided to settle it the way gods do. They made bet which would decide whether they would perish or thrive. Six beings would be created, beings much more powerful than any that have ever been created. Two beings would be of light, two would be of darkness, and two neutral ones that would pick a side. The gods would set up challenges for them along the way to train them until the day of the final contest. When that day comes they would fight each other to the death and if light won they would be saved, however if dark won they would all die. Which one would prevail light or darkness? Sounds like your typical fantasy novel right? However what if when they are born they decide not to be pawns in the god's game? Can and will they defy their destiny even when all their moves are being controlled leading them to that end? And if they do defy the gods what will be the retribution for their actions,... and more importantly how will they respond to it?This story follows the lives of the 6 beings.The children of DarknessTitan- (master of dimensions, souls, energy, and matter/anti matter)Nina- (Master of psyche, various elements and forces, space, and the dead)The children of LightEmerald- (elemental master, spirit and sentient, energy, matter and fusion)Sapphire (Master of copying and reversing, Time, and various elements)The neutral childrenRage (master of reality, mystic, and various elements.)Dragon (master of magic, various elements, and death)This story has hundreds of characters all with their own goals and interest. Full of unexpected plot twists and turns that will keep you guessing at each turn of the page. Volume 1 deals with the introduction of the main characters but is by no means slow paced. It pulls you right into the ever evolving and expanding world. Filled with action, romance, comedy, and philosophy that will have you rethink everything. This is anything but ordinary, and one thing to keep in mind is that nothing is as it seems. Are you ready for an emotional roller coaster, that is not only entertaining but will give you something to think about long after you put the book down.",
  "genres": [],
  "author": "Mark McCants",
  "average_rating": "4.14",
  "url": "https://www.goodreads.com/book/show/32725389-log"
}