{
  "title": "Murderers' Row: A Collection of Shocking True Crime Stories",
  "description": "In this riveting collection of true crime stories from the files of award-winning journalist and New York Times bestselling author of 32 books, M. William Phelps, someone tries to pin a gruesome murder on a horse, infamous serial killer Son of Sam shows us his true evil nature in a series of lost letters this psychopath never wanted you to see, and Sesame Streets Big Bird comes home to find a dead woman on his estate. These shocking stories join several others that only a master storyteller like Phelps can bring to life for readers. The six stories in this collection have been published in various print and digital places but have never been brought together in one terrifying, mysterious read. Phelps updates each case. One story involves a young man who believes he's figured out the perfect way to commit a murder after binge-watching \"Forensic Files.\" In this opening tale, a Massachusetts man is stalked by a hired killer because of the information he holds in the case of insurance scam gone bad, resulting in savage murder. Next up is the story of a restaurant owner and her husband, enjoying a calm, peaceful life in the Berkshires, with all the charm and tranquility New England has to offer, until a bloody trail inside a barn leads to a gruesome discovery and a familys deepest, darkest secrets are exposed. Phelps also takes readers behind the scenes of his hit Investigation Discovery series \"Dark Minds,\" revealing his investigative secrets with an intimate look at those serialkiller cold cases that still haunt Phelps today. Finally, as another bonus, Phelps, who author Vincent Bugliosi called one of Americas best true crime journalists, heads out to meet renowned forensic scientist Dr. Henry Lee in a narrative interview that reveals Lees ingenious and humorous take on life, his crime-scene philosophy, and the ways in which he deals with the brutality of the work he does.",
  "genres": [
    "True Crime",
    "Nonfiction",
    "True Story"
  ],
  "author": "M. William Phelps",
  "average_rating": "3.85",
  "url": "https://www.goodreads.com/book/show/32726086-murderers-row"
}