{
  "title": "Runnin' with the Devil: A Backstage Pass to the Wild Times, Loud Rock, and the Down and Dirty Truth Behind the Making of Van Halen",
  "description": "The manager who shepherded Van Halen from obscurity to rock stardom goes behind the scenes to tell the complete, unadulterated story of David Lee Roth, Eddie Van Halen, and the legendary band that changed rock music.Van Halen’s rise in the 1980s was one of the most thrilling the music world had ever seen—their mythos an epic party, a sweaty, sexy, never-ending rock extravaganza. During this unparalleled run of success, debauchery, and drama, no one was closer to the band than Noel Monk. A man who’d worked with some of rock’s biggest and most notorious names, Monk spent seven years with Van Halen, serving first as their tour manger then as their personal manager until 1985, when both he and David Lee Roth exited as controversy, backstabbing, and disappointment consumed the band.Throughout Van Halen’s meteoric rise and abrupt halt, this confidant, fixer, friend, and promoter saw it all and lived to tell. Now, for the first time, he shares the most outrageous escapades—from their coming of age to their most shocking behavior on the road; from Eddie’s courtship and high profile wedding to Valerie Bertinelli to the incredible drug use which would ultimately lead to everyone’s demise. Sharing never-before-told stories, Monk paints a compelling portrait of Eddie Van Halen, bringing into focus the unique combination of talent, vision, hardship, and naiveté that shaped one of the greatest rock guitarists of all time—and made him and his brother vulnerable to the trappings and failings of fame.Illustrated with dozens of rare photographs from Monk’s vaults, Runnin’ with the Devil is manna from rock heaven no Van Halen fan can miss.",
  "genres": [
    "Music",
    "Nonfiction",
    "Biography",
    "Memoir",
    "History",
    "Audiobook",
    "Rock N Roll"
  ],
  "author": "Noel E. Monk",
  "average_rating": "4.01",
  "url": "https://www.goodreads.com/book/show/32726815-runnin-with-the-devil"
}