{
  "title": "Rock's Redemption",
  "description": "Rock is the ripped, handsome Sergeant-At-Arms for the Insurgents MC. Being one of the club’s officers, women clamor to share his bed. The biker’s more than willing to oblige as long as it’s a short-time hookup; long-term relationship is not part of his vocabulary.  He’s only been in love once—a long time ago—and the end result was shattering. He learned his lesson: keep his heart encased in steel.  The tragic night that sent him to prison is over even though it still simmers inside him. But once he joined the Insurgents MC, he vowed to leave the past darkness and disappointments back in Louisiana. He’s embraced his new life of brotherhood, booze, easy women, and Harleys. It suits him just fine. Some things are best left alone, especially a pretty brunette who destroyed his heart.  Easy sex has become his mantra. Until his past crashes into his life….  Clotille Boucher is the wealthy, spoiled girl who’d stolen Rock’s heart many years ago. From a young age, family loyalty was drilled into her, so when darkness engulfed her and Rock, fleeing seemed to be the only way out for her. Deciding to make a new life for herself, she didn’t count on having to pay for the sins of her brother.  Just when her life doesn’t seem like it could get worse, a face from her past gives her a glimmer of hope. Shamed that Rock has to see how far she’s fallen, she pretends her life is exactly what she wants, but his penetrating stare tells her he’s not buying her act.  Fearful that the secrets of the past will catch up with her and Rock, her inclination is to do what she does best—run away. Only problem is, Rock’s not letting her slip away so easily this time.  Can two damaged people learn to trust one another again? Will Rock be able to reconcile the demons that have plagued him since that tragic night? Does Clotille offer him redemption or destruction?  As Rock and Clotille maneuver the treacherous waters of their past and present, someone is lurking behind the shadows to make sure the truth never comes out.  The Insurgents MC series are standalone romance novels. This is Rock and Clotille’s love story. This book contains violence, sexual assault (not graphic), strong language, and steamy/graphic sexual scenes. It describes the life and actions of an outlaw motorcycle club. If any of these issues offend you, please do not read the book. HEA. No cliffhangers! The book is intended for readers over the age of 18.",
  "genres": [
    "Romance",
    "BDSM",
    "Dark",
    "Contemporary",
    "Second Chance",
    "Suspense",
    "Erotica"
  ],
  "author": "Chiah Wilder",
  "average_rating": "4.40",
  "url": "https://www.goodreads.com/book/show/32726808-rock-s-redemption"
}