{
  "title": "Rule",
  "description": "“Come to Paris.”\nIt had been a dream Charlotte Duval was only too happy to believe in. But then she’d packed up her life in L.A. and flown across the Atlantic to find that Christophe Marchand had abandoned her.Again.She knew when it was time to give up on a man. And it was past time to give up on Christophe Marchand.She goes about her business, settling into her father’s antique shop as she tries to forget the man who broke her heart. When she makes one final pass by his house in Saint-Germain, she finds the street lined with cars, the lights on inside for the first time in weeks. Bracing herself for the truth of his abandonment, she approaches the house, determined to get closure. What she finds instead nearly brings her to her knees.She’d been waiting for him. And now she would think he didn’t love her.Christophe Marchand wanted nothing more than to fulfill his promise to Charlotte. To take care of her and protect her. To let her know him and to know her in return. Then he was ambushed and taken prisoner by the newly-freed Raneiro Donati and his men. As he suffers through their torture, there’s only one thing that sustains him.Charlotte. His heart and soul.He waits for the rescue he knows will come, determined to exact his revenge — and secure the Paris territory against a coup d’etat by Raneiro.But taking out Raneiro proves more difficult than expected, even with the help of Farrell Black and Luca Cassano. When their woman come under attack it becomes clear they need reinforcements — and there is only one man who can do the job.As the group fights for their business, their women, and their very lives, Charlotte realizes she’s committing to more than a man. She’s committing to a lifestyle unlike any other.And whatever happens, there will be no going back.*** This is the final book in the Paris Mob series, and the book that brings the entire Mob Boss series to a stunning conclusion. ***",
  "genres": [
    "Romance"
  ],
  "author": "Michelle St. James",
  "average_rating": "4.35",
  "url": "https://www.goodreads.com/book/show/32733475-rule"
}