{
  "title": "Stepbrother With Benefits 19",
  "description": "\"You're going to get me in trouble now, aren't you?\" I ask him.  \"Yeah,\" he says. \"A lot. You'll love it, though. I promise.\"  What can I say to that? Ethan's really good at keeping his promises...  Rule #19 – Teasing and anticipation should always lead to future pleasure. We're allowed to give each other one moment of intense excitement and build up, but that's it.  Just one!  The next time is the real thing...  Earlier today, Ethan opened the door for me like the bad boy gentleman he is, which basically means that right after I walked past him he smacked my butt. It's not all naughtiness, though. Our relationship is interesting like that.  He says I'm like a flower that wants to blossom. I think I already have, but Ethan makes me feel like I can do it even more. His kiss sends shivers through my body, a trembling transformation, like I'm becoming something else or someone else entirely.  I don't know when I changed. Maybe it started a long time ago, or maybe it was last summer when Ethan and I slept together, or maybe it wasn't even then and it was later that week when he flew on a plane to save me. He was just my stepbrother with benefits at the time. Have I mentioned I really like benefits?  Maybe I changed sometime during the summer we spent together. It might have been right before we came back to school, our last night, when we cuddled in bed together for what seemed like the last time.  Maybe it was sometime after that. Or maybe it's right now.  Once this is all done, and once I have my revenge against Jake, I won't keep anymore secrets. We can be together without anything getting in our way. I'm going to tell Ethan everything after this. I'll tell him what I did.  I hope he won't be mad at me.  Why does revenge have to be so complicated?",
  "genres": [
    "Erotica",
    "Erotic Romance",
    "Romance",
    "New Adult",
    "Contemporary"
  ],
  "author": "Mia Clark",
  "average_rating": "4.08",
  "url": "https://www.goodreads.com/book/show/32732489-stepbrother-with-benefits-19"
}