{
  "title": "I Can't Breathe: A Killing on Bay Street",
  "description": "A work of riveting literary journalism that explores the roots and repercussions of the infamous killing of Eric Garner by the New York City police—from the bestselling author of The Divide. On July 17, 2014, a forty-three-year-old black man named Eric Garner died on a Staten Island sidewalk after a police officer put him in what has been described as an illegal chokehold during an arrest for selling bootleg cigarettes. The final moments of Garner's life were captured on video and seen by millions. His agonized last words, \"I can't breathe,\" became a rallying cry for the nascent Black Lives Matter protest movement. A grand jury ultimately declined to indict the officer who wrestled Garner to the pavement. Matt Taibbi's deeply reported retelling of these events liberates Eric Garner from the abstractions of newspaper accounts and lets us see the man in full—with all his flaws and contradictions intact. A husband and father with a complicated personal history, Garner was neither villain nor victim, but a fiercely proud individual determined to do the best he could for his family, bedeviled by bad luck, and ultimately subdued by forces beyond his control.  In America, no miscarriage of justice exists in isolation, of course, and in I Can't Breathe Taibbi also examines the conditions that made this tragedy possible. Featuring vivid vignettes of life on the street and inside our Kafkaesque court system, Taibbi's kaleidoscopic account illuminates issues around policing, mass incarceration, the underground economy, and racial disparity in law enforcement. No one emerges unsullied, from the conservative district attorney who half-heartedly prosecutes the case to the progressive mayor caught between the demands of outraged activists and the foot-dragging of recalcitrant police officials.  A masterly narrative of urban America and a scathing indictment of the perverse incentives built into our penal system, I Can't Breathe drills down into the particulars of one case to confront us with the human cost of our broken approach to dispensing criminal justice.",
  "genres": [
    "Nonfiction",
    "Politics",
    "Race",
    "True Crime",
    "Social Justice",
    "Crime",
    "History"
  ],
  "author": "Matt Taibbi",
  "average_rating": "4.38",
  "url": "https://www.goodreads.com/book/show/32740061-i-can-t-breathe"
}