{
  "title": "The Baby Trail",
  "description": "Makeup artist Emma Hamilton is thirty-three when she and her husband James decide it's time to start a family. She has it all mapped out: Go off the pill in December, have sex, get pregnant by January, have the baby in September. With the help of a personal trainer, she figures she'll be back to her fighting weight in time for Christmas. But when three months of candle-scented sex fails to produce the desired result, Emma decides that maybe Mother Nature needs a helping hand.Soon her life is a roller coaster of post-coital handstands (you can't argue with gravity), hormone-inducing (sanity-reducing!) drugs, and a veritable army of probing specialists (torturers, more like). It's out with alcohol and spontaneous sex, in with green tea and ovulation kits. Emma and James try everything from fertility drugs to in vitro, but all their carefully laid plans seem to go south -- along with Emma's rapidly plummeting self-esteem. The members of her support team are unquestionably loyal, but distracted by their own personal dramas. There's Babs, her younger sister, who prescribes Emma half an Ecstasy pill to treat her depression. Her friend Jess is pregnant with her second child and gives Emma an earful about the downside of motherhood. The glamorous Lucy, Emma's closest pal, fears she might be stuck in her \"single rut\" forever -- that is, until she meets Donal, a rough-around-the-edges rugby player who passes out on their first date but quickly proves that he is worth a second chance. And last, but certainly not least, is James, Emma's rugby coach husband, who quite unhelpfully manages to give himself a groin injury just when she is ovulating.But just when Emma feels as if her obsession may have alienated all of her loved ones, including James, events take a ninety-degree turn that will have unforeseen consequences for everyone.Sinead Moriarty brings a wicked sense of humor to a subject of feverish concern for women worried by the loud ticking of their biological clocks in this sizzlingly funny, yet deeply moving novel.",
  "genres": [
    "Chick Lit",
    "Fiction",
    "Contemporary",
    "Romance",
    "Humor",
    "Irish Literature",
    "Ireland"
  ],
  "author": "Sinéad Moriarty",
  "average_rating": "3.76",
  "url": "https://www.goodreads.com/book/show/327369.The_Baby_Trail"
}