{
  "title": "Black Glass",
  "description": "Gifted novelist Fowler (\nSarah Canary\n and \nThe Sweetheart Season\n) delights in the arcane, and as a result, these 15 clever tales are occasionally puzzling but never dull.In the long title story, \"Black Glass\", temperance activist Carry Nation is resurrected in the 1990s (\"We're talking about a very troubled, very big woman,\" says one shaken barman to reporters) and becomes such a nuisance that the DEA is forced to dispatch her with voodoo. Other plots are only slightly less outrageous in conceit. In \"Lieserl,\" a lovesick madwoman dupes Albert Einstein into believing he has a daughter; in \"The Faithful Companion at Forty,\" Tonto admits to second thoughts about his biggest life choice (\"But for every day, for your ordinary life, a mask is only going to make you more obvious. There's an element of exhibitionism in it\"). \"The Travails\" offers a peek at the one-sided correspondence of Mary Gulliver, who wants Lemuel to come home already and help out around the house. The homage to Swift makes sense, for, when Fowler doesn't settle for amusing her readers, she makes a lively satirist.The extraterrestrials who appear in her stories (whether the inscrutably sadistic monsters in \"Duplicity\" or the members of a seminar studying late-1960s college behavior in \"The View from Venus: A Case Study\") seem stand-ins for the author herself, who, in elegant and witty prose, cultivates the eye of a curious alien and, along the way, unfolds eccentric plots that keep the pages turning.Contents:Black Glass (1991)Contention (1986)Shimabara (1995)The Elizabeth Complex (1996)Go Back (1998)The Travails (1998)Lieserl (1990)Letters from Home (1987)Duplicity (1989)The Faithful Companion at Forty (1987)The Brew (1995)Lily Red (1988)The Black Fairy's Curse (1997)The View from Venus (1986)Game Night at the Fox and Goose (1989)",
  "genres": [
    "Short Stories",
    "Fiction",
    "Fantasy",
    "Speculative Fiction",
    "Collections",
    "Short Story Collection",
    "Literature"
  ],
  "author": "Karen Joy Fowler",
  "average_rating": "3.60",
  "url": "https://www.goodreads.com/book/show/119991.Black_Glass"
}