{
  "title": "Report on a Journey to the Western States of North America and a Stay of Several Years Along the Missouri (During the Years 1824, '25, '26, 1827)",
  "description": "The mass migrations to the United States from Europe that began in the 1830s were strongly influenced by what is known today as emigration literature--travelers' writings about their experiences in the New World. Such accounts were particularly popular with German readers; over 150 examples of the genre were published in Germany between 1827 and 1856. Gottfried Duden's Report on a Journey to the Western States of North America, published in 1829, was one of the most influential of these books. The timing, format, coverage, and literary qualities of the Report, and its idyllic descriptions of pioneer farming in Missouri, combined to make it an instant success. It attracted thousands of Germans to the Midwest, and particularly to Missouri, the focus of Duden's account. This edited and annotated translation is the first complete version to be published in English. It provides for the general public and the professional historian a significant contribution to U.S. immigration history and a unique and delightful fragment of Missouri's rich German heritage. Duden presented his account in the form of personal letters, a style that helped make the book believable. The Mississippi- Missouri valley reminded him of his native Rhineland where the rivers facilitated trade and transportation, and fertile river bottomland offers the perfect environment for agriculture. Duden farmed the land he bought during his sojourn in Missouri, and his book includes meticulous descriptions of clearing, fencing, and harvesting. His pro-emigration bias, colored by the fact that he himself had been able to hire help on his Missouri farm, made his view of the farmer's life, it turned out, more idyllic than practical. Many would-be gentlemen farmers, inspired by his book to come to Missouri, found pioneer farming more strenuous than they had expected.",
  "genres": [
    "History",
    "Nonfiction"
  ],
  "author": "Gottfried Duden",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/3276114-report-on-a-journey-to-the-western-states-of-north-america-and-a-stay-of"
}