{
  "title": "Mardi Gras Indians",
  "description": "One of the most dazzling elements of the Mardi Gras celebrations, the Mardi Gras Indians receive the attention and respect of carnival-goers for their elaborately beaded costumes and entertaining dances. But what few realize about the groups is that the parading is more than just for show. Costuming, dancing, and all of the rituals of these groups are acts of cultural preservation that date back more than a century. In his new book, Michael P. Smith addresses the sociological issues surrounding the mislabeled and rarely understood Maroon groups now known as \"Mardi Gras Indians.\" His textual analysis of the culture examines its African origins and how the participants help to develop the African-American cultural identity. He looks at how some African-Americans resisted efforts to suppress traditions that are re-emerging in modern society.Researched and documented by generations of oral and written history, this work clearly outlines the mistaken identification of the Mardi Gras Indians as just an entertainment element of the carnival season. It also shows the vital role this traditional culture plays in the community, much as the Black Spiritual Churches do, in preserving an authentic base for the unique cultural heritage of blacks in New Orleans. This work illustrates how the Mardi Gras Indians are a part of the New Orleans second-line tradition.A dynamic element of this book is the collection of more than one hundred color photos. These prints capture the striking beauty of spectacles with a purpose far greater than entertaining. Combined with authoritative text by Smith, the visual images round out this examination of the roots of the Mardi Gras Indians and current practices of the whole range of African-American cultural societies and parading groups in the Crescent City. Michael P. Smith is a native of New Orleans and an award-winning professional free-lance photographer. His special respect for the musical and cultural history of New Orleans has earned him the general trust of various ethnic groups he has documented and written about. Smith's work has been presented in the Museum of American History at the Smithsonian Institution in Washington, D.C., and numerous other museums in America and Europe. He has received two Photographer's Fellowships from the National Endowment for the Arts, and his prints have toured worldwide under the auspices of the United States Information Service. He is also the author of New Orleans Jazz Fest: A Pictorial History and Spirit World: Pattern in the Expressive Folk Culture of African-American New Orleans .",
  "genres": [],
  "author": "Michael P. Smith",
  "average_rating": "4.36",
  "url": "https://www.goodreads.com/book/show/327545.Mardi_Gras_Indians"
}