{
  "title": "La guerre du Cameroun. L’invention de la Françafrique",
  "description": "La légende veut que la France ait \" généreusement \" amené ses anciennes colonies d'Afrique noire à l'indépendance en 1960. Une décolonisation qui se serait faite dans la compréhension mutuelle et l'intérêt partagé de la France et de l'Afrique. Ce livre raconte une tout autre histoire : celle d'une guerre brutale, violente, meurtrière et méconnue, la guerre du Cameroun, qui a permis à Paris d'inventer un nouveau système de domination : la Françafrique.La légende veut que la France, \" patrie des droits de l'homme \", ait généreusement offert l'indépendance à ses anciennes colonies d'Afrique noire en 1960. Ce livre raconte une tout autre histoire : celle d'une guerre brutale, violente, meurtrière, qui a permis à Paris d'inventer un nouveau système de domination : la Françafrique. Cette guerre secrète a pour théâtre le Cameroun des années 1950 et 1960. Confrontées à un vaste mouvement social et politique, porté par un parti indépendantiste, l'Union des populations du Cameroun (UPC), les autorités françaises décident de passer en force. En utilisant les mêmes méthodes qu'en Algérie (torture, bombardements, internements de masse, action psychologique, etc.), elles parviennent en quelques années à éradiquer militairement les contestataires et à installer à Yaoundé une dictature profrançaise. En pleine guerre froide, et alors que l'opinion française a les yeux tournés vers l'Algérie, la guerre du Cameroun, qui a fait des dizaines de milliers de morts, est à l'époque passée inaperçue. Elle a ensuite été effacée des mémoires par ceux qui l'ont remportée : les Français et leurs alliés camerounais. Le crime fut donc presque parfait : les nouvelles autorités camerounaises ont repris les mots d'ordre de l'UPC pour vider l'\" indépendance \" de son contenu et la mettre au service... de la France ! Mais la mémoire revient depuis quelques années. Et les fantômes du Cameroun viennent hanter l'ancienne métropole. Laquelle, de plus en plus contestée sur le continent africain, devra tôt ou tard regarder son passé en face.",
  "genres": [
    "History",
    "Africa",
    "Nonfiction"
  ],
  "author": "Thomas Deltombe",
  "average_rating": "4.27",
  "url": "https://www.goodreads.com/book/show/32761158-la-guerre-du-cameroun-l-invention-de-la-fran-afrique"
}