{
  "title": "The Road to Rescue: The Untold Story of Schindler's List",
  "description": "“Don’t thank me for your survival, thank your valiant Stern and Pemper, who stared death in the face constantly.”—Oskar Schindler in a speech to his released Jewish workers in May 1945.Steven Spielberg’s Oscar-winning film Schindler’s List popularized the true story of a German businessman who manipulated his Nazi connections and spent his personal fortune to save some 1,200 Jewish prisoners from certain death during the Holocaust. But few know that those lists were made possible by a secret strategy designed by a young Polish Jew at the Płaszow concentration camp. Mietek Pemper’s compelling and moving memoir tells the true story of how Schindler’s list really came to pass.Pemper was born in 1920 into a lively and cultivated Jewish family for whom everything changed in 1939 when the Germans invaded Poland. Evicted from their home, they were forced into the Krakow ghetto and, later, into the nearby camp of Płaszow where Pemper’s knowledge of the German language was put to use by the sadistic camp commandant Amon Goth. Forced to work as Goth’s personal stenographer from March 1943 to September 1944—an exceptional job for a Jewish prisoner—Pemper soon realized that he could use his position as the commandant’s private secretary to familiarize himself with the inner workings of the Nazi bureaucracy and exploit the system to his fellow detainees’ advantage. Once he gained access to classified documents, Pemper was able to pass on secret information for Schindler to compile his famous lists. After the war, Pemper was the key witness of the prosecution in the 1946 trial against Goth and several other SS officers. The Road to Rescue stands as a historically authentic testimony of one man’s unparalleled courage, wit, defiance, and bittersweet victory over the Nazi regime.",
  "genres": [
    "Holocaust",
    "History",
    "Nonfiction",
    "World War II",
    "War",
    "Biography",
    "Memoir"
  ],
  "author": "Mietek Pemper",
  "average_rating": "4.19",
  "url": "https://www.goodreads.com/book/show/3274874-the-road-to-rescue"
}