{
  "title": "Claiming Dane",
  "description": "With a past shadowed in vices, Tony Morretti is finally ready to face his demons. A Dominant surgeon, fearless and desperate, he risks everything to leave his career, the empty relationships, the façade of a life he’s created to attend his brother’s memorial. Guilt threatens to drown any hope of a stable future with his family’s forgiveness when his mother asks him not to attend the service. With a wake of devastating decisions, he has to make one more. Stay and risk falling in love with a man threatening to open every wound in his jaded soul or return home and fall deeper into the darkness he’s created.  A wounded soldier, Dane McNeil, has to once again take a risk. A one night stand with the dark haired stranger standing in his hotel lobby would lead to more broken promises, more offers to kneel at the feet of yet another empty affair. “This is my rifle. There are many like it, but this one is mine.” An oath Dane has sworn to live by will now defend his young daughter’s life from her dangerous mother. With a hotel and security business to run, his life has fallen into days of coloring books and leaky faucets. While his heart longs to share a bed with the sexy doctor who’s landed on the doorstep desperate for a room, he knows that handsome smile will lead to more sleepless nights and yet another crack in what’s left of his already shattered heart.  Trust is broken when secrets are revealed and Dane must walk away from the only man he’s ever loved. For a reluctant Dominant, Tony is terrified. He doesn’t need another sub to take care of, another lover incapable of keeping the commanding darkness from killing his soul.  But, Dane’s no longer a sub. Tony, no longer a Dom.  Claiming Dane is book two in the Hot Southern Nights series. This book can be read as a standalone or with Gilded Lily, book one in this series.",
  "genres": [
    "M M Romance",
    "LGBT",
    "Romance"
  ],
  "author": "Pauline Allan",
  "average_rating": "3.85",
  "url": "https://www.goodreads.com/book/show/32739389-claiming-dane"
}