{
  "title": "The Lottery and Other Stories; The Haunting of Hill House; We Have Always Lived in the Castle",
  "description": "\"The world of Shirley Jackson is eerie and unforgettable,\" writes A. M. Homes. \"It is a place where things are not what they seem; even on a morning that is sunny and clear there is always the threat of darkness looming, of things taking a turn for the worse.\" Jackson's characters-mostly unloved daughters in search of a home, a career, a family of their own-chase what appears to be a harmless dream until, without warning, it turns on its heel to seize them by the throat. We are moved by these characters' dreams, for they are the dreams of love and acceptance shared by us all. We are shocked when their dreams become nightmares, and terrified by Jackson's suggestion that there are unseen powers-\"demons\" both subconscious and supernatural-malevolently conspiring against human happiness.  In this volume Joyce Carol Oates, our leading practitioner of the contemporary Gothic, presents the essential works of Shirley Jackson, the novels and stories that, from the early 1940s through the mid-1960s, wittily remade the genre of psychological horror for an alienated, postwar America. She opens with \"The Lottery\" (1949), Jackson's only collection of short fiction, whose disquieting title story-one of the most widely anthologized tales of the 20th century-has entered American folklore. Also among these early works are \"The Daemon Lover,\" a story Oates praises as \"deeper, more mysterious, and more disturbing than 'The Lottery, ' \" and \"Charles,\" the hilarious sketch that launched Jackson's secondary career as a domestic humorist. Here too are Jackson's masterly short novels: \"The Haunting of Hill House\" (1959), the tale of an achingly empathetic young woman chosen by a haunted house to be its new tenant, and \"We Have Always Lived in the Castle\" (1962), the unrepentant confessions of Miss Merricat Blackwood, a cunning adolescent who has gone to quite unusual lengths to preserve her ideal of family happiness. Rounding out the volume are 21 other stories and sketches that showcase Jackson in all her many modes, and the essay \"Biography of a Story,\" Jackson's acidly funny account of the public reception of \"The Lottery,\" which provoked more mail from readers of \"The New Yorker\" than any contribution before or since.",
  "genres": [
    "Horror",
    "Fiction",
    "Classics",
    "Short Stories",
    "Mystery",
    "Anthologies",
    "American"
  ],
  "author": "Shirley Jackson",
  "average_rating": "4.39",
  "url": "https://www.goodreads.com/book/show/3276530-the-lottery-and-other-stories-the-haunting-of-hill-house-we-have-alway"
}