{
  "title": "Blood Moon",
  "description": "In this exciting continuation to the True Mates Series, Human Liaison Cady Gray and Second-in-Command Nick Vrost are drawn together after a night of passion.  Despite growing up in the world of the New York Lycan clan, Cady Gray still feels like an outsider looking in. She’s built walls around her, to protect herself and the clan, harboring a deep secret from her past that threatens her future. The clan’s sexy Beta shifter has always intrigued her, but he’s kept his distance, that is, until one innocent dance.  Nick Vrost has wanted Cady for years, but kept his own desires at bay for the sake of the clan and his family. As second-in-command of the New York clan and heir to the Vrost fortune, it was his duty to marry a suitable high-ranking Lycan female and produce a child to carry on the line. After ignoring Cady for years, one touch ignites something he can no longer control and he may have to choose between family obligation and his long-simmering desire for the quiet beauty.  When a near-catastrophic event forces them to confront their attraction, they find that one night simply isn’t enough. However, the New York clan is facing its biggest challenge yet and incidents attacking Lycans in the city are increasing. Cady’s life is put in danger, but evidence begins to link her to the attacks. But, who is behind all these threats and will the Lycans survive?  Blood Moon is a full-length (over 60,000 words) werewolf paranormal romance with explicit love scenes, naughty language, and shifter suspense action with guaranteed HEA and no cliffhangers!  Although it works as a standalone romance story, this book takes place in the True Mates series. Though not necessary, I recommend you read “Fated Mates” before this book to understand the world and the main plot.",
  "genres": [
    "Paranormal",
    "Romance",
    "Paranormal Romance",
    "Shapeshifters",
    "Werewolves",
    "Fantasy",
    "Contemporary"
  ],
  "author": "Alicia Montgomery",
  "average_rating": "4.42",
  "url": "https://www.goodreads.com/book/show/32766473-blood-moon"
}