{
  "title": "10 Books That Screwed Up the World: And 5 Others That Didn't Help",
  "description": "You've heard of the \"Great Books\"?These are their evil opposites. From Machiavelli's The Prince to Karl Marx's Communist Manifesto to Alfred Kinsey's Sexual Behavior in the Human Male, these \"influential\" books have led to war, genocide, totalitarian oppression, family breakdown, and disastrous social experiments. And yet these authors' bad ideas are still popular and pervasive-in fact, they might influence your own thinking without your realizing it. Here with the antidote is Professor Benjamin Wiker. In his scintillating new book, 10 Books That Screwed Up the World: And 5 Others That Didn't Help, he seizes each of these evil books by its malignant heart and exposes it to the light of day. In this witty, learned, and provocative expose, you'll learn:-Why Machiavelli's The Prince was the inspiration for a long list of tyrannies (Stalin had it on his nightstand)-How Descartes's Discourse on Method \"proved\" God's existence only by making Him a creation of our own ego-How Hobbes's Leviathan led to the belief that we have a \"right\" to whatever we want-Why Marx and Engels's Communist Manifesto could win the award for the most malicious book ever written-How Darwin's Descent of Man proves he intended \"survival of the fittest\" to be applied to human society-How Nietzsche's Beyond Good and Evil issued the call for a world ruled solely by the \"will to power\"-How Hitler's Mein Kampf was a kind of \"spiritualized Darwinism\" that accounts for his genocidal anti-Semitism-How the pansexual paradise described in Margaret Mead's Coming of Age in Samoa turned out to be a creation of her own sexual confusions and aspirations-Why Alfred Kinsey's Sexual Behavior in the Human Male was simply autobiography masquerading as scienceWitty, shocking, and instructive, 10 Books That Screwed Up the World offers a quick education on the worst ideas in human history-and how we can avoid them in the future.",
  "genres": [
    "Nonfiction",
    "History",
    "Philosophy",
    "Politics",
    "Books About Books",
    "Religion",
    "Audiobook"
  ],
  "author": "Benjamin Wiker",
  "average_rating": "3.42",
  "url": "https://www.goodreads.com/book/show/3277037-10-books-that-screwed-up-the-world"
}