{
  "title": "Training Your Girlfriend To Submit And Obey",
  "description": "Making a girlfriend obey has several benefits. Training her can be a long road when your desired outcome is the perfect girl who does as she’s told, who worships you with all of her love, and who would never cheat on you or think of doing anything that displeases you. Please don’t think this book is a book for misogynistic male archetypes who seek only to control their universe and who have mommy issues. This book is for the ‘real’ man who knows his place, his girlfriend’s place, and who wants the world to be playground. A true man showers his girlfriend with love when she obeys and submits to him and punishes her when she disobeys and gets out of line. There has to be law and order in every relationship. There has to be someone who is in control, who has the upper-hand, and, let me suggest, if it’s not you (the man in the relationship), then it is probably her. You must learn to dominate and this means teaching her to submit. If you don’t, you’ll never have a truly satisfying relationship that is tighter than glue. This book is going to teach you techniques for making her obey and submit to you. It is going to provide you with a lot of sound practical advice and help you along this wonderful journey of training her to obey and submit. I want you to get excited, because a girl who obeys and does as she’s told is a happy girl, one who loves you, one who truly cares about you and your happiness. This is what makes her happiest. If you have gone through a lot of relationships, had little luck with girls, then this book will be eye-opening and refreshing for you because you’ll finally learn what you’ve been doing wrong and how to correct it. You will be correcting yourself by learning how to correct her. A girl who obeys you and who is submissive is the perfect girlfriend, isn’t she (?), since a girl who doesn’t is bitchy and controlling and constantly a problem for you. I welcome you. Grab Your Copy Now!",
  "genres": [],
  "author": "Ryan Hale",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/32765373-training-your-girlfriend-to-submit-and-obey"
}