{
  "title": "Roughing the Passer",
  "description": "They couldn’t be more different, and yet they might just be exactly what each other needs.Garrett Barnes is no stranger to overcoming the odds. Forced to walk away from a Division I scholarship to take care of his family, Garrett was sure he'd never play football again. When an offer comes in from the ESC Mavericks--a school near his hometown--it seems like a dream come true. There's only one catch: he's expected to single-handedly save the worst team in the state.Diego Ruiz has known his whole life that the deck is stacked against him. The harder he tries to fight it, the more it hurts when it knocks him back down. With a lifetime of disappointment to back him up, he's stopped trying for anything more than mediocrity, both on and off the football field. If not for a promise he'd made years ago, he'd probably just be some nobody in a nowhere job.So when Coach Ladner brings in some D1 \"hero\" to save the team, Diego is determined to show him exactly where hard work and perseverance get you--absolutely nowhere. Despite his best efforts, Garrett's unwavering optimism starts to get under Diego's skin. Caught on the verge of giving in, he relies on the one thing that's never failed him: his ability to get curious straight boys into bed.As the friction between them gives way to passion, the stakes of their former rivalry increase tenfold. With both men's hearts--and a state title--on the line, there's no time for playing games. But when Diego's past comes back to remind him that everything eventually goes to hell, Garrett will have to convince him that some things are worth fighting for.Roughing the Passer is a steamy, standalone gay romance novel with a HEA ending and no cliffhanger.",
  "genres": [
    "M M Romance",
    "Sports",
    "College",
    "Romance",
    "Contemporary",
    "Enemies To Lovers",
    "Football"
  ],
  "author": "Alison Hendricks",
  "average_rating": "3.78",
  "url": "https://www.goodreads.com/book/show/32766466-roughing-the-passer"
}