{
  "title": "Depraved: The Shocking True Story of America's First Serial Killer",
  "description": "Even as a child in Gilmanton, New Hampshire, Herman Mudgett was considered a lad with a future, a boy who professed filial devotion while secretly fantasizing his parents' deaths. By age eleven he was conducting secret experiments on small animals and strays, becoming skilled at disabling his subjects without killing them. In 1886 he appeared in the Chicago suburb of Englewood, Illinois, and introduced himself as Dr. H. H. Holmes to the wife of the ailing owner of Holton's drugstore. He was hired on the spot, and under his management the store prospered. But when Holmes's attempt to purchase the drugstore from Mrs. Holton went sour, and she sued him, she inexplicably disappeared - never to be seen or heard from again.As Jack the Ripper was terrorizing London, Holmes was building his infamous \"Castle,\" a grandiose residence and veritable fortress bristling with battlements and turrets. He hired and fired a succession of workmen to build the castle, thus eliminating witnesses to its a labyrinth of trapdoors, winding passageways, dark dead-end halls, stairways to nowhere, bedchambers fitted with peepholes and asphyxiating gas pipes, soundproof vaults and torture chambers, greased chutes large enough to send human bodies from the living quarters to a cellar equipped with acid vats, a crematorium, a dissecting table, and cases full of gleaming surgical tools.Alternately donning the mantles of doctor, druggist and inventor, Holmes was also a get-rich-quick schemer and bigamist, with three wives and innumerable lovers - at least one of whom ended up a prize skeletal specimen, sold to a medical college for nearly two hundred dollars. But his increasing audacity and carelessness during his reign of terror led to his discovery and to \"The Trial of the Century,\" in which Holmes finally confessed to twenty-seven murders. While he later recanted - maintaining his innocence until his final breath - he had already achieved immortality as the most monstrous criminal of his day.",
  "genres": [
    "True Crime",
    "Nonfiction",
    "History",
    "Crime",
    "Biography",
    "Horror",
    "American History"
  ],
  "author": "Harold Schechter",
  "average_rating": "3.98",
  "url": "https://www.goodreads.com/book/show/1199937.Depraved"
}