{
  "title": "The Strays",
  "description": "A New York Times Book Review Editor's Choice\"Disturbing and magical....with a grace and eloquence.\" - NPR Books\"Full of lush, mesmerizing detail and keen insight into the easy intimacy between young girls which disappears with adulthood.\" - The New Yorker\"THE STRAYS is a knowing novel, and beautifully done.\" - Meg Wolitzer, New York Times bestselling author of The Interestings For readers of Atonement, a hauntingly powerful story about the fierce friendship between three sisters and their friend as they grow up on the outskirts of their parents' wild and bohemian artistic lives.On her first day at a new school, Lily befriends Eva and her sisters Beatrice and Heloise, daughters of the infamous avant-garde painter Evan Trentham. An only child from an unremarkable, working-class family, Lily has never experienced a household like the Trenthams'--a community of like-minded artists Evan and his wife have created, all living and working together to escape the stifling conservatism of 1930's Australia. And Lily has never met anyone like Eva, whose unabashed confidence and worldly knowledge immediately draw her in.Infatuated by the creative chaos of the Trenthams and the artists who orbit them, Lily aches to fully belong in their world, craving something beyond her own ordinary life. She becomes a fixture in their home, where she and Eva spend their days lounging in the garden, filching cigarettes and wine, and skirting the fringes of the adults' glamorous lives, who create scandalous art during the day and host lavish, debauched parties by night. But as seductive as the artists' utopian vision appears, behind it lies both darkness and dysfunction. And the further the girls are pulled in, the greater the consequences become.With elegance and vibrancy, THE STRAYS evokes the intense bonds of girlhood friendships, the volatile undercurrents of a damaged family, and the yearning felt by an outsider looking in.",
  "genres": [
    "Fiction",
    "Historical Fiction",
    "Australia",
    "Art",
    "Book Club",
    "Historical",
    "Literary Fiction"
  ],
  "author": "Emily Bitto",
  "average_rating": "3.84",
  "url": "https://www.goodreads.com/book/show/32795904-the-strays"
}