{
  "title": "Felipe Femur",
  "description": "Meet Felipe Femur the skeleton. He lives in a closet where he has lots of fun. But there’s an awful feeling growing in his heart. Join Felipe Femur on his quest to defeat boredom and loneliness and find happiness. Read along as he learns something new about himself and meets interesting monster friends, including a hungry, toothless werewolf, a sun loving vampire, and a not so wicked witch, who is in the middle of boiling up some gross green stew in her cauldron. Join Felipe Femur as he problem solves and helps his friends with their issues of eating without teeth, cooking and testing the food while having a burnt tongue, and being too sensitive to the sun. Felipe Femur, Gummy Garou, Runny Rotten, and Sunny Stoker can’t wait to have you as a guest in their closet, fallen moon crescent, grotto, and tombstone homes. Like most skeletons in the closet, Felipe tends to stay hidden away. In other words, he’s usually a lone wolf, as his friend Gummy Garou likes to say. In his closet, Felipe loves to build things like forts and houses of cards. He also loves to solve puzzles, but sometimes he grows bored of these things. On occasion, he yearns for time with his friends. So he invites them over to pull up a coat hanger and hang out, or, as is the case here, he walks around Toonstone to find them. Being the health nut he is, Felipe loves to walk, and in doing so, he meets many new friends and old friends, too—ghosts, ghouls, banshees, and even a lagoon creature. Maybe someday, if you’re out and about, he’ll walk into you! Keep an eye socket out for a sequel about the Day of the Dead (Día de Muertos), which will be coming soon, as well as the Halloween (All Hallows Eve/ All Saint's Eve) book with a full cast of characters that appear in the final scene of this book—costumes and all. Get ready to have your funny bone tickled in this happy little tale about friendship and a not-so-happy, introverted skeleton.",
  "genres": [
    "Picture Books"
  ],
  "author": "Russell J. Dorn",
  "average_rating": "4.06",
  "url": "https://www.goodreads.com/book/show/32797715-felipe-femur"
}