{
  "title": "Daughters of a Nation: A Black Suffragette Historical Romance Anthology",
  "description": "The fight for suffrage was long, hard, and carried out on many fronts. In Daughters of A Nation, Kianna Alexander, Alyssa Cole, Lena Hart, and Piper Huguley bring you four novellas full of spirit, hope, and, most LOVE.  IN THE MORNING SUN by Lena Hart With the election of 1868 underway, Madeline Asher’s mission is educate and enlist the freedmen of Nebraska to vote. After losing the man she loved to war—and a small piece of herself along the way—Madeline leaves her life in Philadelphia behind, determined to reclaim her life’s purpose by making a difference in others. With America’s Southern Rebellion at an end, so are the efforts of Union veteran James Blakemore. Tired of the injustices still plaguing the young country, he sets his sights toward his Canadian roots—until fate guides him back to the love he thought he’d lost. Vowing never to leave her side again, James joins Madeline in her cause to help the freedmen of Dunesville, despite rising threats and violence. But with the enforcement of Nebraska’s anti-miscegenation laws, Madeline is forced to choose between a life with her new husband or the chance to shape a greater nation.  THE WASHERWOMAN'S WAR by Piper Huguley Atlanta, GA – Summer 1881. When Maime Harper arrives to substitute teach for the Atlanta Baptist Female Seminary, she bears witness to the injustice told by some of the older students who are washerwomen. Maime’s upbringing as the daughter of the most famous Black suffragette in America means that she cannot be silent and resolves to help her students find their voice and openly protest their mistreatment. ​When the Black Washerwomen go on strike, summer pastor Gabriel Harmon is brought in to mediate a solution but realizes the feisty leader of the opposition is the young teacher from Milford who previously rejected his attempts to pay court to her. When these two forces collide over explosive events during a hot Atlanta summer, only one will be able to win the battle. However, as they clash, Maime and Gabriel learn that there is another war, the war for the heart, that’s well worth the fight.  A RADIANT SOUL by Kianna Alexander In 1881, Sarah Webster is returning home to Fayetteville, NC to celebrate her mother's milestone birthday. Having spent the last two years working as a pastry chef in a Cheyenne hotel, she's a very different person than she was when she left. Her efforts towards women's suffrage, unknown to her family back home, are near and dear to her heart. Carpenter Owen Markham, charged with building the gazebo that will serve as Mrs. Webster's birthday gift, is intrigued by the middle daughter of the Webster household, whom he's never met before. Her father has decreed that he and Sarah are suited, but when he hears her unconventional stance on women's role in society, he's not so sure a love match can be made.  LET US DREAM by Alyssa Cole Harlem – 1917. After spending half her life pretending to be something she's not, performance is second nature for cabaret owner Bertha Hines. With the election drawing near and women's voting rights on the ballot, Bertha decides to use her persuasive skills to push the men of New York City in the right direction. Chef Amir Chowdhury jumped ship in New York to get a taste of the American Dream, only to discover he’s an unwanted ingredient. When ornery Amir reluctantly takes a job at The Cashmere, he thinks he's hit the bottom of the barrel; however, working at the club reignites his dream of being a force for change. His boss, Bertha, ignites something else in him.",
  "genres": [
    "Romance",
    "Historical Fiction",
    "Historical Romance",
    "Short Stories",
    "Historical",
    "Feminism",
    "Anthologies"
  ],
  "author": "Kianna Alexander",
  "average_rating": "3.87",
  "url": "https://www.goodreads.com/book/show/32809732-daughters-of-a-nation"
}