{
  "title": "I am running out of candies",
  "description": "Do you want to meet a boy who has an unusual head with flying lice orbiting around it? Or meet a girl who planted a lot of noses? Or a princess whose hair is made of bubbles? It is fine if you just want to borrow a time machine, visit a monster house on your way, or follow a wombat to their glamorous castle. But don’t forget to try if you can catch “now”, bring a dog into Zoe’s house, and avoid an old creepy lady…  If, just in case, none of these interests you, answer this multiple-choice question to see if you will love this book: A.) You are capable of laughing and B). Your age is a number between 0 and 150. C.) None of the above. If your answer is C), sorry then, this book may not suit you.  Indulge yourself and any person you love with these 37 hilarious poems and cute hand drawn pictures, which in this current everything-generated-by-computer world look extremely precious. It is definitely a book that will make a great gift and everyone read and read again. Get it today, for the child beside or inside you! And happy holidays to all of you!    \n   THE HOLIDAY SEASON \n  Here again comes the holiday season.  Last year’s lights are not out of fashion.  I only miss the flowers and leaves I buried with lugubrious sensation.  Maybe the holiday season was invented to wash away the frustrations.  So let’s grow the joy with extra motivation.  Let’s share the joy with no reservation.  Next year won’t be this year’s duplication.  There will be new flowers, new leaves, new regenerations;  And a new cycle leading to another new holiday season.  \n   MY FEET WANT TO GO TO LAS VEGAS \n  Why it is so hard to go to sleep? Isn’t it just as easy as counting to three? My eyes say “I feel lonely when I cannot see”. My brain says “Hum a song so everybody knows they are where they should be.” My mouth says “How about this one called ‘Lemon Tree’?” My ears say “Wait till it makes me have to pee.” My nose says “Why there is something in me and I cannot breathe?” My hand is reaching, “Looks like there is some booger I am coming to seize!” My feet, As always, Yell, “I want to go to Las Vegas, even if I have to cross the sea!”",
  "genres": [],
  "author": "Winnie Marth",
  "average_rating": "4.18",
  "url": "https://www.goodreads.com/book/show/32808241-i-am-running-out-of-candies"
}