{
  "title": "رحلة ابن بطوطة: تحفة النظار في غرائب الأمصار وعجائب الأسفار",
  "description": "ابن بطوطة: هو محمد بن عبد الله بن محمد بن إبراهيم اللواتي الطنجي، أبو عبد الله، رحالة مؤرخ. ولد في طنجة، سنة 703هـ الموافق 1304م بالمغرب الأقصى، وخرج منها سنة 725هـ، فطاف بلاد المغرب ومصر والشام والحجاز والعراق وفارس واليمن والبحرين، وتركستان وما وراء النهر وبعض الهند والصين والجاوة، وبلاد التتر، وأواسط إفريقية. واتصل بكثير من الملوك والأمراء، فمدحهم - وكان ينظم الشعر - واستعان بهباتهم على أسفاره. وعاد إلى المغرب الأقصى، فانقطع إلى السلطان أبي عنان (من ملوك بني مرين) فأقام في بلاده. وأملى أخبار رحلته على \"محمد بن جزي\" الكلبي بمدينة فاس سنة 756هـ وسماها \"تحفة النظار في غرائب الأمصار وعجائب الأسفار\". ترجمت إلى اللغات البرتغالية والفرنسية والإنكليزية ونشرت بها، وترجمت فصول منها إلى الألمانية ونشرت أيضاً. وكان يحسن التركية والفارسية. وقد استغرقت رحلته 27 سنة من عام (1325-1352م) ومات في مراكش سنة 779هـ = سنة 1377م.يمتاز ابن بطوطة بأنه راوٍ من الدرجة الأولى, تتوالى أحداث رحلته برشاقة عجيبة, حيث يخترقها القصص المسلي بنهر دافق من قوة الخيال ودقة الواقع. وهو يرسم لنا التقاليد والعادات والديانات, ويصف لنا الألبسة بألوانها وأشكالها وحيويتها ودلالتها. ولا ينسى الأطعمة وأنواعها وطريقة صناعتها, مما يثير لعاب القراء لتذوق تلك المأكولات. وهو يصف المدن في أواخر القرون الوسطى بعين مصور بارع, صادق الريشة والكلمة, أينما يتوجه وحيثما حل بأسلوب سلس دافق بالألوان والأشكال والزخارف. ولا ينسى بأن يرفدنا بمعلومات قيمة عن الديانات وأماكن العبادة فيها, ويبدو لنا اهتمامه الشديد بالتصوف والمتصوفة, فتلك الظاهرة كانت تعيش عصرها الذهبي في القرن الثامن الهجري من الناحية العملية؛ ولا ريب أن ذلك كان يتوافق مع طبيعته الإيمانية. وأخيراً فتحفة النظار في غرائب الأمصار وعجائب الأسفار سفر قيم لا يستغني عنه أديب أو عالم في مجال اختصاصه, في مكتبته لأهميته العلمية والتاريخية والجغرافية والأنتروبولوجية.",
  "genres": [
    "History",
    "Travel",
    "Nonfiction",
    "Classics",
    "Islam",
    "Biography",
    "Africa"
  ],
  "author": "Ibn Battuta",
  "average_rating": "3.90",
  "url": "https://www.goodreads.com/book/show/3280293"
}