{
  "title": "Soul Whispers: Collective Wisdom from Soul Coaches around the World",
  "description": "What is your soul whispering to you?Constant whisperings from your soul are steadily guiding you on your life's journey - but what if you cannot hear them? For the first time, professional Soul Coaches have gathered from all over the globe to help you decipher these loving messages. This feast of collective wisdom will help you discover your true life direction - a life filled with deep meaning and great joy! Discover proven techniques in Decision Making, Clutter Clearing, Collage, Vision Quest and Past Life journeying. Includes little-known Soul Coaching® secrets to assist you and your clients to live a more joyful, authentic life!Learn to confront fear ~ Trust in yourself ~ Develop your intuition ~ Heal yourself and your relationships ~ Boost your business and personal success ~ Live a more adventurous and prosperous life!CONTRIBUTING AUTHORS ~ Sherrie Ataide, Ulrike Behre-Brandes, Roberta Ashkawa Binder, Kimberly Carroll, Carol Daigneault, Sophia Fairchild, Misasha, Rebecca Nelson, Barbara Robitaille, P.W. Servais, Wendy Sheppard, Deborah Janelle Smith, Helen Mumford Sole, Irene Speirs-Caskie, Vicky Sweetlove, Catherine Turner, Cheryl Umberger, and Berte Winding-Sørensen.**Finalist 2009 USA National Best Books & 2010 International Book AwardsREVIEWSI was astounded at the width and depth of these journeys that these intrepid women have had in their Soul Coaching® profession. Their experiences range from a Buddhist retreat in the highlands of Thailand, to a faery quest in the Northwest wilderness, to a corporate training “with soul” in England, to past life journeys in the Scottish moors, to corporate executive miracles in Silicon Valley, to a “bad girl” rocking out in Toronto… and everything in between. The sincerely, compassion and love that these women share in these journeys touches my heart more than words can express….They each bring a remarkable level of balance and joy into the world with their clients and students and it is joy to read their experiences. I’m sure you will enjoy reading this collection of writings by professional Soul Coaches® from all over the globe, as much as I have. Through their many voices, it’s my wish that you too may hear the whispers from your soul!- DENISE LINN, author of Soul Coaching, 28 days to Discover Your Authentic Self, and Founder of Soul Coaching®.ABOUT THE EDITORSophia Fairchild (Editor of this book) is an international author, editor and publisher, currently based in Sydney, Australia. Both a seasoned writer and award-winning editor, Sophia's stories have appeared widely in publication. Look for other books edited by Sophia Fairchild including ~ \"Soul Whispers Secret Alchemy of the Elements in Soul Coaching,\" Soul Wings® Press, 2011, ~ \" Winged Whispers - True Stories from Angel Experts around the World,\" Soul Wings(® Press, 2011 and ~ \"Planet Wisdom from Soul Travelers around the World,\" Soul Wings® Press, 2011.Denise Linn (Foreword) is an international healer, writer and lecturer. She has taught in 19 countries and has written more than 12 books, including the bestseller \"Sacred Space\" and the award-winning books \"Sacred Legacies\" and \"Secrets & Mysteries.\" Denise currently leads professional certification courses in Soul Coaching® in the central California wine region.",
  "genres": [],
  "author": "Sophia Fairchild",
  "average_rating": "4.20",
  "url": "https://www.goodreads.com/book/show/12002278-soul-whispers"
}