{
  "title": "The Management Style of the Supreme Beings",
  "description": "'Highly amusing ... Eloquently snarky prose' - Publishers Weekly'Inventively entertaining ...make you both laugh out loud and stop and think' - SFXWhen the Supreme Being and his son decide that being supreme isn't for them any more, it's inevitable that things get a bit of a shake-up.It soon becomes apparent that our new owners, the Venturi brothers, have a very different perspective on all sorts of things. Take Good and Evil, for example. For them, it's an outdated concept that never worked particularly well in the first place.Unfortunately, the sudden disappearance of right and wrong, while welcomed by some, raises certain concerns amongst those still attached to the previous team's management style.In particular, there's one of the old gods who didn't move out with the others. A reclusive chap, he lives somewhere up north, and only a handful even believe in him.But he's watching. And he really does need to know if you've been naughty or nice.What would happen if good and evil were replaced with a more dynamic system based on sound economic principles? Find out in Tom Holt's wickedly funny new comic novel!Books by Tom Walled Orchard Series Goatsong The Walled Orchard J.W. Wells & Co. Series The Portable Door In Your Dreams Earth, Air, Fire and Custard You Don't Have to Be Evil to Work Here, But It Helps The Better Mousetrap May Contain Traces of Magic Life, Liberty and the Pursuit of Sausages YouSpace Series Doughnut When It's A Jar The Outsorcerer's Apprentice The Good, the Bad and the Smug Novels Expecting Someone Taller Who's Afraid of Beowulf Flying Dutch Ye Gods! Overtime Here Comes the Sun Grailblazers Faust Among Equals Odds and Gods Djinn Rummy My Hero Paint your Dragon Open Sesame Wish you Were Here Alexander at World's End Only Human Snow White and the Seven Samurai Olympiad Valhalla Nothing But Blue Skies Falling SidewaysLittle PeopleSong for NeroMeadowlandBarkingBlonde BombshellThe Management Style of the Supreme BeingsAn Orc on the Wild Side",
  "genres": [
    "Fantasy",
    "Humor",
    "Fiction",
    "Science Fiction",
    "Comedy",
    "Audiobook",
    "Book Club"
  ],
  "author": "Tom Holt",
  "average_rating": "3.89",
  "url": "https://www.goodreads.com/book/show/32804158-the-management-style-of-the-supreme-beings"
}