{
  "title": "Marry Me Again",
  "description": "HE CAN BUY ANYTHING EXCEPT A SECOND CHANCE WITH ME...KARAOnce, when I was young and stupid, I had that boy. The charmer, the Adonis, the one who torched every woman's panties in our small town. He was my brother's best friend, practically part of the family. When he proposed, he promised me forever.Then the bastard disappeared without a word.It's taken five years to get over Ryan. I drowned myself crying a thousand times over. I moved on.I'm finally remembering what it's like to smile when guess who shows up. Everything about him is different. For one, he's become a freakin' billionaire. He walks like he's Mr. Tall, Dark, and Alpha incarnate. I know there's no justice in the world because his body matches his huge ego.Worse, he wants me to play Cinderella again. I can't. I won't.I don't believe in second chances. I'll never forget what he did.And if he's stupid enough to try kissing me with those unforgettable lips, he's going to feel my teeth.RYANI did a terrible thing. No, I'm not talking about the filthy secret that wrecked everything.Leaving Kara killed me. I didn't have a choice. No amount of money, success, or bedding any woman I want whenever I flash my patented smirk makes up for losing her.She was the one. Hell, she still is.Time to remind her why. Whatever it takes to put my ring on her hand for good.I'm ready for the curses, the screams, the burn of her palm against my cheek. I'll taste her lips again, even if she bites.Just one catch – she can't find out what happened the night I left. There are no second chances if my past ruins us.This is a standalone romance novel brimming with temptation, tears, and alpha male explosions. High heat, no chill, and Happy Endings galore!",
  "genres": [
    "Romance",
    "Second Chance",
    "Contemporary",
    "Contemporary Romance",
    "Audiobook",
    "Second Chance Romance",
    "Friends To Lovers"
  ],
  "author": "Nicole Snow",
  "average_rating": "3.84",
  "url": "https://www.goodreads.com/book/show/32813127-marry-me-again"
}