{
  "title": "Original Wisdom: Stories of an Ancient Way of Knowing",
  "description": "• Explores the lifestyle of indigenous peoples of the world who exist in complete harmony with the natural world and with each other.• Reveals a model of a society built on trust, patience, and joy rather than anxiety, hurry, and acquisition.• Shows how we can reconnect with the ancient intuitive awareness of the world's original people.Deep in the mountainous jungle of Malaysia the aboriginal Sng'oi exist on the edge of extinction, though their way of living may ultimately be the kind of existence that will allow us all to survive. The Sng'oi--pre-industrial, pre-agricultural, semi-nomadic--live without cars or cell phones, without clocks or schedules in a lush green place where worry and hurry, competition and suspicion are not known. Yet these indigenous people--as do many other aboriginal groups--possess an acute and uncanny sense of the energies, emotions, and intentions of their place and the living beings who populate it, and trustingly follow this intuition, using it to make decisions about their actions each day.Psychologist Robert Wolff lived with the Sng'oi, learned their language, shared their food, slept in their huts, and came to love and admire these people who respect silence, trust time to reveal and heal, and live entirely in the present with a sense of joy. Even more, he came to recognize the depth of our alienation from these basic qualities of life. Much more than a document of a disappearing people, Original Stories of an Ancient Way of Knowing holds a mirror to our own existence, allowing us to see how far we have wandered from the ways of the intuitive and trusting Sng'oi, and challenges us, in our fragmented world, to rediscover this humanity within ourselves.",
  "genres": [
    "Nonfiction",
    "Philosophy",
    "Anthropology",
    "Spirituality",
    "History",
    "Nature",
    "Indigenous"
  ],
  "author": "Robert Wolff",
  "average_rating": "4.37",
  "url": "https://www.goodreads.com/book/show/328149.Original_Wisdom"
}