{
  "title": "Small Puddles: The Triumphant Story of Yale's Worst Oarsman. Ever.",
  "description": "Michael “Zig” Danziger projects a certain devil-may-care persona. But don’t let the larger-than-life, hail-fellow-well-met routine fool you - there is far more to his story than being born on third base. Zig’s intense experience as a Yale oarsman is a case study on the journey itself being the reward. He was never going to make the first varsity boat, or the second. Not even the third boat. But he worked his ass off to earn a seat in the fourth boat - and became a Yale Crew legend. Small Puddles tells the story of those years at Yale and the people who shaped Zig’s one-of-a-kind view of the world. Small Puddles is a heart-warming and hilarious memoir, but don’t expect to read about what a saint Zig is. He’s no saint. And don’t expect any syrupy soft-focus vignettes of New England collegiate life. Zig’s raucous yarns, spun one after another, are warts-and-all, high-definition windows into the glory days. No punches pulled. Small Puddles has plenty for everyone, but anyone who has had the good fortune to pull an oar will feel Zig’s pain. Up and down stadium stairs until you can’t walk another step? Barfed after crushing an erg piece? Pulled a power ten? Given a shirt? Gotten a shirt? Been up at 5am for practice after a big night out? Felt the adrenaline surge at “Êtes-vous prêt? Partez!”? Stood on the bank to cheer friends at The Head of the Charles, The Dad Vails, Eastern Sprints, Henley? Don’t miss this book. Enjoyed other rowing books? If you think you might enjoy a version of Halberstam’s The Amateurs co-authored with Tucker Max, or you’re hoping Quentin Tarantino might direct the film adaptation of The Boys In the Boat , don’t miss this one. Michael Danziger was born in New York City, and on third base, a factor of which he was blissfully unaware, even though evidence of such a fortunate circumstance was everywhere should he have looked to see it. Danziger spent twelve years at the Collegiate school in New York City where he missed not a day from second grade to graduation ten years later. He worshiped, revered, and adored his teachers and vowed as a very young boy to become one himself one day. After graduating from Collegiate, Danziger found himself at Yale, a 6'4\", 150 pound freshman. He was spotted by the lightweight crew coach in the freshman quad and recruited to join the team on the spot. The next four years were a demonstration of hapless persistence in crew and assiduous avoidance of making any contribution to Yale's academic legacy. After stints at Oxford and Harvard and the dating game, Danziger became a teacher at last and found his calling. In 1990, he founded the Steppingstone Foundation, which prepares students from underprivileged and underrepresented backgrounds to get into schools which lead to college and eventually graduation. To date, 2,700 Steppingstone Scholars have graduated from college thanks to their hard work in the Steppingstone Academy. All the while, Danziger had been working on a book about his rowing experience at Yale. The original draft of the book was on the computer that he sold because it was too big to fit into the trunk of his car. However, Danziger never printed or saved that draft. So he started over. A shade over 30 years after selling that computer, the book, Small The Triumphant Story of Yale's Worst Oarsman. Ever. was completed. It’s about rowing, rights of passage, persistence, and trying to find your way. Danziger has stumbled through life, learning lessons, forgetting them, and then learning them again. And then teaching them. He’s led an unconventional life of consequence.",
  "genres": [
    "Nonfiction"
  ],
  "author": "Michael P. Danziger",
  "average_rating": "4.06",
  "url": "https://www.goodreads.com/book/show/32814103-small-puddles"
}