{
  "title": "War Before Civilization: The Myth of the Peaceful Savage",
  "description": "The myth of the peace-loving \"noble savage\" is persistent and pernicious. Indeed, for the last fifty years, most popular and scholarly works have agreed that prehistoric warfare was rare, harmless, unimportant, and, like smallpox, a disease of civilized societies alone. Prehistoric warfare, according to this view, was little more than a ritualized game, where casualties were limited and the effects of aggression relatively mild. Lawrence Keeley's groundbreaking War Before Civilization offers a devastating rebuttal to such comfortable myths and debunks the notion that warfare was introduced to primitive societies through contact with civilization (an idea he denounces as \"the pacification of the past\").Building on much fascinating archeological and historical research and offering an astute comparison of warfare in civilized and prehistoric societies, from modern European states to the Plains Indians of North America, War Before Civilization convincingly demonstrates that prehistoric warfare was in fact more deadly, more frequent, and more ruthless than modern war. To support this point, Keeley provides a wide-ranging look at warfare and brutality in the prehistoric world. He reveals, for instance, that prehistorical tactics favoring raids and ambushes, as opposed to formal battles, often yielded a high death-rate; that adult males falling into the hands of their enemies were almost universally killed; and that surprise raids seldom spared even women and children. Keeley cites evidence of ancient massacres in many areas of the world, including the discovery in South Dakota of a prehistoric mass grave containing the remains of over 500 scalped and mutilated men, women, and children(a slaughter that took place a century and a half before the arrival of Columbus). In addition, Keeley surveys the prevalence of looting, destruction, and trophy-taking in all kinds of warfare and again finds little moral distinction between ancient warriors and civilized armies. Finally, and perhaps most controversially, he examines the evidence of cannibalism among some preliterate peoples.Keeley is a seasoned writer and his book is packed with vivid, eye-opening details (for instance, that the homicide rate of prehistoric Illinois villagers may have exceeded that of the modern United States by some 70 times). But he also goes beyond grisly facts to address the larger moral and philosophical issues raised by his work. What are the causes of war? Are human beings inherently violent? How can we ensure peace in our own time? Challenging some of our most dearly held beliefs, Keeley's conclusions are bound to stir controversy.",
  "genres": [
    "History",
    "Anthropology",
    "Nonfiction",
    "War",
    "Science",
    "Politics",
    "Archaeology"
  ],
  "author": "Lawrence H. Keeley",
  "average_rating": "4.10",
  "url": "https://www.goodreads.com/book/show/328446.War_Before_Civilization"
}