{
  "title": "Putting Her In Her Place: The Girlfriend Training Black Book of Secrets",
  "description": "Girls are hardwired to obey and submit. The problem is men and women have reversed gender roles. This is causing men to become feminized and women to become masculinized. I can prove this. You don’t see many girls wearing dresses any more, do you (?), because they are all out wearing what men wear; pants, teeshirts, etc. I mean come on, SERIOUSLY! If you want to have the best possible relationship with a girl, where she obeys and submits like a good little girl, then you have to train her back to childhood obedience. You must instill the fear of God in her, letting her know that you are in control of her, and that she must obey you. The more you train her, the more she will start to fall in love with you. The more she will start to accept you as her dominant master. The more she will submit to you and obey you in everything you tell her to do. The less she will try and make decisions on her own. The more she will accept your punishments when she has wronged you. I am not a mysoginistic man. I don’t want you reading this thinking I am. I am a man who has a wonderfully loving relationship with my girl, who learned this secret and now want to share it with you. I watch too man of my male friends go through the pain and torment of relationships with girls. They don’t know how to train a girlfriend, so they keep getting hurt, fucked, and you whatever other adjective you want to fill in the blank with. It doesn’t have to be this way. It should not be this way. This book will help you fix it. I don’t let my girl do anything adult. She has to play and do childlike activities. I am the adult, she is the little girl. I make her color, fingerpaint, journal in a diary (that I get to read), make her stand in a corner when she acts up, make her take a nap when she’s tired, and withhold priveliges from her when she doesn’t want to comply with my instructions. She loves me, let me assure you. She will never leave me, because she knows I am her answer and have her best interest at heart. She yearns to be taken care of and protected by me. She loves submitting and being dominated. The sex is amazing, let me share. You can have the same. Read this book. Do what it instructs you to do. Start training your girl today. You will win in the end, I promise. Start reading and taking notes! This is more than a book, it’s a course! Grab Your Copy Now",
  "genres": [],
  "author": "Ryan Hale",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/32845428-putting-her-in-her-place"
}