{
  "title": "Sweetbriar Cottage",
  "description": "When Noah and Josephine Mitchell discover their divorce was never actually finalized, their lives are turned upside down. Following his divorce, Noah gave up his dream job, settling at a remote horse ranch in the Blue Ridge Mountains of northern Georgia, putting much-needed distance between himself and the former love of his life. But then Noah gets a letter from the IRS claiming he and Josephine are still married. When he confronts Josephine for the first time in months, they discover that she missed the final step in filing the paperwork and they are, in fact, still married. Josephine is no happier about the news than Noah. Maybe the failed marriage—and okay, the botched divorce—was her fault, but her heart was shattered right alongside his, more than he would ever believe. The sooner they put this marriage behind them, the better for both of their sakes.But when Josephine delivers the final paperwork to his ranch, the two become stranded in his cottage during the worst spring snowstorm in a decade. Being trapped with Josephine is a test of Noah’s endurance. He wrestles with resentment and an unmistakable pull to his wife—still beautiful, still brave, and still more intriguing than any woman he’s ever known.As they find themselves confronted with each other and their shared past, old wounds surface and tempers flare. But when they are forced out into the storm, they must rely on each other in a way they never have before. Josephine finally opens up about her tragic past, and Noah realizes she’s never been loved unconditionally by anyone—including him. Will Noah accept the challenge to pursue Josephine’s heart? And can she finally find the courage to trust Noah?",
  "genres": [
    "Romance",
    "Christian Fiction",
    "Contemporary",
    "Fiction",
    "Christian",
    "Contemporary Romance",
    "Inspirational"
  ],
  "author": "Denise Hunter",
  "average_rating": "4.12",
  "url": "https://www.goodreads.com/book/show/32830461-sweetbriar-cottage"
}