{
  "title": "Call to Arms",
  "description": "Call to Arms: Blood on the Stars II  War. The word spreads throughout the Confederation…the long-expected Union invasion has come. The enemy is strong, their fleets larger and more powerful than intelligence reports had predicted. They have broken through the forward defenses, sent the Confederation’s proud fleets into an ignominious retreat.  Captain Tyler Barron and the crew of the battleship Dauntless are lightyears from the front lines, at Archellia, waiting for their damaged battleship to be repaired. Their ship is only just operational, but there is no time. The Confederation forces need every reinforcement they can get, and Barron and his survivors board their vessel…and rush to the battle lines.  When they get there, they encounter nothing but fleeing ships and shattered fleets. The Confederation is losing the war, falling back steadily, yielding system after system to the invaders. The Union fleets continue inexorably forward, seemingly immune to the supply constraints that have bogged down past invasions. Dauntless finds herself trapped, cut off from the rest of the fleet along with another Confed battleship, and a trio of small escort vessels…deep behind the rapidly moving front lines.  Barron must make a choice. Pull back, try to find a way to get around the enemy and rejoin the fleet. Or press on, strike deep behind the enemy advance, an almost suicidal thrust toward the Union’s main logistical supply base…and the one way Tyler Barron can think of to buy the fleet the time it needs to regroup. To survive.  Blood on the Stars Reading Order  Book 1: Duel in the Dark Book 2: Call to Arms Book 3: Ruins of Empire (coming Spring 2017)",
  "genres": [
    "Science Fiction",
    "Space Opera",
    "Military Fiction",
    "Audiobook",
    "Fiction",
    "Science Fiction Fantasy",
    "War"
  ],
  "author": "Jay Allan",
  "average_rating": "4.31",
  "url": "https://www.goodreads.com/book/show/32834842-call-to-arms"
}