{
  "title": "Auschwitz: True Tales From a Grotesque Land",
  "description": "\"From the moment I got to Auschwitz I was completely detached. I disconnected my heart and intellect in an act of self-defense, despair, and hopelessness.\" With these words Sara Nomberg-Przytyk begins this painful and compelling account of her experiences while imprisoned for two years in the infamous death camp. Writing twenty years after her liberation, she recreates the events of a dark past which, in her own words, would have driven her mad had she tried to relive it sooner. But while she records unimaginable atrocities, she also richly describes the human compassion that stubbornly survived despite the backdrop of camp depersonalization and imminent extermination.Commemorative in spirit and artistic in form, Auschwitz convincingly portrays the paradoxes of human nature in extreme circumstances. With consummate understatement Nomberg-Przytyk describes the behavior of concentration camp inmates as she relentlessly and pitilessly examines her own motives and feelings. In this world unmitigated cruelty coexisted with nobility, rapacity with self-sacrifice, indifference with selfless compassion. This book offers a chilling view of the human drama that existed in Auschwitz.From her portraits of camp personalities, an extraordinary and horrifying profile emerges of Dr. Josef Mengele, whose medical experiments resulted in the slaughter of nearly half a million Jews. Nomberg-Przytyk's job as an attendant in Mengle's hospital allowed her to observe this Angel of Death firsthand and to provide us with the most complete description to date of his monstrous activities.The original Polish manuscript was discovered by Eli Pfefferkorn in 1980 in the Yad Vashem Archive in Jerusalem. Not knowing the fate of the journal's author, Pfefferkorn spent two years searching and finally located Nomberg-Przytyk in Canada. Subsequent interviews revealed the history of the manuscript, the author's background, and brought the journal into perspective.",
  "genres": [
    "Holocaust",
    "History",
    "Nonfiction",
    "World War II",
    "Historical",
    "War",
    "Biography"
  ],
  "author": "Sara Nomberg-Przytyk",
  "average_rating": "4.19",
  "url": "https://www.goodreads.com/book/show/328586.Auschwitz"
}