{
  "title": "Betrayal In Blue: The Shocking Memoir Of The Scandal That Rocked The NYPD",
  "description": "They Had No Fear Of The Cops Because They Were The CopsNYPD officers Mike Dowd and Kenny Eurell knew there were two ways to get rich quick in Brooklyn's Lower East Side. You either became drug dealers, or you robbed drug dealers. They decided to do both.“I promised my wife that we would make a lot of money, and that she had nothing to worry about. I LIED!”Dowd and Eurell ran the most powerful gang in New York’s dangerous 75th Precinct, the crack cocaine capitol of 1980s America. These “ Cocaine Cops” formed a lucrative alliance with Adam Diaz, the kingpin of an ever-expanding Dominican drug cartel. Soon Mike and Ken were buying fancy cars no cop could afford, and treating their wives to levels of luxury not associated with a patrol officer's salary. They Were Daring, Dangerous and Untouchable Until ...Then “ the biggest police scandal in New York history” exploded into the headlines with the arrest of Mike, Ken, and their fellow crooked cops. Released on bail, Mike offered Ken a long shot at escape to Central America—a bizarre plan involving robbery, kidnapping, and murder—forcing Ken to choose between two forms of betrayal.“When you lie, you steal the truth. Once you have stolen the truth, you can justify stealing anything from anybody.”Adapted from Ken Eurell's shocking personal memoir, plus hundreds of hours of exclusive interviews with the major players, including former international drug lord, Adam Diaz, and Dori Eurell, revealing the truth behind what you won't see in the hit documentary THE SEVEN FIVE. Edgar Award winner Burl Barer once again teams with award-winning journalist Frank C. Girardot, Jr, and Eurell to bring you an astonishing story of greed and betrayal.",
  "genres": [
    "True Crime",
    "Nonfiction",
    "Audiobook",
    "Police",
    "Crime",
    "History"
  ],
  "author": "Burl Barer",
  "average_rating": "3.99",
  "url": "https://www.goodreads.com/book/show/32854939-betrayal-in-blue"
}