{
  "title": "The Birth of the Modern: World Society 1815-1830",
  "description": "This extraordinary chronicle of fifteen years that laid the foundations of the modern world is the history of people, ideas, politics, manners and morals, economics, art, science and technology, diplomacy, business and commerce, literature and revolution. From Wellington at Waterloo and Jackson at New Orleans to the surge of democratic power and the new forces of reform that emerged by 1830, this is a portrait of a period of great and rapid changes that saw the United States transform itself from an ex—colony into a formidable nation; Britain become the first industrial world power; Russia develop the fatal flaws that would engulf her in the 20th century and China and Japan set the stage for future development and catastrophe. Latin America became independent, and the dawn of modernity appeared in Turkey and Egypt, Southeast Asia, the Middle East and the Balkans.It was an age of new ideas, inventions and great technological advances of every kind. Throughout the world the last wildernesses from Canada to the Himalayas to the Andes were being penetrated and settled. The new and expanding cities were being beautified—Boston was lit by gas in 1822; New York and London were being paved. There were steamboats on the Mississippi as early as 1811; the first railroad was built in 1825 in England, and in 1826 the Erie Canal was completed. Charles Babbage invented the first computer, and Turner, Constable, Delacroix and Géricault were fashioning the visual grammar of modern art. Jane Austen finished Emma during Napoleon’s Hundred Days; Goethe presided over the German literary establishment, - and Hegel was creating the theory of the modern state. Beethoven was writing his Ninth Symphony and Mendelssohn his Midsummer Night’s Dream. Byron, Shelley, Keats and Victor Hugo were leading figures in the Romantic Movement. Despite the immense social strains of the Industrial Revolution and the expansion of society, constitutional government was able to survive, initiating and sustaining reforms affecting almost every part of society. And, after Waterloo, an international order was established that, for the most part, endured for a century.ln Paul Johnson's words, “The age abounded in great personalities; warriors, statesmen and tyrants; outstanding inventors and technologists; and writers, artists and musicians of the highest genius, women as well as men. I have brought them to the fore but I have also sought to paint in background, showing how ordinary men and women-—and children—lived, suffered and died, ate and drank, worked, played and traveled.\" This was the era of Wellington, Castlereagh, Metternich, Talleyrand and Bolivar; of Wordsworth, Coleridge, Washington and Chateaubriand; of Humphry Davy, Michael Faraday and Robert Fulton; of Madame de Staél, Mary Shelley, Lady Holland and Maria Edgeworth; of John Quincy Adams, Henry Clay, James Monroe and Andrew Jackson; of Goya, Richard Bonington and Thomas Cole.Provocative, challenging and readable, Paul Johnson’s book covers the whole spectrum of history and human affairs, bringing together the various strands into a coherent narrative and telling it through the lives and actions of its outstanding, curious and ordinary people.",
  "genres": [
    "History",
    "Nonfiction",
    "World History",
    "Politics",
    "19th Century",
    "European History",
    "Philosophy"
  ],
  "author": "Paul  Johnson",
  "average_rating": "4.16",
  "url": "https://www.goodreads.com/book/show/1020951.The_Birth_of_the_Modern"
}