{
  "title": "Seeds of Nonviolent Communication - Raising a communicative generation",
  "description": "Is it important to you to understand what is happening to your children?Why they are angry? Rebelling? Ignoring?What need is hiding behind the behavior we can see?The book \"Seeds of Nonviolent Communication - Raising a communicative generation\" is a life-changing book with simple and easily-implementable tools, which create and improve the humane quality of all of life's environments.The book affords educators and parents the opportunity to learn how to create a non-violent relationship and dialogue through the model of \"Non-Violent Communication\" formulated by Dr. Marshall Rosenberg. It shows that it is possible to reduce violence, create closeness and to raise a generation who will know how to communicate. The strength of the approach is its ability to maintain a sense of togetherness and mutual empathy, without giving up on what is truly important to both sides.Why is it worthwhile and important to learn to manage communication and family relationships in a nonviolent manner?The basis of nonviolent communication is the understanding that all human behavior stems from an inner need that motivates us to act.The book teaches:• What the needs are behind every behavior• Provides tools of how to talk differently, how to empathize, how to be a model for children and have a real presence• How to integrate practice and theory• How to implement the model into everyday life• How to enrich emotional vocabulary, which words to use to establish a connection and closeness to myself and others• Ideas for activities with children• How to implement the nonviolent language at home and in the educational framework through use of the jackal and giraffe puppets which Dr. Marshall used as a metaphor for nonviolent/violent communication.The book is written with great faith and a desire to share and pass on my knowledge and experience as a mother, early childhood educator and moderator through natural giving.\"My goal is not to change worlds, however in my life I have successfully influenced and changed several worlds.\"",
  "genres": [],
  "author": "Liat Azar",
  "average_rating": "4.50",
  "url": "https://www.goodreads.com/book/show/32859976-seeds-of-nonviolent-communication---raising-a-communicative-generation"
}