{
  "title": "Under The Big Sky: What Heaven Hath Joined Together . . . Let No Man Cut Asunder.",
  "description": "Somewhere on the edge of a long-forgotten land called the Great Open, two fiercely strong-willed, all-American high school boys come together—forging a relationship hotter than the blazing Eastern Montana summer sun. Cash McCollum, a short-tempered, fifth generation rodeo cowboy, finds his simple, black-n’-white world bulldozed over by rich, handsome Travis Hunter, star jock of the football team. And what begins as a secret liaison between them, eventually stirs up into an impish, and sometimes humorous, whirlwind of gossip—awakening the small, sleepy town of Miles City. “…you ‘n Travis seem to be slidin’ into a real comfy corner.” A corner that Cash’s older brother, Clayton is not okay with. As time passes, and the friendship deepens, it’s their extreme popularity that continues to attract a whole lot of unwanted attention—thrusting them from the closet into the middle of local limelight. From the beginning, the stakes are high with each risking a lot. Cash cannot lose sight of the rodeo crown title, All-Around Cowboy, at his fingertips; and Travis is dead-set on taking the football team to state championship—gaining the trophy of Most Valuable Player for himself as well. Compounding this star-studded drama, these two boys also discover their worlds are COMPLETELY different—with nothing to bind them together but an unbridled attraction and a fierce determination to make the relationship work. “We’re comin’ from two different cultures—can’t you see that? Cash forces Travis to smell the roses. “You obviously come from money… I don’t. I never will.” It’s Travis’ persistence, however, that keeps them glued together. “…I can’t live without you, Cash, because it’s you… who makes me a better guy …” Under the Big Sky unveils a world that many overlook, or refuse to acknowledge. It is where the human heart beats as strong as ancient echoes of Indian drums along a mighty and untamed Yellowstone River. Within its pages, you’ll be taken to places never seen before",
  "genres": [
    "M M Romance"
  ],
  "author": "S. Bryan Gonzales",
  "average_rating": "3.54",
  "url": "https://www.goodreads.com/book/show/328556.Under_The_Big_Sky"
}