{
  "title": "Better Single Than Sorry: A No-Regrets Guide to Loving Yourself and Never Settling",
  "description": "Let's be honest. No woman really wants to be alone for the rest of her life. But does being alone mean you're doomed to be miserable forever? Definitely not! And does being single have to equal lonely? No way! You can have the best time of your life when you're single, but you wouldn't know that from our relationship obsessed society, where celebrity magazines devote the majority of their content to who's dating whom and the wedding industry is a $100-billion business. Yet more than a third of marriages end in divorce, and countless other couples languish in unions that shouldn't have happened in the first place.Don't become a statistic—love yourself and never settle!Jen Schefft knows that better than almost anyone. In 2003, she got engaged in front of millions of people on television's The Bachelor, only to see it end nine months later when the relationship just wasn't right anymore. A year later, she turned down an engagement on The Bachelorette, and the backlash was relentless. She was labeled a \"spinster\" by a celebrity magazine, and a noted national talk-show host remarked that she would be \"a bachelorette for the rest of her life.\"This is a terrible message to send to the millions of sensational single women out there, and in Better Single Than Sorry Schefft makes it her mission to let women know that it's better to be single than to be in a relationship that doesn't make you happy. With testimonials from women of all ages—single, married, in committed relationships, with children (even single moms) and without—this book tells you how to let go of your fear of being alone and how to love yourself and never settle for a relationship that is anything less than you deserve.Written in a conversational style, as if talking with your best friend, Schefft helps you navigate the pressures of a culture that places an unhealthy importance on being in a relationship and shows you how to find happiness in work, home, and the simple pleasures of everyday life. Above all, she shows you how it's far, far better to be single than sorry. Being single is a time to have fun, learn new things, grow, and blossom—not a time to feel desperate or depressed, so cherish it!",
  "genres": [
    "Self Help",
    "Nonfiction",
    "Relationships"
  ],
  "author": "Jen Schefft",
  "average_rating": "3.59",
  "url": "https://www.goodreads.com/book/show/120047.Better_Single_Than_Sorry"
}