{
  "title": "Now for the Disappointing Part: A Pseudo-Adult?s Decade of Short-Term Jobs, Long-Term Relationships, and Holding Out for Something Better",
  "description": "True stories from the world of temporary employment for anyone terrified of being stuck in a job they hate.When Steven Barker was twelve, his father, in pursuit of the American Dream, moved the family from Canada to Connecticut, having worked his way up from an IBM mailroom to landing a vice president position in a top computer factory. Steven, in contrast, has followed the philosophy of “quit everything until you find something you don’t want to quit,” and has spent over fifteen years as a contract employee, a demographic that has come to make up 2 percent of the nation’s work force. Now for the Disappointing Part is the first collection of essays written for the temp workers of the millennial generation—those who, by choice or circumstance, delay or abandon plans for long-term careers for the variety (and anxiety) of contract work.Funny, insightful, and sometimes shocking, Barker details his life moving from job to job as his contracts expire. He faces abuse as an account manager at Amazon when callers assume he’s in India. He learns about office politics at a nonprofit. And he attends an open call at UPS for holiday help. The chapters explore issues ranging from financial instability to how gender and race play into the workforce to the (often poor) treatment temporary employees receive compared to full-time employees performing the same job. Throughout Barker also reveals his parallel relationships with women, which, like the jobs he works, appear to have predetermined expiration dates.Now for the Disappointing Part is more than the stories of a man who thinks life is too short to spend forty hours a week doing something you hate. It will resonate with a generation of people who are struggling to find work, stability, and happiness, and are afraid of losing all of them.",
  "genres": [
    "Nonfiction",
    "Memoir",
    "Essays",
    "Humor",
    "Relationships"
  ],
  "author": "Steven  Barker",
  "average_rating": "4.01",
  "url": "https://www.goodreads.com/book/show/32851341-now-for-the-disappointing-part"
}