{
  "title": "Altar of Resistance",
  "description": "In this second thriller in the bestselling WWII series, the Eternal City of Rome during the Nazi Occupation of 1943-1944 is a besieged city. In this perilous wartime setting, Rome is a tinderbox of four conflicting parties: the Allies—represented by Major John Bridger of the American-Canadian First Special Service Force—trying to capture Rome as the first Axis prize of war but encountering stiff opposition; the Germans—represented by Waffen-SS Colonel Wilhelm Hollmann, the German father of John Bridger—trying to throw the Allies back into the sea while holding Rome hostage and using it as a staging ground and supply line to the front; Pope Pius XII, deeply involved in the plot to remove Hitler from power while struggling to maintain Vatican impartiality, mediate between the West and Nazi Germany, save Rome from destruction, and protect the city’s Jews and others from extermination; and finally, the Partisans represented by Teresa Kruger, daughter of Hollmann and half-sister of John Bridger, who during the German Occupation is transformed from a passive member of Rome’s aristocracy to an active Resistance fighter. Based on actual historical events and newly released OSS/CIA and KGB documents, Altar of Resistance recounts in detail the long, hard road that led to the Allied liberation of Rome. War is about simple survival, and Bridger and Teresa must battle their father and the Nazi occupiers in the name of freedom; while the Allies’ secret agent—the Supreme Pontiff and leader of the Vatican’s Church of Spies, Roman-born Pope Pius XII—orchestrates events behind the scenes in an effort to thwart German oppression, ensure the overthrow of the Führer, and usher in a viable post-Hitler government.",
  "genres": [
    "Historical",
    "Historical Fiction",
    "Novels",
    "Book Club",
    "Fiction",
    "Drama",
    "War"
  ],
  "author": "Samuel Marquis",
  "average_rating": "4.20",
  "url": "https://www.goodreads.com/book/show/32853119-altar-of-resistance"
}