{
  "title": "Natural Disasters, A Love Story",
  "description": "An enticing tale of the unpredictable power of love . . .This irresistible debut novel dances off with your heart while lighting the way to love. At once insightful and humorous, it's the story of Maggie Chisholm, a therapist who's good at overhauling everyone's psyche but her own . . . until she loses her balance after a hundred-year flood ravages the picturesque town of Sedona, Arizona. Damage to the beautiful home she shares with her husband leads to an encounter with Finn, a local contractor, outdoorsman and self-avowed bachelor. Captivated by Maggie despite his highly guarded heart, Finn can't resist the magnetic connection any more than Maggie can.Regardless of her longings for a soul mate, Maggie's had enough turbulence in her life; she doesn't need to weather any more of it. Neither does Finn, whose resistance to involvement isn't without cause. Even so, their unfolding relationship evolves into an all-consuming love, as passionate as it is precarious. A threat to their safety, Maggie's alcoholic husband, Martin, mustn't know of her plans to escape her hellish marriage, or another disaster could ensue. But Martin's not the only problem.Riding the rapids of their desire—as told from Maggie and Finn's separate points of view—their story surges toward a series of unexpected events. While Finn's life veers out of control, Maggie's abusive marriage reaches a crescendo, and dreams are blurred by reality, their love bedeviled by fear. Now Maggie must overhaul her own psyche before regaining her balance . . . with the love of her life.More than a romance for discerning readers, Natural Disasters is an undaunted journey toward self-discovery. Full of mirth and messages, it invites you to explore a compelling path to the fulfillment of your heart.",
  "genres": [],
  "author": "Geraldine Cantrell",
  "average_rating": "4.44",
  "url": "https://www.goodreads.com/book/show/32873399-natural-disasters-a-love-story"
}