{
  "title": "Christmas in Fountain City",
  "description": "Each Christmas retired chemistry teacher Edwina Bopp makes her newest invention of miracle fudge as a fundraiser for missions in her small Southern town Fountain City. Between Thanksgiving and Christmas, the good lady cooks through the night and then gives the candy away to the fudge-hungry group of people who know this year's newest recipe is coming and line up in front of her store before she ever opens the door of her Main Street candy shop. People receive their portion of this year's fudge and place donations for missions in her jar on the counter, expecting miracles. Some miracles have occurred, so they said. Lonely people fell in love. Couples who wanted children have fat babies. Heartsick people wake up to hope. Afterwards, they say the fudge did it. But it isn’t the fudge. It’s the secret power that enlivens this small town. The secret ingredient for life in Fountain City is their love for God and for one another. Fountain City folks know this, but they also want that miracle fudge. Friends and neighbors wait for it year-round, hoping Mrs. Bopp won’t veer off into some weird recipe that doesn’t include chocolate. She did that once, and the residents of Fountain City are still talking about it! Available only at Christmas, the demand for her miracle fudge is high—an intensity of desire that could be lessened if she would just share her recipes. But she won’t do that. It’s not selfishness. Mrs. Bopp’s fudge recipes keep changing. She’s never finished with perfecting the perfect batch of fudge, and so she keeps working on measurements and ingredients. And in her slowness and inscrutable gifts and responses to their demands, she models what the world calls faith and patience, too. All of that comes to an end when Mrs. Bopp is attacked and her day’s fudge supply stolen. How the neighbors of Fountain City responds to this calamity is the new experience of miracles in the daily life of Fountain City at Christmas. An uplifting story, Christmas in Fountain City will remind you that the existence of love itself is the great miracle, and you can have it every day of your life if you trust the One who invented the miracle of grace. And you can also have fudge.... Check out Christmas in Fountain City now. About the Daphne Simpkins writes the adventures of Southern church lady Mildred Budge. She’s completing the 7th book in the series. Other works include books on caregiving, cooking, and church life in the South. You can connect with her on Facebook, Twitter, LInkedin.com or follow her on Amazon's author page.",
  "genres": [
    "Christmas",
    "Holiday",
    "Fiction"
  ],
  "author": "Daphne Simpkins",
  "average_rating": "4.42",
  "url": "https://www.goodreads.com/book/show/32874273-christmas-in-fountain-city"
}