{
  "title": "Immortal",
  "description": "Rachel remembered nothing of the past. Her sister Merrilea remembers too much. IMMORTAL continues the saga of the Trelawneys of Williamsburg, which began in 1746 with the love story of Rachel and slave-trader Grey Trelawney. IMMORTAL is the story of Merrilea Miller, the younger sister of Rachel, who has been raised in hiding by her grandmother, Hannah Hastings (\"Nan\"), an English woman with a stormy, sorrowful past and many secrets. (Please note this is the second in a series and is more enjoyable when read following TENDER, Book 1.)When Merrilea was still a toddler, Nan changed her name to Marley Hastings for her own protection - and for Nan's. Join Marley, an archaeologist and Williamsburg historian as she discovers the \"Lost Sea Captain\" in the dig of an 18th-century ship found in a construction site in Norfolk. When she goes on a Caribbean vacation with Nan, Marley herself nearly drowns in a tropical storm until she's rescued by a handsome sea captain. Marley soon learns she's traveled in time and that Hawk and his best friend, Raven, support the burgeoning American revolution on their ship, the Adventurer, as privateers in the year 1775. The crew wages valiant fights against Royal Navy warships on the high seas, British Army gunners at the Battle of Great Bridge, and the villainous Lucian Caine, who has returned from the past to settle an old score he had with the Trelawneys.As shy Marley falls in love with the charming Hawk, he brings her out of her shell and teaches her to have courage. Hawk himself is pleasantly surprised at the passion revealed in the fiery young woman. Marley soon comes to believe that Hawk is indeed the Lost Sea Captain - but how can she intervene in his fate without upsetting history?When they arrive in Boston to visit Raven's family, Marley learns that her family has an unshakable bond with them - again, going back to her sister, Rachel.And at last they visit Rosalie - where Marley is surprised to get a glimpse into the very time portal where her own sister traveled to Rosalie thirty years before.",
  "genres": [
    "Romance",
    "Historical",
    "Time Travel"
  ],
  "author": "Anne Meredith",
  "average_rating": "4.15",
  "url": "https://www.goodreads.com/book/show/32872092-immortal"
}