{
  "title": "Sin",
  "description": "PLEASE NOTE: This companion novella is designed to be read AFTER books 1–4 in The Tainted Accords. Sin contains SPOILERS of the Tainted Accords series. ***“He saunters in front of her with false casualness. Sin. Devastatingly handsome and devastatingly aware of it.”Sin is quite content to fornicate, fight, and drink his life away—in that order. He’s got friends, he’s got goldies, and he’s blissfully free of females—during the day, anyway. If there’s one thing his dear father taught him, it was to never let a woman get too close. “Women aren’t capable of loyalty,” his father would say over a bottle of brew. “They’ll leave you as soon as a better offer comes along.”Just like Sin’s mother.Yet when Sin comes across, quite frankly, the ugliest woman he’s ever seen, he finds himself offering her friendship, safe in the knowledge he’ll never feel anything more.Even if she’s different from any other female he’s ever met.Even when he can’t stop thinking about her. Olorna is still recovering from the harsh effects of starvation in her struggle to survive the war. Now she feels horribly out of her depth as a new member of the Solati court. Olorna is desperate to fit in for the sake of her mother, who has been given the role of her dreams. But when a royal change puts her mother’s new position on tenuous ground, she is powerless to stop it. . . . When Olorna receives an offer which will solve all her problems, she is determined to accept, despite the consequences.Even when a man incapable of love steals a kiss from her lips. Even if she is making the biggest mistake of her life.(Warning: contains naughty words, mild sexual themes, and violence. Suitable for mature young adults.)",
  "genres": [
    "Fantasy",
    "Romance",
    "Young Adult",
    "Novella",
    "Fantasy Romance",
    "Fiction",
    "Young Adult Fantasy"
  ],
  "author": "Kelly St. Clare",
  "average_rating": "4.04",
  "url": "https://www.goodreads.com/book/show/32868427-sin"
}