{
  "title": "The Talented Ribkins",
  "description": "At seventy-two, Johnny Ribkins shouldn’t have such problems: He’s got one week to come up with the money he stole from his mobster boss or it’s curtains. What may or may not be useful to Johnny as he flees is that he comes from an African-American family that has been gifted with super powers that are a bit, well, odd. Okay, very odd. For example, Johnny's father could see colors no one else could see. His brother could scale perfectly flat walls. His cousin belches fire. And Johnny himself can make precise maps of any space you name, whether he's been there or not.In the old days, the Ribkins family tried to apply their gifts to the civil rights effort, calling themselves The Justice Committee. But when their, eh, superpowers proved insufficient, the group fell apart. Out of frustration Johnny and his brother used their talents to stage a series of burglaries, each more daring than the last. Fast forward a couple decades and Johnny’s on a race against the clock to dig up loot he's stashed all over Florida. His brother is gone, but he has an unexpected sidekick: his brother's daughter, Eloise, who has a special superpower of her own. Inspired by W. E. B. Du Bois’s famous essay “The Talented Tenth” and fuelled by Ladee Hubbard’s marvelously original imagination, The Talented Ribkins is a big-hearted debut novel about race, class, politics, and the unique gifts that, while they may cause some problems from time to time, bind a family together.A big-hearted novel about a family with special gifts who sometimes stumble in their efforts to succeed in life, The Talented Ribkins draws on such novels as Toni Morrison’s SulaThe Intuitionist to weave themes of race, class, and politics into a wonderfully accomplished and engaging novel.",
  "genres": [
    "Fiction",
    "Fantasy",
    "Magical Realism",
    "Audiobook",
    "Contemporary",
    "Family",
    "Race"
  ],
  "author": "Ladee Hubbard",
  "average_rating": "3.74",
  "url": "https://www.goodreads.com/book/show/32873790-the-talented-ribkins"
}