{
  "title": "The Philosopher's War",
  "description": "The second book in the thrilling series that began with The Philosopher’s Flight finds Robert Canderelli Weekes as a rookie Rescue and Evacuation flier on the front lines of World War I in France. He came to save lives, but has no idea how far he’ll have to go to win the war.Thanks to a stunning flying performance and a harrowing shootout in the streets of Boston, Robert Canderelli Weekes’s lifelong dream has come true: he’s the first male allowed to join the US Sigilry Corps’s Rescue and Evacuation service, an elite, all-woman team of flying medics.But as he deploys to France during the waning days of the Great War, Sigilwoman Third-Class Canderelli learns that carrying the injured from the front lines to the field hospital is not the grand adventure he imagined. His division, full of misfits and renegades, is stretched the breaking point and has no patience for a man striving to prove himself. Slowly, Robert wins their trust and discovers his comrades are plotting to end the Great War by outlawed philosophical means. Robert becomes caught up in their conspiracy, running raids in enemy territory and uncovering vital intelligence. Friends old and new will need his help with a dangerous scheme that just might win the war overnight and save a few million lives. But the German smokecarvers have plans of their own: a devastating all-out attack that threatens to destroy the Corps and France itself. Naturally, Robert is trapped right in the thick of it.The Philosopher’s War is the electrifying next chapter in Robert Weekes’s story, filled with heroic, unconventional women, thrilling covert missions, romance and, of course, plenty of aerial adventures. The second book in a series “that grabs readers from its opening lines and doesn’t loosen its grip or lessen its hold all the way through” (Associated Press), Tom Miller again brings Robert’s world to life with unrivaled imagination, ambition, and wit.",
  "genres": [
    "Fantasy",
    "Historical Fiction",
    "Fiction",
    "Alternate History",
    "Science Fiction",
    "Historical",
    "Audiobook"
  ],
  "author": "Tom        Miller",
  "average_rating": "4.26",
  "url": "https://www.goodreads.com/book/show/32895517-the-philosopher-s-war"
}