{
  "title": "Nine Kinds Of Naked",
  "description": "\"As fanciful and inventive in its form... as it is in its observations... It fed tasty crackers to all the hungry parrots in my mental aviary.\" —TOM ROBBINSJoin cult favorite Tony Vigorito in his acclaimed, surreal whirlwind of a novel exploring chaos theory. A prisoner spins a playing card into a somersault, stirring a wind that becomes a tornado that takes off the roof of a church in nearby Normal, Illinois. Elizabeth Wildhack is born in that church and someday she will meet that prisoner, a man named Diablo, on the streets of New Orleans—where a hurricane-like Great White Spot hovers off the coast. But how is it all interconnected? And what does it have to do with a time-traveling serf and a secret society whose motto is “Walk away?”\"Linguistic gymnastics abound… Vigorito demonstrates once again that he's a wild stylist… startlingly original… an entertaining anarchist…\" —The Chicago Sun-Times\"Chaos theory says that a tiny, almost imperceptible event can have large, even catastrophic coincidences: a butterfly flapping its wings in North America leads to a hurricane on another continent, for example. In this fictional take on chaos theory, several offbeat characters are linked by a single event that expands through time, sweeping them up in it and changing their lives. A traveler works a nifty trick with a playing card, and a tornado strikes a small Illinois town; a woman is born during the tornado and later meets the man who set it in motion; 1,200 years earlier, a man who is supposed to be stoned to death discovers he has an uncanny knack for surviving; and, back in the present day, another man speaks only in the present tense. Comparisons of this novel to the works of Tom Robbins are both obvious and appropriate: the story meanders around in an entertaining manner, never getting too serious about itself; the characters are splendidly loopy, close to caricature but never quite reaching it, and the situations in which they find themselves are comic, dramatic, and everything in between.\" —Booklist",
  "genres": [
    "Fiction",
    "Humor",
    "Philosophy",
    "Contemporary",
    "Audiobook",
    "Comedy",
    "Time Travel"
  ],
  "author": "Tony Vigorito",
  "average_rating": "3.79",
  "url": "https://www.goodreads.com/book/show/3288140-nine-kinds-of-naked"
}