{
  "title": "Rogues, Rakes and Dukes: Hold Your Breath Boxed Set, #1-3",
  "description": "Stone Devil Duke Marked for death, Lady Augustine Christopherson finds herself scouring the slums of London in a desperate search to find the men who killed her father, and are determined to dispose of her. To protect her family, to protect herself, she is determined to find the men before they find her. The last thing she wanted was an entanglement with a duke that threatens her very survival…  Hardened long ago, the last thing the Duke of Dunway wanted was an entanglement with a chit of the ton. But in the flash of a pistol, his fate is altered as he finds himself honor-bound to protect Lady Augustine from, of all things, herself.  Unmasking the Marquess Some people are born with backbone. Others have to fight for it. List in-hand of suitable bachelors, Lady Reanna Halstead, the epitome of naivety, is thrust into London society with demands to gain a husband. To her utter amazement, she manages to capture the attentions of the Marquess of Southfork. Her love, dreams, and future are soon pinned on her marriage to this one man. One handsome, kind, fantastic man. One man, who has a very different idea of what this marriage will be.  He will be hated, before he is loved. Killian Hayward, Marquess of Southfork, is only one step away from completing the revenge he has fought his entire life for. All he has to do is marry Lady Halstead. The one woman that is the key to his revenge. To his peace. The one woman that will threaten the very foundation of his entire existence.  My Captain, My Earl One destined to live life on the seas. As captain of the Windrunner, Katalin Dewitt has one mission in life. Serve the ship. The ship that has been her home her entire life. The ship that is the key to keeping her father safe from certain death. She never expected to take pity on an injured deckhand from an enemy ship and allow him onto the Windrunner. And she certainly never expected to allow him into her life. One determined to make his way home.  Bound, gagged, and held captive on one ship after another for two long years, Jason Christopherson had long since given up hope of ever getting back to land, much less to his beloved England. He never expected to land on a pirate ship, bound for land. And he certainly never expected to fall in love with his new captain, threatening the one thing he needed most in life–to return home.  Neither expected to fall in love. Neither expected to be torn apart by a brutal betrayal.  The first three Regency romances in the Hold Your Breath series by K.J. Jackson. Historical romance with strong women, undeniable men, and hold your breath adventure.",
  "genres": [
    "Historical Romance",
    "Romance",
    "Historical Fiction"
  ],
  "author": "K.J. Jackson",
  "average_rating": "4.33",
  "url": "https://www.goodreads.com/book/show/32879189-rogues-rakes-and-dukes"
}