{
  "title": "Blind Reader Wanted",
  "description": "Lara.I was born into darkness. Just like a puppy, only my darkness is eternal. Everyone else sees a world I can only imagine, but hey, don't pity me. I don't. I've got a lot of imagination, and I've made my world beautiful more beautiful that you can know.When I was a small child, my mother said I used to run into furniture, and if I was not too badly hurt, I'd get back up and continue running down the same path. When I grew older I understood that the world is not built for blind people.I needed a white cane and I needed to trust my bestie, Elaine, and jump when she yelled, \"Puddle\".Sometimes, just for the fun of it, she'd yell puddle and there would be no puddle, but generally our system worked well.Now, I'm all grown up and she tells me that the most mysterious man in Durango Falls has stuck a job vacancy on her noticeboard and that I should apply for it.Apparently Kit Carson needs a blind reader.To be honest it sounds a bit like those times she yelled puddle and there was no puddle. But what the hell? I'll give her a laugh and jump once again.This is the story of what happened when I jumped.Kit.I came to Durango Falls because it was the perfect place to hide.The townsfolk here don't like strangers and I don't like people. So I don't talk to no one and no one talks to me. Suits me just fine.For five years now I've been livin' alone at the edge of this forest. Just me and the wolves I've adopted, but this winter my soul has started hankering for something more.I know it's sure as hell ain't for the warmth of a woman's body. I'm done with that. The military made me into a f**kin' monster and I wouldn't put any woman through that. Not even a whore. She'd have to be blindfolded to enjoy herself.Maybe I'm just hankering for a woman's sweet voice reading to me the way my mother used to when I was five. Just before she died. Think I'll advertise for a blind reader. A female blind reader.That's what I thought I wanted.Well all that shit went out the window when I laid eyes on her.Now this woman's body is all I can think about ...A Full Length Standalone Romance With HEA.",
  "genres": [
    "Romance",
    "Contemporary",
    "Military Fiction",
    "Contemporary Romance",
    "Disability",
    "Friends To Lovers",
    "Adult"
  ],
  "author": "Georgia Le Carre",
  "average_rating": "3.99",
  "url": "https://www.goodreads.com/book/show/32906051-blind-reader-wanted"
}