{
  "title": "Heretics!: The Wondrous (and Dangerous) Beginnings of Modern Philosophy",
  "description": "This entertaining and enlightening graphic narrative tells the exciting story of the seventeenth-century thinkers who challenged authority--sometimes risking excommunication, prison, and even death--to lay the foundations of modern philosophy and science and help usher in a new world. With masterful storytelling and color illustrations, Heretics! offers a unique introduction to the birth of modern thought in comics form--smart, charming, and often funny.These contentious and controversial philosophers--from Galileo and Descartes to Spinoza, Locke, Leibniz, and Newton--fundamentally changed the way we look at the world, society, and ourselves, overturning everything from the idea that the Earth is the center of the cosmos to the notion that kings have a divine right to rule. More devoted to reason than to faith, these thinkers defended scandalous new views of nature, religion, politics, knowledge, and the human mind.Heretics! tells the story of their ideas, lives, and times in a vivid new way. Crisscrossing Europe as it follows them in their travels and exiles, the narrative describes their meetings and clashes with each other--as well as their confrontations with religious and royal authority. It recounts key moments in the history of modern philosophy, including the burning of Giordano Bruno for heresy, Galileo's house arrest for defending Copernicanism, Descartes's proclaiming cogito ergo sum, Hobbes's vision of the \"nasty and brutish\" state of nature, and Spinoza's shocking Theological-Political Treatise.A brilliant account of one of the most brilliant periods in philosophy, Heretics! is the story of how a group of brave thinkers used reason and evidence to triumph over the authority of religion, royalty, and antiquity.",
  "genres": [
    "Philosophy",
    "Graphic Novels",
    "Nonfiction",
    "History",
    "Comics",
    "Science",
    "Historical"
  ],
  "author": "Steven Nadler",
  "average_rating": "3.75",
  "url": "https://www.goodreads.com/book/show/32911707-heretics"
}