{
  "title": "Spoiler Alert: The Hero Dies",
  "description": "In this evocative and gorgeously wrought memoir reminiscent of Rob Sheffield’s Love Is a Mixtape and George Hodgman’s Bettyville, Michael Ausiello—a respected TV columnist and co-founder of TVLine.com—remembers his late husband, and the lessons, love, and laughter that they shared throughout their fourteen years together.For the past decade, TV fans of all stripes have counted upon Michael Ausiello’s insider knowledge to get the scoop on their favorite shows and stars. From his time at Soaps in Depth and Entertainment Tonight to his influential stints at TV Guide and Entertainment Weekly to his current role as co-founder of the wildly popular website TVLine.com, Michael has established himself as the go-to expert when it comes to our most popular form of entertainment.What many of his fans don’t know, however, is that while his professional life was in full swing, Michael had to endure the greatest of personal tragedies: his longtime boyfriend, Kit Cowan, was diagnosed with a rare and very aggressive form of neuroendrocrine cancer. Over the course of eleven months, Kit and Michael did their best to combat the deadly disease, but Kit succumbed to his illness in February 2015.In this heartbreaking and darkly hilarious memoir, Michael tells the story of his harrowing and challenging last year with Kit while revisiting the thirteen years that preceded it, and how the undeniably powerful bond between him and Kit carried them through all manner of difficulty—always with laughter front and center in their relationship. Instead of a tale of sadness and loss, Spoiler Alert: The Hero Dies is an unforgettable, inspiring, and beautiful testament to the resilience and strength of true love.",
  "genres": [
    "Nonfiction",
    "Memoir",
    "Audiobook",
    "LGBT",
    "Biography",
    "Queer",
    "Book Club"
  ],
  "author": "Michael Ausiello",
  "average_rating": "4.31",
  "url": "https://www.goodreads.com/book/show/32913135-spoiler-alert"
}