{
  "title": "The Silent and the Lost",
  "description": "The Silent and the LostAlex Salim McKensie, a war baby of the 1971 Bangladesh War of Independence, is adopted by the McKensies, an American family that has lost their only son in Vietnam. Years later, Alex falls in love with Sangeeta Rai, but their happiness is threatened when the enigma of his birth casts a dark shadow over their relationship.The Silent and the Lost opens with the wedding of Alex and Sangeeta in Brentwood, California on a sunny Saturday in 1997, then travels back into the boiling cauldron of political clashes of East Pakistan in early 1971. Through the eyes of newlywed Nahar Sultana, her husband, student activist Rafique Chowdhury, and their friends we are immersed into the nine months of revolution that created Bangladesh.On March 25, 1971, Nahar, Rafique, Nazmul and the Rahmans find themselves in the center of Operation Searchlight at Dacca University. Miraculously surviving, they escape to Sheetalpur village. Longing for vengeance and freedom, Nazmul and Rafique leave for the Mukthi Bahini guerrilla camps in Agartala, India. In a twist of fate, in a brutal family betrayal, Nahar is captured by the Pakistani Army. Destitute and in utter despair, tortured and mad, Nahar grips desperately to her last scintilla of hope—Rafique’s return.Two generations spread across two continents, thousands of miles apart, are brought jarringly together when Alex begins his search for answers to his beginnings. He discovers that his own struggle for happiness is inextricable from the history that he finds himself part the genocide that in 1971 ultimately created out of East Pakistan the new nation of Bangladesh.Set in a pivotal point of time, The Silent and the Lost powerfully chronicles the history of a revolutionary change in the socio-political landscape of the sub-continent, and takes us on a sinuous journey into a passionate and breathtaking untold account of heroism and betrayal, family and friendship, love and anguish—of the lives of the characters and millions of others swept up in the unfolding unrest, mayhem and suppressed genocide. East Pakstan 1971, East Pakistan Genocide, Bangladesh Genocide, Ethnic Cleansing, 1971 Bangladesh Liberation War, 1971 Bangladesh War of Independence, 1947 India-Pakistan Independence, U.S. South East Asia Foreign Policy, Birongana, War Baby, Multiracial adoption, India Pakistan War, Massacre by Pakistan Army, India Pakistan War, Rape Victims 1971 East Pakistan, Graveless Genocide, Ethnic Cleansing, 1971 Bangladesh War of Independence",
  "genres": [
    "Historical Fiction",
    "Bangladesh",
    "The United States Of America",
    "Fiction"
  ],
  "author": "Abu Zubair",
  "average_rating": "3.95",
  "url": "https://www.goodreads.com/book/show/12006100-the-silent-and-the-lost"
}