{
  "title": "The Darkness Series Boxed Set",
  "description": "All four books in this heart-stopping, dark romance series are now available in one boxed set! Prepare to be on the edge of your seat with each one of these mind-blowing thrillers in a series you won’t soon forget.MalevolentDarkness has a seductive power, a delicious energy that sinks its claws in deep. Once the devil has a hold of you, true malevolence is born.Sheriff Brady James has sworn to protect the small town of Durham Heights, his current priority to ruthlessly hunt a sadistic killer on the loose. With lives at stake, his focus is split between two beautiful women - one dark, one light. The clock is ticking, the threat palpable; crawling closer at every turn. Once death has you in its sights, there is no escape.EvanesceIf your soul has been plunged into the dark depths of despair, how hard would you fight to claw your way back to the surface? Can the life you lost be restored, or is it destined to be forever phased out of existence? Fated to dissolve into a distant memory.A sinister criminal ring has descended on the small town of Norton Springs, instilling fear in the residents. A vicious wave of disappearances coupled with the gut-wrenching horror of infants being ripped from the arms of their helpless mothers has the town quaking in terror.DenouementThe past and present collide in the final book of the Darkness Series. Old enemies return and unlikely allies are formed when a serial arsonist targets the small town of Stockton Crossing, Louisiana. Working together with the surrounding towns of Durham Heights and Norton Springs, firefighter Lieutenant Weston Hunt is forced out of his reclusive tendencies to help apprehend the madman.When Aubrey Sinclair, the sexy librarian he’s always had a thing for becomes the next target, they are thrown together in more ways than one. She needs his protection and he’s powerless to deny her. With the chaos closing in around them, will they solve the puzzle before it’s too late? Or is their destiny to go down in a fiery blaze?RepentanceObsession is a passionate emotion. A dark blend of desire and longing; it distorts reality into twisted fantasies. How far would you go to ensure the object of your infatuation is forever in your possession?Two people thrown together in a twist of fate. One running from his past; the other chasing a brighter future. Can they be each other’s salvation? Or will any happiness they find be ripped to shreds by the deadly obsession of another? Redemption comes at a high-staked price no one is willing to pay as the Darkness Series returns for one last mind-blowing trip into the depths of despair.",
  "genres": [],
  "author": "Cassia Brightmore",
  "average_rating": "4.45",
  "url": "https://www.goodreads.com/book/show/32905026-the-darkness-series-boxed-set"
}