{
  "title": "Draw One in the Dark",
  "description": "Every one of us has the beast inside. But for Kyrie Smith, the beast is no metaphor. Since she was 15, when she first shape-shifted into a savage, black panther, Kyrie has questioned her humanity. Although she's managed to keep her inner beast secret most of the time, the panther occasionally emerges to strike unbidden. Terrified she'll hurt someone while in panther form, Kyrie moves from town to town, searching for a way to feel human again. Kyrie's lonely life changes forever while waitressing at a cheap diner in Goldport, Colorado. Investigating frantic screams from the parking lot, Kyrie stumbles upon a blood-spattered dragon crouching over a mangled human corpse. The dragon shape-shifts back into her co-worker, Tom, naked, dazed and unable to remember how he got there. Thrust into an ever-changing world of shifters, where shape-shifting dragons, giant cats and other beasts wage a secret war behind humanity's back, Kyrie may find the answers she seeks-with help from Tom, a mythical object called the Pearl of Heaven, and her own inner beast. Every one of us has the beast inside. But for Kyrie Smith, the beast is no metaphor. Since she was 15, when she first shape-shifted into a savage, black panther, Kyrie has questioned her humanity. Although she's managed to keep her inner beast secret most of the time, the panther occasionally emerges to strike unbidden. Terrified she'll hurt someone while in panther form, Kyrie moves from town to town, searching for a way to feel human again. Kyrie's lonely life changes forever while waitressing at a cheap diner in Goldport, Colorado. Investigating frantic screams from the parking lot, Kyrie stumbles upon a blood-spattered dragon crouching over a mangled human corpse. The dragon shape-shifts back into her co-worker, Tom, naked, dazed and unable to remember how he got there. Thrust into an ever-changing world of shifters, where shape-shifting dragons, giant cats and other beasts wage a secret war behind humanity's back, Kyrie may find the answers she seeks-with help from Tom, a mythical object called the Pearl of Heaven, and her own inner beast.",
  "genres": [
    "Fantasy",
    "Urban Fantasy",
    "Fiction",
    "Dragons",
    "Paranormal",
    "Shapeshifters",
    "Romance"
  ],
  "author": "Sarah A. Hoyt",
  "average_rating": "3.61",
  "url": "https://www.goodreads.com/book/show/1200626.Draw_One_in_the_Dark"
}