{
  "title": "Fire's Love",
  "description": "This is the revised edition, published in 2016. The original edition published in 2013 and had 4.3 of 5 star reviews. It can be found easily by clicking above on the author's name. This will take you to her author page where you can find all works published in her name including the original edition of this title.  Kira thought she was leaving her demons behind when she left for college. She quickly discovers demons are everywhere, and can be good or evil. Not only are they real, but they’re protecting her; that is, except for the ones who want her dead.  Kira's parents want to reveal things about who she is, but a strange phenomenon prevents them from explaining. Before they can try again, her mother and brother die and her father disappears. Afterward, Kira finds a mysterious book in her parents‘ belongings. Although the book confuses her, it comforts her too. She's sure it holds the answers she seeks.  One of Kira’s new friends, Lowell Hew, is also an earth demon named Ulric the Wolf Thief. Lowell tries to help Kira solve the mysteries involving the book, her parents, and the elements they wanted her to know. Although Lowell has a crush on Kira, he’s not looking for a relationship, or so he keeps telling himself.  Meanwhile, Lowell introduces Kira to his best friend, Pyre, a fire demon with a fiery temperament and a troubled past. Pyre closed off his heart years ago, while deep inside he yearned to belong. For Pyre, learning to love again comes with tremendous risk, especially when the girl he loves is human, and his best friend has thoughts of his own.  Things go well until an eerie presence threatens Kira and her new friends, and they can only speculate as to who it may be. While her friends protect her and try to uncover the enemy’s identity, Kira must adjust to the challenges of being human with demon friends. Will she bask in the warmth, or be consumed by the flames of Fire’s Love?",
  "genres": [
    "Young Adult"
  ],
  "author": "Alex E. Carey",
  "average_rating": "4.35",
  "url": "https://www.goodreads.com/book/show/32930611-fire-s-love"
}