{
  "title": "Flying Funny: My Life without a Net",
  "description": "Dudley Riggs didn’t have to run away from home to join the circus. Home was the circus. Son of the acclaimed aerial flyers Riggs and Riggs, he made his circus debut as a polar prince parading in a wagon pulled by a polar bear. At the age of five, he graduated to a risqué vaudeville act during the circus off- season; at eight, he outgrew his cutes (and his child stardom) and joined his high-flying parents on the trapeze. Eventually he had to learn to “fly funny” because he grew too tall to fly straight. In one way or another, Riggs has been flying ever since. The rest, as they say, is history. And what a story it is. In Flying Funny , Riggs shares many highs and lows while describing circus life and the evolution of America’s popular entertainment during the twentieth century. From his early life in circus and vaudeville to his creation of the Brave New Workshop, we see how his show business experience and instincts helped him create in Minneapolis what became the “next wave” in American entertainment—improvisation.   As a young man, Riggs lost everything in a tornado, got an education on the fly, and sailed with the All American circus to post–war Japan. On a slow boat home and restless about his future, he developed the idea of Word Jazz—creating a script on stage as it is being performed—and shortly after he opened the Instant Theater in New York. Later, he moved to Minneapolis where he founded the Brave New Workshop, launching the careers of comic greats such as Penn and Teller, The Flying Karamazov Brothers, Louie Anderson, Peter Tolan, Pat Proft, Nancy Steen, Liz Winstead, Al Franken and many others. Today, the Brave New Workshop thrives as the longest running improvisational theater in America.   From flying funny on the trapeze to theater without a net, Dudley Riggs’s story is filled with hearty laughs and eyebrow-raising insights. With a wry sense of humor and infectious warmth, he shares the exhilaration of flying whether through the air or on the stage.",
  "genres": [
    "Nonfiction",
    "Memoir"
  ],
  "author": "Dudley Riggs",
  "average_rating": "3.74",
  "url": "https://www.goodreads.com/book/show/32920969-flying-funny"
}