{
  "title": "Iron Angels",
  "description": "New York Times\nbest-selling author Eric Flint takes on urban fantasy: A bizarre kidnapping case leads FBI Special Agent Jasper Wilde into the mysterious world of a strange religious cult, even stranger criminals and an ancient evil. Set in the Windy City of Chicago and in rusty, industrial East Chicago A bizarre kidnapping case leads FBI Special Agent Jasper Wilde into the mysterious world of a strange religious cult and even stranger criminals. At the scene of the kidnapping itself, a frightening apparition is seen. Then, a hideously-mutilated corpse is found nearby. Something wicked has come to the nornal-seeming Chicago suburbs.  It doesn t take longbefore the FBI agents realize that something truly extraordinary is unfolding in northwest Indiana and that, whatever it is, the area s huge steel industry is somehow at the center.  Jasper is joined by Supervisory Special Agent Temple Black.Blackhas recently been put in charge of a new unit, the Scientific Anomalies Group, created to analyze and handle peculiar cases which might be on the periphery of national security.  Another cult is discovered, although this one seems to be opposed to the criminal activities taking place. Further investigation, however, just produces more in the way of mystery. The agents consult with scientists and theologians, but no one has any idea what might be producing the situation.  Until, finally, the cults erupt in open warfare. As the FBI agents race to intervene and finally put a stop to the horrors, they come to understand and accept that something very ancient and very evil has surfaced in the world or, perhaps, something that is very, very alien. About Eric Flint:   Another engaging alternate history from a master of the genre. Booklist  . . . an old-style police-procedural mystery, set in 17th century Germany. . . . the threads . . . spin together . . . to weave an addictively entertaining story. . . . a strong addition to a fun series. Daily News of Galveston County  This alternate history series is a landmark Booklist  [Eric] Flint's1632universe seems to be inspiring a whole new crop of gifted alternate historians. Booklist  reads like a technothriller set in the age of the Medicis Publishers Weekly\"",
  "genres": [
    "Urban Fantasy",
    "Fantasy",
    "Fiction",
    "Horror",
    "Science Fiction",
    "Mystery",
    "Detective"
  ],
  "author": "Eric Flint",
  "average_rating": "3.33",
  "url": "https://www.goodreads.com/book/show/32919681-iron-angels"
}