{
  "title": "Something Beautiful Happened: A Story of Survival and Courage in the Face of Evil",
  "description": "Seventy years after her grandmother helped hide a Jewish family on a Greek island during World War II, a woman sets out to track down their descendants—and discovers a new way to understand tragedy, forgiveness, and the power of kindness.Yvette Manessis Corporon grew up listening to her grandmother’s stories about how the people of the small Greek island Erikousa hid a Jewish family—a tailor named Savvas and his daughters—from the Nazis during World War II. Nearly 2,000 Jews from that area died in the concentration camps, but even though everyone on Erikousa knew Savvas and his family were hiding on the island, no one ever gave them up, and the family survived the war.Years later, Yvette couldn’t get the story of the Jewish tailor out of her head. She decided to track down the man’s descendants—and eventually found them in Israel. Their tearful reunion was proof to her that evil doesn’t always win. But just days after she made the connection, her cousin’s child was gunned down in a parking lot in Kansas, a victim of a Neo-Nazi out to inflict as much harm as he could. Despite her best hopes, she was forced to confront the fact that seventy years after the Nazis were defeated, it was still happening today.As Yvette and her family wrestled with the tragedy in their own lives, the lessons she learned from the survivors of the Holocaust helped her confront and make sense of the present.In beautifully told interweaving storylines, the past and present come together in a nuanced, heartfelt story about the power of faith, the importance of kindness, and the courage to stand up for what’s right in the face of great evil.",
  "genres": [
    "Nonfiction",
    "History",
    "Memoir",
    "World War II",
    "Holocaust",
    "Biography",
    "Family"
  ],
  "author": "Yvette Manessis Corporon",
  "average_rating": "3.73",
  "url": "https://www.goodreads.com/book/show/32920291-something-beautiful-happened"
}