{
  "title": "The Consumption Cleanse - Food: Giving up 13 consumption habits in 13 weeks for a better life and a healthier planet",
  "description": "This edition was previously published under ASIN: B01M3YL4H5Society suggests that in order to live right we need to go to school, get a good job and earn lots of money, buy a nice big house and plenty of 'stuff', work until retirement and then…I suppose die. What nonsense. The idea of escaping this work-consume-sleep cycle resonates with many who are aware of it. But the question of how to actually escape from that cycle is where it gets a bit murky. The escape from this endless and unsatisfying cycle all starts with addressing consumption, as it is excessive consumption that drives most of us to work. This same consumption also underpins much of our own and the planet's physical ailments. By creating conscious consumption habits, we can lighten the load on the planet and our bodies at the same time as liberating financial resources so that we can head towards a better work-life balance. And maybe towards no work at all!  The consumable that is the most beneficial to address at the individual level is food. It will have the most immediate impact on your budget, your belly and your brain. But this is not just another diet book. Nor is it another book about how to save the world. The Consumption Cleanse is a no-nonsense, research-referenced and achievable roadmap to the mindful consumption of food and beverages. The author has peeled back the marketing spin and corporate hogwash that is wrapped around many of our common foods to reveal the truth about what we eat. Together with these truths, the cleanse comprises the results of his self-experimentation, extraction plans and food-replacement suggestions in relation to 13 of our most commonly consumed food categories.  The Consumption Cleanse will enable you to take your first steps off the life-destroying consumer hamster wheel. So, scroll to the top of the page, buy the book and get started today for immediate benefits.",
  "genres": [],
  "author": "Michael  Blue",
  "average_rating": "4.06",
  "url": "https://www.goodreads.com/book/show/32932884-the-consumption-cleanse---food"
}