{
  "title": "The Gates of Tagmeth",
  "description": "New novel in the Kencyrath series, sequel to The Sea of Time. Adventure in a well-crafted high fantasy land. Destruction is in Jame Knorth's nature. Literally. She is the avatar of the god Gerridon, also known as That-Which-Destroys, the god of chaos and ruin. Yet Jame is also a noblewoman within an ancient race, and the designated heir of her twin brother Torisen Knorth, High Lord of the Kencyrath. Jame's people are fleeing, world by world, from a terrible enemy that has pursued them through a multitude of universes. Its name is Perimal Darkling.  Obeying instructions from her brother, Jame sets out with a force of Southron warriors to reestablish the long-fallen castle keep of Tagmeth. By Jame's side is Lyra, a devious Kencyrath noble girl who is determined not to be forced into a marriage with a man she despises. Jame's old friends Mark and Brier Iron-thorn stand with her, as well: Marc, steward and organizer of Jame's household and Brier, the only captain under her command wholly sworn to support Jame no matter the cost. Jame finds more allies in the forest surrounding the ancient keep where the wild people of the woodlands, the Merikit, hold court. And Jame's adopted mother, Gran Cyd, matriarch and queen of the Merikit, may once again provide the voice of calm that Jame requires to survive her own tempestuous nature.  Jame sets about establishing Tagmeth as an outpost against the gathering power of Perimal Darkling. But Tagmeth hides a secret, a gateway to a mystery that may save this world from eternal darkness or plunge it to destruction and ruin all the sooner. It is up to Jame to find her way through Perimal Darkling's traps, and to come to terms with the god of pandemonium and destruction within her who grows stronger every day. If she succeeds it may be that Perimal Darkling can finally be defeated after eons of fear and flight. And if she fails, yet another world will fall to darkness forever. About P.C. Hodgel's Kyncyrath Series:   \"P.C. Hodgell writes the most strikingly weird and wonderful stories in epic fantasy today.\" Charles Stross  \"Hodgell has crafted an intricate fantasy with humor, tragedy, and a capable and charming female hero. Library Journal  The Kencyrath Saga Seeker's Bane Bound in Blood Honor's Paradox Sea of Time Omnibus Editions The Godstalker Chronicles Contains Kencyrath prequel novels God Stalk and Dark of the Moon\"",
  "genres": [
    "Fantasy",
    "Fiction",
    "Epic Fantasy",
    "Science Fiction Fantasy",
    "High Fantasy"
  ],
  "author": "P.C. Hodgell",
  "average_rating": "4.40",
  "url": "https://www.goodreads.com/book/show/32919679-the-gates-of-tagmeth"
}