{
  "title": "The Year's Best Military & Adventure SF Volume 3",
  "description": "The Year's Best Military & Adventure SF series continues! Selected from the top print and online markets, these stories represent the best in modern military sf, space opera, and adventure sf. Tales of brave military men and women, thrilling derring-do, and edge-of-your-seat suspense. Stories to get your blood racing, your heart pounding, and your fingers turning the pages. Stories to challenge, provoke, thrill, and entertain. Stories that prove the new Golden Age is now!. This intriguing anthology explores the human race's violent potential but also bends toward exploration and the triumph of the human spirit, with brave tales that take the reader on a fascinating, thought-provoking, enjoyable journeyContents; Preface (The Year's Best Military & Adventure SF: Volume 3) • essay by David Afsharirad Introduction (The Year's Best Military & Adventure SF: Volume 3) • essay by David Weber Cadet Cruise [RCN] • (2016) / short fiction by David Drake Tethers (2016) / short fiction by William Ledbetter Unlinkage (2016) / novelette by Eric Del Carlo Not in Vain [Black Tide Rising] (2016) / novelette by Kacey Ezell Between Nine and Eleven (2016) / short story by Adam Roberts Sephine and the Leviathan (2016) / novelette by Jack Schouten The Good Food (2016) / short fiction by Michael Ezell If I Could Give This Time Machine Zero Stars, I Would (2016) / short story by James Wesley Rogers Wise Child [Liaden Universe] (2016) / novelette by Sharon Lee and Steve Miller Starhome (2016) / novelette by Michael Z. Williamson The Art of Failure (2016) / short fiction by Robert Dawson The Last Tank Commander (2016) / novelette by Allen Stroud One Giant Leap (2016) / short story by Jay Werkheiser The Immortals: Anchorage [Symphony of War Shorts • 2] (2016) / novelette by David Adams Backup Man (2016) / short story by Paul Di Filippo.",
  "genres": [
    "Science Fiction",
    "Fiction",
    "Short Stories"
  ],
  "author": "David Afsharirad",
  "average_rating": "3.67",
  "url": "https://www.goodreads.com/book/show/32919691-the-year-s-best-military-adventure-sf-volume-3"
}