{
  "title": "Does it Yurt? Travels in Central Asia Or How I Came to Love the Stans",
  "description": "Conjuring images of nomadic horsemen, spectacular monuments, breathtaking scenery and crippling poverty, Central Asia remains an enigma. Home to the descendants of Jenghiz Khan's Great Horde, in the nineteenth century the once powerful Silk Road states became a pawn in the 'Great Game' of expansion and espionage between Britain and Russia, disappearing behind what would become known as the 'Iron Curtain'. With the collapse of the USSR, the nations of Kazakhstan, Kyrgyzstan, Tajikistan, Turkmenistan and Uzbekistan were born. Since independence, Central Asia has seen one civil war, two revolutions and seven dictators.An insightful mix of travel, history and reportage, in Does it Yurt? journalist Stephen M. Bland takes the reader on a voyage of discovery. Travelling to a desert sea, a collapsed Russian gas rig daubed the 'Gate to Hell' and along the 'Heroin highway' atop the roof of the world, the author sets out to explore these lands, unearthing the stories of the people and places behind this fascinating region.Written sharply, vividly... If you're looking for an antidote to chirpy travel-guide descriptions of Central Asia, then this is the book for you.'  -- Sam Tranum, author of Daily Life in Turkmenbashy's Golden Age.'Packed with insights into every corner of the region.' -- Paul Wilson, Trailblazer Guides writer and author of The Alphabet Game.'Weaves together my favourite elements of a travelogue: historical context and current observations mixed with a dry sense of humour and amusing anecdotes... Does it Yurt? will result in my journey to Central Asia being that much more rewarding.'  -- Ric Gazarian, author of 7000KM To Go and Hit the Road India; top 500 travel blogger.'Stephen M. Bland's writing captures the magical whirlwind flavour of Central Asia in this very perceptive and insightful book. Those who have visited this wonderful part of the world will instantly recognise and reminisce on the many stories of potholed journeys by shared taxi, generous encounters with friendly locals and the inevitable run-ins with bumbling bureaucracy. Those who haven't yet visited will be inspired to book their next adventure as soon as they can put the book down. A thrilling ride from start to finish.' -- Nick Rowan, author of Friendly Steppes: A Silk Road Journey 'Deserves to be shared among friends, as well as having a designated place on your shelves. Stephen M. Bland succeeds in bringing the region alive, and his story is an interesting and hard-to-decline invitation to join in his travels.' -- Eugenette Morin, writer",
  "genres": [
    "Travel",
    "Nonfiction"
  ],
  "author": "Stephen M.  Bland",
  "average_rating": "3.64",
  "url": "https://www.goodreads.com/book/show/32927644-does-it-yurt-travels-in-central-asia-or-how-i-came-to-love-the-stans"
}