{
  "title": "Murder at Chateau Sur Mer",
  "description": "For fans of HBO’s The Gilded Age, explore the dark side of the alluring world of America’s 19th century elite in this gripping series of riveting mysteries…In the late nineteenth century, Newport, Rhode Island, is home to some of America s wealthiest citizens. It s also the beat of society reporter Emma Cross, a less well-heeled cousin to the illustrious Vanderbilts, who occasionally moonlights in solving murders . . . Covering a polo match for the Observer, Emma s job is to take note of the real players off the field Newport s well-bred elite. But the fashionable facade is breached when a woman in gaudy clothing creates a scene demanding to speak to the wife of Senator George Wetmore until she is escorted off the grounds by the police.  The next morning, police detective Jesse Whyte asks Emma to meet him at the Wetmores Bellevue Avenue home, Chateau sur Mer, where the senator s wife, Edith, has mysteriously asked to see her. Upon entering the mansion, Emma is confronted with a crime scene the intruder from the polo match lies dead at the foot of a grand staircase.  To avoid scandal, Edith Wetmore implores Emma to use her reporter skills and her discretion to investigate. When Emma learns the victim was a prostitute and pregnant she wonders if the senator was being blackmailed. As Emma peels back layers of deception and family secrets, she may have met her match in a desperate killer who will trample anyone who gets in the way... Praise for Alyssa Maxwell and her Gilded Newport Mysteries! MURDER AT ROUGH POINT  Pleasantly twisty . . . will appeal to lovers of atmospheric country house mysteries. Publishers Weekly  Emma is an interesting, independent career woman in this satisfying first-person account that includes well-drawn characters. Booklist  The characters are fun, the dialogue is both charming and intelligent, but the scenery that makes up that extravagant time period in New England really is the gem in these glorious tales. Suspense Magazine MURDER AT BEECHWOOD  Another entertaining entry in this cozy series. Library Journal  Several cuts above the usual feisty heroine tale; it provides a good picture of life among the privileged and not-so-privileged classes in Gilded Newport. San Jose Mercury News MURDER AT MARBLE HOUSE  Maxwell s second entry has a credible mystery, solved by a female detective who s likeable. Kirkus Reviews  Maxwell again deftly weaves fictional and real-life characters into her story. Publishers Weekly MURDER AT THE BREAKERS  A promising start to an engaging mystery series filled with smart observations. Library Journal  Sorry to see the conclusion of Downton Abbey Season 4? Well, here is a morsel to get you through a long afternoon.Brew some Earl Grey and settle down with a scone with this one. Washington Independent Review of Books Will keep you guessing. Historical Novels Reviews\"",
  "genres": [
    "Mystery",
    "Historical Fiction",
    "Cozy Mystery",
    "Historical Mystery",
    "Fiction",
    "Historical",
    "Romance"
  ],
  "author": "Alyssa Maxwell",
  "average_rating": "4.07",
  "url": "https://www.goodreads.com/book/show/32920013-murder-at-chateau-sur-mer"
}