{
  "title": "String of Fate",
  "description": "Fall Inlove with a Romantic Box Set1 Sizzling Author, 6 Ways to prove that “We don’t meet people by Accident, they are meant to cross our path for a Reason.A matchmaker is meant to make a match for others to be happy. But what if fate makes a twist? And the match maker fell in love.The matchmaker is the one who found her match—this is what happened to Elisse. All she wanted is to find her customers, their match. But apparently, her match came and she could no longer be a matchmaker for herself.Would she continue being the matchmaker? Or she would accept her fate?Katrina Milan can no longer be able to handle the harshness of her boss, so she decided to quit her job. Leaving that job, she didn't expect to find a job that she can't resist. And on that job, she didn't expect that it will affect her delicate heart.Will she continue her job even if her heart will be affected by it? Or will she give up her job again just to protect her fragile heart?Do you believe in love at first sight? Do you believe in destiny? What is meant to be will always find its way.Rozen believes that he met this certain girl for a reason. He already saw her before then he got a chance to meet her again. He thinks that destiny is working for him. So he made a move to get this girl. It’s kind’a gay, but he pursues what he wants to do.What will happen if he tells her that they’re destined together? Did the girl would think that he’s a crazy guy, or she would believe that he’s right, that they are destined together?He’s an enemy in life, but turned out to be her lover for life.Angel had no idea how she started to feel this weird feeling towards Jiro. He’s a good for nothing guy who ruined her childhood days, and also her first kiss.But then after years, they met again coincidentally, and she never thought that because of a second ruined kiss, she would feel the ‘something’ in her heart for him that made her believe that, the more you hate, the more you love.Devon hated her life and her parents because of manipulating her life. She has her own life, she has her own money, and she can live alone. But she can’t disobey her parents for what they want for her. All she could do, is to obey them. And that’s the reason, why she met Kien.Unlike her, Kien is a kind of guy who loves to obey his father. It’s really fine with him if he’s being manipulated. And that’s why, he agreed with the fixed marriage easily, while Devon is trying to stop her parents.But, cupid is really playful, what if the worst thing that ever happened to you, will turn out to be the best thing?The work-kaholic woman who turned out to be an in love woman will find a guy who would teach him to be happy, and appreciate love life again.After her first breakup, she never tried to be in a relationship again, but what made her accept the guy that she totally hates. She was not interested with him until he felt something in her chest.Take Action Now and Get this Kindle Book! PLUS Get 13 FREE BOOKS",
  "genres": [],
  "author": "Juvy Ann",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/32921124-string-of-fate"
}