{
  "title": "Radio: One Woman's Family in War and Pieces",
  "description": "THIS EYEWITNESS ACCOUNT of World War II social history, women's progress and the Golden Years of Radio is woven into one woman's humorous and poignant autobiography of her family struggles and attempts to fulfill her creative dreams. This book is richly illustrated with 50 historical photos and sketches.“When Ben went off to war...It was obvious I had to go to work. But with all these new duties and two small children under my wing, what could I do? There was a labor shortage. Sure. But was it so bad that some desperate employer would pay handsomely for two hours of a frazzled female’s time after a hard day? Shall we say, fifty dollars a week?”World War II was a tipping point for social change in America. With their men at war, nineteen million women joined the work force. Radio, the first instantaneous mass medium, provided daytime serial drama, entertainment and news, including pronouncements of world leaders and terrifying war reports, as President Roosevelt used the new medium to rally the nation to arms and win the war..Alice Green’s lost and recently found eyewitness accounts of her childhood, her own war, the Golden Years of Radio and the postwar housing shortage are told from the light-hearted viewpoint of a shy, youngest child, who learns she can make even the stormy and outrageous characters in her own family laugh. With a little help from her son, who (just barely) escaped this madhouse to finish it, her story stands for unsung American women in war and survives as Alice’s triumphPRAISE FOR PETER GREEN’S FIRST WORLD WAR II BIOGRAPHY“Dad's War With The United States Marines is very highly recommended to all general readers and a welcome addition to the growing library of military memoirs and biographies.” \t–James A. Cox, Midwest Book Review Re-issued in 2014 as THE EDITION REFERENCED BELOWCOMPANION VOLUME BEN’S WAR WITH THE U.S.MARINES \t By Peter H. Green Greenskills Press, St. Louis, 2014",
  "genres": [],
  "author": "Alice H. Green",
  "average_rating": "4.50",
  "url": "https://www.goodreads.com/book/show/32938864-radio"
}