{
  "title": "Idiot: Beating \"The Curse\" and Enjoying the Game of Life",
  "description": "Dear Baseball Fan:I know what you’re thinking: Couldn’t he have come up with a better title? My mother agrees with you, but unfortunately Genius just doesn’t have the same ring.Let’s get something straight right away. I may be an idiot, but I’ve tried to do more in this book than just revisit the Red Sox’s Miracle Season. I want to give you a sense of what it’s like to grow up with baseball dreams, to spend long years climbing the ladder, and then over the course of three years to see the building blocks of those dreams fall into place.In this book, you’ll be reading about the son of an Army staff sergeant—a thrill-seeking Orlando kid who at age thirteen was gifted with a man’s body, including rare speed and reflexes. It was some straight talk from my brother that kept me from abandoning that talent, which led to my eventually catching on with the Kansas City Royals and later the Oakland A’s.Starting in 2002 with the Red Sox, I got to see what can happen when a determined front office decides to roll the dice and acquire players who, like me, leave the thinking out of it—who trust their instincts and play team baseball.Forget what you’ve read about the posse of long-haired rebels who eventually made up the 2004 Red Sox. I'll give you the straight dope, including who's got the biggest mouth (hint: his first name is Kevin); what Pedro Martinez was doing all those times when you couldn’t find him on the bench; what game David Ortiz should never play; and why I sometimes question Curt Schilling’s sanity. Memo to Curt: the statue of you is being erected.What’s it like being responsible for the hopes of millions? In the fall of 2004 my teammates and I got to find out. What I’ve tried to do in these pages is bring you inside, show you the black humor that erupted when it seemed we could do nothing right, and the immense joy that followed when 25 guys took turns picking each other up, and by sheer force of will reached baseball’s summit.Red Sox Nation (both natives and new arrivals), this one’s for you.—Johnny Damon, #18From the Trade Paperback edition.",
  "genres": [
    "Sports",
    "Baseball",
    "Biography",
    "Nonfiction",
    "Memoir",
    "Autobiography"
  ],
  "author": "Johnny Damon",
  "average_rating": "2.88",
  "url": "https://www.goodreads.com/book/show/329386.Idiot"
}