{
  "title": "The French and Indian War: Deciding the Fate of North America",
  "description": "In the summer of 1754, deep in the wilderness of western Pennsylvania, a very young George Washington suffered his first military defeat, and a centuries-old feud between Great Britain and France was rekindled. The war that followed would decide the fate of the entire North American continent—not just between Great Britain and France, but for the Spanish and Native Americans as well. Fought across virgin wilderness, from Nova Scotia to the forks of the Ohio River, the French and Indian War is best remembered for dogged frontier campaigns to capture such strategic linchpins as Forts Ticonderoga, Duquesne, and Niagara; legendary treks by Rogers' Rangers; and the momentous battle of Quebec on the Plains of Abraham. Here are the stories of Jeffery Amherst, the loyal soldier who did his king's bidding at the expense of his home and family; the marquis de Montcalm, Canada's champion who had to fight his own governor as well as the British; and William Pitt, the man who brashly proclaimed that only he could save England. We also encounter George Washington, Benjamin Franklin, William Shirley, Edward Braddock, and, of course, Major Robert Rogers, a legend misunderstood who stands both revered and damned. Against the backdrop of Fortress Louisbourg in Nova Scotia, the forests surrounding Lake George in upstate New York, the Caribbean, and the fall of Quebec, Borneman poses interesting what-if questions, examining controversies that continue to this Did the dashing Brigadier General James Wolfe frantically wave his hat to signal retreat or to urge his troops onward to victory? What if Spain had come to the aid of France sooner? What if the affable Lord Howe had lived? The French and Indian Deciding the Fate of North America presents the triumphs and tragedies of this epic struggle for a continent, placing them in the larger context of France and Great Britain's global conflict—what Samuel Eliot Morison called truly the first world war—and emphasizes that the seeds of discord sown in its aftermath would give root to the American Revolution.",
  "genres": [
    "History",
    "American History",
    "Nonfiction",
    "Military History",
    "War",
    "Military Fiction",
    "American"
  ],
  "author": "Walter R. Borneman",
  "average_rating": "3.99",
  "url": "https://www.goodreads.com/book/show/329424.The_French_and_Indian_War"
}