{
  "title": "The Stone Man and Other Weird Tales",
  "description": "The Stone Man and Other Weird Tales is a collection of seven short weird tales filled with cosmic and supernatural horrors, most occurring within the boundaries of the small town of Woodell, others happening elsewhere in everyday life.A summary of each story:The Stone Man — While hiking, a professor of geology stumbles upon a stack of stones in the Woodell River. Drawn in by their queer structure and out of place location, he's pulled in and doesn't leave the same. He soon discovers their creator, The Stone Man, and why he builds the strange structures. But what he finds out is more than just a man in the wilderness, so much more.Three Unseen Hours — A husband enticed by the night life stays out too late, discovering that what the people said in the Briswich County Psychiatric Institute were true... For the Unseen leave the sea after three o'clock.Hugo The Clown — A story of a child performer who is in the last steps of his plans to escape the suburbs, and the world. Through a hellish passageway in his cellar, he will be able to cross over from his reality, to theirs.Death Toll — What happens when a driver is stuck in summer traffic, and finds that the Death Toll Sign is no longer adding deaths, but subtracting them?The Shadow on the Belfry — A husband who enjoys looking out over Woodell each morning. He loves the sunken gabled roofs under the early fog, the mountainous backdrop, and the feeling of the crisp chill on his skin. But one morning, masked in the vapor, he discovers something not from his small town, nor from his planet.The Dark Butler — Someone buys a home, discovering that an entity cleans it for him. Dishes, washing clothes, and chores altogether become a thing of the past. But what happens when his curiosity gets the best of him? What happens when all he cares about is knowing what, or who, does these things? Doors, floors, and walls are torn out in his pursuit of The Dark Butler.Once Haunted — He's a writer from the Woodell Gazette, specializing in haunted houses. Every October, he pens \"The Haunted Review,\" an article rating haunts throughout the town and state. A coworker tips him off about a new haunt opening up in town in an unexpected location, and he finds it only opens once a year, on Halloween. Once Haunted is the one haunted house he wished he hadn't stepped foot in.",
  "genres": [
    "Horror",
    "Anthologies",
    "Short Stories",
    "Lovecraftian"
  ],
  "author": "Micah Castle",
  "average_rating": "3.66",
  "url": "https://www.goodreads.com/book/show/32943636-the-stone-man-and-other-weird-tales"
}