{
  "title": "Blood Broken",
  "description": "‘Our love could save us both. Or it could destroy everything.’  Leila McKay is both blessed and cursed. Her potent serryn powers are growing stronger, but they come with a heavy price. And to prove her love for vampire leader Caleb, she needs to bring his murdered brother Jake back to life. The only way is to cast a spell no one has dared to attempt before, that could tear apart the fabric of time itself…  But Caleb fears that treachery runs deep in Leila’s veins. Although the heat between them grows hotter by the second, Caleb’s past has left him with a hard heart and a mistrustful nature, and it was at her sister’s hands that Jake was killed… but with his brother’s life in the balance, giving in to his primal instincts is more tempting than ever.  Time is running out for Caleb. In a matter of hours, Jake will be past the point of and around them, all-out war rages in Blackthorn. With genetically modified lycans and vicious convicts roaming the streets, Sirius Throme at the Global Council has secret plans that threaten to devastate the whole district… and Leila is the only one powerful enough to save them all. But can Caleb really trust her?  With countless lives at stake, will Leila and Caleb’s fierce attraction be strong enough to see them through the ultimate test? Or in unleashing the darkness within, will they destroy everything they hold dear?   The explosive, action-packed conclusion to the utterly addictive Blackthorn series will leave fans of paranormal romance breathless. Blackthorn is an eight-book series with an overarching plot, so if you’re at the start of your Blackthorn journey, read BLOOD SHADOWS to discover how it all began…   Read what everyone’s saying about the Blackthorn   ‘I don’t think I have read such a finely executed dark PNR world before…This series truly surprised me. I didn’t think I would love it that much or be intrigued by it. I couldn’t stop thinking about these books once I was done with them… The world-building is spectacular. The characters are enthralling and addicting… Plain fabulousness.’ Gaga Over Books  ‘I am completely enthralled with this paranormal series. You get so wrapped up in the story and characters that you lose track of time… This is one of my favorite series so far this year!’ Paranormal Book Club  ‘This is a paranormal universe like none you have encountered before… There are stories that are so powerful, so intense that I do not believe anyone should warn you about what is to come… I truly do feel that if you love the Paranormal genre and have not yet discovered Lindsay J. Pryor or these novels then you need to read them, experience them firsthand.’ Keeper Bookshelf  ‘I am officially addicted to this series. Why, you ask? Because Lindsay Pryor is my kind of fearless author. She isn’t afraid to “go there”, to create characters and situations that challenge me as a reader.’The Demon Librarian  ‘Not only are Pryor’s characters and fathomlessly dark love stories fabulous, but her continual world building of Blackthorn blows me away.’ Gravetells.",
  "genres": [
    "Paranormal",
    "Paranormal Romance",
    "Fantasy",
    "Urban Fantasy",
    "Romance",
    "Vampires"
  ],
  "author": "Lindsay J. Pryor",
  "average_rating": "4.54",
  "url": "https://www.goodreads.com/book/show/32949272-blood-broken"
}