{
  "title": "Don't Hire a Software Developer Until You Read this Book: The software survival guide for tech startups & entrepreneurs",
  "description": "Would you like to get your own software product built and launched?   Find out what's involved, increase your know-how and decrease the risks, with this software survival guide for non-technical people!  Learn the things you need to know, and do launch your startup and succeed as a technical entrepreneur, broken down step-by-step. Discover how to: • Avoid the pitfalls and perils of software development. • Avoid wasting time and money, and making \"rookie mistakes\" when starting your tech business. • Interview and hire a software developer. • Manage the software development process like a pro!  This book will benefit you if: • You’re considering different ways to start, or grow a business and you’d like to know how to get a commercial software product built from scratch. • You want to know how to get a mobile app built and launched in the Google Play or Apple App Stores. • You want to create a web application such as a SaaS, (Software as a Service product) to serve customers online. • You’re a tech entrepreneur looking for tools and methods to help you manage your software projects more efficiently, with less issues, less delays, less risk and less waste!  Use the tips, tools, links, checklists, scripts and templates packed into this full-length \"handbook for creating software\", which will take you from your initial idea, right through to the launch of your software, and beyond. Some of the topics covered include market research, product development and prototyping, user testing, tech fundamentals, product pricing and revenue generation, managing your developer(s) and understanding how to improve productivity, basic sales and marketing, product testing, management, launching your product and taking care of your customers after you launch and more!  When starting a new business there can be a lot to consider.  For your convenience, this book covers a wide range of topics so you can start off by reading this one book to give you a grounding in what you need to know, and do, rather than loading up with a bus load of books on different subjects! The Introduction provided at the start of the book will help you get your bearings and explains the key topics covered in each chapter and what you can expect as you progress through the book. It will also explain how to access your free resources.  Don't go it alone - and don't hire a software developer until you read this book!  Are you ready? Here's to your success!",
  "genres": [
    "Business",
    "Entrepreneurship",
    "Technology",
    "Audiobook"
  ],
  "author": "K.N. Kukoyi",
  "average_rating": "4.12",
  "url": "https://www.goodreads.com/book/show/32945774-don-t-hire-a-software-developer-until-you-read-this-book"
}