{
  "title": "MEIN KAMPF Adolf Hitler",
  "description": "MEIN KAMPF Adolf Hitler exposed: Nazi salutes came from the USA's Pledge of Allegiance; Swastikas were \"S\" letters for \"SOCIALIST.\" This blood-drenched book offers eye-popping new analysis of Mein Kampf -1. Mein Kampf does not contain the word \"Nazi\" in any form. 2. Mein Kampf does not contain the phrase “Third Reich.”3. Mein Kampf does not contain the word \"Fascist\" ever as a self reference by Hitler.4. Mein Kampf does not contain a single use of the word \"swastika.\"5. Nazis did not call their symbol a \"swastika.\"6. Swastikas represented crossed \"S\" letters for \"SOCIALISTS\" under Adolf Hitler.7. Nazi salutes and Nazi behavior originated from the USA's Pledge of Allegiance to the flag.8. The Nazi salute came from the military salute (as used in the original Pledge of Allegiance in the USA).9. The word \"Fascist\" is related to the word \"faggot.\"10. Vienna, Austria (Hitler was born in Austria) is the origin of the word \"wiener.\"11. The word \"Kampf\" in Hitler's \"Mein Kampf\" is related to these words: campaign, champagne, champignon, champion, champ, camp, and campus.12. Learn about the socialist Wholecaust (of which the Holocaust was a part).13. The fascist salute was performed by public officials in the USA from 1892 through 1942. What happened to the photographs and films of the American fascist salute performed by federal, state, county, and local officials? Public officials in the USA who preceded the Adolf Hitler and the Benito Mussolini were sources for the stiff-armed salute (and robotic chanting) in those countries and other foreign countries.14. Explore how the \"ancient Roman salute\" myth originated from the city of Rome in the state of New York (not Italy), Francis Bellamy's hometown. Learn about Mussolini's strange gift to the city of Rome, NY: a statue of two human male infants suckling on a female wolf. That statue remains on display in Rome, NY.The author Micky Barnetti explores the work of the historian Dr. Rex Curry in jaw-dropping detail. Dr. Curry was the first to point out that Wikipedia (and other so-called sources, including all the news outlets that you pay attention to) cites no example of Hitler ever using the term \"Third Reich\" or \"Nazi\" or \"Fascist\" as a self-identifier in German or in any language. And yet Wakipedia (similar to all the news outlets that you have spent your entire life paying attention to) deceives users into believing that Hitler over-used the term \"Third Reich\" and \"Nazism\" and \"Fascism\" as a self-identifier for his dogma. Writers for Wakipedia (and its ilk) are the people who over-use those terms. They over-use those terms to hide the word that Hitler DID use: SOCIALISM.Barnetti reminds us of the history of robotic chanting en masse and on cue, accompanied by violence for anyone who refused to submit.Calling someone a fascist is the fastest way to shut someone up, defining their views as beyond the pale. But who are the real fascists in our midst? According to the author Micky Barnetti, the quintessential socialist isn't an SS storm trooper; it is a public school teacher brainwashing children every day for 12 years of their lives. The pledge remains the first fascist bullying that begins each day in government schools (socialist schools) in Police State USA.",
  "genres": [
    "Germany"
  ],
  "author": "Micky Barnetti",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/32949495-mein-kampf-adolf-hitler"
}