{
  "title": "Marked Box Set",
  "description": "This bundle includes all four books in the Marked Series and three never before seen outtakes. Discover all over again why so many are head over panties in love with Talan. Bonus: Cox's Sh*t List. Lance Kisses Ass. Simon Has A Question To Ask.  Marking Her (Marked #1 Series) Talan Cox wants to mark Maya--with more than his ink. The owner of a prominent tattoo shop, he's used to being hit on by easy women. Though \"easy\" is not a word associated with Maya when she comes in to support her friend. Flirtation ensues, but what will it take to break the painted man?  Marking Him (Marked #2 Series) The day Maya Owens walked into his tattoo shop, everything Talan knew changed. After officially starting a relationship, he is now having trouble managing Maya--a woman who consumes every part of his being and owns his heart. His need to control her and everything around her drives Maya insane, but he has good reason. After all, Janice is still lurking around and she has a vendetta against his Bitty.  Scars (#2.5 Marked Series)  Abandoned. Thrown away. Invisible.  Every single one of those could be used to describe me. They can tell you my story--my sad past--without a single syllable passing through my lips.  I hate them--those who lied to me. They claimed to love me, but in reality they used me when convenient. My parents. Sister. And now Talan. Loving them has left me empty.  Marked (Marked #3 Series)  \"With everything I am. I'll always be by your side.\"  It was his truth.  A vow Talan made to the woman who owned him. Because that is what Maya did to him; she held his entire life in her hands. He lived for her smile...her happiness, and now someone has dimmed that light in her eyes with their malice.  How does a man so completely in love with his female react to seeing her in a hospital bed and broken?  He fights. Goes against all logic and seeks vengeance.",
  "genres": [
    "Contemporary Romance",
    "Anthologies"
  ],
  "author": "Elena M. Reyes",
  "average_rating": "4.46",
  "url": "https://www.goodreads.com/book/show/32956810-marked-box-set"
}