{
  "title": "Broken",
  "description": "The eagerly-awaited third book in the McIntyre Security, Inc. series is here!  \nLia McIntyre\n  As a 22-year-old female professional bodyguard, Lia’s a rarity in a male-dominated field. She may be a petite, cute blond, but she’s a master of martial arts and Krav Maga, and she can render a man twice her size unconscious in just seconds. Lia hides a painful past behind a snarky, take-no-prisoners attitude. She was horribly betrayed by her first love, and she’s determined never to let anyone use her or hurt her again. To make sure that never happens again, she’s got rules. One, never sleep with a client. And two, never sleep with the same guy twice. The walls she’s built up to protect herself are rock solid. Until she meets her new client, Jonah Locke, a swoon-worthy rock star with a heart of gold.  \nJonah Locke\n  Jonah Locke is the front man for the most popular rock band in the United States. His band dominates the charts, and he’s constantly hounded by crowds of fan-girls and paparazzi. The guy can’t sneeze without everyone on social media knowing. A bad break-up with the Queen of Pop sends him from LA to Chicago, where he just wants to lie low and write new songs. Unfortunately, trouble follows him to Chicago. When he meets his new bodyguard, he falls hard for her. But lust transforms into something more when he gets to know the woman beneath the kick-ass shell.  Broken can be read standalone, but it will be enjoyed more as part of the series, because there are lots of cameos of other beloved McIntyre Security characters. HEA, yes! Cliffhanger, no! Read this book only if you like smart-mouthed, feisty heroines who don’t take crap from anyone.  The McIntyre Security, Inc. Series:  Book 1 – Vulnerable Book 2 – Fearless Book 3 – Broken",
  "genres": [
    "Romance",
    "Contemporary",
    "Music",
    "Romantic Suspense",
    "Contemporary Romance",
    "Forced Proximity",
    "Military Romance"
  ],
  "author": "April  Wilson",
  "average_rating": "4.41",
  "url": "https://www.goodreads.com/book/show/32952180-broken"
}