{
  "title": "Catalog and Other Cat Scratchings!",
  "description": "Catalog and Other Catscratchings! by Thomas E. ShafferThis little book is a series of short but connected compositions all falling within a single unifying, common category - Cats! My original, 1982 book titled Light and Dark had contained a fourteen page subsection I called \"Catalog\" . It consisted of a richly rhyme-ripened account of an amorous Tomcat and his major affairs and misadventures with some thirteen of his principal \"lady loves\" It was a fun collection both to write and to read to others and even came to briefly enjoy a limited existence as a small gift size booklet in the promotional service of its larger parental volume. In that capacity, it had a rather mixed measure of success. This was almost certainly due to an irrefutable fact about cats. Even in their most congenially conceived and sympathetically anthropomorphized imagined manifestations they still belong to that finically unique \"cat\" category. And it's a category which they are reluctant to share especially in any context involving the least degree of doggerel! Seriously though, within this small collection you'll encounter a quite varied offering of feminine felines Joyce with her golden Rolls Royce of a voice; Elaine who always seemed pooped and had whiskers that drooped as if they'd been in the rain; Jenny the jumping \"gymnat\" cat; Cleo, a crazy little Calico who proved that unlike a book you can tell a cat by its cover; and Louise, a Siamese whose oriental flea powder always made him sneeze, among others. In other, later penned cat poems found here you'll discover all the distinguishing differences between Chinese acupuncture and \"attack-you-puncture\" as practiced by the Siamese as well as the comparing of bathing practices by dogs and cats, and even learn from no less an authority than Professor Chessor Katz just why cats so rarely smile! And it all concludes with a prose piece about a strange kind of \"daydream\" involving a very curious conversation with Mark Twain.Thomas E. Shaffer first began writing short rhyming poems while working nights as an attendant in UCLA's hospital Emergency Room and attending classes as a psychology major. During this period he often found occasions to recite humorous little Ogden Nash rhymes lines for the amused edification of some of his coworkers. One day in late 1967 one these, a \"perverse-verse\" preferring Canadian nurse (and close friend) quite persuasively suggested he should have a go at writing his own poems.He took this advice and soon after started a steady and seemingly unstoppable flow of writings having highly varied tones, colors and content. When he later shared these there were soon constant and predictable requests for copies. Eventually he met and married a nurse and later became one himself. Early in the course of their lengthy courtship while apartment-living in San Francisco he and his wife acquired a couple of cats and soon became your familiar, hard core \"cat people\" Much of the content of this little book reflects this fact. Additional and more detailed \"bio info\" regarding this author is readily available at Amazon.com and at his online site at bookgamebitpress.com",
  "genres": [],
  "author": "Thomas E Shaffer",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/32978821-catalog-and-other-cat-scratchings"
}