{
  "title": "No Middle Name",
  "description": "No Middle Name: Jack Reacher, The Complete Collected Short Stories. Jack 'No Middle Name' Reacher, lone wolf, knight errant, ex military cop, lover of women, scourge of the wicked and righter of wrongs. No suitcase. No destination. No middle name. No matter how far Reacher travels off the beaten path, trouble always finds him. Feel bad for trouble. After leaving his job as a Military Police major, Reacher roams the United States taking odd jobs. He’ll arrive in town, come across someone who needs his help, solve a mystery and take out the bad guys, and then get on the next bus out of town. Reacher is never looking for trouble, but trouble always finds him. Contents: * Too Much Time / Novella by Lee Child: finds Reacher in a hollowed-out town in Maine, where he witnesses a random bag-snatching but sees much more than a simple crime. * Small Wars / Short story by Lee Child: back to 1989, when Reacher is an MP assigned to solve the brutal murder of a young officer found along an isolated forest road in Georgia, and whose killer may be hiding in plain sight. * Not a Drill / Short story by Lee Child: Reacher tries to take some downtime, but a pleasant hike in Maine turns into a walk on the wild side, and perhaps something far more sinister. * High Heat / Novella by Lee Child: time-hops to 1977, when Reacher is a teenager in sweltering New York City during a sudden blackout that awakens the dark side of the city that never sleeps. * Second Son / Short story by Lee Child: Okinawa is the setting, which reveals the pivotal moment when young Reacher’s sharp “lizard brain” becomes just as important as his muscle. * Deep Down / Reacher tracks down a spy by matching wits with four formidable females, three of whom are clean, but the fourth may prove fatal. * Guy Walks into a Bar / Short story by Lee Child * James Penney’s New Identity (2019) / Short story by Lee Child * Everyone Talks / Short story by Lee Child * The Picture of the Lonely Diner / Short story by Lee Child * Maybe They Have a Tradition / Short story by Lee Child * No Room at the Motel / Short story by Lee Child .",
  "genres": [
    "Thriller",
    "Fiction",
    "Mystery",
    "Short Stories",
    "Crime",
    "Action",
    "Mystery Thriller"
  ],
  "author": "Lee Child",
  "average_rating": "3.95",
  "url": "https://www.goodreads.com/book/show/32969083-no-middle-name"
}