{
  "title": "Freefall",
  "description": "An alien ship is orbiting Europa. A handful of astronauts must confront the threat, alone.\nDespite NASA budget cuts threating to put a sharp end to his career as an astronaut, British-born space shuttle pilot Jack Kildare knows without a doubt that his life will never be the same. Photographs snapped from the International Space Station reveal an alien spaceship in orbit around Europa, opening a terrifying new chapter in human history, and Jack finds himself in the center of a gigantic international effort to respond to the alien threat.But when he is dismissed from NASA over a trumped-up security gaffe, Jack and his close friend Oliver Meeks combine their skills in an attempt to generate an innovative new development: a spaceship drive based on their observations of the alien craft's technology. With the unknown threat driving international competition and the entire planet's spaceflight resources thrown into the fray, the focus of attention turns toward one single goal… a ship capable of traveling to Jupiter to confront the alien menace… the Spirit of Destiny. Amid unknown entities pushing to destroy the project from the inside out, and enemies baying for blood, Jack finds himself submerged in a world of secrets, sabotage attempts and cold-blooded murder.Can Jack decode the secrets surrounding the arrival of the alien spaceship in our solar system? Or will his dreams of the ultimate space adventure be taken into the ashes with the Spirit of Destiny? ABOUT FREEFALL: Freefall is the first book of a fast-paced trilogy of technothrillers. It contains hard science fiction elements in the tradition of The Martian and other science-based thrillers. You won't need a calculator to follow the story, but if you'd like to build a spaceship to the Spirit of Destiny's specifications, it really will take you to Jupiter! ($300 billion budget not included.) \nLifeboat, the second book in the Earth's Last Gambit Trilogy, will be published soon.",
  "genres": [
    "Science Fiction",
    "Fiction",
    "Audiobook",
    "Aliens"
  ],
  "author": "Felix R. Savage",
  "average_rating": "3.89",
  "url": "https://www.goodreads.com/book/show/32977985-freefall"
}