{
  "title": "Critique and Crises: Enlightenment and the Pathogenesis of Modern Society",
  "description": "Critique and Crisis established Reinhart Koselleck's reputation as the most important German intellectual historian of the postwar period. This first English translation of Koselleck's tour de force demonstrates a chronological breadth, a philosophical depth, and an originality which are hardly equalled in any scholarly domain. It is a history of the Enlightenment in miniature, fundamental to our understanding of that period and its consequences. Like Tocqueville, Koselleck views Enlightenment intellectuals as an uprooted, unrealistic group of onlookers who sowed the seeds of the modern political tensions that first flowered in the French Revolution. He argues that it was the split that developed between state and society during the Enlightenment that fostered the emergence of this intellectual elite divorced from the realities of politics. Koselleck describes how this disjunction between political authority proper and its subjects led to private spheres that later became centers of moral authority and, eventually, models for political society that took little or no notice of the constraints under which politicians must inevitably work. In this way progressive bourgeois philosophy, which seemed to offer the promise of a unified and peaceful world, in fact produced just the opposite. The book provides a wealth of examples drawn from all of Europe to illustrate the still relevant message that we evade the constraints and the necessities of the political realm at our own risk. Critique and Crisis is included in the series Studies in Contemporary German Social Thought, edited by Thomas McCarthy.",
  "genres": [
    "History",
    "Philosophy",
    "Nonfiction",
    "Politics",
    "Sociology",
    "Theory",
    "European History"
  ],
  "author": "Reinhart Koselleck",
  "average_rating": "4.16",
  "url": "https://www.goodreads.com/book/show/329805.Critique_and_Crises"
}