{
  "title": "The Draegan Lords",
  "description": "From best-selling gay-fiction author M.L. Rhodes......A hundred years ago, the high sorcerer of Velensperia launched a swift and deadly attack against the draegans--a race of dragon shapeshifters who'd always lived in harmony with the humans. The draegans were all but destroyed, with the few who remained, scattered and in hiding. But after a century of cruel repression, a group of them have united and begun to fight back. Their leader, Keiran Hareldson, is determined to free his people from the high sorcerer's tyranny. Gaige Rizik is captain of the sorcerer's High Guard, and known for his lethal ability to hunt down his prey with no remorse. His orders are to infiltrate the draegan rebels' camp, learn their plans, and identify their leader so he can be destroyed. But when Gaige joins the rebels, posing as a human sympathizer to the draegans' cause, he discovers the shapeshifters aren't the bloodthirsty beasts he's been led to believe, and their leader is a captivating man who only wants what's best for his people. Keiran sparks powerful emotions in Gaige, tearing down his walls of steely control, and stirring a longing in him he can't deny. The more deeply Gaige becomes entrenched with the draegans and their passionate leader, the more torn he becomes over his mission. No one, least of all him, expects him to fall in love with the very man he's sworn to kill. When he chooses to defect to the draegans' side, his betrayal to the sorcerer comes at a high personal cost. With the high sorcerer bent on annihilating every last draegan and all those who support them, a secret revealed from Keiran's past becomes their best hope for survival. From the deep forests of Velensperia to the ancient draegan stronghold of Kellesborne, only the strength of two determined men and their fierce love for one another stand between the people they protect and an evil conjured from the bowels of hel itself......Now merged together in one paperback volume, readers can enjoy the first two parts of The Draegan Lords series--True of Heart and Lords of Kellesborne.",
  "genres": [
    "Fantasy",
    "M M Romance",
    "Paranormal",
    "Dragons",
    "Shapeshifters",
    "M M Fantasy",
    "Paranormal Romance"
  ],
  "author": "M.L. Rhodes",
  "average_rating": "4.31",
  "url": "https://www.goodreads.com/book/show/3297417-the-draegan-lords"
}