{
  "title": "Wondering Sight",
  "description": "Sophia Westlake is an Extraordinary Seer, gifted with the ability to see past, present and future in Dreams and Visions. Her talent led to the destruction of the Caribbean pirates plaguing England’s shipping and gained her renown and the accolades of her peers. But when she accuses a prominent politician, Lord Endicott, of embezzling from the Army, her Dream is “proved” false and she is disgraced, her reputation ruined and her career in the Army’s War Office over.  Humiliated, Sophia returns to London, but Lord Endicott follows her, intent on making her life increasingly miserable. Furious and desperate, Sophia takes the only course left to her: she sets out to discover Lord Endicott’s criminal enterprises, to expose him as the fraud he is and bring him to justice.  Sophia’s allies are few, but loyal. Cecy, her best friend, supports Sophia in her quest, while her cousin Lady Daphne, an irrepressible Extraordinary Bounder, is always ready for a challenge that will strike at Lord Endicott’s heart. And always watching her is the mysterious Mr. Rutledge, who claims to be interested in Sophia’s friendship—and possibly more than that—but who has an agenda of his own.  But as Sophia delves deeper into prophetic Dreams, Cecy and Daphne begin to fear for Sophia’s health and sanity. Driven to collapse by her frequent Dreaming, Sophia is forced to reevaluate her motives: does she want Lord Endicott brought to justice, or is it revenge she seeks? As Sophia draws closer to the secret of Lord Endicott’s criminal enterprise, a counterfeiting ring, his torment of Sophia increases, until the two are bound together by their respective obsessions. Though Sophia insists she is in control, her friends fear she is turning into the man she most hates.  Sophia’s Dreams and Visions are leading her to just one place: the destruction of Lord Endicott. But the cost of her vengeance may be too high—and may demand the sacrifice of her own life.",
  "genres": [
    "Fantasy",
    "Romance",
    "Historical",
    "Historical Fiction",
    "Paranormal",
    "Regency",
    "Magic"
  ],
  "author": "Melissa McShane",
  "average_rating": "3.75",
  "url": "https://www.goodreads.com/book/show/32978677-wondering-sight"
}