{
  "title": "Parenting Isn't for Cowards: The 'You Can Do It' Guide for Hassled Parents from America's Best-Loved Family A dvocate",
  "description": "A DOSE OF CONFIDENCE FROM A SOURCE YOU TRUSTThis proven confidence builder will help parents of even the most difficult children find the fulfillment parenthood was intended to bring. Speaking both as a therapist and as a parent— and drawing on a landmark study of 35,000 patients—Dr. James Dobson helps parents...• Banish their guilt when kids are hard to raise• Troubleproof their days when children are young• Protect their sanity during a child’s adolescence• Restore their energy when they’re facing burnout• Enhance their relationships with their kidsWith more than one million copies sold, this is the book frustrated parents have been turning to for fifteen years.No one said it was going to be easy.Does your heart skip a beat when you think of all that could go wrong in the parenting years ahead? Anxiety is normal, but your worst fears don’t have to become reality. Speaking both as a therapist and as a parent—and drawing on a landmark study of thirty-five thousand patients—Dr. James Dobson helps you... Prevent child-rearing troubles before they happen Banish your guilt about hard-to-raise children Protect your sanity during a child’s adolescence Restore your energy when you’re facing burnout Enhance your relationships with your kidsWith more than one million copies sold, this confidence-building classic will help you experience the full joy of parenthood—and what may be the greatest sense of fulfillment you’ll ever know.Story Behind the BookThis book is intended as a celebration of parenthood. Today’s parents have had enough of groveling and self-condemnation. What we need now is a double dose of confidence in our ability to raise our children properly. We also need to consider the specific frustrations that prevent us from enjoying our kids while they’re young. There is a more satisfying way to raise children, as I believe the reader will see. And there is no better time than now to apply it. Our sons and daughters will be grown so quickly that these days at home together will be nothing but a distant memory. Let’s make the most of every moment.",
  "genres": [
    "Parenting",
    "Nonfiction",
    "Christian",
    "Family",
    "Counselling",
    "Self Help",
    "Christian Living"
  ],
  "author": "James C. Dobson",
  "average_rating": "3.82",
  "url": "https://www.goodreads.com/book/show/329772.Parenting_Isn_t_for_Cowards"
}