{
  "title": "No voy a pedirle a nadie que me crea",
  "description": "«No voy a pedirle a nadie que me crea», nos advierten con frecuencia los distintos narradores y personajes de esta historia, en la que lo corriente se transforma en un delirio sin que uno sepa muy bien cómo, en la que lo raro acaba siendo normal y en la que no podemos hacer otra cosa que reírnos, porque todo es hilarante, cotidiano y surrealista a la vez, como la vida misma.Todo empieza con un primo que ya de chico apuntaba maneras de estafador, y que ahora mete al protagonista –un mexicano que viaja a Barcelona acompañado de su novia para estudiar literatura, y que además se llama como el autor de la novela– en un lío monumental: un «negocio de alto nivel» que convierte su estancia en la ciudad en una especie de novela negra de humor también negro, una de esas que a él le gustaría escribir.Por estas páginas desfila una variopinta fauna de personajes impagables: mafiosos peligrosísimos –el licenciado, el Chucky, el chino–; una novia que se llama Valentina y que lee Los detectives salvajes y está al borde de la indigencia y no se entera de nada; una chica llamada Laia cuyo padre es un político corrupto de un partido nacionalista de derechas; un okupa italiano que se ha quedado sin perro; un pakistaní que simula vender cerveza para no levantar sospechas... Y para complicarlo todo un poco más aparece una segunda Laia, que es mossa d’esquadra y pelirroja; una perra que se llama Viridiana; una niña que recita versos de Alejandra Pizarnik y hasta la propia madre del protagonista, melodramática, orgullosa y chantajista como en una buena telenovela mexicana.Juan Pablo Villalobos escribe como actuaba Buster Keaton: te arranca la carcajada manteniéndose impávido, sin mover un músculo. En sus anteriores novelas ya había ido construyendo un mundo propio con personajes entrañables y excéntricos a los que les sucedían cosas extrañas y divertidísimas. Y ésta lo consagra como un escritor imprescindible. En ella, y a través de la odisea de un hombre normal que se ve envuelto en peripecias de lo más rocambolescas, nos habla de la realidad y la ficción, o sea de la importancia de la literatura en nuestras vidas, y del papel fundamental del humor.«Sus novelas son hilarantes porque tratan los asuntos más graves. Se expresa con la lucidez del que sabe que nos engañan. Villalobos –algo así como un Kurt Vonnegut en habla hispana– se aleja de los clichés con los que carga su tierra» (Miqui Otero, El Confidencial).«Villalobos ha encontrado un tono y un ritmo propios, que no se parecen a ningún otro en la narrativa mexicana actual. Hace reír con el absurdo y al hacerlo muestra el sinsentido del mundo» (Fernando García Ramírez, Letras Libres).«Villalobos es una especie de Proust en miniatura» (Publishers Weekly).«Pocos autores escriben con una exuberancia tan poética y nerviosa como la de Juan Pablo Villalobos» (The Big Issue).",
  "genres": [
    "Fiction",
    "Humor",
    "Novels",
    "Book Club",
    "Spanish Literature",
    "Literature",
    "Latino"
  ],
  "author": "Juan Pablo Villalobos",
  "average_rating": "4.11",
  "url": "https://www.goodreads.com/book/show/32998062-no-voy-a-pedirle-a-nadie-que-me-crea"
}