{
  "title": "Invasion Diary: A Dramatic Firsthand Account of the Allied Invasion of Italy",
  "description": "A dramatic and richly detailed chronicle of the Allied invasions of Sicily and Italy from one of America’s greatest war correspondents. Following the defeat of Axis forces in North Africa, Allied military strategists turned their attention to southern Italy. Winston Churchill famously described the region as the “soft underbelly of Europe,” and claimed that an invasion would pull German troops from the Eastern Front and help bring a swift end to the war.   On July 10, 1943, American and British forces invaded Sicily. Operation Husky brought the island under Allied control and hastened the downfall of Benito Mussolini, but more than one hundred thousand German and Italian troops managed to escape across the Strait of Medina. The “soft underbelly” of mainland Italy became, in the words of US Fifth Army commander Lt. Gen. Mark Clark, “a tough old gut.”   Less than a year after landing with the US Marines on Guadalcanal Island, journalist Richard Tregaskis joined the Allied forces in Sicily and Italy. Invasion Diary documents some of the fiercest fighting of World War II, from bombing runs over Rome to the defense of the Salerno beachhead against heavy artillery fire to the fall of Naples. In compelling and evocative prose, Tregaskis depicts the terror and excitement of life on the front lines and recounts his own harrowing brush with death when a chunk of German shrapnel pierced his helmet and shattered his skull.   An invaluable eyewitness account of two of the most crucial campaigns of the Second World War and a stirring tribute to the soldiers, pilots, surgeons, nurses, and ambulance drivers whose skill and courage carried the Allies to victory, Invasion Diary is a classic of war reportage and “required reading for all who want to know how armies fight” (Library Journal).  This ebook features an illustrated biography of Richard Tregaskis including rare images from the American Heritage Center at the University of Wyoming.",
  "genres": [
    "History",
    "World War II",
    "Nonfiction",
    "War",
    "Military History",
    "Biography",
    "Military Fiction"
  ],
  "author": "Richard Tregaskis",
  "average_rating": "4.27",
  "url": "https://www.goodreads.com/book/show/32995117-invasion-diary"
}