{
  "title": "Schooled to Obey: Lily's Training",
  "description": "Alternate Cover Edition: ASIN B016GYBBR4.My name is Lily Harper. I’ve been a governess for 8 years, but now my employer’s children are grown. I thought I’d have to find a position with another family, but Lady Montgomery offered to train me as her housekeeper.  Now my mother needs round-the-clock nursing care, and I may have to leave my post.  Once again, my mistress has a solution. But this time, there’s a price, and it’s one I’m not sure I can pay.  It seems that Lady Montgomery has certain unconventional needs. In return for her help, I am to fulfill those needs.  She has enlisted dashing and dominant Lord Harcourt to train me in how to serve.   My training will be shocking.  ...Sometimes it will be painful.  ....And always decadently, sinfully pleasurable.  It seems that despite my complete inexperience, I am a complete wanton. Lord Harcourt says my mistress will be very pleased.  ************* This 33,000 word erotic Victorian novella is the first book in a trilogy. Lily is a 26-year old governess whose charges have grown up. When Lady Montgomery decides to have Lily trained for some special duties, Alpha Male Lord Harcourt is just the Dom for the job. While Lily is being schooled in submission, her master discovers her to be an excellent student.  Warning: This novella contains seriously scorching content. Lily’s training includes bare-bottom spankings, spanked breasts, clamps, bondage, public nudity, oral sex, first time sex, anal sex, anal toys, Sapphic love, multiple orgasms, and more. Intended for mature readers, 18 and over.  Please note: Occasionally, Lily will be forcefully persuaded to try something new. She will also be punished when she breaks her master’s rules. Lily has consented to every aspect of her training, but she may also call a halt if things get too intense. When it feels so good, though, stopping is the last thing on her mind!  **************** Excerpt from the book: “My name is Lord Harcourt. You will call me Sir. You will do exactly as I say. If you do, we shall get along splendidly. If you disobey me, I shall be forced to punish you. Do you understand?”  I didn’t really, but sensed it would be inappropriate to do other than nod my agreement.  He said in a surprisingly gentle voice, “Step closer to me. Closer. That’s right, Lily. Now, raise your arms above your head, and clasp your hands together. Do not move from that position until I tell you, do you understand?”  He waited for my reaction. Without looking him in the eyes, I slowly complied, a blush staining my cheeks all the while. I felt like a mare on display. A mare in heat, that is. For all the while, wetness continued to drip steadily down my thighs, generated by my reaction to the mysterious cantharides.  The helpless sensation I felt at standing obediently before a stranger made me feel weak and shivery in my private parts.  Lady Montgomery and Emily watched in rapt silence as Lord Harcourt knelt and slid his hands underneath my skirts. His strong hands gripped my pantalettes and shockingly, he ripped the fabric, splitting it down the middle. Before I could react, his hands settled on the bare legs he uncovered and began to slide slowly up my thighs.  At the first touch of his warm, slightly roughened hands on my skin, the fire inside me blazed hotly. I threw my head back and cried out. I did not lower my hands, though.",
  "genres": [
    "BDSM",
    "Erotica",
    "M F Romance"
  ],
  "author": "Devi Ansevi",
  "average_rating": "3.74",
  "url": "https://www.goodreads.com/book/show/32998917-schooled-to-obey"
}