{
  "title": "Rick Mears: Thanks: The Story of Rick Mears and the Mears Gang",
  "description": "Through the eighties and into the early nineties he was known as the King of the Speedways and the maestro of the Indianapolis Motor Speedway. Rick Mears won four Indianapolis 500s between 1979-1991 as well as three CART Indy car championships before retiring at the end of 1992 when he realized that a series of injuries had conspired to reduce his ability to operate at the maximum and to enjoy his sport to the fullest. Mears is one of very few great sportsmen who retired at the height of his career in the immediate aftermath of some of his greatest performances.   Equally, when Rick stepped out of the cockpit he enjoyed a superlative reputation as one of the cleanest, most sportsmanlike race car drivers the world has ever known. “He was very polished,” says Mario Andretti in the book’s Prologue. “He was probably one of the most correct drivers out there to race against. I always had the greatest respect for Rick Mears.”  Rick’s story begins in Kansas in the post-WWII years where his mom and dad, Skip and Bill, were born and raised. Bill was an auto mechanic who loved to race and with his young wife’s complete support Bill became a very successful, weekend short track racer across Kansas and Oklahoma before migrating west to California in 1955 and settling in Bakersfield with his young family. Pretty soon, Skip and Bill’s sons, Roger and Rick, were racing; older brother Roger in stock cars and Rick on motorcycles. Bill supported their passion wholeheartedly, providing the motivation, shop, equipment and know-how to build his boys race cars and in the early seventies the ‘Mears Gang’ –as they became known †seriously made their mark in Southern California sprint buggy and off-road racing. Both of them also tackled Pike’s Peak and won. Roger and Rick had different driving styles and personalities. Roger was an aggressive racer, like his father had been, while Rick was more laid-back, more analytical. Neither of them dreamed of becoming serious, professional racers, but in 1976 Rick got his big break thanks to safety equipment man Bill Simpson who gave Rick his first Indy car ride. Simpson saw the rare talent Rick possessed and got Mears’ Indy car career rolling before handing his contract with Rick over to Roger Penske at no cost in the fall of 1977.   Rick became a Penske driver in 1978 and scored his first win in his third race with the team. He went on to win the 1979 Indy 500 and CART championship and establish an enduring relationship with Penske that lasted through and beyond his retirement from driving at the end of 1992. Ultimately, he won four Indy 500s (equalling the record set by A.J. Foyt and Al Unser), three CART championships and twenty-nine Indy car races, and was admired and respected not only as a superb driver and racer but as a rare gentleman on and off the track.   Meanwhile, brother Roger went on to race Indy cars for a few years before focusing his career on off-road racing where he was an extremely successful owner/driver. And the ‘Mears Gang’ tradition carries on today with Roger’s son Casey racing in NASCAR’s Sprint Cup series with the all-powerful Hendrick Motorsports Team where he’s teamed with Jeff Gordon, Jimmie Johnson and Dale Earnhardt Jr.    In ‘Rick Mears • Thanks’, veteran racing writer Gordon Kirby, the U.S. editor of Motor Sport, tells the whole story of Rocket Rick Mears and the Mears Gang’s journey from dirt tracks to superspeedways. And the book also shows us how a sportsman or woman should behave as a professional and as a human being.  Enjoy the read and the ride.",
  "genres": [],
  "author": "Gordon Kirby",
  "average_rating": "4.55",
  "url": "https://www.goodreads.com/book/show/3298418-rick-mears"
}