{
  "title": "Star Realms: Rescue Run",
  "description": "Since being court-martialed by the Star Empire, smuggler and thief Joan Shengtu has done what she needed to do in order to survive—gaining a reputation along the way. When a new client’s mission goes sideways, Joan finds herself caught in the middle of dueling gambits between the Star Empire and the Trade Federation. Recruited to perform the heist of a lifetime, the fate of the Star Empire rests in her hands.  On the opposite side of the galaxy, Regency BioTech manager Dario Anazao sees an unsustainable situation brewing that promises a full-scale revolution. The megacorporations of the Trade Federation have kept the population in horrible working conditions, violating their human rights. With no one else to help, Dario must take it upon himself to rescue the workers of Mars.  Can two heroes from warring factions come together to make a difference in the galaxy?  Star Realms: Rescue Run is the first novelization of the critically acclaimed Star Realms spaceship combat deckbuilding game. You can check out the game here: http://www.starrealms.com.  “I’ve long been a big fan of epic science fiction and space opera. I think Jon’s entry into this realm is an excellent and compelling read. Fans of the Star Realms deckbuilding game will appreciate this look into the Star Realms universe, with its fast-paced story and intriguing characters. From his strong female lead to her amusing AI, I think Star Realms fans and sci-fi fans in general will be eager for Jon to write a sequel.” —Darwin Kastle, Star Realms creator  “Jon Del Arroz is a promising new writer with a knack for story and an interesting voice.” —Jody Lynn Nye, author of the Wolfe Pack series  “This game-related novel is a lively, action-filled tale that should appeal to those who want a space adventure romp with intrigue and a touch of romance. A disgraced ex-military thief, the thief’s snide former shipmate, a special operative who isn’t that good with guns, and the resentful son of an arrogant corporate executive attempt an impossible mission... and there’s a humorously glitched portable AI in the mix, too, breaking into song at odd moments.” —Elizabeth Moon, author of the Paksenarrion novels",
  "genres": [
    "Science Fiction",
    "Fiction",
    "Space Opera",
    "Games"
  ],
  "author": "Jon Del Arroz",
  "average_rating": "3.77",
  "url": "https://www.goodreads.com/book/show/32980868-star-realms"
}