{
  "title": "Walking with Zombies",
  "description": "Ladies and Gentlemen, welcome to the Stockholm Club.Have we got a special treat for you tonight! We’re privileged to have with us, a highly talented county and western singer, all the way from exotic Birmingham. I know that you’ll give the lad a fantastic Yorkshire welcome.Don’t forget, the first drink is on the house.Now before all you geriatric parasites slouch over to the bar and start making your way through my alcohol, I’d just also like to mention that there is a chance that some of my staff may turn into flesh eating zombies as the night wears on.In fact, I think I can confidently predict that most of you will resemble jackal stripped zebra carcasses before the dawn sun makes an appearance.So please enjoy tonight’s live entertainment and drink like there’s no tomorrow. Let’s face it; you ain’t going to be seeing it.--------------------------------------------------------------Despite attempts to quarantine the Breakspear housing estate, the infection has somehow spread further into the city. Whole neighbourhoods are falling to the undead plague.On the outskirts, the staff and customers of the Stockholm Club have no idea that the moaning dead are slowly shambling towards them.Praise for Walking with zombies.-----------------------------------------------All in all, this is a solid story, tight, well-paced and cements Woodhead as one of the most exciting zombie novelists in the country - Sean T Page. Author of The Official Zombie handbook (UK)Squeamish people should steer clear. The characters are well developed and well written, Mr. Woodhead is able to bring characters that don't fit the usual zombie thriller stereotypes with a practiced ease – Robert DeCoteau. Author of The New The First SonThe incredible attention Mr. Woodhead pays to expressing his characters internal thoughts and emotions is impressive – Sara Beverage. Owner of Zombiefiend.comThis story is the second volume in the Zombie Armageddon series that started with The Unwashed Dead.The third volume, Infected Bodies, is now available.",
  "genres": [
    "Zombies",
    "Horror",
    "Fiction"
  ],
  "author": "Ian Woodhead",
  "average_rating": "4.10",
  "url": "https://www.goodreads.com/book/show/12011477-walking-with-zombies"
}