{
  "title": "The Dragon Boy",
  "description": "Orphaned twice by the time he was nine, he was living on the streets and did not even know his own name.  He was not allowed to set foot inside the one place he was determined to find work.  To complete the disaster of his young life, the object of his affections was Star, an immense, emerald-green dragon.  But good fortune finally smiled upon him: Star was a Luck Dragon.  Unexpectedly, he was admitted as a barn boy into the elite Dragon Compound.  He was given three warm meals a day, work, and even a name.           Accepted by some, reviled by others, the boy is nicknamed Straw.  His days are a mix of welcome work and staving off the aggressive attacks of those who believe he does not belong there.  Then one day he discovers that the aloof dragon oddly pays particular attention to him alone, and once this becomes recognized by the others, this raises the boy to new responsibility. With the dragon suddenly under his daily care, the boy discovers that Star can speak in ways that only he can understand.  Star reveals to him dragon lore long forgotten to the world, and offers to train the boy in the ways of the warrior.  Straw discovers that although an orphan, he descends from a long line of dragon keepers and has taken his rightful place caring for Star, although this is something he can neither prove nor ever tell the others.  In this way, the boy enters into a secret apprenticeship under the careful guidance of the dragon. Years pass and, unknown to the rest, Straw is trained in the ways of a knight.  Then one day, an army descends on the Dragon Compound, demanding a battle to the death between Star and their warrior king.  A disaster would ensue were the otherwise gentle Star to be goaded to engage in battle.  This would result in his abandoning the kingdom.  When the knights of the realm fail in a tournament to curb the intentions of the warrior king, the dragon turns to Straw as his guardian to defend him.  Straw, too young and inexperienced to openly challenge the king, meets him in the stables and provokes him into a fight in which the boy thrashes the far more experienced warrior.Soon after this, Straw’s training with Star is accidentally discovered.  He is accused of inciting to battle the otherwise peaceful dragon, a state which the peace of the kingdom depends.  Disgraced, Straw is banished from the Dragon Compound and the kingdom.  However, before leaving, Straw receives all he needs to become a wandering knight: a horse, a sword, armor, and a name.",
  "genres": [
    "Fantasy",
    "Dragons",
    "Childrens",
    "Middle Grade",
    "Young Adult"
  ],
  "author": "Donald Samson",
  "average_rating": "4.16",
  "url": "https://www.goodreads.com/book/show/3300553-the-dragon-boy"
}