{
  "title": "Bound",
  "description": "Tiger-shifter Lord Bane Dunsaney released Nick Fairfax from the deal that bound the young man to his service for a year. Then Bane fled, afraid that the beast inside of him would harm Nick if he stayed. He never thought to see Nick again.  Little did Bane know, Nick has chosen to stay at his estate, Moon Shadow, to await the return of the lord who has his heart.  But can lasting love survive when there are tiger-sized secrets between them?  Book 2 of our modern, M/M retelling of Beauty & The Beast.  Cursed: Bound is the second part of a 3-book series. Part 3 is coming out in 2017.  After fleeing his uncontrollable attraction to Nick, Bane never dreamed that Nick would be in his life again. But when the billionaire returns to his estate, he finds Nick waiting for him with open arms.  Bane realizes he has a second chance with Nick. To be worthy of him, Bane wants to become a better man, but their developing romance is overshadowed by his most dangerous secret: Bane is a cursed tiger-shifter, and the beast stirs every time they start to become intimate.  Bane is disturbed by how the tiger wants Nick as a mate, but he finds himself unable to control his possessiveness, especially as Nick ventures out of Moon Shadow and sees the darker aspects of Bane’s life.  And, as a man deeply betrayed by his own father, Bane struggles to understand why Nick won’t abandon the family who treated him so badly…  Cursed: Bound ends on a cliff-hanger, which will be resolved in Book 3, Cursed: Beloved (2017.) Check updates on the series progress here: http://welcome.raythereign.com/catego...  Raythe Reign produces escapist, romantic M/M shifter, fantasy, scifi, adventure, and urban fantasy books and graphic novels.    Other Gay Paranormal & Urban Fantasy Series by X. Aratare:   Cursed: Smoke is a 20,000 word alternate version of the start of Nick & Bane's romance... in a sugar-daddy gay club! It's an alternate timeline and can be read and enjoyed on its own.  Get it FREE here: http://welcome.raythereign.com/free-s...   The Merman Series  The Merman is a 5-book gay paranormal romance series, containing psychic powers, a mostly-naked merman lover, an evil scientist, and true love beneath the waves.  Book 1, Transformation, is free and available on Amazon here: https://www.amazon.com/Transformation...   The Artifact Series  The Artifact is an M/M detective romance series. The books feature some beloved tropes of both the M/M and bodyguard romance genres! There's a hot bodyguard, his determined young client, an ancient golden sarcophagus, an evil cult, and unsolved mysteries in both their pasts...  Book 2 came out in spring 2016. People who love this series really love it. Check out the first 2 books here:  The Bodyguard Book 1 (Artifact Series): https://www.amazon.com/Bodyguard-Book...  The Bodyguard Book 2 (Artifact Series): https://www.amazon.com/Bodyguard-Book...     About Raythe Reign  Raythe Reign produces mostly M/M works following the classic advice - write what you most want to read! As a result, our stories are works",
  "genres": [
    "M M Romance",
    "Romance",
    "Paranormal",
    "Shapeshifters",
    "Audiobook",
    "Fantasy",
    "Magic"
  ],
  "author": "X. Aratare",
  "average_rating": "4.06",
  "url": "https://www.goodreads.com/book/show/33005574-bound"
}