{
  "title": "The Biography of Abu Bakr as-Siddeeq",
  "description": "\"From the day he embraced Islam until the day he died, Abu Bakr as-Siddiq (May Allah be pleased with him) was the ideal Muslim, surpassing all other Companions in every sphere of life. During the Prophet's lifetime, Abu Bakr was an exemplary soldier on the battlefield; upon the Prophet's death, Abu Bakr remained steadfast and, through the help of Allah, held this nation together. When others suggested keeping Usamah's army back, Abu Bakr insisted—and correctly so—that the army should continue the mission which the Prophet had in mind. When people refused to pay Zakat, and when the apostates threatened the stability of the Muslim nation, Abu Bakr was the one who remained firm and took decisive action against them. These are just some of the examples of Abu Bakr's many wonderful achievements throughout his life. I have endeavored to describe all of the above in a clear and organized manner. But more so than anything else, I have tried to show how Abu Bakr's methodology as a Muslim and as a ruler helped establish the foundations of a strong, stable, and prosperous country—one that began in Al-Madeenah, extended throughout the Arabian Peninsula, and then reached far—off lands outside of Arabia.Throughout the brief period of his caliphate (about 2 years), Abu Bakr as-Siddiq faced both internal and external challenges; the former mainly involved quelling the apostate factions of Arabia and establishing justice and peace among the citizens of the Muslim nation; and the latter mainly involved expanding the borders of the Muslim nation by spreading the message of Islam to foreign nations and conquering those nations that stood in the way of the propagation of Islam.During the era of his caliphate, Abu Bakr as-Siddiq sent out armies that achieved important conquests; for example, under the command of Khalid ibn al-Waleed the Muslim army gained an important victory in Iraq. And the Muslim army achieved other important victories under the commands of al-Muthannah ibn Harithah and al-Qa'qa ibn 'Amr . In short, the victories achieved during the era of Abu Bakr's caliphate paved the way for victories that later took place after Abu Bakr's death. I have tried to analyze the above-mentioned conquests and to break down the reasons why they were such monumental successes. I particularly pointed out Abu Bakr's contributions to those conquests: His military strategy, the leaders he chose, the letters through which he communicated with them, and so on.\"—Ali Muhammad as-Sallabi",
  "genres": [
    "Islam",
    "Biography",
    "Religion",
    "History",
    "Nonfiction",
    "Historical"
  ],
  "author": "Ali Muhammad As-Sallabi",
  "average_rating": "4.43",
  "url": "https://www.goodreads.com/book/show/3301073-the-biography-of-abu-bakr-as-siddeeq"
}