{
  "title": "Half of the Human Race",
  "description": "London. In the sweltering summer of 1911, the streets ring to the cheers for a new king's coronation, and to the cries of suffragist women marching for the vote. One of them is twenty-one-year-old Connie Callaway, daughter of a middle-class Islington family fallen on hard times since the death of her father. Forced to abandon her dream of a medical career, Connie is now faced with another hard choice - to maintain lawful protest against an intransigent government or to join the glass-breaking militants in 'the greatest cause the world has ever known'. Holidaying with her family on the South Coast, Connie is introduced to Will Maitland, cricketer and rising star of his county. Despite their mutual attraction, they part on unfriendly terms, she dismayed by his innate chauvinism, he astonished by her outspokenness. Yet they are destined to meet again, their lives inextricably entangled in the fate of Will's friend and idol Andrew Tamburlain, 'The Great Tam', a former Test batsman whose legendary big hitting was once the toast of the nation. Duty plays a commanding part in the life of these two young people, whose love for one another, in a different time, might have bound them in matrimony. But Connie, fired up by the possibilities of independence, wants more than the conventional comforts of marriage; and Will, a son of his age and class, is both attracted and appalled by her quest for self-fulfilment. Buffeted and spun by choice and chance, the two remain tied together, even as the outbreak of war drives them further apart. Combining national drama and private tragedy, \"Half of The Human Race\" is a book about men and women and their difficulties in understanding each other at a turning-point in history. It is a deeply affecting story of love, sacrifice, suffrage and county cricket, projected against a vivid backdrop of England in an extraordinary age of turmoil and violence.",
  "genres": [
    "Historical Fiction",
    "Historical",
    "Fiction",
    "Book Club",
    "Feminism",
    "War",
    "British Literature"
  ],
  "author": "Anthony   Quinn",
  "average_rating": "3.85",
  "url": "https://www.goodreads.com/book/show/10209923-half-of-the-human-race"
}