{
  "title": "Delirious",
  "description": "As one of Hollywood’s hottest producers, Kristian Bowen is on top of the world. With the Quantum team is fresh off a clean sweep of awards season and looking ahead to the premiere of their new film, Insidious, Kristian's life is exactly how he likes it, complete with a stable of willing subs to tend to his every desire. Until he attends the wedding of his friend and business partner Flynn Godfrey and meets Aileen Gifford, the close friend of Flynn’s new wife, Natalie. Since meeting Aileen five months ago, Kristian’s carefully cultivated life has changed in ways he never could’ve expected. Now Aileen and her children are moving to Los Angeles, and he’s not sure whether to be excited or terrified about his powerful feelings for the single mom…Aileen is coming off the worst year of her life, spent battling breast cancer while taking care of two young children. When Natalie, Flynn and their other friends encourage Aileen to move to LA and work for Quantum, she jumps at the chance to give her family a fresh start. And with her off-the-charts attraction to Flynn’s business partner in the mix, the idea of living in LA becomes that much sweeter. Until everyone shows up to welcome her and the kids to their new home in LA — except Kristian. He can’t avoid her forever, and when these two finally see each other again, sparks fly between the single mom and the producer with a past he’s kept hidden from everyone who matters to him. When that past rears its ugly head, will he run away from the woman he loves or turn to her for comfort in the storm? And will she prevail in convincing him that he can be himself, in every possible way, with her? Kristian and Aileen’s long-awaited story is full of heat, heart and humor, as well as appearances from all the Quantum characters readers love!",
  "genres": [
    "Romance",
    "BDSM",
    "Contemporary",
    "Contemporary Romance",
    "Erotica",
    "Audiobook",
    "Friends To Lovers"
  ],
  "author": "M.S. Force",
  "average_rating": "4.42",
  "url": "https://www.goodreads.com/book/show/33009172-delirious"
}