{
  "title": "Freaky Weird Erotic Stories of the Other Kind",
  "description": "Three depraved erotic paranormal stories that will take you to a state of horny horror and make you want to scream.HAUNTED HAYRIDE MECome. Discover the source of an unlikely cure that heals a flesh-eating monster from the inside and out… Kai is a zombie. He eats. He walks. He eats some more. Food doesn’t seem to be a problem for him, and is always paired with the lustful screams of a woman. Follow Zombie Kai in his quest to satisfy an insatiable appetite that has both women and men dropping their drawers at the haunted hayride event of a small town. Warning: this story contains nearly 12,000 words of Z/F, M/Z, M/F. Includes oral, vaginal, oral, anal, squirting, excessive masturbation and oral. Did I say oral?DOUGH BOY the PRISON BITCHThrown into the slammer for a crime he didn’t commit, Phillmore, an innocent dough boy from Sugarnuts finds himself in the 50th sector of Greyville where humans rule. Knowing little of their ways, he experiences firsthand the pleasures of sinfully delicious sex that leads him from prison bitch to superhero in a creamy adventure of sexually satisfying self-discovery. This fantasy niche-erotic tale is approx. 12,000 words of cream filled, pastry fun, with M/Dough, F/Dough, and Dough/Dough, including: voyeurism, vaginal, anal, and oral sex, between consenting adults of human and dough origins. Please, be advised: This is not your Mama’s dough boy, but it is a popping, fresh good time.MÉNAGE Á MANNEQUINOn the run from her abusive husband, Nicole is horrified when she discovers she’s trapped in a sportswear store infested with BDSM Mannequins. These hot-bodied life-sized man-dolls, attached to more-than-humanly-possible junk, are determined to bring out her inner nympho desires. This niche-erotic tale is 13,000 words of sizzling freaky explicit Mannequin M/M/F Ménage, including anal, oral, blowjobs, rough sex, delicious sports-themed sex games, and hot spanking fun. Throw in a little Tarantino action and you’ve got a mind-blowing good time. Definitely not for the faint of heart.",
  "genres": [],
  "author": "Dick's E. Chicks",
  "average_rating": "0.00",
  "url": "https://www.goodreads.com/book/show/33018901-freaky-weird-erotic-stories-of-the-other-kind"
}