{
  "title": "Journal Of A Trapper: Nine Years in the Rocky Mountains, 1834-1843",
  "description": "In 1834, Osborne Russell joined an expedition from Boston, under the direction of Nathaniel J. Wyeth, which proceeded to the Rocky Mountains to capitalise on the salmon and fur trade.  He would remain there, hunting, trapping, and living off the land, for the next nine years.  Journal of a Trapper is his remarkable account of that time as he developed into a seasoned veteran of the mountains and experienced trapper.  In Russell’s own words he explains to the reader “if you are in search of the travels of a classical and scientific tourist, please lay this volume down, and pass on, for this simply informs you what a trapper has seen and experienced. But if you wish to peruse a hunter’s rambles among the wild regions of the Rocky Mountains, please read this”.  Russell encounters grizzly bears, hunts buffalos, trades with Native Americans and suffers from the extreme conditions of his mountainous environment. His account is written in vivid prose that transports the reader to nineteenth century Northwest America.  Of particular note are his descriptions of the landscapes in which he lived. Although it had not been designated a national park during Russell’s time, his portrayal of Yellowstone is truly breath-taking.  This is the perfect book for anyone wishing to find out more about the lives of the mountain men, what they ate, how they hunted, what shelters they used and how they survived in some of the most inhospitable conditions.  After this book was written Osborne Russell became a politician who helped form the government of the state of Oregon. He was born in 1814 in Maine. He ran away from home as a young man for a life at sea, but eventually found employment as a trapper. In 1844, he was elected to the second Executive Committee of the Provisional Government of Oregon, but after he was not re-elected he eventually went and lived in California. He died in 1892. This edition was published in 1921.Excerpt:This journal ends so abruptly, with no hint of the personal fortunes of this most interesting author (who, by the way, was a great uncle of the writer of these explanatory notes), that we have gathered such information as we were able from surviving relatives, and append it hereto.",
  "genres": [
    "History",
    "Biography",
    "Adventure",
    "Nonfiction",
    "Westerns",
    "Historical",
    "American History"
  ],
  "author": "Osborne Russell",
  "average_rating": "3.84",
  "url": "https://www.goodreads.com/book/show/33013765-journal-of-a-trapper"
}