{
  "title": "Taken by Things - Taboo Humorous Erotica: 5-Book Mega Bundle",
  "description": "Five funny, juicy, HOT fantasies. What's not to like...?You'll laugh. You'll cry... Err...Okay, you might cry out with passion as you indulge yourself with these five juicy, ridiculously sexy stories. They'll definitely fuel your imagination for intimate, personal pleasure.What's inside this five-book mega bundle:Follow the weird and sexy adventures of a hot-and-horny vampire girl as she enjoys amorous encounters with a Greek god, a ghost, an enchanted tree, a billionaire biker mummy, and a time traveler. (This book also includes some graphic, almost-sex with a blue Venusian... a sizzling-hot encounter of the third kind.) Are these \"taboo sex\" topics? Only if your imagination takes you there. (You'll have plenty to work with in this collection of oddball sex partners.)The five full-length stories in this anthology:- Taken by the Sun God: Or, how sex with Apollo saved me from a terrible vampire death. (erotic fantasy)- Taken by the Ghost of Napoleon Bonaparte's Horny Little Brother, Jerome, at Niagara Falls. (paranormal erotica)- Taken on Earth Day by an Enchanted 17th Century Woodsman Temporarily Turned into a Tree. (green erotica)- Taken by the Bad Billionaire Biker Mummy: Or how I found ecstasy in the manly arms of Ramenhotep. (desert erotic parody)- Taken at Area 51: Or, how two well-equipped visitors from time and space changed my sex life. (alien erotica and sci-fi erotica)FOR MATURE READERS AGES 18 AND ABOVE.These books contain very graphic descriptions of sexual acts involving multiple orifices and positions. They also contain whimsical trivia related to sex, vampires, waterfalls, sex, 17th-century witches, desert travel, sex, Flesh Gordon, and -- oh yes -- did we mention sex?Maddie Montrose writes fun and juicy erotica to fuel your fantasies and enhance your personal pleasure. These books are written for smart women who like weird, intelligent, sexy stories that are hot... and funny.If you're looking for wild, weird, and adventurous sex in odd locations with unusual partners, you'll like these books.This volume is about 14,000 words long. It includes the full text of five separate books (available individually).Go ahead. Enjoy yourself. Lust and laughter in one juicy package... ready for your pleasure!",
  "genres": [],
  "author": "Maddie Montrose",
  "average_rating": "3.00",
  "url": "https://www.goodreads.com/book/show/33023138-taken-by-things---taboo-humorous-erotica"
}