{
  "title": "The Chronicles of Kerrigan: Box Set Books 1-6",
  "description": "The Chronicles of Kerrigan Box Set - Books #1-6 by USA Today WJ May  Book 1 - Rae of Hope   How hard do you have to shake the family tree to find the truth about the past?  Fifteen year-old Rae Kerrigan never really knew her family's history. Her mother & father died when she was young; it is only when she accepts a scholarship to the prestigious Guilder Boarding School in England that a mysterious family secret is revealed.  Will the sins of the father be the sins of the daughter?  As Rae struggles with new friends, a new school and a star-struck forbidden love, she must also face the ultimate challenge: receive a tattoo on her sixteenth birthday with specific powers that may bind her to an unspeakable darkness. It's up to Rae to undo the dark evil in her family's past and have a ray of hope for her future.   Book 2 - Dark Nebula   Nothing is as it seems anymore.  Leery from the horrifying incident at the end of her first year at Guilder Boarding School, Rae Kerrigan is determined to learn more about her new tattoo. Her expectations are high, an easy senior year and a happy reunion with Devon, the boy she’s not supposed to date. All hopes of happiness turn into shattered dreams the moment she steps back on campus.  Lies and secrets are everywhere, and a betrayal cuts Rae deeply. Among her conflicts and enemies, it appears as if her father is reaching out from beyond the grave to ruin her life. With no one to trust, Rae doesn’t know where or who to turn to for help.  Has her destiny been written? Or will she become the one thing she hates the most—her father’s prodigy.  Book 3 - House of Cards  Rae Kerrigan is three months away from graduating from Guilder Boarding school. She is now moonlighting as an operative for the Privy Council, a black ops division for British Intelligence. She’s given a mentor, Jennifer, who fights like a demon –fast, tough, and incredibly strong-willed. Rae finds a strange maternal bond with her. At the same time, she finds a new friend when Devon disappoints her once again.  Childhood memories surface and evoke hidden secrets she is determined to solve. When the Privy Council ask for her help, she finds a friend, and a link, to the Xavier Knights – another agency similar to the Privy Council. Through the mystery and secrets, she begins to question what the PC represents and where she stands.  Will she lose herself in the confusions of the past and present? What will it mean for her future?  Book 4 - Royal Tea The Queen of England has requested the help of the Privy Council. Someone is trying to kill her son’s fiancé. The HRH Prince plans to marry a commoner, and his bride has a secret no one knows but the Privy Council. She has a tatù. When the Privy Council turns to Rae for help, she can’t possibly say no; not even when they make Devon her partner for this assignment. They are to pose as a couple and work undercover, as bodyguards, to protect the soon to be Princess of Wales.  Rae would rather be anywhere but with Devon, especially since she believes her mother to be alive, despite the Privy Council’s assurances to the contrary. The question is, how can Rae find proof of life for her mother, come to terms with her feelings for Devon, and manage to save the Princess, all while dressed for tea?  When the enigma, the secrets and the skeletons in the closet begin to be exposed, can Rae handle the truth?  Book 5 - Under Fire Rae Kerrigan is determined to find her mother. No amount of convincing from Devon, or the Privy Council, is going to make her believe her mother is not alive, and Rae will stop at nothing to find her.  Torn between friendship and loyalty, Rae must also choose between Luke and Devon. She can’t continue to deny, or fool herself, any longer. The heart wants what the heart wants. Book 6 - End in Sight When life couldn't get anymore confusing, fate steps in and throws a curveball.",
  "genres": [
    "Fantasy",
    "Paranormal",
    "Young Adult",
    "Romance",
    "Amazon",
    "Fiction",
    "Urban Fantasy"
  ],
  "author": "W.J. May",
  "average_rating": "4.42",
  "url": "https://www.goodreads.com/book/show/33022782-the-chronicles-of-kerrigan"
}