{
  "title": "Accidentally Omega",
  "description": "Joey grew up as a pampered omega pup. That is until his first shift confirmed him as only a workaday sigma—and a gay one at that. After being kicked out of his birth pack, his life was literally saved by the new and different Rogue Pack. While he’s made peace with his status and revels in his cooking skills, he’s still haunted by the abuse and rejection he faced as a teenager. When a strange malady is diagnosed as being his first heat, he cannot believe he’s really an omega after all. It has to be a mistake, and he fears that when everyone realizes it, he will be ostracized once more.Liam is one of the pack’s gammas, the kind of shifter that everyone thinks is all muscle, no brain, and not much heart. When his childhood love was mated to another, he couldn’t handle the loss and turned feral. The Rogue Pack has given him a new purpose, but his devotion remains with the female he left behind. He has vowed to never mate, notwithstanding his inexplicable attraction to the alluring Joey.The pack is thrown into turmoil over Joey’s sudden heat. Someone has to breed the sweet, caring boy before his body shuts down permanently. Wanting to show his gratitude to his pack, Liam volunteers for stud duty. He’s determined to help even if it means putting aside his own feelings and forcing Joey to accept his new status. As much as Joey secretly desires the sexy gamma, he doesn’t want the male like this, not out of obligation.Their tumultuous relationship grows from necessity into uncertain affection. But the odds are stacked against them as they wrestle with current dangers and past hurts. If Joey doesn’t accept his omega nature, and Liam can’t put his old love to rest, the Rogue Pack will suffer a terrible loss.",
  "genres": [
    "M M Romance",
    "Shapeshifters",
    "Omegaverse",
    "Paranormal",
    "Romance",
    "Paranormal Romance",
    "Werewolves"
  ],
  "author": "Samantha Cayto",
  "average_rating": "3.73",
  "url": "https://www.goodreads.com/book/show/33015044-accidentally-omega"
}