{
  "title": "Corner Confessions: A Novel",
  "description": "Librarian Note: Alternate Cover Edition for ASIN: B01LZ6NK7X.Everyone has that one secret… that one skeleton in their closet… which will never see the light of day. No psychiatrist, priest, spouse, or best friend will ever hear this secret yet, the urge to share this information can be found in most people's natural psyche… People want to share their experience with others… They want to tell someone their deep, dark secret. Although this secret rides on the subconscious - scratching at the surface to be revealed, it’s most often too embarrassing, or horrifying, or scandalous... What better way to get that secret off the mind, and out of the closet than to tell someone who is a complete stranger? Someone who will not judge what has been said, and what has been done? This method is safe, anonymous, and there is no accountability or judgment - and if there is, the keeper of the secret can simply walk away. Meet 14 individuals who have decided to clean at least one skeleton out of their closet by confiding in a complete stranger whom they meet at a local coffee shop. Unassuming and safe with no judgments passed, learn about these secrets first hand, as if you were a fly on the wall listening in during their confession. Everyone has a secret. What’s yours? A story about stories, Corner Confessions is an intriguing tale of secrets and the humans who keep them....and of the sheer and utter relief one feels once unburdened by them. The confessions are riveting and the characters relaying them are fascinating, from the self proclaimed town liar, to the middle aged unobtrusive super hero. Ms. Hall has the ability and talent of being completely conversational and engaging so that her readers feel as if they are hearing these confessions in person over tea and crumpets rather than simply reading words on a page. One is quite easily drawn into the web of the stories she weaves.",
  "genres": [
    "Fiction"
  ],
  "author": "Kiersten Hall",
  "average_rating": "4.06",
  "url": "https://www.goodreads.com/book/show/33016809-corner-confessions"
}