{
  "title": "True Crime: Homicide & True Crime Stories of 2016",
  "description": "Almost every year, we believe that nothing can top the abject horror of the last 12 months when it comes to true crime stories, homicides, execution-style murders or serial killers that are still on the prowl, leaving behind a trail of blood, tears and sorrow. Then, of course, the New Year begins. And so, too, begin the murders, bodies dumping beneath the snow, behind dumpsters in the worst parts of town, or left just where they fell, killed by a madman with a gun. Unfortunately, terrible, barbaric things have happened since the beginning of time, when Medieval torture devices included the Iron Chair (a victim was forced to sit in a chair made of iron spikes, while restraints were tightened so the spikes would slowly, painfully penetrate the body) and the Pear of Anguish (device with four sections that stretched outward after the instrument was inserted into any orifice of a victim’s body – vagina, anus or mouth – and stretch, causing permanent damage, while the Catholic Inquisition gave us the rack, which essentially tore its victims limb from limb to elicit a confession. When one inevitably came, the broken confessor was set on fire for his or her crime. So why should we be surprised to learn a serial killer is stalking Alaska, shooting people in the dark at the city’s peaceful parks, while another makes his home in Phoenix, randomly shooting his victims, leaving residents looking over their shoulders with nervous anxiety wherever they might go. People have been capable of terrible things since the beginning of time, and they seem in no hurry to put an end to their sadistic actions. In more cases than we’d probably like to believe, our neighbors may not be who they seem, and you might look at them with a little more wariness after reading this true crime anthology, which delves deeply into some of the worst homicides, mass killings, hate crimes, spree killings and serial killings or serial killer captures across the nation in 2016. These true murder stories will leave you feeling chilled to the bone, causing you to lock your doors at night against a potential intruder who may be at your door because he randomly saw your porch light, or because of a grudge that’s potentially gone one for years. If you’re looking for a true murder book that gives you an intimate, in-depth look at some of the most gruesome, shocking and unreal true crime stories of 2016, this true crime anthology has got you covered. You’ll be riveted by the tales of true murder, but they’re the sort to cause nightmares. You might not want to read it in the dark. The shadows could be hiding secrets. This is the first book in Jack Rosewood's Annual True Crime Anthology series, make sure you check out the other books as well.",
  "genres": [
    "True Crime",
    "Nonfiction"
  ],
  "author": "Jack Rosewood",
  "average_rating": "3.60",
  "url": "https://www.goodreads.com/book/show/33015553-true-crime"
}