{
  "title": "A Planet of Viruses",
  "description": "Viruses are the smallest living things known to science, yet they hold the entire planet in their sway. We are most familiar with the viruses that give us colds or the flu, but viruses also cause a vast range of other diseases, including one disorder that makes people sprout branch-like growths as if they were trees. Viruses have been a part of our lives for so long, in fact, that we are actually part the human genome contains more DNA from viruses than our own genes. Meanwhile, scientists are discovering viruses everywhere they in the soil, in the ocean, even in caves miles underground.This fascinating book explores the hidden world of viruses—a world that we all inhabit. Here Carl Zimmer, popular science writer and author of Discover magazine’s award-winning blog The Loom , presents the latest research on how viruses hold sway over our lives and our biosphere, how viruses helped give rise to the first life-forms, how viruses are producing new diseases, how we can harness viruses for our own ends, and how viruses will continue to control our fate for years to come. In this eye-opening tour of the frontiers of biology, where scientists are expanding our understanding of life as we know it, we learn that some treatments for the common cold do more harm than good; that the world’s oceans are home to an astonishing number of viruses; and that the evolution of HIV is now in overdrive, spawning more mutated strains than we care to imagine.The New York Times Book Review calls Carl Zimmer “as fine a science essayist as we have.” A Planet of Viruses is sure to please his many fans and further enhance his reputation as one of America’s most respected and admired science journalists.",
  "genres": [
    "Science",
    "Nonfiction",
    "Biology",
    "Medicine",
    "Health",
    "Popular Science",
    "Medical"
  ],
  "author": "Carl Zimmer",
  "average_rating": "4.06",
  "url": "https://www.goodreads.com/book/show/12013394-a-planet-of-viruses"
}