{
  "title": "Wonder Tales: Six French Stories of Enchantment",
  "description": "Once upon a time, in the Paris of Louis XIV, five ladies and one gentleman-- all of them aristocrats-- seized on the new enthusiasm for \"Mother Goose Stories\" and decided to write some of them down. Telling stories resourcefully and artfully was a key social grace, and when they recorded these elegant narratives they consciously invented the modern fairy tale as we still know it today.For this beautiful anthology of six masterpiece wonder tales, Marina Warner gathered five writers with a special sympathy for the French stories they render here in burnished, cunning and amusing English. The stories, \"The White Cat\" (translated by John Ashbery), \"The Subtle Princess\" (Gilbert Adair), \"Bearskin\" and \"Starlight\" (Terence Cave), \"The Counterfeit Marquise\" (Ranjit Bolt), and \"The Great Green Worm\" (A.S. Byatt), are as unforgettable today as they were when first published centuries ago. Wonder is the key to the stories, and each tale abounds with transformation and magic. Wonders can be benign (like the garden fruits that come when you whistle) or baneful (like the bad fairy Magotine's spells), producing dread and desire at the same time. But, fortunately, they almost always punish those who deserve it: tyrants, seducers, and other forces of malevolence.Heroes and heroines are put to mischievous tests, and their quest for love is confounded when their objects of desire change into beasts or monsters. Still, true understanding and recognition of the person beneath the spell wins in the end, for after wonder comes consolation, and after strange setbacks comes a happy ending. In Wonder Tales , a magical world awaits all who dare to enter.",
  "genres": [
    "Short Stories",
    "Fairy Tales",
    "Fantasy",
    "Fiction",
    "Anthologies",
    "France",
    "Folklore"
  ],
  "author": "Marina Warner",
  "average_rating": "3.88",
  "url": "https://www.goodreads.com/book/show/330511.Wonder_Tales"
}