{
  "title": "The Politics Of Murder: The Power and Ambition Behind \"The Altar Boy Murder Case\"",
  "description": "Nash’s masterful feat of weaving together this story should give pause to anyone who trusts the integrity of the judicial system. Nash shows just how easily the social networks of powerful people within a local court system can lead to an influential person manipulating the process and infringing on the rights of ordinary Americans.\"--Victoria Hewlett in The Somerville News Weekly  On a hot night in July 1995, Janet Downing, a 42-year-old mother of four, was brutally stabbed 98 times in her home in Somerville, a city two miles northwest of Boston. Within hours, a suspect was identified: 15-year-old Eddie O’Brien, the best friend of one of Janet’s sons.  But why Eddie? He had no prior history of criminal behavior. He was not mentally ill. He had neither motive nor opportunity to commit the crime. Others had both. Yet none of that mattered because powers far beyond his Somerville neighborhood decided that Eddie needed to be guilty.  As laid out in THE POLITICS OF MURDER, the timing of this case did not bode well for Eddie. A movement hoping to stop the supposed rise of young “superpredators” was sweeping the nation, and juvenile offenders were the targets. Both the Massachusetts governor and an elected district attorney who personally litigated this case supported juvenile justice reform, and both aspired to higher offices.  Eddie O’Brien’s case garnered both local and national publicity: He was the youthful Irish Catholic boy next door. His grandfather was the retired chief of the Somerville Police Department. Court TV covered the trial in adult court gavel to gavel, calling it the altar boy murder case. His highly publicized case changed the juvenile laws in Massachusetts. Other states began to follow suit. But did the justice system fail Eddie?  That’s the contention of author-attorney Margo Nash in her explosive expose, THE POLITICS OF MURDER. Appointed Eddie’s guardian ad litem, Nash attended every court session and eventually gained access to all his files. Now after painstaking research and examination of each step of the investigation, trial transcripts and the forensic evidence, Nash makes the case that Eddie could not have committed the crime and that other viable suspects were never properly considered.  The Innocence Program has recently taken on Eddie’s case. Now readers can decide if politics sent an innocent boy to adult prison for the rest of his life.  \"A chilling story about corruption, political power and a stacked judicial system in Massachusetts.\"--John Ferak, bestselling author of FAILURE OF JUSTICE.",
  "genres": [
    "True Crime",
    "Nonfiction",
    "Politics"
  ],
  "author": "Margo Nash",
  "average_rating": "3.79",
  "url": "https://www.goodreads.com/book/show/33027254-the-politics-of-murder"
}