{
  "title": "Quest For War: And One Green Beret's Subsequent Evolution",
  "description": "Remarkable. A creative, accessible, and very human depiction of war, post war, military valor and heroism, passion, and success.  Provocative. Full of insights on counter terrorism, intelligence, special operations, education, technology, leadership, and philosophy of war. Not your average macho war book from yet another Special Operator; Mark Giaconia questions everything about war and opens the mind about it.  Unique. Mark Giaconia’s experiences as a Special Operator in Bosnia, Kosovo, and Iraq are atypical, and his subsequent evolution to successful computer scientist is inspiring.  Quest for War spans a 15 year career in Special Operations and contains the only firsthand accounts of Operation Viking Hammer, the 2003 battle against Ansar Al Islam in Northern Iraq, and the Advanced Force Operations (AFO) prior to the “shock and awe.” Quest for War tells the story of how, through luck, education, love, and brutal perseverance, one Green Beret transformed himself from a young enlisted Green Beret war monger to a compassionate and intellectual computer scientist. Quest for War is very personal, and contains emotion, compassion, paradox, adventure, thrill, irony, horror, philosophy, and humor as Mark Giaconia walks through two tours in Bosnia, a harrowing tour to Kosovo, the war (and pre war) in Iraq, and his intellectual evolution. Quest for War is really about the power and potential of the human spirit as much as it is about valor and heroism. There is an entire section dedicated to philosophical introspection regarding the big questions about war and military life.   Mark Giaconia is a two-time Green Beret valor award recipient and holds an MS in Software Engineering and a BA in English.  DoD Pre-Publication Review Case Number: 15-S-2150",
  "genres": [],
  "author": "Mark Giaconia",
  "average_rating": "4.63",
  "url": "https://www.goodreads.com/book/show/33030895-quest-for-war"
}