{
  "title": "Amazing Legends of India",
  "description": "The book explains true stories of Indian legendary heroes from the time of Hindu mythology to 18th century.India has always been an attraction point in the world, millions of curious people all over the world visit here and wonders how one country could always be so glorious with so many languages, cultures, traditions? It’s all because of those ancient heroes, who created it with their knowledge, passion and bravery and magnetized the world to come and see the fame of India and follow us.These legends flashed the light on India in the map of the world, and sparkled the glee of its richness with precious gems and metals, heritage temples, structures, books filled with the oceans of knowledge, medicines, meditation, culture and last but not the least presented it’s history of more than 5000 years. Today we see many historical movies and television series which are manipulated to gain more popularity. Amazing legends of India tells you the true stories of those ancient legendary heroes.It's a single place where you can know about almost all the ancient legends of India from the time of Indian mythology till 18th century with briefing of some known and unknown facts. This book is useful for all the age group ranging from 8 to 80 years and it’s created in a very simple language, so that it could be reachable to everybody’s mind.You will find details about almost all the legends from all over India like the brave worriers, great kings and queens, holy sages and saints. philosophers and writers etc., The interesting part of the book is describing the facts of our customs and traditions, why we follow them? why the new religions born and which are the religions born in India? and many more. It also explains how the world is wondering on our ancient intelligent philosophers intellectual minds, who showed us the new path of living thousands of years ago. Its a must read book for each and every Indian and individual who is curious to know about India.",
  "genres": [],
  "author": "Swapna Rajput",
  "average_rating": "4.40",
  "url": "https://www.goodreads.com/book/show/33049228-amazing-legends-of-india"
}