{
  "title": "Society's Child: My Autobiography",
  "description": "Grammy Award winning singer and songwriter Janis Ian's memoir of her more than forty years in the music business. Janis Ian was catapulted into the spotlight in 1966 at the age of fifteen when her soul-wrenching song \"Society's Child\" became a national hit. An intimate portrait of an interracial relationship, \"Society's Child\" climbed the charts despite the fact that many radio stations across the country refused to play it because of its controversial subject matter. But this was only the beginning of a long and illustrious career. In this fascinating memoir of her life in the music business, Ian chronicles how she did drugs with Jimi Hendrix, went shopping for Grammy clothes with Janis Joplin, and sang with Mel Tormé all the while never ceasing to create unforgettable music. In Society's Child, Ian shares with readers what it felt like to move in and out of the public eye. In 1975 her legendary song \"At Seventeen\" earned two Grammy awards and five nominations. But during the 1980s she made a conscious decision to walk away from the often grueling music business to study ballet and acting. She also struggled through a difficult marriage that ended with her then husband's threat to kill her. The hiatus from music lasted for nearly a decade until, in 1993, Ian returned with the release of Breaking Silence. Rather than risk losing artistic control, she took out a second mortgage on her home to fund the record. It paid off as Breaking Silence gained Ian her ninth Grammy nomination. Now in her fifth decade, Ian continues to draw large audiences around the globe. Janis Ian has inspired generations of fans and in this moving book she shares the fascinating story of her life in music.",
  "genres": [
    "Nonfiction",
    "Biography",
    "Memoir",
    "Music",
    "Audiobook",
    "Autobiography",
    "Biography Memoir"
  ],
  "author": "Janis Ian",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/3303074-society-s-child"
}