{
  "title": "Pink Ribbons, Inc.: Breast Cancer and the Politics of Philanthropy",
  "description": "In 2005, more than one million people participated in the Susan G. Komen Foundation’s Race for the Cure, the largest network of 5K runs in the world. Consumers thoughtfully choose products ranging from yogurt to cars, responding to the promise that these purchases will contribute to a cure for the disease. And hundreds of companies and organizations support Breast Cancer Awareness Month, founded by a pharmaceutical company in 1985 and now recognized annually by the president of the United States. What could be wrong with that?In Pink Ribbons, Inc., Samantha King traces how breast cancer has been transformed from a stigmatized disease and individual tragedy to a market-driven industry of survivorship. In an unprecedented outpouring of philanthropy, corporations turn their formidable promotion machines on the curing of the disease while dwarfing public health prevention efforts and stifling the calls for investigation into why and how breast cancer affects such a vast number of people. Here, for the first time, King questions the effectiveness and legitimacy of privately funded efforts to stop the epidemic among American women. Pink Ribbons, Inc. grapples with issues of gender and race in breast cancer campaigns of businesses such as the National Football League; recounts the legislative history behind the breast cancer awareness postage stamp—the first stamp in American history to raise funds for use outside the U.S. Postal Service; and reveals the cultural impact of activity-based fund-raising, such as the Race for the Cure. Throughout, King probes the profound implications of consumer-oriented philanthropy on how patients experience breast cancer, the research of the biomedical community, and the political and medical institutions that the breast cancer movement seeks to change. Highly revelatory—at times shocking—Pink Ribbons, Inc. challenges the commercialization of the breast cancer movement, its place in U.S. culture, and its influence on ideas of good citizenship, responsible consumption, and generosity.Samantha King is associate professor of physical and health education and women’s studies at Queen’s University, in Kingston, Ontario.",
  "genres": [
    "Nonfiction",
    "Politics",
    "Feminism",
    "Medicine",
    "Health"
  ],
  "author": "Samantha King",
  "average_rating": "3.76",
  "url": "https://www.goodreads.com/book/show/330851.Pink_Ribbons_Inc_"
}