{
  "title": "Mini Habits for Weight Loss: Stop Dieting. Form New Habits. Change Your Lifestyle Without Suffering.",
  "description": "You will never diet again.Say goodbye to calorie counting, restrictive food bans, or other forced behaviors. In Mini Habits for Weight Loss, you will learn how to lose weight naturally, in the precise way your body and brain are meant to change.We’ve blamed ourselves for lack of discipline. That didn’t help.We’ve blamed calories, carbs, and fat. That didn’t help.We’ve blamed our diet formulas. That didn’t help.It’s time we looked at the practice of dieting.Nearly all diets are ineffective because they’re based on dieting. Every person has a diet (noun), but it’s only if you are trying to lose weight that you diet (verb). Dieting is eating and drinking sparingly or selectively to reduce your weight.It doesn’t work. If you’ve tried dieting, you know that.Even the “perfect diet” with the right foods will fail if it’s approached from the traditional dieting perspective. Since weight loss experts are more concerned with biology than neuroscience, we get brilliant discussions on nutrition followed by the same dumb suggestion to “immediately start eating completely different foods than the ones you’re habitually used to eating, and give up everything else.”Are You Fighting Your Own Body and Brain?The brain resists dramatic behavioral shifts. Recognizing this and developing a strategy around it made the original Mini Habits the #1 selling self-help book in a number of countries. In Mini Habits for Weight Loss, you’ll see that we also biologically resist such changes, which explains why most dieters and smoothie-cleanse aficionados lose weight in the short term, only to gain it all back (and more) when the body adjusts.Mini Habits for Weight Loss will show you how to make dietary changes in a sustainable, permanent way that doesn’t trigger biological or neurological resistance.It’s a specialized version of the method that made the original book a hit in 14 languages. The mini habits remain easy to implement, but the reasoning and supporting tactics are more sophisticated. This is by necessity, as weight loss factors are many and varied. The strategies in the book are rooted in extensive biological and neuroscience research.You’ll discover:Why it’s a terrible idea to forbid junk food.How some of the most impactful changes you can make don’t involve either diet or exercise.Why conscious calorie restriction causes long-term weight GAIN, and how this science has been publicly available (and ignored) for more than 30 years.How the body’s change process mirrors that of the brain, and why that is great news for losing weight.Creative strategies to mitigate weight gain from eating out, social events, and holiday binge sessions.Why eating fruit is essential to losing weight (for lots of reasons).The role of exercise and an active lifestyle in weight loss, with appropriate strategies.Most importantly, you’ll learn how to change your behavior and lose weight in the long term with mini habits.Instead of reading yet another dieting book, why not try a proven behavioral change strategy that your brain and body will welcome and respond to?Lasting change won't happen until you take that first step toward a strategy that works.Read Mini Habits for Weight Loss, and you’ll never diet again.",
  "genres": [
    "Nonfiction",
    "Health",
    "Self Help",
    "Personal Development",
    "Psychology",
    "Diets",
    "Food"
  ],
  "author": "Stephen Guise",
  "average_rating": "4.02",
  "url": "https://www.goodreads.com/book/show/33098255-mini-habits-for-weight-loss"
}