{
  "title": "In Search of Butch Cassidy",
  "description": "Who was Butch Cassidy? He was born Robert LeRoy Parker in 1866 in Utah. And, as everyone knows, after years of operating with a sometime gang of outlaws known as the Wild Bunch, he and the Sundance Kid escaped to South America, only to die in a 1908 shootout with a Bolivian cavalry troop.But did he die? Some say that he didn’t die in Bolivia, but returned to live out a quiet life in Spokane, Washington where he died peacefully in 1937. In interviews with the author, scores of his friends and relatives and their descendants in Wyoming, Utah, and Washington concurred, claiming that Butch Cassidy had returned from Bolivia and lived out the remainder of his life in Spokane under the alias William T. Phillips.In 1934 William T. Phillips wrote an unpublished manuscript, an (auto) biography of Butch Cassidy, “The Bandit Invincible, the Story of Butch Cassidy.” Larry Pointer, marshalling an overwhelming amount of evidence, is convinced that William T. Phillips and Butch Cassidy were the same man. The details of his life, though not ending spectacularly in a Bolivian shootout, are more fascinating than the until-now accepted version of the outlaw’s life.There was a shootout with the Bolivian cavalry, but, according to Butch (Phillips), he was able to escape under the cover of darkness, sadly leaving behind his longtime friend, the Sundance Kid, dead.Then came Paris, a minor bit of facelifting, Michigan, marriage, Arizona, Mexico with perhaps a tour as a sharpshooter for Pancho Villa, Alaska, and at last the life of a businessman in Spokane. In between there were some quiet return trips to visit old friends and haunts in Wyoming and Utah.The author, with the invaluable help of Cassidy’s autobiography, has pieced together the full and final story of a remarkable outlaw—from his Utah Mormon origins, through his escapades of banditry and his escape to South America, to his self-rehabilitation as William T. Phillips, a productive and respected member of society.",
  "genres": [
    "American History",
    "Nonfiction",
    "Westerns",
    "History",
    "Biography"
  ],
  "author": "Larry Pointer",
  "average_rating": "3.58",
  "url": "https://www.goodreads.com/book/show/3308528-in-search-of-butch-cassidy"
}