{
  "title": "How Do You Know?",
  "description": "“Maggie Piper navigates a version of Manhattan that’s as fun and original as Woody Allen’s or Sex and the City’s. You won’t forget this delightful cast of characters or Schorr’s sharp, candid insights about the plight of the modern woman.” – Diana Spechler, Author of Who by Fire and SkinnyLife doesn’t happen on a schedule, there are no deadlines in love, and age is just a number. On the eve of her thirty-ninth birthday, Maggie Piper doesn’t look, act, or feel much different than she did at twenty-eight, but with her fortieth birthday speeding toward her like a freight train, she wonders if she should. The fear of a slowing metabolism, wrinkling of her skin, and the ticking of her biological clock leaves Maggie torn between a desire to settle down like most of her similarly-aged peers and concern that all is not perfect in her existing relationship. When a spontaneous request for a temporary break from her live-in boyfriend results in a breakup, Maggie finds herself single once again and only twelve months from the big 4.0.As Maggie reenters the New York City dating jungle, suitors present themselves quickly, but who is “The One?” Is he a sexy coworker, one of many bachelors at a speed-dating event, or is he the man she already set free? How do you know? Her fun-loving friends and supportive family, including meddlesome “no-filter” Aunt Helen, eagerly share their (often unsolicited) opinions, but Maggie is determined to find her own way, even if she falls on her face—repeatedly.Books by Meredith Schorr:JUST FRIENDS WITH BENEFITSA STATE OF JANEHOW DO YOU KNOW?The Blogger Girl Series:BLOGGER GIRL (#1)NOVELISTA GIRL (#2)Part of the Henery Press Chick Lit Collection, if you like one, you'll probably like them all...",
  "genres": [
    "Chick Lit",
    "Romance",
    "Womens Fiction",
    "Contemporary",
    "Romantic Comedy",
    "Humor",
    "Contemporary Romance"
  ],
  "author": "Meredith Schorr",
  "average_rating": "3.91",
  "url": "https://www.goodreads.com/book/show/33094964-how-do-you-know"
}