{
  "title": "Jasper Spring",
  "description": "Spur Award Finalist for Best Western Contemporary Novel 2016 Nautilus Award Gold Winner for Young Adult FictionThis first novel tells the story of Alice and Tucker, the young stewards of  Jasper Spring . Tucker's family has lived on the ranch for generations, and the two look forward to filling the homestead with children of their own. After two miscarriages, their hope of a family is fading quickly and they feel farther apart than ever before. The only living thing that either one of them feels truly connected with is their border collie, Tommie, a dog with an uncanny sense of their needs.Enter Ray -- an ill dressed 11-year-old boy sorely neglected by his single mother. Ray stumbles across the gorgeous and isolated valley while out on an aimless spin with his dilapidated bicycle. When Tommie finds Ray, the boy is transfixed by the beautiful dog, and the collie's natural instinct to herd spurs him to drive the boy into Tucker and Alice's empty arms. The couple develops affection for the forsaken boy, and he feels truly at home for the first time in his young life. As their relationship deepens, shocking twists and turns are presented by the boy's peripheral mother--with one that leads to catastrophe. The the close trio is drawn into battle to preserve the land they love. Additional outside forces loom (drought and development). Though they have the help of two horses and a heroic dog, the struggle is intense and not without loss.Jasper Spring   is a heartwarming tale of a couple that experiences trials that would test any marriage, and the boy and dog that bring them back together again. A series of dramatic events renders Alice and Tucker's characters in a nuanced and sympathetic manner, with their plight moving the most hard hearted reader.The author's experience in training border collies inspired his description of Tommie, Tucker and Alice's loyal and beloved companion.",
  "genres": [],
  "author": "James T. Hughes",
  "average_rating": "3.57",
  "url": "https://www.goodreads.com/book/show/33106763-jasper-spring"
}