{
  "title": "Pleasure Me",
  "description": "Erotica and Hot Romance Box Set — Complete Books Anthology — Hot New Release — Vacation Reading Package — Perfect Holiday Gift Idea  21 COMPLETE NOVELS AND NOVELLAS FROM YOUR FAVORITE EROTICA AUTHORS.  Due to mature content, situations and language, this collection is recommended for audiences 18+. All works in this box set have been professionally proofed by Paper Gold Publishing, unless this service was expressly refused by the author. Some stories are written in American, some in Canadian, and some in British English. The authors have chosen to stay true to their heritage.  This box set includes a mix of already released and totally new novels and novellas, all complete works. Those books which are part of a series can be enjoyed fully without the need to read the complete series (though there is a chance you might develop story-addiction issues—for that, we apologize).  PLEASURE ME is a magnificent collection of award-winning erotica books, each sizzling hot story hand-picked for your enjoyment. 21 arousing erotic adventures to raise your temperature, 21 exhilarating liaisons to eavesdrop on, 21 couples to invite to your dinner party. The perfect companion for late nights on the sofa, the perfect gift to those who enjoy a good read. Add it to your favorite kindle with one click now.  THIS BOX SET INCLUDES THE FOLLOWING TITLES:  THE FOOD CRITIC — R.E. Hargrave MILE HIGH — M. B. Feeney REVENGE — E.M. Denning BIND ME — Rene Folsom EROTIC LIAISON — Xaviera Snow STEEP EMOTIONS — TJ Chapman NO RESERVATIONS — R.E. Hargrave NEW TRICKS: PLAN A — Ella Medler POLY AMORE — Desiree A. Cox THE VIRGIN — TJ Chapman SOMEONE FOR ME — S. Raven Storm SEXUAL CHEMISTRY — Izzy Szyn DEEP IN YOU — David S. Scott ALPHA TANGO — E.M. Denning TANGLING WITH TANIA — Suzy Stewart Dubot ADVENTUROUS — Rene Folsom TRIAL RUN — Ella Medler FIRE LUST — R.E. Hargrave UNWANTED PROTECTION —TJ Chapman INVOLVING INNOCENCE — Suzy Stewart Dubot MY DARLING DOLLY — Kendra Hale",
  "genres": [],
  "author": "M.B. Feeney",
  "average_rating": "4.60",
  "url": "https://www.goodreads.com/book/show/33122136-pleasure-me"
}