{
  "title": "Whip Smart",
  "description": "This book and the rest of THE LOFT series are no longer available. A substantially rewritten/re-edited version of this story will be published as CINCHED, the first book in the UNRAVEL ME series, in November 2021.Escaping her past is hard. Falling in love is even harder...Teresa Bodnar is desperate for a fresh start. Scarred by her relationship with her cruel, controlling, and so-called \"dominant\" ex, she escapes to her hometown of Pittsburgh. Determined to move forward, Tera makes a bold move: founding the first club in the city to act as a safe haven where her most secret desires can be fulfilled.But acting on those desires in the wake of the nightmare she left behind is something else entirely, especially when unexpected romantic entanglements complicate matters of business. Since the moment they met, the chemistry between Tera and easy-going Dominant Eric Yun has been undeniably scorching, yet Tera finds herself denying it at every turn. She has baggage to spare, and the high-strung submissive can't afford to take any chances where her budding friendship with the sweet and dangerously seductive Eric is concerned.Yet Eric has baggage of his own, and the more he chips away at her walls, the more Tera realizes it's not just the drugging allure of his dominance that calls to her. She's falling for him hard and fast, but if life's taught her anything, it's that the harder the fall, the worse the pain - a pain she'd do anything to save Eric from. But the harder she resists their magnetic attraction, the faster her resistance seems to crumble...**Note: This is the first book in The Loft Series and ends on a cliffhanger to be resolved in book two.****Content Warning: This book deals with issues of anxiety, depression, and healing from past abuse. It contains mentions of emotional/sexual abuse and suicide.**",
  "genres": [
    "BDSM",
    "Romance",
    "Erotica",
    "Contemporary",
    "New Adult",
    "Erotic Romance",
    "Contemporary Romance"
  ],
  "author": "Siena Noble",
  "average_rating": "3.87",
  "url": "https://www.goodreads.com/book/show/33115611-whip-smart"
}