{
  "title": "Las cadenas del destino",
  "description": "Las cadenas del destino es la esperada conclusión de la Trilogía Almohade.Nuevas tramas de pasión, guerra y traiciones nos guiarán por la senda de la épica hacia la batalla más importante de nuestra historia. Año 1195. Castilla ha caído en Alarcos y el califa almohade Yaqub al-Mansur avanza sobre Toledo. Los conquistadores africanos impondrán la conversión al islam más rígido o sembrarán la Península de cristianos crucificados y cabezas cortadas. Las fronteras se resquebrajan, las aldeas y los castillos se vacían, oleadas de refugiados huyen hacia el norte. Por si fuera poco, los reinos de León, Navarra y Aragón se confabulan para repartirse los despojos del derrotado Alfonso VIII, por lo que este no encuentra otro remedio que negociar con los musulmanes.Sin embargo, el embrión de la resistencia se sobrepone a la derrota y a la perfidia, y brota incluso entre la sangre del campo de batalla. En Castilla, la reina Leonor Plantagenet no se resigna a darlo todo por perdido, y aún confía en la unión entre los estados cristianos para enfrentarse al enemigo común. En Aragón, el joven príncipe Pedro sueña con alcanzar la corona y convertirse en un paladín de la cristiandad. Y en León, una muchacha judía arrojada a la esclavitud será capaz de cualquier cosa por salvar a los suyos.Ésto han dicho sobre la novela de Sebastián «Un auténtico viaje a la Edad Media. Sebastián Roa consigue que nos sintamos como si estuviéramos ahí.»El Mundo«Magistral. Sacarás tiempo para leer de donde no hay.»Carlos Aurensanz«Cuando el rigor histórico y el talento se aúnan surgen obras maestras como esta. Impresionante.»Blog Anika Entre Libros«Novela de aventuras, escrita con nervio sobre un armazón histórico.»El Periódico de Catalunya«Monumental novela histórica. Espléndida.»Tiempo«Una auténtica joya.»Blog La historia en mis libros«Tramas de pasión, intriga, guerra y ambición se entrecruzan de manera magistral.»Blog Todoliteratura«Hay que leerlo ya.»Blog Historia o leyenda«Un periodo clave de nuestro pasado revivido con trepidante energía por este maestro de la novela histórica.»Interviú«Una novela histórica de altura y bien documentada que combina rigor informativo y aventuras verdaderamente trepidantes.»Culturamas«Una trepidante historia, minuciosamente documentada y repleta de amores, batallas, traiciones, venganzas y pasiones humanas.»Eldiario.es«El autor maneja los recursos literarios con maestría.»La Razón«Novela medieval llena de fuerza y rigor.»Qué Leer",
  "genres": [
    "History"
  ],
  "author": "Sebastián Roa",
  "average_rating": "4.44",
  "url": "https://www.goodreads.com/book/show/33113610-las-cadenas-del-destino"
}