{
  "title": "History in English Words",
  "description": "Owen Barfield's original and thought-provoking works over three-quarters of a century made him a legendary cult figure. History in English Words, his classic historical excursion through the English language, is now back in print after five years.This popular book provides a brief, brilliant history of those who have spoken the Indo-European tongues. It is illustrated throughout by current English words—whose derivation from other languages, whose history in use and changes of meaning—record and unlock the larger history.\"In our language alone, not to speak of its many companions, the past history of humanity is spread out in an imperishable map, just as the history of the mineral earth lies embedded in the layers of its outer crust.... Language has preserved for us the inner, living history of our soul. It reveals the evolution of consciousness\" (Owen Barfield).About the Author:Owen Barfield (1898-1997), British philosopher and critic, has been called the \"First and Last Inkling\" because of his influential and enduring role in the group known as the Oxford Inklings, which included C.S. Lewis, J.R.R. Tolkien, and Charles Williams. It was Barfield who first advanced the ideas about language, myth, and belief that became identified with the thought and art of the Inklings. He is the author of numerous books, including Poetic Diction; Romanticism Comes of Age; Unancestoral Voice; History, Guilt, and Habit; and Worlds Apart, as well as works of fiction and poetry. His history of the evolution of human consciousness, Saving the Appearances: A Study in Idolatry, achieved a place in the list of the \"100 Best Spiritual Books of the Century.\"",
  "genres": [
    "History",
    "Nonfiction",
    "Language",
    "Linguistics",
    "Philosophy",
    "Writing",
    "Education"
  ],
  "author": "Owen Barfield",
  "average_rating": "4.10",
  "url": "https://www.goodreads.com/book/show/331109.History_in_English_Words"
}