{
  "title": "Drug Dealer, MD: How Doctors Were Duped, Patients Got Hooked, and Why It's So Hard to Stop",
  "description": "Three out of four people addicted to heroin probably started on a prescription opioid, according to the director of the Centers for Disease Control and Prevention. In the United States alone, 16,000 people die each year as a result of prescription opioid overdose. But perhaps the most frightening aspect of the prescription drug epidemic is that it’s built on well-meaning doctors treating patients with real problems.In Drug Dealer, MD, Dr. Anna Lembke uncovers the unseen forces driving opioid addiction nationwide. Combining case studies from her own practice with vital statistics drawn from public policy, cultural anthropology, and neuroscience, she explores the complex relationship between doctors and patients, the science of addiction, and the barriers to successfully addressing drug dependence and addiction. Even when addiction is recognized by doctors and their patients, she argues, many doctors don’t know how to treat it, connections to treatment are lacking, and insurance companies won’t pay for rehab. Full of extensive interviews—with health care providers, pharmacists, social workers, hospital administrators, insurance company executives, journalists, economists, advocates, and patients and their families— Drug Dealer, MD, is for anyone whose life has been touched in some way by addiction to prescription drugs. Dr. Lembke gives voice to the millions of Americans struggling with prescription drugs while singling out the real culprits behind the rise in opioid cultural narratives that promote pills as quick fixes, pharmaceutical corporations in cahoots with organized medicine, and a new medical bureaucracy focused on the bottom line that favors pills, procedures, and patient satisfaction over wellness. Dr. Lembke concludes that the prescription drug epidemic is a symptom of a faltering health care system, the solution for which lies in rethinking how health care is delivered.",
  "genres": [
    "Nonfiction",
    "Medical",
    "Medicine",
    "Health",
    "Science",
    "Audiobook",
    "Psychology"
  ],
  "author": "Anna Lembke",
  "average_rating": "4.01",
  "url": "https://www.goodreads.com/book/show/33116317-drug-dealer-md"
}