{
  "title": "My Heart Will Cross This Ocean: My Story, My Son, Amadou",
  "description": "Descended from West African kings and healers, raised in the turbulence of Guinea in the 1960s, Kadiatou Diallo was married off at the age of thirteen and bore her first child when she was sixteen. Twenty-three years later, that child—a gentle, innocent young man named Amadou Diallo—was gunned down without cause on the streets of New York City. Now Kadi Diallo tells the astonishing, inspiring story of her life, her loss, and the defiant strength she has always found within.It was Kadi Diallo’s voice that captivated the public when she came to America to defend her slain son, and it is that same voice—candid, wise, and generous—that fills the pages of this extraordinary book. Kadi reaches back to her earliest memories of growing up in Guinea, the daughter of a strict man who was thwarted by the relics of the French colonial system. Raised in a world in which age-old religious and cultural rituals were disappearing before the onslaught of modernity, Kadi saw her own childhood end abruptly at age thirteen when her father literally gave her away in marriage. Kadi prayed for death, but instead she found herself plunged into a baffling new life—the life of a second wife in a strange household in a distant country, and soon afterwards the teenage mother of a sweet-natured son.Yet somehow, Kadi managed not only to survive but to flourish. Despite the rigid strictures of African-Islamic culture, she attended school and later started a successful business of her own. She eventually divorced and remarried and lived for eight years in Bangkok. Back in Guinea, she learned that her oldest child Amadou had been shot in New York City in a case of racial profiling.Kadi read with outrage the American newspaper description of her son as “an unarmed West African street vendor.” “Nothing,” she writes, “could be more distant from the truth.” Now, with great pride and searing love, Kadi Diallo finally tells the truth about herself and her son.My Heart Will Cross This Ocean is an extraordinary book—a girl’s story of desire and innocence, a wife’s story of defiance, a mother’s story of unbearable loss, and a woman’s story of unshakable strength and love.",
  "genres": [
    "Africa",
    "Race",
    "Nonfiction",
    "Biography",
    "Memoir"
  ],
  "author": "Kadiatou Diallo",
  "average_rating": "4.17",
  "url": "https://www.goodreads.com/book/show/1021011.My_Heart_Will_Cross_This_Ocean"
}