{
  "title": "Love's Master",
  "description": "Twenty-three year old Lily finds herself widowed and forced to live with her brother and his family, including his eight year old son William, who is nothing short of a terror. Sure she cannot go another day with his behavior, she begins to search for a new nanny and tutor for her nephew with little success. But when she happens across an advertisement in the Times that seems to be the answer to her problem, she is set on a path that will take her where she's never been before. Victorian England is a place of strict social codes, and the sensual world she enters is strictly forbidden for a woman of her social stature.Her guide in this world is a man named Kadar, and the feelings he stirs in Lily threaten to change her forever. However, Victorian society is never far away, and her brother intends on seeing his sister remarried and settled into a home near him in Regent's Park. Lily will have to choose between Kadar,who makes her feel more alive than she ever believed she could, and Captain Mason Danvers, the gentleman who can offer her security and comfort for the rest of her life.Love's Master contains scenes of light BDSM (spanking, whipping) Adults onlyNovella 28,000 wordsLook for all of Gabrielle Bisset's books available for the Kindle!Vampire Dreams Revamped (A Sons of Navarus Prequel)Blood Avenged (Sons of Navarus #1)Blood Betrayed (Sons of Navarus #2)Blood Spirit (Sons of Navarus #3)Stolen DestinyDestiny RedeemedMasqueradeThe Victorian Erotic Romance TrilogyWant three novellas about the sensual Victorian Period? Pick up the Victorian Erotic Romance Trilogy, which contains the original Vampire Dreams novella (not found in any format but in the Trilogy), along with Love's Master and Masquerade all for $4.99! And the one volume set of The Victorian Erotic Romance Trilogy ebook includes the entire first chapter of Blood Avenged, the first book in the Sons of Navarus series.",
  "genres": [
    "BDSM",
    "Historical Romance",
    "Erotica",
    "Historical",
    "Romance"
  ],
  "author": "Gabrielle Bisset",
  "average_rating": "3.98",
  "url": "https://www.goodreads.com/book/show/12018289-love-s-master"
}