{
  "title": "The Seekers Trilogy Box Set: The Watcher Wars, The Seekers of Knight, The Endless Knight",
  "description": "His parents are legends.He craves adventure.He may just get more than he bargained for…Theo Kane has lived in the shadows his entire life. Son to two legendary heroes, all he’s ever wanted is to follow in their footsteps and have adventures of his own.When they were 16, they were taking on evil in the shape of High Chancellor Augustus Knight. Theo, at the same age, finds himself stuck in the quiet wooded region of Lignum, a fire raging inside him that yearns to be unleashed.Because Theo isn’t just any young man. Along with his best friend, Ajax, son to great heroes himself, he has a power locked deep down inside, one that both of them have been trying to set free.But with their parents warning against it, they’ve had to act in secret, sneaking off into the woods at night to hunt the beasts that prowl there. Night after night, they test themselves against the worst threats they can find. But none compare to what’s brewing in the darkness.One evening, however, their quiet world erupts into life. When heroes start falling around the country, Theo and Ajax find themselves on a path neither of them could have predicted. Someone is taking out those involved in the war 20 years ago, and the two young men are about to find themselves right in the centre of the action.Soon enough, their desire for adventure will be realised. Only, they might just have bitten off more than they can chew. And in time, maybe they’ll start to understand what their parents have always told that their power isn’t a gift, it’s a curse.One that will change their lives forever.The Seekers Trilogy is the sequel to the bestselling Watchers Trilogy, a series which has been compared to the Hunger Games and Divergent series’. It can be read as a standalone without having read the Watchers Trilogy first, although events in those books are referenced.Books in the Watchers The Watchers The Watchers of EdenCity of StoneWar at the WallThe Seekers The Watcher WarsThe Seekers of KnightThe Endless Knight",
  "genres": [],
  "author": "T.C. Edge",
  "average_rating": "4.48",
  "url": "https://www.goodreads.com/book/show/33127363-the-seekers-trilogy-box-set"
}