{
  "title": "The Devil and the Deep Blue Sea",
  "description": "1692. The Atlantis, captained by veteran seaman Benjamin Archer, flies the colours of an English merchantman on the high seas between the English Channel and the Caribbean.But she also runs up the ‘jolie rouge’ – the Jolly Roger – whenever the prospect of plundering a Spanish treasure ship presents itself. Nipping at Spain’s empire is common practice for state-sponsored privateers like the Atlantis at a time when lesser European powers dare not directly make war on Spain. But when those governments abandon the practice of issuing letters of marque to privateers against the Spanish galleons, many of the crews turn pirate.Such is the fate of Archer’s men. The crew is forced to sign the ship’s articles consenting to their new piratical ways, thereby placing their heads in a noose. Unless, that is, they can stage a mutiny and turn Archer over to the authorities in the Caribbean city of Port Royal, a popular homeport for privateers – and notorious for its gaudy displays of wealth and loose morals, the ‘wickedest city on earth’. But superstition is rife among seamen and the presence on board the Atlantis of two women – one a high-born French stowaway Catherine and the other a Jamaican slave-born ‘cabin boy’ Serafine – will only be a bad omen if they are discovered. Worse, the runaway is thought by her family to possess the powers of a witch while the ‘boy’ worships voodoo gods who rule life from beneath the waves.Will the mutiny succeed? What is the secret bond between Archer and Serafine? And can Catherine escape the captain’s determination to make her his after she has fallen for another young officer? Is some unstoppable divine force slowly gathering to punish the profane?Beyond the power and control of man lies what …?",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Pirates",
    "Historical"
  ],
  "author": "Johanna Craven",
  "average_rating": "3.90",
  "url": "https://www.goodreads.com/book/show/33124738-the-devil-and-the-deep-blue-sea"
}