{
  "title": "Red Dog, Red Dog",
  "description": "A National Bestseller and a Globe and Mail Best Book of the YearOne of the most powerful, gripping works of fiction to come out of Canada, Red Dog, Red Dog is Patrick Lane's virtuoso debut novel.An epic novel of unrequited dreams and forestalled lives, Red Dog, Red Dog is set in the mid-1950s, in a small town in the interior of B.C. in the unnamed Okanagan Valley. The novel focuses on the Stark family, centring on brothers Eddy and Tom, who are bound together by family loyalty and inarticulate love. There is Tom and Eddy's father, Elmer Stark, a violent man with a troubled past, and Lillian, who married as a girl to escape life on the farm with her widowed mother, and now retreats into her own isolation. Unrepentant, bitter, older brother Eddy speeds freely along, his desperate path fuelled by drugs and weapons, while Tom, a loner, attempts to conceal their secrets and protect what remains of the family. Eventually, an unspeakable crime causes him to come face to face with something traumatic that has lain hidden in him since he was a boy. Narrated in part by one of the dead infant daughters Elmer has buried, the story unfolds gradually, as it weaves in family stories that reach back to the depression days and the harsh life of settlers in the 1880s West.This is also a novel about a small community of people, about complicated loyalties, about betrayals and shifts of power. Filled with moments of harrowing violence and breathtaking description, of shattering truths and deep humanity, Red Dog, Red Dog is about the legacies of the past and the possibilities of forgiveness and redemption. With this astonishing novel, one of Canada's best poets propels himself into the forefront of our finest novelists.",
  "genres": [
    "Fiction",
    "Canada",
    "Contemporary",
    "Canadian Literature",
    "School",
    "Literary Fiction",
    "Novels"
  ],
  "author": "Patrick Lane",
  "average_rating": "3.15",
  "url": "https://www.goodreads.com/book/show/3312515-red-dog-red-dog"
}