{
  "title": "Night Swimming",
  "description": "Steph Bowe is back. Night Swimming is a love story with a twist, and a whole lot of heart. Imagine being the only two seventeen-year-olds in a small town. That’s life for Kirby Arrow—named after the most dissenting judge in Australia’s history—and her best friend Clancy Lee, would-be musical star.Clancy wants nothing more than to leave town and head for the big smoke, but Kirby is her family has a history of leaving. She hasn’t heard from her father since he left when she was a baby. Shouldn’t she stay to help her mother with the goat’s-milk soap-making business, look after her grandfather who suffers from dementia, be an apprentice carpenter to old Mr Pool? And how could she leave her pet goat, Stanley, her dog Maude, and her cat Marianne?But two things happen that change everything for Kirby. She finds an article in the newspaper about her father, and Iris arrives in town. Iris is beautiful, wears crazy clothes, plays the mandolin, and seems perfect, really, thinks Kirby. Clancy has his heart set on winning over Iris. Trouble is Kirby is also falling in love with Iris…She smiles at me again. No one smiling at me has ever made me forget to breathe. I am unaccustomed to the thrill of it, of being smiled at by someone so beautiful. I feel like I’m a Jane Austen character, swooning like the silly girl in Northanger Abbey who is obsessed with novels.  Steph Bowe was born in Melbourne in 1994 and now lives in Queensland. She has written two earlier YA Girl Saves Boy and All This Could End. Steph is currently a Stella Prize Schools Ambassador for Queensland.‘A funny, diverse, authentic story of family, love, musicals, crop-circles and goats.’ Lili Wilkinson ‘Night Swimming is at once sweet and serious; a love-letter to outsiders, the kooky and complex—it's an ode to first times and best friends...but above all else, it's a reminder of how lucky we are to have a writer like Steph Bowe in our midst.’ Danielle Binks, Alpha Reader ‘Steph Bowe’s latest novel is the utterly charming story of two best friends, the small town they live in and the girl they both fall for. It is a tender and humorous tale of family ties, friendship and first love.’ Erin Gough ‘Beautiful and fresh, Girl Saves Boy is full of the absolute truth—life is complicated. I could not put it down.’ Rebecca Stead on Girl Saves Boy'All This Could End could well be the most entertaining novel you would have read in a while.' Magpies Magazine  'She has an ease of style that makes you feel you are eavesdropping on a real conversation, not reading cleverly crafted lines of dialogue.' ABC Radio Central West ‘Night Swimming is a sweet story of coming of age, family and first requited love. There is a genuine-feeling desire in the story to see the good intentions in lightly sketched but complex characters, which gives the book a lot of heart. It will appeal to fans of realistic Australian YA and to readers searching for sweet and hopeful queer love stories.’ Books + Publishing ‘This bittersweet comedy of romantic misunderstanding, life management and family relations is poised at the emotional intersection between forgiveness and self-acceptance.",
  "genres": [
    "Young Adult",
    "LGBT",
    "Contemporary",
    "Romance",
    "Queer",
    "Lesbian",
    "Australia"
  ],
  "author": "Steph Bowe",
  "average_rating": "3.83",
  "url": "https://www.goodreads.com/book/show/33128455-night-swimming"
}