{
  "title": "Empire of Grass",
  "description": "Set in Williams' New York Times bestselling fantasy world, the second book of The Last King of Osten Ard returns to the trials of King Simon and Queen Miriamele as threats to their kingdom loom . . .The kingdoms of Osten Ard have been at peace for decades, but now, the threat of a new war grows to nightmarish proportions.Simon and Miriamele, royal husband and wife, face danger from every side. Their allies in Hernystir have made a pact with the dreadful Queen of the Norns to allow her armies to cross into mortal lands. The ancient, powerful nation of Nabban is on the verge of bloody civil war, and the fierce nomads of the Thrithings grasslands have begun to mobilize, united by superstitious fervor and their age-old hatred of the city-dwellers. But as the countries and peoples of the High Ward bicker among themselves, battle, bloodshed, and dark magics threaten to pull civilizations to pieces. And over it all looms the mystery of the Witchwood Crown, the deadly puzzle that Simon, Miriamele, and their allies must solve if they wish to survive.But as the kingdoms of Osten Ard are torn apart by fear and greed, a few individuals will fight for their own lives and destinies-not yet aware that the survival of everything depends on them.Praise for Tad Williams'One of my favourite fantasy series' - George R. R. Martin, author of A Game of Thrones'Ground-breaking . . . changed how people thought of the genre and paved the way for so much modern fantasy, including mine' - Patrick Rothfuss, author of The Kingkiller Chronicle'One of the main reasons I started writing fantasy . . . Tad Williams' work is an essential part of any science fiction and fantasy library' - Christopher Paolini, author of the Inheritance Cycle series",
  "genres": [
    "Fantasy",
    "Fiction",
    "Epic Fantasy",
    "High Fantasy",
    "Science Fiction Fantasy",
    "Audiobook",
    "Adult"
  ],
  "author": "Tad Williams",
  "average_rating": "4.39",
  "url": "https://www.goodreads.com/book/show/33129041-empire-of-grass"
}