{
  "title": "Mila 18",
  "description": "When journalist Christopher De Monti is sent to Warsaw on an assignment, he is thrust into the midst of a pre-World War II ghetto and the persecution of Poland’s Jewish population. Bearing witness to the atrocities of the Nazi party and their plans for a “final solution,” De Monti becomes determined to share his story with the world and joins the Jews of Warsaw in their resistance against German occupation. As the war rages on and the ghetto population diminishes, Mila 18 paints a picture of the sheer strength, honor, and willpower of the Jewish resistance as they take their last stand to defend their people. Once again, Leon Uris has given us a heartfelt historical story of Jewish perseverance, which continues its legacy as a New York Times bestselling World War II novel. “A profoundly moving experience.” —New York Herald Tribune From the Publisher It was a time of crisis, a time of tragedy--and a time of transcendent courage and determination. Leon Uris's blazing novel is set in the midst of the ghetto uprising that defied Nazi tyranny, as the Jews of Warsaw boldly met Wehrmacht tanks with homemade weapons and bare fists. Here, painted on a canvas as broad as its subject matter, is the compelling of one of the most heroic struggles of modern times. \"Not only authentic as history . . . . It is convincing as fiction . . . . The story of a sacrifice that had real meaning and will forever be remembered . . . . A fine and important novel.\" -- The New York Times About the Leon Uris (1924–2003) was an author of fiction, nonfiction, and screenplays whose works include numerous bestselling novels. His epic Exodus (1958) has been translated into over fifty languages. Uris’s work is notable for its focus on dramatic moments in contemporary history, including World War II and its aftermath, the birth of modern Israel, and the Cold War. Through the massive success of his novels and his skill as a storyteller, Uris has had enormous influence on popular understanding of twentieth-century history. Follow @authorleonuris on Facebook for updates.",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Holocaust",
    "Historical",
    "World War II",
    "War",
    "Jewish"
  ],
  "author": "Leon Uris",
  "average_rating": "4.32",
  "url": "https://www.goodreads.com/book/show/33127603-mila-18"
}