{
  "title": "The Night Climbers",
  "description": "The Night Climbers, set among members of a close-knit eccentric club at Cambridge, portrays people at their most impressionable, when the intensity of early relationships stand to define their lives forever.When James Walker first arrives at Tudor College, Cambridge, he is anxious to find his place among new friends. By accident, he encounters one of the members of a club calling itself the Tudor Night Climbers, a tightly knit, wealthy, secretive and tantalizingly eccentric circle of undergraduates who at night scale the college towers and gargoyles in pursuit of ever greater sensations. Seduced by their talent for decadence and high living, James falls for the reckless charisma of both Francis, the group's ringleader and Jessica, his beautiful best friend. Jessica becomes his obsession, and also his arch rival for Francis's friendship. The group's tear-away extravagance is funded, unwittingly, by Francis's father, Lord Soulford, but when suddenly he cuts his son off, the friends are left floundering, until Francis embroils them all in a plan that will test not only their friendship, but also their very souls. The story begins with the news that, almost ten years after the crime, the fake Picasso they replaced the real one with is in danger of being discovered. The beautiful Jessica visits the narrator/lawyer James at his office in order to see what trouble they might be in, and the story flashes back and forth in time, also following the present narrative as they figure out whether they can save themselves. Humming with intellectual energy and grace, The Night Climbers portrays people at their most impressionable, when the intensity of early relationships stand to define their lives forever. Seductive and sinister, The Night Climbers is an exciting debut by a talented young writer.",
  "genres": [
    "Dark Academia",
    "Fiction",
    "Contemporary",
    "Literary Fiction",
    "Mystery",
    "British Literature",
    "Unfinished"
  ],
  "author": "Ivo Stourton",
  "average_rating": "3.01",
  "url": "https://www.goodreads.com/book/show/331244.The_Night_Climbers"
}