{
  "title": "Indigo",
  "description": "A Small Town Secrets Novel Standalone Series - (Book #2)*Previously published as indigo's struggleExclusive Revised EditionSome secrets can be dangerous. If Indigo doesn't find a way to escape hers, she just might end up dead.Indigo's friends think she's happy. What they don't know is that her world is quickly unraveling. When Indigo loses someone close to her, she hides the pain next to the emptiness that her father and stepfather left behind when they abandoned her. Soon she is burdened by guilt after she gives her virginity to the school's 'bad boy'. Unable to cope, Indigo buries her emotions right next to her childhood fear of drowning and the ongoing bullying at school.To make matters worse, the queen bully's usual intimidation suddenly surges into something more sinister. But the secrets are becoming much more than Indigo can bear, and she is finding it harder and harder to keep everything inside. And when someone uncovers her secrets and starts using them to threaten her, Indigo's very life is at stake in more ways than one.What No One Knew is a clean YA realistic fiction novel with a serving of suspense.All books in the Small Town Secrets series are clean YA and can be read in any order.IntentWhat No One KnewCassi Is In A ComaIntent: The Beginning Dear Reader,When I started writing What No One Knew, it occurred to me that there were hardly any novels dealing with hard-hitting issues like bullying and depression and what happens when you internalize the emotions that come with them.Indigo is someone relatable because at some point we have found ourselves in the dark. But there is hope and victory here too.This story resonates on a very personal note with me as well as you will see in the foreword.I hope you enjoy the novel as much as I have,Krista",
  "genres": [
    "Young Adult",
    "Suspense"
  ],
  "author": "Krista Wagner",
  "average_rating": "3.89",
  "url": "https://www.goodreads.com/book/show/33137868-indigo"
}