{
  "title": "The Changeling Omnibus: Books 1-2",
  "description": "The Changeling Omnibus Isle of WindsEnter the Netherworlde…Become the Changeling.Robin Fellows lives with his grandmother and lives what appears to be a rather ordinary life for a normal twelve year old boy.But when Robin’s Gran dies, his world is turned upside down. A long lost relative comes out of the woodwork and whisks him away to a mysterious new home, the quiet estate of Erlking Hall.Suddenly Robin must adjust to his new reality. But reality is no longer what he thought it was…Elrking has many secrets – there is more than meets the eye to this old mansion, and the people who inhabit it.Little does he know that there is more than meets the eye to himself.Robin is the world’s last Changeling. He is descended from a mystic race of Fae-people, whose homeland, the Netherworlde, is caught in the throes of a terrible civil war.Not only this, but in this new world there is a magical force that has infiltrated the human realm.And before he can master the arts of magic newly revealed to him, Robin is about to come face to face with the greatest evil this new world can Lady Eris, the tyrannical ruler of the Netherworlde.He must search out the truth about himself and the ethereal Towers of Arcania before it is too late…The Drowned TombWar is coming. Robin’s world has been turned upside down – the tutor he thought he could trust has been revealed to be an agent of his sworn enemy, Lady Eris.All is not well at Erlking Hall. The Netherworlde must hasten to face the greatest threat it has ever known…Agents of Lady Eris are hot on Robin’s tails, searching for him before he can find the Shard of Arcania for Water, another source of great power in this new world.They will stop at nothing to find it.Will Robin fulfill his journey to master these ancient magical arts?Find out in The Changeling Omnibus .'A puzzle-solving, secret-tomb-discovering, magic-filled adventure that takes you deeper than ever before.' L. K. Smith, reviewer at Innate Plethora'Fast-moving with surprises and mysteries galore' Simon Clark, bestselling fantasy author'One of my favorite books of 2016' AbbeybooksblogJames lives in the North of England, close to wild moors and adjacent to a haunted wind farm, with his extremely patient and long-suffering family and a very old cat named Gargoyle. When the cat dies, James plans to buy a raven and name it Quoth. He is the author of the Changeling fantasy series, following the adventures of Robin, a seemingly unremarkable boy who is swept up into a war between our world, and the Netherworlde, a shadowy realm which lies beyond our own. In addition to fantasy, James also writes Science Fiction, Urban Gothic and Steampunk, for people old enough to know",
  "genres": [],
  "author": "James Fahy",
  "average_rating": "4.39",
  "url": "https://www.goodreads.com/book/show/33138778-the-changeling-omnibus"
}