{
  "title": "The Ultimate Retirement and Estate Plan for Your Million-Dollar IRA: Including How to Protect Your Nest Egg from the Pending \"Death of the Stretch IRA\" Legislation",
  "description": "We believe that it will only be a matter of time before Congress passes a law that could reduce your IRA and retirement plan by one third or more after you die.This book will show you how the new law that I am calling the Death of the Stretch IRA will work, and more importantly, show you the best strategies to dramatically reduce the impact of these devastating changes.  I will also make suggestions for what to do between now and when the law passes.  On the other hand, as I said above, I cannot predict 100% how Congress will act, so I will also recommend solutions that will put you in a stronger position if the IRA law stays the same.  You win either way.A stretch IRA is an IRA (or retirement plan) that has a beneﬁciary designation that provides your heirs with the option to maintain the tax-deferred status of the account after your death.  The “stretch” refers to keeping as much money as possible for as long as possible in the tax-deferred account by limiting distributions to the required minimums.  Stretching your IRA after your death can offer significant financial advantages to your heirs.  These advantages can amount to hundreds of thousands of dollars for your children, and sometimes millions of dollars for your grandchildren.Unfortunately, the stretch IRA is under siege.  Generating new tax revenues will be on the radar for the next administration, and some tax increases will be easier than others to pass.  The Death of the Stretch IRA will certainly be proposed and this time, I think Congress will go along with it.  In 2012, Congress introduced a formal proposal to eliminate the stretch IRA.  The proposed law was written and the exact terms were made public by the Budget Committee.  President Obama wanted to kill the stretch IRA, and the Republican house voted to eliminate it, but the Senate defeated the bill by a narrow margin of 51 to 49.  The stretch IRA survived, but it is on life support.  A provision to eliminate the stretch IRA has been included in President Obama’s proposed budgets every year since then.  I have no reason to doubt that it will raise its head again. To be fair, it isn’t a certainty so I am including advice that would be advantageous if for whatever reason the proposed legislation never passes.The change in the law will be devastating to the heirs of IRA owners, especially if the IRA is worth $1 million or more.  The legislation, when enacted, stands to funnel billions of dollars in revenue from previously untaxed IRAs and retirement accounts in to the government’s coffers.  Depending on the value of your IRA or retirement plans, the cost to your own family could be millions.  Why?  Because, when the stretch is killed, any non-spouse beneficiary (our children or grandchildren are the prime examples) will be required to recognize all the income and pay all of the income tax on the inherited IRAs within five years of the owner’s death.  This proposed five-year liquidation requirement comes at a high cost to our families.This book will show you how to keep the IRS’ hands off of your hard-earned retirement money, and ensure that your heirs receive as much as is legally possible.  You don’t even need to wait – you can take advantage of some of these techniques right now.  And when the law does change, as most experts agree it will, the actions you will have taken will put you in a good position, and you will be prepared to move forward with additional strategies that will protect your money and your heirs.",
  "genres": [],
  "author": "James Lange",
  "average_rating": "4.13",
  "url": "https://www.goodreads.com/book/show/33141224-the-ultimate-retirement-and-estate-plan-for-your-million-dollar-ira"
}