{
  "title": "Weighing the Truth",
  "description": "In Weighing the Truth, a character-driven legal suspense novel, 32-year-old attorney Natalya Drummond struggles with significant challenges in her life—a demanding job representing criminals in their felony appeals, crushing grief over the sudden death of her husband, and the difficulties of raising a young child on her own.The novel opens as Natalya travels with her slacker colleague Rick Cropper to visit their death-row client Jared Hegner at San Quentin prison. Hegner claims he’s innocent and is furious that his appeal is moving too slowly. When his two lawyers inform him that the most he can hope for is to have the death penalty reduced to a life sentence, Hegner becomes even more enraged and threatens Nat and Rick, boasting that he has gang connections on the outside. Bizarre and disturbing incidents follow, leading Nat to believe Hegner’s purported gang members are responsible, especially when she becomes the victim of a traumatic attack.Police detective Emily Zhu helps Nat pursue the identity of the attacker down a shocking and unexpected path, as Nat comes to question her own assumptions and even her sanity. Has her fear clouded her perception of the truth? Has her distress undermined her passionate belief in the presumption of innocence? After the alleged perpetrator is arrested and charged, testimony at his dramatic trial hints at a possible link to the suspicious circumstances surrounding the death of Nat’s husband—a mystery Nat feels she must solve before she can move on in her personal and professional life.Weighing the Truth explores the devastating emotional impact of violent crime upon its victims, and the too-frequent failure of our criminal justice system to provide justice for all. Readers who enjoy Elizabeth George, Benjamin Black, or Tana French, and who like to be drawn into an increasingly suspenseful tale, will be engrossed by this psychologically complex legal drama.",
  "genres": [],
  "author": "Christine Z. Mason",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/33145667-weighing-the-truth"
}