{
  "title": "Badd Ass",
  "description": "I was a Sixty-Eight Whiskey—a combat medic. So when I hear someone shout “MEDIC!” training just kicks in. It’s automatic, immediate. I don’t think I even saw the guy whose leg I tended to, not really. All I saw was him. Zane Badd. His tuxedo fit him like he’d been sewn into it, and his eyes reflected the fury and the hardness of a combat veteran, but when he looked at me, he just…softened. By the time I had his brother patched, Zane and I were both covered in blood, and I knew I had to have him.The trouble with Zane isn’t getting him, it’s keeping him. And the trouble with me is, even if I could hold onto a man like Zane, I wouldn’t know what to do with him. It’s not in my nature, and if life has taught me anything, it’s to not trust anyone, least of all men like Zane. He’s a warrior through and through, hard, muscular, gorgeous, tenacious, and yet oddly tender toward me.Experience and instincts are telling me to run from Zane Badd as fast as possible, but my heart and my body are telling me to stay, to hold on and not let go. Yeah, it’s a conflict as old as humanity itself, but it’s brand new for me. *   *   *Life as Navy SEAL doesn’t exactly prepare you for normality. Yeah, I can tend bar and goof off with my seven crazy brothers, but what do I do when the woman of my dreams—dreams I didn’t know I’d had until I saw her—explodes into my life like a frag grenade? I’m trained to attack, to win, to survive at any costs, and figuring out what to do about a woman like Amarantha Quinn will take every scrap of tenacity and courage I possess. Combat is easy, it turns out, in comparison to facing your own fears and scars. And then sometimes, just when you think you’ve got it finally figured out, fate throws you a screwball and sends everything FUBAR.",
  "genres": [
    "Romance",
    "Contemporary Romance",
    "Contemporary",
    "Military Fiction",
    "Erotica",
    "Adult",
    "Audiobook"
  ],
  "author": "Jasinda Wilder",
  "average_rating": "4.09",
  "url": "https://www.goodreads.com/book/show/33147079-badd-ass"
}