{
  "title": "Romancing the Alpha",
  "description": "Can be read as a standalone billionaire paranormal shifter romance  In the next installment of the True Mates series, New York Alpha Grant Anderson meets his match in feisty New Jersey Alpha, Francesca “Frankie” Muccino.  New Jersey Alpha Francesca “Frankie” Muccino never had it easy. Alpha of her ragtag clan, head of her family, and manager of their ailing restaurant business, she’s got a lot on her plate. When a handsome, sexy, and very naked Lycan shows up on her doorstep, sparks immediately fly, but it’s one more complication she can’t handle.  Escaping from a kidnapping attempt by his enemies, New York Alpha Grant Anderson finds himself in New Jersey territory. He’s immediately drawn to the plucky and spirited Frankie, and has no qualms about going for what he wants - her, in his bed. The Jersey Alpha won’t be an easy catch, but Grant is determined to tame the wild she-wolf.  Danger brings them together as the evil mages come back for their revenge, determined more than ever to take Lycans down. Thirsty for retribution, they have taken in a new ally, one that’s closer to the New York clan and could finally bring them the victory they want. Frankie is caught in the middle of the war between the New York Clan and the mages and Grant will do anything to protect her. Can he keep her safe and win her over, or will the mages and their mysterious ally tear them apart?  Romancing the Alpha is a full-length (over 70,000 words) billionaire werewolf steamy paranormal romance with explicit love scenes, naughty language, and shifter suspense action with guaranteed HEA and no cliffhangers!  Although it works as a standalone romance story, this book takes place in the True Mates series world. To understand the elements, I recommend you read “Fated Mates” and “Blood Moon” before this book.",
  "genres": [
    "Paranormal",
    "Paranormal Romance",
    "Shapeshifters",
    "Romance",
    "Werewolves",
    "Contemporary",
    "Witches"
  ],
  "author": "Alicia Montgomery",
  "average_rating": "4.45",
  "url": "https://www.goodreads.com/book/show/33155522-romancing-the-alpha"
}