{
  "title": "Don Quixote",
  "description": "Don Quixote, by Miguel de Cervantes, is part of the Barnes & Noble Classics series, which offers quality editions at affordable prices to the student and the general reader, including new scholarship, thoughtful design, and pages of carefully crafted extras. Here are some of the remarkable features of Barnes & Noble Classics:*New introductions commissioned from today's top writers and scholars*Biographies of the authors*Chronologies of contemporary historical, biographical, and cultural events*Footnotes and endnotes*Selective discussions of imitations, parodies, poems, books, plays, paintings, operas, statuary, and films inspired by the work*Comments by other famous authors*Study questions to challenge the reader's viewpoints and expectations*Bibliographies for further reading*Indices & Glossaries, when appropriateAll editions are beautifully designed and are printed to superior specifications; some include illustrations of historical interest. Barnes & Noble Classics pulls together a constellation of influences—biographical, historical, and literary—to enrich each reader's understanding of these enduring works.Widely acknowledged as the first modern novel, Miguel de Cervantes’s Don Quixote features two of the most famous characters ever created: Don Quixote, the tall, bewildered, and half-crazy knight, and Sancho Panza, his rotund and incorrigibly loyal squire. The comic and unforgettable dynamic between these two legendary figures has served as the blueprint for countless novels written since Cervantes’s time.An immediate success when first published in 1604, Don Quixote tells the story of a middle-aged Spanish gentleman who, obsessed with the chivalrous ideals found in romantic books, decides to take up his lance and sword to defend the helpless and destroy the wicked. Seated upon his lean nag of a horse, and accompanied by the pragmatic Sancho Panza, Don Quixote rides the roads of Spain seeking glory and grand adventure. Along the way the duo meet a dazzling assortment of characters whose diverse beliefs and perspectives reveal how reality and imagination are frequently indistinguishable.Profound, powerful, and hilarious, Don Quixote continues to capture the imaginations of audiences all over the world. Features illustrations by Gustave Doré.",
  "genres": [
    "Fiction",
    "Classics",
    "Literature",
    "Spanish Literature",
    "Historical Fiction",
    "Adventure",
    "Novels"
  ],
  "author": "Miguel de Cervantes Saavedra",
  "average_rating": "3.90",
  "url": "https://www.goodreads.com/book/show/331567.Don_Quixote"
}