{
  "title": "Lemmy - The Definitive Biography",
  "description": "'Unflinching, forthright and full of wry humour as the man himself, and there's little praise greater than that' CLASSIC ROCK'Wall's vision of Lemmy as a Rock'n'Roll stalwart who made no concessions is vivid to the last' GUARDIANIn 'The Ace of Spades', Motörhead's most famous song, Lemmy, the born-to-lose, live-to-win frontman of the band sang, 'I don't want to live forever'. Yet as he told his friend of 35 years, former PR and biographer Mick Wall, 'Actually, I want to go the day before forever. To avoid the rush...'. This is his strange but true story.Brutally frank, painfully funny, wincingly sad, and always beautifully told, LEMMY: THE DEFINITIVE BIOGRAPHY is the story of the only rock'n'roller never to sell his soul for silver and gold, while keeping the devil, as he put it, 'very close to my side'. From school days growing up in North Wales, to first finding fame in the mid-60s with the Rockin' Vicars; from being Jimi Hendrix's personal roadie ('I would score acid for him'), to leading Hawkwind to the top of the charts in 1972 with 'Silver Machine' ('I was fired for taking the wrong drugs'); from forming Motörhead ('I wanted to call the band Bastard but my manager wouldn't let me'), whose iconoclastic album NO SLEEP 'TIL HAMMERSMITH entered the UK charts at No. 1.Based on Mick's original interviews with Lemmy conducted over numerous years, along with the insights of those who knew him best - former band mates, friends, managers, fellow artists and record business insiders - this is an unputdownable story of one of Britain's greatest characters. As Lemmy once said of Wall, 'Mick Wall is one of the few rock writers in the world who can actually write and seems to know anything about rock music. I can and do talk to him for hours - poor bastard.'With the hard part of his journey now over, Lemmy is set to become a legend. LEMMY: THE DEFINITIVE BIOGRAPHY explains exactly how that came to be.",
  "genres": [
    "Music",
    "Biography",
    "Nonfiction",
    "Music Biography"
  ],
  "author": "Mick Wall",
  "average_rating": "3.96",
  "url": "https://www.goodreads.com/book/show/33159806-lemmy---the-definitive-biography"
}