{
  "title": "My Soul Sings",
  "description": "Jeremiah has been hiding in shadows. Tessy is afraid of the dark. Together will they learn that God is able to shed His light even in the shadows of their lives?Jeremiah Hatcher witnessed war’s atrocities while serving as a missionary in Poland. No one knew of his secret missions to hide Jewish children on Red Cross ships and send them to homes in New York. The childhood bout of polio that made Jeremiah a cripple and weakened his heart forced him to leave Poland earlier than he wanted, and now he’s being sent to a small church in the hills of Arkansas to fill in for the minister while the man recovers from an operation. Jeremiah hopes his time in the beautiful mountains will help heal some of the wounds the war inflicted on his spirit and help him cast off his feelings of failure for not saving more souls.Tessy McCleary grew up in Shyler’s Point. Although her father served as the local minister, superstitions surrounding the day of her birth have made her a pariah to the townsfolk. Her only friend is a hermit known as Ol’ Gordy. To escape the town’s scorn, Tessy spends a great deal of time on her own in the mountains, finding joy in sketching images of the beautiful flowers and wild creatures she encounters while traipsing through the woods.Jeremiah is immediately drawn to the sad-eyed young woman named Tessy, and he wonders if God brought him to the community to help the townspeople overcome their irrational fears and accept her as one of their own. Their ostracism reminds him too much of the mistreatment the Jews faced in Europe. Unfortunately, a series of thefts and unusual happenings plague the town, and fingers of blame point at Tessy. Will befriending her steal his opportunity to truly minister to the people of Shyler’s Point?",
  "genres": [
    "Historical",
    "Romance",
    "Historical Fiction",
    "Christian Romance"
  ],
  "author": "Kim Vogel Sawyer",
  "average_rating": "4.29",
  "url": "https://www.goodreads.com/book/show/33165140-my-soul-sings"
}