{
  "title": "The Cocktail Collection: Wallbanger / Rusty Nailed / Screwdrivered",
  "description": "New York Times bestselling author Alice Clayton delights readers with the sexy, laugh-out-loud romances in the beloved Cocktail series! Don’t miss three hot and hilarious tales in the Cocktail Collection!In Wallbanger, Caroline didn’t hear things “go bump in the night”—she heard things go thump in the night. And it was always her neighbor’s headboard. So when the wallbanging threatens to literally bounce her out of bed, Caroline, clad in sexual frustration and a pink baby-doll nightie, confronts Simon Parker, her heard-but-never-seen neighbor. The tension between them is as thick as the walls are thin, and suddenly Caroline is finding she may have discovered a whole new definition of neighborly… In Rusty Nailed, Simon and Caroline find that playing house was never so much fun—or so confusing. With her boss on an extended honeymoon, Caroline’s working long hours to keep the interior design company running and her projects on deadline. And with Simon, her hotshot photographer boyfriend, gallivanting all over the world for his job, the couple is heavy-duty into \"absence makes the heart grow fonder\" mode. No complaints about the great reunion sex, though! But between Caroline’s crazy work schedule, Simon’s traveling, and house sitting for their friends, will they be able to make their relationship a priority? Screwdrivered brings us Viv Franklin, a tough-as-nails software engineer who designs programs and loves hospital corners, and also wants to be swept off her feet by her dream guy. So when a phone call with news of an inherited house brings her out to Mendocino, California, she suddenly finds her “knight in shining armor” selection growing. There’s a cowboy, one that ignites her loins. Because Cowboy Hank is totally loin-ignition worthy. But there’s also a librarian, Clark Barrow. And he calls her Vivian. Can tweed jackets and elbow patches compete with chaps and spurs? You bet your sweet cow pie. It’s like being forced to pick between Superman and Clark Kent! Really, how’s a girl to choose?",
  "genres": [
    "Romance",
    "Contemporary"
  ],
  "author": "Alice Clayton",
  "average_rating": "4.25",
  "url": "https://www.goodreads.com/book/show/33160964-the-cocktail-collection"
}