{
  "title": "When Africa Awakes: The \"Inside Story\" Of The Stirrings And Strivings Of The New Negro In The Western World",
  "description": "Hubert Henry Harrison (1883 – 1927) was a West Indian-American writer, orator, educator, critic, and race and class conscious political activist and radical internationalist based in Harlem, New York. He was described by activist A. Philip Randolph as “the father of Harlem radicalism” and by the historian Joel Augustus Rogers as “the foremost Afro-American intellect of his time.” John G. Jackson of American Atheists described him as \"The Black Socrates\"  \"This is an attempt to state this position and the point of view of the African American, which has come about largely as a result of the effects of the World War. The writer devouts considerable grace to the discussion of “The Negro and the War:\" “The New Politics:\" “The Problems of Leadership;\" “The New Race Consciousness:\" \"Our International Consciousness:\" and \"Education and the Race.\" Discarding the controversy of lower and higher education, he maintains that the new knowledge which the Negro needs is, “Of the wider world and of the long past: that is a grasp of the present situation and a knowledge of history particularly the part the Negro has played in the long past and its significance.\" ‘When Africa Awakes,\" is an important addition to the literature of the race problem and should be widely read.  Harrison writes:  \"The Great War of 1914-1918 has served to liberate many new ideas undreamt of by those who rushed humanity into that bath of blood. During that war the idea of democracy was widely advertised, especially in the English-speaking world; mainly as a convenient camouflage behind which competing imperialists masked their sordid aims. Even the dullest can now see that those who so loudly proclaimed and formulated the new democratic demands never had the slightest intention of extending either the limits or the applications of “democracy.”  \"The tenseness of this new situation has been reflected here in the United States in the mental attitude of the Negro people. They have developed new ideas of their own place in the category of races and have evolved new conceptions of their powers and destiny. These ideas have quickened their race-consciousness and they are making new demands on themselves, on their leaders and on the white people in whose midst they live. These new demands apply to politics, domestic and international, to education and culture, to commerce and industry.  \"It seems proper that the white people of America should know what these demands are and should understand the spirit in which they are being urged. Obviously, it is not well that they should be misrepresented and lied about.\"",
  "genres": [
    "History",
    "Politics",
    "Nonfiction"
  ],
  "author": "Hubert H. Harrison",
  "average_rating": "4.17",
  "url": "https://www.goodreads.com/book/show/33199233-when-africa-awakes"
}