{
  "title": "Sisterchicks Do the Hula",
  "description": "Some dreams take a while before they come true. Best friends Hope and Laurie never made it to Hawaii during their college years. But when they're about to turn forty, the islands still beckon, and off they go - with an unexpected stowaway on board (Hope happens to be seven months pregnant). A little pineapple, a little sunshine, and a surprising little surfing lesson give these two sisterchicks all their crazy hearts could hope for - and more - as they enter the next season of their lives with a splash and with a beautiful vision of what God has dreamed up for them.Wherever there’s chocolate, there’s sure to be a sisterchick celebrating, and this trip to Hawaii is no exception. Best friends Hope and Laurie are on an audacious mission to commemorate their fortieth birthdays in style. Surfing and sailing, sushi and snorkeling—these two macadamia nuts from the mainland sample it all, unhindered by a surprise little stowaway. __________________________________________________________________ Sisterchick n.: a friend who shares the deepest wonders of your heart, loves you like a sister, and provides a reality check when you’re being a brat. __________________________________________________________________ Luaus are only the beginning. The island experience binds Hope and Laurie’s souls together, gently restoring their unfinished dreams. Garlanded with leis or swimming with sea turtles, they join the dance of delight in their Maker, entering the next season of their lives filled with the unforced rhythm of grace. Story Behind the BookWe lived in Hawai’i when our son was in elementary school and have returned many times for visits. I have a deep and abiding love for all that is Hawaiian so of course the islands were my location of choice for this second Sisterchick novel. The art of hula is an intricate form of storytelling has gone through many changes over the years. Every woman’s life has a story. Every woman goes through many changes over the years. But not every woman has yet learned to \"hula\". This book will encourage her to \"hula\" through life as she learns to live out her story with the unforced rhythm of grace.From the Trade Paperback edition.",
  "genres": [
    "Christian Fiction",
    "Fiction",
    "Chick Lit",
    "Christian",
    "Inspirational",
    "Travel",
    "Contemporary"
  ],
  "author": "Robin Jones Gunn",
  "average_rating": "4.07",
  "url": "https://www.goodreads.com/book/show/331826.Sisterchicks_Do_the_Hula"
}