{
  "title": "The Jesus Sutras: Rediscovering the Lost Scrolls of Taoist Christianity",
  "description": "In 1907, explorers discovered a vast treasure trove of ancient scrolls, silk paintings, and artifacts dating from the 5th to 11th centuries A.D.  in a long-sealed cave in a remote region of China.  Among them, written in Chinese, were scrolls that recounted a history of Jesus' life and teachings in beautiful Taoist concepts and imagery that were unknown in the West. These writings told a story of Christianity that was by turns unique and disturbing, hopeful and uplifting. The best way to describe them is collectively, with a term they themselves The Jesus Sutras.The origins of Christianity seem rooted in Western civilization, but amazingly, an ancient, largely unknown branch of Christian belief evolved in the East. Eminent theologian and Chinese scholar Martin Palmer provides the first popular history and translation of the sect's long-lost scriptures--all of them more than a thousand years old and comparable in significance to the Dead Sea Scrolls. Gathered, deciphered, and interpreted by a team of expert linguists and scholars, these sacred texts present an inspiring use of Jesus' teachings and life within Eastern practices and meditations--and provide an extraordinary window into an intriguing, profoundly gentler, more spiritual Christianity than existed in Europe or Asia at the time, or, indeed, even today.Palmer has devoted more than a decade to seeking the extant writings and other evidence of this lost religion.  His search was triggered by an encounter with an immense, mysterious carved (stele) stone from the 8th century that resides in a Chinese museum collection called the Forest of Stones. The Chinese text on this stone commemorates the founding of a \"religion of light\" in China by a great Western teacher and features a unique cross that merges Taoist symbolism with the Christian cross. The scrolls, the stone, and a strange map of the area around a hallowed temple (where Lao Tzu wrote the Tao Te Ching before disappearing forever) gave Palmer enough information to rediscover one of the earliest Christian monasteries.  At the site was an  8th century pagoda still intact, and within it, in 1998, Palmer and his team found more evidence, including statues, underground passageways, and artifacts, that helped them uncover and recreate the era and rituals of the Taoist Christians.  The Taoist Christians, who wrote the Jesus Sutras recognized equality of the sexes, preached against slavery, and practiced nonviolence toward all forms of life. In particular, this tradition offered its followers a more hopeful vision of life on earth and after death than the dominant Eastern religions, teaching that Jesus had broken the wheel of karma and its consequent punishing, endless reincarnations.Vividly re-creating the turbulence of a distant age that is remarkably evocative of our own times, Palmer reveals an extraordinary evolution of spiritual thought that spans centuries. A thrilling modern quest that is also an ancient religious odyssey, The Jesus Sutras shares a revolutionary discovery with profound historical implications--imparting timeless messages and lessons for men and women of all backgrounds and faiths.",
  "genres": [
    "Religion",
    "History",
    "Christianity",
    "Nonfiction",
    "Taoism",
    "Spirituality",
    "China"
  ],
  "author": "Martin Palmer",
  "average_rating": "3.91",
  "url": "https://www.goodreads.com/book/show/331801.The_Jesus_Sutras"
}