{
  "title": "The Only Café",
  "description": "Scotiabank Giller prize–winner Linden MacIntyre delivers a page-turning, thought-provoking novel about an enigmatic man haunted by a troubled past in his native Lebanon and the Canadian-born son who tries to solve the mystery of his father's life.Pierre Cormier had secrets. Though he married twice, became a high-flying lawyer and a father, he didn't let anyone really know him. And he was especially silent about what had happened to him in Lebanon, the country he fled during civil war to come to Canada as a refugee. When, in the midst of a corporate scandal, he went missing after his boat exploded, his teenaged son Cyril didn't know how to mourn him. But five years later, a single bone and a distinctive gold chain are recovered, and Pierre is at last declared dead. Which changes everything.At the reading of the will, it turns out that instead of a funeral, Pierre wanted a \"roast\" at a bar no one knew he frequented—The Only Café in Toronto's east end. He'd even left a guest list that included one mysterious name: Ari. Cyril, now working as an intern for a major national newsroom and assisting on reporting a story on homegrown terrorism, tracks down Ari at the bar, and finds out that he is an Israeli who knew his father in Lebanon in the '80s. Who is Ari? What can he reveal about what happened to Pierre in Lebanon? Is Pierre really dead? Can Ari even be trusted? Soon Cyril's personal investigation is entangled in the larger news story, all of it twining into a fabric of lies and deception that stretches from contemporary Toronto back to the massacre at the Sabra and Shatila camps in Lebanon in September 1982.The Only Café is both a moving mystery and an illuminating exploration of how the traumatic past, if left unexamined, shadows every moment of the present.",
  "genres": [
    "Fiction",
    "Canada",
    "Book Club",
    "Mystery",
    "Lebanon",
    "Historical Fiction",
    "Contemporary"
  ],
  "author": "Linden MacIntyre",
  "average_rating": "3.50",
  "url": "https://www.goodreads.com/book/show/33197773-the-only-caf"
}