{
  "title": "5 Essential Dimensions: How to Balance Your Life for Health, Success and Content",
  "description": "Alebraheem has been studying the structure of the human mind since he was fifteen. He is recognized as a self-help author, a guest on Kuwait TV and US radio shows as well as a column writer for the well-known Kuwaiti newspaper ALQABAS. His articles cover various spheres of life: politics, society, philosophy, science, and everyday life matters. Alebraheem's writing attempts to see things from alternative angles, searching for patterns and creating successful habits for life. As a journalist, Alebraheem was inspired to write his first book, 5 Essential Dimensions which was translated into English from Arabic. He is busy writing his second book on the tough topic of the meaning of life.Book Idea This book unveils an amazing theory. Our lives have five dimensions that are essential for living a healthy, successful, and tranquil existence. These are our financial, social, internal, physical, and spiritual affairs. This book offers Insight into helping us recognize the five life dimensions. It will teach us how to bring these dimensions into balance. Ultimately, it will show how we can reach our goals in every dimension. This Book will help to ... * Recognizing life's five essential dimensions. * Offer tools to keep dimensions in homeostasis * Revise lives by comparison to other philosophies Book Story This book offers advice for human betterment, and while humans today become transfixed with money and pleasure, it summarizes wisdom from previous cultures. Book Idea We cannot reach our potential as individuals unless all five of these life dimensions are balanced. If we neglect any one of them, the ensuing disharmony destroys our tranquility and can wreck our lives. The 5 Essential Dimensions is an attempt to prevent this happening. It is a comforting counterweight to the lure of money, a steadying influence on the bodies that carry us, a stable platform for the social ladders that we rise up on, and a net that protects us from falling. It is a compass for our thoughts, and a safeguard for the soul that will remain after our bodies have perished. When the prescription in The 5 Essential Dimensions is followed it will bring us tranquility and satisfaction, making us better prepared to enjoy life’s happy moments and to cope with its sad ones. Today, we are witnessing enormous advances in the fields of science and commerce. Unfortunately some of us are mere bystanders, standing apart from this great achievement, like people not yet touched by the civilization that has gripped the rest of our world. These unfortunates watch science and its accomplishments without deriving any benefit from it. Picture such a man. He lives in a cave, or in the middle of a forest. Perhaps he is a subsistence farmer, standing outside the walls of his village near a remote airstrip, watching a plane landing that seems to be heading straight for his village. After it has passed and dazzled him he picks up his spear and returns to his farm, neither wondering how it flies, nor where it comes from, or where it goes. There is no shame in refusing to keep up with technology, or in failing to acquire the latest devices. It is a personal choice. The shame is in failing to be human.",
  "genres": [
    "Nonfiction",
    "Self Help"
  ],
  "author": "A.A. Alebraheem",
  "average_rating": "4.38",
  "url": "https://www.goodreads.com/book/show/33171179-5-essential-dimensions"
}