{
  "title": "Filthy Little Secret",
  "description": "“I won’t fall for him.”  After breaking up with his cheating ex, Mark Kenmore turns to rebound sex with the campus drug dealer, Tim Halwell. He’s heard the rumors about all the hearts Tim’s broken, but after how he’s been hurt, there’s no way he’ll let himself fall into that trap. Besides, if the press found out he was screwing around with a drug dealer, it would tarnish his governor mother’s reputation. He expects the sex to be hot and exciting. What he doesn’t expect is the most intense, mind-blowing experience he’s ever had. He knows it’s wrong to want more, but he can’t help himself. And the more time they spend hooking up, the more he worries he’s falling into the same trap as Tim’s previous boy toys…and the harder it becomes to keep what they’re doing a secret from his friends and family.  “He’s just like the others.”  Tim knows Mark—the son of a politician, attending one of the most prestigious universities in Atlanta—is just another spoiled rich kid. When Tim hears about Mark’s breakup, he’s more than willing to help the brat out with some rebound sex. Just another notch in his own headboard. Tim won’t make it a regular thing because that never goes well. The guys always end up falling for him, despite how much they may fight it. But one steamy, lust-filled encounter after another, and he finds he can’t stop messing around with Mark. It’s too much fun. Too intense. Too erotic. And the longer they try to remain each other’s filthy little secrets, the more Tim realizes if he doesn’t back out soon, he just might fall in love.  Filthy Little Secret is a stand-alone erotic gay romance with a HEA, steamy-as-hell sex, no cheating, and no cliffhanger.",
  "genres": [
    "M M Romance",
    "Romance",
    "Contemporary",
    "College",
    "New Adult",
    "LGBT",
    "Audiobook"
  ],
  "author": "Devon McCormack",
  "average_rating": "3.98",
  "url": "https://www.goodreads.com/book/show/33223233-filthy-little-secret"
}