{
  "title": "The Seabird's Cry",
  "description": "The story of seabirds – the pattern of their lives, their habitats, the threats they face and the passions they inspire from one of our greatest nature writers.Seabirds have always entranced the human imagination and Adam Nicolson has been in love with them all his life: for their mastery of wind and ocean, their aerial beauty and the unmatched wildness of the coasts and islands where every summer they return to breed.Over the last couple of decades, modern science has begun to understand them: their epic voyages, their astonishing abilities to navigate for tens of thousands of miles on a featureless sea, their ability to smell their way towards fish and home. Only the poets in the past would have thought of seabirds as creatures riding the ripples and currents of the planet, but that is what the scientists are seeing now too.In ten chapters, each dedicated to a different bird, and each beautifully illustrated by Kate Boxer, The Seabird’s Cry travels the ocean paths along with them, looking at the way their bodies work, the sense of their own individuality, the strategies and tactics needed to survive and thrive in the most demanding environment on earth.At the heart of the book are the Shiant Isles, a cluster of Hebridean islands in the Minch but Nicolson has pursued the birds much further—across the Atlantic, up the west coast of Ireland, to St Kilda, Orkney, Shetland, the Faeroes, Iceland and Norway; to the eastern seaboard of Maine and to Newfoundland, to the Falklands, South Georgia, the Canaries and the Azores—reaching out across the widths of the world ocean which is the seabirds’ home.But a global tragedy is unfolding. Even as we are coming to understand them, the number of seabirds is in freefall, dropping by nearly 70% in the last sixty years, a billion fewer now than there were in 1950. Of the ten birds in this book, seven are in decline, at least in part of their range. Extinction stalks the ocean and there is a danger that the grand cry of a seabird colony, rolling around the bays and headlands of high latitudes, will this century become little but a memory.",
  "genres": [
    "Nonfiction",
    "Nature",
    "Birds",
    "Science",
    "Natural History",
    "Animals",
    "Environment"
  ],
  "author": "Adam Nicolson",
  "average_rating": "4.36",
  "url": "https://www.goodreads.com/book/show/33229364-the-seabird-s-cry"
}