{
  "title": "Restless: Memoir of an Incurable Traveller",
  "description": "***WINNER OF THE READERS' FAVORITE 5 STAR AWARD*** This is not a how-to book, or a guide book. It is a why-to book.Restless is a book of true stories, of connections with people on one level or another, in situations that stretched the limits of the author's perseverance and often left her frustrated and angry at the world. It led her down some strange and wonderful alleyways, into situations she would never have found herself in if she had never left the comfort of her home and family. But by making those choices, and walking those paths, she changed her perspective and outlook on the world.In the true tradition of learning how the rest of the world lives, the author has been groped on an Indian train, fought off wild beasts while trying to use 'bathroom facilities' in Goa, trekked the Everest trails while pregnant and with a toddler on her back, unwittingly participated in a people smuggling operation, been mobbed by fans of a lookalike Indian movie star, traded foreign currency on the streets of Burma, stood behind diners in a Beijing restaurant for two hours just to get a meal, and survived a week in Taiwan on one hundred dollars.Yes, travel guides and travel books are a dime a dozen, but Restless is different. The author's travel stories will take you on a journey of self-discovery while living the budget travel lifestyle on the back roads of Asia, sharing the highs and the lows of surviving on a shoestring and flying by the seat of your pants.Restless is the travel memoirs of a young woman, traveling light, with just a backpack and without the convenience of modern technology, who set out to find herself in the world, and find answers to the eternal questions - who am I and why am I here? In Restless, for just a little while, you can travel along with the author on some of those roads, so that you can see for yourself what is possible when you believe in yourself and the power you have in your hands and heart.",
  "genres": [
    "Travel",
    "Nonfiction",
    "Memoir"
  ],
  "author": "Heather   Hackett",
  "average_rating": "3.80",
  "url": "https://www.goodreads.com/book/show/33225131-restless"
}