{
  "title": "Hot on Ice",
  "description": "18 brand new sexy stories from bestselling authors, every one too steamy for the penalty box...20% of royalties from sales of Hot on Ice will go to Homes for our Troops, a charity that builds specially modified homes for injured veterans.Get ready to fall in love with the smokin' hot hockey players of the New Orleans Cajun Rage. After this season's Cinderella run all the way to the Finals, these heroes have won the Cup--and now your heart is the goal.FREE AGENT, USA Today Best Seller Robin Covington - Finally out, he thought he knew his next step . . . until the man he might not be able to resist puts a sexy offer on the table.BODY CHECK, USA Today Bestseller Desiree Holt - The Cup, the girl, and the future-could he make them all come together?DEEP CHECK, USA Today Bestseller Kimberly Kincaid - There's no such thing as in too deep...BLOCKED, USA Today Bestseller Heather Long - He needs to clean up his reputation . . . Can this bad boy keep the pop princess safe?RANSOM, USA Today Bestseller Nana Malone - The last thing he wants is to be stranded in a cabin with the one girl he's always wanted.CAGED, USA Today Bestseller Virginia Nelson - She plans to melt the ice king's heart and prove she's just the girl to go skate to skate with him, whether he likes it or not.BREAKAWAY BROOKE, Publisher's Weekly Bestseller Angi Morgan - Can he convince this Amazon beauty to stop fighting her erotic powers long enough to play his game?THE WARM UP, Xio Axelrod - Toss a stoic defenseman, a no-nonsense nurse, and a ward full of crafty children in a Cup and anything can happen.CHECK MY HEART, Christi Barth - The only thing that will make him happy again is the one woman he can't have . . .FULL CONTACT, Andie J. Christopher - This player has a bounty on his virginity. She has him up against the boards.BLADE, Avery Flynn - Sometimes the line between love and insanity is as thin as an ice skate's blade.UNDER THE MIDNIGHT SUN, Kim Golden - When it comes to the game of love, he's playing to win.COURAGE, Lena Hart - This hot-tempered coach is fully prepared to fight for his wife--but can he win back her heart?PENALTY BOX BLUES, Robin Kaye - The only woman who knows his secret can slam his heart against the boards with a sideways glance. He is so pucked.BEAR NAKED, Katie Kenyhercz - When he sets his sights on a goal, it's only a matter of time.IN SKATES TROUBLE, Kate Meader - Can a passion that started in the dark find a lifetime of love in the light?MAKING HIS MOVE, Susan Scott Shelley - Making impossible saves is easy compared to falling in love.CHECKING YES, Misty D. Waters - She'll send him to the penalty box, and keep him there . . . for good this time.",
  "genres": [
    "Anthologies",
    "Romance",
    "Sports",
    "Contemporary Romance",
    "Sports Romance",
    "Contemporary",
    "Hockey"
  ],
  "author": "Avery Flynn",
  "average_rating": "4.14",
  "url": "https://www.goodreads.com/book/show/33216592-hot-on-ice"
}