{
  "title": "Advocate of the truth",
  "description": "This gripping thriller paints a grim picture of what the future may have in store for usWhen Thomas, a former partner of a prestigious law firm, promises his best friend Sam to keep his groundbreaking Spider technology away from mankind, he has no clue what awaits him.A chilling scenario unfolds when Thomas is plunged into a web of greed, corporate espionage, organized crime and murder. As he finds signs pointing to a high-level conspiracy, a mysterious and deadly virus originating in Europe sweeps across the earth. Frightened politicians take advantage of the panic, with populism hitting fear buttons worldwide. A pandemic is looming, and so is anarchy.Suddenly Sam’s Spider technology has life-saving potential, raising profound ethical questions:Do we allow fear, greed and status to overrule the natural bonds between people? Should the privacy of individuals be sacrificed to the illusion of safety? How do we prevent technology from casting a dark shadow over the future? And ultimately: is mankind nearing its expiration date?His tense search for the truth leads Thomas to the medieval Italian city Assisi, oppressive boardrooms, back alleys, dimly-lit churches and a former monastery overlooking the Mediterranean. Meanwhile, he has two women vying for his heart: Sophia, a sensitive violinist who cared for his father in the final days of life, and Juliëtte, an alluring and intriguing Parisian he meets by chance in Tuscany.Advocate of the truth is a thriller about the digital dragon that feeds on our privacy and the serious implications of nanochips registering and managing human behavior. On a more personal level, it is a deeply moving novel about friendship, love and the compassion Francis of Assisi stands for. This fast-paced literary thriller prompts you to reflect on wisdom from the past and ethics for the future. It is an intense struggle between good and evil that hits home in today’s society.Librarian's note: See alternate cover edition of ISBN 949237112X here.",
  "genres": [],
  "author": "Adriaan Bos",
  "average_rating": "4.41",
  "url": "https://www.goodreads.com/book/show/33209714-advocate-of-the-truth"
}