{
  "title": "The White King: Charles I, Traitor, Murderer, Martyr",
  "description": "WINNER HISTORICAL WRITERS ASSOCIATION NON-FICTION CROWN 2018From the New York Times Bestselling author and master of narrative nonfiction comes the critically acclaimed story of Charles I, his warrior queen, Britain's civil wars and the trial for his life.Barely forty years after the England's golden age under Elizabeth, the country was at war with itself, split between loyalty to the Crown and Parliament, with armies raised in Scotland and Ireland, and fighters arriving from Europe to wage war on English soil for the last time in England's history. The English Civil War would set family against family, friend against friend, and its casualties were immense—a greater proportion of the population than in World War I. England had become a failed state.At the head of the disintegrating kingdom was the figure of the king: Charles I. In this vivid portrait—newly informed by previously unseen manuscripts, including royal correspondence between the king and his queen, some of it written in code—Leanda de Lisle depicts a man who was not cruel enough for his cruel times. He would not persecute his opponents in the bloody style of his Tudor antecedents, or throw his servants to the wolves to save his own skin in the time-honored royal style. He was tutored by his father in the rights and obligations of kings, but had none of his father's political subtlety and experience in survival. In a court of remarkable women he was happily married—but to a French Catholic princess, which caused consternation to his protestant subjects. Principled and high minded, he would pay a terrible price for the personal honor he so valued, and for having enemies more ruthless than he was. Nothing, however, would reflect on his character as much as the scene at his terrible death, speaking on the scaffold as a “martyr of the people.”In his own destruction Charles did not sow the seeds of the monarchy's destruction but its rebirth. England's revolution lasted eleven unhappy years and the Crown was then restored, to national rejoicing. Today England enjoys rule by parliament and monarch while the Church of England has the bishops Charles was determined to preserve. More radical religious experimenters took their faith to the New World and the seeds of a republic, leaving England to mend its wounds and restore its fortunes and future as the world's preeminent constitutional monarchy.",
  "genres": [
    "History",
    "Biography",
    "Nonfiction",
    "British Literature",
    "Historical",
    "European History",
    "17th Century"
  ],
  "author": "Leanda de Lisle",
  "average_rating": "4.09",
  "url": "https://www.goodreads.com/book/show/33224078-the-white-king"
}