{
  "title": "Izzy & Lenore: Two Dogs, an Unexpected Journey, and Me",
  "description": "New York Times BestsellerIn his previous books, New York Times bestselling author Jon Katz introduced us to the delightful menagerie at Bedlam Farm, including Izzy, the unforgettable border collie rescue. Now, in Izzy & Lenore, Katz delves deeper into his connection with the beautiful, once-abandoned dog, learning yet again about the unexpected places animals can take us. Affectionate and intuitive, Izzy is unlike any dog Katz has encountered, and the two undertake a journey Katz could not have imagined without the arrival of a new companion: a spirited, bright-eyed black Labrador puppy named Lenore.As trained hospice volunteers visiting homes and nursing facilities in upstate New York, Katz and Izzy bring comfort and canine companionship to people who most need it. An eighty-year-old Alzheimer’s patient smiles for the first time in months when she feels Izzy’s soft fur. A retired logger joyfully remembers his own beloved dog when he sees Izzy. As Izzy bonds with patients and Katz focuses on their families, the author begins to come to terms with his own life, discovering dark realities he has never confronted. Meanwhile, Lenore–quickly dubbed the Hound of Love–arrives at Bedlam. Her genial personality and boundless capacity for affection steer Katz out of the shadows, rekindle his love of working with dogs, and restore his connection to the farm and the animals and people around him.Humorous and deeply moving, Izzy & Lenore is a story of a man confronting his past, embracing the blessings of his current life, and rediscovering the meaning of friendship, family, and faith. Katz shares an uplifting tale of love, compassion, and the rich and complex relationships between dogs and their humans.",
  "genres": [
    "Animals",
    "Nonfiction",
    "Dogs",
    "Memoir",
    "Audiobook",
    "Biography",
    "Book Club"
  ],
  "author": "Jon Katz",
  "average_rating": "4.10",
  "url": "https://www.goodreads.com/book/show/3321719-izzy-lenore"
}