{
  "title": "Management 3.0: Leading Agile Developers, Developing Agile Leaders (Addison-Wesley Signature Series",
  "description": "In many organizations, management is the biggest obstacle to successful Agile development. Unfortunately, reliable guidance on Agile management has been scarce indeed. Now, leading Agile manager Jurgen Appelo fills that gap, introducing a realistic approach to leading, managing, and growing your Agile team or organization. Writing for current managers and developers moving into management, Appelo shares insights that are grounded in modern complex systems theory, reflecting the intense complexity of modern software development. Appelo’s Management 3.0 model recognizes that today’s organizations are living, networked systems; and that management is primarily about people and relationships. Management 3.0 doesn’t offer mere checklists or prescriptions to follow slavishly; rather, it deepens your understanding of how organizations and Agile teams work and gives you tools to solve your own problems. Drawing on his extensive experience as an Agile manager, the author identifies the most important practices of Agile management and helps you improve each of them. Coverage includes • Getting beyond “Management 1.0” control and “Management 2.0” fads• Understanding how complexity affects your organization• Keeping your people active, creative, innovative, and motivated• Giving teams the care and authority they need to grow on their own• Defining boundaries so teams can succeed in alignment with business goals• Sowing the seeds for a culture of software craftsmanship• Crafting an organizational network that promotes success• Implementing continuous improvement that actually works Thoroughly pragmatic–and never trendy–Jurgen Appelo’s Management 3.0 helps you bring greater agility to any software organization, team, or project.",
  "genres": [
    "Management",
    "Leadership",
    "Business",
    "Nonfiction",
    "Software",
    "Programming",
    "Technology"
  ],
  "author": "Jurgen Appelo",
  "average_rating": "4.15",
  "url": "https://www.goodreads.com/book/show/10210821-management-3-0"
}