{
  "title": "Tenacity",
  "description": "WAR, HEARTBREAK, MORE WAR…AND A NEW FRIENDIn the fifth epic of the Rise of the Iliri, Auryn Hadley interjects a compelling sci-fi action fantasy with a heart-warming tale of everyday community and the heart-wrenching reality of war—and the loss it mandates. A jarring emotional roller coaster, Tenacity tells the age-old tale of pure love amidst a struggle between good and evil—but with a heaping dose of the light-hearted, cross-cultural birds and bees. This one has plenty of laughs. And plenty of heartbreak. Slowly, region by region, the Lieutenant Salryc Luxx and her elite Black Blades are pushing forward and liberating an enslaved nation from the emperor’s reign of terror. But the battle’s not without consequence.While scoping out the quiet remains of a fallen town—too quiet, actually—they discover scores of slaughtered families. But they also discover life: a young girl, locked in a cage below a tavern. No one is certain exactly what she is. She has unusual streaks of red, blonde, and white hair, and two different-colored eyes. She’s fluent in iliri language, and she’s terrified. So terrified that when an officer approaches to unlock her, her fear burns a hole in his armor.The girl’s name is Shaden. She’s too young to know what exactly her talents are, or how to control them, but she’s powerful. Immediately recognizing Sal as the fabled Kaisae, she trusts only Sal. Meanwhile, as the Black Blades continue their assault on a city thought to be impenetrable, Shaden manages to harness her power to help keep her newfound family of warriors safe. But for Sal’s part, Shaden triggers difficult emotional memories of her own enslavement as a girl. And her longing to free anyone she can.With every win, Sal is bombarded by the thanks of those she rescued, and the disdain of those whose families she could not save. She can’t sleep, she can’t eat … but she cannot stop fighting, either.Victory is near. The Emperor is losing. He knows this. He knows Sal’s responsible, and he knows exactly how to destroy her—go after those she loves most.Women readers will thrill to the reverse harem idea that pushes the boundaries of epic fantasy in this breathtaking series that may remind some of Avatar without the scary beasts; or even Game Of Thrones, but happier, with more color—plus a dazzling female protagonist and plenty of action. Fans of Anne McCaffrey’s Dragonriders of Pern will find Sal’s planet Ogun a thrilling destination for their next fantasy fix.Like all the books on this series, Tenacity is a complete novel, not a cliffhanger. And because the illiri have insatiable and exotic sexual instincts, the smoking hot sex may make it unsuitable for humans under 18.",
  "genres": [
    "Reverse Harem",
    "Fantasy",
    "Romance",
    "Science Fiction",
    "Paranormal",
    "Aliens",
    "Military Fiction"
  ],
  "author": "Auryn Hadley",
  "average_rating": "4.63",
  "url": "https://www.goodreads.com/book/show/33224636-tenacity"
}