{
  "title": "80,000 Hours: Find a fulfilling career that does good",
  "description": "Find a fulfilling career that tackles the world's most pressing problems, using this guide based on five years of research alongside academics at Oxford. You have about 80,000 hours in your 40 hours a week, 50 weeks a year, for 40 years. This means your choice of career is one of the most important decisions you’ll ever make. Make the right choices, and you can help solve some of the world’s most pressing problems, as well as have a more rewarding, interesting life. For such an important decision, however, there’s surprisingly little good advice out there. Most career advice focuses on things like how to write a CV, and much of the rest is just (misleading) platitudes like “follow your passion”. Most people we speak to don’t even use career advice – they just speak to friends and try to figure it out for themselves. When it comes to helping others with your career, the advice usually assumes you need to work as a teacher, doctor, charity worker, and so on, even though these paths might not be a good fit for you, and were not what the highest-impact people in history did. This guide is based on five years of research conducted alongside academics at the University of Oxford. It aims to help you find a career you enjoy, you’re good at, and that tackles the world’s most pressing problems. It covers topics 1. What makes for a dream job, and why “follow your passion” can be misleading. 2. Why the most effective ways to make a difference aren’t always the obvious ones like working at a charity, or becoming a doctor. 3. How to compare global problems, like climate change and education, in terms of their scale and urgency. 4. How to discover and develop your strengths. It’s also full of practical tips and tools. At the end, you'll have a plan to use your career in a way that's fulfilling and does good. What people are saying “Based on evidence and good sense, not platitudes” - Steven Pinker, New York Times bestselling author Johnstone Family Professor of Psychology at Harvard University. “This incredible group is helping people have a greater social impact with their careers.” - Sue Desmond-Hellmann, CEO of the Bill and Melinda Gates Foundation. “Every college grad should read this” - Tim Urban, creator of Wait But Why. Read more online This book is based on the free guide you can find on the 80,000 Hours website, where you can find many more articles and our most up-to-date content. All profits from the book are used to fund 80,000 Hours, expanding our research and enabling us to reach more people. About the authors 80,000 Hours is an independent non-profit founded in Oxford in 2011. It performs research into career choice, and provides online and in-person advice. Benjamin Todd is the CEO and co-founder of 80,000 Hours. He grew the organization from a student society at Oxford to a non-profit that's raised $1.3m in donations, and has 100,000 monthly readers. He has a Master’s degree in Physics and Philosophy from Oxford; has published in climate physics; and speaks Chinese, badly. Ben is advised by the rest of the 80,000 Hours team, including Professor Will MacAskill, author of Doing Good Better, co-founder of the Effective Altruism movement, and the youngest tenured professor of philosophy in the world.",
  "genres": [
    "Nonfiction",
    "Self Help",
    "Business",
    "Philosophy",
    "Productivity",
    "Personal Development",
    "Economics"
  ],
  "author": "Benjamin Todd",
  "average_rating": "3.94",
  "url": "https://www.goodreads.com/book/show/33229792-80-000-hours"
}