{
  "title": "Boomer Reinvention: How to Create Your Dream Career Over 50",
  "description": "Faced with low retirement savings, extended longevity and rampant ageism, the baby boomer generation (born 1946-1964) is in the throes of a career and financial crisis. With less than 25% of the generation financially prepared to retire, the majority (between 60 – 70 million Americans) are going to need to keep working for as long as possible. But how can they find jobs or start businesses in a marketplace that appears unwilling to appreciate them for their experience and wisdom.Career coach John Tarnoff is convinced that the future is promising for boomers – IF they are willing to engage with the “new” economy in a new way. In \"BOOMER REINVENTION: How to Create Your Dream Career Over 50,\" Tarnoff lays out a proven methodology of 5 key steps and 23 actionable strategies to give boomers the resources and confidence they need to pivot to a sustainable second act, encore career – one that can be not only financially successful, but personally fulfilling as well.  In BOOMER REINVENTION, Tarnoff, a non-traditional career reinvention coach, psychologist, and former Hollywood executive, provides a comprehensive, flexible, step-by-step guide for anyone over 50 to create the second act career of their dreams. Rather than fitting job seekers into predetermined job categories, he advocates developing a career vision based on their untapped talents and skills honed by decades of experience and wisdom, and implementing it through 21st century tools, techniques and practices.  Fired 39% over the course of his 40-year career, Tarnoff shares the secrets to turning his own setbacks into successes, and interviews seven other boomers who reinvented their own careers. Overcoming significant obstacles in the process, they utilized and benefitted from the same methodologies Tarnoff has outlined and shared in this book. He stresses that career reinvention is not an overnight process or a quick fix. Nor does it necessarily need to be a radical plunge into the unknown. It may, in fact, entail re-committing to and reinvigorating a current job or existing business from a new perspective.  What makes Tarnoff’s method so effective are his positive, yet contrarian viewpoints, for instance:  •\tDon’t try to figure out what job or business you can fit into out there in a sea of job postings. Instead, figure out what job or business is already inside you, and network your way to the decision makers who will embrace your skills and talents, and make that heartfelt vision a reality. •\tIn order to create a new future, you must reconcile your past. You must first deal with all the old baggage and self-limitations that are likely standing in your way. •\tEmbrace your age, don’t hide it. It’s time to reframe your beliefs about who you are and what you can do, and to leverage the wisdom and experience you’ve acquired. •\tStop feeling that having been fired or downsized is shameful. At this point, it’s time to be grateful for the lessons those experiences taught you.  For those who both want and need to keep working beyond traditional retirement, Tarnoff’s practical strategies offer a flexible DIY solution for late career professionals at any stage of the career reinvention process, including:  •\tCreate a “Living Vision” of where you see yourself in one year’s time. Make it expansive and ambitious, but keep it realistic! Make it at least 50% believable. •\tYour resume won’t get you hired. 85% of jobs are filled through referrals. Use social media to build relationships and an active professional network. •\tDon’t feel daunted by tech: Boomers invented the digital revolution (Bill Gates, Steve Jobs, etc.) Embrace it! •\tNail your interviews by thinking like a consultant, not an employee. Turn the interview process to your advantage and be a problem solver before you even get the offer. •\tIgnore ageism. Be confident – but not arrogant - in what you know and who you are. Show by your attitude that you’re there to be of service and to provide value.  The Boomer Reinvention methodology is not a quick fix. It is like training for a marathon, using Tarnoff’s steps and strategies to build conviction, stamina, confidence and purpose. BOOMER REINVENTION is an indispensable guide to encourage self-reflection and effect change, leading the reader through the necessary steps to make career reinvention accessible and achievable.",
  "genres": [
    "Business",
    "Nonfiction"
  ],
  "author": "John Tarnoff",
  "average_rating": "3.84",
  "url": "https://www.goodreads.com/book/show/33240121-boomer-reinvention"
}