{
  "title": "Hatching Charlie: A Psychotherapist's Tale",
  "description": "McCormack was asked two questions by his children that unerringly targeted issues he had struggled with his entire life: \"Who are you?\" and \"What is life about?\" Hatching Charlie, his attempt to respond, rocketed him down a wormhole through time, his past made present. He re-lives the disruptions of military family life, family violence, the racism of the Jim Crowe South, and the tidal wave of fear and confusion when exiled to a boarding school in France as a child. With unalloyed frankness, McCormack, an award-winning psychotherapist, author, and lecturer, takes us into the mental illness in his own family, and the destructive influence of his cratered childhood upon his adulthood. During this journey, we go behind the scenes of psychiatric treatment, including a vivid portrayal of McCormack’s experience in psychoanalysis and as a psychiatric social worker in a locked-door inpatient treatment unit. There, we become engulfed in the penetrating horror and self-doubt when confronted with the suicide of several patients, as well as the profound sense of fulfillment experienced when able to help those who had been unable to help themselves. In his striving for happiness and meaning, McCormack arrives at the realization that there was an enduring block to happiness and that it resided within himself. Rejecting this self-limiting fate, he pecks away at the shells that confine him like a Russian nesting doll and discovers first-hand the hidden power of incomplete mourning to constrict happiness like English ivy strangles a tree. In this moving memoir, there is wisdom about life, love, and relationships that will bring tears to your eyes and a smile to your face.",
  "genres": [
    "Memoir",
    "Health",
    "Nonfiction",
    "Biography Memoir",
    "Self Help",
    "Mental Health"
  ],
  "author": "Charles C.  McCormack",
  "average_rating": "4.43",
  "url": "https://www.goodreads.com/book/show/33238575-hatching-charlie"
}