{
  "title": "Silhouette",
  "description": "Librarian's Note: An alternate cover for this ASIN can be found here\"Daddy, what is a white lie?\"My father put down his spoon and looked at me thoughtfully.\"Why'd you ask, Princess?\"\"I heard you talking yesterday and you said 'one more white lie isn't going to make a difference.' I just want to know what you meant.\"\"You heard that, huh?\" My father tilted his head to study me. \"It's just a small lie you tell when you don't want to hurt someone's feelings. It's nothing for you to worry about.\"My eyes grew wide. \"Like when you told Aunt Rena that her pie was good even though it tasted icky?\"\"Exactly.\" He smiled.\"Or when you told the man last week that you hadn't seen Uncle Bruno and you had?\"The Smile fell from his face and he straightened in his chair. \"No, Princess, that was a different kind of lie.\"Scrunching up my nose, I asked, \"What kind of lie was that?\"My father swallowed hard before replying. \"That's the kind of lie where you have to have a real good memory.\"As an inquisitive child, the woman known as Clarissa Solano, could never have imagined how significant those words would become. That she would spend years twisting the truth: hoping and praying that she would not contradict herself and expose the secrets she keeps locked inside.Most of the people in her life don't really know her at all. She forces them to swallow her lies, but she is the one who feels the bitter aftertaste of deception.When Lane Hunter sweeps into her life, she finds herself opening up in ways she never thought possible. He sees beyond the façade to the woman beneath and knows instantly that he wants her. However, all is not as it seems and when secrets and lies are exposed, it threatens to destroy them all.This is the first STANDALONE HEA in The Hunter Series",
  "genres": [
    "Romantic Suspense",
    "Romance"
  ],
  "author": "S.E. Cooper",
  "average_rating": "4.37",
  "url": "https://www.goodreads.com/book/show/33241853-silhouette"
}