{
  "title": "All The Shah's Horses",
  "description": "As the wife of an American businessman, the author spent the better part of the 1970’s in Iran where she witnessed the boom of the Shah’s development and great vision for Iran to be recognized internationally in every field; it was to be Iran’s Great Civilization. Mohamed Reza Pahlavi followed his father Reza Shah’s vision to make Iran the leading power in the Middle East. He wanted his country once again to become as powerful as the Great Persian Empire of the past. He believed that by developing industry, education, economics, and the military, his dream could come to fruition. He was also a sportsman and realized that his people needed leisure time, and so he encouraged and supported sports activities. The Iran of the 60’s and 70’s was a country with the most beautiful snow skiing in the world; it had a world-renowned soccer program; there were country clubs and civic parks with golf courses, tennis courts, swimming pools, and just about every activity anyone might want. The Shah’s true love, however, was horses. Perhaps as a result, he promoted and supported all types of equestrian activities. An invitation to work for the Imperial Court as his horse trainer enabled the author to see many of the royal family in informal moments; it also gave her an entrée into high society, and this enabled her to observe the upper class of Iranians at play. Many of the generals and court officials spent much time in Tehran and the coastal resorts junketing and enjoying many different sports, indulging themselves to the fullest. This is a book of stories and anecdotes about her life there during the “Golden Years” of the reign of Mohammed Reza, Shahanshah Aryamehr. There were times of joy, fun, stress, accomplishment and sadness during her time in that beautiful Middle Eastern country. You will enjoy the ride!",
  "genres": [
    "Iran",
    "Horses",
    "Nonfiction"
  ],
  "author": "Gail Rose Thompson",
  "average_rating": "3.83",
  "url": "https://www.goodreads.com/book/show/33233373-all-the-shah-s-horses"
}