{
  "title": "What Manner of Man Is This?: The Duke of Windsor's Years in The Bahamas",
  "description": "What Manner of Man Is This? is a unique and incisive look at an important but largely ignored period of the life of the Prince of Wales who was heir to the British throne and became King of England, Edward VIII, in 1936. A mere ten months later he abdicated the throne to marry a twice-divorced American, Mrs. Wallis Simpson in what was at once the scandal of the century and the love story of the age.Many books have been written about the royal couple, The Duke and Duchess of Windsor, but this focuses exclusively on The Duke's tenure as Royal Governor of The Bahamas in a tumultuous era during which major events and programs occurred including the murder of Sir Harry Oakes, the richest man in the British Empire at that time, all set against the backdrop of World War II raging in Europe.This book also stands apart from others because its author, Sir Orville Turnquest, speaks with the authority and credibility of someone who has occupied the very same office as the Duke of Windsor. Sir Orville did not, however, come from a royal or aristocratic family but rather, in sharp contrast to his predecessor, he came from an area of Nassau inhabited by the underprivileged black community and thus provides a perspective that could not be more different from those of a former King of England.What Manner of Man Is This? is an insider's look at a vital part of Bahamian history with the island nation's emergence from slavery and the African diaspora to a prominent role in world history.\"To his credit, Turnquest has written a book that is not a sanitized biography of The Duke of Windsor but rather an incisive examination of a small but enormously important slice of the life of this notorious man, a former King of England. . . . Sir Orville Turnquest, orator, top litigator and esteemed elder statesman as former Governor General and head of state of The Bahamas, has shown the insight and courage to give his country and the world an extraordinary book about a man and a nation that converged at a critical time in global and Bahamian history.\"--Sir Sidney Poitier, from the Foreword of What Manner of Man Is This?\"An insightful, informative book and important addition to the literature of the development of The Bahamas. . . . Turnquest has produced an easy, readable history of the period, well-informed by his own personal experience as a young black, who overcame the absence of opportunities gifted to the Duke of Windsor to become the Duke's successor in the office of Governor General of an independent Bahamas.\"--Rt. Hon. Hubert A. Ingraham, Former Prime Minister of The Bahamas\"What a fascinating story! ...With simple, yet powerful language the author has captured the essence of the life and times of the period factually, graphically and senstively. A great read!!\"--Dame Ivy Dumont, Former Governor General of The Bahamas\"The elements could not be more conducive to a fascinating a world at war, a sleepy but strategically-located British colony, a great love story, a former king as governor of a tiny colony, the beginning of social upheaval. Sir Orville weaves all these elements together to produce a highly readable book.\"--Sir Arthur Foulkes, Former Governor General of The Bahamaswww.grantstownpress.com",
  "genres": [
    "Historical",
    "Nonfiction"
  ],
  "author": "Orville Turnquest",
  "average_rating": "3.68",
  "url": "https://www.goodreads.com/book/show/33245958-what-manner-of-man-is-this"
}