{
  "title": "Up the Country: Letters from India",
  "description": "Up the Country is a series of letters and journals that Emily Eden wrote to her sister between 1837 - 1839 when, her brother Lord Auckland traveled from Calcutta, the then capital of British India to Shimla, the summer capital of British India and back. To give the readers a bit of a background, the Eden’s were a prominent aristocratic family of England and Lord Auckland her brother, was Baron Eden, of Norwood in the County of Surrey, and Earl of Auckland. He served as the Governor General of India between 1836 - 1842 and during this tenure, his sister Emily and Fanny accompanied him to India and served as the hostess for the Governor General. During his tenure, Lord Auckland made a land trip between Calcutta and Shimla and back to Calcutta, a combined distance of approx. 4200 kilometers, with all the camp paraphernalia of elephants, camels, and camp followers, which took him 2 years in an era, before the introduction of railways in India.Emily Eden captures all the joy, irony and tragedy of traveling continuously for 2 years and living in the camp, with all the regal majesty that befits the representative of the King of England in India. Emily Eden was born in 1797 into the charmed inner circle of the English upper class who conducted the country's political life. In 1836 this prominent member of Whig society joined her brother George in India where he was Governor-General. She stayed there for six years, during which time she embarked on a two-year-long tour of the country. With an unfailing eye for the eccentric and picturesque, Emily Eden describes in her delightful letters the extraordinary experiences encountered in life on the road in early eighteenth-century India.",
  "genres": [
    "India",
    "Travel",
    "Nonfiction",
    "History",
    "Biography",
    "Victorian",
    "Memoir"
  ],
  "author": "Emily Eden",
  "average_rating": "3.63",
  "url": "https://www.goodreads.com/book/show/1202332.Up_the_Country"
}