{
  "title": "Giants: The Parallel Lives of Frederick Douglass and Abraham Lincoln",
  "description": "Frederick Douglass and Abraham Lincoln were the preeminent self-made men of their time. In this masterful dual biography, award-winning Harvard University scholar John Stauffer describes the transformations in the lives of these two giants during a major shift in cultural history, when men rejected the status quo and embraced new ideals of personal liberty. As Douglass and Lincoln reinvented themselves and ultimately became friends, they transformed America.Lincoln was born dirt poor, had less than one year of formal schooling, and became the nation's greatest president. Douglass spent the first twenty years of his life as a slave, had no formal schooling-in fact, his masters forbade him to read or write-and became one of the nation's greatest writers and activists, as well as a spellbinding orator and messenger of audacious hope, the pioneer who blazed the path traveled by future African-American leaders.At a time when most whites would not let a black man cross their threshold, Lincoln invited Douglass into the White House. Lincoln recognized that he needed Douglass to help him destroy the Confederacy and preserve the Union; Douglass realized that Lincoln's shrewd sense of public opinion would serve his own goal of freeing the nation's blacks. Their relationship shifted in response to the country's debate over slavery, abolition, and emancipation.Both were ambitious men. They had great faith in the moral and technological progress of their nation. And they were not always consistent in their views. John Stauffer describes their personal and political struggles with a keen understanding of the dilemmas Douglass and Lincoln confronted and the social context in which they occurred. What emerges is a brilliant portrait of how two of America's greatest leaders lived.",
  "genres": [
    "History",
    "Biography",
    "Nonfiction",
    "American History",
    "Civil War",
    "Presidents",
    "Politics"
  ],
  "author": "John Stauffer",
  "average_rating": "4.05",
  "url": "https://www.goodreads.com/book/show/3325528-giants"
}