{
  "title": "The Naked Neighbor",
  "description": "How can a man work when his sexy neighbor is always naked?Quaid Marshall's life has hit rock bottom. He's lost the most recent of his dead-end jobs, has been evicted from his apartment, and if not for his sister Dana's Smoky Mountain ski cabin, he'd be living under the overpass in a cardboard box. Dana says it's the perfect chance to finish that screenplay he's been avoiding for two years. Since the day he drove the car into that tree, killing his fiancé, David. The day Quaid's life went to hell. With nothing left to lose, his only option is to finish the stupid screenplay and enter it in the ScreenWay contest, with its $25,000 grand prize. But it isn't going well. His sister neglected to tell him about the next-door neighbor...the incredibly hot, incredibly tall, incredibly buff next-door neighbor...the one who likes to sunbathe...naked. Next to that buzzing hive of bees. With that hideous little...is that a dog? How the hell is Quaid supposed to write a horror script when all he can think of is the sexy opening of a romantic comedy? And how the hell is he supposed to look himself in the eye in the mirror every morning when he feels so disloyal to David's memory?Connor \"Mac\" MacPherson's balls are gonna fry to a crisp, and it'll be all Dana's fault. Mac's been out here for days, puttering around, sunbathing, and finally, taking it all off in hopes of getting noticed by his best friend's stubborn, brooding brother. When Dana asked him to try to get Quaid out of his shell, Mac agreed, sight unseen, because he loved his funny, quirky friend and would do anything to help her out. Even if her brother turned out to be a complete troll. But when he saw the Adonis that sidled out onto the deck that day, it went from mercy date to Lord have mercy... But all the man did was sit there pretending he didn't notice. He noticed, though. Oh, yeah. He noticed. And Mac wasn't about to let the Adonis ignore him any longer. After all, he'd promised Dana...",
  "genres": [],
  "author": "L.C. Carey",
  "average_rating": "3.85",
  "url": "https://www.goodreads.com/book/show/33246224-the-naked-neighbor"
}