{
  "title": "Hero",
  "description": "Fighting for love, honor, and freedom on the galaxy’s lawless outer rim…  Raised from birth to be a soldier, Kace Tameron is a disciplined, military-trained gladiator. He is on contract to the Kor Magna Arena to hone his fighting skills on the blood-soaked arena sand and then return to the military. He lives for one thing: to protect his planet, and on his world, love is forbidden. But then he collides with a feisty redhead from Earth who threatens to shatter his legendary control.  One moment, Rory Fraser was an engineer on a space station circling Jupiter and the next, she is abducted by evil alien slavers. After suffering at the hands of the Thraxians, she is rescued by her friends—with the help of the tough gladiators of the House of Galen. Rory finds herself outrageously attracted to straight-laced Kace. He is a skilled fighter, ultra-disciplined, and a hero at heart—but she knows passion beats within him, if only he’ll let it loose.  Rory is obsessed with finding another fellow abducted female from Earth, but as she asks questions, she finds herself ducking bullets and explosions. Someone wants Rory dead. Kace steps in as her protector, and together, they embark on a dangerous mission that will take them deep into the bowels of the arena, and deep into a scorching desire…both of which could lead them to lose not only their guarded hearts, but their lives as well.  Note to readers: This sci fi romance contains a lot of action (think wild gladiatorial fights and daring rescues), tough gladiators (the warriors of the House of Galen) and a steamy romance (between a feisty engineer and a disciplined, uptight gladiator). So if you like it fast, and gritty, and sexy, this is for you!  Includes a preview of Marcus, the first book in the Hell Squad series. ___________________________________________________  Q & A with the Author  Q - How would you describe the Galactic Gladiators series? A – Gladiators in space! The desert planet of Carthago is home to the Kor Magna Arena: it’s a mix of low and high tech. Think the Colosseum of Ancient Rome with a touch of professional sports and a side of Las Vegas glitz and temptation. You’ll see a lot of action-packed romance as women abducted from Earth clash with tough, gritty gladiators fighting for love, honor, and freedom.  Q - Why did you want to write the series? A – It’s no secret that I love action, adventure and romance. And I love science fiction romance and all the endless possibilities. Raiden, the gladiator hero of Gladiator, stormed into my head and wanted his story told. I saw this big, tough man covered in tattoos facing off with an equally tough female space marine from Earth. That’s where it all began, and since then the planet of Carthago, the intrigues of the Kor Magna Arena, and an amazing band of gladiators came to life.  Q - What order should I read the books in? A - All the Galactic Gladiator books will be stand-alone romances centered on the Kor Magna Arena, rescuing abducted humans, and making a life far from home. Here's the order I suggest:  - Gladiator - Warrior - Hero More gladiators coming soon!  About Anna: I'm passionate about all things action romance. I love stories that combine the thrill of falling in love with the excitement of action, danger and adventure. I write about people overcoming unbeatable odds and achieving seemingly impossible goals. I like to believe it's possible for all of us to do the same.",
  "genres": [
    "Romance",
    "Science Fiction",
    "Aliens",
    "Science Fiction Romance",
    "Paranormal Romance",
    "Fantasy",
    "Paranormal"
  ],
  "author": "Anna Hackett",
  "average_rating": "4.28",
  "url": "https://www.goodreads.com/book/show/33267330-hero"
}