{
  "title": "iGen: Why Today’s Super-Connected Kids Are Growing Up Less Rebellious, More Tolerant, Less Happy--and Completely Unprepared for Adulthood--and What That Means for the Rest of Us",
  "description": "A highly readable and entertaining first look at how today’s members of iGen—the children, teens, and young adults born in the mid-1990s and later—are vastly different from their Millennial predecessors, and from any other generation, from the renowned psychologist and author of Generation Me .With generational divides wider than ever, parents, educators, and employers have an urgent need to understand today’s rising generation of teens and young adults. Born in the mid-1990s to the mid-2000s and later, iGen is the first generation to spend their entire adolescence in the age of the smartphone. With social media and texting replacing other activities, iGen spends less time with their friends in person—perhaps why they are experiencing unprecedented levels of anxiety, depression, and loneliness.But technology is not the only thing that makes iGen distinct from every generation before them; they are also different in how they spend their time, how they behave, and in their attitudes toward religion, sexuality, and politics. They socialize in completely new ways, reject once sacred social taboos, and want different things from their lives and careers. More than previous generations, they are obsessed with safety, focused on tolerance, and have no patience for inequality. iGen is also growing up more slowly than previous eighteen-year-olds look and act like fifteen-year-olds used to.As this new group of young people grows into adulthood, we all need to understand Friends and family need to look out for them; businesses must figure out how to recruit them and sell to them; colleges and universities must know how to educate and guide them. And members of iGen also need to understand themselves as they communicate with their elders and explain their views to their older peers. Because where iGen goes, so goes our nation—and the world.",
  "genres": [
    "Nonfiction",
    "Psychology",
    "Parenting",
    "Sociology",
    "Technology",
    "Education",
    "Audiobook"
  ],
  "author": "Jean M. Twenge",
  "average_rating": "3.79",
  "url": "https://www.goodreads.com/book/show/33268384-igen"
}