{
  "title": "Bad Boys After Dark: Mick",
  "description": "BAD BOYS AFTER DARK: MICK is a USA TODAY BESTSELLERThe Bad Billionaires After Dark are a series of stand-alone romances that may also be enjoyed as part of the larger Love in Bloom series. Indulge your inner vixen with these sexy billionaires!Meet the Bad Boys... Four fiercely loyal, sinfully sexy, uber alpha brothers, about to fall head over heels for their leading ladies.Everything's naughtier after dark...Amanda Jenner is done being a boring-man magnet and has finally taken control of her love life. As any smart paralegal would, she's researched the hell out of how to seduce a man. She's waxed, primped, and ready to put her newfound skills into action--and a masquerade bar crawl is the perfect venue for her solo coming-out party.Entertainment attorney Mick Bad lives by two hard and fast rules. He never mixes business with pleasure, and he doesn't do relationships, which makes the anonymity of a masquerade bar crawl the perfect place for a onetime hookup.Amanda thinks she's hit the jackpot when she bags a tall, dark, and sinfully delicious masked man--until she discovers the man she's made out with is her off-limits boss. Mick's already crossed a line he can never uncross, and one taste of sweet and sexy Amanda has only whet his appetite. When Mick offers to give Amanda a lesson in seduction--no strings, no regrets, and for goodness' sake, come Monday, no quitting--the tables turn, and Mick's totally unprepared for the lessons this sweet temptress provides.***The Bad Boys After Dark books are long enough to burn up the sheets and short enough to leave you craving more.Read the whole Billionaires After Dark series:BAD BOYS AFTER DARKMickDylanCarson (coming soon)Brett (coming soon)More Billionaires After Dark books:WILD BOYS AFTER DARK (Available Now!)LoganHeathJacksonCooperThe BILLIONAIRES AFTER DARK series is part of the LOVE IN BLOOM big family romance collection. Each book may be read as a stand-alone novel, or as part of the series.",
  "genres": [
    "Romance",
    "Contemporary",
    "Contemporary Romance",
    "Erotica",
    "Adult",
    "Family",
    "Fiction"
  ],
  "author": "Melissa Foster",
  "average_rating": "4.28",
  "url": "https://www.goodreads.com/book/show/33278506-bad-boys-after-dark"
}