{
  "title": "Linhas do Destino: Angélica & Lorenzo",
  "description": "Ela precisa de proteção e ele precisa de amor. Ela precisa ser salva e ele anseia por salvá-la. Ela é calma e sensata, enquanto ele tem o caos dentro de si. Ambos serão unidos por um amor predestinado.Angélica sai do Brasil e vai morar com a mãe em uma cidade à beira-mar em Portugal, onde passa a ser alvo da obsessão do filho de um renomado político da cidade. Corajosa, mas muito sensível, ela consegue seguir em frente, mesmo vendo muitos dos seus sonhos se despedaçarem.Lorenzo , filho de um rico empresário italiano e mãe portuguesa, passa a morar sozinho em Portugal após o divórcio dos pais e a morte da mãe, que o fez acreditar que iria encontrar um anjo na sua vida — uma garota que o ajudaria a lutar contra os demônios que o dominavam desde criança. Dono de uma personalidade complexa, ele tem dificuldades em controlar o seu passado e direcionar o seu futuro, até conhecer Angélica.Quando os olhares se cruzam pela primeira vez, uma ligação imediata se faz sentir nos dois, dando-lhes a sensação de se conhecerem há muito tempo. Sentem uma conexão que nada consegue quebrar, mesmo quando precisam lutar contra demônios bem mais concretos do que aqueles que se escondem na mente de cada um deles — um cerco de inimigos dispostos a impedir que fiquem juntos. Porém, quando o destino já está traçado, atravessam-se oceanos e percorrem-se continentes inteiros, para que aquele que precisa salvar encontre quem precisa ser salvo.Uma história poderosa e arrebatadora, que conquistou corações no Brasil e em Portugal. Um romance ambientado na cidade do Porto em Portugal, com passagens pelo Recife e Rio de Janeiro no Brasil, unindo assim duas culturas irmãs que sempre estiveram ligadas pelas Linhas do Destino.Romance New Adult premiado com o Wattys 2016 do Wattpad.Série Linhas do Destino - Angélica & Livro 1 - Linhas do DestinoLivro 2 - O Anjo de LokiLivro 3 - Dominado Por Um Anjo",
  "genres": [],
  "author": "Lettie S.J.",
  "average_rating": "4.16",
  "url": "https://www.goodreads.com/book/show/33280018-linhas-do-destino"
}