{
  "title": "Nosotros los Dreamers: Life Stories on the Other Side of the Border",
  "description": "joven migrante, soñador indocumentado, que quiere alcanzar el \"sueño americano\". Este libro reúne un abanico de sus testimonios.En Nosotros los dreamers, Josefina Vázquez Mota se acerca a las leyes, a las estadísticas, pero sobre todo a las historias y a las emociones que se encuentran detrás de estas historias de vida.Al mes de agosto de 2016, se estima que en Estados Unidos habitan 35 millones de personas de origen mexicano, de los cuales 23.5 millones nacieron en Estados Unidos y 11.5 millones, en México. De estos últimos sólo 5 millones carecen de documentos, y dentro de este grupo 1.3 millones son considerados dreamers: jóvenes que fueron llevados por sus padres a Estados Unidos siendo niños, que crecieron y se educaron en ese país y que, al ser indocumentados, enfrentan mayores barreras para desarrollarse profesionalmente. Sin embargo, esto no les impide soñar.Los testimonios en Nosotros los dreamers son un abanico de miradas distintas y obstáculos diversos; sin embargo, son voces que no se han rendido y que, por el contrario, han creado o se han sumado a grupos activistas junto a muchas otras personas que desean ser escuchadas y reconocidas como ellos, con el único objetivo de alcanzar sus sueños. Conozcamos sus historias.Especialistas han \"Este libro es para los valientes, pues algunas de sus historias romperán el corazón de cualquier lector, sobre todo aquellas que son una letanía de puertas cerradas y oportunidades perdidas. Sin embargo, es una historia de perseverancia, de optimismo y de compromiso social por parte de jóvenesesperanzados. Con el afán de lograr sus propios sueños, los dreamers trabajan incansablemente para hacer el camino menos difícil para los que les siguen, y para minimizar los obstáculos que enfrentan otros jóvenes indocumentados y sus familias, mientras hacen campaña con fervor para una reforma migratoria.\" -Alyshia Gálvez, Profesora de CUNY-",
  "genres": [],
  "author": "Josefina Vázquez Mota",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/33279981-nosotros-los-dreamers"
}