{
  "title": "The FBI: Houston Collection: Firewall / Double Cross / Deadlock",
  "description": "This collection bundles all three of bestselling author DiAnn Mills’s Houston novels into one e-book for a great value!#1 Firewall (2015 Christy Award finalist; 2014 winner of a Genre Fiction award from Library Journal)After a whirlwind romance, Taryn Young is preparing to board a plane at Houston International Airport, bound for a dream honeymoon, when a bomb decimates the terminal. Injured but still alive, she awakens to discover her husband is missing and they’re both considered prime suspects in the attack. Further, the FBI is convinced her husband isn’t who he appears to be.Agent Grayson Hall’s number-one priority is to catch those responsible for the day’s act of terror. All evidence is pointing to Taryn and her new husband. But his instinct tells him her pleas of innocence are genuine. Is her naiveté just for show, or could she truly be another victim of a master scheme, possibly linked to the software she recently developed for her company?With both their lives and reputations on the line, and the media outcry for justice increasing with each passing minute, Taryn and Grayson have no choice but to trust one another . . . and pray they can uncover the truth before they become two more casualties.#2 Double CrossFBI Agent Laurel Evertson’s investigation into a scam targeting the elderly takes an unexpected twist when key evidence leads her to Morton Wilmington, a felon she arrested five years ago on her first undercover assignment. That case has haunted her since, and though she’s vowed to forget Wilmington—and what she sacrificed to put him away—he is now her best lead.Houston Police Officer Daniel Hilton fears his grandparents may be the scammer’s next targets, and he’ll do anything to protect his family—even force interagency cooperation. But he’s quickly drawn to Laurel’s empathy and zeal and agrees to follow her lead . . . even if it means teaming up with a felon.As the unlikely trio uncovers evidence suggesting the scam is more extensive and deadly than they imagined, both Laurel and Daniel find themselves in the crosshairs of a killer. Together they must decide if they can trust Wilmington’s claims of redemption, or if he’s leading them straight into a double cross.#3 DeadlockTwo murders have rocked the city of Houston. Are they the work of a serial killer, or is a copycat trying to get away with murder?That is the question facing Special Agent Bethany Sanchez, who is eager for her new assignment in violent crimes but anxious about meeting her new partner. Special Agent Thatcher Graves once arrested her brother, and he has a reputation for being a maverick. Plus, their investigative styles couldn’t be more he operates on instinct, while she goes by the book.When hot leads soon fizzle out, their differences threaten to leave them deadlocked. But an attempt on their lives turns up the heat and brings them closer together, and a third victim might yield the clue that will help them zero in on a killer. This could be the case of their careers . . . if they can survive long enough to solve it.",
  "genres": [],
  "author": "DiAnn Mills",
  "average_rating": "4.44",
  "url": "https://www.goodreads.com/book/show/33281086-the-fbi"
}