{
  "title": "Toward a Psychology of Being",
  "description": "\"If we wish to help humans to become more fully human, we must realize not only that they try to realize themselves, but that they are also reluctant or afraid or unable to do so. Only by fully appreciating this dialectic between sickness and health can we help to tip the balance in favor of health.\" Abraham MaslowAbraham Maslow's theories of self-actualization and the hierarchy of human needs are the cornerstone of modern humanistic psychology, and no book so well epitomizes those ideas as his classic Toward a Psychology of Being.A profound book, an exciting book, its influence continues to spread, more than a quarter century after its author's death, beyond psychology and throughout the humanities, social theory, and business management theory.Of course, the book's enduring popularity stems from the important questions it raises and the answers it provides concerning what is fundamental to human nature and psychological well-being, and what is needed to promote, maintain, and restore mental and emotional well-being. But its success also has to do with Maslow's unique ability to convey difficult philosophical concepts with passion, precision, and astonishing clarity, and, through the power of his words, to ignite in readers a sense of creative joy and wholeness toward which we, as beings capable of self-actualization, strive.This Third Edition makes Abraham Maslow's ideas accessible to a new generation of psychology students, as well as businesspeople, managers, and trainers interested in applying the study of human behavior to management techniques.An energetic and articulate scholar, Professor Maslow was the author of more than twenty books, including Eupsychian Management; Psychology of Science; Religions, Values, and Peak Experiences; Motivation and Personality; and Principles of Abnormal Psychology (with B. Mittelmann). He also edited New Knowledge in Human Values and wrote nearly one hundred articles. His teachings continue to be a staple for psychologists and psychology students.\"Capacities clamor to be used, and cease their clamor only when they are well used. . . . Not only is it fun to use our capacities, but it is necessary for growth. The unused skill or capacity or organ can become a disease center or else atrophy or disappear, thus diminishing the person.\" Abraham MaslowToward a Psychology of Being, Third EditionAbraham Maslow doesn't pretend to have easy answers, absolutes, or solutions that bring the relief of finalitybut he does have a deep belief in people. In this Third Edition of Toward a Psychology of Being (the original edition sold well over 100,000 copies), there is a constant optimistic thrust toward a future based on the intrinsic values of humanity. Professor Maslow states that, \"This inner nature, as much as we know of it so far, seems not to be intrinsically evil, but rather either neutral or positively 'good.' What we call evil behavior appears most often to be a secondary reaction to frustration of this intrinsic nature.\" He demonstrates that human beings can be loving, noble, and creative, and are capable of pursuing the highest values and aspirations.This Third Edition will bring Professor Maslow's ideas to a whole new generation of business and psychology readers, as well as anyone interested in the study of human behavior.",
  "genres": [
    "Psychology",
    "Nonfiction",
    "Philosophy",
    "Self Help",
    "Personal Development",
    "Science",
    "Classics"
  ],
  "author": "Abraham H. Maslow",
  "average_rating": "4.17",
  "url": "https://www.goodreads.com/book/show/332792.Toward_a_Psychology_of_Being"
}