{
  "title": "The Last Days of Disco, With Cocktails at Petrossian Afterwards",
  "description": "Opposites do attract—but is that really such a good idea?Whit Stillman has won international acclaim as one of the wittiest, most original filmmakers of his generation—“the Balzac of the ironic class, the Dickens of people with too much inner life,” in the words of Stephen Hunter in The Washington Post. Now, twisting the film novelization genre in an entirely new direction, Stillman has produced something equally fresh and surprising: a novel based on the characters and events touched on in The Last Days of Disco—the movie The New York Times called “deft, funny and improbably touching”—with results that are even defter, funnier, and more improbably poignant.Jimmy Steinway, the “Dancing Adman” of The Last Days of Disco (and, we later discover, a frustrated, desk-drawer novelist), gets his lucky break when Castle Rock Entertainment, unable to find anyone else to write a novelization of the movie, reluctantly gives the assignment to him. Jimmy struggles to bring to light the true origins of the story at Kate Preston’s party in Sag Harbor and the fast, then slow, then fast again unfolding of his love for Alice Kinnon, the boyfriendless social failure from Hampshire College whose quite charm detonated a bitter rivalry between him and four of his Harvard classmates. (He also sets the record straight about the beautiful, passionate, painfully candid Charlotte Pingree.)Set primarily in Manhattan in the early 1980s—but spanning two continents and two decades—The Last Days of Disco, with Cocktails at Petrossian Afterwards redresses the wrongs done these characters and this period, while helping to ameliorate the comic novel shortage in the world today.",
  "genres": [
    "Fiction",
    "New York",
    "Novels",
    "Film",
    "Literary Fiction"
  ],
  "author": "Whit Stillman",
  "average_rating": "3.83",
  "url": "https://www.goodreads.com/book/show/120242.The_Last_Days_of_Disco_With_Cocktails_at_Petrossian_Afterwards"
}