{
  "title": "Save a Life Certifications by NHCPS CPR, AED & First Aid Certification",
  "description": "The Save a Life Initiative has just released its newest course: CPR, AED & First Aid. This manual is based on the 2015-2020 CPR, AED, and First Aid guidelines published by the International Liaison Committee on Resuscitation and are designed to train people everywhere to respond to everyday emergencies. The course covers First Aid basics, including first aid kits, tooth injuries, bee stings, insect bites, nose bleeds, and other common problems. Advanced topics include heart attack, stroke, asthma emergencies, head injuries, burns, and more. Each topic is broken down into critical decisions to make and steps to take. This book will give you the confidence you need in situations that range from minor to crisis. The book also covers how to provide adult, child, and infant CPR, as well as the use of Automated External Defibrillators (AEDs). This course is written by Dr. Karl F. Disque, a board-certified anesthesiologist, and a registered pharmacist. Dr. Disque has certified thousands of healthcare professionals with his courses in Advanced Cardiac Life Support (ACLS), Pediatric Advanced Life Support (PALS), and Basic Life Support (BLS), and now he brings that same expertise to his first course designed for people in the community. This is one of the most effective and user-friendly training manuals on the market because it was created by a team dedicated to life support education with the goal of training people to help save lives. This manual is the primary training material for CPR, AED, and First Aid certification courses provided by Save a Life Certifications by NHCPS. While it is originally created for use during certification courses, the handbook is excellent reference material for both anyone to keep their everyday emergency response skills sharp.",
  "genres": [
    "Science"
  ],
  "author": "Karl Disque",
  "average_rating": "4.27",
  "url": "https://www.goodreads.com/book/show/33279038-save-a-life-certifications-by-nhcps-cpr-aed-first-aid-certification"
}