{
  "title": "Bad Boys After Dark: Carson",
  "description": "Alternate Cover Edition for ASIN: B01M8GBUKX\nBad Boys After Dark: Carson is a USA TODAY BESTSELLERIndulge your inner vixen with these sexy billionaires!Meet the Bad Boys... Four fiercely loyal, sinfully sexy, uber alpha brothers, about to fall head over heels for their leading ladies.\"​With her wonderful characters and resonating emotions, Melissa Foster is a must-read author!\" -NYT Bestseller Julie Kenner​\"Melissa Foster is synonymous with sexy, swoony, heartfelt romance!\" -NYT Bestseller Lauren Blakely​Everything's naughtier after dark...As the founder of a multimillion-dollar international security business, Carson Bad exposes secrets for a living. He knows better than to forge relationships built on them. But for years he did just that with his best friend, and secret lover, Tawny Bishop. She brought a sense of calm and understanding to his life—in and out of the bedroom. Until one fateful night when a knock at the door changed everything. Tawny is no longer a naive college student. She’s a sought-after perfumer living in Paris. She has plenty of resources at her fingertips, and lots of lonely nights to think about the only man she’s ever loved—the one she ran away from all those years ago. She needs to move forward with her life, but how can she when Carson still owns her heart? Maybe showing up in the middle of the night unannounced isn’t the best route to unraveling the past and figuring out her future, but Tawny has played it safe for ten long years, and it's only made her long for the man she never should have walked away from. Now she's back in Carson’s life, and he’s determined not to make the same mistake twice. If only he knew what that mistake was…",
  "genres": [
    "Romance",
    "Contemporary Romance",
    "Contemporary",
    "Second Chance",
    "Friends To Lovers",
    "Fiction",
    "Family"
  ],
  "author": "Melissa Foster",
  "average_rating": "4.36",
  "url": "https://www.goodreads.com/book/show/33278521-bad-boys-after-dark"
}