{
  "title": "The Monsters Under the Bed: and Other Spooky Stories for Kids",
  "description": "A collection of scary stories from the monsters under the bed.There are many scary things out there—bugs, ghosts, aliens, hungry beasts, and clowns—to name a few. Perhaps scariest of all of these things are monsters. They could be lurking in that dark corner, or just outside your window on a stormy night, or, worst of all, they could be waiting to grab your ankles from under the bed! Unknown creatures that might eat you or drag you back to their stinky lairs and never let you go. But what if even monsters got scared? What if they never wanted to scare you in the first place; just to be your friend? The following spooky stories are from the mouths of the monsters themselves so you can see their point-of-view and put yourself in their monstrous shoes to see what scares them.The stories in this collection are supposed to be a little scary and a little funny. The cast of storytellers each have several stories to share. Felipe Femur the skeleton is joined by Gilli the lagoon creature, Sunny the vampire, Oscar the magician, Wesley the black cat, Runny the witch, Gummy the werewolf, Clyde the ghost, Melody the banshee, Dale the creepy salesman, and Joe Miller the “average” guy... or is he? Find out more about the characters in the back of this book or visit their home on the web at www.felipefemur.com.Read along as Felipe Femur, the skeleton-with-a-lot-of-guts, faces his fears and discovers the beasts under his own bed; as Gilli Fishel the lagoon creature talks to the boy beneath the bathtub; as Runny the witch discovers what her scarecrow is really up to; and as Gummy the werewolf survives winter in the company of a cursed can opener.Whether you’re scared of the monsters under your bed or whether you want to meet them, you’ll be sure to enjoy the following collection of scary, but not-too-scary, bedtime stories and poems.",
  "genres": [],
  "author": "Russell J. Dorn",
  "average_rating": "4.33",
  "url": "https://www.goodreads.com/book/show/33296592-the-monsters-under-the-bed"
}