{
  "title": "The Alliance",
  "description": "This is an alternate and final cover edition for 9781370523979 \nNOTE\n: As of 12-Feb-2019 the book has undergone edits. Please update through your Amazon purchases page if you have bought the book from Amazon or PM me for an updated version of the book.The Alliance lays the groundwork for a 6-volume science fiction series, combining both space opera and post-apocalyptic elements of Earth's thrilling journey from dystopia to utopia to interstellar travel and space colonization, and the evolution of diverse societies—some human, some not—across the centuries, all in the shadow of a galactic menace. SeriesSummaryUnlikely heroes from across the Milky Way unite to thwart the crusade of an alien tyrant, only to discover that their involvement in intergalactic warfare is just one small part of a universal -- if not multiversal -- ploy.Book Summary - shortAs Earth succumbs to an otherworldly conquest, one civilisation fights to save its ancestral home, while another one, displaced and with nowhere to hide, must rely on the very tools that created this calamity.Book Summary - longInvasion has plagued entire continents, forcing human societies to live in the rubble and rust. Facing turmoil, famine, disease, the future seems bleak for the isolated pockets of resistance, and what lurks in the skies will not rest until it has claimed every single one.But in the infinitude of the universe, there may be hope, so long as humans can learn to trust the outsiders who claim responsibility for this calamity. Nearing extinction, do they have a choice?Outnumbered and outmatched, two species will have to depend on ancient combat suits and mysterious devices. But the greatest risk perhaps lies in their dependency on a man who has to make the ultimate sacrifice and a soldier with his fair share of ghosts.",
  "genres": [
    "Science Fiction",
    "Space Opera"
  ],
  "author": "Chris G. Wright",
  "average_rating": "3.95",
  "url": "https://www.goodreads.com/book/show/33290344-the-alliance"
}