{
  "title": "Air Awakens: Digital Boxed Set",
  "description": "The complete, five book Air Awakens series from author Elise Kova.  Air AwakensA library apprentice, a sorcerer prince, and an unbreakable magic bond...  The Solaris Empire is one conquest away from uniting the continent, and the rare elemental magic sleeping in seventeen-year-old library apprentice Vhalla Yarl could shift the tides of war.  Vhalla has always been taught to fear the Tower of Sorcerers, a mysterious magic society, and has been happy in her quiet world of books. But after she unknowingly saves the life of one of the most powerful sorcerers of them all--the Crown Prince Aldrik--she finds herself enticed into his world. Now she must decide her future: Embrace her sorcery and leave the life she's known, or eradicate her magic and remain as she's always been. And with powerful forces lurking in the shadows, Vhalla's indecision could cost her more than she ever imagined.FIRE FALLING, BOOK TWOSoldier... Sorcerer... Savior... Who is Vhalla Yarl?  Vhalla Yarl marches to war as property of the Solaris Empire. The Emperor counts on her to bring victory, the Senate counts on her death, and the only thing Vhalla can count on is the fight of her life. As she grapples with the ghosts of her past, new challenges in the present threaten to shatter the remnants of her fragile sanity. Will she maintain her humanity? Or will she truly become the Empire's monster?  EARTH'S END, BOOK THREE  A woman awoken in air, a soldier forged by fire, a weapon risen from blood.  Vhalla Yarl has made it to the warfront in the North. Forged by blood and fire, she has steeled her heart for the final battle of the Solaris Empire’s conquest. The choices before Vhalla are no longer servitude or freedom, they are servitude or death. The stakes have never been higher as the Emperor maintains his iron grip on her fate, holding everything Vhalla still has left to lose in the balance.WATER'S WRATH, BOOK FOURThe Solaris Empire found victory in the North and, at the cost of her heart and her innocence, Vhalla Yarl has earned her freedom. But the true fight is only beginning as the secret forces that have been lurking in the shadows, tugging at the strings of Vhalla's fate, finally come to light. Nowhere is safe, and Vhalla must tread carefully or else she'll fall into the waiting arms of her greatest foe. Or former lover. CRYSTAL CROWNED, BOOK FIVELong live Solaris.  One bloodthirsty ruler has been overthrown by another, casting the shadow of death over the Solaris Empire. Vhalla Yarl stands upon the stage of fate, prepared to do battle one final time. Fragile alliances will be tested and new bonds will be formed as the world is reshaped. She fights as the champion of peace, but when the night is darkest will she be able to pay the price of a new dawn?",
  "genres": [
    "Fantasy",
    "Romance",
    "Young Adult",
    "Fantasy Romance",
    "Audiobook",
    "Magic",
    "Fiction"
  ],
  "author": "Elise Kova",
  "average_rating": "4.45",
  "url": "https://www.goodreads.com/book/show/33288677-air-awakens"
}