{
  "title": "Sweet Barbarian",
  "description": "Look what the Chihuahua dragged in.\n When Karly wanders outside her mountain cabin into the snowstorm to see why her dog is going nuts, she’s expecting an injured animal, not a muscular mammoth of a man who’s unconscious and about to freeze to death if she doesn’t drag him inside and try to tend his wounds. He’s wearing only a few pieces of fur-and-leather armor—cosplayer or insane mountain man?—and his wild hair and beard haven’t seen a pair of scissors in a year or more. But when he wakes up and opens those amber-hazel eyes, Karly’s too caught off guard to protest his lack of appropriate clothing.  He doesn’t speak English, so Karly uses her skills as a foreign language teacher (and a lot of charades) to teach him. She needs to figure out who he is, why he’s dressed like a Skyrim character, what happened to him, and where he belongs so she can get him home.  That plan goes awry when his story starts coming out in broken English, and he claims to be a Visigoth from the year 483. Other than that little glitch, he doesn’t seem crazy, so Karly’s not sure whether to take him to the mental hospital or the homeless shelter. Or, just keep him around and drool over his hunky physique, his sweet smile, and his lion’s mane of hair. Plus, when her druggie ex-husband shows up high and hell-bent on manhandling Karly, it comes in handy to have a 6 foot 6 barbarian around to bounce him right on back to his Hummer with a bloody nose.  Valamir is condemned to execution, and the dungeon guards are on their way to his cell. So when his captor’s wife offers to use her Druidic powers to save his life in exchange for his undying pledge of love and loyalty, he sees no other way out. A quick blood-pact and hasty incantation later, he finds himself transported out of prison, trudging down a mountain in a blizzard and stumbling into the back yard of the most lovely guardian angel Wodin could have ever sent him. Karly is beautiful, smart, efficient, and caring—everything Valamir’s ever wanted in a woman. Only problem is, she suspects he’s either lying or delusional when he tells her where he’s from, a huge barrier to winning her trust and love. He has to find a way to prove himself to Karly while protecting her from her ex-husband and praying the Druidic priestess doesn’t make good on her promise to call him back to her side forever.",
  "genres": [
    "Time Travel",
    "Romance",
    "Fantasy",
    "Contemporary",
    "Magic",
    "Paranormal Romance",
    "Paranormal"
  ],
  "author": "Jayla Jasso",
  "average_rating": "3.88",
  "url": "https://www.goodreads.com/book/show/33292971-sweet-barbarian"
}