{
  "title": "The Invitation",
  "description": "From the author of the  New York Times  bestsellers  The Paris Apartment  and  The Guest List , an evocative love story set along the Italian Riviera about a group of charismatic stars who all have secrets and pasts they try desperately — and dangerously — to hide.Rome, 1953: Hal, an itinerant journalist flailing in the post-war darkness, has come to the Eternal City to lose himself and to seek absolution for the thing that haunts him. One evening he finds himself on the steps of a palazzo, walking into a world of privilege and light. Here, on a rooftop above the city, he meets the mysterious Stella. Hal and Stella are from different worlds, but their connection is magnetic. Together, they escape the crowded party and imagine a different life, even if it's just for a night. Yet Stella vanishes all too quickly, and Hal is certain their paths won't cross again.But a year later they are unexpectedly thrown together, after Hal receives an invitation he cannot resist. An Italian Contessa asks him to assist on a trip of a lifetime -- acting as a reporter on a tremendous yacht, skimming its way along the Italian coast toward Cannes film festival, the most famous artists and movie stars of the day gathered to promote a new film.Of all the luminaries aboard — an Italian ingénue, an American star, a reclusive director — only one holds Hal in Stella. And while each has a past that belies the gilded surface, Stella has the most to hide. As Hal's obsession with Stella grows, he becomes determined to bring back the girl she once was, the girl who's been confined to history. An irresistibly entertaining and atmospheric novel set in some of the world's most glamorous locales, The Invitation is a sultry love story about the ways in which the secrets of the past stay with us — no matter how much we try to escape them.",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Romance",
    "Audiobook",
    "Mystery",
    "Italy",
    "Historical"
  ],
  "author": "Lucy Foley",
  "average_rating": "3.59",
  "url": "https://www.goodreads.com/book/show/33296267-the-invitation"
}