{
  "title": "Cheyenne Summer",
  "description": "If you like the passionate historical western romances of Rosanne Bittner, you’ll love the Soul Searchers series by Vella Munn!  “Vella Munn is a major talent in historical fiction. Her stories never fail to lift the spirit and warm the heart.” —Bestselling author Susan Wiggs  As an endless drought scorches the land, the Cheyenne are in a desperate hunt for survival, but as they struggle to save themselves and ensure their future, it is the battle between two proud braves that might spell their demise.  Grey Bear is a courageous warrior who knows only battle and bloodshed, but he’s driven more by a need to fight and kill their enemy, the Pawnee, than to hunt food for his people. Promised in marriage to Seeks Fire, his bitter focus is slowly driving her away with fear for her own safety.  Wise and thoughtful Lone Wolf understands that the Pawnee must be suffering as much as the Cheyenne, but his efforts to temper Grey Bear’s rage and find a peaceful solution to the violence go unheeded. The quiet maiden Touches the Wind looks on admiringly as she dreams of winning his heart, even while fighting for their village.  When an unspeakable act threatens to tear the tribe apart, one warrior will face death, the other exile, and the women’s hope for love will turn to ash. And when things look their bleakest and the tribe’s survival seems all but lost, it will take a daring chance on love to save them all.  “Vella Munn is the absolute master [at creating] superior historical romances set among Native Americans . . .” —Oregon Statesman Journal    About the Author:  Vella Munn is the author of more than sixty novels, including the Soul Searchers series, the Soul Survivors series, and the Montana Lakeside series. She lives in Oregon and is the mother of two, grandmother of four, wife of one, and servant to two rescue dogs.",
  "genres": [],
  "author": "Vella Munn",
  "average_rating": "3.70",
  "url": "https://www.goodreads.com/book/show/33296665-cheyenne-summer"
}