{
  "title": "Violated: Exposing Rape at Baylor University amid College Football's Sexual Assault Crisis",
  "description": "In Violated, two ESPN investigative reporters provide readers with a shocking narrative of sexual crimes committed against women, and a university's culture that kept them quiet.Throughout its history, Baylor University has presented itself as something special. As the world's largest Baptist university, it was unabashedly Christian. It condemned any sex outside of marriage, and drinking alcohol was grounds for dismissal. Students weren't even allowed to dance on campus until 1996.During the last several years, however, Baylor officials were hiding a dark secret. Female students were being sexually assaulted at an alarming rate. Baylor administrators did very little to help victims, and their assailants rarely faced discipline for their abhorrent behavior.Finally, after a pair of high-profile criminal cases involving football players, an independent examination of Baylor's handling of allegations of sexual assault led to sweeping changes, including the unprecedented ouster of its president, athletics director, and popular, highly successful football coach.For several years, campuses and sports teams across the country have been plagued with accusations of sexual violence, and they've been criticized for how they responded to the students involved. But Baylor stands out. A culture reigned in which people believed that any type of sex, especially violent non-consensual sex, simply \"doesn't happen here.\" Yet it was happening. Many people within Baylor's leadership knew about it. And they chose not to act.Paula Lavigne, and Mark Schlabach, weave together the complex - and at times contradictory - narrative of how a university, and football program, ascending in national prominence came crashing down amidst the stories of woman after woman coming forward describing their assaults, and a university system they found indifferent to their pain.",
  "genres": [
    "Nonfiction",
    "True Crime",
    "Sports",
    "Gender Studies",
    "Football",
    "Crime",
    "Audiobook"
  ],
  "author": "Paula Lavigne",
  "average_rating": "4.12",
  "url": "https://www.goodreads.com/book/show/33296609-violated"
}