{
  "title": "Rum & Red Peppers: 80 Caribbean, Armenian, Middle Eastern & Mediterranean Recipes",
  "description": "Rum & Red Peppers features 80 easy-to-follow recipes, illustrated with 164 full-colour photographs. Classic, inspired, and brand new creations by Wayne Gerard Trotman and Sherrie Trotman that reflect the traditional cuisines and rich cultural diversity of Trinidad and Tobago, the Caribbean, Armenia, the Middle East and the Mediterranean.Traditional recipes include Caribbean Chicken Stew, Callaloo, Rice & Peas, Sorrel, Black Cake, Lamb & White Bean Stew, Dolma, Lahmajoon, Boreg, Tabouleh and Vospov Kufteh. Unique variations of popular drinks and dishes such as Cuba Roja, Wayne’s Mai Tai, Wayne’s Piña Colada, Christmas Crackers and Meatballs in Rum Sauce are also included together with new creations such as Rum & Red Peppers Chicken, Grilled Mango Chicken, Caribbean Sea Bream, Salsa Salmon, Boozy Fruit Cupcakes, Almond Berry Cake, Sorrel Sorbet, Black Rock, Fiery Passion and Spartan.Rum & Red Peppers was a finalist in the IAN Book of the Year Awards 2020.Reviewed by Michelle Stanley for Readers' Favorite - 5 StarsRum & Red Peppers: 80 Caribbean, Armenian, Middle Eastern & Mediterranean Recipes is written by Wayne and Sherrie Trotman. This selection offers traditional foods of the mentioned regions. Baked Omelet (Mediterranean) and Coconut Bake (Trinidadian) are breakfast staples. Meatballs in Rum Sauce, Salsa Salmon, Boreg, (Armenian) phyllo pastry with meat and cheese fillings looks tasty in the accompanying photos. So does the Lentil Soup, Caribbean Chicken Stew, and Lamb & Apricot Kebab. Sweet treats include Boozy Fruit Cupcakes, Apricot & Pistachio Crumble, Passion Fruit Sorbet and exotic ice-creams. Mauby, Fiery Passion, Cuba Roja, and Wayne’s Mai Tai are drinks worth sampling. Learn to brew Armenian Style Coffee to have with desserts like Almond Berry Cake.The recipes in Rum & Red Peppers are an infused combination of Wayne Gerard Trotman’s Trinidadian culture and that of his British Armenian wife, Sherrie. Their passion for spicy foods was stirred by their relatives who were skilled cooks in the kitchen. The simple recipes are color-coded to identify its country’s origin. All the ingredients are readily available and inexpensive. The “secret” condiments used to marinate meat and enhance sauces are Green Seasoning, Hot Pepper Chutney, and Rum & Red Peppers, the signature recipe and book’s title. Each chapter has blank pages to jot your personal notes on the recipes. I like the dishes, more so as they lack complex preparation. Rum & Red Peppers: 80 Caribbean, Armenian, Middle Eastern, and Mediterranean Recipes is a must-have if you enjoy ethnic foods and would like to learn to cook your favorite dishes.",
  "genres": [
    "Cooking",
    "Cookbooks"
  ],
  "author": "Wayne Gerard Trotman",
  "average_rating": "4.75",
  "url": "https://www.goodreads.com/book/show/33297393-rum-red-peppers"
}