{
  "title": "Roosevelt's Secret War: FDR and World War II Espionage",
  "description": "Despite all that has already been written on Franklin Delano Roosevelt, Joseph Persico has uncovered a hitherto overlooked dimension of FDR's wartime his involvement in intelligence and espionage operations.Roosevelt's Secret War is crowded with remarkable -FDR wanted to bomb Tokyo before Pearl Harbor-A defector from Hitler's inner circle reported directly to the Oval Office-Roosevelt knew before any other world leader of Hitler's plan to invade Russia-Roosevelt and Churchill concealed a disaster costing hundreds of British soldiers' lives in order to protect Ultra, the British codebreaking secret-An unwitting Japanese diplomat provided the President with a direct pipeline into Hitler's councilsRoosevelt's Secret War also describes how much FDR had been told--before the Holocaust--about the coming fate of Europe's Jews. And Persico also provides a definitive answer to the perennial question Did FDR know in advance about the attack on Pearl Harbor?By temperament and character, no American president was better suited for secret warfare than FDR. He manipulated, compartmentalized, dissembled, and misled, demonstrating a spymaster's talent for intrigue. He once remarked, \"I never let my right hand know what my left hand does.\" Not only did Roosevelt create America's first central intelligence agency, the OSS, under \"Wild Bill\" Donovan, but he ran spy rings directly from the Oval Office, enlisting well-placed socialite friends.FDR was also spied against . Roosevelt's Secret War presents evidence that the Soviet Union had a source inside the Roosevelt White House; that British agents fed FDR total fabrications to draw the United States into war; and that Roosevelt, by yielding to Churchill's demand that British scientists be allowed to work on the Manhattan Project, enabled the secrets of the bomb to be stolen. And these are only a few of the scores of revelations in this constantly surprising story of Roosevelt's hidden role in World War II.",
  "genres": [
    "History",
    "World War II",
    "Nonfiction",
    "Espionage",
    "Military Fiction",
    "American History",
    "Military History"
  ],
  "author": "Joseph E. Persico",
  "average_rating": "3.90",
  "url": "https://www.goodreads.com/book/show/332981.Roosevelt_s_Secret_War"
}