{
  "title": "The Defining Moment: FDR's Hundred Days and the Triumph of Hope",
  "description": "This is the story of a political miracle--the perfect match of man and moment.Franklin Delano Roosevelt took office in March of 1933 as America touched bottom. Banks were closing everywhere. Millions of people lost everything. The Great Depression had caused a national breakdown. With the craft of a master storyteller, Jonathan Alter brings us closer than ever before to the Roosevelt magic. Facing the gravest crisis since the Civil War, FDR used his cagey political instincts and ebullient temperament in the storied first Hundred Days of his presidency to pull off an astonishing conjuring act that lifted the country and saved both democracy and capitalism.Who was this man? To revive the nation when it felt so hopeless took an extraordinary display of optimism and self-confidence. Alter shows us how a snobbish and apparently lightweight young aristocrat was forged into an incandescent leader by his domineering mother; his independent wife; his eccentric top adviser, Louis Howe; and his ally-turned-bitter-rival, Al Smith, the Tammany Hall street fighter FDR had to vanquish to complete his preparation for the presidency.\"Old Doc Roosevelt\" had learned at Warm Springs, Georgia, how to lift others who suffered from polio, even if he could not cure their paralysis, or his own. He brought the same talents to a larger stage. Derided as weak and unprincipled by pundits, Governor Roosevelt was barely nominated for president in 1932. As president-elect, he escaped assassination in Miami by inches, then stiffed President Herbert Hoover's efforts to pull him into cooperating with him to deal with a terrifying crisis. In the most tumultuous and dramatic presidential transition in history, the entire banking structure came tumbling down just hours before FDR's legendary \"only thing we have to fear is fear itself\" Inaugural Address.In a major historical find, Alter unearths the draft of a radio speech in which Roosevelt considered enlisting a private army of American Legion veterans on his first day in office. He did not. Instead of circumventing Congress and becoming the dictator so many thought they needed, FDR used his stunning debut to experiment. He rescued banks, put men to work immediately, and revolutionized mass communications with pioneering press conferences and the first Fireside Chat. As he moved both right and left, Roosevelt's insistence on \"action now\" did little to cure the Depression, but he began to rewrite the nation's social contract and lay the groundwork for his most ambitious achievements, including Social Security.From one of America's most respected journalists, rich in insights and with fresh documentation and colorful detail, this thrilling story of presidential leadership--of what government is for--resonates through the events of today. It deepens our understanding of how Franklin Delano Roosevelt restored hope and transformed America.The Defining Moment will take its place among our most compelling works of political history.",
  "genres": [
    "History",
    "Biography",
    "Nonfiction",
    "Politics",
    "American History",
    "Presidents",
    "Biography Memoir"
  ],
  "author": "Jonathan Alter",
  "average_rating": "3.93",
  "url": "https://www.goodreads.com/book/show/332978.The_Defining_Moment"
}