{
  "title": "A Charm of Finches",
  "description": "“I swear. Give me one more chance and I will make the most of it.”Ex-hustler Javier Landes is asking for his third chance at love. The third time proves to be the charm when he meets a Manhattan art therapist named Steffen Finch. What starts as casual and curious deepens into a passionate, soulful relationship—everything Jav has ever wanted, and everything he fears losing. Stef’s business card reads Curator & Sailor. His creativity and insightful nature have made him into a talented therapist, the one to call for tough cases. His professional success can’t conceal a deep need to connect with someone, but Javier Landes is the last person Stef expected.Geronimo \"Geno\" Caan is Stef's most challenging case. After a brutal ordeal of sexual assault, Geno's allowing an alter-ego called Mos to make all the decisions, and now lives a double life within a web of lies. Under Stef’s navigation, Geno uses art to express what Mos forbids to be spoken aloud. But as Geno’s attachment to Stef gradually extends to Jav, the boundaries between professional and personal begin to blur.Over the course of a year, Jav, Stef and Geno form an unexpected and unconventional triangle, revealing how men make love in times of war and how love is a great wisdom made up of small understandings. The long-awaited second book of the Venery series, A Charm of Finches is an epic tale of survival and secrets guaranteed to make you think and feel and remember.From the author: \"This book contains adult subject matter including adult themes of sex and sexual violence, written in adult language. An Exaltation of Larks spoke of The Disappeared Ones of Chile. A Charm of Finches speaks to a different group of disappeared. An invisible demographic who often suffer in misunderstood silence. Geno Caan speaks as one who knows, but he also speaks for men who will never tell their stories. Or for men who told their stories and weren’t believed. These extraordinarily brave and resilient males possess strong hearts and I stood in awe of them during the writing of this book, knowing there was a lot more I could get wrong than right.It’s my sincere hope I got it right.\"",
  "genres": [
    "M M Romance",
    "Romance",
    "Contemporary",
    "Dark",
    "Fiction",
    "Abuse",
    "LGBT"
  ],
  "author": "Suanne Laqueur",
  "average_rating": "4.74",
  "url": "https://www.goodreads.com/book/show/33299920-a-charm-of-finches"
}