{
  "title": "Right of Passage",
  "description": "This is an alternate cover edition for B00R9YXX40 Drones on the White House lawn. Government agents with an ear to your telephone. People not vaccinating their children because it isn't natural. Where will it end?Maybe in a Police State of Anarchy.2065, two hundred years after the end of the civil war. Is it happening all over again? Don't ask Adams. He doesn't know. Doesn't care. He's marking time leading milk runs upstate for food. And forgetting. So he picked up that girl at Liberty Casino. He was just being a nice guy. Wasn't looking to get involved with the police. And sure wasn't looking to become the rope in a tug of war between the police and Homeland Security.So who are these people and what do they want from Adams? Lead a cross-country caravan? The insurance companies killed those years ago. These days the only way across country is to fly, if you're willing to risk the electric planes and being caught in a gun fight when some drunk isn't satisfied with the service. So where did that Right of Passage on his screen come from? And why're that cop Grillo and his trained monster of a sidekick stepping on Adams's heels everywhere he goes? And if Grillo wants Adams to lead that caravan, who is it that wants to stop him? Whoever it is, he can change screen records and make people disappear from surveillance cameras. Not much doubt who that is, but in this game no one wears uniforms and the sidelines may be more dangerous than the field. The only thing scarier than facing a lunatic is seeing him in the mirror. The only thing worse than a dystopian future is one that springs from the seeds of lunacy we're planting today. The more things change the more they stay the same. And you call this progress?Police State of Anarchy is a sketch of the kind of future we may be asking for. Are we ready for it?",
  "genres": [
    "Dystopia",
    "Science Fiction"
  ],
  "author": "Charles   Vella",
  "average_rating": "3.69",
  "url": "https://www.goodreads.com/book/show/33298168-right-of-passage"
}