{
  "title": "King of the Sea",
  "description": "Plunge into the icy dark waters of the San Francisco bay with this gay erotic tale of murder, mutiny, and mermen.Carlos Santiago is a man on the edge of sanity. After battling cancer, he's developed an obsession with death, fearful that it's lurking behind every shadow, waiting to steal his last breath. Then a heart-pounding encounter with a mysterious merman turns his world upside down and gives him new hope for the future.But escaping his vindictive former boyfriend, Dr. Tyson Thorne, won't be so easy. When Carlos discovers shocking medical experiments are taking place behind his back, he embarks on a race against time to unlock the mystery of the doctor's secrets before he gets caught. With danger threatening him at every turn, can Carlos escape the hands of death a second time? And can he trust his new merman love interest when everyone around him seems to be hiding a dark secret? Find out in King of the Sea, the tantalizing erotic gay mystery by Nathan Bay.Winner of the Goodreads G/G GAY FICTION FOR GAY MEN - Group Read of the Month, February 2017This is the book that started it all! The debut novella from #1 Amazon Bestselling Author Nathan Bay, King of the Sea set a precedent for gay fantasy fiction that delved into new, uncharted territories.Get swept away to a strange and unusual world!Combining elements of gay erotica, medical science fiction & fantasy, mystery, and thriller, King of the Sea is a wildly exciting book unlike anything you've ever read before. It features gay mermen, mpreg (male pregnancy) science experiments, and a unique spin on global warming's effects on the California coastline. If you're looking for something fast-paced and undeniably different from the norm, you'll find it here.What's hiding in the water?Click the \"Preview\" button under the cover for a sneak preview into the mysterious world of Carlos Santiago. Read the first chapter and get a taste of what's to come!",
  "genres": [
    "M M Romance",
    "Fantasy",
    "Paranormal",
    "Short Stories",
    "LGBT",
    "Erotica",
    "Mermaids"
  ],
  "author": "Nathan Bay",
  "average_rating": "3.17",
  "url": "https://www.goodreads.com/book/show/33300264-king-of-the-sea"
}