{
  "title": "FDR",
  "description": "One of today’s premier biographers has written a modern, comprehensive, indeed ultimate book on the epic life of Franklin Delano Roosevelt. In this superlative volume, Jean Edward Smith combines contemporary scholarship and a broad range of primary source material to provide an engrossing narrative of one of America’s greatest presidents.This is a portrait painted in broad strokes and fine details. We see how Roosevelt’s restless energy, fierce intellect, personal magnetism, and ability to project effortless grace permitted him to master countless challenges throughout his life. Smith recounts FDR’s battles with polio and physical disability, and how these experiences helped forge the resolve that FDR used to surmount the economic turmoil of the Great Depression and the wartime threat of totalitarianism. Here also is FDR’s private life depicted with unprecedented candor and nuance, with close attention paid to the four women who molded his personality and helped to inform his worldview: His mother, Sara Delano Roosevelt, formidable yet ever supportive and tender; his wife, Eleanor, whose counsel and affection were instrumental to FDR’s public and individual achievements; Lucy Mercer, the great romantic love of FDR’s life; and Missy LeHand, FDR’s longtime secretary, companion, and confidante, whose adoration of her boss was practically limitless. Smith also tackles head-on and in-depth the numerous failures and miscues of Roosevelt’s public career, including his disastrous attempt to reconstruct the Judiciary; the shameful internment of Japanese-Americans; and Roosevelt’s occasionally self-defeating Executive overreach. Additionally, Smith offers a sensitive and balanced assessment of Roosevelt’s response to the Holocaust, noting its breakthroughs and shortcomings.Summing up Roosevelt’s legacy, Jean Smith declares that FDR, more than any other individual, changed the relationship between the American people and their government. It was Roosevelt who revolutionized the art of campaigning and used the burgeoning mass media to garner public support and allay fears. But more important, Smith gives us the clearest picture yet of how this quintessential Knickerbocker aristocrat, a man who never had to depend on a paycheck, became the common man’s president. The result is a powerful account that adds fresh perspectives and draws profound conclusions about a man whose story is widely known but far less well understood. Written for the general reader and scholars alike, FDR is a stunning biography in every way worthy of its subject.From the Hardcover edition.",
  "genres": [
    "Biography",
    "History",
    "Presidents",
    "Nonfiction",
    "Politics",
    "American History",
    "Us Presidents"
  ],
  "author": "Jean Edward Smith",
  "average_rating": "4.08",
  "url": "https://www.goodreads.com/book/show/332980.FDR"
}