{
  "title": "With Grit and By Grace: Breaking Trails in Politics and Law, A Memoir",
  "description": "In the 1950s, Betty Roberts did what most of her contemporaries considered audacious and inappropriate when she returned to college as a 32-year-old wife and mother. This was only the start of Roberts lifetime commitment to overcoming obstacles to womens equality. With Grit and By Grace follows Betty Roberts rise from a Depressionera childhood on the Texas plains to become a teacher, lawyer, state legislator, candidate for governor, and eventually Oregons first woman Supreme Court Justice. In this memoir, Justice Roberts reflects on her role as a mother, wife, and political trailblazer. Her story is important to the history of womens struggles to challenge prevailing stereotypes, but it is also a deeply personal story of a life sometimes stark, sometimes humorous, often exhausting, and always brightened with friendships and family. Her story is a vivid reminder of times too quickly forgotten, when a woman could not keep her own name or stay at a motel alone. Justice Roberts began her career during a politically complex time the Civil Rights Movement was in full swing, sentiment against the Vietnam War was growing, and the nascent womens movement would soon burst on the scene. During her 13 years as a legislator, she was instrumental in the passage of Oregons first legalized right to abortion and the states ratification of the Equal Rights Amendment, as well as pathbreaking environmental and land-use legislation. Roberts tells her engrossing story with honesty and warmth. With Grit and By Grace is about lifes disappointments and promises, its rejections and rewards, and its demand for the determination and commitment that bring success. Politicians, civic leaders, feminists, and anyoneinterested in Oregons twentieth-century political history will be fascinated by this recounting of events that influenced the political and social landscape of Oregon and beyond.",
  "genres": [
    "Politics",
    "Nonfiction",
    "Biography",
    "Memoir"
  ],
  "author": "Betty Roberts",
  "average_rating": "3.88",
  "url": "https://www.goodreads.com/book/show/3333737-with-grit-and-by-grace"
}