{
  "title": "The Star Mill",
  "description": "THE SPACEMAN HAD TO USE SCIENCE AGAINST STAR MAGIC! From the pen of Nebula nominee writer Emil Petaja comes The Star Mill, the second volume in his stunning series of science fantasies based on the Finnish national epic, Kalevala. In each volume, one of the great heroes of the Kalevala is reborn in one of his genetic descendents in the far future to prevent the return of evil alien forces, the Pahaliset, who once tried to conquer Earth in the dim ages of Finland's past. But, now they are returning, stronger and more dangerous than ever. Author-editor-publisher Donald A. Wollheim wrote that \"from the Kalevala's mind-stunning material, Petaja has created a cycle of novels-- science fiction fantasy adventure of the highest order-- retelling in the eyes of modern scientific conjecture the great worlds-shaking events that may be concealed by the folklore of an ancient and mysterious people.\" In ages past, the wondersmith Ilmarinen had used his awesome psychic powers to fashion a Sampo, a device powered by the energy of stars and capable of creating anything asked of it. But, the Star-Witch, Louhi, one of the Pahaliset, had gained the Star Mill and turned its atom-transforming power from creation to a terrible destruction that would not end until all matter, animate and inanimate, has been shattered. Then a castaway is found on an interstellar asteroid not far from a dangerous storm of cosmic disintegration that has been growing in the region of Ursa Major for millinea. His survival is impossible, and he can not explain it, for he has no memory of who he is or how he reached the asteroid. But as he attempts to solve the riddle, he comes to realize that he may be the living embodiment of an ancient legend. A man who has a date with destiny that will pit him against an ancient evil force in a battle beyond the frontiers of known science. The Star Mill is truly an unusual novel of science, adventure, and fantasy, brimming with heroes, heroines, witches, beings from beyond the stars, of strange powers that once shaped humanity and return to do it again in humankind's distant future.",
  "genres": [
    "Science Fiction",
    "Fantasy",
    "Fiction"
  ],
  "author": "Emil Petaja",
  "average_rating": "3.30",
  "url": "https://www.goodreads.com/book/show/3332038-the-star-mill"
}