{
  "title": "The Necklace: Thirteen Women and the Experiment That Transformed Their Lives",
  "description": "The true story of thirteen women who took a risk on an expensive diamond necklace and, in the process, changed not only themselves but a community.Four years ago, in Ventura, California, Jonell McLain saw a diamond necklace in a local jewelry store display window. The necklace aroused desire first, then a provocative question: Why are personal luxuries so plentiful yet accessible to so few? What if we shared what we desired? Several weeks, dozens of phone calls, and a leap of faith later, Jonell bought the necklace with twelve other women, with the goal of sharing it.Part charm, part metaphor, part mirror, the necklace weaves in and out of each woman’s life, reflecting her past, defining her present, making promises for her future. Lending sparkle in surprising and unexpected ways, the necklace comes to mean something dramatically different to each of the thirteen women.With vastly dissimilar histories and lives, the women show us how they transcended their individual personalities and politics to join together in an uncommon journey. What started as a quirky social experiment became something far richer and deeper, as the women transformed a symbol of exclusivity into a symbol of inclusiveness. They discovered that sharing the necklace among themselves was only the beginning; The more they shared with others, the more profound this experience–and experiment–became.Original, resonant, and beautifully told, this book is an inspiring story about a necklace that became greater than the sum of its links, and about thirteen ordinary women who understood the power of possibility, who touched the lives of a community, and who together created one extraordinary experience.",
  "genres": [
    "Nonfiction",
    "Book Club",
    "Memoir",
    "Friendship",
    "Adult",
    "Biography",
    "Womens"
  ],
  "author": "Cheryl Jarvis",
  "average_rating": "3.17",
  "url": "https://www.goodreads.com/book/show/3334093-the-necklace"
}