{
  "title": "Daily Life in Anglo-Saxon England",
  "description": "In addition to its unshakeable position on academic History curricula, Anglo-Saxon England remains popular with the general public. However, despite numerous specialist volumes on the political and economic history of the period, there are no books currently on the market which offer an overview of Anglo-Saxon daily life. This book fills that gap, covering a great range of common life experiences of individuals in England, AD c. 450-c.1066, including domestic and family life, work and leisure, education, clothing and housing, food, religion, magic and superstition, health and sickness, warfare, crime and punishment, ethnic and national identity, the creation of kingship, slavery, urban life, and political life for men, women and children.Archaeological evidence gives a dramatic picture of social organization in Anglo-Saxon towns, and sources such as wills provide insight into the way families were structured and organized. Evidence in the law codes and literature shows how Anglo-Saxons experienced childhood, youth, marriage, adulthood, parenthood and old age; how they were educated and engaged in trades, and what they did in their leisure time. Archaeological and documentary evidence, including pictorial representations in sculpture and manuscripts, give a vivid picture of Anglo-Saxon food and dress, and also of the military and governmental forces of Anglo-Saxon England. Religion was an important part of daily life, and so was crime, justice, punishment and slavery. Indeed, the struggle to survive meant that health and sickness were crucial everyday concerns. All these aspects of daily life are examined in Sally Crawford's book, creating a rich picture of ordinary, but complex, life in Anglo-Saxon England.",
  "genres": [
    "History",
    "Nonfiction",
    "British Literature",
    "Anglo Saxon",
    "Medieval"
  ],
  "author": "Sally Crawford",
  "average_rating": "3.81",
  "url": "https://www.goodreads.com/book/show/3332765-daily-life-in-anglo-saxon-england"
}