{
  "title": "Twist of Fate",
  "description": "What happens when a hero, a victim & a psychopath's lives collide? Grab your copy of Rescuing Melissa to find out.\"From the opening pages this story had me on the edge of my seat! The premise of this story could have been torn from a dozen different headlines yet the author found new spins at every corner.\" ~ Nerdy Dirty and Flirty\"An intriguing mix of love story, action heroes, and whacked out freaks high on Girl Scout cookies - exactly my kind of book and highly recommended!\" ~ Author Elise NobleDescription:As the wife of the Fairytale Killer, Melissa is closing out a chapter of her life, one cloaked in horror and guilt. All she wants is to move on and put the past behind her.On leave from his role as a Guardian, an elite group of para-military hostage rescuse specialists, CJ will finally witness the execution of the man who butchered his baby sister.As Melissa and CJ rebuild the pieces of their lives, a man with the blackest of hearts and an endless capacity to inflict pain changes everything. Prince Charming seeks to honor his mentor's legacy and expand his collection of princesses by adding his most treasured Queen. As tornados tear through town, three lives will be uprooted, twisted, and tangled beyond what any of them can foresee. Melissa and CJ will struggle to come together as horrific events rip them apart, while Prince Charming seeks his Queen.Will Prince Charming destroy CJ and Melissa's chance for a happily ever after? Or will True Love win in the end? Grab your copy of Rescuing Melissa today and find out!What reviewers are saying:\"Embodying the worst, and the best, of the human spirit, this author used a steady hand to produce a story that was, in the end, a testament to love and enduring strength. This was a 'stay up until 4 in the morning read' that was worth every minute of lost sleep...\" ~ Nerdy Dirty and Flirty reviews.\"From the first page to the last I was totally captivated. This fast-paced romantic suspense would not let me put it down. I had to know what would happen next.\" ~ Tamye from Books, Coffee and Crafts News\"Who doesn't love a good fairy tale? Especially when it involves a serial killer whose victims are named after fairy tale princesses?? This book is an awesome romantic psychological thriller... There is action, lots of suspense, romance, and of course, not one but TWO psychopathic obsessive villains. If you are in the mood for a Cinderella meets Silence of the Lambs tale, this is your book!!!\"This book was previously released as \"Twist of Fate.\" New updated scenes have been added to this edition.",
  "genres": [
    "Romance",
    "Suspense",
    "Romantic Suspense",
    "Contemporary",
    "Military Fiction",
    "Thriller",
    "Dark"
  ],
  "author": "Ellie Masters",
  "average_rating": "4.23",
  "url": "https://www.goodreads.com/book/show/33310128-twist-of-fate"
}