{
  "title": "First Kill Your Family: Child Soldiers of Uganda and the Lord's Resistance Army",
  "description": "“Richard Opio has neither the look of a cold-blooded killer nor the heart of one. Yet as his mother and father lay on the ground with their hands tied, Richard used the blunt end of an ax to crush their skulls.  He was ordered to do this by a unit commander of the Lord’s Resistance Army, a rebel group that has terrorized northern Uganda for twenty years. The memory racks Richard’s slender body as he wipes away tears.” For more than twenty years, beginning in the mid-1980s, the Lord’s Resistance Army has ravaged northern Uganda. Tens of thousands have been slaughtered, and thousands more mutilated and traumatized. At least 1.5 million people have been driven from a pastoral existence into the squalor of refugee camps.             The leader of the rebel army is the rarely seen Joseph Kony, a former witchdoctor and self-professed spirit medium who continues to evade justice and wield power from somewhere near the Congo~Sudan border. Kony claims he not only can predict the future but also can control the minds of his fighters. And control them he does: the Lord’s Resistance Army consists of children who are abducted from their homes under cover of night. As initiation, the boys are forced to commit atrocities—murdering their parents, friends, and relatives—and the kidnapped girls are forced into lives of sexual slavery and labor. In First Kill Your Family, veteran journalist Peter Eichstaedt goes into the war-torn villages and refugee camps, talking to former child soldiers, child “brides,” and other victims. He examines the cultlike convictions of the army; how a pervasive belief in witchcraft, the spirit world, and the supernatural gave rise to this and other deadly movements; and what the global community can do to bring peace and justice to the region. This insightful analysis delves into the war’s foundations and argues that, much like Rwanda’s genocide, international intervention is needed to stop Africa’s virulent cycle of violence.",
  "genres": [
    "Africa",
    "Nonfiction",
    "Uganda",
    "History",
    "War",
    "Childrens",
    "Memoir"
  ],
  "author": "Peter Eichstaedt",
  "average_rating": "3.93",
  "url": "https://www.goodreads.com/book/show/3336350-first-kill-your-family"
}