{
  "title": "Dalit Women: Vanguard of an Alternative Politics in India",
  "description": "Through its investigation of the underlying political economy of gender, caste and class in India, this book shows how changing historical geographies are shaping the subjectivities of Dalits across India in ways that are neither fixed nor predictable. It brings together ethnographies from across India to explore caste politics, Dalit feminism and patriarchy, religion, economics and the continued socio-economic and political marginalisation of Dalits.With contributions from major academics this is an indispensable book for researchers, teachers and students working on new political expressions, gender identities, social inequalities and the continuing use of the notion of 'caste' identity in the oppression of subalterns in contemporary India. It will be essential reading in the disciplines of politics, gender, social exclusion studies, sociology and social anthropology.INTRODUCTION: We Ask You to Rethink: Different Dalit Women and their Subaltern Politics—Karin Kapadia Part I: IMAGINING A NEW DALIT WOMEN’S POLITICS 1. FOREWORD: Dalits, Dalit Women and the Indian State—Anand Teltumbde 2. For Another Difference: Agency, Representation and Dalit Women in Contemporary India—Manuela Ciotti Part II: DALIT WOMEN’S CONCEPTUALIZATIONS OF CASTE DIFFERENCE AND THEIR MEANS OF COLLECTIVIZATION 3. Gendered Negotiations of Caste Identity: Dalit Women’s Activism in Rural Tamil Nadu—S. Anandhi 4. Liberation Panthers and Pantheresses? Gender and Dalit Party Politics in South India —Hugo Gorringe 5. Microcredit Self-Help Groups and Dalit Women: Overcoming or Essentializing Caste Difference?—Isabelle Guerin and Santosh Kumar Part III: A BROKEN EMPOWERMENT? ARE WOMEN STILL TRAPPED BY CASTE AND PATRIARCHY?6. Dalit Women, Rape and the Revitalisation of Patriarchy?—Clarinda Still 7. Different Dalit Women Speak Differently: Unravelling, through an Intersectional Lens, Narratives of Agency and Activism from Everyday Life in Rural Uttar Pradesh—Radhika Govinda 8. Subsidising Capitalism and Male Labour: The Scandal of Unfree Dalit Female Labour Relations—Ishita Mehrotra Part IV: RELIGION AS DALIT POLITICAL PRACTICE9. Transformation and the Suffering Subject: Caste/Class and Gender in Slum Pentecostal Discourse—Nathaniel Roberts 10. Improper Politics: The Praxis of Subalterns in Chennai—Karin Kapadia AFTERWORD: The Burden of Caste: Scholarship, Democratic Movements and Activism—Uma Chakravarti",
  "genres": [
    "Politics",
    "Nonfiction"
  ],
  "author": "S. Anandhi",
  "average_rating": "4.73",
  "url": "https://www.goodreads.com/book/show/33359545-dalit-women"
}