{
  "title": "The Extinction Cycle Boxed Set, Books 4-6",
  "description": "Extinction EvolutionCentral Command is gone, the military is fractured, and the surviving members of Team Ghost, led by Master Sergeant Reed Beckham, have been pushed to the breaking point. While the strong return to the battlefield, the wounded are forced to stay behind on Plum Island and fight their inner demons.Betrayed by the country they swore to defend and surrounded by enemies on all sides, Team Ghost has one mission left: protect Dr. Kate Lovato and Dr. Pat Ellis while they develop a weapon to defeat the Variants once and for all. But after a grisly discovery in Atlanta, Kate and Ellis realize their weapon might not be able to stop the evolution of the monsters.Joined by unexpected allies and facing a new threat none of them saw coming, the survivors are running out of time to save the human race from extinction.Extinction EndAlmost seven weeks have passed since the Hemorrhage Virus ravaged the world. The remnants of the United States military have regrouped and relocated Central Command to the George Washington Carrier Strike Group. It's here, in the North Atlantic, that President Jan Ringgold and Vice President George Johnson prepare to deploy a new bioweapon and embark on the final mission to take back the country from the Variants.With his home gone and his friends kidnapped, Master Sergeant Reed Beckham and his remaining men must take drastic measures to save what's left of the human race. But not everyone at Central Command has the same plan for victory. As the Variants continue to evolve, only a handful of heroes stand between the creatures and mankind's total extinction.One way or another, the battle for the United States of America ends here.Extinction AftermathNewly christened as the leader of Delta Force Team Ghost, Master Sergeant Joe Fitzpatrick arrives in Normandy over seventy years after Allied Forces joined the fight against the Nazis. The war to free survivors and eradicate pockets of adult Variants and their offspring is underway by the European Unified Forces. But as the troops push east, rumors of a new type of monster spread through the ranks. Fitz and his new team quickly realize that the fight for Europe might be harder than anyone ever imagined.Back in the States, Captain Reed Beckham and Dr. Kate Lovato are settling into a new life on Plum Island. Across the United States, the adult Variants have all been wiped out, and the juveniles are on the run. But survivors soon realize there are other monsters at home, and they may be human.As the doomsday clock ticks down and military bases fall across the country, the human race enters the age of extinction. Will science prevail--or will mankind vanish off the face of the planet?",
  "genres": [
    "Horror",
    "Fiction",
    "Post Apocalyptic",
    "Science Fiction",
    "Audiobook",
    "Apocalyptic"
  ],
  "author": "Nicholas Sansbury Smith",
  "average_rating": "4.40",
  "url": "https://www.goodreads.com/book/show/33369459-the-extinction-cycle-boxed-set-books-4-6"
}