{
  "title": "Crazy People in Court",
  "description": "Judge Robert C. Coates served for 28 years as a Superior Court Trial Judge in San Diego. Before that, in Law School, Judge Coates suffered a serious mental breakdown. He graduated, however, with his class and passed the California Bar Exam the first try. He went on to a high-profile career as a Trial Lawyer before his appointment to the Bench. As an attorney, Coates found himself representing hundreds of mentally ill persons; and later, it became natural for Presiding Judges to send Judge Coates cases involving some mental disorder or another. Asked to speak at a MENSA convention about his \"Most Interesting Cases,\" Judge Coates found an audience that was enthralled....and he thereupon started collecting the stories you find here. Coates says that he boiled his Judging job down into two components: \"Love everybody who shows up; and ... call balls and strikes ruthlessly.\" This book is unique in its voice -- the voice of a Trial Judge...who was often caught unawares by the unusual people he found in his courtroom!Judge Robert C. Coates' 1990 book on solutions to American homelessness, \"A Street is Not a Home -- Solving America's Homeless Dilemma\" is in its third printing, having won the 1991 American Psychiatric Society's Advocacy Award. His 1984 poetry book sold over 2,000 copies. Judge Coates was recently named a \"Distinguished Eagle Scout.\" He was Most Valuable Player of his 1954 high school baseball team and, in an Alumni vs. Varsity game at his age 70, Coates smacked a line-drive single his last at-bat!CRAZY PEOPLE IN COURT presents a Judge's look at the variety of interesting mental disorders and persons one finds in those \"magnets of humanity,\" America's courtrooms. Shakespeare's Hamlet told his friend, \"There are more things in heaven and earth l than are dreamt of in your philosophy, Horatio.\" Similarly, there are stranger persona in Judge Coates' world than a reader may have experienced. This book is therefore an exploration, an adventure. And Judge Coates makes it fun - because, for Judge Coates, the serious business of justice is also great fun. Delightful! He has said: \"My IQ is not high enough for me to get bored.\" Try out Sergeant Major Ninja. Or, Reefer Bob. Or Randorino who buried his dead mother in the back yard and collected her Social Security. Or the veteran who lost a ﬁ ght with a police horse. Or, the genius attorney in \"I Believe I'll Have a Drink.\" And kicking the book off, we find Judge Coates' own Story. Check it out.",
  "genres": [],
  "author": "Robert C. Coates",
  "average_rating": "3.50",
  "url": "https://www.goodreads.com/book/show/33368718-crazy-people-in-court"
}