{
  "title": "The Unlikeable Demon Hunter",
  "description": "The mission: kill demons. The catch: infuriatingly sexy minder. The challenge: don't get the two confused.Nava Katz traded a lost dream for an impressively cynical attitude. The one thing she does care about? Her hard-working twin brother. Then she interrupts his induction ceremony into a secret supernatural society, accidentally torches his life-long ambition, and steals his destiny. Wait—whaaaat?She expects to be chastised, not thrown into a trial by fire, battling demons to keep humanity safe while she’s learning to master her powers, and facing her worst nightmare: a purpose.To add insult to literal injury, it turns out that evil fiends are a delight compared to the all-male hunters, who shockingly, are not cool with a woman in their ranks. They assign her to their most ruthless slayer: Rohan, a man whose inner demons earn nods of respect from actual ones. He’s pursuing his own high-stakes mission, with no interest in babysitting some chick that everyone expects to die soon.But Nava excels in defying people’s expectations, and besides, spite is a powerful motivator. So, she hatches a plan to bring her brother into the fold alongside her. Sure, it involves defeating a vengeful demon out for blood, but you can’t make an omelet without breaking a few bones.The Brotherhood wants her gone. The demons want her dead. First gig as a Chosen One and she's already nailing it.Featuring a snarky heroine, kickass action, and spicy romance, this laugh-out-loud, deliciously addictive series sucker-punches you in the heart when you're not looking.Fall into bed with a demon hunter and read all night!“Don’t buy it if your offended by bad language, immoral behavior, lose ethics, sassy attitude, hot guys ... cuz it does it all - and its GREAT!!!” – Amazon Reviewer",
  "genres": [
    "Urban Fantasy",
    "Fantasy",
    "Paranormal",
    "Demons",
    "Romance",
    "Magic",
    "Paranormal Romance"
  ],
  "author": "Deborah Wilde",
  "average_rating": "3.81",
  "url": "https://www.goodreads.com/book/show/33379515-the-unlikeable-demon-hunter"
}