{
  "title": "Counterbalance",
  "description": "A beauty & the geek story, billionaire style.The world might think billionaire Xavier Gaines has it all, but he’s got a big problem. His successful software company is about to sign a government contract that’ll land him smack in the glare of the public limelight, and his lifelong battle with social anxiety has marked him as a cold, uncaring bastard in the eyes of the press. To dispel the unflattering image, he needs help, and there’s only one person he trusts with the job—Peyton Smoke. Gorgeous, kind, and funny, she agrees to be his media relations director and soon imbeds herself so deeply in his life, his world will crumble if anything upsets the balance. He cannot screw up their solid unit. No matter how achingly he desires her. Yet, how is he supposed to resist when she tugs emotions from him he didn’t think he was capable of experiencing? Especially since it appears he’s not the only one fighting their undeniable attraction.Ever-after just might be possible...if he can convince her to believe in love again.Peyton Smoke is looking for a change, and working at Gaines Industries has given her the boost she needs to fill the empty void in her life. Xavier is the perfect boss. Under his seemingly callous, frigid demeanor lies a compassionate man who cares about causes and those precious few he lets into his inner circle. What she wasn’t prepared for is the smoldering passion suddenly flaring between them, nor the hot-as-sin alpha side beneath the layer of sexy nerd. Getting involved with him puts more than her job at risk. She’s been trampled one too many times, and she vowed never to leave herself vulnerable again. But the heart wants what the heart wants. If only she can figure out whether his feelings are genuine or if this is a mistaken case of gratitude wrapped in lust, then their shot at forever may not seem like such a fruitless hope.\"Moran pulls you in and does...Not. Let. Go. Hot, heartfelt, and hard to put down.\"~Molly McLain, USA Today Bestselling AuthorTropes:billionaireoffice romancebeauty & the geeksocial anxietyfriends-to-loversbeta herostrong womansecond chanceboss",
  "genres": [
    "Romance",
    "Contemporary Romance",
    "Friends To Lovers",
    "New Adult",
    "Slow Burn",
    "Fiction",
    "Contemporary"
  ],
  "author": "Kelly Moran",
  "average_rating": "3.84",
  "url": "https://www.goodreads.com/book/show/33375908-counterbalance"
}