{
  "title": "Talking Back, Talking Black: Truths About America's Lingua Franca",
  "description": "One of our sharpest explainers of linguistics. Steven Pinker  In Talking Back, Talking Black, John McWhorter, the maestro at communicating linguistics to the public, succeeds in helping the reader to actually hear Black English in a new way, while hipping linguists to some features of this vibrant variety they might not have considered before. John R. Rickford, former president of the Linguistic Society of America and coauthor of Spoken The Story of Black English  McWhorter debunks some of our most persistent myths about language. NPR  McWhorter makes all the right arguments, and he makes them clearly. \nNew Yorker\n  Do you think Black English is a dialect full of mistakes ? You re likely to change your mind about its languageness after reading Mr. McWhorter. \nWall Street Journal\n It has now been almost fifty years since linguistic experts began studying Black English as a legitimate speech variety, arguing to the public that it is different from Standard English, not a degradation of it. Yet false assumptions and controversies still swirl around what it means to speak and sound black. In his first book devoted solely to the form, structure, and development of Black English, John McWhorter clearly explains its fundamentals and rich history, while carefully examining the cultural, educational, and political issues that have undermined recognition of this transformative, empowering dialect. Talking Back, Talking Black takes us on a fascinating tour of a nuanced and complex language that has moved beyond America s borders to become a dynamic force for today s youth culture around the world. John McWhorter teaches linguistics, Western civilization, music history, and American studies at Columbia University. A New York Times best-selling author and TED speaker, he is a columnist for Time and regular contributor to the Atlantic, Wall Street Journal, and Washington Post. His books on language include The Power of Babel, Our Magnificent Bastard Tongue, What Language Is, The Language Hoax, and Words on the Move.\"",
  "genres": [
    "Nonfiction",
    "Linguistics",
    "Language",
    "Race",
    "History",
    "Audiobook",
    "African American"
  ],
  "author": "John McWhorter",
  "average_rating": "4.16",
  "url": "https://www.goodreads.com/book/show/33376054-talking-back-talking-black"
}