{
  "title": "Neuroscience and Philosophy: Brain, Mind, and Language",
  "description": "In Neuroscience and Philosophy three prominent philosophers and a leading neuroscientist clash over the conceptual presuppositions of cognitive neuroscience. The book begins with an excerpt from Maxwell Bennett and Peter Hacker's Philosophical Foundations of Neuroscience (Blackwell, 2003), which questions the conceptual commitments of cognitive neuroscientists. Their position is then criticized by Daniel Dennett and John Searle, two philosophers who have written extensively on the subject, and Bennett and Hacker in turn respond.Their impassioned debate encompasses a wide range of central themes: the nature of consciousness, the bearer and location of psychological attributes, the intelligibility of so-called brain maps and representations, the notion of qualia, the coherence of the notion of an intentional stance, and the relationships between mind, brain, and body. Clearly argued and thoroughly engaging, the authors present fundamentally different conceptions of philosophical method, cognitive-neuroscientific explanation, and human nature, and their exchange will appeal to anyone interested in the relation of mind to brain, of psychology to neuroscience, of causal to rational explanation, and of consciousness to self-consciousness.In his conclusion Daniel Robinson (member of the philosophy faculty at Oxford University and Distinguished Professor Emeritus at Georgetown University) explains why this confrontation is so crucial to the understanding of neuroscientific research. The project of cognitive neuroscience, he asserts, depends on the incorporation of human nature into the framework of science itself. In Robinson's estimation, Dennett and Searle fail to support this undertaking; Bennett and Hacker suggest that the project itself might be based on a conceptual mistake. Exciting and challenging, Neuroscience and Philosophy is an exceptional introduction to the philosophical problems raised by cognitive neuroscience.",
  "genres": [
    "Philosophy",
    "Science",
    "Neuroscience",
    "Psychology",
    "Nonfiction",
    "Linguistics",
    "Language"
  ],
  "author": "Maxwell Richard Bennett",
  "average_rating": "3.73",
  "url": "https://www.goodreads.com/book/show/100280.Neuroscience_and_Philosophy"
}