{
  "title": "Awakening Macbeth: A paranormal romance novel",
  "description": "The game is love versus evil . . . Winner take all.“Page-turning paranormal romance.” – Kirkus Reviews University professor Brodie Macbeth finds herself inheriting a house, a fortune, a set of vanity license plates, and a library full of history books when her father unexpectedly kills himself.Reeling from his suicide and shocked by the strange will, Brodie is tormented by terrifying nightmares. Night after night, in scenes pulled from the pages of her father’s books, she is confronted by strangers who threaten to kill her unless she reveals her father’s secret.But there is no secret. Dreams are just dreams . . .As Brodie fights to get her life under control, she falls for Joe Birnam, an Iraq War vet with his own demons. Nothing like her stuffy ex, Joe is the best thing that ever happened to her.Or the worst.Brodie's nightmares are a deadly game of good versus evil.The prize is Joe’s immortal soul.From Virginia's most famous university to the Scottish highlands to a dusty road in Iraq, not even Shakespeare could have written the secret that will keep you up tonight. “A suspenseful, page-turning paranormal romance . . . Both Brodie and Joe are relatable characters; indeed, he’s so perfectly flawed that many readers will fall in love with him, too.” -- Kirkus Reviews“Easily one of the better romance novels . . . An excellent read.”-- Book Reviews AnonymousTime travel romance fans of thrillers like the Outlander series by Diana Gabaldón and romantic Scottish Highlander novels, as well as authors Nora Roberts, Heather Graham, Deborah Harkness, Elizabeth Kostova and Christine Feehan, will love this riveting tale of paranormal-driven suspense.You’ll be riveted by the sizzling yet sophisticated romance between a woman learning to love and a military veteran hero. BONUS! The Kindle ebook also contains the first two chapters of romantic political thriller THE HIDDEN LIGHT OF MEXICO CITY.Literary Fiction Review called it “Enthralling political drama . . . a man and a woman from opposite ends of the social spectrum who fall in love.”",
  "genres": [
    "Mystery",
    "Fantasy",
    "Romance",
    "Paranormal",
    "Supernatural",
    "Fiction"
  ],
  "author": "Carmen Amato",
  "average_rating": "4.35",
  "url": "https://www.goodreads.com/book/show/33390144-awakening-macbeth"
}