{
  "title": "Zane, The Inferno, Flames of Vampire Passion, Book Three",
  "description": "The Flames of Vampire Passion Are Blazing HotLondon:After The Decrees, I poured all my fears and anxieties about the entire ordeal into a novel. To my dismay, that book garnered more sales and accolades than any other I’d written. I decided to put my pen away, while I worked through my recovery.After my sabbatical, I think I’m ready, and I want to return to my writing.I’ll be honest. I’m nervous, but Zane’s sure I can pick it back up with no problems. I wish I had as much confidence in me as he does. He still loves me with the same fire and passion as the night we met, and I wouldn’t give him up for anything.But if someone gets their way, I may not have a choice, because I’ve been placed on list of vampires to be killed! I have no idea who they are or why they want me dead! What did I ever do but write romance and love my husband? I’ve never hurt anyone except to try to save Zane during that horrific event years ago.Zane’s determined to find whoever is behind this and eradicate them or anyone else attempting to end our love.On top of all that, Chris, my ex, has partnered with my mother in trying to get us back together, which is bringing all my emotions over the way he treated me in the past to the surface.Don’t I have enough to deal with already, without them trying to break up my marriage?Zane:London doesn’t have anything to worry about, as far as her writing. She’s talented, and she needs get back to what she loves most... other than me, of course. I’ve given her enough inspiration to fill at least a dozen books.What concerns me is blatant violence at my very doorstep. I could not believe someone dared come to my home and attack my wife!After The Decrees, there should be no question as to how I would deal with any potential or real threat. But either ignoring all that, or thinking they could best me in battle, they attempted to murder London right in front of me!Was someone trying to take vengeance on me for a sentence I’d dealt during The Decrees? If so, why wait years to attack? Could someone in my inner circle of trusted friends have been the culprit?If they thought I was going to consider the threat brought to my door as anything other than a declaration of war, they were mistaken.I was determined to return the fight… and win!Zane, Flames of Vampire Passion Series, Book Three, contains steaming, wickedly hot scenes of vivid intimacy, laugh out loud humor, and depth of heartfelt connection and real emotion between Zane and London.This is a work of fiction and is meant for an adult audience.M/F, language, violence, third in the series, HEA, paranormal, vampires",
  "genres": [],
  "author": "Elaine Barris",
  "average_rating": "4.79",
  "url": "https://www.goodreads.com/book/show/33391845-zane-the-inferno-flames-of-vampire-passion-book-three"
}