{
  "title": "No Deadline for Love",
  "description": "No Deadline For Love narrates the story of a confused young woman, who gets into a dilemma about whether she is on the right path, and whether doing what is expected of her is more important than what she fancies to do.The book takes readers through the life of Megha Pandit, an impulsive 26-year-old who works at an FMCG company. She is a perplexed botch, who never thinks before she talks. Megha realises that she fancies the creative course of action involved in making ad films, rather than her current job of creating marketing strategies for products. Her ornery boss is not electrified with the idea of brand managers turning into ad conceptualizing officers, though.Megha then meets the creative head of the company, Yudhistir Joshi. Yudi seems to bring out Megha’s atrocious side. Although he’s an exceptionally good looking man, Megha and Yudi publicly fight and argue. He hates her guts and she vice-versa. Yudi apprises her to quit from the creative team every single time, however, Megha, who’s finally in a blissful atmosphere, refuses to abandon her ecstatic ship. Little does she know that their friction will give way to sparks!Concurrently, ‘Vile’ Varun, Megha’s boss, puts her down in front of his bosses at every opportunity. He claims that she is inadequate for her profile.On the other hand, there is a crowd of eligible NRI bachelors on her list of problems, as Megha’s mother decides to put her up on the marriage market.No Deadline For Love is a first person narrative by the protagonist, Megha. The book reads almost like a journal entry, and is full of icy observations. The occasional hilarious quotes lighten up the reader’s mood, and the elementary pinch in the storyline, apart from her spontaneous description of the events, are the comical nicknames given to characters.",
  "genres": [
    "Romance"
  ],
  "author": "Manasi Vaidya",
  "average_rating": "3.53",
  "url": "https://www.goodreads.com/book/show/12030023-no-deadline-for-love"
}