{
  "title": "Naming the World: And Other Exercises for the Creative Writer",
  "description": "You already have the tools to become a gifted writer; what you need is the spark. Harvard creative writing professor and acclaimed author Bret Anthony Johnston brings you an irresistible interactive guide to the craft of narrative writing. From developing characters to building conflict, from mastering dialogue to setting the scene, Naming the World jump-starts your creativity with inspiring exercises that will have you scrambling for pen and paper. Every chapter is a master class with the country’s most eminent authors, renowned editors, and dedicated teachers.• Infuse emotion into your fiction with three key strategies from Margot Livesey.• Christopher Castellani dumps the “write what you know” maxim and challenges you to really delve into the imagination.• A point-of-view drill from Susan Straight can be just the breakthrough you need to flesh out your story.• Jewell Parker Rhodes shares how good dialogue is not just about what is being said but about what is being left unsaid.Brimming with imaginative springboards and hands-on exercises, Naming the World has everything you need to become a stronger, more inventive writer. “A delicious book. Imagine yourself at a cocktail party crammed with literary lions. You have the chance to spend a few moments with each of them. Wit and wisdom abound.”–Julia Cameron, author of The Artist’s Way“A highly useful and perceptive book. With charm and intelligence it touches on nearly every teachable aspect of the devilishly difficult art of writing.” –Ethan Canin, professor of creative writing at the Iowa Writers Workshop, and author of Carry Me Across the Water “These entertaining and useful exercises, intelligently organized, are a boon for both beginning and experienced writers.”–Andrea Barrett, National Book Award—winning author of The Air We Breathe“Forget about getting an MFA! For any writer struggling with his craft, here is the equivalent of a master class in writing by some of the best writer/teachers around.”–Betsy Lerner, author of The Forest for the Trees: An Editor’s Advice to Writers",
  "genres": [
    "Writing",
    "Nonfiction",
    "Reference",
    "Crafts",
    "Adult",
    "Teaching",
    "Textbooks"
  ],
  "author": "Bret Anthony Johnston",
  "average_rating": "4.17",
  "url": "https://www.goodreads.com/book/show/1202961.Naming_the_World"
}