{
  "title": "Under the Cowboy's Control",
  "description": "Selena Taylor is an American citizen determined to find her grandparents after she loses her family to the violence of the drug cartel in Mexico. Crossing the border into Texas turns out to be the easy part.Virtually penniless and enticingly innocent, she soon finds herself at the mercy of Travis Blake. Travis is a hard-working, self-made rancher that has never known love or softness of any kind. His only use for women is sexual, and Selena is caught on his ranch with no way out.While Selena plots her escape from his control, Travis ruthlessly and methodically tightens his possession and makes it impossible for her to leave. The struggle that follows is a clash of wills that pits purity against passion, virtue against vice and love against “I specifically told you to stay away from the men and stay at the house. In fact, I’ve told you more than once.” He ate, standing up, and scrunched up the bag when he was finished. “You got anything to say to me? Anything in your defense?”“Am I on tri—trial?” “Yeah, you’re on trial. And I’m the only judge you’re going to get. No jury of your peers. Just me. My decision. Got that?” His voice rose.Selena took a step back from him. “What’s wrong w-with you? How can you b-be so nice and then s-so mean?”He stalked toward her. “Really?” He reached down and swiped her wrist and held it tightly in his grip. “Really? You don’t get it yet? You haven’t quite figured it out? I told you what happens when a man wants something he can’t have. Have you forgotten so soon? Are you saying I can have it? Are you? I tell you what, Angel, you let me take you back to the house, strip you naked every night. You sleep in my bed, and we’ll see just how nice I can be.” He slammed his mouth down on hers. His tongue went deep, tasting her sweetness. He pulled her into his body, his erection straining against her. He lifted his mouth from hers. His hand went to the back of her head and grabbed hold of her hair and pulled until her eyes were on his.His face was menacing, his hold on her uncompromising. He fisted his hand in her hair until she was completely captive. His other hand went to her neck and felt her racing heartbeat. His hand roamed down and settled on her breast. Her flesh swelled against his palm, her nipple hardening. His thumb moved back and forth across the tight little pebble. They stood there, panting together. His touch gentled, and his words became beguiling. “Come on, Baby. You don’t want to be a virgin forever, do you?” His mouth lowered and he took a gentle kiss from her parted lips. “I can make it good for you. You don’t need to be scared. I won’t hurt you. It won’t hurt at all.”She pulled away from him, accusation in her eyes. He stood in front of her, blatant masculinity dripping from his pores. He had a dominant nature, and she felt its intensity now.His eyes were riveted on her, his nostrils flaring. Goddammit! He had sworn to himself that he wasn’t going to try to seduce her, and then he had gone and done just that. “Shit.” He turned away and dug his cell phone from his pocket, flipped it open and pressed a button. He spoke into the phone. “Yeah, get back here and take her back to the house.”He ended the call and slipped the phone back into his pocket. “I’m not going to apologize. You’re playing with fire and you know it. You better watch out, little girl, because you’re going to get burned. I want you to get back to that house and stay there. You can go to the barn and see those damn skunks, but that’s it. Nowhere else.",
  "genres": [
    "Romance",
    "Contemporary Romance",
    "Westerns",
    "Contemporary",
    "Erotica",
    "Erotic Romance",
    "Novella"
  ],
  "author": "Lynda Chance",
  "average_rating": "3.74",
  "url": "https://www.goodreads.com/book/show/12030237-under-the-cowboy-s-control"
}