{
  "title": "My Favorite Universe",
  "description": "In My Favorite Universe, the astrophysicist who directs the nation's most famous planetarium takes you on a spirited and intellectually engaging journey through the cosmos and all its history, from before the Big Bang to the most likely ways in which Earth, and perhaps the entire universe, might end. Clear Science Teaching to Set the Stage for an Awe-Inspiring Course Created for a lay audience and readily accessible, in this course science always takes precedence over drama. The lectures are certainly entertaining, often funny, even awe-inspiring at times, as befits the subject matter. Even though you will be entertained, you will be learning good science. Clear introductions to essential principles of physics support these lectures, including density, quantum theory, gravity, and the General Theory of Relativity. Professor Neil deGrasse Tyson also includes forays into disciplines such as chemistry and biology as needed to explain events in astronomy. For example, Dr. Tyson begins one lecture at a point 13 billion years ago, when all space, matter, and energy in the known universe were contained in a volume less than one-trillionth the size of a pinpoint-about the size of a single atom. By the time he finishes, the cosmos has been stretched, the planets and our Earth formed, and 70 percent of existing Earth species have been wiped out by a gigantic asteroidclearing the way for the evolution of humanity. Along the way he has touched on Einstein's famous equation, E=mc2; on the four forces that were once unified in the early cosmos in a way physicists are still trying to explain; and on the chemical enrichment of the universe by exploding supernovae, which give the universe its necessary supply of heavier elements including oxygen, nitrogen, iron and, most important, carbon. Carbon, we learn, is a \"sticky\" atom, capable of making more kinds of molecules than all other elements combined. It's the ideal element with which to experiment in the building of life forms and is, of course, the element responsible for the remarkable diversity of life, including us. As Dr. Tyson notes, we are made of stardust, just as the planets are. And he has created a course that explains exactly how that came to be, beginning with a grounding in the basic \"machinery\" of matter, forces, and energy that has been discovered on Earth and which also reveals itself throughout the universe. The Stark and Violent Beauty of the Universe With this basic foundation in place, explanations of cosmic events fall logically into place, and the realities of the universe-including its eventual demise-are revealed in stark and often violent beauty. You learn: how Saturn's rings were formed, and why they will eventually be lost why low-density conditions are necessary to produce the drama of the northern and southern auroras why even the most jagged and wild of the Earth's mountain ranges are, from a cosmic standpoint, really part of a perfectly smooth sphere how black holes are formed and the extraordinary way in which they can wreak havoc in the universe how asteroids moving through space represent threats of extraordinary consequence to Earth, no matter how long those threats may take to be realized why the seemingly infinite panorama of celestial bodies revealed by the Hubble Space Telescope's famous \"Deep Field\" so intrigued astronomers how astronomers actually look for new planets, why the odds seem overwhelmingly in favor of some kind of life out there, whether we ever make contact or not. Most important, none of these ideas are presented as isolated \"space factoids\" that serve no purpose but to entertain. They are there to illustrate and reinforce the key principles of physics and astrophysics that are continually being presented in this course. But the inclusion of real science doesn't prevent Dr. Tyson from having some fun, either. When it's time to show how a black hole might remove one from the universe, he leads you right up to the \"event horizon\" and slips you in-feet first. Since the event horizon represents the point within which nothing, not even light, can escape, you might think this is a bad idea. And you would be right. But as you plummet toward the \"singularity\" at the heart of the black hole, you will learn firsthand about the interesting effects of gravity truly unleashed, including what physicists refer to, with a straight face, as \"spaghettification.\" (Actually, Professor Tyson recommends that you be sucked in to a large black hole rather than a small one. You'll still be spaghettified, but it won't happen as quickly.) But make no mistake: Dr. Tyson does not consider the cosmos a laughing matter, this kind of whimsical touch notwithstanding. In spite of his training, he remains, admittedly, still in awe of his subject. And he has created a course that might well produce the same feeling in you.",
  "genres": [
    "Science",
    "Nonfiction",
    "Audiobook",
    "Physics",
    "Astronomy",
    "Space",
    "Education"
  ],
  "author": "Neil deGrasse Tyson",
  "average_rating": "4.13",
  "url": "https://www.goodreads.com/book/show/33410046-my-favorite-universe"
}