{
  "title": "Emotional Abuse: A manual for self-defense",
  "description": "Emotional Abuse: A manual for self-defense examines the phenomenon of emotional abuse and how we are socialized to minimize, justify, and dismiss aggressive behavior. The camouflage of emotional abuse leads us to feel we deserve the abuse or somehow are “too sensitive.” We deny our pain to protect the relationship; by denying out pain we lose our own boundaries. Acknowledging our pain allows us to begin defending ourselves.In the introduction Joel Dvoskin, Ph.D. wrote:“While Zak Mucha’s explanation of the harms of emotional abuse is useful, it pales in comparison to his wisdom in teaching us emotional self-defense. Learning to protect ourselves from emotional abuse changes everything… Thanks to this wonderful book, each of us can learn to be our own hero, by learning some simple yet powerful ways to respond to emotional abuse.You are about to go on a journey that is at once deeply personal and scientifically valid. This book has been waiting a long time to be written.” Previous reviews:“Zak Mucha's incredible essay on the core issues of bullying is a thoughtful and stark analysis of truths that must be acknowledged...”-- Bruce D. Perry, M.D., Ph.D. Senior Fellow, The ChildTrauma Academy“Mucha also writes scientifically about how victims slowly lose their self-worth, which, as displayed by Dylan Klebold and Seung Hui Cho, can lead to deadly outcomes.”--Chicago TribuneZak Mucha, LCSW is a psychotherapist in private practice in Chicago. He spent seven years working as the supervisor of an Assertive Community Treatment (ACT) program, providing 24/7 services to persons suffering from severe psychosis, substance abuse issues, and homelessness. Mucha has worked as a counselor and consultant for U.S. combat veterans training for digital forensic investigations in child pornography. He is also a clinical associate faculty member at the Chicago Center for Psychoanalysis.",
  "genres": [
    "Psychology",
    "Self Help",
    "Nonfiction"
  ],
  "author": "Zak Mucha",
  "average_rating": "4.26",
  "url": "https://www.goodreads.com/book/show/33404583-emotional-abuse"
}