{
  "title": "Dumbfounded: Big Money. Big Hair. Big Problems. Or Why Having It All Isn't for Sissies.",
  "description": "What fresh hell is this?I stopped, dumbfounded. My grandmother was at my bedroom door. “What the hell are you doing?” she asked, surprised but not angry. I looked down at my dress. “Playing school.” My grandmother began stroking her chin. Clearly, there were several ways she could take this conversation. “Matthew, what are you wearing?” I could see that she didn’t really want to ask this question but felt she had to. “A dress,” I said. . . . “And where did you get this dress?” she asked. . . . “I found it?” My grandmother sighed. “So you’ve been wandering around the women’s department at JC Penney? Do you expect me to believe you couldn’t find a better dress than that?”The only Jewish family in a luxury Fifth Avenue building of WASPs, the senior Rothschilds took over the responsibility of raising their grandson, Matt, after his mother left him for Italy and a fourth husband. But rearing Matt was no small task—even for his sharp-tongued grandmother, a cross between Lauren Bacall and Bea Arthur, and a lady who Matt grew to love deeply.Matt secretly wore his grandmother’s dresses, shoplifted Barbies from FAO Schwarz, invented an imaginary midget butler who he addressed at dinner parties, and got kicked out of nearly every elite school in Manhattan—once for his impersonation of Judy Garland at a recital. He was eventually sent to a boarding school (his grandmother had to ransom off a van Gogh to get him in). But as funny as his hijinks are now, at the time they masked a Jewfroed, chubby, lovable kid, sexually confused and abandoned by his mother, trying to fit in among the precious genteel world he was forced to live in.Matt Rothschild—the man David Sedaris could have been if he’d grown up in an esteemed family on Manhattan’s Upper East Side—tells the story of his childhood with humor, honesty, and unlikely compassion for his eccentric relatives, including his mother, in this bitingly entertaining and unexpectedly tender memoir of family dysfunction.",
  "genres": [
    "Memoir",
    "Nonfiction",
    "Humor",
    "Biography",
    "Coming Of Age",
    "New York",
    "Biography Memoir"
  ],
  "author": "Matt Rothschild",
  "average_rating": "3.82",
  "url": "https://www.goodreads.com/book/show/3340988-dumbfounded"
}