{
  "title": "An Insurgent's Wedding - Box Set",
  "description": "Book 1, Hawk’s Property, must be read in order to understand and enjoy An Insurgent’s Wedding.Since the beginning, everything about Hawk and Cara’s relationship has always been rough, hot, and passionate. When the VP of the Insurgents MC had first locked eyes with the feisty lawyer, he’d known he’d make her his forever. Cara fought the intense feelings she had for the rugged, tatted bad boy, but she finally gave him her heart and body.  And now, they are finally ready to tie the knot. To join their two worlds, Cara is having her classy society wedding and Hawk is throwing a big biker wedding for his brotherhood.  Nothing can destroy their joy.  Then someone from their past materializes, lurking in the shadows, and waiting to destroy the happiness the couple has fought so hard to have.  When danger comes to Pinewood Springs, Hawk and Cara’s love for each other will be tested in ways no newlyweds should have to endure. Hawk will have to do whatever it takes to make sure his beloved woman is safe and by his side for life.  Will Hawk be able to be there for Cara when she needs him the most?  Weddings are stressful and marriage can be challenging, but when a woman marries an outlaw the stakes are higher and more dangerous than ever….  An Insurgent’s Wedding is 67,670 words.  An Insurgent’s Wedding is Hawk and Cara’s continuing story. It is part of the Insurgents MC series and is NOT a standalone romance novel.  This book set contains violence, sexual assault (not graphic), strong language, and steamy/graphic sexual scenes. It describes the life and actions of an outlaw motorcycle club. If any of these issues offend you, please do not read the book. HEA. No cliffhangers! It may have triggers for some readers. The book is intended for readers over the age of 18.",
  "genres": [
    "Romance",
    "Suspense",
    "Contemporary",
    "Love"
  ],
  "author": "Chiah Wilder",
  "average_rating": "4.56",
  "url": "https://www.goodreads.com/book/show/33412682-an-insurgent-s-wedding---box-set"
}