{
  "title": "Africa's World War: Congo, the Rwandan Genocide, and the Making of a Continental Catastrophe",
  "description": "The Rwandan genocide sparked a horrific bloodbath that swept across sub-Saharan Africa, ultimately leading to the deaths of some four million people. In this extraordinary history of the recent wars in Central Africa, Gerard Prunier offers a gripping account of how one grisly episode laid the groundwork for a sweeping and disastrous upheaval.Prunier vividly describes the grisly aftermath of the Rwandan genocide, when some two million refugees--a third of Rwanda's population--fled to exile in Zaire in 1996. The new Rwandan regime then crossed into Zaire and attacked the refugees, slaughtering upwards of 400,000 people. The Rwandan forces then turned on Zaire's despotic President Mobutu and, with the help of a number of allied African countries, overthrew him. But as Prunier shows, the collapse of the Mobutu regime and the ascension of the corrupt and erratic Laurent-Désiré Kabila created a power vacuum that drew Rwanda, Uganda, Angola, Zimbabwe, Sudan, and other African nations into an extended and chaotic war. The heart of the book documents how the whole core of the African continent became engulfed in an intractible and bloody conflict after 1998, a devastating war that only wound down following the assassination of Kabila in 2001. Prunier not only captures all this in his riveting narrative, but he also indicts theinternational community for its utter lack of interest in what was then the largest conflict in the world.Praise for the \"The most ambitious of several remarkable new books that reexamine the extraordinary tragedy of Congo and Central Africa since the Rwandan genocide of 1994.\"-- New York Review of Books\"One of the first books to lay bare the complex dynamic between Rwanda and Congo that has been driving this disaster.\"--Jeffrey Gettleman, New York Times Book Review\"Lucid, meticulously researched and incisive, Prunier's will likely become the standard account of this under-reported tragedy.\"-- Publishers Weekly",
  "genres": [
    "Africa",
    "History",
    "Nonfiction",
    "War",
    "Rwanda",
    "Politics",
    "World History"
  ],
  "author": "Gérard Prunier",
  "average_rating": "4.09",
  "url": "https://www.goodreads.com/book/show/3343049-africa-s-world-war"
}