{
  "title": "Blood on the Vine",
  "description": "There's a victim in the vineyard. Or is the person in the castle next door?Jessica Fletcher is visiting Napa Valley wine country in California while doing research for her next book and invites her old friend, Scotland Yard detective George Sutherland to join her at a cozy bed and breakfast. Just friends mind you. No sooner do they arrive than they find the valley abuzz over the murder of a waiter at the restaurant owned by infamous, ex-Hollywood heavyweight Bill Ladington. His blatant womanizing and involvement in a bitter vineyard land dispute have already marked him as a dubious character - and a possible suspect.But when Ladington turns up dead from a supposed suicide, Jessica knows that a murderer is on the loose. With help from George, she must try and bottle up a motive for murder from an extensive list of less-than-vintage suspects!Librarian's note #1: the first 15 books in the current Jessica Fletcher / Donald Bain 'Murder She Wrote' series are #1, Gin & Daggers (1989) with a 2nd edition in (2000); #2, Manhattans & Murder (1994); #3, Rum & Razors (1995); #4, Brandy & Bullets (1995); #5, Martinis & Mayhem (1995); #6, A Deadly Judgment (1996); #7, A Palette for Murder (1996); #8, The Highland Fling Murders (1997); #9, Murder on the QE2 (1997); #10, Murder in Moscow (1998); #11, A Little Yuletide Murder (1998); #12, Murder at the Powderhorn Ranch (1999); #13, Knock 'Em Dead (1999); #14, Trick or Treachery (2000); and #15, Blood on the Vine (2001).Librarian's note #2: there is an earlier MSW series by James Anderson and David Deutsch. Novelizations of TV episodes. This original series has 4 volumes: #1, The Murder of Sherlock Holmes (1985); #2, Hooray for Homicide (1985); #3, Lovers and Other Killers (1986); and #4, Murder in Two Acts (1986).",
  "genres": [
    "Mystery",
    "Fiction",
    "Cozy Mystery",
    "Cozy",
    "Mystery Thriller",
    "Crime",
    "Suspense"
  ],
  "author": "Jessica Fletcher",
  "average_rating": "3.92",
  "url": "https://www.goodreads.com/book/show/334386.Blood_on_the_Vine"
}