{
  "title": "Mohammed and Charlemagne",
  "description": "The final work of the great Belgian historian Henri Pirenne, this remarkable classic — published after his death — offers a revolutionary perspective on how Europe under the influence of a Roman Empire centered in Constantinople evolved into the Europe of Charlemagne and the Middle Ages.Departing from the standard view that Germanic invasions obliterated the Roman Empire, Pirenne advances the radical new thesis that \"the cause of the break with the tradition of antiquity was the rapid and unexpected advance of Islam,\" and event of historical proportions that prevented the western Mediterranean from being what it had always been: a thoroughfare of commerce and thought. It became instead what Pirenne refers to as \"a Musulman lake,\" thereby causing \"the axis of life [to shift] northwards from the Mediterranean\" for the first time in history.Brilliant and controversial, this volume garnered these words of praise from the critics: \"It is a dull reader indeed who does not recognize the light of genius in the pages of this book, without doubt a landmark in contemporary historiography.\" — G. C. Boyce, Annals of the American Academy . \"… Pirenne's crowning triumph. The fire of his genius, the boldness of his mind, his profound learning and vivid pen make this volume pleasant reading.\" — Commonweal . \"… an important, seminal book, worthy to close one of the most distinguished careers in European scholarship.\" — Saturday Review of Literature .Pirenne's masterly study is essential reading for history students, medievalists, and general readers with an interest in the decline of the Roman Empire and the beginnings of the Middle Ages.",
  "genres": [
    "History",
    "Medieval",
    "Medieval History",
    "Nonfiction",
    "Islam",
    "Religion",
    "European History"
  ],
  "author": "Henri Pirenne",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/334214.Mohammed_and_Charlemagne"
}