{
  "title": "The Contract With God Trilogy: Life on Dropsie Avenue",
  "description": "alternate cover for ISBN 9780393061055Will Eisner (1917–2005) saw himself as \"a graphic witness reporting on life, death, heartbreak, and the never-ending struggle to prevail.\" The publication of A Contract With God when Eisner was sixty-one proved to be a watershed moment both for him and for comic literature. It marked the birth of the modern graphic novel and the beginning of an era when serious cartoonists could be liberated from their stultifying comic-book format.More than a quarter-century after the initial publication of A Contract With God, and in the last few months of his life, Eisner chose to combine the three fictional works he had set on Dropsie Avenue, the mythical street of his youth in Depression-era New York City.As the dramas unfold in A Contract With God, the first book in this new trilogy, it is at 55 Dropsie Avenue where Frimme Hersh, the pious Jew, first loses his beloved daughter, then breaks his contract with his maker, and ends up as a slumlord; it is on Dropsie Avenue where a street singer, befriended by an aging diva, is so beholden to the bottle that he fails to grasp his chance for stardom; and it is there that a scheming little girl named Rosie poisons a depraved super’s dog before doing in the super as well.In the second book, A Life Force, declared by R. Crumb to be \"a masterpiece,\" Eisner re-creates himself in his protagonist, Jacob Shtarkah, whose existential search reflected Eisner’s own lifelong struggle. Chronicling not only the Crash of 1929 and the Great Depression but also the rise of Nazism and the spread of left-wing politics, Eisner combined the miniaturist sensibility of Henry Roth with the grand social themes of novelists such as Dos Passos and Steinbeck.Finally, in Dropsie Avenue: The Neighborhood, Eisner graphically traces the social trajectory of this mythic avenue over four centuries, creating a sweeping panorama of the city and its waves of new residents—the Dutch, English, Irish, Jews, African Americans, and Puerto Ricans—whose faces changed yet whose lives presented an unending \"story of life, death, and resurrection.\"The Contract With God Trilogy is a mesmerizing, fictional chronicle of a universal American experience and Eisner’' most poignant and enduring literary legacy.",
  "genres": [
    "Graphic Novels",
    "Fiction",
    "Comics",
    "Graphic Novels Comics",
    "Historical Fiction",
    "Classics",
    "Comic Book"
  ],
  "author": "Will Eisner",
  "average_rating": "4.24",
  "url": "https://www.goodreads.com/book/show/33472.The_Contract_With_God_Trilogy"
}