{
  "title": "Star Wars: The Prequel Trilogy",
  "description": "For the first time in one stunning volume, here is the complete, epic story arc: The Phantom Menace, Attack of the Clones, and Revenge of the Sith. Experience the sweeping tale of good and evil, of myth and magic, of innocence and power-and witness the tragic transformation of Anakin Skywalker from mere slave to one of the greatest, most powerful, and feared villains of the galaxy: Darth Vader. \"The path has been placed before you, Anakin.The choice to take it must be yours alone.\" On the barren desert world of Tatooine, young Anakin Skywalker toils by day and dreams by night . . . of traveling the stars to worlds he's only heard of in stories. When Jedi Knight Qui-Gon Jinn and his apprentice, Obi-Wan Kenobi, cross paths with Anakin, it marks the beginning of the drama that will become legend. Courageous to the point of recklessness, Anakin comes of age in a time of great upheaval. The attempted assassination of Senator Padme Amidala thrusts the Republic close to the edge of disaster-and brings Anakin and Padme into a secret romance as intense as it is forbidden. As combat escalates across the galaxy, the stage is set for an explosive endgame. Tormented by unspeakable visions, Anakin edges closer to the brink of a decision with profound ramifications. It remains only for Darth Sidious to strike the final staggering blow against the Republic-and to ordain a fearsome new Sith Lord: Darth Vader. THE PHANTOM MENACEby Terry Brooks, based on the story and screenplay by George Lucas ATTACK OF THE CLONESby R. A. Salvatore, from a story by George Lucas and a screenplay by George Lucas and Jonathan Hales REVENGE OF THE SITHby Matthew Stover, based on the story and screenplay by George Lucas",
  "genres": [
    "Star Wars",
    "Science Fiction",
    "Fiction",
    "Fantasy",
    "Science Fiction Fantasy",
    "Space Opera",
    "Adventure"
  ],
  "author": "Terry Brooks",
  "average_rating": "4.22",
  "url": "https://www.goodreads.com/book/show/334829.Star_Wars"
}