{
  "title": "Capitol Men: The Epic Story of Reconstruction Through the Lives of the First Black Congressmen",
  "description": "Reconstruction was a time of idealism and sweeping change, as the victorious Union created citizenship rights for the freed slaves and granted the vote to black men. Sixteen black Southerners, elected to the U.S. Congress, arrived in Washington to advocate reforms such as public education, equal rights, land distribution, and the suppression of the Ku Klux Klan. But these men faced astounding odds. They were belittled as corrupt and inadequate by their white political opponents, who used legislative trickery, libel, bribery, and the brutal intimidation of their constituents to rob them of their base of support. Despite their status as congressmen, they were made to endure the worst humiliations of racial prejudice. And they have been largely forgotten—often neglected or maligned by standard histories of the period. In this beautifully written book, Philip Dray reclaims their story. Drawing on archival documents, contemporary news accounts, and congressional records, he shows how the efforts of black Americans revealed their political perceptiveness and readiness to serve as voters, citizens, and elected officials. We meet men like the war hero Robert Smalls of South Carolina (who had stolen a Confederate vessel and delivered it to the Union navy), Robert Brown Elliott (who bested the former vice president of the Confederacy in a stormy debate on the House floor), and the distinguished former slave Blanche K. Bruce (who was said to possess “the manners of a Chesterfield”). As Dray demonstrates, these men were eloquent, creative, and often effective representatives who, as support for Reconstruction faded, were undone by the forces of Southern reaction and Northern indifference. In a grand narrative that traces the promising yet tragic arc of Reconstruction, Dray follows these black representatives’ struggles, from the Emancipation Proclamation to the onset of Jim Crow, as they fought for social justice and helped realize the promise of a new nation.",
  "genres": [
    "History",
    "Nonfiction",
    "American History",
    "Politics",
    "Race",
    "Biography",
    "African American"
  ],
  "author": "Philip Dray",
  "average_rating": "4.13",
  "url": "https://www.goodreads.com/book/show/3350514-capitol-men"
}