{
  "title": "Dangerous Ground: My Friendship with a Serial Killer",
  "description": "“Anyone can become a killer under the right circumstances—even you.”  For the first time, award-winning investigative journalist M. William Phelps reveals the identity of “Raven,” the serial killer who co-starred with him on Dark Minds—and tells the story of his intriguing bond with one of America’s most disturbing killers. In September 2011, M. William Phelps made a bold decision that would change the landscape of reality-based television – and his own life. He asked a convicted serial killer to act as a consultant for his TV series. Under the code name “Raven,” the murderer shared his insights into the minds of other killers and helped analyze their crimes. As the series became an international sensation, Raven became Phelps’s unlikely confidante, ally—and friend. “I’m not making excuses for the eight murders I committed.” In this deeply personal account, Phelps traces his own family’s dark history, and takes us into the heart and soul of a serial murderer. He also chronicles the complex relationship he developed with Raven. From questions about morality to Raven’s thoughts on the still-unsolved, brutal murder of Phelps’s sister-in-law, the author found himself grappling with an unwanted, unexpected, unsettling connection with a cold-blooded killer.  “It made me feel warm inside to know that I was responsible for that pain . . .” Drawing on over 7,000 pages of letters, dozens of hours of recorded conversations, personal and Skype visits, and a friendship five years in the making, Phelps sheds new light on Raven’s bloody history, including details of an unknown victim, the location of a still-buried body—and a jaw-dropping admission. Eye-opening and provocative, Dangerous Ground is an unforgettable journey into the mind of a charming, manipulative psychopath that few would dare to know—and the determined journalist who did just that.",
  "genres": [
    "True Crime",
    "Nonfiction",
    "Crime",
    "Memoir",
    "Biography",
    "Mystery",
    "History"
  ],
  "author": "M. William Phelps",
  "average_rating": "3.65",
  "url": "https://www.goodreads.com/book/show/33505987-dangerous-ground"
}