{
  "title": "Memoirs of Thomas Boston",
  "description": "Born into relative obscurity in 1676 in Duns, Berwickshire, Thomas Boston died in 1732 in the small parish of Ettrick in the Scottish Borders. But his 56 years of life, 45 of them spent in conscious Christian discipleship, lend credibility to the spiritual principle that it is not where a Christian serves, but what quality of service he renders, that really counts. Graduating in Arts from Edinburgh University, Boston spent only one session in theological college before completing his studies extramurally. With arduous discipline, his private studies, sustained by a meagre library, earned him a widespread reputation. As a Hebrew scholar he was, writes George Morison, 'welcomed as an equal by the finest Hebrew scholars in the world'; as a theologian, Jonathan Edwards wrote that he was 'a truly great divine'. But it is a loving, faithful, rigorously self-disciplined Christian pastor, and one deeply committed to the grace of God, that Boston is best remembered. Leaving his first charge at Simprin (where he served 1699-1707), he settled in Ettrick for a 25 year ministry that saw the numbers of communications rise from 60 to 777. Constantly burdened for his congregation, Boston taught them in season and out of season, in pulpit and in home; burdened for the truth of the gospel, he overcame all natural timidity to engage in controversy over the teaching of Professor Simson (who was charged with heretical doctrine), and in the famous 'Marrow Controversy'. It is, however, as a preacher that Boston's influence was most widely felt; \"There was a grip in it that no preacher wins who is a stranger to his own heart'. Out of this ministry came Human Nature in Its Fourfold State and other works of enduring value. Boston's Memoirs record the joys and sorrows, the burdens and victories of his life. Here we read of his love for Catherine Brown and of their marriage, of death in the family circle, of the dark cloud of his wife's affliction, and of Boston's own ceaseless gospel labours. Out of these labours, and his deep Christian experience, Thomas Boston gave the church one of its most enduring spiritual autobiographies.",
  "genres": [
    "Biography",
    "Church History"
  ],
  "author": "Thomas Boston",
  "average_rating": "4.08",
  "url": "https://www.goodreads.com/book/show/3349276-memoirs-of-thomas-boston"
}