{
  "title": "Around the World in Eighty Wines: Exploring Wine One Country at a Time",
  "description": "Inspired by Jules Verne’s classic adventure tale, celebrated editor-in-chief of The Wine Economist Mike Veseth takes his readers Around the World in Eighty Wines.The journey starts in London, Phileas Fogg’s home base, and follows Fogg’s itinerary to France and Italy before veering off in search of compelling wine stories in Syria, Georgia, and Lebanon. Every glass of wine tells a story, and so each of the eighty wines must tell an important tale. We head back across Northern Africa to Algeria, once the world’s leading wine exporter, before hopping across the sea to Spain and Portugal. We follow Portuguese trade routes to Madeira and then South Africa with a short detour to taste Kenya’s most famous Pinot Noir. Kenya? Pinot Noir? Really!The route loops around, visiting Bali, Thailand, and India before heading north to China to visit Shangri-La. Shangri-La? Does that even exist? It does, and there is wine there. Then it is off to Australia, with a detour in Tasmania, which is so cool that it is hot. The stars of the Southern Cross (and the title of a familiar song) guide us to New Zealand, Chile, and Argentina. We ride a wine train in California and rendezvous with Planet Riesling in Seattle before getting into fast cars for a race across North America, collecting more wine as we go. Pause for lunch in Virginia to honor Thomas Jefferson, then it’s time to jet back to London to tally our wines and see what we have learned.Why these particular places? What are the eighty wines and what do they reveal? And what is the surprise plot twist that guarantees a happy ending for every wine lover? Come with us on a journey of discovery that will inspire, inform, and entertain anyone who loves travel, adventure, or wine.",
  "genres": [
    "Nonfiction",
    "Wine",
    "Travel",
    "Food",
    "Culinary",
    "Food and Drink"
  ],
  "author": "Mike Veseth",
  "average_rating": "3.56",
  "url": "https://www.goodreads.com/book/show/33505803-around-the-world-in-eighty-wines"
}