{
  "title": "The Accidental Guerrilla: Fighting Small Wars in the Midst of a Big One",
  "description": "David Kilcullen is one of the world's most influential experts on counterinsurgency and modern warfare. A Senior Counterinsurgency Advisor to General David Petraeus in Iraq, his vision of war dramatically influenced America's decision to rethink its military strategy in Iraq and implement \"the surge.\" Now, in The Accidental Guerrilla , Kilcullen provides a remarkably fresh perspective on the War on Terror. Kilcullen takes us \"on the ground\" to uncover the face of modern warfare, illuminating both the big global war (the \"War on Terrorism\") and its relation to the associated \"small wars\" across the Iraq, Afghanistan, the Philippines, Indonesia, Thailand, Chechnya, Pakistan and North Africa. Kilcullen sees today's conflicts as a complex pairing of contrasting local social networks and worldwide movements; traditional and postmodern culture; local insurgencies seeking autonomy and a broader pan-Islamic campaign. He warns that America's actions in the war on terrorism have tended to conflate these trends, blurring the distinction between local and global struggles and thus enormously complicating our challenges. Indeed, the US had done a poor job of applying different tactics to these very different situations, continually misidentifying insurgents with limited aims and legitimate grievances (whom he calls \"accidental guerrillas\") as part of a coordinated worldwide terror network. We must learn how to disentangle these strands, develop strategies that deal with global threats, avoid local conflicts where possible, and win them where necessary. Colored with gripping battlefield experiences that range from the jungles and highlands of Southeast Asia to the mountains of the Afghanistan-Pakistan border to the dusty towns of the Middle East, The Accidental Guerrilla will, quite simply, change the way we think about war. This much anticipated book will be a must read for everyone concerned about the war on terror.",
  "genres": [
    "Military Fiction",
    "History",
    "Nonfiction",
    "War",
    "Politics",
    "Military History",
    "International Relations"
  ],
  "author": "David Kilcullen",
  "average_rating": "4.06",
  "url": "https://www.goodreads.com/book/show/3348656-the-accidental-guerrilla"
}