{
  "title": "An Empire Wilderness: Travels into America's Future",
  "description": "\"Full of surprises and unusual revelations . . . an informed and disturbing portrait of the new American badlands.\"-- Chicago Tribune\"[Kaplan is] tireless, curious, and smart. . . . I cannot imagine anyone will concoct a more convincing scenario for the American future.\" --Thurston Clarke,   The New York TimesWith the same prescience and eye for telling detail that distinguished his bestselling Balkan Ghosts , Robert Kaplan now explores his native country, the United States of America. His starting the conviction that America is a country not in decline but in transition, slowly but inexorably shedding its identity as a monolithic nation-state and assuming a radically new one.        Everywhere Kaplan travels--from St. Louis, Missouri, to Portland, Oregon, from the forty-ninth parallel to the banks of the Rio Grande--he finds an America ever more fragmented along lines of race, class, education, and geography. An America whose wealthy communities become wealthier and more fortress-like as they become more closely linked to the world's business capitals than to the desolate ghettoes next door. An America where the political boundaries between the states--and between the U.S. and Canada and Mexico--are becoming increasingly blurred, betokening a vast open zone for trade, commerce, and cultural interaction, the nexus of tomorrow's transnational world. Never nostalgic or falsely optimistic, bracingly unafraid of change and its consequences, Kaplan paints a startling portrait of post-Cold War America--a great nation entering the final, most uncertain phase of its history. Here is travel writing with the force of prophecy.\"Lively . . . Kaplan has a sharp eye for social truth, and his encounters with a chorus of eloquent citizens of the West keeps the narrative humming.\" -- Outside",
  "genres": [
    "Travel",
    "Nonfiction",
    "History",
    "Politics",
    "United States",
    "American",
    "Geography"
  ],
  "author": "Robert D. Kaplan",
  "average_rating": "3.91",
  "url": "https://www.goodreads.com/book/show/335217.An_Empire_Wilderness"
}