{
  "title": "Hainish Novels & Stories, Vol. 1: Rocannon’s World / Planet of Exile / City of Illusions / The Left Hand of Darkness / The Dispossessed / Stories",
  "description": "Beginning in the 1960s and 70s, Ursula K. Le Guin redrew the map of modern science fiction. In such visionary masterworks as the Nebula and Hugo Award winners The Left Hand of Darkness and The Dispossessed, she imagined a galactic confederation of human colonies founded by the planet Hain—an array of worlds whose divergent societies, the result of both evolution and genetic engineering, afford a rich field for literary explorations of “the nature of human nature,” as Margaret Atwood has described Le Guin’s subject. Now, for the first time, the complete Hainish novels and stories are collected in a definitive two-volume Library of America edition, with new introductions by the author.Le Guin first conceived her League of All Worlds in three early novels of daring inventiveness. In Rocannon’s World (1966), Hainish scientist Gaverel Rocannon ventures to an unnamed planet to conduct a peaceful ethnological survey only to discover a secret outpost of the League’s deadly enemy. In Planet of Exile (1966), the fate of colonists from Earth stranded on distant Werel depends on working together with the planet’s indigenous peoples if they are to survive the oncoming fifteen-year winter. City of Illusions (1967), set far in the future on a sparsely populated Earth that has lost contact with all other planets and is ruled by the mysterious, mind-lying Shing, turns on the appearance of an amnesiac with yellow eyes who may hold the key to humanity’s freedom.In The Left Hand of Darkness (1969) Earth-born Genly Ai travels to wintery Gethen to convince its nations to join the Ekumen, the confederation of known worlds. To do so he must navigate the subtleties of politics and culture on a planet populated by an ambisexual people who have never known war. This is the novel that inspired Harold Bloom to observe that “Le Guin, more than Tolkien, has raised fantasy into high literature.”The Dispossessed (1974), a philosophical adventure story in which a physicist strives to complete a theory of simultaneity that will for the first time allow instantaneous communication between all the planets of humanity, is set against the backdrop of Le Guin’s richly textured vision of what an anarchist society might look like in practice.Also included are four short stories and six essays about the novels, plus the surprising original 1969 version of the story “Winter’s King.” The endpaper map of Gethen has been colorized from a drawing by Le Guin herself.",
  "genres": [
    "Science Fiction",
    "Fiction",
    "Fantasy",
    "Collections",
    "Science Fiction Fantasy",
    "Novels",
    "Classics"
  ],
  "author": "Ursula K. Le Guin",
  "average_rating": "4.58",
  "url": "https://www.goodreads.com/book/show/33533490-hainish-novels-stories-vol-1"
}