{
  "title": "The Hainish Novels and Stories",
  "description": "For the first time, all of Ursula K. Le Guin’s Hainish novels and stories are brought together in a single edition, complete and with new introductions by the author. Beginning in the 1960s and 70s, these remarkable works redrew the map of modern science fiction. In such visionary masterworks as the Nebula and Hugo Award winners The Left Hand of Darkness and The Dispossessed, Le Guin imagined a galactic confederation of human colonies founded by the planet Hain—an array of worlds whose divergent societies were the result of both evolution and genetic engineering.Le Guin first conceived her League of All Worlds in three early novels of daring inventiveness. In Rocannon’s World (1966), Hainish scientist Gaverel Rocannon ventures to an unnamed planet to conduct a peaceful ethnological survey only to discover a secret outpost of the League’s deadly enemy. In Planet of Exile (1966), the fate of colonists from Earth stranded on distant Werel depends on working together with the planet’s indigenous peoples if they are to survive the oncoming fifteen-year winter. City of Illusions (1967), set far in the future on a sparsely populated Earth that has lost contact with all other planets and is ruled by the mysterious, mind-lying Shing, turns on the appearance of an amnesiac with yellow eyes who may hold the key to humanity’s freedom.In The Left Hand of Darkness (1969) Earth-born Genly Ai travels to wintery Gethen to convince its nations to join the Ekumen, the confederation of known worlds. To do so he must navigate the subtleties of politics and culture on a planet populated by an ambisexual people who have never known war. The Dispossessed (1974), a philosophical adventure story in which a physicist strives to complete a theory of simultaneity that will for the first time allow instantaneous communication between all the planets of humanity, is set against the backdrop of Le Guin’s richly textured vision of what an anarchist society might look like in practice.The Word for World Is Forest (1972), is set on the colony planet of Athshe, where Terrans have arrived to strip its rich natural forests for a depleted Earth. To do so, they enslave the peaceable indigenous population, until the Athsheans rise up in a desperate act of defiance that will leave them and their planet forever changed.Five Ways to Forgiveness presents for the first time the complete story suite previously published as Four Ways to Forgiveness (1995). These five linked stories tell the history of the planet Werel and its slave planet Yeowe as their peoples, long known as “owners” and “assets,” together face an uncertain revolutionary future.In The Telling (2000), Sutty, an observer of the interplanetary confederation known as the Ekumen, has been sent to Aka to investigate why the planet has almost entirely lost its vital oral traditions and spiritual beliefs in the span of a single generation. Sutty’s quest for traces of Aka’s original religion causes her to reexamine her own childhood growing up amidst a repressive religious regime on Earth.Also included are eleven short stories, eight essays (including the provocative “On Not Reading Science Fiction”), and the surprising original 1969 version of the story “Winter’s King.” The endpapers have a map of Gethen colorized from a drawing by Le Guin herself and a planetary chart of the known worlds of the Hainish descent.Brian Attebery, editor, is professor of English at Idaho State University and the editor of Journal of the Fantastic in the Arts. He edited The Norton Book of Science Fiction (1997) with Ursula K. Le Guin and Karen Joy Fowler and is the author of Stories About Stories: Fantasy and the Remaking of Myth (2014) and Decoding Gender in Science Fiction (2002), among other books.",
  "genres": [
    "Science Fiction",
    "Fiction",
    "Fantasy",
    "Short Stories",
    "Classics",
    "Novels",
    "Collections"
  ],
  "author": "Ursula K. Le Guin",
  "average_rating": "4.76",
  "url": "https://www.goodreads.com/book/show/33533489-the-hainish-novels-and-stories"
}