{
  "title": "Hainish Novels & Stories, Vol. 2: The Word for World Is Forest / Five Ways to Forgiveness / The Telling / Stories",
  "description": "This second volume of Le Guin’s complete Hainish novels and stories opens with the Hugo Award–winning The Word for World Is Forest (1972), set on the colony planet of Athshe, where Terrans have arrived to strip its rich natural forests for a depleted Earth. To do so, they enslave the peaceable indigenous population, until the Athsheans rise up in a desperate act of defiance that will leave them and their planet forever changed.Of the seven stories gathered here, three concern the invention of a new technology for instantaneous interstellar travel—an advance that brings with it unforeseen dangers—and three explore the complex matrimonial arrangements on the planet O, where unions consist of four individuals in both same and opposite sex pairings.Five Ways to Forgiveness presents for the first time the complete story suite previously published as Four Ways to Forgiveness (1995). These five linked stories tell the history of the planet Werel and its slave planet Yeowe as their peoples, long known as “owners” and “assets,” together face an uncertain revolutionary future.In The Telling (2000), Sutty, an observer of the interplanetary confederation known as the Ekumen, has been sent to Aka to investigate why the planet has almost entirely lost its vital oral traditions and spiritual beliefs in the span of a single generation. Sutty’s quest for traces of Aka’s original religion causes her to reexamine her own childhood growing up amidst a repressive religious regime on Earth.Also included are Le Guin’s 1977 introduction to The Word for World Is Forest and her provocative 1994 essay “On Not Reading Science Fiction.” The volume’s endpaper features a planetary chart of the known worlds of the Hainish descent.",
  "genres": [
    "Science Fiction",
    "Fiction",
    "Short Stories",
    "Science Fiction Fantasy",
    "Novels",
    "Fantasy",
    "Collections"
  ],
  "author": "Ursula K. Le Guin",
  "average_rating": "4.54",
  "url": "https://www.goodreads.com/book/show/33533491-hainish-novels-stories-vol-2"
}