{
  "title": "Ebb Tide: A Post-Zombie Apocalypse Thriller",
  "description": "Imagine the world ended while you were at sea. A two week blue water passage becomes a journey into an unknown future when a virulent plague wipes out humanity. Where would you go? How would you survive? And what would happen to your children? It's thirteen years after the Great Dying, a vicious plague that wiped out 99% of humanity - and turned many of the survivors into twisted monsters. Matai is the last surviving member of a famous sailing family. Alone, she sails her yacht Voodoo through a shattered world. Battling the elements and vicious survivors, she struggles to keep the failing systems of her boat – her home – going. She uses every ounce of ingenuity and knowledge gleaned from her passed parents to perform the day to day maintenance necessary to stay afloat. She has become a scavenger by necessity; searching deadly shipwrecks for anything that can keep her alive – or that she can trade with other survivors. But all this changes when, while exploring a derelict cargo ship, she discovers an evil greater than any she's ever faced. For the isolated islands of the Pacific are now the last scattered bastions of humanity. And it is on these islands that Matai will face her greatest challenge yet – one that may spell the final end for the human race. What is the Southwind Saga? The Southwind Saga is a series of books with a nautical focus set in a post-apocalyptic world. Think Walking Dead with boats or (as one reviewer put it) The Young Woman and the Zombie instead of The Old Man and the Sea. In the world of the Southwind Saga, no one really knows what caused the end of the world. No one really understands how the disease, that kills most and turns others into mindless monsters, came to be. The plague that wiped out humanity struck so suddenly that the only survivors were those too isolated to be infected - and too isolated to have a proper idea of what is going on. It's a Saga as it's an open ended series, where we follow the lives of the main characters - Matty, a nineteen year old female sailor and Zac, a young introverted translator - as they struggle to rebuild society on a remote island in the Pacific Ocean, thirteen years after a zombie apocalypse. Read it if you enjoyed The Passage by Justin Cronin or Station Eleven by Emily St. John Mandel - or if you want a fresh take on the post-apocalyptic scenario. Fans of kickass - yet realistic - heroines will also love this book. The first two books of the series - EBB TIDE and SLACK WATER - are out now.",
  "genres": [
    "Zombies"
  ],
  "author": "Jase Kovacs",
  "average_rating": "3.90",
  "url": "https://www.goodreads.com/book/show/33525782-ebb-tide"
}