{
  "title": "Above Suspicion",
  "description": "The “expertly told” true story of an FBI agent’s affair that leads to murder in Kentucky coal country—soon to be a major motion picture starring Emilia Clarke (Publishers Weekly). When rookie FBI agent Mark Putnam received his first assignment in 1987, it was the culmination of a lifelong dream, if not the most desirable location. Pikeville, Kentucky, is high in Appalachian coal country, an outpost rife with lawlessness dating back to the Hatfields and McCoys. As a rising star in the bureau, however, Putnam soon was cultivating paid informants and busting drug rings and bank robbers. But when one informant fell in love with him, passion and duty would collide with tragic results.  A coal miner’s daughter, Susan Smith was a young, attractive, struggling single mother. She was also a drug user sometimes described as a con artist, thief, and professional liar. Ultimately, Putnam gave in to Smith’s relentless pursuit. But when he ended the affair, she waged a campaign of vengeance that threatened to destroy him. When at last she confronted him with a shocking announcement, a violent scuffle ensued, and Putnam, in a burst of uncontrolled rage, fatally strangled her.  Though he had everything necessary to get away with murder—a spotless reputation, a victim with multiple enemies, and the protection of the bureau’s impenetrable shield—his conscience wouldn’t allow it. Tormented by a year of guilt and deception, Putnam finally led authorities to Smith’s remains. This is the story of what happened before, during, and after his startling confession—an account that “should take its place on the dark shelf of the best American true crime” (Newsday). Revised and updated, this ebook also includes photos and a new epilogue by the author.",
  "genres": [
    "True Crime",
    "Nonfiction",
    "Crime",
    "Biography",
    "Mystery",
    "Audiobook",
    "Thriller"
  ],
  "author": "Joe Sharkey",
  "average_rating": "4.01",
  "url": "https://www.goodreads.com/book/show/33519032-above-suspicion"
}