{
  "title": "Abandoned & Protected: The Marquis' Tenacious Wife",
  "description": "A bear of a man. A twig of a girl. And a love that was destined to be.After what her father did to her mother, HENRIETTA TURNER's worst fears are to be realised when her uncle decides to marry her off to a Scot. Gentleman or not, Henrietta knows that at his core he is still a barbarian. What will she suffer at the hands of this savage?CONNOR BRUNWOOD, MARQUIS OF RODRIDGE, cannot believe he fell head over heels in love with this thin, pale twig of a girl. However, the moment he saw her, he knew he had to make her his wife. If only she didn't hate the very sight of him!However, when his life is suddenly in danger, an assassin lying in wait, everything they thought they knew is put to the test.Will Henrietta betray her husband or stand by his side? Will she take the opportunity to rid herself of him forever? Or will she risk everything to save his life...as well as her heart?This tale by a USA TODAY bestselling author shows that it is never too late to start over.If you like marriage of convenience stories with a touch of mystery, a dash of humour as well as heartfelt emotion, then you’ll love this instalment of Bree Wolf’s emotionally charged Love’s Second Chance Series. Buy ABANDONED AND PROTECTED, grab a cup of tea, settle into your favorite reading spot and start this swoon worthy romance now!Love's Second Chance Series#1 Forgotten & Remembered - The Duke's Late Wife (Rosabel & Graham)#2 Cursed & Cherished - The Duke's Wilful Wife (Anna & Edmond)#3 Despised & Desired - The Marquess' Passionate Wife (Ellie & Frederick)#4 Abandoned & Protected - The Marquis' Tenacious Wife (Henrietta & Connor)#5 Ruined & Redeemed - The Earl's Fallen Wife (Charlotte & Sebastian)#6 Betrayed & Blessed - The Viscount's Shrewd Wife (Beth & Tristan)#7 Deceived & Honoured - The Baron’s Vexing Wife (Madeline & Derek)More to follow:#8 Sacrificed & Reclaimed - The Soldier's Daring Widow (Meagan & Edward) (Bonus Novella)A Forbidden Love Novella Series#1 The Wrong Brother#2 A Brilliant Rose#3 The Forgotten Wife#4 An Unwelcome Proposal#5 Rules to Be Broken#6 Hearts to Be MendedTo Follow:#7 Winning her Hand#8 Conquering her Heart",
  "genres": [
    "Historical Romance",
    "Romance",
    "Historical",
    "Historical Fiction",
    "Regency",
    "Fiction",
    "Regency Romance"
  ],
  "author": "Bree Wolf",
  "average_rating": "4.07",
  "url": "https://www.goodreads.com/book/show/33551273-abandoned-protected"
}