{
  "title": "Cursed & Cherished: The Duke's Wilful Wife",
  "description": "A dashing duke. A headstrong heroine. And a battle of wills.EDMOND DUNSWORTH, DUKE OF CROMWELL, is bankrupt. The solution to his problem: a wife with a sizable dowry.Not worried in the least, Edmond takes his pick. After all, what woman could resist his charms?However, when his choice lands on fiery Anna, he realises he may not be able to conquer his wife’s heart with a charming smile alone.ANNA HANFORD, a merchant's daughter, is faced with a difficult choice: allow her sister to marry the duke and see her happiness shattered...or marry the duke herself.Determined to ensure her sister's future, Anna makes her choice. After all, isn't marriage just a minor inconvenience in life?Unfortunately, her new husband proves to be more than an inconvenience…but an enticement instead.Will Anna be able to resist him? Or will Edmond manage to conquer her heart after all?This tale by a USA TODAY bestselling author will make you smile and chuckle at Edmond's different attempts to entice his wife while making you wish to hit stubborn Anna over the head for resisting his charms.If you like marriage of convenience stories with a touch of mystery, a dash of humour as well as heartfelt emotion, then you’ll love this instalment of Bree Wolf’s emotionally charged Love’s Second Chance Series. Buy CURSED AND CHERISHED, grab a cup of tea, settle into your favorite reading spot and start this swoon worthy romance now!Love's Second Chance Series#1 Forgotten & Remembered - The Duke's Late Wife (Rosabel & Graham)#2 Cursed & Cherished - The Duke's Wilful Wife (Anna & Edmond)#3 Despised & Desired - The Marquess' Passionate Wife (Ellie & Frederick)#4 Abandoned & Protected - The Marquis' Tenacious Wife (Henrietta & Connor)#5 Ruined & Redeemed - The Earl's Fallen Wife (Charlotte & Sebastian)#6 Betrayed & Blessed - The Viscount's Shrewd Wife (Beth & Tristan)#7 Deceived & Honoured - The Baron’s Vexing Wife (Madeline & Derek)More to follow:#8 Sacrificed & Reclaimed - The Soldier's Daring Widow (Meagan & Edward) (Bonus Novella)A Forbidden Love Novella Series#1 The Wrong Brother#2 A Brilliant Rose#3 The Forgotten Wife#4 An Unwelcome Proposal#5 Rules to Be Broken#6 Hearts to Be MendedTo Follow:#7 Winning her Hand#8 Conquering her Heart",
  "genres": [
    "Historical Romance",
    "Romance",
    "Historical Fiction",
    "Historical",
    "Regency",
    "Regency Romance",
    "Amazon"
  ],
  "author": "Bree Wolf",
  "average_rating": "4.03",
  "url": "https://www.goodreads.com/book/show/33551255-cursed-cherished"
}