{
  "title": "The Three-Headed Dog",
  "description": "European borders are the gates of Hell, lurked over by hounds of police and organized crime. In The Three-Headed Dog, illegal migrants and smugglers are outsiders doing whatever it takes to make good, often by selling sex. A culture-clashing, morals-jarring milieu sheering towards noir.The young travellers paid to fly from a Caribbean island to the Costa del Sol, but a smugglers’ feud landed them elsewhere. Some, like Marina, know how to look for black-market jobs. Eddy, too young and eager to escape his family, disappears.Hired to search for him, private investigator Félix Vidal navigates underground worlds of street traders, scam artists, transnational human-trafficking gangs and local racketeers. The search takes in discotecas, cybercafés, tourist beaches, old Arab streets, ferries to Africa, expat enclaves and Goya's black paintings.For a veteran like Marina, the takeover of Latin American-run brothels by East Europeans means venturing into superclub prostitution. For Eddy, the choice could be whether to wash dishes and sleep on floors or become a rent-boy and enjoy sex tourists’ clean sheets. Félix searches in spas, flats and bars where lines dividing sex work and exploitation are completely blurred.In the realm of undocumented migration, knuckling under to thugs can be the sensible alternative to drowning at sea, and putting up with rotten jobs preferable to pointless lives back home. Félix, herself a migrant, has to face hard questions: What if Eddy doesn’t want to be found? How can she know what's good for him? What if the only useful tip to finding him comes from a killer? The Three-Headed Dog is international mystery in a downward-spiralling scenario for human mobility. By the author of cult classic Sex at the Margins: Migration, Labour Markets and the Rescue Industry.",
  "genres": [
    "Fiction"
  ],
  "author": "Laura María Agustín",
  "average_rating": "4.46",
  "url": "https://www.goodreads.com/book/show/33539069-the-three-headed-dog"
}