{
  "title": "P. T. Deutermann Collection - Sentinels of Fire & Ghosts of Bungo Suido",
  "description": "SENTINELS OF FIREThe dramatic tale of a lone destroyer, the USS Malloy, defending itself against unrelenting kamikaze attack in the desperate battle for Okinawa. By the spring of 1945, the once-mighty Japanese fleet has been virtually destroyed, leaving Japan open to invasion. Japan responds by dispatching hundreds of suicide bombers against the Allied fleet surrounding Okinawa. Patrolling miles off the coast, the USS Malloy is part of a squadron of ships assigned to warn the carrier formations closer to the island of impending kamikaze attack. Executive Officer Connie Miles begins to realize that Malloy’s much-admired Captain Tallmadge is losing his mind under the relentless pressure of the attacks. Facing multiple kamikaze and torpedo assaults each day, and watching their squadron diminish as ship after ship is destroyed, Miles and the ship’s junior officers grapple with the consequences of losing their skipper’s guidance—and perhaps the ship itself and everyone on board. GHOSTS OF BUNGO SUIDOIn late 1944, America’s recapture of the Philippines is jeopardized by what seems an insurmountable threat from immense Yamato-class battleships, which dwarf every other ship at sea. Built in total secrecy, these 76,000-ton warships seem invincible. American military intelligence knows of two such ships, but there are rumors of a third, built not as a battleship but as an aircraft carrier. Now ready to go operational from Japan’s heavily defended and mined Inland Sea, a carrier of that size could disrupt the entire invasion effort. American bombers can’t reach the Inland Sea, so the Navy high command decides to send a submarine on a special mission to kill the carrier...assuming that it even exists. No American submarine has ever been able to penetrate the Inland Sea; five boats and their crews have perished in or around the main entrance strait, known as Bungo Suido. Lieutenant Commander Gar Hammond - an aggressive, ship-killing captain with a reckless streak - is now skipper of the Dragonfish, a new submarine. When Admiral Nimitz decides to try one more time, Hammond becomes the navy’s only hope to locate and stop the Japanese super-ship before it escapes into the open Pacific.",
  "genres": [],
  "author": "P.T. Deutermann",
  "average_rating": "3.75",
  "url": "https://www.goodreads.com/book/show/33537664-p-t-deutermann-collection---sentinels-of-fire-ghosts-of-bungo-suido"
}