{
  "title": "Forgotten & Remembered: The Duke's Late Wife",
  "description": "A grieving widower. A strong lady. And a little girl who needs them both.After losing his wife in an accident, GRAHAM ASTOR, DUKE OF KENSINGTON, decides that love is not worth the risk of having his heart broken all over again. Even his little daughter he keeps at a distance, afraid to hurt her with the darkness that now lives in his heart. Since he is unable to be the father she deserves, he vows to find her a mother who will heal her little heart.At a garden party, Graham spots a young woman with a shy smile tending lovingly to her little cousins…and he knows his duty.As the black sheep of her family, ROSABEL LANDER has no illusions about love. After her parents’ deaths, her aunt and uncle reluctantly took her in, demanding nothing short of complete obedience. Unable to live down her past, Rosabel only wishes for one thing: freedom.However, before she dares to take the first step toward an independent future, a cold-hearted stranger asks for her hand in marriage…and as the obedient niece, Rosabel cannot refuse.Will Rosabel find love after all? Or will the memory of Graham's late wife keep them both from finding happiness?This Beauty and the Beast story by a USA TODAY bestselling author proves that the past can never be forgotten, but its regrets can be forgiven.If you like marriage of convenience stories with a touch of mystery, a dash of humour as well as heartfelt emotion, then you’ll love this instalment of Bree Wolf’s emotionally charged Love’s Second Chance Series. Download FORGOTTEN AND REMEMBERED for FREE, grab a cup of tea, settle into your favorite reading spot and start this swoon worthy romance now!Love's Second Chance Series#1 Forgotten & Remembered - The Duke's Late Wife (Rosabel & Graham)#2 Cursed & Cherished - The Duke's Wilful Wife (Anna & Edmond)#3 Despised & Desired - The Marquess' Passionate Wife (Ellie & Frederick)#4 Abandoned & Protected - The Marquis' Tenacious Wife (Henrietta & Connor)#5 Ruined & Redeemed - The Earl's Fallen Wife (Charlotte & Sebastian)#6 Betrayed & Blessed - The Viscount's Shrewd Wife (Beth & Tristan)#7 Deceived & Honoured - The Baron’s Vexing Wife (Madeline & Derek)More to follow:#8 Sacrificed & Reclaimed - The Soldier's Daring Widow (Meagan & Edward) (Bonus Novella)A Forbidden Love Novella Series#1 The Wrong Brother#2 A Brilliant Rose#3 The Forgotten Wife#4 An Unwelcome Proposal#5 Rules to Be Broken#6 Hearts to Be MendedTo Follow:#7 Winning her Hand#8 Conquering her Heart",
  "genres": [
    "Romance",
    "Historical Romance",
    "Historical",
    "Historical Fiction",
    "Regency",
    "Fiction",
    "Regency Romance"
  ],
  "author": "Bree Wolf",
  "average_rating": "3.94",
  "url": "https://www.goodreads.com/book/show/33551245-forgotten-remembered"
}