{
  "title": "Ashes to Ashes: America's Hundred-Year Cigarette War, the Public Health, and the Unabashed Triumph of Philip Morris",
  "description": "Ashes to Ashes is a monumental history of the American tobacco industry’s ironic success in developing the cigarette, modern society’s most widespread instrument of self-destruction, into the nation’s most profitable consumer product. Starting with its energized, work-obsessed royal families, the Dukes and the Reynoldses, and their embattled successors like the eccentric autocrat George Washington Hill and the feisty Joseph F. Cullman, the book vividly portrays the cigarrettemakers generations of entrepreneurial geniuses. Their problematic achievement was based on cunning business strategies and marketing dazzle, deft political power plays, and a relentless, often devious attack on antismoking forces in science, public health, and government. Enabling the whole process to unfold was the weirdly symbiotic relationship of an industry geared at any cost to sell, sell, sell cigarettes, and an American public habituated to ignore all health warnings and buy, buy, buy.At the center of this epic is the continuing drama of the Philip Morris Company and the crafty men at its helm. The youngest, once smallest entry in the business, it remained an underdog until the marketing brainstorm that transformed the Marlboro brand from little more than a woman’s fashion accessory to the ultimate emblem of hairy-chested machismo (and made it America’s – and the world’s – #1 smoke). Remarkably, the company’s global prosperity mounted steadily even as the news about cigarettes and health grew more dire by the year.Caught up in the Philip Morris story is the whole sweep of America’s cigarette history, from the glory days of rampant hucksterism – when smokers would “walk a mile for a Camel,” Winston tasted “good like a cigarette should,” and most of the nation could decipher “L.S. / M.F.T” – to the bombshell 1964 Surgeon General’s Report that definitively indicted smoking as a killer, to the age of the massive mergers that spawned RJR Nabisco and Philip Morris-Kraft General Foods.Here we learn how the leaf that was the New World’s most passionately devoured gift to the Old grew into humankind’s most dangerous consumer product, employing a vast rural corps of laborers, fattening tax revenues, and propagating a ring of fiercely competitive corporate superpowers; how tobacco’s peerless public-relations spinners applied their techniques to becloud the overwhelming evidence of the cigarette’s lethal and addictive nature; and finally, how the besieged industry and the aroused public-health forces nationwide collided over whether to outlaw the butt habit altogether or bring it into ever more withering social disdain and under ever tighter government control.",
  "genres": [
    "Nonfiction",
    "History",
    "Science",
    "Business",
    "Politics",
    "Economics",
    "Medical"
  ],
  "author": "Richard Kluger",
  "average_rating": "3.92",
  "url": "https://www.goodreads.com/book/show/335451.Ashes_to_Ashes"
}