{
  "title": "Barbarians: How The Baby Boomers, Immigration, and Islam Screwed my Generation",
  "description": "The values that built the west have been forgotten. Instead, millennials have been raised to hold hedonism above all. Whatever feels good goes. Freedoms and rights are things for legislators and judges to conjure out of thin air, not precious traditions forged in the crucible of history. Most millennials reject the nuclear family, and the religious values, that our culture was built on because they resemble some sort of “unenlightened” old world of responsibility and duty that millennials want no part in. In short, squaring the truth about the West with the twisted values they’ve been brought up to swallow without complaint is not something that will be comfortable for many millennials. But I think that if not now, eventually most of them will take the plunge. Because deep down I think we know that what we’ve done is not empowering. Abandoning all guidance of our past and embracing hedonism and subjectivity was not some genius idea. Dismissing the guidance built for us over thousands and thousands of years in the form of gender roles, traditional lifestyles, hard work, objectivity, and cultural supremacy was, in fact, painfully stupid. Because really, what have we got to show for it? Nothing but infinite license to put who and what we want in our bodies, while our freedoms to speak, to think, to dream, and to build get more limited every day. We’ve decided to fall backwards off the shoulders of giants, and that fall probably feels good, until you realize there’s going to be a “splat” at the end. So with the ground of reality rushing up at them, more and more young people are clawing for anything to stop their feelings of personal, ethical, political, intellectual and artistic failure. And the rotted timber of progressivism is increasingly failing to break their fall. So eventually, they turn elsewhere. And so, a steadily increasing number of millennials are finally beginning to wake up to the choice we face as a civilization, and to the value they’ve so long overlooked in traditional standards of morality and beauty. They are is modern culture really so great if it means we substitute Meghan Trainor for Mozart, Emma Sulkowicz for Da Vinci, or Bell Hooks for Plato? Is it really such a step forward that our civilization, which once shed both blood and ink debating Martin Luther’s 95 Theses, is now reduced to considering theses like VICE Magazine’s “Dear Straight It’s Time to Start Putting Things In Your Butt?” Is this all there is, or can we do better? No, it isn’t, and yes, we can and must do better. Sure, it’ll be hard for us to dig ourselves out of the pit that the left-wing indoctrination and media machines has dug for everyone our age. But it’s work worth doing. Because right now, the world is on fire. And while my generation didn’t start the fire, with apologies to Billy Joel, I believe we have a chance to contain it, or even put it out. But first we have to expose the frauds, liars, idiots, and above all, barbarians who threw gas on it. So without further ado, let’s get to naming those names.",
  "genres": [
    "Politics",
    "Nonfiction",
    "History",
    "Cultural",
    "Islam",
    "Religion",
    "American History"
  ],
  "author": "Lauren Southern",
  "average_rating": "3.67",
  "url": "https://www.goodreads.com/book/show/33540805-barbarians"
}