{
  "title": "Sexy disaster",
  "description": "Quand les opposés s’attirent, mais que les cœurs se déchirent…  ***  Diane est rédactrice en chef du magazine Belle pour la vie, et pour boucler un article, elle doit partir à l’autre bout du monde. Les moustiques, la chaleur, les dangers de la jungle… c’est tout ce qu’elle déteste, elle la Parisienne un brin snobinarde ! Mais le pire est à venir, son guide, William Charleroi, mâle alpha et charmeur invétéré, s’avère être le moins gentleman des hommes. Elle le déteste tout autant qu’il l’attire car sous ses airs d’homme frustre et séducteur, se cache le plus sexy des amants. Succombera-t-elle ? Quitte à y perdre la raison ?  ***  Poussée par la rage et par la furieuse envie de lui refaire le portrait façon Picasso, je lui jette à la figure mon sac. Lequel retombe mollement à ses pieds. Mon irritation grandit lorsqu’il le ramasse et se met à l’ouvrir. Il en sort une culotte rouge en dentelle qu’il commence à chiffonner. Ma culotte préférée !  — Lâchez ça ! lui crié-je en m’avançant vers lui.  Il la repose, mais au lieu de refermer mon sac, il fouille dedans. Contrairement à mon habitude, je reste sans voix à le regarder plonger ses mains impudiques dans mes sous-vêtements. Il a l’air de follement s’amuser à passer en revue mes soutiens-gorge et mes strings. Un à un, il les extirpe du fond du sac, les pétrit, les caresse, les promène sur ses joues en sueur. Même la douleur dans ma jambe me paraît supportable en comparaison de l’humiliation que j’endure. S’il pouvait arrêter de jouer avec les ficelles. Ça me rend dingue !  Je devrais me ruer sur lui, le griffer au visage et lui arracher mes affaires des mains, mais des spasmes incontrôlables raidissent mes muscles. Et, plus son sourire gouailleur s’épanouit sur ses lèvres, plus je me sens honteuse de mouiller autant mes dessous.   Cadeau : à la fin de ce livre, découvrez gratuitement l’extrait d’une autre série !",
  "genres": [],
  "author": "Ena Fitzbel",
  "average_rating": "3.79",
  "url": "https://www.goodreads.com/book/show/33547553-sexy-disaster"
}