{
  "title": "Under Their Thumb: How a Nice Boy from Brooklyn Got Mixed Up with the Rolling Stones",
  "description": "Under Their Thumb  is an up-close and extremely personal dispatch from the amazing, exclusive world of the Rolling Stones, by someone who was lucky enough to live it–and sober enough to remember it all.  “The epic tale of an obsessive teenager who launched a Rolling Stones fanzine and spent the next two decades capturing the band’s whirlwind metamorphosis from behind the scenes. . . . First-rate, firsthand account of the world’s greatest rock ’n’ roll band, and a disenchanted chronicle of its increasingly crass commercialization.”—Kirkus ReviewsAs a teenager, Bill German knew exactly what he wanted to do with his chronicle the career and adventures of his favorite rock band, the Rolling Stones. And in 1978, on his sixteenth birthday, he set out to make his dream a reality. Feverishly typed in his Brooklyn bedroom, and surreptitiously printed in his high school’s mimeograph room German’s Stones-only newsletter, Beggars Banquet, was born. His teachers discouraged it, his parents dismissed it as a phase, and his disco-loving classmates preferred the Bee Gees, but, for German, this primitive, pre-Internet fanzine was a labor of love. And a fateful encounter with his idols on the streets of New York soon proved his efforts weren’t in vain.Impressed with Beggars Banquet, the Stones gave the ’zine instant cred on the rock scene by singing its praises–and by inviting German to hang with the band. At first a fish out of water in the company of rock royalty, German found himself spilling orange juice on a priceless rug in Mick Jagger’s house and getting pegged as a narc by pals of Keith Richards and Ron Wood. But before long he became a familiar fixture in the inner sanctum, not just reporting Stones stories but living them. He was a player in the Mick-versus-Keith feud and was an eyewitness to Keith’s midlife crisis and Ron’s overindulgences. He even had a reluctant role in covering up Mick’s peccadilloes. “In the span of a few months,” German recalls, “I’d gone from wanting to know everything about my favorite rock stars to knowing too much.”In this warts-and-all book, which includes many never-before-seen photographs, German takes us to the Stones’ homes, recording sessions, and concerts around the world. He charts the band’s rocky path from the unthinkable depths of a near breakup to the obscenely lucrative heights of their blockbuster tours. And ultimately, German reveals why his childhood dream come true became a passion he finally had to part with.",
  "genres": [
    "Music",
    "Nonfiction",
    "Biography",
    "Memoir",
    "Biography Memoir",
    "Rock N Roll"
  ],
  "author": "Bill German",
  "average_rating": "3.98",
  "url": "https://www.goodreads.com/book/show/3357187-under-their-thumb"
}