{
  "title": "The Kuos I: Cold Desolation",
  "description": "FOR THE FANS OF 'A SONG OF ICE AND FIRE, HARRY POTTER, and THE WITCHER.'\"Redefining the fantasy genre. That's what I will surely do.\" -A. H. AlwagdaniPlot summary:For fifteen years, Jenny Da' Gare was behind the doors of her cabin with her parents. One day, those doors broke open and Jenny was introduced to Soulaven, a world of monsters and lies. Emerald, her only friend and ally, promises to keep her safe. But both of them are too fragile for the trouble ahead, and change will be imminent. Together, they will stand and fight what comes up, and they will find the truth about everything.Full plot:Soulaven is a realm that was under the protection of Kuos; they are supernatural human beings with the powers beyond understanding. One time in their history, the world turned on them, and so they lost all power and reputation.After many years, they were all scattered around Soulaven; most of them were dead. The only ones left were two: Jenny Da’ Gare and Conax Kuo. Jenny is new to everything and doesn’t understand what is happening or what her family is about, and Conax has to help and train her to be a true Kuo. Only they can bring back the legacy. However, it is not as easy as it seemed. There was more to it than just simple training in seclusion. The two of them are prime targets for Soulaven’s most dangerous factions.Emerald, a wispy; she is a humanlike butterfly. This being was Jenny’s presented gift at her birthday, but she was more than that. She also has become Jenny’s best friend and companion. Moreover, she promised her that, even when she cannot yield any weapon, that she would keep her safe.Jenny and Emerald both have a story of their own as they struggle to stay together. However, in the end, they are held together by a promise so powerful that nothing could break it.To everyone, I met and knew.A tale to be told.A story to be known.A world to delve into.",
  "genres": [],
  "author": "A.H. Alwagdani",
  "average_rating": "3.67",
  "url": "https://www.goodreads.com/book/show/33569874-the-kuos-i"
}