{
  "title": "Maneuvers: The International Politics of Militarizing Women's Lives",
  "description": "Maneuvers takes readers on a global tour of the sprawling process called \"militarization.\" With her incisive verve and moxie, eminent feminist Cynthia Enloe shows that the people who become militarized are not just the obvious ones―executives and factory floor workers who make fighter planes, land mines, and intercontinental missiles. They are also the employees of food companies, toy companies, clothing companies, film studios, stock brokerages, and advertising agencies. Militarization is never gender-neutral, Enloe claims: It is a personal and political transformation that relies on ideas about femininity and masculinity. Films that equate action with war, condoms that are designed with a camouflage pattern, fashions that celebrate brass buttons and epaulettes, tomato soup that contains pasta shaped like Star Wars weapons―all of these contribute to militaristic values that mold our culture in both war and peace.Presenting new and groundbreaking material that builds on Enloe's acclaimed work in Does Khaki Become You? and Bananas, Beaches, and Bases, Maneuvers takes an international look at the politics of masculinity, nationalism, and globalization. Enloe ranges widely from Japan to Korea, Serbia, Kosovo, Rwanda, Britain, Israel, the United States, and many points in between. She covers a broad variety of subjects: gays in the military, the history of \"camp followers,\" the politics of women who have sexually serviced male soldiers, married life in the military, military nurses, and the recruitment of women into the military. One chapter titled \"When Soldiers Rape\" explores the many facets of the issue in countries such as Chile, the Philippines, Okinawa, Rwanda, and the United States.Enloe outlines the dilemmas feminists around the globe face in trying to craft theories and strategies that support militarized women, locally and internationally, without unwittingly being militarized themselves. She explores the complicated militarized experiences of women as prostitutes, as rape victims, as mothers, as wives, as nurses, and as feminist activists, and she uncovers the \"maneuvers\" that military officials and their civilian supporters have made in order to ensure that each of these groups of women feel special and separate.",
  "genres": [
    "Nonfiction",
    "Feminism",
    "Politics",
    "Gender Studies",
    "War",
    "Gender",
    "Academic"
  ],
  "author": "Cynthia Enloe",
  "average_rating": "3.99",
  "url": "https://www.goodreads.com/book/show/335675.Maneuvers"
}