{
  "title": "Music to His Ears",
  "description": "(Excerpt from The Omega Rescue: Book One Unlawfully Claimed) “W-what’s it l-l-like?” Spencer asked, his black eyes wide. “It’s great.” Thane smiled at the small Omega. “We need to find all of you your perfect match.” He grinned broadly at me. “I-I-I don’t think there’s an Alpha for me.” Spencer shook his head, a tenuous smile on his face. “I-I better keep l-l-looking for a job.”  Spencer’s story begins….  Max had begun trying to sell me off as breeding stock almost immediately after taking control and was willing to foist me off on anyone who even sniffed in my direction. To his ongoing irritation, as soon as I opened my mouth to speak, all interested parties had turned tail and run. One particularly unkind Alpha had paused in his flight long enough to compare conversing with me to a battery acid mange dip - and then gone on to tell Max that he would prefer the dip.  Unable to send me to the Omega auction – they wouldn't accept faulty merchandise – Max had found an alternative that in his mind solved all of our problems. It got me off the pack's teat and found me a home - of sorts. The fact that it meant me agreeing to go into service as a prostitute didn't seem to bother him at all. That was what had brought him to our shanty that evening. If I couldn't find a mate in the next week, I’d be shipped off to Howling Hank's Whore House. Classy name, huh?  Somehow Max must have gotten wind of our plan to thwart him because while Mom was at work the next day, he came to visit me. He wasn’t alone.   \"Spencer?” The stranger greeted me, holding his hand out. \"I'm Jack.”  I nodded and tried to make my split lip pull up into a smile, wondering if Max had found another Alpha for me to try to impress. I scented the air, but I didn't smell Alpha. In fact, I didn’t smell anything. I shook his hand and jerked back at a sharp pain in my wrist. I didn't even have time to question what had happened before the room began to spin. Then, everything went dark.",
  "genres": [
    "M M Romance",
    "Romance",
    "Paranormal",
    "Shapeshifters",
    "Omegaverse",
    "Fantasy",
    "Dragons"
  ],
  "author": "Kian Rhodes",
  "average_rating": "4.01",
  "url": "https://www.goodreads.com/book/show/33571947-music-to-his-ears"
}