{
  "title": "The Bridegroom",
  "description": "Reversals, transformations, and surprises abound in these assured stories. Parables for our times--with a hint of the reckless and the absurd that we have come to expect from Ha Jin--The Bridegroom offers tales both mischievous and wise.From the National Book Award-winning author of Waiting, a new collection of short fiction that confirms Ha Jin's reputation as a master storyteller.Each of The Bridegroom's twelve stories--three of which have been selected for inclusion in The Best American Short Stories--takes us back to Muji City in contemporary China, the setting of Waiting. It is a world both exotic and disarmingly familiar, one in which Chinese men and women meet with small epiphanies and muted triumphs, leavening their lives of quiet desperation through subtle insubordination and sometimes crafty resolve.In the title story, a seemingly model husband joins a secret men's literary club and finds himself arrested for the \"bourgeois crime\" of homosexuality. \"Alive\" centers on an official who loses his memory in an earthquake and lives happily for months as a simple worker; when he suddenly remembers who he is, he finds that his return to his old life proves inconvenient for everyone. In \"A Tiger-Fighter Is Hard to Find,\" a television crew's inept attempt to film a fight scene with a live Siberian tiger lands their lead actor in a mental hospital, convinced that he is the mythical tiger-fighter Wu Song.Reversals, transformations, and surprises abound in these assured stories, as Ha Jin seizes on the possibility that things might not be as they seem. Parables for our times--with a hint of the reckless and the absurd that we have come to expect from Ha Jin--The Bridegroom offers tales both mischievous and wise.",
  "genres": [
    "Short Stories",
    "Fiction",
    "China",
    "Asian Literature",
    "Literature",
    "Historical Fiction",
    "Asia"
  ],
  "author": "Ha Jin",
  "average_rating": "3.75",
  "url": "https://www.goodreads.com/book/show/33561.The_Bridegroom"
}