{
  "title": "The Telescope in the Ice: Inventing a New Astronomy at the South Pole",
  "description": "**One of Forbes' 10 Best Astronomy, Physics And Mathematics Books of 2017**\"Richly intimate, drawing on Mr. Bowen's long involvement with the IceCube project and its participants...Human emotions are palpable in the author's you-are-there framing.\" —The Wall Street JournalAlan Lightman: \"A masterpiece of storytelling, bringing to life in rich detail not only the world of science but also the men and women who inhabit that world.\"George Musser, author of Spooky Action at a Distance: \"If you want to know how science really works, this is your book.\"Sheldon Lee Glashow, 1979 Nobel Laureate in Physics: \"A page-turning chronicle of the decades-long struggle by hundreds of physicists and engineers to create a frontier laboratory for the pursuit of the new discipline of neutrino astronomy.\"The IceCube Observatory has been called the “weirdest” of the seven wonders of modern astronomy by Scientific American. In The Telescope in the Ice, Mark Bowen tells the amazing story of the people who built the instrument and the science involved.Located near the U. S. Amundsen-Scott Research Station at the geographic South Pole, IceCube is unlike most telescopes in that it is not designed to detect light. It employs a cubic kilometer of diamond-clear ice, more than a mile beneath the surface, to detect an elementary particle known as the neutrino. In 2010, it detected the first extraterrestrial high-energy neutrinos from outer space and thus gave birth to a new field of astronomy.IceCube is also the largest particle physics detector ever built. Its scientific goals span not only astrophysics and cosmology but also pure particle physics. And since the neutrino is one of the strangest and least understood of the known elementary particles, this is fertile ground. Neutrino physics is perhaps the most active field in particle physics today, and IceCube is at the forefront.The Telescope in the Ice is, ultimately, a book about people and the thrill of the chase: the struggle to understand the neutrino and the pioneers and inventors of neutrino astronomy. It is a success story.",
  "genres": [
    "Science",
    "Nonfiction",
    "Physics",
    "Astronomy",
    "History"
  ],
  "author": "Mark Bowen",
  "average_rating": "4.13",
  "url": "https://www.goodreads.com/book/show/33573932-the-telescope-in-the-ice"
}