{
  "title": "Real Marriage: The Truth About Sex, Friendship, & Life Together",
  "description": "Most marriage books assume the author did it right. Most marriage books barely mention friendship. Most marriage books use \"intimacy\" as code for \"sex.\" This is not one of those books. In Real Marriage, Pastor Mark Driscoll and his wife, Grace, share how they have struggled and how they have found healing through the power of the only reliable the Bible. They believe friendship is fundamental to marriage but not easy to maintain. So they offer practical advice on how to make your spouse your best friend - and keep it that way. And they know from experience that sex-related issues need to be addressed directly. Five chapters are dedicated to answering questions Stunningly honest and vulnerable, Real Marriage is like a personal counseling session with a couple you cannot surprise, you cannot shock into silence, who will respond to every question with wisdom, humility, and realism. If you want to have a long-lasting, fulfilling marriage you should read this book. Wrestle with this book. Pray over this book. Share this book. And discover how God this book. Share this book. And discover how God can use it to change your life. Endorsements : \"If you're married or plan to be someday, do yourself a favor and read every page of this book.\" -DRS. LES & LESLIE PARROTT Founders of RealRelationships.com and authors of Love Talk \"Whether engaged, newlywed, or veteran, Real Marriage will serve as an invaluable resource. I highly recommend this book.\" -ANDY STANLEY author of The Grace of God and Senior Pastor, North Point Community Church \"One of my greatest concerns is that culture is going to continually define and redefine what marriage is and is not, and the church is going to simply sit on the sidelines and react rather than seeking to actually become proactive by confidently teaching what the Bible has to say about it. That is why I am so thankful that Mark and Grace Driscoll wrote this book. Their approach to marriage, its benefits and challenges are transparent and challenging and I honestly believe that every married couple who will work through what they lead us through in this book will not just merely have a marriage that survives in this world but rather thrives in it.\"- PERRY NOBLESenior Pastor, NewSpring Church \"Our thanks to Mark and Grace Driscoll who have served this generation well by tastefully but boldly addressing the real issues facing real marriages. Taking the unchanging truth of God's word and sprinkling in is the story of God's mercy in their own marriage they have filled every chapter with real helpfulness. This book is powerful, biblical, practical and healing for marriages that hurt. My wife and our adult children read it to great profit.\"-DR. JAMES MACDONALD Senior Pastor, Harvest Bible Chapel and Bible teacher for Walk in the Word",
  "genres": [
    "Marriage",
    "Christian",
    "Nonfiction",
    "Relationships",
    "Theology",
    "Christianity",
    "Self Help"
  ],
  "author": "Mark Driscoll",
  "average_rating": "3.68",
  "url": "https://www.goodreads.com/book/show/12035256-real-marriage"
}