{
  "title": "The Practicing Mind: Bringing Discipline and Focus into Your Life",
  "description": "Present moment awareness is an essential ingredient in life if one expects to experience any degree of authentic peace and contentment. It has been acknowledged for centuries as the cornerstone of spiritual awakening in all traditions of Eastern thought. In the West, however, it is still a relatively unrecognized concept of living. The Western mind is always restless, never content with the moment. Its internal dialogue is always firing off thoughts filled with emotional content and pulling the individual out of the present and into the past or future. But individuals raised in Western culture are becoming increasingly more aware of their overall sense of mental exhaustion, their lack of discipline and their inability to focus on demand. They are willing to expend the energy necessary to experience inner peace and a quiet mind that is waiting to follow the direction of their will. They are realizing that the endless struggle to fulfill the insatiable appetite of instant gratification is fruitless and tiresome at best. They are ripe for a new path in life and eager for a new set of instructions. This is the purpose of The Practicing Mind. It comprehensively deals with helping the individual understand exactly what present moment awareness is, how we are raised in a manner contradictory to this, and how we change our mindset to make this a part of our daily living. This book is accessible to readers of all philosophical backgrounds. Regardless of your perspective, you will find the book's insights most compelling.You can find the wisdom of both The Practicing Mind and The Meditating Mind in the combination The Total Mindset.For your convenience, THE PRACTICING MIND is now in mp3 CD audiobook format.",
  "genres": [
    "Self Help",
    "Nonfiction",
    "Psychology",
    "Productivity",
    "Personal Development",
    "Audiobook",
    "Philosophy"
  ],
  "author": "Thomas M. Sterner",
  "average_rating": "3.96",
  "url": "https://www.goodreads.com/book/show/335864.The_Practicing_Mind"
}