{
  "title": "The Engine 2 Diet: The Texas Firefighter's 28-Day Save-Your-Life Plan that Lowers Cholesterol and Burns Away the Pounds",
  "description": "Lose weight, lower cholesterol, significantly reduce the risk of disease, and become physically fit--in just 4 weeks.Professional athlete-turned-firefighter Rip Esselstyn is used to responding to emergencies. So, when he learned that some of his fellow Engine 2 firefighters in Austin, TX, were in dire physical condition-several had dangerously high cholesterol levels (the highest was 344!)-he sprang into action and created a life-saving plan for the firehouse. By following Rip's program, everyone lost weight (some more than 20 lbs.), lowered their cholesterol (Mr. 344's dropped to 196), and improved their overall health. Now, Rip outlines his proven plan in this book. With Rip as your expert coach and motivator, you'll transform your body and lifestyle in a month. His plant-powered eating plan is based on a diet of whole foods, including whole grains, fresh fruits, vegetables, legumes, nuts, and seeds. This invaluable guide **Dozens of easy, mouthwatering recipes-from pancakes to pizza, Tex-Mex favorites to knockout chocolate desserts-that will keep you looking forward to every bite **Pantry-stocking tips will take the panic out of inevitable cravings and on-the-fly meals **Guidelines on menu choices that will allow you to eat out, wherever and whenever you want **Rip's simple, firefighter-inspired exercise program that will boost your metabolism and melt your fat away.Medically approved, easy-to-follow, and amazingly effective , this diet is designed for anyone who wants to make heroic strides in his or her health, weight, and well-being-all without heroic effort.\"I've known Rip for more than 20 years. In that time, he's been a great motivator for so many people. This terrific book will inspire all who read it to change their lives and optimize their health.\" - Lance Armstrong, cancer survivor, seven-time Tour de France champion\"Want to be as strong as a Texas firefighter? Or as healthy as a professional triathlete? Then follow the wonderful advice of Rip Esselstyn, who is both. His book can save your life--whether you're a man or a woman. Highly recommended!\" -Dean Ornish, M.D., Founder and President, Preventive Medicine Research Institute, Clinical Professor of Medicine, U of California SF, author, Dr. Dean Ornish's Program for Reversing Heart Disease",
  "genres": [
    "Health",
    "Nonfiction",
    "Cookbooks",
    "Food",
    "Vegan",
    "Nutrition",
    "Cooking"
  ],
  "author": "Rip Esselstyn",
  "average_rating": "4.05",
  "url": "https://www.goodreads.com/book/show/3359298-the-engine-2-diet"
}