{
  "title": "How to Make a Living with your Writing: Books, Blogging and more",
  "description": "Would you like to make a living with your writing?This book will show you how.I spent 13 years working as a cubicle slave in the corporate world. I was miserable in my job and my creativity was stunted by the crushing daily grind.Then I started writing books and blogging, using my words to create products and attract readers. In September 2011, I left my corporate job to become a full-time author and creative entrepreneur and since then I've grown my business year on year \"\" all based on my writing. More importantly, I'm finally living the happy life I always wanted.I'm not a Kindle or blogging millionaire and this is not a get rich quick scheme. But I will share with you how I make a six-figure income from writing books, blogging and marketing in an ethical manner.We're living in the best time ever to make a living with your writing! Read on to learn more.The book includes:Overview of how I make a living and income splitFirst principlesTips on writing and productivityTips on mindsetPart 1: How to make money from booksIt's not just one bookYour publishing options: Traditional publishingChanges in the publishing industryYour publishing options: Becoming an indie authorHow to self-publish an ebookHow to self-publish a print bookHow to self-publish an audiobookPart 2: How to make money online in other waysA business powered by content marketingProduct salesAffiliate incomeConsulting or coachingProfessional speakingAdvertising and sponsorshipFreelance writingTips for content marketingThe transition and your next stepsPlus/ Companion Workbook so you can answer the questions in the book for yourself.If you'd like to make a living with your writing, this book will help you take the next steps.",
  "genres": [
    "Writing",
    "Nonfiction",
    "Business",
    "Self Help",
    "Reference",
    "How To",
    "Audiobook"
  ],
  "author": "Joanna Penn",
  "average_rating": "4.14",
  "url": "https://www.goodreads.com/book/show/33591437-how-to-make-a-living-with-your-writing"
}