{
  "title": "Your Patient Safety Survival Guide: How to Protect Yourself and Others from Medical Errors",
  "description": "It takes a village to combat preventable errors and omissions that cause millions of deaths and sickness in our nation s hospitals and care facilities. That is the message that sets Patient Safety and Survival Guide apart from other books. Each year, one out of every four hospital patients in the United States will be harmed by the care they receive. Over 400,000 will die as a result. Although most of these deaths are due to human and system errors not faulty medical decisions or diagnoses this annual death toll as well as the millions of additional incidents of survivable patient harm could be cut in half through consistent use of simple and nearly cost-free safety behaviors. In Patient Safety Survival Guide, Gretchen LeFever Watson delivers a patient-centered blueprint on how to transform the patient-safety movement so that millions of unnecessary illnesses and deaths in hospitals, outpatient facilities, and nursing homes can be avoided. She provides key safety habits that people must learn to recognize so they can be sure hospital personnel use them during every patient encounter. She also explains how addressing the most common safety problems will set the stage for tackling a wide range of issues, including healthcare s role in the overuse of opiate painkillers and its related heroin epidemic. Watson s call for a more sensible societal response to medical and human error in hospitals, promotes a timely and full disclosure of all mistakes an approach that has been proven to accelerate the emotional recovery of everyone affected by patient safety events while also reducing the financial burden on hospitals, providers, and patients. Readers will learn how to: Raise awareness and inspire civic action in their communities. Change behavior to catch medical errors before they result in illness or death. Prevent the spread of dangerous infections in hospitals and other care facilities. Leverage the power of basic safety/hygiene habits. Eliminate mistakes during surgery and other invasive procedures. Avoid medication errors and the overuse of opiates\"",
  "genres": [
    "Medicine",
    "Health",
    "Nonfiction"
  ],
  "author": "Gretchen Lefever Watson",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/33585723-your-patient-safety-survival-guide"
}