{
  "title": "Cosmic Dancer",
  "description": "It’s 1969 but 15-year-old Amelia Longwood’s visions aren’t drug-induced, they’re memories: of a crystal butterfly the size of a jetliner, of her own death hundreds of years earlier, of learning to dance in a place where gravity didn’t matter. In waking life, she’s struggling with ballet, boyfriends, and an alcoholic mother. In her dreams, she’s back in the place she came from—or rather, all the places she’s come from, life after life, and especially, all the people she has known. Again and again. Will the memories help her this time? Will she find the special someone her heart remembers? Will she overcome the force that’s trying to stop her from dancing? The blue and golden Lights she sees—can they help? 2011 Finalist: National Indie Excellence Award for Visionary Fiction2011 Finalist: Eric Hoffer/da Vinci Eye Award** “It is a wonderful book.” - Donna Eden, author of Energy Medicine, founder of Eden Energy Medicine** “Have you ever met people for the first time who felt very familiar? Or you felt so comfortable with them it was as if you had known them forever? There may a good reason for your feelings. Lianne has created a beautiful story, woven with elegance and warmth, with such amazingly colorful images that you are drawn into the experience completely. Tales of reincarnation, life in between lives, and relationships needing redemption all make this a captivating read. But is this really a work of fiction or has Lianne brought something more memorable to the world? - Pamala Oslie, Author of Life Colors and Love Colors** “This is a beautifully written book that contains some of the most vivid imagery I've had the pleasure of experiencing in a long, long time. But it is so much more than that. ... Lianne Downey shows us that there is more to human nature than meets the eye, in this lifetime anyway. This incredible book takes you on a journey that will change the way you view the difficult relationships in your life, forever.\" - Michelle Doetsch, New Yew Reiki and Massage TherapyTen percent of Cosmic Dancer sales support Mary Murphy’s Chance to Dance, Inc., a nonprofit charity that brings ballroom dancing into school classrooms.",
  "genres": [],
  "author": "Lianne Downey",
  "average_rating": "4.33",
  "url": "https://www.goodreads.com/book/show/12036354-cosmic-dancer"
}