{
  "title": "Autism's False Prophets: Bad Science, Risky Medicine, and the Search for a Cure",
  "description": "A London researcher was the first to assert that the combination measles-mumps-rubella vaccine known as MMR caused autism in children. Following this \"discovery,\" a handful of parents declared that a mercury-containing preservative in several vaccines was responsible for the disease. If mercury caused autism, they reasoned, eliminating it from a child's system should treat the disorder. Consequently, a number of untested alternative therapies arose, and, most tragically, in one such treatment, a doctor injected a five-year-old autistic boy with a chemical in an effort to cleanse him of mercury, which stopped his heart instead.Children with autism have been placed on stringent diets, subjected to high-temperature saunas, bathed in magnetic clay, asked to swallow digestive enzymes and activated charcoal, and injected with various combinations of vitamins, minerals, and acids. Instead of helping, these therapies can hurt those who are most vulnerable, and particularly in the case of autism, they undermine childhood vaccination programs that have saved millions of lives. An overwhelming body of scientific evidence clearly shows that childhood vaccines are safe and does not cause autism. Yet widespread fear of vaccines on the part of parents persists.In this book, Paul A. Offit, a national expert on vaccines, challenges the modern-day false prophets who have so egregiously misled the public and exposes the opportunism of the lawyers, journalists, celebrities, and politicians who support them. Offit recounts the history of autism research and the exploitation of this tragic condition by advocates and zealots. He considers the manipulation of science in the popular media and the courtroom, and he explores why society is susceptible to the bad science and risky therapies put forward by many antivaccination activists.",
  "genres": [
    "Nonfiction",
    "Science",
    "Autistic Spectrum Disorder",
    "Medicine",
    "Psychology",
    "Medical",
    "Health"
  ],
  "author": "Paul A. Offit",
  "average_rating": "4.18",
  "url": "https://www.goodreads.com/book/show/3360358-autism-s-false-prophets"
}