{
  "title": "Why Is God Laughing?: The Path to Joy and Spiritual Optimism",
  "description": "In this refreshing new take on spirituality, bestselling author Deepak Chopra uses a fictional tale of a comedian and his unlikely mentor to show us a path back to hope, joy, and even enlightenment—with a lot of laughter along the way.Meet Mickey Fellows. A successful L.A. comedian, he’s just a regular guy, with his fair share of fears, egocentricities, and addictions. After his father’s death, Mickey meets a mysterious stranger named Francisco, who changes his life forever. The two begin an ongoing discussion about the true nature of being. Reluctantly at first, Mickey accepts the stranger’s help and starts to explore his own life in an effort to answer the riddles Francisco poses. Mickey starts to look at those aspects of himself that he has hidden behind a wall of wisecracks all his life. Eventually Mickey realizes that authentic humor opens him up to the power of spirit—allowing him to finally make real connections with people.After taking the reader on a journey with Mickey, Chopra then spells out the lessons that Mickey’s story imparts to ten reasons to be optimistic, even in our challenging world. Chopra believes that the healthiest response to life is laughter from the heart, and even in the face of global turmoil, we can cultivate an internal sense of optimism. Rich with humor and practical advice, Why Is God Laughing? shows us without a doubt that there is always a reason to be grateful, that every possibility holds the promise of abundance, and that obstacles are simply opportunities in disguise. In the end, we really don’t need a reason to be happy. The power of happiness lies within each of us, just waiting to be unleashed. And Mickey Fellows’s journey shows us the way.",
  "genres": [
    "Spirituality",
    "Nonfiction",
    "Self Help",
    "Philosophy",
    "Religion",
    "Psychology",
    "Audiobook"
  ],
  "author": "Deepak Chopra",
  "average_rating": "3.54",
  "url": "https://www.goodreads.com/book/show/3360950-why-is-god-laughing"
}