{
  "title": "Big Agenda: President Trump's Plan to Save America",
  "description": "NEW YORK TIMES BESTSELLERDonald Trump’s victory in the 2016 election was more than a historic upset. It was the beginning of a major political, economic, and social revolution that will change America - and the world.One of the nation’s foremost conservative commentators, New York Times bestselling author, and a mentor to many of Donald Trump’s key advisers, David Horowitz presents a White House battle plan to halt the Democrats’ march to extinguish the values America holds dear.Big Agenda details President Trump’s likely moves, including • First wave of executive orders - restoring Guantanamo, Keystone XL, nixing amnesty• Surprising judicial appointments - Supreme Court and the federal judiciary• Radical changes to federal rules & regulations - Obamacare, EPA overreach, and a New Deal for black AmericaWith the White House and Senate in GOP hands, and a Supreme Court soon to follow, President Trump will have a greater opportunity than even Ronald Reagan had to reshape the American political landscape while securing the nation’s vital security interests abroad.“No president since FDR and his famed ‘100 Days’ has the chance Donald Trump has,” Horowitz argues.But he writes that the GOP and Trump must recognize they are not fighting policy ideas, but an ideology - a progressive one with a radical agenda to stop Trump in an effort to reduce America’s power and greatness.Big Agenda is a rallying cry and indispensable guide for how to claim ultimate victory for the conservative cause.Horowitz writes, “One battle is over, but there are many more to come. This book is a guide to fighting the opponents of the conservative restoration. It identifies who the adversaries are - their methods and their motivations.It describes their agenda - not merely the particular issues with which they advance their goal, but the destructive goal itself. And it lays out a strategy that can defeat them.”",
  "genres": [
    "Politics",
    "Nonfiction",
    "American History",
    "Political Science"
  ],
  "author": "David Horowitz",
  "average_rating": "4.12",
  "url": "https://www.goodreads.com/book/show/33613793-big-agenda"
}