{
  "title": "The Scattered Leaves of My Life: An Indian Nationalist Remembers",
  "description": "English 245About The AuthorSaraladebi Chaudhurani, born into the famous Tagore family of Jorasanko, was a nationalist, a patron of the arts, a writer and an editor. Her essays and articles in Ramanada Chatterjees Modern Review, as well as in Bharati and Suprabhat, highlight her insights into nation-building as well as gender relations, but it is her extraordinary autobiography-presented here in translation-that most clearly presents her personal and political convictions.Audacious, brilliant and outspoken for her time, Saraladebis work adds nuance and cultural heft to a particular Indian variation of what has been called muscular nationalism within a colonial milieu. Women womanhood and feminism occupy a contested position within Saraladebis notion of such a nationalism, yet there is little doubt that she is among Indias feminist foremothers.Sikata Banerjees Introduction fleshes out biographical details, ad situates Saraladebis ideology within current debates around gender, nation and feminisms and also reflects on the legacy of her ideas in contemporary India.Sikata Banerjee is Associate Dean. Humanities, and professor, Womens Studies at the University of Victoria. British Columbia. Her publications include Make Me a masculinity, Hinduism and Nationalism in India; and Warriors in Hindu Nationalism, violence and the Shiv Sena in India.PrefaceDuring the course of my research on gender and nation in India, I came across the thoughts of a remarkable nineteenth- century nationalist Saraladebi Chaudhurani (1872- 1945). Saraladebi's mother, Swarnakumaridebi (1855-1932), a politically active writer in her own right, had an enviable intellectual pedigree. The sister of the internationally known poet Rabindranath Tagore (1861-19",
  "genres": [],
  "author": "Saraladebi Chaudhurani and Sikata Banerjee",
  "average_rating": "3.75",
  "url": "https://www.goodreads.com/book/show/33597034-the-scattered-leaves-of-my-life"
}