{
  "title": "Moriarty",
  "description": "John Gardner's Moriarty is a posthumous novel, and that is a shame -- for several reasons. One, because it is the last book we will see from one of the most protean of crime thriller writers, a man who made a mark in a variety of different genres and whose prolific output never suffered a slackening of quality (as was the case with so many of his contemporaries and predecessors, such as Robert Ludlum and Alistair MacLean). Secondly, because this book is an adroit historical crime novel, an innovative entry in the field which is (these days) becoming a touch overcrowded. And finally (and most importantly), because Moriarty is one of the most intelligent and striking extensions of the character created by Sir Arthur Conan Doyle as the arch nemesis of The Great Detective, Sherlock Holmes.Gardener had been such a capable practitioner in so many fields that it was no surprise when he proved so able at reinventing Doyle's master criminal. John Gardner had created the clever Boysie Oakes novels (ingenious parodies of Ian Fleming's Bond adventures) before very successfully taking up the Fleming legacy directly, and creating several new adventures for 007. Gardener's more serious thrillers (in the John le Carré/Len Deighton mould) featuring the agent Herbie Kruger were polished entries in the espionage field, and a series of novels featuring Moriarty demonstrated his mastery of a variety of genres. This last novel may be published after the author's death, but it's a fitting end to the series. Moriarty has been forced to flee England and live in America during the 1890s, but he returns to London in 1900 to find that his huge criminal empire has been rifled by the new crime boss idle Jack Idell. A grim and bloody battle ensues, delivered with all the panache that John Gardener demonstrated throughout this beguiling series. --Barry Forshaw",
  "genres": [
    "Mystery",
    "Fiction",
    "Historical Fiction",
    "Crime",
    "Classics",
    "Adventure",
    "British Literature"
  ],
  "author": "John  Gardner",
  "average_rating": "3.44",
  "url": "https://www.goodreads.com/book/show/3359968-moriarty"
}