{
  "title": "The Neapolitan Novels",
  "description": "Neapolitan Novels Series Elena Ferrante Collection 4 Books Bundle includes titles in this collection :- My Brilliant Friend, The Story of a New Name, Those Who Leave and Those Who Stay, Story of the Lost Child. Description:- My Brilliant Friend A modern masterpiece from one of Italy's most acclaimed authors, My Brilliant Friend is a rich, intense and generous hearted story about two friends, Elena and Lila. Ferrante's inimitable style lends itself perfectly to a meticulous portrait of these two women that is also the story of a nation and a touching meditation on the nature of friendship. The Story of a New Name The second book in Ferrante's lauded Neapolitan novels. Elena and Lila are now in their twenties. While marriage appears to have imprisoned Lila, Elena continues her journey of self-discovery. The two young women share a complex and evolving bond that brings them close at times, and drives them apart at others. Those Who Leave and Those Who Stay In this third Neapolitan novel, Elena and Lila have become women. Both have attempted pushing against the walls of a prison that would have seen them living a life of misery, ignorance and submission. They are afloat on the great sea of opportunities that opened up during the1970s. Yet they are still very much bound to each other by a strong, unbreakable bond. From the bestselling author of My Brilliant Friend, Elena Ferrante. Story of the Lost Child, The The fourth and final book of the internationally renowned and bestselling Neapolitan novels One of the major publishing events of 2015, this dazzling saga of two women - the brilliant Elena and the fiery, uncontainable Lila - firmly establishes the Neapolitan Quartet as perhaps the most significant work to date of the 21st century. Life's great discoveries have been made, its vagaries and losses suffered.",
  "genres": [
    "Fiction",
    "Historical Fiction",
    "Italy",
    "Italian Literature",
    "Novels",
    "Contemporary",
    "Literary Fiction"
  ],
  "author": "Elena Ferrante",
  "average_rating": "4.57",
  "url": "https://www.goodreads.com/book/show/33605716-the-neapolitan-novels"
}