{
  "title": "The Mother on the Other Side of the World: Poems",
  "description": "In his fifth book of poems, The Mother on the Other Side of the World , James Baker Hall revisits his dark childhood with a spiritual maturity earned of lifelong struggle with the forces of silence, secrecy, deception, and hiding. Without the usual linear guideposts and cathartic emotional epiphanies we've come to expect from contemporary poetry, he reveals the dangerous and strange aspects of family intimacies that are both universal and taboo. With talismanic images from the natural world, he refigures the mother's body as a timeless landscape, through which these visceral and worldly poems move. And move they surely do, with a distinctive panache, with great kinesthetic intensity and subtlety. A pilgrimage is implicit in the stops they make and in the sacraments they achieve. An experienced conjurer dealing with his deepest urgencies, Hall realizes a poetic technique in these poems that refracts embodied experience to reveal the energies-secular, spiritual, animal, and human-that come and go in forms. What these poems know-without explanation-is a grace beyond both intuition and belief. The Mother on the Other Side of the World is James Baker Hall's fifth book of poems. The New Yorker, The Paris Review, The American Poetry Review , and The Kenyon Review are among the many magazines to have published his work. He has received an NEA fellowship in poetry writing and has won both Pushcart and O. Henry prizes. He lives with his wife, fiction writer Mary Ann Taylor-Hall, in the Kentucky countryside and teaches at the University of Kentucky. \"James Baker Hall has consistently pursued in his poetry a trajectory that is deeply authentic. It has produced writing of daring and delicacy, over a period long enough to make it plain that this is not a momentary brilliance but a sustained vision. He has been dedicated to making the language reflect the surprise, the turns and leaps of memory and recurrent apparition in which pain and beauty are often indistinguishable. This new collection displays an intimate authority and mystery of tone that are the fulfillment of a genuine gift and uncompromising devotion to it.\"-W.S. Merwin \"A delightful collection of poems depicting Hall's life long st",
  "genres": [
    "Poetry"
  ],
  "author": "James Baker Hall",
  "average_rating": "3.76",
  "url": "https://www.goodreads.com/book/show/1203794.The_Mother_on_the_Other_Side_of_the_World"
}