{
  "title": "The Enhanced",
  "description": "We created them. And now they rule us...  The world has changed. Wars and terrible weapons have decimated the global population. Originally designed for war, genetically modified super-beings have risen to the top, living in relative safety in the city of Haven.  Divided into two parts, the city is home to the genetically superior Enhanced, and the inferior Unenhanced: normal humans now subjugated and controlled. It’s a brutal world of divides. An unyielding system of class. The strong rise and the weak fall. That is the new world.  Brie Melrose is just a normal girl of 18. She grew up an orphan, and her life was never deemed likely to amount to anything.  One day, however, a routine job turns into something much more, and Brie finds herself under the watchful eye of the Savants, the highest order of the Enhanced. Blessed with supreme intellect, they consider emotions to be pointless.  And, in some cases, dangerous…  For Brie, coming face to face with a Savant is a rare thing indeed. And soon, something even rarer is about to occur: she is to be invited into Inner Haven, the sanctuary of the Enhanced where she’ll come into contact with some strange and dangerous people.  People who want things from her. People who know things about her past.  Soon, threats she never even knew existed will close in, and Brie will learn that her world, and the city of Haven, isn’t quite what she thought it was.  And neither is she…   The Enhanced is the first in a planned series. It ends in a fairly significant cliffhanger, so be warned! However, new instalments will be released every few weeks, so you’ll never have to wait long to find out what happens next!  Fans of the Hunger Games, Divergent, and the Maze Runner will love this new dystopian world, a place of brutality, danger, and secrets where the strong rule the weak and there’s conflict around every turn. A mixture of YA dystopian, sci fi thriller, mystery, and romance, every page will leave you wanting more!  Note: The book is written in British English.  Book Two - Hybrid - is available now!",
  "genres": [
    "Dystopia",
    "Science Fiction",
    "Young Adult",
    "Fantasy",
    "Fiction",
    "Futuristic",
    "Audiobook"
  ],
  "author": "T.C. Edge",
  "average_rating": "4.07",
  "url": "https://www.goodreads.com/book/show/33632910-the-enhanced"
}