{
  "title": "Get Rich or Get Lucky",
  "description": "Get Rich or Get Lucky is a hilarious Urban Fantasy thriller that follows Adam who finds himself in control of a magic he never knew existed.After a string of disappointments with his literary career, Adam is not doing well in life, particularly where women are concerned. His last girlfriend left him for somebody taller, and he was sacked from his job at an English Language School for flirting with the boss's wife after a few drinks at the Christmas party.Adam wants to stand out in a crowd and not be the most unspectacular person in it. To improve his lot Adam decides to ditch his ambition of becoming a writer and embark on a get-rich-quick scheme, by renovating run-down houses. When by chance he discovers a book of magic in the basement of a derelict property, he can’t believe his luck. Excited by his find, he invites his friends Dick and Charlie, to tell them about it. But things quickly take a turn for the worse when Adam inadvertently casts a spell which turns Dick into a crayfish. Adam is unable to reverse the spell immediately and while searching for the solution, leaves Dick in the garden pond, which gets flooded and Dick disappears. Dick's wife Rachael reports him missing and the police then suspect Adam of being responsible for Dick's demise. Things continue to spiral out of control when the book is stolen and he discovers that a powerful, evil warlock is looking for the book. Adam finds himself in a race against time, to recover the book and thwart the warlock to stand any chance of bringing Dick back, if he can. Get Rich or Get Lucky is a dark-humoured fantasy thriller, and may not appeal to the very sensitive reader with a strong conventional bias. It will however be a favourite for open-minded readers who enjoy adult, fun fantasy fiction and also a fast-paced adventure thriller.",
  "genres": [
    "Fantasy",
    "Fiction",
    "Contemporary",
    "Paranormal",
    "Urban Fantasy",
    "Novels",
    "Magic"
  ],
  "author": "Max Nowaz",
  "average_rating": "4.25",
  "url": "https://www.goodreads.com/book/show/33623824-get-rich-or-get-lucky"
}