{
  "title": "I pirati della Malesia",
  "description": "Emilio Salgari was an Italian writer of action adventure swashbucklers and a pioneer of science fiction. For over a century his novels were mandatory reading for generations of youth eager for exotic adventures. He remains among the most translated Italian authors. Many of his most popular novels have been adapted as comics, animated series and feature films.The story can be considered a sequel to \"I misteri della jungla nera\" (The Mystery of the Black Jungle). We discover that Suyodhana has massacred Ada's father, and that Tremal-Naik was taken prisoner by the British. Kammamuri, however, escapes from the ship in which was caught, and landed to Mompracem, begging Sandokan and Yanez to free his master.The events narrated in this novel are part of the \"Saga of the pirates of Malaysia\" also composed by \"I misteri della jungla nera\" (The Mystery of the Black Jungle), \"Le Tigri di Mompracem\" (The Tigers of Mompracem), \"Le due Tigri\" (Two Tigers), \"Il re del mare\" (The Sea King) and other novels written by Salgari.In the book, a biography of the author and the list of his novels.Emilio Salgari è stato uno degli scrittori italiani di romanzi d'avventura fra i più popolari. Autore straordinariamente prolifico, è ricordato soprattutto per il ciclo dei pirati della Malesia. Scrisse anche diverse storie fantastiche ed è considerato uno dei precursori della fantascienza in Italia. Molte sue opere hanno avuto trasposizioni cinematografiche e televisive.La storia può essere considerata una sorta di seguito de \"I misteri della jungla nera\". Scopriamo che Suyodhana ha massacrato il padre di Ada, e che Tremal-Naik è stato fatto prigioniero dagli inglesi. Kammamuri, però, riesce a fuggire dalla nave in cui era prigioniero, e approda a Mompracem, supplicando Sandokan e Yanez di liberare il padrone.Le vicende narrate in questo romanzo fanno parte del \"Ciclo dei pirati della Malesia\" composto anche da \"I misteri della jungla nera\", \"Le Tigri di Mompracem\", \"Le due Tigri\", \"Il re del mare\" ed altri romanzi scritti da Salgari.Nel libro la biografia dell'autore e l'elenco dei suoi romanzi.",
  "genres": [
    "Adventure",
    "Fiction",
    "Classics",
    "Italian Literature",
    "Pirates",
    "Historical Fiction",
    "Novels"
  ],
  "author": "Emilio Salgari",
  "average_rating": "3.88",
  "url": "https://www.goodreads.com/book/show/33617753-i-pirati-della-malesia"
}