{
  "title": "Kage Trilogy: Box Set",
  "description": "This is a box set of the bestselling Kage Trilogy, featured in USA TODAY as a MUST-READ SERIES & MUST LISTEN AUDIOBOOK. Nominated for multiple awards including ALL-TIME FAVORITE M/M SERIES in the 2016 Goodreads Choice Awards. Read below for the descriptions of all 3 books.  *** KAGE (Book 1)  My name is Jamie Atwood, and I’m an addict. I never thought I’d say such a thing. Never had a problem being overly-attached to anything in my life. I came from a perfectly middle-class family, made good grades, and had a hot cheerleader girlfriend... but the truth is, nothing ever really moved me. So how did a guy like me become an addict?  I met Michael Kage.  Kage is an MMA fighter. A famous one. I like to think I helped him get that way.  He’s charming as hell, with looks to rival any movie star and talent to back it up. So why did he need to hire me as an intern Publicist? Simple. He has a darkness in him– like a black hole so deep it could swallow him, and me, and everyone we know– and that’s not good for business.  The first time I met him, I felt the pull. I think the addiction began at that very moment. And even if I’d known then what I know now, I would have fallen for him. How could I not?  For me, Kage is everything.  *** KAGE UNLEASHED (Book 2)  In a battle of the heart, who will be the first to submit?  My name is Jamie Atwood, and I am an idiot. Against all odds, I got the attention of Michael Kage, the hottest MMA fighter on the planet. To say he rocked my world would be an understatement. He transformed me completely, made me depend on him, and made me love him. And the sex? Let me put it this way: I'd never been with a guy before I met Kage, but I'd gladly spend the rest of my life on my knees for him. He is my obsession and my addiction. But I did something stupid, and now I'm paying for it. I don't know if I'll ever see Kage again.  Being Michael Kage was never easy. Too many demons, too much anger, and not enough to live for. And then I met Jamie Atwood. He's got this innocence about him that speaks to something deep down inside me- in a place that's never been touched by anyone. He's beautiful, smart, and courageous, and he hasn't been tainted by the darkness that's ruled my life. I wanted him from the first second I laid eyes on him. It's selfish, I know. Because you can't bring an innocent thing into the darkness and not expect something to rub off.  *** KAGE UNMASKED (Book 3)  CAN THEIR LOVE SURVIVE THE MOST SHOCKING REVELATION?  SEXY COLLEGE SENIOR Jamie Atwood has fallen hard for MMA dark horse Michael \"the Machine\" Kage. With his hot muscled body, intoxicating green eyes, and proclivity for rough sex, Kage is a potent aphrodisiac to the innocent boy-next-door. The danger, the intrigue, the feel of his strong hand around his throat, the knowledge that his fighter would kill or die for him. From the moment Kage grabbed onto his hips and channeled all that masculine aggression into claiming his body, Jamie was ruined for anyone else.  PASSIONS RUN HIGH as the lovers try to assimilate into each other's lives: coming out to family and friends, blending into the high-profile MMA world, dealing with Kage's sketchy uncle. But behind Kage's mask of strength and indifference lies a crippling vulnerability, and a devastating secret. As the mask comes off, past traumas surface, dark desires spin out of control, and the damaged fighter is driven to hurt the man he loves more than life itself.",
  "genres": [
    "M M Romance",
    "Sports",
    "Romance",
    "Contemporary"
  ],
  "author": "Maris Black",
  "average_rating": "4.37",
  "url": "https://www.goodreads.com/book/show/33621882-kage-trilogy"
}