{
  "title": "The Last Tudor",
  "description": "THE FINAL COMPELLING TUDOR NOVEL FROM SUNDAY TIMES BESTSELLER PHILIPPA GREGORY ‘How long do I have?’ I force a laugh.\n‘Not long,’ he says very quietly. ‘They have confirmed your sentence of death.  You are to be beheaded tomorrow.  We don’t have long at all.’\n Jane Grey was Queen of England for nine days. Using her position as cousin to the deceased king, her father and his conspirators put her on the throne ahead of the king’s half-sister Mary, who quickly mustered an army, claimed her crown and locked Jane in the Tower. When Jane refused to betray her Protestant faith, Mary sent her to the executioner’s block. There Jane turned her father’s greedy, failed grab for power into her own brave and tragic martyrdom.   ‘Learn you to die’ is the advice that Jane gives in a letter to her younger sister Katherine, who has no intention of dying. She intends to enjoy her beauty and her youth and find love. But her lineage makes her a threat to the insecure and infertile Queen Mary and, when Mary dies, to her sister Queen Elizabeth, who will never allow Katherine to marry and produce a potential royal heir before she does.  So when Katherine’s secret marriage is revealed by her pregnancy, she too must go to the Tower.   ‘Farewell, my sister,’ writes Katherine to the youngest Grey sister, Mary. A beautiful dwarf, disregarded by the court, Mary finds it easy to keep secrets, especially her own, while avoiding Elizabeth’s suspicious glare. After watching her sisters defy the queen, Mary is aware of her own perilous position as a possible heir to the throne. But she is determined to command her own destiny and be the last Tudor to risk her life in matching wits with her ruthless and unforgiving cousin Elizabeth.   Praise for Philippa Gregory:   ‘Meticulously researched and deeply entertaining, this story of betrayal and divided loyalties is Gregory on top form’ \nGood Housekeeping\n   ‘Gregory has popularised Tudor history perhaps more than any other living fiction writer…all of her books feature strong, complex women, doing their best to improve their lives in worlds dominated by men’ \nSunday Times\n   ‘Engrossing’ \nSunday Express\n   ‘Popular historical fiction at its finest, immaculately researched and superbly told’ \nThe Times",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Historical",
    "Audiobook",
    "Tudor Period",
    "British Literature",
    "Adult"
  ],
  "author": "Philippa Gregory",
  "average_rating": "3.86",
  "url": "https://www.goodreads.com/book/show/33627511-the-last-tudor"
}