{
  "title": "The Plant Paradox: The Hidden Dangers in \"Healthy\" Foods That Cause Disease and Weight Gain",
  "description": "“Dr. Gundry is a true trailblazer, always at the forefront of scientific knowledge. The Plant Paradox shows the world what pioneer thinking is about and is a must-read book for anyone interested in being as healthy as nature has designed them to be.” —Alejandro Junger MD, New York Times bestselling author of Clean, Clean Gut and Clean Eats“The Plant Paradox elegantly explains how plants defend themselves from being consumed by humans, and how eating the wrong ones at the wrong times immeasurably hurts our health. An eye-opening read.” —Mehmet Oz, MD, Professor of Surgery, New York Presbyterian/Columbia UniversityMost of us have heard of gluten—a protein found in wheat that causes widespread inflammation in the body. Americans spend billions of dollars on gluten-free diets in an effort to protect their health. But what if we’ve been missing the root of the problem? In The Plant Paradox, renowned cardiologist Dr. Steven Gundry reveals that gluten is just one variety of a common, and highly toxic, plant-based protein called lectin. Lectins are found not only in grains like wheat but also in the “gluten-free” foods most of us commonly regard as healthy, including many fruits, vegetables, nuts, beans, and conventional dairy products. These proteins, which are found in the seeds, grains, skins, rinds, and leaves of plants, are designed by nature to protect them from predators (including humans). Once ingested, they incite a kind of chemical warfare in our bodies, causing inflammatory reactions that can lead to weight gain and serious health conditions.At his waitlist-only clinics in California, Dr. Gundry has successfully treated tens of thousands of patients suffering from autoimmune disorders, diabetes, leaky gut syndrome, heart disease, and neurodegenerative diseases with a protocol that detoxes the cells, repairs the gut, and nourishes the body. Now, in The Plant Paradox, he shares this clinically proven program with readers around the world.The simple (and daunting) fact is, lectins are everywhere. Thankfully, Dr. Gundry offers simple hacks we easily can employ to avoid them, ·         Peel your veggies. Most of the lectins are contained in the skin and seeds of plants; simply peeling and de-seeding vegetables (like tomatoes and peppers) reduces their lectin content.·         Shop for fruit in season. Fruit contain fewer lectins when ripe, so eating apples, berries, and other lectin-containing fruits at the peak of ripeness helps minimize your lectin consumption.·         Swap your brown rice for white. Whole grains and seeds with hard outer coatings are designed by nature to cause digestive distress—and are full of lectins.With a full list of lectin-containing foods and simple substitutes for each, a step-by-step detox and eating plan, and delicious lectin-free recipes, The Plant Paradox illuminates the hidden dangers lurking in your salad bowl—and shows you how to eat whole foods in a whole new way.",
  "genres": [
    "Health",
    "Nonfiction",
    "Nutrition",
    "Food",
    "Science",
    "Self Help",
    "Audiobook"
  ],
  "author": "Steven R. Gundry",
  "average_rating": "3.52",
  "url": "https://www.goodreads.com/book/show/33630505-the-plant-paradox"
}