{
  "title": "Reinvent Yourself",
  "description": "- Book I've reinvented my career, my interests, my life, many times over the past twenty years. This is the book I wish I had at the beginning of that long and often volatile journey. And now the entire technology, governments, the shifting landscapes of opportunity and success, are all turning upside down, forcing us to reinvent as individuals and as a culture. ,Along my own journey I have read and encountered dozens of other successful leaders, artists, entrepreneurs, and mentors who I have learned the art of reinvention from. The journey has been intense. The obstacles were hard fought. And the adventures that led to me now finally sharing it all in this book has been both painful and exhilarating. I describe specific techniques, share stories, tell the stories of others, and give the ultimate guide to not only how but why it is critical for people to master the skills of reinvention. What I've change is the only constant. Companies decay, technologies disappear, governments change, relationships change and opportunity is a shifting landscape. Reading the stories and learning the critical skills taught in Reinvent Yourself is how I found my own way through the chaos of change and onto the path of new opportunity and success. Again, this is the book I wish I had in my hands twenty years ago although I am glad that I am writing it now. ABOUT THE AUTHOR James Altucher has started over 20 businesses and failed at 17 of them. He is an active angel investor and is invested in over 30 companies. He has written 18 books, including a children's book, \"My Daddy Owns All of Outer Space\", and the bestselling book, \"Choose Yourself\". He is a ranked chess master, a proud father, and his podcasts, including \"The James Altucher Show\" have had over 50 million downloads. What others have said about James From a NY Times profile of \"James is on a very personal journey. He's telling you the story on Saturday, on Sunday he's talking about how it failed, and on Monday he's talking about doing it a different way.\" - Brian Koppelman, co-creator of the TV show, \"Billions\". \"James is the Oprah of the Internet\" - Kamal Ravikant, author of \"Rebirth\", \"Love Yourself\", and a venture capitalist. --- Other testimonials from prior What I like about James and his book is you can tell he came from a roller coaster. He chose his own path to success without knowing the outcome. And what happens to him later - well... - (Dick Costolo, former CEO of Twitter) Altucher has turned his misfortune into a source of wisdom and comfort for the despondent. - (Business Week) James Altucher is scary smart - (Stephen Dubner, author of Freakonomics) James Altucher is the best blogger of our generation. - (Timothy Sykes, The Rebel Millionaire) We are beginning to build a massive amount of respect for James Altucher due to his willingness to say things that will get him absolutely pilloried by the masses. - (Business Insider) James is one of the most successful and content people I know. - (Machael Lazerow, founder of Buddy Media and Golf.com) If you need to see an example of vulnerability done well, just read the work of James Altucher. - (Search Engine Journal)",
  "genres": [
    "Nonfiction",
    "Self Help",
    "Business",
    "Personal Development",
    "Psychology",
    "Unfinished",
    "Entrepreneurship"
  ],
  "author": "James Altucher",
  "average_rating": "3.82",
  "url": "https://www.goodreads.com/book/show/33638850-reinvent-yourself"
}