{
  "title": "Bear My Heir",
  "description": "She never thought she would see him again, but now she has to fight for more than just her own future...  This is a full 50 k novel with a guaranteed HEA. It has violence, steam, a forbidden pregnancy and lots of hot shifter SEALs that are sure to blow through all your defenses. Read it as a standalone and fall in love with the shifters that won't back down!  Meredith Wilder had a perfect life, until the day she was assumed dead. As a scientist working on something that could change the world, she dreamed of helping mankind and building a future with the man she loved. A future that never came after a terrorist group caught wind of what she was working on... until that future crashed through the front gate of the encampment she was kept in. It seemed too good to be true, but does reason and rationality matter when the hottest man in the world has come to save your life?  Dice Alderson is a werebear with debts to pay, and the reaper is more than ready to claim them. As the newly minted head of Shifter Squad Nine, he controls a squad of ex-SEAL shifters with more blood on their hands than the rest of The Firm put together. Though control might be too big of a word for men who refuse to submit to authority. He thought there was nothing to look forward to but more killing, but the first time he saw Meredith again, all of that changed. Now he has everything to fight for, and there's plenty of that in him.  Led together by fate and determination, Dice has to save his fated, keep his crew alive and at bay, and worst of all, save his cub, who is nothing but a pawn for his enemies. Can Dice and Meredith reunite and beat the lies, deceit and pure terror that controls their lives, or is this a new beginning only meant to fail?",
  "genres": [
    "Romance",
    "Paranormal",
    "Shapeshifters",
    "Paranormal Romance"
  ],
  "author": "Anya Nowlan",
  "average_rating": "4.26",
  "url": "https://www.goodreads.com/book/show/33643609-bear-my-heir"
}