{
  "title": "Whatever Happened to Justice?",
  "description": "\"Whatever Happened to Justice?\" shows what's gone wrong with America's legal system and economy and how to fix it. It also contains lots of helpful hints for improving family relationships and for making families and classrooms run more smoothly. Discusses the difference between higher law and man-made law, and the connection between rational law and economic prosperity. \"Whatever Happened to Justice?\" introduces the Two 1) Do all you have agreed to do, and2) Do not encroach on other persons or their property.Can be used for courses in Law, Economics, Business, Finance, Government and History.To improve the student's learning experience, also purchase the student study guide for \"Whatever Happened to Justice?\" titled \"A Bluestocking Justice\", also available through Amazon.Table of Contents for Whatever Happened to Justice?Study Guide AvailableNote to ReaderAuthor's DisclosureAbout Richard J. MayburyAuthor's Introduction1. The Cause Is Law2. A Higher Authority3. A Higher Law4. Two Kinds of Law5. The Two Fundamental Laws6. Enforcement of Early Common Law7. How Do We Know If It's Law?8. Logic and Atoms9. Ambient Encroachment & Tacit Contracts10. Economic Calculation11. Force or Fraud12. The Lawless West13. Natural Rights14. The Human Ecology15. How Things Get Done16. Political Law17. Discovery vs. Enactment18. Our New Religion19. Common Law Wasn't Perfect20. Liberty vs. Permission21. Instability, Nuremberg and Abortion22. Democracy and the Constitution23. The Highest Law of the Land?24. Competing for Privilege25. The Great Mystery26. The Privilege and the Thrill27. The Fun Is In the Playing28. The Lessons of Simon Bolivar29. Eating the Seed Corn30. Origin of Government31. Are Lawyers and Judges Corrupt?32. So Why Do We Have a Government?33. Unsolved Risk34. Unsolved Capital Punishment35. Unsolved The Environment36. Unsolved Drugs37. Unsolved War38. Unsolved Irredentism39. Unsolved Poverty40. Unsolved Consumer Protection41. Unsolved Are There More Rules?42. SummaryAppendixA Memo from Richard Maybury (Uncle Eric)Table Comparing Scientific vs. Political LawSystems of Law ChartStandard of Living ChartAgreement Between Parent & ChildAgreement Between Teacher & StudentThought-Provoking Movies About LawBibliography and Suggested ReadingGlossaryIndexSuggested Supplemental \"Whatever Happened Penny Candy?\"Maybury says, \"In my opinion, you and your family and friends will avoid a lot of trouble, and find success of every kind much easier to achieve, if you adopt these two models, Austrian economics and common law.\"\"Whatever Happened to Justice\" explains the Legal model. Read \"Whatever Happened to Penny Candy\" to understand the Economic model (also available through Amazon).",
  "genres": [
    "Nonfiction",
    "Economics",
    "Politics",
    "History",
    "Education",
    "School",
    "Government"
  ],
  "author": "Richard J. Maybury",
  "average_rating": "4.25",
  "url": "https://www.goodreads.com/book/show/336461.Whatever_Happened_to_Justice_"
}