{
  "title": "Understanding Trump",
  "description": "The presidency of Donald Trump marks a profound change in the trajectory of American government, politics, and culture. The movement that put him in office, and his administration, represent a phenomenon that it is worth studying.Donald Trump is unlike any president we’ve ever had. He is the only person ever elected to be commander in chief who has not first held public office or served as a general in the military. His principles grow out of five decades of business and celebrity success – not politics – so he behaves differently than traditional politicians.In UNDERSTANDING TRUMP, Newt Gingrich shares what he learned from more than two years helping Trump and his team throughout the campaign, the election, and during the first months of the presidency. Already, many writers have spilled ink about our new president, but this is the first book written about the world of President Trump by someone who is actually a part of it.Speaker Gingrich provides unique insight into how the new president’s past experience has shaped his life and style of governing. This book also includes Speaker Gingrich’s thorough analysis of how President Trump thinks and makes decisions, as well as the president’s philosophy, doctrine, and political agenda going forward.Further, these pages hold a detailed discussion of Trump-style solutions for national security, education, health care, economic growth, government reform and other important topics. Speaker Gingrich also identifies the forces in the Washington establishment, media, and bureaucracy that will oppose the president at every turn.Finally, UNDERSTANDING TRUMP explains the president’s actions so far and lays out a vision for what Americans can do to help make President Trump’s agenda a success.The president owes his position to the people who believed in him as a candidate, not to the elites in government and media who have expressed contempt for him since he began his campaign to become president.The very essence of Trump’s mission is a willingness to enact policies and set goals that send our country in a bold new direction – which is “unreasonable” to Washington but sensible to millions of Americans.Only with the country’s help will President Trump be able to overcome the entrenched interests in Washington and fulfill his promise to make America great again for all Americans.",
  "genres": [
    "Politics",
    "Nonfiction",
    "Biography",
    "History",
    "Audiobook",
    "Political Science",
    "Autobiography"
  ],
  "author": "Newt Gingrich",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/33641806-understanding-trump"
}