{
  "title": "Soul's Fire",
  "description": "Astrid has been a warrior since the day she was old enough to make the choice to live and die with an axe in her hand. She is strong and stoic, powerful and brave, and she has the life she desires, free of complications and distractions.She is a shieldmaiden, and that is all she wishes to be.She has been the strong right hand of her jarl since the day they and their allies overthrew the cruel Jarl Åke. Jarl Leif is mighty and honorable, and with Astrid’s help, he has brought great prosperity to their people. Every summer, the raiders sail into new lands, traveling farther and farther, claiming treasure to enrich their people. They meet little resistance from the rulers or the people of these strange worlds.Until they land in a country whose king has learned the lessons of his neighbors and meets the raiders with a cunning and brutality that matches their own. In that clash, and after it, Astrid’s shieldmaiden’s strength and will is put to the harshest tests.Leofric is the second son of a king. Without the expectations or attention imposed on his older brother, he is free to live more or less as he chooses. But he is a seasoned warrior and not half so dissolute as his reputation suggests. When his father and brother seek to salve their rage by torturing a captive barbarian woman, Leofric sees their action for the evil it is and does all he can to save her, and then to heal her.To love her had not been part of his plan.The captive is strong and stoic, powerful and brave. She is a marvel unlike any woman he’s ever known. But if she is to live, she must learn the ways of his world. If she is to thrive, she must cast aside what she was and become something new. Leofric would give her all that he has and more, but there is one thing he cannot offer.His world has no word for shieldmaiden.Note: Explicit sex and violence. Dark themes.",
  "genres": [
    "Historical",
    "Historical Romance",
    "Dark",
    "Romance",
    "Erotica",
    "Fantasy",
    "Abuse"
  ],
  "author": "Susan Fanetti",
  "average_rating": "4.41",
  "url": "https://www.goodreads.com/book/show/33649571-soul-s-fire"
}