{
  "title": "The Confederacy's Last Hurrah: Spring Hill, Franklin, and Nashville",
  "description": "The rise of Civil War general John Bell Hood, his command of the Confederate Army of Tennessee, and the decisions that led to its downfall. Though he barely escaped expulsion from West Point, John Bell Hood quickly rose through the ranks of the Confederate army. With bold leadership in the battles of Gaines’ Mill and Antietam, Hood won favor with Confederate president Jefferson Davis. But his fortunes in war took a tragic turn when he assumed command of the Confederate Army of Tennessee.   After the fall of Atlanta, Hood marched his troops north in an attempt to draw Union army general William T. Sherman from his devastating “March to the Sea.” But the ploy proved ruinous for the South. While Sherman was undeterred from his scorched-earth campaign, Hood and his troops charged headlong into catastrophe.   In this compelling account, Wiley Sword illustrates the poor command decisions and reckless pride that made a disaster of the Army of Tennessee’s final campaign. From Spring Hill, where they squandered an early advantage, Hood and his troops launched an ill-fated attack on the neighboring town of Franklin. The disastrous battle came to be known as the “Gettysburg of the West.” But worse was to come as Hood pressed on to Nashville, where his battered troops suffered the worst defeat of the entire war.   Winner of the Fletcher Pratt Award for best work of nonfiction about the Civil War, The Confederacy’s Last Hurrah chronicles the destruction of the South’s second largest army. “Narrated with brisk attention to the nuances of strategy—and with measured solemnity over the waste of life in war,” it is a groundbreaking work of scholarship told with authority and compassion (Kirkus Reviews).",
  "genres": [
    "Civil War",
    "History",
    "American Civil War",
    "Nonfiction",
    "War",
    "Military History",
    "Military Fiction"
  ],
  "author": "Wiley Sword",
  "average_rating": "4.32",
  "url": "https://www.goodreads.com/book/show/33649717-the-confederacy-s-last-hurrah"
}