{
  "title": "Junkyard Sports",
  "description": "Junkyard Sports has these and many more -More than 75 demonstration games are included. -Endless variations of six major team sports can be played by almost anyone, anywhere, with just about anything. -Games are easy to implement and use low-cost or no-cost “found” materials for equipment. -Games build physical, social, and mental skills, including endurance, teamwork, and sensitivity to others. Junkyard Sports in physical terms looks like any other paperback book. But in reality it is a high-octane starter kit, fueling physical activity, creativity, and fun in ways that sports have never been played before. Teachers and recreation leaders who are looking to get away from the “same-old same-old” in their approach to games and sport will find Junkyard Sports a valuable tool. Part of that value comes from the more than 75 sport-specific demonstration games that Junkyard Sports provides. A demonstration game is a starting point for teachers and students—it provides not only a complete game description but also ideas for spawning new games from the original. These demonstration games pave the way for an exciting, nontraditional approach to a sport, and they also engender creativity, ingenuity, community, leadership skills, and other social skills as teachers and students consider further innovations to the sports. The beauty of junkyard sports is that they work in any environment, with any group. They are fresh because they are ever-changing as their rules, equipment, and environments are adapted. They are also budget-friendly because they call for found or nontraditional equipment—brooms, rolled-up socks, beach balls, whatever is around and not nailed down. They are also easy to implement—a brand new activity can be under way in five minutes or less. Part I introduces junkyard sports, defining the concept and exploring some of the purposes and potential benefits that led to its development. It includes sections on playing with groups of various ages and abilities, adapting sports to almost any environment, developing a junk (equipment) collection, and making flexible rules. It also explores how to coach a junkyard sport, including the invention and testing of the game, the sharing of equipment, the judging and revising of rules. Finally, it describes how to involve the entire community, giving you a strategy for implementing leadership and for sharing the fun with your peers and students. Part II is the “Junkmasters' Guide”—more than 75 demonstration games for six team soccer, football, basketball, baseball, hockey, and volleyball. Use them as starting points on a journey toward creating something that's never been played before! Junkyard Sports is a unique tool for recreation leaders and teachers to use in developing physical, mental, social, and leadership skills with groups of almost any age or ability. At the same time it helps teachers create an environment in which students are engaged, challenged, and enjoying themselves and each other. Winning isn't the point. Playing together is. And playing sports has never been more fun.",
  "genres": [
    "Plays"
  ],
  "author": "Bernie DeKoven",
  "average_rating": "4.67",
  "url": "https://www.goodreads.com/book/show/3363643-junkyard-sports"
}