{
  "title": "Silver Lies",
  "description": "They all came to Leadville with the same Get in. Get rich. Get out. As 1879 draws to a close, this Rocky Mountain boomtown has infected the world with silver fever. It's not much different than the dot.com mania or the corporate scams that heat up over a century later. Unfortunately for Joe Rose, a precious-metals assayer, death stakes its own claim. Joe's body is found trampled into the muck behind Inez Stannert's saloon. Inez already had much more to deal with than pouring shots of Taos Lightning and cleaning up a corpse. A lady educated on the East Coast, she has a past that doesn't bear close scrutiny, including her elopement with a gambling man who has recently disappeared. Most townsfolk, including Inez's business partner, Abe Jackson, dismiss Joe's death as an accident. Death, after all, is no stranger in Leadville. But Inez Why was this loving husband and father carrying a brass token good for \"one free screw\" at the parlor house of Denver madam Mattie Silks? When Joe's widow Emma asks Inez to settle Joe's affairs, almost against her will, Inez uncovers skewed assays, bogus greenbacks, and blackmail. Lies and secrets run deep in Colorado, secrets more likely to lead to a hanging than to today's congressional hearings or country-club prisons for the crooked and the greedy. Then again, maybe Joe's murder was purely personal.... Silver Rush Silver Lies (Book 1) Iron Ties (Book 2) Leaden Skies (Book 3) Mercury's Rise (Book 4) What Gold Buys (Book 5) A Dying Note (Book 6) Mortal Music (Book 7) Praise for the Silver Rush \"Plenty of convincing action bodes well for a long and successful series.\"― Publishers Weekly STARRED review for Iron Ties \"Meticulously researched and full of rich period details…her characters will stay will you long after you've finished the last page. Highly recommended.\"― TASHA ALEXANDER , New York Times bestselling author for Mortal Music \"One of the most authentic and evocative historical series around. Long live Inez!\"― RHYS BOWEN , New York Times bestselling author for What Gold Buys Winner of the WILLA Literary Award for Historical Fiction Colorado Gold Award for Best Mystery",
  "genres": [
    "Mystery",
    "Historical Fiction",
    "Fiction",
    "Historical Mystery",
    "Westerns",
    "Historical",
    "Book Club"
  ],
  "author": "Ann  Parker",
  "average_rating": "3.72",
  "url": "https://www.goodreads.com/book/show/3367.Silver_Lies"
}