{
  "title": "Hollywood Prince",
  "description": "From New York Times bestselling author Kim Karr comes a sexy and sizzling romp about falling for your best friend's little sister. Brooklyn James  should know better.Born into Hollywood royalty, the brooding prince has a reputation as being a player. A manwhore. A womanizer.Adoring fans are his thing.His best friend's little sister is not.Even thinking about her the way he is isn't cool.Not cool at all.And yet every time she pouts those sexy lips at him, she turns him inside out. Makes him harder than he's ever been. Drives him to the brink of insanity.Amelia Waters  has always idolized her big brother, and the last thing she wants to do is disappoint him.Falling for her brother's ex-roommate is off-limits.She knows this, but she can't help herself.The way Brooklyn looks at her with those smoldering blue eyes makes her wet in an instant. Turns her into a shivering, shaking mess of sexual frustration. And soon the idea of spreading her legs for him is the only thing she can think about.She wants him.He wants her.When they finally decide to give in to their insane attraction, they agree it will remain between them. That their illicit affair will be short-term. No strings. No baggage. No messy ending.But when the first night of mind-blowing sex leads to another, and another still, how long can the endless hookups go on before Amelia's brother finds out? Or worse yet, before feelings develop?Brooklyn and Amelia know they need to walk away from each other before either of those things happens.The problem is doing it.Talk about a mess.*** Look for No Pants Required and Bedwrecker to complete the Men of Laguna Series. All the books in this series are standalones with overlapping characters. ***",
  "genres": [
    "Romance",
    "New Adult",
    "Contemporary",
    "Friends To Lovers",
    "Humor",
    "Chick Lit",
    "Amazon"
  ],
  "author": "Kim Karr",
  "average_rating": "4.01",
  "url": "https://www.goodreads.com/book/show/33670401-hollywood-prince"
}