{
  "title": "A Brother's Love",
  "description": "How do you protect a woman who carries a gun and loves to use it? You outfox her while holding your breath!FBI Special Agent Pilar Campos lives and works in a man’s world, and she loves her job. What could be better than pointing her gun at people and arresting them? A smart ass with a temper, she is not above breaking bones if someone disagrees with her. She enjoys seeing the fear she inspires in her coworkers. Needless to say, she doesn't have many friends.Pilar and her partner, Rick, have been executing surveillance on the Snowflake Militia Group for two years. Everything is going just fine with the twenty-seven-million-dollar operation until she is forced to shoot and kill Thorne Baker, the brother of the self-proclaimed leader of the militia group, Boone Baker. This is the moment her life changes forever. Boone Baker initiates a one million dollar contract on Pilar’s life and will go to any length to avenge his brother’s death. Deputy Director Greg Olsen knows he has to get his best agent into protective custody. He also knows she won’t go even if he orders it; she’ll stay and fight to the end. So, he hatches a plan without her knowledge to tuck her away at a ranch in Northern Arizona owned by Amos Thomas, a man who dislikes people with as much, if not more, fervor than Pilar.Despite her protests, Pilar’s life is transformed at the ranch as she finds peace unlike any she has felt before, and her special bond with the animals astonishes even the most-seasoned ranch hands. Learning to open herself up to the people at the ranch, she develops close bonds with everyone but falls in love with Amos, who wants no part of a relationship. Amos, however, is not prepared for the way Pilar seems to know just what he's thinking and feeling. She knows exactly how to handle him because they are like two halves of a whole.Encountering one dead end after another trying to locate Pilar, Boone Baker goes to extreme measures to draw her out in the open. In one fell swoop, he crumbles her world around her, destroying what is most precious to her. Will she be strong enough to continue on, or will he get his revenge?",
  "genres": [],
  "author": "Sandy Wolters",
  "average_rating": "3.95",
  "url": "https://www.goodreads.com/book/show/12038842-a-brother-s-love"
}