{
  "title": "Goethe's Theory of Knowledge: An Outline of the Epistemology of His Worldview (CW 2)",
  "description": "Written 1884-1885; first published 1886 (CW 2) “Goethe’s Theory of Knowledge was Steiner’s first book. It is a remarkable performance, communicating the white heat, passion, and intensity of thinking that only youth’s vitality can summon. ‘One can write in such a seminal way only at the beginning of one’s path of knowledge,’ as he says. Reintroducing it forty years later, he could say with confidence that ‘as a theory of knowledge it seems to form the justification for everything I have said and published since then.’ In other words, by means of the path of thinking laid down here, Steiner began the process of breaking the ground in which the seeds of spiritual science, which he would be called upon to inaugurate, could germinate.” ― Christopher Bamford (introduction) As the editor of Goethe’s scientific writings during the 1880s, Rudolf Steiner became immersed in a worldview that paralleled and amplified his own views in relation to epistemology, the interface between science and philosophy, the theory of how we know the world and ourselves. At the time, like much of the thinking today and the foundation of modern natural science, the predominant theories held that individual knowledge is limited to thinking that reflects objective, sensory perception. Steiner’s view was eventually distilled in his Anthroposophical Leading Thoughts in 1924: “There are those who believe that, with the limits of knowledge derived from sensory perception, the limits of all insight are given. Yet if they would carefully observe how they become conscious of these limits, they would find in the very consciousness of the limits the faculties to transcend them.” In this concise volume, Steiner lays out his argument for this view and, moreover, begins his explication of how one goes beyond thinking to the observation of thinking itself. Goethe’s Theory of Knowledge is essential reading for a deeper understanding of Rudolf Steiner’s seminal work, Intuitive Thinking as a Spiritual A Philosophy of Freedom . This volume is a translation from the German of Grundlinien einer Erkenntnistheorie der Goetheschen Weltanschauung, mit besonderer Rücksicht auf Schiller (GA 2). Previous translations were published as The Science of Knowing (1988) and The Theory of Knowledge implicit in Goethe's Fundamental Outlines with Special Reference to Schiller (1940).",
  "genres": [
    "Philosophy",
    "Science"
  ],
  "author": "Rudolf Steiner",
  "average_rating": "4.11",
  "url": "https://www.goodreads.com/book/show/3366667-goethe-s-theory-of-knowledge"
}