{
  "title": "Midnight Poison",
  "description": "A new paranormal urban fantasy romance thriller from the bestselling authors of The Divinicus Nex Chronicles! It's action, adventure, suspense, and crazy fun characters!  \n\n-\n\n\n\n No Memory. No Mind. No Mercy.\nKiara Blackwood has a few problems.She's older than she looks - by several centuries. She can't remember who she is. She doesn't know why she's the target of Oleander, an immortal serial killer, or why she's held prisoner by the undead, or where to find the Midnight Poison, the one thing that could grant her freedom. And best of all, her psych meds have stopped working, because, oh yeah, she's borderline insane. Well, maybe not so borderline.When Oleander's killing spree threatens to rip the supernatural world apart, Kiara has no choice but to hunt him down. Forced to rely on a dashing vampire with questionable motives, she plunges into a world of lies, betrayal, deadly deceptions, and secrets that could tear what's left of her mind to shreds. And because that's such a piece of cake, while she's at it, she might as well search for the Midnight Poison, that legendary potion she can't remember creating, let alone hiding. Well...Crazy or not, here she comes.A&E Kirk, bestselling authors of the #1 Divinicus Nex Chronicles, have created a new series with all the usual action, adventure, and laugh-out-loud humor fans love, plus they've added a bit of dark, twisted, and dangerous.Be brave. Try some Midnight Poison. Lethal to the last drop.To all our amazing fans, we just wanted to mention that Midnight Poison has a bit more language and sexuality than the Divinicus Nex Chronicles, but other than that, you can expect the same type of exciting roller-coaster ride of action, suspense, and fun!",
  "genres": [
    "Paranormal",
    "Vampires",
    "Fantasy",
    "Fae",
    "Magic",
    "Shapeshifters",
    "Urban Fantasy"
  ],
  "author": "A.  Kirk",
  "average_rating": "4.09",
  "url": "https://www.goodreads.com/book/show/33656877-midnight-poison"
}