{
  "title": "Decapitating the Union: Jefferson Davis, Judah Benjamin and the Plot to Assassinate Lincoln",
  "description": "More than a hundred books have been written about the assassination of Abraham Lincoln, yet one of the few certainties about his death is that little about it is certain. The literature on the subject is replete with errors, theories and guesswork. This comprehensive work on the assassination and on the attempted assassination of other Northern leaders in the closing days of the Civil War, seeks to correct major and minor errors in the record, reconcile differences of opinion of historians and scholars, offer explanations for great unknowns and make sense of conspiracy theories. After a Foreword by the renowned historian, Joan L. Chaconas, it begins with the background of the conflict, threats and assassination attempts against Lincoln, black flag warfare, the Wistar and Dahlgren-Kilpatrick Raids on Richmond and the Confederate response thereto, and it ends with the incarceration, trial and sentencing of the assassin's action team (except for John H. Surratt, who would be tried separately in 1867, and except that one of those tried was not really a member of Booth's team) and an in-depth analysis of conspiracy. In between are chapters on the underground mosaic; Booth and his co-conspirators; the great kidnapping myth that concealed the planned decapitation of the United States government; the setting for assassination; riddles, conundrums, enigmas and mysteries relating to key players in the drama; carnage in the presidential box; Booth's descent to the stage, declamations, broken leg, exit and escape; attempted decapitation of the government; the death of the President; Edman Spangler's innocence; the pursuit of the fugitives; and the death of Booth. The author rejects the simple conspiracy theory and affirms the Tidwell, Hall and Gaddy thesis of the complicity of the highest levels of the Confederate government and its Secret Service Bureau. The author makes use of hundreds of sources to justify his conclusions and to give greater cohesion to the record of the events of April 14, 1865.",
  "genres": [
    "Civil War"
  ],
  "author": "John C. Fazio",
  "average_rating": "4.50",
  "url": "https://www.goodreads.com/book/show/33667555-decapitating-the-union"
}