{
  "title": "Do Gentlemen Really Prefer Blondes?: Bodies, Behavior, and Brains--the Science Behind Sex, Love, and Attraction",
  "description": "How long does it take to decide if a person is hot?Is your lover more likely to get you pregnant than your husband?Can men tell when a woman is fertile?If you’ve ever wondered how scientists measure love—or whether men really prefer blondes over brunettes—this smart, sexy book provides real answers to these and many other questions about our most baffling dating and mating behaviors. Based on the latest research in biology, evolutionary psychology, neuroscience, and cognitive science, Do Gentlemen Really Prefer Blondes? dares to explain the science behind sex—and opens a fascinating window on the intriguing phenomenon of love and attraction. Covering the areas of bodies, brains, and behavior, this eye-opening guide reveals the genetic, hormonal, and psychological secrets behind what makes us tick sexually. For example, do you know why a man’s body chemistry and behavior change when he’s in a committed relationship? And why, when he becomes a daddy, his testosterone level seems to plummet? And did you know…• When a couple first fall in love, their brains are indistinguishable from those of the clinically insane• You can tell a lot about a person’s sexual chemistry just by looking at his or her hands• Your genes influence whose body odors you prefer• Being around breast-feeding women may increase a woman's sex driveViewed through the lens of science and instinct, your love life might be seen in a completely different way. Do Gentlemen Really Prefer Blondes? provides both an in-depth exploration into our sexual psyches—and fresh advice for men and women who want to discover the secrets of successful relationships.",
  "genres": [
    "Nonfiction",
    "Science",
    "Psychology",
    "Sexuality",
    "Sociology",
    "Audiobook",
    "Relationships"
  ],
  "author": "Jena Pincott",
  "average_rating": "3.67",
  "url": "https://www.goodreads.com/book/show/3371443-do-gentlemen-really-prefer-blondes"
}