{
  "title": "Mediterranean Winter: The Pleasures of History and Landscape in Tunisia, Sicily, Dalmatia and the Peloponnese",
  "description": "In Mediterranean Winter, Kaplan, bestselling author of Balkan Ghosts, relives an austere journey he took as a youth thru the off-season Mediterranean. The awnings are rolled up. Other tourists are gone. Cold damp weather takes him back to the 1950s & earlier--a golden, intensely personal age of tourism. Decades ago, He voyaged from N. Africa to Italy, Yugoslavia & Greece, enjoying the radical freedom of youth, unaccountable to time because there was always time to make up for mistakes. He recalls the journey less to look inward into his own past than to look outward in order to dissect the process of learning thru travel, in which a succession of new landscapes can lead to books & artwork never before encountered. He 1st imagines Tunis as the glow of gypsum lamps shimmering against lime-washed mosques; the city he actually discovers is even more intoxicating. He goes to the ramparts of a Turkish kasbah where Carthaginian, Roman & Byzantine forts once stood: \"I could see deep into Algeria over a ribwork of hills so gaunt it seemed the wind had torn the flesh off them.\" In these surroundings he discovers Augustine; the courtyards of Tunis lead him to the historical writings of Ibn Khaldun. He goes to the 5th-century Greek temple at Segesta & reflects on the failed Athenian invasion of Sicily. At Hadrian's villa, \"Shattered domes revealed clouds moving overhead in countless visions of eternity. It was a place made for silence & for contemplation, where you wanted a book handy. Everycorner was a cloister. No view was panoramic: each seemed deliberately composed.\" His bus, train & nighttime boat rides, his long walks to archeological sites lead him to subjects as varied as the Berber threat to Carthage; the Roman army's hunt for the warlord Jugurtha; the legacy of Byzantine art; the medieval Greek philosopher Georgios Gemistos Plethon, who helped kindle the Italian Renaissance; 20th-century British literary writing about Greece; & the links between Rodin & the Croatian sculptor Ivan Mestrovic. Within these pages are smells, tastes & the profundity of chance encounters. Mediterranean Winter begins in Rodin's sculpture garden in Paris, passes thru gritty streets of Marseilles, ends with a moving epiphany about Greece as the world prepares for the 2004 Summer Olympics. Mediterranean Winter is the story of an education, filled with memories & history, not the author's alone, but humanity's as well.",
  "genres": [
    "Travel",
    "History",
    "Nonfiction",
    "Greece",
    "Italy",
    "Memoir",
    "Tunisia"
  ],
  "author": "Robert D. Kaplan",
  "average_rating": "3.92",
  "url": "https://www.goodreads.com/book/show/33686.Mediterranean_Winter"
}