{
  "title": "Moon Child",
  "description": "Moon Child - the fourth book in the Vampire for Hire Series...Mother, wife, private investigator...vampire. Six years ago federal agent Samantha Moon was the perfect wife and mother, your typical soccer mom with the minivan and suburban home. Then the unthinkable happens, an attack that changes her life forever. And forever is a very long time for a vampire.Now in MOON CHILD, sequel to AMERICAN VAMPIRE, private investigator Samantha Moon is faced with an impossible decision—a decision that no mother should ever have to make. A decision that will change her life, and those she loves, forever.And through it all, Sam finds herself in a lethal game of vampire vs. vampire as a powerful—and desperate—enemy will stop at nothing to claim what he most desires.**Acclaim for the Novels of J.R. Rain**\"Gripping, adventurous, and romantic—J.R. Rain's The Lost Ark is a breakneck thriller that traces the thread of history from Biblical stories to current-day headlines. Be prepared to lose sleep!\"—JAMES ROLLINS, international bestselling author of The Devil Colony\"I enjoyed this immensely. The protagonist, Samantha Moon, is a female vampire with a husband and children. Those predate her condition; six years ago she was attacked by a vampire and rendered into one. Now she's trying to carry on with family and private eye business, and she's a feisty, skilled person, so is doing mostly okay. It is not a horror story; she buys animal blood to eat and doesn't generally prey on humans. But her husband has an increasing problem with her coldness—not of spirit, but of body. 'You sicken me and scare the hell out of me,' he tells her. 'And when I touch you it's all I can do to not gag.' She replies, 'Words every wife wants to hear.' I love this! What makes it special are her character and nature.\"—PIERS ANTHONY, bestselling author of A Spell for Chameleon\"Dark Horse is one of the best books I've read in a long time! A great classic detective story with a modern twist. Unique and interesting characters (I think I'm half in love with Jim Knighthorse now!), a great plot that kept me guessing until the end, and some of the funniest lines I've read anywhere.\"—GEMMA HALLIDAY, bestselling author of Spying in High Heels\"Impossible to put down. J.R. Rain's Moon Dance is a fabulous urban fantasy.\"—APRIL VINE, author of Intrigue In India\"Moon Dance is absolutely brilliant!\"—LISA TENZIN-DOLMA, author of Understanding the Planetary Myths\"J.R. Rain is the new modern master of vampires.\"—H.T. NIGHT, #1 bestselling Kindle author of Vampire Love Story\"I love Jim Knighthorse! Please write faster, Mr. Rain!\"—ELAINE BABICH, #1 bestselling Kindle author of You Never Called Me Princess\"Moon Dance is a must read. If you like Janet Evanovich's Stephanie Plum, bounty hunter, be prepared to love J. R. Rain's Samantha Moon, vampire private investigator.\"—EVE PALUDAN, author of Letters from David\"I totally loved The Body Departed. As someone who communicates with those who are either earthbound or have crossed over—your descriptions and interpretations of the dialogue and circumstances could not have been written more accurately.\"—JULIE BELMONT, author of The Path to Personal Success and Freedom\"I thoroughly enjoyed The Vampire With the Dragon Tattoo from one of my favorite authors. A great way to spend a few hours of the afternoon.\"—JEN ASHTON, #1 bestselling Kindle author of Monstrous Love\"Powerful stuff!\"—AIDEN JAMES, bestselling author of The Vampires' Last Lover\"Jim Knighthorse is a throwback to classic detectives, which is probably why I love him so much. Funny, street-smart, and tough as nails. I love this series.\"—SUMMER LEE, author of Angel Heart",
  "genres": [
    "Paranormal",
    "Vampires",
    "Urban Fantasy",
    "Mystery",
    "Fantasy",
    "Fiction",
    "Romance"
  ],
  "author": "J.R. Rain",
  "average_rating": "4.04",
  "url": "https://www.goodreads.com/book/show/12039724-moon-child"
}