{
  "title": "The CIA as Organized Crime: How Illegal Operations Corrupt America and the World",
  "description": "This book provides insight into the paradigmatic approaches evolved by CIA decades ago in Vietnam which remain operational practices today in Afghanistan, El Salvador, Iraq, Syria, Yemen andelsewhere.Valentine’s research into CIA activities began when CIA Director William Colby gave him free accessto interview CIA officials who had been involved in various aspects of the Phoenix program in South Vietnam. The CIA would rescind it, making every effort to impede publication of The Phoenix Program, which documented the CIA’s elaborate system of population surveillance, control, entrapment,imprisonment, torture and assassination in Vietnam.While researching Phoenix, Valentine learned that the CIA allowed opium and heroin to flow from its secret bases in Laos, to generals and politicians on its payroll in South Vietnam. His investigations into thisillegal activity focused on the CIA’s relationship with the federal drugs agencies mandated by Congress to stop illegal drugs from entering the United States. Based on interviews with senior officials, Valentinewrote two subsequent books, The Strength of the Wolf and The Strength of the Pack, showing how the CIA infiltrated federal drug lawenforcement agencies and commandeered their executivemanagement, intelligence and foreign operations staffs in order toensure that the flow of drugs continues unimpeded to traffickers andforeign officials in its employ.Ultimately, portions of his research materials would be archived at theNational Security Archive, Texas Tech University’s Vietnam Center,and John Jay College.This book includes excerpts from the above titles along withupdated articles and transcripts of interviews on a range of currenttopics, with a view to shedding light on the systemic dimensions of theCIA’s ongoing illegal and extra-legal activities. These terrorism anddrug law enforcement articles and interviews illustrate how the CIA’sactivities impact social and political movements abroad and in theUnited States.A common theme is the CIA’s ability to deceive and propagandize theAmerican public through its impenetrable government-sanctionedshield of official secrecy and plausible deniability.Though investigated by the Church Committee in 1975, CIA praxis thencontinues to inform CIA praxis now. Valentine tracks its steadyinfiltration into practices targeting the last population to be subjected tothe exigencies of the American the American people.",
  "genres": [
    "History",
    "Politics",
    "Nonfiction",
    "Conspiracy Theories",
    "Crime",
    "Audiobook",
    "American History"
  ],
  "author": "Douglas Valentine",
  "average_rating": "3.93",
  "url": "https://www.goodreads.com/book/show/33780311-the-cia-as-organized-crime"
}