{
  "title": "Vampyres of Hollywood",
  "description": "Hollywood, three gruesome deaths within two weeks and every one of them a major star - an Oscar winner, an ingénue, and an action hero. A serial killer is working through the Hollywood A-list and celebrities are running scared.Each crime scene is worthy of a classic horror movie, and all three victims share a connection to the powerful scream queen, Ovsanna Moore. The stunning and formidable Moore is the legendary head of a Hollywood studio, as well as the writer and star of seventeen blockbuster horror films (and a few that went straight to DVD).She’s also a 500 year old vampyre… but this is Hollywood after all, and no one ever looks their age.Beverly Hills Police Detective Peter King knows a lot about the City of Angels, but he certainly doesn’t know that most of the famous actors in town are actually an established network of vampires. Or that secretive and seductive Ovsanna Moore happens to be their CEO.Moore and King may be from opposite sides of the Hollywood Hills, but both have something to gain by stopping the killer who the tabloids have dubbed the Cinema Slayer. Ovsanna must protect her vampire legacy and her production schedule, while King just wants to keep his Beverly Hills beat as blood-free as possible. But when the horror queen and the cop with the movie star looks form an unholy alliance, sparks fly and so do the creatures of the night.Film, television and Broadway star Adrienne Barbeau and New York Times bestselling author Michael Scott have teamed up to deliver this sexy, scary, and deliciously clever novel full of Hollywood glamour, behind-the-scenes secrets, and the truly bloodthirsty reality of Tinseltown. So grab some popcorn and some holy water and lose yourself in the high-stakes, back-stabbing world of the Vampyres of Hollywood.",
  "genres": [
    "Horror",
    "Vampires",
    "Paranormal",
    "Fantasy",
    "Fiction",
    "Mystery",
    "Urban Fantasy"
  ],
  "author": "Adrienne Barbeau",
  "average_rating": "3.57",
  "url": "https://www.goodreads.com/book/show/3375320-vampyres-of-hollywood"
}