{
  "title": "The Accomplished Guest",
  "description": "* A Washington Post Notable Fiction Book of the Year  A magnificent collection from award-winning author Ann Beattie—“profoundly intriguing and unsettling stories that abound in delectably witty and furious inner monologues, barbed dialogue, ludicrous predicaments, many faceted heartaches, and abrupt upswellings of affection, even love...always on point, funny, and poignant” (Booklist, starred review).Ann Beattie’s “seamless combination of biting wit and mordant humor, precise irony, and consummate cool” is on full display in this astutely observed collection set along the East Coast from Maine to Key West, that explores unconventional friendships, frustrated loves, mortality, and aging. In The Accomplished Guest, people pay visits or receive visitors, travel to see old friends, and experience the joys and tolls of hosting company (and of being hosted). In some stories, as in life, what begins as a benign social event becomes a situation played for high stakes.  “Ann Beattie slips into a short story as flawlessly as Audrey Hepburn wore a Givenchy gown” (Oprah Daily), and the pieces in The Accomplished Guest—featuring recent O. Henry, Pushcart, and Best American Short Story selections—are marked by an undercurrent of loss and an unexpected element of violence, with Beattie’s signature mordant humor woven throughout. Some guests provide welcome diversions, others are uninvited interruptions, all are indelibly drawn.  Beattie “punctures her characters’ pretensions and jadedness with an economy and effortless dialogue that writers have been trying to emulate for three decades” (The New York Times Book Review). The Accomplished Guest is fresh, funny, and overwhelmingly “brilliant at furnishing the precise level of niggling complexity that is tragicomically real” (San Francisco Chronicle).",
  "genres": [
    "Short Stories",
    "Fiction",
    "Short Story Collection",
    "Literary Fiction",
    "Humor",
    "Literature",
    "Book Club"
  ],
  "author": "Ann Beattie",
  "average_rating": "3.29",
  "url": "https://www.goodreads.com/book/show/33775842-the-accomplished-guest"
}