{
  "title": "Fall of the Asante Empire: The Hundred-Year War for Africa's Gold Coast",
  "description": "In 1817, the first British envoy to meet the king of the Asante of West Africa was dazzled by his reception. A group of 5,000 Asante soldiers, many wearing immense caps topped with three foot eagle feathers and gold ram's horns, engulfed him with a \"zeal bordering on phrensy, \" shooting muskets into the air. The envoy was escorted, as no fewer than 100 bands played, to the Asante king's palace and greeted by a tremendous throng of 30,000 noblemen and soldiers, bedecked with so much gold that his party had to avert their eyes to avoid the blinding glare. Some Asante elders wore gold ornaments so massive they had to be supported by attendants. But a criminal being lead to his execution - hands tied, ears severed, knives thrust through his cheeks and shoulder blades - was also paraded before them as a warning of what would befall malefactors. This first encounter set the stage for one of the longest and fiercest wars in all the European conquest of Africa. At its height, the Asante empire, on the Gold Coast of Africa in present-day Ghana, comprised three million people and had its own highly sophisticated social, political, and military institutions. Armed with European firearms, the tenacious and disciplined Asante army inflicted heavy casualties on advancing British troops, in some cases defeating them. They won the respect and admiration of British commanders, and displayed a unique willingness to adapt their traditional military tactics to counter superior British technology. Even well after a British fort had been established in Kumase, the Asante capital, the indigenous culture stubbornly resisted Europeanization, as long as the \"golden stool, \" the sacred repository of royal power,remained in Asante hands. It was only after an entire century of fighting that resistance ultimately ceased.",
  "genres": [
    "History",
    "Africa",
    "Nonfiction",
    "Western Africa",
    "Ghana",
    "Military History",
    "19th Century"
  ],
  "author": "Robert B. Edgerton",
  "average_rating": "3.74",
  "url": "https://www.goodreads.com/book/show/337697.Fall_of_the_Asante_Empire"
}