{
  "title": "Hexult",
  "description": "Hexult is a gripping adventure story for all ages, set in a future ice age, where science is more powerful than magic against pirates and a fraudulent wizard.When the seas rose and the Earth froze much knowledge was lost.And in this world of ice a little knowledge goes a long way.Life on Hexult is about to change, with the arrival of the new young wizards and their strong magic; the new magic they call 'science'.Sail with Aulf across the ice, through the frozen breath of the deadly Vajra crevasse and between the quarreling isles of Hexult.\"It has a real childlike innocence and sense of wonder about it that make it a great book\"Sift Book Reviews\"It has that sprinkle of fairytale charm that we find so little of lately. \"L.E.Olteano\"You might have to get two, like I did - one copy for you, one for the kids.\"Denna Holm\"Chapters are short, ideal, I think for children's fiction. I can imagine classes in school using a story like this.\"fleursdemontblanc\"There is so much for young readers to wonder about and I can see how easily a book like this could be used to motivate pupils to produce their own work. There's a good balance between dialogue and narrative, and your descriptions of the sailing craft and ice-world are excellent.\"fleursdemontblanc\"pacey stuff; felt very filmic\"EthanQuick\"Your characters were warm (and your world cold and beautiful).\"EthanQuick\"The setting is original and fascinating, yet within the compass of the imagination of a ten year old. \"Ophelia9\"You have a fascinating story here, full of imagination and your prose is so accessible and direct, perfect for your target audience.\"Carlashmore\"Straight away the simplicity of science was mistaken for magic and gives a taste of what's to come.\"mariecapri\"The way all the important information is woven, so expertly, into the narrative is seamless.\"Elsieraven\"I think one of the main reasons I enjoyed reading this, apart from the obvious quality of the writing, is that it felt new and fresh.\"Elsieraven\"You have created a fascinating world and your characters are all very strong with believable dialogue. Your descriptions of settings are beautiful and I am transported into your wonderful imaginary world.\"Betty K An original premise, good character development, and lots of action make this a truly enjoyable read! MadameDiotte",
  "genres": [
    "Young Adult",
    "Fiction"
  ],
  "author": "Perry Aylen",
  "average_rating": "4.02",
  "url": "https://www.goodreads.com/book/show/12041335-hexult"
}