{
  "title": "Una vita come tante",
  "description": "L’uscita di questo imponente romanzo ha suscitato un sentimento quasi unanime di stupore. Il repertorio dei commenti descrive nella maggior parte dei casi una qualità particolare del libro, ossia la capacità di far scaturire una passione trascinante per i suoi personaggi e la loro storia, di far trascorrere il tempo come fosse in accelerazione, di donare la sensazione, ormai desueta, che la lettura di un romanzo possa impadronirsi delle nostre vite. «Non capita spesso di leggere un romanzo di queste dimensioni e di pensare “vorrei che fosse più lungo”» (Times); «Totalmente coinvolgente, meravigliosamente romantico, a volte straziante, mi ha tenuto sveglio fino a tarda notte, una sera dopo l’altra» (Edmund White).Sembrano considerazioni ingenue, o furbescamente commerciali, ma le fonti di certo non lo sono. Si potrebbe dire che il romanzo di Hanya Yanagihara è una favola, e ciò spiegherebbe alcune delle reazioni che ha provocato. Una grande favola contemporanea, a tratti di malinconica dolcezza, spesso crudele ed efferata.In una New York fervida e sontuosa vivono quattro ragazzi, ex compagni di college, che da sempre sono stati vicini l’uno all’altro. Si sono trasferiti nella metropoli da una cittadina del New England, e all’inizio sono sostenuti solo dalla loro amicizia e dall’ambizione. Willem, dall’animo gentile, vuole fare l’attore. JB, scaltro e a volte crudele, insegue un accesso al mondo dell’arte. Malcolm è un architetto frustrato in uno studio prestigioso. Jude, avvocato brillante e di enigmatica riservatezza, è il loro centro di gravità.Nei suoi riguardi l’affetto e la solidarietà prendono una piega differente, per lui i ragazzi hanno una cura particolare, una sensibilità speciale e tormentata, perché la sua vita sempre oscilla tra la luce del riscatto e il baratro dell’autodistruzione. Intorno a Jude, al suo passato, alla sua lotta per conquistarsi un futuro, si plasmano campi di forze e tensioni, lealtà e tradimenti, sogni e disperazione. E la sua storia diventa una disamina, magnifica e perturbante, della crudeltà umana e del potere taumaturgico dell’amicizia.Come accade di rado, da una inconsueta immaginazione narrativa si è distillato un oggetto singolare: un romanzo classico e al tempo stesso modernissimo, capace di creare un mondo di profonda, coinvolgente umanità.",
  "genres": [
    "Fiction",
    "Contemporary",
    "Literary Fiction",
    "LGBT",
    "Queer",
    "Book Club",
    "Mental Health"
  ],
  "author": "Hanya Yanagihara",
  "average_rating": "4.30",
  "url": "https://www.goodreads.com/book/show/33783426-una-vita-come-tante"
}