{
  "title": "Two Jocks Next Door",
  "description": "A good girl student next door. Two rough jocks. One fierce and obsessive attraction. She's about to lose her halo...thanks to both bad boys.    Full-length, standalone romance with an HEA ending and Zero Cliffhanger.  Connor I'm the life of every party, the filthy-mouthed jock that every woman wants, the icing on the cake for the college chicks that I like to share with my best buddy and fellow teammate, Kade.  Until Kade introduces me to Tracey-Ann.  She lives in the dorm close to our frat house, and when she shows up to one of our wild parties for the first time, Kade and I have to break her in.  She's a good girl with a sheltered life. There's no reason she should have an effect on us, but she does. We're both hooked, and my new mission becomes convincing Kade of one undeniable truth.  Tracey-Ann is the one for us.  Tracey-Ann I've been a good girl for most of my life, but that all changes when I let Connor and Kade put their hands on me. One frat house party corrupts my innocence forever, but the truth is, everyone has something from their past they're not proud of. Kade can attest to that the most, except he's closing in on who I really am, and I'm not sure I'm ready to open the floodgates. The filthy-talking bad boys take me in every way I've ever fantasized about, and before I know it, they have stolen my heart, devoured my soul, and turned my life upside down. I learn something I can't deny. Falling for two men will leave more than just a mark.  Kade I meet Tracey-Ann at one of our frat house parties and everything changes. I will probably deny it for the rest of my days, but I fell in love with her the moment I saw her. It has nothing to do with her stunning face, shapely body my eyes can't stop staring at, or her legs that go on for miles. Well, maybe a little. But it's more than just the outside. When Tracey-Ann speaks, the tightness around my chest relaxes. I'm instantly addicted to the calm she creates around the storm that has been my life up until now. Except, I have a problem. I may be past addiction. Tracey-Ann is now an obsession.  Author's Notes:  - Two Jocks Next Door is a MFM ménage standalone romance that is all about the woman. There are no M/M scenes. This story is all about TWO hot, bad boys who fall for the same woman. - This story has no cliffhangers and a guaranteed happy ever after ending.",
  "genres": [
    "Menage",
    "Romance",
    "Sports",
    "Erotica",
    "New Adult",
    "College",
    "Football"
  ],
  "author": "Jay S. Wilder",
  "average_rating": "3.76",
  "url": "https://www.goodreads.com/book/show/33789604-two-jocks-next-door"
}