{
  "title": "The Mountain Man's Bride",
  "description": "In this sequel to The Mountain Man's Dog, rustic forester Lehigh Carter fights to clear first his own name, then that of his fiancée, Stacy McBride, as they are accused of murdering the deputy who once made their lives miserable.The murder of popular acting Sheriff Jared Barkley in Clarkesville, a small town in Oregon's Cascade Mountains, puts Lehigh and Stacy's plans to marry on hold when Stacy is arrested for committing the crime. On the advice of her lawyer, Stacy cuts off ties to Lehigh, who remains a subject of the investigation himself by the crooked cops and politicians running Mt. Hood County.Lehigh's own lawyer, the smart, beautiful Samantha Pullen, works the legal angles to keep Lehigh out of jail, but he ignores her advice to keep a low profile and conducts his own investigation into the murder -- putting himself in greater danger than he ever imagined.A chance meeting with an old high school football teammate prompts Lehigh to visit the victim's grieving mother, who will only talk to one who has suffered the same way--Lehigh's own mother, who, in her advancing senile dementia, blames Lehigh for the death of his older brother when they were tykes. When the two women bond, Lehigh becomes privy to new information revealing a series of clandestine meetings between Jared and Stacy leading up to his death--meetings that look a lot like an ongoing secret love affair, rekindled from their youth.As Lehigh continues his investigation, his doubts about Stacy's innocence multiply--particularly when she appears to make romantic overtures to her ex-fianceé, attorney Paul van Paten, a leading member of the conspiracy against Lehigh. Cooperating with the only honest cop he knows in the county, Detective \"Gentleman Jim\" Wadsworth, Lehigh plays a high-stakes game of legal chicken to infiltrate the conspiracy and discover the truth behind Jared Barkley's murder.",
  "genres": [
    "Fiction"
  ],
  "author": "Gary  Corbin",
  "average_rating": "4.13",
  "url": "https://www.goodreads.com/book/show/33806292-the-mountain-man-s-bride"
}