{
  "title": "Black Tar: For the Love of Heroin",
  "description": "Black Tar: For The Love of Heroin is a biographical essay describing the use of heroin and the toll it takes on a junkie's daily life. Please understand one critical feature of this book. It is a biography, hand written by the junkie in question about his life and his alone. As such it is not a piece of literary perfection. It has not been polished to perfection by a team of editors, nor was it published by a major publishing company. Black Tar: For The Love of Heroin was originally written on a legal pad as part of a twelve step program. It made its way to me, its ultimate editor, and I was amazed by the details Stephen was able to remember and capture on paper. Once I got to know him I asked him if he would work with me on his life story and he reluctantly agreed. Sensing his hesitancy I told him we would not use his name and focus on the day to day existence of a junkie as he experienced it living from fix to fix. But Stephen could be a hard person to track down and his never ending thirst for the needle made his story a hard one to tell. I spent days upon weeks crawling the downtown streets looking for him and a lot of times when I did find him I would have to buy him heroin just to get him to work with me. So, I made a deal with him, like making a deal with the devil, that if he would help me drag his biography into existence, I would buy him enough heroin to get through each and every day we worked together.One day's worth of heroin for one day's worth of storytelling. This made it easy for him to make himself available for the writing of his biography. By the time I met Stephen he was almost fifty years old and in full blown heroin psychosis. How he managed to live as long as he had was always a miracle to me. Over the course of a year and several months I pulled every story Stephen could remember from his heroin-addled brain and preserved them on paper. But I never wanted this story to be an autobiography. I wanted it to be Stephen telling his story, in his words, no matter how it might look like in the end.With these rules in place I gave him his first computer and at first he slaved over his 'hunt and peak' computer skills. But the more he wrote the more he remembered and slowly, after three long years of exchanging one day of heroin to entice him to work one day of writing, Stephen declared himself finished with the project. I read what he had written and quickly realized that active heroin junkies make terrible writers. What he had produced was basically unusable. To make a three-year writing stint something of literary value I set myself to editing what he had written. I didn't want to strip it of the style of writing that made it junkie. More than anything else I wanted to preserve his perspective, sense of pain, his defeat, his single-minded approach to heroin and to the fact he knew it was going to kill him. I think that fatalistic view of life is what hit me the hardest.To make the book easy to digest I divided it into five segments and then spread his life between the points. And that is what we ended up with. The biography of a drug addict; barely touched by an editor's pen, and filled with the dirt, muck and blood that is a junkies life.",
  "genres": [
    "Memoir"
  ],
  "author": "Stephen E. Crockett",
  "average_rating": "3.71",
  "url": "https://www.goodreads.com/book/show/33801910-black-tar"
}