{
  "title": "Bloodlands + Black Earth: Stalin, Mao, Hitler: Red Flags as History and Warning",
  "description": "Bloodlands + Black Red Flags as History and Warning. Stalin, Mao, & Hitler - their blood red flags and black hearts caused the deaths of millions. There was a conspiracy shared by all three of them and by many others worldwide. They were aided by ideological comrades in the USA. Their comrades continue to cover up their deadly dogma today. Top historical discoveries of the century are revealed in this book, (1) Congress and the Flag Code confirm that the military salute was the origin of the Nazi salute. (2) The USA's Pledge of Allegiance inspired Nazi rituals. (3) Public schools spread Nazi behavior. (4) Swastikas represented crossed \"S\" letter shapes for \"socialist\" under Hitler. The above scholarly achievements are from astounding academic work by the historian Dr. Rex Curry. Verified! The U.S. Congress confirms that the remarkable research is correct. Learn how flag laws are written to hide America’s scary past, present, and future. Fact checked! The startling news exposes the origins of the police state and how to fight it. Save yourself from the cult of the omnipotent state! The de-programming guide is right here. This blockbuster debunks parts of Timothy Snyder’s books “Bloodlands” and “Black Earth.” what the \"+\" symbol means on the front cover in the title \"Bloodlands + Black Earth\"! Author Ian Tinny relied on research by Dr. Curry, including these astonishing (1) that the \"Pledge of Allegiance to the Flag\" was the origin of the Nazi salute and Nazi behavior; (2) that the military salute was the origin of the Nazi salute (via the military salute's use in the original Pledge of Allegiance) and; (3) Swastikas represented crossed \"S\" letter shapes for \"socialist\" under Hitler. Research for Dr. Curry’s distinguished accomplishments was painstaking and difficult, but fortunately grad students are plentiful and cheap. The government calls America’s beloved VexilLOLogist (Dr. Curry) \"the man who knows too much.\" Anyone who doubts that Hitler used the swastika to represent \"S\" letter shapes for \"Socialism\" is someone who believes Hitler was blind and that Hitler remained blind throughout the decades that Hitler used the symbol for his National Socialist Party. Eventually, Dr. Curry's discovery about the swastika will become so well-known and so obvious that no one will believe that Dr. Curry \"made the discovery that Hitler used the swastika to represent 'S' letter shapes for 'socialism'\" because no one will believe that there ever was a time when people could not see that Dr. Curry's assertion was self-evident. People will not believe that there ever was a time when the world did not see the glaring truth. People of the future will not believe that people of today were so blind and ignorant. It will be Dr. Curry's revolutionary paradigm shift. The same path of doubt, dissemination, and eventual widespread acceptance and paradigm shift will occur regarding Dr. Curry's discovery that the Pledge of Allegiance was the origin of the Nazi salute and Nazi behavior. “There is rumor of a Pulitzer Prize for exposing the Pledge of Allegiance as the origin of Nazi salutes and Nazi behavior; and the swastika as alphabetical ‘S’ letter shaped symbolism for ‘socialist.’ Hooray!” - R. Yates Bloodsworth “The professor’s work left us speechless!” – Tampa Tribune Newspaper \"This book will make you wonder if anything you know is true.",
  "genres": [
    "History",
    "Russia",
    "China",
    "World War II"
  ],
  "author": "Ian Tinny",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/33795395-bloodlands-black-earth"
}