{
  "title": "Innocent Blood: A true story of obsession and serial murder",
  "description": "Like a real-life Hannibal Lecter--the psychopathic murderer from Thomas Harris' \"Silence of the Lambs\"--Charles Hatcher was cunning, sadistic and totally remorseless. He was a man with no conscience. He killed sixteen people, three of them children. Hatcher was also responsible for a different kind of tragedy--the conviction and imprisonment of an innocent man who was mercilessly hounded by the police, the prosecutor and the community for a brutal murder that Hatcher himself committed. A nomadic Dr. Jekyll & Mr. Hyde who manipulated the legal system with gruesome skill, Charles Hatcher was the embodiment of evil, the devil's emissary on Earth. His nemesis was the lone FBI-man in St. Joseph, Missouri who risked his career to end Hatcher's reign of terror. \"Innocent Blood\" is the true story of Charles Hatcher and his life of crime--a powerful, and blood-chilling glimpse into the darkness between sanity and madness. It also chronicles a justice system gone wrong. Throughout his criminal career Hatcher was able to fool dozens of psychiatrists, who repeatedly failed to identify him as a multiple murderer. Hatcher's astonishing skill was not just in his ability to murder and escape imprisonment. He became an expert at manipulating the criminal justice system; overall, he outwitted police, prosecutors, psychiatrists and judges in twelve cities and eight states. Terry Ganey first covered this story as a reporter for the St. Louis Post-Dispatch. Later, he spent four years researching the material for this book, interviewing over seventy-five people and reviewing thousands of documents, court transcripts, prison files, police reports and mental health records. What emerges is a fascinating and horrifying portrait of a mass murderer at large in America--a murderer who could have stalked his victims in any of our towns and cities, whether urban or rural, large or small. This is an updated edition of the New York Times bestseller that was originally published in hardback under the title \"St. Joseph's Children.\" The New York Times called the book, \"a powerfully affecting story...every parent's nightmare.\" Kirkus Reviews said it was \"an effective cautionary tale of crime and too-late punishment.\" The Library Journal described the book as \"a gripping tale of murder, pursuit, and justice.\" And Publishers Weekly's conclusion was: \"Disturbing...Justice is shown to triumph--ultimately--in this engaging, instructive true crime study.\" Customer reviews of the hardback edition \"St. Joseph's Children\" had this to say about it on the Amazon book website: --\"My favorite book of ALL TIME!\" --\"I can hardly put this book down...\" --\"I highly recommend this book to all.\" --\"What a wonderful book on a horrible miscarriage of justice.\" --\"Book was very well written.\" This \"Innocent Blood\" eBook edition contains additional material that editors had discarded for the first print edition. Some events and background relating to Charles Hatcher's early life have been added, as well as context, description and background. The epilogue has also been updated. The revised eBook recounts the original, shocking narrative, which one reviewer wrote \"penetrates the murky darkness of a soul in torment and of a town caught in despair, a town that witnessed both the unremarkable beginning and savage end of Charles Hatcher's criminal career.\"",
  "genres": [
    "True Crime",
    "Nonfiction",
    "Audiobook",
    "Crime",
    "Serial Killer",
    "History"
  ],
  "author": "Terry Ganey",
  "average_rating": "3.73",
  "url": "https://www.goodreads.com/book/show/33801823-innocent-blood"
}