{
  "title": "The Sitting Sisters",
  "description": "A forced reunion of four sisters who have gathered to watch their father die becomes a cathartic exercise in finding where each of their pieces lit in the family puzzle. But the puzzle has been thrown into the air and each sister begins to realize she cannot put it back together from childhood memories--too many holes. Told through the eyes of the second of four daughters, Taliaferro Ervin, Tollie,\"\" \"\"The Sitting Sisters by Martha Randolph Carr explores the differences in what siblings carry into their adulthood--all from what they \"\"thought was the same childhood. They slowly begin to realize how their strayed experiences shaped each of their lives in very different ways. As this story of self-discovery begins the three oldest sisters have just come home at the request of the youngest, who chose to stay and care for their father after their mother's death. The sisters are careful not to discuss their father's shocking illness in public or even on the phone. Party lines and eavesdropping are the norm on the fictional South Carolina barrier island of Kelsal, and the sisters know that their father's standing in the community as the Episcopal minister would be in danger if word got out. Returning to the island as adults to face the loss of their father together, they discover many unanswered questions. More holes in their family history force Tollie on a journey she hadn't planned to take. Like many of us, she believes her answers reside just over the horizon. But Tollie discovers that what she is looking for lies closer to the questions than in the dreamy distance. \"\"The Sitting Sisters come to the realization that their family built on love is covered with so many layers of abandonedemotions and generations of secrets, that the sisters have each come to doubt love in their own ways They ultimately find that redemption comes from within and peace comes in how you manage your memories and draw from them to focus on your future.\"\"",
  "genres": [],
  "author": "Martha Carr",
  "average_rating": "3.43",
  "url": "https://www.goodreads.com/book/show/1204290.The_Sitting_Sisters"
}