{
  "title": "Haliç'te Yaşayan Simonlar: Dün Devlet Bugün Cemaat",
  "description": "Emniyet Teşkilatının efsanevi ismi, Susurluk sürecinde cesur duruşuyla gerçek bir kanun adamı tavrı gösteren Hanefi Avcı yine doğru bildiklerini söylemeye devam ediyor. Ucunun kime dokunduğuna bakmadan, yalnızca ülkesine karşı vicdani sorumluluğunu yerine getirmek için son dönemde yaşananların iç yüzünü kamuoyuna açıklıyor.Kitap iki bölümden oluşuyor. Devlet başlıklı ilk bölümde, yıllarca devlete hizmet etmiş bir güvenlik görevlisi olarak geçirdiği fikirsel dönüşümü, bu dönüşüme neden olan olayları okurlarla paylaşıyor. Bu fikirsel dönüşümün sonucunda Avcı artık, uzun yıllar mücadele ettiği, sisteme muhalif grupların demokratik ve sağlıklı bir sistemin olmazsa olmazı olduğuna, farklı fikir ve düşüncelerin topluma zarar değil, ancak bir zenginlik katacağına, güvenlik sorununa indirgenen Kürt sorununun ancak demokratik hak ve özgürlükler alanının genişletilerek siyasi yollarla çözümlenebileceğine ve ordunun batılı ülkelerde olduğu gibi siyasetin dışında kalarak güçlü bir ordu olabileceğine inandığını açık yüreklilikle ifade ediyor. Avcı, bu kitabı yazmaktaki önemli amaçlarından birinin, böyle köklü bir değişim yaşamasına neden olan mesleki tecrübelerini aktararak, çok geniş bir kriminal yelpazede çalışmış olmanın verdiği donanımla kendinden sonra geleceklere yol göstermek olduğunu belirtiyor.Cemaat başlıklı ikinci bölümde ise Avcı devletin çeşitli kurumlarına nüfuz etmiş cemaat yapısının son zamanlarda meydana gelen olaylardaki (özel yetkili mahkemelerin sürdürdüğü tahkikatlardan, telefon dinlemelerine, vs.) rolünü ortaya koyuyor. Cemaatin polis, ordu, MİT, jandarma, yargı ve diğer devlet kurumları içerisinde ayrı bir hiyerarşik örgütleme kurarak ve bu teşkilatların sistemlerini bozarak çalışmalarını engellediğinden, üstüne üstlük bu teşkilatların personeli arasında ayrım, güvensizlik ve düşmanlık yaratarak kurumları içerden ve tamir olunmaz biçimde yaraladığından bahsediyor. Bugün özellikle özel yetkili mahkemelerce yürütülen tahkikatların, arka planda cemaatin talimatı ile Emniyet İstihbarat Şubesindeki unsurları ve cemaate bağlı savcılar desteği ve zorlaması ile yürütüldüğüne, yürütülürken hukuksuz işlemlerin yapıldığına dair ciddi emareler olduğunu iddia ediyor. Tüm bu iddialarını, delilleriyle sağlam bir zemin üzerine inşa ediyor.Avcı kitabın başlığında iki metafor kullanıyor; bunların devlet görevlilerinin, belli bir ideoloji etrafında örgütlenmiş grupların ve genel anlamda toplumun zihniyetini tanımlayabilmek için ne kadar isabetli bir biçimde seçilmiş olduğunu kitabı okuyup bitirdiğinizde anlayacaksınız. Görünen değil, perde arkasındaki gerçekleri merak ediyorsanız Emniyet teşkilatının güvenilir ve öncü ismi Hanefi Avcı’nın dürüst ve cesur sesine kulak verin! (kitapyurdu)",
  "genres": [
    "Politics",
    "Nonfiction",
    "Turkish",
    "History",
    "Turkish Literature"
  ],
  "author": "Hanefi Avcı",
  "average_rating": "3.72",
  "url": "https://www.goodreads.com/book/show/12042808-hali-te-ya-ayan-simonlar"
}