{
  "title": "Woman Who Brings the Rain: A memoir of Hokkaido, Japan",
  "description": "WINNER OF THE NEW WELSH WRITING AWARDS 2015 People, Place & Planet: WWF Cymru Prize for Writing on Nature and the Environment  As precise and nuanced as Japanese calligraphy, this memoir of the author's stay on the remote Hokkaido island in the far north of Japan, has at its heart the mountain, Yotei-San, the region’s iconic equivalent to Mount Fuji. As much about learning a language (with connotations of ‘reading’ a wild landscape) as it is about nature, this dignified and nuanced work evokes what is cultured and cultivated, and yet also honours the wild; the untranslatable. With its themes of seasonal transformation, the peripheral, folklore, loneliness and learning to belong, this work takes a personal philosophical stance in relation to the centre and the periphery.  “Eluned Gramich has written the perfect essay - a minutely detailed yet nuanced evocation of place and personalities that is full of ecologically precise imagery and is as attentive to the Japanese language as it is to Hokkaidan landscape.” Author and Judge of New Welsh Writing Awards 2015, Mark Cocker  “Eluned’s touching and perfectly written memoir shows how central nature and an appreciation of landscape is to Japanese culture.” Editor of New Welsh Review, Gwen Davies  \"There are many qualities to admire in Woman Who Brings the Rain: Gramich’s adroit and touching narrative, her poetic style, and lightness of touch are but a few examples. Most rewarding is the philosophical approach revealed at the memoir’s core: her embracing of notions of cultural multiplicity, fluidity and adaptability that suits perfectly the changing boundaries of our modern world.” Wales Arts Review",
  "genres": [
    "Audiobook",
    "Nonfiction",
    "Biography",
    "Japan",
    "Biography Memoir",
    "Memoir",
    "Travel"
  ],
  "author": "Eluned Gramich",
  "average_rating": "3.08",
  "url": "https://www.goodreads.com/book/show/33795343-woman-who-brings-the-rain"
}