{
  "title": "Overtaken: Captive States",
  "description": "Bestselling author R WK Clark offers this wild, powerful and disturbing thriller about an evil that exists far beyond the galaxy.Though they say one day our youth will inherit the Earth; if Josh and Kamryn can’t put their hacking skills to good use and eliminate the threat, there will be no Earth to inherit.A riveting and unforgettable story of a world engulfed in mayhem as humanity makes its last stand against unholy destruction.Author CommentaryThis particular novel, ‘Overtaken,’ was the second book that I have written and the first one I published. I think that the premise of the book is good, and the story is relatively spooky overall.There always has to be a hero or two. The character of Josh Nichols takes readers to Washington, DC, with front row seats. Josh is a young, ambitious man with all of his supposed ducks in a row; he works as a code writer at the Pentagon. Kamryn Reynolds is Josh’s polar opposite. With a history of crime and street-life, she is a seasoned, semi-tough computer hacker who is always dodging the law.Now, we should probably consider the question: With all of the resources and skills at the fingertips of the United States government, especially when it comes to employees, why choose Josh and Kamryn to try and save the day? Well, dear reader, I think the answer is obvious: It makes for a story that is much more fun and relatable. But seriously, isn’t it hard to relate to every super-hero character there is? Real-life consists of real people, and that’s what these two kids represent.I liked the way all of the ‘hows’ and ‘whys’ worked out the way they did. It all consists of question marks that dance gleefully around the unknown, and the unknown is the scariest thing in the world.I hope readers have a good time with this story, and I hope that they get out of it all I put into it: From the fiction to the fear.",
  "genres": [],
  "author": "R.W.K. Clark",
  "average_rating": "3.92",
  "url": "https://www.goodreads.com/book/show/33812185-overtaken"
}