{
  "title": "A Brilliant Rose",
  "description": "Two brothers. A brilliant, young lady. And a love that will not be denied.When ROSE LAWSON meets a handsome, and yet, intelligent man at the British Museum, she quickly fancies herself in love. However, upon hearing his name, anger boils in her veins.His name is familiar. Too familiar. In the worst possible way.Rose knows she ought to hate him…but her heart refuses, traitorously urging her to consider his plight.Torn from his old life, CHARLES DASHWOOD finds himself wandering the British Museum alone. Gone are his friends with whom he shared his interest in antiquities. Gone is their companionship.In his desolate state, he comes upon a young lady, who seems to share the very passion he is now forced to ignore. A stimulating conversation ensues, which takes a turn for the worse when she learns his name…or rather his twin’s name.All of a sudden, Charles is faced with a problem not of his own making. From what he can gather, Rose has met him - or rather his brother - before. And the circumstances couldn’t have been favourable.Will Charles be able to win Rose’s heart without betraying his brother? Will his brother stand idly by and watch as Charles loses the woman he loves in order to keep his secret?This tale by a USA TODAY bestselling author shows that while first impressions can be wrong…true love always triumphs.If you like bittersweet stories about a love so abrupt and unexpected that it unhinges your whole world and leaves you reeling, then you’ll love this instalment of Bree Wolf’s emotionally charged Forbidden Love Novella Series. Buy A BRILLIANT ROSE, grab a cup of tea, settle into your favorite reading spot and start this swoon worthy romance now!A Forbidden Love Novella Series#1 The Wrong Brother#2 A Brilliant Rose#3 The Forgotten Wife#4 An Unwelcome Proposal#5 Rules to Be Broken#6 Hearts to Be MendedTo Follow:#7 Winning her Hand#8 Conquering her HeartLove's Second Chance Series#1 Forgotten & Remembered - The Duke's Late Wife#2 Cursed & Cherished - The Duke's Wilful Wife#3 Despised & Desired - The Marquess' Passionate Wife#4 Abandoned & Protected - The Marquis' Tenacious Wife#5 Ruined & Redeemed - The Earl's Fallen Wife#6 Betrayed & Blessed - The Viscount's Shrewd Wife#7 Deceived & Honoured - The Baron’s Vexing WifeMore to follow:#8 Sacrificed & Reclaimed - The Soldier's Daring Widow (Bonus Novella)",
  "genres": [
    "Romance",
    "Historical Fiction",
    "Regency",
    "Novella",
    "Historical",
    "Historical Romance",
    "Fiction"
  ],
  "author": "Bree Wolf",
  "average_rating": "4.05",
  "url": "https://www.goodreads.com/book/show/33812958-a-brilliant-rose"
}