{
  "title": "Sesame Street: A Celebration of 40 Years of Life on the Street",
  "description": "The most beloved children's show of all time is turning 40! This celebration of four decades of groundbreaking educational programming invites fans young and old behind the scenes at 123 Sesame Street.In a book as lively, energetic, and appealing as the television show it chronicles, readers are treated to an inside look at every aspect of Sesame Street. Beginning with the initial idea for the show and the creation of the pilot episode and moving through its evolution over four decades, Sesame Street provides an insider's view of all of the delightful Muppet and human characters, as well as the writers, directors, producers, and all the other creative people who continue to make learning fun for generations of kids.Step behind the scenes and learn how the Muppets are built, how they move, how they speak, and what they think and feel. Did you ever wonder what Big Bird looked like in the first season of the show? Would you like to see the puppeteers behind (and under!) the set performing their roles? How about a picture of Bert being built? All of that and more, including facsimiles of the show's pioneering scripts and some of Jim Henson's original sketches, are included in this revelatory and adoring celebration. The 1,500 photographs?both in front of and behind the camera?come directly from the archives of the Sesame Workshop, and many of them have never before been published.For everyone who fondly remembers learning the alphabet and numbers from Sesame Street, for parents and grandparents of today's Sesame Street kids, and for avid fans and collectors of everything Sesame, this gorgeous book makes a gift to be treasured.",
  "genres": [
    "Nonfiction",
    "History",
    "Tv",
    "Biography",
    "Reference",
    "Pop Culture",
    "Childrens"
  ],
  "author": "Louise Gikow",
  "average_rating": "4.47",
  "url": "https://www.goodreads.com/book/show/3381198-sesame-street"
}