{
  "title": "Fractured Minds: A Case-Study Approach to Clinical Neuropsychology",
  "description": "Fractured Minds introduces the reader to clinical neuropsychology through vivid case descriptions of adults who have suffered brain damage. At one level, this is a book about the courage, humor, and determination to triumph over illness and disability that many \"ordinary people\" demonstrate when coping with the extraordinary stress of a brain disorder. At another level, it is a well-referenced and up-to-date textbook that provides a holistic view of the practice of clinical neuropsychology. Included are reader-friendly descriptions and explanations of a wide range of neurological disorders and neuroscientific concepts. Two introductory chapters are followed by 17 chapters that each focus on a specific disorder and include research, clinical assessment, rehabilitation, and a detailed case study. Disorders range across the full spectrum from common ones such as traumatic brain injury and dementia, to rare disorder such as autotopagnosia. Each of the 16 chapters retained from the first edition has been revised to reflect current research and clinical advances. Three new chapters on multiple sclerosis, Parkinson's disease, and Huntington's disease incorporate discussion of important current topics such as genetically-transmitted diseases, genetic counseling, gene transplantation, functional neurosurgery, and the complex ethical issues that go hand-in-hand with these new techniques. This informative and engaging book will be of interest to students of clinical psychology, neuropsychology, and neurology, health professionals who work with neurological patients, neurological patients and their families, and lay readers who are simply fascinated by the mind and brain.",
  "genres": [
    "Psychology",
    "Nonfiction",
    "Neuroscience",
    "Textbooks",
    "Science",
    "School",
    "Medicine"
  ],
  "author": "Jenni Ogden",
  "average_rating": "4.27",
  "url": "https://www.goodreads.com/book/show/1204361.Fractured_Minds"
}