{
  "title": "Bis das Eis bricht: Tantans Geschichte",
  "description": "Zwei Brüder mit außergewöhnlichen Fähigkeiten, eine verlorene Generation von Drachenkindern und eine große Bestimmung.Die anderen vergaßen im Verlauf der Jahre tatsächlich. Ich jedoch, ich vergaß nie.Durch Zufall und verbotenes Wissen entging Tantan Arreidas einst dem Zauber, der den Nebel des Vergessens über die Menschen legte. Nun berichtet die mutige Königstochter zum ersten Mal von all den Geheimnissen, die sie gemeinsam mit ihren Freunden in ihrer magischen Heimat entdeckte und die das Schicksal der jungen Menschen mit der Zukunft des gesamten Weltengefüges verknüpfen.Dabei erzählt Tantan auch ihre ganz eigene Geschichte und die ihres geliebten Zwillingsbruders Sinjhar. Wie es war, als Königskinder eines dem Untergang geweihten Volkes aufzuwachsen, vernachlässigt und gefangen im Konflikt zwischen dem König und seiner Ratgeberin, den die beiden so weit trieben, bis das Eis schließlich brach.__Die Fantasy-Reihe Der Weg des Heilers erzählt ein Märchen für Erwachsene. Darin erwarten dich zauberhafte Welten mit Bäumen als Behausungen, vielschichtige Hauptpersonen und die liebenswert-nervigsten Haustiere des Weltengefüges.Gemeinsam mit den jugendlichen Protagonisten träumst du dich in das Staunen und den Zauber deiner Kindheit zurück, folgst Joshi und Marcin auf ihrer gefährlichen Reise, die sie zu den tiefsten Geheimnissen des Weltengefüges führen wird, und erlebst dabei ein spannendes Abenteuer voller Magie und Drachen.Eine Bemerkung zur Struktur der Bei Bis das Eis bricht -- Tantans Geschichte handelt es sich um Band 3 der Reihe.In diesem Band springt die Handlung in die frühe Kindheit der Protagonisten zurück. In Ich-Form erzählt Tantan eine zauberhafte Geschichte voller Magie und Freundschaft und enthüllt Zusammenhänge zum Schicksal der jungen Menschen und ihrer Bestimmung. Aufgrund der Zeitebene kommen in diesem Teil der Geschichte keine Drachen vor, dafür neue magische Tiere.",
  "genres": [],
  "author": "Isa Day",
  "average_rating": "4.25",
  "url": "https://www.goodreads.com/book/show/33819531-bis-das-eis-bricht"
}