{
  "title": "Asher",
  "description": "****Don't miss this thrilling final book in the bestselling Wolves of Winter's Edge trilogy****  Asher Striker is full of dark secrets. His brothers think he’s quiet because he’s moody, but Asher had to learn at a young age that if he doesn’t focus on controlling the power within him, he could destroy everything and everyone around him. All he needs to do is help Gentry and Roman open up Winter’s Edge, and then go back to his solitary life. It would be safest for everyone that way. But when a mouthy, funny, beautiful woman shows up at his inn, Asher begins to rethink where his life should be headed. Ashlyn makes him want things he can’t have. She’s wrecking his focus, but little by little, she’s also breaking down his walls and easing the darkness within him. And now he has to decide whether her fixing him is a good thing, or something that will get them all killed.  Ashlyn Jenkins has a bone to pick with her best friend, Blaire. She’s on a mission to save her from the three obvious psychopaths she lives with now. Sure, the Striker brothers are hot, especially the oldest, Asher, but Ashlyn’s duty is to her friend, first and foremost. That is, until she realizes Blaire is very different from the way she used to be. Now, the more time Ashlyn spends with Asher, the more she wants to unravel the mysteries around him and the life Blaire has built for herself. And when she witnesses the darkness that dwells inside of the quiet, silver-eyed, growly giant, she thinks she might just be able to save him. But Fate has plans for her and Asher that will change the course of not only their lives, but also the town of Rangeley forever.   Content Warning: Explicit love scenes, naughty language, and piles of sexy shifter secrets. Intended for mature audiences.",
  "genres": [
    "Paranormal",
    "Shapeshifters",
    "Romance",
    "Paranormal Romance",
    "Fantasy",
    "Werewolves",
    "Supernatural"
  ],
  "author": "T.S. Joyce",
  "average_rating": "4.47",
  "url": "https://www.goodreads.com/book/show/33819797-asher"
}