{
  "title": "The Wrong Brother",
  "description": "Two brothers. One lady. And a heart torn in two.ISABELLA CARRINGTON has always favoured her mind over her heart.Meeting Charles Dashwood, she quickly decides that he is the one for her. After all, he has all the qualities she appreciates in a man; he is kind, honest, and most of all dependable.However, in the very moment, Isabella whispers her 'I do', her eyes catch the glimpse of another man. A man whose eyes look unnervingly familiar, and yet, stir a longing within her heart and soul she has never known.Just as she gives her hand to Charles Dashwood, her heart is stolen by none other than her husband's notorious twin, ROBERT DASHWOOD, VISCOUNT NORWOOD.When mind and heart do not go hand in hand, can there be a happily ever after?This tale by a USA TODAY bestselling author shows that the heart wants what the heart wants…even at the most inconvenient of times.If you like bittersweet stories about a love so abrupt and unexpected that it unhinges your whole world and leaves you reeling, then you’ll love this instalment of Bree Wolf’s emotionally charged Forbidden Love Novella Series. Download THE WRONG BROTHER for FREE, grab a cup of tea, settle into your favorite reading spot and start this swoon worthy romance now!A Forbidden Love Novella Series#1 The Wrong Brother#2 A Brilliant Rose#3 The Forgotten Wife#4 An Unwelcome Proposal#5 Rules to Be Broken#6 Hearts to Be MendedTo Follow:#7 Winning her Hand#8 Conquering her HeartLove's Second Chance Series#1 Forgotten & Remembered - The Duke's Late Wife (Rosabel & Graham)#2 Cursed & Cherished - The Duke's Wilful Wife (Anna & Edmond)#3 Despised & Desired - The Marquess' Passionate Wife (Ellie & Frederick)#4 Abandoned & Protected - The Marquis' Tenacious Wife (Henrietta & Connor)#5 Ruined & Redeemed - The Earl's Fallen Wife (Charlotte & Sebastian)#6 Betrayed & Blessed - The Viscount's Shrewd Wife (Beth & Tristan)#7 Deceived & Honoured - The Baron’s Vexing Wife (Madeline & Derek)More to follow:#8 Sacrificed & Reclaimed - The Soldier's Daring Widow (Meagan & Edward) (Bonus Novella)",
  "genres": [
    "Romance",
    "Historical Fiction",
    "Historical",
    "Regency",
    "Novella",
    "Historical Romance",
    "Clean Romance"
  ],
  "author": "Bree Wolf",
  "average_rating": "3.60",
  "url": "https://www.goodreads.com/book/show/33812946-the-wrong-brother"
}