{
  "title": "On the Border with Crook",
  "description": "“Among the ten best Western books of all time. It has that rare combination, a personal reminiscence covering important events, and a thoroughly scholarly and reliable treatment.\" — Westerners Brand Book For fifteen years John G. Bourke served under General George Crook as they fought side by side on the frontiers of the United States from Mexico to the Canadian border. Crook and his troops clashed against some of the most formidable opponents of the nineteenth century during the Great Sioux War and the Apache Wars, including Sitting Bull, Crazy Horse and Geronimo. This fascinating account of these times brings to life the frontier of the Old West, with vivid descriptions, humorous anecdotes and deadly encounters. On the Border with Crook is essential reading for anyone interested in not only Crook’s military campaigns of the American Indian wars but also anyone wishing to find out how settlers and communities survived and prospered through adversity. “Bourke was a meticulous observer as well as a superb and engrossingly interesting writer. He would also colour his material with lyrical and poetical observations upon the natural world, including the landscape and the weather, and also with copies of such official correspondence he deemed important such as orders, rosters, newspaper clippings and his own drawings to accompany his texts. Furthermore it would all be laced with his descriptions - sometimes with humour - of characters, military, civilian and Indians met along the way.” The English Westerners’ Society John Gregory Bourke was a captain in the United States Army who was awarded the Medal of Honor for his services during the American Civil War. After he had completed fifteen years of duty in the American Indian Wars he became a prolific author, writing a number of accounts about his time in the army as well as ethnographical studies of the American West. On the Border with Crook was first published in 1892 and Bourke died four years later in 1896.",
  "genres": [
    "History",
    "Nonfiction",
    "American History",
    "Biography",
    "Westerns",
    "Military History",
    "American"
  ],
  "author": "John G. Bourke",
  "average_rating": "4.17",
  "url": "https://www.goodreads.com/book/show/33834478-on-the-border-with-crook"
}