{
  "title": "Who's Afraid Too?",
  "description": "'Gripping, fast-paced, and completely unexpected, Who's Afraid has more twists than a tornado. I loved this story!' Darynda Jones, New York Times bestselling author of the Charley Davidson series'Truly one of the best in the genre I have ever read.' Oscar-nominee Lexi Alexander (Green Street Hooligans, War Zone, Arrow, Supergirl)Tommi all bark, all bite . . . and now she's BACK!After the worst family reunion in history, Tommi needed some space. She's spent the last few weeks trying to understand her heritage - the one that comes with a side order of fur - as well as learning about her Maori ancestry and how she can connect to it. But she can only escape for so long. When an unspeakable evil returns, Tommi will need every piece of knowledge and all the skills she has. With the help of allies old and new, frenemies both helpful and super-annoying, she's going to take the fight to the enemy . . . Praise for Maria Lewis 'It's about time we had another kick-arse werewolf heroine - can't wait to find out what happens next!' Keri Arthur'Journalist Maria Lewis grabs the paranormal fiction genre by the scruff of its neck to give it a shake with her debut novel Who's Afraid?' The West Australian'Underworld meets Animal Kingdom.' ALPHA Reader 'Lewis creates an intriguing world that's just begging to be fleshed out in further books.' APN 'If you haven't heard about Maria Lewis's new urban fantasy novel Who's Afraid you must have been living under a rock.' Good Reading Magazine'An intriguing take on a classic monster with vibrant, modern characters.' Sci Fi Bulletin'Pay attention urban fantasy fans - Maria Lewis is a name you'll want to remember.' One More Page 'Definitely worth reading over and over again, as well as buying multiple copies. Great stocking stuffers, those werewolf books.' Maria Lewis's mum",
  "genres": [
    "Fantasy",
    "Urban Fantasy",
    "Paranormal",
    "Werewolves",
    "Supernatural",
    "Romance",
    "Adult"
  ],
  "author": "Maria  Lewis",
  "average_rating": "4.26",
  "url": "https://www.goodreads.com/book/show/33829100-who-s-afraid-too"
}