{
  "title": "The Purification of The Heart",
  "description": "Updated cover edition found here.Islamic mysticism strives to separate the beginninglessly eternal from that which originates in time. This is to be in the divine presence completely. Everyone has a fatal flaw and we will be tested again and again in life with this flaw until we are able to overcome it, Godwillingly. Everyone is seeking contentment in their life; The manifestation of ‘ya salam.’ Yet not everyone knows were to look or who to find. The saint is a friend of Allah, who is an embodiment of the revealed law. In motivation by divine love, a saint follows all of the way of the prophet Muhammad (SAW) strictly. It is because of the balance of applying both the revealed law and Sufism that you gain a balanced understanding and do not become extreme. Every believer is a lover of Allah and only the hearts that are basking in divine love will be the ones that readily comprehend what is written in this book. It is the illustrious souls that think of ways in which to help other humans become closer to Allah. In order for spiritual growth you not only need to look after your outward in keeping hygiene and tidiness in dress but you need to go inward and cleanse and purify your heart and soul of all impurities. These impurities come about as spiritual sicknesses. The revealed law is an outward knowledge but Sufism is an inward knowledge. There are many books out there that can help you easily understand and apply the outward knowledge but as for the inward knowledge, one can endeavour to explain it but personal experience explains it the best. This uncluttered contemporary manual consists of six chapters, an appendix and a glossary. This text explores how we can refine our character, discipline our soul, and how we can break the two desires and completely purify our egos. It is recommended that we go through the means of a spiritual mentor because we are not all spiritual enough to help ourselves, yet with a guide who is more closer to God, we will become more confident and progress more speedily. A beautiful example of a real Sufi sheikh is the deceased Sheikh Nazim al Haqqani (RA) of Cyprus and with his spiritual guidance and permission, this book has been written and published. All actions are rooted in intentions and intentions are routed in the heart so essentially actions are emanated from the heart, as it is the place of intention. When asked about your actions on the day of judgement you will be asked about what is in your heart and only a sound heart will be of benefit on that day. The heart wants to remember Allah but when this is not done the heart becomes sick and then dies. It is an organ that is designed to be in a state of stillness. The company of the good ones is the exercise of the hearts. The sound heart is a heart that is purified from blemishes and defects with reference to the spiritual heart that is centred in the physical heart. Wrong action irritates the heart when you don’t want other people to see it. The heart is a source of knowledge itself. Knowledge is not centred in books, but it is centred in the heart. Technology itself is something that emulates the abilities of spiritual teachers. This is because the centre of human consciousness is the heart not the brain itself, but a 2-way communication between the two; the heart and the brain. This occurs due to the fact that the heart needs nourishment. Heedlessness is a perfect way to starve the spiritual heart. The crime itself is the punishment as a person has to live with the consequences of their wrong actions. They will use many ways to cover this up and this is a state of heedlessness that makes one forget their sensual nature of their heart. The more cut off you become, the sicker the heart gets.",
  "genres": [],
  "author": "Danyal Nicholson",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/33830122-the-purification-of-the-heart"
}