{
  "title": "Read Em and Weep Book One: Serial Killer",
  "description": "A rotten childhood. A comic book crime spree. One last chance to get his killer reputation.London, 1975. Dave Maudling escaped his rotten childhood by losing himself in comic books. Now an editor for the same comics that served as his escape, he uses his window into the minds of youth to hide dangerous clues in his most popular strip. But when his pipe bomb instructions reach the wrong demographic, Dave takes his plot to a whole new audience …The 1970s – a dangerous time for kids. An even more dangerous time for adults.But when a suspicious reporter gets in the way of his sweet retribution and the fur-draped phantom of his dead mom nags him from beyond the grave, he has no choice but to think outside the panels. If he fails, he'll never salvage his reputation as a comic genius and a killer.Written by Pat Mills (creator of Action and 2000 AD) and Kevin O’Neill (2000 AD’s art editor). Pat and Kevin also created the cult-classic superhero hunter, Marshal Law (Marvel and D.C. Comics).Praise for Serial Killer\"Just finished this twisted, very funny novel - 1st in a series by Pat Mills and Kevin O'Neill.\" Ian Rankin, Author Inspector Rebus Series\"This is a book with teeth, it will flick you in the balls with a towel and get off with your girlfriend behind your back...you will devour it and ask where the next serving is coming from.\" Antony Esmond, Reviewer DownTheTubes.com“Any fan of British comics or satire should buy this book.” Amazon reviewer“Apart from the disguised history of 70's British comics, you get a bizarre murder mystery and some brilliantly realised characters with some very strange peccadilloes. All the dark humour evident in Marshal Law and Nemesis the Warlock is here in spades.” Amazon reviewer“However you define this book - comedy, period drama, thriller, expose - it's most definitely a page turner which I couldn't put down.” Amazon reviewer\"Buy this book. I guarantee that once you finish it you will be aching for the sequel.\" Amazon reviewer\"What starts as a grotesque parody of the early days of the comic industry in this country slowly settles into a black comedy hybrid of American Psycho, Kill Your Friends and Black Books.\" Amazon reviewer\"Once Pat gets his hook into you, you have to keep reading.\" Amazon reviewer\"When the talents behind the darkly comic Marshal Law write a novel about a lazy serial killer, a murder mystery, and the 70s era of British comics you know you're in for a treat.\" Amazon reviewer\"It's dark, it's twisted, if you need content warnings just stop now\" Amazon reviewer",
  "genres": [],
  "author": "Pat  Mills",
  "average_rating": "3.89",
  "url": "https://www.goodreads.com/book/show/33832913-read-em-and-weep-book-one"
}