{
  "title": "Filthy Movie – The Most Sadistic Short Story on the Market",
  "description": "This is a very violent and sadistic story that should only be read by the seasoned extreme-horror reader. This isn’t some bogus disclaimer to draw in readers. I truly don’t want someone to get offended that isn’t familiar with the level of brutality portrayed in this story. Christie Silvers and Duncan Bradshaw are on a first date and decided to go back to Duncan’s hotel room after dinner. Christie is a beautiful girl with long, blonde hair and emerald green eyes. She is intelligent and full of life. Unbeknownst to her, Duncan is married and has a habit of bending the truth. He’s an average man with red hair, and he suffers from social awkwardness and low self-confidence. Never in his wildest dreams did he think he’d be scoring with such a hot chick. All his lies were paying off, and this was going to be the night of his life… so he thought. Unfortunately for him, the hotel owner, Henry, is a sadistic killer who can’t wait to turn his dream into a hellish nightmare. I wrote Filthy Movie for Matt Shaw’s project The Devil’s Guests. Unfortunately, it was too sick, and the length interrupted the flow of the story, so two-thirds was cut. This is the original, full-length version before being adapted to his book. Matt Shaw has also included this version to the end of his book, but with the possibility of backlash in the form of negative reviews and complaints, there’s no guarantee if it will remain, so I thought I’d release it separately and include chapter breaks for an easier read, and my thoughts on writing this story. I’ve also included a brief statement from my editor. If you’d like to see how Filthy Movie has been adapted to Matt Shaw’s book The Devil’s Guests, featuring numerous guest authors, it’s available on Amazon.",
  "genres": [
    "Horror",
    "Splatterpunk",
    "Short Stories"
  ],
  "author": "Wade H. Garrett",
  "average_rating": "3.55",
  "url": "https://www.goodreads.com/book/show/33852240-filthy-movie-the-most-sadistic-short-story-on-the-market"
}