{
  "title": "Get Control of Sugar Now!",
  "description": "With over 30 years' experience in helping people successfully change their lives for the better, Paul McKenna Ph.D. is perfectly placed to help program your mind to gain control over cravings and make healthier choices. This accessible guide - offering simple tips and exercises for change and including a free hypnotic trance download - is all you need to reduce your sugar intake and take the first step towards a healthier lifestyle.What people are 'I have lost 1/2 a stone in a month with just doing this' -- ***** Reader review'My biggest addiction is sugar, and after a whole week of listening to the mind programming audio included, I found myself making better choices and eating less sugar' -- ***** Reader review'What can I say but McKenna does it again' -- ***** Reader review'One of the best books by Paul Mckenna, so savvy and yet so simple and applicable. A must read' -- ***** Reader review***************************************************************************************Do you have an insatiable sweet tooth?Are you chained to cravings you can't control?THEN THIS BOOK AND AUDIO DOWNLOAD ARE FOR YOU!Paul McKenna has spent years researching and developing a system to that can help you get more control over sugar and make healthier choices.SCIENTISTS AGREE - SUGAR IS KILLING MORE OF US EVERY DAY!Now you have a choice.This book will walk you step by step through a series of simple yet powerful techniques to help you learn how to gain control over cravings and embark on a healthier lifestyle.In addition, the book comes with a free hypnosis audio download which uses the latest psychological techniques to reset your mind and change the way you relate to certain foods. Each time you listen, you will be programming your mind for success. IF YOUR DEVICE SUPPORTS IT, YOU WILL FIND AUDIO AND/OR VIDEO IN THIS EBOOK. IF YOUR DEVICE DOES NOT, FOLLOW INSTRUCTIONS TO SAVE THE MATERIALS DIRECTLY TO YOUR COMPUTER, OR TO STREAM VIA YOUR SMARTPHONE OR TABLET.",
  "genres": [
    "Nonfiction"
  ],
  "author": "Paul McKenna",
  "average_rating": "4.04",
  "url": "https://www.goodreads.com/book/show/33840485-get-control-of-sugar-now"
}