{
  "title": "Anxiety Girl: The must-read book for anxiety sufferers and chick-lit lovers alike. The first book in the critically acclaimed, much-loved series.",
  "description": "From best-selling author, Lacey London, comes the story that everybody is talking about and the critics are raving over.Join Sadie Valentine as she discovers who she really is and learns the true meaning of friendship...Loving life in the glitzy Cheshire village of Alderley Edge, Sadie Valentine thought she had it all.With her best friend, Aldo, for company, Sadie spends her time sipping bubbles amongst the glitterati in her many local bars and restaurants. However, unbeknown to the outside world, a series of unfortunate events cause her to fall into a lonely hole.Keeping her mask in place on a daily basis proves harder than Sadie anticipates, and when she is dealt yet more blows, her positivity starts to crumble.Despite her efforts to battle her demons, Sadie soon realises that sometimes it’s not quite as simple as picking yourself up and carrying on.With Aldo by her side, can Sadie crawl out of the impossibly dark hole and take back control of her life?The next book in the series, Anxiety Girl Falls Again, is available now.The other books in the Anxiety Girl series are exclusive to Amazon.A note from the author...\"Anxiety and depression can affect people for any period of time and in varying degrees of severity. I wanted to create a story which showed that mental health issues can happen to anyone, regardless of who you are or what you have. I also wanted to address that there aren’t any rules with anxiety.Although no two cases of anxiety are the same, I really hope Anxiety Girl can help other sufferers to realise there is a light at the end of the tunnel and that they’re not alone in their struggles.The characters in this novel might be fictitious, but the feelings and emotions experienced are very real.\"PRAISE FOR THE ANXIETY GIRL SERIES -\"A brilliant read that will keep you on the edge of your seat!\"\"Phenomenal!\"\"As an anxiety sufferer, I kept thinking... Yes, I feel that too.\"\"Entertaining, sometimes desperately sad, very often uplifting and hugely life-affirming.\"",
  "genres": [
    "Fiction",
    "Contemporary",
    "Mental Health",
    "Self Help",
    "Amazon"
  ],
  "author": "Lacey London",
  "average_rating": "3.91",
  "url": "https://www.goodreads.com/book/show/33851955-anxiety-girl"
}