{
  "title": "Wolf Valley Raiders Complete Series",
  "description": "A wolf needs his mate! Come along for the ride, as four hot, sexy wolf shifters, finally find their one true mate.  Redeem the Wolf  Kurt has made mistakes, big mistakes. Like the time he chased his cousin up into the mountains and nearly caused her death, all for the chance of power in the otherwise lawless town of Wolf Valley. But his actions only proved one thing, he would never be alpha material. He doubts he will ever be fit for anything since he ended up stuck in the body of his wolf for far too long. A wolf who has now abandoned him.  One woman saved him; she coaxed the man out, bringing him back from the brink of insanity. He was sure she was his mate, but she couldn't be, because she left even before he could thank her. All he has to hold onto is the memory of her face, a face he paints over and over again, a face he may never set eyes on again.  To Catch A Wolf  At last, after what seems like an eternal wait, Hugo has caught his mate. But not in any romantic way, oh no, she’s lying face down in the dirt after trying to rustle his cattle with the other wolf raiders. All she wants to do is rip his throat out; he knows that because she’s telling him explicitly, with some extremely unladylike language. All he wants to do is pick her up, throw her over his shoulder, and take her to his bed. There he will indulge in such primal pleasures, he will capture her heart too. Right?  If only life was that easy.  Damn it! Bliss Merric has just about had it! Her life has never been her own, she has always put her family first. That is why she is out here, in the dark with her brothers, trying to rustle cattle. Well, at least she was with her brothers, but they have now abandoned her and left her alone. With her mate!  It’s not what she wants; he’s not what she wants. But when you’re face down in the mud with his big, toned, muscly body pinning you down... No! Don’t think of him like that. He is the enemy, she has to fight her way out of this.  Can Hugo catch his wolf, or will she run out of his life forever?  Reclaim the Wolf  Cole is determined to start over. Yes, he did steal from the people of Wolf Valley, but now he's out to prove himself to be a good man. And he plans to start by offering to repair the damage to the property of one of his victims.  It all sounds so easy, until she pulls a gun on him. Although that's not what renders him unconscious, oh no, that would be the blow to his head!  Trying to get by as best she can, despite the personal heartache she has experienced at the downfall of Wolf Valley, Kira isn't interested in finding her mate. What's the point when all the good men have left town? So imagine her disgust when called on for help, by her friend Fara, only to find the man lying unconscious on the ground is one of those raiders. And her mate!  Maybe she should simply ignore the mating bond. But how is that possible when all she wants to do is drag him off to bed. As for her wolf, talk about making a fool of yourself while doing a happy dance.  Can these two ever begin to understand each other? And if they do, will Cole become the long awaited alpha of Wolf Valley now he's found his mate? Can he right the wrongs of the past and help Kira mend her broken heart?  Awakening the Alpha  Will Wolf Valley finally have an Alpha?  Riley is convinced that if he can find his mate he will finally be able to restore order to Wolf Valley.",
  "genres": [
    "Paranormal",
    "Shapeshifters"
  ],
  "author": "Harmony Raines",
  "average_rating": "4.40",
  "url": "https://www.goodreads.com/book/show/33851791-wolf-valley-raiders-complete-series"
}