{
  "title": "Gym Wanker: A Foolproof Guide to Gym Excellence: A Close Observation of Human Behaviour",
  "description": "AMAZON TOP 500 BEST SELLER! A Very Funny Book - Howling With Laughter; Comedian Russell Kane A Book Of Truths, An Encyclopedia Of Gym Life 5 Stars!!; Former Miss Olympia Competitor Kimberley Anne Jones The absolute first of its kind! A book dedicated to life within the gymnasium. In this book author Kevin Horak takes us through 60 different types of Gym W**ker that exist within modern day gym life; from sweaty w**ker, to the very fast w**ker, trendy tattoo w**ker and of course the Donald Trump hair manoeuvre w**ker. This highly funny book makes fun of gym life and the author grades himself as a Level 3 Class w**ker. Throughout the book there are tick boxes for the reader to indentify how big a gym w**ker they are complete with a scoring system to see if they can achieve a Level 10 Max Rating! At times somewhat irreverent and with examples of human behaviour that will make you shiver, Horak has taken modern day living and put a humorous twist on it written equally for women as much as men. With amazing illustrations throughout by award winning artist Lyndon White this book is what the fair gym folk have been waiting for and let s face it, we all know someone who dedicates their life to the gym (or say they do!). TAKEN FROM THE REAR Have you got what it takes to become an accomplished gym w**ker? You may already even be one and never knew! Being a gym wa**er is NOT for everyone, for some it s a natural progression of their personality and for others it s almost a calling. Advanced level w**kerbility can take years of solid graft and determination be warned and prepared; you will never master it all, not everyone can be a total gym w**ker. Within this book there are pointers for the amateur w**ker right up to the more advanced where you can try a variety of w**ker combinations; some w**kerish styles will take time, practice and patience. Do not rush into your w**ker characterisms, start with little gym w**ker steps first. If you are determined enough becoming an exceptional gym w**ker may well be within your grasp, people may not say it, but they will look at you and say to themselves look at that absolute w**ker. Long may you reign you complete w**ker.",
  "genres": [],
  "author": "Kevin Horak",
  "average_rating": "4.40",
  "url": "https://www.goodreads.com/book/show/33852297-gym-wanker"
}