{
  "title": "Nameless Fate",
  "description": "Harper might get an uncanny gut feeling every now and then, but that didn’t mean she believed in portents, and certainly not the kind that got her abducted. As Harper gripped the bars of her cage, in the alien prison; it sunk in that she seriously had been kidnapped from Earth, to become the fated consort of some alien prince. This wasn’t some elaborate prank, or government experiment. True to form, Harper pissed off the tyrannical king with her refusal. Now she found herself at the mercy of convicts, locked away and forgotten in the bowels of a mountain. Harper’s gaze fell on a shadowy beast of a man, sitting casually on the rundown catwalk. The imposing man looked like he ruled the prison. He was the color of midnight, and his eyes were that eerie arctic blue, that was nearly colorless. Harper shivered as he regarded her. All Nameless knew was the Hold, with its misery and struggle. He never wanted to keep a female, surviving was hard enough, but that was before the Pink Pearl dropped into his world. Nameless had never seen anything like the stunning exotic little creature. Not only was she the catalyst for strange dreams and revelations about his past, but she made him feel. He had to have her. >Harper wanted free of the alien prison, and she wanted to go home, except Nameless wasn’t prepared or willing to let her go, even if she hated him because of it. He owned every part of her, and bound her to him, in ways that could never be undone, collar or no collar. In her wildest dreams, Harper never imagined the twists destiny could take, or that she would find soul deep satisfaction with such a nameless fate. Follow Harper and Nameless as they struggle to get free of the Hold, and seek their revenge on the despot responsible for putting them there.  Note: This book contains erotic scenes where the dominant hero bends the heroine to his will. What pisses her off the most, is that she likes it.",
  "genres": [
    "Aliens",
    "Science Fiction",
    "Romance",
    "Fantasy",
    "Erotica",
    "Science Fiction Romance",
    "Paranormal"
  ],
  "author": "Stephanie  West",
  "average_rating": "3.91",
  "url": "https://www.goodreads.com/book/show/33852466-nameless-fate"
}