{
  "title": "Brit Party Anthology (includes Boy Toys)",
  "description": "'Maggie's Menage' by Lacey Thorn Maggie had spent a lifetime trying to win the love and affection of her father, but nothing seemed to work. Now he was asking her to seduce and marry one of two men that he had selected for her...for the good of the family name and company. But Maggie has other plans. Plans that will leave both men thinking of her as something other than a wife, and leave her father's plans for marriage in ashes. Alex and Patrick were there to investigate Dom Houston and through the carelessness of his assistant managed to get in to see the man himself. But it was the blonde-haired beauty that commanded their attention from the get-go. And when she arrived at their hotel room later in the day, neither was willing to walk away. If Maggie wanted a menage then they were more than willing to give it to her. But for two of them, it would be more than they could have ever imagined. 'Boy Toys' by Brynn Paulin Dana's job title is scientist not babysitter. She's irritated when her boss slates her to accompany department bad boys, Christopher and Jason, to a meeting in London on her weekend off. Since her job transfer to England, she's hidden her attraction to the much younger men. Unfortunately, the attraction seems to be growing every day and every night she fantasizes about them. Three days virtually alone with them will be no fantasy and might instead be an embarrassing disaster. But... 'Best Mates' by Ashley Ladd Lovers Alec Russert and Kevin Cosby feel horrible for their best mate, Jennica Chapman when her current beau dumps her. And yet, they're glad he's out of her life. Unfortunately, thirty-six-year-old Jennica thought this was her last chance to have a baby, and she's much more upset about this than losing the boyfriend. As Alec is feeling his biological clock also, he suggests to Kevin that they help her out of her predicament. 'The Wager' by Dakota Rebel Menage-a-Trios with a twist, and a vampire bite. A weekly game of Billiards between a couple becomes interesting when the stakes get raised to include a pair of friends in the payoff. Sadie and Will are vampires who have a wager based on a weekly billiards game they play. Their stakes are always sexual and this week will be no different. But for this week's wager, they decide to include a couple of their friends, Dave and Tony, in the payoff. 'Four Play' by Desiree Holt How many is too many, or is it not enough? She loved the menage that her lover Michael Collins had introduced her to, but now here they were, spending a week at Duncan MacLaughlin's cottage in Scotland and Holly Martin wasn't sure she was ready for the surprise he promised her. 'Monsoon Fever' by Lisabet Sarai Divine temptation lies in wait in an ancient and mysterious land. In their first years together, Priscilla and Jonathan enjoyed a marriage based as much on physical passion as on love. However, the travails of business and the tribulations of the Great War have taken their toll. When Jon's father dies in faraway India, the couple travels to the father's isolated Assamese tea plantation to settle his affairs. Far from the bustle and distraction of London, left alone to endure the monsoon rains while Jon struggles to complete the final harvest, Priscilla realizes how much she misses Jon's touch.",
  "genres": [
    "Anthologies",
    "Menage",
    "Romance",
    "Erotica",
    "Adult",
    "Erotic Romance"
  ],
  "author": "Ashley Ladd",
  "average_rating": "3.75",
  "url": "https://www.goodreads.com/book/show/3384587-brit-party-anthology-includes-boy-toys"
}