{
  "title": "BALI - Zen Traveller: A Quick Travel Guide",
  "description": "BALI IS MAGICAL! - beautiful, quiet, relaxed, joyful and inspiring… That is if you get away from the tourist crowds in the South and begin to explore the \"real\" Bali and her wonders…. This Smash hit #1 Bestseller that beat out \"Lonely Planet\" and \"Eat, Pray, Love\" and is continuously listed in the \"Most wished for\" lists for Bali books will take you on a tour around the island to explore the quiet, magical parts of Bali, far away from the tourist crowds. A Quick Guide… Zen Traveller BALI is a quick guide, not an in-depth 500 page travel guide book a la Lonely Planet, Fodors and Frommers. It does not contain extensive lists of tour companies or accommodations for each area, tough a few are mentioned throughout the book based on the personal experiences of the author. Instead, this Bali guide from the Zen Traveller series by bestselling travel writer and Top 100 Business Author Gundi Gabrielle, is a charming, fun 2-hour read that will show you what's where and how to best plan your trip. Zen Traveller Bali will give you a good overview over the different regions with things to do along the way, practical logistical information and tips on where to get away from it all....Exploring the “Real” Bali The South East around Candidasa and the diving paradise of Amed. The sleepy fishing villages along the East Coast with lush palm tree vegetation. You become relaxed just looking at it.... The North Coast with many little gems to visit and a gorgeous countryside, incl. a pearl farm that employs only women, an award winning coral restoration project recognized by the United Nations, a winery, turtle and bee conservation projects and so much more.... The West Bali National Park inviting to hiking, kayaking, and the remote diving/snorkeling island of Menjangan. A bird watcher's paradise, lush with wildlife and unusual fauna. The rugged West Coast, a surfer's paradise, with quiet, chill villages like Medewi - the way Bali used to be before tourism overran the South. And, of course, the spectacular volcanic mountain ranges in the Inland regions with massive lakes, luscious rain forest and gorgeous rice terraces - absolutely breath taking! Bali Indonesia will Enchant you Wherever you go, Bali will enchant and inspire you with stunning vistas, soaring heights, and a vibe just quiet and relaxed - to get away from it all.... Sadly most visitors never get to see that side of Bali and instead spend all their time on overcrowded beaches, parties and shopping malls in the South - Kuta, Seminyak or Sanur. If you want to see the \"real\" Bali and all her magnificent wonders, this book will be for you. Zen Traveller BALI covers logistical and planning help, so you know what to expect on your first visit to Bali. Communication, visa, currency/banking, accommodation, transportation, wifi/mobile usage and much more will be covered in Chapter 1. Next follows Ubud, the cultural centre of Bali, and still charming and lovely, despite heavy tourism influx.",
  "genres": [
    "Travel"
  ],
  "author": "Gundi Gabrielle",
  "average_rating": "3.62",
  "url": "https://www.goodreads.com/book/show/33852534-bali---zen-traveller"
}