{
  "title": "Runaway Groom",
  "description": "For one charming playboy, getting cast on a Bachelor-esque reality TV show is the shock of a lifetime—until he finds love where he least expects it. And now the chase is on!“Romantic comedy at its finest . . . Readers will not want to put it down.”—USA Today’s Happy Ever After blog Gage Barrett’s reputation as a ladies’ man has been greatly exaggerated, but none of that matters after a drunken bet lands him on Jilted, a reality TV show that matches runaway grooms with wannabe brides. Now he’s stuck at a Hawaiian resort with nineteen women competing to drag him back to the altar—and one contestant who’s even more miserable than he is. Gage has no idea how feisty, independent Ellie Wright wound up in the cast, but it’s obvious she hates his guts. And if there’s one thing Gage likes, it’s a challenge. . . . Ellie can’t believe she let her best friend talk her into exchanging her dignity for a glorified bikini contest. Still, she could use the exposure—her business is struggling—and she’ll probably be one of the first to get eliminated anyway. But Gage isn’t the shallow jerk Ellie anticipated—and he’s in no rush to send her home. As stolen kisses turn into secret trysts, she finds herself losing track of what’s real and what’s for the camera. With the wedding finale looming, this runaway groom is tempting Ellie to start believing in storybook endings.Praise for Runaway Groom “Lauren Layne gets the red rose for this one, and fans of The Bachelor will fall in love with this thoroughly charming story.”—Kate O’Keeffe, bestselling author of One Last First Date “It’s the perfect beach read—or snow day read, if you’re stuck in cold weather like me!”—All About RomanceLauren Layne’s New York Times bestselling Oxford Novel series can be read in any IRRESISTIBLY YOURSI WISH YOU WERE MINESOMEONE LIKE YOUI KNEW YOU WERE TROUBLEI THINK I LOVE YOUDon’t miss any of Lauren Layne’s hot The Love Unexpectedly  BLURRED LINES | GOOD GIRL | LOVE STORY | WALK OF SHAME | AN EX FOR CHRISTMASThe Sex, Love & Stiletto  AFTER THE KISS | LOVE THE ONE YOU’RE WITH | JUST ONE NIGHT | THE TROUBLE WITH LOVEThe Redemption  ISN’T SHE LOVELY  | BROKEN | CRUSHEDThe I Do, I Don’t  READY TO RUN | RUNAWAY GROOM Includes an excerpt from another Loveswept title.",
  "genres": [
    "Romance",
    "Contemporary",
    "Contemporary Romance",
    "Chick Lit",
    "Adult",
    "Audiobook",
    "Friends To Lovers"
  ],
  "author": "Lauren Layne",
  "average_rating": "4.09",
  "url": "https://www.goodreads.com/book/show/33851543-runaway-groom"
}