{
  "title": "Nomad Redeemed: A Kurtherian Gambit Series",
  "description": "Sawyer Brown is no more, but he was just the minor opening act...  Terry Henry and Charumati (Char) have to deal with her Alpha coming back, the new refugees getting settle in the town and .. Beer!  With the FDG doubling in size, Terry Henry needs to bring about a little organizational structure to the group.While also deciding how to have that conversation with Char about her lineage...  Not sure how that is going to go, Terry Henry had better figure it out, or he is going to be up to his armpits in Werewolves and won't be sure if he can depend on his one ace-in-the-hole.  Or not.  Set in the Kurtherian Gambit Universe, Nomad Redeemed continues the Terry Henry Walton Chronicles, the time between the WWDE and the return of Michael to earth.   ** As noted in other series set in the Kurtherian Universe, there IS cursing in this book, occasionally, it's funny, too. **   Kurtherian Gambit Series Titles Include:  Death Becomes Her The Kurtherian Gambit 01  Queen Bitch The Kurtherian Gambit 02  Love Lost The Kurtherian Gambit 03  Bite This The Kurtherian Gambit 04  Never Forsaken The Kurtherian Gambit 05  Under My Heel The Kurtherian Gambit 06  Kneel Or Die The Kurtherian Gambit 07  We Will Build The Kurtherian Gambit 08  It's Hell To Choose The Kurtherian Gambit 09  Release The Dogs Of War The Kurtherian Gambit 10  Sued For Peace The Kurtherian Gambit 11  We Have Contact The Kurtherian Gambit 12  FUTURE (21 books planned)  My Rides A Bitch The Kurtherian Gambit 13  Don't Cross This Line The Kurtherian Gambit 14  NEVER SUBMIT The Kurtherian Gambit 15 (Jan/Feb 2017)  **Other Series**  The Dark Messiah - Michael's Return The Second Dark Ages 01 Winter 2016/2017    SHORT STORIES  Frank Kurns Stories of the Unknownworld 01 You Don't Mess with John's Cousin (read before TKG08)  Frank Kurns Stories of the Unknownworld 02 Bitch's Night Out (read before TKG10)   The Boris Chronicles With Paul C. Middleton  Evacuation Retaliation Revelation Restitution 2017   Anthologies  Glimpse Honor in Death (Michael's First Few Days) See on Amazon: kurtherianbooks.com/Glimpse_Amazon_US  Beyond the Stars: At Galaxy's Edge Tabitha's Vacation See on Amazon: kurtherianbooks.com/Beyond_Stars_Amaz...",
  "genres": [
    "Science Fiction",
    "Fantasy",
    "Urban Fantasy",
    "Paranormal",
    "Post Apocalyptic",
    "Shapeshifters",
    "Dystopia"
  ],
  "author": "Craig Martelle",
  "average_rating": "4.43",
  "url": "https://www.goodreads.com/book/show/33858803-nomad-redeemed"
}