{
  "title": "Before You Break",
  "description": "Looking for Alaska meets Thirteen Reasons Why in this poignant novel exploring secrets, sisterhood, and the power of the past to heal or destroy us. Two sisters. A haunting tragedy. And a past that won't let them go... Eight years after tragedy shattered their family, the McKenna sisters are still broken. Responsible Lena flees to college on a photography scholarship, hiding her past--and her heart--behind her camera lens. Reckless Lux escapes into a world of pills, parties, and dangerous boys--anything to forget the darkness trapped inside her own head. But when their father suffers a massive heart attack, Lena returns to a house haunted by resentment, secrets, and lies. Her father is wracked by guilt. And her sister is hiding something. What really happened that terrible day? After a charming former crush reenters her life, Lena glimpses a future that just might include a love she never expected--or believed she deserved. But the past won't let either sister go. As devastating secrets resurface, Lux spirals dangerously out of control. To save her sister, Lena must risk everything to confront the ugly truth--before it destroys them both. Before You Break is a Strong at the Broken Places novel. It is a companion to Beneath The Skin. They can each be read as a stand-alone in any order. *Trigger Deals with themes of suicide, mental illness, and drug abuse.Recommended for 16+* \"I loved this book. It was truly amazing.\" -Lit This &That \"A well-written, moving tale that provides a candid look at troubled family relationships.\" -Cassidy's Bookshelves \"As gripping as any thriller.\" -Goodreads reviewer \"Just buy this book. Seriously. The treatment of mental health issues is vivid, empathetic, and hopeful.\" -Goodreads reviewer",
  "genres": [
    "Contemporary",
    "Fiction",
    "Young Adult",
    "Romance"
  ],
  "author": "Kyla Stone",
  "average_rating": "4.02",
  "url": "https://www.goodreads.com/book/show/33865650-before-you-break"
}