{
  "title": "Red Famine: Stalin's War on Ukraine",
  "description": "The momentous new book from the Pulitzer Prize-winning author of Gulag and Iron Curtain.In 1932-33, nearly four million Ukrainians died of starvation, having been deliberately deprived of food. It is one of the most devastating episodes in the history of the twentieth century. With unprecedented authority and detail, Red Famine investigates how this happened, who was responsible, and what the consequences were. It is the fullest account yet published of these terrible events.The book draws on a mass of archival material and first-hand testimony only available since the end of the Soviet Union, as well as the work of Ukrainian scholars all over the world. It includes accounts of the famine by those who survived it, describing what human beings can do when driven mad by hunger. It shows how the Soviet state ruthlessly used propaganda to turn neighbours against each other in order to expunge supposedly 'anti-revolutionary' elements. It also records the actions of extraordinary individuals who did all they could to relieve the suffering.The famine was rapidly followed by an attack on Ukraine's cultural and political leadership - and then by a denial that it had ever happened at all. Census reports were falsified and memory suppressed. Some western journalists shamelessly swallowed the Soviet line; others bravely rejected it, and were undermined and harassed. The Soviet authorities were determined not only that Ukraine should abandon its national aspirations, but that the country's true history should be buried along with its millions of victims. Red Famine, a triumph of scholarship and human sympathy, is a milestone in the recovery of those memories and that history. At a moment of crisis between Russia and Ukraine, it also shows how far the present is shaped by the past.",
  "genres": [
    "History",
    "Nonfiction",
    "Russia",
    "Ukraine",
    "Politics",
    "Audiobook",
    "Russian History"
  ],
  "author": "Anne Applebaum",
  "average_rating": "4.39",
  "url": "https://www.goodreads.com/book/show/33864676-red-famine"
}