{
  "title": "The Misfit's Manifesto",
  "description": "A self-defined misfit makes a powerful case for not fitting in—for recognizing the beauty, and difficulty, in forging an original path.A misfit is a person who missed fitting in, a person who fits in badly, or this: a person who is poorly adapted to new situations and environments. It’s a shameful word, a word no one typically tries to own. Until now.Lidia Yuknavitch is a proud misfit. That wasn’t always the case. It took Lidia a long time to not simply accept, but appreciate, her misfit status. Having flunked out of college twice (and maybe even a third time that she’s not going to tell you about), with two epic divorces under her belt, an episode of rehab for drug use, and two stints in jail, she felt like she would never fit in. She was a hopeless misfit. She’d failed as daughter, wife, mother, scholar—and yet the dream of being a writer was stuck like “a small sad stone” in her throat.The feeling of not fitting in is universal. The Misfit’s Manifesto is for misfits around the world—the rebels, the eccentrics, the oddballs, and anyone who has ever felt like she was messing up. It’s Lidia’s love letter to all those who can’t ever seem to find the “right” path. She won’t tell you how to stop being a misfit—quite the opposite. In her charming, poetic, funny, and frank style, Lidia will reveal why being a misfit is not something to overcome, but something to embrace. Lidia also encourages her fellow misfits not to be afraid of pursuing goals, how to stand up, how to ask for the things they want most. Misfits belong in the room, too, she reminds us, even if their path to that room is bumpy and winding. An important idea that transcends all cultures and countries, this book has created a brave and compassionate community for misfits, a place where everyone can belong.",
  "genres": [
    "Nonfiction",
    "Memoir",
    "Essays",
    "Self Help",
    "Audiobook",
    "Psychology",
    "Biography"
  ],
  "author": "Lidia Yuknavitch",
  "average_rating": "3.84",
  "url": "https://www.goodreads.com/book/show/33863667-the-misfit-s-manifesto"
}