{
  "title": "God of War - Pandora's Temple: Amphitrite's Chamber, Architect's Son's Head, Architect's Sons, Architect's Tomb, Blades of Hades, Bluffs of Madness, Body Burner, Body Burner's Pyre, Caves of Madness, Centaur, Challenge of Atlas, Challenge of Poseidon, Cha",
  "description": "This book consists of articles from Wikia or other free sources online. Pages: 34. Chapters: Amphitrite's Chamber, Architect's Son's Head, Architect's Sons, Architect's Tomb, Blades of Hades, Bluffs of Madness, Body Burner, Body Burner's Pyre, Caves of Madness, Centaur, Challenge of Atlas, Challenge of Poseidon, Chamber of Atlas, Chamber of Hades, Chamber of Sacrifice, Chamber of the Gods, Cliffs of Atlas, Cliffs of Madness, Cronos, Cursed Archer, Cyclops Desert King, Dark Halls, Fallen Legionnaire, Fireball Trap, Flooded Passage, Gorgon, Hades' Maze, Hall of Trials, Handle of Atlas, Harpies, Legionnaire Captain, Minotaur, Necklace of Hera, Pandora's Box, Pandora's Bridge, Pandora's Gate, Pandora's Guardian, Path to Atlas, Pathos Verdes III, Poseidon's Chamber, Poseidon's Trident, Rings of Pandora, Sacrificed Soldier, Shield of Hades, Shield of Zeus, Siren, Spike Crusher, Statue of Amphitrite, Statue of Atlas, Statue of Hades, Stone Roller, Temple of the Crystal Eye, The Challenge of Hades, The Realm of Poseidon, Traps of Madness, Undead Legionnaire, Vultures, Wraiths, Zeus Mountain. Excerpt: The Blades of Hades are a series of large axes and saws attached to a series of spinning cylinders. Hung far above the Chamber of Hades, the Blades of Hades are the last Blades of Hades. danger Kratos faces in the Challenge of Hades before reaching the mechanism used to keep Pandora's Guardian locked up in its cage and within its own chamber. Add photo The Bluffs of Madness are basically the \"lower\" part of the Cliffs of Madness above Pandora's Temple. They are the first series of cliffs and ledges that Kratos traverses when he Bluffs of Madness. reaches the cliffs. Upon the bluffs is also the caves of the Traps of Madness where Kratos finds the Necklace of Aphrodite. Add photo The Body Burner, a God of War character, was the first to enter the Temp...",
  "genres": [],
  "author": "Source Wikia",
  "average_rating": "0.00",
  "url": "https://www.goodreads.com/book/show/33882653-god-of-war---pandora-s-temple"
}