{
  "title": "Love's Eternal Breath",
  "description": "The bestselling Eagle Harbor Series continues with Book 4, Love’s Eternal Breath.  Lindy Marsden once dreamed of having a husband, a house, some children, and maybe even a sewing machine. But since she grew ill five years ago, those dreams have become too much to hope for. Now she just wants to provide for herself and help the abandoned children she found living in the woods until their father returns… and avoid doctors for the rest of her life. Their medicine never leads to any good, and she has the scars to prove it.  Seth Harrington loves being a doctor, but treating patients in the small town of Eagle Harbor is nothing like working at a prestigious Boston hospital, especially with the other doctor in town trying to steal Seth's patients. When he's called to treat a reluctant woman, Seth finds Lindy Marsden's fiery dislike for him rather insulting. He has the ability to help her, but she wants nothing to do with him. Until she shows up on his doorstep one night...  When the plight of a young abandoned boy brings Seth and Lindy irrevocably together, Seth finds himself in the most difficult situation of his career. His expertise can help him heal the sick, but will his love be enough to soothe Lindy's wounded soul?  Come visit the rugged yet beautiful coast of Lake Superior and the remote historical town of Eagle Harbor that readers can’t get enough of.  Eagle Harbor Series--Where Love Finds Its Anchor Book 1: Love's Unfading Light (Mac and Tressa) Book 2: Love's Every Whisper (Elijah and Victoria) Book 3: Love's Sure Dawn (Gilbert and Rebekah) Book 4: Love's Eternal Breath (Seth and Lindy) Book 5: Love's Constant Hope (Thomas and Jessalyn) Book 6: Love's Bright Tomorrow (Isaac and Aileen--winter 2018) Prequel Novella: Love's Violet Sunrise (Hiram and Mabel) Short Story: Love's Beginning (Elijah and Victoria)",
  "genres": [
    "Christian Fiction",
    "Historical Fiction",
    "Christian Romance",
    "Historical Romance",
    "Fiction",
    "Christian Historical Fiction"
  ],
  "author": "Naomi Rawlings",
  "average_rating": "4.70",
  "url": "https://www.goodreads.com/book/show/33874161-love-s-eternal-breath"
}