{
  "title": "Linebacker: The Untold Story of the Air Raids over North Vietnam",
  "description": "Twelve days that shook the world. The beginning of the end.By the end of Day 9, the bombing of North Vietnam had taken an enormous toll.The planners were running out of suitable targets because the damage inflicted on most targets was higher than initially predicted.It became questionable whether those few targets remaining in the high threat areas were even of sufficient worth to continue attacking. The commander of the air force in the Pacific even suggested that it was time to look for targets in lower threat areas.As on previous days, the TACAIR support effectively countered the enemy defenses. The few MiGs which had managed to get airborne were driven away by the American fighter patrols. Although up to 70 SAMs had been fired at the B-52’s, the accuracy was noticeably poorer.The last desperate attempts to defend Hanoi were being made and it appeared the offensive was rapidly coming to a conclusion.In late 1972, the Vietnam peace talks were stalled, with the war at perhaps its most crucial point.The United States was searching for a way to strangle North Vietnam’s war-waging capabilities by shutting down its supply pipelines in order to force it back to the negotiating table.The Linebacker II, a massive, intricately coordinated twelve-day assault by over 700 combat aircraft against vital targets around Hanoi and Haiphong, enemy cities heavily guarded by MiGs, SAM missiles, and radar-guided antiaircraft.Here is an unprecedented look at one of the most critical campaigns of modern air warfare, a previously untold story, documented in rich, fascinating detail. It is told in the vividly personal words of the pilots and crews who flew the missions — men who dramatically helped to end the American role in the Vietnam conflict and to bring the POWs home.“Military buffs will appreciate this minutely detailed report of the American bombing raids over North Vietnam and the daring helicopter rescues.” – Publishers WeeklyKarl J Eschmann graduated from Texas A&M University in 1971 with a Bachelor’s Degree in Aerospace Engineering, and a Master’s Degree from the Air Force Institute of Technology in Logistics Management in 1989. As a Second Lieutenant in 1972-73, he was a flight line maintenance officer responsible for two squadrons of F-4E Phantom IIs during the Linebacker I & II air offensives, as well as the Cambodian and Laotian campaigns. Since then he has had a distinguished air force career. He retired as a Full Colonel in 1998.",
  "genres": [],
  "author": "Karl J. Eschmann",
  "average_rating": "4.07",
  "url": "https://www.goodreads.com/book/show/33871629-linebacker"
}