{
  "title": "First Snow, Last Light",
  "description": "In the last of the trilogy of Newfoundland novels that began with the critically acclaimed, prizewinning and internationally bestselling The Colony of Unrequited Dreams, Wayne Johnston brings us an epic family mystery told in two voices: that of Ned Vatcher, the first Newfoundland media mogul, and the ever-fascinating Sheilagh Fielding.Ned Vatcher, only 14, ambles home from school in the chill hush that precedes the first storm of the winter of 1936 to find the house locked, the family car missing, and his parents gone without a trace. From that point on, his life is driven by the need to find out what happened to the Vanished Vatchers. His father, Edgar, born to a poor family of fishermen, had risen to become the right-hand man to the colony's prime minister, then suffered an unexpected fall from grace. His mother, Megan, London-born and already unhappy in St John's, spiralled deeper into despair. Was it murder? Was it suicide? Had they run away? Most of all, why had they left their only child behind?  Ned soon finds himself enmeshed in another family, that of his missing father and the poverty from which the man somehow escaped. His grandparents, Nan and Reg, his Uncle Cyril and others, are themselves haunted by the inexplicable disappearance, years before, of a third Vatcher, a young man who was lost at sea on a calm and sunny day. Two other people loom large as Ned builds an empire to insulate him from everything that brought his parents down: a Jesuit priest named Father Duggan, and Sheilagh Fielding, a boozy giantess who, while wandering the city streets at night, composes satiric columns that scandalize the rich and powerful. In Ned, Fielding sees a surrogate for her two lost children, the secret that dogs her throughout her life, while Ned believes the enigmatic Fielding to be his soulmate.  The novel builds to a spectacular conclusion, the solving of the bizarrely interwoven mystery of all the Vanished Vatchers. Only Wayne Johnston could create such a mix of larger-than-life, myth-making characters and amazing plot twists that leave us contemplating not only the tragedy of the Vatchers but the impossibility of resisting the forces that compel us to act in ways we thought we never could.",
  "genres": [
    "Canada",
    "Fiction",
    "Mystery",
    "Historical Fiction",
    "Book Club",
    "Canadian Literature",
    "Literary Fiction"
  ],
  "author": "Wayne Johnston",
  "average_rating": "3.81",
  "url": "https://www.goodreads.com/book/show/33877397-first-snow-last-light"
}