{
  "title": "Swiftly Sharpens the Fang: A Brutal Tale of Racism, Radicalisation and Revenge",
  "description": "Some monsters are born... Others are created  Following the death of his father at the hands of terrorists, 22 year-old Joe suffers from depression. Using drink to kill the pain, he abuses himself and alienates his loved ones. His life in post-Brexit Britain is a chaos of binges and fights, while his dreams are haunted by repressed childhood memories.  When the black sheep of the family, Uncle Steve, takes Joe under his wing, the young man enters an ugly world of vice and fascism. Although gang membership means glory, fame and money, it comes at a cost to his soul.  Battling against his own conscience, Joe makes as many foes as friends. And soon, there is no escape from his uncle's organisation and their racist violence.  Unlike Steve, Joe wasn't born a monster. But his fangs are getting sharper every day.  Early thoughts from advanced review copy readers:  \"I highly recommend Swiftly Sharpens The Fang to all fans of this genre and anyone who loves an intense, thought-provoking tale. Definitely 5*s!\" - Carol Phipps, author  \"Swiftly Sharpens the Fang is certainly controversial, hard hitting, and likely to cause a stir\" - KJ Simmill, author  \"There are adult themes and situations in this novel that wouldn't be appropriate for children, but I think everyone from juniors and seniors in high school and older should read this story. I think we could all do with the reminders that it offers\" - Mistral Dawn, author  Praise for author Stuart Kenyon's SUBNORMAL series:  “I would recommend this book to everyone who enjoys good writing, and who is interested in realistic dystopian ideas\" - BOOK 1 reviewed by Kim Anisi for 'Readers Favorite' - 5 stars  “The writing is excellent, and you can’t stop yourself from reading one page after the other... You will be entertained right to the end, and then you’ll want to know even more\" BOOK 2 reviewed by Kim Anisi for 'Readers Favorite' - 5 stars  “The most worthwhile and gripping book I have read in a long time” - Amazon review - 5 stars  “I was drawn into Kenyon’s brilliant tale immediately and remained completely engrossed until the final page” - Amazon review - 5 stars  “The plot builds expertly, the characters provoke sympathy and contempt in equal measure. I found it hard to put the book down ” - Amazon review - 5 stars  \"I simply must repeat, this book should be made into a movie\" - Amazon review - 5 stars  “The author has a true gift for story telling and a Kafkaesque gift for plunging the reader into a world of nightmare” - Amazon review - 5 stars  “It's a warning, on par with George Orwell's *1984* and Aldous Huxley's *A Brave New World*, and I hope very much that people will both read it and heed it. Five stars and I'd give it six if I could\" - Amazon review - 5 stars",
  "genres": [],
  "author": "Stuart Kenyon",
  "average_rating": "4.79",
  "url": "https://www.goodreads.com/book/show/33878046-swiftly-sharpens-the-fang"
}