{
  "title": "American Lightning: Terror, Mystery, the Birth of Hollywood & the Crime of the Century",
  "description": "It was an explosion that reverberated across the country—and into the very heart of early-twentieth-century America. On the morning of October 1, 1910, the walls of the Los Angeles Times Building buckled as a thunderous detonation sent men, machinery, and mortar rocketing into the night air. When at last the wreckage had been sifted and the hospital triage units consulted, twenty-one people were declared dead and dozens more injured. But as it turned out, this was just a prelude to the devastation that was to come.In American Lightning, acclaimed author Howard Blum masterfully evokes the incredible circumstances that led to the original “crime of the century”—and an aftermath more dramatic than even the crime itself. With smoke still wafting up from the charred ruins, the city’s mayor reacts with undisguised excitement when he learns of the arrival, only that morning, of America’s greatest detective, William J. Burns, a former Secret Service man who has been likened to Sherlock Holmes. Surely Burns, already world famous for cracking unsolvable crimes and for his elaborate disguises, can run the perpetrators to ground. Through the work of many months, snowbound stakeouts, and brilliant forensic sleuthing, the great investigator finally identifies the men he believes are responsible for so much destruction. Stunningly, Burns accuses the men—labor activists with an apparent grudge against the Los Angeles Times’s fiercely anti-union owner—of not just one heinous deed but of being part of a terror wave involving hundreds of bombings. While preparation is laid for America’s highest profile trial ever—and the forces of labor and capital wage hand-to-hand combat in the streets—two other notable figures are swept into the drama: industry-shaping ﬁlmmaker D.W. Griffith, who perceives in these events the possibility of great art and who will go on to alchemize his observations into the landmark film The Birth of a Nation; and crusading lawyer Clarence Darrow, committed to lend his eloquence to the defendants, though he will be driven to thoughts of suicide before events have fully played out.Simultaneously offering the absorbing reading experience of a can’t-put-it-down thriller and the perception-altering resonance of a story whose reverberations continue even today, American Lightning is a masterpiece of narrative nonfiction.",
  "genres": [
    "History",
    "Nonfiction",
    "True Crime",
    "Crime",
    "American History",
    "Audiobook",
    "Mystery"
  ],
  "author": "Howard Blum",
  "average_rating": "3.51",
  "url": "https://www.goodreads.com/book/show/3389089-american-lightning"
}