{
  "title": "Logical Family: A Memoir",
  "description": "In this long-awaited memoir, the beloved author of the bestselling Tales of the City series chronicles his odyssey from the old South to freewheeling San Francisco, and his evolution from curious youth to ground-breaking writer and gay rights pioneer.Born in the mid-twentieth century and raised in the heart of conservative North Carolina, Armistead Maupin lost his virginity to another man \"on the very spot where the first shots of the Civil War were fired.\" Realizing that the South was too small for him, this son of a traditional lawyer packed his earthly belongings into his Opel GT (including a beloved portrait of a Confederate ancestor), and took to the road in search of adventure. It was a journey that would lead him from a homoerotic Navy initiation ceremony in the jungles of Vietnam to that strangest of strange lands: San Francisco in the early 1970s. Reflecting on the profound impact those closest to him have had on his life, Maupin shares his candid search for his \"logical family,\" the people he could call his own. \"Sooner or later, we have to venture beyond our biological family to find our logical one, the one that actually makes sense for us,\" he writes. \"We have to, if we are to live without squandering our lives.\" From his loving relationship with his palm-reading Grannie who insisted Maupin was the reincarnation of her artistic bachelor cousin, Curtis, to an awkward conversation about girls with President Richard Nixon in the Oval Office, Maupin tells of the extraordinary individuals and situations that shaped him into one of the most influential writers of the last century. Maupin recalls his losses and life-changing experiences with humor and unflinching honesty, and brings to life flesh-and-blood characters as endearing and unforgettable as the vivid, fraught men and women who populate his enchanting novels. What emerges is an illuminating portrait of the man who depicted the liberation and evolution of America’s queer community over the last four decades with honesty and compassion—and inspired millions to claim their own lives.",
  "genres": [
    "Memoir",
    "Nonfiction",
    "LGBT",
    "Biography",
    "Queer",
    "Audiobook",
    "Biography Memoir"
  ],
  "author": "Armistead Maupin",
  "average_rating": "4.21",
  "url": "https://www.goodreads.com/book/show/33898810-logical-family"
}