{
  "title": "Stone Cold Souls: History's Most Vicious Killers",
  "description": "History's most notorious and brutal killers still enjoy fame as public fascination with their lives and their crimes continues to grow. Stone Cold Souls is a detailed examination of the most brutal killers in history. Moffatt does what he does best by looking at historical accounts of events, analyzing them from a psychological perspective, and presenting his assessment in captivating fashion. He examines different types of killers, offers case studies and historical context, and describes what sets these cases apart from other kinds of killings. Even in a day and age where pop culture has made serial crime a mainstay of movies and books, the depravity of the killers profiled in this work will still shock even a desensitized reader.Men, women, and children alike have committed crimes so atrocious that it is hard to imagine that these events are not works of fiction. Moffatt examines the difficult questions that inevitably arise when one reads cases of unthinkable torture and cruelty. Why? Were these people simply evil or is it possible that, given other circumstances, they could have redirected their energies into more productive outlets? The author answers these questions and others and reveals the lives and crimes of these ruthless killers.Stone Cold Souls features such well-known cases Andrei Chikatilo, Marc Dutroux, Herman Webster Mudgett, Charles Ng, Leonard Lake, Lawrence Bittaker, Roy Norris, Ed Gein, Edmund Kemper, Henry Lee Lucas, Gilles de Rais, Ivan the Terrible, Richard Ramirez, Holly Ann Harvey, Sandy Ketchum, Mary Bell, Jesse Pomeroy, Josef Mengele, Marshall Applewhite, Jeffrey Lundgren, David Koresh, Jim Jones, Father Oliver O'Grady, Charles Cullin, Harold Shipman, Michael Swango, Myra Hindley, Karla Homolka, Aileen Carol Lee Wuornos, Elizabeth Bathory, Charles Sobhraj, Albert Fish, Donald Harvey, and Dennis Rader.",
  "genres": [
    "True Crime"
  ],
  "author": "Gregory K. Moffatt",
  "average_rating": "3.80",
  "url": "https://www.goodreads.com/book/show/3390934-stone-cold-souls"
}