{
  "title": "Tionghoa dalam Pusaran Politik",
  "description": "“Biasanya komunitas Tionghoa dibahas tersendiri. Kini, keunikan peran mereka digambarkan dalam sejarah panjang bangsa Indonesia. Buku yang merupakan perintis ini, ditulis dengan bersemangat. Tionghoa dilukis di atas kanvas raksasa.”Dr. Asvi Warman Adam—Ahli Peneliti Utama LIPI“Untuk mengerti tempat, sikap, dan kedudukan suatu minoritas, tidak ada jalan lain kecuali mendalami pengertian tentang evolusi minoritas itu. Hal ini untuk membuat agar semakin jelas kompleksitas struktur, konflik dalam dan luar, hubungannya (dengan segala variasinya) dengan mayoritas (yang juga kompleks dan berbeda-beda), permulaan dan konsekuensi dan perubahan definisinya sebagai minoritas. Tanpa pekerjaan yang berat tersebut, minorias (dan mayoritas juga) terus saja digambarkan secara simplistis, menurut dongeng-dongeng biasa dan kasar, yang sering penuh dengan kebencian, maki-makian, dan sebagainya yang dimaksudkan untuk mengisolasi minoritas itu dan menghilangkan kemanusiaannya. Suatu hal yang pada intinya adalah untuk membekukan terus status kelompok tersebut sebagai minoritas.”Prof. Dr. Daniel S. Lev—guru besar Universitas Washington.“Buku istimewa ini ditulis oleh orang biasa (nonsejarahwan). Dan, mungkin justru di situlah keistimewaan buku ini. Namun, meski bukan berlatar belakang sejarah, sang penulis dengan berbekal tumpukan dokumen berhasil merekonstruksi berbagai peristiwa sejarah. Khususnya nasib orang Tionghoa dalam berbagai perubahan besar politik di negeri ini. Tak banyak orang yang memotret setiap kejadian penting yang sebelumnya selalu meletakkan kembali orang Tionghoa Indonesia dalam kegamanan. Dalam setiap pergolakan politik, isyu anti-Tionghoa selalu jadi bahan politisasi dan ujungnya adalah terjadinya proses “pen-Cina-an” kembali orang Tionghoa. Buku ini kaya akan informasi. Termasuk informasi yang selama ini disembunyikan oleh rezim Orde Baru. Politik kesengajaan yang di kemudian hari menggiring orang Tionghoa untuk dinamai sebagai ‘binatang ekonomi’”Stanley—editor.",
  "genres": [
    "Indonesian Literature",
    "Politics"
  ],
  "author": "Benny G. Setiono",
  "average_rating": "4.24",
  "url": "https://www.goodreads.com/book/show/3390523-tionghoa-dalam-pusaran-politik"
}