{
  "title": "Prairie Fires: The American Dreams of Laura Ingalls Wilder",
  "description": "Millions of readers of Little House on the Prairie believe they know Laura Ingalls—the pioneer girl who survived blizzards and near-starvation on the Great Plains, and the woman who wrote the famous autobiographical books. But the true saga of her life has never been fully told. Now, drawing on unpublished manuscripts, letters, diaries, and land and financial records, Caroline Fraser—the editor of the Library of America edition of the Little House series—masterfully fills in the gaps in Wilder’s biography. Revealing the grown-up story behind the most influential childhood epic of pioneer life, she also chronicles Wilder's tumultuous relationship with her journalist daughter, Rose Wilder Lane, setting the record straight regarding charges of ghostwriting that have swirled around the books.The Little House books, for all the hardships they describe, are paeans to the pioneer spirit, portraying it as triumphant against all odds. But Wilder’s real life was harder and grittier than that, a story of relentless struggle, rootlessness, and poverty. It was only in her sixties, after losing nearly everything in the Great Depression, that she turned to children’s books, recasting her hardscrabble childhood as a celebratory vision of homesteading—and achieving fame and fortune in the process, in one of the most astonishing rags-to-riches episodes in American letters.Spanning nearly a century of epochal change, from the Indian Wars to the Dust Bowl, Wilder’s dramatic life provides a unique perspective on American history and our national mythology of self-reliance. With fresh insights and new discoveries, Prairie Fires reveals the complex woman whose classic stories grip us to this day.WINNER OF THE PULITZER PRIZEWINNER OF THE NATIONAL BOOK CRITICS CIRCLE AWARDWINNER OF THE CHICAGO TRIBUNE HEARTLAND PRIZE FOR NON-FICTIONONE OF THE NEW YORK TIMES BOOK REVIEW'S 10 BEST BOOKS OF THE YEAROne of The New York Times Book Review's 10 Best Books of the YearThe first comprehensive historical biography of Laura Ingalls Wilder, the beloved author of the Little House on the Prairie books",
  "genres": [
    "Nonfiction",
    "Biography",
    "History",
    "Biography Memoir",
    "Audiobook",
    "Historical",
    "Book Club"
  ],
  "author": "Caroline Fraser",
  "average_rating": "3.94",
  "url": "https://www.goodreads.com/book/show/33911349-prairie-fires"
}