{
  "title": "Crushed",
  "description": "This ya paranormal romance is the first in a series about teen witches using their powers to play deadly games.The Noah sisters rule Titan High with their beauty, brains, and magical powers.Each year they play a secret Crushed. The girls pick their targets carefully and blow enchanted dust into the boy’s faces, charming them. The girls give the boys commands, tasks to perform. If the boy completes the task, the witch's power grows. At the end of the year the girls call their spells back and test them to see how much power they've gained. The witch with the most power wins a year's worth of saved up allowance from her sisters.This year Kristen chooses the wrong boy to mess with after Brittany dares her to Crush him. Ordinarily Kristen wouldn't dream of doing something so risky, but she's in a bad mood and isn't thinking clearly. Right away she senses something is wrong. Instead of staring at her with puppy dog eyes, Zach Bevian (also known as tall, dark, and scary) glares at her, a look that could kill. Then he hesitates when she gives him an order. Something is definitely wrong.After being Crushed, Zach goes home to the family mansion and lets his anger ripple off him in deadly waves. The house shakes. Zach is also a powerful witch, but he has another dark secret. It involves his impulsive and mentally challenged sister.Kristen almost dies that same day. Someone is trying to kill her, but she has more suspects than evidence. If the spell didn't take, it's possible Zach is trying to put her out of his misery. Or it could be her jealous sister Brittany. Or is there another witch at the school, a witch in hiding?Zach decides to play along and pretend to be enchanted rather than risk exposing the truth about himself. If Kristen is going to play games with boys, maybe she should be taught a lesson. He sets out to show her the error of her ways. Then he gets caught up in a murder plot. Should he save her life or let her enemy get rid of her?Reviewers call this a fast and fun YA Paranormal Romance.This is the first in the Witch-game series with Witch Hunt being the second. Each book has a new set of characters and a different game to play so you can read them in whatever order you want. Other categories for this book include paranormal romance, YA paranormal, witch romance, YA books, and YA urban fantasy.",
  "genres": [
    "Young Adult",
    "Fantasy",
    "Romance",
    "Magic",
    "Paranormal",
    "Fiction",
    "Witches"
  ],
  "author": "K.C. Blake",
  "average_rating": "3.66",
  "url": "https://www.goodreads.com/book/show/12049148-crushed"
}