{
  "title": "Time’s Arrow, Time’s Cycle: Myth and Metaphor in the Discovery of Geological Time",
  "description": "Rarely has a scholar attained such popular acclaim merely by doing what he does best and enjoys most. But such is Stephen Jay Gould's command of paleontology and evolutionary theory, and his gift for brilliant explication, that he has brought dust and dead bones to life, and developed an immense following for the seeming arcana of this field.In Time's Arrow, Time's Cycle his subject is nothing less than geology's signal contribution to human thought--the discovery of \"deep time,\" the vastness of earth's history, a history so ancient that we can comprehend it only as metaphor. He follows a single thread through three documents that mark the transition in our thinking from thousands to billions of years: Thomas Burnet's four-volume Sacred Theory of the Earth (1680-1690), James Hutton's Theory of the Earth (1795), and Charles Lyell's three-volume Principles of Geology (1830-1833).Gould's major theme is the role of metaphor in the formulation and testing of scientific theories--in this case the insight provided by the oldest traditional dichotomy of Judeo-Christian thought: the directionality of time's arrow or the immanence of time's cycle. Gould follows these metaphors through these three great documents and shows how their influence, more than the empirical observation of rocks in the field, provoked the supposed discovery of deep time by Hutton and Lyell. Gould breaks through the traditional \"cardboard\" history of geological textbooks (the progressive march to truth inspired by more and better observations) by showing that Burnet, the villain of conventional accounts, was a rationalist (not a theologically driven miracle-monger) whose rich reconstruction of earth history emphasized the need for both time's arrow (narrative history) and time's cycle (immanent laws), while Hutton and Lyell, our traditional heroes, denied the richness of history by their exclusive focus upon time's Arrow.",
  "genres": [
    "Science",
    "Geology",
    "Nonfiction",
    "History",
    "Philosophy",
    "Popular Science",
    "History Of Science"
  ],
  "author": "Stephen Jay Gould",
  "average_rating": "3.90",
  "url": "https://www.goodreads.com/book/show/33931.Time_s_Arrow_Time_s_Cycle"
}