{
  "title": "The Battles: A Fabulous Odyssey Seeking The Secret of Success and Positive Thinking.",
  "description": "The alternate cover edition of this book can be found here.Do you feel it's time for success? Because you're worth it.Who thinks that personal development books and goal setting manuals were boring? Not anymore! See how you can succeed in business and life and achieve your dreams.David Bowie famously sang, “We can be heroes, just for one day.” Much more than a simple song, his lyrics struck at a deeper truth—that we are all striving to become much more than what we currently are. But how do we get there?With her diverse background as a process engineer, nutrition coach and business mentor, Christiane Agricola has used her experiences to show us how we can remodel the way we think and act, unleash our undercover talents and faculties, and finally create the life we were always dreaming of—not only for ourselves but also for the world around us. Like Jim Rohn said, “For things to change, we must change. For things to get better, we must get better.”In “The Battles—A Fabulous Odyssey Seeking the Secret of Success and Positive Thinking,” Agricola presents a self-help manifesto within the context of an exciting tale of fantasy and science fiction. Set in the year 3000 in a dystopian future where humanity has fallen from its highest potential, Magnus Battles decides to save us all from the villainous Big Five, he calls the bad forces, and who are reigning over humankind. He selects five people to complete a series of arduous challenges, with the winner awarded an amulet that grants him extraordinary wisdom and strength. With this, the chosen one can lead humanity towards a brighter tomorrow. But first, Magnus and his team of elves must deal with the Big Five’s mole, whose only purpose is to undermine their incredible journey. Will they succeed?Much more than just an entertaining story or a self-help manual, Agricola utilizes both facets in order for us to better understand and improve ourselves. As a self-help manual, “The Battles” will help you reinvigorate your physical self, discover your strengths, and channel your drive towards an all-consuming success. And as an exciting fantasy and science-fiction story, you will be placed in the roles of these heroes as they traverse the challenging tasks before them. Learn how to become the best possible version of yourself. Because once you’ve read “The Battles,” you too can become a hero – and not just for one day.In The Battles you will learn how to:- Clear your mind, improve your brain function and focus on your goals- Prepare your body for success and improve your overall health and fitness- Dream big- Know what you want - Believe in your goals- Use The Law of Attraction- Find your strongest faculties and use them efficiently- Acquire active power consciousness (and discover what that is)- Improve your strengths to grow your success- Identify your excuses and get rid of your “ifs”- Stop being a puppet and take control of your life- Make this planet a better place, by taking the right actions for yourselfBe the Next Hero!The Battles is based on a proven system, elaborated by Wallace D. Wattles, author of The Science of Getting Rich, years ago. Learn in 6 Lessons how to develop and unleash unsuspected potentials and faculties you already possess, and how to use the mental power that slumbers in you.With motivational quotes by Napoleon Hill.",
  "genres": [],
  "author": "Christiane  Agricola",
  "average_rating": "4.82",
  "url": "https://www.goodreads.com/book/show/33917919-the-battles"
}