{
  "title": "Love and Travel: 5 true love stories of my travel",
  "description": "\"Travel and Love\" is one of those books where you keep telling yourself, one more page... The problem is that you can finish it REALLY fast. This book take you into seven different stories from my travel around the world. This histories discribe the situations as a intimate diary. The events recounted in these stories are completely true. Certain characteristics, dates and locations have been changed in order to protect me from criminal prosecution. I hope you enjoy reading this as much as I enjoyed living it. TABLE -Anecdote The girl on the bus -Anecdote Just another night -Anecdote Double date -Anecdote Chance -Anecdote The perfect date -Anecdote Get Out! -Anecdote Continuing my trip Extractions of the book> Anecdote girl on the bus \"I was leaving Nelson, New Zealand on a bus to Queenstown; from There I'd then fly to Bali, Denpasar. It was supposed to be a normal, twelve-hour trip. When I got on the bus, my seat was in the first row with an impeccable view of the front. I always like to travel with a window seat, but unfortunately this time I had the aisle, next to a robust man who was taking up part of my seat. It wasn't the best way to start a trip, but I couldn't blame him.\" Anecdote Just another night \"I began to talk to her in my basic, strongly-accented English while memorizing the details of her face. I always do that. Up-close, I liked her features even more. Communication was difficult. She told me she was German and had the accent to confirm it. I noticed an acceleration in her speech, as if she were a bit nervous. She was also struggling to understand what I was saying. Her dominion of the English language humiliated mine.\" Anecdote Double Date Germán, I have a proposal for you that you're not going to be able to turn down! Me, looking at him with some skepticism, as I already knew What's up? I'm talking to a 44-year-old Brazilian girl. She said that she's leaving to Sydney tomorrow. She has 2 friends, another Brazilian and an Australian. She asked if I had 2 friends to go to their hotel. You wanna go? Me while Eeeehhhmmm... No thanks! Anecdote Chance \"I walked for several minutes with the sole purpose of sleeping – or so it was, until I heard the shout of my name, which disoriented me. Out-of-place and surprised, I turned off the music in my ears and turned to see who this person was who had said my favorite word.\" Anecdote The perfect date \"It was in the city of Singapore. I was somewhat drunk on a sofa while observing her face after we had kissed. Was she really lovely, or was I really wasted? I thought as I kept looking at her, my vision already obscured by alcohol. Her features began to become more clear... Yes! She was beautiful. “I want to see you again,” I told her. She took my face in her two hands, and after kissing me, “I'd like to see you again, too.\" Anecdote Get Out! I could have escaped immediately, but I feared that she, in her wavering, out of control state, would go to the kitchen and get a large, sharp knife to stab me with in the middle of the chest. Her emotional state was very delicate. There was no other option, I had to fuck her... Anecdote Continuing my trip \"For three months, we had been living together in Nakhon Sawan, a city lost in the heart of Thailand. As the end of our time together neared, there were nights I observed her sitting pensive and silent, her eyes damp and fixed on some distant point. One night, while she was reclining by my side, embracing me, she When was the last time you cried?\"",
  "genres": [],
  "author": "German Muhlenberg",
  "average_rating": "0.00",
  "url": "https://www.goodreads.com/book/show/33929463-love-and-travel"
}