{
  "title": "Mental: Lithium, Love, and Losing My Mind",
  "description": "A riveting memoir and a fascinating investigation of the history, uses, and controversies behind lithium, an essential medication for millions of people struggling with bipolar disorder, stemming from Jaime Lowe's sensational 2015 article in The New York Times Magazine \"'I Don't Believe in God, but I believe in Lithium': My 20-year struggle with bipolar disorder.\" It began with an insomniac summer in Los Angeles in 1993, when Jaime Lowe was just 16. She stopped sleeping and eating, and began to hallucinate--Michael Jackson wearing masks, demonically cackling Muppets, and faces in windows. She wrote manifestos and math equations in her diary, and infographics on her wall. Eventually hospitalized and diagnosed as bipolar, her prescribed medication was three pink pills -- lithium. In Grand Delusions,  Lowe shares her story of life-long episodic madness and the stability she found with lithium, as well as a journalistic exploration of the history and science of the mysterious element. She interviews scientists, psychiatrists, and patients to examine how effective lithium really is and how its side effects can be dangerous for long-term users. Lowe travels to the Bolivian salt mines that hold over half of the world's lithium reserves, as well as to rural America, where turn of the century lithium spas are still touted as a tonic to cure all ills. At the heart of Grand Delusions is Lowe's personal story, detailing her experiences on and off lithium, and the mental health and personal struggles that have accompanied it. Most recently, the longterm effects of lithium have led to her kidney degradation. Now adjusting to new medication after 20 years of lithium, Lowe's pursuit of a stable life continues. Grand Delusions is eye-opening and powerful, tackling an illness and drug that has touched millions of lives and yet remains shrouded in social stigma. With unflinching honesty, Lowe allows us a clear-eyed view into her life, while also offering a compelling historical overview of one of mankind's oldest medical mysteries.\"",
  "genres": [
    "Memoir",
    "Mental Health",
    "Nonfiction",
    "Psychology",
    "Mental Illness",
    "Audiobook",
    "Psychiatry"
  ],
  "author": "Jaime Lowe",
  "average_rating": "3.73",
  "url": "https://www.goodreads.com/book/show/33931116-mental"
}