{
  "title": "Invisible: How Young Women with Serious Health Issues Navigate Work, Relationships, and the Pressure to Seem Just Fine",
  "description": "An exploration of women navigating serious health issues at an age where they're expected to be healthy, dating, having careers and children.Miriam's doctor didn't believe she had breast cancer. She did.Sophie navigates being the only black scientist in her lab while studying the very disease, HIV, that she hides from her coworkers.For Victoria, coming out as a transgender woman was less difficult than coming out as bipolar.Author Michele Lent Hirsch knew she couldn't be the only woman who's faced serious health issues at a young age, as well as the resulting effects on her career, her relationships, and her sense of self. What she found while researching Invisible was a surprisingly large and overlooked population with important stories to tell.Though young women with serious illness tend to be seen as outliers, young female patients are in fact the primary demographic for many illnesses. They are also one of the most ignored groups in our medical system--a system where young women, especially women of color and trans women, are invisible.And because of expectations about gender and age, young women with health issues must often deal with bias in their careers and personal lives. Not only do they feel pressured to seem perfect and youthful, they also find themselves amid labyrinthine obstacles in a culture that has one narrow idea of womanhood.Lent Hirsch weaves her own harrowing experiences together with stories from other women, perspectives from sociologists on structural inequality, and insights from neuroscientists on misogyny in health research. She shows how health issues and disabilities amplify what women in general already confront: warped beauty standards, workplace sexism, worries about romantic partners, and mistrust of their own bodies. By shining a light on this hidden demographic, Lent Hirsch explores the challenges that all women face.",
  "genres": [
    "Nonfiction",
    "Feminism",
    "Disability",
    "Health",
    "Medical",
    "Mental Health",
    "Medicine"
  ],
  "author": "Michele Lent Hirsch",
  "average_rating": "4.05",
  "url": "https://www.goodreads.com/book/show/33931697-invisible"
}