{
  "title": "Rescued by the Captain",
  "description": "And our love will cling forever between the ivy and the thorns…He left soon after they shared their first kiss. She waited for his return. Can two lost souls find their way to love each other?Ivy Mallory spent the past seven years patiently waiting for Marcus Thornhill to return. He took her heart with him when he rejected her love. Over the years, Ivy played the part of the perfect lady enjoying the London seasons. However, when she overheard a treason plot threatening her brother, Ivy got herself kidnapped. When she awakened on the ship of the man who broke her heart, Marcus tempted Ivy with a passion she cannot deny. With her life in danger and the need to save her brother, Ivy must put her trust in Marcus’s hands. When Ivy fell more deeply for him, she wondered if Marcus would refuse her love. Can Ivy risk her heart to loving Marcus again?On his journey home Captain Marcus Thornhill discovered a lady floating unconscious in a lifeboat out in the middle of the open sea. Not just any lady, but the one who captured his heart. While Marcus nursed her back to health, he tried to uncover her secrets. When he unraveled the treason plot that would bring war to their beloved shores of England, Marcus cannot deny his love for Ivy. Can Marcus protect Ivy from harm and convince her of his love?Rescued By the Captain is the first book in Laura A. Barnes’s historical romantic suspense series. If you like intrigue, sensual, drama filled scenes set in Regency England then you’ll love the reuniting of Ivy and Thorn’s love in the Romancing the Spies Series.Unlock Rescued By the Captain to begin reading the historical romance series today!Romancing the Spies SeriesRescued By the Captain - Book #1Rescued By the Spy - Book #2Rescued By the Scot - Book #3Romancing the Spies Box Set contains all three books in the series",
  "genres": [
    "Historical Romance",
    "Historical",
    "Romance",
    "Regency",
    "Fiction"
  ],
  "author": "Laura A. Barnes",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/33930920-rescued-by-the-captain"
}