{
  "title": "The 47th Samurai",
  "description": "In \"The 47th Samurai,\" Bob Lee Swagger, the gritty hero of Stephen Hunter's bestselling novels \"Point of Impact\" and \"Time to Hunt, \" returns in Hunter's most intense and exotic thriller to date. Bob Lee Swagger and Philip Yano are bound together by a single moment at Iwo Jima, 1945, when their fathers, two brave fighters on opposite sides, met in the bloody and chaotic battle for the island. Only Earl Swagger survived.More than sixty years later, Yano comes to America to honor the legacy of his heroic father by recovering the sword he used in the battle. His search has led him to Crazy Horse, Idaho, where Bob Lee, ex-marine and Vietnam veteran, has settled into a restless retirement and immediately pledges himself to Yano's quest.Bob Lee finds the sword and delivers it to Yano in Tokyo. On inspection, they discover that it is not a standard WWII blade, but a legendary shin-shinto katana, an artifact of the nation. It is priceless but worth killing for. Suddenly Bob is at the center of a series of terrible crimes he barely understands but vows to avenge. And to do so, he throws himself into the world of the samurai, Tokyo's dark, criminal yakuza underworld, and the unwritten rules of Japanese culture.Swagger's allies, hard-as-nails, American-born Susan Okada and the brave, cocaine-dealing tabloid journalist Nick Yamamoto, help him move through this strange, glittering, and ominous world from the shady bosses of the seamy Kabukicho district to officials in the highest echelons of the Japanese government, but in the end, he is on his own and will succeed only if he can learn that to survive samurai, you must become samurai.As the plot races and the violence escalates, it becomes clear that a ruthless conspiracy is in place, and the only thing that can be taken for granted is that money, power, and sex can drive men of all nationalities to gruesome extremes. If Swagger hopes to stop them, he must be willing not only to die but also to kill.",
  "genres": [
    "Thriller",
    "Fiction",
    "Mystery",
    "Action",
    "Suspense",
    "Adventure",
    "Crime"
  ],
  "author": "Stephen Hunter",
  "average_rating": "3.91",
  "url": "https://www.goodreads.com/book/show/339231.The_47th_Samurai"
}