{
  "title": "A Step Beyond",
  "description": "Dr. Brigitte Sheen, an ambitious scientist, and her colleague develop a gene therapy system to extend human life spans. In her search for venture capital, Dr. Sheen, having strict moral and ethical guidelines, is quite particular on how this technology should be provided to the public.  Just two years prior, Brigitte had helped her friends Kyle Pickens and Nikita Patel, and her husband, Jeremy Hughes, steal $33 million in bearer bonds from a contemptible rogue agent of the Horsemen who had killed Kyle's uncle, Doug Gervais, a vice president of the Federal Reserve Bank.  Kyle Pickens, owner of a brewpub in Marin County, had sold the bonds to a Chinese financial conglomerate, but as he had never been paid, Nikita Patel, a private investigator and now Kyle’s live-in lover, travels to Shenzhen, China, determined to collect what is rightfully owed. What she finds there is completely unexpected. The Chinese company, Mingzhen Fortune Capital, is a front company for Chinese interests and seems to have its own secret agenda. Its mission is to buy into every conceivable emerging technology in the burgeoning transhumanism megatrend—mixing man and machine, artificial intelligence, cyborgs, genetic engineering, and anti-aging technologies.  The Horsemen, a secret cabal based in London who control most of the affairs of the UK, US and their allies, also desire control of Telomere Senescence Systems, Dr. Sheen's anti-aging technology company. A covert treaty with extraterrestrials had provided them with an edge in the race for domination and control of key transhuman technologies, but a serious rift in that relationship has threatened their mission.  In a fierce proxy battle between East and West, the future of mankind is at stake. Pursued by a crazed super soldier with enhanced physical abilities, Dr. Sheen, together with help from her husband, Jeremy Hughes, Nikita Patel, Kyle Pickens, and others, must overcome dark intentions of unseen powers... But are these intentions really that evil? Do the Chinese investors have nothing but good intentions in their bid for the technology? Or are they hiding their real intentions? Should Brigitte allow the fate of this profound life-changing technology to be decided simply by the whims of the market? Or do the Horsemen know more? Is there something happening at this particular juncture in human development that warrants the covert collusion of the Horsemen and the use of their nearly absolute power?  A timeless human desire is to be transhuman, and it's only a step beyond.",
  "genres": [],
  "author": "John Molik",
  "average_rating": "4.75",
  "url": "https://www.goodreads.com/book/show/33952341-a-step-beyond"
}