{
  "title": "Diana and the Rise of the House of Spencer",
  "description": "\"This is the stuff of fairy tales,\" said the Archbishop of Canterbury on July 23, 1981, after the 20-year-old Lady Diana Spencer arrived in a glass coach for her wedding to Prince Charles. But everyone knows how that fairy tale ended.Drawing upon intensive research and interviews, acclaimed biographer Anne Edwards, well-known for her revelatory and incisive books on members of Britain's royal family, here uncovers new details of Diana's life and her search for love; of her family background; and of a betrayal, historic in its outcome. What the public did not know at the time of her storybook wedding was the true story of Diana's troubled childhood-of the cold, autocratic grandfather who disdained her father, who was himself an abusive husband obsessed with having a son to inherit the Spencer wealth and title.When Diana married Prince Charles, she joined the equally troubled House of Windsor, and was caught up in a plot Shakespearean in its deception and eventual tragic ending. Anne Edwards paints a vivid portrait of a woman desperate in her marriage, fearful of her life, who became devious-and often brilliant-in the moves she played in a treacherous royal chess game.As in her superb biographies of other royal and celebrated women, Anne Edwards's Ever After transcends the one-sided views of Diana in a work that must be called definitive. At long last, and with all of the insight and narrative drama that have marked her previous bestsellers, Edwards brings us the first full-scale, authoritative portrait of a more intelligent, more resourceful, and sometimes more ruthless woman than we have seen before.\"Diana's many fans are sure to be delighted by Edwards's intimate prose and detailed descriptions.\" - Publishers Weekly",
  "genres": [
    "Biography",
    "Nonfiction",
    "History",
    "British Literature"
  ],
  "author": "Anne Edwards",
  "average_rating": "3.90",
  "url": "https://www.goodreads.com/book/show/3394719-diana-and-the-rise-of-the-house-of-spencer"
}