{
  "title": "Firestarters: How Innovators, Instigators, and Initiators Can Inspire You to Ignite Your Own Life",
  "description": "What is the difference between those bold enough to pursue their dreams and others who never get comfortable enough to ignite their lives? The doers are \"Firestarters\" and, because of them, the world is a much different, and often, better place. This motivational how-to book provides insights into the crucial difference between people who make things happen and those who only think about making an impact. Based on research from many disciplines and interviews with professionals at the top of their fields, Firestarters creates a complete roadmap to achieve personal success and make an impact in the world. The heart of the book features stories about successful entrepreneurs, CEOs, organizational leaders, and forward-looking thinkers from a variety of professions. They describe the factors and conditions that ignited their lives and helped them become achievers. Some are known to the public; others will be completely new. But all the stories demonstrate how they became--and you can become--a Firestarter. The authors provide pragmatic advice on how individual readers can ignite the qualities that will lead them toward pursuing and realizing their dreams. Self-assessment exercises, checklists, and other tools will help readers apply Firestarter insights to their own lives. Also included are group exercises and discussion guides so the book can be used in business and nonprofit settings to develop the skills that help companies grow. Whether you're an individual seeking ways to realize personal ambitions or a leader trying to motivate your team, you'll benefit from the Firestarter methods featured in this inspirational book.",
  "genres": [
    "Business",
    "Nonfiction",
    "Self Help",
    "Personal Development",
    "Inspirational",
    "How To",
    "Book Club"
  ],
  "author": "Raoul Davis Jr.",
  "average_rating": "4.29",
  "url": "https://www.goodreads.com/book/show/33946361-firestarters"
}