{
  "title": "Shattered Time: An Anthology",
  "description": "Lines of Time and DesireIf someone sent you a text saying they're from the future, would you believe them? Londyn doesn't know if this stranger with a charming personality is just pulling her leg or telling the truth, but what she does know is that it's too much fun not to play along. With her heart now on the line and dark secrets looming, will she make the right decision or will she let the love of her life disappear into time? A romantic tale of love, time, and tragedy.By J.L. Clayton.HomecomingAstrid finds something at a local witch’s house, something that doesn’t belong there…It belongs to her baby brother. The only problem with that is…he’s supposed to be dead.Astrid searches for the truth, learning that sometimes death isn’t final…By, Carissa Ann LynchA Web Through TimeMeet Alex. Ordinary. Quiet. And she plays by the rules. Until she’s forced into a world where her past becomes her future and the governments of Earth are searching for her execution. Will she embrace her true nature or succumb to the threats of her parents’ enemies?By, Niki LivingstonWillow and The Forbidden PortalWillow, a simple Herb Woman, flees for her life after a child under her care loses his life.Accused of witchery, she knows the only way to save her life is to find The Forbidden Portal and escape through time.By, Regina OconnellCassandra's ChoiceOne moment, Cassandra’s driving along in her car to meet her new niece; the next, she’s waking up in the bed of an angry 19th-century Duke. What begins as a battle of wills soon turns into a struggle of emotions as Cassandra finds herself falling in love with the Duke. Will she make it back or choose to stay with the man she has come to love?By, Ashlee ShadesThe Secrets Crows KeepMildred was certain she'd escaped her past...she buried him. So when he showed up at her front door she had no choice but to question everything. As secrets are revealed, she realizes nothing is as it seems and the truth is more bizarre than she'd imagined.By, Bradon NaveBridging the GapA dismantled bridge. A portal into an era time had forgotten. That was all Garrett needed to realize how better the future could be. But at what price?​It isn’t until Garrett sees his ways are destroying the future rather than bettering it that he comes to his senses. But will it be too late?By, Jeremy SimonsTime’s LaunchThe year is 2363, and the Earth Confederation launched their first time-ship the ECS Andrea commanded by Captain Joseph Dyson, the ships experimental engines move them ten thousand years into the future.By, Joe PranaitisThe SalesmanMelanie, consumed by guilt over a recent tragedy, struggled to forgive herself and move forward, until one day, when a peculiar salesman offered a remedy to what ailed her.By, D.A. Roach\"One Cockroach Left\"A tale of dinosaurs, aliens, time travel, and a really bad day . . . sixty-six million years ago.By, Genevieve MoultrieTimeWhen tragedy strikes, Vida Morton is given the choice to go back in time, and save the man she loves, Mort Vidal. But love is a tricky game, and so is time. Especially in the face of death.By, Grace CharlesWhisper's of ForeverA breathless caress, an echo of desire whispering of Forever.Layla thinks she is from the modern world, but her modern life hasn't been simple. Plagued with visions of others, Layla always felt as if she belonged in another time with the strangers that haunt her mind. Layla will soon find out if her visions are true. A deliciously dark serenade of hope filled tragedy.By, T. Guthrie",
  "genres": [],
  "author": "J.L. Clayton",
  "average_rating": "4.74",
  "url": "https://www.goodreads.com/book/show/33949356-shattered-time"
}