{
  "title": "Justice Failed",
  "description": "Having no choice but to protect their own client—the true murderer—lawyers who could prove Alton Logan’s innocence kept silent for over two decades.Justice Failed is the story of Alton Logan, an African-American man who served twenty-six years in prison for a murder he did not commit. Shamefully, such false imprisonment isn’t uncommon in America, but what makes this case extraordinary is that his innocence was made known to the attorneys of the true murderer within one month of Logan’s imprisonment. Written in collaboration with veteran journalist Berl Falbaum,Justice Failed explores the sharp divide that exists between common sense morality—an innocent man should be free—and the rigid ethics of the law which superseded that morality. The actual murderer admitted his guilt to his lawyers, but they, bound by the absolutism of client-attorney privilege, did not take action to free an innocent man. According to ethic codes, they could not. Instead, they signed an affidavit proclaiming Alton Logan’s innocence, and in a move that belongs in a thriller, one of them locked the document in a strong box and kept it beneath his bed, in case they were someday able to assist Logan. It wasn’t until after the true murderer’s death in 2007 that the lawyers came forward with the information that eventually set Logan free.Throughout, interviews and probing legal exploration give way to Alton Logan himself as he tells his own story; from his childhood in Chicago to the strength required to maintain his innocence while incarcerated, to the devastating impact that the loss of a quarter century has had on his life—he entered prison at 28 years of age, and was released at 55. His story is painful and infuriating, but Justice Failed is not meant to shock, nor is it a plea for pity. Logan and Falbaum lay out the facts, and answer the question “How could this happen?” Very easily, it seems. Through telling his story, Alton Logan and Berl Falbaum seek to change that.",
  "genres": [
    "Nonfiction",
    "True Crime",
    "Memoir",
    "Law",
    "Biography"
  ],
  "author": "Alton Logan",
  "average_rating": "3.97",
  "url": "https://www.goodreads.com/book/show/33946144-justice-failed"
}