{
  "title": "Uncorked : My year in Provence studying pétanque, discovering Chagall, drinking pastis, and mangling French",
  "description": "Will a foreigner assigned to work in Provence be able to gain acceptance from his French townsfolk? Find out, as Paul Shore’s evocative story telling, wry wit, and big heart, inspire and entertain you, as he tells the tale of how he did just that. Shore’s unwavering determination to fit into life in a quaint village, despite having smoke repeatedly blown in face, saw him eventually embraced within the local culture --- at least by a few of his leery French neighbours. Uncorked celebrates the “uncorking” of a few tightly held traditions that are near and dear to hearts of the locals of the Cote d’Azur and Provence – being taught to play pétanque (boules) under the clandestine cover of darkness; learning vernissage etiquette; drinking pastis before noon; navigating narrow village roads at top driving speed. Shore also “uncorks” personal awakenings about the value of following roads-less-travelled and making time to smell-the-roses, as we cultivate friendships and traditions. And, through exposure to the life of artist Marc Chagall, Shore reflects on the challenges that all newcomers face to gain acceptance in a foreign land. Shore’s humorous and heart-felt accounts of his year living in Provence will touch and amuse, and evoke fond memories of travel to fascinating places --- and they might even trigger reflection on the importance of being afforded new chances in life.TREAT YOURSELF TODAY to some belly laughter and fond reminiscing about past travels!Praise for Uncorked:\"Like a wry cross between Bill Bryson and Dave Bidini, Paul Shore’s funny, self-deprecating and wholesome recounting of a year spent in Provence is one part travelogue, one part self-help guide, and one part memoir. Uncorked is just like a good French wine: light, delicious, and full of flavour.\"--- Grant Lawrence, CBC broadcaster and author of Adventures in Solitude“A computer geek in the South of France? What could go wrong? With remarkable storytelling skill, Shore brings to life a time and place where community, simplicity and a slower pace were revered — a younger generation's A Year in Provence.”--- Sarah Bancroft, writer of the blog A Year in Paris“Shore’s light-hearted story takes you to a place where the simple joys in life are what matters. During my Man in Motion World Tour 30 years ago, I wish I could have slowed down as Paul did.”--- Rick Hansen, founder and CEO of the Rick Hansen Foundation“Many dream of relocating to France at some time in their lives. Like Peter Mayle (A Year in Provence) before him, Paul Shore made the leap and found a cornucopia of delights in his new home.”--- Stephen Hui, hiking writer and former Georgia Straight editor“Paul Shore’s nostalgic musings on the ancient, nuanced sport of pétanque demonstrate how to, with a dose of persistence, tap into a treasure trove of cross-cultural respect and understanding in sunny Provence.” --- Jack Christie, writer-broadcaster, author of 52 Best Day Trips from Vancouver“Reminded me of my own time in Europe and how much I miss it. Thanks so much for a wonderful read and bringing back such incredible memories.”--- Stella Harvey, founder of the Whistler Writers Festival and author of The Brink of FreedomThis is an alternate-cover edition for 9780981347417.",
  "genres": [
    "Travel",
    "France",
    "Memoir",
    "Nonfiction",
    "Biography",
    "Canada",
    "Humor"
  ],
  "author": "Paul  Shore",
  "average_rating": "3.81",
  "url": "https://www.goodreads.com/book/show/33953577-uncorked"
}