{
  "title": "Escaping the Lion and the Leopard",
  "description": "Escaping the Lion and the Leopard is based on a true story. Our hero, Ghabriela, who was raised in an orphanage in Eritrea and later came to this country, told me, \"Honey, you can't believe the things I've been through. I can't believe them myself. You know, in Ethiopia, there's a story about the lion and the leopard that I used to hear when I was a small child. The story goes that you see a lion and you run away from it, as fast as you can, and you ﬁnd the ﬁrst tree you see and run up it for shelter. You are so happy you ﬁnd that tree, you don't see the leopard on top and it jumps on you and eats you up in one bite.\" She sat back and sighed. \"Sometimes there are just no good choices - you do whatever you got to do to survive. The story of the lion and the leopard - that's the story of my life.\"After she escaped from that life and tried to leave it behind, she eventually realized that she needed to ﬁnd a way to incorporate it into her new life. In 1985 she went back to Eritrea during the Ethiopian/Eritrean war and adopted two babies from Asmara. \"They were so little when they left Eritrea,\" she said, \"that they don't remember about hunger, about wars. And they don't know about my life before I raised them. I think I decide I want them to know my story the day they whine they don't have the right designer sneakers. I feel like saying to them be glad you have any sneakers. Actually, I think to myself, be glad you have feet.\"ELLIE PORTE PARKER is the author of Six When He Came to Us and is a contributor to the Chicken Soup books. She is a licensed psychologist with a Ph.D. in cognitive/educational psychology and is the mother of an internationally adopted child. She is interested in understanding and giving voice to people's stories and was introduced to Ghabriela Donnelly, on whom this book is based, by a mutual friend.",
  "genres": [
    "Adoption"
  ],
  "author": "Ellie Porte Parker",
  "average_rating": "4.52",
  "url": "https://www.goodreads.com/book/show/33939433-escaping-the-lion-and-the-leopard"
}