{
  "title": "The Great Action: Comic Book for Yuppies",
  "description": "A graphic novel- adventures, science fiction, mystic. An comic book for Yuppies. Hand made graphic drownings in realistic-hyper realistic stile. Some innovating included. This is last Half (sections# 3 and# 4) of the first Super Indy Story. (More coming) And the story is: A radical militarized group (\"Liberators\") is suffering from strange damage to its electronic spy system because of a brief visit by an unknown person. (Indy?) They must vacate a building in full secret to avoid possible detection. Right after they left the site, the building collapsed. That attracted the attention of TV team and all others to the event and mysterious renters, who managed to disappear at the last moment. And at the same time, Tesha, by chance, took pictures of \"Liberators.\" Those pictures should be recovered by visiting her house. The \"liberator's\" action people can do that... A secret community, masking as a carrot farm, is looking for someone who possess a special sort of power they need. They suspect somebody, but they are not sure. If they are right, the community will have access to the tomorrow-direct-access-time-tunnel. Anyway, that person might be taken to a special facility for an examination. He should be taken, even if he does not want to go. And meanwhile, a college administration is worrying about disappearance of a college professor and is starting search actions. Mysteriously the professor has materialized the same day on a parking lot bench...unconscious... And meanwhile, Indy, the certified yoga master, while teaching yoga, discovered his power to rule machines (or that is look like this). And meanwhile, Tesha, in spite of being a very pretty woman is sad for some unpleasant circumstances in her life: she has not practiced love for about two years already. She became depressed about this until she met some young men who represented themselves as...angels. And more things happened",
  "genres": [],
  "author": "Alex Letner",
  "average_rating": "4.83",
  "url": "https://www.goodreads.com/book/show/33942014-the-great-action"
}