{
  "title": "2 Girls 1 Cup",
  "description": "Supermodel and super-writer Lin Xun exposes \"2 girls 1 cup\"! Her phrase is shorthand for \"Stalin and Hitler,\" and especially when those two hooked-up together. It is also shorthand for \"Stalin and Mao\" and their coupling too. There was a sick union shared by all 3 of the gangbangers: Stalin, Mao, and Hitler. They were joined by comrades in the USA. Their compatriots continue to cover up their depraved lifestyle today. Top historical discoveries of the century are revealed in this book, including: (1) Congress and the Flag Code confirm that the military salute was the origin of the Nazi salute. (2) The USA's Pledge of Allegiance inspired Nazi rituals. (3) Public schools spread Nazi behavior. (4) Swastikas represented crossed \"S\" letter shapes for \"socialist\" under Hitler. Top historical discoveries undisputed by the NEW YORK TIMES The Washington Post Los Angeles Times San Francisco Chronicle Tampa Bay Times Chicago Tribune Newsday The New York Times Book Review Tampa Tribune Library Journal Publishers Weekly Saint Petersburg Times People Entertainment Weekly Vogue O: The Oprah Magazine ! (They are astounding discoveries by the historian Dr. Rex Curry. To an astronomer, this would be almost like finding water on Mars. To a physician, like discovering the cure to a disease). Plus, new death of Fidel Castro bonus at no extra charge! The publisher's search continues for photographs and old film footage showing presidents, members of congress, and other officials on the federal, state, county, and city levels doing the Nazi salute to the U.S. flag. Please send any images or inquiries to the email address of the publisher mentioned in the book. A large quantity of such material is in the archives of the historian Dr. Rex Curry. Anyone who doubts that Hitler used the swastika to represent \"S\" letter shapes for \"Socialism\" is someone who believes Hitler was blind and that Hitler remained blind throughout the decades that Hitler used the symbol for his National Socialist Party. Eventually, Dr. Curry's discovery about the swastika will become so well-known and so obvious that no one will believe that Dr. Curry \"made the discovery that Hitler used the swastika to represent 'S' letter shapes for 'socialism'\" because no one will believe that there ever was a time when people could not recognize Dr. Curry's scholarship as self-evident. People will not believe that there ever was a time when the world did not notice the glaring truth about the differences between Hitler's symbol, swastikas, and their alterations. People of the future will not believe that people of today were so blind and ignorant. It will be Dr. Curry's revolutionary paradigm shift. The same path of doubt, dissemination, and eventual widespread acceptance will occur regarding Dr. Curry's discovery that the Pledge of Allegiance was the origin of the Nazi salute and Nazi behavior. It will be another revolutionary paradigm shift. \"There is rumor of a Pulitzer Prize for exposing the Pledge of Allegiance as the origin of Nazi salutes and Nazi behavior; and the swastika as alphabetical 'S' letter shaped symbolism for 'socialist.' Hooray!\" - R. Yates Bloodsworth, Stop The Pledge (STP) Foundation. \"The professor's work left us speechless!\" - Tampa Tribune Newspaper \"The symbol presently known as Lin Xun wrote a game-changer with this book.\" - Timothy Cruz \"For all the women in the world who have been christened with 'Swastika' as their name, Dr. Curry is a hero and an international treasure. His work is a welcome revelation.\" - Swastika Mukher \"Before these revelations, Americans could not speak the truth about the Pledge of Allegiance. Dr. Curry is the Rosa Parks of the pledge. He is the Ruby Bridges of the schools, having changed them forever.\" - No Pledge Publishing \"This book will make you wonder if anything you know is true.\" - Dead Writers Club\"",
  "genres": [],
  "author": "Lin Xun",
  "average_rating": "3.40",
  "url": "https://www.goodreads.com/book/show/33942049-2-girls-1-cup"
}