{
  "title": "Oakshot Complete Works of Oscar Wilde (Illustrated, Inline Footnotes)",
  "description": "Ebook specifically formatted for kindle devices and tested with all Kindle 5 way navigation functions and Kindle table of contents button. Ebook comes with main table of contents and interlinked sub table of contents. Ebook contains illustrations and inline footnotes where applicable. Each chapter is clearly marked so user knows which book within the boxset is being read. The Novels. • The Picture of Dorian Gray - Magazine Publication. • The Picture of Dorian Gray - Book Publication. The Plays. • Vera; or, The Nihilists. • The Duchess Of Padua. • Lady Windermere's Fan. • A Woman of No Importance. • Salomé. (Illustrated) • An Ideal Husband. • The Importance Of Being Earnest. • A Florentine Tragedy. • La Sainte Courtisane. The Short Story Collections. • The Happy Prince And Other Tales. • Lord Arthur Savile's Crime And Other Stories. • A House of Pomegranates. The Poetry and Sonnets. • Poems. • Uncollected Poems. • The Sphinx. • The Ballad Of Reading Gaol. • Ravenna. • Poems in Prose. • Uncollected Poems 2. The Non Fiction. • The Essays and Lectures. • The Reviews. • Shorter Prose Pieces. • Miscellanies. • Impressions of America. (Inline Footnotes) The Biographies. • The Life of Oscar Wilde by Sherard, Robert Harborough (Illustrated / Inline Footnotes) • The Trial of Oscar Wilde, from the Shorthand Reports by Charles Grolleau. (Inline Footnotes) • Recollections of Oscar Wilde by Pollard Percival, La Jeunesse Ernest, Gide André, Blei Franz. • Oscar Wilde and Myself by Douglas, Alfred Bruce, Lord. (Illustrated) • Oscar Wilde - His Life and Confessions by Frank Harris. Vol 1-2 (Illustrated/Annotated) • Oscar Wilde - An Idler's Impression by Edgar Saltus. The Criticism. • Oscar Wilde by Leonard Cresswell Ingleby. • Oscar Wilde, a Critical Study by Arthur Ransome. (Inline Footnotes)",
  "genres": [
    "Classics",
    "Fiction",
    "Poetry",
    "Plays",
    "Short Stories",
    "Literature",
    "Drama"
  ],
  "author": "Oscar Wilde",
  "average_rating": "4.47",
  "url": "https://www.goodreads.com/book/show/33963458-oakshot-complete-works-of-oscar-wilde-illustrated-inline-footnotes"
}