{
  "title": "The Brothers Locke: The Complete Series Episode 1-8",
  "description": "Sometimes the Good Guys are the Bad Boys This is our first job as master thieves and it couldn't have gone worse. We are the Brothers Mouth, Echo, and Sharp. Identical triplet brothers who live in the Dea, particularly the West of the Dea which is littered with criminals, monsters, corrupt politicians, dark magic, and mercenaries. Mouth is hard of hearing but has a voice that is powerful enough to level buildings, Echo is legally blind but can hear so well he can decipher information on radio waves, and Sharp is mute but has vision so enhanced he can see over great distances and in different spectrums of light.We were hired by this crooked guy called Von Strauss, who fancies himself a tough guy but he really isn't, to steal a box from The Miscellany, the richest and most powerful man in the West. What he didn't tell us is that what we were stealing is an ancient artifact called the Key of the Spire which made us targets of every monster, mercenary, and madman on this side of the Dea. Now, our lives are on the line almost every day as we try to find a way out of this while not allowing this maniac to destroy the Dea and us in the process.The Brothers Locke is an urban fantasy adventure that will appeal to fans of action adventure stories with a sprinkle of magic. From being hunted in sprawling cities, to being trapped by ghosts and monsters in the darkness of Black Harvester Forest, to being captured by air pirates, to battling hybrid man-bat mutants, this urban fantasy adventure is filled with vibrant characters, imaginative locations, and fast-paced action.For fans of Potter, Percy, or Peregrine, this fast-paced fantasy adventure story is for you!If you Urban fantasy stories with mysteries young adult dark fantasy epic adventures through many different environments quirky characters air pirates, monsters, and mad scientistsYou will enjoy The Brothers An Urban Fantasy Adventure.",
  "genres": [
    "Fantasy",
    "Fiction"
  ],
  "author": "K.C. Hunter",
  "average_rating": "4.75",
  "url": "https://www.goodreads.com/book/show/33956610-the-brothers-locke"
}