{
  "title": "Broken Irish",
  "description": "“Epic in its scope but relentlessly compelling in its storytelling—not a common combination—Broken Irish is a splendidly readable and richly textured novel. Edward J. Delaney is an enormously gifted writer.” —ROBERT OLEN BUTLER\"In Edward J. Delaney's South Boston little is lost, nothing forgotten. Old sins, old wounds haunt his characters, young and old, and reverberate throughout his wonderfully complicated plot. Broken Irish is an enthralling, satisfying novel.\" —MARGOT LIVESEY\"An entire community is on the brink. Hope is the only hope. And faith cannot scrub the grime off its hands. With Broken Irish, Edward J. Delaney delivers a gripping epic.\" —ADAM BRAVERAs the millennium approaches, “Southie” is still a place where little distinguishes mob bosses from pillars of industry, the bullied from the bullies, and the pious from the pitiful. In this tough Boston neighborhood, six lives are about to converge... Jimmy, an alcoholic writer, whose life is unalterably changed after witnessing an accident; Jeanmarie, a teenage runaway, whose quest for independence leads down a dark path; Christopher, a young Catholic school dropout with a gnawing secret; Colleen, a war widow whose grief has blinded her to the needs of her son; Father John, a priest on the eve of forced retirement; and Rafferty, a wealthy businessman who hires a ghostwriter to tell his story.In Broken Irish, Delaney trains his journalist’s ear, his filmmaker’s eye, and his writer’s heart on each of their stories—creating a driven and deeply human narrative that pierces the heart of the American experience. He also gives us a captivating portrait of late-1990s South Boston at the crossroads—a time when “Whitey Bulger has evaporated into the ether but his boys still kick around on the street corners... waiting for Whitey’s Second Coming.”",
  "genres": [
    "Fiction",
    "Literary Fiction",
    "Historical Fiction",
    "Contemporary",
    "Survival",
    "Ireland"
  ],
  "author": "Edward J. Delaney",
  "average_rating": "3.68",
  "url": "https://www.goodreads.com/book/show/12050073-broken-irish"
}