{
  "title": "Mistress of the Monarchy: The Life of Katherine Swynford, Duchess of Lancaster",
  "description": "Acclaimed author Alison Weir has been prolific with her books on English royalty covering everything from the Houses of York and Lancaster to the reigns of the Tudors and beyond. Now this remarkable historian brings to life the extraordinary tale of the woman who was ancestor to them all: Katherine Swynford, a royal mistress who was to become one of the most crucial figures in the history of the British royal dynasties.Born in the mid-fourteenth century, Katherine de Roët was only twelve when she married Hugh Swynford, an impoverished knight. But her story had already begun when, at just ten years old, she was appointed to the household of John of Gaunt, Duke of Lancaster and fourth son of King Edward III, to help look after the Duke’s children. Widowed at twenty-one, Katherine, gifted with beauty and undeniable charms, was to become John of Gaunt’s mistress.Their years together played out against a backdrop of court life at the height of the Age of Chivalry. Katherine experienced the Hundred Years’ War, the Black Death, and the Peasants’ Revolt. She survived heartbreak and adversity, and crossed paths with many eminent figures of the day, among them her brother-in-law, the poet Geoffrey Chaucer. Yet as intriguing as she was to many of her contemporaries, there were those who regarded her as scandalous and dangerous. Throughout the years of their illicit union, John and Katherine were clearly devoted to each other, and in middle age, after many twists of fortune, they wed. The marriage caused far more scandal than the affair had, for it was unheard of for a royal prince to wed his mistress. Yet Katherine triumphed, and her children by John, the Beauforts, would become the direct forebears of the Royal Houses of York, Tudor, and Stuart, and of every British sovereign since 1461 (as well as four U.S. presidents).Drawing on rare documentation, Alison Weir paints a vivid portrait of a passionate spirit who lived one of medieval England’s greatest love stories. Mistress of the Monarchy reveals a woman ahead of her time–making her own choices, flouting convention, and taking control of her destiny. Indeed, without Katherine Swynford the course of English history, perhaps even the world, would have been very different.",
  "genres": [
    "History",
    "Biography",
    "Nonfiction",
    "Historical",
    "Medieval",
    "British Literature",
    "Biography Memoir"
  ],
  "author": "Alison Weir",
  "average_rating": "3.86",
  "url": "https://www.goodreads.com/book/show/3397050-mistress-of-the-monarchy"
}