{
  "title": "What Girls Learn",
  "description": "In the most moving and emotionally stirring fictional debut since Anna Quidlen's One True Thing or Mona Simpson's Anywhere But Here, Karin Cook gives us a novel about girls and their mothers, about sibling rivalry and kinship, about the mysterious tug between love and antagonism that lies at the heart of every family. The year Tilden turns twelve, her mother, Frances, falls in love and moves the family north. Soon the watchful, wise Tilden and her rebellious younger sister, Elizabeth, are navigating a new household amidst the awkward and alluring terrain of adolescence.But when Frances suddenly discovers a lump in her breast, her daughters must confront the unpredictablility of her illness.  With heartbreak and humor, these characters exposes a world of secrets and learn to survive in the face of life's contradictions. Funny, haunting, and unflinchingly truthful on every page, What Girls Learn is a book that will be read--and cherished-- for years to come.From Worldcat:What Girls Learn takes readers on an intimate and haunting journey into the landscape of girlhood and the complex terrain of the family. Wise, bittersweet, and above all intensely human, this astonishingly powerful novel enchants readers with its humor and insight even as it breaks their hearts. In this emotional novel, Tilden, an adolescent girl, & her slightly younger sister move with their mother to suburban Long Island, where Tilden has social problems & her mother discovers she is dying of cancer. The narrator is 12-year-old Tilden of Atlanta, one of two daughters of a single mother. The story begins on a happy note as the mother finds a man and the trio move north to Long Island. Tragedy strikes when the mother is diagnosed with breast cancer. A first novel.",
  "genres": [
    "Fiction",
    "Literary Fiction",
    "Coming Of Age",
    "Illness",
    "Literature",
    "Young Adult",
    "Contemporary"
  ],
  "author": "Karin Cook",
  "average_rating": "3.53",
  "url": "https://www.goodreads.com/book/show/339613.What_Girls_Learn"
}