{
  "title": "Rush Revere y los peregrinos valientes: Aventuras a través del tiempo con estadounidenses excepcionales",
  "description": "¿Así que crees que la historia es aburrida? Un hombre llamado Rush Revere está por cambiar tu opinión, ¡más de lo que te imaginas! Prepárate para la clase de historia más emocionante de todos los tiempos con Rush Revere y los peregrinos valientes.¡Conoce al gran amigo de Rush Limbaugh: Rush Revere!  Está bien, está bien, mi nombre en realidad es Rusty—pero mis amigos me llaman Rush—. Rush Revere. Porque siempre he sido el fan número uno del tipo colonial más cool de todos los tiempos, Paul Revere. ¡Qué estrella de rock! Tanto quiso proteger al joven Estados Unidos que cabalgó por aquellas calles adoquinadas y disparejas gritando: “¡Vienen los británicos!”. Arriba de un caballo. A todo pulmón. El viento soplando, una lluvia torrencial...  Bueno, te lo puedes imaginar. Pero, ¿qué tal si pudieses ver la imagen real, volviendo atrás en el tiempo y observando con tus propios ojos cómo se creó nuestro gran país? ¿Conociendo la gente que lo hizo posible —personas como tú y yo?  ¡Agárrate de tu sombrero triangular puntiagudo porque lo puedes hacer —conmigo, Rush Revere, un aparentemente normal maestro sustituto de historia, como tu guía turístico a través del tiempo! “¿Cómo?” preguntas. Bueno, hay un portal. Y un caballo. Mi caballo que habla llamado Libertad. Y, pues, confía en mí, lograré que lleguemos allí.  Comenzaremos acompañando a una barcada de familias valientes viajando en el Mayflower en 1620. ¿Aburrido? No lo creo. El año 1620 fue bastante fenomenal, y experimentarás exactamente lo que ellos hicieron en esa difícil y peligrosa travesía por el océano. Juntos, les haremos a los peregrinos todas nuestras preguntas, descubriremos cómo viven y los acompañaremos durante el primer Día de Acción de Gracias, y mucho más.  ¡Así que ensilla tu caballo y cabalguemos! Nuestra nación excepcional está esperando ser descubierta de nuevo por excepcionales patriotas jóvenes, ¡como tú!",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Childrens",
    "Historical",
    "Young Adult",
    "Time Travel",
    "Fantasy"
  ],
  "author": "Rush Limbaugh",
  "average_rating": "4.12",
  "url": "https://www.goodreads.com/book/show/33963585-rush-revere-y-los-peregrinos-valientes"
}