{
  "title": "المرأة المخصية",
  "description": "الكتاب الأصلي صدر في لندن ، في تشرين الأول عام 1970، وترجم عنوانه للعربية في أكثر من مصدر إلى الخصي المؤنث ،وكان هذا الكتاب قد تصدر قائمة مبيعات الكتب في العالم عام 1970 ،يقول المترجم في تمهيده للكتاب : يتقصى الكتاب التجليات المختلفة للصورة النمطية أو النموذج المقولب الذي وقعت المرأة أسيرة له ، ويحللها وينتقدها ، فهذه الصورة النمطية التي ترفع المرأة إلى مستوى الآلهة المعبودة شعراً وفناً ، هي نفسها التي تفرغها من عقلها وإنسانيتها وتستخدمها وسيلة إعلانية أو سلعة في سوق السلع وهذه الصورة لم تكن من بنات أفكار الشركات ومصممي الدعايات فحسب ، بل أسهم مفكرون وأطباء ومحللون نفسيون وكتاب وشعراء في إنتاجها ، حتى ليبدو التخلص منها أشبه بحرب على مستويات متعددة ، ويضيف : الكتاب في تقصيه وتحليله ونقده لكثير من تلك الأفكار، لا يكتفي بذلك ، بل يسعى إلى تلمس ملامح مسار جديد أمام النساء ، مسار لا يمكن أن يتحقق تماماً إلا بالثورة ، ثورة لا من أجل المساواة فحسب ، بل من أجل حرية النساء التامة ،وحول عنوان الكتاب يقول إن العنوان : صادم ومستفز، وقد فكرنا ببدائل مقبولة ، لكننا وجدنا أنفسنا نعود في كل مرة إلى العنوان نفسه، كل البدائل التي فكرنا بها بدت أقل مما يريد الكتاب قوله وربما يكون من النافل القول إن بعض ما يرد في الكتاب من أفكار أو كلمات أو تعابير صادمة جاء ليؤدي وظيفة معينة في إطار بحث علمي معرفي ، وربما يحق لنا، ونحن نقدمه للقارئ العربي، أن نحرف ما قاله بعض أجدادنا ونقول : لا حياء في العلمويختم تعليق: “المرأة المخصية” ليس من النوع الذي تقرؤه ، ثم تضعه جانباً وينتهي الأمر، إنه كتاب يحرض ويُقلِق ويثير الأسئلة ، كتاب يدفعك إلى إعادة إكتشاف نفسك ، ولا يمكن أن تقرأه دون أن يترك أثراً فيكوبالإشارة إلى المؤلفة، فهي من مواليد 29 كانون الثاني عام 1939، عرفت ككاتبة وأكاديمية وإعلامية ، وأستاذة للأدب الإنجليزي الحديث ، وتعتبر أحد أبرز الأصوات النسوية في أواخر القرن العشرين ، ويصنفها البعض كالإمرأة الثانية بعد الفرنسية “سيمون دي بوفوار” ، والتي تتقاطع معها في كثير من تفاصيل حياتها، هما اللتان بدأتا حياتهما التعليمية في مدرستين دينيتين ، وانتهى بهما المطاف كصوتين نسائيين بارزين",
  "genres": [
    "Feminism",
    "Nonfiction",
    "Philosophy",
    "Politics",
    "Womens",
    "Gender",
    "Classics"
  ],
  "author": "Germaine Greer",
  "average_rating": "3.69",
  "url": "https://www.goodreads.com/book/show/33963291"
}