{
  "title": "Power: Surviving and Thriving After Narcissistic Abuse",
  "description": "\"Shahida Arabi weaves life wisdom and insight with empowering scientific research, not leaving any room for misunderstanding or doubt about the harmful nature of this form of abuse.\" —THE SHAKTI JOURNAL Pathological mind games. Covert and overt put-downs. Triangulation. Gaslighting. Projection. These are the manipulative tactics survivors of malignant narcissists are unfortunately all too familiar with. As victims of silent crimes where the perpetrators are rarely held accountable, survivors of narcissistic abuse have lived in a war zone of epic proportions, enduring an abuse cycle of love-bombing and devaluation—psychological violence on steroids. From how to heal our addiction to the narcissist to how to recognize a covert narcissist, Shahida Arabi's articles on narcissistic abuse have gained renown as some of the most accurate and in-depth depictions of this terrifying trauma, resonating with millions of survivors all over the world and receiving endorsements from numerous mental health professionals. In this essay compilation, readers can enjoy some of her most popular articles as well as new thought pieces on narcissistic what therapists have to say about malignant narcissists and how children of narcissistic parents can become trapped in the trauma repetition cycle. Survivors are offered new insights on what it means to be both a survivor and a thriver of covert manipulation and trauma. POWER teaches us that it is important to not only understand the tactics of toxic personalities but also to recognize and combat the effects of narcissistic abuse; it guides the survivor to learning, growing, healing and most importantly of all—owning their agency to rebuild their lives and transform their powerlessness into victory.",
  "genres": [
    "Psychology",
    "Self Help",
    "Nonfiction",
    "Mental Health",
    "Relationships",
    "Abuse",
    "Health"
  ],
  "author": "Shahida Arabi",
  "average_rating": "4.43",
  "url": "https://www.goodreads.com/book/show/33963221-power"
}