{
  "title": "Football Sundae",
  "description": "BILLYSpruce, Texas might be a sleepy town, but my life has never been more exhilarating since Tanner Strong strutted back into it.He was the high school heartthrob I never dared to dream of, the football star who didn't even know I existed. But now, Tanner's home from college, and his dazzling smile and frustrating charm have turned my world upside down. All summer long, I'm busy at my parents' diner, saving up for culinary school while trying not to get distracted by the local hero.Then out of the blue, I find myself alone with him—and he kisses me. Could this really be happening? What secrets is he hiding behind that perfect smile?TANNERComing back to Spruce means facing my past—and the boy who never left my heart, Billy Tucker.College football might be tough, but it's nothing compared to admitting my feelings for Billy. He's grown into an incredible man—kind, smart, and hopelessly cute. Every time I see him at the diner, my heart does backflips. But how do I tell him I've been crushing on him since high school?One night changes everything. Sparks fly, and suddenly, the summer becomes a whirlwind of secret moments and daring adventures. But can I convince him this isn't just a summer fling? Will he believe in a future for us beyond the heat of this crazy, undeniable chemistry between us? Football Sundae is the first book in a series of southern romances that each center on a different couple in the bright, charming small town of Spruce, Texas.✔️ M/M opposites attract✔️ Jock & dessert chef✔️ Small-townHave you read all the books in the Spruce Texas series?Football Sundae ◄◄Born Again SinnerHeteroflexibleWrangledRebel At Spruce HighSummer SweatHopeful RomanticMr. Picture PerfectHot Mess Express(with more to come!)What about the Texas Beach Town spin-off series?In Too DeepCrusherFar From Paradise(more on the way!)",
  "genres": [
    "M M Romance",
    "Romance",
    "Sports",
    "Contemporary",
    "Audiobook",
    "LGBT",
    "College"
  ],
  "author": "Daryl Banner",
  "average_rating": "4.01",
  "url": "https://www.goodreads.com/book/show/33955848-football-sundae"
}