{
  "title": "Ashes",
  "description": "“Can we give her a name? We always gave new servants names back home.”Hesperia kept her eyes on Rebecca, her mouth turned in that dark smile. “You may.”Brunhilda looked at Rebecca giddily. “Let’s call her Ella. Doesn’t she look like an Ella?”Cassandra stepped in front of her sister with the same smile as her mother. “No. Cinders. She’s so dirty. Can’t you see? Dirty, dirty, dirty. Like the cinders in the hearth.”Hesperia raised her hand to shush them. “Her name shall be Girl. There will be no confusion that way.” Hesperia crossed to Rebecca slowly. She placed the tip of her finger underneath Rebecca’s chin and raised it gently. Rebecca locked eyes with her. “When I say ‘Come, Girl.’ You will come. When I tell you ‘Girl, go and fetch me this’ or ‘Girl, go and fetch me that’ you will fetch it. When you are told to do anything, Girl, you will do it without question or regard to your self. Do I make myself clear?”Rebecca’s nostrils expanded and contracted with her racing breath. She wanted to spit in Hesperia’s eye. To drive her heel through the woman’s toes. Lilly had raised a better girl, though. Lilly had raised a lady. A lady knew when to leave.Rebecca backed down the stairs, never breaking eye contact with Hesperia until she reached the door. The girls gathered beside their mother, clasping their hands just like her with their pursed lips and sharp noses and judging eyes.“That girl is a wild one,” Hesperia said just loud enough for Rebecca to hear her. “But do not worry, my pets, we will break her like the unruly filly that she is.”In this fantastical fairy tale retell, Cinderella goes CLOCKPUNK!Rebecca Tremain’s world revolves around time.The clock people believe that we are on this earth for a reason and we only have so much time on earth to find that purpose. To the clock people, time is God. That god’s name is Khronos, and he is not forgiving.When Rebecca’s mother, Lilly, dies while working at The Corporation, a dubious factory owned by the Royal Family, Rebecca starts looking for answers. She finds them in a small group of vigilantes whose single purpose is to assassinate the royal family.When a life sentence in prison is more severe than death, will Rebecca follow through when she meets the charming prince?Don’t miss this thrilling ride full of mystery and romance.",
  "genres": [
    "Fairy Tales",
    "Fairy Tale Retellings"
  ],
  "author": "Ann  Hunter",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/33956987-ashes"
}