{
  "title": "Ψάξαμε ανθρώπους και βρήκαμε σκιές. Το αίνιγμα της τοξικομανίας",
  "description": "Με ποιό τρόπο ασκείται η καταλυτική επίδραση του κοινωνικού πάνω στο υποκείμενο της τοξικομανιακής εμπειρίας ; Πώς και πόσο δραματικά αποτυπώνονται τα χνάρια της Ιστορίας πάνω στη σπαραγμένη από αντιφάσεις ψυχική πραγματικότητα των τοξικομανών ; Μέσα από ποιές διαμεσοποιήσεις η Ιστορία του σύγχρονου ανθρώπου και του πολιτισμού του εκφράζεται στην προσωπική, δραματική ιστορία του τοξικομανούς, ναρκοθετώντας χωρίς έλεος όλο το οικοδόμημα της σύγχρονης προόδου ; Ό,τι αποκαλούμε πρόοδο, έλεγε ο Walter Bemjamin είναι εκείνη η τρομερή θύελλα που ωθεί ασταμάτητα προς το μέλλον, την ίδια στιγμή που τα ερείπια συσσωρεύονται μέχρι τον ουρανό. Ανάμεσα σ' αυτά τα ερείπια βρίσκονται και οι τοξικομανείς, άνθρωποι-σκιές, παρουσίες-απουσίες, ζωντανοί-νεκροί. Αυτοεξόριστοι από τον εαυτό τους και την ιστορία αντιπροσωπεύουν την ήττα, τη χρεοκοπία του κοινωνικού υποκειμένου μέσα σε όρους ιστορικής παρακμής. Γαιτί, όμως, πήραν αυτό το δρόμο ; Ήταν μόνο οι περιστάσεις, τα γεγονότα, τραυματικής και άλλης φύσης, που τους ώθησαν ή υπήρχε και κάτι άλλο ;Πού θα πρέπει να αναζητήσει κανείς τη λύση του αινίγματος της τοξικομανίας ; Στην εποχή μας, τα ναρκωτικά, όλες δηλαδή οι ψυχότροποι ουσίες που μπορούν να γίνουν αντικείμενο τοξικομανιακής χρήσης, έρχονται να καλύψουν θεμελιακά ελλείμματα στον ψυχισμό του ανθρώπου. Παίρνουν τη θέση μιας αινιγματικής απουσίας, της απουσίας του Άλλου, της αδύνατης επικοινωνίας.Στο βιβλίο επιχειρείται να δοθεί μια απάντηση σε όλα αυτά τα κρίσιμα ερωτήματα που αφορούν την τοξικομανία και έχουν συνέπειες στη ζωή χιλιάδων ανθρώπων. Επιχειρείται η ανάλυση της θεραπευτικής διαδικασίας απεξάρτησης στην επιστημονική της διάσταση, αναδεικνύοντας ταυτόχρονα και τις άλλες εξίσου σημαντικές διαστάσεις της, την ηθική, την ιδεολογική, την κοινωνική. Επιχειρείται επίσης μια διαλεκτική προσέγγιση των μεγάλων ζητημάτων που αφορούν τη βία, το ρίσκο, την παραβατικότητα του τοξικομανούς, τον κοινωνικό έλεγχο, το νομικό καθεστώς των ναρκωτικών και τις θεωρίες που στην εποχή μας συμβάλλουν στη δημιουργία πολλών μύθων. Σ' αυτή την προσπάθεια αποτυπώνεται η αγωνία και η επιστημονική αναζήτηση στο χώρο που δίνεται η μάχη της απεξάρτησης, στο θεραπευτικό πρόγραμμα του 18 ΑΝΩ. (Από την ιστοσελίδα του εκδότη)Αντί προλόγουO Felix Guattari για το 18 άνωΙ. ΤΟ ΑΙΝΙΓΜΑ ΤΗΣ ΤΟΞΙΚΟΜΑΝΙΑΣΙΙ. ΨΥΧΟΠΑΘΟΛΟΓΙΑ ΓΙΑ ΧΡΗΣΗ ΟΥΣΙΩΝΙΙΙ. Η ΘΕΡΑΠΕΙΑ ΑΠΕΞΑΡΤΗΣΗΣ ΩΣ ΔΙΑΔΙΚΑΣΙΑ ΒΑΘΙΑΣ ΑΛΛΑΓΗΣIV. ΤΕΧΝΗ ΚΑΙ ΘΕΡΑΠΕΙΑ. Η ΔΙΑΛΕΚΤΙΚΗ ΤΟΥΣ ΣΥΝΘΕΣΗ ΣΤΟ ΠΛΑΙΣΙΟ ΤΗΣ ΑΠΕΞΑΡΤΗΣΗΣV. Ο ΤΟΞΙΚΟΜΑΝΗΣ ΣΤΟ ΡΟΛΟ ΤΟΥ ΕΞΙΛΑΣΤΗΡΙΟΥ ΘΥΜΑΤΟΣ ΤΗΣ ΟΙΚΟΓΕΝΕΙΑΣ ΚΑΙ ΤΗΣ ΚΟΙΝΩΝΙΑΣVI. ΝΑΡΚΩΤΙΚΑ ΚΑΙ ΚΟΙΝΩΝΙΚΟΣ ΕΛΕΓΧΟΣ",
  "genres": [
    "Psychology"
  ],
  "author": "Κατερίνα Μάτσα",
  "average_rating": "4.35",
  "url": "https://www.goodreads.com/book/show/33960087"
}