{
  "title": "Not So Smart",
  "description": "An angsty virgin who might be a little twisted.A moody manwhore who might be a little lonely.All they wanted was to use each other for one dirty, kinky night.Feelings were absolutely not part of the plan.\n\"It wasn't obsession, exactly. Except, it probably was.\"\nJOSHDamon Price is a brutally hot, ripply muscled, scarily confident, dimpled god. Without his hard body to stare at three times a week, I probably would have dropped out of college months ago. Too bad he doesn't know I exist. But, even if he did know, even if it was true that he screwed anything and everything that moved, an awkward virgin like me would still be at the bottom of his to-do list.Even if he knew the kind of filthy stuff I actually wanted.Even if he knew the last thing I need is any kind of relationship.\n\"I never meant to f*ck a virgin.\"\nDAMONI should have been out the door the second that word came out of his mouth. A virgin was not what I was looking for. Except, damn, he knew how to talk. Knew how to say things so off-the-grid dirty I hardly knew what to say back. And talk wasn't all he knew how to do. There's kinky, and then there's crazy, and then, apparently, there's Josh Holloway-- who's up for anything.And who I definitely should not still be thinking about.Because the last thing I need is any kind of relationship.NOT SO SMART is a 52,000 word enemies-to-(still-mostly-enemies-but-also-)lovers novel, featuring messed up college guys who are great at lying to themselves, wall to wall sex, naked guitar playing, inappropriate library behavior, inappropriate dressing room behavior, inappropriate tube sock behavior, bondage, spanking, little bit of shoplifting, and some very unwelcome romantic feelings.**NOT SO SMART is based on a previously published short story series (Smart Boy). It has been substantially re-edited and expanded by 30,000 words.",
  "genres": [
    "M M Romance",
    "BDSM",
    "Romance",
    "Contemporary",
    "College",
    "Erotica",
    "Enemies To Lovers"
  ],
  "author": "Misha Horne",
  "average_rating": "3.86",
  "url": "https://www.goodreads.com/book/show/33978113-not-so-smart"
}