{
  "title": "Haunting the Deep",
  "description": "The Titanic meets the delicious horror of Ransom Riggs and the sass of Mean Girls in this follow-up to the #1 New York Times bestseller How to Hang a Witch,  in which a contemporary teen finds herself a passenger on the famous \"ship of dreams\"--a story made all the more fascinating because the author's own relatives survived the doomed voyage.  Samantha Mather knew her family's connection to the infamous Salem Witch Trials might pose obstacles to an active social life. But having survived one curse, she never thought she'd find herself at the center of a new one.This time, Sam is having recurring dreams about the Titanic . . . where she's been walking the deck with first-class passengers, like her aunt and uncle. Meanwhile, in Sam's waking life, strange missives from the Titanic have been finding their way to her, along with haunting visions of people who went down with the ship.Ultimately, Sam and the Descendants, along with some help from heartthrob Elijah, must unravel who is behind the spell that is drawing her ever further into the dream ship . . . and closer to sharing the same grim fate as its ghostly passengers. Praise for How to Hang a \"It's like Mean Girls meets history class in the best possible way.\" --Seventeen Magazine\"Mather shines a light on the lessons the Salem Witch Trials can teach us about modern-day bullying--and what we can do about it.\" --Bustle.com\"Strikes a careful balance of creepy, fun, and thoughtful.\" --NPR\"I am utterly addicted to Adriana Mather's electric debut. It keeps you on the edge of your seat, twisting and turning with ghosts, witches, an ancient curse, and--sigh--romance. It's beautiful. Haunting. The characters are vivid and real. I. Could. Not. Put. It. Down.\" --Jennifer Niven, bestselling author of All the Bright Places",
  "genres": [
    "Young Adult",
    "Fantasy",
    "Paranormal",
    "Witches",
    "Historical Fiction",
    "Ghosts",
    "Mystery"
  ],
  "author": "Adriana Mather",
  "average_rating": "4.24",
  "url": "https://www.goodreads.com/book/show/33977969-haunting-the-deep"
}