{
  "title": "The Essential Book of Jewish Festival Cooking: 200 Seasonal Holiday Recipes and Their Traditions",
  "description": "Deeply rooted in ancient rituals, the seasonal rhythms of the land of Israel, and biblical commandments, the Jewish holidays mark a time for Jews around the world to reconnect with their spiritual lives, celebrate their history, and enjoy tasty foods laden with symbolic meaning. With Phyllis and Miriyam Glazer's The Essential Book of Jewish Festival Cooking as your guide, you will gain a rich understanding of the Jewish calendar year and its profound link to the signs of nature and the produce of the earth in each season. This landmark volume addresses a central question often left Why do we eat what we eat on these important days? Organized by season, the ten chapters cover the major holidays and feast days of the Jewish year, providing more than two hundred tempting recipes, plus menus and tips for creative and meaningful holiday entertaining. In-depth essays opening each chapter illuminate the origins, traditions, and seasonal and biblical significance of each holiday and its foods, making the book a valuable resource for Jewish festival observance. Inspired recipes add a fresh, contemporary twist as they capture the flavors of the seasonal foods enjoyed by our ancestors. For Passover, prepare such springtime delights as Roasted Salmon with Marinated Fennel and Thyme, alongside Braised \"Bitter Herbs\" with Pistachios. On Shavuot, characterized by the season's traditional bounty of milk and the wheat harvest, try fresh homemade cheeses; creamy, comforting Blintzes; or luscious Hot and Bubbling Semolina and Sage Gnocchi. At Purim, create a Persian feast fit for a king and learn new ideas for mishloah manot, the traditional gifts of food. The Essential Book of Jewish Festival Cooking offers accessible, healthful, and intensely flavorful recipes with a unique and tangible connection to the rhythms of the Jewish year. The Glazer sisters will deepen your understanding of time-honored traditions as they guide you toward more profound, and delicious, holiday experiences.",
  "genres": [
    "Cookbooks",
    "Jewish"
  ],
  "author": "Phyllis Glazer",
  "average_rating": "4.08",
  "url": "https://www.goodreads.com/book/show/1205084.The_Essential_Book_of_Jewish_Festival_Cooking"
}