{
  "title": "Buck Baxter, Love Detective",
  "description": "Hard-boiled 1920s private detective Buck Baxter isn’t interested in falling in love… that is until his latest mystery leads him straight into the arms of playboy Holden Hart. But what will Buck end up breaking first—a seemingly unsolvable case or his own heart?Welcome to Wilde City, 1924—a crane on top of every skyscraper, a party in every club, a romance on every dance floor, a shooting every night, a broken heart on every street corner and a dirty secret behind every window with the curtain drawn. It’s the kinda town that keeps Buck Baxter, private detective, in business.For despite his fondness for a cold gin and a pipe stuffed with cannabis, Buck is the best gumshoe in Wilde City. Why? Because he has never make friends, never make enemies, and never ever fall in love. That is until the day that playboy nightclub owner Holden Hart swings into town. He’s suave, he’s charming, he’s chivalrous… and he’s exactly the kinda man that Buck will break all the rules for.From the romance of the Rainbow Palace atop the Wilde City Tower, to the dazzling debauchery of the gentlemen’s parlor The Velvet Viper—from the history surrounding the sinister convent on the hill better known Hell’s Bells, to the lantern-lit opium barge, The Peking Empress, run by the mystical Madame Chang—could Buck be about to unravel the greatest mystery of them all...The mystery of love?Buck Baxter, Love Detective is the first adventure in the Buck Baxter Mysteries. It is a campy, noir, 30k-word detective story featuring a tough and troubled leading man, a heartthrob love interest with secrets of his own and a hilarious cast of supporting characters. Enter a world of prohibition, gangsters, speakeasies, jazz clubs, star-crossed romance, brooding heroes and a mystery with a twist.",
  "genres": [
    "M M Romance",
    "Historical",
    "Mystery",
    "Romance",
    "Historical Fiction",
    "LGBT",
    "Historical Romance"
  ],
  "author": "Geoffrey Knight",
  "average_rating": "3.96",
  "url": "https://www.goodreads.com/book/show/33984326-buck-baxter-love-detective"
}