{
  "title": "Bitten",
  "description": "An alternate cover for this ASIN can be found here.Harper is a young girl who grew up in a special town, a town called Linbridge. What’s so special about this town? Well, it might be the simple fact that most of its residents are vampires. They aren’t the bloodthirsty type though. They only want to live in peaceful harmony with the humans surrounding them. Of course no one dares to defy the rules that the vampires have placed over the town.When Harper’s eighteenth birthday comes it comes with the chance to become a protected or an unclaimed. The protected are well taken care of by their vampire protectors while the unclaimed are fair game for whatever goes bump in the night.A week before her birthday her current protector, Finnick, rejects his claim to continue being her protector. Harper’s whole world changes in an instant but it’s not all bad. She meets a few new friends. There’s a connection she has with them, one that she can’t exactly explain. Along with the new friends she is reunited with an old one, Alex. He’s one of the unclaimed.Just when things seem to be at their best, everything once again crumbles down around Harper. Lies are uncovered and some truths are revealed. There’s a bigger picture to Harper’s connection with her newest friends. They aren’t what they seem. In fact they aren’t even human. They’re vampires, part of a vampire clan to be precise and they hunt down other vampires who break the laws of their kind.Harper soon falls for one of the clan members but it all comes unraveled with the sudden appearance of an old flame. Clara has held the clans hearts for centuries.Will Clara’s past with the clan destroy everything Harper has or will another threat take her life away? Can love prevail or will it only destroy her more?Harper may run but she won’t be able to hide forever.",
  "genres": [
    "Reverse Harem",
    "Vampires",
    "Paranormal"
  ],
  "author": "Raven K. Asher",
  "average_rating": "3.61",
  "url": "https://www.goodreads.com/book/show/33984584-bitten"
}