{
  "title": "The Clock King and the Queen of the Hourglass",
  "description": "A far future \"dying earth\" science fantasy tale about identity, erotic desire, flying water and a mystery...\"This is science fiction the way that Jack Vance's Dying Earth books are science fiction.\" — Charles de Lint\"... believable character development, glimpses of science behind the solemn nomenclature, and enough irreverence to permit an occasional smile. Whether you expect a royal convergence, romantic destiny, or just a boost to a lackluster gene pool, what you’ll get is less definitive — and more interesting.\" — Faren Miller, LocusLocus Recommended Reading List, 2005.Rich Horton' Virtual Best of the Year 2005.THE CLOCK KING AND THE QUEEN OF THE HOURGLASSMany billion years in the future, the sun is a huge bloated golden Day God that fills the sky, and the earth is a barren desert. The last remaining water has pooled at the bottom of the Pacific Basin in a thick toxic sludge-lake called the Oceanus by the sterile post-humans that inhabit its salt-encrusted shores.Liaei is different from the others. She is a fertile female created out of ancient homo sapiens DNA from the dwindling genetic stores, and has been manufactured by the horticulturists in a genetics lab. Liaei has been brought to life for one mysterious purpose -- she is to become the Queen of the Hourglass.Growing up in Basin City, fostered by the quasi-female modern human Amhama -- the same technician who put her cells together -- Liaei knows she does not belong. She is lively and vibrant and has a savage full head of hair and eyebrows unlike the smooth doll-like humans around her. She is also curious and inquisitive, asking more questions than even the harmonium in all its complexity can answer -- harmonium technology powers everything, can regurgitate histories of civilizations, process liquid toxic waste, conjure music out of the air, run the agricultural hothouses, and fly hovercars, and yet its origins too have been lost in the murk of the ages and it cannot satisfy the restless mind of Liaei.What does it mean to be the Queen of the Hourglass? Why do love and emotions seem to mean other things to her than to others? And what is that meandering ribbon of light up on the distant Basin Walls, a mysterious bit of ancient technology called The River That Flows Through the Air? Can water flow uphill?Soon, when she reaches ancient sexual maturity and undergoes the proper training, the Queen of the Hourglass will embark on a journey to meet her consort the Clock King, and there will be even more questions.But now, the harmonium-based machines are failing, and suddenly humanity is running out of time.",
  "genres": [
    "Dying Earth",
    "Science Fiction",
    "Fantasy",
    "Fiction"
  ],
  "author": "Vera Nazarian",
  "average_rating": "3.29",
  "url": "https://www.goodreads.com/book/show/12051522-the-clock-king-and-the-queen-of-the-hourglass"
}