{
  "title": "The Complete Treemakers Trilogy",
  "description": "From “The Treemakers” The words of sixteen-year-old Joy Montgomery's late father, Zephyr the Magnificent, urge her onward in this quest for truth and freedom, with the allusion that all is not as it seems in Bygonne. Faced with the exhausting task of building mechanical trees that produce the precious oxygen they breathe, the Greenleigh orphan slaves piece together clues about the existence of a possible forbidden paradise beyond The Wall. To find the truth, shatter the illusions, and free the children, Joy must entrust the aid of an unlikely ally who harbors dangerous secrets. From “The Soultakers” “What a journey you have been on, Joy Montgomery. But it isn’t over yet . . . . No . . . I’m afraid you have much farther to go.” Joy Montgomery is a hero. The Treemakers are finally home, safe, and free in a well-deserved and long awaited paradise. The children can now settle into normal, carefree lives. Or so they thought. Troubled by secrets their newfound paradise reveals, coupled with tangled feelings toward those she loves, Joy sees the painful truth: they’re still prisoners forever wounded by the effects of a traumatic past. An ominous warning from a trusted friend strengthens her resolve to never let down her guard, to always be prepared, to be ready for war . . . both inside and out. Once again, the Treemakers are faced with escaping disaster, and Joy’s strength is pushed to its limit, her sanity pushed to the brink of collapse. Just when their situation couldn’t get any more desperate, they’re thrust into a series of shocking tribulations that are nothing short of nightmarish. Will the Treemakers of Greenleigh annihilate the forces of evil that seek to capture and control their souls? Or will the magic Joy thought she'd found be just another illusion? From “The Seeker’s Keys” Joy Montgomery’s life has never been as it seems. She knows this now. Her tragic journey has been a complex mirage of dreams and illusions set in place by her ancestors’ secrets and driven by the calculated genius of her late father, Zephyr the Magnificent. In the Greenleigh Tree Factory, under the rule of the wretched Superiors, he’d prepared her for this future as if he’d already known the outcome. He’d instilled into her the quest for truth, freedom, and love, and had given her the strength to guard with her life those she now protects, some of whom she must risk her life to save. Now, the treemakers and the saltminers are split over Bygonne. They must acquire the Seeker’s Keys with the help of Zephyr’s clues, which also must be found along the way. Stakes are high, war is coming, and now, Joy has everything to lose. Will they be triumphant, like Cheyenne said they’d be, and grasp the promised victory? Or will they face defeat at the hands of Lord Daumier and lose the future waiting for them on the other side of The Wall? “What did you see in me?” “That you’re a hero. You’re my hero.” “I’m no hero, Joy. Don’t ever forget this, okay? You’re the light in the dark. You’re the love that conquers fear and evil. You’re the hero, Joy. You always have been, and you always will be.” The internationally bestselling Treemakers Trilogy is a series that appeals to fans of The Maze Runner, Divergent, and The Hunger Games. With heart-pumping action and spine-tingling plot twists, this series is sure to leave you flipping pages until the wee hours of the morning. (YA Dystopian Scifi Horror)",
  "genres": [
    "Dystopia"
  ],
  "author": "Christina L. Rozelle",
  "average_rating": "4.31",
  "url": "https://www.goodreads.com/book/show/34009589-the-complete-treemakers-trilogy"
}