{
  "title": "Hoover: An Extraordinary Life in Extraordinary Times",
  "description": "The definitive biography of Herbert Hoover, one of the most remarkable Americans of the twentieth century—a wholly original account that will forever change the way Americans understand the man, his presidency, his battle against the Great Depression, and their own history.An impoverished orphan who built a fortune. A great humanitarian. A president elected in a landslide and then resoundingly defeated four years later. Arguably the father of both New Deal liberalism and modern conservatism, Herbert Hoover lived one of the most extraordinary American lives of the twentieth century. Yet however astonishing, his accomplishments are often eclipsed by the perception that Hoover was inept and heartless in the face of the Great Depression.Now, Kenneth Whyte vividly recreates Hoover’s rich and dramatic life in all its complex glory. He follows Hoover through his Iowa boyhood, his cutthroat business career, his brilliant rescue of millions of lives during World War I and the 1927 Mississippi floods, his misconstrued presidency, his defeat at the hands of a ruthless Franklin Roosevelt, his devastating years in the political wilderness, his return to grace as Truman’s emissary to help European refugees after World War II, and his final vindication in the days of Kennedy’s “New Frontier.” Ultimately, Whyte brings to light Hoover’s complexities and contradictions—his modesty and ambition, his ruthlessness and extreme generosity—as well as his profound political legacy.Hoover: An Extraordinary Life in Extraordinary Times is the epic, poignant story of the deprived boy who, through force of will, made himself the most accomplished figure in the land, and who experienced a range of achievements and failures unmatched by any American of his, or perhaps any, era. Here, for the first time, is the definitive biography that fully captures the colossal scale of Hoover’s momentous life and volatile times.",
  "genres": [
    "Biography",
    "History",
    "Presidents",
    "Nonfiction",
    "American History",
    "Us Presidents",
    "Politics"
  ],
  "author": "Kenneth Whyte",
  "average_rating": "4.35",
  "url": "https://www.goodreads.com/book/show/33998241-hoover"
}