{
  "title": "The Last Place on Earth",
  "description": "On 12/14/1911, the classical age of polar exploration ended when Norway's Roald Amundsen conquered the South Pole. His competitor for the prize, Britain's Robert Scott, arrived a month later--but died on the return with four of his men only 11 miles from their next cache of supplies. But it was Scott, ironically, who became the legend, Britain's heroic failure, \"a monument to sheer ambition & bull-headed persistence. His achievement was to perpetuate the romantic myth of the explorer as martyr, &...to glorify suffering & self-sacrifice as ends in themselves.\" The world promptly forgot about Amundsen. Biographer Huntford's attempt to restore Amundsen to glory was 1st published in 1979 under the title Scott & Amundsen. The Last Place on Earth is a complex account of the race for this last great terrestrial goal. It's pointedly geared toward demythologizing Scott. Tho this was the age of the amateur explorer, Amundsen was a professional. He left little to chance, apprenticed with Eskimos & obsessed over every detail. While Scott clung fast to the British rule of \"No skis, no dogs,\" Amundsen understood that both were vital to survival. They clearly won him the Pole. Amundsen in Huntford's view is the \"last great Viking\" & Scott his bungling opposite: \"stupid...recklessly incompetent,\" & irresponsible in the extreme--failings that cost him & his teammates their lives. Yet for all of Scott's real or exaggerated faults, he understood far better than Amundsen the power of a well-crafted sentence. Scott's diaries were recovered & widely published. If the world insisted on lionizing Scott, it was partly because he told a better story. Huntford's bias aside, it's clear that both Scott & Amundsen were valiant & deeply flawed. \"Scott...had set out to be an heroic example. Amundsen merely wanted to be 1st at the pole. Both had their prayers answered.\"--Svenja Soldovieri (edited)",
  "genres": [
    "History",
    "Nonfiction",
    "Adventure",
    "Biography",
    "Travel",
    "Historical",
    "Biography Memoir"
  ],
  "author": "Roland Huntford",
  "average_rating": "4.35",
  "url": "https://www.goodreads.com/book/show/3399555-the-last-place-on-earth"
}