{
  "title": "Future War: Preparing for the New Global Battlefield",
  "description": "An urgent, prescient, and expert look at how future technology will change virtually every aspect of war as we know it and how we can respond to the serious national security challenges ahead.Future war is almost battles fought in cyberspace; biologically enhanced soldiers; autonomous systems that can process information and strike violently before a human being can blink.     A leading expert on the place of technology in war and intelligence, Robert H. Latiff, now teaching at the University of Notre Dame, has spent a career in the military researching and developing new combat technologies, observing the cost of our unquestioning embrace of innovation. At its best, advanced technology acts faster than ever to save the lives of soldiers; at its worst, the deployment of insufficiently considered new technology can have devastating unintended or long-term consequences. The question of whether we can is followed, all too infrequently, by the question of whether we should.     In Future War, Latiff maps out the changing ways of war and the weapons technologies we will use to fight them, seeking to describe the ramifications of those changes and what it will mean in the future to be a soldier. He also recognizes that the fortunes of a nation are inextricably linked with its national defense, and how its citizens understand the importance of when, how, and according to what rules we fight. What will war mean to the average American? Are our leaders sufficiently sensitized to the implications of the new ways of fighting? How are the attitudes of individuals and civilian institutions shaped by the wars we fight and the means we use to fight them? And, of key How will soldiers themselves think about war and their roles within it?     The evolving, complex world of conflict and technology demands that we pay more attention to the issues that will confront us, before it is too late to control them. Decrying what he describes as a \"broken\" relationship between the military and the public it serves, Latiff issues a bold wake-up call to military planners and weapons technologists, decision makers, and the nation as a whole as we prepare for a very different future.",
  "genres": [
    "Military Fiction",
    "Nonfiction",
    "Technology",
    "War",
    "Politics",
    "Audiobook",
    "Science"
  ],
  "author": "Robert H. Latiff",
  "average_rating": "3.64",
  "url": "https://www.goodreads.com/book/show/34002976-future-war"
}