{
  "title": "Stretto",
  "description": "Stretto , the grand finale of the Marq’ssan Cycle, weaves together the major threads of the Marq’ssan story and encourages readers, as Joan Haran says, “to write beyond the ending.” The novel, like the series as a whole, inquires Whose world is it? and shows several possible ways of answering the question through the respective perceptions and perspectives of the novel’s five viewpoint Alexandra Sedgewick, heir to the Sedgewick estate; Anne Hawthorne, Security operative; Hazel Bell, subversive activist; Celia Espin, human rights lawyer; and Emily Madden, star pupil of the maverick Marq’ssan, Astrea l Betut san Imu. As always, never predictable, never finished, the consequences of all that has gone before continues to play out. Praise for Stretto “The final volume in the Marq’ssan series will encourage its readers to write beyond the ending. There are no gift-wrapped resolutions or easy redemptions on offer, rather there is a clear-sighted focus on the always-unfolding consequences—intended and unintended—of personal and political action taken. This is a series that is deeply invested in social transformation while resisting any temptation to consolation. As a resolute utopian, I see this as a hopeful strategy.”— Joan Haran, author of Human Cloning in the Media Reviews “Like its predecessors, this is very much a novel of ideas and personal relations rather than of action or adventure. The author is more interested in the clash of ideas than in describing pitched battles in the streets of Washington. If you enjoy books designed to stimulate thought as well as entertain you, Duchamp’s speculations about the forms of government and the ways in which people in power interact should prove very rewarding.”— Donald D’Ammassa, Critical Mass “It is this awareness of the varying reactions (and not just a simplistic dichotomy) to such radical change from government to anarchy (keeping in mind this is not synonymous with chaos, but merely the complete lack of government agency and agencies) that imbues the series with such power. Characters are not merely mouthpieces, but are fully fleshed out and more importantly, their arguments are fully fleshed out. Duchamp does not use straw men and women. She challenges her own thoughts and assumptions. Her novels are the strongest utopias written to date.”— Sean Mellacin, Idomancer “ Stretto , the fifth and final book in L. Timmel Duchamp’s stunning Marq’ssan Cycle, has just been published by Aqueduct Press. Taken as a whole, the Marq’ssan Cycle is one of the most ambitious political SF series to appear in the last twenty years. The novels have received praise from the likes of Samuel Delany and Cory Doctorow, with Doctorow calling them ‘a refreshing read and a rare example of deft political storytelling.’”— Jeff VanderMeer, Omnivoracious",
  "genres": [
    "Fiction",
    "Science Fiction"
  ],
  "author": "L. Timmel Duchamp",
  "average_rating": "4.25",
  "url": "https://www.goodreads.com/book/show/3400051-stretto"
}