{
  "title": "Peace of Mind (Paz de Espirito): A Whisper of Sexual Exploration: Cortez Deandreas Santiago's Pursuit of Serenity and Intimacy: Volume 2",
  "description": "First introduced in Healing a Lifetime of Pain--The Story of Cortez DeAndreAs Santiago--Volume 1, Cortez continues his journey toward self-awareness and emotional fulfillment through seduction, pleasure and pain, homoerotic desires, and a prospective true and honest love.The journey itself is full of twists and turns, different men vying for his attention, his sexuality, and his emotions. Cortez faces a number of challenges to his ethical standards, which he must overcome: an open relationship, an epiphany of his true desires, his voyeuristic fantasies, a mEnage A trois encounter, sexting and eventually falling in love for the second time with another man.Peace of Mind (Paz de EspIrito)--A Whisper of Sexual Exploration: Cortez DeAndreAs Santiago's Pursuit of Serenity and Intimacy--Volume 2 is a stimulating story profoundly guided and governed by ethics and morality, human sexuality, provocative, and/or salacious, noteworthy homoerotic desires.It's a tale of life's gratifications, disappointments, and frustrations, including family betrayals, tragedies, and feelings of worthlessness and despair. A decade in the making, this follow-up novel chronicles Cortez's astonishing journey toward self-discovery and the relinquishment of a desire to taste, touch, and feel the warmth of another man in his life.JAthan Vandez took a leap of faith and became a published author. After having his ﬁrst novel successfully published, he continued writing his three additional novels (volumes 2 through 4).JAthan's philosophy or belief is that life is an astonishing journey with highs and lows; we as human beings are all ﬂ awed and have the desire to be happy and live a joyful, serene, and full-bodied life.",
  "genres": [],
  "author": "Jathan Vandez",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/34006371-peace-of-mind-paz-de-espirito"
}