{
  "title": "A History of Psychiatry: From the Era of the Asylum to the Age of Prozac",
  "description": "From Back Cover:In A History of Psychiatry, Edward Shorter shows us the harsh, farcical, and inspiring realities of society's changing attitudes toward and attempts to deal with its mentally ill and the efforts of generations of scientists and physicians to ease their suffering. He paints vivid portraits of psychiatry's leading historical figures and pulls no punches in assessing their roles in advancing or sidetracking our understanding of the origins of mental illness.Shorter also identifies the scientific and cultural factors that shaped the development of psychiatry. He reveals the forces behind the unparralleled sophisitication of psychiatry in Germany during the eighteenth and nineteenth centuries as well as the emergence of the United States as the world capital of psychoanalysis. This engagingly written, thoroughly researched, and fiercely partisan account is compelling reading for anyone with a personal, intellectual, or professional interest in psychiatry.Description from Goodreads User:The history of madness and its treatment is a fascinating one. At one time, the mentally ill were diagnosed as demonically possessed; later, when mental illness became the province of psychoanalysts, those conditions that are actually physical in nature, such as schizophrenia or manic depression, went insufficiently treated, their sufferers consigned to asylums. In his book, A History of Psychiatry, Edward Shorter, a medical historian at the University of Toronto, presents a concise chronology of mental illness and its treatment. Shorter favors a biological understanding of these disorders, concentrating on medical approaches to helping the seriously mentally ill.",
  "genres": [
    "Psychology",
    "History",
    "Psychiatry",
    "Nonfiction",
    "Mental Health",
    "Medicine",
    "Science"
  ],
  "author": "Edward Shorter",
  "average_rating": "3.68",
  "url": "https://www.goodreads.com/book/show/340199.A_History_of_Psychiatry"
}