{
  "title": "Cigarettes & Wine",
  "description": "Imagine the terror and exhilaration of a first sexual experience in a church where you could be caught at any moment. In \nCigarettes & Wine\n, this is where we meet an unnamed teenage narrator in a small southern town trying to make sense of their own bisexuality, gender variance, and emerging adulthood. When our narrator leaves the church, we watch their teen years unfold alongside one first love wrestling with his own sexuality and his desire for a relationship with God, and another first love seeking to find herself as she moves away from town. Through the narrator's eyes, we also encounter a newly arrived neighbor who appears to be an all American boy, but has secrets and pain hidden behind his charming smile and athletic ability, and their oldest friend who is on the verge of romantic, artistic, and sexual transformations of her own. Along the way, these friends confront questions about gender and sexuality, violence and substance abuse, and the intricacies of love and selfhood in the shadow of churches, families, and a small southern town in the 1990's. Alongside academic and media portrayals that generally only acknowledge binary sexual and gender options, \nCigarettes & Wine\n offers an illustration of non-binary sexual and gender experience, and provides a first person view of the ways the people, places, and narratives we encounter shape who we become. While fictional, \nCigarettes & Wine\nis loosely grounded in hundreds of formal and informal interviews with LGBTQ people in the south as well as years of research into intersections of sexualities, gender, religion, and health. \nCigarettes & Wine\n can be read purely for pleasure or used as supplemental reading in a variety of courses in sexualities, gender, relationships, families, religion, the life course, narratives, the American south, identities, culture, intersectionality, and arts-based research.",
  "genres": [
    "LGBT",
    "Queer",
    "Fiction"
  ],
  "author": "J.E. Sumerau",
  "average_rating": "4.36",
  "url": "https://www.goodreads.com/book/show/34016738-cigarettes-wine"
}