{
  "title": "Heat: How to Stop the Planet From Burning",
  "description": "How to Stop the Planet From Burning marks an important moment in our civilization’s thinking about global warming. The question is no longer Is climate change actually happening? but What do we do about it? George Monbiot offers an ambitious and far-reaching program to cut our carbon dioxide emissions to the point where the environmental scales start tipping back—away from catastrophe.Though writing with a \"spirit of optimism,\" Monbiot does not pretend it will be easy. The only way to avoid further devastation, he argues, is a 90% cut in CO2 emissions in the rich nations of the world by 2030. In other words, our response will have to be immediate, and it will have to be decisive.In every case he supports his proposals with a rigorous investigation into what works, what doesn’t, how much it costs, and what the problems might be. He wages war on bad ideas as energetically as he promotes good ones. And he is not afraid to attack anyone—friend or foe—whose claims are false or whose figures have been fudged.After all, there is no time to waste. As Monbiot has said himself, \"we are the last generation that can make this happen, and this is the last possible moment at which we can make it happen.\"George Monbiot is the best-selling author of The Age of Consent and Captive State , as well as the investigative travel books Poisoned Arrows , Amazon Watershed , and No Man’s Land . In 1995, Nelson Mandela presented him with a United Nations Global 500 Award for outstanding environmental achievement. He has held visiting fellowships or professorships at the universities of Oxford (environmental policy), Bristol (philosophy), Keele (politics), and East London (environmental science). Currently visiting professor of planning at Oxford Brookes University, he writes a weekly column for the Guardian newspaper.",
  "genres": [
    "Nonfiction",
    "Environment",
    "Science",
    "Climate Change",
    "Sustainability",
    "Politics",
    "Economics"
  ],
  "author": "George Monbiot",
  "average_rating": "4.05",
  "url": "https://www.goodreads.com/book/show/340289.Heat"
}