{
  "title": "Electing Not to Vote: Christian Reflections on Reasons for Not Voting",
  "description": "Description: Ethical discourse about the institution of voting rarely includes the option of abstaining for principled reasons. This collection of nine articles widens the discussion in that direction by giving readers a new question: At what point and on what grounds might one choose not to vote as an act of conscience? Contributors offer both ethical and faith-based reasons for not voting. For some, it is a matter of candidates not measuring up to high standards; for others it is a matter of reserving political identity and allegiance for the church rather than the nation-state. These writers--representing a wide range of Christian traditions--cite texts from diverse sources: Mennonites, Pentecostals, and pre-Civil Rights African Americans. Some contributors reference the positions of Catholic bishops, Karl Barth, or John Howard Yoder. New Testament texts also figure strongly in these cases for \"\"conscientious abstention\"\" from voting. In addition to cultivating the ethical discussion around abstention from voting, the contributors suggest alternative ways beneficially to engage society. This volume creates a new freedom for readers within any faith tradition to enter into a dialogue that has not yet been welcomed in North America. Endorsements: People often forget that voting can be a coercive practice, just to the extent it justifies a majority's silencing of minorities. We should therefore be grateful that these essays raise an issue that too often goes undiscussed. --Stanley Hauerwas, Duke Divinity School, Duke University If the definition of a good book is that it challenges long-held and cherished opinions while inspiring readers to think new thoughts and imagine new possibilities, then this is a great book--and one that all American Christians (in particular) need to read! This diverse collection of excellent essays serves as a prophetic call for American Christians to wake up from our political slumber and realize how we've been seduced by the idols of nationalism and political power. --Greg Boyd, author of The Myth of a Christian Nation: How the Quest for Political Power is Destroying the Church (2006) Half the electorate typically stays home on election day, and not an eyebrow is raised. But if one suggests that people shouldn't vote for religious reasons, be prepared to run for cover--you're guaranteed a firestorm of outrage and indignation. The \"\"sacred right to vote\"\" still generates powerful emotions, even among those who don't make it to the shrine on a regular basis. And that's why the Christian community owes a debt to Ted Lewis and his contributors for raising the uncomfortable question of whether voting may be incompatible with the practice of Christian discipleship. Electing Not to Vote is a provocative but respectful collection that deserves serious attention from Christians of all sorts.\"\" --Michael L. Budde, Department of Political Science, DePaul University About the Contributor(s): Ted Lewis works as an acquisitions editor at Wipf and Stock Publishers and writes articles and book reviews for Mennonite periodicals. He also manages the Restorative Justice Program at Community Mediation Services in Eugene, Oregon, and provides mediation services and conflict transformation workshops for faith-based communities.",
  "genres": [
    "Christianity",
    "Theology"
  ],
  "author": "Ted  Lewis",
  "average_rating": "3.88",
  "url": "https://www.goodreads.com/book/show/3402646-electing-not-to-vote"
}