{
  "title": "The Prophecy",
  "description": "A powerful wizard threatens the Chosen from beyond the grave. Can they unravel The Prophecy in time to save their world!Chosen have walked the earth for time immemorial. Tasia is a very special Chosen. Warned to keep her distance from her brethren, she makes a fateful decision one night to assist an injured Shape-shifter. Suddenly, Tasia finds herself in the cross-hairs of Shifter mercenaries encroaching on San Francisco. Forced out of the shadows, Tasia has little choice but to ally herself with the local Shifter Pack led by a formidable and dangerous Alpha Protector. In the cut-throat world of a Shifter Pack, Tasia must fight to protect her secrets while struggling to negotiate with the enigmatic Alpha who holds his violent Pack together with a ruthless hand on its reins.Grave danger threatens their world as a powerful wizard exploits an old prophecy to divide the Chosen. When the Pack is asked to investigate the twenty-five year old mystery, Tasia is drawn deeper into a past that risks raising the suspicions of the very Chosen she hides from. As danger closes in on her, Tasia must decide who to trust with the deadly secrets she guards.Author's Note : The Prophecy is the first book of \nSaga of the Chosen\n, an urban fantasy series sprinkled with action, adventure, an unfolding mystery and a dose of romance. Set in contemporary San Francisco in the fantastical and intrigue-ridden world of Chosen where factions of Wizards, Shape-shifters, Vampires and others vie for power and influence over their kind, it introduces Tasia Armstrong, a Magick with dangerous secrets and powers. Circumstances propel Tasia from a nondescript life on the fringes of Chosen society to a crucial role in an investigation to decode a mysterious plot from the past that threatens her people. Along the way, she gains new friends and allies while struggling to maintain a tempestuous alliance with the local Shape-shifter Pack. Thrust into a world where the line between friend and foe is often hard to decipher, Tasia must figure out the rules quickly even as danger stalks ever closer to her.The Rainmaker will be Book Two in this series.Librarian's note: See alternate cover edition of ASIN B01NBZ8OLM here.",
  "genres": [
    "Urban Fantasy",
    "Fantasy",
    "Vampires",
    "Paranormal",
    "Magic",
    "Shapeshifters",
    "Romance"
  ],
  "author": "Petra Landon",
  "average_rating": "4.05",
  "url": "https://www.goodreads.com/book/show/34036785-the-prophecy"
}