{
  "title": "Blu Heat",
  "description": "“In Brack Pelton, Burnsworth introduces a jaded yet empathetic character I hope to visit again and again.” – Susan M. Boyer, Agatha Award-Winning Author of Lowcountry Book Club  A man walks into a bar, and dies. It isn’t just any bar, it’s the Pirate’s Cove located on the Isle of Palms, a barrier island just north of the Charleston, South Carolina harbor. Marine veteran Brack Pelton tries to stop the murder and almost dies himself. The victim, Skip Romeo, has a shady past and some interesting friends. The friend he’d planned on meeting at the bar before he got shot was lowcountry Private Investigator Blu Carraway.  Brack Pelton hates that someone shot up his bar and Blu Carraway hates that someone gunned down his friend. Both want revenge and justice. And both tend to leave a lot of collateral damage in their wake. Their team-up is inevitable. Individually, they’re each a force to be reckoned with. Together, they’re like an atomic bomb blast at ground zero. Pelton and Carraway and Charleston will never be the same.  “Burnsworth nails the voice of new southern noir. This talented debut author will win you over with his engaging and multi-faceted hero--then keep you turning pages with his suspense, southern-voiced wit and sharp insight.” – Hank Phillippi Ryan, Mary Higgins Clark Award-Winning Author of Say No More  “Hop on board for a hard-edged debut that's fully loaded with car chases (particularly Mustangs), war veterans, old grudges, and abundant greed. A choppy start belies a well-executed plotline enhanced by the atmospheric Palmetto State setting.” – Library Journal (on Southern Heat)  “This second case for Brack is marked by a challenging mystery, quirky characters, and nonstop action.” ―Kirkus Reviews (on Burning Heat)  Related subjects whodunit mysteries whodunnit, murder mystery series, Southern fiction, Southern humor, private investigator books, amateur sleuth books.  Books in the Brack Pelton Mystery  SOUTHERN HEAT (#1) BURNING HEAT (#2) BIG CITY HEAT (#3)  Books in the Blu Carraway Mystery  IN IT FOR THE MONEY (#1) (September 2017)  Part of the Henery Press Mystery Series Collection, if you like one, you'll probably like them all...",
  "genres": [
    "Mystery"
  ],
  "author": "David Burnsworth",
  "average_rating": "4.25",
  "url": "https://www.goodreads.com/book/show/34031571-blu-heat"
}