{
  "title": "Son of a Beard",
  "description": "Truth Alan Reacher was a biker. He was a bladesmith. What he was not, was a fool.  The moment he walked in on his girl screwing his cousin on his bike, he does the only thing he can do. He ditches the bike seat—and the girl—riding right out of her life without a backwards glance.  That is until he’s forced to attend the marriage of his cousin to his cheating ex-girlfriend. The only bright spot of the entire thing was watching some chick go off on the groom—the groom’s ex-fiancé—right in the middle of the bouquet toss.  ***  Verity Ruthann Cassidy was supposed to be here today attending this wedding as the bride, not watching the festivities as a guest from the chairs she’d painstakingly purchased covers for while her fiancé—now her ex-fiancé—screwed around on her with another woman.  The icing on the wedding cake that she refuses to eat? She’s forced to attend the wedding due to her mother being the wedding planner.  However, the night doesn’t turn out quite the way she expects it due to the hot-as-hell biker sitting in the chair directly beside her. The man gave one hell of a speech during the reception that sounded like something that could have come straight out of her own mouth, and she enjoyed every single second of it.  ***  Thrown together under similarly lousy circumstances, the two newly single jilted former lovers of the happy couple decide to go to Vegas on what was to be Verity’s honeymoon trip.  One thing leads to another, and the next thing they know, their night has gone from a celebration of being single to a marriage—to each other.  Verity and Truth now have to figure out if everything that happens in Vegas should stay in Vegas.",
  "genres": [
    "Romance",
    "Contemporary",
    "Contemporary Romance",
    "Audiobook",
    "Military Fiction",
    "Suspense",
    "Humor"
  ],
  "author": "Lani Lynn Vale",
  "average_rating": "4.34",
  "url": "https://www.goodreads.com/book/show/34038427-son-of-a-beard"
}