{
  "title": "The Idea of Wilderness: From Prehistory to the Age of Ecology",
  "description": "How has the concept of wild nature changed over the millennia? And what have been the environmental consequences? In this broad-ranging book Max Oelschlaeger argues that the idea of wilderness has reflected the evolving character of human existence from Paleolithic times to the present day. An intellectual history, it draws together evidence from philosophy, anthropology, theology, literature, ecology, cultural geography, and archaeology to provide a new scientifically and philosophically informed understanding of humankind’s relationship to nature. Oelschlaeger begins by examining the culture of prehistoric hunter-gatherers, whose totems symbolized the idea of organic unity between humankind and wild nature, and idea that the author believes is essential to any attempt to define human potential. He next traces how the transformation of these hunter-gatherers into farmers led to a new awareness of distinctions between humankind and nature, and how Hellenism and Judeo-Christianity later introduced the unprecedented concept that nature was valueless until humanized. Oelschlaeger discusses the concept of wilderness in relation to the rise of classical science and modernism, and shows that opposition to “modernism” arose almost immediately from scientific, literary, and philosophical communities. He provides new and, in some cases, revisionist studies of the seminal American figures Thoreau, Muir, and Leopold, and he gives fresh readings of America’s two prodigious wilderness poets Robinson Jeffers and Gary Snyder. He concludes with a searching look at the relationship of evolutionary thought to our postmodern effort to reconceptualize ourselves as civilized beings who remain, in some ways, natural animals.",
  "genres": [
    "History",
    "Philosophy",
    "Nature",
    "Environment",
    "Nonfiction",
    "Wilderness",
    "Ecology"
  ],
  "author": "Max Oelschlaeger",
  "average_rating": "4.17",
  "url": "https://www.goodreads.com/book/show/340463.The_Idea_of_Wilderness"
}