{
  "title": "Dune",
  "description": "Arrakis: un planeta desértico donde el agua es el bien más preciado donde llorar a los muertos es el símbolo de máxima prodigalidad. Paul Atreides: un adolescente marcado por un destino singular, dotado de extraños poderes, abocado a convertirse en dictador, mesías y mártir. Los Harkonnen: personificación de las intrigas que rodean el Imperio Galáctico, buscan obtener el control sobre Arrakis para disponer de la melange, preciosa especia y uno de los bienes más codiciados del universo. Los Fremen: seres libre que han convertido el inhóspito paraje de Dune en su hogar, y que se sienten orgullosos de su pasado y temerosos de su futuro. Dune: una obra maestra unánimemente reconocida como la mejor saga de ciencia ficción de todos los tiempos.This Hugo & Nebula Award winner tells a sweeping tale of the desert planet Arrakis, the focus of an intricate power struggle in a byzantine interstellar empire. Arrakis is the sole source of Melange, \"spice of spices\". Melange is necessary for interstellar travel & grants psi powers & longevity. Whoever controls it wields great influence. Troubles begin when stewardship of Arrakis is transferred by the Emperor from the Harkonnen Noble House to House Atreides. The Harkonnens don't want to give up their privilege. Thru sabotage & treachery they cast young Duke Paul Atreides out into the planet's harsh environment to die. There he joins the Fremen, a desert dwelling tribe, the basis of the army with which he reclaims what's rightfully his. Paul is more than just a usurped duke. He might be the end product of a long-term genetic experiment to breed a superhuman. He might be a messiah. His struggle is at the center of a nexus of powerful people & events. Repercussions will be felt throughout the Imperium. Dune is one of the most famous sf novels ever written. Deservedly so. The setting is elaborate & ornate, the plot labyrinthine, the adventures exciting. Five sequels follow.--Brooks Peck (edited)",
  "genres": [
    "Science Fiction",
    "Fiction",
    "Fantasy",
    "Audiobook",
    "Science Fiction Fantasy",
    "Classics",
    "Novels"
  ],
  "author": "Frank Herbert",
  "average_rating": "4.28",
  "url": "https://www.goodreads.com/book/show/3406673-dune"
}