{
  "title": "The Urban Shepherd: Chasing the American Dream",
  "description": "The Urban Chasing the American Dream...the Story of a Shepherd Boy  The Urban Shepherd is a biographical self-help book that shows how a young poor shepherd boy followed his desire to find the American Dream. Ben Amor (known as Ali Ali) has come a long way both literally and figuratively from his days as a poor shepherd boy in Tunisia, North Africa, but Ben Amor is a symbol of what can happen when you don't give up and chase the American Dream until it comes true. The author was born in Tunisia as a boy of humble stature, raised on farmland. As a Tunisian Muslim, he decided to join the air force and then moved to the United Sates to pursue the American Dream. The dream did not come easily, but eventually, it did come. Staying perseverant in pursuit of a dream can be challenging, especially when one starts out with meager resources, lack of experience, and a continuous barrage of personal and professional setbacks. The Urban Shepherd takes you on an engaging journey through the souks of Tunisia, North Africa, to the bustle of the San Antonio, Texas, with its Alamo and Riverwalk. While the book reads like a mosaic pieced by countless aspects of life, relationships, and professional growth, its purpose is clear--to empower readers to chase and actualize their dreams and find self-fulfillment. The book shows that what is important is not where you start but where you end up.The successful career man reinvented himself again after a dream in 1983 of children crying because they were dying of starvation. Unable to forget the sound of children crying, he founded Terra-Genesis Inc., a nonprofit agency that began as a way to try to end world hunger through technology. The book tells how a young man's vision and passion lead him to chase the American Dream in spite of many challenges and people calling him \"crazy\". Ben has his own experience with overcoming the odds, a journey he intimately describes in The Urban Shepherd . He shares his joys--and his sorrows--from humble beginnings working hard to survive in Tunisia, serving in the Tunisian Air Force, and moving to the United States to live. Through sharing his personal journey adjusting to a new culture, toxic relationships, professional and personal setbacks, and balancing school, work, and family life, Ben aims to empower readers to chase and reach the American Dream. The author cites bits of advice from notable authors such as T. Harv Eker, Elizabeth Steger, and Don Miguel Ruiz, author of The Four Agreements. Ben's approach is both instructional and personal as he mentions works that he gained inspiration from. The book inspires and motivates others to chase the American Dream. Readers will feel like they are having a personable conversation with the author as he shares his hardships, sorrows, and joys.Though uplifting, The Urban Shepherd is not entirely warm in its accounts. The author shares some negativities, including the dissolution of a marriage, and toxic rivalries in the nonprofit world. The reader will see the potential pitfalls of toxic relationships and business arrangements, and many individuals will certainly relate to the material and psychological aftermath that these things bring. The book presents a multitude of issues that readers may relate adjusting to a new culture; communicating with others in a language not their own; balancing work, school, and family life; opening up to new relationships; and many others. The Urban Shepherd tells a story of personal growth, including anecdotes, and the quotes included provide readers much to think over. Serving as a mini-directory with a personalized touch, The Urban Shepherd offers multiple tools and starting points upon which readers can reflect in finding ways to improve their lives and communities while seeing their dreams in action.",
  "genres": [],
  "author": "Ben Amor",
  "average_rating": "3.20",
  "url": "https://www.goodreads.com/book/show/34055393-the-urban-shepherd"
}