{
  "title": "Barefoot Frontrunners: Sex, Women and Power",
  "description": "The inspiration that moved women toward political and sexual freedom were the front runners; they found their way in the social turbulence and chaos of the 1960s Anti-war, Civil Rights and Women's revolutions. We were barefoot because there was no clear way or agreement about the path to choices that opened our minds and hearts and led us through Reproductive Rights and Civil Rights to our political and social power. There were feminist and political leaders who called out from a distance the ideals of women's rights, but it was each woman's choice to respond or deny the sexual and political revolution in process. Barefoot Frontrunners  begins with my story, \"An Intimate Journal of Liberation,\" representing the response of many women to the life changing break from what we considered our lives to be; to meet the new demands of being free women. Sex, Women, and Power  describes the social and political structure that provided the basis for this evolution. It all began with the recognition of women's desire and gratification, once the reproductive responsibility and rights could be theirs, marriage and family patterns changed.  Corresponding and encouraging in the process were the demands for race, sex and gender equality. Even as it was a social and political phenomena, a new context to be filled, it was personal, as was each woman's story. Each woman, step by step, made decisions. Some moved toward sexual and political change, others did not. The movement encouraged new patterns of freedom for women, and ultimately for men. Freedom in how we live, who we love, and what we value was the ultimate consequence, and where we found our power.  A consideration is offered of where women have achieved power, and how that has shown up in the world. The case is made for the need for greater representation of women in leadership, as more women are voted into office to lend their perspective and wisdom into political office, and governing, the most recent Presidential election reveals where that development is limited. That the Conservative majority from the most recent General election has entered office with the intention of reducing women's reproductive rights, makes even more essential the need for knowledge about the true history of women's rights, civil rights, and LGBTQ rights.    Barefoot Frontrunners  argues for moving forward measures of human rights that are deeply connected to how we manage the ongoing challenges to Planned Parenthood, and states that have already constrained and limited women's reproductive rights. The challenges are many but what has been achieved and is a potential around the world for women and those with little power worldwide is the future to be sought.",
  "genres": [],
  "author": "Peggy Reskin",
  "average_rating": "4.17",
  "url": "https://www.goodreads.com/book/show/34055395-barefoot-frontrunners"
}