{
  "title": "Vanity Fair's Schools For Scandal: The Inside Dramas at 16 of America's Most Elite Campuses―Plus Oxford!",
  "description": "Vanity Fair editor Graydon Carter shares a definitive, provocative collection of the magazine’s finest dispatches on the political, sexual, and administrative scandals that have swept our nation’s campuses.Vanity Fair’s Schools for Scandal, edited by Graydon Carter, with an introduction by Cullen Murphy, brings together the magazine’s finest reporting on the scandals that have swept our nation’s most elite campuses over the past twenty-five years—all in one definitive, provocative volume.The stories collected here speak to an American obsession with status and to the lengths we will go to achieve it, preserve it, or destroy it—from the enduring, shadowy influence of Yale’s secret societies to the infamous “senior salute” at St. Paul’s School; from the false accusations in the Duke lacrosse team’s infamous rape case to the (mis)reportage of a sexual assault at the University of Virginia; from a deadly extreme-sport episode at Oxford to the Keystone Kop theft of a college’s rare books to the allegations of fraud by the now-shuttered Trump University.Vanity Fair’s Schools for Scandal brings focus to the perils facing American education today and how the life of the mind, and the significance of the institutions meant to foster it, has been negatively impacted by the partisan politics of privatization, tensions over so-called political correctness, the fraught dynamic of the teacher-student relationship, and what happens when visions for a bold future collide with the desire to maintain hidebound (or venerable) traditions.With an array of Vanity Fair ’s signature writers—including Buzz Bissinger, William D. Cohan, Sarah Ellison, Evgenia Peretz, Todd S. Purdum, and Sam Tanenhaus, among others— Vanity Fair’s Schools for Scandal presents a compelling if troubling account of the state of elite education today, and the evolving social, sexual, racial, and economic forces that have shaped it.",
  "genres": [
    "Nonfiction",
    "True Crime",
    "Essays",
    "History",
    "Education",
    "Dark Academia",
    "College"
  ],
  "author": "Graydon Carter",
  "average_rating": "3.71",
  "url": "https://www.goodreads.com/book/show/34056306-vanity-fair-s-schools-for-scandal"
}