{
  "title": "We Can't Talk about That at Work!: How to Talk about Race, Religion, Politics, and Other Polarizing Topics",
  "description": "Instead of shutting down any mention of taboo topics, Mary-Frances Winters shows how to structure intentional conversations about them, so people can safely confront biases and stereotypes and create stronger, more inclusive organizations.Politics, religion, race - we can't talk about topics like these at work, right? But in fact, these conversations are happening all the time, either in real life or virtually via social media. And if they aren't handled effectively, they can become more polarizing and divisive, impacting productivity, engagement, retention, teamwork, and even employees' sense of safety in the workplace. But you can turn that around and address difficult topics in a way that brings people together instead of driving them apart.As a thought leader in the field of diversity and inclusion, Mary-Frances Winters has been helping clients create inclusive environments for over three decades. In this concise and powerful book, she shows you how to lay the groundwork for having bold, inclusive conversations.Even with the best of intentions, you can't just start talking about taboo topics - that's wandering into a minefield. Winters offers exercises and tools to help you become aware of how your cultural background has shaped your perceptions and habits and to increase your understanding of how people from other cultures may differ from you, particularly when it comes to communicating and handling conflict.Once you're ready (you can take the self-assessment included in the book to make sure), Winters gives detailed instructions on exactly how to structure these conversations. She emphasizes that this is a process, not a destination--you may not be able to resolve major issues nicely and neatly in just one conversation. And while the process is important, so is intent. She urges readers to \"come from your heart, learn from your mistakes, and continue to contribute to making this a more inclusive world for all.\"",
  "genres": [
    "Nonfiction",
    "Leadership",
    "Business",
    "Anti Racist",
    "Audiobook",
    "Politics",
    "Social Justice"
  ],
  "author": "Mary-Frances Winters",
  "average_rating": "3.64",
  "url": "https://www.goodreads.com/book/show/34057052-we-can-t-talk-about-that-at-work"
}