{
  "title": "The Second Coming of the KKK: The Ku Klux Klan of the 1920s and the American Political Tradition",
  "description": "A new Ku Klux Klan arose in the early 1920s, a less violent but equally virulent descendant of the relatively small, terrorist Klan of the 1870s. Unknown to most Americans today, this \"second Klan\" largely flourished above the Mason-Dixon Line—its army of four-to-six-million members spanning the continent from New Jersey to Oregon, its ideology of intolerance shaping the course of mainstream national politics throughout the twentieth century.As prize-winning historian Linda Gordon demonstrates, the second Klan’s enemies included Catholics and Jews as well as African Americans. Its bigotry differed in intensity but not in kind from that of millions of other WASP Americans. Its membership, limited to white Protestant native-born citizens, was entirely respectable, drawn from small businesspeople, farmers, craftsmen, and professionals, and including about 1.5 million women. For many Klanspeople, membership simultaneously reflected a protest against an increasingly urban society and provided an entrée into the new middle class.Never secret, this Klan recruited openly, through newspaper ads, in churches, and through extravagant mass \"Americanism\" pageants, often held on Independence Day. These \"Klonvocations\" drew tens of thousands and featured fireworks, airplane stunts, children’s games, and women’s bake-offs—and, of course, cross-burnings. The Klan even controlled about one hundred and fifty newspapers, as well as the Cavalier Motion Picture Company, dedicated to countering Hollywood’s \"immoral\"—and Jewish—influence. The Klan became a major political force, electing thousands to state offices and over one hundred to national offices, while successfully lobbying for the anti-immigration Reed-Johnson Act of 1924.As Gordon shows, the themes of 1920s Klan ideology were not aberrant, but an indelible part of American history: its \"100% Americanism\" and fake news, broadcast by charismatic speakers, preachers, and columnists, became part of the national fabric. Its spokespeople vilified big-city liberals, \"money-grubbing Jews,\" \"Pope-worshipping Irish,\" and intellectuals for promoting jazz, drinking, and cars (because they provided the young with sexual privacy).The Klan’s collapse in 1926 was no less flamboyant, done in by its leaders’ financial and sexual corruption, culminating in the conviction of Grand Dragon David Stephenson for raping and murdering his secretary, and chewing up parts of her body. Yet the Klan’s brilliant melding of Christian values with racial bigotry lasted long after the organization’s decline, intensifying a fear of diversity that has long been a dominant undercurrent of American history.Documenting what became the largest social movement of the first half of the twentieth century, The Second Coming of the Ku Klux Klan exposes the ancestry and helps explain the dangerous appeal of today’s welter of intolerance.",
  "genres": [
    "History",
    "Nonfiction",
    "Politics",
    "American History",
    "Race",
    "Audiobook",
    "American"
  ],
  "author": "Linda Gordon",
  "average_rating": "3.81",
  "url": "https://www.goodreads.com/book/show/34082146-the-second-coming-of-the-kkk"
}