{
  "title": "The Stories of Ray Bradbury",
  "description": "Drunk, and in charge of a bicycle / introduction by Ray Bradbury--The night --Homecoming--Uncle Einar --The traveler --The lake --The coffin --The crowd --The scythe --There was an old woman --There will come soft rains --Mars is heaven --The silent towns --The earth men --The off season --The million-year picnic --The fox and the forest --Kaleidoscope --The rocket man --Marionettes, inc. --No particular night or morning --The city --The fire balloons --The last night of the world --The veldt --The long rain --The great fire --The wilderness --A sound of thunder --The murderer --The April witch --Invisible boy --The golden kite, the silver wind --The fog horn --The black black and white game --Embroidery --The golden apples of the sun --Powerhouse --Hail and farewell --The great wide world over there --The playground --Skeleton --The man upstairs --Touched with fire --The emissary --The jar --The small assasin --The next in line --Jack-in-the-box --The leave-taking --Exorcism --The happiness machine --Calling Mexico --The wonderful ice cream suit --Dark they were, and golden-eyed --The strawberry window --A scent of sarsaparilla --The Picasso summer --The day it rained forever --A medicine for melancholy --The shoreline at sunset --Fever dream --The town where no one got off --All summer in a day --Frost and fire --The anthem sprinters --And so died Riabouchinska --Boys! Raise giant mushrooms in your cellar! --The vacation --The illustrated woman --Some live like Lazarus --The best of all possible worlds --The one who waits --Tyrannosaurus Rex --The screaming woman --The terrible conflagration up at the place --Night call, collect --The tombling day --The haunting of the new --Tomorrow's child --I sing the body electric! --The women --The inspired chicken motel --Yes, we'll gather at the river --Have I got a chocolate bar for you! --A story of love --The parrot who met Papa --The October game --Punishment without crime --A piece of wood --The blue bottle --Long after midnight --The utterly perfect murder --The better part of wisdom --Interval in sunlight --The black ferris --Farewell summer --McGillahee's brat --The aqueduct --Gotcha! --The end of the beginning.",
  "genres": [
    "Short Stories",
    "Science Fiction",
    "Fiction",
    "Fantasy",
    "Classics",
    "Horror",
    "Literature"
  ],
  "author": "Ray Bradbury",
  "average_rating": "4.43",
  "url": "https://www.goodreads.com/book/show/120552.The_Stories_of_Ray_Bradbury"
}