{
  "title": "Fantastic Beasts and Where to Find Them",
  "description": "A set textbook at Hogwarts School of Witchcraft and Wizardry since publication, Newt Scamander's masterpiece has entertained wizarding families through the generations. Fantastic Beasts and Where to Find Them is an indispensable introduction to the magical beasts of the wizarding world.Scamander's years of travel and research have created a tome of unparalleled importance. Some of the beasts will be familiar to readers of the Harry Potter books - the Hippogriff, the Basilisk, the Hungarian Horntail... others will surprise even the most ardent amateur Magizoologist.Narrated by Eddie Redmayne, this is the first audio book edition of Scamander's textbook ever to be released. Having starred as Newt Scamander himself in the movie Fantastic Beasts and Where to Find Them, who better to narrate this Hogwarts Library book from one of the wizarding world's most famous Magizoologists? Eddie's film credits include The Danish Girl, My Week with Marilyn, Les Misérables and The Theory of Everything, for which he won a Golden Globe, an Academy Award and a BAFTA Award for Best Actor.Dip in to discover the curious habits of magical beasts across five continents...15% of the proceeds* from this audiobook will be available to Comic Relief and Lumos Foundation for their work with children and young people to help them have a better life. 20% of these monies will be used by Comic Relief and 80% will be used by Lumos Foundation. Comic Relief is a registered charity in the UK with charity nos. 326568 (England/Wales) and SC039730 (Scotland). Lumos Foundation is a registered charity in the UK with no. 1112575.*Proceeds means the cash-price or cash-equivalent price less sales taxes.©2017 J.K. Rowling (P)2017 J.K. Rowling",
  "genres": [
    "Fantasy",
    "Fiction",
    "Young Adult",
    "Magic",
    "Childrens",
    "Audiobook",
    "Middle Grade"
  ],
  "author": "Newt Scamander",
  "average_rating": "3.95",
  "url": "https://www.goodreads.com/book/show/34089632-fantastic-beasts-and-where-to-find-them"
}