{
  "title": "Exile",
  "description": "What happens when prophecy comes knocking on your door?The next heart-pounding instalment in Mason Sabre's Paranormal and Urban Fantasy, Society Series, Stephen Davies has been sentenced to death …Everyone knows that being exiled is as good as a death sentence. Even worse when you are the son of the Alpha …Former ruler of his own domain and warrior for his father’s pack, Stephen Davies is one of the fiercest tiger shifters the Other world has ever known. A legend in his own right, he has earned both the respect of his own kind, and the fear of the Humans.In Exile, however, all is different ...Stephen has barely arrived in this God forsaken place when the bus he is on is stopped and attacked by a creature he has never seen before. She’s there to rescue him, but her actions cast Stephen into an unravelling new world. Not only does he find himself in unexpected places with the strangest people, but his tiger seems to think he has found the one true thing he has been looking for …A mate.The only problem is that someone is hunting Stephen, and they don’t care who they hurt to get to him.If you like fast-paced urban fantasy filled with sexy alpha shifters, witches, powerful creatures and dark supernatural forces, then you’ll love the latest novel in Mason Sabre’s Society Series.Immerse yourself in this unique paranormal world today.While this book is part of a series, it can be read as a standalone. It is a complete story.The Society SeriesCadeDark VeilHiddenExileFractured OneFractured TwoThe ForgottenBrokenSociety Series Companion StoriesHenry - A PrequelThe Rise of the Phoenix - A prequelBroken SnowChaosDeath AwakeningSeraphBleedMartial MagicMortal WingsEnigmaFanglinerAll books make up the series but can be read on their own. They do contain spoilers for previous books. For the best reader experience, read in order",
  "genres": [
    "Paranormal",
    "Shapeshifters",
    "Paranormal Romance",
    "Fantasy",
    "Adult Fiction",
    "Urban Fantasy"
  ],
  "author": "Mason Sabre",
  "average_rating": "4.70",
  "url": "https://www.goodreads.com/book/show/34081863-exile"
}