{
  "title": "Once Upon a Kiss",
  "description": "Seventeen all new, magical stories from NY Times and USA Today bestsellers and award-winning authors that will warm even the coldest hearts. Inspired by old favorites as well as lesser-known tales, find retellings of Cinderella, Beauty and the Beast, Sleeping Beauty, The Little Mermaid, Old Rinkrank, King Thrushbeard, The Princess and the Pea, and many more - all with fresh, romantic twists - just in time for Valentine’s Day~  THE GLASS MOUNTAIN - Alethea Kontis On the way to her wedding, brave and clever Princess Sabine falls into a Glass Mountain, where she is trapped with a crotchety man she calls “Old Rinkrank.” The two form a unique, unlikely friendship while working to escape.  THE BAKERS GRIMM - Hailey Edwards When two struggling business owners compete for the contract of a lifetime, it’s all bakers on deck. Mix in a dollop of rivalry, a tablespoon of romance, and a pinch of magic, and you’ve got the recipe for one heck of a bake-off. May the best decorator win!  GALATEA AND PYGMALION - Kate Danley A young woman in ancient Greece is tasked with carving a new statue for Aphrodite's temple. But what happens when she falls in love with her art?  RED– Sarra Cannon Charlotte is searching for a cure to save her sister, but what she finds in the woods is not at all what she expects...  PRINCESS CHARMING – Yasmine Galenorn Sometimes, the road to Happily Ever After leads a girl right past Prince Charming... into the arms of his sister.  MAD ABOUT YOU – Jennifer Blackstream Alice doesn't want to marry the Mad Hatter. Will an unexpected trip to Wonderland change her mind?  THE SEA KING'S DAUGHTER—Anthea Sharp A mermaid gives up everything to be with the mortal man she loves – but can there be a happy ending when the Sea Witch intervenes?  ROMEO AND JULIET: THE AFTERLIFE – Julia Crane Juliet enters the afterlife and discovers the truth behind her relationship with Romeo and Paris - and that their greatest challenge is yet to come.  SOOT AND STONE: A Fae Tale of the Otherworld - Jenna Elizabeth Johnson Aisling, a young Faelorehn artist, finds herself falling for the son of one of the famed Tuatha De Danann. The only problem is, she’s unaware of his true identity, and her selfish uncle will do anything to keep her from realizing her dreams.  THE HUNTSMAN'S SNOW – Mandy M. Roth Sometimes, a prince isn’t as charming as history would like you to believe. And sometimes, a princess needs an alpha male shifter to find her happily ever after.  RUMPELIMPSKIN - Debra Dunbar An imp finds herself in a fairytale world without her infernal powers facing an impossible task. Will Sam barter away her firstborn? Will her angelic main-squeeze save her? Or will she come up with a devilish solution of her own?  THE GLASS SKY - Alexia Purdy Star’s refusal of suitors lined up for her hand has her family in knots, but when the city is bombed and overthrown, she loses everything. After she’s rescued by a handsome stranger named Clyde, she sneaks away to save her parents but finds herself trapped in the new president’s clutches.  RUSH - C. Gockel Misogyny is a beast. When the incarnation of Creation gets angry at Rush for innocently stating his opinion, she curses him to find true love in two weeks … or else.  PERCHANCE TO DREAM – Phaedra Weldon Her first love has been placed under a spell.THE TOAD PRINCE - Nikki JeffordIsabel Ivers’s stepfather will do anything to secure his place as Far North’s new ruler, even if it means marrying her off to the depraved prince of the lowlands.CRAFTED WITH A KISS - Shawntelle MadisonDespite fighting in countless battles to bring peace to warring kingdoms, Pynnelope, a warrior maiden made of wood, knows no fear. Becoming human is all she desires until she discovers she can have so much more.A SMALL MAGIC - Devon MonkA cursed princess, a talking pea, and a wish that changes everything.",
  "genres": [
    "Fantasy",
    "Romance",
    "Anthologies",
    "Short Stories",
    "Fairy Tales",
    "Paranormal Romance",
    "Fairy Tale Retellings"
  ],
  "author": "Alethea Kontis",
  "average_rating": "3.80",
  "url": "https://www.goodreads.com/book/show/34083822-once-upon-a-kiss"
}