{
  "title": "Shirley Jackson: A Rather Haunted Life",
  "description": "Winner • National Book Critics Circle Award (Biography)Winner • Edgar Award (Critical/Biographical)Winner • Bram Stoker Award (Nonfiction)A New York Times Notable BookA Washington Post Notable Nonfiction Pick of the YearNamed one of the Best Books of the Year by Entertainment Weekly, NPR, TIME, Boston Globe, NYLON, San Francisco Chronicle, Seattle Times, Kirkus Reviews , and BooklistIn this “thoughtful and persuasive” biography, award-winning biographer Ruth Franklin establishes Shirley Jackson as a “serious and accomplished literary artist” (Charles McGrath, New York Times Book Review). Instantly heralded for its “masterful” and “thrilling” portrayal (Boston Globe), Shirley Jackson reveals the tumultuous life and inner darkness of the literary genius behind such classics as “The Lottery” and The Haunting of Hill House. In this “remarkable act of reclamation” (Neil Gaiman), Ruth Franklin envisions Jackson as “belonging to the great tradition of Hawthorne, Poe and James” (New York Times Book Review) and demonstrates how her unique contribution to the canon “so uncannily channeled women’s nightmares and contradictions that it is ‘nothing less than the secret history of American women of her era’ ” (Washington Post). Franklin investigates the “interplay between the life, the work, and the times with real skill and insight, making this fine book a real contribution not only to biography, but to mid-20th-century women’s history” (Chicago Tribune). “Wisely rescu[ing] Shirley Jackson from any semblance of obscurity” (Lena Dunham), Franklin’s invigorating portrait stands as the definitive biography of a generational avatar and an American literary genius.",
  "genres": [
    "Biography",
    "Nonfiction",
    "Biography Memoir",
    "Memoir",
    "Horror",
    "History",
    "Writing"
  ],
  "author": "Ruth Franklin",
  "average_rating": "4.02",
  "url": "https://www.goodreads.com/book/show/34082142-shirley-jackson"
}