{
  "title": "Ruined & Redeemed: The Earl's Fallen Wife",
  "description": "A heinous crime. A valiant hero. An undeniable temptation.LADY CHARLOTTE FRAMPTON is dead…at least, that is what everyone believes.Fleeing from her life-shattering past, Charlotte reinvents herself as Lotte and becomes the companion to a viscount’s sister. All she is hoping for is a simple and quiet life in the country, away from the demons that still plague her.However, her safe haven is threatened when a visitor arrives one day.SEBASTIAN CAMPBELL, son to the EARL OF WESTON, failed in the most miserable way…and his sister had to pay the price.At his wits’ end, he seeks advice from an old friend, and as though fate chose to intervene at last, his path crosses that of a young woman with soulfully deep eyes. The pain and regret he sees in them echo within his own heart, and Sebastian knows without a doubt that he has found his other half.Can Sebastian convince Charlotte that it is never too late for forgiveness and love?This USA TODAY bestselling tale of Sleeping Beauty and her prince shows that no matter how broken you are, you can always find healing through the unfailing love of another.If you like marriage of convenience stories with a touch of mystery, a dash of humour as well as heartfelt emotion, then you’ll love this instalment of Bree Wolf’s emotionally charged Love’s Second Chance Series. Buy RUINED AND REDEEMED, grab a cup of tea, settle into your favorite reading spot and start this swoon worthy romance now!Love's Second Chance Series#1 Forgotten & Remembered - The Duke's Late Wife (Rosabel & Graham)#2 Cursed & Cherished - The Duke's Wilful Wife (Anna & Edmond)#3 Despised & Desired - The Marquess' Passionate Wife (Ellie & Frederick)#4 Abandoned & Protected - The Marquis' Tenacious Wife (Henrietta & Connor)#5 Ruined & Redeemed - The Earl's Fallen Wife (Charlotte & Sebastian)#6 Betrayed & Blessed - The Viscount's Shrewd Wife (Beth & Tristan)#7 Deceived & Honoured - The Baron’s Vexing Wife (Madeline & Derek)More to follow:#8 Sacrificed & Reclaimed - The Soldier's Daring Widow (Meagan & Edward) (Bonus Novella)A Forbidden Love Novella Series#1 The Wrong Brother#2 A Brilliant Rose#3 The Forgotten Wife#4 An Unwelcome Proposal#6 Hearts to Be MendedTo Follow:#7 Winning her Hand#8 Conquering her Heart",
  "genres": [
    "Historical Romance",
    "Romance",
    "Historical",
    "Historical Fiction",
    "Regency",
    "Regency Romance",
    "Fiction"
  ],
  "author": "Bree Wolf",
  "average_rating": "4.15",
  "url": "https://www.goodreads.com/book/show/34069747-ruined-redeemed"
}