{
  "title": "Dark Elves: Salvation",
  "description": "\"Dark Elves 3: Salvation\"  Irin was raised among the raedjour -- dark elves bred by their goddess for sexual pleasure. When Irin was a toddler, sorcerers cast a protective spell on her to quell the lustful urges of those around her. Under that spell and the watchful eyes of her protectors, Irin has a happy, if unique childhood as a human girl among all raedjour boys.  But she's a woman now, and it's time for the spell to be lifted and for her to find out what it means to be taken and mastered by the raedjour -- and to find her truemate among them.  Savous and Radin. Apprentice and master. They've been a pair for centuries and have helped to watch over Irin her whole life. There's no doubt in either of their minds that one of them will be the first to introduce Irin into the world of sexual pleasures.  But there's more to Irin than anyone knew. Will her passion be the destruction of the lifelong bond between two men? Or the salvation of an entire race?  \"Have you ever wondered what it would be like to be used, pleasured...and be the salvation of an entire race?\"  \"Dark Elves 4: Dissent\"  Marisol and her brother are on the run. With nowhere to turn, they take their chances in the Dark Forest. Captured by the \"dark denizens\" they'd been warned about, they are taken into the darkness by these beautifully cruel elves and used for selfish, sexual pleasure.  No human can withstand the full force of raedjour sexual pleasures for long. Jarak and his men are dispatched to rescue Marisol and her brother, but they come too late. They save them from death, but now what are they to do with the traumatized humans?  Life among the raedjour is in upheaval andtraditions of the last four thousand cycles of seasons may not apply. And Jarak's and Marisol's attraction only complicates matter.  \"Have you ever wondered what it would be like to be pleasured...nearly to death?\"  Publisher's Note: The stories in this book contain explicit sexual content, graphic language, and situations that some readers may find objectionable: Bondage, domination/submission, male/male sexual practices, and dubious consent.",
  "genres": [
    "Erotica",
    "Fantasy",
    "Romance",
    "Paranormal",
    "Erotic Romance",
    "Menage",
    "Paranormal Romance"
  ],
  "author": "Jet Mykles",
  "average_rating": "3.89",
  "url": "https://www.goodreads.com/book/show/3407450-dark-elves"
}