{
  "title": "Dark Gifts: Titan's Song Series - Season 1: Episode 1",
  "description": "THE LEVIATHAN... An ancient evil with unspeakable appetites has been reaching across the veil between worlds, searching among those with powerful psychic gifts for someone strong enough to become his newest disciple... And now, at last, he has found her... THE CHOSEN... Simone Copeland, a young woman trying to outrun her troubled past, returns to her hometown in the mountains of rural Virginia, hoping to regroup and start over. But there's something unusual about Simone, something that sets her apart from 99.9% of the human race, and now she's been singled out by a horrible malevolent force. Soon she will experience the initial harbingers of her new destiny - urges to commit acts of unthinkable violence; urges she can barely resist. And unless she can find a way to cope, it's only a matter of time before she loses control and does something completely unforgivable. This is the first stage. Simone is becoming... THE MAGE... Malcolm Thackery, an agent for a secret order of powerful occult practitioners, is sent to investigate a colleague suspected of dabbling in forbidden magics, and stumbles onto evidence of a horrifying conspiracy. As he tries to get to the bottom of things, Malcolm will soon find himself in very hot water indeed, with gods meddling in his business, and horrors beyond imagining waiting just out of sight... THE BATTLE... The stakes are high and time is running out. Will Simone manage to calm the storm of violence building inside her? And will Thackery survive long enough to discover the truth and come to her aid? Or will both be overwhelmed by the cunning machinations of a terrible evil from an alien realm that completely defies human understanding? Dark Gifts is the first book in author Jacob Stanley's Titan's Song series. The story blends visceral horror in the vein of authors such as Clive Barker, Stephen King, and Richard Laymon, with creepy eldritch fantasy inspired by classic pulp magazine writers like H.P. Lovecraft and Clark Ashton Smith. Readers who enjoy violent macabre fiction with a strong fantasy element should find a lot to like in this intense supernatural thriller. AUTHOR'S NOTE:> The Titan's Song series is an ongoing work of serialized fiction. It's basically like a TV series in book form. Each episode moves the story further along and unravels more of the mystery. An omnibus titled The DARK Chronicles, which collects the first 4 books of this series at a discounted price, is now available for purchase.",
  "genres": [
    "Horror",
    "Fantasy",
    "Amazon",
    "Thriller",
    "Science Fiction",
    "Urban Fantasy"
  ],
  "author": "Jacob Stanley",
  "average_rating": "3.79",
  "url": "https://www.goodreads.com/book/show/34096723-dark-gifts"
}