{
  "title": "Dragon's Love",
  "description": "I guess I'm one of the last survivors of the human race and I'm stranded on this hell of a desert alien planet. Sucks to be me.  Our ship crashed months ago and those of us left are struggling to survive the boiling heat in barbaric living conditions. The only reason we're not all dead is one of my friends got knocked up by a native alien and he lets us live in his ruined city. We should be grateful but a lot of the humans hate the dragons and the girls who mate with them. Fools.  The natives are huge, seven foot tall dragon-men with wings and tails and scales. Surly and overly protective, who needs that? Not me. Alien baby fever is the new in thing, but I'm not falling for the hype. I've always survived being alone and I don't need anyone to change that. Try telling that to Shidan, the most annoyingly persistent alien male around.  Thanks to the primitive nature of the destroyed planet we have no idea what's happening when things go wrong with my friend's pregnancy. I'm sure I can salvage something from our crashed ship that will help, but to get there I'll have to leave the city's protection and go out in the sweltering heat where everything wants to kill me. The only way I'll survive is if Shidan comes too and he's made it clear he wants only one thing. Love.  Dragon's Love is a full length scifi novel with a happily ever after ending, plenty of steam, bloody battles and alien-human intrigue. It is standalone and co-written by Miranda Martin and one of the hottest science fiction romance authors out there, Juno Wells.  DRAGON'S LOVE is BOOK 3 of the RED PLANET DRAGONS OF TAJSS. You do not have to read them all in order to understand the plot, but the story will be much richer if you do!",
  "genres": [
    "Dragons",
    "Aliens",
    "Science Fiction",
    "Romance",
    "Paranormal",
    "Science Fiction Romance",
    "Audiobook"
  ],
  "author": "Miranda Martin",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/34098859-dragon-s-love"
}