{
  "title": "Betrayed & Blessed - The Viscount's Shrewd Wife",
  "description": "In this USA TODAY bestselling Cinderella regency romance, a haunted lord falls for a masked, young woman who’s wrong for him in every way but one; by HOLT Medallion winning author Bree Wolf.England 1806: At a masked ball, TRISTAN TURNER, VISCOUNT ELTON, catches the glimpse of a golden-haired beauty, sneaking around their host’s townhouse. Intrigued, Tristan pursues the young lady, tempted to believe that he might have finally found the one woman meant for him.Determined not to let her slip through his fingers, Tristan addresses her and finds himself swept off his feet by her beguiling wit and passionate nature.However, before the night is out, events unravel and secrets are revealed that threaten his hopes for a wife who might truly love him.Him, not his title and fortune.A simple country girl, BETH WALKER only came to London to uncover a secret about her past. She never meant to pose as a lady or draw the attention of a handsome, young lord. She never meant for them to be discovered or for him to feel honour-bound to ask for her hand.And she certainly never meant to lose her heart to him.However, neither can she resist him.Determined to keep his new wife at arm’s length, Tristan fights to protect his wounded heart, closing his eyes to the gentle love that seems to shine in her own every time she looks at him. He does his best to ignore the sparks that fly whenever their paths cross and deny the passion that blooms whenever she touches him.However, with each passing day, Tristan’s resolve wanes while his wife’s seems to grow in spades. Will he come out the victor in this game of hearts?If you like marriage of convenience stories with a touch of mystery, a dash of humour as well as deep, heartfelt emotions, then you’ll love this installment of Bree Wolf’s emotionally charged Love’s Second Chance Series. Get BETRAYED AND BLESSED, grab a cup of tea, settle into your favorite reading spot, and start this swoon-worthy romance now!Each love story in this series can be read as a stand-alone. However, most readers prefer to read them in order.",
  "genres": [
    "Romance",
    "Historical Romance",
    "Historical",
    "Historical Fiction",
    "Regency",
    "Clean Romance",
    "Regency Romance"
  ],
  "author": "Bree Wolf",
  "average_rating": "4.22",
  "url": "https://www.goodreads.com/book/show/34102300-betrayed-blessed---the-viscount-s-shrewd-wife"
}