{
  "title": "Welcome Home Daddy: A Forbidden Taboo Erotic Tale Harry & Lola Series The Adventures Of One Naughty Brat & Her Step Dad Book #1",
  "description": "WARNING: Mature Readers Only - This Book Contains Taboo Adult Content.  Welcome Home Daddy  Lola has mixed feelings about having a new stepdad Harry. She'd been used to going out and getting away with a lot since her mom was always busy with her work but Harry is military and strict and he's back! After her mothers whirlwind romance abroad with a marine on one of her workaholic business trips, Lola finds herself with a new step dad suddenly in the house. Harry had been away overseas and now he's home and her mom is away leaving Harry at home in charge of the Brat!  Despite wanting to see her boyfriend, Lola finds herself looking at her stepdad in a new light after a risky soapy erotic introduction. Lola is having difficulty reaching for wine on the top shelf in the kitchen, naked and slippery and alone in the house, or so she thinks, Lola gets a shock when her new step daddy introduces himself from behind her with a full intimate view and lends a helping hand to Lola literally lifting her up butt naked in the kitchen, leaving Lola in a frenzied state of exhilaration wanting more. Despite the fact that she originally thought spending time with Harry would be a drag, Lola finds herself hoping her mother stays away on business forever.  Things quickly turn risky as Lola notices Harry's eyes on her ass whenever she bends over and finds herself stretching in front of him enjoying the tease. Falling onto his lap one night naked, Lola squirts on Harry's knee and Harry reassures her, offering to clean her up with his tongue. Can Harry control his desire or will Lola the Brat get more than she bargained for? It's a dangerous game teasing Harry and an exciting one. This drill sergeant doesn't miss a beat and teaches Lola the Brat step by step everything she needs to know to please her new step daddy.  Will Harry ride the brat bareback or back out and choose the other path?  This is the first book in the series Lola & Harry The Forbidden Taboo Erotica Adventures Of One Brat & Her Step Dad (Older Man Younger Girl) series.   If you like this book by Erotic Author Lola Popsicle then check out book #2 in the series Harry & Lola go camping for more filthy taboo antics.",
  "genres": [],
  "author": "Lola Popsicle",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/34092542-welcome-home-daddy"
}