{
  "title": "What He Wants",
  "description": "She was a pain in his ass until he claimed it! Night Owl Reviews TOP PICK - \"This was my first Tory Richards read but it wont be my last.\" Big John is the club enforcer. He's big and scary and he sets his sights on Daisy the instant he locks eyes on the curvy beauty. Daisy's the new girl in town. She's grown strong and independent since leaving an abusive marriage, but nothing prepares her for the hulking, sexy biker who wants to claim her when trouble comes calling! Excerpt- “Open the door.” I cringed at the harsh demand passing through my lips, and couldn’t blame her for slapping her hands onto her hips and refusing my request. My gaze fell to the deep V that putting her hands on her hips had caused. Plenty of smooth, creamy flesh was revealed, but I wanted to see it all. My dick had a one-track mind when it came to Daisy and what he wanted, jerking strongly behind my zipper. “Do you want to rephrase that?” she scowled. Fuck, I liked her fire. But I wasn’t about to turn all syrupy and say please. She should have known better. “Open the door, babe, or I’ll open it for you and I guarantee you won’t like how I go about it.” She weighed my words, as if trying to decide if I’d follow up my threat. “Nice, Big John.” She reached up and turned the lock. “I told you to leave me alone. I don’t want you here.” I yanked the door open and stepped inside. “I don’t care what you want.” My nostrils flared, taking in the enticing scent that trailed behind her as she moved away. I wanted to lick whatever the hell it was off her body. “You’re coming back to the club with me.” She paused and turned back around to face me, disbelief on her face. “No. I’m not connected to you or the club in any way, so I’ll stay right here where I’m safe.” I snorted. “Safe, babe? Do you know how easy I could have broken through that glass door? And I bet the back door to this place isn’t any better, unless you had it replaced when you moved in.” Her deflated expression revealed that she hadn’t. “Get dressed and pack some shit.” She held her ground stubbornly. “Why? Because your club is on lockdown? That means nothing to me. You can’t come in here and tell me what to do. You’re nothing to me.” Christ, that hurt. I forced myself not to move, not to reach out and just make her do what I wanted. I didn’t expect her to understand, our worlds were different. She was a civilian, lived by the rules and laws that society dictated. We did, too, in a way, but our rules and laws were dictated by the members of the MC. We voted on what worked for our club, we had each other’s backs and stood together as a team. We didn’t get the law involved in club trouble because we took care of shit on our own. It was the way most hardcore MC’s worked. “You’re stubborn, woman,” I growled. “And I don’t have time for this shit.” I bent at the waist, caught her in the belly with my shoulder, and swept her off her feet. I heard her outraged humph as I continued to the back where I knew the stairs led to the second story. “Put me down!” Daisy screamed, beating her little fists against my back as I easily carried her upstairs. “This is crazy, Big John! I’m not going with you and there’s nothing you can do about it!” That’s what she thought.",
  "genres": [
    "Contemporary"
  ],
  "author": "Tory Richards",
  "average_rating": "4.10",
  "url": "https://www.goodreads.com/book/show/34107800-what-he-wants"
}