{
  "title": "Big City Heat",
  "description": "An action-packed Atlanta-set mystery by an author who “nails the voice of new Southern noir” (Hank Phillippi Ryan, Mary Higgins Clark Award–winning author of Trust Me).   Lowcountry bar owner and Marine veteran Brack Pelton heads to Atlanta in the wake of a panicked three a.m. phone call. A woman is missing, and Brack’s friend Mutt is in danger. Brack’s old flame, investigative news correspondent Darcy Wells, now lives there and is set to marry another man. If Brack was honest with himself—and he usually wasn’t—he’d realize that the missing woman isn’t the real reason for his visit. His Semper Fi buddy Mutt can handle himself just fine.   When Brack and Mutt team up to find the woman, the Atlanta underworld revolts, the two biggest players target them, and people start dying. Most people would size up the situation, call it impossible, and walk away. But most people are not Brack Pelton. Impossible situations are his specialty. He made it through Afghanistan—and when the military commanders mistook suicidal tendencies for leadership qualities, they promoted him. Can Brack succeed at finding the woman, protecting his friend, and winning the girl without destroying the Capital of the South? Not since Sherman’s march has the city of Atlanta been in this much danger . . .   Praise for the Brack Pelton novels:   “A hard-edged debut that’s fully loaded with car chases (particularly Mustangs), war veterans, old grudges, and abundant greed . . . a well-executed plotline enhanced by the atmospheric Palmetto State setting.” —Library Journal   “A challenging mystery, quirky characters, and nonstop action.” —Kirkus Reviews   “A jaded yet empathetic character I hope to visit again and again.” —Susan M. Boyer, Agatha Award–winning author of Lowcountry Book Club",
  "genres": [
    "Amateur Sleuth",
    "Southern",
    "Mystery",
    "Murder Mystery",
    "Fiction"
  ],
  "author": "David Burnsworth",
  "average_rating": "3.86",
  "url": "https://www.goodreads.com/book/show/34114286-big-city-heat"
}