{
  "title": "Triumph of the Lentil: Soy-Free Vegan Wholefoods for all Appetites",
  "description": "Triumph of the Lentil is a revolutionary new cookbook that takes a D.I.Y. approach to cooking. Relying on whole, unprocessed ingredients to create delicious and nourishing food with a focus on filling main meals and desserts, including plenty of practical year-round everyday recipes.This cookbook was written mostly while the author was looking after a baby. With limited time and a need to get nutrition out of every bite, Hilda creates vegan wholefood recipes with a real awareness of busy and active lifestyles. With appetising photos and clear instructions for every recipe, this book will inspire you to rely on your own healthy home cooking. Using no artificial or pre-made products, Hilda shows you how to create delicious meals from everyday ingredients that can be found locally and organically throughout the year. These recipes are easy enough for everyday use, but flavoursome and filling enough to impress your family and guests.With Triumph of the Lentil you can learn to...•Make 100% wholemeal wheat breads with only 5 minutes of time in the kitchen, with flavours that rival artisan bread•Create fine textured, decadent-tasting baked goods without using any refined flour or margarine•Make your own alternatives to animal products from simple, healthy ingredients•Understand natural vegan nutrition, with information on balanced vegan wholefood diets and sources of protein, calcium, b12, essential fatty acids and more explainedTriumph of the Lentil includes...•A unique way of looking at recipes in ‘kitchen time’, which ignores the time you don’t need to be there and shows you how much actual time you need to spend in the kitchen to create a dish - often under ten minutes!•Recipes for bakes, pies, burgers, patties and more that can be stored in the fridge or freezer until baking, to create a fuss-free, microwave-free meal for those extra busy times•Side dish recipes that fit in to your cooking schedule - most only take 5 minutes of kitchen time•Plenty of options for gluten-free, nightshade-free, allium-free or low fat diets•Over 100 recipes and 115 colour photos•Party pies •Chickpea ‘fish’ and chips •100% wholemeal wheat bread •Parmigiana •Pierogi •Shepherds pie •Cordon bleu •Spätzle •Quiche •Cannelloni •Ravioli •Linzer torte •Danish chocolate orange biscuits •Black Forest cake •Marble cake •Chocolate mousse and more...",
  "genres": [
    "Cookbooks",
    "Vegan",
    "Cooking",
    "Nonfiction",
    "Food",
    "Reference",
    "Vegetarian"
  ],
  "author": "Hilda Jorgensen",
  "average_rating": "3.93",
  "url": "https://www.goodreads.com/book/show/12056662-triumph-of-the-lentil"
}