{
  "title": "A Taboo Daddy Erotica Outdoor Adventure Harry & Lola Go Camping: The Adventures Harry & Lola One Naughty Brat & Her Step Dad Book #2",
  "description": "Mature Readers Only - This Book Contains Taboo Adult Content.Harry & Lola Go Camping Book 2 The Adventures Of Lola & Harry One Naughty Brat & Her Step Dad series. (Older Man Younger Girl)Lola has turned eighteen and step dad marine drill sergeant Harry is taking Lola camping out in the Arizona desert for some step daughter bonding activity and a birthday surprise.After experiencing Harry's soft tongue after Lola accidentally squirted on his knee while sitting in his lap, Harry knows that the game is raised. Naughty Lola's birthday coincides with the camping trip. What birthday present will Harry have in store for his little pumpkin?Lola is ready for the next stage in their forbidden taboo relationship. She has her guesses about what Harry might have in store for her but anticipation and exhilaration at being in the experienced hands of this drill sergeant send shivers over her skin. She doesn't know what to expect. Harry is becoming more commanding, dominating, rougher in their play, was he prepping her she wondered for something a lot more risky?Lola was ready to do anything for Harry, the hot little spoilt brat had finally been tamed and would submit to anything he asked of her. Lola the Brat was ready to learn. She wanted him to pop her cherry but would he really go that far with her? She hoped so.Forbidden felt good.Lola gets more lessons from Harry on the camping trip as he instructs her in the next level of play.Lola is blooming and Harry's gonna be there to taste her sweet nectar.Is he training her to take it in places where step daddy's have no business taking?This is the second book in The Adventures Of Harry & Lola One Naughty Brat & Her Step Dad (Older Man Younger Girl) series.If you like this book by Erotic Author Lola Popsicle then check out book #3 in the seriesHarry Takes Lola To A Brothel For More Filthy Taboo Antics.",
  "genres": [],
  "author": "Lola Popsicle",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/34106201-a-taboo-daddy-erotica-outdoor-adventure-harry-lola-go-camping"
}