{
  "title": "Triggerfish Twist",
  "description": "When Tim Dorsey sat down to write his first novel, the hilarious and hugely successful Florida Roadkill, he killed off way too many people. Now he needs them back. So in Triggerfish Twist, Dorsey invites us to take a warped trip back in time as he reunites the living with the soon to be very dead. And for the uninitiated, what a perfect place to start! Set during the summer before Roadkill's pyrotechnic climax, Dorsey's fourth novel is a fond and perverse antirhapsody to the typical Florida neighborhood as seen through the eyes of Jim Davenport, a mild-mannered Midwestern family man whose company transfers him to the Sunshine State. When he purchases a lovely tropical villa on the equally idyllic Triggerfish Lane, his family appears to have found paradise.But it is a long, hot summer, and soon the layers are peeled back one by one to reveal that all is not right in utopia. Yuppies with pit bulls, hot-rodding pizza deliverymen, Machiavellian used-car salesmen, Rastafarians who refuse to smoke dope, floating pawn shops on Crack Street, neighborhood crimewatch teams running for their lives, after-midnight clientele at twenty-four-hour supermarkets that put zombie movies to shame, unnatural sex, casual violence, gore, blasphemy, and people who write checks at convenience stores.It all becomes too much for Jim, and before this peaceful Indiana farm boy knows what's happened to him, he's gone and killed someone. Of course, the odds are, it was someone who richly deserved it, and police officially rule the homicide extremely justified. Unfortunately for Jim, he has killed the youngest of the infamous McGraw Brothers, who got released from prison near a NASCAR track in Alabama and are heading south, bent on revenge.Not enough, you say? Okay, Serge Storms and his cohorts Coleman and Sharon are forced to move when the latter two burn down several blocks of Tampa's historic Latin Quarter during a wacky binge of freebasing high jinks. They naturally rent a house across the street from the Davenports, and Serge decides to take Jim under his wing, determined to teach him the local history and the secrets of satisfying a woman. The McGraw Brothers continue south. Sharon hallucinates on coke. Coleman refills his beer helmet. Serge becomes a Little League coach. And when the confluence of people and events is just about to boil over, everyone converges on Triggerfish Lane for the big Fourth of July block party, setting the stage for another knee-slapping bloodbath. It's just another day in Dorsey's paradise.",
  "genres": [
    "Fiction",
    "Humor",
    "Mystery",
    "Crime",
    "Audiobook",
    "Comedy",
    "Thriller"
  ],
  "author": "Tim Dorsey",
  "average_rating": "4.12",
  "url": "https://www.goodreads.com/book/show/341403.Triggerfish_Twist"
}