{
  "title": "'Til Death Do Us Part",
  "description": "True-crime writer and sometime-sleuth Bailey Weggins took the media and mystery worlds by storm in Kate White’s sexy and suspenseful debut novel, If Looks Could Kill, a New York Times bestseller and a Reading With Ripa Book Club selection. In Bailey’s latest outing, she takes the plunge into a world of designer wedding dresses, domestic divas, and deadly nuptial doings.When she gets a call from Ashley Hanes on a frigid January night, Bailey’s ready to tell her she’s not pulling any of her Gloss magazine strings to get Ashley into a designer sample sale. But the Connecticut trust-fund baby isn’t looking for fashion favors; she wants to rehash the Cross/Slavin wedding. It turns out that Peyton Cross—the Vera Wang-attired bride and Martha Stewart wannabe—is once again the talk of the town. Two of her bridesmaids have recently died in freak accidents, and Ashley’s terrified she’ll be next.Bailey’s interest is definitely piqued—she was Peyton’s college roommate and a bridesmaid in her wedding as well. Leaving her latest boyfriend behind in Manhattan, Bailey bundles up for the cold, scenic drive to Ivy Hill Farm in Greenwich, Connecticut, home of Peyton’s burgeoning catering and gourmet-food business. She’s barely begun asking questions when Ashley becomes Bridesmaid Casualty #3.After Bailey is attacked by an assailant in a cashmere coat, she realizes she’s been targeted by a well-heeled killer who knows how to dress for the weather—which narrows the list of suspects to most of the population of Greenwich, including Peyton’s employees and intimate friends. Before Bailey knows it, she is following a dangerous trail of clues that will take her from the elegant suburbs of Connecticut to New York’s trendy Lower East Side to a fabulous oceanfront hotel room in Miami.With the clock ticking and a well-concealed murderer vowing to get her out of the picture, Bailey could become the headline of the next true-crime story: Four Funerals and a Wedding.",
  "genres": [
    "Mystery",
    "Fiction",
    "Chick Lit",
    "Mystery Thriller",
    "Thriller",
    "Crime",
    "Murder Mystery"
  ],
  "author": "Kate White",
  "average_rating": "3.74",
  "url": "https://www.goodreads.com/book/show/341389._Til_Death_Do_Us_Part"
}