{
  "title": "Bombshell",
  "description": "WATCH OUT, FOXY POO. THIS BOMBSHELL IS ABOUT TO DROP.Ladies, I think I speak for the majority of us on the face of the planet when I say we all have that guy who’s grown on us like a delicious fungus. You know the kind I’m talking about--maybe he is your high school teacher or best friend’s dad--some piece of man candy so hot and edible that no matter what you do, you can’t get his taste off your mind (even if you haven't tasted him yet). For me, that guy is my big brother’s best friend, one Fox Montgomery. Doctor. Professor. Author. Here’s the problem though: not only is he the most gorgeous male specimen I’ve ever laid eyes on--black hair, steely grey eyes, and a lower lip you just wanna suck--he’s also a rich academic prick. AND I HATE HIM. I hadn’t seen him in years, and when I finally did, the vision before me bought a one-way ticket to my personal pleasure town. Then, his beautiful eyes roamed all over me, and I knew--I knew!--he didn’t like what he saw. Yeah, I’m a big girl, curvy, smooth, and round in all the right places. I’m also covered in tats, and six-inch heels are my go-to footwear. So, let me be frank about something: I’m sexy, and if I wanted a man, I'd have one.Yet, with one look, Fox turned my years of longing and long-distance eye-f*cking into a big ole mountain of hate.Here’s the thing, girls: hate and love are effin evil twins. And if my heart gets its way, Doctor Fox and I are going to end up participating in some very strenuous sextracurricular activities. Here's to our chemistry getting an A+. ;-)*This is a stand-alone novella that is the opener of the Up-Close & Personal series. It's hilarious and dirty and raunchy and perfectly short enough to be read in a single sitting. That's what Kellie Hart delivers: pocket-sized smut with a capital P! *wink wink* And you'll never finish a story without a total HEA! Due to adult content, however, Kellie suggests you be 18+ before getting your kicks on Route Sexty-Six. Trust me: you wouldn't want your kids reading this, you dirty girl, you.",
  "genres": [
    "Romance",
    "Erotica",
    "Short Stories",
    "Friends To Lovers"
  ],
  "author": "Kellie Hart",
  "average_rating": "3.86",
  "url": "https://www.goodreads.com/book/show/34121967-bombshell"
}