{
  "title": "Interlude",
  "description": "When Mia Cox finds out she can’t donate her kidney to save her younger sister’s life, she doesn’t hesitate to jump on a plane to New York, convinced she can talk their estranged birth mother, Carmen, into donating hers instead. She doesn’t know the city or how she’ll find Carmen when she gets there, but she has to try. If she doesn’t, Maddy’s going to die.On the cross-country flight, Mia figures she’ll have more than enough time to make a plan for when she lands—where she’ll go, where she’ll sleep, what she’ll eat. But then she falls into an embarrassing conversation with the cute boy sitting next to her, and only after she insults him does she realize he’s the one and only Jaxton Scott, the troubled lead singer of a famous rock band she hates. While Mia is running toward what she hopes is a cure for her sister, Jax is running away from his rockstar life. As the hours pass, they get to know each other, and she finds herself opening up to him like she never has to anyone.When Jax volunteers to help Mia on the rest of her journey, she’s hesitant to accept his offer. Under different circumstances, she would want to get to know him better, but how can she entertain this random crush on a real-life rockstar while Maddy lies in the hospital, her name one of many on a never-ending transplant list?Though everything seems perfect while they’re in the air, once on the ground again, Mia’s lack of preparation catches up with her, and she receives grave news from home. Clinging to the shred of hope she has left, she accepts Jax’s help but makes it clear that her priority is finding Carmen and saving Maddy’s life. She will not, under any circumstances, stray from her mission no matter how cute, thoughtful, and sweet her new friend may be.",
  "genres": [
    "Romance",
    "Young Adult",
    "Contemporary",
    "Realistic Fiction",
    "Clean Romance",
    "Young Adult Romance",
    "Young Adult Contemporary"
  ],
  "author": "Chantele Sedgwick",
  "average_rating": "4.20",
  "url": "https://www.goodreads.com/book/show/34138299-interlude"
}