{
  "title": "Relentless",
  "description": "New cover edition found here.Every woman needs a warrior at her back.  There’s no hiding the fact that Julia Collins has issues. She’s shy to the point of trying to be invisible. She has OCD tendencies—breaking out in hives if she loses control of her environment. She finds it hard to talk to intimidating men, or more accurately, to any men. A fact that makes working as the office manager for Benson Security particularly difficult—the company is made up almost entirely of huge, intimidating, ex-military men. If she couldn’t communicate by email and texting, she wouldn’t be able to do her job at all. But none of the men affect her the way Joe Barone does. The ex-marine is everything Julia isn’t. He’s charming, confident, heroic and so sexy it hurts to look at him. There’s no way a man like Joe would be interested in a woman like Julia. And there’s definitely no way Julia could cope with him even if he was. For her sanity’s sake, there’s only one thing Julia can do when it comes to Joe Barone—hide.  When Joe looks at Julia he doesn’t see her many issues. He sees something far more precious. He sees a woman who cares about everyone around her. A woman who is organised and capable of running any project she’s handed, right down to the most minute detail. He sees a woman who’s gorgeous and loving and smart and funny. A woman who needs someone to stand between her and the world. A woman who needs a warrior fighting in her corner. A woman who could need him. Joe knows that any guy who manages to get past Julia’s defenses, to the woman beneath, will have a treasure worth dying for—and he intends to be that man. All he needs is a chance, one tiny opening to show her she can trust him with all that she is.  And that opening comes in the unexpected form of an adventure-seeking grandmother.  When Julia’s grandmother gets arrested in South America, Julia has to step outside of her comfort zone to bring her home. Which means, dealing with authority figures in a totally different country and in a totally different language. A language she doesn’t speak. Fortunately for her, Joe is fluent in Spanish and more than happy to accompany Julia to Peru. Julia isn’t sure she’ll survive the long flight with Joe, let alone the time it takes to sort out her grandmother’s problems, but when they get to Lima, they discover things are much worse than her grandmother led them to believe.  To get them all out of trouble, Julia is going to need a warrior at her side.",
  "genres": [
    "Romance",
    "Suspense",
    "Romantic Suspense",
    "Contemporary",
    "Contemporary Romance",
    "Humor",
    "Adventure"
  ],
  "author": "Janet Elizabeth Henderson",
  "average_rating": "4.28",
  "url": "https://www.goodreads.com/book/show/34130266-relentless"
}