{
  "title": "Girlish: Growing Up in a Lesbian Home",
  "description": "An honest, unfiltered memoir about a girl with an unconventional family.“The story everyone wants to hear isn’t the story I want to tell.” Lara Lillibridge grew up with two moms—an experience that shaped and scarred her at the same time. Told from the perspective of “Girl,” Lillibridge’s memoir is the no-holds-barred account of childhood in an unconventional household. Personally less concerned with her mother’s sexuality and more with how she fits into a world both disturbed and obsessed with it, Girl finds that, in other people’s eyes, “The most interesting thing about me is not about me at all; it is about my parents.”It won’t be long before readers realize that “unconventional” barely scratches the surface. In the early years, Girl’s feminist mother reluctantly allows her to play with her favorite Barbies while her stepmother refuses to comfort her when she wakes up from nightmares. She swims naked with her lesbian mother and stepmother in upstate New York. Girl and her brother travel four thousand miles—unaccompanied—to visit their father in rural Alaska, where they sleep in a locked cabin without running water, telephone, or electricity. Raised to be a free spirit by norm-defying parents, Girl has to define her own boundaries as she tries to fit into heteronormative suburban life, all while navigating her mother’s expectations, her stepmother’s mental illness, and her father’s serial divorces.Not wanting to be the poster child for either camp on the issue of same-sex parenting yet unable to escape the facts of her upbringing, Lillibridge bravely tells her own story and offers a unique perspective on what it means to be raised by lesbians. At times humorous and pithy while cringe-worthy and heartbreaking at others, Girlish is a human story that challenges readers to reevaluate their own lives and motivations.",
  "genres": [
    "Memoir",
    "Nonfiction",
    "LGBT",
    "Biography",
    "Gender and Sexuality",
    "Biography Memoir",
    "Feminism"
  ],
  "author": "Lara Lillibridge",
  "average_rating": "3.84",
  "url": "https://www.goodreads.com/book/show/34138387-girlish"
}