{
  "title": "Quantum Philosophy",
  "description": "In this magisterial work, Roland Omnès takes us from the academies of ancient Greece to the laboratories of modern science as he seeks to do no less than rebuild the foundations of the philosophy of knowledge. One of the world's leading quantum physicists, Omnès reviews the history and recent development of mathematics, logic, and the physical sciences to show that current work in quantum theory offers new answers to questions that have puzzled philosophers for Is the world ultimately intelligible? Are all events caused? Do objects have definitive locations? Omnès addresses these profound questions with vigorous arguments and clear, colorful writing, aiming not just to advance scholarship but to enlighten readers with no background in science or philosophy.The book opens with an insightful and sweeping account of the main developments in science and the philosophy of knowledge from the pre-Socratic era to the nineteenth century. Omnès then traces the emergence in modern thought of a fracture between our intuitive, commonsense views of the world and the abstract and--for most people--incomprehensible world portrayed by advanced physics, math, and logic. He argues that the fracture appeared because the insights of Einstein and Bohr, the logical advances of Frege, Russell, and Gödel, and the necessary mathematics of infinity of Cantor and Hilbert cannot be fully expressed by words or images only. Quantum mechanics played an important role in this development, as it seemed to undermine intuitive notions of intelligibility, locality, and causality. However, Omnès argues that common sense and quantum mechanics are not as incompatible as many have thought. In fact, he makes the provocative argument that the \"consistent-histories\" approach to quantum mechanics, developed over the past fifteen years, places common sense (slightly reappraised and circumscribed) on a firm scientific and philosophical footing for the first time. In doing so, it provides what philosophers have sought through the a sure foundation for human knowledge.Quantum Philosophy is a profound work of contemporary science and philosophy and an eloquent history of the long struggle to understand the nature of the world and of knowledge itself.",
  "genres": [
    "Philosophy",
    "Science",
    "Physics",
    "Nonfiction",
    "Quantum Mechanics"
  ],
  "author": "Roland Omnès",
  "average_rating": "3.62",
  "url": "https://www.goodreads.com/book/show/3415428-quantum-philosophy"
}