{
  "title": "The Earth, the City, and the Hidden Narrative of Race",
  "description": "In this work, Carl Anthony shares his perspectives as an African-American child in post-World War II Philadelphia; a student and civil rights activist in 1960s Harlem; a traveling student of West African architecture; and an architect, planner, and environmental justice advocate in Berkeley. He contextualizes this within American urbanism and human origins, making profoundly personal both African American and American urban histories as well as planetary origins and environmental issues, to not only bring a new worldview to people of color, but to set forth a truly inclusive vision of our shared planetary future.The Earth, the City, and the Hidden Narrative of Race connects the logics behind slavery, community disinvestment, and environmental exploitation to address the most pressing issues of our time in a cohesive and foundational manner. Most books dealing with these topics and periods silo issues apart from one another, but this book contextualizes the connections between social movements and issues, providing tremendous insight into successful movement building. Anthony's rich narrative describes both being at the mercy of racism, urban disinvestment, and environmental injustice as well as fighting against these forces with a variety of strategies.Because this work is both a personal memoir and an exposition of ideas, it will appeal to those who appreciate thoughtful and unique writing on issues of race, including individuals exploring their own African American identity, as well as progressive audiences of organizations and community leaders and professionals interested in democratizing power and advancing equitable policies for low-income communities and historically disenfranchised communities.",
  "genres": [
    "Urban Planning",
    "Race",
    "Social Justice"
  ],
  "author": "Carl C Anthony",
  "average_rating": "4.48",
  "url": "https://www.goodreads.com/book/show/34144976-the-earth-the-city-and-the-hidden-narrative-of-race"
}