{
  "title": "The Forbidden: Prequel to the Ancestors Saga",
  "description": "Alone. Hunted. Vulnerable.As the blood settles into the snow, Rebaa’s life lies in tatters. Her adopted tribe has been slaughtered, leaving her lost and isolated in a freezing and hostile world. Kidnapped from her own forest race years before, Rebaa must now find another people to protect her and quickly.But in daring to fall in love with a man not of her own species, she defied every lore set by the creators of human kind, the Sky Gods. Now damningly burdened with her murdered lover’s offspring, Rebaa knows that if anyone were to discover her baby’s heritage, the only sentence would be death.Driven by the love for her unborn, Rebaa sets out on a perilous journey to find a safe haven for them both. But what haven could possibly exist for one who bears… the Forbidden?Click now to take your first tantalising step into the world of the Ancestors Saga.The Ancestors Saga Exciting and compelling, the Ancestor's Saga is an epic journey 40,000 years into our own dark and forgotten past. As the world teeters on the brink of another glacial winter, homo sapiens are not the only human to walk the Earth. When the destiny of the entire human race hangs in the balance, the prize for the survivors will be the Earth itself. The Ancestors Saga is a prehistoric fantasy romance, combining history, mystery and legend to retell a lost chapter in humanity's dark and distant past. What drove you to write the Ancestors Saga? I have always loved epic fantasy romance, in reading, writing and in film. The story for my two main characters for the saga-main hit me about six years ago and the world grew up around them. It just demanded to be told. What is special about the Ancestors Saga? The Ancestors Saga takes readers into a visionary world that has been lost to the depths of time. It offers a glimpse of a world that might have been with a new fantastical edge. It explores where our own folklore, myths and legends may have arisen and what humanity might have become had circumstance allowed a different, more spiritual path. What is the main driving force for the Saga? I like my characters to be at the heart of the story, their journey is told directly from their own hearts and minds. I wish the reader to experience their hardships and struggles through their eyes alone. The driving force behind the whole story is the journey these characters embark upon. Will there be much romance within this fantasy saga? Definitely, but I am not going to spoil anything by elaborating between whom at this point! Who is your target audience? This series is a certain fantasy bestseller for anyone above the age of 16 who enjoys epic fantasy, historical fiction, with romance at its heart. I would place it for young adult readers.",
  "genres": [
    "Fantasy"
  ],
  "author": "L.E. Holmes",
  "average_rating": "4.02",
  "url": "https://www.goodreads.com/book/show/34186732-the-forbidden"
}