{
  "title": "Quest for Decisive Victory: From Stalemate to Blitzkrieg in Europe, 1899-1940",
  "description": "Since the earliest days of warfare, military operations have followed a predictable after a decisive battle, an army must pursue the enemy and destroy its organization in order to achieve a victorious campaign. But by the mid–nineteenth century, the emergence of massive armies and advanced weaponry--and the concomitant decline in the effectiveness of cavalry--had diminished the practicality of pursuit, producing campaigns that bogged down short of decisive victory. Great battles had become curiously indecisive, decisive campaigns virtually impossible. Robert Citino now tells how European military leaders analyzed and eventually overcame this problem by restoring pursuit to its rightful place in combat and resurrecting the possibility of decisive warfare on the operational level. A study of war at the operational level, Quest for Decisive Victory demonstrates the interplay and tension between technology and doctrine in warfare and reveals how problems surrounding mobility--including such factors as supply lines, command and control, and prewar campaign planning--forced armies to find new ways of fighting. Citino focuses on key campaigns of both major and minor conflicts. Minor wars before 1914 (Boer, Russo-Japanese, and the Balkan Wars of 1912-13) featured instructive examples of operational maneuver; the First World War witnessed the collapse of operations and the rise of attrition warfare; the Italo-Ethiopian and Spanish Civil Wars held some promise for breaking out of stalemate by incorporating such innovations as air and tank warfare. Ultimately, it was Germany's opening blitzkrieg of World War II that resurrected the decisive campaign as an operational possibility. By grafting new technologies--tanks, aircraft, and radio--onto a long tradition of maneuver warfare, the Wehrmacht won decisive victories in the first year of the war and in the process transformed modern military doctrine. Citino's study is important for shifting the focus from military theory and doctrine to detailed operational analyses of actual campaigns that formed the basis for the revival of military doctrine. Quest for Decisive Victory gives scholars of military history a better grasp of that elusive concept and a more complete understanding of modern warfare. This book is part of the Modern War Studies series.",
  "genres": [
    "History",
    "Military History",
    "War",
    "Military Fiction",
    "Nonfiction",
    "Germany",
    "World War II"
  ],
  "author": "Robert M. Citino",
  "average_rating": "4.20",
  "url": "https://www.goodreads.com/book/show/341899.Quest_for_Decisive_Victory"
}