{
  "title": "Beijing Confidential: A Tale of Comrades Lost and Found",
  "description": "Jan Wong has returned to Beijing. Her quest: to find someone she encountered briefly in 1973, and whose life she was certain she had ruined forever.In the early 70s, Jan Wong travelled from Canada to become one of only two Westerners permitted to study at Beijing University. One day a young stranger, Yin Luoyi, asked for help in getting to the United States. Wong, then a starry-eyed Maoist, immediately reported Yin to the authorities. Thirty-three years on, and more than a decade after the publication of her bestselling Red China Blues, Jan Wong revisits the Chinese capital to begin her search for the person who has haunted her conscience. She wants to apologize, to somehow make amends. At the very least, she wants to discover whether Yin survived.As Jan Wong hunts through the city, she finds herself travelling back through the decades, back to her experiences in the Cultural Revolution, to places that were once of huge importance to her. She has changed, of course, but not as much as Beijing. One of the world’s most ancient cities is now one of its most modern. The neon signs no longer say “Long Live Chairman Mao” but instead tout Mary Kay cosmetics and Kentucky Fried Chicken. Places she once knew have vanished, bulldozed into oblivion and replaced by avant-garde architecture, trendy bars, and sleek condos. The people she once knew have changed, too, for better or for worse. Memories are everywhere. By searching out old friends and acquaintances, Jan Wong uncovers tantalizing clues about the woman she wronged. She realizes her deepest fears and regrets were justified. But Yin herself remains elusive–until the day she phones Jan Wong.Emotionally powerful and rich with detail, Beijing Confidential weaves together three distinct stories–Wong’s journey from remorse to redemption, Yin’s journey from disgrace to respectability, and Beijing’s stunning journey from communism to capitalism.",
  "genres": [
    "China",
    "Nonfiction",
    "Memoir",
    "Asia",
    "Travel",
    "History",
    "Canada"
  ],
  "author": "Jan Wong",
  "average_rating": "3.73",
  "url": "https://www.goodreads.com/book/show/341782.Beijing_Confidential"
}