{
  "title": "Urgent Message from Mother: Gather the Women, Save the World",
  "description": "Wake up! Arise! Earth is our home. Listen to your mother, she is calling. Urgent Message from Mother is a call to action for all the women of the world. Do not ask for permission to gather the women. What cannot be done by men, or by individual women, can be done by women together. Women coming together can produce the tipping point. \"Mother\" is Mother Earth, mother instinct, mother archetype, mother goddess, Earth Mother ─ the sacred feminine, the Goddess, Gaia. Women as a gender have qualities and priorities that the world needs to reverse man’s destruction of our planet, the violence that traumatizes children, and cycles of conflict and fratricidal wars. \"When women are strong together, women can be fiercely protective of what we love.\" Bolen explains that societies and even species, when they reach a tipping point, can undergo rapid evolution. \"We've learned that women gathering together in groups and telling the truth of their lives can actually change the world.\" Now is the time for women to lead. Jean Shinoda Bolen’s unique combination of visionary thinking and practical how-to seeks to galvanize the power of women acting together in order to save our world. Bolen outlines the lessons we can learn from the women's movement, draws on Jungian psychology and the sacred feminine, and gives powerful examples of women coming together all over the globe to make a significant impact. Jean Shinoda Bolen's life's work, which includes her Jungian-inspired insights in The Tao of Psychology , her best-seller Goddesses in Every Woman , Crones Don't Whine , and The Millionth Circle , culminate in this timely book, Urgent Message from Mother .",
  "genres": [
    "Nonfiction",
    "Feminism",
    "Spirituality",
    "Womens",
    "Nature"
  ],
  "author": "Jean Shinoda Bolen",
  "average_rating": "4.01",
  "url": "https://www.goodreads.com/book/show/3420156-urgent-message-from-mother"
}