{
  "title": "Phoebe Harkness Omnibus",
  "description": "\"Intelligently crafted horror-thriller ... Absolutely engrossing and left me wanting more.\" Simon Clark, bestselling horror author   A third of the human population has been lost.  The wars came, and they created a monster. The Pale, a subhuman, vampire-like drone. Then they lost control.  In the thirty years that followed, humankind sought to rebuild itself within the walls of New Oxford.  But society had become fractured – humans now lived incongruously among Genetic Others, themselves a group of many subspecies.  The most dangerous of them all: the vampires.  Hell’s Teeth.When Phoebe Harkness receives a phone call in the middle of the night, things take a turn to the horrifying. Her supervisor at Blue Lab One, a high-security research facility, has gone missing.  And all that is left behind: her teeth.  Dr Harkness now finds herself in a race against time to stop further bloodshed and uncover the mystery behind the victims of this horrific crime. She must navigate the dark underworld of the vampire community, without becoming someone’s prey herself…  But she is not alone – on her side, against all odds, is another vampire. Together they must fight for answers before it’s too late…  Hell’s Teeth is the gripping first instalment of the urban gothic Phoebe Harkness series. It follows the young doctor as she stalks through the corrupt dystopia of New Oxford.  Crescent Moon. What do you do when your world is turned upside down?  When you discover your father had a direct hand in the genocide of much of the world’s human population?  Phoebe Harkness’ life has changed forever. A new sub-species of vampire-like drones has set its teeth to the survivors of humanity.  They’re not the only ones: ‘Genetic Others’ such as vampires, werewolves and more roam the streets of New Oxford, trying – and sometimes failing – to live peacefully amongst humankind.  But that is all about to change.  A spate of serial killings have occurred, rocking the already fragile ecosystem of New Oxford.  Phoebe must get to work. She is named as liaison between the Genetic Others and the Cabal, the ruling order of the walled city.  She must negotiate with the Tribals, a subset of werewolves cast aside by the cultural hegemony of the Cabal.  But before she can make any progress with the Tribal leader, Kane, she learns of more murders – and three missing students. And Kane’s daughter is among the missing…  One of the victims leaves a message in blood: ‘Crescent Moon’.  Now Phoebe must act urgently with the help of Kane and her former paramour, vampire Allesandro to track down the culprit of these horrific killings.  But who is conducting all of these strange happenings behind the scenes?  And what does it have to do with the Crescent Moon…?  Crescent Moon is the gripping second instalment of the urban gothic Phoebe Harkness series. It follows the young doctor as she stalks through the corrupt dystopia of New Oxford.   Praise for James Fahy:   \"A clever post-apocalyptic fantasy, full of hilarious one-liners\" \nNew York Journal of Books\n  \"Hell’s Teeth is a compelling, original story which kept me eagerly",
  "genres": [],
  "author": "James Fahy",
  "average_rating": "4.51",
  "url": "https://www.goodreads.com/book/show/34204235-phoebe-harkness-omnibus"
}