{
  "title": "Stalin: Waiting for Hitler 1929-1941",
  "description": "Pulitzer Prize-finalist Stephen Kotkin continues his definitive biography of Stalin, from collectivization and the Great Terror through to the coming of the conflict with Hitler's Germany that is the signal event of modern world history.When we left Stalin at the end of Stalin: Paradoxes of Power: 1878-1928, it was 1928, and he had finally climbed the mountaintop and achieved dictatorial power of the Soviet empire. The vastest peasant economy in the world would be transformed into socialist modernity, whatever it took. What it took, or what Stalin believed it took, was the most relentless campaign of shock industrialization the world has ever seen. This is the story of the five year plans, the new factory towns, and the integration of an entire system of penal labor into the larger economy. With the Great Depression throwing global capital into crisis, the Soviet Union's New Man looked like nothing so much as the man of the future. As the shadows of the 30's deepen, Stalin's drive to militarize Soviet society takes on increasing urgency, and the ambition of Nazi Germany becomes the predominant geopolitical reality he faces when Hitler claims that communism is a global \"Judeo-Bolshevik\" conspiracy to bring the Slavic race to power. But just because they're out to get you doesn't mean you're not paranoid. Stalin's paranoia is increasingly one of the most horrible facts of life for his entire country. Stalin's obsessions drive him to violently purge almost a million people, including military leadership, diplomatic corps and intelligence apparatus, to say nothing of a generation of artistic talent. And then came the pact that shocked the world, and demoralized leftists everywhere: Stalin's pact with Hitler in 1939, the carve-up of Poland, and Stalin's utter inability to see Hitler's build-up to the invasion of the USSR. Yet for all that, in just 12 years of total power, Stalin has taken this country from a peasant economy to a formidable modern war machine that rivaled anything else in the world. When the invasion came, Stalin wasn't ready, but his country would prove to be prepared. That is a dimension of the Stalin story that has never adequately been reckoned with before, and it looms large here. Stalin: Waiting for Hitler: 1929-1941 is, like its predecessor, nothing less than a history of the world from Stalin's desk. It is also, like its predecessor, a landmark achievement in the annals of its field, and in the biographer's art.",
  "genres": [
    "History",
    "Biography",
    "Russia",
    "Nonfiction",
    "Russian History",
    "Politics",
    "World War II"
  ],
  "author": "Stephen Kotkin",
  "average_rating": "4.46",
  "url": "https://www.goodreads.com/book/show/34201498-stalin"
}