{
  "title": "Sorelle Materassi",
  "description": "Composto nel 1934, “Sorelle Materassi” è il romanzo più noto di Aldo Palazzeschi. Protagoniste sono Carolina e Teresa Materassi, due anziane sorelle ricamatrici, simili “alle agavi indistruttibili e incapaci di crescere, decrepite e bambine”. Nella grigia esistenza delle due zitelle, dedite al lavoro in compagnia della terza sorella Giselda e della serva Niobe - ” Le due ricamatrici non si movevano mai dal loro arsenale intorno al quale, a rispettosa e rispettiva distanza, si moveva tutto il resto come le stelle intorno al sole” - piomba ad un tratto il nipote Remo, rimasto orfano di madre (la defunta quarta sorella Materassi). La giovinezza, la bellezza e la disinvoltura del ragazzo spingono le zie a piegarsi ai suoi comandi, cambiando vita e bruciando in poco tempo i risparmi accumulati in anni di duro lavoro. Abbandonate dal nipote, ridotte alla miseria, le tre donne non cessano tuttavia di adorare Remo, accontentandosi di ricevere qualche cartolina e accettando anche Peggy, modernissima ragazza americana che egli ha sposato.Il testo è suddiviso in otto grandi capitoli: \"Santa Maria a Coverciano\", \"Sorelle Materassi\", \"Remo\" \"Palle\", \"Teresa e Carolina stanno a vedere, Giselda canta, Niobe va a vendemmiare\", \"Giselda! Niobe!\", \"Peggio\", \"Sepolte vive\".Il primo capitolo inserisce la vicenda sullo sfondo delle colline di Coverciano, intorno a Firenze, con un esplicito richiamo a Boccaccio (una lunga citazione dalla VII giornata del “Decameron”), che inquadra la storia sotto il segno della \"beffa\", classico tema della novellistica toscana. Aldo Palazzeschi raffigura con sarcasmo le sorelle attraverso un linguaggio teatrale ricco di formule orali e di espressioni del vernacolo - più evidenti nella sintassi che nel lessico - intessute in un dialogo sorprendentemente effervescente, punto di forza dell'arte palazzeschiana. Altrettanta vivacità è data dai particolari scenici delle descrizioni e dai giochi linguistici con cui l’autore dà vita a siparietti esilaranti come la scena della “cambiale”, in cui Remo arriva a chiudere le zie in dispensa pur di farsi firmare un’astronomica cambiale. Il grande successo del romanzo è testimoniato anche dalle riduzioni cinematografiche: il film “Le sorelle Materassi” del 1943, sceneggiato da Bernard Zimmer e diretto da Ferdinando Maria Poggioli, e lo sceneggiato televisivo della Rai del 1972, con la regia di Mario Ferrero.",
  "genres": [
    "Classics",
    "Fiction",
    "Italian Literature",
    "Italy",
    "Audiobook"
  ],
  "author": "Aldo Palazzeschi",
  "average_rating": "3.74",
  "url": "https://www.goodreads.com/book/show/3420645-sorelle-materassi"
}