{
  "title": "Angelic Sigils, Keys and Calls: 142 Ways to Make Instant Contact with Angels and Archangels",
  "description": "Whatever you desire, there is an angel that can help. This is the most comprehensive book of practical angel magick you will ever find.Discover 142 Angels and Archangels, and the secret sigils, keys and calls that let you make instant contact with them.You will find angels and rituals for every desire, covering powers related to money, love, the spirit, self-understanding and healing. You can do no harm, and come to no harm. This is pure, safe magick. There are no demons, no dark forces and no fallen angels, only angels of light.What makes this different from other angel books?It contains a simple magick ritual that gets results.Your perform each ritual just once, on any day that you choose.There are 127 sigils, with the Secret Admitting Words that make them work.For the first time, Ben Woodcroft reveals a ritual method that is refined and advanced, while remaining simple enough for beginners. It's based on centuries of magickal knowledge, updated by several decades of secret research and experiment. The ritual practice has been crafted so that when you call to the angels, they hear you instantly.There are many books about angels, but there are none that concentrate the magickal process into something so simple, while giving you access to so many angels.You will work without any wands, incense or oils. It is your divine right to contact angels, and the exact method for doing so is set out in detail. You will The Eight Angels of Virtue, who bring clarity, honesty and peaceThe Nine Angels of Thrones, who work primarily with the emotionsThe Eleven Archangels, who help with major life changesThe Angels of The 72 Letter Name, who are willing to help on countless issuesThe Angels of The 42 Letter Name, who are concerned with self-discoveryThe Preparatory Working for opening up the doorway to connectionThe Central Working - a simple ritual that works for any of the angelsThis book gives you a way to send your hopes and needs to the angels, so that your life can be changed. It is potent, practical magick that brings the results you desire.",
  "genres": [
    "Occult",
    "Spirituality",
    "Angels"
  ],
  "author": "Ben Woodcroft",
  "average_rating": "4.45",
  "url": "https://www.goodreads.com/book/show/34197173-angelic-sigils-keys-and-calls"
}