{
  "title": "The Mother of Black Hollywood: A Memoir",
  "description": "The \"Mega Diva\" and legendary star of Black-ish looks back on her memorable journey to fame and the unforgettable life lessons she learned along the way.Jenifer Lewis keeps it real in this provocative and touching memoir by a mid-western girl with a dream whose journey from poverty to Hollywood will move, shock, and inspire readers.Told in the audacious voice her fans adore, Jenifer describes a road to fame made treacherous by dysfunction and undiagnosed mental illness, including a sex addiction. Yet, supported by loving friends and strengthened by \"inner soldiers,\" Jenifer never stopped entertaining and creating.We watch as Jenifer develops icon status stemming from a series of legendary screen roles as the sassy, yet loveable, mama or auntie. And we watch as her emotional disturbances, culminating in a breakdown while filming The Temptations movie, launch her on a continuing search for answers, love, and healing.Written with no-holds-barred honesty and illustrated with sixteen-pages of color photos, this gripping memoir is filled with insights gained through a unique life that offers a universal message: \"Love yourself so that love will not be a stranger when it comes.\"From her first taste of applause at five years old to landing on Broadway within eleven days of graduation and ultimately achieving success in movies, television and global concert halls, Jenifer reveals her outrageous life story with lots of humor, a few regrets and most importantly, unbridled joy. Candid, warm and wonderfully inspiring, The Mother of Black Hollywood intimately reveals the heart of a woman who lives life to the fullest.",
  "genres": [
    "Memoir",
    "Nonfiction",
    "Audiobook",
    "Biography",
    "African American",
    "Autobiography",
    "Biography Memoir"
  ],
  "author": "Jenifer Lewis",
  "average_rating": "4.36",
  "url": "https://www.goodreads.com/book/show/34217536-the-mother-of-black-hollywood"
}