{
  "title": "Get Over It",
  "description": "The Gods Made Me Do It #1  (Spin off series from the Cloverleah Pack. Can be read as a standalone, but readers of the Cloverleah Pack series will recognize some of the secondary characters).  Madison Worthington has worked hard to get to where he is. Thrown out of his pack at a young age, he finds his home in the San Antonio pack, eventually talking himself into a job as Damien's PA. He doesn't get the respect he'd hoped for, but he holds his head high as he works behind the scenes keeping Damien's club and pack running smoothly. At night he dreams of a mate who will hold him in strong arms and love him just the way he is. Unfortunately, the Fates appear to have other plans.  Sebastian D'Eath, son of Thanatos the Angel of Death, has always known that the Fates would throw a mate in his path. He just didn't realize he had to dive into flood waters to stop the man from drowning. But no matter how cute his mate might look as a drowned rat, Sebastian has his arguments ready. He doesn't want a mate; won't take a mate and no one can make him. However, he soon finds out the Fates have other plans for him, too.  Angry words lead to Madison being captured by a wolf with a sick mind. Salvation comes from an unlikely quarter, but Madison returns to the pack with a change of heart. He has some scores to settle and Sebastian is first in the firing line. Hellhounds, dinners and a red convertible - will Sebastian ever get the man he claimed he didn't want?  This story is roughly 50,000 words, but the book includes a bonus short story about Thanatos and Cody.  Warning: Contains two sexy men, intimate situations and coarse language. Also watch out for a sexy twink with an attitude that won't stop, a demigod who seriously needs to grow up and hellhounds that appear without warning.",
  "genres": [
    "Paranormal",
    "M M Romance",
    "Fantasy",
    "Shapeshifters",
    "Romance",
    "Audiobook",
    "Contemporary"
  ],
  "author": "Lisa Oliver",
  "average_rating": "4.16",
  "url": "https://www.goodreads.com/book/show/34219664-get-over-it"
}