{
  "title": "One Woman v. \"Life\": Getting Your Head Around Life and All the Cr*p",
  "description": "JUST KNOWING YOU ARE NOT ALONE CAN REALLY HELP FIND YOU PEACE INSTANTLY!I have felt like I don't fit in all my life, do you? But I'm here to share and reassure you that it is okay and you are not alone!DO YOU STRUGGLE WITH DAY TO DAY LIFE? It can be so daunting, can't it! Just even answering the telephone!DO YOU FEEL AWKWARD MEETING NEW PEOPLE? OR SIMPLY TALKING TO PEOPLE? You are not alone...DO YOU STRUGGLE WITH EXAMS, MOTORWAYS, EATING IN FRONT OF PEOPLE? You are not alone...DO YOU PANIC AT THE THOUGHT OF HAVING TO GO TO THE LOO WHEN YOU ARE NOT AT HOME? You are not alone...DO YOU FEEL LIKE ALL EYES ARE ON YOU AND YOU ARE BEING JUDGED? You are all alone...DO YOU FIND IT DIFFICULT TO SHOW OR SHARE EMOTION? You are not alone!SIMPLY DO YOU FEEL, LIKE YOU HAVEN'T GOT YOUR HANDBOOK TO LIFE? Me too!'One Woman vs Life' is a warm and approachable short read. Like a handbook or a hand being held out, by a friend, who knows what you are going through. Drawn from my own experiences and the struggles of everyday situations, that have either baffled me or are a minefield of anxiety or stress. Have you ever felt like you just don't get, what everyone else seems to know & desperate to find answers? ...the general feeling that you can't cope and that life is working on a different page to you. It's okay, breathe, as I say you are not alone and please stop punishing yourself! 'One Woman vs Life' offers an insight with help and thought provoking passages about our everyday struggles. Reads like friends chatting and sharing their feelings over a glass of something with openness and honesty on sensitive subjects to help you stop worrying and learn to accept you are okay as you are, if not fantastic! Written with a light touch and on occasions tongue in cheek. If you suffer from negative thinking or simply need to feel you are not alone in life, with some helpful affirmations and tips then 'One Woman vs Life' will be a welcome companion to motivate you to be kind to yourself and embrace life today and all it offers.CHAPTERS FROM ONE WOMAN VS & juryAm I to blame...where does it start?Where's my handbook to life?It can't be that difficult...can it?The narrator on your shoulderAm I a hedgehog?Food is not my friend...so it seemsYour child within...Your life's treasure huntOne Woman vs LifeFurther Reading...What others said!\"I've always felt like I was awkward or a bit stupid, so it was nice to hear that someone else had the same worries and I'm not stupid!\" C. Hadjipourou\"This is not a book that will fix you but I enjoyed it and made me feel better and I like the idea of a treasure map.\" T. Frost\"I so related to this especially not liking hugs and the issues of needing to go to the loo when you are out!\" W.Milner\"I thought it was just me, with motorways! It made me chuckle in places and found it a comfort to know as the author says you are not alone.\" L. Barry\"I suffered with acne and wore glasses and that's where my confidence took a knock but nice to read some positive affirmations to make us feel better in ourselves.\" F.GalesAbout the author and The One Woman SeriesOne Woman vs Life is the 1st in the series of the 'One Woman Series' by Author Nikki Fuller. The 2nd is One Woman's Private Life Shared. Nikki is now in her mid 40's plus a few and has battled for most of her life with anxieties and insecurities until now. Instead of going into battle, she has chosen to dance with life! Some days she may still have two left feet but she is determined to let the things in life that did trouble her, not stop her from being happy and proud of who she is, imperfections and all that include a lot of lists!Follow Nikki on @onewomanseriesOTHER BOOKS IN THE ONE WOMAN WOMAN'S Private Life SharedTHE SAMBUCA QUEEN CLUB! Finding a Balance that suits you!YOUR ONE TOOL FOR LIFE Your Swiss Army Knife!From Amazon and www.sleepinglionspublishers.com",
  "genres": [],
  "author": "Nikki K. Fuller",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/34212794-one-woman-v-life"
}