{
  "title": "Foretold Fate",
  "description": "She will not give in…  When her mother suddenly passes away, Una is left with no other family and must rely on the protection of her foster-brother, Brocc Mac Greine. Mayhap it would not be so bad if she had not so recently turned down his offer of marriage…again. So, when Brocc shows up after her mother’s burial and offers to take Una in as his ward, she reluctantly agrees. But it doesn’t take long for Una to discover that Brocc has no intention of giving up his pursuit to marry her. Brocc is the most sought after lad in the village. He is a warrior. He is a nobleman. He is their king. And that is the problem. No matter how strongly she feels for him, Una is a simple common-born lass and not fit to be the wife of a king. And with Brocc’s reputation with the other lassies of the village, she decides a future with him could only lead to heartache. No good can come from loving a man like Brocc Mac Greine. No good at all…  He will not be denied…  Brocc used to pull Una’s hair and tease her for her gangly, awkward legs. But there is nothing gangly or awkward about the woman Una has become. And there is nothing brotherly about the feelings he has for his foster-sister. All Brocc wants is to make Una his, but with her repeated refusals, his only option after her mother passes is to offer his protection and his home. But, the push and pull between him and Una is slowly driving him mad and the lass continues to refuse his advances while occupying his home…and his every thought.  They will not be deterred…  Their quest to locate their missing sister has sent Gwynneth and Ceara all over Ériu. Imagine their surprise when they stumble across Brocc Mac Greine on their journey, the very man they seek. He knows their sister and her location, but after learning of Una’s true identity and that their fate is foretold by an ancient legend, Brocc agrees to lead them to her…on one condition: he wants to earn Una’s love on his own, without the aid of her sisters or knowledge of the legend before he will reunite them. Can Brocc prove to Una they belong together before time runs out, despite his many failed attempts? And, how will Una react when she comes face to face with her identical sisters and learns that she is one of the legendary Sisters of Danu?  Rated 18+ due to some adult content",
  "genres": [],
  "author": "Mia Pride",
  "average_rating": "4.49",
  "url": "https://www.goodreads.com/book/show/34210474-foretold-fate"
}