{
  "title": "Dead of Winter: A Dark Fiction Anthology",
  "description": "Can you feel them scratching at the inside of your mind?A collection of 10 nightmares and dark dreamscapes to terrify and delight you, from a story of the end of the world lived again and again to a tale of an ancient evil from the old world finding its way to the new world.“Don’t read them before bedtime.” -- reader reviewFans of Stephen King, Joe Hill, and Dean Koontz will enjoy this selection of horror, suspense, and even a nod to the great Edgar Allen Poe himself.Not all stories within this anthology are suitable for younger audiences.Scroll up and click Buy to get your copy today!--Table of “The Darkness Has Teeth” by Pamela Jeffs – A darker Groundhog's Day, where a man must relive the end of the world over and over as he tries to undo the fatal mistake he made.“The Huntress of Bur” by Justin Chasteen – They set out to end the old woman of the woods. But the tables are about to be turned.“Fry Machete’s Monsters, Munchies, and Mayhem” by Stuart Conover – A cryptid hunts one of his own, turned killer, all while trying not to blow his day hosting a scripted reality show.“Only in Death” by Zoey Xolton – The dark ruler of the fae will do any to keep his human lover enslaved, and she will do anything to be free of her supernatural mate.“These Claws Dig Shallow Graves” by Kevin Holton – A man’s sins have brought a demon to his door. She'll take his life . . . or the life of another as repayment.“Slipped Stitch” by KT Wagner – Prisoners face the ultimate test of their resolve to be free in this dystopian future.“Spotlight” by David J. Gibbs – A family gathering takes a dark turn when young Michael discovers a terrifying secret his family has carried with them since they came over from the Old World.“Coyoteman” by Robert Perret – A serial killer meets his match when he runs afoul of a group of skinwalkers.“The Killers” by Meredith Schindehette – A post-apocalyptic zombie tale with a twist.“Annabel Lee” by Erin J. Kahn – A masterful ode to Edgar Allen Poe so good that you won't believe it wasn’t written by Poe himself.Dead of Winter’s Full List of Horror AnthologiesSuspense ThrillersShort StoriesSupernaturalSpeculative FictionDytopianDark FantasyPost-ApocalypticUrban LegendsOccult",
  "genres": [
    "Fiction"
  ],
  "author": "Pamela Jeffs",
  "average_rating": "4.83",
  "url": "https://www.goodreads.com/book/show/34214353-dead-of-winter"
}