{
  "title": "Jane Boleyn: The True Story of the Infamous Lady Rochford",
  "description": "In a life of extraordinary drama, Jane Boleyn was catapulted from relative obscurity to the inner circle of King Henry VIII. As powerful men and women around her became victims of Henry’s ruthless and absolute power, including her own husband and sister-in-law, Queen Anne Boleyn, Jane’s allegiance to the volatile monarchy was sustained and rewarded. But the price for her loyalty would eventually be her undoing and the ruination of her name. For centuries, little beyond rumor and scandal has been associated with “the infamous Lady Rochford.” But now historian Julia Fox sets the record straight and restores dignity to this much-maligned figure whose life and reputation were taken from her.Born to aristocratic parents in the English countryside, young Jane Parker found a suitable match in George Boleyn, brother to Anne, the woman who would eventually be the touchstone of England’s greatest political and religious crisis. Once settled in the bustling, spectacular court of Henry VIII as the wife of a nobleman, Jane was privy to the regal festivities of masques and jousts, royal births and funerals, and she played an intimate part in the drama and gossip that swirled around the king’s court. But it was Anne Boleyn’s descent from palace to prison that first thrust Jane into the spotlight. Impatient with Anne’s inability to produce a male heir, King Henry accused the queen of treason and adultery with a multitude of men, including her own brother, George. Jane was among those interrogated in the scandal, and following two swift strokes from the executioner’s blade, she lost her husband and her sister-in-law, her inheritance and her place in court society.Now the thirty-year-old widow of a traitor, Jane had to ensure her survival and protect her own interests by securing land and income. With sheer determination, she navigated her way back into royal favor by becoming lady-in-waiting to Henry’s three subsequent brides, Jane Seymour, Anne of Cleves, and Catherine Howard. At last Jane’s future seemed secure–until an unwitting misstep involving the sexual intrigues of young Queen Catherine destroyed the life and reputation Jane worked so hard to rebuild.Drawing upon her own deep knowledge and years of original research, Julia Fox brings us into the inner sanctum of court life, laced with intrigue and encumbered by disgrace. Through the eyes and ears of Jane Boleyn, we witness the myriad players of the stormy Tudor period. Jane emerges as a courageous spirit, a modern woman forced by circumstances to fend for herself in a privileged but vicious world.",
  "genres": [
    "History",
    "Nonfiction",
    "Biography",
    "Tudor Period",
    "Historical",
    "British Literature",
    "Audiobook"
  ],
  "author": "Julia  Fox",
  "average_rating": "3.72",
  "url": "https://www.goodreads.com/book/show/1206219.Jane_Boleyn"
}