{
  "title": "Courage",
  "description": "True love. The terror of war. Rejection. Separation. Reconciliation. COURAGE.France, 1790, and a nation is on the brink of destruction, a not so innocent flirtation at a glamorous ball, a Frenchwoman destined for the guillotine, and a British naval captain who has loved and lost her - these are the ingredients of , Courage, Robert Carter’s epic tale of love and war. Add to these the machinations of a shadowy Brotherhood which is shaping the future of the world, and we have a story to rival the work of Patrick O’Brian.Full of intrigue, drama and adventure, larger-than-life passions and the clash or war, Courage is set against the bloody background of the French Revolution as Napoleon Bonaparte prepares to stride out onto the stage of history. Captain Sidney Smith, a naval captain, falls in love with a young French aristocrat, but when her family is overwhelmed by the Revolution he must make a choice. Courage tells the tale of a man and woman whose indelible memories of a forbidden romance sustains them through the terrors of war, and whose faith in one another finally overcomes all. Captain Sidney Smith and Berenice de Sainte Honorine du Fay, niece of the Duc d’Harcourt are besotted by one another in an instant that can only be called “love at first sight.” She throws all caution to the winds, but then is told that the charismatic young captain took her to bed on a wager. She is appalled. She has been taken for a fool. In truth, he has fallen for her and is intent on resolving the misunderstanding , but their two countries are heading into war and duty calls him away. Meanwhile, the revolution has begun, a mob is roaming through the countryside and Berenice, her sister and mother are trapped and must try to flee ...Lovers of romance, adventure and drama will enjoy this historically accurate and well-researched depiction of a family’s attempts to survive a time of raging violence.",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Historical"
  ],
  "author": "Robert    Carter",
  "average_rating": "3.78",
  "url": "https://www.goodreads.com/book/show/3422146-courage"
}