{
  "title": "Crossing the Line",
  "description": "Clinton McKinzie writes powerhouse thrillers that are like nothing you’ve ever read— novels that crackle with raw emotion and brilliantly explore the nature of the risk that lovers take, adventurers seek, and men and women live with on both sides of the law. In an unforgettable new novel, set against the breathtaking Rocky Mountain landscape he has made his own, the acclaimed author of Trial by Ice and Fire brings back Special Agent Antonio Burns and his renegade brother, Roberto—two men who have chosen very different lives, now coming together to make a treacherous descent into a world of loss, betrayal, and terror.Antonio Burns is a cop, not a saint. Having earned the scornful nickname “QuickDraw” for a shooting that went very wrong, the Wyoming narcotics agent is fighting for redemption and holding on to his family with all the strength he possesses. His brother, Roberto, is another story. His quicksilver heart, hair-trigger temper, and unquenchable hunger for adrenaline rushes have landed him prison—and make him the right person for an FBI agent with a plan. Agent Mary Chang—cool, collected, and always under control—wants to go after Hidalgo, a murderous drug lord who has moved his operation from Mexico to a Wyoming canyon. In Roberto, Chang has found someone who can penetrate Hildago’s heavily guarded crime ranch. And she has found a man who can quickly take her to her own wild side.Now, while Mary and his brother watch over him, Roberto goes to work for Hidalgo for the promise of a free pass from prison. But Roberto can’t stay withany script for long, and soon starts making up the game as he goes along. With Antonio sure that his brother is taking the ultimate death trip, and Chang guarding a secret of her own, the perfect plan starts to veer wildly off course. And no one is prepared for the dark forces that are about to engulf them—or the final betrayal that will send them to the dizzying heights and abysmal depths of love and loss. A novel that plunges like a knife, Crossing the Line is vintage brilliant, breathless, and utterly impossible to put down.",
  "genres": [],
  "author": "Clinton McKinzie",
  "average_rating": "4.03",
  "url": "https://www.goodreads.com/book/show/342238.Crossing_the_Line"
}