{
  "title": "Badwater",
  "description": "From The Edge of Justice to Crossing the Line, Clinton McKinzie has captivated readers with thrillers that combine heart-pounding action with searing human drama–and feature a truly unforgettable hero, Special Agent Antonio Burns. Now McKinzie delivers a new novel filled with his trademarks–the thrill of danger, the clash between the law and the lawless, and the struggles of a family bound by love, loyalty, and a hunger for adventure. Here McKinzie takes us to a stark Wyoming landscape, where one tragic moment plunges Antonio Burns into a whirlpool of hate, violence, and revenge.BadwaterAntonio Burns is at a crossroads–he rarely sees his six-month-old daughter, and his career has spiraled downward from hotshot golden boy to nearly having his badge confiscated. And things are about to get even worse. When a ten-year-old boy dies in a drowning incident in Badwater, Wyoming, the townspeople want the tourist they feel is responsible convicted of murder. In an already explosive case, Burns has been forced into working for the prosecution–and when a media-hungry celebrity lawyer takes over the defense, justice turns into a charade.Clinging to his sanity by climbing the crags and caverns of a local canyon, recovering from the near death of his daredevil brother and his breakup with the mother of his child, Antonio tries to turn his back on this situation. But he can’t. He finds one crucial piece of evidence, makes one mistake with a woman, and then turns to his brother, Roberto, for help. Soon he’s all the way in–no matter what the cost to his career, his life, or to the people who still count him as one of their own.…The spellbinding story of a cop drawn to danger, a community steeped in hatred, and an explosive mix of opportunists, idealists, and a few very bad men, Badwater is a taut, thunderous novel–and Clinton McKinzie at his electrifying best.",
  "genres": [
    "Fiction",
    "Mystery"
  ],
  "author": "Clinton McKinzie",
  "average_rating": "4.14",
  "url": "https://www.goodreads.com/book/show/342236.Badwater"
}