{
  "title": "Bound: A Gay BDSM Anthology",
  "description": "This anthology features three sexy, hardcore BDSM novellas:  Hurt Me  Thomas signs up for a sexual practices study at his university to help pay the bills, only to find the grad student leading the study is none other than his long lost love, Elliot Tucker. The study involves whips, bondage and levels of pain and pleasure Thomas never imagined he’d enjoy – but every lesson leaves him longing for more.  As old feelings surface, Thomas struggles to break down the walls Elliot built around himself. However, Elliot’s thesis is on the line, and the closer he gets to Thomas the less he’s able to control his dominant urges.  But Thomas isn’t backing down –- not until the two men take a second chance at first love.  Safeword  When a mysterious stranger offers Hiro a chance to get clean and off the streets, he takes it without hesitation. Maxwell, his savior, introduces him into the world of BDSM – and Hiro relishes in the pain, pleasure and control – delighting in his newfound role of sub to the sexy and powerful man.  But Maxwell’s hiding a secret – a dead boyfriend that overshadows their budding relationship. Can both Dom and sub heal the wounds from their pasts and forge a future together?  Sin for Me  Brother Pío has spent his entire life in a secluded Spanish monastery where he hides a fearful secret. Not only is he attracted to men, he also finds pleasure in pain. Instead of offering a path to sanctity, the thongs of his whip drive him into a flurry of lustful thoughts and desires.  When Brother Matthew, a monk and traveling scholar, arrives he turns Pío’s world upside down. The man gives Pío the pain and release he needs, but at what cost? As Matthew helps Pío come to terms with his conflicted feelings, their relationship gives way to danger when the other monks grow suspicious.  However, Matthew can’t remain in Son Rullan forever forcing Pío to choose where his loyalties lie: with the Church or with his lover?  Each novella contains graphic gay BDSM sex scenes.",
  "genres": [
    "BDSM"
  ],
  "author": "Zoe Perdita",
  "average_rating": "3.82",
  "url": "https://www.goodreads.com/book/show/34238261-bound"
}