{
  "title": "Common Sense and Whiskey: Travel Adventures Far from Home",
  "description": "It's all Adventures in Africa, Azerbaijan and the Arctic. Headhunters and prayer flags, liars and thieves, evil spirits and atrocious food. From Tbilisi to Tibet to the Trans-Siberian Railroad, Common Sense and Whiskey is a crisp survey of what's it's like in the real world. Offbeat people and isolated places lie at this book's heart. Common Sense and Whiskey pokes into the back corners of our planet. It takes us into the unknown and describes what the unknown looks like.\"You can handle just about anything out on the road with a believable grin, common sense and whiskey.\" That's been the author's theory, anyway, for 25 years of international travel. So far, so good. And now, Common Sense and Whiskey distills (no pun there, certainly) the most memorable experiences of a lifetime of travel to some of the world's least visited places.Fifteen stories from Bhutan, Borneo, Burma, Greenland, Guangxi, Lake Baikal, Madagascar, Malawi, Papua New Guinea, Paraguay, Chilean Patagonia, the Southern Caucasus, the Trans-Siberian Railroad, Sri Lanka and Tibet.For travelers - experienced, aspiring and armchair alike, Common Sense and Whiskey is something to sip slowly and savor. Perceptive travel tales, masterfully told.•••••\"You leave home with a blank page. You return with stories of your own to share. This is what Bill Murray does so well. Rich and inspiring. Filled with surprises and great adventures.\"- George Brown, President, Friendship Force International\"A good travel writer shows rather than tells and Bill shows us beautifully with unassuming prose and evocative images. Brings home the exoticism of foreign travel. A fantastic collection.\"- Laurence Mitchell, author, the Bradt Guides to Serbia and Kyrgyzstan\"Wonderful insight into the world of 'traveling off the beaten path, road, waterway or train track.'\"- Josh Allen at AmateurTraveler.com",
  "genres": [
    "Travel"
  ],
  "author": "Bill  Murray",
  "average_rating": "3.69",
  "url": "https://www.goodreads.com/book/show/12064548-common-sense-and-whiskey"
}