{
  "title": "The Girl in the Green Glass Mirror",
  "description": "Hailed for her “remarkably accomplished and poignant work” (Washington Post), acclaimed author Elizabeth McGregor returns with a haunting love story about two lost souls brought together by chance—and bonded forever by a mystery that transcends madness, tragedy, and time itself....Catherine Sergeant is adept at going through the motions. After losing her parents at an early age, she buried her grief in the study of antiquities. Now, deserted by her husband without warning or explanation, she reports to work at Pearson’s auction house, exchanging pleasantries with colleagues, never revealing her pain. Cocooned in loneliness, she couldn’t be more surprised to find herself opening up to a total stranger—a new client, no less.In widowed architect John Brigham, Catherine finds a kindred spirit. The two share a fascination with Richard Dadd, an early Victorian painter who lived most of his life incarcerated in an insane asylum. There he produced his most stunning works—works that have deeply moved Catherine and now draw her inexorablyto John. Soon the two are falling in love.The reawakening of passion in a woman like Catherine is more than John ever hoped for. But when she discovers his possession of an unknown Dadd, it is just the first in a series of revelations that leave her wondering if she knows this man who has shown her life’s true beauty. For John, it may be a last chance to free himself from the priceless secrets he has been harboring too long. Secrets about a soul laid bare on canvas, and a legacy that could shatter all he holds dear in the space of a heartbeat…A compelling blend of human drama, art, and history, this intriguing tale casts a spell that lingers far beyond the final page—and celebrates the strength we all must find within our hearts.From the Hardcover edition.",
  "genres": [
    "Art",
    "Fiction",
    "Fantasy",
    "Historical Fiction"
  ],
  "author": "Elizabeth   McGregor",
  "average_rating": "3.33",
  "url": "https://www.goodreads.com/book/show/34252.The_Girl_in_the_Green_Glass_Mirror"
}