{
  "title": "Lady Chatterley's Lover",
  "description": "Lady Chatterley's Lover is a novel by D. H. Lawrence, first published privately in 1928 in Italy, and in 1929 in France and Australia.[1] An unexpurgated edition was not published openly in the United Kingdom until 1960, when it was the subject of a watershed obscenity trial against the publisher Penguin Books. Penguin won the case, and quickly sold 3 million copies.[1] The book soon became notorious for its story of the physical (and emotional) relationship between a working class man and an upper class woman, its explicit descriptions of sex, and its use of then-unprintable words.  The story is said to have originated from events in Lawrence's own unhappy domestic life, and he took inspiration for the settings of the book from Eastwood, Nottinghamshire, where he grew up. According to some critics, the fling of Lady Ottoline Morrell with \"Tiger\", a young stonemason who came to carve plinths for her garden statues, also influenced the story...  Summary : The story concerns a young married woman, the former Constance Reid (Lady Chatterley), whose upper class husband, Sir Clifford Chatterley, described as a handsome, well-built man, has been paralysed from the waist down due to a Great War injury. In addition to Clifford's physical limitations, his emotional neglect of Constance forces distance between the couple. Her sexual frustration leads her into an affair with the gamekeeper, Oliver Mellors, the novel's title character. The class difference between the couple highlights a major motif of the novel which is the unfair dominance of intellectuals over the working class. The novel is about Constance's realization that she cannot live with the mind alone; she must also be alive physically. This realization stems from a heightened sexual experience Constance has only felt with Mellors, suggesting that love can only happen with the element of the body, not the mind...  Extrait : This was in 1920. They returned, Clifford and Constance, to his home, Wragby Hall, the family ‘seat’. His father had died, Clifford was now a baronet, Sir Clifford, and Constance was Lady Chatterley. They came to start housekeeping and married life in the rather forlorn home of the Chatterleys on a rather inadequate income. Clifford had a sister, but she had departed. Otherwise there were no near relatives. The elder brother was dead in the war. Crippled for ever, knowing he could never have any children, Clifford came home to the smoky Midlands to keep the Chatterley name alive while he could.  He was not really downcast. He could wheel himself about in a wheeled chair, and he had a bath-chair with a small motor attachment, so he could drive himself slowly round the garden and into the line melancholy park, of which he was really so proud, though he pretended to be flippant about it.  Having suffered so much, the capacity for suffering had to some extent left him. He remained strange and bright and cheerful, almost, one might say, chirpy, with his ruddy, healthy-looking face, arid his pale-blue, challenging bright eyes. His shoulders were broad and strong, his hands were very strong...  Biography : David Herbert Richards \"D. H.\" Lawrence (11 September 1885 – 2 March 1930) was an English novelist, poet, playwright, essayist, literary critic and painter. His collected works represent, among other things, an extended reflection upon the dehumanising effects of modernity and industrialisation. Some of the issues Lawrence explores are emotional health, vitality, spontaneity and instinct.  Lawrence's opinions earned him many enemies and he endured official persecution, censorship, and misrepresentation of his creative work throughout the second half of his life, much of which he spent in a voluntary exile which he called his \"savage pilgrimage\"...",
  "genres": [
    "Fiction",
    "Romance",
    "Classics",
    "Literature",
    "Banned Books",
    "Historical Fiction",
    "Novels"
  ],
  "author": "D.H. Lawrence",
  "average_rating": "3.50",
  "url": "https://www.goodreads.com/book/show/34230427-lady-chatterley-s-lover"
}