{
  "title": "The Ten Grandmothers: Epic of the Kiowas (Volume 26)",
  "description": "“Once in a blue moon (which means a fairly long cycle in my case) one who deals professionally with new books comes upon something that seems to him truly noteworthy and memorable-a reading experience which he will cherish for the rest of his life. And when this book is original and, indeed, unique-when it achieves something that has never been done before-one's impulse is to rent a billboard, to hire a hall, in some way to underline and emphasize the excitement and enthusiasm of his discovery, so that other readers may share his pleasure.\"This has been my experience with The Ten Grandmothers, by Alice Marriott. It was the custom of certain tribes of Indians of the Great Plains to keep a 'winter count,' or calendar, of important events. Each year an officially designated scribe or historian of the tribe inscribed on a specially selected and prepared buffalo hide (which was a sacred tribal possession) a colored pictograph commemorating the most noteworthy event of the year-the happening or circumstance for which the year would be remembered in the oral literature and traditions of the tribe.\"Miss Marriott's book is based upon such a tribal history of the Kiowas, an important and tenacious nation of the southern Great Plains, for more than a hundred years. She has taken representative incidents from this story and built each into a unified narrative of personal experience, concrete and dramatic. The thirty-three narratives fall into four groups reflecting the major phases of Kiowa history in the last century; they are called, since Kiowa .economy was based on the buffalo, The Time When There Were Plenty of Buffalo; The Time When Buffalo Were Going; The Time When Buffalo Were Gone; and Modern Times. Since the same characters appear recurringly, the book has the effect of a loosely constructed novel.\"Miss Marriott is an ethnologist. Her book is based on eight years of work with the Kiowas–work that certainly consisted of much more than superficial interviews with aged Indians. There is evidence everywhere, not only of accurate scientific knowledge of the material to be presented, but of profound human insight and understanding.\"Miss Marriott is also a creative artist of extraordinary powers. Her book has abundant humor, drama and melodrama, beauty and sordidness, pathos and tragedy: all presented sharply, objectively, with economy, restraint, and dignity. The narrative of the long journey of Wooden Lance, to see for himself and for his tribe whether the leader of the Ghost Dance movement (that inspired the last desperate, irrational struggle of the plains Indians against the whites) had 'true power is unforgettable in its simplicity and reality. The story of the Kiowa girl Leah's return from her years at a boarding school in the East to her family on the reservation is as true and socially significant as it is poignant and dramatic.\"The great achievement of Miss Marriott's book is that it makes accessible to the reader of today the essence of a culture, a way of life and thought, now almost vanished from the earth.\"We have an uneasy feeling that some special meaning and value for Americans of today and tomorrow must lie in the older cultures of our continent which our own has so largely displaced. American writers from Longfellow on have tried with varying degrees of success to capture that meaning for us.\"Miss Marriott's book shows that our feeling was justified. No discerning reader will fail to find in the men and women who are so vivid in its pages-Sitting Bear and Eagle Plume, old Quanah and Spear Woman, and the Kiowa boys riding in their jeep to enlist for the present World War-in their vision and knowledge of life and their essential experience, abundant meaning for today.\"",
  "genres": [
    "Nonfiction",
    "History",
    "Historical",
    "Anthropology"
  ],
  "author": "Alice Marriott",
  "average_rating": "4.42",
  "url": "https://www.goodreads.com/book/show/1206439.The_Ten_Grandmothers"
}