{
  "title": "No Angel: My Harrowing Undercover Journey to the Inner Circle of the Hells Angels",
  "description": "Here, from Jay Dobyns, the first federal agent to infiltrate the inner circle of the outlaw Hells Angels Motorcycle Club, is the inside story of the twenty-one-month operation that almost cost him his family, his sanity, and his life.Getting shot in the chest as a rookie agent, bartering for machine guns, throttling down the highway at 100 mph, and responding to a full-scale, bloody riot between the Hells Angels and their rivals, the Mongols–these are just a few of the high-adrenaline experiences Dobyns recounts in this action-packed, hard-to-imagine-but-true story.Dobyns leaves no stone of his harrowing journey unturned. At runs and clubhouses, between rides and riots, Dobyns befriends bad-ass bikers, meth-fueled “old ladies,” gun fetishists, psycho-killer ex-cons, and even some of the “Filthy Few”–the elite of the Hells Angels who’ve committed extreme violence on behalf of their club. Eventually, at parties staged behind heavily armed security, he meets legendary club members such as Chuck Zito, Johnny Angel, and the godfather of all bikers, Ralph “Sonny” Barger. To blend in with them, he gets full-arm ink; to win their respect, he vows to prove himself a stone-cold killer.Hardest of all is leading a double life, which has him torn between his devotion to his wife and children, and his pledge to become the first federal agent ever to be “fully patched” into the Angels’ near-impregnable ranks. His act is so convincing that he comes within a hairsbreadth of losing himself. Eventually, he realizes that just as he’s been infiltrating the Hells Angels, they’ve been infiltrating him. And just as they’re not all bad, he’s not all good.Reminiscent of Donnie Brasco’s uncovering of the true Mafia, this is an eye-opening portrait of the world of bikers–the most in-depth since Hunter Thompson’s seminal work–one that fully describes the seductive lure criminal camaraderie has for men who would otherwise be powerless outsiders. Here is all the nihilism, hate, and intimidation, but also the freedom–and, yes, brotherhood–of the only truly American form of organized crime.",
  "genres": [
    "Nonfiction",
    "True Crime",
    "Crime",
    "Biography",
    "Memoir",
    "Autobiography",
    "Audiobook"
  ],
  "author": "Jay Dobyns",
  "average_rating": "3.84",
  "url": "https://www.goodreads.com/book/show/3425474-no-angel"
}