{
  "title": "God Send Me My Husband!",
  "description": "“God Send Me My Husband” - Brought To You By Best-Selling Author Sherylynne L. Rochester, Comes A Cautionary Christian Tale That Will Sweep You Away!Are you a devout young Christian single that feels the right person might never come for you?Are you thinking of just letting go and settling with someone that doesn’t feel right for your life?Do you fear that maybe God has forgotten you and left you alone with no hope?Get this amazing, enticing book by Sherylynne L. Rochester and let it remind you of what you may be forgetting; that He always has the best in store for us and all He asks for is simply our patience and faith – otherwise we may have to face the repercussions of dangerous and destructive relationships that lurk just around the corner!Follow A Christian Woman’s Story As She Learns The Dangers of Desperation!Meet Laila, a woman of true values and Christian ethics that struggles between her fear that she may never find the right man to share her life with and her prayer to God to bring him in her path. What can happen if she lets herself stray from His loving embrace? What can happen if she allows desperation to overtake her?Let her guide you through her inner thoughts, doubts, and fears as she finally meets her one and only – or is she letting herself believe that she does? In the end, is he her way to pure romantic bliss or a really great disguise for a pathway leading somewhere else? Share the message she tries to convey. Strengthen your faith in the One who knows who the right one is for you and when it is the right time for you to meet the love of your life – even though it may feel like it takes a long time for marriage to come. By Best-Selling Author of “Altered Destiny; A Hustler’s Choice”, Sherylynne L. Rochester!With amazing details, beautiful descriptions and exquisite emotional sharing, Sherylynne Rochester guides you through a brilliant story, answers your questions, shares testimonies, addresses your fears and soothes your soul by reminding you the simplest of truths; God who loves you is writing your love story – just have faith and don’t risk your soul’s integrity due to some moments of weakness; because some choices have irreversible results.Don’t Wait Any Longer!Place Your Order Now For This Exquisite Story Of God’s Love, Protection, & Redemption!FREE GIFT INSIDE BOOK!",
  "genres": [
    "Christian"
  ],
  "author": "Sherylynne L. Rochester",
  "average_rating": "4.38",
  "url": "https://www.goodreads.com/book/show/34267132-god-send-me-my-husband"
}