{
  "title": "Cloud of Sparrows",
  "description": "It is the dawn of the New Year, 1861. After two centuries of isolation, Japan has been forced to open its doors to the West, igniting a clash of cultures and generations. And as foreign ships threaten to rain destruction on the Shogun’s castle in Edo, a small group of American missionaries has chosen this time to spread the word of their God. Among them, Emily Gibson, a woman seeking redemption from a tormented past, and Matthew Stark, a cold-eyed killer with one more death on his mind. Neither realizes that their future in Japan has already been foreseen. For a young nobleman, Lord Genji, has dreamt that his life will be saved by an outsider in the New Year. Widely reviled as a dilettante, Lord Genji has one weapon with which to inspire awe. In his family, one in every generation is said to have the gift of prophecy. And what Lord Genji sees has struck fear in many around him. As the Shogun’s secret police chief plots Genji’s death--and the utter destruction of his entire clan--the young and untried lord must prove that he is more than the handsome womanizer of legend, famed lover of Edo’s most celebrated geisha, Lady Heiko, and that his prophetic powers are no mere fairy tale. Forced to escape from Edo and flee to his ancestral stronghold, the spectacular Cloud of Sparrows Castle, Genji joins his fate with Emily and Stark, unaware of the dark forces that drive them. Together with Genji’s uncle, Lord Shigeru, a legendary swordsman knee-deep in the blood of his own kin, and the enigmatic Lady Heiko, the unlikely band embarks on a harrowing journey through a landscape bristling with danger--to prepare for a final battle.Here, on a snowscape stained with blood, horror will mix with wonder, secrets will unravel, and love will duel with vengeance--as East and West, flesh and spirit, past and future, collide in ways no one--least of all Genji--could have imagined.",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Japan",
    "Fantasy",
    "Historical",
    "Japanese Literature",
    "Novels"
  ],
  "author": "Takashi Matsuoka",
  "average_rating": "4.03",
  "url": "https://www.goodreads.com/book/show/1206461.Cloud_of_Sparrows"
}