{
  "title": "It's All Too Much: An Easy Plan for Living a Richer Life with Less Stuff",
  "description": "When you think of what it will take to clean your house, are you so overwhelmed you throw up your hands and cry \"It's all too much\"? Do you dream of having a closet where your clothes aren't crammed in so tightly that you can actually get to them? Is your basement filled with boxes of precious family mementos you haven't opened in ten years but are too afraid to toss? Are your kitchen counters overrun with appliances you've never used? Do your kids play in the living room because there's no room left in their playroom? If somewhere along the way you've simply lost the ability to keep your home organized and clutter-free, then It's All Too Much has the solution you've been searching for.Peter Walsh, the organizational guru from TLC's hit show Clean Sweep, understands how easy it is for clutter to creep into your life and how hard it is to get rid of it. In It's All Too Much, he shares his proven system for letting go of your emotional and physical clutter so that you can create a happier, more stress-free home and life. At last, here is a system for managing your clutter, regaining control, and living the life you imagine for yourself.Peter has helped clients from every walk of life. With his trademark humor and insight, Peter guides you step-by-step through the very charged process of decluttering your home, organizing your possessions, and reclaiming your life. Going way beyond color-coded boxes and storage bin solutions, It's All Too Much shows you how to reexamine your priorities and let go of the things that are weighing you down. Clearly and simply, Peter gives you the courage you need to go through your home, room by room -- even possession by possession -- and honestly assess what adds to your quality of life and what's keeping you from living the life of your dreams.Filled with real-life examples and advice for homes of all sizes and personalities, It's All Too Much will set you free from the emotional baggage that goes along with clutter and help you lead a fuller, richer life with less stuff.",
  "genres": [
    "Nonfiction",
    "Self Help",
    "Personal Development",
    "Audiobook",
    "Psychology",
    "Productivity",
    "How To"
  ],
  "author": "Peter Walsh",
  "average_rating": "3.80",
  "url": "https://www.goodreads.com/book/show/34266.It_s_All_Too_Much"
}