{
  "title": "Charlie Wilson's War",
  "description": "It's common knowledge that the U.S. armed the Afghans in their fight against the Soviet Union, but until now, the fact that this was possibly the biggest, meanest covert operation in history has been absent from press reports. In one of the most detailed descriptions of a CIA operation every written, the bizarre twists and turns of the full story are told in CHARLIE WILSON'S WAR. Veteran 60 Minutes producer George Crile explains how one Congressman was able to provide the CIA with hundreds of millions of dollars to fund the Afghan program, dwarfing the price tag for arming the Nicaraguan Contras that occurred at virtually the same time.\"The scope and nature of this campaign has still not registered in the consciousness of most Americans,\" Crile writes in the book's Epilogue. \"Nor is it understood that such secret undertakings inevitably have unforeseen and unintended consequences which, in this case, remain largely ignored.\"When Crile produced his first story about Texas Congressman Charlie Wilson for 60 Minutes in 1989, he too underestimated the vastness of the program and its consequences. It was a later trip to the Arab world with Wilson, the Wilson's \"princely\" reception, and the events of 9/11 that opened his eyes to the far bigger picture of CHARLIE WILSON'S WAR.Among the book's more startling revelations:• By the latter years of the 1980s the CIA was not just providing arms to a half million Afghans, it had taken 150,000 of them and transformed them into what it called a force of \"techno holy warriors.\" \"From today's perspective,\" Crile observes, \"that may seem more than a bit ill advised-particularly when you factor in the specialized training in urban warfare that the Agency sponsored to include the use of pipe bombs, bicycle bombs, car bombs, camel bombs, along with a host of other tactics to wreak havoc with the army of a modern superpower.\"• The United States continued to fund the Afghan rebels long after the withdrawal of the Soviet Union. Incredibly, the subsidies continued despite the fact that one of the most important mujahid leaders sided with Saddam Hussein in the Gulf War.• In addition to $200 million in aid from the U.S. and $200 million from Saudi Arabia, in 1991 and 1992 the rebels received Iraqi weapons captured by U.S. forces during the Gulf War. At the same time, the Berlin Wall came down and the Soviet Union ceased to exist. The Cold War was effectively over but what began as a war against Communism was continuing to be funded.\"The question that has puzzled so many Americans: 'Why do they hate us?' is not so difficult to understand if you put yourself into the shoes of the Afghan veterans in the aftermath of the Soviet departure,\" Crile says. To them, the real superpower in their struggle was Allah. The United States eventually cut off its support in the 1990s. In the Afghan's minds, Allah did not.CHARLIE WILSON'S WAR is nothing short of a critical missing chapter in our political consciousness. Without a clear understanding of its impact, it may be impossible to comprehend the two world changing events that shook the United States on either side of the millennium: the sudden and mysterious collapse of the Soviet Union and the equally inexplicable appearance of a new global foe in the form of militant Islam. At its core, it tells of an unorthodox alliance-of a scandal-prone Texas Congressman named Charlie Wilson and an out-of-favor CIA operative named Gust Avrakotos-that armed and sustained the Afghan jihad and turned Afghanistan into the Soviet Union's Vietnam.\"The origins of this book go back to a time when the Afghans were viewed by most everyone in the U.S. government as freedom fighters and allies against a common foe,\" Crile writes in the Epilogue. In 1988, Crile produced a 60 Minutes profile of Wilson that he now realizes barely scratched the surface of this fascinating story. Later, while, accompanying Wilson on a trip to Kuwait, Iraq, Saudi Arabia, Pakistan and Afghanistan just prior to the first Gulf War, Crile was amazed at the \"princely\" reception accorded Wilson in the Arab world. \"The trip was just the beginning of a decade-long odyssey uncovering the many dimensions of the CIA's Afghan War,\" he recalls. \"In short order I realized that it had been anything but a typical CIA program.\"As incredible as anything in the pages of Tom Clancy or John le Carré, CHARLIE WILSON'S WAR is a gripping story of international intrigue, booze, drugs, sex, high society and arms deals. Between its covers, we meet:• The charismatic Congressman Charlie Wilson. While Ronald Reagan and William Casey were unable to persuade Congress to fund the Nicaraguan Contras, Wilson was procuring hundreds of millions of dollars to support his Afghan \"freedom fighters\" through back-room machinations that would have made even LBJ blush. A colorful man of many contradictions, he worked hard and played hard, earning the reputation as the \"wildest man in Congreeeeeess\" while representing an archconservative Bible-belt district in Texas.• The out-of-favor CIA operative, Gust Avrakotos, whose working-class Greek-American background made him an anomaly in the patrician world of American spies. Nicknamed \"Dr. Dirty\", this blue collar James Bond was an aggressive agent who served on the front lines of the Cold War where he learned how to stretch the Agency's rules to the breaking point.• The eccentric staff of CIA outcasts hand-picked by Avrakotos to run the operation. Among them were \"Hilly Billy\", the logistics wizard who could open an un-numbered Swiss bank account for the U.S. government in 12 hours when others took months; Art Alper, the \"devilish\" tinkerer from the Technical Services division who roamed the world creating such novelties as exploding typewriters and developed portable amplifiers that spread propaganda among the Soviet troops; and especially Mike Vickers, the former Green Beret so junior in status that he couldn't send his own cables. His military genius allowed him to single-handedly redesign the CIA's war plan. Through his highly specific blueprint, he created a systematic plan that turned a rabble of shepherds and tribesmen into an army of techno Holy warriors who gave the legendary Red Army their greatest defeat. Today, Mike Vickers is consulting for the Pentagon on the War on Terrorism and war planning for Iraq.The many women who shared the Congressman's jihad. It all began with a Houston socialite, Joanne Herring who enlisted Wilson to the Afghan cause via her deep-seated hatred of Communism and her influence in Pakistan. Carol Shannon, Wilson's personal belly dancer who he took with him to the jihad. Charlie's Angels, Wilson's female staffers so strikingly beautiful that they became a legend on Capitol Hill. And finally, Annelise Illschenko, aka \"Sweetums\", the former U.S. representative in the Miss World competition who traveled with Wilson deep into the Islamic world in outfits that were not the most appropriate attire in the eyes of Muslim men• The Pakistani dictator Zia ul Haq, who early on realized that the way to millions of dollars in American aid was through Charlie Wilson and his covert war in Afghanistan. A dictator whom many held personally responsible for the execution of his democratically elected predecessor, Zia used his favorable status as an ally of the U.S. against the Soviets to divert attention from his own nuclear weapons program while providing the all-important safe haven and operations center for the CIA's Afghan operations .CHARLIE WILSON'S WAR is the CIA and Congress as they have never been seen before, engaged in the last great battle of the Cold War. This is a book that has direct implications for today's world situation.",
  "genres": [
    "History",
    "Nonfiction",
    "Politics",
    "War",
    "Biography",
    "Military Fiction",
    "Audiobook"
  ],
  "author": "George Crile",
  "average_rating": "4.01",
  "url": "https://www.goodreads.com/book/show/342557.Charlie_Wilson_s_War"
}