{
  "title": "Flawlessly Imperfect",
  "description": "When Rafael Borrero found his soul mate locked in a cage in the secret backroom of The Omega Auction, Colby DiCastro was everything that Rafe had been searching for: \"a male wolf shifter who’s bigger, frame-wise, than your average Omega. Someone a little tougher, who can stand up for himself...\"  He was also determined, headstrong, almost impossible to control and, now that Colby is due to deliver their first pup, all of the traits that make him perfect for Blood Valley Pack are driving his Alpha to the brink...   “Colby,” Rafe’s voice brooked no further argument. “You can bitch from now until you deliver but we are going. Now.”  “You seriously want me to ride twelve hundred miles in a shopping bag instead of waiting for the doctor?” I stared at Rafe in disbelief. “We’re fine here.”  “No,” he growled back. “What I want is your ass safe at the hospital in Wolfsrudel where Doc can deliver the baby, but you’re so fucking stubborn that you couldn’t give me that!”  “Rafe…”  Rafe looked up from the bag he was haphazardly stuffing my clothes into and stared at me, a suspicious glint in his eyes.  “Why are you so determined to stay here?” His jaw clenched visibly. “Is there something you want to tell me?”  “Huh? Like what?”  “I don’t know, Colby. You tell me.”  “I don’t know what you mean.” I stared at him, completely blindsided.  “Don’t you? First, you took off in direct violation of my instructions. Now, you don’t want to come home even though you may be in danger.” Rafe stopped packing and closed the suitcase much more carefully than necessary. “Was that what the note was supposed to mean? That you didn’t want me to come after you?” He sucked in a breath and his shoulders squared. “Because, if that’s what you want, I’ll respect it.” He took one near-menacing step toward me and brought himself to a stop with obvious effort. “After you deliver ...but the child stays with the pack.”  My heart plummeted into my stomach at the coldness in his voice as I gawked at him.  Fuck. My. Life.  (Gay Paranormal Romance. Graphic Sexual Content HEA)  5% of all proceeds are donated to The Trevor Project; the leading national organization providing crisis intervention and suicide prevention services to lesbian, gay, bisexual, transgender and questioning (LGBTQ) young people ages 13-24.",
  "genres": [
    "M M Romance",
    "Paranormal",
    "Romance",
    "Shapeshifters",
    "Omegaverse",
    "LGBT",
    "Fantasy"
  ],
  "author": "Kian Rhodes",
  "average_rating": "4.05",
  "url": "https://www.goodreads.com/book/show/34304358-flawlessly-imperfect"
}