{
  "title": "Leopard Warrior",
  "description": "A Teaching Memoir That Crosses the Barriers Between WorldsA shaman is one who has learned to move between two worlds: our physical reality and the realm of spirits. For John Lockley, shamanic training also meant learning to cross the immense divide of race and culture in South Africa.As a medic drafted into the South African military in 1990, John Lockley had a powerful dream. \"Even though I am a white man of Irish and English descent, I knew in my bones that I had received my calling to become a sangoma, a traditional South African shaman,\" John writes. \"I felt blessed by the ancient spirit of Africa, and I knew that I had started on a journey filled with magic and danger.\" His path took him from the hills of South Korea, where he trained as a student under Zen Master Su Bong, to the rural African landscape of the Eastern Cape and the world of the sangoma mystic healers, where he found his teacher in the medicine woman called MaMngwevu.In Leopard Warrior, John shares a gripping account of his experiences and the wisdom he learned over years of training. Here he invites you to discover:• Powerful insights into the spiritual tradition of the Xhosa lineage of South Africa—the tribe of Nelson Mandela and Desmond Tutu • Ubuntu—a core concept for recognizing and embracing our deep interconnection with all living things • Ancestor medicine—how we can learn to honor the blood in our veins, the heritage of our soul, and our shared humanity • Recovering our forgotten knowledge about the wisdom of our dreams, the spirits of plants and animals, and the power of the unseen worldIn traditional African healing circles, the leopard represents intuition, instinct, and harmony with nature and the spirit world. As John Lockley writes, \"A leopard warrior is a spiritual soldier who mirrors the natural world and directs their gaze inward to answer the call of their spirit.\" With Leopard Warrior, he brings us an inspiring call to action—showing how we can bridge the barriers that divide us, embrace the gifts of our ancestors, and reclaim our rightful place as compassionate caretakers of our world.",
  "genres": [
    "Spirituality",
    "Nonfiction"
  ],
  "author": "John  Lockley",
  "average_rating": "4.09",
  "url": "https://www.goodreads.com/book/show/34303823-leopard-warrior"
}