{
  "title": "Whispered Secrets",
  "description": "Whipped Cream and Handcuffs Walker Tessa was all set. She was engaged to marry the perfect man. He was rich, great looking, and a doctor. Then, on Valentine's Day, the gift basket came. Filled with handcuffs, naughty toys, and the like. Not long after that the letters started coming. Then the phone calls. Her perfect fiance wasn't looking so perfect any more. A late night breaking and entering convinces her of that when her secret admirer comes to call, and show her just how completely she belongs to him only him body and soul. Silk Scarves and Seduction (Sequel to Whipped Cream and Handcuffs) When Marc's birthday present arrived a silk scarf and black-and-white photographs of a nude woman it only took him a few minutes to figure out to whom that body belonged. After all, he had been in love with Blush Taylor since high school; the girl had driven him crazy with her pranks for years. What Marc couldn't understand was why she was sending these pictures now. She was probably just toying with him again, as usual. It would be too much to hope that she would feel the same attraction that he has for all these years... One of the Guys Jaynie knew that her fiancé had some serious ménage fantasies going on, but she never expected to catch him acting them out. As if that pain isn't enough, he tells her she couldn't be a real woman if she tried. Reeling from the double blow, confidence shattered, Jaynie turns to Brian, her sexy partner at work. One night, she tells him. She wants one night with him, no strings attached. Brian feels plenty of strings and it's as if all of them are pulling him toward Jaynie. She's sexy, she's funny and she haunts his dreams. Memories of that one night keep him awake and he's dying for another taste of her. But Jaynie doesn't seem at all interested. What's a man to do?",
  "genres": [
    "Erotica",
    "Contemporary Romance",
    "Romance",
    "Anthologies",
    "Erotic Romance",
    "Friends To Lovers"
  ],
  "author": "Shiloh Walker",
  "average_rating": "3.65",
  "url": "https://www.goodreads.com/book/show/3427702-whispered-secrets"
}