{
  "title": "Millie's Angel",
  "description": "When her mother abandons her, Millie is left to pick up the pieces and care for her little brother, Ace. Just as she begins to accept her mother's disappearance from their lives, Millie discovers the shocking secrets surrounding her birth; leaving her anguished and torn between her feelings for her father.Through friendships, romantic connections and heartbreak, Millie learns that she is never alone to face the many obstacles life throws her way - for her life becomes centred on the celestial presence of an angel. As Millie becomes a young woman, she learns that in loving herself and directing the train of her thought-world, she holds the key to the Kingdom of Heaven: right here on earth.When her mother contacts her a decade later, Millie visits with her just in time to realise her own angelic gift, when she finds she is not alone in discovering her mother's whereabouts. With evil lurking between the cracks in her family, the appearance of Millie's gift - a phenomenon that will heal and shine brighter than she could ever have imagined - changes her family's perspectives and the direction of their lives forever.Reviewed by Christian Sia for Readers' FavoriteMillie's Angel: Just Imagine by Kim Petersen is a family saga, a story about family secrets, hurts, and the liberating power of love. When Millie comes home and discovers that her mother has been badly hurt, she believes it could be the worst day for her family — she doesn’t know who could do such a thing. But it is when her mother decides to leave that life completely changes for her family. She has to live with a father who has a mysterious, dark pallor shrouding his countenance, take care of her kid brother, and face the challenges of everyday life, of falling in love and getting hurt. But something else is happening as she struggles to make sense out of her life. She develops a connection with an angelic gift that will play a wonderful role in the life of her family. Millie's Angel: Just Imagine is a heartwarming, spiritually rich, and inspirational story that has a lot of realism in it, a story that will uplift and empower readers and remind them to never lose hope when things go wrong. Kim Petersen has crafted a very beautiful story around the growth and journey towards inner freedom of a young girl. It features very compelling themes, including love and friendship, family secrets, the miracle of generously embracing one’s gifts, and the purpose of life. Petersen’s writing flows sweetly — like drippings of honeycomb. The internal conflict created within the protagonist is equally powerful and it helps to pull readers in. This is an exciting story in which the reader will find something of themselves.",
  "genres": [],
  "author": "Kim  Petersen",
  "average_rating": "4.14",
  "url": "https://www.goodreads.com/book/show/34304864-millie-s-angel"
}