{
  "title": "Blessed be me--There is a God",
  "description": "My grandfather on his dying bed asked me to pray every day and he would take care of me. Obviously, since then I have lived up to my promise and he has been my guardian angel. He has saved my life in war, danger and disease 28 times which are part of the information in the book. Additionally, since my wife’s passing I have witnessed 59 angelic encounters in my home. All of this phenomenon has been covered in this book “Blessed be me--There is a God.” One incident in war is as I was up in the rigging of the ship, slipped and fell and was going to smash on the deck. As I was falling all of the sudden there was a rope in my hand which appeared to be glued. I quickly grabbed the rope with both hands and pulled myself to safety. Beyond question my grandfather was falling by my side. One other episode which is outstanding is as In 1956 I came down with polio while living in Upstate, New York. I was moved to the Syracuse University contagious ward where I asked my nurse what treatment was there for polio and her answer was nothing. The next morning I woke up completely paralyzed on my right side and I thought to myself, “I do not want to live as half a man and I will kill myself.” At that moment a female doctor with stethoscope and uniform came in the room, talked to me and checked my paralysis and left the room saying, “You will be all right.” My regular nurse entered and I queried, “What’s the name of that female doctor that was in here?” She answered, “We have no female doctors in this hospital.” Two or three days later, I was cured. With all this background plus the extensive commentary in the book it becomes impossible to refute the idea that we are blessed with a God. I am fortunate in having my grandfather as my guardian angel. I will continue to pray every day for those that I love. For sure there is a God.",
  "genres": [
    "Nonfiction"
  ],
  "author": "Stan Robinson",
  "average_rating": "4.36",
  "url": "https://www.goodreads.com/book/show/34303541-blessed-be-me--there-is-a-god"
}