{
  "title": "The Jew Store",
  "description": "\"For a real bargain, while you're making a living, you should make also a life.\" --Aaron BronsonIn 1920, in small-town America, the ubiquitous dry goods store--suits and coats, shoes and hats, work clothes and school clothes, yard goods and notions--was usually owned by Jews and often referred to as \"the Jew store.\" That's how Stella Suberman's father's store, Bronson's Low-Priced Store, in Concordia, Tennessee, was known locally. The Bronsons were the first Jews to ever live in that tiny town (1920 population: 5,318) of one main street, one bank, one drugstore, one picture show, one feed and seed, one hardware, one barber shop, one beauty parlor, one blacksmith, and many Christian churches. Aaron Bronson moved his family all the way from New York City to that remote corner of northwest Tennessee to prove himself a born salesman--and much more. Told by Aaron's youngest child, The Jew Store is that rare thing--an intimate family story that sheds new light on a piece of American history. Here is One Man's Family with a twist--a Jew, born into poverty in prerevolutionary Russia and orphaned from birth, finds his way to America, finds a trade, finds a wife, and sets out to find his fortune in a place where Jews are unwelcome. With a novelist's sense of scene, suspense, and above all, characterization, Stella Suberman turns the clock back to a time when rural America was more peaceful but no less prejudiced, when educated liberals were suspect, and when the Klan was threatening to outsiders. In that setting, she brings to life her remarkable father, a man whose own brand of success proves that intelligence, empathy, liberality, and decency can build a home anywhere. The Jew Store is a heartwarming--even inspiring--story.",
  "genres": [
    "Memoir",
    "Nonfiction",
    "Jewish",
    "History",
    "Book Club",
    "Biography",
    "Judaism"
  ],
  "author": "Stella Suberman",
  "average_rating": "3.89",
  "url": "https://www.goodreads.com/book/show/343067.The_Jew_Store"
}