{
  "title": "More Than a Game",
  "description": "Step into a future, in which advanced technology creates a virtual world, with superior capabilities that allow players to experience real-world sensations. The popularity of the RPG game Fayroll is growing by the day, attracting millions of users to this alternate reality. What is the secret of Fayroll? What makes it so different from other games? Our protagonist, Harriton Nikiforov is an everyman - a binge drinking, tabloid column reporter who has settled for the humdrum of the everyday, with a job that pays the wages, a neurotic girlfriend who gives him migraines and a boss that gives him constant grief. Tasked with a new assignment, Harriton suddenly finds himself ripped away from his normal routine of Moscow society life, to a journalistic quest of sorts that leads him deep into the realm of the Virtual Gaming World of Fayroll. Given explicit orders to write a series of fluff pieces on the game and its developers, Harriton grudgingly accepts the assignment, but soon finds himself enthralled by the virtual fantasy world and its amazing quests, unpredictable challenges, and nearly endless possibilities. Harriton is reincarnated as a warrior named Hagen and becomes a full participant in the fantasy world, plunging into the exciting world full of action, quests, humor, legendary weapons and ancient secrets. He meets faithful and courageous comrades and outwits those who are trying to hunt him. In this world, the thirst for success and vanity of high-level players in pursuit of legendary objects spills into the real world, where high-stakes bets are made on the success of the virtual characters. Harriton, as Hagen, unwittingly enters into the Fayroll world, where events and decisions that he makes in the virtual space starts to affect his own reality. His unpredictable character, perseverance, and excitement attract the attention of powerful gamers and influential Moscow elite with a vested interest in Fayroll’s outcome. It is not long before he realizes that this fantastic world, (created according to the best canons of cult games, Warcraft and Lineage), conceals many dangers. Can he pass all the tests? Fayroll is more than a novel; it’s a brilliant synergy of fantasy fiction and online gaming. It gives the reader the best of both worlds. The first novel of the 13 part epic series Fayroll, has captivated Russian readers countrywide and was voted the 2014 new fantasy book of the year. Andrey Vasilyev’s masterpiece ‘More Than a Game’ is now available to the English-speaking World. Join us in this breathtaking narrative that takes both its main character and the reader deep into the heart of the Virtual Gaming Universe and explore the Fantasy Series that has captured the imagination of the Slavic world.",
  "genres": [
    "Fantasy",
    "Science Fiction",
    "Fiction",
    "Audiobook",
    "Adventure"
  ],
  "author": "Andrey Vasilyev",
  "average_rating": "3.99",
  "url": "https://www.goodreads.com/book/show/34284052-more-than-a-game"
}