{
  "title": "Avery: The Case Against Steven Avery and What Making a Murderer Gets Wrong",
  "description": "It's time to set the record straight about Steven Avery. The Netflix series Making a Murderer was a runaway hit, with over 19 million US viewers in the first 35 days. The series left many with the opinion that Steven Avery, a man falsely imprisoned for almost 20 years on a previous, unrelated assault charge, had been framed by a corrupt police force and district attorney's office for the murder of a young photographer. Viewers were outraged, and hundreds of thousands demanded a pardon for Avery. The chief villain of the series? Ken Kratz, the special prosecutor who headed the investigation and trial. Kratz's later misdeeds--prescription drug abuse and sexual harassment--only cemented belief in his corruption. This book tells you what Making a Murderer didn't. While indignation at the injustice of his first imprisonment makes it tempting to believe in his innocence,  The Case Against Steven Avery and What Making a Murderer Gets Wrong and the evidence shared inside--examined thoroughly and dispassionately--prove that, in this case, the criminal justice system worked just as it should. With Avery, Ken Kratz puts doubts about Steven Avery's guilt to rest. In this exclu- sive insider's look into the controversial case, Kratz lets the evidence tell the story, sharing details and insights unknown to the public. He reveals the facts Making a Murderer conveniently left out and then candidly addresses the aftermath--openly discussing, for the first time, his own struggle with addiction that led him to lose everything. Avery systematically erases the uncertainties introduced by the Netflix series, confirming, once and for all, that Steven Avery is guilty of the murder of Teresa Halbach.",
  "genres": [
    "True Crime",
    "Nonfiction",
    "Mystery",
    "Crime",
    "Biography Memoir",
    "History",
    "American History"
  ],
  "author": "Ken Kratz",
  "average_rating": "3.15",
  "url": "https://www.goodreads.com/book/show/34283119-avery"
}