{
  "title": "A Blessed Olive Tree: A Spiritual Journey in Twenty Short Stories",
  "description": "A book of short stories to enlighten the Muslim souls of all ages. Simple fables in easy language but with deep underlying morals. Each story comes with a beautiful hand drawn illustration.A Blessed Olive Tree is a series of short stories that will take you on a spiritual journey. It begins by exploring the reason for our existence, and then it moves on to highlight the reasoning behind the five pillars of Islam. After touching upon “Shariah” (the religious law), you will enter the land of “Tariqa” (the mystical path) to explore love, loving, and being loved. You will then come across “Haqiqa” (the truth), and find answers to some of the queries in your mind. You will finally experience the land of “Marifa” (gnosis), and catch a glimpse of the ultimate connection with the Divine. This entire journey is covered in twenty simple short stories.\"A sufi literary masterpiece\"(Muslim revert and author Adam Hafiz, UK)\"Truly a treasure\"(Ayanna, Reviewer on Goodreads, USA)\"A wise book\"(Manar, #7 top reviewer on Goodreads, Iraq)\"perfect for teaching younger readers, and reminder for older readers\"(Khurram Alavi, #10 best reviewer on Goodreads, UK)\"So inspiring for all Muslims and non Muslims.\"(Fatima Haleem, #17 best reviewer on Goodreads, Iraq)\"All short stories are based on Islamic facts and taking roots from Quran\"(Necmi Coban, #45 top reader on Goodreads, Turkey)\"...gave a very deep impact to my heart.It has been long since I felt so at ease with myself and my thoughts changed.\"(Sizarifalina Ali, #30 best reviewer on Goodreads, Malaysia)\"After almost each story I felt warmth in my heart\"(Arezoo Alipanah, #99 top reader on Goodreads, Iran)\"The sequence...oh this is genius.\"(Shabrina Fadhila, Reviewer on Goodreads, Indonesia)\"...each story containing heartfelt lessons of hope, faith, struggle, success and happiness.\"(Phi T. Waani, #83 best reviewer on Goodreads, Pakistan)\"An exceptional read that was\"(Tarik Mahtab, #72 best reviewer on Goodreads, Bangladesh)\"Reading this book feels like reading a fairy tale 1001 nights!\"(Arvia Maharhani, #53 best reviewer on Goodreads, Indonesia)\"Metaphorical stories feeding one's spirit with faith\"(Rabbia Riaz, #39 best reviewer on Goodreads, Pakistan)\"I was taken on a journey which became more enjoyable with each turn of the page.\"(Saima, Reviewer on Goodreads USA)\"...help Muslims and non-Muslims to understand Islam better\"(Aya, #41 best reviewer on Goodreads, Egypt )\"...told in a fun way that doesn't require reading huge volumes of religious texts\"(Hafsa, #17 best reviewer on Goodreads, Kenya)\"...this book came as a ray of sunshine or noor in these devastating times.\"(Nafisa Tarannum, #46 top reviewer on Goodreads Bangladesh)\"This was good, great, interesting, Charmin, magical\"(Abdel Rahman Amin, #75 top reviewer on Goodreads, Egypt)\"This is indeed a metaphorical masterpiece\"(Ain Mc, Reviewer on Goodreads Malaysia)",
  "genres": [
    "Islam",
    "Short Stories",
    "Religion",
    "Nonfiction",
    "Spirituality",
    "Muslims"
  ],
  "author": "Zain Hashmi",
  "average_rating": "3.99",
  "url": "https://www.goodreads.com/book/show/34315419-a-blessed-olive-tree"
}