{
  "title": "Love Another Day",
  "description": "Alternate cover edition of ASIN B06WP6D7QLA man born to protectAfter a major loss, Brody Carter found a home with the London office of McKay-Taggart. A former soldier, he believes his job is to take the bullets and follow orders. He’s happy to take on the job of protecting Dr. Stephanie Gibson while the team uses her clinic in Sierra Leone to bring down an international criminal. What he never expected was that the young doctor would prove to be the woman of his dreams. She’s beautiful, smart, and reckless. Over and over he watches her risk her life to save others. One night of pure passion leads him to realize that he can’t risk his heart again. When the mission ends, Brody walks away, unwilling to lose another person he loves. A woman driven to heal Stephanie’s tragic past taught her to live for today. Everything she’s done in the last fifteen years has been to make up for her mistakes. Offering medical care in war-torn regions gives her the purpose she needs to carry on. When she meets her gorgeous Aussie protector, she knows she’s in too deep, but nothing can stop her from falling head over heels in love. But after one amazing night together, Brody walks away and never looks back. Stephanie is left behind…but not alone. A secret that will change both their livesA year later, Stephanie runs afoul of an evil mercenary who vows to kill her for failing to save his son. She runs to the only people she trusts, Liam and Avery O’Donnell. She hasn’t come alone and her secret will bring her former lover across the world to protect her. From Liberia to Dallas to Australia’s outback, Brody will do whatever it takes to protect Stephanie from the man who wants to kill her, but it might be her own personal demons that could destroy them both. A Masters and Mercenaries Novel by Lexi Blake",
  "genres": [
    "BDSM",
    "Romance",
    "Romantic Suspense",
    "Erotica",
    "Contemporary",
    "Contemporary Romance",
    "Erotic Romance"
  ],
  "author": "Lexi Blake",
  "average_rating": "4.39",
  "url": "https://www.goodreads.com/book/show/34320236-love-another-day"
}