{
  "title": "They Came to a River",
  "description": "This book encircles life on the Columbia River in the state of Washington. It centers around the character Christine Hallowell and her life on the upper Columbia River in Washington State during the apple boom. The first half of the book is about Chris's childhood and adolescence. It focuses on her family life with her parents, two brothers, and little sister. Chris's father is the local pastor, who holds services every week at the schoolhouse. He also runs the ferry on that part of the river, where he transports people back and forth. Many people come into Chris's life, and they all affect her in some way. Life on the river is hard. There are blistering summers and freezing winters. Through it all is the \"merciless river\" itself. At 17 years, Chris marries Nathan Barnes, a young man whose family owns a large apple orchard across the river. They didn't plan to marry that soon, but necessity brings it about, and they are desperately in love. Most of the second half of the book focuses on Chris and Nate's married life, raising their children, their struggle to bring the orchard into bearing, dealing with pests that threaten the crops, irrigation, etc. Then Chris suffers a terrible, heartbreaking loss, but she \"never wavers from her purpose.\" The river has shaped her; she endures. As her father says at the end of the \"There is room in this valley for every man who isn't afraid to spend himself. All my life I have seen them come - the young, the poor, the weak, the strong, the adventurous, the brave, the misfits, the men with fortunes, the men with empty hands. They came to a river, and the river shaped their lives; it showed them the pattern of fulfillment; it was a sign set by God in this wilderness, and they followed it and were content.",
  "genres": [
    "Historical Fiction",
    "Fiction"
  ],
  "author": "Allis McKay",
  "average_rating": "4.59",
  "url": "https://www.goodreads.com/book/show/3431184-they-came-to-a-river"
}