{
  "title": "Service and Style: How the American Department Store Fashioned the Middle Class",
  "description": "Downtown department stores were once the heart and soul of America's pulsing Broadways and Main Streets. With names such as City of Paris, Penn Traffic, The Maze, Maison Blanche, or The Popular, they suggested spheres far beyond mundane shopping. Nicknames reflected the affection customers felt for their favorites, whether Woodie's, Wanny's, Stek's, O.T.'s, Herp's, or Bam's.The history of downtown department stores is as fascinating as their names and as diverse as their merchandise. Their stories encompass many the rise of decorative design, new career paths for women, the growth of consumerism, and the technological ingenuity of escalators and pneumatic tubes. Just as the big stores made up their own small universes, their stories are microcosmic narratives of American culture and society.The big stores were much more than mere businesses. They were local institutions where shoppers could listen to concerts, see fashion shows and art exhibits, learn golf or bridge, pay electric bills, and plan vacations - all while their children played in the store's nursery under the eye of a uniformed nursemaid.From Boston to San Diego and Miami to Seattle, department stores symbolized a city's spirit, wealth, and progressiveness. Situated at busy intersections, they occupied the largest and finest downtown buildings, and their massive corner clocks became popular meeting places. Their locations became the epicenters of commerce, the high point from which downtown property taxes were calculated. Spanning the late 19th century well into the 20th, their peak development mirrors the growth of cities and of industrial America when both were robust and flourishing.The time may be gone when children accompany their mothers downtown for a day of shopping and lunch in the tea room, when monogrammed trucks deliver purchases for free the very same day, and when the personality of a city or town can be read in its big stores. But they are far from forgotten and they still have power to influence how we shop today.Service and Style recreates the days of downtown department stores in their prime, from the 1890s through the 1960s. Exploring in detail the wide range of merchandise they sold, particularly style goods such as clothing and home furnishings, it examines how they displayed, promoted, and sometimes produced goods. It reveals how the stores grew, why they declined, and how they responded to and shaped the society around them.",
  "genres": [
    "History",
    "Nonfiction",
    "Fashion",
    "Business",
    "American History",
    "Research",
    "Economics"
  ],
  "author": "Jan  Whitaker",
  "average_rating": "3.73",
  "url": "https://www.goodreads.com/book/show/343073.Service_and_Style"
}