{
  "title": "Sci-Fi with a Twist",
  "description": "Short science fiction and fantasy stories that, more often than not, end with a surprise or twist you couldn’t see coming. Transport yourself to other lives and other worlds where travel through time and space is a reality and where second chances and the end of the world sometimes cross paths. It’s a detour into the unknown filled with wonder and excitement beyond reality, and yet close enough, to make you second guess yourself.1. So this is the End - An astronaut from the 1960's wakes up in a strange future in a deserted laboratory and falls in love with a beautiful lady astronaut from the future, kept there captive by unknown entities. Can they discover where they are and when? Are they the last remnants of humanity?2. The Robber - An old thief goes back in time to finally obtain his much sought after, big score, only to discover a family secret that could have changed his life altogether.3. The Search for Heaven - Somewhere in outer space in an unknown time, a man named Noah searches for Heaven through a wormhole and finds the unexpected.4. The Fastest Gun Alive - A writer finds himself in his own story as his own wild west character. Can he survive long enough to get back home?5. The Cave - A teenager enters a cave and emerges decades earlier running into his younger father living in the 1980's.6. The End of Time - A group of time travelers saves Abraham Lincoln, but at what cost?7. Angel of Death - A former lawman becomes a pastor of a small church in the old west, but can't outrun his violent past. Will he have to take up his guns again or will he get a hand from above?8. Missing - A man's daughter disappears mysteriously into thin air. Where and when will he ever find her again?9. By the Grace of God - A home inspector has his average life turned upside down. It all starts with a seriously strange unheeded premonition.10. From My Cold Dead Hands - A hit man has one last chance at redemption before it's too late for all eternity.11. Invasion from Outer Space - A group of teens in the 1950's witness what appears to be an alien invasion, but what is really happening will change their lives forever.",
  "genres": [],
  "author": "Jack Legend",
  "average_rating": "4.17",
  "url": "https://www.goodreads.com/book/show/34318516-sci-fi-with-a-twist"
}