{
  "title": "Death Rains Down",
  "description": "Detective Ray Logue is a maverick.He is stationed in Superintendent Jim Mulcahy’s police department, having never quite got over the death of his wife 8 years earlier.Logue is now a hard-drinking and damaged cop, a loose cannon, a thorn in Mulcahy’s side, apt to take the law into his own hands – but he always gets results.So when faced with the murder of an attractive Polish girl in Port Ard, Co Mayo during the week before Halloween and the subsequent chain of killings that follow, Logue stubbornly refuses to let go even when his Super takes him off the case.Why on earth, Logue asks himself at the outset, would anyone want to kill Anna Pawalowski, a beautiful estate agent while she was out on a viewing?And why did the mutilated body of her Polish boyfriend then end up being washed up on the shore?Was she cheating on him? Did his love rival take revenge? Or are there much darker forces at play?But as the body count begins to rise, Logue slowly senses he has stumbled into a sticky web of lies, cover-ups and deceit stretching from his own department all the way to the top level of political power.From the law-enforcers to the law-makers, from respectable businessmen to Russian mobsters – a sinister hand is exercising an iron grip across the whole social order and woe betide any who dare to try to weaken it in any way.In a world of corruption and double talk the only person Logue can trust is his sidekick, Detective Jack McGarry who pulls him back on track to bring whoever is responsible for the carnage to justice one way or another.Logue, though, feels he has nothing more to lose and is hell bent on pursuing a malevolent force to the bitter end.After a tumultuous showdown he believes he has been successful.Set in Ireland at the peak of the Celtic Tiger era, Death Rains Down is a dark story of murder, organised crime and political corruption.'An intense thriller' - Thomas WaughKevin McManus lives in County Leitrim in Western Ireland. He graduated from University in 1998 with a Master’s degree in History and a Higher Diploma in Education. Since then he has worked as a secondary school teacher. Kevin has also played in many bands over the years and still retains a great love for music. He is also a keen supporter of Aston Villa Football Club.",
  "genres": [
    "Fiction"
  ],
  "author": "Kevin McManus",
  "average_rating": "3.90",
  "url": "https://www.goodreads.com/book/show/34312123-death-rains-down"
}