{
  "title": "Starfucker Collection: Confessions 1-5",
  "description": "Some secrets are guarded so closely that they’ll never appear in print.  Confession #1: Eileen Paige When Laney, a young Portland divorcee, searches in vain for her keys after a wet night out with the girls, her helpful neighbor steps up to ensure that she makes it to bed safely. The morning after, he invites her to join him for a relaxed Thanksgiving dinner. At the thought of facing her first holiday alone, Laney finds herself ringing his doorbell for a fun family evening. Among the friendly new faces who welcome Laney is her neighbor's step-sister, the famous Hollywood film actress, Eileen Paige. The first Starfucker confession explores an unexpected love triangle that emerges one cold November night.  Confession #2: Harold Albert Winstrom For a simple Indiana girl, even a 30-mile drive seemed to be a world away. Her first real journey began when she boarded a jet to London, England, where her single goal of shopping changed the moment she landed. A new friendship with her airplane seat row neighbor leads Susie on a wild first night in town, where she reluctantly ends up accepting a drink from a dashing young British Royal, Prince Harold Albert Winstrom. The second Starfucker confession tells the tale of a midwestern American girl who finds herself in the center of a foreign national scandal.  Confession #3: Hank Cavalry When a famous guest professor takes the stage at the local actor’s classroom early one morning, every would-be actress in attendance sat up eagerly to listen; all except the one who had fallen fast asleep in her chair. A bout of insomnia finds Liz waking up in class, only to be corrected by the man of steel himself, Hank Cavalry. The third Starfucker confession tells the story of how an unexpected classroom exercise leads a budding actress on the erotic adventure of her dreams.  Confession #4: Megyn Cox More unexpected than the unknown number that flashed on Jenna’s cellphone was the voice that spoke to her when she answered the call. A one-time fling from long ago found it’s way pulled into the present when his current wife called a nameless number in his cellphone. The fourth confession of E.C. Towers' Starfucker: Erotic Shorts Series tells the story of how blind jealousy began an unforgettable night with the sexiest actress in town, Megyn Cox.  Confession #5: Ryan & Serena When Amy was convinced to join a last-minute weekend trip, she never expected that the quick jaunt to Palm Springs would bring her face-to-face with the hottest actor in Hollywood, Ryan Crosling. Nor did she expect that he might openly quarrel with his girlfriend in front of all to see, the young singer and starlet, Serena Lopez. However, nothing could prepare Amy to find herself being seduced by this stunning creature simply to make Ryan pay attention to her. The fifth confession of E.C. Towers' Starfucker: Erotic Shorts Series tells the story of how one young woman became a pawn between a celebrity couple in their wicked game of sexual betrayal.  Amazon reviews for E. C. Towers’ Driftwood Cove Series   This is the book you pull out when the husband is out of town. - Jamie D. Thomas    Very sexy, steamy, and juicy... - Irie Guy    ...a great plot that keeps me awake at night reading. Not to mention the steamy scenes! -  JE    E.C.",
  "genres": [],
  "author": "E.C. Towers",
  "average_rating": "4.50",
  "url": "https://www.goodreads.com/book/show/34319096-starfucker-collection"
}