{
  "title": "The Woman Left Behind",
  "description": "Jina Modell works in Communications for a paramilitary organization, and she really likes it. She likes the money, she likes the coolness factor—and it was very cool, even for Washington, DC. She liked being able to kick terrorist butts without ever leaving the climate-controlled comfort of the control room.But when Jina displays a really high aptitude for spatial awareness and action, she’s reassigned to work as an on-site drone operator in the field with one of the GO-teams, an elite paramilitary unit. The only problem is she isn’t particularly athletic, to put it mildly, and in order to be fit for the field, she has to learn how to run and swim for miles, jump out of a plane, shoot a gun...or else be out of a job.Team leader Levi, call sign Ace, doesn’t have much confidence in Jina--who he dubbed Babe as soon as he heard her raspy, sexy voice--making it through the rigors of training. The last thing he needs is some tech geek holding them back from completing a dangerous, covert operation. In the following months, however, no one is more surprised than he when Babe, who hates to sweat, begins to thrive in her new environment, displaying a grit and courage that wins her the admiration of her hardened, battle-worn teammates. What’s even more surprising is that the usually very disciplined GO-team leader can’t stop thinking about kissing her smart, stubborn mouth…or the building chemistry and tension between them.Meanwhile, a powerful Congresswoman is working behind the scenes to destroy the GO-teams, and a trap is set to ambush Levi’s squad in Syria. While the rest of the operatives set off on their mission, Jina remains at the base to control the surveillance drone, when the base is suddenly attacked with explosives. Thought dead by her comrades, Jina escapes to the desert where, brutally tested beyond measure, she has to figure out how to stay undetected by the enemy and make it to her crew in time before they’re exfiltrated out of the country.But Levi never leaves a soldier behind, especially the brave woman he’s fallen for. He’s bringing back the woman they left behind, dead or alive.",
  "genres": [
    "Romance",
    "Romantic Suspense",
    "Suspense",
    "Contemporary",
    "Fiction",
    "Thriller",
    "Military Fiction"
  ],
  "author": "Linda Howard",
  "average_rating": "4.14",
  "url": "https://www.goodreads.com/book/show/34328638-the-woman-left-behind"
}