{
  "title": "The Mirage",
  "description": "A mind-bending novel in which an alternate history of 9/11 and its aftermath uncovers startling truths about America and the Middle East11/9/2001: Christian fundamentalists hijack four jetliners. They fly two into the Tigris & Euphrates World Trade Towers in Baghdad, and a third into the Arab Defense Ministry in Riyadh. The fourth plane, believed to be bound for Mecca, is brought down by its passengers.The United Arab States declares a War on Terror. Arabian and Persian troops invade the Eastern Seaboard and establish a Green Zone in Washington, D.C. . . .Summer, 2009: Arab Homeland Security agent Mustafa al Baghdadi interrogates a captured suicide bomber. The prisoner claims that the world they are living in is a mirage--in the real world, America is a superpower, and the Arab states are just a collection of \"backward third-world countries.\" A search of the bomber's apartment turns up a copy of \"The New York Times,\" dated September 12, 2001, that appears to support his claim. Other captured terrorists have been telling the same story. The president wants answers, but Mustafa soon discovers he's not the only interested party.The gangster Saddam Hussein is conducting his own investigation. And the head of the Senate Intelligence Committee--a war hero named Osama bin Laden--will stop at nothing to hide the truth. As Mustafa and his colleagues venture deeper into the unsettling world of terrorism, politics, and espionage, they are confronted with questions without any rational answers, and the terrifying possibility that their world is not what it seems.Acclaimed novelist Matt Ruff has created a shadow world that is eerily recognizable but, at the same time, almost unimaginable. Gripping, subversive, and unexpectedly moving, \"The Mirage\" probes our deepest convictions and most arresting fears.",
  "genres": [
    "Fiction",
    "Fantasy",
    "Science Fiction",
    "Alternate History",
    "Speculative Fiction",
    "Thriller",
    "Politics"
  ],
  "author": "Matt Ruff",
  "average_rating": "3.60",
  "url": "https://www.goodreads.com/book/show/12067161-the-mirage"
}