{
  "title": "The Once and Future Liberal: After Identity Politics",
  "description": "From one of the country’s most admired political thinkers, an urgent wake-up call to American liberals to turn from the divisive politics of identity and develop a vision of our future that can persuade all citizens that they share a common destiny. In The Once and Future Liberal , Mark Lilla offers an impassioned, tough-minded, and stinging look at the failure of American liberalism over the past two generations. Although there have been Democrats in the White House, and some notable policy achievements, for nearly 40 years the vision that Ronald Reagan offered—small government, lower taxes, and self-reliant individualism—has remained the country’s dominant political ideology. And the Democratic Party has offered no convincing competing vision in response. Instead, as Lilla argues, American liberalism fell under the spell of identity politics, with disastrous consequences. Driven originally by a sincere desire to protect the most vulnerable Americans, the left has now unwittingly balkanized the electorate, encouraged self-absorption rather than solidarity, and invested its energies in social movements rather than in party politics.  With dire consequences. Lilla goes on to show how the left’s identity-focused individualism insidiously conspired with the amoral economic individualism of the Reaganite right to shape an electorate with little sense of a shared future and near-contempt for the idea of the common good. In the contest for the American imagination, liberals have abdicated. Now they have an opportunity to reset. The left is motivated, and the Republican Party, led by an unpredictable demagogue, is in ideological disarray. To seize this opportunity, Lilla insists, liberals must concentrate their efforts on recapturing our institutions by winning elections. The time for hectoring is over. It is time to reach out and start persuading people from every walk of life and in every region of the country that liberals will stand up for them. We must appeal to – but also help to rebuild –  a sense of common feeling among Americans, and a sense of duty to each other. A fiercely-argued, no-nonsense book, enlivened by Lilla’s acerbic wit and erudition, The Once and Future Liberal is essential reading for our momentous times.",
  "genres": [
    "Politics",
    "Nonfiction",
    "Philosophy",
    "History",
    "Political Science",
    "Sociology",
    "Audiobook"
  ],
  "author": "Mark Lilla",
  "average_rating": "3.83",
  "url": "https://www.goodreads.com/book/show/34323539-the-once-and-future-liberal"
}