{
  "title": "The Haunted Forest Tour",
  "description": "Ladies and gentlemen, welcome to the Haunted Forest Tour! Sit back and enjoy a smooth ride in air-conditioned comfort as your heavily armored tram takes you through nature's most astonishing creation. The forest is packed to capacity with dangerous and terrifying creatures of all shapes, sizes, and hunger levels, and you'll get to observe these wonders in complete safety. Howl with a werewolf! Gaze into the glowing eyes of a giant spider! Look right through a spooky ghost! See horrific monsters you couldn't even imagine, only inches away from you! Things with fangs, things with claws, things with dripping red jaws -- you'll see them all! Not thrilling enough? Well, it's Halloween, and so we're offering a very special tour through the Haunted Forest. The new route goes deeper into the woods than any civilians have ventured before, and you're guaranteed to get a good scare! Rest assured that every possible security precaution has been taken. The Haunted Forest Tour has a 100% safety record, and technical difficulties are unheard of. You will be in no danger whatsoever. We promise. Bram Stoker Award-nominated authors James A. Moore and Jeff Strand have teamed up to take you on an action-packed, monster-laden adventure that will make you laugh, scream, and think twice before going near ghastly oversized beasts that want to devour you. \"[An] absolute gem of a read...What comes next is over two hundred pages of non stop, in your face, gore drenched action...You will be exhausted by the time you reach the satisfying last page...Think Jurassic Park with bloodthirsty demons on an adrenaline rush and you have The Haunted Forest Tour.\" - GoreZone magazine \"James A. Moore and Jeff Strand are a literary dream team. Devout readers of the genre are in for a real treat as these two horror heavyweights combine forces and battle their characters to the bloody death...Remember how it felt to inventory and consume your candy on Halloween night? That's the atmosphere in the forest. You feel like a glutton, like you couldn't possibly stomach one more gooey demise, but you turn the page and unwrap another nightmare anyway.\" - Horror-Web \"Moore and Strand heap scares upon plot twists in one of the freshest and most entertaining novels in recent years. The authors offer a frightening and high-octane tale, presented as an apocalyptic disaster movie.\" - Horror World",
  "genres": [
    "Horror",
    "Fantasy",
    "Audiobook",
    "Fiction",
    "Paranormal",
    "Thriller",
    "Halloween"
  ],
  "author": "James A. Moore",
  "average_rating": "3.66",
  "url": "https://www.goodreads.com/book/show/34339545-the-haunted-forest-tour"
}