{
  "title": "The Irrationalist: The Tragic Murder of René Descartes",
  "description": "An historical murder mystery based on real events.Who would want to murder the world’s most famous philosopher? Turns out: nearly everyone.In 1649, Descartes was invited by the Queen of Sweden to become her Court Philosopher. Though he was the world’s leading philosopher, his life had by this point fallen apart. He was 53, penniless, living in exile in Amsterdam, alone. With much trepidation but not much choice, he arrived in Stockholm in mid-October.Shortly thereafter he was dead.Pneumonia, they said. But who could believe that? There were just too many persons of interest who wanted to see Descartes dead, and for too many reasons. That so many of these persons were in Stockholm—thanks to the Gala the Queen was throwing to celebrate the end of the terrible Thirty Years' War—made the official story all the less plausible. Death by poisoning was the unofficial word on the cobblestone.Enter Adrien Baillet. A likeable misfit with a mysterious backstory, he arrives just as the French Ambassador desperately needs an impartial Frenchman to prove that Descartes died of natural causes—lest the “murder” in Lutheran Sweden of France’s great Catholic philosopher trigger colicky French boy-King Louis XIV to reignite that awful War. Baillet hesitatingly agrees to investigate Descartes’s death, knowing that if—or when—he screws up, he could be personally responsible for the War’s Thirty-First Year. But solving the mystery of Descartes’s death (Baillet soon learns) requires first solving the mystery of Descartes’s life, with all its dangerous secrets ... None of it is easy, as nearly everyone is a suspect and no one can be trusted. Nor does it help that he must do it all under the menacing gaze of Carolus Zolindius, the terrifying Swedish Chancellor with the strangely intimidating limp.But Baillet somehow perseveres, surprising everyone as he figures it all out—all the way to the explosive end.",
  "genres": [
    "Historical Fiction",
    "Philosophy",
    "Fiction",
    "Mystery"
  ],
  "author": "Andrew Pessin",
  "average_rating": "3.91",
  "url": "https://www.goodreads.com/book/show/34350640-the-irrationalist"
}