{
  "title": "Empath: Life Of An Empath: How To Live A Normal Life When The World Consumes You",
  "description": "This book contains proven steps and strategies on how to thrive, nourish and deal with emotions as an Empath while living a normal life.   FOR A LIMITED TIME ONLY... FREE bonus book inside!  Picture this – you're at the grocery store or the supermarket. You're standing in line at the checkout counter, and you get into a conversation with the person standing behind you. Before you know it, this perfect stranger is opening up to you and confiding in you some of their deepest thoughts or sharing their troubles. Alternatively, you have an instant sense of the character and personality of this stranger. Or perhaps, you find that animals naturally gravitate towards you and you're able to sense their feelings and emotions in a given situation. You may even have been called overemotional or ultrasensitive when you confess that you can't watch violence in movies or on TV.  If you find yourself nodding in agreement to any or all of these points, chances are, you are an empath. You find that other people's energy can affect you and that their wishes, desires, moods and thoughts unconsciously influence your life. You are quite spiritual, and the demands of the physical world can sometimes weigh heavily upon you. You may even find yourself the victim of illnesses that no one can explain medically.  However, being an empath is not just about emotions and recognizing physical sensitivities. An empath can recognize others' spiritual urges, intentions, and motivations. The most important part in all of this is that being an empath isn't something you can learn; it is something you're born with. In other words, either you are an empath, or you're not. In order to better understand, you need this book!   \n   Are You an Empath? \n   Traits of an Empath \n   The Benefits to Being an Empath \n   How to Cope With Being an Empath \n    Here's what people are saying about this book!     \nBy: AA Pearceon March 12, 2017. I’ve struggled with getting my energy drained by certain other people my whole life, and I’ve only recently discovered that this is because I’m an Empath. Since then I’ve read all I could on the subject, but the information is basic and pretty repetitive. That’s why I’m so glad I discovered this book, because it covers all aspects of being an Empath in great depth, suggests healing and coping strategies, and just generally equips you for leading a stress-free life as an Empath. I’ve already started using some of the suggested strategies and have seen a great improvement in my energy levels and peace of mind! Highly recommended!\n  \nBy: Mary Hillmanon February 25, 2017. Great book. I always believed that there are explanations for everything. This book explains what an Empath is, how you can identify your gift if you are one and best of all how you can still lead a normal life while embracing your gift.\n   Download To Understand What It Means To Live A Normal Life, And Get In Control Of It Today!",
  "genres": [],
  "author": "Sara J. Banner",
  "average_rating": "4.38",
  "url": "https://www.goodreads.com/book/show/34336766-empath"
}