{
  "title": "Lectures On Liberation",
  "description": "Angela Davis' Lectures on Liberation pamphlet Presented here are Professor Angela Davis' initial lectures for \"Recurring Philosophical Themes in Black Literature,\" her first course at UCLA, taught during the Fall Quarter of 1969. At the time she was beginning a two-year appointment as ActingAssistant Professor in Philosophy, an appointment duly recommended by the Department of Philosophy and enthusiastically approved by the UCLA Administration. The first of the two lectureswas delivered in Royce Hall to an audience of over fifteen hundred students and interested colleagues. At the lecture's end Professor Davis was given a prolonged standing ovation by the audience. It was, we thought, a vindication of academic freedomand democratic education. For the lectures are part of an attempt to bring to light the forbidden history of the enslavement and oppression of black people, and to place that history in an illuminating philosophical context. At the same time, theyare sensitive, original and incisive: the work of an excellent teacher and a truly fine scholar.Around this time Professor Davis is a prisoner of the society that should have welcomed her talents, her honesty and the contribution she was making toward understanding and resolving the most critical problem of that society—the division between its oppressors and its oppressed. First she was attacked by the Regents of theUniversity of California, who attempted to dismiss her from the University on the patently illegal ground of her membership in the Communist Party. When this attempt was overruled by theSuperior Court of Los Angeles, the Regents denied her the normal continuation of her appointment for a second year, in spite of recommendations from a host of review committees and the Chancellor of UCLA that she be reappointed. During the summerof 1970, she was charged with kidnapping. murder, and unlawful flight to avoid prosecution. and was placed on the FBI most wanted list. When apprehended, she was held on excessive bail,then denied bail, and subsequently has been kept in isolation from other prisoners. In her first lecture Professor Davis points out that keepingan oppressed class in ignorance is one of the principal instruments of its oppression. Like Frederick Douglass, the black slave whose life and work she surveys here, Professor Davis isone of the educated oppressed. Like him, she has achieved full consciousness of what it is to be oppressed, and has heightened this consciousness in her own people and in others. There canbe little doubt that her effectiveness in blunting the oppressive weapon of ignorance was the chief motive for her removal from the University of California, and a major motive in the harshtreatment she has since received. These are lectures dealing with the phenomenology of oppressionand liberation. It is one thing to make the elementary point that millions are still oppressed in what is advertised as the world's most free society. It is much more difficult to lay out the causes of that oppression and the ways in which it is perpetuated; its psychological meaning to the oppressor and theoppressed; and the process by which the latter becomes conscious of it; and the way in which they triumph over it. This was the task Professor Davis set for herself. She brings to her work a rich philosophical background, a piercing intellect andthe knowledge born of experience.It was perhaps inevitable that Professor Davis should become a symbol for conflicting groups and causes. But it is well to remember that behind the symbol lies the human being; whosethoughts are recorded here, and that when she stands trial not only a human cause but also a human life will be tried. In themeantime, we take pride in presenting these two lectures by a distinguished colleague and friend. May they everywhere contribute to the defeat of oppression. (1971 Introduction)an HONORABLE pamphlet of political activist, academic scholar, and author Angela Yvonne Davis24 Pages Black History Studies, Slavery, Black Consciousness, JusticeDownload and Read Link:https://archive.org/details/AngelaDav...",
  "genres": [
    "Nonfiction",
    "Politics",
    "Philosophy",
    "Feminism",
    "Cultural"
  ],
  "author": "Angela Y. Davis",
  "average_rating": "4.56",
  "url": "https://www.goodreads.com/book/show/34336459-lectures-on-liberation"
}