{
  "title": "Radioactivity: A History of a Mysterious Science",
  "description": "This is the story of a new science. Beginning with an obscure discovery in 1896, radioactivity led researchers on a quest for understanding that ultimately confronted the intersection of knowledge and mystery. Mysterious from the start, radioactivity attracted researchers who struggled to understand it. What caused certain atoms to give off invisible, penetrating rays? Where did the energy come from? These questions became increasingly pressing when researchers realized the process seemed to continue indefinitely, producing huge quantities of energy. Investigators found cases where radioactivity did change, forcing them to the startling conclusion that radioactive bodies were transmuting into other substances. Chemical elements were not immutable after all. Radioactivity produced traces of matter so minuscule and evanescent that researchers had to devise new techniques and instruments to investigate them. Scientists in many countries, but especially in laboratories in Paris, Manchester, and Vienna unraveled the details of radioactive transformations. They created a new science with specialized techniques, instruments, journals, and international conferences. Women entered the field in unprecedented numbers. Experiments led to revolutionary ideas about the atom and speculations about atomic energy. The excitement spilled over to the public, who expected marvels and miracles from radium, a scarce element discovered solely by its radioactivity. The new phenomenon enkindled the imagination and awakened ancient themes of literature and myth. Entrepreneurs created new industries, and physicians devised novel treatments for cancer. Radioactivity gave archaeologists methods for dating artifacts and meteorologists a new explanation for the air's conductivity. Their explorations revealed a mysterious radiation from space. Radioactivity profoundly changed science, politics, and culture. The field produced numerous Nobel Prize winners, yet radioactivity's talented researchers could not solve the mysteries underlying the new phenomenon. That was left to a new generation and a new way of thinking about reality. Radioactivity presents this fascinating history in a way that is both accessible and appealing to the general reader. Not merely a historical account, the book examines philosophical issues connected with radioactivity, and relates its topics to broader issues regarding the nature of science.",
  "genres": [
    "Science",
    "History",
    "Nonfiction",
    "Physics",
    "Chemistry"
  ],
  "author": "Marjorie C. Malley",
  "average_rating": "3.56",
  "url": "https://www.goodreads.com/book/show/12067799-radioactivity"
}