{
  "title": "A Bold and Dangerous Family",
  "description": "The acclaimed author of A Train in Winter and Village of Secrets delivers the next chapter in \"The Resistance Quartet\": the astonishing story of the aristocratic Italian family who stood up to Mussolini's fascism, and whose efforts helped define the path of Italy in the years between the World Wars—a profile in courage that remains relevant today.Members of the cosmopolitan, cultural aristocracy of Florence at the beginning of the twentieth century, the Rosselli family, led by their fierce matriarch, Amelia, were vocal anti-fascists. As populist, right-wing nationalism swept across Europe after World War I, and Italy’s Prime Minister, Benito Mussolini, began consolidating his power, Amelia’s sons Carlo and Nello led the opposition, taking a public stand against Il Duce that few others in their elite class dared risk. When Mussolini established a terrifying and brutal police state controlled by his Blackshirts—the squaddristi—the Rossellis and their anti-fascist circle were transformed into active resisters.In retaliation, many of the anti-fascists were arrested and imprisoned; others left the country to escape a similar fate. Tragically, Carlo and Nello were eventually assassinated by Mussolini’s secret service. After Italy entered World War II in June 1940, Amelia, thanks to visas arranged by First Lady Eleanor Roosevelt herself, fled to New York City with the remaining members of her family.Renowned historian Caroline Moorehead paints an indelible picture of Italy in the first half of the twentieth century, offering an intimate account of the rise of Il Duce and his squaddristi; life in Mussolini’s penal colonies; the shocking ambivalence and complicity of many prominent Italian families seduced by Mussolini’s promises; and the bold, fractured resistance movement whose associates sacrificed their lives to fight fascism. In A Bold and Dangerous Family, Moorehead once again pays tribute to heroes who fought to uphold our humanity during one of history’s darkest chapters.A Bold and Dangerous Family is illustrated with black-and-white photographs.",
  "genres": [
    "History",
    "Nonfiction",
    "Italy",
    "Biography",
    "World War II",
    "Politics",
    "Historical"
  ],
  "author": "Caroline Moorehead",
  "average_rating": "3.70",
  "url": "https://www.goodreads.com/book/show/34336207-a-bold-and-dangerous-family"
}