{
  "title": "LIES and the LYING LIARS who tell them: Nazis, Swastikas, Pledge of Allegiance",
  "description": "The Pledge of Allegiance was the origin of the Nazi salute and Nazi behavior. Swastikas were \"S\" letters for \"SOCIALIST\" under the Nazis (the National Socialist German Workers Party).  The pledge remains the first bullying that begins each day in government schools (socialist schools) in Police State USA. The astonishing discoveries of the historian Dr. Rex Curry are reviewed by author Ian Tinny who then asks the question that must be asked: What do Americans know about the pledge? And, if not, why don't they know? When did they first not know? Why don't they ask to have the pledge explained to them? Do they know that they don't understand it? Americans say repeatedly, \"The pledge is freedom!\" The presstitutes say nothing in response. Is it because there's a socialist bias in the media? I think so. And I think their attitude is: \"Americans don't know! Leave those pathetic voters alone, they don't know!\"Discover the secret about how the military salute was the origin of the Nazi salute.Study the Wholecaust (of which the Holocaust was a part).Learn how the word \"Fascist\" is related to the word \"faggot.\"The socialist salute was performed by public officials in the USA from 1892 through 1942. What happened to the photographs and films of the American socialist salute performed by federal, state, county, and local officials? Those photos and films are rare because people don't want to know the truth. Public officials in the USA who preceded the Adolf Hitler and the Benito Mussolini were sources for the stiff-armed salute (and robotic chanting) in those countries and other foreign countries.Explore how the \"ancient Roman salute\" myth originated from the city of Romein the state of New York (not Italy), Francis Bellamy's hometown. Learn about Mussolini's strange gift to the city of Rome, NY: a statue of two human male infants suckling on a female wolf. That statue remains on display in Rome, NY.Find out who you are, what you are, and how you got to be that way. Also learn who you should blame: your government's schools (socialist schools). Join the Pointer Instutute and the Dead Writers Club and help provide remedial education.Stop teachers from drilling children to verbally fellate the flag every morning. Stop the daily witch hunt. Stop the Lies and the Lying Liars who tell them. Remove the pledge from the flag; remove flags from schools; remove schools from government.",
  "genres": [],
  "author": "Dead Writers Club",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/34339343-lies-and-the-lying-liars-who-tell-them"
}