{
  "title": "Exotiqa",
  "description": "Librarian's note: Alternate cover edition of ASIN B06WRWZRMN here.The second YA SyFy dystopian Thriller released by the debut author M. Black, dubbed Divergent meets iRobot. This novel will appeal to a vast array of audiences. Filled with haunting questions of consciousness and artificial intelligence, identity and self-awareness, politics and love, life and death, the reader will be engaged in an entertaining story filled with futuristic technology.Set in the year 2055 in British Columbia, Canada, where humans are part robotic and robots are becoming more humanlike, the line dividing the two is becoming less clear.When sixteen-year-old Fione meets Maci, a twenty-one-year-old Flexbot who escapes from ImaTech located along the crust of the Coast Mountains, Fione’s life is taken on a roller-coaster ride of events that begins with trying to save Maci from ImaTech Corporation and ends with trying to save the country.With Fione's best friend and love interest, a Flexbot named Pix, Fione and Maci must come face-to-face with the greatest dangers their country has ever seen and learn the disturbing secrets of the popular online program Exotiqa—which her friends, family, and most of the country has downloaded onto their Cerebral Slabs. This won’t be easy, since Maci’s only love and greatest enemy, nicknamed Thirty, is tracking her every move.Told from two points of view: Maci’s and Fione's, this dystopia is filled with plenty of futuristic technology, and tells a story of a world that could eerily mirror our own one day.Fans of Divergent and The Hunger Games will love this dystopian world with two young but strong female heroines who must save the fragile system crumbling around them. This story will even satisfy those looking for something with more philosophical themes and it is a perfect fit for readers interested in sci-fi, artificial intelligence, and robotics.Flexbot dialogue is told in Synchro Let text in print (10 font size in ebook), and human dialogue is told in Baskerville text (12 font size).“Sunday passes too quickly. Approaching the mall in Mom’s jeep I almost forget I have a bot fugitive hidden away at my best friend’s house until we park and walk up to the glass front doors.”",
  "genres": [
    "Science Fiction",
    "Dystopia",
    "Robots",
    "Fiction",
    "Young Adult"
  ],
  "author": "M. Black",
  "average_rating": "4.12",
  "url": "https://www.goodreads.com/book/show/34371996-exotiqa"
}