{
  "title": "The Apprentice: My Life in the Kitchen",
  "description": "In this captivating memoir, the man whom Julia Child has called \"the best chef in America\" tells the story of his rise from a frightened apprentice in an exacting Old World kitchen to an Emmy Award winning superstar who taught millions of Americans how to cook and shaped the nation's tastes in the bargain.We see young Jacques as a homesick six-year-old boy in war-ravaged France, working on a farm in exchange for food, dodging bombs, and bearing witness as German soldiers capture his father, a fighter in the Resistance. Soon Jacques is caught up in the hurly-burly action of his mother's café, where he proves a natural. He endures a literal trial by fire and works his way up the ladder in the feudal system of France's most famous restaurant, finally becoming Charles de Gaulle's personal chef, watching the world being refashioned from the other side of the kitchen door.When he comes to America, Jacques immediately falls in with a small group of as-yet-unknown food lovers, including Craig Claiborne, James Beard, and Julia Child, whose adventures redefine American food. Through it all, Jacques proves himself to be a master of the American art of reinvention: earning a graduate degree from Columbia University, turning down a job as John F. Kennedy's chef to work at Howard Johnson's, and, after a near-fatal car accident, switching careers once again to become a charismatic leader in the revolution that changed the way Americans approached food. Included as well are approximately forty all-time favorite recipes created during the course of a career spanning nearly half a century, from his mother's utterly simple cheese soufflé to his wife's pork ribs and red beans.The Apprentice is the poignant and sometimes funny tale of a boy's coming of age. Beyond that, it is the story of America's culinary awakening and the transformation of food from an afterthought to a national preoccupation.",
  "genres": [
    "Food",
    "Memoir",
    "Nonfiction",
    "Biography",
    "Cooking",
    "Cookbooks",
    "France"
  ],
  "author": "Jacques Pépin",
  "average_rating": "4.18",
  "url": "https://www.goodreads.com/book/show/343684.The_Apprentice"
}