{
  "title": "My Life as a Dog",
  "description": "What can you say about Moose? A lovable canine? A consummate professional? A bright star in the Hollywood universe? Yes, you could say all those things. Or you could just say that he was the little dog that could. The little dog that never took no for an answer. The little dog that never said, \"I can't,\" but always, \"why can't I?\"The story of Moose is a classic rags-to-riches story of how an average pound-bound puppy barked, jumped, and mugged his way up the ladder of success to become a major superstar. Not since Lassie has America cared so much about one of its four-legged creatures. At least, that's what Moose would say.I would say that working with that dog has been a nightmare. I had to be at his beck and call, any time, day or night. You don't know what it's like to get a call at three o'clock in the morning because \"someone\" has something he wants to add to the Frasier chapter. Did he think I had no life of my own? Or that I slept by the telephone waiting for him to call? Yes, he did. Because, like most uber-stars, he thought the world revolved around him. From the moment I committed to working with him on this book, it's been nothing but Moose, Moose, Moose.But I have to admit he's had a fascinating life. To be plucked out of obscurity and thrust into the limelight may be the dream of every actor in the world, but in reality it's more of a challenge than most people realize. It's hard not to get caught up in all the glitter and hype of Hollywood and completely lose sight of what's really important—family and friends. As egomaniacal as Moose is, he has never forgotten where he came from or taken for granted the fans that got him where he is today.He's a complex guy—selfish and independent, demanding and feisty, impatient and intense, arrogant and stubborn, and strong-willed. But he is also loving, caring, thoughtful when he wants to be, charismatic, funny, charming, and above all loyal.In short, Moose is a Jack Russell terrier with an attitude. Is there any other kind?",
  "genres": [
    "Dogs",
    "Nonfiction",
    "Biography",
    "Humor"
  ],
  "author": "Brian Hargrove",
  "average_rating": "3.79",
  "url": "https://www.goodreads.com/book/show/343723.My_Life_as_a_Dog"
}