{
  "title": "Butterworth Mysteries - Box Set 1",
  "description": "4 short mystery stories  Playing At Murder It’s always been a dream of Connie Butterworth’s to be a private investigator. Now that she’s retired, she makes that dream a reality and sets herself up as an investigator. With reluctant help from her sister-in-law, Sable, Connie takes on her first client. What starts out as a simple case of tracking down a missing person soon turns into an intriguing case of deception, phone hacking and murder.  Curiosity Killed Dolly Kendall Retired widows, Connie and Sable Butterworth have set up a private investigating business. Their second case involves the suspicious death of Dolly Kendall. Dolly is found dead at her home, supposedly from an overdose of sleeping tablets. Connie had spoken to Dolly the previous day and knew something wasn’t quite right with her. Dolly had been despondent, and it was obvious to Connie that something was bothering her. Connie and Sable’s investigation leads them to a devious plot involving missing cats and poisonous letters.  A Deadly Service Jocelyn Kent contacts Connie and Sable and asks them to look into strange occurrences which happen nightly in her office. Every morning, when Jocelyn returns to her office, she discovers items have been moved despite the office being secure.  Not happy with scaring Jocelyn, the intruder has now started to make attempts on Jocelyn’s life by sabotaging the drinking water and furniture. Connie and Sable are soon on the case and set up a night-time vigil. But there is something about Jocelyn’s office that bothers Connie. As the case proceeds, she remembers what it is, and the case takes a surprising turn.  Time To Get Even Steven Stevens is the presenter of a consumer rights programme. He is known for his persistence and dedication as he tracks down wrongdoers who have been tricking the public. His work has gained him many fans - and many enemies. Steven asks Connie and Sable to help him with his own problem. He is being blackmailed. Someone knows about his hidden past, and are threatening to expose him. The threats have become more sinister, and now Steven’s life is at risk. Connie and Sable begin their investigation and soon discover there is more than one suspect.",
  "genres": [],
  "author": "Gillian Larkin",
  "average_rating": "4.29",
  "url": "https://www.goodreads.com/book/show/34372950-butterworth-mysteries---box-set-1"
}