{
  "title": "Grand Theft Cargo",
  "description": "Tenacious trucker Jojo Boudreaux and her co-driver beau Tyler Boone spend their days- and nights- delivering cargo coast to coast. Old Blue, their custom Peterbilt tractor-trailer makes the perfect home for a man who never had one and a Louisiana tomboy who thinks an oven is for storing guns. But life on the road isn’t all sing-a-longs and sunsets.When Jojo and Boone are called in to deliver an abandoned load of high-profile pharmaceuticals to a secure warehouse, they delay their vacation for the quick, easy job with the big paycheck, forgetting that nothing quick and easy ever comes with a big paycheck.Grand Theft Cargo is a wild ride from start to finish with a secretive highwayman, explosive house bombs, singing telegrams, flaming mice, secret cancer drugs, dead truckers, an agency that can’t be named, and enough crashes and car chases to remind you these road cowboys have no qualms crossing the zipper to walk the dog in the hammer lane.Praise for Grand Theft Cargo…“Grand Theft Cargo is replete with clever dialogue and colorful characters, and a plot that speeds along like a Freightliner. Strap yourself in before you start to read this one.” —Baron R. Birtcher, award-winning author of Rain Dogs and South California Purples.“Grand Theft Cargo is a high-speed thrill ride with enough crashes and explosions to keep your heart racing from the first to last page!” —M.K. Gilroy, author of the Kristen Conner Mystery Series.“A guaranteed thrill ride with plenty of twists and turns.” —Chuck Barrett, bestselling author of Disruption.“Grand Theft Cargo is east bound and down with great characters, loaded up and truckin’ with action. This is 18 wheels of mystery firing on all cylinders. Get behind the wheel and enjoy the ride.” —Eric Beetner, author of Rumrunners and Leadfoot.",
  "genres": [
    "Fiction"
  ],
  "author": "Linda Sands",
  "average_rating": "4.75",
  "url": "https://www.goodreads.com/book/show/34375123-grand-theft-cargo"
}