{
  "title": "The Shifter King",
  "description": "Sam saw him enter the club at the opposite end of the room. Everyone did. He was a dark shadow against the night, no small feat but one he accomplished with frightening ease. His suit was expertly, precisely tailored, black and expensive, and it hugged every intended curve of his six-foot-five frame. The collar of his black shirt, crisp and sharp, brushed the dark blonde curls he almost never bothered to cut and set off the equally sharp black image of his leather eye patch. One ice blue eye lit up the shadows, stark and unavoidable. “Holy hell, sister. That is one beautiful, scary, beautiful man,” whispered Sam’s friend. “He can hear you,” Sam whispered back. Across the room, Jack Colton smiled. And it was a beautiful, scary, beautiful smile.  Samantha O’Neill has been running for twenty years. She’s been fleeing from a man with an ice blue gaze, and possessed of a terrible magic. Two decades has seen her grown into a woman wise and self-sufficient, and unnaturally blessed with a powerful and unique magic all her own. For twenty years she’s managed to escape him. But all hunts come to an end. And now, in the lengthening darkness of an autumn Chicago night, an ominous footfall in the subway and a shadow over her solitary form force Sam to at last come face-to-face with her brutally beautiful pursuer – and her clouded and tangled feelings for him.  Jack Colton assumes their forms in the night, shifting to become the predators that grown men still fear in the cold sweat of their nightmares. Powerful, sleek, graceful, and deadly, he moves through the darkness, watching. Waiting. And that powerful blue gaze finds Sam everywhere she goes. Because he knows something she doesn’t. He knows what she is, and he knows what that means. He knows the prophecy. He lives it every day. Jack has fought for twenty years to protect that secret, killed to protect the woman who keeps it, and if he must, he will die to see it come to its fruition.  The Shifter King is the tenth book in the Big Bad Wolf spinoff series, The Kings, by New York Times and USA Today bestselling author Heather Killough-Walden.",
  "genres": [
    "Paranormal",
    "Paranormal Romance",
    "Fantasy",
    "Romance",
    "Shapeshifters",
    "Vampires"
  ],
  "author": "Heather Killough-Walden",
  "average_rating": "4.36",
  "url": "https://www.goodreads.com/book/show/34376529-the-shifter-king"
}