{
  "title": "The Republic for Which It Stands: The United States during Reconstruction and the Gilded Age, 1865-1896",
  "description": "The Oxford History of the United States is the most respected multivolume history of the American nation. In the newest volume in the series, The Republic for Which It Stands, acclaimed historian Richard White offers a fresh and integrated interpretation of Reconstruction and the Gilded Age as the seedbed of modern America.At the end of the Civil War the leaders and citizens of the victorious North envisioned the country's future as a free-labor republic, with a homogenous citizenry, both black and white. The South and West were to be reconstructed in the image of the North. Thirty years later Americans occupied an unimagined world. The unity that the Civil War supposedly secured had proved ephemeral. The country was larger, richer, and more extensive, but also more diverse. Life spans were shorter, and physical well-being had diminished, due to disease and hazardous working conditions. Independent producers had become wage earners. The country was Catholic and Jewish as well as Protestant, and increasingly urban and industrial. The \"dangerous\" classes of the very rich and poor expanded, and deep differences-ethnic, racial, religious, economic, and political-divided society. The corruption that gave the Gilded Age its name was pervasive. These challenges also brought vigorous efforts to secure economic, moral, and cultural reforms. Real change-technological, cultural, and political-proliferated from below more than emerging from political leadership. Americans, mining their own traditions and borrowing ideas, produced creative possibilities for overcoming the crises that threatened their country.In a work as dramatic and colorful as the era it covers, White narrates the conflicts and paradoxes of these decades of disorienting change and mounting unrest, out of which emerged a modern nation whose characteristics resonate with the present day.",
  "genres": [
    "History",
    "American History",
    "Nonfiction",
    "Politics",
    "American",
    "The United States Of America",
    "Civil War"
  ],
  "author": "Richard White",
  "average_rating": "4.17",
  "url": "https://www.goodreads.com/book/show/34379310-the-republic-for-which-it-stands"
}