{
  "title": "The Demon King and the Boy Who Hardly Knew Anything",
  "description": "Greylock Bishop, youngest prince of Aranfeit, better known as Grey by those who matter, is decidedly unremarkable and more bored than ever. But, when—through poor luck and even poorer foresight—his homeland’s magical defenses finally fall at the hands of the more technologically inclined Morandians, Grey’s father entrusts him with an old crystal and, subsequently, the fate of the entire world.  Having already lost the one person in all the world he ever truly loved, Erik Michaels—veteran soldier and current POW—has resigned himself to spending the rest of his life in solitary confinement. However, two years alone with nothing but his own dark music for company hasn't done Erik’s mood any favors. In fact, he might even be losing his mind. But, after being released from prison in exchange for assisting the Aranfei royals in their escape, Erik manages to pull himself mostly together just in time to end up at the center of a supernatural clash of powers like nothing he’s ever known. Or, at least, nothing he’d ever noticed before.  King Gregor of Morandia is over 60 years old and just now on the brink of realizing his true potential. At last, he will bring together a land divided for centuries, but at what cost? Following his acquisition of Muratan, Capitol of Aranfeit, Gregor discovers something locked away beneath the royal palace; something more old and powerful than even he himself can fathom, and far more than he’s capable of denying. What began as a petty struggle between nations has become a desperate crusade for all of humanity as Gregor finds himself riding shotgun to the Demon King, Garaak, who has a bone to pick with the frivolous and narcissistic human race. Meanwhile, the greater advantage seems to lie unnervingly with whoever manages to attain the allegiance of a strange young man with stranger magic who doesn’t even know his own name.",
  "genres": [
    "Fantasy",
    "M M Romance"
  ],
  "author": "Pat  Ellis",
  "average_rating": "3.81",
  "url": "https://www.goodreads.com/book/show/34374393-the-demon-king-and-the-boy-who-hardly-knew-anything"
}