{
  "title": "To Love a Reckless Lord: Conundrums of the Misses Culpepper Collection Books 1-3",
  "description": "This boxed set includes the first THREE FULL LENGTH installments of The Blue Rose Regency Romances: The Culpepper Misses Series, featuring devilish rogues and the unpredictable women who capture their hearts. The Earl and the SpinsterBrooke Culpepper has focused her energy on two things: keeping the struggling dairy farm that’s her home operating and preventing her younger sister and cousins from starving. Then her cousin loses the farm to Heath, Earl of Ravensdale at the gaming tables. Desperate, pauper poor, and with nowhere to take her family, Brooke proposes a rash wager. Heath's stakes? The farm. Hers? Her virtue. The land holds no interest for Heath, but he finds Brooke irresistible and ignoring prudence as well as his sense of honor, he just as recklessly accepts her challenge.The Marquis and the VixenDragged to London for a Season, Blythe Culpepper is dismayed to learn her guardian has enlisted the devilishly attractive Tristan, Marquis of Leventhorpe—the one man she detests—to assist with her launch into Polite Society. Still, she cannot deny the way her body reacts when he’s near. Blythe taxes Tristan to his limits with her sharp wit and even sharper tongue, yet the beauty captivates him like no other. When a past enemy comes calling, Tristan risks all, including his honor to protect Blythe. The Lord and the WallflowerBrette Culpepper enchants Alexander Hawksworth from the moment they met, but as a humble vicar, she’s too far above his station. Then Alex unexpectedly inherits an earldom, and he’s determined to make her his countess—until he’s accused of the previous earl’s murder. Brette finds herself falling in love with the charming vicar, but when a new guardian emerges intent on forcing her to wed an elderly degenerate instead of Alex, her world turns upside down. Can Alex clear his name in time to rescue Brette from an unimaginable fate, or will they be forced to elope amidst scandal and disgrace? These charming Regency romps by a USA Today bestselling author are heartwarming sigh-worthy, tales that will make you giggle as you flip the pages to discover what mayhem the Culpepper Misses have stirred up next. If you enjoy reading strong heroine, sister series, enemies to lovers, wallflower, and spinster love stories with a dash of suspense, a sprinkle of humor, and gripping emotion then you’ll adore Collette Cameron’s mesmerizing TO LOVE A RECKLESS LORD. Buy the historical anthology and settle into your favorite reading nook to binge read these rousing romantic adventures you can’t put down.",
  "genres": [
    "Historical Romance",
    "Regency Romance",
    "Historical Fiction"
  ],
  "author": "Collette Cameron",
  "average_rating": "4.31",
  "url": "https://www.goodreads.com/book/show/34382303-to-love-a-reckless-lord"
}