{
  "title": "Wicked Torment",
  "description": "Eight gentlemen known in Society as The Sinners.  Having all returned safely from Waterloo, these gentlemen now find themselves with the more dangerous task of discovering which of the ladies in Society has been acting as a spy for the enemy.  Dangerous to their hearts, that is.  Darius Strong, the Duke of Wolferton, known to his close friends as Wolf, cares little for what Society or anyone else thinks of him, and lives his life accordingly. Given the task of discovering whether Lady Beatrix Hanwell has been using her position in Society to garner information for the enemy puts him in something of a quandary, however. The two of them have met several times in the past, occasions when that lady had not hesitated to show her disapproval of him. Mainly by ignoring his existence. Which is going to make it difficult for Darius to get close enough to her to seduce her into revealing whether or not she is the guilty lady.  Beatrix is puzzled—and more than a little disturbed—when Darius Strong, the exceedingly handsome and scandalous Duke of Wolferton, begins to show her marked attention. As a widow aged seven and twenty, and possessing no great beauty, his interest is mystifying to say the least. Much as she tries to fight her growing attraction to Wolf she is failing miserably, as each meeting between the two of them draws her ever nearer to forgetting all propriety and simply giving in to his seduction.  Except her surrender means revealing the secret she has taken such pains to hide.  To Darius’s surprise he finds himself becoming intrigued by Beatrix. Not only intrigued but he desires her more deeply than any other woman he has ever met. So much so that he finds himself hoping she is not the lady they are seeking.  Is Beatrix guilty of treason, and if not what will her reaction be to Wolf when she discovers the truth behind his single-minded pursuit of her? Author’s Note: The stories in the Regency Sinners, Regency Unlaced, Knight Security, and Alpha Series, have stronger sexual content and language than my other books.",
  "genres": [
    "Historical Romance",
    "Romance",
    "Historical",
    "Regency",
    "Novella",
    "Regency Romance",
    "Historical Fiction"
  ],
  "author": "Carole Mortimer",
  "average_rating": "4.04",
  "url": "https://www.goodreads.com/book/show/34390922-wicked-torment"
}