{
  "title": "A History of Eastern Europe",
  "description": "Eastern Europe has long been thought of as the \"Other Europe\", a region rife with political upheaval, shifting national borders, an astonishing variety of ethnic diversity, and relative isolation from the centers of power in the West. It has also been, and continues to be, pivotal in the course of world events. A History of Eastern Europe offers a sweeping 1,000-year tour with a particular focus on the region's modern history. In 24 insightful lectures, you'll observe waves of migration and invasion, watch empires rise and fall, witness wars and their deadly consequences - and come away with comprehensive knowledge of one of the world's most fascinating places.In examining this region's remarkable diversity and contested borders, you'll better understand the ever-present tension between the connections between East and West and the areas of marked contrast. These disparities were clear as the world globalized and the US and Soviet superpowers jockeyed for spheres of influence - epitomized by the imposition of the Iron Curtain across Europe and the rise of the Berlin Wall. And yet, throughout the 20th century and into current times, the connectedness of Eastern Europe to the rest of the world continues to be demonstrated beyond question. This region has made itself felt across the globe through: The political and cultural reverberations of peace movements and armed conflicts The crises of huge population migrations and the new expressions of cultural and economic exchange they spark The successes and struggles of NATO and the European Union And moreExplore the grand sweep of this epic history, from a series of early invasions to the rise of empires to the collapse of communism and into the new challenges of the 21st century. Meet brilliant poets, writers, artists, and other cultural figures who made an impact on Eastern European history.",
  "genres": [
    "History",
    "Nonfiction",
    "Audiobook",
    "Politics",
    "Russia",
    "European History",
    "Historical"
  ],
  "author": "Vejas Gabriel Liulevicius",
  "average_rating": "4.23",
  "url": "https://www.goodreads.com/book/show/34383777-a-history-of-eastern-europe"
}