{
  "title": "C.S. Lewis Essay Collection & Other Short Pieces",
  "description": "This is an extensive collection of short essays and other pieces by C.S. Lewis brought together in one volume for the first time. As well as his many books, letters and poems, C.S. Lewis also wrote a great number of essays and shorter pieces on various subjects. He wrote extensively on Christian theology and the defence of faith, but also on various ethical issues and on the nature of literature and story-telling. In the ESSAY COLLECTION we find a treasure trove of Lewis's reflections on diverse topics.Table of Content:Essays1) The Grand Miracle2) Is Theology Poetry?3) The Funeral of a Great Myth4) God In the Dark5) What Are We to Make of Jesus Christ?6) The World’s Last Night7) Is Theism Important?8) The Seeing Eye9) Must Our Image of God Go?10) Christianity and Culture11) Evil and God12) The Weight of Glory13) Miracles14) Dogma and the Universe15) The Horrid Red Things16) Religion: Reality or Substitute?17) Myth Became Fact18) Religion and Science19) Christian Apologetics20) Work and Prayer21) Religion Without Dogma?22) The Decline of Religion23) Unforgiveness24) The Pains of Animals25) Petitionary Prayer: A Problem Without an Answer26) On Obstinacy in Belief27) What Christmas Means to Me28) The Psalms29) Religion and Rocketry30) The Efficacy of Prayer31) Fern Seed and Elephants32) The Language of Religion33) Transposition34) Why I am Not a Pacifist35) Dangers of National Repentance36) Two Ways With the Self37) Meditation on the Third Commandment38) On Ethics39) Three Kinds of Men40) Answers to Questions on Christianity41) The Laws of Nature42) Membership43) The Sermon and the Lunch44) Scraps45) After Priggery – What?46) Man or Rabbit?47) The Trouble With X48) On Living in an Atomic Age49) Lillies that Fester50) Good Work and Good Works51) A Slip of the Tongue52) We Have No Right to Happiness53) Christian Reunion: An Anglican Speaks to Roman Catholics54) Priestesses in the Church?55) On Church Music56) Christianity and Literature57) High and Low Brows58) Is English Doomed?59) On the Reading of Old Books60) The Parthenon and the Optative61) The Death of Words62) On Science Fiction63) Miserable Offenders64) Different Tastes in Literature65) Modern Translations of the Bible66) On Juvenile Tastes67) Sex in Literature68) The Hobbit69) Period Criticism70) On Stories71) On Three Ways of Writing for Children72) Prudery and Philology73) Tolkein’s “The Lord of the Rings”74) Sometimes Fairy Stories May Say Best What’s to Be Said75) It All Began With a Picture76) Unreal Estates77) On Criticism78) Cross Examination79) A Tribute to E.R. Eddison80) The Mythopoeic Gift of Rider Haggard81) George Orwell82) A Panegyric for Dorothy L. Sayers83) The Novels of Charles Williams84) Learning in War-Time85) Bulverism (or, The Foundation of 20th Century Thought)86) The Founding of the Oxford Socratic Club87) My First School88) Democratic Education89) Blimpophobia90) Private Bates91) Meditation in a Tool Shed92) On the Transmission of Christianity93) Modern Man and His Categories of Thought94) Historicism95) The Empty Universe96) Interim Report97) Is History Bunk?98) Before We Can Communicate99) First and Second Things100) The Poison of Subjectivism101) Equality102) De Futilitate103) A Dream104) Hedonics105) Talking About Bicycles106) Vivisection107) The Humanitarian Theory of Punishment108) Behind the Scenes109) The Necessity of Chivalry110) The Inner Ring111) Two Lectures112) Some Thoughts113) X-mas and Christmas114) Revival or Decay115) Delinquents in the Snow116) Willing Slaves of the Welfare State117) Screwtape Proposes a ToastLetters118) The Conditions for a Just War119) The Conflict in Anglican Theology120) Miracles121) Mr. C.S. Lewis on Christianity122) A Village Experience123) Correspondence With an Anglican Who Dislikes Hymns124) The Church’s Liturgy, Invocation, and Invocation of Saints125) The Holy Name126) Mere Christians127) Canonization128) Pittenger-Lewis and Version Vernacular129) Capital Punishment and Death PenaltyShort Stories130) The Man Born Blind131) The Dark Tower132) The Dark Tower (continued)133) The Dark Tower (continued)134) Ministering Angels135) The Shoddy Lands136) After Ten Years137) Forms of Things Unknown",
  "genres": [
    "Nonfiction",
    "Essays",
    "Christian",
    "Theology",
    "Philosophy",
    "Short Stories",
    "Audiobook"
  ],
  "author": "C.S. Lewis",
  "average_rating": "4.48",
  "url": "https://www.goodreads.com/book/show/343919.C_S_Lewis_Essay_Collection_Other_Short_Pieces"
}