{
  "title": "Bandwidth Recovery",
  "description": "Published in association with This book argues that the cognitive resources for learning of over half our young people have been diminished by the negative effects of economic insecurity, discrimination and hostility against non-majority groups based on race, ethnicity, sexual orientation, or gender identity, and other aspects of difference. Recognizing that these students are no different than their peers in terms of cognitive capacity, this book offers a set of strategies and interventions to rebuild the available cognitive resources necessary to succeed in college and reach their full potential.Members of these groups systematically experience conditions in their lives that result in chronic stress and, therefore, decreased physical and mental health and social and economic opportunity. The costs of the many kinds of scarcity in their lives – money, health, respect, safety, affirmation, choices, belonging – is seriously reduced “mental bandwidth,” the cognitive and emotional resources needed to deal with making good decisions, learning, healthy relationships, and more. People who are operating with depleted mental bandwidth are less able to succeed in school, starting in childhood, and are much less likely to make it to college. For those who do make it, their bandwidth capacity often interferes with learning, and therefore, persisting and graduating from college.This book presents variety of evidence-based interventions that have been shown, through implementation in high schools and colleges, to help students to regain bandwidth. They are variously intended for application inside and outside the classroom and address not only cognitive processes but also social-psychological, non-cognitive factors that are relevant to the college environment as a whole. Beginning with an analysis of the impacts on mental and physical health and cognitive capacity, of poverty, racism, and other forms of social marginalization, Cia Verschelden presents strategies for promoting a growth mindset and self-efficacy, for developing supports that build upon students’ values and prior knowledge and for creating learning environments both in and out of the classroom so students can feel a sense of belonging and community. She addresses issues of stereotyping and exclusion and discusses institutional structures and processes that create identity-safe rather than identity-threat learning environment. This book is intended for faculty, student affairs professionals, and college and university administrators, all of whom have an interest in creating learning environments where all students have a chance to succeed.",
  "genres": [
    "Education",
    "Teaching",
    "Nonfiction",
    "Academic",
    "Race"
  ],
  "author": "Cia Verschelden",
  "average_rating": "4.09",
  "url": "https://www.goodreads.com/book/show/34415379-bandwidth-recovery"
}