{
  "title": "Easy Errors",
  "description": "When the first Posadas County Mystery, Heartshot, published in 1991, Bill Gastner was the county Undersheriff. Over time Bill became Sheriff, then retired, and Robert Torrez took over the top spot. But what were Torrez's first days as a rookie officer like? Terrible!It's 1986. Undersheriff Bill Gastner is enjoying his usual insomnia alone inside his old adobe when jolted by a horrendous noise. Dreading what he will find, he hastens to the nearby interstate exit where a violent crash has occurred. Not only is the vehicle that struck the support pillars totaled and the driver and a passenger crushed inside, a dead boy has been ejected.As the appalled Gastner recognizes the youth and swings into action, the first deputy to join him at the scene is rookie Robert Torrez, the department's newest hire. Before Gastner can head him off, Torrez sees that the boy is his spirited younger brother. And the girl crushed inside the SUV is a younger sister. The driver of the Suburban, also dead, is the assistant District Attorney's teenaged son. Two local family tragedies.A shaken couple reports that when the Suburban, careening at nearly 100 miles an hour, passed them on the interstate, activity inside hinted at its occupants' panic. Were the three dead kids running from someone-or something-rather than speeding? Further investigation reveals that a fourth teen should have been in the vehicle, but is now missing. Where had the four kids been? And why? It appears they'd lied to their parents.Following his usual meticulous procedure, Gastner traces the vehicle's path to a remote canyon with attractive caves. The discovery he makes there balloons the case and introduces possible murder. Yet with a lack of witnesses hampering Sheriff Salcido, Gastner, Torrez, and other deputies, errors working the case can too easily be made.",
  "genres": [
    "Mystery",
    "Fiction",
    "Westerns",
    "Crime"
  ],
  "author": "Steven F. Havill",
  "average_rating": "4.08",
  "url": "https://www.goodreads.com/book/show/34412246-easy-errors"
}