{
  "title": "Theft: A History of Music",
  "description": "Theft: A History of Music This comic lays out 2000 years of musical history. A neglected part of musical history. Again and again there have been attempts to police music; to restrict borrowing and cultural cross-fertilization. But music builds on itself. To those who think that mash-ups and sampling started with YouTube or the DJ’s turntables, it might be shocking to find that musicians have been borrowing – extensively borrowing – from each other since music began. Then why try to stop that process? The reasons varied. Philosophy, religion, politics, race – again and again, race – and law. And because music affects us so deeply, those struggles were passionate ones. They still are.The history in this book runs from Plato to Blurred Lines and beyond. You will read about the Holy Roman Empire’s attempts to standardize religious music using the first great musical technology (notation) and the inevitable backfire of that attempt. You will read about troubadours and church composers, swapping tunes (and remarkably profane lyrics), changing both religion and music in the process. You will see diatribes against jazz for corrupting musical culture, against rock and roll for breaching the color-line. You will learn about the lawsuits that, surprisingly, shaped rap. You will read the story of some of music’s iconoclasts – from Handel and Beethoven to Robert Johnson, Chuck Berry, Little Richard, Ray Charles, the British Invasion and Public Enemy.To understand this history fully, one has to roam wider still – into musical technologies from notation to the sample deck, aesthetics, the incentive systems that got musicians paid, and law’s 250 year struggle to assimilate music, without destroying it in the process. Would jazz, soul or rock and roll be legal if they were reinvented today? We are not sure. Which as you will read, is profoundly worrying because today, more than ever, we need the arts.All of this makes up our story. It is assuredly not the only history of music. But it is definitely a part – and a fascinating part – of that history. We hope you like it.",
  "genres": [
    "Music",
    "Nonfiction",
    "Comics",
    "Graphic Novels",
    "History",
    "Graphic Novels Comics"
  ],
  "author": "James Boyle",
  "average_rating": "3.82",
  "url": "https://www.goodreads.com/book/show/34413881-theft"
}