{
  "title": "Protector",
  "description": "Fighting for love, honor, and freedom on the galaxy’s lawless outer rim…  Cool and driven Madeline Cochran made a successful career for herself as civilian commander of a space station orbiting Jupiter…until the day it was attacked and she was abducted by alien slavers.  Her organized existence shattered, Madeline suffered during her captivity, but since her rescue by the tough gladiators of the House of Galen, she’s struggling to assimilate to her new life. As she navigates the desert world of Carthago and the gladiator city of Kor Magna, she desperately misses her teenage son back on Earth and throws herself into finding another human, space marine Blaine, still kept captive by the slavers. She also finds herself working harder than ever to avoid a certain charming showman gladiator who is far too attractive and far too tempting.  Gladiator Lore Uma-Xilene is a protector at heart and a sucker for a damsel in distress…although he’s well aware that the hard-shelled and sad-eyed Madeline wouldn’t appreciate the title. He knows what it feels like to be ripped from the family you love and have your life destroyed, and he wants to help Madeline heal. As the two of them go undercover into the dangerous world of underground gambling, Lore knows he’ll need all his patience, passion, and a whole lot of stubbornness to not only keep Madeline safe but to melt the icy shell around her heart.  Note to readers: This sci fi romance contains a lot of action (think wild gladiatorial fights and daring rescues), tough gladiators (the warriors of the House of Galen) and a steamy romance (between a cool, driven woman and a charming showman gladiator). So if you like it fast, and gritty, and sexy, this is for you!  Includes a sneak peek of Champion, Galactic Gladiators #5.",
  "genres": [
    "Romance",
    "Science Fiction",
    "Aliens",
    "Science Fiction Romance",
    "Paranormal Romance",
    "Fantasy",
    "Paranormal"
  ],
  "author": "Anna Hackett",
  "average_rating": "4.30",
  "url": "https://www.goodreads.com/book/show/34404768-protector"
}