{
  "title": "Rahel Varnhagen: The Life of a Jewess",
  "description": "She was, Hannah Arendt wrote, \"my closest friend, though she has been dead for some hundred years.\" Born in Berlin in 1771 as the daughter of a Jewish merchant, Rahel Varnhagen would come to host one of the most prominent salons of the late eighteenth and early nineteenth centuries. Arendt discovered her writings some time in the mid-1920s, and soon began to reimagine Rahel's inner life and write her biography. Long unavailable and never before published as Arendt intended, Rahel Varnhagen: The Life of a Jewess returns to print in an extraordinary new edition.Arendt draws a lively and complex portrait of a woman during the period of the Napoleonic wars and the early emancipation of the Jews, a figure who met and corresponded with some of the most celebrated authors, artists, and politicians of her time. She documents Rahel's attempts to earn legitimacy as a writer and gain access to the highest aristocratic circles, to assert for herself a position in German culture in spite of her gender and religion.Arendt had almost completed a first draft of her book on Rahel by 1933 when she was forced into exile by the National Socialists. She continued her work on the manuscript in Paris and New York, but would not publish the book until 1958. Rahel Varnhagen became not just a study of a historical Jewish figure, but a poignant reflection on Arendt's own life and times, her first exploration of German-Jewish identity and the possibility of Jewish life in the face of unimaginable adversity.For this first complete critical edition of the book in any language, Liliane Weissberg reconstructs the notes Arendt planned for Rahel Varnhagen but never fully executed. She reveals the extent to which Arendt wove the biography largely from the words of Rahel and her contemporaries. In her extended introduction, Weissberg reflects on Rahel's writings and on the importance of this text in the development of Arendt's political theory. Weissberg also reveals the hidden story of how Arendt manipulated documents relating to Rahel Varnhagen to claim for herself a university position and reparation payments from the postwar German state.",
  "genres": [
    "Biography",
    "Nonfiction",
    "History",
    "Jewish",
    "Philosophy",
    "German Literature",
    "Germany"
  ],
  "author": "Hannah Arendt",
  "average_rating": "3.74",
  "url": "https://www.goodreads.com/book/show/344043.Rahel_Varnhagen"
}