{
  "title": "The Indigo Girl",
  "description": "An incredible story of dangerous and hidden friendships, ambition, betrayal, and sacrifice.The year is 1739. Eliza Lucas is sixteen years old when her father leaves her in charge of their family's three plantations in rural South Carolina and then proceeds to bleed the estates dry in pursuit of his military ambitions. Tensions with the British, and with the Spanish in Florida, just a short way down the coast, are rising, and slaves are starting to become restless. Her mother wants nothing more than for their South Carolina endeavor to fail so they can go back to England. Soon her family is in danger of losing everything.Upon hearing how much the French pay for indigo dye, Eliza believes it's the key to their salvation. But everyone tells her it's impossible, and no one will share the secret to making it. Thwarted at nearly every turn, even by her own family, Eliza finds that her only allies are an aging horticulturalist, an older and married gentleman lawyer, and a slave with whom she strikes a dangerous deal: teach her the intricate thousand-year-old secret process of making indigo dye and in return -- against the laws of the day -- she will teach the slaves to read.So begins an incredible story of love, dangerous and hidden friendships, ambition, betrayal, and sacrifice.Based on historical documents, including Eliza's letters, this is a historical fiction account of how a teenage girl produced indigo dye, which became one of the largest exports out of South Carolina, an export that laid the foundation for the incredible wealth of several Southern families who still live on today. Although largely overlooked by historians, the accomplishments of Eliza Lucas influenced the course of US history. When she passed away in 1793, President George Washington served as a pallbearer at her funeral.This book is set between 1739 and 1744, with romance, intrigue, forbidden friendships, and political and financial threats weaving together to form the story of a remarkable young woman whose actions were before their time: the story of the indigo girl.",
  "genres": [
    "Historical Fiction",
    "Book Club",
    "Fiction",
    "Historical",
    "Audiobook",
    "Romance",
    "Adult"
  ],
  "author": "Natasha Boyd",
  "average_rating": "4.21",
  "url": "https://www.goodreads.com/book/show/34412073-the-indigo-girl"
}