{
  "title": "Faces from the Front: Harold Gillies, The Queen’s Hospital, Sidcup and the origins of modern plastic surgery",
  "description": "Faces from the Front examines the British response to the huge number of soldiers who incurred facial injuries during the First World War. These injuries were produced within a short time span, but (for the first time in a major conflict) did not necessarily lead to death due to developments in anesthesia and improvements in the treatment of infection and blood loss. Casualties were evacuated back to England, where surgeons had an opportunity to develop their skills on a large patient caseload. Harold Gillies, an ambitious young surgeon, developed a new branch of plastic surgery of the face. In 1915, Gillies set up a dedicated ward for patients with facial injuries at the Cambridge Military Hospital in Aldershot, Hampshire. Following the Battle of the Somme and the escalation in the number of casualties with facial injuries, steps were taken to establish a new hospital entirely focused on the treatment of facial injuries at Sidcup in South-East London. The Queen’s Hospital treated more than 5,000 patients between its opening in August 1917 and the mid-1920s; its work was mainly funded by charitable donations. The book uncovers the history of this hospital by analyzing a wide range of sources – including numerous photographs and paintings – which detail the experiences of patients and staff.A team of surgeons and other specialized staff were brought together at Sidcup who, like the hospital’s patients, came from Britain, New Zealand, Australia, Canada and the US. The book argues that the development and refinement of new surgical techniques was helped by a multidisciplinary approach. Detailed patient records - combined with notes, photographs and paintings - were used to evaluate the efficacy of experimental procedures and to educate new surgeons. Treatment often involved multiple operations and took place over long periods of time, and considerable thought was given to the recovery and rehabilitation of patients. The Queen’s Hospital had two important first, it played a pivotal role in the development of modern medical practice by paving the way for a new surgical specialty – plastic surgery – and by showcasing the benefits of specialist hospitals and multi-disciplinary services; second, the reconstruction of damaged faces had a major impact on the patients themselves. Drawing on a unique collection of personal and family accounts of the post-war lives of patients treated at Sidcup, the author explores surgical and aesthetic outcomes and the emotional impact of facial reconstruction.",
  "genres": [
    "Nonfiction",
    "War"
  ],
  "author": "Andrew Bamji",
  "average_rating": "4.55",
  "url": "https://www.goodreads.com/book/show/34416475-faces-from-the-front"
}