{
  "title": "Sherlock Holmes: The Definitive Audio Collection",
  "description": "71 hrs 58 minsEver since he made his first appearance in A Study In Scarlet, Sherlock Holmes has enthralled and delighted millions of fans throughout the world. Now Audible is proud to present Arthur Conan Doyle's Sherlock Holmes: The Definitive Collection, read by Stephen Fry. A lifelong fan of Doyle's detective fiction, Fry has narrated the complete works of Sherlock Holmes - four novels and five collections of short stories. And, exclusively for Audible, Stephen has written and narrated nine insightful, intimate and deeply personal introductions to each title.He writes: \"Popular fiction offers different kinds of superheroes to save the world by restoring order to the chaos, confusion and criminality of our times. Heroes with remarkable gifts are as in vogue now as they have been since they first appeared, perhaps even more in vogue. But although the very first one was launched in serial published form just like his masked and body-suited successors, it was not in DC or Marvel comic books that he made his appearance; rather it was in the sedate and respectable pages of Mrs Beeton's Christmas Annual in the mid-Victorian year 1887.\"Stephen Fry is an English actor, screenwriter, author, playwright, journalist, comedian, television presenter, film director and all round national treasure. He is the acclaimed narrator of J.K. Rowling's Harry Potter audiobooks and most recently recorded The Tales of Max Carrados for Audible Studios. Stephen has contributed columns and articles to newspapers and magazines, appears frequently on radio and has written four novels and three volumes of autobiography.A Study in ScarletThe Sign of FourThe Adventures of Sherlock HolmesThe Memoirs of Sherlock HolmesThe Hound of the BaskervillesThe Return of Sherlock HolmesThe Valley of FearHis Last BowThe Casebook of Sherlock Holmes",
  "genres": [
    "Classics",
    "Mystery",
    "Fiction",
    "Crime",
    "Short Stories",
    "Audiobook",
    "Detective"
  ],
  "author": "Arthur Conan Doyle",
  "average_rating": "4.50",
  "url": "https://www.goodreads.com/book/show/34429916-sherlock-holmes"
}