{
  "title": "Time's Betrayal",
  "description": "Time's Betrayal is an epic multigenerational family saga covering the years from the battle of Antietam to the fall of the Berlin Wall. Touching on elements in John le Carr's A Perfect Spy and John Knowles's A Separate Peace, the novel chronicles a son's search for a larger-than-life father, a CIA agent who disappeared in the early fifties, leaving behind a distraught wife and lovers, not to mention a Pandora's box of devastating secrets and unanswered questions that baffled all who investigated his fate--a fate as beguiling as it is mysterious. This is also a story about the crumbling edifice of the eastern Establishment after World War II and in Vietnam-era America. A poignant coming-of-age tale, it is related though the eyes of Peter Alden, whose school days are shattered when he overhears a conversation about his father from two CIA colleagues: how John Alden, a world-famous archaeologist turned OSS and CIA officer, who vanished through Checkpoint Charlie, may have been a traitor.Opening in New England during the late 1960s and set amid the idyllic Berkshire summer homes of the Alden and Williams clans, founders of the prestigious powerhouse school Winsted, incubator of famous statesmen and CIA operatives, Time s Betrayal takes the reader on a far-flung journey from the abolitionist Civil War era to Nazi-occupied Greece and to London during the Blitz, to the darkest days of the Cold War and Vietnam, to Prague during the Velvet Revolution, and timeless Venice. More than just an insider s chronicle of America s postwar ascendency and ensuing decline and the betrayals of love and principle that come in the wake of blind ambition--Time's Betrayal portrays the agonized compromises to America's founding ideals as glimpsed through the privileged lives of the country's best and brightest. Tapping into spy thriller territory, and the KGB penetration of American secrets by Kim Philby and the Cambridge Five, the narrative unfolds through a series of engrossing, if agonizing, love stories that cross the boundaries of generations in ways both profoundly unsettling and deeply moving. Although Time's Betrayal is a literate genre-bender and suspenseful page-turner full of twists and turns, the novel is really about how family history shapes who we are and how memory -- the river of Time-- guides our joint destinies, testing our most cherished hopes, shaping who we are and what we believe, and teaching us that the essential truths of our humanity--freedom, justice, love, and honor--must be reclaimed in every generation.",
  "genres": [
    "Historical Fiction"
  ],
  "author": "David Adams Cleveland",
  "average_rating": "4.09",
  "url": "https://www.goodreads.com/book/show/34416745-time-s-betrayal"
}