{
  "title": "My Leading Man",
  "description": "There’s no forgetting your first love.\n  It’s been twelve years since the boy next door disappeared from Steven Neeson’s life, but he’s never been able to forget the promise they made to each other. Since then, Steven has been lost on his path through life, suffering through stagnation and the inability to follow his desire to become a writer. When he learns that his old neighbor grew up to become a famous movie star, Steven decides to risk everything and leave his life behind. Screenplay in hand, it’s off to LA for a chance at the big time—and to reunite with his childhood sweetheart.  \n“I moved on. I had to move on.”\n  Kalvin Hinderbrook is Hollywood’s hottest new leading man and most eligible bachelor. He’s spent his entire career avoiding romance in order to keep his orientation hidden, afraid that coming out of the closet would kill his chances to reach the A-List. It’s been easy for him to sacrifice love for acting, but that all changes when he shows up in town.  \nI could still bring it all back as if it were yesterday.\n  In just one passionate night, their reunion breaks every wall Kalvin set up to protect himself, but he can’t afford to fall for Steven again. He’s about to take on the biggest role of his career, and he’s sacrificed too much to let it all crumble now—so why can’t he control these feelings he thought were long gone? They once believed they would be together forever. Can old love be strong enough to transcend the challenge of time?  \nMy Leading Man\n is a 40,000 word steamy MM contemporary romance. This page turner has has no cliffhangers, no cheating, and a guaranteed happily ever after.  \nMy Leading Man\n is the first book in a new Harper Logan series, The Neeson Boys, which features Steven, Gavin and Jay Neeson. Each book can be read as a standalone story, but is more enjoyable when read as a full trilogy!",
  "genres": [
    "M M Romance",
    "Romance",
    "Friends To Lovers",
    "LGBT",
    "Contemporary",
    "Gay",
    "Contemporary Romance"
  ],
  "author": "Harper Logan",
  "average_rating": "3.87",
  "url": "https://www.goodreads.com/book/show/34427268-my-leading-man"
}