{
  "title": "Alcatraz vs. The Evil Librarians Series",
  "description": "This discounted ebundle Alcatraz vs. The Evil Librarians, The Scrivener's Bones, The Knights of Crystallia, The Shattered Lens, The Dark Talent An action-packed fantasy adventure series by the #1 New York Times bestselling author Brandon Sanderson. Alcatraz Smedry and his family and friends must battle a cult of evil Librarians bent on taking over the world through misinformation and suppressing the truth. Alcatraz vs. the Evil Librarians — On his thirteenth birthday, foster child Alcatraz Smedry gets a bag of sand in the mail-his only inheritance from his father and mother. It is quickly stolen by the cult of Evil Librarians. Alcatraz must stop them, using the only weapon he an incredible talent for breaking things. The Scriveners Bones — In his second skirmish against the Evil Librarians who rule the world, Alcatraz and his ragtag crew of freedom fighters track Grandpa Smedry to the ancient and mysterious Library of Alexandria. Can Alcatraz and his friends rescue Grandpa Smedry and make it out of there alive? The Knights of Crystallia — Alcatraz Smedry has made it to the Free Kingdoms at last. Unfortunately, so have the Evil Librarians—including his mother! Now Alcatraz has to find a traitor among the Knights of Crystallia, make up with his estranged father, and save one of the last bastions of the Free Kingdoms from the Evil Librarians.The Shattered Lens — Alcatraz Smedry is up against a whole army of Evil Librarians with only his friend Bastille, a few pairs of glasses, and an unlimited supply of exploding teddy bears to help him. This time, even Alcatraz's extraordinary talent for breaking things may not be enough to defeat the army of Evil Librarians and their giant librarian robots.The Dark Talent — Alcatraz Smedry has successfully defeated the army of Evil Librarians and saved the kingdom of Mokia. Too bad he managed to break the Smedry Talents in the process. Even worse, his father is trying to enact a scheme that could ruin the world, and his friend, Bastille, is in a coma. Without his Talent to draw upon, can Alcatraz figure out a way to save Bastille and defeat the Evil Librarians once and for all?At the Publisher's request, this title is being sold without Digital Rights Management Software (DRM) applied.",
  "genres": [],
  "author": "Brandon Sanderson",
  "average_rating": "4.56",
  "url": "https://www.goodreads.com/book/show/34426511-alcatraz-vs-the-evil-librarians-series"
}