{
  "title": "Demon Spear",
  "description": "Demons. Death. Deliverance. All these Issa must face as darkness strikes into the heart of their last stronghold. Greater demons are rising from the Pit, Carvon is brutally attacked, and a horrifying murder forces her and her companions to flee. Despite their devastating loss, Issa must keep her oath to the Shadow Demons and alone reclaim the mighty spear of legend that can save them. But to find Velistor, she must venture deep into The Murk and face all the might of the Demon Wizard Karhlusus. Asaph’s destiny calls to him, but it will take an ancient, awakening dragon and a terrible price to free himself from Cirosa’s deadly chains. All around there is war and chaos but the dark moon is rising once more to spread its light upon the world. With its power Issa has a chance to stand against the darkness and fight the terrifying evil rising from the Abyss. Demon Spear is the fourth novel in Araya Evermore's gripping, bestselling fantasy series, The Goddess Prophecies . With much-loved characters, breath-taking scenes and fast-paced action, it's easy to see why Evermore's books have been downloaded tens of thousands of times. What reviewers and readers are saying: ★★★★★ \"My 2nd favorite author. Tolkien is my first.\" ★★★★★ \"Your books are better than David Eddings\" ★★★★★ \"Superbly written epic fantasy.\" ★★★★★ \"I loved this book!\" ★★★★★ \"Made me cry a few times but this is what makes a great book.\" ★★★★★ \"Couldn't put it down, highly recommended.\" ★★★★★ \"Love. Finding strength. Dragons. High Magic. Intrigue.\" ★★★★★ \"Definitely not your cliché fantasy novel. A book with a difference.\" ★★★★★ \"Deep, moving, a great read!\" ★★★★★ \"Incredibly inspiring.\" ★★★★★ \"The series is my all-time favourite fantasy series now (and I have read an awful lot of them!). Beautiful and evocative writing, great characters, a fantastic cosmology, and truly epic world-building that is breathtaking in scope. Well done indeed!\" ★★★★★ \"Like the fulfilling high fantasy stories of old, this book is filled with the best the genre has to offer; swords, dragons, witches and wizards, shapeshifters, and epic battles - with a touch of romance...\"",
  "genres": [
    "Fantasy"
  ],
  "author": "Araya Evermore",
  "average_rating": "4.60",
  "url": "https://www.goodreads.com/book/show/34429901-demon-spear"
}