{
  "title": "Life 3.0: Being Human in the Age of Artificial Intelligence",
  "description": "DAILY TELEGRAPH AND THE TIMES BOOKS OF THE YEAR 2017\n\n'This is the most important conversation of our time, and Tegmark's thought-provoking book will help you join it' Stephen Hawking'This is a rich and visionary book and everyone should read it' The TimesWe stand at the beginning of a new era. What was once science fiction is fast becoming reality, as AI transforms war, crime, justice, jobs and society-and, even, our very sense of what it means to be human. More than any other technology, AI has the potential to revolutionize our collective future - and there's nobody better situated to explore that future than Max Tegmark, an MIT professor and co-founder of the Future of Life Institute, whose work has helped mainstream research on how to keep AI beneficial.In this deeply researched and vitally important new book, Tegmark takes us to the heart of thinking about AI and the human condition, bringing us face to face with the essential questions of our time. How can we grow our prosperity through automation, without leaving people lacking income or purpose? How can we ensure that future AI systems do what we want without crashing, malfunctioning or getting hacked? Should we fear an arms race in lethal autonomous weapons? Will AI help life flourish as never before, or will machines eventually outsmart us at all tasks, and even, perhaps, replace us altogether?Life 3.0 gives us the tools to join what may be the most important conversation of our time, guiding us through the most controversial issues around AI today -- from superintelligence to meaning, consciousness and the ultimate physical limits on life in the cosmos.What sort of future do you want?",
  "genres": [
    "Science",
    "Nonfiction",
    "Artificial Intelligence",
    "Technology",
    "Philosophy",
    "Audiobook",
    "Computer Science"
  ],
  "author": "Max Tegmark",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/34443974-life-3-0"
}