{
  "title": "Seizing Destiny: How America Grew from Sea to Shining Sea",
  "description": "Within 91 years of its creation as a fragile republic without a working government (or even a plan for one), a professional army, or any money in its treasury, the United States amassed a transcontinental domain of 3.7 million square miles, making it the world’s fourth largest nation. No other country or sovereign power has ever grown so big so fast or become so rich and so powerful. Now, for the first time in a single volume, Richard Kluger chronicles this remarkable achievement in a compelling narrative without flinching from the moral lapses of the victors.Seizing Destiny is a sweeping chronicle of how the vast territory of the United States was assembled to accommodate the aspirations of its people regardless of who objected. It is a remarkable story of how Americans extended their sovereignty from the Atlantic coastline to the mid-Pacific in a surge to dominion that was equally admirable and appalling. The nation’s pioneer generations were, to be sure, blessed with remarkable energy, fortitude, and boundless faith in their own prowess. They were also grasping opportunists, ravenous in their hunger to possess the earth, who justified their sometimes brutal aggression by demeaning the humanity of the nonwhites they encountered in or imported to the New World.These visionary nation-builders proclaimed earnestly, if not quite so innocently, their own rectitude as the force behind the heroic taming of the wilderness and saw in this triumph the hand of Providence. Their good fortune in coming upon this vast, fertile virgin land was thus transformed into a mission of continental entitlement – their “manifest destiny,” as they began calling it well after the process was under way. Yet declaring it their God-given blessing did not make it so. As we see, luck and their foes’ collective weaknesses played no less a role.In a compelling drama, vivid with humanizing detail, we watch three of the most brilliant Founding Fathers – Benjamin Franklin, John Jay, and John Adams – outmaneuver British, French, and Spanish diplomats in Paris to gain far broader boundaries for the new republic than their European adversaries had desired. Finesse, however, had little to do with General Andrew Jackson’s Indian-slaughtering and disdain for the feeble Spanish garrison in capturing Florida. Or with Secretary of State John Quincy Adams’s bluff and bluster in gaining for the nation a northwest passage to the Pacific. Or with how the single-minded James Polk, as devious and manipulative as he was bold and resolute, confected a war with Mexico and thereby amassed more land than any other U.S. President.We learn why the nation’s most celebrated acquisition, France’s Louisiana Territory, had little to do with Thomas Jefferson’s vision and everything to do with Napoleon Bonaparte’s failure to subdue black freedom fighters in the jungles of Haiti. We learn how Sam Houston tried vainly to prevent the predictably suicidal defense of the Alamo before he could rally rowdy Texans to win their independence. And how William Seward, in just one frenetic week, overcame political disrepute and converted a hostile U.S. Senate to approve his secret deal with tsarist Russia to buy the seemingly useless wasteland of Alaska. And how coyly Teddy Roosevelt connived with Panamanian rebels to gain control over a strip of jungle for a great canal to enhance America’s economic growth.Comprehensive and balanced, Seizing Destiny is an eye-opening reinterpretation of American history, revealing great accomplishments along with a national tendency to confuse good fortune with pretensions of moral superiority.",
  "genres": [
    "History",
    "American History",
    "Nonfiction",
    "Americana",
    "American"
  ],
  "author": "Richard Kluger",
  "average_rating": "3.99",
  "url": "https://www.goodreads.com/book/show/1207381.Seizing_Destiny"
}