{
  "title": "Rutherford B. Hayes: Warrior and President",
  "description": "Who was the real Rutherford B. Hayes? Was he a great or inconsequential president? How did his early life and career shape his later years? How did his triumphs and failures alter our history? And why should we care? Ari Hoogenboom's masterful life of Hayes definitively answers those questions and shows why our nineteenth president deserves far greater recognition than he's received in the past.The first biography of Hayes in nearly fifty years, Hoogenboom's book recreates the rapidly changing world of Victorian America as experienced by one of its most reflective and perceptive figures. The Hayes that emerges is a much more progressive and far-sighted leader than previously suggested. He was, Hoogenboom argues, neither a Southern sympathizer nor an exemplar of the \"Greedy Gilded Age.\" Rather, he was a devout, pragmatic champion of equal rights.Hayes's colorful life was rooted in his frontier experiences in Ohio and galvanized on Civil War battlefields, where he survived five wounds and was ultimately promoted to major general. No other president was under fire on the front lines as much as Hayes. Hayes's image as president (1877-1881), however, has not been quite so shining. He has been blamed for Reconstruction's failure and damned for an apparent bargain that guaranteed his election in exchange for withdrawing military support of Republican governments in the South. He has also been criticized for championing the gold standard, for breaking the Great Strike of 1877, for inconsistent support of civil-service reform, and for being an ineffectual politician.Hoogenboom contends that these evaluations are largely false. Previous scholars, he says, have failed to appreciate Hayes's limited options and have misrepresented his actions in their depictions of an overly cautious, nonvisionary president. In fact, he was strikingly modern in his efforts to enlarge the power of the office, which he used as his own bully pulpit to rouse public support for his goals. Chief among these goals, Hoogenboom shows, was equality for all Americans. Throughout his presidency and long afterwards, Hayes worked steadfastly for reforms that would encourage economic opportunity, distribute wealth more equitably, diminish the conflict between capital and labor, and ultimately enable African-Americans to achieve political equality. Although he fell far short of his ideals, his unwavering commitment deserves our attention and respect.",
  "genres": [
    "Presidents",
    "Biography",
    "History",
    "Nonfiction",
    "Us Presidents",
    "American History",
    "Politics"
  ],
  "author": "Ari Hoogenboom",
  "average_rating": "3.89",
  "url": "https://www.goodreads.com/book/show/344440.Rutherford_B_Hayes"
}