{
  "title": "The Border Outlaws: An Authentic and Thrilling History of the Most Noted Bandits of Ancient Or Modern Times: The Younger Brothers, Jesse and Frank James, and Their Comrades In Crime",
  "description": "Jesse James, Frank James and the Younger brothers were some of the most notorious outlaws of nineteenth century America. They terrorized the towns and countryside across the West, robbing banks, committing murders, holding up stage coaches and stealing from helpless citizens. The story of these infamous villains begins with the outbreak of the American Civil War when the Younger brothers signed up for the Confederacy to fight in Quantrill’s vicious band of guerrillas. Buel takes the reader through the actions undertaken by the group as they fought for the South in quick lightning strikes against the armies of the North, developing tactics that would come in useful in their later lives. After the end of the war Buel explains how the gang slipped effortlessly from guerrilla warfare to bank robberies, evading capture and killing opponents. They could not evade lawmen and vigilantes forever, Buel explains in vivid detail the gang’s eventual demise. The Border Outlaws is essential reading for anyone interested in the American Civil War and the actions of Quantrill’s raiders as well as outlaws of the Old West. The authority of this work is explain by Paul Iselin Wellman in A Dynasty of Western “This may be the first of the books published about the James and Younger outlaws … Buel had no illusions about them. He names names and quotes dates. At times he includes contemporary newspaper accounts. At others he cites correspondence of the outlaws themselves, to relatives or friends, and in some instances to himself.” “It is the best source material we have.” Outlaws on Horseback, Harry Sinclair Drago James W. Buel was a journalist, based initially in Kansas City and later in St. Louis. He wrote over fifty books during his lifetime on the wilds of Africa and the American West. The Border Outlaws was first published in 1881. He died in San Diego, California, in 1920.",
  "genres": [
    "History",
    "Nonfiction",
    "Westerns",
    "Biography"
  ],
  "author": "James William Buel",
  "average_rating": "3.95",
  "url": "https://www.goodreads.com/book/show/34444339-the-border-outlaws"
}