{
  "title": "The Restorer",
  "description": "After a year apart, Maryanne returns to her husband, Roy, bringing their eight-year-old son Daniel and his teenage sister Freya with her. The family move from Sydney to Newcastle, where Roy has bought a derelict house on the coast. As Roy painstakingly patches the holes in the floorboards and plasters over cracks in the walls, Maryanne believes, for a while, that they can rebuild a life together.But Freya doesn’t want a fresh start—she just wants out—and Daniel drifts around the sprawling, run-down house in a dream, infuriating his father, who soon forgets the promises he has made.Some cracks can never be smoothed over, and tension grows between Roy and Maryanne until their uneasy peace is ruptured—with devastating consequences.Michael Sala was born in the Netherlands in 1975 to a Greek father and a Dutch mother, and first came to Australia in the 1980s. He lives in Newcastle. His critically acclaimed debut, The Last Thread, won the 2013 NSW Premier's Award for New Writing and was the regional winner (Pacific) of the 2013 Commonwealth Book Prize.‘There is so much to praise about this book. Michael Sala’s prose is clear and unadorned, the setting exquisitely rendered, but it is the characters - Freya, Maryanne, Roy and Daniel - all of them flawed and complex and deeply, deeply human, who will stay with me for a very long time. I would defy anyone to read their story and remain unmoved. The Restorer is an incredibly powerful novel and, I believe, an important one.’ Hannah Kent‘Michael Sala is a sensitive, perceptive observer of human relationships and I have long admired his work. The Restorer is a beautifully written novel about growing up, starting again—and how the riptide of personal history can pull us further and further from safety, no matter how hard we fight.’ Charlotte Wood ‘A wise and timely novel that builds and breaks like a summer storm—just as beautiful, just as brutal.’ Fiona McFarlane‘Sala’s story of mundane domestic tension explodes in ways both already anticipated and powerfully surprising. The narrative is real, compelling, sophisticated and deeply human. Having read this work, I will certainly seek out Sala’s debut novel, and watch with interest for new works from this gifted creator. Strongly recommended.’ 4ZZZ‘This is powerful, poetic, extraordinary fiction…Sala never falters.’ Australian ‘Unputdownable…Sala creates an atmosphere of simmering tension with an undercurrent of unpredictability that seeps into every exchange. [He] is a brilliant writer.’ Saturday Paper ‘Closely observed, with the visceral force of truth, Michael Sala’s heartbreaking novel captures the tender hope of love and its terrible cost.’ Kathryn Heyman‘Recommended for readers of literary fiction who appreciate exploring the darker realities of Australian life now and in our not-so-distant past.’ Books + Publishing‘Sala’s account is sophisticated and shows the immense complexity of relationships.’ Good Reading ‘Sala’s second novel is assured and polished and adds potency to the outcry against domestic violence.’ Herald Sun ‘Michael Sala’s beautifully shaped second novel glows with all the complicated pain and joy of being human…A tremendous depth of insight and compassion on the part of the writer informs the three main characters&hellip",
  "genres": [
    "Australia",
    "Family",
    "Contemporary",
    "Book Club",
    "Literature",
    "Crime",
    "Fiction"
  ],
  "author": "Michael Sala",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/34452901-the-restorer"
}