{
  "title": "Lemurian Medium",
  "description": "This is an alternate Cover Edition for ASIN: B00HE18XES.Rachel thought: \"Oh brother, she really was ill-equipped for this, but too late for remedial space alien protocol. Worse yet, she was the alien!\" Reluctant Medium Rachel Blackstone watches in horror as a friend vanishes into a painting at a posh Santa Fe gallery. Unable to find her by normal methods, the reporter must look for her via the astral plane. There she will meet her most frightening nemesis and defend herself on the Terror of the Threshold. Will it be the Mesoamerican deity who enjoys human snacks or the evil spirit she crossed paths with before? What she doesn't expect is to land in an ancient civilization intent on keeping her--and her unproven powers. Part of this territory is inhabited by gentle people, flora and fauna that communicate telepathically. But the other residents are decidedly ruthless. Legend says the lost continent of Lemuria sank eons ago. Rachel's visit must be brief or she could be caught up in the cataclysm. She employs crystal power to help her communicate with friend Chloe back home in New Mexico and to defend herself from cosmological attacks. In Santa Fe, Chloe and soul navigator F Dominic Magellan search frantically for the body of their friend in its altered state. They must return it to the art gallery so she can reclaim it. That proves difficult when they run across someone, or something, who will do anything to stop them. On the astral plane, Rachel has to multitask, coping with earthquakes and volcanoes as the end of the long-lost culture is set in motion, all while staging the rescue of her friend. Catching the red-eye home to the 21st century could prove difficult as she desperately looks for a way to escape a violent society. They must find Rachel's silver cord or they cannot return. Can Rachel become a successful astral-naut? Or will she be forever lost in the cosmos? Extras: Christmas Eve Canyon Road Farolito Walk, a ghost hunting assignment. Contains: mild horror effects, profanity, humor.",
  "genres": [
    "Mystery",
    "Paranormal",
    "Fantasy"
  ],
  "author": "G.G. Collins",
  "average_rating": "3.94",
  "url": "https://www.goodreads.com/book/show/34454119-lemurian-medium"
}