{
  "title": "Resilience",
  "description": "THE FINAL SHOWDOWN IS NEAR…BUT WHO IS THE REAL ENEMY?Auryn Hadley’s sixth action-adventure in The Rise of the Iliri fantasy series asks how far mankind will go to protect their pride. Because it seems they’ll guard it at the expense of all else. In an epic reminiscent of a furistic Lord of the Rings, it’s the iliri—now a rising, formidable race of underdogs—who must decide whether to risk their lives for the ungracious human race. Unbeknownst to humans, their fate lies in the capable hands the iliri leader, the powerful Salryc Luxx. And she’s no longer willing to be yanked around at any price.Sal has been summoned to a meeting with Parliament representatives of the Conglomerate of Free Citizens. But this time, she’s not serving as their slave. Nor is she about to be captured and brought to trial again. Now she knows she has the upper hand.The enemy Terrans have besieged Eastward, engaging in brutal guerilla tactics throughout the country—hitting without mercy and killing all in their path. The world of humans is desperate.“Tell me why I should send my brothers and sisters to die for humans that care so little for us?” Sal asks. The answer she’s searching for comes from a frail iliri servant, whose telltale snow-colored skin is almost as light as Sal’s: If she leaves the humans to die by the Terrans, war and enslavement will continue. History will repeat itself. But if it’s the iliri and their allies who manage to defeat evil, perhaps humans can learn to respect them.She knows she isn’t finished fighting. Iliri warriors haven’t yet “done enough.” Not while so many of their brothers are still enslaved.Alongside her faithful friends and leaders--and the tireless Black Blades—Sal must choose whether to surrender to her role as their leader and contend with The Emperor’s murderous army—as well as the treacherous pride of the human race.As always, women readers will thrill to the reverse harem idea that pushes the boundaries of epic fantasy in this breathtaking series that may remind some of Avatar without the scary beasts; or even Game Of Thrones, but happier, with more color—plus a dazzling female protagonist and plenty of action. Fans of Anne McCaffrey’s Dragonriders of Pern will find Sal’s planet Ogun a thrilling destination for their next fantasy fix.Like all the books on this series, Tenacity is a complete novel, not a cliffhanger. And because the illiri have insatiable and exotic sexual instincts, the smoking hot sex may make it unsuitable for humans under 18.",
  "genres": [
    "Reverse Harem",
    "Fantasy",
    "Romance",
    "Science Fiction",
    "Paranormal",
    "Aliens",
    "Military Fiction"
  ],
  "author": "Auryn Hadley",
  "average_rating": "4.59",
  "url": "https://www.goodreads.com/book/show/34452452-resilience"
}