{
  "title": "Journey to Health: A Journey Worth Taking: Cooking Keto with Kristie",
  "description": "This cookbook was written to help others make a ketogenic or very low carb diet a lifetime commitment. After a lifetime of obesity, following this way of eating began as a desperate plan to lose weight and evolved into a journey to manage my health and not just my weight. While I enjoy eating the best foods of my life and losing weight, I also have come to appreciate that my overall health has improved. I no longer need any of the four medications that I was on before I started keto. I no longer wait in the car or at the hotel while my family hikes. Now I’m the one who suggests that we go for walk or go kayaking or play at the pool. My husband and I have been on a ketogenic diet since June 2013, yet one of our physicians still asks whether this “diet” is sustainable in spite of our having lost a combined 180 lbs! Moreover, my husband's blood pressure has gone from the verge of needing medication to being low normal. Still, the physician asks if we can sustain it long term. In fact, more than one medical professional has told me that this way of eating is “too difficult to follow” or “too restrictive”. One of the goals of this cookbook is to prove that notion wrong. This cookbook has the \"everyday\" recipes that my family and I have enjoyed on our very own journey to health. There are some low carb “treat”, but the majority of the recipes in this book are the simple recipes that have become part of our day to day lives. There are delicious, filling breakfasts that will keep your tummy happy when it’s tired of scrambled eggs and bacon and hearty sides that will never make you feel deprived. This is “diet” food that you will be proud to share at any potluck and your “carbivore” friends will expect you to share! I snuck in a few very low carb treats for birthdays, holidays, or special occasions because these are the foods with which we have also celebrated on our journey. It is my sincere wish that these recipes can help you sustain a very low carb diet as a delicious life style.",
  "genres": [
    "Cookbooks",
    "Cooking",
    "Nonfiction",
    "Health"
  ],
  "author": "Kristie Sullivan",
  "average_rating": "4.50",
  "url": "https://www.goodreads.com/book/show/34460251-journey-to-health"
}