{
  "title": "I'm Only Here for the Beard",
  "description": "Sean is a man with needs—needs that a lot of women were ready and willing to fulfill. Yet, the only woman that he wants to fulfill them dumped him for another man. A man who’s a member of his MC and is someone he has to see every single day and twice on Sundays.  He’s bitter and angry. He’s definitely not in the right frame of mind when it comes to dealing with women. Which is unfortunate for his new partner, Naomi, a fresh-out-of-school and totally green paramedic.  ---  Naomi’s got enough problems on her plate. A brother who’s self-destructive and doesn’t care who he takes down with him. A man who she’s in love with but who doesn’t love her. A job that she hates because it is a constant reminder of what she can’t have.  Desperate to distance herself from her problems, she runs, taking the first job in her field that she finds willing to take on someone with so little experience.  The last thing she needs is a perpetually pissed off partner, especially when he sets her blood on fire.  But life doesn’t ask how much you can handle when it dishes out challenges. It just keeps piling them on until you’ve bested them or you’ve buckled under them.  ---  Sean really doesn’t want to like his new partner, Naomi. He just wants to be left alone to live his life however he damn well pleases and without complications.  Naomi doesn’t care what he wants, she can’t be anything but herself. It isn’t long before she’s breaking down his walls and making him feel again. She’s trying to pull him closer and he’s pushing her away.  It’s not long before Sean sees the error of his ways.  It’s too bad, though, that by the time he realizes she’s the one, Naomi’s already gone.",
  "genres": [
    "Romance",
    "Contemporary",
    "Contemporary Romance",
    "Audiobook",
    "Military Fiction",
    "Suspense",
    "Romantic Suspense"
  ],
  "author": "Lani Lynn Vale",
  "average_rating": "4.37",
  "url": "https://www.goodreads.com/book/show/34455870-i-m-only-here-for-the-beard"
}