{
  "title": "Perennials",
  "description": "When two estranged sisters reunite for their parents’ 50th anniversary, a family tragedy brings unexpected lessons of hope and healing amid the flowers of their mother’s perennial garden.Eva—known to all as Lovey—grew up in Oxford, MS, surrounded by literary history and her mother's stunning perennial gardens. But a garden shed fire and the burns suffered by one of her best friends seemed to change everything. Her older sister Bitsy blamed her for the fire—and no one spoke up on her behalf. Bitsy the cheerleader, Bitsy the homecoming queen, Bitsy married to a wealthy investor. And all the while, Lovey blamed for everything that goes wrong.At eighteen, Lovey turns down a marriage proposal, flees from Oxford and the expectations of attending Ole Miss, and instead goes to Arizona—the farthest thing from the South she can imagine. She becomes a successful advertising executive, a weekend yoga instructor, and seems to have it all together. But she's alone. And on her 45th birthday, she can't help but wonder what's wrong.When she gets a call from her father—still known to everyone as Chief from his Ole Miss football days—insisting that she come home three weeks early for her parents' 50th wedding anniversary celebration, she's at wits end. She's about to close the biggest contract of her career, the one that will secure her financial goals and set her up for retirement. But his words, \"Family First,\" hit too close to home. Is there hope for her estranged relationship with Bitsy after all this time?Eva's journey home, to the memory garden her father has planned as an anniversary surprise for her mother, becomes one of discovering roots, and truth, and love, and what living perennially in spite of disappointments and tragedy really means. Eva thought she wanted to leave her family and the South far behind . . . but she's realizing she hasn't truly been herself the whole time she's been gone.",
  "genres": [
    "Fiction",
    "Audiobook",
    "Southern",
    "Contemporary",
    "Christian Fiction",
    "Chick Lit",
    "Book Club"
  ],
  "author": "Julie Cantrell",
  "average_rating": "3.87",
  "url": "https://www.goodreads.com/book/show/34460615-perennials"
}