{
  "title": "Why Are Faggots So Afraid of Faggots?: Flaming Challenges to Masculinity, Objectification, and the Desire to Conform",
  "description": "Gay culture has become a nightmare of consumerism, whether it's an endless quest for Absolut vodka, Diesel jeans, rainbow Hummers, pec implants, or Pottery Barn. Whatever happened to sexual flamboyance and gender liberation, an end to marriage, the military, and the nuclear family? As backrooms are shut down to make way for wedding vows, and gay sexual culture morphs into “straight-acting dudes hangin’ out,” what are the possibilities for a defiant faggotry that challenges the assimilationist norms of a corporate-cozy lifestyle?Why Are Faggots So Afraid of Faggots? challenges not just the violence of straight homophobia but the hypocrisy of mainstream gay norms that say the only way to stay safe is to act straight: get married, join the military, adopt kids! Mattilda Bernstein Sycamore reinvokes the anger, flamboyance, and subversion once thriving in gay subcultures in order to create something dangerous and lovely: an exploration of the perils of assimilation; a call for accountability; a vision for change. A sassy and splintering emergency intervention!Called \"startlingly bold and provocative\" by Howard Zinn, and described as \"a cross between Tinkerbell and a honky Malcolm X with a queer agenda\" by The Austin Chronicle, Mattilda Bernstein Sycamore is undoubtedly one of America's most outspoken queer critics. She is the author of two novels, including, most recently, So Many Ways to Sleep Badly, and is the editor of four nonfiction anthologies, including Nobody Passes: Rejecting the Rules of Gender and Conformity and That’s Revolting! Queer Strategies for Resisting Assimilation.",
  "genres": [
    "Queer",
    "Nonfiction",
    "LGBT",
    "Essays",
    "Gender",
    "Politics",
    "Queer Studies"
  ],
  "author": "Mattilda Bernstein Sycamore",
  "average_rating": "3.93",
  "url": "https://www.goodreads.com/book/show/12074805-why-are-faggots-so-afraid-of-faggots"
}