{
  "title": "Blessed Are the Misfits: Great News for Believers who are Introverts, Spiritual Strugglers, or Just Feel Like They're Missing Something",
  "description": "Warning: If modern church culture makes perfect sense to you, and you always fit in seamlessly, don’t read this. As for the rest of us…\nWhile American church culture (and American culture at large) seems largely designed for the extroverted, it’s estimated that half of the American population is introverted, and they’re often left wondering how, even if, they fit in the kingdom of God. As one of them, popular radio host Brant Hansen brings news. It’s wonderful, refreshing, and never-been-said-this-way-before good news.In his unique style, Hansen looks to answer questions that millions of people carry with them each day:If I don’t relate to God as emotionally as others do, is something wrong with me?How does one approach God, and approach faith, when devoid of the “good feelings” that seem to drive so much of evangelical church culture?How does God interact with those who seem spiritually numb?Is the absence of faith-based emotion a sign of that God has moved on or was never there?What if we aren’t good at talking to people about our faith, or good at talking to people at all?What if I’m told I’m too analytical, that I “think too much”?Where does a person who suffers from depression fit in the kingdom? Is depression a sure sign of a lack of faith?This book is good news for people who are desperately looking for it. (And for their loved ones!)It’s also for those who want to believe in Jesus, but inwardly fear that they don’t belong, worry that don’t have the requisite emotion-based relationship with God, and are starving for good news.Blessed Are the Misfits is going to generate discussion, and lots of it. It’s simultaneously highly provocative and humbly personal. It’s also leavened with a distinct, dry, self-effacing humor that is a hallmark of Hansen’s on-air, writing, and public speaking style.",
  "genres": [
    "Christian",
    "Nonfiction",
    "Faith",
    "Christian Living",
    "Christianity",
    "Religion",
    "Theology"
  ],
  "author": "Brant Hansen",
  "average_rating": "4.57",
  "url": "https://www.goodreads.com/book/show/34460639-blessed-are-the-misfits"
}