{
  "title": "Shadows in the Desert",
  "description": "If Hamlet, one of Shakespeare’s great tragic heroes, said of man, ‘What a piece of work is a man, how noble in reason, how infinite in faculties,…- And yet, to me, what is this quintessence of dust? Man delights not me-no, nor woman neither,’ we have, after about four centuries, G.A.Kulkarni, an outstanding short story writer in Marathi, to present a similar portrait of mankind. To G.A., human beings, quintessentially made up of dust, seem to be mere ‘shadows in the desert,’ and hence look so unsubstantial. And though their hands seemingly join together, their shadows are simply extending unto the grave beyond. G.A. Kulkarni tries to outline an image of a complex network of unfathomable destiny in his stories to bring out the uncertainty and absurdity in human life that lies underneath the tragic potential of human predicament. In this sense, G.A.’s worldview has affinity not only with the great tragic poets of ancient Greece but also the Absurd playwrights and Existentialist thinkers of the 20th century. Following the first volume A Journey Forever (2010), thirteen more Short story masterpieces by G.A. Kulkarni are presented in English translation in Shadows in the Desert. The collection illustrates almost all types of short fiction by the Sahitya Akademi Award winning author: realistic stories rooted in the Indian soil (Kasaab : The Butcher, Kavathe:Wood Apples, Chandrawal : The Dancing Pigeon), fantastic but epiphanic tales- a type unparalleled in the history of Short story form at World Literature level- (The Slave, The Messenger, Vidooshak: The Fool), fictional reworking and reinterpretation of Indian and western myths in Mukti: Deliverance and Yaatrik: The Crusader respectively as well as metaphorical/symbolic tales of revelation heavily laden with multiple meanings like Bali: Victim of Sacrifice?, Soyare:Kinsmen, and Anaamik: Anonymous.",
  "genres": [],
  "author": "G.A. Kulkarni",
  "average_rating": "3.50",
  "url": "https://www.goodreads.com/book/show/34460761-shadows-in-the-desert"
}