{
  "title": "Premonition",
  "description": "The USA Today Bestselling Premonition Series is now available in a single volume.  In this mesmerizing adventure, steeped in drama and fraught with heartbreak and humor, 17-year-old college freshman Evie Claremont is plagued by nightmarish premonitions of destruction. Discovering she’s not entirely human, fellow student Reed Wellington is torn between killing her and protecting her. Intimidated, yet undeniably attracted to Reed, Evie falls in love with him while she faces the prospect that she may be an evil spawn. Mercilessly hunted by sinister and seductive Brennus de Graham, the magical-powered king of the Celtic Faeries known as Gancanagh, Evie tries to avoid becoming Brennus’ queen only to find that their destinies are irreparably entwined.  The Series Volumes 1-5:  INESCAPABLE: Incoming Freshman Evie Claremont and gorgeous Sophomore Reed Wellington have an instant dislike for each other. The seductive attraction between them, however, is undeniable and the only thing keeping him from killing her. Can she learn his secret before it destroys them both?  INTUITION: Grief-stricken, Evie Claremont knows she has to leave Crestwood to protect the ones she loves. While Reed Wellington desperately searches for her, she falls prey to forces she never knew existed. Can she escape Brennus de Graham and his enthralling nature?  INDEBTED: Compelled to make a deal with Brennus de Graham to rescue her friends, Evie Claremont becomes the unwilling slave to a demon. But as she grows to know him, will she lose her heart to him?  INCENDIARY: Determined to use her growing power to live life on her own terms, Evie Claremont faces her enemies with help from her friends. But secrets from her past return to haunt her. Will she risk everything to save the one she loves?  INIQUITY: Evie Claremont finds eternity comes with no guarantees, and that some demons are inescapable. When the future hinges on redemption, can she hold on to a happily ever after with the one she adores most?",
  "genres": [
    "Paranormal",
    "Fantasy",
    "Romance",
    "Young Adult",
    "Angels",
    "Fiction",
    "Vampires"
  ],
  "author": "Amy A. Bartol",
  "average_rating": "4.49",
  "url": "https://www.goodreads.com/book/show/34452275-premonition"
}