{
  "title": "Parental Discretion Is Advised: The Rise of N.W.A and the Dawn of Gangsta Rap",
  "description": "Discover the stunning rise, fall, and legacy of N.W.A, one of America’s most revered and iconic enduring music groups, who put their stamp on pop culture, black culture, and who changed hip-hop music forever in this comprehensive and authoritative work of music journalism.Eazy-E, Dr. Dre, Ice Cube, MC Ren, and DJ Yella caused a seismic shift in hip-hop when they decided to form N.W.A in 1986. Suddenly rap became gangsta and relevant on the West Coast. With their hard-core image, bombastic sound, and lyrics that were equal parts poetic, lascivious, conscious, and downright in-your-face, N.W.A spoke the truth about life on the streets of Compton, California—then a hotbed of poverty, drugs, gangs, and unemployment.Their ’hood tales offered a sharp contrast from the cozy, comfortable images of thriving middle-class life emanating from television screens across America. For the group, making music was not about being nice or projecting a false reality. It was all about expressing themselves.Going beyond the story portrayed in the 2015 blockbuster movie Straight Outta Compton, through firsthand interviews, extensive research, and top-notch storytelling, Los Angeles Times music reporter Gerrick Kennedy transports you back in time and offers a front-row seat to N.W.A’s early days and the drama and controversy that followed the incendiary group as they rose to become multiplatinum artists.A riveting and illuminating work of music journalism, Parental Discretion Is Advised captures a special moment in rap music, when N.W.A made it altogether social, freaky, enterprising, and gangsta. They forced us all to take notice. For that alone, their story must be told.",
  "genres": [
    "Music",
    "Nonfiction",
    "Hip Hop",
    "Biography",
    "Pop Culture",
    "History",
    "Audiobook"
  ],
  "author": "Gerrick Kennedy",
  "average_rating": "4.16",
  "url": "https://www.goodreads.com/book/show/34466972-parental-discretion-is-advised"
}