{
  "title": "Istanbul Noir",
  "description": "\"The authors do an excellent job introducing readers to a city unknown to many American readers, exploring the many issues of religion and culture that face modern Istanbul. Landscape is essential to these stories, all of which convince the reader that they couldn't possibly have been set anywhere other than Istanbul.\"-- Booklist\"Istanbul straddles the divide of Europe and Asia, and its polyglot population of 12 million seethes with political, religious, and sexual tensions, as shown in the 16 stories in this strong entry in Akashic's noir anthology series...a welcome complement to the mostly historical mysteries set in Istanbul.\" -- Publishers WeeklyLaunched by the summer -04 award-winning best-seller Brooklyn Noir , Akashic Books continues its groundbreaking series of original noir anthologies. Each book is comprised of all-new stories, each one set in a distinct neighborhood or location within the city of the book.Brand-new stories by : Müge Iplikçi, Behçet Çelik, Ismail Güzelsoy, Lydia Lunch, Hikmet Hükümenoglu, Riza Kiraç, Sadik Yemni, Baris Müstecaplioglu, Yasemin Aydinoglu, Feryal Tilmaç, Mehmet Bilâl, Inan Çetin, Mustafa Ziyalan, Jessica Lutz, Tarkan Barlas, Algan Sezgintüredi, and others.Surrounded by two seas, split by the Bosphorus Strait, and pierced by the Golden Horn, Istanbul stretches between Europe and Asia. A city at once ancient and modern, it is the quintessential postcard-perfect metropolis. But don't let the alluring vistas fool you--beneath its veneer of a beautiful meeting place of cultures, religions, and ethnicities lies a heart of darkness seething with suppressed desire, boiling with frustration, and burning with a fervor for vengeance. If there is a city with its own unique brew of noir, Istanbul is it.From the pitch-black and the ephemeral to the realistic and the surreal, from the open-hearted and the fanatic to the malicious and sadistic, from the butcher out for meat to the lamb who wants to live, these stories rip away the enchanting façade to reveal the shadowy side of Istanbul's soul.Comprised of entirely new stories by some of Turkey's most exciting authors--some still up-and-coming, others well-established and critically acclaimed in their homeland--as well as by a couple of \"outsiders\" temporarily held hostage in the city's vice, Istanbul Noir introduces a whole new breed of talent. As you succumb to the wiles of the city's storytellers, however, be warned--their narrators are notoriously unreliable, and their readers even more so.",
  "genres": [
    "Short Stories",
    "Fiction",
    "Mystery",
    "Noir",
    "Crime",
    "Anthologies",
    "Turkish"
  ],
  "author": "Mustafa Ziyalan",
  "average_rating": "3.25",
  "url": "https://www.goodreads.com/book/show/3447207-istanbul-noir"
}