{
  "title": "Rocky Mountain Home",
  "description": "The FINAL NOVEL in the bestselling SIX PACK RANCH series by New York Times Bestselling Author Vivian Arend. ------------- There’s no distance you can run to escape the past.  Too stubborn to face his sins, Jesse Coleman bolted from the Six Pack Ranch, only to fall straight into the arms of a beautiful stranger. Twelve hours later, the seductive firebrand is nothing but a whiskey-laced memory—but one powerful enough to convince Jesse tracking down his elusive lover is worth the effort.  Darilyn Hayes figured it was her lucky night when the sexiest cowboy in Alberta interrupted her annual drink-until-I-fall-over wake. At least until four weeks later when she discovers she’s pregnant and her one-night-stand is nowhere to be found. Still, as she’s shared with her devoted blog readers, Dare has dealt with life’s not-so-gentle surprises before. She’ll make it on her own.  When an internet picture gone viral leads to their reunion, Jesse’s floored by Dare’s news. She’s very clear she’s not looking for a commitment, but screw that. He’s going to do the right thing by her and his unborn kid. The fact they lit the sheets on fire is a bonus, but with a baby on the way, both their lives are gonna change.  Jesse’s got a ton of family to reconnect with, including his estranged twin. Dare holds family loosely—even though she loves them—because she knows too well how fragile life can be. Between her and Jesse, they’ve got enough baggage to open a store.  But they still have a shot at forever—if they’re willing to fight for it.  This final novel in the series contains the following: A sexy, dirty, cocky-as-hell prodigal son Coleman with massive bridges to rebuild. A woman able to see to the heart of the matter yet bold enough to speak the truth. A family of extraordinary resolve and endless love. A wedding or two. And babies—oh lordy, the babies…",
  "genres": [
    "Romance",
    "Contemporary",
    "Westerns",
    "Contemporary Romance",
    "Western Romance",
    "Family",
    "Audiobook"
  ],
  "author": "Vivian Arend",
  "average_rating": "4.46",
  "url": "https://www.goodreads.com/book/show/34467601-rocky-mountain-home"
}