{
  "title": "Awakening the Princess",
  "description": "The story of Ronin Kassius, a male 1st year high school student living on the colonized world of Teloria, who finds himself an unwilling participant in the Gun Princess Royale Tournament, where competitors known as Gun Princesses battle for the title of Gun Queen, and the right to compete for the vaunted rank of Gun Empress.  A High School Sci-Fi with a gender twist.  It is said there is no point crying over spilt milk, but for Ronin Kassius living on the terraformed world of Teloria, his decision to help out the Cosplay Club during his third year of middle school at Telos Academy in the city-state of Ar Telica is one he fervently regrets. Cross-playing as the popular animated heroine, Princess Silver Blue, garnered him a legion of ardent fans misled to believe he is a girl and not a boy because of his overtly feminine appearance.  A year later, Ronin begins his first year of high school at the Academy hoping for a change for the better, but his life is soon derailed in a series of mishaps that appear suspiciously intentional starting with an unpleasant after-school encounter with a girl commonly called a witch by her classmates, who threatens to expose Ronin's cross-playing days as Silver Blue to the student body. Escaping the girl, and his friends, by practically fleeing into a gaming arcade, Ronin's session playing an unpopular zombie apocalypse virtual reality game turns into a fight for survival ending with his apparent death. Waking up days later, and fearing the consequences of attending Telos Academy if his secret as a cross-player has been exposed, Ronin soon learns it's the least of his problems as his life begins to unravel in a waking nightmare.  Aided by three female classmates, and guided by an enigmatic voice in his head that he nicknames Ghost, Ronin faces twists and betrayal as he struggles to learn the truth behind the events at the gaming arcade, and soon discovers that his life and body have become the possession of a rich, powerful, and mysterious family that has chosen him to represent their interests by having him compete in the Gun Princess Royale, an all-too realistic and overly popular VR tournament where players with corporate sponsorship wield Gun Princess avatars in battle.  However, the greatest shock comes in learning that he won't be competing as a boy, but as a girl called Mirai, an existence that comes with her own unique set of problems, and if he wants his male body returned to him, Ronin will need to fight and attain the rank of Gun Queen, and face off against other competitors in the ultimate battle royale to earn the supreme title of Gun Empress.  Book One in the Gun Princess Royale series.",
  "genres": [],
  "author": "Albert Ruckholdt",
  "average_rating": "4.07",
  "url": "https://www.goodreads.com/book/show/34472700-awakening-the-princess"
}