{
  "title": "The Monster Hunter Files",
  "description": "ALL NEW STORIES SET IN THE BEST-SELLING MONSTER HUNTER INTERNATIONAL SERIES. New stories from Larry Correia, Jim Butcher, John Ringo, Jody Lynn Nye, Sarah A. Hoyt, Brad R. Torgersen, and many more!For well over a century, Monster Hunter International has kept the world safe from supernatural threats small and large—and in some cases very, very large. Now, join us as MHI opens their archives for the first time. From experienced Hunters on their toughest cases, to total newbies' initial encounters with the supernatural, The Monster Hunter Files reveals the secret history of the world's most elite monster fighting force. Discover what happened when Agent Franks took on the Nazis in World War Two. Uncover how the Vatican’s Combat Exorcists deal with Old Ones in Mexico. And find out exactly what takes place in a turf war between trailer park elves and gnomes. From the most powerful of mystical beings to MHI’s humble janitor, see the world of professional monster hunting like never before. Featuring seventeen all new tales based on Larry Correia’s bestselling series, from New York Times best-selling authors Jim Butcher, John Ringo, Jessica Day George, Jonathan Maberry, Faith Hunter, and many more.Contributors: Larry Correia Jim Butcher Mike Kupari Jessica Day George John C. Wright Maurice Broaddus Brad R. Torgersen Faith Hunter Jody Lynn Nye Quincy J. Allen Alex Shvartsman Kim May Steve Diamond John Ringo Bryan Thomas Schmidt & Julie C. Frost Sarah A. Hoyt Jonathan MaberryAbout Larry Correia and the Monster Hunter International series: “[E]verything I like in fantasy: intense action scenes, evil in horrifying array, good struggling against the darkness, and most of all people—gorgeously flawed human beings faced with horrible moral choices that force them to question and change and grow.”—Jim Butcher “[A] no-holds-barred all-out page turner that is part science fiction, part horror, and an absolute blast to read.”—Bookreporter.com “If you love monsters and action, you’ll love this book. If you love guns, you’ll love this book. If you love fantasy, and especially horror fantasy, you’ll love this book.”—Knotclan.com “A gun person who likes science fiction—or, heck, anyone who likes science fiction—will enjoy [these books] . . . The plotting is excellent, and Correia makes you care about the characters . . . I read both books without putting them down except for work . . . so whaddaya waitin’ for? Go and buy some . . . for yourself and for stocking stuffers.”—Massad Ayoob “This lighthearted, testosterone-soaked sequel to 2009's Monster Hunter International will delight fans of action horror with elaborate weaponry, hand-to-hand combat, disgusting monsters, and an endless stream of blood and body parts.”—Publishers Weekly on Monster Hunter VendettaAbout Mission: Tomorrow, edited by Bryan Thomas Schmidt:  “This themed anthology . . . will appeal to a wide range of readers, who will appreciate the diversity of stories . . . a solid introduction to a classic genre.”—Kirkus “Editor Schmidt adds grandmasters to a mix of newer established names and balances the tragic with the humorous.”—Publishers WeeklyAbout Shattered Shields, edited by Jennifer Brozek and Bryan Thomas Schmidt:  “In this well-built anthology, seventeen original stories cut to the heart of military fantasy, diving directly into the most exciting moments of dramatic bravery, grand battles, and life-changing heroism. . . . Readers who prefer to cut straight to the action, but want more depth than pure hack-and-slash, will find these offerings appealing.”—Publishers Weekly “An inventive and thought-provoking set of tales that capture the bravery and terrors of battle. Carries the banner of military fantasy proudly.”—John Marco, author of The Bronze Knight SeriesAbout The Raygun Chronicles, edited by Bryan Thomas Schmidt: “Fans of sf should enjoy this stylistically varied homage to a genre as old as the fiction . . . ”—Library JournalThe Monster Hunter Memoirs series by Larry Correia and John Ringo:Monster Hunter Memoirs: GrungeMonster Hunter Memoirs: SinnersThe Monster Hunter series by Larry Correia:Monster Hunter InternationalMonster Hunter VendettaMonster Hunter AlphaMonster Hunter LegionMonster Hunter Nemesis",
  "genres": [
    "Fantasy",
    "Urban Fantasy",
    "Audiobook",
    "Horror",
    "Fiction",
    "Anthologies",
    "Short Stories"
  ],
  "author": "Larry Correia",
  "average_rating": "4.14",
  "url": "https://www.goodreads.com/book/show/34466824-the-monster-hunter-files"
}