{
  "title": "Neogenesis",
  "description": "Menace from Back Space Looming out of the Dust of TimeThe Complex Logic Laws were the result of a war waged hundreds of years in the past, when two human powers threw massive AI navies at each other and nearly annihilated themselves.  Being human, they blamed their tools for this near miss; destroyed what was left of the sentient ships, and made it illegal to be, manufacture, or shelter an independent logic.Strangely, however, the Free Ships and other AIs did not turn themselves in or suicide, they merely became wary of humans, and stayed under their scans.  A clandestine support network grew up, including hidden yards where smart ships were manufactured, and mentors, humans specially trained to ease a new intelligence into the universe, socialize them, and teach them what they needed to know to survive.Among those with a stake in the freedom of Independent Logics is Theo Waitley, who is somewhat too famously the captain of intelligent ship Bechimo. Theo's brother, Val Con yos'Phelium, presides over a household that has for a generation employed an AI butler.  Recently, he approved the \"birth\" of the butler's child, who was sent, with human mentor Tolly Jones, to rescue or destroy an orphaned AI abandoned at a remote space station.Then there's Uncle, the shadowy mastermind from the Old Universe, whose many projects often skirt the boundaries of law, both natural and man-made – and the puppet-masters at the Lyre Institute, whose history is just as murky – and a good deal less honorable.All have an interest in the newly-awakening Self-Aware Logic that is rumored to have the power to destroy universes.The question is:  Who will get to it first?About Dragon in Exile: “[S]prawling and satisfying. . . . Space opera mixes with social engineering, influenced by Regency-era manners and delicate notions of honor. . . . [I]t’s like spending time with old friends . . .”—Publishers WeeklyAbout Necessity's Child: “Compelling and wondrous, as sharp and graceful as Damascus steel, Necessity's Child is a terrific addition to Lee & Miller's addictive series.”—#1 New York Times best seller, Patricia Briggs About the Liaden Universe® series: “Every now and then you come across an author, or in this case, a pair, who write exactly what you want to read, the characters and personalities that make you enjoy meeting them. . . . I rarely rave on and on about stories, but I am devoted to Lee and Miller novels and stories.”—Anne McCaffrey “These authors consistently deliver stories with a rich, textured setting, intricate plotting, and vivid, interesting characters from fully-realized cultures, both human and alien, and each book gets better.”—Elizabeth Moon “[D]elightful stories of adventure and romance set in a far future. . .space opera milieu. It’s all a rather heady mix of Gordon R. Dickson, the Forsythe Saga, and Victoria Holt, with Lee and Miller’s own unique touches making it all sparkle and sizzle. Anyone whose taste runs toward SF in the true romantic tradition can’t help but like the Liaden Universe.”—Analog “[T]he many fans of the Liaden universe will welcome the latest…continuing young pilot Theo Waitley’s adventures.”—Booklist on Saltation “[A]ficionados of intelligent space opera will be thoroughly entertained. . .[T]he authors' craftsmanship is top-notch.”—Publishers Weekly on Lee and Miller’s popular Liaden Universe® thriller, I Dare",
  "genres": [
    "Science Fiction",
    "Space Opera",
    "Fiction",
    "Fantasy",
    "Science Fiction Fantasy",
    "Space",
    "Adventure"
  ],
  "author": "Sharon Lee",
  "average_rating": "4.39",
  "url": "https://www.goodreads.com/book/show/34466816-neogenesis"
}