{
  "title": "Coupons for Newbies: Freebies, Cheapies and Money Makers",
  "description": "Have you noticed the skyrocketing prices of groceries and fuel? These rising cost impact our paychecks, which don’t grow bigger when prices rise. Many families live paycheck to paycheck and some families have to choose between paying their rent and being able to buy food. “Coupons for Newbies Freebies, Cheapies and Money Makers” will teach non- coupon and avid couponer users how to slash their grocery and pharmacy bills in half. Readers will be taught the language of couponers, yes we have our own unique language, how to stack coupons and add bonus coupons on top for maximum savings, how to earn Free gas, free groceries and items from the pharmacy, free store money, earn free gift cards and more. Most importantly readers will learn how to save an average of $100 a month on their groceries using coupons. What would you do with an extra $1200 a year? Would an extra $100 a month in your pocket, make you smile? Avid couponers like me (I’ve been couponing since 2012) and millions of others worldwide have saved $100’s, even thousands of dollars using coupons. I educate others on the benefit of couponing, because several years ago, my family hit hard times and had no food to eat. Through couponing I changed our lives! You too can slash your grocery bills in half; earn free products, free gas, gift cards and more. Sound intriguing, want to learn more, then click the Buy Now button above and purchase “Coupons for Newbies Freebie, Cheapies and Money Makers” and start your journey into the coupon world. In no time you’ll be piling up the savings, while your grocery and fuel bills nose dive. How will you spend all your savings? Maybe a family trip or pay off so debts, the options are endless. This book lays out the floor plan for you to save 50% or more off the retail price of groceries and other products you buy. Couponing is the answer to changing your financial situation forever! Will you join the coupon band wagon today? If yes, click the Buy Now Button!",
  "genres": [],
  "author": "Wen Dee",
  "average_rating": "4.50",
  "url": "https://www.goodreads.com/book/show/34467669-coupons-for-newbies"
}