{
  "title": "The Boy Who Fell Out of the Sky",
  "description": "In this stunning, emotionally charged memoir, Ken Dornstein interweaves the moving story of his own coming-of-age with the promise of greatness his brother never lived to fulfill. The Boy Who Fell Out of the Sky is a heartbreaking but profoundly hopeful book about finding beauty in the midst of tragedy and making sense of it.David Dornstein was twenty-five years old, a handsome, charismatic young man on the verge of becoming an extraordinary writer, when he boarded Pan Am Flight 103 from London on the evening of December 21, 1988. Thirty-eight minutes after takeoff, he died, along with the 258 other passengers and crew, when a terrorist’s plastic explosive ripped the plane apart over Lockerbie, Scotland.David’s brother, Ken, was nineteen, a college sophomore home on winter break, when the call came. All his life Ken had looked up to David, confided in him, followed where he led. David’s death left Ken with a void that both crushed and consumed him. What were his brother’s plans when he died? Was David really carrying home a draft of the great novel everyone knew was in him? Was he in love with the woman he was living with overseas? Ken Dornstein needed to learn the truth about his brother’s life and death. In this harrowing and affecting memoir, he records what he found out.It was years before Ken could bring himself to confront the stacks of notebooks and letters David left behind, but once he began to read he was drawn deep into his brother’s world. From David’s early obsession with writing down his every thought to his misadventures on the streets of New York, from an unraveling love affair in Israel to a devastating childhood secret, piece by piece Ken assembles a complex, disturbing portrait of an artist struggling to find a voice for passions that often threatened to tear him apart. Then, by chance, Ken runs into David’s college girlfriend on a train and everything changes once again. He starts to question his motives and his memories, and finally sets off on a complicated journey to finish the book that his brother started.As haunting as a dream, as electrifying as the day’s news, The Boy Who Fell Out of the Sky is an incandescent and unforgettable account of one man’s struggle to find inspiration in his brother’s life and create a life of his own. What begins as a tragedy turns into a love story of deeply affirming power.",
  "genres": [
    "Nonfiction",
    "Memoir",
    "Biography",
    "Biography Memoir",
    "True Crime",
    "History",
    "Autobiography"
  ],
  "author": "Ken Dornstein",
  "average_rating": "3.48",
  "url": "https://www.goodreads.com/book/show/344717.The_Boy_Who_Fell_Out_of_the_Sky"
}