{
  "title": "The Gourmet Club",
  "description": "The decadent tales in this dazzling collection span forty-five years in the extraordinary career of Japan's master storyteller, Jun'ichiro Tanizaki (1886-1965).Tanizaki's major novels-Naomi, The Makioka Sisters, A Cat, a Man, and Two Women, and The Key, for example-have already appeared in English, but some of his finest works are short stories, only a handful of which have been translated.The stories presented here, all of them translated into English for the first time, vividly explore an array of human passions. In \"The Children,\" three mischievous friends play sado-masochistic games in a mysterious Western-style mansion. The sybaritic narrator of \"The Secret\" experiments with cross-dressing as he savors the delights of duplicity. \"The Two Acolytes\" evokes the conflicting attractions of spiritual fulfillment and worldly pleasure in medieval Kyoto. In the title story, the seductive tastes, aromas, and textures of outlandish Chinese dishes blend with those of the seductive hands that proffer them to blindfolded gourmets. In \"Mr. Bluemound,\" Tanizaki, who wrote for a film studio in the early 1920s, considers the relationship between a flesh-and-blood actress and her image fixed on celluloid, which one memorably degenerate admirer is obsessed with. And, finally, \"Manganese Dioxide Dreams\" offers a tantalizing insight into the author's mind as he blends-in the musings of an old man very like Tanizaki himself-Chinese and Japanese cuisine, a French murder movie, Chinese history, and the contents of a toilet bowl.These beautifully translated stories will intrigue and entertain readers who are new to Tanizaki, as well as those who have already explored the bizarre world of his imagination.",
  "genres": [
    "Japan",
    "Short Stories",
    "Fiction",
    "Japanese Literature",
    "Literature",
    "Asia",
    "Literary Fiction"
  ],
  "author": "Jun'ichirō Tanizaki",
  "average_rating": "3.73",
  "url": "https://www.goodreads.com/book/show/34466.The_Gourmet_Club"
}