{
  "title": "Adobe Moon",
  "description": "“Adobe Moon,” Mark Warren’s first book in a trilogy on Wyatt Earp is more than historical fiction. Though it is a period piece of the 19th century, it is a timeless story that relates to all of us.Regardless of when or where a person lives in time, each of us is faced with a universal plight: How do we become a man or a woman? And how do we find our place in the world?Do the times shape us? Yes, just as surely as the place and people around us. Family, especially. It has always been this way. What if you wanted to run away from home to fight in a war . . . but you were too young? What if you were forced to labor over 80 acres of crops by an overbearing father who knew nothing about giving some slack to his sons? And, as a fourteen year old, after accruing the requisite calluses of farming, what aspirations might you consider for your vocation?This is the story of such a boy who never quite finds all those answers. But because of his physicality, confidence, and a willingness to exercise deliberate courage, he does find his place in a life much admired by his peers. His name will always be spoken anytime that a conversation arises about justice vs. law and order . . . and how those American commodities do not always balance on the scales of a courtroom bench. His name was Wyatt Earp. Earp was many things–farmer, freight hauler, stage driver, railroad wrangler, husband, constable, wood splitter, accused horse thief, brothel bouncer, buffalo hunter, gambler, and lawman–most of this in the “new” and raw land of America’s untapped West. The possibilities seemed endless for Wyatt, but he will be remembered in that last category . . . peace officer, a role he did not want. Instead, it would seem that history wanted it for him. He was that good at it.Synopsis: It is 1862. With his older brothers fighting in the war, Wyatt Earp is left to manage the family's Iowa farm under his father's iron rule. These years of labor produce in him an ambition to seek his fortunes by his wits rather than by the sweat of his back. The open territory to the west, he knows, offers that opportunity. On his way to California he meets a beguiling Mexican girl, who tells him of the \"adobe moon,\" a rusty-hued orb that reminds a man: If you do not achieve your dreams, you must settle for what you have. Wyatt rejects this idea, but it haunts him nevertheless, as he takes odd jobs, becomes a constable in a small Missouri town, and ultimately sinks into a depression where the line of ethics blur. Fed up with his self-made squalor, he returns to the West for a second chance at a proper life, and in a Kansas cattle town he comes face to face with his salvation...and his destiny as a lawman with his own iron rule.",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Westerns",
    "Historical"
  ],
  "author": "Mark  Warren",
  "average_rating": "4.28",
  "url": "https://www.goodreads.com/book/show/34479620-adobe-moon"
}