{
  "title": "One Nation After Trump: A Guide for the Perplexed, the Disillusioned, the Desperate, and the Not-Yet Deported",
  "description": "AN INSTANT NEW YORK TIMES BESTSELLER ― read by the authors.A call to action from three of Washington's premier political scholar-journalists, One Nation After Trump offers the definitive work on the threat posed by the Trump presidency and how to counter it.American democracy was never supposed to give the nation a president like Donald Trump. We have never had a president who gave rise to such widespread alarm about his lack of commitment to the institutions of self-government, to the norms democracy requires, and to the need for basic knowledge about how government works. We have never had a president who raises profound questions about his basic competence and his psychological capacity to take on the most challenging political office in the world.Yet if Trump is both a threat to our democracy and a product of its weaknesses, the citizen activism he has inspired is the antidote. The reaction to the crisis created by Trump’s presidency can provide the foundation for an era of democratic renewal and vindicate our long experiment in self-rule.The award-winning authors of One Nation After Trump explain Trump’s rise and the danger his administration poses to our free institutions. They also offer encouragement to the millions of Americans now experiencing a new sense of citizenship and engagement and argue that our nation needs a unifying alternative to Trump’s dark and divisive brand of politics―an alternative rooted in a New Economy, a New Patriotism, a New Civil Society, and a New Democracy.One Nation After Trump is the essential audiobook for our era, an unsparing assessment of the perils facing the United States and an inspiring roadmap for how we can reclaim the future.",
  "genres": [
    "Politics",
    "Nonfiction",
    "History",
    "Audiobook",
    "Government",
    "American History",
    "The United States Of America"
  ],
  "author": "E.J. Dionne Jr.",
  "average_rating": "3.83",
  "url": "https://www.goodreads.com/book/show/34479566-one-nation-after-trump"
}