{
  "title": "Double Dating",
  "description": "Mia Foxx, way in over her head, joins a dating website one day. More like she's forced to but that's besides the point! 'Looking_For_Love' is her username but only because the continuation of it \"in all the wrong places\" doesn't fit.And just like that her saviors appear, proving to her that love can be found even when looking in all the wrong places. The plural is not a grammatical error, two men message her in hopes of gaining her attention. Their ploy works and just like that the once timid Mia agrees to a date with not one, but two, men who are half-brothers and own a concert hall.~EXCERPT~We were at a stop light just blocks away from the club when Cole murmured, \"Chinese fire drill.\" And then a devilish plan jumped into action.Nico, being ever so collected and cool, took the driver's seat and continued on driving once the light turned green. The other one had opened the door of the back and bent himself inside the small space. Instead of buckling himself up, Cole got on all fours above my body, forcing me to press myself into the door.\"Hey there gorgeous,\" He smirked down at me as he planted a knee between my legs.\"Wh-What-\"\"Shh...\" His head bent down and hazel eyes captivated me into silence. I could see them as cars passed by us, momentarily shining their lights into our car. They were more green around the edges, reminding me of fresh cut grass in the spring-What am I thinking?!\"Shh, my little Mia, stop resisting.\" Cole's eyes burned into mine for a second and then his head bent even lower to my collarbone. Something wet ran across the protruding bone at the base of my neck and I jolted from the strange sensation. And then I realized it was his tongue when he placed little nips all over the bone and then traveled up to my ear.\"S-stop...\"He chuckled darkly, \"You don't want me to.\"But I did. So why couldn't I say so?",
  "genres": [],
  "author": "Caitlyn S. Ramos",
  "average_rating": "3.00",
  "url": "https://www.goodreads.com/book/show/34486087-double-dating"
}