{
  "title": "Spaniel Rage",
  "description": "“I love [Davis’s] free-form drawing . . . She just has a funny, truthful voice.” ―Audrey Niffenegger Vanessa Davis’s autobiography, more observational than confessional, delighted readers ten years ago when she first began telling stories about her life in New York as a young single Jewish woman. Spaniel Rage is filled with frank and immediate pencil-drawn accounts of dating woes, misunderstandings between her and her mother, and conversations with friends. Her keen observation of careless words spoken casually is refreshingly honest, yet never condemning. Unabashedly, Davis offers up gently self-deprecating anecdotes about her anxieties and wry truths about the contradictions of life in the big city. These comics are sexy, funny, lonely, beautiful, spare, and very smart―the finest work from a natural storyteller. “[Davis creates] structurally sound, stylistically individual images that also manage to seem totally casual and spur-of-the-moment. The cliché “she makes it look so easy” is acutely appropriate for Vanessa and her work.”― Rookie “The frank, personal specificity of [ Spaniel Rage ] keeps you gripped.”― Vulture, 8 Comics You Need To Read “...a warm, familiar voice … Spaniel Rage holds an amazing freshness 12 years after it was published. It certainly deserves Drawn & Quarterly’s February reissue.”― Paste “[ Spaniel Rage collects] snapshots of her life that feel both utterly familiar and totally weird … a pleasant delve into young life in the city.”― Library Journal “Often funny, often tinged with loss, Davis chronicles a life page by page [and] touches on the anxieties of the internet age.”― The Comics Journal “This work [has] the strange power of making me feel like Davis broke into my apartment and scribbled her life into my personal notebook, just for me.”― Broken Pencil “An honest, unflinching set of loose cartoons… at its core, the commonalities of the cartoons in Spaniel Rage reflect the quirks of daily life itself.”― Bookriot, 5 Graphic Novels To Watch In For February “If you dig slice-of-life graphic novels, then you’ll want to pick up Spaniel Rage from Vanessa Davis … the graphic-novel equivalent of a Seinfeld episode about twentysomethings.”― London Free Pres s",
  "genres": [
    "Graphic Novels",
    "Comics",
    "Memoir",
    "Graphic Novels Comics",
    "Art",
    "Nonfiction",
    "Comix"
  ],
  "author": "Vanessa Davis",
  "average_rating": "3.77",
  "url": "https://www.goodreads.com/book/show/1021602.Spaniel_Rage"
}