{
  "title": "Suitors and Sabotage",
  "description": "Two young people must hide their true feelings for each other while figuring out who means them harm in this cheeky Regency romance \nfrom the author of Love, Lies and Spies and Duels & Deception. \nShy aspiring artist Imogene Chively has just had a successful Season in London, complete with a suitor of her father's approval. Imogene is ambivalent about the young gentleman until he comes to visit her at the Chively estate with his younger brother in tow. When her interest is piqued, however, it is for the wrong brother. Charming Ben Steeple has a secret: despite being an architectural apprentice, he has no drawing aptitude. When Imogene offers to teach him, Ben is soon smitten by the young lady he considers his brother's intended. But hiding their true feelings becomes the least of their problems when, after a series of \"accidents,\" it becomes apparent that someone means Ben harm. And as their affection for each other grows—despite their efforts to remain just friends—so does the danger. . .In Suitors and Sabotage, author Cindy Anstey delivers another witty young adult historical fiction novel that is the perfect mix of sweetly romantic and action-packed. Praise for Suitors and Sabotage:A Junior Library Guild Selection\"Anstey’s tale embraces a self-reliant main character, a loyal friend, innocent romance, witty conversation, and English country settings, each more splendid than the last. This is a delightful salute to Jane Austen and will be a treat for her fans.\" —VOYA\"Mystery and romance are delightfully intertwined . . . Taking inspiration from Jane Austen novels, Anstey's latest is a lighthearted and romantic read.\" —Booklist",
  "genres": [
    "Historical Fiction",
    "Romance",
    "Young Adult",
    "Historical",
    "Mystery",
    "Historical Romance",
    "Fiction"
  ],
  "author": "Cindy Anstey",
  "average_rating": "3.50",
  "url": "https://www.goodreads.com/book/show/34499243-suitors-and-sabotage"
}