{
  "title": "The Legend of Decimus Croome: A Halloween Carol",
  "description": "Decimus Croome is a dastardly curmudgeon who hates all holidays but especially despises Halloween. He is content to live in his gloomy old house and avoid all human contact whenever possible. He even shuns his own daughter and grandson. But Croome's life changes one memorable Halloween when four ghastly spirits visit him to reveal the misery he has inflicted upon his friends, neighbors and family members.Based on A Christmas Carol by Charles Dickens, The Legend of Decimus Croome is bound to become a Halloween classic for readers of all ages. Follow old man Croome as he is visited by the lovely but disturbing spirit of his dearly departed wife. She warns him of three spirits yet to follow. And oh what spirits they are. Each one is more frightening than the last as they deliver a chilling message for Croome and his fellow Halloween humbugs.The Ghost of Halloween Past is a truly horrifying yet disturbingly hilarious spirit who delivers Croome to his distant and not-so-distant past. Along the journey, Croome is warmed with nostalgia then terrified by painful memories from Halloweens gone by.The second spirit is a shape-shifting witch who breaks every stereotype about witches while nearly driving Croome insane with her wild antics and slapstick delivery. As the Ghost of Halloween Present, she takes Croome on a crazy magic carpet ride that reveals his negative influence on those closest to him. The witch also introduces Croome to the magic of Halloween on enchanted visits further afield.The third phantasm delivers the final glimpse of Croome's diabolically repulsive life and the future that is in store for him if he doesn't change his wicked ways. Croome is forced to confront the impending consequences of his cruel and heartless lifestyle. He is spirited away to a bleak future including a terrifying visit to a desolate cemetery.Throughout this delightful and spooky Halloween novel, you will be haunted by ghosts, inspired by a brave young leukemia patient and entertained by a precocious feline named Black Magic.Join Tommy Bobbich, Decimus Croome and a whole cast of ghosts, witches and ghouls in this modern day holiday story that is sure to provide you with chills, laughs and even a few touching moments as you read The Legend of Decimus Croome: a Halloween Carol. You will never look at Halloween the same again.",
  "genres": [
    "Halloween",
    "Ghosts",
    "Holiday",
    "Middle Grade",
    "Humor",
    "Teen",
    "Witches"
  ],
  "author": "Kevin  Purdy",
  "average_rating": "4.13",
  "url": "https://www.goodreads.com/book/show/34504710-the-legend-of-decimus-croome"
}