{
  "title": "The One-Cent Magenta: Inside the Quest to Own the Most Valuable Stamp in the World",
  "description": "An inside look at the obsessive, secretive, and often bizarre world of high-profile stamp collecting, told through the journey of the world’s most sought-after stamp.   When it was issued in 1856, it cost a penny. In 2014, this tiny square of faded red paper sold at Sotheby’s for nearly $9.5 million, the largest amount ever paid for a postage stamp at auction. Through the stories of the eccentric characters who have bought, owned, and sold the one-cent magenta in the years in between, James Barron delivers a fascinating tale of global history and immense wealth, and of the human desire to collect.   One-cent magentas were provisional stamps, printed quickly in what was then British Guiana when a shipment of official stamps from London did not arrive. They were intended for periodicals, and most were thrown out with the newspapers. But one stamp survived. The singular one-cent magenta has had only nine owners since a twelve-year-old boy discovered it in 1873 as he sorted through papers in his uncle’s house. He soon sold it for what would be $17 today. (That’s been called the worst stamp deal in history.) Among later owners was a fabulously wealthy Frenchman who hid the stamp from almost everyone (even King George V of England couldn’t get a peek); a businessman who traveled with the stamp in a briefcase he handcuffed to his wrist; and John E. du Pont, an heir to the chemical fortune, who died while serving a thirty-year sentence for the murder of Olympic wrestler Dave Schultz.   Recommended for fans of Nicholas A. Basbanes, Susan Orlean, and Simon Winchester, The One-Cent Magenta explores the intersection of obsessive pursuits and great affluence and asks why we want most what is most rare.",
  "genres": [
    "Nonfiction",
    "History",
    "Audiobook",
    "Historical",
    "Journalism",
    "Microhistory"
  ],
  "author": "James Barron",
  "average_rating": "3.63",
  "url": "https://www.goodreads.com/book/show/34500156-the-one-cent-magenta"
}