{
  "title": "White Flight: Atlanta and the Making of Modern Conservatism",
  "description": "During the civil rights era, Atlanta thought of itself as \"The City Too Busy to Hate,\" a rare place in the South where the races lived and thrived together. Over the course of the 1960s and 1970s, however, so many whites fled the city for the suburbs that Atlanta earned a new nickname: \"The City Too Busy Moving to Hate.\"In this reappraisal of racial politics in modern America, Kevin Kruse explains the causes and consequences of \"white flight\" in Atlanta and elsewhere. Seeking to understand segregationists on their own terms, White Flight moves past simple stereotypes to explore the meaning of white resistance. In the end, Kruse finds that segregationist resistance, which failed to stop the civil rights movement, nevertheless managed to preserve the world of segregation and even perfect it in subtler and stronger forms.Challenging the conventional wisdom that white flight meant nothing more than a literal movement of whites to the suburbs, this book argues that it represented a more important transformation in the political ideology of those involved. In a provocative revision of postwar American history, Kruse demonstrates that traditional elements of modern conservatism, such as hostility to the federal government and faith in free enterprise, underwent important transformations during the postwar struggle over segregation. Likewise, white resistance gave birth to several new conservative causes, like the tax revolt, tuition vouchers, and privatization of public services. Tracing the journey of southern conservatives from white supremacy to white suburbia, Kruse locates the origins of modern American politics.",
  "genres": [
    "History",
    "Nonfiction",
    "Politics",
    "Race",
    "American History",
    "Social Justice",
    "Anti Racist"
  ],
  "author": "Kevin M. Kruse",
  "average_rating": "4.28",
  "url": "https://www.goodreads.com/book/show/345070.White_Flight"
}