{
  "title": "Barbarian Cruelty: An Eye-Witness Account of White Slavery under the Moors",
  "description": "An original eye-witness account of white slavery under the Muslims of North Africa. It is a simple fact of the anti-white establishment that the Trans-Atlantic slave trade is known to all, but knowledge of the Muslim slave-trade in Europeans is deliberately suppressed. Europeans are continually \"blamed\" for African slavery (even though only a tiny minority were ever involved in it, and it was Europeans who brought it to an end), but no-one ever dares \"blame\" the Muslim world for their slave trade in Africans and Europeans, which lasted for centuries longer than the Atlantic slave trade. It was during the 1600s that Barbary corsairs-pirates from the Barbary Coast of North Africa (today Algeria, Libya and Morocco)-were at their most active and terrible. With the full support of the Moorish rulers of North Africa, these Muslim slavers raided southern Europe, the Atlantic European coast, Britain and Ireland almost at will. There are, sadly, no complete records for how many Europeans were captured by the Muslim slavers, but most estimates-based on the size of the Moorish cities-indicate that by 1780, at least 1.2 million Europeans had been seized. Very few ever managed to escape, and most ended their days dying of starvation, disease, or maltreatment. A tiny number converted to Islam-a way of guaranteeing freedom, as only kuffars were enslaved-and an even smaller number escaped. This remarkable book, first published in 1693, contains one of the few genuine eye-witness accounts, written by a white slave who managed to escape. Its graphic description of the lot of white slaves, the Moorish relations with the Jews of North Africa, the conditions of the time and the author's eventual escape, cast a dramatic and nowadays, oft-hidden light upon the time when whites were enslaved.",
  "genres": [],
  "author": "Francis Brooks",
  "average_rating": "4.08",
  "url": "https://www.goodreads.com/book/show/34500512-barbarian-cruelty"
}