{
  "title": "Black Holes Built Our Cosmos",
  "description": "Is there a black hole living right in our own backyard? ‘Black Holes Built Our Cosmos’ is an absolute critical part of new ‘Trillion Theory’ (TT) by Ed Lukowich. ‘Black Holes Built Our Cosmos’ is the 3rd book in the cosmology theory series of Canadian theorist Ed Lukowich. This new TT was originated by Ed Lukowich back in 1998, and the news of it is now spreading far and wide. You will be amazed at how important these new TT discoveries promise to be; so vital that the old Big Bang theory will soon forfeit its prominence as the paradigm model for our universe. TT portrays black holes as the crucial architects of gigantic galaxies and organized solar systems. Here is a tiny glance back at the origin of our cosmos: ‘A ruthless black hole feverishly spins as its powerful jaws gnaw away at an ocean of light. Suddenly, strands of light break free - swallowed up by the monster. A pig of an eater, the glutinous entity fills its belly to fabricate itself into a solid sphere. Soon, the encased black hole at the sphere’s core extends its force to keep other adjacent smaller spheres in orbit as moons, frantically assembling the first solar system.’ This incredible smallish start to our universe ushered in an unstoppable recycling process spanning the next trillion years. Cosmic history will witness space growing ever larger as the prolific count of stars today surmounts a ginormous 73 quintillion within billions of galaxies, each galaxy hubbed by a supermassive black hole. Read all about the magical forces within a super-powerful black hole that eventually grows the black hole into a gentle sun giant allowing light to escape from its clutches - something believed to be impossible until Trillion Theory.Author Biography:About the Author: Ed Lukowich began writing his new universe theory books back in 1998. Now, he is the author of the following 4 book cosmology non-fiction book series: Trillion Theory, (the 1st book in the Ed Lukowich cosmology series). Trillion Years Universe Theory, (the 2nd book in the Ed Lukowich cosmology series). Black Holes Built our Cosmos, (the 3rd book in the Ed Lukowich cosmology series). T Theory Says: Who Owns Our Universe, (the 4th book in the Ed Lukowich cosmology series). Ed is also the author of a futuristic sci-fi novel entitled The Trillionist, which depicts the despicable actions of an older-than-dirt entity which deviously manipulates its planet along a path to disaster. Ed is a former World and Olympian curler and National Coach turned sci-fi cosmology writer. See website www.trillionist.com for his books and e-books.",
  "genres": [],
  "author": "Ed Lukowich",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/34514027-black-holes-built-our-cosmos"
}