{
  "title": "T Theory Says: Who Owns Our Universe",
  "description": "Any idea or clue as to who actually owns our universe? T Theory Says: Who Owns Our Universe, is the 4th cosmology book in the Trillion Theory 5 book series by author and Trillion Theory founder Ed Lukowich. T Theory Says, via captioned pictorials, vividly describes the origin and growth of our cosmos over the past trillion years. T Theory says also delves into the possibilities of ‘who owns our universe.’ T Theory provides a whole new way to see the origin and the trillion-year age of our cosmos. Black holes are shown as the builders of the spheres, solar systems, and galaxies of our gigantic cosmos. Ed says, 'T Theory acceptance will speed our discoveries across the cosmos. To fully understand black holes, and how they built our cosmos, is the key to opening doors to knowing our vast universe.' New T Theory completely disputes the claim that our universe is only 13.7 billion years old and refutes any claims that Big Bang or Nebular theory make as to how our cosmos and our solar system formed. T Theory is ready to become the new paradigm model for our cosmos and our universe.Author Biography:About the Author: Ed Lukowich began writing his new universe theory books back in 1998. Now, he is the author of the following 5 book cosmology non-fiction book series: Trillion Theory, (the 1st book in the Ed Lukowich cosmology series). Trillion Years Universe Theory, (the 2nd book in the Ed Lukowich cosmology series). Black Holes Built our Cosmos, (the 3rd book in the Ed Lukowich cosmology series). T Theory Says: Who Owns Our Universe, (the 4th book in the Ed Lukowich cosmology series). Spinning Black Hole Inside Our Earth, (the 5th book in the Ed Lukowich cosmology series). Ed is also the author of a futuristic sci-fi novel entitled The Trillionist, which depicts the despicable actions of an older-than-dirt entity which deviously manipulates its planet along a path to disaster. Ed is a former World and Olympian curler and National Coach turned sci-fi cosmology writer. See website www.trillionist.com for his books and e-books.",
  "genres": [],
  "author": "Ed Lukowich",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/34514032-t-theory-says"
}