{
  "title": "Witch's Mate",
  "description": "***Can be read as a standalone werewolf shifter billionaire paranormal romance book***   The next arc of the True Mates Series begins with San Francisco Alpha Liam Henney and witch Lara Chatraine as they fight their growing attraction.  When a chance encounter with Liam Henney sparks instant lust, Lara Chatraine discovers that the Lycan Alpha may be her True Mate. Lara Chatraine was born with special powers, but it comes with a price: a curse, one that would put Liam in danger if they pursued their attraction. Determined to protect him, she resists his advances and keeps the knowledge of their true connection to herself.  As Alpha to the most powerful clans on the West Coast, Liam Henney has a duty to his family and his people, not only to protect them, but also to produce the next Lycan heir. But, weeks after their passionate encounter, Liam can’t get Lara out of his mind. The normally constrained and reserved Liam has had one thing on his mind – to possess the bewitching beauty and make her his.  When members of the San Francisco clan turn up dead, suspicion turns to the bloodthirsty mages. Liam and Lara must work together to stop Master Mage Stefan, and take him down before he harms more people and exposes the existence of Lycans and witches to the world. As Liam breaks down her defenses and stokes her desires, can Lara keep him safe from her curse and defeat the mages before it’s too late?   Witch’s Mate is a full-length (over 70,000 words) werewolf paranormal romance with explicit love scenes, naughty language, and shifter suspense action with guaranteed HEA and no cliffhangers!  Although it works as a standalone romance story, this book takes place in the True Mates series. Though not necessary, I recommend you read the rest of the books to understand the world and the main plot.",
  "genres": [
    "Paranormal",
    "Paranormal Romance",
    "Shapeshifters",
    "Romance",
    "Witches",
    "Werewolves",
    "Magic"
  ],
  "author": "Alicia Montgomery",
  "average_rating": "4.48",
  "url": "https://www.goodreads.com/book/show/34511869-witch-s-mate"
}