{
  "title": "مائة طريقة لتحفيز نفسك",
  "description": "\"If you take the best of Wayne Dyer and add it to the best of Anthony Robbins, what you would have would only be half as good as Steve Chandler.\"--Dale Dauten, Chicago Tribune\"Some books that can help you awaken and begin to change are ones by Steve Chandler, who, I am reading lately. Great stuff. I'm becoming a fan of Steve Chandler.\"--Joe Vitale, best-selling author of The Attraction Factor and contributor to The Secret\"Steve Chandler lights you up with the glow of his internal neon. [He is] one of the funniest men I've ever known--what he proposes is so rock solid and reassuring.\"--Lisa Schnebly, The Arizona Republic\"100 Ways to Motivate Yourself is wonderful, inspirational, honest, and courageous. It speaks from every page. It is definitely a book I will recommend to my clients and friends.\"--Devers Branden, coauthor of What Love Asks of UsWith the third refreshed edition of 100 Ways to Motivate Yourself, Steve Chandler helps you create an action plan for living your vision, in business and in life. It features 100 proven methods to positively change the way you think and act--methods based on feedback from the hundreds of thousands of corporate and public seminar attendees Chandler speaks to each year. The book now also includes techniques and breakthroughs he has created for individual coaching clients.100 Ways to Motivate Yourself will help you break through the negative barriers and banish the pessimistic thoughts that are preventing you from fulfilling your lifelong goals and dreams. This edition also contains new mental and spiritual techniques that give readers more immediate access to action and results in their lives. If you're ready to finally make a change and reach your goals, Steve Chandler challenges you to turn your defeatist attitude into energetic, optimistic, enthusiastic accomplishments.",
  "genres": [
    "Self Help",
    "Nonfiction",
    "Personal Development",
    "Psychology",
    "Business",
    "Productivity",
    "Audiobook"
  ],
  "author": "Steve Chandler",
  "average_rating": "4.01",
  "url": "https://www.goodreads.com/book/show/3451132"
}