{
  "title": "The Canary Club",
  "description": "From Book 1: Of Glitter and Gold: A Canary Club Prequel Set during the flamboyant anything-goes era of 1920's America, these three historical romance tales are filled with intriguing characters and rich imagery from the time period—with flappers, jazz music, gangsters, and lavish wealth. Escape to a different decade today with the compelling stories of the Canary Club. This novel can be read before or after The Canary Club. Novelette 1- Gilded Cage Masie, the flaxen-haired daughter of notorious bootlegger Dutch Schultz, returns home from boarding school to find her family in crisis. Her mother is dangerously unstable, her father's empire is on the brink of ruin, and the boy she once loved has become a ruthless killer for hire. To keep her family's dangerous secrets, Masie is forced into a lie that will change the course of her future—and leave her trapped in a gilded cage of her own making. Novelette 2- All That Glitters A dame with brains, moxie, and killer curves, June West isn't your average flapper. She's managed to endear herself to the son of one of the most powerful gangsters in New York, earning herself a spot in the limelight that she's always longed for. With the infamous playboy at her side, June has become accustomed to living the high life. Lavish parties, expensive clothes, sparkling jewels—nothing is beyond her reach. But when her carefully woven web of lies finally catches up with her, she must make an impossible choice… come clean about her past and risk losing everything, or find a way to bury her demons—once and for all. Novelette 3 - Nothing Gold Dickey has been down on his luck since the day he was born. Flat broke and sick of being looked down on, he meets young socialite Lilly Rose at a wild party. The connection is like a strike of lightning. From a wealthy New York family, this debutante is everything he's been told he can never have—and the only thing he wants. Determined to win her, he knows the only way to get her parents approval is with cold hard cash. So when a shot at the biggest score of his life comes around, he just can't refuse…  Perfect for fans of Beatriz Williams' A Certain Age or Libba Bray's The Diviners, The Canary Club by Sherry D. Ficklin will entice Historical Romance fans of all ages. This Gatsby-era tale filled with dazzling speakeasies, vicious shoot-outs, gritty gangsters, and iridescent ingenues has also been compared to the television series Z: THE BEGINNING OF EVERYTHING and BOARDWALK EMPIRE.  \nNovels inThe Canary Club Series by Sherry D. Ficklin:\n\nThe Canary Club (Stand Alone)\nGlitter and Gold: A Canary Club Prequel\nAdditional books following secondary characters coming soon.",
  "genres": [
    "Young Adult",
    "Historical Fiction",
    "Romance",
    "Historical",
    "Fiction",
    "New Adult"
  ],
  "author": "Sherry D. Ficklin",
  "average_rating": "3.95",
  "url": "https://www.goodreads.com/book/show/34514453-the-canary-club"
}