{
  "title": "Amethyst of Youth",
  "description": "The youngest member of the Stonewarden family, Charlotte (Charlie), is 18 years old. As with everyone in her family when they reach that age, she's been told that when she turns 19, she'll be recruited into the family business. She has her warning that she has one year to do anything else she wishes to do - travel, study, work. Whatever she wants to do, she has 365 days to do it. On her next birthday, her life will effectively stop being her own.But Charlie wants nothing to do with the business. The youngest of six, with five older brothers, she wants a different life. Maybe if the family business was something normal like a retail shop or a business centred around trade, she'd feel differently. There are people who say that her family's long term history of robbing from the rich and providing to the poor is a good thing. To her, all she can see is that they are thieves. Plain and simple.Her view is further secured when she and her older brother, Max, are shot at in a local supermarket. Seeing Max lying in blood and later lying unmoving in hospital in a coma, pushes her further in her resolve to find a way to not take part in the activities of her father and brothers.At the shootout she is saved by a checkout operator, Ash. Whilst building their friendship Charlie will learn things about her family that she didn't particularly wish to know. She will hear more and more that she can't share with Ash, and the more she learns, the wider the gap will become.In years she's young, but having lost her mother when she was only nine years old, Charlie has an older soul. The possibilities she'll be presented with during her one final year of her own, will push her in her considerations of how she really wants her life to be.She wants one thing. Her strict ex-military father wants another. The dynamics of her new friendship will pull her in a third direction.How will she chose what's right for her? And what would she have to do to break free from the chains that she can see her father wants to place around her for the rest of her life?",
  "genres": [
    "Romance"
  ],
  "author": "Ann M. Pratley",
  "average_rating": "4.06",
  "url": "https://www.goodreads.com/book/show/34520120-amethyst-of-youth"
}