{
  "title": "My Dark Knight",
  "description": "Love or hate. Life or death. No inbetween. No compromise. No rules in love and war.*Knight. Party monster. Handsome Savage. Doesn’t do monogamy.Elliot. Obsessive. Intense. Uncompromising.Newly single, Knight is done with relationships. All he's interested in is bringing down The Count, an Internet personality who is tarnishing his family name. An opportunity to crush him comes when the audacious clown shows up at the Kings of Hell MC clubhouse to film for his YouTube channel. But when Knight meets Elliot, the man behind The Count, he no longer knows what to do with him.Knight has never seen a more pathetic creature than Elliot. He’s also never met anyone who needed him more. Skinny, messed up, and a bucket of trouble as thick as tar, everything Elliot does seems to be a wordless death wish. No matter how much Knight hates Elliot’s alter ego, under the makeup and theatrics hides a fragile young guy with a passion for history, and Knight can’t help but catch Elliot every time he falls.Elliot has bad taste in men. Always hopelessly attracted to violent brutes, his favorite is a long dead serial killer. But he gets more than he’s bargained for when he seizes an opportunity to meet the man of his dreams. The ghost is manipulative and dangerous, offering Elliot all he’s always wanted, for a price he can’t possibly pay.Elliot is faced with an impossible choice between two men. One alive, one dead.One carnal and honest, one drizzling sweet, poisoned promises into his ear.One unwilling to commit, the other promising an eternity together.And Elliot doesn’t settle for half-measures. He craves a love that is all or nothing, passion that will consume him, and desire to burn him alive. Elliot is ready to either get that, or die trying. POSSIBLE SPOILERS:Themes: enemies to lovers, protector, cruelty, motorcycle club, alternative lifestyles, demons, tattoos, impossible choices, deception, crime, self-discovery, healing, black magic, gothic, commitment, ghosts, possessionGenre: Dark, paranormal romance Erotic content: Scorching hot, emotional, explicit scenesLength: ~145,000 words (Book 2 in the series, can be read as a standalone, but it’s recommended to read book 1 first)WARNING: This story contains scenes of violence, offensive language, and morally ambiguous characters.",
  "genres": [
    "M M Romance",
    "Paranormal",
    "Romance",
    "Fantasy",
    "Enemies To Lovers",
    "Audiobook",
    "Dark"
  ],
  "author": "K.A. Merikan",
  "average_rating": "3.95",
  "url": "https://www.goodreads.com/book/show/34536195-my-dark-knight"
}