{
  "title": "Blood of Victory",
  "description": "November 1940, and the battle to cut Germany's oil supply rages through the spy haunts of the Balkans amid the street fighting of a fascist civil war. This is classic Alan Furst, combining remarkable authenticity and atmosphere with the complexity and excitement of an outstanding spy thriller.\"In 1939, as the armies of Europe mobilized for war, the British secret services undertook operations to impede the exportation of Roumanian oil to Germany. They failed.Then, in the autumn of 1940, they tried again.\" So begins Blood of Victory, a novel rich with suspense, historical insight, and the powerful narrative immediacy we have come to expect from bestselling author Alan Furst. The book takes its title from a speech given by a French senator at a conference on petroleum in 1918: \"Oil,\" he said, \"the blood of the earth, has become, in time of war, the blood of victory.\"November 1940. The Russian writer I. A. Serebin arrives in Istanbul by Black Sea freighter. Although he travels on behalf of an émigré organization based in Paris, he is in flight from a dying and corrupt Europe—specifically, from Nazi-occupied France. Serebin finds himself facing his fifth war, but this time he is an exile, a man without a country, and there is no army to join. Still, in the words of Leon Trotsky, \"You may not be interested in war, but war is interested in you.\" Serebin is recruited for an operation run by Count Janos Polanyi, a Hungarian master spy now working for the British secret services.The battle to cut Germany's oil supply rages through the spy haunts of the Balkans; from the Athenée Palace in Bucharest to a whorehouse in Izmir; from an elegant yacht club in Istanbul to the river docks of Belgrade; from a skating pond in St. Moritz to the fogbound banks of the Danube; in sleazy nightclubs and safe houses and nameless hotels; amid the street fighting of a fascist civil war.Blood of Victory is classic Alan Furst, combining remarkable authenticity and atmosphere with the complexity and excitement of an outstanding spy thriller. As Walter Shapiro of Time magazine wrote, \"Nothing can be like watching Casablanca for the first time, but Furst comes closer than anyone has in years.\"",
  "genres": [
    "Fiction",
    "Historical Fiction",
    "Espionage",
    "Thriller",
    "War",
    "Mystery",
    "World War II"
  ],
  "author": "Alan Furst",
  "average_rating": "3.94",
  "url": "https://www.goodreads.com/book/show/345354.Blood_of_Victory"
}