{
  "title": "Rapariga em Guerra",
  "description": "Uma saga de guerra, um relato da passagem à idade adulta, uma história de amor e de memória, Rapariga em Guerra percorre todas estas facetas e revela-se um romance de estreia ao mesmo tempo perturbador e cheio de esperança, escrito com a força da verdade.Zagreb, 1991. Ana Juric é uma menina de dez anos com um espírito descontraído, que vive com a sua família na capital da Croácia. Mas, nesse ano, a Jugoslávia é abalada pela guerra civil, destruindo a infância idílica de Ana. A paz do dia a dia é manchada pelo racionamento, pelos constantes raids aéreos e os jogos de futebol são substituídos pelo fogo das armas. Os vizinhos começam a desconfiar uns dos outros e a sensação de segurança começa a desvanecer-se. Quando a guerra lhe bate à porta, Ana tem de encontrar um novo caminho num mundo perigoso.Nova Iorque, 2001. Ana é agora uma estudante universitária em Manhattan. Apesar de todas as tentativas para deixar o passado para trás, não consegue escapar às recordações de guerra e aos segredos que guarda até dos que lhe são mais próximos. Perseguida pelos acontecimentos que lhe roubaram a família para sempre, regressa à Croácia depois de uma década de ausência, na esperança de fazer as pazes com o lugar a que um dia chamou casa. Enquanto enfrenta o passado, procura reconciliar-se com a história difícil do seu país e com os acontecimentos que lhe interromperam a infância, há tantos anos.Avançando e recuando no tempo, este livro é um retrato franco e generoso de um país devastado pela guerra, mostrando-nos, com uma escrita brilhante, a impossibilidade de separar a história de um país e a história do indivíduo. Sara Novic revela destemidamente o impacto da guerra numa menina e o seu legado em todos nós. É a estreia de uma escritora que olhou para o passado recente e encontrou uma história que ressoa ainda hoje.",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "War",
    "Book Club",
    "Historical",
    "Contemporary",
    "Audiobook"
  ],
  "author": "Sara Nović",
  "average_rating": "4.01",
  "url": "https://www.goodreads.com/book/show/34527207-rapariga-em-guerra"
}