{
  "title": "The Warrior Chronicles Boxed Set, #1-3",
  "description": "This volume contains the first three novels; Chosen, Hunted and Shadow Lands.Chosen Runner up in the SpaSpa Book Awards 2014 for Action and Adventure!It is said that when war threatens the world, one individual will be selected by prophecy to lead the Shadow Warriors out of the Land of Mist and reclaim the freedom which has been stolen. Shanti has grown up under the constant threat of war. Since she helped her people defeat a raiding party by using a special power, she’s been a hunted woman. Carrying rare abilities and an uncanny fighting aptitude, Shanti is the only hope of salvation for her people. The problem is, she doesn’t believe in her own divinity, and when she flounders, she nearly fails in the duty hanging so heavy on her shoulders. It seems like any other day when Sanders and his band of misfit boys find a foreign woman clinging to life in the wastelands. Oblivious to the weapon they now have in their possession, they are content to harbor the mysterious woman until she is well enough to continue her journey. But when the war spreads its arms and lands on her borrowed doorstep, Shanti has no choice but to reveal her secrets, plunging her saviors into danger. If they band with her, they will face certain death. But to trade her to Xandre, the warlord desperate to add her to his war machine, would be to give up their entire way of life. Hunted With a new Chosen coming forward, Shanti has lost sight of her duty. With her plans unraveling, she does the only thing she can think of– frees her brother and a mysterious stranger from a Graygual camp before heading back to beg for Cayan’s aid. Unfortunately, that stranger was precious to the enemy, guarded by one of the elite. A Superior Officer known as the Hunter, this man always catches his prey, and his focus is now on the elusive, violet-eyed girl and the man she ripped from the his hands. With danger mounting, and one of the best constantly on her heels, Shanti will learn that running will never be enough. Shadow LandsIn order to finally claim her title of Chosen and lead the Shadow People out of the Land of Mist, Shanti must make it through a century’s old system to test her battle awareness, her fighting skill, and her ability to stay alive. She’s about to enter The Trials, and she must do it alone. Separated from Shanti on a dangerous island, Cayan must learn to use his mental skill while keeping his men safe from the people set out to kill them. But as more Inkna and Graygual flood the island, Cayan hears of a sinister force deep in the woods, rigging The Trials and killing any who venture too close. It is now a race against time. The battle to become the Chosen has begun, and the victor is anything but decided.",
  "genres": [
    "Fantasy",
    "Paranormal",
    "Fantasy Romance"
  ],
  "author": "K.F. Breene",
  "average_rating": "4.61",
  "url": "https://www.goodreads.com/book/show/34527385-the-warrior-chronicles-boxed-set-1-3"
}