{
  "title": "A Brief History of Feminism",
  "description": "An engaging illustrated history of feminism from antiquity through third-wave feminism, featuring Sappho, Mary Magdalene, Mary Wollstonecraft, Sojourner Truth, Simone de Beauvoir, and many others.The history of feminism? The right to vote, Susan B. Anthony, Gloria Steinem, white pantsuits? Oh, but there's so much more. And we need to know about it, especially now. In pithy text and pithier comics, A Brief History of Feminism engages us, educates us, makes us laugh, and makes us angry. It begins with antiquity and the early days of Judeo-Christianity. (Mary Magdalene questions the maleness of Jesus's inner circle: \"People will end up getting the notion you don't want women to be priests.\" Jesus: \"Really, Mary, do you always have to be so negative?\") It continues through the Middle Ages, the Early Modern period, and the Enlightenment (\"Liberty, equality, fraternity!\" \"But fraternity means brotherhood!\"). It covers the beginnings of an organized women's movement in the nineteenth century, second-wave Feminism, queer feminism, and third-wave Feminism.Along the way, we learn about important figures: Olympe de Gouges, author of the \"Declaration of the Rights of Woman and the Female Citizen\" (guillotined by Robespierre); Flora Tristan, who linked the oppression of women and the oppression of the proletariat before Marx and Engels set pen to paper; and the poet Audre Lorde, who pointed to the racial obliviousness of mainstream feminism in the 1970s and 1980s. We learn about bourgeois and working-class issues, and the angry racism of some American feminists when black men got the vote before women did. We see God as a long-bearded old man emerging from a cloud (and once, as a woman with her hair in curlers). And we learn the story so far of a history that is still being written.",
  "genres": [
    "Feminism",
    "Nonfiction",
    "History",
    "Graphic Novels",
    "Comics",
    "Philosophy",
    "Politics"
  ],
  "author": "Antje Schrupp",
  "average_rating": "3.80",
  "url": "https://www.goodreads.com/book/show/34540108-a-brief-history-of-feminism"
}