{
  "title": "All this Time",
  "description": "Bear McKinley’s past refuses to let go. Ten years ago, Bear gave up everything—his freedom and his reputation—for his mess of a family. But after years of distance and too many attempts at starting over, he finally has a new life doing noble work in Brazil . . . until his past catches up to him once again. Suddenly he finds himself back in Maple Valley, charged with the care of his missing brother’s children, convinced he’s out of second chances to make his life count. And yet, with every day that passes, these kids, this quirky town and the woman he never stopped missing help patch the holes in his heart. Maybe this is the fresh start he’s been longing for all along. But as his newfound hope grows, so does the mystery surrounding his brother’s activities—and when the threat reaches into the lives of those he loves, it’s clear he can’t run away this time.Fear holds Raegan’s future captive. Raegan Walker is fine. She’s happy working a slew of part-time jobs, still living in her childhood bedroom and rarely venturing from her hometown. At least, that’s what she tells everyone . . . and herself. But she can’t help wondering what might’ve happened if she hadn’t abandoned her art so many years ago—and if Bear McKinley had never left. When Bear returns and she’s commissioned for a painting that just might revive her artistic ambition all in one week, it’s time to finally reach for more than fine. But doing so means facing the fears that have held her back all this time, including admitting the secret she’s kept from Bear and her family. With her dream and her heart on the line, how much will Raegan have to risk to finally chase her happy ending?",
  "genres": [
    "Contemporary",
    "Christian Fiction",
    "Romance",
    "Fiction",
    "Christian Romance",
    "Christian",
    "Clean Romance"
  ],
  "author": "Melissa Tagg",
  "average_rating": "4.49",
  "url": "https://www.goodreads.com/book/show/34564856-all-this-time"
}