{
  "title": "Carceral Capitalism",
  "description": "Essays on the contemporary continuum of incarceration: the biopolitics of juvenile delinquency, predatory policing, the political economy of fees and fines, and algorithmic policing.What we see happening in Ferguson and other cities around the country is not the creation of livable spaces, but the creation of living hells. When people are trapped in a cycle of debt it also can affect their subjectivity and how they temporally inhabit the world by making it difficult for them to imagine and plan for the future. What psychic toll does this have on residents? How does it feel to be routinely dehumanized and exploited by the police?—from Carceral CapitalismIn this collection of essays in Semiotext(e)'s Intervention series, Jackie Wang examines the contemporary incarceration techniques that have emerged since the 1990s. The essays illustrate various aspects of the carceral continuum, including the biopolitics of juvenile delinquency, predatory policing, the political economy of fees and fines, cybernetic governance, and algorithmic policing. Included in this volume is Wang's influential critique of liberal anti-racist politics, “Against Innocence,” as well as essays on RoboCop, techno-policing, and the aesthetic problem of making invisible forms of power legible.Wang shows that the new racial capitalism begins with parasitic governance and predatory lending that extends credit only to dispossess later. Predatory lending has a decidedly spatial character and exists in many forms, including subprime mortgage loans, student loans for sham for-profit colleges, car loans, rent-to-own scams, payday loans, and bail bond loans. Parasitic governance, Wang argues, operates through five primary techniques: financial states of exception, automation, extraction and looting, confinement, and gratuitous violence. While these techniques of governance often involve physical confinement and the state-sanctioned execution of black Americans, new carceral modes have blurred the distinction between the inside and outside of prison. As technologies of control are perfected, carcerality tends to bleed into society.",
  "genres": [
    "Nonfiction",
    "Politics",
    "Theory",
    "Essays",
    "Race",
    "Economics",
    "Social Justice"
  ],
  "author": "Jackie Wang",
  "average_rating": "4.61",
  "url": "https://www.goodreads.com/book/show/34551009-carceral-capitalism"
}