{
  "title": "Baleful Godmother Historical Romance Series Volume One",
  "description": "The first FOUR books in the Baleful Godmother historical romance series.Embark on a journey that stretches from the glittering ballrooms of the aristocracy to the dark underbelly of Regency England.1000 pages (260,000 words) of passion, danger, adventure, and romance—with a little magic thrown into the mix.This collection includes two full-length novels, one shorter novel, and a novella.Unmasking Miss ApplebyResisting Miss MerryweatherTrusting Miss TrenthamClaiming Mister KempUNMASKING MISS APPLEBY (Book 1, a full-length novel)On her 25th birthday, Charlotte Appleby receives an unusual gift from the Faerie godmother she never knew she the ability to change shape.Penniless and orphaned, she sets off for London to make her fortune as a man. But a position as secretary to Lord Cosgrove proves unexpectedly challenging.RESISTING MISS MERRYWEATHER (Book 2, a novella)Sir Barnaby Ware made a mistake two and a half years ago. A massive mistake. The sort of mistake that can never be atoned for.He knows himself to be irredeemable, but the captivating and unconventional Miss Merryweather is determined to prove him wrong.TRUSTING MISS TRENTHAM (Book 3, a full-length novel)Letitia Trentham is noteworthy for three reasons. One, she’s extremely wealthy. Two, she can distinguish truth from lies. Three, she’s refused every man who’s ever proposed to her. Until Letty receives a proposal she can’t turn down.Icarus Reid barely survived the Battle of Vimeiro. He lives for one thing—to find the man who betrayed him to the French. He doesn’t want to marry Miss Trentham; he wants to use her talent for uncovering lies.CLAIMING MISTER KEMP (Book 4, a shorter novel)Lucas Kemp’s twin sister died last year. He’s put aside his mourning clothes, but not his heartache. If Lucas ever needed a friend, it’s now—and who should walk in his door but Lieutenant Thomas Matlock…Lucas and Tom are more than just best friends; they’ve been in love with each other for years. In love with each other—and pretending not to know it. But this time, Tom’s not going to ignore the attraction between them. This time, he’s going to push the issue.1000 pages (260,000 words) of Regency romance\"Too good to miss.\"~ Caz @ All About Romance",
  "genres": [
    "Romance",
    "Historical Romance"
  ],
  "author": "Emily Larkin",
  "average_rating": "4.11",
  "url": "https://www.goodreads.com/book/show/34558509-baleful-godmother-historical-romance-series-volume-one"
}