{
  "title": "His Beautiful Samurai",
  "description": "Publisher’s His Beautiful Samurai has been extensively revised for release with Ai Press. It is a VASTLY different story from the 2006 edition from Torquere Press. Sex and murder don’t mix but Detective Toshiro Genjin and psychic John Holmes do… John Holmes comes to Tokyo to help stop a killer. Through the use of his psychic abilities, he can help find out things that no one else sees. Toshi is a policeman who reluctantly accepts John's help, but from their first touch, John knows he wants more than that. He wants all Toshi can give him, and the heat between them surprises, and delights him. The modern killer, a historical murder of two samurai, and Toshi's need to honor other commitments combine to make the blooming love between John and Toshi difficult. And dangerous. The more deeply they delve into the past, the more unsure the future looks. Could the heat between them be the only thing that can solve the mystery, despite all of the difficulties that stand in their way? Can they find a way to keep what is most precious to them? Haunting and powerful, His Beautiful Samurai is a murder mystery, a romance, and a study in the supernatural. Get your hands on it today! Chapter One Tokyo, Japan, Present day Toshi stared down at the fresh corpses. Around him, the flashbulbs of the crime scene photographers went off like tiny fireworks. Shimatta! He’d failed again and now stood, helpless, staring at the victims’ grisly fate. His hands already encased in latex gloves, he pressed his palms together, steepled in front of him, and bowed his respect to the dead. As did his partner, Natsuka Yamamoto, beside him. The victims of this third killing in nearly six months, their naked, stiffening bodies still intertwined, had been skewered. The weapon, as with the other victims, a samurai’s katana, long sword. His stomach churned, as it never failed to do when he found the Ronin Killer’s victims. Natsuka delicately covered the victims with a white cloth then approached Toshi, shaking his head sadly. The katana tented the cloth in the most macabre way. “You ready for them to go?” Toshi sighed. Forensics had already done the preliminary, time and cause of death. As if they didn’t already know the cause. His hand went into the inner pocket of his jacket, rummaging for the cigarettes he’d made the mistake of trying to quit the week before. Then stopped. No smoking on a crime scene. He’d have to wait. “Go ahead,” he murmured to his partner. Natsuka nodded and went to give the order. With his mind ticking off the ways he’d failed to prevent yet another killing, Toshi surveyed the room while the Identification Division people finished up. He began to look around. Though he wasn’t sure why. Not one crime scene had turned up any useful leads. All they had so far in all this time was that the form of the murders was identical and that the victims were either married people having an illicit affair or a couple together whose relationship was rocky. Natsuka had a theory that the killer’s motive was at least in part a sick desire to keep them together. As good a motive as any. But that still didn’t explain the fact that each time they got a trace on a suspect, that same suspect ended up dead two days later back in their own home, dead from a fatal coronary and the word “Naomasa” carved into the deceased’s forehead. Autopsies showed that the wounds were self-inflicted moments before death. Men and women, both in service jobs, both solitary types. Profiling had gotten them that far. And only that far. Where were they getting the damned swords? The murder weapons turned out to be original swords smithed by one Koto Naomasa, one of the great sword smiths of nineteenth century Japan.",
  "genres": [
    "M M Romance",
    "Mystery",
    "Romance",
    "Paranormal",
    "Contemporary",
    "Fantasy",
    "Gay"
  ],
  "author": "Sedonia Guillone",
  "average_rating": "3.72",
  "url": "https://www.goodreads.com/book/show/345463.His_Beautiful_Samurai"
}