{
  "title": "Enchantress of Numbers",
  "description": "New York Times bestselling author Jennifer Chiaverini illuminates the fascinating life of Ada Byron King, Countess of Lovelace--Lord Byron's daughter, the world's first computer programmer, and a woman whose exceptional contributions to science and technology have been too long unsung.  The only legitimate child of Lord Byron, the most brilliant, revered, and scandalous of the Romantic poets, Ada was destined for fame long before her birth. Estranged from Ada's father, who was infamously -mad, bad, and dangerous to know, - Ada's mathematician mother is determined to save her only child from her perilous Byron heritage. Banishing fairy tales and make-believe from the nursery, Ada's mother provides her daughter with a rigorous education grounded in mathematics and science. Any troubling spark of imagination--or worse yet, passion or poetry--is promptly extinguished. Or so her mother believes.  When Ada is introduced into London society as a highly eligible young heiress, she at last discovers the intellectual and social circles she has craved all her life. Little does she realize that her delightful new friendship with inventor Charles Babbage--brilliant, charming, and occasionally curmudgeonly--will shape her destiny. Intrigued by the prototype of his first calculating machine, the Difference Engine, and enthralled by the plans for his even more advanced Analytical Engine, Ada resolves to help Babbage realize his extraordinary vision, unique in her understanding of how his invention could transform the world. All the while, she passionately studies mathematics--ignoring skeptics who consider it an unusual, even unhealthy pursuit for a woman--falls in love, discovers the shocking secrets behind her parents' estrangement, and comes to terms with the unquenchable fire of her imagination.  In Enchantress of Numbers, New York Times bestselling author Jennifer Chiaverini unveils the passions, dreams, and insatiable thirst for knowledge of a largely unheralded pioneer in computing--a young woman who stepped out of her father's shadow to achieve her own laurels and champion the new technology that would shape the future.",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Historical",
    "Book Club",
    "Adult",
    "British Literature",
    "Audiobook"
  ],
  "author": "Jennifer Chiaverini",
  "average_rating": "3.58",
  "url": "https://www.goodreads.com/book/show/34555334-enchantress-of-numbers"
}