{
  "title": "Forsworn Fate",
  "description": "***This is a Sisters of Danu novella and can be read in any order. Chronologically, it takes place just before book one, Forbidden Fate.***  She will not be the unwanted bride…  Ceara has been promised to Garreth Mac Cecht her entire life. Arranged marriages are not at all common within her tribe, yet she had accepted her fate long ago, reveled in it even. Being arranged to marry a man as handsome as Garreth was no hard fate…until the day he made his true feelings known. Ceara now knows she means nothing more to him than another responsibility, and one he is determined to avoid at all costs.  Ceara has no idea why her mother arranged her marriage so many years ago, but if her mama will not release her from her duty, she will release herself. Ceara refuses to be ignored by her intended husband any longer. Tis time to forswear their cursed fate.   He is not ready to take a wife…  Garreth has been ignoring Ceara determinedly for years. Why chase the one lass he is destined to marry, when he can have all the other lassies, first? It was a fine idea, until the day he took it too far. In his need to keep her at arm’s length, he insulted her pride in order to save his own.  Ignoring her is easier than accepting the truth: he cares for Ceara more than he wants to admit. But pushing her away is the only control he has over his otherwise sealed fate. So, he pushed hard, too hard, and potentially destroyed any remaining affections she held for him. Enough. Tis time to prove to Ceara that he will make a fine husband.  But, on the very night he decides to finally do right by Ceara, she breaks off their agreement completely. He deserves it, fool that he is, but he will not allow it. Nay. He will have Ceara back. But convincing her that he is worthy will be quite a task. Fortunately, Garreth is up to the challenge…",
  "genres": [
    "Historical Romance",
    "Romance",
    "Novella",
    "Historical"
  ],
  "author": "Mia Pride",
  "average_rating": "4.24",
  "url": "https://www.goodreads.com/book/show/34538230-forsworn-fate"
}