{
  "title": "Heroes of Urowen: Gamebook",
  "description": "* Bestseller in Spain * Second edition (November 2018) This edition edited by Michael Reilly. Fast-paced and addictive, ‘Heroes of Urowen’ mixes the best of fantasy novels, videogames and role-playing games into an interactive tale of adventure. Travel to a land full of magic and powerful enemies, where every choice you make may help to improve your chance of success. Fight to the death, upgrade your armor, gain powerful weapons, learn spells, discover treasures, gamble, get drunk in a tavern or enjoy other adult pleasures – all this and much more can be experienced in the mythical Lands of Urowen, where the road to becoming a hero will be full of many surprises. Create your character, choose your race and profession, and live the adventure in a world full of dangers, where every action and every important decision will mark your future. ‘Heroes of Urowen’ is written in the style of classic gamebooks from the 80s, but incorporates a new and very exciting game system, totally upgraded and directed to an adult audience. Featuring elaborate rules that allow you to enjoy dynamic battles, use magical and special items, and play at five different difficulty levels, this is a gamebook where you truly live the adventure, becoming a hero of Urowen! Opinions published on Amazon.es: * Very addictive. * The best gamebook I’ve read in my life. * Pure role. * A 10 for the writer. * Excellent. * A great gamebook. I hope the author continues to write them. * If you like gamebooks, you have to have it. * I encourage the author to write more gamebooks like this one. Did you know that ‘Heroes of Urowen’ was the number one for sales in role-playing games at the popular Gigamesh Bookstore (Spain), and that David Velasco was featured in the TOP 20 of Gigamesh’s bestselling books of 2012? Also, he was the only Spanish writer in that ranking, alongside authors such as George R.R. Martin, Terry Pratchett and Brandon Sanderson. This all happened during 2012 and was thanks to ‘Heroes of Urowen’ – now available in English. Website and social networks: www.david-velasco.net/english",
  "genres": [
    "Gamebooks",
    "Fantasy"
  ],
  "author": "David Velasco",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/34586288-heroes-of-urowen"
}