{
  "title": "Feather of Hawk - Rebellion: Epic historical fiction based on a true story.",
  "description": "ONE MAN AGAINST THE MIGHT OF ROME\n Ancient Scotland.  Two thousand years ago.  A land ravaged by Roman invaders.  One man would defy the might of the Empire.  His name was Calach the Swordsman.  This is his story…   \nEPIC HISTORICAL FICTION BASED ON A TRUE STORY\n ‘Feather of Hawk – Rebellion’, is the story of an ordinary man whose love for family and tribe drives him on a ruthless quest for revenge. Calach sips from the poisonous cup of hatred, but will this make him no better that the vile beast of Rome? Or will the Feather of Hawk, a mysterious gift from a young warrior woman, offer a new way forward in a world where blood and tears are sacrificed on the altar of war? A devastating winter invasion destroys everything Calach loves and drives the warrior on a course of bloody revenge. Calach has to face a professional Roman army with only a band of refugees to back him up. The Celts have the heart to fight, but hearts do not win wars — weapons of iron, shields of bronze, spear warriors, sword warriors and skilled riders with chariots win wars. With a miracle in the form of returning warriors, Calach leads a brutal insurrection that culminates in an epic battle against the hated invaders. His cunning, intelligence and valour are a match to General Agricola, the Roman Governor of Britain, who soon realizes that Calach is no ordinary foe.  \nAbout the Author\n  Dave Michael was born and went to school in Liverpool, Northern England. He is a graduate of the Welsh College of Music and Drama. Before becoming a full time author he worked as a handyman, seaman, drama teacher and Community film trainer. He has written and produced touring theatre and several short film projects. ‘Secrets of the Damned’ was a theatre piece that toured for five years in the North West Region of England. The piece told the personal life story of Robert Tressell, author of the novel, ‘ The Ragged Trousered Philanthropists.’ Since 1996, Dave has lived and worked in Eire, where he has been inspired by the landscapes of the West Coast. The historical fiction book,‘Feather of Hawk – Rebellion’ is his most extensive piece of work and has taken twelve years to develop. When he is not writing, he likes to walk landscape, where he is calmed by nature; watching swallows and hawks fly is one of his favourite pastimes.",
  "genres": [
    "Historical Fiction",
    "Fiction"
  ],
  "author": "Dave Michael",
  "average_rating": "3.85",
  "url": "https://www.goodreads.com/book/show/34568790-feather-of-hawk---rebellion"
}