{
  "title": "Jesus as Mother: Studies in the Spirituality of the High Middle Ages",
  "description": "From the Introduction: The opportunity to rethink and republish several of my early articles in combination with a new essay on the thirteenth century has led me to consider the continuity-both of argument and of approach-that underlies them. In one sense, their interrelationship is obvious. The first two address a question that was more in the forefront of scholarship a dozen years ago than it is today: the question of differences among religious orders.  These two essays set out a method of reading texts for imagery and borrowings as well as for spiritual teaching in order to determine whether individuals who live in different institutional settings hold differing assumptions about the significance of their lives.  The essays apply the method to the broader question of differences between regular canons and monks and the narrower question of differences between one kind of monk--the Cistercians--and other religious groups, monastic and nonmonastic, of the twelfth century.  The third essay draws on some of the themes of the first two, particularly the discussion of canonical and Cistercian conceptions of the individual brother as example, to suggest  an interpretation of twelfth-century religious life as concerned with the nature of groups as well as with affective expression.  The fourth essay, again on Cistercian monks, elaborates themes of the first three. Its subsidiary goals are to provide further evidence on distinctively Cistercian attitudes and to elaborate the Cistercian ambivalence about vocation that I delineate in the essay on conceptions of community. It also raises questions that have now become popular in nonacademic as well as academic circles: what significance should we give to the increase of feminine imagery in twelfth-century religious writing by males? Can we learn anything about distinctively male or female spiritualities from this feminization of language? The fifth essay differs from the others in turning to the thirteenth century rather than the twelfth, to women rather than men, to detailed analysis of many themes in a few thinkers rather than one theme in many writers; it is nonetheless based on the conclusions of the earlier studies. The sense of monastic vocation and of the priesthood, of the authority of God and self, and of the significance of gender that I find in the three great mystics of late thirteenth-century Helfta can be understood only against the background of the growing twelfth- and thirteenth-century concern for evangelism and for an approachable God, which are the basic themes of the first four essays. Such connections between the essays will be clear to anyone who reads them. There are, however, deeper methodological and interpretive continuities among them that I wish to underline here. For these studies constitute a plea for an approach to medieval spirituality that is not now--and perhaps has never been--dominant in medieval scholarship. They also provide an interpretation of the religious life of the high Middle Ages that runs against the grain of recent emphases on the emergence of \"lay spirituality.\" I therefore propose to give, as introduction, both a discussion of recent approaches to medieval piety and a short sketch of the religious history of the twelfth and thirteenth centuries, emphasizing those themes that are the context for my specific investigations. I do not want to be misunderstood. In providing here a discussion of approaches to and trends in medieval religion I am not claiming that the studies that follow constitute a general history nor that my method should replace that of social, institutional, and intellectual historians.  A handful of Cistercians does not typify the twelfth century, nor three nuns the thirteenth. Religious imagery, on which I concentrate, does not tell us how people lived. But because these essays approach texts in a way others have not done, focus on imagery others have not found important, and insist, as others have not insisted, on comparing groups to other groups (e.g., comparing what is peculiarly male to what is female as well as vice versa), I want to call attention to my approach to and my interpretation of the high Middle Ages in the hope of encouraging others to ask similar questions.",
  "genres": [
    "History",
    "Religion",
    "Nonfiction",
    "Theology",
    "Medieval",
    "Medieval History",
    "Christianity"
  ],
  "author": "Caroline Walker Bynum",
  "average_rating": "4.17",
  "url": "https://www.goodreads.com/book/show/345766.Jesus_as_Mother"
}