{
  "title": "The Secret of Spellshadow Manor",
  "description": "A spine-tingling new fantasy-mystery, perfect for adults or teens who enjoyed Harry Potter... What would you do if you spotted a man following a young woman, but no-one else could see him? Like most sane people, student Alex Webber thought he was hallucinating - perhaps he'd consumed something bad at the party he'd been attending that night, or he was severely overtired. But when he sees the mysterious man following Natalie again the very next day, he can no longer disbelieve his eyes. Although Natalie denies the man's existence, Alex sees her walking with him down a road in his neighborhood he's never seen before - and can't help but follow. After a bizarre, but strangely short journey, he finds himself standing before a towering iron gate wreathed in gray ivy, behind which looms a decrepit old house named Spellshadow Manor. Spellshadow, with its beautiful yet sinisterly decorated hallways, ever-changing outdoor scenery and very unusual residents... Alex will quickly learn it is a place that is as wondrous as it is deadly. Especially for a normal person like him. What if you found yourself recruited to an institute of magic, only to discover you really couldn't do magic? What if your enrollment there was all one big, terrible mistake? If you were at Spellshadow, you'd keep it a secret. A deep, dark, deadly secret... Because Spellshadow's elusive Head is hiding a secret of his own, one that Alex soon realizes he and Natalie must uncover at all costs if either of them wishes to leave the Manor alive - and before it's too late. Mystery, suspense, and plenty of twists and turns; an unforgettable experience awaits you in Spellshadow Manor... Welcome in. BUY NOW!",
  "genres": [
    "Fantasy",
    "Young Adult",
    "Paranormal",
    "Magic",
    "Fiction",
    "Urban Fantasy",
    "Young Adult Fantasy"
  ],
  "author": "Bella Forrest",
  "average_rating": "3.67",
  "url": "https://www.goodreads.com/book/show/34587081-the-secret-of-spellshadow-manor"
}