{
  "title": "The Brothers Three",
  "description": "Have you ever wondered what it would be like to be plunged into a dangerous fantasy world?All Will Blackwood ever wanted was a little adventure. A fantasy addict and apprentice contractor in New Orleans, struggling to make ends meet, he has long wished for an escape from the real world.Late one night, he and his brothers receive a surprise inheritance: a staff with a mysterious stone on top, a pair of rogue's bracers, and a sword that Will can barely lift. A man with strange powers shows up to take the sword, and the three brothers barely escape with their lives. Searching for an explanation, it is not until a magical key whisks them across time and space, into a terrifying version of New Orleans ruled by wizards, that Will accepts the truth about his family's past.It seems Will Blackwood has found his adventure. But this isn't one of his fantasy novels, or a gaming campaign with friends. In his father's world, magic and monsters are real. Choices are life and death. And they have no idea how to get home . . .\"An extraordinary new series\" - Book Reader's HeavenO.D. Book Reviews says: \"Action packed and exciting . . . reading this book has left me wanting to go on a fantasy bender.\"\"So far in this year of books this is my absolute favorite. Not a moment of boredom.\" - Reading in Ecuador\"I love this book!\" - Book Room Reviews\"One of the best fantasy quest books that I have read in a long time\" - Blood Rose Books\"A fantasy geek's dream come true . . . I love Green's writing and his ability to sweep me completely into a story.\"- Girl Who Reads Book Blog\"I do believe Layton Green has moved into my top 5 author category - not an easy feat to attain!\" - A Novel Source\"Layton Green is an absolutely brilliant writer\" - Everything to Do With Books",
  "genres": [
    "Fantasy",
    "Fiction",
    "Magic",
    "Urban Fantasy",
    "Audiobook",
    "Adult",
    "Science Fiction Fantasy"
  ],
  "author": "Layton Green",
  "average_rating": "3.94",
  "url": "https://www.goodreads.com/book/show/34605438-the-brothers-three"
}