{
  "title": "The Treasure Principle: Unlocking the Secret of Joyful Giving",
  "description": "Flip-Flop Your Concept of Giving!Bestselling author Randy Alcorn introduced readers to a revolution in material freedom and radical generosity with the release of the original The Treasure Principle in 2001. Now the revision to the compact, perennial bestseller includes a provocative new concluding chapter depicting God asking a believer questions about his stewardship over material resources. Readers are moved from the realms of thoughtful Bible exposition into the highly personal arena of everyday life. Because when Jesus told His followers to “lay up for yourselves treasures in heaven,” He intended that they discover an astounding secret: how joyful giving brings God maximum glory and His children maximum pleasure. Discover a joy more precious than gold!Priceless treasure is within your reach. And with it, liberating joy .In Randy Alcorn ’s The Treasure Principle, you’ll unearth a radical teaching of Jesus—a secret wrapped up in giving. Once you discover this secret, life will never look the same. And you won’t want it to!“Supercharged with stunning, divine truth! Lightning struck over and over as I read it.”-John Piper , Senior Pastor, Bethlehem Baptist Church , Minneapolis“The Treasure Principle will change your life! This book is destined to become a classic.”-Howard Dayton , Co-CEO, Crown Financial Ministries“The Scripture passages and illustrations really ring true. Just what I needed!”-Hugh Maclellan , President, The Maclellan Foundation“I enthusiastically endorse The Treasure Principle . I hope millions will read it.”-Ronald W. Blue , Founder and CEO, Ronald Blue & CompanyStory Behind the BookAfter years of writing and teaching on the theme “God owns everything,” in 1990 Randy Alcorn was sued by an abortion clinic (for peaceful, nonviolent intervention for the unborn). Suddenly he had to resign as a pastor and was restricted to making minimum wage. Legally unable to own anything, Randy gave all his book royalties to missions work and need-meeting ministries. He and his family have experienced the reality of The Treasure Principle—that God really does own everything, takes care of us, and graciously puts assets into our hands that we might have the joy and privilege of investing in what will last for eternity.",
  "genres": [
    "Christian",
    "Christian Living",
    "Nonfiction",
    "Christianity",
    "Faith",
    "Theology",
    "Finance"
  ],
  "author": "Randy Alcorn",
  "average_rating": "4.09",
  "url": "https://www.goodreads.com/book/show/34600.The_Treasure_Principle"
}