{
  "title": "Destiny Changed",
  "description": "Great erotica from one of the most talented and unique authors in the genre!Destiny Changed continues the gripping erotic story of a hapless American girl’s descent into a fetish, BDSM life that began with Destiny Taken. Destiny Changed is a sexy, poignant examination of what it means to be oneself, to be a friend, to be satisfied, and to be happy.Fatina – formerly Karimah, who was formerly Destiny Michelle Hutton – arrives at the bordello resort, the Enakazin, with her new owner and Master, Negasi. She is about to become a houri of one of the most renowned brothels in the Middle East. She will qualify as one of their premium courtesans, uniquely adapted to her new life pleasuring the rich, royal, powerful clients of the Enakazin.Fatina’s body is modified to meet the standards and requirements of her Master. Her mind, already modified upon her exit from the Control Institution for Delinquent Women, will be further nudged along the career path laid out for her by Negasi, the owner and absolute ruler of the Enakazin.Fatina is trained by rote, rod, and reshaping her own desires and goals. She becomes a talented, dedicated prostitute of the Retreat. She finds companionship, friendship and love among the other courtesans, especially among those who had originated in the West. She commits to surviving, and creating the best life she can in the brothel’s strangely governed environment. Her experiences are titillating, tantalizing, unusual, moving, filled with love, fear, uncertainty, risk, and incredible sexual encounters.Publisher’s Summary: As is typical in Ms. Napoli’s well-written novels, the reader is taken deeply into Fatina’s mind, and perceives what she experiences through her eyes. Destiny Changed dips into erotic horror, but is filled with moments of love, lust, close friendships, simple pleasures, and one fetish/BDSM erotic episode after another. We suspect that you’ll find more than one of the erotic scenes to be the best you’ve ever encountered.Though Destiny Changed can be read on its own, we suggest that you may most appreciate it if you first read Destiny Taken, Book 1 in the Destiny Lost Series.This is a solid, adult contemporary fantasy novel of over 63,000 words. It contains fetish erotica and BDSM scenes. It includes extensive body modification, self-image alteration, hair fetishes including hair changes, removal, and shaving, smoking, weight gain, compulsions and addiction, bondage, discipline, short and long-term control and submission, along with imaginative heterosexuality and erotic bisexuality. It contains M/f, M/f/f, F/f, and F/f/f sexual encounters.It goes without saying that Destiny Changed is serious adult drama containing open discussions and themes of intense sexuality, erotica, BDSM and sexual relations. Parts of Destiny Changed may be too intense for some readers.",
  "genres": [],
  "author": "Giulia Napoli",
  "average_rating": "4.18",
  "url": "https://www.goodreads.com/book/show/34613733-destiny-changed"
}