{
  "title": "A Quest For Healing: A Memoir That Weaves Together Science, Family and Faith",
  "description": "Dr. Raymond Park is one of the world’s leading skin care scientists, credited with developing a formula that cured both his infant and four year old sons of acute atopic dermatitis, a formula that would go on to become the leading brand for sensitive skin in Korea and then the world. The path to his discovery was a lifetime in the making and there were dark moments when he might have turned away, never to offer his unique vision of skin care to the world.With heart and candor Dr. Park shares memories about his life, fraught with the pressures of growing up in one of the most academically pressured and competitive societies in the world. Constant was his inner struggle to define himself on his own terms in the face of intense parental pressure about education, a troubled relationship with his father, men and women, and then, one of the most precious relationships of all: as a father with his sons, especially his middle son, who provokes the unforeseen depths of his own cultural conditioning, challenging him to the most difficult struggle of his life:: how to be the parent he wanted to be deep in his heart.A Quest for Healing is at once intimate portrait of life in South Korea, of the struggle to gain admission into the nation’s most coveted university, Seoul National at a time when the horrors of the Gwangju massacre and the government’s betrayal of its own people were exposed, igniting the new student movement. When his closest friends were heading deeper into the struggle for social change, Dr. Park wrestled with his own conscience and the voice inside that was leading him away from the others, to his own way. The way that would eventually lead him to the crossing of the great mysteries of spirit with his knowledge of science, giving voice to his mission for skin care. It is the story of the forces, inner and outer, that shape a person’s destiny, someone who is engaged in the classic struggle to find what is truest in the human heart.",
  "genres": [
    "Nonfiction"
  ],
  "author": "Raymond   Park",
  "average_rating": "4.56",
  "url": "https://www.goodreads.com/book/show/34614444-a-quest-for-healing"
}