{
  "title": "Tender No Judgment: #1 In The Desperation To Power Series",
  "description": "\"Love at first sight\", dark erotic thriller with an HEA! Adult only, explicit content, possible emotional triggers. Underneath the \"sweet plot\" is a \"sexy dark romance\"Micah is broken, turned into a limping, scarred relic by war. He was honed as a killer and then discarded by those he saluted, forced into a life of solitude on his mountain. Sabrina is a bookworm who secretly wants her dashing prince to come and sweep her off her feet. But mostly she just meets toads who want to grope her and use her. She retreats to her little bookstore until one day a charming man walks into her life. She thinks he is the man she’s been dreaming of, but instead of carrying her into the sunset, he leaves her for dead on a mountain. Micah rescues her, and their love quickly flourishes. But their bliss is interrupted when unforeseen international events test their bond and jeopardize their lives. They are soul mates, the only ones for each other. But is that enough to overcome these powerful, evil currents?⭐️⭐️⭐️⭐️⭐️ Intense story, interesting characters!ByK.B.on April 20, 2017When I picked up Tender No Judgement, by Elle St. John, I was expecting a typical romance novel in which love scenes are loosely tied together with a weak plot, but this was not the case! In the beginning of the novel, the main characters have a difficult time relating because of their past experiences. Sabrina has been physically abused by a man, and Micah has trauma from his experiences in the military. As the story continues, Sabrina and Micah learn to trust each other. The subplot of international espionage separates the two lovers for some time, but in the end, they are able to find each other and create a future for themselves. The subplot was pretty detailed, with Sabrina being called upon to help recover a dangerous piece of technology from the Russians, even though she had no military background. I enjoyed this change of pace with a strong female character who does what the situation requires. A lot of romance novels focus on a heroine who sits around waiting to be rescued, and while Sabrina is that type of person at the beginning of the novel, by the end you can see her transformation into a strong, independent woman. Both Sabrina and Micah have to face the trauma they have been through, and in their long conversations they are able to work through their emotional hurts and the shadows of their past. There are quite a few love scenes, and readers should be aware that there is also a scene of sexual violence. This is actually an important aspect of the book, as the character has to come to terms with the violence she experienced and learn to move forward with her life. However, due to this adult content, I’d definitely recommend this book for readers who are 18+. Tender No Judgement isn’t just a love story, it also addresses real issues that are faced by women in all walks of life. I can’t wait for the second book in the series to come out!",
  "genres": [],
  "author": "Elle St.John",
  "average_rating": "4.08",
  "url": "https://www.goodreads.com/book/show/34613371-tender-no-judgment"
}