{
  "title": "Hunter",
  "description": "Welcome to Brawlers Bar…If there was a way to completely destroy his life, Hunter Black would do it. He was a catastrophe waiting to happen. Survival was his only priority and having to leave his old life behind that meant a job of the legal variety. He’d found one as a bartender at Brawlers Bar and a safe place in a huge house with the rest of the bar crew who quickly became the family he’d never had. The one thing Hunter didn’t need was his old life tracking him down.Deputy Wren Gramble hated his job and his weekend assignment of staking out a bar in the middle of nowhere waiting for drunks. Although he’d heard the homophobic and racist jokes going around about the crew and customers, he kept his head down and stuck to his job and nothing else. He despised being driven back into the closet, but he’d reached the end of the line and what he’d do if he earned another transfer he didn’t know. Linus Trenton was considered the normal one in his family and according to the weird ones that meant he should be punished on a daily basis. He never came out one way or another, if he found someone attractive he was attracted. His life was complicated enough having a crush on the sweet and awkward Hunter but now he had to throw Wren into the mix. Linus didn’t have time for dating or romance, most of the time he didn’t even think about having a sex life, although, Wren and Hunter were ruining his calm.Hunter was in lust with the handsome deputy the minute the man pulled him over, but a man like that wouldn’t give him the time of day. His friend, Linus, was another matter all together. Hunter wanted both. His bosses made it work with their man, why couldn’t he? Could Hunter prove he wasn’t as much of a screw up as he appeared or would he have to call in backup to claim his men?",
  "genres": [
    "M M Romance",
    "Menage",
    "M M M",
    "Romance",
    "Gay",
    "Contemporary",
    "LGBT"
  ],
  "author": "J.M. Dabney",
  "average_rating": "4.15",
  "url": "https://www.goodreads.com/book/show/34621603-hunter"
}