{
  "title": "THE DIARY OF A CANADIAN NOBODY: A fictional diary of a modern family during the events in 2001 - 2002",
  "description": "Arthur Lakelady is a man with many worries.Alys, his wife, is infatuated with the home renovator re-modeling their kitchen, or so their teenage daughter Gwen says. How Gwen knows this is a mystery to Arthur for she never leaves her bedroom, except to go to school and work.Gwen's worried a family breakup will spoil her chances of a good university. That doesn't concern Arthur for Gwen passes all her tests, often with more than 100%. That does worry Arthur, schools, he feels, should understand the meaning of percentages. While Gwen's university career may be assured, Arthur is worried his son Lance may not even graduate from junior school, unless Lance forsakes ice hockey and soccer soon.Neither child's university career may happen because Arthur's biggest worry lies at work where his previously pleasant Canadian employer has just been bought out by Americans and they've replaced the local executives in order to introduce new ways. Arthur can see the new executives don't think he'll ever be new again. Arthur may become a victim of rightsizing, that harmless-sounding word that simply means fired.One particular new way that is worrying Arthur is IT and the Internet, which has become ubiquitous in 2001 and an ill-prepared Arthur is somehow supposed to lead his troops through this minefield. Arthur hires a young temp, Lydia, to help him but she only adds to his worry. He worries about her wish to be closer to him, which isn't allowed in the new ways, and he worries she is just drifting through life without proper direction, which isn't a good thing in Arthur's old ways.All these immediate, personal worries aren't helped by a truly serious one -- 9/11. A moder⚠n 'Mad Mahdi' has just killed thousands of Americans at the World Trade Center and Canada has agreed to join America and Britain in invading Afghanistan. Arthur sees that the world needs someone who can clear the confusion, make the complex simple and package it into manageable pieces -- it needs a diarist. Arthur maybe a nobody right now but in centuries to come he feels he could be considered the 'Samuel Pepys of the 21st Century.'If you love diary novels that are fun to read, like Bridget Jones Diary, The Diary of a Nobody, Diary of a Provincial Lady, or Adrian Mole Diaries, you're sure to love this story of love, sex & entanglements, in the years that created our present times. A humor book for teens and adults about serious historical and personal fears.\"This book is both funny and moving. One page you might laugh out loud, the next you might be in tears.\" Ashley Emma .",
  "genres": [],
  "author": "Arthur Paul James",
  "average_rating": "4.23",
  "url": "https://www.goodreads.com/book/show/34610437-the-diary-of-a-canadian-nobody"
}