{
  "title": "Treason Keep",
  "description": "According to legend, the last king of the Harshini sired a half-human child, known as the Demon Child, born to destroy a god . . . BestFantasyBooks.com lists the first book of the Demon Child Trilogy Medalon in the world's top 30 best political fantasy books along with New York Times Best Seller, Game of Thrones Don't miss the next exciting installment!  Treason Keep  is the second book in the epic Demon Child trilogy, part of the 10 adventure-filled, action-packed books of the Hythrun Chronicles , from international bestselling author, Jennifer Fallon. With the epic scope of the Hobbit and Lord of the Rings , the humor of David Eddings in his heyday, the drama of Diana Gabaldon and the action, epic worldbuilding and political scheming of George R R Martin, and you'll have some idea of the fabulous worlds and the intriguing characters awaiting you in the Demon Child Trilogy .R'shiel is on the brink of death, her destiny unfulfilled. To save her, the renegade Harshini Brak reluctantly makes a terrible bargain, as survival of the hidden Harshini race hangs in the balance.Political turmoil spreads across Medalon and its neighbouring countries as the gods vie for power, using humans as pawns in a deadly battle for supremacy. On Medalon's northern border, Tarja and the Defenders are far too few to stand against the invaders from Karien. The only thing that can save them is an alliance with Hythria. But can Tarja trust his former enemy, Damin Wolflblade, warlord and heir to the throne of Hytrhia?Meanwhile, King Hablet of Fardohnya weds his eldest daughter, Princess Adrina, to the Karien Heir. hoping to place his grandchild on the Karien throne. But the wayward and rebellious Adrina has her own plans, and the fate of three nations dangle upon her whim.To avert bloodshed on a massive scale, three warring kingdoms must unite to diffuse the threat of Karien, a nation led by possessed priests and fanatics. Only the demon child - half human and half Harshini - has the power to compel obedience, but will she master her new talents in time to stop a divine war ... Featuring a heady blend of political intrigue, war, and one of the great love-hate relationships in fantasy fiction,  Treason Keep  is sure to please the many fans of epic fantasy.",
  "genres": [
    "Fantasy",
    "Fiction",
    "Epic Fantasy",
    "High Fantasy",
    "Magic",
    "Dragons",
    "Science Fiction Fantasy"
  ],
  "author": "Jennifer Fallon",
  "average_rating": "4.06",
  "url": "https://www.goodreads.com/book/show/346222.Treason_Keep"
}