{
  "title": "The Tycoon's Barbarian Slave Full Story",
  "description": "Alexandros Stephandis has never been a merciful man. He knew how to look gorgeous and sophisticated but behind the sophisticated veil there was a real predator, a hunter, a pagan hunter who knew how to play dirty and strike mercilessly. When Alexandros wants something, he takes it and nothing can stand in his way. In this life there are two kinds of people: those who rule, and those who are ruled. There are those who were born to win and those who were born to lose. Along with the entire family business, Alexandro inherited the family's share in Gieva. Not that brutality bothered him, but he never knew how the half-animal Barbarian women were hunted or how they were actually trained and sold. Then he saw Tamara and decided to have a Barbarian bet of his own; the training he would do himself. Tamara is one of the Barbarian pretty women. She was destined to be born on the planet of Barbaria, where people are still primitive and act like animals. She walks around half naked because she doesn't know what real clothes are. She climbs trees to get leaves and fruits to feed on. She doesn't think it is wrong to eat dead people when a famine strikes. Because of environmental and genetic mutation, the women of Barbaria were very alluring wild animals. Hundreds of years ago, a huge climatic catastrophe hit the earth. Then a large piece of land split and created a planet of its own. Due to different weather and other environmental differences between Earth and the new planet, Barbaria became different in many ways. When a large space organization found out about the planet, it was reported in the news and everyone forgot about it. Only a powerful international company called Gieva knew how to secretly benefit from Barbaria in the most inhuman ways. For years Gieva sent armed rockets and spaceships to hunt women from Barbaria and bring them to Earth to be tamed and sold for a high price. Those women were mercilessly trained and sold for millions of dollars to those who could afford them.",
  "genres": [
    "BDSM"
  ],
  "author": "Julia Ban",
  "average_rating": "3.17",
  "url": "https://www.goodreads.com/book/show/34608057-the-tycoon-s-barbarian-slave-full-story"
}