{
  "title": "Down Girl: The Logic of Misogyny",
  "description": "Misogyny is a hot topic, yet it's often misunderstood. What is misogyny, exactly? Who deserves to be called a misogynist? How does misogyny contrast with sexism, and why is it prone to persist--or increase--even when sexist gender roles are waning? This book is an exploration of misogyny in public life and politics, by the moral philosopher and writer Kate Manne. It argues that misogyny should not be understood primarily in terms of the hatred or hostility some men feel toward women generally. Rather, it's primarily about controlling, policing, punishing, and exiling the \"bad\" women who challenge male dominance. And it's compatible with rewarding \"the good ones,\" and singling out other women to serve as warnings to those who are out of order. It's also common for women to serve as scapegoats, be burned as witches, and treated as pariahs.Manne examines recent and current events such as the Isla Vista killings by Elliot Rodger, the case of the convicted serial rapist Daniel Holtzclaw, who preyed on African-American women as a police officer in Oklahoma City, Rush Limbaugh's diatribe against Sandra Fluke, and the \"misogyny speech\" of Julia Gillard, then Prime Minister of Australia, which went viral on YouTube. The book shows how these events, among others, set the stage for the 2016 U.S. presidential election. Not only was the misogyny leveled against Hillary Clinton predictable in both quantity and quality, Manne argues it was predictable that many people would be prepared to forgive and forget Donald Trump's history of sexual assault and harassment. For this, Manne argues, is misogyny's oft-overlooked and equally pernicious underbelly: exonerating or showing \"himpathy\" for the comparatively privileged men who dominate, threaten, and silence women.",
  "genres": [
    "Feminism",
    "Nonfiction",
    "Philosophy",
    "Politics",
    "Gender",
    "Sociology",
    "Womens"
  ],
  "author": "Kate Manne",
  "average_rating": "4.21",
  "url": "https://www.goodreads.com/book/show/34640834-down-girl"
}