{
  "title": "The Blighted Reaches",
  "description": "Step into the world of NINRAGON!This is the first installment of an ongoing anthology series, the pilot to the first season of 11 episodes that recount the adventures of Auric the Black. The old elven race of the Ninraé have long withdrawn into their huge secluded fortresses and are preparing to leave this world altogether.Their lives are about to change dramatically when a small band of them lead by the outsider Darachel discovers a badly wounded, unconscious human-male.Between life and death, Auric tells the story of his life, how he grew up in a barbarian background blessed or cursed with acute intelligence, struggling for survival and his way of life among the Valgarians and their wars, not knowing that a great fate awaited him.As Auric’s story unfolds, he and Darachel are soon to discover a bond between them, formed by something more than sheer circumstances, something that harkens back to the Elder Days, when the Fire Wars raged and dragons walked in flesh and held reign over the Earth.But there are whispers, both in dreams and reality, voices long unheard that could mean that those days are not as dead and gone as everybody may think. It seems not only Auric has entered the Blighted Reaches.Here comes a series that presents to you the top fantasy novels from German cult author and comic writer/artist Horus W. Odenthal starting with the sprawling saga of Auric the Black.The author’s first fantasy trilogy, presented to you in the first 11 episodes making up the first season of this series, won him as a dark horse independent author the bronze medal of the DPP, the German Fantastic Award, both for Best Debut Author and Best Series.“Today, there’s simply nothing that can compare to NINRAGON. It’s definitely the best epic fantasy work published in recent years.” – fantasybook.deNINRAGON lifts the veil of fairy tale and legends from the fantasy genre and shows what life in those fantasy worlds could really have been like. Its splendor, its horror, the dark and gritty and its sense of wonder. A sharp, fresh look at old tropes in the tradition of George R.R. Martin, Joe Abercrombie, Steven Erikson, Richard Morgan and Glen Cook.",
  "genres": [],
  "author": "Horus W. Odenthal",
  "average_rating": "3.00",
  "url": "https://www.goodreads.com/book/show/34639221-the-blighted-reaches"
}