{
  "title": "Finding My Way 2016: 98 Stories and Scriptures Based on Ancient Liturgical Rhythms of the Church",
  "description": "When I write these devotions, often the world falls away, and I sink into the words and closeness with God. Nothing gets much better than that. In Waynesville, Illinois during the first years of our marriage and family, we learned to pray, learned the art of Sabbath, and felt the power of church love. Then one day Margaret said, “I think it’s time for us to get into ministry.” After campus ministry at Murray State University for Margaret, and two years in the Unification Church for me, nothing mattered more to us. And that was the problem. It was important for our family that I, especially, learn to spend time at home, spend time with Chris, Marc, and Andi, and especially with Margaret. That was happening. I no longer automatically said yes to every phone call that called me away. Neither did she. In 1988 we went back to seminary and in 1989 accepted a position at Christian Campus Fellowship at the University of Illinois in Champaign-Urbana. No more selling Britannica Encyclopedia, no more selling Jacques seed corn, and … no more guaranteed income. Or at least not much. Now it was time to ask our friends for support. So we did. Lots of our friends responded with monthly checks. One friend invited us to his family’s lakeside home twice a year for vacations. And I began to write letters to our supporters. That was fun for me, and every month I came up with a story or two and maybe a simple point to make. The main idea was al-ways the Thank you! Thank you, God … thank you, friends. A few stories in 1999, a few more in 2000 and 2001, then in 2002 I began to write reflections every day during Lent and Easter, and every day during Advent and Christmas. I started with a text from the Roman Catholic lectionary, got quiet, and let words flow. The devotions in this book are from 2016. Writing in this way, I am learning to love God, and I am remembering again and again how much he loves me. That is what I hope for you, too, as you read. God bless you.",
  "genres": [],
  "author": "David Sandel",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/34633120-finding-my-way-2016"
}