{
  "title": "Shadows At The Fair",
  "description": "Ignorance is truly bliss for recently widowed Maggie Summer, owner of Shadows Antiques, when she arrives at the prestigious Rensselaer County Spring Antiques Fair. Sadly, she won't remain ignorant of the suspiciously high mortality rate among her fellow antiques dealers for long.Rumors are everywhere. The most recent victim, John Smithson, died of poison at a show just last week, and many of the same dealers are here at Rensselaer. They make the identical circuit year after year, so they know each other well. Or do they?Murder is still far from Maggie's mind as she arranges her Shadows booth: some Currier & Ives prints here, Winslow Homer wood engravings on the hack wall, other prints arranged on tables and easels by category. With eleven years' experience, she knows her stock. So far the worst thing that has happened was putting the wrong price tag on a Homer engraving and having to sell it for $170 instead of $1,700.Maggie doesn't intend for that to happen again, and she doesn't intend to worry about murder. This show's security is tight. But she can't help observing her colleagues with fresh eyes. Some, Eke Gussie White in the booth next door, are dear friends, and Gussie's assistant, her twenty-year-old nephew, Ben, who has Down's syndrome, is a delightful new acquaintance. Others, however, even people she's known for years, suddenly seem suspect.The opening night wine has hardly stopped flowing when death claims another victim. Maggie will still sell a few antique prints, but she'll spend most of her time looking for a killer and trying to save a vulnerable young friend. Will Maggie herself become a potential victim? The answer may be in one of Maggie's prints, but she has hundreds in her booth. Where should she begin?With its riveting behind-the-scenes glimpse of antiques shows and its revealing data on antique-print values, Shadows at the Fair introduces a captivating new series that unveils the powerful mysteries of antique prints even as it entertains.",
  "genres": [
    "Mystery",
    "Cozy Mystery",
    "Cozy",
    "Fiction",
    "Mystery Thriller",
    "Adult"
  ],
  "author": "Lea Wait",
  "average_rating": "3.57",
  "url": "https://www.goodreads.com/book/show/1208211.Shadows_At_The_Fair"
}