{
  "title": "Blame It on the Shame: Complete Series",
  "description": "The COMPLETE series in ONE box set. No cliffhangers. I never wanted anything of his...until her.  Shame. It wounds us. It damages us. Or, for the few poor souls out there like me...it defines us. I'm the son of the devil, himself—the most feared mob boss who ever lived. I was cursed from the moment I took my first breath. I hate him...and I never wanted to become him. And I sure as hell never, ever, wanted anything of his. Until her. My name is Ricardo DeLuca. There are two things you need to know about me. The first? Is that I'm in love with the girl who belongs to my father. The second? Is that it turns out I'm my father's son after all. Only worse. My name is Lou-Lou, and you probably think I'm a bitch. You would be right—because I am. You think you know all there is to know about me because of the man I belong to. What you don't know—is my past, because I'll never tell you. What you don't know is my shame. Because if you did—you'd be worse off than dead. You'd be broken. There are two sides to every story...this is ours. Due to strong language, some violence, explicit sexual content, and some dark elements, this book is not intended for readers under the age of 18. Trigger This series contains elements of emotional, sexual, and physical cruelty. Any readers with sensitivity to the above topics should proceed with caution, and at their own risk. Please  This is a spin-off series of the full-length novel 'Blame It on the Pain' (featuring a different couple.) Part 1 of this series is considered the prequel to that novel and the events in Part 1 take place before any of the events in 'Blame It on the Pain' do. Part 2 of this series follows the same timeline of Blame It on the Pain and if you have not read that book, you might miss some little 'Easter eggs' and things might not be as clear to you. Part 3- (the final installment) takes place after 'Blame It on the Pain'. While it is not required that you read Blame It on the Pain before starting this series, it will enhance your experience.",
  "genres": [
    "Dark",
    "Romance",
    "Crime",
    "Dark Romance",
    "Collections"
  ],
  "author": "Ashley Jade",
  "average_rating": "4.49",
  "url": "https://www.goodreads.com/book/show/34640887-blame-it-on-the-shame"
}