{
  "title": "The Brave Athlete: Calm the F*ck Down and Rise to the Occasion",
  "description": "The Brave Athlete solves the 13 most common mental conundrums athletes face in their everyday training and in races. You don’t have one brainyou have three; your ancient Chimp brain that keeps you alive, your modern Professor brain that navigates the civilized world, and your Computer brain that accesses your memories and runs your habits (good and bad). They fight for control all the time and that’s when bad things happen; you get crazy nervous before a race, you choke under pressure, you quit when the going gets tough, you make dumb mistakes, you worry about how you look. What if you could stop the thoughts and feelings you don’t want? What if you could feel confident, suffer like a hero, and handle any stress? You can. The Brave Athlete from Dr. Simon Marshall and Lesley Paterson will help you take control of your brain so you can train harder, race faster, and better enjoy your sport. Dr. Marshall is a sport psychology expert who trains the brains of elite professional athletes. Paterson is a three-time world champion triathlete and coach. Together, they offer this innovative, brain training guide that is the first to draw from both clinical science and real-world experience with athletes. That means you won’t find outdated “positive self-talk” or visualization gimmicks here. No, the set of cutting-edge mental skills revealed in The Brave Athlete actually work because they challenge the source of the thoughts and feelings you don’t want. The Brave Athlete is packed with practical, evidence-based solutions to the most common mental challenges athletes face. Which of these sound like you? Why do I have thoughts and feelings I don’t want? I wish I felt more like an athlete. I don’t think I can. I don’t achieve my goals. Other athletes seem tougher, happier, and more badass than me. I feel fat. I don’t cope well with injury. People are worried about how much I exercise. I don’t like leaving my comfort zone. When the going gets tough, the tough leave me behind. I need to harden the f*ck up. I keep screwing up. I don’t handle pressure well. With The Brave Calm the F*ck Down and Rise to the Occasion, you can solve these problems to become mentally strong and make your brain your most powerful asset.",
  "genres": [
    "Sports",
    "Nonfiction",
    "Psychology",
    "Self Help",
    "Fitness",
    "Audiobook",
    "Health"
  ],
  "author": "Simon Marshall",
  "average_rating": "3.93",
  "url": "https://www.goodreads.com/book/show/34625105-the-brave-athlete"
}