{
  "title": "Socialism Is Dead! Long Live Socialism!: The Marx Code—Socialism with a Human Face:",
  "description": "This work is divided into two autonomous books.The first book, The State, represents a radically new political system of society, one which is the most democratic system ever possible! This is a completely new society, a real civil society, which otherwise in the capitalist system is only a utopia. In this book, I scrutinize the principles of scientific socialism; i.e., all those principles of Marxism concerning the state that build socialism as a political system.The second book, The Economic Theory of Socialism, is a sequel, and as far as I know, the only sequel of the greatest work by Karl Marx – Capital. The economics of socialism makes Marx’s socialism already completely possible. In this book, I scrutinize the economic laws that build socialism as a more effective economic system than capitalism. These laws are extracted from Marx’s main work – Capital.From 1917 to 1991, the totalitarian system in USSR and East Europe was called socialism, and even by the scientific nonsense and absurd names of communism and communist system. In this system, the official ideology was allegedly Marxism, but really it could not endure any Marxist criticism. There was never any socialism anywhere!In the twentieth century, we passed through a system of utopian socialism as proof that this was not socialism that was not possible, but for the utopia of writers before and after Marx. We were visited by a utopian socialism, which at the contemporary stage is simply capitalism – state, monopolistic.There is no better application of Keynes’s doctrine than the “socialism” of the twentieth century. His “planned capitalism” is actually “planned socialism.”About the Todor Bombov lives in Varna, Bulgaria, the town called the Pearl of Black Sea.",
  "genres": [
    "Novels",
    "Drama",
    "Book Club",
    "Contemporary",
    "Politics"
  ],
  "author": "Todor Bombov",
  "average_rating": "4.37",
  "url": "https://www.goodreads.com/book/show/34640476-socialism-is-dead-long-live-socialism"
}