{
  "title": "Petty Treason",
  "description": "It is a truth universally acknowledged that a Fallen Womanof good family must, soon or late, descend to whoredom.Miss Sarah Tolerance refuses to follow the path of the Fallen Women who have gone before her. She's a straight shooter, with her pistol as well as her wit, and her mind is as sharp as the blade of her sword. Miss Tolerance is an Agent of Inquiry, a private investigator of sorts--the sole one of her kind in London, in this year of 1810 with mad King George III on the throne and Queen Charlotte acting as his Regent. Her aim was to trace lost trinkets, send wastrel husbands back to their wives, and occasionally provide protection to persons with more money than sense--but she is continually drawn into the plots of others. Her newest case poses a puzzle unlike any she has faced who killed the Chevalier d'Aubigny? The French émigré was beaten to death in his own bed, found by his retainers the next morning, all the doors and windows of the house sealed tight. The murder is a classic locked-room mystery, but Miss Tolerance knows she can find the key. As Miss Tolerance examines the situation and interviews witnesses and suspects, she realizes things are far more complicated than she originally suspected--for the Chevalier had more enemies than he had friends, and Miss Tolerance is hard pressed to find someone who didn't wish him dead. Her search for his killer takes her from the lowest brothels of the seedy London underworld, where men go to indulge their more aggressive desires, to the Royal Family and a Duke who must hide his perversions or risk the Throne. Welcome to Miss Tolerance's Regency London, where nothing is what it seems and the only way to serve justice is to follow conscience rather than law.",
  "genres": [
    "Mystery",
    "Historical Fiction",
    "Historical",
    "Historical Mystery",
    "Alternate History",
    "Regency",
    "Fiction"
  ],
  "author": "Madeleine E. Robins",
  "average_rating": "3.91",
  "url": "https://www.goodreads.com/book/show/346223.Petty_Treason"
}