{
  "title": "The Evolution of Morality",
  "description": "Moral thinking pervades our practical lives, but where did this way of thinking come from, and what purpose does it serve? Is it to be explained by environmental pressures on our ancestors a million years ago, or is it a cultural invention of more recent origin? In The Evolution of Morality , Richard Joyce takes up these controversial questions, finding that the evidence supports an innate basis to human morality. As a moral philosopher, Joyce is interested in whether any implications follow from this hypothesis. Might the fact that the human brain has been biologically prepared by natural selection to engage in moral judgment serve in some sense to vindicate this way of thinking -- staving off the threat of moral skepticism, or even undergirding some version of moral realism? Or if morality has an adaptive explanation in genetic terms -- if it is, as Joyce writes, \"just something that helped our ancestors make more babies\" -- might such an explanation actually undermine morality's central role in our lives? He carefully examines both the evolutionary \"vindication of morality\" and the evolutionary \"debunking of morality,\" considering the skeptical view more seriously than have others who have treated the subject. Interdisciplinary and combining the latest results from the empirical sciences with philosophical discussion, The Evolution of Morality is one of the few books in this area written from the perspective of moral philosophy. Concise and without technical jargon, the arguments are rigorous but accessible to readers from different academic backgrounds. Joyce discusses complex issues in plain language while advocating subtle and sometimes radical views. The Evolution of Morality lays the philosophical foundations for further research into the biological understanding of human morality.",
  "genres": [
    "Philosophy",
    "Science",
    "Nonfiction",
    "Evolution",
    "Psychology",
    "History",
    "Biology"
  ],
  "author": "Richard Joyce",
  "average_rating": "3.84",
  "url": "https://www.goodreads.com/book/show/346558.The_Evolution_of_Morality"
}