{
  "title": "More Than Survival: The New Life Series #1",
  "description": "-More Than Survival, - is book one in -The New Life Series.- The ten Christian novels in this series are written to offer the reader a wholesome entertainment, starting back in a simpler but not easier time. The pioneer's spiritual strength and never quite attitude is refreshing and inspiring. The adventurers followed the trail to a new, raw and wild land intending to conquer challenges they could never have imagined. This is the story of Benjamin Slater, and how he courageously coped with the dangerous and uncivilized frontier. His lessons of self-preservation came at a high cost as he experienced the pain of loss and joys of accomplishment. When his father decided to leave the wagon train, he had no idea of the events that he had set in motion. An Indian raiding party maneuvered ahead of them, staying out of sight. Nine-year-old Sarah rode inside and Ben sat on the back of the covered wagon with his feet hanging down. Just as they stopped, the raiders fiercely attacked. Later, working through his pain, Ben buried his parents and searched for his sister but she was gone and so were the horses, his father's rifle and most of the things that had been in the wagon. The grave situation took him to his knees. This is the beginning of the amazing adventures and hazardous exploration of the land that Ben developed into the huge and productive S. and J. Ranch. As he gave this territory his heart, he was given the rare gift of a special blessing by the Lion of Judah. From the precious white foal named Buddy came the most beautiful white stallion ever bred. The ranch plays an awesome role in the end times. Not all the secrets of the area are revealed in this first book, but the reader will continue to explore and rejoice with the wonderful characters as this exciting series unfolds.",
  "genres": [],
  "author": "Louise Bouck",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/34649770-more-than-survival"
}