{
  "title": "Between Two Worlds. Escape From Tyranny : Growing Up in the Shadow of Saddam",
  "description": "Zainab Salbi was eleven years old when her father was chosen to serve as Saddam Hussein's personal pilot, her family often forced to spend weekends with Saddam where he watched their every move.As a palace insider, Zainab offers a singular glimpse of what it is like to come of age under a dictator and provides an intimate portrait of the man she was taught to call uncle. She watched as Saddam pitted friends, spouses, and even children against each other to compete for his approval. She was sent to donate her mother's jewelry to one of the world's richest men, asked to erase her memory as she heard of crimes she was not supposed to hear of, and witnessed her mother hiding her tears lest it upset Saddam. Her mother eventually sent Zainab to America for an arranged marriage, to spare her from Saddam’'s growing affection, but the marriage intended to save her turned out to be another world of tyranny and abuse. Despite extraordinary psychological challenges, Zainab started over. She forged a new identity as a champion of female victims of war, dedicating her life to speaking out on behalf of oppressed women around the world. Her unique nonprofit organization has been featured in the media numerous times, including multiple appearances by Zainab on The Oprah Winfrey Show. But until now, Zainab has never told this very personal tale. In this intimate portrait, she reveals the tyrant through the eyes of a child, a secretly rebellious teenager, an abused wife, and ultimately a professional woman coming to terms with the horror of secrets her mother revealed only on her deathbed. Through her ability to come to terms with the child she used to be and the dangerous world in which she managed to survive, Between Two Worlds emerges as a story of heroism like no other. A powerful portrait of an ordinary Iraqi family reluctantly entangled in Saddam Hussein's world, forced to live on the palace grounds, an unsettling place where dark secrets are unearthed, one after the other. …But after Zainab finds the courage to escape, and to fight persecution in an abusive arranged marriage, she ultimately creates a new life where she dedicates herself to female victims worldwide. Zainab's inspiring story is a gripping combination of fear, humanity, and personal strength.\"--Jean Sasson, author of the #1 international bestseller,Mayada, Daughter of Iraq",
  "genres": [
    "Nonfiction",
    "Memoir",
    "Biography",
    "History",
    "Biography Memoir",
    "Politics",
    "Book Club"
  ],
  "author": "Zainab Salbi",
  "average_rating": "4.23",
  "url": "https://www.goodreads.com/book/show/346545.Between_Two_Worlds_Escape_From_Tyranny_"
}