{
  "title": "Roadie",
  "description": "This book features one stronghearted young woman and her five rockstar lovers. All six of them are struggling to overcome their dark pasts while falling more deeply in love. P.S. Nobody said she had to pick just one. Turn the page only if you enjoy true love, raw grief, genuine human connection, rock 'n' roll, and books with unfiltered, unashamed sex. “I'm in love with five bad boy rockstars. But is our love strong enough to overcome our tragedy?” Lilith Goode is dating—and in love with—five gorgeous rockstars. She shares her body, her heart, and her soul with each one of them. Paxton is the leader, covered in tattoos, and cocky as hell. Michael is the bad boy determined to change his ways. Ransom is the scarred one, dark and beautiful. Muse is the practical one, the enigma with a silver mohawk. Copeland is the boy next door with a penchant for reading romance novels. Together, these six twisted souls make up one beautiful whole. But can one woman really love five different men? What if they're all tattooed, pierced, scarred, and broken? And what if they all need her as much she needs them? Their love is as unconventional as their music. Rock 'n' roll, romance, redemption. A story about finding beauty everywhere … even in a lie. Roadie, Book #2 in the Rock-Hard Beautiful Trilogy a New Adult Erotic Rocker Romance from International Bestselling Author C.M. Stunich ***ROADIE is a 90,000 word novel about strong emotions, difficult pasts, and vibrant love. It contains bad boy rockers, rock 'n' roll concerts, handcuffs, friendship, explicit sex scenes and forgiveness. This is a MMMFMM book with a STRONG focus on the woman (although there is some light M/M in here, too) aka a reverse harem novel (one woman, five guys). It has a happy ending, NO cliff-hanger, and is the second book in a trilogy.",
  "genres": [
    "Reverse Harem",
    "Romance",
    "Contemporary",
    "Music",
    "Menage",
    "Erotica",
    "New Adult"
  ],
  "author": "C.M. Stunich",
  "average_rating": "4.21",
  "url": "https://www.goodreads.com/book/show/34661973-roadie"
}