{
  "title": "Arabisk Jazz",
  "description": "Dagdrømmeren Ahmed Taroudant bor i det 19. arrondissement i Paris, en kulturel smeltedigel hvor jøder, kristne og muslimer lever fredeligt dør om dør. Men alt det ændrer sig brat, da Ahmed en dag finder sin smukke nabo Laura brutalt myrdet. Alt tyder på en religiøst motiveret forbrydelse, og Ahmed, der fordriver dagene med at ryge pot og læse krimier på sin altan, bliver hurtigt politiets hovedmistænkte, men han er ikke den eneste.Det er nu op til makkerparret Rachel Kupferstein and Jean Hamelot at redde trådene ud. Opklaringen fører det umage makkerpar rundt i kvarterets afkroge, fra den lokale rabiate imam – over nabolagets narkobander og en strøm af nye designerdrugs – til Brooklyn i New York, hvor de møder langt farligere fundamentalister.En stærk og prisbelønnet krimidebut fra den fransk-arabiske forfatter Karim Miské. Vinder af Grand Prix de Litterature Policière og Prix du Meilleur Polar des Lecteurs de Points og English Pen Award. Pressen skiver:»Løfterig debutkrimi med farver på paletten, livfulde karakterer og stemningsfulde toner.«– Adam Holm, Weekendavisen»Virkeligheden banker eftertrykkeligt på, i et multietnisk Paris, hvor jagten på eksistentielle ståsteder kan føre flere veje: Man kan omfavnes af fundamentalisme af forskellig art eller lægge afstand til enhver form for åndelig tvang - Ahmeds egen neurotiske eskapisme er en slags helt privat kulmination.«**** – Lars Ole Sauerberg, Jyllands-Posten»Det er befriende dejligt, når et forlag kaster sig uden om ellers forventede krimier og lancerer en satsning på det danske marked. […] Dette er en krimi, som sagtens kan læses to gange – fuld af etnisk charme, pariserstemning, madoplevelser på ægte bistromanér, og en handling, der både pirrer, overrasker og forløser.«***** – Bente Wiik, Fyens Stiftstidende»Krimien er ikke uden hverken humor eller ironi, den er spændende, og så giver den et veloplagt sprogligt og kulturelt indblik i noget, jeg slet ikke vidste, jeg ikke vidste noget om.«**** – Julia, Femina»Uden at virke anmassende eller moralsk får Miské på den måde belyst nogle af de spændinger, der blandt andet førte til angrebet på Charlie Hebdo foretaget af et terrornetværk fra netop dette arrondissement.«– Tonny Vorm, Information",
  "genres": [
    "Fiction",
    "Mystery",
    "Crime",
    "France",
    "Noir",
    "Novels",
    "Thriller"
  ],
  "author": "Karim Miské",
  "average_rating": "3.38",
  "url": "https://www.goodreads.com/book/show/34675904-arabisk-jazz"
}