{
  "title": "Their Bridgewater Brides Bundle",
  "description": "This bundle contains the first three books in the USA Today, bestselling Bridgewater Ménage series at one low price!Book 1: Their Kidnapped Bride-Emma James felt secure in her life. Money, social standing and the protection of her step-brother. Or so she thought. When she discovers his dark secrets, he turns on her and sells her to a western brothel to keep her quiet. There, she's forced to work or participate in an auction. A virgin auction ... and she's the prize. One look at Emma James and Whitmore Kane and Ian Stewart know she would belong to them. Marriage was the only way to truly claim her...so they bid and bid well. As their bride, they return to the Bridgewater Ranch and teach her the ways to please not one husband, but two. But danger has tracked Ian around the world and threatens their newfound relationship. Together, can they fight the demons of the past while forging a future?Book 2: Their Wayward BrideWhen Laurel Sinclair's uncaring father seeks to pawn her off in marriage as part of a business deal, she seeks to avoid her fate by fleeing. But running away in a Montana blizzard proves to be a terrible mistake. When handsome ranchers Mason and Brody find the stranded redhead next to her injured horse, they take her in and immediately decide to make her theirs, convinced they can convert the beautiful stranger to an unusual arrangement of marrying them both. The Bridgewater way of one woman marrying two husbands is foreign to Laurel, but she soon grows to love the two protective men who awaken her to a world of carnal pleasures she never knew existed. She grows to love them for their guidance and protection. But will her happiness be threatened by the secret she harbours? Will Mason and Brody still love her if they discover who she is? And what will happen when her scheming father and the cruel man he wanted her to marry finally track her down? Book 3: Their Captivated BrideThe Bridgewater way of two men marrying one woman is uncommon in the Montana territory. But three men marrying one woman? That is unheard of, especially for beautiful Olivia Weston. Her fate, it seems, will have her married to one man - a man she doesn't love.But when her betrothed treats her in a cruel manner, she rejects him and not long afterwards catches the eye of three handsome and virile ranchers. Cross, Rhys and Simon are as different as three men can be. But they have one thing in common; they are determined to offer Olivia the protection of marriage and the promise of endless carnal pleasures. Olivia worries that her instant attraction and hasty agreement to marry three men stems from a defect in her character. What kind of woman not just love three men, but make the most intimate parts of herself available to their lustful attention? The chemistry between them is like lightning. Can she deny it? Or will Olivia submit to become the most sated Bridgewater wife in this ongoing ménage series? This book contains Their Kidnapped Bride, Their Wayward Bride and Their Captivated Bride If you own these three titles, do not purchase this book, as there is NO NEW CONTENT.",
  "genres": [
    "Menage",
    "Historical"
  ],
  "author": "Vanessa Vale",
  "average_rating": "4.24",
  "url": "https://www.goodreads.com/book/show/34676800-their-bridgewater-brides-bundle"
}