{
  "title": "When Timbers Start: a Bell Hammers Short",
  "description": "Originally published in THE NEW HAVEN REVIEW, this story features a young married couple who struggle through the rough landscape of Southern Illinois in the late 1950's. They argue over the purchase of a five-dollar-a-month Sears and Roebuck kitchen table, but it ends up saving lives.  Regarding this story, author and editor Brian Slatterly said, \"“Loved this story because Lance wrote about people who don’t get written about enough and he did it with humor, compassion, and heart.”  :: PRAISE FOR LANCELOT SCHAUBERT ::  “I’m such a fan of Lance Schaubert’s work. His unique view of things and his life-wisdom enriches all he does. We’re lucky to count him among our contributors.” — Therese Walsh, author of The Moon Sisters and Editorial Director of Writer Unboxed  “Lancelot Schaubert exhibits his talents in many forms from poetic verse to lyrical prose to musical compositions, all the while infusing them with charisma, passion, and wit. A true creative, Schaubert is one to watch in the literary world.” —Heather Webb, author of Rodin’s Lover & Becoming Josephine  “Lance Schaubert writes with conviction but without the cliché and bluster of the propaganda that is so common in this age of blogs and tweets. Here is a real practitioner of the craft who has the patience to pay attention. May his tribe increase!” — Jonathan Wilson Hartgrove, author of Common Prayer and The Awakening of Hope  “Lancelot was the kind of student every writing teacher hopes to have in her attentive, thoughtful, a bit quirky, and innovative. Since his time in my classroom, he has continued to impress me. He ‘sees,’ and his essays, poetry, and fiction are full of details that enable his audience to see. Bravo, Lance.” — Jackina Stark, author of Things Worth Remembering and Tender Grace  “[He writes] characters with distinctive personalities, multi-layered, and unpredictable. [They have] natural voices, succinct and unique to each character.” — The Missouri Scriptwriting Fellowship  “Schaubert’s narratives are emotionally stirring with both a vulnerable sensibility and rawness to them. They take you on a journey full of open wounds, intimate successes and personal delights. His words have a calmness, a natural ease but the meaning is always commanding and dynamic.” — Natalie Gee, Brooklyn Film Festival",
  "genres": [],
  "author": "Lancelot Schaubert",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/34670824-when-timbers-start"
}