{
  "title": "The Rise and Fall of D.O.D.O.",
  "description": "Alternate cover edition of ASIN B01NAE8AW4You think you know how the world works? Think again.From bestselling author Neal Stephenson and critically acclaimed historical and contemporary commercial novelist Nicole Galland comes a captivating and complex near-future thriller that questions the very foundations of the modern world.1851 EnglandThe Great Exhibition at London’s Crystal Palace has opened, celebrating the rise of technology and commerce. With it the power of magic – in decline since the industrial revolution began – is completely snuffed out. The existence of magic begins its gradual devolution into mere myth.21st Century AmericaMagic has faded from the minds of mankind, until an encounter between Melisande Stokes, linguistics expert at Harvard, and Tristan Lyons, shadowy agent of government, leads to the uncovering of a distant past.After translating a series of ancient texts, Melisande and Tristan discover the connection between science, magic and time travel and so the Department of Diachronic Operations – D.O.D.O. – is hastily brought into existence. Its mission: to develop a device that will send their agents back to the past, where they can stop magic from disappearing and alter the course of history.But when you interfere with the past, there’s no telling what you might find in your future…Written with the genius, complexity, and innovation that characterize all of Neal Stephenson’s work and steeped with the down-to-earth warmth and humour of Nicole Galland’s storytelling style, this exciting and vividly realized work of science fiction will make you believe in the impossible, and take you to places – and times – beyond imagining.",
  "genres": [
    "Science Fiction",
    "Fantasy",
    "Fiction",
    "Time Travel",
    "Audiobook",
    "Historical Fiction",
    "Magic"
  ],
  "author": "Neal Stephenson",
  "average_rating": "3.86",
  "url": "https://www.goodreads.com/book/show/34677510-the-rise-and-fall-of-d-o-d-o"
}