{
  "title": "Loved by a Dragon",
  "description": "Book Seven of the bestselling Fallen Immortals series **START with KISS OF A DRAGON (Book 1)** LEKSANDERI am a Dragon Prince of the House of Smoke… and I am in love with the wrong woman.  I never meant to fall for an angeling. And I wasn’t supposed to have the duty of fulfilling a ten-thousand-year-old treaty to protect humanity. But now I’m trapped between the immutable facts of magic and the irresistible force of my love. When a fae queen offers unparalleled sex and an unprecedented renewal of the treaty, the temptation is substantial. If only the prospect didn’t leave me hollow inside…  ERELAH I am Protector class, Chastity faction—an angeling whose sworn duty and greatest joy is protecting humanity. The House of Smoke is likewise a guardian, and their prince is one of my oldest friends. Any angeling worth her wings would struggle with the Sin of Envy to take my place. But they know not of Leksander’s stubbornness in refusing his duty to mate and produce a dragonling. How hard can it be to win a human’s heart? I would give my life if it would help. All depends upon this…  He must win her heart or finally let her go. Her vow of Chastity means she’s never known love. Either they’ll save the mortal and immortal worlds with a Love that is True… or they’ll bring a Fall like the world has never seen.  The FALLEN IMMORTALS series is a modern Beauty and the Beast story with flaming HOT dragon shifters, vengeful Dark Fae, and beguiling fallen angels.  THE FALLEN IMMORTALS SERIES \nLucian and Arabella\n Kiss of a Dragon (Fallen Immortals 1) Heart of a Dragon (Fallen Immortals 2) Fire of a Dragon (Fallen Immortals 3)  \nLeonidas and Rosalyn\n Chosen by a Dragon (Fallen Immortals 4) Seduced by a Dragon (Fallen Immortals 5) Touched by a Dragon (Fallen Immortals 6)  \nLeksander and Erelah\n Loved by a Dragon (Fallen Immortals 7) Marked by a Dragon (Fallen Immortals 8) Claimed by a Dragon (Fallen Immortals 9) Of Bards and Witches: Leonidas's Story (Fallen Immortals 10)",
  "genres": [
    "Dragons",
    "Paranormal Romance",
    "Romance",
    "Paranormal",
    "Fantasy",
    "Supernatural",
    "Shapeshifters"
  ],
  "author": "Alisa Woods",
  "average_rating": "4.33",
  "url": "https://www.goodreads.com/book/show/34668600-loved-by-a-dragon"
}