{
  "title": "Transgressor",
  "description": "The Entire Fortune's Fools First TrilogyTransgressor is a collection of all three volumes in the first trilogy of the Fortune's Fools saga, now gathered in one single book.  Temsevar is an insignificant Periphery world on the very fringes of galactic civilisation. Settled long before the rise of faster-than-light technologies and left isolated for hundreds of years, its population have degenerated into the barbarism of a medieval culture. This primitive world has nothing the wealthy planets of the Coalition could want, until it becomes unwitting host to one of their most dangerous enemies - Avilon Revid.  Transgressor - Part One: The Fated Sky From the moment he wakes up in the caravan of the merchant princess Alexa the Fair, Avilon has to fight simply to survive in a world where he is seen as alien and dangerous. It is a battle to obtain his freedom, that pushes his skills and resources to the limit, so he can find a way off-planet before his enemies in the Coalition track him down. But Temsevar has its own brutal conflicts being played out against the backdrop of its harsh and unforgiving climate. The society is dominated by a ruthless Warlord, intent on subduing the entire continent to his will and whose brilliant general - Jariq Zarengor - has earned a reputation for callous bloodshed. And then there is the enigmatic Durban Chola, trading information to whoever pays him for it, while playing his own, highly dangerous, game with fate.  Transgressor - Part Two: Times of Change Fate has left Jaelya Roussal as Regent of Harkera, at the most troubled time in its history. The Warlord Qabal Vyazin has set his sights on seizing the country and making it part of his powerful, barbaric empire, and he would crush the stirrings of a more progressive and compassionate way of life that the nation has embraced. Harkera is also home to a powerful secret which could affect the fate of all the Coalition worlds. Jaelya needs the help of every friend she can find to keep her daughter's kingdom safe. But first, she has to decide if she can trust those who offer to help her protect Harkera - or risk losing everything to betrayal.  Transgressor - Part Three: Dues of Blood The Sabre is the most famous of the gladiatorial fighters in the Arena of Alfor. He knows how to face any opponent on the sand and has defeated them all in the blood-games patronised by the wealthy elite of medieval Temsevar. But the Warlord Qabal Vyazin has decreed the arena is to become a means of political execution and even the Sabre will have to struggle to survive. As the action on Temsevar moves to the end-game, those caught up in events find themselves polarised and choosing sides, unsure of where the dagger of betrayal may hide. But offworld influences are reaching into the planet's affairs and Temsevar itself could fall under threat from the Coalition.",
  "genres": [],
  "author": "E.M. Swift-Hook",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/34668578-transgressor"
}