{
  "title": "Magic: A Fantastic Comedy, Three Act Play",
  "description": "Unique Elements\n  \n   Detailed 20th-Century Historical Map \n Explore the wonders and magic of this unforgettable classic and take an exhilarating step back in time!\nMagic\n by English author \nG. K. Chesterton\n is a comedic play first published in 1913 in the United Kingdom. \n  \nSynopsis\nMagic by G. K. Chesterton is a comedic play originally released in 1913. The play contains an enjoyable blend of comedy, drama, romance, suspense, and debate. A Duke invites several visitors to his estate for an evening of entertainment, including a magician. The Duke's nephew is a fairly haughty young American agnostic who is determined to reveal all of the magician's tricks. One trick, however, he can't figure out and actually appears to be “true” magic is nearly driving him insane. Meanwhile, the magician and the Duke's niece fall in love. \n  \nSneak \n ‘THE PRELUDE A plantation of thin young trees, in a misty and rainy twilight; some woodland blossom showing the patches on the earth between the stems.The Stranger is discovered, a cloaked figure with a pointed hood. His costume might belong to modern or any other time, and the conical hood is so drawn over the head that little can be seen of the face.A distant voice, a woman's, is heard, half-singing, half-chanting, unintelligible words. The cloaked figure raises its head and listens with interest. The song draws nearer and Patricia Carleon enters. She is dark and slight, and has a dreamy expression. Though she is artistically dressed, her hair is a little wild. She has a broken branch of some flowering tree in her hand. She does not notice the stranger, and though he has watched her with interest, makes no sign. Suddenly she perceives him and starts back.Patricia. Oh! Who are you?Stranger. Ah! Who am I? [Commences to mutter to himself, and maps out the ground with his staff.]I have a hat, but not to wear;I wear a sword, but not to slay,And ever in my bag I bearA pack of cards, but not to play.Patricia. What are you? What are you saying?Stranger. It is the language of the fairies, O daughter of Eve.Patricia. But I never thought fairies were like you. Why, you are taller than I am.Stranger. We are of such stature as we will. But the elves grow small, not large, when they would mix with mortals.Patricia. You mean they are beings greater than we are.’",
  "genres": [
    "Plays",
    "Fantasy",
    "Classics",
    "Fiction",
    "Drama",
    "Theatre",
    "Catholic"
  ],
  "author": "G.K. Chesterton",
  "average_rating": "3.81",
  "url": "https://www.goodreads.com/book/show/120834653-magic"
}