{
  "title": "Folded Notes from High School",
  "description": "A status-obsessed senior unexpectedly falls for a freshman because of his Danny Zuko audition in their high school's production of Grease in this outrageously funny epistolary novel set in 1991.\"Matt Boren brilliantly captures the voices of students way back in 1992 with humor and wit and a unique ability to shift from freshman to senior, boy to girl, cheerleader to theater geek. In this hilarious novel, Boren adeptly proves that the more things change, the more things stay the same.\"--Kelly RipaThe folded notes collected for this book represent correspondence surrounding one Tara Maureen Murphy, senior at South High c. 1991-1992. It's 1991, and Tara Maureen Murphy is finally on top. A frightening cross between Regina George and Tracy Flick, Tara Maureen Murphy is any high school's worst nightmare, bringing single-minded ambition, narcissism, manipulation, and jealousy to new extremes in this outrageous, satirical twist on the coming-of-age novel. She's got a hot jock boyfriend in Christopher Patrick Caparelli, her best friend Stef Campbell by her side, and she's a SENIOR, poised to star as Sandy in South High's production of Grease. Clinching the role is just one teensy step in Tara's plot to get out of her hometown and become the Broadway starlet she was born to be. She's grasping distance from the finish line--graduation and college are right around the corner--but she has to remain vigilant. \"This dumb town, as we know, can be a very tricky place.\" --Tara Maureen MurphyIt gets trickier with the arrival of freshman Matthew Bloom, whose dazzling audition for the role of Danny Zuko turns Tara's world upside down. Freshmen belong in the chorus, not the spotlight! But Tara's outrage is tinged with an unfamiliar emotion, at least to adoration. And what starts as a conniving ploy to \"mentor\" young Matt quickly turns into a romantic obsession that threatens to topple Tara's hard-won status at South High....",
  "genres": [
    "Young Adult",
    "Contemporary",
    "Romance",
    "Fiction",
    "High School",
    "Audiobook",
    "Teen"
  ],
  "author": "Matt Boren",
  "average_rating": "2.91",
  "url": "https://www.goodreads.com/book/show/34671577-folded-notes-from-high-school"
}