{
  "title": "The Dialogues: Conversations about the Nature of the Universe",
  "description": "A series of conversations about science in graphic form, on subjects that range from the science of cooking to the multiverse. Physicist Clifford Johnson thinks that we should have more conversations about science. Science should be on our daily conversation menu, along with topics like politics, books, sports, or the latest prestige cable drama. Conversations about science, he tells us, shouldn't be left to the experts. In The Dialogues , Johnson invites us to eavesdrop on a series of nine conversations, in graphic-novel form—written and drawn by Johnson—about “the nature of the universe.” The conversations take place all over the world, in museums, on trains, in restaurants, in what may or may not be Freud's favorite coffeehouse. The conversationalists are men, women, children, experts, and amateur science buffs. The topics of their conversations range from the science of cooking to the multiverse and string theory. The graphic form is especially suited for physics; one drawing can show what it would take many words to explain. In the first conversation, a couple meets at a costume party; they speculate about a scientist with superhero powers who doesn't use them to fight crime but to do more science, and they discuss what it means to have a “beautiful equation” in science. Their conversation spills into another chapter (“Hold on, you haven't told me about light yet”), and in a third chapter they exchange phone numbers. Another couple meets on a train and discusses immortality, time, black holes, and religion. A brother and sister experiment with a grain of rice. Two women sit in a sunny courtyard and discuss the multiverse, quantum gravity, and the anthropic principle. After reading these conversations, we are ready to start our own.",
  "genres": [
    "Science",
    "Nonfiction",
    "Graphic Novels",
    "Physics",
    "Comics",
    "Philosophy",
    "Nature"
  ],
  "author": "Clifford V. Johnson",
  "average_rating": "3.72",
  "url": "https://www.goodreads.com/book/show/34688468-the-dialogues"
}