{
  "title": "Aydan",
  "description": "Can be read as a stand alone book.  Riley  On war-torn Earth, I’m stuck raising my four sisters. It’s okay, I love them dearly. But there are days I long to be free. I always look straight ahead, never up at the stars. Earth holds so many wondrous sights. I want to see them all. But I can’t. Not only have aliens invaded, but my mother died of cancer, leaving me alone to raise my three-year-old twin sisters, along with ten-year-old Cassidy. Belle is sixteen and can take care of herself mostly. I never dreamed at the age of twenty-two I would become a mother of four.  One day while I was hunting for food, a shuttlecraft spiraled out of control. The smoke, the carnage…there’s no way anyone could have survived, but I searched anyway. Everyone lay dead, or so I thought. A gasp, a noise, and then I saw the rise and fall of his chest. I had to help. I can’t explain why, but I had to.  Aydan  The computer blares a warning, and I curse the fates. A down-and-back trip to see Earth shouldn’t be too much to ask. I know I’m second in command, and they need me on the Victory, but it’s just a quick trip. What could happen? I smirk as the computer blares its warning. Now I will never have a family, give my mother young. She will be all alone. Of all the ways I could die, I never thought it would be in a fauk’n shuttlecraft accident.  My eyes pop open, and I can’t remember anything. What happened? Who am I? What am I? Why do these two younglings call me Kiddy and try to look at my teeth? I know I’m different. I don’t belong here. When I see myself in the looking glass, it confirms my belief.  When the Tureis kidnap Riley, all my memories come rushing back. The memories, the pain, it’s staggering, and I’m unable to help her, protect her as I should. With her gone, I must take care of her sisters and get Riley back at all costs. Her sisters need her. I need her!  Follow Aydan and Riley on their amazing journey. If you enjoy adventure, humor, sadness, and a HEA, then this book is for you. Warning: intended for mature audiences 18+.",
  "genres": [
    "Science Fiction",
    "Romance",
    "Aliens",
    "Science Fiction Romance",
    "Action",
    "Paranormal Romance"
  ],
  "author": "Hannah Davenport",
  "average_rating": "4.17",
  "url": "https://www.goodreads.com/book/show/34691107-aydan"
}