{
  "title": "Anachronist: A Time Travel Adventure",
  "description": "Change the past – save the futureA modern, epic story of voyage and discovery as teenage anti-hero Joshua Jones falls into the world of the Oblivion Order and journeys through time. On his incredible travels he learns amazing things about the past, himself and his feelings for the stunning Caitlin. The past is a complex web of branching events that need regular interventions to safeguard the best future for humanity. This is the mission of the Oblivion Order; a secret organisation freed from the limits of linear time. Their task is to maintain the Continuum of time by making small adjustments to the past.The Order is made up of specialist time guilds. Copernicans - analysts of potential futures, who are obsessed with probability; Scriptorians - librarians and archivists of lost knowledge; Antiquarians -  quartermasters and curators of missing treasures, and Draconian’s who navigate and map the lost parts of history.But then there are the Watchmen. These lone field officers patrol the paths of the past, using the timelines of objects to navigate their way through history. Powerful agents of change, they are responsible for applying the course corrections. And they live hidden among us today.When teenage thief and gang member Joshua Jones, breaks into the house of a local eccentric, the Colonel, he finds himself thrown into the strange world of the Oblivion Order.Josh discovers that he too can travel through time and when he meets the beautiful, sassy orphan Caitlin, he realises he has a chance of a better future for himself and his sick mother. But to do means changing his past and that is strictly forbidden by the Order.The Anachronist tells the gripping story of Josh’s journey from petty criminal to a search for a better life. His adventures take us from the present, Victorian London and World War 2 to the French Revolution, Ancient Greece and the last Ice Age as he learns more and more about the Oblivion Order and his feelings for Caitlin.From extinction curators, seers and memory vampires to chapter houses with rooms in different centuries, the Anachronist opens a door into a world not constrained by the rules of time and takes us on a rollercoaster epic voyage of discovery.Time does not travel in straight lines, and nor does Josh’s search for a better life and love.",
  "genres": [
    "Time Travel",
    "Fantasy",
    "Science Fiction",
    "Fiction",
    "Audiobook",
    "Adventure",
    "Urban Fantasy"
  ],
  "author": "Andrew Hastie",
  "average_rating": "4.25",
  "url": "https://www.goodreads.com/book/show/34685483-anachronist"
}