{
  "title": "Mister Miracle",
  "description": "Jack Kirby reinvented the superhero genre with his sprawling saga of the Fourth World --a bold storytelling vision that was decades ahead of its time. In honor of this extraordinary talent's centennial, DC Comics is proud to re-present the groundbreaking work of the King of Comics in a brand-new series of trade paperback editions collecting his classic DC titles in all their four-color glory: MISTER MIRACLE BY JACK KIRBY (New Edition)!With MISTER MIRACLE, Kirby unleashes the breakout star of the Fourth World. Scott Free, a child of New Genesis, was destined to one day reign alongside the Highfather in the golden city of the New Gods. But heavenly New Genesis was at war with hellish Apokolips, and the two immortal worlds were trapped in a neverending cycle of violence. To break the stalemate, the Highfather struck a deal with Darkseid, the ruler of Apokolips. The two adversaries sealed their pact with a sacrifice: each would exchange his infant son to be raised on his enemy's world.Now Scott Free has grown up, and not even the blackest dungeons of Darkseid or the parademon hordes of Apokolips can hold him. Breaking out of his captors' clutches and heading for the world called Earth, he reinvents himself as the unstoppable escape artist, Mister Miracle! But his flight from Apokolips threatens the fragile peace with New Genesis, and Darkseid's sinister agents will not rest until their former prisoner is back in chains. Will Mister Miracle be able to avoid their ever-deadlier death traps? No matter the cost, he will remain Scott Free! Discover one of comics' most beloved characters--and thrill to the art and imagination of one of comics' greatest masters at the height of his inventive powers--in JACK KIRBY'S MISTER MIRACLE, collecting issues #1-18 of the legendary series.",
  "genres": [
    "Comics",
    "Dc Comics",
    "Graphic Novels",
    "Science Fiction",
    "Fantasy",
    "Superheroes",
    "Comic Book"
  ],
  "author": "Jack Kirby",
  "average_rating": "4.01",
  "url": "https://www.goodreads.com/book/show/34690784-mister-miracle"
}