{
  "title": "The Complete Guide to Self-Publishing: Everything You Need to Know to Write, Publish, Promote and Sell Your Own Book",
  "description": "Take Control of Your Destiny Bottom line: You want to get published. You want to control the future of your manuscript and your writing career.Best-selling author Marilyn Ross and publishing expert Sue Collier show you how to make your own success - whether you're a published author, entrepreneur, corporation, professional, or absolute newcomer to writing. In this expanded and completely revised 5th edition of the \"\"bible\"\" of self-publishing (over 100,000 copies sold), they empower you to publish your own work with minimal risk and maximum profits. You'll find:  Complete step-by-step guidance on publishing and marketing a bookWays to leverage social media marketing to build your platform and make yourself stand out from the crowd A thorough explanation of the difference between POD self-publishing, subsidy publishing, and true self-publishing - and how to decide which is the best option for youPractical advice on making the decision between offset printing and print-on-demandHow to leverage the Internet to create \"\"buzz\"\" and promote your book with killer PRThe latest information on e-publishing A detailed marketing plan and timetable to keep you on trackProven marketing strategies to get free publicity, reach nontraditional buyers, and sell booksInformation-packed appendices with marketing contacts, organizations, and vendors, complete with names, addresses, and websitesValuable case studies and examples of how other publishers excelAn in-depth discussion of exclusive distributors, plus coverage of the most recent changes in bookstores and the book-selling industryThirty-one creative ideas for generating capital to launch your publishing company \"The Complete Guide to Self-Publishing\" is the one book you need to take control of your writing career. Read it. Believe it. Do it. Your future depends on it.",
  "genres": [
    "Writing",
    "Nonfiction",
    "Reference",
    "Business",
    "Self Help"
  ],
  "author": "Tom Ross",
  "average_rating": "3.91",
  "url": "https://www.goodreads.com/book/show/3468259-the-complete-guide-to-self-publishing"
}