{
  "title": "The Devil's Bed",
  "description": "An alternate cover edition can be found here.Selected by Literary Mayhem as one of their Favorite Reads of the year.What awaits Brandy in... The Devil's Bed?Brandy Petracus, touring a ruined castle in the south of France, is led to the unhallowed graveyard of Templar knights executed for practicing Black Magic. Long forgotten by the world, this ancient cemetery is known to the locals as – the Devil's Bed and its occupants do not rest in peace.In this fast-paced clash of Good vs Evil, Brandy soon finds herself the ad hoc leader of an eclectic group besieged by resurrected Templar knights - craving their blood. Vampirism, madness, dark humor, and flashbacks to 14th century Paris tell Brandy's very human story of commitment, trust and sacrifice.These aren't your daddy's zombies! They are an all new form of undead creature; former monks and Crusaders to whom symbolism is everything. They wear crosses but cannot abide a crucifix. They can enter a chapel but not its sanctuary. They chant Latin curses while chasing their victims, pray to evil while killing them, and drink their blood in a corruption of the sacraments.Before the appearance of these resurrected horrors, Brandy is feeling trapped by life. Her best friend, Vicki, is horribly murdered (with three others) near the Templars' graveyard. Angry and overwhelmed by guilt, she finds little comfort in her emotionally detached fiance (Vicki's brother). She fights to come to grips with her loss, her failing relationship, and the local authorities suspicions she is involved in the murders. Then Brandy's nightmare really begins. The Templars, keeping a seven centuries old covenant, rise from their graves to avenge their executions. Brandy and company are forced to hole up in an ancient chapel and fight for survival.Even then, the Devil's Bed has yet to surrender all of its secrets.",
  "genres": [
    "Horror"
  ],
  "author": "Doug Lamoreux",
  "average_rating": "3.68",
  "url": "https://www.goodreads.com/book/show/12084561-the-devil-s-bed"
}