{
  "title": "From the Monastery to the World: The Letters of Thomas Merton and Ernesto Cardenal",
  "description": "Thomas Merton and Ernesto Cardenal were both poets and priests, wholly committed to a life of spiritual contemplation which was never far from the gritty work that lead them to risk life and reputation in order to raise worldwide consciousness concerning issues of social justice and the abuse of human rights. From the Monastery to the World collects the complete correspondence between these spiritual men and dedicated activists, translated into English for the first time.The letters in this book, written between Merton and Cardenal from 1959–1968, give us fascinating insights into the early spiritual and political awakenings of eventual Sandinista and exponent of liberation theology Ernesto Cardenal, who was then a novice leaving the Trappist Monastery in Kentucky where he first met Merton. While making the long trip home to Nicaragua to build a utopian artist's commune on the Island of Solentiname, Cardenal rubs elbows with some of Latin America's greatest writers and artists of that time.In From the Monastery to the World, Cardenal is still a hungry pupil, years away from becoming the internationally renowned poet–statesman and Nicaraguan Minister of Culture. Here we see the poet and monk Thomas Merton as a wise, patient, and sometimes even humbled mentor, during the years when he was still shaping and collecting the raw materials for such writings \"The Way of Chuang Tzu\", \"Raids on the Unspeakable\", and \"Conjectures of a Guilty Bystander\".Merton and Cardenal's correspondence grants readers an audience to conversations between two men deeply connected by their vigorous endeavors toward spiritual freedom, voracious intellectual appetites, and artistic exploration despite the cultural differences, language barriers, and geographic distances which divide them.",
  "genres": [
    "Theology",
    "Spirituality"
  ],
  "author": "Thomas Merton",
  "average_rating": "4.15",
  "url": "https://www.goodreads.com/book/show/34701696-from-the-monastery-to-the-world"
}