{
  "title": "Amah and the Silk-Winged Pigeons",
  "description": "Prior to 1857, the year it was engulfed by tragic historical conflict, the cosmopolitan city of Lucknow thrived on open-mindedness, great prosperity and pride, the city a magnet for musicians, poets, painters and chefs, drawing the finest cultural talent from other parts of India and the wider world. It proved too tempting a prize for the English East India Company not to attempt a takeover of the Kingdom of Awadh with its capital city, Lucknow. The devastation and disaster that came to be known as \"the Red Year\" was a turning point in the history of Indian colonialism. It gave birth to the self-conscious, anti-colonial nationalism that would define the next ninety years, eventually leading to Gandhi’s nonviolent measures to oust the British from India once and for all.Synthesizing a wealth of meticulous historical research, Amah and the Silk-Winged Pigeons plunges the reader into the complex drama and historical dilemmas faced by both ordinary and extraordinary Lakhnavis (people of Lucknow) at the time. The story is centered on a group of strong, independent women who take action to defend their world and way of life. The novel's protagonist, Amah, is a member of the Rose Platoon, an elite corps of female military guards of African descent who have protected Lucknow’s royalty for generations. Appalled by the mounting affronts and threats to her absent ex-husband's kingdom, Begam Hazrat Mahal, one of Lucknow’s former queens and also of African descent, enlists Amah to be her eyes and ears and help coordinate resistance to the British takeover.When the women decide to take on the English colonists who declare rule, what will be the ultimate price of the women’s loyalty to the royal family and to the place they’ve grown to love?",
  "genres": [
    "Historical Fiction",
    "Fiction"
  ],
  "author": "Jocelyn Cullity",
  "average_rating": "3.84",
  "url": "https://www.goodreads.com/book/show/34714175-amah-and-the-silk-winged-pigeons"
}