{
  "title": "Engaged in Trouble",
  "description": "When a washed-up pop star inherits a wedding planning business, it’s all bouquets and bliss until a bride turns up dead.   Paisley Sutton shot to stardom as a teenage rock sensation, but ten years later that star has fizzled out, just like her bank account. When she unexpectedly inherits her aunt’s wedding planning business, Paisley leaves the glamour of Los Angeles for a charming small town in Arkansas. Thinking she’ll arrive in Sugar Creek and liquidate the moldly property, Paisley’s shocked to find Enchanted Events has experienced a major makeover and is now the place for brides. She’s got two months to keep Enchanted Events afloat if she wants to sell and rekindle her music career with the profits.   Paisley’s tossed into a world of vows and venues, but her most difficult challenge comes in the form of one demanding bride. When this Bridezilla’s found facedown in her cake, all fingers point to Paisley as the prime murder suspect. And she does not look good in prison orange.   This former pop princess will need the help of her gun-toting, ex-CIA grandmother and her handsome neighbor, Beau Hudson, to unravel the mystery and clear her good name. As she and her unruly posse dig into Bridezilla’s life, she discovers the woman had a long list of enemies. The closer Paisley gets to the truth, the more her own life is in danger.  Love is in the air this wedding season, but before Paisley can help the ladies of Sugar Creek say, “I do,” she’s got to unveil a killer. Or find herself the next target.  Engaged in Trouble is the first book in the long-awaited Enchanted Events cozy mystery series by award-winning author Jenny B. Jones. If you like laugh-out-loud adventures, small-town romance, unforgettable, sassy characters, and a mystery to keep you guessing, then you’ll love this new page-turning series.",
  "genres": [
    "Mystery",
    "Cozy Mystery",
    "Romance",
    "Contemporary",
    "Fiction",
    "Christian Fiction",
    "Chick Lit"
  ],
  "author": "Jenny B. Jones",
  "average_rating": "4.18",
  "url": "https://www.goodreads.com/book/show/34725692-engaged-in-trouble"
}