{
  "title": "Il ritorno. Padri, figli e la terra fra di loro",
  "description": "Nel marzo del 2012 Hisham Matar s'imbarca su un volo per la Libia. È il suo primo ritorno dopo trentatre anni nella terra color ruggine, giallo e verde intenso della sua infanzia, la terra che lo ha separato dal padre la notte del 1990 in cui Jaballa Matar venne sequestrato dal regime di Gheddafi, condotto nella terribile prigione di Abu Salim e poi fatto sparire. Il figlio Hisham ci accompagna in un viaggio lucido e struggente attraverso i luoghi di una memoria privata che è anche fardello collettivo di una nazione, alla ricerca di un padre perennemente vivo e morto al quale restituire almeno la certezza di un destino. Hisham Matar ha diciannove anni quando suo padre Jaballa, fiero oppositore del regime di Muammar Gheddafi, viene sequestrato nel suo appartamento del Cairo, rinchiuso nella famigerata prigione libica di Abu Salim e fatto sparire per sempre. Ventidue anni più tardi il figlio Hisham, che non ha mai smesso di cercarlo, può approfittare dello sprazzo di speranza aperto dalla rivoluzione del febbraio 2011 per fare finalmente ritorno nella terra della sua infanzia felice. Quel viaggio verso un presente ormai sconosciuto non è che lo spunto per un itinerario storico e affettivo ben più vasto. Visitando i luoghi e incontrando i parenti e gli amici che hanno condiviso con Jaballa decenni di prigionia nel «nobile palazzo» di Abu Salim, Hisham può recuperare un passato che risuona in lui con un'eco mai sopita e ritagliare i contorni di un padre che, in assenza di un corpo, risulta privo di confini. Le tappe del viaggio privato s'intersecano con la storia libica del ventesimo secolo, dalla resistenza all'occupazione italiana al flirt di Gheddafi con l'Inghilterra di Tony Blair. Ma anche all'antro più buio, all'orrore più raccapricciante, segue, in queste pagine, la luce di un dipinto di Manet, la melodia di un alam: la consolazione dell'arte e della bellezza come autentica espressione dell'uomo. E anche quando della speranza di ritrovare un padre vivo «non rimangono che granelli sparsi», lo sguardo di Matar continua a puntare risolutamente in avanti: «Mio padre è morto ed è anche vivo. Non possiedo una grammatica per lui. È nel passato, nel presente e nel futuro. Ho il sospetto che anche coloro che hanno sepolto il proprio padre provino la stessa cosa. Io non sono diverso. Vivo, come tutti viviamo, nell'indomani».",
  "genres": [
    "Nonfiction",
    "Memoir",
    "Biography",
    "History",
    "Libya",
    "Book Club",
    "Biography Memoir"
  ],
  "author": "Hisham Matar",
  "average_rating": "4.15",
  "url": "https://www.goodreads.com/book/show/34704852-il-ritorno-padri-figli-e-la-terra-fra-di-loro"
}