{
  "title": "I, Who Did Not Die",
  "description": "Khorramshahr, Iran, May 1982—It was the bloodiest battle of one of the most brutal wars of the twentieth century, and Najah, a twenty-nine-year-old wounded Iraqi conscript, was face to face with a thirteen-year-old Iranian child soldier who was ordered to kill him. Instead, the boy committed an astonishing act of mercy. It was an act that decades later would save his own life.This is a remarkable story. It is gut-wrenching, essential, and astonishing. It’s a war story. A love story. A page-turner of vast moral dimensions. An eloquent and haunting act of witness to horrors beyond grimmest fiction, and a thing of towering beauty. More importantly, it is a story that must be told, and a richly textured view into an overlooked conflict and misunderstood region. This is the great untold story of the children and young men whose lives were sacrificed at the whim of vicious dictators and pointless, barbaric wars. Little has been written of the Iran-Iraq war, which was among the most brutal conflicts of the twentieth century, one fought with chemical weapons, ballistic missiles, and cadres of child soldiers. The numbers involved are —All told, it claimed 700,000 lives—200,000 Iraqis, and 500,000 Iranians. —Young men of military service age—eighteen and above in Iraq, fifteen and above in Iran—died in the greatest numbers. —80,000 Iranian child soldiers were killed, mostly between the ages of sixteen and seventeen. —The two countries spent a combined 1.1 trillion dollars fighting the war. Rarely does this kind of reportage succeed so power- fully as literature. More rarely still does such searingly brilliant literature—fit to stand beside Remarque, Hemingway, and O’Brien—emerge from behind “enemy” lines. But Zahed, a child, and Najah, a young restaurateur, are rare men—not just survivors, but masterful, wondrously gifted storytellers. Written with award-winning journalist Meredith May, this is literature of a very high order, set down with passion, urgency, and consummate skill. This story is an affirmation that, in the end, it is our humanity that transcends politics and borders and saves us all.",
  "genres": [
    "Nonfiction",
    "Memoir",
    "History",
    "Iran",
    "Biography",
    "Book Club",
    "Biography Memoir"
  ],
  "author": "Zahed Haftlang",
  "average_rating": "4.55",
  "url": "https://www.goodreads.com/book/show/34706511-i-who-did-not-die"
}