{
  "title": "Three Ways to Start a Scandal",
  "description": "A young woman kidnapped by the villain who may be her long-lost love.\n\nThe actress who falls for the assassin hired to kill her. \n\nThe English governess who tames the wild Highlander widower. \n\n\n\nThe Victorian Rebels are most dangerous blackguards of society. They answer to no one and relish in their rebellion. But for the women who lay claim to their souls, their stoic fierceness is what makes these heroes so dark, and what makes their heroines want them like no other, in these three stunning historical romance novels from Kerrigan Byrne.\nThe HighwaymanDorian Blackwell, the Blackheart of Ben More, is a ruthless villain. Scarred and hard-hearted, Dorian is one of Victorian London's wealthiest, most influential men who will stop at nothing to wreak vengeance on those who've wronged him... and will fight to the death to seize what he wants. The lovely, still innocent widow Farah Leigh Mackenzie is no exception-and soon Dorian whisks the beautiful lass away to his sanctuary in the wild Highlands. But Farah is no one's puppet. She possesses a powerful secret-one that threatens her very life…The HunterChristopher Argent lives in the shadows as the empire's most elite assassin. Emotion is something he tossed away years ago, making him one of the most clear-eyed, cold-hearted, wealthiest, and therefore untouchable men in London. But when his latest target turns out to be London's own darling, Millicent LeCour, Christopher's whole world is turned upside down. Overwhelmed by her stunning combination of seduction and innocence, Christopher cannot complete the mission. She has made him feel again. Now, he will do anything to save her life, so that he can claim her as his own...The HighlanderThey call him the Demon Highlander. The fearsome Lieutenant Colonel Liam MacKenzie is known for his superhuman strength, towering presence, and fiery passion in the heat of battle. As Laird to the MacKenzie clan, the undefeated Marquess has vanquished his foes with all rage and wrath of his barbaric Highland ancestors. But when an English governess arrives to care for his children, the master of war finds himself up against his greatest opponent... in the game of love.",
  "genres": [
    "Anthologies",
    "Historical Romance"
  ],
  "author": "Kerrigan Byrne",
  "average_rating": "4.46",
  "url": "https://www.goodreads.com/book/show/34724608-three-ways-to-start-a-scandal"
}