{
  "title": "Journey: A Western",
  "description": "Set in the early eighteen hundreds in the wild desert wilderness of New Mexico Territory, Journey follows the lives of three distinctly different characters whose destinies are one: Journey, a fiercely independent, sixteen-year-old of mysterious origins; Reuben Moon, the stoic half Mexican, half Apache hunter who raises her; and Esau Burdock, a brutal, pragmatic, and wealthy slave trader.The story opens on a November night in 1833, the sky on fire with meteors, each character alone, experiencing the storm. The narrative then delves into their individual histories. But Journey, Reuben, and Esau’s stories soon collide in the summer of 1834 when Esau holds a rendezvous of horse racing and trading. Despite being only sixteen, and a girl at that, Journey joins the race. She doesn’t win, but she’s caught the attention of Esau. A year later, a mountain lion is terrorizing the area and Esau comes across Journey and Reuben in the desert as he hunts for it. Journey has tamed a wild colt. The lion had killed its mother then attacked the colt, but Journey rescues it and nurses it back to health. Esau claims the colt is his by the law of the land. Journey refuses to give him up and so Esau threatens to hang her on the spot. Instead, they make a deal: Journey can work at Esau’s stables for six months to earn the horse.And so she does. All the while the mountain lion continues to kill and Esau broods. He is a successful man, but he is a lonely one too, haunted by the death of his first slave and lover, Livy, and by their daughter Lilly Rose, both of whom betrayed him and are now dead. The story comes to a fever pitch when Esau spots a necklace Journey has worn her whole life, given to her by her mother, a necklace once worn by Esau’s dead daughter, Lily Rose. From there, the story races to an end, as Esau, Journey, and Reuben are tested in ways they never dreamed imaginable. Brimming with action and panoramic in scope, in Journey Foreman provides a breathtaking narrative with a heroine you’ll never forget.",
  "genres": [],
  "author": "Stephen H. Foreman",
  "average_rating": "4.28",
  "url": "https://www.goodreads.com/book/show/34725667-journey"
}