{
  "title": "The Abstinence Teacher",
  "description": "“Some people enjoy it.”That was all Ruth had said. Even now, when she’d had months to come to terms with the fallout from this remark, she still marveled at the power of those four words, which she’d uttered without premeditation and without any sense of treading on forbidden ground. (p. 11)Thanks to an off-hand remark made during a class discussion of oral sex, sex-ed teacher Ruth Ramsey finds herself a target of the Christian evangelicals who are increasingly influencing the schoolboard of suburban Stonewood Heights. Forced to attend remedial sessions with a smug “Virginity Consultant,” Ruth is isolated and alone, caught in the polarized red-versus-blue landscape of present-day American suburbia. It’s like “living in a horror movie,” she thinks, “ The Invasion of the Body Snatchers , or something. You never knew who they were going to get to next.” Divorced and sharing custody of her daughters with her ex, and sometimes attempting a futile date, Ruth spends many a lonely weekend wondering how her bleak existence came to be.Then one morning at her daughter’s soccer game, Ruth meets Tim Mason, a cute forty-something volunteer coach. Ruth feels an instant attraction to Tim, but when he draws the girls together for a spontaneous prayer circle after the game, she angrily yanks her daughter away from the proceedings, placing herself once again in the sights of the evangelicals.But Ruth has another unexpected she can’t seem to get a handle on Tim, her supposed adversary, who keeps appearing at her front door. A recovering addict whose bottoming-out cost him his home and his marriage, Tim found his way to the Tabernacle of the Gospel Truth through the intervention of Pastor Dennis, the charismatic preacher who put Tim’s shattered life back together in an approximation of happiness. Thanks to Pastor Dennis, Tim is now married to Carrie, a fellow Tabernacler who is attractive and attentive, if robotic. He plays guitar at the weekly prayer sessions in a sanitized reenactment of his days in a Grateful Dead cover band. He holds a respectable if unfulfilling job as a loan officer, well aware of the irony of the post for a man with his history. He is grateful for the help he has received from his church community and Pastor Dennis. But he can’t shake the yearning for something more, and a nagging attraction to that troublesome sex-ed teacher....With The Abstinence Teacher , Tom Perrotta wades into the murky waters of contemporary American suburbia, fully deploying his proven gift for describing the panic lurking beneath its seemingly placid surface. Already widely known to book and movie audiences for his scathing satire mixed with remarkable compassion in works including Election and Little Children (both adapted for film, Little Children garnering Perrotta an Oscar nomination), this novel once again proves, as declared by the Los Angeles Times , “Perrotta’s balance of humor and pathos has no equal.”",
  "genres": [
    "Fiction",
    "Book Club",
    "Contemporary",
    "Religion",
    "Adult Fiction",
    "Novels",
    "Adult"
  ],
  "author": "Tom Perrotta",
  "average_rating": "3.26",
  "url": "https://www.goodreads.com/book/show/347143.The_Abstinence_Teacher"
}