{
  "title": "The Intelligence of the Psyche: How to discover its hidden order",
  "description": "\"This book shows you the workings of your unconscious mind!\"Quotation from the author's description of the book:\"This book has first been published in the year 2000 in Germany. Over time it has steadily gained its reputation as a new standard in parts-psychology.Back then I was a diligent and enthusiastic student of Hal and Sidra Stone, the American psychologists who founded the Voice Dialogue method. Their yearly summer camps and other teaching seminars were a source of great inspiration to me and answered so many questions that had kept me searching for years.The deepest questions I had: why is Man acting destructively in so many areas of life while claiming and striving to be good at the same time? Why is human behavior so contradictory? And why is there no commonly accepted unifying theory about the inner structures of the psyche?When I first heard about the idea of many independent sources of will inside a single individual´s mind, a firework of insights and investigation was kicked off in me. I contacted Hal and Sidra Stone, I translated their books into German, found publishers for them and I invited Hal and Sidra Stone for seminars and lectures to make their work known in Germany. It was a happy time full of discoveries and revelations.As it often happens with students who completely dedicate their energy to their teacher´s work: at some point they start to question even that teaching; they start to find new ways and bring new ideas to it; the result of the process being this book. And now, some 17 years after its original publication, the process is still rolling on. A second book has been published that introduces the results of 16 more years of basic studies and insights into the architecture of the inner world. These in turn prompted me to make some major changes in “The Intelligence of the Psyche”, too.As you are about to dive into the world of parts—or inner persons as we call them now—keep in mind that this is only the beginning of a journey that will be taking Man deeper and deeper into the understanding of his own subjective reality. It is this inner reality that ultimately shapes our outer life and we need to comprehend and master it, if we want to turn our fate not only to the better, but to the essentially good.\"",
  "genres": [
    "Nonfiction",
    "Psychology"
  ],
  "author": "Artho Stefan Wittemann",
  "average_rating": "3.80",
  "url": "https://www.goodreads.com/book/show/34725231-the-intelligence-of-the-psyche"
}