{
  "title": "Awakened Dragons Complete Series",
  "description": "Get all six of the bestselling Awakened Dragons book in this complete series set. Six sexy, larger than life fire breathers with unique, gemstone related powers who just woke up and are ready to defend humanity and learn the ways of the modern world while finding their fated mates.\n\nWarning: contains ferocious dragons, fearsome fights, fiery love scenes and fiercely cute kittens that can melt even a scale-covered heart.\n\nOnyx Dragon\nIsaac Morningstar III, or Zach to the few who know him, has hit rock bottom. Once an immortal, nearly-invincible dragon, he's been awakened only to have his powers and his treasure locked away until he can prove himself to be a trustworthy protector of humans. Since Zach has never liked humans, he's pretty sure he's going to end up back on ice. That is, until he meets sweet, curvy Erin, a human hairdresser who might just turn his world upside down.\nSapphire Dragon\nLuc, the sapphire dragon, didn't want to be brought back into the world he left behind centuries ago. Especially with a collar that ensures he can't access his incredible powers until he's willing to fight for humanity. He tried that once and he's not willing to let himself care again. Until he meets Hallie, a kind shelter worker whose bright smile and sexy curves melt the ice inside him and make him want to protect humans once more.\nRuby Dragon\nRed used to have it all. Sexy, powerful and attractive to all women, as the ruby dragon he had the world at his feet. But now he's awakened and collared, unable to use his powers and alone in the modern world. His only company is his insane adopted cat and Faye, the curvy, sweet neighbor who makes his dragon sit up and say 'mate'. Too bad the only woman he finds irresistible has no trouble resisting him.\nDiamond Dragon\nAlistair Brighton, the diamond dragon, needs to escape. Imprisoned, chained and used for experiments, his only hope for escape is Bridget, the quiet human woman who brings him his meals (and intrigues him for mysterious reasons). But Bridget isn't sure she wants to let a dangerous dragon out of his cage, and Alistair can't promise he was ever much of a hero.\nAmethyst Dragon\nWith his dark, ominous powers, Dominic, the Amethyst dragon, has learned to keep his world secret. Bad things happen when he tries to let people in. Now that he's awakened, he's determined to help save the world and disappear back into the shadows. Until he rescues Lana, a feisty, damaged human who draws Dom in and tempts him to risk getting close to someone for the first time in so long. Too bad his dream woman has a no-shifter rule.\nEmerald Dragon\nAfter centuries of searching, the impossible has finally happened: Aegis, the Emerald Dragon, has found his long-lost mate. The only problem? She's a captive of the dark forces he's allied himself with in order to meet his own selfish ends. But Aegis knows how to be a hero, it just takes the right motivation. Like saving the only person that has ever mattered to him.",
  "genres": [],
  "author": "Terry Bolryder",
  "average_rating": "4.47",
  "url": "https://www.goodreads.com/book/show/34725566-awakened-dragons-complete-series"
}