{
  "title": "How We Do Harm: A Doctor Breaks Ranks About Being Sick in America",
  "description": "How We Do Harm exposes the underbelly of healthcare today―the overtreatment of the rich, the under treatment of the poor, the financial conflicts of interest that determine the care that physicians' provide, insurance companies that don't demand the best (or even the least expensive) care, and pharmaceutical companies concerned with selling drugs, regardless of whether they improve health or do harm. Dr. Otis Brawley is the chief medical and scientific officer of The American Cancer Society, an oncologist with a dazzling clinical, research, and policy career. How We Do Harm pulls back the curtain on how medicine is really practiced in America. Brawley tells of doctors who select treatment based on payment they will receive, rather than on demonstrated scientific results; hospitals and pharmaceutical companies that seek out patients to treat even if they are not actually ill (but as long as their insurance will pay); a public primed to swallow the latest pill, no matter the cost; and rising healthcare costs for unnecessary―and often unproven―treatments that we all pay for. Brawley calls for rational healthcare, healthcare drawn from results-based, scientifically justifiable treatments, and not just the peddling of hot new drugs. Brawley's personal history – from a childhood in the gang-ridden streets of black Detroit, to the green hallways of Grady Memorial Hospital, the largest public hospital in the U.S., to the boardrooms of The American Cancer Society―results in a passionate view of medicine and the politics of illness in America - and a deep understanding of healthcare today. How We Do Harm is his well-reasoned manifesto for change.",
  "genres": [
    "Nonfiction",
    "Medicine",
    "Medical",
    "Health",
    "Science",
    "Health Care",
    "Politics"
  ],
  "author": "Otis Webb Brawley",
  "average_rating": "4.18",
  "url": "https://www.goodreads.com/book/show/12085010-how-we-do-harm"
}