{
  "title": "Stealth Retribution",
  "description": "Retribution.Also known as “payback” or a more dated word: “vengeance.” Arnaldo Soto has taken Emilio and intends to use him as bait to trap Gemma. It’s an effective strategy, because Gemma will do anything—anything—to save the young boy.  The woman known as Gemma Keyes is gone, her molecular structure destroyed and reassembled as . . . something else. In Gemma’s stead emerges a fierce weapon: part woman, part nanotechnology, her cellular composition conjoined with the nanocloud, indissoluble and formidable. She and the nanomites are now more than a match for her enemies—but Gemma has promised God that she will not strive to visit retribution on Arnaldo Soto for taking Emilio. The nanomites have made no such promise.  The conclusion to the Nanostealth series will blow your mind.  Excerpt. First the “merge.” Now this, the latest iteration of Gemma Keyes—or should I say, the “new and improved nanocloud”? The revived and restored nanocloud . . . superior in every way, comprising six tribes and, at last count, more than twenty trillion nanomites; the nanocloud that had annexed and incorporated the person I'd been—all of who and what I was. The nanomites and I were melded. We were irrevocably bound to each other now. We were an amalgamation.  I lifted my hands to examine them. As I did, the light fixtures banding the cavern flickered; current jetted from the wavering lights and slammed into my chest. The drawn energy coursed through me and reverberated in my bones. It swelled and spread down my arms until it reached my fingertips, ready to burst forth.  With a curious and almost detached air, I watched as my body attracted more energy from the light fixtures. Electricity crackled around me, infusing me with might. I flexed and curved my fingers; tongues of current sizzled in the palm of my hand and built into a ball of pulsing blue fire.  I drew another deep breath and felt my body respond, my strength rise. The electricity I attracted from the cavern’s lights (without conscious intent) pulsed and crackled; it bent toward me and flowed into me. I raised one hand toward the electrical source and current jetted into my palm—arcing and building within the span of my fingertips. I rotated my wrist, and the ball of energy sizzled. Intensified.  I brought my hands together and stared with fascination as the shimmering bolus of energy enlarged. It swirled between my extended fingers. As I moved my splayed hands apart, tendrils of electricity climbed from my fingers onto the ball; they wrapped themselves about the sphere to hold and feed it. The orb grew larger; its vibrations thudded through my chest.  I stared at the sparking sphere of electricity sitting in my hand. What could I do with it? What would happen if I . . . tossed it?  I thought that I knew the answer.  \nNanostealth\n Book 1: Stealthy Steps Book 2: Stealth Power Book 3: Stealth Retribution",
  "genres": [
    "Christian Fiction",
    "Science Fiction",
    "Christian",
    "Audiobook",
    "Thriller"
  ],
  "author": "Vikki Kestell",
  "average_rating": "4.72",
  "url": "https://www.goodreads.com/book/show/34735416-stealth-retribution"
}