{
  "title": "I'd Rather Sink—!",
  "description": "available at https://squareup.com/store/red-paint-... These poems are gorgeous orchestrations of the experimental and the lyrical. The linguistic arrangements—visually striking, deftly scored—register the absurdity of the carnal and the surreal pathos of the familial. A dazzling array of references and influences—Selena, manga, telenovelas, Egyptian gods—electrify the language, making it both hyper-modern and intimate. John Manuel Arias is an inventive and uncompromising conductor. His debut is playful, extraordinary.  —Eduardo C. Corral, author of Slow LightningIt doesn’t matter where in the world you find yourself when reading this collection, drink it in! Arias will leave you thirsting for more as he guides you through upheaval and challenges he confronts. The intimate narratives are reminiscent of writing by Henry Miller or Anaïs Nin. These poems are visceral and imaginative; we’re in bed, on subway trains, and in examination rooms. You can’t simply read through a poem but you must ride it out; allow yourself to be guided by the speaker’s failures and love for the world and those he encounters.These poems don’t simply display the lives of wrecked human beings; these lives strut and sing. This collection is a chorus of poetry able to capture a lifetime of beauty and failure. A poem cannot always capture the song of a single moment, perhaps only a glimpse of the human experience is captured. Here, a reader experiences the pain of a poet’s life and the pleasure taken in language. ¡I’d Rather Sink! by John Manuel Arias is soaring debut of vivid imagination and desire. These poems will “fuck you up the ass till it/ bleeds” and you’ll take pleasure in the act.—Ruben Quesada, author of Next Extinct MammalJohn Manuel Arias is a gay, Costa Rican and Uruguayan poet back in Washington, DC after many years. His work has appeared in several literary magazines, including Sixth Finch, the Journal, and Assaracus: A Journal of Gay Poetry. I’d Rather Sink is his debut collection.COVER ART by ALICE PALAMENGHI“SPA,” 20161920 X 1200 pixelshttp://alicepalamenghi.tumblr.comhttp://www.instagram.com/alicepesce/",
  "genres": [],
  "author": "John Manuel Arias",
  "average_rating": "4.14",
  "url": "https://www.goodreads.com/book/show/34736534-i-d-rather-sink"
}