{
  "title": "Refuge: Transforming a Broken Refugee System",
  "description": "'Betts and Collier offer innovative insights into how to more effectively meet this challenge, with an important new focus on international solidarity and refugee empowerment' Kofi Annan'Refugees and policy makers need practical answers to what is now a global crisis. This valuable book represents the kind of can-do thinking that we need to see' David MilibandAn eye-opening account of the migrant crisis which shows why our global refugee regime is broken and how it can be fixed Europe is facing its greatest refugee crisis since the Second World War, yet the institutions responding to it remain virtually unchanged from those created in the post-war era. As neighbouring countries continue to bear the brunt of the Syrian catastrophe, European governments have enacted a series of ill-considered gestures, from shutting their borders to welcoming refugees without a plan for their safe passage or integration upon arrival. With a deepening crisis and a xenophobic backlash in Europe, it is time for a new vision for refuge. Going beyond the scenes of desperation which have become all too familiar in the past few years, Alexander Betts and Paul Collier show that this crisis offers an opportunity for reform if international policy-makers focus on delivering humane, effective and sustainable outcomes - both for Europe and for countries that border conflict zones. Refugees need more than simply food, tents and blankets, and research demonstrates that they can offer tangible economic benefits to their adopted countries if given the right to work and education. An urgent and necessary work, Refuge sets out an alternative vision that can empower refugees to help themselves, contribute to their host societies, and even rebuild their countries of origin.",
  "genres": [
    "Nonfiction",
    "Politics",
    "History",
    "Social Justice",
    "Social",
    "Economics",
    "Academic"
  ],
  "author": "Alexander Betts",
  "average_rating": "4.16",
  "url": "https://www.goodreads.com/book/show/34726375-refuge"
}