{
  "title": "Girl Gangs, Biker Boys, and Real Cool Cats: Pulp Fiction and Youth Culture, 1950 to 1980",
  "description": "Girl Gangs, Biker Boys, and Real Cool Cats is the first comprehensive account of how the rise of postwar youth culture was depicted in mass-market pulp fiction. As the young created new styles in music, fashion, and culture, pulp fiction shadowed their every move, hyping and exploiting their behaviour, dress, and language for mass consumption and cheap thrills. From the juvenile delinquent gangs of the early 1950s through the beats and hippies, on to bikers, skinheads, and punks, pulp fiction left no trend untouched. With their lurid covers and wild, action-packed plots, these books reveal as much about society’s deepest desires and fears as they do about the subcultures themselves.Girl Gangs features approximately 400 full-color covers, many of them never reprinted before. With 70 in-depth author interviews, illustrated biographies, and previously unpublished articles from more than 20 popular culture critics and scholars from the US, UK, and Australia, the book goes behind the scenes to look at the authors and publishers, how they worked, where they drew their inspiration and—often overlooked—the actual words they wrote. Books by well-known authors such as Harlan Ellison and Lawrence Block are discussed alongside neglected obscurities and former bestsellers ripe for rediscovery. It is a must read for anyone interested in pulp fiction, lost literary history, retro and subcultural style, and the history of postwar youth culture.Contributors include Nicholas Tredell, Alwyn W. Turner, Mike Stax, Clinton Walker, Bill Osgerby, David Rife, J.F. Norris, Stewart Home, James Cockington, Joe Blevins, Brian Coffey, James Doig, David James Foster, Matthew Asprey Gear, Molly Grattan, Brian Greene, John Harrison, David Kiersh, Austin Matthews, and Robert Baker.",
  "genres": [
    "Nonfiction",
    "Books About Books",
    "History",
    "Essays",
    "Pop Culture",
    "Sociology",
    "Pulp"
  ],
  "author": "Iain McIntyre",
  "average_rating": "4.45",
  "url": "https://www.goodreads.com/book/show/34734629-girl-gangs-biker-boys-and-real-cool-cats"
}