{
  "title": "A Family Chosen: Volume 2",
  "description": "***Note that this bundle includes books already available as single titles***  Save $2 if you buy the bundle vs the individual titles in each bundle!  Come meet my amazing extended family of men, the Protectors and the Barrettis!  Since all of my series cross over with one another, I've gotten many requests to bundle my bestselling books by reading order. Thus, A Family Chosen was born! These bundles tell the stories of men and women from my Protectors, Barretti, Escort and Finding series. Although each story was written so it could be read as a standalone, much more enjoyment can be gained by reading the books in order. You'll meet secondary characters who ultimately get their own books and you will understand the history behind each family of men when their series start to cross over with one another. Although there are 3 M/F books within the bundles, you can skip them if you want. The remaining books are all M/M or M/M/M.  The first volume introduces you to some of the guys from my Protectors series. In subsequent volumes, you will meet my guys from the other series.  Volume 1 Absolution (m/m/m) (The Protectors, #1) Salvation (m/m) (The Protectors, #2) Retribution (m/m) (The Protectors, #3)  Volume 2 Gabriel’s Rule (m/f) (The Escort Series, #1) Shane’s Fall (m/f) (The Escort Series, #2) Logan’s Need (m/m) (The Escort Series, #3) Finding Home (m/m/m) (Finding Series, #1) Finding Trust (m/m) (Finding Series, #2)  Volume 3 Loving Vin (m/f) (Barretti Security Series, #1) Redeeming Rafe (m/m) (Barretti Security Series, #2) Saving Ren (m/m/m) (Barretti Security Series, #3) Freeing Zane (m/m) (Barretti Security Series, #4) Finding Peace (m/m) (Finding Series, #3) Finding Forgiveness (m/m) (Finding Series, #4)  Volume 4 Forsaken (m/m) (The Protectors, #4) Vengeance (m/m/m) (The Protectors, #5) A Protectors Family Christmas (The Protectors, #5.5) Atonement (m/m) (The Protectors, #6)",
  "genres": [],
  "author": "Sloane Kennedy",
  "average_rating": "4.61",
  "url": "https://www.goodreads.com/book/show/34733363-a-family-chosen"
}