{
  "title": "Sex Machines: Photographs and Interviews",
  "description": "Through astonishing images and the surprisingly touching words of its subjects, Sex Photographs and Interviews explores the new sex machine underground in America and the homespun inventors and users who propel it. After contacting an active but intensely private Internet community of sex machine inventors, photographer Timothy Archibald eventually won their trust and was invited into workshops and homes. The resulting book is a powerful document that is by turns thought provoking, humorous, and always fascinating. Sex Machines celebrates the American spirit of invention while exploring the desires and confusions that exist between men and women in our changing culture. Many of the inventors seen within these pages are otherwise ordinary family men who were inspired to help repair strained relationships or simply enhance their wives’ sexual pleasure. Some inventors have expanded their hobby into thriving cottage industries, selling their creations on eBay and adult stores online. Archibald covers the broad spectrum of the makers—from the elusive creator of the Sybian, the forefather of sex machines, to lesser-known inventors like Paul Gaertner, who, laid off from his job in the high-tech industry, founded a new business by transforming a thrift store pasta maker into a high-powered sexual appliance. After receiving an apocalyptic vision of a future without men, Louis Walker constructs a sex machine prototype for the women survivors. Eric Reynolds credits his apparatus for saving his marriage, and Jon Traven uses his sex device as a form of Christian-based marriage counseling. Like the work of Bill Owens, Studs Terkel, and Diane Arbus, Archibald’s photographs and interviews find unexpected beauty and mystery among the lives of regular people—this time, as they engender a new form of “marriage enhancement” and sexual liberation in the suburbs and small towns across America.",
  "genres": [
    "Photography",
    "Nonfiction"
  ],
  "author": "Timothy Archibald",
  "average_rating": "3.67",
  "url": "https://www.goodreads.com/book/show/1208649.Sex_Machines"
}