{
  "title": "Safe Zone",
  "description": "DEATH OF THIRDSFIRST, in a quest for ultimate power, and military advantage, some of the greatest minds, in the US military, has created a bioengineered chemical weapon, VX-99. The result: the spread of a deadly virus called the Hemorrhage Virus, which will eventually force the evolution of some humans into unthinkable monsters called Variants. SECOND, to eradicate the Hemorrhage Virus, they bioengineered another chemical weapon with the hope that it will right a wrong. However, another virus has been gaining strength right under their noses.THIRD, after its near eradication, since the turn of the Century, the Bubonic Plague has returned to ravage humanity. It has spread with voracity across the United States, leaving only death and suffering in its wake. But, for some, there is hope for survival in a few small pockets of uninfected areas called Safe Zones. Nevertheless, for one Ex-Marine, Fletcher McBride, and his family, traveling to a Safe Zone, hidden in the mountains of Alaska, bringing with it the promise of new beginnings, and a sense of normality, with farming, community, including small family homes, a church, even trading, and small businesses, infrastructure, may prove to be more risky and dangerous. Their security is at great risk as the Plague is not their only enemy. They must also outrun and defend their lives from their own government, intent on wiping out all inhabitants in the known infected areas, even if there are many people who have not been infected. And then there are the Invisibles, the monsters, which had once been human, and have evolved into creatures, now known as Variants.Unless seen by special UV Detection Goggles (UVDS), these Variants can make themselves virtually invisible by camouflaging or adapting to anything in their environment. They heal quickly, fly, and can see clearly in the dark, as they are also nocturnal. Their ability to scale walls can be nearly effortless. And when they finally show themselves, it’s already too late.If Fletcher and his family, however, make it to the Safe Zone, what will they find there: Safety or a new, even more deadlier enemy?",
  "genres": [],
  "author": "N.J. Paige",
  "average_rating": "4.30",
  "url": "https://www.goodreads.com/book/show/34748399-safe-zone"
}