{
  "title": "Lonely Planet Croatia",
  "description": "Lonely The world's leading travel guide publisher Lonely Planet Croatia is your passport to the most relevant, up-to-date advice on what to see and skip, and what hidden discoveries await you. Sail the island-speckled coastline, marvel at historic forts and mansions or walk Dubrovnik's city walls; all with your trusted travel companion. Get to the heart of Croatia and begin your journey now! Inside Lonely Planet Croatia Travel  Colour maps and images throughout Highlights and itineraries help you tailor your trip to your personal needs and interests Insider tips to save time and money and get around like a local, avoiding crowds and trouble spots Essential info at your fingertips - hours of operation, phone numbers, websites, transit tips, prices Honest reviews for all budgets - eating, sleeping, sight-seeing, going out, shopping, hidden gems that most guidebooks miss Cultural insights give you a richer, more rewarding travel experience - history, cuisine, natural environment, arts, architecture Over 40 maps Covers Zagreb, Zagorje, Slavonia, Istria, Kvarner, Northern Dalmatia, Split & Central Dalmatia, Dubrovnik & Southern Dalmatia and more eBook (Best viewed on tablet devices and smartphones) Downloadable PDF and offline maps prevent roaming and data charges Effortlessly navigate and jump between maps and reviews Add notes to personalise your guidebook experience Seamlessly flip between pages Bookmarks and speedy search capabilities get you to key pages in a flash Embedded links to recommendations' websites Zoom-in maps and images Inbuilt dictionary for quick referencing The Perfect Lonely Planet Croatia , our most comprehensive guide to Croatia, is perfect for both exploring top sights and taking roads less travelled. Looking for more extensive coverage? Check out Lonely Planet Eastern Europe guide. About Lonely Since 1973, Lonely Planet has become the world's leading travel media company with guidebooks to every destination, an award-winning website, mobile and digital travel products, and a dedicated traveller community. Lonely Planet covers must-see spots but also enables curious travellers to get off beaten paths to understand more of the culture of the places in which they find themselves. The world awaits! Lonely Planet guides have won the TripAdvisor Traveler's Choice Award in 2012, 2013, 2014, 2015, and 2016. 'Lonely Planet. It's on everyone's bookshelves; it's in every traveller's hands. It's on mobile phones. It's on the Internet. It's everywhere, and it's telling entire generations of people how to travel the world.' -- Fairfax Media 'Lonely Planet guides are, quite simply, like no other.' - New York Times Important  The digital edition of this book may not contain all of the images found in the physical edition.",
  "genres": [
    "Travel",
    "Nonfiction",
    "Reference"
  ],
  "author": "Peter Dragicevich",
  "average_rating": "4.09",
  "url": "https://www.goodreads.com/book/show/34744796-lonely-planet-croatia"
}