{
  "title": "Alix and Nicky: The Passion of the Last Tsar and Tsarina",
  "description": "The dramatic story of Emperor Nicholas II and his wife Alexandra Fyodorovna, the last Tsar and Tsarina of Russia—A penetrating and deeply personal study that gives profound psychological insight into their marriage and how it shaped the  events that engulfed them.\n\nThere are few characters in history about whom opinion has been more divided than the last Tsar of Russia, Nicholas II, and his wife the Empress Alexandra Fyodorovna. On one hand, they are venerated as saints, innocent victims of Bolshevik assassins, and on the other they are impugned as the unwitting harbingers of revolution and imperial collapse, blamed for all the ills that befell the Russian people in the 20th century. Theirs was also a tragic love story; for whatever else can be said of them, there can be no doubt that Alix and Nicky adored one another. Soon after their engagement, Alix wrote in her fiancé’s diary: “Ever true and ever loving, faithful, pure and strong as death”—words which met their fulfillment twenty-four years later in a blood-spattered cellar in Ekaterinburg.\nThrough the letters and diaries written by the couple and by those around them, Virginia Rounding presents an intimate, penetrating, and fresh portrayal of these two complex figures and of their passion—their love and their suffering. She explores the nature and possible causes of the Empress’s ill health, and examines in depth the enigmatic triangular relationship between Nicky, Alix and their ‘favourite,’ Ania Vyrubova, protégée of the infamous Rasputin, extracting the meaning from words left unsaid, from hints and innuendoes..\nThe story of Alix and Nicky, of their four daughters known collectively as ‘OTMA’ and of their hemophiliac little boy Alexei, is endlessly fascinating, and Rounding makes these characters come alive, presenting them in all their human dimensions and expertly leading the reader into their vanished world.",
  "genres": [
    "History",
    "Nonfiction",
    "Biography",
    "Russia",
    "Russian History",
    "Romanovs",
    "Historical"
  ],
  "author": "Virginia Rounding",
  "average_rating": "3.82",
  "url": "https://www.goodreads.com/book/show/12086584-alix-and-nicky"
}