{
  "title": "The Erenwine Agenda",
  "description": "Amalia Erenwine—an environmental activist working in New York City as an architectural intern—takes on the natural gas industry in this visionary eco-fiction book by architect Maia Kumari Gilman. Amalia rails against the underwriting of her employer's work by a natural gas company involved with fracking. She clashes with the gas company's petroleum geologist, executive Mark Stone—and yet, a hurricane of personal and continental proportions triggers the two of them to open their minds to a new world view.\"The Erenwine Agenda is a modern work of fiction that addresses many of the issues that face our generations today. In the story of Amalia and Mark we move through many layers and perspectives of innocence, science, lifestyle, idealism, environmentalism, romance and realities in being conscious humans living now, and doing business with corporate interests. Fracking and natural gas are the major focus in how they affect us, as other concerns are addressed. Their story has a surprise ending and thought provoking situations and solutions. This book is a journey of awakening and finding positive ways of taking action to assist a world in environmental distress.\"—Janet StraightArrow, Shaman/Owner of Be The Medicine\"A timely and contemporary novel about love and care for the world—The Erenwine Agenda helps us understand how we might navigate from a place of non-communication to a place of resolution. The primary characters, who are both of mixed ethnicity but of different cultural backgrounds, live a clashing breakdown of the polarities within themselves and in the environment around them. The story skillfully takes the reader from one event to another until Superstorm Sandy shocks the characters into redefining a new position in the world. The story feels very real as it puts us head on in conversation with ourselves, with the corporate structures that govern our lives, and by extension, with our idealism. The Erenwine Agenda crosses disciplines, crosses cultures, and crosses opposing viewpoints to arrive at a more compassionate and empathetic place.\"—Raya Ani, Architect/Founder RAW-NYC Architects, 2017 President of American Institute of Architects (AIA) Middle East",
  "genres": [],
  "author": "Maia Kumari Bree Chowdhury",
  "average_rating": "4.50",
  "url": "https://www.goodreads.com/book/show/34744857-the-erenwine-agenda"
}