{
  "title": "Female, Recreational",
  "description": "The first book of the five-book Female, Recreational series, published between January 2017 and January 2021. It deals explicitly with sex and other topics, and is meant for readers over 18. The truck door opened, the warm afternoon air instantly permeating their space like breath, but Hannah shivered. Moving awkwardly in her restraints, Hannah crawled to the end of her cage and peered through the wire. They had pulled up to a loading dock, three men standing on it, and she wanted only to disappear again. She was glad for her modesty pad even as she cursed its inadequacy. The men weren’t there to ogle, however. They barely acknowledged her as they rolled the cart up and set her cage on it. “Bye,” she said to Stephanie, surprised by her sorrow at having to say farewell to a girl she’d just met. “Good luck,” Stephanie said back, smiling, as if this were all entirely normal. Maybe it was. Maybe Hannah would get used to this too. She looked back at the man pushing her cage, but he didn’t seem to know she was there. Nor did anyone else on the loading dock. Perhaps she was, in a sense, invisible now, her prayer granted. She was being rolled toward a pair of large doors that opened on their own as she drew near, revealing a cavernous space full of voices. As her eyes adjusted to the interior darkness, she saw what looked like a large gray wall before her, two or three stories tall. It wasn’t like any wall she’d ever seen before, however. Something was off about it. “Oh!” she cried when her eyes adjusted to the interior light and she realized what she was looking at. It was cages like hers, each cage secured in its own space, rows and columns of tiny cages where people sat or lay or moved. She knew, with a visceral horror bordering on nausea, that this was where she was destined, that this would be her next home. They’d called this the “stacks,” she recalled. This is what they stacks of human beings. No privacy. No peace. A female employee stood on a machine that rolled on thick tires, designed like an elevator to lift her. As Hannah watched, she bent to speak to the girl in a cage set on the floor, then she rose to the next cage up, her mouth open to say a few quick words before she ascended again. A second machine, a forklift, sat idle in the corner, and she knew this must be how the cages were lifted and moved. Like cargo. As her cart rumbled closer to the stacks, she understood that the sound of voices was coming from the people in the cages. They were talking to each other. She heard a playful argument. She heard laughter. She even heard someone sing, briefly, the chorus of a song her mother would have never allowed her to listen to. She was being pushed on a path parallel to the wall of cages and she stared at the people there. Most of them were nude, except for the silver collars, all identical to hers. Most were also wearing at least one cuff, like Hannah’s broker’s cuff. A few were chained by the wrists and ankles. One girl had something around her middle, a sort of belt. She assumed that everyone here was female, so the sight of a male, his sinewy back turned toward her, startled her. He was sitting in a cage three rows up, and she stared at him, all her attention focused on him, on the back of his head, the cut of his short, black hair, on his nakedness, on his shoulders and his spine and his bare bottom. She guessed he was in his early 20s, just a little older than she. If he felt her eyes on him, if he turned to look, if he turned his whole body, she would see him, all of him. She would see his penis.",
  "genres": [
    "BDSM"
  ],
  "author": "Badger Therese",
  "average_rating": "4.29",
  "url": "https://www.goodreads.com/book/show/34745003-female-recreational"
}