{
  "title": "Love in Springtime Collection",
  "description": "Being Lady Harriet’s Hero - A determined Lady, a heroic Lord, a treasonous plot, a daring rescue, an enduring love. Lord Geoffrey Clarence saved the life of his best friend, Charlton Edgeworth, Viscount Pendholm, and 6 other people. Recruited to spying for crown and country, he received the gift of an estate from the Prince Regent, which came with a dangerous mission included. Lady Harriet Edgeworth decided, a year ago, that Lord Geoffrey was to be hers, her hero, and nothing has changed her mind. When Lord Geoffrey moves nearby she soon finds a way to assist with the inventory of his property. Can Lord Geoffrey keep his mission secret, with Lady Harriet ever present? Can Lady Harriet get Lord Geoffrey to see her as a woman, not just Charlton’s sister? And, if he does, can he keep her safe in the midst of a treasonous conspiracy? Trusting the Earl - An Earl needing a wife, an impoverished Lady, manipulation, an unfortunate deception, a love saved. Estranged from her family, Lady Arabella, granddaughter of the Earl of Compton, is unused to the nobility. After her father’s death, Arabella sought a reference from her cousin, Lady Marianne, to find a governess position to support herself, and the orphanage her father founded. Lord Lucas Stanthorpe, Earl of Rothglen, must marry quickly, else lose most of his inheritance. When Lady Elizabeth, wife of the reclusive Marquis of Vale, suggests that Arabella will suit, Lord Lucas agrees. Love is the least of his concerns. But winning over Arabella will not prove so simple. She has requirements that must be met, and when Lord Lucas deceives her, she threatens to break off their engagement. Can Lady Elizabeth reunite the couple? And why does Lady Elizabeth care about bringing them together? Love Springs Anew - A lady with a temper, a scandal, a lonely Duke, a new chance for love. Gregory Burrowes, Duke of Chesney, lost his fiancé to scandal, then married, but his wife died from fever. Lonely, and lacking an heir, he finds most eligible young women childish. He meets Miss Philippa Dunn again, for the first time in years. Miss Dunn once publically lambasted her then fiancé, when he was caught in a compromising position with another woman. The ton forgave him, but has not forgotten her unladylike deportment. She is labelled a shrew, and shunned. No one will offer for her, so she is relegated to the job of chaperone for her pretty young cousin… But who is chaperoning Philippa and the Duke? The Duke’s Easter Proposal - An unmarried Duke, a humble talented girl, a chance meeting, a sweet temptation. Joshua Goodrich, the Duke of Falmouth, invites ladies, his potential brides, to Mrs. Fairway’s coffee house, a well-known, high class venue. He values Mrs Fairway’s establishment for her astute assessments of the Ladies he entertains, as well as for the delicious cakes and patisseries, which are made by her daughter, Bridget. As Lent approaches, the two women look set to endure lean times. At the Duke’s next visit, with the coffee house mostly empty, he truly notices, for the first time, Mrs. Fairway’s daughter. Will he persist in looking for a girl of the ton, or will he follow his heart and indulge in the sweet girl who makes the finest pastries in London? The Baron’s Secret Love - A Baron’s heir, a gently raised, yet barely tolerated orphan girl, a mystery of heritage, an impossible love, an unexpected conclusion. Mr William Barnes, heir to the Baron of Mowbourne, is used to attention from eligible young ladies, none of whom he likes. At a country Ball, he meets a fascinating young woman – whose heritage is unknown, and who is disparaged by his peers. Miss Grace Fillmore is falls in love with William and believes that he feels the same for her. Sadly, she will never be able to be his wife. Their love is not meant to be.",
  "genres": [],
  "author": "Arietta Richmond",
  "average_rating": "3.77",
  "url": "https://www.goodreads.com/book/show/34747934-love-in-springtime-collection"
}