{
  "title": "The New Negro: The Life of Alain Locke",
  "description": "Winner of the 2018 National Book Award for Nonfiction.A tiny, fastidiously dressed man emerged from Black Philadelphia around the turn of the century to mentor a generation of young artists including Langston Hughes, Zora Neale Hurston, and Jacob Lawrence and call them the New Negro -- the creative African Americans whose art, literature, music, and drama would inspire Black people to greatness.In The New Negro: The Life of Alain Locke, Jeffrey C. Stewart offers the definitive biography of the father of the Harlem Renaissance, based on the extant primary sources of his life and on interviews with those who knew him personally. He narrates the education of Locke, including his becoming the first African American Rhodes Scholar and earning a PhD in philosophy at Harvard University, and his long career as a professor at Howard University. Locke also received a cosmopolitan, aesthetic education through his travels in continental Europe, where he came to appreciate the beauty of art and experienced a freedom unknown to him in the United States. And yet he became most closely associated with the flowering of Black culture in Jazz Age America and his promotion of the literary and artistic work of African Americans as the quintessential creations of American modernism. In the process he looked to Africa to find the proud and beautiful roots of the race. Shifting the discussion of race from politics and economics to the arts, he helped establish the idea that Black urban communities could be crucibles of creativity. Stewart explores both Locke's professional and private life, including his relationships with his mother, his friends, and his white patrons, as well as his lifelong search for love as a gay man.Stewart's thought-provoking biography recreates the worlds of this illustrious, enigmatic man who, in promoting the cultural heritage of Black people, became -- in the process -- a New Negro himself.",
  "genres": [
    "Biography",
    "Nonfiction",
    "History",
    "Philosophy",
    "African American",
    "Race",
    "Art"
  ],
  "author": "Jeffrey C. Stewart",
  "average_rating": "4.03",
  "url": "https://www.goodreads.com/book/show/34757392-the-new-negro"
}