{
  "title": "A History of Children's Books in 100 Books",
  "description": "A History of Children's Books in 100 Books takes a global perspective and traces the development of the genre from ancient stories, such as Aesop's Fables and the Indian Panchatantra, through the Puritan primers of the 17th century to the Harry Potter series and books as technology.Taking the approach of its precursor, The History of the Book in 100 Books, this book is about children's books as artifacts, as well as the texts they contain, and the industry and society that produced them. It covers aspects of selection, design, production and marketing of books for children. For the most part, illustrations are key components of children's stories, visualizing fantastic scenes and making them instantly recognizable, and such artwork is beautifully reproduced throughout.The chapters, with topic examples, are:1. Oral traditions and pre-literacy; baby's first book; folk tales; nursery rhymes; board books; Sumerian \"lullaby\" tablet; Dr. Seuss.2. Fables around the world for the young; Panchatantra (India 200 AD).3. ABC of Aristotle (Middle English); pop-ups, picture books, early learning; alphabet books.4. Educational books, non-fiction; adult influence; behavior; The New England Primer.5. Smaller books for small readers; child protagonists; miniature books; chapter books.6. Animal Magic; Mother Goose; Charlotte's Web; Beatrix Potter; The Jungle Book; A. A. Milne.7. Innocence, experience, genre books; imperialism; religion; Little Women; Black Beauty.8. Fairies and Frighteners: Grimm Brothers; Japanese Fairy Tales; Edward Gorey; Maurice Sendak; Der Strewwelpeter.9. New genres, adventure stories; pulp fiction; C. S. Lewis; Pippi Longstocking; H. G. Wells.10. Wartime: Destruction of books; series; awards; Le Petit Prince; Nazi button book; Roald Dahl; Matilda.11 Comics; new media; Manga; survival manuals; cartoons; advertising; political correctness; awards.This is an authoritative introduction for general readers, for those interested in illustration arts, and for students of children's literature, its history, and the history of books. It is an essential selection for specialty and general collections.",
  "genres": [
    "Nonfiction",
    "History",
    "Books About Books",
    "Reference",
    "Adult",
    "Childrens"
  ],
  "author": "Roderick Cave",
  "average_rating": "3.66",
  "url": "https://www.goodreads.com/book/show/34766762-a-history-of-children-s-books-in-100-books"
}