{
  "title": "Sound of Us",
  "description": "Jake Bowden didn’t expect to be settling into a strong, loving relationship with another guy at only twenty-three years old—never mind with two. His chemistry with Cris is as strong as ever, while things with Charles are more like a simmer than a heavy boil. Charles says he’s perfectly content to go at Jake’s pace, but Jake isn’t sure slow is what he wants anymore. And when Jake wants something, he isn’t shy about going after it.Cris Sable is head-over-heels in love with the two men in his life, and he’s vowed to do everything he can to protect the fragile, three-way relationship they’re cultivating—even if it means lying about his past. A dark past that resurfaces in an unexpected way and forces Cris to make the difficult choice between shielding Jake and Charles from it, or trusting them enough to help him face it head-on.Charles Greenwood had forgotten what it felt like to be loved, until a feisty go-go boy and an ex-porn star fell into his bed, and then stole his heart away. He loves both men equally, but differently, slowly stoking the fire of the chemistry he shares with Jake, while passionately pursuing Cris—both in and out of bed. Their lives are entwining in the very best way…until Cris starts to pull away, distancing himself from the loving support of their triad. And after Cris disappears one night on a drunken bender, Charles vows to do whatever it takes to prove to Cris that he can trust them with anything—mind, body and spirit.Three separate hearts will finally beat as one.Note: This is the continuation of an m/m/m romance begun in Here For Us and is best read in order to fully enjoy the character and story development. The book also contains mild BDSM elements, including spanking.",
  "genres": [
    "M M Romance",
    "M M M",
    "Menage",
    "Romance",
    "Contemporary",
    "LGBT",
    "Polyamory"
  ],
  "author": "A.M. Arthur",
  "average_rating": "4.14",
  "url": "https://www.goodreads.com/book/show/34764992-sound-of-us"
}