{
  "title": "The Color of Money: Black Banks and the Racial Wealth Gap",
  "description": "“Read this book. It explains so much about the moment…Beautiful, heartbreaking work.”―Ta-Nehisi CoatesWhen the Emancipation Proclamation was signed in 1863, the black community owned less than one percent of the United States’ total wealth. More than 150 years later, that number has barely budged. The Color of Money pursues the persistence of this racial wealth gap by focusing on the generators of wealth in the black community: black banks. Studying these institutions over time, Mehrsa Baradaran challenges the myth that black communities could ever accumulate wealth in a segregated economy. Instead, housing segregation, racism, and Jim Crow credit policies created an inescapable, but hard to detect, economic trap for black communities and their banks.The catch-22 of black banking is that the very institutions needed to help communities escape the deep poverty caused by discrimination and segregation inevitably became victims of that same poverty. Not only could black banks not “control the black dollar” due to the dynamics of bank depositing and lending but they drained black capital into white banks, leaving the black economy with the scraps.Baradaran challenges the long-standing notion that black banking and community self-help is the solution to the racial wealth gap. These initiatives have functioned as a potent political decoy to avoid more fundamental reforms and racial redress. Examining the fruits of past policies and the operation of banking in a segregated economy, she makes clear that only bolder, more realistic views of banking’s relation to black communities will end the cycle of poverty and promote black wealth.",
  "genres": [
    "Nonfiction",
    "History",
    "Race",
    "Economics",
    "Politics",
    "Social Justice",
    "Sociology"
  ],
  "author": "Mehrsa Baradaran",
  "average_rating": "4.47",
  "url": "https://www.goodreads.com/book/show/34758210-the-color-of-money"
}