{
  "title": "The Witch and the Priest",
  "description": "\"Her books are among the finest historical novels ever written.\" - Alison Weir\"[O]rgies, spells, and rites . . . a tasty brew!\" - Library Journal\"This novel by Hilda Lewis is one of the best I have ever read about witchcraft.\" - Dennis Wheatley\"All-out weirdness ... The ghost of a witch and the parson who sent her up for trial and is now tormenting himself ... crimes, orgies, and the Devil in person.\" - Illustrated London NewsSamuel Fleming, an aging priest, is tormented by doubts on the case of Joan Flower and her daughters Margaret and Philippa, whom he helped condemn to death as witches in 1618. Were they guilty? Was justice done? Did he do all he could to save their souls? The spirit of Joan Flower appears to him and tells him that she has been rejected by both Heaven and Hell and is condemned to wander the earth. She unfolds a story of horror, telling how she and her daughters became witches, participated in orgies at the witches' sabbath with the Devil himself, cast spells to kill and torment their enemies, and eventually faced trial and execution. As Samuel listens, he tries desperately to find some way to save the witch's soul. And the stakes are for as the witch tells her horrifying tale, Samuel realizes that hers is not the only soul in jeopardy, and if he fails, he may be joining her in Hell!Hilda Lewis (1896-1974), a prolific author of historical fiction, ranked The Witch and the Priest (1956), based on the real-life case of the Witches of Belvoir, as her own favourite among her many novels. In creating this masterpiece of historical fiction, Lewis conducted extensive research on the case and on early works of witchcraft and demonology, resulting in a novel that is both compulsively readable and historically accurate. This new edition is the first in more than 40 years and includes an introduction by bestselling historian and novelist Alison Weir, and the original jacket art by Evelyn Gibbs.",
  "genres": [
    "Horror",
    "Historical Fiction",
    "Witches",
    "Fiction",
    "Gothic",
    "Historical",
    "Classics"
  ],
  "author": "Hilda Lewis",
  "average_rating": "3.99",
  "url": "https://www.goodreads.com/book/show/3475632-the-witch-and-the-priest"
}