{
  "title": "The Hacking of the American Mind: The Science Behind the Corporate Takeover of Our Bodies and Brains",
  "description": "\"Explores how industry has manipulated our most deep-seated survival instincts.\"—David Perlmutter, MD, Author, #1 New York Times bestseller, Grain Brain and Brain MakerThe New York Times–bestselling author of Fat Chance reveals the corporate scheme to sell pleasure, driving the international epidemic of addiction, depression, and chronic disease.   While researching the toxic and addictive properties of sugar for his New York Times bestseller Fat Chance, Robert Lustig made an alarming discovery—our pursuit of happiness is being subverted by a culture of addiction and depression from which we may never recover.             Dopamine is the “reward” neurotransmitter that tells our brains we want more; yet every substance or behavior that releases dopamine in the extreme leads to addiction. Serotonin is the “contentment” neurotransmitter that tells our brains we don’t need any more; yet its deficiency leads to depression. Ideally, both are in optimal supply. Yet dopamine evolved to overwhelm serotonin—because our ancestors were more likely to survive if they were constantly motivated—with the result that constant desire can chemically destroy our ability to feel happiness, while sending us down the slippery slope to addiction. In the last forty years, government legislation and subsidies have promoted ever-available temptation (sugar, drugs, social media, porn) combined with constant stress (work, home, money, Internet), with the end result of an unprecedented epidemic of addiction, anxiety, depression, and chronic disease. And with the advent of neuromarketing, corporate America has successfully imprisoned us in an endless loop of desire and consumption from which there is no obvious escape.             With his customary wit and incisiveness, Lustig not only reveals the science that drives these states of mind, he points his finger directly at the corporations that helped create this mess, and the government actors who facilitated it, and he offers solutions we can all use in the pursuit of happiness, even in the face of overwhelming opposition. Always fearless and provocative, Lustig marshals a call to action, with seminal implications for our health, our well-being, and our culture.",
  "genres": [
    "Nonfiction",
    "Health",
    "Psychology",
    "Science",
    "Audiobook",
    "Nutrition",
    "Politics"
  ],
  "author": "Robert H. Lustig",
  "average_rating": "4.09",
  "url": "https://www.goodreads.com/book/show/34757578-the-hacking-of-the-american-mind"
}