{
  "title": "O Lord, How Long: Wife Torture in American History",
  "description": "I began to study wife abuse in America early in the 1980's, participating in a program to help police deal with daily calls for help. My specific job was to provide some sort of historical context. A number of memories have stayed with me. First, of police officers describing the dangers of interfering in a domestic dispute. Especially vivid was the state trooper who described his fear of driving alone down a dark Maine road to face barking dogs straining against fully extended chains and an armed husband. His fear was palpable. No one said the obvious: if a burly trooper carrying a gun was afraid....  Providing a historic context proved to be quite difficult. Few people were working in the field. Historians studying the temperance and the women's rights movements touched upon the subject, but they ignored the centrality of the beaten wife in both movements. Historians of the temperance movement, for example, provided much data linking alcoholism with crime and economic distress. They produced numbers, tables, and graphs. Domestic costs were simply mentioned: broken furniture (but not broken bones), hunger, perhaps even starvation. I suspect that these mostly male historians did not actually see what they were reading. No bells went off. If they noticed the abuse at all, they probably saw it as a woman’s topic.   That soon changed and I am glad to have played a part, perhaps most importantly by showing that accounts of wife abuse are everywhere. Once you see them, you can never not see them. Pick up an old joke book, a songbook, a school reader. And sometimes, with considerable embarrassment, you will stumble over an account where you least expect it; for me it was a children's classic I had read, read again and probably reread. Near the end of Frances Hodgson Burnett’s The Secret Garden, Colin, Mary and Dickon are talking to Ben, the gardener, about the magic of words said over and over. Strangely, Ben chose to tell the children, “I’ve heard Jem Fettleworth’s wife say th’ same thing over thousands o’ times—callin’ Jem a drunken brute.” And every time Jem’s response is to give her “a good hidin’” and then get drunk at the Blue Lion. Colin blamed Jem’s wife. If she had used better words she might have gotten a bonnet instead of a beating. \"A bonnet instead of a beating.\" What a catchy chapter title, but how lunatic the suggestion that brutal husbands would be swayed by conciliatory speech. Not the husbands in these and later chapters",
  "genres": [],
  "author": "Jerome J. Nadelhaft",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/34753027-o-lord-how-long"
}