{
  "title": "The Enlightened Gene: Biology, Buddhism, and the Convergence that Explains the World",
  "description": "Eight years ago, in an unprecedented intellectual endeavor, the Dalai Lama invited Emory University to integrate modern science into the education of the thousands of Tibetan Buddhist monks and nuns in exile in India. This project, the Emory Tibet Science Initiative, became the first major change in the monastic curriculum in six centuries. Eight years in, the results are transformative. The singular backdrop of teaching science to Tibetan Buddhist monks and nuns offered provocative insights into how science and religion can work together to enrich each other, as well as to shed light on life and what it means to be a thinking, biological human. In The Enlightened Gene, Emory University Professor Dr. Arri Eisen, together with monk Geshe Yungdrung Konchok explore the striking ways in which the integration of Buddhism with cutting-edge discoveries in the biological sciences can change our understanding of life and how we live it. What this book discovers along the way will fundamentally change the way you think.Are humans inherently good? Where does compassion come from? Is death essential for life? Is experience inherited? These questions have occupied philosophers, religious thinkers and scientists since the dawn of civilization, but in today's political discourse, much of the dialogue surrounding them and larger issues--such as climate change, abortion, genetically modified organisms, and evolution--are often framed as a dichotomy of science versus spirituality. Strikingly, many of new biological discoveries--such as the millions of microbes that we now know live together as part of each of us, the connections between those microbes and our immune systems, the nature of our genomes and how they respond to the environment, and how this response might be passed to future generations--can actually be read as moving science closer to spiritual concepts, rather than further away. The Enlightened Gene opens up and lays a foundation for serious conversations, integrating science and spirit in tackling life's big questions. Each chapter integrates Buddhism and biology and uses striking examples of how doing so changes our understanding of life and how we lead it.",
  "genres": [
    "Nonfiction",
    "Science",
    "Spirituality"
  ],
  "author": "Arri Eisen",
  "average_rating": "4.29",
  "url": "https://www.goodreads.com/book/show/34763224-the-enlightened-gene"
}