{
  "title": "Escape from Syria",
  "description": "A graphic story of intense current events.From the pen of former Lebanon Star reporter Samya Kullab comes a breathtaking and hard-hitting story of one family's struggle to survive in the face of war, displacement, poverty and relocation.Escape from Syria is a fictionalized account that calls on real-life circumstances and true tales of refugee families to serve as a microcosm of the Syrian uprising and the war and refugee crisis that followed.The story spans six years in the lives of Walid, his wife Dalia, and their two children, Amina and Youssef. Forced to flee from Syria, they become asylum-seekers in Lebanon, and finally resettled refugees in the West. It is a story that has been replayed thousands of times by other families.When the family home in Aleppo is destroyed by a government-led bomb strike, Walid has no choice but to take his wife and children and flee their war-torn and much loved homeland. They struggle to survive in the wretched refugee camps of Lebanon, and when Youssef becomes fatally ill as a result of the poor hygienic conditions, his father is forced to take great personal risk to save his family.Walid's daughter, the young Amina, a whip-smart grade-A student, tells the story. As she witnesses firsthand the harsh realities that her family must endure if they are to survive -- swindling smugglers, treacherous ocean crossings, and jihadist militias -- she is forced to grow up very quickly in order to help her parents and brother.Kullab's narrative masterfully maps both the collapse and destruction of Syria, and the real-life tragedies faced by its citizens still today. The family's escape from their homeland makes for a harrowing tale, but with their safe arrival in the West it serves as a hopeful endnote to this ongoing worldwide crisis.Beautiful illustrations by Jackie Roche -- whose work on the viral web-comic, Syria's Climate Conflict, was seen prominently in Symboliamag. com, Upworthy.com and Motherjones.com, among others -- bring Kullab's words to life in stunning imagery that captures both the horror of war and the dignity of human will.",
  "genres": [
    "Graphic Novels",
    "Young Adult",
    "Comics",
    "Historical Fiction",
    "War",
    "Family",
    "Realistic Fiction"
  ],
  "author": "Samya Kullab",
  "average_rating": "4.09",
  "url": "https://www.goodreads.com/book/show/34774341-escape-from-syria"
}