{
  "title": "Instant Replay: The Green Bay Diary of Jerry Kramer",
  "description": "In 1967, when Jerry Kramer was a thirty-one-year-old Green Bay Packers offensive lineman, in his tenth year with the team, he decided to keep a diary of the season. “Perhaps, by setting down my daily thoughts and observations,” he wrote, “I’ll be able to understand precisely what it is that draws me back to professional football.” Working with the renowned journalist Dick Schaap, Kramer recorded his day-to-day experiences as a player with perception, honesty, humor, and startling sensitivity. Little did Kramer know that the 1967 season would be one of the most remarkable in the history of pro football, culminating with the legendary championship game against Dallas now known as the “Ice Bowl,” in which Kramer would play a central role. Nor could he have anticipated that his diary would evolve into a book titled Instant Replay , first published in 1968, that would become a multimillion-copy bestseller and be celebrated by reviewers everywhere, including the Washington Post ’s Jonathan Yardley, who calls it “to this day, the best inside account of pro football, indeed the best book ever written about that sport and that league.”This groundbreaking look inside the world of professional football is one of the first books ever to take readers into the locker room and reveal the inner workings of a professional sports franchise. From training camp, through the historic Ice Bowl, then into the locker room of Super Bowl II, Kramer provides a captivating player’s perspective on pro football when the game was all blood, grit, and tears. He also offers a rare and insightful view of the team’s storied leader, Coach Vince Lombardi. Bringing the book back into print for the first time in more than a decade, this new edition of Instant Replay retains the classic look of the original and includes a foreword by Jonathan Yardley and additional rarely seen photos from the celebrated “Lombardi era.” As vivid and engaging as it was when it was first published, Instant Replay is an irreplaceable reminder of the glory days of pro football.",
  "genres": [
    "Sports",
    "Football",
    "Nonfiction",
    "Biography",
    "Memoir",
    "Autobiography",
    "History"
  ],
  "author": "Jerry Kramer",
  "average_rating": "4.22",
  "url": "https://www.goodreads.com/book/show/34792.Instant_Replay"
}