{
  "title": "Taming the Beast",
  "description": "**Can be read as a standalone werewolf billionaire shifter paranormal romance book**The True Mates Series continues as billionaire CEO security expert Sebastian Creed battles his inner beast while trying to keep his desire for genius scientist Dr. Jade Cross from destroying them both. Shy and nerdy Lycan scientist Dr. Jade Cross has lived a quiet life, surrounded by her work and her research. She prefers proven facts, figures, and hard science and doesn't want complications in her life. But her resolve seems to go out the window every time she crosses paths with the handsome and dangerous Sebastian Creed. Since rescuing Jade from her mysterious kidnappers, Sebastian has tried hard to stay away from her. But he’s irresistibly drawn to the innocent, delicate beauty and he wants nothing more than to give in to his hunger. When Jade’s life is put in danger once again, Sebastian is tasked with keeping her safe, and he risks everything to make sure no harm comes to her.But, Sebastian has a secret. The former Marine turned billionaire CEO is hiding a beast inside him, an animal that wants to possess Jade. He must control his desires and wrestle his inner monster or risk destroying them both. As the evil mages and their leader Stefan, continue their war against the shifters and witches, Jade must walk the fine line between opening herself to Sebastian and preventing him from finding out about the existence of Lycans. With so many secrets between them, can they survive or will they both be caught in the crossfire? Taming the Beast is a full-length (79,000 words) werewolf paranormal romance with explicit love scenes, naughty language, and shifter suspense action with guaranteed HEA and no cliffhangers! Although it works as a standalone romance story, this book takes place in the True Mates series. Though not necessary, I recommend you read the rest of the books to understand the world and the main plot.True Mates Series Reading Order:Fated Mates (Book 1)Blood Moon (Book 2)Romancing the Alpha (Book 3)Witch’s Mate (Book 4)Taming the Beast (Book 5)",
  "genres": [
    "Paranormal",
    "Shapeshifters",
    "Romance",
    "Paranormal Romance",
    "Dragons",
    "Werewolves",
    "Contemporary"
  ],
  "author": "Alicia Montgomery",
  "average_rating": "4.51",
  "url": "https://www.goodreads.com/book/show/34804206-taming-the-beast"
}