{
  "title": "Faith, Power, Joy: Spiritual Guidance from 5 Generations of Remarkable Women",
  "description": "Faith, Power, Joy tells the multi-generational saga of a family of women who followed their intuition, demonstrated their faith, and transformed the challenges in their lives into opportunities for service and joy.FaithAt sixteen, Lottie won her husband-to-be in a daring bet and overcame his untimely death through prayer and love.PowerHer daughter, Minnie, broke the glass ceiling in the 1930's by becoming a well-known educator.JoySheryl, Minnie’s granddaughter, shares the family saga of five generations of women who reveal their secrets for following spiritual principles, living passionately and transforming adversity into resilience.The women’s stories begin in 1890, when the author’s great grandmother challenged a family friend in a bet and went on to overcome unexpected tragedy, grief and loss. She learned to share her faith through love and helping others heal. The family chronicle traverses time through the next generation when the author’s grandmother had a stellar career as an educator in the public schools, which she achieved by her determination and challenging the social norms of her times. Her daughter, the author’s mother, confronted lifetime illness and personal loss with courage and determination. The author expanded her own self-acceptance and understanding through spiritual practice, meditation and holistic healing, while her daughter shares the source of her strength though her devotionals and Christ-centered living.Each woman lived by her principles of love, faith, courage and determination. They each found their path in life by learning to trust themselves and follow their guidance. Their stories are both joyful and heartbreaking as each reveals her methods for overcoming adversity and transforming obstacles into opportunities. Each woman learned to embrace life with enthusiasm and share what she learned to help others.These remarkable women built on the spiritual growth of their foremothers. The author now shares their secrets for creating the lives they wanted through spiritual principles that apply today. They inspire us and provide guidance to harness our inner power, live by our faith, and share our joy with others.",
  "genres": [],
  "author": "Sheryl A. Stradling",
  "average_rating": "4.67",
  "url": "https://www.goodreads.com/book/show/34802866-faith-power-joy"
}