{
  "title": "Path of a Novice",
  "description": "Librarian Note: Alternate Cover Edition for ASIN: B06XW9XJD5.Fascinating and gripping first novel in The Silvan Series, by best-selling author R.K. Lander. Path of a Novice is an epic fantasy story of battle and magic, honour and discovery. The Silvan Series will bring together the greatest warriors of their time. In the name of justice; in the name of love.His face would kindle love, garner hatred, inspire loyalty - bring persecution.An immortal half-blood becomes a novice warrior and joins the ranks of the Silvans as they battle Sand Lords and Deviants. He only ever had one dream; to become a Silvan captain in an army commanded by the dominant Alpine elves, colonizers of the Great Forest. There had once been another dream though – to know who his father was, but years of unanswered questions later, he told himself it didn’t matter anymore.Meanwhile, the powerful Alpine lords weave a story of racial superiority, relegating the native Silvans to second-class subjects. Village leaders, Spirit Warriors and Foresters are starting to rebel.Fel’annár learns the true meaning of warrior hood when he travels as the only novice warrior in a multi-racial patrol into the Deep Forest. As he battles the enemy for the first time, a power unfolds, one he cannot control – does not want. While friendships are forged, a destiny begins to unravel, one that is tied to a past he knows nothing about. For others though, it is only a matter of time before the truth is revealed and the danger becomes real.Can Fel’annár overcome his fears, become the warrior he always wanted to be, or will his dreams be stunted by his own shrouded past? By one elf’s lust for absolute power?If you love fantastic worlds with compelling characters on a dangerous mission, you can’t miss this first instalment of The Silvan.",
  "genres": [
    "Fantasy",
    "Young Adult",
    "Audiobook",
    "Epic Fantasy",
    "Fiction",
    "High Fantasy",
    "Elves"
  ],
  "author": "R.K. Lander",
  "average_rating": "4.29",
  "url": "https://www.goodreads.com/book/show/34817434-path-of-a-novice"
}