{
  "title": "Comrade Chikatilo: The Psychopathology of Russia's Notorious Serial Killer",
  "description": "For twelve years, from 1978 to 1990, fifty-two girls, boys and young women were killed, mutilated and, in some cases, cannibalized in the Russian city of Rostov-on-Don and its environs. The bodies of the victims were found in parks and cemeteries, in vacant lots and on beaches. But most of all, they were found in forest belts - barriers of trees and shrubs, situated alongside roads and railroad tracks. One man was responsible for these brutal murders. His name is Andrei Chikatilo who, because of his membership in the Communist party, was called Comrade Chikatilo. Chikatilo lured his victims with his innocuous looks, easygoing manner and promises of food. In the case of children, chewing gum was enough to convince young boys or girls to follow him to their sad destiny. Chikatilo was able to elude capture through an incredible combination of police incompetence and state-sanctioned ignorance. Prior to glasnost, the murders were not even reported in the press since it was understood that there were no serial killers under a Communist regime. Compiled by two Russian writers, Comrade Chikatilo is the story of the killer. As Russians, the authors were able to get within the intricate Russian criminal justice system to offer a close look at the police investigation and capture of Chikatilo, complete coverage of the trial and, most fascinating of all, a vivid portrayal of the man himself. Working exhaustively, Krivich and Ol'gin interviewed everyone involved with the case - friends of the killer, families of the victims, and police investigators. They obtained Chikatilo's responses to their direct questions which were passed to him while he awaited trial. In addition, they worked closely with the eminent Russian attorney, Mark Kogan, who had complete access to all court files. Comrade Chikatilo offers the unique perspective and insight of its Russian authors in detailing the ironies of its Russian authors in detailing the ironies and peculiarities of life and justice i",
  "genres": [
    "True Crime",
    "Nonfiction",
    "Crime",
    "Serial Killer",
    "Psychology",
    "History"
  ],
  "author": "Mikhail Krivich",
  "average_rating": "3.75",
  "url": "https://www.goodreads.com/book/show/348081.Comrade_Chikatilo"
}