{
  "title": "The Unyielding",
  "description": "Stieg Engstrom, Angriest Viking Ever, has got big problems. The human Viking Clans of earth are in danger of being obliterated—along with the rest of the world—and the only one who may be able to save them is a super pain-in-the-ass Crow. Most people annoy Stieg, but this is the one woman he really can’t stand…Erin Amsel loves being a Crow! Why wouldn’t she when the other Viking Clans are so hilariously arrogant and humorless? She’s not about to let all that come to an end! She just didn’t expect to be shoulder to shoulder in battle with Stieg. Then again, he’s so easy to torment—and also kind of cute.With the future of the world riding on them, Stieg knows he’ll have to put aside his desperate need to kiss the smirk right off Erin’s face. Wait. What? He didn’t mean that—did he? No! They have one goal: To conquer the idiots. Because nothing bugs Stieg more than when idiots win. If only he can keep himself from suddenly acting like one….Introduction by Patricia Bray“Radio Silence” by Walter H. Hunt“The Nightside” by Julie Novakova“The Familiar” by Dave Farland“Me and Alice” by Angela Penrose“The Other Side” by S.C. Butler“The Hunt” by Gail Z. Martin & Larry N. Martin“The Sphere” by Juliet E. McKenna“Shame the Devil” by Sharon Lee & Steve Miller“The Captain’s Throne” by Andrija Popovic“Weird is the New Normal” by Jacey Bedford“And We Have No Words to Tell You” by Sofie Bird“Titan Descanso” by James Van Pelt“Alien Epilogue” by Jeanne Cook“The Haint of Sweetwater River” by Anthony Lowe“Music of the Stars” by Jennifer Dunne“The Night You Were a Comet” by Coral Moore“The God Emperor of Lassie Point” by Daniel J. Davis“Pandora” copyright © 2016 by C.S. Friedman“Round and Round We Ride the Carousel of Time” by Seanan McGuire",
  "genres": [
    "Romance",
    "Paranormal",
    "Paranormal Romance",
    "Fantasy",
    "Urban Fantasy",
    "Mythology",
    "Shapeshifters"
  ],
  "author": "Shelly Laurenston",
  "average_rating": "4.29",
  "url": "https://www.goodreads.com/book/show/34817106-the-unyielding"
}