{
  "title": "Semi-Broken",
  "description": "Wolf shifter Lucas Cooper is usually up for any wild mission Harper Hall throws his way. But impersonating a doctor and breaking a woman out of the psych ward at a supernatural prison? That’s a little crazy even for him. Until he sees her. One look into her haunted blue eyes and every protective instinct he has flares to life. He’ll do anything to save her. Not that it’ll be easy. Break her out of prison? No problem. Convince her she’s not broken, undeserving of love, and incapable of redemption? That might be trickier.  She’s 754821 and she’s a perfect killing machine. A nameless Sentry cleaner raised from birth to destroy paranormal threats, she’s the thing monsters fear. But then Lucas rescues her and everything changes. According to him, she has a family, a home, a purpose. To Lucas, she’s not just a number; she’s Seven, and she’s beautiful.  They’re nothing alike. He’s warm, open, easy to talk to. Her? Not so much. Violence is all she’s ever known.  And none of that matters when she’s in his arms.  But when a threat from her past emerges to destroy the new life she’s worked so hard to forge, Seven knows she’ll need to rely on her killer instincts to protect the future she longs for with Lucas. She can only hope she doesn’t lose what’s left of her humanity—and Lucas—in the process…  Semi-Broken works best if read as part of the Harper Hall Investigations series (Book 1: Semi-Charmed; Book 2: Semi-Human; Book 3: Semi-Twisted). This book is intended for mature audiences. This book is not intended for anyone who doesn’t enjoy smart, kick-ass (literally) heroines and potty-mouthed, alpha werewolves, and who doesn’t appreciate a plethora of nerdy pop culture references. For the rest of you: happy reading!",
  "genres": [
    "Paranormal",
    "Romance",
    "Paranormal Romance",
    "Fantasy",
    "Urban Fantasy",
    "Vampires",
    "Shapeshifters"
  ],
  "author": "Isabel Jordan",
  "average_rating": "4.28",
  "url": "https://www.goodreads.com/book/show/34814501-semi-broken"
}