{
  "title": "The Rogue",
  "description": "The notorious Rogue that began it all.Set in Cornwall, 1815. Wild, untamed and isolated. Lawlessness is the order of the day and smuggling is rife. Henrietta always felt most at home in the wilds of the outdoors but even she had no idea how the mysterious and untamed would sweep her away in a moment. ⭐⭐⭐⭐⭐ “This book has lots of twists and turns in the plot, and many giggle-making moments - I thoroughly enjoyed it.” ~ Amazon customer reviewBewitched by his wicked blue eyesHenrietta Morton knows to look the other way when the free trading 'gentlemen' are at work. Yet when a notorious pirate bursts into her local village shop, she can avert her eyes no more. Bewitched by his wicked blue eyes, a moment of insanity follows as Henrietta hides the handsome fugitive from the Militia.Her reward is a kiss, lingering and unforgettable.In his haste to flee, the handsome pirate drops a letter, a letter that lays bare a tale of betrayal. When Henrietta’s father gives her hand in marriage to a wealthy and villainous nobleman in return for the payment of his debts, she becomes desperate.Blackmailing a pirate may be her only hope for freedom.The first book of the acclaimed Rogues & Gentlemen series from Emma V Leech, the multi-award-winning Amazon Top 10 romance writer. Author of fan favourites such as Flaming June and Last Man in London, both listed in the 20 'Romance Reads You Can't Miss' in the Amazon Kindle Storyteller Awards 2018.**** Warning: This book contains the most notorious rogue of all of Cornwall and, on occasion, is highly likely to include some mild sweating or descriptive sex scenes. ****The Rogues & Gentlemen series can be enjoyed as stand-alone novels or as part of the wider series. If the full series appeals, the suggested – but by no means essential - reading order would • Book 1: The Rogue• Book 2: The Earl's Temptation• Book 3: Scandal's Daughter• Book 4: The Devil May Care• Book 5: Nearly Ruining Mr Russell• Book 5.5: Winter's Wild Melody• Book 6: One Wicked Winter• Book 7: To Tame a Savage Heart• Book 8: Persuading Patience• Book 9: The Last Man in London• Book 10: Flaming June• Book 11: Charity and The Devil• Book 12: A Slight Indiscretion• Book 13: The Corinthian Duke• Book 14: The Blackest of Hearts• Book 15 Duke and Duplicity• Book 16 The Scent of Scandal• Book 16.5 The Christmas Rose• Book 17 Melting Miss Wynter• Book 17.5 The Winter Bride, a Rogues & Gentlemen NovellaHappy reading! And please do leave a review if you can – it would mean the world to hear what you enjoyed most about the book.",
  "genres": [
    "Historical Romance",
    "Romance",
    "Historical",
    "Regency",
    "Historical Fiction",
    "Pirates",
    "Fiction"
  ],
  "author": "Emma V. Leech",
  "average_rating": "3.94",
  "url": "https://www.goodreads.com/book/show/34808699-the-rogue"
}