{
  "title": "Pandemic",
  "description": "Around the world, a deadly outbreak spreads.The CDC and WHO race to stop it, but they soon learn that this pandemic hides a dark secret. It may be the start of a scientific experiment that could alter the human race forever--and reveal a shocking truth about our future.A hundred miles north of Alaska, a US Coast Guard vessel discovers a sunken submarine at the bottom of the Arctic Ocean. It has no national identification and doesn’t match the records of any known vessel. Deep within, researchers find evidence of a scientific experiment that will rewrite our basic understanding of the human race.In Atlanta, Dr. Peyton Shaw is awakened by the phone call she has dreaded for years. As the CDC’s leading epidemiologist, she’s among the first responders to outbreaks around the world. It’s a lonely and dangerous job, but it’s her life—and she’s good at it. This time, she may have met her match.In Kenya, an Ebola-like pathogen has infected two Americans. One lies at death’s door. With the clock ticking, Peyton assembles her team and joins personnel from the Kenyan Ministry of Health and the WHO. What they find in the remote village is beyond their worst fears. As she traces the origin of the pathogen, Peyton begins to believe that there is more to this outbreak—that it may be merely the opening act in a conspiracy with far reaching consequences.In Berlin, Desmond Hughes awakens in a hotel room with no memory of how he got there or who he is. On the floor, he finds a dead security guard from an international pharmaceutical company. His only clue leads him to Peyton Shaw—a woman who seems to know him, but refuses to tell him how. With the police searching the city for him, Desmond desperately tries to piece together what happened to him. To his shock and horror, he learns that he may be involved in causing the outbreak—and could hold the only key to stopping it.As the pathogen spreads around the world, Peyton and Desmond race to unravel the conspiracy behind the pandemic—and uncover secrets some want to keep buried. With time running out, they face an unimaginable decision.",
  "genres": [
    "Science Fiction",
    "Fiction",
    "Thriller",
    "Audiobook",
    "Post Apocalyptic",
    "Mystery",
    "Dystopia"
  ],
  "author": "A.G. Riddle",
  "average_rating": "4.07",
  "url": "https://www.goodreads.com/book/show/34811896-pandemic"
}