{
  "title": "Hitler's Children: Sons and Daughters of Third Reich Leaders",
  "description": "“A mesmerizing, blood-chilling book . . . The contrast between innocent childhood experience, and the awful understanding of that experience that came with time, is enough to make you weep\" – Los Angeles Times  “They were the architects of terror but they were also fathers. Now, for the first time, their children speak out . . . a fascinating book” – Sunday Mail  “Absorbing . . . . most of the characters in Posner's study are more lurid than anything found in fiction. . . . a masterly job\" – Montreal Gazette   Göring. Hess. Mengele. Dönitz. Names that conjure up dark memories of Nazi Germany and the Holocaust. They were the architects of the Third Reich. And they were fathers. Gerald Posner convinced eleven sons and daughters of Hitler’s inner circle to break their silence.  Hitler’s Children is a riveting and intimate look inside the families of top Nazis. Based on exclusive and in-depth interviews, Gerald Posner provides an unforgettable portrait of some children ravaged by anger and hatred while others are riven with guilt and plead for forgiveness.  This second generation of perpetrators in Hitler’s Children struggle with their Third Reich inheritance. In grappling with memories of good and loving fathers who were later charged with war crimes, these heirs to the Nazi legacy add a fresh and important perspective to understanding the complexity of what historian, Hannah Arendt, dubbed “the banality of evil.” Hitler’s Children is much more, however, than a series of startling family interviews. It is also a spellbinding insider’s look at some of the men whose names have become synonymous with terror.  This is a classic book about the second generation of Nazi perpetrators (the only one ever to have family interviews with Hess, Mengele, Donitz, and Göring.) No other book author or documentarian ever got those children to talk again. And Norman Frank, the eldest son of war criminal Hans Frank, also never spoke to anyone but Posner.  Hitler’s Children serves as a vivid reminder to all of us of the dangers of ignoring anti-Semitism or thinking it will go away or can't get any worse. These are the children who saw their fathers corrupted by the insidious, centuries-old hatred, and their accounts serve as a clarion warning to us today that all decent people must redouble their efforts against racial and religious hatred.  The book, perhaps more timely today than when it was published in 1991, includes a new introduction, explaining why this book is particularly important during a time of rising international anti-Semitism.",
  "genres": [
    "History",
    "Nonfiction",
    "World War II",
    "Biography",
    "Holocaust",
    "War",
    "Audiobook"
  ],
  "author": "Gerald Posner",
  "average_rating": "3.99",
  "url": "https://www.goodreads.com/book/show/34835668-hitler-s-children"
}