{
  "title": "I'm Not with the Band: A Writer's Life Lost in Music",
  "description": "DON'T MISS SYLVIA PATTERSON'S BRAND NEW MEMOIR, SAME OLD GIRL, COMING SPRING 2023SHORTLISTED FOR THE COSTA BIOGRAPHY AWARD 2016'Celebratory and elegiac' Guardian'A roller-coaster memoir' Sunday Times'Funny, anecdote-packed, nostalgic but also very touching' The Pool'Patterson fillets out the pretentious bones of pop, leaving its glistening meat' ObserverThis is a three-decade survivor's tale . . . a scenic search for elusive human happiness through music, magazines, silly jokes, stupid shoes, useless blokes, hopeless homes, booze, drugs, love, loss, A&E, death, disillusion and hope.In 1986, Sylvia Patterson boarded a train to London armed with a tea-chest full of vinyl records, a peroxide quiff and a to write about music, for ever. She got her wish.Escaping a troubled home, Sylvia embarks on a lifelong quest to discover The Meaning of It All. The problem is she's mostly hanging out with flaky pop stars, rock 'n' roll heroes and unreliable hip-hop legends. As she encounters music's biggest names, she is confronted by glamour and tragedy; wisdom and lunacy; drink, drugs and disaster. And Bros.Here is Madonna in her Earth Mother phase, flinging her hands up in horror at one of Sylv's Very Stupid Questions. Prince compliments her shoes while Eminem threatens to kill her. She shares fruit with Johnny Cash , make-up with Amy Winehouse and several pints with the Manics' lost soul-man Richey Edwards . She finds the Beckhams fragrant in LA, a Gallagher madferrit in her living room and Shaun Ryder and Bez as you'd expect, in Jamaica.From the 80s to the present day, I'm Not with the Band is a funny, barmy, utterly gripping chronicle of the last thirty years in music and beyond. It is also the story of one woman's wayward search for love, peace and a wonderful life. And whether, or not, she found them.",
  "genres": [
    "Music",
    "Nonfiction",
    "Biography",
    "Memoir",
    "Autobiography",
    "Journalism",
    "Biography Memoir"
  ],
  "author": "Sylvia Patterson",
  "average_rating": "3.98",
  "url": "https://www.goodreads.com/book/show/34835348-i-m-not-with-the-band"
}