{
  "title": "Wayward Wulves Beware",
  "description": "Wayward Wulves Beware , first in the Eye of the Wulf series, weaves Celtic myth and mountain lore into a tartan of greed and treachery, courage and sacrifice. Wulves and Faer Ones, their faerie allies, defend Eden-like Lisnafaer against the corruption wrought by human necromancers.From on high, Sky-Wulf warns the birth of Anell and Akir’s eagerly awaited cubs portends imminent danger. Indeed, sons Kalar and Sonsie’s arrival throws their pack—and Lisnafaer—into turmoil. Kalar strives to become a hunter, a boar killer like Akir. But Sonsie, aspiring to be a great singer wulf, pursues the Faer Ones’ song.Thwarted efforts to guard the rebellious cubs cause Anell and Akir to clash. Though Akir forbids contact with all Faer Ones, he can’t prevent their shadowing his sons. Encounters with chancy supernatural beings intensify Kalar and Sonsie’s dangerous secret life.When the shape-shifting Lady and Lord of Lisnafaer lure the half-yearling brothers into the Cavern Perilous, their worst fears are confirmed. The wulves’ destiny is mortal combat with two banished beasts held captive in the Otherworld.But are the cubs the cure – or the cause? And what connects the dire beasts to blade-wielding human cutters?One answer lies in gloom-haunted Scanlon Hollow. Two cutter brothers, lusting for the Faer Ones’ golden apples, perform grisly rites to conjure the demon cat Scrag Tail. If they succeed, Terror Wulf follows.Cutters seek to exile the Faer Ones, take their forests, exterminate the wulves, and seize the deer for sport—the end of the Balance Green. Kalar and Sonsie must choose. Abandon their pack. Accept their destiny—and possible death. Or renounce their heroic calling. Assume their lot as marked wulves—certain death if the cutters get their way.Kalar and Sonsie’s adventures continue in next book in the Eye of the Wulf series.",
  "genres": [],
  "author": "L.N. Passmore",
  "average_rating": "4.43",
  "url": "https://www.goodreads.com/book/show/34823546-wayward-wulves-beware"
}