{
  "title": "The Locals",
  "description": "A rural working-class New England town electsas its mayor a New York hedge fund millionaire, in this inspired novel for our times--fiction in the tradition of Jonathan Franzen and Jennifer Egan, with the urgency of Hillbilly Elegy.  Mark Firth is a contractor and home restorer in Howland, Massachusetts, who feels opportunity passing his family by. After being swindled by a financial advisor, what future can Mark promise his wife, Karen, and their young daughter, Haley? He finds himself envying the wealthy weekenders in his community whose houses sit empty all winter.  Philip Hadi used to be one of these people. But in the nervous days after 9/11 he flees New York and hires Mark to turn his Howland home into a year-round -secure location- from which he can manage billions of dollars of other people's money. The collision of these two men's very different worlds--rural vs. urban, middle class vs. wealthy--is the engine of Jonathan Dee's powerful new novel.  Inspired by Hadi, Mark looks around for a surefire investment: the mid-decade housing boom. Over Karen's objections, and teaming up with his troubled brother, Gerry, Mark starts buying up local property with cheap debt. Then the town's first selectman dies suddenly, and Hadi volunteers for office. He soon begins subtly transforming Howland in his image--with unexpected results for Mark and his extended family.  Here are the dramas of twenty-first-century America--rising inequality, working class decline, a new authoritarianism--played out in the classic setting of some of our greatest novels: the small town. The Locals is that rare work of fiction capable of capturing a fraught American moment in real time. Advance praise for The Locals  -There could not be a more timely novel than The Locals. It examines the American self and American selfishness from 9/11 until today. Jonathan Dee has given us a master class in empathy and compassion, a vital book.---Nathan Hill, author of The Nix  -Jonathan Dee's manner is so forthright, his approach so quietly intelligent and direct, his small-town America with its dreams and ambitions and sense of order and rectitude so familiar, we realize we have acknowledged nothing particularly alarming about our weakening grasp on a functioning democracy. Hiding in plain sight is the blueprint of our decline--our easy corruptibility and willed ignorance, our ethical wobbliness and eagerness to sanitize history. The Locals is an absolutely riveting novel that dares to prod us awake. Whoever has ears let them hear--indeed.---Joy Williams, author of The Visiting Privilege",
  "genres": [
    "Fiction",
    "Contemporary",
    "Literary Fiction",
    "Novels",
    "Audiobook",
    "Book Club",
    "American"
  ],
  "author": "Jonathan  Dee",
  "average_rating": "3.34",
  "url": "https://www.goodreads.com/book/show/34836990-the-locals"
}