{
  "title": "Quiet Genius: Bob Paisley, British Football's Greatest Manager",
  "description": "Bob Paisley was the quiet man in the flat cap who swept all domestic and European opposition aside and produced arguably the greatest club team that Britain has ever known. The man whose Liverpool team won trophies at a rate-per-season that dwarfs Sir Alex Ferguson's achievements at Manchester United and who remains the only Briton to lead a team to three European Cups.From Wembley to Rome, Manchester to Madrid, Paisley's team was the one no one could touch. Working in a city which was on its knees, in deep post-industrial decline, still tainted by the 1981 Toxteth riots and in a state of open warfare with Margaret Thatcher, he delivered a golden era - never re-attained since - which made the city of Liverpool synonymous with success and won them supporters the world over. Yet, thirty years since Paisley died, the life and times of this shrewd, intelligent, visionary, modest football man have still never been fully explored and explained.Based on in-depth interviews with Paisley's family and many of the players whom he led to an extraordinary haul of honours between 1974 and 1983, Quiet Genius is the first biography to examine in depth the secrets of Paisley's success. It inspects his man-management strategies, his extraordinary eye for a good player, his uncanny ability to diagnose injuries in his own players and the opposition, and the wicked sense of humour which endeared him to so many. It explores the North-East mining community roots which he cherished, and considers his visionary outlook on the way the game would develop.Quiet Genius is the story of how one modest man accomplished more than any other football manager, found his attributes largely unrecorded and undervalued and, in keeping with the gentler ways of his generation, did not seem to mind. It reveals an individual who seemed out of keeping with the brash, celebrity sport football was becoming, and who succeeded on his own terms. Three decades on from his death, it is a football story that demands to be told.",
  "genres": [
    "Football",
    "Sports",
    "Biography",
    "Nonfiction",
    "Soccer"
  ],
  "author": "Ian Herbert",
  "average_rating": "4.22",
  "url": "https://www.goodreads.com/book/show/34824375-quiet-genius"
}