{
  "title": "Rosa No-Name",
  "description": "Can a young Mexican woman forgive the villagers who rejected her years earlier and help them find a better way to live…and to survive?Sixteen-year-old orphan Rosa No-Name has grown up in the remote Mexican village of Santa María, where the villagers resentfully meet only her most basic physical needs. Unwilling to offer love or guidance, they not only refuse to answer Rosa’s questions about who her parents were, they don’t bother to teach her what she needs to know about the facts of life.Tomás del Mundo, who smuggles the village “produce” to San Diego and spends only a small part of the proceeds on things the villagers want and need, gets Rosa pregnant. The villagers decide to rid themselves of their responsibilities to the unwed mother-to-be by coercing Tomás into taking Rosa back to San Diego and marrying her.Rosa and Tomás don’t love one another. Their marriage is one of uneasy convenience for her and open resentment for him, and she soon finds herself captive to his violence and egotistical whims.Returning to Santa María after discovering part of the truth about her mysterious background, Rosa must overcome her resentment toward the villagers and help them solve a generations-old problem. At the same time, she begins a quest for the “god” she has only heard about casually.R0SA NO-NAME is the stand-alone, coming-of-age prequel to the award winning 2011 Young Adult novel FOUND IN TRANSLATION.Author Joel Sutton “This is Roger Bruner at his finest. This engrossing story has more unanticipated twists and turns than a well-designed rollercoaster. But the ride is a thrill, with an ending that deeply satisfies. Bruner’s writing pulls you in so that you feel a part of the story. You feel the anger, sense of injustice, the marvels of love, and the beauty of forgiveness. You’ll thank yourself for reading Rosa No-Name!”",
  "genres": [
    "Christian Fiction"
  ],
  "author": "Roger E. Bruner",
  "average_rating": "4.37",
  "url": "https://www.goodreads.com/book/show/34845078-rosa-no-name"
}