{
  "title": "Accidentally on Purpose 6 Book Box Set",
  "description": "Six full novels are included in this box Accidentally on Purpose Worthy of Redemption Worth the Fight Tethered (An Accidentally on Purpose Companion Novel) Girl Code (An Accidentally on Purpose Companion Novel) Things Remembered (An Accidentally on Purpose Companion Novel) Accidentally on Purpose Emmy fights her attraction to two men. Kyle is the self-admitted jerk who is off limits because he’s her boss and has a steady girlfriend. Luke is the perfect guy that every woman wants to take home to their mother. Will Emmy choose the sinner or the saint? Worthy of Redemption Kyle Sterling is very well aware of his many downfalls and he does not deny his heinous actions. When his self-loathing comes between him and the woman he loves, will she prove that he is not only redeemable, but worthy of her love? Worth the Fight Luke Kessler will do almost anything to win the woman he loves, but when their pasts collide with their present, hurtful mistakes are made. How much is too much? Will he be able to prove to her that she deserves the world and his love? Tethered (An Accidentally on Purpose Companion Series Novel) Happy endings aren’t always a guarantee, even for two people who were born into this world for each other. Will the link between them bring them together or prove to ensnare them in heartache? Girl Code (An Accidentally on Purpose Companion Series Novel) When Tabitha and her best friend Leslie were young, they made a pact to never get involved with the same guy. Time, distance, and new lives have come between Leslie and Tabitha over the years, but Tabitha tries to uphold the girl code they created when they were children. Her loyalty to her old friend is admirable, but will this same loyalty destroy her chance with the man who just may be the love of her life? Things Remembered (An Accidentally on Purpose Companion Series Novel) Mayson Grayne has witnessed all of her friends get their Happily Ever Afters, but Mayson doesn't believe in her own HEA. She believes in making it through each day, even though her past as an addict and her broken memories hang over her in a dark cloud. When Mayson's ex, Grant Alexander, suddenly reappears, her carefully regimented life is disrupted. Old feelings are dredged up, as well as some distorted memories. As some of her shadowed memories become clearer, one of them with the potential to completely knock her off of her axis, Mayson begins to understand that the truth is not always as she remembers it.",
  "genres": [],
  "author": "L.D. Davis",
  "average_rating": "4.48",
  "url": "https://www.goodreads.com/book/show/34845964-accidentally-on-purpose-6-book-box-set"
}