{
  "title": "The Long Fuse: How England Lost the American Colonies 1760-1785",
  "description": "In The Long Fuse, Don Cook investigates the American Revolution from the British side, throwing new light on this colorful age and its players. He draws from a multitude of primary sources, including personal correspondence and political memoranda, to show how Britain, at the height of her power but suffering from internal political strife, made one mistake after another, culminating in the loss of her prized colonies. In opposition to King George's American policies were such towering figures as William Pitt, Edmund Burke, and Charles James Fox; their speeches in the House of Commons are some of the best oratory in the English language. But despite their eloquence and forcefulness, they did not have the votes to prevail. In the end, the Americans rebelled as much against an English political state of mind as against the British Army. Cook takes us through the war years: King George's decision that \"blows must decide\" the colonies' future; Lord North's futile effort to negotiate peace after the British defeat at Saratoga, which only hastened the American alliance with France; the secret letter from Washington to Lafayette that the British intercepted, perhaps altering the outcome of the Battle of Yorktown; and the peace negotiations masterminded by Franklin and John Jay. Winner of the Colonial Dames of America Annual Book Award 1996. \"The Long Fuse is a marvelous new way of understanding the Revolutionary War. Many Americans have no idea of the extraordinary combination of brilliance, ignorance, stubbornness and intelligence on the British side. We won with a majestic collection of heroes, fools, geniuses, and rogues; they lost with an unforgettable cast of colorful characters. This eye-opening book is a splendid historical synthesis.\" - John Chancellor",
  "genres": [
    "History",
    "American History",
    "Nonfiction",
    "American Revolution",
    "American Revolutionary War"
  ],
  "author": "Don Cook",
  "average_rating": "4.04",
  "url": "https://www.goodreads.com/book/show/1208982.The_Long_Fuse"
}