{
  "title": "Wicked Revenge",
  "description": "From Bestselling Author, Zoey Derrick, comes a BRAND NEW Standalone novel about getting back at the ones who've hurt you the most. This story is filled with bikers, biker antics, an Alpha Hero and sassy, feisty, get it done yourself, Heroine. Wicked Revenge is the First in a Brand New Standalone Series about the Wicked Angels MC, and clocks in at over 100,000 words! \"Hot and sexy biker plus a female lead who was no wallflower made for a page turner that hooked me and wouldn't let me go. If you adore MC books like I do, grab this one.\" - USA Today Bestselling Author, Terri E. Laine He was my protector when the world failed me. He hid me away to keep me safe. Protected me from those who would destroy me after they destroyed my family. He wasn’t innocent, he was going to be the president of the Wicked Angels MC. I knew he had secrets, we all do. But then, he was gone. And I was alone. Six years after his death, I see the world with new eyes, but those eyes still want revenge on those who took my safe haven, my family, away from me. I find myself with two choices. Let it go and move on, or what I'm going to do - get revenge. Knowing what I have to do, what I need to do, Logan ‘Loki’ Williams stands in my way, loyal to the man who protected me all my life. I have loved him since I was three. He was my brother’s best friend. But right now, he isn’t my priority. I’m so close to getting my revenge. He may figure out my secrets, but I can’t escape him. I won’t give up my plans for him. No matter how much he worships my body and calls to my heart. I will get my wicked revenge. Even if it kills me. Cover Jeff Hoffman Bob Vanderford Cover Designs by Dana **** CONTENT WARNING **** Contains sexy times between a man and woman, drugs, alcohol, bikers, and violence. Be prepared for a ride you'll never see coming.",
  "genres": [
    "Romance",
    "Suspense",
    "Second Chance",
    "Family",
    "Erotica",
    "Erotic Romance",
    "Dark"
  ],
  "author": "Zoey Derrick",
  "average_rating": "4.34",
  "url": "https://www.goodreads.com/book/show/34851348-wicked-revenge"
}