{
  "title": "The Wicked Woodleys Bundle",
  "description": "This hot historical bundle from USA Today Bestselling Author Jess Michaels includes all six books in the Wicked Woodleys series.  Forbidden (Book 1) Jude Samson has worked for the Woodley family for such a long time that he is seen as a brother. But he has very unbrotherly feelings toward the youngest of the clan, Lady Audrey. Novel Length.  Deceived (Book 2) Josie Westfall spent a lifetime feeling alone and bullied and an unfortunate incident involving her best friend’s brother, Evan, only made things worse. Still, when she and her mother are invited to the wedding he will be attending, they can’t exactly refuse. She hopes to avoid him, but instead they are thrown together and she is shocked to find that she actually begins to like the man she’s thought of as an enemy for years. Novel Length.  Tempted (Book 3) The youngest son of the Woodley clan, Gabriel has been obsessed with bringing his missing twin sister home since she disappeared over two years ago. His drive has forced him to block out all else, including any feelings he may have for the beautiful Juliet Gray. But when she is brought to London by Gabriel’s mother, avoiding the desire she inspires becomes impossible. Novel Length.  Ruined (Book 4) When Claire found out a devastating secret about her family, the famous Woodley clan, she ran straight into the arms of a criminal and disappeared for years. But now she’s desperate to escape his clutches and get back what he’s stolen from her: her child. She turns to longtime family horse master Warrick Blackwood, knowing his secrets can get her close to her target. Novel Length.  Seduced (Book 5) Criminal Jack Blackwood has plenty of problems, from his complicated relationship with his brother to the plethora of men coming to dethrone him as king of the underground. What he doesn’t need is a rich, bored gentleman showing up to try to join his gang. Worse, he doesn’t need that gentleman’s sister, Lady Letitia Seagate, chasing after him demanding he keep her brother safe. If only the lady weren’t so damned intriguing. Novel Length.  Fascinated (Book 6) It’s been over a decade since Aaron Condit’s lover, Viscount Noah Seagate died. While he has had temporary diversions, he hasn’t had a real relationship since. But now he’s been invited to the home of his best friend, Leticia Blackwood and he’ll be faced with deep temptation in the form of her brother, Griffin Merrick. Novella Length.",
  "genres": [],
  "author": "Jess Michaels",
  "average_rating": "4.20",
  "url": "https://www.goodreads.com/book/show/34854338-the-wicked-woodleys-bundle"
}