{
  "title": "Daughter of the Mara",
  "description": "Jayashree Atkinson knows she's she's been told so every day for the past five years. She has to be. After all, most people don't dream while they're awake. Locked away at thirteen for a crime she doesn't remember committing, Jay thought she would spend her entire life within the walls of a psychiatric hospital. Her life is one without hope. She spends each day drifting between what is real and what is pretend until she is unable to distinguish one from the other. Jay believes she will never escape until one day a mysterious young man named Harvey breaks into the hospital to tell her that she is not crazy, that she is in fact a living embodiment of a a mara.Freed from her captivity, Jay attempts to return to a normal life and understand who (or what) she really is. She is aided by Harvey and Vivian, another mara who has been banished to the dreamscape, only able to exist in the realm of nightmares. As Jay learns to control the nightmares within her she is soon faced with opponents outside her own mind. These include Harvey's brother Edmund, whose affection for Jay seems too good to be true, the mother who abandoned her as a child, and an entire court of mara who would see her executed for her merely existing.Torn between the world of humans and the realm of nightmares, Jay must work to control her power and achieve her destiny before forces darker than her own nightmares lock her away for good. Daughter of the Mara is the first book in a planned trilogy which follows Jay's journey as she learns to how to control her waking nightmares and find her place among a people she's never known. The series continues in Heir to the Dreamscape and Queen of Nightmares.Daughter of the Mara, a YA fantasy novel, explores the world of nightmares and what happens when you can't trust your own mind or what you see right in front of you. It is Shadow and Bone meets A Nightmare on Elm Street set to the tune of \"Enter Sandman.\"",
  "genres": [
    "Fantasy"
  ],
  "author": "Alexandra Bittner",
  "average_rating": "4.29",
  "url": "https://www.goodreads.com/book/show/34867281-daughter-of-the-mara"
}