{
  "title": "Orchid & the Wasp",
  "description": "“A gem of a novel.”—Elle“A winning debut.”—The New Yorker“Caoilinn Hughes is a massive talent.”—Anthony Doerr, Pulitzer Prize-winning author of All the Light We Cannot SeeWINNER OF THE COLLYER BRISTOW PRIZE • SHORTLISTED FOR THE BUTLER LITERARY AWARD• SHORTLISTED FOR THE HEARST BIG BOOK AWARDS • LONGLISTED FOR THE AUTHORS' CLUB BEST FIRST NOVEL AWARD • LONGLISTED FOR THE INTERNATIONAL DUBLIN LITERARY AWARD 2020 An unforgettable young woman navigates Dublin, London and New York, striving to build a life raft for her loved-ones amidst economic and familial collapse.In this dazzlingly original debut novel, award-winning Irish writer Caoilinn Hughes introduces a heroine of mythic proportions in the form of one Gael Foess. A tough, thoughtful, and savvy opportunist, Gael is determined to live life on her own terms. Raised in Dublin by single-minded, careerist parents, Gael learns early how a person’s ambitions and ideals can be compromised— and she refuses to let her vulnerable, unwell younger brother, Guthrie, suffer such sacrifices. When Gael’s financier father walks out on them during the economic crash of 2008, her family fractures. Her mother, a once-formidable orchestral conductor, becomes a shadow. And a fateful incident prevents Guthrie from finishing high school. Determined not to let her loved-ones fall victim to circumstance, Gael leaves Dublin for the coke-dusted social clubs of London and Manhattan’s gallery scene, always working an angle, but beginning to become a stranger to those who love her.  Written in electric, heart-stopping prose, Orchid & the Wasp is a novel about gigantic ambitions and hard-won truths, chewing through sexuality, class, and politics, and crackling with joyful, anarchic fury. It challenges bootstraps morality with questions of what we owe one another and what we earn. A first novel of astonishing talent, Orchid & the Wasp announces Caoilinn Hughes as one of the most exciting literary writers working today.",
  "genres": [
    "Fiction",
    "Ireland",
    "Contemporary",
    "Irish Literature",
    "Literary Fiction",
    "Novels",
    "Audiobook"
  ],
  "author": "Caoilinn Hughes",
  "average_rating": "3.31",
  "url": "https://www.goodreads.com/book/show/34864003-orchid-the-wasp"
}