{
  "title": "Variance",
  "description": "Paul Benedict is not like his fellow Utopians, immortals who live in absolute peace and love. He possesses the will to fight back, and he knows he must do so in order to protect his wife and daughters.When alien scouts terrorize Paul's planet, he and his family work together to engineer a nonlethal battle suit designed to stop the attacks. The source of the invasion is a man named Shadow who is intent on eliminating the Utopian race, whom he calls \"violators of God's power of life.\" He is also the game master of Divine Might-a gladiator game that may represent the Utopians' only hope. Using his invented suit, Paul embarks on a journey to gain mercy for his race by conquering the game, in which the champion's wish comes true. Only time will tell if he will survive and manage to do what is right when everything around him is wrong.From the Author:If you've felt the anguish of Star Wars Anakin in his journey to become Darth Vader, felt the adrenaline of The Hunger Games Gamemakers's arenas tormenting tributes, felt the love of Blade Runner 2049 AI Joi for her replicant companion K, was amazed by Marvel Cinematic Universe's Iron Man Mark 50 armor (Avengers Infinity War), and found humor in Atlas and Smith's relationship in the recent Netflix sci-fi movie Atlas, put all of those feelings into a blender and you get Raise Your Weapon: Variance.Check out a sample of the first 50 pages today on Amazon!Science-fiction topics in Raise Your Weapon: Variance: action and adventure, utopian and dystopian societies, artificial intelligence, AI symbiosis, pacifism, peacemaker, family and love, battle suits, mech armor, military technology, futuristic technology, nanotechnology, electromagnetic technology, physics and science, nuclear warfare, space travel, gladiator sport, battle royale, battle arenas, terraforming, new and distant worlds, future of mankind, aliens, epic battles, transformation, survival, survival games, augmented and superimposition realities, higher dimensions, and more.",
  "genres": [],
  "author": "Josen Llave",
  "average_rating": "3.71",
  "url": "https://www.goodreads.com/book/show/34862329-variance"
}