{
  "title": "Set for Life: Dominate Life, Money, and the American Dream",
  "description": "Learn to build a stable financial foundation that will carry you through times of economic uncertainty. Fans of Rich Dad, Poor Dad and Total Money Makeover will love the actionable advice in this personal finance bestseller!Set yourself up for life as early as possible, and enjoy life on your terms!Are you tied to a nine-to-five workweek? Would you like to “retire” from wage-paying work within ten years? Are you in your 20s or 30s and would like to be financially free―the sort of free that ensures you spend the best part of your day and week, and the best years of your life, doing what you want? By layering philosophy with practical knowledge, Set for Life gives young professionals the confidence they need to conquer their financial goals early in life.Building wealth is always possible, even while working full-time, earning a median income, and making up for a negative net worth. Accumulating a lifetime of wealth in a short period of time involves working harder and smarter than the average person, and Scott Trench—investor, entrepreneur, and CEO of BiggerPockets.com—demonstrates how to do just that. Even starting with zero savings, he demonstrates how to work your way to a five-figure income, then to six figures, and finally to the ultimate goal of financial freedom.Readers will learn how Save more income (50+ percent of it) while still having funDouble or triple your income in three to five yearsTrack your financial progress in order to achieve the greatest resultsBuild frugal and efficient habits to make the most of your lifestyleSecure “real” assets and avoid ”false” ones that destroy wealthAnd much more!",
  "genres": [
    "Finance",
    "Personal Finance",
    "Nonfiction",
    "Business",
    "Money",
    "Self Help",
    "Personal Development"
  ],
  "author": "Scott Trench",
  "average_rating": "4.16",
  "url": "https://www.goodreads.com/book/show/34868699-set-for-life"
}