{
  "title": "Energy Healing and Magnum Power",
  "description": "This book serves as an in-depth primer for all kinds of energy healers and people who have a genuine interest in natural healing methods. With this guide, regardless of what level you are at, you can enhance your skills and broaden your knowledges of energy and healing abilities. There are a total of 360 energy centres in the human body. There are four main categories of energy healing; Psychical, mental, emotional and spiritual. If even one of these becomes unbalanced, the client will feel lack and discomfort in their life. People are Spiritual healed through: Reiki, Quantum Touch, chakra healing, theta healing, a general healing of the auric field. Mentally being healed involves the cure of the thought fields through visualization meridian, tapping, affirmations, hypnosis and past regression. Emotions are healed through meridian tapping, ego healing, soul healing and clearing, soul reading and therapeutic crying. Physically the body is healed through energy medicine, healing in general, meditation, yoga, acupuncture, massage and exercise. This book is a revelation of surprising truths and secrets. Philosophy divides into 5 main branches: 1. Epistemology; The study of knowledge, 2.Ethics; The Study of Action, 3. Metaphysics; The Study of Existence, 4.Politics; The Study of Force and 5. Esthetics; The Study of Art. The science of metaphysics analyses the study of the fundamental nature of reality and existence itself. 'Meta-' means beyond or transcending; so meta-physical means that which lies beyond, underlies or transcends the physical realm. The Islamic healing is explained in further context throughout and proves to be a much faster and more affective alternative to healing techniques practiced in all other creeds put together. All that exists is created by the God the Almighty sovereignty. The Universe is a wheel to which astronomers collect information from the stars in the form of light energy. We cannot have faith upon stars and the universe because this is polytheism, Yes there are powers given to the universe by Allah but this does not entitle them to lordship and deity, for the most powerful is Allah, the omniscient and the omnipotent, beyond our comprehension, there is nothing greater in size than Allah and nothing can ever be compared to Him Almighty. The universe did not start off with the big bang, but it was Allah who created all living things from water. All creation will end catastrophically with the blowing of the trumpet of angel Israfeel by divine command. Well endowed is the one who with sufficient humility unites intellect with soul; for these 2 form a fortunate star-conjunction that has an enduring influence with the people. Islam is a spiritual path to the divine presence and the purpose of the prophet Muhammad (SAW) was to lead people to The Creator (Allah). Throughout life, many people find themselves in challenging situations where they end up becoming emotionally imbalanced. Experiencing fear, worry, sadness, stress, depression, and in some cases people can even end up committing suicide. People try to get away from their worries through methods such as taking a nap, eating out, watching a movie, meeting up with friends, smoking, drug intake, alcohol consumption, sexual intercourse, a night out at the club, but in the long run, this will not help the soul reach a higher level of peace and tranquillity. Fortunately, Some look towards religious practices for help. When you physically relax, this will relax the mind. Looking for the solution through Islam is assuredly the right answer. Enjoy this exciting adventure packed with information that ends with practical exercises to get you motivated.",
  "genres": [],
  "author": "Abdul-Jabbar Khan",
  "average_rating": "2.33",
  "url": "https://www.goodreads.com/book/show/34872599-energy-healing-and-magnum-power"
}