{
  "title": "Get Your Tongue Out of My Mouth, I'm Kissing You Goodbye!",
  "description": "Forget Faludi--Cynthia Heimel has been telling her readers about the \"backlash\" for years, and about its pernicious effects not only on the psyches of women but also on the lives of men, children, cats, and dogs. This collection confirms how indispensible she has become as a guide through the maelstrom of our times.This is vintage Heimel-the caustic wit, the chronic truth telling, the wicked insights into the age-old dance between the sexes are all here and sharper than ever. In \"She Asked For It?\" the spectacle of the Clarence Thomas-Anita Hill affair calls for a stern warning to all men that feminism is back with a vengeance. Turning her attention to the Men's Movement, she is sympathetic up to a point, after which she demolishes their ranks with a few motherly touches. She confides to us taht some days she thinks it would simply be easier to be a lesbian, and explains why. Proving that she's not always a pessimist, she discerns a silver lining in the dark clouds of smoke billowing off the L.A. riots-with all the rich guys stuck at home because of the curfew, perhaps they'll begin to wonder why it all finally hit the fan. And of course there is ample attention paid to the truly serious stuff--the observations and advice on love, sex, dating and outfits, without which no Heimel book would be complete. Where else can a women find such expert dating advice \"My new rule is to never believe a person is interested until you feel his tongue down your throat.\" Get Your Tongue Out Of My Mouth, I'm Kissing You Goodbye shows Heimel at her wicked best. She is our downtown Dorothy Parker, and an antidote to this absurd world for smart, sane women.Cynthia Heimel is finally becoming recognized for who she is-an Erma Bombeck for a new generation.",
  "genres": [
    "Humor",
    "Essays",
    "Nonfiction",
    "Feminism",
    "Comedy",
    "Womens",
    "Memoir"
  ],
  "author": "Cynthia Heimel",
  "average_rating": "3.76",
  "url": "https://www.goodreads.com/book/show/348775.Get_Your_Tongue_Out_of_My_Mouth_I_m_Kissing_You_Goodbye_"
}