{
  "title": "Ruby of Law",
  "description": "The Leadbetters have thrived on theft for generations. It has always been their way. The current generation is no different from generations before.Phillip Leadbetter is the oldest of the present siblings. At 29, he's constantly torn between his duty as a criminal, and his desire to live a better life.One night, while tailing his younger brother who always seems to find trouble, Phillip saves a young woman from what could have been a horrific situation. Seeing her facing four young men with obvious intentions for her, Phillip has no hesitation in stepping up and warning them off.Shaken and scared, Daisy is initially terrified of the man who has saved her. She expects he has similar plans for her that the young men had. Her fears are proven ungrounded. He looks rough. He looks like a criminal. He looks like he could break a woman such as herself, clean in two.Over time they are brought together again. She relaxes with him. They share an attraction that is strong. She keeps from him the truth about her job. He keeps from her the truth about his family. Both hope they other will never need to know the truth.Both are wrong.Fate steps in and leads them in such a way that in time it becomes glaringly obvious.She is a lawyer. He is a criminal.He is on one side of the law.She most definitely is well and truly on the other.~~ About the Forbidden Conflicts series:Welcome to the world of jewel thieves. On the one side is the Stonewarden family. Rich in technology and military training, they love the challenge of planning and executing high scale jewel heists. They don't do small time crime. They aim big. They do big. Then they turn things around and use their scores to help people at the lower end of the social spectrum. They are, some might say, a modern take on Robin Hood.In contrast is the Leadbetters. They do no large jobs so glamorous as large scale heists. They do nothing so noble as pass their spoils on to people less fortunate than themselves. Their family lives as generations always have, surviving on simple theft.Although as different as two families could be, underlying they do have two things in common. They both want the gems of the city. And they both are beginning to question if the way their individual families have always lived, really is any way to truly appreciate life.Stonewardens versus the Leadbetters … which side will YOU choose?",
  "genres": [],
  "author": "Ann M. Pratley",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/34883309-ruby-of-law"
}