{
  "title": "Dig Two Graves",
  "description": "Was it suicide ... or murder? Detective Sergeant Solomon Gray is driven to discover the truth. Whatever the personal cost.When teenager Nick Buckingham tumbles from the fifth floor of an apartment block, Detective Sergeant Solomon Gray answers the call with a sick feeling in his stomach. The victim was just a kid, sixteen years old. And the exact age the detective's son was, the son Gray has not seen since he went missing at a funfair ten years ago. Each case involving children haunts Gray with the reminder that his son may still be out there – or worse, dead. The seemingly open and shut case of suicide twists into a darker discovery. Buckingham and Gray have never met, so why is Gray's number on the dead teenager's mobile phone?Gray begins to unravel a murky world of abuse, lies, and corruption. And when the body of Reverend David Hill is found shot to death in the vestry of Gray's old church, Gray wonders how far the depravity stretches and who might be next. Nothing seems connected, and yet there is one common thread: Detective Sergeant Solomon Gray, himself. As the bodies pile up, Gray must face his own demons and his son's abduction. Crippled by loss Gray takes the first step on the long road of redemption. But is the killer closer to home than he realised?Set in the once grand town of Margate in the south of England, the now broken and depressed seaside resort becomes its own character in this dark police suspense thriller, perfect for fans of Ian Rankin, Stuart MacBride, and Peter James.Dig Two Graves is the first in the Solomon Gray series. Pick it up now to discover whether Gray finds his son in this thrilling new crime series.What Others Say\"... deeply emotional, a dark rollercoaster ride.\"Ed James, author of bestselling DI Fenchurch series\"A stunning book and a new series that has become a must read.\"M.W. Craven, author of the Washington Poe series\"Keith Nixon is one hell of a writer.\"Ken Bruen, author of the Jack Taylor series\"A compelling murder mystery with a multilayered and engaging new hero. Great read.\"Mason Cross, author of the Carter Blake thriller series\"Dig Two Graves is a smartly conceived introduction to a new series, and there are a good number of loose ends just waiting to tempt you to continue the journey.\"Crime Fiction LoverWhat Readers Say\"It’s just too damned good, I loved it.\"\"I haven’t given 5* for a while, this deserves it.\"\"Read it, you won’t regret it.\"\"What a joy.\"\"Could not put it down.\"\"Grittiness seeps out of this book from every pore.\"\"The author has hooked me in yet again.\"\"OMG loved this book!\"“This is a must read.\"\"A dark, uncompromising tale of loss, murder, and revenge. Glorious noir, which takes the police procedural elements and gives them new life. I can't wait to read the next step in Solomon Gray's journey for answers ...\"Luca Veste, author of the Murphy and Rossi crime series\"A damaged detective, haunted by a tragic past, a young son missing or dead, a man on a quest for redemption. Detective Sergeant Solomon Gray is a fine creation and Dig Two Graves is an intriguing, nourish mystery. Keith Nixon is a sparkling crime fiction talent.\"Howard Linskey, author of the Detective Ian Bradshawcrime series\"Keith Nixon does for Margate what Peter James did for Brighton … As dark and brooding as the wind-lashed shores of the North Sea, and with its disturbing echoes of the Elm Guest House scandal and suggestions of deep-seated institutional corruption, Dig Two Graves is a superb addition to the rich Brit Crime scene.\"Tim Baker, CWA shortlisted author of Fever City",
  "genres": [
    "Mystery",
    "Crime",
    "Fiction",
    "Detective",
    "Suspense",
    "Thriller",
    "Mystery Thriller"
  ],
  "author": "Keith Nixon",
  "average_rating": "4.01",
  "url": "https://www.goodreads.com/book/show/34892405-dig-two-graves"
}