{
  "title": "Kepler's Witch: An Astronomer's Discovery of Cosmic Order Amid Religious War, Political Intrigue, and the Heresy Trial of His Mother",
  "description": "Set against the backdrop of the witchcraft trial of his mother, this lively biography of Johannes Kepler – 'the Protestant Galileo' and 16th century mathematician and astronomer – reveals the surprisingly spiritual nature of the quest of early modern science. In the style of Dava Sobel's Galileo's Daughter , Connor's book brings to life the tidal forces of Reformation, Counter–Reformation, and social upheaval. Johannes Kepler, who discovered the three basic laws of planetary motion, was persecuted for his support of the Copernican system. After a neighbour accused his mother of witchcraft, Kepler quit his post as the Imperial mathematician to defend her. James Connor tells Kepler's story as a pilgrimage, a spiritual journey into the modern world through war and disease and terrible injustice, a journey reflected in the evolution of Kepler's geometrical model of the cosmos into a musical model, harmony into greater harmony. The leitmotif of the witch trial adds a third dimension to Kepler's biography by setting his personal life within his own times. The acts of this trial, including Kepler's letters and the accounts of the witnesses, although published in their original German dialects, had never before been translated into English. Echoing some of Dava Sobel's work for Galileo's Daughter , Connor has translated the witch trial documents into English. With a great respect for the history of these times and the life of this man, Connor's accessible story illuminates the life of Kepler, the man of science, but also Kepler, a man of uncommon faith and vision.",
  "genres": [
    "History",
    "Science",
    "Biography",
    "Nonfiction",
    "Astronomy",
    "Religion",
    "History Of Science"
  ],
  "author": "James A. Connor",
  "average_rating": "3.67",
  "url": "https://www.goodreads.com/book/show/1021757.Kepler_s_Witch"
}