{
  "title": "The Ayatollah Begs to Differ: The Paradox of Modern Iran",
  "description": "A revealing look at Iran by an American journalist with an insider’s access behind Persian wallsThe grandson of an eminent ayatollah and the son of an Iranian diplomat, now an American citizen, Hooman Majd is, in a way, both 100 percent Iranian and 100 percent American, combining an insider’s knowledge of how Iran works with a remarkable ability to explain its history and its quirks to Western readers. In The Ayatollah Begs to Differ, he paints a portrait of a country that is fiercely proud of its Persian heritage, mystified by its outsider status, and scornful of the idea that the United States can dictate how it should interact with the community of nations.With wit, style, and an unusual ability to get past the typical sound bite on Iran, Majd reveals the paradoxes inherent in the Iranian character which have baffled Americans for more than thirty years. Meeting with sartorially challenged government officials in the presidential palace; smoking opium with an addicted cleric, his family, and friends; drinking fine whiskey at parties in fashionable North Tehran; and gingerly self-flagellating in a celebration of Ashura, Majd takes readers on a rare tour of Iran and shares insights shaped by his complex heritage. He considers Iran as a Muslim country, as a Shiite country, and, perhaps above all, as a Persian one. Majd shows that as Shiites marked by an inferiority complex, and Persians marked by a superiority complex, Iranians are fiercely devoted to protecting their rights, a factor that has contributed to their intransigence over their nuclear programs. He points to the importance of the Persian view of privacy, arguing that the stability of the current regime owes much to the freedom Iranians have to behave as they wish behind “Persian walls.” And with wry affection, Majd describes the Persian concept of ta’arouf, an exaggerated form of polite self-deprecation that may explain some of Iranian President Ahmadinejad’s more bizarre public moments. With unforgettable portraits of Iranians, from government figures to women cab drivers to reform-minded Ayatollahs, Majd brings to life a country that is deeply religious yet highly cosmopolitan, authoritarian yet with democratic and reformist traditions—an Iran that is a more nuanced nemesis to the United States than it is typically portrayed to be.",
  "genres": [
    "Nonfiction",
    "Iran",
    "History",
    "Politics",
    "Religion",
    "Islam",
    "Travel"
  ],
  "author": "Hooman Majd",
  "average_rating": "3.77",
  "url": "https://www.goodreads.com/book/show/3488337-the-ayatollah-begs-to-differ"
}