{
  "title": "The Dragon's Village: An Autobiographical Novel of Revolutionary China",
  "description": "This extraordinary autobiographical story, compelling, candid, and deeply personal, plunges us into that tumultuous moment in China out of which the modern People’s Republic finally emerged. It is the first time a novelist has ever described that distant world in words that open it up to Western readers in the clearest, most vivid terms. Shanghai, 1949: we look through the eyes of Guan Ling-ling, a headstrong, idealistic seventeen-year-old. As her family departs for Hong Kong, Ling-ling boldly chooses to stay, and joins a revolutionary theater group which soon leaves the city to carry out the new reforms in the Chinese countryside. After a scant few weeks’ preparation, this city-bred schoolgirl suddenly finds herself in one of China’s most remote and impoverished areas, a world so far from her own experience that she can barely understand the lives she has been sent to change. On her very first night in Longxiang (“the Dragon’s Village”), a dusty hamlet far in the northwest, Ling-ling’s life is threatened by agents of a defiant landlord. From that moment on , an unrelenting flood of events engulfs plot and counterplot, acts of violence, midnight raids, dramatic personal revelations, even glimmers of first love, all set against a canvas of revolutionary upheaval. Chen carries us on an incredible voyage against China at a critical moment in modern history. No novelist has focused so clearly or so closely on the faces of revolution, or on the physical and social landscapes in which it was played out, from the urbane circles of Shanghai to the parched fields and desolate families in tiny Longxiang. We are wholly involved in Ling-ling’s struggle to assume the unfamiliar garb of soldier and teacher, and can recognize in it an adolescent’s painful path to maturity.",
  "genres": [
    "China",
    "Fiction",
    "Asia",
    "Historical Fiction",
    "Chinese Literature",
    "Asian Literature",
    "Historical"
  ],
  "author": "Yuan-Tsung Chen",
  "average_rating": "3.33",
  "url": "https://www.goodreads.com/book/show/34905.The_Dragon_s_Village"
}