{
  "title": "Sophie's Search for No-Where",
  "description": "Sophie is an eleven year old girl who's on a mission - to find No-Thing at No-Where. Yet to reach it she must enter the Imaginal World, the world of our dreams where she must first learn the power to dream harder, dream faster. Our world - the Regular World - is in need of help. Most of the people in the Regular World have no idea that the Imaginal World exists, much less how it works! Because of this lack of imagination and vision, only children can enter - and only a very few children are called upon to do so. Sophie is one such child. Once inside, Sophie embarks upon a fantastical journey where she encounters such characters as the energetic Eddie the Gangly, the slobbering Borik the Harkone, the one-eyed Huffalots, Jimbob the Oldest Sproggit, the enigmatic Snifflegruffs, the elegant Lady Drakona, the cruel Blackheart Jake, the odd pair Sergeant Spittlespat and PC Wobblekirk, grumpy Gabby, jolly Ralph - and Ruu Eddin, the mysterious multi-colored mystic trickster. Through each encounter Sophie is either helped or hindered along her path, having to solve riddles, get out of tricky situations, and above all - to trust her instinct. She enters the troublesome Forest of Fernacles; encounters a vortex in The-Lake-That-Is-An-Ocean; becomes a Queen on Sniffflegruff Island; battles against the Ghoul's spell; and she must seek out 'The Invisible One.' Along the way Sophie meets other children who are also on the same mission to find No-Where. Sophie's Search for No-Where shows us that the Imaginal World can be both a curious and an unsettling place - it is not for everyone. Yet for those who dare to step inside they will find the fantastical, the magical...where everything is exactly not what it seems. Sophie's Search for No-Where is a tale for young and old readers that will entertain, delight, and enchant.",
  "genres": [],
  "author": "Kingsley L. Dennis",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/34929618-sophie-s-search-for-no-where"
}