{
  "title": "Edgar and Lucy: A Novel",
  "description": "\"On every page Lodato's prose sings with a robust, openhearted wit, making Edgar & Lucy a delight to read...Lodato keeps us in his thrall because his grip on the tiller stays reassuringly firm. Not to mention the supporting cast he's gathered, a group so eclectic and beguiling that many of them could carry an entire novel of their own. A riveting and exuberant ride .\"―Cynthia D'Aprix-Sweeney, The New York Times Book Review\" Wonder-filled and magisterial ...Lodato's skill as a poet manifests itself on every page, delighting with such elegant similes and incisive descriptions…His skill as a playwright shines in every piece of dialogue…And his skill as a fiction writer displays itself in his virtuoso command of point of view. The book pushes the boundaries of beauty .\"― Chicago Tribune\"Edgar isn't like other boys and Lucy isn't like other moms, but grandma Florence keeps them tied to reality. And then their lives take a sharp turn...This otherworldly tale will haunt you.\"― People\"A stunningly rendered novel.\"― Entertainment Weekly\"A quirky coming-of-age novel that deepens into something dark and strange without losing its heart or its sense of wonder .\" ―Tom Perrotta, bestselling author of The LeftoversEdgar and Lucy is a page-turning literary masterpiece, a stunning examination of family love and betrayal.Eight-year-old Edgar Fini remembers nothing of the accident people still whisper about. He only knows that his father is gone, his mother has a limp, and his grandmother believes in ghosts. When Edgar meets a man with his own tragic story, the boy begins a journey into a secret wilderness where nothing is clear, not even the line between the living and the dead. In order to save her son, Lucy has no choice but to confront the demons of her past.Profound, shocking, and beautiful, Edgar and Lucy is a thrilling adventure and the unlikeliest of love stories.\"This tale gradually exerts a fiendish grip on the reader.\" ―Helen Simonson, author of Major Pettigrew's Last Stand\" I tore through the luminous pages of Edgar and Lucy as if possessed …What this book has to say about love and truth will stay with me for a very, very long time.\"―Sophie McManus, author of The Unfortunates\" I love this book . Profoundly spiritual and hilariously specific...an unusual and intimate epic that manages to capture the wonder and terror of both child and parenthood with an uncanny clarity.\"―Lena Dunham, bestselling author of Not That Kind of Girl\"Victor Lodato may be our bard of the sadness, humor, and confusion of loss. He senses the absurdities and elation of mourning and childhood with a capacious precision that brings to mind J.D. Salinger, Lorrie Moore, Karen Russell, even James Joyce . Edgar and Lucy will make you feel things you haven't felt in ages.\" ―Daniel Torday, author of The Last Flight of Poxl West",
  "genres": [
    "Fiction",
    "Contemporary",
    "Literary Fiction",
    "Book Club",
    "Mystery",
    "Audiobook",
    "Family"
  ],
  "author": "Victor Lodato",
  "average_rating": "3.94",
  "url": "https://www.goodreads.com/book/show/34930820-edgar-and-lucy"
}