{
  "title": "Cheer",
  "description": "CheerIt's not like I woke up one morning and thought \"I want to be a cheerleader!\" Heck, it's not like I woke up and thought \"I want to be into girls!\" either, but the universe didn't ask me about that one.It all started with a pair of pretty blue eyes. Isn't that how it always starts?The problem? Those pretty blue eyes are attached to Candice. We're talking Candice who's been my best friend forever. My partner in crime since before we could talk.Yeah, talk about taking \"it's complicated\" to a whole new plane of existence.So now I'm a cheerleader. And I totally have a crush on my best friend who may or may not be into me. Oh, and as if that wasn't enough I'm also dodging crazy Danielle who thinks I want to steal her man (not likely given recent developments in my sexuality) and crazy Chris who thinks he has a shot with me or Candice.Also not likely. See above about recent confusing developments in my sexuality.Yeah, high school was complicated enough before the whole cheerleader thing. And the whole Candice thing. And everything else. Now I don't know if I'm going to survive my senior year!Princess CharmingThe world thought being a princess was so cool, but Amelia knew the truth: it sucked.One kiss with another girl. One photograph that went viral. One international firestorm of gossip and Amelia finds herself banished halfway around the world to America to cool her heels and wait for the gossip to die down.A trip to Royal Realms was supposed to be the best part of Dani's school band career, but she was miserable.So she realized she was into girls. So she broke up with her longtime boyfriend. He didn't have to hold a grudge and do everything he could to ruin her trip. Dani was on her perfect vacation and all she wanted to do was escape.Two girls desperate to break free. Two girls who are about to be thrown together by a chance meeting. Royal Realms is supposed to be the place where dreams come true, and sparks will fly as princess meets band geek in an unexpected romance hot enough to cause an international incident!",
  "genres": [
    "Romance",
    "Lesbian",
    "Lesbian Romance",
    "LGBT",
    "Fiction",
    "Young Adult"
  ],
  "author": "Mia Archer",
  "average_rating": "3.74",
  "url": "https://www.goodreads.com/book/show/34925508-cheer"
}