{
  "title": "The Mind of Stefan Dürr: The SHIVA Syndrome Trilogy",
  "description": "ARE WE COSMIC APES?Neanderthal brains were larger than ours are. They thought in symbols and made and used tools over a million years ago. They interbred with modern humans, passing on a percentage of their genome in modern DNA. But did they endow us with covert paranormal abilities? Let The SHIVA Syndrome Trilogy take you on an exciting adventure into this possibility—that is, if it is only a possibility.UNLEASHED PARANORMAL POWERAn experiment goes horrifically wrong in a secret Russian mind research laboratory. A black hole vaporizes the city of Podol’sk, leaving a mile-deep crater and snuffing out thousands of lives. Simultaneously, a U.S. shuttle vanishes in orbit and a French astronomer spontaneously bursts into flame. What do these events have in common? The mind of Stefan Dürr, the mysterious subject of the experiment.Dr. Beau Walker, a disgraced researcher, is kidnapped by the government and coerced to join a U.S./Russian multidisciplinary scientific team, searching for the cause of the disasters. Beginning with a life-threatening descent into the Russian crater where scientific laws don't apply, he's thrown into a world of advanced biotechnology, biowarfare, genetics, paranormal research, and military intrigue.The stakes are inconceivable: Find and control the cause of the events or face planet-wide annihilation.REVIEWSBrian Allen, Editor of Phenomena Magazine, says, “Anyone who has seen the film ‘Lucy’ will get the idea, but more so... [This] is an absolute thrill ride of a book that is almost impossible to put down.”SHIVA is also recommended by Kirkus Review--“an exuberant and involving read,” Portland Book Review--“having the right amount of adventure and romance, this crisscrossing genre tale isn’t just a good read, but may also look great on a big screen,” Self-Publishing Review--“the book mixes uncommon palettes and manages a masterpiece with it. If The Andromeda Strain was analyzed in four dimensions, The SHIVA Syndrome might be the result,” Midwest Book Review-- “highly recommended, indeed; especially for thriller and sci-fi readers who have become deluged with too much predictability and who seek cutting-edge action, believable protagonists, and action that is solidly intense throughout,” and the San Francisco Book Review “Science fiction fans will love The SHIVA Syndrome. Fans of paranormal fiction, psychological thriller, philosophy and fantasy will love it, too.”",
  "genres": [
    "Science Fiction",
    "Fantasy",
    "Paranormal"
  ],
  "author": "Alan Joshua",
  "average_rating": "3.87",
  "url": "https://www.goodreads.com/book/show/34919749-the-mind-of-stefan-d-rr"
}