{
  "title": "Darwin Comes to Town: How the Urban Jungle Drives Evolution",
  "description": "From evolutionary biologist Menno Schilthuizen, a book that will make you see yourself and the world around you in an entirely new way.For a long time, biologists thought evolution was a necessarily slow process, too incremental to be observed in a lifetime. In Darwin Comes to Town, evolutionary biologist Menno Schilthuizen shows that evolution can in fact happen extremely quickly, and in the strangest of places: the heart of the city.Menno Schilthuizen is one of a growing number of “urban ecologists” studying how our manmade environments are accelerating the evolution of the animals and plants around us. Cities are extreme environments and, in a world of adapt or die, the wildlife sharing these spaces with us is being forced to adopt fascinating new ways of surviving, and often thriving.--Carrion crows in the Japanese city of Sendai have learned to use passing traffic to crack nuts.--Spiders in Vienna are adapting to build their webs near moth-attracting streetlights, while moths in some cities are developing a resistance to the lure of light bulbs.--Certain Puerto Rican city lizards are evolving feet that better grip surfaces like concrete.--Europe’s urban blackbirds sing at a higher pitch than their rural cousins, to be heard over the din of traffic, while many pigeons have eschewed traveling “as the crow flies” in favor of following manmade roads.Darwin Comes to Town draws on these and other eye-popping examples to share a stunning vision of urban evolution in which humans and wildlife co-exist in a unique harmony. It reveals that evolution can happen far more rapidly than Darwin dreamed, while providing a glimmer of hope that our race toward overpopulation might not take the rest of nature down with us.",
  "genres": [
    "Science",
    "Nonfiction",
    "Nature",
    "Biology",
    "Evolution",
    "Animals",
    "Ecology"
  ],
  "author": "Menno Schilthuizen",
  "average_rating": "4.10",
  "url": "https://www.goodreads.com/book/show/34930832-darwin-comes-to-town"
}