{
  "title": "Prohibition: A Concise History",
  "description": "Americans have always been a hard-drinking people, but from 1920 to 1933 the country went dry. After decades of pressure from rural Protestants such as the hatchet-wielding Carry A. Nation and organizations such as the Women's Christian Temperance Union and Anti-Saloon League, the states ratified the Eighteenth Amendment to the Constitution. Bolstered by the Volstead Act, this amendment made Prohibition alcohol could no longer be produced, imported, transported, or sold. This bizarre episode is often humorously recalled, frequently satirized, and usually condemned. The more interesting questions, however, are how and why Prohibition came about, how Prohibition worked (and failed to work), and how Prohibition gave way to strict governmental regulation of alcohol. This book answers these questions, presenting a brief and elegant overview of the Prohibition era and its legacy.During the 1920s alcohol prices rose, quality declined, and consumption dropped. The black market thrived, filling the pockets of mobsters and bootleggers. Since beer was too bulky to hide and largely disappeared, drinkers sipped cocktails made with moonshine or poor-grade imported liquor. The all-male saloon gave way to the speakeasy, where together men and women drank, smoked, and danced to jazz.After the onset of the Great Depression, support for Prohibition collapsed because of the rise in gangster violence and the need for revenue at local, state, and federal levels. As public opinion turned, Franklin Delano Roosevelt promised to repeal Prohibition in 1932. The legalization of beer came in April 1933, followed by the Twenty-first Amendment's repeal of the Eighteenth that December. State alcohol control boards soon adopted strong regulations, and their legacies continue to influence American drinking habits. Soon after, Bill Wilson and Dr. Bob Smith founded Alcoholics Anonymous (AA). The alcohol problem had shifted from being a moral issue during the nineteenth century to a social, cultural, and political one during the campaign for Prohibition, and finally, to a therapeutic one involving individuals. As drinking returned to pre-Prohibition levels, a Neo-Prohibition emerged, led by groups such as Mothers against Drunk Driving, and ultimately resulted in a higher legaldrinking age and other legislative measures.With his unparalleled expertise regarding American drinking patterns, W. J. Rorabaugh provides an accessible synthesis of one of the most important topics in US history, a topic that remains relevant today amidst rising concerns over binge-drinking and alcohol culture on college campuses.",
  "genres": [
    "History",
    "Nonfiction"
  ],
  "author": "W.J. Rorabaugh",
  "average_rating": "3.72",
  "url": "https://www.goodreads.com/book/show/34927471-prohibition"
}