{
  "title": "Just Unplug and Go: How Traveling the World Saved One Man's Soul",
  "description": "Just Unplug and How Traveling the World Saved One Man's Soul  by  Stan Crossland IIHave you ever reached the end of the line? Where you can't take 'life' anymore? After watching his Mom brutally battle Alzheimer's until the end and being worn out from the daily grind, Stan decided he was there; it was time to  Just Unplug and Go See the World. Travel has always been the antidote for this weary soul! Selling every possession, he drove cross-country reconnecting with old friends, purchased a ticket to Thailand, and off he went traipsing around 11 countries for five months. Old school no maps, no guidebooks and no agenda.  Determined to reclaim his mojo if it was still out there, armed with a seasoned yet open-minded perspective on life, yearning to be awed again, Stan's comical, insightful and friendly writing style will have you feeling as if you are right there with him.  Come along as he shares nutty stories about random encounters, charming locals and exotic locales; with illuminating epiphanies sprinkled throughout. If you want to find out how adventure can recharge your soul, this is the book! Whether you are 21 or 51, this book joyfully reminds you the world is a marvelous place filled with beauty, culinary delights, infectious people and enchanting experiences. All you need is a dash of wonder for the unknown, a smidgen of faith in others and the willingness to take some chances. Everyone needs to unplug from regular life, drop his or her day-to-day routine and go see what lays beyond the proverbial comfort zone --Live vibrantly in the moment! Sit back, turn off the T.V., relax and enjoy a rollicking ride as Stan brings you along his journey to reawaken his passion for, well, everything. Don't be surprised if you start booking your own travel odyssey soon enough. Life isn't over until you say it is!",
  "genres": [],
  "author": "Stan Crossland II",
  "average_rating": "3.67",
  "url": "https://www.goodreads.com/book/show/34933582-just-unplug-and-go"
}