{
  "title": "Warrior",
  "description": "**Second Edition****This is a fantasy-historical-romance, first and foremost. It is also multicultural as the characters are of different races.***Outspoken, loyal, and skilled with the sword, Princess Jaisyn St. Ives of Lytheria is no princess of fairytales. After the unexpected death of her father, Jaisyn takes control of the kingdom, expecting to be called upon to defend her claim to a throne previously held by men. What she does not expect is the arrival of Vulcan Mor’an, the High King of the Northlands and the one man she despises above all, who seems to believe he is now the rightful ruler of her kingdom. Even as he provides support for his claim, Jaisyn refuses to listen. She will meet Vulcan Mor’an on the battlefield before willingly handing her kingdom to a barbarian she blames for the death of a loved one!Born to a ruthless warlord of a father, Vulcan Mor’an is powerful, fierce and quite deadly. His prowess is legendary, and those who don’t fear the Northern Wolf, respect his skill on the battlefield and his reach beyond it. Vulcan prides himself on his strength, and with it, his lack of weakness. That is, until he encounters a spitfire princess intent on murdering him in his sleep. Jaisyn of Lytheria is unlike any lady Vulcan has encountered. In her golden body is a fierce adversary, a woman who does not cower in his presence like most but fights his every step with a stubbornness that both irritates and captivates him. This princess may become the one person capable of bringing him to his knees.Warrior is the tale of two feuding royals, their attraction despite their differences, and the consequences that come as a result of their union. With various obstacles threatening to tear them apart, Jaisyn St. Ives and Vulcan Mor’an struggle to keep their relationship afloat, and with it, their very lives.",
  "genres": [
    "Fantasy",
    "Romance",
    "Historical",
    "Interracial Romance",
    "Historical Romance",
    "Historical Fiction",
    "Enemies To Lovers"
  ],
  "author": "Violette Dubrinsky",
  "average_rating": "4.16",
  "url": "https://www.goodreads.com/book/show/12095098-warrior"
}