{
  "title": "The Lonely Mile",
  "description": "\"Allan Leverone delivers a taut crime drama full of twists and conspiracy. A serial-killer thriller with a heart.\" —Scott Nicholson, bestselling author of LIQUID FEAR and DISINTEGRATION  \"Thriller fans will enjoy Allan Leverone's new book, The Lonely Mile, which will carry readers along as a daughter is stolen by a vengeful serial killer and we follow her father's determined efforts to rescue her at all costs.\" —Dave Zeltserman, author of PARIAH and BLOOD CRIMES  * * * ALLAN LEVERONE is a bestselling Thriller writer. THE LONELY MILE is a chilling Hard-Boiled Thriller. * * *  PRODUCT DESCRIPTION: When struggling hardware store owner Bill Ferguson witnesses a kidnapping in progress, he reacts instinctively, breaking up the crime and saving a young girl. But the kidnapper, a sociopath known as the “I-90 Killer,” escapes and vows revenge, targeting Ferguson’s own daughter as his next victim. Now one terrified father must unravel a plot that may go much deeper than he realizes, racing against time to save his only child from an unthinkable fate.  * * *  REVIEWS:  \"A thriller in the style of The Silence of the Lambs, The Lonely Mile is a well written and gripping story of a battle between a serial killer and the father of his latest victim.  Leverone's style is not unlike that of Thomas Harris and the killer's point of view is given as much air time as that of the victim. The combination makes for a very unnerving read and the urge to keep going until the end - regardless of what horrors may lay in store.\" -Amazon Review  \"The reading is easy which is nice for an intense thriller. It reminds me of a James Patterson suspense. There were a few editing items I would have corrected but they didn't detract from the all out action and suspense. If you like thrillers I highly recommend you try this story. I definitely want to read more from this author.\" -Amazon Review  “Written with edge-of-your-seat suspense and precise detail that can only come from a writer who did his research while on the job, Final Vector kept me, a white-knuckle flier, in awe from the very first sentence. The successor to Michael Crichton has landed. And his name is Allan Leverone.” – Vincent Zandri, bestselling author of THE INNOCENT and MURDER BY MOONLIGHT  “Allan Leverone raises the stakes with every turn of the page in this can’t-put-down tale of ruthless terrorists and cold-blooded betrayal.” – Sophie Littlefield, author of the Anthony Award-winning novel A BAD DAY FOR SORRY  “…Leverone kicks down the doors with a tense, tightly-plotted thriller that will keep you turning the pages deep into the night…Grab this book and get ready for a wild ride.” – Christopher Poe, author of THE PORTAL  “Suspenseful and well-written, The Lonely Mile shows how far a father will go to save his child.” – Debbi Mack, New York Times bestselling author of IDENTITY CRISIS and LEAST WANTED  OTHER BOOKS BY THRILLER WRITER ALLAN LEVERONE: Heartless The Lonely Mile Final Vector Darkness Falls Postcards from the Apocalypse  Be sure to check out Allan of Facebook and Twitter @AllanLeverone Allan's website is @AllanLeverone.com",
  "genres": [
    "Thriller",
    "Fiction",
    "Mystery",
    "Mystery Thriller",
    "Suspense",
    "Crime",
    "Psychological Thriller"
  ],
  "author": "Allan Leverone",
  "average_rating": "3.66",
  "url": "https://www.goodreads.com/book/show/12095424-the-lonely-mile"
}