{
  "title": "Takdir Untuk Aku",
  "description": "Kerana yang beriman itu, wajib percaya akan takdir dan ketentuan.UJIAN itu hadir dalam pelbagai rupa dan pada Ziyad, ianya hadir dalam bentuk manusia. Teratai Nur menggoncang seluruh tenangnya. Sikap buaya darat itu terhenti angkara ego yang terpenjara bila Teratai Nur menolak. Sangkanya, ini pertemuan pertama mereka biarpun dia yakin, mereka ada sejarah bersama.“Sejauh mana kisah kita, Nur? Sampaikan Nur lari dari saya? Sejauh mana saya pernah heret Nur dulu? Sampai ke bilik ke?” - Ahmad Ziyad“Tak… Kita memang tak ada apa-apa. Saya tak pernah kenal awak dan awak juga sama…” - Teratai NurSepintar mana Teratai Nur menafi, kenyataan tak mudah dibohongi. Dialah orang itu. Yang pernah dimaki oleh lelaki segak berunifom putih dulu.“Aku benci kau dulu sebab kau sampah masyarakat tapi kenapa hari ini kau muncul jadi orang berbeza sedangkan kau adalah yang serupa?” - Ahmad Ziyad“Maaf kalau saya betulkan kata-kata awak, Encik Ziyad. Saya ni bekas. Bekas!” - Teratai NurTeratai Nur terus menafi tapi Ziyad tegas dengan perasaan sendiri. Mereka bersama. Bahagia. Tapi, bukan untuk selamanya bila kesilapan yang pernah Ziyad lakukan, mencelah. Antara permintaan ibu kandung, adik tiri dan suami… Teratai Nur kembali tercampak di lorong yang lebih gelap. Bukan kehendaknya. Tapi, bila kepercayaan seorang lelaki yang pernah berjanji untuk menjaganya sepenuh hati lebur, dia rasa dirinya dikhianati.“Siapalah yang nak terima orang macam Nur ni dengan ikhlas? Semua orang buat bersebab. Abang terima Nur kenapa pula?” – Teratai Nur“Sebab aku sayang kau! Aku cintakan kau!” - Ahmad ZiyadKerana perjalanan takdir itu bukan ada di hujung jari manusia, Teratai Nur bangkit walau tangan lain yang menariknya untuk kembali berdiri.“Abang sudi jaga Atai…” - Taufiq“Saya serahkan hidup saya pada abang…” - Teratai NurDia mahu melangkah ke depan, di mana Taufiq menanti. Namun, bila dia toleh ke belakang… Ziyad sedang menahannya pergi.Akhirnya, Teratai Nur akur… Ini adalah takdir untuk dia.",
  "genres": [
    "Romance",
    "Novels",
    "Collections",
    "Love"
  ],
  "author": "Rehan Makhtar",
  "average_rating": "4.34",
  "url": "https://www.goodreads.com/book/show/34940215-takdir-untuk-aku"
}