{
  "title": "The Crowns of Croswald",
  "description": "For those who wish that Narnia, Harry Potter, and Alice in Wonderland could go on forever, the best-selling Croswald series opens up a whole new world of magic!In this series opener, Ivy believes she is the only unmagical creature in a rich fantasy world, where gems are rife with power, quills cast spells, and dragons fill the sky. She must step into wonderland, discover her power at a magical academy, and find out who she truly is before it’s too late.As far back as Ivy can remember, she has worked in the Castle Plum’s kitchen as a scaldrony maid, tending the petite kitchen dragons that cook tarts and stews and roasts. On full moon nights, she meets her one connection to the outside world: Rimbrick the ancient dwarf with a dodgy past who brings tales of magic and books of wisdom.When she crosses a magical boundary, Ivy discovers a realm of enchantment and mystery. And she’s not the only one who makes a discovery: her entry is a shock wave of magic that sends ripples through Croswald. Certain parties—the Dark Queen, a lost pirate, a mad old potions master—have been waiting for this moment and feel a blast of recognition.Even Rimbrick’s stories and books cannot prepare Ivy for the world of magic—and an uncertain future—that rises up to meet her. Making friends that will last a lifetime—and save her life—she steps into her own abilities and discovers more about her hidden past, her magical blood, and the power of Croswald’s mystical stones. But all is not well: a dark history and an evil Queen threaten all that is good. Will Ivy’s bravery and wit be enough?Recommended as a read-aloud for families and an independent middle-grade fantasy read, The Crowns of Croswald is an award-winning, four-book series that will carry readers to a whimsical world that they won’t want to leave.",
  "genres": [
    "Fantasy",
    "Middle Grade",
    "Young Adult",
    "Magic",
    "Fiction",
    "Adventure",
    "Mystery"
  ],
  "author": "D.E. Night",
  "average_rating": "3.79",
  "url": "https://www.goodreads.com/book/show/34944590-the-crowns-of-croswald"
}