{
  "title": "A Queen's Spy",
  "description": "Alternate cover for this ASIN can be found hereA gripping Historical Adventure set in 16th Century Tudor England. Elizabeth Tudor needs a hero. Murder, Mystery & Intrigue with a Splash of Romance.  Based on actual historical events, an epic tale of a young Tudor nobleman’s courage as he tries to keep his future Queen safe in one of England’s most turbulent eras.  If you enjoy Tudor Fiction by Phillipa Gregory and Alison Weir then 'A Queens Spy' is perfect for you. A fascinating insight into Tudor England and the life of Elizabeth I before she sets foot on the steps to the throne.  The story unfolds in 16th Century Tudor England  Richard Fitzwarren is a Tudor nobleman with a dubious past who takes risks for a living.  His close friendship with Princess Elizabeth leads to his banishment to France, but when he returns he remains loyal to her.  At his side is Jack, his bastard sibling, and their relationship is a troubled one due to a family secret and their opposite personalities.  Will he keep the future Queen safe?  Will Richard Fitzwarren make it? Will he and his brother solve their issues? Will he manage to keep the Elizabeth Tudor safe?  Get A Queen's Spy: The Tudor Mystery Trials NOW for Fast Paced Action  If you Love Tudor Historical Fiction you'll love this  As a young man he had been attached to Thomas Seymour’s household, working with Seymour’s spy and intelligence network. Seymour, married to Henry VIII’s widow, Catherine Parr. Through his wife he became guardian of the young Elizabeth Tudor, and so Richard Fitzwarren became a close childhood friend of Elizabeth Tudor. So close that Seymour was readily believed when he blamed Richard for the liberties he himself had taken with the young princess. Banished from his father’s house for the crimes he didn’t commit he’s learnt his trade well in France returning to England a self styled Tudor soldier of fortune selling his services, and those of his mercenary band to the highest bidder.  Now he’s back in England, his bastard sibling at his side and a band of mercenaries at his back. Despite selling his services to support Northumberland place Lady Jane Grey on the throne he remains loyal to the lady Elizabeth; soon he is embroiled in Tudor intrigue as he tries to keep the Lady safe.  At his side is Jack, his bastard sibling; their relationship a troubled one. Jacks seeks to be his brothers equal but Richard has difficulty accepting him; impatient, impulsive and impetuous, he is everything Richard is not. There is a dark family secret Richard had always suspected; the final discovery of it changes the relationship between them forever.  Praise for A Queen's Spy – The Tudor Mystery Trials  “A Queen’s Spy: The Tudor Mystery Trials”, is a highly charged cloak and dagger mystery set in the troubling times that followed the reign of King Henry VIII in 16th Century England. - Readers Favorite  Dialogue and descriptive narrative carry this story along and give the reader a sense of the 16th Century. A thrilling and educational read. Readers Favorite  It is very well written, the prose really conjure up a picture and a feel for the period. The story is complex and there is lots going on and plenty to keep you turning the pages, indeed I found it difficult to put down and I was sad to reach the final pages. Tudor Historical Fiction at its best.",
  "genres": [
    "Historical Fiction",
    "Romance",
    "Fiction",
    "Historical",
    "Mystery",
    "Fantasy",
    "Historical Romance"
  ],
  "author": "Samantha Burnell",
  "average_rating": "4.03",
  "url": "https://www.goodreads.com/book/show/34941821-a-queen-s-spy"
}