{
  "title": "UNSCRIPTED: Life, Liberty, and the Pursuit of Entrepreneurship",
  "description": "Build A Business That Goes Beyond Paying Bills—It Changes Your Life.  Life. Liberty. And the Pursuit of Entrepreneurship.  It is waking up in the morning and pinching yourself black-and-blue that OMG, this is my life, and it is freaking awesome. You live in your dream house, but there's no mortgage. No alarm clock, no boss, no bills. No claims on the day's time other than what you choose. It is making more money before breakfast than you made for an entire week at your last job. It is a crazy expensive car parked in your garage, a victorious symbol that your dreams no longer sleep in fantasies, but are awake with reality.  Make no mistake, this life exists. I know, because it has been mine for nearly 20 years. And in a few short years, it can be yours as well. Better, you won't need 5 tedious decades of soul-suffocating frugality, thankless jobs, and patient investing with our trusted friends on Wall Street.  Unfortunately, you have been SCRIPTED to believe that such a life is out of your reach, or only possible for a certain type of person; someone with a certain college degree, a certain amount of VC funding, or a certain LinkedIn network of connected friends from Stanford. I am here to tell you, that none of it is true.  While I have been entrepreneur most of my life, I am no one special. You won't read about me over at Tech Crunch or in some Silicon Valley newsletter. While I have been an internet entrepreneur since the old \"you've got mail\" AOL days, I have never been funded by venture capitalists, I have never had a payroll with more than 5 people on it, and I have never studied computer science at school.  Despite this, I am able to create profitable businesses that create the type of UNSCRIPTED life described above. We are talking five- and six-figure monthly profits with valuations in the millions. Although I have had two successful exits, do not let that scare you; it is just a welcome side effect of the process.  Make no mistake, UNSCRIPTED is not about some trendy new marketing tactic that becomes ineffectively overused within months. It's not about stock-market fairy tales and depriving yourself of life's luxuries; Amazon already has a gazillion books on such trash. UNSCRIPTED was written to change your life.  It was written for you if life has become hopeless and dissatisfying. It is for you if your weekday is held hostage by the bribery of its paycheck. It is for you if you are sick of the suck and tired of the tiresome: the breakroom gossip, the office politics, the managerial butt-kissing, and whatever else boils when multiple human beings are tossed in a box and tasked with corporate minutia. It is for you if you yearn for the creative autonomy to pursue work that matters. It is for you if you have X-ray vision and can see what your parents cannot; that life's formulaic, scripted template has become dated and flawed.  But most importantly, UNSCRIPTED is for you if you have been an aspiring entrepreneur far too long, someone who cannot turn a corner, turn a break, or turn a profit. Someone who might already own a business, but like a job, it just steals time and barely keeps the bill-paying treadmill moving until next month.  So, if you are ready for the challenge, get ready for a sh*t-your-pants revelation that everything you have been taught is bullsh*t. Legendary bullsh*t.  Paradigm shift?  Heck no. The problem is the paradigm itself. You have allowed the paradigm to set the rules, call the shots, and dictate the decisions. The problem is, you have allowed ordinary thinking preached by ordinary people to produce exactly that; an ordinary life. \nThe paradigm shift is realizing the paradigm is sh*t.",
  "genres": [
    "Business",
    "Entrepreneurship",
    "Self Help",
    "Nonfiction",
    "Finance",
    "Money",
    "Personal Development"
  ],
  "author": "M.J. DeMarco",
  "average_rating": "4.41",
  "url": "https://www.goodreads.com/book/show/34937695-unscripted"
}