{
  "title": "Hatred Rising 2014-2016: A Collection of Political Cartoons by Paul Jamiol",
  "description": "Hatred Rising 2014-2016 - A Collection of Political Cartoons by Paul Jamiol is the third book of political cartoons from cartoonist Paul Jamiol. Once again, he takes his pen to the drawing board and has much to say about a world that has become enveloped in a toxic cloud of hate and divisiveness. He tries to clear away that toxicity and bring about a clear view of those who are cranking out this harmful atmosphere.2014 through 2016 was a period unlike any other in U.S. history. Americans of every group and community were deeply affected. Jamiol's pen records that period and presents that recording using a selection of over 180 cartoons from over 325 cartoons that he drew over that period.Jamiol pursues honesty with his visuals. He says of that pursuit, \"In this day and age of instant news, social media and agenda-driven commentators, much gets lost. I try to bring my view to the drawing table without all the noise or distortion and let the reader decide the issue.\"A third book?! Just give it a rest! What more can he say? Jamiol apparently thinks there's plenty more to say and is not about to rest. \"Those who give rise to hatred are the destroyers of humanity and I cannot sit back and do nothing. Sharing this collection of my cartoons is my way of telling it like it is and focusing on those who are telling it like it isn't. This period requires our scrutiny so that we might look in our collective mirrors and ask ourselves what we've done right and what we've done wrong. We need to be honest with ourselves if we want our country to be a better place.\"Like his previous works, Jamiol strives to be truthful, candid and honest. Fake news, propaganda and the Big Lie are the tools of revisionists who want to hide their unsavory deeds in an effort to shun accountability and responsibility.  Hatred Rising 2014-2016  points out those Jamiol feels are responsible and highlights the fact that accountability really is a necessity. Jamiol's non-revisionist telling of events comes through once again.This isn't a world-changing book. It is a hard look on how a political cartoonist sees the world. Whether or not you agree or like how he handles issues, you will be captivated by his creativity, his toughness and his quest to point out the wrongs that hurt us all.",
  "genres": [
    "Politics"
  ],
  "author": "Paul Jamiol",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/34933571-hatred-rising-2014-2016"
}