{
  "title": "Scandal's Daughter",
  "description": "Sebastian Grenville, The Duke of Sindalton.Known as Sin to the ton, he has had his fair share of scandal. His father's involvement in what became referred to as 'The Scandal of the Century' plunged him into the spotlight at the tender age of twelve, and he's been there ever since. Egged on by his best friend, Beau - The Marquis of Beaumont, his life is one of dissipation and ease.But every duke needs an heir.Everyone knows Sindalton is in the market for a wife. Both men, bored to death by balls and matchmaking mamas, go to a friend's hunting lodge in Cornwall. But caught in a storm, Sindalton heads for cover. Seeking shelter in a cave, the duke is delighted when he stumbles upon Miss Georgiana Bomford, the niece of the local doctor.But the feisty red-headed beauty is unimpressed by his attempt to entice her. Sindalton, however, is captivated and intent on seduction, makes her the target of his all too tempting charms.But Georgiana is not who he thinks she is, and when they meet again in London, the scandalous past is in danger of repeating itself.*****The Rogues & Gentlemen series can be enjoyed as stand-alone novels or as part of the wider series. If the full series appeals, the suggested – but by no means essential - reading order would • Book 1: The Rogue• Book 2: The Earl's Temptation• Book 3: Scandal's Daughter• Book 4: The Devil May Care• Book 5: Nearly Ruining Mr Russell• Book 5.5: Winter's Wild Melody• Book 6: One Wicked Winter• Book 7: To Tame a Savage Heart• Book 8: Persuading Patience• Book 9: The Last Man in London• Book 10: Flaming June• Book 11: Charity and The Devil• Book 12: A Slight Indiscretion• Book 13: The Corinthian Duke• Book 14: The Blackest of Hearts• Book 15 Duke and Duplicity• Book 16 The Scent of Scandal• Book 16.5 The Christmas Rose• Book 17 Melting Miss Wynter• Book 17.5 The Winter Bride, a Rogues & Gentlemen NovellaHappy reading! And please do leave a review if you can – it would mean the world to hear what you enjoyed most about the book.",
  "genres": [
    "Romance",
    "Historical Romance",
    "Historical",
    "Regency Romance",
    "Historical Fiction",
    "Regency",
    "Fiction"
  ],
  "author": "Emma V. Leech",
  "average_rating": "4.21",
  "url": "https://www.goodreads.com/book/show/34951521-scandal-s-daughter"
}