{
  "title": "On Suicide Bombing",
  "description": "Like many people in America and around the world, Talal Asad experienced the events of September 11, 2001, largely through the media and the emotional response of others. For many non-Muslims, \"the suicide bomber\" quickly became the icon of \"an Islamic culture of death\"—a conceptual leap that struck Asad as problematic. Is there a \"religiously-motivated terrorism?\" If so, how does it differ from other cruelties? What makes its motivation \"religious\"? Where does it stand in relation to other forms of collective violence?Drawing on his extensive scholarship in the study of secular and religious traditions as well as his understanding of social, political, and anthropological theory and research, Asad questions Western assumptions regarding death and killing. He scrutinizes the idea of a \"clash of civilizations,\" the claim that \"Islamic jihadism\" is the essence of modern terror, and the arguments put forward by liberals to justify war in our time. He critically engages with a range of explanations of suicide terrorism, exploring many writers' preoccupation with the motives of perpetrators. In conclusion, Asad examines our emotional response to suicide (including suicide terrorism) and the horror it invokes.On Suicide Bombing is an original and provocative analysis critiquing the work of intellectuals from both the left and the right. Though fighting evil is an old concept, it has found new and disturbing expressions in our contemporary \"war on terror.\" For Asad, it is critical that we remain aware of the forces shaping the discourse surrounding this mode of violence, and by questioning our assumptions about morally good and morally evil ways of killing, he illuminates the fragile contradictions that are a part of our modern subjectivity.",
  "genres": [
    "Nonfiction",
    "Politics",
    "Religion",
    "Islam",
    "Anthropology",
    "Philosophy",
    "Terrorism"
  ],
  "author": "Talal Asad",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/349602.On_Suicide_Bombing"
}