{
  "title": "Expecting Adam: A True Story of Birth, Rebirth, and Everyday Magic",
  "description": "\"He says you'll never be hurt as much by being open as you have been by remaining closed.\"The messenger is a school janitor with a master's in art history who claims to be channeling \"from both sides of the veil.\" \"He\" is Adam, a three-year-old who has never spoken an intelligible word. And the message is intended for Martha Beck, Adam's mother, who doesn't know whether to make a mad dash for the door to escape a raving lunatic (after all, how many conversations like this one can you have before you stop getting dinner party invitations and start pushing a mop yourself?) or accept another in a series of life lessons from an impeccable but mysterious source.From the moment Martha and her husband, John, accidentally conceived their second child, all hell broke loose. They were a couple obsessed with success. After years of matching IQs and test scores with less driven peers, they had two Harvard degrees apiece and were gunning for more. They'd plotted out a future in the most vaunted ivory tower of academe. But the dream had begun to disintegrate. Then, when their unborn son, Adam, was diagnosed with Down syndrome, doctors, advisers, and friends in the Harvard community warned them that if they decided to keep the baby, they would lose all hope of achieving their carefully crafted goals. Fortunately, that's exactly what happened.Expecting Adam is a poignant, challenging, and achingly funny chronicle of the extraordinary nine months of Martha's pregnancy. By the time Adam was born, Martha and John were propelled into a world in which they were forced to redefine everything of value to them, put all their faith in miracles, and trust that they could fly without a net. And it worked.Martha's riveting, beautifully written memoir captures the abject terror and exhilarating freedom of facing impending parentdom, being forced to question one's deepest beliefs, and rewriting life's rules. It is an unforgettable celebration of the everyday magic that connects human souls to each other.",
  "genres": [
    "Memoir",
    "Nonfiction",
    "Book Club",
    "Parenting",
    "Biography",
    "Spirituality",
    "Autobiography"
  ],
  "author": "Martha N. Beck",
  "average_rating": "3.85",
  "url": "https://www.goodreads.com/book/show/349504.Expecting_Adam"
}