{
  "title": "Sugar & Gold",
  "description": "Nikolai Alexei Young was born with a special gift…one he’d do anything to lose. The heart and soul of every person he comes into contact with is an open book to his heightened senses. Colorful emotions, whispers of thoughts, the sour tastes of old memories…He feels them all. The sci-fi books would call him an empath. For Nikolai, his ability has made him an exile. He roams the U.S. alone, avoiding the glut of life in big cities, and using his innate talents to win money in underground poker games. Just enough to keep going, one town to the next. He has no hope that his life can be anything else, until he meets her…  At nineteen, Fiona Starling was trapped in an ugly, desperate situation until she freed herself the only way she knew how. Now three years later, living outside Savannah, Georgia, she is rebuilding her life on her own terms; seizing every moment and saving every penny so that she might fulfill her dream of moving to the raw wilderness of Costa Rica. But behind her carefree smile beats the heart of a lonely young woman haunted by her past, until a chance encounter with a tattooed stranger changes everything…  Fiona takes Nikolai under her roof for three sultry nights, waiting out the rain of a summer storm. She grows more and more fascinated by this brooding stranger with whom she shares an intense physical connection—a connection so strong, she wonders if there is something between them beyond lust and passion. Nikolai is shocked to discover that Fiona calms the raging turmoil in his heart. She alone silences the din of other people’s lives, and envelops him in the sweet beauty of her inner self. Every moment he’s with her—every touch of her skin—brings him closer to the peace that’s been eluding him his entire life.  But Fiona harbors secrets that she is too terrified to reveal. After Nikolai confesses his unique ability, she is caught between wanting to believe him and fearing he’ll eventually unearth her own dark past. When the unthinkable happens, Fiona’s plans come crashing down, and Nikolai discovers his hated ability might be the only thing that can save the woman he loves.  Sugar & Gold is a STANDALONE new adult romance with shades of the paranormal. Intended for readers 18 and up.",
  "genres": [
    "Romance",
    "Paranormal",
    "New Adult",
    "Contemporary",
    "Contemporary Romance",
    "Abuse",
    "Audiobook"
  ],
  "author": "Emma   Scott",
  "average_rating": "4.21",
  "url": "https://www.goodreads.com/book/show/34947450-sugar-gold"
}