{
  "title": "What's Making Our Children Sick?: How Industrial Food Is Causing an Epidemic of Chronic Illness, and What Parents (and Doctors) Can Do About It",
  "description": "Exploring the links between GM foods, glyphosate, and gut health With chronic disorders among American children reaching epidemic levels, hundreds of thousands of parents are desperately seeking solutions to their children’s declining health, often with little medical guidance from the experts. What’s Making Our Children Sick? convincingly explains how agrochemical industrial production and genetic modification of foods is a culprit in this epidemic. Is it the only culprit? No. Most chronic health disorders have multiple causes and require careful disentanglement and complex treatments. But what if toxicants in our foods are a major culprit, one that, if corrected, could lead to tangible results and increased health? Using patient accounts of their clinical experiences and new medical insights about pathogenesis of chronic pediatric disorders―taking us into gut dysfunction and the microbiome, as well as the politics of food science―this book connects the dots to explain our kids’ ailing health. What’s Making Our Children Sick?  explores the frightening links between our efforts to create higher-yield, cost-efficient foods and an explosion of childhood morbidity, but it also offers hope and a path to effecting change. The predicament we now face is simple. Agroindustrial “innovation” in a previous era hoped to prevent the ecosystem disaster of DDT predicted in Rachel Carson’s seminal book in 1962, Silent Spring . However, this industrial agriculture movement has created a worse a toxic environment and, consequently, a toxic food supply. Pesticide use is at an all-time high, despite the fact that biotechnologies aimed to reduce the need for them in the first place. Today these chemicals find their way into our livestock and food crop industries and ultimately onto our plates. Many of these pesticides are the modern day equivalent of DDT. However, scant research exists on the chemical soup of poisons that our children consume on a daily basis. As our food supply environment reels under the pressures of industrialization via agrochemicals, our kids have become the walking evidence of this failed experiment.  What’s Making Our Children Sick? exposes our current predicament and offers insight on the medical responses that are available, both to heal our kids and to reverse the compromised health of our food supply.",
  "genres": [
    "Health",
    "Nonfiction",
    "Agriculture",
    "Parenting"
  ],
  "author": "Michelle Perro",
  "average_rating": "3.70",
  "url": "https://www.goodreads.com/book/show/34956710-what-s-making-our-children-sick"
}