{
  "title": "Angry White Men: American Masculinity at the End of an Era",
  "description": "One of the headlines of the 2012 Presidential campaign was the demise of the white American male voter as a dominant force in the political landscape. On election night four years later, when Donald Trump was announced the winner, it became clear that the white American male voter is alive and well and angry as hell. Sociologist Michael Kimmel, one of the leading writers on men and masculinity in the world today, has spent hundreds of hours in the company of America's angry white men - from white supremacists to men's rights activists to young students. In Angry White Men, he presents a comprehensive diagnosis of their fears, anxieties, and rage. Kimmel locates this increase in anger in the seismic economic, social and political shifts that have so transformed the American landscape. Downward mobility, increased racial and gender equality, and a tenacious clinging to an anachronistic ideology of masculinity has left many men feeling betrayed and bewildered. Raised to expect unparalleled social and economic privilege, white men are suffering today from what Kimmel calls \"aggrieved entitlement\": a sense that those benefits that white men believed were their due have been snatched away from them.Angry White Men discusses, among others, the sons of small town America, scarred by underemployment and wage stagnation. When America's white men feel they've lived their lives the 'right' way - worked hard and stayed out of trouble - and still do not get economic rewards, then they have to blame somebody else. Even more terrifying is the phenomenon of angry young boys. School shootings in the United States are not just the work of \"misguided youth\" or \"troubled teens\" -- they're all committed by boys. These alienated young men are transformed into mass murderers by a sense that using violence against others is their right. The election of Donald Trump proved that angry white men can still change the course of history. Here, Kimmel argues that they should walk openly and honorably alongside those they've spent so long trying to exclude, in order to be happier and healthier.",
  "genres": [
    "Nonfiction",
    "Feminism",
    "Sociology",
    "Politics",
    "Race",
    "Gender",
    "Social Justice"
  ],
  "author": "Michael S. Kimmel",
  "average_rating": "3.78",
  "url": "https://www.goodreads.com/book/show/34953968-angry-white-men"
}