{
  "title": "Unbound",
  "description": "MORE TommyMORE DareMORE DOMINATING!What on Earth is happening with the Ferrano boys?(The Continuation of The Dominator Series, a dark mafia romance with dark themes. 18+ only.)The search for a missing girl…The opening of a Vegas fetish club with an enemy breathing down your neck…Being forced, by the Feds, to help take down a human trafficking crime ring…Tommy:Accomplishing all of the above while fighting your dark and taunting demons and struggling with the notion of becoming a father.Dare:Accomplishing all this finding out you have to take your new wife back to the place you rescued her from. A place where she was systematically broken over a period of 19 days and then sexually enslaved for 2 years.Tessa vanishes! Dare and Tommy have to get Tessa back and make the person responsible pay and they also need to rescue Holly, who is believed to be in the clutches of Alessandro Romero, nephew of the deceased Juan Carlos Castillo, who has multiple reasons to have beefs with the Ferrano boys.Follow Tommy and Tia to Vegas for the opening of Fete, a Vegas fetish club. How will Tia feel about going to Vegas again, a place that nearly broke her.And be a fly on the wall when Dare and Angel go back to Thailand, to the place that broke Angel, WIRED for the Feds.SO much happens in this book.Told from POVS ofTommyTiaDareAngeland others!Dark romance. Books one and two must be read to fully appreciate this story.***If I had to hang onto the reins of the crime empire I’d inherited a bit longer so that I have the firepower and connections to see my way through this shit, I’d do it. I’d get as dirty as I had to. I’d get so dirty it’d make Pop smile and say, “That’s my boy.”This is book three in The Dominator series, previously known as Fete.",
  "genres": [
    "Dark",
    "Romance",
    "BDSM",
    "Dark Romance",
    "Abuse",
    "Contemporary Romance",
    "Erotica"
  ],
  "author": "D.D. Prince",
  "average_rating": "4.40",
  "url": "https://www.goodreads.com/book/show/34971894-unbound"
}