{
  "title": "Thanks Fur Last Night",
  "description": "Enter a world of smoldering shifters in this scintillating anthology headlined by New York Times bestselling authors Eve Langlais and Milly Taiden with brand-new, never published novellas!\n Bearing His SinCole should have killed Anja the moment he realized she was his mate. Instead, he let her live and now they’re on the hunt, chasing the morons who think they can force her to marry another man. Like hell. And while this shapeshifting bear might have his share of sins, he’s not going to let little things like murder and mayhem prevent him from having the woman meant to be the keeper of his heart.Bought by the BearJosilyn Martinez just needed the money to help raise her nephew. That's it. There's no other reason she would take a job posing as a shifter's mate so he can assure his grandmother he's settled down. There's no reason to stay at his place so they learn \"more about each other.\" And there's definitely no good reason she should get involved with the hard, hot, and handsome shifter that's hired her. Xander just needs a fake mate for a week to get his grandmother off his back. But what's a bear shifter to do when the impostor mate he hired turns out to be his actual mate? All sweet, luscious curves and a heart of gold, Xander's not going to let his mate get away. Now all he has to do is show her that they belong together, one kiss and touch at a time...The Alpha and IDevon Kincaid is happy with her new life in Lowman, Idaho. Her little bar on the outskirts of the tiny, isolated town is doing well, and she’s not even interested in finding a man. But when she finds a bleeding man—a hot, hard, handsome, naked bleeding man—in the snow one night, Devon brings him home to care for him. He’s definitely not like any man she’s ever met before, but what she doesn’t realize is that he’s not just a man… Liam Murphy isn't simply a werewolf. He's the Alpha. In a heated battle with a deadly bear shifter, he's moved his pack to the Sawtooth Wilderness in order to draw danger from them. He was hoping to escape his problems—but the last thing he expects to find in the isolated Idaho wilderness was his mate. Fragile and unfamiliar with the violent supernatural world, the only way he can protect Devon is to make her what he is: a werewolf. He only hopes that in the process convincing her to enter fully into his world, that he doesn’t drive away the one woman he can’t live without.",
  "genres": [
    "Romance",
    "Paranormal Romance",
    "Anthologies",
    "Shapeshifters",
    "Paranormal",
    "Urban Fantasy",
    "Humor"
  ],
  "author": "Eve Langlais",
  "average_rating": "3.82",
  "url": "https://www.goodreads.com/book/show/34964956-thanks-fur-last-night"
}