{
  "title": "Riding Solo With the Golden Horde: A Novel",
  "description": "Set in the late 1950s on Florida's Gulf Coast, Riding Solo with the Golden Horde is a picaresque tale of a young saxophonist's quest for jazz virtuosity. Written by a musician, from a \"behind-the-horn\" perspective, it is one of the few novels to cover the jazz scene from a musician's point of view. Hidden behind bop shades and abetted by a schedule of \"crip\" courses, Vic Messenger hopes to slide coolly through his senior year at Boca Chica High on hipster mystique. His biggest concern seems to be that a teacher will catch him studying the latest issue of Down Beat rather than the class text. After school and on weekends, however, Vic is burning with ambition. He is in search of the mysterious element that will transform him from a merely talented player into an artist. Vic might even sell his soul for such a secret; ultimately he discovers that his soul is the secret. And, beneath his facade of cool confidence, Vic is also scared - scared of the freedom the world will soon confer on him and his graduating classmates, scared that he will blow the Juilliard audition he has been promised. Most especially, Vic is panicked by what he has felt during those rare solos when the path is straight and clear between his horn and wherever inside of him the music comes from. He has taken just enough of those rides to understand why musicians throw away their lives trying to capture and sustain the sensation, a euphoria of being at one with the music that can't be matched by any drug. Never quite sure of what he is looking for - or that he wants it once it is found - Vic roams the jazz clubs, a nocturnal cosmos unbalanced by the death of Charlie Parker yet bolstered by the promise of the nascent civil rights movement. A white kid among black adults, he is always ready for a chance to sit in with the best local musicians. Listening, watching, risking an occasional question, Vic wins over two bemused, grudging mentors: Buster Cooper, a philosophically inclined tenor sax player",
  "genres": [],
  "author": "Richard Hill",
  "average_rating": "2.75",
  "url": "https://www.goodreads.com/book/show/3496850-riding-solo-with-the-golden-horde"
}