{
  "title": "Fatal Harvest: The Tragedy Of Industrial Agriculture",
  "description": "Fatal Harvest takes an unprecedented look at our current ecologically destructive agricultural system and offers a compelling vision for an organic and environmentally safer way of producing the food we eat. It includes more than 250 profound and startling photographs and gathers together more than 40 essays by leading ecological thinkers including Wendell Berry, Wes Jackson, David Ehrenfeld, Helena Norberg-Hodge, Vandana Shiva, and Gary Nabhan. Its scope and photo-driven approach provide a unique and invaluable antidote to the efforts by agribusiness to obscure and disconnect us from the truth about industrialized foods. The book's many photographs and essays offer graphic testimony to the tragic consequences of how our food is produced. Readers will come to see that industrial food production is indeed a \"fatal harvest\" - fatal to consumers, as pesticide residues and new disease vectors such as E. coli and \"mad cow disease\" find their way into our food supply; fatal to our landscapes, as chemical runoff from factory farms poison our rivers and groundwater; fatal to genetic diversity, as farmers rely increasingly on high-yield monocultures and genetically engineered crops; and fatal to our farm communities, which are wiped out by huge corporate farms. As it exposes the ecological and social impacts of industrial agriculture's fatal harvest, the book also details a new ecological and humane vision for agriculture. It shows how millions of people are engaged in the new politics of food as they work to develop a better alternative to the current chemically fed and biotechnology-driven system. Designed to aid the movement to reform industrial agriculture, Fatal Harvest will inform and influence the activists, farmers, policymakers, and consumers who are seeking a safer and more sustainable food future.",
  "genres": [
    "Agriculture",
    "Food",
    "Ecology",
    "Nonfiction",
    "Economics",
    "Environment"
  ],
  "author": "Andrew Kimbrell",
  "average_rating": "4.16",
  "url": "https://www.goodreads.com/book/show/349684.Fatal_Harvest"
}