{
  "title": "Six Passengers, Five Parachutes",
  "description": "Six Passengers, Five Parachutes (A Hollywood Thriller—Book 2 of The Quintana Adventures)  It's a race from Los Angeles to San Francisco to Hong Kong to Mexico, culminating on a plane flying over the Pacific Ocean. Army Ranger reconnaissance photographer Stephen Quintana is tracking an international group of investors who create illegal high-end movies of their darkest murder fantasies. They’re the same men who funded the kidnapping and on camera attempted murder of movie star Julia Travers. Luckily for Julia, Stephen made sure he was there to save her before they succeeded.  Now Stephen has uncovered the group's latest underground project: forcing convicted killers to fight to the death for the audience of high-rollers paying big bucks to gamble on the outcome.  But before Stephen can uncover their identities, they shoot him and leave him to die—or so they think. Stephen survives, and now he's even more obsessed with exposing the group. And being “dead” is the perfect cover for digging deeper and infiltrating the show.  The only person who knows everything is Julia Travers. She’ll do anything to keep Stephen safe, even if that means sabotaging his undercover investigation. In the second book of the Quintana Adventures, Stephen suffers deception, betrayal, and brutal attacks but never wavers in his determination to expose the most insane reality show ever created.  Interview with the Author  Q – Why are you writing The Quintana Adventures? A – I write what I love to read – page-turners that I can’t put down. I like thrilling stories with a dynamite premise, great characters, and an action-packed rollercoaster plot that keeps you on the edge of your seat. I also love stories with two protagonists, a man and a woman, who must work together to overcome obstacles. I also love international stories that transport the reader to amazing places around the world. The Quintana Adventures is my way of putting all of that into one series. Steven Quintana is a kick-ass Army Ranger Reconnaissance Photographer. Julia Travers is a beautiful, talented movie star with a razor wit and a quick mind. They couldn’t be more different. I then toss them into wild situations where they encounter crazy characters, and they must work together to survive. It also makes for a rocky relationship.  SIX PASSENGERS, FIVE PARACHUTES is the sequel to THE PICTURE KILLS, but you can read the series in any order.  Q – Why the Hollywood angle? A – Because I know it. My career has been a healthy mix of success and struggle, and I have worked with the famous, the infamous, and the bottom-feeders. My mental filing cabinet is full of experiences that I use to write my stories.  Q – Why the California angle? A – California has everything – the ocean, beaches, mountains, deserts, farmland, small towns and vibrant cities. Families that have been here for generations live alongside immigrants from around the world. I’ve lived in San Francisco, Los Angeles, San Diego, and in the smaller towns of Cazadero and Lemoore. I’ve worked with rice farmers in Butte County, marijuana growers in Mendocino County, and Navy families in Kings County. I want to put all of this into my books.",
  "genres": [],
  "author": "Ian Bull",
  "average_rating": "3.96",
  "url": "https://www.goodreads.com/book/show/34972558-six-passengers-five-parachutes"
}