{
  "title": "Miles, Mutants and Microbes",
  "description": "Two complete novels and a short novel in one large volume: Falling Free—The Nebula Award-winning novel. Leo Graf was just your typical efficient engineer: mind your own business and do the job. But all that changed on his assignment to the Cay Habitat, where children had been bio-engineered to have four arms (and no legs) to function in zero gravity. Now that they're no longer needed, a heartless mega corporation is getting rid of them before they eat into the profit margin. Leo Graf adopted 1000 quaddies—now he had to teach them to be free.  “Labyrinth”—When Miles Vorkosigan is captured while on a secret mission to a lawless world, his only hope of escape is an unlikely pair of allies: a quaddie and a teenage werewolf. Diplomatic Immunity— Miles Vorkosigan and his wife were heading home for the births of their first children, but a major diplomatic disaster is looming at Graf Station, colonized by the descendants of the original quaddies, and duty calls. Unfortunately, diplomatic immunity doesn't carry over to immunity from a very nasty biological weapon. The downside of being a troubleshooter comes when trouble starts shooting back. . . .1.  Lois McMaster Bujold is one of the most popular writers in science fiction and the Vorkosigan saga is one of the best-selling space opera series of all time.2.  Her books for Baen total nearly one and a half million books in print.3.  Four of her novels have made the New York Times extended best seller list.4.  She has won six Hugo Awards and two Nebula Awards.   Only Robert A. Heinlein has won as many Hugo Awards for Best Novel.5.  Features a new introduction by Bujold.6.  Advertising in Locus7.  Four-color flyer for the Vorkosigan series featuring new covers8.  Contains teaser for The Vorkosigan Companion",
  "genres": [
    "Science Fiction",
    "Fiction",
    "Space Opera",
    "Fantasy",
    "Science Fiction Fantasy",
    "Space",
    "Adventure"
  ],
  "author": "Lois McMaster Bujold",
  "average_rating": "4.44",
  "url": "https://www.goodreads.com/book/show/3496694-miles-mutants-and-microbes"
}