{
  "title": "The Oxford Handbook of Women and Competition",
  "description": "While women are generally perceived to be less competitive than men, women compete in many ways and in a variety of situations. Women try to make themselves look more attractive to draw the attention of a desirable mate. They will use gossip as a form of informational warfare to influence reputations. They compete as mothers to gain access to resources that directly influence the health of their children. They use selfies posted on social media to manipulate others' perceptions. Women compete all of their in the womb, through adolescence and adulthood, and into their elder years.The topic of women's competition has gained significant momentum over the years. Edited by Maryanne L. Fisher, The Oxford Handbook of Women and Competition provides readers with direct evidence of this growth and is one of the first scholarly volumes to focus specifically on this topic. Fisher and her team of contributors offer a definitive worldview of the current state of knowledge regarding competition among women today. Many of the chapters are grounded within an evolutionary framework, allowing for authors to investigate the adaptive nature of women's competitive behaviors, motivations, and cognition. Other chapters rely on alternative frameworks, with contributors also asserting that socio-cultural forces are the culprit shaping women's competitive drives. Additionally, several contributors focus their attention on issues faced by adolescent girls, and explore the developmental trajectories for young women through adulthood.Designed to serve as a source of inspiration for future research and direction, The Oxford Handbook of Women and Competition is a stand-out scholarly text focusing on the many competitive forces driving women today.",
  "genres": [],
  "author": "Maryanne L.  Fisher",
  "average_rating": "3.50",
  "url": "https://www.goodreads.com/book/show/34961791-the-oxford-handbook-of-women-and-competition"
}