{
  "title": "The Lord of the Rings",
  "description": "Celebrated Tolkien illustrator Alan Lee, a conceptual designer for the blockbuster films based on \"The Lord of the Rings\", contributes 50 beautiful full-page, full-color paintings to this elegant three-volume edition.One Ring to rule them all, One Ring to find them, One Ring to bring them all and in the darkness bind them. In ancient times the Rings of Power were crafted by the Elven-smiths, and Sauron, The Dark Lord, forged the One Ring, filling it with his own power so that he could rule all others. But the One Ring was taken from him, and though he sought it throughout Middle-earth, it remained lost to him. After many ages it fell, by chance, into the hands of the hobbit, Bilbo Baggins. From his fastness in the Dark Tower of Mordor, Sauron's power spread far and wide. He gathered all the Great Rings to him, but ever he searched far and wide for the One Ring that would complete his dominion. On his eleventy-first birthday Bilbo disappeared, bequeathing to his young cousin Frodo the Ruling Ring and a perilous quest -- to journey across Middle-earth, deep into the shadow of the Dark Lord, and destroy the Ring by casting it into the Cracks of Doom. The Lord of the Rings tells of the great quest undertaken by Frodo and the Fellowship of the Ring: Gandalf the Wizard, Merry, Pippin, and Sam, Gimli the Dwarf, Legolas the Elf, Boromir of Gondor, and a tall, mysterious stranger called Strider. Saga of a group heroes who set forth to save their world from evil. A brotherhood of hobbits, elves, dwarves, and people is formed to combat evil forces. Tolkien drew on his extensive knowledge of folklore and the classics to create the worlds and creatures described in the trilogy, which includes The Fellowship of the Ring, The Two Towers, and The Return of the King.",
  "genres": [
    "Fantasy",
    "Classics",
    "Fiction",
    "Adventure",
    "Science Fiction Fantasy",
    "High Fantasy",
    "Epic Fantasy"
  ],
  "author": "J.R.R. Tolkien",
  "average_rating": "4.54",
  "url": "https://www.goodreads.com/book/show/35.The_Lord_of_the_Rings"
}