{
  "title": "History of a Disappearance: The Story of a Forgotten Polish Town",
  "description": "Winner of Asymptote Journal’s 2016 Close Approximations Translation Contest and Shortlisted for the Nike Literary Prize, the Gdynia Literary Prize, and the Ryszard Kapuściński Prize, History of a Disappearance is the fascinating true story of a small mining town in the southwest of Poland that, after seven centuries of history, disappeared.  Lying at the crucible of Central Europe, the Silesian village of Kupferberg suffered the violence of the Thirty Years War, the Napoleonic Wars, and World War I. After Stalin’s post-World War II redrawing of Poland’s borders, Kupferberg became Miedzianka, a town settled by displaced people from all over Poland and a new center of the Eastern Bloc’s uranium-mining industry. Decades of neglect and environmental degradation led to the town being declared uninhabitable, and the population was evacuated. Today, it exists only in ruins, with barely a hundred people living on the unstable ground above its collapsing mines. In this work of unsparing and insightful reportage, renowned journalist, photographer, and architecture critic Filip Springer rediscovers this small town’s fascinating history. Digging beyond the village’s mythic foundations and the great wars and world leaders that shaped it, Springer catalogs the lost human elements: the long-departed tailor and deceased shopkeeper; the parties, now silenced, that used to fill the streets with shouts and laughter; and the once-beautiful cemetery, with gravestones upended by tractors and human bones scattered by dogs. In Miedzianka, Springer sees a microcosm of European history, and a powerful narrative of how the ghosts of the past continue to haunt us in the present.    “I chose the winning translation of Filip Springer by Sean Gasper Bye because I found the subject matter totally gripping—it’s set in 1944, when the Soviet counteroffensive has reached the Vistula River—and the prose itself is satisfyingly dense, and it has what I look for in any good translation, a very convincing voice.”  —Margaret Jull Costa, Judge’s Citation for Asymptote Journal’s 2016 Close Approximations Translation Contest   “Although he is trained as a journalist and photographer, Filip Springer’s work offers an example of how truth can be even more enthralling than fiction. In his most celebrated piece so far, History of a Disappearance (Polish: Miedzianka. Historia znikania), he delved into the stories of a small town that has been completely wiped off the face of the earth, as though it had never existed. By exploring the deeply personal and moving stories of this town and its former inhabitants, Springer gives readers an illuminating journey through the challenges that Poland has faced as a country as well.”  —Lani Seelinger, Culture Trip  About the Author  Filip Springer (born 1982) is a self-taught journalist who has been working as a reporter and photographer since 2006. His journalistic debut—History of a Disappearance—was shortlisted for the Ryszard Kapuściński Literary Reportage Prize in 2011 and was nominated for the Gdynia Literary Prize in 2012. He was also shortlisted for the Nike Literary Prize in 2012 and winner of the third annual Ryszard Kapuściński fellows contest for young journalists.   About the Translator   Sean Gasper Bye is a translator of Polish, French, and Russian literature.",
  "genres": [
    "Nonfiction",
    "History",
    "Polish Literature",
    "Poland",
    "Reportage",
    "Audiobook",
    "Journalism"
  ],
  "author": "Filip Springer",
  "average_rating": "4.26",
  "url": "https://www.goodreads.com/book/show/34994766-history-of-a-disappearance"
}