{
  "title": "How to Conquer Your Fears and Live an UNSTOPPABLE LIFE of Victory",
  "description": "Fear—it’s one of the most dreaded words in the English language. The mere thought of it can leave you feeling paralyzed or running for the door. For some, fear becomes so commonplace in their lives that they don’t even recognize they are living a life full of invisible barriers. The good news is, it doesn’t always have to be this way.  As author Kristi Patrice Carter says in her newest book, How to Conquer Your Fears and Live an UNSTOPPABLE LIFE of Victory, “You can start living a life of victory by simply choosing to stare your fears in the eye and overcome them, one by one.” This might sound hard, but, with Kristi’s guidance and proven fear-busting process, you’ll work to move past your fears into a life full of happiness, power, and success.  Start Breaking Through Your Fears  Get ready to give your fears their walking papers with Kristi’s step-by-step action plan. You’ll learn what’s holding you back, how fear casts its ugly shadow over your life, and the twelve steps you can use to take back control. • Discover how you can achieve a fear-limited life • Learn to destroy the different types of irrational fears • Increase your focus by identifying your “emotional clutter” • Move past the blame game and stop making excuses • Learn to avoid toxic people and their negative influence on your life  About the Author  Kristi Patrice Carter’s mission is to help people live their best lives—one self-help book at a time. She is driven by her passion for sharing her knowledge and a hope for inspiring and empowering people around the world to achieve their life goals. A force to be reckoned with, Kristi Patrice Carter has a BA in English from the University of Illinois at Chicago, a Juris Doctorate from Chicago-Kent College of Law, and over eighteen years of writing and marketing experience. She’s also a wife, mother, author, and serial entrepreneur. Kristi has been featured in The Complete Woman and Pediatrics for Parents and on CareerBuilder.com. She is the author of numerous books, including:  Wean That Kid!  I’m a Weaned Kid Now  Say Yes to Success Despite Your Chronic Illness: 10 Weeks to Overcoming the Obstacles of Chronic Illness and Finally Achieving What You Want in Life  Say No to Guilt: The 21-Day Plan for Accepting Your Chronic Illness and Finding Inner Peace and Happiness  Passive Income Streams: How to Create and Profit from Passive Income Even If You’re Cash-Strapped and a Little Bit Lazy (But Motivated)!  Active Income Streams: Side Income Opportunities for Achieving Financial Freedom (Working as Much or as Little as You Desire)  Emergency Income Streams: How to Create Fast Cash in 14 Days or Less",
  "genres": [
    "Nonfiction"
  ],
  "author": "Kristi Patrice Carter",
  "average_rating": "4.67",
  "url": "https://www.goodreads.com/book/show/34998973-how-to-conquer-your-fears-and-live-an-unstoppable-life-of-victory"
}