{
  "title": "Wicked Surrender",
  "description": "Wicked Surrender is the 2nd book in USA Today Bestselling Author, Carole Mortimer’s, Amazon #1 Regency Sinners series.  Author’s Note: The stories in the Regency Sinners, Regency Unlaced, Knight Security, and Alpha Series, have stronger sexual content and language than my other books.  Eight gentlemen known far and wide as The Sinners. Also agents for the Crown, they are each tasked with discovering which of eight ladies in Society has been acting as a spy for Napoleon. By fair means or foul.  Dante St Just, the Duke of Huntley, is less than pleased when he is asked to investigate the beautiful widow, Lady Isabella Aston. The two knew each other seven years ago, and parted badly. But neither can Dante bear the thought of passing Bella’s name on to one of his friends. If anyone is to seduce Bella into revealing whether or not she is a spy, then it will be him or no one.  Bella is surprised, and then suspicious, when Dante St Just calls unexpectedly at her home. She becomes alarmed when, that very evening, he carries her off in his carriage.  Alone with Dante, with not even a servant to act as chaperone, how is Bella to resist the helpless attraction she has always felt toward him?  Dante’s intention was to quickly confirm or disprove Bella’s innocence, after which he would either return her to London and the spymaster wishing to speak with her, or he would continue to keep her as his prisoner and the two of them would spend time together becoming reacquainted. Intimately.  But he had not fully taken into account his wild and uncontrollable response to Bella’s sensual beauty, or how it would affect his judgement where she is concerned.  All the books in the super sexy Regency Sinners series are standalone HEA stories. They are connected by the eight heroes search for the lady who is a traitor to England.",
  "genres": [
    "Romance",
    "Historical",
    "Historical Romance",
    "Regency Romance",
    "Regency"
  ],
  "author": "Carole Mortimer",
  "average_rating": "4.07",
  "url": "https://www.goodreads.com/book/show/34995703-wicked-surrender"
}