{
  "title": "The Grrl Genius Guide to Sex (with Other People): A Self-Help Novel",
  "description": "Who better to advise you on sex and relationships than a woman who has consistently failed at both? In this laugh out loud funny \"self-help novel\", self proclaimed genius and author Cathryn Michon provides a how not to guide for anyone tackling the daunting task of finding romance in today's world (or at the local fire station.)Chock full of instructive relationship tips-such as the Pros and \"Cons\" of dating a man in prison- The Grrl Genius Guide to Sex (With Other People) is hilarious and right on the money both as an instructional guide and an endearingly romantic story about a woman and her four best friends who form The Grrl Genius Club. Armed with the information from Cathryn's Wild Sexual Animal Kingdom research and her \"Love is Important but Chocolate is Essential\" Chocolate Fun Facts, her posse of Grrl Geniuses struggle with singlehood, married life, sexual preferences, widowhood, and friendship. Cathryn's journey veers from a \"nails-on-chalkboard-scratchingly-awful\" divorce and the botched kidnapping of her own dog, to pretending to be a lesbian, seeing her old lingerie sold on her old front lawn by her ex-husband's girlfriend, losing her job, and a tragic industrial accident-level bikini wax. And through everything, Cathryn searches for the answer to the most important relationship question of why are all the best men gay?If you've ever been tempted to have sex with another person, this is an essential read. If you've ever felt inadequate to a task or a failure at love or in any way anything less than a genius and you've sunk so low that even a new pair of cute shoes won't help, Cathryn Michon can show you the way to relationship happiness-all you have to do is learn from her very funny mistakes. However badly you think you've done anything, Cathryn has done it even worse, and reveals lessons learned in the wryly witty and devastatingly honest style that has made her the favorite of aspiring geniuses everywhere!",
  "genres": [
    "Self Help",
    "Fiction",
    "Humor"
  ],
  "author": "Cathryn Michon",
  "average_rating": "4.14",
  "url": "https://www.goodreads.com/book/show/349916.The_Grrl_Genius_Guide_to_Sex_with_Other_People_"
}