{
  "title": "Discovering The Healthy Self and Meaningful Resistance to Toxic Narcissism",
  "description": "The last ten years has seen an explosion of interest in the concept of narcissism, both in clinical psychology and popular culture. With questions swirling—about social media and its echo-chamber, the rise of political populism, a focus on me-first philosophies—the subject is as relevant today as it has ever been. Despite this groundswell of awareness, or perhaps because of it, it can be easy to forget: narcissism is not an abstract concept. Many, if not all of us, struggle in our relationships with the Narcissist Personality Disordered (NPD) individual on a daily basis: in our family, our friend-group, our neighborhood, our workplace, or our most intimate relationships. At their most damaging, you will find these relationships erode your own sense-of-self by entangling your identity, self-worth, and personal agency with the narcissist in your life.  Payson’s second book picks up where her first book left off. Where The Wizard of Oz and Other Narcissists provides a step-by-step guide for dealing with the narcissist family member, friend, spouse, or colleague, Discovering the Healthy Self and Meaningful Resistance to Toxic Narcissism further investigates the question: How can we, as individuals, foster, and maintain our own, healthy sense-of-self in these challenging relationships? How do we identify the narcissist/NPD individual in our relationships, take safe steps toward protecting ourselves, and move past the dynamics that keep us stuck and hurting? How do we prevent these painful relationship patterns from recurring?  Drawing from the cumulative wisdom of her thirty-plus years working with NPD and co-dependent individuals, Payson’s new book will help you to:  Clarify the continuum of healthy versus unhealthy self. Understand the dilemmas you face when dealing with the narcissistic/NPD individual. Identify the dynamics of the narcissist abuser and learn interventions for self-protection. Gain awareness and develop healthy boundaries. Outline healing healing and empowerment strategies for ongoing recovery and growth. One part clinical analysis, one part instructional guide, Discovering the Healthy Self and Meaningful Resistance to Toxic Narcissism de-mystifies the origin of the narcissist. Payson’s new book offers poignant insights into the very foundation of selfhood while providing simple and empowering tools for navigating our most difficult relationships.",
  "genres": [
    "Psychology",
    "Nonfiction",
    "Self Help"
  ],
  "author": "Eleanor D. Payson LMSW",
  "average_rating": "4.29",
  "url": "https://www.goodreads.com/book/show/34998836-discovering-the-healthy-self-and-meaningful-resistance-to-toxic-narcissi"
}