{
  "title": "Mothers of Massive Resistance: White Women and the Politics of White Supremacy",
  "description": "Why does white supremacist politics in America remain so powerful? Elizabeth Gillespie McRae argues that the answer lies with white women.Examining racial segregation from 1920s to the 1970s, Mothers of Massive Resistance examines the grassroots workers who upheld the system of racial segregation and Jim Crow. For decades in rural communities, in university towns, and in New South cities, white women performed myriad duties that upheld white over black: censoring textbooks, denying marriage certificates, deciding on the racial identity of their neighbors, celebrating school choice, canvassing communities for votes, and lobbying elected officials. They instilled beliefs in racial hierarchies in their children, built national networks, and experimented with a color-blind political discourse. Without these mundane, everyday acts, white supremacist politics could not have shaped local, regional, and national politics the way it did or lasted as long as it has.With white women at the center of the story, the rise of postwar conservatism looks very different than the male-dominated narratives of the resistance to Civil Rights. Women like Nell Battle Lewis, Florence Sillers Ogden, Mary Dawson Cain, and Cornelia Dabney Tucker publicized their threats to their Jim Crow world through political organizing, private correspondence, and journalism. Their efforts began before World War II and the Brown decision and persisted past the 1964 Civil Rights Act and anti-busing protests. White women's segregationist politics stretched across the nation, overlapping with and shaping the rise of the New Right. Mothers of Massive Resistance reveals the diverse ways white women sustained white supremacist politics and thought well beyond the federal legislation that overturned legal segregation.",
  "genres": [
    "History",
    "Nonfiction",
    "Race",
    "Politics",
    "Feminism",
    "Social Justice",
    "Gender"
  ],
  "author": "Elizabeth Gillespie McRae",
  "average_rating": "4.08",
  "url": "https://www.goodreads.com/book/show/35013165-mothers-of-massive-resistance"
}