{
  "title": "Pontifex Maximus: A Short History of the Popes",
  "description": "\"Fascinating, brilliant and gripping\" or \"Biased, unbalanced and dull\". You decide! BOOK DESCRIPTION For many people, the popes are an if they consider them at all, it may be as harmless old men who preach obscure sermons in Latin. But the history of the popes is far from bland. On the contrary, it is occasionally so bizarre as to stretch credulity. Popes have led papal armies, fled in disguise, fathered children (including future popes), and authorised torture. They have been captured, assaulted and murdered. While many have been admired, some have been hated to such a degree that their funeral processions have been disrupted and statues of them torn down after their deaths. Many have been the enemies of freedom and progress – divisive rather than unifying figures. In a fascinating read for Catholics and non-Catholics alike, Christopher Lascelles examines the history of the popes through the ages, laying bare the extent to which many of them fell so very short of the Christian ideals they supposedly represented. He explains how it was that, professing to follow a man who said ‘My kingdom is not of this world’ and 'Lay not up for yourselves treasures upon earth’, they nevertheless became heads of a rich state that owned more land in Europe than any king, relying on foreign military aid to keep power; and how pride, greed and corruption became commonplace in an institution founded on love, faith and forgiveness. This book is aimed at the general reader who is short on time and seeks an accessible overview unencumbered by ecclesiastical jargon and scholarly controversies. REVIEWS “Lascelles has achieved the seemingly a concise and highly readable history of Catholic Popes that manages to be extremely entertaining and informative at the same time.”  – Gerald Posner, author of \"God’s Bankers\" \"A brilliant book on a number of different levels. Lascelles has an engaging prose style and an amazing eye for detail and apposite anecdote. Surely only purblind Catholic zelanti will object to this outstanding analysis.” – Frank McLynn, author of \"Genghis Khan\", \"Napoleon\" and \"1066\" “Lascelles has taken an overwhelming subject, and not been overwhelmed by it in any way. A highly enjoyable read.” – Paul Strathern, author of \"The Medici\" “Pontifex Maximus is a subtle and convincing explanation of how the successors of an impoverished fisherman from Galilee became a globally powerful monarch - all without getting lost in the bewildering historical weeds. Lascelles writes with both verve and humor; once started it’s hard to put down.” – Lars Brownworth, author of \"The Normans\" and \"The Sea Wolves\" \"An invaluable, gripping compendium, narrating Papal history from the Catholic Church’s humble beginnings almost 2000 years ago to today’s international paedophilia scandals that have shaken true believers to their very souls.\" – Mark Aarons, author of \"The Secret War Against the Jews\" \"An honest history of the papacy such as Pontifex Maximus can only serve to help the Catholic church be more honest and consequently more true to its calling.\" – Fr. Thomas P. Doyle, priest, canon lawyer, author and columnist for National Catholic Reporter \"Pontifex Maximus is a substantive but snappy read through the sweep and swamp of papal history. Once I started I could hardly put it down. Reading it will be time well spent.",
  "genres": [
    "History",
    "Religion",
    "Christianity",
    "Nonfiction",
    "Catholic",
    "Historical"
  ],
  "author": "Christopher Lascelles",
  "average_rating": "3.91",
  "url": "https://www.goodreads.com/book/show/35002832-pontifex-maximus"
}