{
  "title": "Patton's Way: A Radical Theory of War",
  "description": "Patton's Way is a unique approach to the legend of General George S. Patton, Jr. and his development and application of a unique approach to modern warfare.Unlike Carlo D'Este's Genius for War or Stanley Hirshson's General A Soldier's Life, Patton's Way is not a biography. Instead, it argues that popular representations of Patton are built on misconceptions and incomplete understandings about his approach to warfare.Morningstar begins with the mystifying contradiction between the historiographical criticism of Patton's methods and popular appreciation for his successes. He identifies several schools of thought offering explanations ranging from Patton's bull headed leadership to his gambling cavalry style. Yet, the author notes, they all fail to fully comprehend the real Patton.It is the contention of this book that the secret to Patton's success was a truly radical and purposely-crafted doctrine he developed over several decades of careful thought and practice. Morningstar identifies four core principals in Patton's targeting the enemy's morale through shock; utilizing highly practiced combined arms mechanized columns; relying on mission tactics and flexible command and control; and employing multi-layered and synthesized intelligence systems to identify enemy capabilities and weak spots. These principals directly contradicted official U.S. Army doctrine in that they rejected the focus on tactical battle, the primacy of infantry, top-down command and control and detailed orders processes, and intelligence limited to supporting preconceived plans. Because Patton's methods did not conform to doctrine, they were not well understood by his peers, resulting in misconceptions both then and now -- misconceptions that led higher command to truncate Patton's operations in Tunisia, Sicily, and France.The author uses separate chapters to detail how Patton developed and applied each principal, before using the breakout from Normandy as a case study to illustrate Patton's Way in application. The comparison of Patton's success to the many instances of stagnation in the European Theater without Patton is startling but the author also recognizes other campaigns and how they related to Patton's concepts.In the Chapter 6 the author illustrates the 'death and resurrection' of Patton's ideas in the US Army. Following World War II both Patton's teachings and adherents were systematically removed from the Army operations. Political constraints led to a resurgence of attrition based doctrine and heavy firepower tactics in Korea and Vietnam. Only at the Armor School at Fort Knox, Kentucky, did Patton's ideas take root only to blossom in the form of AirLand Battle doctrine towards the end of the century after a long and interesting route. The author ends by briefly describing the status of Patton' ideas in the Army today.",
  "genres": [
    "World War II",
    "Biography",
    "Military Fiction"
  ],
  "author": "James Kelly Morningstar",
  "average_rating": "4.72",
  "url": "https://www.goodreads.com/book/show/35015445-patton-s-way"
}