{
  "title": "Bloodline",
  "description": "Fleeing from the witch trials in Salem, Terra Rowan finds herself in modern day Asheville, North Carolina. A dark spirit from the past hunts the last witch of Salem. With the help of the ladies of the Biltmore Society, Asheville aristocrats with untapped powers and a crooked-legged fat orange cat named Pixel, Terra must discover the secret within the forest to preserve the bloodline. Combining elements from different cultures, Appalachian folklore, Celtic legends, Native American mysticism, Bloodline creates a new witch mythology while staying true to the realm of cozy mystery. Terra Rowan is a witch trapped between worlds and lost in time. \"Best Cozy Mystery I have read this year\". Karen Owen Mystery BloggerAuthor \"Vicki Vass takes me back to the first mysteries I ever read…Nancy Drew.\" By Lisa Ks Book Reviews \"There were so many twists and turns that I was not able to figure out who did it until the end of the book. I like that because it makes me want to read faster to see what happens next\" Griperang's Bookmarks A cross genre mix of historical fiction and paranormal mystery, Bloodline by Vicki Vass is the first book in her A Witch Cat Mystery series. Set in two different locations; Salem, Massachusetts during the witch trials of the early 1690; s and contemporary Ashville, North Carolina, Ms. Vass uses the local folklore of both locations to build her story. Well-developed characters, two interesting mysteries and a solid pace kept me turning the pages from start to finish. While there are two separate mysteries, only one will be resolved by the end of the story. The secondary mystery will undoubtedly be something that is carried as an ongoing thread throughout the series. Ms. Vass does a good job dropping clues for the reader to gather and the story takes plenty of twists and turns. The story’s pace is fairly quick and Ms. Vass’s voice as an author is well established and easy to read. Queen of All She Reads",
  "genres": [
    "Mystery",
    "Paranormal",
    "Magic",
    "Fantasy",
    "Witches",
    "Cozy Mystery",
    "Cozy"
  ],
  "author": "Vicki Vass",
  "average_rating": "4.35",
  "url": "https://www.goodreads.com/book/show/35018318-bloodline"
}