{
  "title": "Out of Bounds",
  "description": "I thought he was joking when he asked me out. It was only after I laughed in his face that I realized he was serious.But what was I supposed to do? It was my first day of high school, and I was already on the verge of a breakdown. The last thing I was prepared for was attention from boys like him… Popular boys with wide smiles and sparkly eyes and hair worthy of its own magazine spread. I’d always been invisible to guys like that. But the moment was fleeting, and as soon as I laughed at him, I went back to being invisible... as did the debilitating crush I had on him.Looking back, though, that split second probably altered the course of my whole life. The inappropriate, relentless feelings I had for him gave me insight into the angst and unrequited love that featured time and time again in the books I loved most, books that always seemed to be about people who were forced to hide their deepest desires. I loved stories and words before that moment, but when Luke Hudson looked at me like I was the only girl in the room, everything changed. It made me feel like my life was a story, a story worth telling. Of course, like all the most interesting fantasies, mine had to be kept secret, so I distracted myself by studying and sharing the stories of others. But I never stopped wondering what would happen if I turned the page on my own.I didn’t dare, though, because I knew there were only two ways in which the most wonderful love stories could end: ecstatic happiness or pitiless tragedy.And I wasn’t sure I could handle either of them. So I kept my curious feelings to myself and did my best to keep Luke in the dark. But like all athletes, his persistence was hard to compete with, and it seemed no matter where I tried to hide, he’d always come find me…and turn the light on.  **Authors note: This standalone romantic comedy contains no cliffhanger, no cheating, and an ending that will leave you smiling so hard it hurts.",
  "genres": [
    "Romance",
    "Sports",
    "Sports Romance",
    "College",
    "Second Chance",
    "Contemporary",
    "Fiction"
  ],
  "author": "Hazel Kelly",
  "average_rating": "4.09",
  "url": "https://www.goodreads.com/book/show/35018483-out-of-bounds"
}