{
  "title": "Earthseed: Parable of the Sower and Parable of the Talents",
  "description": "Alternate Cover Edition can be found here. A multiple Hugo and Nebula Award winner’s powerful saga of survival and destiny in a near-future dystopian America.One of the world’s most respected authors of science fiction imagines an apocalyptic near-future Earth where a remarkable young woman discovers that her destiny calls her to try and change the world around her. Octavia E. Butler’s brilliant two-volume Earthseed saga offers a startling vision of an all-too-possible tomorrow, in which walls offer no protection from a civilization gone mad. Parable of the Sower: In the aftermath of worldwide ecological and economic apocalypse, minister’s daughter Lauren Oya Olamina escapes the slaughter that claims the lives of her family and nearly every other member of their gated California community. Heading north with two young companions through an American wasteland, the courageous young woman faces dangers at every turn while spreading the word of a remarkable new religion that embraces survival and change. Parable of the Talents: Called to the new, hard truth of Earthseed, the small community of the dispossessed that now surrounds Lauren Olamina looks to her—their leader—for guidance. But when the evil that has grown out of the ashes of human society destroys all she has built, the prophet is forced to choose between preserving her faith or her family. The Earthseed novels cement Butler’s reputation as “one of the finest voices in fiction—period” (TheWashington Post Book World). Stunningly prescient and breathtakingly relevant to our times, this dark vision of a future America is a masterwork of powerful speculation that ushers us into a broken, dangerously divided world of bigotry, social inequality, mob violence, and ultimately hope.",
  "genres": [
    "Fiction",
    "Science Fiction",
    "Dystopia",
    "Fantasy",
    "Post Apocalyptic",
    "Speculative Fiction",
    "Young Adult"
  ],
  "author": "Octavia E. Butler",
  "average_rating": "4.53",
  "url": "https://www.goodreads.com/book/show/35007517-earthseed"
}