{
  "title": "Taming a Maverick",
  "description": "SALEM Just some fun. Just one night of reckless, harmless, wild fun. That's what I told myself the night I hooked up with quite possibly the sexiest guy I've ever known. Only, I didn't want to KNOW him. Life is a series of temporary situations, or so it's always been for me. A future revolves around the next move, but I'm still the type to live in the moment on a seldom occasion, consequences be damned. Unless that moment happens to be unknowingly landing in bed with my brand new stepbrother. The universe is a mean, twisted jerk. And one consequence is that I have to be around him and get to know him. The worst consequence is the fact that Maverick Sterling, the infamous playboy who can't possibly be tamed, is really hard not to want more of once you've had a taste. So long as I'm not stupid enough to fall in love, it shouldn't be a big deal. Right? MAVERICK My life has been blissfully simple for a really long time. I have a routine. I have friends. I have family. Yet everyone seems to have less and less time, since they're all sort of trying to be adults or what the hell ever. I blame them for the fact the only girl to ever ditch me without a backward glance is suddenly under my skin. I blame my father for the fact she's a new fixture in my life. Not that I knew that before I got a little overly friendly with my new stepsister. I mean, what are the odds? It shouldn't have been possible. But it happened. It figures the one girl I can't get out of my head is the one girl who doesn't want to be with me. At least in my head she's the only girl who doesn't want to be with me, because I tend to be arrogant like that. The point is, now she's everywhere I turn, yet she's marking a line in the sand that she thinks I really won't cross. Obviously she doesn't know me at all. *Can be read as a stand-alone *Sexual Content *Adult Language",
  "genres": [
    "Romance",
    "Contemporary",
    "Contemporary Romance",
    "Humor",
    "Friends To Lovers",
    "New Adult",
    "Fiction"
  ],
  "author": "C.M. Owens",
  "average_rating": "4.54",
  "url": "https://www.goodreads.com/book/show/35012945-taming-a-maverick"
}