{
  "title": "TFS Fugitive",
  "description": "Having successfully repelled the Resistance incursion into the Sol system, Terran Fleet Command must now deal with the far-flung worlds of the Sajeth Collective, which sponsored the attack. Task forces are dispatched to Damara and Lesheera to begin the first Human blockades of entire planets. With the only ships fast enough to quickly bring the fight to the enemy’s doorstep, TFC must do so alone, leaving only minimal forces behind to safeguard the Earth.  At home, Humanity finally makes its decision regarding membership in the Pelaran Alliance. At the same time, the Guardian makes a decision of its own, calling the entire purpose behind its five-hundred-year mission into question.  On the far side of Sajeth Collective space, the newly formed Crowned Republic of Graca experiments with technology so revolutionary that it attracts the attention of a powerful new enemy. Responding to a call for help from Prince Rugali Naftur himself, the Leadership Council must decide if rescuing a few Wek scientists is worth the risk of yet another war, this time involving direct conflict with the Pelaran Alliance itself.  Piloting a single, largely untested ship, Captain Tom Prescott and crew are once again called upon for a special mission — a trip into the heart of an empire to complete an assignment that only the Guardian itself could have envisioned.  Author's Note: The books in this series build on one another and are not intended to be read as \"stand-alone\" stories. Please read TFS Ingenuity, TFS Theseus, and TFS Navajo before starting TFS Fugitive. _________  Have questions about the series? For example: How long will the “saga” be? Why is the story divided into multiple books? How do I find out about the next release? Please visit my FAQ at: AuthorToriHarris.com/FAQ/ _________  TFS FUGITIVE is the fourth book of the Terran Fleet Command Saga by author Tori Harris. The story is typically associated with the military science fiction, space exploration science fiction, colonization, first contact, genetic engineering, space opera technothriller, galactic empire, or alien invasion categories.",
  "genres": [
    "Science Fiction",
    "Space Opera",
    "Military Fiction",
    "Audiobook",
    "Aliens",
    "Space"
  ],
  "author": "Tori L. Harris",
  "average_rating": "4.45",
  "url": "https://www.goodreads.com/book/show/35038908-tfs-fugitive"
}