{
  "title": "Checkmate",
  "description": "\"Every leap of faith is a judgment call.\" Kelly’s leap took her far from the home she loved and hated. Freed from the tentacles of her dead mother’s life-destroying choices, she bravely takes on New York City. Unfortunately, it didn’t take long for the walls to close in and test her in ways she never dreamed.  Matty, on the other hand, burst from his introverted shell like a torpedo and reveled in everything the city offered an endlessly curious, four-year-old boy. He took the idea of a surprise big brother in his stride too and was over the moon with joy about the family being created right before his eyes.  Their leap of faith also impacted Liam Ashforth and his fiancée, Rhiann Baron-Wilde. In one fell swoop the starchy, uptight businessman had a grown up sister who wasn’t at all impressed with his nonsense and a little brother who thought he walked on air. And poor Rhiann—she was left in the middle juggling Liam’s reaction, Kelly’s confusion, Matty’s exuberance and Roman’s surprising behavior.  But what about Roman?  Driving at full speed off a cliff and free falling into a life-changing love wasn’t what he had in mind when Kelly Anne James tumbled into his path. But that’s what happened. And if that wasn’t enough, a critical situation from his complicated past that sat quietly simmering on a back burner was starting to boil. Soon, he’d have to bring his old life into the present and introduce the two.  Into this mix steps the enigmatic Domineau Rivera. Described by Kelly as an Amazonian warrior wearing a shoulder holster, she brings a new and surprising perspective on Roman’s past.  Team Justice has a female member? Who knew? If you thought how this story began was interesting—just wait until you see where it’s going!",
  "genres": [
    "Military Romance",
    "Romance",
    "Contemporary Romance",
    "Chick Lit"
  ],
  "author": "Suzanne Halliday",
  "average_rating": "4.60",
  "url": "https://www.goodreads.com/book/show/35023350-checkmate"
}