{
  "title": "Justice in America How it Works - How it Fails",
  "description": "The world envies, and in some cases despises, the American system of justice. In this frank and compelling book, attorney and journalist Russell Moran leads the reader on an exciting tour of the system that delivers our rights, and he doesn’t pull any punches. Whether you’re a lawyer, a judge, or a layman, Moran takes you on a journey through the system in a candid, colorful, and occasionally humorous examination of the country’s most critical institution.From the schoolyard to the prison yard, Justice in America brims with recent cases, historical antecedents, and engaging anecdotes that make our complex system crystal clear. This indispensable resource has been designed to guide the inquisitive layman, as well as the seasoned attorney or judge, through today’s legal process, from the role of judges to the wild world of torts. It’s a must-read for anyone considering whether or not to sue, settle, claim, or retain.Moran launches the book by questioning our opinions about exactly what is justice. He challenges our assumptions, and leads us into the thicket of moral philosophy. He delves into the role of judges: how we select, train and pay them, as well as how judges make decisions. He also evaluates the Supreme Court and some of its historic decisions, particularly cases involving the Commerce Clause and its current bizarre interpretations, as well as decisions on eminent domain and private contracts, and how these resonate in the courtrooms of today, and impact business and personal decisions in this country.From there, Moran faces down the wild world of torts—civil wrongs—which comprise the largest part of our court system’s dockets. He hones his sharp legal eye on the implications of those all-important courtroom battlegrounds that affect us all. He looks at general personal injury cases, wrongful death, workers’ compensation, medical malpractice, and product liability. He also examines the problem of excessive jury verdicts, and how the system handles them. Peppered with real-life examples, this invaluable take on tort litigation offers insights for anyone confronting the courtroom.Moran then lifts the veil on the jury room, this crucial phase of the process that can make or break a case. He parses the key elements of case, including a sympathetic plaintiff, key witness credibility, location of the accidents, and how the injury occurred.Moran then concludes by posing the question of whether justice truly exists in this country. He illuminates the “wonderful mess” that is American democracy, calling into question the functionality of the Constitution, and leaves readers to determine for themselves, if justice is served in this nation. Delivered like a seasoned attorney, Justice in America – How it Works – How it Fails, offers readers the facts, evidence, and arguments they need, both to navigate—and to pronounce judgment on—American justice.",
  "genres": [],
  "author": "Russell F. Moran",
  "average_rating": "3.40",
  "url": "https://www.goodreads.com/book/show/12101472-justice-in-america-how-it-works---how-it-fails"
}