{
  "title": "Infinity Born",
  "description": "A breathtaking near-future thriller. From the NY Times bestselling author whose books have been downloaded over a million times.When DARPA's billion-dollar program to create Artificial Superintelligence is sabotaged, US operative Cameron Carr is tasked with finding the culprit. He's been on high-stakes missions before, but this time the stakes are nothing less than the future of humanity. Because the race to evolve a superintelligent computer is on, and power players around the world will stop at nothing to get there first.In the right hands, Artificial Superintelligence could lift humanity to towering heights. But in the wrong hands, this technology could represent the greatest threat humanity has ever seen . . .Ripped from tomorrow's headlines, Infinity Born is a roller-coaster ride of a thriller that explores the deadly perils and mind-blowing possibilities that await the human race--including both extinction and immortality.As our phones and computers become ever smarter, Infinity Born takes an unblinking look at a technological tipping point that is just around the corner. One that will have a profound impact on the future course of human history.\"Richards is a worthy successor to Michael Crichton.\" (SF Book.com)\"Richards is a tremendous new talent\" (Stephen Coonts) who can \"keep you turning the pages all night long.\" (Douglas Preston)Near Future Science Fiction Thrillers by Douglas E. RichardsWIRED (Wired 1)AMPED (Wired 2)MIND'S EYE (Nick Hall 1)BRAINWEB (Nick Hall 2)MIND WAR (Nick Hall 3) -- New in 2016QUANTUM LENSSPLIT SECONDGAME CHANGER -- New in 2016INFINITY BORN--New in 2017Kids Science Fiction Thrillers (9 and up, enjoyed by kids and adults alike)TRAPPED (Prometheus Project 1)CAPTURED (Prometheus Project 2)STRANDED (Prometheus Project 3)THE DEVIL'S SWORDOUT OF THIS WORLD",
  "genres": [
    "Science Fiction",
    "Fiction",
    "Thriller",
    "Audiobook",
    "Mystery",
    "Amazon",
    "Mystery Thriller"
  ],
  "author": "Douglas E. Richards",
  "average_rating": "4.21",
  "url": "https://www.goodreads.com/book/show/35038829-infinity-born"
}