{
  "title": "Sahara: A Natural History",
  "description": "In the parched and seemingly lifeless heart of the Sahara desert, earthworms find enough moisture to survive. Four major mountain ranges interrupt the flow of dunes and gravel plains, and at certain times waterfalls cascade from their peaks. Even the sand massive dunes can appear almost overnight, and be gone just as quickly. We think we know the Sahara, the largest and most austere desert on Earth―yet it is full of surprises, as Marq de Villiers reveals in his brilliant and evocative biography of the land and its people. \"If you traveled across the United States from Boston to San Diego, you still wouldn't have crossed the Sahara,\" writes de Villiers, painting a vivid picture of this most extraordinary place. He charts the course of Atlantic hurricanes, many of which are born in the Tibesti Mountains of northern Chad, and offers a fascinating disquisition on the physics of windblown sand and the formation of dunes. He chronicles the formation of the massive aquifers that lie beneath the desert, some filled with water that pre-dates the appearance of modern man on Earth. He marvels at the jagged mountains and at ancient cave paintings deep in the desert, which reveal that the Sahara was a verdant grassland 10,000 years ago―a cycle that has been repeated several times. Woven through de Villiers's story is a chronicle of the desert's nations and the Berbers and Arabs of the north; its black African south, whose ancestors peopled the greatest empires of Old Africa; and the extraordinary nomads―the Moors, the Tuareg (the famous \"blue men\"), and the Tubu―who call the desert home today. Illuminated by the eloquent written testimonies of past travelers, Sahara is a glittering geographic tour conveying the majesty, mystery, and abundance of life in what the outside world thinks of as the Great Emptiness.",
  "genres": [
    "Africa",
    "Nonfiction",
    "History",
    "Nature",
    "Science",
    "Geography",
    "Natural History"
  ],
  "author": "Marq de Villiers",
  "average_rating": "3.79",
  "url": "https://www.goodreads.com/book/show/35059.Sahara"
}