{
  "title": "Give a Boy a Gun: A True Story of Law and Disorder in the American West",
  "description": "The war between society and the antisocial personality has long been a subject of fascination, and few have explored it as thoroughly as award-winning author Jack Olsen. In his national best seller A Psychopath and His Victims, Olsen studied a psychopathic rapist who found the perfect protective coloration in jogging shoes and sweats.In this book, the story of Claude Lafayette Dallas, Jr., Olsen takes on perhaps his most challenging assignment -- explicating the curious relationship between a homicidal young \"mountain man\" and those who saw in his colorful ways the embodiment of the cowboy mystique of the West.On a snow-blown day, Dallas killed two game wardens who entered his trapping and poaching camp in ldaho's Owyhee Desert. The cold-bloodedness of Dallas's crime shocked the West. Stained with his victim's blood. he confessed to a companion, \"This is Murder One for me.\"Then Claude Dallas vanished into the wild and rugged mountains that had sheltered him for so long. For fifteen long months he was the subject of an international manhunt until the FBI and a drawling country sheriff joined forces to run him to earth in a rain of bullets. Only then did lawmen learn about the network of friends who had helped him elude capture. To some of Dallas's rustic neighbors the deadly progression from cowboy to poacher to killer seemed justifiable, even admirable.Clanking around the bars and barrancas of the high desert country in his hand-filed spurs and well-oiled guns, Claude Dallas had brought a strange new madness to the mythology of the West, a madness that even a jury of his peers found nostalgically seductive in a sensational trial. Claude Dallas came within a whisker of going free. Only Jack Olsen, through painstaking research into Dallas's background and exhaustive on-the-scene interviewing, could unravel such a rat's nest of contradictions and confusions and create so compelling a portrait of the killer whose bloody deeds might have been foreordained from childhood.From Publishers WeeklyClaude Dallas Jr. was raised in Upper Michigan and Ohio by a father whose philosophy was \"give a boy a gun and you're makin' a man.\" After high school, the young man went to the rugged border area of Idaho, Oregon and Nevada and worked as a cow-puncher and handyman on several ranches. But his dream was evidently to become a 19th centurystyle mountain man and so he turned to poaching, often killing animals even though he had no need for the meat. In 1981, he killed two game wardens in front of a witness. On the run for 15 months, he was eventually captured in a shootout and found guilty of manslaughter in a singularly bizarre trial.From Library Journal``Give a boy a gun and you're makin' a man,'' Claude Dallas, Sr., is quoted as saying in this book about his son, Claude Jr., a self-made cowboy, trapper, and ``mountain man'' who was convicted of manslaughter in the shooting deaths of two Idaho game wardens. Claude Jr. was well-liked by many, including a sympathetic jury which rejected possible first or second degree murder verdicts. Was it a case of self-defense or outright murder? Olsen, who last wrote the popular `` Son'': a psychopath and his victims ( LJ 11/15/83), skillfully presents his viewpoint in a readable tale more reminiscent of Old West traditions than of the 1980s. Recommended.",
  "genres": [
    "True Crime",
    "Nonfiction",
    "Crime",
    "Westerns",
    "Outdoors",
    "American",
    "Biography"
  ],
  "author": "Jack Olsen",
  "average_rating": "4.05",
  "url": "https://www.goodreads.com/book/show/350508.Give_a_Boy_a_Gun"
}