{
  "title": "Nadya's War",
  "description": "The Wehrmacht marches on Stalingrad.The deadly Luftwaffe dominates the skies.Nadya \"Little Boar\" Buzina, a young pilot with the Red Army's 586th all-female fighter regiment, has just been thrust into the meat grinder. If she’s to protect her homeland and survive the chaos, she’s going to have to learn to trust her wingman explicitly.German aces, however, aren’t the only ones threatening Nadya’s life. She’s crossed a vengeful political commissar who has launched an investigation into her past. Should he uncover her secret, Nadya will be lucky if she’s executed on the spot.\"Well researched, Nadya's War is a fascinating tale of female combat pilots in World War II that will have you on the edge of your seat.\" - Mark Sullivan, #1 New York Times bestselling author of Beneath a Scarlet Sky.\"With a genuine flair for crafting a complex and believable yesteryear of desperate war time conditions, a world populated by a roster of truly memorable characters, a time of lethal intrigue, a time in urgent need of heroes, C. S. Taylor's novel \"Nadya's War\" is a riveting read from cover to cover and will prove to be an enduringly popular and appreciated addition to community library General Fiction collections.\" -- Midwest Book Review“The characters are well drawn, and their arcs move in unexpected directions…A compelling, female-centric combat tale involving Russians and Nazis.” – Kirkus Reviews\"Nadya's War is a really fantastic novel for those who love character-centric novels and have an interest in not-often-told stories of WWII.\" -- Hypable\"Nadya's War tells the riveting story of a young woman's journey as an ace fighter pilot in World War II, illuminating a long neglected chapter of history. Taylor provides a rich, engrossing narrative.\" - Best Selling Author Gregory A. Freeman, THE FORGOTTEN 500\"A dangerous aerial ballet of love, hate, pain and discovery, Nadya's War takes the reader into skies that few have visited. This is a fresh book with twists and surprises throughout.\" - Best Selling Author LtCol (Ret) Jay A. Stout, HELL'S ANGELS\"Nadya's War is a thrilling, moving fictional account of the Red Army's 586th all-female fighter regiment. Taylor has obviously done his homework so this book will certainly appeal to enthusiasts of World War II's aerial combat or anyone who loves well-written historical fiction.\" - Best Selling Author Kathryn Atwood, WOMEN HEROES OF WORLD WAR II: THE PACIFIC THEATER",
  "genres": [
    "Historical Fiction",
    "Fiction"
  ],
  "author": "C.S.  Taylor",
  "average_rating": "3.71",
  "url": "https://www.goodreads.com/book/show/35059947-nadya-s-war"
}