{
  "title": "The Cold War's Killing Fields: Rethinking the Long Peace",
  "description": "A brilliant young historian offers a vital, comprehensive international military history of the Cold War in which he views the decade-long superpower struggles as one of the three great conflicts of the twentieth century alongside the two World Wars, and reveals how bloody the \"Long Peace\" actually was.In this sweeping, deeply researched book, Paul Thomas Chamberlin boldly argues that the Cold War, long viewed as a mostly peaceful, if tense, diplomatic standoff between democracy and communism, was actually a part of a vast, deadly conflict that killed millions on battlegrounds across the postcolonial world. For half a century, as an uneasy peace hung over Europe, ferocious proxy wars raged in the Cold War’s killing fields, resulting in more than fourteen million dead—victims who remain largely forgotten and all but lost to history.A superb work of scholarship illustrated with four maps, The Cold War’s Killing Fields is the first global military history of this superpower conflict and the first full accounting of its devastating impact. More than previous armed conflicts, the wars of the post-1945 era ravaged civilians across vast stretches of territory, from Korea and Vietnam to Bangladesh and Afghanistan to Iraq and Lebanon. Chamberlin provides an understanding of this sweeping history from the ground up and offers a moving portrait of human suffering, capturing the voices of those who experienced the brutal warfare.Chamberlin reframes this era in global history and explores in detail the numerous battles fought to prevent nuclear war, bolster the strategic hegemony of the U.S. and the U.S.S.R., and determine the fate of societies throughout the Third World.",
  "genres": [
    "History",
    "Politics",
    "Nonfiction",
    "War",
    "Audiobook",
    "World History",
    "American History"
  ],
  "author": "Paul Thomas Chamberlin",
  "average_rating": "4.17",
  "url": "https://www.goodreads.com/book/show/35068475-the-cold-war-s-killing-fields"
}