{
  "title": "Prince Orlofsky, Vampire Hunter",
  "description": "“That is madness.” “Not so, my friend. If I were poor, I would be considered mad. But since I am rich, I am merely…eccentric. So, how about it? A life of adventure? Money, champagne, vampires? It is tempting, no?”  Born the heir to the Russian throne, Alexander Romanov has been removed from the line of succession by his uncle. The reason? Alexander is half vampire, and unfit to be Tsar. Over time, Alexander begins to believe it. He is given the new title of Prince Orlofsky, and his true identity kept secret: precautions to hide him from his vampire father. But when he visits Paris, he discovers an underground domain beneath the streets: a domain of vampires called the Scarlet Brotherhood, ruled by his father. And if his father has his way, Alexander will ascend that throne and become the vampire prince, whether he likes it or not.  But Prince Alexander Orlofsky has plans of his own: plans to take down his father and become the best vampire hunter in Paris. He is aided by his young gardener Ivan, the pianist Franz Liszt, and the novelist George Sand. And above ground in Paris's glittering salons, he must hide his new trade from his courtesan, Violetta, the beautiful Lady of the Camellias.  Armed with a sharp stake in one hand and a glass of champagne in the other, young Prince Orlofsky navigates his adventures with ingenuity and a magnificent but biting sense of humor. Through it all he retains his impeccable taste for fine clothes, alcohol, and interior decorating. He is charming, sarcastic, very Russian, effeminate, flirts with both women and men, and beneath his dashing smile lies a pair of formidable sharp teeth.  The opera stage has known Prince Orlofsky with his thick Russian accent, boyish appearance, and eccentric behavior for more than a hundred years. An iconic comic character from Johann Strauss II's opera \"Die Fledermaus,\" he claims to be burnt out at eighteen years old: bored, depressed, and longing to be \"young again.\" This story takes place before he was Vienna's most celebrated host, and before his millions were his curse. At the conclusion of this adventure, Orlofsky's father will leave him with a very different curse...one that all the money in the world cannot fix, and one that will define who he is for the rest of his life.",
  "genres": [
    "Vampires",
    "Fantasy"
  ],
  "author": "Isabelle Glass",
  "average_rating": "3.89",
  "url": "https://www.goodreads.com/book/show/35065888-prince-orlofsky-vampire-hunter"
}