{
  "title": "The Cage-maker",
  "description": "Bringing the New Orleans of the late 1800s and early 1900s vividly to life, Nicole Seitz’s latest novel unfolds as a series of letters, journal entries, and newspaper articles discovered in the secret compartment of an enormous and exquisitely detailed birdcage that Trish, a twenty-first-century blogger, has inherited from a heretofore unknown relative. As she peruses the documents, Trish finds herself irresistibly drawn into the history of her family―a tale that is, as one letter puts it, “part love story and part horror and madness.” In 1906 Dr. René Le Monnier is ready to retire after a lengthy career as the New Orleans coroner and physician for the insane asylum. Still mourning his wife’s death, the Civil War veteran wants nothing more than finally to write his account of the Battle of Shiloh. But when a sixteen-year-old girl, Carmelite Kurucar, enlists his aid in saving her brother from a death sentence, the good doctor has to reckon with old ghosts and dusty, long-forgotten files―in particular the case of a patient to whom he may not have given sufficient treatment and consideration. Le Monnier’s efforts to help Carmelite lead him to Bertrand Saloy, one of the richest men in all New Orleans; to the Le Monnier mansion, which still haunts him; and down a dark family lineage “cursed” by a succession of wealth. Amid the mysteries and suspenseful intrigue, a French birdcage maker’s obsessive love for Madame Saloy emerges at the heart of the story. Based in part on real people and events and featuring illustrations by the author, this engrossing epistolary novel offers fresh twists on the Southern Gothic genre. It reveals much about criminal justice, about early-twentieth-century notions of care for the mentally ill, and, most important, about the many ways in which the weight of history hangs over the present from one generation to the next.",
  "genres": [
    "Historical Fiction",
    "Fiction"
  ],
  "author": "Nicole Seitz",
  "average_rating": "3.66",
  "url": "https://www.goodreads.com/book/show/35064575-the-cage-maker"
}