{
  "title": "The Perfectionists: How Precision Engineers Created the Modern World",
  "description": "The revered New York Times bestselling author traces the development of technology from the Industrial Age to the Digital Age to explore the single component crucial to advancement—precision—in a superb history that is both an homage and a warning for our future.The rise of manufacturing could not have happened without an attention to precision. At the dawn of the Industrial Revolution in eighteenth-century England, standards of measurement were established, giving way to the development of machine tools—machines that make machines. Eventually, the application of precision tools and methods resulted in the creation and mass production of items from guns and glass to mirrors, lenses, and cameras—and eventually gave way to further breakthroughs, including gene splicing, microchips, and the Hadron Collider.Simon Winchester takes us back to origins of the Industrial Age, to England where he introduces the scientific minds that helped usher in modern production: John Wilkinson, Henry Maudslay, Joseph Bramah, Jesse Ramsden, and Joseph Whitworth. It was Thomas Jefferson who later exported their discoveries to the fledgling United States, setting the nation on its course to become a manufacturing titan. Winchester moves forward through time, to today’s cutting-edge developments occurring around the world, from America to Western Europe to Asia.As he introduces the minds and methods that have changed the modern world, Winchester explores fundamental questions. Why is precision important? What are the different tools we use to measure it? Who has invented and perfected it? Has the pursuit of the ultra-precise in so many facets of human life blinded us to other things of equal value, such as an appreciation for the age-old traditions of craftsmanship, art, and high culture? Are we missing something that reflects the world as it is, rather than the world as we think we would wish it to be? And can the precise and the natural co-exist in society?",
  "genres": [
    "History",
    "Science",
    "Nonfiction",
    "Engineering",
    "Technology",
    "Audiobook",
    "Business"
  ],
  "author": "Simon Winchester",
  "average_rating": "4.14",
  "url": "https://www.goodreads.com/book/show/35068671-the-perfectionists"
}