{
  "title": "Life Would Suck Without You: A Girlfriend Memoir",
  "description": "A memoir about friendship, womanhood, and the idea that girls just want to have fun. Preuss strikes a nice balance between sentimentality and humor … the author hits the mark with her lighthearted tone and self-deprecating asides … A pleasant remembrance and an easygoing beach read. — Kirkus Review When life makes no sense, and the world is going straight to hell, a girl knows she can always count on her best friends ...There are all types of friends. Rich friends. Poor friends. Fair weather friends—and then there are Best Friends—your BFF’s. Meet Jennifer, a wannabe soap opera star, new to LA and waiting tables in Century City. She makes three new friends, and they turn out to be inseparable.Together they go from one hilarious adventure to another; crashing concerts and movie star bars, lingerie shopping, and laughing about men’s shortcomings, all revealed through the razor-sharp, self-deprecating humor of the author. Life is good, even laugh-out-loud funny, and Jen discovers the real meaning of friendship. But when life throws them a cruel curve ball, which rocks them to their very core . . . is friendship enough?A feel-good story that will make you laugh and cry, Jennifer Preuss’s comical and heartwarming book tells the tale of an inseparable group of four women who navigate their 20s and 30s, dealing with life, death and all the things in between.“This girlfriends memoir brought me into a familiar world of friendship and reality; so loving and real that I kept wanting more in every chapter.” —Jennifer Prince“It’s a celebration of friendship and an honest look at the closeness of the female connection. When I finished reading and put the book down, I had that moment where I realized I was going to miss these girls.” —Paige NolanAbout the Author Jennifer Preuss is a die-hard Philadelphia transplant who now lives in Los Angeles with her husband and two children. She’s a writer and school teacher and gives thanks every day for her girlfriends. This is her first book.",
  "genres": [
    "Memoir"
  ],
  "author": "Jennifer Preuss",
  "average_rating": "4.38",
  "url": "https://www.goodreads.com/book/show/35064530-life-would-suck-without-you"
}