{
  "title": "Promises Part 3",
  "description": "A bounty hunter’s partners to lovers’ story.The hunt is on… and he’s the prey.Bradford (Ford) King was sure he had the rest of his life mapped out. Though he was no longer a SEAL Lieutenant, his brother was home safe and he had a job that still allowed him to satisfy his hunger for hunting bad guys. Life was simple, no distractions or complications – at age forty-six – that’s all Ford wanted. What he didn’t want was his work partner, sniper/watchman, Dana, giving him s**t all the time. Dana Cadby had grown up labeled a roughneck from the wrong side of the tracks. He’d fought, scrounged, and survived despite a father that constantly told him he couldn’t. Dana pulled himself up by his own boot straps and made a name for himself in the marksman community. He’d been Duke’s bounty watchman for five years. It was his job to ensure their safety, watch their backs. At thirty-three, he was trusted, well respected by his peers, his bosses, his friends… so why couldn’t he earn the same respect from his partner? Dana knew he was bisexual before he graduated high school. He also knew he was attracted to the huge, 6’3”, SEAL from the moment he and his brother came to join their team. It wasn’t easy for him to tamp down his immediate reaction to Ford’s thick muscles, full beard, and dark eyes. Still, Dana exhibited nothing but professionalism towards him, not wanting to make his ‘straight’ partner uncomfortable. So why did Ford constantly give him hell? After Dana took back his ex-girlfriend, he’d noticed an intensification in Ford’s bad attitude. One that turned aggressive and downright antagonistic, and Dana was damned if he’d just lay down and take it. He was gonna make that man respect him if it was the last thing he did. When Duke sends Dana and Ford out to track down their most dangerous bounty yet, they both embrace the fact that they make one hell of a team… but they fight tooth and nail against the powerful intimacy brewing between them. Beware: If Ford and Dana connect completely, god help the fugitive who’s in the sights of the hunter and his watchman.This story is a part of a series but can stand alone. It does not end on a cliffhanger and has a HEA.",
  "genres": [
    "M M Romance",
    "Contemporary",
    "Romance",
    "Audiobook",
    "Friends To Lovers",
    "Military Fiction",
    "LGBT"
  ],
  "author": "A.E. Via",
  "average_rating": "4.25",
  "url": "https://www.goodreads.com/book/show/35064709-promises-part-3"
}