{
  "title": "Gods and Fathers: The Invictus Cycle Book 4",
  "description": "Raves for A World I Never Made:\"An outstanding first novel, and a wonderful thriller.\" – BlogcriticsAnd Blood of My Brother:“Author James LePore is fast becoming a force to be reckoned with in the thriller genre, and Blood of My Brother proves it with a twisting, multifaceted plot that entertains and keeps readers guessing at every turn.\" – Nights and WeekendsAnd Sons and Princes:“Lepore had me hooked from the very first line, which is not hard to do when you’re asked to envision body parts showing up in a suitcase…. An absolute must-read!” – The Celebrity CafeNationally bestselling author James LePore has established a reputation as a writer whose vividly drawn characters and morally complex plots have kept readers up to all hours turning pages. His new novel promises more sleepless nights and more nonstop thrills.Matt DeMarco is an accomplished Manhattan attorney with more than his share of emotional baggage. His marriage ended disastrously, his ex-wife has pulled their son away from him, and her remarriage to a hugely successful Arab businessman has created complications for Matt on multiple levels. However, his life shifts from troubled to imperiled when two cops – men he's known for a long time – come into his home and arrest his son as the prime suspect in the murder of the boy's girlfriend.Suddenly, the enmity between Matt and his only child is no longer relevant. Matt must do everything he can to clear his son, who he fully believes is innocent. Doing so will require him to quit his job and make enemies of former friends – and it will throw him up against forces he barely knew existed and can only begin to comprehend how to battle.Gods and Fathers is at once a powerful mystery and a provocative international thriller, all of it presented with LePore's signature fascinating characters placed in dire circumstances where every choice poses new and potentially fatal challenges.",
  "genres": [
    "Fiction",
    "Thriller",
    "Crime",
    "Mystery"
  ],
  "author": "James LePore",
  "average_rating": "3.98",
  "url": "https://www.goodreads.com/book/show/12105170-gods-and-fathers"
}