{
  "title": "An Inconvenient Obsession",
  "description": "Sebastian After rescuing us from a kidnapping ring, Clint, the Alpha of the Coruscation werewolves and his Omega, Trevor, had gone out of their way to make us comfortable. They'd hosted social events for us and arranged job training. They'd even allowed me to travel thousands of miles to Terena de Dragoni – a small kingdom in Canada – to stay with Spence and his new Alpha, Harry. And there, in the ancient royal castle of Terena de Dragoni, is where my story really began…..  Terena de Dragoni \"Wouldn't you rather find a mate?\" I almost laughed. As an Omega, of course, I wanted a mate but, truthfully, who would want to get heirs on an orphaned Omega with no clue what his bloodline was? With the prospects of a mate dim, I would have been thrilled to be a super-hero, like the Blood Valley Omega, Colby, or an empath, like Trevor from the Coruscation werewolves, but not every Omega could be something special. Some of us had to be good old fashioned breeding stock. Unfortunately, I wasn't even good for that. Ultimately, I was hoping just to find my place in the world, regardless of where it was. \"Thanks, sweetie,\" I pressed a kiss to his cheek, \"but I think we all know that isn't in the cards for me.\"  Alrick For all intents and purposes, there are three ways that an Alpha can claim leadership of a pack. Bloodline, murder, or theft. For me, the pup of a pack that had deemed me damaged and abandoned me to the council, the first option wasn't an option at all. The second and third? Well, let’s just stop at morally repugnant and move on to where I did end up which wasn't leading a pack. Like so many young Alphas, I was determined to prove that I could make my place in the world strictly by my own merit. Of course, what I was to learn – and quickly – was that at the ripe old age of eighteen, I had no merit. Instead, I clawed my way forward, every advance bought with blood, sweat, and tears, until, eight grueling years later, I commanded the North American team of the most elite special forces in shifter society; the Böxenwolf Brigade. That service was how I came to find myself in my current predicament; standing in the Terena de Dragoni royal castle, pretending that I couldn't hear every word between the two whispering Omegas at the other end of the room.",
  "genres": [
    "M M Romance",
    "Paranormal",
    "Romance",
    "Shapeshifters",
    "Fantasy",
    "Omegaverse",
    "Paranormal Romance"
  ],
  "author": "Kian Rhodes",
  "average_rating": "3.97",
  "url": "https://www.goodreads.com/book/show/35073004-an-inconvenient-obsession"
}