{
  "title": "Elderberries: The Beginner's Guide to Foraging, Preserving and Using Elderberries for Health Remedies, Recipes, Drinks and More",
  "description": "Elderberries grow wild all over the United States, Canada, Europe and beyond, yet most people don't even realize they're there.  Now you can learn how to easily find wild elderberries, forage them and grow your own to make medicinal remedies like anti-flu syrup and elderberry oxymel, delicious baked goods like elderberry meringue pie and elderberry thumbprint cookies, elderflower recipes like elderflower fritters and elderflower soda, alcoholic recipes like elderberry wine and elderberry hard lemonade, and lots more.Elderberries and elderflowers are among the most perfect wild foods. They are useful in all sorts of recipes, packed with health benefits that do everything from boost the immune system to cure the flu, and you can even find them for free all over the world -- or grow your own.This comprehensive guide will teach incredible history of elderberries and elder flowersHealth studies and traditional medicinal usesThe effects of heating and freezing on the medicinal properties of elderberriesThe most efficient way to get every bit of the anti-flu benefits from elderberries ( it's not elderberry syrup!)How to easily find elderberries, with full-color ID photos and maps of elderberry ranges in the United States and Canada (though you'll also find them elsewhere all throughout the world)How to grow your own elder shrubs from cuttings or wild transplantsHow to preserve elderberries by freezing, drying, canning and moreHow to ID elders and how to tell them from so-called poisonous look-alikesElderflower recipes for teas, pancakes, syrups and moreElderberry recipes for jams, tinctures, oxymels, popsicles, pies, muffins and moreInstructions for homemade spirits like elderflower wine, elderberry mead, elderflower-blueberry smashes and elderflower liqueur ice cream floats -- just to name a few!And much moreWith over 60 recipes for health remedies, baked goods, spirits, jellies and more!The amazing health benefits of elderberries are well known.  There's no more need to spend up to $20 a pound on dried elderberries when you can find them all around you once you know where (and when) to look.  There's also no more need to limit yourself to elderberry syrup when there are so many better ways to get the health benefits of elderberries. And once you know how to find or grow your own elderberries, there's no need to stop at medicinal recipes when you'll have enough to also make all kinds of delicious jellies, liqueurs, baked goods, drinks and other delicious treats.Whether you're a novice forager wanting to find local (free!) sources of elderberries for anti-flu syrup, a homeowner interested in growing elderberries and finding delicious ways to preserve them, or a veteran forager looking for fun new ways to make use of elderberry and elderflower bounties, this comprehensive book has something for you.",
  "genres": [
    "Nonfiction",
    "Horticulture",
    "Gardening"
  ],
  "author": "Alicia Bayer",
  "average_rating": "4.50",
  "url": "https://www.goodreads.com/book/show/35076734-elderberries"
}