{
  "title": "The Sanders Saga",
  "description": "Post-Apocalyptic Fiction by N.C. Reed Clayton Sanders left home the minute he had his high school diploma in hand. He waited that long only because the Army wouldn't accept him without one. Now, ten years later, he's home. Home with no warning, no advance notice, no anything after being gone ten years with almost no contact with his family. Home carrying a secret that is burning him up from the inside. A secret that has pushed him to the brink, forcing him to become a criminal in order to be where his family needs him to be, even though they don't realize it yet. Because Clayton knows something they don't. Something that hasn't happened, but will. Something that will burn everything it touches. And change the face of the world forever. PROLOGUE They didn't have real names.Well, they had them of course. They just didn't use them. Not here. They were known by names their comrades had chosen. Names that suited their personalities. Names that only mattered to them. The men of CTG 31 were the kind of men that didn't exist in the modern, civilized world. There was no place for them in an enlightened society. Except when that society needed them. They were the kind of men who visited dark places in the middle of the night, doing violence to those who preyed on the weak and the helpless. Rough men, yes, but honorable. They had a code of their own, these men, and they lived by it as if it were a writ from a Higher Authority. No one broke that code, that set of unwritten rules that kept them from sliding over the edge. Kept them from becoming like those they hunted. Like those they were pursuing right now. “We're about twenty, maybe twenty-five minutes behind, Boss-man” The man known as Boss-man stopped, hand raised in a fist. Those following halted and spread out without being told. “Status?” Boss-man asked tersely. He was angry. They were all angry. Something they had to guard against in their business. Keeping things strict and orderly helped. “Still on the trail for now,” the scout replied. “Continue,” Boss-man ordered and waved his hand forward. The squad of men behind him began moving again. They were in a hurry today. Before dawn a group of terrorists had attacked a small village that the squad had befriended. Or that had befriended them. The men of CTG 31 weren't sure which was the case. They did know that the people of the small village known as Home had become their friends. The village had become a place where they could relax, even if only slightly, and be people for just a few hours at a time. A place of sanity in a world that had lost it's own. And that place had been violated. People they knew had been killed. Children they had grown to care for taken, herded toward a fate that no one in their group wanted to consider. Someone had to pay for that. Someone would pay for that. Dearly. They had been in pursuit for hours, running the entire way. Hard men who pushed themselves to be harder still, banking that toughness against a day like today. A day of reckoning. Had the attackers known the kind of men they were offending, it's entirely possible they would not have committed the atrocity. They were not brave men, these thugs known as terrorists. By nature terrorists were cowards, using fear and intimidation to force their will upon those too weak to resist them. But they hadn't known, and so they had attacked a place that was sacred to this squad of hard, violent men. And in so doing had assured that they, themselves, would not see another day on this mortal plane. Time meant nothing as they ran. There was only the objective and nothing else. A dozen pairs of eyes roamed the country around them, missing nothing as they moved. Twice the one called Boss-man had raised a hand, the men behind once more spreading out and taking position.",
  "genres": [
    "Post Apocalyptic",
    "Fiction",
    "Action",
    "Apocalyptic",
    "Survival",
    "Adventure"
  ],
  "author": "N.C. Reed",
  "average_rating": "4.58",
  "url": "https://www.goodreads.com/book/show/35081016-the-sanders-saga"
}