{
  "title": "The Shooting of Nancy Howard: A Journey Back to Shore",
  "description": "The Shooting of Nancy A Journey back to Shore combines love, betrayal, conspiracy, suffering, and survival with a cast of improbable a respected church-going husband and his mistress, a group of colorful criminals in East Texas, and a millionaire businessman. The story opens with Nancy's returning home from a church function on a Saturday night in 2012, and pulling into her garage. As she walks toward the door to her house, she suddenly faces an attacker who demands her purse and then shoots her in the head.  Investigation of the shooting first reveals that Nancy's husband has been having a three-year affair. A few days later, detectives uncover connections between her CPA husband and the East Texas gang. The story becomes increasingly bizarre as evidence surfaces of a murder-for-hire conspiracy initiated by Nancy's husband.   While Nancy deals with multiple injuries, including the loss of an eye, investigators uncover evidence that her husband has been paying large sums to the criminal gang for the expressed purpose of killing his wife. The money source is her husband's rich client, from whom he has extorted over six-million dollars, some of which he has used to give his mistress extravagant gifts. Meanwhile Nancy is undergoing painful repairs to her face, throat, and arm, followed by weeks in rehab. Nancy's physical suffering is exacerbated by learning of the growing evidence against her husband, at the same time enduring tension with her children, who continue to maintain their father's innocence. During the trials of her husband and the shooter, Nancy learns how many times the would-be killers' plans were thwarted by God's intervention to save her life, even by using the conspirators themselves. Today she is committed to sharing her unwavering faith that God can bring blessings out of the most devastating tragedies.",
  "genres": [
    "True Crime",
    "Nonfiction"
  ],
  "author": "Dr Alice Mathews",
  "average_rating": "4.15",
  "url": "https://www.goodreads.com/book/show/35088295-the-shooting-of-nancy-howard"
}