{
  "title": "Recycled Hearts Part One- The Diagnosis: A Killing Thrilling Love Story",
  "description": "'Tha- thump...''Tha- thump…''I swallowed down more fresh bile, and found my legs beginning to shake. My knees tried to push themselves further back into the wall, pressing my torso further in, holding myself together like a barrier.This pounding- this sickly, unforgiving pounding and thumping.Was Mark.And I couldn’t accept that. - Not in the way I thought I could.I had to leave. I had to get out of this room, this place- I wanted to run and run and run and never look back, I swallowed, knowing I needed to scream.\"Know This- Bonnie Lilac Loved Mark Grimes; completely, desperately, in unrequited imperfection. All Bonnie wanted was Mark. And after the haunting years of being alone- their fingertips graced each others, and as sparks flew,Tragedy hit.Bonnie, left on her own; not family, not girlfriend, not much to anyone- drifts in her loss.Only to have it spiral out of control when she meets the hard reality of her situation; her unrequited lovers heart has been given to another.Alone- Bonnie takes matters into her own hands, in a dangerous, twisting story where nothing can stay the same.'Everyone had passed me over.Everyone.And I had had enough.My anger shook violently as I screamed out into the night’s air. I scream harshly and feverishly, and strongly.If they wanted a crazy ‘Broken Bonnie’- I would give them it.I was sick of the pathetic looks and softened blows. I was fine. Stable and clever enough to escape a mental health ward and probably clever enough to get away with it too, if I was careful. As I sat in the grass, angry and running on adrenaline, I thought of all the other things I could possibly get away with right now. Things that would do nothing but help me, and support my well-being.That’s what they wanted wasn’t it?My eyes caught my twisted reflection in the glass in front of me- I sniffled and crawled towards it examining my pathetic form. I looked like ‘Broken Bonnie’ that was for sure. But that was fine- I needed to keep looking like her, to keep up the façade, because I knew, and they certainly knew-‘Broken Bonnie’, would never be capable of murder.Amazon Storyteller2017 Competition entry",
  "genres": [],
  "author": "Raven Sowl",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/35080436-recycled-hearts-part-one--the-diagnosis"
}