{
  "title": "Hearts Entwined",
  "description": "The ways of love can be complex. Sometimes a relationship full of unexpected twists and unlikely turns leads to a bond that's strong and secure. Join Karen Witemeyer, Mary Connealy, Regina Jennings, and Melissa Jagears for novellas that follow the winding path of romance in stories that celebrate a love that lasts forever.The Love Knot - When Claire Nevin's troubled younger sibling sends her an unexpected package by rail, the gift and the man who delivers it--an unexpected face from the past--threaten to upend Claire's life forever. Fighting to hold on to all she has built, will she lose what matters most?The Tangled Ties that Bind - Connor Kincaid returns home determined to win the hand of the woman he was too young for when he left. But Maggie is training to be a doctor in a distant town, while Connor's about to settle on a ranch. Will either be willing to give up their dream? Or will they both have to give up the love of a lifetime?Bound and Determined - As punishment for his recklessness, Private Bradley Willis is sent on an errand to help a retired cavalry officer move a herd across Indian Territory. No one told him the herd would be camels instead of cattle, nor that the officer's headstrong daughter, Ambrosia Herald, would seem to be trying to undermine the whole enterprise. He's definitely been saddled with more than he's bargained for.Tied and True - Wealthy Marianne Lister is in love with business assistant Calvin Hochstetler, but he can't see past the difference in their social status. When Marianne takes a job to prove that she is prepared for a life of hard work alongside the man of her dreams, will it be enough to convince Calvin to risk it all for love?",
  "genres": [
    "Christian Fiction",
    "Historical Fiction",
    "Romance",
    "Historical",
    "Novella",
    "Westerns",
    "Christian Romance"
  ],
  "author": "Karen Witemeyer",
  "average_rating": "4.15",
  "url": "https://www.goodreads.com/book/show/35086276-hearts-entwined"
}