{
  "title": "Respect",
  "description": "This is a previously-published edition - ASIN: B072F19RXZRespect - An Infidelity Series NovelThe Godfather meets Love Story... From New York Times, Wall Street Journal, and USA Today bestselling author Aleatha Romig comes a stand-alone novel spin-off from her beloved Infidelity series. With classic Aleatha Romig twists, turns, deceptions, and devotions, this new epic romantic thriller will delve into a world where family takes on new meaning, and even the inhabitants are suspicious of the next chapter.\"Standing at what I believe is the precipice of my life, I, Oren Demetri, was too young to understand that it wasn't and too old to imagine that it couldn't be. The already hefty accumulation of my successes and failures, bravery and fears, and rewards and suffering, had brought me to this point. It was hard to contemplate the things I'd done, and yet, in reality I'd only begun to learn the possibilities. I suppose that's how it was for me at twenty-nine years of age on the brink of all I'd ever wanted without fully realizing the price I would pay. Yet in that moment, I knew there would be no cost too great or sacrifice I wouldn't make. I had no idea how far-reaching that moment of self-discovery would be; because as the congregation's murmurs quieted, bleeding into silence and allowing the thump of my heart to be the only sound I heard, I was a man filled with love and adoration, emotions in stark contrast to those I needed in the world I'd built or the one I was about to enter. Angelina Costello was my dream and now my reality. I'd worked diligently to move beyond the actuality of being a dockworker's son to becoming a self-made, successful entrepreneur, all in an effort to earn the right to call her my own. I'd overcome servitude to others, collecting their paychecks and lowly praises, to being the one who signed the paychecks and offered the accolades when they were rightfully earned. The world was my oyster and walking toward me on the arm of her uncle was my pearl. I'd found her amongst the empty shells life had offered. There was no need to pry open another possibility. Angelina was all I wanted. Yet my path was uncharted. There was more for me to earn, lose, and willingly give. The top of that list was respect.\"This stand-alone novel takes place before the Infidelity series and may be read BEFORE, AFTER, or APART from the Infidelity series.Have you been Aleatha'd?",
  "genres": [
    "Romance",
    "Dark",
    "Contemporary Romance",
    "Dark Romance",
    "Audiobook",
    "Crime",
    "Contemporary"
  ],
  "author": "Aleatha Romig",
  "average_rating": "4.27",
  "url": "https://www.goodreads.com/book/show/35080870-respect"
}