{
  "title": "On Antisemitism: Solidarity and the Struggle for Justice",
  "description": "When the State of Israel claims to represent all Jewish people, defenders of Israeli policy redefine antisemitism to include criticism of Israel. Antisemitism is harmful and real in our society. What must also be addressed is how the deployment of false charges of antisemitism or redefining antisemitism can suppress the global progressive fight for justice. There is no one definitive voice on antisemitism and its impact.Jewish Voice for Peace has curated a collection of essays that provides a diversity of perspectives and standpoints. Each contribution explores critical questions concerning uses and abuses of antisemitism in the twenty-first-century, focusing on the intersection between anti-Semitism, accusations of anti-Semitism, and Palestinian human rights activism.This anthology provides a much-needed tool for Palestinian solidarity activists, teachers, as well as Jewish communities. Featuring contributions from Omar Barghouti, Judith Butler, and Rebecca Vilkomerson, as well as activists, academics, students, and cultural workers, On Political Solidarity and Justice includes the voices of Palestinian students and activists, and Jews that are often marginalized in mainstream discussions of anti-Semitism, including Jews of Color and Sephardi/Mizrahi Jews.Jewish Voice for Peace (JVP) is a national, grassroots organization inspired by Jewish tradition to work for a just and lasting peace according to principles of human rights, equality, and international law for all the people of Israel and Palestine. JVP has over 200,000 online supporters, over sixty chapters, a youth wing, a Rabbinic Council, an Artist Council, an Academic Advisory Council, and an Advisory Board made up of leading U.S. intellectuals and artists.",
  "genres": [
    "Nonfiction",
    "Politics",
    "Judaism",
    "Religion",
    "Jewish",
    "Essays",
    "Social Justice"
  ],
  "author": "Jewish Voice for Peace",
  "average_rating": "4.06",
  "url": "https://www.goodreads.com/book/show/35079132-on-antisemitism"
}