{
  "title": "'She Is Evil!': Madness And Murder In Memphis",
  "description": "“That woman is evil. She is evil!”  Ejaz Ahmad was handsome, charismatic, and a self-made businessman. He arrived in the United States from Pakistan determined to fulfill his mother’s dying wish: to come to America, complete his education, and make his mark in the world. Settling in Memphis, Tennessee, Ejaz became owner of several businesses, father to a handsome boy, and a devout Muslim. The only thing missing in his life was a wife, someone special to protect, honor, and love.  Leah Ward was a pretty girl, but a prison parolee with a history of drug charges, petty crime, and a questionable past. She led a flotsam life, drifting from town to city to state. When she was introduced to Ejaz Ahmad, she believed she had found the ultimate answer: a place to live, someone to take care of her, and money to spend. But what began idyllic soon became abusive and then dangerous for Ejaz. His friends and family warned him. And in May of 2003 Ejaz paid the ultimate price when family members found his mutilated body in a shed.  SHE IS EVIL is a story of trust, abuse, religion, and murder. Of a kind man who tried to help a troubled woman and became the victim of abuse and, eventually, a heinous murder.  About The Author:Criminologist Judith A. Yates is the award-winning author of “When Nashville Bled” and “The Devil You Know” and Editor of True Crime: Case Files Magazine. She has appeared on numerous talk shows and has lectured, conducted training, and made guest speaking appearances across the United States. After a lifetime of working in law enforcement, Ms. Yates lives in Kentucky.  Brought to you by WildBlue Press:  Facebook: https://www.facebook.com/wildbluepress/ Twitter: @wildbluepress https://twitter.com/wildbluepress Pinterest: https://www.pinterest.com/wildbluepress/ Instagram: @wildblue_press https://www.instagram.com/wildblue_pr... Website: wildbluepress.com Email: promos@wildbluepress.com Interested Authors: https://wildbluepress.com/about-us/fo... Join our newsletter http://wbp.bz/newsletter for book announcements, deals and contests",
  "genres": [
    "True Crime",
    "Nonfiction"
  ],
  "author": "Judith A. Yates",
  "average_rating": "3.79",
  "url": "https://www.goodreads.com/book/show/35103932-she-is-evil"
}