{
  "title": "The Most Dangerous Man in America: Timothy Leary, Richard Nixon and the Hunt for the Fugitive King of LSD",
  "description": "From Bill Minutaglio and Steven L. Davis, authors of the PEN Center USA award-winning Dallas 1963 , comes a madcap narrative about Timothy Leary's daring prison escape and run from the law.On the moonlit evening of September 12, 1970, an ex-Harvard professor with a genius I.Q. studies a twelve-foot high fence topped with barbed wire. A few months earlier, Dr. Timothy Leary, the High Priest of LSD, had been running a gleeful campaign for California governor against Ronald Reagan. Now, Leary is six months into a ten-year prison sentence for the crime of possessing two marijuana cigarettes.Aided by the radical Weather Underground, Leary's escape from prison is the counterculture's union of \"dope and dynamite,\" aimed at sparking a revolution and overthrowing the government. Inside the Oval Office, President Richard Nixon drinks his way through sleepless nights as he expands the war in Vietnam and plots to unleash the United States government against his ever-expanding list of domestic enemies. Antiwar demonstrators are massing by the tens of thousands; homemade bombs are exploding everywhere; Black Panther leaders are threatening to burn down the White House; and all the while Nixon obsesses over tracking down Timothy Leary, whom he has branded \"the most dangerous man in America.\"Based on freshly uncovered primary sources and new firsthand interviews, The Most Dangerous Man in America is an American thriller that takes readers along for the gonzo ride of a lifetime. Spanning twenty-eight months, President Nixon's careening, global manhunt for Dr. Timothy Leary winds its way among homegrown radicals, European aristocrats, a Black Panther outpost in Algeria, an international arms dealer, hash-smuggling hippies from the Brotherhood of Eternal Love, and secret agents on four continents, culminating in one of the trippiest journeys through the American counterculture.",
  "genres": [
    "History",
    "Nonfiction",
    "Biography",
    "Politics",
    "Crime",
    "True Crime",
    "American History"
  ],
  "author": "Bill Minutaglio",
  "average_rating": "4.16",
  "url": "https://www.goodreads.com/book/show/35099567-the-most-dangerous-man-in-america"
}