{
  "title": "Promise",
  "description": "In the aftermath of a devastating tornado that rips through the town of Tupelo, Mississippi, at the height of the Great Depression, two women worlds apart—one black, one white; one a great-grandmother, the other a teenager—fight for their families’ survival in this lyrical and powerful novel“Gwin’s gift shines in the complexity of her characters and their fraught relationships with each other, their capacity for courage and hope, coupled with their passion for justice.” -- Jonis Agee, bestselling author of The River WifeA few minutes after 9 p.m. on Palm Sunday, April 5, 1936, a massive funnel cloud flashing a giant fireball and roaring like a runaway train careened into the thriving cotton-mill town of Tupelo, Mississippi, killing more than 200 people, not counting an unknown number of black citizens, one-third of Tupelo’s population, who were not included in the official casualty figures.When the tornado hits, Dovey, a local laundress, is flung by the terrifying winds into a nearby lake. Bruised and nearly drowned, she makes her way across Tupelo to find her small family—her hardworking husband, Virgil, her clever sixteen-year-old granddaughter, Dreama, and Promise, Dreama’s beautiful light-skinned three-month-old son.Slowly navigating the broken streets of Tupelo, Dovey stops at the house of the despised McNabb family. Inside, she discovers that the tornado has spared no one, including Jo, the McNabbs’ dutiful teenage daughter, who has suffered a terrible head wound. When Jo later discovers a baby in the wreckage, she is certain that she’s found her baby brother, Tommy, and vows to protect him.During the harrowing hours and days of the chaos that follows, Jo and Dovey will struggle to navigate a landscape of disaster and to battle both the demons and the history that link and haunt them. Drawing on historical events, Minrose Gwin beautifully imagines natural and human destruction in the deep South of the 1930s through the experiences of two remarkable women whose lives are indelibly connected by forces beyond their control. A story of loss, hope, despair, grit, courage, and race, Promise reminds us of the transformative power and promise that come from confronting our most troubled relations with one another.",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Historical",
    "Book Club",
    "Adult Fiction",
    "Audiobook",
    "Southern"
  ],
  "author": "Minrose Gwin",
  "average_rating": "3.85",
  "url": "https://www.goodreads.com/book/show/35098703-promise"
}