{
  "title": "Fearless in 21 Days: A Survivor's Guide to Overcoming Anxiety",
  "description": "Fearless in 21 Days is a testimony of hope and a day-by-day guide to healing the mind using mental, emotional, physical, and spiritual applications for those bound by crippling fear, anxiety, panic disorders, and depression.In the summer of 2013, family and friends watched helplessly as author Sarah E. Ball spiraled into the darkest season of her life. A passionate woman of God, wife, mom of five, and popular blogger, Sarah nevertheless found herself abruptly taken captive by a severe anxiety and panic disorder that left her bedridden for months. Those around her were shocked at her fast derailment because she had always been a very strong, dependable woman. With time and perseverance, her determination and faith in God led her out of anxiety and into a place of complete freedom.After Sarah found deliverance from mental illness she was determined to reach back into the pit and pull the next person out. She began sharing the intimate details of her breakdown and recovery with her readers, creating an online series Fearless in 21 Days as a daily guide to overcoming anxiety. After the series gained an increasing amount of attention, Sarah expanded the series into an award-winning full book manuscript.In Fearless in 21 Days , Sarah takes the readers through 21 revelations that focus on healing the whole self-body, mind, and soul-and bridging the gap between effective mental health therapies and Scripture. The book begins with practical tips that can dramatically reduce the immediate symptoms of anxiety and then dives deeper into spiritual and mental truths to create a hope-filled guide to freedom from anxiety so that readers may boldly and bravely fulfill their purpose in Christ-fearlessly.",
  "genres": [
    "Self Help",
    "Nonfiction",
    "Audiobook",
    "Christian"
  ],
  "author": "Sarah E. Ball",
  "average_rating": "4.27",
  "url": "https://www.goodreads.com/book/show/35099621-fearless-in-21-days"
}