{
  "title": "The Girl on the Velvet Swing: Sex, Murder, and Madness at the Dawn of the Twentieth Century",
  "description": "From New York Times bestselling author Simon Baatz, the first comprehensive account of the murder that shocked the world.In 1901 Evelyn Nesbit, a chorus girl in the musical Florodora, dined alone with the architect Stanford White in his townhouse on 24th Street in New York. Nesbit, just sixteen years old, had recently moved to the city. White was forty-seven and a principal in the prominent architectural firm McKim, Mead & White. As the foremost architect of his day, he was a celebrity, responsible for designing countless landmark buildings in Manhattan. That evening, after drinking champagne, Nesbit lost consciousness and awoke to find herself naked in bed with White. Telltale spots of blood on the bed sheets told her that White had raped her.She told no one about the rape until, several years later, she confided in Harry Thaw, the millionaire playboy who would later become her husband. Thaw, thirsting for revenge, shot and killed White in 1906 before hundreds of theatergoers during a performance in Madison Square Garden, a building that White had designed.The trial was a sensation that gripped the nation. Most Americans agreed with Thaw that he had been justified in killing White, but the district attorney expected to send him to the electric chair. Evelyn Nesbit's testimony was so explicit and shocking that Theodore Roosevelt himself called on the newspapers not to print it verbatim. The murder of White cast a long shadow: Harry Thaw later attempted suicide, and Evelyn Nesbit struggled for many years to escape an addiction to cocaine. The Girl on the Velvet Swing, a tale of glamour, excess, and danger, is an immersive, fascinating look at an America dominated by men of outsize fortunes and by the the women who were their victims.",
  "genres": [
    "True Crime",
    "Nonfiction",
    "History",
    "Crime",
    "Biography",
    "Audiobook",
    "Historical"
  ],
  "author": "Simon Baatz",
  "average_rating": "3.46",
  "url": "https://www.goodreads.com/book/show/35099029-the-girl-on-the-velvet-swing"
}