{
  "title": "Blue Line Collection #1",
  "description": "Blue Line Collection #1 (Rereleased)Four must read MM erotic hockey romance stories in one reasonably priced collection!There’s no sport quite like ice hockey. The speed, the action, the physicality, the blood, and the rabid fans. Add in sizzling hot M/M romance and you’ve got the setting for some amazing romance tales! In the four stories contained in this collection, you’ll experience the ups-and-downs of finding that one true love through the eyes of four different men, ranging in age and experience, from collegiate players to the pros. Readers should be over 18 due to mature language and gay sexual situations. The set includes: Crashing the CreaseLong ChangeShutdown PairHeir Apparent(1) \nCrashing the Crease\nIsaac Spencer met J.D. Bazin for the first time during game one of the collegiate championship in Isaac`s junior year. The meeting did not go well. Bazin, a power forward for the opposing team, crashed Isaac`s net, taking the goalie out of the play and out of the series with a knee injury that nearly ended Isaac`s career.Angry words flew back and forth between the players involved as well as the coaches, colleges, press, and fans. After a grueling summer filled with surgery and rehab, Isaac fought his way back. After graduating, the Baltimore Badgers drafted Isaac. The Badgers also drafted J. D. Bazin, much to Isaac`s dismay.Isaac not only has to fight his disdain of the man who nearly ruined his career, he also has to battle the growing feelings that bubble up whenever J. D. is near. Is it possible to forgive and forget or will animosity over the past be too much for either man to absolve?originally published November 2015(2) \nLong Change\nCollegiate superstar goalie Boone Crockett seems to have the world at his feet. He’s rich, handsome, attends an elite college and is a hot prospect for the pros. Pity all that is a front for a deeply closeted and troubled young man.All Boone’s life plans are shattered when flamboyant ex-figure skater Preston Gordon, an orange-haired twink, shows up to audition for the team’s mascot position wearing sequins, scarves, and toe picks. His moves on the ice send Boone into his own pirouette of frustrated and reluctant desire.As senior year progresses Boone slides deeper and deeper into a dangerous depression, Preston’s sensual strength the only thing he has to hold on to. If Boone can’t keep from plunging through the thin ice he’s skating on, it could take a twink to make the big save.originally published June 2015(3) Shutdown PairSlinging burgers in Minnesota in the dead of winter isn’t exactly the Hemingway lifestyle aspiring writer Heath has dreamed of. About the only thing the quick-witted wordsmith has going for him is his pick-up hockey league games every Saturday. Now it looks like even that’s gone south, along with the team’s AWOL goalie.That is until mysterious Wyatt Dickenson skates into town and announces that he can tend net. Heath isn’t the type to turn down such a generous offer from a Greek god with impressive equipment and all the right moves.Heath offers to share his rented room with the enigmatic drifter, and soon begins to suspect that Wyatt is harboring a secret. Can Heath get Wyatt to open up about his dark past? Is there a dark past? Or is Heath’s writer’s mind just spinning sexy, shadowy scenarios about the mystery man who has him so infatuated?originally published May 2016(4) Heir ApparentJacobi Evans grew up watching Pittsburgh Puma superstar Cam Evans in the crease. After years of working diligently, as well as making all the sacrifices, Jacobi has made it. He`s gotten the call to try out for the spot as Cam`s back-up. His dreams are finally coming true, then Jacobi looks into the eyes of the man he grew up wanting to be. Now, Jacobi just wants Cam. But the young goalie knows Cam`s past; the marriage that failed, the daughter, the straight as a ruler lifestyle being played out in an elite Pittsburgh neighborhood. There isn`t a place for a young, gay goalie in that tightly laced world Cam lives in, is there?What Jacobi, and the world, thinks they know is far different then what Cam Evans really is. For his entire career, hell, since he was old enough to know, Cam has been hiding his homosexuality. Now, after close to twenty years of self-imposed agony, Cam is slowly falling apart. His game is off. His job looks to be on the line. His nights are filled with emptiness. His days are spent pretending. The life of lies is shredding him to ribbons. Then this Jacobi kid shows up looking damn good in the net, and far too good up close. Does he dare reach out to the young man who looks at him with much more than admiration in his eyes? Or should he burrow deeper into that dark, safe, lonely closet?Originally published April 2014 in the Seduced by the Game Anthology.",
  "genres": [
    "Hockey",
    "M M Romance",
    "Sports",
    "Anthologies",
    "Romance"
  ],
  "author": "V.L. Locey",
  "average_rating": "3.77",
  "url": "https://www.goodreads.com/book/show/35113233-blue-line-collection-1"
}