{
  "title": "Storm Coming: A Novel of the Civil War in Western Virginia",
  "description": "Based on a true story, this first of a trilogy of Civil War novels chronicles the fateful events of 1861 in western Virginia, as a young man learns to cope with his world turned upside down by war.It is April of 1861. The shocking events at Fort Sumter are having devastating effects on Alexander Swaney, living on his family farm in Pennsylvania just a few miles north of the border with western Virginia. He watches as Virginia fights its own civil war, as the disaffected western counties, long neglected by Richmond, attempt to secede from the rest of the state. Their political struggle produces the first land conflicts of the larger War of the Rebellion, involving the future military giants George McClellan, Stonewall Jackson, and Robert E. Lee fighting in the rugged mountains of western Virginia, soon to be a new state.As events sweep Alexander along in their path, he struggles to maintain some control over his destiny. Should he volunteer to join the Union army and fight to preserve the and he loves, but leave behind the girl he hopes to marry, as well as his family, at the mercy of marauders and bushwhackers? Adding to Alexander’s confusion is the fact that Sophia isn’t sure she’s ready to marry him, and a rival for her affections is on the scene in the form of his cousin Tip, a rake who has had his eye on Sophia.Fortunately, Alexander has a close friend in Harry Hagans, a young pastor who also feels the call to arms from his desire to bring an end to slavery. As the storms of war bear down on them, Harry and Alexander share a convoluted journey, ultimately arriving at their military home, the 1st Regiment of Loyal Virginia Volunteer Cavalry, later to become the 1st West Virginia Volunteer Cavalry. Along the way, their friendship is threatened when Harry reveals a dark secret that shakes Alexander’s trust. A detailed glimpse into a portion of Civil War history largely unknown, Storm Coming is a luminous story of a young man’s coming of age and the birth of a new state out of the storms of war.",
  "genres": [
    "Civil War",
    "War"
  ],
  "author": "Jack W. Lewis",
  "average_rating": "4.60",
  "url": "https://www.goodreads.com/book/show/35113857-storm-coming"
}