{
  "title": "How to Handle a Narcissist: Understanding and Dealing with a Range of Narcissistic Personalities",
  "description": "\"How to Handle a Narcissist\" is a simple guide to help you understand, handle and live with extreme narcissists. This personalized, sympathetic approach to narcissism combines leading expert opinions with real-life stories and practical advice. Research findings will show you what works when handling real narcissists at various points on the narcissistic spectrum, rather than only those who have a personality disorder.  Most of us show some degree of self-enhancing tendencies, but as we move up the narcissistic scale towards extreme narcissism, behaviors and characteristics start to harm not only the individual but people around them.  Whether the narcissistic person in your life is your partner, family member, friend or coworker, this book will help you to understand what you need to do to regain control of your boundaries, and guide the relationship in whichever direction is best for yourself and others.  Narcissists can make our lives hellish, but by understanding them and then following a few simple steps we can take back control of our boundaries and empower ourselves when dealing with these unavoidable personalities!    Here Is A Preview of What You’ll Learn…     Learn how to identify and differentiate between healthy and extreme narcissism, and determine how the narcissist in your life ranks for both    Discover how narcissism can be considered a dependence on narcissistic supply, mirroring a dependence on alcohol or other drugs    Find out what the narcissist wants from you    Discover practical research-based methods to making life easier with the narcissist    Read about other people's experiences with narcissists, and what they subsequently learnt    Download your copy today!   Take the first step towards freedom and peace of mind today and download this book for a limited time price of only $2.99!  Download your copy of \"How to Handle a Narcissist\" to learn real, valuable and helpful tips to influence a narcissist and start seeing things improve in a matter of days.    Check Out What Others Are Saying…    \"This book was really easy to read and avoided the blame, shame and label rhetoric that you see when you read about narcissists. I found it really useful to see the narcissist in my life as more of a person and why they were being so difficult. Then I could handle them from a much calmer place. Really helpful\"  - S. Goldberg  \"I bought this to help me decide what to do about my narcissistic mother. I'm going to give the techniques a try and see if we can have something of a relationship, really hoping they work\" - M. Winston",
  "genres": [
    "Psychology",
    "Nonfiction",
    "Self Help",
    "Mental Health",
    "Reference"
  ],
  "author": "Theresa Jackson",
  "average_rating": "3.86",
  "url": "https://www.goodreads.com/book/show/35111199-how-to-handle-a-narcissist"
}