{
  "title": "The Runaway Rock Star",
  "description": "This is a sweet, semi-clean romance. Although all Veronica Blade books do contain some mild cursing, the Rock Star Kisses series has slightly more than others. An infamous bad-boy rocker falls for a small-town girl who has no idea who he is. Considering his reputation, that’s probably a good thing. After his latest escapade splashes across the tabloids, Grammy-winning bad-boy Liam Blackwell questions his own choices. He alters his appearance, hits the road and drives until hunger forces him to stop at The Wagon Wheel. Mesmerized by the pretty bartender, he lingers and, with each passing moment, staying becomes easier to imagine. But he doesn’t do relationships and Emma isn’t a one-night kind of girl. And when this small-town girl learns all about his big city life, wouldn’t she dump him anyway? When a stranger walks into The Wagon Wheel wearing leather and a sexy grin, Emma Taylor is instantly drawn to him. But raising a child alone is hard enough at twenty-one without adding his kind of trouble into the mix. Though Emma sees more in Liam beyond the bruised knuckles and tattoos, she can’t risk temptation again or allow herself to hope for love, because when he inevitably blows out of town, he’ll just be another guy who broke her heart. EXCERPT As Liam slid his palm around the nape of my neck and slowly inched toward me, I knew I should push him away. Kissing him was a bad idea. But since seconds ago when he’d admitted to wanting me, all I could think about was feeling him against me. Maybe I needed to get the kiss out of the way so my brain would start working properly again. He paused with his mouth hovering over mine, as if asking for my blessing. Oh, to hell with it. I dropped my purse on the seat, raised my chin, and slipped my fingers though the belt loops of his jeans. He moved in closer, and I inhaled sharply before his lips brushed my own. He moved his mouth over mine, lingering, teasing, then grazed my bottom lip with his teeth just before he withdrew. Shivers danced over my arms, and my stomach dipped. I barely caught my breath before his mouth came crashing down on mine again. I opened for him, and our tongues tangled, causing tingles to spread out from my belly. He took the kiss deeper. As dizziness swept through me, a small moan escaped my lips, and I gripped his arms to keep my balance. Abruptly, Liam muttered a soft curse, stepped away, and ran his hands over his head. “I promised myself I wouldn’t molest you. What the hell is wrong with me?” He dropped his arms and stepped back. Nothing was wrong with him. Absolutely nothing.",
  "genres": [
    "Music"
  ],
  "author": "Veronica Blade",
  "average_rating": "3.88",
  "url": "https://www.goodreads.com/book/show/35112482-the-runaway-rock-star"
}