{
  "title": "The Secrets Series Box Set",
  "description": "**** EACH BOOK IN THE SERIES CAN BE READ AS A STANDALONE ****3 stories of love, suspense, and hot kinky sex! Each book in the Secrets Series features a separate couple finding love at Club Eden, a local BDSM club. Be prepared for hot, sizzling romance that heats up the pages!Book 1: Secrets of SubmissionA yearning to give up control…After leaving a toxic relationship, Penny Stephens has spent the last several years rebuilding her self esteem. She’s learning to love her plus size body again. In her journey toward self discovery, Penny realizes what’s been missing from her intimate submission. But she doesn’t know the true meaning of the word. That is, until she meets him.A desire to teach her all she needs…Marcus Allen, an intense Dominant, is instantly attracted to the voluptuous auburn haired beauty. He is eager to show her how to embrace her submissive side. Relentless in his approach, he begins Penny’s education. He’ll spend his days and nights teaching her the secrets of submission.Book 2: Secrets of DesireWhen secrets surface…Bridget Carter seems to have the perfect life. She’s happily single and has a career she loves as a fashion designer at a local boutique. She enjoys playing at Club Eden and bounces from one Dominant to another. She’s not looking for love, even though she’s more than intrigued by Connor Black. When a secret from Bridget’s past surfaces, Bridget and Connor are forced to work together to protect an innocent.The battle begins…Scarred inside and out, Connor Black fights to protect those who can’t protect themselves. He also hides behind a mask of confidence. Battling against his own insecurities, he secretly envies the boldness Bridget exudes. He watches her with a look of longing he thinks he’s kept hidden. And when Bridget comes to him for help, he realizes he can no longer keep his desire secret. But an enemy is ready to strike and Connor must battle his inner demons to protect the people he is coming to love.Book 3: Secrets of RedemptionI killed a man.He deserved to die, but guilt threatens to consume me. I continue on as though nothing is wrong, but every time I close my eyes, all I see is blood. His face haunts me. My life is crumbling around me, and I don’t know how much more I can take. Then, there is her. I’ve watched her, wanted her, for years. And now, I can never have her. Darkness surrounds me. I’m damaged goods. A murderer.I killed a man.He deserved to die, and never once have I regretted my actions. I’ve since made something of myself. I live a full life with a great career, a fantastic boss, and the best friends a girl could ask for. Then, there is him. I’ve seen him watching me with want in his eyes. I’ve been waiting for him to make the first move. But now, he walks around as if ghosts are chasing him. I know what he did, and I know it’s eating him alive. I only hope my love can light his way out of the darkness, and I can show him the secret of redemption.",
  "genres": [
    "BDSM",
    "Erotica",
    "Romance",
    "Contemporary"
  ],
  "author": "L.K. Shaw",
  "average_rating": "4.40",
  "url": "https://www.goodreads.com/book/show/35113484-the-secrets-series-box-set"
}