{
  "title": "Tempted by the Wolf",
  "description": "In the exciting conclusion to the True Mates Series, Lone Wolf Meredith and powerful warlock Daric fight their growing attraction for one another.   Lone Wolf shifter Meredith is trying to make the next ten years of her life pass by quickly. After being caught trying to steal from the New York clan, she’s sentenced to servitude to them for the next decade to make up for her crimes. But, when she gets assigned to guard their prisoner, the handsome but dangerous warlock, Daric, things suddenly become complicated. She knows he’s their enemy, and possibly evil, but she’s having a hard time controlling her attraction to him.  Now that he’s is finally free from the evil mage Stefan, Daric has one single goal: the destruction of his former master. He’ll do anything to kill the mage who ruined his life, even if it means working with the New York clan and their alpha. However, his desire for his beautiful Lycan bodyguard is a distraction, one he can’t afford. The she-wolf is proving to be too alluring, and he’s craving for a taste.  When Meredith’s past comes back to haunt her and she’s left hurting, Daric can’t help but offer his comfort and assistance, especially when all roads lead back to the mages. Can he keep his head and his heart or will she prove to be the one weakness that could destroy him?  Tempted by the Wolf is a full-length (75,000 words) werewolf paranormal romance with explicit love scenes, naughty language, and shifter suspense action with guaranteed HEA and no cliffhangers!  Although it works as a standalone romance story, this book takes place in the True Mates series. Though not necessary, I recommend you read the rest of the books to understand the world and the main plot.    True Mates Series Reading Order:  Fated Mates (Book 1) Blood Moon (Book 2) Romancing the Alpha (Book 3) Witch’s Mate (Book 4) Taming the Beast (Book 5)",
  "genres": [
    "Paranormal",
    "Shapeshifters",
    "Romance",
    "Paranormal Romance",
    "Werewolves",
    "Fantasy",
    "Witches"
  ],
  "author": "Alicia Montgomery",
  "average_rating": "4.60",
  "url": "https://www.goodreads.com/book/show/35117728-tempted-by-the-wolf"
}