{
  "title": "Hot Valor",
  "description": "A new standalone romance from New York Times Bestselling Author Lynn Raye Harris. Sexy, action-packed, and thrilling!  Colonel John \"Viper\" Mendez searches for a ghost from his past... and when he finds her, nothing will be the same! They told him she was dead. They lied... Colonel John \"Viper\" Mendez is having the second-worst day of his life. Accused of using the Hostile Operations Team to assassinate a foreign official, he's gone from being a respected military black-ops commander to a fugitive in the space of an hour. On the run, hunted, and stripped of his honor, Mendez has nowhere to go--and few people he can trust. Russian spy Ekaterina \"Kat\" Kasharin is a carbon copy of the woman Mendez once loved. Twenty-one years ago, Valentina vanished from his life. Kat claims to be her twin--but Kat's lying. Ordered by her superiors in Russian Intelligence to abandon the man she loved--or watch him die--Kat had no choice but to obey. But twenty-one years is a long time to love a man from afar, and Kat won't stand by as a traitor plans his death--even if it means risking her heart and her life to save him. She can never reveal her true identity--or the secrets she keeps locked away. Secrets he would hate her for. Working with him is strictly business, and she won't let emotions get in the way. But the attraction between them is smoking hot--and it's not long before they're burning up the sheets. When the truth comes out, the mission implodes. Everything Mendez thought he knew was a lie. He'll have to pull it together though before a deadly foe succeeds in taking away all he loves. By the time he realizes Kat might be most important of all? It could be too late to save her... The Hostile Operations Team is a covert military Black Ops unit. Their motto is Where None Dare. H.O.T. operators come from all branches of the military. The only criteria for membership: they must be the best of the best!",
  "genres": [
    "Military Fiction",
    "Romantic Suspense",
    "Military Romance",
    "Romance",
    "Second Chance",
    "Suspense",
    "Contemporary Romance"
  ],
  "author": "Lynn Raye Harris",
  "average_rating": "4.56",
  "url": "https://www.goodreads.com/book/show/35133120-hot-valor"
}