{
  "title": "The Skies Belong to Us: Love and Terror in the Golden Age of Hijacking",
  "description": "In an America torn apart by the Vietnam War and the demise of sixties idealism, airplane hijackings were astonishingly routine. Over a five-year period starting in 1968, the desperate and disillusioned seized commercial jets nearly once a week, using guns, bombs, and jars of acid. Some hijackers wished to escape to foreign lands, where they imagined being hailed as heroes; others aimed to swap hostages for sacks of cash. Their criminal exploits mesmerized the country, never more so than when the young lovers at the heart of Brendan I. Koerner's \"The Skies Belong to Us\" pulled off the longest-distance hijacking in American history. A shattered Army veteran and a mischievous party girl, Roger Holder and Cathy Kerkow commandeered Western Airlines Flight 701 as a vague protest against the war. Through a combination of savvy and dumb luck, the couple managed to flee across an ocean with a half-million dollars in ransom, a feat that made them notorious around the globe. Koerner spent four years chronicling this madcap tale, which involves a cast of characters ranging from exiled Black Panthers to African despots to French movie stars. He combed through over 4,000 declassified documents and interviewed scores of key figures in the drama--including one of the hijackers, whom Koerner discovered living in total obscurity. Yet \"The Skies Belong to Us\" is more than just an enthralling yarn about a spectacular heist and its bittersweet, decades-long aftermath. It is also a psychological portrait of America at its most turbulent, and a testament to the madness that can grip a nation when politics fail.",
  "genres": [
    "Nonfiction",
    "History",
    "True Crime",
    "Crime",
    "Politics",
    "Biography",
    "American History"
  ],
  "author": "Brendan I. Koerner",
  "average_rating": "4.04",
  "url": "https://www.goodreads.com/book/show/35131737-the-skies-belong-to-us"
}