{
  "title": "Being Indie: A No Holds Barred, Self Publishing Guide for Indie Authors",
  "description": "THE END... That's where BEING INDIE begins.2022 Literary Titan Gold Book Award RecipientOutstanding Career/Occupational Category Winner - 2019 IAN Book of the Year AwardsSOLO MEDALIST WINNER - Writing & Publishing, 2018 New Apple Summer eBook AwardsTo be a published author is an achievement few can brag about.But not all Indies are created equal.This book will give you the edge you need.Learn how to create a book that SELLS.BEING INDIE: A No Holds Barred Publishing Guide for Fiction Authors is a multi-award-winning guide by an expert in the industry. This indispensable resource emphasizes the critical importance of creating a book worth selling, focusing on every aspect of book development.In the crowded world of self-publishing, quality is key.A well-developed, polished book not only stands out but also builds the foundation for long-term success.Readers today have countless options, and a poorly executed book can damage your reputation and hinder future opportunities. BEING INDIE stresses that investing time and effort into producing a high-quality book at the onset is essential for earning readers’ trust and establishing a loyal audience.Designed to give authors the edge they need, BEING INDIE helps you navigate the industry, avoid common pitfalls, and steer clear of scams. From crafting a compelling narrative to building a strong author platform, this guide provides actionable insights to help you create a book that stands out and sustains your career.Take control of your publishing journey today. Grab your copy!Praise for BEING INDIE:______________________________\"Eeva Lancaster’s informative book clearly lays out all the steps an indie author needs to take when publishing and selling their book. Each chapter dives into a separate topic, explaining why the section is important first before moving onto the detailed how-to section. Sprinkled with anecdotes to help drive the points home, Being Indie is as fun as it is educational.\" ~ Literary Titan Review\"While it comprehensively covers all the tasks authors must accomplish before and after publication, what truly makes this book stand out is how quickly we get to the heart of the matter on each topic. With only a few paragraphs to explain why things are important, readers will appreciate how quickly they get into the meat of solving the problem.\" ~ Literary Titan Review\"This book demystifies the many aspects of self-publishing and presents them in a no-nonsense approach that I found refreshing. Other books might exist on the subject, but I have yet to read one that offers this level of clarification.\"\"What I appreciate most about Being Indie is the experience, and knowledge the author has about the process and the honesty with which she speaks.\"\"This is one of the best books any writer can read before venturing into the publishing industry. Matter of fact, to the point advice that I wish I'd read years ago. Ms. Lancaster also gives you the tools and a plan of action to be the champion of your work.\"",
  "genres": [],
  "author": "Eeva Lancaster",
  "average_rating": "4.60",
  "url": "https://www.goodreads.com/book/show/35130490-being-indie"
}