{
  "title": "Kiss Me When I'm Dead",
  "description": "A missing call girl.An unhealthy obsession.A dangerous world.A detective with no past.The stunning debut thriller by bestselling author Dominic Piper, Kiss Me When I’m Dead introduces the enigmatic, London-based private investigator Daniel Beckett.★★★★★ \"A refreshing, marvellously written thriller that bubbles with a sensational, simmering sexuality.\"★★★★★ \"Kiss Me When I’m Dead, by Dominic Piper, may well be the smartest crime tale I’ve read to date. It’s not only compelling, it’s craftily compelling as the author used his literary skills and story-telling abilities with masterful precision.\"★★★★★ \"Dominic Piper’s sense of humor is in turns subtle and outlandish. I found myself laughing at scenes that should’ve made my hair stand on end. He walks the fine line between madcap and gallows humor, always catching it just right.\"★★★★★ \"From the first page, the book grabs you. By the second page it won’t let go, and as this smart, sexy and often funny thriller unfolds on the page before you, it would be very easy to devour this masterful book in a couple of sittings.\"When Beckett is offered double his usual fee to track down Viola Raleigh, the missing daughter of a billionaire arms dealer, he has no reason to believe the assignment is not as it seems.But his investigation is hindered as he discovers he’s being stalked by a professional surveillance team. As he learns more about Viola’s life as a drug addict and high-class call girl, he starts to realise that his wealthy client has been economical with the truth.It isn’t long before Beckett himself is in danger, but his adversaries quickly discover that they are dealing with a formidable opponent with a far more sinister background than they might ever have imagined.For fans of sleek, intelligent crime fiction infused with intrigue, danger and seduction, Dominic Piper raises the bar for modern detective fiction with his bold and thrilling storytelling.Get your copy!ALL BOOKS by DOMINIC PIPERPI Daniel Beckett SeriesStandalone detective thrillers that can be enjoyed in any order.★★★★★ \" A perfect combination of mystery, sex and violence.\"★★★★★ \"Dominic Piper is an excellent author who writes razor-sharp, beautiful prose.\"Kiss Me When I’m DeadDeath is the New BlackFemme FataleBitter Almonds & JasmineAcid YellowDominic Piper is an author living in London.",
  "genres": [
    "Mystery",
    "Thriller",
    "Abuse",
    "Dark",
    "Mystery Thriller",
    "Suspense"
  ],
  "author": "Dominic  Piper",
  "average_rating": "4.37",
  "url": "https://www.goodreads.com/book/show/35126525-kiss-me-when-i-m-dead"
}