{
  "title": "Hollow Scream",
  "description": "THE FINAL SCREAM IS HOLLOWThe small mountain town of Crescent Hollow has a serial killer, or is it three?Women are being murdered in a grisly fashion. Now the killer has targeted one in particular and Wyatt Thomas has vowed to keep her safe. HIS BURIAL GROUND HAS BEEN DESECRATEDForensic Psychiatrist, Wyatt Thomas, has escaped the city to the quiet mountain town of Crescent Hollow to finish his latest book on serial killers. Cutting himself off from the outside world appears to be a great idea until his work follows him. A serial killer’s graveyard has been located nearby. As more and more bodies are unearthed there appears to be three separate MO’s. The mystery of which is more than he can resist.HIS ANGER UNSURPASSEDSpecial Agents Annie Thomas and Blake Hayashi of The FBI’s Behavior Analyst Unit have been sent to The George Washington Jefferson National Forest to aid local law enforcement with a case. Either a serial killer has been active in the area for roughly fifty years or three killers are using the same dumping ground. SOMEONE MUST PAYSeasoned Homicide Detective, Merrybell Montgomery, left her career in Philly to take care of her ailing husband in his hometown of Crescent Hollow, Virginia. Although he passed over a year ago, she’s remained in the picturesque town with no idea what to do with the rest of her life. Suddenly she finds herself stuck in the middle of a nightmare. She’s being stalked by a serial killer and has no idea what put her in his sights.NO ONE IS SAFENow they must all work together to stop a killer or die trying.AUTHOR’S NOTE: The main character in this book, Dr. Wyatt E. Thomas, is a forensic psychologist who delves into the disturbed minds of some of the most horrendous killers of all time. In as such, if you are sensitive or have a problem turning off the emotional side of your brain to view these studies in a clinical fashion please skip those parts – they are marked in italics. There are crimes against children and other details that could upset or offend some people. For those of you interested in reading the full biographies of the persons mentioned, you will find the books this information came from at the end of this story. Thank you for your understanding.",
  "genres": [
    "Mystery"
  ],
  "author": "Morgan Hannah MacDonald",
  "average_rating": "4.50",
  "url": "https://www.goodreads.com/book/show/35120275-hollow-scream"
}