{
  "title": "Enseñar Platón en Palestina: Filosofía en un mundo dividido",
  "description": "¿Puede Platón ayudar a entender el mundo? ¿Puede la filosofía contribuir a una sociedad más libre, justa y racional, incluso en aquellos lugares donde el conflicto parece insalvable, donde el analfabetismo es dominante y la pobreza acuciante?Carlos Fraenkel invita a sus alumnos palestinos a leer a Platón, como Nafisi invitaba a sus alumnas a Leer Lolita en Teherán. Se trata de confrontarlos con el pensamiento dominante, animándolos a debatir, a expresarse en libertad y a cuestionar sus ideas preconcebidas. A discutir sobre principios filosóficos allí donde la justicia, la felicidad y el bien no son principios relativos, sino anhelos.Sacar la filosofía a la calle, enriquecerla con su acercamiento a la gente y dar herramientas a los ciudadanos para la reflexión, obligarlos a pensar sobre su entorno, sobre sus creencias, su credo, sus certezas. Y hacerlo además en un territorio lejano, hostil; Palestina, por ejemplo. Cuestionar la existencia de Dios ante devotos musulmanes, preguntarse por la justicia social en arrabales brasileños, polemizar sobre el poder con tribus indias o sobre el legado del colonialismo en Indonesia.Este maravilloso libro, parte narrativa de viajes, parte ensayo intelectual, es una llamada a integrar la filosofía en nuestra vida pública y privada. Fraenkel nos conduce alrededor del mundo mientras buceamos en la historia de la filosofía y sus grandes cuestiones. A lo largo de sus discusiones con alumnos, a menudo asistimos a choques de pareceres, opiniones divergentes sobre asuntos morales, religiosos o filosóficos que el autor reconduce hacia lo que llama «la cultura del debate». Es a través de ella, de esa cultura del debate, que mediante un esfuerzo conjunto nos acercamos algo más a la verdad, argumentando y escuchando, y poniendo además en valor un hecho que el autor considera fundamental: la discrepancia. En un mundo que tiende hacia la asimilación y la uniformidad, este libro es también una defensa de nuestras diferencias.",
  "genres": [
    "Philosophy",
    "Nonfiction",
    "Politics"
  ],
  "author": "Carlos Fraenkel",
  "average_rating": "3.54",
  "url": "https://www.goodreads.com/book/show/35150627-ense-ar-plat-n-en-palestina"
}