{
  "title": "The Mammoth Book of Vampire Stories by Women",
  "description": "Featuring the only vampire short story by Anne Rice, the undisputed queen of vampire literature, and an autobiographical introduction by Ingrid Pitt, star of the films The Vampire Lovers and Countess Dracula, this Mammoth collection brings together thirty-four uncanny and erotic tales by women who have redefined the genre of vampire fiction. From classic stories of the undead by writers like Edith Nesbit, Mary E. Wilkins-Freeman, and Mary Elizabeth Braddon to the work of such acclaimed contemporary authors as Poppy Z. Brite, Nancy Kilpatrick, Tanith Lee, Caitlin R. Kiernan, and Pat Cadigan, this terrifying and tantalizing volume turns the conventions of vampire fiction on their head and inside out as it refashions, and revamps, Bram Stoker's urbane Count Dracula in smart, modern, sexy terms. Original and inventive, the tales in this anthology offer a wide and varied range of undead heroines and doomed heroes, from the tormented good to the unspeakably evil. At large among them in the gardens of literature's longest night are Chelsea Quinn Yarbro's Byronic vampire Saint-Germain, Nancy A. Collins's \"Vampire King of the Goth Chicks,\" Tanya Huff's vampiric detective Vicki Nelson, and Freda Warrington's age-old lovers Karl and Charlotte. In all, the quest continuesfor blood to drink, for souls to steal, for life among the undead.CONTENTSIntroduction: My Life Among The Undead by Ingrid PittThe Master Of Rampling Gate by Anne RiceHomewrecker by Poppy Z. BriteWhen Gretchen Was Human by Mary A. TurzilloThe Vengeaful Spirit of Lake Nepeakea by Tanya HuffLa Diente by Nancy KilpatrickMiss Massingberd and the Vampire by Tina RathThe Raven Bound by Freda WarringtonVampire King of the Goth Chicks by Nancy A. CollinsJust His Type by Storm ConstantinePrince Of Flowers by Elizabeth HandService Rendered by Louise CooperAftermath by Janet BerlinerOne Among Millions by Yvonne NavarroLuella Miller by Mary E. Wilkins-FreemanSangre by Lisa TuttleA Question of Patronage by Chelsea Quinn YarbroHisako San by Ingrid PittButternut and Blood by Kathryn PtacekSleeping Cities by Wendy WebbThe Haunted House by E. NesbitTurkish Delight by Roberta LannesVenus Rising on Water by Tanith LeeYear Zero by Gemma FilesGood Lady Ducayne by Mary Elizabeth BraddonLunch At Charon's by Melanie TemForever, Amen by Elizabeth MassieNight Laughter by Ellen KushnerBootleg by Christa FaustOutfangthief by Gala BlauMy Brother's Keeper by Pat CadiganSo Runs The World Away by Caitlin R. KiernanA North Light by Gwyneth JonesJack by Connie WillisVampyr by Jane Yolen",
  "genres": [
    "Vampires",
    "Horror",
    "Anthologies",
    "Fantasy",
    "Short Stories",
    "Fiction",
    "Paranormal"
  ],
  "author": "Stephen              Jones",
  "average_rating": "3.61",
  "url": "https://www.goodreads.com/book/show/351403.The_Mammoth_Book_of_Vampire_Stories_by_Women"
}