{
  "title": "Caught in the Flames: A Tale of Two Firemen",
  "description": "When Karen Smith's life imploded due to her husband's infidelity she decides it's time to live out all the fantasies she'd put on hold to be a good wife. She sets her eyes on the sexy neighborhood fire department, but a mix up in dates means she'll have to pleasure two of the forces hottest firemen at the same time. As Adam and Brad break her into new realms of pleasure she must decide between the light and the dark, because while they've agreed to share her for the night, she must pick one or loose them both. *************************************************************************************\"It wasn’t supposed to happen this way. Adam showed up on the wrong night.” “And that’s supposed to make it better?” Brad said scathingly. “So I’m Tuesday’s lay and he’s Wednesday’s?” “You know what? Don’t judge me.” I said hotly. “I’m not married to you, we’re not exclusive. If I wanted to you and the whole department, that’d be my own business.” As soon as the words were out my mouth I regretted them. I watched Brad’s blue eyes turn even darker. “Is that so?” he said, advancing through the doorway. “So, you want to take on the whole department, huh? Well, Adam and I here can at least get you two notches on your belt.” He looked back at Adam with a grin. “What do you say, Adam? Want to show her how close firefighters can be?”Adam smiled and came inside the apartment, kicking the door closed with his foot. “Sure. Seems like the lady has a thing for fireman, and my mom told me I should always try and give a lady what she wants.” I backed away from their advances instinctively, trying to swallow past the lump in my throat. Surely they couldn’t be serious? Brad approached me like a thunderstorm, dark and swift, pushing me against the wall he cupped my face with his large hands, running his thumb across my bottom lip. “Come on Megan, admit it, you want both of us, so what’s the problem?” I stared into his eyes, hypnotized by his closeness and the smoky sweet smell of his aftershave. Adam, came up on the other side of us, gently winding his hand into my hair and turning my gaze towards his mossy green eyes. It was true, I did want both of them. I wanted to feel them against my skin, to know the doubled pleasure of two.",
  "genres": [],
  "author": "Jasmine Knights",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/35144789-caught-in-the-flames"
}