{
  "title": "A More Beautiful and Terrible History: The Uses and Misuses of Civil Rights History",
  "description": "Explodes the fables that have been created about the civil rights movementThe civil rights movement has become national legend, lauded by presidents from Reagan to Obama to Trump, as proof of the power of American democracy. This fable, featuring dreamy heroes and accidental heroines, has shuttered the movement firmly in the past, whitewashed the forces that stood in its way, and diminished its scope. And it is used perniciously in our own times to chastise present-day movements and obscure contemporary injustice.In A More Beautiful and Terrible History award-winning historian Jeanne Theoharis dissects this national myth-making, teasing apart the accepted stories to show them in a strikingly different light. We see Rosa Parks not simply as a bus lady but a lifelong criminal justice activist and radical; Martin Luther King, Jr. as not only challenging Southern sheriffs but Northern liberals, too; and Coretta Scott King not only as a \"helpmate\" but a lifelong economic justice and peace activist who pushed her husband's activism in these directions.Moving from \"the histories we get\" to \"the histories we need,\" Theoharis challenges nine key aspects of the fable to reveal the diversity of people, especially women and young people, who led the movement; the work and disruption it took; the role of the media and \"polite racism\" in maintaining injustice; and the immense barriers and repression activists faced. Theoharis makes us reckon with the fact that far from being acceptable, passive or unified, the civil rights movement was unpopular, disruptive, and courageously persevering. Activists embraced an expansive vision of justice--which a majority of Americans opposed and which the federal government feared.By showing us the complex reality of the movement, the power of its organizing, and the beauty and scope of the vision, Theoharis proves that there was nothing natural or inevitable about the progress that occurred. A More Beautiful and Terrible History will change our historical frame, revealing the richness of our civil rights legacy, the uncomfortable mirror it holds to the nation, and the crucial work that remains to be done.",
  "genres": [
    "History",
    "Nonfiction",
    "Race",
    "Politics",
    "Social Justice",
    "American History",
    "Anti Racist"
  ],
  "author": "Jeanne Theoharis",
  "average_rating": "4.32",
  "url": "https://www.goodreads.com/book/show/35135273-a-more-beautiful-and-terrible-history"
}