{
  "title": "The Mammoth Book of Vampires",
  "description": "Award-winning horror editor Stephen Jones presents thirty-six modern masters of the macabre. Among them are: Harlan Ellison, Chelsea Quinn Yarbro, Paul McAuley, Peter Tremayne, Steve Rasnic Tem, and Ramsey Campbell.This anthology collects the very best in vampire fiction which blends sheer horror with dark humor, deadly tenderness with tingling terror. For the classic vampire, as this volume amply shows, the Blood is the Life. From Hugh B. Cave's pulp thriller \"Stragella\" through to Harold Waldrop's bizarre mix of vampire and Nazis in \"Der Untergang Des Abendlandesmenschen\" and Christopher Fowler's \"The Legend of Dracula Reconsidered as a Primetime TV Special.\" In between lie artful chillers by the likes of Clive Barker, Brian Lumley, R. Chetwynd-Hayes, Robert Bloch and John Burke, along with new and original stories by Niel Gaiman with \"Cards from a Vampire Tarot,\" and Kim Newman with \"Andy Warhol's Dracula: anno Dracula 1978-79.\" You can sink your teeth, too, in F. Paul Wilson's fast-paced thriller \"Midnight Mass,\" Manly Wade Wellman's \"Chastel,\" offering bloody intrigue and adventure with Judge Keith Hilary Pursuivant; and Les Daniel's \"Yellow Fog,\" which features his enigmatic vampire-hero Don Sebastian de Villanueva.CONTENTSIntroduction: The Children of the Night by Stephen JonesHuman Remains by Clive BarkerNecros by Brian LumleyThe Man Who Loved The Vampire Lady by Brian StablefordA Place To Stay by Michael Marshall SmithThe Brood by Ramsey CampbellRoot Cellar by Nancy KilpatrickHungarian Rhapsody by Robert BlochThe Legend of Dracula Reconsidered as a Prime-Time TV Special by Christopher FowlerVampire by Richard Christian MathesonStragella by Hugh B. CaveA Week In The Unlife by David J. SchowThe House At Evening by Francis GarfieldVampyrrhic Outcast by Simon ClarkThe Labyrinth by R. Chetwynd-HayesBeyond Any Measure by Karl Edward WagnerDoctor Porthos by Basil CopperStraight To Hell by Paul McAuleyIt Only Comes Out At Night by Dennis EtchisonInvestigating Jericho by Chelsea Quinn YarbroDracula's Chair by Peter TremayneA Taste For Blood by Sydney J. BoundsThe Better Half by Melanie TemThe Devil's Tritone by John BurkeChastel by Manly Wade WellmanDer Untergang Des Abendlandesmenschen by Howard WaldropRed As Blood by Tanith LeeLaird of Dunain by Graham MastersonA Trick of the Dark by Tina RathMidnight Mass by F. Paul WilsonBlood Gothis by Nancy HolderYellow Fog by Les DanielsFifteen Cards From a Vampire Tarot by Neil GaimanVintage Domestic by Steve Rasnic TemTry A Dull Knife by Harlan EllisonAndy Warhol's Dracula: Anno Dracula 1978-1979 by Kim Newman",
  "genres": [
    "Horror",
    "Vampires",
    "Anthologies",
    "Short Stories",
    "Fiction",
    "Fantasy",
    "Alchemy"
  ],
  "author": "Stephen              Jones",
  "average_rating": "3.78",
  "url": "https://www.goodreads.com/book/show/351402.The_Mammoth_Book_of_Vampires"
}