{
  "title": "Rule #1 Don't Be #2",
  "description": "Want to be in the world's top 3% of achievers? Would you like a road map to get there? In his fourth book,  RULE #1 DON'T BE #2 ,bestselling author, CEO, and NHL Hockey AgentDaniel Milstein inspires like never before, challenging us to dream BIG with his charismatic candor, giving us each a compelling glimpse into our own limitless potential. Read Dan's riveting account of overcoming adversity to reach the top and countlessstories of others who've dominated their respective fields against seemingly insurmountable obstacles. Framed in Dan's fast-paced, conversational style and his best-loved, thought-provoking quotes,we're gifted the life-changing lessons of the world's greatest achievers. Here's what Top Achievers say about  RULE #1 DON'T BE #2  -  YouGet What You Work For Not What You Wish For.\"This book is hard-hitting, straightforward and life-changing. It teaches you how to join the \"big league\" in your work and personal life.\"Brian Tracy \"Dan Milstein is a living testament to the indomitable American spirit and showing how hard work, positive thinking and a laser focus can drive accomplishment and success.\"Carol CainEmmy Award Winning JournalistCBS-TV& The Detroit Free Press \"The skills he teaches can be used by anyone to develop their own business and sales efforts.\"Ross Rojek, San Francisco Book Review\"Reading this book not only is an engrossing experience - it is an uplifting one.\"Grady Harp, Top 100 Amazon Reviewer \"This book is a true gem, it is empowering,inspirational, ruthlessly honest, but most importantly it is probably the most outstandingly motivational book you will ever read, if you REALLY want your dreams to come true.\"  Susan KeefeMidwest Book Review The  Independent Author Network (IAN)  has selected  Rule #1 Don't Be #2  by Daniel Milstein as the #1 Business, Sales & Economics Book of 2017.  IAN  represents authors published by Indie Press. More than 20,000 readers visit the  IAN  website each day to find great books through a network of 550,000 Twitter followers and 101,000 Facebook fans.Rule #1 Don't Be #2  has received several awards and distinctions *           #1 Bestselling Business Book July, 2017 by 800-CEO-READ*           Hollywood Book Festival- WINNER Best Business Book*           Beach Book Festival - WINNER Best Business Book*           New York Book Festival -  Named Runner Up in Business",
  "genres": [
    "Business",
    "Nonfiction",
    "Self Help",
    "Money"
  ],
  "author": "Daniel Milstein",
  "average_rating": "3.82",
  "url": "https://www.goodreads.com/book/show/35144938-rule-1-don-t-be-2"
}