{
  "title": "Bare",
  "description": "Following the popular series debut—NUDES was praised as “passionate, emotional and uplifting” by #1 New York Times Bestselling Author Lauren Blakely—contemporary romance author Sarah Robinson weaves a new standalone story where a second chance at romance is found on a Hollywood film set and secrets always have a way of being…exposed.Reed Scott is the hottest actor in LA…Being a Hollywood heartthrob has its perks, and I’ve damn sure enjoyed every one of them, both on and off the silver screen. The tabloids loved every second of exploiting my privacy, chronicling my mistakes in ink for the whole world to see. Accepting the lead role in a romantic dance film was guaranteed to make me a box office hit and help me rewrite my image, until the choreographer hired to train me turned out to be the only woman I’d ever loved and lost.As beautiful and enticing as ever, Teagan walks in and reminds me of the worst mistake I’ve ever made. She should hate me, and now she has the power to destroy everything I am. Teagan Reynolds is picking up the pieces…Fool me once, shame on you. Fool me twice…never going to happen. I fell in love with Reed Scott once and it nearly killed me—literally. The last thing I want to do now is teach him how to dance, but I need this job and there’s no way I’m letting him take yet another thing away from me. Reed is in my world now, and this time we’re dancing by my rules. PRAISE FOR BARE \"Second-chance romances are my catnip, and Bare is a heartfelt and sexy story about reconnecting with the one who got away--and holding on tight. Not to be missed!\" - USA Today bestselling author Kate Meader\"Bare has everything: passion, emotion, and laughs as Robinson weaves through a story of redemption.\" - Magan Vernon, author of Straight Up Irish\"Passionate, emotional and uplifting!\" - Lauren Blakely, #1 New York Times Bestselling Author, on Nudes\"This book is exactly what I needed - a perfect blend of sex, passion, glamour, and Hollywood. I loved it!\" - Alessandra Torre, New York Times bestselling author, on Nudes",
  "genres": [
    "Romance",
    "Contemporary",
    "Contemporary Romance",
    "Audiobook",
    "Drama",
    "Second Chance Romance"
  ],
  "author": "Sarah  Robinson",
  "average_rating": "4.01",
  "url": "https://www.goodreads.com/book/show/35148429-bare"
}