{
  "title": "Outpost",
  "description": "From the bestselling co-author of the People novels comes a riveting science fiction adventure on a planet with danger around every cornerDonovan is a world of remarkable wealth, a habitable paradise of a planet. It sounds like a dream come true. But Donovan's wealth comes at a price.When the ship Turalon arrives in orbit, Supervisor Kalico Aguila discovers a failing colony, its government overthrown and the few remaining colonists now gone wild. Donovan offers the chance of a lifetime, one that could leave her the most powerful woman in the solar system. Or dead.Planetside, Talina Perez is one of three rulers of the Port Authority colony—the only law left in the one remaining town on Donovan. With the Corporate ship demanding answers about the things she's done in the name of survival, Perez could lose everything, including her life.For Dan Wirth, Donovan is a last chance. A psychopath with a death sentence looming over his head, he can't wait to set foot on Port Authority. He will make one desperate play to grab a piece of the action—no matter who he has to corrupt, murder, or destroy.Captain Max Taggart has been The Corporation's \"go-to\" guy when it comes to brutal enforcement. As the situation in Port Authority deteriorates, he'll be faced with tough choices to control the wild Donovanians. Only Talina Perez stands in his way.Just as matters spiral out of control, a ghost ship, the Freelander , appears in orbit. Missing for two years, she arrives with a crew dead of old age, and reeks of a bizarre death-cult ritual that deters any ship from attempting a return journey. And in the meantime, a brutal killer is stalking all of them, for Donovan plays its own complex and deadly game. The secrets of which are hidden in Talina Perez's very blood.",
  "genres": [
    "Science Fiction",
    "Fiction",
    "Space Opera",
    "Audiobook",
    "Horror",
    "Space",
    "Dystopia"
  ],
  "author": "W. Michael Gear",
  "average_rating": "3.88",
  "url": "https://www.goodreads.com/book/show/35134809-outpost"
}