{
  "title": "A Court of Refuge: Stories from the Bench of America's First Mental Health Court",
  "description": "The story of America's first Mental Health Court as told by its presiding judge, Judge Ginger Lerner-Wren--from its inception in 1997 to its implementation in over 250 courts across the nation As a young lawyer, Judge Ginger Lerner-Wren bore witness to the consequences of an underdeveloped mental health care infrastructure. Unable to do more than offer guidance, she watched families being torn apart as client after client was ensnared in the criminal justice system for crimes committed as a result of addiction, homelessness, and severe mental illness. She soon learned that this was not an isolated issue--The Treatment Advocacy Center estimates that in 44 states, jails and prisons house ten times as many people with serious mental illnesses than state psychiatric hospitals.In Mental Health Courts,  Judge Lerner-Wren tells the story of how the court grew from an offshoot of her criminal division held during lunch hour without the aid of any federal funding, to a revolutionary institution that has successfully diverted more than 17,000 people with serious mental illness from jail and into treatment facilities and other community resources. Working under the theoretical framework of therapeutic jurisprudence, Judge Wren and her growing network of fierce, determined advocates, families, and supporters sparked a national movement of using courts as a place of healing.Poignant and sharp, Lerner-Wren demonstrates that though mental health courts offer some relief in underserved communities, they can only serve as a single piece of a new focus on the vast overhaul of the policies that got us here. Lerner-Wren crafts a refreshing possibility for a future where our legal system and mental health infrastructure work in step to decriminalize rather than stigmatize.",
  "genres": [
    "Nonfiction",
    "Mental Health",
    "History",
    "Psychology"
  ],
  "author": "Ginger Lerner-Wren",
  "average_rating": "4.11",
  "url": "https://www.goodreads.com/book/show/35135275-a-court-of-refuge"
}