{
  "title": "The Tomb of Blood",
  "description": "Rose Foster is just starting adjust to life as a vampire when a series of highly publicized murders throws the world into chaos. Rose and her friends must intervene, if they want to prevent the imminent war between vampires and humans.But when they realize that the woman behind these murders is Alana—a vampire they believed to be long dead—intervening becomes complicated. Alana is as powerful as she is seductive. She is a master of manipulation and the queen of mind games. She craves vengeance, and she doesn’t care if she has to tear the world apart to get it. And now, she has an army.Outnumbered and overpowered, Rose accepts help from a cunning and skilled warrior by the name of Kara Unnarsdóttir. Kara is the second-in-command of the largest vampire colony in the world—the Tomb of Blood—and she offers to help Rose infiltrate the Tomb of Blood and forge an alliance with Aaron, the most ancient vampire known to exist. There’s just one problem: Kara is Alana’s lover, and Aaron is the last person in the world that should ever be trusted. No one knows who will betray whom, only that betrayal is inevitable.In this second installment of the Creatures of Darkness series, Rose will unravel more of the mystery behind what it means to be the Eklektos.—About the Creatures of Darkness Series:The Creatures of Darkness series is a dark fantasy series, centered around Rose Foster—the perpetually sarcastic, bisexual protagonist—and an unlikely group of vampires who begrudgingly try to save the world.There’s also a bit of queer romance going on in the midst of the chaos—especially once seductive, Viking warrior, Kara Unnarsdóttir, comes into the picture in The Tomb of Blood.Follow Rose and her companions as they fight to stop a nefarious plan that was set into motion thousands of years ago, and as Rose unravels the mystery of what she really is.The fourth and final book of the series, The Reign of Darkness, is available now!",
  "genres": [
    "Fantasy",
    "Lesbian",
    "Lesbian Romance",
    "LGBT",
    "Bisexual",
    "Vampires",
    "Queer"
  ],
  "author": "Britney Jackson",
  "average_rating": "4.39",
  "url": "https://www.goodreads.com/book/show/35162606-the-tomb-of-blood"
}