{
  "title": "Beginnings",
  "description": "They attack with impunity, and without prejudice.Their goal - to destroy you, from within.A merciless enemy, just one-billionth our size.WELCOME TO THE NEXT GLOBAL WARA new dystopian, post-apocalyptic fiction series from author Bobby Akart (The Blackout Series, The Boston Brahmin series and the Prepping for Tomorrow series). The events depicted in The Pandemic Series are fictional. They are, however, based upon historical fact._______________________________________________BEGINNINGS:Terrorists kidnap and blackmail a young French scientist in Western Africa. The outbreak of an ancient disease kills everyone in a village located in a remote jungle of Guatemala. U.S. government operatives uncover a secret biological laboratory in Trinidad. An isolated death at the hands of this killer virus is discovered in Greece.Is there a connection, or are these simply a string of coincidences?Dr. Mackenzie Hagan, a highly-educated, well-respected epidemiologist at the CDC-Atlanta, is called to Guatemala. As the daughter of a retired Commanding General of the United States Army Medical Research Institute of Infectious Diseases, Mac often says infectious disease is in her blood. While no infectious disease outbreak is routine, this particular hot zone in Guatemala has its own set of complications - including a mysterious operative sent there by the Department of Defense. Events unfold and Mac is sent around the world investigating new cases involving this same, rare disease.Nathan Hunter, a covert operative within an off-the-books project for the DOD, tracks down terrorists before they strike. As Hunter unravels a villainous plot with tentacles spanning the globe, his investigative path crosses with Mac's. Was it fate, or something else? Mac and Hunter work together to analyze the disease and to identify the source. But they soon learn that the biggest challenge they'll face is right at home - a government bureaucracy unwilling to sound the alarm to protect the nation.As the disease spreads and the crisis escalates, an army lurks in the shadows - one blessed by Allah, and prepared to wage the Final Jihad.This series will be frighteningly realistic. It is not intended to scare the wits out of you, but it might just scare the wits into you. Remember, it could take just one cough, one kiss, or one touch to change not only your life, but the lives of everyone around you -- forever.This is an ingenious, inventive thriller about the threats we face from a global pandemic, and the use of infectious diseases by terrorists as they wage jihad around the world. Drawing on his unique talent to place the reader in a post-apocalyptic world, Bobby Akart delivers an explosive page-turner that has you wondering - will there be a last patient?Note: The Pandemic Series does not contain strong language. It is intended to entertain and inform audiences of all ages, including teen and young adults. Although some scenes depict the realistic threat our nation faces from a worldwide pandemic, and the societal collapse which will result in the aftermath, it does not contain graphic scenes typical of other books in the post-apocalyptic genre. I believe more of our young people need to lead a preparedness lifestyle. Studies show that our millennials do not have any of the basic survival skills. By writing this series free of vulgarities and gratuitous sexual innuendo, I've intended it to be suitable for everyone. Thanks.",
  "genres": [
    "Thriller",
    "Fiction",
    "Post Apocalyptic",
    "Science Fiction",
    "Survival",
    "Horror",
    "Action"
  ],
  "author": "Bobby Akart",
  "average_rating": "4.28",
  "url": "https://www.goodreads.com/book/show/35163233-beginnings"
}