{
  "title": "Reprogram Yourself for UNSTOPPABLE Self-Confidence: Your Power Guide to Squashing Self-Doubt and Worry",
  "description": "Reprogram Yourself for UNSTOPPABLE Self-Confidence  No matter what you want to accomplish in your life, if you lack self-confidence, success may be just beyond your reach. Even the most goal-oriented and innovative people can be racked with worry, fear, and self-doubt.  As a result, they struggle to achieve their dreams or take any risks because they are so afraid of failing. You don’t have to live this way anymore because you can overcome self-doubt and worry with a little bit of hard work.  In Kristi Patrice Carter’s newest book, Reprogram Yourself for UNSTOPPABLE Self-Confidence, you’ll learn how to transform your mind-set from one of self-doubt to one of self-confidence. With Kristi’s guidance, you’ll bust through your fear and worry to become a more confident, self-assured version of yourself.  Getting to the Root of Self-Doubt  Get ready for victory with Kristi’s power guide to squashing self-doubt and worry. You’ll gain a better understanding of how low self-confidence can put your dreams on hold and what steps you can take to reprogram your thoughts.  • Understand what is at the root of your problem • Learn how to reprogram your worry and fear-based mind-set • Free yourself from denial, blame, and excuses • Identify, analyze, and recalibrate your internal critic • Achieve results and avoid common pitfalls  About the Author Kristi Patrice Carter’s mission is to help people live their best lives—one self-help book at a time. She is driven by her passion for sharing her knowledge and a hope for inspiring and empowering people around the world to achieve their life goals. A force to be reckoned with, Kristi Patrice Carter has a BA in English from the University of Illinois at Chicago, a Juris Doctorate from Chicago-Kent College of Law, and over eighteen years of writing and marketing experience. She’s also a wife, mother, author, and serial entrepreneur. Kristi has been featured in Pediatrics for Parents, Complete Woman, and on CareerBuilder.com. She has written numerous books, including: • How to Conquer Your Fears and Live an UNSTOPPABLE LIFE of Victory • Say Yes to Success Despite Your Chronic Illness • Say No to Guilt • Active Income Streams • Passive Income Streams",
  "genres": [],
  "author": "Kristi Patrice Carter",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/35157341-reprogram-yourself-for-unstoppable-self-confidence"
}