{
  "title": "Holy Crap! The World is Ending!: How a Trip to the Bookstore Led to Sex with an Alien and the Destruction of Earth",
  "description": "The ISBN 9781947119017 has been moved to the latest edition.End times are here! Now you can eat whatever you want and not care if you gain weight.Autumn, a food and wine obsessed ad executive (who for the purpose of this retelling asked to be portrayed as drool-inducing hot with kick-ass ninja skills), has just been handed the task of saving all of humanity.Here’s the deal. The president has just announced that the Earth is going to collide with a rogue moon, and in the process, our entire planet is going to be smashed to bits. As one would expect, upon hearing this news, humans went ballistic. No car was left unrolled—but oddly enough, Taco Bell remained open and made unfathomable profits in the last days. Apparently, Doritos Locos® Tacos were a popular last meal. After drinking a bottle of wine and inhaling a wheel of Brie cheese, Autumn hijacks a spaceship and races to save her fellow humans with the help of her unbelievably sexy alien boyfriend and her kleptomaniac friend with fire-retardant hair. The task is simple enough, just loot the Ark of the Covenant from a secret government bunker under a department store in Arkansas and use it to convince the entire human race to come together in one giant group hug. No problem, right? Along the way, Autumn will discover just how sheltered people are from the truth of extraterrestrials and their power to either protect us or destroy us. Stupid government.Grab a bottle of wine, a spaceship full of snacks, and prepare to take a ride on this humorous chick lit romantic sci-fi paranormal adventure. If you crave a little sexy time in your reading, are into Ancient Aliens, conspiracy theories, UFOs, are curious if we were genetically engineered (like the Sumerian cuneiform texts claim), and are dying to find out the meaning of life, then this book is for you.",
  "genres": [
    "Science Fiction",
    "Romance",
    "Paranormal",
    "Fiction",
    "Science Fiction Fantasy"
  ],
  "author": "Anna-Marie Abell",
  "average_rating": "3.67",
  "url": "https://www.goodreads.com/book/show/35158386-holy-crap-the-world-is-ending"
}