{
  "title": "Killing Rasputin : The Murder That Ended The Russian Empire",
  "description": "At last a book about the so-called “Mad Monk” of Imperial Russia that lays to rest the myths and reveals the truth about one of the most controversial characters in human history while exploring the impact his murder had on a dynasty, a people, and a country.  Written in three parts, KILLING RASPUTIN begins with a biography that describes how a simple unkempt “holy man” from the wilds of Siberia became a friend of Emperor Nicholas II and his empress, Alexandra, at the most crucial moment in Russian history. Part Two examines the infamous murder of Rasputin through the lens of a “cold case” homicide investigation. And lastly, the book considers the connection between a cold-blooded assassination and the revolution that followed; a revolution that led to civil war and the rise of the Soviet Union.  Unique about this book on Rasputin, is that the author combines Russian heritage (her parents were forced out of Russia during World War II and arrived as refugees in Australia in 1948) with medical science and legal training. Nelipa relied on Russian-language sources that she translated rather than depend on the interpretations of others. Her primary sources include police documents and witness testimonies, an autopsy report, diaries, letters and memoirs written in their native language by the participants in these historic events. Secondary sources include Russian-languages newspapers and other publications from that era. The narrative is copiously referenced and augmented with photographs (including graphic forensic photographs) and other documents, some of them published here for the first time.  Step into the imperial court of a 300-year-old dynasty in its final days with one of the most fascinating characters ever to grab our imaginations, judge whether Margarita Nelipa makes her case regarding his death, and if you agree that it was “the murder that ended the Russian empire.”",
  "genres": [
    "History",
    "Russia",
    "Nonfiction",
    "True Crime",
    "Biography",
    "Historical",
    "Romanovs"
  ],
  "author": "Margarita Nelipa",
  "average_rating": "3.44",
  "url": "https://www.goodreads.com/book/show/35166668-killing-rasputin"
}