{
  "title": "The Ice Maiden's Tale",
  "description": "Every town has an old lady all the children just know is a witch. When Johanna and Casper must spend the afternoon at her house, there’s nothing to do, except listen to a story. While the siblings await their mother’s return from the hospital where she’s visiting their ailing father, Mrs. Kinder reads them a story of adventure, magic and music.  Mrs. Kinder’s mysterious golden book tells an intertwined tale of two young men—the sensitive Sculptor who carves a beautiful woman from ice and the thieving Sorcerer searching for a spell that will bring the statue to life.  The story twists and turns, from the Frozen Forest, to the land of the Lemon Trees, to the home of the Swamp Witch, as the Sculptor’s and Sorcerer’s adventures circle each other. Their inevitable confrontation reveals buried memories that force each of them to confront the true cost of love and redemption.   The Ice Maiden's Tale the perfect story-within-a-story with magic, adventure and romance reminiscent of  The Princess Bride  for a new generation of readers.  Excerpt:   Mrs. Kinder settled herself in the chair across from the children and cracked open the book. She adjusted her spectacles, ever so slightly, then caressed the page with her wrinkled fingers.  “In our world, when magic happens outside of a storybook, we call it a miracle. And miracles are considered so rare and special that lifetimes can go by without so much as a hint of one. But there are faraway places where our kind of miracles are as common as blades of grass in an open field. In the northern region of one of these worlds, in the top far east corner, past green forests, swamps, lakes, and even an ocean, there lived a young artist named Gabriel.” ....  “This isn’t a very good story.” Casper complained.  \"Casper!” Johanna exclaimed in embarrassment.  Mrs. Kinder laughed. “That’s because I’m not even at the story part yet, but it’s high time we get started. This story doesn’t begin, the way you think it might and the way most stories do. It doesn’t begin with a big adventure or a journey, or even pirate treasure. It starts with a tiny choice—one that seems unremarkable at the time, but that changes the course of destiny. One crisp morning, our Gabriel decided to search for firewood—and it’s with that simple decision that our tale begins.”",
  "genres": [
    "Middle Grade",
    "Fantasy"
  ],
  "author": "Lisa Preziosi",
  "average_rating": "4.35",
  "url": "https://www.goodreads.com/book/show/35167967-the-ice-maiden-s-tale"
}