{
  "title": "A Year of Rhymes",
  "description": "Annie Dillard calls Bernard Cooper \"one of our most exciting new writers.\" Ann Beattie describes his work as \"dazzlingly luminous.\" Now, in an extraordinary first novel, Cooper focuses, with clarity and tenderness, on two characters introduced in his PEN/Hemingway Award-winning book, Maps to Anywhere. Bruno Schultz said that images from childhood were like \"filaments in a solution around which our senses of the world have crystalized.\" A Year of Rhymes consists of a succession of these images, these vignettes which, though limited and particular, add up to a single year, and movingly and convincingly convey an entire fictional childhood. The time is the 1950s; the place southern California. The story is told by Burt, a boy whose older brother, Bob, is a private detective who works for their father, Irving Zerkin, a divorce attorney. Their relationship is close, special, and the story is as much a mystery - though the mystery is that of sexuality - as it is a coming-of-age. Burt witnesses his brother's involvement with two girlfriends: the seductive and eccentric Marion Hirsch, whose maturing artistic ambitions and skewed humor fascinate the entire Zerkin family, and Janet Cotter, the phlegmatic but steadfast Baptist nurse upon whom the whole family depends when Bob becomes ill with leukemia. Though Burt is exposed to the vicissitudes of adult love through his brother and his parents, Burt's most compelling realization is his burgeoning physical attraction to men. He must begin to learn to negotiate his own desire in the course of this year, the final year in his brother's life. He learns that the body is both an object of desire and subject to decay. And with the help of his brother, and Marion and Janet, he must contend with the equally difficult mysteries of love and loss.",
  "genres": [
    "Fiction",
    "LGBT",
    "Queer",
    "Novels",
    "Gay"
  ],
  "author": "Bernard Cooper",
  "average_rating": "3.86",
  "url": "https://www.goodreads.com/book/show/1021928.A_Year_of_Rhymes"
}