{
  "title": "Close Encounters with Humankind: A Paleoanthropologist Investigates Our Evolving Species",
  "description": "One of Smithsonian 's Ten Best Science Books of 2018In this captivating bestseller, Korea’s first paleoanthropologist offers fresh insights into humanity’s dawn and evolution. What can fossilized teeth tell us about the life expectancy of our ancient ancestors? How did farming play a problematic role in the history of human evolution? How can simple geometric comparisons of skull and pelvic fossils suggest a possible origin to our social nature? And what do we truly have in common with the Neanderthals? In this captivating international bestseller, Close Encounters with Humankind , Korea’s first paleoanthropologist, Sang-Hee Lee, explores some of our greatest evolutionary questions from new and unexpected angles. Through a series of entertaining, bite-sized chapters, we gain fresh perspectives into our first hominin ancestors and ways to challenge perceptions about the traditional progression of evolution. By combining anthropological insight with exciting, cutting-edge research, Lee’s surprising conclusions shed new light on our beginnings and connect us to a faraway past. For example, our big brains may have served to set our species apart and spur our societal development, but perhaps not in the ways we have often assumed. And it’s possible that the Neanderthals, our infamous ancestors, were not the primitive beings portrayed by twentieth-century science. With Lee as our guide, we discover that from our first steps on two feet to our first forays into toolmaking and early formations of community, we have always been a species of continuous change. Close Encounters with Humankind is the perfect read for anyone curious about where we came from and what it took to get us here. As we mine the evolutionary path to the present, Lee helps us to determine where we are heading and tackles one of our most pressing scientific questions―does humanity continue to evolve? 17 photographs",
  "genres": [
    "Science",
    "Nonfiction",
    "Anthropology",
    "History",
    "Evolution",
    "Audiobook",
    "Nature"
  ],
  "author": "Sang-Hee Lee",
  "average_rating": "3.90",
  "url": "https://www.goodreads.com/book/show/35167705-close-encounters-with-humankind"
}