{
  "title": "Burke Davis on the Civil War: The Long Surrender, Sherman's March, To Appomattox, and They Called Him Stonewall",
  "description": "Four captivating and richly detailed Civil War histories from a New York Times–bestselling author.  Award-winning author Burke Davis writes with “an eye for narrative detail that turns history into storytelling” in these four classic Civil War narratives (The New York Times Book Review).  The Long Surrender: Though Jefferson Davis had planned to escape to Cuba after General Lee’s surrender at Appomattox Court House, a $100,000 bounty was placed on his head. This “marvelous” and “wonderfully written” account chronicles the Confederate president’s flight, capture, and imprisonment—while offering a panoramic history of the last days of the Confederacy (Denver Post).  Sherman’s March: Gen. William Tecumseh Sherman’s infamous “March to the Sea” was a crucial turning point in the Civil War. Weaving together hundreds of eyewitness accounts, this riveting history is “bound to startle and inform even students of Civil War literature” (The New York Times).  To Appomattox: Drawing on a wide array of firsthand accounts—from soldiers and commanders as well as ordinary citizens—Davis offers a “masterful” and intimately detailed account of the last nine days of the Civil War, from the Siege of Petersburg to the fateful meeting between Robert E. Lee and Ulysses S. Grant at Appomattox Court House (The Christian Science Monitor).  They Called Him Stonewall: Gen. Thomas “Stonewall” Jackson was an innovative battlefield strategist who struck terror in the hearts of Union army commanders and inspired Confederate soldiers to victory after victory in the early days of the Civil War. Based on a wealth of first-person sources, including Jackson’s private papers and correspondences, this New York Times bestseller paints “as definitive a picture of Jackson, the officer, and of his generalship, as anyone can hope to read” (Kirkus Reviews).",
  "genres": [
    "History"
  ],
  "author": "Burke Davis",
  "average_rating": "4.44",
  "url": "https://www.goodreads.com/book/show/35171827-burke-davis-on-the-civil-war"
}