{
  "title": "Too Marvellous for Words!",
  "description": "Midnight feasts in dorms, jolly japes with chums, pranks on mad teachers and no boys whatsoever: THE REAL MALORY TOWERS LIFE from award-winning writer, Julie Welch.   \n‘As we spilled from the train we could hear loud revving and smell exhaust fumes, and there in the forecourt was a coach waiting to drop us all off at our various houses. I’d been living for this moment since I’d arrived at the school; since before that. . . We were all schoolgirls everywhere, past, present and future, real and imagined. We were Darrell and her chums at Malory Towers – except the school in front of me wasn’t quite the picture I had imagined. Suddenly I had this out-of-nowhere, waking up from a coma moment, as if I had been whisked away by a tornado or washed up by shipwreck on an unknown shore. Where was I? How did I get here? I was on my own, and now I would have to survive. . .' \nToo Marvellous for Words! is the wonderfully evocative and entertaining memoir of life in an all-girls boarding school in Suffolk in the early 1960s. Award-winning writer Julie Welch remembers her time spent at Felixstowe College, a long-lost world of arcane rules and happenings, when the headmistress and the Head of Science raced each other on public roads in their sports cars, and when having meringues for birthday tea instead of plain cake was branded ‘disgraceful’. As the social morals of post-war Britain collided with those of the decadent 1960s, Julie and her fellow pupils discovered Radio Caroline, fashion and the facts of life at the same time as playing lacrosse derbies, attending classical music concerts and sea-bathing.The years spent at Felixstowe College made a lasting impression on the girls who boarded there. Amidst all the fun, deeply emotional attachments were made, with some girls – whose parents were remote or absent – finding support from their classmates that they didn't get at home.Too Marvellous for Words! is the real Malory Towers life, full of character and charm, and serviing as both a memoir and a fascinating social history of a way of English life lived by 'young ladies' some 50 years ago.",
  "genres": [
    "Nonfiction",
    "Memoir",
    "Biography",
    "Audiobook",
    "School Stories",
    "History",
    "British Literature"
  ],
  "author": "Julie Welch",
  "average_rating": "3.58",
  "url": "https://www.goodreads.com/book/show/35166885-too-marvellous-for-words"
}