{
  "title": "Markham and the Anal Probing",
  "description": "Markham and the Anal ProbingAnd then there was the day when Markham managed to get himself snatched by aliens – or so we thought at the time.I was summoned to Dr Bairstow’s office to find Markham and Peterson already present. We looked at each other.‘Any clues?’ I asked.They shrugged.‘You can go in now,’ said Mrs Partridge, so in we went.He looked up from his desk. ‘There you are.’We agreed that yes, here we were.He gestured at his briefing table on which reposed several archive boxes and a fat folder.‘The County Archivist has been good enough to make available various documents requested by Dr Dowson. A condition was that we do not expose them to the hazards of a random delivery service.’ It was not clear whether it was the company or its delivery that was random, but we nodded anyway. ‘And so, I would like you, personally, to return these valuable documents with my compliments and thanks.’He handed Peterson an envelope.‘Of course, sir.’‘This afternoon, if you please.’Peterson glanced at his watch. ‘It’s already afternoon, sir.’‘How quickly you grasp my meaning.’‘I do my best, sir.’‘I have assured the County Archivist that my best people are on the job. They being unavailable, however, I have therefore designated my Chief Operations Officer, my Head of Security and my Deputy Director to fulfil this simple task.’His Deputy Directory, Head of Security and Chief Operations Officer assembled their best air of cool professionalism – which in our case consisted of standing a little straighter and not picking our noses. I don’t think he was impressed, staring at us bleakly for a few seconds and then demanding to know why we were still here.Since Peterson was burdened with the envelope, Markham and I seized the boxes and we left with all speed.‘Right,’ said Peterson, ‘I shall assume full control of this mission.’Markham made a rude noise.‘Get changed and meet in the car park in ten minutes. That’s ten minutes, Max. No wafting around in front of mirrors trying on dresses.’Now I made a rude noise.We met in the car park, shoving Markham and the boxes in the back, and departed.‘A nice afternoon out,’ said a voice from behind the boxes, and we agreed.Now I know what you’re thinking. I can hear exactly what you’re thinking, so I will say now that the boxes were delivered on time and to the correct destination. The County Archivist herself took delivery so God knows what was in them. Peterson, after a series of nudges from me, remembered to hand over Dr Bairstow’s letter of thanks and they gave us a cup of tea. They were lovely people. I wish I worked there. We set off for the return trip, hoping to be back in time for tea, and things started to go wrong almost immediately.Peterson caught my eye. I always think that sounds as if you’ve been indulging in a quick game of eyeball tossing, but I knew what he meant‘So,’ he said, almost casually, negotiating the last roundabout out of town and accelerating away, ‘how are things with you and Hunter?’‘OK,’ said Markham vaguely. ‘I think.’‘Don’t you know?’‘Well, it’s hard to tell sometimes, but I always think if she’s not coming at me with a kidney bowl then, you know, things aren’t too bad.’‘Why would she come at you with a kidney bowl?’‘Because she can’t find a bedpan.’Peterson tried again. ‘So – got any celebrations planned then?’‘What for?’‘Well, you have an anniversary coming up.’‘What anniversary?’‘Wedding. You know. You and Hunter.’There was a long silence from the back. ‘Don’t know what you mean.’‘I worked it out,’ said Peterson in his best I’m Peterson and I’m brilliant voice. ‘I’m looking at Hunter these days and she’s looking very well, isn’t she? Blooming, almost. And she’s a very moral girl is our Hunter. Well, she has to be since you don’t have a single moral to your name, so I reckon you had the ceremony just before or just after the Battle of St Mary’s which means there’s an anniversary coming up.’There was a lot more silence from the back.‘Oh come on,’ said Peterson. ‘Admit I’m right and the then the two of us can buy you a celebratory drink in the bar.’More silence.‘I’m right, aren’t I? Go on – say I’m right.’Even more silence.‘I don’t know why you won’t admit it,’ he said, slightly exasperated. ‘Are you ashamed of something? Wait until I tell Hunter you’re ashamed of her.’He paused, hopefully.Nothing but silence.I pulled down the passenger’s sun flap and looked at the mirror. Markham was sitting with his arms folded and a stupid grin on his face.‘I reckon,’ said Peterson, ‘the two of you snuck into the Register Office without telling anyone but I’m going to make you tell me just the same.’Silence.‘Right,’ he said. ‘You asked for it. Hold on tight, Max.’We swerved off the road into a field, skidding to a halt in a shower of dust, stones and indignant birds.‘What are we doing here?’ said Markham, picking himself up off the back seat and peering out of the window.‘We’re staying here until you tell us.’ He switched off the engine and folded his arms. ‘Not another yard until you tell us the truth.’Markham folded his arms. ‘Never.’I began to make plans for spending the rest of my life in a field.The silence dragged on, only to be broken by the sounds of Markham getting out.‘Where are you going?’ I said, in some alarm. ‘We’re still not supposed to go anywhere alone.’‘Well I’m not staying here with you two maniacs. If you want to sit in a field you can do it on your own. I’m off.’We watched him walk across the field and out of the gate.‘Bollocks,’ said Peterson.‘Well, that worked, didn’t it?’‘Bollocks,’ he said again.‘Look, why don’t you just check the records at Somerset House? It’s a simple enough process.’‘That’s not the point. I want him to tell me.’I surveyed the vast, empty field. ‘How’s that working out for you?’He cursed again and switched on the engineMarkham was a couple of hundred yards up the road. We passed his plodding figure with a merry toot of the horn.‘It’s four miles back to St Mary’s,’ I said, watching him recede in the wing mirror.‘Do him good.’‘Ronan,’ I said warningly. ‘We shouldn’t leave him alone.’‘No,’ he said reluctantly. ‘You’re right. We shouldn’t.’We pulled into a layby and waited.He never came.We waited some more.‘For crying out loud,’ said Peterson. ‘I know he’s Security Section, but surely even he can’t have got lost between there and here.’I sighed. ‘I’ll go and look for him. He might just be taking a rest.’‘I’ll come with you,’ he said, getting out. ‘No one should be alone, remember?’‘Markham,’ I said accusingly. ‘We left him alone.’‘He doesn’t count.’We walked to the bend and looked. The road was empty. We could see for miles. No Markham. Not anywhere.‘Shit,’ I said. We rotated slowly. Where could he be?‘He’s cut across the fields,’ said Peterson. ‘Hang on.’ He climbed onto the car roof and surveyed the flat countryside. The flat, empty countryside.‘Shit,’ I said again, beginning to panic. ‘We’ve lost him.’‘We can’t have,’ he said, climbing down.‘Then where is he? Oh my God, we’ve lost Markham.’‘Look,’ he said. ‘The little sod’s in a ditch somewhere. Either he fell in and hurt himself – perfectly possible – or he’s hiding under a hedge to teach us a lesson. We’ll go and find him, kick the living shit out of him for frightening us like this, and then he can buy us a drink afterwards.’I looked up. It was the only direction left. ‘Do you think he’s been snatched by aliens?’‘Always a possibility,’ he said, locking the car. ‘Although if so then they’ll be returning him in a hurry any minute now.’‘No, seriously,’ I said as we set off, him on one side of the narrow lane and me on the other. I peered into ditches and looked under hedges. ‘It’s the only explanation. You hear about this sort of thing all the time. You know – anal probing.’‘For God’s sake, Max, get a grip. Why on earth would super intelligent beings cross the vastness of space just to firkle around in Markham’s bottom area. Would you?’‘God, no.’‘Well there you are, then. Anything your side?’‘Nothing. Where could he be?’‘I don’t know, but it’s four miles back to St Mary’s.’It was at that moment we heard the car start up. We stood paralysed for a moment and then Peterson screamed, ‘Bastard,’ and set off at a run. I pounded along behind him and we raced back around the bend just in time to see Markham pull out of the layby. He waved, gave us a merry toot, and sped away out of sight.We skidded to a halt.‘Didn’t you lock it?’ I said accusingly.‘Of course I did, but it’s bloody Markham, isn’t it? He could hot-wire a rock’.‘It’s four miles back to St Mary’s.’‘He’ll stop around the next bend,’ said Peterson, reassuringly. ‘He’s just teaching us a lesson.’He was and he didn’t.Four bloody miles. With Peterson vowing grim retribution with every step.And we missed tea.",
  "genres": [
    "Time Travel",
    "Fantasy",
    "Science Fiction",
    "Fiction",
    "Short Stories",
    "Audiobook",
    "Humor"
  ],
  "author": "Jodi Taylor",
  "average_rating": "4.07",
  "url": "https://www.goodreads.com/book/show/35176846-markham-and-the-anal-probing"
}