{
  "title": "Hijacked By Fear: Real Solutions for Fear, Anxiety and Increasing Confidence",
  "description": "Have you ever wanted a book that you could go to and find out exactly how to deal with your fears, anxieties, panic, and the rest of what undermines your sense of self and confidence? This is the book for you. Hijacked by Fear gives a detailed, no non-sense, step by step approach to recognizing and correcting the constructs and programs that we have been conditioned to and that operate in our brain to derail us from the potential that we all sense we have. This work is based on 40 years of careful exploration with thousands upon thousands of individuals to find what the common patterns are that we engage in our brain, the patterns that we have been inadvertently utilizing that have taken us down the wrong pathways. This work can be used as a workbook that we can apply in discovering the limiting beliefs, the false identifications, the judgement, the guilt, and the other factors that hold us back from living as fully and freely as we have so long yearned for.The perspectives engaged and the steps and solutions that are made available to you here have been used by people of all ages, educational backgrounds, and abilities. These are universal solutions that are tailored to your specific needs. Many people who have spent years and many thousands of dollars have, upon encountering these approaches, said, “I didn’t know it could be so easy. I wish I had found this in the beginning of my search.” Once these perspectives and techniques are learned, they can be applied to any area of your life. Unlike so many self-help books, every page is filled with real understandings and actual solutions. This is not just a quick read and throwaway. This is a book that you will long use and come back to again and again to find answers to other problems that may come up in your life in the future. This is a manual for how to use your brain. It shows us how to recognize the programming we currently have running, and how to change this programming in a straightforward way. This book provides the “hacks” for your brain that allow you to finally get on with doing what it is you really want to do in your life.Mark Hochwender has been counseling people in a diverse set of circumstances for almost 40 years. He has worked with individuals, couples, as well as CEO’s and C-Suites of some of the larger companies in the world. From the beginning, Mark found that his early training was helpful, but inadequate in really deeply meeting the needs of his fellow human beings. Their problems needed to be understood in a richer and fuller way. In addition, the solutions had to be practical and as direct as possible. This has led him to pursue many avenues of study and has compelled him to go beyond what he was taught. Decades of listening to the needs of people has had him continually asking, “What else would have to be going on for these problems to exist?” Mark has relentlessly pursued the answers to this question. This has led in part to the approaches that you will find in this book. He has been driven throughout his life to find a way to make a difference for other people. Mark wants people to have the tools to find their own answers.\"Mark has created what so many have tried to do but have not quite been able a self-help book that actually works! \"Hijacked by Fear\" finally addresses the root causes of fear and anxiety, giving the reader a practical understanding of these obstacles. However, more importantly, Mark shows us all how to eliminate these blocks, opening the door to the freedom and piece of mind that we all deserve. \"Hijacked by Fear\" is now required reading for all of my clients.\" -J.K. psychotherapist\"This book is a GIFT that can help each of us face and overcome our limitations, and boldly move forward to manifest more of the greatness of our being. The love and guidance that one will experience while reading each paragraph is palpable.\"-Steve P.",
  "genres": [],
  "author": "Mark Hochwender",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/35175257-hijacked-by-fear"
}