{
  "title": "Behemoth: A History of the Factory and the Making of the Modern World",
  "description": "A sweeping, global history of the rise of the factory and its effects on society. We live in a factory-made modern life is built on three centuries of advances in factory production, efficiency, and technology. But giant factories have also fueled our fears about the future since their beginnings, when William Blake called them \"dark Satanic mills.\" Many factories that operated over the last two centuries―such as Homestead, River Rouge, and Foxconn―were known for the labor exploitation and class warfare they engendered, not to mention the environmental devastation caused by factory production from the beginning of the Industrial Revolution up to today. In a major work of scholarship that is also wonderfully accessible, celebrated historian Joshua B. Freeman tells the story of the factory and examines how it has reflected both our dreams and our nightmares of industrialization and social change. He whisks readers from the textile mills in England that powered the Industrial Revolution and the factory towns of New England to the colossal steel and car plants of twentieth-century America, Eastern Europe, and the Soviet Union and on to today’s behemoths making sneakers, toys, and cellphones in China and Vietnam. The giant factory, Freeman shows, led a revolution that transformed human life and the environment. He traces arguments about factories and social progress through such critics and champions as Marx and Engels, Charles Dickens, Alexander Hamilton, Henry Ford, and Joseph Stalin. He chronicles protests against standard industry practices from unions and workers’ rights groups that led to shortened workdays, child labor laws, protection for organized labor, and much more. In Behemoth , Freeman also explores how factories became objects of great wonder that both inspired and horrified artists and writers in their time. He examines representations of factories in the work of Charles Sheeler, Margaret Bourke-White, Charlie Chaplin, Diego Rivera, and Edward Burtynsky. Behemoth tells the grand story of global industry from the Industrial Revolution to the present. It is a magisterial work on factories and the people whose labor made them run. And it offers a piercing perspective on how factories have shaped our societies and the challenges we face now. 30 illustrations",
  "genres": [
    "History",
    "Nonfiction",
    "Economics",
    "Business",
    "Technology",
    "Audiobook",
    "Politics"
  ],
  "author": "Joshua B. Freeman",
  "average_rating": "3.81",
  "url": "https://www.goodreads.com/book/show/35167677-behemoth"
}