{
  "title": "Turtles in the Road",
  "description": "Sometimes a detour takes you exactly where you need to be.  Piper Cope was so sure the Lord called her to be a pastor’s wife. So when her pastor/fiancé breaks it off, she’s every kind of puzzled. Does God even have a purpose for her anymore? On the road halfway between the bridges she’s burned and some kind of new start, she encounters the most unexpected detour. She swerves on a rainy road to miss a turtle and ends up in a ditch with an airbag to the face. Now stuck in this little town, she wonders how in the world she could’ve gotten her God-signals so very crossed. And how in the world is she supposed to know what He wants her to do now? In the meantime, at least the community center guy, Jay Marler, has her working a temporary job there. Problem is, somehow she’s coaching a children’s basketball team. She does not…basketball. And she certainly does not children.   Applause, applause for Rhonda Rhea and Kaley Rhea!  Turtles in the Road is heart-warming, inspirational and entertaining.   --Babbie Mason, award-winning singer, songwriter and author  Rhonda Rhea and daughter Kaley deliver up a fun read that tickles your funny bone and pulls at your heartstrings. With witty wisdom, the Rhea girls weave a tale that reminds readers of a powerful truth: when life doesn't turn out like you thought it would, God still has a plan. --Sharon Jaynes, best-selling author of 21 books including Take Hold of the Faith You Long For and The Power of a Woman's Words  With so much humor, Turtles in the Road unfolds how the best plan, God’s plan, might not always be the expected plan. If you have ever stood at a fork in the road and wondered, “Which way do I go?” you will enjoy this fun read. This book is for you!  --Pam Farrel, author of 45 books, including 7 SIMPLE SKILLS for EVERY WOMAN and MEN ARE LIKE WAFFLES WOMEN ARE LIKE SPAGHETTI  At last! A funny, clever, totally awesome book I can’t bear to put down. And that means a whole heap coming from a book snob like me since the looming stack of novels I’ve started but never finished threatens daily to avalanche and bury my bedroom. Turtles in the Road will not be part of the carnage. With endearingly quirky characters so easy to love, coupled with smart, contemporary dialogue and a winding plot that sucks you right in, I couldn’t give this book higher kudos. Rhonda and Kaley Rhea are two generations of WOW writers; I have just one word for them: More! --Debora M. Coty, award-winning author of over 30 inspirational books, including the bestselling Too Blessed to be Stressed series        .",
  "genres": [
    "Contemporary",
    "Christian",
    "Christian Fiction",
    "Humor",
    "Christian Romance",
    "Romance",
    "Fiction"
  ],
  "author": "Rhonda Rhea",
  "average_rating": "4.41",
  "url": "https://www.goodreads.com/book/show/35179500-turtles-in-the-road"
}