{
  "title": "The Price of Civilization: Reawakening American Virtue and Prosperity",
  "description": "For more than three decades, Jeffrey D. Sachs has been at the forefront of international economic problem solving.  But Sachs turns his attention back home in The Price of Civilization, a book that is essential reading for every American. In a forceful, impassioned, and personal voice, he offers not only a searing and incisive diagnosis of our country’s economic ills but also an urgent call for Americans to restore the virtues of fairness, honesty, and foresight as the foundations of national prosperity.As he has done in dozens of countries around the world in the midst of economic crises, Sachs turns his unique diagnostic skills to what ails the American economy. He finds that both political parties—and many leading economists—have missed the big picture, offering shortsighted solutions such as stimulus spending or tax cuts to address complex economic problems that require deeper solutions. Sachs argues that we have profoundly underestimated globalization’s long-term effects on our country, which create deep and largely unmet challenges with regard to jobs, incomes, poverty, and the environment. America’s single biggest economic failure, Sachs argues, is its inability to come to grips with the new global economic realities.Yet Sachs goes deeper than an economic diagnosis. By taking a broad, holistic approach—looking at domestic politics, geopolitics, social psychology, and the natural environment as well—Sachs reveals the larger fissures underlying our country’s current crisis. He shows how Washington has consistently failed to address America’s economic needs. He describes a political system that has lost its ethical moorings, in which ever-rising campaign contributions and lobbying outlays overpower the voice of the citizenry. He also looks at the crisis in our culture, in which an overstimulated and consumption-driven populace in a ferocious quest for wealth now suffers shortfalls of social trust, honesty, and compassion.Finally, Sachs offers a plan to turn the crisis around. He argues persuasively that the problem is not America’s abiding values, which remain generous and pragmatic, but the ease with which political spin and consumerism run circles around those values. He bids the reader to reclaim the virtues of good citizenship and mindfulness toward the economy and one another. Most important, he bids each of us to accept the price of civilization, so that together we can restore America to its great promise.  The Price of Civilization is a masterly road map for prosperity, founded on America’s deepest values and on a rigorous understanding of the twenty-first-century world economy.From the Hardcover edition.",
  "genres": [
    "Politics",
    "Economics",
    "Nonfiction",
    "History",
    "Sociology",
    "American",
    "Political Science"
  ],
  "author": "Jeffrey D. Sachs",
  "average_rating": "3.84",
  "url": "https://www.goodreads.com/book/show/12114738-the-price-of-civilization"
}