{
  "title": "How to Break Up with Your Phone: The 30-Day Plan to Take Back Your Life",
  "description": "This evidence-based, user-friendly guide presents a 30-day digital detox plan that will help you set boundaries with your phone and live a more joyful and fulfilling life.“I wrote The Anxious Generation to help adults improve the lives of children. Many readers have asked me for a version of the book aimed at helping adults and teens help themselves. Catherine Price has written the best such book.”—Jonathan HaidtDo you feel addicted to your phone? Do you frequently pick it up “just to check,” only to look up forty-five minutes later wondering where the time has gone? Does social media make you anxious? Have you tried to spend less time mindlessly scrolling—and failed? If so, this book is your solution. Award-winning health and science journalist and TED speaker Catherine Price presents a practical, evidence-based 30-day digital detox plan that will help you break up—and then make up—with your phone. The goal: better mental health, improved screen-life balance, and a long-term relationship with technology that feels good.This engaging, user-friendly guide explains how our smartphones and apps are designed to be addictive and how the time we spend on them is increasing our anxiety and damaging our abilities to focus, think deeply, form new memories, generate ideas, and be present in our most important relationships. Next, it walks you through an effective and easy-to-follow 30-day plan that has already helped thousands of people worldwide break their phone addictions and feel more fully alive. Whether you need help for yourself or for your family, friends, students, colleagues, clients, or community, How to Break Up with Your Phone is the ultimate guide to digital detoxing. It’s guaranteed to help you put down your phone—and come back to life.",
  "genres": [
    "Nonfiction",
    "Self Help",
    "Psychology",
    "Personal Development",
    "Audiobook",
    "Technology",
    "Productivity"
  ],
  "author": "Catherine Price",
  "average_rating": "3.92",
  "url": "https://www.goodreads.com/book/show/35209767-how-to-break-up-with-your-phone"
}