{
  "title": "Time of My Life",
  "description": "Jillian Westfield has the perfect suburban life straight out of the upscale women's magazines that she obsessively reads. She’s got the modern-print rugs of Metropolitan Home , the elegant meals from Gourmet , the clutter-free closets out of Real Simple , and the elaborate Easter egg hunts seen in Parents . With her successful investment banker husband behind the wheel and her cherubic eighteen-month-old in the backseat, hers could be the family in the magazines’ glossy Range Rover ads.Yet somehow all of the how-to magazine stories in the world can’t seem to fix her faltering marriage, banish the tedium of days spent changing diapers, or stop her from asking, “What if?”Then one morning Jillian wakes up seven years in the past. Before her daughter was born. Before she married Henry. Suddenly she’s back in her post–grad school Ikea-furnished Manhattan apartment. She’s back in her fast-paced job with the advertising agency. And she’s still with Jackson, the ex-boyfriend and star of her what-if fantasies.Armed with twenty-twenty hindsight, she’s free to choose all over again. She can use the zippy ad campaigns from her future to wow the clients and bosses in her present. She can reconnect with the mother who abandoned her so many years before. She can fix the fights at every juncture that doomed her relationship with Jackson. Or can she?With each new choice setting off a trajectory of unforeseen consequences, Jillian soon realizes that getting to happily ever after is more complicated than changing the lines in her part of the script. Happiness, it turns out, isn’t an either-or proposition. As she closes in on all the things she thought she wanted, Jillian must confront the greatest what-if of What if the problem was never Henry or Jackson, but her?Sharp, funny, and heartwarming, Time of My Life will appeal to anyone who has ever wanted to redo the past and will leave readers pondering, “Do we get the reality we deserve?”",
  "genres": [
    "Chick Lit",
    "Fiction",
    "Romance",
    "Book Club",
    "Time Travel",
    "Contemporary",
    "Adult"
  ],
  "author": "Allison Winn Scotch",
  "average_rating": "3.47",
  "url": "https://www.goodreads.com/book/show/3521419-time-of-my-life"
}