{
  "title": "Scroogled",
  "description": "US Department of Homeland Security has contracted Google for help in screening international arrivals at airports. Since they cannot legally obtain access to all details of data fed by a user to Google, they get it indirectly from Google - by asking it to provide all contextual ads it has shown to a certain individual!  Greg Lupinski is an ex-Google employee returning from vacation, & the new system has made him interesting to immigration security:  \"I see a heavy spike in ads for rocketry supplies showing up alongside your search results and Google mail.\" \"But the ads don't mean anything... I get ads for Ann Coulter ring tones whenever I get e-mail from my friend in Coulter, Iowa!\" \"I understand, sir... Why do you suppose model rocket ads show up so frequently?\" \"Search for 'coffee fanatics.'\" He'd been very active in the group, helping them build out the site for their coffee-of-the-month subscription service. The blend they were going to launch with was called Jet Fuel. \"Jet Fuel\" and \"Launch\"—that would probably make Google barf up some model rocket ads.  Anyway, it takes him a lot of time getting out of airport. Later, he talks to Maya, a Google colleague, & gets some dark insights. We also learn that Google security cameras at public places are used by security agencies to track suspects. Including suspects tagged on flimsy criteria like above airport dialog.  But Maya can help. She has built a kind of underground program (Googlecleaner) within Google. It normalizes the profile of an individual in various Google databases - basically tinkers data Google has been collecting about you over the years from your searches, visits to sites that show Google Ads, Orkut activity, & other Google properties. When done, you look like an angel of virtue!  Some days later, a very worried Maya visits Greg. She is leaving the country & wants Greg to come. Looks like someone has found her underground program, has cleaned profiles of some elected officials in Washington, & she is now a marked woman. Greg wishes her luck; he himself will stay.  Some days later, he gets visitors late at night - threatening him. Turns out they are not cops, but from Google's lobby firm. He has options - either go to jail for 10 years for tinkering with Google's data! Or cooperate & again become & employee of Google, & help turn Googlecleaner into something security people will be using more often!",
  "genres": [
    "Science Fiction",
    "Short Stories",
    "Fiction",
    "Dystopia"
  ],
  "author": "Cory Doctorow",
  "average_rating": "3.60",
  "url": "https://www.goodreads.com/book/show/35215199-scroogled"
}