{
  "title": "Cherished",
  "description": "\"Of the 3 books in the series, this one is my favorite!\" - Reads and Reels\"Amazing story that continues to grip and entice the reader.\" - The Archeolibrarian\"Chemistry is there from the start...I really enjoyed the romance.\" - Functioning Insanity ReviewsFor Elea, there’s never been a better time to turn away from witch life. The Tsar is in exile. The Vicomte is dead. And Rowan? Falling for him only broke her heart. Instead of casting spells, Elea spends her days running Braddock Farm and enjoying the flirtations of the very handsome and non-magical Philippe. Everything is going perfectly, except for one problem.Someone’s trying to kill her.Shujaa is a Changed One, a Creation Caster mage whose mutated form makes him invincible in battle. Now that the Tsar and Vicomte are gone, Shujaa wants to rise and rule. To do so, he must eliminate all those powerful enough to oppose him, and Elea is top on his list. Anyone who offers her aid quickly ends up dead.In the end, there’s only one person who can keep Elea safe while helping her defeat Shujaa: Rowan. Like it or not, Elea must team up with her old love. With Philippe along for the ride, Elea plans to team with Rowan without losing her heart this time. But that’s when all her plans fall apart…\"My favorite part of this series is the attraction between Rowan and Elea. They have a forbidden romance that I'm addicted to.\" - Cloud 9 BooksPerfect for readers who love sword and sorcery filled with magic, necromancy, witches and wizards. This series combines fierce females, paranormal romance and epic fantasy. Enjoy! BEHOLDER series order1. Cursed2. Concealed 3. Cherished4. Crowned5. CradledRead all the series from author Christina Bauer: - Angelbound (YA Dark Fantasy)- Beholder (YA Dark Fantasy) - Dimension Drift (YA Urban Fantasy )- Fairy Tales of the Magicorum (YA Urban Fantasy)- Pixieland Diaries (YA Fantasy)",
  "genres": [
    "Fantasy",
    "Romance",
    "Young Adult",
    "New Adult",
    "Paranormal",
    "Magic"
  ],
  "author": "Christina Bauer",
  "average_rating": "4.11",
  "url": "https://www.goodreads.com/book/show/35220026-cherished"
}