{
  "title": "The Field of Blood: Violence in Congress and the Road to Civil War",
  "description": "In The Field of Blood, the historian Joanne B. Freeman offers a new and dramatically rendered portrait of American politics in its rowdiest years. Drawing on an extraordinary range of sources, she shows that today's hyperpolarized environment cannot compare with the turbulent atmosphere of the decades before the Civil War, when the U.S. Congress itself was rife with conflict. Legislative sessions were routinely punctuated by mortal threats, canings, flipped desks, and all-out slug-fests. Congressmen drew pistols and waved bowie knives at rivals. One representative even killed another in a duel. Many were bullied in an attempt to intimidate them into compliance or silence, particularly on the issue of slavery. These fights didn't happen in a vacuum. Freeman's accounts of fistfights and threats tell a larger story of how bullying, brawling, and the press - and the powerful emotions they elicited - raised tensions between North and South and fueled the coming of the war. In the process, she brings the antebellum Congress to life, revealing its rough realities - the feel, sense, and sound of it - as well as its nation-shaping import. Funny, tragic, and rivetingly told, The Field of Blood offers a front-row view of congressional mayhem and sheds new light on the careers of luminaries such as John Quincy Adams and Thomas Hart Benton, as well as introducing a host of lesser-known but no less fascinating characters. We see slaveholders silence Northerners with threats and violence. We learn how newspapers promoted conspiracy theories that helped polarize the nation. And we witness an entire legislative chamber erupt into a massive fist-throwing, spittoon-tossing battle royal. By 1860, armed congressmen, some carrying pistols sent by their constituents, fully expected bloody combat in the House. In effect, the first battles of the Civil War were fought in Congress itself. The Field of Blood demonstrates how a country can come apart as conflicts over personal honor, party loyalty, and moral principle combine and escalate. The result is a fresh understanding of the workings of American democracy and the bonds of Union on the eve of their greatest peril.",
  "genres": [
    "History",
    "Nonfiction",
    "Politics",
    "American History",
    "Civil War",
    "Audiobook",
    "War"
  ],
  "author": "Joanne B. Freeman",
  "average_rating": "4.09",
  "url": "https://www.goodreads.com/book/show/35224674-the-field-of-blood"
}