{
  "title": "A Clock Without Hands",
  "description": "“I want to turn back the hands on the clock and change it all, make it different; three friends who meet up by chance in an old city and share a beer and laugh at old stories and jokes. But it wasn’t like that; and the clock has no hands, so I can’t turn them back.” [p.171]Alex Carlise has returned to a place he thought he’d never see again, outside of his dreams. As he walks the ochre-dusted road to the house in which he grew up, the memories of his young life in a small Italian town push all other thoughts out of his thoughts about the major exhibition of his artwork opening soon in London, thoughts of the myriad things he should be doing in preparation–everything subsides to make room for the warm flood of a time long past.When he opens the door to the now-deserted house, he is suddenly seven again. There is Jamie, his first friend, his best friend; Anna, his first love; and the delicious days they spent exploring the valley and swimming in the cerulean blue Mediterranean Sea. It all comes back to Alex in a way he can neither control nor discern. But the memories are insistent, demanding. Soon Alex loses entire hours to the past, overwhelmed by the haunting memories of a youth turned tragic.Alex remembers the day he, Jamie, and Anna went to their favorite place, an abandoned church far up in the hills. There they stumbled upon a man, injured and sick. From this discovery, a series of events tumbled forth that would change them all forever. Alex now realizes that he must confront the truth about himself, about the echoes of the past that still haunt him, and about the friends whose legacy has meant only devastation.Guy Burt’s vision of youth is piercingly accurate, and his sense of how time can play tricks on the mind is startling. Haunting, eerie, and remarkably assured, The Clock Without Hands will resonate with the child that hides inside your own memories.",
  "genres": [
    "Fiction"
  ],
  "author": "Guy Burt",
  "average_rating": "3.83",
  "url": "https://www.goodreads.com/book/show/352204.A_Clock_Without_Hands"
}