{
  "title": "Pacific Coast Academy: Jaxon & Shianne",
  "description": "ShianneAs I jog past I try not to act interested and I am secretly congratulating myself for pulling it off. Because of my disinterested attitude, I completely miss seeing the football flying towards my head. The next thing I know I am being held in the strongest arms as we crash to the ground. He has me completely protected as we land, roll and stop with me and the football on top of him. I open my eyes and see the most beautiful turquoise blue eyes staring at me. O my stars…I have fireworks going off in my gut.This is the closest I have ever been to a guy and I can feel all of him. My ear buds were pulled out of my ears so I can hear his friends whistling and carrying on. The sound of them brings me back to reality and I can feel myself blushing bright red. Deciding to be bold, I stand and reach out a hand to help him up. Of course, this makes hotty gods crew laugh obnoxiously. Hotty god is huge and at least 6’3 compared to me barely reaching 5 foot. When he takes my hand, I swear fire shoots through my body and I can feel myself blushing again. Once he is standing he gives me a flirty wink which does all sorts of things to me. Never breaking eye contact I put my ear buds back in and take off jogging again as if he had no effect on me… Yea right!JaxonI noticed her first. However, with that tight, tiny, tan body and head full of thick, long honey blonde hair it doesn’t take long for the rest of my crew to notice her. We usually hang out on the beach most evenings tossing the football and see the same people jogging by. She is definitely someone new. My brother Riley hollers at me. When I look at him he gives me a smirk and tells me to go long. Hell yea! I like how my bro thinks!Riley’s aim is a little too good. I thought he would throw the ball in front of her so I could see her face to face and maybe say hi. But no, he throws the ball right at her head. What else could I do but save her.When we land with her laying on top of me my body automatically begins to react. I am hypnotized by her jade green eyes, and full pouty lips… and then she blushes. I haven’t seen a girl blush like that since grade school. She is the most refreshing, beautiful girl I have ever seen. She hops up off me quickly and tries to cover her embarrassment by sticking her hand out to help me up. This is just funny and I can hear the guys laughing. She is so tiny I could bench press her with one arm.",
  "genres": [],
  "author": "Chloe Michelles",
  "average_rating": "4.16",
  "url": "https://www.goodreads.com/book/show/35219895-pacific-coast-academy"
}