{
  "title": "Links",
  "description": "♥ A former ugly duckling has a chance encounter with her unrequited high school crush, now a pro golfer. Will their past thwart a second chance at love? ♥ If you love second chance romances, swoon worthy pro athletes, smart and witty female leads and happily ever afters, find it on Amazon or read for free with Kindle Unlimited.“Witty, heartfelt and emotionally satisfying. Everything I want in a second chance romance! Once I picked it up I couldn't put it down!\" NY Times bestselling author Rachel Van Dyken ♥ ♥ ♥ ♥ ♥ ♥ ♥ ♥ ♥ ♥ ♥ ♥ ♥ ♥ ♥ ♥ ♥ ♥ ♥ ♥ ♥ ♥ ♥ ♥ ♥ ♥ ♥ ♥ ♥ ♥ ♥ ♥ ♥ Charlotte Windham went through a typical ugly duckling phase in high school while harboring a crush on Garrett Stephens, the school's athletic heartthrob. Today she’s a bestselling novelist and no longer “Glasses,” the humiliating nickname Garrett gave her.Garrett transformed from teen heartbreaker to adult lothario and is now a successful professional golfer suffering from a possible career-ending injury.Fifteen years after high school, Charlotte and Garrett have a chance encounter at a Los Angeles restaurant, and he can’t remember who she is.Can Charlotte forgive Garrett for his past ways, and more recent Don Juan lifestyle? Can Garrett change his ways for a second chance with Charlotte, who may just be perfect for him? ♥ ♥ ♥ ♥ ♥ ♥ ♥ ♥ ♥ ♥ ♥ ♥ ♥ ♥ ♥ ♥ ♥ ♥ ♥ ♥ ♥ ♥ ♥ ♥ ♥ ♥ ♥ ♥ ♥ ♥ ♥ ♥ ♥ \"A second chance romance at its finest.. sweet, alluring, fun, sexy and romantic. This story is definitely on my top faves list for 2017. \" Sassy Book Lovers “Simply put, Links will make you fall in love.” The Book Blvd. “I love everything Lisa Becker has ever written! Her Click series was one of the most original and creative series I’ve ever read. And now I am equally in love with Links. 5 Stars” The Caffeinated Diva Reads",
  "genres": [
    "Romance",
    "Sports",
    "Second Chance",
    "Friends To Lovers",
    "Audiobook",
    "Contemporary Romance",
    "Sports Romance"
  ],
  "author": "Lisa Becker",
  "average_rating": "3.57",
  "url": "https://www.goodreads.com/book/show/35235649-links"
}