{
  "title": "The Crush",
  "description": "Fletcher Grant could have anything he wanted. Except his assistant. But, good lord, he really wanted his assistant.   “What can I get started on?” Rhys asked as he stopped in front of Fletcher’s desk. He was wearing a soft blue cashmere cardigan with a zippered front, a white and blue pinstripe shirt and grey trousers. The outfit made his pale blue eyes even lighter and he was growing out his beard again. His inky black hair, thick eyelashes and playful grin made him dreamily mischievous. Fletcher realized he was staring and cleared his throat as he reached for his coffee. He sipped then coughed softly.  “Sorry. I was prioritizing,” he said as he tapped his forehead. “Send the preliminaries out of Hong Kong to Jim, please. He wants us tracking those closely,” he added and Rhys grinned as he walked backwards toward the door.  “I’ll have those right out and then I’ll get the data from the last quarterly report,” he said then saluted as he turned. His sleeve pulled and Fletcher caught a peek of a forearm tattoo and his body tightened as he ached to know how many tattoos Rhys had. He’d had several dreams about peeling away Rhys’ clothes and revealing his skin. “Holler if you need anything, Fletch!” He called and Fletcher sighed as he reclined in his seat and stretched his hand across his brow.  The only person who could get away with calling him Fletch was Rhys. He hated it, except when he heard Rhys say it. When Rhys said it, it made him feel like they were just a little more intimate. Not in an unprofessional way, of course. But more like they had a relationship outside the office. As much as Fletcher was in love with Rhys, he would never act on it. The idea of mixing his personal romantic life with his professional work life made Fletcher uncomfortable.  And there was the whole Zane thing. Zane Weatherly was a colossal asshole. If regular assholes were human assholes, Zane would be a blue whale’s asshole. He was that much more of an asshole. Fletcher did a Google search to see which animal had the largest asshole, just so he could accurately compare Zane to the rest of humanity’s assholes. He was also Rhys’ boyfriend.    Life was going really well for Rhys Patterson. He had a tiny yet comfortable apartment in New York City, a gorgeous boyfriend and he'd lucked his way into a great job as assistant to one of the most powerful men in the city. His boss was also the most beautiful man Rhys had ever laid eyes on. Which was a blessing and a curse.   “Not as smart as you or Mr. Perfect,” Zane said as he waved at the building. Rhys looked away so Zane couldn’t see him wince. Fletcher was perfect. From the top of his never-a-hair-out-of-place head to his miraculously chiseled face to what was undoubtedly a flawless body beneath his obscenely expensive tailored suits down to his handmade Italian leather shoes. Jesus, you could use his jaw and cheekbones to hang your shelf straight and he had shoulders like truck bumpers. That was the most masculine sentence to ever cross his mind.  “Shut up,” Rhys said as he pushed Zane toward the doors with his elbow. He was holding two coffee cups and he needed Zane to open them. “I feel a little bad for him. He seems lonely,” he said under his breath as they passed the security guards at the front desk.  “Maybe you should date him,” Zane muttered as he pressed the button for the elevator. It was an utterly stupid thought but it made Rhys’ stomach tickle. Men like Fletcher didn’t date men like Rhys. He was the sort of man who’d date a progressive and quietly out gay politician or an uber wealthy yet internationally respected and adored philanthropist. If he was gay. Which he wasn’t.",
  "genres": [
    "M M Romance",
    "Romance",
    "Contemporary",
    "LGBT",
    "Gay",
    "Erotica"
  ],
  "author": "K. Sterling",
  "average_rating": "3.77",
  "url": "https://www.goodreads.com/book/show/35236108-the-crush"
}