{
  "title": "Tin Moon: A Southern Coming-of-Age Saga",
  "description": "\"TIN MOON\" presents a haunting tale of family, ruin, and self-reflection.Life in Granville County is upended when Nora marries a handsome stranger to escape her demanding family. As she strives to conform to the expectations of an early twentieth-century wife and daughter in the American South, she struggles to maintain a meaningful relationship with her parents following the suspicious disappearance of her younger sister, Shailene.Stricken with grief, Nora realizes that a life lived truly doesn't come without a good deal of tears and determination.While cultivating unconventional friendships and caring for an ailing husband, clues soon emerge, leading Nora down a murky path of family secrets, embroiled in the worst kind of theft. She is driven closer to the truth—closer to the hands of death.And to the man calling her name.Follow Nora through a decade of deceit, heartache, and profound devotion as she discovers that ninety pounds can sink a man in more ways than one. Will it be her undoing or her salvation?Had you asked me before I married Rathe—before she left us—what my world was like, I would have said that God shaped the moon in the likeness of Shailene's full cheeks. I would have been careless not to mention the delicate touch of her fingers on the material she so often sewed with Momma in the glorious light of the front window. How her giggle extracted a shadow of a smile from our daddy whenever I whispered something terrible under my breath.Shailene and I spent our nights counting stars, wishing on the ones we believed were most overlooked. When the world flipped inside out, it stole Shailene and all of those stars, leaving me in a frightful darkness. I became a different person without a moon for balance.I became a different person when the truth found me...This is a wonderful coming of age story of a feisty main character and her life. It's a story of love, extreme friendship and family set in beautiful surroundings. ~Susan Roberts, Vine Voice\"The protagonist's voice was so unique, vivid and 'real' that I found I wanted to know her story... I loved the world I found myself in.\" ~Nhys Glover, Historical Romance Author",
  "genres": [],
  "author": "Blakely Chorpenning",
  "average_rating": "4.29",
  "url": "https://www.goodreads.com/book/show/35230684-tin-moon"
}