{
  "title": "Pale Rider: The Spanish Flu of 1918 and How It Changed the World",
  "description": "With a death toll between fifty and one hundred million people across the globe, the Spanish flu of 1918-1920 was one of the greatest human disasters of all time. Nevertheless, it exists in our memory as a mere footnote to World War IIn Pale Rider, Laura Spinney recounts the story of this overlooked pandemic, tracing it from Alaska to Brazil, from Persia to Spain, and from South Africa to Odessa. Through the point of view of those who lived through it, she shows how the flu was shaped by the interaction of the virus with the humans it encountered and how this devastating natural experiment put both the vulnerability and the ingenuity of mankind to the test. Drawing on the latest research in history, virology, epidemiology, psychology, and economics, Laura Spinney narrates a catastrophe that changed humanity for decades to come. In doing so, she reveals that the Spanish flu was as significant--if not more so--as the two world wars in shaping the modern world by disrupting, and often permanently altering, global politics, race relations, family structures, and ingenuity across medicine, religion, and the arts.  With a death toll between fifty and one hundred million people across the globe, the Spanish flu of 1918-1920 was one of the greatest human disasters of all time. Nevertheless, it exists in our memory as a mere footnote to World War I.In Pale Rider, Laura Spinney recounts the story of this overlooked pandemic, tracing it from Alaska to Brazil, from Persia to Spain, and from South Africa to Odessa. Using firsthand accounts, Spinney's vivid narrative shows how the Spanish flu evolved as a result of the humans it encountered and how this devastating virus exposed our vulnerability and put the ingenuity of mankind to the test.Drawing on the latest research in history, virology, epidemiology, psychology, and economics, Laura Spinney narrates a catastrophe that changed humanity for decades to come. In doing so, she reveals that the Spanish flu was as significant--if not more so--as the two world wars in shaping the modern world by disrupting, and often permanently altering, global politics, race relations, family structures, and ingenuity across medicine, religion, and the arts.",
  "genres": [
    "History",
    "Nonfiction",
    "Science",
    "Medicine",
    "Medical",
    "Audiobook",
    "Health"
  ],
  "author": "Laura Spinney",
  "average_rating": "3.91",
  "url": "https://www.goodreads.com/book/show/35237941-pale-rider"
}