{
  "title": "Because You're Mine",
  "description": "A dark mafia romance novel with a bonus story by USA Today Bestselling Author Nikita Slater. Because You're Mine...Her knight in shining armour or her kidnapper?Allie has loved Jay forever. But he sent her away when she was eighteen and forced her to live her own life, away from the street and the gangs. Away from him. It had hurt, but she’d done it. For ten years she'd built a career and a life separate from him. Now he's back and he wants what belongs to him.Furious that Allie was hurt while out of his protection, Jay decides it's time to bring the woman he loves home where she belongs. Whether she wants to come or not. He whisks her off to his mountain fortress where she'll be safe and sets about arranging a new life for her. A life with him. He's done lurking in the shadows, watching but never touching. She was always his. The difference is, now she knows it.Will Allie quietly accept her new life and let her old one go? Or will she fight the man she's loved her entire life because she can't risk losing herself again...This 48,000 word book is standalone and guaranteed HEA, NO cheating, NO cliffhanger. Just a hot alpha male who knows what he wants! Sizzling dark mafia romance. Read at your own risk!BONUS STORY!Mine to Keep...Veronica has always been a good girl.She's always listened and done what men wanted. It was easier that way. Less pain, easier to get what she needed to survive. Then a boy rescued her. Now her protector, the boy who saved her is giving her away. Handing her over to another man. To him. Robert of Senator Security.She wants to run away from the man who keeps touching her, the man who brings back the pain and the memories. He follows her, protects and hunts her with possession in his eyes. He demands she belong to him and him alone. But Veronica doesn't want to be an obedient girl anymore.She wants to be the bad girl she was born to be... and set the woman free.Please This 32,000 word novella can be read as standalone or after Because You’re Mine, as this love story takes place about 7 years before Allie and Jay’s romance. Guaranteed HEA, NO cheating, NO cliffhanger. Sizzling romance novella!",
  "genres": [
    "Contemporary",
    "Dark",
    "Dark Romance",
    "Romance",
    "Contemporary Romance",
    "Erotica",
    "Friends To Lovers"
  ],
  "author": "Nikita Slater",
  "average_rating": "3.77",
  "url": "https://www.goodreads.com/book/show/35254945-because-you-re-mine"
}