{
  "title": "Bringing Down the Colonel: A Sex Scandal of the Gilded Age, and the \"Powerless\" Woman Who Took on Washington",
  "description": "The woman--and her illicit affair--that rocked Victorian AmericaWhen Madeline Pollard was a teenager, she began an extended affair with the Kentucky Congressman William Breckinridge, one of the most influential men in America. Breckinridge was married, and he once declared women's chastity \"the cornerstone of human society.\" He seduced Pollard, and when his wife died, he asked for her hand. After a decade-long affair, they were to be married--but then Breckinridge broke off the engagement and suddenly married another woman.In 1893, Pollard sued Breckinridge for breach of promise, and their affair--in all its indecorous detail--became shockingly public. With premarital sex considered irredeemably ruinous for a woman, Pollard was asserting the unthinkable: that the sexual morality of men and women should be judged the same way. In court, she said, \"I'll take my share of the blame. I only ask that he take his.\" The sensational five-week trial woke Victorian women up to the harsh injustice of double standards. And, surprisingly, Pollard won.Nearly 125 years after the Breckinridge-Pollard scandal, we're still obsessed with sexual morality and the role women play in maintaining it. From concern about the decline of marriage and the rise of \"hook-up\" culture to battles over contraception and abortion, the underlying concern is the regulation of appropriate sexual behavior for women. Bringing Down Breckinridge is the story of one of the earliest women to take a stand against that regulation. Using trial transcripts, newspaper coverage, personal journals, and letters, the journalist Patricia Miller chronicles the fascinating and virtually unknown Pollard-Breckinridge trial, arguing for its rightful place within the history of women's rights.",
  "genres": [
    "History",
    "Nonfiction",
    "Feminism",
    "True Crime",
    "Biography",
    "Politics",
    "American History"
  ],
  "author": "Patricia  Miller",
  "average_rating": "4.02",
  "url": "https://www.goodreads.com/book/show/35259565-bringing-down-the-colonel"
}