{
  "title": "What They Don't Know",
  "description": "What they don’t know can’t hurt them…or can it?  In the year 2030, the government has seized control of healthcare. Routine treatment is administered to patients and monitored via in-home telemedicine. Hospitals have been replaced by Centers for Standardized Medicine (CSM). No one is a bigger proponent of the changes than reporter Cheyenne Rose, who lost her mother shortly after the Healthcare Crash of 2018 and her fiancé ten years later after a freak accident.  Despite her incredible success and popularity, her life feels empty. Then she meets the Reid family and feels drawn to their simple and honest love for each other. When eight-year-old Ridge Reid’s younger brother develops kidney failure, he agrees to donate one of his kidneys to save his brother’s life. But Ridge unexpectedly dies on the table, and the doctor who performed the surgery vanishes.  Faced with a conspiracy that runs far deeper than a single surgery, Cheyenne finds herself thrust into a dangerous investigation. Her informants start turning up dead, and she realizes the people responsible will do almost anything to keep their secret. Cheyenne will risk everything to uncover the truth.  \"An exciting adventure into the world of futuristic medicine where nightmarish consequences await. There are clever and unexpected twists and turns, mixed in with murder and romance, and believable characters that command our sympathies.\" - Leonard Goldberg, author of The Daughter of Sherlock Holmes  “This propulsive, dystopian thriller thrusts you into a terrifying, futuristic medical world, and leaves you with an ending you’ll never forget.” - Sandra Block, author of The Girl Without a Name  \"Down a dark rabbit hole we go, following headstrong Cheyenne Rose and her need for the truth. This suspenseful tale is an anticipatory tale as much as it is a thriller. Intriguing and compelling, the story dares us to consider what kind of medical care we want for our nation and what we're willing to sacrifice to have it.\" - Nadia Hashimi, author of International Best-Seller, The Pearl that Broke its Shell",
  "genres": [],
  "author": "K.V. Scruggs",
  "average_rating": "4.48",
  "url": "https://www.goodreads.com/book/show/35261585-what-they-don-t-know"
}