{
  "title": "Daily Writing Resilience: 365 Meditations & Inspirations for Writers",
  "description": "Chances are, whether you're a seasoned author or an aspiring scribe, you've grappled with your share of rejection, setbacks, and heartbreak. However, literary agents say the number one key to writing success is perseverance in the face of disappointment. Daily Writing Resilience provides advice, inspiration, and techniques to help you turn roadblocks into steppingstones. You'll find tips and support through exercises such as meditation, breath work, yoga, stress management, gratitude, de-cluttering, sleep, exercise, mindful eating, and more. These 365 meditations will help you navigate the ups-and-downs of your writing practice, creating positive habits that will guide you toward the success and fulfillment that you've been seeking. Praise: \"This must-have collection of inspirational nuggets will nudge you free of writer's block. Even if you're not blocked, a morning commune with some of writing's great minds will put you in the right creative space.\"―Sara Gruen, #1 New York Times bestselling author of Water for Elephants \"Every person with that little voice in their head―the one that tells them to write everyday―must own this book. Every page is full of hope and reality, just what we all need to keep us going.\"―Steve Berry, New York Times and # 1 Internationally bestselling author of The Patriot Threat \"For every type of writer―new, old, fresh, tired, impassioned, cynical, hopeful . . . this gem is flat out inspiring.\"―M.J. Rose, New York Times bestselling author of The Secret Language of Stones \"Bryan Robinson's Daily Writing Resilience is not only wise but also marvelously practical. The daily mantras he offers, taken from the experiences of those who've kept to the path, will provide much needed encouragement along the way. Take this book to heart, and then take it with you wherever you go.\"―William Kent Krueger, New York Times bestselling author of the multi-award winning Ordinary Grace and the Cork O'Connor series \"You don't have to be a writer to treasure Daily Writing Resilience , a unique and uplifting meditation book. It's chock-full of insights so profound you'll be tempted to gobble it up in one bite!\"―Cassandra King, author of The Sunday Wife and Moonrise \"I urge both fledgling and experienced writers to get their hands on Daily Writing Resilience and keep it nearby for handy reference. Bryan Robinson knows his way around the head and heart of the working writer, and this book is a wonderful companion and a balm to the writer's soul.\"―John Lescroart, New York Times bestselling author \"At last! A real tool for real writers, a reference book that should be on every writer's desk next to their Thesaurus and Strunk & White Elements of Style . A practical guide that can be used as a daily devotional or motivational tool to hold your hand, to guide you, to encourage you, and to pull you back from the ledge.\"―Karen White, New York Times bestselling author of Flight Patterns A 2018 Killer Nashville Silver Falchion Award Finalist A 2018 Top Shelf Magazine Indie Book Award Finalist",
  "genres": [
    "Writing",
    "Nonfiction",
    "Self Help",
    "Inspirational"
  ],
  "author": "Bryan Robinson",
  "average_rating": "4.18",
  "url": "https://www.goodreads.com/book/show/35260160-daily-writing-resilience"
}