{
  "title": "The English Proposal",
  "description": "Surrender to destiny: a window to the heart opens, when one door closes.  To follow the heart or the head—torn between two men—which future will Lady Margaret choose? Profoundly romantic and superbly riveting, The English Proposal explores the conflict between fulfilling duties and satiating desires.  The English Proposal (Book 1). Sheltered on her family’s country estate, Lady Margaret, the daughter of an English Earl, is betrothed due to a family promise. Although Henry, the Viscount Rolantry, has been her best friend since childhood and she is expected to marry him, she never felt butterflies until she meets the Duke of Witherton. Against her father’s wishes, Margaret finds herself captivated by the forbidden duke. Caught between family loyalty and her own wishes, Margaret searches for a way to satisfy both her responsibilities and her longings. When tragedy strikes, Margaret finds herself seeking answers at church. But when she finally makes her choice, through her newfound faith, will she be able to live with the repercussions of her decision?  Window to the Heart Saga: a recountal of the epic journey of Lady Margaret, a young English noblewoman, who through many trials, obstacles, and tragedies, discovers her own inner strength, the sustaining force of faith in God, and the power of family and friends. In this three-part series, experience new places and cultures as the heroine travels from England to France and completes her adventures in America. The series has compelling themes of love, loss, faith and hope with a exceptionally gratifying conclusion.   Window to the Heart Saga Book 1: The English Proposal Book 2: The French Encounter Book 3: The American Conquest Releasing in May-June-July 2017",
  "genres": [
    "Christian",
    "Romance",
    "Historical Fiction"
  ],
  "author": "Jenna Brandt",
  "average_rating": "4.09",
  "url": "https://www.goodreads.com/book/show/35257348-the-english-proposal"
}