{
  "title": "Greenstone",
  "description": "Experience a world where magic and friendship intertwine in Greenstone, the captivating third installment of The Ammolite Adventures. Join Emily and her loyal bondsmate, Xena, on an exhilarating journey that will test their bonds and ignite the flames of romance.Having traversed the portal to the parallel planet of Acacia, Emily longs to share the wonders of this enchanted realm with her friends from Earth. In Greenstone, she seizes the opportunity to introduce them to Acacia's heightened senses and exhilarating experiences. As their senses become attuned to the vibrant energy of the world, new friendships are forged, and the possibilities for romance with Luke begin to blossom.But the allure of Acacia proves irresistible to Emily's friends, who decide to embark on an extraordinary adventure of their own. Led by a shared determination to unite the warriors of the Javan with the forces of Angkor and the elves, they set off on a perilous journey across a treacherous desert. Their goal: to rally the Javan warriors and join forces in a dragon war that will determine the fate of Acacia.As alliances are forged and destinies intertwine, Greenstone immerses readers in a realm of epic proportions. In a land where dragons soar and magic weaves its intricate tapestry, Emily and her companions face thrilling challenges and discover the true strength of their bonds. Amidst the shifting sands and swirling forces of destiny, they must navigate the complexities of love, loyalty, and the ultimate battle for the fate of Acacia.With its vivid world-building, heart-stirring romance, and pulse-pounding action, Greenstone invites readers of all ages on a mesmerizing adventure. Join Emily and her friends as they navigate a landscape brimming with wonder, danger, and the transformative power of friendship. Discover the heights love can reach and the sacrifices that must be made as the fate of Acacia hangs in the balance.",
  "genres": [
    "Young Adult",
    "Fantasy",
    "Science Fiction"
  ],
  "author": "C.E.  Johnson",
  "average_rating": "4.81",
  "url": "https://www.goodreads.com/book/show/35251468-greenstone"
}