{
  "title": "Inspired: How to Create Tech Products Customers Love",
  "description": "Как известно, существует большая разница между тем, как создают свои продукты самые успешные компании и как это делают все остальные. Многие производители стремятся выпускать привлекательные товары. Однако большая часть произведенной продукции не удовлетворяет спрос потребителей, потому что до сих пор применяются старые и неэффективные способы определения характеристик и создания продуктов.Автор делится собственным опытом и техниками, используемыми в работе с самыми известными компаниями в области высоких технологий. Вы узнаете, как ведущие мировые корпорации создают свои лучшие продукты и каким образом можно использовать их опыт.Книга помогает усвоить главное: как бы хороша ни была ваша команда разработчиков - это не имеет значения, если ей не дают работать над тем, что достойно разработки. Совсем недостаточно просто хорошо трудиться, проектируя продукт. Важно убедиться в том, что этот продукт полезен, удобен в использовании, и его можно воплотить в жизнь.Книга адресована руководителям и собственникам компаний, ведущим инженерам и дизайнерам, разработчикам программных продуктов - всем, кто принимает участие в процессе управления продуктом и создания того, в чем люди действительно будут нуждаться.Благодаря информации, собранной в книге, менеджеры по маркетингу продукта и руководители проектов различных отделов производственной организации научатся правильно определять, что именно хотят получить покупатели.Издание станет полезным для команд разработчиков, занимающихся запуском новых проектов. Методы, представленные в книге, позволят вам создавать абсолютно новые продукты-хиты или совершенствовать уже существующие товары.",
  "genres": [
    "Business",
    "Nonfiction",
    "Design",
    "Technology",
    "Management",
    "Entrepreneurship",
    "Leadership"
  ],
  "author": "Marty Cagan",
  "average_rating": "4.24",
  "url": "https://www.goodreads.com/book/show/35249663-inspired"
}