{
  "title": "The Unlikely Disciple: A Sinner's Semester at America's Holiest University",
  "description": "As a sophomore at Brown University, Kevin Roose didn't have much contact with the Religious Right. Raised in a secular home by staunchly liberal parents, he fit right in with Brown's sweatshop-protesting, fair-trade coffee-drinking, God-ambivalent student body. So when he had a chance encounter with a group of students from Liberty University, a conservative Baptist university in Lynchburg, Virginia, he found himself staring across a massive culture gap. But rather than brush the Liberty students off, Roose decided to do something much bolder: he became one of them.Liberty University is the late Rev. Jerry Falwell's proudest accomplishment - a 10,000-student conservative Christian training ground. At Liberty, students (who call themselves \"Champions for Christ\") take classes like Introduction to Youth Ministry and Evangelism 101. They hear from guest speakers like Mike Huckabee and Karl Rove, they pray before every class, and they follow a 46-page code of conduct called \"The Liberty Way\" that prohibits drinking, smoking, R-rated movies, contact with the opposite sex, and witchcraft. Armed with an open mind and a reporter's notebook, Roose dives into life at Bible Boot Camp with the goal of connecting with his evangelical peers by experiencing their world first-hand.Roose's semester at Liberty takes him to church, class, and choir practice at Rev. Falwell's Thomas Road Baptist Church. He visits a support group for recovering masturbation addicts, goes to an evangelical hip-hop concert, and participates in a spring break mission trip to Daytona Beach, where he learns how to convert bar-hopping co-eds to Christianity. Roose struggles with his own faith throughout, and in a twist that could only have been engineered by a higher power, he conducts what would turn out to be the last in-depth interview of Rev. Falwell's life. Hilarious and heartwarming, respectful and thought-provoking, Roose's embedded report from the front lines of the culture war will inspire and entertain believers and non-believers alike.",
  "genres": [
    "Nonfiction",
    "Religion",
    "Memoir",
    "Biography",
    "Christian",
    "Christianity",
    "Book Club"
  ],
  "author": "Kevin Roose",
  "average_rating": "3.98",
  "url": "https://www.goodreads.com/book/show/3525894-the-unlikely-disciple"
}