{
  "title": "The Dragon with the Girl Tattoo",
  "description": "Once bitten, twice shy…  Lennox O’Lachtnáin, affectionately known as the Mad Bomber, would rather blow himself up than go on another blind date orchestrated by his well-meaning brethren. It was bad enough when they saw him crash and burn with the sexy doctor from Max’s Pride, but now they’ve all been witness to a string of failed first dates and botched meetings the likes of which no doubt have his ancestors turning in their proverbial graves. Fate was messing with him, BIG TIME, and he’d had enough.  The best laid plans…  One drunken night with his brethren to drown his sorrows and Lenn has a new tattoo, his head’s beating like a bass drum, and there’s a raven-haired beauty in his bed who makes his heart race and his dragon send smoke signals. There’s only one problem…she won’t wake up.  Cue the handcart to Hell…  Did Fate have to throw one more curve ball into his quest for a happily ever after? Well, of course She did. Did the Universe really have such a perverse sense of humor? Absolutely, no doubt. And who in the Heavens is this tiny platinum-haired woman who refuses to take no for an answer? Did she say something about a dating agency for paranormals? No way...time to get off the ride.  His one night stand has left him with more than new ink. Lenn has no doubt the sexy siren is his mate, the one created just for him, the other half of his soul…but there’s no way in Heaven or Hell he’s mating one of her kind. Nope, it’s just not happening. Alone is better than eternity with…with…that. There’s only one answer…blow something up and have another beer.  The Universe does make mistakes. Fate will be denied…or will it?",
  "genres": [
    "Paranormal",
    "Dragons",
    "Romance",
    "Paranormal Romance",
    "Shapeshifters",
    "Fantasy",
    "Vampires"
  ],
  "author": "Julia Mills",
  "average_rating": "4.43",
  "url": "https://www.goodreads.com/book/show/35276075-the-dragon-with-the-girl-tattoo"
}