{
  "title": "Billionaire Box Set Bundle",
  "description": "Get ready for hundreds of pages of smoking hot, electrifying billionaire romance and satisfying Happily-Ever-Afters.With three full-length standalone novels and an exclusive bonus, the books in this limited-edition omnibus have gathered hundreds of five-star reviews and are each #1 Best-Sellers. Get ready to lock yourself in your bedroom with a glass of wine bottle of wine – you won’t want to stop reading!What readers are saying\"WOW! This is one HOT read! I loved the characters, the romance, the humor, the settings. It really makes you want a billionaire! And it REALLY makes you want to have sex with one! OMG! Yes, the sex is hot but the story itself is really good too, with just enough humor, angst and moral questioning to make these books perfect.\"Included in this bundle:BILLIONAIRE BY THE BOOKShe's a curvy librarian with a broken heart.He's a smoking hot billionaire with an evil an ex-wife. They meet in a library during a snowstorm.It's cold outside, but in the library things are about to get hot! BILLIONAIRE ATTRACTIONAnna is sexy, curvaceous and desperate for money. Jacob is the billionaire that could make all her dreams come true. There's just one problem. He thinks money can solve all his problems… but her love isn't for sale.BILLIONAIRE BLIND DATETwo hot billionaires both fighting for the same woman. One fights dirty and is only interested in winning the prize.The other will fight with everything he's got, because he's intent on winning her heart.A dark, romantic thriller with a HEA.BILLIONAIRE HEAT (EXCLUSIVE PREVIEW)Libby struggles with body issues, but a journey to the slopes will change everything when she meets a man who challenges what she thinks about herself. Warning: these books are so hot they will have you fanning yourself. They contain smoking hot action between ordinary women and extraordinary Billionaires, including sizzling scenes which are for adults only. Read this box set value bundle only if you enjoy smoking hot romance, intelligent heroines, sexy billionaires, and romance books full of steamy, sexy fun!",
  "genres": [],
  "author": "Nikki Steele",
  "average_rating": "4.42",
  "url": "https://www.goodreads.com/book/show/35276382-billionaire-box-set-bundle"
}