{
  "title": "The Magnificent Miss Broadway",
  "description": "People ask me about my momma all the time. Usually while squintin’ up their faces and looking down they noses at me like I smell bad or something; I don't never smell nothing. \"Where's that bitch Tiny?\" They ask. \"When she comin’ back? That crook owe me two dollas and I want my money.\" They talk about her right in front of my face. \"She probably done run off with somebody elses man.\" Or, \"She prolly got drunk and fell in the river.\" Somebody even said, \"It was just a matter of time before she run off on her man and her girl. Them Maxwell's are trash. All they do is drink, whore, and make babies.\" I don't never fight or argue cause they ain't lying.Tanina shocked everyone when she only had me. Wasn't cause my daddy didn't want more babies, that's for sure. My daddy stayed tugging on her skirt and grabbing on her big titties. \"I want a boy Tanina, I want a son.\" My momma would swat him away and go down to the coloreds only speakeasy. It’s deep in the swamp and out of reach of the sheriff, the night riders, and wives waiting at home for husbands pissing away a weeks pay on rum and women like Tiny. The speakeasy is called Nukes Place. That's on account of a big, black woman called Nuke owns the place. They drink, and dance, and fuck all night long as some half-assed band plays jazz music. Everyone is usually too drunk to notice how bad they sound. Daddy stayed sending me down into the woods to fetch my momma home. Sometimes she came willingly, sometimes she came a week later. \"Where is my beautiful momma?\" They ask. She gone and run off I tell them just like Daddy told me to say. Every time I open my mouth and tell the lie, I think about the night my momma done me wrong. She done me so wrong that my daddy cried. My big, strong daddy never cries. The last time I seen my momma, Daddy was dragging her screaming into the woods. He had a spade in one hand and mommas hair in the other. Daddy and the spade came back. Momma did not.",
  "genres": [
    "Romance",
    "Fiction",
    "Historical",
    "Historical Romance"
  ],
  "author": "JanJan Untamed",
  "average_rating": "4.54",
  "url": "https://www.goodreads.com/book/show/35286190-the-magnificent-miss-broadway"
}