{
  "title": "Florida: 2 Contemporary romances and 2 Historical romances",
  "description": "Where love is as bright as the Florida sunset.AGAINST THE SUNSETIn this inspirational contemporary romance set in Clearwater, Florida, Jillian Schafer and Dustin Harmon are both on temporary hiatus from their careers when they decide to hang out and go for long walks on the beach to clear their minds. However, as they get to know each other better, their common values and growing emotional chemistry make them think about more than friendship. However, they both have plans that will make a romantic relationship too difficult to maintain. Will Jillian and Dustin be able to see past their old goals and realize it's time to rethink what they want in life?INN DANGEREverything is going wrong at the Buttercup Inn. Following the fire, the accident, and the theft, Winnie's confidence as an innkeeper is at an all-time low. If it weren't for Matthew Lister's steadying presence and help, she'd sell the inn and move away from St. Augustine. What's more, the chemistry between Matt and herself is more than she can handle, especially since he answered her all-important question the wrong way. He didn't have a camel.ORANGE BLOSSOM CAFEWhat happens when a new restaurant opens right next door to your café?Sabotage it, of course!Well, that’s what Aiden O’Connell thought until she tangles one too many times with the charismatic Phillip Moreau. Between their wild run-ins and her new craving for caramels, Aiden may have finally met her match.Recipe for a Witty Romantic TaleTake one stubborn-minded heroine. Add a serving of spice with one flirty hero, who has no trouble holding his own against her feistiness. Mix in hilarious sabotages that slightly miss the mark and an amusing dash of mischief. Don’t forget to resolve the angst with an anticipated kiss.Recipe Be sure to balance the portions of tension and chemistry in order to whip up the sweetest, love-inspiring result.Recipe IncludedLILLY'S PIRATELillian Appleby longs for adventure. She slips away from her Florida town's July 4, 1900, celebration planning to comb the beach and meets a Bible-reading \"pirate\". No one believes her story, and plans proceed for her to marry the postmaster, a man she doesn't love. But her heart says \"wait\".",
  "genres": [],
  "author": "Debby Mayne",
  "average_rating": "4.57",
  "url": "https://www.goodreads.com/book/show/35277210-florida"
}