{
  "title": "Inherit The Whirlwind: The Final Showdown Between Science And Religion",
  "description": "D.R. Pope lives in South Australia. An ex schoolteacher and erstwhile entrepreneur and lover of creative pursuits. \"Inherit the Whirlwind\" is his long-awaited debut novel. It features an absorbing courtroom battle of ideologies between two powerful forces hellbent on determining the future of mankind. Set against the backdrop of the trials and tribulations of Professor Joe Colliver, a leading bio-engineer and his tormented family. We are drawn into their troubled world as they get caught up in the unfolding drama and their lives descend into physical and psychological turmoil.The narrative is carried from the viewpoints of two of the central characters. Ben, the son of Professor Joe Colliver, tells of his struggles to cope with his family's disintegration and his own battle with depression, suicidal tendencies and the tragic losses of his soulmate and his sister. Jim Wainwright, an investigative journalist, breaks news of the ground-breaking trial to a captivated world-wide audience in a novel format--through the vehicle of regular blog posts.Science offers humanity the holy grail of extended life and the promise of earthly immortality. While fanatical religious fundamentalists resort to violence and destruction to protect God's divine plan of Creation, traditional religious leaders and institutions take the legal pathway to thwart science's unholy push to usurp God's dominion.A take no prisoners clash between science's push for a brave new world, where man creates his own image against the reactionary forces of religion, clinging to a superstitious past locked in the idea mankind must remain set forever in God's image. The novel is full of memorable characters and dramatic events, with many unforeseeable twists and turns which will surely stay with the reader long after the final page is turned.This story owes its DNA to last century's real-life battle between evolution and religion featured in the Scopes Monkey Trial of 1925 in Dayton, Tennessee; also dramatically depicted in the movie, \"Inherit the Wind.\"",
  "genres": [],
  "author": "D.R. Pope",
  "average_rating": "4.52",
  "url": "https://www.goodreads.com/book/show/35276908-inherit-the-whirlwind"
}