{
  "title": "The Trafficking Consortium",
  "description": "Be careful with whom you share your personal information, you may not like what they do with it. During your annual physical, a well-paid receptionist forwards your chart to an international human trafficking ring. A clear violation of the HIPAA Laws, but who cares? Money is a great incentive. Consider what happens after they take you, ship you off, and sell you at auction? Can you imagine your new life? Can you imagine a life as owned property?Avril Gillios doesn't have to imagine it; she has to live it. The question is, can she survive it?The Trafficking Consortium Copyright (c) Richard Verry 2016A brutal erotic suspense thriller about Avril Gillios, a young woman in her mid-twenties, who get’s caught up in an international organized crime ring specializing in human trafficking. The thousand-year old organization call themselves ‘The Consortium.’ Their affluent and influential members can order or acquire anyone, men and women alike, to satisfy their unique needs and desires. From organ acquisition; to perverse sexual satisfaction; or feasting upon their prey, they seemingly operate above the law all across the globe.Told from Avril’s point of view, the story describes how this criminal organization targets her, kidnaps her right off the streets of NYC and sells her to the highest bidder; marking the beginning of a new life, forever barred from returning to the only life she ever knew.She must navigate the perilous events that threaten her life to survive her ordeal and attempt escape. Sold to a sadistic monster, her captivity is relatively comfortable. Locked in a luxurious suite with all the trimmings included in the most elegant high-end luxury apartments enjoyed by the upper one-percenters, a cage is still a cage.She endures brutal beatings and violent ravishments as her new owner trains her to be compliant to his demands and needs. Along the way, she discovers that her sadistic owner loves her, in his own way.Confused and bewildered, she must figure out how to navigate the ever narrowing serpentine path to escape the growing threat to her life. Her captor eventually gives her an impossible choice, one that takes away all doubt of what he intends to do with her. However, he requires that she select the path that her life will take. Failing to choose is the same as choosing a horrific, slow, and painful death.Will she choose life or death?",
  "genres": [
    "Erotica"
  ],
  "author": "Richard Verry",
  "average_rating": "3.79",
  "url": "https://www.goodreads.com/book/show/35277176-the-trafficking-consortium"
}