{
  "title": "A Game of Deceit",
  "description": "A father’s disappearance never solved, a mother’s secret taken to the grave, a daughter deceived…Kathryn Landry thinks her life is just about perfect. She is the owner of a successful interior designer business in Newport Beach, California, and she has an attentive, supportive husband. But her world comes crashing down when her husband, Neil Landry, vanishes without a trace… in a situation almost identical to the disappearance of her father twenty years before.With her father’s disappearance still a mystery, Kathryn is skeptical that the detective assigned to her case will be able to find her husband. Determined to uncover the truth, Kathryn is plunged into a world of politics, high-priced call girls and wealth. As she begins to search for her husband, a decades-old secret her mother took to the grave threatens to destroy all she holds dear. Caught up in a web of betrayals and deceit, and not knowing who to trust, Kathryn must find a way to survive as she discovers the past has a way of repeating itself.\"...Davis deftly keeps readers as up in the air as Kathryn throughout this well-crafted tale. An impressive thriller by an author worth following.\" – Kirkus Reviews“In A Game of Deceit author K. A. Davis offers up a taut, edge-of-your-seat suspense novel that will make you lock the doors, close the blinds, and wonder who you can truly trust. Don’t miss this great debut from Ms. Davis.” – Paige Shelton, New York Times Bestselling author of the Farmers' Market, Country Cooking School, Dangerous Type, and Scottish Bookshop mysteries. “In A Game of Deceit, K. A. Davis has crafted an emotional suspense with a taut, satisfying ending that should delight any fan of Mary Higgins Clark.” – Daryl Wood Gerber, Agatha Award-winning author of the Cookbook Nook, French Bistro Mysteries, and Cheese Shop Mysteries, and the stand-alone suspense novels, GIRL ON THE RUN and DAY OF SECRETS. “Sly, sexy and spellbinding, A Game of Deceit grabs you in the first chapter and doesn’t let you go until its breathtaking finish. Debut author K. A. Davis creates a riveting tale of betrayal, family, suspense and murder.” – Jenny Kales, author of The Callie’s Kitchen Mystery series.\"A Game of Deceit is a marvelous read packed with action, suspense and intrigue. I couldn't put it down!\" – Catherine Bruns, USA Today Best Selling Author of the Cookies & Chance mysteries.",
  "genres": [
    "Mystery",
    "Suspense"
  ],
  "author": "K.A.  Davis",
  "average_rating": "4.16",
  "url": "https://www.goodreads.com/book/show/35279925-a-game-of-deceit"
}