{
  "title": "Quilling Techniques: Secret Quilling Styles Used by Cosmina",
  "description": "All styles in one book \n\n\n You will discover here beautiful techniques for having fun with your child, nephew or someone who is dear to your heart. Quilling Techniques gives to its reader’s features basic shapes, step-by-step instructions for 42 beautiful projects and 21 extra designs for your inspiration. The aim of this book is to teach you the styles used in quilling, while the most advanced artists may find a source of inspiration for more complex projects. The book is addressed to those who have a basic knowledge in quilling and who want to give themselves a beautiful present.  \nCosmina, a fearless creator\n\n\n Quilling Techniques continues the story of Cosmina and her experiences at school, in the park and in other few places that you will discover reading this book. Cosmina’s first contact with the art of quilling begins with the Quilling Basics book where she learns easily rolling the paper. In this edition she becomes more practical and brings to live more designs. So, fill free to witness her growing up!  \nThe book content \n\n\n Having a vast experience in this form of art, Alberta Neal gathered in just one book all the quilling styles that she use in her projects. Thereby, the book Quilling Techniques: Secret Quilling Styles used by Cosmina is divided in 17 chapters and each chapter approach one technique, where you will find a short description of the technique, how it works explanation, basic shapes applied, projects to make at home and extra designs. Subjects range from simple flowers, eyes and flat plate to more challenging tiara, jewelry box and candy bowl. Other subjects included are the figures of a broach, pendant, earrings, grapes, apple tree, piece of lemon/orange, home decorations, chair, letter A, card for special events, frame, shower of stars, cherry blossom flower buds. Completing those projects will bring you more quality time and more joyful designs and ideas for those who use this form of art as a source of income.",
  "genres": [],
  "author": "Alberta Neal",
  "average_rating": "3.73",
  "url": "https://www.goodreads.com/book/show/35281725-quilling-techniques"
}