{
  "title": "Poison",
  "description": "From the “master of the legal thriller” (Chicago Sun-Times) John Lescroart comes a dramatic family drama in which attorney Dismas Hardy is called on to defend a former client against the accusation of murder.Dismas Hardy is looking forward to cutting back his work hours and easing into retirement after recovering from two gunshot wounds. He is determined to spend more time with his family and even reconnect with his distant son, Vincent. But Dismas just can’t stay away from the courtroom for long and soon he is pulled into an intense family drama with fatal consequences. Grant Carver, the vigorous patriarch of the Carver family and its four-generations owned family business, has been murdered. His bookkeeper Abby Jarvis, whom Hardy had defended on a DUI charge eleven years prior, is the prime suspect after police discover she’s been embezzling funds from the company—but she insists she did not kill her boss. As he prepares to defend her, Dismas investigates the Carver clan and discovers the dark, twisted secrets within the family. It seems that Abby was not the only one who stood to profit from the company’s $25 million dollar market value. From jealous children to gold-digging girlfriends, Dismas has his work cut out for him in sifting through mud flinging, backstabbing, and accusations of blackmail. But Dismas not only has to save his client’s life but his own, as it soon becomes clear that someone has a painted a target on his back, too. With Lescroart’s signature “smart, riveting, and utterly compelling” (Brad Thor, #1 New York Times bestselling author) prose, this whip smart and nail-bitingly suspenseful thriller will keep you guessing until the very last page.",
  "genres": [
    "Mystery",
    "Fiction",
    "Thriller",
    "Audiobook",
    "Legal Thriller",
    "Crime",
    "Mystery Thriller"
  ],
  "author": "John Lescroart",
  "average_rating": "4.03",
  "url": "https://www.goodreads.com/book/show/35297564-poison"
}