{
  "title": "The Flamenco Academy",
  "description": "While at school, Rae befriends the high school bad girl and a young flamenco guitarist. When they reach college they abandon themselves to the disciplines and demands of the university’s flamenco academy.From the author of the widely praised The Yokota Officers Club, a superbly alive novel about two young American women caught up in the fevered excitement of the flamenco revival sweeping the Southwest.The place is Albuquerque. Cyndi Rae Hrncir, called Rae, seventeen and shy, is twice spellbound, first by high school bad girl Didi (“Dirty Deeds”) Steinberg, already embarked on a search for stardom, then by a devastatingly handsome young flamenco guitarist, Tomás Montenegro. Soon the girls are in college, where they abandon themselves to the disciplines and demands of the university’s flamenco academy and to the hypnotic storytelling of their teacher, Doña Carlota, Tomás’s great-aunt. While never losing the insistent beat of the dance, Doña Carlota mesmerizes her students with the complexly embroidered story of her childhood growing up among the cave-dwelling Gypsies of Andalusia. She initiates them into the traditions, the rhythms, and the steps of flamenco puro, with its central imperative: “Dame la verdad”—Give me the truth.Locked in a volatile triangle and driven by obsession—Didi’s with stardom, Rae’s with Tomás, Tomás’s with his mysterious heritage—these three emerge as the brightest stars on the New World flamenco scene, while secrets and desires, longings and betrayals pulse just beneath the glittering surface of their compelling performances.A sense of passion and danger has always surrounded flamenco. In The Flamenco Academy, Sarah Bird delivers a novel with a sense of history and character that matches the drama of the dance it so brilliantly celebrates.",
  "genres": [
    "Fiction",
    "Book Club",
    "Contemporary",
    "Romance",
    "Chick Lit",
    "Adult Fiction",
    "Historical Fiction"
  ],
  "author": "Sarah Bird",
  "average_rating": "3.90",
  "url": "https://www.goodreads.com/book/show/352973.The_Flamenco_Academy"
}