{
  "title": "Bel Air",
  "description": "All that glitters isn't gold . . . sometimes it's love.In the lush, sun-bright splendor of southern California, three women, three friends, search for the courage to dream, to trust, to love. But there are dark secrets and hidden betrayals that must first be overcome.A terrible accident has stolen Allison Fitzgerald’s dreams, and it has taught her that life is too precious—and too fragile—to waste. So when she meets a man who evokes a passion in her that she has never known before, she surrenders to his love without questioning his secretive past.Gifted and beautiful actress Winter Carlyle has learned, from painful experience, that the people she loves always leave her, and that it is far too dangerous to care, and that she is only liked when she is pretending to be someone she is not. Still, she is willing to risk everything for the doctor who sees beyond the pretense . . . But is he willing to risk everything for her?Emily Rousseau only feels safe, only feels free, when she is behind the lens of her camera, safe and free from the men who want her, and want to hurt her. The portraits she takes are works of art, and there is one man, unlike any other man she has ever known, who sees not only the talent in her work, but the loveliness in her. But can she accept the love, and face the demons, that will free her from her past?Praise for the novels of Katherine “Remarkably romantic and thoroughly enchanting.”—Rendezvous on Pearl Moon“Poignant . . . Cass is an intrepid heroine, but it is Chase who wins our hearts when he refuses to allow Cass’s seeming betrayal to stop him from protecting his beloved.” —Midwest Book Review on Bed of Roses“Fairytale elements mix with those of a present day romance for . . . thoroughly enjoyable results.”—Kirkus Reviews on Rainbows“With this tightly woven, suspenseful plot, peopled with memorable characters, Stone has produced another surefire hit.”—Booklist on Imagine Love“Sweeping drama . . . Her most emotionally charged and intricate story of love yet.”—Romantic Times on Imagine Love“Alluring . . . Fascinating . . . Each page brings a new adventure, every plot twist another question begging to be answered.”—Rendezvous on Imagine LoveKatherine Stone writes “in the vein of Danielle Steel and Sandra Brown”—Library JournalKatherine Stone's \"high quality romance ranks right up there with Nora Roberts.\"—BooklistKatherine Stone is the New York Times bestselling author of twenty-two novels, including ROOMMATES, PEARL MOON, LOVE SONGS, HAPPY ENDINGS, and THIEF OF HEARTS. Her books are sold worldwide and have been translated into twenty languages. A physician who now writes full time, she lives in the Pacific Northwest with her husband, physician-novelist Jack Chase (CRY CHAOS, MORTALITY RATE, FATAL ANALYSIS, THE MAGRUDER TRANSPLANT).",
  "genres": [
    "Romance",
    "Fiction"
  ],
  "author": "Katherine Stone",
  "average_rating": "4.04",
  "url": "https://www.goodreads.com/book/show/12122975-bel-air"
}