{
  "title": "The Age of Eisenhower: America and the World in the 1950s",
  "description": "An original and penetrating assessment of President Dwight D. Eisenhower, showing Ike’s enormous influence on modern America, the Cold War, and on the presidency itself.In a 2017 survey, presidential historians ranked Dwight D. Eisenhower fifth on the list of great presidents, behind the perennial top four: Lincoln, Washington, Franklin D. Roosevelt, and Teddy Roosevelt. Historian William Hitchcock shows that this high ranking is justified. Eisenhower’s accomplishments were enormous, and loom ever larger from the vantage point of our own tumultuous times. A former general, Ike kept the peace: he ended the Korean War, avoided a war in Vietnam, adroitly managed a potential confrontation with China, and soothed relations with the Soviet Union after Stalin’s death. He guided the Republican Party to embrace central aspects of the New Deal like Social Security. He thwarted the demagoguery of McCarthy and he advanced the agenda of civil rights for African Americans. As part of his strategy to wage, and win, the Cold War, Eisenhower expanded American military power, built a fearsome nuclear arsenal and launched the space race. In his famous Farewell Address, he acknowledged that Americans needed such weapons in order to keep global peace—but he also admonished his citizens to remain alert to the potentially harmful influence of the “military-industrial complex.” From 1953 to 1961 no one dominated the world stage as did President Dwight D. Eisenhower. The Age of Eisenhower is the definitive account of this presidency, drawing extensively on declassified material from the Eisenhower Library, the CIA and Defense Department, and troves of unpublished documents. In his masterful account, Hitchcock shows how Ike shaped modern America, and he astutely assesses Eisenhower’s close confidants, from Attorney General Brownell to Secretary of State Dulles. The result is an eye-opening reevaluation that explains why this “do-nothing” president is rightly regarded as one of the best leaders our country has ever had.",
  "genres": [
    "History",
    "Biography",
    "Nonfiction",
    "Presidents",
    "American History",
    "Politics",
    "Biography Memoir"
  ],
  "author": "William I. Hitchcock",
  "average_rating": "4.34",
  "url": "https://www.goodreads.com/book/show/35297696-the-age-of-eisenhower"
}