{
  "title": "Hyde Park Pursuit",
  "description": "Thrown together seemingly by chance after a tempestuous breakup, aristocrat Jon Macy, still haunted by his experience in the jungles of Vietnam, and Allison Young, a hard-driving real estate broker, begin their time together in London with a run through Hyde Park—and witness a murder. Suddenly, everything changes. The dying words of the victim send Jon and Allison on a chilling adventure from the mountains of Wales to the remote Hebrides and beyond. Forced to survive only by their wits, they seek safety from their pursuers, who are determined to silence them at all costs. Will their fragile love, so recently renewed, survive the terror and violence? Will they? About the Author Raised in his early years on a remote Bahamian island by parents escaping the stuffy conﬁnes of East Coast society, Oz Erickson later graduated from Exeter Academy, Harvard College and the Stanford Business School. After ﬁnishing college, Oz, an adventurer at heart, hitchhiked through Europe and journeyed throughout Africa, climbing Mt. Kilimanjaro and trekking through Ethiopia. After traveling across the Sudan by fourth-class rail, he voyaged down the Nile on an old Egyptian river boat. Next, by bus, train, and foot, he crossed Iraq, Iran, Afghanistan, Pakistan and India. He spent a month hiking in the Himalayas before journeying through Burma, Thailand and Malaysia, culminating in a 2000-mile hitchhike across Australia.Back in the States, Oz fell in love with a beautiful, exotic Chilean who was getting her PhD at Stanford and married her. In the early 1980s, starting off in 10’x14’ ofﬁce, he built a major San Francisco real estate development ﬁrm, Emerald Fund.Throughout his career, Oz has been involved in numerous San Francisco civic organizations. He has been honored by California’s Assembly and Senate, as well as by San Francisco’s Board of Supervisors. He is still married to his wonderful Chilean and has a son and a daughter. Hyde Park Pursuit is his ﬁrst novel.",
  "genres": [],
  "author": "oz erickson",
  "average_rating": "3.00",
  "url": "https://www.goodreads.com/book/show/35300204-hyde-park-pursuit"
}