{
  "title": "Burma: The Longest War 1941-45",
  "description": "The longest campaign in World War Two was fought in Burma. It was, arguably, also the most ferocious and the most varied. It comprised jungle as well as desert warfare; the longest retreat in the history of the British Army; the greatest defeat suffered on land by the Japanese army; long-range penetration groups operating hundreds of miles behind enemy lines; ruthless hand-to-hand fighting; armies transported both by Dakota aircraft and wooden rafts . . . the list is almost endless. And it had its fair share of forceful personalities — the cantankerous Limey-hating U.S. general, 'Vinegar Joe' Stilwell, the brilliant military genius, Orde Wingate; the colorful Japanese Japanese generals Mutaguchi and Miyazaki, the fiery Bengali revolutionary, Subhas Chandra Bose; the young Burmese rebel general, Aung San; and the two pillars of British high command, Field Marshal Slim and Admiral Lord Louis Mountbatten.Louis Allen's fascinating new account of this theatre of war is quite different from any previous account. First, his presentation of the story, from both sides, is derived from his unique command of the public and private archives in Tokyo and London, using evidence from private soldiers as well as generals from manuscript accounts as well as printed sources, from correspondence and conversations since 1945, and from personal knowledge of the battlefield itself. Second, he introduces into his military narrative fresh dimensions concerning what the war in Burma was like to those who took part in it, the factors of sex, race, and class, the way the war has been reflected in literature, and how each side thought (and still thinks) of the other. Third, he shows how, while the opposing armies twice fought to the death over the length and breadth of their land, the Burmese tried to fashion for themselves an independent future - how in fact the war in Burma was not only a series of fierce battles but also a heady mixture of strategy and politics.Comprehensive, stimulating, lively, often controversial — Burma: the longest war 1941-45 will be regarded as one of the most original and important contributions to the literature of this campaign.",
  "genres": [
    "History",
    "World War II",
    "Military History",
    "Military Fiction",
    "Nonfiction",
    "War",
    "Japan"
  ],
  "author": "Louis Allen",
  "average_rating": "4.14",
  "url": "https://www.goodreads.com/book/show/3529849-burma"
}