{
  "title": "A Love Like Mine",
  "description": "There’s only so many secrets that a family can have before it all comes spilling out and everyone becomes exposed for the lying, cheating, creeping individuals they are.Chi’yanne, the eldest is always taking care of everyone else and never has time for anything. At 28 years old, she dreams of settling down and having a life of her own, even though the one man she really loves got away. When the opportunity presents itself for her to rekindle that relationship, she finds that competition for his attention is real close to home; closer than she could imagine. But when her world is rocked with a family tragedy, a blast from the past catches up to her and her biggest secret is threatening everything she has worked to accomplish and everything goes crazy.Malia is running from her secret; literally. Feeling as if she has no one, and knowing how her family feels, pain is all too familiar for her. Being home only reminds her of everything that she ran away from in the first place and she’s ready to end it all. But running from her problems is only bringing her more drama than she can handle and soon, her secret becomes everyone’s nightmare.Tawnya is all about living life, and doing whatever she wants to do; and whoever. With no regard to anyone’s feelings but her own, she tells it like it is and doesn’t care who she hurts. She’s got a body to die for and will turn any man’s head; including that that are off limits. But you know what they say; what goes around comes around, and karma is coming for Tawnya with a vengeance. With time ticking and everyone in some mess, Tawnya will find herself in the middle of something that even she can’t handle.Every family has the perfect angel and in this case, her name suits her. Meet the baby, Angel aka “Brat”. No one ever expects her to do any wrong and all she wants is a better life than the one she is living. Angel has no real worries, but because she’s so perfect, she sees and knows way more than she should and when she finds that she is the center of some of the hidden secrets, being an angel is no longer on her agenda, getting revenge is.What’s done in the dark will always come to the light, and in this revised saga (previously The Parker Women), First Lady K will leave you breathless in this page turner that is A Love Like Mine.",
  "genres": [],
  "author": "First Lady K.",
  "average_rating": "4.36",
  "url": "https://www.goodreads.com/book/show/35299790-a-love-like-mine"
}