{
  "title": "Crucible of Honour: The Battle of Rorke's Drift",
  "description": "It is January of 1879. While three columns of British soldiers and their African allies cross the uMzinyathi River to commence the invasion of the Zulu Kingdom, a handful of redcoats from B Company, 2/24th Regiment are left to guard the centre column’s supply depot at Rorke's Drift.On the morning of 22 January, the main camp at Isandlwana, just ten miles to the east, comes under attack from the entire Zulu army and is utterly destroyed. Four thousand warriors from King Cetshwayo’s elite Undi Corps remained in reserve and were denied any chance to take part in the fighting. Led by Prince Dabulamanzi, they disobey the king’s orders and cross into British Natal, seeking their share in triumph and spoils. They soon converge on Rorke’s Drift; an easy prize, with its paltry force of 150 redcoats to be readily swept aside.Upon hearing of the disaster at Isandlwana, and with retreat impossible, the tiny British garrison readies to receive the coming onslaught. Leading them is Lieutenant John Chard, a newly-arrived engineer officer with no actual combat experience. Aiding him is B Company’s previously undistinguished officer commanding, Lieutenant Gonville Bromhead, along with 24-year old Colour Sergeant Frank Bourne, and a retired soldier-turned civilian volunteer named James Dalton.Unbeknownst to either the British or the Zulus, half of the centre column, under Lord Chelmsford’s direct command, was not even at Isandlwana, but fifteen miles further east, at Mangeni Falls. However, with a huge Zulu force of over twenty-thousand warriors between them and the drift, their ammunition and ration stores taken or destroyed, and an impossible distance to cover, Chelmsford’s battered column cannot possibly come to the depot’s aid, and must look to their own survival. The defenders of Rorke’s Drift stand alone.",
  "genres": [
    "History",
    "Military Fiction"
  ],
  "author": "James Mace",
  "average_rating": "4.51",
  "url": "https://www.goodreads.com/book/show/35329708-crucible-of-honour"
}