{
  "title": "There's a Hair in My Dirt!: A Worm's Story",
  "description": "Once upon a time in a place far away, lived a man named Gary Larson who used to draw cartoons. It was a cartoon that appeared for many years in daily newspapers and was loved by millions. (And was confusing to millions more.) But one day he stopped.Gary went into hiding. He made a couple short films. He played his guitar. He threw sticks for his dogs. They threw some back.Yet Gary was restless. He couldn't sleep nights. Something haunted him. (Besides Gramps.) Something that would return him to his roots in biology, drawing and dementia--a tale called There's a Hair in My Dirt! A Worm's Story.It begins a few inches underground, when a young worm, during a typical family dinner, discovers there's a hair in his plate of dirt. He becomes rather upset, not just about his tainted meal but about his entire miserable, wormy life. This, in turn, spurs his father to tell him a story--a story to inspire the children of invertebrates everywhere.And so Father Worm describes the saga of a fair young maiden and her adventuresome stroll through her favorite forest, a perambulator's paradise. It is a journey filled with mystery and magic. Or so she thinks.Which is all we'll say for now.What exactly does the maiden encounter?Does Son Worm learn a lesson?More important, does he eat his plate of fresh dirt?Well, you'll have to read to find out, but let's just say the answers are right under your feet.Written and illustrated in a children's storybook style, There's a Hair in My Dirt! A Worm's Story is a twisted take on the difference between our idealized view of Nature and the sometimes cold, hard reality of life for the birds and the bees and the worms (not to mention our own species).Told with his trademark off-kilter humor, this first original non--Far Side book is the unique work of a comic master.Now Larson can finally sleep at night.Question is, will you?(from the back cover)",
  "genres": [
    "Humor",
    "Fiction",
    "Picture Books",
    "Comics",
    "Childrens",
    "Graphic Novels",
    "Comedy"
  ],
  "author": "Gary Larson",
  "average_rating": "4.16",
  "url": "https://www.goodreads.com/book/show/35305.There_s_a_Hair_in_My_Dirt_"
}