{
  "title": "Dirt",
  "description": "The second novel in the thrilling Stone Barrington Series by #1 'New York Times' bestselling author Stuart Woods. \"Blackmail, murder, suspense, love—what else could you want in a book?\" says 'Cosmopolitan.'Feared and loathed for her poison pen and ice queen persona, Amanda Dart has made her share of enemies. Then the tables are turned. An anonymous gossipmonger is faxing Amanda's personal and private peccadilloes to anyone who can read. Desperate to save her reputation, she enlists the help of New York lawyer and private investigator Stone Barrington to learn the identity of the faxer. Everyone in the world of tabloid journalism becomes a suspect!But the faxes don't stop. In fact, they get worse. Stone winds up with more leads than one man can handle, and then Amanda takes matters dangerously into her own hands and turns the world of gossip on its head. As the circle of suspects shrinks, Stone discovers that even the most respected members of the social scene will stop at nothing—even homicide—to clear their sullied names.Librarian's note: the characters, settings and other information for the first 25 books in the series are complete as best possible (corrections are welcome!) for: #1, New York Dead, 1991; #2, Dirt, 1996; #3, Dead in the Water, 1997; #4, Swimming to Catalina, 1998; #5, Worst Fears Realized, 1999; #6, L.A. Dead, 2000; #7, Cold Paradise, 2001; #8, The Short Forever, 2002; #9, Dirty Work, 2003; #10, Reckless Abandon, 2004; #11, Two Dollar Bill, 2004; #12. Dark Harbor, 2006; #13, Fresh Disasters, 2007; #14, Shoot Him if He Runs, 2007; #15, Hot Mahogany, 2008; #16, Loitering with Intent, 2009; #17, Kisser, 2009; #18, Lucid Intervals, 2010; #19, Strategic Moves, 2010; #20, Bel-Air Dead, 2011; #21, Son of Stone, 2011; #22, D.C. Dead, 2011; #23, Unnatural Acts, 2012; #24, Severe Clear, 2012; and #25, Collateral Damage, 2012.",
  "genres": [
    "Mystery",
    "Fiction",
    "Thriller",
    "Crime",
    "Audiobook",
    "Suspense",
    "Mystery Thriller"
  ],
  "author": "Stuart Woods",
  "average_rating": "3.96",
  "url": "https://www.goodreads.com/book/show/35308.Dirt"
}