{
  "title": "Sir Princess Petra's Mission",
  "description": "Book #3 in the Eleven-Time International Winning Fantasy Series For Kids.Join Sir Princess Petra and her funny dragon steed, Snarls, on their zany adventures in this humorous fantasy series for kids . These multi-award winning dragon stories for kids 7 - 11 years are sure to entertain.Sir Princess Petra has already attained her knighthood in the Kingdom of Pen Pieyu and her non-princess-like talent certificate from Talent School, neither of which pleases her father and mother, the king and queen.The king writes up more silly rules in the royal rule book to deter Sir Princess Petra from her knightly ways and useless talent, and turn her into a real princess once and for all. Will the king finally succeed with this newly written, ridiculous mission for Petra?\"Ms. Robinson has created a heroine unlike any other in children's literature.\" -J.E. Rogers, Award-winning middle-grade fantasy author.\"The degree of imagination is matched by the terrific humor and sense of fun as always in Diane’s books. From the beginning chapter to the end this book is a treasure – and one that is highly recommended.\" - Grady Harp, Hall of Fame Top 100 Reviewer\"Ms. Robinson’s wit and skilled art makes this an entertaining read, even for adults.\" -Deborah Owen, Creative Writing Institute\"Robinson weaves a wonderful tale of adventure and excitement that any boy or girl could love.\" -Thomas Anderson\"The plot of this new story keeps the same high levels of the previous ones, even though here it is enriched with quirky and amazing twists that makes this fairy tale much more gripping and fun.\"-Advices Books\"Diane Mae Robinson has created an engaging tale in which both children and adults will find value, filled with happiness, friendship and individuality, plus a few dragons and swamps for good measure. Highly recommended to adventurous young readers everywhere.\" -K.C. Finn, Readers' FavoriteOther books in this princess series for kids:Sir Princess Petra - The Pen Pieyu Adventures (book 1)Sir Princess Petra's Talent - The Pen Pieyu Adventures (book2)Book Trailer: https://www.youtube.com/watch?v=20ZOL...",
  "genres": [
    "Fantasy",
    "Childrens",
    "Adventure"
  ],
  "author": "Diane Mae Robinson",
  "average_rating": "4.70",
  "url": "https://www.goodreads.com/book/show/35342128-sir-princess-petra-s-mission"
}