{
  "title": "Standing at the Edge: Finding Freedom Where Fear and Courage Meet",
  "description": "Standing at the Edge is an evocative examination of how we can respond to suffering, live our fullest lives, and remain open to the full spectrum of our human experience.Joan Halifax has enriched thousands of lives around the world through her work as a humanitarian, a social activist, an anthropologist, and as a Buddhist teacher. Over many decades, she has also collaborated with neuroscientists, clinicians, and psychologists to understand how contemplative practice can be a vehicle for social transformation. Through her unusual background, she developed an understanding of how our greatest challenges can become the most valuable source of our wisdom—and how we can transform our experience of suffering into the power of compassion for the benefit of others.Halifax has identified five psychological territories she calls Edge States—altruism, empathy, integrity, respect, and engagement—that epitomize strength of character. Yet each of these states can also be the cause of personal and social suffering. In this way, these five psychological experiences form edges, and it is only when we stand at these edges that we become open to the full range of our human experience and discover who we really are. Recounting the experiences of caregivers, activists, humanitarians, politicians, parents, and teachers, incorporating the wisdom of Zen traditions and mindfulness practices, and rooted in Halifax’s groundbreaking research on compassion, Standing at the Edge is destined to become a contemporary classic. A powerful guide on how to find the freedom we seek for others and ourselves, it is a book that will serve us all.\"Joan Halifax is a clearheaded and fearless traveler and in this book…she offers us a map of how to travel courageously and fruitfully, for our own benefit and the benefit of all beings.\" —From the foreword by Rebecca Solnit",
  "genres": [
    "Nonfiction",
    "Buddhism",
    "Spirituality",
    "Self Help",
    "Psychology",
    "Philosophy",
    "Personal Development"
  ],
  "author": "Joan Halifax",
  "average_rating": "4.23",
  "url": "https://www.goodreads.com/book/show/35343328-standing-at-the-edge"
}