{
  "title": "Journey Through Trauma: A Trail Guide to the 5-Phase Cycle of Healing Repeated Trauma",
  "description": "For survivors of PTSD and repeated, relational trauma -- and the people who love them.Gretchen Schmelzer watched too many people quit during treatment for trauma recovery. They found it too difficult or too frightening or just decided that for them it was too late. But as a therapist and trauma survivor herself, Dr. Schmelzer wants us to know that it is never too late to heal from trauma, whether it is the suffering caused within an abusive relationship or PTSD resulting from combat. Sometimes what feels like a big setback is actually an unexpected difficult step forward. So she wrote Journey Through Trauma specifically for survivors--to help them understand the terrain of the healing process and stay on the path.There are three basic principles that every trauma survivor should Healing is possible. It requires courage. And it cannot be done alone. Traumas that happen more than once--child abuse, sexual abuse, domestic violence, gang violence, even war--are all relational traumas. They happened inside a relationship and therefore must be healed inside a relationship, whether that relationship is with a therapist or within a group.Journey Through Trauma gives us a map to help guide us through that healing process, see where the hard parts show up, and persevere in the process of getting well. We learn the five phases that every survivor must negotiate along the way and come to understand that since the cycle of healing is not linear, circling back around to a previous stage does not mean defeat - it actually means progress as well as facing new challenges.Authoritative and accessible, Journey Through Trauma provides support for survivors and their loved ones through one of the most challenging but necessary processes of healing that anyone can face.",
  "genres": [
    "Psychology",
    "Nonfiction",
    "Self Help",
    "Mental Health",
    "Health",
    "Counselling",
    "Academic"
  ],
  "author": "Gretchen Schmelzer",
  "average_rating": "4.51",
  "url": "https://www.goodreads.com/book/show/35340993-journey-through-trauma"
}