{
  "title": "Like Brothers",
  "description": "Whether producing, writing, directing, or acting, the Duplass Brothers have made their mark in the world of independent film and television on the strength of their quirky and empathetic approach to storytelling. Now, for the first time, Mark and Jay take readers on a tour of their lifelong partnership in this unique memoir told in essays that share the secrets of their success, the joys and frustrations of intimate collaboration, and the lessons they’ve learned the hard way. From a childhood spent wielding an oversized home video camera in the suburbs of New Orleans to their shared years at the University of Texas in early-nineties Austin, and from the breakthrough short they made on a three-dollar budget to the night their feature film Baghead became the center of a Sundance bidding war, Mark and Jay tell the story of a bond that’s resilient, affectionate, mutually empowering, and only mildly dysfunctional. They are brutally honest about how their closeness sabotaged their youthful romantic relationships, about the jealousy each felt when the other stole the spotlight as an actor (Mark in The League, Jay in Transparent), and about the challenges they faced on the set of their HBO series Togetherness—namely, too much togetherness. But Like Brothers is also a surprisingly practical road map to a rewarding creative partnership. Rather than split all their responsibilities fifty-fifty, the brothers learned to capitalize on each other’s strengths. They’re not afraid to call each other out, because they’re also not afraid to compromise. Most relationships aren’t—and frankly shouldn’t be—as intense as Mark and Jay’s, but their brand of trust, validation, and healthy disagreement has taken them far. Part coming-of-age memoir, part underdog story, and part insider account of succeeding in Hollywood on their own terms, Like Brothers is as openhearted and lovably offbeat as Mark and Jay themselves.",
  "genres": [
    "Memoir",
    "Nonfiction",
    "Audiobook",
    "Humor",
    "Biography",
    "Film",
    "Essays"
  ],
  "author": "Mark Duplass",
  "average_rating": "4.04",
  "url": "https://www.goodreads.com/book/show/35342929-like-brothers"
}