{
  "title": "Uncompromising Honor",
  "description": "Uncompromising Courage. Uncompromising Vengeance. Uncompromising Honor.  The Solarian League—for hundreds of years they have borne the banner of human civilization. But the bureaucratic Mandarins who rule today’s League are corrupt and looking for scapegoats. They’ve decided the upstart Star Kingdom of Manticore must be annihilated.  Honor Harrington has worn the Star Kingdom’s uniform for half a century. So far, hers has been a voice of caution. But now the Mandarins have committed atrocities such as the galaxy has not known in a thousand years. They have finally killed too many of the people Honor Harrington loves.  Now Honor Harrington is coming for the Solarian League. And Hell is riding in her wake. About Uncompromising Honor:  “…a balanced mix of interstellar intrigue, counterespionage, and epic fleet action…with all the hard- and software details and tactical proficiency that Weber delivers like no one else; along with a large cast of well-developed, believable characters, giving each clash of fleets emotional weight.”—Booklist  “. . . moves. . . as inexorably as the Star Kingdom’s Grand Fleet, commanded by series protagonist Honor Harrington. . . . Weber is the Tom Clancy of science fiction. . . . His fans will relish this latest installment. . . .”—Publishers Weekly  “[E]ach book contains food for multiple tastes [and] provides a feast. Readers . . . will get enough hardware-geek stuff and space battles to make their palms sweaty. Those who love political intrigue will nigh have their brains explode from following all the tentacles of strategy. . . .Those who love fully drawn characters with everything at stake . . . will have lots to cheer about. And those who love bad guys committing atrocious deeds, only to get what they deserve from the good guys, will sleep contentedly at night because justice has been served. Uncompromising Honor provide[s] a long, luxurious trip. . . [that is] emotionally and intellectually gratifying. . .”—New York Journal of Books-West  “Weber’s books [are] enjoyable as fiction and profound as works of art. . . . [in them] great power competition makes its way into the space age on a galactic scale. . . . Battles are described in vivid, suspenseful detail. . . . both sides grapple to do their duty as they understand it . . . [and] it is the human touches that make this book so gripping. . . . Weber’s fans will greatly enjoy Uncompromising Honor [and be left] eagerly awaiting the next installment of this magnificent series.”—Mark Vandroff, Center for International Maritime Security  “This latest Honor Harrington novel brings the saga to another crucial turning point…Readers may feel confident that they will be Honored many more times and enjoy it every time.”–Booklist   About David Weber and the Honor Harrington series:  “. . .everything you could want in a heroine …. Excellent … plenty of action.”–Science Fiction Age  “Brilliant! Brilliant! Brilliant!”–Anne McCaffrey  “Compelling combat combined with engaging characters for a great space opera adventure.”–Locus  “Weber combines realistic, engaging characters with intelligent technological projection . . . Fans of this venerable space opera will rejoice . . .”–Publishers Weekly",
  "genres": [
    "Science Fiction",
    "Space Opera",
    "Military Fiction",
    "Fiction",
    "Audiobook",
    "Military Science Fiction",
    "Science Fiction Fantasy"
  ],
  "author": "David Weber",
  "average_rating": "4.34",
  "url": "https://www.goodreads.com/book/show/35382980-uncompromising-honor"
}