{
  "title": "Typhoon",
  "description": "Captain MacWhirr cannot fathom anything outside the facts of his own life. His first mate, Mr. Jukes, is the perfect contrast as an imaginative man prone to speaking in figurative language. Though they are opposites, MacWhirr and Jukes respect each other and run a tight ship, until the crew notices the barometer predicting a severe storm. Jukes and the crew suggest alternate paths to MacWhirr, but he is unconvinced. Since MacWhirr has not experienced the storm yet, he doesn't believe that it really can be much of a problem, and if they sailed around it, they would waste time. Jukes is shocked at the decision, but respects MacWhirr's conviction. They keep their course, setting sail to go directly through the storm. Though the crew objects, Jukes and MacWhirr are convinced they each made the right call, but disastrous outcomes are inevitable when facts are ignored. Now in the heart of a great typhoon, MacWhirr and Jukes must work together to save their crew. Facing tuberous winds, powerful waves and the sea's worst moods, the combination of MacWhirr's rationalism and Jukes' imagination prove to be vital.Based off of events in Joseph Conrad's sea life, Typhoon  is an allegorical work that explores consequences of making decisions without considering facts or other perspectives, while hailing the importance of tolerance and collaboration. With satirical characters and a thrilling setting, Typhoon  is both thought-provoking and adventurous. First published in 1902, Joseph Conrad's has been reprinted in many publications, including literary magazines and literary collections.  Typhoon  depicts a story of high stakes and adventure with a uniquely observant narrative style, shouldering Conrad's stylistic legacy of masterful prose.Previously published among other literary works, this edition allows Joseph Conrad's Typhoon  stand on its own. Now with a new, eye-catching cover design and printed in a modern, easy-to-read font, Typhoon  is accessible for a contemporary audience. Even nearly one-hundred and twenty years later, Conrad's adventurous, allegorical work is still relevant and intriguing as it acknowledges the various personalities required for human success and survival.",
  "genres": [
    "Fiction",
    "Classics",
    "Adventure",
    "Literature",
    "20th Century",
    "Audiobook",
    "Novella"
  ],
  "author": "Joseph Conrad",
  "average_rating": "3.64",
  "url": "https://www.goodreads.com/book/show/3537012-typhoon"
}