{
  "title": "Forty Years a Fur Trader On the Upper Missouri: The Personal Narrative of Charles Larpenteur, 1833-1872",
  "description": "\"The life-record kept by Charles Larpenteur is one of our most important sources of information concerning the fur trade of the Upper Missouri in the nineteenth century.\" — Milo Milton Quaife\n Born in France in 1807, Larpenteur’s family left his native country after the Bourbon restoration and settled in Baltimore, Maryland.  Following an insatiable appetite to explore the uncivilized West, Larpenteur joined the Rocky Mountain Fur Company in 1833 and traveled west to the mouth of the Yellowstone River.  An important part of fur-trade history, chronicling the business in the American West in the nineteenth century, Forty Years a Fur Trader is also an insightful source of Native American history.  Larpenteur had daily dealings with the Native American tribes of Montana, Wyoming and North Dakota and his journals reveal that he and many of the other trappers showed great respect to the native people, learning to live among them without attempting to eradicate established Native American life.  Forty Years a Fur Trader on the Upper Missouri is the preeminent source for the history of the fur trade in the American West. Drawing upon daily journals recorded by Charles Larpenteur it provides fascinating insight into the history of the Midwest in the nineteenth century.  “Its true inwardness is turned inside out by a chronicler whose eyes never opened to see much difference between good and evil, and who so saw nothing to conceal.” — The American Historical Review  Charles Larpenteur was an American fur trader, whose memoir and diary frequently have been used as a source to fur trade history. He diligently kept a daily diary during his time in the trade and used it to write this book at the end of his life. He died in 1872.",
  "genres": [
    "History",
    "Nonfiction",
    "Biography"
  ],
  "author": "Charles Larpenteur",
  "average_rating": "3.99",
  "url": "https://www.goodreads.com/book/show/35386728-forty-years-a-fur-trader-on-the-upper-missouri"
}