{
  "title": "The Last Wild Men of Borneo: A True Story of Death and Treasure",
  "description": "Two modern adventurers sought a treasure possessed by the legendary “Wild Men of Borneo.” One found riches. The other vanished forever into an endless jungle. Had he shed civilization—or lost his mind? Global headlines suspected murder. Lured by these mysteries, New York Times bestselling author Carl Hoffman journeyed to find the truth, discovering that nothing is as it seems in the world’s last Eden, where the lines between sinner and saint blur into one.In 1984, Swiss traveler Bruno Manser joined an expedition to the Mulu caves on Borneo, the planet’s third largest island. There he slipped into the forest interior to make contact with the Penan, an indigenous tribe of peace-loving nomads living among the Dayak people, the fabled “Headhunters of Borneo.” Bruno lived for years with the Penan, gaining acceptance as a member of the tribe. However, when commercial logging began devouring the Penan’s homeland, Bruno led the tribe against these outside forces, earning him status as an enemy of the state, but also worldwide fame as an environmental hero. He escaped captivity under gunfire twice, but the strain took a psychological toll. Then, in 2000, Bruno disappeared without a trace. Had he become a madman, a hermit, or a martyr?American Michael Palmieri is, in many ways, Bruno’s opposite. Evading the Vietnam War, the Californian wandered the world, finally settling in Bali in the 1970s. From there, he staged expeditions into the Bornean jungle to acquire astonishing art and artifacts from the Dayaks. He would become one of the world’s most successful tribal-art field collectors, supplying sacred works to prestigious museums and wealthy private collectors. And yet suspicion shadowed this self-styled buccaneer who made his living extracting the treasure of the Dayak: Was he preserving or exploiting native culture?As Carl Hoffman unravels the deepening riddle of Bruno’s disappearance and seeks answers to the questions surrounding both men, it becomes clear saint and sinner are not so easily defined and Michael and Bruno are, in a sense, two parts of one whole: each spent his life in pursuit of the sacred fire of indigenous people. The Last Wild Men of Borneo is the product of Hoffman’s extensive travels to the region, guided by Penan through jungle paths traveled by Bruno and by Palmieri himself up rivers to remote villages. Hoffman also draws on exclusive interviews with Manser’s family and colleagues, and rare access to his letters and journals. Here is a peerless adventure propelled by the entwined lives of two singular, enigmatic men whose stories reveal both the grandeur and the precarious fate of the wildest place on earth.",
  "genres": [
    "Nonfiction",
    "History",
    "Travel",
    "Adventure",
    "Biography",
    "True Crime",
    "Anthropology"
  ],
  "author": "Carl Hoffman",
  "average_rating": "3.86",
  "url": "https://www.goodreads.com/book/show/35397009-the-last-wild-men-of-borneo"
}