{
  "title": "Enough As She Is: How to Help Girls Move Beyond Impossible Standards of Success to Live Healthy, Happy, and Fulfilling Lives",
  "description": "From the New York Times bestselling author of Odd Girl Out, a deeply urgent audiobook that gives adults the tools to help girls in high school and college reject \"supergirl\" pressure, overcome a toxic stress culture, and become resilient adults with healthy, happy, and fulfilling lives.For many girls today, the drive to achieve is fueled by brutal self-criticism and an acute fear of failure. Though young women have never been more \"successful\"–outpacing boys in GPAs and college enrollment–they have also never struggled more. On the surface, girls may seem exceptional, but in reality, they are anxious and overwhelmed, feeling that, no matter how hard they try, they will never be smart enough, successful enough, pretty enough, thin enough, popular enough, or sexy enough.Rachel Simmons has been researching young women for two decades, and her research plainly shows that girl competence does not equal girl confidence—nor does it equal happiness, resilience, or self-worth. Backed by vivid case studies, Simmons warns that we have raised a generation of young women so focused on achieving that they avoid healthy risks, overthink setbacks, and suffer from imposter syndrome, believing they are frauds. As they spend more time projecting an image of effortless perfection on social media, these girls are prone to withdraw from the essential relationships that offer solace and support and bolster self-esteem.Deeply empathetic and meticulously researched, Enough As She Is offers a clear understanding of this devastating problem and provides practical parenting advice—including teaching girls self-compassion as an alternative to self-criticism, how to manage overthinking, resist the constant urge to compare themselves to peers, take healthy risks, navigate toxic elements of social media, prioritize self-care, and seek support when they need it. Enough As She Is sounds an alarm to parents and educators, arguing that young women can do more than survive adolescence. They can thrive. Enough As She Is shows us how.",
  "genres": [
    "Parenting",
    "Nonfiction",
    "Self Help",
    "Feminism",
    "Psychology",
    "Education",
    "Audiobook"
  ],
  "author": "Rachel Simmons",
  "average_rating": "4.11",
  "url": "https://www.goodreads.com/book/show/35397008-enough-as-she-is"
}