{
  "title": "JUST THE BEGINNING",
  "description": "Ben Slater, felt responsible for everything at the ranch. It was Ben that had been left for dead after an Indian attack on that very land when his parents had chosen it. On the S. and J. Ranch, the water source for the animals had gone bad. They were in danger of getting sick or worse. Ben’s solution would cause destruction to the irreplaceable treasure that part of his family secretly guarded. They needed the clean river water to replace the putrid pond. It would take many days of back breaking work and many men to make a channel. Ben worried. Many projects had to be completed before the ground froze or they would lose their homestead land. It included nearly half of the ranch. This land that held miraculous blessings was special in ways that Ben was yet to learn. They couldn’t do it all. He had to ask for help. The People of the Lion, a young new Indian tribe willingly came to the ranch to help. They tried by pick and shovel to make the channel but roots and huge rocks blocked the way. Pressured by time and need, David, Ben’s brother-in-law chose to use old, unstable dynamite. After the blasting, blood ran from his ears. He could hear nothing but the screaming sound in his head. Would he be alright? The People asked and prayed. With God’s sudden provision, Ben felt strongly compelled to buy land behind the bluff upriver. The ranch didn’t need it. How did God plan for them to use it? Perhaps that land could save the lives of all The Blue Stone Indians from the harsh reality that the soldiers sought them, to punish them for the deeds of the Winahatah. Meanwhile, a rare, rescued love finds Brother Tim. Now he had a decision to make. Would he return to finish his spiritual training at the seminary and accept his calling to become a Jesuit priest or would he open his heart to a more human calling? Later a frantic search for all the specially bred white horses of the family revealed that they were not to be found. Who could have taken them? Where are they now?  Generations later, on a day beyond today, after the rapture, the S. and J. Ranch had avoided the devastation. A heroine stood her ground against the soldiers of the Anti-Christ.  A supernatural encounter with The Lion of Judah brought faith to Emily and blessings to those left to live on the ranch through the tribulation. After a very unusual ceremony, the people of the ranch discovered that their time on the earth as joyous Christians, was, JUST THE BEGINNING. In this New Life Series, you will see the struggle of a very special family of pioneers as they build a lasting heritage. In book ten, this final edition, God’s plan is revealed to the fragment of the family. Salvation still can be had by those who seek Him.",
  "genres": [],
  "author": "Louise Bouck",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/35411304-just-the-beginning"
}