{
  "title": "You and a Billion Blue Tiles",
  "description": "Official Description: Adam Grindall and Lincoln Stone are two 18-year-olds in the final days of their senior year of high school at the Bennington Academy for Young Gentlemen in Upstate New York. Adam is convinced it's fate that draws him into the showers after a night of studying so he can finally get a chance to be with the guy he's been crushing on for two years. Lincoln had no idea being with a guy could be more than getting off, but Adam's definitely more than he ever expected. Can they make it work for more than one night? Can they build the foundation of a relationship that will last for years to come?Original Prompt:Dear Author,I would love it if these boys could tell us the story of how they came together. Starting from that mind-numbing blowjob in the showers at high-school.One of the boys could simply no longer hide his feelings and lust and spurred by the acceptance of intimate contact by his colleague, he confessed his love. And was rewarded with a confession in return and more days of fun and loving.Photo Description: Surrounded by azure tiles, two naked young men share a shower. One stands, arms up-stretched to grip the shower-head, eyes closed. In front of him the shorter boy presses close, bellies touching, his hand gliding soap up one raised, exposed armpit, mouths hovering an inch away from the kiss. This story was written as a part of the M/M Romance Group's \"Hot Summer Days\" event. Group members were asked to write a story prompt inspired by a photo of their choice. Authors of the group selected a photo and prompt that spoke to them and wrote a short story.Download the story, read it here or find it in Don't Read in the Closet, Volume 3 or Don't Read in the Closet: GayRomLit Retreat 2011 Special Edition.__________Genre: contemporaryTags: gay m/m, coming-of-age, virgin, high school, teens, coming outWarnings: teenagers (both 18)Word Count: 9,322",
  "genres": [
    "M M Romance",
    "Short Stories",
    "Romance",
    "Contemporary",
    "Erotica",
    "Young Adult",
    "LGBT"
  ],
  "author": "Missy Welsh",
  "average_rating": "3.93",
  "url": "https://www.goodreads.com/book/show/12128416-you-and-a-billion-blue-tiles"
}