{
  "title": "Wallis in Love: The Untold Life of the Duchess of Windsor, the Woman Who Changed the Monarchy",
  "description": "For fans of the Netflix series The Crown and from the author of the New York Times bestseller 17 Carnations comes a captivating biography of Wallis Simpson, the notorious woman for whom Edward VIII gave up the throne.\"You have no idea how hard it is to live out a great romance.\" -- Wallis SimpsonBefore she became known as the woman who enticed a king from his throne and birthright, Bessie Wallis Warfield was a prudish and particular girl from Baltimore. At turns imaginative, ambitious, and spoiled, Wallis's first words as recalled by her family were \"me, me.\" From that young age, she was in want of nothing but stability, status, and social acceptance as she fought to climb the social ladder and take her place in London society. As irony would have it, she would gain the love and devotion of a king, but only at the cost of his throne and her reputation.In Wallis in Love , acclaimed biographer Andrew Morton offers a fresh portrait of Wallis Simpson in all her vibrancy and brazenness as she transformed from a hard-nosed gold-digger to charming chatelaine. Using diary entries, letters, and other never-before-seen records, Morton takes us through Wallis's romantic adventures in Washington, China, and her entrance into the strange wonderland that is London society. During her journey, we meet an extraordinary array of characters, many of whom smoothed the way for her dalliance with the king of England, Edward VIII.Wallis in Love goes beyond Wallis's infamous persona and reveals a complex, domineering woman striving to determine her own fate and grapple with matters of the heart.",
  "genres": [
    "Biography",
    "Nonfiction",
    "History",
    "Audiobook",
    "British Literature",
    "Biography Memoir",
    "Memoir"
  ],
  "author": "Andrew Morton",
  "average_rating": "3.57",
  "url": "https://www.goodreads.com/book/show/35397723-wallis-in-love"
}