{
  "title": "Love, One Summer in Bath: A Regency Romance Summer Collection",
  "description": "8 delightful Regency Summer stories from bestselling authors – Lose yourself in love! **FREE ON KINDLE UNLIMITED** Enchanting the Duke A young Lady, a too charming Lord, an elegant Duke, an infatuation, a dramatic confrontation, a chance for real love. Lady Cordelia Branley, daughter of Baron Tillingford, in London for the first time, is captivated by Lord Edward Fitzhugh. But her chaperone, Miss Millpost, is not so convinced of the young Lord’s character. Philip Canterwood, Duke of Rotherhithe, is set in his ways as a widower – until the request of his dying friend, Baron Tillingford, to investigate the man that Lady Cordelia fancies herself in love with. Once he begins to look into it, everything changes… Is Lord Edward as charming and pleasant as he seems? Will Lady Cordelia find true love in the end? Or will she be blinded by charm with no substance? And will the Duke allow himself to love again? The Duke and the Lady’s Maid Eric Caxton, the Duke of Amesbury, suspected that Olivia was no ordinary lady's maid. She was too refined and a bit impertinent. All Olivia wanted was to free herself from the employ of her aunt and cousin who delighted in her discomfort. A summer trip to Bath would be just the ticket to find a respectable Lady in need of a maid, but Olivia found more than she bargained for when she caught the interest of the Duke.  Hope for Charity Rumor has it that the Earl of Wentwell is a self-serving rogue who is desired by all the women of the Ton. Lady Charity Abernathy is the epitome of naiveté and believes everything she hears. Both are hoping for happiness. Both are longing for love. And things are not always what they seem.  Summer with the Duke Abigail Jones is unhappy with life on her family’s farm and flees to Bath for the summer, to work in her aunt and uncle’s shop. Quite by accident, she meets the Duke of Hampston’s daughter, who takes an immediate liking to her, and invites her to her home for tea. Abigail, unaware that she will be visiting the home of a Duke, agrees. Jealousy ensues when the Duke’s almost fiancée sees how well both the daughter and the Duke hit it off with Abigail. Will the Duke stay the course and marry Lady Margaret? Or will he confess that he’s secretly falling for Abigail?  The Duke’s First Love Rose expected a proposal from the dashing Duke of Highbury, but it did not come. When she finds out he is marrying another, she reluctantly goes with her family to Bath for the summer. Will the round of summer parties help wash her sour memories away? The Duke’s Scandalous Scholar Widower Evan Aldercliffe, Duke of Foxchester, joins his family in Bath, hoping to regain his footing and recover from grief. There he meets Bridget Stanhope, a free-spirited woman who thinks that all men are foolish. Sparks fly immediately, but the result is... magical.  The Governess and the Scandalous Duke Miss Beatrice Lakeheart is left in the most unfortunate circumstances after the death of her mother and the remarriage of her Papa. When she is offered employment as a governess for the scandalous, world weary Duke of Carrington, little does she know that her very innocence will attract him to her like a moth to a flame. But between her jealous stepbrother and his jealous (and unpleasant) fiancée, can they still find their happily ever after?  Amelia and the Earl Amelia Dane, plain, sensible, and poor, gave up her",
  "genres": [
    "Historical Romance",
    "Regency"
  ],
  "author": "Arietta Richmond",
  "average_rating": "3.69",
  "url": "https://www.goodreads.com/book/show/35400310-love-one-summer-in-bath"
}