{
  "title": "Shaya: An Odyssey of Food, My Journey Back to Israel: A Cookbook",
  "description": "An exciting debut cookbook that confirms the arrival of a new guru chef . . . A moving, deeply personal journey of survival and discovery that tells of the evolution of a cuisine and of the transformative power and magic of food and cooking. From the two-time James Beard Award-winning chef whose celebrated New Orleans restaurants have been hailed as the country's most innovative and best by Bon Appétit, Food & Wine, Saveur, GQ, and Esquire.\"Alon's journey is as gripping and as seductive as his cooking . . . Lovely stories, terrific food.\" --Yotam Ottolenghi, author of A Cookbook\"Breathtaking. Bravo.\" --Joan Nathan, author of King Solomon's TableAlon Shaya's is no ordinary cookbook. It is a memoir of a culinary sensibility that begins in Israel and wends its way from the U.S.A. (Philadelphia) to Italy (Milan and Bergamo), back to Israel (Jerusalem) and comes together in the American South, in the heart of New Orleans. It's a book that tells of how food saved the author's life and how, through a circuitous path of (cooking) twists and (life-affirming) turns the author's celebrated cuisine--food of his native Israel with a creole New Orleans kick came to be, along with his award-winning New Orleans Shaya, Domenica, and Pizza Domenica, ranked by Esquire, Bon Appétit, and others as the best new restaurants in the United States.     These are stories of place, of people, and of the food that connects them, a memoir of one man's culinary sensibility, with food as the continuum throughout his journey--guiding his personal and professional decisions, punctuating every memory, choice, every turning point in his life. Interspersed with glorious full-color photographs and illustrations that follow the course of all the flavors Shaya has tried, places he's traveled, things he's experienced, lessons he's learned--more than one hundred recipes--from Roasted Chicken with Harissa to Speckled Trout with Tahini and Pine Nuts; Crab Cakes with Preserved Lemon Aioli; Roasted Cast-Iron Ribeye; Marinated Soft Cheese with Herbs and Spices; Buttermilk Biscuits; and Whole Roasted Cauliflower with Whipped Feta.",
  "genres": [
    "Cookbooks",
    "Cooking",
    "Food",
    "Nonfiction",
    "Jewish",
    "Memoir",
    "Israel"
  ],
  "author": "Alon Shaya",
  "average_rating": "4.14",
  "url": "https://www.goodreads.com/book/show/35408328-shaya"
}