{
  "title": "Seedy Business",
  "description": "Official Description: Revenge can get sticky.This prequel to Grown Men* is a crazy sci-fi short about sperm piracy and sibling rivalry gone seriously wrong.When corporate mercenary Beirn agrees to a sleazy organ harvest job, he walks straight into his worst nightmare, a trap set by the twin brother he betrayed. Against his better judgment, Beirn teams up with a semen smuggler to save his own skin and hopefully make amends to the only family he has left.Loathing turns to lust as the two men grapple with their violent impulses and their growing desire. In one terrible night, impossible feelings will force Beirn to understand the brother he betrayed and the mistakes he's made. Warning: doublecrosses, dirty sex, and designer testicles * These stories can be read in any order.Original Prompt:Dear Author,My momma always told me anything was possible...but I'm not too sure she'd considered these boys! Will you prove my momma right?Photo Description: Two smiling, uncut men stand naked next to each other beside a grey tree on a tropical beach. One is hyper-masculine, all-over bigger and hairier than the other. His right arm drapes over the right shoulder of the shorter man, who barely reaches his shoulder in height.This story was written as a part of the M/M Romance Group's \"Hot Summer Days\" event. Group members were asked to write a story prompt inspired by a photo of their choice. Authors of the group selected a photo and prompt that spoke to them and wrote a short story.Download the story, read it here or find it in Don't Read in the Closet, Volume 3 or Don't Read in the Closet: GayRomLit Retreat 2011 Special Edition.__________Genre: sci-fiTags: gay m/m, sperm piracy, giant, mercenary, criminals, hormones, twins, doublecross, sounding, science fictionWord Count: 12,055",
  "genres": [
    "M M Romance",
    "Science Fiction",
    "Short Stories",
    "Romance",
    "Gay",
    "Fantasy",
    "Futuristic"
  ],
  "author": "Damon Suede",
  "average_rating": "3.45",
  "url": "https://www.goodreads.com/book/show/12128250-seedy-business"
}