{
  "title": "The Creek Side Bones: Reality is more horrifying than fiction",
  "description": "This real-life tragedy began on a stormy night with a knock at the front door. A friend needed help with his car. What happened to Carl, Lisa, Gregory, and Felicia that night is worse than any fictional horror story you’ve ever read or seen on the big screen. Little girls should never have to live in a barrel … Award-winning journalist and best-selling author George Jared takes readers on a gripping and chilling journey with his latest true-crime book, The Creek Side Bones … Reality is more horrifying than fiction. The book details how the Elliott family in Dalton, Ark., lived in constant fear in the summer 1998. How they met their fates is ghastly. Jared covered two murder trials in connection with the case, and provides his own theories as to how and why the Elliott family was murdered. Four other murder cases are also detailed in the book. Sidney Nicole Randall was a beauty pageant queen, about to enter high school when a monster stole her away in the dark. Bridgett Sellers was a mother of three who vanished without a trace while on a walk down Peace Valley Road. Her fate is incomprehensible. Bob Castleman was a respected attorney and Vietnam War vet until the drugs, murder, a live copperhead snake; Native American artifact fraud consumed his life. The book also includes an update on the unsolved Rebekah Gould case. The 22-year-old college student was murdered Sept. 20, 2004, in Melbourne, Arkansas. There are suspects in the case, but to this day, no one has been jailed for her brutal death. Jared has won numerous first place awards for investigative journalism, feature writing, news stories, and others with the coveted Associated Press Managing Editors and the Arkansas Press Association. His first book Witches in West Memphis … and another false confession detailed his coverage of the internationally famous “West Memphis Three” case. Three Marion, Ark., teens – Damien Echols, Jason Baldwin, and Jessie Misskelley Jr. – were convicted in the 1993 murders Christopher Byers, Stevie Branch, and Michael Moore. The boys’ bodies were found nude and bound in a drainage ditch near their homes one day after they disappeared May 5, 1993. Prosecutors claimed the boys were sacrificed in a Satanic ceremony orchestrated by the convicted. There was only one problem. These three didn’t do it. It took nearly 20 years to free them. Jared wrote more stories about the case than any journalist in the world. He was cited in Life After Death, a New York Times best-selling book about the case. He also received credit for in the Academy Award nominated documentary Paradise Lost Three … Purgatory also about the case. Through the years, the longtime newsman has written thousands of stories on a wide range of topics. Get a copy of The Creek Side Bones today.",
  "genres": [
    "True Crime",
    "Nonfiction"
  ],
  "author": "George Jared",
  "average_rating": "3.75",
  "url": "https://www.goodreads.com/book/show/35399025-the-creek-side-bones"
}