{
  "title": "The Wrecking Crew: The Inside Story of Rock and Roll's Best-Kept Secret",
  "description": "Winner of the Oregon Book Award for General Nonfiction and Los Angeles Times bestseller\n\n\n\n\"It makes good music sound better.\"--Janet Maslin in The New York Times\n\n\n\n\n\"A fascinating look into the West Coast recording studio scene of the '60s and the inside story of the music you heard on the radio. If you always assumed the musicians you listened to were the same people you saw onstage, you are in for a big surprise!\"--Dusty Street, host of Classic Vinyl on Sirius XM Satellite RadioIf you were a fan of popular music in the 1960s and early '70s, you were a fan of the Wrecking Crew--whether you knew it or not.On hit record after hit record by everyone from the Byrds, the Beach Boys, and the Monkees to the Grass Roots, the 5th Dimension, Sonny & Cher, and Simon & Garfunkel, this collection of West Coast studio musicians from diverse backgrounds established themselves in Los Angeles, California as the driving sound of pop music--sometimes over the objection of actual band members forced to make way for Wrecking Crew members. Industry insider Kent Hartman tells the dramatic, definitive story of the musicians who forged a reputation throughout the business as the secret weapons behind the top recording stars.Mining invaluable interviews, the author follows the careers of such session masters as drummer Hal Blaine and keyboardist Larry Knechtel, as well as trailblazing bassist Carol Kaye--the only female in the bunch--who went on to play in thousands of recording sessions in this rock history. Readers will discover the Wrecking Crew members who would forge careers in their own right, including Glen Campbell and Leon Russell, and learn of the relationship between the Crew and such legends as Phil Spector and Jimmy Webb. Hartman also takes us inside the studio for the legendary sessions that gave us Pet Sounds, Bridge Over Troubled Water, and the rock classic \"Layla,\" which Wrecking Crew drummer Jim Gordon cowrote with Eric Clapton for Derek and the Dominos. And the author recounts priceless scenes such as Mike Nesmith of the Monkees facing off with studio head Don Kirshner, Grass Roots lead guitarist (and future star of The Office) Creed Bratton getting fired from the group, and Michel Rubini unseating Frank Sinatra's pianist for the session in which the iconic singer improvised the hit-making ending to \"Strangers in the Night.\"The Wrecking Crew tells the collective, behind-the-scenes stories of the artists who dominated Top 40 radio during the most exciting time in American popular culture.",
  "genres": [
    "Music",
    "Nonfiction",
    "History",
    "Biography",
    "Audiobook",
    "Pop Culture",
    "Music Biography"
  ],
  "author": "Kent Hartman",
  "average_rating": "4.06",
  "url": "https://www.goodreads.com/book/show/12129983-the-wrecking-crew"
}