{
  "title": "The Sparsholt Affair",
  "description": "From the internationally acclaimed winner of the Man Booker Prize, a sweeping new novel that explores richly complex relationships between fathers and sons as it spans seven transformative decades in England, from the 1940s through the presentIn the fall of 1940, with the world at war, a young man arrives at Oxford to study engineering, though his sights are already set on joining the Royal Air Force as a pilot. Handsome, charismatic, a powerful athlete and oarsman, David Sparsholt seems at first unaware of the effect he has on others--especially on the lonely and romantic Evert Dax, son of a celebrated novelist, himself also destined to become a writer. While the Blitz rages in London, Oxford exists at a strange remove from the action: a place of transience and uncertainty, the fears and rigors of the blackout both encouraging and concealing unexpected liaisons. Between these two young men of very different backgrounds an unusual friendship develops, one whose consequences will unfold over the many years that follow.Alan Hollinghurst's masterly new novel evokes the intimate lives of three generations of Sparsholts in a sequence of vividly rendered episodes: a childhood holiday in Cornwall; eccentric social gatherings at the Dax family home; the adventures of David's son Johnny, in pursuit of love and a career as a painter in 1970s London. Changes in taste, morality, and private life are explored in a group portrait of friends brought together by art, literature, and love. Champions of the Modern live to see modernity itself becoming history, while more personal, life-changing crises and scandals--including that which gives this novel its title--recede into the past, leaving their ambiguous traces. And as gay men and women live in increasing freedom and openness, and the gay scene evolves into new forms and possibilities, The Sparsholt Affair becomes a meditation on human transience, even as it expresses the countervailing longing for permanence and continuity.Witty, tender, epic in scope yet rich in observation, The Sparsholt Affair is a dazzling new work of fiction by a writer justly hailed by the Wall Street Journal as \"one of the best novelists at work today.\"",
  "genres": [
    "Fiction",
    "Historical Fiction",
    "LGBT",
    "Queer",
    "Gay",
    "Historical",
    "Literary Fiction"
  ],
  "author": "Alan Hollinghurst",
  "average_rating": "3.54",
  "url": "https://www.goodreads.com/book/show/35427341-the-sparsholt-affair"
}