{
  "title": "ኅሠሣ",
  "description": "\"ይህ “ኀሠሣ” የተሰኘው የሕይወት ተፈራ መጽሐፍ፥ በውብ ሥናዊ የብዕር አተራረክ፥ የኢትዮጵያን “የባሕል”፥ “የትምህርት”፥ “የፍልስፍና”፥ እንዲሁም“ የሃገረ-ሰብእ” ወዘተ. ይትበሃሎችን መሠረት አድርጎ የተነሳ ሥነ-ጽሑፋዊ ሥራ ነው። ለትረካዋ ዋና ማዕከል ባደረገችው በጥንታዊው የአብነት ትምህርት ሥርዓት ውስጥ ቤተክርስቲያን ከጥንትም የትምህርት ማዕከል መሆኗን፥ ለመንፈሳዊም ሆነ ለምድራዊ አገልግሎት የሚሆኑ ችሎታ ያላቸውን ልጆች መርጣ፥አሳድጋ እና አስተምራ ሠናይ የሆኑ ሊቃውንትን ስታፈራ መቆየቷን በዋና ገፀ-ባሕርዩ የሕይወት ተሞክሮ ተመርኩዛ ታሳየናለች።መጽሐፉ በሥነ-ጽሑፋዊ ለዛው የሚደነቀውን ያህል፥በጽሑፍ መንፈሱ፥ የኢትዮጵያን ጥንታዊ ትምህርት ከአውሮፓው የትምህርት ፍልስፍና ጋር በማወዳደር፥ በማነጻጸር ወይም በማፎካከር ዘይቤ የቀረበ ሳይሆን፥ የተዋሥዖ ሥነ-ዘዴን ተከትሎ ሥርዓተ ወጉን እንዳለ በመተረክ በሚያስደምም መልኩ የተጻፈ ሥነ-ጽሑፋዊ ሥራ ነው። ይህንን ለማድረግም፥ ደራሲዋ ወደታላላቆቹ ጥንታውያን የቅኔ የምስክር መካናት በአካል በመሄድ የጥናት ሥራዋን አካሂዳለች፥ ጠይቃለች፥ ተወያይታለች፥ ተደንቃለች። በየሊቃውንት መንበረ ጉባኤዎቹ ውስጥ ያገኘችውን፥ ያስተዋለችውን እና የተደነቀችበትን ታላቅ ቁም ነገር፥ እንዲሁ በደረቅ የጥናት ወረቀት መልክ ከማቅረብ ይልቅ፥ ልበ-ወለዳዊ አጻጻፍን እና የልበ-ወለድ አላባውያንን በመጠቀም መጻፍን መርጣለች። ይህም ለመጽሐፉ ሳይሰለች የመነበብ ጸጋ ይጨምርለታል። የመጽሐፉ ትልቅ ረድኤት፥ የኢትዮጵያን የፍልስፍና መሠረት “ቅኔን”፥ ከነሥርዓቱ በመጠኑም ቢሆን ማስተዋወቁ ላይ ነው። እንደ እውነቱም፥ የኢትዮጵያ ፍልስፍና ቢመረመር፤ የአቀራረብ መንፈሱ በሊቃውንቱ ቅኔ እና በቅኔ ወንበር ላይ እንደሚገኝ፥ የሕይወት ተፈራ መጽሐፍ ሁነኛ ምስክር ሆኖ ያስረዳናል። ቅኔ የብዙ ጻማ (ልፋት) ውጤት ነው። ቅኔ፤ የአእምሮን ጥንካሬና፥ ብስለት፥ የምናብን ርቀት፥ ማስተዋልን፥ መተንተንን፥ መግለጽን፥ መጠየቅን እና መራቀቅን አካቶ የያዘ የአእምሮ ጎዳና ሲሆን፥ ከተፈጥሮ ጋር በእጅጉ የተቆራኘ ጥበብም ነው። የምዕራቡ ዓለም የፍልስፍና ታሪክ ዘጋቢዎች “ፍጥረት የፍልስፍና ግኝት ናት” እንደሚሉት፥ እኛም “ፍጥረት የቅኔ ግኝት ናት፤” ማለት እንደምንችል፥ ይህ የሕይወት ተፈራ መጽሐፍ ትልቅ ዋቢ ሆኖ ያስረዳናል።\"ዶከተር ዳኛችው አሰፋ\"ኢትዮጵያ በረጅም ታሪኳ ካፈራቻቸው ትውፊቶቿ አንዱ የቤተ ክህነት ትምህርት ነው። የኢትዮጵያ ታሪክና ሥልጣኔ በተጻፈ ቁጥር የሚዘከሩት፤ የቁሳዊው ሥልጣኔ ነፀብራቅ የሆኑት ቅርሶች ናቸው። ነገር ግን የቤተክህነቱ ትምህርት በዘመናት ጉዞው የላሊበላ አብያተ ክርስቲያናትን፤ ቅዱስ ያሬድና ተዋነይን፤ መምህር ኤስድሮስን፤ አባ ጊዮርጊስ ዘጋስጫን፤ መምህር አካለወልድን እና ሌሎችንም ብርቅየ ቅርሶችና የበቁና የረቀቁ ሊቃውንት ያፈራ ነው።ሕይወት በዚህ ‘ኅሠሣ’ በተሰኘ መጽሐፏ የምታሳየን እኒህ ቅርሶችና ሊቃውንት ዘወትር ሊሚወሱበት ታሪክ እንዲሁም ለሚደነቁበት ልህቀት የበቁት የልጅነት ሕልማቸውን የሕይወታቸው ግብ አድርገው ትምህርቱ የሚጠይቀውን መከራ ችለው ፈተናውን ተወጥተው ሕልማቸውን የሚያሰናክል ፍላጎትን ገትተው በታላላቆቻቸውና በመምህሮቻቸው ተገስጸውና ታንፀው መሆኑን ነው። ሕይወት ይህን ታሪካዊ እውነት በልብ ወለድ መልክ ስታቀርበውም ሁነኛ መቼት መርጣ ነው። ከ20ኛው ክፍለ ዘመን ጀምሮ በባለቤቱ ሳይቀር የተረሳውን ይህን የታሪካችን ዓይነተኛ ትውፊት የዘመናችን ትውልድ በሚረዳው አተራረክ አቅርባዋለች።የመጽሐፉ ውጤት ምን እንደሚሆን መተንበይ ከባድ ቢሆንም ሕይወት ግን ለዚህ ታሪካዊ የትምህርት ትውፊት ማንሰራሪያ የሚሆን የሕይወት እስትንፋስ ሰጥታዋለች።\"አበባው አያሌው (ረዳት ፕሮፌሰር)አዲስ አበባ ዩኒቨርሲቲ",
  "genres": [],
  "author": "Hiwot Teffera",
  "average_rating": "3.86",
  "url": "https://www.goodreads.com/book/show/35420794"
}