{
  "title": "Rising the Beast",
  "description": "Returning home from their harrowing battle with the Truer Sin in the vast highlands of Scotland, Gabrio and Esmerelda suffer from the traumatic events that took place. While fearing for the life of their unborn child, they discover a shocking revelation- there's a twin brother. Uncertain the second and smaller twin was created by natural means or by the Truer Sin, Esmeralda became overburdened. Yet, tired and weary of their plight, she wanted a measure a peace like they had before. the betrayal of the Truer Sin. With two prophecies fulfilled and no others awaiting fruition, Esmeralda took that as an omen of peace. Begging Gabrio to not involve the Blood Tasters, she suggested they would put the past behind them and raise the boys together in solace. Desperate for a stable life once more, Gabrio apprehensively agreed. Yet, a fate that's bound to blood is impossible to escape. As the years passed, Thaddeus Santos was raised in the confines of a safe haven, unknowing of what everyone knows him to be- The Hybrid. Now, well into manhood, Thaddeus has followed his instincts and his heart which leads him to the Temple Circles where he must fight fate only to have it become revealed all the sooner. Meanwhile, a new evil power rises with worse motives behind his dark eyes and a sly tongue. Cursed by the Truer Sin, Judea was more than a walking corpse filled with sinister secrets and ancient plots. Yet, with the death of the first Truer Sin and the aid of the gypsy woman of great power, Judea's mission is to find the Mark of the Resurrection and end it once and for all. In this third installment of the Beast Trilogy, Journey with the Santos family as they're divided in hopes of retrieving Thaddeus from his captors while conquering the unknown demonic power that is destroying humanity and bringing an end to the world.",
  "genres": [],
  "author": "M.A. Levi",
  "average_rating": "4.88",
  "url": "https://www.goodreads.com/book/show/35433584-rising-the-beast"
}