{
  "title": "The Exorcism of Little Billy Wagner",
  "description": "The frantic parents of Little Billy Wagner are at a loss as to what to do when their son shows signs of demonic possession. When the medical community can offer no answers, they turn to their Catholic Church. The Archbishop a prominent hawk in the war on Satan is more than willing to help the Wagners. Though in precarious health ( His bypasses had bypasses ), he always knew The Evil One would show up on his watch and he s now ready to send in the exorcists. But first, the Church has to determine whether Little Billy Wagner is demonically possessed. Enter the handsome Father Leopold Mackenzie. Father Leo wants to be a priest. He believes God wants him to be a good priest. He aspires to return to a parish in Bolivia where he spent many happy days in his favorite llama-wool sweater and was accepted by the kind Boliviano parishioners. To make this happen, he just needs to do a good job on the Billy Wagner matter and keep the lovely Veronica Fields, from the parish s conversion class, far away from him and in moments of weakness not think of ways to make her his rectory mate. Father Leo visits the Wagners and soon determines that Little Billy is clearly possessed, but, the question is, by what? Knowing an underlying medical cause must first be ruled out, Father Leo starts gathering information and medical reports and hires the famed Jesuit psychiatrist, the dhoti-wearing Father Caspar Wieland, MD/PhD/SJ. Meanwhile, the Archbishop gathers his exorcism team (including bringing in ex-special forces Monsignor Krebs, despite his handling of the exorcism in The River City Delirium Tremens Burro Incident ) and prepares to make the case to the Vatican to get the authority to send in the exorcists. Can Father Leo stop a Rush to Exorcism before it s too late? Or is Little Billy demonically possessed, and by trying to stop the exorcism, is Father Leo allowing Satan and his legion into America s heartland?",
  "genres": [],
  "author": "Francis J. Flynn",
  "average_rating": "4.28",
  "url": "https://www.goodreads.com/book/show/35433958-the-exorcism-of-little-billy-wagner"
}