{
  "title": "Brain Surgeon: A Doctor's Inspiring Encounters with Mortality and Miracles",
  "description": "Welcome to tiger the treacherous territory where a single wrong move by a brain surgeon can devastate-or end-a patient's life. This is the terrain world-renowned neurosurgeon Keith Black, MD, enters every day to produce virtual medical miracles. Now, in BRAIN SURGEON, Dr. Black invites readers to shadow his breathtaking journeys into the brain as he battles some of the deadliest and most feared tumors known to medical science. Along the way, he shares his unique insights about the inner workings of the brain, his unwavering optimism for the future of medicine, and the extraordinary stories of his patients-from ministers and rock stars to wealthy entrepreneurs and uninsured students-whom he celebrates as the real heroes.BRAIN SURGEON offers a window into one man's remarkable mind, revealing the anatomy of the unflinching confidence of this master surgeon, whose personal journey brought him from life as a young African-American boy growing up in the civil rights era South to the elite world of neurosurgery. Through Dr. Black's white-knuckle descriptions of some of the most astonishing medical procedures performed today, he reveals the beauty and marvel of the human brain and the strength and heroism of his patients who refuse to see themselves as victims. Ultimately, BRAIN SURGEON is an inspiring story of the struggle to overcome odds-whether as a man, a doctor, or a patient.\"BRAIN SURGEON is an inspirational book about true heroes-readers will marvel at Keith Black's achievements both as a doctor and as a man, and will be in awe of his patients' courage and will to survive.\" --Denzel WashingtonI often get asked who the best doctor is in the world for various ailments. Truth is, it's a hard question. When it comes to brain tumors, however, the answer is pretty Keith Black. He is the doctor people find when all the other doctors have given up. He is that guy. This book is about the heroic patients he has already helped and saved. If you want a rare, behind-the-curtain look at the life of one of the most pre-eminent neurosurgeons in the world, pick up Brain Surgeon . And Keith, from one brain surgeon to thank you for honoring our profession. Well done. --Sanjay Gupta, MD, Chief Medical Correspondent, CNN and New York Times bestselling author of Chasing Life",
  "genres": [
    "Medical",
    "Medicine",
    "Nonfiction",
    "Neuroscience",
    "Memoir",
    "Science",
    "Autobiography"
  ],
  "author": "Keith Black",
  "average_rating": "4.07",
  "url": "https://www.goodreads.com/book/show/3544228-brain-surgeon"
}