{
  "title": "Lights On, Rats Out",
  "description": "“A harrowing, beautiful, searching, and deeply literary memoir. In these pages, we watch Cree LeFavour evolve from a wounded (and wounding) lost girl to a woman who can at last regard her existence with a modicum of mercy and forgiveness...a story of true self-salvation and transformation.”—Elizabeth GilbertAs a young college graduate a year into treatment with a psychiatrist, Cree LeFavour's began to organize her days around the cruel, compulsive logic of self-harm: with each newly lit cigarette, the world would drop away as her focus narrowed to an unblemished patch of skin calling out for attention and the fierce, blooming release of pleasure-pain as the burning tip was applied to the skin. Her body was a canvas of cruelty; each scar a mark of pride and shame.In sharp and shocking language, Lights On, Rats Out brings us closely into these years, allowing us to feel the pull of a stark compulsion taking over a mind. We see the world as Cree did—turned upside down, the richness of life muted and dulled, its pleasures perverted. The heady, vertiginous thrill of meeting with her psychiatrist, Dr. X—whose relationship with Cree is at once sustaining and paralyzing—comes to be the only bright spot in her mental solitude.Her extraordinary access to and inclusion of the notes kept by Dr. X during treatment offer concrete evidence of Cree’s transformation over 3 years of therapy. But it is her own evocative and razor-sharp prose that traces a path from a lonely and often sad childhood to her reluctant commitment to and emergence from a psychiatric hospital, to the saving refuge of literature and eventual acceptance of love. Moving deftly between the dialogue and observations from psychiatric records and elegant, incisive reflection on youth and early adulthood, Lights On, Rats Out illuminates a fiercely bright and independent woman’s charged attachment to a mental health professional and the dangerous compulsion to keep him in her life at all costs.",
  "genres": [
    "Memoir",
    "Nonfiction",
    "Mental Illness",
    "Psychology",
    "Mental Health",
    "Biography Memoir",
    "Adult"
  ],
  "author": "Cree LeFavour",
  "average_rating": "3.33",
  "url": "https://www.goodreads.com/book/show/35434849-lights-on-rats-out"
}