{
  "title": "The American Miracle: Divine Providence in the Rise of the Republic",
  "description": "The history of the United States displays an uncanny pattern: At moments of crisis, when the odds against success seem overwhelming and disaster looks imminent, fate intervenes to provide deliverance and progress. Historians may categorize these incidents as happy accidents, callous crimes, or the product of brilliant leadership, but the most notable leaders of the past four hundred years have identified this good fortune as something else--a reflection of divine providence. In The American Miracle, bestselling author and radio host Michael Medved recounts some of the most significant events in America's rise to prosperity and power, from the writing of the Constitution to the Civil War. He reveals a record of improbabilities and amazements that demonstrate what the Founders always believed: that events unfolded according to a master plan, with destiny playing an unmistakable role in lifting the nation to greatness.Among the stirring, illogical episodes described here:- A band of desperate religious refugees find themselves blown hopelessly off course, only to be deposited at the one spot on a wild continent best suited for their survival- George Washington's beaten army, surrounded by a ruthless foe and on the verge of annihilation, manages an impossible escape due to a freakish change in the weather- A famous conqueror known for seizing territory, frustrated by a slave rebellion and a frozen harbor, impulsively hands Thomas Jefferson a tract of land that doubles the size of the United States- A weary soldier picks up three cigars left behind in an open field and notices the stogies have been wrapped in a handwritten description of the enemy's secret battle plans--a revelation that gives Lincoln the supernatural sign he's awaited in order to free the slavesWhen millions worry over the nation losing its way, Medved's sweeping narrative, bursting with dramatic events and lively portraits of unforgettable, occasionally little-known characters, affirms America as \"fortune's favorite,\" shaped by a distinctive destiny from our beginnings to the present day.From the Hardcover edition.",
  "genres": [
    "History",
    "Nonfiction",
    "American History",
    "Politics",
    "Historical",
    "Christian",
    "Religion"
  ],
  "author": "Michael Medved",
  "average_rating": "4.34",
  "url": "https://www.goodreads.com/book/show/35439894-the-american-miracle"
}