{
  "title": "Released",
  "description": "Lord Dixon is known among the wilder members of the ton for two things, his very exclusive brothels specializing in the most exotic of pleasures and his habit of keeping a concubine, a well-paid, full-time prostitute, at his country home for a year at a time.Jim Smith has just finished two years working for the notorious Lord Dixon as his concubine, a private, full-time prostitute at his country house, but it’s gotten him what he wanted, enough money to leave behind the brothels of London and buy himself a small country cottage where he can grow plants and live quietly with no one knowing about his time at Dixon’s or the years before that working as a prostitute.Sir Lionel Westin has spent his life so far getting his brother and the family business out of one scrape after another while building his own successful tea business, and he’s just learned it was for naught. His father left the entire business to his older brother with no mention of all Lionel’s work. At least he’s enjoying the journey to back to his country estate with the amusing and understanding Mr. Smith, so much so that he invites Mr. Smith to stay with him at Hensley House. Unfortunately, Mr. Smith doesn’t seem to have found the trip as enjoyable as he turns down the invitation.Jim knows he should keep his distance from the handsome, kind Sir Lionel Westin, and he intends to until a storm forces Jim to take Lionel’s offer of a room at Hensley House, and then it seems only natural to offer to warm his bed. But as they spend time together, Jim realizes he’s falling in love with Sir Lionel Westin. He also knows he’ll need to leave before Lionel realizes it. Surely Sir Lionel Westin deserves better than a prostitute and former concubine to the notorious Lord Dixon. And when Jim learns Lord Dixon purchased a country house nearby, he knows it’s only a matter of time before all his secrets come to light.A steamy gay - M/M romance novel set in the Regency period with some BDSM elements. 68,000 words/ approx. 270 pages",
  "genres": [
    "Historical",
    "M M Romance",
    "Romance",
    "M M Historical Romance",
    "Historical Romance",
    "Historical Fiction",
    "Queer"
  ],
  "author": "Adella J. Harris",
  "average_rating": "3.53",
  "url": "https://www.goodreads.com/book/show/35438473-released"
}