{
  "title": "Star Wars: Millennium Falcon",
  "description": "Two years have passed since Jacen Solo, seduced by the dark side and reanointed as the brutal Sith Lord Darth Caedus, died at the hands of his twin sister, Jaina, Sword of the Jedi. For a grieving Han and Leia, the shadow of their son’s tragic downfall still looms large. But Jacen’s own bright and loving daughter, Allana, offers a ray of hope for the future as she thrives in her grandparents’ care. And when the eager, inquisitive girl, in whom the Force grows ever stronger, makes a curious discovery aboard her grandfather’s beloved spacecraft–the much-overhauled but ever-dependable Millennium Falcon–the Solo family finds itself at a new turning point, about to set out on an odyssey into uncertain territory, untold adventure, and unexpected rewards.To Han, who knows every bolt, weld, and sensor of the Falcon as if they were parts of himself, the strange device Allana shows him is utterly alien. But its confounding presence–and Allana’s infectious desire to unravel its mystery–are impossible to dismiss. The only answer lies in backtracking into the past on a fact-finding expedition to retrace the people, places, and events in the checkered history of the vessel that’s done everything from making the Kessel Run “in less than twelve parsecs” to helping topple an evil empire.From the moment the Falcon broke loose from a Corellian assembly line like an untamed creature with a will of its own, it seemed destined to seek out trouble. It wasn’t long before the feisty YT-1300 freighter went from shuttling cargo to smuggling contraband. But it‘s a fateful rendezvous on Coruscant, at the explosive height of the Republic/Separatist uprising, that launches a galaxywide cat-and-mouse game whose newest players are Han, Leia, Allana, and C-3PO. And they’re not Crime lords, galactic pirates, rogue politicians, and fortune hunters alike loom at every turn of the quest–each with his or her own desperate stake in the Millennium Falcon’s most momentous mission. Through the years and across the stars, from the Rim worlds to unknown points beyond, the race will lead them all to a final standoff for a prize some will risk everything to find–and pay any cost to possess.",
  "genres": [
    "Star Wars",
    "Science Fiction",
    "Fiction",
    "Fantasy",
    "Audiobook",
    "Space Opera",
    "Adventure"
  ],
  "author": "James Luceno",
  "average_rating": "3.82",
  "url": "https://www.goodreads.com/book/show/3545495-star-wars"
}