{
  "title": "Goodnight, Swampy the Little Monster",
  "description": "“Swampy the little monster was not always good; He sometimes didn’t do the things he should...“Hey parents and bedtime story lovers! Does your child refuse to sleep even if it is so late? Read this hot nursery rhymes bestseller and find out how Swampy gets ready for bed! Goodnight, Swampy the Little Monster is a bedtime story about a cute little monster named Swampy. He loves to watch TV and loves to hide. That has proved to be quite a problem for Monster Mommy as she struggles to put Swampy to bed every night. After TV time is over and Monster Mommy gets ready to put Swampy to bed, Swampy disappears without a trace! The worst part? Monster Mommy has to go through this ordeal every day! But not all hope is lost as big brother Monty is here to help. Monty has no problems going to bed on time and is willing to lead by example and make Swampy appreciate the joy of bedtime. It won’t be easy though as Swampy can be a cranky little monster throwing toys and making noise. Fortunately, Monty is smart and determined to impress Mommy Monster as he started to take a bath and convincing a giggling Swampy to do so as well. Swampy sure had fun with his bath and as Mommy helped him dry, Swampy tried to escape but ended up on Mommy Monster’s lap all comfy and cozy. Even Daddy Monster joined in on the bedtime fun preparing Swampy’s pajamas. “She scrubbed his big paws and then his ears While Swampy the little monster made big cheers...“It isn’t bedtime just yet for Swampy as Monster Mommy needs to help him brush his teeth. And to Mommy’s surprise, Swampy had fun doing it and whitening his teeth. All it took for Mommy was to give Swampy a nice little bedtime story and off Swampy went to sleep feeling super refreshed the next morning. Goodnight, Swampy the Little Monster teaches important bedtime habits to restless kids and children ages 3-5 who just want to stay up all night. Planning the bedtime routine for your child can have its fair share of difficulties but this sleep book teaches the value of making the ordeal fun. Monster bedtime book stories are highly effective in calming the most energetic kids and you’d be surprised to see how kids relate with Swampy and just fall asleep shortly after. With funny catchy words and nursery rhyme verses to keep children hooked, Goodnight, Swampy the Little Monster belongs in every nighttime book library. All pages are beautifully illustrated by A. Keegan from Swampy’s distinctive orange spots all the way down to the bugs on Swampy’s favorite pajamas. And even if it isn’t bedtime yet, your child can still have fun with Swampy through the included coloring book. The coloring book is a completely free gift and fully printable making it a terrific addition to your picture books collection! Give this children’s book a try. Be Monster Mommy or Daddy! Be Big Brother Monty! Or be the role model and tame the little Swampy within your loved one! Purchase a paper copy of Goodnight, Swampy the Little Monster and get the Kindle version, FREE!",
  "genres": [
    "Childrens",
    "Picture Books",
    "Monsters",
    "Fiction"
  ],
  "author": "Ellie J. Woods",
  "average_rating": "4.18",
  "url": "https://www.goodreads.com/book/show/35451036-goodnight-swampy-the-little-monster"
}