{
  "title": "Abraham Lincoln and Karl Marx in Dialogue",
  "description": "Why put Abraham Lincoln, the sometime corporate lawyer and American President, in dialogue with Karl Marx, the intellectual revolutionary? On the surface, they would appear to share few interests. Yet, though Lincoln and Marx never met one another, both had an abiding interest in the most important issue of the nineteenth-century Atlantic world-the condition of labor in a capitalist world, one that linked slave labor in the American south to England's (and continental Europe's) dark satanic mills. Each sought solutions--Lincoln through a polity that supported free men, free soil, and free labor; Marx by organizing the working class to resist capitalist exploitation.While both men espoused emancipation for American slaves, here their agreements ended. Lincoln thought that the free labor society of the American North provided great opportunities for free men missing from the American South, a kind of \"farm ladder\" that gave every man the ability to become a landowner. Marx thought such \"free land\" a chimera and (with information from German-American correspondents), was certain that the American future lay in the proletarianized cities.Abraham Lincoln and Karl Marx in Dialogue intersperses short selections from the two writers from their voluminous works, opening with an introduction that puts the ideas of the two men in the broad context of nineteenth-century thought and politics. The volume excerpts Lincoln's and Marx's views on slavery (they both opposed it for different reasons), the Civil War (Marx claimed the war concerned slavery and should have as its goal abolition; Lincoln insisted that his goal was just the defeat of the Confederacy), and the opportunities American free men had to gain land and economic independence.Through this volume, readers will gain a firmer understanding of nineteenth-century labor relations throughout the Atlantic slavery and free labor; the interconnections between slave-made cotton and the exploitation of English proletarians; and the global impact of the American Civil War.",
  "genres": [
    "History"
  ],
  "author": "Allan Kulikoff",
  "average_rating": "2.00",
  "url": "https://www.goodreads.com/book/show/35456688-abraham-lincoln-and-karl-marx-in-dialogue"
}