{
  "title": "The Oxford Book of Victorian Detective Stories",
  "description": "The Victorian era saw the first great flowering of the detective story. Edgar Allan Poe, Charles Dickens, Wilkie Collins, Arthur Conan Doyle, J.S. Le Fanu, and a host of others pioneered a genre of fiction that remains among the most popular today. Now, in Victorian Tales of Mystery and Detection, Michael Cox provides a sampling of the finest detective stories written from the 1840s to the early twentieth century. Here readers will find tales displaying a vast array of detectives and villains--and a multitude of murder methods and motives--all chronologically arranged so that readers can follow the genre as it develops over time. For instance, in Conan Doyle's \"The Adventure of the Blue Carbuncle\" we see an example of the many Sherlock Holmes escapades that popularized and came to typify the detective story for the Victorian public. And in the progression of the stories, we witness the evolution of the investigator from Poe's brilliant and eccentric Chevalier C. August Dupin, to Doyle's scientific Sherlock Holmes, into Robert Barr's cavalier Valmont (a possible model for Agatha Christie's Hercule Poirot). Including well-known stories by famous authors, as well as little known gems reprinted, this book offers hours of enjoyment and escape for all lovers of crime fiction.Contents:The purloined letter by Edgar Allan PoeThe murdered cousin by J.S. Le FanuHunted down by Charles DickensLevison's victim by Mary Elizabeth BraddonThe mystery at number seven by Mrs Henry WoodThe going out of Alessandro Pozzone by Richard DowlingWho killed Zebedee? by Wilkie CollinsA circumstantial puzzle by R.E. FrancillonThe mystery of Essex stairs by Sir Gilbert CampbellThe adventure of the blue carbuncle by Sir Arthur Conan DoyleThe great ruby robbery by Grant AllenThe sapient monkey by Headon HillCheating the gallows by Israel ZangwillDrawn daggers by C.L. PirkisThe greenstone god and the stockbroker by Fergus HumeThe arrest of Captain Vandaleur by L.T. Meade and Robert EustaceThe accusing shadow by Harry BlythThe ivy cottage mystery by Arthur MorrisonThe Azteck opal by Rodrigues OttolenguiThe long arm by Mary E. WilkinsThe case of Euphemia Raphash by M.P. ShielThe tin box by Herbert KeenMurder by proxy by M. McDonnell BodkinThe duchess of Wiltshire's diamonds by Guy BoothbyThe story of the Spaniards, Hammersmith by E. and H. HeronThe lost special by Sir Arthur Conan DoyleThe banknote forger by C.J. Cutcliffe HyneA warning in red by Victor L. Whitechurch and E. ConwayThe Fenchurch Street mystery by Baroness OrczyThe green spider by Sax RohmerThe clue of the silver spoons by Robert Barr",
  "genres": [
    "Mystery",
    "Short Stories",
    "Fiction",
    "Victorian",
    "Anthologies",
    "Adult Fiction"
  ],
  "author": "Michael Cox",
  "average_rating": "4.04",
  "url": "https://www.goodreads.com/book/show/354507.The_Oxford_Book_of_Victorian_Detective_Stories"
}