{
  "title": "Star Wars: The Cestus Deception",
  "description": "Ord Cestus, a planet mostly barren and inhospitable to life, was first colonized as a prison world—until a handful of hardy pioneers discovered its rich ore deposits and managed to build up a successful droid-manufacturing industry. But when the Clone Wars erupted, bringing severe rationing of imported resources and a Republic ban on the production of battle droids, Ord Cestus was threatened with imminent economic collapse. Enter the Confederacy of Independent Systems—the Separatists—with a life-saving offer to purchase a generous quantity of the planet’s most lucrative export: bio-droids. Possessed of tactical capabilities that rival the fighting abilities of even the most advanced Jedi, these sophisticated, techno-organic hybrid units would prove a most formidable weapon if ever deployed for military use. And now the Confederacy’s intention to invest in what amounts to an army of bio-droids has sent ripples of alarm through the highest echelons of the Republic government. Determined to halt the bio-droid sale—but fearing a show of force will result in a political backlash—Supreme Chancellor Palpatine dispatches a team of envoys, led by Jedi Master Obi-Wan Kenobi. Their mission: persuade Ord Cestus’s government to abandon its dealings with the Confederacy . . . while secretly stirring up revolution among the planet’s struggling underclass. Diplomacy is paramount. But if all else fails, the Republic will not hesitate to launch a full-scale attack—and wipe out not only the means of bio-droid production, but countless lives as well, to demonstrate the consequences of disloyalty. For Obi-Wan, the prospect of such wholesale slaughter only serves to fuel his growing suspicions about the sinister path the Republic seems to be taking. But the brash Jedi Master Kit Fisto and the detachment of clone soldiers assigned to the mission are ready and willing to do the Supreme Chancellor’s bidding. As the leaders of Ord Cestus refuse to capitulate and Palpatine rapidly loses patience, Obi-Wan’s hopes of a peaceful resolution are dwindling. Now, facing a crisis of conscience, Obi-Wan must find the wisdom and strength to prevent a bloodbath and safeguard the Republic— while abiding by the ancient code to which he has pledged his life.Features a bonus section following the novel that includes a primer on the Star Wars expanded universe, and over half a dozen excerpts from some of the most popular Star Wars books of the last thirty years!",
  "genres": [
    "Star Wars",
    "Science Fiction",
    "Fiction",
    "Novels",
    "War",
    "Fantasy",
    "Collections"
  ],
  "author": "Steven Barnes",
  "average_rating": "3.58",
  "url": "https://www.goodreads.com/book/show/35464.Star_Wars"
}