{
  "title": "Gaslight Grimoire: Fantastic Tales of Sherlock Holmes",
  "description": "Eliminating the impossible just got a whole lot harder! The fabled tin dispatch box of Dr. John H. Watson opens to reveal eleven all-new tales of mystery and dark fantasy. Sherlock Holmes, master of deductive reasoning, confronts the irrational, the unexpected and the fantastic in the weird worlds of the Gaslight Grimoire. Gaslight Grimoire includes works David Stuart Davies, Barbara Hambly, Kim Newman, Chris Roberson, Christopher Sequeira, Peter Calamai, J. R. Campbell, M. J. Elliott, Rick Kennett, Chico Kidd, Bob Madison, Martin Powell, Barbara Roden, 12 Full Page B&W illustrations by Phil Cornell. About the Charles Prepolec has contributed articles and reviews to All Hallows, Sherlock Magazine, Scarlet Street, and Canadian Holmes. An active Sherlockian for more than 20 years with Calgary’s The Singular Society of the Baker Street Dozen, he was designated a Master Bootmaker in 2006 by the Canada’s national Sherlock Holmes Society. Jeff Campbell ’s fiction has appeared in a wide variety of publications including Spinetingler Magazine, Wax Romantic and Challenging Destiny. From time to time his writing can also be heard on radio’s Imagination Theater and The Further Adventures of Sherlock Holmes. In addition to writing, he has co-edited the Sherlock Holmes anthologies Curious Incidents 1 and 2 with his good friend Charles Prepolec. About the Cover Timothy Lantz is a full-time illustrator and graphic artist with degrees in art education and communications. During his career, Lantz’s work has included such far-flung projects as weather maps, television commercials, book covers and tarot cards. He is the author and artist of The Archeon Tarot, available from U. S. Games Systems Inc. About the Interior Phil Cornell was born in Sydney, Australia in 1954. He first came into contact with Sherlock Holmes at the age of ten when given an anthology containing 'The Speckled Band.' The infection was instant and incurable. He lives in Sydney with his twelve year old son, two cats and more Sherlockian books and videos than can comfortably fit in a fairly small home. He holds the position of \"Expedition Artist\" in The Sydney Passengers Sherlock Holmes Society. He is also a member of The Unscrupulous Rascals of South Australia and The Sherlock Holmes Society of London. He works as a commercial artist. About the These anthologies have received critical acclaim from prominent reviewers such as National Post, Library Journal, Booklist, Globe & Mail, etc.",
  "genres": [
    "Mystery",
    "Fantasy",
    "Horror",
    "Short Stories",
    "Fiction",
    "Anthologies",
    "Historical Fiction"
  ],
  "author": "Charles Prepolec",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/3546735-gaslight-grimoire"
}