{
  "title": "Dark Side: The Haunting",
  "description": "\"Barlog skillfully creates a terrifying and creepy atmosphere which makes you want to keep your bedroom light on when you put the book down for sleep. \" — Nicole, Goodreads You can't run. You can't hide! Some things are impossible to escape. What would you do? You're going to love this intense contemporary ghost tale wrapped inside a mystery with a diabolic twist. And best of all, it's NOT a haunted house! Dark Side received 78 5-star and 4-star ratings from Goodreads readers who raved about the story along with Amazon UK \"A refreshing twist on a haunting.\" — Donna, Goodreads \"This is an excellent paranormal thriller that is full of suspense and tension. It is not your normal average ghost story. The author manages to successfully mix a chilling supernatural tale with a gripping whodunnit thriller making this a very entertaining book indeed.\" — Tom, Goodreads \"This book was very mesmerizing and I couldn't put it down! I loved the idea and storyline.\" — Brandyn, Goodreads \"If you are looking for something new and different to read, I recommend the Dark The Haunting. I will certainly be looking for new and upcoming books from J.M. Barlog. Very nicely done!!.\" — Faith, Goodreads \"Thoroughly enjoyed this book. It keeps you hooked and guessing. The idea of this book is intriguing and I've not read any books quite like it. I would certainly recommend it.\" — K Kent, Amazon UK \"This book is one of the best I have read recently. I would recommend this book to anyone who enjoys a good mystery.\" — Pauline Allen, Amazon UK \"Great, enjoyable read. I really enjoyed this book, it flowed very well, and found that I couldn't put it down.\" — Trek, Amazon UK Do you believe in miracles? Jenny Garrett does. Because a miracle brought her through a terrible car crash. Do you believe in ghosts? Jenny didn't either, until... Sometimes accidents happen. Then again sometimes accidents are planned. Somebody wants Jenny dead, forcing Detective Rick Walker into a frantic search to uncover the who and the why before they try again. But Jenny can't help. Her memory of the accident, and the weeks preceding it, are scattered all willy-nilly somewhere in the darkest recesses of her healing brain. But Jenny's real horror transcends far beyond the stalking of an earthly killer. Jenny's being terrorized by a doppelgänger—a frightening ghostly image of herself. A skilled paranormal investigator, Dwight Mackenzie's willing to help Jenny uncover the real truth behind her torment. But the real truth There is only one escape from the vicious torment Jenny faces. Visit jmbarlog.com to learn more.",
  "genres": [
    "Horror",
    "Paranormal",
    "Fiction",
    "Horror Thriller",
    "Thriller"
  ],
  "author": "J.M. Barlog",
  "average_rating": "3.99",
  "url": "https://www.goodreads.com/book/show/3546602-dark-side"
}