{
  "title": "The Case Against Barack Obama: The Unlikely Rise and Unexamined Agenda of the Media's Favorite Candidate",
  "description": "Obama a Lefty, Not a ReformerThe first serious negative biography of Senator Barack Obama casts the Democratic nominee as a fake reformer and a real liberal.The Case Against Barack Obama by National Review's David Freddoso, blasts Obama for failing to take on the Chicago machine, for listening to \"radical advisors,\" and for backing \"doctrinaire liberal\" causes from teachers unions to abortion rights.It does not, however, compare him to Paris Hilton, or dwell at length on his religion or race - making the substance of The Case Against Barack Obama sound a bit unfamiliar amid a campaign cacophony of hyperbolic web ads, alleged race cards, and viral smears.Freddoso says John McCain's campaign and Republicans at large are making the wrong case against the Illinois senator.\"I don't think you beat Obama by saying that he's Paris Hilton,\" said Freddoso, a reporter for the conservative magazine National Review, referring to McCain's latest advertising campaign. \"The more important thing is really to look at is he who he says he is? Is he really this great reformer?\"Freddoso's book, released today by the conservative publishing house Regnery and provided exclusively to Politico by the publisher, occupies a small island in the often-shrill sea of criticism of Obama. As a range of conservatives suggest that Obama is a closet radical, and as McCain's campaign aims to disqualify him from the White House on the grounds of his international fame, Freddoso makes a case that conservatives should look at the presumptive Democratic nominee's record.His \"It's not that Obama is a bad person. It's just that he's like all the rest of them. Not a reformer. Not a Messiah. Just like all the rest of them in Washington. And just like all the other liberals too.\"Freddoso's is one of two new books harshly attacking Obama. The other, by Jerome Corsi, reportedly covers some of the same territory as the viral emails that have plagued the Democratic candidate, making much of his slender connections to Islam and his teenage drug use.Freddoso opts largely for a fact-based critique, and writes that the viral and overt smears have allowed Obama to evade substantive criticism.\"Too many of those criticizing Obama have been content merely to slander him,\" he writes. False rumors about Obama's religion and ancestry have produced, Freddoso writes, \"an intellectual laziness among the very people who should be carefully scrutinizing Obama.\"His book comes with Republican popularity at a historic low, amid widespread disenchantment with Republican ideals of limited government and hawkish foreign policy. Many - including, apparently, McCain's strategists - doubt a Republican can win a policy face-off. But as the real campaign hones in on the character of the candidates, Freddoso's book attempts to build an alternate case against Obama. Freddoso's argument begins in Chicago....Though Obama's first political steps were in Hyde Park's reformist politics, Freddoso focuses on the smooth accommodation he made to the machine....",
  "genres": [
    "Politics",
    "Nonfiction",
    "History",
    "Biography",
    "American History"
  ],
  "author": "David Freddoso",
  "average_rating": "3.70",
  "url": "https://www.goodreads.com/book/show/3548409-the-case-against-barack-obama"
}