{
  "title": "The Unholy Trinity: Blocking the Left's Assault on Life, Marriage, and Gender",
  "description": "It's now or never for conservative values.This highly anticipated debut from Matt Walsh of The Blaze  demands that conservative voters make a last stand and fight for the moral center of America. The Trump presidency and Republican Congress provides an urgent opportunity to stop the Left's value-bending march to destroy the culture of our country.  Republican control of the presidency, senate, and House of Representatives for the next two years is a precious—and fleeting—gift to conservatives. Americans concerned with blocking liberals’ swift rethinking of life, marriage, and gender need to capture this moment to turn the tide of history. For years conservatives have worried endlessly about peripheral issues, liberals have been hard at work chipping away at the bedrock of our civilization, and putting a new foundation in its place. New attitudes on abortion, gay marriage, and gender identity threaten to become culture defining victories for progressives—radically altering not just our politics, but dangerously placing Man above God and the self above the good of the whole. What’s at stake? The most fundamental elements of society, including how we understand reality itself. In The Unholy Trinity, TheBlaze contributor Matt Walsh draws on Catholic teachings to expose how liberals have attempted, with startling success, to redefine life, marriage, and gender. Abortion redefines human life, gay marriage redefines the family, and the latest theories on gender redefine what it means to be a man or a woman. The potential consequences are dire. If progressivism can bend life, family, and sex to its whims, Walsh argues, it has established relativism over God as the supreme law, and owns the power to destroy western civilization.With insight, candor, and faith, Walsh shows conservatives how to confront liberal arguments, defeat the progressive agenda for good, and reclaim American culture for truth.",
  "genres": [
    "Politics",
    "Nonfiction",
    "Christian",
    "Religion",
    "Audiobook",
    "Philosophy",
    "Christian Living"
  ],
  "author": "Matt  Walsh",
  "average_rating": "4.18",
  "url": "https://www.goodreads.com/book/show/35488818-the-unholy-trinity"
}