{
  "title": "Beyond the Melting Pot: The Negroes, Puerto Ricans, Jews, Italians, and Irish of New York City",
  "description": "Beyond the Melting Pot was one of the most influential books published during the 1960s. This second edition includes a new 90-page Introduction, \"New York City in 1960,\" in which the authors, with all their previous depth and verve, examine the turn of events since 1963, the date of the first edition. Their concerns are directed to such developments as the rise of militant black demands and the response to these of the city's peoples and political structures; the decline of Catholic power in Lindsay's New York and the rise in power of Jews and WASPs; the growth of a black middle class and the economic and political difficulties of the Puerto Ricans. The authors note that events and further study have led them to change their views on several matters, and these points are clarified in the Introduction. Nevertheless, most of their perceptions and their central thesis (that \"melting pot\" assimilation does not happen) remain as valid as ever. In the same way, these appraisals of the first edition remain fully in force:Richard H. Rovere, The New Yorker: \"Beyond the Melting Pot... is perhaps the most perceptive inquiry into American minorities ever made.\" Oscar Handlin, New York Times: \"They have put together a thoughtful analysis that will help Americans deal with one of the most pressing problems of the great cities. That itself is a substantial accomplishment.\" Harpers Magazine: \"...sure in its grasp of relations between economic and social fact, cogent, complex, and brightly written.\"Time Magazine: \"...provocative...Glazer...and Moynihan...write with a refreshing candor on a subject that is usually treated all too delicately.... They write compassionately of the problems minority groups have faced, but they forthrightly point out that many of these problems are compounded by each group's special characteristics.\"",
  "genres": [
    "History",
    "Sociology",
    "Nonfiction",
    "Race",
    "New York",
    "Politics",
    "American"
  ],
  "author": "Nathan Glazer",
  "average_rating": "3.58",
  "url": "https://www.goodreads.com/book/show/1213682.Beyond_the_Melting_Pot"
}