{
  "title": "A Joyous Romance Books 1-3",
  "description": "The first three books in the A Joyous Romance Series.Book 1: Betrothed to the Vampire KingBeing born to two vampire parents is rare. Rare and powerful. Special enough to attract the attention of the king.Joy has been promised to the king of the vampires for as long as she can remember, and she wants nothing to do with him. She wants to find love, not be paired with someone because of her parentage. King Frederick has ignored her existence, until now. As her fiftieth birthday approaches, he sends the darkly delicious Sam to escort her to the bonding ceremony, which attracts unwanted attention. Will Joy be able to fight her growing affections for Sam and keep her freedom?book 2: Married to the Vampire KingJoy's life has become one giant mess. She survived being staked, not once, but twice! With the woman behind the attacks still at large Joy isn't sure who she can trust. And to make matters worse, her marriage to the king just got moved up! The threat to Joy's life still looms in the background while she tries to adjust to her new life in the palace. Will Joy be able to trust Sam with her life and her heart?Book 3: Mated to the Vampire KingStake me once, shame on you. Stake me twice, shame on me.Joy has had enough! It's time to fight back. If only she could get away from her protection detail.Frannie is still on the loose, so it's only a matter of time before she makes another attempt on Joy's life, but Joy intends to strike first. Joy with the help of her best friend, Lexi, and Lexi's brother, Jace, develops a plan that will stop Frannie for good. The trouble with plans is that they often go awry. Like when your husband, who happens to be the king, forbids you to leave the house while he deals with the problem on his own.Will Joy and her shifter friends be able to outwit Sam and put a stop to Frannie's evil plan to rule the vampire kingdom?",
  "genres": [],
  "author": "Liza Kline",
  "average_rating": "4.50",
  "url": "https://www.goodreads.com/book/show/35492601-a-joyous-romance-books-1-3"
}