{
  "title": "Miss Fortune Series Boxset 1",
  "description": "The first three books in the New York Times bestselling Miss Fortune series. The set includes:LOUISIANA LONGSHOTIt was a hell of a long shot…CIA assassin Fortune Redding is about to undertake her most difficult mission ever—in Sinful, Louisiana. With a leak at the CIA and a price placed on her head by one of the world’s largest arms dealers, Fortune has to go off-grid, but she never expected to be this far out of her element. Posing as a former beauty queen turned librarian in a small bayou town seems worse than death to Fortune, but she’s determined to fly below the radar until her boss finds the leak and puts the arms dealer out of play. Unfortunately, she hasn’t even unpacked a suitcase before her newly inherited dog digs up a human bone in her backyard. LETHAL BAYOU BEAUTYNo one in Sinful liked Pansy Arceneaux, but who hated her enough to kill her?When aspiring actress Pansy Arceneaux returns to Sinful, Louisiana to head up the beauty pageant portion of the Summer Festival, CIA assassin Fortune Redding knows she’s in for trouble. Her undercover identity as a former beauty queen makes Fortune the perfect choice to chair the event with Pansy, but Pansy’s abrasive personality makes it impossible to get through a single rehearsal without a fight.When Pansy turns up dead, Fortune is the prime suspect. SWAMP SNIPERIn the two weeks CIA assassin Fortune Redding has been hiding in Sinful, Louisiana, she’s been harassed, poisoned, and shot at…and that was the easy part. But now, she’s about to face her biggest challenge since setting foot in the tiny bayou town. When mayoral candidate Ted Williams is murdered, everyone is surprised. Ted was a blowhole and a Yankee, but those usually weren’t good reasons to kill someone. When Fortune’s good friend Ida Belle becomes the lead suspect in the crime, Fortune knows she’s got to solve a murder and save one of the only friends she’s ever had. But as the investigation begins, more and more secrets surface, and Fortune realizes that sometimes nothing is as it seems.",
  "genres": [
    "Mystery",
    "Cozy Mystery",
    "Contemporary",
    "Anthologies",
    "Romance"
  ],
  "author": "Jana Deleon",
  "average_rating": "4.58",
  "url": "https://www.goodreads.com/book/show/35496886-miss-fortune-series-boxset-1"
}