{
  "title": "Holy Parrot",
  "description": "Holy Parrot by Angel A is a captivating read for fans of stimulating, spiritually charged, and suspenseful stories that explore themes of faith, identity, and the power of the human spirit, making it a great fit for readers who enjoy a mix of mystery, intrigue, and philosophical depth.Angel A’s bold second novel, after Mary Poser, chronicles Australian research student Leonard Lumière’s head-spinning time in Buritaca, on Colombia's Caribbean coast, and a case of parrot-proclaimed divinity. Maria Santos, sixteen and claiming to be a pregnant virgin seeks refuge in Leo’s lab after escaping her father Gustavo’s violent reaction to the news. Gabriel, Maria’s “holy parrot,” attests that Maria is nothing less than the mother of a new savior.Through their Australian protagonist’s eyes, Angel A takes readers on a wonderful journey into Latin American magical realism with HOLY PARROT. The Colombian setting, with its jungles and beaches, forms a perfectly lush backdrop to all the fascinating and vibrant characters populating the book. The meshing of Indigenous traditions with Catholic – and Gnostic – mysticism is perfectly primed to stick in the reader’s mind for days afterwards.People who love reading about culture, history, religion, science, and nature will love this captivating novel. 2023 The Brew Seal of Excellence2023 Literary Titan 5-star book award 2023 Readers' Favorite 5-star book award 2023 Indie BRAG Medallion2023 Firebird Book Award Winner (three categories) 2023 Nautilus Silver Book Award Winner2023 International Impact Book Awards Winner 2023 Hawthorn Prize Finalist2023 Maxy Awards Finalist2023 London Book Festival Runner-Up2023 New York Book Festival Runner-Up2023 Awesome Indies 5-star book award2023 Florida Authors And Publishers Association bronze award 2023 COVR Visionary Fiction Award Winner 2023 San Francisco Book Awards Honorable Mention2023 Awesome Indies Seal of Excellence2023 Living Now Silver Evergreen Book Medal For Fiction2023 NYC Big Book Award Distinguished Favorite2023 Readers’ Choice Book Awards Finalist2023 Chanticleer International Book Awards Long List2023 Maincrest Media Award Winner2024 Independent Press Awards Distinguished Favorite2024 BREW Book Excellence Award2024 American Fiction Awards finalist",
  "genres": [],
  "author": "Angel  A.",
  "average_rating": "4.79",
  "url": "https://www.goodreads.com/book/show/121381980-holy-parrot"
}