{
  "title": "Winds of Fate",
  "description": "Harry’s back! The even more anticipated third book from the best-selling Fayroll series is here. With even more epic battles, difficult quests and even rarer items. Following on from ‘The Road East’, Harriton’s work has been very well received and his new bosses are very happy with him. Seemingly everything is going well as he enjoys visiting Fayroll more and more and spending time with his new girlfriend Vika.  But is everything as it seems and can things stay so positive from him? After a visit from his ex-girlfriend’s brother and a meeting with Radion’s Security, it seems the real world might be much more of a dangerous place for him than ever before. He will begin to question how deep he is in this whole project, but with support from his new girlfriend and his team working on The Fayroll Times, maybe everything will be fine? And this is just outside the game….  In the game he joins ‘The Hounds’ on a quest through the Northern Mountains to the North and through the mines filled with terrifying and deadly creatures to continue his quest to find the Dryad Sisters. But not before making even more in game enemies, meeting royalty and saving kidnapped princesses.  Cold Winds of Fate continues the best-selling and ever popular Fayroll series with the author’s great sense of humour, adventure and storytelling skills. This book carries on developing the Fayroll world and also further develops life in the real world. This story has an equally seductive balance between the real and virtual world where both smoothly complement each other. Vasiliyev is showing how much of a writer he is. Every Fayroll books gets better and better. His characters continue to develop and become more real to the reader. His attention to detail and cinematic descriptions have also developed giving the reader a captivating and entertaining read. Cold Winds of Fate is certainly a boundless mix of action, dialogue, humour and colourful descriptions.  This book is yet another example of one of the best in the LitRPG genre. Fantasy lovers, gamers, and anyone who enjoys a good story will enjoy this book. Andrey Vasiliev started writing in his late thirties, because, by his own admission, “he ran out of things to read”. However, after his first two books gained nearly instant critical acclaim, he had to give serious thought to giving up his banking career and went on to become one of the top authors in the relatively new, yet insanely popular, LitRPG genre that brings together cyberpunk, classic sci-fi, and fantasy. Fortunately for his readers, who had voted his debut novel More Than a Game the “Best Book of the Year 2014,” he never looked back and continued working on his now-bestselling Fayroll series. Andrey maintains a blog, and participates in various multiple-author projects. He is also the author of The Raven’s Flock and The Arch series, which will soon be available in English.",
  "genres": [
    "Fantasy",
    "Science Fiction",
    "Audiobook"
  ],
  "author": "Andrey Vasilyev",
  "average_rating": "4.23",
  "url": "https://www.goodreads.com/book/show/35500251-winds-of-fate"
}