{
  "title": "Dragon Ride: True Stories of Adventure, Miracles, and Evangelism from China",
  "description": "Twenty-year-old Peter, when threatened with incarceration in a mental institution for his faith, refused to let Grace fight for his release. “If leaving me in the mental institution will further the gospel, then leave me there!”The first time Doris, an orthodox Buddhist, heard about Jesus, she whispered to Grace, “Don’t tell anyone that Jesus died for us. This will be our secret!”The police were interrogating 19-year-old Hope every few days—pressuring her to disclose Grace and Justin’s ministry to university students. With tears in her eyes, she told Grace and Justin, “I’ll never betray you two, no matter what they do to me!”Leah, an idol-worshipper, longed to become a Christian, but she was afraid. “If I believe in Jesus, the gods I worship are going to retaliate. They’ll hurt me really bad. Is Jesus powerful enough to protect me from them?”In the kick-off meeting of a discussion group Grace was leading for atheist university students, Carol burst out laughing. “Grace, you can’t be serious! You actually believe God exists?”In Dragon Ride, the beauty of the Lord is seen through the eyes of Buddhists, atheists, idol-worshippers, Muslims, and an animist as they encounter Jesus. Dragon Ride records the actual conversations Grace had with her friends, and many of them embraced Christ as the answer to their deepest longings.Grace writes about persecution, evading the police, saving lives, helping the homeless and disabled, and she even writes about the murder of a friend. But more importantly, she writes of a God who acts on behalf of His children, of a faith that grew in the crucible of China, and of learning how to effectively share the gospel.Grace’s stories are raw, personal, and humorous, and she openly shares about her own spiritual struggles and growth.",
  "genres": [
    "China",
    "Nonfiction",
    "Biography Memoir",
    "Christian",
    "Asia",
    "Biography",
    "Christian Non Fiction"
  ],
  "author": "Grace  Jacob",
  "average_rating": "4.55",
  "url": "https://www.goodreads.com/book/show/35504148-dragon-ride"
}