{
  "title": "Introverts: Leverage Your Strengths for an Effective Job Search",
  "description": "Do you find it difficult to “sell” yourself in job interviews? Does job hunting seem hard and drain your energy?You’re not alone. While most well-known job hunt advice works well with extroverts, this award-winning book features proven techniques honed with thousands of clients. It shows you how to use your strengths to meet employers halfway and gain their trust while staying true to your introverted nature.Gabriela Casineanu, an introvert herself, understands the inner strengths of introverts. And how to leverage them to be more successful in finding a job and building a meaningful career.The author—an MBTI certified coach, founder of Introverts Academy—has a decade of experience successfully applying a coaching approach to employment and career counseling. With a background in engineering, computer science, quality assurance, business, management, adult education, and an MBA, she brings a multidisciplinary approach to this comprehensive guide for job search and career development.Through strategies, exercises, and true stories from introverted job seekers, you’ll How your 150+ introvert strengths can help you find a job faster by tapping into the hidden job marketA holistic (often overlooked) approach to job search and career development that gives you an edgeResume and interview tips that increase your chances of standing out without feeling salesyLinkedIn strategies for job seekers tailored to your personalityTips to boost your confidence, energy and motivation, customizable to your situationAnd much more!After reading Leverage Your Strengths for an Effective Job Search, you’ll know more about how to help employers understand the value of hiring you.This book won the Readers’ Favorite® International Book Award and is listed in BookAuthority’s Best Job Hunting Books of all time, Best Interview Books of all time, and Best Introvert Books of all time.Bonus (downloadable files): 7 Networking Tips for Introverts (list) • LinkedIn for Job Search (flowchart) • Job Search and Career Development Process (flowchart) • 30 Introvert Strengths (list)Ready to dive in?You’re a click away to learn job hunting secrets for introverts and why companies need more introverts like you on their team!EDITORIAL REVIEWSA thought-provoking book for those who are seeking a job. As a former hiring manager, it was always easy to “read” the extroverts, but it was much harder to ascertain the introverts’ true personality and working style. This book addresses this issue and offers wisdom to introverts to land the best job for them.\" ~ Kandi JohnsonI cannot get over the wealth of information on job search for introverts presented in this book. The author understands the specific hurdles introverts face while searching for a job (and in life). ~ StaceyKGabriela has created a caring guide that leaves you feeling empowered and proactive. She never expects you to be an extrovert, instead helps you leverage your strengths. ~ Rebecca of AmazonThis book is insanely good.",
  "genres": [
    "Business",
    "Nonfiction",
    "Self Help"
  ],
  "author": "Gabriela Casineanu",
  "average_rating": "4.46",
  "url": "https://www.goodreads.com/book/show/35496441-introverts"
}