{
  "title": "The March Up: Taking Baghdad with the 1st Marine Division",
  "description": "With unprecedented access and previously unreported detail, here is a first hand account of the 22-day march to Baghdad that takes you behind the scenes and to the front line... No one reporting on the war in Iraq had the unique battlefield clearance afforded the authors of this dramatic eyewitness account. Unlike embedded journalists confined to a single unit, West and Smith acquired a captured yellow SUV and joined with whatever unit was leading the assault every day of the fight. The result is a report of what really happened from the heart of the action unlike anything you'll read anywhere else. \"While we will move swiftly and aggressively against those who resist, we will treat all others with decency, demonstrating chivalry and soldierly compassion for people who have endured a lifetime under Saddam's oppression.\"--Major General J.N. Mattis, 1st Marine Division, Commanding Here is the story that can be told only by those who actually witnessed the action of the famed 1st Marine Division's march on Baghdad, from the shaky beginning of U.S. operations in southern Iraq to the capture of U.S. prisoners, the misreported \"fierce Iraqi resistance,\" and the aggressive assaults that led to a quick and decisive victory. With over a half century of military and combat experience between them, bestselling author F. J. \"Bing\" West and Major General Ray L. Smith, USMC (Ret.), combine expert military analysis with dramatic battlefield reporting. They bring the reader on a march that ended in victory--but was shadowed by second-guessing, unexpected reversals, and the threat of catastrophe. With access to three-star generals in the command centers and to privates in the field, the authors reveal how the strategic plan played out in battle, showing what went well and what failed, and detailing power struggles for military and political control never reported. The result is destined to become the definitive account of ground warfare in Iraq.",
  "genres": [
    "Military Fiction",
    "History",
    "Nonfiction",
    "War",
    "Military History"
  ],
  "author": "Bing West",
  "average_rating": "3.86",
  "url": "https://www.goodreads.com/book/show/1213803.The_March_Up"
}