{
  "title": "The Missing Girls",
  "description": "One girl found dead. Another girl gone...  Long shadows danced on the tin walls. Inside the trunk lay Carrie Miller, wrapped in plastic, arms folded across her ribcage, lips sealed tight forever...  When, a girl’s body is found at a Midlands storage unit, it is too decomposed for Detective Robyn Carter to read the signs left by the killer.  No one knows the woman in blue who rented the unit; her hire van can’t be traced. But as the leads run dry another body is uncovered. This time the killer’s distinctive mark is plain to see, and matching scratches on the first victim’s skeleton make Robyn suspect she’s searching for a serial killer.  As Robyn closes in on the killer’s shocking hunting ground, another girl goes missing, and this time it’s someone close to her own heart.  Robyn can’t lose another loved one. Can she find the sickest individual she has ever faced, before it’s too late?  An utterly gripping and darkly compelling detective thriller that will have fans of Robert Dugoni, Angela Marsons and James Patterson hooked from the very start. You will not guess the ending!   What readers are saying about the DI Robyn Carter series:  ‘This book was fantastic and it kept me gripped from the first page and I read it in a day, I really, really didn't want to put it down – it’s one of the best I've read so far in 2017 … Would not hesitate to give the book 5 stars!!’ Donna’s Book Blog  ‘Fantastic! So good to the point that I finished it in just over a day! ... Wow, wow, wow. This was a great book!! ... kept me hooked from page one ... genuinely didn’t guess who it was until it was revealed! There are lots of twists and turns, and a great ending! I can’t wait for the next book!!’ Stardust Book Reviews 5*  ‘I loved every page ... captivating and unputdownable. The tension, twists and turns, kept me flipping the pages ... 5 shining stars ... I loved it!’ Write Escape  'What a page-turner! Wow. My head was spinning from the first page to the last. I was so gripped by the introduction to the characters and then just pulled right into the meat of the thriller until the very last page! Five Stars!' Jersey Girl Forever  'The suspense was fantastic ... the drive to keep turning pages was overpowering ... really well written I want more!' The Belgian Reviewer  'This book totally gripped me from start to finish. It is a very cleverly crafted thriller which leaves no loose ends. Five stars!' Sincerely Book Angels",
  "genres": [
    "Thriller",
    "Mystery",
    "Crime",
    "Fiction",
    "Mystery Thriller",
    "Suspense",
    "Audiobook"
  ],
  "author": "Carol Wyer",
  "average_rating": "4.37",
  "url": "https://www.goodreads.com/book/show/35514147-the-missing-girls"
}