{
  "title": "The White Shroud",
  "description": "The White Shroud (Balta drobulė, 1958) is considered by many as the most important work of modernist fiction in Lithuanian. Drawing heavily on the author’s own refugee and immigrant experience, this psychological, stream-of-consciousness work tells the story of an émigré poet working as an elevator operator in a large New York hotel during the mid-1950s. Using multiple narrative voices and streams, the novel moves through sharply contrasting settings and stages in the narrator’s life in Lithuania before and during World War II, returning always to New York and the recent immigrant’s struggle to adapt to a completely different, and indifferent, modern world. Strong characters and evocative utterances convey how historical context shapes language and consciousness, breaking down any stable sense of self.As in other major modernist works, Škėma uses language and allusion to destabilise. Narrative, voice and language shift continuously, capturing the anti-hero’s psychological and cultural disorientation — the complexity of experience in a modern world where, in Yeats’ words, “the centre cannot hold.” Like the author’s, Garšva’s frame of reference is vast — quotes from French arias, Kafka and American culture collide with visceral memories of archaic Lithuanian folk song. Garšva’s use of poignant and comical émigré slang in his interactions captures the ironies and absurdities of the immigrant’s situation. By the end of the novel, further grammatical and linguistic disarray mirrors the final unravelling of Garšva’s mind as he descends into madness.Like all powerful fiction, this novel draws the reader into an intimate, culturally and historically specific world to explore universal human themes of selfhood, alienation, creativity and cultural difference. This English translation promises to appeal to various audiences: readers of modernist and world literature, scholars of Baltic literature and refugee studies, and members of the Lithuanian diaspora unable to access this novel in Lithuanian. Written from the perspective of a newcomer to an Anglophone country, White Shroud encourages readers to better understand the complexities of immigrant life.",
  "genres": [
    "Fiction",
    "Classics",
    "School",
    "Read For School",
    "Novels",
    "Modern Classics",
    "Adult"
  ],
  "author": "Antanas Škėma",
  "average_rating": "4.07",
  "url": "https://www.goodreads.com/book/show/35518380-the-white-shroud"
}