{
  "title": "The Listener's Musical Companion",
  "description": "As one of America's most important music critics, B.H. Haggin commented on the American musical scene for over half a century. When he died in 1987 at the age of eighty-six, he left behind a vast body of beautifully-written, compelling commentary on the state of Western music. His extraordinary power and range as a critic have contributed greatly to the enduring enthusiasm of his readers and supporters even today.First published in 1956, The Listener's Musical Companion has received wide acclaim over the years. A book for readers of all degrees of musical experience, it is partly an introduction to concert music and its major composers and partly a highly discriminating and knowledgeable commentary on the best performances of great music, as heard through the outstanding recordings from the beginning of recorded sound to the present.Highlighting what to listen for in the greatest works in Western music, Haggin offers a sweeping survey of composers from every period, including the early music of Gregorian and Ambrosian Chant; the early eighteenth-century music of Bach and Handel; the later work of Mozart, Beethoven, and Schubert; the music of such nineteenth-century composers as Wagner, Brahms, and Tchaikovsky; twentieth-century music composed by Ravel, Stravinsky, and Vaughan Williams; and a wide range of American music by Carter, Ives, Copland, Menotti, Gershwin, Porter, Bernstein, and others. Every reader--beginning and seasoned listeners alike--will benefit from what Haggin says about the meaning of music and its procedures and forms; from his splendid analyses of particular pieces of music; from his critical exploration of the literature of music in all periods; and from his evaluation of this century's heritage of great recorded performances.Compiled and edited by Thomas Hathaway, this new edition includes material that Haggin wrote in the last years of his life. A classic in its field, The Listener's Musical Companion advocates the best way to discover the meaning in a piece of music--by listening to it.",
  "genres": [
    "Music"
  ],
  "author": "B.H. Haggin",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/1213963.The_Listener_s_Musical_Companion"
}