{
  "title": "A Laird's Tale: A Laird for All Time",
  "description": "Everything happens for a reason, he said. Sometimes people need a second chance to right a wrong.Even Auld Donell himself.The Laird for All Time series stretches hundreds of years and through four tales of love, hope and second chances. At the center of them all is a mysterious, elfin man with ruddy cheeks and sparkling blue eyes. Auld Donell some know him by. A timeless man who never seems to age, who is everywhere and nowhere all at once. He has a lot to say about Fate and second chances but if he has a master plan, not one of the heroes and heroines of the series seems to know what it might be.Though to the last ,they might question his methods, none can argue with the results.Explore the complete Laird for all Time series, with exclusive content and timeline, and see if you’re able to figure out the next chapter in Auld Donell’s grand plan. Includes bonus sneak peek into the series conclusion A Laird to Forever Hold.A Laird for All Time - The last thing Emmy MacKenzie expected to happen on her holiday to the British Isles was to find herself, not just seeing the sights, but seeing sights not seen in over a hundred years. She finds herself confronted by a man who mistakes her for his long-lost wife. Lost in time she has no choice but to play along, but as days pass, Emmy cannot help but wonder how any woman could ever leave Connor MacLean, a man unlike any she had ever known. A man who thrills and challenges her. A man to love forever. She begins to question what she really wants out of life. And who can give it to her.But Emmy’s true identity isn’t the only secret lurking in Duart Castle.A Time & Place for Every Laird - Claire Manning isn't sure what prompted her to help the grimy, blood encrusted escapee of her company's lab. Humanitarian compulsion? Or Fate as Donell suggested. But she understands the desperation in his eyes and prepared to do whatever it takes to secure his freedom. What she isn't prepared for is the arrogant, scowling eighteenth-century Highlander Hugh Urquhart turns out to be. Nor the feelings that grow far beyond mere compassion for his suffering.Taken - When actress Scarlett Thomas encounters Donell, an old Scotsman who directs her to an ancient claymore that sends Scarlett slipping back 500 years – her modern day struggles are dwarfed by a far more dangerous conflict brewing between Scotland and England. And by growing love she discovers with Scottish Border lord, James Hepburn, Laird of Achenmeade.Love in the Time of a Highland Laird - When she was accidently pushed into a wormhole, Allorah ‘Al’ Maines never imagined she’d be thrown back in time, land at the feet of a gorgeous Highlander… and be taken as his prisoner. She's awestruck by the savage Scot who chained her up in his dungeon. But once she emerges from her cell, she finds herself even more captivated by the roguish Highlander he’s transformed into and begins to wonder if old Donell is right about everything happening for a reason.",
  "genres": [],
  "author": "Angeline Fortin",
  "average_rating": "4.52",
  "url": "https://www.goodreads.com/book/show/35527635-a-laird-s-tale"
}