{
  "title": "The Nightmare King",
  "description": "When she was fourteen, Adelaide Lane made a choice that landed her in the ICU of her town’s general hospital. Her prognosis was not good. When against all odds she woke up, it was to find that she had re-entered life not only with physical and mental scars, but with the ability to see into the future. For twenty years, Addie has used this power to do good in a world gone bad. It isn’t easy, and it’s often illegal. To make matters worse, of late she’s experienced a vision more horrible than any before – and she has no idea how to stop the event from occurring. Adelaide’s life is chaos. What she doesn’t have time for is love, and she’s certain there’s no one on Earth who would have anything to do with her topsy-turvy life anyway.  Nick has only been alive for a few short hours. He is the Nightmare King, the sovereign of a race of incubi as old as time. When his previous form was murdered by a traitor amidst the thirteen supernatural factions, he was reborn into the handsome but notorious man, Nicholas Wargrave. Housed in a new body with a new reputation, he is instantly fighting against an ancient foe, the Challenger, a man who disputes his position as king every time Nicholas is reborn. Nick not only has to get used to the new life given to him and withstand the Challenger’s attacks, he has to confront the Entity who issued his death in the first place. So he’s vastly unprepared when he comes face to face with the most beautiful soul he has ever beheld – and realizes the woman housing that soul is his fated queen.  Now his priorities are completely rearranged. Adelaide comes first. The problem is, the Challenger feels the same way.  And so does the Entity who killed him.  The Nightmare King is book eleven in The Kings series, by New York Times and USA Today bestselling paranormal romance author, Heather Killough-Walden.",
  "genres": [
    "Paranormal",
    "Paranormal Romance",
    "Romance",
    "Fantasy",
    "Science Fiction",
    "Fiction"
  ],
  "author": "Heather Killough-Walden",
  "average_rating": "4.47",
  "url": "https://www.goodreads.com/book/show/35535261-the-nightmare-king"
}