{
  "title": "The Captivity of the Oatman Girls: The History of the Young Sisters Who Were Abducted by Native Americans in the 1850s",
  "description": "*Includes pictures *Includes Olive Oatman's quotes *Includes online resources and a bibliography for further reading *Includes a table of contents \"I looked around and saw my poor mother, with her youngest child clasped in her arms, and both of them still, as if the work of death had already been completed; a little distance on the opposite side of the wagon, stood little Mary Ann, with her face covered with her hands, sobbing aloud, and a huge looking Indian standing over her; the rest were motionless, save a younger brother and my father, all upon the ground dead or dying. At this sight a thrill of icy coldness passed over me; I thought I had been struck; my thoughts began to reel and became irregular and confused; I fainted and sank to the earth, and for a while, I know not how long, I was insensible.” – Olive Oatman On the North American continent, Native American tribes carried out abductions against the new European settlers from the time they first set foot on eastern shores. Some of the women taken in the colonial to early American period went on to become respected figures in their new environments, while others lived out their lives as slaves. Various tribes perceived the historical value of women’s social personalities through different prisms, and even those groups living in the same region often exhibited dissimilar behavior toward them. For some of the more aggressive tribal societies, to commit atrocities against women and their children engaged the same mindset as that adopted for male-to-male warfare. What European sensibilities failed to grasp, despite the home continent’s own lurid history, was that the numerous indigenous cultures of North America were already in the habit of perpetrating such abductions against each other and had for thousands of years. Whether the enemy was European or domestic, old or young, male or female, the deeply embedded cultural habit was the same. To steal women from an enemy often brought the same adulation from the collective as the stealing of horses, and abduction initiated by even a single individual brought honor to that person and his family. In the American wilderness, instances occurred wherein the abduction of either horses or human beings was considered essential to survival, if not to pride and manhood. Abductees were generally adopted into the tribe through a specific ritual. Some were based on “violent hazing,” while for others, entry into the community was a “mere formality.” Children and adolescents were, more often than not, the preferred choice for abduction. In the capturing of slaves, both the strength and docility of the individual taken was of utmost importance. However, in the absence of viable wives, the concept of exogamy, an effort to bring new blood into the tribe, was encouraged. Such a rejuvenation of the community was widely accepted as a convention of war. In the history of abductions among the North American continent’s tribes, a low rate of escape attempts by captured settlers has been the norm from the beginning. This may be largely due to geographical obstacles, with help being so far away as to discourage hope of success. By the same token, relatively few rescue attempts were made by white kinsman to rescue a family member from an indigenous tribe. With no contact available to them, families of lost members taken from the colonial period through the 19th century usually fell into a long-term state of grief, but resigned themselves to never seeing their loved ones again. The Captivity of the Oatman The History of the Young Sisters Who Were Abducted by Native Americans in the 1850s examines the history of one of the most famous abduction stories of the Old West, the kidnapping of the young Oatman sisters and their subsequent experiences with the Mojave.",
  "genres": [
    "History",
    "Nonfiction",
    "Native American",
    "Westerns",
    "Adult",
    "Biography"
  ],
  "author": "Charles River Editors",
  "average_rating": "3.43",
  "url": "https://www.goodreads.com/book/show/35523140-the-captivity-of-the-oatman-girls"
}