{
  "title": "Orrore in Periferia",
  "description": "Un racconto horror thriller che vi stupirà! Inserito nella newsletter \"Migliori libri horror e fantasy italiani\"  (fantasy horror, horror racconti, horror italiano, stato di paura, oscurità, oscurità perversa, l oscurità)Patrizia è una teenager con un' conquistare il ragazzo più bello della scuola, Fabio, aspirante giornalista e giocatore di calcio provetto.Ma durante i suoi tentativi per avvicinarlo, scoprirà insieme a lui un'inquietante segreto, legato a delle misteriose sparizione avvenute nella sua cittadina.Un ebook thriller con tinte horror! Thriller del mese Newsletter Libri Horror del mese Newsletter Best ebooks \" Un ebook thriller romantico ma anche duro, con tinte horror\" \" Un libro horror che ha decisamente le palle, e riesce a stupire\"fantasy horror, horror racconti, horror italiano, stato di paura, oscurità, oscurità perversa, l oscurità\" Ho letto tanti libri thriller su amazon, così come racconti horror e libri d'amore, ma devo dire che spesso non valgono la pena. Questo invece ha un colpo di scena pazzesco, che lo fa rientrare a pieno titolo tra i racconti thriller ben riusciti. Complimenti all'autore, non me l'aspettavo di certo!\"letteratura orrore, libri dell orrore, racconti orrore, storia orrore italiana, libri orrore, libro orrore, orrore profondolibri horror - libri horror | #bookclub.fantasy horror, horror racconti, horror italiano, stato di paura, oscurità, oscurità perversa, l oscuritàCinque grandi libri horror da leggere tra vampiri, fantasmi e altri misteri11 set 2019 - Scarica gratis libri horror più spaventosi assolutamente, libri horror paurosi, libri horror da leggere online, libri horror belli, libri horror consigliati, libri horror da leggere pdf, libri horror e fantasy, libri h e dei libri horror psicologici, leggeli sono bellissimiLibri horror da leggere assolutamente20 gen 2019 - Migliori libri Horror da leggere, libri dell'orrore per ragazzi e adulti fantasy horror, horror racconti, horror italiano, stato di paura, oscurità, oscurità perversa, l oscuritàletteratura orrore, libri dell orrore, racconti orrore, storia orrore italiana, libri orrore, libro orrore, orrore profondoletteratura orrore, libri dell orrore, racconti orrore, storia orrore italiana, libri orrore, libro orrore, orrore profondo  Newsletter libri horror paurosi per adulti Migliori libri fantasy e horror terrificanti Definito \"Uno dei migliori libri horror da leggere online\" Newsletter novembre Horror consigliati da leggere non in pdf Sicuramente uno dei thriller per adulti più paurosi che abbia lettofantasy horror, horror racconti, horror italiano, stato di paura, osc",
  "genres": [],
  "author": "Federico Calafati",
  "average_rating": "4.76",
  "url": "https://www.goodreads.com/book/show/35530496-orrore-in-periferia"
}