{
  "title": "The Zee Brothers : Zombie Exterminators (Standard Edition): Curse of the Zombie Omelet!",
  "description": "This is an alternate cover edition of ASINB013Z3K06W.Orgasms, Chocolate & Zombies? Just an average day for Jonah, Judas & JJ.The Zee Brothers have a strange and dangerous vocation. While some hunt rodents or pests in the dark, Jonah and Judas tackle much larger prey… Zombies. Equipped with a well-loved artillery gun, DeeDee, and a much used and somewhat abused pickup truck called Sasha, the duo clear the night of undead pests, keeping the ever present threat of a Zombie Apocalypse at bay.When the slap happy pair receives an after hours call for extermination that ends in a gurgle, they head out, guns locked and catch pole loaded. It seems that an incredibly foolish developer built a high cost, gated community atop an old indian Reservation – a Reservation that soon became a graveyard and home to magic much older than the flimsy walled homes that tried to take over. Lost in this sea of new houses, an ancient artifact lay buried till the obnoxious Home Owners Association President disturbed it – and awakened the Zombies from their slumber to retrieve it. Now it’s up to the Brothers to find it and lay the walking dead to rest. Along the way they meet the woman of their dreams, JJ, her magical and disco imbued dog, Xanadu, a denture wearing Zombie and a High Priest that offers a bit more danger than DeeDee can handle.Filled with pop culture nods and heroes that just don’t know when to quit, it’s a slap happy, blood filled adventure, as the trio fights off zombies and the brothers fight each other for JJ’s affection. If you like Ash Vs Evil Dead, Army of Darkness and Scooby Doo, you’ll want to buy this action packed romp and dive into The Zee Brother’s adventures today!",
  "genres": [
    "Zombies",
    "Horror",
    "Humor",
    "Fantasy",
    "Fiction",
    "Comedy",
    "Audiobook"
  ],
  "author": "Grivante",
  "average_rating": "3.90",
  "url": "https://www.goodreads.com/book/show/35529113-the-zee-brothers"
}