{
  "title": "The Day Diana Died: 25th Anniversary",
  "description": "Over 3.8 million downloads\"When I was born, I was unwanted. When I married Charles, I was unwanted. When I joined the Royal Family, I was unwanted. I want to be wanted.\" --Diana, Princess of WalesWhere were you the day Diana died? Like the assassination of John F. Kennedy, the tragic death of the Princess of Wales on August 31, 1997 is one of the defining benchmarks in history - an event that touched each of us so profoundly we will never forget the moment we heard the news. Twenty-five years after the Paris car crash that ended Diana's life at age thirty-six, the story of her remarkable life and tragic death still have the power to mesmerize. Following her storybook wedding to Prince Charles, she had evolved from \"Shy Di\" into the planet's most photographed, written-about, and talked-about woman - indeed, the most famous person in the world. For all Diana's global fame, much of the human drama that swirled around her death remained veiled in mystery and intrigue.Here, in the manner of his other 17 New York Times bestsellers, Christopher Andersen draws upon important sources - many of whom are agreeing to speak for the first time - to re-create in vivid and often startling detail the events leading up to that fateful night in Paris. Among the many *Important information about Diana's final moments alive, the accident itself--and her last words *Prince Charles's surprising reaction to the news of Diana's death--including his shock the first time he saw her body--the Queen's bizarre request, and a riveting account of how Prince William and Prince Harry coped with their shock and grief *The broken romance that pushed Diana into the arms of Dodi Fayed, their curious relationship, and whether or not she truly planned to marry him. *A behind-the-scenes account of the battle royal that raged between the Queen and Prince Charles in the days leading up to the funeral. *Diana's spiritual quest, and the warnings that might have saved her. *Final answers to persistent rumors that Diana was pregnant at the time of the accident--and that she was the victim of a murder plot. *At the end, what Diana wanted for her sons, her vision of a future King William--and the American icon she most wanted him to emulate. Diana was, in every sense of the word, larger than life - a force of nature that, as the Royal Family learned, could be neither dismissed nor ignored. A bittersweet saga of triumph, love, and loss, The Day Diana Died captures those last days when Diana's star never shone brighter--and evokes the beauty, grace, heartache, and compassion that made Diana one of the most compelling figures of our time.\"Swift and astounding reading.\" -Time\"The book that sparked a media frenzy.\" -The Washington Post\"A fabulous, addictive read.\" -Chicago Sun-Times\"Riveting.\" -People The most worth reading...comes closest to making her sparkle.\" -The New York Times\"Poignant, intimate. Andersen's insights are as sharp as his details.\" -NewsweekCHRISTOPHER ANDERSEN is the critically-acclaimed author of 18 New York Times bestsellers which have been translated into more than 25 languages worldwide. Two of his books--THE DAY DIANA DIED and THE DAY JOHN DIED--reached #1. A former contributing editor of Time Magazine and longtime senior editor of PEOPLE magazine, Andersen has also written hundreds of articles for a wide range of publications, including The New York Times, Life, and Vanity Fair.",
  "genres": [
    "Nonfiction",
    "Biography",
    "History",
    "Biography Memoir",
    "Memoir",
    "Audiobook",
    "British Literature"
  ],
  "author": "Christopher Andersen",
  "average_rating": "4.21",
  "url": "https://www.goodreads.com/book/show/35556045-the-day-diana-died"
}