{
  "title": "Hail No",
  "description": "Evander Lennox doesn’t do anything he doesn’t want to do. At least, that is, until he’s sent to prison. The four years he's incarcerated, he’s had no choice but to do the things he's asked to do, when he’s asked to do them. And now, if he doesn’t, it will mean a one-way ticket straight back to hell.  Once he’s free, it takes him twenty-four hours to get his old job back, his dog at home where he belongs, and an understanding that people aren’t as forgiving as he once thought them to be. He’s just about given up hope of ever integrating back into society when a woman slams into his heart, literally and figuratively.  ***  Kennedy Swallow just wants to belong somewhere.  When she was younger, her parents divorced, and chose to separate her from her twin. Fast forward fifteen years, and she’s finally getting to meet the family she’s always wanted to be a part of. To make that happen, she uproots her life and moves to the tiny town of Hostel, Texas—giving her almost everything she’s ever wanted.  Just when she thinks she’s making progress in winning her family over, she finds out that her twin is ill, and the only reason her family tolerates her is due to the convenience of having a free caretaker whenever they might be in need of one.  After a few eye-opening experiences, she quickly realizes that she’s being used. Vowing to herself that she’ll make the best of the situation, she begins to steel her heart. What she doesn’t prepare for is a man named Evander who sees that barrier as a challenge.  ***  It takes Evander all of ten seconds while watching the woman on the floor, bleeding from her jaw, to realize that maybe life isn’t as bad as it could be.  This woman with her thrill for life, a crazy obsession with chickens, and a desire to be wanted, changes everything he thinks he knows.  But it doesn’t take long for him to realize that just by being around her, the people of the town have judged her guilty by association.  Her business suffers, and soon after, she realizes what it will mean to have him by her side—the loss of everything she’s worked so hard for.  Kennedy knows that Evander is worth it. Evander, however, decides that he’s not letting another person get hurt because he was stupid enough to care.",
  "genres": [
    "Romance",
    "Contemporary",
    "Contemporary Romance",
    "Audiobook",
    "Suspense",
    "Humor",
    "Romantic Suspense"
  ],
  "author": "Lani Lynn Vale",
  "average_rating": "4.14",
  "url": "https://www.goodreads.com/book/show/35542838-hail-no"
}