{
  "title": "The Big Rich: The Rise and Fall of the Greatest Texas Oil Fortunes",
  "description": "In The Big Rich, bestselling author and Vanity Fair special correspondent Bryan Burrough chronicles the rise and fall of one of the great economic and political powerhouses of the twentieth century—Texas oil. By weaving together the epic sagas of the industry’s four greatest fortunes, Burrough has produced an enthralling tale of money, family, and power in the American century. Known in their day as the Big Four, Roy Cullen, H. L. Hunt, Clint Murchison, and Sid Richardson were all from modest backgrounds, and all became patriarchs of the wealthiest oil families in Texas. As a class they came to be known as the Big Rich, and together they created a new legend in America—the swaggering Texas oilman who owns private islands, sprawling ranches and perhaps a football team or two, and mingles with presidents and Hollywood stars. The truth more than lives up to the myth. Along with their peers, the Big Four shifted wealth and power in America away from the East Coast, sending three of their state’s native sons to the White House and largely bankrolling the rise of modern conservatism in America. H. L. Hunt became America’s richest man by grabbing Texas’s largest oilfield out from under the nose of the man who found it; he was also a lifelong bigamist. Clint Murchison entertained British royalty on his Mexican hacienda and bet on racehorses—and conducted dirty deals—with J. Edgar Hoover. Roy Cullen, an elementary school dropout, used his millions to revive the hapless Texas GOP. And Sid Richardson, the Big Four’s fun-loving bachelor, was a friend of several presidents, including, most fatefully, Lyndon Johnson. The Big Four produced offspring who frequently made more headlines, and in some cases more millions, than they did. With few exceptions, however, their fortunes came to an end in a swirl of bitter family feuds, scandals, and bankruptcies, and by the late 1980s, the era of the Big Rich was over. But as Texas native Bryan Burrough reveals in this hugely entertaining account, the profound economic, political, and cultural influence of Texas oil is still keenly felt today.",
  "genres": [
    "History",
    "Nonfiction",
    "Business",
    "Biography",
    "American History",
    "Audiobook",
    "Politics"
  ],
  "author": "Bryan Burrough",
  "average_rating": "4.08",
  "url": "https://www.goodreads.com/book/show/3554517-the-big-rich"
}