{
  "title": "The Prison Letters of Nelson Mandela",
  "description": "Arrested in 1962 as South Africa’s apartheid regime intensified its brutal campaign against political opponents, forty-four-year-old lawyer and African National Congress activist Nelson Mandela had no idea that he would spend the next twenty-seven years in jail. During his 10,052 days of incarceration, the future leader of South Africa wrote a multitude of letters to unyielding prison authorities, fellow activists, government officials, and, most memorably, to his courageous wife, Winnie, and his five children. Now, 255 of these letters, many of which have never been published, provide exceptional insight into how Mandela maintained his inner spirits while living in almost complete isolation, and how he engaged with an outside world that became increasingly outraged by his plight.Organized chronologically and divided by the four venues in which he was held as a sentenced prisoner, The Prison Letters of Nelson Mandela begins in Pretoria Local Prison, where Mandela was held following his 1962 trial. In 1964, Mandela was taken to Robben Island Prison, where a stark existence was lightened only by visits and letters from family. After eighteen years, Mandela was transferred to Pollsmoor Prison, a large complex outside of Cape Town with beds and better food, but where he and four of his comrades were confined to a rooftop cell, apart from the rest of the prison population. Finally, Mandela was taken to Victor Verster Prison in 1988, where he was held until his release on February 11, 1990.With accompanying facsimiles of some of his actual letters, this landmark volume reveals how Mandela, a lawyer by training, advocated for prisoners’ human rights. It reveals him to be a loving father, who wrote to his daughter, “I sometimes wish science could invent miracles and make my daughter get her missing birthday cards and have the pleasure of knowing that her Pa loves her,” aware that photos and letters he sent had simply disappeared.More painful still are the letters written in 1969, when Mandela—forbidden from attending the funerals of his mother and his son Thembi—was reduced to consoling family members through correspondence. Yet, what emerges most powerfully is Mandela’s unfaltering optimism: “Honour belongs to those who never forsake the truth even when things seem dark grim, who try over and over again, who are never discouraged by insults, humiliation even defeat.”Whether providing unwavering support to his also-imprisoned wife or outlining a human-rights philosophy that resonates today, The Prison Letters of Nelson Mandela reveals the heroism of a man who refused to compromise his moral values in the face of extraordinary punishment. Ultimately, these letters position Mandela as one of the most inspiring figures of the twentieth century. From The Prison Letters of Nelson Mandela “A new world will be won not by those who stand at a distance with their arms folded, but by those who are in the arena, whose garments are torn by storms whose bodies are maimed in the course of contest.”“I am convinced that floods of personal disaster can never drown a determined revolutionary nor can the cumulus of misery that accompanies tragedy suffocate him.”“My respect for human beings is based, not on the colour of a man’s skin nor authority he may wield, but purely on merit.”“A good pen can also remind us of the happiest moments in our lives, bring noble ideas into our dens, our blood our souls. It can turn tragedy into hope victory.”",
  "genres": [
    "Nonfiction",
    "History",
    "Biography",
    "South Africa",
    "Africa",
    "Politics",
    "Memoir"
  ],
  "author": "Nelson Mandela",
  "average_rating": "4.06",
  "url": "https://www.goodreads.com/book/show/35535497-the-prison-letters-of-nelson-mandela"
}