{
  "title": "Shift: Creating Better Tomorrows; Winning at Work and in Life",
  "description": "''Discovering how to pick yourself up off the ground, how to rebound from sickness, or simply how to solider ahead through whatever roadblock you encounter--that's the crux of Shift '' --Ted King, professional road cyclistShift is a must-read for anyone looking to change their perspective, abandon bad days, and live a more purposeful life. In the book, corporate leadership coach Michael O'Brien shows that the secret to becoming our best starts with shifting our mindset and he offers the steps we can take to do so. Drawing on the personal story of his ''last bad day,'' Michael shares the emotional and physical recovery from his near-death accident on the morning of July 11th, 2001. A keen cyclist out on a training ride in New Mexico, Michael was hit head-on by an SUV that crossed into his lane traveling 40 miles per hour. He invites readers into the early darkness of his recovery and, ultimately, the empowering perspective shift he gained through his difficult we are defined by how we respond to a tragedy and not by the tragedy itself. Michael used his newfound perspective to fuel his recovery and help him create a better and better tomorrow. Now he's sharing his hard-earned insights to help others realize their own success. In Shift , Michael introduces ''ways of being'' that can help anyone build a stronger peloton*, the team that transcends the individual, and get closer to the best version of themselves. Michael's story is life changing, inspirational, and insightful. Shift is about how mindset, perspective, and grit can empower each of us to ride the ups and downs of our life's journey and to create a better tomorrow.ALL the profits from Shift will go to World Bicycle Relief. Companion to Michael's My Last Bad Day How to Prevent Bad Moments from Turning into Bad Days --a practical and powerful guide that outlines what you can do to be bad day free.* the main group or pack of riders in a road bicycle race. Riders save energy by riding close together, through drafting or slipstreaming.",
  "genres": [
    "Business",
    "Memoir",
    "Nonfiction"
  ],
  "author": "Michael      O'Brien",
  "average_rating": "4.26",
  "url": "https://www.goodreads.com/book/show/35541356-shift"
}