{
  "title": "The Faith of Barack Obama",
  "description": "Get inside the mind and soul of Barack Obama In The Faith of Barack Obama , New York Times bestselling author Stephen Mansfield takes readers inside the mind, heart, and soul of presidential hopeful Barack Obama—as a person of faith, as a man, as an American, and possibly as our future commander in chief. America faces looming inflation, climate change, a national credit crisis, war in the Middle East, threats to security and liberty at home, and skyrocketing oil and gas prices. With all of these threats to our security, prosperity and freedom on the horizon, it has never been more important to choose the right leader for America. “If a man’s faith is sincere, it is the most important thing about him, and it is impossible to understand who he is and how he will lead without first understanding the religious vision that informs his life,” writes Mansfield. In The Faith of Barack Obama , Mansfield holds back nothing to share that vision and explain its roots, • Obama’s upbringing in a non-Christian home• the influence on his life from his agnostic mother and Muslim father• his remarkable turn to Christianity after working in the inner cities of Chicago• his years at the controversial Trinity United Church of Christ• his association to the radical teachings of Rev. Jeremiah Wright• the source of Obama’s relentless optimism and hope for AmericaEvery American voter concerned to know more about Obama’s beliefs, both religious and political, and how the two intertwine should read this book, as should every thinking person who continues to shape and evolve his or her religious beliefs. Barack Obama, according to Mansfield, is “raising the banner of what he hopes will be the faith-based politics of a new generation . . . and he will carry that banner to whatever heights of power his God and the American people allow.” “You must read this perceptive and well written book. Then you will know why Barack Obama has such a passion for justice and equity, such a gift for filling people of different generations with a newfound hope that things can and will change for the better.” —ARCHBISHOP DESMOND TUTU",
  "genres": [
    "Nonfiction",
    "Biography",
    "Religion",
    "Politics",
    "Christianity",
    "Faith",
    "American History"
  ],
  "author": "Stephen Mansfield",
  "average_rating": "3.48",
  "url": "https://www.goodreads.com/book/show/3554527-the-faith-of-barack-obama"
}