{
  "title": "The Necromancer",
  "description": "THE NECROMANCER Michelle was brutally attacked in her locked hotel room in Las Vegas. The police didn't believe her and thought she must have lured a man up to her hotel room for a little sexual adventure, which went dangerously out of control. Michelle sustained visible scars from the terrifying and almost lethal attack, but pure fear motivated the move from her home in California to Hawaii. She's scared her attacker will come back. She's sure the next time he'll kill her. Now she has a successful career and she figures abstinence is an acceptable, if lonely, way to live.Michelle decides an affair with a wickedly handsome man who moves into her building might cure her of the humiliating, embarrassing, and uncontrollable anxiety attacks which plague her whenever she finds herself alone with a man. How could she know that she made the worst possible choice? Omar Satinov, the man Michelle has chosen, is a secret, whispered legend across several continents. His lure is a mystical religion based upon Witchcraft; his hook, the addictive herbal products he sells his followers. But does he really have supernatural powers, as many of his disciples believe? _________________________Reviews ...I would recommend this book very highly! It was an extremely entertaining read that kept me hooked right up to the end. ... Being from Honolulu myself, I really enjoyed the references to some of my old haunts in Necromancer. However, I never knew so much intrigue was going on! ...I am left wanting to read more of the authors work. It was one of the best books that I have read lately, and I read a lot. ... Enjoyed every moment reading this book. Kept me up until 5 am for 3 nights running. All the characters are well developed, the story moves so fast and smoothly there was no place to stop, nor did I want to. Looking forward to reading her other books.",
  "genres": [
    "Paranormal",
    "Romance",
    "Paranormal Romance",
    "Fantasy",
    "Urban Fantasy",
    "Fiction",
    "Amazon"
  ],
  "author": "P.M. Richter",
  "average_rating": "3.32",
  "url": "https://www.goodreads.com/book/show/10221085-the-necromancer"
}