{
  "title": "Logan’s Chef Notes & Half Baked Tales – Cooking Dreams",
  "description": "Logan Guleff, 14, winner of Season 2 of MasterChef Junior, releases his first cookbook “Logan’s Chef Notes and Half Baked Tales”. The next generation of cooking books. (https://loganschefnotes.com/)“My first cookbook is a graphic novel adventure. It is a totally new concept in cookbooks. It’s hot, fresh, and seasoned,” says Logan. He adds,” My unique culinary journey, much like this book, is fueled by my passion for food and the love of adventure.”The cookbook is separated into two segments. The first part of the book is created in manga while the second half focuses on food and cooking techniques with lots of photos. Logan explains, “Cooking Dreams is my imagination. I want to inspire kids to think like a chef, to learn about food, and to add a dash of creativity. And above all, I want them to work toward their dreams”.Quotes about the book:“Mix Passion, Skill, Creativity and Imagination into a delicious story …” Chef Graham Elliot – Celebrity Chef“Always Dreaming ...” Jessica Biel – Actress, Restaurateur“Inspires others to think as he does, to be creative and innovative …” Chef Eric Kopelow – Universal Studios HollywoodLogan has been named one of the Most Influential Teens by Time Magazine and a James Beard Blended Burger Winner. Since becoming the 2014 MasterChef Junior champion he has become a rising star in the culinary world. He was named Southern Living‘s Best New Southern Cook and earned a spot on Fortune Magazine’s 18 Under 18 list; he’s also the youngest certified judge for the World Championship Barbecue Cooking Contest in Memphis, Tennessee, and the youngest chef to cook at the historic James Beard House in New York City. And just recently finished judging the International Young Chef Olympiad in India.",
  "genres": [],
  "author": "Logan Guleff",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/35554853-logan-s-chef-notes-half-baked-tales-cooking-dreams"
}