{
  "title": "Weird Chicago: A History of Mysteries, Strange Tales, and Hauntings across the Windy City",
  "description": "*Includes pictures *Includes online resources and a bibliography for further reading *Includes a table of contents Although there had been treaties and seemingly cordial trading between the Native Americans and the new settlers in that area, recent fighting in nearby areas like the Battle of Tippecanoe less than a year earlier kept all sides on edge, and the British aim to maintain a barrier between America and Canada by propping up Native American tribes led to a controversial battle in the Illinois Territory at Fort Dearborn, a fort built along the Chicago River, shortly after the War of 1812 broke out. When the war came, the close proximity of British forces compelled American military officers in the area to attempt to evacuate the garrison at Fort Dearborn, but misunderstandings and a lack of time resulted in Potawatomi warriors ambushing the soldiers and several civilians before they could retreat back to Fort Wayne, Indiana. In the wake of cutting down dozens of whites, the Potawatomi laid waste to Fort Dearborn itself, and though the fighting was technically a battle, in America the Battle of Fort Dearborn was known colloquially as the Fort Dearborn Massacre. Though it started as a 300 person settlement in 1832, Chicago’s location near the Great Lakes and its access to the Mississippi River turned it into a major trading city overnight. The city became even more important when railroads were constructed to connect the country, making it the first major city in the “West” during the mid-19th century. By 1871, the original 300 person settlement was now home to about 300,000 people, and Chicago had become the first major city built by Americans rather than European colonial powers Thus, it had taken less than 40 years for the new settlement of 300 to become a city of nearly 300,000, but it only took two days in 1871 for much of it to be destroyed. On the night of October 8, 1871, a blaze in the southwestern section of Chicago began to burn out of control. The popular legend is that a cow in Mrs. Catherine O’Leary’s barn had kicked over a lantern and started a fire. The story blaming the cow was a colorful fabrication, but the fire itself was very real, lasting almost two whole days and devouring several square miles of the city. The fire was so powerful that firefighters could not put it out, due to dry conditions, stiff winds, and the fact the city was mostly made of wood. Walking around Chicago today, it’s easy to forget about its past as a rural frontier. That’s due in no small part to the way Chicago responded to the Great Fire of 1871. Immediately after the fire, Chicago encouraged inhabitants and architects to build over the ruins, spurring creative architecture with elaborate designs. Architects descended upon the city for the opportunity to rebuild the area, and over the next few decades they had rebuilt Chicago with the country’s most modern architecture and monuments. Chicago has a long and fascinating history, but there’s another, more mysterious side to the Windy City. Ghosts have competed with gangsters in scaring the locals, while serial killers beat them both in instilling terror. Out on Lake Michigan, boats disappear and strange ruins lie under the water, while in graveyards, phantoms and even vampires are alleged to walk amid the tombstones. What follows is just a sampling of the many strange tales Chicago has to offer. Weird A History of Mysteries, Strange Tales, and Hauntings across the Windy City is part of an ongoing series by Sean McLachlan and Charles River Editors that includes The Weird Wild West, Mysteries of the South, The Mysterious Midwest, and Mysterious New England, and more regional titles will be coming soon.",
  "genres": [
    "Paranormal"
  ],
  "author": "Charles River Editors",
  "average_rating": "3.60",
  "url": "https://www.goodreads.com/book/show/35558811-weird-chicago"
}