{
  "title": "All the Weight of Our Dreams: On Living Racialized Autism",
  "description": "Delve into poetry, essays, short fiction, photography, paintings, and drawings in the first-ever anthology entirely by autistic people of color, featuring 61 writers and artists from seven countries. The work here represents the lives, politics, and artistic expressions of Black, Brown, Latinx, Indigenous, Mixed-Race, and other racialized and people of color from many autistic communities, often speaking out sharply on issues of marginality, intersectionality, and liberation.  All contributors featured: Amanda Filteau, Angel Alexzandrea McCorkle, Anmei He, Bijhan Valibeigi, Cindy Facteau (Fragmented Perfection), Christopher Tucker, Confessions of a Black Rhapsodic Aspie (COBRA), Daniel Au Valencia, D. Campbell Williams, Dee Phair (sometimesdee), Deion Hawkins, E. Ashkenazy, Ebru Çelik, Eliora Smith, Elly Wong, Emily Pate, Emma Rosenthal, Emmalia Harrington, Miss Fabien, Finn Gardiner, G.A., HarkenSlasher, Helene Fischer, Jane Strauss, Jen Meunier (Gzhibaeassigaekwe), Jennifer Msumba, Jessa Sturgeon, Joseph “Joey” Juarez, Kaijaii Gomez Wick, Kassiane A. Asasumasu, Keara Farnan, Kelly Bron Johnson (@KBronJohn, @OneQuarterMama), //kiran foster, Kristy Y., Legacy Onaiwu, leylah, Louise Thundercloud-Hills, Lucas Vizeu, Lydia X. Z. Brown, Maanu Alexander, M.D., Melis Leflef (Melissa Murphy), Mikael Lee, Morénike Giwa Onaiwu, Nathaniel Hagemaster (Agony Myers), N.I. Nicholson, Nicole S. Xurd (Shalese Nicole Heard), Ondrea Marisa Robinson, Pharaoh Inkabuss (Timotheus “T.J.” Gordon), Pretty Eyes Ellis, Rhonda G., Rikki Katherine Lee Moses, S. Henderson, Shane Bentley, Shondolyn Gibson, Stephan B., Taiyo Brown, Vivie Bella Papaleo, Yasmin Khoshnood, Ylanne So, Yvonne Christian (Uncommon Bostonian)",
  "genres": [
    "Autistic Spectrum Disorder",
    "Nonfiction",
    "Disability",
    "Poetry",
    "Race",
    "Anthologies",
    "Essays"
  ],
  "author": "Lydia X.Z. Brown",
  "average_rating": "4.54",
  "url": "https://www.goodreads.com/book/show/35564512-all-the-weight-of-our-dreams"
}