{
  "title": "Raw Power",
  "description": "They fought for their country. Now they fight for you.\n   To find the people lost in the shadows, you need the men who live in them. The former soldiers of 11th Hour are unaffiliated, unacknowledged, and definitely illegal. They protect the innocent, destroy the guilty—and capture hearts along the way . . .   Rugged, skilled, and hard-bodied, Jack King’s whole life was the Marines until an injury left him discharged from active duty. But he finds a new purpose when he’s recruited by a special unit that employs ex-military to do very special jobs. Yet he’s not impressed when his first assignment is babysitting the pretty, perfect daughter of a politician—especially when she’s far from the angel she appears to be . . .   Callie Hawthorne hates politics, and she hates playing the part of a senator’s goody two shoes daughter even more. It only gets worse when her father decides she needs a security detail 24/7—and the bodyguard happens to be the most insanely hot guy Callie’s ever seen. Still, she’s not going to be ordered around just because of some half-assed threat to her father. . . . But when it turns out her dad’s no angel either, Jack has to kidnap Callie in order to protect her. And as danger closes in, he’ll need all his considerable talents to keep them both alive. The greater challenge will be to keep his hands off her . . .   Praise for Jackie Ashenden’s Dirty for Me   “An intense scorcher of a story that is sure to delight fans and win her a legion of new devotees. . . . Unforgettable.” —RT Book Reviews, Top Pick  “Tension and heat pervade the frequent sex scenes . . . Readers will eagerly anticipate future installments in the series.” —Publishers Weekly    “Explosively sexy.”  —Heroes & Heartbreakers",
  "genres": [
    "Military Fiction",
    "Romance",
    "Military Romance",
    "Suspense",
    "Romantic Suspense",
    "Contemporary Romance",
    "Contemporary"
  ],
  "author": "Jackie Ashenden",
  "average_rating": "3.77",
  "url": "https://www.goodreads.com/book/show/35565872-raw-power"
}