{
  "title": "Raising White Kids: Bringing Up Children in a Racially Unjust America",
  "description": "This New York Times best-selling book is a guide for families, educators, and communities to raise their children to be able and active anti-racist allies.With a foreword by Tim Wise, Raising White Kids is for families, churches, educators, and communities who want to equip their children to be active and able participants in a society that is becoming one of the most racially diverse in the world while remaining full of racial tensions. For white people who are committed to equity and justice, living in a nation that remains racially unjust and deeply segregated creates unique conundrums.These conundrums begin early in life and impact the racial development of white children in powerful ways. What can we do within our homes, communities and schools? Should we teach our children to be “colorblind”? Or, should we teach them to notice race? What roles do we want to equip them to play in addressing racism when they encounter it? What strategies will help our children learn to function well in a diverse nation?Talking about race means naming the reality of white privilege and hierarchy. How do we talk about race honestly, then, without making our children feel bad about being white? Most importantly, how do we do any of this in age-appropriate ways?While a great deal of public discussion exists in regard to the impact of race and racism on children of color, meaningful dialogue about and resources for understanding the impact of race on white children are woefully absent. Raising White Kids steps into that void.\"Most white Americans didn't get from our own families the concrete teaching and modeling we needed to be active in the work of racial justice ourselves, let alone to feel equipped now to talk about race with and teach anti-racism to our children. There is so much we need to learn and it's urgent that we do so. But the good news we can,\" says Jennifer Harvey.",
  "genres": [
    "Parenting",
    "Nonfiction",
    "Race",
    "Social Justice",
    "Anti Racist",
    "Education",
    "Childrens"
  ],
  "author": "Jennifer    Harvey",
  "average_rating": "4.16",
  "url": "https://www.goodreads.com/book/show/35585862-raising-white-kids"
}