{
  "title": "Pushing Patrick",
  "description": "A Friends to Lover romance like you’ve never read before… Cari Patrick is my friend.My best friend.He’s every good girl’s dream come true.Funny, sweet and holy-hell hot .Perfect.So what’s the problem?I’m far from perfect and I’m no one’s idea of a good girl.I know that, but I’ve wanted Patrick ever since the first night we met. Ever since I kissed him and… well, did decidedly ungood-girl things to him in the front seat of his car. The same night he gently but firmly shut me down completely with a it was nice to meet you, Cari. I know he’s out of my league, but that doesn’t stop me from wanting him.And if the way he looks at me when he thinks no one is paying attention is any indicator, he wants me too.But he’ll never make a move on me. Not unless I make him. That’s what my friend Tess says. She thinks all Patrick needs is a little push. I think she might be right.The last thing I expected was for him to push back. Patrick Cari is my friend. My best friend. She’s the perfect male fantasy come to life. Talented, smart and so damn beautiful that when she’s around, I can’t seem to look at anyone else. Perfect. So, what’s the problem? I’m a nice guy and we all know where nice guys finish. Dead last. I’ve wanted Cari ever since the first night we met. The night she kissed me. Touched me in ways that made it hard for me to think clearly. But she was drunk and just broken up with her douchebag boyfriend—as much as I wanted her, I couldn’t take advantage of her that way. Because Nice Guy, remember. Even though it’s been years since that night and know she’s moved on, I can’t stop thinking about her. About that night. How good she tasted. How good she felt. But we’re friends now. Best friends. Roommates. And it’s driving me absolutely insane.**Patrick and Cari's story concludes in volume 2, Claiming Cari. If you'd like to read their complete story without a cliffhanger, please look for THE GILROY CLAN vol. 1-2 on Amazon.**",
  "genres": [
    "Romance",
    "Friends To Lovers",
    "Contemporary Romance",
    "Contemporary",
    "Fiction",
    "College",
    "New Adult"
  ],
  "author": "Megyn Ward",
  "average_rating": "4.10",
  "url": "https://www.goodreads.com/book/show/35575830-pushing-patrick"
}