{
  "title": "After All",
  "description": "- A fake relationship? √ - Lovers to enemies to lovers? √ - A steamy one-night stand turned into a wild publicity stunt? √  A hot & cocky Hollywood actor meets his match when he falls for the sassy girl next door in AFTER ALL. Light, fun and sexy as sin, it's the PERFECT SUMMER READ. From the NYT and USA Today bestselling author of The Pact and Before I Ever Met You.  Emmett Hill is the perfect gentleman.  At least that's what his PR team wants the world to think.  Tall, handsome, and wickedly charming, Emmett is in the midst of a career comeback, having landed the role of a villain in a popular TV show. The only problem is, Emmett has come a long way from the \"nice guy\" characters he used to play and his old squeaky clean image is quickly being tarnished by bar fights, womanizing and bad boy behaviour. Considering he's two years shy of forty, it's an act he needs to drop. And fast.  Enter Alyssa Martin.  At twenty-eight, Alyssa is tired and ready for a change. Her job as office manager has grown stagnant and unfulfilling, while she's become continuously frustrated with Vancouver's lackluster dating scene, always searching for Mr. Right in a city of Mr. Wrongs.  When Emmett and Alyssa's paths cross at a mutual friend's wedding, their chemistry is off-the-charts hot, culminating in a steamy one-night stand.  What neither expected was for the media catch wind of their coupling - and run with it.  Now Emmett has to convince Alyssa to date him for the sake of his image. Her curvy, cute and \"normal\" persona is just the ticket to smoothing out his reputation, while Emmett provides Alyssa with the excitement and change her life has been lacking.  The only problem is, the two fight like cats and dogs outside of the bedroom.  And considering their arrangement is just for show, they shouldn't be in the bedroom with each other anyway.  Right?  Try telling them that.",
  "genres": [
    "Romance",
    "Contemporary",
    "Contemporary Romance",
    "Enemies To Lovers",
    "Adult",
    "Audiobook",
    "New Adult"
  ],
  "author": "Karina Halle",
  "average_rating": "3.77",
  "url": "https://www.goodreads.com/book/show/35575668-after-all"
}