{
  "title": "The Temptation of Forgiveness",
  "description": "In the twenty-seventh novel in Donna Leon's bestselling mystery series, a suspicious accident leads Commissario Guido Brunetti to uncover a longstanding scam with disturbing unintended consequencesThe memorable characters and Venetian drama that have long captivated Donna Leon’s many readers are on full display in The Temptation of Forgiveness. Surprised, if not dismayed, to discover from his superior, Vice-Questore Patta, that leaks are emanating from the Questura, Commissario Guido Brunetti is surprised more consequentially by the appearance of a friend of his wife’s, fearful that her son is using drugs and hopeful Brunetti can somehow intervene. When Tullio Gasparini, the woman’s husband, is found unconscious and with a serious brain injury at the foot of a bridge in Venice after midnight, Brunetti is drawn to pursue a possible connection to the boy’s behavior. But the truth, as Brunetti has experienced so often, is not straightforward.As the twenty-seventh novel unfolds in Donna Leon’s exquisite chronicle of Venetian life in all its blissful and sordid aspects, Brunetti pursues several false and contradictory leads while growing ever more impressed by the intuition of his fellow Commissario, Claudia Griffoni, and by the endless resourcefulness and craftiness of Signorina Elettra, Patta’s secretary and gate-keeper. Exasperated by the petty bureaucracy that constantly bedevils him and threatens to expose Signorina Elettra, Brunetti is steadied by the embrace of his own family and by his passion for the classics. This predilection leads him to read Sophocles’ Antigone, and, in its light, consider the terrible consequences to which the actions of a tender heart can lead.",
  "genres": [
    "Mystery",
    "Fiction",
    "Italy",
    "Crime",
    "Audiobook",
    "Mystery Thriller",
    "Thriller"
  ],
  "author": "Donna Leon",
  "average_rating": "3.93",
  "url": "https://www.goodreads.com/book/show/35576032-the-temptation-of-forgiveness"
}