{
  "title": "Tempting Tristan",
  "description": "Alternate cover edition for ASIN B01EZ3ZZIYFor previous cover edition see hereTempting Tristan is a stand-alone M/M romance featuring two sexy, hot alphas. One injured war hero, one man who has loved and lost. Each struggling for a future not bound by his painful past.TRISTANI’m fresh off the heels of yet another bad relationship.I’m done. I’m taking a break from men to figure out what I keep doing wrong.I know my faults. I lead with my heart, not my head. But that’s never going to change.A few weeks into my no dick hiatus, I think I’ve got a handle on things.That is, until badass heartthrob Alex Wells strolls into my bar.ALEXEight years in the Army, months in a hospital bed, and far too long hiding my sexual identity has left me damaged, pissed off, and up for a Silver Star—for the incident that nearly cost me my life, and kept me from my grandmother's funeral.All I want is to forget my stint with the institution that allows but doesn't necessarily accept, and live the life I’ve always wanted. The hot bartender coming my way, just might be my gateway drug.But I’m f*cked up.The closer he gets, the more my walls go up, and he’s going to find out that my physical scars aren’t the ones that run the deepest.\"This book, I... am in awe. An M/M romance that all other Authors who write M/M should stand up take note.\"- Socially Book Nerd (5 Stars)\"What an amazing love story this is. The author really gripped me, I didn't want this book to end I wanted more!\" - A Book Lover's Emporium (5 Stars)\"This is the first Melissa Foster book that I've ever read, and I will definitely be reading more from her ASAP.\" - Happily Ever Chapter (5 Stars)\"Romantic and beautiful, Tristan is more than tempting. Alex is commanding and tender and the both of them together melt my heart.\" - The Book Fair Reviews (5 Stars)\"I love me a good M/M book, and this one has made its way to one of my favorites!!\" - Tiffany W, Goodreads Reviewer (5 Stars)\"Melissa Foster is synonymous with sexy, swoony, heartfelt romance!\" New York Times Bestseller Lauren Blakely\"With her wonderful characters and resonating emotions, Melissa Foster is a must-read author!\" New York Times Bestseller J. Kenner\"Catching Cassidy is laugh out loud funny, heartwarming, sexy, and hands down one of my favorite reads so far this year!\" #1 NYT Bestselling Author of The Bet, Rachel Van DykenHARBORSIDE NIGHTS is a sexy, hot, and evocatively real series of stand-alone romances that follows a group of friends who have known one another for years as \"summer\" friends, and now come together after college to build their lives. They're tough, edgy, and accepting--most of the time. This series is written in the same loving, raw, and emotional voice readers have come to love by New York Times & USA Today bestselling, award-winning author Melissa Foster with LGBT themes.**AUTHOR BIOMelissa Foster is a New York Times & USA Today bestselling and award-winning author. She writes sexy and heartwarming contemporary romance and new adult romance with emotionally compelling characters that stay with you long after you turn the last page. Perfect beach reads for contemporary romance lovers who enjoy reading about wealthy heroes and smart, sassy heroines.",
  "genres": [
    "M M Romance",
    "Romance",
    "Military Fiction",
    "Contemporary",
    "Audiobook",
    "Contemporary Romance",
    "LGBT"
  ],
  "author": "Melissa Foster",
  "average_rating": "4.06",
  "url": "https://www.goodreads.com/book/show/35582485-tempting-tristan"
}