{
  "title": "The Search for Mother Missing: A Peek Inside International Adoption",
  "description": "Travel for fun with the Vance Twins during their very first trip to Seoul, South Korea! This adventure takes place 20 years ago during what Janine calls “the dark ages” before social media, worldwide investigations into adoption agencies (where now the twins are participants '22), and her visionary and pioneering Adoption Trafficking Awareness Symposium for Against Child Trafficking in the USA and overseas.This vacation covers a very short span of only two weeks in ’04 while the twins attend an adoption conference for the first time and learn that other Korean adoptees and parents of loss have valid complaints and curiosities yet to be addressed by the authorities of the day in the field of International adoption.If you are adopted and didn’t get to attend the 50th anniversary intended to celebrate and contemplate international adoption from Seoul, South Korea, travel vicariously with the Vance twins. If you are not adopted but curious about a few adult adoptee experiences while they try to take lightly very heavy issues, the twins invite you to travel with them on their first trip of a lifetime together through the pages of this book.Spoiler You might not be able to detect the Vance twins’ bond with each other. But most twins know their bond needs no explanation. It is what it is. After learning that adoption agencies are known for separating twins, the Vance Twins are extremely happy that, at the very least, they were adopted together.Did you know that hundreds of Korean adoptees are now in the midst of a worldwide investigation into agencies? Visit www.AdoptionHistory.org or www.KoreanAdopteesWorldwide.net for updates on the case.",
  "genres": [
    "Nonfiction",
    "Adoption",
    "How To",
    "Education",
    "History",
    "Book Club"
  ],
  "author": "Janine Vance",
  "average_rating": "4.48",
  "url": "https://www.goodreads.com/book/show/35590467-the-search-for-mother-missing"
}