{
  "title": "How Free Are You?: The Determinism Problem",
  "description": "\"How are minds connected to brains? Or rather, how are mental events connected to neural events? How is your thinking or awareness now, as you read this very sentence, related to what is going on in your brain? If you choose to stop now and do something else, maybe your duty, how is thechoosing related to what is going on in your brain? That is the best and hardest question in the philosophy of mind. Little industries of philosophers and psychologists have been engaged in examining, rejecting, propounding and being confused by answers to it. It is also one question at the centerof determinism and freedom.\"Are we subject to determinism, a theory which suggests that we are merely creatures of cause and effect--no different than plants or machines? Or do we possess free will and responsibility for our actions--something that most feel we have, would be alarmed to lose, and may be told firmly we haveif we find ourselves in front of a judge? This is one of philosophy's most fundamental problems, and has sharply divided the greatest philosophers. Shelley wrote an ode to determinism and it was a belief that Einstein would not abandon. But it alarmed Immanuel Kant, enraged Samuel Johnson, depressedJohn Stuart Mill, overcame Freud, and was spurned by Sartre. This lucid work by eminent philosopher Ted Honderich offers a concise and readable introduction to a provocative question--easily one of the deepest and most important problems of philosophy and the question most obviously relevant toeveryday life as it concerns our responsibility, our affections, and our hopes.Examining these two rival theories, Honderich first investigates whether or not either theory is actually clear, consistent, complete, and demonstrably true--elements essential to a valid theory and a fully developed philosophy of mind. He then deals with the implications of determinism and itssignificance in our public and private actions. If determinism is true, he asks, does it mean that we are not free? Does it mean that our gratitude and resentment are irrational? These queries are hallmarks of a debate that has been one of philosophy's main battle grounds for centuries, withthinkers as distinguished as Hume and Kant in opposite camps. Judging the evidence for each in such key fields as neuroscience and quantum theory, as well as confronting arguments that have been defended over the centuries, Honderich puts this great problem into present day context and, in turn,offers an unprecedented philosophy of our existence. As accessible as it is rigorously argued, How Free Are You? offers profound new insights into a problem that affects us all.",
  "genres": [
    "Philosophy",
    "Nonfiction"
  ],
  "author": "Ted Honderich",
  "average_rating": "3.26",
  "url": "https://www.goodreads.com/book/show/3560635-how-free-are-you"
}