{
  "title": "The Rage That Follows",
  "description": "“The darkness faded slowly until he was able to see his brother and sister, still sound asleep. The blackness above him lingered longer than the rest.Then it shifted.Long midnight hair fell away to reveal the blanched face, mouth agape, eyes glassy pools of shadow. Wrath was still written in her features as she turned to regard Joren, a mere arm’s length away. The stark whiteness continued down a slender neck, where her emaciated skin turned black and sooty. As she held his gaze with unblinking eyes, one charred, bony arm unfolded from her side and rose to cover her mouth with a skeletal hand.”Beware the Burnt Lady's call.The Knights Seraphin are monster hunters — holy warriors tasked with driving evil from the world. Sergeant Garret Rhys and his detachment have faced all kinds of terrible creatures under the banner of the goddess Seraphe, but on the slope of the mighty Ymr Mountains, there awaits a threat that even they are unprepared for.  In a quiet sheepfold on the same mountain, Joren — a shepherd’s son — witnesses something terrifying in the woods near their house: a furious face amid the trees, staring at him and moving its lips in silence. It quickly disappears, and Joren tries to convince himself it was just his imagination.  When the Knights arrive at Joren’s home, requesting shelter, they are warmly received, as their selfless service is renowned throughout the world. Things take a turn for the worse in the middle of the night, however, when Joren’s little brother disappears.  As Sergeant Rhys and the rest of the Knights reluctantly agree to help search for the boy, Joren has a horrifying realization: the face he saw in the woods was real, and it’s after his family.  Joren’s peaceful world comes crashing down around him as the Knights Seraphin square off against a foe the likes of which they’ve never before encountered.  Evil has come to the Ymr and brought with it fear, anguish, and the rage that follows....",
  "genres": [],
  "author": "Nathaniel Badertscher",
  "average_rating": "4.40",
  "url": "https://www.goodreads.com/book/show/35609410-the-rage-that-follows"
}