{
  "title": "The Empty Space Between Stars",
  "description": "\"The suspense...keep[s] the reader wanting more...then deliver[s].\" - Writer's DigestWhile looking for emergency candles during the throes of a New Hampshire blizzard, 15 year-old Zoey Johansen pokes her head into the chill of her father's attic and finds an innocuous storage container. Alone and curious, she begins to open a Pandora's Box spilling the secrets behind her mother's undeniable burden of sadness, her father's addiction to odd tattoos, and-ultimately-the mysterious empty spaces between them all. She's never been able to find home. An only child and the product of long-divorced parents who'd escaped to opposite coasts, Zoey is lost. Even the family photograph framed in their California den looks bogus: Zoey gnawing her lower lip, standing rigid and apart from her stepfather and vulgar stepbrothers, her mother's strained attempt at a manufactured family for naught. Almost on a whim-really to avoid a dreadful vacation with her synthetic family-Zoey escapes California to visit her biological father for the first time in years. But instead of being the dad she needs, he instead asks her if she would simply pretend to be his niece. Soon stuck in an ice-locked New Hampshire town with an emotionally bankrupt man unwilling and unable to fill his role, she all but succumbs to the realization that she is just as rudderless here as she is there. Until a blizzard rolls in, a storage box opens, and The Empty Space Between Stars-like a dark and scabbing wound-closes. Amazon Reviews:\"I read this in one day and loved it. The characters felt real, like people we all know. And Zoey is a great main character, full of attitude but hiding deep loneliness and insecurity. The last couple chapters had me crying my eyes out.\"\"Wonderful book, wonderful, wonderful, wonderful. My daughters both read this before me, and I'd listen to them talking about it. So I thought I'd give it a shot. I can't recommend it enough! I don't read nearly as much a they do, but if more novels were like this I think I would. Something I will probably even re-read one of these days.\"\"Sean Conway takes his time in telling this casually-paced story (in a good way) of a teen returning to visit her father in New Hampshire. The dad's a bit of a self-involved jerk, to say the least. The very first night she's there, he leaves her to go on a date (he hasn't seen his daughter in 2 years). Plus, he doesn't want his date to know he has a kid (even though he's like 40), so he gets her to agree to say she's his niece visiting. They spend a lot of time hanging around dive bars, where she gets hit on by creeps. One night she has to drive them home because he's too hammered (even though she's 15 and obviously doesn't have a license). The trick after all that is Sean Conway is still able to make the dad someone we can empathize with, maybe even root for by the end. Well, maybe not root for. But we end up caring about all these characters in a deep way.\"\"A poignant story, the author gives us beautiful, real characters that are subtly developed in a story with a twist that will take your breath away. A great read.\"",
  "genres": [],
  "author": "Sean   Conway",
  "average_rating": "3.82",
  "url": "https://www.goodreads.com/book/show/12143190-the-empty-space-between-stars"
}