{
  "title": "De Dood van Europa",
  "description": "Een ijzingwekkende roman over de gevaarlijke cocktail van maatschappelijke onvrede en migratie.Europa Alexandrowna Ivanova heet ze voluit, maar ze noemt zich Ropa Ivanov. Geboren in 1991 in Griekenland uit Russische ouders, opgegroeid in Rotterdam. Blond, voluptueus, schor van het roken en zingen, harde drinker, wilde danser, twaalf ambachten en dertien ongelukken. Onenightstands, twonightstands, soms een verhouding die een week duurt – tot ze Matthijs Keeman ontmoet. Met Matthijs runt Ropa een succesvolle cokehandel. Als dat uit de hand loopt, besluiten ze af te kicken in het Drentse vakantiepark van de vader van Matthijs. Intussen stromen vluchtelingen Nederland binnen en het zieltogende vakantiepark verandert in een lucratief azc, een asielzoekerscentrum. Dan verdwijnt Ropa. Na een week wordt haar lichaam gevonden. Tientallen messteken, een uitbarsting van blinde haat.Ellen de Graaf, gescheiden en uitgeputte moeder van een zoon die niet wil deugen, is de regionale rechercheur die het onderzoek naar Ropa’s dood moet leiden. Al snel merkt ze dat ze op alle mogelijke manieren wordt tegengewerkt: te veel financiële belangen, te veel politieke pijnlijkheden en dus behoefte aan een doofpot.Maar de zaak ontspoort in de media: de onvrede die bij velen leeft over asielzoekers krijgt vorm, inhoud – en een gezicht. Ropa’s dood haalt de voorpagina’s, de talkshows. Er wordt brand gesticht in het azc, rellen en vechtpartijen slaan over naar de rest van het land. Den Haag moet ingrijpen. Maar kan iemand de bom die Ropa’s dood is nog op tijd ontmantelen?De dood van Europa is een ijzingwekkende roman over de gevaarlijke cocktail van maatschappelijke onvrede en migratie. Met meesterhand laat Leon de Winter zien hoe een schijnbaar onbeduidend incident kan uitgroeien tot een nationale revolutie.",
  "genres": [],
  "author": "Leon de Winter",
  "average_rating": "3.39",
  "url": "https://www.goodreads.com/book/show/35598404-de-dood-van-europa"
}