{
  "title": "Manhattanite",
  "description": "Poetry. Aaron Poochigian's prizewinning second collection of poetry, MANHATTANITE, is by turns frenzied and focused. It examines New York's juxtaposed symbols of towering achievement and monumental desolation, and then traverses the country to California's Central Valley, where the poet reclaims his grandparents' home. Poochigian consistently entertains, whether his theme is lamentation or celebration--a grizzled urban pigeon (scavenging for \"the sort of faith / that holds for here and now and vibes like song\") or an Ohio wind turbine (an \"ungatherable / iron flower\" seen \"juggling... / three arms' worth / of gale-force wind\"). MANHATTANITE is, deservedly, the winner of the 2016 Able Muse Book Award.\"In MANHATTANITE, Aaron Poochigian takes on the role of American flâneur for the twenty-first century, drifting through the frenetic metropolis at a dreamer's planetary pace. This collection is a celebration of exuberant melancholy, or melancholy exuberance, slick lyric cum urbane pastoral.\"--A. E. Stallings, 2016 Able Muse Book Award judge\"MANHATTANITE gives us the Manhattan of speed chess players in the park, tipsy tipplers tipping off the rooftops, the night sky bright with city light, tenants, tenements and supers. Aaron Poochigian is the poet in New York seeking a holy aura in the song of gunshots and spiral sirens, picking like a grizzled pigeon through stray newspapers, bottles, bags, and candy wrappers for a scrap of religion. Each poem is a tower growing out of our human filth and scraping the sky with sky-lines, and together they build a city of words. Put New York in your pocket. It's inside this book.\"--Tony Barnstone\"Reading Aaron Poochigian's MANHATTANITE is a dynamic, kinetic experience. These poems travel at a fast clip, pulling you along through cityscapes, wastelands, and other vistas. Some of the poems tunnel downward, plumbing depths of mood and memory. Whichever way they move, Poochigian's poems perform with such panache and brio that it's hard to know whether to laugh or cry. I'd say do both--and keep reading. But be this isn't a feel-good book. It's a fearless book.\"--Rachel Hadas\"Thoreau once boasted that he had traveled widely in Concord; Aaron Poochigian's title indicates that he has traveled widely elsewhere--in the one borough worth experiencing, through western deserts, aboard 'an ultra-modern train / lisping through French or German woods,' and in a Paris of naked bulbs and seedy cabarets. In all of these settings, he deftly choreographs his cast of nameless characters. The concluding lines of ' Go and Do It' claim, 'I'll still swear / we could be happy anywhere.' One sure location of that 'anywhere' exists between the covers of Manhattanite.\"--R. S. Gwynn",
  "genres": [
    "Poetry"
  ],
  "author": "Aaron Poochigian",
  "average_rating": "4.78",
  "url": "https://www.goodreads.com/book/show/35594439-manhattanite"
}