{
  "title": "The Girl Who Dared to Think",
  "description": "How do you fight an enemy when they're inside your mind?\nA gargantuan glass-walled tower looms over a deadly wilderness. They say it's all that's left.The Tower's survival is humanity's survival, and each must serve it faithfully...Twenty-year-old Liana Castell must be careful what she thinks. Her life is defined by the number on her wristband -- a rating out of ten awarded based on her usefulness and loyalty to the Tower, and monitored by a device in her skull. A device that reports forbidden thoughts.Liana is currently a four, the lowest possible acceptable score, and despite her parents' perfect scores of ten, she struggles to increase it. Rebellious ideas come all too easily, and resentfulness seems part of her being. She is an overseer-in-training, but her future will be dark if she cannot raise her worth...Threes require drug treatment.Twos are isolated.Ones disappear.When Liana's worst nightmare comes to pass and she drops to a three, desperation spurs her down a path few dare to tread. A chance encounter with a cocky young man whose shockingly dissident attitude toward the Tower couldn't possibly have earned him the perfect \"ten\" on his wrist, sets her on a trail to save herself--even at the risk of dropping lower.Stalking the young man seemed like a simple enough task, but after events take an unexpected twist, Liana finds herself taking a treacherous dive into the darkest depths of the Tower... and the decades' old secrets buried within.In a society where free thinking can make you a criminal, one girl dares to try...An unforgettable tale brimming with suspense, mystery and romance - The Girl Who Dared to Think will thrill fans of \nThe Gender Game\n, Divergent & The Hunger Games.",
  "genres": [
    "Dystopia",
    "Science Fiction",
    "Young Adult",
    "Fantasy",
    "Fiction",
    "Romance",
    "New Adult"
  ],
  "author": "Bella Forrest",
  "average_rating": "4.23",
  "url": "https://www.goodreads.com/book/show/35609598-the-girl-who-dared-to-think"
}