{
  "title": "Love and Venom",
  "description": "Early in her story, Addy Nix admits, “that last good kiss, the last one before I lost myself, before I lost him, still burns on my lips. And now it's happened again. A boy. A kiss. A bite. A monster.” And that's only the beginning of her problems.  Addy is hiding a terrible secret, one she is trying hard to forget. Her best friend Dare is up for anything that might distract her, including using fake IDs to sneak into a bar. But when a violent assault triggers supernatural powers within Addy, everything changes for them. It turns out that the world has dark secrets of its own, and the girls have to uncover them before things, ancient and violent things, really get out of hand. \"Love and Venom,\" a YA urban fantasy novel, follows Addy, a seventeen-year-old girl living on North Carolina's Outer Banks, as she struggles to deal with her new-found powers, mythical creatures that want to kill her, and mysteries from her family's past. Those mysteries force Addy and her teenage friends into a dangerous journey filled with magic and monsters. Along the way, they meet Sparrow, a guy who is more dangerous than he first appears, and face intense feelings that they didn't know they had for each other. Complete with creatures from Celtic mythology, emotionally complex relationships, and family drama that is literally out of Greek tragedy, this novel is a modern odyssey that ends in a battle filled with lost lives, revealed secrets, and an unexpected new love.  If you rooted for \"The Hunger Game\"'s Katniss Everdeen to survive in her violent world or you hoped the \"Raven Cycle\"'s Blue Sargent would end up with the right Raven Boy, then you should give \"Love and Venom\" a read. If your heroes have more in common with \"Throne of Glass\"'s Celaena and \"Ms. Marvel\"'s Kamala Khan than any Disney princess, then Addy Nix is your girl.",
  "genres": [],
  "author": "W.P. Bossing",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/35614310-love-and-venom"
}