{
  "title": "Holy Dying",
  "description": "I am treating your Lordship as a Roman gentleman did St. Augustine and his mother: I shall entertain you in a charnel-house, and carry your meditations awhile into the chambers of death, where you shall find the rooms dressed up with melancholic arts, and fit to converse with your most retired thoughts, which begin with a sigh, and proceed in deep consideration, and end in a holy resolution. The sight that St. Augustine most noted in that house of sorrow, was the body of Caesar, clothed with all the dishonours of corruption that you can suppose in a six months' burial. But I know, that, without pointing, your first thoughts will remember the change of a greater beauty, which is now dressing for the brightest immortality, and from herbed of darkness calls to you to dress your soul for that change which shall mingle your bones with that beloved dust, and carry your soul to the same quire, where you may both sit and sing for ever. My Lord, it is your dear Lady's anniversary, and she deserved the biggest honour, and the longest memory, and the fairest monument, and the most solemn mourning: and in order to it, give me leave, my Lord, to cover her hearse with these following sheets. This book was intended first to minister to her piety; and she desired all good people should partake of the advantages which are here recorded; she knew how to live rarely well, and she desired to know how to die; and God taught her by an experiment. But since her work is done, and God supplied her with provisions of his own, before I could minister to her, and perfect what she desired, it is necessary to present to your Lordship those bundles of cypress which were intended to dress her closet, but come now to dress her hearse. My Lord, both your Lordship, and myself have lately seen and felt such sorrows of death, and such sad departure of dearest friends, that it is more than high time we should thing ourselves nearly concerned in the accidents. Death hath come so near to you, as to fetch a portion from your very heart; and now you cannot choose but dig your own grave, and place your coffin in your eye, when the angel hath dressed your scene of sorrow and mediation with so particular and so near an object: and, therefore, as it is my duty, I am come to minister to your pious thoughts, and to direct your sorrows, that they may turn into virtues and advantages.",
  "genres": [],
  "author": "Jeremy   Taylor",
  "average_rating": "3.00",
  "url": "https://www.goodreads.com/book/show/10221203-holy-dying"
}