{
  "title": "Animaia",
  "description": "ANIMAIA - (Book 1)In the exotic country of ANIMAIA, Arno Steele and his school friends battle to save their animal-friendly world from those determined to destroy it. Jungles, beaches, wild animals, dinosaurs, and a very mysterious school with equally odd teachers come together in this young adult fantasy of 101,000 words. Mild sci-fi and paranormal elements, and some challenging themes. Suitable for 12 years to adult. Book one in a series. The story is complete and stands alone.Arno Steele can talk to animals – and he’s very, very good – as his dad discovers when Arno is four. A young Arno is infatuated with the legend of the Truemore, an historical saviour who will one day return to protect his mystical and animal-friendly world, Animaia (anim-eye-a), from destruction. The modern country of Animaia arose from The Great Animal War of Liberation over 100 years ago and remains under constant threat of returning to the “old ways.” An elite few have inherited an ancient ability to talk to animals telepathically and they are called “Anima.” The Anima are trained as the protectors and administrators of human-animal integration in the society.At thirteen, Arno is to be packed off to an elite school for young Anima. As events unfold, a reluctant Arno is perceived by some as the new saviour. Too bad: Arno would rather stay at home and hang out at the beach with his school friends, Leroy, Ashley and Charlotte, and his lifelong buddy Arkie the crow. What’s a boy with such exceptional ability and a possible foretold destiny to do?But now dark forces are gathering once more, and they are organised like never before under the influence of a leader who believes it is his divine destiny to destroy the free-living Animaian state and create a realm of unbridled exploitation and destruction. Animaia fears \"the return of the fleshers.\"Arno is under personal threat, and he and his friends find themselves at the centre of this threatening storm at their Anima school, wondering if they can unleash the mystical Truemore -- the human form of the spirit of life itself -- to help in the battle for their homeland, or if the Truemore is nothing more than legend and folk lore.Ultimately, Arno must face the leader of the fleshers when a school camp in the jungle goes wrong and he finds himself fighting for his life.",
  "genres": [],
  "author": "Lee   Rogers",
  "average_rating": "3.92",
  "url": "https://www.goodreads.com/book/show/12145367-animaia"
}