{
  "title": "Whine with Cheese:",
  "description": "Swirl a hot mess, a savvy vintner, and a meathead ex into a chaotic adventure and indulge in a taste of humor when a sensual journey of self-discovery collides with true love.Maxine \"Max\" Novaline just had her heart ripped out by her ex-boyfriend, Bart Moore. Determined to bounce back, she's ready to do some serious damage control on her shattered self-esteem thanks to that narcissistic meathead.Max heads to Napa Valley's Angel of the Vine Winery, maker of her favorite Moscato, to scout out tours for work and--let's be honest--catch a glimpse of the owner's drool-worthy son, Chase L'Angevin, as seen on YouTube.Nothing says movin' on like some sweet wine and eye candy. Right?Chase, who likes the pin-up girl type, starts to pour on the charm the moment he meets this demure beauty. She even blushes over every compliment he gives her like she's been deprived of them.Lavish the bubbly blonde with all the attention she deserves? Of course.When their first date rolls into a long, romantic weekend, their chemistry ignites faster than a matchstick in hell.But, when Max's fears of rushing into another relationship start to haunt her, and Chase becomes all too eager to keep trying to sweep her off her feet, they both find themselves tumbling down a rabbit hole of an adventure in pursuit of what true love is all about.WHINE WITH CHEESE is about a young woman discovering her full potential while falling in love one sweet wine tasting at a time.\"Wanted to read this book just from the title alone and the author did not let me down. But rose and soared with this book!\" (Wine and Late Night Mommy Reads Blog, Net Galley review)\"I love this book! I couldn't put it down and read it in one sitting. I would recommend to my friends.\" (Renee, blogger, Net Galley review)\"If you enjoy RomComs, you will love Whine with Cheese. It is fun and flirty--with a side of snark. When Maxine dumps her cheating boyfriend, she goes on an entertaining journey to find herself--and love.\" (Robin Woods, author of The Watcher Series and Prompt Me Workbooks)\"Love rom coms? Me too and this one is a hoot! ... Perfect for fans of Bridget Jones!\" (N. N. Light's Book Heaven, Goodreads, nnlightsbookheaven.com)***This novel is a passionate CONTEMPORARY ROMANCE - ROMANTIC COMEDY full of twists and turns that will have you laughing out loud from start to finish. Grab a glass of Moscato, kick up your stilettos, and enjoy the ride.***Whine with Cheese (Vineyard Pleasures Series, #1)Love the Wine You're With (Vineyard Pleasures Series, #2)Wine Not? (Vineyard Pleasures Series, #3, Coming Soon!)Brooke E. WayneRomance with a KISS of Humor",
  "genres": [
    "Romance",
    "Romantic Comedy"
  ],
  "author": "Brooke E. Wayne",
  "average_rating": "4.68",
  "url": "https://www.goodreads.com/book/show/35633034-whine-with-cheese"
}