{
  "title": "Rogue Desire",
  "description": "When all else fails, find love.Eight brand new romances for fans of the West Wing, fired-up #resistance fighters, and everyone who ever had a crush on that guy at a protest...GRASSROOTSby Adriana AndersVeronica Cruz is in the fight of her life for a seat on the city council. Meeting reclusive finance genius Zach Hubler should be a stroke of good luck—he has the power to sway public opinion. But when Election Day comes around and things don’t go as expected, Veronica has to know: just how shady is the man of her dreams?DEEP THROATby Dakota GrayHe's an escort, but that's not his biggest secret. She’s a maid at the hotel he uses “for business.” When their worlds collide, everything is put on the line. But indulging every secret desire comes at a cost, and the sins of the past won't be forgotten.RESISTANCEby Amy Jo CousinsAll Kaz Shamsi wanted to do was get his college students to and from the DC protest without losing any of them. Getting caught up in the fringes of anarchist violence was not on the agenda. Neither was a motorcycle escape, messing around with a bandanna-masked antifa protestor, or figuring out that guy was one of the students he was supposed to be chaperoning. Now he's got a ten-hour bus ride back to campus ahead of him, with a stupidly cute student who makes terrible decisions trying to talk Kaz into making one more.KISSING AND OTHER FORMS OF SEDITIONby Emma BarryWhen a global crisis threatens to go nuclear, the world tips upside down and spills out Graham Wilcox’s unspoken feelings for Cadence Martel. Cadence is equal parts shocked and delighted by his confession, but one night of passion isn’t enough. So the new lovers set out on a road trip to save the world.TRUTH, LOVE AND SUSHIby Stacey AgdernWhen First Daughter Caroline Crosby finds herself in possession of the one document that can bring her father and his administration down, she turns to a real life social justice warrior for help. Max Wilcox isn't sure what to make of Caroline: is this an elaborate hookup or a political conspiracy? But he has to make up his mind fast because the information and their chemistry could change the world—or break their hearts.MY DELIGHT IS IN HERby Jane Lee BlairWhen Leonard West chose the pastorate, his college girlfriend chose a life without him. But not wanting to be a pastor’s wife didn’t mean Kim Jones didn't want to work for the greater good. Now, her resistance work has led her back to Leonard, and they must grapple with their old pain. Can they trust God and each other enough to try again?PERSONAL DISASTERby Ainsley BoothMarcus Dane left the tech world and joined the National Park Service a decade ago. Now an intrepid reporter has tracked down the park ranger-who-could-have-been-a-billionaire and, even worse, she has a theory that could blow his quiet life to smithereens. He needs to send her packing. But he’s already tumbled head-over-heels in insta-lust with her flippy ponytail and smart mouth, and he just can't seem to let her go.LIFE, LIBERTY AND WORSHIPby Tamsen ParkerPaige Robinson has been working out her angst about the new administration in spin class, until a handsome stranger with maddening politics harshes her mellow. Now she’s determined to get even…in the bedroom. Always awkward Carter Cox is shocked when his crush propositions him, but there's no way he's turning her down. Will their filthy assignation provide the catharsis Paige has in mind, or can they truly cross the aisle to find more?",
  "genres": [
    "Anthologies",
    "Romance",
    "Contemporary",
    "Contemporary Romance",
    "Fiction",
    "Short Stories",
    "M M Romance"
  ],
  "author": "Adriana Anders",
  "average_rating": "3.77",
  "url": "https://www.goodreads.com/book/show/35654211-rogue-desire"
}