{
  "title": "The City of Joy",
  "description": "The story revolves around the trials and tribulations of a young French priest, Father Paul Lambert, the hardships endured by a rickshaw puller, Hasari Pal in Calcutta, India, and in the second half of the book, also the experiences of a young American doctor, Max Loeb.Father Stephan joins a religious order whose vows put them in the most hellish places on earth. He chooses not only to serve the poorest of the poor in Calcutta but also to live with them; starve with them; and, if God wills it, die with them. In the journey of Kovalski's acceptance as the Big Brother for the slum dwellers, he encounters moments of everyday miracles in the midst of appalling poverty and ignorance. The slum dwellers are ignored and exploited by wider society and the authorities of power but are not without their own prejudices. That becomes evident by their attitude towards the lepers and the continuation of the caste system.The story also explores how the peasant farmer Hasari Pal arrives in Calcutta with his family after a drought wipes out the farming village where his family has lived for generations.The third main character is a rich American doctor, who has just finished medical school and wants to do something with purpose before opening up his practice catering to the wealthy.The book chronicles not only the separation of the wealthy from the poor but also the separation of the different levels of poverty, caste divisions, and the differences of the many religions living side by side in the slums. It touches on Mother Teresa and her Missionaries of Charity as well. While the book has its ups and downs, both beautiful and horrific, an overall feeling of peace and well being is achieved by the story's end. Despite facing hunger, deplorable living conditions, illness, bone-breaking work (or no work at all) and death, the people still hold on to the belief that life is precious and worth living, so much that they have named their slum Anand Nagar, which means \"City of Joy\".[From Wikipedia]",
  "genres": [
    "India",
    "Fiction",
    "Historical Fiction",
    "Novels",
    "Travel",
    "Asia",
    "France"
  ],
  "author": "Dominique Lapierre",
  "average_rating": "4.26",
  "url": "https://www.goodreads.com/book/show/356525.The_City_of_Joy"
}