{
  "title": "The Elephant Chaser's Daughter",
  "description": "Saved by her grandmother from being killed at birth for having been born a female, Shilpa’s life took many unexpected turns and twists through her early years. She faced abandonment by her mother, the formidable constraints placed on her by her family, and the barbs of village elders bound by hundreds of years of oppressive practices and customs that subjugate women. Shilpa is torn between the contrasting lives she leads: one of servitude and injustice experienced by her family; the other of opportunity and empowerment offered by a good education in a school started by a philanthropist.Just when all seems settled, an unforeseen death under mysterious circumstances shatters whatever stability remains in her life. Pulled in opposite directions, and torn between despair and dreams, Shilpa finally makes a choice for her future. Is she strong enough to stand up to the people she loves, and pursue what she wants?At its heart The Elephant Chaser’s Daughter is about hope, when all seems lost. Written with raw honesty and grit, this is a deeply moving memoir of a young girl confronting her ‘untouchable’ status in a caste-based society, and her aspirations for modernity.Reviews so far: Kirkus Review: Shilpa was given the chance to transcend her family history and perhaps her own karma. A deft portrayal of a young woman’s growth and courageous transformation through education.Sir Ken Robinson:Shilpa Raj is a powerful new voice for human dignity and opportunity and against the appalling and demeaning mistreatment of women worldwide. An important and deeply affecting book narrated in a moving and intimate style.Sir Ken Robinson, Author and EducatorSri Vishwanath:The Elephant Chaser’s Daughter unveils the secret of transcendence. Shilpa Raj is the future voice for the poor and deprived, uncovering the diamond in the rubble. Read her.well-known authorVanessa Roth:Shilpa’s story speaks for millions of families in a way that is immediate, intimate and personal. Her book will have a powerful impact on the lives and minds of young people around the world.film director, and winner of Academy AwardMadhu Trehan:Shilpa’s searing, penetrating honesty in the account of her life will change perspectives and impact every reader. It gives hope to the under-privileged and sensitizes the privileged.Editor-in-Chief, Newslaundry.com",
  "genres": [
    "Nonfiction",
    "Memoir",
    "India",
    "Autobiography",
    "Biography",
    "Biography Memoir",
    "Feminism"
  ],
  "author": "Shilpa Raj",
  "average_rating": "4.38",
  "url": "https://www.goodreads.com/book/show/35661389-the-elephant-chaser-s-daughter"
}