{
  "title": "Dark Beauty",
  "description": "For fifteen-year-old Seeker, Isabelle Crowe, ridding the Houston streets of the undead is an inherited duty, passed down from her Cherokee ancestors. During her first night without her mentor, she encounters Abram, a more experienced Seeker from Chicago looking to avenge his cousin's death. Isabelle quickly learns she must work with Abram to protect her city. With one Seeker already dead, Isabelle's love of the hunt becomes a fight to survive.Prequel to Dark Seeker novel.Praise for DARK BEAUTY...\"YA fans of fresh, edgy urban fantasy are going to love Dark Beauty. Taryn Browning is a rising star. This is one author you'll want to keep your eye on as she shoots straight to the top of the charts!\" —Kari Lee Townsend, National Best Selling author of The Samantha Granger Experiment & The Fortune Teller Mysteries“Get ready for a new breed of vampire slayers! Browning has created an intriguing world that promises many interesting surprises to come. A terrific start to a new urban fantasy.” —Artist Arthur, author of The Mystyx Novels \"Taryn Browning is a master writer. DARK BEAUTY is thrilling and beautiful, and follows only one trend: good story-telling.\" —Brent Taylor, The Naughty Book Kitties Blogspot\"Once I started Dark Beauty, I couldn’t stop. From the nonstop action to the well thought out mythology, I found something exciting and new with every page. If Dark Beauty is any indication of what’s to come, I have no doubt that Browning will soon be one of my favorite authors.\" —Alex Bennett, Electrifying Reviews“Fans of Cassandra Clare and Stephenie Meyer are going to love this prequel to Taryn Browning's DARK SEEKER novel!\" —Michelle Madow, author of Remembrance",
  "genres": [
    "Young Adult",
    "Vampires",
    "Paranormal",
    "Paranormal Romance",
    "Short Stories",
    "Romance"
  ],
  "author": "Taryn Browning",
  "average_rating": "3.77",
  "url": "https://www.goodreads.com/book/show/12145740-dark-beauty"
}