{
  "title": "Rogue Affair",
  "description": "When all else fails, find passion...Ten all-new resistance romances for readers who take their happily ever afters with love, hate, and all the dirty bits in between.Dedication of a Lifetime by Tamsen ParkerSchool counselor Sean wants to fix the world. No social justice slouch himself, Sean's chemist husband Isaiah is exhausted. Their world crumbling, their marriage in trouble, Isaiah suggests they run away, but Sean balks. Will they honor their vows or will their relationship be a casualty of the country gone mad?Personal Proposal by Ainsley BoothBrianne can't afford a crush on her boss. Thanks to a storm of media attention, she's fled her old life and needs to please the demanding Astrid. So she ignores the zing every time they touch, and the ache inside as she tumbles into a lonely bed. But as their work gets harder, and their days longer, boundaries crumble and Astrid puts forth an unexpected proposal.Work of Heart by Olivia DadeArtist Jenny Meyers may need money, but when a politician tries to pay for his portrait with charity funds, she balks...and contacts David Redi, the most trusted investigative reporter around. David knows a romance with his source would wreck his credibility, but Jenny is one lead he can't refuse to follow. Soon it's not only truth, justice, and liberty at stake--it's love.The President's Protector by Kris RipperMiriam West is a good president--though she'd say she's never good enough. Ram Ruiz is a Secret Service agent who garners some side-eye because he's trans, but in this administration, that doesn't stop him from being part of the president's protective detail. She's the president. He's her bodyguard. Nothing can happen between them. Until it does.Fallacies and Flirtations by Amy Jo CousinsShe's an ex-chain mail bikini-wearing actress-turned-mayor of a major city, and I'm a speechwriter still paying off student loans. She's my boss, nothing can happen. But somehow it's always Anna and me in the office at 2 a.m., and I'm starting to think I'm not imagining the heat between us...The Fourth Estate by Emma BarryReporter Drew Orlov wants to write about the corrupt president, but readers only care about the bombshells penned by his rival Brynn Allen. But when he goes after Brynn's source, he finds himself snagged on more complicated feelings. Brynn doesn't have time for Drew, even if he's sexy when he smolders, and they're soon tussling over the truth with their hearts on the line.Such Great Heights by Adriana AndersReporter O'Neal Jones is a sucker for a good story. Which is why she can't resist following high school crush Kurt Anderson on his trip up a North Cascades peak. But when it's time to come down, she's not sure she can go back to real life. Could one night with a man on a mountain change everything?Dissent and Desire by Kelly MaherWith her future crumbling, Frankie focuses on one thing she can do: help fight in the war against science. PhD candidate Rafe is unsure about continuing his career with the EPA. Neither expects to see their crush at a meeting, but networking turns into dinner, which turns into more. Hope in the future may be possible after all.Mr. Klein Goes to Albany by Stacey AgdernWhen the Canadian government--via hockey player-turned-diplomat Adam Klein--proposes a work around to the president, legislative aide Tamara Schneider knows she needs to set them straight. She arranges a trip to show Adam the state, tricky business given their history. Can she give Adam a second chance?Take a Knee by Jane Lee BlairAfter police kill her cousin, Rochelle Morris turns to her high-school crush turned NFL player Jack Murphy to bring attention to the cause. Jack just wants to play football, so he refuses. But as Rochelle's passion continues to affect him, he realizes justice and the heart of the woman he loves are worth the struggle.",
  "genres": [
    "Anthologies",
    "Romance",
    "Contemporary",
    "Novella",
    "Contemporary Romance",
    "Short Stories",
    "LGBT"
  ],
  "author": "Tamsen Parker",
  "average_rating": "3.70",
  "url": "https://www.goodreads.com/book/show/35660898-rogue-affair"
}