{
  "title": "How Humans Became Intelligent",
  "description": "How could humans pair bond when our sexual urges are always 'on?' Ever wonder why 30 kids will sit in a chair and obey the teacher all day, the exact opposite of a room full of monkeys? If early man hunted big game on the plains for four million years, why do we get gout if we eat too much red meat? Why do we walk on two legs when even squirrels can run faster than us? Why did we choose a slower method of locomotion than baboons–or heck, every ape, who can outrun us on all fours? Why do we have ear wax that must be rinsed out with water or else it will build up until we’re deaf? Why did our ancestors built burial mounds--it wasn't to send a message to aliens! From the conditions that make genetic change occur in an eyeblink to building houses beginning 12,000 years ago, our path from instinct to intelligence has been an interplay of fortuitous timing and horrible weather. This easy to read, illustrated book connects the dots of archaeological research, genetics and biology to outline the path a small ape took from tree-dwelling in the tropics to advanced education in brick-built colleges in only five million years. What inducement is there for ‘thinking’ to replace instinct, which is merely genetically-memorialized intelligence? Intelligence isn’t an absolute, but is on a continuum from instinct to total discretion based on the survival necessity of pondering the options. This book shows the conditions under which instinct fails, causing thought, i.e. intelligence, to bloom. Not just in humans, but in every species. Which makes it an absolute, proving how intelligent life could occur on any planet and any life form, under specific, albeit awful, circumstances. How did humans become intelligent? The answer lies in the nose on your face.",
  "genres": [
    "Nonfiction"
  ],
  "author": "Lynnette Hartwig",
  "average_rating": "3.94",
  "url": "https://www.goodreads.com/book/show/35668494-how-humans-became-intelligent"
}