{
  "title": "The Raven Boys, The Dream Thieves, Blue Lily Lily Blue, The Raven King",
  "description": "The Raven Cycle Series Maggie Stiefvater Collection 4 Books Set With Gift Journal includes titles in this collection :- The Raven Boys, The Dream Thieves, Blue Lily, Lily Blue, The Raven King. Description:- The Raven King The fourth and final instalment in the spellbinding series from bestselling author Maggie Stiefvater. All her life, Blue has been warned that she will cause her true love's death. She doesn't believe in true love and never thought this would be a problem, but as her life becomes caught up in the strange and sinister world of the Raven Boys, she's not so sure any more. Blue Lily, Lily Blue The third book in the mesmerizing series from bestselling author, Maggie Stiefvater. Fans of the SHIVER trilogy will love this new quartet! The Dream Thieves Now that the ley lines around Cabeswater have been woken, nothing for Blue and Gansey will be the same. Ronan is falling more and more deeply into his dreams ... and his dreams are intruding more and more into waking life. Gansey is needed at home, and is struggling to stay in Aglionby. The Raven Boys Blue has spent the majority of her sixteen years being told that if she kisses her true love, he will die. When Blue meets Gansey's spirit on the corpse road she knows there is only one reason why - either he is her true love or she has killed him. Determined to find out the truth, Blue becomes involved with the Raven Boys, four boys from the local private school (lead by Gansey) who are on a quest to discover Glendower - a lost ancient Welsh King who is buried somewhere along the Virginia ley line.",
  "genres": [
    "Fantasy",
    "Young Adult",
    "Fiction",
    "Romance",
    "Magical Realism",
    "Audiobook",
    "Queer"
  ],
  "author": "Maggie Stiefvater",
  "average_rating": "4.57",
  "url": "https://www.goodreads.com/book/show/35669466-the-raven-boys-the-dream-thieves-blue-lily-lily-blue-the-raven-king"
}