{
  "title": "Long and Winding Roads: The Evolving Artistry of the Beatles",
  "description": "In Long and Winding Roads: The Evolving Artistry of the Beatles, Kenneth Womack brings the band's story vividly to life—from their salad days as a Liverpool Skiffle group and their apprenticeship in the nightclubs and mean streets of Hamburg through their early triumphs at the legendary Cavern Club and the massive onslaught of Beatlemania itself. By mapping the group's development as an artistic fusion, Womack traces the Beatles' creative arc from their first, primitive recordings through Abbey Road and the twilight of their career.In order to communicate the nature and power of the band's remarkable achievement, Womack examines the Beatles' body of work as an evolving art object. He investigates the origins and creation of the group's compositions, as well as the songwriting and recording practices that brought them to fruition. Womack's analysis of the Beatles' albums transports readers on a journey through the Beatles' heyday as recording artists between 1962 and 1969, when the band enjoyed a staggering musical and lyrical leap that took them from their first album Please Please Me, which they recorded in the space of a single day, to Sgt. Pepper's Lonely Hearts Club Band, the White Album, and Abbey Road—albums that collectively required literally thousands of hours to produce. In addition to considering the band's increasing self-consciousness about the overall production, design, and presentation of their art, Womack explores the Beatles' albums as a collection of musical and lyrical impressions that finds them working towards a sense of aesthetic unity. In Long and Winding Roads, Womack reveals the ways in which the Beatles gave life to a musical synthesis that would change the world.",
  "genres": [
    "Music",
    "Nonfiction"
  ],
  "author": "Kenneth Womack",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/35686.Long_and_Winding_Roads"
}