{
  "title": "Fallout",
  "description": "Devastated at being reprimanded for a midair collision, TOPGUN instructor Luke Henry quits the Navy to start a private aerial combat school in the Nevada desert, where he and a number of his buddies, all former TOPGUN fliers -- part of the Old Bro network -- train fighter pilots for the U.S. government. Prior to leaving the Navy, Luke discovers that the United States has purchased twenty MiG-29s -- Russia's front-line fighter -- from Moldova, of the former Soviet Union. These are the very planes he wants to use for his own school, flying the Russian MiGs from an abandoned Air Force base.But Luke's lucrative contract with the U.S. government comes with a caveat: among his students are a group of Pakistani Air Force pilots -- handpicked by the Department of Defense -- whom he must instruct. Luke is hesitant to train fighters from another country in the skills he learned at TOPGUN, but he won't be allowed to start the school without agreeing. The school opens, but the closer he gets to these students, the more he suspects that they may have an entirely different, and malicious, agenda in mind. They have a bone to pick with the United States and may be using Luke's school as their Trojan Horse to get into the country and launch an attack that would cause more damage than that sustained at Pearl Harbor. It falls to Luke to discover their plan and to stop it before it spirals out of control.With Fallout James W. Huston scores big with his most riveting and thought-provoking thriller yet. Filled with exciting twists and turns and characters whose motivations will keep readers guessing until the startling conclusion, Fallout is a story of domestic terrorism that is as realistic as it is terrifying.",
  "genres": [
    "Thriller",
    "Fiction",
    "Military Fiction",
    "Audiobook",
    "Action",
    "Politics"
  ],
  "author": "James W. Huston",
  "average_rating": "3.80",
  "url": "https://www.goodreads.com/book/show/1214696.Fallout"
}