{
  "title": "Power Down & Parent Up: Cyber Bullying, Screen Dependence & Raising Tech-Healthy Children",
  "description": "In this decade, our digital world has grown exponentially as has the degree of time both adults and children are spending on their screens. Not surprisingly, researchers are discovering a myriad of unhealthy behaviors associated with excessive screen time. In \"Power Down & Parent Up,\" Kenley expands on her groundbreaking book Cyber Bullying No More, giving parents/guardians effective strategies to integrate into their lives and their children's. How can we navigate a tech-driven world and raise tech-healthy children?Tackle cyber bullying head-on by implementing a concise \"Parent Up\" approach with proven strategies for Protection, Intervention, and Prevention.\"Power Down\" on screen dependence and become fully informed about its growing health concerns and consequences.Learn Seven Proactive Practices such as goal setting and creating a family plan to reduce screen time.Discover Four Healthy Guidelines to our parenting toolbox such as learning how to communicate about the false nature of cyber worth and cultivate our children's real worth.\"Rather imply that families can return to some idealistic less complicated time without Facebook, sexting, social networks, and Twitter, and whatever else comes along, Kenley's booklet will help parents mitigate possible harm to their children as they integrate this technology hopefully into healthy lives and relationships.\"--Ronald Mah, M.A. LMFT, author of Difficult Behavior in Early Childhood and The One Minute Temper Tantrum Solution\"Holli addresses children's readiness for technology as well as rules, contracts and education for parents to consider for their children as they introduce or allow entry of new technology into their lives. Cyber bullying and victimization are concerns addressed as well as internet resources for parents, with tools for protection, interventions and prevention--a must for parents in our technological world.\"--Lani Stoner, Marriage and Family TherapistLearn more at www.HolliKenley.com",
  "genres": [
    "Parenting"
  ],
  "author": "Holli Kenley",
  "average_rating": "4.40",
  "url": "https://www.goodreads.com/book/show/35699026-power-down-parent-up"
}