{
  "title": "Flash Point",
  "description": "With the same daredevil flying action found in Top Gun and the riveting nonstop storytelling that has established James W. Huston's reputation, here is an explosive novel that takes us from the cockpits of carrier-based naval fighters to the inside of the CIA and the Mossad, as one man's determination to avenge a wrongful death has the potential to ignite an international war of deceit, murder, and retaliation.Sean Woods and Tony Vialli are F-14 pilots stationed aboard the USS George Washington in the Mediterranean.During a port call in Naples, Vialli falls for a beautiful woman he meets on a train who tells him she's Italian. She finally reveals she isn't Italian at all, and lures him out of the country to visit her. Vialli submits false leave papers, swears Woods to secrecy, and flies off to see her. His lover's trip becomes a nightmare when Vialli and the woman are brutally attacked in what appears to be a terrorist action. Enraged over his friend's vicious assault and furious at the lack of American response, Woods thinks the United States should retaliate against the man claiming responsibility, who says he is part of a secret society of Assassins founded in the eleventh century. Woods wants his country to declare war against this man personally, but his congressman pays no attention. A group of Israeli Air Force pilots offer Woods the chance to exact his own revenge by flying a section of F-14s with the Israelis, without the U.S. Navy's knowledge. Woods's flight turns into one of the biggest air battles since World War II. He must fight for his life, then fight to keep what he has done secret from the Navy and the rest of the world-all because of a woman whose identity and motives continue to elude him.James W. Huston has crafted a spellbinding tale worthy of the best of Robert Ludlum and Tom Clancy. His crisp, energetic writing keeps the reader enthralled throughout this multilayered story of military action, personal courage. international intrigue, and true-life events. Having set his own standard with Balance of Power and The Price of Power, he raises it to an entirely new level with Flash Point.",
  "genres": [
    "Fiction",
    "Thriller",
    "Military Fiction",
    "Mystery"
  ],
  "author": "James W. Huston",
  "average_rating": "3.77",
  "url": "https://www.goodreads.com/book/show/1214694.Flash_Point"
}