{
  "title": "Shin Buddhism: An Introduction",
  "description": "Buddhism in Japan was largely a religion of the aristocracy and the ruling Samurai class until Shin Buddhism was introduced to the masses by a priest named Shinran in the early thirteenth century. This form of Buddhism, also known as Jodo Shinshu, eliminates the mysticism and secrecy sometimes found in Zen and other forms of Buddhism, and focuses on the true essence of Buddha’s original teachings.An ordained Shin Buddhist head priest who taught for four decades shares his faith in Shin Buddhism: An Introduction, hoping to reach new generations of Shin Buddhists in North America and around the world. Even as they are alienated by Buddhism and what they perceive as its traditional approach, they seek answers about the universe and their place in it.Using a comparative approach, Takafumi (Taka) Hirose describes concepts such as universality, salvation, morality and religion, prayer, and the practices of Shin Buddhism. Selections from the Christian Bible, especially the Gospels, showcase the book’s theme of universality, and stories and analogies put Hirose’s teaching into context. Discussion-style summaries after chapters provide an even clearer review of Shin Buddhism’s concepts and lessons.“Experienced both as a teacher and priest, gifted with outstanding skills as a communicator and, meanwhile, faithful to the heritage of Shin Buddhism’s founder Shinran, Professor Hirose draws the reader to a vision of what is universal, as opposed to instrumental and local, in Buddhism. . . . A work with a universal appeal and relevance, appearing precisely at a time when its message needs to be heard.” —David Keen, former senior lecturer in social studies, Dunedin College of EducationTAKAFUMI HIROSE — AUTHOR Born in 1948 as the son of a Shin Buddhist priest in a small village in central Japan, Takafumi (Taka) Hirose entered the priesthood when he was nine. He attended high school in Williston, North Dakota, majored in political science at the University of North Dakota, and earned a graduate degree from Kent State University. He returned to Japan, teaching at Gifu Shotoku Gakuen University for forty years, and now serves as a professor emeritus. He was ordained as a Shin Buddhist teacher in 1985 and is the eleventh head priest of Shinkyo-ji (temple).Although he lived in the United States not long after World War II, Taka experienced many instances of friendship and faith, attending a Lutheran church with a host family in North Dakota and joining a folk-singing group based at Christus Rex Lutheran Campus Center. While at Gifu Shotoku Gakuen University, he helped establish a new faculty of foreign languages and set up a partnership with Lakehead University in Canada.",
  "genres": [],
  "author": "Takafumi Hirose",
  "average_rating": "3.80",
  "url": "https://www.goodreads.com/book/show/35691250-shin-buddhism"
}