{
  "title": "Defiance",
  "description": "All I ever wanted was to serve and protect my country. It ended up costing me everything...At 49, Vincent St. James has learned to live with the choices he's made, even if he isn't always proud of them. After the military he was practically born into decided his sexuality was more important than his impeccable service record, Vincent lost everything, including the man he'd planned to spend the rest of his life with.And a man with nothing to live for has nothing to lose.With a bone deep hatred of all things government, Vincent found another way to serve his country, but it too came at a steep cost that he never could have foreseen. Dealing in secrets and death means there's always someone waiting around the next corner trying to either take his place or bury their secrets along with his body. Even if he wanted out, it's far too late for that.When he's given the chance to help out a friend who once had his back when others didn't, he jumps at the chance to repay the favor. Even if it means protecting the kind of man he despises most...a power-hungry politician looking to push his own agenda on an unsuspecting public.I made a terrible choice three years ago and it cost me the only person who ever really mattered to me. But maybe there's another way I can make things right...30-year-old Nathan Wilder can't take back the moment he betrayed his twin brother, but he can try to make sure that the legacy of hate that drove him to turn on Brody never has a chance to rear its ugly head again. And if that means going against his powerful father's right-wing political constituency in a down and dirty race for a seat in the U.S. Senate, then so be it. But when the threats that had been limited to harmless emails start taking an uglier turn, culminating in a violent attack that leaves no doubt as to the assailant's intent, Nathan is thrown into the direct path of a mysterious and dangerous man who may end up forcing Nathan to confront truths he just isn't ready to face yet.Protecting him was supposed to be a favor for a friend and nothing more. Once he's safe, I'll let him go. I have to...Protecting Nathan was supposed to be a walk in the park for a guy like Vincent. But nothing about the younger man is what he'd been expecting, especially the long-dead feelings Nathan stirs in him.The feelings that aren't just about protection.Which is a problem, because while the threat against Nathan is temporary, the danger that's become a way of life for Vincent is just waiting for the next thing it can take from him. Caring about someone means painting a target on their back and Vincent is done losing people he loves.But letting Nathan go may not be as easy at seems...especially when Nathan decides to finally stand up and fight for what...and who he truly wants.Can be read as a standalone novel.The Protectors series crosses over with some of my other series, so for the most enjoyment, they should be read in order, but it is not required. You can find the correct reading order at the beginning of each book. I've also bundled all my series in the correct reading order under the title of A Family Chosen: The Protectors and Barrettis.",
  "genres": [
    "M M Romance",
    "Romance",
    "Contemporary",
    "Military Fiction",
    "Gay",
    "LGBT",
    "Enemies To Lovers"
  ],
  "author": "Sloane Kennedy",
  "average_rating": "4.42",
  "url": "https://www.goodreads.com/book/show/35697873-defiance"
}