{
  "title": "Veggie Planet: Uncover the Vegan Treasures Hiding in Your Favorite World Cuisines",
  "description": "Struggling to find vegan options when traveling or eating out? Struggle no more! Discover the many plant-based dishes that are hiding in plain sight in the world’s best-loved cuisines.  Intrepid globetrotter and vegan travel expert Wendy Werneth has explored 100 countries on 7 continents, sampling countless local specialties along the way.  In her new vegan food guide, Veggie Planet, she highlights the many naturally vegan dishes in 11 of the world's most famous cuisines and shows you just how vegan-friendly they really are.  But Veggie Planet is more than just an international travel guide for people interested in the vegan lifestyle. Since the cuisines it describes are widely available (think Chinese, Italian, Indian, etc.), Veggie Planet is a godsend not only for when you’re traveling but also for when you want to enjoy a delicious vegan meal while eating out, even in your own hometown.  Whether you’re a flexitarian, a beginner vegan, or a seasoned veteran with dozens of vegan books lining your shelves already, you are sure to discover new dishes, cuisines and cultures within the pages of Veggie Planet.  #1Book10Lives  By purchasing this book, you will spare 10 animals from a life of misery in industrial agriculture.  How? A portion of the proceeds from every book sold will be donated to The Humane League - an organization that works relentlessly to reduce animal suffering through grassroots education to change eating habits and corporate campaigns to reform farm animal treatment.  According to estimates published by Animal Charity Evaluators, the amount donated for each book sold is enough to spare the lives of 10 animals.  When you pre-order Veggie Planet before July 21st, 2017, you will also gain exclusive access to special bonus materials, including:  • Bonus chapter showcasing a twelfth world cuisine not covered in the book • Recipe pack with step-by-step instructions so you can recreate flavors from around the world in your own kitchen • Sneak peek at a chapter of Wendy Werneth's next book, Italy for Veggie Lovers • Exclusive access to a \"Meet the Author\" live online event!  “Scroll up and click the “Buy Now” button to grab your copy today!”",
  "genres": [],
  "author": "Wendy Werneth",
  "average_rating": "4.55",
  "url": "https://www.goodreads.com/book/show/35715176-veggie-planet"
}