{
  "title": "Cave of Bones",
  "description": "Don’t miss the TV series, Dark Winds, based on the Leaphorn, Chee, & Manuelito novels, now on AMC and AMC+!  A New York Times BestsellerAnne Hillerman brings together modern mystery, Navajo traditions, and the evocative landscape of the desert Southwest in this intriguing entry in the Leaphorn, Chee, and Manuelito series.When Tribal Police Officer Bernadette Manuelito arrives to speak at an outdoor character-building program for at-risk teens, she discovers chaos. Annie, a young participant on a solo experience due back hours before, has just returned and is traumatized. Gently questioning the girl, Bernie learns that Annie stumbled upon a human skeleton on her trek. While everyone is relieved that Annie is back, they’re concerned about a beloved instructor who went out into the wilds of the rugged lava wilderness bordering Ramah Navajo Reservation to find the missing girl. The instructor vanished somewhere in the volcanic landscape known as El Malpais. In Navajo lore, the lava caves and tubes are believed to be the solidified blood of a terrible monster killed by superhuman twin warriors.Solving the twin mysteries will expose Bernie to the chilling face of human evil. The instructor’s disappearance mirrors a long-ago search that may be connected to a case in which the legendary Joe Leaphorn played a crucial role. But before Bernie can find the truth, an unexpected blizzard, a suspicious accidental drowning, and the arrival of a new FBI agent complicate the investigation.While Bernie searches for answers in her case, her husband, Sergeant Jim Chee juggles trouble closer to home. A vengeful man he sent to prison for domestic violence is back—and involved with Bernie’s sister Darleen. Their relationship creates a dilemma that puts Chee in uncomfortable emotional territory that challenges him as family man, a police officer, and as a one-time medicine man in training.Anne Hillerman takes us deep into the heart of the deserts, mountains, and forests of New Mexico and once again explores the lore and rituals of Navajo culture in this gripping entry in her atmospheric crime series.",
  "genres": [
    "Mystery",
    "Fiction",
    "Native American",
    "Audiobook",
    "Crime",
    "Westerns",
    "Mystery Thriller"
  ],
  "author": "Anne Hillerman",
  "average_rating": "4.03",
  "url": "https://www.goodreads.com/book/show/35712819-cave-of-bones"
}