{
  "title": "Fugitive by Magic",
  "description": "What happened to Fenris after he fled Solantha? Find out in this epic new trilogy following the events of Scorched by Magic from the Baine Chronicles…  Fenris is no stranger to picking up the pieces of his life and starting over. Three years ago, he was forced to flee his life as Chief Mage of Nebara, and undergo a magical procedure that changed him into a shifter and forever altered the course of his future.  But even though adjusting to life as a shifter was hard, Fenris had friends in Solantha. This time, to save his friends from being caught up in his own troubles, he's fled to Abbsville, a small human town with less than one-thousand people. And not a single ally to rely on.  Or so he thinks.  Not long after he arrives in town, Fenris finds himself entangled with Mina—a beautiful veterinarian with a heart of gold, and secrets lurking behind her gentle smile. Fenris knows he should stay away, but he has never been able to turn away when an innocent is in trouble. And it doesn't take him very long to realize that Mina is in a whole world of it.  If Fenris and Mina want to keep their secrets intact, they are going to have to learn to trust each other. But trust is a hard thing to give, especially when you’ve spent your entire life running…  Don't miss the first book in this epic tale. Scroll up and grab your copy today!  IMPORTANT NOTE: This is a spinoff series following the events of SCORCHED BY MAGIC, Book 7 in the Baine Chronicles series. While you are not required to have read the previous series to enjoy this one, it is highly recommended that you do. Unlike the Baine Chronicles, which is written from Sunaya's POV, this spinoff is written in dual first person POV-- in other words, from the viewpoints of both Fenris and Mina. Sunaya's series contains foul language, violence, and some adult situations, whereas Fenris's story has tamer language but much more romance.",
  "genres": [
    "Fantasy",
    "Romance",
    "Shapeshifters",
    "Urban Fantasy",
    "Magic",
    "Steampunk",
    "Paranormal"
  ],
  "author": "Jasmine Walt",
  "average_rating": "4.39",
  "url": "https://www.goodreads.com/book/show/35707829-fugitive-by-magic"
}