{
  "title": "Oh God! What Have We Done?",
  "description": "Because Parks and Routh are the authors and I don’t think authors should do their own blurbs, I, Claire—whom this book is practically about—will be doing this blurb-y thing. So, ASKEW! I thought it meant something else when my mom said it, like a skewer, with marshmallows and stuff. Or a sneeze blessing…I’m getting off-topic. It’s actually a book. You can imagine my disappointment when s’mores weren’t in my future. Due to my confusion, the authors-after much persuasion and many margaritas-changed the book title to \"Oh GOD! WHAT HAVE WE DONE?\" because that sentiment seems to appear daily in their lives. Or so I'm told. Meet Yvonne, my wonderful mother, and Stephanie, my mom’s awesome childhood friend, who’ve known each other since they were kids—so, for about a trillion years—and have since gone to college, gotten married, done all the adult things like have kids and pay taxes, and now are living grown-up lives. This implies they’ve actually grown up. They have not—and they do weird stuff, like expose infants to bordellos and hide out in office attics. There are some pretty crazy stories here that are certainly entertaining (the best ones are about me) as these two young women in their late 20’s go on their separate misadventures, occasionally meeting up like the Avengers for some big, epic, world-threatening event. (Helloooo, Russell Crowe!) Yvonne is a married attorney in the ‘burbs who quickly finds out that she is expecting. Stephanie, a city planner, enjoys the singles’ life, which is “interrupted” by a handsome stud named Pierce. This is the collection of their separate journeys—from two very different lifestyles, about how positively nuts their respective day-to-day lives can be—captured in keystrokes sent back and forth over the Internet. These two women learn just how crazy planet Earth can be and find a way to roll with the punches. And there are a lot… Of punches. A. LOT ! (You’ll know what I mean.) Enjoy! -Claire (By the way, I thought this book should be titled, “Oh God! What have we done?”)",
  "genres": [],
  "author": "Yvonne Parks",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/35712405-oh-god-what-have-we-done"
}