{
  "title": "An Imaginary Tale: The Story of √-1",
  "description": "Today complex numbers have such widespread practical use--from electrical engineering to aeronautics--that few people would expect the story behind their derivation to be filled with adventure and enigma. In An Imaginary Tale , Paul Nahin tells the 2000-year-old history of one of mathematics' most elusive numbers, the square root of minus one, also known as i . He recreates the baffling mathematical problems that conjured it up, and the colorful characters who tried to solve them. In 1878, when two brothers stole a mathematical papyrus from the ancient Egyptian burial site in the Valley of Kings, they led scholars to the earliest known occurrence of the square root of a negative number. The papyrus offered a specific numerical example of how to calculate the volume of a truncated square pyramid, which implied the need for i . In the first century, the mathematician-engineer Heron of Alexandria encountered I in a separate project, but fudged the arithmetic; medieval mathematicians stumbled upon the concept while grappling with the meaning of negative numbers, but dismissed their square roots as nonsense. By the time of Descartes, a theoretical use for these elusive square roots--now called \"imaginary numbers\"--was suspected, but efforts to solve them led to intense, bitter debates. The notorious i finally won acceptance and was put to use in complex analysis and theoretical physics in Napoleonic times. Addressing readers with both a general and scholarly interest in mathematics, Nahin weaves into this narrative entertaining historical facts and mathematical discussions, including the application of complex numbers and functions to important problems, such as Kepler's laws of planetary motion and ac electrical circuits. This book can be read as an engaging history, almost a biography, of one of the most evasive and pervasive \"numbers\" in all of mathematics.",
  "genres": [
    "Mathematics",
    "Science",
    "Nonfiction",
    "History",
    "Physics",
    "Number",
    "History Of Science"
  ],
  "author": "Paul J. Nahin",
  "average_rating": "3.96",
  "url": "https://www.goodreads.com/book/show/357209.An_Imaginary_Tale"
}