{
  "title": "The Girl You Thought I Was",
  "description": "“A smart and savvy take on coming of age and coming to terms, with a little help from your friends.”—Huntley Fitzpatrick, author of My Life Next DoorNo one looking at Morgan Kemper would think she had a secret—at least not one that she’s deeply ashamed of.To everyone she meets, she comes across as sweet, pretty, and put together. But Morgan knows that looks can be deceiving. For over a year, she’s shoplifted countless pieces of clothing and makeup. Each time, she tells herself it will be the last, and each time, it never is.But when she’s caught and sentenced to thirty hours of community service, the image Morgan has carefully constructed starts to crumble. She’s determined to complete her punishment without her friends discovering the truth about her sticky fingers, but that’s easier said than done...especially once she meets Eli, the charming, handsome nephew of the owner of the charity shop where Morgan is volunteering.Soon Morgan is faced with an impossible continue to conceal the truth or admit that she’s lied to everyone in her life, including the boy she’s falling for.Praise for The Girl You Thought I “A charming and poignant ode to the seasons of friendship, family, and love, and what happens when we dare to reveal our most messy selves. Simply put, The Girl You Thought I Was stole my heart!\" —Darcy Woods, award-winning author of Summer of Supernovas\"The Girl You Thought I Was is an honest, compelling, nuanced look at fallibility, forgiveness, the unhealthy ways we cope, and the people who make us want to be better. If you're a fan of character-driven contemporary, don't miss this one.\" —Dahlia Adler, author of Behind the Scenes and Just Visiting",
  "genres": [
    "Contemporary",
    "Romance",
    "Young Adult",
    "Realistic Fiction",
    "Fiction",
    "Young Adult Romance",
    "Coming Of Age"
  ],
  "author": "Rebecca Phillips",
  "average_rating": "3.75",
  "url": "https://www.goodreads.com/book/show/35720700-the-girl-you-thought-i-was"
}