{
  "title": "John Dee and the Empire of Angels: Enochian Magick and the Occult Roots of the Modern World",
  "description": "John Dee (1527–1608), Queen Elizabeth I's court advisor and astrologer, was the foremost scientific genius of the 16th century. Laying the foundation for modern science, he actively promoted mathematics and astronomy as well as made advances in navigation and optics that helped elevate England to the foremost imperial power in the world. Centuries ahead of his time, his theoretical work included the concept of light speed and prototypes for telescopes and solar panels. Dee, the original \"007\" (his crown-given moniker), even invented the idea of a \"British Empire,\" envisioning fledgling America as the new Atlantis, himself as Merlin, and Elizabeth as Arthur.But, as Jason Louv explains, Dee was suppressed from mainstream history because he spent the second half of his career developing a method for contacting angels. After a brilliant ascent from star student at Cambridge to scientific advisor to the queen, Dee, with he help of a disreputable, criminal psychic named Edward Kelly, devoted ten years to communing with the angels and archangels of God. These spirit communications gave him the keys to Enochian, the language that mankind spoke before the fall from Eden. Piecing together Dee's fragmentary spirit diaries and scrying sessions, the author examines Enochian in precise detail and explains how the angels used Dee and Kelly as agents to establish a New World Order that they hoped would unify all monotheistic religions and eventually dominate the entire globe.Presenting a comprehensive overview of Dee's life and work, Louv examines his scientific achievements, intelligence and spy work, imperial strategizing, and Enochian magick, establishing a psychohistory of John Dee as a singular force and fundamental driver of Western history. Exploring Dee's influence on Sir Francis Bacon, the development of modern science, 17th-century Rosicrucianism, the 19th-century occult revival, and 20th-century occultists such as Jack Parsons, Aleister Crowley, and Anton LaVey, Luov shows how John Dee continues to impact science and the occult to this day.",
  "genres": [
    "History",
    "Occult",
    "Nonfiction",
    "Magick",
    "Biography",
    "Religion",
    "Spirituality"
  ],
  "author": "Jason Louv",
  "average_rating": "4.31",
  "url": "https://www.goodreads.com/book/show/35721518-john-dee-and-the-empire-of-angels"
}