{
  "title": "The Theory and Practice of Hell: The German Concentration Camps and the System Behind Them",
  "description": "By the spring of 1945, the Second World War was drawing to a close in Europe. Allied troops were sweeping through Nazi Germany and discovering the atrocities of SS concentration camps. The first to be reached intact was Buchenwald, in central Germany. American soldiers struggled to make sense of the shocking scenes they witnessed inside. They asked a small group of former inmates to draft a report on the camp. It was led by Eugen Kogon, a German political prisoner who had been an inmate since 1939. The Theory and Practice of Hell is his classic account of life inside.Unlike many other books by survivors who published immediately after the war, The Theory and Practice of Hell is more than a personal account. It is a horrific examination of life and death inside a Nazi concentration camp, a brutal world of a state within state, and a society without law. But Kogon maintains a dispassionate and critical perspective. He tries to understand how the camp works, to uncover its structure and social organization. He knew that the book would shock some readers and provide others with gruesome fascination. But he firmly believed that he had to show the camp in honest, unflinching detail.The result is a unique historical document—a complete picture of the society, morality, and politics that fueled the systematic torture of six million human beings. For many years, The Theory and Practice of Hell remained the seminal work on the concentration camps, particularly in Germany. Reissued with an introduction by Nikolaus Waschmann, a leading Holocaust scholar and author of Hilter's Prisons, this important work now demands to be re-read.",
  "genres": [
    "History",
    "Nonfiction",
    "Holocaust",
    "World War II",
    "War",
    "Germany",
    "Psychology"
  ],
  "author": "Eugen Kogon",
  "average_rating": "4.24",
  "url": "https://www.goodreads.com/book/show/1215025.The_Theory_and_Practice_of_Hell"
}