{
  "title": "The Grunt 1",
  "description": "Staff Sergeant Brett Black has a bad feeling that something is going to go terribly wrong. And as a Recon Marine, he pays attention to his gut. Only nothing can prepare him for what he encounters when he arrives at home from the base. His wife is leaving him, and there is nothing he can do about it. Abandoned with a kid, the super alpha-male has to become domesticated quickly or find a willing substitute to help him with his son. Only the substitute he finds is no substitution. Courtney Lawless is a true wild card. The budding librarian loves the classics and carries herself like a lady by day. But she also is full of life and surfs the waves of the Atlantic Ocean by night. Since her parents won’t pay for college because of bad decisions in her past, the reformed bad-girl takes a job as Brett’s live-in nanny to finish paying for school. Brett has never seen a woman of such complex duality. Used to a wife who won’t clean, cook or even talk to him, when he starts to live with Courtney, he realizes what he’s been missing his entire life. Educated, amazing and refreshingly honest, the only thing that that this transparent beauty hides from her new boss is that she’s also the Lieutenant Colonel’s daughter. Faced with another deployment to Afghanistan soon, the brooding Marine is forced to come out his shell to fight for what he loves, only this time, the war is at home.Enjoy the interracial must-read romance of the summer, The Grunt, the third a longest book in Latrivia S. Nelson’s Lonely Heart Series today.Special note from the author:As a proud wife of a decorated, United States Marine, I’m happy to write this book about finding love while serving the Corps. I think you’ll find Brett to be a strong alpha male with endearing qualities, and you’ll find Courtney to be a strong, loving woman. The combination makes for a classic love story that sizzles with passion but warms you from the inside with sincerity. This is also the longest book in The Lonely Heart Series. As a full-length novel, I think you’ll enjoy the extra pages and a few laughs. Like so many others, my husband was wounded in Iraq. His road to recovery was hard not only on us but also on our two children. It took a lot. Words cannot explain the pain and worry of receiving “the call” that your husband has been severely injured. As a young couple, we relied on our families, our faith in God and the military for support. A part of the proceeds from this book will be contributed to Soldier’s Angels (http://www.soldiersangels.org) for those who have served and have been injured. Check my official website for the date and amount of the contribution. We are aiming to present a check during the Christmas holiday. I would encourage you to consider them as your charity of choice as well. Again, I hope that you enjoy.Sincerely yours,Latrivia S. Nelson",
  "genres": [
    "Interracial Romance",
    "Romance",
    "Military Fiction",
    "Contemporary Romance",
    "Contemporary",
    "Military Romance",
    "Erotica"
  ],
  "author": "Latrivia S. Nelson",
  "average_rating": "4.11",
  "url": "https://www.goodreads.com/book/show/12150069-the-grunt-1"
}