{
  "title": "Make Trouble: Standing Up, Speaking Out, and Finding the Courage to Lead",
  "description": "From Cecile Richards—the president of Planned Parenthood, daughter of the late Governor Ann Richards, featured speaker at the Women’s March on Washington, and “the heroine of the resistance” (Vogue)—comes a story about learning to lead and make change, based on a lifetime of fighting for women’s rights and social justice.Cecile Richards has been an activist since she was taken to the principal’s office in seventh grade for wearing an armband in protest of the Vietnam War. Richards had an extraordinary girlhood in ultra-conservative Texas, where her hell-raising parents—her civil rights attorney father and political activist mother—taught their kids to be troublemakers. In the Richards household, the “dinner table was never for eating—it was for sorting precinct lists.”She watched her mother, Ann, transform herself from a housewife to a force in American politics who made a name for herself as the straight-talking, truth-telling governor of Texas. But Richards also witnessed the pitfalls of public life that are unique to women, and the constant struggle to protect and expand equal rights—both exemplified by her marathon congressional testimony, where she held her own against hostile questions for five hours.As a young woman, Richards worked as a labor organizer alongside women earning a minimum wage, and learned that those in power don’t give it up without a fight. Now, after years of advocacy, resistance, and progressive leadership, she shares her story for the first time—from the joy and heartbreak of activism to the challenges of raising kids, having a life, and making change, all at the same time. She shines a light on the people and lessons that have gotten her through good times and bad, and encourages readers to take risks, make mistakes, and make trouble along the way. Richards has dedicated her life to taking on injustice, and her memoir will inspire readers to hope and action.",
  "genres": [
    "Nonfiction",
    "Feminism",
    "Memoir",
    "Politics",
    "Audiobook",
    "Biography",
    "Womens"
  ],
  "author": "Cecile Richards",
  "average_rating": "4.29",
  "url": "https://www.goodreads.com/book/show/35721620-make-trouble"
}