{
  "title": "The Revolutionary Genius of Plants: A New Understanding of Plant Intelligence and Behavior",
  "description": "Do plants have intelligence? Do they have memory? Are they better problem solvers than people? Plant Revolution—a fascinating, paradigm-shifting work that upends everything you thought you knew about plants—makes a compelling scientific case that these and other astonishing ideas are all true.Plants make up eighty percent of the weight of all living things on earth, and yet it is easy to forget that these innocuous, beautiful organisms are responsible for not only the air that lets us survive, but for many of our modern comforts: our medicine, food supply, even our fossil fuels.On the forefront of uncovering the essential truths about plants, world-renowned scientist Stefano Mancuso reveals the surprisingly sophisticated ability of plants to innovate, to remember, and to learn, offering us creative solutions to the most vexing technological and ecological problems that face us today. Despite not having brains or central nervous systems, plants perceive their surroundings with an even greater sensitivity than animals. They efficiently explore and react promptly to potentially damaging external events thanks to their cooperative, shared systems; without any central command centers, they are able to remember prior catastrophic events and to actively adapt to new ones.Every page of Plant Revolution bubbles over with Stefano Mancuso’s infectious love for plants and for the eye-opening research that makes it more and more clear how remarkable our fellow inhabitants on this planet really are. In his hands, complicated science is wonderfully accessible, and he has loaded the book with gorgeous photographs that make for an unforgettable reading experience. Plant Revolution opens the doors to a new understanding of life on earth.",
  "genres": [
    "Nonfiction",
    "Science",
    "Nature",
    "Biology",
    "Plants",
    "Audiobook",
    "Environment"
  ],
  "author": "Stefano Mancuso",
  "average_rating": "4.11",
  "url": "https://www.goodreads.com/book/show/35721619-the-revolutionary-genius-of-plants"
}