{
  "title": "Miss Ex-Yugoslavia: A Memoir",
  "description": "“Sofija Stefanovic’s beautiful memoir Miss Ex-Yugoslavia depicts the elegant transit of a girl becoming an artist. This is a story we yearn to How does a girl lose her childhood, family, and nation, yet nurture her memories, dreams, and art? Stefanovic hits all her marks, and she keeps us in her thrall.” —Min Jin Lee, author of Pachinko , a New York Times bestseller and National Book Award finalist“Funny and tragic and beautiful in all the right places. I loved it.” —Jenny Lawson, #1 New York Times bestselling author of Let’s Pretend This Never Happened and Furiously HappyA funny, dark, and tender memoir about the immigrant experience and life as a perpetual fish-out-of-water, from the acclaimed Serbian-Australian storyteller.Sofija Stefanovic makes the first of many awkward entrances in 1982, when she is born in Belgrade, the capital of socialist Yugoslavia. The circumstances of her birth (a blackout, gasoline shortages, bickering parents) don’t exactly get her off to a running start. While around her, ethnic tensions are stoked by totalitarian leaders with violent agendas, Stefanovic's early life is filled with Yugo rock, inadvisable crushes, and the quirky ups and downs of life in a socialist state.As the political situation grows more dire, the Stefanovics travel back and forth between faraway, peaceful Australia, where they can’t seem to fit in, and their turbulent homeland, which they can’t seem to shake. Meanwhile, Yugoslavia collapses into the bloodiest European conflict in recent history.Featuring warlords and beauty queens, tiger cubs and Baby-Sitters Clubs, Sofija Stefanovic’s memoir is a window to a complicated culture that she both cherishes and resents. Revealing war and immigration from the crucial viewpoint of women and children, Stefanovic chronicles her own coming-of-age, both as a woman and as an artist who yearns to take control of her own story. Refreshingly candid, poignant, and illuminating, Miss Ex-Yugoslavia introduces a vital new voice to the immigrant narrative.",
  "genres": [
    "Memoir",
    "Nonfiction",
    "Biography",
    "Book Club",
    "Biography Memoir",
    "History",
    "Australia"
  ],
  "author": "Sofija Stefanovic",
  "average_rating": "4.03",
  "url": "https://www.goodreads.com/book/show/35721642-miss-ex-yugoslavia"
}