{
  "title": "Amici di carta. Viaggio nella letteratura per i ragazzi",
  "description": "Sfogliare da adulti i libri che si sono letti da bambini può portare emozioni, ricordi, un pò di nostalgia. Oppure si possono riprendere in mano con un occhio diverso: con lo sguardo dello studioso che analizza i testi, interrogandosi sulla fortuna imperitura di alcuni e sulla caducità di altri; che indaga su autori più o meno celebri; che ricostruisce la storia di collane e sigle editoriali attraverso le quali si è diffusa la letteratura per l’infanzia; che valorizza la bellezza di disegni inizialmente destinati a un pubblico infantile e invece capaci di suscitare l’ammirazione di tutti.Forse occorrerebbe unire i due possibili percorsi: quello che fa tornare all’infanzia, e quello che invita ad approfondire lo studio. È quanto cerca di suggerire questo volume, che vuole offrire scritti brevi, ma con numerose sollecitazioni critiche, e, soprattutto, proporre tante immagini: quelle dei libri che hanno accompagnato bambini e ragazzi per oltre un secolo, in Italia come in Inghilterra, in Francia, in Russia.Questi libri, a lungo disposti sui ripiani delle librerie – spesso piccole, modeste, e solo con opere per bambini – di tante famiglie, sono stati, nel tempo, per lo più dispersi, dimenticati, addirittura gettati. C’è invece chi li ha raccolti, salvandoli dall’abbandono e facendone oggetto di collezione: due di queste, tra le più importanti per la ricchezza e la qualità dei libri in esse riuniti, sono ora in Apice, il centro dell’Università degli Studi di Milano che, già nel nome che scioglie l’acronimo – Archivi della Parola, dell’Immagine e della Comunicazione Editoriale – rivela l’obiettivo di raccogliere e conservare i più diversi materiali a stampa, consegnandoli alla memoria dei lettori e all’esame degli studiosi.Se, muovendo dalla letteratura per l’infanzia, le pagine firmate da alcuni docenti dell’ateneo possono spingere a ulteriori approfondimenti, le centinaia di illustrazioni riprodotte dai libri di Apice danno la possibilità a tutti i lettori di ripercorrere esperienze affidate ormai quasi solo alla memoria, o di conoscere, attraverso le immagini, una storia non secondaria della cultura di fine Ottocento e dei primi cinquant’anni del Novecento.",
  "genres": [],
  "author": "Lodovica Braida",
  "average_rating": "3.50",
  "url": "https://www.goodreads.com/book/show/35720034-amici-di-carta-viaggio-nella-letteratura-per-i-ragazzi"
}