{
  "title": "Falling Series Collection 1",
  "description": "Molly: Part One & Two:  Falling in love with your best friend is never going to be straightforward. But when is the right time to confess your feelings?  After suffering a devastating loss Molly seeks solace in Ryan knowing nothing will ever happen between them. But when she gets screwed over by her boyfriend Molly finds herself living in Ryan’s spare bedroom. Things start to change for Molly immediately but she knows she can’t risk admitting her feelings for Ryan because it could result in losing everyone else she loves. She’s already lost too much.  Ryan thought his life was all planned out with his perfect woman until the unthinkable happened. Spending time with Molly, who was dealing with the same heartache, helps him come to terms with the sudden change in his life. When Ryan offers Molly his spare room he doesn’t expect to instantly start seeing her differently. Can he put his feelings aside to spare others or will his attraction to her be too strong to deny?  Abbi:  It was lust at first sight when Abbi laid eyes on inches of perfect inked up skin last summer. She had a weakness for bad boys who were great at breaking her bed but even better at breaking her heart. She was trying to break the cycle and date the nice guys but they left something to be desired. Abbi has spent her whole adult life dealing with the aftermath of an event that happened to her as a teenager. Will her inner demons be enough to put an end to her new relationship before it has really started? She never could’ve imagined that this stranger’s bad boy appearances were just that and what was on the inside was the romantic and passionate man she had been looking for.  Jax wants nothing more than to settle down with a woman he loves. Unfortunately his looks have meant that he attracts the wrong type of women who don’t take his commitment seriously. He unexpectedly meets a blonde bombshell at his friend’s house that instantly takes his breath away, could she be the one he has been waiting for and could she help him banish the ghosts of his past?  Emma:  Deciding it’s time to move on after the devastating loss of her twin sister, Emma starts a new life in a new village. What she doesn’t expect is that Connie, the quirky café owner where she has spent so much time, will become her new best friend, and that her Connie’s brother will spark something inside her that she didn’t ever think could be uncovered. Will Emma be able to overcome her fear of loss and her lack of self-confidence to be able to let him in or will she push away the only man that’s ever made her feel alive?  Ruben has spent the last six months travelling Australia. After witnessing the pain of a broken heart Ruben made the decision that he was never going let a woman in, he was content with letting them warm his bed and nothing more. That is until a photograph appears on his phone and a pair of light blue eyes and a curvy body knock him on his arse. Will he be able to put aside his fear of losing himself to a woman to fight for the one thing he wants more than anything and accept that his future isn’t what he thought he wanted?  Connie:  Connie has been hiding her true feelings for years. She has first hand experience of what acting on those feelings does for the ones she loves so she tries her best to keep them locked up tight. Connie is a strong young woman. She has a successful business, an amazing family and now a great best friend. There is something missing though and no matter what she does she can’t put him behind her.",
  "genres": [
    "Romance",
    "New Adult",
    "Contemporary",
    "Amazon",
    "Contemporary Romance"
  ],
  "author": "Tracy Lorraine",
  "average_rating": "4.41",
  "url": "https://www.goodreads.com/book/show/35724393-falling-series-collection-1"
}