{
  "title": "The Omega Project",
  "description": "The Omega Project by Angus MacM. HodgsonIn the throes of WWII, President Franklin Roosevelt appointed General William Donovan, holder of the Army's four top medals, the head of the Office of Strategic Services better known as the O.S.S. The OSS was the nation's first general purpose intelligence agency.Donovan created a brain trust of very intelligent professor types to help analyze intelligence and plan targeting. As the war was winding down this same group turned their attention to post-war conditions and the needs of the country-- you could say they were early futurists. Keeping German and Japanese knowledge of advanced weapons out of the hands of communist Russia became priority one. The Russians were most likely to be our next major enemy. To counter this future threat, the OSS brain trust came up with a couple of plans. The Omega Project was one of these plans.Much of the Omega Project is public record--a system of defenses to save the United States and our way of life from the holocaust of an atomic third world war. Early warning alarms, fallout shelters, stockpiles of supplies, and a corps of trained Civil Defense workers. The plan also called for a network of hardened shelters for command and control personnel and our nation's leaders.As we all know now, most parts of this initial master plan have been abandoned. Civil Defense Corps- reassigned. Public shelters - non-existent. Civil Defense training programs - scrapped. What does remain is the stockpiling of supplies and the hardened shelters for command and control, and the nation's political elite.But is that all that's left of the Omega Project? Or was there a third part of the plan, a secret?Lt. Colonel Jon Frasier, Delta Force, squadron commander has risen through the ranks and is due for a staff assignment. He's sent to an advanced secret base as the project manager for the DARPA Army Warﬁghter Individual Soldier Body Armor Program. In this new world Jon almost immediately confronts new enemies and problems to overcome. He's faced with massive changes in available technology and paradigm shifts become the new norm.As if this new life wasn't challenging enough, Jon and the other inhabitants of Omega 11 suddenly find themselves in a fight for survival as an end of the world event strikes, and turmoil ensues. Can Omega 11 and the other omega sites withstand the very real doomsday scenario unfolding. Are Jon and those under his command up to the task? Or will the last and most secretive part of the Omega Project succumb to chaos around it?",
  "genres": [],
  "author": "Angus MacM. Hodgson",
  "average_rating": "4.67",
  "url": "https://www.goodreads.com/book/show/35755066-the-omega-project"
}