{
  "title": "History of European Morals From Augustus to Charlemagne Part 2",
  "description": "\"\"The History of European Morals From Augustus to Charlemagne V2\"\" is a comprehensive study of the moral and ethical values that shaped European society from the reign of Augustus to the time of Charlemagne. Written by W. E. H. Lecky, this book is the second volume in a two-part series that explores the evolution of European morality over the centuries.In this volume, Lecky examines the impact of Christianity on European morals, particularly in the early Middle Ages. He explores the role of the Church in shaping moral codes and the influence of Christian theology on the development of ethical values. Lecky also delves into the social and cultural factors that shaped European morals during this period, including the rise of feudalism and the emergence of new forms of political power.Throughout the book, Lecky provides a detailed analysis of the various moral and ethical systems that were prevalent in Europe during this time, including Stoicism, Epicureanism, and Christianity. He also explores the ways in which these systems interacted with one another and how they influenced the development of European culture.Overall, \"\"The History of European Morals From Augustus to Charlemagne V2\"\" offers a fascinating insight into the complex and evolving nature of European morality. It is an essential read for anyone interested in the history of ethics and the development of Western civilization.1913. Other volumes in this set include ISBN number(s): 0766173941. Volume 2 of 2. In treating this subject, the author has endeavored, for the most part, to exclude all considerations of a purely theological or controversial character, all discussions concerning the origin of the faith in Palestine, and concerning the first type of its doctrine, and to regard the Church simply as a moral agent, exercising its influence in Europe. Confining himself within these limits, Lecky has examined the manner in which the circumstances of the pagan empire impeded or assisted its growth, the nature of the opposition it had to encounter, the transformations it underwent under the influence of prosperity, of the ascetic enthusiasm and of the barbarian invasions, and the many ways in which it determined the moral condition of society.This scarce antiquarian book is a facsimile reprint of the old original and may contain some imperfections such as library marks and notations. Because we believe this work is culturally important, we have made it available as part of our commitment for protecting, preserving, and promoting the world's literature in affordable, high quality, modern editions, that are true to their original work.",
  "genres": [
    "Philosophy",
    "History"
  ],
  "author": "William Edward Hartpole Lecky",
  "average_rating": "4.22",
  "url": "https://www.goodreads.com/book/show/3575770-history-of-european-morals-from-augustus-to-charlemagne-part-2"
}