{
  "title": "Alphabet Juice: The Energies, Gists, and Spirits of Letters, Words, and Combinations Thereof; Their Roots, Bones, Innards, Piths, Pips, and Secret Parts, Tinctures, Tonics, and Essences; With Examples of Their Usage Foul and Savory",
  "description": "Ali G: How many words does you know?Noam Chomsky: Normally, humans, by maturity, have tens of thousands of them.Ali G: What is some of 'em?-Da Ali G ShowDid you know that both mammal and matter derive from baby talk? Have you noticed how wince makes you wince? Ever wonder why so many h-words have to do with breath?Roy Blount Jr. certainly has, and after forty years of making a living using words in every medium, print or electronic, except greeting cards, he still can't get over his ABCs. In Alphabet Juice, he celebrates the electricity, the juju, the sonic and kinetic energies, of letters and their combinations. Blount does not prescribe proper English. The franchise he claims is \"over the counter.\"Three and a half centuries ago, Thomas Blount produced Blount's Glossographia, the first dictionary to explore derivations of English words. This Blount's Glossographia takes that pursuit to other levels, from Proto-Indo-European roots to your epiglottis. It rejects the standard linguistic notion that the connection between words and their meanings is \"arbitrary.\" Even the word arbitrary is shown to be no more arbitrary, at its root, than go-to guy or crackerjack. From sources as venerable as the OED (in which Blount finds an inconsistency, at whisk) and as fresh as Urbandictionary.com (to which Blount has contributed the number-one definition of alligator arm), and especially from the author's own wide-ranging experience, Alphabet Juice derives an organic take on language that is unlike, and more fun than, any other.",
  "genres": [
    "Nonfiction",
    "Language",
    "Humor",
    "Linguistics",
    "Writing",
    "History",
    "Words"
  ],
  "author": "Roy Blount Jr.",
  "average_rating": "3.61",
  "url": "https://www.goodreads.com/book/show/3573608-alphabet-juice"
}