{
  "title": "All the Beautiful Girls",
  "description": "A powerful novel about a gutsy showgirl who tries to conquer her past amongst the glamour of 1960s Las Vegas--and finds unexpected fortune, friendship, and love.It was unimaginable. When she was eight years old, Lily Decker somehow survived the auto accident that killed her parents and sister, but neither her emotionally distant aunt nor her all-too-attentive uncle could ease her grief. Dancing proves to be Lily's only solace, and eventually she receives a \"scholarship\" to a local dance academy--courtesy of a mysterious benefactor.Grown and ready to leave home for good, Lily changes her name to Ruby Wilde and heads to Las Vegas to be a troupe dancer, but her sensual beauty and voluptuous figure land her work instead as a showgirl performing everywhere from Les Folies Bergere at the Tropicana to the Stardust's Lido de Paris. Wearing costumes dripping with feathers and rhinestones, five-inch heels, and sky-high headdresses, Ruby may have all the looks of a Sin City success story, but she still must learn to navigate the world of men--and figure out what real love looks like.With her uncanny knack for understanding the hidden lives of women, Elizabeth J. Church captures both the iconic extravagance of an era and the bravery of a young woman who dances through her sadness to find connection, freedom, and, most important, herself.Advance praise for All the Beautiful Girls\"A riveting novel, at once raw and tender, of a woman's struggle to heal the wounds of a devastating childhood . . . Elizabeth J. Church makes us feel Ruby Wilde's pain and root for her to survive. This is a heartbreaking story, passionately told.\"--Ellen Feldman, author of Next to LovePraise for Elizabeth J. Church's The Atomic Weight of Love\"Oh, what an incandescent debut! Church follows one extraordinary woman who is brave to enough to challenge the times, take defiant wing, and chart her own extraordinary flight path. The Atomic Weight of Love is so engrossing I couldn't wait to read another page, and so alive I never wanted the story to end.\"--Caroline Leavitt, author of Is This Tomorrow\"A tightly crafted novel.\"--The New York Times Book Review\"Exquisite . . . the beautifully written story of a woman who must negotiate the tricky terrain of love, responsibility, ambition, and sacrifice. . . . It shows the impossible choices women faced--and still face--between family and self.\"--Tara Conklin, author of The House Girl\"What does love require of us? How does one strike a balance between compromise and self-fulfillment? In her debut novel, Church writes to these issues in a style that is thoughtful and elegant. . . . Church hits the mark in this emotionally driven debut.\"--Library Journal\"A striking story of a woman forced to choose between the future she desires or the path society insists she take.\"\n--Harper's Bazaar \n\"An elegant glimpse into the evolution of love and womanhood.\"--Kirkus Reviews",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Romance",
    "Historical",
    "Chick Lit",
    "Adult",
    "Audiobook"
  ],
  "author": "Elizabeth J. Church",
  "average_rating": "3.79",
  "url": "https://www.goodreads.com/book/show/35742699-all-the-beautiful-girls"
}