{
  "title": "The Wonder Spot",
  "description": "Six years after her amazingly successful debut, The Girls' Guide to Hunting and Fishing, Melissa Bank rewards her fans for their patience with The Wonder Spot, a refreshingly honest interpretation of one young woman's journey into adulthood. As we follow heroine Sophie Applebaum through a comfortable, yet awkward childhood in suburban Pennsylvania to the challenges of finding love and a career in midtown Manhattan, The Wonder Spot is never guilty of the self-indulgent traps set by other members of the Chick Lit genre Bank helped launch.We first meet the Applebaum clan on their way to cousin Rebecca's bat mitzvah in Chappaqua, New York, where Sophie ends up sneaking cigarettes in the woods with a handsome eighth grader one year her senior. Yet even this minor rebellion is more charming than anything else; as with most of her future transgressions, Sophie is less the instigator than the innocent witness. Defining moments in Sophie's life are revealed through her relationships: an almost mythical college roommate named Venice; her charismatic yet capricious older brother; her brilliant younger brother; her unpenetrable father; and her hilarious grandmother, who takes it upon herself to save her \"Sophila\" from \"impending spinsterhood.\" Of course, no real journey into young womanhood is complete without a series of committment phobic, potentially delinquent, overly nice men whose appearances seem less about love than about demonstrating our heroine's inability to ever truly be comfortable with herself. As Sophie observes during a seventh grade skating party, \"I felt sure that everyone was looking at me and then realized that no one was, and I experienced the distinct shame of each.Undeniably clever, occasionally hilarious, and often poignant, The Wonder Spot is captivating enough for readers to forgive Sophie's indecisive, self-destructive tendancies and simply bask in her sincerity. --Gisele Toueg",
  "genres": [
    "Fiction",
    "Chick Lit",
    "Short Stories",
    "Contemporary",
    "Coming Of Age",
    "Adult Fiction",
    "Relationships"
  ],
  "author": "Melissa Bank",
  "average_rating": "3.32",
  "url": "https://www.goodreads.com/book/show/35775.The_Wonder_Spot"
}