{
  "title": "Indian Creek",
  "description": "Pete Fromm era aficionado a los libros sobre exploradores, pioneros y rudos hombres de las montañas. Decidió estudiar la licenciatura de Biología de la Vida Salvaje porque aparecía la palabra «salvaje», y lo hizo en la Universidad de Montana porque fue el estado menos civilizado que encontró. Pero, en realidad, nuestro autor apenas había hecho algunas acampadas en la naturaleza, tenía dificultades para orientarse y jamás había usado una sierra eléctrica. Sin embargo, uno debe tener cuidado con lo que desea… Un buen día le propusieron un trabajo en el Servicio Forestal: custodiar unos huevos de salmón en la zona de Indian Creek. A sesenta kilómetros de la carretera más cercana. Con temperaturas de hasta cuarenta grados bajo cero. En una tienda de campaña. Durante siete meses. Incorporación inmediata. Pete aceptó sin pensarlo. Pasó la siguiente semana de una fiesta de despedida a otra. Y entonces, sin haberse deshecho aún de la resaca, comenzó la aventura. Indian Creek es una auténtica obra de culto de la nature writing, inédita hasta la fecha en nuestra lengua. A medio camino entre Butcher’s Crossing de John Williams y Hacia rutas salvajes de John Krakauer, este libro es tanto una historia de iniciación como el relato autobiográfico de una experiencia límite en plena naturaleza. Durante todos los meses que pasó en aquella tienda de campaña, Pete convivió cotidianamente con osos, pumas, alces, linces, coyotes, cazadores furtivos, tormentas de nieve y aludes, expuesto a cada momento tanto al peligro inagotable como a la belleza indescriptible y remota de Indian Creek. Con maestría y honestidad, su narración alterna la épica implícita en toda vivencia extrema con un humor hilarante, con el que el autor da cuenta de su propia torpeza e ignorancia y de su accidentado y constante aprendizaje, que en más de una ocasión a punto está de costarle la vida. Pete Fromm siempre quiso ser un auténtico hombre de las montañas, como aquellos que protagonizaban los libros que él leía. Lo consiguió. Bueno, más o menos.",
  "genres": [
    "Nonfiction",
    "Nature",
    "Memoir",
    "Adventure",
    "Travel",
    "Outdoors",
    "Biography"
  ],
  "author": "Pete Fromm",
  "average_rating": "4.22",
  "url": "https://www.goodreads.com/book/show/35785012-indian-creek"
}