{
  "title": "Meanwhile...: A Biography of Milton Caniff",
  "description": "Milton Caniff was one of the most influential American cartoonists of the 20th century. He rose to prominence during World War II when he took the characters in his Terry and the Pirates strip into the war. The trenchant pragmatic patriotism of the strip warmed hearts and steeled nerves on the home front as well as the battlefront (one of his strips was read into the Congressional Record). He went on to create Steve Canyon, which was syndicated from 1947 to Caniff's death in 1988.Meanwhile...traces Caniff's life from the cradle to the grave, examining the artistic innovations and work routines of a nationally distributed cartoonist whose career was central to the development of the art form, and marking the milestones in the development of the comic strip that Caniff established. Caniff reshaped the medium and set standards by which all storytelling strips were subsequently judged. He created many colorful characters, including the stalwart Pat Ryan from Terry and the Pirates, Burma the shady lady, and, most memorable of all, the Dragon Lady, a beautiful but mysteriously menacing pirate queen who turned Chinese patriot during the War. While Meanwhile... provides a biography of Caniff and analyzes his storytelling techniques, it also serves as a history of the medium and reveals the inner workings of the syndicate business (at which Caniff was as expert as he was at cartooning). The book charts Caniff's rise to fame and fortune, then recounts the decline of his strip Steve Canyon's popularity (whose protagonist served as an unofficial spokesman for the U.S. Air Force from the Korean War until the end of the strip in 1988) when the same brand of patriotism that had inspired admiration during World War II provoked protest during Vietnam, a bittersweet conclusion to a career spent producing a daily feature for 55 years, a record that would stand for a generation. A 2008 Eisner Award Nominee: Best Comics-Related Book; a 2008 Harvey Award Nominee: Best Biographical, Historical or Journalistic Presentation.",
  "genres": [
    "Comics",
    "Biography",
    "Nonfiction",
    "Art"
  ],
  "author": "Robert C. Harvey",
  "average_rating": "4.04",
  "url": "https://www.goodreads.com/book/show/1215283.Meanwhile_"
}