{
  "title": "How To Sell A Gazillion eBooks In No Time",
  "description": "How To Sell A Gazillion eBooks In No Time (Even if Drunk, High or Incarcerated) is a parody of all things related to writing, self-publishing and self-promotion. Featuring 59 Writer’s Tips running the gamut from selecting a blockbuster title to creating compelling narrative and dialog, Russell’s relentlessly evil humor mocks everything sacred to the writing profession. Described as “…the literary equivalent of Ebola” and “vicious, demented, reprehensible brain poison,” Blake’s book is sweeping the publishing industry and garnering rave reviews. A must buy for authors, friends of authors, and readers everywhere.”How to Sell a Gazillion eBooks In a Year is by far the most important book ever written on any topic, although I exclude the Bible since the Bible wasn’t exactly written in the way we mean the word “written.” But other than that, Gazillion does it all. For everyone. A can’t miss, sure fire Gazillion hit-a-thon from the master of them all.”- John Lescroart, NY Times bestselling author of over 20 novels, including The Vig, The 13th Juror, Treasure Hunt, Damage, Second Chair and a host of others“…a joyously vicious satire and parody that makes sport of John Locke, and indeed of the whole brave new world of self–publishing and self–promotion. If you don’t find Mr. Blake outrageous, and indeed offensive, you would seem to be missing the point. And the same thing goes if you only find him outrageous and offensive.”- Lawrence Block, bestselling author of Telling Lies For Fun & Profit, The Liar’s Bible, A Drop Of The Hard Stuff, and Getting Off“Anybody who’s ever read a self-help book will appreciate the cynical humor from the nimble mind of Russell Blake in this parody. Piercing sarcasm, the ability to turn a phrase into a missile and an impressive vocabulary (he makes up words if he doesn’t know an appropriate one – I’ve asked him, but still don’t know what a Gazillion is) combine into a book that is alternately rant, grovel, trash-talk and Bizarro-world counsel. Irreverent fun.”– David Lender, author of Trojan Horse, The Gravy Train and Bull Street+++A Q & A for How To Sell A Gazillion with bestselling author Russell Blake Gazillions mocks everyone and everything, including icons like John Locke. Are you trying to be the most hated writer alive? Russell Fair question. First off, this wasn't a jab at Locke. It was a jab at everyone. I wanted to write something that called BS and mocked the entire notion that it was easy or fun being a self-published author. There's just this hushed sort of reverence when certain names are mentioned, I thought it would be very funny to lampoon both the self-help books themselves, as well as our entire attitude about self-publishing and being authors. I think the result worked - I was laughing as I wrote most of it, and I still laugh when I go back and read it, although admittedly alcohol is often involved.. Who is the book written for? Honestly, it was mainly written for me, and a small circle of friends with really twisted senses of humor. Nothing's sacred in that crowd, which is the basis of most of the humor in the book. That, and there are a lot of jabs at bad writing, of which, unfortunately, there's no What would you tell readers delving into it? Mainly that there are no sacred cows, or rather, that there shouldn't be. Writing should be fun, and joyful, and done for the sake of creating something worth reading.",
  "genres": [
    "Writing",
    "Nonfiction",
    "Humor"
  ],
  "author": "Russell Blake",
  "average_rating": "3.69",
  "url": "https://www.goodreads.com/book/show/12153117-how-to-sell-a-gazillion-ebooks-in-no-time"
}