{
  "title": "The Point of a Gun",
  "description": "In the near future, America is experiencing a dramatic increase in terrorist attacks---by jihadists, White supremacists, and Mexican cartels. In the face of these failures by the U.S. Government intelligence and law enforcement bureaucracies, an ad hoc vigilante effort has exploded on the scene. And, surprisingly, this shadowy and deadly vigilante group appears to be led by one of the U.S. Government's most senior and trusted Counterterrorism (CT) insiders. The President convenes a top secret Task Force to investigate and uncover who is spearheading this rogue, inner circle operation.  Is it his CIA CT rep? The FBI Special Agent in Charge of CT? Or maybe it's the Army's Senior Special Ops CT expert. Boldly, the President decides to place all three on his Investigative Task Force, hoping to draw out the guilty party or parties, and put an end to the spiraling violence and chaos. Will his gamble pay off ? Or will things spin even further out of control. As the story careens full throttle in parallel between the thrilling action of the vigilantes’ frequent murders of terrorists in the act and the attempts by the senior CT officials to discover the rogues’ identities, neither the reader, the President, the innocent Task Force members, nor, ultimately, the President’s hired top secret investigator knows the real identities of the vigilante leaders.\n\nAs they close in, the murders---both terrorist and vigilante--ratchet up. The questions then become: what are the risks to America if the public gets wind of the vigilante murders? and what does the president intend to do with the vigilantes if, in fact, they are found alive?\n\n\nSteven W. Kohlhagen, bestselling author of WHERE THEY BURY YOU and CHIEF OF THIEVES, has set a new standard for terrorist novels and action-packed thrillers. Don´t miss it!",
  "genres": [],
  "author": "Steven W. Kohlhagen",
  "average_rating": "4.17",
  "url": "https://www.goodreads.com/book/show/35804278-the-point-of-a-gun"
}