{
  "title": "Think Like an Entrepreneur: The Mindset of Success",
  "description": "What makes an entrepreneur successful? The latest scientific research revealed in this book demonstrates that entrepreneurial thinking can be easily developed by everyone and is far more than creative thinking, idea generation or brain-storming techniques. What makes serial entrepreneurs successful is their personal mindset. What is less known is how their internal process develops their mindset to perform at the highest level. And it is much more than their ability to tolerate high risk or failure. The entrepreneur develops their personal mindset from an inner perspective, they trust that clarity will emerge from intuition to inform the initial idea or vision for a business. This intuition is beyond the brain, it appears in the heart, gut and internal organs. We have a unique intuitive intelligence and you will learn just how entrepreneurs use this information to both attract and create a successful business. This formula is the GPS for your entrepreneurial success. This formula has never been revealed outside the academic world. Through interviews with scientists, serial entrepreneurs and business thinkers about their individual experiences and with proven application and techniques, Jane Mara has unlocked the key to what makes serial entrepreneurs successful. Jane Mara’s Think Like an The Mindset of Success demystifies how serial entrepreneurs behave and what it takes to create successful business ventures. Importantly her research has focused on seeking an understanding of how successful repeat entrepreneurs integrate intuition and intentionality into recognising opportunities for business innovation and development. Jane has proven that this formula is accessible for all who wish to adopt more entrepreneurial thinking. \"Don’t let the noise of others’ opinions drown out your own inner voice. And most important, have the courage to follow your heart and intuition.\" ~ Steve Jobs",
  "genres": [],
  "author": "Jane Mara",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/35792352-think-like-an-entrepreneur"
}