{
  "title": "The Ritchie Boys:  The Untold Story of the Jews Who Escaped the Nazis and Returned with the US Army to Fight Hitler",
  "description": "The story of young German Jews who escaped the Nazis, most often without their families, only to return a few years later to war-torn Europe as members of an elite secret U.S. Army unit.\nThe young men who would become known as “The Ritchie Boys” arrived in America as “enemy aliens,” and although they were allowed to enlist in the U.S. military, they were distrusted by everyone. So, in effect, they became outsiders all over again. Until one day in 1942, when the Pentagon woke up to the incredible asset they had on their hands. These men knew the language, culture and psychology of the enemy better than any Americans and had the greatest motivation to fight Hitler’s anti-Semitic regime. The Pentagon came up with a top-secret plan to harness their expertise by training them in the art of prisoner interrogation. And so off they were sent, back into the belly of the beast, Jews returning to Nazi Germany to occupy the very front lines of battlefields across Europe. Many of them re-entered Europe on D-Day. Their mission, to extract vital intel from freshly-captured POWs about troop movements and command structures and so on, was hugely successful and provided key information that led to victory by the Allied forces.Meanwhile, few of these men knew what had happened to the families they left behind in Germany, families who had sacrificed to send them on to the safety of America. As the intelligence they gathered revealed increasingly horrific details about the Holocaust (most of which was only then beginning to come to light), they came to fear – and, in many cases, discovered – that the worst had befallen their own fathers and mothers and siblings.",
  "genres": [
    "History",
    "Nonfiction",
    "World War II",
    "War",
    "Holocaust",
    "Historical",
    "Military Fiction"
  ],
  "author": "Bruce   Henderson",
  "average_rating": "4.38",
  "url": "https://www.goodreads.com/book/show/35825115-the-ritchie-boys"
}