{
  "title": "Chimera",
  "description": "\"Oh yes, werewolves are still very much a thing. You'll be the coolest aunt if you gift the Weregirl trilogy this holiday. Chimera , the second installment just came out this fall.\" -- Hello GigglesCHIMERA, the gripping second book in C. D. Bell's bestselling WEREGIRL trilogy, takes you further into the world of werewolf superhero, Nessa Kurland. Part mystery thriller, part fantasy romance, CHIMERA weaves together a story of love, family, and sacrifice. A tale of true courage, loyalty, and resilience. A teen werewolf book unlike any other.\"Being a teenage girl isn't easy--and it's even more difficult when you're a werewolf.... Chimera is a page-turner as well as a thought-provoking examination of what it means to be human, ★★★★★.\" --5-stars, Foreword ReviewsThe forest if full of secrets.Nessa Kurland is adjusting to life as a weregirl --she is transforming with ease and running with a pack she cares for deeply. Her boyfriend Luc is a fellow shifter, and Paravida, the corporation responsible for unethical genetic experiments on the residents of Tether, has pulled out of town, leaving the community safe.But that's just how it appears on the surface.Nessa returns home from a run with the pack to find an FBI raid and the shocking news that her mother Vivian is being held without bail for violations so serious she may be facing life in prison. What did Nessa's mother, a small-town vet tech, do to threaten Homeland Security? Vivian's secret past leads Nessa to discover there is more to her own story than she ever imagined.The wolves that are running through Tether's woods are not the same pack Nessa knew before. These are not all natural wolves. And they are breeding.Nessa's transformation is only just beginning.Filled with romance, tragedy, perseverance, and adventure, C. D. Bell's CHIMERA is a breathtaking continuation of Nessa's story, as she confronts the truth of who she is, where she comes from, and what she has to do to survive.\"...this series offers an interesting twist for readers still wanting to sink their teeth into shape-shifter lore. Throw in a strong female lead and an interesting Dr. Moreau-like medical thriller, and this has the makings of a hit .\" -- Booklist Reviews\"A captivating read with a self-reliant heroine, Chimera is a choice pick for public library fantasy collections and personal reading lists . Also highly recommended is the previous novel, Weregirl .\" -- Midwest Book Review",
  "genres": [
    "Fantasy",
    "Urban Fantasy",
    "Paranormal",
    "Werewolves",
    "Young Adult Fantasy",
    "Fiction",
    "Young Adult"
  ],
  "author": "C.D. Bell",
  "average_rating": "4.06",
  "url": "https://www.goodreads.com/book/show/35808492-chimera"
}