{
  "title": "Sherlock Holmes: The Complete Novels and Stories, Volume I",
  "description": "Since his first appearance in Beeton’s Christmas Annual in 1887, Sir Arthur Conan Doyle’s Sherlock Holmes has been one of the most beloved fictional characters ever created. Now, in two paperback volumes, Bantam presents all fifty-six short stories and four novels featuring Conan Doyle’s classic hero - a truly complete collection of Sherlock Holmes’s adventures in crime!Volume I includes the early novel A Study in Scarlet, which introduced the eccentric genius of Sherlock Holmes to the world. This baffling murder mystery, with the cryptic word Rache written in blood, first brought Holmes together with Dr. John Watson. Next, The Sign of Four presents Holmes’s famous “seven percent solution” and the strange puzzle of Mary Morstan in the quintessential locked - room mystery. Also included are Holmes’s feats of extraordinary detection in such famous cases as the chilling “ The Adventure of the Speckled Band,” the baffling riddle of “The Musgrave Ritual,” and the ingeniously plotted “The Five Orange Pips,” tales that bring to life a Victorian England of horse-drawn cabs, fogs, and the famous lodgings at 221B Baker Street, where Sherlock Holmes earned his undisputed reputation as the greatest fictional detective of all time.A study in scarlet --The sign of four --Adventures of Sherlock Holmes: A scandal in Bohemia; The red-headed league; A case of identity; The Boscombe Valley mystery; The five orange pips; The man with the twisted lip; The adventure of the blue carbuncle; The adventure of the speckled band; The adventure of the engineer's thumb; The adventure of the noble bachelor; The adventure of the beryl coronet; The adventure of the copper beeches; Memoirs of Sherlock Holmes: Silver blaze; The yellow face; The stock-broker's clerk; The \"Gloria Scott\"; The musgrave ritual; The Reigate puzzle; The crooked man; The resident patient; The greek interpreter; The naval treaty; The final problem; The return of Sherlock Holmes: The adventure of the empty house; The adventure of the Norwood builder; The adventure of the dancing men; The adventure of the solitary cyclist; The adventure of the priory school; The adventure of Black Peter; The adventure of Charles Augustus Milverton; The adventure of the six Napoleons; The adventure of the three students; The adventure of the golden pince-nez; The adventure of the missing three-quarter; The adventure of the abbey grange; The adventure of the second stain.",
  "genres": [
    "Classics",
    "Mystery",
    "Fiction",
    "Short Stories",
    "Crime",
    "Detective",
    "Mystery Thriller"
  ],
  "author": "Arthur Conan Doyle",
  "average_rating": "4.47",
  "url": "https://www.goodreads.com/book/show/3581.Sherlock_Holmes"
}