{
  "title": "Farewell, My Cuckoo",
  "description": "Julia Lanchester must defend her love nest from an invasive her boyfriend’s sister. And then there’s the little matter of murder . . . “The cuckoo comes in April and sings its song in May. In June it changes tune and July it flies away.” Wedding bells are ringing in the small British village of Smeaton-under-Lyme. Julia Lanchester’s second-in-command at the local tourist center is finally getting married, and the lovebirds are giving Julia and her live-in boyfriend, Michael Sedgwick, ideas about their own future. But before anyone can say “Will you,” Michael’s flighty older sister, Pammy, crashes the party, fresh off a breakup and lugging all her worldly possessions around with her in a tangle of plastic bags.  Before long, Julia’s cozy cottage starts feeling more like Pammy’s bachelorette pad. To keep herself from going cuckoo, Julia throws herself into her pet projects at work—until death disrupts her plans. First a body is found on the estate. Then the police discover that Pammy was the last one to see the man alive. And soon Julia gets the feeling that if she ever wants her home—or her boyfriend—back, she’ll have to get to the bottom of this mystery, even if it means breaking a few eggs. Marty Wingate’s captivating mysteries can be enjoyed together or separately, in any   The Birds of a Feather THE RHYME OF THE MAGPIE | EMPTY NEST | EVERY TRICK IN THE ROOK | FAREWELL, MY CUCKOO “Marty Wingate’s Birds of a Feather mysteries provide a perfect blend of quirky characters and atmosphere.”—Christine Goff, bestselling author of the Birdwatcher’s Mystery series  The Potting Shed THE GARDEN PLOT | THE RED BOOK OF PRIMROSE HOUSE | BETWEEN A ROCK AND A HARD PLACE | THE SKELETON GARDEN | THE BLUEBONNET BETRAYAL | BEST-LAID PLANTS",
  "genres": [
    "Mystery",
    "Cozy Mystery",
    "Cozy",
    "Audiobook",
    "British Literature",
    "Fiction"
  ],
  "author": "Marty Wingate",
  "average_rating": "4.35",
  "url": "https://www.goodreads.com/book/show/35838868-farewell-my-cuckoo"
}