{
  "title": "Taboo Trysts",
  "description": "Only bad girls think about incest. Only bad girls write about lusty mothers, daughters, and sisters who would cross that line. Well, when it comes to being bad, these authors set the standard! Together for the first time, five hot women present five even hotter stories of taboo desire. So sit back, get comfortable, and let the Bad Girls of Erotica show you how being bad has never felt so good!Popping Cherry likes to tease. Nothing makes her hornier than leading men on, then dropping them before they can get her into bed. But a long weekend with family provides unexpected temptations. When she goes too far one day, she discovers her hot cousin Sam isn't about to take her teasing ways lying down. Unless, that is, he's lying down with her! Because Sam has a dominant side, and he's dedicated the weekend to…Popping Cherry!Daddy With her mother dying in childbirth, Kate wants the attention of her father, who wants nothing to do with his only child. Starving for anything from him, she develops severe daddy issues and can’t find another man to satisfy her desires and longings. As her body matures and she looks more and more like her mother, can Kate finally get what she was wanting from her father?Cramming Sis!:Amy and her girlfriend Alicia will soon be heading off to and they’re both hell-bent on making their last week of freedom as memorable as possible! Fortunately for them, that is exactly what Alicia's fresh-from-prison step-brother Link and their tiny enigmatic Asian cousin Aiya have in mind! Not only will virginities be lost, but love will bloom in this quick little sex-drenched tale!My Sister Needs An Anal Simon and his sister Kelly are sharing a drink on a lazy afternoon. When she casually mentions that her boyfriend wants to try anal sex, he has no clue where her devious mind is going. See, Kelly thinks the very idea is gross, but she knows it's her big brother's favorite position. The more he tells her about his experiences, the hornier she gets, until she begs him to show her how it's done!Let Mom Handle Jimmy has a big problem. Make that a big hard problem. In need of some aspirin, he accidentally took two of his father's Viagra! Now he's hard for no good reason, and even masturbating hasn't caused the 'swelling' to go down. In a panic, he goes to his mother and asks her what he should do. After appraising the situation, Jimmy's mom tells him to just lay back, relax, and let Mom handle this!",
  "genres": [],
  "author": "Alana Church",
  "average_rating": "4.20",
  "url": "https://www.goodreads.com/book/show/35831447-taboo-trysts"
}