{
  "title": "Prophesy",
  "description": "An Enemies to LoversShifter, Vampire True Mates story.Justice Volkov is the youngest Alpha Zenith to ever lead the wolf shifters. Following in his father’s large paw prints was a responsibility he met head on. Now at age thirty-three, he is alpha of the alphas. As a direct descendant of the original Siberian pack, his wolf is bigger and stronger than Justice, himself is sometimes able to control. His wolf howled long and hard but Justice kept it inside. It felt like a bass drum beating against his rib cage. The harsh breaths, angry snarls and the determined pacing inside him was overtaking him.Justice takes his role of leadership and his legacy very seriously. He has little time for romance, not to mention a true mate. His packs are his priority. With a human government trying to regulate them, an uprising of rogue shifters, and a violent team of scientists trying to experiment on them, Justice has his hands way too full. Chadwick ‘Wick’ Bentley is not enthusiastic when the captain of his escort tells him he has to leave his comfortable London home and go back to the States. As the Vampire King, he has no choice but to get his species back in line before they cause anymore chaos. At over one-hundred years old, Wick is no one to trifle with, but his smooth, charismatic manner makes him quite unique, despite the negative reputation vampires have. Wick has had nothing but time up to this point. He doesn’t feel the need to make issues pressing. Nothing is urgent in his life. Until he meets Justice. His beloved.“Natural enemies can’t be mates.” Or so Justice thought. He knows his skepticism and rejection is hurting his mate, so while he fights their connection, Wick gets help from a source very close to Justice to help him win his beloved’s heart. Wick is a force all on his own, but when he’s blessed with a special gift from the Mother herself, not even Justice’s powerful wolf can prevent the prophesy from being fulfilled. This story DOES NOT contain/mention MPREG. No multiple pairings. No cliffhangers. It ends with a very HFN. Warning: This book is MM paranormal: If you DO NOT like hot, alpha men shifting into large wolves, or vampires feeding from their mates, this may not be your read.",
  "genres": [
    "M M Romance",
    "Paranormal",
    "Vampires",
    "Shapeshifters",
    "Fantasy",
    "Romance",
    "Paranormal Romance"
  ],
  "author": "A.E. Via",
  "average_rating": "3.92",
  "url": "https://www.goodreads.com/book/show/35839947-prophesy"
}