{
  "title": "Magium: The Mage Tournament",
  "description": "Barry is an ordinary guy, with no magical powers whatsoever, who dreamed of becoming a mage for the better part of his life. After dedicating his whole life to studying magic, in the hopes of fulfilling his dream, he finally finds a way to do it.  However, in order to become a mage, he must first win a deadly free-for-all tournament against the most powerful mages in the world.  The fantasy world that the story takes place in is inspired by Dungeons and Dragons and by The Lord of the Rings.  The story of Magium starts at the beginning of the tournament, right after Barry and all the other participants are transported to the continent where the contest is taking place.  The tournament takes place on a continent hidden from the rest of the world, where there are mythical creatures like dragons and hydras, but also remnants of an old and technologically advanced civilization, whose magically powered devices are still being used in the present day.  As the series progresses, Barry will meet with other participants, he will make friends and enemies, and he will gradually find out more about the continent he is on, and its inhabitants. He will find out that a person called \"The Creator\" had established several utopias in this place, six hundred years ago, where animals and humans lived in harmony, and food was created through magic. What Barry will get to see through his travels, however, is the downfall of these utopias, some of them being on the brink of destruction. As he begins to get involved with the people of this land, Barry will need to decide if he can simply ignore what is happening before his eyes, or if he will intervene, at the risk of being banned from the tournament, and forfeiting his dream.  Credits for the magic ball image on the cover go to Agnes Landgraf.",
  "genres": [
    "Fantasy",
    "Adventure",
    "Fiction",
    "Choose Your Own Adventure",
    "Epic",
    "Magic",
    "Epic Fantasy"
  ],
  "author": "Chris Michael Wilson",
  "average_rating": "3.97",
  "url": "https://www.goodreads.com/book/show/35831195-magium"
}