{
  "title": "The Sentinels: Tanner",
  "description": "\"You call me a boy again, baby, and I'll be only too happy to show you I'm a man.\" As the president of the Sentinels MC Tanner has his hands full. It's Daytona Beach Bike Week and Daytona is his town. Then trouble by the name of Ruby rolls in, pretty, sassy, and with enough curves to tempt a saint. Well, Tanner isn't a saint, and she's his kind of gal, except his hit it and quit it rule isn't for good girls like Ruby. But then, rules are meant to be broken, aren't they? Excerpt - I heard the distant sound of what I thought was thunder, until it grew closer and I realized that it was actually the rumble of motorcycles coming our way. I expected them to ride on past us, but when they slowed and pulled up behind Pops’ truck I straightened nervously. They weren’t just weekend bikers, I could tell that immediately by the way they were dressed and the air of danger that they exuded. The six men belonged to an honest to goodness motorcycle club, and their worn, leather cuts were decked out in colorful patches and name tags. They looked serious, and mean as hell. As I watched them climb off their large bikes and slowly approach us, I added big and handsome to their description. I glanced at Pops, looking for a sign that he knew these bikers. If he didn’t, I was going back to my car to retrieve my baseball bat out of the back seat. He just smiled and gave me a wink. What was I worried about, anyway? We were on a busy public highway. I took a deep breath, smiled, and said in my usual, cheery tone, “Hi, boys.” I couldn’t tell where their eyes were focused, since they were all wearing dark sunglasses. The man who appeared to be the leader, the hunk wearing the president’s patch, came to a stop a couple of feet away from us. I began to feel self-conscious of my clinging, wet clothes, especially when I felt my nipples turn hard against my thin tee. I crossed my arms, but the quirk of the man’s lips told me that it hadn’t been fast enough. Jerk! “You pickin’ up strays now, Pops?” Ohmygod! The deep, gravelly tone of his voice was sexy as hell, and it did something quirky to my core. The man wasn’t too bad on the eyes, either. He was taller than most, his sun-tanned skin pulled taut over his super hot muscles. He oozed dominance, and the clunky silver rings on his fingers screamed that they were his backup. “’Bout damn time you got here,” Pops grumbled, pushing away from his truck. “And be nice to cutie, here, she stopped to help, and fed me, too.” “Cutie?” Now I knew that his eyes were full on me, and I could tell by the tilt of his head that he was looking me up and down, as if he had the right to. I didn’t like his intimidation tactics, even if his presence was having an unexpected affect on my lady bits, something I’m sure he was accustomed to when it came to the opposite sex. The devil in me prompted me to lower my arms and slap my hands on my curvy hips in a move that I knew was challenging. A big mistake, I knew, when his sexy mouth turned up at both corners. “Looks like a drowned rat to me.” The bikers behind him laughed. “Flattery will get you nowhere,” I responded sarcastically, meeting what I thought were his eyes. I turned my attention back to Pops, putting my hand on his thin shoulder. “Now that your boy is here, I’ll be on my way. It was nice meeting you.” I glanced back at the group of bikers. “Goodbye, boys.” I gave them a wave, eager to be on my way. “Baby--” The sound of his growly voice made me stop in my tracks to look back at him. “You call me a boy again, and I’ll be only too happy to show you that I’m a man.”",
  "genres": [],
  "author": "Tory Richards",
  "average_rating": "4.07",
  "url": "https://www.goodreads.com/book/show/35838880-the-sentinels"
}