{
  "title": "Dating Daisy",
  "description": "What do you do when you're a newly divorced 52 year old mother, keen for a second chance of romance? Why internet dating of course! Daisy Mae_224 embarks on the internet dating process with trepidation. Having not been on the dating scene for nearly 30 years, and with fairly rudimentary computer skills, she finds herself embroiled in a series of haphazard and hilarious situations. Daisy keeps a diary of her internet dating life and reveals detail by detail, the ups and downs of her midlife dating extravaganza. Soon after starting out, Daisy realises her true mission. With no past experience and no-one/nothing to guide her, she needs to produce - Internet Dating lessons. Read on to find out about PLONKERS, muppets and MAWDs, and a whole host of amusing anecdotes, tips and ideas. Working by day as a Sexual Health doctor, the story as it unfolds contains accounts of Daisy's clinical experiences with patients in the Sexual Health clinic. She also reflects on her past life with Voldemort (the dreadful ex-husband). With advice and encouragement from Imogen, her 17 year old daughter, her surrogate parents known as the Amigos, with a big house and swanky swimming pool, her friend Pinkie and from Jeannie, her nonagenarian friend from the Nursing Home, Daisy resiliently persists in her quest to find a long term partner. This is a heartfelt story that will ring bells with anyone who has ended a long term relationship and now wants to find somebody new. It is humorously written, full of emails, poems, limericks, and even a recipe! Daisy can't resist her pages of advice on topics like \"Kissing\" and \"Anti-Snoring.\" It is a unique and highly amusing book, which will make you laugh out loud! So read on and see. Will Dating Daisy find her \"prairie vole?\" Or will the whole process end in disaster?",
  "genres": [
    "Chick Lit"
  ],
  "author": "Daisy  Mae",
  "average_rating": "4.04",
  "url": "https://www.goodreads.com/book/show/35842717-dating-daisy"
}