{
  "title": "The Blood Race",
  "description": "All Ion Jacobs ever wanted was to be normal. But when you’re capable of killing with your very thoughts, it’s hard to blend in with the crowd.\n\n Running from his past and living in fear of being discovered, Ion knows he will never be an average college student. But when Hawk, the beautiful, mysterious girl next door unearths his darkest secret, Ion’s life is flipped upside-down. He’s shocked to discover a whole world of people just like him -- a world in another dimension, where things like levitation, shape-shifting, and immortality are not only possible… they’re normal.Forced to keep more secrets than ever before, Ion struggles to control his powers in the real world while commuting between realms -- until his arch enemy starts a fight he can’t escape. Now he has sealed the fate of the Dimension, severing their connection to the real world, and locking himself inside forever. But a deadly threat hidden in plain sight may cost Ion more than just his freedom -- it may cost him his life.The Blood Race is the first book in K.A. Emmons' riveting new sci-fi/fantasy thriller series. If you like epic urban fantasy, fresh takes on super powers, deep allegories, raw emotions and intricate plots that surprise you at every turn, you'll love the first novel in Emmons' page-turning series. Grab your copy of The Blood Race and delve into a new dimension today!  \n________________________________\n  What Early Readers Are Saying:  \"Unique and brilliant. Everyone needs this book in their lives!\"  \"This novel blew me away.\"  \"By the end of the book you will feel like you just been on a great adventure that just got started.\"  \"This book is very fast paced and filled to the brim with beautifully written descriptions and great characters. Think X-Men meets Miss Peregrine, but in a fresh and exciting new twist. It reminded me of a modern, sci-fi, teenage Narnia.\"  \"If you like thrilling adventure stories with some super powered characters this is for you!!!!\"  \"This is far beyond a good book; this is the best book I’ve ever read!\"  \"THE WRITING STYLE WAS GORGEOUS. I was in awe of the beautiful prose that pulled me into the story and was SO PROFOUND.\"  \"Fans of The Hunger Games and Divergent will be blown away with how K.A. Emmons takes sci-fi/fantasy to the next level!\"  \"It is rare to find YA sci-fi with anything deeper than the surface as far as themes go (at least not good ones) and The Blood Race packed full of meaning and deeper layers while maintaining its integrity as a story.\"  \"After that cliff hanger I'm dying for more!\"",
  "genres": [
    "Fantasy",
    "Science Fiction",
    "Young Adult",
    "Romance",
    "Fiction",
    "Dystopia",
    "Adventure"
  ],
  "author": "K.A. Emmons",
  "average_rating": "3.81",
  "url": "https://www.goodreads.com/book/show/35858210-the-blood-race"
}