{
  "title": "Relentless Pursuit: Inside the Escape from Dannemora New York State's Largest Manhunt",
  "description": "Relentless Pursuit - On June 6, 2015, two convicted killers escaped from New York State's toughest maximum security prison, Dannemora. What followed over the next 23 days, was an unbelievable tale of intrigue, as salacious facts revealed the murderers had seduced a female prison employee into aiding in their plan to escape. Swept up by their artful manipulation, she smuggled hacksaw blades into the prison in frozen hamburger, engaged in sexual conduct with one of the inmates, and schemed to pick them up at midnight as they emerged from a manhole cover outside prison walls, in the heart of the village. To clear the way for their planned escape to Mexico, there allegedly was even talk of murdering her unsuspecting husband, to remove the \"glitch.\" This is the inside story of the terrorized community, the outstanding men and women of law enforcement, and the State Trooper responsible for capturing the inmates. Relentless Pursuit takes the reader inside the investigation of the escape from Clinton Correctional Facility in Dannemora as only the Incident Commander, New York State Police Major (Retired) Charles Guess, can relay it. From start to finish, you are exposed to the sense of urgency, strategy, and tactics employed and experienced by those inside the complex investigation, which captivated national and international attention during the summer of 2015. Guess recounts the professionalism and perseverance of his officers and the contributions of the community, leading to the capture of both fugitives, making you feel as if you were present when a Border Patrol tactical team apprehended Inmate Richard Matt, in a violent encounter along a rural highway and State Trooper Jay Cook captured Inmate David Sweat in an alfalfa field within a stone's throw of the Canadian border. In Relentless Pursuit , you are also led on a brief tour of Guess' remarkable career, spanning more than three decades of law enforcement and military service, recalling the inherent dangers of road patrol, SWAT call outs, SCUBA diving, Aviation, and Troop Command. Although the primary theme of the book is the manhunt, this additional information highlights Guess' extensive background and professional development which prepared the author for what would turn out to be his ultimate, professional challenge, the escape from Dannemora.",
  "genres": [
    "True Crime"
  ],
  "author": "Charles E. Guess",
  "average_rating": "3.87",
  "url": "https://www.goodreads.com/book/show/35869485-relentless-pursuit"
}