{
  "title": "Sketches of a Black Cat - Full Color Collector's Edition: Story of a night flying WWII pilot and artist",
  "description": "(Available in Color or B&W - click both format arrows - or Color Kindle) This beautiful, new FULL COLOR second edition is now one hundred pages longer, filled with additional fresh stories, artwork, photos, and adventures.  Howard Miner never expected to contract the first documented case of the mumps in Guadalcanal history.     As a Navy Black Cat, he took his share of chances during the ten-hour, night long flights in darkened PBYs painted entirely black, searching the seas for enemy ships and downed fliers ~ the original stealth aircrafts.  But wartime was unpredictable, and whether landing on an exotic tropical isle where the women he saw from the air turned out to be topless, or dropping wing tanks containing a strange new substance called “Napalm,” this was clearly a very different world than he had known as a college student in Indiana.  His is a tale of seven buddies, all pilots who flew at night, slept and got into mischief by day, then repeated. Their PBY Catalina odyssey stretched from the Solomon Islands to the northern tip of the Philippines and included a full range of missions, from search, attack, and bombing runs, to daring sea rescues. Howard’s journey through training and tours of duty is skillfully captured in his art and narratives, framing a wartime drama with a personal coming of age story. The descriptive verse from the artist’s viewpoint gives us a creatively told and intriguing portrayal of WWII’s Pacific Theater.   * * * * Miner combines his father's writings and interviews with WWII veterans to craft a loving tribute to the young men who fought in WWII...He does his father and other WWII veterans proud. ~Publisher's Weekly/Booklife  * * * * \"Sketches of a Black Cat\" is a unique and fascinating memoir of a World War II combat aviator ~ with original and previously unpublished sketches and photographs. This artfully crafted book is a must read for anyone in search of a new and completely different view into the world of war in the Pacific and on the home front during America's greatest conflict.\" ~ Larkin Spivey, military historian and author.  * * * * “From boxes of notes and drawings comes a book illuminating a WWII pilot’s experiences as part of the Black Cat Squadron…accounts of support missions, rescues of airmen and interactions with indigenous island peoples told in vivid but unembellished detail…a handsome volume that reads breezily and is punctuated with photos and drawings from Howard’s war years. ~ Mike Francis the Oregonian  * * * * \"Wonderful and beautifully real stories such as this are dying every day as we lose our WWII veterans. Kudos to Ron Miner for preserving and sharing with the rest of us the gold of his father's journals, photos, and drawings to bring us such a compelling look at life during the war. This is not only a valuable and insightful historical document but a dramatic and warm personal story.\" ~ Don Keith, WWII author   * * * * “... Howard Miner’s memoirs are a wonderful view into the world of a patrol squadron at war. Miner sees the war through the eyes of an artist, revealing details of day-to-day life that are often overlooked in war time narratives. A wholly enjoyable story!” ~ Stewart Bailey, Curator, Evergreen Aviation and Space Museum   * * * * \" “As a former flight engineer aboard a PBY in WWII… I can truly say I felt as though I was on Howard’s Catalina…so many similarities to my own experiences.",
  "genres": [
    "History",
    "Memoir",
    "Military Fiction",
    "Biography",
    "World War II",
    "Nonfiction",
    "Aviation"
  ],
  "author": "Ron  Miner",
  "average_rating": "4.54",
  "url": "https://www.goodreads.com/book/show/35847908-sketches-of-a-black-cat---full-color-collector-s-edition"
}