{
  "title": "The Complete Sherlock Holmes: Volume II",
  "description": "The Complete Sherlock Holmes, Volume II, by Sir Arthur Conan Doyle, is part of the Barnes & Noble Classics series, which offers quality editions at affordable prices to the student and the general reader, including new scholarship, thoughtful design, and pages of carefully crafted extras. Here are some of the remarkable features of Barnes & Noble Classics: New introductions commissioned from today's top writers and scholars Biographies of the authors Chronologies of contemporary historical, biographical, and cultural events Footnotes and endnotes Selective discussions of imitations, parodies, poems, books, plays, paintings, operas, statuary, and films inspired by the work Comments by other famous authors Study questions to challenge the reader's viewpoints and expectations Bibliographies for further reading Indices & Glossaries, when appropriateAll editions are beautifully designed and are printed to superior specifications; some include illustrations of historical interest. Barnes & Noble Classics pulls together a constellation of influences—biographical, historical, and literary—to enrich each reader's understanding of these enduring works. The Complete Sherlock Holmes comprises four novels and fifty-six short stories revolving around the world’s most popular and influential fictional detective—the eccentric, arrogant, and ingenious Sherlock Holmes. He and his trusted friend, Dr. Watson, step from Holmes’s comfortable quarters at 221b Baker Street into the swirling fog of Victorian London to combine detailed observation and vast knowledge with brilliant deduction. Inevitably, Holmes rescues the innocent, confounds the guilty, and solves the most perplexing puzzles known to literature.Volume II of The Complete Sherlock Holmes begins with The Return of Sherlock Holmes. Sir Arthur Conan Doyle, tired of writing about Holmes, had killed him off at the end of “The Final Problem,” the last tale in The Memoirs of Sherlock Holmes (found in Volume I of The Complete Sherlock Holmes). Public demand for new Holmes stories was so great, however, that Conan Doyle eventually resurrected him. The first story in The Return, “The Adventure of the Empty House,” features Conan Doyle’s infamously inventive explanation of how Holmes escaped what seemed like certain death.This volume also includes two other collections of Holmes stories, His Last Bow and The Case Book of Sherlock Holmes; Conan Doyle’s final full-length Holmes novel, The Valley of Fear; a pair of parodies, “The Field Bazaar” and “How Watson Learned the Trick”; and two essays about the “private life” of the beloved sleuth.",
  "genres": [
    "Classics",
    "Mystery",
    "Fiction",
    "Short Stories",
    "Crime",
    "Detective",
    "Literature"
  ],
  "author": "Arthur Conan Doyle",
  "average_rating": "4.48",
  "url": "https://www.goodreads.com/book/show/3586.The_Complete_Sherlock_Holmes"
}