{
  "title": "Posies and Poison",
  "description": "When Brenda Sheffield receives the letter from Edward Graham she knows her life will change drastically. She is now the proud owner of Sheffield Bed and Breakfast in the seaboard town of Sweetfern Harbor, willed to her by her uncle Randolph Sheffield. After pursuing a career as an amateur sleuth, she looks forward to the new challenge.  Once she arrives in the picturesque village, the colorful shops and enticing townspeople hold her spellbound. Assured crime never happens in the safest place along the New England coast, she delves into her new career. Brenda learns that not all is as it seems in Sweetfern Harbor. A despicable woman named Lady Pendleton not only owns most of the town, but she also makes it her mission to continue vendettas against everyone by regularly raising rents on businesses and homes. She is known to have ruined people financially more than once.  The day Lady Pendleton’s car comes barreling toward the Sheffield Bed and Breakfast, Brenda watches in horror until it comes to an abrupt stop. When Lady Pendleton does not emerge from the car, Brenda discovers her slumped over the steering wheel. She is pronounced dead by the Coroner and he deems it a homicide. Most of the townspeople become suspects.  The very handsome Detective Mac Rivers enlists Brenda’s help in solving the case. Brenda discovers twists and turns in every tidbit of new information that reaches her. The intertwining of loyalties and fierce protection of one another in Sweetfern Harbor adds to the difficulty in solving the case. On top of that, Brenda must keep focused on the case, and not on Mac Rivers’ charm. Sweetfern Harbor Bed and Breakfast Cozy Mysteries can be read in one to two hours. It is perfect for those moments when you are waiting at an appointment or want to enjoy a quick read.",
  "genres": [
    "Cozy Mystery",
    "Mystery",
    "Cozy",
    "Fiction",
    "Novella",
    "M M Romance",
    "Audiobook"
  ],
  "author": "Wendy Meadows",
  "average_rating": "4.11",
  "url": "https://www.goodreads.com/book/show/35852942-posies-and-poison"
}