{
  "title": "Seaworthy: Adrift with William Willis in the Golden Age of Rafting",
  "description": "Welcome to the daring, thrilling, and downright strange adventures of William Willis, one of the world’s original extreme sportsmen. Driven by an unfettered appetite for personal challenge and a yen for the path of most resistance, Willis mounted a single-handed and wholly unlikely rescue in the jungles of French Guiana and then twice crossed the broad Pacific on rafts of his own design, with only housecats and a parrot for companionship. His first voyage, atop a ten-ton balsa monstrosity, was undertaken in 1954 when Willis was sixty. His second raft, having crossed eleven thousand miles from Peru, found the north shore of Australia shortly after Willis’s seventieth birthday. A marvel of vigor and fitness, William Willis was a connoisseur of ordeal, all but orchestrating short rations, ship-wreck conditions, and crushing solitude on his trans-Pacific voyages.He’d been inspired by Kon-Tiki, Thor Heyerdahl’s bid to prove that a primitive raft could negotiate the open ocean. Willis’s trips confirmed that a primitive man could as well. Willis survived on rye flour and seawater, sang to keep his spirits up, communicated with his wife via telepathy, suffered from bouts of temporary blindness, and eased the intermittent pain of a double hernia by looping a halyard around his ankles and dangling upside-down from his mast.Rich with vivid detail and wry humor, Seaworthy is the story of a sailor you’ve probably never heard of but need to know. In an age when countless rafts were adrift on the waters of the world, their crews out to shore up one theory of ethno-migration or tear down another, Willis’s challenges remained refreshingly personal. His methods were eccentric, his accomplishments little short of remarkable. Don’t miss the chance to meet this singular monk of the sea.",
  "genres": [
    "Nonfiction",
    "Travel",
    "History",
    "Biography",
    "Adventure"
  ],
  "author": "T.R. Pearson",
  "average_rating": "4.17",
  "url": "https://www.goodreads.com/book/show/358702.Seaworthy"
}