{
  "title": "King of Paine",
  "description": "\"Larry Kahn has managed to create a cast of unforgettable characters, throwing in a bit of sex and misadventure, while infusing it with legal, moral, and ethical dilemmas. To say that I thought the King of Paine was brilliantly written would be an understatement. I sat down to read the book in the morning and was unable to put it down until I read the very last page!\" - The Write To Make A Living\"The writing is perfect...Plus, that plot? Holy hell! I never could have seen the twists and turns coming.\" -Owl Tell You About It\"...a roller coaster ride of who done it, oops, no they didn't. But it's not just that, the story makes you think and ask yourself some really important questions.\" - Forbidden ReviewsA desperate patient.A rumored cure.How far would you go to save your own life?King of Paine is a sexy, fast-paced suspense novel filled with characters who grapple with a range of intriguing end-of-life issues while everything they care about is at stake. The story follows two investigations, Special Agent Frank Paine's pursuit of a stalker committing a series of kinky Internet crimes and a reporter tracking the disappearance of wealthy senior citizens across the nation. Both paths lead to a hidden enclave where a brilliant biochemist harbors a deadly secret. Somebody is going to die there, and it may be Frank Paine's soulmate. Or him.Readers who liked The Girl With The Dragon Tattoo or the novels of Greg Iles will enjoy settling in with King of Paine for a sexy, thought-provoking ride.\"I have to admit I've heard the comparison between The Girl and the Dragon Tattoo and King of Paine and in my opinion, Kahn is better. I was never bored, in fact I hung onto every word in this story.\" - Boekie's Book Reviews\"King of Paine is a tautly written, absorbing page-turner. I usually can guess the ending to a police procedural by about the third chapter. This is not the case with Mr. Kahn's wonderful new book...I highly recommend this book.\" - Hampton Reviews\"I seriously think King of Paine is the most canny and intelligent suspense piece I've ever read...It is a medical suspense and legal thriller and contemporary literary sex propaganda all rolled into one. It is [expletive deleted] fantastic, not only for its stunning depth and complexity, but for its all-encompassing message that love, even when all hope is lost, shall prevail, but only if you really try, and only if you are willing to sacrifice all you have now and all you worked for in the past, to make it work out...This book will become your newest obsession as well as your biggest nightmare.\" -Miraculous!",
  "genres": [
    "Fiction",
    "Thriller",
    "Suspense",
    "Mystery",
    "Adult Fiction",
    "BDSM",
    "Action"
  ],
  "author": "Larry Kahn",
  "average_rating": "3.98",
  "url": "https://www.goodreads.com/book/show/12154391-king-of-paine"
}