{
  "title": "Haunted Heart: The Life and Times of Stephen King",
  "description": "Since Stephen King's wife fished his first novel Carrie out of the waste paper basket, King has written more than 50 books, selling 300 million copies worldwide. But who is the man behind those tales of horror, grief, and the supernatural? Where do these ideas come from? And what drives him to keep writing at a breakneck pace after a thirty year career? His impoverished childhood in rural Maine hardly spelled out the likelihood of a blossoming literary career. At the age of four he saw a neighbouring boy get hit by a freight train. At 13, he was sent to his grandmother's room to wake her but instead found her cold, lifeless body. However, his local Bookmobile which visited every week allowed him to take out Edgar Allan Poe and H.P. Lovecraft and he ran through the classics of horror. King's unflagging work ethic and a ceaseless flow of ideas put him on the path to success. It came in a flash, and the side effects of sudden stardom and seemingly unlimited wealth soon threatened to destroy his work and, worse, his life. But he survived and has since continued to write at a level of originality few authors could ever hope to match.Here, for the first time, is the ultimate biography of this prolific and widely-loved writer. From King's childhood to becoming a successful writer, the author has interviewed friends, relatives and stars who know him. She follows the effects of abandonment by his father at an early age ('We were ashamed not to have a father'), and his mom giving him a nickel for every story he wrote. Haunted Heart is the story of one of the greatest horror writers, and his trials both as a young boy and, now 61, an ageing citizen. It covers everything from his love of buying scratch cards to the real-life stories and events that have provided the backdrop to many of his novels. A treat for all fans.",
  "genres": [
    "Biography",
    "Nonfiction",
    "Biography Memoir",
    "Horror",
    "Memoir",
    "Writing",
    "Humor"
  ],
  "author": "Lisa Rogak",
  "average_rating": "4.16",
  "url": "https://www.goodreads.com/book/show/3587176-haunted-heart"
}