{
  "title": "Always",
  "description": "A gripping novel about the kind of love that never lets go, and the heart's capacity to remember, from the New York Times bestselling author of Blackberry Winter and The Violets of MarchEnjoying a romantic candlelit dinner with her fiance, Ryan, at one of Seattle's chicest restaurants, Kailey Crain can't believe her good fortune: She has a great job as a journalist and is now engaged to a guy who is perfect in nearly every way. As she and Ryan leave the restaurant, Kailey spies a thin, bearded homeless man on the sidewalk. She approaches him to offer up her bag of leftovers, and is stunned when their eyes meet, then stricken to her very core: The man is the love of her life, Cade McAllister.When Kailey met Cade ten years ago, their attraction was immediate and intense--everything connected and felt right. But it all ended suddenly, leaving Kailey devastated. Now the poor soul on the street is a faded version of her former beloved: His weathered and weary face is as handsome as Kailey remembers, but his mind has suffered in the intervening years. Over the next few weeks, Kailey helps Cade begin to piece his life together, something she initially keeps from Ryan. As she revisits her long-ago relationship, Kailey realizes that she must decide exactly what--and whom--she wants.Alternating between the past and the present, Always is a beautifully unfolding exploration of a woman faced with an impossible choice, a woman who discovers what she's willing to save and what she will sacrifice for true love.Praise for Always\"[Sarah] Jio's novel is a fantastic read that explores the world of lost love in a poignant and beautiful way, while still being light and easy to digest. The protagonist is one whom readers can relate to. . . . Jio's tale also beautifully blends stories from both the past and the present. . . . It's a great read and comes with high recommendations.\"--RT Book Reviews \"Jio's newest novel explores intersections of past and present and the complexities of love. . . . [Kailey] must confront her own past as she tries to figure out what she really wants. . . . Fans of Jio's work will still find her signature emotional depth.\"--Publishers Weekly\"A heartwarming story of personal growth and the power of nostalgia . . . Fans of Elin Hilderbrand and Emily Giffin should enjoy this warm and compassionate novel.\"--Booklist\"Perfect for fireside reading.\"--PopSugar\"When it comes down to it, Always isn't just one love story. It's layers of love stories to which everyone can relate. Choices, sacrifices, actions, reactions. All lead to true love.\"--Fort Worth Star-Telegram\"This quick beach read will appeal to those seeking a clean romance as well as to fans of Elin Hilderbrand and Karen White.\"--Library Journal \"A beautiful combination of heartfelt struggles, deep connections and social issues that should not be ignored . . . Five stars indeed!\"--Winter Haven Books\"Powerful, heartbreaking, and beautiful.\"--Open Book Society",
  "genres": [
    "Romance",
    "Fiction",
    "Chick Lit",
    "Contemporary",
    "Adult Fiction",
    "Audiobook",
    "Womens Fiction"
  ],
  "author": "Sarah Jio",
  "average_rating": "3.69",
  "url": "https://www.goodreads.com/book/show/35880336-always"
}