{
  "title": "A Good Wife",
  "description": "She faced years of abuse after arriving in Canada as a teenage bride in a hastily arranged marriage, but nothing could stop Samra Zafar from pursuing her dreams At 15, Samra Zafar had big dreams for herself. She was going to go to university, and forge her own path. Then with almost no warning, those dreams were pulled away from her when she was suddenly married to a stranger at 17 and had to leave behind her family in Pakistan to move to Canada. Her new husband and his family promised that the marriage and the move would be a fulfillment of her dream, not a betrayal of it. But as the walls of their home slowly became a prison, Samra realized the promises were empty ones.In the years that followed she suffered her husband’s emotional and physical abuse that left her feeling isolated, humiliated and assaulted. Desperate to get out, and refusing to give up, she hatched an escape plan for herself and her two daughters. Somehow she found the strength to not only build a new future, but to walk away from her past, ignoring the pleas of her family and risking cultural isolation by divorcing her husband.But that end was only the beginning for Samra. Through her academic and career achievements, she has gone on to become a mentor and public speaker, connecting with people around the world from isolated women in situations similar to her own, to young schoolgirls in Kenya who never allowed themselves to dream to men making the decisions to save for their daughters’ educations instead of their dowries.  A Good Wife tell her harrowing and inspiring story, following her from a young girl with big dreams, through finding strength in the face of oppression and then finally battling through to empowerment.",
  "genres": [
    "Nonfiction",
    "Memoir",
    "Canada",
    "Biography",
    "Book Club",
    "Feminism",
    "Biography Memoir"
  ],
  "author": "Samra Zafar",
  "average_rating": "4.41",
  "url": "https://www.goodreads.com/book/show/35887326-a-good-wife"
}