{
  "title": "For The Sake of Heaviness",
  "description": "The story of Metal Blade Records is the story of Brian Slagel-a metal-obsessed Southern California kid who launched a fanzine and landed a record store job before cobbling together what he assumed would be a one-off compilation of fledgling bands from the L.A. scene. Released in 1982, the Metal Massacre LP included the debut recordings of local groups such as Steeler, Malice, Ratt, and Metallica. In the wake of the album's unexpected success Slagel virtually stumbled into creating a proper record label, issuing the first releases by Bitch, Armored Saint, and Slayer the following year.For The Sake Of Heaviness is an inside look at how Brian built Metal Blade from a one-man operation in his mom's non-air-conditioned garage to the preeminent international home of heavy music that it is today. He shares his insights into signing and working with Amon Amarth, Anvil, As I Lay Dying, Behemoth, The Black Dahlia Murder, Cannibal Corpse, Cirith Ungol, Corrosion of Conformity, D.R.I., Fates Warning, Flotsam and Jetsam, Gwar, King Diamond, King's X, Lizzy Borden, Manowar, Mercyful Fate, Overkill, Raven, Sacred Reich, Six Feet Under, Trouble, Unearth, Voivod, Whitechapel, and others.Always hard at work on a diverse range of projects, Brian reveals the early advice he gave that helped guide Mötley Crüe's career; how he helped Metallica replace their bassist-twice; his detailed work on Thin Lizzy and Alice Cooper reissues; his behind-the-scenes role in the careers of Mother Love Bone, Alice in Chains, Faith No More, Goo Goo Dolls, and Lamb of God; and his unlikely ventures with kindred metal heads-from hockey star Ken Baumgartner, to celebrity chef Chris Santos, to The Howard Stern Show's Richard Christy, to comedians Jim Florentine, Don Jamieson and Jim Breuer.Throughout For The Sake Of Heaviness, Brian steps aside to present first-person insights and extended guest interviews featuring friends, colleagues, Metal Blade staffers, and a long list of artists, including Metallica's James Hetfield, Slayer's Kerry King, King Diamond, and many more.Brian highlights the ins and outs of his 35 year metal odyssey, from promoting small shows in California's San Fernando Valley in the early days, to forging a major partnership with Warner Bros. Records; from weathering the Parents Music Resource Center's attempts to regulate lyrical content, to squaring off with Time Warner over Gwar's envelope-pushing themes; from nearly going bankrupt after underestimating the impact of the rise of CDs, to surviving and thriving in today's rapidly changing music business environment.Featuring a Foreword by Metallica's Lars Ulrich, For The Sake Of Heaviness pulls back the curtain to reveal the definitive look at how Metal Blade began, what they've accomplished, and where they're going. With the help of co-writer Mark Eglinton, Brian Slagel invites the reader into a personal conversation about his life's passion, and the passion that drives Metal Blade-finding, exposing, and promoting the best heavy music on the planet.",
  "genres": [
    "Music",
    "Biography",
    "Nonfiction",
    "Audiobook",
    "Autobiography",
    "Pop Culture"
  ],
  "author": "Brian Slagel",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/35888444-for-the-sake-of-heaviness"
}