{
  "title": "Dimensional Adventures With Arabella: A 5th Dimension Butterfly Fairy from The Land of Rom (A Journey to the 4th Dimension Rad Bad Beetle Jamboree)",
  "description": "In the Land of Rom, a 5th dimension Butterfly Fairy named Arabella, lands an assignment on Planet Earth when she gets into trouble playing one too many pranks on her friends.This mission involves a child named, Sophia chosen to be a match for Arabella because she is considered ‘Pure of Heart’. Sophia will teach Arabella valuable lessons in kindness, friendship, loyalty, and compassion resulting in a lifetime bond between the two. Arabella, in turn, will teach Sophia how to establish a meaningful connection to Mother Earth and her creatures.Arabella doesn’t realize it at the time, but her visit will evolve into a series of mystical, dimensional adventures. Because of special 5th dimension rules, Arabella has to wait a year before she can take Sophia on her first dimensional adventure. Instead, the first adventure in this trilogy series, Arabella transports Sophia’s sister, Shelby and her soul mate, Griffin into the 4th dimension bug world to a Rad Bad Beetle Jamboree. Next, they move on to Arabella’s 5th dimension homeland where they meet a wise Wizard who reveals what the children’s purpose is on Planet Earth. The adventures to both dimensions gives the youngsters opportunities to put lessons they learn to test and to develop their young, blossoming love for each other.Secrets are revealed, special friendships formed, and encounters beyond their wildest dreams take place. The children learn, through these dimensional adventures via astral travel, to take command of their part in the deliberate creation process and how to be masters and powerful creators through focused intent. Now aware of these special gifts they own, they learn it is their destiny to be pioneers on Planet Earth and teach other children, by example, these acquired skills.",
  "genres": [],
  "author": "Karen Dowers",
  "average_rating": "4.78",
  "url": "https://www.goodreads.com/book/show/35884596-dimensional-adventures-with-arabella"
}