{
  "title": "To the Bridge",
  "description": "The case was closed, but for journalist Nancy Rommelmann, the mystery remained: What made a mother want to murder her own children?On May 23, 2009, Amanda Stott-Smith drove to the middle of the Sellwood Bridge in Portland, Oregon, and dropped her two children into the Willamette River. Forty minutes later, rescuers found the body of four-year-old Eldon. Miraculously, his seven-year-old sister, Trinity, was saved. As the public cried out for blood, Amanda was arrested, convicted, and sentenced to thirty-five years in prison.Embarking on a seven-year quest for the truth, Rommelmann traced the roots of Amanda’s fury and desperation through thousands of pages of records, withheld documents, meetings with lawyers and convicts, and interviews with friends and family who felt shocked, confused, and emotionally swindled by a woman whose entire life was now defined by an unspeakable crime. At the heart of that crime: a tempestuous marriage, a family on the fast track to self-destruction, and a myriad of secrets and lies as dark and turbulent as the Willamette River.“In To the Bridge, Nancy Rommelmann takes what many consider the most unforgivable of crimes—a mother set on murdering her own children—and delivers something thoughtful and provocative: a deeply reported, sensitively told, all-too-relevant tragedy of addiction and codependency, toxic masculinity, and capricious justice. You won’t be able to look away—nor should any of us.” —Robert Kolker, New York Times bestselling author of Lost Girls: An Unsolved American Mystery “How do you understand the not understandable and forgive the unforgivable? So asks one of the characters in this clear-eyed investigation into something we all turn away from. To the Bridge is a tour de force of both journalism and compassion, in the lineage of such masterpieces as In Cold Blood and The Executioner’s Song. Word by word, sentence by sentence, Rommelmann’s writing is that good. And so is her heart.” —Nick Flynn, PEN/Martha Albrand Award–winning author of Another Bullshit Night in Suck City",
  "genres": [
    "True Crime",
    "Nonfiction",
    "Crime",
    "Audiobook",
    "Mystery",
    "Mental Health",
    "Biography"
  ],
  "author": "Nancy Rommelmann",
  "average_rating": "3.38",
  "url": "https://www.goodreads.com/book/show/35884544-to-the-bridge"
}