{
  "title": "Writings for a Liberation Psychology",
  "description": "\"In your country,\" Ignacio Martín-Baró remarked to a North American colleague, \"it's publish or perish. In ours, it's publish and perish.\" In November 1989 a Salvadoran death squad extinguished his eloquent voice, raised so often and so passionately against oppression in his adopted country. A Spanish-born Jesuit priest trained in psychology at the University of Chicago, Martín-Baró devoted much of his career to making psychology speak to the community as well as to the individual. This collection of his writings, the first in English translation, clarifies Martín-Baró's importance in Latin American psychology and reveals a major force in the field of social theory.Gathering essays from an array of professional journals, this volume introduces readers to the questions and concerns that shaped Martín-Baró's thinking over several decades: the psychological dimensions of political repression, the impact of violence and trauma on child development and mental health, the use of psychology for political ends, religion as a tool of ideology, and defining the \"real\" and the \"normal\" under conditions of state-sponsored violence and oppression, among others. Though grounded in the harsh realities of civil conflict in Central America, these essays have broad relevance in a world where political and social turmoil determines the conditions of daily life for so many. In them we encounter Martín-Baró's humane, impassioned voice, reaffirming the essential connections among mental health, human rights, and the struggle against injustice. His analysis of contemporary social problems, and of the failure of the social sciences to address those problems, permits us to understand not only the substance of his contribution to social thought but also his lifelong commitment to the campesinos of El Salvador.",
  "genres": [
    "Psychology",
    "Nonfiction",
    "Social Justice",
    "Social Work",
    "Counselling",
    "Philosophy",
    "Politics"
  ],
  "author": "Ignacio Martín-Baró",
  "average_rating": "4.55",
  "url": "https://www.goodreads.com/book/show/358721.Writings_for_a_Liberation_Psychology"
}