{
  "title": "Rules to Be Broken",
  "description": "A scandalous lady. A virtuous gentleman. And rules that need to be broken.After a minor faux-pas, DIANA LAWSON finds herself forced into a marriage of convenience in order to save her reputation. However, London society still talks, and no matter how hard Diana tries, the whispers and stares never cease.After her well-respected husband dies in the arms of his mistress, Diana finally resigns herself to her fate and decides to live by her own rules alone.ARTHUR ABBOTT, EARL OF STANHOPE, is a stickler for propriety and has never met a rule he did not feel compelled to uphold. However, when he saves a young widow from a most inappropriate situation, he is drawn into a world quite unlike his own. Convinced that he is only lending a hand out of duty, Arthur agrees to a daring compromise.For Diana to uphold society's rules, Arthur has to break them.Can scandalous and virtuous ever walk hand in hand?This tale by a USA TODAY bestselling author shows that love sometimes takes a detour…but it’ll find you nonetheless.If you like bittersweet stories about a love so deep and compelling that it unhinges your whole world and leaves you reeling, then you’ll love this instalment of Bree Wolf’s emotionally charged Forbidden Love Novella Series. Buy RULES TO BE BROKEN, grab a cup of tea, settle into your favorite reading spot and start this swoon worthy romance now!A Forbidden Love Novella Series#1 The Wrong Brother#2 A Brilliant Rose#3 The Forgotten Wife#4 An Unwelcome Proposal#5 Rules to Be Broken#6 Hearts to Be MendedTo Follow:#7 Winning her Hand#8 Conquering her HeartLove's Second Chance Series#1 Forgotten & Remembered - The Duke's Late Wife#2 Cursed & Cherished - The Duke's Wilful Wife#3 Despised & Desired - The Marquess' Passionate Wife#4 Abandoned & Protected - The Marquis' Tenacious Wife#5 Ruined & Redeemed - The Earl's Fallen Wife#6 Betrayed & Blessed - The Viscount's Shrewd Wife#7 Deceived & Honoured - The Baron’s Vexing WifeMore to follow:#8 Sacrificed & Reclaimed - The Soldier's Daring Widow (Bonus Novella)",
  "genres": [
    "Novella",
    "Regency",
    "Romance",
    "Historical Fiction",
    "Historical",
    "Clean Romance"
  ],
  "author": "Bree Wolf",
  "average_rating": "4.11",
  "url": "https://www.goodreads.com/book/show/35889488-rules-to-be-broken"
}