{
  "title": "Las Vegas Sidewinders Box Set Volume 1: Books 1-3",
  "description": "Are you ready to fall in love... with the Las Vegas Sidewinders?  This box set includes books 1-3 of the Las Vegas Sidewinders series, as well as book 1.5 (Cody's Christmas Surprise, a holiday novella).  \nDominic\n Dom Gianni takes a lot of punishment in the hockey rink, but when he sees Molly McCarran getting beaten up by her husband, he’s ready to throw down his gloves and fight for her. But Molly isn’t about to trust another man—and Dom is already skating on thin ice with his NHL-mandated probation. Besides, how could a hotshot player like Dom really care about a woman so much older than he?  \nCody's Christmas Surprise\n After seven years of an in-name-only marriage, Cody Armstrong is determined to show his wife Size he stuck around for more than the kid. But when someone from the past shows up on Christmas Eve, Cody's big surprise--as well as his marriage--may not make it through the holidays.  \nDrake\n Drake Riser is a tough guy on the ice, but deep down he just wants to settle down. Major Erin Gentry has physical and emotional scars from an IED explosion. When they meet at a masquerade ball, Drake thinks Erin is exactly what he needs, but she thinks she’s too damaged to get involved with the gorgeous hockey hunk. Erin is trying to figure out what happened two years ago and put her demons to rest, while someone from her past is trying to destroy her. Drake is ready to do anything to give them a shot at love, but will they be able to put the pieces together in time to win the face-off--and the game?  \nKarl\n Karl Martennson is 6’4” of Swedish hockey-playing deliciousness who wants something more than a different girl every night. Kate Lansing is a PR whiz with trust issues who has spent her whole life battling her weight. Their one-night-stand has the potential to be more, but Karl’s crazy ex-girlfriend is determined to stop them before they reach the goal. When Karl has to go home to Sweden for a family emergency, his ex makes her move. If Kate can't find a way to trust him, she might find herself permanently benched.  This book contains sexual situations and strong language not suitable for younger audiences.",
  "genres": [
    "Romance",
    "Contemporary",
    "Sports",
    "Amazon",
    "Hockey",
    "Sports Romance",
    "Anthologies"
  ],
  "author": "Kat Mizera",
  "average_rating": "4.45",
  "url": "https://www.goodreads.com/book/show/35901110-las-vegas-sidewinders-box-set-volume-1"
}