{
  "title": "Alex Hope",
  "description": "‘All I could really see were her eyes…and they were exquisite. They were a bright, crystal clear green-yet one had a fleck of brown in it. Her eyes were extraordinary and they were smiling at me warmly.’  When Alex Hope wakes from a car accident, she is a changed woman. Suddenly able to hear the thoughts of everyone around her, she struggles to cope. With part of her thinking she is going crazy and the other part overwhelmed, she decides to go away on holiday. With noise and thoughts consuming her, she travels to the remotest part of Scotland she can find. The trouble is, she doesn’t find what she is looking for. While settling into a cabin in wooded seclusion, Alex hears a distress call. She can hear a woman nearby…and she is in desperate need of help. Alex calls the police for assistance, and despite their disbelief, she leads them to the woods where they find a missing woman buried in a chamber under the ground. As a second woman is discovered deeper down, Alex is whisked away for safety. Stuck with JJ (Jess) Love, a female police detective who works locally, she is taken to a safe house. Alex is thrown by Jess, as she has been dreaming about a woman with green eyes-with unique flecks of brown in. Jess is the woman who has been haunting her thoughts. As the women bond in their close quarters, Alex begins to feel like she was destined to meet Jess. As thoughts and memories of Jess’ past begin to fill her head, Alex is determined to help her. With an attraction building and a murder investigation ensuing, the women are unable to stay away from each other. Alex can’t walk away. Jess has captured her thoughts…and her heart.  Will Alex be able to save Jess? Find out in…Alex Hope.",
  "genres": [
    "Paranormal",
    "Lesbian",
    "LGBT",
    "Thriller",
    "Fantasy",
    "Mystery Thriller",
    "Dark"
  ],
  "author": "A.J. Estelliam",
  "average_rating": "3.87",
  "url": "https://www.goodreads.com/book/show/35898928-alex-hope"
}