{
  "title": "Letters from Jenny: A Historical Novel",
  "description": "History tells us that a big lie, repeated often enough, can begin to sound as if it could be the truth.In her new fiction book, Letters from Jenny, Heidi Laird tells the story of just such a big lie which had a profound influence on world events following the end of the First World That Germany in 1918 had not lost, but actually won the war. It was claimed that \"treasonous elements in Berlin had banded together with an international conspiracy and stabbed Germany in the back\", robbing her of her victory. This lie was repeated over and over until it clouded the thinking of the German population after the end of the war, and many people became convinced that their fledgling democratic republic was weak and corrupt, unable to govern. In the end, a majority enthusiastically welcomed a leader who promised to clean up the corruption, and who told them that they were a superior race, destined to rule the world.The beating heart of the book is a collection of thirty-one letters written by Jenny, a Jewish woman living in Mainz, Germany, to her twin sister Martha on the other side of the Rhine River, in Wiesbaden. In these letters, Jenny's observations record how a large part of the population resists acceptance of the military defeat and the humiliating Versailles Peace Treaty. The deeply engaging descriptions of Jenny's private life reflect how the country endures famine, a pandemic, military occupation, hyperinflation, assassinations, fierce street battles between opposing political factions - crisis after crisis - until the exhausted republic gives itself over to Hitler and his followers. The events of this period come to life in Jenny's riveting letters and convey an intimate sense of how it felt to live through this crucial period in history leading up to World War II.",
  "genres": [],
  "author": "Heidi Laird",
  "average_rating": "4.67",
  "url": "https://www.goodreads.com/book/show/121575280-letters-from-jenny"
}