{
  "title": "Between These Sheets",
  "description": "“I fought one war on the battlefield. Now I fight another in my mind.”  Jay is always on the run—always looking for the next place to start a new life. But no matter how much he moves, he can’t escape the painful memories that haunt him. As he settles into his latest job in the warehouse at a glass bottle factory, he finds himself the target of his co-workers’ teasing. When he takes a stand against one of the bullies, a fight breaks out. His boss, a war vet named Reese, steps in, and Jay accidentally shoves him to the ground, revealing Reese’s prosthetic leg. Jay’s sure he’s gonna lose his job, but he’s blown away when he’s given another shot.  Reese is annoyed by the new guy. Jay is reckless and temper prone. Maybe Reese shouldn't have given him a second chance, but his attitude reminds him of his war buddy—a guy who he cared deeply for and who he lost under tragic circumstances. He just hopes Jay doesn’t let him down.  When an accident in the factory triggers one of Reese’s PTSD episodes, Jay returns the favor by being there for him and keeping anyone else from discovering the incident. Reese wants to move on and forget it ever happened, but Jay won’t let it go. And as much as Reese tries to keep his distance, there’s a heat—a passion—between them that he can’t resist. It leads them to the bedroom again and again, but Reese quickly realizes they’ve ignited more than the sparks they create between the sheets. And despite the tough-guy façade Jay puts on, underneath there’s a soul just as tortured and hurt as he is. He’s starting to fall for Jay, but he knows there’s a dark storm lurking in the back of his own mind—a storm that will return one day and destroy the beautiful connection they share.  Between These Sheets is a standalone romance novel with no cheating, no cliffhangers, and a happy ending.",
  "genres": [
    "M M Romance",
    "Romance",
    "Military Fiction",
    "Contemporary",
    "Disability",
    "LGBT",
    "Audiobook"
  ],
  "author": "Devon McCormack",
  "average_rating": "3.98",
  "url": "https://www.goodreads.com/book/show/35900340-between-these-sheets"
}