{
  "title": "Sugarbabe",
  "description": "Attractive, professional, well-spoken, well-dressed 35-year-old woman seeks sugar daddy. I live in Darlinghurst on a 17th floor unit with fantastic skyline views to the harbour. The unit also features very discreet and secure undercover guest parking. I am looking for exclusivity so will (theoretically) be available to you 24 x 7. I am single and don't have any children. I am also a fabulous cook and can provide gourmet meals should you require them. I am a qualified psychologist so I make an excellent listener, and I have a great love of conversation. I have also worked for many years in public relations so am a clever, charming companion in just about any situation. I love sex. I will require a generous weekly allowance in return for all of the above Holly Hill (pseudonym) gave up her job at the behest of her wealthy boyfriend - and then found herself dumped and penniless. After spending six weeks in bed pining for her lost love, she was encouraged by a friend to be 'open-minded' about her career choices - and ended up placing an online ad for a sugar daddy. She received an almost overwhelming response from all sorts of men, but most of them were married men whose wives had lost interest in sex. As Holly interviewed the men and settled on a candidate, she decided to record what happened next. Those almost-daily observations became a journal documenting Holly's extraordinary experiences - not just the men she meets, but the things she finds out about marriages, in particular, and what men need from them. SUGARBABE is her real-life account of the emails, meetings, employment of and interactions with the applicants for the role, and the five men she eventually chooses (not all at the same time!). It is by turns funny, enlightening, challenging and thought-provoking.",
  "genres": [
    "Nonfiction",
    "Memoir",
    "Biography",
    "Chick Lit",
    "Sexuality",
    "Biography Memoir",
    "Psychology"
  ],
  "author": "Holly Hill",
  "average_rating": "3.05",
  "url": "https://www.goodreads.com/book/show/3590229-sugarbabe"
}