{
  "title": "Porter",
  "description": "From New York Times, USA Today, and Wall Street Journal best-selling author of The Beauty Series comes the Men of Lovibond––a series of standalone novels.  Craft beer and the sexy men who brew it.  My employee’s daughter. The tomboy. The kid who once did odd jobs around the brewery. That’s all she was… until three years passed and she walked into my office for an interview.  Frankee Dawson is no longer that girl I once called Kiddo. She’s grown into a beautiful, sexy, desirable woman. Very desirable. And that’s a problem. She’s my employee’s daughter. Lovibond family. And too young for me. Too innocent.  I want to feel her respond to my kiss.  I want her body to tremble as she anticipates my touch.  I want to learn all the places that bring her pleasure.  But mostly I want her to know that she’s never truly been loved by a man until me.  Frankee is my intern and under me for the summer. Literally. It’s a difficult secret to maintain when you can’t keep your hands off each other.  This was supposed to be a hot summer fling. Sex and fun without commitment. That’s what we called it. But we were wrong. This is more. I’ve never felt this way about a woman. Never cared more about someone else’s happiness more than my own.  I love her. And I’m happy, so damn happy… until a terrible mistake from my past springs forward and threatens to rip us apart.  There are a million reasons for her to leave me. And trust me, she should. But all I really need is one good reason for her to stay.   ***Note from Georgia—Porter is one of three books in the Men of Lovibond collection. Each novel will feature a different couple and can be read as a standalone. HEA. No cheating. No cliffhangers.",
  "genres": [
    "Romance",
    "Contemporary Romance",
    "Contemporary",
    "Audiobook",
    "Erotica",
    "Adult",
    "New Adult"
  ],
  "author": "Georgia Cates",
  "average_rating": "4.13",
  "url": "https://www.goodreads.com/book/show/35905919-porter"
}