{
  "title": "Irish War Cry",
  "description": "CRAP IN A CAULDRON. What if you woke up tomorrow to find you're no longer human?New York Times bestseller, Victoria Danann, author of Best Paranormal Romance Series the past four years in a row, continues the fast paced and breathlessly sexy adventures of D.I.T.Rosie hired Irish elf twins, Sheridan and Shivaun O'Malley for the newly formed Department of Interdimensional Trespass. They were wild and nearly feral, raised in the New Forest Preserve with no contact with the modern world until Black Swan made them the only female hunters other than Lady Elora Laiken.When Sher was assigned as Finngarick's partner, they were both stunned to find they weren't only partners, but fated mates. Blissful fated mates who enjoyed each other for the span of less than a month before Sher was abducted by one of the very demons they hunted.Meanwhile, the \"Wild Bunch\", Black Swan's new nickname for Rosie's hunters, has its own problems.Click to PREORDER YOUR COPY TODAY!\nEXCERPT...\nOne by one the hunters began to notice little changes. The day to day change was so minute and so gradual that they didn’t notice until the effect was smack-you-in-the-face cumulative. One day after a hot shower Torn swiped at the fog that had formed on the bathroom mirror. It was steamy enough in the room that it formed again almost as fast as he wiped it away. But something out of place caught his eye. He leaned, turned the towel to a dryer spot, swiped again, and… there it was. He stepped back like he’d been stung. Then looked around knowing full well that he was alone. There was no question about it. He was still himself, just more. His hair had always been on the darker side of ginger with overtones of light brown, but what he was seeing in the mirror was the deep crimson color of red maple leaves in autumn. He toyed with the idea that he might be playing mind games with himself, but no. His eyes were unmistakably a new value of blue. The color wasn’t darker. Just more intense. His skin looked luminous, also flawless. He checked the inside of his forearm where he’d been slashed deep with a broken bottle in a bar fight. No scar. Likewise he ran a hand over the slightly raised scar that had run crisscross across his abs for the past seven years, thanks to a vamp with too-long nails. Raif’s wife, before she was his wife, had suggested scar-reduction cream, but he’d never really seen the point of trying to disguise the physical events that punctuated his experience. He ran his hand over his torso again. Moot point.The skin was smooth and perfect as a newborn baby. Not a freckle or pore or blemish to be found. Anywhere. Much less scarring.He dressed quickly and headed downstairs.Shy and Deck were in the breakfast room. Not eating breakfast.“How long has it been since you’ve eaten?” he asked.“What?” Shivan said looking over at Declan. “Why are you asking?”“Just answer.” Torn insisted. “Did you have breakfast?”“No, I…”, said Shy.“Supper last night?”“No,” she answered.“Lunch yesterday?”“What are you getting at, Torn?” Declan interjected, beginning to look uncomfortable with the direction of the questioning.Torn turned his attention to Deck. Decklan had the dark hair and blue eyes of his ancestors, the Fingal. He didn’t get much of a tan herding reindeer. And he certainly didn’t spend time in the sun in Ireland. Yet there he sat with smooth and perfect skin bearing the warm glow of tan that Torn knew was the stuff of sexual magnetism. “Been sun bathing, Deck?”“You sleep walking, Finngarick? Your questions are…”“Disturbing?” Torn said.“I was going to say haywire,” Deck finished.“Call it what you want. Fact remains we’re changed. Look at your partner. Her hair has turned red in a way that does no’ happen in nature. And her eyes. She did no’ used to have those gold flecks in her eyes.” Torn felt a twinge in his heart wondering if Sheridan was changing as well. Would she look different when she was returned?Shivaun picked up a lock of hair that had fallen forward over her breast and raised it to eye level. After examining it, she turned to study Deck. “You do look more…”“Yeah?”She shook her head and made a helpless gesture with her hands. “More.”“I look more more?” Deck asked. “Well, now that that’s cleared up. Let’s go to work.” Deck stood up.“No’ so fast,” Torn said. “I’m no’ done.”“I say you are.” Declan seemed ready to change the subject. But Finngarick was determined to finish what he’d begun and let it be known, partly by the steady gaze he leveled at Deck and partly by the fact that his tone of voice said he’d made up his mind “No. I’m no’.”“Wait,” Shy said. “Let’s have a listen. I want to hear this.”Deck sat back down and crossed his well-muscled arms over his abs. “I guess you have the floor, brother.”“You can be in denial if you want, Deck. But somethin’ has happened. We’re changin’. You’re no’ eatin’. When was the last time you slept?” Deck and Shivaun both stared at Torn like they were afraid of what he was going to say next. When they pulled their gaze away they gave each other a worried glance. “What are ye sayin?” Shivaun asked.“We’re no’ sleepin’, eatin’, drinkin’, and we look different, but that’s no’ all. We’re fast.”“Well, of course we’re fast. Black Swan doesn’t take on little old ladies to be hunters,” Deck said.Torn nodded. “You have no’ noticed that we’re movin’ faster in the passes.”“Practice. That’s all,” Deck said. “We’re gettin’ better.”“Yeah. We’re gettin’ better because we’re becomin’ something else. Or maybe we already are something else.”Deck frowned. “Like what? Just say what’s on your mind.”Torn shook his head. “Nothin’ doin’. I want you to name it.”“Name what?”",
  "genres": [
    "Paranormal Romance",
    "Fantasy",
    "Paranormal",
    "Urban Fantasy",
    "Romance",
    "Demons",
    "Vampires"
  ],
  "author": "Victoria Danann",
  "average_rating": "4.49",
  "url": "https://www.goodreads.com/book/show/35902236-irish-war-cry"
}