{
  "title": "Broken",
  "description": "Official Description: Job has cut himself off from his heart since he ran away from home at sixteen. After his best friend committed suicide he realized the risk was too great. Only Lucy, Chloe, Oscar and Charlie, his stray kittens seem to be able to break through the walls he has built.Charles is getting over the death of his first love from cancer. He promised Danny he wouldn't stay broken forever but has had a hard time following through. Could the guy he sees feeding stray kittens near his apartment every night be the one to heal his broken heart? Could he be the one to break down Job's walls? Find out if these two men will be Broken forever or if perhaps love can heal them.Original Prompt:Dear Author,I want to know more about this modern day Job. His tattoos represent milestones in a rough and largely unkind life that have aged him beyond his 28 years. Buried under a surface of scars, dirt and grime \"Job\" retains a gentleness few people ever witness. Tell me about his life;about his tattoos. What special someone is helping him overcome his past? Who is he sharing the names of his feline friends with?Photo Description: A man wearing jeans and a worn out button up work shirt which is half open sits on a wooden porch. He gently holds four kittens in his arms as they attempt to explore. He has many tattoos over his chest and arms and from the look of him you can tell he has had a hard life.This story was written as a part of the M/M Romance Group's \"Hot Summer Days\" event. Group members were asked to write a story prompt inspired by a photo of their choice. Authors of the group selected a photo and prompt that spoke to them and wrote a short story.Download the story, read it here or find it in Don't Read in the Closet, Volume 4.__________Genre: contemporaryTags: gay m/m, tattooed men, men with pets, hurt/comfort, first time/virginal, tear jerkerWord Count: 8,729",
  "genres": [
    "M M Romance",
    "Romance",
    "Short Stories",
    "Contemporary",
    "LGBT",
    "Fiction",
    "Erotica"
  ],
  "author": "Kathleen  Hayes",
  "average_rating": "3.25",
  "url": "https://www.goodreads.com/book/show/12158092-broken"
}