{
  "title": "A Brief Stay at Earth Human Camp",
  "description": "Age Level: 11 and up Grade Level: 5 and up\nOnce you find out your mother is an alien, what ISN’T possible?\nThat’s what 12-year-old Anne and 10-year-old Atticus Reade want to know. Minutes after learning their mother is a Farbookonian human, not an Earth human — making them half-alien — they’re whisked off to sleep-away camp in New Jersey for protection, each with a tiny Globot on one shoulder.They do their best to fit in at camp, but their sheltered existence in the Midwest didn’t prepare them for this. Everything is new to them, and at every step, their unpredictable Farbookonian talents threaten to give them away.Just as they settle in, a broadcast on the Rec Hall TV shakes things up, and they begin to see what’s truly strange about camp. As they race to solve a mystery involving ghost stories, quirky campers, a bizarre camp director, and a secret connection they share with their friends, only one thing is clear: They’re not safe. Can the things that make Anne and Atticus different help them survive?Is this book for me?A Brief Stay at Earth Human Camp is a sci-fi, coming-of-age, mystery adventure! Author Marie C. Collins places relatable characters with alien abilities in a realistic setting that grows increasingly ominous as the story progresses. Reviewers recommend her to readers who enjoy the works of Roald Dahl, Rick Riordan, & J. K. Rowling.If you like stories that transform the ordinary into the extraordinary ... if you like characters that remind you of your friends ... if you like mysteries that keep you guessing until the final pages ... this book is for you.Book 2, The Quest for Normal, is due out soon. To stay informed about the series, sign up for emails on the series website (http://SecretsofFarbookonia.com) and “like” the series Facebook page (https://www.facebook.com/SecretsofFar...).Approximately 110,000 words / 383 pp. print length",
  "genres": [
    "Science Fiction"
  ],
  "author": "Marie C. Collins",
  "average_rating": "4.23",
  "url": "https://www.goodreads.com/book/show/35914042-a-brief-stay-at-earth-human-camp"
}