{
  "title": "Windows 10 In Depth",
  "description": "This edition covers the Fall Creators Update to Windows 10.Do more in less time!Experienced with Windows? Don't let Windows 10 make you feel like a beginner again! This book is packed with intensely useful knowledge, tips, and shortcuts you just won't find anywhere else. It's the fastest, best way to master Windows 10's full power, revamped interface, and new tools―from the reconfigured Start menu to the Cortana personal assistant. This friendly, expert guide will make Windows 10 way more productive, painless, and fun, whether you're running it on a computer or a tablet…at home, at work, on the road, anywhere! · Take a quick guided tour of everything that's new in Windows 10 · Get the most out of Edge, Microsoft's modern web browser · Navigate the Windows 10 interface (and customize it to make yourself more comfortable) · Discover hidden shortcuts and timesavers you'd never find on your own · Quickly locate and use files, media, apps, websites, and management tools · Connect reliably and safely to networks, the Internet, and Wi-Fi hotspots · Increase your efficiency by taking advantage of Windows 10's virtual desktops · Maximize the performance and reliability of your hardware and storage devices · Set up a safe and effective network for your home or office · Systematically protect yourself from viruses, spyware, snoops, fraud, and spam · Use the most convenient and efficient interface for every keyboard, touch, pen, or voice · Discover tweaks and customizations that are actually worth the effort · Get more out of your Windows 10 laptop or tablet on the road · Remotely use your Windows 10 computer and data from anywhere on earth · Access even more power with Windows 10's command-line utilities · Use Hyper-V, the subsystem for Linux, and Windows containers to run other operating systems alongside Windows · Troubleshoot the most common Windows 10 problems―and the toughest onesContent Updates CompleteThis title is no longer part of the Content Update Program. The content is final, and no further updates will be released.",
  "genres": [],
  "author": "Brian Knittel",
  "average_rating": "4.45",
  "url": "https://www.goodreads.com/book/show/35926641-windows-10-in-depth"
}