{
  "title": "The Secrets Between Us",
  "description": "“ A  powerful, urgent novel that wields issues of gender and class like a blade. . . . This intergenerational novel asks hard questions about who we are, who we can become, and what awaits on the other side of our becoming. Thrity Umrigar is known as a bold and generous writer, and  The Secrets Between Us  only further establishes her reputation.”  — Wiley Cash, author of  The Last BalladBhima, the unforgettable main character of Thrity Umrigar’s beloved national bestseller  The Space Between Us , returns in this triumphant sequel—a poignant and compelling novel in which the former servant struggles against the circumstances of class and misfortune to forge a new path for herself and her granddaughter in modern India. Poor and illiterate, Bhima had faithfully worked for the Dubash family, an upper-middle-class Parsi household, for more than twenty years. Yet after courageously speaking the truth about a heinous crime perpetrated against her own family, the devoted servant was cruelly fired. The sting of that dismissal was made more painful coming from Sera Dubash, the temperamental employer who had long been Bhima’s only confidante. A woman who has endured despair and loss with stoicism, Bhima must now find some other way to support herself and her granddaughter, Maya. Bhima’s fortunes take an unexpected turn when her path intersects with Parvati, a bitter, taciturn older woman. The two acquaintances soon form a tentative business partnership, selling fruits and vegetables at the local market. As they work together, these two women seemingly bound by fate grow closer, each confessing the truth about their lives and the wounds that haunt them. Discovering her first true friend, Bhima pieces together a new life, and together, the two women learn to stand on their own. A dazzling story of gender, strength, friendship, and second chances,  The Secrets Between Us  is a powerful and perceptive novel that brilliantly evokes the complexities of life in modern India and the harsh realities faced by women born without privilege as they struggle to survive.",
  "genres": [
    "Fiction",
    "India",
    "Historical Fiction",
    "Audiobook",
    "Literary Fiction",
    "Book Club",
    "Asia"
  ],
  "author": "Thrity Umrigar",
  "average_rating": "4.50",
  "url": "https://www.goodreads.com/book/show/35959168-the-secrets-between-us"
}