{
  "title": "Vindicating Lincoln: Defending the Politics of Our Greatest President",
  "description": "Was Abraham Lincoln a racist, as some critics would have us believe? Was he the father of big government, as some others maintain? Was the sixteenth president a traitor to the cause of free society and constitutional government? Are the political principles that guided him relevant today?In this provocative and timely book, Thomas L. Krannawitter sets out to defend the man many consider to be our greatest president from critics on both the left and the right. For although public opinion polls tend to rank Lincoln among the country's most venerated presidents, he is also, paradoxically, the president who is least understood. While Lincoln's name is frequently invoked in contemporary American politics, few Americans understand or agree with the moral and political principles for which Lincoln gave his last full measure of devotion.Many influential authors view Lincoln as an antiquated monument, a man of his age who knew only nineteenth-century prejudices and lacked twenty-first-century enlightenment. Other writers denounce Lincoln as a tyrant who trampled upon the Constitution and states' rights, and thereby inaugurated big government and the kind of politics feared by the Founding Fathers.Krannawitter argues that both views spring from a misunderstanding of Lincoln. Today, at precisely the moment when America is most in need of his moral and political understanding, we are more removed from Lincoln's thought than ever before.Vindicating Lincoln reintroduces us to Lincoln the statesman, the man who defended our greatest ideals of freedom and equality at the darkest moment in American history. Krannawitter shows us why it is in our interest not only to learn about Abraham Lincoln, but to learn from him—to understand that Lincoln's guiding principles were true not only for his time, but that they remain true for ours as well.On the eve of the bicentennial of his birth in 2009, Lincoln can offer moral and political guidance to us all.",
  "genres": [
    "History",
    "Biography",
    "Politics",
    "American History",
    "Historical"
  ],
  "author": "Thomas L. Krannawitter",
  "average_rating": "4.08",
  "url": "https://www.goodreads.com/book/show/3595853-vindicating-lincoln"
}