{
  "title": "Everything You Love Will Burn: Inside the Rebirth of White Nationalism in America",
  "description": "The dark story of the shocking resurgence of white supremacist and nationalist groups, and their path to political power\n\nSix years ago, when Vegas Tenold began reporting from the inner circle of three white power groups in America -- the KKK, the National Socialist Movement, and the Traditionalist Workers Party -- he found himself in the midst of small, disorganized groups operating well outside the mainstream. But in the last few years, that has all changed. Their racially-motivated violence has been on open display at rallies in Charlottesville, Berkeley, Pikesville, Phoenix, and Boston. In response to economic grievances, anger over the presidency of Barack Obama and the visibility of Black Lives Matter, and egged on by the rhetoric of Donald Trump, membership is rising and national politicians are giving validation to these groups. One young man has emerged as a powerful figure: Matthew Heimbach of the Traditionalist Workers Party, who was once labeled the \"Little Führer\" by the Southern Poverty Law Center. Heimbach believes that cross burning and fight-ridden conventions are a waste of time. He understands political power, and has organized a coalition of white nationalists to bring these groups into the mainstream. Everything You Love Will Burn gives readers a front-row seat at violent white supremacist conventions, newly formed separatist communities, and backroom meetings with Republican operatives. We meet a neo-Nazi lieutenant and his daughter in Brooklyn's Sheepshead Bay; a bubbly, twenty-something Klanswoman in Tennessee; and a solemn skinhead recruit in Georgia, and learn about why they've tied their fates to these movements. By turns frightening and fascinating, Everything You Love Will Burn shows us the future of hate in America.",
  "genres": [
    "Politics",
    "Nonfiction",
    "History",
    "Race",
    "Audiobook",
    "Sociology",
    "American History"
  ],
  "author": "Vegas Tenold",
  "average_rating": "3.79",
  "url": "https://www.goodreads.com/book/show/35959824-everything-you-love-will-burn"
}