{
  "title": "The Black Kachina",
  "description": "In the desert badlands of Southern California, Air Force Colonel Maggie Black loses a cruise missile equipped with powerful explosives, reporter Jordan Scott returns a dead shaman’s magic basket, and a bitter half-breed named Asdrubal Torres hears the Great Spirit tell him to refill Lake Cahuilla, an ancient sea that once covered much of California. Colonel Maggie, by losing a powerful weapon, and reporter Scott, by restoring the local tribe’s enchanted basket, provide Torres with exactly the tools he needs. Now Maggie and Jordan race against time, the desert, and Torres’s cunning plan to stop a devastating flood designed to kill tens of thousands.Praise for THE BLACK KACHINA: \"Jack Getze's newest novel, The Black Kachina, marks the arrival of a new star in the international thriller pantheon. Move over, Jack Reacher and make a place at the table for Colonel Maggie Black and her Robin, journalist Jordan Scott. Getze has just hit it out of the park, a gargantuan tape-measure of a clout with this, his best novel to date. My hope is that he's hard at work writing the second of what is sure to be a hugely-successful series. Movie people should be all over this one.\" --Les Edgerton, author of The Bitch, The Rapist, The Genuine, Imitation, Plastic Kidnapping, Lagniappe and others  \"With an intriguing mix of Native American folklore and the latest in leading edge weapons technology, Jack Getze takes you on a journey that has possible written hard across the storyline. A thriller that chills. He asks what if a lethal weapon fell into the hands of someone who was obsessed with fulfilling the wildest wishes of his ancestors? Then he throws together a local reporter and a rebellious ace flyer and sets them both against a clock that is racing towards one of the worst disasters in the history of America.\" --Gordon Brown, author of four crime thriller novels set in Scotland and the US and a co-founder and director of the crime writing festival Bloody Scotland  \"The Black Kachina shows Jack Getze is not a one-trick pony. A major departure from his Austin Carr series--which is also excellent--with all the elements required to be a mainstream bestseller.\" --Dana King, Shamus-award nominated author of Resurrection Mall  \"Getze has that uncommon ability of being able to tell a hell of a story with just the right amount of dark humor. Always a winner!\" Terrence McCauley, award-winning author of The James Hicks Series \"It's a daunting task to keep a story complex and suspenseful while making the key players come across so colorful and convincing. Jack Getze makes it seem effortless.\" --Erin Williams, The Paperback Stash",
  "genres": [],
  "author": "Jack Getze",
  "average_rating": "4.50",
  "url": "https://www.goodreads.com/book/show/35955407-the-black-kachina"
}