{
  "title": "Checking Out: How Searching More and Checking Less Can Save You From Your Smartphone",
  "description": "What if there were one simple technique that could totally transform the way you use your phone? Relying on the research of brilliant behavioral psychologists and cultural anthropologists, Jeremiah Overland has discovered that there is one. What is this technique, you might ask. Stop checking your phone, full stop.As the number of smartphone users worldwide pushes past the staggering 2 billion mark, it is no surprise that smartphone addiction is becoming a serious problem.Various solutions have been offered in an attempt to overcome this problem. Some of the more common include 'unplugging' (a type of digital detox), buying 'dumbphones' and using time monitoring apps. These certainly have their place as we learn to engage with technology here in the twenty-first century. But in my experience, used on their own, these are not effective long-term solutions.Instead of abandoning technology or getting an app to teach us how to use our other apps we need a new approach, one that seeks to address the root of the we have become passive in our usage of technology. We have allowed technology to shape the future of our humanity instead of drawing on our humanity to shape the future of our technology.In order to reverse this situation we must turn to that uniquely human capacity and wisdom.As I researched and analyzed how we use our online devices, and strenuously sought to overcome the addiction in my own life, I realized just how powerful and effective wisdom can be when applied to smartphones.The result of my search (Checking Out) is an approach that is clear, actionable, and above all, human. What's more, it works.To lay out the BIG IDEA of the book we might say that it comes down to a simple the distinction between searching and checking.Searching is when you bring a specific goal or purpose to your smartphone every time you use it -- you never unlock your screen without first knowing what you want to accomplish on your phone.Checking is the opposite. Checking is the act of pulling out your phone whenever you are bored and simply looking for something new or interesting to read, watch or listen to.I have applied this distinction to smartphone use with rigour in my own life and have achieved extraordinary results. In the pages of this book I will share how this approach saved my life and how it can save yours too.Finally, overcoming smartphone addiction is not an end in itself. Rather, it is a necessary step on the road to success, happiness and freedom. And so the approach detailed in this book is not simply about eliminating something bad, but also about replacing it with something a new life with many new possibilities.",
  "genres": [
    "Philosophy"
  ],
  "author": "Jeremiah Overland",
  "average_rating": "3.93",
  "url": "https://www.goodreads.com/book/show/35959418-checking-out"
}