{
  "title": "Fat White Vampire Blues",
  "description": "Jules Duchon was a real New Orleans vampire. Born and bred in the working-class Ninth Ward, bitten and smitten with the Big Easy. Driving through the French Quarter, stuck in a row of bumper-to-bumper cars that crept along Decatur Street like a caravan of bone-weary camels, Jules Duchon barely fit behind the steering wheel of his very big Cadillac taxicab. Even with the seat pushed all the way back.Damn, he was hungry.Jules stopped his cab, pressed the wobbly rocker switch that jerked the electric windows reluctantly to life, and stuck his head into the humid night air. “Hey, baby. You interested in some dinner?”–from Fat White Vampire Blues\n\nVampire, nosferatu, creature of the night–whatever you call him–Jules Duchon has lived (so to speak) in New Orleans far longer than there have been drunk coeds on Bourbon Street. Weighing in at a whopping four hundred and fifty pounds, swelled up on the sweet, rich blood of people who consume the fattiest diet in the world, Jules is thankful he can’t see his reflection in a mirror. When he turns into a bat, he can’t get his big ol’ butt off the ground. What’s worse, after more than a century of being undead, he’s watched his neighborhood truly go to hell–and now, a new vampire is looking to drive him out altogether. See, Jules had always been an equal opportunity kind of vampire. And while he would admit that the blood of a black woman is sweeter than the blood of a white man, Jules never drank more than his fair share of either. Enter Malice X . Young, cocky, and black, Malice warns Jules that his days of feasting on sisters and brothers are over. He tells Jules he’d better confine himself to white victims–or else face the consequences. And then, just to prove he isn’t kidding, Malice burns Jules’s house to the ground. With the help of Maureen, the morbidly obese, stripper-vampire who made him, and Doodlebug, an undead cross-dresser who (literally) flies in from the coast– Jules must find a way to contend with the hurdles that life throws at him . . . without getting a stake through the heart. It’s enough to give a man the blues.",
  "genres": [
    "Horror",
    "Vampires",
    "Fiction",
    "Fantasy",
    "Humor",
    "Paranormal",
    "Urban Fantasy"
  ],
  "author": "Andrew   Fox",
  "average_rating": "3.44",
  "url": "https://www.goodreads.com/book/show/359495.Fat_White_Vampire_Blues"
}