{
  "title": "Death of the Rising Sun: A Search for Truth in the JFK Assassination",
  "description": "This is the printed paperback edition, an updated one from the ebook, which was first published in 2016 and most recently updated in 2022. Ranked among GoodReads' Best True Crime, Best History Books, and Best Non-Fiction Books of the 21st Century lists. Amazon Best Seller in Presidents Category in 2017.While numerous books cover the 1963 crime-of-the-20th-century from a conspiracy or lone-assassin viewpoint, this work by veteran journalist Kevin James Shay presents new and old facts objectively to allow readers to better understand what happened. This compelling narrative is infused with behind-the-scenes details that have been brought to light in recent years through fresh government documents and other sources.The book includes facts related to plots against Kennedy that occurred in Chicago, Tampa, and other cities shortly before the November 1963 assassination. For instance, suspect Thomas Vallee was arrested right before Kennedy was to visit Chicago on November 2, matching some of the same characteristics as Lee Harvey Oswald. New government documents also detailed many other threats, such as statements shortly before JFK's assassination by a CIA courier on how Kennedy and his presumed assassin would both be killed. Another aspect not covered in most books is the involvement of Willie Somersett. The Klan leader opposed the racial violence in the 1960s to the point that he risked his life exposing and helping to prevent it as a government informant. He likely helped save and prolong the Kennedys' and King's lives.Finally, this book shows how some justice in the case has been served. Several prime suspects in the Mafia, CIA, and Cuban community received prison sentences for other crimes, similar to how gangster Al Capone was imprisoned for tax evasion.Shay grew up in Dallas and has researched the tragedy since 1978. He witnessed President John F. Kennedy's funeral in Washington, D.C., where he was born on JFK's birthday. He first became interested in the case when eyewitness Bill Newman entered his college newspaper office and led him on a search.",
  "genres": [
    "True Crime"
  ],
  "author": "Kevin James Shay",
  "average_rating": "3.33",
  "url": "https://www.goodreads.com/book/show/35967018-death-of-the-rising-sun"
}