{
  "title": "Ghosts of Iwo Jima: A story about battles, ghosts, and two very special dogs",
  "description": "Ghosts of Iwo Jima is a realistic and historically accurate novel about a group of dedicated searchers who travel to the island of Iwo Jima with two remarkable dogs to recover the remains of five young Marines missing for over seventy years. The story blends three fiction genres; there are realistic scenes of combat, and there are ghosts, but Ghosts of Iwo Jima is primarily a dog story.   The plot revolves around four main characters: Gunny, a Golden Retriever search dog who leads the effort to find the missing men; Robby Durance, a young Marine who overcomes his fear and lives up to the legacy of his gallant ancestors, and dies on Iwo Jima; Sam Webber, Gunny’s handler; and, Luke, a retired Military Working Dog, who, along with his handler, Steve Haney, is responsible for clearing the search area of unexploded ordnance.   Overcoming some initial skepticism especially from the forensic anthropologist on the team, Gunny and Luke quickly demonstrate their value, but this proves to be the least of their problems. Shortly after the searchers arrive on Iwo Jima they begin to realize that not all of the twenty six thousand young men who died violent deaths there are content to rest peacefully. The team is caught in the middle when two old enemies compete to influence the outcome of their mission. One of the spirits, a Japanese demon, focuses his murderous rage on Gunny, and Luke must risk his own life to save his friend.   Ghosts of Iwo Jima proceeds in a series of scenes alternating between depictions of combat on Iwo Jima, the search for the remains of the five Marines, and the backstories of the major characters. These backstories include true to life accounts of K9 search and rescue and Military Working Dogs, and realistic depictions of combat in Vietnam and Afghanistan.  Most of the action takes place on Iwo Jima in the area the Marines named the Amphitheater during the battle, where the five Marines went missing. However, the story ranges from the suburbs of Washington D.C. to Helmand Province, Afghanistan to Danang, Vietnam.   Ghosts of Iwo Jima is written to appeal to at least two audiences: those who enjoy tales of heroic dogs like the stories written by W. Bruce Cameron; and readers of realistic military fiction in the style of writers such as W.E.B. Griffin. I believe that the addition of a supernatural element to these two genres makes Ghosts of Iwo Jima unique.",
  "genres": [],
  "author": "Joe  Jennings",
  "average_rating": "4.65",
  "url": "https://www.goodreads.com/book/show/35967273-ghosts-of-iwo-jima"
}