{
  "title": "The Best American Short Stories 1999",
  "description": "Rookie of the YearThe new cheat sheets are here! The new cheat sheets are here!Want to know who the hottest fiction writers are? Yeah, yeah, commercially it's whatever middlebrow author Oprah tabbed this month. While there have been exceptions, many Oprah authors are no more writer's writers than Kenny G is a saxophonist's saxophonist.The best way to find the hottest, most influential writers writing would be (1) to read every issue of every magazine that publishes new fiction, and (2) to read every good book that comes out. Which would work fine if you were Burgess Meredith in that episode of \"The Twilight Zone\" where everyone in the world disappears except this bookish guy who's left alone -- o, lovely briar patch -- inside a library. (Six words of advice: Take good care of your glasses.) Absent that, what do you do?I've said it before (in this very space), and I'll say it again: The best possible way to keep tabs on what's up with North American fiction is to buy, year in and year out, each year's volume of The Best American Short Stories and Prize Stories: The O. Henry Awards. Both collections have been around for more than 80 years, have had their ups (mostly artistic) and downs (mostly commercial), but are both currently enjoying commercial heydays. During the 1970s, BASS's sales sank to a series-threatening 7,000 copies a year, before it hit on some bright ideas that saved it. Beginning in 1978, instead of one editor choosing everything himself (Edward O'Brien, from 1915 to 1940) or herself (Martha Foley, from 1941 to 1977), a series editor winnowed the 3,000 or so published stories each year down to a stack of 120 (a task, says current series editor Katrina Kenison that has become much harder the past couple years than it was when she began in 1991, when she had to scrape to find 120 she thought were terrific). Then a guest editor picks 20 stories to include (this year's, Amy Tan, seems to have done an especially able job and wrote a smart and delightful introduction). Beginning in 1983 (with an Anne Tyler-edited edition that was one of the series's strongest), BASS began to be published simultaneously in both hardback and paperback editions. And in 1987, it began to feature short comments by the writers, talking about their stories. BASS (better selling than O. Henry in recent years) began consistently to sell over 100,000 copies a year.O. HENRY's nadir came more recently. Coinciding with BASS's resurgence, O. Henry, in the 1980s, became the American short story's poor, quirky stepchild. (Not in a good way.) But it received a major overhaul in 1997. A single editor (now Larry Dark) still, as has typically been the case, picks the 20 stories to include. But now, O. Henry also includes a list of 50 short-listed stories (with brief synopses) and comments by the authors of each year's anointed 20. Furthermore, three guest jurors (this year, Sherman Alexie, Stephen King, and Lorrie Moore), pick from those 20 a first, second, and third prize. Sales have zoomed.You could read this year's editions of these two indispensable annuals and -- without breaking a sweat (with no effort more strenuous than feeling the hairs on the back of your neck stand up, though I did, as did Tan, read most of these stories on a StairMaster) -- glean this exemplary shorthand of whom you should be reading, circa 1998-1999.Most Valuable Player: Alice Munro. Why (aside from the fact that she's the greatest living writer in English): Her story, \"Save the Reaper,\" certainly the best short story I read last year, is one of only two included in both the 1999 BASS and O. Henry. In awarding it third prize in O. HENRY, Moore (whose \"People Like That Are the Only People Here\" was the only story included in both the 1998 BASS and O. Henry) discerns the story's parallels not only with Flannery O'Connor's \"A Good Man Is Hard to Find\" but also with the myths of Eros, Demeter, and Hermes. Moore writes that, in contrast to the O'Connor masterpiece, \"[a]s always in the fictional world of Munro, a character's fate pivots not on the penitential moment but on the erotic one.\"Neither annual allows any writer to be represented by more than one story (a custom that became a rule when both Munro and Richard Bausch landed two gems apiece in BASS 1990), but Munro's \"Cortes Island\" is short-listed for both and \"Before the Change\" is short-listed in O. Henry. All three stories are collected in her National Book Critics Circle Award-winning book The Love of a Good Woman.MVP Runners-Up: Annie Proulx, Pam Houston, Lorrie Moore.Why: All three are included in both volumes. Proulx's story \"The Bunchgrass Edge of the World\" is included in BASS and short-listed in O. Henry, \"The Mud Below\" in O. Henry and short-listed in BASS. Both are included in Proulx's collection Close Range, which includes two other stories honored in previous years (\"Brokeback Mountain\" and \"The Half-Skinned Steer\") and, even in an amazing year for short story collections, is one of the year's most talked-about books.Houston is the year's most-cited story writer, with four: \"Cataract\" is included in O. Henry; \"The Best Girlfriend You Never Had\" is included BASS; two other stories (\"Then You Get Up and Have Breakfast\" and \"Three Lessons in Amazon Biology\") are short-listed in BASS. All are included in her collection Waltzing the Cat.In addition to serving as an O. Henry juror, Moore has a story, \"Real Estate,\" included in BASS, and her story \"Lucky Ducks\" is short-listed there. Both are from the exquisite Birds of America.Rookie of the Year: Jhumpa Lahiri.Why: Her funny, gentle, heartbreaking story \"Interpreter of Maladies\" -- about a nonjudgmental part-time translator/part-time cabdriver in India, who takes an American family sightseeing, gets a decorous crush on the woman, and leads the children into endangerment at the hands of hanuman monkeys -- is the only other story in both volumes. Although Lahiri's work has appeared in The New Yorker, this story originally ran in The Agni Review -- a good journal, but one you may not regularly read. Both annuals had picked it for inclusion before the publication of Lahiri's first book, also called Interpreter of Maladies. The book is, justly, one of the sleeper successes of the year.\"Our record of discovery is pretty good,\" says BASS's Kenison. \"Chances are, year in and year out, you'll pick up a volume and read a story by someone you've never heard of. The next year, that writer's everywhere you look.\"This year, that's Lahiri.Also receiving votes are these 18 writers, an intriguing mix of veterans and new voices, also either short-listed or included in both volumes (and if you want to be the savviest reader on your block, you'll read more of these people's work): Poe Ballantine, T. Coraghessan Boyle, Michael Byers, Kiana Davenport, Chitra Divakaruni, Nathan Englander, Mary Gaitskill, Tim Gautreaux (whose \"The Piano Tuner,\" included in BASS and collected in his new book, Welding with Children, is my favorite non-Munro story in either book), Heidi Julavitz, Sheila Kohler, David Long, Steven Millhauser, Kent Nelson, Cynthia Ozick, Melissa Pritchard, John Updike (he's very good), David Foster Wallace (he's very smart), Joy Williams.Mark Winegardner",
  "genres": [
    "Short Stories",
    "Fiction",
    "Audiobook",
    "Anthologies",
    "Literature",
    "Adult",
    "Mystery"
  ],
  "author": "Amy Tan",
  "average_rating": "3.93",
  "url": "https://www.goodreads.com/book/show/35964.The_Best_American_Short_Stories_1999"
}