{
  "title": "Loving Quinn",
  "description": "Happy-go-lucky wolf shifter and hacker Quinn never saw the point of committing to just one person for the rest of his life. After all, with his devilish good looks and charisma, he could have any woman he wants. Any woman, except the sassy almost-witch Selena, who seems resistant to his charms. While he denies his attraction to the curvy redhead, his own animal craves her attention, and Quinn finds it difficult to stay away.  Having no magical talent meant Selena was at the bottom rung of her coven hierarchy. Mocked by her own family and pitied by the rest of her coven, she builds her own life away from them. When an offer comes that could finally give her the respect and standing she’s always wanted, it should have been easy to say yes. But a certain sexy and handsome Lone Wolf shifter has sent her into a tizzy, and she risks the chance of being welcomed back into the fold by giving into her own desires.  When Quinn’s past comes back to haunt him, it puts Selena in the line of fire and he’ll do anything to protect her. However, Selena has problems of her own and she finds herself having to choose between the life she’s always dreamed of or bet her heart on commitment-phobic Quinn. Staying together only means danger and pain, but can they really resist the attraction between them, which could end up imploding both their lives?    If you LOVE reformed playboy/virgin paranormal shifter romances, then READ this book!  Loving Quinn is a paranormal romance novel with over 60k words. It's a standalone novel with HEA, hot and sexy scenes, Lycan action and no cheating.  It is Book 2 of the Lone Wolf Defenders and takes place in the True Mates Universe but works as a standalone novel.",
  "genres": [
    "Paranormal",
    "Romance",
    "Shapeshifters",
    "Paranormal Romance",
    "Fantasy",
    "Fiction",
    "Witches"
  ],
  "author": "Alicia Montgomery",
  "average_rating": "4.53",
  "url": "https://www.goodreads.com/book/show/35967877-loving-quinn"
}