{
  "title": "How Would a Patriot Act? Defending American Values from a President Run Amok",
  "description": "Glenn Greenwald was not a political man. Not liberal, not conservative. Politicians were all the same and it didn’t matter which party was in power. Extremists on both ends canceled each other out, and the United States would essentially remain forever centrist. Or so he thought. Then came September 11, 2001. Greenwald’s disinterest in politics was replaced by patriotism, and he supported the war in Afghanistan. He also gave President Bush the benefit of the doubt over his decision to invade Iraq. But, as he saw Americans and others being disappeared, jailed and tortured, without charges or legal representation, he began to worry. And when he learned his president had seized the power to spy on American citizens on American soil, without the oversight required by law, he could stand no more. At the heart of these actions, Greenwald saw unprecedented and extremist theories of presidential power, theories that flout the Constitution and make President Bush accountable to no one, and no law. How Would a Patriot Act? is one man’s story of being galvanized into action to defend America’s founding principles, and a reasoned argument for what must be done. Greenwald’s penetrating words should inspire a nation to defend the Constitution from a president who secretly bestowed upon himself the powers of a monarch. If we are to remain a constitutional republic, Greenwald writes, we cannot abide radical theories of executive power, which are transforming the very core of our national character, and moving us from democracy toward despotism. This is not hyperbole. This is the crisis all Americans—liberals and conservatives--now face. In the spirit of the colonists who once mustered the strength to denounce a king, Greenwald invites us to consider: How would a patriot act today?",
  "genres": [
    "Politics",
    "Nonfiction",
    "History",
    "Law",
    "Government",
    "Technology",
    "Journalism"
  ],
  "author": "Glenn Greenwald",
  "average_rating": "4.11",
  "url": "https://www.goodreads.com/book/show/359768.How_Would_a_Patriot_Act_Defending_American_Values_from_a_President_Run_Amok"
}