{
  "title": "Gestalt Therapy Now - Theory Techniques Applications",
  "description": "Gestalt therapy first moved to center stage in the early 1950s with the publication of Gestalt Excitement and Growth in the Human Personality written by Frederick Perls, Ralph Hefferline, and Paul Goodman. It is one of a handful of seminal texts published shortly after World War II that opened the pathways for new approaches to psychotherapy that remain in print today, over a half-century later. Interest in Gestalt therapy was limited primarily to mental health practitioners for almost twenty years when it suddenly captured the interest of many diverse groups outside the healing professions including educators, members of the clergy, and the general public. When a photograph of one of its founders, Frederick (Fritz) Perls, was featured in a story and a full-page color photograph in Life magazine, it became the \"in\" therapeutic method of the moment. The publicity brought the attention of the mental health community to Gestalt therapy and among the first books published in almost two decades intended primary for the professional was this book, Gestalt Therapy Now. The contributors, Arnold Beisser, Lois Brien, Henry Close, Ruth Cohn, Bruce Denner, Katherine Ennis, John Burke Enright, Joen Fagan, Walter Kempler, Elaine Kepner, Janet Lederman, Abraham Levitsky, Sandra Mitchell, Claudio Naranjo, Vincent Francis O'Connell, Frederick Perls, Laura Perls, Janie Rhyne, Marilyn B. Rosanes-Berrett, Irma Lee Shepherd, James S. Simkin, and Richard W. Wallen were the leading Gestalt trainers and practitioners of the time. This Gestalt Journal Press edition includes all the original contributions plus a timely foreword by noted Gestalt trainer and organizational consultant, Seán Gaffney.",
  "genres": [
    "Psychology"
  ],
  "author": "Joen Fagan and Irma Lee Shepherd (Editors)",
  "average_rating": "3.76",
  "url": "https://www.goodreads.com/book/show/3598440-gestalt-therapy-now---theory-techniques-applications"
}