{
  "title": "Sleeping Arrangements",
  "description": "Updated cover edition of ASIN B01AU0JUS2Harper Lee: “A beautiful story I shall cherish for years to come.” Critics raved:\"A model memoir, funny and sad..\" Michiko Kakutani, the New York Times.Laura Shaine Cunningham’s memoir of being orphaned at age eight and raised by two bachelor uncles in the Bronx- “In the glow of Yankee Stadium Twi-Night doubleheaders”, has become one of the most beloved classics of contemporary autobiographical literature. Anne Tyler wrote:“Reads like a novel…You may find yourself sitting very quietly, mulling over the marvels of this truly wonderful book.” - The Baltimore SunWhen her single mother dies, her bachelor Uncles Len and Gabe step in- a wildly divergent pair- Uncle Len is a self-styled cross between Sam Spade and Abe Lincoln, who travels on “secret missions”, carrying only a manila envelope- while Uncle Gabe composes and belts out Jewish Gospel songs and proposes to every woman he meets… Len makes popcorn for breakfast and Gabe warps the wooden floor with bleach. Their lives taken on a similar odd angle- and then they are joined by the grandmother, Etka from Minsk who carries her own memoir “Philosophy for Women” and begins most sentences with “Plato and I believe…” To top it off, they get a cocker spaniel puppy who “isn’t a dog but a democrat.”Excerpted in The New Yorker, presented at Selected Shorts, read by Linda Lavin, the book, published first by Alfred Knopf and then by Plume and Riverhead Books (Penguin Putnam), the book soon became a bestseller in the U.S. and was featured in The New York Times magazine, which ran several excerpts, including the popular Uncle Food, Bachelor Uncles, and a Hers column on being raised by men. Her column devoted to her single mother appeared in The New York Observer. Laura may have been raised by two eccentric men who knew nothing about running a household but they knew how to love. Her family story is interwoven with her adventures with her little girl friends as they played forbidden games in the “Babylonian Bronx. Jessica Mitford: “Absolutely delightful…a terrific treat!”Muriel Spark: “A great pleasure…very interesting, moving and amusing.”Chaim Potok: “Wise, sobering and witty.”“Compassion and wit are a rare literary combination but Sleeping Arrangements is illuminated by both” - Los Angeles Times“Cunningham transforms her “Bronx of the emotions” into the ‘Babylonian Bronx’, a world simmering with sex and death and intrigue…Sharp- witted and funny but never mean …\"- Julie Salamon The Wall Street Journal.“Comic, touching, delightful…the kind of book you buy multiple copies of to send to your mother and best friends…\"- People",
  "genres": [
    "Memoir",
    "Nonfiction",
    "Autobiography",
    "Biography",
    "Biography Memoir",
    "Book Club",
    "New York"
  ],
  "author": "Laura Shaine Cunningham",
  "average_rating": "3.85",
  "url": "https://www.goodreads.com/book/show/35992475-sleeping-arrangements"
}