{
  "title": "Unchosen: The Hidden Lives of Hasidic Rebels",
  "description": "An exploration of Hasidic Jews struggling to live within their restrictive communities—and, in some cases, to carve out a new life beyond themWhen Hella Winston began talking with Hasidic Jews in Brooklyn for her doctoral dissertation in sociology, she was surprised to be covertly introduced to Hasidim unhappy with their highly restrictive way of life and sometimes desperately struggling to escape it. Unchosen tells the stories of these “rebel” Hasidim, serious questioners who long for greater personal and intellectual freedom than their communities allow.She meets is Malky Schwartz, who grew up in a Lubavith sect in Brooklyn, and started Footsteps, Inc., an organization that helps ultra-Orthodox Jews who are considering or have already left their community. There is Yossi, a young man who, though deeply attached to the Hasidic culture in which he was raised, longed for a life with fewer restrictions and more tolerance. Yossi's efforts at making such a life, however, were being severely hampered by his fourth grade English and math skills, his profound ignorance of the ways of the outside world, and the looming threat that pursuing his desires would almost certainly lead to rejection by his family and friends. Then she met Dini, a young wife and mother whose decision to deviate even slightly from Hasidic standards of modesty led to threatening phone calls from anonymous men, warning her that she needed to watch the way she was dressing if she wanted to remain a part of the community. Someone else introduced Winston to Steinmetz, a closet bibliophile worked in a small Judaica store in his community and spent his days off anxiously evading discovery in the library of the Conservative Jewish Theological Seminary, whose shelves contain non-Hasidic books he is forbidden to read but nonetheless devours, often several at a sitting. There were others still who had actually made the wrenching decision to leave their communities altogether.In her new Preface, Winston discusses the passionate reactions the book has elicited among Hasidim and non-Hasidim alike.Named one of Publishers Weekly 's Ten Best Religion Books of 2005.Honorable Mention in the 2012 Casey Medals for Meritorious Journalism",
  "genres": [
    "Nonfiction",
    "Religion",
    "Jewish",
    "Judaism",
    "Judaica",
    "Sociology",
    "Biography"
  ],
  "author": "Hella Winston",
  "average_rating": "3.78",
  "url": "https://www.goodreads.com/book/show/359791.Unchosen"
}