{
  "title": "City of Crows Books 1-3 Box Set",
  "description": "This box set contains the first three books in Clara Coulson's City of Crows series: Soul Breaker, Shade Chaser, and Wraith Hunter!  _____  SOUL BREAKER  Two years ago, Cal Kinsey was an up-and-coming cop in the Aurora Police Department. But during a fateful nighttime stakeout in search of a prolific killer, Cal witnessed the darkest corner of his dreams come to life. A rogue vampire slaughtered his partner—to put it nicely—and introduced Cal to the supernatural world he never knew existed in the shadows.  Now, Cal is a newly minted detective at the often mocked Department of Supernatural Investigations. By day, the agents of DSI are called “Kooks” by local law enforcement. By night, they’re known as “Crows,” reviled by the supernatural underworld.  Mere weeks out of the academy, Cal catches his first real case, a vicious murder at a local college. An unknown sorcerer has summoned a powerful creature from the Eververse, a realm of magic and mayhem that borders Earth, and set it on a dangerous warpath through the city.  Between butting heads with his grumpy team captain, stirring up ill will with the local wizards and witches, and repeatedly getting the crap beaten out of himself, Cal must find a way to stop the Eververse monster and send it back to the hell it came from…  …preferably before Aurora, Michigan runs out of coffins for the dead.  _____  SHADE CHASER  Two months after the infamous Etruscan Incident, it's back to normal for DSI—as normal as life can be when you hunt monsters on a salary. The rest of Nick Riker's elite team has finally returned from France. Cooper Lee has healed from his nightmare trip to the Eververse. The remnants of the battles with Charun and Tuchulcha have been swept under the rug. And the exploding boathouse in Holden Park has (almost) been rebuilt.  All is calm in Aurora, Michigan.  Until a grisly triple murder in one of the city's most popular bars destroys the delicate balance between three powerful forces. A high-ranking werewolf, a seasoned wizard, and a former mayor turned watchmaker wind up in body bags, and their deaths pit the ICM, DSI, and Aurora's Wolf community against each other in a blame game of epic proportions. And as the accusations spiral out of control, threatening a supernatural war on Aurora's streets, it's up to Riker's team to keep the peace before blood stains the sidewalks.  Meanwhile, Cal is struggling to overcome the consequences of his trip to the Etruscan Underworld. Haunted by visions of the future in the form of disorienting déjà vu, he's terrified he'll fail his team at crucial moments. But with the threat of violent riots hanging in the air, Cal has no choice but to power through and pray for the best.  Because one misstep on this case could mean the downfall of the city he loves.  _____  WRAITH HUNTER  It's been four months since the devastating battle on Primrose Avenue, and DSI still has its hands full. The local ICM chapter is now unstable, no leader to corral its members. The werewolves are moving in strange ways, like they're keeping secrets. And there's a traitor inside DSI, waiting to strike again.  Cal Kinsey and his team, now back on the job, are desperately searching for the answers they need to restore balance in the supernatural community. But so far, they've had little success.  Then, to make matters exponentially worse, a major Aurora convention center collapses without warning, killing dozens and injuring hundreds more.",
  "genres": [],
  "author": "Clara Coulson",
  "average_rating": "4.55",
  "url": "https://www.goodreads.com/book/show/35993633-city-of-crows-books-1-3-box-set"
}