{
  "title": "The Muse: A Supernatural Serial Killer Thriller",
  "description": "His pen and his sword are both mighty. When he loses his inspiration, he'll drench the town in blood to get it back.  Hugely successful horror author Jack Court has a chilling secret. When he's not writing bestsellers, he murders the innocent to satisfy the twisted whims of a symbiotic creature who lives within him. But after a sheriff out for justice chases him into the path of an oncoming car, the beast escapes the writer's injured body in search of another host…Harry Goodwine's words have never supported his family the way he knows they deserve. Just when he's given up hope, he suddenly receives inspiration from something new inside of him. Harry's unexpected success may just mean a new life for the ones he loves, as long as he can ignore the unfamiliar internal voice and the endless dreams of blood…Without the symbiont to maintain his vitality, Jack becomes something different. Something not quite human. Something that's willing to kill anyone in his path to reunite with the creature who will help him fulfill his darkest desires…The Muse is a standalone horror thriller that's bound to give you nightmares. If you like supernatural suspense, chilling creatures, and dark plots come to life, then you'll love Arjay Lewis' award-winning nail-biter of a novel. \nBuy The Muse to be inspired by the darkness today! \nPraise for The Muse \"A demented thriller about following your passions to the depths of depravity, as innocence and corruptness slowly waltz beyond the cracks within reality. I would give this book a rating of 5 out of 5 stars.\" -Horror Novel Reviews. \"Lewis's writing was tight and the book had a good flow and vibrant characters. The tension between Court and Trajan is palpable and their mutual hatred is felt. I think you'll like The Muse, pick it up asap!\" -Inside The Inkwell. Prepare yourself for the ride of your life!",
  "genres": [
    "Horror",
    "Thriller",
    "Paranormal",
    "Fiction",
    "Crime"
  ],
  "author": "Arjay Lewis",
  "average_rating": "4.37",
  "url": "https://www.goodreads.com/book/show/36001153-the-muse"
}