{
  "title": "American Savior: A Novel of Divine Politics",
  "description": "\"Into a country divided by partisan politics, into a world turn by hatred and war, at a time when it seems that everyone and no one has a solution to the problems that plague humankind, there suddenly appears someone who can rise above the madness, someone with knowledge and power, someone with a finely tuned sense of the ridiculous - someone, in short, who can make it right. And thus we finally have an answer to the long-simmering question, \"What would Jesus do?\"\" \"Roland Merullo's novel American Savior posits an inspired \"what if\" scenario: What if Jesus, alarmed at how the earth's most powerful nation has lost its spiritual footing and dismayed at how His own teachings have been distorted - used by politicians and religious zealots to turn love into hatred and faith into a call to arms - returns and announces that he is running for President of the United States? What if He becomes a third-party candidate, is heralded as the Son of God, and not only threatens to disrupt the status quo but poses a serious threat to the already established Democratic and Republican candidates? What would happen? How would the media react? And, more important, how would we react?\" \"Narrated by a more than slightly cynical young TV reporter, American Savior puts the reader inside the campaign waged by what is quickly dubbed the Divinity Party and follows Jesus and his modern-day disciples as they travel across the nation making speeches, reaching out to the people, and in the process arousing the ire of those who believe they know God, and who know, most assuredly, that this is not He.\" By turns amusing and heartbreaking, affirming and disturbing, American Savior is a novel sure to createcontroversy among those for whom self-righteousness is its own religion. Holding up a mirror to our society and the world in which we live, it is a passionate and penetrating look at the America that is and the America that could be.",
  "genres": [
    "Fiction",
    "Politics",
    "Religion",
    "Spirituality",
    "Fantasy",
    "Humor",
    "Contemporary"
  ],
  "author": "Roland Merullo",
  "average_rating": "3.85",
  "url": "https://www.goodreads.com/book/show/3599893-american-savior"
}