{
  "title": "Mad Women: The Other Side of Life on Madison Avenue in the '60s and Beyond",
  "description": "\"Breezy and salty.\" -The New York Times\"Hilarious! Honest, intimate, this book tells it as it was.\" -Mary Wells Lawrence, author of A Big Life (In Advertising) and founding president of Wells Rich Greene\"Breezy and engaging [though] ...The chief value of Mad Women is the witness it bears for younger women about the snobbery and sexism their mothers and grandmothers endured as the price of entry into mid-century American professional life.\" -The Boston Globe\"A real-life Peggy Olson, right out of Mad Men.\" -Shelly Lazarus, Chairman, Ogilvy & MatherWhat was it like to be an advertising woman on Madison Avenue in the 60s and 70s - that Mad Men era of casual sex and professional serfdom? A real-life Peggy Olson reveals it all in this immensely entertaining and bittersweet memoir.Mad Women is a tell-all account of life in the New York advertising world by Jane Maas, a copywriter who succeeded in the primarily male jungle depicted in the hit show Mad Men.Fans of the show are dying to know how accurate it is: was there really that much sex at the office? Were there really three-martini lunches? Were women really second-class citizens? Jane Maas says the answer to all three questions is unequivocally \"yes.\" Her book, based on her own experiences and countless interviews with her peers, gives the full stories, from the junior account man whose wife almost left him when she found the copy of Screw magazine he'd used to find \"a date\" for a client, to the Ogilvy & Mather's annual Boat Ride, a sex-and-booze filled orgy, from which it was said no virgin ever returned intact. Wickedly funny and full of juicy inside information, Mad Women also tackles some of the tougher issues of the era, such as unequal pay, rampant, jaw-dropping sexism, and the difficult choice many women faced between motherhood and their careers.",
  "genres": [
    "Nonfiction",
    "Memoir",
    "History",
    "Biography",
    "Book Club",
    "Business",
    "Feminism"
  ],
  "author": "Jane Maas",
  "average_rating": "3.48",
  "url": "https://www.goodreads.com/book/show/12160839-mad-women"
}