{
  "title": "HITLER CHRIST - Nazism, Fascism, Socialism: Swastika, Cross, Hakenkreuz, Hooked-Cross, Crucifixion",
  "description": "Millions of lives worldwide were impacted by the events. Don't fall prey to the lies your teachers taught you. Learn about the mysteries of the symbolism. Never-before-revealed secrets are exposed. And what about the followers? Who did what to whom? Some of them remain with us today. They use crosses as important -even magical- emblems. This book reveals both occult and cult knowledge. Explore the ideologies in these cryptic pages.Widely proclaimed a classic work of historical scholarship, \"Hitler Christ\" has been hailed as the most eloquent of Ian Tinny's many books. The fruit of many years of reflection and research, it is a dramatic and moving recounting of the darkest chapters survived by humanity.A penetrating study of the personification of evil. This landmark work provides revealing looks at the megalomania, delusions of grandeur, and schizophrenia. All the monstrous parts are dissected in this autopsy. Drawing on previously unseen papers and a wealth of recent scholarship, Tinny explores Professor Rex Curry's research to shine important new light on all the cadavers. For too long the world has tried to grasp how it was possible. This riveting biography brings us closer than ever to the answer.Many previous books have focused only on larger social conditions to explain these historical topics. With his customary insight and irreverence, Tinny interprets the evidence and describes events not only in historical perspective but also in exciting and contemporary terms -- seeing in calamities both modern parallels and timeless lessons. His thoughtful, probing analysis provides new insight into well-known episodes.An appealing blend of philosophy, history, and philological exegesis, from the most-loved American historical leader of the twenty-first century, \"Hitler Christ\" has long been a source of inspiration and guidance. For those seeking to better understand the mixed messages of the ages, this vivid review is a must-read.\"...author Ian Tinny recalls Dr. Rex Curry's love of history, his insatiable curiosity and academia's unwavering belief in his prodigious talent. Dr. Curry's neologistic side, with regard to the fashioning of modernity and the influence and effluence of totalitarian culture are often elided by critics and thus lost in translation. Paradoxically, it is Dr. Curry's very act of exposing so many misrepresentations that conjures a positive corporeal valence between the historian and our sense of self or identity.\" - Philological Foundation of America\"Dr. Rex Curry is a pop-culture icon by being a pop-culture iconoclast. This holds true regarding Adolf Hitler and Jesus Christ in 'Hitler Christ' and its biographical critiques.\" - Blue Teapot Review\"All anarchists can unite behind this fascinating book. It should be required reading each day in all schools ...right after the Pledge of Allegiance.\" - Anarchist Book SocietyDid Stalin, Mao, Hitler and their ilk prove that there is no God?",
  "genres": [
    "Nonfiction",
    "History"
  ],
  "author": "Ian Tinny",
  "average_rating": "4.60",
  "url": "https://www.goodreads.com/book/show/36005878-hitler-christ---nazism-fascism-socialism"
}