{
  "title": "Inner Peace Outer Abundance",
  "description": "Delivering the best steps and mapping the clearest routes to help yourself, your business sense, and your dreams.\"The experience and expertise that Kim shares in this book is rooted in rock-solid information. At the same time, the motivation and inspiration are through the roof. She inspires with direction. She motivates people while activating them to go forward. And she shares the avenues to take. She doesn't have all the answers, but she can direct you to the path and the people who do.\"Kim shares her words, wisdom and experiences covering:- The true sense of an authentic story that inspires authority.- A woman who found strength, independence, clarity, and conviction.- The factual history of her numerous successes and how she approached them.- The best ways for each personality and each individual to approach and achieve goals.- A way to begin forward motion to create the momentum and endurance that dreams require.Motivational, Informational & Inspirational Speaker & Trainer Kim Ha Campbell mixes authenticity with authority, as she showcases proof of concept examples through real life experiences. This allows her to deliver motivation and inspiration with applicable information that can benefit the widest array of people and the most extensive array of dreams. Kim along with her husband, Robb are the co-creators and executive producers of \"Pyramid Kitchen: Recipes to build the foundations of Abundance,\" a new reality show coming in spring of 2018.From The BEACH Success System to discussing how she broke through her fears to live a loving life filled with happiness, fun, and abundance, Kim Ha Campbell leads by following her message. This book serves as a guide suited for every person, in every situation, at any stage in their life.www.kimhacampbell.com",
  "genres": [
    "Self Help"
  ],
  "author": "Kim Ha Campbell",
  "average_rating": "4.69",
  "url": "https://www.goodreads.com/book/show/36035765-inner-peace-outer-abundance"
}