{
  "title": "The Mermaid Handbook: An Alluring Treasury of Literature, Lore, Art, Recipes, and Projects",
  "description": "Answer the enchanting siren call of the mermaid with this comprehensive, lavishly illustrated and intricately designed one-of-a-kind lifestyle compendium from the editor in chief of Faerie Magazine and author of The Faerie Handbook and globally published novel Mermaid, packed with lore, legends, facts and trivia, beautiful illustrations, and numerous step-by-step projects and recipes.Beautiful, seductive, mysterious, and potentially dangerous, the mermaid is a global literary and pop culture icon whose roots date back to ancient sea goddesses and Greek mythology. From Homer’s Odyssey and Hans Christian Andersen’s fairytale The Little Mermaid to T.S. Eliot’s \"The Love Song of J. Alfred Prufrock\" and the Disney animated film The Little Mermaid, this sea vixen has long seduced popular imagination. Cosmetic companies have drawn inspiration for their makeup lines from mermaids, as have designers throughout fashion history, from Jean Patou to Jean Paul Gaultier and Alexander McQueen. The fishtail dress is a perennial long red-carpet staple, favored by the likes of Marion Cotillard, Sofia Vergara, and Blake Lively.Divided into four sections—Fashion and Beauty; Arts and Culture; Real Mermaids and Where to Find Them; and Food, Entertaining and Stories of the Sea—The Mermaid Handbook is a unique and sumptuous compilation filled with creative ideas for decorating and living inspired by these beauties from the deep. Learn to make a sailor’s valentine; a mermaid comb and crown; and a pearl and sequin paillette necklace. There are recipes for mermaid-themed poke bowls, aquatic-themed honey gingerbread cookies, and the official cocktail of the 1960s-era mermaid attraction Aquarama.Folklore expert Carolyn Turgeon also includes profiles of true modern mermaids, tail makers, and mermaid bars; visits mermaid attractions like Weeki Wachee Springs; and provides tips on getting beachy mermaid hair and creating an alluring eye. This collector’s item also includes an inset image on the front cover; ornate metallic blue foil patterning on the front, spine, and back; blue stained edges; a satin bookmark, and quality paper.",
  "genres": [
    "Mermaids",
    "Fantasy",
    "Mythology",
    "Art",
    "Fiction",
    "Folklore",
    "Fairy Tales"
  ],
  "author": "Carolyn Turgeon",
  "average_rating": "4.09",
  "url": "https://www.goodreads.com/book/show/36039838-the-mermaid-handbook"
}