{
  "title": "When the Earth Had a Moon",
  "description": "New Science Fiction Space Opera/ThrillerWhat if the Earth had No Moon?How could the Earth lose its moon?The world’s first permanent moon base has been established by MoonX Ltd., a joint venture company with American, Chinese, and Russian government shareholders to promote the peaceful use and development of the moon for all. However, political tensions arise and raise the specter of total annihilation.A young nuclear physicist, Rex, works on the base to create nuclear fusion using helium-3, but personal tragedy draws his mind away from his work. His fiancée, Avery, the captain of the first international mission to Mars launched from the moon, has gone missing.With the help of his A.I. computer companion, Rex searches for answers to the cause of the loss of the Mars bound ship, but he discovers military secrets instead. In outer space, there is nowhere to run.˃˃˃ ExcerptWhen Rex got back to the base, he went directly to the cafeteria. He found Mei having a late lunch consisting of plain white rice with a chunky pink substance, supposedly chicken, with peas and carrots. Rex sat down across from Mei. “Something good for lunch?”“I’d like it better if I didn’t eat the same thing every day,” Mei said.“You could opt for the beef stew,” Rex said.“I’m a vegetarian,” Mei said.Rex did not bother pointing out the glaring contradiction in her statement. Besides, he knew that there was barely any real meat in their food anyway.“Aren’t you hungry?” Mei asked.“Not yet,” Rex said. “I was actually coming to find you.”“Why?”“I was in the Russian lab.”“How did you manage that? I don’t think you should be in there. You know how the company is sensitive about entry permissions.”“I know, but I don’t think anyone is going to really care now.”Mei stopped eating. “Find anything?”“Actually, yes.”Scroll up and grab a copy today.",
  "genres": [
    "Science Fiction",
    "Fantasy",
    "Fiction"
  ],
  "author": "A.M. Cunning",
  "average_rating": "3.43",
  "url": "https://www.goodreads.com/book/show/36037650-when-the-earth-had-a-moon"
}