{
  "title": "The Different Kinds Of Monsters: A Psychological and Supernatural Horror Novel",
  "description": "There are different kinds of men in this world. There are also different kinds of monsters.Some families just have to keep moving. Forced into a nomadic lifestyle by his father Tom’s explosive temper, Dylan Armitage’s earliest memories are of being on the road as his family try to evade the law and put down roots that will endure.But there are some things you can’t run from forever. As they’re mysteriously stalked across the country by an infamous tyrannosaurus skeleton named Emily, the Armitage family must slowly come to terms with the strange and brutal events that tie them together across a chasm of 65 million years.Dylan believed the dinosaur to be a terrifying guardian angel. Only after he grew up in the shadow of the monster does he realize the far more sinister truth lurking behind those ancient jaws. As Emily begins to take on a life of her own, Dylan will be forced to confront the horrifying reality that the biggest monsters lurk within the human heart – and that no amount of running will save you.As a dark and thrilling novel that deals with gritty themes and deep philosophical questions, The Different Kinds Of Monsters is a page-turning read that will capture your imagination with a riveting story about the real monsters that lurk within us all. Scroll up and grab your copy now...This bold and powerful novel takes an unflinching look at some of the more disturbing aspects of the human condition. Due to graphic and controversial content, reader discretion is advised. From Online Book Club With its fast pace and complex, intriguing themes, this refreshingly unique story constantly held my attention. -- Sci-Fi Kingdom: To call this book a “page-turner” is labeling it lightly. -- KWCBooksI did not want it to end. --  ANappingCat",
  "genres": [
    "Fiction",
    "Science Fiction",
    "Horror",
    "Fantasy"
  ],
  "author": "Seth Chambers",
  "average_rating": "4.11",
  "url": "https://www.goodreads.com/book/show/36036120-the-different-kinds-of-monsters"
}