{
  "title": "Chasing New Horizons: Inside the Epic First Mission to Pluto",
  "description": "Alan Stern and David Grinspoon take us behind the scenes of the science, politics, egos, and public expectations that fueled the greatest space mission of our time: New Horizons' mission to Pluto.On July 14, 2015, something amazing happened. More than 3 billion miles from Earth, a small NASA spacecraft called New Horizons screamed past Pluto at more than 32,000 miles per hour, focusing its instruments on the long mysterious icy worlds of the Pluto system, and then, just as quickly, continued on its journey out into the beyond.Nothing like this has occurred in a generation--a raw exploration of new worlds unparalleled since NASA's Voyager missions to Uranus and Neptune--and nothing like it is planned to happen ever again. The photos that New Horizons sent back to Earth graced the front pages of newspapers on all 7 continents, and NASA's website for the mission received more than 2 billion hits in the days surrounding the flyby. At a time when so many think our most historic achievements are in the past, the most distant planetary exploration ever attempted not only succeeded but made history and captured the world's imagination.How did this happen? Chasing New Horizons is the story of the men and women behind the mission: of their decades-long commitment; of the political fights within and outside of NASA; of the sheer human ingenuity it took to design, build, and fly the mission; and of the plans for New Horizons' next encounter, 1 billion miles past Pluto. Told from the insider's perspective of Dr. Alan Stern--the man who led the mission--Chasing New Horizons is a riveting story of scientific discovery, and of how far humanity can go when people focused on a dream work together toward their incredible goal.",
  "genres": [
    "Science",
    "Nonfiction",
    "Space",
    "Astronomy",
    "History",
    "Audiobook",
    "Technology"
  ],
  "author": "Alan Stern",
  "average_rating": "4.36",
  "url": "https://www.goodreads.com/book/show/36031228-chasing-new-horizons"
}