{
  "title": "Secret-Telling Bones",
  "description": "Poetry. Native American Studies. Women's Studies. Our bones are full of secrets—and, just like the rest of us, they're desperate to spill. SECRET-TELLING BONES is Jessica Mehta's fourth collection of poetry. Each piece has an identity that informs the next, thriving and living tissue that evolves with each new trauma.We're often surprised at what seems to be genetic. From shame to selfishness, anorexia to self- destruction, Jessica's words form the framework of a complicatedly beautiful world. It doesn't matter whether we share similar stories or not. At the marrow level, the human experience is all the same. Jessica captures the breaks and cracks with a pulsing rhythm in her most recent collection.\"Fears and fingers and soft splayed thighs all placed gently (or not!) in the whitewater of identity, memory, and wholly adult interaction. This is a poetry where punch meets gut so often all you can do is wag your head and turn the page. This is the poetry of Jessica Mehta.\"—Danny Earl Simmons\"Jessica Tyner Mehta's work is both ethereal and accessible, graceful yet sharply tuned. There is music in her lines, entrancing the reader and then jolting them awake, like a lullaby with gleaming teeth. Mehta's poems thunder with a strong first person narrative and a haunting confessional tone; they cut through to the reader like a piercing, direct look in the eye. Yet Mehta's voice is never still, it softens in waves, offering an invitation to listen, and be transformed.\"—Jamie Houghton\"'What aloneness there must be,' Jessica Mehta writes, 'when you're damned to this world with no body.' This exceptional collection explores the many facets of inhabiting a physical form—the appetites, the impermanence, the tangible manifestations of grief, disgust, and desire. These poems are alive with motion. They reverberate beyond the reader's mind and fill their whole body, one delicious mouthful at a time.\"—Sarah Bokich",
  "genres": [],
  "author": "Jessica Tyner Mehta",
  "average_rating": "4.67",
  "url": "https://www.goodreads.com/book/show/36027528-secret-telling-bones"
}