{
  "title": "A Compassionate Civilization: The Urgency of Sustainable Development and Mindful Activism - Reflections and Recommendations",
  "description": "We are at a turning point in the history of civilization. Anyone watching the news can understand why. Our generation faces the challenges of global warming, misogyny, racism, systemic poverty, oligarchy, and more. Some believe that this will lead to a kind of fascist, environmentally ruined dystopia. Robertson Work, who has spent decades working in poverty-stricken villages and developing countries, does not believe all hope is lost.In this revolutionary guide, Work uses his experiences with the United Nations and organizations and communities across the globe to outline the fundamentals of a compassionate civilization. He argues that it is urgent to change the way we think about society and proposes six areas of transformation to focus Each of these six foundations is necessary to form the compassionate civilization Work envisions. In addition to the theoretical themes of such a society, Work shares effective leadership methods to help make this dream a reality as a movement of movements and as global-local citizens. He encourages you to become more aware of problems and possibilities around you and practice empathetic, effective social activism and care for self and others.Anyone can make a difference. Work shows you exactly where to begin.“I strongly recommend this book for students, activists, scholars, political leaders and citizens of the world.”- Shabbir Cheema, PhD, Senior Fellow, East-West Center, Honolulu, Hawaii“This book is a superb work of courage and skill, practical knowhow, and the ingenious gifts of one who is sourced in spirit.” - Jean Houston, PhD, author, A Passion for the Possible“This book deserves to be hugely influential and read by all who care for the future of Mother Earth.” - Tatwa P. Timsina, PhD, founder of the Institute of Cultural Affairs (ICA) Nepal“Robertson issues a hope-filled call-to-action and a roadmap for creating the compassionate civilization.”- Joy Sloan Jinks, MSW, Community Organizer, Founder of Swamp Gravy",
  "genres": [],
  "author": "Robertson Work",
  "average_rating": "4.33",
  "url": "https://www.goodreads.com/book/show/36014789-a-compassionate-civilization"
}