{
  "title": "My Mental Madness Memoir: The Provocative True Journey Through My Struggles with Mental Illness",
  "description": "This chilling, shocking, intriguing, and powerful true story takes you deep into the mind of the author who suffers from several severe mental illnesses. The author describes in detail all the insanity, disturbing behaviors, oppressive symptoms, and various feelings associated with the mental battles within her own mind. This book is completely unique and one-of-a-kind. There is no other book out there quite like this one.The author suffers from clinical depression, bipolar disorder, schizophrenia, schizoaffective disorder, and borderline personality disorder. She struggles with suicidal thoughts and attempts, self-mutilating behaviors, mania, paranoia, anxiety, and psychosis with intense hallucinations of all five of her senses, and multiple delusions, including the belief that she is the \"second-coming of Christ\".Take this journey with the author as her life takes rapid turns for the very worst . . . But after many years of being extremely emotionally unstable, she acquires the courage, strength, hope, faith, and love she needs to understand, accept, and live with her illnesses. Only then is she able to turn her once very miserable and fearful life around.Book Blurb:\"I realized my situation was crazy and hard for anyone to believe. But in my mind, this was my reality. I believed all these delusions were facts. As for hearing voices, I didn't believe I was. I thought that these voices were coming from real people. After all, I didn't want to believe I had this type of mental illness. I didn't have the impression that I was the crazy one. I believed that I was simply the victim of horrible and very unusual criminal experiment.\"Reviews from readers:\"You will not want to put it down once you start reading it...a must read... what this woman went through and survived is beyond a miracle... you must buy it... it is amazing!!!\"\"To anyone who hasn't read this, I highly recommend it... it is a great read and I admire Stephanie's courage for speaking up against a nation full of stigma against mental illness. Least to say it motivated me to get back on medications after being off of it for almost a year. Thank you Stephanie for sharing hope and inspiration to others like myself.\"\"The book is brutally honest, provocative, and heart breaking. To have been through all that Stephanie has been through and come out the other side positive and with renewed purpose is inspiring. One thing I liked about the book is nothing is sugar coated. She tells it like it is and how it was, and the truth is this could happen to anybody, but with strength and acceptance this book only proves you can come out the other side. To write a book like this requires bravery, and Stephanie definitely has plenty of it. Thank you for sharing your story with me. I wish you nothing but happiness and peace in your life you deserve it.\"\"I have just finished this amazing book. What a brave, remarkable lady the author is! She describes exactly what it is like to suffer. Very insightful to read for anyone. Thoroughly recommended.\"Stephanie Anne Allen has a BA degree in clinical psychology, and she is a former case manager/social work technician for the mentally ill. She also volunteers for NAMI (National Alliance on Mental Illness). \"Now that I am mentally stable, I want to give back and help others with their own recoveries. Writing this book to help others was my first act, but definitely not my last, in helping my fellow peers who suffer with mental illness.\"--Stephanie Anne Allen",
  "genres": [
    "Memoir",
    "Mental Health",
    "Psychology",
    "Nonfiction"
  ],
  "author": "Stephanie Anne Allen",
  "average_rating": "4.04",
  "url": "https://www.goodreads.com/book/show/36052708-my-mental-madness-memoir"
}