{
  "title": "I Am Your Negro: ADOLF HITLER",
  "description": "How did Adolf Hitler and his ideological ilk launch our world's modern police state?Discover how the military salute was the origin of the Nazi salute. Learn how the USA's Pledge of Allegiance made it happen. See photos of swastikas worn by American soldiers and the military before Hitler.The old media recycle stereotypes about Hitler. Why do people who hate Hitler glorify his dogma globally? The new media perpetuate the same stereotypes. Adolf Hitler is the scapegoat for today's authoritarianism.They do it to cover-up amazing truths exposed in this book: (1) the USA's Pledge of Allegiance to the flag was the origin of the Nazi salute and Nazi behavior; (2) the swastika was used by Nazis to represent crossed \"S\" letter symbols for \"socialism.\"After WWI, when Lenin was seizing power in Russia, was Hitler watching Lenin, and emulating in Germany Lenin's power grab in Russia? The \"Furher\" did the same regarding Stalin. Hitler patterned himself after Lenin and Stalin. They were parallel lives.Discover the parallel lives of Lenin, Stalin, Mao, and Hitler (born 1870, 1878, 1889, 1893, respectively).Hitler became the black sheep of the political movement he championed. He was the scapegoat for Stalin, Mao and all socialists who blame “Hitler, Nazism, and Fascism.” Was Hitler a political transvestite?This is a study of one of the deadliest eras in humanity's history. The Dead Writers Club draws upon our understanding of the universalities of human nature to explore the ageless issues of evil, suffering, and the indomitable will of the human spirit. It explores the fields of anarchaeology and misanthropology.This book examines the anatomy of the state. All the monstrous post-mortem parts are dissected in this autopsy. New light is shined on the putrid cadaver.They say \"truth is stranger than fiction\" and this book shows how it just can be. For too long the world has tried to grasp how it was possible. This riveting semi-biographical work brings us closer than ever to the answer.  The Dead Writers Club (DWC) mined Professor Rex Curry's published and unpublished oeuvre, selecting passages from his essays, letters, notes, and interviews that are every bit as incisive and pertinent now as they have ever been. Weaving these texts together, DWC brilliantly imagines the book that Dr. Curry never wrote. DWC's publication uses Curry's work to jump through time in a blazing examination of the tragic story of world history. Dr. Curry is an unlikely angel of hope during one of history's darkest hours. The result is a radical, up-to-the-minute examination of authoritarianism in America and worldwide, with a flood of rich archival material. \"I Am Your Negro\" is a journey into global persecution that contrasts the past of the Individual Rights movement to the present of the modern police state. This book questions the presentation of liberty in Hollywood and beyond. The DWC has produced a work that challenges the very definition of what America stands for.  \"The new book by the Dead Writers Club is 'I Am Your Negro.' It explains many of the ways in which the venerable Dr. Rex Curry has blown our minds. Dr. Curry's academic work is cited in many books on Amazon, Kindle, and other sources.\" - Uhren Schmuck Buch Society of Germany  \"Adolf Hitler's ideas led to war, genocide, totalitarian oppression, family breakdown, and disastrous social experiments.",
  "genres": [],
  "author": "Dead Writers Club",
  "average_rating": "3.80",
  "url": "https://www.goodreads.com/book/show/36049896-i-am-your-negro"
}