{
  "title": "The Infinity Gene",
  "description": "My name is Aeris Thorne. I am a genetically modified human.Discover the exciting, long-awaited sequel to The Butterfly Code, the sci-fi romance thriller that's captivating readers around the world.Hurtful secrets.Terrifying warnings.Forbidden love.All I wanted was to spend a last few weeks with the man I love before tearing myself away to lick my wounds.I know Hunter and I can never be together--too many differences lie between us. He's a member of an elite group of superhumans. And what am I? His mistake.But we will have no tender respite. No final few magical days. Not us. Not now that I've learned a death sentence hangs over my head. Powerful forces are descending upon the cozy little town of Deep Cove, Maine. Beneath the cover of whispering trees, along the shores of wave-tumbled beaches, people are vying for power.And I have become the center of the war.For Hunter's sake, I'm desperate to run away. Far away. To hide so that no one can find me. For if I stay, I'll destroy us both.But there's a child involved now. A seven-year-old girl who's been pulled into my deadly vortex.There can be no running. No hiding. Not with the child's life at stake, too.Startling changes are beginning to take hold of me--I can feel them burning through my veins. My only ally is the man I love, the one I can never be with. I'm desperate to hide the truth from him. He can't know what I'm becoming. For if I put my faith in him, if we stand together, we'll both be dead.Romantic. Dangerous. Action-packed. Discover the exciting sequel to the sci-fi romance thriller that's captivating readers around the world. For fans of The Pretties, Twilight, and The Mortal Instruments. If you love exciting romances, nail-biting action, urban fantasy, fated mates, young adult dark romance, and some devilish bad boys, then the world of THE GIRL ON FIRE SERIES awaits you!",
  "genres": [
    "Science Fiction",
    "New Adult",
    "Thriller",
    "Romance",
    "Paranormal"
  ],
  "author": "Sue Wyshynski",
  "average_rating": "4.06",
  "url": "https://www.goodreads.com/book/show/36054695-the-infinity-gene"
}