{
  "title": "The Legend of the Bloodstone",
  "description": "\"Perhaps I will cut your throat as you tried to cut mine. Will I still want to touch you when your blood is on my hands? Or will it chase your ghost from my thoughts?\" He held his hands out and considered his open palms for a moment, shaking his head. \"I think not. I think still you would haunt me.\" TIME WALKERSMaggie is a modern day woman with all her flaws, thrust back into a time when men were carving out the history of America. She has just enough knowledge of the past to know trouble is coming, yet soon she is kicking herself for not paying better attention in history class. When she is captured by Winn, a warrior who is torn between his duty to kill her and his desire to keep her, she must adapt to a life she had only read about in history books.Winn is a seventeenth century Paspahegh warrior, born in a time before the English settlers arrived on the shores of Tsenacomoco. He has learned the ways of the English and uses his knowledge to ensure the survival of his people, but when he finds a wounded woman in the woods his loyalty is put to the ultimate test.Hunted and feared by both the Powhatan and the English, Maggie struggles to find a way home while Winn plots to keep her there. Maggie fights to survive as she finds herself entangled in the Massacre of 1622, and Winn sees everything he ever believed in shattered by the knowledge she holds. With ties to both the past and future, their lives unfold among the stirrings of a new nation. Maggie and Winn risk everything to survive as the once powerful Powhatan Nation crumbles and the English build a country from the ashes.Praise for the Time Walkers series: The Legend of the Bloodstone - 2013 Amazon Breakthrough Novel Award, QuarterfinalistA Tale of Oak and Mistletoe - 2013 RWA/NYC We Need a Hero Contest, Finalist\"Time travel and romance converge in this tale of star-crossed love\" - Publishers Weekly on The Legend of the Bloodstone\"This was beautiful! Time Travel at its best!\"- Romance Novels in Color\"Absolutely consuming\" - Amazon reviewer\"I love this series. I didn't want it to end!\" - Amazon Reviewer\"I can easily see where this story could be a fantastic movie.\" - Amazon Reviewer\"My complaint with this book is I couldn't stop reading this one and the next one in the series which resulted in late nights and tired mornings!!\" - Amazon Reviewer\"An epic historical saga in brilliant cinematic technicolor\" - Amazon reviewer",
  "genres": [
    "Time Travel",
    "Romance",
    "Historical Fiction",
    "Fantasy",
    "Historical Romance",
    "Historical",
    "Paranormal"
  ],
  "author": "E.B. Brown",
  "average_rating": "3.92",
  "url": "https://www.goodreads.com/book/show/36046303-the-legend-of-the-bloodstone"
}