{
  "title": "The Sweetest One",
  "description": "Cosmopolitan and curious seventeen-year-old Chrysler Wong suffers from debilitating fear brought on by belief in a family curse, whereby she and her siblings will each die at age eighteen when they leave their small hometown. Three siblings have already died; the fourth, her favourite, has left town and is incommunicado. Chrysler is afraid of boys, love, sex, leaving town, and eating chicken that's a little pink in the centre. She's taken huge precautions to try to keep herself safe, and the possibilities of her life, as she sees it, are narrow, even though she's smart, curious, hopeful, and longing for more. She vows to continue life in her small town, alone in the shadow of enormous grief, fear, and dread while trying to get her sister Trina to come home. (Trina may or may not still be alive; she may even be on an epic roadtrip adventure to a place Chrysler has always wanted to go, the Northwest Territories.) All Chrysler has is her despairing, ineffectual, sometimes abusive parents whom she takes care of and vivid memories of when things in her family were good. Enter Conrad Green, a boy from a neighbouring town who, like Chrysler, is curious, witty, and smart; unlike her, he fears almost nothing. Conrad challenges much of what Chrysler has accepted as common sense. He dares her to not be alone, to court adventure and danger and to live how she wants to, not just how she thinks she must. Through the course of a narrative that is offbeat, funny, and full of verve, we meet Chrysler's siblings, a lively bunch with a fun dynamic and interesting back-stories of their own. Set in central-western Alberta, the book asks larger questions about growing up, questions about life itself, particularly, how you would live if you knew your life would soon be ending. Would you live a circumscribed life if you thought it meant you would survive? What amount of sacrifice is worth it?",
  "genres": [
    "Fiction",
    "Young Adult",
    "Canada"
  ],
  "author": "Melanie Mah",
  "average_rating": "3.51",
  "url": "https://www.goodreads.com/book/show/36051121-the-sweetest-one"
}