{
  "title": "Handbook for Mortals",
  "description": "Zade Holder has always been a free-spirited young woman, from a long dynasty of tarot-card readers, fortunetellers, and practitioners of magick. Growing up in a small town and never quite fitting in, Zade is determined to forge her own path. She leaves her home in Tennessee to break free from her overprotective mother Dela, the local resident spellcaster and fortuneteller.  Zade travels to Las Vegas and uses supernatural powers to become part of a premiere magic show led by the infamous magician Charles Spellman. Zade fits right in with his troupe of artists and misfits. After all, when everyone is slightly eccentric, appearing ''normal'' is much less important.  Behind the scenes of this multimillion-dollar production, Zade finds herself caught in a love triangle with Mac, the show's good-looking but rough-around-the-edges technical director and Jackson, the tall, dark, handsome and charming bandleader.  Zade's secrets and the struggle to choose between Mac or Jackson creates reckless tension during the grand finale of the show. Using Chaos magick, which is known for being unpredictable, she tests her abilities as a spellcaster farther than she's ever tried and finds herself at death's door. Her fate is left in the hands of a mortal who does not believe in a world of real magick, a fortuneteller who knew one day Zade would put herself in danger and a dagger with mystical powers...  Handbook for Mortals is the first book in the series of this urban fantasy, paranormal romance series by author Lani Sarem.  Following Zade through the trials--and romance--of finding her own place in the world, readers will identify with their own struggles to fit in, reflected in the fantastic, yet mundane world of Zade's life.  Handbook for Mortals is in development as a motion picture set to debut in 2018.",
  "genres": [
    "Fantasy",
    "Young Adult",
    "Romance",
    "Paranormal",
    "Fiction",
    "Contemporary",
    "Unfinished"
  ],
  "author": "Lani Sarem",
  "average_rating": "1.30",
  "url": "https://www.goodreads.com/book/show/36054351-handbook-for-mortals"
}