{
  "title": "The Wind in His Heart",
  "description": "De Lint's first adult fantasy novel in 8 years weaves a rich tapestry of story with classic CdL elegance. Young Thomas Corn Eyes sees into the otherworld, but all he wants to do is get off the rez. Steve Cole escaped from his rock star life to disappear into the desert and mountains. Fifteen-year-old barrio kid Sadie Higgins has been discarded once too often. Blogger Leah Hardin needs to leave Newford, come to terms with the loss of her best friend, and actually engage with her life. When these lives collide in the Hierro Maderas Mountains, they must struggle to escape their messy pasts and find a way to carve a future for themselves. They don’t just have to learn how to survive. They have to learn how to fly. Beautiful, elegant, and remarkably kind, this is the work of a storyteller at the peak of his abilities. With de Lint, there's no need to say, “I can’t wait to see what he does next.” What he does now is always enough to take my breath away. —Seanan McGuire, author of the October Daye series and other novels Charles' new book filled me with joy! From the first line to the last, I was completely involved. A book about those \"outside\" who think they want to get \"in,\" there are good lessons to be learned—painlessly—from beginning to end. —Janis Ian, songwriter & musician With this gently rolling, lyrical composition of a book, the godfather of urban fantasy flows back to where he’s most needed. If there's one thing today's world can gain from literature, surely it's de Lint's signature sense of unsullied wonder and devotion to the best within us. —Melissa F. Olson, author of the Scarlett Bernard series and other novels As a struggling unpublished novelist, I read Charles de Lint and found the template for the kind of stories I wanted to tell, ones that brought magic and folklore into the modern world. After fifteen novels of my own, I'm still both humbled and enthralled by the ease with which he draws the reader into his stories, because now I know just how hard it is. The Wind in His Heart is tough, tender, grim, light on its feet, magical, and in other words, a typical de Lint masterpiece, once again setting a high bar for those of us who follow. —Alex Bledsoe, author of the Tufa series and other novels Oh what a sweet, wonderful ride that was! I was enthralled. I didn't leave my house all weekend; it was glorious. It was throwback CdL, a vast, shifting landscape of story woven upon story, just what I love. What a love letter to the desert. —Lizz Huerta, author, winner of the Lumina fiction award Splendid and so very healing! —Charles Vess, artist, winner of the World Fantasy Award",
  "genres": [
    "Fantasy",
    "Urban Fantasy",
    "Fiction",
    "Magical Realism",
    "Mythology",
    "Science Fiction Fantasy",
    "Audiobook"
  ],
  "author": "Charles de Lint",
  "average_rating": "4.49",
  "url": "https://www.goodreads.com/book/show/36049789-the-wind-in-his-heart"
}