{
  "title": "Fool's Errand: Time to End the War in Afghanistan",
  "description": "“In Fool’s Errand, Scott Horton masterfully explains the tragedy of America’s longest war and makes the case for immediate withdrawal. I highly recommend this excellent book on America’s futile and self-defeating occupation of Afghanistan.” — Daniel Ellsberg, Pentagon Papers whistleblower and author of The Doomsday Machine: Confessions of a Nuclear War Planner“The real story of the disastrous U.S. war in Afghanistan must be written so that future generations may understand the folly of Washington’s warmongers. Scott Horton’s Afghan war history is an important contribution to this vital effort.” — Ron Paul, M.D., former U.S. congressman and author of Swords into Plowshares: A Life in Wartime and a Future of Peace and Prosperity“Scott Horton’s, Fool’s Errand: Time to End the War in Afghanistan, is a definitive, authoritative and exceptionally well-resourced accounting of America’s disastrous war in Afghanistan since 2001. Scott’s book deserves not just to be read, but to be kept on your shelf, because as with David Halberstam’s The Best and Brightest or Neil Sheehan’s A Bright Shining Lie, I expect Horton’s book to not just explain and interpret a current American war, but to explain and interpret the all too predictable future American wars, and the unavoidable waste and suffering that will accompany them.” — Capt. Matthew Hoh, USMC (ret.), former senior State Department official, Zabul Province, Afghanistan, Senior Fellow at the Center for International Policy“Fool’s Errand is a hidden history of America’s forgotten war, laid bare in damning detail. Scott Horton masterfully retells the story of America’s failed intervention, exposes how Obama’s troop surge did not bring Afghanistan any closer to peace, and warns that the conflict could go on in perpetuity — unless America ends the war. As Trump threatens to send more troops to Afghanistan, Horton shows why the answer to a brutal civil war is not more war, which makes Fool’s Errand a scintillating and sorely needed chronicle of the longest war in American history.” — Anand Gopal, journalist and author of No Good Men Among the Living: America, the Taliban, and the War Through Afghan Eyes“Scott Horton’s new book Fool’s Errand: Time to End the War in Afghanistan has a title that tells you where it is going, but to think that is all it is about would be to sell short a comprehensive work that takes the reader on a long journey starting in the 1980s. Indeed, if there were a university course on what went wrong with Afghanistan, starting with Ronald Reagan’s Holy Warriors and continuing with George W. Bush’s ouster of the Taliban leading to 15 years of feckless nation building, this book could well serve as the textbook. Horton provides insights into key decision-making along the way as he meticulously documents the dreadful series of misadventures that have brought us to the latest surge, which will fail just like all the others. The book is highly recommended both for readers who already know a lot about Afghanistan as well as for those who want to learn the basics about America’s longest war.” — Philip Giraldi, former CIA and DIA officer, executive director of the Council for the National Interest",
  "genres": [
    "History",
    "Politics",
    "War",
    "Nonfiction",
    "Military Fiction",
    "American History",
    "Military History"
  ],
  "author": "Scott Horton",
  "average_rating": "4.66",
  "url": "https://www.goodreads.com/book/show/36054118-fool-s-errand"
}