{
  "title": "In Harmony",
  "description": "\"In Harmony...gives a voice to the voiceless...\"The root of all madness is an unbearable truth…At seventeen, Willow Holloway’s life was torn apart. The happy, driven girl is gone, and she is left wracked by post-traumatic stress her body remembers even if she does not. When her father suddenly uproots the family from their posh penthouse in New York City to the tiny town of Harmony, Indiana, Willow becomes more untethered and lost under the weight of her secret. On a whim, she auditions for a part in the community theater’s production of Hamlet and unexpectedly wins the role of Ophelia—the girl who is undone by madness, and her love of Hamlet… Isaac Pearce is from the ‘wrong side of the tracks.’ The town bad boy. Girls pine for his attention and guys are in awe of him. That he’s an acting prodigy only adds to his charisma. Isaac utterly disappears into his characters; the stage is the only place he feels safe from his own traumatic home life. He wants nothing more than to escape to Broadway or Hollywood and leave Harmony behind for good. No one can play Hamlet but Isaac, and when the director pairs him with Willow in acting class, they clash again and again—neither willing to open their hearts to anyone. But clashing leads to breaking, breaking leads to the spilling of terrible secrets, and soon Isaac and Willow find Shakespeare’s words mirroring their lives. When they are cruelly torn apart, neither know how this play will end—with madness and heartache? Or healing, love, and the discovery of who they are truly meant to be. In Harmony is a standalone YOUNG ADULT/NEW ADULT love story, and is intended for readers 18 and up. PLEASE NOTE, this book contains sensitive material such as physical abuse, and the aftermath of sexual assault (off the page). Reader discretion is advised.",
  "genres": [
    "Romance",
    "New Adult",
    "Contemporary",
    "Young Adult",
    "Abuse",
    "High School",
    "Contemporary Romance"
  ],
  "author": "Emma   Scott",
  "average_rating": "4.37",
  "url": "https://www.goodreads.com/book/show/36053619-in-harmony"
}