{
  "title": "Serious Fun: A History Of Spectator Sports In The U.S.S.R.",
  "description": "\"The Big Red Machine,\" an assemblyline of sober, unsmiling Olympic champions--this was the image that dominated Western thinking about Soviet sports. But for Soviet citizens the experience of watching sports in the USSR was always very different. Soviet spectators paid comparatively littleattention to most Olympic sports. They flocked instead to the games they really wanted to watch, rooted for teams and heroes of their own choosing, and carried on with a rowdiness typical of sportsfans everywhere. The Communist state sought to use sports and other forms of mass culture to instillvalues of discipline, order, health, and culture. The fans, however, just wanted to have fun. Official Soviet ideology was never able to control or comprehend the regressed and pleasure-seeking component not only of spectator sport but of all popular culture.In Serious Fun , Robert Edelman provides the first history of any aspect of Soviet sports, covering the most popular spectator attractions from 1917 up to the end of the Soviet Union in 1991. Edelman has used the highly candid sports press, memoirs, instruction books, team yearbooks, and pressguides and supplmented them with Soviet television broadcasts and interviews with players, coaches, team officials, television bureaucrats, journalists, and fans to detail how spectator sport withstood the power of the state and became a sphere of life that allowed citizens to resist, deflect, andeven modify the actions of the authorities.Focusing on the most popular sports of soccer, hockey, and basketball, Edelman discusses the dominant teams and the biggest the international competitive successes as well as the many failures. He covers a variety of topics familiar to Western sports fans including professionalism, fanviolence, corruption, political meddling, the sports press, television, and the effect of big money on competition.More than just a sports book, Serious Fun takes us deep into the social fabric of Soviet life. Edelman shows how the Big Red machine so visible in international competition was much like the giant steel mills and dams of which the Soviets boasted. These were the achievements of a state that putproduction above all else, but spectator sport was part of a long-suffering consumer sector that the industrial giant would never satisfy. This volume will bring a broader, richer understanding of Soviet life not only to students of popular culture and Russian history but to sports fanseverywhere.",
  "genres": [
    "Sports",
    "History"
  ],
  "author": "Robert Edelman",
  "average_rating": "4.25",
  "url": "https://www.goodreads.com/book/show/1216235.Serious_Fun"
}