{
  "title": "Prehistoric London: It's Mounds and Circles",
  "description": "A thorough analysis of prehistorical pre-Christian Britain. This scholarly account includes detailed descriptions and information of an ancient land with its strange mounds and circles that bear witness to Britain's early culture and religion. Gordon begins with the \"The history of a nation is the history of its religion, its attempts to seek after and serve its God\" says an old writer. Of no nation or country is this more true than of Great Britain where from the standing stones of Stennis in Orkney to the Maen Ambres in Cornwall -- the prehistoric remains of open-air sanctuaries -- artificial mounds and scientifically constructed astronomical circles bear witness to the vigor and vitality of a national religion which has already passed from the primitive into the metaphysical stage and embodies abstract ideas astronomical observations and a high and pure code of morals. From the comparative study of antiquity in Chaldea Arabia Persia and Palestine we now know this religion to have been Druidism one of the oldest religions in the world and in its Asiatic and Semitic form of Buddhism the religion still of one-half of mankind. The author compares the mounds and circles in Britain to those erected by Moses and Joshua pointing to their similarity and elaborates on the close connection between the religion of ancient Israel and that of British Druidism. This is a book that is so full of captivating historical facts and intriguing conjectures that one hardly knows where to begin to focus for such a brief account as is possible in a summary. But the fascinating evidence revealed through the honest efforts of serious research has given us a wealth of striking characters from the race of people who have inhabited this beautiful land from its earliest days. One especially noteworthy proposition is the author's conviction of the kinship between the Trojans and the British and the evidence she gives to support her position.",
  "genres": [],
  "author": "E.O. Gordon",
  "average_rating": "3.80",
  "url": "https://www.goodreads.com/book/show/3605657-prehistoric-london"
}