{
  "title": "The STRAP: A Complete History of Sam Muchnick's Missouri State Championship",
  "description": "The definition of a biography is \"the account of someone's life written by someone else.\" This book isn't about \"someone's\" life, but author Roger Deem does bring life to the story of the Missouri championship belt, the \"crème de la crème\" of professional wrestling's title belts, second only to the world heavyweight title. Deem covers everything about the title, from the creation of the belt in 1972 to its demise with the death of the St. Louis Wrestling Club in 1987. Held by legendary superstars like Harley Race, Terry Funk, Ric Flair, Jack Brisco, Ted DiBiase, Bob Backlund, Dick Murdoch, Kerry Von Erich, David Von Erich, and many others, the Missouri title was what every wrestler who appeared in St. Louis hoped to win, and each titleholder has been given a section of their own. But this book isn't only about the title. It's a look at the history of the St. Louis wrestling promotion itself during the time the title was in use; the genius of promoter Sam Muchnick; the behind-the-scenes manipulations that determined who would be given the opportunity to hold the title, or have it taken away; and the problems that beset the promotion both from within and without. Several of the wrestlers who held or wrestled for the title — Kevin Von Erich, Ted DiBiase, Jerry Brisco, Bob Backlund, Ric Flair, Dory Funk Jr., Terry Funk, Harley Race, and Ken Patera — as well as others close to the promotion, weigh in on the subject by sharing their memories of the times, and, in many respects, the most important contribution to the story come from Larry Matysik, someone who never wrestled, but was a key figure in the offices of the St. Louis Wrestling Club. Also included are: listings and descriptions of every match wrestled when the Missouri title was at stake, the television matches in which the champion wrestled on the famous \"Wrestling at the Chase\" television program, reprints of the \"Wrestling\" arena program covers, and over 150 photos and images of the wrestlers and the events that took place during that time. Deem attacks the subject from the viewpoint of a fan who was on the outside of the wrestling business looking in and a photographer on the fringe who made friends with many of the personalities who graced the wrestling ring in both Kiel Auditorium and the St. Louis Arena. Relive the memories of the days when St. Louis was the wrestling capital of the world and the Missouri heavyweight title was the goal of every wrestler.",
  "genres": [],
  "author": "Roger Deem",
  "average_rating": "3.60",
  "url": "https://www.goodreads.com/book/show/36065225-the-strap"
}