{
  "title": "Merlock",
  "description": "Forbidden to set foot in the ocean, the big battered house at the beach is the last place seventeen year old Alair expected to spend the summer before senior year. A champion swimmer, Alair can’t understand the reasoning behind her father’s strange and peculiar rules regarding the ocean. Not until she finds out the mysterious way her mother died at sea. Uninterested in her mother's family, and even more annoyed at being separated from her friends, Alair will do anything in her power to speed up the renovation project and sale of the old house so she can return to civilization as she knows it.Attempting to make the best of the summer, Alair and her twin brother befriend a group of locals, who unbeknownst to them are members of a coven of warlocks descending from the original Salem witches. Youthful appearing yet centuries old, Jeremiah is shocked to find Alair to be the spitting image of his long lost love Alida, the girl who got away. As Jeremiah finds himself falling for Alair, questions about Alida’s mysterious disappearance centuries before begin to resurface.Torn between her desire to go home and her growing feelings for Jeremiah, Alair becomes increasingly confused when antique items with the name Alida begin to appear in the old family beach house. When Alair stumbles upon a journal from 1693 detailing the Merlock War, a war between the Merpeople and the Warlocks, Alair believes it to be a work of fiction. That is, until she finds out that the author, Alida, had left her home in the sea for a dashing young warlock by the name of Jeremiah Landon. As the world as she knows it comes crashing down around her, Alair can’t help but wonder what ties her family has to Alida, and if meeting Jeremiah was a coincidence after all.Caught between romance and the secrets of her mother’s family, Alair finds herself in the center of a supernatural war between the Merpeople and the Warlocks. As she fights against an evil Warlock to save her life Alair begins to realize where she comes from, and just who she can trust. Is falling for Jeremiah a betrayal to her family? Or will true love prevail?",
  "genres": [],
  "author": "Meaghan Mallon",
  "average_rating": "4.29",
  "url": "https://www.goodreads.com/book/show/36058441-merlock"
}