{
  "title": "Beaten, Battered and Damned: The Drano Murder Trial",
  "description": "September 28, 1982, 9:32 a.m., Lisa Ann Millican, a cute 13-year-old run-away from Georgia orphans home, was standing in the wind, 2\" from the edge of a 430 foot precipice. She had been raped for two days by a fat man, and injected 6 times with Drano. In minutes, she will be shot in the back, and pushed over the edge. Alvin Neelley will then be ready to entice another female to rape and kill. Forced to represent the killer, Neelley's 18-year-old wife, Judith Ann- Capital Murder-Bob French, being a Republican, felt he was being punished for his politics. Neelley was his 17th murder or rape case without fee or expenses. This is a horrible story multiple kidnappings, rapes, murders, attempted murders, armed robbery, thefts, frauds, and more. Just when you think it can't get any worse, it gets worse. This is a true account of a lawyer's defense of one of America's worst crime sprees. The book indicates the dedication of a lawyer embroiled in a horrible case where he despised his client and she hated him. The state's evidence was overwhelming. The defense had only the wives and who knew what they would say? Their stories of the cruelty and meanness of Alvin Neelley were international news in their savagery. The defense was the \"Battered Woman Syndrome\" built on the Stockholm Syndrome and the Patty Hearst episode. The battered woman syndrome defense is now accepted in all 50 states. The verdict came in- life without parole. The judge, who forced French to take the case raised the sentence to execution. How Neelley escaped death began in 1944, before she was born, and along with the politics involved, is a mystery until the very end. This author has written several other book for your enjoyment. \"An Adventure with John\" and \"The LAWyer\".",
  "genres": [],
  "author": "Robert B. French Jr.",
  "average_rating": "3.50",
  "url": "https://www.goodreads.com/book/show/36058259-beaten-battered-and-damned"
}