{
  "title": "Rebecca & the Spiral Staircase: I've Been Here Before",
  "description": "Rebecca is far from your average 21st-century girl. She is an old soul and rather than be on her mobile phone, prefers to sit in the woods sketching imaginative worlds. Often, those around her refer to Rebecca as a “second-timer.” As her grandmother often says, “even the way you speak suggests you’ve been here before.”When the family moves to an old manor house up by the lakes in the English countryside, although she misses the previous family home, she soon delights in her new surroundings and sets off exploring the vast grounds. While digging around in an ancient wood, she finds a large Victorian key. Believing the key had been waiting for her, she sets off searching for its rightful home. After trying every keyhole, she comes across a derelict summerhouse. Sure enough, the key fits, and entering this ramshackle building, she unearths a spiral staircase, hidden away for generations. Climbing the dust-laden stairs, she ventures up into the darkness. Arriving at a door, her fearlessly inquisitive nature takes over, and fumbling around in the pitch black, she opens the door. The door pulls from her grip, and slams shut behind her. Frozen to the spot, the room fills with sunlight, and seconds later, she hears an unfamiliar female voice call her name. Inexplicably, she’s stepped back 150 years into the history of the old manor house. Now amid a love triangle, she rallies to the aid and the beautiful, but estranged lady of the house, Meredith. Only tomorrow will tell if her intervention was right, or if she’s unwittingly derailed history.This is the first of many journeys into the past for this valiant young girl, all with one destiny, right past wrongs.Follow Rebecca into her adult years through five volumes of time-twisting adventures.",
  "genres": [],
  "author": "Stephen M.   Davis",
  "average_rating": "4.21",
  "url": "https://www.goodreads.com/book/show/36061183-rebecca-the-spiral-staircase"
}