{
  "title": "Betrayal of Justice",
  "description": "This very topical, controversial, and prophetic novel is set in Washington D.C. and Dearborn, Michigan. In Washington D.C., a newly-elected president promises, in his inaugural speech, to “make America pure again.” In Dearborn, Michigan, a young Muslim woman, Arya Khan, watches President John’s acceptance speech in horror while a a few miles away, a white supremacist, Keith Blackwell, watches the same speech with pure joy. Inspired by the new president's rhetoric, Blackwell fire bombs a local mosque. The Dearborn Police promise to investigate, but Arya fears that these cops are indifferent to the Muslim community and will not vigorously investigate. She takes matters into her own hands and conducts her own 'private investigation'. Arya identifies a suspect, follows him, and witnesses his brutal murder. She calls 9-1-1 and rushes to render aid, but when the police arrive, all evidence points to Arya as the murderer; she’s arrested, jailed and formally charged.When the news story reaches the president, he seeks to deport Arya's immigrant parents. Zachary Blake (the central character of Bello’s debut legal thriller, Betrayal of Faith) returns as the trial lawyer for the family and drama plays out in both criminal and immigration courtrooms. But as the Dearborn Police seek to complete their investigation, an organization of white supremacists tries to thwart any attempt to tie their group to the murder and mayhem. Can Zachary Blake and his crack private investigator, Micah Love, save Aria from a murder charge and her parents from deportation? Can this innocent family expect justice in this new, \"pure\" America, an America that has lost its way?Betrayal of Justice is the second installment of the Zachary Blake Betrayal Legal Thriller Series by attorney/author Mark M. Bello. Fans of John Grisham and Scott Turow will enjoy comparisons to current events, as well as Bello's ability to captivate readers in an intriguing courtroom drama. This is a legal and political thriller with intriguing characters, nonstop action and a plot that is anything but predictable.",
  "genres": [
    "Fiction",
    "Thriller"
  ],
  "author": "Mark M. Bello",
  "average_rating": "4.24",
  "url": "https://www.goodreads.com/book/show/36064416-betrayal-of-justice"
}