{
  "title": "Η Αποκάλυψη του Ιωάννη",
  "description": "Ο Beato της Liebana είναι ένα ιστορικό πρόσωπο. Για τη ζωή και το έργο του, με βάση κάποια ντοκουμέντα της εποχής, ελάχιστα πράγματα είναι γνωστά. Ο Beato ήταν σίγουρα ιερωμένος και πιθανότατα μοναχός στο μοναστήρι του Αγίου Μαρτίνου, στην περιοχή της Liebana. Οι μελετητές υπολογίζουν ότι γεννήθηκε στα μέσα του όγδοου αιώνα και οπωσδήποτε μετά το μοιραίο 711, όταν το ισλαμικό ιππικό διέλυσε το βισιγοτθικό βασίλειο του Τολέδο.Ο Beato πίστευε πως το τέλος του κόσμου πλησιάζει. Το οριστικό και αμετάκλητο τέλος όλου του κόσμου. Δεν τον ενδιέφερε, ίσως, ότι έτσι θ' αποκτούσε κάποιο νόημα ολόκληρη η σειρά των γεγονότων που είχαν προηγηθεί από την ημέρα της Δημιουργίας και που συνήθως αποκαλούμε \"ιστορία\", σίγουρα όμως η πεποίθησή του ότι η μεγάλη καταστροφή πλησιάζει, τον γεμίζει με άγχος κι ο ισπανός καλόγηρος αποφασίζει να στρωθεί στη δουλειά.Στο κελί του υπάρχουν διάφορα βιβλία, αυτός όμως διαλέγει εκείνο που του ταιριάζει περισσότερο: την Αποκάλυψη του Ιωάννη, κι αρχίζει να την σχολιάζει. Ο Beato, που αναμφίβολα δεν είναι προικισμένος συγγραφέας, στηρίζεται σε παλιότερα κείμενα, δεν έχει την παραμικρή αξίωση να γράψει κάτι πρωτότυπο και είναι χαρακτηριστικό ότι στα αντίγραφα του έργου του που θα κυκλοφορήσουν αργότερα, πουθενά δεν αναφέρεται σαν δημιουργός.Το σχόλιο που γράφει ο Beato (σε άθλια λατινικά) είναι τεράστιο σε όγκο. Ο ίδιος, τη στιγμή που γράφει, ξέρει ότι τα κείμενά του θα εικονογραφηθούν. Τα αντίγραφα που θα κυκλοφορήσουν σ' όλη τη διάρκεια του Μεσαίωνα και μέχρι την εμφάνιση των χαρακτικών του Durer, με αριστουργηματικές μινιατούρες, θα βοηθήσουν το έργο του να γνωρίσει πρωτοφανή επιτυχία. Οι ειδικοί μελετητές και οι ιστορικοί της τέχνης θα ονομάσουν τους κώδικες αυτούς \"beati\" και θα συμφωνήσουν ότι ο πιο όμορφος είναι αυτός που βρίσκεται στην Εθνική Βιβλιοθήκη της Μαδρίτης.Αν ο Beato φανταζόταν τις συνέπειες που θα είχε η συγγραφή του σχολίου του, αιώνες ολόκληρους μετά την πρώτη εμφάνισή του και με το τέλος του κόσμου συνεχώς να πλησιάζει και συνεχώς να αναβάλλεται, πιθανότατα θα προτιμούσε να μην το είχε γράψει ποτέ. Το έγραψε όμως. \"Φόρτωσε\" μάλιστα το κείμενο του Ιωάννη με τόση αφθονία ερμηνευτικών και θεολογικών στοιχείων, ώστε να πετύχει το αντίθετο από το επιδιωκόμενο αποτέλεσμα.Ξεκινώντας από τη δική του \"ερμηνεία\" οι κατοπινοί -όχι μόνο λόγιοι και ιερωμένοι, αλλά και κάθε είδους αρχηγοί, ορθόδοξοι κι αιρετικοί, νόμιμοι κι επαναστάτες- θα \"εξηγήσουν\" το όραμα της Πάτμου με χίλιους δυο διαφορετικούς τρόπους, ο καθένας κατά την αντίληψή του κι ανάλογα με τους σκοπούς που θα ήθελε να εξυπηρετήσει.Βέβαια, η Αποκάλυψη αντέχει. Είναι ένα κείμενο που δεν επιδέχεται καμιά ταξινόμηση και μοιάζει να γράφτηκε για να εξουθενώνει τους μεταφραστές, να τσακίζει τα νεύρα των σχολιαστών και να παρασέρνει τους αναγνώστες σε λαβυρίνθους αλληγοριών που έχουν τη δύναμη να περιφρονούν τους κανόνες του χωρο-χρόνου.Όταν, στις αρχές της δεκαετίας του '70, ο ιταλός εκδότης Franco Maria Ricci αποφάσισε να κυκλοφορήσει έναν \"beato\", διάλεξε τον κώδικα της Μαδρίτης με τις υπέροχες μοζαραβικές μινιατούρες (οι μοζάραβες, ή και μοζαραβίτες, δεν ήταν μουσουλμάνοι, ακολουθούσαν όμως τα αραβικά έθιμα και μιλούσαν την αραβική γλώσσα), και κάλεσε, όπως είπε ο ίδιος έναν \"σύγχρονο ιερωμένο\", τον καθηγητή Umberto Eco, γνωστό σημειολόγο και προικισμένο μελετητή του Μεσαίωνα, να σχολιάσει το κείμενο του Beato και τις εικόνες. Κι ο Umberto Eco στρώθηκε στη δουλειά.Σαν καλός επιστήμονας ξεκινάει με μια μεθοδολογική δήλωση προθέσεων. Τονίζει ότι δεν πρόκειται να σχολιάσει την Αποκάλυψη του Ιωάννη αλλά το σχόλιο του Beato και τις μινιατούρες. Πλησιάζοντας, όμως, στο τέλος της εργασίας του, διαπιστώνει ότι κάπου ξεστράτησε και σαν έξυπνος άνθρωπος δε διστάζει να το παραδεχτεί: \"Ξεφύγαμε από τα καθορισμένα πλαίσια... κι έτσι διαπράξαμε το ίδιο σφάλμα με τον Beato\".",
  "genres": [],
  "author": "Umberto Eco",
  "average_rating": "4.50",
  "url": "https://www.goodreads.com/book/show/36067152"
}