{
  "title": "The Marie Selby Botanical Gardens Illustrated Dictionary of Orchid Genera",
  "description": "Published in Association with Selby Botanical Gardens Press\"The hundreds of orchid genera and thousands of species can seem unbelievably complex, but they are beautiful, mysterious, and alluring. Therefore we want reliable ways in which to refer to them―ways that will be understood by those who hear us or read our written communications about these plants. The Marie Selby Botanical Gardens Illustrated Dictionary of Orchid Genera will become a convenient reference for those many people who are fascinated by orchids. By referring to this guide, one can find a secure mooring for any species of orchid, one that makes it possible to understand its relatives and its place in the galaxy of orchid variation.\"―from the Foreword by Peter H. Raven The Marie Selby Botanical Gardens Illustrated Dictionary of Orchid Genera is the most comprehensive and extensively illustrated account of orchid genera to date. Its concise entries provide details of nomenclature, classification, original publication, etymology, and geographic range, along with a brief description and color images of representative flowers. The dictionary describes not only all of the 850 orchid genera that are recognized today but also those genera known only from fossil records, published before Linnaeus, validly published (but not accepted), and invalidly published according to the standards of the International Code of Botanical Nomenclature, as well as those that have variant names or spellings. In addition to the alphabetic entries, this dictionary includes an introduction to orchid biology, a glossary, a list of taxonomists credited with publishing new orchid genera, key references and bibliographical abbreviation list, and the governing nomenclature rules. The Marie Selby Botanical Gardens Illustrated Dictionary of Orchid Genera also features a Foreword by Peter H. Raven and an Introduction on the biology of orchids by David Benzing that describes the August 2007 discovery of the world's oldest unequivically orchidaceous fossil. The Marie Selby Botanical Gardens in Sarasota, Florida, are extensive botanical gardens dedicated to research and collections of epiphytes, especially orchids and bromeliads, and their canopy ecosystems. The Gardens maintain the most diverse collection of bromeliads in the world and feature over 20,000 plants from some 6,000 species in 1,200 genera from 214 plant families, including 6,000 live orchids. This monumental work is yet another manifestation of the collection―an extension of the Gardens into print.",
  "genres": [],
  "author": "Peggy Alrich",
  "average_rating": "4.33",
  "url": "https://www.goodreads.com/book/show/3607719-the-marie-selby-botanical-gardens-illustrated-dictionary-of-orchid-gener"
}