{
  "title": "Goldie",
  "description": "Goldie, Road Captain of the Night Rebels MC, loves women and women love him. He’s a simple man who only needs his Harley, whiskey, and women—in that order—in his life to make it hum. Being an officer of an outlaw motorcycle club, the women are more than willing to accommodate the blond, ripped, and tatted biker. His rule is simple: pleasure without commitment. It’s served him well until one night when she walked into the club’s tattoo shop wanting an ink job on her sexy bottom.  For reasons he doesn’t understand, he’s drawn to her. He wants to get to know her.  Then he finds out her name is Hailey Shilley. He hasn’t seen her since she moved away from Alina eleven years ago.  She’s off limits. She’s his best friend’s little sister. He has to forget about her.  Problem is he can’t get her or her sweet tattoo out of his mind.  Hailey Shilley left Alina when she’d first started high school. She’s back to help her aunt run her floral shop. When she stumbles into the tattoo parlor with her two friends, she doesn’t expect to find the most gorgeous guy she’s ever laid eyes on. His ripped body, strong jaw, and to-die-for tats make her tingle all over. She can’t get him out of her mind.  When she finds out he’s her brother’s best friend, she can’t believe what a hunk he grew up to be. But her brother warned her about him. Told her he’s an outlaw biker and a player. She always had a crush on him, but now that they’re both grown up, she isn’t sure she wants to risk her heart to him.  While Hailey tries to put aside her fears and Goldie his loyalty to his buddy, women are being terrorized and female bodies are turning up all around the county. A madman is loose and he’s closing in on the women Goldie holds dear to him. Can he be stopped in time?  This is the fourth book in the Night Rebels MC Romance series. This is Goldie’s story. It is a standalone. This book contains violence, sexual assault (not graphic), strong language, and steamy/graphic sexual scenes. It describes the life and actions of an outlaw motorcycle club. If any of these issues offend you, please do not read the book. HEA. No cliffhangers! The book is intended for readers over the age of 18.",
  "genres": [
    "Romance",
    "Contemporary",
    "Suspense",
    "Crime",
    "Erotica",
    "Murder Mystery"
  ],
  "author": "Chiah Wilder",
  "average_rating": "4.38",
  "url": "https://www.goodreads.com/book/show/36073866-goldie"
}