{
  "title": "Burn in Hail",
  "description": "One look at the sixteen-year-old, prim and proper town goody-two-shoes, Hennessy Hanes, and Tate Casey knows he’s in trouble. He knows he should stay away from the preacher’s daughter, but there’s something about her he’s drawn to, and he can’t resist the pull. The more he gets to know her, the more he realizes that something isn’t right. He may not be able put his finger on what it is, but he’s determined to find out what’s going on with the girl with the haunted eyes. Tate didn’t anticipate that someone else would be just as determined to keep Hennessy’s nightmare a secret, and he never realizes just how far that person is willing go to keep those skeletons in the closet until it’s too late. With the very real threat of jail time hanging over his head, Tate leaves without a backwards glance at the town or the girl. The problem is that out-of-sight doesn’t necessarily mean out of mind, and it’s Tate who’s now haunted by his decision and memories of Hennessy. *** Hennessy Hanes knows better than anyone not everything is always as it appears to be. After years of being on the receiving end of her squeaky-clean preacher father’s abuse, she seizes an opportunity to leave it all behind and runs. Her only regret is that in walking away she loses any chance with the one person who tried to save her. *** Fast forward ten years, and they’re both back where they started. Tate was never a good boy, and it turns out that the man he’s now grown into isn’t all that much better. Anger is a living, breathing part of him, and there’s a court order forcing him to seek help from the one person he’s never forgotten. Hennessy never thought she’d see Tate Casey again, and certainly not on her couch. But now it’s her turn to save him, and there are rules she must follow as his psychologist, not to mention a court order instructing her to help him manage his anger. If she doesn’t follow those rules, he’ll end up back in jail. Tate Casey has never been a man who followed the rules, and Hennessy is no longer the straight-laced, timid preacher’s daughter she once was. His hands may be tied, so it looks like for the first time in Hennessy’s life, she’ll be the one breaking the rules for the chance to finally get what she’s always wanted. Him.",
  "genres": [
    "Romance",
    "Contemporary",
    "Audiobook",
    "Suspense",
    "Abuse",
    "Contemporary Romance",
    "Romantic Suspense"
  ],
  "author": "Lani Lynn Vale",
  "average_rating": "4.36",
  "url": "https://www.goodreads.com/book/show/36071994-burn-in-hail"
}