{
  "title": "The Girl Who Smiled Beads: A Story of War and What Comes After",
  "description": "A riveting story of dislocation, survival, and the power of the imagination to save us  Clemantine Wamariya was six years old when her mother and father began to speak in whispers, when neighbors began to disappear, and when she heard the loud, ugly sounds her brother said were \"thunder.\" It was 1994, and in 100 days more than 800,000 people would be murdered in Rwanda and millions more displaced. Clemantine and her fifteen-year-old sister, Claire, ran and spent the next six years wandering through seven African countries searching for safety--hiding under beds, foraging for food, surviving and fleeing refugee camps, finding unexpected kindness, witnessing unimaginable cruelty. They did not know whether their parents were alive.At age twelve, Clemantine, along with Claire, was granted asylum in the United States--a chance to build a new life. Chicago was disorienting, filled with neon lights, antiseptic smells, endless concrete. Clemantine spoke five languages but almost no English, and had barely gone to school. Many people wanted to help--a family in the North Shore suburbs invited Clemantine to live with them as their daughter. Others saw her only as broken. They thought she needed, and wanted, to be saved. Meanwhile Claire, who had for so long protected and provided for Clemantine, found herself on a very different path, cleaning hotel rooms to support her three children.Raw, urgent, yet disarmingly beautiful, The Girl Who Smiled Beads captures the true costs and aftershocks of war: what is forever lost, what can be repaired, the fragility and importance of memory, the faith that one can learn, again, to love oneself, even with deep scars.",
  "genres": [
    "Nonfiction",
    "Memoir",
    "Africa",
    "Biography",
    "Book Club",
    "History",
    "War"
  ],
  "author": "Clemantine Wamariya",
  "average_rating": "4.19",
  "url": "https://www.goodreads.com/book/show/36076501-the-girl-who-smiled-beads"
}