{
  "title": "Floating Clouds",
  "description": "In this groundbreaking novel, Fumiko Hayashi tells the powerful story of tormented love and one woman's struggle to navigate the cruel realities of postwar Japan. The novel's characters, particularly its resilient heroine Koda Yukiko, find themselves trapped in their own drifting, unable to break out of the morass of indecisiveness. Set in the years during and after World War II, their lives and damaged psyches reflect the confusion of the times in which they live.Floating Clouds follows Yukiko as she moves from the physically lush and beautiful surroundings of Japanese-occupied French Indochina to the desolation and chaos of postwar Japan. Hayashi's spare, affecting novel presents a rare portrait of Japanese colonialism and the harshness of Japan's postwar experience from the perspective of a woman. Its rich cast of characters, drawn from the back alleys of urban Japan and the low rungs of society, offers an unforgettable portrait of Japanese society after the war.The tortured relationship between Yukiko and Tomioka, a minor official with the Department of Agriculture and Forestry, provides the dramatic center of the novel. Yukiko meets Tomioka while working as a typist for the Japanese ministry in Indochina, where they begin their affair. After the war, Tomioka returns to his wife but remains emotionally inscrutable to Yukiko, refusing to break off their relationship. Meanwhile, Yukiko must find her way in a radically changed postwar Japan. When Yukiko and Tomioka's lives once again cross, the two set down a path shaped by their passion and sense of desperation.First published in 1951, Floating Clouds is a classic of modern Japanese literature and was later made into a film by legendary Japanese director Mikio Naruse.",
  "genres": [
    "Japan",
    "Japanese Literature",
    "Fiction",
    "Asia",
    "Literature",
    "Historical Fiction",
    "Womens"
  ],
  "author": "Fumiko Hayashi",
  "average_rating": "3.52",
  "url": "https://www.goodreads.com/book/show/360765.Floating_Clouds"
}