{
  "title": "It's Even Worse Than You Think: What the Trump Administration is Doing to America",
  "description": "The Trump administration is remaking the government. It's Even Worse Than You Think: What the Trump Administration Is Doing to America tells readers exactly how it is making America worse again.Bestselling author and longtime Trump observer David Cay Johnston shines a light on the political termites who have infested our government under the Trump Administration, destroying it from within and compromising our jobs, safety, finances, and more.No journalist knows Donald Trump better than David Cay Johnston, who has been following him since 1988. It's Even Worse Than You Think: What the Trump Administration Is Doing to America goes inside the administration to show how the federal agencies that touch the lives of all Americans are being undermined. Here is just some of what you will learn:The Wall. Mexican President Enrique Pena Nieto told President Trump that Mexico will never pay for the border wall. So, Trump is proposing putting a tariff on Mexican imports. But a tariff will simply raise the price of Mexican goods in the US, meaning American consumers will end up paying for the wall—if it ever gets built.Climate Change. Welcome to the new EPA, run by Scott Pruitt, a lawyer who has spent much of his career trying to destroy the agency he now heads. Secrecy reigns at the new EPA because Pruitt meets with industry executives to find out which clean air and clean water provisions they most want to roll back, and keeps staffers in the dark to make sure these pro-pollution plans don’t leak prematurely.Stocking the Swamp. Contrary to his promise to “drain the swamp” in Washington, DC, Trump has filled his cabinet with millionaires and billionaires, from Treasury Secretary Steven Mnuchin, a Goldman Sachs and hedge fund veteran who made much of his fortune foreclosing on homeowners to billionaire heiress Education Secretary Betsy DeVos, who has already put the interests of bankers ahead of debt-burdened students and their families.The Kleptocracy. Under Donald Trump conflict of interest is passé. When Trump isn’t in Washington, he stays at one of his properties, where the taxpayers pick up the tab for staffers, Secret Service, and so on, all at full price. And back in Washington, everyone now knows that the Trump International Hotel is the only place to stay if you want to do business with the administration. Meanwhile sons Donald Jr. and Eric run an eyes-wide-open blind trust of Trump holdings to avoid the appearance of conflict of interest—but not the reality.",
  "genres": [
    "Politics",
    "Nonfiction",
    "History",
    "Audiobook",
    "Government",
    "Psychology",
    "Biography"
  ],
  "author": "David Cay Johnston",
  "average_rating": "4.05",
  "url": "https://www.goodreads.com/book/show/36101074-it-s-even-worse-than-you-think"
}