{
  "title": "Two Bit",
  "description": "Where I was his weakness, he became my strength.Two Bit:I've never been one to hold back. I've always said what was on my mind - right or wrong - and earned my name because of it. Giving my two cents hasn't always been a good thing, but on one fateful night, it led me to her. She was a once-in-a-lifetime kind of girl. Undeniably beautiful. Fearless. Unforgettable. I wanted her, but getting mixed up with her nearly cost me my life. I tried to fight it. I tried to save myself from the flame... but after one touch, I knew there was no turning back. Zoe would be mine.Zoe:Sometimes, you've got to hit rock bottom before you can find a way to move forward. Well, it's time for me to find a way to move forward, because I've sure as hell hit rock bottom.My father, the president of the Chosen Knights, died and left me a legacy I didn't want. The club was supposed to be my family, but with my father gone, they'd gotten tangled up in things I wanted no part of. I wanted out, free from the torment, but I was stuck with no money and no place to go. I'd thought all hope was gone. Until he walked into the bar. As if he'd stepped out of my dreams, he was everything I'd ever wanted. Brave. Loyal. Drop-dead gorgeous.  Being with him came at a price - a price I wasn't sure either of us could pay.When sparks fly and ignite a war, who will be left standing in the ashes?The brothers of Satan's Fury earn their name in this fast paced, insta-love, action packed, MC romance. Two Bit is book seven of the Satan's Fury MC series. This book is a full-length standalone novel that's intended for mature audiences only due to the explicit language and violence. Reader discretion is advised. Get ready for a wild ride!Editor: Daryl BannerIllustrator: Mayhem Cover Creations",
  "genres": [
    "Romance",
    "Contemporary",
    "Erotica",
    "Crime",
    "Contemporary Romance",
    "Adult",
    "Abuse"
  ],
  "author": "L. Wilder",
  "average_rating": "4.35",
  "url": "https://www.goodreads.com/book/show/36103132-two-bit"
}