{
  "title": "366 Days of Compassion: One Year Catholic Devotional",
  "description": "366 Days of Compassion is a one year daily devotional written by Jocelyn Soriano with original reflections, poems, prayers and motivational quotes on God's compassion for all of us. Each day's reflection is related to a Bible verse/scripture, resonating with inspiration, especially for those who are undergoing difficult times. It is for those who grieve, those who are losing hope, those who have lost their loved ones or their dreams, those who feel all alone, those whose hearts are broken, those who are judged and feel condemned. It is full of messages of healing, wisdom, courage and faith. It is like a close friend in whom you can find comfort and consolation just when it is darkest and most painful in your life. God's grace is ever new and abounding, His mercy is infinite and His love is true. We need to be reminded of these things everyday so as not to lose the spiritual battle going on in the midst of us. Those who are tired can find refreshment, those who are troubled can find peace, those who are hurting can find forgiveness that sets them free. Whether early in the morning or late in the evening, or any hour in between, one can read a simple quote like a breath of fresh air in one's busy day. One can silently say a prayer and meditate upon the beauty of Him whose face is happiness itself. One can take a peek at a poem and find in it something like a mirror reflecting the cries of the heart both in sorrow and in deep joy. Where is God? God is with us, but we often do not know where to look and so we do not see. God is there, pursuing us, waiting for us to take the time to call on Him in our helplessness, in the routine of our daily lives. He is the one who will fill our lives with meaning and our hearts with hope. In Him we find the home we've been searching for, we find a Father who will protect us and provide for our needs. We find a Friend who loves us as we are, who sees the beauty in our souls, who will never leave us even in our worst day. The deepest wounds of the soul are healed only by compassion... People do not merely need to be clothed, they need to be embraced with love. A love that enters into their own fears and frailty, a love that suffers with them and stays with them through their darkest hour.",
  "genres": [],
  "author": "Jocelyn Soriano",
  "average_rating": "4.60",
  "url": "https://www.goodreads.com/book/show/36101856-366-days-of-compassion"
}