{
  "title": "Facing West",
  "description": "The first book in a new series by Lucy Lennox! Nico: I left my family and tiny Texas hometown fifteen years ago to escape small-town gossips and to give my mom and sister the chance at a better life. But when a phone call from an attorney back home informs me that my sister passed away, leaving me custody of her newborn baby, I’m shocked out of the steady life I’ve built for myself running a tattoo shop in San Francisco. The thing is: I don’t do babies. And I don’t do small towns. Or commitment. And I especially don’t do family. My plan is to go back to Hobie just long enough to sign adoption papers, giving my niece the kind of stable, loving family I could never provide. But the moment I meet my niece in the arms of Weston Wilde, my sister’s best friend and the town’s handsome doctor, my plans begin to change. Because suddenly, I see a different future. One with the very thing I thought I never deserved: a family. If only I can convince West that I’m not the same good-for-nothing kid ready to bolt when things get tough. Weston: There’s one thing I know for sure about Nico Salerno: he was a good-for-nothing as a kid and judging by the purple-haired, tattoo’d punk who shows up at his sister’s funeral, he hasn’t changed. There’s no way I’m letting him take custody of my best friend’s baby. But the more time I spend around him, the more I realize that his rough exterior is just a shell and that beneath all the tattoos is a scared, insecure man searching for a place to belong. And pretty soon I know exactly where he belongs: in my bed and by my side. The problem is, he abandoned his family once before, how do I know that if we become a family he won’t do it again? Facing West is the first in the new Forever Wilde series about the huge Wilde family from Hobie, Texas, whose patriarchs aren’t above a little meddling if that’s what it takes to help their grandkids find true love.",
  "genres": [
    "M M Romance",
    "Romance",
    "Contemporary",
    "LGBT",
    "Enemies To Lovers",
    "Gay",
    "Contemporary Romance"
  ],
  "author": "Lucy Lennox",
  "average_rating": "4.16",
  "url": "https://www.goodreads.com/book/show/36099003-facing-west"
}