{
  "title": "Vietnam: An Epic Tragedy, 1945-1975",
  "description": "An absorbing and definitive modern history of the Vietnam War from the acclaimed New York Times bestselling author of The Secret War.Vietnam became the Western world’s most divisive modern conflict, precipitating a battlefield humiliation for France in 1954, then a vastly greater one for the United States in 1975. Max Hastings has spent the past three years interviewing scores of participants on both sides, as well as researching a multitude of American and Vietnamese documents and memoirs, to create an epic narrative of an epic struggle. He portrays the set pieces of Dienbienphu, the 1968 Tet offensive, the air blitz of North Vietnam, and also much less familiar miniatures such as the bloodbath at Daido, where a US Marine battalion was almost wiped out, together with extraordinary recollections of Ho Chi Minh’s warriors. Here are the vivid realities of strife amid jungle and paddies that killed two million people.Many writers treat the war as a US tragedy, yet Hastings sees it as overwhelmingly that of the Vietnamese people, of whom forty died for every American. US blunders and atrocities were matched by those committed by their enemies. While all the world has seen the image of a screaming, naked girl seared by napalm, it forgets countless eviscerations, beheadings, and murders carried out by the communists. The people of both former Vietnams paid a bitter price for the Northerners’ victory in privation and oppression. Here is testimony from Vietcong guerrillas, Southern paratroopers, Saigon bargirls, and Hanoi students alongside that of infantrymen from South Dakota, Marines from North Carolina, and Huey pilots from Arkansas.No past volume has blended a political and military narrative of the entire conflict with heart-stopping personal experiences, in the fashion that Max Hastings’ readers know so well. The author suggests that neither side deserved to win this struggle with so many lessons for the twenty-first century about the misuse of military might to confront intractable political and cultural challenges. He marshals testimony from warlords and peasants, statesmen and soldiers, to create an extraordinary record.",
  "genres": [
    "History",
    "Nonfiction",
    "War",
    "Military History",
    "Military Fiction",
    "American History",
    "Politics"
  ],
  "author": "Max Hastings",
  "average_rating": "4.31",
  "url": "https://www.goodreads.com/book/show/36099654-vietnam"
}