{
  "title": "Lost in the Beehive",
  "description": "From the author of Above Us Only Sky and The Handbook for Lightning Strike Survivors, a touching new novel set in the 1960s about the power of friendship, love, and accepting your past in order to find a future.For nearly her entire life, Gloria Ricci has been followed by bees.They’re there when her mother loses twin children; when she first meets a neighborhood girl named Isabel, who brings out feelings in her that she knows she shouldn’t have; and when her parents, desperate to “help” her, bring her to the Belmont Institute, whose glossy brochures promise healing and peace. She tells no one, but their hum follows her as she struggles to survive against the Institute’s cold and damaging methods, as she meets an outspoken and unapologetic fellow patient named Sheffield Schoeffler, and as they run away, toward the freewheeling and accepting glow of 1960s Greenwich Village, where they create their own kind of family among the artists and wanderers who frequent the jazz bars and side streets.As Gloria tries to outrun her past, experiencing profound love—and loss—and encountering a host of unlikely characters, including her Uncle Eddie, a hard-drinking former boyfriend of her mother’s, to Madame Zelda, a Coney Island fortune teller, and Jacob, the man she eventually marries but whose dark side threatens to bring disaster, the bees remain. It’s only when she needs them most that Gloria discovers why they’re there.Moving from the suburbs of New Jersey to the streets of New York to the swamps of North Carolina and back again, Lost in the Beehive is a poignant novel about the moments that teach us, the places that shape us, and the people who change us.",
  "genres": [
    "Fiction",
    "LGBT",
    "Historical Fiction",
    "Magical Realism",
    "Queer",
    "Adult",
    "Contemporary"
  ],
  "author": "Michele Young-Stone",
  "average_rating": "4.07",
  "url": "https://www.goodreads.com/book/show/36101334-lost-in-the-beehive"
}