{
  "title": "Trumped Up: How Criminalization of Political Differences Endangers Democracy",
  "description": "\"There are great legal minds; there are those who can also communicate well on television; then there is Dershowitz. The professor is uniquely capable of arguing a position, while putting a premium on legal and ethical legitimacy, not its popularity. Bravo, Dershowitz!\" – Chris Cuomo, anchor and reporter, CNN \"This collection shows Alan Dershowitz at his best—passionate, fearless, and occasionally very wrong.\" – Jeffrey Toobin, bestselling author of The Nine, Too Close to Call, A Vast Conspiracy, and The Run of His Life. \"Alan Dershowitz doesn’t twist the constitution to fit an agenda. He tells you what it REALLY means. That’s why he has always been my go-to guy on the law and the Constitution.\" – Greta Van Susteren, former anchor at CNN, Fox News Channel, and MSNBC \"This book will reinforce Alan Dershowitz’s well-earned reputation as a brilliant legal analyst who, although often swimming against the established current, is usually right. Dershowitz substitutes his trenchant legal analysis for the wishful thinking and self-aggrandizing moral superiority that is presented by many in the academy and media, as well as Trump’s political opponents. Dershowitz’s arguments should cause all rational citizens to take a deep breath and recognize, as Dershowitz demonstrates, that Trump may be many things, but, under current law and the known evidence, the President is not a criminal. His analysis seems flawless to me.\" – Harvey A. Silverglate, Criminal and civil liberties lawyer, author of Three Felonies a How the Feds Target the Innocent In our current age of hyper-partisan politics, nearly everyone takes sides. This is especially true with regard to the Trump presidency. It has become difficult to have a reasonable discussion about the most controversial president in our recent history. For Trump zealots, their president has not only committed no crimes, he has done nothing wrong. For anti-Trump zealots, nothing Trump has done—even in foreign policy—is good. Everything he has done is wrong, and since it is wrong, it must necessarily be criminal. This deeply undemocratic fallacy—that political sins must be investigated and prosecuted as criminal—is an exceedingly dangerous trend. Hardening positions on both sides has been manifested by increasing demands to criminalize political differences. Both sides scream “lock ‘em up” instead of making substantive criticisms of opposing views. The real fear, as Alan Dershowitz argues, in this compelling collection, is that we have weakened our national commitment to civil liberties as the Left becomes ever more intolerant and the Right slips into authoritarian rhetoric. The vibrant center is weakening, with traditional liberalism and conservatism becoming further apart, not just in approach, but in their respect for Constitutional norms that have served us well for more than two centuries. While Donald Trump is not the only cause of this profound division, his election drew it to the surface and made it the dominant paradigm of political debate. Unless we as a nation begin to focus again on what unites us rather than on what divides us, America might not survive the next decade.",
  "genres": [
    "Politics",
    "Nonfiction"
  ],
  "author": "Alan M. Dershowitz",
  "average_rating": "3.90",
  "url": "https://www.goodreads.com/book/show/36100304-trumped-up"
}