{
  "title": "Unforgivable",
  "description": "Alternate cover edition of ISBN 9781999709167The Earl of Stanhope—the most notorious philanderer in all of England—has done the unthinkable.  Fallen in love with his own wife...After a traumatic illness robs her of her looks, Rose Davenport has little expectation of making a good marriage—until her feckless father, Miles, unexpectedly brokers a dazzling match for her with the heir to the Earl of Stanhope. Unfortunately, the marriage doesn’t live up to her hopes. Instead of the kindly bridegroom she’s expecting, Rose gets a sullen young husband who can barely stand to look at her.Gil Truman is in love with the beautiful Tilly when his father informs him that he must instead marry plain, sickly Rose. Forced to agree to the marriage to recover the family fortune his father lost to Miles Davenport in a game of cards, Gil is bitter and heartbroken. Their wretched wedding trip ends with him abandoning Rose at his remote Northumbrian estate, intending never to return.After five years of exile, Rose loses patience and travels to London to make a bid at seducing her errant, faithless husband. But their first encounter at a masked ball changes everything. When Rose learns the secret truth of how Gil was blackmailed into their marriage, her appetite for revenge dissolves. It’s too late to turn back, though. Their night of passion has had consequences that force Rose to confront Gil again. Gil’s discovery that the lovely, masked stranger he fell for is none other than his own wife, leaves him feeling sick and betrayed. As for Rose, she has deep wounds of her own from years of Gil’s neglect. With such unpromising beginnings, can Rose and Gil make any kind of life together? Or are some wrongs too painful to ever be forgiven?Note: trigger warnings are located on the copyright page since these include a plot spoiler. These may accessed by using the ‘look inside’ feature or by downloading a free sample.",
  "genres": [
    "Historical Romance",
    "Historical",
    "Romance",
    "Second Chance",
    "Regency",
    "Historical Fiction",
    "Adult"
  ],
  "author": "Joanna Chambers",
  "average_rating": "3.62",
  "url": "https://www.goodreads.com/book/show/36124438-unforgivable"
}