{
  "title": "Frost Security: The Complete 5 Books Series",
  "description": "A Kindle Unlimited Bundle... 5 Books. Full Length. No Cliffhangers. More than 1,000 pages :)  In the mountains of Colorado, a small town named Enchanted Rock seems to always be in need of protection. Luckily, the shifters of Frost Security call this town home.   RICHARD For years, Richard Murdoch served in Afghanistan, a lone wolf shifter always on the prowl for his true calling in life. Now that Richard has helped found Frost Security with his pack, he may have finally found his true calling, his true mate: an art gallery owner in need of protection from a psycho stalker who wants her either run out of town, or dead.  FRANK Frank O'Dwyer, ex-military bodyguard for Frost Security, failed at his job once before. He loved a woman and let his feelings for her cloud his judgment when he was supposed to be protecting her. Because of his screw-up, she ended up dead. Now, as he meets his newest client for the first time, he begins to worry he'll make the same mistake. Even worse, this time he'd be failing his true mate.  JACOB Jacob Wayne is ex-Marine Special Forces and a fallen homicide detective. Now, at Frost Security, he thinks he may have found a home. But at what cost? All he does is track the occasional criminal that skipped their bond, or fraud investigation. Hell, he's not even a great shifter! He can barely control his instincts when he's in his wolf form. Until, that is, he meets the woman who smells of sun and desert flowers. Has he found his true mate? And his purpose? Or is this just another dead end lead?  MATTHEW Matthew Jones was Pararescue in the Air Force, an elite soldier who dropped in behind enemy lines to save the lives of the men and women who were shot down. Now, as an arson investigator and volunteer firefighter, he's Frost Security's go-to shifter on arson investigation. But, when beautiful Rebecca Stokes, a local high school English teacher, comes to him looking for help to find the man who framed her Uncle Zeke for the crime of burning down his own hardware store, Matthew realizes that his feelings for her are hotter than even the fires he's paid to investigate.  PETER Peter Frost, alpha shifter, ex-Navy SEAL, and leader of Frost Security has spent his life in search of something. Whether it's the people who murdered his family while he was overseas serving his country, a pack to call his own, or Vanessa Springer, the mate he once thought dead . . . what he's sought has always seemed just out of reach.  Vanessa Springer is a woman on the run. Ever since the murder of her and Peter's pack fifteen years before, she's stayed one step ahead of the people who killed her friends and family by embracing the outlaw lifestyle. Now, she's found Peter Frost again, and realized that everything his father said about him was a lie. He doesn't want to be more human than wolf, and he does embrace his shifter heritage.  Or does he? Because she knows secrets about Peter's heritage that he denies, and if he's unwilling to listen to Vanessa, they may not be able to defend themselves against the threat looming over Enchanted Rock.",
  "genres": [],
  "author": "Glenna Sinclair",
  "average_rating": "4.19",
  "url": "https://www.goodreads.com/book/show/36115542-frost-security"
}