{
  "title": "The Golden Guard Trilogy",
  "description": "A magical murder mystery. An unlikely love story between a prince and a mercenary. A tale of survival and friendship.This complete series, omnibus edition, contains three, stand-alone stories, about six men and women; tied together by an epic journey to become the most legendary knights in the Solaris Empire. This is perfect for young adult, epic fantasy fans looking for quick-read, sword and sorcery stories!THE CROWN’S DOG (Book One)Jax Wendyll is haunted by the unspeakable crimes of his past and conscripted into service of the crown as punishment. However, most of his duties involve wrangling in the antics of the youngest prince, Baldair. When Jax, Baldair, and Erion—a Western Lord and friend to both—head to the coast in pursuit of lost pirate treasure, a violent murder will change their lives forever.THE PRINCE’S ROGUE (Book Two)The Empire is at war, and Prince Baldair’s metal will be tested as he marches north for the first time. However, during a stop-off in the West, he meets a mysterious swordswoman, Raylynn Westwind. Baldair seeks her skill for his Golden Guard, but the price of Raylynn’s loyalty may be even greater than the bounty on her head.THE FARMER’S WAR (Book Three)Lieutenant Craig Youngly has only ever wanted to join the illustrious Golden Guard. In pursuit of this goal, he has found himself protégé to Raylynn Westwind. When a mission for the guard arises, Craig is ready to jump at the opportunity to prove himself. What he didn’t expect was being saddled with farmer-turned-soldier Daniel Taffl. In the perilous jungles of the North, anything can go wrong.More about the  The Golden Guard Trilogy is a young adult, epic fantasy, with themes of sword and sorcery, coming of age, and deep friendships. It is composed of two short novels (The Crown’s Dog and The Prince’s Rogue) at approximately 50,000 words and one novella (The Farmer’s War) at approximately 30,000 words. All three stories are bundled together in this omnibus edition. Each story is told in dual point of view. While each novel tells its own contained story and could be read on its own, it is recommended to read them in order to capture the full evolution of these characters.While it is set in the Air Awakens world, readers can begin with this series.",
  "genres": [
    "Fantasy",
    "Young Adult",
    "Audiobook",
    "Amazon",
    "Fiction",
    "Epic Fantasy"
  ],
  "author": "Elise Kova",
  "average_rating": "4.34",
  "url": "https://www.goodreads.com/book/show/36111024-the-golden-guard-trilogy"
}