{
  "title": "16 Millimeters",
  "description": "Body doubles, dead bodies, and hot bodies abound…Wait, what?“Fresh from Hollywood get ready to bubble along with Maizie Albright Star Detective. She’s #adorbs.” —Jena’s Books#StillAWannabeDetective In continuing her career-makeover quest as a for-real detective, ex-teen and reality star Maizie Albright has a big learning curve to overcome. A sleuthing background starring in a TV show— Julia Pinkerton, Teen Detective—does not cut the real life mustard. It doesn’t even buy her lunch, let alone extra condiments. Her chosen mentor, Wyatt Nash of Nash Security Solutions, is not a willing teacher. He’d rather stick Maizie with a safe desk job and handle the security solution-ing himself. But Maizie’s got other plans to help Nash. First, win Nash’s trust. Second, his heart.Wait, not his heart. His respect. His hearty respect.So when a major movie producer needs a babysitter for his hot mess starlet, Maizie eagerly takes the job. But when her starlet appears dead, and then not dead, Maizie’s got more than an actress to watch and a missing corpse to find. Body doubles, dead bodies, and hot bodies abound when the big screen, small screen, and silent screams collide. Maizie’s on the job, on the skids, and on thin ice, hunting a killer who may be a celebrity stalker. And Maizie just might be the next celebrity who gets snuffed.Related subjects cozy mysteries, women sleuths, murder mystery series, whodunit mysteries (whodunnit), humorous murder mysteries, amateur sleuth books, Southern humor, humorous women’s fiction, chick lit, former child stars, romantic comedies, mothers and daughters, movie stars, Hollywood satire, and small town humor\"Child star and hilarious hot mess Maizie Albright trades Hollywood for the backwoods of Georgia and pure delight ensues. Maizie’s my new favorite escape from reality.” — Gretchen Archer, USA Today bestselling author of the Davis Way Crime Caper series“Hollywood glitz meets backwoods grit in this fast-paced ride on D-list celeb Maizie Albright's waning star—even as it's reborn in a spectacular collision with her nightmarish stage mother, her deer-pee-scented-apparel-inventing daddy...and a murderer. Sassy, sexy, and fun.” — Phoebe Fox, author of the BreakUp Doctor series“A new series that boasts a quirky cast of characters, engaging dialogue and the liveliness that befits this delightfully amusing and fast-paced drama.” — Dru Ann Love, Dru’s Book Musings“Despite the movie star background Maize is down to earth and cares about everyone and justice. The situations that she finds herself in are humorous, but she isn’t a joke. She is a feisty, perceptive young woman.” — Lynn Farris, Hot Mystery Review",
  "genres": [
    "Mystery",
    "Cozy Mystery",
    "Chick Lit",
    "Amateur Sleuth",
    "Cozy",
    "Romance",
    "Murder Mystery"
  ],
  "author": "Larissa Reinhart",
  "average_rating": "4.35",
  "url": "https://www.goodreads.com/book/show/36117435-16-millimeters"
}