{
  "title": "Smugglers' Summer",
  "description": "What a difference there is in the way our two young ladies view a summer spent at an isolated castle in Wales! To beautiful young Julia Langston, used to the doings of the ton, it is a dreary incarceration; her father has banished her from London in the hope she will forget her most unsuitable suitor, James Winn. But to Octavia Gray, her plumpish, rather plain cousin, just to able to leave her busy home, where the hum of political discourse dominates all conversations, and see the countryside for the first time, is an adventure.At Cotehele are only Tavy's languid aunt, her sullen cousin, and Julia's once-rejected suitor whose next proposal her parents hope will be accepted. Julia has no time for the engaging (and wealthy) Sir Tristram Deanbridge, however. To her cousin's half-listening ears, Julia must eternally sing the praises of her beloved. The young man, a gentleman without means, is a political radical whose essays, if not his actions, are fiery. An odd choice, indeed, for a diehard Tory's butterfly daughter, but who can predict where a heart might light?Octavia, summoned to be company for Julia, doesn't have an easy task. Julia wants her sympathy and her help in furthering the forbidden romance with James. Sir Tristram looks to her for reassurance that his chances are still alive. And Octavia finds to her distress that --- dare we tell? --- she herself has a growing romantic interest in the delightful Sir Tristram, although he, alas, is smitten by the uncaring Julia.In spite of all this, there are more adventures for Octavia than merely a change of scene. Before she even reaches the estate, she witnesses a smuggling raid and meets a smuggler himself, once more intriguing than ominous. Shortly after her arrival, Julia's maid transforms her appearance quite astonishingly, and the stay continues to provide a series of exciting adventures and misadventures that the most city-weary young women could wish for. There are searches by the King's men, a fall into the sea (and rescue by the combined efforts of a group of smugglers and a pod of dolphins), secret rooms and passageways, a wounded fugitive to be hidden and nursed, and even a visit by a glittering party of the ton. And although it appears at times that there is no way for true love to win out, do not despair, dear reader. Read on with hope.",
  "genres": [
    "Romance",
    "Regency",
    "Fiction",
    "Historical Romance",
    "Regency Romance",
    "Historical",
    "Historical Fiction"
  ],
  "author": "Carola Dunn",
  "average_rating": "3.83",
  "url": "https://www.goodreads.com/book/show/3611520-smugglers-summer"
}