{
  "title": "Elven Geomancy: An Ancient Oracle of the Elfin Peoples for Divination and Spell Casting",
  "description": "ELVEN GEOMANCY is an original system of divination by The Silver Elves that creates a magical ritual with each forecast. The Silver Elves have created a new divination system for modern elves and faerie folk, drawing from the ancient geomancy of ages past. It differs quite a bit from the traditional geomancy that was used by the ancients and the people of the Renaissance and Middle Ages. That form of geomancy was at one time rather widely known and popular among diviners, although it has, for the most part, fallen out of use today. Elven Geomancy has 128 possible outcomes that give a reply of a series of seven (like the seven pointed star of the elves) oracles as your response. These seven oracles show the step-by-step process or movement toward the realization of your question. The Elven Geomancy method is also a means of creating magical elfin spells to help bring about one's wishes. Eight basic mudras are used as well as mantras for each of the oracles are given for creating your own rituals that you can perform in order to increase the potency of what you wish to achieve. The Silver Elves say: \"We make no claims that our elven way of geomancy is superior to the traditional way of the ancients. Merely that it is different and beloved by these elves. You may, as always, decide for your owns'elf which one, if either, you prefer or if you like both methods. The elven method draws from a wider range of possible outcomes and yet is simpler in form. However, the traditional ancient method is strongly associated with astrology and the astrological houses and so for astrologers it may be a better or more interesting method or at least one that draws on information with which they are already knowledgeable. We are elven astrologers, so we understand the other method, but we still prefer our own for our method is also a powerful means of creating magical elfin spells to help bring about our wishes.\"",
  "genres": [
    "Philosophy",
    "Occult",
    "Spirituality"
  ],
  "author": "The Silver Elves",
  "average_rating": "4.44",
  "url": "https://www.goodreads.com/book/show/36109796-elven-geomancy"
}