{
  "title": "Thrall",
  "description": "Slow. Useless. Failure.  Ness had always tried to do as the masters told her, tried to fulfil her expected purpose within the time allowed. She was a thrall and nothing more. Every pain was a lesson, every hurt was for her betterment. And someday, perhaps, she could earn honour enough to serve the Narada in a household.  But when the masters tire of her repeated failures to produce the allotment required of her, she is chosen, not for the death she expects, but to serve as payment to a people she has never seen, whose ways are strange and utterly impossible for her to accept.  Taken in by a man who claims that he is not her new master, she is troubled when he does not comprehend the defective nature of the thrall he has been given, and how unworthy she is to be in his service.  And, perhaps even more concerning, his persistent belief that she is no slave at all.  ---  The fingers at her chin were gentle as they coaxed her face upward. His fingers were thick and blunt at the ends, lacking in sharp claws or other obvious natural weaponry. But there was strength there as well, and she did not doubt how much harm he could inflict if he so chose.  He said nothing, only looked, and though it was difficult with him so close to her, she managed to keep from glancing up at his eyes directly. She would prefer not to be hit again by the master if she could at all help it.  “Well?” the master asked, his voice tinged with impatience. “Do we have an accord?”  “Olivar,” this Bendan entreated again. “We cannot possibly bring her with us.”  “Yes,” the man objected, rising to his feet. “We can. You may consider her a part of my share.”  He was going to take her? She would be... his?  ---  (Please note that this is the second in the Third Series. While reading them in order is suggested, each novel can stand alone.)",
  "genres": [
    "Aliens",
    "Romance",
    "Science Fiction",
    "Science Fiction Romance",
    "Slow Burn",
    "Fantasy",
    "Fiction"
  ],
  "author": "Catherine   Miller",
  "average_rating": "4.08",
  "url": "https://www.goodreads.com/book/show/36117402-thrall"
}