{
  "title": "Ocean Nomad | The Complete Atlantic Sailing Crew Guide -  How to Catch a Ride & Contribute to a Healthier Ocean",
  "description": "No boat? No budget? No sailing experience? But an urge for ocean adventure... No problem! Sail the Atlantic Ocean as a Crew MemberDiscover what it feels like to wake up on the ocean, breathe the ocean air, taste salty lips, have the wind in your hair, navigate by the stars, live simple and resourceful, and be eye to eye with dolphins. Day in, day out. Travelling an ocean on someone else’s sailing boat is not a straightforward endeavour. To be ready to expect the unexpected, careful investigation and preparation is essential. In this comprehensive crew guide you will discover HOW TO:Start the adventure! Take that first step out the door.Find a boat: where, when and why. Plan, pack, prepare and provision as crew.Check safety, reliability and the happy-factor of the boat, captain & crew.Deal with seasickness, limited resources, waste, watch-keeping & more.Make a positive difference for the health of the ocean. Packed with practical advice and stories, Ocean Nomad guides you from the idea of “someday I would like to go on a sailing trip”, to sipping a coconut on the other side of the Atlantic Ocean celebrating the achievement.“This ambitious guide book is the spark that will ignite your sense of adventure and provoke your compassion to create a better world.” Monique Mills - Captain & Ocean Advocate*****************About the AuthorSuzanne Van Der Veeken hitched her first ride across the Atlantic as a complete newbie to the world of sailing. She has now sailed across the Atlantic three times on a strangers’ sailboat. In fact, she has explored almost every ocean on the planet with this alternative way of travel. She has figured out how (and how not) to catch rides on other people’s boats. Her ocean adventures have amazed her to the beauty of nature, but also the challenges the oceans are facing. With Ocean Nomad Suzanne aims to help adventure-seekers experience the magic of the high seas, to broaden horizons, and encourage positive change for the ocean. You can learn more about the author on theOceanpreneur.comThe book is available at www.OceanNomad.co",
  "genres": [],
  "author": "Suzanne van der Veeken",
  "average_rating": "4.86",
  "url": "https://www.goodreads.com/book/show/36121648-ocean-nomad-the-complete-atlantic-sailing-crew-guide---how-to-catch-a"
}