{
  "title": "Shoot an Iraqi: Art, Life and Resistance Under the Gun",
  "description": "Wafaa Bilal’s childhood in Iraq was defined by the horrific rule of Saddam Hussein, two wars, a bloody uprising, and time spent interned in chaotic refugee camps in Kuwait and Saudi Arabia. Bilal eventually made it to the United States to become a professor and a successful artist, but when his brother was killed at a checkpoint in Iraq in 2005, he decided to use his art to confront those in the comfort zone with the realities of life in a conflict zone.Thus the creation and staging of “Domestic Tension,” an unsettling interactive performance piece: for one month, Bilal lived alone in a prison cell-sized room in the line of fire of a remote-controlled paintball gun and a camera that connected him to Internet viewers around the world. Visitors to the gallery and a virtual audience that grew by the thousands could shoot at him twenty-four hours a day. The project received overwhelming worldwide attention, garnering the praise of the Chicago Tribune, which called it “one of the sharpest works of political art to be seen in a long time,” and Newsweek’s assessment “breath taking.” It spawned provocative online debates, and ultimately, Bilal was awarded the Chicago Tribune’s Artist of the Year Award.Structured in two parallel narratives, the story of Bilal’s life journey and his “Domestic Tension” experience, this first-person account is supplemented with comments on the history and current political situation in Iraq and the context of “Domestic Tension” within the art world, including interviews with art scholars such as Dean of the School of Art at Columbia University, Carol Becker, who also contributes the introduction. Shoot an Iraqi is equally pertinent reading for those who seek insight into the current conflict in Iraq and for those fascinated by interactive art technologies and the ever-expanding world of online gaming.",
  "genres": [
    "Art",
    "Nonfiction",
    "Read For School",
    "Biography",
    "School",
    "Memoir"
  ],
  "author": "Wafaa Bilal",
  "average_rating": "4.27",
  "url": "https://www.goodreads.com/book/show/3612389-shoot-an-iraqi"
}