{
  "title": "True Story: Murder, Memoir, Mea Culpa",
  "description": "In the haunting tradition of Joe McGinniss's Fatal Vision and Mikal Gilmore's Shot in the Heart, True Story: Murder, Memoir, Mea Culpa weaves a spellbinding tale of murder, love, and deceit with a deeply personal inquiry into the slippery nature of truth.The story begins in February of 2002, when a reporter in Oregon contacts New York Times Magazine writer Michael Finkel with a startling piece of news. A young, highly intelligent man named Christian Longo, on the FBI's Ten Most Wanted list for killing his entire family, has recently been captured in Mexico, where he'd taken on a new identity -- Michael Finkel of the New York Times.The next day, on page A-3 of the Times, comes another bit of troubling news: a note, written by the paper's editors, explaining that Finkel has falsified parts of an investigative article and has been fired. This unlikely confluence sets the stage for a bizarre and intense relationship. After Longo's arrest, the only journalist the accused murderer will speak with is the real Michael Finkel. And as the months until Longo's trial tick away, the two men talk for dozens of hours on the telephone, meet in the jailhouse visiting room, and exchange nearly a thousand pages of handwritten letters.With Longo insisting he can prove his innocence, Finkel strives to uncover what really happened to Longo's family, and his quest becomes less a reporting job than a psychological cat-and-mouse game -- sometimes redemptively honest, other times slyly manipulative. Finkel's pursuit pays off only at the end, when Longo, after a lifetime of deception, finally says what he wouldn't even admit in court -- the whole, true story. Or so it seems.",
  "genres": [
    "True Crime",
    "Nonfiction",
    "Memoir",
    "Crime",
    "Biography",
    "Audiobook",
    "Mystery"
  ],
  "author": "Michael Finkel",
  "average_rating": "3.90",
  "url": "https://www.goodreads.com/book/show/361148.True_Story"
}