{
  "title": "Rage",
  "description": "New cover edition found here.*** Winner of Best Book Overall in the 2018 Daphne du Maurier Awards for Excellence in Mystery and Suspense***A wounded veteran, who lost his purpose when he lost his legs in battle, and a single mother who only sees the hero he's become.He's lost his purpose...Callum McKay was an SAS officer when a car bomb took his legs. After his recovery, he became partner in the international security firm that dealt with the things governments weren't able to deal with.As far as Callum was concerned, he was still the same able, competent and commanding guy he was before his accident. And then, he was proven wrong. After a screwed up mission in South America, Callum realized he wasn't an asset to his team. He was a liability. With his purpose and faith in his abilities shattered, Callum turned his back on his security company and returned to the house his grandfather left him in Arness, Scotland. He was no longer fit for action. He was no longer fit for life. He was no use to anyone at all....she's giving it back...whether he wants it or not!Single mother Isobel Sinclair has made a lot of stupid decisions in her life. But the dumbest one had to be removing a dead body from the beach outside of her house in the tiny village of Arness. She panicked when she saw the dead man and was too scared to call the police, in case they found out her secrets and threw her in jail. Who would look after her kids if she was gone? No, there was no calling the police. That's why the body ended up in her freezer and she ended up knocking on the door of the most terrifying man in Arness, to ask for his help. A man who was obviously hiding from the world. A man who didn't want to get involved. But a man who wasn't going to get a choice in the matter--because only Callum McKay could help her now.",
  "genres": [
    "Romance",
    "Suspense",
    "Contemporary",
    "Romantic Suspense",
    "Military Fiction",
    "Action",
    "Amazon"
  ],
  "author": "Janet Elizabeth Henderson",
  "average_rating": "4.51",
  "url": "https://www.goodreads.com/book/show/36135144-rage"
}