{
  "title": "Sadness Is a White Bird",
  "description": "In this lyrical and searing debut novel written by a rising literary star and MacDowell Fellow, a young man is preparing to serve in the Israeli army while also trying to reconcile his close relationship to two Palestinian siblings with his deeply ingrained loyalties to family and country.The story begins in an Israeli military jail, where—four days after his nineteenth birthday—Jonathan stares up at the fluorescent lights of his cell, and recalls the series of events that led him there.  Two years Moving back to Israel after several years in Pennsylvania, Jonathan is ready to fight to preserve and defend the Jewish state, which his grandfather—a Salonican Jew whose community was wiped out by the Nazis—helped establish. But he is also conflicted about the possibility of having to monitor the occupied Palestinian territories, a concern that grows deeper and more urgent when he meets Nimreen and Laith—the twin daughter and son of his mother’s friend. From that winter morning on, the three become wandering the streets on weekends, piling onto buses toward new discoveries, laughing uncontrollably. They share joints on the beach, trading snippets of poems, intimate secrets, family histories, resentments, and dreams. But with his draft date rapidly approaching, Jonathan wrestles with the question of what it means to be proud of your heritage and loyal to your people, while also feeling love for those outside of your own tribal family. And then that fateful day arrives, the one that lands Jonathan in prison and changes his relationship with the twins forever. Powerful, important, and timely, Sadness Is a White Bird explores one man’s attempts to find a place for himself, discovering in the process a beautiful, against-the-odds love that flickers like a candle in the darkness of a never-ending conflict.",
  "genres": [
    "Fiction",
    "Jewish",
    "Israel",
    "Historical Fiction",
    "Contemporary",
    "Book Club",
    "Literary Fiction"
  ],
  "author": "Moriel Rothman-Zecher",
  "average_rating": "4.07",
  "url": "https://www.goodreads.com/book/show/36129150-sadness-is-a-white-bird"
}