{
  "title": "Warrior's Pain",
  "description": "Riley was sick of constantly getting the short end of the stick. If it wasn’t enough that she’d been sent to prison for her brother’s crimes, then got abducted by aliens; being hauled onto the auction block certainly took the cake.“You know what, fine, bring it on!”Unwittingly, Riley goaded Fate into throwing everything it could at her, and it did. The sadistic b****, Destiny, put not only the lives of thousands into her trembling hands, but then it twisted the knife, making Riley fall for a man who was untouchable.“Life isn’t fair,” Riley gave a slight bitter laugh, her chin quivering. “It culls the sick and the weak from the herd with cruel efficiency. It doesn’t care if you can’t handle the avalanche that it rains down on you. It doesn’t know the meaning of mercy. It takes and takes, till you have nothing left to give, then casts you aside.” But Riley refused to break under the weight of it all. She couldn’t. The human colony, and Earth itself, depended on her. Riley just wished she could trust her instincts about the massive red-skinned alien who showed up at the auction to buy her. Unfortunately, she’d been hurt one too many times to take the risk, and the secrets she kept were more important than the suffering of a lone individual.Cyprian turned his back on his family’s less than honorable legacy, choosing instead to dedicate his life to serving the people of Cadi. It was that dogged focus on his duty, that led Cyprian to the off-world auction, playing the part of a traitor. His mission was to find who was behind a series of abductions, and bring everyone safely back home.Except rescuing the tattooed, dark haired human didn’t happen the way it should have. With her unbreakable spirit and hot body, Riley stripped Cyprian of the control he fought so hard to maintain. Yet the warrior found he couldn’t live without the pain in the a**.“You are mine. I never lied about that,” Cyprian growled at Riley. “You know it’s true. Stop lying to yourself. Don’t force me to tie you up, because you know I will. I may not be able to get you to spill all your secrets, but there’s one thing I’ll force from your lips.” It wasn’t an idle threat. Cyprian would seduce Riley till she admitted she was his.Discover how Riley and Cyprian drive each other mad and fall madly in love, while putting it all on the line to save their people, in Warrior’s Pain.",
  "genres": [
    "Aliens",
    "Science Fiction",
    "Romance",
    "Science Fiction Romance",
    "Erotic Romance",
    "Erotica",
    "Fantasy"
  ],
  "author": "Stephanie  West",
  "average_rating": "4.35",
  "url": "https://www.goodreads.com/book/show/36133065-warrior-s-pain"
}