{
  "title": "Game of the Gods",
  "description": "\"The dystopian novel is alive and well in the blisteringly effective Game of the Gods. Jay Schiffman breathes life into a moribund genre and ends up crafting a sly, shrewd and stunning take on a darkly depraved future that is every bit the equal of The Hunger Games, The Maze Runner, and the Divergent series. Schiffman's striking vision serves up a cloud-riddled tomorrow featuring just enough silver linings to provide hope to an otherwise bleak landscape. A must read for fans of classics like Judge Dredd and Doc Savage.\" --Jon Land, USA Today bestselling author of the Caitlin Strong seriesJay Schiffman's Game of the Gods is a debut sci-fi/fantasy thriller of political intrigue and Speilberg-worthy action sequences in the vein of Pierce Brown's Red Rising.Max Cone wants to be an ordinary citizen of the Federacy and leave war and politics behind. He wants the leaders of the world to leave him alone. But he’s too good a military commander, and too powerful a judge, to be left alone. War breaks out, and Max becomes the ultimate prize for the nation that can convince him to fight again.When one leader gives the Judge a powerful device that predicts the future, the Judge doesn’t want to believe its chilling The world will soon end, and he’s to blame. But bad things start to happen. His wife and children are taken. His friends are falsely imprisoned. His closest allies are killed. Worst of all, the world descends into a cataclysmic global war.In order to find his family, free his friends, and save the world, the Judge must become a lethal killer willing to destroy anyone who stands in his way. He leads a ragtag band of warriors—a 13-year old girl with special powers, a mathematical genius, a religious zealot blinded by faith, and a former revolutionary turned drug addict. Together, they are the only hope of saving the world.At the Publisher's request, this title is being sold without Digital Rights Management Software (DRM) applied.",
  "genres": [
    "Science Fiction",
    "Fiction",
    "Dystopia"
  ],
  "author": "Jay Schiffman",
  "average_rating": "2.96",
  "url": "https://www.goodreads.com/book/show/36142204-game-of-the-gods"
}