{
  "title": "Nuclear Jellyfish",
  "description": "Just when you thought it was safe to go online . . . Serge has returned!That loveable collector of trivia, souvenirs, and murder methods is back with a new A‑Tour of Florida. And this time he's out to set the record straight!Serge is upset that his beloved state isn't getting its proper recognition, so he signs on with the big Internet travel services. But his new employers aren't exactly sure they want to send their customers to Serge's favorite haunts--nor do they want to provide tips on how to keep from getting killed on vacation.Serge couldn't disagree more, and he sets up his own wildcat site, hyper‑blogging his way down the coast with his perpetually hammered sidekick, Coleman.Unfortunately Serge's Web presence catches the attention of his nemesis, Agent Mahoney, and the chase is on.Meanwhile, professional robbery crews have begun targeting trade show exhibitors, who may or may not be what they seem. Bodies begin piling up, which is less than usual for the locale--except this time it involves rare postcards. Serge has had enough! He's forced into the only logical course of action--go shopping at the Home Depot.And this only raises more questions:Who is tutoring strippers through the community college?What sparked the grudge match between coin and stamp enthusiasts?How'd the astronaut in diapers get involved?Why does Serge have to stop at the NASCAR superstore?Where did all these diamonds come from? And does Lynyrd Skynyrd hold the key to everything?It all starts with a tragic tattoo parlor mishap and soon nobody is safe, especially the person on the Robert De Niro stool, because, after all, Serge has to sit there or what's the point of life?But wait! You say you want more? Serge says, You got it!Guns, drugs, bloody crime scenes, historically relevant sex, library quiet time, glow‑in‑the dark deformities, hotel drink coupons, a naked woman in a shark cage, and John Travolta.It's time to sign on with Serge and see where the twisting, sun‑splashed trail leads in . . . Nuclear Jellyfish!",
  "genres": [
    "Mystery",
    "Fiction",
    "Humor",
    "Crime",
    "Audiobook",
    "Thriller",
    "Comedy"
  ],
  "author": "Tim Dorsey",
  "average_rating": "4.10",
  "url": "https://www.goodreads.com/book/show/3614101-nuclear-jellyfish"
}