{
  "title": "A Kingdom Forgotten",
  "description": "We, the seeds of Humanity, are all the descendants of hardened criminals, fighting to survive the unmaking of A Throne of Souls.Magic and technology have already met on a world far more advanced than our own only to dispense their most dangerous and hardened criminals, for magic has been outlawed. Their descendants—us, here on Earth, along with the rest of Humanity—are now left to grapple with a Creation undone at the hands of an outlaw mage whose Master Plan affects the seeds of Humanity throughout the known Universe. This outlaw—this Dark Knight of Magic—must accumulate immeasurable power to thwart the fork of consequences that brought forth the making of A Throne of Souls. This story, this execution of his Master Plan originating centuries into the past, begins and ends with a triad of pivotal relationships and evolves through his understanding of his own soul. Within the Master Plan, the dichotomy between hate and hope, across a landscape far beyond epic, is illustrated through vibrant characters developed over two-and-a-half decades. IndieReader said, “A Kingdom Forgotten is a textured, subtle and all-encompassing book for serious sci-fi fanatics willing to invest in more than one universe, and in all likelihood, willing to re-read it, too.”​OnlineBookClub.org (female reviewer perspective) said, “The level of complexity is astounding. Frankly, I didn’t feel that I knew what was going on for greater than a third of the novel. By the time I did figure out what was going on, I found a compelling story with a plot so different from any others I have read before, that I remained intrigued until the end. The style of storytelling is so radically different that I am undecided as to whether it is brilliant or insane.”OnlineBookClub.org (male reviewer perspective) said, “A Kingdom Forgotten, the first book in the Throne of Souls series by new author Charles McDonald, Jr., is easily the most uniquely written novel I've read in many moons. There is nothing conventional about this book. Part Wheel of Time, part Warhammer 40000, A Kingdom Forgotten presents itself as a multidimensional epic that juxtaposes ancient kingdom magic with modern world science, and potentially vice versa. On a number of occasions, I found myself comparing its asynchronous narrative to the movie Pulp Fiction, where the protagonist isn't always apparent, the hero isn't necessarily the good guy, and the present doesn't make sense until you've seen the future. To be clear, A Kingdom Forgotten was a wild ride from start to finish, and I am extremely eager to begin the sequel, Black Mirrors of the Soul.”Readers’ Favorite said (about A Kingdom Forgotten), “This is a monumental story with its unique kind of conflict and multiple storylines. Readers are introduced to powerful heroes, magic, portals into other worlds and times, medieval settings, and a lot more. The book is intelligently imagined and masterfully executed, and it is important to note that it isn’t a light read. Yes, the story is complex on multiple levels, including the points of views that shift and that can cause some dizziness in the reader, the writing that is extraordinary, fraught with depths of meaning, and the storyline with numerous characters. Charles McDonald Jr. has created a story that is colossal and that combines various elements of the art of storytelling into one place. I was wowed by the writing and the characters, but most importantly, by the author’s ability to unveil the depth of human emotion and consciousness. A Kingdom Forgotten is a story of great magnitude, one to read with focus, a story that will remind readers of their roots.”A Note from the Author:  This intricate, thought-provoking, epic, and cerebral thriller breaks all the rules crossing over Sci-Fi, Fantasy, Fiction, Magical Realism, and Military-Fiction genres but as you start reading A Throne of Souls, it will become apparent why those rules had to be broken to tell this multi-world story of Humanity and Creation.  I don’t believe in traditional ‘good’ vs ‘evil,’ single protagonist saves the world type of stories. My protagonists are not always ‘good,’ and my antagonists are not always ‘bad.’ I believe in strong, multi-faceted characters that reflect the real-world, with real thoughts, emotions, and agendas. I wanted to bring something entirely different to the market and this is about as different as literary fiction gets. My goal was to be worthy of this inimitable story in the way that I tell it—to bring it to you in my voice, but to do so beautifully, elegantly, and intelligently.  There are several things that make this story unique including:•\tA flex-style narrative which illustrates—upon a 360-degree axis—character POV perspective based on their understanding of technology.•\tStorylines that reach back centuries, if not millennia. •\tNonlinearity. There was simply no way to tell this far-reaching story in traditional timeline methodologies.The best way to think of A Throne of Souls is like a massive mosaic with individual nuanced clues of information and disinformation that by themselves might appear to be something you recognize though might not make sense, but when assembled with other clues provide shocking answers to questions you may never have considered. For those who read cover-to-cover all of A Throne of Souls, there is a shocking ending coming in a crystallizing moment that will fall upon you like a cascade of dominoes in a complex configuration as each thread collapses inward upon the storylines. I hope you love surprises. Please enjoy it with all my best hopes and wishes. – Charles W. McDonald Jr.",
  "genres": [],
  "author": "Charles W. McDonald Jr.",
  "average_rating": "3.86",
  "url": "https://www.goodreads.com/book/show/36145538-a-kingdom-forgotten"
}