{
  "title": "Williams-Sonoma Soup of the Day: 365 Recipes for Every Day of the Year",
  "description": "This tantalizing collection of 365 recipes offers a soup for each day of the year. From January to December, you'll find daily inspiration and a seasonal soup that will satisfy any craving or fit any occasion.From refreshing gazpachos in summer to slow-simmered stews in winter, light broths with noodles and greens in spring to warming root vegetable purées come fall, a delicious option awaits. With this book as your guide, find the perfect soup to match each season's ingredients, weather, and sensibility.Endlessly versatile, soup is perfect for any season and every occasion. What better way to capture the essence of spring than by simmering freshly shelled peas and fava beans in a fragrant broth accented by bracing mint and refreshing lemon zest? In summer, a cool gazpacho made by whirling perfectly ripe tomatoes, juicy cucumbers, and vibrant red peppers is fitting for a hot and humid day—no pot necessary! When the air turns brisk, soup nourishes and satisfies like no other dish. In autumn, white beans mingle with sturdy greens in satisfying, peasant-style pots, and starchy squashes and root vegetables blend into silky purées. Winter brings even more soul-warming fare, such as chilis and stews featuring sausages and other hearty meats and thick vegetable soups scented with woodsy herbs.Williams-Sonoma Soup of the Day offers a tantalizing collection of 365 soup recipes: one for each day of the year. Colorful calendars at the beginning of each chapter offer an at-a-glance view of the dishes best suited for the ingredients, occasions, and typical weather of the month. From January to December, you’ll find a seasonal soup that will satisfy any craving, and match any meal ranging from a quick weeknight supper to an elegant dinner party. A handful of the recipes are even appropriate for the holiday table, while others are perfect for using up a leftover roast or chicken. Notes accompanying each recipe offer ideas for ingredient variations, garnishes, and other helpful tips. All of the soups can be dressed up or dressed down; served in rustic earthenware mugs or on heirloom china; garnished with a flourish of fried herbs or dollop of pesto, or stripped down to the bare, tasty essentials—the possibilities are endless, but always delicious.Full-color photographs enhance many of the recipes inside to help guide your cooking. You can start your soup-making journey at any time—just open this book, check the calendar, and you’ll be inspired to create a new soup du jour every day of the year.",
  "genres": [
    "Cookbooks",
    "Cooking",
    "Nonfiction",
    "Food",
    "Reference",
    "Foodie"
  ],
  "author": "Kate McMillan",
  "average_rating": "4.19",
  "url": "https://www.goodreads.com/book/show/12168168-williams-sonoma-soup-of-the-day"
}