{
  "title": "Antarctic Journals of Reginald Skelton",
  "description": "see book trailer:http://www.youtube.com/watch?v=59cA8G...Reginald Skelton Was Chief Engineer, And Offical Photographer To Captain Scott's Discovery Expedition; My memories of my grandfather are of an old, but still fit and upright, man who had a deep gravelly voice and chuckled a lot. I was only ten when he died in 1956 and he never, as far as I can remember, told me anything about his time in the Antarctic. Forty two years after his death we had, in a sense, changed places and I was getting the full story. By then into my fifties, seated in the library at the Scott Polar Research Institute (SPRI) in Cambridge, I began reading the Antarctic journals of Reginald Skelton, not yet out of his twenties, who had been chosen as Scott's chief engineer on the Discovery Expedition. Directly outside the window in front of my desk was the building site which was to become the bright, airy Shackleton Memorial Library. The archivist, Bob Headland, apologised for the terrible noise of the construction work, which he feared would frustrate any attempt to concentrate, but all I could hear was the sound of the Discovery's bows scrunching through the pack ice and the howl of the Antarctic wind as the ship fought to hold her own in the teeth of storm force Southerly squalls off Coulman Island. Since then I have been back to Cambridge to read the seven volumes of Reginald Skelton's Discovery Journals, and his sledging diaries, more times than I can keep track of but every time something new catches my attention. There is a freshness in this account, written by a young man describing events even as they take place, as he experiences them without knowing what is to follow, which is lost in any retrospective telling of the tale. Through the publication of this book I hope many other people, who would not otherwise have the opportunity to read the original journals, will be able to share the pleasure of vicarious participation in the Expedition. There is another purpose in bringing this book to the public. Skelton, whose name is by no means universally known, was, nevertheless, an important member of the Expedition and many books about Discovery include quotations from his journals. Since becoming familiar with the journals, I have found out that not all these passages are faithfully reproduced. I am aware of at least two supposedly scholarly books which contain misquotations from Skelton's journals. Whereas innocent mistakes can be made in interpreting hand-written documents, the distortion in some instances is of an order which suggests deliberate misrepresentation. The present book gives all serious students of the history of Antarctic exploration access to the full authentic text.",
  "genres": [],
  "author": "Reginald William Skelton",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/3614565-antarctic-journals-of-reginald-skelton"
}