{
  "title": "The Wallflower's Wicked Wager",
  "description": "He loved her beyond anything and everything—precisely why he couldn’t ever marry her. A wounded hero. Love—sentimental drivel for insipid, weak, feckless fools. Since an explosion ravaged Captain Morgan Le Draco’s face and cost him his commission in the Royal Dragoons, he’s fortified himself behind an impenetrable rampart of cynicism and distrust. Now destitute and shunned by the very society that once lauded his heroics, he’s put aside all thoughts of marrying and having a family. Until he risks his life to save a drowning woman. At once, Morgan knows Shona’s the balm for his tortured soul, but as a wealthy, titled noblewoman, she’s too far above his humble station and can never be his. An intrepid wallflower. Love—a treasured gift reserved for those beautiful of form and face. Scorned and ridiculed most of her adult life, Shona, Lady Atterberry believes she’s utterly undesirable and is reconciled to spinsterhood. She hides her spirited temperament beneath a veneer of gauche shyness, until a strapping, scarred stranger saves her life, and she can’t deny her immediate, powerful, and sensual attraction to him. Despite how ill-suited they are and innuendos that Captain Le Draco is a fortune-hunter, she cannot escape her growing fascination. Two damaged souls searching for love. Others are determined to keep them apart, and Shona is goaded into placing a wicked wager. One that sets her upon a ruinous path and alienates the only man who might have ever loved her. Is true love enough to put their pasts behind them, to learn to trust, and heal their wounded hearts? Warning: This book contains one devilish, seemingly irredeemable rogue, an on-the-shelf wallflower who dabbles in wicked wagers, an unexpected and most enticing swim in a lake, a villainess you’ll want to shove into said lake, and a cast of captivating secondary characters with their own tantalizing romantic tales.",
  "genres": [
    "Historical Romance",
    "Romance",
    "Historical",
    "Novella",
    "Regency",
    "Historical Fiction",
    "Regency Romance"
  ],
  "author": "Collette Cameron",
  "average_rating": "4.19",
  "url": "https://www.goodreads.com/book/show/36157392-the-wallflower-s-wicked-wager"
}