{
  "title": "This Will Be My Undoing: Living at the Intersection of Black, Female, and Feminist in (White) America",
  "description": "From one of the fiercest critics writing today, Morgan Jerkins’ highly-anticipated collection of linked essays interweaves her incisive commentary on pop culture, feminism, black history, misogyny, and racism with her own experiences to confront the very real challenges of being a black woman today—perfect for fans of Roxane Gay’s Bad Feminist, Rebecca Solnit’s Men Explain Things to Me, and Chimamanda Ngozie Adichie’s We Should All Be Feminists.\nMorgan Jerkins is only in her twenties, but she has already established herself as an insightful, brutally honest writer who isn’t afraid of tackling tough, controversial subjects. In This Will Be My Undoing, she takes on perhaps one of the most provocative contemporary topics: What does it mean to “be”—to live as, to exist as—a black woman today? This is a book about black women, but it’s necessary reading for all Americans.Doubly disenfranchised by race and gender, often deprived of a place within the mostly white mainstream feminist movement, black women are objectified, silenced, and marginalized with devastating consequences, in ways both obvious and subtle, that are rarely acknowledged in our country’s larger discussion about inequality. In This Will Be My Undoing, Jerkins becomes both narrator and subject to expose the social, cultural, and historical story of black female oppression that influences the black community as well as the white, male-dominated world at large. Whether she’s writing about Sailor Moon; Rachel Dolezal; the stigma of therapy; her complex relationship with her own physical body; the pain of dating when men say they don’t “see color”; being a black visitor in Russia; the specter of “the fast-tailed girl” and the paradox of black female sexuality; or disabled black women in the context of the “Black Girl Magic” movement, Jerkins is compelling and revelatory.",
  "genres": [
    "Nonfiction",
    "Feminism",
    "Essays",
    "Memoir",
    "Race",
    "Social Justice",
    "Audiobook"
  ],
  "author": "Morgan Jerkins",
  "average_rating": "4.04",
  "url": "https://www.goodreads.com/book/show/36153017-this-will-be-my-undoing"
}