{
  "title": "The Praying Nun - A Slave Saga Book 1",
  "description": "An ivory carving recovered from an uncharted shipwreck connects modern treasure hunters to Chikunda, a slave fighting to protect his wife aboard the 1794 slave ship, The São José Paquete Africa.As one of the ship’s discoverers, Part 1 of the novella is an adventure that puzzles over the identity of the cannons, nails and what seemed to be horse stirrups that recovered from the uncharted and wreck found and registered by this author in the 1980s.Then, in June 2015, CNN/BBC/New York Times, etc, announced that “The Smithsonian Institute of Washington have identified a massive discovery” off our coast -- the first and only slave ship in history ever to wreck while carrying slaves, and then be found.A sickening realization struck that those ‘horse stirrups’ were nothing of the kind… they were leg shackles.In 1794 The São José Paquete Africa, a Portuguese slaver bound from Mozambique to Brazil with 400 aboard, wrecked behind the waves in what is today one of the world’s most iconic beaches. Of the 400 captives, 200 drowned in the holds. The 200 survivors were rounded up and marched over a mountain pass to be sold the next day in the Dutch settlement at Cape Town, Cape of Good Hope.This book is dedicated to the honor of those who died so brutally. It begins as an adventure story of exploration, recovery, and pondering over the mystery.‘Part 2’ of the story takes the reader aboard the fated ship, where we meet Chikunda, a man of rare dignity and bearing.Captured and sold as Chikunda and his new wife, Faith, were while traveling in Mozambique to celebrate their nuptials with her family, the carving that he had whittled with his own hands was his wedding gift to her…. It is her only tiny possession and one she refuses to surrender no matter the consequences her obstinance brings.*The Praying Nun is followed by its sequel, \"The Reckoning\" and soon to be released \"The Accord\".Wilbur Smith or Clive Cussler fans will be riveted by this fact-inspired fictional tale, based as it is by personal experience, extensive research and the legacy of artifacts salvaged from the São José de Africa. Pick it up now to go on the adventure of a lifetime.",
  "genres": [
    "Historical Fiction"
  ],
  "author": "Michael Smorenburg",
  "average_rating": "4.56",
  "url": "https://www.goodreads.com/book/show/36152031-the-praying-nun---a-slave-saga-book-1"
}