{
  "title": "Machine Learning with Neural Networks: An In-depth Visual Introduction with Python: Make Your Own Neural Network in Python: A Simple Guide on Machine Learning with Neural Networks.",
  "description": "Make Your Own Neural Network in Python A step-by-step visual journey through the mathematics of neural networks, and making your own using Python and Tensorflow.  What you will gain from this * A deep understanding of how a Neural Network works. * How to build a Neural Network from scratch using Python. Who this book is * Beginners who want to fully understand how networks work, and learn to build two step-by-step examples in Python. * Programmers who need an easy to read, but solid refresher, on the math of neural networks. What’s Inside - ‘Make Your Own Neural An Indepth Visual Introduction For Beginners’ What Is a Neural Network? Neural networks have made a gigantic comeback in the last few decades and you likely make use of them everyday without realizing it, but what exactly is a neural network? What is it used for and how does it fit within the broader arena of machine learning?we gently explore these topics so that we can be prepared to dive deep further on. To start, we’ll begin with a high-level overview of machine learning and then drill down into the specifics of a neural network.The Math of Neural Networks On a high level, a network learns just like we do, through trial and error. This is true regardless if the network is supervised, unsupervised, or semi-supervised. Once we dig a bit deeper though, we discover that a handful of mathematical functions play a major role in the trial and error process. It also becomes clear that a grasp of the underlying mathematics helps clarify how a network learns.* Forward Propagation * Calculating The Total Error * Calculating The Gradients * Updating The Weights Make Your Own Artificial Neural Hands on Example You will learn to build a simple neural network using all the concepts and functions we learned in the previous few chapters. Our example will be basic but hopefully very intuitive. Many examples available online are either hopelessly abstract or make use of the same data sets, which can be repetitive. Our goal is to be crystal clear and engaging, but with a touch of fun and uniqueness. This section contains the following eight chapters.Building Neural Networks in Python There are many ways to build a neural network and lots of tools to get the job done. This is fantastic, but it can also be overwhelming when you start, because there are so many tools to choose from. We are going to take a look at what tools are needed and help you nail down the essentials. To build a neural networkTensorflow and Neural Networks There is no single way to build a feedforward neural network with Python, and that is especially true if you throw Tensorflow into the mix. However, there is a general framework that exists that can be divided into five steps and grouped into two parts. We are going to briefly explore these five steps so that we are prepared to use them to build a network later on. Ready? Let’s begin.Neural Distinguish Handwriting We are going to dig deep with Tensorflow and build a neural network that can distinguish between handwritten numbers. We’ll use the same 5 steps we covered in the high-level overview, and we are going to take time exploring each line of code.",
  "genres": [
    "Programming",
    "Computer Science",
    "Artificial Intelligence",
    "Nonfiction",
    "Technology",
    "Science",
    "Textbooks"
  ],
  "author": "Michael Taylor",
  "average_rating": "3.99",
  "url": "https://www.goodreads.com/book/show/36153846-machine-learning-with-neural-networks"
}