{
  "title": "First Snow, Last Light",
  "description": "From the author of the critically acclaimed, prizewinning and internationally bestselling  The Colony of Unrequited Dreams  comes an epic family mystery with a powerful, surprise ending, which features the return of the ever-fascinating Sheilagh Fielding, one of the most memorable characters in fiction.Ned Vatcher, only 14, ambles home from school in the chill hush that precedes the first storm of the winter of 1936 to find the house locked, the family car missing, and his parents gone without a trace. From that point on, his life is driven by the need to find out what happened to the Vanished Vatchers. His father, Edgar, born to a poor family of fishermen, had risen to become the right-hand man to the colony's prime minister, then suffered an unexpected fall from grace. Were he and his wife murdered? Was it suicide? Had they run away? If so, why had they left their only child behind?    Ned soon finds himself enmeshed in another family, that of his missing father and the poverty from which the man somehow escaped. His grandparents, Nan and Reg, his Uncle Cyril and others, are themselves haunted by the inexplicable disappearance of a third Vatcher, a young man who was lost at sea on a calm and sunny day years earlier. Two other people loom large as Ned becomes Newfoundland's first media mogul, building an empire to insulate him from a Jesuit priest named Father Duggan, and Sheilagh Fielding, a boozy giantess who, while wandering the city streets at night, composes satiric columns that scandalize the rich and powerful. In Ned, Fielding sees a surrogate for her two lost children, the secret that dogs her life, while Ned believes the enigmatic Fielding to be his soulmate.     The novel builds to a spectacular resolution of the mystery of all the Vanished Vatchers. Only Wayne Johnston could create such larger-than-life, mythic characters embroiled in events that leave us contemplating not only their tragedies and triumphs, but the forces that compel us all to act in ways that surprise and sometimes terrify us.",
  "genres": [
    "Canada",
    "Fiction",
    "Mystery",
    "Historical Fiction",
    "Book Club",
    "Canadian Literature",
    "Literary Fiction"
  ],
  "author": "Wayne Johnston",
  "average_rating": "3.81",
  "url": "https://www.goodreads.com/book/show/36161741-first-snow-last-light"
}