{
  "title": "Echoes",
  "description": "“You’ve started a countdown equivalent to a nuclear bomb detonation. And once the weapon latches onto a goal, there’s not a person on earth who can change it.”Emma White is the most dangerous weapon the world has ever seen. She’s not a child; she’s a hurricane, an earthquake, a force of nature. She’s been trained as the world’s most deadly assassin – capable of stopping and starting wars as easily as others breathe. Under her skin crackles the type of power that most people only ever dream about. And she doesn’t remember any of it. Adrae Silverman is the Queen of the Night. She’s clothed in darkness and washed in royalty, and Emma is her newest conquest. She wants the kind of power Emma wields, and is willing to do whatever it takes to make Emma remember – and embrace – what she was created to do. She’s going to rise into the skies, one way or another. But Emma has made a promise to protect humanity – from a past she can’t even recall. To keep it, she must find a way to defy Adrae, and she must do it without the help of the hurricane under her skin.Set in a surprisingly normal, modern-day world, Echoes mixes contemporary with a hint of science fiction and is told from the scattered, poetical style of Emma’s thoughts. Stunning comparisons and Emma’s breathtakingly raw honesty weave a heartbreaking story of Emma’s attempt to protect humanity – from her own past.NOTE: This is the first part of a duology following the emotional and inner journey of a girl with a form of PTSD. It focuses on the inward turmoil caused by the damage of a dark past and her journey to overcome it. The second part is set to release in Fall of 2018, and will complete the set - including answering many of the questions left unanswered in this first novel.Find out more and discuss the book here: https://www.goodreads.com/topic/show/...",
  "genres": [
    "Romance",
    "Contemporary",
    "Christian Fiction",
    "Young Adult"
  ],
  "author": "Miranda Marie",
  "average_rating": "4.42",
  "url": "https://www.goodreads.com/book/show/36158846-echoes"
}