{
  "title": "Where the Line Bleeds",
  "description": "The first novel from National Book Award winner and author of Sing, Unburied, Sing Jesmyn Ward, a timeless Southern fable of brotherly love and familial conflict—“a lyrical yet clear-eyed portrait of a rural South and an African-American reality that are rarely depicted” (The Boston Globe).Where the Line Bleeds is Jesmyn Ward’s gorgeous first novel and the first of three novels set in Bois Sauvage—followed by Salvage the Bones and Sing, Unburied, Sing—comprising a loose trilogy about small town sourthern family life. Described as “starkly beautiful” (Publishers Weekly, starred review), “fearless” (Essence), and “emotionally honest” (The Dallas Morning News), it was a finalist for the Hurston/Wright Legacy Award and the Virginia Commonwealth University Cabell First Novelist Award. Joshua and Christophe are twins, raised by a blind grandmother and a large extended family in rural Bois Sauvage, on Mississippi’s Gulf Coast. They’ve just finished high school and need to find jobs, but after Katrina, it’s not easy. Joshua gets work on the docks, but Christophe’s not so lucky and starts to sell drugs. Christophe’s downward spiral is accelerated first by crack, then by the reappearance of the twins’ Cille, who left for a better job, and Sandman, a dangerous addict. Sandman taunts Christophe, eventually provoking a shocking confrontation that will ultimately damn or save both twins. Where the Line Bleeds takes place over the course of a single, life-changing summer. It is a delicate and closely observed portrait of fraternal love and strife, of the relentless grind of poverty, of the toll of addiction on a family, and of the bonds that can sustain or torment us. Bois Sauvage, based on Ward’s own hometown, is a character in its own right, as stiflingly hot and as rich with history as it is bereft of opportunity. Ward’s “lushly descriptive prose…and her prodigious talent and fearless portrayal of a world too often overlooked” (Essence) make this novel an essential addition to her incredible body of work.",
  "genres": [
    "Fiction",
    "Contemporary",
    "Literary Fiction",
    "African American",
    "Race",
    "Audiobook",
    "Family"
  ],
  "author": "Jesmyn Ward",
  "average_rating": "3.79",
  "url": "https://www.goodreads.com/book/show/36175229-where-the-line-bleeds"
}