{
  "title": "SSN Seadragon: The Crucible of Leviathan",
  "description": "A “Leviathan spirit” is said to be a demon spirit controlled by Satan. When unleashed, it leaves total destruction in its wake, and cannot be subdued by normal human methods, but only by the power of God. The Cold War saw “Leviathan” snarling at his gate, salivating to be let loose, when humanity was treading ever closer to nuclear holocaust. During this period, American servicemen went into the breech to stand against whatever form “Leviathan” took, and like the American warriors of past years they held strong to their faith in God to see them through.Such a warrior is Daniel O’Kean, a World War II UDT/OSS veteran and commissioned naval officer, turned covert deep-penetration maritime CIA specialist, who has only his faith to see him through his own encounters with “Leviathan.” His first test is a pre-invasion, reconnaissance mission behind the lines of Inchon Korea, where the threat of capture by North Korean invaders is around every corner. Later he leads an assignment into Latvia with near disastrous consequences. Then called upon again, into the steaming jungles near Haiphong Vietnam, while attempting to retrieve evidence of active Soviet intervention in the war, he uncovers an unusual and vital turn of events that leads to a twisted plot in the streets of London England.With each step he takes he sees God’s hand guiding himcloser to a fate he does not fully understand, but follows faithfully.While O’Kean is battling an evil he cannot see, the captain of the nuclear submarine USS Seadragon, LCDR Renzo MacKenna has his own faith challenged in another form of “Leviathan” as he and CDR David Heidleman of the USS Permit coordinate to foil a Soviet plot to end America’s involvement in Vietnam. One wrong move by them and “Leviathan’s” bite could go nuclear.",
  "genres": [
    "Book Club",
    "Epic",
    "Contemporary",
    "Fiction"
  ],
  "author": "J.P. Ronald",
  "average_rating": "4.04",
  "url": "https://www.goodreads.com/book/show/36176163-ssn-seadragon"
}