{
  "title": "GALACTIC MARINE CORPS SNIPER TEAM: Deploying to Hell",
  "description": "Major Bill Jackson sat in the brig seething over the gall of Commandant James Smith for placing him in confinement for decking the incompetent Colonel Noah Poindexter III who cost the lives of most of a sniper team on Calypso. He’s been fighting with the 45th Marine Expeditionary Team on the planet Calypso for 6 months against a tough insurgency. His 6’2” Marine frame contained all the military grade enhancements plus the MASAP (Marine Advanced Sniper Access Protocol). His vision enhancements and onboard CPU interact with all the military hardware the Galactic Marines field and the MASAP allows for target acquisition up to 5 miles with the Marine sniper rifle Long Range Rail Gun 98 (LRRG 98). However, in the cell a suppressor field currently disabled the enhancements.Bill has been a Galactic Marine for twenty-one years. His family lineage in the Marines stretches back to the old United States Marines of the nineteenth century. One of his relatives fought in a battle in a place called Iwo Jima. His father is an active duty three-star general working in the Galactic Marines Special Operations Center located in the Southeastern Sector of North America on Earth. Bills youth had been that of a military child moving from duty station to duty station. He heard the stories of his ancestors’ prowess in war and swelled with pride as his father and mother told the tales. On his 18th birthday he asked his father to give him permission to join the Galactic Marine Corps. Instead of permission his father offered him a deal that if he would attend the Naval Academy, he would give his approval. After graduating from the Naval Academy with an MBA he joined the Marines with his fathers’ approval. Like all modern Marines Bill started his journey into the Corps as an enlisted Marine. His marksmanship skills earned him a chance to become an elite sniper. His entire career has been that of a sniper in the Galactic Marine Corps.His current troubles started when he assigned a sniper team to surveil a village thought to harbor insurgents. He ordered his Marine sniper team to remain undetected and not to approach the village under any circumstances. The intelligence on the village specified it would contain a reinforced company of crack insurgent troops and intelligence assets. He merely wanted the team to verify the intelligence and return to base where an attack plan would be developed. However, Colonel Noah Poindexter III, an officer with connections to the Senate on Earth who owed his rank to support from powerful senators, decided to intercede and send the sniper team to the outskirts of the village with orders to capture an insurgent. This led to the discovery and death of 3 team members who were tied to stakes outside the town for a warning. The surviving team members GySgt. William Cole (Bulls Eye) and his spotter SGT Mark Wilkins (Genius) told Bill what had transpired. His reaction of knocking Colonel Noah Poindexter III out cold in a fit of rage has him currently charged with assault.",
  "genres": [],
  "author": "David Smith",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/36178409-galactic-marine-corps-sniper-team"
}