{
  "title": "Black Dahlia, Red Rose",
  "description": "Los Angeles, 1947. A housewife out for a walk with her baby notices a cloud of black flies buzzing ominously in Leimert Park. An \"unsightly object\" is identified as the mutilated body of Elizabeth Short, an aspiring starlet from Massachusetts who had been lured west by the siren call of Hollywood. Her killer would never be found, but Short’s death would bring her the fame she had always sought. Her murder investigation transformed into a real-life film noir, featuring corrupt cops, femmes fatales, gun-slinging gangsters, and hungry reporters, replete with an irresistible, legendary moniker adapted from a recent film—The Black Dahlia.For over half a century this crime has maintained an almost mythic place in American lore as one of our most inscrutable cold cases. With the recently unredacted FBI file, newly released sections of the LAPD file, and exclusive interviews with the suspect’s family, relentless legal sleuth Piu Eatwell has gained unprecedented access to evidence and persuasively identified the culprit. Black Dahlia, Red Rose layers these findings into a gritty, cinematic retelling of the haunting tale.As Eatwell chronicles, among the first to arrive at the grisly crime scene was Aggie Underwood, the \"tough-as-nails\" city editor for the Los Angeles Evening Herald Express; meanwhile, the chain-smoking city editor for the Los Angeles Examiner, Jimmy Richardson, sent out his own reporters. Eatwell reveals how, through a cutthroat race to break news and sell papers, the public image of Elizabeth Short was distorted from a violated beauty to a \"man crazy delinquent.\" As rumors of various boyfriends circulated, the true story of the complex young woman ricocheting between jobs, lovers, and homes was lost. Instead, kitschy headlines tapped into a wider social anxiety about the city’s \"girl problem,\" and Short’s black chiffon and smoldering gaze become a warning for \"loose\" women coming of age in postwar America.Applying her own background as a lawyer to the surprising new evidence, Eatwell ultimately exposes many startling clues to the case that have never surfaced in public. From the discovery of Elizabeth’s notebook, inscribed with the name of the city’s most notorious and corrupt businessman, to a valid suspect plucked from the hundreds of \"confessing Sams\" by a brilliant, well-meaning doctor, Eatwell compellingly captures every \"big break\" in the police investigation to reveal a truly viable resolution to the case. In rich, atmospheric prose, Eatwell separates fact from fantasy to expose the truth behind the sinewy networks of a noir-tinged Hollywood. Black Dahlia, Red Rose at long last accords the Elizabeth Short case its due resolution, providing a reliable and enduring account of one of the most notorious unsolved murders in American history.",
  "genres": [
    "True Crime",
    "Nonfiction",
    "History",
    "Crime",
    "Mystery",
    "Audiobook",
    "Historical"
  ],
  "author": "Piu Marie Eatwell",
  "average_rating": "3.74",
  "url": "https://www.goodreads.com/book/show/36165732-black-dahlia-red-rose"
}