{
  "title": "The Autobiography of Eugen Mansfeld: A German settler's life in colonial Namibia",
  "description": "\"I wish that I could have seen this book when I was conducting my research\" - Professor Dr Jan-Bart Gewald, Leiden University.\"A helpful book for all who want to learn from an eyewitness\" - Jakob Zollmann, 'Journal of Namibian Studies'In the autumn of 1942 Eugen Mansfeld, then aged 71 and living in South Africa, painstakingly typed out his autobiography. It was an incredible gritty, gruesome and gossipy. Landing in Walvis Bay in 1897, Mansfeld was active during many key events in colonial-era Namibian history.\"Vivid and detailed... one gets goose-bumps just reading it\" - Dr Martha Akawa, University of NamibiaAs one of the earliest German colonists, and a former director of the German South West Africa Company, Mansfeld was directly involved in appropriating Namibian land from the Africans who lived there. He fought to put down the Herero uprising, issued licences to white diamond prospectors in the early 1900s, and was active against the British and South African forces as an officer in the colonial Reserve during the First World War.This book, written for his sons, contains uncomfortable truths about the brutality of German colonial rule in Africa. Mansfeld describes personally committing extraordinary acts of violence during the Herero uprising, including the summary execution of captured Herero combatants near Waldau, and burning down the village of Barmen.\"A revealing glance into the casual harshness of the settler experience\" - \"The Namibian\"Mansfeld includes a detailed and fascinating account of his military service as an officer during the First World War; wounded at Jakalswater, he went on to see action at the Battle of Otavi, and provides a unique account of the South African victory there.Memoirs of life in the Namibian colonial period are scarce; and it is rare indeed to find an autobiographical account as detailed, bloodthirsty, frank and readable as this.",
  "genres": [],
  "author": "Eugen Mansfeld",
  "average_rating": "4.13",
  "url": "https://www.goodreads.com/book/show/36185081-the-autobiography-of-eugen-mansfeld"
}