{
  "title": "Hearts to Be Mended",
  "description": "A lady in love. A gentleman with a reputation. And a secret that keeps them apart.LADY ELEANOR ABBOTT is in love. However, the one man who manages to send her heart into an uproar with a single smoldering look is the one man she is forbidden to marry. As the fifth son of a baron, the man who conquered Eleanor’s heart is not the match her mother wants her to make. Instead, Eleanor finds herself faced with an endless stream of appropriate suitors and under stern instructions to choose a suitable husband before the season’s end.HENRY WALTHAM, fifth son of Baron Caulfield, has always considered himself fortunate to have grown up in a close-knit family. However, now that his brother’s less than respectable reputations ruin his every chance to marry the woman he loves, Henry finds himself torn between simply whisking her off to Gretna Green - and let propriety be damned! - and the deep desire to prove himself an honourable man.However, not everything is as it seems, and soon Eleanor and Henry realise that the key to their future can only be found in the past.This tale by a USA TODAY bestselling author shows that love isn’t always easy…but worth fighting for.If you like bittersweet stories about a love so deep and compelling that it unhinges your whole world and leaves you reeling, then you’ll love this instalment of Bree Wolf’s emotionally charged Forbidden Love Novella Series. Buy HEARTS TO BE MENDED, grab a cup of tea, settle into your favorite reading spot and start this swoon worthy romance now!A Forbidden Love Novella Series#1 The Wrong Brother#2 A Brilliant Rose#3 The Forgotten Wife#4 An Unwelcome Proposal#5 Rules to Be Broken#6 Hearts to Be MendedTo Follow:#7 Winning her Hand#8 Conquering her HeartLove's Second Chance Series#1 Forgotten & Remembered - The Duke's Late Wife#2 Cursed & Cherished - The Duke's Wilful Wife#3 Despised & Desired - The Marquess' Passionate Wife#4 Abandoned & Protected - The Marquis' Tenacious Wife#5 Ruined & Redeemed - The Earl's Fallen Wife#6 Betrayed & Blessed - The Viscount's Shrewd Wife#7 Deceived & Honoured - The Baron’s Vexing WifeMore to follow:#8 Sacrificed & Reclaimed - The Soldier's Daring Widow (Bonus Novella)",
  "genres": [
    "Novella",
    "Historical",
    "Historical Fiction",
    "Romance",
    "Regency"
  ],
  "author": "Bree Wolf",
  "average_rating": "4.23",
  "url": "https://www.goodreads.com/book/show/36185539-hearts-to-be-mended"
}