{
  "title": "The Slave Trade in Africa: The History and Legacy of the Transatlantic Slave Trade and East African Slave Trade across the Indian Ocean",
  "description": "*Includes pictures *Includes accounts of the slave trade *Includes online resources and a bibliography for further reading *Includes a table of contents It has often been said that the greatest invention of all time was the sail, which facilitated the internationalization of the globe and thus ushered in the modern era. Columbus’ contact with the New World, alongside European maritime contact with the Far East, transformed human history, and in particular the history of Africa. It was the sail that linked the continents of Africa and America, and thus it was also the sail that facilitated the greatest involuntary human migration of all time. The African slave trade is a complex and deeply divisive subject that has had a tendency to evolve according the political requirements of any given age, and is often touchable only with the correct distribution of culpability. It has for many years, therefore, been deemed singularly unpalatable to implicate Africans themselves in the perpetration of the institution, and only in recent years has the large-scale African involvement in both the Atlantic and Indian Ocean Slave Trades come to be an accepted fact. There can, however, be no doubt that even though large numbers of indigenous Africans were liable, it was European ingenuity and greed that fundamentally drove the industrialization of the Transatlantic slave trade in response to massive new market demands created by their equally ruthless exploitation of the Americas. In time, the Atlantic slave trade provided for the labor requirements of the emerging plantation economies of the New World. It was a specific, dedicated and industrial enterprise wherein huge profits were at stake, and a vast and highly organized network of procurement, processing, transport and sale existed to expedite what was in effect a modern commodity market. It existed without sentimentality, without history, and without tradition, and it was only outlawed once the advances of the industrial revolution had created alternative sources of energy for agricultural production. The East African Slave Trade on the other hand, or the Indian Ocean Slave Trade as it was also known, was a far more complex and nuanced phenomenon, far older, significantly more widespread, rooted in ancient traditions, and governed by rules very different to those in the western hemisphere. It is also often referred to as the Arab Slave Trade, although this, specifically, might perhaps be more accurately applied to the more ancient variant of organized African slavery, affecting North Africa, and undertaken prior to the advent of Islam and certainly prior to the spread of the institution south as far as the south/east African coast. It also involved the slavery of non-African races and was, therefore, more general in scope. The African slave trade is a complex and deeply divisive subject that has had a tendency to evolve according the political requirements of any given age, and is often touchable only with the correct distribution of culpability. It has for many years, therefore, been deemed singularly unpalatable to implicate Africans themselves in the perpetration of the institution, and only in recent years has the large-scale African involvement in both the Atlantic and Indian Ocean Slave Trades come to be an accepted fact. There can, however, be no doubt that even though large numbers of indigenous Africans were liable, it was European ingenuity and greed that fundamentally drove the industrialization of the Transatlantic slave trade in response to massive new market demands created by their equally ruthless exploitation of the Americas. The Slave Trade in The History and Legacy of the Transatlantic Slave Trade and East African Slave Trade across the Indian Ocean looks at the notorious trade networks.",
  "genres": [
    "History"
  ],
  "author": "Charles River Editors",
  "average_rating": "4.05",
  "url": "https://www.goodreads.com/book/show/36185082-the-slave-trade-in-africa"
}