{
  "title": "Moonlight And Midtown",
  "description": "“Mixes cherished fantasy classics with modern magic and moxie” – ForewordAfter battling werewolves and evil aunties, Bryar Rose is ready to enjoy her new life. No more crazy aunties. Her curse is toast. And Bry’s new man, Knox, is literally a dream come true. Best of all, Bry will soon attend a regular high school. Forget those sketchy tutors! To get ready, Bry is dedicating the rest of her summer to some serious back-to-school shopping with her best friend, Elle. It’s a blast, except for one Mysterious strangers are following Bry across Manhattan. All these stalkers have oddly familiar scents and an uncanny ability to slip into the shadows whenever Bry tries to confront them. Even worse, their presence is making Knox act crazy with a capital C.“Bauer’s unique voice blends magical fantasy, swooning romance, and a bucketful of teenage sass.” – BooklistBut Bry’s having none of it. Enough of her life has already been ruined by secrets. With Elle’s help, Bry plans to confront these strangers, find out what they want, and send them packing. Trouble is, the truth about their identity won’t be so easy to manage, especially when Bry finds out how these stalkers could change her future with Knox…and not for the better.Perfect for readers who love young adult books,gamma guys, contemporary fantasy, fairy tales, satire/comedy, paranormal romance, fairies, magic users, shapeshifters, and coming of age stories.FAIRY TALES OF THE MAGICORUMSleeping Beauty1 - Wolves And Roses1.5 - Moonlight and Midtown2 - Shifters And GlyphsCinderella2.5 - Fairies and Frosting3 - Slippers And ThievesChristina Bauer is the author of the bestselling Angelbound series about Heaven, Hell and Purgatory, and the angels, demons, dragons, ghouls and humans that call them home; the Beholder series, about a medieval farm girl turned necromancer who needs to save the realm; the Fairy Tales of the Magicorum, which takes place in version of our modern world where fairies, shifters and wizards are real; and  Dimension Drift, where one sassy teenage girl-slash-scientist plots to save the future from its dystopian fate.",
  "genres": [
    "Fantasy",
    "Young Adult",
    "Novella",
    "Romance",
    "Magic",
    "Shapeshifters",
    "Werewolves"
  ],
  "author": "Christina Bauer",
  "average_rating": "3.74",
  "url": "https://www.goodreads.com/book/show/36180623-moonlight-and-midtown"
}