{
  "title": "The Indian World of George Washington: The First President, the First Americans, and the Birth of the Nation",
  "description": "George Washington's place in the foundations of the Republic remains unrivalled. His life story--from his beginnings as a surveyor and farmer, to colonial soldier in the Virginia Regiment, leader of the Patriot cause, commander of the Continental Army, and finally first president of the United States--reflects the narrative of the nation he guided into existence. There is, rightfully, no more chronicled figure.Yet American history has largely forgotten what Washington himself knew clearly: that the new Republic's fate depended less on grand rhetoric of independence and self-governance and more on land--Indian land. Colin G. Calloway's biography of the greatest founding father reveals in full the relationship between Washington and the Native leaders he dealt with intimately across the decades: Shingas, Tanaghrisson, Guyasuta, Attakullakulla, Bloody Fellow, Joseph Brant, Cornplanter, Red Jacket, and Little Turtle, among many others. Using the prism of Washington's life to bring focus to these figures and the tribes they represented--the Iroquois Confederacy, Lenape, Miami, Creek, Delaware--Calloway reveals how central their role truly was in Washington's, and therefore the nation's, foundational narrative.Calloway gives the First Americans their due, revealing the full extent and complexity of the relationships between the man who rose to become the nation's most powerful figure and those whose power and dominion declined in almost equal degree during his lifetime. His book invites us to look at America's origins in a new light. The Indian World of George Washington is a brilliant portrait of both the most revered man in American history and those whose story during the tumultuous century in which the country was formed has, until now, been only partially told.",
  "genres": [
    "History",
    "Nonfiction",
    "American History",
    "Biography",
    "American Revolution",
    "Native American",
    "Audiobook"
  ],
  "author": "Colin G. Calloway",
  "average_rating": "4.06",
  "url": "https://www.goodreads.com/book/show/36197937-the-indian-world-of-george-washington"
}