{
  "title": "Tears From Above",
  "description": "Dear Author,I’m not a huge fan of the fantasy genre, especially anything with angels is a no-no, but maybe you could change that?This boy is, obviously, an angel. He’s looking out from a window somewhere in heaven. He’s alone and miserable, because he did the unthinkable and gave in to the advances of another angel. The two angels fell in love with each other, and that was when things went wrong.His lover got punished; he was tossed out of heaven, because even though sometimes an angel can give their wings when they fall in love with a human, it can’t happen with other angels. Those are the rules in heaven.The angel in the picture wonders, if it would be worth to ask for a permission to go down to look for his love, because all his lover’s memories would have been wiped when he was de-winged.The worst part? Once an angel asks to go down to live as a human, there’s no way he can ever return to heaven, not until he dies. He may keep his memories, but what would he do if he couldn’t find his lover or if the lover wouldn’t want him in his new life.And my dear author, please don’t make this in any way about God, Christianity, or religion in general, because I’m agnostic and I can’t deal with that stuff. Sorry. :)Photo Description: Half in shadow, the dark-haired angel gazes intently up and away. Sunlight catches the fine cut of his naked muscled chest, the tattooed stars on his hip, the thorny design on his shoulder. Shadows lie on the soft white feathers of his wings, as he slides his white pants open.This story was written as a part of the M/M Romance Group's \"Hot Summer Days\" event. Group members were asked to write a story prompt inspired by a photo of their choice. Authors of the group selected a photo and prompt that spoke to them and wrote a short story.Read the story here or find it in Don't Read in the Closet, Volume 4 or Don't Read in the Closet: GayRomLit Retreat 2011 Special Edition.__________Genre: paranormal romanceTags: gay m/m, light D/S, angels, angst, love, drama, light BDSMWord Count: 19,345",
  "genres": [
    "M M Romance",
    "Paranormal",
    "Romance",
    "Short Stories",
    "Fantasy",
    "BDSM",
    "Angels"
  ],
  "author": "Michele L. Montgomery",
  "average_rating": "3.55",
  "url": "https://www.goodreads.com/book/show/12171977-tears-from-above"
}