{
  "title": "Goodbye, Sweet Girl: A Story of Domestic Violence and Survival",
  "description": "In this brave and beautiful memoir, written with the raw honesty and devastating openness of The Glass Castle and The Liar’s Club, a woman chronicles how her marriage devolved from a love story into a shocking tale of abuse—examining the tenderness and violence entwined in the relationship, why she endured years of physical and emotional pain, and how she eventually broke free.\"You made me hit you in the face,\" he said mournfully. \"Now everyone is going to know.\" \"I know,\" I said. \"I’m sorry.\"Kelly Sundberg’s husband, Caleb, was a funny, warm, supportive man and a wonderful father to their little boy Reed. He was also vengeful and violent. But Sundberg did not know that when she fell in love, and for years told herself he would get better. It took a decade for her to ultimately accept that the partnership she desired could not work with such a broken man. In her remarkable book, she offers an intimate record of the joys and terrors that accompanied her long, difficult awakening, and presents a haunting, heartbreaking glimpse into why women remain too long in dangerous relationships.To understand herself and her violent marriage, Sundberg looks to her childhood in Salmon, a small, isolated mountain community known as the most redneck town in Idaho. Like her marriage, Salmon is a place of deep contradictions, where Mormon ranchers and hippie back-to-landers live side-by-side; a place of magical beauty riven by secret brutality; a place that takes pride in its individualism and rugged self-sufficiency, yet is beholden to church and communal standards at all costs.Mesmerizing and poetic, Goodbye, Sweet Girl is a harrowing, cautionary, and ultimately redemptive tale that brilliantly illuminates one woman’s transformation as she gradually rejects the painful reality of her violent life at the hands of the man who is supposed to cherish her, begins to accept responsibility for herself, and learns to believe that she deserves better.",
  "genres": [
    "Memoir",
    "Nonfiction",
    "Feminism",
    "Biography",
    "Abuse",
    "Audiobook",
    "Biography Memoir"
  ],
  "author": "Kelly Sundberg",
  "average_rating": "3.84",
  "url": "https://www.goodreads.com/book/show/36204057-goodbye-sweet-girl"
}