{
  "title": "Tribe Of Mentors: Short Life Advice from the Best in the World",
  "description": "Tim Ferriss, the #1 New York Times best-selling author of The 4-Hour Workweek, shares the ultimate choose-your-own-adventure book--a compilation of tools, tactics, and habits from 130+ of the world's top performers. From iconic entrepreneurs to elite athletes, from artists to billionaire investors, their short profiles can help you answer life's most challenging questions, achieve extraordinary results, and transform your life.From the In 2017, several of my close friends died in rapid succession. It was a very hard year, as it was for many people.It was also a stark reminder that time is our scarcest, non-renewable resource.With a renewed sense of urgency, I began asking myself many Were my goals my own, or simply what I thought I should want?  How much of life had I missed from underplanning or overplanning?  How could I be kinder to myself?  How could I better say \"no\" to the trivial many to better say \"yes\" to the critical few?  How could I best reassess my priorities and my purpose in this world?To find answers, I reached out to the most impressive world-class performers in the world, ranging from wunderkinds in their 20s to icons in their 70s and 80s. No stone was left unturned.This book contains their answers--practical and tactical advice from mentors who have found solutions. Whether you want to 10x your results, get unstuck, or reinvent yourself, someone else has traveled a similar path and taken notes.This book, Tribe of Mentors, includes many of the people I grew up viewing as idols or demi-gods. Less than 10% have been on my podcast (The Tim Ferriss Show, more than 200 million downloads), making this a brand-new playbook of playbooks.No matter your challenge or opportunity, something in these pages can help.Among other things, you will - More than 50 morning routines--both for the early riser and those who struggle to get out of bed.  - How TED curator Chris Anderson realized that the best way to get things done is to let go.  - The best purchases of $100 or less (you'll never have to think about the right gift again).  - How to overcome failure and bounce back towards success.  - Why Humans of New York creator Brandon Stanton believes that the best art will always be the riskiest.  - How to meditate and be more mindful (and not just for those that find it easy).  - Why tennis champion Maria Sharapova believe that \"losing makes you think in ways victories can't.\"  - How to truly achieve work-life balance (and why most people tell you it isn't realistic).  - How billionaire Facebook co-founder Dustin Moskovitz transformed the way he engages with difficult situations to reduce suffering.  - Ways to thrive (and survive) the overwhelming amount of information you process every day.  - How to achieve clarity on your purpose and assess your priorities.  - And much more.This reference book, which I wrote for myself, has already changed my life. I certainly hope the same for you.I wish you luck as you forge your own path.All the best,Tim Ferriss",
  "genres": [
    "Business",
    "Nonfiction",
    "Self Help",
    "Personal Development",
    "Productivity",
    "Leadership",
    "Psychology"
  ],
  "author": "Timothy Ferriss",
  "average_rating": "4.07",
  "url": "https://www.goodreads.com/book/show/36200111-tribe-of-mentors"
}