{
  "title": "Be More Pirate: Or How to Take On the World and Win",
  "description": "\"Magnificent, one of the sharpest thinkers on the planet\" Forbes\"Fun, easy to digest ideas that are especially applicable to start-ups with youth, vision and a big focus on ethics. Business Book of the Month\" Financial Times\"A Modern Life Bible\" Shortlist MagazineA model for how to break the system and create radical change\" The London Evening Standard- - - - Mischief, Purpose, PowerPirates didn’t just break the rules, they rewrote them. They didn't just reject society, they reinvented it. Pirates didn’t just challenge the status-quo, they changed everyf*ckingthing. Facing a self-interested establishment, a broken system, industrial-scale disruption and an uncertain future, pirates rebelled against an unfair world and change it for good. Now, you can follow in their footsteps.Be More Pirate unveils the innovative strategies of Golden Age pirates, drawing parallels between the tactics and teachings of legends like Henry Morgan and Blackbeard with modern rebels, like Elon Musk, Malala and Banksy. With takeaway sections and a Featuring takeaway sections and a guide to build you own pirate code 2.0, Be More Pirate will show you how to leave your mark on the 21st century. Whatever your ambitions, ideas and challenges, Be More Pirate will revolutionize the way you live, think and work today, and tomorrow.[BACK INSIDE COVER PRINT]‘Be More Pirate feels so important as it looks to history to help us grip the future.’ Martha Lane-Fox, do you have a specific bio Martha would like us to use? ‘A refreshing, entertaining and inspiring perspective on work, leadership and why we do what we do ... it’s a call for a more radical rethink of where we’re going wrong, and where we’re going next.’ Bruce Daisley, Host of the Number 1 Business Podcast ‘Eat, Sleep, Work, Repeat’",
  "genres": [
    "Nonfiction",
    "Business",
    "Self Help",
    "Philosophy",
    "Audiobook",
    "Pirates",
    "Personal Development"
  ],
  "author": "Sam Conniff",
  "average_rating": "3.71",
  "url": "https://www.goodreads.com/book/show/36200494-be-more-pirate"
}