{
  "title": "The Seminarian: Martin Luther King Jr. Comes of Age",
  "description": "2019 Washington State Book Awards Finalist  Martin Luther King Jr. was a cautious nineteen-year-old rookie preacher when he left Atlanta, Georgia, to attend divinity school up north. At Crozer Theological Seminary, King, or “ML” back then, immediately found himself surrounded by a white staff and white professors. Even his dorm room had once been used by wounded Confederate soldiers during the Civil War. In addition, his fellow seminarians were almost all older; some were soldiers who had fought in World War II, others pacifists who had chosen jail instead of enlisting. ML was facing challenges he’d barely dreamed of.   A prankster and a late-night, chain-smoking pool player, ML soon fell in love with a white woman, all the while adjusting to life in an integrated student body and facing discrimination from locals in the surrounding town of Chester, Pennsylvania. In class, ML performed well, though he demonstrated a habit of plagiarizing that continued throughout his academic career. But he was helped by friendships with fellow seminarians and the mentorship of the Reverend J. Pius Barbour. In his three years at Crozer between 1948 and 1951, King delivered dozens of sermons around the Philadelphia area, had a gun pointed at him (twice), played on the basketball team, and eventually became student body president. These experiences shaped him into a man ready to take on even greater challenges.   Based on dozens of revealing interviews with the men and women who knew him then,The Seminarian is the first definitive, full-length account of King’s years as a divinity student at Crozer Theological Seminary. Long passed over by biographers and historians, this period in King’s life is vital to understanding the historical figure he soon became.",
  "genres": [
    "Biography",
    "History",
    "Nonfiction",
    "Race",
    "Christianity",
    "Social Justice",
    "Memoir"
  ],
  "author": "Patrick Parr",
  "average_rating": "4.02",
  "url": "https://www.goodreads.com/book/show/36205894-the-seminarian"
}