{
  "title": "How Women Rise: Break the 12 Habits Holding You Back from Your Next Raise, Promotion, or Job",
  "description": "Since the publication of his international bestseller What Got You Here Won’t Get You There, business guru Marshall Goldsmith has spoken to hundreds of thousands of people around the world, sharing the ideas he put forth in that groundbreaking book. But a few years ago, he realized that while some of the habits he outlined in What Got You Here apply to both men and women, women face specific, and different, challenges as they seek to advance in their careers.So he partnered with his longtime colleague, women’s leadership expert Sally Helgesen, to create this invaluable handbook for women trying to take the next step in their careers. They realized that for women in particular, the very skills and habits that made them successful early in their careers could actually be holding them back as they advance to the next stage of their working lives. Women in particular struggle with habits like:1. Reluctance to Claim Your Achievements2. Expecting Others to Spontaneously Notice and Reward Your Hard Work3. Overvaluing Expertise4. Building Rather than Leveraging Relationships5. Failing to Enlist Allies from Day One6. Putting Your Job Before Your Career7. The Disease to Please8. The Perfection Trap9. Minimizing10. Too Much11. Ruminating12. Letting Your Radar Distract YouLike the original What Got You Here, this new book will help women identify specific behaviors that keep them from realizing their full potential, no matter what stage they are in their career. It will also help them identify why what worked for them in the past will not necessarily get them where they want to go in the future–and how to finally shed those behaviors so they can advance to the next level, whatever that may be.",
  "genres": [
    "Nonfiction",
    "Business",
    "Self Help",
    "Leadership",
    "Feminism",
    "Personal Development",
    "Psychology"
  ],
  "author": "Sally Helgesen",
  "average_rating": "4.10",
  "url": "https://www.goodreads.com/book/show/36204301-how-women-rise"
}