{
  "title": "Just Maybe",
  "description": "A laugh-out-loud clean romance.  When a case of mistaken identity spirals into a more-than-complicated fake romance, an adventure seeker and a grammar fanatic just might’ve met each other’s match.  Three weeks. That’s all the time self-made billionaire Cooper Anderson has to respond to discovering he’s a single dad, sell his lake house, and catch a one-way ticket across the world. The quick-witted nanny responding to his ad couldn’t be more of a lifesaver … and maybe a nice distraction. Until the secrets she’s hiding get a little too close to exposing his own.  The one lead guaranteeing Quinn Thompson a promotion just has to land her back in her hometown to finagle an interview out of Mr. Elusive, of all people. But she can hack it, right? Even while mistaken for the nanny, she can keep things quick and professional. No running into her embarrassing southern family, no stirring up the wounds that’d sent her packing four years ago, and definitely no melting over a stockbroker’s unfair dimples and boyish charm.  Why, oh, why doesn’t anything ever go according to plan?  With both their deadlines closing in before they’re ready, Quinn and Cooper must decide whether the life they’re set on pursuing alone is worth more than the one they could be missing together.  Download Just Maybe to enjoy a southern sweet romance full of small-town laughs, memorable family members, and the heartwarming treasure of second chances.  Categories/Themes: Fake Romance Sweet Clean Romance Small Town Romance Romantic Comedy  Each book in the Home In You Series is a standalone and can be read separately. But I recommend reading the books in order if you want to follow the overall timeline:  Still Falling - A Prequel Write Me Home  - Book One Begin Again  - Book Two Just Maybe  - Book Three Chasing Someday  - Book Four",
  "genres": [
    "Contemporary",
    "Romance",
    "Contemporary Romance",
    "Clean Romance"
  ],
  "author": "Crystal Walton",
  "average_rating": "4.49",
  "url": "https://www.goodreads.com/book/show/36206457-just-maybe"
}