{
  "title": "Robert F. Kennedy: Ripples of Hope: Kerry Kennedy in Conversation with Heads of State, Business Leaders, Influencers, and Activists about Her Father's Impact on Their Lives",
  "description": "Kerry Kennedy, daughter of Robert F. Kennedy, shares personal remembrances of her father and through interviews with politicians, media personalities, celebrities and leaders, explores the influence that he continues to have on the issues at the heart of America's identity.  Robert Kennedy championed the disenfranchised from Watts to the Mississippi Delta. He battled corrupt union bosses and protected Alabama Freedom Riders. He embraced Cesar Chavez and opposed the Vietnam War. He fought racism, lauded courage and called for peace. He soothed those who suffered, and he suffered himself. He announced his 1968 bid for the presidency saying \"I am convinced that this country is on a perilous course and because I have such strong feelings about what must be done, and I feel that I'm obliged to do all that I can. I run to seek new policies - policies to end the bloodshed in Vietnam and in our cities, policies to close the gaps that now exist between black and white, between rich and poor, between young and old, in this country and around the rest of the world. I run for the presidency because I want the Democratic Party and the United States of America to stand for hope instead of despair, for reconciliation of men instead of the growing risk of world war. I run because it is now unmistakably clear that we can change these disastrous, divisive policies only by changing the men who are now making them.\"Merging undaunted courage and emotional honesty in the quest for social, economic and racial justice, the hope of youth, the mindless menace of violence, the struggle in cities and the challenges faced by rural America, Robert Kennedy remains a hero and inspiration to individuals on the entire range of the political spectrum.To honor her father on the 50th anniversary of his death, Kerry Kennedy has turned to others to share how he influenced their lives, from politics: Joe Biden, Bill Clinton, Al Gore, John Lewis, Barack Obama; from business: Apple CEO Tim Cook, Starbucks CEO Howard Schultz; from entertainment: Tony Bennett, Alfre Woodard, Martin Sheen, and Shirley McClaine; from Journalism: Chris Matthews, Soledad O'Brien, Joe Scarborough; as well as American labor leader Dolores Huerta, feminist Gloria Steinem, and many other well-known personalities.",
  "genres": [
    "History",
    "Biography",
    "Nonfiction",
    "Politics",
    "Memoir",
    "Historical"
  ],
  "author": "Kerry Kennedy",
  "average_rating": "4.19",
  "url": "https://www.goodreads.com/book/show/36204839-robert-f-kennedy"
}