{
  "title": "From Broken Glass: My Story of Finding Hope in Hitler's Death Camps to Inspire a New Generation",
  "description": "From the survivor of ten Nazi concentration camps who went on to create the New England Holocaust Memorial, a \"devastating...inspirational\" memoir ( The Today Show ) about finding strength in the face of despair.On August 14, 2017, two days after a white-supremacist activist rammed his car into a group of anti-Fascist protestors, killing one and injuring nineteen, the New England Holocaust Memorial was vandalized for the second time in as many months. At the base of one of its fifty-four-foot glass towers lay a pile of shards. For Steve Ross, the image called to mind Kristallnacht, the Night of Broken Glass in which German authorities ransacked Jewish-owned buildings with sledgehammers.Ross was eight years old when the Nazis invaded his Polish village, forcing his family to flee. He spent his next six years in a day-to-day struggle to survive the notorious camps in which he was imprisoned, Auschwitz-Birkenau and Dachau among them. When he was finally liberated, he no longer knew how old he was, he was literally starving to death, and everyone in his family except for his brother had been killed.Ross learned in his darkest experiences--by observing and enduring inconceivable cruelty as well as by receiving compassion from caring fellow prisoners--the human capacity to rise above even the bleakest circumstances. He decided to devote himself to underprivileged youth, aiming to ensure that despite the obstacles in their lives they would never experience suffering like he had. Over the course of a nearly forty-year career as a psychologist working in the Boston city schools, that was exactly what he did. At the end of his career, he spearheaded the creation of the New England Holocaust Memorial, a site millions of people including young students visit every year.Equal parts heartrending, brutal, and inspiring, From Broken Glass is the story of how one man survived the unimaginable and helped lead a new generation to forge a more compassionate world.",
  "genres": [
    "Nonfiction",
    "Holocaust",
    "History",
    "Memoir",
    "World War II",
    "Biography",
    "Historical"
  ],
  "author": "Steve Ross",
  "average_rating": "4.58",
  "url": "https://www.goodreads.com/book/show/36204327-from-broken-glass"
}