{
  "title": "anthologyPERCEPTION",
  "description": "“Every truth has two sides; it is as well to look at both before we commit ourselves to either.”— AesopHumanity is far from perfect—it is a simmering variety of emotions, passions, mistakes, and triumphs, all mixed up within the seemingly soporific mundanity of the day-to-day life. Together, the personal and emotional stories of individuals become a powerful exploration of what it means to be human. In “Looking for God…,” readers with an open mind and curiosity will discover the story of one life through beautifully-written prose.This life story is told with the passion of a memoir that jumps out of the pages, pulling you deep into as heroic as it is tragic, this anthology brings together A.W. Schade’s best works on a highway deep into his psyche, motivations and essential humanity.This anthology reveals the naked perspective and journey of one the trials and tribulations of a life shattered by the ugliness of an entrenched, unwinnable war in Vietnam to a strong survivor seeking to overcome his PTSD during the relentlessly televised destruction of Iraq.Through satire, suspense, controversy, wavering faith and a vigilant battle against the demons that haunt us all. Schade’s writing captures the human spirit at its best and its the impossible mélange that makes us all tick. The anthology includes the following •Looking for Within the Kingdom of Religious Confusion Novel – God?•If I What Doom Awaits the Children? Short Story – Suspense•The Demons of War are PTSD can disrupt your life Short Story – Denial and struggle with PTSD•The Greatest Father Short Story – Satire•Not Alone Short Story – A perspective of healing“We each see the world through a lens of all our experience, wrote the diplomat Madeleine M. that is a fundamental part of the human condition.” Within anthologyPERCEPTION, you will discover a writer who is passionate about opening minds and raising awareness—and finally, breaking through the stigma and demons that many veterans face long after their tour of duty has ended.Enjoy the journey!",
  "genres": [],
  "author": "AW Schade",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/36213338-anthologyperception"
}