{
  "title": "Beyond the Map: Unruly Enclaves, Ghostly Places, Emerging Lands and Our Search for New Utopias",
  "description": "New islands are under construction or emerging because of climate change. Eccentric enclaves and fantastic utopian experiments are popping up all over the place. Once-secret fantasy gardens are cracking open their doors to outsiders. Our world is becoming stranger by the day—and Alastair Bonnett observes and captures every fascinating change.   In Beyond the Map, Bonnett presents stories of the world’s most extraordinary spaces—many unmarked on any official map—all of which challenge our assumptions about what we know—or think we know—about our world. As cultural, religious, and political boundaries ebb and flow with each passing day and the messy maps of human and physical geography overwhelm us, traditional maps unravel and fragment. With the same adventurous spirit he effused in the acclaimed Unruly Places, Bonnett takes us to thirty-nine incredible places from around the globe that explore these changing boundaries and stimulate our geographical imagination. Some are tied to disruptive contemporary political turbulence, such as the rise of ISIL, Russia’s incursions into Ukraine, and the Brexit vote in the United Kingdom. Others explore the secret places not shown on Google Earth or reflect fast-changing landscapes. Natural processes such as hurricanes and rising sea levels continue to remake the world, as do human pollution and the relentless construction that destroys habitable land.  Beyond the Map journeys out into a world of mysterious, daunting, and magical spaces. It is a world of hidden cultures and ghostly memories; of uncountable new islands and curious stabs at paradise. From the phantom tunnels of the Tokyo subway to a stunning movie-set recreation of 1950s-era Moscow; from the caliphate of the Islamic State to virtual cybertopias—Beyond the Map serves as an imaginative guide to the farthest fringes of geography.",
  "genres": [
    "Nonfiction",
    "Travel",
    "Geography",
    "Essays",
    "Maps",
    "History",
    "Politics"
  ],
  "author": "Alastair Bonnett",
  "average_rating": "3.61",
  "url": "https://www.goodreads.com/book/show/36217543-beyond-the-map"
}