{
  "title": "Alien Minds",
  "description": "The first book in the new series from USA Today's 'must read YA paranormal romance' author, Christina BauerMeimi Archer wakes up in the hospital to find she’s living the perfect life. Too bad it’s not hers.On my seventeenth birthday, I wake up in the hospital to find I just survived a sketchy but terrible accident. My parents stand by my bedside—both are beautiful, wealthy, and super-nice. They tell me that once I leave the hospital, I’ll attend the prestigious ECHO Academy, where I’ll churn out equations for the government along with my mega-smart peers.So, I’m living the perfect life. Then why does everything feel all wrong? My parents, my house and even ECHO Academy…none of it fits. Plus, what’s up with Thorne, my brooding yet yummy classmate who keeps telling me I need to remember my true past, which seems to have included a lot of us kissing? That’s one thing I’d really like to remember, except for the fact that I’m pretty sure Thorne is hiding a ton of nasty secrets of his own, including the fact that he may not be from this world. But considering how my own past seems alien to me, it’s not like I can judge. Plus, Thorne has dimples. That’s a problem.And worst of all, why does it feel so yucky to work on these calculations for the government? It’s all supposed to be part of ECHO, but my heart tells me that I’m helping something truly terrible come to pass. Thorne seems to think that kissing him again will release my real memories. Maybe it’s time to pucker up.This new series is perfect fans of urban fantasy, action & adventure, cool science, evil corporations, forbidden romance and hot new classmates who may or may not be aliens.Dimension Drift Worlds1. Dimension Drift (April 2018)2. Umbra (Fall 2018)Dimension Drift1.Alien Minds (Spring 2019) 2. ECHO Academy (Spring 2020)More series from author Christina Beholder (YA Dark Fantasy), Angelbound (YA Urban Fantasy) and Fairy Tales of the Magicorum (YA Urban Fantasy)",
  "genres": [
    "Science Fiction",
    "Fantasy",
    "Dystopia",
    "Young Adult",
    "Aliens",
    "Amazon",
    "Mystery"
  ],
  "author": "Christina Bauer",
  "average_rating": "3.98",
  "url": "https://www.goodreads.com/book/show/36215661-alien-minds"
}