{
  "title": "Lilith",
  "description": "An artist must defend her infant son against the darkest of predators. The enemy of every hearth, Lilith visits homes and devours children. When a graduate student writing a thesis on Lilith meets the demoness in the shape of a barn owl, she sees the perfect research opportunity ... until she learns Lilith is hungry for her child! Will Evelyn be able to protect her son from the owl's tearing beak and dark heart? Will she be able to keep her husband from falling to Lilith's wiles? Will she be able to learn who -- and what -- Lilith is in time to save her child, her marriage, and her mind? AN INTERVIEW WITH CHRISTINE EMMERT Dante's Heart Publications : July 20, 2011 DANTE'S HEART. Christine, what made you want to write Lilith? CHRISTINE EMMERT. It was an odd crossroads of buying a book on Medieval Mythology and a barn owl that was living in our open-air garage when we moved to the country. Lilith has many sides. She is the woman who would not bow down to a patriarchal universe. All women have that wish not to defer born into them as little girls. We suppress it as we grow up and evolve into members of a society, but freedom still tastes like the finest wine to us. DH. Could you tell us -- what is your own favorite moment in Lilith? The moment that sits with you most deeply when you close your eyes? CE. When her husband tells her to paint Lilith. My husband is a visual artist, and he can often depict visually what I cannot say in words. The depth of the visual is stunning and scary at the same time. DH. I couldn't agree more. What writers do you admire? CE. I love Katherine Harrison. I think her novel POISON is one of the finest pieces of writing I ever read. I also admire Steven Saylor for his historical fiction -- especially THE VENUS THROW which seems to understand the weaving of good and evil in us on a level that is heart rending. My friend, Stephanie Cowell, who also writes historical fiction is a big inspiration to me in the depth at which she looks at the lives of famous people. Of course I love Shakespeare who could make us sympathize with the blackest heart or make us laugh at our own foolishness. Erica Jung's poetry as well leaves me speechless before her honesty. DH. What else inspires you as a writer -- what gives you energy? CE. I have always found myth as a great source of inspiration. Myth expresses what is behind the great curtain in simple ways we can understand, even if we can't verbalize it. My animals too help me since I must always try harder to see what they want than what people want. To be really syrupy I have to say love inspires me. I could not do what I do without the support of my husband. Before I met him I drowned in my dreams rather than swam through them to the far shore. DH. What is next for you after Lilith? CE. I write plays...and just finished one on Mary Magdalene that I would love to see produced. It is a very different take on what has become an overly familiar story. In addition I want to write more on the mythology of the East. Buddha and the heritage from his teachings has given me new ways of looking at the world. I began a novel, THE DAKINI IN THE CAVE, that braids many myths together.",
  "genres": [
    "Fiction"
  ],
  "author": "Christine Emmert",
  "average_rating": "3.67",
  "url": "https://www.goodreads.com/book/show/12174854-lilith"
}