{
  "title": "Ottissippi The Truth about Great Lakes Indian History and The Gateway to the West",
  "description": "This is the sweeping history of the Great Lakes Indigenous Anishinabe - First People; the Ojibwe-Chippewa, Ottawa, Pottawatomi, Huron, Wyandotte, Iroquois and many other tribes connected to the Ottissippi - St. Clair River, Detroit River Strait, the great trade route to the center of the continent. Lakes Erie, Ontario, Superior, Michigan and Huron. The Orgins, prophecies, migration, clans, totems, chiefs, Nanabozoo, mide, metis, medicine, wars, disease, fire water, firesticks, teaching stick, vision quest, four directions, death song, counting coup, dog feast, hunting, beavers, whitefish, sturgeon, buffalo, sun dance, pow wow, longhouses, wigwams, canoes, maple sugar camp, wild rice, amazing culture and lifeways in detail every area of the history. This history has been scattered, buried and inaccessible due to complexity, time, and name changes of peoples, waterways, places and governments. This is a compendium of prior writings old and modern along with interviews, the extraordinary in depth research makes the history plain, now you can know the truth, the real history we never learned. Answers to questions we never knew. The explorers and missionaries, Black Robes, traders, northern slavery, fur trade, lumber industry, Coureurs des bois, voyageurs, and warriors. Wizards, pirates, The French, British, Dutch, English, Quebec, Louisiana, Spanish, Americans, Northwest Territory, Ohio, Indiana Territory, Illinois, Canadian, Ontario, Upper Canada, Western District, Windsor - Sandwich, Lambton County, St. Clair County, Port Huron and Detroit. The Revolutionary war, Beaver wars, Iroquois wars, Fox war, Saulk war,War of 1812, Patriot war, and Quebec Act, United Empire Loyalists, and Tories.. Aamjiwnaang territory, from Detroit, to Toronto, to Georgian Bay, to Alpena the west of Lansing, Michigan. The trading posts, colonialism, pioneers, treaties, reservations, racism, mounds, Boarding Schools, the Canadian Truth Commission, Ipperwash. Walpole Island, Stony Pointe, Kettle Point, Point Edward, Sombra, Sarnia, Black River, Swan Creek, Saginaw Chippewa, Thumb of Michigan, Southeast Michigan, Upper and Lower Michigan, aboriginal history. The St. Clair River, Detroit River, Teuscha Grondie, Lake Huron - Karegnondi, Cass River, Huron River, Flint River, Belle River, Lake St. Clair, Ohio River, St. Mary's River, Grand River, Thames River, Chenail Escarte, Raisen River, Saginaw watershed, deltas, islands, and many more historic rivers, creeks and waterways. Upper Canada, The Western District, Kent County, United Empire Loyalists. The First Nations, Mississauga, Saulk, Sauk, Neutrals, Miami, Shawnee, Delaware, Fox - Mesquackie, Saulteurs, Saulteaux, Illinois, Osage, and many other tribes who were in the area. Chiefs, Kioscance, Animikance - Little Thunder, Pontiac, Tecumseh, Okemos, Black Snake, Wawanosh, Plains, Neome, Sanilac, Shabonna, Shawano, John Riley, Mother Rodd. Catholic and Methodists, Jesuits, Father Richard, William Case, Peter Jones, Charles Eastman, Henry Chase and more. Forts, Edward, Detret, Duluth, Sinclair, Ponchetrain, Dubaude, St. Joseph, Gratiot, Malden, Maiden, Cadillac, Lahonton. The Family Compact, The Ohio Company, American Fur Company, Northwest Company, and Hudson's Bay Company. Generals, Dulhut - Duluth, Sinclair, Wayne, Amhurst, Washington, Braddock, George Rogers Clark, Harmar, St. Clair, Hamilton, Depeyster, Proctor, Cass, Hull, Gladwin, Schoolcraft, John Johnston, Croghan, McKee, Langlade, and Brandt. Campaus, Askin, Astor, Abbott, Z.W. Bunce, Babys, Wards, Jacob Smith, Harrington, Glyshaws, Beards, Howard, Brakeman. . White Rock, Sanilac Petroglyphs, Gnadenhutten, Cahokia, Vincennes, Kaskaskia, Underground Railroad, .Paul Bunyan, Lake Huron Land Bridge, Draper Park, Port Huron, Michigan, Mt. Pleasant Industrial Boarding School, NAGPRA - Native American Graves Protection and Repatriation Act. These are the main topics there is much more.",
  "genres": [],
  "author": "Cheryl L.  Morgan",
  "average_rating": "3.89",
  "url": "https://www.goodreads.com/book/show/36221753-ottissippi-the-truth-about-great-lakes-indian-history-and-the-gateway-to"
}