{
  "title": "Untangling the Black Web",
  "description": "\"By far the best book I have read this year\" - Robin SamsOceans Eleven meets The Firm in this explosive conspiracy thriller.American True Care is the largest and most powerful healthcare corporation in the nation. Everyone knows their power is built on secret deals that come from the top of a massive corporate ladder, but they're careful to cover their tracks. David Higgins is only a low level lawyer, but when David's beautiful wife dies of cancer and they deny her bills, he decides that he's going to find a way to be the one to finally blow the whistle.David sets out on a covert mission to uncover the secret behind-closed-doors deals the company is run on. It's a dangerous game and he cannot be caught. David puts together a clandestine team of insiders to investigate, and infiltrate the system.It's the next Enron waiting to happen.Bribery, blackmail, and espionage. The deeper they dig, the farther the cover ups go. Who can actually be trusted and what's real? The clock is ticking to blow the whistle untraced because even one mistake could cost them everything...⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯Praise for UNTANGLING THE BLACK \"A truly riveting piece of work - this author is definitely one to watch...\"  -Readers' Favorite\"Very addicting. Outstanding, spine chilling investigative story. Hard to put down.\" - Amazon Reviewer \"WOW... This book is exciting, thrilling, dark, sinister, and extremely well written! I want MORE!\" - Bea \"May cause sleeplessness, late nights, ignored chores. AKA 'just one more page' syndrome. Highly addictive.\" - AvidReader \"I, or maybe the world, needs more books like this one.\" - Goodreads Reviewer\"Wow! Thrilling, spine tingling political conspiracy exposition... had me twisting and turning trying to find my way through this dangerous maze.\" - BookDragon Nin \"I couldn't put it down... There are so many wonderful twists and turns in the plot that I was kept guessing all the way to the end.\" - Kristen⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯ Untangling the Black Web is a 2017 Amazon Kindle Scout Winner.",
  "genres": [
    "Legal Thriller"
  ],
  "author": "T.F. Jacobs",
  "average_rating": "4.23",
  "url": "https://www.goodreads.com/book/show/36223062-untangling-the-black-web"
}