{
  "title": "Dickens and Christmas",
  "description": "Dickens and Christmas is an exploration of the 19th-century phenomenon that became the Christmas we know and love today – and of the writer who changed, forever, the ways in which it is celebrated. Charles Dickens was born in an age of great social change. He survived childhood poverty to become the most adored and influential man of his time. Throughout his life, he campaigned tirelessly for better social conditions, including by his most famous work, A Christmas Carol. He wrote this novella specifically to “strike a sledgehammer blow on behalf of the poor man’s child”, and it began the Victorians’ obsession with Christmas.This new book, written by one of his direct descendants, explores not only Dickens’s most famous work, but also his all-too-often overlooked other Christmas novellas. It takes the readers through the seasonal short stories he wrote, for both adults and children, includes much-loved festive excerpts from his novels, uses contemporary newspaper clippings, and looks at Christmas writings by Dickens’ contemporaries. To give an even more personal insight, readers can discover how the Dickens family itself celebrated Christmas, through the eyes of Dickens’s unfinished autobiography, family letters, and his children’s memoirs.In Victorian Britain, the celebration of Christmas lasted for 12 days, ending on 6 January, or _Twelfth Night_. Through Dickens and Christmas, readers will come to know what it would have been like to celebrate Christmas in 1812, the year in which Dickens was born. They will journey through the Christmases Dickens enjoyed as a child and a young adult, through to the ways in which he and his family celebrated the festive season at the height of his fame. It also explores the ways in which his works have gone on to influence how the festive season is celebrated around the globe.",
  "genres": [
    "Nonfiction",
    "Christmas",
    "History",
    "Biography",
    "Biography Memoir",
    "Literature",
    "Holiday"
  ],
  "author": "Lucinda Hawksley",
  "average_rating": "4.18",
  "url": "https://www.goodreads.com/book/show/36235403-dickens-and-christmas"
}