{
  "title": "Still Waters: The Secret World of Lakes",
  "description": "A fascinating exploration of lakes around the world, from Walden Pond to the Dead Sea. More than a century and a half have passed since Walden was first published, and the world is now a very different place. Lakes are changing rapidly, not because we are separate from nature but because we are so much a part of it. While many of our effects on the natural world today are new, from climate change to nuclear fallout, our connections to it are ancient, as core samples from lake beds reveal. In Still Waters , Curt Stager introduces us to the secret worlds hidden beneath the surfaces of our most remarkable lakes, leading us on a journey from the pristine waters of the Adirondack Mountains to the wilds of Siberia, from Thoreau’s cherished pond to the Sea of Galilee. Through decades of firsthand investigations, Stager examines the significance of our impacts on some of the world’s most iconic inland waters. Along the way he discovers the stories these lakes contain about us, including our loftiest philosophical ambitions and our deepest myths. For him, lakes are not only mirrors reflecting our place in the natural world but also windows into our history, culture, and the primal connections we share with all life. Beautifully observed and eloquently written, Stager’s narrative is filled with strange and enchanting details about these submerged worlds―diving insects chirping underwater like crickets, African crater lakes that explode, and the growing threats to some of our most precious bodies of water. Modern science has demonstrated that humanity is an integral part of nature on this planet, so intertwined with it that we have also become an increasingly powerful force of nature in our own right. Still Waters reminds us how beautiful, complex, and vulnerable our lakes are, and how, more than ever, it is essential to protect them. 37 photographs",
  "genres": [
    "Nature",
    "Science",
    "Nonfiction",
    "Natural History",
    "Environment",
    "Travel",
    "Sustainability"
  ],
  "author": "Curt Stager",
  "average_rating": "3.77",
  "url": "https://www.goodreads.com/book/show/36236102-still-waters"
}