{
  "title": "American Eden: David Hosack, Botany, and Medicine in the Garden of the Early Republic",
  "description": "On a clear morning in July 1804, Alexander Hamilton stepped onto a boat at the edge of the Hudson River. He was bound for a New Jersey dueling ground to settle his bitter dispute with Aaron Burr. Hamilton took just two men with him: his “second” for the duel, and Dr. David Hosack.As historian Victoria Johnson reveals in her groundbreaking biography, Hosack was one of the few points the duelists did agree on. Summoned that morning because of his role as the beloved Hamilton family doctor, he was also a close friend of Burr. A brilliant surgeon and a world-class botanist, Hosack—who until now has been lost in the fog of history—was a pioneering thinker who shaped a young nation.Born in New York City, he was educated in Europe and returned to America inspired by his newfound knowledge. He assembled a plant collection so spectacular and diverse that it amazes botanists today, conducted some of the first pharmaceutical research in the United States, and introduced new surgeries to American. His tireless work championing public health and science earned him national fame and praise from the likes of Thomas Jefferson, James Madison, Alexander von Humboldt, and the Marquis de Lafayette.One goal drove Hosack above all others: to build the Republic’s first botanical garden. Despite innumerable obstacles and near-constant resistance, Hosack triumphed when, by 1810, his Elgin Botanic Garden at last crowned twenty acres of Manhattan farmland. “Where others saw real estate and power, Hosack saw the landscape as a pharmacopoeia able to bring medicine into the modern age” (Eric W. Sanderson, author of Mannahatta). Today what remains of America’s first botanical garden lies in the heart of midtown, buried beneath Rockefeller Center.Whether collecting specimens along the banks of the Hudson River, lecturing before a class of rapt medical students, or breaking the fever of a young Philip Hamilton, David Hosack was an American visionary who has been too long forgotten. Alongside other towering figures of the post-Revolutionary generation, he took the reins of a nation. In unearthing the dramatic story of his life, Johnson offers a lush depiction of the man who gave a new voice to the powers and perils of nature.",
  "genres": [
    "History",
    "Nonfiction",
    "Biography",
    "Science",
    "Nature",
    "American History",
    "Medicine"
  ],
  "author": "Victoria  Johnson",
  "average_rating": "4.03",
  "url": "https://www.goodreads.com/book/show/36236146-american-eden"
}