{
  "title": "Song in a Weary Throat: Memoir of an American Pilgrimage",
  "description": "First published posthumously in 1987, Pauli Murray’s Song in a Weary Throat was critically lauded, winning the Robert F. Kennedy Book Award and the Lillian Smith Book Award among other distinctions. Yet Murray’s name and extraordinary influence receded from view in the intervening years; now they are once again entering the public discourse. At last, with the republication of this “beautifully crafted” memoir, Song in a Weary Throat takes its rightful place among the great civil rights autobiographies of the twentieth century.In a voice that is energetic, wry, and direct, Murray tells of a childhood dramatically altered by the sudden loss of her spirited, hard-working parents. Orphaned at age four, she was sent from Baltimore to segregated Durham, North Carolina, to live with her unflappable Aunt Pauline, who, while strict, was liberal-minded in accepting the tomboy Pauli as “my little boy-girl.” In fact, throughout her life, Murray would struggle with feelings of sexual “in-betweenness”—she tried unsuccessfully to get her doctors to give her testosterone—that today we would recognize as a transgendered identity.We then follow Murray north at the age of seventeen to New York City’s Hunter College, to her embrace of Gandhi’s Satyagraha—nonviolent resistance—and south again, where she experienced Jim Crow firsthand. An early Freedom Rider, she was arrested in 1940, fifteen years before Rosa Parks’ disobedience, for sitting in the whites-only section of a Virginia bus. Murray’s activism led to relationships with Thurgood Marshall and Eleanor Roosevelt—who respectfully referred to Murray as a “firebrand”—and propelled her to a Howard University law degree and a lifelong fight against \"Jane Crow\" sexism. We also read Betty Friedan’s enthusiastic response to Murray’s call for an NAACP for Women—the origins of NOW. Murray sets these thrilling high-water marks against the backdrop of uncertain finances, chronic fatigue, and tragic losses both private and public, as Patricia Bell-Scott’s engaging introduction brings to life.Now, more than thirty years after her death in 1985, Murray—poet, memoirist, lawyer, activist, and Episcopal priest—gains long-deserved recognition through a rediscovered memoir that serves as a “powerful witness” (Brittney Cooper) to a pivotal era in the American twentieth century.",
  "genres": [
    "Nonfiction",
    "Memoir",
    "History",
    "Feminism",
    "Biography",
    "Race",
    "Law"
  ],
  "author": "Pauli Murray",
  "average_rating": "4.60",
  "url": "https://www.goodreads.com/book/show/36236154-song-in-a-weary-throat"
}