{
  "title": "Beloved",
  "description": "The final installment of our romantic M/M Beauty & The Beast series!  Nick Fairfax believes that his romance with Lord Bane Dunsaney is over. Bane has chosen revenge against Nick’s family over his love for Nick. And Bane’s secret - that he is the guardian of a tiger spirit - has also caused a wedge between them with Nick still in the dark about Bane’s true nature. Can they overcome these seemingly insurmountable problems and find their happily ever after?  Cursed: Beloved is the third and final book in the Cursed series.   Want to start at the beginning?  Cursed: Broken, Book 1, is free! Read the start of this romantic journey of Nick, a sensitive young man who gets coerced into becoming a secretive billionaire's PA to save his family's fortune... and Bane, the billionaire with a dark secret that he fears will put Nick's life in danger. https://www.amazon.com/Cursed-Broken-...  Raythe Reign produces escapist, romantic M/M shifter, fantasy, scifi, adventure, and urban fantasy books and graphic novels.    Other Gay Paranormal & Urban Fantasy Series by X. Aratare:   Cursed: Smoke is a 20,000 word alternate version of the start of Nick & Bane's romance... in a sugar-daddy gay club! It's an alternate timeline and can be read and enjoyed on its own.  Get it FREE here: http://welcome.raythereign.com/free-s...   The Merman Series  The Merman is a 5-book gay paranormal romance series, containing psychic powers, a mostly-naked merman lover, an evil scientist, and true love beneath the waves.  Book 1, Transformation, is free and available on Amazon here: https://www.amazon.com/Transformation...   The Artifact Series  The Artifact is an M/M detective romance series. The books feature some beloved tropes of both the M/M and bodyguard romance genres! There's a hot bodyguard, his determined young client, an ancient golden sarcophagus, an evil cult, and unsolved mysteries in both their pasts...  Book 2 came out in spring 2016. People who love this series really love it. Check out the first 2 books here:  The Bodyguard Book 1 (Artifact Series): https://www.amazon.com/Bodyguard-Book...  The Bodyguard Book 2 (Artifact Series): https://www.amazon.com/Bodyguard-Book...     About Raythe Reign  Raythe Reign produces mostly M/M works following the classic advice - write what you most want to read! As a result, our stories are works of entertainment and fantasies, full of action, adventure, sexy romance, heroes, and villains.  We publish stories in both serial and book formats. Visit the X. Aratare author page for more of our series and stand-alone works.",
  "genres": [
    "Romance",
    "M M Romance",
    "Paranormal",
    "Shapeshifters",
    "Fantasy",
    "Magic",
    "Audiobook"
  ],
  "author": "X. Aratare",
  "average_rating": "4.17",
  "url": "https://www.goodreads.com/book/show/36230119-beloved"
}