{
  "title": "Tesla: Inventor of the Modern",
  "description": "Tesla’s inventions transformed our world, and his visions have continued to inspire great minds for generations.Nikola Tesla invented the radio, robots, and remote control. His electric induction motors run our appliances and factories, yet he has been largely overlooked by history. In Tesla, Richard Munson presents a comprehensive portrait of this farsighted and underappreciated mastermind.When his first breakthrough—alternating current, the basis of the electric grid—pitted him against Thomas Edison’s direct-current empire, Tesla’s superior technology prevailed. Unfortunately, he had little business sense and could not capitalize on this success. His most advanced ideas went unrecognized for decades: forty years in the case of the radio patent, longer still for his ideas on laser beam technology. Although penniless during his later years, he never stopped imagining. In the early 1900s, he designed plans for cell phones, the Internet, death-ray weapons, and interstellar communications. His ideas have lived on to shape the modern economy.Who was this genius? Drawing on letters, technical notebooks, and other primary sources, Munson pieces together the magnificently bizarre personal life and mental habits of the enigmatic inventor. Born during a lightning storm at midnight, Tesla died alone in a New York City hotel. He was an acute germaphobe who never shook hands and required nine napkins when he sat down to dinner. Strikingly handsome and impeccably dressed, he spoke eight languages and could recite entire books from memory. Yet Tesla’s most famous inventions were not the product of fastidiousness or linear thought but of a mind fueled by both the humanities and sciences: he conceived the induction motor while walking through a park and reciting Goethe’s Faust.Tesla worked tirelessly to offer electric power to the world, to introduce automatons that would reduce life’s drudgery, and to develop machines that might one day abolish war. His story is a reminder that technology can transcend the marketplace and that profit is not the only motivation for invention. This clear, authoritative, and highly readable biography takes account of all phases of Tesla’s remarkable life.",
  "genres": [
    "Biography",
    "History",
    "Nonfiction",
    "Science",
    "Technology",
    "Audiobook",
    "Biography Memoir"
  ],
  "author": "Richard Munson",
  "average_rating": "3.79",
  "url": "https://www.goodreads.com/book/show/36236161-tesla"
}