{
  "title": "Thornlight",
  "description": "Resourceful twin sisters and a desperate queen must find a new source of magic to stop their kingdom from being consumed by darkness. This classic fantasy-adventure from bestselling author Claire Legrand is full of twists, turns, and unforgettable moments. Thornlight is a must-have for fans of Tahereh Mafi and Diana Wynne Jones. A stand-alone companion to the acclaimed Foxheart.Centuries and centuries ago, the Vale was split in two in a war between witches. Ever since, an evil darkness has been climbing, climbing, climbing out of the Break, infecting everything it touches. The people of the Vale fight it with discs made of lightning—and with an ancient spell. Brier Skystone is the youngest, most talented lightning harvester the Vale’s ever seen. Her twin sister, Thorn, is a sensitive artist who’s braver than even she knows. And young Queen Celestyna Hightower is determined to be Mender of the Break, the last of her family to bear the weight of anchoring the spell—which is really more of a curse.As the darkness keeps coming, these three girls will each undertake their own perilous journeys to try to save their home—and each quest reveals an electrifying surprise. Perhaps they’ve been fighting the wrong monster all along.New York Times–bestselling author Claire Legrand creates an intricate and layered world full of unicorns, witches, mistbirds, grifflets, and unlikely heroes—with an appearance by the legendary witch Quicksilver Foxheart. This stand-alone companion to Foxheart explores what it means to be brave, and the destructive force of war on nature and communityFast-paced, memorable, and surprising, Thornlight is a perfect introduction to Claire Legrand’s work and will appeal to fans of Kelly Barnhill and Jessica Townsend.",
  "genres": [
    "Fantasy",
    "Middle Grade",
    "Adventure",
    "Fiction",
    "Magic",
    "Young Adult",
    "Young Adult Fantasy"
  ],
  "author": "Claire Legrand",
  "average_rating": "4.18",
  "url": "https://www.goodreads.com/book/show/36253142-thornlight"
}