{
  "title": "My Lives with Lucifer, Satan, Hitler and Jesus",
  "description": "Have you ever felt that earth is a strange planet and that you don't really belong here? This novel explains why so many people feel this way by telling the engaging story of one person's lives before coming to earth and his many lifetimes on this planet.This book and the other books in the series, starting with Healing Your Spiritual Traumas, form a complete package for healing the psychological and spiritual traumas that many of us received when we first took embodiment on earth and encountered beings who attempted to destroy us personally.Experience the contrast between life on natural planets (99% of the billions of inhabited planets in our universe) and unnatural planets with warfare, poverty, suffering and death. Learn how earth became an unnatural planet and how this allowed specific lifestreams to embody here. These “fallen beings” have no empathy for human beings but consider us mere tools for their experimentation. Some fallen beings have an epic cause while others consider themselves artists who “paint with the blood of humanity.” Follow the protagonist in his shocking first embodiment on earth where outrageous torture and plotting forced him into a reactionary pattern with the fallen beings. Follow his long and arduous climb until he could do the one thing that sets you free from the fallen beings.Follow the fate of three of the most cruel and insensitive fallen beings and how it was intricately linked with the mission of Jesus. The  protagonist gives a first-hand account of the lifetimes of Jesus, describing the astonishing process that made him who he was and is. Read about the true mission of Jesus and how the fallen beings have obscured it. Discover how 10,000 people vowed to stay in embodiment for these past 2,000 years in order to preserve the real message of Jesus in our time—and find out if you are one of these people.If you thought The DaVinci Code provided a provocative view of the life of Jesus, this book goes much further and effectively shatters the PIN (Programmed Illusion of Normality) created by the fallen beings. They don’t want anyone to follow the example of Jesus and thereby bring about the removal of the Dark Master who is the fallen being responsible for the wars of the 20th century.As you can see from the reviews, this book is like no other and can be the start of a profound healing process that can lead you to making peace with being on earth.",
  "genres": [],
  "author": "Kim Michaels",
  "average_rating": "4.72",
  "url": "https://www.goodreads.com/book/show/36251970-my-lives-with-lucifer-satan-hitler-and-jesus"
}