{
  "title": "Act Your Age",
  "description": "A spicy office romance featuring intense chemistry, a gruff Alpha Hero, an innocent heroine and forbidden desires. Act Your Age is a captivating journey of love and self-discovery. He’s already her boss, now he wants to be her Daddy...All Kate 'Middleton' McGrath wants is a man to call 'Daddy' in bed. But kinks aren't for everyone. She gets it. They're definitely not going to be for her strict, grumpaholic boss, Mr Henderson. But a girl can dream, can't she? Especially when he's always so stern with her…Tyler Henderson is a golden boy who's lost his shine. He's old, his dream career is over, his fiancée left him. Now all the former firefighter can do is bury his troubles in paperwork and hard liquor... and try to keep Middleton out of his head. He's not going anywhere near that girl. He's done with sweet and innocent. And things don't come much sweeter or more innocent than a cupcake-baking engineer who knits her own hats.When a case of mistaken identity forces Kate and Ty together, the naive sweetheart and the reformed playboy realize they have more in common—and more to lose—than either of them could have predicted… ACT YOUR AGE is a standalone bestselling novel by critically acclaimed author Eve Dangerfield.★★★★★ \"A love letter to readers who've ever been made to feel weird for loving daddy kink. Dangerfield is a bold, brilliant, captivating voice who should be at the very top of your TBR.\" NYT bestseller Tessa Bailey★★★★★ \"Thoughtful and incredibly hot, I loved Act Your Age! Eve Dangerfield is a new auto-buy author for me.\" NYT bestseller Skye Warren★★★★★ \"Fresh, sexy and fun. Act Your Age is Australian erotic romance at its best.\" NYT bestseller Kylie Scott★★★★★ \"It's 2am and this book is everything and I. Am. Dead. If you have to read one daddy book; read this one.\" NYT bestseller L.J. Shen★★★★★ \"This book was magic. Flawlessly written, make you squirm uncomfortably and laugh out loud magic!\" Dirty Girl Romance★★★★★ \"Eve Dangerfield continues to delight with this totally filthy story that also manages to be funny, heartfelt and utterly original.\" Book Bellas★★★★★ \"The 'Daddy' of all Daddy books.\" Paige",
  "genres": [
    "Romance",
    "BDSM",
    "Erotica",
    "Contemporary Romance",
    "Contemporary",
    "Erotic Romance",
    "Adult"
  ],
  "author": "Eve Dangerfield",
  "average_rating": "3.75",
  "url": "https://www.goodreads.com/book/show/36252773-act-your-age"
}