{
  "title": "The Odd Trump: A Novel",
  "description": "\"The Odd Trump\" is a charming Victorian novel published by George J. A. Coulson in 1874. The \"odd trump\"' is not a winning card held by one of the characters, but is the hero himself. The hero is the old-fashioned hero of novels of a century ago—a strong, brave, tenderhearted, and honest young man, who opens the ball by rescuing the heroine from a watery grave.The most intriguing thing about the book to modern readers is that the two main characters are an American named Clinton and an Englishman named Trump. The heroes become friends as well as competitors in seeking the hand of the same woman; the book progresses through a series of exciting adventures and intrigues that include money, real estate transactions, villainy, and Clinton's involvement in a sword duel.The book received high praise upon its \"Deserving the highest praise Its incidents are all apotheosis of chivalric bravery and courtesy and is written in elegant English with a purity of style that is in itself refreshing.\" -Louisville Courier Journal\"A charming story well told. And certainly its freshness, lively humor, natural truth, variety of incidents, well-conceived and well-sustained characters, a vigorous, unaffected style, and a healthful, manly tone about the whole, constitute a thoroughly good story.\" -The Southern MagazineHas \"cleverness ... written by an American who has lived a good deal in England, or, at any rate, is familiar with many peculiarities of English society.\" -The Nation\"Bright and lively from preface to postscript.\" -Philadelphia North AmericanIn its September 25, 2016, issue The New Yorker also reviewed the \"Odd Trump\" favorably, \"I think I really began to like this Trump fellow ... a ripe bit of Victorian preposterousness ... holds some peculiar pleasures.\"George J. A. Coulson (1819-1882) was a preacher and novelist, was born in the South in 1819, but came North at the commencement of the late civil war. For many years he was a contributor to religious papers.Coulson’s other books in the “Odd Trump Series” The Lacy Diamonds; Flesh & Spirit; The Ghost Of Redbrook; The Clifton picture; and Harwood",
  "genres": [],
  "author": "George James Atkinson Coulson",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/36247191-the-odd-trump"
}