{
  "title": "Winterglass",
  "description": "Winterglass is a sci-fantasy about one woman’s love for her homeland (Sirapirat) and her determination to defeat the Winter Queen who has overtaken the land.  The city-state Sirapirat once knew only warmth and monsoon. When the Winter Queen conquered it, she remade the land in her image, turning Sirapirat into a country of snow and unending frost. But an empire is not her only goal. In secret, she seeks the fragments of a mirror whose power will grant her deepest desire.  At her right hand is General Lussadh, who bears a mirror shard in her heart, as loyal to winter as she is plagued by her past as a traitor to her country. Tasked with locating other glass-bearers, she finds one in Nuawa, an insurgent who’s forged herself into a weapon that will strike down the queen.  To earn her place in the queen’s army, Nuawa must enter a deadly tournament where the losers’ souls are given in service to winter. To free Sirapirat, she is prepared to make sacrifices: those she loves, herself, and the complicated bond slowly forming between her and Lussadh.  If the splinter of glass in Nuawa's heart doesn't destroy her first.  \"A fairy tale, beautiful like an ice crystal, and razor sharp.\" --Silvia Moreno-Garcia, World Fantasy Award-winning co-editor of She Walks in Shadows  \"Winterglass is rich with diamondine prose, a scintillant retelling of the Ice Queen that challenges Occidental aesthetics, colonial mentality, and personal identity.\" --Cassandra Khaw, author of Hammers on Bone, BFA & Locus Award nominee  \"An exquisite gem of a novella. Politics, relationships, and combat presented as a matryoshka, the beauty of which is there's no easy way of telling which shells are within which. Sriduangkaew’s sensuous metaphors and elegant imagery are never less than a pleasure to read. Thoroughly recommended. \" --Jonathan L. Howard, author of Johannes Cabal the Necromancer",
  "genres": [
    "Fantasy",
    "LGBT",
    "Science Fiction",
    "Queer",
    "Novella",
    "Retellings",
    "Fiction"
  ],
  "author": "Benjanun Sriduangkaew",
  "average_rating": "3.66",
  "url": "https://www.goodreads.com/book/show/36240189-winterglass"
}