{
  "title": "Hockey Bear Season",
  "description": "One is never enough when you can have two...  Fighting on the ice every day is hard work, but it's easier when a bear has his brother by his side. But even werebear superstar athletes aren't immune to drama and when it hits, the ice gets really slippery. Finding a mate can be the furthest thing from a bear's mind but when the right curvy, sassy, whipsmart woman comes along, two bears have to work as one to win her over and make her theirs. Forever.  If you like your romance a little filthy, a little sweet and a little sassy, these novels are exactly for you!  This anthology includes four full MFM paranormal romance novels from the Hockey Bear Season series. Each book has a happily ever after ending, no cheating and can and should be read as a standalone!  The boxed set includes:  Double Bear Trouble  Nothing as dangerous as two werebears on a mission to win... Chloe Marks doesn't have time for love, and that's that. So why is it that when she needs it the least, two men who couldn't be more different crash into her life and spin everything on its head?  Double Bear Secret  A little white lie never hurt anyone, right? Unless it pucks everything up, of course... Crash and Connor Rawlins are tabloid darlings, and not by their own choice. The werebear twins messed around with the wrong woman, and she knows exactly how to turn it into cold hard cash. With more than a little to hide, they've decided on not chasing any more tail... But what happens when a woman comes along who they just can't say no to?  Double Bear Chase  Sometimes, running from your problems leads you right to their solution. Melissa Morrison has had enough. Enough of cheating fiancees, of public disgrace, and failures one after another. Hiding away in quiet Shifter Grove seemed like the only thing left to do, along with starting a new life. But the curvy, resourceful woman couldn't have expected that starting from the bottom means flying right into the arms of two men who were not good at taking no for an answer.  Double Bear Taste  Sometimes, a bear's problems can be bigger off the ice than on it... Finn and Foster Caldwell are masters at getting into trouble, but the hockey star brothers might have met their match. Suspended, they need to make good on their promise to fix up their act. That includes visits with a psychiatrist, which would be unacceptable, if she didn't happen to be the most enchanting woman they've ever met.",
  "genres": [],
  "author": "Anya Nowlan",
  "average_rating": "4.44",
  "url": "https://www.goodreads.com/book/show/36242370-hockey-bear-season"
}