{
  "title": "Hamilton's Battalion: A Trio of Romances",
  "description": "Love in the time of Hamilton…On October 14, 1781, Alexander Hamilton led a daring assault on Yorktown's defenses and won a decisive victory in America's fight for independence. Decades later, when Eliza Hamilton collected his soldiers' stories, she discovered that while the war was won at Yorktown, the battle for love took place on many fronts...PROMISED LAND by Rose LernerDonning men's clothing, Rachel left her life behind to fight the British as Corporal Ezra Jacobs--but life catches up with a vengeance when she arrests an old love as a Loyalist spy.At first she thinks Nathan Mendelson hasn't changed one bit: he's annoying, he talks too much, he sticks his handsome nose where it doesn't belong, and he's self-righteously indignant just because Rachel might have faked her own death a little. She'll be lucky if he doesn't spill her secret to the entire Continental Army.Then Nathan shares a secret of his own, one that changes everything...THE PURSUIT OF... by Courtney MilanWhat do a Black American soldier, invalided out at Yorktown, and a British officer who deserted his post have in common? Quite a bit, actually.* They attempted to kill each other the first time they met.* They're liable to try again at some point in the five-hundred mile journey that they're inexplicably sharing.* They are not falling in love with each other.* They are not falling in love with each other.* They are.... Oh, no.THAT COULD BE ENOUGH by Alyssa ColeMercy Alston knows the best thing to do with pesky feelings like \"love\" and \"hope\": avoid them at all cost. Serving as a maid to Eliza Hamilton, and an assistant in the woman's stubborn desire to preserve her late husband's legacy, has driven that point home for Mercy—as have her own previous heartbreaks.When Andromeda Stiel shows up at Hamilton Grange for an interview in her grandfather's stead, Mercy's resolution to live a quiet, pain-free life is tested by the beautiful, flirtatious, and entirely overwhelming dressmaker.Andromeda has staid Mercy reconsidering her worldview, but neither is prepared for love—or for what happens when it's not enough.",
  "genres": [
    "Romance",
    "Historical Fiction",
    "Historical",
    "Historical Romance",
    "Anthologies",
    "LGBT",
    "Short Stories"
  ],
  "author": "Rose Lerner",
  "average_rating": "3.99",
  "url": "https://www.goodreads.com/book/show/36249994-hamilton-s-battalion"
}