{
  "title": "Changing Bodies, Changing Lives",
  "description": "\"It seems like everyone else has the script. Everyone else knows what's happening and I look around and say, Duh.\"Of course, the truth is that no one has the script because there is no script to follow. Chances are you'd find that almost everyone else has questions and worries a lot like yours, if you could get them to admit it. This brand-new, completely updated and revised edition of Changing Bodies, Changing Lives is full of honest, accurate, nonjudgmental information on everything teenagers need to know about today.Am I the only one whocan't get up the nerve to ask someone out?got my period so early?doesn't even know the right way to kiss?feels pressured to use drugs?still hasn't hit puberty yet?wants to avoid the gang scene?worries when my mom doesn't come home at night?is scared that I might have AIDS?can't decide what form of birth control to use?has no idea how to tell my friends I'm gay?goes on eating binges?has never had an orgasm?is shut out of the popular crowd?Changing Bodies, Changing Lives has helped hundreds of thousands of teenagers make informed decisions about their lives, from questions about sex, love, friendship, and how your body works to dealing with problems at school and home and figuring out who you are. It's packed with illustrations, checklists, and resources for the answers you really need. Best of all, it's filled with the voices, poems, and cartoons from hundreds of other teenagers, who tell you what makes them feel worried, angry, confused, sexy, happy, and, yes, even excited and hopeful about their lives. (Check out the first two pages for a sample of the quotes you'll find inside.)Being a teenager is tough. With the information and the ideas inside this book, you'll have what you need to make these years the best they can be.",
  "genres": [
    "Young Adult",
    "Reference",
    "Health",
    "Sexuality",
    "Teen"
  ],
  "author": "Ruth Bell",
  "average_rating": "4.33",
  "url": "https://www.goodreads.com/book/show/362630.Changing_Bodies_Changing_Lives"
}