{
  "title": "When a Lord Loves a Lady",
  "description": "Do you choose love even if it means scandal and a broken heart? Captivating, giggle-worthy Regency Romance novels uniting wallflowers, bluestockings, and spinsters with roguish lords, wounded soldiers, and even a dashing pirate. Familiar tropes fill the pages of these historical page-turners, including second chances, friends to lovers, tortured military heroes, ugly ducklings, and unrequited love. Misunderstandings, self-doubts, secrets, shadowed pasts, and antagonists you'll long to clobber, have the flawed, but charming characters, trotting headlong into romantic mayhem. Will the heroes' and heroines' fledgling love survive the tumult? Oh, such chaos and conflict reign for these lords and ladies, which means scrumptious, satisfying historical romance stories you must read in one sitting! Caution:  This five-book set contains unconventional, frequently head-strong Regency misses, lords you'll want to hug and smack upside their handsome heads, a cast of secondary characters from utterly charming to dastardly, and more than one spoiled feline with superior airs. Buy this charming Regency Romances collection of heartwarming happily ever afters for delightful, romantic escapes into Regency England's historical past. A Kiss for a Rogue:  Can a beautiful spinster trust love again? Especially if the same man asks? A sweet story of love relinquished and redeemed as once betrothed Allen Wimpleton and Olivia Kingsley meet again after a three year separation only to discover their love is stronger than ever. A Bride for a Rogue:  When is love not enough? A clumsy noblewoman resigned to spinsterhood determines to win the heart of the man she's loved since girlhood-a penniless soldier who returns from India, a disfigured and disillusioned. A Rogue's Scandalous Wish:  A marriage offer obligated by duty; an acceptance compelled by desperation. A stolen moonlight kiss, the threat of a duel, and the subsequent scandal result in a compulsory marriage offer and an equally unenthusiastic acceptance. To Capture a Rogue's Heart:  Could you give up what you're most passionate about forever? When a privateer-turned-duke enlists help finding a bride from a woman intended for another, neither is prepared for the resulting havoc. The Rogue and the Wallflower:  He loved her beyond anything and everything-precisely why he couldn't ever marry her. Since an explosion ravaged Captain Morgan Le Draco's face, he's fortified himself behind an impenetrable rampart of cynicism and distrust. Scorned and ridiculed most of her adult life, Shona, Lady Atterberry is reconciled to spinsterhood, until Morgan saves her life, and neither can deny the immediate, powerful, and sensual attraction that sparks between them.",
  "genres": [
    "Historical Romance"
  ],
  "author": "Collette Cameron",
  "average_rating": "4.49",
  "url": "https://www.goodreads.com/book/show/36264124-when-a-lord-loves-a-lady"
}