{
  "title": "White American Youth: My Descent into America's Most Violent Hate Movement—and How I Got Out",
  "description": "A stunning look inside the world of violent hate groups by a onetime white supremacist leader who, shaken by a personal tragedy, realized the error of his ways and abandoned his destructive life to become an anti-hate activist.  As he stumbled through high school, struggling to find a community among other fans of punk rock music, Christian Picciolini was recruited by a now notorious white power skinhead leader and encouraged to fight with the movement to \"protect the white race from extinction.\" Soon, he had become an expert in racist philosophies, a terror who roamed the neighborhood, quick to throw fists. When his mentor was arrested and sentenced to eleven years in prison, sixteen-year-old Picciolini took over the man's role as the leader of an infamous neo-Nazi skinhead group.  Seduced by the power he accrued through intimidation, and swept up in the rhetoric he had adopted, Picciolini worked to grow an army of extremists. He used music as a recruitment tool, launching his own propaganda band that performed at white power rallies around the world. But slowly, as he started a family of his own and a job that for the first time brought him face to face with people from all walks of life, he began to recognize the cracks in his hateful ideology. Then a shocking loss at the hands of racial violence changed his life forever, and Picciolini realized too late the full extent of the harm he'd caused.  Raw, inspiring, and heartbreakingly candid, White American Youth tells the fascinating story of how so many young people lose themselves in a culture of hatred and violence and how the criminal networks they forge terrorize and divide our nation.",
  "genres": [
    "Nonfiction",
    "Memoir",
    "Biography",
    "Politics",
    "Race",
    "Audiobook",
    "History"
  ],
  "author": "Christian Picciolini",
  "average_rating": "3.98",
  "url": "https://www.goodreads.com/book/show/36262385-white-american-youth"
}