{
  "title": "The Lost Vintage",
  "description": "Sweetbitter meets The Nightingale in this page-turning novel about a woman who returns to her family’s ancestral vineyard in Burgundy and unexpectedly uncovers a lost diary, an unknown relative, and a secret her family has been keeping since World War IITo become one of only a few hundred certified wine experts in the world, Kate must pass the notoriously difficult Master of Wine Examination. She’s failed twice before; her third attempt will be her last. Suddenly finding herself without a job and with the test a few months away, she travels to Burgundy, to spend the fall at the vineyard estate that has belonged to her family for generations. There she can bolster her shaky knowledge of Burgundian vintages and reconnect with her cousin Nico and his wife Heather, who now oversee the grapes’ day-to-day management. The one person Kate hopes to avoid is Jean-Luc, a neighbor vintner and her first love.At the vineyard house, Kate is eager to help her cousins clean out the enormous basement that is filled with generations of discarded and forgotten belongings. Deep inside the cellar, behind a large armoire, she discovers a hidden room containing a cot, some Resistance pamphlets, and an enormous cache of valuable wine. Piqued by the secret space, Kate begins to dig into her family’s history—a search that takes her back to the dark days of the Second World War and introduces her to a relative she never knew existed, a great half-aunt who was teenager during the Nazi occupation.As she learns more about her family, the line between Resistance and Collaboration blurs, driving Kate to find the answers to two crucial questions: Who, exactly, did her family aid during the difficult years of the war? And what happened to six valuable bottles of wine that seem to be missing from the cellar’s collection?",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "France",
    "Book Club",
    "World War II",
    "Historical",
    "Mystery"
  ],
  "author": "Ann Mah",
  "average_rating": "4.03",
  "url": "https://www.goodreads.com/book/show/36260431-the-lost-vintage"
}