{
  "title": "The Spell Of The Horse: Stories of Healing and Personal Transformation with Nature’s Finest Teachers",
  "description": "The healing power of horsesThe ability of the horse to sense emotion, energy & spirit goes way beyond what most of us realiseDiscover the true nature of the horse and the spiritual connections between horse and humanA collection of inspiring true stories depicting some of the transformational interactions between horse and human facilitated by Pam Billinge, a pioneering equine-assisted coach and therapist since 2008.Pam also shares her own courageous path to redemption - from hitting an emotional rock bottom to finding the strength to follow her dream. Pam's insight into the true nature of the horse was awakened in the face of personal tragedy when her horse mirrored the emotional turmoil surrounding her mother's terminal cancer diagnosis.What unfolds in this book is a powerful exploration of the deep, spiritual bond between horses and humans, revealing the horse's boundless capacity to facilitate healing.The Spell of the Horse and its sequel The Spirit of the Horse are far more than memoirs. They are pragmatic, mindful, self-help guides that beckons those seeking to enrich their connection with horses, themselves, and the natural world. Discover simple principles within these pages that guide you through life's challenges, leading you to a path of happiness and fulfillment.Open your heart to the spellbinding wisdom of horses and let Pam Billinge's captivating narrative be your guide to a deeper, more meaningful existence.What readers are ***** 'Will repay the few hours it will take you to read many times over.'***** 'An enchanting, beautiful book.'***** 'Will change the way you see horses.'***** 'Insightful, uplifting and emotionally engaging.'***** 'Describes the most powerful sense of a horse being spirit and energy more than sight and sound.'***** 'Had me in tears more than once.'***** 'A reminder that life is about ‘being’ rather than ‘doing’***** 'Her special affinity & deep respect for horses shines through.'***** 'If you’re feeling lost in your life I urge you to read it.'***** 'I have not read another book now in the last week (unheard of for me)!'***** 'Not just for horse lovers, but for anyone interested in finding sustainable ways to overcome personal challenges.'***** 'As a counsellor, this is an inspirational book.'Pam's experiences and insights will be of especial interest to psychotherapists, counsellors and coaches working with mindfulness and somatic awareness, students of equine assisted learning, equine assisted therapy, natural horsemanship or horse behaviour.",
  "genres": [],
  "author": "Pam Billinge",
  "average_rating": "4.25",
  "url": "https://www.goodreads.com/book/show/36260318-the-spell-of-the-horse"
}