{
  "title": "HOW TO BE A SUCCESSFUL SLAVE: Using LAME Methodology",
  "description": "Do you have enough free time? If yes, you are doing something wrong :)You should read this book if: - Do you start to dislike your job? - Or you have the feeling that something is off? - Did you start to desire more time for yourself? - Are you sick of bad management and ass kissing? - Do you want to be your own boss, to start your own business? At some point in life (usually after a specific age) you start to change your way of thinking about your career, life, family etc. You start to desire more time for yourself realizing that you dedicate too much time working for someone else, while you could dedicate more time to yourself, to have a better work/life balance. But you do nothing about it. Why? This book, in a humoristic way, tries to help you decide if those type of thoughts are good or wrong and what you should do about. More exactly, how you should address the matter, how you should think about work and life balance. This is what LAME is about. LAME is a methodology, a way of thinking, with a single purpose: to help you understand if your \"new\" desires about your job, your hobbies, your personal life, etc. are the right path. The title of the book \"HOW TO BE A SUCCESSFUL SLAVE\" tries to give you an idea about the fact that this book is a satire and need to be treated as is. However, you can change its sense by reading it between lines - for example: if you will agree with the book content that there is a very big problem with the balance between work and free time, then do exactly opposite to solve the problem. This publication of perfect expound procedures, principles and precisely pointed opinions, should be practiced by all people on the planet who have a profound, peculiar passion for obedience, who pursue the sole idea of perfection and by those who have the particular purpose of progress in their circadian performances. And not to pretermit those who oppose the personal life principles with the purpose of promoting the toiling. If you perceived that your purpose perished from the path of labor, because of your open personality and principles, then this publication will patently save your persona from oblivion and will unveil an epiphany about the peerless path of obedience you should pick. The purpose, of this Peculiar Paragraph written in this Particular way, is to to apply the MAK tactic Presented in this book and to make a Point, regarding it.",
  "genres": [],
  "author": "Evory Salieri",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/36262988-how-to-be-a-successful-slave"
}