{
  "title": "Survive and Thrive: Winning Against Strategic Threats to Your Business",
  "description": "Whether big or small, companies incessantly face challenges that can threaten their bottom line and even their survival. These threats keep corporate leaders up at night. What can companies do to stay alive? Survive and Thrive: Winning Against Strategic Threats to Your Business features a collection of essays by strategy professors at the University of Toronto’s Rotman School of Management, Canada’s #1 business school. The essays take the reader on a tour through some of the most vexing threats to business today, threats that put the very existence of organizations into question. From disruptive innovation, to social media disasters, to mistaken technical investments, to gender discrimination, to misunderstood competition, companies need to be able to anticipate crises and prepare to deal with them head on. Across this collection of essays, readers will get warnings about four mistakes that companies commonly make – failing to appreciate interactions within systems, getting stuck in existing ways of doing business, falling victim to cognitive biases, and getting derailed by short-term incentives.But, this book isn’t just about mistakes. Its primary goal is to provide step-by-step actions to help companies stay alive. Executives will find principles and practices for anticipating potential threats and creating responses that permit their businesses to not only survive but thrive.Editor Joshua S. Gans is a professor of Strategic Management and holds the Jeffrey S. Skoll Chair of Technical Innovation and Entrepreneurship at the Rotman School of Management. He is also chief economist of the University of Toronto’s Creative Destruction Lab. Gans wrote The Disruption Dilemma, Information Wants to be Shared, and several other books.Editor Sarah Kaplan, Director of the Institute for Gender and the Economy at the Rotman School of Management, is also Distinguished Professor of Gender and the Economy and a professor of Strategic Management at Rotman. She co-wrote the business bestseller Creative Destruction.",
  "genres": [
    "Business"
  ],
  "author": "Joshua Gans",
  "average_rating": "4.33",
  "url": "https://www.goodreads.com/book/show/36254937-survive-and-thrive"
}