{
  "title": "Safe and Sound",
  "description": "I've been drowning for a long time. I never thought I'd find someone who knows what that's like...Self-proclaimed playboy, Aiden Vale, has it all - good looks, successful career, plenty of cash in the bank and an endless supply of men who know the score... that one night is just that. So the last thing he wants, or needs, is to forge a connection that might mean revealing more of himself than he's ready to. But when fate intervenes, putting Aiden in the path of someone who threatens to knock down his carefully constructed walls, he's quick to realize the young man he's become infatuated with is hiding a painful secret.I finally have a shot at freedom. I'll never let anyone take that from me ever again...Ash Valentine is just looking for a way out, and the last thing he wants or needs is another man controlling every aspect of his life. Desperate for the cash that will help him flee his abusive boyfriend, Ash accepts what is supposed to be a temporary job at a local coffee shop. But nothing prepares him for the gorgeous and enigmatic Aiden Vale, and the small acts of kindness the charming coffee shop regular bestows on him or the new friends he begins to make along the way. Terrified of once again becoming too reliant on someone else to take care of him, Ash refuses Aiden's repeated offers of help in any form. But when it becomes clear that there's something more behind Aiden's need to save him, Ash begins to wonder if he's found someone who needs saving just as badly.I know he wants to save me, but what if he's the one who needs saving...As their tentative friendship turns into something more, long buried secrets begin to surface. When Aiden's need to protect Ash clashes with the younger man's desire for independence, memories of the one he couldn't save begin to tear at the fragile cords of Aiden's soul, and he's forced to face a truth he's been hiding from for a long time. Threatened with losing what they've only just found, will Aiden and Ash find a way to accept their pasts or will they let the pain drag them below the surface for good?No cliffhangers and can be read as a stand-alone.*** TRIGGER WARNING - includes on-page scenes of domestic abuse, including rape and intense violence. ***",
  "genres": [
    "M M Romance",
    "Romance",
    "Contemporary",
    "Abuse",
    "LGBT",
    "Audiobook",
    "Gay"
  ],
  "author": "Lucy Lennox",
  "average_rating": "4.33",
  "url": "https://www.goodreads.com/book/show/36262701-safe-and-sound"
}