{
  "title": "All for Connor",
  "description": "Connor is the wrongest wrong guy in existence.He’s a Lycan shifter, for one.And he’s rude, anti-social and has never said a kind word to Evie.Yet, there’s something about him she can’t resist.Maybe it’s the brooding, bad boy vibe.Her feet say run away.But her heart says stay.Evie is sweet and kind.He doesn’t deserve her.And he should focus on one Revenge.Kill the people who broke his wolf.But everything about Evie is like a siren’s call.And he’ll stop at nothing to protect her.Even from himself.A heart-racing paranormal romance from Alicia Montgomery.Download it today!Book Evie’s been denying her attraction to her brooding boss for months. He’s rude, anti-social, and has never said a kind word to her. He’s also a Lycan shifter, which makes him the wrongest wrong guy in existence. Yet, there’s something about Connor she can’t resist.Lone Wolf Connor is in a desperate situation. Ever since the death of his mentor, the animal inside won’t stop ripping him apart and trying to take over. There’s only one way to stop Lycans who’ve lost death. Before that happens, he’s going to seek revenge on the very people who have turned him into a monster. However, he can’t stop thinking about the sweet and fresh-faced admin assistant who seems to have attracted this wolf’s attention. Evie only has to see the out-of-control beast inside him, and she’ll run away.When Evie’s life is put in danger, Connor finds himself in a position to keep her safe. But, can he resist the powerful attraction and desire between them? Or will Evie be a distraction from his revenge and weakness that his enemies could exploit?All for Connor is a paranormal romance novel with over 65k words. It's a standalone novel with HEA, hot and sexy scenes, Lycan action and no cheating. It takes place in the True Mates Universe but works as a standalone novel.",
  "genres": [
    "Paranormal",
    "Romance",
    "Shapeshifters",
    "Paranormal Romance",
    "Fiction",
    "Contemporary",
    "Fantasy"
  ],
  "author": "Alicia Montgomery",
  "average_rating": "4.60",
  "url": "https://www.goodreads.com/book/show/36271530-all-for-connor"
}