{
  "title": "ثلاثة أسابيع مع أخي",
  "description": "الناشر:مؤثرة وآسرة على نحو عاطفي كأعماله الأدبية العالمية الأخرى هي مذكرات نيكولاس سباركس الفريدة التي كتبها مع شقيقه ميكا. وهي تؤرِّخ كُلاً من رحلتين: إحداهما هي مغامرة مدهشة حول العالم، والأخرى هي رحلة داخلية تثبّت وسائج الحياة. فاجتمع الشقيقان معاً تربطهما ذكرياتٌ مرحة ومأساوية في آنٍ معاً ليداويا نفسيهما وليتذكرا وليتعلما أن يعيشا الحياة إلى أقصى الحدود. كان اليومُ الذي وصلت فيه النشرة السياحية نهاراً نموذجياً. فمع زوجة وخمسة أطفال صغار، كان البرنامج محموماً. ومع كتاب مطلوب تسليمه للناشرين، كان نيكولاس سباركس مشغولاً في روتينه المعتاد. ومع ذلك، فقد وصفَت النشرة السياحية شيئاً مختلفاً كل الاختلاف: رحلة إلى بعض أكثر الأماكن إثارة على وجه الأرض. وببطء، استولت الفكرة على عقل نيكولاس وقلبه. في شهر كانو الثاني/يناير عام 2003، شرع نيكولاس سباركس وشقيقه ميكا في رحلة مدّتها ثلاثة أسابيع حول العالم. والتي أصبحت علامة مميزة وهامة في حياتهما، لأنهما بسن السابعة والثلاثين والثامنة والثلاثين على التوالي، كان الفردين الوحيدين الباقيين على قيد الحياة من عائلتهما. فبينما كان يرتحلان إلى مدينة ماتشو بيكتشو المفقودة في أعالي جبال الأنديز... وإلى جزيرة إيستر آيلند الغامضة... وإلى صخرة أيرز روك في القفر الأسترالي... وعبر شبه القارة الهندية الواسعة، تكشّفت التفاصيل الحميمة لقصة حياتهما. فعلى خلفية عجائب العالم وعبر مشاعرهما المثارة، استعاد ميكا المتهور ونيكولاس الأكثر جدية واستبطاناً مغامرات طفولتهما القاسية والمآسي التي امتحنت إيمانهما. وفي أثناء ذلك، اكتشفا حقائق مدهشة عن الفقدان والحب والأمل. بأسلوبها السردي الذي يتميّز بصدق نادر وحسٍّ فكاهي يتعذر كبحه، وباحتوائها على صور فوتوغرافية شخصية، تؤكد لنا رواية \"ثلاثة أسابيع مع أخي\" على ضرورة تقبّل الحياة بكل تقلباتها... وأكثر من كل شيء، أن نحفظ في أذهاننا الأوقات السعيدة القصيرة والهامة في آن واحد، والأشخاص الرائعين الذين جعلوها ممكنة.",
  "genres": [
    "Nonfiction",
    "Memoir",
    "Biography",
    "Travel",
    "Romance",
    "Book Club",
    "Biography Memoir"
  ],
  "author": "Nicholas Sparks",
  "average_rating": "4.04",
  "url": "https://www.goodreads.com/book/show/3627558"
}