{
  "title": "GOD, HONOR, FATHERLAND: A Photo History of Panzergrenadier Division \"Grossdeutschland\" on the Eastern Front 1942-1944",
  "description": "Panzergrenadier Division \"Grossdeutschland\" was one of Germany's most celebrated military formations of the Second World War. Formed in 1942 by the expansion of Infantry Regiment (motorized) \"Grossdeutschland,\" the new division quickly earned its reputation on the Eastern Front of being the elite of the German Army. Twice the size of most other divisions, it was an immensely powerful and hard-hitting mechanized formation that cut a large swath through the Red Army, whether in the attack or on the defense. Its carefully selected officer and non-commissioned officer corps ensured that no matter what the odds, the division would always give a good account of itself in battle and would possess an esprit de corps enjoyed by few other comparable divisions, including those of the Waffen-SS.The thousands of volunteers from every land and province in Germany who fought and died while serving in the ranks of Panzergrenadier Division \"Grossdeutschland\" represented a cross-section of German society, a radical departure from the manner in which most German divisions of the era were created. Now for the first time, the faces of these men, at rest and in battle, can be seen through the images gleaned from hundreds of photographs taken by the division's war correspondents or Kriegsberichter.This outstanding selection of photographs, which until recently remained unseen for decades in a European archive, have been recovered and painstakingly researched by authors Remy Spezzano and Thomas McGuirl. Together with the assistance of the division's Veterans' association, they identified hundreds of men, living and dead, as well as dozens of combat vehicles, items of equipment, and specific engagements the division took part in from April 1942 to September 1944. Accompanied by a detailed narrative that ties each of the photos within the context of the war on the Eastern Front, \"God, Honor, Fatherland\" represents a milestone in the study of the war in the East and shows the face of the German soldier as he has never been shown before.",
  "genres": [
    "World War II",
    "Military Fiction"
  ],
  "author": "Thomas McGuirl",
  "average_rating": "4.58",
  "url": "https://www.goodreads.com/book/show/362669.GOD_HONOR_FATHERLAND"
}