{
  "title": "Blue Sun",
  "description": "Alice and Don Harriman are the owners of Blue Sun, the largest residential real estate and construction service in the Pacific Northwest. When a house cleaner stumbles upon two masked men holding Don Harriman at gunpoint in his own bedroom, she is able to flee the scene before being captured. Outside, neighbors from this quiet, affluent, suburban neighborhood respond to her screams for help. They patiently listen as she frantically tells her harrowing tale. Two of the neighbors bravely venture inside the Harriman house to investigate. They find nothing, no men, no body, and no sign of a struggle. The police investigation supports their findings. There is no physical evidence to substantiate the house cleaner’s claim. It is only later, when Don Harriman’s beaten body is found floating in the Willamette River, that the house cleaner is believed.Homicide Detective Destini Pendleton is assigned the Harriman case. During her preliminary investigation, she discovers the victim contacted ex-DEA agent, tri-ethnic private investigator, C. J. Cavanaugh on the day he was abducted. C. J. admits to having received a peculiar text message around that time. The problem is, he doesn’t know Don Harriman and has no idea what the text message means. C. J.’s curiosity is piqued by this mystery and the opportunity to capture a murderer. He offers his services pro bono to Destini to help solve the crime. Due to an extra-heavy caseload, Detective Pendleton categorically accepts his offer provided C. J. keeps her fully informed and operates within the boundaries of the law. Aside from a few inconsequential discrepancies from the last portion of their agreement, C. J. manages to maintain his side of the bargain.For the Cavanaugh investigation team, what began as a couple of minor events sets off a shockwave of discoveries that lead to intrigue, narcotics trafficking, violence and murder.",
  "genres": [],
  "author": "Michael R.  Lane",
  "average_rating": "4.35",
  "url": "https://www.goodreads.com/book/show/36283351-blue-sun"
}