{
  "title": "The Story of the Earth in 25 Rocks: Tales of Important Geological Puzzles and the People Who Solved Them",
  "description": "Every rock is a tangible trace of the earth’s past. In The Story of the Earth in 25 Rocks, Donald R. Prothero tells the fascinating stories behind the discoveries that shook the foundations of geology. In twenty-five chapters—each about a particular rock, outcrop, or geologic phenomenon—Prothero recounts the scientific detective work that took us from the unearthing of exemplary specimens to tectonic shifts in how we view our planet and history.Prothero follows in the footsteps of the scientists who asked—and answered—geology’s biggest questions: How do we know how old the earth is? What happened to the supercontinent Pangea? How did ocean rocks end up at the top of Mount Everest? What can we learn about our planet from meteorites and moon rocks? The Story of the Earth in 25 Rocks answers these questions through expertly chosen case studies, such as Pliny the Elder’s firsthand account of the eruption of Vesuvius; the granite outcrops that led a Scottish scientist to theorize that the landscapes he witnessed were far older than Noah’s Flood; the gypsum deposits under the Mediterranean Sea that indicate that it was once a desert; and how trying to date the age of meteorites revealed the dangers of lead poisoning. Each of these breakthroughs filled in a piece of the puzzle that is the earth, with scientific discoveries dovetailing with each other to offer increasingly solid evidence of the geologic past. Summarizing a wealth of information in an entertaining, approachable style, The Story of the Earth in 25 Rocks is essential reading for the armchair geologist, the rock hound, and all who are curious about the earth beneath their feet.",
  "genres": [
    "Science",
    "Geology",
    "Nonfiction",
    "History",
    "Nature",
    "Science Nature",
    "Audiobook"
  ],
  "author": "Donald R. Prothero",
  "average_rating": "4.20",
  "url": "https://www.goodreads.com/book/show/36286363-the-story-of-the-earth-in-25-rocks"
}