{
  "title": "Prairie Fires: The American Dreams of Laura Ingalls Wilder",
  "description": "Millions of readers of the 'Little House' books believe they know Laura Ingalls Wilder - the pioneer girl who survived blizzards and near-starvation on the Great Plains as her family chased their American dream. But the true story of her life has never been fully told.Drawing on unpublished manuscripts, letters, diaries and public records, Caroline Fraser masterfully fills in the gaps in Wilder's biography, uncovering the grown-up story behind the best-loved childhood epic of pioneer life.Set against nearly a century of unimaginable change, from the Homestead Act and the Indian Wars to the Dust Bowl and the Great Depression, Wilder's life was full of drama and adversity. Settling on the frontier amid land-rush speculation, her family endured Biblical tribulations of locusts and drought, poverty and want, before she left at the age of eighteen to marry Almanzo. This is where the books end, but there is so much more to tell; deep in debt after a series of personal tragedies, Laura and Almanzo uprooted themselves once again, crisscrossing the country, taking menial jobs to support the family. In middle age, she began writing a farm advice column, prodded by her journalist daughter Rose. And at the age of sixty, fearing the loss of almost everything in the Depression, she turned to children's books, recasting her extraordinarily difficult childhood as a triumphal vision of homesteading - achieving fame and fortune in the process. Laura Ingalls Wilder's life is one of the most astonishing rags-to-riches stories in American letters. Offering fresh insight and new discoveries, Prairie Fires reveals the complex woman who defined the American pioneer character, and whose artful blend of fact and fiction grips us to this day.",
  "genres": [
    "Nonfiction",
    "Biography",
    "History",
    "Biography Memoir",
    "Audiobook",
    "Historical",
    "Book Club"
  ],
  "author": "Caroline Fraser",
  "average_rating": "3.94",
  "url": "https://www.goodreads.com/book/show/36291393-prairie-fires"
}