{
  "title": "21 Days to Happiness",
  "description": "Struggling to find work-life balance? Whether you’re feeling overwhelmed and frustrated or just want to increase your happiness, you can learn how in just 10 minutes a day!For some of us, feeling busy or stressed has become the new normal. Others feel okay, but just want a boost to productivity, energy and motivation.Instead of hoping for happiness, what if happiness is something you DO, something you CHOOSE every day? The good news: it is and the solutions are simple.Psychologist and happiness expert Ingrid Kelada provides a practical, step-by-step guide to help you increase your personal happiness and feel more motivated. You can learn how with simple 10-minute strategies. Each day of the 21-day journey focuses on one key area of your life, including:•\tTime: how to break the cycle of chaos and manage your time effectively.•\tBody Language: exploring the surprising links between body language and happiness.•\tRelationships: how to make the most of the number one predictor of happiness.•\tWork: how to use your strengths and talents so that you are engaged and motivated.•\tMoney: what you should spend your money on to feel most satisfied.The book is interactive. Each chapter features resources like apps to try, videos to watch for deeper understanding, or tools to help you master these new habits. At the end of three weeks, along with increased happiness, you’ll find you’ve become more:•\tproductive•\tfocused•\tpatient•\tenergetic•\thealthy•\tmotivated•\tpositiveHappiness is a choice. A daily decision to choose happy can be easy, fun and rewarding. With this book, in just a few minutes per day, you can practice one new happiness habit, add resources to your arsenal, and jot down your notes in the journal section.Buy 21 Days to Happiness today to create a happier more satisfying life.",
  "genres": [
    "Self Help",
    "Nonfiction"
  ],
  "author": "Ingrid Kelada",
  "average_rating": "4.52",
  "url": "https://www.goodreads.com/book/show/36301302-21-days-to-happiness"
}