{
  "title": "Nine Short Chapter Books",
  "description": "In this collection of short chapter books by Gita V. Reddy, the chapters are short and the word count of each book is between 5,000 and 7,000 words. The book also introduces young readers to different genres.For intermediate readers, ages 8–12.The Homeless Birds (Fantasy):A young bird is left behind by his flock. Unable to fly by direction, he takes the help of a boy, and shares with him the plight of his flock.The Magician's Turban (Magic):Magic is no bag of tricks, discover two boys after they are trapped in the magician's turban.Knife and Fork (Fable):A monkey spends some time in the city. When he returns to the forest, he is a changed monkey—but not for the better.Daksha the Medicine Girl (Geography and Culture):A Himalayan girl who has knowledge of herbal medicine refuses to live away from her hamlet and study in a school. Until a resourceful doctor finds a way.Make a Wish (Fairy Tale):Niki had only one wish: to meet a fairy. It comes true and now the fairy wants to grant Niki a wish. What should niki wish for?Krishta, Daughter of Martev (Science Fiction):Krishta of Planet Ayzeon is a poor student. She comes to Earth to understand the basics of science and becomes friends with a student working in a lab. All goes well until Ikor from her planet wants revenge.The Forbidden Forest (Action and Adventure):The animals are mysteriously straying out of their habitat. A factory that is shut is working secretly. Are the two connected? Abhi and his cousins find out.Dearie (Animal Story):Everything scares Dearie. When his fear becomes a thread to the herd, he is made to leave. If Dearie must stay survive, he must learn to conquer fear.The Missing Girl (General Fiction):Sneha goes missing. The presence of strange car points to a kidnap. But Sneha is having an adventure—an adventure of a different kind.",
  "genres": [],
  "author": "Gita V. Reddy",
  "average_rating": "4.62",
  "url": "https://www.goodreads.com/book/show/36293803-nine-short-chapter-books"
}