{
  "title": "Lost Legio IX",
  "description": "Bestselling, award-winning author of STIGERS TIGERS, Marc Alan Edelheit, delivers a new action-packed fantasy epic filled with gods and magic.  One of history’s greatest mysteries, the Ninth Imperial Legion guarding Rome’s northernmost frontier in Britannia disappeared around the year 122 AD. This is their story.  Badly outnumbered, facing certain destruction, and cut off from supply, the Imperial Roman Ninth Legion Hispana is in a desperate position. Surrounded by the hostile Celtic army, Senior Centurion Lucious Grackus Lisidus Karus must lead his men to safety after unexpectedly finding himself thrust into command of the legion.  Then the unthinkable happens.  Karus and the Ninth are transported to a strange place, far away from the Britannia they knew. The legion’s deliverance from danger at first appears to be a blessing from the gods, but slowly they begin to uncover the secrets of this new land, a world that is slowly being overrun by a terrible evil.  A young woman is discovered in a dungeon, where she has been abandoned and left to starve. Inextricably linked with Karus’ own destiny, she may be the key to salvation, or worse, the instrument of destruction for the Ninth.  Cast adrift in a terrible war, Karus must find his way through the mysteries of this unfamiliar world, one that is filled with true magic, strange alien races, evil gods, and dragons. More importantly, Karus must discover his destiny, and complete a desperate task set for him by a god of Rome. Should he fail, it will mean certain destruction for the Ninth, the triumph of evil, and the rise of a new order.  Lost Legio IX is the first book in this exciting series.  ‘For these I set no bounds in space or time; but have given empire without end.’ —Jupiter, Virgil’s Aeneid.",
  "genres": [
    "Fantasy",
    "Historical Fiction",
    "Fiction",
    "Alternate History",
    "Audiobook",
    "Military Fiction",
    "Historical"
  ],
  "author": "Marc Alan Edelheit",
  "average_rating": "4.50",
  "url": "https://www.goodreads.com/book/show/36302745-lost-legio-ix"
}