{
  "title": "American Islamophobia: Understanding the Roots and Rise of Fear",
  "description": "On Forbes list of \"10 Books To Help You Foster A More Diverse And Inclusive Workplace\"How law, policy, and official state rhetoric have fueled the resurgence of Islamophobia—with a call to action on how to combat it.“I remember the four words that repeatedly scrolled across my mind after the first plane crashed into the World Trade Center in New York City. ‘Please don’t be Muslims, please don’t be Muslims.’ The four words I whispered to myself on 9/11 reverberated through the mind of every Muslim American that day and every day after.… Our fear, and the collective breath or brace for the hateful backlash that ensued, symbolize the existential tightrope that defines Muslim American identity today.” The term “Islamophobia” may be fairly new, but irrational fear and hatred of Islam and Muslims is anything but. Though many speak of Islamophobia’s roots in racism, have we considered how anti-Muslim rhetoric is rooted in our legal system? Using his unique lens as a critical race theorist and law professor, Khaled A. Beydoun captures the many ways in which law, policy, and official state rhetoric have fueled the frightening resurgence of Islamophobia in the United States. Beydoun charts its long and terrible history, from the plight of enslaved African Muslims in the antebellum South and the laws prohibiting Muslim immigrants from becoming citizens to the ways the war on terror assigns blame for any terrorist act to Islam and the myriad trials Muslim Americans face in the Trump era. He passionately argues that by failing to frame Islamophobia as a system of bigotry endorsed and emboldened by law and carried out by government actors, U.S. society ignores the injury it inflicts on both Muslims and non-Muslims. Through the stories of Muslim Americans who have experienced Islamophobia across various racial, ethnic, and socioeconomic lines, Beydoun shares how U.S. laws shatter lives, whether directly or inadvertently. And with an eye toward benefiting society as a whole, he recommends ways for Muslim Americans and their allies to build coalitions with other groups. Like no book before it, American Islamophobia offers a robust and genuine portrait of Muslim America then and now.",
  "genres": [
    "Nonfiction",
    "History",
    "Politics",
    "Religion",
    "Islam",
    "Race",
    "Social Justice"
  ],
  "author": "Khaled A. Beydoun",
  "average_rating": "4.27",
  "url": "https://www.goodreads.com/book/show/36297045-american-islamophobia"
}