{
  "title": "The Unexpected: Tales of Lust, Love & Longing",
  "description": "From award-winning writer R. R. Ennis: a collection of nineteen tales about characters whose personal desires and notions of romantic fulfillment take them on journeys of self-discovery, often leading to unforeseen outcomes. In the opening story “Fairway to Love,” a middle-aged woman, disgruntled with her husband and their sex life, realizes how someone from their past can offer hope for the future. In “Victory House,” a husband who’s entrusted his alcoholic wife to the care of a secluded treatment facility visits the establishment and unearths a cover-up that causes him to regret his decision. In “Old Friends,” a narrative told in the form of e-mails, a young woman’s quest for love reveals a risky pattern of behavior that only an old friend can see and help her end. In the novella-length “Close Encounters of the Male Kind,” Annette is saddled with a less ambitious mother and a sister with a penchant for choosing the wrong guys. Needing a diversion, Annette tries hard to be noticed by Kenneth, the handsome young man in her literature class. Entering the picture is another fellow, cruising the streets of her neighborhood in a sporty white sedan, who appears too concerned about her safety. Annette’s search for attention and affection draws her into a situation she never imagined. Lorna, Annette’s sister, turns up as the main protagonist in another story, “In a Violent World,” as an abused wife attracting teenage neighbor Miles’s sympathy and interference. Will Lorna view Miles as her savior—or her enemy? Unlike Lorna, Gunnar in the title story, “The Unexpected,” seemingly has learned from his mistakes and now demonstrates good judgment when it comes to sex, dating, and relationships. Nevertheless, problems abound when Gunnar is accosted by two different women during a combined business trip/mid-week getaway.Ennis is a writer who finds the drama in everyday life, focusing on people you see on the street all the time—your friends, your neighbors, yourselves. Start a story, any story, in this volume, and you’ll recognize the characters—their needs and longings—and be compelled to read the story through to its conclusion. You’ll want to see what happens to these people, and you’ll enjoy the artful way they are put through their paces.",
  "genres": [],
  "author": "R.R. Ennis",
  "average_rating": "0.00",
  "url": "https://www.goodreads.com/book/show/36296618-the-unexpected"
}