{
  "title": "A Little Bit Wicked: Life, Love, and Faith in Stages",
  "description": "\"Life's too short. I'm not.\"You might know her as a Tony Award-winning Broadway star, who originated the role of Galinda the Good Witch in the smash musical Wicked and won a Tony for 1999's You're a Good Man, Charlie Brown. Or you may recognize her from her starring roles on TV—The West Wing, Pushing Daisies, Sesame Street...oh, and her Huge Hit Sitcom Kristin on NBC. (Huge hit. L.A. breast-implant huge. Ask either of the people who watched it.) Or maybe you saw her sexy spread in FHM magazine? Or her appearance on Pat Robertson's The 700 Club? Kristin is a wonderful collection of contradictions—but everyone who's ever met her remembers her as the little girl with the big voice. At four foot eleven, Kristin Chenoweth is an immense talent in a petite but powerful package.In this lively, laugh-out-loud book, Kristin shares her journey from Oklahoma beauty queen to Broadway leading lady, reflecting on how faith and family have kept her grounded in the dysfunctional rodeo of show biz. The daughter of an engineer and a nurse, Kristin was singing in front of thousands at Baptist conventions by age twelve and winning beauty pageants by age twenty-two. (Well, actually she was second runner-up almost every freaking time. But, hey, she's not bitter.) On her way to a career as a professional opera singer, she stopped in New York to visit a friend and went on a whim to an audition. Through a combination of talent, hard work, and (she's quick to add) the grace of God, Kristin took Broadway by storm. But of course, into every storm, the occasional drizzle of disaster must fall.Filled with wit, wisdom, and backstage insight, A Little Bit Wicked is long on love and short on sleep; it's essential reading for Kristin's legions of fans and an uplifting story for anyone seeking motivation to follow his or her dreams—over the rainbow and beyond.",
  "genres": [
    "Nonfiction",
    "Memoir",
    "Biography",
    "Audiobook",
    "Biography Memoir",
    "Autobiography",
    "Humor"
  ],
  "author": "Kristin Chenoweth",
  "average_rating": "3.84",
  "url": "https://www.goodreads.com/book/show/3629944-a-little-bit-wicked"
}