{
  "title": "Evil Incarnate: Rumors of Demonic Conspiracy and Satanic Abuse in History",
  "description": "In the 1980s, America was gripped by widespread panics about Satanic cults. Conspiracy theories abounded about groups who were allegedly abusing children in day-care centers, impregnating girls for infant sacrifice, brainwashing adults, and even controlling the highest levels of government. As historian of religions David Frankfurter listened to these sinister theories, it occurred to him how strikingly similar they were to those that swept parts of the early Christian world, early modern Europe, and postcolonial Africa. He began to investigate the social and psychological patterns that give rise to these myths. Thus was born Evil Incarnate , a riveting analysis of the mythology of evilconspiracy.The first work to provide an in-depth analysis of the topic, the book uses anthropology, the history of religion, sociology, and psychoanalytic theory, to answer the questions \"What causes people collectively to envision evil and seek to exterminate it?\" and \"Why does the representation of evil recur in such typical patterns?\"Frankfurter guides the reader through such diverse subjects as witch-hunting, the origins of demonology, cannibalism, and the rumors of Jewish ritual murder, demonstrating how societies have long expanded upon their fears of such atrocities to address a collective anxiety. Thus, he maintains, panics over modern-day infant sacrifice are really not so different from rumors about early Christians engaging in infant feasts during the second and third centuries in Rome.In Evil Incarnate , Frankfurter deepens historical awareness that stories of Satanic atrocities are both inventions of the mind and perennial phenomena, not authentic criminal events. True evil, as he so artfully demonstrates, is not something organized and corrupting, but rather a social construction that inspires people to brutal acts in the name of moral order.",
  "genres": [
    "History",
    "Nonfiction",
    "Religion",
    "Occult",
    "American History",
    "Politics"
  ],
  "author": "David Frankfurter",
  "average_rating": "3.63",
  "url": "https://www.goodreads.com/book/show/362954.Evil_Incarnate"
}