{
  "title": "Space Girls Are Easy",
  "description": "Scout Lieutenant Shaydra den'Kurona was trying to escape the stifling responsibilities of her homeworld. But a quick stop on an out-of-the way planet brought her face-to-face with her own desires.Mark Paxton was stuck in a dead-end job in a small town. But one night a starship landed next to him. Now a sexy alien is living with him. One magic night he will find out that Space Girls Are Easy!~ PG Excerpt ~They didn’t quite fall into each others’ arms when the door to his bedroom closed behind them. It was more like a mutual tackle; fierce and almost violent. Shayla climbed him like a tree, her arms wrapping around his neck, and she kissed him, kissed him hard, her tongue forcing itself between his lips and searching his out. When they met, it was as if a jolt of electricity coursed through their paired bodies. He groaned, opening his mouth wide, his hands clutching the curves of her rear.“The bed,” he panted. “On the bed. If we keep this up, we’ll fall down, and I’ll be damned if I make love to you on a hardwood floor.”He staggered over to the bed and fell backwards onto it, cushioning her fall with his body. For a second she simply lay on his chest, enjoying the feel of his strong body under hers. But after a moment she slithered higher, then sat up on her heels. Catching his eye, she raised her hands to the shirt-cord, tied in a low knot just above her breasts. Moving slowly, she undid the knot, then pulled the cord out of the lace-holes, one at a time, until her shirt was hanging open, barely hiding her chest.As she teased him, he put his hands on her hips, his thumbs stroking the flat planes of her stomach. When the garment was finally undone, she slipped it off, eyes shining with pride as she watched his face change.His hand curved up her back, then settled bare inches away from her breast. She swallowed at the heat of his touch.“Don’t your people wear bras?”“A what? A bra?” She shook her head. “I am unfamiliar with this word.”“It’s a…a garment, worn across the chest, under the shirt. It’s used to support the breasts.”“Support them? Why?” He saw her eyes narrow dangerously. “Do you think my breasts need to be supported, Earthman?”“God, no. But women,” he flushed, realizing he was babbling like an idiot, “women here on Earth wear them because eventually their breasts might get saggy. As they get older.” He tried to smile winningly up at her. “I bet you wouldn’t like that.”She said loftily. “My body would never allow that. Not with genetic bodysculpting. I was personally declared clean of over five thousand potential defects in my genome following my conception. My breasts,” she said, bouncing just enough to make them wobble enticingly, “will stay their current shape for the rest of my life. Unless I choose to modify them in some way.”Mark swallowed. It suddenly came clear to him just how far in advance of his own planet Shayla’s technology was. Bodysculpting? It sounded like something out of a sci-fi novel. He glanced down at his own body. Did he disgust her? Despite her claims to love him, despite the supposed lifemating, would she recoil when he was naked in front of her?She caught his look, and the thought behind it. She leaned down, her face tender. “You are not inferior,” she said softly. She drew her finger down from his cheek to his lips, tracing their lines lovingly. “Not in any way. I know it, in my heart. Just because your people did not have the advantages of mine does not mean you are somehow defective.“We will take you back to my ship,” she continued. “A short time in the autodoc and we will have a complete gene-scan. And you will see, beloved, that you are worthy to be my lifemate.“Now will you please love me as I need?”",
  "genres": [
    "Erotica"
  ],
  "author": "Alana Church",
  "average_rating": "4.50",
  "url": "https://www.goodreads.com/book/show/36302112-space-girls-are-easy"
}