{
  "title": "Satyr's Son",
  "description": "Lucinda Brant brings the Georgian era to life as no one else can! —Cynthia Wright, New York Times bestselling authorRoxton Family Saga Book 5: Henri-Antoine and Lisa’s Happily Ever AfterLondon, 1786. Lord Henri-Antoine has returned from the Grand Tour to a life of privilege and excess. A vast inheritance allows him every indulgence, free from responsibility. Yet, Henri-Antoine maintains a well-ordered existence, going to great lengths to conceal an affliction few understand and many fear.Miss Lisa Crisp is a penniless orphan who relies on the charity of relatives to keep her from the poorhouse. Intelligent and unflappable, Lisa will not allow poverty to define her. She leads a useful life working among the sick poor.Under startling circumstances, Henri-Antoine and Lisa meet. There is instant attraction. When they find themselves attending the same wedding in the country, Henri-Antoine offers Lisa a scandalous proposition, one she should refuse but yearns to accept. Following her heart could ruin them both.A standalone romantic adventure set against the backdrop of Treat, ancestral home of the dukes of Roxton. SATYR’S SON will delight fans of the series with cameos by many beloved characters, while new readers will discover the myriad pleasures and glittering aristocratic world of the Roxton family through the fresh eyes of newcomer Lisa Crisp. SATYR’S SON is a Cinderella story with a heartwarming Happily Ever After.“A great plot, fast-paced and intricately woven with surprises. The setting has great historical references, well-imagined and written with mastery. The glowing moments of tenderness were the best part of this novel for me and I loved the crisp and powerful writing. This one is a masterpiece, a delightful read in its genre.” —Divine Zape, 5 STARS Readers’ Favorite advance review“Just when you couldn’t imagine Lucinda Brant upstaging her previous, wondrous tales that star the Roxton family and friends, out comes SATYR'S SON, one of the best Cinderella stories ever. All books in this series easily stand alone but for those fortunate to read all the Roxton tales it will be like a homecoming of sorts. Reading and reviewing SATYR'S SON, was an absolute joy. Any fan of historical romance just has to read this book. Totally addictive and marvelous.” —SWurman, 5 STAR REVIEWER TOP PICK Night Owl Reviews advance reviewCharacter-driven romantic adventureNon explicit (mild sensuality)Story length 144,000 words (not including bonus material)The Roxton Family comes to life in audiobook, featuring the irresistible \"smooth as melted chocolate\" voice of award-winning, RADA-trained British actor Alex WyndhamConnecting BooksMany readers enjoy Lucinda Brant's books as part of a wider series since her characters inhabit the same meticulously-researched 18th Century world with people and events cross-referenced throughout. Should you wish to read each series in chronological order, here is the Roxton Family Saga1740s NOBLE SATYR (Renard and Antonia)1760s MIDNIGHT MARRIAGE (Julian and Deb)1770s AUTUMN DUCHESS (Antonia and Jonathon)1770s DAIR DEVIL (Dair and Rory)1770s PROUD MARY (Mary and Christopher)1780s SATYR’S SON (Henri-Antoine and Lisa)ETERNALLY Roxton Letters Volume OneFOREVER Roxton Letters Volume Two—In progressSalt Hendon Series1763 SALT BRIDE (Magnus and Jane)1767 SALT REDUX (Antony and Caroline)SALT HENDON COLLECTION — boxed set with bonus novella SALT ANGELAlec Halsey MysteriesSpring 1763 DEADLY ENGAGEMENT (Country house murder and mayhem)Autumn 1763 DEADLY AFFAIR (A poisoned vicar and the mysterious Miranda)Winter 1763 DEADLY PERIL (Bloody intrigue abroad)Summer 1764 DEADLY KIN (Evil lurks in Edinburgh) In progress",
  "genres": [
    "Historical Romance",
    "Historical",
    "Romance",
    "Historical Fiction",
    "Audiobook",
    "Georgian",
    "Fiction"
  ],
  "author": "Lucinda Brant",
  "average_rating": "4.43",
  "url": "https://www.goodreads.com/book/show/36298541-satyr-s-son"
}