{
  "title": "An Angel in Flames",
  "description": "On a freezing cold morning under the gaze of a glacial Mount Kenya, a young woman is walking home through a landscape shrouded in fog and frost. Her eye is drawn to a volt of vultures stalking a pit of fire and ash. She runs towards them to scare them off. That’s when she sees what they’ve been pecking at. It is the badly burnt and mutilated body of her father. She falls to the ground, her knees sinking into grass, ash and mud, her mouth gaping in a silent scream. Above, the flock of vultures hiss at her, swaying in the icy wind rushing down the snow-capped peaks.‘An Angel in Flames’ is set in Kenya’s Laikipia Plateau. One of the most fascinating places in the world. Where billionaire cowboys and Maasai herdsmen mingle alongside British Royalty and Kenya Air Force pilots.Stretching from Mount Kenya in the east to the Rift Valley in the west, this extensive natural paradise is blessed with stunning flora and fauna. Its deep jade forests and golden savannahs overflow with lions, giraffes, rhinos, antelopes and elephants. It is also home to private ranches, working farms, wildlife sanctuaries, spas and luxury resorts that attract the rich, ambitious and famous.From the legendary Mount Kenya Safari Club, that was a preserve of Ernest Hemingway, Frank Sinatra and Ava Gardner to the 67,000-acre Ol Jogi Ranch, playground of the famous Wildensteins of New York and the Craig Family’s Lewa Downs private conservancy that has hosted Britain’s Prince William, this magnificent landscape draws many to its natural beauty. Yet it carries the scars of over-farmed land, drought-affected tribes people, the lure of political intrigue and now murder.The grotesque slaying of Kenya’s former chief of police and one of the country’s most notorious political leaders triggers a series of shockwaves that reverberate to the very top of the government, setting into motion a cascade of fear, dread and intrigue.His death revives old nightmares for Chief Inspector Ange Mutua who is overseeing the investigation. The last thing Ange needs is the murder of a notoriously infamous man in her backyard. One that resurrects old nightmares she’d long forgotten. Duncan is not your run of the mill victim; he was the country’s former chief of police. He was also once a friend of Ange’s father. A man she blames for her father’s death.While her fellow police officers are quick to lay the blame on his money hungry girlfriend, the last person to see Duncan alive but also conducting an affair with his head of security, Ange has her doubts.She's soon drawn into an intricate web of political cover-ups and run-ins with her own corrupt police bosses as she unearths long-buried mysteries from her own past and that of a secretive group of powerful individuals that held Kenya to ransom for many years. Amid the flower farms of Laikipia, the five star luxury wildlife resorts and under the long gaze of Mount Kenya, she must separate fact from fiction and find a vicious murderer while being pulled into a very personal fight for her life, her career and her values.An Angel in Flames gives readers an atmospheric taste of Africa’s beauty and takes them on a journey into its dark side. Where courageous men and women grapple with corrupt leaders and high stakes for the sake of peace and justice for all.Readers will be riveted to the last page as the shocking identity of the murderer is laid bare and at last his gruesome mission revealed.",
  "genres": [],
  "author": "N.K. Read",
  "average_rating": "3.33",
  "url": "https://www.goodreads.com/book/show/36299451-an-angel-in-flames"
}