{
  "title": "My Girls: A Lifetime with Carrie and Debbie",
  "description": "A revelatory and touching tribute to the lives of Carrie Fisher and Debbie Reynolds written by the person who knew them best, Todd Fisher’s poignant memoir is filled with moving stories of growing up among Hollywood royalty and illustrated with never-before-seen photos and memorabilia.In December 2016, the world was shaken by the sudden deaths of Carrie Fisher and her mother Debbie Reynolds, two unspeakable losses that occurred in less than twenty-four hours. The stunned public turned for solace to Debbie’s only remaining child, Todd Fisher, who somehow retained his grace and composure under the glare of the media spotlight as he struggled with his own overwhelming grief.The son of \"America’s Sweethearts\" Debbie Reynolds and Eddie Fisher, Todd grew up amid the glamorous wealth and pretense of Hollywood. Thanks to his funny, loving, no-nonsense mother, Todd remained down to earth, his own man, but always close to his cherished mom, and to his sister through her meteoric rise to stardom and her struggle with demons that never diminished her humor, talent, or spirit.Now, Todd shares his heart and his memories of Debbie and Carrie with deeply personal stories from his earliest years to those last unfathomable days. His book, part memoir, part homage, celebrates their legacies through a more intimate, poignant, and often hilarious portrait of these two remarkable women than has ever been revealed before.With thirty-two pages of never-before-seen photos and memorabilia from his family’s private archives, Todd’s book is a love letter to a sister and a mother, and a gift to countless fans who are mourning the deaths of these two unforgettable stars.",
  "genres": [
    "Nonfiction",
    "Memoir",
    "Biography",
    "Audiobook",
    "Biography Memoir",
    "Autobiography",
    "Media Tie In"
  ],
  "author": "Todd  Fisher",
  "average_rating": "4.26",
  "url": "https://www.goodreads.com/book/show/36301054-my-girls"
}