{
  "title": "99 Percent Mine",
  "description": "Readers and critics alike raved over Sally Thorne’s smash hit debut novel, The Hating Game—which sold in over 20 countries. Now she’s back with an unforgettable romantic comedy about a twin sister and brother struggling over an inheritance—and the sexy best friend who comes between them. a strong and often short-lived infatuation, particularly for someone beyond your reach…… If Darcy Barrett hadn’t met her dream man when she was eight years old, the rest of the male population wouldn’t be such a let-down. No one measures up to Tom Valeska, aka the best man on Earth, not in looks, brain or heart. Even worse is the knowledge that her twin brother Jamie saw him first, and claimed him forever as his best friend.Tom’s off limits and loyal to her brother, 99%. One percent of Tom has had to be enough for Darcy, and her adoration has been sustained by his shy kindness. And if she’s honest, his tight t-shirts.Now Darcy’s got three months left to get her life together, before her twin insists on selling the tumble-down cottage they inherited from their grandmother. By night, she’s working in a seedy bar, shooting down lame pickups from bikers. By day, she’s sewing underwear for her best friend and wasting her award-winning photography skills on website shots of pens and novelty mugs. She’s enjoying living the messy life, and a glass of wine or ten… until that one night, when she finds a six-foot-six perfect package on her porch.Tom’s here, he’s bearing power tools—and he’s single for the first time in a decade.As a house flipper extraordinaire, Tom has been dispatched by Jamie to give the cottage a drastic facelift that will result in a ton of cash. Darcy doesn’t appreciate Tom’s unsentimental approach to knocking down walls, and he really, really doesn’t approve of her current burnout boyfriend. They can’t be in the same room together without sparks flying- and it’s not the faulty wiring. One bedroom wall separates them at night, and even that’s looking flimsy.Will Tom ever see Darcy as anything other than a little-sister obstacle to get around? And can she stand up to her most formidable opponent—her twin? This time around, she’s determined to make Tom Valeska 99 percent hers, and he’s never managed to say no to her yet…",
  "genres": [
    "Romance",
    "Contemporary",
    "Contemporary Romance",
    "Fiction",
    "Chick Lit",
    "Adult",
    "Audiobook"
  ],
  "author": "Sally  Thorne",
  "average_rating": "3.34",
  "url": "https://www.goodreads.com/book/show/36300625-99-percent-mine"
}