{
  "title": "Among the Fallen",
  "description": "Imprisoned for crimes she didn't commit, sixteen-year-old Orpha accepts an unusual invitation to live in a Victorian home for fallen women-- and finds new hope.Though haunted by nightmarish flashbacks and withering in the miserable conditions of Tothill prison, an infamous Victorian workhouse, Orpha perseveres, doing what she can to befriend and protect the other girls imprisoned alongside her. She doesn't speak about what happened-- no one would listen. No one would believe her. But then a mysterious letter arrives, offering her a place at Urania cottage. This experimental home aims to rehabilitate so-called fallen women-- many of them victims of sexual abuse, suffering not only the trauma of their experiences, but the blame and loss of reputation and livelihood. It sounds too good to be true-- but with nowhere else to go, Orpha decides to take her chance. Soon she discovers her unknown savior is none other than Charles Dickens, whose writing deals extensively with the plight of the lower class, and whose friendship and guidance offers Orpha a new way to express herself. With the support of the other women of Urania and the promise of a real future, Orpha will have to confront the darkest parts of her past-- and let go of her secrets. This atmospheric historical novel, full of heartbreakingly real characters whose lives are all too believable, celebrates the strength and resilience of young women throughout history. Virginia Frances' Schwartz's powerful prose, structured to echo Dickens' serialized style, illuminates an era of startling inequality and extreme poverty. Fans of Laurie Halse Anderson's Fever 1793, Margaret Atwood's Alias Grace, and Katherine Paterson's Lyddie will enjoy this riveting title",
  "genres": [
    "Historical Fiction",
    "Young Adult",
    "Historical",
    "LGBT",
    "Young Adult Historical Fiction",
    "Abuse",
    "19th Century"
  ],
  "author": "Virginia Frances Schwartz",
  "average_rating": "3.86",
  "url": "https://www.goodreads.com/book/show/36292173-among-the-fallen"
}