{
  "title": "Island of the Mad",
  "description": "Laurie R. King’s New York Times bestselling series featuring Mary Russell and Sherlock Holmes is “the most sustained feat of imagination in mystery fiction today” (Lee Child)!The last thing Mary Russell and her husband, Sherlock Holmes, need is to help an old friend with her mad, missing aunt. Lady Vivian Beaconsfield has spent most of her adult life in one asylum after another, since the loss of her brother and father in the Great War. Although her mental state seemed to be improving, she’s now disappeared after an outing from Bethlem Royal Hospital . . . better known as Bedlam. Russell wants nothing to do with the case—but she can’t say no. To track down the vanished woman, she must use her deductive instincts and talent for subterfuge—and enlist her husband’s legendary prowess. Together, the two travel from the grim confines of Bedlam to the murky canals of Venice—only to find the shadow of Benito Mussolini darkening the fate of a city, an era, and a tormented English lady of privilege. Praise for Island of the Mad “Full of lush details and clever twists.”—Booklist “Once again validates Laurie R. King as the preeminent Holmes writer working today.”—Bookreporter “A truly memorable mystery . . . Laurie King brings her always amazing imagination to the page to enthrall readers, as only she can do.”—Suspense Magazine “Superb . . . shocking . . . Come for the mystery, stay for the sightseeing, the gibes at fascism, and the heroine’s climactic masquerade as silent film star Harold Lloyd.”—Kirkus Reviews “There’s no shortage of entertainment. . . . If you are a fan of the series, you won’t be disappointed!”—San Francisco Book Review “Well-plotted . . . This ranks as one of the better recent installments in this popular series.”—Publishers Weekly",
  "genres": [
    "Mystery",
    "Historical Fiction",
    "Fiction",
    "Historical",
    "Historical Mystery",
    "Audiobook",
    "Crime"
  ],
  "author": "Laurie R. King",
  "average_rating": "4.07",
  "url": "https://www.goodreads.com/book/show/36296239-island-of-the-mad"
}