{
  "title": "Divided We Stand: Racism in America from Jamestown to Trump",
  "description": "\"A seminal work of outstanding scholarship...Unreservedly recommended!\" -- Midwest Book ReviewFor many people, the rise of white supremacy is a recent phenomenon, but for those who are deeply familiar with U.S. history, it is not new. Quite the contrary. In this new book, David R. Morse, details how the “whiteness\" of America came about and how it has become more prevalent from time to time, beginning with the founding of Jamestown and the slave trade to the current administration of Donald Trump.As various immigrant groups have come to the U.S., usually in response to a need for labor to work in agriculture and infrastructure building, the public and Congress have responded by harassment and limiting the numbers of immigrants who are welcome in our country. The pendulum has swung many times in the last 200 years, as Mexicans, Chinese, Italians, Irish, Jews, Eastern Europeans, and now Muslims have come to the U.S., fleeing violence or seeking economic opportunity.The most well-known of the struggles are of African Americans who came to this country not of their own free will, but as slaves. From the Civil War to the Civil Rights movement, to Black Lives Matter, their attempts to achieve equal status in the United States is ongoing and well documented in this book and different than the stories of other people of color. Their early experiences with racial hatred, Jim Crow, and slurs about their character, work ethic, and intelligence colors their views of justice in the U.S. unlike immigrant groups who have often come willingly in hopes of a better life.The book cites both primary and secondary sources to make a cogent argument that people of color or ethnicities that are different from the country’s white Anglo founders have always been viewed with suspicion—that they are taking jobs from whites, bringing crime, or overloading public services. At the same time, these immigrant groups have contributed to economic growth and entrepreneurship and without them, the country’s economy would stagnate.Afshin Matin-Asgari, a professor of Middle East History, at California State University, Los Angeles, says, “Morse's professional expertise, in multicultural marketing research, combined with his superb handling of scholarly literature make this book a readable and learned primer on the question of race in contemporary America.”Along with individual chapters for specific ethnic groups, Morse also explores the implications of race and science and the new interest in using DNA to establish ethnicity. History of many of these ethnic groups shows that eventually most have been accepted and assimilated into American society, so that slogans like “No Irish need apply” disappear. In some ways, that assimilation history means that people forget about the how immigrant groups have often had to struggle for acceptance.Professor of Sociology and Asian American studies, Min Zhou says, “Racism and racial stereotyping are still powerful forces that can divide Americans. David Morse’s timely, insightful, and lucid analysis tackles the root causes of the problems and offers hope for a more inclusive nation.”David R. Morse combines his love of history and deep knowledge about multicultural communities in both his professional and personal lives. His new book is sure to help students of U.S. history, political science, ethnic studies, and labor relations understand the many complex layers of discrimination and racism throughout U.S. history and foster an informed conversation as the nation continues to struggle with this divisive issue.",
  "genres": [],
  "author": "David R. Morse",
  "average_rating": "0.00",
  "url": "https://www.goodreads.com/book/show/36312995-divided-we-stand"
}