{
  "title": "Outside the Magic Circle: The Autobiography of Virginia Foster Durr",
  "description": "Virginia Foster Durr is the daughter of a Presbyterian minister, and she was raised in Birmingham during the early years of this century. She attended Wellesley for two years, until her family’s circumstances made it impossible for her to continue. Virginia’s sister Josephine married Hugo Black; and in 1926 Virginia married a young lawyer named Clifford Durr. The Durrs moved to Washington shortly after Roosevelt’s inauguration, and Clifford was one of the “bright young lawyers” whom the new president relied upon to draft the legislation establishing the New Deal. After World War II the Durrs moved to Denver, then to Montgomery, where Clifford became one of the few white lawyers to represent blacks in civil rights cases. During the Durrs’ Washington years Virginia had been active in the movement to abolish the poll tax and in to her liberal causes; and back in Montgomery, she shared Clifford’s commitment to the civil rights movement and served as an inspiration to liberals of both races. Virginia Durr has succeeded in articulating the pleasures and the difficulties of growing up female in the vigorous young city of Birmingham; the broadening (and in some ways also restricting) of young women’s intellectual horizons and social life at Wellesley; and the excitement of the courtship and marriage of a proper young Southern girl of good family and poor circumstance. She brings to life the social and political climate of Washington during the New Deal and war years, where her close connection to Justice Black gave the Durrs access to people whom they might not have come to know otherwise. A victim of McCarthyism, Clifford returned with Virginia to Montgomery with no job and few prospects. Their decision to become engaged in the civil rights struggle was consistent with their lifelong commitment to follow their consciences, regardless of the social and economic consequences. “Virginia Durr said it: there were three ways for a well brought-up young Southern white woman to go. She could be the actress, playing out the stereotype of the Southern belle. Gracious to ‘the colored help,’ flirtatious to her powerful father-in-law, and offering a sweet, winning smile to the world. In short, going with the wind. If she had a spark of independence or worse, creativity, she could go crazy—on the dark, shadowy street traveled by more than one Southern belle. Or she could be the rebel. She could step outside the magic circle, abandon privilege, and challenge this way of life. Ostracism, bruised of all sorts, and defamation would be her lot. Her reward would be a truly examined life. And a world she would otherwise never have known.” — from the Foreword by Studs Terkel",
  "genres": [
    "Nonfiction",
    "Memoir",
    "History",
    "Social Justice",
    "Race",
    "Autobiography",
    "Biography"
  ],
  "author": "Virginia Foster Durr",
  "average_rating": "3.99",
  "url": "https://www.goodreads.com/book/show/363033.Outside_the_Magic_Circle"
}