{
  "title": "Joy! Joy! Joy!: 7 Mind Body Spirit Self-Help Practices to Relieve Stress and Anxiety, Reverse Memory Loss and Live Happy - I Did It! You Too Can Bust the Blues",
  "description": "GOT THE BLUES?  From the author of award-winning “Think and Grow Young” comes this engrossing, true story of transformation to inspire you to live a radically different way.  Imagine how it would feel to let go of chronic high stress and the worn out feeling of mild depression.  Imagine using simple, proven Mind Body Spirit practices to remain calm and be productive and joyful while the whole world is going crazy.  How would it feel to soar fearlessly through life, unruffled by the winds of change? And to have peace of mind and happiness!  HOW “JOY! JOY! JOY!” CAN HELP  This book is the first detailed self-help guide for you to live happy, seasoned with fascinating stories of how 7 easy Mind Body Spirit habits dramatically and permanently transformed the author’s life, including reversing memory loss, conquering breast cancer and busting the blues.  “Joy! Joy! Joy!” is not about stopping anti-depressants.  It’s about • ending habitual emotional patterns that abuse your body and scar your soul. • creating new life-affirming habits, like EFT tapping, Power Poses, dry brushing your skin, meditation and affirmations. • providing quick, easy steps on how to relieve stress and have peace of mind. • dissolving that lingering depression malaise: the blahs, the blues.  And being filled with quiet joy for no reason.  HOW ELLEN WOOD MIRACULOUSLY CHANGED HER LIFE  Five years after watching her mother succumb to Alzheimer’s Disease, Ellen’s own cognition and memory began a downward spiral (she has the Alzheimer’s gene, APO-e4).  Then at age 67, Ellen’s distress became the wake-up call of a lifetime. Determined to do everything in her power to reverse aging, Ellen developed a program of Mind Body Spirit practices that succeeded beyond her wildest dreams. It not only reversed memory loss, it also brought spiritual transformation, relieved stress, and conquered breast cancer.  These practices, which Ellen continues to this day, also give her:  • vast amounts of energy • fingers that no longer hurt • a stronger, more flexible body and a clearer, sharper mind than before she began her program.  Plus joy for no reason. (That’s a biggie.)  Ellen knew she had to share this miraculous program so she wrote and published “Think and Grow Young,\" the prizewinning book which lays the foundation for rejuvenation and provides vital first steps. She also began her career as a speaker and columnist.  THE GENESIS OF “JOY! JOY! JOY!”  When she was invited to help address the depression epidemic of a northern New Mexico town, Ellen knew that detailed instructions for all 7 habits were needed and “Joy! Joy! Joy!” was born. Not only do these practices rejuvenate body and soul, they also relieve stress and help people live happy.  In these pages you’ll find a step-by- step action plan for the 7 daily Mind Body Spirit self-help practices for growing younger and living happy, most of which take only 2 quick minutes.  “Joy! Joy! Joy!” is endorsed by four globally-renowned medical doctors.  A PERSONAL NOTE FROM THE AUTHOR  Curled up in my bed, emotional pain gnawing at my belly, feeling spiritually adrift, I couldn’t remember what it felt like to be happy. Or even neutral.  If this seems familiar to you, I understand and I want to help.",
  "genres": [
    "Self Help"
  ],
  "author": "Ellen  Wood",
  "average_rating": "4.55",
  "url": "https://www.goodreads.com/book/show/36305126-joy-joy-joy"
}