{
  "title": "Ti amo già da un po'",
  "description": "L’autrice adorata dal web torna con una romantica storia di NataleRomanticissimo e frizzante!Manca una settimana a Natale. Maybelle e Luke, entrambi avvocati, sono nel loro appartamento e stanno discutendo animatamente per via di un caso che May non ha voluto accettare e che il padre di Luke, capo del prestigioso studio di avvocati di New York Davis & Associates, le ha ordinato di prendere in carico. May è determinata a non cedere, Luke è irremovibile sulla posizione della famiglia. I toni si alzano e il confronto diventa un litigio vero e proprio. May, delusa dall’atteggiamento del fidanzato, se ne va sbattendo la porta. Partirà alla volta del New trascorrerà le festività nella casa di famiglia con i genitori e cercherà di schiarirsi le idee. La cittadina di Keene non le è mai sembrata così bella, e anche se ha un macigno sul cuore, May non può fare a meno di sentirsi davvero a casa, in mezzo alla neve, a romantiche decorazioni, cioccolate calde col cuore di gelato, e soprattutto non immaginava che avrebbe incontrato di nuovo Peter, il suo amico di un tempo che forse non ha mai davvero capito… Numero 1 sul webLa commedia romantica che leggerete quest’anno«Stupendo! Ho scoperto questa autrice per caso ed è stata una lettura magnifica. Mi ha convolto pagina dopo pagina, emozionandomi e facendomi sorridere! Una bellissima storia d’amore!» «Ho adorato ogni cosa di questo l’ambientazione nella piccola cittadina di Keene, con il romantico gazebo al centro della piazza, le decorazioni natalizie e l’immancabile neve a fare da sfondo al racconto. La scrittura dell’autrice, che ha saputo tenermi incollata alle pagine fino alla fine e regalarmi più di un sorriso. Brava!»«Travolgente. Non sono riuscita a smettere di leggere finché non l’ho finito.»Tania PaxiaVive in provincia di Livorno. Frequenta la facoltà di Giurisprudenza di Pisa, ma la sua grande passione è scrivere. La Newton Compton ha pubblicato Le strane logiche dell’amore , un grande successo sul web.",
  "genres": [],
  "author": "Tania Paxia",
  "average_rating": "3.84",
  "url": "https://www.goodreads.com/book/show/36303862-ti-amo-gi-da-un-po"
}