{
  "title": "Were You Talking to Me?",
  "description": "Were You Talking to Me is a collection of short stories centered on a fictitious character with the unusual name of Martin Luther Gittleman. The reader will get to know Marty's wife Rose, his granddaughter Sally, Roses nephew Lubber, Marty's dear friend Fred, and even Mr. Death. The reader may well find the familiar as he reads along.. . In the story, Aunt Peggy Went Away, we find Marty trying to explain to 5 year old Sally the death of her loving aunt. The subject is sad and, yet, one we have all dealt with. The tale ends with Sally's typical but unexpected response. St. Mathew's involves the supernatural, a story told as a result of the difference in Marty's and Fred's outlook on life. Marty's rendition describing an evening in the town of St. Mathew's bolsters Fred's convictions until the surprise ending. Lubber, Rose's teen age nephew, is a thorn in Marty's side. We never actually hear a word Lubber says. However, we know his every word and action by Marty's responses and reactions. Mr. Death is the being responsible for collecting souls of the newly departed. Most people are uncomfortable in his presence yet he and Marty have several casual conversations in the comfort of Marty's warm den. All deal with human beliefs and reactions. . But most of the stories center around Marty and Rose's down to earth reactions with the man she loves and to whom she has become accustomed after many years of matimony. In 'Marty's Birthday', Rose discovers Marty was born on February 29 and his insistence he only has a birthday every four years introduces her to her first taste of exasperation in their marriage. However the focus of their attention is different and the reader will get a chuckle over that difference. Sit down, pick up the book and enjoy a few moments of casual reading. Read one, read two, or all fifty. You will be amused, diverted, and walk away with the warm feeling usually found after a visit with nice friends.",
  "genres": [],
  "author": "Aitch Embee",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/12183115-were-you-talking-to-me"
}