{
  "title": "Somewhere Still",
  "description": "Journey to the Roaring Twenties when the rules were clear and made to be broken.Somewhere Still, coming-of-age Roaring Twenties historical fiction, is the story of one young woman's transformative journey of love, betrayal, and redemption. From the day Jean Ball lands a job at the elegant Empire hotel, she quickly learns the secrets of the entitled class. Dazzled by a Roaring Twenties society on the cusp of radical change, this naive and innocent young woman finds herself dancing, bobbing her hair, and falling for Elden Whitcomb, the handsome son of the wealthy hotel owner. The stakes rise when the Whitcombs’ powerful secrets are revealed and loving Elden comes at a price – one that may be too high for Jean to pay.Shattered and alone, Jean's in the battle of her life in a city alive with romance, smoky speakeasies, jazz music and scandal, but divided by race and class. With the help and encouragement of influential women, Jean may find what she has always needed, though her choices could echo through generations. But will the man she trusted and so fiercely loves redeem himself?Somewhere Still offers a unique window into the history and culture of Kansas City at a turning point in its development and blends history and fiction to tell the coming-of-age story of one young woman's transformative journey of love, betrayal, and redemption. Denitta Ward uses historical sites and real events to explore Jean's transformation from an innocent young girl to a self-assured woman, making her way in a society in transition. Somewhere Still aims to give insight into 1920s Kansas City, a city on the cusp of significant change. During this time, the city's society women united to urge social advances, the jazz culture was born, baseball's famous Negro League was formed, and the city had a burgeoning Prohibition bootleg trade.",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Historical"
  ],
  "author": "Denitta Ward",
  "average_rating": "4.13",
  "url": "https://www.goodreads.com/book/show/36323403-somewhere-still"
}