{
  "title": "Nine Years Among the Indians, 1870-1879: The Story of the Captivity and Life of a Texan Among the Indians",
  "description": "\"Lehmann's memoir is quite fantastic-sounding at times, but is regarded as one of the best of that rare breed of book, the first-person 'captivity story' . . . One of the values of Lehmann's book is its no-holds-barred, unapologetic tone.\" Rocky Mountain News As a young child, Herman Lehmann was captured by a band of plundering Apache Indians and remained with them for nine years. This is his dramatic and unique story. His memoir, fast-paced and compelling, tells of his arduous initial years with the Apache as he underwent a sometimes torturous initiation into Indian life. Peppered with various escape attempts, Lehmann’s recollections are fresh and exciting in spite of the years past. Lehmann provides us with a fascinating look at Apache, and later, Comanche culture. He tells of their rituals, medicinal practices and gives an insight into Native American manufacture of arrow-heads, saddles and shields. After a few years, Lehmann became completely integrated into the warrior life, joining in on raids throughout the South-West and Mexico. Nine Years with the Indians tells of violent clashes with white rangers and other Native American tribes, scalpings and the violence of life in nineteenth century western America. \"A fascinating account of [Lehmann's] subsequent life among both the Apache and Comanche people. . . . this is an engaging read.\" - German Life \"Lehmann's true-life story features suspense and excitement that surpass even the skill of the most imaginative fiction writer.\" - Books of the Southwest Herman Lehmann (June 5, 1859 – February 2, 1932) was captured as a child by Native Americans. He lived first among the Apache and then the Comanche but eventually returned to his family later on in his life. The phenomenon of a \"white boy\" raised by \"Indians\" made him a notable figure in the United States. He published his autobiography, Nine Years Among the Indians in 1927.",
  "genres": [
    "History",
    "Nonfiction",
    "Memoir",
    "Biography",
    "Westerns",
    "Native American",
    "American History"
  ],
  "author": "Herman Lehmann",
  "average_rating": "4.17",
  "url": "https://www.goodreads.com/book/show/36315431-nine-years-among-the-indians-1870-1879"
}