{
  "title": "The Rosemont Duology Boxed Set",
  "description": "To Have Loved & Lost and Anika takes the long way home up soul mountain form the Rosemont Duology. Together, they have nearly 250 positive reviews.\n  \nTo Have Loved & Lost\n is a tale of love, loss, and college basketball. It is the story of Alex and Graham, two young women whose lives are spiraling out of control. Can coming together bring both of them back up?  \"I was a little concerned that this book would be a bit of a downer for me. I was completely wrong. Once I started reading it, I could not put it down. The story begins in the aftermath of duel tragedies that our two protagonists (Alex and Graham) are trying to overcome in order to heal their hearts, their minds and their souls. Little by little their stories are revealed and they find themselves in their individual strength and in each other. The story is uplifting, at times humorous and always hopeful.\"  \"If books could be soulmates, this one would be mine. It is romantic, sexy, intelligent, thought-provoking, and I came away learning a thing or two about basketball and myself. It is everything a woman could want.\"  \nAnika takes the long way home up soul mountain\n catches up with Anika Singh, one of the characters from To Have Loved & Lost, a few years after the epilogue from the first book. At thirty-eight, Anika's basketball career is almost over. Headed home to Ohio to help her family, Anika encounters two people she didn't expect: Her ex-wife and a beautiful stranger she met on the plane. Is it true what they say, that you can never go home again?  \"This is honestly one of the best stories I have read, and I read a lot. It is funny, deep, and accurate.\"  \"Amazing! Andrews' writing draws you in and holds on tight, I couldn't put this story down! Anika is as real as anyone you'd meet on the street and her story is beautiful and heart wrenching and intoxicating all at the same time. Read this book. You won't regret it!\"   Click \"buy now\" to start reading!  (The pre-order will be live on October 25)",
  "genres": [],
  "author": "Eliza Andrews",
  "average_rating": "4.54",
  "url": "https://www.goodreads.com/book/show/36322230-the-rosemont-duology-boxed-set"
}