{
  "title": "Freeing the Prisoner",
  "description": "A warrior taken prisoner, held in chains without hope... A princess fascinated by the strange alien male...\n\nWhen Dani slips into the prisoner's cell to learn more about him, she doesn't expect to fall in love!\n\n\n But, Kyron is a Touch Kindred… Able to Touch her even though his hands are chained... Will he also Touch her heart? Will Dani help him escape?\n\nFind out in Freeing the Prisoner…\n\nKyron is a Touch Kindred, able to physically touch others with the power of his mind and Touch sense, but he has sworn a solemn vow to use his power only for good. When he is captured and held prisoner on the small planet of Goshan Prime, his resolve is sorely tested. He's beaten, starved, and kept constantly chained. There's only one bright spot - a girl who slips into his cell because she's curious...\nDannella is a Princess of the Blood. Raised to be a proper lady, she knows that one day she will be given in marriage to a male who will act as both her husband and owner. Females aren't valued in Goshan society and she has little control over her own life. Despite her restrictive upbringing, Dani rebels and finds her way into the cell occupied by the strange new warrior, a Kindred so huge he dwarfs every other male she's ever known!\nKyron shows her his Touch sense and gives her pleasure she's never dreamed of, even though he is chained in his cell. Dani finds herself falling for the big Kindred. But then, the unthinkable happens - a marriage is announced and time has suddenly grown short. Now she and Ky are one the run, trying to escape from a life which has become a prison for them both. But in order to gain their freedom, Ky must break his sacred oath. Will it cost him his love and his life?\n\nRead Freeing the Prisoner to find out…\n\nAuthor's Note: Freeing the Prisoner is a Kindred Tales Novel set in the Brides of the Kindred universe",
  "genres": [
    "Aliens",
    "Romance",
    "Science Fiction Romance",
    "Science Fiction",
    "Paranormal",
    "Erotica",
    "Audiobook"
  ],
  "author": "Evangeline Anderson",
  "average_rating": "4.10",
  "url": "https://www.goodreads.com/book/show/36329286-freeing-the-prisoner"
}