{
  "title": "The Influence of Military Strategies to Business: Skills to Help With Problem Solving and Decision Making",
  "description": "Business Management and Leadership Expert, M.D. White, releases new book, “The Influence of Military Strategies to Business.” A military-based guide to business takes the best wartime tactics and practices and teaches you how you can apply them in your business—and your political or personal life—successfully. The book is scheduled for release on the 1st of October. As a Business Strategy and Psychological Warfare Consultant, M.D. White wrote this book utilizing his countless experiences over the years to properly proffer working, tested and trusted strategies to help business owners or employees, business managers or executives, politicians and or public figures manage high-stake business and leadership situations with the greatest success. White had this to say: \"No amount of experience in crucial conversations, or business negotiations, can prepare you better than the information you'll gleam from this manual. It's truly a politician’s guide to psychological warfare. Perhaps its President Trumps bible, and what he reads everynight. The moral of the story is: Use it, or be used by it! Current geopolitical controversies only emphasize this point.\" Many have deliberated over the effect of military strategies in business, but M.D. White cuts to the chase and reveals the raw and missing pieces all other military strategy discussions have left out. In this book, White extracts the key ingredients of military strategies and the applications which are left out in most discussions. For the first time ever there is a clear work-around of military strategies and an easy to understand roadmap on learning how to unlock, grow and strengthen from within one’s influence, presence and abilities. The Author further stressed the effectiveness of military strategies in business. “This military-based guide to business takes the best wartime tactics and practices and teaches you how you can apply them in your business—and your political or personal life—successfully. Developed within a systematic and comprehensive framework, this book utilizes the art of war in a whole new way and reveals that the path to a smooth business victory and mutually beneficial dialogue can be found in an unexpected but rewarding place.”  The world of business is a battlefield. You must be prepared.  Sun Tzu said, “The art of war teaches us to rely not on the likelihood of the enemy’s not coming, but on our own readiness to receive him.” The takeaway? Do everything in your power to be prepared, because it's only a matter of time before something goes wrong. If you are running, founding, working in any business, or are in an environment where ‘politics’ yield to nobody, The Influence of Military Strategies to Business is the preparation you need to succeed.  This military-based guide to business takes the best wartime tactics and practices and teaches you how you can apply them in your business—and your personal life—successfully. With its systematic and comprehensive framework, this book utilizes the art of war in a whole new way and reveals that the path to a smooth business victory can be found in an unexpected but rewarding place.",
  "genres": [
    "Business",
    "Contemporary",
    "Nonfiction",
    "Adult",
    "Management",
    "Education",
    "New Adult"
  ],
  "author": "M.D. White",
  "average_rating": "4.06",
  "url": "https://www.goodreads.com/book/show/36334989-the-influence-of-military-strategies-to-business"
}