{
  "title": "Iran Awakening",
  "description": "\"Throughout an extraordinary career as a lawyer, writer, activist, and dissident, Shirin Ebadi has spoken out clearly and strongly for her native Iran - and her voice has resonated far beyond that country's borders. As a dedicated human rights advocate and winner of the Nobel Peace Prize, Ebadi has almost single-handedly given both Iran and the world reason to hope for a better future.\" \"Now, in this memoir, Ebadi provides an eyewitness account of one woman's courageous stand at the crossroads of history. Best known as a lawyer who defends women and children in politically charged cases that most in her profession refuse to touch, Ebadi recounts her public career and reveals her private self: her faith, her experiences, and her desire to lead a traditional life even while serving as a rebellious voice in a land where such voices are muted or brutally silenced.\" \"Ebadi describes her girlhood in a modest Tehran household, her education, and her early professional success in the mid-1970s as Iran's most accomplished female jurist. She speaks eloquently about the ideals of the 1979 Islamic Revolution, and of her deep disillusionment with the direction Iran has since taken under the guidance of the hard-line clerics. She recounts the ignominy of her demotion to clerk in the courtroom over which she once presided, when the religious authorities declared women unfit to serve as judges. She speaks out against the oppressive patriarchy of Iran, where conservative rulers have stripped women of their basic rights and all citizens of their political freedom.\" In reading Shirin Ebadi's story, however, we come to see not a larger-than-life presence but a devoted daughter, wife, and mother, a down-to-earth woman who would never consider leaving on a lecture tour (or doing a stretch in prison) without first preparing enough meals for her husband and two daughters to last the duration of her absence. Ebadi is an everywoman, albeit one who has braved imprisonment, harassment, as",
  "genres": [
    "Nonfiction",
    "Iran",
    "Memoir",
    "History",
    "Biography",
    "Politics",
    "Feminism"
  ],
  "author": "Shirin Ebadi",
  "average_rating": "4.17",
  "url": "https://www.goodreads.com/book/show/36325246-iran-awakening"
}