{
  "title": "Dark of Night",
  "description": "Taking on the world’s deadliest criminals is what the elite security force Troubleshooters Incorporated does best. But now they face a new and powerful threat from their most lethal enemy yet–a shadowy government outfit known only as The Agency.For years, operative James Nash has performed ultra-covert “Black Ops” missions for The Agency, but when he decide to walk away from their dirty work, his corrupt bosses aren’t about to let him go. After Nash is nearly assassinated, Troubleshooters team leader Lawrence Decker launches a skillful deception to neutralize the threat and protect his friend. With the FBI’s help, Decker fakes Nash’s death, then brings him to a safe house with his fiancée, Tess Bailey, to recover from his injuries and strategize their next move.Only a handful of people know that Nash is still alive–and fellow Troubleshooters Dave Malkoff, Sophia Ghaffari, and receptionist Tracy Shapiro aren’t among them. Believing that Nash is dead and that Decker has begun a romantic relationship with Tess, Sophia settles for second best and begins a love affair with Dave, who has adored her for years. But Tracy puts two and two together, discovering the truth about Nash–much to Decker’s dismay. As passions flare, Decker struggles to keep his scheme afloat, and to keep Nash alive. But when he finds himself targeted for death, the game turns even more perilous, and Sophia, Tracy, and Dave are swept into the deadly play. Under fire and racing to unmask their relentless adversary, the Troubleshooters know that the closer they get, the greater the risks. But sacrifices and consequences come with the territory. Forced to choose between love and loyalty, they are no longer just solving a crime–they’re fighting for survival.",
  "genres": [
    "Romance",
    "Romantic Suspense",
    "Suspense",
    "Military Fiction",
    "Contemporary",
    "Fiction",
    "Contemporary Romance"
  ],
  "author": "Suzanne Brockmann",
  "average_rating": "4.25",
  "url": "https://www.goodreads.com/book/show/3633352-dark-of-night"
}