{
  "title": "Brackwasser",
  "description": "Poughkeepsie, ein kleines Städtchen im nördlichen Speckgürtel von New York City, Mitte der Achtzigerjahre: Anatole betreibt einen angesagten Friseursalon, Lydia ist als gescheiterte Existenz aus New York zurückgekehrt und Chris, der vor einer tragisch verlaufenen Beziehung nach Poughkeepsie geflüchtet ist, betreibt einen Plattenladen. Anatole und Lydia sind beide in Chris verliebt, doch der lässt niemand an sich heran. Paul Russell erzählt davon, wie die drei Mitzwanziger versuchen, miteinander klarzukommen – und wie der achtzehnjährige Leigh ihre beschauliche Dreisamkeit gehörig aufmischt: \"Im Einkaufszentrum an der Main Street von Poughkeepsie sitzt ein Junge. Damit fängt es an: Lydia und Anatole sehen, aus zwei verschiedenen Fenstern, den Jungen auf der Lehne einer Bank sitzen.» Anatole, der sich am laufenden Band in hübsche Jungs verliebt, lässt den „Jungen Gott des Einkaufszentrums“ bei sich wohnen. Wie der geheimnisvolle Besucher in Pasolinis „Teorema“ löst Leigh bei allen drei Freunden tiefgreifende Veränderungen aus.In der Mitte der Achtzigerjahre war die Aufbruchsbewegung der Hippies zu einem abrupten Ende gekommen, die Hoffnung auf ein liebevolles Zeitalter des Wassermanns in Drogenrausch und Aidskrise ertränkt. Die Zukunft war nicht länger der Fluchtpunkt weltverändernder Pläne, sondern eine gefährliche, von Krieg und Zerstörung geprägt Welt. Die in dieser Zeit aufwachsenden Generationen waren auf das Hier und Jetzt, ihre individuellen Wünsche und Ängste und das schwierige Miteinander in privaten Cliquen verwiesen. Die Menschen begannen, sich in einer ewigen Gegenwart ohne verlockende Perspektiven einzurichten. Wenn wir heute in diese Zeit zurückblicken, sehen wir die Anfänge einer Alltagskultur, die wir im 21. Jahrhundert perfektioniert haben.",
  "genres": [
    "Fiction",
    "LGBT",
    "Gay",
    "Gay Fiction",
    "Queer",
    "Literary Fiction",
    "American Fiction"
  ],
  "author": "Paul Russell",
  "average_rating": "3.73",
  "url": "https://www.goodreads.com/book/show/36328404-brackwasser"
}