{
  "title": "Mindful Choices for Well-Being: Mindful Awareness, Great Choices, Powerful Habits--with Mindful Choices Therapy",
  "description": "Mindful Choices for Mindful Awareness, Great Choices, Powerful Habits--with Mindful Choices Therapy   by William C. Shearer and Robin L. ShearerMindful Choices for Well-Being offers a holistic, action-oriented process of choosing and creating well-being using proven methods for transformational change. The Shearers developed Mindful Choices Therapy during three decades of clinical practice. A cornerstone of their method is the systematic mastery of 10 interrelated Mindful Their how-to manual for life planning features fictional characters going through real-life struggles and changes, providing examples of a powerful therapy that blends neuroscience, Buddhist psychology, contemplative traditions, and mindfulness-based behavioral therapies. The tools described in the book will help you move from a life of too much stress and anxiety (what the authors call \"dis-ease\") to a life of well-being, balance, and a deep sense of purpose. Instead of acting on autopilot, falling back on habits learned over a lifetime, you can can learn how to mindfully make clear choices aimed at creating the life you truly want. Mindful awareness is the starting point for making great choices. Mindful Choices Therapy provides the tools for transforming those great choices into powerful and effective habits. Both licensed mental health professionals, Bill and Robin Shearer come from diverse backgrounds. Bill started out as a United States history teacher and went on to an Air Force career, retiring as a Lt. Col. He has been a licensed psychologist in California since 1977. Robin began her career as a school nurse and neonatal intensive care nurse before becoming a marriage and family therapist. Long on education (the shearers have seven graduate degrees between them), the couple has spent decades not only providing treatment in a mental health setting, but living their values in real life. They engage in a variety of balancing and revitalizing practices such as yoga, meditation and being surrounded by nature. Robin is an avid equestrian. Bill is a wildlife photographer and artist. In short, they practice what they teach, and they are on a mission. While specializing in providing treatment for addictions, eating disorders, problem relationships, and stress and anxiety disorders - problems characterized by a lack of balance and resilience - their main passion is helping others move beyond dissatisfaction with life or mental health issues, to a life of meaning, purpose, and deepsatisfaction - a life of \"thriving.\"",
  "genres": [
    "Nonfiction"
  ],
  "author": "William C. Shearer",
  "average_rating": "4.33",
  "url": "https://www.goodreads.com/book/show/36327576-mindful-choices-for-well-being"
}