{
  "title": "The Right To The Truth: For families and friends of patients with cancer",
  "description": "Provocative book reveals widespread abuse of cancer patients’ rights.\nShould\n all patients be informed when they’ve been diagnosed with \ncancer?\n If the answer is “yes,” \nWho\n should break the bad news to them? And \nHow\n is such news best delivered? \nHow much\n of the truth can a patient handle?Patients’ inalienable right to know the truth about their condition ought to be guaranteed the world over. Yet this right is routinely violated. In Greece, for example, cancer patients are frequently kept in the dark about their diagnosis. In fact, this right is routinely disregarded all over the globe with appalling consequences.In “The Right To The Truth,” the author—a thoracic surgeon—presents Counterexamples inspired by events observed during 33 years of clinical experience, and he addresses each with well-crafted Arguments \nin favor of the patients’ Right to know :\n► for Trust► for Protection from predators who would exploit vulnerable patients► for understanding that Sacrifices are sometimes required to achieve cure► for acquiring well-founded Hope ► for Overcoming fear of the unknownThe book :► offers advice to family members of cancer patients, as it is usually they who shoulder the burden of deciding whether or not to have their loved one informed.► offers thought-provoking ideas for those who care for cancer patients. Physicians, nurses, psychologists, clergy, and \nfriends\n are all urged to be truthful with patients; lying leads only to suffering.► repudiates hypocritical arguments that claim withholding the truth from patients “spares them avoidable distress,” when the exact opposite is true. The hypocrisy behind brazen deceit inevitably becomes a source of harm to the patient. Myriad unethical, even illegal, wrongdoings \nare exposed\n that they should be banned from clinical practice once and for all.—http://www.papachristos.eu/righttothe...",
  "genres": [
    "Health"
  ],
  "author": "I.C. Papachristos",
  "average_rating": "4.29",
  "url": "https://www.goodreads.com/book/show/36329959-the-right-to-the-truth"
}