{
  "title": "The Terracotta Warriors: Exploring the Most Intriguing Puzzle in Chinese History",
  "description": "A history of the famous Terracotta Army in Xi’an, China, exploring what we now know about it, what remains hidden, and the fascinating theories that surround its creation.Exciting investigations in northwest China are about to reveal more of the mysteries of the huge mausoleum of the Qin Emperor, a portion of which was accidently discovered in 1974 by farmers who were digging a well. The second phase of an international research project began in 2011 and is ongoing. More recently still, promising new excavations began in Pit 2, with exciting fresh discoveries already announced. The Terracotta Warriors seeks to examine one of China’s most famous archaeological discoveries in light of these new findings.The book begins with the discovery of the terracotta warriors and then tells the history of the Qin Dynasty and as much as is known about the construction of the 3rd century BCE mausoleum, based on the work of the historian Sima Qian (145–90 BCE). He wrote that the First Emperor was buried with palaces, towers, officials, valuable artifacts, and wondrous objects. According to this account, one hundred flowing rivers were simulated using mercury; the ceiling was decorated with heavenly bodies, high above the features of the land. The new findings and the description of the mausoleum based on the quoted historical accounts suggest that the next discoveries may surpass the size and conception of the original discovery of the terracotta warriors.In the second part, Edward Burman Who built it and how? He also questions the role of the terracotta warriors, who may be servants and not warriors, and what their function may have been in the afterlife. Finally, he anticipates the ongoing discoveries and describes teh new methods of excavation and preservation.",
  "genres": [
    "History",
    "Nonfiction",
    "China",
    "Art",
    "Asia",
    "Archaeology",
    "Art History"
  ],
  "author": "Edward Burman",
  "average_rating": "3.73",
  "url": "https://www.goodreads.com/book/show/36327125-the-terracotta-warriors"
}