{
  "title": "Madness and Magnolias",
  "description": "The horrific murders of close friends, coupled with threatening notes and blood-dipped magnolias would be enough to rattle anyone. Victoria LeJeune, a bold and beloved woman, is no exception. Join this fiercely independent and successful owner of high-class Victorian burlesque clubs in her efforts to figure out these crimes. Are they linked to her business, her work against human trafficking in New Orleans, or are they personal? Experience her terror increasing as the danger comes closer and closer to home. And when you put the book down to go on with your life, ask yourself, Who can you really trust?Surrounded by friends and strangers both indebted and worshipful--from Alex, her housekeeper, boyfriend Connor, employees, law enforcement and those on the other side of the law, Victoria LeJeune should feel safe and loved. Yet, abandoned by her mother as a child, she is plagued by loneliness. Working to battle the human-trafficking problem in New Orleans helps a bit until the deaths of her friends bring her loneliness to the surface once again.Aided by New Orleans police detective Bryan Thibodeaux—her childhood friend--Victoria determines that her work against human trafficking is the only link to the murdered women. Feeling confused and overwhelmed by uncertainty, Victoria and Bryan drive down the bayou to visit her Cajun grandmother (and Voodoo priestess) for guidance and wisdom.Victoria also turns for information to wealthy, vampire-coven leader Stuart Bastogne, the one man she’s ever truly loved, and Bryan’s arch enemy. Despite his own shady business dealings, Stuart partners with FBI agent Robert Landers to share tips from both sides of the law. Landers, investigating a diamond-smuggling ring in New Orleans, sidesteps department regulations to get closer to Victoria, all in the line of duty, of course.Surprising twists and turns of events lead to everyone’s increasing desperation to prevent another gruesome murder. As this shifting group of Victoria’s friends, lovers, and enemies seeks answers, they learn about themselves, each other and the greying line between good and evil.",
  "genres": [],
  "author": "T.F. Cravens",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/36337130-madness-and-magnolias"
}