{
  "title": "Surviving Your Worst Nightmare: A Guide For the Betrayed",
  "description": "Your wedding vows are broken, and you do not know what lies ahead. You are angry, confused, and fearful. Your self-worth and your confidence have been shattered. You do not know what is the truth, or what is a lie. You wonder if the pain in your heart will always be a part of you—feelings of despair and hopelessness consume you. I understand. All that you are feeling right now I have felt, for I have walked the same path of betrayal that you are on right now.After my husband confessed his unfaithfulness I struggled to find sanity and clarity; it was all I could do to find ways to overcome my suffering. In my efforts to get answers, I questioned everything. I questioned the past, the present and the future. I was determined to identify the reasons behind my husband’s infidelity so I could move beyond the hurt and devastation that this nightmare had caused. In my quest to find answers I learned that after an act of infidelity, even though I wished it were not so, recovery would take time. I learned that healing would come only when I decided that I was willing to do the hard work of discovering what the after-effects of the betrayal had done to me emotionally, and if I was willing to not run from the pain, or deny the pain, or distract and medicate my pain with various mind-numbing vices. I learned, even though it seemed irrational, that embracing and mourning pain would usher in the healing of my wounded heart. But if I did not, my heart wounds would continue to fester, and I would become an angry, untrusting and cynical person. It would not matter if I chose to stay married or not, the difficult emotional work needed to be done in order for my heart and my mind to heal. Surviving Your Worst A Guide for the Betrayed is a narrative of my survival journey. You will identify with my grief and confusion during each difficult stage of recovery. As you follow my personal experience with infidelity you will read my private journal entries that describe in detail my anguish, as well as the steps I took to help heal my damaged emotions. You may relate to my “How did I get here?” question and my rants of “Where are you God?” in the midst of such excruciating pain. You will learn what it took for me to be willing to choose to love, and then decide to trust my husband once again. You will learn as well what I believe to be a leading cause as to why a loved-one would choose to be unfaithful.My main objective in sharing my healing journey with you is to help bring clarity and stability to your wounded heart. My desire is to come alongside of you to encourage you and to help guide you through the aftershocks of infidelity. I want to offer a lifeline of hope as you struggle to survive the nightmare that is raging in your heart right now. I want you to know that you can survive! Yes, you are changed forever, but this life-changing event is not fatal, and one-day, you will awaken from this betrayal nightmare! I know you have many choices as to what books you read; I also know how desperate your search is as you try and find someone—something that will help make sense of your life right now. My hope for you is that you will find encouragement and healing in whatever resources you choose as you move forward on your healing journey.Patti Snodgrass",
  "genres": [],
  "author": "Patti Snodgrass",
  "average_rating": "3.81",
  "url": "https://www.goodreads.com/book/show/12185790-surviving-your-worst-nightmare"
}