{
  "title": "Serpent's Touch",
  "description": "The thing about fairy tales is, there's usually a catch. This one was no exception.  The day I, Lilith Palmer, stopped being the Hot Topic girl and became something else started as any other, but ended in the car of a devilishly handsome man whose net-worth was probably higher than the entire neighborhood I lived in; not my usual Tuesday night. That, however, was only the start of the weird path I was about to set off on; a path that would take me to a place where reality collides with magic, where I find out everything I knew about the world I lived in was a lie, and where I'm the only woman present.  There are five of them - five of the most interesting, sexy, and probably dangerous men I have ever met. They live in a mansion in the middle of rural Germany, a mansion protected by magic. And they tell me not only do they have supernatural abilities, but that I have them too, and they're here to help pull them out of me. Sounds like a dream, until that catch comes up.  Supernaturals are being hunted down for the energy they possess, myself especially, and if they don't act fast to bring me into the fold, a fate worse than death awaits all of us.  But triggering my supernatural side to come out won't be easy, not before I'm ready, and when the hunters step up their game and the window starts to close, it'll take everything I have in me just to stay alive; no matter how many men would put their lives on the line to protect me.  Serpent's Touch is the first book in a brand new paranormal REVERSE HAREM series by Tansey Morgan. If you love the paranormal romance and urban fantasy genres, and want to read something that not only straddles the line between both, but introduces not one, but five love interests, then this is the book for you.  Disclaimer: this book is part of a continuing series of novels, all which will follow the same arc over many books, but each which will tease into the next - expect to be left with questions at the end. As a reverse harem urban fantasy, you can expect there to be action, magic, intrigue, and multiple primary love interests. Sexual content will also form a part of this series, as will swearing and violence. If you're happy with all of this, then...",
  "genres": [
    "Reverse Harem",
    "Paranormal",
    "Fantasy",
    "Magic",
    "Romance",
    "Vampires",
    "Demons"
  ],
  "author": "Tansey Morgan",
  "average_rating": "3.71",
  "url": "https://www.goodreads.com/book/show/36353014-serpent-s-touch"
}