{
  "title": "Total Control",
  "description": "Once they were soldiers. Now they answer only to honor . . .\n \n \n The 11th Hour is made up of men and women who are no longer deemed fit to serve their country, but still need to fight a war. They work in shadows, keep their secrets—and follow their hearts . . .   Helicopter pilot Kellan Blake has always hated being told what to do, so being discharged from the army for insubordination doesn't come as much of a surprise. What does surprise him is that when he joins up with the elite, underground 11th Hour squad instead, they send him straight home. The nest of vipers that calls itself his family is the next target for the team’s tech unit, so he’ll either have to brave their traps and deceptions himself—or watch his sweet, shy friend Sabrina walk into them alone . . .   Sabrina’s no femme fatale, but since there's no one else with the tech skills to get the info they need, she’ll put on a party dress and take one for the team. But whoever decided she should pretend to be Kellan’s new fiancée hit a little too close to home. How can she concentrate on a dangerous mission when she's worried about giving away what she really feels for her loyal, passionate, smoking hot partner? At least she isn’t likely to blow their cover. Until she’s in the line of fire, and neither Kellan's demons nor his heart are hers to tame . . .   Praise for Jackie Ashenden’s Dirty for Me   “An intense scorcher of a story that is sure to delight fans and win her a legion of new devotees. . . . Unforgettable.” —RT Book Reviews, Top Pick  “Tension and heat pervade the frequent sex scenes . . . Readers will eagerly anticipate future installments in the series.” —Publishers Weekly    “Explosively sexy.”  —Heroes & Heartbreakers",
  "genres": [
    "Romance",
    "Military Fiction",
    "Military Romance",
    "Romantic Suspense",
    "Contemporary",
    "Adult",
    "Friends To Lovers"
  ],
  "author": "Jackie Ashenden",
  "average_rating": "3.88",
  "url": "https://www.goodreads.com/book/show/36349074-total-control"
}