{
  "title": "Burn The Evidence",
  "description": "Mixing business with family can be a murderous affair ...A body washes up on the beach near Ramsgate in the South of England. For Detective Sergeant Solomon Gray, the case appears cut and dried – the drowning of an immigrant. Another victim to the sea in his desperate attempt to reach the UK.As the tidewaters recede, two more corpses surface. One appears to also be a refugee, but he’s been stabbed to death. The other, Gray recognises immediately and Gray knows this means trouble. Because the corpse is the son of local business tycoon Jake Armitage, a man with a dark reputation and an ex-school friend of Gray’s.A post mortem reveals ligature marks on the son’s wrists and drugs in his bloodstream. All signs indicate murder. Armitage swears to track down his son's killer and avenge his death.Gray's investigation points to a deadly fire ten years prior, and soon Armitage comes under suspicion. But Gray knows what it's like to lose a child and puts aside his distrust of Armitage to help. How are the dead men connected to each other – and to the infamous fire? It's then that Gray gets another tip. On the whereabouts of his own missing son ...Set in the once grand town of Margate in the south of England, the now broken and depressed seaside resort becomes its own character in this dark detective thriller, perfect for fans of Ian Rankin, Stuart MacBride, and Peter James.Burn the Evidence is the second book in the series featuring Detective Sergeant Solomon Gray. Pick it up now to discover whether Gray can escape his past in this taut crime series.What Others Say\"Accomplished writing from one of the best authors in the UK.\"M.W. Craven, author of the Washington Poe series\"Keith Nixon is one hell of a writer.\"Ken Bruen, author of the Jack Taylor series\"... deeply emotional, a dark rollercoaster ride.\"Ed James, author of bestselling DI Fenchurch series\"Keith Nixon’s latest Solomon Gray murder mystery pushes all the hot button issues of a traumatised post-Brexit UK in this dark tale of loss, revenge and redemption. Flawed and floored by personal tragedy, DS Solomon Gray is ready to take his place alongside DS Logan McRae, DS Roy Grace and DCI John Luther. Modern jet-black Brit Noir at its best.\"Tim Baker, CWA shortlisted author of Fever CityWhat Readers Say\"I’m left with a thirst which can only be quenched by reading the next in the series.\"\"It’s not often I give 5* but I did with this one.\"\"A cracking multi-level read.\"\"Another great thriller.\"\"Loving this series. Sol is magnificent.\"\"Thoroughly enjoyable, I can’t wait for the next episode!\"\"A compelling murder mystery with a multilayered and engaging new hero. Great read.\"Mason Cross, author of the Carter Blake thriller series\"A damaged detective, haunted by a tragic past, a young son missing or dead, a man on a quest for redemption. Detective Sergeant Solomon Gray is a fine creation and Dig Two Graves an intriguing, nourish mystery. Keith Nixon is a sparkling crime fiction talent.\"Howard Linskey, author of the Detective Ian Bradshawcrime series\"A dark, uncompromising tale of loss, murder, and revenge. Glorious noir, which takes the police procedural elements and gives them new life. I can't wait to read the next step in Solomon Gray's journey for answers ...\"Luca Veste, author of the Murphy and Rossi crime series",
  "genres": [
    "Crime",
    "Detective",
    "Suspense",
    "Mystery",
    "Thriller"
  ],
  "author": "Keith Nixon",
  "average_rating": "4.02",
  "url": "https://www.goodreads.com/book/show/36347270-burn-the-evidence"
}