{
  "title": "Idiot Genius: Willa Snap and the Clockwerk Boy",
  "description": "\"What an absolutely mind-blowing, flame-throwing, steampunking adventure!!\" —T. CrumNational Indie Excellence Award ~ Winner for Juvenile Fiction / Independent Publisher Book Award ~ Medalist / International Rubery Book Award ~ ShortlistEver wonder why some crazy scientist hasn’t blown up the world? I used to wonder about it all the time. Actually, I was pretty sure my mom would be the one to do it.But now I know better. It turns out there’s a force working hard to keep the world from going KABLOOEY.Who are these people? Wait for it:Idiots. Yep, you heard me right.How do I know? Well, apparently, I’m an Idiot. At least, according to the Geniuses I am. Confused? I’m not surprised. You’re probably an Idiot too. Offended? You shouldn’t be—I called you an Idiot, not an idiot. There’s a difference, just as there’s a difference between a Genius and a genius. Confused and offended? It gets worse. There’s a third category: Idiot Genius. Those are the ones you really have to look out for. You see, Idiot Geniuses—for some unaccountable reason—are completely obsessed with \"improving\" the world. Maybe it’s encoded in their DNA. I don’t know. I didn’t get those genes. I have Idiot genes, which means that for an equally unaccountable reason, I’m obsessed with saving the world—usually from them.I must warn you, my story isn’t a pretty one: abductions, time-traveling dragons, the Order of the Black Fez, highly verbal cats, a secret invisible city, condescending robots (condescending means they talk to you like you’re an Idiot; wait, is it condescending of me to explain what condescending means?), and that’s just for starters. —Willa SnapPerfect for fans of The Mysterious Benedict Society, Percy Jackson, Neil Gaiman, and the Artemis Fowl series, this action-packed adventure will take you to places you've never imagined, but always wanted to visit.\"It's unusual to see such sci-fi depth and detail in a title directed to young adults, but this is precisely what makes Idiot Genius: Willa Snap and the Clockwerk Boy such an appealing production: the characterization is solid while its fantastic setting will intrigue ages well beyond its intended 9-12-year-old audience. Highly recommended for young adults seeking something compellingly different.\" -D. Donovan, Senior Reviewer, Midwest Book ReviewWhat fans are saying:\"There are plenty of books out there that I enjoy and find interesting, but rarely do I think while reading, ‘This is so much fun.’\"\"Willa Snap and the Clockwerk Boy is a gorgeously written book.\"\"Absolutely delightful read!\"\"I was hooked from the first paragraph.\"\"The story engages the imagination from the first page, and the writing is hilarious.\"\"Entertaining, engaging, fresh!\"\"Very cool, need more right now.\"\"What an absolutely mind blowing, flame throwing, steampunking adventure!!\"\"I would have adored it just as much at age twelve as I have enjoyed it now.\"\"I enjoyed the steady paced action that kept me turning pages until the end.\"\"We missed bed time plenty of times due to ‘just a few more pages!!’\"\"Arcabascio's delightful illustrations are a real treat; there should be more clock punk cats in the world.\"\"Your passport is ready. Click purchase, and be prepared as the Black Fezzes start to circle.\"\"It was a great way to introduce my daughter to the world of steampunk that I love so much!\"\"Amazing illustrations, even in the Kindle edition.”",
  "genres": [
    "Steampunk",
    "Fantasy",
    "Middle Grade",
    "Science Fiction",
    "Fiction",
    "Young Adult",
    "Adventure"
  ],
  "author": "Richard Due",
  "average_rating": "4.27",
  "url": "https://www.goodreads.com/book/show/36354013-idiot-genius"
}