{
  "title": "Devil at My Heels: A Heroic Olympian's Astonishing Story of Survival as a Japanese POW in World War II",
  "description": "The inspirational and extraordinarymemoir of one of the most courageous of the greatest generation, Louis Zamperini: Olympian, WWII Japanese POW and survivor.A juvenile delinquent, a world class NCAA miler, a 1936 Olympian, a WWII bombardier: Louis Zamperini had a fuller than most, when it changed in an instant. On May 27, 1943, his B–24 crashed into the Pacific Ocean. Louis and two other survivors found a raft amid the flaming wreckage and waited for rescue. Instead, they drifted two thousand miles for forty–seven days. Their only food: two shark livers and three raw albatross. Their only water: sporadic rainfall. Their only companions: hope and faith–and the ever–present sharks. On the forty–seventh day, mere skeletons close to death, Zamperini and pilot Russell Phillips spotted land–and were captured by the Japanese. Thus began more than two years of torture and humiliation as a prisoner of war.Zamperini was threatened with beheading, subject to medical experiments, routinely beaten, hidden in a secret interrogation facility, starved and forced into slave labour, and was the constant victim of a brutal prison guard nicknamed the Bird–a man so vicious that the other guards feared him and called him a psychopath. Meanwhile, the Army Air Corps declared Zamperini dead and President Roosevelt sends official condolences to his family, who never gave up hope that he was alive.Somehow, Zamperini survived and he returned home a hero. The celebration was short–lived. He plunged into drinking and brawling and the depths of rage and despair. Nightly, the Bird's face leered at him in his dreams. It would take years, but with the love of his wife and the power of faith, he was able to stop the nightmares and the drinking.A stirring memoir from one of the greatest of the \"Greatest Generation,\" DEVIL AT MY HEELS is a living document about the brutality of war, the tenacity of the human spirit, and the power of forgiveness.",
  "genres": [
    "Nonfiction",
    "History",
    "Biography",
    "Memoir",
    "War",
    "World War II",
    "Autobiography"
  ],
  "author": "Louis Zamperini",
  "average_rating": "4.36",
  "url": "https://www.goodreads.com/book/show/363498.Devil_at_My_Heels"
}