{
  "title": "Charlie Hernández and the League of Shadows",
  "description": "The Lightning Thief meets the Story Thieves series in this middle grade fantasy inspired by Hispanic folklore, legends, and myths from the Iberian Peninsula and Central and South America.Charlie Hernández has always been proud of his Latin American heritage. He loves the culture, the art, and especially the myths. Thanks to his abuela’s stories, Charlie possesses an almost encyclopedic knowledge of the monsters and ghouls who have spent the last five hundred years haunting the imaginations of children all across the Iberian Peninsula, as well as Central and South America. And even though his grandmother sometimes hinted that the tales might be more than mere myth, Charlie’s always been a pragmatist. Even barely out of diapers, he knew the stories were just make-believe—nothing more than intricately woven fables meant to keep little kids from misbehaving.But when Charlie begins to experience freaky bodily manifestations—ones all too similar to those described by his grandma in his favorite legend—he is suddenly swept up in a world where the mythical beings he’s spent his entire life hearing about seem to be walking straight out of the pages of Hispanic folklore and into his life. And even stranger, they seem to know more about him than he knows about himself.Soon, Charlie finds himself in the middle of an ancient battle between La Liga, a secret society of legendary mythological beings sworn to protect the Land of the Living, and La Mano Negra (a.k.a. the Black Hand), a cabal of evil spirits determined to rule mankind. With only the help of his lifelong crush, Violet Rey, and his grandmother’s stories to guide him, Charlie must navigate a world where monsters and brujas rule and things he couldn’t possibly imagine go bump in the night. That is, if he has any hope of discovering what’s happening to him and saving his missing parents (oh, and maybe even the world).No pressure, muchacho.",
  "genres": [
    "Fantasy",
    "Middle Grade",
    "Mythology",
    "Adventure",
    "Fiction",
    "Young Adult",
    "Audiobook"
  ],
  "author": "Ryan Calejo",
  "average_rating": "3.94",
  "url": "https://www.goodreads.com/book/show/36347821-charlie-hern-ndez-and-the-league-of-shadows"
}