{
  "title": "Fever",
  "description": "A stunning standalone from a master of suspense, a compelling story of survival and betrayal set in a world after 'The Fever'.Nico Storm and his father Willem drive a truck filled with essential supplies through a desolate land. They are among the few in South Africa - and the world, as far as they know - to have survived a devastating virus which has swept through the country. Their world turned upside down, Nico realises that his superb marksmanship and cool head mean he is destined to be his father's protector, even though he is still only a boy.But Willem Storm, though not a fighter, is both a thinker and a leader, a wise and compassionate man with a vision for a new community that survivors will rebuild from the ruins. And so Amanzi is founded, drawing Storm's 'homeless and tempest-tost' - starting with Melinda Swanevelder, who they rescued from brutal thugs, Hennie Flaai, with his vital Cessna plane, Beryl Fortuin with her ragtag group of orphans and Domingo, the man with the tattooed hand. And then there is Sofia Bergman, the most beautiful girl that Nico has ever seen, who changes everything. So the community grows - and with each step forward, as resources increase, so do the challenges they must face - not just from the attacks of biker brigands, but also from within...Nico will find experience hardship and heartbreak and have his loyalty tested to its limits as he undergoes an extraordinary rite of passage in this new world. Looking back as he writes in memoirs later in life, he recounts the events that led to the greatest rupture of all - the murder of his father.Internationally bestselling crime writer Deon Meyer has delivered a gripping epic like nothing else he has written before, yet still with that consummate skill to make you care about his characters, and to keep the pages turning, breathless with anticipation - and surprise at its twists.",
  "genres": [
    "Fiction",
    "Science Fiction",
    "Thriller",
    "Post Apocalyptic",
    "Dystopia",
    "Africa",
    "Apocalyptic"
  ],
  "author": "Deon Meyer",
  "average_rating": "4.29",
  "url": "https://www.goodreads.com/book/show/36345798-fever"
}