{
  "title": "The Next Door Raghu",
  "description": "'The Next Door Raghu' is a children's adventure and fun and frolic story and is loosely based on, and is reminiscent of my own school days at Ispat English Medium School, Rourkela (Referred to as Public School by Rourkelites)Since the book is set in Rourkela, and the period is the seventies, some of you may find some of the contents as being too esoteric, exotic, and strange. But all the same, reading this book will be a great opportunity for you to get to know a culture that is totally different and alien to yours. If a fun-filled, rollicking, and hilariously funny children's adventure book is your idea of a great read, \"The Next Door Raghu\" by yours truly is RIGHT UP YOUR ALLEY!. Please hit the following link to start reading the book for free.http://amzn.in/euoaoMO‘The Next Door Raghu’ is the story of the extraordinary feats of a very ordinary, reticent, and apparently dull child, by the name of Raghu. Raghu has a lower-middle-class parental background and is frowned upon by the society as a dimwit who is not going to be of any consequence in his life. The little child and his perceived as unfortunate parents are often the butts of jokes and snide remarks by an acerbic and sadistic society that has almost written off the disingenuous child. Raghu also starts to believe in his detractors and thinks that he really is inferior and substandard. But, Raghu tries to underplay and overcome all his shortcomings by latching onto children, who he feels can make up for his lacunae. As life goes on for the unassuming, but wily and scheming little child, he discovers a few gifts from God that he is blessed with, that sets him apart from the rest of the world. Although still humble and unassuming, the little child uses his special gifts to save the lives and the property of the people of his town, namely Rourkela in Odisha, India, on two occasions, thereby catapulting the once ugly duckling of the town into superstardom. Raghu becomes a national and international celebrity, much to the joy of his supporters, and much to the chagrin of his detractors and doubters. The rollicking adventure story of the little child and his band of faithful and intrepid friends, is very intriguing, inspirational, entertaining, and also tremendously funny and hilarious, and should appeal to people of all age groups. It should be a treat for children, and also adults interested in some wholesome and entertaining literature.",
  "genres": [],
  "author": "Biju Vasudevan",
  "average_rating": "4.20",
  "url": "https://www.goodreads.com/book/show/36356880-the-next-door-raghu"
}