{
  "title": "The Undoing of Thistle Tate",
  "description": "Famous teen author Thistle Tate struggles to keep her biggest secret: the real identity of the author of her bestselling books.\nThistle Tate is a glittering wunderkind--only seventeen, and a bestselling author of the wildly successful Lemonade Skies series, with the highly anticipated final book due to publish next year. She has diehard fans across the globe, flashy tours, and steep advances. And now she's finally started to date her best friend and next-door-neighbor, Liam, the only one who knows her deep dark secret: she's not the real author of the Lemonade Skies books.Thistle's guilt about lying intensifies after she meets the surprisingly charming Oliver, who introduces her to his super-fan little sister--but how can she have friendships based on deception? All she wants is for this last book to be written so she can be done with the ruse for good.Then with just two weeks left to deliver the manuscript to her agent and editor, a dramatic turn of events puts everything in jeopardy, and Thistle must grapple with her own identity. Is she a victim, a fraudster, or both? On top of that, Liam is increasingly jealous of Thistle's budding friendship with Oliver--a friendship that leaves Thistle more than a little confused about her own heart.As the book deadline looms closer, the stakes ever higher, a startling family truth comes to light, and it's only a matter of time before something gives--and Thistle's world becomes undone.For fans of Rainbow Rowell and E. Lockhart, this YA is the perfect summer read for teen bookworms everywhere, with a love triangle, an insider's depiction of the publishing world, and nonstop, page-turning action.",
  "genres": [
    "Young Adult",
    "Contemporary",
    "Romance",
    "Realistic Fiction",
    "Fiction",
    "Family",
    "Grief"
  ],
  "author": "Katelyn Detweiler",
  "average_rating": "3.56",
  "url": "https://www.goodreads.com/book/show/36354874-the-undoing-of-thistle-tate"
}