{
  "title": "Three to Kill",
  "description": "Businessman Georges Gerfaut witnesses a murder—and is pursued by the killers. His conventional life knocked off the rails, Gerfaut turns the tables and sets out to track down his pursuers. Along the way, he learns a thing or two about himself. . . . Manchette—masterful stylist, ironist, and social critic—limns the cramped lives of professionals in a neoconservative world.\"Manchette has appropriated and subverted the classic thriller [with] descriptions of undiluted action, violence and suspense [and] a perspective on evil, a disenchanted world of manipulation and fury . . . .\" —Times Literary Supplement\"The petty exigencies of the classic thriller find themselves summarily reduced to cremains by the fiery blue jets of Jean-Patrick Manchette's concision, intelligence, tension, and style.\" —Jim Nisbet, author of Lethal Injection and Prelude to a Scream\"Manchette is a must for the reading lists of all noir fans. . . . Manchette deserves a higher profile among noir fans.\" —Publishers Weekly\"Manchette . . . performs miracles within this simple story. His style is very matter of fact, stark and almost cool like the jazz his hero or anti-hero Gerfaut devours at every opportunity. Yet in this short novel there is no lack of atmosphere, excitement, characters or descriptive writing, it is just the total lack of unnecessary material that makes the story seem so lean and mean.\" —Norman Price, EuroCrime\"A social satire cum suspense equally interested in dissecting everyday banalities and manufacturing thrills. Writing with economy, deadpan irony, and an eye for the devastating detail, Manchette spins pulp fiction into literature.\" —Kirkus Reviews\"While there isn’t much that’s obviously moral—in the good-versus-evil sense—[this novel] demonstrate[s] why Manchette is hailed as the man who kicked the French crime novel or “polar” out of the apolitical torpor into which it had fallen by the time he started publishing his “neo-polars” in the 1970s. . . . Grim and cerebral as they feel, it’s remarkable how comic—in an absurdist, laugh-or-you’ll-cry way—these books are, as if Manchette had decided that poking fun at the products of the capitalist system were the fittest way to attack the system itself.\" —Jennifer Howard, Boston Review\"The pace is fast, the action sequences are superb, and the effect is just as striking as it must have been when the book was first published in 1976.\" —Laura Wilson, The Guardian\"[T]he novel is brilliantly written, replete with allusions to art, literature, and music, papered with the very texture and furniture of our lives. Manchette is Camus on overdrive, at one and the same time white-hot, ice-cold. He deserves much the same attention.\" —James Sallis, Review of Contemporary FictionJean-Patrick Manchette (1942—1995) rescued the French crime novel from the grip of stodgy police procedurals — restoring the noir edge by virtue of his post-1968 leftism. Today, Manchette is a totem to the generation of French mystery writers who came in his wake. Jazz saxophonist, political activist, and screen writer, Manchette was influenced as much by Guy Debord as by Gustave Flaubert. City Lights has published more of work, including The Gunman.",
  "genres": [
    "Noir",
    "Crime",
    "Fiction",
    "France",
    "Mystery",
    "Thriller",
    "French Literature"
  ],
  "author": "Jean-Patrick Manchette",
  "average_rating": "3.88",
  "url": "https://www.goodreads.com/book/show/363655.Three_to_Kill"
}