{
  "title": "Closing The Circle",
  "description": "PRAISE FOR CLOSING THE CIRCLE“Scary and bloody... don't read this late at night unless you want to have trouble sleeping.”Closing the Circle is a story of religion and belief turned inside out in the service of a broken mind, where the pure tenets of the Wiccan faith are contorted into justification for murder.“AN' IT HARM NONE, DO AS YE WILL.”In the dark places of San Francisco, a serial killer has chosen to ignore the words of the Wiccan Rede. It begins with one body, then two, then three, and the murders become more ritualistic and brutal with every new victim. Each one is burned, tortured, and discarded like so much trash, with runes and symbols carved into their naked, bloodless corpse. Each one is dumped out of sight, only to be found by chance by an unlucky bystander. Each one is connected to the object of the killer's desire: Felicity Armstrong, a believer in Wicca horrified at the perversion of her religion.Only Sam Barton of the FBI stands between her and her pagan stalker. With his leave in San Francisco prematurely canceled, his task is to protect Felicity and find the murderer before everyone around her dies. In spite of the dire circumstances, and in spite of Sam's natural suspicion and training, they are instantly drawn to one another - but if he gets too close, it may be his mutilated body that turns up in the morgue.The killer seems to defeat them at every turn. Cryptic notes reveal the depths of an obsessive, twisted mind that has latched onto Felicity as the incarnation of a pagan Goddess, and made a cruel mockery of all that she holds dear. Every slight to her, both real and imagined, must be punished with death. Every one of her friends, her employees at her temp agency, and even strangers who come into contact with her by chance are in danger of being singled out and murdered.The festival of Mabon approaches, and with it, the final sacrifice. The killer has a plan for the Goddess, and a spell that will bind her earthly aspect forever. The circle is open, waiting only for the last victim in order to complete the ritual. And if Sam cannot save her, Felicity will be trapped inside.",
  "genres": [],
  "author": "P.A.  Wilson",
  "average_rating": "4.29",
  "url": "https://www.goodreads.com/book/show/12187451-closing-the-circle"
}