{
  "title": "Since the Glare: Susan's Journal",
  "description": "A must-read companion book for The Glare series!Susan and her young son may die soon. Very soon.Susan is blind in the glare that's caused the apocalypse, and the entries in her journal capture the terror of the first days and weeks after the glare strikes. Susan pours her hopes and fears into her journal, exposing details about living through the glare that only the blind are privy to.This book follows entire series. You don't want to miss Susan's perspective of life in the glare!Pick up a copy of this exciting page-turner today!This book follows The Glare series, and it exposes details about living through the apocalypse that other characters are unaware of. You don’t want to miss Susan’s perspective on life in the glare!AUTHOR INTERVIEW This book, Since the Susan’s Journal, is the first companion book for The Glare series. What does this story add to the series? In other words, why should readers pick up a copy? This book covers the events from all three books in The Glare series—but shows them from Susan’s perspective. And since she’s an adult (and blind in the glare as well), her perspective of life after the glare is very different from Jenna’s. In addition, since she’s stuck inside because of the glare, she gets to know the other blind characters far better than Jenna. Who would enjoy this story? Anyone who’s read The Glare series will enjoy this book. Those who are fascinated with the psychology and sociology of human existence and the social constructs that come with human societies will also enjoy this book. There’s another companion book for this series (Before the Glare). Is there a suggested order for reading these companion books? No, not really. I usually list Since the Susan’s Journal first, in part because it was written before the other companion book, and also because it might be easier for readers to compare Susan’s perspective to Jenna’s version of events in the series. ( Before the Glare is a novel-length collection of short stories about many of the characters from the series.)",
  "genres": [],
  "author": "Anissa Stringer",
  "average_rating": "4.33",
  "url": "https://www.goodreads.com/book/show/36360911-since-the-glare"
}