{
  "title": "Pure: Inside the Evangelical Movement That Shamed a Generation of Young Women and How I Broke Free",
  "description": "From a woman who has been there and back, the first inside look at the devastating effects evangelical Christianity’s purity culture has had on a generation of young women—in a potent combination of journalism, cultural commentary, and memoir.In the 1990s, a “purity industry” emerged out of the white evangelical Christian culture. Purity rings, purity pledges, and purity balls came with a dangerous girls are potential sexual “stumbling blocks” for boys and men, and any expression of a girl’s sexuality could reflect the corruption of her character. This message traumatized many girls—resulting in anxiety, fear, and experiences that mimicked the symptoms of Post-Traumatic Stress Disorder—and trapped them in a cycle of shame.This is the sex education Linda Kay Klein grew up with.Fearing being marked a Jezebel, Klein broke up with her high school boyfriend because she thought God told her to, and took pregnancy tests though she was a virgin, terrified that any sexual activity would be punished with an out-of-wedlock pregnancy. When the youth pastor of her church was convicted of sexual enticement of a twelve-year-old girl, Klein began to question the purity-based sexual ethic. She contacted young women she knew, asking if they were coping with the same shame-induced issues she was. These intimate conversations developed into a twelve-year quest that took her across the country and into the lives of women raised in similar religious communities—a journey that facilitated her own healing and led her to churches that are seeking a new way to reconcile sexuality and spirituality.Sexual shame is by no means confined to evangelical culture; Pure is a powerful wake-up call about our society’s subjugation of women.",
  "genres": [
    "Nonfiction",
    "Religion",
    "Memoir",
    "Feminism",
    "Sexuality",
    "Christian",
    "Audiobook"
  ],
  "author": "Linda Kay Klein",
  "average_rating": "4.17",
  "url": "https://www.goodreads.com/book/show/36373587-pure"
}