{
  "title": "Red Card: How the U.S. Blew the Whistle on the World's Biggest Sports Scandal",
  "description": "The definitive, shocking account of the FIFA scandal—the biggest international corruption case of recent years, spearheaded by US investigators, involving dozens of countries, and implicating nearly every aspect of the world’s most popular sport, soccer, including its biggest event, the World Cup.The FIFA case began small, boosted by an IRS agent’s review of an American soccer official’s tax returns. But that humble investigation eventually led to a huge worldwide corruption scandal that crossed continents and reached the highest levels of the soccer’s world governing body in Switzerland.In Red Card , Ken Bensinger explores the case, and the personalities behind it, in vivid detail. There’s Chuck Blazer, a high-living soccer dad who ascended to the highest ranks of the sport while creaming millions from its coffers; Jack Warner, a Trinidadian soccer official whose lust for power was matched only by his boundless greed; and the sport’s most powerful man, FIFA president Sepp Blatter, who held on to his position at any cost even as soccer rotted from the inside out.Remarkably, this corruption existed for decades before American law enforcement officials began to secretly dig, finally revealing that nearly every aspect of the planet’s favorite sport was corrupted by bribes, kickbacks, fraud, and money laundering. Not even the World Cup, the most-watched sporting event in history, was safe from the thick web of corruption, as powerful FIFA officials extracted their bribes at every turn. Arriving just in time for the 2018 World Cup, Red Card goes beyond the headlines to bring the real story to light, accompanying the determined American prosecutors and special agents who uncovered what proved to be not only the biggest scandal in sports history, but one of the biggest international corruption cases ever. And it is far from over.",
  "genres": [
    "Sports",
    "Nonfiction",
    "Soccer",
    "True Crime",
    "Football",
    "History",
    "Crime"
  ],
  "author": "Ken Bensinger",
  "average_rating": "4.07",
  "url": "https://www.goodreads.com/book/show/36373561-red-card"
}