{
  "title": "Paul Simon: The Life [Deckle Edge]",
  "description": "A publishing event from music legend Paul an intimate, candid, and definitive biography written with Simon’s full participation—but without his editorial control—by acclaimed biographer and music writer Robert Hilburn.For more than fifty years, Paul Simon has spoken to us in songs about alienation, doubt, resilience, and empathy in ways that have established him as one of the most beloved artists in American pop music history. Songs like “The Sound of Silence,” “Bridge Over Troubled Water,” “Still Crazy After All These Years,” and “Graceland” have moved beyond the sales charts and into our cultural consciousness. But Simon is a deeply private person who has resisted speaking to us outside of his music. He has said he will not write an autobiography or memoir, and he has refused to talk to previous biographers.Finally, Simon has opened up—for more than one hundred hours of interviews—to Robert Hilburn, whose biography of Johnny Cash was named by Michiko Kakutani of the New York Times as one of her ten favorite books of 2013. The result is a landmark book that will take its place as the defining biography of one of America’s greatest artists.It begins in Kew Gardens Hills, Queens, where, raised by a bandleader father and schoolteacher mother, Simon grew up with the twin passions of baseball and music. The latter took over at age twelve when he and schoolboy chum Art Garfunkel became infatuated with the alluring harmonies of doo-wop. Together, they became international icons, and then Simon went on to even greater artistic heights on his own. But beneath the surface of his storied five-decade career is a roller coaster of tumultuous personal and professional ups and downs. From his remarkable early success with Garfunkel to their painfully acrimonious split; from his massive early hits as a solo artist to the wrenching commercial failures of One-Trick Pony and Hearts and Bones ; from the historic comeback success of Graceland and The Rhythm of the Saints to the star-crossed foray into theater with The Capeman and a late-career creative resurgence—his is a musical life unlike any other.Over the past three years, Hilburn has conducted in-depth interviews with scores of Paul Simon’s friends, family, colleagues, and others—including ex-wives Carrie Fisher and Peggy Harper, who spoke for the first time—and even penetrated the inner circle of Simon’s long-reclusive muse, Kathy Chitty. The result is a deeply human account of the challenges and sacrifices of a life in music at the highest level. In the process, Hilburn documents Simon’s search for artistry and his constant struggle to protect that artistry against distractions—fame, marriage, divorce, drugs, record company interference, rejection, and insecurity—that have derailed so many great pop figures.Paul Simon is an intimate and inspiring narrative that helps us finally understand Paul Simon the person and the artist. “With train-wreck moments and tender interludes alike, it delivers a sharply detailed Kodachrome of a brilliant musician” ( Kirkus Reviews ).",
  "genres": [
    "Biography",
    "Music",
    "Nonfiction",
    "Audiobook",
    "Biography Memoir",
    "Pop Culture",
    "History"
  ],
  "author": "Robert Hilburn",
  "average_rating": "3.95",
  "url": "https://www.goodreads.com/book/show/36373611-paul-simon"
}