{
  "title": "Scavenger Reef",
  "description": "When Augie Silver disappeared at sea during a sudden storm, it was a loss felt initially by his young wife and by his crew of drinking cronies. When word of his apparent drowning extended beyond the Key West world Augie had made his home, however, his loss was felt by a greater number of people. For Augie Silver was a painter, or more precisely an artist, waiting for recognition. And his death proved to be the event necessary to turn a lifetime of eccentricity into a career of genius. Suddenly Augie was hot. While his wife, Nina, continued to mourn, his friends began to awaken to the realization that all those paintings Augie had given them over the years might have been worth holding on to. In fact, according to the New York art dealer who was also Augie's agent, they might be worth a whole lot. So when Augie returns from the \"dead,\" having been shipwrecked on an island off Cuba, it is with somewhat mixed emotions that he is welcomed home. His wife is jubilant, but all those who had read dollar signs in Augie's obituary aren't too sure how happy they are to have him back, especially since each of them seems to need an influx of cash in the worst way. And when mysterious things start happening to Augie, little \"accidents\" that seem less than accidental, he's not too sure how happy he is to be back either. With the help, however, of his wife and their fiercely loyal houseboy, Reuben the Cuban, Augie fights for his life a second time around while seeking out the would-be killer. From the author of Florida Straits, a critically acclaimed story of suspense also set in Key West, Scavenger Reef is a funny, dark, and vastly entertaining novel all about life, death, and the stages in between, written with wit and charm, and filled with unforgettable characters.",
  "genres": [
    "Fiction",
    "Mystery",
    "Humor",
    "Crime",
    "Audiobook",
    "Suspense",
    "Comedy"
  ],
  "author": "Laurence Shames",
  "average_rating": "3.99",
  "url": "https://www.goodreads.com/book/show/363675.Scavenger_Reef"
}