{
  "title": "The Girl Who Could Read Hearts",
  "description": "UPLIFTING & INSPIRATIONAL ─ 16 Awards ─ \"An incredible experience that embraces love, faith, joy, sadness, imagination, and hope\" . Inspired by a vivid dream with the author's deceased sister. \"Riveting.\" Kate is born gifted with a 7th sense ─ the ability to read human hearts coupled with keen intuition . She struggles to understand her premonitions while surrounded by skeptical family members and their secrets. A suspense-filled family storyline, set in the San Francisco Bay Area, with an electrifying finish. Intrigued by the afterlife, the power of intuition & prayer miracles, angels, souls? \"Your heart goes on a roller coaster ride\" . Is Kate psychic? A medium? An empath? Simply intuitive? Empowered by Angels? This spell-binding novel blends autobiographical fact and narrative fiction straight from the author's heart. Intuitive individuals and empaths resonate with this book. \"Amazing\". If you enjoy Sue Monk Kidd, Mitch Albom, Max Lucado,Jeffrey McClain Jones, Paulo Coelho, Lorna Byrne, Brian Weiss, Lisa Wingate, orOprah, or mystical stories like The Shack and The Alchemist, you'll becaptivated.The segments of this story that embrace death are drawn from Sherry's real-life experiences when she was present with beloved family members as they passed away. Her wondrous encounters of loved ones' spirits after their physical deaths are deeply engaging. This tantalizing novel percolates with subtle wisdom that is inspirational, transformational, and healing. \"A breath of fresh, clean air...\" \"Intriguing characters\" \"... a page turner\" This inspirational book explores issues relevant to today's societal woes : prejudice, abuse, eating disorders, and limiting belief systems. It delves into the mysteries of death and of angels, intuition, finding God in all, and true love. Full of spirit, it brims with inspiration, daring, hope, and the importance of following our dreams. \"This book is phenomenal . If you are someone who is intuitive, this is the book for you... I couldn't put this book down... one I will read again and again.\" ─ Anna Blackard, 5-stars, Amazon Reviewer ─ SHOULD YOU BE LISTENING TO YOUR INTUITION, YOUR HEART? ─ \"Truly a page-turner, engaging the reader from the first page until the last.\" ─ Deborah Lloyd, 5-Stars, Readers' Favorite Reviewer, International Gold Medal \" This book weaves spiritual, mystical, and experiential themes into the most compelling family storyline ever...\" ─ Dr. John Horn, Retired Superintendent, Mesquite ISD \" A moving, memorable story that combines spiritual reflections with a myriad of social, political and personal conflicts... a highly recommended, evocative read.\"─ D. Donovan, Midwest Book Review",
  "genres": [
    "Fiction"
  ],
  "author": "Sherry Maysonave",
  "average_rating": "4.14",
  "url": "https://www.goodreads.com/book/show/36375929-the-girl-who-could-read-hearts"
}