{
  "title": "Circus Freak",
  "description": "Step into the madness…  My name is Samantha. In theory, or Hebrew or even Aramaic it means “God heard” or “Listener.” Epic, really, considering I’ve never believed in God and that I’d rather poke my ear drums out with dull spoons than listen to the daily yammering around this place. I’ve never been a listener. Truth is, I take after my mother, who’d also rather be on stage. I guess that comes natural when you grow up as a side show act in a freaky-assed carnival. But I’m getting ahead of myself.  People call me Cat, and, yes, with a C, not a K. Cat as in feline. Of course, I set myself up for that with 29 cat tattoos and the three Sphynx princesses who live with me in my trailer – the same rusted thing I travel in as we move from town to town with the carnival no one can seem to get enough of. Their names are Prune, Pixie and Penelope because I have a thing for P’s. Truthfully, they get me through long and smelly days of people gawking at 3-feet-six-inch tall freaky me. Secretly, I like it that people stare at them too. It takes the attention off my vertical challenges and secret-keeping black eyes.  It’s not that I don’t enjoy being the center of attention from time to time. I mean, I do. I just don’t like it for the wrong reasons – like my missing hand from the idiot who thought she was cute on the Ferris wheel when I was two. I sort of have a lot to hide. We’d best start with the things I can tell you about – the same things you probably paid to see. I have two belly-button piercings – one on the top and one on the bottom. Sometimes, I run string through the hoops and tie them together when I’m bored. The feline princesses like to bat at them and I enjoy the pain of it.  I travel around the travelling circus on a mini-bike. Apparently, it’s quite a sight to see. If anyone bothered to ask me about dreams of mine, I’d say I’d wish to grow tall to buy a Harley and get the hell out of here. But that isn’t going to happen and I’m a realist. Still, I like being able to ride the bike around. It saves me from being tripped over or stepped on by giant cotton-candy grubbing monsters who refuse to look down because God-forbid there’s a freak circus in town. Either way? I can promise you one thing: Everything is about to change. I refuse to spend even one more day as an ordinary circus freak…",
  "genres": [],
  "author": "Erin Lee",
  "average_rating": "4.58",
  "url": "https://www.goodreads.com/book/show/36374757-circus-freak"
}