{
  "title": "A Dragon's Family Album II: A Collection of the Elder Races",
  "description": "From New York Times and USA Today bestselling author Thea Harrison…  This book contains Dragos Goes to Washington, Pia Does Hollywood, and Liam Takes Manhattan (two novellas and a short story in the Elder Races series, previously published separately). All three stories focus on the Cuelebres, the First Family of the Wyr.  Dragos Goes to Washington… Dragos Cuelebre, Lord of the Wyr, needs to throw a party without maiming anyone. That isn’t exactly as easy as it might sound. After the destructive events of the last eighteen months, the Elder Races are heading to Washington D.C. to foster peace with humankind. Not known for his diplomacy skills, Dragos must rely on his mate Pia to help navigate a battlefield of words and polite smiles rather than claws. With Dragos’s mating instinct riding close to the surface, his temper is more volatile than ever and the threat of violence hovers in the air.  Pia Does Hollywood… After making a diplomatic pact with humankind and the other leaders of the Elder Races, Pia Cuelebre, mate to Dragos Cuelebre, Lord of the Wyr, reluctantly heads to Hollywood to spend a week with the Light Fae Queen, Tatiana, before the busy Masque season hits New York in December. Dragos has never let the lack of an invitation stop him from doing anything he wanted. Unwilling to let his mate make the trip without him, he travels to southern California in secret to be with her. But when an ancient enemy launches a shattering assault against the Light Fae, Dragos and Pia must intercede. The destruction threatens to spread and strike a mortal blow against all of the magically gifted, both human and Elder Race alike.  Liam Takes Manhattan… Reeling from a deep loss, the magical prince of the Wyr, Dragos and Pia’s son Liam Cuelebre, turns inward and withdrawn as he struggles to come to terms with who he is, along with the challenges that lie before him. Hoping to ease his heartache and offer comfort, a concerned Dragos and Pia offer him a gift, something he has desired for a long time. Liam’s response has a ripple effect across all of New York. Soon miracles of all kinds start arriving just in time for Christmas, along with a visit from a mysterious person who gives Liam hope and a vision of his future.   Liam Takes Manhattan contains a major spoiler from Shadow’s End (book #9, released December 1st, 2015). If readers do not want to be spoiled, they should read the stories in order of their release dates.",
  "genres": [
    "Romance",
    "Fantasy",
    "Paranormal Romance",
    "Dragons",
    "Paranormal",
    "Shapeshifters",
    "Magic"
  ],
  "author": "Thea Harrison",
  "average_rating": "4.36",
  "url": "https://www.goodreads.com/book/show/36381599-a-dragon-s-family-album-ii"
}