{
  "title": "Twilight Rising, Serpent's Dream",
  "description": "The young shari'a witch Brierley once thought that she was the last of her kind, powerful witches who lived in peace and harmony, using their powers for good. Only the women of her people had the gift and they ruled wisely and well. Her people had flourished for millennia, guided by the elemental beings who embodied the very forces of nature and who could tame the world.But then the fierce Allemani people came from beyond the sea. Newly settled in the land, they at first dwelt in peace with the shari'a. But trust turned to hate and the fear that the Allemani had for the witches soon boiled over into genocide. The Allemani decimated the shari'a out of fear of their differences.And so Briarly hid in the shadows, keeping her healing powers a secret-but she was compelled to use them when necessary, and these actions caused her to be discovered. When she was forced to flee the only home she had ever known, she did not go alone, for she had captured the heart of Duke Melfallan, and though he is Allemani, he vows to attempt to change the Law condemning any shari'a to death because he has come to know that the shari'a are not monsters...and they can bring a great joy to the world.As she makes her way out into the world to hide while Melfallan fights to save her, Brierley discovers that she is not the last of her kind. That there are many, like her, who managed to stay in the shadows, generations of shari'a who have kept quiet, hid their powers and have waited. And that not all of whom share Brierley's good heart.The time of reckoning is at hand, the forces that the shari'a once controlled are being summoned once more, and Brierley finds that the hatred that fueled the Allemani ages past is still very much alive.Will Brierley have to sacrifice her life (and that of her unborn child) to save an entire world and make things right for her people?",
  "genres": [
    "Fantasy",
    "Fiction",
    "Adult",
    "Science Fiction Fantasy"
  ],
  "author": "Diana Marcellas",
  "average_rating": "3.99",
  "url": "https://www.goodreads.com/book/show/363843.Twilight_Rising_Serpent_s_Dream"
}