{
  "title": "The Untold Tales of Dolly Williamson: An Occult Steampunk Thriller: Prequel to The Guild Chronicles",
  "description": "No one deserves to die that way, not even London's most prosperous banker.Adolphus \"Dolly\" Williamson, an inspector in the Metropolitan Police, is called to the home of merchant banker Sir Francis Chilton. The condition of the body and lack of clues leaves him no choice but to call for the only person he trusts when it comes to the supernatural - Sister Rose.Abandoned by her Church and shunned by society, Rose's metaphysical experiments are the only way to follow the trail of the murderer.As the duo chases clues more of London's High Society turn up dead. What secret is behind the death of London's elite?  Are they victims or willing participants in an occult ritual?Rose soon discovers that the murderer might be her best friend's chance of being freed from insanity-inducing possession. Before Dolly claps on the irons, Rose must learn this secret ritual, even if the cost is her soul. Can an ornery detective and an ostracized nun stop the killing spree? Pick up the first book in the four-book Guild Chronicle series introduces you to the plot twists and the eclectic characters of JM Bannon. Next thing you'll know you'll be putting down book four.The reviews are in…My first read from author J.M. Bannon, the prequel to the new Guild Chronicles Steampunk series. Reminiscent of Arthur Conan Doyle's Sherlock Holmes stories, not as steampunk as most steampunk stories I've read, none the less a highly entertaining enjoyable read that I will revisit in the ensuing Guild Chronicles stories. Memorable, likable main characters. – Roger FFirst time reading a steampunk style occult alternative thriller. Lol I loved it, and the author takes you into their world and makes you think and wonder about what's happening. Looking forward to reading more of the adventures of this author.  – Linda WI really enjoyed the characters and the refreshing new look at 19th century London as a steampunk setting. I can see this as a potential movie plot with Benedict Cumberbatch, Martin Freeman, Rachel Wietz, and Angela Bassett. – Chris A.It's time for you to cross the aether and become immersed in the adventure and thrills.",
  "genres": [
    "Steampunk",
    "Fantasy",
    "Science Fiction Fantasy",
    "Paranormal"
  ],
  "author": "J.M. Bannon",
  "average_rating": "3.97",
  "url": "https://www.goodreads.com/book/show/36379333-the-untold-tales-of-dolly-williamson"
}