{
  "title": "Young Forever",
  "description": "“[A] gruesomely realistic thriller...saturated in steamy erotica” —Grady Harp, Amazon Top 100 ReviewerCold-hearted murder and smoldering hot sex explode in this fluid-drenched erotic gay mystery about a blossoming new romance and a youth-obsessed serial killer.Gay men are mysteriously disappearing from the city of Nashville. There are no bodies, no evidence of a crime, and police are turning a blind eye to the pattern. But this is the South, where juicy gossip and sordid rumors spread like wildfire. Is a murderer at large, stealthily slaughtering innocent victims? And if so, who is he, and how can he be stopped?Meanwhile, Roger Willis just turned forty. He's newly divorced and struggling to find his place in the gay dating scene. Instant access to sex is available through apps, and a careless stranger can reject him with a single swipe to the left. Cool, callous technology has replaced the warmth of getting to know someone through eye contact, a friendly handshake, and casual conversation. His dream of finding love again is beginning to feel hopeless.Everything changes when a handsome young man named Ben Hudson comes along, and suddenly Roger's world doesn't seem so lonely. There's relationship potential, but Roger has secrets. He didn't survive four decades and a failed marriage without a few skeletons in his closet. What will happen when Ben flings the door open and the secrets come spilling out?Lies will be told. Hearts will be broken. Fluids will be spilled. It's going to be a bloodbath.Rip the mask off! Reveal the secrets underneath!Click the Preview button under the cover image for a sneak preview into the savage world where romance and murder mingle. Read the first chapter and get a taste of the shocking surprises that will leave you breathless!",
  "genres": [
    "M M Romance",
    "Mystery",
    "Thriller",
    "LGBT",
    "Romance",
    "Horror",
    "Contemporary"
  ],
  "author": "Nathan Bay",
  "average_rating": "3.30",
  "url": "https://www.goodreads.com/book/show/36395978-young-forever"
}