{
  "title": "She Has Her Mother's Laugh: The Powers, Perversions, and Potential of Heredity",
  "description": "Carl Zimmer presents a history of our understanding of heredity in this sweeping, resonating overview of a force that shaped human society--a force set to shape our future even more radically.She Has Her Mother's Laugh presents a profoundly original perspective on what we pass along from generation to generation. Charles Darwin played a crucial part in turning heredity into a scientific question, and yet he failed spectacularly to answer it. The birth of genetics in the early 1900s seemed to do precisely that. Gradually, people translated their old notions about heredity into a language of genes. As the technology for studying genes became cheaper, millions of people ordered genetic tests to link themselves to missing parents, to distant ancestors, to ethnic identities. . . .But, Zimmer writes, \"Each of us carries an amalgam of fragments of DNA, stitched together from some of our many ancestors. Each piece has its own ancestry, traveling a different path back through human history. A particular fragment may sometimes be cause for worry, but most of our DNA influences who we are--our appearance, our height, our penchants--in inconceivably subtle ways.\" Heredity isn't just about genes that pass from parent to child. Heredity continues within our own bodies, as a single cell gives rise to trillions of cells that make up our bodies. We say we inherit genes from our ancestors--using a word that once referred to kingdoms and estates--but we inherit other things that matter as much or more to our lives, from microbes to technologies we use to make life more comfortable. We need a new definition of what heredity is and, through Carl Zimmer's lucid exposition and storytelling, this resounding tour de force delivers it. Weaving historical and current scientific research, his own experience with his two daughters, and the kind of original reporting expected of one of the world's best science journalists, Zimmer ultimately unpacks urgent bioethical quandaries arising from new biomedical technologies, but also long-standing presumptions about who we really are and what we can pass on to future generations.",
  "genres": [
    "Science",
    "Nonfiction",
    "Biology",
    "History",
    "Genetics",
    "Audiobook",
    "Evolution"
  ],
  "author": "Carl Zimmer",
  "average_rating": "4.16",
  "url": "https://www.goodreads.com/book/show/36391536-she-has-her-mother-s-laugh"
}