{
  "title": "Complete Stories and Poems of Edgar Allan Poe",
  "description": "This edition includes all the Poe's Works of Poetry & Fiction that are included in the Poe Canon:- Poems (Alone, The Raven, etc.)- Tales (The Fall of The House of Usher, etc.)You can move quickly back and forth among Poems and Tales by simply clicking a link in the Table of Contents.The Logical TOC (NCX) allows you to jump back and forth between topics with a simple press of the Kindle 5-way toggle.All the prose and all the verses are correctly indented, spaced and formatted.INTRODUCTIONEDGAR ALLAN POE AN APPRECIATION EDGAR ALLAN POE By James Russell Lowell DEATH OF EDGAR A. POE By N. P. Willis ESSAYSMAELZEL'S CHESS-PLAYER OLD ENGLISH POETRY PHILOSOPHY OF FURNITURE. MORNING ON THE WISSAHICCONTHE POETIC PRINCIPLE POEMS POEMS OF LATER LIFE A DREAM WITHIN A DREAMA VALENTINE. AN ENIGMA ANNABEL LEE. BRIDAL BALLADELDORADO. EULALIE FOR ANNIE THE BELLS. THE CITY IN THE SEA. THE RAVEN. THE SLEEPER. TO F - - . TO FRANCES S. OSGOOD TO HELEN TO MARIE LOUISE TO MARIE LOUISE TO MY MOTHERULALUME POEMS OF MANHOOD DREAM-LAND HYMN LENORE SCENES FROM \"POLITIAN\" SILENCE THE COLISEUM. THE CONQUEROR WORM. THE HAUNTED PALACE. TO ONE IN PARADISE. TO ZANTE POEMS OF YOUTH A DREAM A PÆAN. AL AARAAFAL AARAAF DREAMS EVENING STAR Elizabeth FAIRY-LAND HYMN TO ARISTOGEITON AND HARMODIUS IMITATION IN YOUTH I HAVE KNOWN ONE ISRAFEL LETTER TO MR. B - . ROMANCE SERENADE SONG SONNET - TO SCIENCE SPIRITS OF THE DEAD TAMERLANE THE HAPPIEST DAY. THE LAKE - - TO - - THE VALLEY OF UNREST TO - - TO - - TO HELEN TO MARGARET TO THE RIVER - - DOUBTFUL POEMS ALONE TO ISADORE THE VILLAGE STREET THE FOREST REVERIE TALESA DESCENT INTO THE MAELSTRÖM. A PREDICAMENT A TALE OF JERUSALEM A TALE OF THE RAGGED MOUNTAINS BERENICE BON-BON. DIDDLING CONSIDERED AS ONE OF THE EXACT SCIENCES. ELEONORA FOUR BEASTS IN ONE - THE HOMO-CAMELEOPARD HOP-FROG HOW TO WRITE A BLACKWOOD ARTICLE. KING PEST LANDOR'S COTTAGE LIGEIA ....",
  "genres": [
    "Classics",
    "Poetry",
    "Horror",
    "Fiction",
    "Short Stories",
    "Gothic",
    "Mystery"
  ],
  "author": "Edgar Allan Poe",
  "average_rating": "4.40",
  "url": "https://www.goodreads.com/book/show/36385465-complete-stories-and-poems-of-edgar-allan-poe"
}