{
  "title": "How to Sell Books by the Truckload on Amazon - 2018 Edition!: Power Pack: Sell Books by the Truckload & Get Reviews by the Truckload",
  "description": "Learn Exactly How to Turn Amazon into Your 24/7 Sales Machine!   Also included, Bonus Book: How to Double The Number of Reviews You Get on Amazon!   Discover Every Secret You Need to Sell a Truckload of Books  Amazon wants you to sell a lot of books. And How to Sell Your Books by the Truckload teaches you exactly how to do it.  Internationally renowned Amazon book marketing expert Penny Sansevieri has created the ultimate guide for mastering the Amazon marketing system.  Follow her proven strategies and you’ll instantly skyrocket your book’s exposure and kick your book marketing into overdrive!  Don’t waste precious time painstakingly researching everything yourself, and avoid all the misinformation out there by letting Penny Sansevieri show you how to:  * Achieve top visibility for your book on Amazon. * Increase sales through perfectly timed pre-order campaigns. * Leverage a secret tool to get hundreds of reader reviews. * Use Kindle Unlimited to your greatest advantage. * Boost sales by knowing when to give away your e-book—it really works! * Learn keywords and book descriptions that will draw in tons of buyers. * Identify and locate secret categories that drive bigger sales. * Make sure your book is ranked #1 in your category!  How to Sell Your Books by the Truckload is your must-read, go-to resource if you really want to understand the inner workings of Amazon and sell more books.  Buy it on Amazon and you’ll also receive:  BONUS: Free listings of top fiction bloggers and hundreds of bonus resources!  DOUBLE BONUS: A special book marketing discount to work with Penny directly!  Note: If you’ve bought one of my Amazon Truckload books in the past, this is the newly updated, 2017 edition. This book is also replacing the previously released bundled book: How to Sell Books by the Truckload on Amazon!",
  "genres": [
    "Writing",
    "Nonfiction",
    "Business"
  ],
  "author": "Penny C. Sansevieri",
  "average_rating": "4.24",
  "url": "https://www.goodreads.com/book/show/36402915-how-to-sell-books-by-the-truckload-on-amazon---2018-edition"
}