{
  "title": "Whine with Cheese",
  "description": "Swirl a hot mess, a savvy vintner, and a meathead ex into a chaotic adventure and indulge in a taste of humor when a sensual journey of self-discovery collides with true love.Twenty-five-year-old Max Novaline just had her heart ripped out by her meathead ex-boyfriend, Bart Moore. Determined to bounce back, she heads to Napa Valley’s Angel of the Vine Winery, maker of her favorite Moscato, to scout out tours for work and—let’s be honest—catch a glimpse of the owner’s drool-worthy son, Chase L’Angevin, as seen on YouTube.Chase, who likes a pin-up girl with a sexy derrière, starts to pour on the charm the moment he meets Max. When their first date rolls into a long, romantic weekend, their chemistry ignites faster than a matchstick in hell.But after their second date is interrupted by Chase’s work-related obligations, Max bides her time wine tasting awaiting his return, which is no biggie, until a drunk tourist catapults her into a whirlwind of chaos, that dumps her right back into the clutches of her manipulative ex.Not only that, determined to reconcile with Max, Chase keeps sneaking around, insisting they had a hotter connection, only to come off looking like a stalker with only one thing on his mind—his own ax to grind.Even more adventures arise when Max has to deal with what she wants and what she has. Not only does she need to do major damage control with the entire L’Angevin family thanks to Bart’s shady deeds, but she also has to convince Chase she’s worth a second chance despite her antics having practically snuffed out their flame.Whine with Cheese: Vineyard Pleasures Series, #1 is about a young woman discovering her full potential while falling in love one sweet wine tasting at a time.***This novel is a classy, passionate, sexy, funny, feel good Contemporary Romance - Romantic Comedy full of twists and turns that will have you laughing out loud from start to finish. Grab a bottle of Moscato, kick up your feet, and enjoy the ride.***(Heat Level: Sensual but Closed-Door)",
  "genres": [
    "Romance",
    "Romantic Comedy"
  ],
  "author": "Brooke E. Wayne",
  "average_rating": "4.68",
  "url": "https://www.goodreads.com/book/show/36401391-whine-with-cheese"
}