{
  "title": "A Prophet with Honor: The Billy Graham Story",
  "description": "A Prophet with Honor is the biography Billy Graham himself invited and appreciated for its sympathetic but frank approach. Carefully documented, eminently fair, and gracefully written, it raises and answers key questions about Graham's character, contributions, and influence on the world religious scene. In this engaging and comprehensive book, William Martin gives readers a better understanding of the most successful evangelist in modern history, and the movement he led for over fifty years. A Prophet with Honor makes a vital contribution to the Billy Graham legacy and allows us to understand why his words, actions, and personality endeared him to popes and preachers, kings and presidents, and millions of Christians in virtually every nation and culture around the world. Martin draws onextensive conversations with Graham himselfnearly two hundred interviewspreviously untouched resources, including documents from six presidential libraries and the Billy Graham Evangelistic Association archivespersonal observation of Graham's crusades and conferences in the United States and Europedecades of research on evangelical Christianity Martin pays particular attention to Graham's controversial relationships with Presidents Lyndon Johnson and Richard Nixon. He also describes how Graham's lifelong determination \"to do something great for God\" led him to organize international conferences that spearheaded the worldwide spread of the liberating message of Jesus, and prompted him to help strengthen religious freedom in the Soviet bloc and China. Tracing Graham's life and ministry from his rural and religious roots in North Carolina to his place as the elder statesman of American evangelicalism, examining both his triumphs and his tribulations, Martin shows the multidimensional character of the man who has become one of the most admired persons in the world.",
  "genres": [
    "Biography",
    "Nonfiction",
    "History",
    "Audiobook",
    "Religion",
    "Inspirational",
    "Church History"
  ],
  "author": "William C. Martin",
  "average_rating": "4.18",
  "url": "https://www.goodreads.com/book/show/36410126-a-prophet-with-honor"
}