{
  "title": "Knight: Celeste Academy",
  "description": "“You can either choose to attend this academy or continue to be detained as a prisoner. Allowing you to train as a knight is probably the best choice since having a human as a Celeste is advantageous. Because of safety purposes, the gates are never opened. Current circumstance requires, however, the re-bridging of our worlds. If ever you survive and graduate from the academy, you’ll be a representative—the ambassador of humankind. Quite a fancy title, don’t you think?”Pandora’s box has opened and hell has broken loose. Unfortunately for Valeriana Kerrigan, she had the front seat at the cutting of the ribbon. Now, she’s deep in cow dung—or rather, under the claws of a demon. Fortunately, she is saved by the skin of her throat by a sword-wielding woman who claims to be from another world. And that’s just the appetizer.For the entrée, apparently, is entering Pandora’s box itself—which she later finds out is called Valemnia. With Earth potentially being involved in Valemnia’s pesky pest problem, Valeriana is unable to take a neutral stance. Leaving the busy streets of modern-day Boston, albeit unwillingly, she takes a plunge to brave a whole new world in the most literal sense—one which mirrors hers with a dash of surrealism, beasts, demons, and even locals who wield the elements like second nature.Despite the minor setbacks (and being human), she is confronted by a path she cannot hope to never pick up arms, survive eight years in an academy as a knight-in-training, and help push back the demons plaguing Valemnia. However, to do so, she may just have to let go of her humanity.Follow Valeriana through the magic-filled halls of Celeste Academy. Grab your copy of this adventure-packed fantasy now!",
  "genres": [
    "Fantasy",
    "Young Adult",
    "Magic",
    "Paranormal",
    "Urban Fantasy",
    "High Fantasy"
  ],
  "author": "Raquel Ann Gil",
  "average_rating": "4.60",
  "url": "https://www.goodreads.com/book/show/36411821-knight"
}