{
  "title": "Wild Pride",
  "description": "Alternate cover edition of ASIN B076DNRLSS*This is a Reverse Harem series with graphic scenes, mature language, and mature themes. suitable for ages 18+* *Full length novel of 100,000 words*  Twenty-three year old Riley Stern has lived in Wild Junction for two years living a mediocre life that she was content with. Just content. It was nothing special and she was alright with that but she desperately wanted more. Then five locals move back into town after disappearing a decade before, the boys of the Kingson Estate and they have reputations that Riley should want to avoid. They are sexy and powerful in ways that draws her to them like a moth to a flame. Then they tell her she’s only half-human and make her an offer she doesn’t want to refuse: Join the pride and become part of the family and learn everything about what she is. Too bad her body wants much more then to become part of the family and so do theirs. Too bad that there is much more to this deal then meets the eye and she doesn’t even know it.  The Kingson Pride, infamous due to their youth and ruthlessness. Brenton Kingson, Zachary Woods, Andrew Hicks, Troy and Gabe Walker. Five of the richest, most successful, and bitter feline shifters that walk the earth. They just wanted to go home to Wild Junction after a decade of building their reputation for a quiet life away from all the other feline shifters. Yet, when they get back they find a half-breed feline shifter living in their town which is unacceptable. Faced with the fact that they all want her, she has no idea what she is, and there are secrets in her life that terrify them, they finally make the decision to add one more member to their pride. And once she’s in the pride, they need to keep all hell from breaking loose.",
  "genres": [
    "Reverse Harem",
    "Paranormal",
    "Shapeshifters",
    "Romance",
    "Fantasy",
    "Paranormal Romance",
    "Urban Fantasy"
  ],
  "author": "Kristen Banet",
  "average_rating": "3.86",
  "url": "https://www.goodreads.com/book/show/36410856-wild-pride"
}