{
  "title": "The Cañon City Chronicles",
  "description": "Sweet Historical Western RomanceA preacher, a rancher, and a Colorado Ranger find and fight for the courageous women who make life in the West worth the struggle. Two families discover what they’re looking for in the fledgling mine-supply town of Cañon City before Colorado becomes a state. Read their three-generation story spanning nearly thirty years in the complete collection of The Cañon City Chronicles.First time under one cover, three revised, second-edition novels originally published in 2014.Loving the Horseman – Book 1Copper-haired Annie Whitaker follows her father to mine-supply town Cañon City where they open their mercantile in the wake of the Pikes Peak gold rush. While serving her “potbellied biscuits” to mercantile customers, she falls under the lustful eye of the local hotel and saloon owner but does her best to avoid him. A mysterious cowboy also frequents the store and, like most everyone else, turns out to be much more than she expected.One-time preacher Caleb Hutton has sworn off women and the pulpit, but Annie Whitaker’s warm smile and melt-in-your-mouth biscuits have drawn him up short. Until he can find work elsewhere, his experience with horses lands him a job at the livery. An unexpected friendship with the Whitakers develops into more than he bargained for, and he wonders if maybe God led him to Cañon City for reasons he hasn’t yet discovered.Straight to My Heart – Book 2Columbines, cougars, and a controlling cowboy are not what Livvy Hartman expects when she moves to the Bar-HB to care for her widowed grandfather. The infuriating foreman was her childhood nemesis, and now he’s trying to tell her what a woman can and cannot do on a cattle spread. She’ll show him—and she does—until he shows her how much he cares.As foreman of the Bar-HB, Whit Hutton always gets his way—except where his boss’s granddaughter is concerned. Once the victim of his childhood pranks, Livvy has a mind of her own, distracting him from keeping his crew out of the railroad feud over a narrow, mountain right-of-way. Now he’s feuding with his own heart over what to do about the feisty beauty. He can’t keep her from joining the roundup any more than he can keep her out of his thoughts. But when he rescues her from a stalking predator, he realizes what he’d lose if he lost her.Romancing the Widow – Book 3Young widow Martha Stanton returns to her parents’ parsonage in Cañon City, bereft of love and deprived of hope. As dry and lifeless as the fossils she once collected during the city’s infamous “bone wars,” she resigns herself to a dull existence—until she crosses paths with an old flame and a darkly mysterious stranger.Colorado Ranger Haskell Jacobs is on a mission. And the flame-haired beauty in black who steps off the train isn’t what he’s looking for. Or is she? As drawn as he is to her fiery spirit, Haskell learns that she has connections to the horse thief he’s hunting. Entanglement with a preacher’s daughter is the last thing he needs—and the one thing he can’t avoid.",
  "genres": [],
  "author": "Davalynn Spencer",
  "average_rating": "4.33",
  "url": "https://www.goodreads.com/book/show/36411819-the-ca-on-city-chronicles"
}