{
  "title": "Rings of Time",
  "description": "Abandoned at birth, eighteen-year-old Emilie hopes to one day find her family. The search for answers draws her to a family reunion in rural Alberta, but before she can find out the truth she's transported back in time one hundred years to 1913. Emilie's attempts to get back to the future and unravel the clues to her mysterious beginnings are quickly put on hold as she becomes caught up in the past. Upon arrival to the year 1913, Emilie is thrust immediately into the clutches of unsavoury men in a mail order bride convoy and married to a complete stranger. Aided by the handsome but reluctant groom, the feisty Emilie is freed from one unsettling situation only to find herself caught up in another. Day after day Emilie is faced with tests of strength and character as she learns the harsh realities of early homesteading. Emilie is given the extraordinary opportunity to learn Canadian history, not through textbooks, but as a way of life. Emilie begins to understand the struggles and sacrifices that were made when families immigrated to Canada. She learns about the horrors of immigrant ships and the risks to females travelling alone. She discovers to what extent the Canadian government would campaign to draw settlers to the west, learning about the free one hundred and sixty acres of land offered and the arduous conditions that needed to be met. Just as Emilie believes she has solved the puzzles to her past and discovered the family she has always been searching for, secrets, lies, and assumed identities are exposed. Emilie is forced to make a choice, overcome her feelings of guilt and betrayal or lose everything and everyone she loves. Past and present collide as Emilie struggles with choosing a path towards what has become familiar, or pursuing temptation into the unknown. Choosing family and a chance at love, Emilie's journey through time and history continues in the city of Calgary where she has a front row seat to the justice system and the dangers of the western city and the crooked politicians and spirited cowboys that populated it. She travels across Canada to Toronto entering a world of the wealthy and elite where she has the opportunity to witness Canadian Suffragettes fighting for rights and equality and the damaging effects of the people who oppose them. In the spring of 1914, Emilie takes a leap of faith and travels across the Atlantic Ocean to England. Just when she believes she can finally settle into the peaceful journey she is thrown into a far more dangerous circumstance at sea.",
  "genres": [],
  "author": "Renee Veillet",
  "average_rating": "4.06",
  "url": "https://www.goodreads.com/book/show/36400357-rings-of-time"
}