{
  "title": "The Reversion",
  "description": "Jim Wyatt had always said that if everything fell apart, he didn’t want to just survive - he didn’t want to notice. When the world did crash, his family’s home of Stonemont became not only a refuge, but a place where it might be possible to start over again, and reclaim the American ideal.  Among the many novels in the SHTF/TEOTWAWKI genre, The Reversion stands apart – and, perhaps, alone. It does not follow the survival learning curve of the unprepared or minimally-prepared, as so many excellent books have already done so well. Rather, it is the story of a man who was prepared, and of how his preparation and foresight provided not only a safe haven for him and his family, but a re-start point for those who come together to survive the collapse of the world around them. As such, it is an unbelievably positive book about an unbelievably negative circumstance, and carries within it the lessons of preparedness and survival that every person should strive to learn.  Tightly woven into the story are threads of history, morality, politics, economics, philosophy and comparative justice – the kind America was founded on, the kind they had devolved to under the weight of an increasingly liberal and socialist society, and the kind that might re-establish a society reflective of America’s original ideals. As these threads are woven into the fabric of the larger story of survival, the realization emerges that a great catastrophe enabled the return of what makes us, as human beings, truly happy and fulfilled, and that, perhaps, only a great catastrophe could.  The Reversion, written by an expert in survival and preparedness with an interesting government and non-government background, is destined to be an instant classic in the preparedness/survival genre. More than a good story, it is a manual and a resource for all who are interested in these fields, and deserves to be kept on your desk or chair-side table where it can be read, re-read and referred to often.",
  "genres": [
    "Dystopia",
    "Science Fiction"
  ],
  "author": "Steven C. Smith",
  "average_rating": "4.50",
  "url": "https://www.goodreads.com/book/show/36417428-the-reversion"
}