{
  "title": "The Survivors",
  "description": "*** PICKED AS A BOOK OF THE YEAR BY THE MAIL ON SUNDAY *** ‘A clever, absorbing thriller that does not shrink from the horror of the war' Times 'Compelling' Good Housekeeping 'This epic novel is simply an incredible read' Sun'A thrilling rollercoaster of a read' Dinah Jefferies, author of R&J pick The Sapphire Widow 'My best read of the year' Lesley Pearse Discover a brilliant story of love, danger, courage and betrayal, from the internationally bestselling author of The Betrayal.‘Directly I saw him, I knew he had to die.’  Germany, 1945. Klara Janowska and her daughter Alicja have walked for weeks to get to Graufeld Displaced Persons camp. In the cramped, dirty, dangerous conditions they, along with 3,200 others, are the lucky ones. They have survived and will do anything to find a way back home.   But when Klara recognises a man in the camp from her past, a deadly game of cat and mouse begins. He knows exactly what she did during the war to save her daughter. She knows his real identity.What will be the price of silence? And will either make it out of the camp alive? ‘A compelling, edge-of-your-seat story set in a refugee camp immediately after World War II, where a woman will do anything to protect her child. Full of twists and turns’ Julie Cohen, bestselling author of Together ‘A superb read; brilliantly crafted, exciting, very moving and researched meticulously. Fantastic, my best read of the year’ Lesley Pearse, Sunday Times bestselling author'This gripped me from the start. What a story! Kate Furnivall treads where others have not thought to go. Beware of anyone who comes between a mother and daughter - especially Klara and Alicja' Jane Corry, Sunday Times bestselling author of Blood Sisters and The Dead Ex ‘Meticulously researched, searingly honest and beautifully written’  Lancashire Post ‘Emotional and engaging with a thrilling tale of love and courage at its core’ Culturefly ‘An epic novel that will leave you breathless until the very end’ Mrs B’s Book Reviews‘THE SURVIVORS blends imagination with historical fact to absolute perfection’ Sharon’s Book Blog ‘It is impossible to stop once you start reading this book’ Sissi ReadsFurther praise for Kate Furnivall 'Gripping. Tense. Mysterious. Kate Furnivall has a talent for creating places and characters who stay with you long after you’ve read the final word' Jane Corry 'Exquisitely heart-wrenching & utterly engrossing' Penny Parkes 'A thrilling, compelling read.",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "War",
    "Historical",
    "World War II",
    "Holocaust",
    "Mystery"
  ],
  "author": "Kate Furnivall",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/36416813-the-survivors"
}