{
  "title": "Maid of Baikal",
  "description": "What if a Siberian Joan of Arc had rescued the White Armies at a critical point of the Russian Civil War in 1919?  MAID OF BAIKAL offers an alternative outcome to that war through the intervention of Zhanna Dorokhina, a young woman from the shores of Siberia’s Lake Baikal.  Like the historical Maid of Orleans in medieval France, better known as Joan of Arc, Zhanna displays a charisma and military prowess that win her command of an army to defend her homeland against the Bolshevik Terror.  MAID OF BAIKAL is a richly imagined speculation on the Russian Civil War that vividly portrays its violence, bitterness, and hardship, while telling the inspirational story of a determined young woman who perseveres in the face of overwhelming obstacles and who dies for her beliefs, not knowing whether her dreams will be realized.  SYNOPSIS:  In a quiet town near Siberia’s Lake Baikal, Zhanna Dorokhina turns eighteen as the Russian Civil War rages. She is a bright, headstrong girl, with normal hopes and dreams, but for years, she has heard inner voices. The voices tell her to be virtuous, study well, and nurture her faith, for a great task lies ahead.  Lately, however, the voices have turned ominous, foretelling Russia’s doom if the White Armies fail to crush the Bolshevik usurpers in Moscow. They direct Zhanna to travel to Omsk to alert the Siberian dictator, Admiral Kolchak, and to seek command of an army to besiege Moscow.  When Zhanna informs her father, he thinks her mad. But a young American intelligence officer and his Russian counterpart help win her an audience with the Admiral, and the two young men become her wartime companions. Though Zhanna and the American officer harbor tender feelings for one another, Zhanna must put those feelings aside, because her voices demand that she remain pure.  During the coming months, Zhanna persists despite relentless opposition. Displaying remarkable charisma and military aptitude, she leads her army across vast expanses of untamed forest and steppe, where suffering, violence and treachery await at every turn.  But over time, Zhanna’s obsession with victory arouses powerful enemies. Defying a ceasefire, Zhanna wins her greatest battle, only to ride into a Bolshevik ambush soon after. Held captive, she must endure a vengeful show trial and face the verdict alone, without knowing whether her prophecies will be fulfilled.",
  "genres": [
    "Historical Fiction",
    "Russia",
    "Fiction",
    "Alternate History"
  ],
  "author": "Preston Fleming",
  "average_rating": "4.09",
  "url": "https://www.goodreads.com/book/show/36414899-maid-of-baikal"
}