{
  "title": "Grave Dealings",
  "description": "\"His stuff is badass!\" – New York Times bestselling author, Hugo-nominee, and two-time Dragon Award-winner, Larry Correia.Don't make deals with the paranormal. They're better at it than you, and they never play fair.Paranormal investigator and soul without a body, Vincent Graves, did just that—a deal made in desperation. Now it's coming back to bite him in the middle of a case. He has 57 hours to investigate a string of deaths involving people who've made some devilish bargains. Too bad devils don't deal in good faith. It'd be easy enough, if he didn't have to deal with things such as:-Being hunted through the streets of Queens by a dark elf with a motorcycle fetish.-Ending up the target of a supernatural hit.-An old acquaintance dragging him to a paranormal ball where he could end up on the menu.-And having one of his closest guarded secrets brought to light...Not great for a tight clock, because if he doesn't get to the bottom of this case in time, Vincent and company might just lose their souls.Dirty deals are never done dirt cheap. And the supernatural always collect—big!Click buy now to dive into this paranormal investigator thriller!Frequently Asked Questions:Q: What is The Grave Report?A: The Grave Report is a paranormal investigator series inspired by Jim Butcher's Dresden Files and the show, Quantum Leap. It follows Vincent Graves, a soul murdered by the paranormal and forced to inhabit the bodies of others killed by monsters. He's tasked with using their minds, memories, and bodies to find the monsters responsible and gank them. The series focuses heavily on creative twists on well-known and more obscure mythologies. For fans of a monster of the week vibe, this is for you.Q: How should I read these case files?A: Each novel in The Grave Report is written both to progress a series meta plot as well as serve as a standalone monster of the week read if you want. The series order is listed below, but you can read them however you want. Jump in and enjoy.-Grave Beginnings-Grave Measures-Grave DealingsQ: Will I enjoy this series?A: If you love things like Supernatural, myths, magic, monsters, and investigator novels full of wit and charm, yes. You'll have a blast reading these. The series placed as a finalist in the 2016 Inaugural DragonCon Dragon Awards under Best Fantasy (Paranormal) alongside urban fantasy authors, Jim Butcher, and Larry Correia.Click buy now to dive into book three of the Dragon Award-nominated urban fantasy series!",
  "genres": [
    "Urban Fantasy",
    "Fantasy",
    "Mystery",
    "Audiobook"
  ],
  "author": "R.R. Virdi",
  "average_rating": "4.54",
  "url": "https://www.goodreads.com/book/show/36428617-grave-dealings"
}