{
  "title": "Oil and Marble: A Novel of Leonardo and Michelangelo",
  "description": "In her brilliant debut, Storey brings early 16th-century Florence alive, entering with extraordinary empathy into the minds and souls of two Renaissance masters, creating a stunning art history thriller. From 1501 to 1505, Leonardo da Vinci and Michelangelo Buonarroti both lived and worked in Florence. Leonardo was a charming, handsome fifty year-old at the peak of his career. Michelangelo was a temperamental sculptor in his mid-twenties, desperate to make a name for himself.Michelangelo is a virtual unknown when he returns to Florence and wins the commission to carve what will become one of the most famous sculptures of all David. Even though his impoverished family shuns him for being an artist, he is desperate to support them. Living at the foot of his misshapen block of marble, Michelangelo struggles until the stone finally begins to speak. Working against an impossible deadline, he begins his feverish carving.Meanwhile, Leonardo's life is falling he loses the hoped-for David commission; he can't seem to finish any project; he is obsessed with his ungainly flying machine; he almost dies in war; his engineering designs disastrously fail; and he is haunted by a woman he has seen in the market--a merchant's wife, whom he is finally commissioned to paint. Her name is Lisa, and she becomes his muse.Leonardo despises Michelangelo for his youth and lack of sophistication. Michelangelo both loathes and worships Leonardo's genius.Oil and Marble is the story of their nearly forgotten rivalry. Skyhorse Publishing, as well as our Arcade, Yucca, and Good Books imprints, are proud to publish a broad range of books for readers interested in fiction--novels, novellas, political and medical thrillers, comedy, satire, historical fiction, romance, erotic and love stories, mystery, classic literature, folklore and mythology, literary classics including Shakespeare, Dumas, Wilde, Cather, and much more. While not every title we publish becomes a New York Times bestseller or a national bestseller, we are committed to books on subjects that are sometimes overlooked and to authors whose work might not otherwise find a home.",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Art",
    "Book Club",
    "Italy",
    "Historical",
    "Art History"
  ],
  "author": "Stephanie Storey",
  "average_rating": "4.08",
  "url": "https://www.goodreads.com/book/show/36429362-oil-and-marble"
}