{
  "title": "Tales from The Lake, Vol. 4",
  "description": "The Legend Continues…Twenty-four heart-rending tales with elements of terror, mystery, and a nightmarish darkness that knows no end.Welcome to my lake. Welcome to where dreams and hope are illusions…and pain is God. •\tThis anthology begins with Joe R. Lansdale’s The Folding Man, one of his darkest stories ever written.•\tKealan Patrick Burke’s Go Warily After Dark pulls us into a desolated world, and reminds us of the price of survival: a guilt that seeps into the marrow.•\tDamien Angelica Walter’s Everything Hurts, Until it Doesn’t places us in the middle of a family whose secrets and traditions are thicker than blood.•\tJennifer Loring’s When the Dead Come Home explores a loss so dark, that even the stars are sucked into its melancholic vacuum.In the spirit of popular Dark Fiction and Horror anthologies such as Gutted: Beautiful Horror Stories and Behold: Oddities, Curiosities and Undefinable Wonders, and the best of Stephen King’s short fiction, comes Crystal Lake Publishing’s Tales from The Lake anthologies.This fourth volume of Speculative Fiction contains the following short stories:•\tJoe R. Lansdale – The Folding Man•\tJennifer Loring – When the Dead Come Home•\tKealan Patrick Burke – Go Warily After Dark•\tT. E. Grau – To the Hills•\tDamien Angelica Walters – Everything Hurts, Until it Doesn’t•\tSheldon Higdon – Drowning in Sorrow•\tMax Booth III – Whenever You Exhale, I Inhale•\tBruce Golden – The Withering•\tJG Faherty – Grave Secrets•\tHunter Liguore – End of the Hall•\tDavid Dunwoody – Snowmen•\tTimothy G. Arsenault – Pieces of Me•\tMaria Alexander – Neighborhood Watchers•\tTimothy Johnson – The Story of Jessie and Me•\tMichael Bailey – I will be the Reflection Until the End•\tE.E. King – The Honeymoon’s Over•\tDarren Speegle – Song in a Sundress•\tCynthia Ward – Weighing In•\tMichael Haynes – Reliving the Past•\tLeigh M. Lane – The Long Haul•\tMark Cassell – Dust Devils•\tDel Howison – Liminality•\tGene O’ Neill – The Gardener•\tJeff Cercone – Condo by the LakeWith an introduction by editor Ben Eads. Cover art by Ben Baldwin. Proudly represented by Crystal Lake Publishing – Tales from The Darkest Depths.",
  "genres": [
    "Horror",
    "Anthologies",
    "Short Stories"
  ],
  "author": "Ben Eads",
  "average_rating": "4.17",
  "url": "https://www.goodreads.com/book/show/36433386-tales-from-the-lake-vol-4"
}