{
  "title": "The Fallen Series Trilogy",
  "description": "These are the first three books of the incredible \"Fallen\" series, collected together in a deluxe box set. Relive every passionate moment of Luce and Daniel's epic romance across 5,000 years of history. This bestselling gothic romance is for all adult and teenage fans of supernatural fiction. It includes Fallen, Torment and Passion. Get ready to fall...\nFallen\nWhat if the person you were meant to be with could never be yours?There’s something achingly familiar about Daniel Grigori. Mysterious and aloof, he captures Luce Price’s attention from the moment she sees him on her first day at Sword & Cross boarding school in Savannah. He’s the one bright spot in a place where cell phones are forbidden, the other students are screwups, and security cameras watch every move.Except Daniel wants nothing to do with Luce—he goes out of his way to make that very clear. But she can’t let it go. Drawn to him like a moth to a flame, Luce has to find out what Daniel is so desperate to keep secret . . . even if it kills her.Dangerously exciting and darkly romantic, FALLEN is a page-turning thriller and the ultimate love story.\nTorment\nHow many lives do you need to live before you find someone worth dying for? Hell on earth.That's what it's like for Luce to be apart from her fallen angel boyfriend, Daniel.It took them an eternity to find one another, but now he has told her he must go away. Just long enough to hunt down the Outcasts - immortals who want to kill Luce. Daniel hides Luce at Shoreline, a school on the rocky California coast with unusually gifted students: Nephilim, the offspring of fallen angels and humans.At Shoreline, Luce learns what the Shadows are, and how she can use them as windows to her previous lives. Yet the more Luce learns, the more she suspects that Daniel hasn't told her everything. He's hiding something - something dangerous.What if Daniel's version of the past isn't actually true? What if Luce is really meant to be with someone else?The second novel in the addictive FALLEN series...where love never dies.\nPassion\nWhat if you find your soul mate . . . at the wrong time?Luce would die for Daniel.And she has. Over and over again. Throughout time, Luce and Daniel have found each other, only to be painfully torn apart: Luce dead, Daniel left broken and alone. But perhaps it doesn't need to be that way....Luce is certain that something - or someone - in a past life can help her in her present one. So she begins the most important journey of this lifetime...going back eternities to witness firsthand her romances with Daniel...and finally unlock the key to making their love last.Cam and the legions of angels and Outcasts are desperate to catch Luce, but none are as frantic as Daniel. He chases Luce through their shared pasts, terrified of what might happen if she rewrites history. Because their romance for the ages could go up in flames...forever.Sweeping across centuries, PASSION is the third novel in the unforgettably epic FALLEN series.",
  "genres": [
    "Fantasy",
    "Romance",
    "Young Adult",
    "Paranormal",
    "Angels",
    "Paranormal Romance"
  ],
  "author": "Lauren Kate",
  "average_rating": "4.36",
  "url": "https://www.goodreads.com/book/show/12193399-the-fallen-series-trilogy"
}