{
  "title": "Maverick",
  "description": "\"I can keep a secret...I bet you can keep a secret too.\"  MAVERICK is a hot & fun STANDALONE ROMANCE about one RUGGED ALPHA MOUNTAIN MAN and the feisty woman he needs to stay away from...from the New York Times Bestselling Author of The Pact and Wild Card.  Forget playing it safe.  John “Maverick” Nelson likes to live his life on the edge – literally. A crucial member of the search and rescue team in the mountainous British Columbian town of North Ridge, Maverick’s brash and bold attitude means he’s the first one to ascend into danger, no matter the risk.  When it comes to women, though, Maverick errs on the side of caution. For all his cocky charm, rugged good looks and sexual swagger, he remains as unreachable as the surrounding peaks. Hot, wild sex? He’ll tell you there’s no better way to spend a cold, wintry night. Relationships? He’d rather freeze.  That is until he lays his eyes on American Riley Clarke. Trading in the crippling expenses of Aspen for BC, Riley is North Ridge’s newest member of their search and rescue team and the only woman on the job, which means spending a lot of time with Mav in adrenaline-pumping situations.  With the chemistry between them hot enough to melt snow, keeping their hands off each other is detriment to the success of their team. Besides, Maverick’s her boss and she didn’t work her ass off in Colorado just to throw it all away for some mind-blowing sex.  But when the worst winter in years sweeps in, Riley and Maverick will have to battle the elements along with their attraction for each other. And if either of them slip up, both of them will be in for a deep freeze.  Maverick is a standalone novel and the second in the North Ridge series of standalones about the rough and rugged Nelson brothers. You do NOT need to read the previous book, Wild Card, you enjoy this story!  Canada’s never felt so hot.  WARNING: this novel contains explicit sex scenes and a lot of profanity. Reader discretion is advised,",
  "genres": [
    "Romance",
    "Contemporary Romance",
    "Contemporary",
    "Adult",
    "Audiobook",
    "Fiction",
    "New Adult"
  ],
  "author": "Karina Halle",
  "average_rating": "4.01",
  "url": "https://www.goodreads.com/book/show/36430230-maverick"
}