{
  "title": "HOT SEAL Bride",
  "description": "Sold to the highest bidder…  For the past fourteen years, Princess Antonella Rossi has been a virtual prisoner. She has no friends, no fun, and she’s not allowed to leave her aunt and uncle’s Virginia compound without an escort.  But today is her wedding day. A rich sheikh has bought her virginity, and with it her freedom. Any hope of independence Ella’s ever cherished will disappear the instant she faces him across the altar. With time running out and the wedding party gathering, Ella seizes the opportunity to run as far and fast as she can.  Navy SEAL Cash “Money” McQuaid isn’t looking for trouble, but trouble always seems to find him. This time trouble is five foot four and wearing a wedding dress. Rescuing a runaway princess has consequences though, and with his face plastered on the evening news and his career on the line, he realizes there’s only one way out of this mess—he has to marry her!  It’s a marriage in name only, just until he can clear his name and win Ella the freedom she seeks. But shacking up with a gorgeous virgin isn’t as easy as it seems, especially when the sparks snapping between them are hotter and more dangerous than anything Cash has ever experienced. By the time he realizes it’s too late to resist his virgin bride, an unseen enemy is intent on taking her away from him.  Cash is gonna need all his skills—and his friends on the Hostile Operations Team—in order to rescue his princess bride and give her the happily-ever-after she deserves.  The Hostile Operations Team is a covert military Black Ops unit. Their motto is Where None Dare. H.O.T. operators come from all branches of the military. The only criteria for membership: they must be the best of the best!",
  "genres": [
    "Military Fiction",
    "Romantic Suspense",
    "Romance",
    "Contemporary",
    "Contemporary Romance",
    "Military Romance",
    "Audiobook"
  ],
  "author": "Lynn Raye Harris",
  "average_rating": "4.42",
  "url": "https://www.goodreads.com/book/show/36437409-hot-seal-bride"
}