{
  "title": "Wizard of the Upper Amazon: The Story of Manuel C¢rdova-Rios",
  "description": "A richly-detailed real-life account of ancient tribal life and the fascinating role of Ayahuasca in the heart of the Amazon.Wizard of the Upper Amazon provides an insightful depiction of a South American tribal society at the turn of the 20th century. It delves into the captivating world of the Huni Kui tribe and their deep-seated connection with Ayahuasca, a powerful hallucinogenic plant. With the resurging interest in Ayahuasca today, this account offers a valuable and historical perspective, unveiling its traditional uses in day-to-day tribal life.Our narrator, Manuel Córdova-Rios, takes the reader along on his extraordinary journey from a young boy taken in by the tribe to a respected healer. His accounts illustrate a unique societal fabric where plant medicine is a teacher, telepathy a communication mode, and clairvoyance a revered skill. In comparison to the modern ceremonial use of Ayahuasca, Córdova-Rios paints an enlightening picture of how this substance is entwined with various aspects of tribal life, from hunting practices to dispute resolution.Wizard of the Upper Amazon is a rare look into a world that remains largely unexplored and elusive. According to reader reviews, the book delivers engaging insights into tribal life and Ayahuasca's role within it. This real-life tale invites readers to immerse themselves in the tribal world's intricate dynamics and to appreciate the deep wisdom and traditional practices of the Amazonian people. A classic read for those interested in indigenous cultures, shamanism, or plant medicine, this book offers a robust exploration into a time and place far removed from our own.",
  "genres": [
    "Nonfiction",
    "Anthropology",
    "History",
    "Biography",
    "Plants",
    "Adventure",
    "Spirituality"
  ],
  "author": "Frank Bruce Lamb",
  "average_rating": "4.19",
  "url": "https://www.goodreads.com/book/show/364419.Wizard_of_the_Upper_Amazon"
}