{
  "title": "Beneath the Twisted Trees",
  "description": "The fourth book in The Song of Shattered Sands series—an epic fantasy with a desert setting, filled with rich worldbuilding and pulse-pounding action.When a battle to eradicate the Thirteenth Tribe goes awry, the kingdoms bordering the desert metropolis of Sharakhai see the city as weak and ripe for conquest. Çeda, now leader of the Shieldwives, a band of skilled desert swordswomen, hopes to use the growing chaos to gain freedom for Sehid-Alaz, the ancient, undying king of her people. Freeing him is only the beginning, however. Like all the people of her tribe on that fateful night four centuries earlier, Sehid-Alaz was cursed, turned into an asir, a twisted, miserable creature beholden to the kings of Sharakhai—to truly free her king, Çeda must break the chains that bind him. As Sharakhai’s enemies close in and the assault on the city begins, Çeda works feverishly to unlock the mysteries of the asirim’s curse. But danger lies everywhere. Enemy forces roam the city; the Blade Maidens close in on her; her own father, one of the kings of Sharakhai, wants Çeda to hang. Worst of all, the gods themselves have begun to take notice of Çeda’s pursuits. When the combined might of Sharakhai and the desert gods corner the survivors of the Thirteenth Tribe in a mountain fastness, the very place that nearly saw their annihilation centuries ago, Çeda knows the time has come. She was once an elite warrior in service to the kings of Sharakhai. She has been an assassin in dark places. A weapon poised to strike from the shadows. A voice from the darkness, striving to free her people. No longer.Now she's going to lead.The age of the Kings is coming to an end . . .",
  "genres": [
    "Fantasy",
    "Epic Fantasy",
    "Fiction",
    "High Fantasy",
    "Adult",
    "Science Fiction Fantasy",
    "Adventure"
  ],
  "author": "Bradley P. Beaulieu",
  "average_rating": "4.18",
  "url": "https://www.goodreads.com/book/show/36449958-beneath-the-twisted-trees"
}