{
  "title": "Numba One - Numba Ten: A Vietnam War Novel",
  "description": "The criticism in reviews of Numba One - Numba Ten for bad editing and mistakes was a fair one. I downloaded the wrong manuscript when finishing the book for Kindle and then didn't know how to undo it. It has been corrected. Anyone who purchased a poorly edited version with different cover please contact me - Nathaniel R. Helms - through Kindle or FB... run my name to find me... and I will either replace or reimburse you for the cost. Thanks you for both purchasing and commenting on it. Both are very useful.Numba One - Numba A Vietnam War Novel is the fictional account of the author's three tours of duty in Vietnam between January 24,1968 and Thanksgiving Day, 1970. The story is based on my experiences as both a helicopter door gunner and RTO/FO assigned to the 25th Infantry Division.The authenticity of the story and the correct use of weapons and tactical nomenclature will bring a frequent nod of recollection and appreciation from soldiers who walked the walked rather than talk the talk. I went to Vietnam in January 1968 on my 18th birthday and assigned to a target acquisition battery on the Demilitarized Zone -the infamous DMZ. After 11 months in that hell hole I volunteered to be a door gunner on a Huey helicopter. That is where this story begins. The DMZ and anywhere else in Vietnam bore no relationship except war, wounds and death. Although feeling salty after almost a year under the command of Marines I was not prepared for the ordinary life of an aviation crew member in Vietnam. The book combines reality and fiction in a seamless display of art and history that compels the reader to never put it down. Both combat veterans and those who want o know what it is like to face combat as an 18-year old will find a place in this book. It reveals the humor, the pathos, the angst, and the agony of extended combat where men lived and died without rhyme or reason. It is tough, mean and sometimes ugly, but that is what war produces. Find out for yourself in Numba One - Numba Ten.Helms is the author of two non-fiction books that are also for sale at Amazon's Kindle library. \"My Men Are My The Brad Kasal Story,\" Hardcover, Meredith, 2007, Naval Institute Press reprint, 2012 (Selected as recommended reading by Commandant, USMC); \"No Time For The Truth; The Haditha Incident And The Search For Justice,\" Arcade, NY,NY, 2016",
  "genres": [],
  "author": "Nathaniel R. Helms",
  "average_rating": "4.40",
  "url": "https://www.goodreads.com/book/show/36444123-numba-one---numba-ten"
}