{
  "title": "What About the Rest of Your Life",
  "description": "In their soaring and urgent debut memoir, Sung Yim captures a sleepy sad slice of Americana recognizable to anyone who’s driven past a strip mall at midnight. Equal parts grim and buoyant, here is an intimate portrait of trauma, family, addiction, and body. What About the Rest of Your Life exposes the harrowing terrain where there is no boundary between love and abuse. Unapologetically raw, Yim reinvents the recovery narrative through an immigrant's lens.PRAISE FOR WHAT ABOUT THE REST OF YOUR LIFE:“So achingly beautiful I want to sing. I want to set things on fire. I want to put this book in your hands and say, ‘Here. You have to read this. Right goddamn now.’” -Megan Stielstra, The Wrong Way to Save Your Life“Never before has a book made me fall in love so quickly. What About the Rest of Your Life signals a courageous, crucial, and authentic new voice in literature.\" -Jenny Boully, Book of Beginnings and Endings\"Sung Yim has absorbed and chronicled the new unsettled America in a memoir that vibrates with grief as it attempts to uncover the nexus of masked identities in the Midwest. Theirs is the voice of a generation who is left with the pieces of a disassembled culture. What About the Rest of Your Life is a sustained movement of life, its rawness, gaping holes, and found joys.\"-Re'Lynn Hansen, author of To Some Women I Have Known“Read this book built from dopamine and the hollows of its absence, this book I’m obsessed with. It will gut you and it will refill you.\" -Elissa Washuta, My Body Is a Book of Rules“This book is fucking brilliant.” -Glenn Taylor, A Hanging at Cinder Bottom“The kind of book that gets you somewhere new, somewhere more honest and shot through with the hard emotion of living. A striking debut.” -T Fleischmann, Syzygy, Beauty: An Essay\"Sung Yim has written an enthralling memoir. It's powerful, vulnerable, and deeply pleasurable. It's a harrowing house fire of a book. Everything that Sung Yim burns up with their excellent prose becomes sanctified, gutted, and glorious.\"-David Stuart MacLean, The Answer to the Riddle Is Me",
  "genres": [
    "Memoir",
    "Nonfiction",
    "Queer",
    "Poetry",
    "Biography Memoir",
    "LGBT",
    "Race"
  ],
  "author": "Sung Yim",
  "average_rating": "4.43",
  "url": "https://www.goodreads.com/book/show/36442689-what-about-the-rest-of-your-life"
}