{
  "title": "Connecting the Dots to the Caliphate: A Primer for the Thinking Person",
  "description": "The world is in turmoil, with each passing day bringing one more reason for us to What next? This book may not directly answer this question, but does provide understanding of what, where, and why this war against Daesh (Islamic State of Iraq and Syria - ISIS), and Al-Qaeda is occurring. Dr. Simon Cottee, an academic and senior lecturer in criminology at the University of Kent, England, says many Western leaders don't seem to know what Daesh's and Al-Qaeda's intentions are, or where the groups come from. In December 2014, Major General Michael K. Nagata, special operations commander for the United States in the Middle East, said he had yet to figure out Daesh's appeal to its followers. He believed it was important to defeat the \"idea,\" not just overcome the enemy militarily. While a direct remedy of the military strategies to fight this war lies outside the realm of this book, it may assist in understanding these enemies in the context of negating or countering their ideology, especially as it pertains to information that may have flown under the radar for both non-Muslims and Muslims alike. \"Connecting the Dots to the Caliphate dissects some of the most difficult, challenging, and imperative topics facing the Muslim world ... Such a text is essential for understanding the complexities of the Middle East, Islam, and Western imperialism in their relation to our current world. I highly recommend this unique and eye-opening book.\" - Charles Asher,Phi Beta Kappa Book Review Shanbreen migrated to the United States where he obtained a BS in industrial administration, a MBA, and a Ph.D. in psychometrics. Now retired from his career as a principal research scientist in the field of education, he lives in Pittsburgh, Pennsylvania. Publisher's //sbprabooks.com/Shanbreen",
  "genres": [],
  "author": "Shanbreen",
  "average_rating": "0.00",
  "url": "https://www.goodreads.com/book/show/36461091-connecting-the-dots-to-the-caliphate"
}