{
  "title": "America for Beginners",
  "description": "Recalling contemporary classics such as 'Americanah, Behold the Dreamers', and 'The Brief and Wondrous Life of Oscar Wao', a funny, poignant, and insightful debut novel that explores the complexities of family, immigration, prejudice, and the American dream through meaningful and unlikely friendships forged in unusual circumstances.Pival Sengupta has done something she never expected: She has booked a trip with the First Class India USA Destination Vacation Tour Company. But unlike other upper-class Indians on a foreign holiday, the recently widowed Pival is not interested in sightseeing. She is traveling thousands of miles from Kolkota to New York on a cross-country journey to California, where she hopes to uncover the truth about her beloved son, Rahi. A year ago Rahi devastated his very traditional parents when he told them he was gay. Then Pival's husband, Ram, told her that their son had died suddenly - heartbreaking news she still refuses to accept. Now, with Ram gone, she is going to America to find Rahi, alive and whole or dead and gone, and come to terms with her own life.Arriving in New York, the tour proves to be more complicated than anticipated. Planned by the company's indefatigable owner, Ronnie Munshi - a hardworking immigrant and entrepreneur hungry for his own taste of the American dream - it is a work of haphazard improvisation. Pavil's guide is the company's new hire, the guileless and wonderfully resourceful Satya, who has been in America for one year - and has never actually left the five boroughs. For modesty's sake, Pival and Satya will be accompanied by Rebecca Elliot, an aspiring young actress. Eager for a paying gig she's along for the ride, because how hard can a two-week \"working\" vacation traveling across America be?Slowly making her way from coast to coast with her unlikely companions, Pival finds that her understanding of her son - and her hopes of a reunion with him - are challenged by her growing knowledge of his adoptive country. As the bonds between this odd trio deepens, Pival, Satya, and Rebecca learn to see America - and themselves - in different and profound new ways.A bittersweet and bighearted tale of forgiveness, hope, and acceptance, 'AMERICA FOR BEGINNERS' illuminates the unexpected enchantments life can hold and reminds us that our most precious connections aren't always the ones we seek.RUNNING TIME ➼ 10hrs. and 49mins.©2018 Leah Franqui (P)2018 HarperCollins Publishers",
  "genres": [
    "Fiction",
    "Contemporary",
    "India",
    "Book Club",
    "Audiobook",
    "Travel",
    "Adult"
  ],
  "author": "Leah Franqui",
  "average_rating": "3.90",
  "url": "https://www.goodreads.com/book/show/36461785-america-for-beginners"
}