{
  "title": "Kidnapped by the Pirate",
  "description": "Will a virgin captive surrender to this pirate’s sinful touch?  Nathaniel Bainbridge is used to hiding, whether it’s concealing his struggles with reading or his forbidden desire for men. Under the thumb of his controlling father, the governor of Primrose Isle, he’s sailing to the fledging colony, where he’ll surrender to a respectable marriage for his family’s financial gain. Then pirates strike and he’s kidnapped for ransom by the Sea Hawk, a legendary villain of the New World.  Bitter and jaded, Hawk harbors futile dreams of leaving the sea for a quiet life, but men like him don’t deserve peace. He has a score to settle with Nathaniel’s father—the very man whose treachery forced him into piracy—and he’s sure Nathaniel is just as contemptible.  Yet as days pass in close quarters, Nathaniel’s feisty spirit and alluring innocence beguile and bewitch. Although Hawk knows he must keep his distance, the desire to teach Nathaniel the pleasure men can share grows uncontrollable. It’s not as though Hawk would ever feel anything for him besides lust…  Nathaniel realizes the fearsome Sea Hawk’s reputation is largely invented, and he sees the lonely man beneath the myth, willingly surrendering to his captor body and soul. As a pirate’s prisoner, he is finally free to be his true self. The crew has been promised the ransom Nathaniel will bring, yet as danger mounts and the time nears to give him up, Hawk’s biggest battle could be with his own heart.  This May-December gay romance from Keira Andrews features classic tropes including: a tough alpha pirate too afraid to love, a plucky virgin captive half his age, enemies to lovers, first-time sexual discovery, and of course a happy ending. 85,000 words.",
  "genres": [
    "Historical",
    "Romance",
    "M M Romance",
    "Pirates",
    "Enemies To Lovers",
    "Historical Romance",
    "Historical Fiction"
  ],
  "author": "Keira Andrews",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/36460886-kidnapped-by-the-pirate"
}