{
  "title": "Forbidden Puck",
  "description": "Waiting for the right guy.\n\nElla Couture didn't mean to save herself. But success runs in the family and Ella, a fiery and self-made interior decorator, never wanted to settle for anything less than a quality man. But another disappointing breakup has Ella flirting with idea of a meaningless fling – because this whole v-card business has gone on for way too long. When Ella visits her brother Lance for the weekend, she finds herself all alone with his teammate, Ryan. The rugged hockey star is tall, chiseled and gorgeous – and based on his past, he won't get attached. It's a nice fantasy... but Ella isn't the type of girl to sleep with her brother's best friend.  That's what she keeps telling herself, anyway... \n\nLive by the code, die by the code.\n\nOn the ice, tough guy Ryan Ryder enforces the code of the game with his fists. And he won't let anyone mess with the team's superstar center, Lance Couture. Ryan might sleep around, but he knows to keep his distance when Lance's sister visits the two roommates at their Boston condo. The code has a rule about family members, after all: they're strictly off-limits. Not that Ryan's worried about breaking that rule – he's already heard an earful about how insane his best bud's younger sis is. But Lance never said anything about Ella being a cute babe with an adorable laugh.  And he definitely never said anything about how she's finally ready to lose her v-card...  But if Ryan can't keep his hands off Ella, not only will he stab his best friend in the back – he'll ruin everything he's worked for.  So why can't he get that girl out of his mind? \nForbidden Puck is a 60,000 word, slow-burn hockey romance! This stand-alone novel is the first entry in the Boston Brawlers series. Narrated in alternating first person. No cheating, no cliffhanger, HEA guaranteed.",
  "genres": [
    "Hockey",
    "Romance",
    "Sports Romance",
    "Sports",
    "Audiobook",
    "Contemporary Romance",
    "Contemporary"
  ],
  "author": "June Winters",
  "average_rating": "3.55",
  "url": "https://www.goodreads.com/book/show/36471858-forbidden-puck"
}