{
  "title": "The Way I See It: A Gauri Lankesh Reader",
  "description": "DC Books and Navayana are proud to announce The Way I See It: A Gauri Lankesh Reader. It takes an assassination these days for us to sit up, get the full measure of the life and work of a person, and cherish her for it. A late start, in the grisliest sense. Yet, two years before her killing, Gauri Lankesh wrote: “No one knows who will gain materially by Kalburgi’s death. But it is clear that it is the right-wing fascist forces that will gain ideologically when reformist voices such as Basavanna’s and Kalburgi’s are brutally and fatally shut down. Ideas, however, never die.”The prospect of getting her own name on this list did not deter her. A selfish silence that values personal comfort over facing down bullies was never an option. We are left with her ideas, her words—like with Basava and Kalburgi. As a journalist and social activist, Gauri Lankesh (1962–2017) joined the battle against not just Hindutva but all forms of bigotry and obscurantism. As the editor of Gauri Lankesh Patrike, a major political weekly in Kannada, she hosted critical discussions on a range of compelling social, cultural and political issues. Activists from different spheres of social struggle found a ready ally in her.The life and work of Gauri inspire those who still care to speak the truth, especially conveying it to power. Hence this reader compiled by Chandan Gowda, a scholar-translator who had been her friend for over two decades. The Way I See It collects the best of Gauri’s writings translated from Kannada, her work in English, as well as the remembrances of people who knew her well, each in their own way.Says Chandan Gowda, “The book brings together select political and cultural writings of the courageous activist-journalist. Published over the last two decades, these writings, many of which were originally written in Kannada, offer a rich introduction to her varied political commitments and cultural interests. Her political journalism reveals a constant concern for the fate of India’s democracy and an unswerving passion for social justice. Gauri’s essays in the autobiographical mode also illustrate the affection and seriousness she brought to human relationships.”Kavitha Lankesh, whose kind permission made this work possible, says: “Anyone who cherishes and respects India’s diversity will find this book valuable. India belongs not just to the socially privileged classes but to its marginalized sections as well: women, Muslims, Dalits, tribals, among others. If we aspire that our children live to respect the many voices of our country, people like Gauri should be heard.”",
  "genres": [
    "India",
    "Feminism",
    "Nonfiction",
    "Journalism"
  ],
  "author": "Gauri Lankesh",
  "average_rating": "4.46",
  "url": "https://www.goodreads.com/book/show/36477816-the-way-i-see-it"
}