{
  "title": "Kissed by Trouble: Der Schatz von Akkad",
  "description": "Sie ist blond * Sie ist sexy * Sie ist Privatdetektivin \n   Nach einem Unfall fängt Troja noch einmal neu an und macht sich als Privatdetektivin selbstständig. Doch das ist alles andere als einfach, denn zahlende Klienten und seriöse Aufträge sind dünn gesät, und als Blondine hat man es ganz und gar nicht leicht im harten Detektivalltag. Trojas Karriere nimmt allerdings rasant Fahrt auf, nachdem sie bei dem exzentrischen Witwer Titus Conti als Mitbewohnerin eingezogen ist. Ehe sie sichs versieht, steckt sie mitten drin in einem seltsamen Fall von Kunstraub, hinter dem sich weit mehr verbirgt, als es auf den ersten Blick scheint, geheimnisvolle Bad-Boys, viel zu attraktive Millionäre, heiße Bodyguards und ein kostbarer Schatz inbegriffen. Titus Conti hat einen schweren Verlust erlitten. Er will sich nie wieder an einen Menschen oder an ein Lebewesen binden. Als Troja bei ihm einzieht, ahnt er noch nicht, dass sein zurückgezogenes Dasein definitiv zu Ende ist. Der geheimnisvolle El Cid, seines Zeichens Gangster und Bösewicht, hat sich auf den ersten Blick in die wilde Blondine verliebt. Noch ahnt er nicht, dass die besagte Blondine all seine Pläne durchkreuzen wird. Andrej Sorokin ist ein stinkreicher Herzensbrecher. Sein Verschleiß an Frauen ist fast genau so legendär, wie seine Liebe zur Kunst und seine Bereitschaft alles dafür aufs Spiel zu setzen. Er ahnt nicht, dass er dieses Mal zu viel riskiert hat.        frech * frivol * spannend   Kissed by Trouble ist ein romantischer Thriller, ein spritziger Krimi und eine Liebesgeschichte mit einem winzigen Hauch Erotik.  Kissed by Trouble ist eine neue Serie von Clannon Miller. Jeder Roman dreht sich um einen abgeschlossenen Fall, aber Trojas private Geschichte geht im folgenden Teil weiter.",
  "genres": [
    "Crime"
  ],
  "author": "Clannon Miller",
  "average_rating": "4.34",
  "url": "https://www.goodreads.com/book/show/36468044-kissed-by-trouble"
}