{
  "title": "The Dragon King",
  "description": "Millennia ago, in the time of dragons, love and hate colored the very air monsters breathed. Ancient sorcery coursed through powerful wings like blood, pumped by hearts of magic, and timeless beasts of lore soared over the landscape, terrible and wondrous. Amidst these beasts of yesteryear, a forbidden love bloomed. A child was born of this love. But misfortune struck, and a murder rocked the world of the leviathans, tearing the family apart. Years piled atop this monumental death, legends faded and myths were twisted, and time made labyrinths of memories long gone.  Now, in the heart of one of America’s busiest cities, thrives a young woman with no last name. Evangeline is from a time before human tradition and provincialism. She is strong, born of legendary parents, and trained by the hard luck of solitary existence and sheer willpower. When she learns that she has a fate beyond her control as queen to one of the Thirteen Kings – she rebels. Eva refuses to yield despite the king’s tall, strong bearing, vivid gray eyes that see through her, and voice that commands the very elements. She refuses him, not only because of who she is – but because of who he is.  The catastrophically charismatic Dragon King bent on claiming her is none other than the man who murdered her father thousands of years ago.  But a primordial sleeping force has awakened to finally wreak dark havoc upon the world, and a Traitor to the Kings has returned to hunt Evangeline down. As her life spins out of control, Eva learns that not even her beliefs about the Dragon King are guaranteed. Nothing is black and white. And ultimately, Eva finds herself trapped: Between cruel, heartless evil on one side – and the love of an ancient, dark, and beautiful man on the other.  The Dragon King is book twelve in The Kings series, and follows The Nightmare King, by New York Times and USA Today bestselling author, Heather Killough-Walden.",
  "genres": [
    "Paranormal Romance",
    "Paranormal",
    "Fantasy",
    "Dragons",
    "Romance",
    "Magic",
    "Shapeshifters"
  ],
  "author": "Heather Killough-Walden",
  "average_rating": "4.52",
  "url": "https://www.goodreads.com/book/show/36477115-the-dragon-king"
}