{
  "title": "I nattens mulm en skønne dag",
  "description": "You rated 4/5 Stars.0.5/5.01/51.5/5.02/52.5/5.03/53.5/5.04/54.5/5.05/5clear ratingHvis det er sandt, som forfatteren påstår, at romanen bygger på en sand historie, så ville jeg sandelig gerne have været med til den fest, for der må siges at have været gang i den.Klassejubilæet er arrangeret af Gavin, der på ingen måde gjorde sig synderligt bemærket i skolen. Faktisk kan ingen af de inviterede huske ham særlig godt, men en gratis fest med fri bar siger man ikke nej til.Gavin er kommet til penge. Hans nyeste idé er at indrette en udrangeret boreplatform til et feriep... (show more)Hvis det er sandt, som forfatteren påstår, at romanen bygger på en sand historie, så ville jeg sandelig gerne have været med til den fest, for der må siges at have været gang i den.Klassejubilæet er arrangeret af Gavin, der på ingen måde gjorde sig synderligt bemærket i skolen. Faktisk kan ingen af de inviterede huske ham særlig godt, men en gratis fest med fri bar siger man ikke nej til.Gavin er kommet til penge. Hans nyeste idé er at indrette en udrangeret boreplatform til et ferieparadis, hvor turister kan få en luksusferie med al den komfort, de er vant til uden at blive generet af lokalbefolkningen. For at stive sin selvtillid af og prale med, hvor godt det er gået ham, inviterer Gavin sine gamle klassekammerater til at afprøve det knapt færdigbyggede ferieparadis. En terrorgruppe bestående af en bande ualmindeligt uheldige og amatøragtige lejesoldater forsøger at tage selskabet som gidsler, fordi de tror, at det er velhavende investorer, som de kan score kassen på. Da nogle af festdeltagerne sætter sig op imod de svært bevæbnede forbrydere, udvikler det hele sig fuldstændig vanvittigt i bedste kaotiske “Die Hard “-stil med masser af skyderi og fart over feltet",
  "genres": [
    "Fiction",
    "Crime",
    "Humor",
    "Mystery",
    "Thriller",
    "Scotland",
    "Comedy"
  ],
  "author": "Christopher Brookmyre",
  "average_rating": "4.16",
  "url": "https://www.goodreads.com/book/show/12196293-i-nattens-mulm-en-sk-nne-dag"
}