{
  "title": "The Five",
  "description": "Flea wasn’t sure what was worse, that the Goddess of All Creation wanted her to save the world from a primordial evil about to be released from the underworld, or that She’d decreed Flea must forge a loving bond with four magical sons to do it.Not that she didn’t think she was brave enough. She was. But she only had her mind-reading magic and some fighting skills to call on. How either could help her against a creature without a mind or a body, she didn’t know. Then there was the idea of marrying four strangers... all right, three strangers and her best friend, Zem. Flea didn’t even like sex! Being raped at fourteen can do that to a girl. And if she could manage the marriage bed, there was even worse to consider—finding a way to love them all and get them to love her. After all, she wasn’t Airsha. She wasn’t a compassionate, caring and lovable person. She barely knew what love was. And this was one situation she couldn’t con her way out of, or through. So, basically, with all things considered, the world didn’t have a chance if it was depending on her to save the day. The Goddess really got it wrong this time!\nIf you aren’t into love stories with lots of steam don’t read this book. If you aren’t interested in fast-paced, exciting stories with lots of twists and turns, don’t read this book. If you’re open-minded about how love is expressed (at least in fiction) and don’t mind staying up late to read just one more chapter... read this book now! And if you’re ready to add another man into the bedroom, read the next book. Then, if you’re up for more excitement and can handle MMFMM action (one woman four men)—always tastefully done, of course—then read the third book. And if you don’t like steamy sex but do like a great story, speed read through the sex scenes. Just because they’re there doesn’t mean you have to read them, after all!",
  "genres": [
    "Reverse Harem",
    "Magic",
    "Fantasy"
  ],
  "author": "Nhys Glover",
  "average_rating": "3.74",
  "url": "https://www.goodreads.com/book/show/36466556-the-five"
}