{
  "title": "Escape",
  "description": "Everything inside of him is screaming that he needs to run, he needs to go, he needs to escape.Lane Warner is used to being overshadowed and overlooked.After all, he’s the youngest brother and the most laid back one in the family. He’s the one known for going with the flow and not making waves, even when things seem to be at their worst.Very few things in life have had the ability to rile Lane up and get under his skin. At the top of that list is his childhood friend Brynn Fox…no…Brynn Warner. The fact that they share a last name was the one thing that has the power to light him up and spin him out of control like no other. There was no calm, cool and collected when it comes to all the reasons why Brynn had to become part of his family.It’s slowly killing him to keep wanting what he can’t have, so Lane sees only one way to stop himself from doing something they’ll both regret…he has to leave.Everything inside of her is calling out to find him, to follow, to bring him home.Brynn Warner is used to being stuck between a rock and a hard place.After all, she’s the daughter of an unrepentant gold-digger who never once blinked at being the cause of her daughter’s pain and suffering.Very few things in her life have ever brought happiness and a sense of security. At the very top of that list is Lane Warner. She has unwaveringly loved the youngest Warner since the first minute she laid eyes on him. He was everything Brynn ever wanted and everything she knew she could never have.Sometimes the right choice is the one that hurts the most and Brynn’s had to make a few that felt like they might be the end of her.When Lane takes off, one thing is clear, the only choice Brynn has is to go after him.She’s going to bring her wayward cowboy home….whatever it takes.",
  "genres": [
    "Romance",
    "Contemporary Romance",
    "Contemporary",
    "Friends To Lovers",
    "Westerns",
    "Adult",
    "Audiobook"
  ],
  "author": "Jay Crownover",
  "average_rating": "4.11",
  "url": "https://www.goodreads.com/book/show/36480886-escape"
}