{
  "title": "Prediction Machines: The Simple Economics of Artificial Intelligence",
  "description": "\"What does AI mean for your business? Read this book to find out.\" -- Hal Varian, Chief Economist, GoogleArtificial intelligence does the seemingly impossible, magically bringing machines to life--driving cars, trading stocks, and teaching children. But facing the sea change that AI will bring can be paralyzing. How should companies set strategies, governments design policies, and people plan their lives for a world so different from what we know? In the face of such uncertainty, many analysts either cower in fear or predict an impossibly sunny future.But in Prediction Machines, three eminent economists recast the rise of AI as a drop in the cost of prediction. With this single, masterful stroke, they lift the curtain on the AI-is-magic hype and show how basic tools from economics provide clarity about the AI revolution and a basis for action by CEOs, managers, policy makers, investors, and entrepreneurs.When AI is framed as cheap prediction, its extraordinary potential becomes Prediction is at the heart of making decisions under uncertainty. Our businesses and personal lives are riddled with such decisions.Prediction tools increase productivity--operating machines, handling documents, communicating with customers.Uncertainty constrains strategy. Better prediction creates opportunities for new business structures and strategies to compete.Penetrating, fun, and always insightful and practical, Prediction Machines follows its inescapable logic to explain how to navigate the changes on the horizon. The impact of AI will be profound, but the economic framework for understanding it is surprisingly simple.",
  "genres": [
    "Artificial Intelligence",
    "Business",
    "Nonfiction",
    "Economics",
    "Technology",
    "Science",
    "Audiobook"
  ],
  "author": "Ajay Agrawal",
  "average_rating": "3.87",
  "url": "https://www.goodreads.com/book/show/36484703-prediction-machines"
}