{
  "title": "Strategy Strikes Back: How Star Wars Explains Modern Military Conflict",
  "description": "The most successful film franchise of all time, Star Wars thrillingly depicts an epic multigenerational conflict fought a long time ago in a galaxy far, far away. But the Star Wars saga has as much to say about successful strategies and real-life warfare waged in our own time and place. Strategy Strikes Back  brings together over thirty of today’s top military and strategic experts, including generals, policy advisors, seasoned diplomats, counterinsurgency strategists, science fiction writers, war journalists, and ground‑level military officers, to explain the strategy and the art of war by way of the Star Wars films.Each chapter of Strategy Strikes Back provides a relatable, outside‑the‑box way to simplify and clarify the complexities of modern military conflict. A chapter on the case for planet building on the forest moon of Endor by World War Z author Max Brooks offers a unique way to understand our own sustained engagement in war-ravaged societies such as Afghanistan. Another chapter on the counterinsurgency waged by Darth Vader against the Rebellion sheds light on the logic behind past military incursions in Iraq. Whether using the destruction of Alderaan as a means to explore the political implications of targeting civilians, examining the pivotal decisions made by Yoda and the Jedi Council to differentiate strategic leadership in theory and in practice, or considering the ruthlessness of Imperial leaders to explain the toxicity of top-down leadership in times of war and battle, Strategy Strikes Back gives fans of Star Wars and aspiring military minds alike an inspiring and entertaining means of understanding many facets of modern warfare. It is a book as captivating and enthralling as Star Wars itself.",
  "genres": [
    "Military Fiction",
    "Science Fiction",
    "Star Wars",
    "War",
    "Leadership",
    "Politics",
    "Military History"
  ],
  "author": "Max Brooks",
  "average_rating": "3.96",
  "url": "https://www.goodreads.com/book/show/36478363-strategy-strikes-back"
}